{"green tea ice cream lychee": [], "red bean ice cream banana": [], "lychee ice cream red bean paste": [], "strawberry ice cream kiwi": [], "mango ice cream strawberry": [], "chocolate ice cream cheesecake": [], "vanilla ice cream nutella": [{"excerpts": ["We ordered the vanilla ice cream nutella crepe with mangoes ($6.35): ", "http://www.yelp.com/biz_photos/83dXgt2nG98JJG2F7ai8AQ?select=0YqtK-_Mf_7saEqAC2udSQ\n", "It was actually quite delicious; nutella makes everything better! ", "The crepe cone was nice and crisp, and not too hard. ", "It tasted really good with the ice cream and mangoes. "], "author": "Cat H.", "review": "With a name like Genki Crepe, I had imagined a little shop that sold desserts and probably drinks like pearl milk tea. I was surprised to see that it was actually a dessert place and japanese mini mart all rolled into one. \n\nWe came here for dessert after having dinner across the street at Burma Superstar. The store didn't have many people inside before dinner, but boy was it crowded when we went afterward! There were lots of high school kids hanging out outside, and a throng of people inside eating crepes, ordering crepes, and waiting for crepes! \n\nWe ordered the vanilla ice cream nutella crepe with mangoes ($6.35): http://www.yelp.com/biz_photos/83dXgt2nG98JJG2F7ai8AQ?select=0YqtK-_Mf_7saEqAC2udSQ\nIt was actually quite delicious; nutella makes everything better! The crepe cone was nice and crisp, and not too hard. It tasted really good with the ice cream and mangoes. There's a bench inside the store and one outside to sit on, if you can snag a seat when it's crowded. \n\nIt took about 10 minutes to get our crepe since there were so many orders ahead of us. There were 5 people making the desserts and 1 person manning the cash register and taking orders. I like how there's a mini mart here. There were drinks, food, sauces, candy, assorted ramen, bags, toys, and toiletries--just in case!\n\nThey also sell egg puffs in a variety of flavors. I enjoyed my crepe, so I will be back to try a different flavor next time or maybe some of those egg puffs!", "rating": 4, "date": "2010-05-14"}], "spinach mushroom cheese": [], "avocado tomato cheese": [], "ham cheese lettuce mayo": [], "ham pineapple mozzarella": [], "tuna salad cheese lettuce": [], "turkeyavocado jack cheese sour cream": [], "smoked salmon red onion cream cheese wasabi": [], "tomato corn cheese": [], "beef sukiyaki green onion cheese": [], "chicken green onion cheese sweet chilli sauce": [], "red bean paste": [{"excerpts": ["I got the green tea ice cream + red bean paste crepe which was DELICIOUS. ", "The green tea ice cream was creamy and authentic-tasting; and I liked how they layered the red bean paste within the folds of the crepe. ", "The crepe was the right amount of crispiness and freshness - right off the pan. "], "author": "Tina C.", "review": "I got the green tea ice cream + red bean paste crepe which was DELICIOUS. The green tea ice cream was creamy and authentic-tasting; and I liked how they layered the red bean paste within the folds of the crepe. The crepe was the right amount of crispiness and freshness - right off the pan. The warmth and crunchiness of the crepe complimented the coolness and smoothness of the ice cream well. \n\nLet's talk about the location. It's near a bunch of great restaurants and a farmer's market was wrapping up when we stopped by on Sunday. Perhaps a bit ambitious, but my fam and I walked to the Conservatory of Flowers after stuffing ourselves with crepes. If I'm ever in the area again, I definitely plan to try one of their fruit crepes! The only downside is their ambiance. Though they are uniquely and conveniently located within a mini mart, crepes are their main attraction and they would go far with some small tables and chairs. Perhaps the rustic feel adds to their charm. Summary: food 5/5, ambiance 2.5/5, service 3/5.", "rating": 4, "date": "2018-03-26"}, {"excerpts": ["Below is the green tea ice cream with red bean paste. ", "#2 on the menu. ", "Comes with whip ", "but I opted out. ", "Genki Crepes is a classic in the Richmond District and will be treasured forever!"], "author": "Caitlyn S.", "review": "I love Genki Crepes! They have so many options for dessert and crepe toppings. The crepes are so crispy and filling. They also sell the spicy noodle challenge noodles here, I think it's $7 for the 5 pack! Their snack selection is also amazing. They also sell Ramune, the marble soda. Below is the green tea ice cream with red bean paste. #2 on the menu. Comes with whip but I opted out. Genki Crepes is a classic in the Richmond District and will be treasured forever!", "rating": 5, "date": "2018-03-25"}, {"excerpts": ["However, red bean paste is too sweet for me. ", "I want to try the sesame egg puff too ", "but since they don't combine it with ice cream, I just ordered matcha in a cone."], "author": "Giang N.", "review": "I love matcha and I like the matcha ice cream here. Matcha ice cream is not super sweet like other places and you can actually taste the flavor. However, red bean paste is too sweet for me. I want to try the sesame egg puff too but since they don't combine it with ice cream, I just ordered matcha in a cone.", "rating": 5, "date": "2018-06-28"}, {"excerpts": ["I had the green tea ice cream crepe with red bean paste and whipped cream. ", "I was hesitant about eating this thing so close to my bedtime but it ended up being so worth it! ", "The crepe was quite big but gone so fast. ", "And the ice cream was amazing. ", "I was surprised how rich it was with matcha flavor. ", "I'm obsessed! ", "I did find that overall the crepe was a little too sweet for me. "], "author": "Lauren H.", "review": "I had the green tea ice cream crepe with red bean paste and whipped cream. I was hesitant about eating this thing so close to my bedtime but it ended up being so worth it! The crepe was quite big but gone so fast. And the ice cream was amazing. I was surprised how rich it was with matcha flavor. I'm obsessed! I did find that overall the crepe was a little too sweet for me. I would have it with water or tea the next time around. \n\nIt was also fun watching the crepe being made on the spot. I did wish that they scooped the ice cream later though instead of leaving the scoop of ice cream on the counter while prepping other ingredients. It was a sticky, drippy mess at the end when I peeled away the paper wrapping to get at that last bit. I thought I was gobbling it up pretty fast. My caution to you is to be wary of melting and have napkins on hand!", "rating": 4, "date": "2017-03-25"}, {"excerpts": ["We ordered the green tea Ice cream with red bean paste, plus splurged on another order of egg puff (as a salute to my childhood, cuz I grew up eating egg puffs). ", "I was pleasant surprised by the green tea ice cream! ", "I could really taste the green tea, and that went really well with the red bean paste. "], "author": "Mei W.", "review": "What a great find! My sweetheart brought me here to try their ice cream filled crepes, and it sure didn't disappoint. We ordered the green tea Ice cream with red bean paste, plus splurged on another order of egg puff (as a salute to my childhood, cuz I grew up eating egg puffs). I was pleasant surprised by the green tea ice cream! I could really taste the green tea, and that went really well with the red bean paste. The crepe on the outside was cooked very well with a bit of crunch. \n\nThe egg puff was a perfect rendition of the egg puff of my childhood; crunchy outside and soft on the inside. Next time I'm going to try the red bean filled egg puff. I can't want to come back and sample more stuff!", "rating": 5, "date": "2017-07-03"}, {"excerpts": ["I tried the crepe #2, which was green tea ice cream with red bean paste and whipped cream. ", "It was yummy and had a great portion size. ", "I also tried the original egg puffs and they were delicious!! ", "They were crispy on the outside and soft on the inside. "], "author": "Letty H.", "review": "Delicious dessert place! If you're looking for a quick fix, this is the place to go! There's aren't any tables in there but there are some benches inside & outside, that were pretty full on a Saturday night. It's street parking so it can be a little difficult. \n\nI tried the crepe #2, which was green tea ice cream with red bean paste and whipped cream. It was yummy and had a great portion size. I also tried the original egg puffs and they were delicious!! They were crispy on the outside and soft on the inside. Even though I was so full, I kept wanting to eat more. \n\nThe service was incredibly friendly and they were quick to make everything. While we were waiting, we just walked around the store because there are many snacks from Asia :) I highly recommend coming here for some quick dessert- definitely try the egg puffs!", "rating": 5, "date": "2016-10-16"}, {"excerpts": ["We got no.2 it came with red bean paste and green tea ice-cream also no.7 ", "(Cheesecake+ Choc Ice-Cream). ", "2.5/5 ", "The taste was not interesting and too sweet. ", "For sure cannot bring us back again!"], "author": "V J.", "review": "We got no.2 it came with red bean paste and green tea ice-cream also no.7 (Cheesecake+ Choc Ice-Cream). 2.5/5 The taste was not interesting and too sweet. For sure cannot bring us back again!", "rating": 3, "date": "2017-10-16"}, {"excerpts": ["My friend has gotten the adzuki (red bean paste) crepe, which is really good too. ", "The last time I went my crepe wasn't hot/warm, but I still would give a solid 5 because they're that yummy!! ", "10/10 would recommend."], "author": "Catherine T.", "review": "Hands down my favorite crepe place ever! Even though traditional crepes are served soft and not in conical form, the crispy crepe is so much tastier to me. The past two times I've gone to Genki, I've ordered the banana and Nutella crepe and it's super delicious. My friend has gotten the adzuki (red bean paste) crepe, which is really good too. The last time I went my crepe wasn't hot/warm, but I still would give a solid 5 because they're that yummy!! 10/10 would recommend.", "rating": 5, "date": "2017-07-08"}, {"excerpts": ["I am a major green tea fan, so I got the green tea ice cream with red bean paste. ", "My friends got the banana crepe with strawberry ice cream and the banana crepe with caramel syrup. ", "They both praised the quality and the deliciousness of the dessert. ", "Honestly, you can't go wrong with anything on the menu! \n", "The only downfall about this place is that it's cash only. ", "I personally never carry any cash, so my friend had to spot me. ", "So minus one star for that. ", "Other than that, I would highly recommend coming to this place!"], "author": "Shelly S.", "review": "This is my favorite to go place in SF for crepe! The skin of the crepe is so crispy it's making my mouth water as I type this review. \nGenki is located inside a mini asian market. The menu has a large varieties of crepes! From savory to dessert. \nI came here for dessert after eating around the area. I am a major green tea fan, so I got the green tea ice cream with red bean paste. My friends got the banana crepe with strawberry ice cream and the banana crepe with caramel syrup. They both praised the quality and the deliciousness of the dessert. Honestly, you can't go wrong with anything on the menu! \nThe only downfall about this place is that it's cash only. I personally never carry any cash, so my friend had to spot me. So minus one star for that. Other than that, I would highly recommend coming to this place!", "rating": 4, "date": "2015-11-12"}, {"excerpts": ["My favorite is the green tea ice cream with red bean paste! ", "If its too cold, the strawberry and nutella or the egg puffs are a good alternative. ", "They also have green tea kitkats and all sorts of Japanese snacks and sweets. ", "I would pass on getting the smoothies or boba, there are better places along Clement."], "author": "Tiffany H.", "review": "Great little Japanese market that sells stellar dessert crepes. \n\nMy favorite is the green tea ice cream with red bean paste! If its too cold, the strawberry and nutella or the egg puffs are a good alternative. They also have green tea kitkats and all sorts of Japanese snacks and sweets. I would pass on getting the smoothies or boba, there are better places along Clement.", "rating": 4, "date": "2017-02-25"}, {"excerpts": ["I got a crepe with green tea ice cream, red bean paste, and whipped cream. ", "It was really delicious and this place never disappoints. ", "The only downside of this place is the little amount of seating and small area available. ", "Of course I guess I can't complain since it's supposed to be a small market. ", "But hands down, my favorite place to get a crepe in SF."], "author": "Annie H.", "review": "I love the crepes that they serve here. I like how they make the crepe skin so crispy. I got a crepe with green tea ice cream, red bean paste, and whipped cream. It was really delicious and this place never disappoints. The only downside of this place is the little amount of seating and small area available. Of course I guess I can't complain since it's supposed to be a small market. But hands down, my favorite place to get a crepe in SF.", "rating": 4, "date": "2016-07-25"}, {"excerpts": ["My sister ordered a green tea ice cream & red bean paste crepe, I ordered a banana, honey & almond crepe, and my best friend ordered a banana custard crepe. ", "The batter is really crunchy ", "and it's super sweet. "], "author": "Jerianne G.", "review": "Oh my, after all the hype with this place, it's about time I finally tried it!\n\nI came here with my best friend and siblings on a semi-warm afternoon. After having a filling lunch, of course we'd be down for some sweet treats. And naturally, genkis came to mind since I never tried it before. Note: parking is really  scarce here. If you're lucky, you'll prolly find parking by the meter. But if not, residential is your best bet.\n\nI was surprised to find that it was connected to a mini market. I had the idea that it was it's own store, but it's okay, it's pretty convenient. \n\nMy sister ordered a green tea ice cream & red bean paste crepe, I ordered a banana, honey & almond crepe, and my best friend ordered a banana custard crepe. The batter is really crunchy and it's super sweet. It definitely works with the condiments :)\n\nSucks though cuz they only accept cash :(.\n\nDefinitely will come back to try the rest!", "rating": 4, "date": "2012-03-26"}, {"excerpts": ["The restaurant portion is tucked in the front corner of the store, where you can order a plethora of crepes and ice cream - everything from traditional American flavours to more uncommon ones like Green Tea Ice Cream and Red Bean Paste. ", "I ordered a Chocolate Ice Cream and Cheesecake Crepe, which turned out to be a massive crepe in the shape of an ice cream cone (about the size of a football), stuffed with chocolate ice cream and cheesecake. ", "It's definitely not your traditional crepe, but it's the best one i've ever had by far. ", "I would do anything to go back to San Francisco and get another one."], "author": "Carolina S.", "review": "I never would have guessed that my favourite dessert in San Francisco would have come from a small Chinese grocery store. The restaurant portion is tucked in the front corner of the store, where you can order a plethora of crepes and ice cream - everything from traditional American flavours to more uncommon ones like Green Tea Ice Cream and Red Bean Paste. I ordered a Chocolate Ice Cream and Cheesecake Crepe, which turned out to be a massive crepe in the shape of an ice cream cone (about the size of a football), stuffed with chocolate ice cream and cheesecake. It's definitely not your traditional crepe, but it's the best one i've ever had by far. I would do anything to go back to San Francisco and get another one.", "rating": 5, "date": "2015-08-24"}, {"excerpts": ["They also have premade combinations of crepes, and the green tea ice cream/red bean paste is on the top of my list. "], "author": "Linh H.", "review": "Ahhhh! I'm so surprised I haven't written a review for Genki Crepes yet. I've been going here for the past 3 to 4 years, and it's hands down my favorite crepe place. EVER. \n\nI love how the crepe itself comes out CRISPY, warm, and sweet. Theres a wide selection of toppings and ice cream you can put inside your crepe, BUT THEIR WHIPPED CREAM IS FREAKING ON POINT AND TO DIE FOR. They also have premade combinations of crepes, and the green tea ice cream/red bean paste is on the top of my list. I alternate between that one and a vanilla ice creme/nutella/banana + whipped cream crepe!\n\nThis place is also a cute little Japanese markets that sells things like green tea Kitkats and Pocky all the way to Gatsy hair products and Shiseido face masks. They also sell the POP! vinyl figures that I collect. yay!", "rating": 5, "date": "2014-02-24"}, {"excerpts": ["Got the Crepe with Lychee ice-cream smothered in custard, the Crepe with Green tea ice-cream and red bean paste, warm fresh Vanilla Egg Puffs and the Thai Tea milkshake.\n\n"], "author": "Letitia L.", "review": "Came here after dinner at Troya with the fam.  Got the Crepe with Lychee ice-cream smothered in custard, the Crepe with Green tea ice-cream and red bean paste, warm fresh Vanilla Egg Puffs and the Thai Tea milkshake.\n\nCrepes don't taste entirely fresh and soft, but the ice-cream and sauces in it are SO good.  4.5 stars.", "rating": 4, "date": "2014-06-13"}, {"excerpts": ["Green tea ice cream with red bean paste crepe was good! ", "The ice cream had more of a natural tea flavor rather than the usual sweet/cream flavor which I liked. ", "The red bean was evenly distributed and the crepe itself wasn't too hard or soft. ", "Good assortment of Pocky and other Asian snacks to buy."], "author": "Josh L.", "review": "Green tea ice cream with red bean paste crepe was good! The ice cream had more of a natural tea flavor rather than the usual sweet/cream flavor which I liked. The red bean was evenly distributed and the crepe itself wasn't too hard or soft. Good assortment of Pocky and other Asian snacks to buy.", "rating": 4, "date": "2014-04-04"}, {"excerpts": ["I forgot what I ordered the first time, but this time I ordered #2 (green tea ice cream with either lychee or red bean paste). ", "I think I would prefer to have green tea ice cream with red bean paste though.\n\n"], "author": "Sofia R.", "review": "I've been to Genki's Crepes twice. Mainly for crepes.\n\nI forgot what I ordered the first time, but this time I ordered #2 (green tea ice cream with either lychee or red bean paste). I opted for lychee based on my friend's recommendation.\n\nThe crepe itself didn't take too long to be ready. They give you a generous amount of ice cream and they put fruits both on top of the crepe and at the bottom of the crepe which is nice. I've never had lychee with green tea before but the combo isn't bad. I think I would prefer to have green tea ice cream with red bean paste though.\n\nI like Genki's crepes because they make their crepes crispy. Other people might like softer crepe, but I like it crispy. This is the only other place that sells crepes that I approve of.\n\nI like that they sell Asian snacks in the store too. I was so stoked to get green tea kit kats. They weren't there though....so I got oreo candy bars and oreo matcha green tea sticks. The snacks are pretty cheap and the novelty items are fun to look at.\n\nOverall, okay place. I like it there.", "rating": 4, "date": "2011-12-11"}, {"excerpts": ["We got two beef sukiyaki crepes for dinner (since they're the sauciest, the other savory ones taste more like sandwiches) and shared a green tea with red bean paste crepe for dessert. ", "So, so, so yummy! ", "The size is perfect and there's enough content inside to just fill you up and be satisfied. \n", "We gotta come back and try their eggettes sometime!"], "author": "Justine P.", "review": "I always want to come to this place when I'm in the area with my friends! \nMy friend says that this place is usually pretty packed, but it's worth it. Their crepes, both sweet and savory, is amazing. We got two beef sukiyaki crepes for dinner (since they're the sauciest, the other savory ones taste more like sandwiches) and shared a green tea with red bean paste crepe for dessert. So, so, so yummy! The size is perfect and there's enough content inside to just fill you up and be satisfied. \nWe gotta come back and try their eggettes sometime!", "rating": 4, "date": "2014-12-20"}, {"excerpts": ["GREEN TEA ICE CREAM + RED BEAN PASTE IN A CREPE?! "], "author": "Sandra N.", "review": "GREEN TEA ICE CREAM + RED BEAN PASTE IN A CREPE?! YES PLEASE!\n\nThe moment I saw that on the menu, I just knew I had to get it. Green tea and red bean is one of my favorite combos ever so I knew I'd love it. It definitely did not disappoint me! Seriously, it was DELICIOUS! It was fresh, not too sweet and had a perfect crisp. The amount of ice cream and red bean was perfect for the size of the crepe and the flavors were just awesome together!\n\nThere are so many different crepe combos here and most of them sound yummy so you will probably never run out of flavors to try. There are savory crepes, ice cream crepes, and snack crepes. With so many options, there has to be one that you will like :) I know I'll definitely be coming back to try out more crepes!", "rating": 4, "date": "2013-04-12"}, {"excerpts": ["Have I ever told you that I may indeed contain the personality of a five year old that is charmed by dollops of whipped cream on top of green tea ice cream with red bean paste?\n\n"], "author": "Liss T.", "review": "Crepes you say? There are crepes to be had? Count me in!\n\nHave I ever told you that I may indeed contain the personality of a five year old that is charmed by dollops of whipped cream on top of green tea ice cream with red bean paste?\n\nAnd the crepe, it was so crisssssppppyyyyyyyy. Combined with the softness of the ice cream. Magnifique! \n\nThe mini-mart was also pretty cool to to shop for the weeaboos in your life. \nI saw drinks and Japanese candies here I've only otherwise seen online or at conventions. A pretty whimsical/fun experience!", "rating": 5, "date": "2013-01-06"}, {"excerpts": ["I was with family and we ordered 1 crepe each for a total of 3 - red bean ice cream with bananas, green tea ice cream with red bean paste, and chocolate ice cream with cheesecake.\n\n"], "author": "Yan L.", "review": "I was with family and we ordered 1 crepe each for a total of 3 - red bean ice cream with bananas, green tea ice cream with red bean paste, and chocolate ice cream with cheesecake.\n\nI personally enjoyed the red bean ice cream and we all really liked the bread part! Hands down best I have ever had for.the breading part. The cheesecake wasn't the greatest... had better. Green tea ice cream was good, too, But my brother said he had better..\n\nOverall, I felt the one I got (red bean ice cream with bananas) were excellent! Would definitely go again to try the other ones out.", "rating": 4, "date": "2014-03-29"}, {"excerpts": ["I think my green tea ice cream with red bean paste crepe without whip cream was pretty decent. ", "The green tea ice cream was amazing! ", "Except that I kept dropping the ice cream as I bit the whole crepe. ", "So try not to eat the crepe too fast, or the stuff inside the crepe might drop. \n", "Um, my cousin didn't like her green tea ice cream with lychees ", "crepe as much as I did. ", "She said that the crepe itself was crispy but kind of salty... ", "But she loved the green tea ice cream and lychee. ", "She kept saying the ice cream didn't taste artificial and the lychees were so good even though they were canned lychees. \n", "The price is not that bad, crepes are kind of expensive overall. ", "It costed $10.77 for two ice cream crepes. \n", "Overall, if you don't mind cold and a bit salty crepe, you will enjoy Genki's crepe like I did. ", "Because my cousin's comment, I subtracted one star. ", "Oh, forgot to mention, the staffs were friendly too."], "author": "Yuy H.", "review": "I came here today with my cousin to try Genki's crepe. We ordered our crepes pretty fast since we already knew what we want. Then we wandered around the shop and found lot of amazing things! There were Japanese drinks, GLASS BOTTLE sprite (is that rare? I don't see it often, so I found it rare...), miso, candies, etc... There was no eggs though (me and my cousin were shopping for eggs for dinner, so yeah). \nFinally, we got our crepes after wandering around for 5-10 minutes. I think my green tea ice cream with red bean paste crepe without whip cream was pretty decent. The green tea ice cream was amazing! Except that I kept dropping the ice cream as I bit the whole crepe. So try not to eat the crepe too fast, or the stuff inside the crepe might drop. \nUm, my cousin didn't like her green tea ice cream with lychees crepe as much as I did. She said that the crepe itself was crispy but kind of salty... But she loved the green tea ice cream and lychee. She kept saying the ice cream didn't taste artificial and the lychees were so good even though they were canned lychees. \nThe price is not that bad, crepes are kind of expensive overall. It costed $10.77 for two ice cream crepes. \nOverall, if you don't mind cold and a bit salty crepe, you will enjoy Genki's crepe like I did. Because my cousin's comment, I subtracted one star. Oh, forgot to mention, the staffs were friendly too.", "rating": 4, "date": "2014-12-28"}, {"excerpts": ["I like getting the green tea ice cream with red bean paste too. ", "I agree with Cynthia C that it's not as good as Sophie's Crepes. ", "Their crepe is more dry and crunchy, and green tea ice cream is just not the same as green tea gelato. "], "author": "Tes Y.", "review": "I've been here twice. I like getting the green tea ice cream with red bean paste too. I agree with Cynthia C that it's not as good as Sophie's Crepes. Their crepe is more dry and crunchy, and green tea ice cream is just not the same as green tea gelato. It's alright for the price.\n\nThe place has an amazing variety of overpriced, Asian candy.", "rating": 3, "date": "2011-04-21"}, {"excerpts": ["The red bean paste they use is definitely high quality and they do not cheap out on the portions there. "], "author": "Amery Z.", "review": "This place is the Mecca of Japanese style crepes in my book. Not going to lie. I made an hour-long voyage to SF today from Oakland (yay for slow public transportation on Muni and Bart!) just to have a crepe from Genki today. They have a great variety of both sweet and hot crepes to try out, but my favorite one of all has to be their Green Tea with Red Bean. The red bean paste they use is definitely high quality and they do not cheap out on the portions there. The whipped cream that comes with it also acts a great complement. \n\nCustomer service is great here; definitely service with a smile. There was quite a number of people waiting for their crepe as I ordered mine, but my order was completed in less than 5 minutes. Only drawback folks is although they do accept debit/credit cards, there IS a $10 MINIMUM. So bring that cash unless you plan on buying more!  \n\nAlthough Genki is a little further out than the popular Sophie's Crepes in Japantown, I would say that the extra 15 minute bus ride on Geary Blvd is worth it. You get a wonderful value (their Green Tea Crepe is two dollars less!), large portions, AND most importantly, a satisfied sweet tooth.", "rating": 5, "date": "2012-11-18"}, {"excerpts": ["i'll have them add red bean paste to it..\n\n"], "author": "Raquel T.", "review": "i love this place.. whenever i'm craving a crepe this is where i want it from.. i've been to a few other places in sf/la but they don't come close.. it's the crispy edges here that does it for me\n\nsome combo's i like:\n-lychee ice cream + custard + nutella \nnext time i'll have them add red bean paste to it..\n\n-mango ice cream + strawberry + banana + nutella + custard", "rating": 5, "date": "2014-10-07"}, {"excerpts": ["The last three times I've been here, I got the #2, which is green tea ice cream, whip cream and your choice of red bean paste or lychee.\n\n"], "author": "Michael T.", "review": "Crepes are great.\n\nThe last three times I've been here, I got the #2, which is green tea ice cream, whip cream and your choice of red bean paste or lychee.\n\nI also really like this place as a market too. It offers a wide variety of Japanese products including anime toys.", "rating": 4, "date": "2013-09-13"}, {"excerpts": ["Try the green tea ice cream with red bean paste - they're not heavy on the paste which I love. ", "The lychee ice cream crepe was amazing... so rich in lychee flavor! ", "I'm not a nutella fan ", "but I have heard nothing but great reviews for it here. "], "author": "Liana L.", "review": "Ooh they sure do know how to make one mean dessert crepe! I like how their crepes are balanced in terms of flavor - nothing so sweet that by the time you're done, you've got a stomache. \n\nTry the green tea ice cream with red bean paste - they're not heavy on the paste which I love. The lychee ice cream crepe was amazing... so rich in lychee flavor! I'm not a nutella fan but I have heard nothing but great reviews for it here. Eggettes (regular or chocolate) are always safe to get.\n\nOh and you know those yummy green tea kit kats that you can only find in Japan? Well, don't hate me for blasting the secret (or maybe it isn't a secret anymore) but they sell 'em here! Yup. But only if you can find them in the store...they sell out alot.", "rating": 4, "date": "2012-03-05"}, {"excerpts": ["I always get the Green Tea Ice Cream Crepe with Red Bean Paste and Whipped Cream, but there's plenty of options. ", "So goodd. ", "The portion is pretty big especially if you come here for dessert after dinner. ", "I came here after dinner with my girlfriend, and one order was enough for the two of us. "], "author": "Johnny L.", "review": "The place itself is inside a small market type ish store. Been here a few times, and I definitely have a favorite. I always get the Green Tea Ice Cream Crepe with Red Bean Paste and Whipped Cream, but there's plenty of options. So goodd. The portion is pretty big especially if you come here for dessert after dinner. I came here after dinner with my girlfriend, and one order was enough for the two of us. You can get this for around 5$ which is a great price for dessert for two.\n\nThis place has a minimum charge for credit/debit card, so bring cash.", "rating": 4, "date": "2012-03-24"}, {"excerpts": ["I got the Lychee ice cream crepe with Red Bean paste-Sounded delish.\n\n", "The rest of it was pretty good-Lychee ice cream was creamy and flavorful, red bean paste was a little hard ,though still tasteful especially towards the end of the crepe where the ice-cream and red bean paste melted to gather from the warmth of the crepe, end of crepe was soft and chewy.\n\n"], "author": "Shannon H.", "review": "This is based on the one crepe I tried today, that I would actually give 3 1/2 stars.\n\nStopped back in to try the crepes, being I was not able to last time, and unfortunately it was not as great as I had anticipated for.\n\nI got the Lychee ice cream crepe with Red Bean paste-Sounded delish.\n\nSo first off, I noticed the girl working the counter did not clean her hands to well after handling the cash register; it was a brisk run through the water (not good)\n\nIt was not long before I got my crepe. First I noticed that the crepe was a little to hard (maybe that's how it is supposed to be in order to stand up)I actually ended up just breaking off the hard shell part of the crepe. The rest of it was pretty good-Lychee ice cream was creamy and flavorful, red bean paste was a little hard ,though still tasteful especially towards the end of the crepe where the ice-cream and red bean paste melted to gather from the warmth of the crepe, end of crepe was soft and chewy.\n\nOverall I still do like this place, they have a ton of yummy treats to choose from and I have not tried the rest of there crepes.\n\nService is friendly, however I am a little worried about the cleanliness part. I have always thought there should be one person handling the food and the other working the register. Overall I would still come back for other treats, just a little disappointed with the crepe.", "rating": 3, "date": "2009-07-18"}, {"excerpts": ["Fantastic topping choices, from staples like nutella and whipped cream to Japanese favorites like red bean paste. ", "Delicious, perfect, hot, sweet, fresh crepe wrapping it all up. ", "And the bliss? "], "author": "Ashley L.", "review": "Dessert crepes from Genki are like tasty on top of awesome with a side of fantastic on a bed of delicious. Oh yeah, rounded out by bliss. Let me explain.\n\nTasty, classic American and Asian ice cream flavors to choose from. Fantastic topping choices, from staples like nutella and whipped cream to Japanese favorites like red bean paste. Delicious, perfect, hot, sweet, fresh crepe wrapping it all up. And the bliss? That's the harmony of enjoying it all in one hand-held dessert, AND knowing that there are (thousands? millions?) of possible flavor combinations just waiting for you to try.\n\nAs other reviewers have mentioned, your indulgence isn't cut short by Genki closing -- they're open pretty late and normally stay open on holidays. You may have to be patient for your creation, but fortunately there are shelves crammed with Japanese imports to peruse, and a large bulletin board filled with strange postings. The only downside is a lack of indoor seating upon which to savor your just-made scrumptious treat, but those witty people at Genki knew that your joy was likely to cause oversight in your normally perfectly clean and tidy eating habits, leading to all kinds of goodness spilling onto the sidewalk on Clement Street, instead of in their tiny store and cafe.\n\nThey do actually offer many options for savory crepes and even other food categories, but who are you kidding? If you're hungry, just get two desserts.", "rating": 5, "date": "2012-03-23"}, {"excerpts": ["The crepe was smothered with red bean paste and once it left the steel it was rolled up into a giant crepe cone. ", "Then they stick a huge scoop of lychee ice cream into the center to melt and top it off with soft whipped cream and whoomp there "], "author": "Daniel L.", "review": "Oh my goodness. I have been hearing about this place but finally was able to stop by after spending some time at Danube. There were so many kids and teenagers to show that this has to be the best candy store around town. Sure enough, after working my way through the creperie at the entrance, the rest of the store is a mini mart that sells more Asian and Japanese candies, chips and crackers, and mochi ice creams and sundaes than Nijiya or El Rancho 99. I was feeling right at home.\n\nIn addition to getting their fresh kiwi boba, my order of red beans and lychee ice cream crepe with house whipped cream was surprisingly good. The crepe was smothered with red bean paste and once it left the steel it was rolled up into a giant crepe cone. Then they stick a huge scoop of lychee ice cream into the center to melt and top it off with soft whipped cream and whoomp there it is. \n\n[Putting on my shades]\n\nParty people (Hollaring at the little kiddies in the store)\nYeah Yelp Elite Triple A music\nIn Full Effect\nThat's me DL the Triple A Yelp Supreme\nAnd my sweet palate Roll'n\nWe're kicking the flow we're milkin' the flow\nAnd it goes a little somethin' like this\n\nYelp Team back again\ncheck it to wreck it, let's begin\nParty on party people let me hear some noise\nDL's in the house jump jump rejoice\nThere's a party over here\na party over there\nWave your hands in the air\nWiggle your lil derrieres\nThese three words when you're gettin' busy\nWhoomp there it is\nHit me witha whip' cream\n\nWhoomp there it is [repeat 8x].\n\nUpside down and inside out\nI'm about to show all you folks\nWhat Asian crepes are all about\nNow it's time for the Triple A to get on the mic\nAnd make this sweet crepe a party hype\nI'm taking it back to the old school\n'Cause I'm a red been fool who's lychee cool\nIf you want to get down\nI'm gonna show you the way whoomp there it is\nLet me hear you say\n\nWhoomp there it is. \nCom'on y'all. \nWhoomp there it is. \nA lil loudar. \nWhoomp there it is. \n\nWhoomp sip a boba sip a boba sip a boba sip a [4x]\n\nPoint blank - bubble and juice I drinkin' \nAnd then invent as I puff on this pancake\nRock the mic, uh oh, I crave skin \nRip shoot, find a lychee dip to dip it into\nSlam dunk it, stick it, flip it and bite \nThat's Roll'n D-lish, Triple A oh my \nOoh, that's it, come on, come on \nWhoomp, there it is! I'm done.\n\nWhoomp there it is. \nCom'on Mmmm.\nWhoomp there it is. \nA lil lower. \nWhoomp there it is. \nRed beans, give it to me.\nCom'on com'on\n\nHeyyyyyy babyyyyy....Heyyyyyy babyyyyy.....\n\nCan you dig it? (Little girls: We can dig it!) \nCan y'all dig it? (Little boys: We can dig it!) \nCan y'all dig it? (Cashier: We can dig it!)\nCan y'all dig it? (Crepe makers: We can dig it!)\n\nW-H-double O-M-P as I flow, \nTo the flying Elite from the Hammer of old \nHard core keep' the folklore wrecked \n3 to the 2 and 1 crepe check it\nMad skill, lychee flow ill, on the mess of crepe steel \nThat's the thrill of the crepephone I just melted \nParty people, there's your kiddie party; Yelp Team is through \nWhoomp there it is, I thought you knew!\n\nHollar to MC Hammer!", "rating": 5, "date": "2009-06-22"}, {"excerpts": ["Every nook and cranny of the crepe was evenly slathered in the red bean paste. "], "author": "Nancy C.", "review": "Henceforth, this place will be known as the place with the dessert that defeated me. I love desserts. As far as desserts go, I love absolutely anything sweet and I don't discriminate because I truly just love it all. I could have dessert before my meal, replace my meal with a dessert, or just keep having multiple desserts. That's how much I love it. One of my friends describes me as a \"bottomless pit\" because I eat everything and I usually want more a couple of minutes later. \n\nHowever, the size of the crepes here were too much for me to handle last night. Their crepes are absolutely freaking massive. It's like a McDonald's Supersize back when they still did that. Anyone remember the McHeartattack sized portions? But I digress, my point is that these crepes are meal sized. You can actually feel the lbs you're about to inflict on your body because mine was heavy in my hand as well as in my stomach...as well as my ass and thighs the morning after. No joke. \n\nI got the red bean with green tea ice-cream. That's the #2 order and it came out to $5.37. Halfway through, I was already full but I kept going because it tasted so good. I threw it the towel with 1 bite left. Weak defeat, I know. Every nook and cranny of the crepe was evenly slathered in the red bean paste. The edges are slightly crisp and the crepe is perfectly thin and not too chewy. \n\nThe lines tend to get ridiculously long. Here's an insider tip for you. There are always breaks in the line because the long lines go in cycles. If you don't feel like waiting it out, go browse the fun things they have around the store or go take a walk around the block and check in again later. Their crepes are worth the wait though. I might have been defeated the first time, but like The Terminator...dessert Terminator, \"I'll be back.\"", "rating": 5, "date": "2012-01-29"}, {"excerpts": ["My favorite is the red bean paste with green tea ice cream which has some fruit in it. ", "Fresh and fast! ", "I just wish that the workers there had a little more enthusiastic. ", "There was a girl/lady working there with a cap on and she seemed as if she didn't care about her job. ", "Needs improvement on their friendliness in the environment of the \"cafe\"."], "author": "Sarah F.", "review": "Wonderful flavors and toppings! Didn't expect this to be in a mini-mart but I still enjoy the wonderful crepes the make. My favorite is the red bean paste with green tea ice cream which has some fruit in it. Fresh and fast! I just wish that the workers there had a little more enthusiastic. There was a girl/lady working there with a cap on and she seemed as if she didn't care about her job. Needs improvement on their friendliness in the environment of the \"cafe\".", "rating": 4, "date": "2015-09-27"}, {"excerpts": ["I had the green tea crepe with red bean paste. ", "The price was right. ", "Limited seating and parking."], "author": "Cheryl L.", "review": "Odd crepe place in the front of a mini-mart. However the crepes are really good. I had the green tea crepe with red bean paste. The price was right. Limited seating and parking.", "rating": 5, "date": "2014-07-28"}, {"excerpts": ["My favorite: #2 Green Tea Ice Cream Crepe with Red Bean Paste. \n\n"], "author": "Stephen P.", "review": "I feel so lucky to live 3 blocks away from this place. SOOO YUMMY!\n\nMy favorite: #2 Green Tea Ice Cream Crepe with Red Bean Paste. \n\nI seriously dream about it. I tried the same crepe at Sophie's crepes, but I'm sorry - Genki wins. It's bigger, a little more pricy, but better.\n\nThis place is really cool. It's a small asian grocery market and at the same time they sell boba and crepes. One of my favorite desert places! \n\nThey're a little expensive though. About $5+ a crepe. Oh - and you need to spend at least $10 to use credit card. But.. definitely worth it!", "rating": 4, "date": "2010-07-28"}, {"excerpts": ["My favorites are the green tea ice cream with red bean paste or fruits (strawberry, banana) w/ Nutella. ", "Can't go wrong! "], "author": "Leeann C.", "review": "I love the crepes here! I've been here a handful of times (pretty much every time I visit friends who live nearby, I make a pit stop at this place), and the delicious crepe smell always tempts me to order more than I originally intended to. My favorites are the green tea ice cream with red bean paste or fruits (strawberry, banana) w/ Nutella. Can't go wrong! The store also sells Japanese goodies and treats.\n\n-L.", "rating": 4, "date": "2011-03-28"}, {"excerpts": ["We normally get the green tea ice cream with red bean paste or lychee, or the vanilla with nutella and strawberries.  ", "All super yummy!  ", "This place doesn't disappoint.  ", "Next time we make it over to the Richmond district, we want to try the custard and check out their savory crepes as well. ", "Highly recommended!"], "author": "Christine S.", "review": "Our go-to spot for a crepe snack or dessert!  We normally get the green tea ice cream with red bean paste or lychee, or the vanilla with nutella and strawberries.  All super yummy!  This place doesn't disappoint.  Next time we make it over to the Richmond district, we want to try the custard and check out their savory crepes as well. Highly recommended!", "rating": 5, "date": "2015-06-30"}, {"excerpts": ["We also tried red bean paste and mixed fruit. ", "Both were OK, at best. ", "The place smelled great, but the taste did not line up!"], "author": "Wendy L.", "review": "We were craving crepes, so decided to go off of great Yelp reviews. A real disappointment. Not only were the crepes crunchy like cookies, but the insides of the crepes were cold and really left much to be desired. We ordered a cinnamon apple one - I imagined the cinnamon apple filling would be like apple pie, but instead it was cold, crunchy apple. We also tried red bean paste and mixed fruit. Both were OK, at best. The place smelled great, but the taste did not line up!", "rating": 2, "date": "2013-07-09"}, {"excerpts": ["Try their crepe with red bean paste and green tea ice cream. ", "Oh god. ", "Cheap, quick, and unbelievably good. ", "Why are you not there right now?"], "author": "Emma M.", "review": "Not only is it packed with a vertiable cornucopia of cool munchies and things to look at, but Genki Crepes also wins my love for being open past midnight on weekends. This little Japanese market has hit the spot on more late nights than I can count. Try their crepe with red bean paste and green tea ice cream. Oh god. Cheap, quick, and unbelievably good. Why are you not there right now?", "rating": 4, "date": "2012-07-29"}, {"excerpts": ["My all time favorite dessert crepe is the red bean paste with lychee ice cream. ", "It sounds disgusting, but you have to try it! ", "It's definitely not the usual strawberry, nutella, and vanilla ice cream combo ", "but it's worth the stretch. "], "author": "Linda T.", "review": "My favorite place for dessert crepes! There are always lines and crowds at Genki at any time of the day.  They are known for their dessert crepes, but you can also get savory crepes, smoothies, and oriental/imported knick-knack snacks here, too. \n\nMy all time favorite dessert crepe is the red bean paste with lychee ice cream. It sounds disgusting, but you have to try it! It's definitely not the usual strawberry, nutella, and vanilla ice cream combo but it's worth the stretch. Just writing about it makes me want to go get one! \n\nThere is very limited seating (literally two benches) so i suggest you grab your crepe and go. Don't be intimated by the long lines late at night - they move pretty quick. Genki is always worth the wait!", "rating": 5, "date": "2011-02-05"}, {"excerpts": ["Had the crepe filled with lychee ice cream with red bean paste.   ", "Pretty good - hit the spot!  ", "They wrap it up like an ice cream cone. ", "Much easier to devour than your standard crepe on a plate.  ", "Very comparable to Sophies Crepes in J-Town.  ", "Oh yeah, and this place is open later than Sophies."], "author": "Lawrence L.", "review": "Had to try this place and take advantage of being in the city.  Had the crepe filled with lychee ice cream with red bean paste.   Pretty good - hit the spot!  They wrap it up like an ice cream cone. Much easier to devour than your standard crepe on a plate.  Very comparable to Sophies Crepes in J-Town.  Oh yeah, and this place is open later than Sophies.", "rating": 3, "date": "2009-10-24"}, {"excerpts": ["I usually order my Lychee Ice cream with red bean paste all the time. ", "It's so good. "], "author": "Sasitorn O.", "review": "I am asian, I love snacks, i love ice cream. whenever i drive pass this area and if it's not cold. I often stop by to Genki. \n\nI usually order my Lychee Ice cream with red bean paste all the time. It's so good. Also, Genki sells some candies and snacks ( japanese snacks) and other random cutie things, something like Sanrio products. \n\nPlus, fast service.", "rating": 3, "date": "2009-12-27"}, {"excerpts": ["I decided to make my own creation and ordered the green tea ice cream crepe with red bean paste. ", "The crepe is rolled around in a cone shape where the ingredients are placed inside. ", "The crepe was huge - a perfect size for sharing. ", "The taste of the crepe tasted a lot like a fortune cookie, without to hard cookie-like crunch."], "author": "Cristofer P.", "review": "This is the type of hidden gem that I love to find. Giant delicious crepes that make a perfect dessert treat, making it worth it to venture off Geary.\n\nI decided to make my own creation and ordered the green tea ice cream crepe with red bean paste. The crepe is rolled around in a cone shape where the ingredients are placed inside. The crepe was huge - a perfect size for sharing. The taste of the crepe tasted a lot like a fortune cookie, without to hard cookie-like crunch.", "rating": 4, "date": "2009-11-05"}, {"excerpts": ["I always get the red bean paste with green tea ice cream - a very good combination. ", "It's not on the menu, but ask for whatever combination you want and they'll do it. ", "They are quite large, my husband and I split one after dinner. "], "author": "Zee S.", "review": "BEST discovery!\n\nBeware, it's in a convenience store. But oh soooo worth it!\nThe crepes are delicious, warm and crunchy and soft all at once. Like an ice cream cone on steroids. I was scared at first: a classic French crepe with Asian toppings? Result = Best Desert Ever! \nI was a classic French crepe girl, and was at first upset that this crepe did not live up to the French name. Then I had a couple more bites and now these are the only crepes I want! \nI always get the red bean paste with green tea ice cream - a very good combination. It's not on the menu, but ask for whatever combination you want and they'll do it. They are quite large, my husband and I split one after dinner. And we come here often! \n\nGot the egg puffs once, bland and boring. I wanted to throw them away and get a crepe instead.\n\nThere will be a line, but it goes fast.\n\nThe only thing this place needs is to ditch the store and replace with tables. But even standing out in the cold to eat them is totally worth it.", "rating": 5, "date": "2012-03-24"}, {"excerpts": ["I had the red bean ice cream with banana and my partner had the lychee ice cream with red bean paste. ", "The combination of red bean ice cream and banana seemed weird at first, but it was actually really good. ", "The lychee ice cream was delish!! ", "I always forget how much I LOVE lychee ice cream until I have it again. "], "author": "Joshua C.", "review": "We were driving around looking for parking to eat on Clement Street when I seen two kids eating what looked like ice cream from a crepe shaped like a cone. I immediately thought \"YUM, that's what I want for dessert!\" \n\nSo while eating dinner, I busted out my trusty Yelp iPhone application and searched \"crepes\" and Genki was the first place to pop up. It had over 400 reviews so I figured this had to be the spot. It was a block away from where I was eating dinner. Perfect!\n\nWhoever thought up the idea to eat ice cream from a crepe shaped like an ice cream cone is a genius. I love the selection of crepes - ice cream, savory & snack crepes. They also have tons of drinks. This place also happens to be a Japanese mini-mart full of asian snacks, candy and stationary. SCORE! If I lived near here, I could see myself hitting this place up when I have the \"munchies\". LOL. This is a stoner's paradise.\n\nI had the red bean ice cream with banana and my partner had the lychee ice cream with red bean paste. The combination of red bean ice cream and banana seemed weird at first, but it was actually really good. The lychee ice cream was delish!! I always forget how much I LOVE lychee ice cream until I have it again. (note to self: next time at the asian grocery store, buy lychee ice cream)\n\nI'm glad I don't live so close to this place or else I'd really be a fat ass. I'm sure there are some places like this in Oakland, but I'd rather not know about them. It's times like this when I'm so glad to have the Yelp iPhone application. \"When you see two kids eating ice cream from a crepe and you want to know where you can get some - there's an app for that!\"", "rating": 5, "date": "2009-06-06"}, {"excerpts": ["I ordered the Red Bean Paste Crepe and it was warm and fresh. ", "They have benches inside and outside for customers to sit and enjoy their sweets. ", "Will be back here to try the tapioca soon. ", "Yum yum!"], "author": "Helene K.", "review": "Vast selection of crepes; probably more than what Sophie's Crepes (in Japantown) offers. There are ice cream crepes, savory crepes, and snack/dessert crepes. Ice cream can also be ordered here, and also tapioca drinks. I'm so happy to see they serve mainly Asian flavors (i.e., lychee, green tea, red bean, etc.)...that's just me, I guess. Sweets, sweets, sweets! \n\nThere's a small mini-mart in the back, a lot of basic Japanese/Asian snacks and random goods. I ordered the Red Bean Paste Crepe and it was warm and fresh. They have benches inside and outside for customers to sit and enjoy their sweets. Will be back here to try the tapioca soon. Yum yum!", "rating": 4, "date": "2008-07-31"}, {"excerpts": ["Red bean paste crepe with green tea icecream....solid 5 star.\n\n", "And the red bean paste and green tea ice cream is the best combination. "], "author": "Yuchi C.", "review": "Red bean paste crepe with green tea icecream....solid 5 star.\n\nThe crepe is soooooo crispy, all the way to the last bite with melted ice cream, not at all soggy, which is pretty amazing. At first, I was wondering why the crepe was already cold when I took the first bite, I saw them make it there, while wandering around the little cute shop. But then I soon realized that they actually are so thoughtful that for the ones with ice-cream, they let the crepe cool down a little bit so the ice-cream doesn't melt right away because of the hot crepe. And the red bean paste and green tea ice cream is the best combination. Can't go wrong with the two most essential ingredients in Japanese sweets.\n\nOne more start for having this specific milk tea drink that my bf has been looking for for so long. None of the asian markets carry it, but Genki does. Yay!", "rating": 5, "date": "2008-02-24"}, {"excerpts": ["Red bean paste, green tea ice cream, fresh fruits, whip cream, and different savory flavors, too. ", "Great snack food."], "author": "Becka T.", "review": "The perfect crepe. Just enough crispiness with a variety of toppings.  Red bean paste, green tea ice cream, fresh fruits, whip cream, and different savory flavors, too. Great snack food.", "rating": 4, "date": "2010-05-02"}, {"excerpts": ["I ordered the green tea ice cream with red bean paste. ", "My brother got the chocolate ice cream with cheesecake and nutella and his girlfriend ordered vanilla with chocolate cake and nutella. ", "Nothing special ", "but it was good. ", "I wouldn't make it a trip again though."], "author": "Jennifer D.", "review": "Simple crepe. I ordered the green tea ice cream with red bean paste. My brother got the chocolate ice cream with cheesecake and nutella and his girlfriend ordered vanilla with chocolate cake and nutella. Nothing special but it was good. I wouldn't make it a trip again though.", "rating": 3, "date": "2011-03-03"}, {"excerpts": ["I usually get the Green tea ice cream with red bean paste crepe. ", "Sweet combo, not overwhelming since I prefer my crepes without nutella or whipped cream. ", "Downside about this place is that there's limited seating.. so whenever I come with with others, we end up eating in the car. ", "This place gets crowded at night!"], "author": "Nancy L.", "review": "My go-to crepe place! Sweet crepes run around $5. I usually get the Green tea ice cream with red bean paste crepe. Sweet combo, not overwhelming since I prefer my crepes without nutella or whipped cream. Downside about this place is that there's limited seating.. so whenever I come with with others, we end up eating in the car. This place gets crowded at night!", "rating": 5, "date": "2011-01-28"}, {"excerpts": ["I love all the crepes that I've tried at this store, which include the green tea ice cream/red bean paste crepe, the sugar & butter crepe, and the nutella! "], "author": "Freya B.", "review": "The best of this style of crepe that I've ever tasted! Perfectly crispy and  has fresh ingredients... I love all the crepes that I've tried at this store, which include the green tea ice cream/red bean paste crepe, the sugar & butter crepe, and the nutella! mmm, thinking about it just makes me want to go there right now and have one.\n\n  I also love how the store itself sells random items... keeps you entertained as you wait for your crepe to be served.  Snacks, drinks, and random japanese imported toys.  Fun store! \n\nhttp://fishandbunny.tumblr.com/post/860095406/after-dinner-i-was-craving-some-crepes-we-went", "rating": 5, "date": "2010-07-25"}, {"excerpts": ["I tried the green tea ice cream with red bean paste and mango ice cream with strawberries crepes, I think they were just okay.  ", "The crepes were thin and crunchy, not soft like they were supposed to be.  ", "I had better crepes elsewhere i.e. Crepevines and Sweet Indulgence in Millbrae.  ", "I think this place is over rated."], "author": "Avocadoagogo L.", "review": "I tried the green tea ice cream with red bean paste and mango ice cream with strawberries crepes, I think they were just okay.  The crepes were thin and crunchy, not soft like they were supposed to be.  I had better crepes elsewhere i.e. Crepevines and Sweet Indulgence in Millbrae.  I think this place is over rated.", "rating": 2, "date": "2012-08-27"}, {"excerpts": ["My favorite - green tea with red bean paste! ", "This place was my favorite spot for crepe cravings...however, I live in the sunset district and a friend of mine told me about Crepe Temptations.  ", "They offer a similar selection and many more savory crepes.  ", "If I'm near the clement area - I'll come come for their crepes."], "author": "Peter G.", "review": "My favorite - green tea with red bean paste! This place was my favorite spot for crepe cravings...however, I live in the sunset district and a friend of mine told me about Crepe Temptations.  They offer a similar selection and many more savory crepes.  If I'm near the clement area - I'll come come for their crepes.", "rating": 4, "date": "2009-10-03"}, {"excerpts": ["The lychee ice cream (from Pollyanna's?) with red bean paste is to die for, but the red bean paste they use is quite sweet and many of my friends find it difficult to finish the entire crepe."], "author": "A. T.", "review": "While the sweets and the atmosphere are hard to beat, the quality of the crepe-making has been somewhat inconsistent the past few times I have visited. On occasion I have had several crepes that were cooked to a crisp, which makes it very difficult to eat without looking like a pig. The lychee ice cream (from Pollyanna's?) with red bean paste is to die for, but the red bean paste they use is quite sweet and many of my friends find it difficult to finish the entire crepe.", "rating": 4, "date": "2007-08-11"}, {"excerpts": ["I'm looking forward to trying the Red Bean Paste crepe next time. ", "I also bought Red Bean ice cream, some White Peony tea, and some honey ginger crystals- ", "all of which are delicious. ", "I love Asian convenience stores and Genki is number one for also having delicious, fresh crepes, and staying open late!"], "author": "Rachael S.", "review": "Wandered in here one night around 11:30 after a rousing time at The Bitter End. I was honestly surprised that anything was open that late on Clement. I just moved here about a month ago from sleepy Berkeley, where pretty much everything closes by 9. This place is fantastic! First of all, I love pretty much anything Asian, I mean, my boyfriend is half Taiwanese, and I'm hoping to produce a few quarter-Asian babies some day so that I can start identifying with my Asian roots. This place is awesome. I got a cheese and onion crepe and it was DELICIOUS. People are right about the crispiness of the crepe. So ideal, so French (although I've had much worse crepes in Paris), and from an Asian convenience store! I'm looking forward to trying the Red Bean Paste crepe next time. I also bought Red Bean ice cream, some White Peony tea, and some honey ginger crystals- all of which are delicious. I love Asian convenience stores and Genki is number one for also having delicious, fresh crepes, and staying open late!", "rating": 5, "date": "2008-09-05"}], "mixed fruits": [{"excerpts": ["My go-to crepes are the Green tea with cheesecake and mixed fruits with nutella. ", "YUMMMMM"], "author": "Annie D.", "review": "Damn Genkiiiiii. You never fail to satisfy my sweets craving. Genki's desserts are good at any time of the day. You can have it for breakfast, lunch, dinner or a late snack. I found this beautiful gem 6 years go. My friends live down the street and they introduced me to Genki and I instantly fell in love right there and then. I have also introduced Genki to my friends and family ever since. \n\nTheir handmade crepes are perfectly made. The texture along with the yummy toppings compliment everything so well. My go-to crepes are the Green tea with cheesecake and mixed fruits with nutella. YUMMMMM", "rating": 5, "date": "2016-10-05"}, {"excerpts": ["It doesn't take a genius to add a spread of nutella to the crepe, scoop a scoop of ice cream, top it with some mixed fruits and spritz some whipped cream on the top. ", "But rules are rules and in this case, they weren't meant to be broken. ", "I didn't want to make a scene and delay the long line behind me ", "so I decided to go with the whipped creme. ", "My crepe was a little naked. ", "There was an inch of unfilled crepe crust spewing from the top. ", "But all in all, it was a mediocre crepe. ", "My only complaints were: the whipped creme tasted funny and the bananas were 2 inch long (not bite-size). ", "Nothing special, but I'd probably come here again since it brings back fond memories from the past."], "author": "Amy T.", "review": "Genki is my to-go spot for snacks and crepes. I can vividly remember coming here when I was still in high school! Now I've successfully completed both college and grad school and it's still around! Amazing--since most stores open then pick up and leave within a small time period in the city. Genki has a variety of Japanese candies, chips, drinks, make-up, toys and accessories. The selection is overwhelming and I feel that the store has become more cluttered over the years. It's nice to look around and see what you can find in the sea of merchandise. I usually come here for the crepes when Japantown is closed. This time like every other time, I ordered the mixed fruit with green tea ice cream and my sister and her boyfriend ordered the green tea ice cream crepe with red bean. I don't know if it's me being away in LA for too long but when I kindly asked the cashier to have both nutella and whipped cream in my crepe (because I love to indulge!) she rejected my request. I was willing to pay more for it but she said that it would throw the chef off. It was either one or the other.?!?!?!?!?!?!?! I'm still alarmed by her comment. It doesn't take a genius to add a spread of nutella to the crepe, scoop a scoop of ice cream, top it with some mixed fruits and spritz some whipped cream on the top. But rules are rules and in this case, they weren't meant to be broken. I didn't want to make a scene and delay the long line behind me so I decided to go with the whipped creme. My crepe was a little naked. There was an inch of unfilled crepe crust spewing from the top. But all in all, it was a mediocre crepe. My only complaints were: the whipped creme tasted funny and the bananas were 2 inch long (not bite-size). Nothing special, but I'd probably come here again since it brings back fond memories from the past.", "rating": 4, "date": "2015-07-02"}, {"excerpts": ["I usually get mixed fruits with nutella and cream, since it's cold everytime ", "I go", ", I opt out for ice cream. ", "They make eggettes too! ", "Different flavors! ", "They are REALLY GOOD, soft on the inside and a bit crunchy on the outside. ", "I would totally recommend this place to anyone. ", "But it is located in Richmond, so parking might be hard to find. ", "Not a problem for me since my friends at I go around 9 or 10pm."], "author": "Winnie T.", "review": "One of my favorites to get crepes in NorCal! I don't recall the price but it's around $6 dollars for a HUGE sized crepe. I usually come here at night with my friends, and sometimes there will be a line, but it's not too bad. One bad thing is that they don't have tables.\nIt's conveniently located inside a small store that sells misc. chinese things. Usually my friends and I walk around while we wait for our numbers to be called. I usually get mixed fruits with nutella and cream, since it's cold everytime I go, I opt out for ice cream. They make eggettes too! Different flavors! They are REALLY GOOD, soft on the inside and a bit crunchy on the outside. I would totally recommend this place to anyone. But it is located in Richmond, so parking might be hard to find. Not a problem for me since my friends at I go around 9 or 10pm.", "rating": 5, "date": "2011-01-24"}, {"excerpts": ["I ordered the #5 mixed fruits w/ Nutella. ", "I also added ice cream.  ", "The total came up to $8.10.  ", "To me, this was a lot for a crepe but if it tastes good then it'll be worth it.  ", "So I waited patiently while the lady made our crepes.  ", "The lady who made the crepes seemed to have a rude attitude.  ", "She did not look like she enjoyed her job at all by her facial expressions. "], "author": "Nai S.", "review": "My friend has been raving about this place being the best crepe joint so I decided to finally check it out.  What's odd is this crepe spot is located inside a small convenience store. \n\nI ordered the #5 mixed fruits w/ Nutella. I also added ice cream.  The total came up to $8.10.  To me, this was a lot for a crepe but if it tastes good then it'll be worth it.  So I waited patiently while the lady made our crepes.  The lady who made the crepes seemed to have a rude attitude.  She did not look like she enjoyed her job at all by her facial expressions. I even saw her punch her fist on top of the counter :(\n\nWhen I finally got my crepe, it looked appealing.  The crepe was crispy.  One bite of it and pieces of the crepe would fall off.  It was good but not $8 good lol\n\nI highly doubt I will go back.  The price and customer service were really a downfall for me.", "rating": 2, "date": "2011-10-27"}, {"excerpts": ["My fave savory crepe has got to be the turkey and spinach with jack cheese and to satisfy my sweet tooth it's got to be the ice cream crepe with vanilla ice cream, nutella, and mixed fruits (bananas, strawberries, and pineapples) topped with fresh whip cream made in house! ", "I also request that they add almonds as well. ", "Just typing this up is making me want one "], "author": "Ivy Z.", "review": "I am always down for a crepe from Genkis! You can get fast and delicious savory and sweet dessert crepes here and while you wait, you can also browse and shop for more delicious Asian treats in their grocery aisles!\n\nMy fave savory crepe has got to be the turkey and spinach with jack cheese and to satisfy my sweet tooth it's got to be the ice cream crepe with vanilla ice cream, nutella, and mixed fruits (bananas, strawberries, and pineapples) topped with fresh whip cream made in house! I also request that they add almonds as well. Just typing this up is making me want one and I just had one over the weekend.\n\nParking sucks here but I always somehow end up finding a spot--near or far, I don't mind the trek for that crepe!\n\nWarning for those that have never eaten a crepe by hand--it can and will get messy! The savory crepe tends to leak their juices at the bottom of the paper holder so I tend to fold the point up and wrap it with a napkin. And as for the ice cream crepes, I suggest you grab more than a few pieces of napkins and attack the filling first with a spoon. Once you've gotten deep enough, it'd be safe to finally take a few bites of that crunchy crepe smothered in Nutella! This is wisdom I've acquired after years of practice at Genkis.\n\nI've been so consumed by my obsession of crepes that I'm ashamed to say that I've totally neglected the rest of the snacks they also offer which include egg puffs and tapioca milk tea and then some. Something that a large group of people ordered simultaneously the last time I was there was hot milk tea which sounded really good since it was a really cold day. So I've decided to try something new next time I visit which won't be far from now.\n\nAnother tip, if you really need to use the restroom, the staff there would be nice enough to let you use their private one. not many grocery or corner stores would be that nice! It's actually pretty clean too so if they do let you use it, please don't make a mess in there and ruin it for the rest of us.", "rating": 5, "date": "2011-01-06"}, {"excerpts": ["I got the mixed fruits crepe and it was amazing! ", "I will be back next time to try one of the ice cream crepes."], "author": "Jessica C.", "review": "Crepes here are delicious!! I got the mixed fruits crepe and it was amazing! I will be back next time to try one of the ice cream crepes.", "rating": 5, "date": "2012-09-30"}, {"excerpts": ["Still ever-so-yummy... Nutella and mixed fruits. ", "Plus I got a great waterproof eyeliner there. ", "Yup, love this little store because, in addition to some yummy crepes, there's just a bunch of stuff for you to browse through while waiting for your food. ", "Oh yeah, my husband got vanilla ice cream with Nutella (his first dessert crepe) and loved it too!"], "author": "Felicia S.", "review": "Had a super yummy Nutella with mixed fruit crepe! So many choices on their menu and so hard to decide. My friends had Nutella with strawberry; Nutella with banana; red bean; vanilla ice cream with some fruit (I don't remember what it was exactly) and everyone was happy. Plus, it was made fresh and quick! Ooooo, the candy they sell are great! They've got all the old-school candies (ie Pocky, Super Lemon, Super Orange, panda cookies) and cool Japanese candies that are so yummy! AND they've got great Japanese products that you'd have to go to Japantown to find. Such a cool lil place for everything!\n\nUPDATE:\nWent there again yesterday because I was craving a crepe since the last time I went there. Still ever-so-yummy... Nutella and mixed fruits. Plus I got a great waterproof eyeliner there. Yup, love this little store because, in addition to some yummy crepes, there's just a bunch of stuff for you to browse through while waiting for your food. Oh yeah, my husband got vanilla ice cream with Nutella (his first dessert crepe) and loved it too!", "rating": 4, "date": "2008-01-13"}, {"excerpts": ["I've tried the mixed fruits with nutella. ", "Yummy. ", "Next time, I'm gona add ice cream to that. ", "And it opens late!"], "author": "Amy X.", "review": "Genki Crepes! Cute little store that sells a BUNCH of them asian snacks that you can't get at safeway or albertsons. They also sell other things like makeup.. like the expensive japanese ones. Yeah but I usually come here to eat the crepes. They have a huge menu for crepes. I've tried the mixed fruits with nutella. Yummy. Next time, I'm gona add ice cream to that. And it opens late!", "rating": 5, "date": "2009-08-20"}, {"excerpts": ["I ordered chocolate ice cream &cheesecake crepe, while my friends ordered the blueberry with cheesecake crepe & the mixed fruits crepe. ", "They were all delicious. ", "Way better than the other creperies I've been through. ", "Crepes I've had before were all soft, however, Genki's were crispy &really delicious. ", "I like how Genki's is also a mini mart with toys & treats from Asia. ", "But I really wish that they have a bigger seating area; there's only two benches inside & a bench outside. ", "Overall, I will be coming back to try the rest of their menu."], "author": "BrendaJoy G.", "review": "I came here the other night with a couple of friends 'cause we all never been here before &we wanted to try it out. I ordered chocolate ice cream &cheesecake crepe, while my friends ordered the blueberry with cheesecake crepe & the mixed fruits crepe. They were all delicious. Way better than the other creperies I've been through. Crepes I've had before were all soft, however, Genki's were crispy &really delicious. I like how Genki's is also a mini mart with toys & treats from Asia. But I really wish that they have a bigger seating area; there's only two benches inside & a bench outside. Overall, I will be coming back to try the rest of their menu.", "rating": 4, "date": "2009-12-14"}, {"excerpts": ["I like the Mixed fruits with nutella crepe the best. ", "N the matcha ice cream. ", "So curious to know how a Wasabi milk shake will taste like. ", "haha XD"], "author": "Marlis T.", "review": "LOVE IT! I like the Mixed fruits with nutella crepe the best. N the matcha ice cream. So curious to know how a Wasabi milk shake will taste like. haha XD", "rating": 5, "date": "2008-05-25"}], "cheesecake whip cream blueberry sauce": [], "honey banana almond": [{"excerpts": ["I got the honey banana almond crepe because those are literally my favorite things ever ", "but I was really disappointed with what it tasted like...", "VERY average and something that I could have made at home. ", "The ice cream flavors looked very tempting (they had lychee!!!!) ", "but I was too full to get anything too heavy."], "author": "Mai S.", "review": "Don't really know why this place is rated so highly because the crepe was very average. I got the honey banana almond crepe because those are literally my favorite things ever but I was really disappointed with what it tasted like...VERY average and something that I could have made at home. The ice cream flavors looked very tempting (they had lychee!!!!) but I was too full to get anything too heavy.", "rating": 2, "date": "2014-05-30"}], "sugar butter": [], "peanut butter banana": [], "marshmallow coconut": [], "cinnamon apple brown sugar": [], "lemon sugar": [{"excerpts": ["My friend and I tried the coconut egg puff and lemon sugar crepe. \n\n", "The simple lemon sugar crepe was not what we were expecting. ", "We thought it would be a smear of lemon reduction or jam, but I think it was literally lemon juice dusted with powered sugar. ", "We made a mistake. ", "The flavors did not go well together at all. ", "The crepe itself was okay. "], "author": "Marilyn T.", "review": "Convenient snack spot in a convenience store! My friend and I tried the coconut egg puff and lemon sugar crepe. \n\nThe coconut egg puff had the perfect amount of coconut flavor and coconut bits. It was subtly sweet.\n\nThe simple lemon sugar crepe was not what we were expecting. We thought it would be a smear of lemon reduction or jam, but I think it was literally lemon juice dusted with powered sugar. We made a mistake. The flavors did not go well together at all. The crepe itself was okay. It was a little thicker and not like other Japanese crepes I've eaten before.\n\nI'd probably stick to the egg puffs and try one of their over the top crepes next time.\n\nThe convenience store sells a bunch of Asian (Japanese, Thai, Chinese) snacks too!", "rating": 4, "date": "2018-06-17"}, {"excerpts": ["Lemon sugar crepe $3 (2/5) - a large and well made crepe with hints of lemon and plenty of powdered sugar. ", "The only downside is that I was expecting more lemon taste."], "author": "Gabriel C.", "review": "Lemon sugar crepe $3 (2/5) - a large and well made crepe with hints of lemon and plenty of powdered sugar. The only downside is that I was expecting more lemon taste.", "rating": 2, "date": "2013-03-16"}, {"excerpts": ["Lemon Sugar Crepe ", "- I wanted something light, so I overlooked the chocolate ice cream and cheesecake crepe for the lemon sugar. ", "The crepe was thin and crispy, but soft enough so it didn't crack and fall on the floor. "], "author": "Sam L.", "review": "After an afternoon at the Walt Disney Family Museum, K and I worked up an appetite for some crepes. We stopped at Genki Crepes in the Inner Richmond to satisfy our craving.\n\nThe scene:\n\nGenki Crepes is a mix between a grocery store and a dessert spot. They have a little something for everyone - crepes, boba drinks, egg puffs and ice cream. They've got an impressive assortment of imported chips and candy from all over Asia. I copped a few unusual flavors of Kit Kat bars that I've never seen before. The packaging is completely in Japanese, but it looks like the flavors might be coffee and chocolate mochi.\n\nThe food:\n\nFor egg puffs and a crepe, the total came to $4.50.\n\nLemon Sugar Crepe - I wanted something light, so I overlooked the chocolate ice cream and cheesecake crepe for the lemon sugar. The crepe was thin and crispy, but soft enough so it didn't crack and fall on the floor. It was very lemony and it had just the right amount of sweetness.\n\nEgg Puffs - The egg puffs were much different that others I've had at other dessert places. Usually, each egg puff has a huge pocket of air, but not these. They were dense, chewy and crispy. The only downside was that it was a little cold by the time we got it.\n\nI'm definitely coming back to try their other crepes. The cheesecake one sounds delicious, but I'd probably have to skip dinner to eat that one.", "rating": 5, "date": "2010-03-16"}], "mandarin orange blueberry sauce": []}