{"andouille": [{"excerpts": ["I got the andouille sausage and Chris had the Louisiana hot link. ", "5 bucks each, not bad! ", "They offer sauerkraut on them, which I love, and have spicy mustard and ketchup in a bottle. ", "We each had a beer with our sausage and left full and satisfied. ", "I have to mention it again, the bartender was really nice. ", "A Saturday afternoon visit is recommended for a calm, chill visit."], "author": "Liz M.", "review": "You know, I never noticed this place before. But while in the Mission on a sunny Saturday afternoon looking for a casual bite to eat, we noticed this bar looking place that advertised brats in the front. \n\nIt was a totally casual place with a comfy, funky looking front area that had couches and old furniture. The back of the bar had a hunting game and pinball. There was also a juke box.\n\nWe sat at the bar and had a really friendly guy bartender that filled us in on what they had to offer to eat. I got the andouille sausage and Chris had the Louisiana hot link. 5 bucks each, not bad! They offer sauerkraut on them, which I love, and have spicy mustard and ketchup in a bottle. We each had a beer with our sausage and left full and satisfied. I have to mention it again, the bartender was really nice. A Saturday afternoon visit is recommended for a calm, chill visit.", "rating": 4, "date": "2010-04-25"}, {"excerpts": ["Awesome beers on tap (my fave is the Tricerihops) and sausages to snack on (andouille was tasty)! \n\n"], "author": "Karena Q.", "review": "Super laid back and not packed. Awesome beers on tap (my fave is the Tricerihops) and sausages to snack on (andouille was tasty)! \n\nCash only and horrible cell phone reception.", "rating": 4, "date": "2012-02-23"}, {"excerpts": ["They got eclectic sausages (Andouille, lamb, Hawaiian, etc.) ", "that are electric grilled right behind the bar so they are served nice and hot, with kraut, but no onions. ", "They are only $5, but are not very good quality. "], "author": "Adam Z.", "review": "Sadly, I've walked by this place a thousand times and never noticed it, because this is a dive worth checking out.\n\nGreat draft beer selection in a wide variety of sized glasses, including the manly-man liter.  Some very nice hard-to-find dark and German stuff on tap too.\n\nThey got eclectic sausages (Andouille, lamb, Hawaiian, etc.) that are electric grilled right behind the bar so they are served nice and hot, with kraut, but no onions. They are only $5, but are not very good quality. The buns are approximately two and half times too big -- I guess the assumption is that the bike messengers are famished.\n\nBig pool table front and center (not for the timid or sucky) with room to play. Soccer on the tube.\n\nVery good CD jukebox with one of the bartenders taking over the DJ booth later in the evening. Heard some great all-vinyl funk music here.\n\nA gazillion times cooler than the yuppier-than-thou \"The Monk's Kettle\" next door.", "rating": 4, "date": "2009-06-09"}, {"excerpts": ["I'm a big fan of the andouille and chicken (I feel like it was apple-chicken, or spinach-chicken, or feta-chicken, but again, it's been too long to be sure)."], "author": "Angela B.", "review": "I haven't been there in a while, but I have some very bittersweet, yet fond memories of Gestalt from back when I used to go there more often, so that probably colors my opinion about it.  I wasn't living in the city yet at that point but had begun spending a lot of time up here recently, and the place struck me as one of the most laid-back, least pretentious bars I'd been in in a while (interesting, because we'd just come from Elixir up the street, which also holds that distinction).\n\nGenerally, there are around ten or twelve beers on tap (or something like that; I haven't been there recently enough to sweat to that number), usually with a few local microbrews or something else interesting and unique.  Strictly speaking, I feel like they tend to have more Belgians there than they statistically should, but since I love Belgians, that's just fine by me.  The bartenders are friendly, knowledgeable about their beer, and always happy to make a recommendation or let you try a taste of something before you order a pint.\n\nThe other great thing about Gestalt is the sausage.  Now, it's no Rosamunde's, but given that when I've been there I've usually always had a lot to drink or am in the middle of or on my way to having a lot to drink, when I've had them, the sausages have always tasted heavenly.  I'm a big fan of the andouille and chicken (I feel like it was apple-chicken, or spinach-chicken, or feta-chicken, but again, it's been too long to be sure).", "rating": 4, "date": "2009-03-19"}], "louisiana hot link": [{"excerpts": ["I had a Louisiana Hot Link.  "], "author": "Brian K.", "review": "Ventured in after being disappointed by Monk's Kettle.\n\nWhile the beer selection is not nearly as extensive as Monk's, the bar was much more up my alley.\n\nThere is a pretty decent selection of German brews as well as US crafts, probably 20 or so beers on tap.\n\nPinball machines, dimly lit with some neon, couches, music (wasn't thrilled with the popish selection that was playing while I was there though) and sausages.\n\nThe bar serves non meat alternatives but can't speak to the quality.  I had a Louisiana Hot Link.  Good stuff with some Moose Drool.\n\nNot sure if they recently renovated the bathroom but it was no where as grimy as some of the reviews make it out to be. \n\nStop in here if you are in the area.", "rating": 4, "date": "2013-09-05"}, {"excerpts": ["I got the andouille sausage and Chris had the Louisiana hot link. ", "5 bucks each, not bad! ", "They offer sauerkraut on them, which I love, and have spicy mustard and ketchup in a bottle. ", "We each had a beer with our sausage and left full and satisfied. ", "I have to mention it again, the bartender was really nice. ", "A Saturday afternoon visit is recommended for a calm, chill visit."], "author": "Liz M.", "review": "You know, I never noticed this place before. But while in the Mission on a sunny Saturday afternoon looking for a casual bite to eat, we noticed this bar looking place that advertised brats in the front. \n\nIt was a totally casual place with a comfy, funky looking front area that had couches and old furniture. The back of the bar had a hunting game and pinball. There was also a juke box.\n\nWe sat at the bar and had a really friendly guy bartender that filled us in on what they had to offer to eat. I got the andouille sausage and Chris had the Louisiana hot link. 5 bucks each, not bad! They offer sauerkraut on them, which I love, and have spicy mustard and ketchup in a bottle. We each had a beer with our sausage and left full and satisfied. I have to mention it again, the bartender was really nice. A Saturday afternoon visit is recommended for a calm, chill visit.", "rating": 4, "date": "2010-04-25"}, {"excerpts": ["i had the louisiana hot link. ", "it was a juicy beef and pork and their spiciest variety served in a hot dog bun and sourkraut on top. ", "very satisfying for a quick snack and not at all overly spicy, just the right amount especially when paired with an ice cold brew. ", "nice chilll little find"], "author": "Eugene H.", "review": "went here for a beer and a sausage. dive bar look, but it was poppin inside. 2 flat screens, pool table, a couple video games, jukebox. good beer on tap, young crowd, and good sausage for a bar. i had the louisiana hot link. it was a juicy beef and pork and their spiciest variety served in a hot dog bun and sourkraut on top. very satisfying for a quick snack and not at all overly spicy, just the right amount especially when paired with an ice cold brew. nice chilll little find", "rating": 4, "date": "2011-03-24"}], "smoked bratwurst": [{"excerpts": ["I had the smoked bratwurst. ", "It was $7 flat. ", "I like any bar with decent food as opposed to no food, so sausages and sandwiches are nice offerings here. ", "This is a dive bar. ", "The people in it at the time were not hipsters. ", "The bartender/host was reading Chelsea Girls by Eileen Myles. ", "Cool."], "author": "Denise C.", "review": "Well this is a nice little bar that I had not known about or ever been to until today. I was walking from Valencia and 16th to Dolores Park and happened upon this. Outside it said they had sandwiches for sale and I needed some late lunch. The sandwiches were a little overpriced, so I went with a sausage on roll with sauerkraut. I had the smoked bratwurst. It was $7 flat. I like any bar with decent food as opposed to no food, so sausages and sandwiches are nice offerings here. This is a dive bar. The people in it at the time were not hipsters. The bartender/host was reading Chelsea Girls by Eileen Myles. Cool.", "rating": 4, "date": "2017-07-29"}], "vegan apple sage": [{"excerpts": ["I grabbed an IPA on draft and the vegan apple sage sausage.  ", "Topped with sauerkraut, perfectly cooked and I added some of the serve yourself condiments from the sidebar (spicy ketchup and Dijon mustard). ", "Holy Yum. ", "I had to stop myself from doublin' down and getting another sausage this thing was so delicious and packed with flavor.  ", "Would totally come back here again to try the other variety, and of course, always enjoy the fantastic draft/bottle selection this spot provides. ", "Cheers."], "author": "Kelsey B.", "review": "A year later and I finally remembered to come back and try the vegan sausages at Gestalt Haus.  Brought my friends here on a Sunday afternoon for some fuel to keep going strong on our day drinking, football watching Sunday in the mission.  We came around 4PM on a Sunday and found the place to be less than half full, which was fine because we got great seats right by the TVs and excellent, quick service.  I grabbed an IPA on draft and the vegan apple sage sausage.  Topped with sauerkraut, perfectly cooked and I added some of the serve yourself condiments from the sidebar (spicy ketchup and Dijon mustard). Holy Yum. I had to stop myself from doublin' down and getting another sausage this thing was so delicious and packed with flavor.  Would totally come back here again to try the other variety, and of course, always enjoy the fantastic draft/bottle selection this spot provides. Cheers.", "rating": 4, "date": "2016-10-31"}], "vegan italian": [{"excerpts": ["I ordered the Vegan Italian sausage. ", "It comes with sauerkraut, and you can add peppers and onions if you'd like. ", "I asked for both, but they forgot to add them. "], "author": "Brandi W.", "review": "I'm gonna go ahead and bump up this one to a solid 4. A few years ago (in 2011!), I wrote a less than stellar review about this place. However, after wrapping my lips around one of their vegan sausages, I have to give them credit. They do offer some solid veggie noms. \n\nI ordered the Vegan Italian sausage. It comes with sauerkraut, and you can add peppers and onions if you'd like. I asked for both, but they forgot to add them. Meh, not a huge issue. \n\nThere is a condiment bar on one wall to help yourself to all types of saucy goodness. I topped mine with a delicate squiggle each of ketchup and spicy mustard. Mama mia, that thing was delicious! Lip smacking good. I was tempted to order another, but I was able to hold back my gluttonous instincts. \n\nI mentioned in my last review that they don't serve any booze, just beers. Oddly enough, I can't really drink hard alcohol all that much anymore. Admittedly, after a few too many brews, I feel a little gassy and bloated. Even so, it is much preferable than feeling too drunk, dizzy, and/or nauseous. I enjoy sipping on a cold pint, enjoying the bubbly bite, and just kicking back and putting my worries behind me. \n\nThe one bathroom deal is still kind of a kick in the pants, but if you get there early enough, it's not an issue. Just don't make the mistake of holding your pee until you feel like you're going to burst. Just another helpful hint from yours truly.", "rating": 4, "date": "2014-05-27"}]}