{"grilled spicy mayo mussel pc": [], "chicken karaage": [{"excerpts": ["Their chicken karaage was one of the most tender kaarages I've had. ", "Tender, juicy, yummy. "], "author": "Will H.", "review": "Previously ate here and ordered a couple rolls for take-away. I didn't really enjoy it, but I'm also realizing that in general, I should never order sushi for take away. It just isn't as tasty without the gobs of ginger and dine-in experience that makes eating sushi so enjoyable. \n\nThis time around, ate inside the restaurant and had a much better experience. Their chicken karaage was one of the most tender kaarages I've had. Tender, juicy, yummy. Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. The Godzila roll was also nice, with a bit of spice and good flavor. Good neighborhood sushi in the Pacific Heights area.", "rating": 4, "date": "2016-11-02"}, {"excerpts": ["Chicken Karaage - YUM!  "], "author": "Jane N.", "review": "I really like Godzila :)  Good, fresh sushi that is on the cheaper side with a bunch of Godzilla memorabilia around.  I've been here a few times already but can only remember my recent order that included:\n\nKing Kong Roll - My fave here thus far!  I don't usually like baked salmon but this one was very tasty imho.  \n\nTinky Winky - Not too bad.  It had fresh, real crab so that's a plus!\n\nNegihama - Negihama is negihama.  Something about yellowtail and scallions gets me drooling for some reason though.\n\nChicken Karaage - YUM!  It came out piping hot and juicy and comes with this delicious aioli dipping sauce.\n\nService was great.  Always came back to refill our waters without making us ask.  Super friendly people and clean bathrooms :)", "rating": 3, "date": "2012-05-02"}], "gyoza pc": [], "poke": [{"excerpts": ["I had the poke and thought it was quite good.  ", "Obviously freshly made vs. having been made in a big batch earlier.  ", "Generous chunks of tuna and nice firm avocado and mango.  ", "Volcano roll was also quite good with an interesting and unique mix of hamachi, sprouts, gobo.  ", "There is nothing fancy going on here, but what they do they execute well.  ", "I thought this was a solid meal and we would definitely go back."], "author": "Mae O.", "review": "I hadn't been to Godzila in probably over a decade.  We were headed to another sushi place in the neighborhood but we drove by Godzila and I remembered how much I used to like it.  I'm glad we returned.  The sushi is still very solid.  Fish is fresh.  Not much else on the menu besides sushi, so don't expect udon, etc.  I had the poke and thought it was quite good.  Obviously freshly made vs. having been made in a big batch earlier.  Generous chunks of tuna and nice firm avocado and mango.  Volcano roll was also quite good with an interesting and unique mix of hamachi, sprouts, gobo.  There is nothing fancy going on here, but what they do they execute well.  I thought this was a solid meal and we would definitely go back.", "rating": 4, "date": "2014-01-18"}], "fried oyster": [], "black cod misoyaki": [], "salmon misoyaki": [], "spicy girl": [{"excerpts": ["I highly recommend their Spicy Girl and Mussels for appetizers. "], "author": "Kiara E.", "review": "I've been meaning to write this review for the past 3 years. Better late than never, amirite?\n\nI recommend this place to all colleagues, friends, out-of-town guests, people who ask for recommendations on where to get great sushi. \n\nI've been going to this place for 3 years now and it never gets old. You're sure to see me here at least once a week...sometimes 2-3 times per week! I highly recommend their Spicy Girl and Mussels for appetizers. Yum!\n\nTheir customer service is phenomenal and all employees are so personable. \n\nGodzila, I love you! Keep up the amazing business.", "rating": 5, "date": "2015-05-12"}], "godzilla egg": [], "godzilla crumble": [], "godzilla eye  pc": [], "gomaae": [], "ohitashi": [], "sunomono": [], "godzilla salad": [{"excerpts": ["get the spider roll or godzilla salad if you come here! ", ":)"], "author": "Delano P.", "review": "Great customer service and equally as great food. The staff is friendly and this establishment is very clean. Portions are a little small but everything is priced decently. This isn't a place to bring your whole family being as it's san Francisco and everything is cramped, but if you are in the area with a friend or two i'd check this place out. it's cutely decorated as well...not that that matters much. get the spider roll or godzilla salad if you come here! :)", "rating": 4, "date": "2017-06-13"}, {"excerpts": ["Highly recommend the 49er roll and the godzilla salad."], "author": "Erin K.", "review": "Awesome food, service is quick and to the point, prices are insanely reasonable AND fish is very good quality. This hidden gem is exactly what I'm looking for at least 2 nights a week. Highly recommend the 49er roll and the godzilla salad.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["4 stars\n\nGodzilla salad - 4 stars\n\nPlayboy and White Dragan roll - 2 stars \n\n3.33333333... ", "The Godzilla Salad was a really nice surprise, think the side salad you get in a bento but dressed up. ", "No complaints for $5. ", "Sometimes it's nice to not make reservations, wait, make a trek, or break the bank for dinner. ", "A lot of people have said it already, this is a great neighborhood spot. ", "We found it accidentally while looking for something else, but we'll be back."], "author": "Alan C.", "review": "Sake toro, walu, hotatei, hamachi, sake, ikura, ika nigiris - all good. 4 stars\n\nGodzilla salad - 4 stars\n\nPlayboy and White Dragan roll - 2 stars \n\n3.33333333... we'll round up! This is a chill place to have dinner and was decently priced. It's not amazing and some of the rolls are redundant (I'm more of a nigiri person anyway), but the night we went the fish was fresh and everything tasted good. The Godzilla Salad was a really nice surprise, think the side salad you get in a bento but dressed up. No complaints for $5. Sometimes it's nice to not make reservations, wait, make a trek, or break the bank for dinner. A lot of people have said it already, this is a great neighborhood spot. We found it accidentally while looking for something else, but we'll be back.", "rating": 4, "date": "2012-01-04"}, {"excerpts": ["I had the rainbow, tinky winky & Godzilla salad.  ", "It was good."], "author": "Donna L.", "review": "I think it will be one of my new favorite sushi bars.  I had the rainbow, tinky winky & Godzilla salad.  It was good.", "rating": 4, "date": "2012-07-23"}], "tako": [], "shiro maguro": [], "kai bashira": [], "smoked sake": [], "aji": [{"excerpts": ["Nigiri prices weren't bad though, about $3.75 for 2 pieces of Aji or Bonito. \n\n"], "author": "Mellie D.", "review": "Just ate here for dinner and enjoyed their rolls which are well priced.  The two special rolls that stood out for my taste buds were the Godzilla and Tinki Winki (or something something) rolls.  Both were quite delicious and I think each had 3 different kinds of fish in it. Traditional rolls are cheap but also a bit on the smaller side. If you like Saba, try the Gari Saba roll, it's good. \n\nThe nigiri specials they had were pretty tasty, but the fish could be just a tad more fresh or maybe with a little less wasabi/ginger. Just seemed like there were too many flavors on top and under the fish that I couldn't really taste the fish itself. Nigiri prices weren't bad though, about $3.75 for 2 pieces of Aji or Bonito. \n\nTheir salads were cheap, simple, and very good. \n\nWe came exactly at 7pm (Wed.) and got seated right away as there were 3 empty tables and lots of room at the sushi bar. Right after we got seated, the place filled up. \n\nStaff was friendly...though they forgot to bring me the green tea I asked for and water glass was empty for awhile.  I didn't really notice the music at all.\n\nI was hoping this could be a closer alternative to Nippon but it lacked the fresh sashimi.  \n\n(Pictures to be posted later)", "rating": 3, "date": "2007-07-11"}, {"excerpts": ["but the nigiri was sliced very thin and the fish quality was indeed sub par, and as with our Aji just plain Bad.\n\n"], "author": "Zachary K.", "review": "Extremely mediocre sushi with cafeteria-like ambiance.  Of course, these things could be overlooked for really cheap prices (even sushi lovers need their go-to cheap fix...) but they just were not low enough.  Godzilla is another typically priced sushi place with typical mediocre sushi.  But I suppose if you are nearby, don't mind paying mid-range sushi prices for what should be cheap-priced sushi and want to stick to the rolls - sure, go ahead... but the nigiri was sliced very thin and the fish quality was indeed sub par, and as with our Aji just plain Bad.\n\nWith the plethora of sushi places in this city, It is truly a task to find those ones that feel really special. I think Ejji is one of those. Check it out.  The bill will be the same but the freshness of both fish and the recipes is wonderful.", "rating": 2, "date": "2009-02-18"}], "spicy scallop": [{"excerpts": ["Some of my other favorite Godzilla items are:\n - Hamachi Kama\n - Spicy Scallop ", "Hand Roll\n - Voodoo Roll\n "], "author": "Brad W.", "review": "As a local patron of Godzilla sushi at least once a month, for five years now, I can honestly say Godzilla sushi is the best affordable sushi in SF!  The fish is always fresh, the rolls are inventive and delicious, and the spicy mussels are the greatest thing that ever touched my lips.\n\nOne hungry evening, I came to Godzilla and only ordered 8 orders of spicy mussels (that's 16 large mussel shells covered in mussels and spicy sauce!  You can never have too many.  They are the best, and no other restaurant makes anything comparable.\n\nSome of my other favorite Godzilla items are:\n - Hamachi Kama\n - Spicy Scallop Hand Roll\n - Voodoo Roll\n - The Lazy Monkey Roll was one of my fav's, but its no longer on the menu..\n\nThe staff is always friendly and attentive, and the place is casual and comfortable.  The walls are adorned with napkin drawings and movie posters of Godzilla in the Golden age of film.\n\nCheck it out if you don't like over paying for your sushi.  As for the spicy mussels, consider yourself warned - once you try them you will be hooked!", "rating": 5, "date": "2010-11-10"}, {"excerpts": ["The spicy scallop nigiri was excellent as well.\n\n"], "author": "Afton T.", "review": "Boyfriend picked me up from a facial tonight and we went to pick up sushi-I looked so fucking nasty that everyone inside Godzila probably thought he was a saint for dating me. That or I had an AMAZING personality. ANYWAY. \n\nBeen meaning to come here for a while as many people recommend it as a cheap sushi place that's not nasty, and fairly close to my house. And I was pleasantly surprised tonight!\n\nHad 2 orders of miso, seaweed salad, 3 orders of nigiri, a yellowtail / scallion roll and the Tinky Winky roll-we were both satisfied for $32-which I was happy with. \n\nWe took the food to go, so cant really comment on the service. The food was very good though. As others have said, the tinky winky roll is while horribly named, frickin delicious-salmon, scallops and crab! The spicy scallop nigiri was excellent as well.\n\nDefinitely will go back, probably again to take out, because the ambiance was not my favorite-but good sushi for a good price.", "rating": 4, "date": "2010-01-13"}, {"excerpts": ["Nigiri: halibut, sweet shrimp, salmon, and spicy scallop. ", "The cuts of the fish were good, not too thin and not too thick and all of it was fresh and delicious. \n", "MINUS points because I love the heads of the sweet shrimp. ", "They come fried and delicious..."], "author": "Yuliya R.", "review": "3.5 stars....if you can give half stars on yelp I havent figured out how to do that yet so...there you have it...3.5 \n\nSo this evening i felt like some sushi and I didnt want to spend a ton of cash so I decided to take Boyfriend here for dinner. I have never been before, and I read the reviews, so I didnt have the highest expectations but I was hoping for some solid tasty fresh rolls. \n\nthere is nothing much that I can add about the deco except that even though there are not alot of tables it feels pretty spacious so even when it is packed you never feel cramped. It was pretty busy but we walked in at a good moment and got the only available table, a super score as I was starving. \n\nWe had two waitresses...the first one was a lot nicer than the second one who kept walking by the table and seeing if we were done with our plate making us feel a bit rushed but nothing too bad. \nThe Food: \nDrinks: we just had tea and it was the toasted brown rice green tea which I love but it was way overbrewed which is like...common its tea at a japanese place...\nAppitizers: miso soup, spinach salad, green salad, and spicy mussels. \nThe soup was okay and the liked the spinach salad a lot, especially because the portion was not super tiny like in most places and the sauce was super tasty.\nMINUS points because the green salad dressing wasnt that sesame dressing that usually comes on green salads and that was disappointing. Also. i ordered the green salad at Halu and it was so delicious for a green salad that my expectations are probably way too high for any other place. also,\nMAJOR MINUS points because the spicy scallops arrived at the end of the meal. Like...so late that we asked for our check and I told the waitress to make sure we were not charged and as she walked away they were ready at the window so she brought them over. Now I only ordered these guys because a previous yelper said they were good and let me tell you THEY WERE NASTY NASTY NASTY. First of all  they were overcooked and the edges were burned, second it wasnt like one mussel it was mussel pieces that were all chopped up and the mayo sauce was gross and I really wanted to spit it out. Actually the experience was so bad I had order another nigiri just to get the taste out of my mouth. so sad.\n\nNigiri: halibut, sweet shrimp, salmon, and spicy scallop. The cuts of the fish were good, not too thin and not too thick and all of it was fresh and delicious. \nMINUS points because I love the heads of the sweet shrimp. They come fried and delicious...but these heads were either over deep fried, or the oil was kind of getting old or something because they did not taste good at all. \n\nRolls: spicy cali with real crab and the kamakazi with yellowtail were both super tasty and delicious. They were not super huge which is what I kind of expected just from the name of the restaurant but they were not tiny or badly made so that makes me a big fan. \n\nTotal $46 with tip. Not too bad considering.  \nI think that I would most certainly come back for a quick bite but never ever order the spicy mussels...oh no...just stay away......", "rating": 3, "date": "2010-10-15"}, {"excerpts": ["-- hub liked this one\n- walu (hawaiian white fish) -- yumm --rich & tender, hub thought it was oily\n- spicy scallop -- yumm \n- nasu (eggplant) -- nice flavor (love sushi zone's version more)\n- u-nasu roll -- unagi, eggplant, cucumber (or was it avocado) ", "-- yumm -- "], "author": "Cindi N.", "review": "nice to be back, its been a long while since we ate here, hub used to live in the area so used to come here all the time......\n\nnice to come in right at 5:30 & not have to wait in line (wanted sushi zone, but didn't want to deal with waiting that day), good alternative to sushi zone if we don't want to wait & be super casual, no scene.......\n\ngood sushi, good service that night, like the godzilla theme & the various sketches of godzilla now on 2 separate frames on the wall\n\nhad the following & all were good\n- spicy mussel appetizer \n- tai (red snapper)\n- suzuki (sea bass) -- hub liked this one\n- walu (hawaiian white fish) -- yumm --rich & tender, hub thought it was oily\n- spicy scallop -- yumm \n- nasu (eggplant) -- nice flavor (love sushi zone's version more)\n- u-nasu roll -- unagi, eggplant, cucumber (or was it avocado) -- yumm -- i love eggplant, works really well with unagi or by itself\n- sake (salmon) & asparagus -- another favorite combination, salmon was so moist & tender........\n\ngreat to be back, won't forget you again......", "rating": 3, "date": "2007-07-02"}, {"excerpts": ["Also, great spicy scallop!  ", "Often a wait, so better to go early or late."], "author": "Jes H.", "review": "Godzila is a great neighborhood spot with cheap sushi and a few pretty special items.  I think it's pretty serious value for the money.  The Lazy Monkey roll, while containing so many non-fish items as to barely qualify as sushi (banana, cream cheese, avocado, etc...), is also scrumptious.  It's sushi comfort food.  The service is brusque, but it's part of the character of the joint, and we've now come to view our scowly servers with a skewed sort of affection.  Also, great spicy scallop!  Often a wait, so better to go early or late.", "rating": 3, "date": "2006-03-20"}], "ama ebi": [], "nasu": [{"excerpts": ["Nasu roll ($3.95, Japanese eggplant): simple and light\n\n("], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["Unagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\n"], "author": "Kevin F.", "review": "Saba\nUnagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\nTea\n\nAll was underwhelming. Not spicy. Sketchy service.\nStomach issues within 35 minutes!", "rating": 2, "date": "2017-05-14"}, {"excerpts": ["U-nasu roll with eel and japanese eggplant for $5 is a favorite of mine.\n-Good ", "green tea with your own little teapot ", "they will refill endlessly\n- Exciting mochi flavors! ", "I've really enjoyed the Guava, Chocolate/Peanut Butter, Chocolate/Coconut... mm.\n"], "author": "Remi X.", "review": "Cheap, casual neighborhood sushi joint with decent quality for price.\n\nPositives:\n-Friendly staff/quick service (prompt with drink refills, etc)\n-Laid-back atmosphere with some cool decor (vintage Godzilla posters.. but then again I am a fan, ha)\n-Rolls pretty good, inexpensive. U-nasu roll with eel and japanese eggplant for $5 is a favorite of mine.\n-Good green tea with your own little teapot they will refill endlessly\n- Exciting mochi flavors! I've really enjoyed the Guava, Chocolate/Peanut Butter, Chocolate/Coconut... mm.\n-Decent alternative to Tataki sushi if you're too hungry to wait.\n\nNegatives:\n-The music is the biggest turn-off for me! Mostly 90s top 40 Lilith-Fair-esque crooning from Sarah Maclachlan, etc.. with a few bland Japanese songs mixed in. If they played cooler music the whole vibe would be much improved. (Take a hint from Ryoko's! Sushi always tastes better with a side of cool beats. Fact.)\n- Most of the specialty rolls have the all-too-common problem of the pieces being WAY TOO BIG! I firmly believe you should be able to eat a whole roll without having your cheeks bulge out like a chipmunk or worse, make a mess trying to bite the roll in half. It's just not a good situation. However, the rolls are pretty tasty.\n\nOverall I'd give it a 3.5, but I still come here quite a bit.", "rating": 4, "date": "2011-06-06"}, {"excerpts": ["Nothing to crazy: spicy California, spicy tuna, a spider roll, and a U-Nasu roll (BBQ eel, eggplant, cucumber).\n\n"], "author": "Dave B.", "review": "Two friends of mine were getting married back in '05 and wanted for me to be involved in the wedding. Either the bride or the groom could've claimed me for their side. I didn't really have a preference and they rejected my suggestion of officiating the wedding. Apparently, they had tossed the idea around a bit, but finally realized that it'd be a problem. \n\n\"A problem?\" I wondered.\n\n\"You mumble. People won't hear you.\"\n\nTonight, my girl and I went to Godzilla Sushi. She wanted me to pick a place. I wanted sushi. Her good friend loves the place. I wanted somewhere we could walk to. So here we were. \n\nSo how do these stories relate? Well, she had to ask me more than a dozen times to repeat myself. I swear it was because the music at Godzilla was so loud that my normal speaking voice was drowned out.\n\nThe food was OK. The service was OK. There was nothing special here at all. I'm not sure how anyone could love the place, but that's OK. Some people wake up everyday and look in the mirror and remark how much they love themselves. If I can be OK with that, I guess I can be OK with this. \n\n(Note: I think people do this with mirrors. I'm not sure. I've never known anyone besides the sweater freak on SNL back in the early 90s. But that's mmm-OK.\"\n\nWe started with edamame which had no flavor. Followed this with a simple green salad with a sesame-miso dressing that turned the bowl of crunch lettuce into a soupy messy by the end. \n\nWe opted for rolls. Nothing to crazy: spicy California, spicy tuna, a spider roll, and a U-Nasu roll (BBQ eel, eggplant, cucumber).\n\nI washed it down with a 7-Up until the waitress re-filled my glass with water. She noticed her mistake and got me a new can. And, that was really nice of her since I was essentially done with it already.\n\nI wasn't expect much coming here. I don't expect I'll ever come back. It's just OK in a city that has much better sushi. We just have to find it!\n\nCan Yelpers Help Me? Please! I need good fish.", "rating": 3, "date": "2008-08-07"}, {"excerpts": ["We tried 4 Specialty Rolls listed on the white board behind the bar:\n- U-Nasu: ", "Eel + Eggplant (Nasu) ", "(6 pieces) ", "- this was different, and tasted nice and light.\n", "- Pink Dragon Roll (8 pieces): pink cuz of the Salmon on the top - first piece was pretty tasty ", "but it starts to feel heavy ", "cuz there's mayo mixed in the crab meat center.\n", "- Winky Tinky Roll (6 pieces): not sure of the name ", "but it's scallops and another fish. ", "This had the crab/mayo thing too. ", "So a little overkill when 2 out of 4 are heavy. ", "Can't really taste the seafood sadly.\n", "- Godzilla Roll (4 pieces): yellowtail, tuna with spouts and tobiko. ", "This was my favorite of the set. "], "author": "Cindy W.", "review": "When we arrived, there were still open seats, but wow, it filled up after 8p. Looks like a neighborhood favorite sushi bar. I think I know why - cheap prices and decent sushi (for SF sushi anyway).\n\nWe tried 4 Specialty Rolls listed on the white board behind the bar:\n- U-Nasu: Eel + Eggplant (Nasu) (6 pieces) - this was different, and tasted nice and light.\n- Pink Dragon Roll (8 pieces): pink cuz of the Salmon on the top - first piece was pretty tasty but it starts to feel heavy cuz there's mayo mixed in the crab meat center.\n- Winky Tinky Roll (6 pieces): not sure of the name but it's scallops and another fish. This had the crab/mayo thing too. So a little overkill when 2 out of 4 are heavy. Can't really taste the seafood sadly.\n- Godzilla Roll (4 pieces): yellowtail, tuna with spouts and tobiko. This was my favorite of the set. Bigger pieces of fish, not heavy, had crunch to the texture from the tobiko.\n\nSo Godzilla doesn't serve the best cuts of fish, nor are the rolls Godzilla sized, but at about $5 - $6 a roll (there are cheaper ones too like spicy tuna), Godzilla serves a King Kong deal.", "rating": 3, "date": "2008-02-28"}, {"excerpts": ["I ended up with the Spider Roll, the U-nasu Roll, and the Philly Roll. ", "All of which were amazing.\n"], "author": "Jessica P.", "review": "I had heard tales of Godzila sushi- of the innovative roll combos, the excellent mochi, and the awesome mural on the back wall, but nothing prepared me for the onslaught of delicious roll after roll that I got here.\n\nWe got there relatively early, only waited 5 minutes for a table and had a really hard time narrowing our choices down from their great menu of specialty rolls.\n\nI ended up with the Spider Roll, the U-nasu Roll, and the Philly Roll. All of which were amazing.\nA little nigori sake and a lot of mochi for dessert made it one of the best sushi experiences I have had in SF.\n\nThe peanut butter-chocolate mochi was sinful. Yum.", "rating": 5, "date": "2007-11-14"}, {"excerpts": ["But, If I come out for some nookey-nookey and nasu has been 86'd from the menu...", "I'm gonna find you."], "author": "Inbal R.", "review": "All I have to say is \"Naaah-sooooh\"\n\n\nDelicious Japanese eggplant with some sort of ponzu sauce. Even good for the person who despises eggplant, for whatever reason.  Get as many as you can, and enjoy. But, If I come out for some nookey-nookey and nasu has been 86'd from the menu...I'm gonna find you.", "rating": 5, "date": "2007-03-26"}, {"excerpts": ["-- hub liked this one\n- walu (hawaiian white fish) -- yumm --rich & tender, hub thought it was oily\n- spicy scallop -- yumm \n- nasu (eggplant) -- nice flavor (love sushi zone's version more)\n- u-nasu roll -- unagi, eggplant, cucumber (or was it avocado) ", "-- yumm -- "], "author": "Cindi N.", "review": "nice to be back, its been a long while since we ate here, hub used to live in the area so used to come here all the time......\n\nnice to come in right at 5:30 & not have to wait in line (wanted sushi zone, but didn't want to deal with waiting that day), good alternative to sushi zone if we don't want to wait & be super casual, no scene.......\n\ngood sushi, good service that night, like the godzilla theme & the various sketches of godzilla now on 2 separate frames on the wall\n\nhad the following & all were good\n- spicy mussel appetizer \n- tai (red snapper)\n- suzuki (sea bass) -- hub liked this one\n- walu (hawaiian white fish) -- yumm --rich & tender, hub thought it was oily\n- spicy scallop -- yumm \n- nasu (eggplant) -- nice flavor (love sushi zone's version more)\n- u-nasu roll -- unagi, eggplant, cucumber (or was it avocado) -- yumm -- i love eggplant, works really well with unagi or by itself\n- sake (salmon) & asparagus -- another favorite combination, salmon was so moist & tender........\n\ngreat to be back, won't forget you again......", "rating": 3, "date": "2007-07-02"}, {"excerpts": ["but it's got unagi and nasu (eel and japanese eggplant).\n\n"], "author": "dave w.", "review": "it's so good, because it's so close to my place.\n\nthey have some roll with a really weird name - tinky winky, maybe? but it's got unagi and nasu (eel and japanese eggplant).\n\ndelicious.", "rating": 4, "date": "2006-10-18"}, {"excerpts": ["topping the list is the nasu, or japanese eggplant.  ", "adorable and so delicious.  ", "and my husband loved their non-veg roll selection.  ", "pretty cheap too!  ", "we had sake, 5 rolls and edamame for less than $30.  ", "only thing that could make it better would be if the miso was vegetarian--it bothers me that fish powder is always added to ruin a perfectly good miso soup."], "author": "kate s.", "review": "very good sushi!  this place is close to my house but for some reason it took us 4 years to visit.  now we're hooked.  friendly service, even when packed during dinner time.  not many vegetarian selections but what they have is wonderful.  topping the list is the nasu, or japanese eggplant.  adorable and so delicious.  and my husband loved their non-veg roll selection.  pretty cheap too!  we had sake, 5 rolls and edamame for less than $30.  only thing that could make it better would be if the miso was vegetarian--it bothers me that fish powder is always added to ruin a perfectly good miso soup.", "rating": 4, "date": "2008-07-29"}], "avocado roll": [{"excerpts": ["I ordered a avocado roll and spider roll, both are delicious! ", "It's a cozy place with a nice size sushi bar fit for about 8 I would say."], "author": "Margarita R.", "review": "Came here with a friend on a Wednesday night just recently. It had been my first time trying Godzilla! We had been greeted by a nice server who sat us promptly. I ordered a avocado roll and spider roll, both are delicious! It's a cozy place with a nice size sushi bar fit for about 8 I would say.", "rating": 5, "date": "2017-06-15"}], "garden roll": [{"excerpts": ["I had avocado maki and a garden roll, which are some of the very slim pickings offered to the vegetarians. ", "My attempt to pass on the seafood was a waste of time because my food was liberally sprinkled with tobiko. ", "I would guess that this bonus was a result of the preparer not adequately cleaning his hands or prep surface after making my companion's food. ", "The seaweed on my avocado maki was so tough that I had to pull on the roll while biting down to cut through it. ", "The decor and ambience reminded me of Escape from New York Pizza on Haight. ", "It was dimly lit with overhead fluorescent bulbs and a TV propped up in the corner tuned to an NBA game. ", "And the service: I think I may have been piloting Wonder Woman's plane through the restaurant because I was invisible. ", "It's a mile away ", "but I would rather go to Nagano. ", "Same prices, better everything."], "author": "Bovis P.", "review": "Low priced sushi in a bare bones atmosphere. If you want cheap sushi and will eat anything, this is your place.\n\nMy dining partner had a nigiri sampler and a roll prominiently featuring tobiko and in all honesty he was very happy. I expect that he would be ready to return any day of the week. I had avocado maki and a garden roll, which are some of the very slim pickings offered to the vegetarians. My attempt to pass on the seafood was a waste of time because my food was liberally sprinkled with tobiko. I would guess that this bonus was a result of the preparer not adequately cleaning his hands or prep surface after making my companion's food. The seaweed on my avocado maki was so tough that I had to pull on the roll while biting down to cut through it. The decor and ambience reminded me of Escape from New York Pizza on Haight. It was dimly lit with overhead fluorescent bulbs and a TV propped up in the corner tuned to an NBA game. And the service: I think I may have been piloting Wonder Woman's plane through the restaurant because I was invisible. It's a mile away but I would rather go to Nagano. Same prices, better everything.", "rating": 2, "date": "2007-03-27"}, {"excerpts": ["We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. ", "I was pleasantly surprised by how good the food was. ", "I usually hate Japanese food, but the sushi was flippin insane! ", "The ingredients were fresh and the service was pretty quick. ", "Maybe because it was a Monday night and we walked in around 9:30 pm. ", "Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!..."], "author": "Tushar V.", "review": "Love the ambiance. Its uniquely tacky, yet super cool, with a huge Godzilla Motif on the wall, along with other forms of Godzilla art, that adorn the walls. I happened to stumble by Godzila on my way to Tortilla Heights. TH was about to close down, so my friends and i decided to go across to Godzilla. Getting down to the food, the menu is pretty limited. They only serve Sushi/Sashimi/Rolls and have an even tinier selection for vegetarians. I was disappointed at first, but we stuck around nonetheless. We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. I was pleasantly surprised by how good the food was. I usually hate Japanese food, but the sushi was flippin insane! The ingredients were fresh and the service was pretty quick. Maybe because it was a Monday night and we walked in around 9:30 pm. Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!...Oh, and their plum wine is decent as well, give it try will ya.", "rating": 4, "date": "2008-11-26"}], "veg tempura roll": [], "futo maki": [], "green godzilla roll": [], "gari saba roll": [{"excerpts": ["If you like Saba, try the Gari Saba roll, it's good. \n\n"], "author": "Mellie D.", "review": "Just ate here for dinner and enjoyed their rolls which are well priced.  The two special rolls that stood out for my taste buds were the Godzilla and Tinki Winki (or something something) rolls.  Both were quite delicious and I think each had 3 different kinds of fish in it. Traditional rolls are cheap but also a bit on the smaller side. If you like Saba, try the Gari Saba roll, it's good. \n\nThe nigiri specials they had were pretty tasty, but the fish could be just a tad more fresh or maybe with a little less wasabi/ginger. Just seemed like there were too many flavors on top and under the fish that I couldn't really taste the fish itself. Nigiri prices weren't bad though, about $3.75 for 2 pieces of Aji or Bonito. \n\nTheir salads were cheap, simple, and very good. \n\nWe came exactly at 7pm (Wed.) and got seated right away as there were 3 empty tables and lots of room at the sushi bar. Right after we got seated, the place filled up. \n\nStaff was friendly...though they forgot to bring me the green tea I asked for and water glass was empty for awhile.  I didn't really notice the music at all.\n\nI was hoping this could be a closer alternative to Nippon but it lacked the fresh sashimi.  \n\n(Pictures to be posted later)", "rating": 3, "date": "2007-07-11"}], "ginger tuna roll": [], "hamanegi roll": [], "salmon skin roll": [{"excerpts": ["We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). ", "I liked the hodorah and salmon roll the most. ", "Neither of us were too big of a fan of the salmon skin. ", "It was drier than other places I've had it at."], "author": "Linda X.", "review": "Decent quality of sushi and good prices especially for the area. The service was nice and attentive and there is plenty of seating inside. \n\nMy boyfriend and I got the tempura shrimp and vegetable appetizer ($8). It was on the oily side but pretty good. We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). I liked the hodorah and salmon roll the most. Neither of us were too big of a fan of the salmon skin. It was drier than other places I've had it at.", "rating": 3, "date": "2015-11-29"}, {"excerpts": ["Ordered the salmon skin roll, which came out hot and it wasn't crunchy. ", "Would not recommend this roll. ", "Seaweed salad and sake roll ", "we're both OK/good. ", "Overall, Godzilla is not the best or highest quality sushi in town but a solid option for those in the neighborhood. ", "I thought the menu was quite limited- not many options compared to other places. ", "Great ambiance but does get rowdy at night."], "author": "Sarem G.", "review": "Ordered the salmon skin roll, which came out hot and it wasn't crunchy. Would not recommend this roll. Seaweed salad and sake roll we're both OK/good. Overall, Godzilla is not the best or highest quality sushi in town but a solid option for those in the neighborhood. I thought the menu was quite limited- not many options compared to other places. Great ambiance but does get rowdy at night.", "rating": 3, "date": "2017-06-03"}], "philly roll": [{"excerpts": ["We ordered the philly roll, rainbow roll, dragon roll, and tinky winky. ", "The tinky winky and philly were pretty good, but the rainbow and dragon were very small compared to a lot of other places i've been to- paying $9+ per roll "], "author": "M W.", "review": "Left Bestbuy and was craving for sushi so we decided to stop by Godzilla since it was close by. The restaurant has about 5 4-seater tables and an entire row of seating along the bar. I've been to a lot of sushi places and this has got to be one of the brightest- the lights really shine brightly!\n\nThe menu was very simple and featured sushi that were pretty cheap in price; however the special rolls were priced pretty comparable to other places. We ordered the philly roll, rainbow roll, dragon roll, and tinky winky. The tinky winky and philly were pretty good, but the rainbow and dragon were very small compared to a lot of other places i've been to- paying $9+ per roll I would of expected the sushi to be a little bigger at least.\n\nService here was good- we got greeted by the waitress and the sushi chef once we entered and got served tea right away. Would I come back? My bf says probably not.", "rating": 3, "date": "2009-01-07"}, {"excerpts": ["I ended up with the Spider Roll, the U-nasu Roll, and the Philly Roll. ", "All of which were amazing.\n"], "author": "Jessica P.", "review": "I had heard tales of Godzila sushi- of the innovative roll combos, the excellent mochi, and the awesome mural on the back wall, but nothing prepared me for the onslaught of delicious roll after roll that I got here.\n\nWe got there relatively early, only waited 5 minutes for a table and had a really hard time narrowing our choices down from their great menu of specialty rolls.\n\nI ended up with the Spider Roll, the U-nasu Roll, and the Philly Roll. All of which were amazing.\nA little nigori sake and a lot of mochi for dessert made it one of the best sushi experiences I have had in SF.\n\nThe peanut butter-chocolate mochi was sinful. Yum.", "rating": 5, "date": "2007-11-14"}, {"excerpts": ["We had a dragon roll (so so), Tinky Winky which was good, the Philly roll which was good and some inari.\n\n"], "author": "Brian L.", "review": "I have been going here for years.  In fact, I first tried this place back in '94.\n\nThe California salad with crab has to be one of the best tasting salad dressings I have ever had.  So good....\n\nWe had a dragon roll (so so), Tinky Winky which was good, the Philly roll which was good and some inari.\n\nThe total bill was $35.", "rating": 3, "date": "2008-11-04"}, {"excerpts": ["We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. ", "I was pleasantly surprised by how good the food was. ", "I usually hate Japanese food, but the sushi was flippin insane! ", "The ingredients were fresh and the service was pretty quick. ", "Maybe because it was a Monday night and we walked in around 9:30 pm. ", "Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!..."], "author": "Tushar V.", "review": "Love the ambiance. Its uniquely tacky, yet super cool, with a huge Godzilla Motif on the wall, along with other forms of Godzilla art, that adorn the walls. I happened to stumble by Godzila on my way to Tortilla Heights. TH was about to close down, so my friends and i decided to go across to Godzilla. Getting down to the food, the menu is pretty limited. They only serve Sushi/Sashimi/Rolls and have an even tinier selection for vegetarians. I was disappointed at first, but we stuck around nonetheless. We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. I was pleasantly surprised by how good the food was. I usually hate Japanese food, but the sushi was flippin insane! The ingredients were fresh and the service was pretty quick. Maybe because it was a Monday night and we walked in around 9:30 pm. Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!...Oh, and their plum wine is decent as well, give it try will ya.", "rating": 4, "date": "2008-11-26"}], "rock n roll": [{"excerpts": ["Unagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\n"], "author": "Kevin F.", "review": "Saba\nUnagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\nTea\n\nAll was underwhelming. Not spicy. Sketchy service.\nStomach issues within 35 minutes!", "rating": 2, "date": "2017-05-14"}, {"excerpts": ["what i really like is the rock n roll attitude and the godzilla paraphernalia. ", "fun for a monday or tuesday night out."], "author": "May T.", "review": "meh. \n\nsushi is run-o-the-mill cali style hybrid stuff. what i really like is the rock n roll attitude and the godzilla paraphernalia. fun for a monday or tuesday night out.", "rating": 2, "date": "2008-02-16"}], "kamikaze roll": [{"excerpts": ["We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). ", "I liked the hodorah and salmon roll the most. ", "Neither of us were too big of a fan of the salmon skin. ", "It was drier than other places I've had it at."], "author": "Linda X.", "review": "Decent quality of sushi and good prices especially for the area. The service was nice and attentive and there is plenty of seating inside. \n\nMy boyfriend and I got the tempura shrimp and vegetable appetizer ($8). It was on the oily side but pretty good. We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). I liked the hodorah and salmon roll the most. Neither of us were too big of a fan of the salmon skin. It was drier than other places I've had it at.", "rating": 3, "date": "2015-11-29"}, {"excerpts": ["Kamikaze roll; Yummy! ", "Can't remember what's in it ", "but..I will be eating this often when I come here for lunch.\n"], "author": "Jo L.", "review": "Godzila salad is a MUST TRY 'if' you like salads with semi-heavy but uber delicious dressing! This salad consists of round lettuce, avocado, carrots, real crab meat, shrimp, spinach, tomatoes, and MORE! With a drizzle of creamy sesame dressing on top. *I am drooling as I write this review*---\n\nSpicy tuna roll; A-okay, not super stoked about it. I think its rather plain... eh?\nKamikaze roll; Yummy! Can't remember what's in it but..I will be eating this often when I come here for lunch.\nTempura udon; Love the broth and everything in it (even though its quite simple)\n\nI've been here about.. 4 times since I have started working in lower pac. heights. This place is decent pricing for Japanese Cuisine, customer service is GOOD, pricing is unbelievable and I always leave with a FOOD COMA! LOL.", "rating": 4, "date": "2012-02-14"}, {"excerpts": ["Kamikaze roll is delicious! ", "Give em a try!"], "author": "Kali L.", "review": "EXCELLENT SUSHI! My favorite sushi place in SF, hands down. Quality sushi at a reasonable price. Kamikaze roll is delicious! Give em a try!", "rating": 5, "date": "2013-01-28"}, {"excerpts": ["Ordered the california roll, kamikaze roll with yellow tail, rock n' roll, and the tiger roll.  ", "All were excellent although the kamikaze roll was definitely my favorite.  ", "Not quite sure if this is the place to go for an atmospheric sushi dinner or date night, but it definitely hits the spot for lunch, an easygoing dinner, and any time that you want some delicious sushi for a great price.  ", "Planning on grabbing my lunch from here again tomorrow!"], "author": "Nicole S.", "review": "Awesome little sushi spot.  Just moved to the area, always pass this place on the bus and have been dying to try it.  Good thing I finally did!  Completely satisfied the massive craving for sushi that I was having and will definitely be going back on a regular basis.  I ordered take out for lunch; amazing price (lunch prices but their dinner prices are great too) for both quantity and quality!  Ordered the california roll, kamikaze roll with yellow tail, rock n' roll, and the tiger roll.  All were excellent although the kamikaze roll was definitely my favorite.  Not quite sure if this is the place to go for an atmospheric sushi dinner or date night, but it definitely hits the spot for lunch, an easygoing dinner, and any time that you want some delicious sushi for a great price.  Planning on grabbing my lunch from here again tomorrow!", "rating": 4, "date": "2011-12-11"}], "spicy california roll": [{"excerpts": ["I ordered the spicy California roll, and the sauce was not too overpowering, but it was definitely spicy. ", "My only complaint with my food was that the roll was really tiny compared to their other rolls. \n", "Because I got my food on time and ", "because it was good, I had no other problems here.\n", "My friends didn't like it because all of our food came out at much different times, and they were very slow to service our table. ", "We all enjoyed our food, though."], "author": "Colby D.", "review": "I, unlike my friends for whatever reason, actually really enjoyed my food here. They use real crab meat instead of the nasty imitation crab, and the other ingredients tasted really fresh. I ordered the spicy California roll, and the sauce was not too overpowering, but it was definitely spicy. My only complaint with my food was that the roll was really tiny compared to their other rolls. \nBecause I got my food on time and because it was good, I had no other problems here.\nMy friends didn't like it because all of our food came out at much different times, and they were very slow to service our table. We all enjoyed our food, though.", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["I recommend that spicy california roll (only like $5!) and the pink dragon roll. ", "Also- make sure to try the sake during happy hour, super cheap. ", "If you're in the neighborhood, definitely give this place a try. ", "Most affordable sushi with the best quality in SF I've had to date."], "author": "Kara L.", "review": "Awesome no fuss, casual sushi spot.\n\nThe service was great- met a few friends here last night and our waitress did an awesome job accomodating everyone's needs. A friend asked for extra tobiko and luckily our waitress realized immediately that he probably wasnt asking for extra fish eggs...\nThe rolls were great for the price. Fresh, pretty creative, and tasty. The inside is filled with hand made art and napkin doodles of Godzilla- pretty kitschy and charming. I recommend that spicy california roll (only like $5!) and the pink dragon roll. Also- make sure to try the sake during happy hour, super cheap. If you're in the neighborhood, definitely give this place a try. Most affordable sushi with the best quality in SF I've had to date.", "rating": 4, "date": "2011-01-25"}, {"excerpts": ["The Maguro Nigiri was not the best I have had, but the Spicy California Roll was pretty delicious.\n\n"], "author": "Adam O.", "review": "Good value sushi.\n\nI was pretty annoyed because we did not get a seat for ages (way over the estimated time quoted)... but I guess that comes with the good-cheap-sushi territory.\n\nThe Maguro Nigiri was not the best I have had, but the Spicy California Roll was pretty delicious.\n\nNot the best sushi in the world, so the long wait definitely entices me to just walk to Fillmore to go to Osaka.  Slightly more expensive but much better sushi.", "rating": 3, "date": "2007-01-18"}, {"excerpts": ["Dragon roll \nSpicy California roll \n"], "author": "Danielle V.", "review": "This is by far one of my favorite places in San Francisco. They're open about 5 hours a day and always packed. \"Why are they packed?\" you might ask....and I swear you'll know as soon as you step in through the door.  It gets 5 stars, hands down!\n\nTheir rolls are awesome and the spicy tuna is just how I like it....SPICY! The service is friendly and really quick. They always have a great selection of classic rock playing in the background. The huge mural of Godzilla painted on the wall makes you feel like you've been transported to the 80's with chopsticks. The Saki is well priced and we always leave satisfied. \n\n2 people - \n\nSapporo \nSeaweed salad \nTinkie Winkie roll \nDragon roll \nSpicy California roll \nSpicy Tuna roll \n\nAll under $40...amazing stuff! \n\nTry it, you'll like it.", "rating": 5, "date": "2009-06-26"}, {"excerpts": ["What I did enjoy was the spicy california roll, the green salad, and the green tea ice cream. ", "But the overall experience was just ok."], "author": "Sara R.", "review": "Not bad, but not great either. The spicy tuna rolls were gigantic and awkward to eat with cucumber and avocado hanging out of them. The service wasn't anything great either... and then music was too loud to talk comfortably. What I did enjoy was the spicy california roll, the green salad, and the green tea ice cream. But the overall experience was just ok.", "rating": 3, "date": "2008-12-06"}, {"excerpts": ["sat at the bar and the chef was very animated and entertaining, making jokes at me such as, \"we're out of rice\" as he lifted up the huge empty rice cooker when i asked to add the spicy california roll (after being disappointed that the spicy tuna we ordered didn't have the spicy sauce)."], "author": "Diana B.", "review": "decent cheap sushi, casual setting. sat at the bar and the chef was very animated and entertaining, making jokes at me such as, \"we're out of rice\" as he lifted up the huge empty rice cooker when i asked to add the spicy california roll (after being disappointed that the spicy tuna we ordered didn't have the spicy sauce).", "rating": 3, "date": "2007-04-01"}, {"excerpts": ["We also had the a spicy California roll and a special roll which I don't remember the name, but it had salmon on the outside. ", "The food was pretty good, but pretty pricey. ", "May go here again. ", "After all, it is Zagat rated."], "author": "Andrew Y.", "review": "Went here for dinner. The prices were a little high. The decor was really lacking. We got in there just before closed. I thought it was odd that a spicy tuna roll was the most expensive 'regular' roll. I had to order it to find out. It was 4 pieces but large. The roll was pretty good. We also had the a spicy California roll and a special roll which I don't remember the name, but it had salmon on the outside. The food was pretty good, but pretty pricey. May go here again. After all, it is Zagat rated.", "rating": 3, "date": "2008-08-03"}], "unasu roll": [], "a  pc nigiri": [], "b  pc nigiri  california roll": [], "c served with miso soup  salad": [], "d served with miso soup  salad": [], "sushi for two": [], "sashimi": [{"excerpts": ["I'm not sure about the quality of the sashimi cuts, but the portions look generous.\n\n"], "author": "Janice C.", "review": "If cheap value and a quick meal is what you're after, Godzila fits the bill.\n\nIn lower Pac Heights where sushi joints are as rare of sighting like Beyonce and Jay Z's twins, you'd be pretty hard pressed to turn this place down. Basic rolls are under $7, jive ass rolls that are drowned in sauces come at $12 - $14 and appetizers are $1.50 to $6, man!! I haven't seen these menu pricing in SF in long while.\n\nI ate beforehand, but hubby was starving: 2 miso soups, agedashi tofu, spicy tuna roll, California roll and the dragon roll was only $39 including tax. I'm not sure about the quality of the sashimi cuts, but the portions look generous.\n\nIf Tataki has a ridiculously long wait, this place is aiiiight.", "rating": 2, "date": "2018-08-03"}, {"excerpts": ["Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) "], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["My favorites are the Godzilla green roll and the sashimi combo. ", "I always have fun at this restaurant. ", "I go here mostly on Friday evenings with friends or coworkers. ", "Everyone is always able to find something they like on the menu. ", "Reasonably priced. "], "author": "Mei L.", "review": "My favorites are the Godzilla green roll and the sashimi combo. I always have fun at this restaurant. I go here mostly on Friday evenings with friends or coworkers. Everyone is always able to find something they like on the menu. Reasonably priced. If you still have room for dessert, try the green tea ice cream or green tea cheese cake.", "rating": 5, "date": "2018-09-30"}, {"excerpts": ["Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. "], "author": "Will H.", "review": "Previously ate here and ordered a couple rolls for take-away. I didn't really enjoy it, but I'm also realizing that in general, I should never order sushi for take away. It just isn't as tasty without the gobs of ginger and dine-in experience that makes eating sushi so enjoyable. \n\nThis time around, ate inside the restaurant and had a much better experience. Their chicken karaage was one of the most tender kaarages I've had. Tender, juicy, yummy. Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. The Godzila roll was also nice, with a bit of spice and good flavor. Good neighborhood sushi in the Pacific Heights area.", "rating": 4, "date": "2016-11-02"}, {"excerpts": ["I highly recommend their sake, hamachi, and tomato sashimi. ", "There's a lot of it, but it's so good. ", "They also have a great selection of sake and beer. ", "Next time you want sushi, try it. ", "You won't be disappointed."], "author": "Erin D.", "review": "Godzila Sushi is, by far, one of my favorite sushi places in the city. The fish is really fresh and the service is great. I highly recommend their sake, hamachi, and tomato sashimi. There's a lot of it, but it's so good. They also have a great selection of sake and beer. Next time you want sushi, try it. You won't be disappointed.", "rating": 5, "date": "2017-12-04"}, {"excerpts": ["They only use real crab and their sashimi is always fresh. "], "author": "Rona V.", "review": "Another one of my go-to places for lunch. I love the sushi here. The proportion of rice to fish is perfect. They only use real crab and their sashimi is always fresh. I have never craved another sushi roll more than I have their Tinky Winky roll (scallop, salmon, crab, avocado and tobiko). It must be the shisho leaf that makes it extra fresh and delicious - just love it! You can't beat the price at $7.50 either. \n\nI also get their Salmon Donburi. The salmon is never overcooked and is served with perfectly steamed broccoli. I ask for extra ginger on the side with everything. Theirs seems to be sweeter than other places. Overall, an inexpensive spot to satisfy my sushi and fish cravings! Thank you Godzila!", "rating": 4, "date": "2016-01-09"}, {"excerpts": ["Their Godzilla sushi is really good and I tried their sashimi tuna and salmon and it tasted pretty good. ", "They were really fast as well. ", "I walked down the street and it was ready in 2-3 mins. ", "However there was a price difference between online and stated on my receipt. ", "I didn't bother mentioning."], "author": "Nino A.", "review": "Their Godzilla sushi is really good and I tried their sashimi tuna and salmon and it tasted pretty good. They were really fast as well. I walked down the street and it was ready in 2-3 mins. However there was a price difference between online and stated on my receipt. I didn't bother mentioning.", "rating": 4, "date": "2017-05-09"}, {"excerpts": ["It's not top-quality sashimi or anything, but my salmon donburi tasted fresh and delicious!  ", "It even came with seaweed salad, a nice surprise! ", "My coworkers orders some sushi rolls, tempura, udon, etc. ", "and all seemed to really like their food. ", "The ambience was nice- low key and decorated with cute Godzilla-themed paraphernalia. ", "It was the perfect place to grab some sushi and/or other Japanese food for lunch. ", "We showed up just before noon, and it did get crowded as we were finishing our meals, so it's helpful to show up early in order to avoid having to wait for a table. ", "I'm looking forward to coming back for more delicious food in the near future!"], "author": "Sarah W.", "review": "Came here with my coworkers for lunch on a weekday and really enjoyed our meals here. Fast and friendly service, meal prices are relatively cheap, and the quality of food is great for the prices.  It's not top-quality sashimi or anything, but my salmon donburi tasted fresh and delicious!  It even came with seaweed salad, a nice surprise! My coworkers orders some sushi rolls, tempura, udon, etc. and all seemed to really like their food. The ambience was nice- low key and decorated with cute Godzilla-themed paraphernalia. It was the perfect place to grab some sushi and/or other Japanese food for lunch. We showed up just before noon, and it did get crowded as we were finishing our meals, so it's helpful to show up early in order to avoid having to wait for a table. I'm looking forward to coming back for more delicious food in the near future!", "rating": 4, "date": "2016-05-16"}, {"excerpts": ["Love the spider roll and sashimi.  ", "Has been around a long time which shows how faithful its patrons are."], "author": "Christian B.", "review": "One of my favorite sushi places in SF. Love the spider roll and sashimi.  Has been around a long time which shows how faithful its patrons are.", "rating": 5, "date": "2017-07-04"}, {"excerpts": ["Being a sashimi freak myself, I ordered the sashimi sampler because of the amount of fish you get for your dollar. ", "However, I was sightless underwhelmed, despite snapping a decent photo (see below). ", "Get a roll, have a beer, and definitely grab some Miso soup. :-)"], "author": "Garrett F.", "review": "If there was a 3.5 stars option, I would use it in this instance. Decent quality sushi but not a high quality sushi restaurant or atmosphere. If you like cheap, hole in the wall sushi joints, you will definitely get your rocks off here. I would suggest the Godzilla roll, the spicy tuna roll, or any of the Asian soups. Being a sashimi freak myself, I ordered the sashimi sampler because of the amount of fish you get for your dollar. However, I was sightless underwhelmed, despite snapping a decent photo (see below). Get a roll, have a beer, and definitely grab some Miso soup. :-)", "rating": 3, "date": "2016-02-06"}, {"excerpts": ["Came here again for my moms early birthday dinner before we catch the Amaluna show at AT&T park and to my disappointment, the sashimi we ordered weren't fresh and were still icy, like it came out the freezer before they served us. ", "Luckily service was good, and still the spider roll disappoints because the fried crab wasn't crispy and kind of soggy. ", "Don't think I will be coming back here to try other things anymore, but will come just to eat the golden dragon roll and 49ers roll. ", "Everything else could be better."], "author": "Amanda C.", "review": "Came here again for my moms early birthday dinner before we catch the Amaluna show at AT&T park and to my disappointment, the sashimi we ordered weren't fresh and were still icy, like it came out the freezer before they served us. Luckily service was good, and still the spider roll disappoints because the fried crab wasn't crispy and kind of soggy. Don't think I will be coming back here to try other things anymore, but will come just to eat the golden dragon roll and 49ers roll. Everything else could be better.", "rating": 3, "date": "2013-12-13"}, {"excerpts": ["Sashimi is always good. ", "Quick service and easy for take out."], "author": "Sarah G.", "review": "My go to neighborhood spot- very consistent, good variety of rolls, high quality fish. Sashimi is always good. Quick service and easy for take out.", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["The nigiri/sashimi was out of this world great!"], "author": "Jeanine C.", "review": "One of the very best Sushi restaurants we've ever been to--and the prices were AMAZING--especially for San Francisco! The nigiri/sashimi was out of this world great!", "rating": 5, "date": "2015-01-08"}, {"excerpts": ["I usually don't get rolls, but I needed something substantial instead of just sashimi tonight.  "], "author": "Tamar D.", "review": "I had a hankering for uncooked fish, and this place is right across the street from my yoga studio - so I remembered it.  \n\nSince when does nigiri come with seaweed?  Since when does nigiri not have a slice of fresh fish atop a small ball of rice?  Since when is the diameter of the roll so much so that it's tough to keep it as one bite?  And what happened when I tried to bite through one side and make it a two-biter?  - it fell ALL over the place.  In the privacy of my own home, I still don't want to look like a cow chewing cud during dinner.  I have my own mental reflection of what I look like to contend with!\n\nThe fish wasn't phenomenal, but it wasn't terrible.  I usually don't get rolls, but I needed something substantial instead of just sashimi tonight.  I forgot that rolls seem to be where sushi joints disguise fish with a crapload of various sauces.  \n\nI couldn't get into it, and have no reason to return with any immediacy.  If I knew that I would get messy, uninspired sushi, I wouldn't have come.", "rating": 2, "date": "2012-01-25"}, {"excerpts": ["Tried the seafood cucumber salad, spicy tuna handroll, and sashimi.  ", "All yum yums."], "author": "Amireh G.", "review": "Nom nom sushi down the road from mi casa. Chill vibe except for the giant Godzilla mural. ROAR! Tried the seafood cucumber salad, spicy tuna handroll, and sashimi.  All yum yums.", "rating": 4, "date": "2013-11-09"}, {"excerpts": ["The hamachi sashimi and half and half sashimi (selection of white tuna, salmon or white fish) ", "dinner are good deals. ", "For only $12 you can get 7 pieces of quality sashimi.\n\n"], "author": "Helen Y.", "review": "Despite our cranky waiter, I'd come back again for the sushi and give Godzilla 3.5 stars.\n\nThe hamachi sashimi and half and half sashimi (selection of white tuna, salmon or white fish) dinner are good deals. For only $12 you can get 7 pieces of quality sashimi.\n\nNow back to the cranky waiter. He wouldn't let us substitute the miso soup for house salad. Fine. So we ordered our salads separately but he still managed to forget the order and then mess it up. After finishing our other dishes and still no sign of salad, I reminded him that I still didn't get my seaweed salad. He came back and handed me the house salad and my friend the seaweed salad which I quickly responded with \"no the other way around.\" He then slammed the house salad next to my friend's side of the table. That was really uncalled for! Service was definitely a miss tonite (yes we're talking 1 star) but given the reasonable prices and fresh fish, I will give Godzilla another chance. Hopefully I will have a more pleasant waiter during my next visit.", "rating": 3, "date": "2006-06-11"}, {"excerpts": ["I had the salmon sashimi which was nice and fresh, but ", "a bit bland.  ", "I'm not sure how to describe it, other than the fact that it wasn't the best sashimi I've ever had.  ", "The rolls were good but not spectacular.  ", "Lastly, the hamachi collar was tasty and juicy", ", definitely my favorite item of the night."], "author": "Le T.", "review": "This place is affordable by San Francisco standards, but still a bit pricey for me.  I had the salmon sashimi which was nice and fresh, but a bit bland.  I'm not sure how to describe it, other than the fact that it wasn't the best sashimi I've ever had.  The rolls were good but not spectacular.  Lastly, the hamachi collar was tasty and juicy, definitely my favorite item of the night.", "rating": 3, "date": "2012-10-02"}, {"excerpts": ["but it lacked the fresh sashimi.  \n\n"], "author": "Mellie D.", "review": "Just ate here for dinner and enjoyed their rolls which are well priced.  The two special rolls that stood out for my taste buds were the Godzilla and Tinki Winki (or something something) rolls.  Both were quite delicious and I think each had 3 different kinds of fish in it. Traditional rolls are cheap but also a bit on the smaller side. If you like Saba, try the Gari Saba roll, it's good. \n\nThe nigiri specials they had were pretty tasty, but the fish could be just a tad more fresh or maybe with a little less wasabi/ginger. Just seemed like there were too many flavors on top and under the fish that I couldn't really taste the fish itself. Nigiri prices weren't bad though, about $3.75 for 2 pieces of Aji or Bonito. \n\nTheir salads were cheap, simple, and very good. \n\nWe came exactly at 7pm (Wed.) and got seated right away as there were 3 empty tables and lots of room at the sushi bar. Right after we got seated, the place filled up. \n\nStaff was friendly...though they forgot to bring me the green tea I asked for and water glass was empty for awhile.  I didn't really notice the music at all.\n\nI was hoping this could be a closer alternative to Nippon but it lacked the fresh sashimi.  \n\n(Pictures to be posted later)", "rating": 3, "date": "2007-07-11"}, {"excerpts": ["We ordered a bunch of nigiri and also a sashimi platter.  \n\n"], "author": "Evan T.", "review": "Godzilla sushi is what it sounds like, a Godzilla themed restaurant.  I've been making my round around many good sushi joints in SF and Godzilla was one that my friend nozomi and i went on a whim.  She had a friend that worked there, so we figured we'd try it since we were in the area. \n\nIt's a pretty small restaurant, with simple tables and a giant mural of godzilla and many movie posters, as well as customer drawn napkins on the walls.  This place definitely had personality, which is a big plus for me.\n\nI could tell just by looking most people in there were regulars, and knew what they wanted.  We sat at a table and looked at the small menu of what to eat.  I wasn't very impressed at the menu's variety, but it had some good choices for what seemed like reasonable prices.  \n\nWe were served by very nice waitresses, so i felt the service was decent.  however the main attraction was food, and of course, i had to try the godzilla roll, since that was the namesake.  Can't screw that up right?  We ordered a bunch of nigiri and also a sashimi platter.  \n\nWhen the food came, it looked decent.  Nicely arranged, looked fresh... but kind of small.  The salmon sashim was 7 pieces, but looked more like 5 pieces sliced into 7.  It looked more like an appetizer than a meal.  The godzilla roll was only 4 pieces unfortunately, so i wasn't happy with that.  I don't have complaints about the taste, cuz it DID taste good but it didn't jump out at you.  \n\nSo in closing, it passed my test, but, its not a place i'd go back over and over.  Although the prices seem low, the quantity is low too, so i wasn't that impressed, nor was i full at the end after already spending 50 bones.\n\nI like this place for its personality, and the people are nice, but the place is a little bit stingy, in my opinion.  \n\nStrangely enough, nozomi and i were the only asians that night.  We just found it a little funny that every single person waiting to eat and that was here before us, was white.  Nothing wrong with that, but we just felt we stood out.  ha ha", "rating": 3, "date": "2009-03-08"}, {"excerpts": ["The sashimi is not fresh, average good, and very bad service!  ", "I don't recommend this restaurant!"], "author": "Helen H.", "review": "We waited for a long time for our order, very long time!  The sashimi is not fresh, average good, and very bad service!  I don't recommend this restaurant!", "rating": 2, "date": "2011-10-31"}, {"excerpts": ["The menu is pretty basic...mostly sushi, sashimi and nigiri with your typical sides of edamame, miso, seaweed salad, etc.  ", "They have chirashi, tekka don, but no teryaki or tempura "], "author": "Melanie N.", "review": "I've been driving past this place for years and tonight was the first night I've actually eaten here!\n\nWe arrived shortly after they opened and so were able to score a table.  This place is very small, so I imagine it could be difficult to get seating on a busier night.  There are only 5 tables and a small bar.  \n\nThe menu is pretty basic...mostly sushi, sashimi and nigiri with your typical sides of edamame, miso, seaweed salad, etc.  They have chirashi, tekka don, but no teryaki or tempura so you really have to be a lover of sushi to go to this place.\n\nI was really surprised at the prices.  For the area I would expect it to be a bit more expensive.  Most places I go to the seaweed salad is around  $5.00 but it was $3.50 for a very hearty serving!  I ordered the spicy tuna roll and it was very good although served a bit different than what I'm accustomed to....they put avocado in it and the spicy mixture seemed more creamy based.  I was a little disappointed in the edamame because I prefer it to be served hot and it was served cold here.  Not a major deal breaker, though.\n\nService was efficient and no frills.  It's a very casual atmosphere there...a mixture of college crowd to young locals.  The most exciting thing that happened was when I have a Pretty Woman experience (no, no hookers) and was biting into the edamame and a bean flew out of the pod and hit the guy at the next table....slippery little suckers! ;-)\n\nDefinitely will be stopping by Godzilla on a regular basis....I'm hoping they do take out since it's such a small place and would be good to pick something up and take home!", "rating": 4, "date": "2008-01-27"}, {"excerpts": ["they straight up give you sushi, sashimi, and appetizers... that is it!  ", "oh yeah, they serve sake too.\r\n", "The sashimi are so fresh.... ", "they're like BUTTAH!  ", "Whenever I put one in my mouth.. ", ".it's as if my tongue is making love to it...\r\n\r\n", "Appetizers to get:\r\nHamachi Kama (grilled yellowfish cheek)---soooooo good!  ", "Get this with a side of rice if you want to be on a budget.  ", "They raised the price from $7.50 to $8 something I believe.\r\n\r\n", "Spicy Mayo Mussels--SO FREAKIN ADDICTING and very savory!  ", "Get a side of rice too if this is all you're planning to eat.  ", "A bit on the expensive side, because you'll get only 2 or 3 pieces per order (i forget exactly how many), and they don't come cheap when they're so addicting!\r\n\r\n"], "author": "Grace M.", "review": "Despite the bad service my family and I got last time we were there (there were just too many people, and part of the fault was ours because we were just not happy with the amount of time we were waiting for our food), I still give Godzila Sushi 5 stars solely on the quality of their food.  They don't have bento boxes and all that nonsense... they straight up give you sushi, sashimi, and appetizers... that is it!  oh yeah, they serve sake too.\r\nThe sashimi are so fresh.... they're like BUTTAH!  Whenever I put one in my mouth.. .it's as if my tongue is making love to it...\r\n\r\nAppetizers to get:\r\nHamachi Kama (grilled yellowfish cheek)---soooooo good!  Get this with a side of rice if you want to be on a budget.  They raised the price from $7.50 to $8 something I believe.\r\n\r\nSpicy Mayo Mussels--SO FREAKIN ADDICTING and very savory!  Get a side of rice too if this is all you're planning to eat.  A bit on the expensive side, because you'll get only 2 or 3 pieces per order (i forget exactly how many), and they don't come cheap when they're so addicting!\r\n\r\nRolls to get\r\nGodzila roll--very tasty and very reasonably priced ($8.50 i believe) because it has 4 different fish inside! luxurious\r\n\r\nSpicy Tuna roll--one of their top sellers ($7.50 I think)\r\n\r\nSpider Roll\r\n\r\nTinky Winky--I forget what fish is in this one, but I like it because they use shiso leaf.\r\n\r\nI've always been happy with the food at this place.  I used to go here after my volunteer shift is over at UCSF Mt. Zion.  \r\n\r\nI only suggest to go somewhere else if you see a huge line waiting to be seated.  You'll be frustrated more about the service and it will compromise your overall first impression about their food if this is the case.", "rating": 5, "date": "2006-02-12"}, {"excerpts": ["I asked for the chef's recommendation for a fresh fish and I got the Spanish Mackerel sashimi which was chewy.  ", "There is nothing more disgusting than chewy fish that stays in your mouth longer than it has to.  ", "They can't even drown out their un-fresh fish with decent flavorings.  ", "I will never go back to this place."], "author": "Stacy S.", "review": "This was easily the worst sushi I've had in San Francisco.  I asked for the chef's recommendation for a fresh fish and I got the Spanish Mackerel sashimi which was chewy.  There is nothing more disgusting than chewy fish that stays in your mouth longer than it has to.  They can't even drown out their un-fresh fish with decent flavorings.  I will never go back to this place.", "rating": 1, "date": "2010-10-21"}, {"excerpts": ["Husbandido likes the chirashi and sashimi. ", "You'll appreciate the fresh fish and efficient service. ", "Now keep in mind again that I only go right after work, and your experience might be totally different later in the evening, but you can't go wrong if you're here. ", "Expect a waiting list if you come later in the evening. ", "there are maybe only 12 seats at the bar (if that) and 5 tables. ", "Damn, I forgot how many. ", "Guess I'm going to have to go back soon!"], "author": "Charlene L.", "review": "This is my preferred sushi spot. I have other 5-stars but allow me to go on record and say this is the spot. I always get there right when it opens: 5:30 and rarely go after 7PM if at all. Parking at that time is never an issue, and most of the parking (I'm confident is taken mostly by UCSF visitors) is pretty open and easy to get. There are always seats at the bar and the chefs are pretty nice guys. \n\nSushi is cheap. And good. Did you read that? In the same breath, children. Cheap and good. I always get ginger tuna, negi toro, albacore tataki and I'm a happy kitten. Husbandido likes the chirashi and sashimi. You'll appreciate the fresh fish and efficient service. Now keep in mind again that I only go right after work, and your experience might be totally different later in the evening, but you can't go wrong if you're here. Expect a waiting list if you come later in the evening. there are maybe only 12 seats at the bar (if that) and 5 tables. Damn, I forgot how many. Guess I'm going to have to go back soon!", "rating": 5, "date": "2006-07-23"}, {"excerpts": ["They're a little rice-heavy on the rolls, but the sashimi is fresh and good.  \n\n"], "author": "Holly M.", "review": "It's not clean, it's nothing fancy and it's really small, but the fish is pretty good.  And when you're talking about a sushi joint that's really 98% of the battle.\n\nBesides the fish, the #1 thing that stands out is the value you get for your money.  For what you're served it's down right cheap.  They're a little rice-heavy on the rolls, but the sashimi is fresh and good.  \n\nIf you go during prime dinner hours expect to chalk your name up on a hanging yellow notepad on the wall and then stand outside waiting for an hour.  However, if you get there early or you're willing to sit at the sushi bar, you've got a better chance.  Either way, a packed sushi place means high turnover, more eaters, fresher sushi!\n\nAnd don't order any type of regular wine (stick to sake). When I walked to the bathroom in the back (which was also a questionable decision), I noticed Franzia boxed chardonnay in the fridge (college tailgating flashback).", "rating": 3, "date": "2007-02-14"}, {"excerpts": ["I got the sashimi half-and-half... ", "Half salmon, half yellowtail. ", "As a BIG fan of salmon (like the rest of the world), I was generally satisfied. ", "We had four slices (not too thick or thin) of each fish. ", "The spicy tuna roll was good- ", "I liked that it had a lot of flavor in it. ", "There are only four pieces in the roll, but each piece is cut really thick. ", "I would recommend that you ask for lemon wedges with your sashimi. ", "My friend and I tried that, and it was really good. ", "Overall, great price and good food!"], "author": "Catherine C.", "review": "The service here was surprisingly very good! There is a chef that is really friendly and smiles a lot. He's very interactive, which is kind of nice. The waitresses and chefs all seem to be very close with each other as well, which made for a very comfortable atmosphere.\n\nIn terms of the sushi, it was very good! The fish was fresh; not the best I've had, but definitely up there. I got the sashimi half-and-half... Half salmon, half yellowtail. As a BIG fan of salmon (like the rest of the world), I was generally satisfied. We had four slices (not too thick or thin) of each fish. The spicy tuna roll was good- I liked that it had a lot of flavor in it. There are only four pieces in the roll, but each piece is cut really thick. And last, I also the salmon nigiri. \n\nJust minus one star for the rice, because it wasn't soft and fluffy! It was kind of stale. I would recommend that you ask for lemon wedges with your sashimi. My friend and I tried that, and it was really good. Overall, great price and good food!", "rating": 4, "date": "2009-07-14"}, {"excerpts": ["Menu is extremely limited and only sushi/sashimi.\n", "2) 8ish dollars for 4 piece rolls.\n", "3) ", "Rolls are smothered in some kind of sauce that makes all the rolls taste the same.\n", "4) "], "author": "Stephanie W.", "review": "Let me tell you why I would not go back even though they are the only sushi in our hood.\n\nFOOD:\n1) Menu is extremely limited and only sushi/sashimi.\n2) 8ish dollars for 4 piece rolls.\n3) Rolls are smothered in some kind of sauce that makes all the rolls taste the same.\n4) The rolls were overstuffed, hard to eat, and just not that good or fresh.\n\nSERVICE:  Pretty good, efficient, attentive.\n\nAMBIANCE:  Bare-bones, no frills type of place.\n\nOVERALL:  Not feelin it.", "rating": 2, "date": "2008-06-30"}, {"excerpts": ["The fish is fresh and delicious - we had sashimi and nigiri til we couldn't eat anymore.  ", "The price is great - we ate a ton and didn't leave with empty wallets.  ", "The other disappoint is that I love speciality rolls and they don't have a big selection.  ", "I will be back for all the nigiri and sashimi my heart desires!!"], "author": "Arica V.", "review": "My sister and I hit up Godzilla since we haven't been there in a long time - shame on us for not going sooner!!  The fish is fresh and delicious - we had sashimi and nigiri til we couldn't eat anymore.  The price is great - we ate a ton and didn't leave with empty wallets.  The other disappoint is that I love speciality rolls and they don't have a big selection.  I will be back for all the nigiri and sashimi my heart desires!!", "rating": 4, "date": "2010-10-06"}, {"excerpts": ["So many other places in the city with better more creative rolls, fresh hamachi/sashimi, and way better atmospheres."], "author": "casey p.", "review": "Worst sushi place I've been to in the city. Rolls are, at best, sub-par. The Hamachi yellowtail, hard to mess that up as long as its fresh and you could tell it wasnt the freshest. \n\nAfter being told to go to Godzilla by a few friends, finally tried it and it was definitely not worth the hype. So many other places in the city with better more creative rolls, fresh hamachi/sashimi, and way better atmospheres.", "rating": 2, "date": "2009-11-16"}, {"excerpts": ["My food was well made, my husband's not so much (and his sashimi was dry). ", "In the end, for the price, I can go to another sushi place with the same food quality but get more food."], "author": "Katia T.", "review": "It was okay. Not too great, not bad either. My food was well made, my husband's not so much (and his sashimi was dry). In the end, for the price, I can go to another sushi place with the same food quality but get more food.", "rating": 3, "date": "2011-01-01"}, {"excerpts": ["Oh, and I mainly order rolls here and maybe some nigeri, but I leave the sashimi for, well... elsewhere;-)"], "author": "Kim D.", "review": "I can't even begin to tell you how many people I have turned on to this place.  Rather than bore you with all those details, I'll sit here and try to remember my very first visit way over a year ago...  \n\nA few of my skydiving buddies were in town after a long weekend of jumping out of perfectly good airplanes and decided sushi is the cuisine of choice.  Being that us skydivers are on a budget, I knew I couldn't go too far over the $$ on, ehem, City-Search... so that's how I found Godzila.  \n\nWe've all had good sushi, bad sushi and just OK sushi, but in no way shape or form expected to uncover our favorite spicy tuna EVER in what seems like a hole in the wall sushi joint!  The service is always better than average.  The sake is good and cheap.  Their Godzila roll is to die for and they always have this very special walu on the menu that will literally melt in your mouth.  The chefs?  Always smiling, love to toast with you and will hand you paper towels when you accidentally spill a glass or two.  \n\nMy only complaint?  I moved out of Hayes and now have to travel all the way from the Mission to get there.  Oh, and I mainly order rolls here and maybe some nigeri, but I leave the sashimi for, well... elsewhere;-)", "rating": 4, "date": "2007-11-24"}, {"excerpts": ["So try it out if you like sushi and sashimi. ", "If you don't eat fish don't bother, if you want teriyaki chicken, don't bother. ", "The place is great and cheap to boot."], "author": "Jaron W.", "review": "I would like to say one thing before I continue this review because as obvious as it seems, in reading some of the other reviews it must not be that obvious. This is a sushi place. If you want something other than raw fish, do not come here. \n\nI love sushi, and at these types of prices this is the place to go. The fish is always really fresh, especially compared to other sushi places that have the same price range. The Godzila roll is probably one of the best rolls I have had. The menu doesn't have a ton of variety, but it relies on the fact that the fish itself is very tasty. \n\nI take my girlfriend to Godzila almost once a week. Every week we order our favorites and order a new sake. It's a great way to start a Friday night. They are always playing classic rock, which is my kind of music, and the decorations of drawings and posters of Godzilla make the place a unique, fun place. The chefs are really nice, and know me now.\n\nSo try it out if you like sushi and sashimi. If you don't eat fish don't bother, if you want teriyaki chicken, don't bother. The place is great and cheap to boot.", "rating": 5, "date": "2008-07-10"}, {"excerpts": ["One Godzila roll (I'm American, yo!) and one 7 piece Hamachi Sashimi plate (I think I'm turning Japanese).  ", "White blushing with pink hues....", "cold...fresh", "....jesus h. ", "fucking christ ", "it was the best god damned hamachi I've ever had.  ", "The Godzila roll went perfectly with the Quiet Riot music in the background that should have been turned up a bit higher.  ", "If you haven't noticed yet, the Godzila font is, I believe, Fender!  "], "author": "Nobody M.", "review": "I popped my sushi cherry at Godzila, so I've factored some nostalgia into my rating.  And that's not a bad thing.  In fact, if you go way back it might help others appreciate Godzila now.  Basically it hasn't changed.  15 years ago or so the place was the same as it was....the only thing different is that back then there were 1/2 as many (ok, 33% fewer) sushi restaurants around.  The ones that were were either stodgy traditional Japanese places run by commies who wanted to return to pre-Hiroshima days (they opened restaurants as a way of getting back at Americans) or they were tourist/American-jin traps with lots of fake crab rolls, with teriyaki everything and coke on tap.  Godzila was and is still? run but a bunch of crazy Japanese sushi rock star chefs.  \n\nFast forward to tonight, 2 hrs. ago....I laid my helmet down at the sushi bar and promptly had miso soup, hot tea and an order taken down....5 min later I was in an epicurean heaven....One Godzila roll (I'm American, yo!) and one 7 piece Hamachi Sashimi plate (I think I'm turning Japanese).  White blushing with pink hues....cold...fresh....jesus h. fucking christ it was the best god damned hamachi I've ever had.  The Godzila roll went perfectly with the Quiet Riot music in the background that should have been turned up a bit higher.  If you haven't noticed yet, the Godzila font is, I believe, Fender!  This place just rocks.  \n\nAfterwards I rode my Triumph up twin peaks and contemplated both the joy and misery of being single.  (Had there been two of us it would have been much more difficult to get a seat and chicks don't dig on 40mph 10 degree wind--even if the view is awesome ;))", "rating": 5, "date": "2007-08-18"}, {"excerpts": ["Won't switch rice with salad on menu, won't swap octopus for some other fish from sashimi combo, won't do spicy tuna roll without the rice. ", "Also, won't get more than 15% tip, and won't see very much of us either for a while, till we forget how unfriendly they are. ", "Did I mention I have been going there for years? ", "Oh yes I did. ", "Did I mention that ", "I always (not tonight) leave at least 20% tip? ", "It makes us wonder why is it that some people are OK simply being rude to others? ", "What is there to gain? "], "author": "Elsa T.", "review": "Good sushi, bad karma\n\nThe food is good for the price point.\nBut the service is terrible. I could go on and on about all the miserable experiences I have had there over the years. But like an idiot I keep going back. It's because the place became special to me and later to my husband when they had a great chef who subsequently left.\n\nTonight we had dinner there again, and they didn't accommodate my little requests for my current new mommy diet. Won't switch rice with salad on menu, won't swap octopus for some other fish from sashimi combo, won't do spicy tuna roll without the rice. Also, won't get more than 15% tip, and won't see very much of us either for a while, till we forget how unfriendly they are. Did I mention I have been going there for years? Oh yes I did. Did I mention that I always (not tonight) leave at least 20% tip? It makes us wonder why is it that some people are OK simply being rude to others? What is there to gain? That's why I say bad karma.\n\nBut in the meantime, the sushi is good and it saves us a walk all the way to Japan town. Grrr! I need to find new place close-by.", "rating": 3, "date": "2007-06-26"}, {"excerpts": ["...the Sashimi has got me hooked and dayuuummm that Spicy Tuna handroll is perfect in every way.\n\n"], "author": "T H.", "review": "Ok so I ate here twice last week. My first experience was better than the second but that had nothing to do with the sushi it had to do with the clientele. Their service is quick and their Sushi...is tight!! The staff is attentive and nice. The ambiance is a bit lackluster but who cares when you get some awesome godzila art...an old school tv and some serious classic rock going...oh let's not forget about their quality ingredients...the Sashimi has got me hooked and dayuuummm that Spicy Tuna handroll is perfect in every way.\n\nOn the first night I went over there right after work abou 5:30ish and it was a different vibe than at 8pm the \"upper crust\" of lower pacific heights were in full effect....I hate being around snottie bitches with attitude and new money if you get my drift...My hubs ordered a few rolls the pink drangon roll...the tinky winky and some other manly type rolls and he was in heaven. I am doing the no carb thing and tried to eat around the rice but you know that is no fun at a Sushi restaurant!! \n\nAnyway I will be sure to order take out from here so that their grossness does not in anyway tarnish my sashmi experience....oh how I wished they were open for lunch...but on further thought that is a good thing because I would have to get another job to afford to eat there like all week!!", "rating": 4, "date": "2008-07-25"}, {"excerpts": ["I had a hankering for some sashimi (which is always risky ordering at a random Japanese restaurant) -- but it was solid.  ", "I particularly enjoyed the hamachi."], "author": "Ralph N.", "review": "There are the Koos and the Tatakis of the world, but if you're just in the mood for an inexpensive and super casual sushi joint, I'd recommend Godzilla.  I'd definitely come here again if I was around Pac Heights.  \n\nFriend and I went here before a show.  Randomly stumbled in Godzilla as Tataki down the street had a long wait nd we had to get to the Fillmore eventually.  I had a hankering for some sashimi (which is always risky ordering at a random Japanese restaurant) -- but it was solid.  I particularly enjoyed the hamachi.", "rating": 4, "date": "2010-04-21"}, {"excerpts": ["Good value\" sushi/sashimi.  ", "Been over two years since I was here.  "], "author": "Barry A.", "review": "\"Good value\" sushi/sashimi.  Been over two years since I was here.  I kind of forgot about it.\n\nOne of my \"usual\" joints was closed, so we trekked a short hop over this way to check out Godzilla again.\n\nWe weren't disappointed.\n\nThe fish was fresh and the beer was cold.\n\nIf loud music turns you off, get take out.", "rating": 3, "date": "2007-07-09"}, {"excerpts": ["my favorite roll is the asparagus and salmon roll, that with 2 pieces of maguro sashimi is my craving regularly."], "author": "Barbara C.", "review": "I'm a huge sushi fan so I'm fine with having nothing but sushi on the menu, but be warned for bringing friends who want tempora, etc. i finally made it in and really became addicted, affordable for the most part depending on what you order and good selections. my favorite roll is the asparagus and salmon roll, that with 2 pieces of maguro sashimi is my craving regularly.", "rating": 4, "date": "2010-01-22"}, {"excerpts": ["The yellowtail cheek is their true specialty and well worth the 20 minutes it takes to cook (after all, you can eat your heart's content of delicious nigri or sashimi while you wait)."], "author": "Tal K.", "review": "Gojira! Listen all you complaining yelpers, the good service is at the bar. This is the best damn sushi you're going to get for your back in San Francisco, chums. If there's a wait at the door, get yourself a nice tall Asahi and chill. The yellowtail cheek is their true specialty and well worth the 20 minutes it takes to cook (after all, you can eat your heart's content of delicious nigri or sashimi while you wait).", "rating": 5, "date": "2006-04-04"}, {"excerpts": ["the sashimi is hit and miss - some slices of fish are rather good, while others just taste old. "], "author": "Darrell L.", "review": "nothing overly fantastic about this place.\n\nits tiny - and even with the small space they do have, they dont have very many tables on the floor; maybe it has to do with capacity space due to exits or something, but there is plenty of walking room.\n\ni went because i heard the prices were very good for what you get, but i find Kitaro to be a better bang for your buck. the sashimi is hit and miss - some slices of fish are rather good, while others just taste old. the special rolls are your usual fare, but their tea was quite nice.\n\ni figure this is a better local watering hole - so if you live a few blocks away, give it a shot, it wont hurt your wallet much.", "rating": 3, "date": "2006-07-12"}, {"excerpts": ["Their toro sashimi was quite chewy -- not really edible; although, the staff was very cool about the whole thing. ", "If you're looking for a great hole-in-the-wall, perhaps Sushi Zone will fill that need?"], "author": "Tim G.", "review": "Always crowded -- I've been to Godzila a few times, but I've never been blown away.  Their toro sashimi was quite chewy -- not really edible; although, the staff was very cool about the whole thing. If you're looking for a great hole-in-the-wall, perhaps Sushi Zone will fill that need?", "rating": 2, "date": "2009-01-18"}, {"excerpts": ["I just remember that they had some Squid Sashimi that made me nauseous for the rest of the night. ", "I kept burping and tasting it. "], "author": "Chris K.", "review": "I came here with a friend a while ago. I was pretty drunk so I don't remember how the food tasted. So I guess I really don't have an opinion for this review...\n\nI just remember that they had some Squid Sashimi that made me nauseous for the rest of the night. I kept burping and tasting it. After a while my stomach started to hurt and it ruined my evening.\n\nMoral of the Story: Don't eat squid. It's a game killer.", "rating": 2, "date": "2009-01-28"}, {"excerpts": ["I thought the selection was mediocre, the service bad, and the food overpriced for the tiny pieces of fish you get in the nigiri and sashimi orders."], "author": "Jenny K.", "review": "Not a fan of this place. At all. I thought the selection was mediocre, the service bad, and the food overpriced for the tiny pieces of fish you get in the nigiri and sashimi orders.", "rating": 2, "date": "2007-04-12"}, {"excerpts": ["its sushi, sashimi, and the occasional special. ", "the sashimi combo is a good deal and they are often kind enough to substitute things we dont like. "], "author": "shaine h.", "review": "godzila is what it is . . . cheap and good. they don't have a lot of fancy stuff, and what they do try can be hit or miss. they are up front about using crab stick, which i admire, and they don't have appetizers or bento boxes or anything like that. its sushi, sashimi, and the occasional special. no problem for me!\n\nwe like the pink dragon and the kamikaze rolls. the sashimi combo is a good deal and they are often kind enough to substitute things we dont like. i also love the decor and the friendly sushi chefs.\n\ngo early or wait for one of 5 tables.", "rating": 4, "date": "2006-12-03"}, {"excerpts": ["however, the sashimi was pretty subpar. ", "it wasn't godawful or not fresh, but the fish was just not high quality or cut that well. ", "i would probably come here again for their rolls, but not their sashimi, since i'm willing to pay more for good sashimi."], "author": "Jessica W.", "review": "it's actually 3.5 stars... i don't want to knock this place too badly, since it's not like they're aspiring to be the best quality sushi place in the world. it's great for creative rolls that managed to be packed with 10 different ingredients that taste delicious together. americanized rolls, basically, but regardless, still good. and so big, i could barely put the whole piece in my mouth in one go. however, the sashimi was pretty subpar. it wasn't godawful or not fresh, but the fish was just not high quality or cut that well. on the other hand, for the price, i wasn't expecting that much.\n\ni would probably come here again for their rolls, but not their sashimi, since i'm willing to pay more for good sashimi.", "rating": 3, "date": "2008-02-27"}, {"excerpts": ["The grade of sushi was definitely better some places I frequented as well as the sashimi, so I can't complain about that. ", "one thing is the price and portions. ", "One roll was about $6-$10 average and it only came with 4 at the most 6 pieces. ", "The portions were of decent size ", "so I guess that made up for it. ", "Sashimi was real good as well and I'd say it was priced fairly. ", "Overall, I had a nice experience, and enjoyed my food."], "author": "Rommel N.", "review": "I've passed this place for years and always wanted to come here. I finally had the opportunity and can honestly say I wasn't disappointed. The grade of sushi was definitely better some places I frequented as well as the sashimi, so I can't complain about that. one thing is the price and portions. One roll was about $6-$10 average and it only came with 4 at the most 6 pieces. The portions were of decent size so I guess that made up for it. Sashimi was real good as well and I'd say it was priced fairly. Overall, I had a nice experience, and enjoyed my food.", "rating": 3, "date": "2008-04-30"}, {"excerpts": ["It doesn't have entrees or bento boxes mostly sushi rolls, nigiri and sashimi. ", "Great place to start out a night on the town."], "author": "Olga P.", "review": "Great place, cheap and yummy sushi, they are a bit small so expect a bit of a wait. It's worth it though. Some of my favorites are the tinkie winkie roll and the godzila roll. It doesn't have entrees or bento boxes mostly sushi rolls, nigiri and sashimi. Great place to start out a night on the town.", "rating": 4, "date": "2008-11-17"}, {"excerpts": ["I had a spider roll and some sashimi. ", "Spider roll wasn't even crunchy and sashimi was just ok.  \n\n"], "author": "ant m.", "review": "I think people come here more to drink than eat. Their sushi isn't that good. I had a spider roll and some sashimi. Spider roll wasn't even crunchy and sashimi was just ok.  \n\nThe only think I like about this joint, they got the white man fooled thinking the miedicore stuff they serve is great. Hats off to you...Its always great when a fellow minority decieves the wide eye. BTW neone who says this joint is cheap has $ to waste. price/value sux.", "rating": 2, "date": "2007-04-05"}, {"excerpts": ["I tried to order a sashimi combo which is supposed to come with rice and miso soup, simply without the rice, substitute some iceberg lettuce.  ", "Absolutely would not just give me a side salad even if I paid extra for it.  "], "author": "Nicole H.", "review": "Terrible, infuriating service.  I tried to order a sashimi combo which is supposed to come with rice and miso soup, simply without the rice, substitute some iceberg lettuce.  Absolutely would not just give me a side salad even if I paid extra for it.  Does that make any sense to anyone?\n\nWe debated this point for about two minutes to which I finally conceeded and just said, okay, fine, give me the miso and the fish and no rice.  Charge me the same.\n\nJust got home and I've got a container of rice, no soup.  Seriously.  Give me a break.", "rating": 1, "date": "2008-05-13"}, {"excerpts": ["i also think their sashimi is among the freshest.  ", "most recently i had the dragon roll, the spicy tuna, and the mixed sashimi.  ", "they also have delicious mochi!!  ", "my sushi dinner is NOT complete without mochi!"], "author": "Carolyn B.", "review": "godzila is definitely among my favorite sushi places in SF.  i like the relaxed, casual atmosphere, although becuase they don't take reservations, be prepared to wait on a busy night.  i swear they could fit more tables in there!  sitting at the sushi bar is great too - i like to ask the sushi chefs about their favorites.  spicy tuna is a must - one of their best rolls.  they always have great special rolls too.  i also think their sashimi is among the freshest.  most recently i had the dragon roll, the spicy tuna, and the mixed sashimi.  they also have delicious mochi!!  my sushi dinner is NOT complete without mochi!", "rating": 4, "date": "2007-07-13"}, {"excerpts": ["They only serve Sushi/Sashimi/Rolls and have an even tinier selection for vegetarians. ", "I was disappointed at first, but we stuck around nonetheless. "], "author": "Tushar V.", "review": "Love the ambiance. Its uniquely tacky, yet super cool, with a huge Godzilla Motif on the wall, along with other forms of Godzilla art, that adorn the walls. I happened to stumble by Godzila on my way to Tortilla Heights. TH was about to close down, so my friends and i decided to go across to Godzilla. Getting down to the food, the menu is pretty limited. They only serve Sushi/Sashimi/Rolls and have an even tinier selection for vegetarians. I was disappointed at first, but we stuck around nonetheless. We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. I was pleasantly surprised by how good the food was. I usually hate Japanese food, but the sushi was flippin insane! The ingredients were fresh and the service was pretty quick. Maybe because it was a Monday night and we walked in around 9:30 pm. Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!...Oh, and their plum wine is decent as well, give it try will ya.", "rating": 4, "date": "2008-11-26"}, {"excerpts": ["Everything was very fresh as it should be, and the Sashimi was good.  ", "I forget what it was called, but we had a roll with banana in it that was surprisingly good.  ", "The atmosphere is about par for the course for sushi."], "author": "Luke P.", "review": "Pretty solid sushi place, but it didn't get me too excited.  Everything was very fresh as it should be, and the Sashimi was good.  I forget what it was called, but we had a roll with banana in it that was surprisingly good.  The atmosphere is about par for the course for sushi.", "rating": 3, "date": "2009-03-22"}], "sashimi half  half": [], "sashimi combination": [{"excerpts": ["Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. "], "author": "Will H.", "review": "Previously ate here and ordered a couple rolls for take-away. I didn't really enjoy it, but I'm also realizing that in general, I should never order sushi for take away. It just isn't as tasty without the gobs of ginger and dine-in experience that makes eating sushi so enjoyable. \n\nThis time around, ate inside the restaurant and had a much better experience. Their chicken karaage was one of the most tender kaarages I've had. Tender, juicy, yummy. Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. The Godzila roll was also nice, with a bit of spice and good flavor. Good neighborhood sushi in the Pacific Heights area.", "rating": 4, "date": "2016-11-02"}], "salmon donburi": [{"excerpts": ["I also get their Salmon Donburi. ", "The salmon is never overcooked and is served with perfectly steamed broccoli. ", "I ask for extra ginger on the side with everything. ", "Theirs seems to be sweeter than other places. ", "Overall, an inexpensive spot to satisfy my sushi and fish cravings! ", "Thank you Godzila!"], "author": "Rona V.", "review": "Another one of my go-to places for lunch. I love the sushi here. The proportion of rice to fish is perfect. They only use real crab and their sashimi is always fresh. I have never craved another sushi roll more than I have their Tinky Winky roll (scallop, salmon, crab, avocado and tobiko). It must be the shisho leaf that makes it extra fresh and delicious - just love it! You can't beat the price at $7.50 either. \n\nI also get their Salmon Donburi. The salmon is never overcooked and is served with perfectly steamed broccoli. I ask for extra ginger on the side with everything. Theirs seems to be sweeter than other places. Overall, an inexpensive spot to satisfy my sushi and fish cravings! Thank you Godzila!", "rating": 4, "date": "2016-01-09"}, {"excerpts": ["We got the salmon donburi (main reason why I came here) and Tinky Winky (?", ") roll and it did not disappoint! ", "Service was just average. ", "Better than other Japanese restaurants services."], "author": "Tee N.", "review": "Their interior is rather small so you'd have to wait a bit especially if it's dinner time. My bf and I came around 8:30 pm and we waited for around 15 mins which isn't bad. The prices were great! We got the salmon donburi (main reason why I came here) and Tinky Winky (?) roll and it did not disappoint! Service was just average. Better than other Japanese restaurants services.", "rating": 4, "date": "2016-04-29"}, {"excerpts": ["It's not top-quality sashimi or anything, but my salmon donburi tasted fresh and delicious!  ", "It even came with seaweed salad, a nice surprise! ", "My coworkers orders some sushi rolls, tempura, udon, etc. ", "and all seemed to really like their food. ", "The ambience was nice- low key and decorated with cute Godzilla-themed paraphernalia. ", "It was the perfect place to grab some sushi and/or other Japanese food for lunch. ", "We showed up just before noon, and it did get crowded as we were finishing our meals, so it's helpful to show up early in order to avoid having to wait for a table. ", "I'm looking forward to coming back for more delicious food in the near future!"], "author": "Sarah W.", "review": "Came here with my coworkers for lunch on a weekday and really enjoyed our meals here. Fast and friendly service, meal prices are relatively cheap, and the quality of food is great for the prices.  It's not top-quality sashimi or anything, but my salmon donburi tasted fresh and delicious!  It even came with seaweed salad, a nice surprise! My coworkers orders some sushi rolls, tempura, udon, etc. and all seemed to really like their food. The ambience was nice- low key and decorated with cute Godzilla-themed paraphernalia. It was the perfect place to grab some sushi and/or other Japanese food for lunch. We showed up just before noon, and it did get crowded as we were finishing our meals, so it's helpful to show up early in order to avoid having to wait for a table. I'm looking forward to coming back for more delicious food in the near future!", "rating": 4, "date": "2016-05-16"}, {"excerpts": ["I always order the salmon donburi, which comes with miso soup and a house salad.  ", "$11.50.  ", "Such a bargain.  "], "author": "Jeanne L.", "review": "This is my favorite go-to place for sushi. I kinda don't want to tell other people about it.\n\nI always order the salmon donburi, which comes with miso soup and a house salad.  $11.50.  Such a bargain.  I know it's not a good thing to use \"bargain\" when describing sushi, but in this case, it's really not a bad thing.  \n\nThe quality of the fish varies from visit to visit.  It's always pretty decently good (especially for the price), and on some visits, it's phenomenal.  My last visit included some of the freshest fish (salmon, tuna, white tuna) that I've ever had in SF, so I really needed to update my review. Maybe it was just the fact that they just had a new shipment of fish, or the fact that I sat at the bar.  Either way, it was amazing.\n\nThe service has always been fast.  There's never been a line or wait here.  (One of my few favorite places in SF where I can get a quick meal!)\nI much prefer this place to the other nearby sushi places (Tataki and Tsunami).", "rating": 5, "date": "2013-10-27"}], "tekka donburi": [], "hamachi donburi": [], "house wine": [], "plum wine": [{"excerpts": ["Attentive sushi manufacturers, AMAZING (and cheap) plum wine, lots of ginger and wasabi. ", "BF got the Rock and roll & Nigiri and loved it. "], "author": "Shaymaa M.", "review": "Reasonably priced, great quality sushi with plentiful flavors and combos. Attentive sushi manufacturers, AMAZING (and cheap) plum wine, lots of ginger and wasabi. BF got the Rock and roll & Nigiri and loved it. I got the King Ghidor and the Destroyah. Solid, solid choices.", "rating": 4, "date": "2016-03-15"}, {"excerpts": ["Oh, and their plum wine is decent as well, give it try will ya."], "author": "Tushar V.", "review": "Love the ambiance. Its uniquely tacky, yet super cool, with a huge Godzilla Motif on the wall, along with other forms of Godzilla art, that adorn the walls. I happened to stumble by Godzila on my way to Tortilla Heights. TH was about to close down, so my friends and i decided to go across to Godzilla. Getting down to the food, the menu is pretty limited. They only serve Sushi/Sashimi/Rolls and have an even tinier selection for vegetarians. I was disappointed at first, but we stuck around nonetheless. We ordered the Dragon roll, Garden roll, Philly Roll, Cucumber and Pickled Radish roll. I was pleasantly surprised by how good the food was. I usually hate Japanese food, but the sushi was flippin insane! The ingredients were fresh and the service was pretty quick. Maybe because it was a Monday night and we walked in around 9:30 pm. Anyhoo, i know there are better sushi places out there, but for the price, the food is really good and you get to hear some awesome Classic Rock!...Oh, and their plum wine is decent as well, give it try will ya.", "rating": 4, "date": "2008-11-26"}], "sapporo beer": [{"excerpts": ["(And some more Sapporo beer, of course...) \n\n"], "author": "donal c.", "review": "Hadnt been here for quite a few years, so I was concerned that things may have changed for the worse. I neednt have worried. Godzila is still an excellent choice for reasonably-priced sushi in a casual & fun environment.\n\nWe arrived at around 8:45 on a Friday evening, so there was a bit of a wait -- not to worry, we added our name to the list and hung out with a beer at the doorway to the little restaurant. The place is small, with just a few tables and about 8 or 10 spots at the bar. Finally, we got svery tasttyeated in a prime spot (under the TV adorned with the little Godzila figurines...!) We ordered some miso soup and Gom Ae salad (a bit heavy on the sesame, but very tasty. We followed with an assortment of sushi -- unagi hand-rolls, spicy tuna, tempura rolls, spider rolls. Fairly conventional selection, but all VERY good. (And some more Sapporo beer, of course...) \n\nI was so impressed that I actually bought a beer for the sushi chef (an unusually generous gesture for me!) All-in-all, a fun place, reasonably priced and very tasty sushi & friendly staff.", "rating": 4, "date": "2009-08-15"}], "asahi beer": [], "nigori sake": [{"excerpts": ["A little nigori sake and a lot of mochi for dessert made it one of the best sushi experiences I have had in SF.\n\n"], "author": "Jessica P.", "review": "I had heard tales of Godzila sushi- of the innovative roll combos, the excellent mochi, and the awesome mural on the back wall, but nothing prepared me for the onslaught of delicious roll after roll that I got here.\n\nWe got there relatively early, only waited 5 minutes for a table and had a really hard time narrowing our choices down from their great menu of specialty rolls.\n\nI ended up with the Spider Roll, the U-nasu Roll, and the Philly Roll. All of which were amazing.\nA little nigori sake and a lot of mochi for dessert made it one of the best sushi experiences I have had in SF.\n\nThe peanut butter-chocolate mochi was sinful. Yum.", "rating": 5, "date": "2007-11-14"}], "black sesame ice cream": [{"excerpts": ["and i'm a sucker for black sesame ice cream!"], "author": "Shirley L.", "review": "i wouldn't go here on a night that i had a lot of time and money. but if you are with friends and one of you doesn't want pizza, and the other wants to start eating better, and well it's late and you're hungry...  the rolls are ok if you aren't a sushi snob. and i'm a sucker for black sesame ice cream!", "rating": 3, "date": "2007-04-10"}, {"excerpts": ["Also, please try the black sesame ice cream, it's to die for :)"], "author": "Ronnie B.", "review": "One of my favorite sushi places in the city. There is a limited selection of sushi choices, but the sushi is always really delicious and never off-kilter. \n\nThey play rock music and have lots of posters of the Godzilla movies up. my kind of place! Try the lazy monkey roll! It may sound weird, but it is frickin' delicious: cream cheese, banana, cucumber, and avocado. Thinking about it just makes me happy.\n\nAnd it's not too expensive in comparison to other sushi restaurants I like. Also, please try the black sesame ice cream, it's to die for :)", "rating": 4, "date": "2008-05-16"}], "green tea cheese cake": [{"excerpts": ["If you still have room for dessert, try the green tea ice cream or green tea cheese cake."], "author": "Mei L.", "review": "My favorites are the Godzilla green roll and the sashimi combo. I always have fun at this restaurant. I go here mostly on Friday evenings with friends or coworkers. Everyone is always able to find something they like on the menu. Reasonably priced. If you still have room for dessert, try the green tea ice cream or green tea cheese cake.", "rating": 5, "date": "2018-09-30"}], "new york cheese cake": [], "godzila roll": [{"excerpts": ["The Godzila roll was also nice, with a bit of spice and good flavor. ", "Good neighborhood sushi in the Pacific Heights area."], "author": "Will H.", "review": "Previously ate here and ordered a couple rolls for take-away. I didn't really enjoy it, but I'm also realizing that in general, I should never order sushi for take away. It just isn't as tasty without the gobs of ginger and dine-in experience that makes eating sushi so enjoyable. \n\nThis time around, ate inside the restaurant and had a much better experience. Their chicken karaage was one of the most tender kaarages I've had. Tender, juicy, yummy. Also had the sashimi combination that came with an assortment of tuna, salmon, octupus, mackerel, yellowtail, and white tuna for a reasonable price of $21.95. The Godzila roll was also nice, with a bit of spice and good flavor. Good neighborhood sushi in the Pacific Heights area.", "rating": 4, "date": "2016-11-02"}, {"excerpts": ["Lorna went for their signature dish - the Godzila Roll ($8.25).  ", "This roll had about four different kinds of fish wrapped inside the roll.  ", "I forgot what kind of fish it was, but Lorna D. loved it!  ", "\"", "It's hella good!\"  "], "author": "Teri C.", "review": "With a name like Godzila, you would expect extraordinary!\n\nLocated on the corner of Divisadero and Bush, Lorna D. was lured by its promising name and her love of all things raw, especially sushi.  We found ourselves here on a Tuesday night and wandered in.  \n\nAs we walked through the door, I asked her if she wanted to sit at the sushi bar or table.  This was quickly answered for us as the handful of tables were already occupied, so we climbed up onto the bar stools.  (You'll find nifty hooks to hang your purse underneath!)\n\nI went for the Chirashi Don ($9.25), which came with miso soup and a side salad.  The salad was basic with iceberg lettuce, cucumbers, and sprouts.  The dressing was a miso based type.  The soup was standard with tofu and seaweed.  At such a cheap price for a chirashi, I wasn't expecting too much fish.  It came in an average size bowl with two pieces of imitation crab meat, maguro, sake, hamachi, saba, some white fish, and I think something else.  Overall, it was okay.  Some of the fish was fresher than others, but not bad for a chirashi don.\n\nLorna went for their signature dish - the Godzila Roll ($8.25).  This roll had about four different kinds of fish wrapped inside the roll.  I forgot what kind of fish it was, but Lorna D. loved it!  \"It's hella good!\"  She also had the Tinky Winky Roll ($5.75).  She wasn't as impressed since it came with a mixture of crab and mayo.  It was okay for her.  She also added a Spider Roll ($6.50), which was soft shell crab to her dinner.  On their special menu, they also served Walu nigiri ($3.50).  Walu, also known as escolar, or butterfish, is a snake mackerel.  (It's actually known to cause gastrointestinal symptoms upon eating it, I have yet to check with Lorna D. to see if she experienced any of these side effects yet.)  The fish tasted more watery than anything, not a whole lot of flavor behind it.  Rather disappointing.\n\nI decided to add a Spicy Tuna Roll ($4.75) to my dinner and the ends were exploding with spicy tuna.  I did appreciate all the excess of tuna, but I had to request some mayo to 'creamy' it down a bit and take off some of the heat.\n\nThe big winner of the night was the Mochi ice cream!  At $3.25 for two pieces, you can choose among the different varieties they offer.  Last night they had Azuki, Blueberry Cheesecake, Raspberry White Chocolate, Pumpkin, and Chocolate Peanut Butter.  Lorna D. went for the Raspberry White Chocolate and Blueberry Cheesecake.  When I saw her face after she bit into the Blueberry Cheesecake, I knew I had to get an order for myself.  I had the Pumpkin as well.  But that Blueberry Cheesecake Mochi is FABU-LO-SO!  Yum yum!  It tasted so good!  The first bite being gentle and plain because of the mochi outside, and then you get the gentle sweetness of the blueberry, and then a wow factor hits when you taste a chunk of cheesecake.  Oh. My. Gawd.  So good!  We inquired about these yummy mochis since the flavors were so unique and discovered they were from Bubbies Homemade Ice Cream & Desserts in Hawai'i!  http://www.yelp.com/biz/regFkesM5XQLLYgs2qe7lA  I would go back to Godzila just for this mochi...actually, screw that!  I'm going to order some myself and have them ship it to me!\n\nService was okay.  We had to ask for our tea to be refilled.  They also served a brown tea that reminded me of eating at a Chinese restaurant.  The waitress also gave us our bill before we were done, which wasn't entirely her fault since it may have appeared that we were done already.  \n\nAmbiance...for such a small restaurant, it can get really loud in there!  I was rather surprised.  They have a TV on, which can contribute to the noise pollution.  \n\nGodzila Sushi - an average place to go to.  Some good rolls and some okay ones to boot.  But save room for their mochi!  Yum yum!\n\nSidenote: $10 minimum for credit card use; 10% gratuity will be added on to go orders of $50.00 or more.", "rating": 3, "date": "2007-01-17"}, {"excerpts": ["Dragon roll and Godzila roll at the top of my list. ", "The restaurant underwent a recent renovation, which I am not a fan of due to the new lighting. ", "Good for small group outings."], "author": "Renard I.", "review": "Great bang for the buck neighborhood sushi joint. Ambiance is not why you come to eat at this local spot. Dragon roll and Godzila roll at the top of my list. The restaurant underwent a recent renovation, which I am not a fan of due to the new lighting. Good for small group outings.", "rating": 4, "date": "2012-05-02"}, {"excerpts": ["Rolls to get\r\nGodzila roll--very tasty and very reasonably priced ($8.50 i believe) because it has 4 different fish inside! ", "luxurious\r\n\r\nSpicy Tuna roll--one of their top sellers ($7.50 I think)\r\n\r\n", "Spider Roll\r\n\r\n", "Tinky Winky--", "I forget what fish is in this one, but I like it because they use shiso leaf.\r\n\r\n", "I've always been happy with the food at this place.  ", "I used to go here after my volunteer shift is over at UCSF Mt. Zion.  \r\n\r\n", "I only suggest to go somewhere else if you see a huge line waiting to be seated.  ", "You'll be frustrated more about the service and it will compromise your overall first impression about their food if this is the case."], "author": "Grace M.", "review": "Despite the bad service my family and I got last time we were there (there were just too many people, and part of the fault was ours because we were just not happy with the amount of time we were waiting for our food), I still give Godzila Sushi 5 stars solely on the quality of their food.  They don't have bento boxes and all that nonsense... they straight up give you sushi, sashimi, and appetizers... that is it!  oh yeah, they serve sake too.\r\nThe sashimi are so fresh.... they're like BUTTAH!  Whenever I put one in my mouth.. .it's as if my tongue is making love to it...\r\n\r\nAppetizers to get:\r\nHamachi Kama (grilled yellowfish cheek)---soooooo good!  Get this with a side of rice if you want to be on a budget.  They raised the price from $7.50 to $8 something I believe.\r\n\r\nSpicy Mayo Mussels--SO FREAKIN ADDICTING and very savory!  Get a side of rice too if this is all you're planning to eat.  A bit on the expensive side, because you'll get only 2 or 3 pieces per order (i forget exactly how many), and they don't come cheap when they're so addicting!\r\n\r\nRolls to get\r\nGodzila roll--very tasty and very reasonably priced ($8.50 i believe) because it has 4 different fish inside! luxurious\r\n\r\nSpicy Tuna roll--one of their top sellers ($7.50 I think)\r\n\r\nSpider Roll\r\n\r\nTinky Winky--I forget what fish is in this one, but I like it because they use shiso leaf.\r\n\r\nI've always been happy with the food at this place.  I used to go here after my volunteer shift is over at UCSF Mt. Zion.  \r\n\r\nI only suggest to go somewhere else if you see a huge line waiting to be seated.  You'll be frustrated more about the service and it will compromise your overall first impression about their food if this is the case.", "rating": 5, "date": "2006-02-12"}, {"excerpts": ["Their Godzila roll is to die for and they always have this very special walu on the menu that will literally melt in your mouth.  ", "The chefs?  "], "author": "Kim D.", "review": "I can't even begin to tell you how many people I have turned on to this place.  Rather than bore you with all those details, I'll sit here and try to remember my very first visit way over a year ago...  \n\nA few of my skydiving buddies were in town after a long weekend of jumping out of perfectly good airplanes and decided sushi is the cuisine of choice.  Being that us skydivers are on a budget, I knew I couldn't go too far over the $$ on, ehem, City-Search... so that's how I found Godzila.  \n\nWe've all had good sushi, bad sushi and just OK sushi, but in no way shape or form expected to uncover our favorite spicy tuna EVER in what seems like a hole in the wall sushi joint!  The service is always better than average.  The sake is good and cheap.  Their Godzila roll is to die for and they always have this very special walu on the menu that will literally melt in your mouth.  The chefs?  Always smiling, love to toast with you and will hand you paper towels when you accidentally spill a glass or two.  \n\nMy only complaint?  I moved out of Hayes and now have to travel all the way from the Mission to get there.  Oh, and I mainly order rolls here and maybe some nigeri, but I leave the sashimi for, well... elsewhere;-)", "rating": 4, "date": "2007-11-24"}, {"excerpts": ["The Godzila roll is probably one of the best rolls I have had. "], "author": "Jaron W.", "review": "I would like to say one thing before I continue this review because as obvious as it seems, in reading some of the other reviews it must not be that obvious. This is a sushi place. If you want something other than raw fish, do not come here. \n\nI love sushi, and at these types of prices this is the place to go. The fish is always really fresh, especially compared to other sushi places that have the same price range. The Godzila roll is probably one of the best rolls I have had. The menu doesn't have a ton of variety, but it relies on the fact that the fish itself is very tasty. \n\nI take my girlfriend to Godzila almost once a week. Every week we order our favorites and order a new sake. It's a great way to start a Friday night. They are always playing classic rock, which is my kind of music, and the decorations of drawings and posters of Godzilla make the place a unique, fun place. The chefs are really nice, and know me now.\n\nSo try it out if you like sushi and sashimi. If you don't eat fish don't bother, if you want teriyaki chicken, don't bother. The place is great and cheap to boot.", "rating": 5, "date": "2008-07-10"}, {"excerpts": ["One Godzila roll (I'm American, yo!) and one 7 piece Hamachi Sashimi plate (I think I'm turning Japanese).  ", "White blushing with pink hues....", "cold...fresh", "....jesus h. ", "fucking christ ", "it was the best god damned hamachi I've ever had.  ", "The Godzila roll went perfectly with the Quiet Riot music in the background that should have been turned up a bit higher.  ", "If you haven't noticed yet, the Godzila font is, I believe, Fender!  "], "author": "Nobody M.", "review": "I popped my sushi cherry at Godzila, so I've factored some nostalgia into my rating.  And that's not a bad thing.  In fact, if you go way back it might help others appreciate Godzila now.  Basically it hasn't changed.  15 years ago or so the place was the same as it was....the only thing different is that back then there were 1/2 as many (ok, 33% fewer) sushi restaurants around.  The ones that were were either stodgy traditional Japanese places run by commies who wanted to return to pre-Hiroshima days (they opened restaurants as a way of getting back at Americans) or they were tourist/American-jin traps with lots of fake crab rolls, with teriyaki everything and coke on tap.  Godzila was and is still? run but a bunch of crazy Japanese sushi rock star chefs.  \n\nFast forward to tonight, 2 hrs. ago....I laid my helmet down at the sushi bar and promptly had miso soup, hot tea and an order taken down....5 min later I was in an epicurean heaven....One Godzila roll (I'm American, yo!) and one 7 piece Hamachi Sashimi plate (I think I'm turning Japanese).  White blushing with pink hues....cold...fresh....jesus h. fucking christ it was the best god damned hamachi I've ever had.  The Godzila roll went perfectly with the Quiet Riot music in the background that should have been turned up a bit higher.  If you haven't noticed yet, the Godzila font is, I believe, Fender!  This place just rocks.  \n\nAfterwards I rode my Triumph up twin peaks and contemplated both the joy and misery of being single.  (Had there been two of us it would have been much more difficult to get a seat and chicks don't dig on 40mph 10 degree wind--even if the view is awesome ;))", "rating": 5, "date": "2007-08-18"}, {"excerpts": ["Also, I recommend trying the godzila roll & kamikaze rolls in particular."], "author": "Jaya B.", "review": "This is my favorite restaurant in SF. The sushi is freakin delicious, its a casual atmosphere, and the prices are reasonable.  I also really recommend the mochi-- they always have usually 4 different flavors and are usually really good, like blueberry, pistachio, cherry chocolate!  \n\nAlso, I recommend trying the godzila roll & kamikaze rolls in particular.", "rating": 5, "date": "2009-01-07"}, {"excerpts": ["Some of my favorites are the tinkie winkie roll and the godzila roll. "], "author": "Olga P.", "review": "Great place, cheap and yummy sushi, they are a bit small so expect a bit of a wait. It's worth it though. Some of my favorites are the tinkie winkie roll and the godzila roll. It doesn't have entrees or bento boxes mostly sushi rolls, nigiri and sashimi. Great place to start out a night on the town.", "rating": 4, "date": "2008-11-17"}], "megalon roll": [{"excerpts": ["(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) "], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["Ordered the spicy tuna roll and megalon roll last night. ", "But not before a server brought me someone else's credit card slip to sign, before I had even ordered anything. "], "author": "Brendan R.", "review": "Ordered the spicy tuna roll and megalon roll last night. But not before a server brought me someone else's credit card slip to sign, before I had even ordered anything. The hell?\n\nWhile I was waiting for my order, couldn't help but notice one of the workers crouched behind the sushi bar eating something - totally against health code to eat next to a food preparation surface.  (I should have cancelled my order and fled at this point)\n\nI got it to go so didn't notice that the spicy tuna roll was actually a california roll with sriracha squirted on it until I was blocks away. Whatever. Ate it anyways. Both rolls tasted off, very not fresh tasting. I started to get a bad feeling about my choice of dinner. Roughly two hours later I had explosive watery diarrhea that wouldn't stop even after multiple doses of Pepto. Didn't sleep til 3am. More diarrhea after I woke up a couple of hours ago.\n\nI'm suspecting that they snuck escolar (the \"ex-lax fish\", look it up) into one of the rolls by calling it something else, a common tactic of unscrupulous trashy sushi restaurants trying to save money by not buying more desirable cuts of fish. Or, they served me rancid food. Either are unacceptable.\n\nI know this is a terrible neighborhood for food options and you might feel desperate but for the love of god DO NOT eat here. Take your money elsewhere, your bowels will thank you.", "rating": 1, "date": "2018-06-19"}, {"excerpts": ["and I had the Megalon roll. "], "author": "Jenny M.", "review": "This is on our way home and we finally stopped in to check it out.\n\nWe ordered gyoza for an appetizer, my husband had the Godzilla roll and I had the Megalon roll. For dessert: mango mochi ice cream.\n\nThe rolls were a good size and the food over all tasted fine. We left feeling satisfied, not over fed :)\n\nMay come here again since it is on our way", "rating": 4, "date": "2015-10-14"}], "monster roll": [{"excerpts": ["Unagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\n"], "author": "Kevin F.", "review": "Saba\nUnagi\nRock n Roll\nU-nasu\nMonster roll\nMochi (red bean.mango)\nTea\n\nAll was underwhelming. Not spicy. Sketchy service.\nStomach issues within 35 minutes!", "rating": 2, "date": "2017-05-14"}], "tinky winky roll": [{"excerpts": ["Tinky Winky roll ($7.50, ", "scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and ", "I liked how the scallop wasn't too fishy. ", "This seems to be a favorite among Yelp reviewers. ", "Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) "], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["I have never craved another sushi roll more than I have their Tinky Winky roll (scallop, salmon, crab, avocado and tobiko). ", "It must be the shisho leaf that makes it extra fresh and delicious - just love it! "], "author": "Rona V.", "review": "Another one of my go-to places for lunch. I love the sushi here. The proportion of rice to fish is perfect. They only use real crab and their sashimi is always fresh. I have never craved another sushi roll more than I have their Tinky Winky roll (scallop, salmon, crab, avocado and tobiko). It must be the shisho leaf that makes it extra fresh and delicious - just love it! You can't beat the price at $7.50 either. \n\nI also get their Salmon Donburi. The salmon is never overcooked and is served with perfectly steamed broccoli. I ask for extra ginger on the side with everything. Theirs seems to be sweeter than other places. Overall, an inexpensive spot to satisfy my sushi and fish cravings! Thank you Godzila!", "rating": 4, "date": "2016-01-09"}, {"excerpts": ["Tinky Winky Roll: "], "author": "Logan N.", "review": "Who wouldn't like this place. The place is decorated Godzila style. Everything is fresh, reasonably priced, and tasty, but my favorite are the special rolls:\n\n1. Godzilla roll: (order this everytime)\n2. Surprise roll: (this is one of the most expensive on the menu but not my fav. The outside had scallops but the inside had mashed up stuff which I'm not a fan of)\n3. Tinky Winky Roll: fun-er to say than eat\n\nWill definitely come back! Street parking easy.", "rating": 4, "date": "2012-08-17"}, {"excerpts": ["The one star of the menu was the Tinky Winky roll. ", "Yum. ", "Such awesome flavors going on, but only 4 pieces!? "], "author": "Dana J.", "review": "We had some tasty rolls here but out of all the fantastic sushi in this city, it doesn't exactly rank the highest. I must say it's one of the cheapest sushi bars I've been to in SF. The night we tried Godzilla they seemed to maybe have a new waitress because she really wasn't on the ball with service. We had to ask twice for a water refill and we had some spicy rolls. Not cool!\n\nThe one star of the menu was the Tinky Winky roll. Yum. Such awesome flavors going on, but only 4 pieces!? Make it 6 and we'll definitely order take out from you guys!\n\nWasn't really a fan of the sunset roll but that might be my own problem with shisho leaf flavor. \n\nThe takeaway: bad service, tiny place, cool godzilla artwork, decent sushi. Nothing to write home about. :)", "rating": 3, "date": "2014-08-29"}, {"excerpts": ["Tinky Winky roll is worth the embarrassment in saying it outloud as well as the mussels. ", "The Godzilla memorabilia all over the restaurant adds a cutesy touch to this solid around-the-way sushi joint."], "author": "Raven D.", "review": "Good, fresh, delicious sushi for the money. It seems there's no price ceiling on how expensive sushi can get but finding decent quality for good prices can be trickier. Look no further when trying to solve that little conundrum. Tinky Winky roll is worth the embarrassment in saying it outloud as well as the mussels. The Godzilla memorabilia all over the restaurant adds a cutesy touch to this solid around-the-way sushi joint.", "rating": 4, "date": "2012-06-24"}, {"excerpts": ["Had 2 orders of miso, seaweed salad, 3 orders of nigiri, a yellowtail / scallion roll and the Tinky Winky roll-we were both satisfied for $32-which ", "As others have said, the tinky winky roll is while horribly named, frickin delicious-salmon, scallops and crab! "], "author": "Afton T.", "review": "Boyfriend picked me up from a facial tonight and we went to pick up sushi-I looked so fucking nasty that everyone inside Godzila probably thought he was a saint for dating me. That or I had an AMAZING personality. ANYWAY. \n\nBeen meaning to come here for a while as many people recommend it as a cheap sushi place that's not nasty, and fairly close to my house. And I was pleasantly surprised tonight!\n\nHad 2 orders of miso, seaweed salad, 3 orders of nigiri, a yellowtail / scallion roll and the Tinky Winky roll-we were both satisfied for $32-which I was happy with. \n\nWe took the food to go, so cant really comment on the service. The food was very good though. As others have said, the tinky winky roll is while horribly named, frickin delicious-salmon, scallops and crab! The spicy scallop nigiri was excellent as well.\n\nDefinitely will go back, probably again to take out, because the ambiance was not my favorite-but good sushi for a good price.", "rating": 4, "date": "2010-01-13"}, {"excerpts": ["She also had the Tinky Winky Roll ($5.75).  ", "She wasn't as impressed since it came with a mixture of crab and mayo.  ", "It was okay for her.  ", "She also added a Spider Roll ($6.50), which was soft shell crab to her dinner.  ", "On their special menu, they also served Walu nigiri ($3.50).  ", "Walu, also known as escolar, or butterfish, is a snake mackerel.  ", "(It's actually known to cause gastrointestinal symptoms upon eating it, I have yet to check with Lorna D. to see if she experienced any of these side effects yet.)  ", "The fish tasted more watery than anything, not a whole lot of flavor behind it.  "], "author": "Teri C.", "review": "With a name like Godzila, you would expect extraordinary!\n\nLocated on the corner of Divisadero and Bush, Lorna D. was lured by its promising name and her love of all things raw, especially sushi.  We found ourselves here on a Tuesday night and wandered in.  \n\nAs we walked through the door, I asked her if she wanted to sit at the sushi bar or table.  This was quickly answered for us as the handful of tables were already occupied, so we climbed up onto the bar stools.  (You'll find nifty hooks to hang your purse underneath!)\n\nI went for the Chirashi Don ($9.25), which came with miso soup and a side salad.  The salad was basic with iceberg lettuce, cucumbers, and sprouts.  The dressing was a miso based type.  The soup was standard with tofu and seaweed.  At such a cheap price for a chirashi, I wasn't expecting too much fish.  It came in an average size bowl with two pieces of imitation crab meat, maguro, sake, hamachi, saba, some white fish, and I think something else.  Overall, it was okay.  Some of the fish was fresher than others, but not bad for a chirashi don.\n\nLorna went for their signature dish - the Godzila Roll ($8.25).  This roll had about four different kinds of fish wrapped inside the roll.  I forgot what kind of fish it was, but Lorna D. loved it!  \"It's hella good!\"  She also had the Tinky Winky Roll ($5.75).  She wasn't as impressed since it came with a mixture of crab and mayo.  It was okay for her.  She also added a Spider Roll ($6.50), which was soft shell crab to her dinner.  On their special menu, they also served Walu nigiri ($3.50).  Walu, also known as escolar, or butterfish, is a snake mackerel.  (It's actually known to cause gastrointestinal symptoms upon eating it, I have yet to check with Lorna D. to see if she experienced any of these side effects yet.)  The fish tasted more watery than anything, not a whole lot of flavor behind it.  Rather disappointing.\n\nI decided to add a Spicy Tuna Roll ($4.75) to my dinner and the ends were exploding with spicy tuna.  I did appreciate all the excess of tuna, but I had to request some mayo to 'creamy' it down a bit and take off some of the heat.\n\nThe big winner of the night was the Mochi ice cream!  At $3.25 for two pieces, you can choose among the different varieties they offer.  Last night they had Azuki, Blueberry Cheesecake, Raspberry White Chocolate, Pumpkin, and Chocolate Peanut Butter.  Lorna D. went for the Raspberry White Chocolate and Blueberry Cheesecake.  When I saw her face after she bit into the Blueberry Cheesecake, I knew I had to get an order for myself.  I had the Pumpkin as well.  But that Blueberry Cheesecake Mochi is FABU-LO-SO!  Yum yum!  It tasted so good!  The first bite being gentle and plain because of the mochi outside, and then you get the gentle sweetness of the blueberry, and then a wow factor hits when you taste a chunk of cheesecake.  Oh. My. Gawd.  So good!  We inquired about these yummy mochis since the flavors were so unique and discovered they were from Bubbies Homemade Ice Cream & Desserts in Hawai'i!  http://www.yelp.com/biz/regFkesM5XQLLYgs2qe7lA  I would go back to Godzila just for this mochi...actually, screw that!  I'm going to order some myself and have them ship it to me!\n\nService was okay.  We had to ask for our tea to be refilled.  They also served a brown tea that reminded me of eating at a Chinese restaurant.  The waitress also gave us our bill before we were done, which wasn't entirely her fault since it may have appeared that we were done already.  \n\nAmbiance...for such a small restaurant, it can get really loud in there!  I was rather surprised.  They have a TV on, which can contribute to the noise pollution.  \n\nGodzila Sushi - an average place to go to.  Some good rolls and some okay ones to boot.  But save room for their mochi!  Yum yum!\n\nSidenote: $10 minimum for credit card use; 10% gratuity will be added on to go orders of $50.00 or more.", "rating": 3, "date": "2007-01-17"}, {"excerpts": ["I kept it simple since this was my first time there:  Unagi & white tuna nigiri, and the Tinky Winky Roll.  ", "Don't be fooled by the silly/funny name - Tinky Winky is very  serious & sophisticated!  ", "Shiso leaf, salmon, avocado, watercress (and another fish, I think...) ", "= my new favorite.  ", "The shiso leaf is the kicker - like a savory version of mint...", "it's sooooo goood.\r\n\r\n", "There's no atmosphere to speak of, but it's not about that here.  ", "This is more like a sushi diner:  dependable, neighborhood-y, no frills.  ", "The service could be friendlier, but hey, the service at Ozumo totally sucks and you don't have money left over to buy shoes the next day!!\r\n", "I liked that they served black tea instead of green tea for a change, too.\r\n", "Well priced, quick service, very good sushi."], "author": "Liz S.", "review": "Little restaurant, big taste.\r\n\r\nI went with a friend for a quick dinner after yoga, and we only had to wait about 10 minutes which was good, because there is barely any room to stand.  It's one of those sign-up sheet places where you can't help but stare like a hawk at the other diners in hopes that they will give up their seat soon.  Good thing that yoga gives me the patience that I don't normally have!  \r\n\r\nI kept it simple since this was my first time there:  Unagi & white tuna nigiri, and the Tinky Winky Roll.  Don't be fooled by the silly/funny name - Tinky Winky is very  serious & sophisticated!  Shiso leaf, salmon, avocado, watercress (and another fish, I think...) = my new favorite.  The shiso leaf is the kicker - like a savory version of mint...it's sooooo goood.\r\n\r\nThere's no atmosphere to speak of, but it's not about that here.  This is more like a sushi diner:  dependable, neighborhood-y, no frills.  The service could be friendlier, but hey, the service at Ozumo totally sucks and you don't have money left over to buy shoes the next day!!\r\nI liked that they served black tea instead of green tea for a change, too.\r\nWell priced, quick service, very good sushi.", "rating": 4, "date": "2006-05-04"}, {"excerpts": ["I recommend the Tinky Winky Roll. ", "All of the fish is very fresh and very reasonably priced.  ", "Side note", ": I'm not a huge fan of spicy tuna "], "author": "Kris P.", "review": "By far my favorite sushi place in the city.  Everything about this place is super rad. \n\nThe servers are quick and very friendly. The sushi chefs are great and love to drink with the patrons.\n\nThe food is outstanding. I recommend the Tinky Winky Roll. All of the fish is very fresh and very reasonably priced.  Side note: I'm not a huge fan of spicy tuna but I like it here. \n\nAnytime a friend comes in to visit I always take them here. 1 hour and numerous saki bombs/sushi rolls at Godzilla is heaven.", "rating": 4, "date": "2010-01-10"}, {"excerpts": ["Other rolls to enjoy: Godzilla Roll, Tinky Winky Roll, and the Spider Roll.\n\n"], "author": "Judy L.", "review": "Delicious! Real hearty sushi at a reasonable price. You'll have to wait for it. Amazing spicy tuna rolls. Other rolls to enjoy: Godzilla Roll, Tinky Winky Roll, and the Spider Roll.\n\nIf you go with 6 people, be prepared to be crammed into a table that seats 4.", "rating": 5, "date": "2005-04-24"}, {"excerpts": ["Love the Tinky Winky roll. ", "The dinosaur decor is pretty cute."], "author": "C E.", "review": "Our neighborhood staple. Delicious and dependable. Love the Tinky Winky roll. The dinosaur decor is pretty cute.", "rating": 4, "date": "2013-02-02"}, {"excerpts": ["I ordered the Chirashi and the Tinky Winky roll.  ", "The Chirashi was a lot smaller of a portion than I was used to but also a lot cheaper.  ", "The rolls were decent ", "and I was impressed that they were decently priced.  ", "I wasn't wowed by their food nor their ambiance ", "but I wasn't turned off by anything either.  ", "Overall, just a decent place."], "author": "Jean A.", "review": "I met a few of my old coworkers here a few weeks ago for post-work dinner.  We met around 6 pm, pretty early still, so we got seated promptly.  It wasn't crowded at all.  The waitress took our order and served our food at lightning speed.  We all got sushi rolls.  I ordered the Chirashi and the Tinky Winky roll.  The Chirashi was a lot smaller of a portion than I was used to but also a lot cheaper.  The rolls were decent and I was impressed that they were decently priced.  I wasn't wowed by their food nor their ambiance but I wasn't turned off by anything either.  Overall, just a decent place.", "rating": 3, "date": "2009-09-28"}, {"excerpts": ["I've got to admit it took me a little white to get over the decor and the loud music, but for the Tinky Winky roll I'd do just about anything. ", "It's honestly the best sushi in the city, and you won't break the bank. ", "The mochi ice cream balls are excellent - Pistachio is the best."], "author": "Steph B.", "review": "Once you go Godzilla you can't go back. I've got to admit it took me a little white to get over the decor and the loud music, but for the Tinky Winky roll I'd do just about anything. It's honestly the best sushi in the city, and you won't break the bank. The mochi ice cream balls are excellent - Pistachio is the best.", "rating": 5, "date": "2008-05-26"}], "gigan roll": [], "destroyah": [{"excerpts": ["Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like "], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["I got the King Ghidor and the Destroyah. ", "Solid, solid choices."], "author": "Shaymaa M.", "review": "Reasonably priced, great quality sushi with plentiful flavors and combos. Attentive sushi manufacturers, AMAZING (and cheap) plum wine, lots of ginger and wasabi. BF got the Rock and roll & Nigiri and loved it. I got the King Ghidor and the Destroyah. Solid, solid choices.", "rating": 4, "date": "2016-03-15"}, {"excerpts": ["Highly recommend the King Kong Roll and the Destroyah roll. ", "Also very fairly priced!!! ", "Try it!! ", "Service was attentive and polite."], "author": "Leon C.", "review": "Fresh and Amazing! Highly recommend the King Kong Roll and the Destroyah roll. Also very fairly priced!!! Try it!! Service was attentive and polite.", "rating": 5, "date": "2015-09-29"}], "caterpillar roll": [], "hodorah roll": [{"excerpts": ["Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+"], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). ", "I liked the hodorah and salmon roll the most. ", "Neither of us were too big of a fan of the salmon skin. ", "It was drier than other places I've had it at."], "author": "Linda X.", "review": "Decent quality of sushi and good prices especially for the area. The service was nice and attentive and there is plenty of seating inside. \n\nMy boyfriend and I got the tempura shrimp and vegetable appetizer ($8). It was on the oily side but pretty good. We ordered the salmon skin roll ($5), eel roll ($6), salmon kamikaze roll ($6), and hodorah roll which had salmon, crab, and mango ($7.50). I liked the hodorah and salmon roll the most. Neither of us were too big of a fan of the salmon skin. It was drier than other places I've had it at.", "rating": 3, "date": "2015-11-29"}], "king ghidor roll": [], "biollante roll": [], "mothra roll": [{"excerpts": ["Mothra roll ($13.50, ", "BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside)", ": Oh man, so good. ", "It's kind of a hodge podge mixing heavy ", "(BBQ eel/avo) with light (ponzu/white tuna/tobiko) "], "author": "Edna C.", "review": "With the many high-quality sushi places around SF (including several Michelin rated ones, none less), one could say there is plenty of fish. To be honest, I was somewhat nervous about trying a place named Godzila Sushi, since non-Japanese-sounding names are almost blasphemous from a sushi purist's perspective. \n\nHowever I browsed through some of the photos and starting salivating over the delicious-looking, Godzila-sized rolls--even if quality were not Micheliin status, an abundance of decent rolls was enough to warrant a trek to Pac Heights. (And get gas at the Arco while you're at it).\n\nGodzila is one of those places that's ideal with a somewhat larger group, but not too large because the place is small. Leftover sushi is no bueno and you want to order enough variety to satisfy your curiosity, so 3-4 people would be ideal. \n\nThings we've tried (Disclaimer: this is over 2 visits... testifies to how crazy I am over trying all da rolls)\n\n(++) Kaarage: Quite good, very crispy. The pieces are small so get a lot of batter per bite\n\n(++) Nasu roll ($3.95, Japanese eggplant): simple and light\n\n(+++) King Kong roll ($13.50, spicy tuna/cucumber/avo inside | baked salmon with special sauce/scallions/tobiko outside): Godzila's version of the Lion King; creamy and indulgent\n\n(+++) Tinky Winky roll ($7.50, scallop/salmon/crab/avo/shiso leaf/sprouts/tobiko): more complex than your typical maki, and I liked how the scallop wasn't too fishy. This seems to be a favorite among Yelp reviewers. Note that the diameter is quite big, so may not be the best for a first date night if you don't want to open your mouth to monstrous (Godzila?) proportions\n\n(++) Hodorah roll ($7.50, BBQ eel/crab/seaweed salad/tobiko/mango/special sauce): a bit too heavy on the sauce for my tastes, but not bad (GOT fans would also be amused by the similarity to Hodor)\n\n(+++) Mothra roll ($13.50, BBQ eel/cucumber/avo inside | sizzled white tuna/bonito/ginger/tobiko/scallions/ponzu outside): Oh man, so good. It's kind of a hodge podge mixing heavy (BBQ eel/avo) with light (ponzu/white tuna/tobiko) but somehow it comes together flawlessly.\n\n(++) Megalon roll ($12.95, crab/avo/cucumber inside | fresh salmon/wasabi/tobiko outside): like a giant California roll topped with giant pieces of salmon\n\n(++) Rainbow roll ($12.50, crab/avo/cucumber inside | assorted fish outside): Here's where the non-perfect fish could be an suboptimal if you are a die-hard sashimi fan, but should not a problem for the general population\n\n(++) Destroyah ($12.95, shrimp tempura/gobo/cucumber inside | spicy tuna/ponzu/scallions/tobiko outside): the guilty pleasure fusion type with tempura--adds a nice variety to the otherwise more zen-like rolls\n\nWith *real crab*, creative rolls that are not just all tempura and sauce, and immensely satisfying portions, Godzila is definitely a staple.\n\nService is excellent too, and the Godzila-themed decor is light-hearted and fun (reminds me of the eccentric, themed ambiance of Halu ramen). Just be aware that the lighting is a bit dim at night, so if food pictures are very very important to you, it may be better to go during lunchtime. Parking isn't terrible if you are patient to circle around the neighborhood, and unfortunately Godzilla isn't there to remove buildings and create more parking spots for you.", "rating": 5, "date": "2017-11-06"}], "er roll": [], "giants roll": [], "warriors roll": [{"excerpts": ["I got was the Warriors Roll which consists of mango and asparagus in the middle topped with toro.  ", "I have to say this roll is better than the last rolls (49er, etc.) ", "I've had.  ", "Maybe their sushi technique has improved because the roll had the right balance of rice and fish.  ", "I hate it when the rolls have way too much rice in proportion to the fish.  "], "author": "Bailey N.", "review": "This place is as authentically Japanese as Godzilla is real.  Anyone else notice that Godzilla is spelled incorrectly? Godzila? \n\nI've only been here multiple times on a lunch break from work and I notice a majority of patrons ordering a bento box, which is the generic and mainstream equivalent to ordering a pad Thai at a Thai restaurant or sweet and sour pork at a Chinese restaurant.\n\nI like things fancier.  I only order off the special menu written on the chalk board wall and usually there's three specialty rolls.  Last roll I got was the Warriors Roll which consists of mango and asparagus in the middle topped with toro.  I have to say this roll is better than the last rolls (49er, etc.) I've had.  Maybe their sushi technique has improved because the roll had the right balance of rice and fish.  I hate it when the rolls have way too much rice in proportion to the fish.  Also ordered agedashi tofu and wish the tofu soup was piping hot, not barely lukewarm.\n\nThe special rolls are pricey ($13-14) given that it's not top notch fish and this place is nothing particularly trendy or nice, cue Ozumo.  Service has always been friendly and while it's not the best sushi I've ever had, it fits the bill during lunch time (mostly for geographical reasons) when I get a sushi craving. \n\nMore like 3.5 stars.", "rating": 3, "date": "2015-10-05"}], "cindy roll": []}