{"golden gate appetizer plate": [], "spring egg rolls": [], "deep fried squids": [], "deep fried shrimp": [], "minced seafood in lettuce cups": [], "minced squid in lettuce cups": [], "minced pork in lettuce cups": [], "minced beef in lettuce cups": [], "dried scallop with yellow chive soup": [], "sizzling seafood rice soup": [], "shrimp dumpling soup": [{"excerpts": ["Clam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["We had the shrimp dumpling soup.  ", "The dumplings were actually pretty tasty and we speculated that they were left over from dim sum, but the broth was so watered down as to be tasteless (I hate when they destroy something good to be cheap)  ", "They screwed up my order and did nothing about it, even after we pointed it out.  ", "Their attitude seemed to be you ordered 3 items on the menu and you got three item, what's the problem?  ", "The service was not good.  ", "They have several servers there and they either clustered around a table or disappered, from the room entirely.  ", "Given the economy, I want to support the local guys, but I will not come back, there are too many other restaurants in this neighborhood."], "author": "L C.", "review": "I went here for dinner last night and was very unimpressed.  We had the shrimp dumpling soup.  The dumplings were actually pretty tasty and we speculated that they were left over from dim sum, but the broth was so watered down as to be tasteless (I hate when they destroy something good to be cheap)  They screwed up my order and did nothing about it, even after we pointed it out.  Their attitude seemed to be you ordered 3 items on the menu and you got three item, what's the problem?  The service was not good.  They have several servers there and they either clustered around a table or disappered, from the room entirely.  Given the economy, I want to support the local guys, but I will not come back, there are too many other restaurants in this neighborhood.", "rating": 2, "date": "2009-01-18"}], "steamed chicken with ginger and green onion": [], "cold chicken": [], "dynasty roast squab": [], "steamed chicken in ginger sauce": [], "chicken fillet with double mushroom": [], "beef with double king of mushroom": [], "tokyo beef": [], "black pepper short ribs": [], "salt pepper short ribs": [], "peking pork chop": [{"excerpts": ["We ordered Peking pork chop, tofu sole hot pot, green beans and green onion chicken. "], "author": "Wendy H.", "review": "3/19/08 Update:\n\nOk we finally got around to having dinner here.  We did take out and we also ate in.  \n\nTake out:  We ordered Peking pork chop, tofu sole hot pot, green beans and green onion chicken. That qualified us for free delivery.  \n\nDelivery was fast and food came out hot.  Food was pretty good.  Portions are a bit on the small side.  Would do take out again.\n\nEat in Dinner:  After testing out their dinner food, I made reservations for a table in the patio room for a family dinner.  This was an early dinner (5:30).  The hostess the reservation wasn't a problem.  \n\nHowever, when we got there, they told us that a bunch of people (who's been eating since 2 PM!?!?) is still squatting on our reserved table.  They did not have the heart or were gutless to kick these losers out of our table.  Upon inspection, those people weren't even eating.  They were squatting at the table chit chatting (how to ya like that?).  \n\nThe other tables in the patio room were reserved for other people at 7 (huh, we came at 5:30, how come we can't have one of those?  We're super fast eaters!) so they didn't want to offer those tables to us.  The waiter offered the ones in the front room but my folks complained about the room being drafty (it is cold w/ the door opening and closing).  \n\nFinally, they made a makeshift table of 10 for us in the hallway connecting the front room to the patio room (the hallway were tables of 4 are located).  Unfortunately, that meant we were squeezed together in the table cuz one side of the table is flushed against a wall (so no on can sit there!).  They also gave us a bum lazy susan that literally moves across the table when you spin it!.\n\nReally for all our discomfort and inconvenience (remember, we had a reservation!), you'd think they'd give us a discount or throw in some free food. Nada.  We got zilch!  They just apologized and said we'll make it up to you next time.  Really, I don't know how you're gonna make it up to us since there's no documentation of what ya did and you didn't promise a free dish or anything like that!\n\nFood was ok but on the small portioned side.\n\nOh yeah, we finished and left before that 7:00 PM reservation for the remaining patio room tables arrived.  So ya see, we would have vamoosed it before anyone showed up.  We have some consideration!\n\nThose damn squatters on our reserved table were still sitting around and NOT EATING by the time we left.\n\nBased on the poor dinner service, I'm deducting a star (I'm being generous too!).  Come here for the dim sum.  Don't come here for dinner.\n\n*********************************\n\nI heard about this new restaurant via Chowhound so I decided to take the parents for lunch here.  This is a little bit off Clement St (a couple of  blocks past Park Presidio to be exact, between 19th & 20th Avenue).\n\nRestaurant is very spacious and clean.  They sat us in the back, indoor patio section.  There's a real nice koi filled fountain beyond the patio that you can go out and look at the Koi.  Several of the patrons actually went out and got a smoke there.\n\nThere are no carts.  Service is given via a check list.  I prefer this because the food comes out hot.  Dim sum is excellent.  My folks raved about how the Chicken Feet were the best they've had in a long time.  That's saying something cuz they always complained about the chicken feet.\n\nWe also ordered a plate of vegetarian chow mein.  That was pretty yummy too.\n\nThe food was done just right.  Not too salty.\n\nService was excellent.  The staff checked back to see how you were doing and you were profusely thanked on your way out the door.\n\nDim sum prices $2-$4.50.  Pretty reasonable considering the Banquet costs a bit more and food is mediocre at best.\n\nThis isn't just a dim sum house because they serve dinner too.  Based on the menu, I'd say the prices are pretty good.  Gotta go back to eat dinner here one of these days.\n\nParking is the only thing that sucks.  It's very difficult to find parking although I noticed they had the front of their restaurant marked off for customers so I guess if you have a big party, they'd save you 2 spots.\n\nGo ahead, check it out.  Not a bad place to have dim sum!", "rating": 4, "date": "2008-01-20"}], "salt pepper pork chop": [], "orange glazed pork chop": [], "preserved vegetable with chinese bacon": [], "string bean beef": [], "hot spice prawns": [], "prawns with lobster sauce": [], "cashew nuts shrimp": [], "sauteed scallop and shrimp": [], "sauteed prawns": [], "salt pepper prawns": [], "clam in black bean sauce": [], "sliced rock cod with tender green": [], "sauteed sliced rock cod": [], "rock cod filet in back bean sauce": [], "squid with salt and pepper": [], "sauteed fresh squid in black bean sauce": [], "deep fried flounder": [], "sauteed fillet of sole and deep fried": [], "steamed oyster with black ben sauce": [], "special prawns lettuce on sizzling plate": [], "beef steak on sizzling plate": [], "sizzling seafood": [{"excerpts": ["However, the food (pot stickers, chicken feet, shredded duck rice noodles, and sizzling seafood) was all bland and, salty, greasy, and in the case of the seafood metallic. ", "The restaurant, especially the area closest to the kitchen smells like cooked, unseasoned fish. ", "There are plenty of better options in the richmond. ", "Please, do yourself a favor and avoid Golden Gate.!"], "author": "Brian S.", "review": "After reading reviews here on Yelp, I had to try it; well, lets just say that I will not be back. The interior is nice with its wood floors, yellow and turquoise walls, and nice chairs and table cloths. The service was friendly. However, the food (pot stickers, chicken feet, shredded duck rice noodles, and sizzling seafood) was all bland and, salty, greasy, and in the case of the seafood metallic. The restaurant, especially the area closest to the kitchen smells like cooked, unseasoned fish. There are plenty of better options in the richmond. Please, do yourself a favor and avoid Golden Gate.!", "rating": 2, "date": "2009-05-30"}], "sizzling scallop and prawns": [], "sizzling chicken with black bean sauce": [], "sizzling rock cod with black bean sauce": [], "sizzling chicken in clay pot": [], "seafood with bean curd in clay pot": [], "beef stew in clay pot": [], "braised rock cod in clay pot": [], "lamb with dry bean stick in clay pot": [], "catfish with dry bean stick in clay pot": [], "sizzling fog in clay pot": [], "seafood and vermicelli in clay pot": [], "salt fish and chicken with eggplant in clay pot": [], "salt fish and chicken with bean cake in clay pot": [], "pork spareribs rice": [], "chicken with black mushroom rice": [], "chicken sausage rice": [], "frog rice": [], "pork with salt fish rice": [], "braised bean cake with mushroom": [], "steamed tofu stuffed with shrimps": [], "stewed vegetable": [], "eggplant with garlic and spicy sauce": [{"excerpts": ["we had eggplant with garlic and spicy sauce ", "the eggplant was cooked well but u can't taste it being spicy or the garlic at all. ", "we had various other dishes and they too were bland. ", "the only good thing was the dessert, it was coconut agar(haupia) and that was decent. ", "won't be coming back here"], "author": "Stella J.", "review": "probably oneof the worse chinese food places ever. everything that we had was bland and flavorless. we had eggplant with garlic and spicy sauce the eggplant was cooked well but u can't taste it being spicy or the garlic at all. we had various other dishes and they too were bland. the only good thing was the dessert, it was coconut agar(haupia) and that was decent. won't be coming back here", "rating": 1, "date": "2009-07-29"}], "black mushroom water chestnuts and snow peas": [], "string bean with hunan sauce": [], "broccoli with oyster sauce": [{"excerpts": ["We got har gow, beef rice noodle rolls, egg yolk buns, spring rolls and Chinese broccoli with oyster sauce to go. ", "The total came up to be around $25 which wasn't bad in SF. ", "The lady who took our order didn't even offer to give me a receipt. ", "And I never got a receipt. \n", "Waited for about 25 minutes for our order and I asked if they had chopsticks for takeouts. ", "Nope, plastic forks only. ", "Okay, no big deal. \n", "So when we finally started eating, I was so disappointed. \n", "According to my friend, the har gow was average and doughy. \n", "The Chinese broccoli was not even cut, I couldn't use the little plastic fork to pick it up and I had to use my hands to eat. ", "They only gave us a tiny container of oyster sauce too, so for the most part this dish tasted flavorless. \n", "My all time favorite beef rice noodle rolls... ", "I could barely taste beef in it. \n", "Egg yolk buns were small but looked nice. ", "However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \n", "Spring rolls looked sad, burned and soggy. ", "They tasted soggy and greasy, too. ", "Should've went to Panda Express for spring rolls instead lol. \n", "Never going back and won't recommend this place to anyone.", "My all time favorite beef rice noodle rolls... ", "I could barely taste beef in it. \n", "Egg yolk buns were small but looked nice. ", "However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \n", "Spring rolls looked sad, burned and soggy. ", "They tasted soggy and greasy, too. ", "Should've went to Panda Express for spring rolls instead lol. \n", "Never going back and won't recommend this place to anyone."], "author": "Jane L.", "review": "I had such a bad experience with this restaurant. We were hungry and didn't have a car at the time so decided to walk down the street to see what restaurants we could find there. Then we saw dim sum and seafood, so dim sum it is. \nI didn't check Yelp until after we placed the order and I really wish I checked before going in. (Poor safety score is an obvious enough sign already... But I was secretly hoping maybe it meant the food would be good lol.) \nWe got har gow, beef rice noodle rolls, egg yolk buns, spring rolls and Chinese broccoli with oyster sauce to go. The total came up to be around $25 which wasn't bad in SF. The lady who took our order didn't even offer to give me a receipt. And I never got a receipt. \nWaited for about 25 minutes for our order and I asked if they had chopsticks for takeouts. Nope, plastic forks only. Okay, no big deal. \nSo when we finally started eating, I was so disappointed. \nAccording to my friend, the har gow was average and doughy. \nThe Chinese broccoli was not even cut, I couldn't use the little plastic fork to pick it up and I had to use my hands to eat. They only gave us a tiny container of oyster sauce too, so for the most part this dish tasted flavorless. \nMy all time favorite beef rice noodle rolls... I could barely taste beef in it. \nEgg yolk buns were small but looked nice. However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \nSpring rolls looked sad, burned and soggy. They tasted soggy and greasy, too. Should've went to Panda Express for spring rolls instead lol. \nNever going back and won't recommend this place to anyone.", "rating": 1, "date": "2016-07-05"}], "dry scallop egg white fried rice": [], "fok chow fried rice": [], "combination seafood fried rice": [], "salted fish and chicken fried rice": [], "shrimp fried rice": [], "barbecued pork fried rice": [], "vegetable chow mein": [], "barbecued pork chow mein": [], "singapore fried rice noodles": [], "shredded duck fried rice noodles": [], "vegetable chow fun": [], "combo dinner": [], "deluxe dinner": [], "steamed pork dumplings": [{"excerpts": ["Steamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\n", "Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n", "House steamed shrimp dumplings ($2.50)\n", "Steamed scallops dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["* Steamed Pork Dumplings ($2)\n", "* "], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "steamed pork spareribs": [{"excerpts": ["Steamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\n", "Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n", "House steamed shrimp dumplings ($2.50)\n", "Steamed scallops dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "steamed chicken feet": [{"excerpts": ["Steamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\n", "Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n", "House steamed shrimp dumplings ($2.50)\n", "Steamed scallops dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["* Steamed Chicken Feet ($2)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}, {"excerpts": ["I'm not a huge fan of their steamed chicken feet (even though it's my all time favorite at any dim sums), but it just doesn't taste as fresh and their sauce/ marinate is meh. \n\n"], "author": "Johanna T.", "review": "Miss the cheap(er) dim sum in a restaurant environment rather than take out? I'm not even sure if you can still get it cheap at to-go places, either! \n\nThis place is a solid go-to place. They have dishes that range from $2.25, $3.25, $3.75, and $5.25. The $5.25 one is usually the one that only some people find tasty, so you don't really have to worry. The thing to go with here is definitely the steamed churng fun (I prefer either the shrimp, meat, or fish fillet one... Wasn't too crazy about the bbq) The churng fun can have more stuffing in them, but the noodles are nice are soft, fresh in my opinion compared to some other dim sum places! Aside from the churng funs, go with anything shrimp. I usually don't like the ha gao, BUT for some reason theirs taste good!! I think it's because they actually de-vein (poop) the shrimp so it doesn't feel as yeucky. Their shrimps are nice and crunchy. They also have a deal with their lobster sauce noodles which was decent and flavorful for the 10-15 bucks they charge you. Their lobster tastes fresh and its meat is sweet! \n\nI'm not a huge fan of their steamed chicken feet (even though it's my all time favorite at any dim sums), but it just doesn't taste as fresh and their sauce/ marinate is meh. \n\nThis place isn't the hoo ha of all dim sums, but it's good. It looks jenky and there's seatings when you walk past the kitchen area... which is a bit stinky and possibly unsanitary, but meh! No food is good unless it feels like it's a hole in the wall!  The bathroom is upstairs and decently clean... BUT hopefully you're not too tall because the ceiling is probably only about 6'5\" high! Lol", "rating": 4, "date": "2015-01-14"}], "steamed egg custard bun": [{"excerpts": ["Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "deep fried stuffed dumplings": [{"excerpts": ["Deep fried stuffed dumplings ($2)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["Deep Fried Stuffed Dumplings ($2)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "deep fried sesame balls": [{"excerpts": [", we ordered the turnip cake \"fired\" in xo sauce based on all the rave yelp reviews (meh,  kinda flavorless - don't understand the hype), rice noodle with shrimp (decent), stuffed eggplant with shrimp (decent, but again lacking flavor), deep fried sesame balls (a bit thick and hard and not the fried, sweet deliciousness that one would expect), shark fin dumpling (i protested, "], "author": "shannon j.", "review": "sadly disappointing!  met my parents here for saturday morning dim sum at the recommendation of a couple of relatives who usually are in the know about great cheap eats.\n\nto start, arrived at 10am to an empty dining room, raising a mild suspicion.  sat down and immediately noticed the white table cloth under our paper place mats was soiled with probably spilled tea and soy in multiple locations, more concern considering we were probably the first to be seated there that morning.  am not so squeamish to be put off so easily, however, ewwwww factor set in when i picked up my chopsticks and they were grey and gummy.  tried to clean them off with hot tea to no avail, so forced to grab another pair from a neighboring table to find a not quite as dirty pair, but still sticky :(\n\nas for the food, we ordered the turnip cake \"fired\" in xo sauce based on all the rave yelp reviews (meh,  kinda flavorless - don't understand the hype), rice noodle with shrimp (decent), stuffed eggplant with shrimp (decent, but again lacking flavor), deep fried sesame balls (a bit thick and hard and not the fried, sweet deliciousness that one would expect), shark fin dumpling (i protested, but my mother ordered claiming that  \"it's not real shark fin anyway\" - either way a little frightening - was actually impressed by the portion and presentation of this dish in a baby soup bowl), tofu skin rolls (saved the best for last  - actually enjoyed this dish, very tasty!)\n\nthe bill came to $22 - cheap eats indeed!  ok if you are into mediocre.", "rating": 1, "date": "2010-10-12"}], "pan fried turnip cake": [{"excerpts": ["Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["Pan Fried Turnip Cake ($2)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "deep fried egg rolls": [], "steamed bbq pork buns": [{"excerpts": ["Pan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\n"], "author": "Kuanie J.", "review": "This place is open on Sunday morning for dim sum!!! There is an error on Yelp and Google that says it is closed today. Anyways....we have wanted to eat here for years and we were not disappointed. 7 plates and $29 later, we left happy :) we tried:\n\nFried chicken wings (you can pass on these)\nPan fried pork with veggie bun (out of this world!!)\nPan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\nThis place is amazing. Come here. Avoid the hour wait at hong kong lounge. Oh, and it is cheap. My Chinese heritage tells me you should never pay more than $5 for dumplings like you do at the ridiculous trendy places...unless you're getting married.", "rating": 5, "date": "2015-06-02"}], "deep fried pumpkin ball": [], "steamed sweet cake": [{"excerpts": ["We did enjoy the steamed pork buns and the steamed sweet cake though. \n\n"], "author": "Evelyn L.", "review": "Went to this restaurant with my friends since Hong Kong Lounge was packed with the usual Saturday crowds and we were craving for dim sum. Just a little note that they charge extra $0.50 per plate for dim sum during dinner hours. \n\nThe dim sum was okay, not great... Definitely not as good as HK Lounge... For example, the egg yolk buns  did not have the 'oozing' effect when you split the bun in half and the Shanghai dumplings (xiao long bao) were pretty dry; there was no soup/ juice when you bite into the skin.. We did enjoy the steamed pork buns and the steamed sweet cake though. \n\nThe quality of service was below my expectations. I have to admit their service was prompt but their warped logic was a little too much for us... We actually ordered steamed pork buns and they served us chicken buns, telling us that 'oh, these are chicken buns in replacement of the pork buns.' and left. We were baffled, thinking that they probably ran out of steamed pork buns and hence the replacement.. but they didn't check with us if we wanted the replacement (which a usual restaurant would if they ran out of something, no?). So I asked if they ran out of steamed pork buns. I was stunned by their reply -- \"Oh we steamed the wrong buns so we gave you the chicken buns. You stand to gain since the chicken buns are actually more expensive than the pork buns and we are only charging you for the price of the pork buns....\" This makes perfect sense, doesn't it? And she actually said it matter-of-factly... We decided to place another order of steamed pork buns and yes, we were charged for that too (on top of the wrong chicken buns) but we made up for it by giving a tip which they 'rightfully deserve'...", "rating": 3, "date": "2014-01-25"}], "steamed rice with shrimp ball": [], "coconut jello": [{"excerpts": ["-1 food was just ok\n-1 server told us they had coffee jello and brought us 4 pieces of coconut jello...", "no ", "we do not want it."], "author": "Allison T.", "review": "They don't charge for tea....in my dad's book that is one star already.  Not many places do that anymore....maybe chinatown in the small ghetto ones.  Food wise it was just alright.  I have had better stuff elsewhere.  The skin on my chiu chow dumpling was so sticky....it was stuck to my plate.  The siu mai was a bit colorless.  The egg custard lava bun...where is the lava?  The dumpling in the broth....omg it was bad....no flavor whatsoever.  We did order a lot more things but didn't leave a lasting impression.  One thing that was good was is the hotsauce...our server had to come back and refill our container.  Another plus for them was that the service was not bad.  \n\n+1 no charge for tea\n+1 great hotsauce\n+1 very attentive\n-1 food was just ok\n-1 server told us they had coffee jello and brought us 4 pieces of coconut jello...no we do not want it.", "rating": 3, "date": "2008-08-11"}], "steamed beef balls": [{"excerpts": ["Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\n", "Steamed bbq pork bun ($2)\nSteamed beef balls ($2)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["* Steamed Beef Balls ($2)\n", "* "], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "taro cake with chinese sausage": [{"excerpts": ["Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\n", "Steamed bbq pork bun ($2)\nSteamed beef balls ($2)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "house steamed shrimp dumplings": [{"excerpts": ["Steamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\n", "Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n", "House steamed shrimp dumplings ($2.50)\n", "Steamed scallops dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["The one that is the most common for dim sum is called House Steamed Shrimp Dumplings on their menu.\n\n"], "author": "B F.", "review": "Here's another cool weekday-cheap dim sum joint.  The place is a lot bigger than it looks as they have a nice room in the back.  The service was pretty good too.  A minor annoyance eating there was the strong smell of incense permeating the whole restaurant....made me feel kinda nauseous and morbid like I was eating at a funeral.  Plenty of old folks eat here too which is a good thing since old folks know their dim sum. =)\n\nTip 1: They sell their $2, $2.50, and $3 plates at $1.90 on weekdays.\n\nTip 2: They have 3 different types of Shrimp dumpling.  The one that is the most common for dim sum is called House Steamed Shrimp Dumplings on their menu.\n\nTip 3: They have plenty on non-translated items on their menu and whiteboard so you'll need to ask or bring someone that knows how to read Chinese.\n\nMy Dim Sum Rating System:\nFried Egg Custard Buns=3\nPan Fried Pot Stickers=3\nRice noodle roll w/ beef=5\nRice noodle roll w/ shrimp=5\nShrimp Dumpling=4 *\nSteamed Beef Balls=3\nSteamed Chicken Feet=4\nSteamed Shanghai Dumplings=2\nTurnip Cake Fired w/ XO Sauce=5\n\n* Didn't get a chance to try their House Steamed Shrimp Dumpling", "rating": 4, "date": "2010-08-02"}, {"excerpts": ["Clams with Black Bean Sauce and the House Steamed Shrimp Dumplings were superb!"], "author": "Anne H.", "review": "This is an authentic Chinese restaurant, mostly patronized by Asians. Some of the items on the menu will not appeal to Anglos, but the dishes we had were fresh and excellent. Clams with Black Bean Sauce and the House Steamed Shrimp Dumplings were superb!", "rating": 4, "date": "2014-06-25"}], "chives shrimp dumplings": [], "steamed house dumplings": [{"excerpts": ["Steamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\n", "Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n", "House steamed shrimp dumplings ($2.50)\n", "Steamed scallops dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "chicken bun": [{"excerpts": ["Everything we ordered was pretty good, although I wasn't a fan of the chicken bun or the custard bun.  ", "However, the fried chicken wings were DELIGHTFUL.  ", "The service here was excellent, the servers are extremely friendly and attentive, and we got our food pretty quickly.  ", "One weird thing is that we had some extraneous $2 charge on our bill and the man couldn't explain what it was even after we asked. ", "Considering that everything was cheap, it was no biggie."], "author": "Mena A.", "review": "Solid dim sum and for a great price.  Everything we ordered was pretty good, although I wasn't a fan of the chicken bun or the custard bun.  However, the fried chicken wings were DELIGHTFUL.  The service here was excellent, the servers are extremely friendly and attentive, and we got our food pretty quickly.  One weird thing is that we had some extraneous $2 charge on our bill and the man couldn't explain what it was even after we asked. Considering that everything was cheap, it was no biggie.", "rating": 3, "date": "2010-10-24"}], "steamed pea sprout dumplings": [{"excerpts": ["Steamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\n", "Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n", "House steamed shrimp dumplings ($2.50)\n", "Steamed scallops dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "steamed shanghai dumplings": [{"excerpts": ["Steamed Shanghai dumplings ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["did the clay pot rice I also ordered some Steamed Shanghai Dumplings and since its my day off!!! ", "I gotta have me a Tsingtao Beer just to have me some fun on The Chinese New Year Of The Horse 2014!!! ", "And yes if you yelpers have seen my posted pictures of my clay pot rice & steamed shanghai dumplings and also one Tsingtao Beer... ", "I finished it all with my very very hungry appetite!!! ", "Now that it was my very very 1st time being at the Golden Gate Dim Sum Seafood Restaurant... I have to say that the hostess and the waitresses that were working there were all very friendly and helpful on the things... ", "That I have asked for!!!\n", "Since no one from yelp has posted Clay Pot Rice Pictures... ", "I am the first yelper to post a picture of the Yummy Clay Pot Rice!!! ", "Don't drool on it now LOL!!!"], "author": "William B.", "review": "After going to New Hing Lung several times for dinner just to eat their clay pot rice... Now it was time for me to move on to another chinese restaurant that has clay pot rice... And now for my next adventure for clay pot rice and this time... I ended up at Golden Gate Dim Sum Seafood Restaurant of clement st... Came here for lunch on a over cast weather on a monday which was a perfect time to have me some clay pot rice as soon as I got seated quickly by the hostess in which it was just me... Which means a table for one and that would be me!!! As soon as the waitress handed me the lunch menu and when I saw the clay pot rice on the menu... You know what that means that's what I'll be eating not only did the clay pot rice I also ordered some Steamed Shanghai Dumplings and since its my day off!!! I gotta have me a Tsingtao Beer just to have me some fun on The Chinese New Year Of The Horse 2014!!! And yes if you yelpers have seen my posted pictures of my clay pot rice & steamed shanghai dumplings and also one Tsingtao Beer... I finished it all with my very very hungry appetite!!! Now that it was my very very 1st time being at the Golden Gate Dim Sum Seafood Restaurant... I have to say that the hostess and the waitresses that were working there were all very friendly and helpful on the things... That I have asked for!!!\nSince no one from yelp has posted Clay Pot Rice Pictures... I am the first yelper to post a picture of the Yummy Clay Pot Rice!!! Don't drool on it now LOL!!!", "rating": 4, "date": "2014-02-10"}, {"excerpts": ["* Steamed Shanghai Dumplings ($2.50)\n", "* "], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "vegetable dumplings": [{"excerpts": ["* Vegetable Dumplings ($2.50)\n", "* Steamed Shrimp Dumplings ($2.50)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "steamed sesame dumplings": [], "fried egg custard buns": [], "pan fried pot stickers": [{"excerpts": ["Pan fried pot stickers ($2.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["Pan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\n"], "author": "Kuanie J.", "review": "This place is open on Sunday morning for dim sum!!! There is an error on Yelp and Google that says it is closed today. Anyways....we have wanted to eat here for years and we were not disappointed. 7 plates and $29 later, we left happy :) we tried:\n\nFried chicken wings (you can pass on these)\nPan fried pork with veggie bun (out of this world!!)\nPan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\nThis place is amazing. Come here. Avoid the hour wait at hong kong lounge. Oh, and it is cheap. My Chinese heritage tells me you should never pay more than $5 for dumplings like you do at the ridiculous trendy places...unless you're getting married.", "rating": 5, "date": "2015-06-02"}], "rice noodle rolls": [{"excerpts": ["Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["We got har gow, beef rice noodle rolls, egg yolk buns, spring rolls and Chinese broccoli with oyster sauce to go. ", "The total came up to be around $25 which wasn't bad in SF. ", "The lady who took our order didn't even offer to give me a receipt. ", "And I never got a receipt. \n", "Waited for about 25 minutes for our order and I asked if they had chopsticks for takeouts. ", "Nope, plastic forks only. ", "Okay, no big deal. \n", "So when we finally started eating, I was so disappointed. \n", "According to my friend, the har gow was average and doughy. \n", "The Chinese broccoli was not even cut, I couldn't use the little plastic fork to pick it up and I had to use my hands to eat. ", "They only gave us a tiny container of oyster sauce too, so for the most part this dish tasted flavorless. \n", "My all time favorite beef rice noodle rolls... ", "I could barely taste beef in it. \n", "Egg yolk buns were small but looked nice. ", "However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \n", "Spring rolls looked sad, burned and soggy. ", "They tasted soggy and greasy, too. ", "Should've went to Panda Express for spring rolls instead lol. \n", "Never going back and won't recommend this place to anyone.", "My all time favorite beef rice noodle rolls... ", "I could barely taste beef in it. \n", "Egg yolk buns were small but looked nice. ", "However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \n", "Spring rolls looked sad, burned and soggy. ", "They tasted soggy and greasy, too. ", "Should've went to Panda Express for spring rolls instead lol. \n", "Never going back and won't recommend this place to anyone."], "author": "Jane L.", "review": "I had such a bad experience with this restaurant. We were hungry and didn't have a car at the time so decided to walk down the street to see what restaurants we could find there. Then we saw dim sum and seafood, so dim sum it is. \nI didn't check Yelp until after we placed the order and I really wish I checked before going in. (Poor safety score is an obvious enough sign already... But I was secretly hoping maybe it meant the food would be good lol.) \nWe got har gow, beef rice noodle rolls, egg yolk buns, spring rolls and Chinese broccoli with oyster sauce to go. The total came up to be around $25 which wasn't bad in SF. The lady who took our order didn't even offer to give me a receipt. And I never got a receipt. \nWaited for about 25 minutes for our order and I asked if they had chopsticks for takeouts. Nope, plastic forks only. Okay, no big deal. \nSo when we finally started eating, I was so disappointed. \nAccording to my friend, the har gow was average and doughy. \nThe Chinese broccoli was not even cut, I couldn't use the little plastic fork to pick it up and I had to use my hands to eat. They only gave us a tiny container of oyster sauce too, so for the most part this dish tasted flavorless. \nMy all time favorite beef rice noodle rolls... I could barely taste beef in it. \nEgg yolk buns were small but looked nice. However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \nSpring rolls looked sad, burned and soggy. They tasted soggy and greasy, too. Should've went to Panda Express for spring rolls instead lol. \nNever going back and won't recommend this place to anyone.", "rating": 1, "date": "2016-07-05"}, {"excerpts": ["* Beef Rice Noodle Rolls ($3)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}, {"excerpts": ["Yay dishes: har gow, rice noodle rolls, fried glutinous balls with meat inside (Xián shu jio)\n\n"], "author": "Jen L.", "review": "I am reeeeally excited to yelp about this place! I was DONE waiting hours at Hong Kong Lounge and decided to find another dim sum place. I did a yelp for \"dim sum\" and found this joint. I walked around the corner and BAM I was here with NO WAIT! This place was 3 stars but I decided to try anyway. \n\nThis restaurant has a pleasant decor with a pretty garden in the back (if you look closely there's mops on the side, lol). The food was also decent (average to good dim sum), somethings were oookay but others definitely made me want to come back. \n\nYay dishes: har gow, rice noodle rolls, fried glutinous balls with meat inside (Xián shu jio)\n\nEhh dishes: sui mai, custard buns (these were funky, it's as tho the center had salty eggs instead of egg custards), shanghai dumplings\n\nThis place is definitely a place people should try. It's cheap and decently priced and best of all... NO WAIT!! The people were nice and service was fast! This place gets four star overall!!", "rating": 4, "date": "2011-08-30"}, {"excerpts": ["My faves were the stuffed eggplant w/shrimp and the shrimp rice noodle rolls...", "i was stuffed and there was so much left order ", "and it's cheap!! "], "author": "Ray R.", "review": "i came here  with some old coworkers, new coworkers, and new friends for lunch today.  I liked that even though it was on Clement it wasnt as crowded and there was actually parking in front of the place.  \n\nwe got in and were seated right away.  like most dim sum places we got a list that had $2/$2.50/$3 plates.  Nancy did all the ordering and Tu added some...when they said they were gonna order alot, they weren't kidding.\n\nI tried everything from what must've been at least 30 plates.  My faves were the stuffed eggplant w/shrimp and the shrimp rice noodle rolls...i was stuffed and there was so much left order and it's cheap!! definitely gotta come back here!!\n\ni heard that on the weekdays all dim sum is $2!!", "rating": 5, "date": "2010-09-10"}, {"excerpts": ["plus a few other things that one or more at the table liked (a tureen of village congee, stuffed rice noodle rolls, and shrimp stuffed eggplant, included at our table.) \n\n"], "author": "Weisun C.", "review": "The cousins we were visiting decided that it would be too long of a wait on a Saturday to go to the dim sum place originally planned in this same neighborhood. We mentioned that two nights earlier we had a very nice dinner here and saw that they had a dim sum service. So we reserved two tables here for the \"clan.\" Each table ordered their own selections without consultation across the tables. So we each wound up with pretty much what Yelper Teri C. ordered (below) plus a few other things that one or more at the table liked (a tureen of village congee, stuffed rice noodle rolls, and shrimp stuffed eggplant, included at our table.) \n\nAlso, the dim sum menu is printed in English, so I don't understand one Yelper's problem with not reading Chinese. As other Yelpers have mentioned, the bill was pretty thrifty for a group this large. And the best thing was we all enjoyed what was served (everything was fresh and well-made), leaving almost nothing to take home. Luckily there was a healthy walk following all of this consumption!", "rating": 4, "date": "2010-02-23"}, {"excerpts": ["We sat in the back, sunny room and enjoyed stuffed eggplant, steamed shrimp dumplings, turnip cakes, rice noodle rolls, steamed pork buns - and the prices are soooo cheap!"], "author": "Veronica L.", "review": "Excellent, fresh dim sum. Service was prompt and attentive. As others have stated, the decor is outdated, but don't let that keep you away. We sat in the back, sunny room and enjoyed stuffed eggplant, steamed shrimp dumplings, turnip cakes, rice noodle rolls, steamed pork buns - and the prices are soooo cheap!", "rating": 4, "date": "2012-04-29"}, {"excerpts": ["We got the beef meatballs, shrimp and beef rice noodle rolls, shrimp dumpling, sui mai, deep fried bitter melon mochi, and stuffed eggplant. ", "Everything was good except the stuffed eggplant as it was very oily and not fully cooked. ", "They also forgot our order so tats y ", "i deducted 1/2 a point. ", "reguardless, I think this might be the new dim sum place of choice. ", "Free tea also. ", "On the weekends, all dishes are 2.25 and $1 tea charge per person but still a good deal."], "author": "Robert Y.", "review": "4.5\nthis review is for the dim sum only \nheres is my review for dinner http://www.yelp.com/biz/golden-gate-dim-sum-seafood-restaurant-san-francisco#hrid:mHfPM4j6oT_3K4nCNpV-ag\n\nmonday through friday all dim sum small, medium, and large are $2 each. We got the beef meatballs, shrimp and beef rice noodle rolls, shrimp dumpling, sui mai, deep fried bitter melon mochi, and stuffed eggplant. Everything was good except the stuffed eggplant as it was very oily and not fully cooked. They also forgot our order so tats y i deducted 1/2 a point. reguardless, I think this might be the new dim sum place of choice. Free tea also. On the weekends, all dishes are 2.25 and $1 tea charge per person but still a good deal.", "rating": 5, "date": "2011-06-13"}], "rice noodle with chives and mushroom": [], "steamed stuffed tofu skin rolls": [{"excerpts": ["Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "shrimp dumpling": [{"excerpts": ["Clam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["* Fried Shrimp Dumpling: ", "A little greasy. ", "But otherwise standard.\n", "* Steamed Spareribs: I've had better. ", "But it cured my craving.\n", "* Sticky Rice in Lotus Leaf (NOT PICTURED): ", "Lots of filling. ", "Served hot.\n", "* Steamed Tofu Roll (NOT PICTURED): ", "Kept falling apart. ", "Not too much flavor.\n", "* Fried Sesame Ball  (NOT PICTURED): ", "Good but a little softer than I'm used to. ", "A little greasy as well.\n", "* Fried Shrimp Roll (NOT PICTURED): ", "Ehh. ", "Greasy. ", "Slightly burnt.\n", "* Foil Wrapped Chicken: ", "I guess I'm not a big fan of five-spice. "], "author": "Ralph N.", "review": "My family and I came here during a holiday in search for some dim sum. Initially, we were heading towards Hong Kong Lounge but after seeing the line, we decided to go elsewhere. And that's how we were brought here. I actually just found this place by mistake. \n\nI was lured in by the shorter line & pricing. We waited a few minutes to be seated. I was so surprised to see that the dishes were so cheap! From $2.50-$3.25!!! Specialty dishes were priced at $5.50...but not bad.\n\nThe restaurant was packed! So I was assuming it was good. So we marked on the little paper provided ehat we wanted and gave it to the waitress. \n\nService:\n\nIt's really not the best. They sorta ignore you and have to wave them down for something. I had to ask 3 times for my water to come. The guy was pretty attentive though when clearing our dishes. But we waited 20-25mins for our food to come out. Idk if it was because it was a holiday?\n\nFood:\n\n* Siumai: Standard. A little smaller than usual but served hot. Also it was pretty moist. \n* Har Gow: Good size. The skin was a little sticky but othereise delicious. \n* Chicken Feet (NOT PICTURED): Was tender yet had an overpowering anise flavor. But not bad for the price.\n* Shrimp and Chive: Delicious filling but the wrapper was also sticky. We finished it though.\n* Fried Shrimp Dumpling: A little greasy. But otherwise standard.\n* Steamed Spareribs: I've had better. But it cured my craving.\n* Sticky Rice in Lotus Leaf (NOT PICTURED): Lots of filling. Served hot.\n* Steamed Tofu Roll (NOT PICTURED): Kept falling apart. Not too much flavor.\n* Fried Sesame Ball  (NOT PICTURED): Good but a little softer than I'm used to. A little greasy as well.\n* Fried Shrimp Roll (NOT PICTURED): Ehh. Greasy. Slightly burnt.\n* Foil Wrapped Chicken: I guess I'm not a big fan of five-spice. The chicken was moist though.\n\nOverall I would come back if I was in the area and Hong Kong Lounge had a long line again. Not the best dim sum in the world but it also depends on what you order. I loved how the dishes were always served hot. Not bad for a quick fix. Pretty cheap too. All of the dishes ee ordered rounded up to $39.", "rating": 3, "date": "2014-12-25"}, {"excerpts": ["Pan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\n"], "author": "Kuanie J.", "review": "This place is open on Sunday morning for dim sum!!! There is an error on Yelp and Google that says it is closed today. Anyways....we have wanted to eat here for years and we were not disappointed. 7 plates and $29 later, we left happy :) we tried:\n\nFried chicken wings (you can pass on these)\nPan fried pork with veggie bun (out of this world!!)\nPan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\nThis place is amazing. Come here. Avoid the hour wait at hong kong lounge. Oh, and it is cheap. My Chinese heritage tells me you should never pay more than $5 for dumplings like you do at the ridiculous trendy places...unless you're getting married.", "rating": 5, "date": "2015-06-02"}, {"excerpts": ["There was a baby cockroach in my shrimp dumpling. ", "They apologized and we left. ", "Don't eat here. ", "If you do decide to eat here anyways, bring an enemy with you so they can be sick as well."], "author": "Cliff D.", "review": "There was a baby cockroach in my shrimp dumpling. They apologized and we left. Don't eat here. If you do decide to eat here anyways, bring an enemy with you so they can be sick as well.", "rating": 1, "date": "2015-12-25"}, {"excerpts": ["We got 11 plates for 3 people:\n\nfried shrimp ball - excellent and yummytastic\ntofu skin meat wrap - excellent\nfish rice noodle - good, but where's the fish :0\nbeef rice noodles - good\npork rice noodles - good\npork spareribs - good\nshrimp dumpling - good filling, but skin was too sticky\nvegatrian dumpling - pass - "], "author": "Peter L.", "review": "Smaller, outdated decor Dim Sum place. Nothing that will make you say OMFG awesome, but also a place that won't kill your wallet.\n\nSmall, Medium and Large Dim Sum are $2 on weekdays and $2.25 on weekends - wowzer!\n\nPrice - 5 Stars\nFood quality/taste 3 stars\nService - 4 Stars\n\nWe got 11 plates for 3 people:\n\nfried shrimp ball - excellent and yummytastic\ntofu skin meat wrap - excellent\nfish rice noodle - good, but where's the fish :0\nbeef rice noodles - good\npork rice noodles - good\npork spareribs - good\nshrimp dumpling - good filling, but skin was too sticky\nvegatrian dumpling - pass - I need meat :P\nfried egg custard bun - yummy\nlotus sticky rice - excellent\nfried salt/pepper chicken wings - ok, but crispy enough", "rating": 4, "date": "2012-03-06"}, {"excerpts": ["Tip 2: They have 3 different types of Shrimp dumpling.  ", "* Didn't get a chance to try their House Steamed Shrimp Dumpling"], "author": "B F.", "review": "Here's another cool weekday-cheap dim sum joint.  The place is a lot bigger than it looks as they have a nice room in the back.  The service was pretty good too.  A minor annoyance eating there was the strong smell of incense permeating the whole restaurant....made me feel kinda nauseous and morbid like I was eating at a funeral.  Plenty of old folks eat here too which is a good thing since old folks know their dim sum. =)\n\nTip 1: They sell their $2, $2.50, and $3 plates at $1.90 on weekdays.\n\nTip 2: They have 3 different types of Shrimp dumpling.  The one that is the most common for dim sum is called House Steamed Shrimp Dumplings on their menu.\n\nTip 3: They have plenty on non-translated items on their menu and whiteboard so you'll need to ask or bring someone that knows how to read Chinese.\n\nMy Dim Sum Rating System:\nFried Egg Custard Buns=3\nPan Fried Pot Stickers=3\nRice noodle roll w/ beef=5\nRice noodle roll w/ shrimp=5\nShrimp Dumpling=4 *\nSteamed Beef Balls=3\nSteamed Chicken Feet=4\nSteamed Shanghai Dumplings=2\nTurnip Cake Fired w/ XO Sauce=5\n\n* Didn't get a chance to try their House Steamed Shrimp Dumpling", "rating": 4, "date": "2010-08-02"}, {"excerpts": ["We got the beef meatballs, shrimp and beef rice noodle rolls, shrimp dumpling, sui mai, deep fried bitter melon mochi, and stuffed eggplant. ", "Everything was good except the stuffed eggplant as it was very oily and not fully cooked. ", "They also forgot our order so tats y ", "i deducted 1/2 a point. ", "reguardless, I think this might be the new dim sum place of choice. ", "Free tea also. ", "On the weekends, all dishes are 2.25 and $1 tea charge per person but still a good deal."], "author": "Robert Y.", "review": "4.5\nthis review is for the dim sum only \nheres is my review for dinner http://www.yelp.com/biz/golden-gate-dim-sum-seafood-restaurant-san-francisco#hrid:mHfPM4j6oT_3K4nCNpV-ag\n\nmonday through friday all dim sum small, medium, and large are $2 each. We got the beef meatballs, shrimp and beef rice noodle rolls, shrimp dumpling, sui mai, deep fried bitter melon mochi, and stuffed eggplant. Everything was good except the stuffed eggplant as it was very oily and not fully cooked. They also forgot our order so tats y i deducted 1/2 a point. reguardless, I think this might be the new dim sum place of choice. Free tea also. On the weekends, all dishes are 2.25 and $1 tea charge per person but still a good deal.", "rating": 5, "date": "2011-06-13"}, {"excerpts": ["We had the shrimp dumpling soup.  ", "The dumplings were actually pretty tasty and we speculated that they were left over from dim sum, but the broth was so watered down as to be tasteless (I hate when they destroy something good to be cheap)  ", "They screwed up my order and did nothing about it, even after we pointed it out.  ", "Their attitude seemed to be you ordered 3 items on the menu and you got three item, what's the problem?  ", "The service was not good.  ", "They have several servers there and they either clustered around a table or disappered, from the room entirely.  ", "Given the economy, I want to support the local guys, but I will not come back, there are too many other restaurants in this neighborhood."], "author": "L C.", "review": "I went here for dinner last night and was very unimpressed.  We had the shrimp dumpling soup.  The dumplings were actually pretty tasty and we speculated that they were left over from dim sum, but the broth was so watered down as to be tasteless (I hate when they destroy something good to be cheap)  They screwed up my order and did nothing about it, even after we pointed it out.  Their attitude seemed to be you ordered 3 items on the menu and you got three item, what's the problem?  The service was not good.  They have several servers there and they either clustered around a table or disappered, from the room entirely.  Given the economy, I want to support the local guys, but I will not come back, there are too many other restaurants in this neighborhood.", "rating": 2, "date": "2009-01-18"}], "steamed meat stuffed tofu": [], "steamed egg yolk bun": [], "panfried pork with veggie bun": [], "steamed taro dumplings": [], "rice noodle roll with fish": [], "shrimp rice noodle rolls": [{"excerpts": ["Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n", "Steamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["My faves were the stuffed eggplant w/shrimp and the shrimp rice noodle rolls...", "i was stuffed and there was so much left order ", "and it's cheap!! "], "author": "Ray R.", "review": "i came here  with some old coworkers, new coworkers, and new friends for lunch today.  I liked that even though it was on Clement it wasnt as crowded and there was actually parking in front of the place.  \n\nwe got in and were seated right away.  like most dim sum places we got a list that had $2/$2.50/$3 plates.  Nancy did all the ordering and Tu added some...when they said they were gonna order alot, they weren't kidding.\n\nI tried everything from what must've been at least 30 plates.  My faves were the stuffed eggplant w/shrimp and the shrimp rice noodle rolls...i was stuffed and there was so much left order and it's cheap!! definitely gotta come back here!!\n\ni heard that on the weekdays all dim sum is $2!!", "rating": 5, "date": "2010-09-10"}], "beef rice noodle rolls": [{"excerpts": ["We got har gow, beef rice noodle rolls, egg yolk buns, spring rolls and Chinese broccoli with oyster sauce to go. ", "The total came up to be around $25 which wasn't bad in SF. ", "The lady who took our order didn't even offer to give me a receipt. ", "And I never got a receipt. \n", "Waited for about 25 minutes for our order and I asked if they had chopsticks for takeouts. ", "Nope, plastic forks only. ", "Okay, no big deal. \n", "So when we finally started eating, I was so disappointed. \n", "According to my friend, the har gow was average and doughy. \n", "The Chinese broccoli was not even cut, I couldn't use the little plastic fork to pick it up and I had to use my hands to eat. ", "They only gave us a tiny container of oyster sauce too, so for the most part this dish tasted flavorless. \n", "My all time favorite beef rice noodle rolls... ", "I could barely taste beef in it. \n", "Egg yolk buns were small but looked nice. ", "However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \n", "Spring rolls looked sad, burned and soggy. ", "They tasted soggy and greasy, too. ", "Should've went to Panda Express for spring rolls instead lol. \n", "Never going back and won't recommend this place to anyone.", "My all time favorite beef rice noodle rolls... ", "I could barely taste beef in it. \n", "Egg yolk buns were small but looked nice. ", "However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \n", "Spring rolls looked sad, burned and soggy. ", "They tasted soggy and greasy, too. ", "Should've went to Panda Express for spring rolls instead lol. \n", "Never going back and won't recommend this place to anyone."], "author": "Jane L.", "review": "I had such a bad experience with this restaurant. We were hungry and didn't have a car at the time so decided to walk down the street to see what restaurants we could find there. Then we saw dim sum and seafood, so dim sum it is. \nI didn't check Yelp until after we placed the order and I really wish I checked before going in. (Poor safety score is an obvious enough sign already... But I was secretly hoping maybe it meant the food would be good lol.) \nWe got har gow, beef rice noodle rolls, egg yolk buns, spring rolls and Chinese broccoli with oyster sauce to go. The total came up to be around $25 which wasn't bad in SF. The lady who took our order didn't even offer to give me a receipt. And I never got a receipt. \nWaited for about 25 minutes for our order and I asked if they had chopsticks for takeouts. Nope, plastic forks only. Okay, no big deal. \nSo when we finally started eating, I was so disappointed. \nAccording to my friend, the har gow was average and doughy. \nThe Chinese broccoli was not even cut, I couldn't use the little plastic fork to pick it up and I had to use my hands to eat. They only gave us a tiny container of oyster sauce too, so for the most part this dish tasted flavorless. \nMy all time favorite beef rice noodle rolls... I could barely taste beef in it. \nEgg yolk buns were small but looked nice. However when I took a bite, I just saw oil coming out from the bun and the whole thing just tasted like fat. \nSpring rolls looked sad, burned and soggy. They tasted soggy and greasy, too. Should've went to Panda Express for spring rolls instead lol. \nNever going back and won't recommend this place to anyone.", "rating": 1, "date": "2016-07-05"}, {"excerpts": ["* Beef Rice Noodle Rolls ($3)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}, {"excerpts": ["We got the beef meatballs, shrimp and beef rice noodle rolls, shrimp dumpling, sui mai, deep fried bitter melon mochi, and stuffed eggplant. ", "Everything was good except the stuffed eggplant as it was very oily and not fully cooked. ", "They also forgot our order so tats y ", "i deducted 1/2 a point. ", "reguardless, I think this might be the new dim sum place of choice. ", "Free tea also. ", "On the weekends, all dishes are 2.25 and $1 tea charge per person but still a good deal."], "author": "Robert Y.", "review": "4.5\nthis review is for the dim sum only \nheres is my review for dinner http://www.yelp.com/biz/golden-gate-dim-sum-seafood-restaurant-san-francisco#hrid:mHfPM4j6oT_3K4nCNpV-ag\n\nmonday through friday all dim sum small, medium, and large are $2 each. We got the beef meatballs, shrimp and beef rice noodle rolls, shrimp dumpling, sui mai, deep fried bitter melon mochi, and stuffed eggplant. Everything was good except the stuffed eggplant as it was very oily and not fully cooked. They also forgot our order so tats y i deducted 1/2 a point. reguardless, I think this might be the new dim sum place of choice. Free tea also. On the weekends, all dishes are 2.25 and $1 tea charge per person but still a good deal.", "rating": 5, "date": "2011-06-13"}], "bbq rice noodle rolls": [], "stuffed eggplant with shrimp": [{"excerpts": [", we ordered the turnip cake \"fired\" in xo sauce based on all the rave yelp reviews (meh,  kinda flavorless - don't understand the hype), rice noodle with shrimp (decent), stuffed eggplant with shrimp (decent, but again lacking flavor), deep fried sesame balls (a bit thick and hard and not the fried, sweet deliciousness that one would expect), shark fin dumpling (i protested, "], "author": "shannon j.", "review": "sadly disappointing!  met my parents here for saturday morning dim sum at the recommendation of a couple of relatives who usually are in the know about great cheap eats.\n\nto start, arrived at 10am to an empty dining room, raising a mild suspicion.  sat down and immediately noticed the white table cloth under our paper place mats was soiled with probably spilled tea and soy in multiple locations, more concern considering we were probably the first to be seated there that morning.  am not so squeamish to be put off so easily, however, ewwwww factor set in when i picked up my chopsticks and they were grey and gummy.  tried to clean them off with hot tea to no avail, so forced to grab another pair from a neighboring table to find a not quite as dirty pair, but still sticky :(\n\nas for the food, we ordered the turnip cake \"fired\" in xo sauce based on all the rave yelp reviews (meh,  kinda flavorless - don't understand the hype), rice noodle with shrimp (decent), stuffed eggplant with shrimp (decent, but again lacking flavor), deep fried sesame balls (a bit thick and hard and not the fried, sweet deliciousness that one would expect), shark fin dumpling (i protested, but my mother ordered claiming that  \"it's not real shark fin anyway\" - either way a little frightening - was actually impressed by the portion and presentation of this dish in a baby soup bowl), tofu skin rolls (saved the best for last  - actually enjoyed this dish, very tasty!)\n\nthe bill came to $22 - cheap eats indeed!  ok if you are into mediocre.", "rating": 1, "date": "2010-10-12"}], "stuffed green pepper with shrimp": [], "fried shrimp puffs": [], "shrimp balls": [], "pan fried shrimp puffs": [], "foil paper wrapped chicken": [], "mushroom tofu skin rolls": [{"excerpts": ["* Mushroom Tofu Skin Rolls ($3)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "sticky rice with lotus leaf": [{"excerpts": ["Sticky rice with lotus leaf ($3)\n", "Sticky rice with lotus leaf ($3)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  "], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "pan fried chives dumplings": [{"excerpts": ["Pan Fried Chives Dumplings ($3)\n"], "author": "Teri C.", "review": "My whole life I grew up on dim sum.  We headed to Chinatown every week and ate at one of those huge tea houses way back when.  They used to count the plates at the end of our meal before the whole stamp system came along.  Carts were the norm.  \n\nThese days, tiny restaurants can also service those looking for dim sum without all the fuss.  As a result, there are no carts being pushed and instead, you have a menu that you pencil in how many of each item you want.  (Good for those who know their dim sum, bad for newbies.)  \n\nWhat makes Golden Gate Dim Sum a great steal?  Their Monday through Friday (10:30 am to 3:00 pm) dim sum prices at $1.90/plate.  These account for their small, medium, and large plates.  My retired parents know all about these places and frequent them quite a bit.  Word gets around at the senior centers.  They know they want to be seated downstairs, and they have to ask that all the food not come out at once.  (Yes, a bit too over efficient in this case.)\n\nOur party of three: \n\n* Steamed Pork Dumplings ($2)\n* Deep Fried Stuffed Dumplings ($2)\n* Steamed Beef Balls ($2)\n* Pan Fried Turnip Cake ($2)\n* Steamed Chicken Feet ($2)\n* Vegetable Dumplings ($2.50)\n* Steamed Shrimp Dumplings ($2.50)\n* Steamed Shanghai Dumplings ($2.50)\n* Pan Fried Chives Dumplings ($3)\n* Mushroom Tofu Skin Rolls ($3)\n* Beef Rice Noodle Rolls ($3)\n* Sticky Rice with Lotus Leaf ($3)\n\nNothing that really stood out as far as I recall.  It's dim sum, and it's cheap.  Service is standard, nothing special here.  It works when you're hungry on a weekday.  As least you know the food will come out quickly!", "rating": 3, "date": "2009-08-20"}], "deep fried shrimp rolls": [], "sesame pumpkin cake": [], "beef ribs with back pepper": [], "steamed beef belly in spicy sauce": [], "pork tripe in pepper sauce": [], "rice noodle with fried shrimp and bean curd": [], "crude drugs chicken feet": [], "crispy fried prawns": [], "crispy fried squids": [], "walnut prawns": [{"excerpts": ["Honey Walnut Prawns (tasted good, yet standard...you can get $5.00 same quality at this chinese restaurant on union) \n", "Duck (mmm, so succulent, really good, duck is always fantastic)\n", "Sauteed Tofu with black mushroom (for you filipinas, ", "the tofu tasted like TAHO! not a good thing this was probably the worst tofu dish I've ever had. ", "I was so frustrated ", "because tofu dishes never disappoint ever, how do you fcuk up tofu!??! ", "The sauce was bland and if you closed your eyes you wouldn't be able to tell if you were eating mushroom or tofu, maybe the black mushroom was made out of tofu.) \n"], "author": "Olivia Vanessa R.", "review": "It's seldom for me to give one or two stars and I apologize but Yelp is for educating the public of the finer things S.F. has to offer right? \n\nBefore I get into full detail about the food I want to talk about the Customer SERVICE, because it can make the difference between a phenomenal meal or a mediocre one and overall--- affects the experience, I mean, you can't enjoy the meal if you're pissed off over things that should be standard practices.\n\nOk, so my friend and I walk in and it looks pretty snazzy, so we figure we have to wait to be seated. I guess not because we were ignored for ten minutes (I even got to get into a long discussion about anatomy) while sitting on the chairs for waiting and then they made us feel stupid and made a gesture and face that indicated we were stupid for not knowing we just go in and sit. I realize it was a mistake on my end but they could have handled it better because there's a fucking sign that says WAIT TO BE SEATED. Secondly, I don't know what we did to piss the waiters off but they were rude right off the bat. When giving us our food the waiter simply and literally just propped the plates on the table almost in an aggressive manner (the plates made a loud clank when he just dropped the food and utensils on the glass surface) looking flustered walking away angrily. I felt so hurt! haha, We wait a while, then 2 big groups of people came in. Our waiter was so nice to the chinese group that walked in, definitely looked happier than with us and was clearly giving them way nicer treatment, I guess just because they can speak chinese or something like that, a cultural habit that's inevitable I guess. The other table was a bunch of kids that looked like Lowell High students looking for a bite to eat after studying for hours on end. I turn around and even though our waiter took good care of the chinese group next to us the hs kid group remained unattended. I heard them complaining saying how ridiculous the wait to order was. (On a very UNIMPORTANT, DON'T EVEN BOTHER READING side note, f*** that group of HS elite overachievers, they were mocking my pre med books and saying shit like \"ohhhh big deal anyone can learn anatomy\"SMHSMHSMH) \n\nThe food is the only reason I didn't give them just one star. We had:\n\nHoney Walnut Prawns (tasted good, yet standard...you can get $5.00 same quality at this chinese restaurant on union) \nDuck (mmm, so succulent, really good, duck is always fantastic)\nSauteed Tofu with black mushroom (for you filipinas, the tofu tasted like TAHO! not a good thing this was probably the worst tofu dish I've ever had. I was so frustrated because tofu dishes never disappoint ever, how do you fcuk up tofu!??! The sauce was bland and if you closed your eyes you wouldn't be able to tell if you were eating mushroom or tofu, maybe the black mushroom was made out of tofu.) \nThai Ice Tea (tasted like chocolate [: ) \n\nI guess I liked that the menu was 5 pages of everything you could ever want at a chinese restaurant, it took like 10 minutes looking at everything trying to decide because it all looked so good, the descriptions and pictures did anyway, definitely doesn't apply to the actual piping hot plate you get :p\n\n$40.00 for two people and three items and rice. WHAAAATAHELL, AND IT WASN'T EVEN GOOD. Everything we had could have been a $20.00 meal at an EVEN BETTER neighboring chinese restaurant I imagine, I mean S.F. is adorned with them, in fact I bet I would have, no wait, I HAVE HAD better at the $1 an item Chinese restaurant on 24th and mission. I shit you not. \n\n\n\n\n\n\n\n\n\niloveTO F U ;)  i love tofu :B in fact I'd like to fu right about now lOL k I'm done hopefully that helps xoxoxoxoox\n\np.s. parking isn't that bad :)", "rating": 2, "date": "2011-03-18"}, {"excerpts": ["ok; all meats PASS\n2) walnut prawns: decent\n3) \"shark's fin\" soup: so bland", ", i didn't know thick brown soup could taste like water (kinda impressive when you think about it)\n", "4) bbs clams: not bad, except that i swear there was more onions and bell peppers than clams\n5) ", "salt n pepper ", "kal bi: my favorite dish of the night (which isn't saying all that much) ", "but i liked the fact that it was kal bi instead of pork chops or spareribs\n6) ", "gai choy ", "w/mushrooms: pretty standard\n7) chicken w/ginger and scallions: we think it might have been free range chicken. . .not ", "sure tho.\n", "8) crab: ", "standard/what you would expect\n9) steamed \"fresh\" fish: i've definitely tasted fresher, slightly overcooked.\n", "10) long life noodles: tasted like they were treated w/soap\n11) mango pudding: too put off by 10 to try it.\n", "12) like kim c, birthday cake for my great-grandma's 92nd bday was the best thing on the menu but it was from copenhagen bakery -- ", "it was delicious ", "(check out the bakery)."], "author": "erika n.", "review": "my parents decided to try this place for dinner based on their relatively good dim sum experience.  bad call, mom and dad.  altho i will say this, they do give you quite a bit of food.  we were the only table in this establishment from 7 to 830pm.  bad: obvious.  good: they changed our plates more than 3 times for lack of anything better to do.\n\n$168 for:\n1) jellyfish/meat platter: jellyfish = ok; all meats PASS\n2) walnut prawns: decent\n3) \"shark's fin\" soup: so bland, i didn't know thick brown soup could taste like water (kinda impressive when you think about it)\n4) bbs clams: not bad, except that i swear there was more onions and bell peppers than clams\n5) salt n pepper kal bi: my favorite dish of the night (which isn't saying all that much) but i liked the fact that it was kal bi instead of pork chops or spareribs\n6) gai choy w/mushrooms: pretty standard\n7) chicken w/ginger and scallions: we think it might have been free range chicken. . .not sure tho.\n8) crab: standard/what you would expect\n9) steamed \"fresh\" fish: i've definitely tasted fresher, slightly overcooked.\n10) long life noodles: tasted like they were treated w/soap\n11) mango pudding: too put off by 10 to try it.\n12) like kim c, birthday cake for my great-grandma's 92nd bday was the best thing on the menu but it was from copenhagen bakery -- it was delicious (check out the bakery).", "rating": 2, "date": "2008-08-27"}], "steamed oysters with black bean sauce": [], "clam with black bean sauce": [{"excerpts": ["Clam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "steamed clams in black bean sauce": [], "spicy jellyfish": [], "season vegetable in oyster sauce": [], "pan fried rice roll in xo sauce": [], "delicious beef shank": [], "stuff crab claws with shrimp": [{"excerpts": ["Pan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\n"], "author": "Kuanie J.", "review": "This place is open on Sunday morning for dim sum!!! There is an error on Yelp and Google that says it is closed today. Anyways....we have wanted to eat here for years and we were not disappointed. 7 plates and $29 later, we left happy :) we tried:\n\nFried chicken wings (you can pass on these)\nPan fried pork with veggie bun (out of this world!!)\nPan fries chives dumpling\nSteamed shrimp dumpling (this was ok)\nPan fried pot stickers (amazing)\nSteamed BBQ pork buns (delish)\nStuff crab claws with shrimp\n\nThis place is amazing. Come here. Avoid the hour wait at hong kong lounge. Oh, and it is cheap. My Chinese heritage tells me you should never pay more than $5 for dumplings like you do at the ridiculous trendy places...unless you're getting married.", "rating": 5, "date": "2015-06-02"}], "stirfried pigs blood with chives": [], "scalded gooses intestine": [], "salted pepper beef ribs": [], "fish cake with garlic": [], "pork tripe": [], "fried pumpkin and salt egg yolk": [], "beef tripe with turnip": [{"excerpts": ["Beef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "steamed beef tripe": [{"excerpts": ["Steamed beef tripe ($4.50)\n", "Steamed beef tripe ($4.50)\n"], "author": "Elena N.", "review": "Sometimes on the weekends, I crave dim sum but I'm too lazy to go out and wait for a table. In comes Golden gate dim sum seafood restaurant to the rescue. Dim sum delivery at reasonable prices! Some restaurants deliver dim sum, but at much higher prices, so you can't order everything you want. At Golden gate, you can! I typically order from their website. Previous orders have included:\n\nFebruary 2013:\nEgg rolls ($2)\nSteamed beef balls ($2)\nTaro cake with chinese sausage ($2)\nDeep fried stuffed dumplings ($2)\nSteamed chicken feet ($2)\nSteamed pork dumplings ($2)\nSteamed pork spareribs ($2)\nSteamed house dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed pea sprout dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nBeef tripe with turnip ($4.50)\n\nDecember 2012:\nPan fried turnip cake ($2)\nSteamed pork dumplings ($2)\nSteamed egg custard bun ($2)\nSteamed bbq pork bun ($2)\nSteamed beef balls ($2)\nPan fried pot stickers ($2.50)\nSteamed Shanghai dumplings ($2.50)\nHouse steamed shrimp dumplings ($2.50)\nSteamed scallops dumplings ($2.50)\nSteamed stuffed tofu skin rolls ($2.50)\nShrimp rice noodle rolls ($3)\nSticky rice with lotus leaf ($3)\nSteamed beef tripe ($4.50)\nClam with black bean sauce ($4.50)\nShrimp dumpling soup ($4.50)\nFREE Chicken chow mein\n\nTheir dim sum is pretty average. The staple dishes such as the har gow, shu mai, chicken feet, spareribs, noodle rolls, sticky rice in lotus leaf, etc are good enough to satisfy my dim sum craving when I'm too lazy to go out. And for the prices, I can still order all the dishes I want! 3 stars for the food, but bumping it up to 4 stars since they deliver!", "rating": 4, "date": "2014-06-20"}], "salt and pepper shrimps": [], "mixed pork in rice noodle": [], "duck tongue in special sauce": [], "turnip cake fired with xo sauce": [], "green bean with xo sauce": [], "salt and pepper squid silk": []}