{"vegetarian egg roll": [], "vegetarian pot stickers": [], "pork pot stickers": [], "deep fried tofu": [], "house special egg roll": [], "bbq pork appetizer": [{"excerpts": ["BBQ Pork appetizer is covered in sesame seeds, and is not as \"roasty\" as I wish it could have been."], "author": "Kat M.", "review": "Well, just don't order from the internet.  Call them.  I think because they now have my address in the system, it's easier for them to find my place.  My food took less than 20 minutes to arrive.  Piping hot, and could feed an army.  BBQ Pork appetizer is covered in sesame seeds, and is not as \"roasty\" as I wish it could have been.", "rating": 4, "date": "2009-07-22"}], "combination plate for": [], "mango prawn salad": [], "fried wonton with pork": [], "house seaweed salad": [], "wonton with red chili oil": [{"excerpts": ["We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. ", "We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. ", "There was a punch but no kick. ", "The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. ", "When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. ", "It was actually really tasty and every spoonful was a surprise. ", "The four of us enjoyed our meal and it was just about the right amount for us. ", "We had two big eaters and two moderate eaters. ", "The quick delivery and ease of ordering online was a plus. ", "Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice."], "author": "Jen L.", "review": "I used EAT24 for the first time the other day and had Golden Kim Tar deliver to us in the SOMA. The food arrived on time and piping hot! We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. There was a punch but no kick. The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. It was actually really tasty and every spoonful was a surprise. The four of us enjoyed our meal and it was just about the right amount for us. We had two big eaters and two moderate eaters. The quick delivery and ease of ordering online was a plus. Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice.", "rating": 4, "date": "2016-04-13"}], "chinese garlic fries": [], "edamame in pod": [], "hot and sour soup with chicken": [], "hot and sour soup with pork": [], "hot and sour soup with beef": [], "hot and sour soup with vegetables": [], "combination war won ton soup": [], "assorted vegetable soup": [], "tofu sweet corn soup": [{"excerpts": ["Tofu Sweet Corn Soup -- "], "author": "Max X.", "review": "After moving here from living abroad, various places int he U.S.  and whatever...blah blah, I am really disappointed with the food quality here in SF. So, before I write my review, let me explain this so that hopefully my review will help you make an informed decision on wither you want to order from this place, and ultimately anyplace in SF.\n\nOne of the big reasons why I moved back here is that there are tons of restaurants of pretty much anything you could ever want, in pretty close proximity. That is great, but the problem is that it seems like 85% are all kind of blah, the same thing, and not standing out for flavor profiles. Example: I've had 15 different bin mah sandwich's at 15 different places and non of them come close to the one's in Miami from one place (Miss Saigon), same thing with Fried Rice (either Chinese or Japanese) competitive with Denver and Miami (Go To Sushi -Miami- has the best Japanese fried rice that I have had outside of of the Kyoto tower and Osaka). This city is supposed to be Asian food heaven, but so far it has been a constant let down. Kinda like this place.\n\nThe good: \n1. They deliver, and they do it till late night with a minimum of $$$ for your order, and pretty quick (ours came in 35min), yay!\n2. Proportions are pretty big, yay!, you'll be eating it for a couple of days.\n3. Best overall pictures (taken by a person who works there and knows what they are doing..no stupid Instagram camera photo there) so you know what your ordering and what it will look like. \n\nThe bad:\n1. Everything is just.....bland, some people are writing that stuff here is yummy, but honestly, I have no idea what they are thinking. Have they been just eating non-big-favor food, were their parents horrible cooks? And, is just eating food is a joyous occasion because everything else in their lives tasted like cold oatmeal, without the flavor packets? Do they want the attention, of blathering on and on just to hear themselves talk (see what I did there...that's irony) I have no idea, but here is what we ordered, and why I was let down (so far have not found ANY Chinese places that are any better for delivery for when I'm particularly lazy):\n\nThai Ice Tea -- not very sweet (5/10), bitter, not enough condensed milk.\n\nPot Stickers (6) -- the thickness of the dough was perfect (thick but not a bun), and the filling was pretty good, but they refuse to give you any sauce, Which sucks, because that ginger, soy sauce, garlic green onion stuff is perfect for this, and I'm too lazy to get of my ass and make it, that's why we invented delivery.\n\nFried Rice -- Had the best pictures for any fried rice that I've ever seen (the guy who took a pic of the entire menu for Yelp did a great job), and was really excited. But, it was the blandest fried rice he's had. It was not the super oily, dark type (it was a short grain kinda fluffy, but you could tell that they were not using the leftover rice from yesterday, which is the secret for great consistently fried rice. But, there was hardly any flavor to it. They used dark meat chicken, did not add green onions, and asked for it spicy (not spicy). Fluffy=good, not tasty=bad.\n\nFresh Lemonade -- fresh made, semi sweet, perfect amount of sugar vs. bitter. Around 8 oz.\n\nGeneral Tsao's Chicken (Lunch Menu) -- Bland, no flavor, tasted mild spicy level (when ordered spicy), over use of corn starch = disappointment.\n\nWon Ton Soup (Large) -- Wontons where pretty good, but soup base was off, don't know how to explain it, but just didn't really go there like wonton normally does. Got directions correct for no veggies, but disregarded leave green onions.\n\nShrimp Wonton -- It means meat wonton soup WITH shrimp, not shrimp wonton soup.\n\nTofu Sweet Corn Soup -- it's eggdrop soup with tofu, corn and egg, not a unique soup.\n\nFried Crab Meat Rangoon (6) -- Oil has not been filtered (so that you can reuse oil), had a very burnt taste, refuse to give you dipping sauce (red cornstarch based stuff).\n\nOrder for 3 people.", "rating": 2, "date": "2014-01-14"}], "yee wor wonton with fresh chicken soup": [], "seafood tofu egg flower soup": [], "meatless chicken with mixed vegetable soup": [], "meatless chicken hot and sour soup": [], "combination hot and sour soup": [{"excerpts": ["We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. ", "We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. ", "There was a punch but no kick. ", "The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. ", "When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. ", "It was actually really tasty and every spoonful was a surprise. ", "The four of us enjoyed our meal and it was just about the right amount for us. ", "We had two big eaters and two moderate eaters. ", "The quick delivery and ease of ordering online was a plus. ", "Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice."], "author": "Jen L.", "review": "I used EAT24 for the first time the other day and had Golden Kim Tar deliver to us in the SOMA. The food arrived on time and piping hot! We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. There was a punch but no kick. The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. It was actually really tasty and every spoonful was a surprise. The four of us enjoyed our meal and it was just about the right amount for us. We had two big eaters and two moderate eaters. The quick delivery and ease of ordering online was a plus. Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice.", "rating": 4, "date": "2016-04-13"}], "hot and sour wor wonton soup": [], "shrimp hot and sour soup": [{"excerpts": ["We have had:\n\nShrimp Hot and Sour Soup\nScrambled Eggs with Shrimp\nSalt and Pepper Pork Chops\nChicken Chow Mein\nVegetable Chow Mein\n\n"], "author": "Alex C.", "review": "Golden Kim Tar has been consistent:  good food, fast service, pleasant delivery person, and the restaurant staff are nice. \n\nThe lunch combo specials are a good price and have been tasty.  The menu offers a variety of choices that come with the entree, soup, and your choice of sides (nominal cost).  We have had:\n\nShrimp Hot and Sour Soup\nScrambled Eggs with Shrimp\nSalt and Pepper Pork Chops\nChicken Chow Mein\nVegetable Chow Mein\n\nAll were very good.", "rating": 5, "date": "2016-07-28"}], "chinese udon soup with fresh basil and lemon": [], "salmon with asparagus and string bean": [{"excerpts": ["We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. ", "We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. ", "There was a punch but no kick. ", "The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. ", "When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. ", "It was actually really tasty and every spoonful was a surprise. ", "The four of us enjoyed our meal and it was just about the right amount for us. ", "We had two big eaters and two moderate eaters. ", "The quick delivery and ease of ordering online was a plus. ", "Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice."], "author": "Jen L.", "review": "I used EAT24 for the first time the other day and had Golden Kim Tar deliver to us in the SOMA. The food arrived on time and piping hot! We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. There was a punch but no kick. The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. It was actually really tasty and every spoonful was a surprise. The four of us enjoyed our meal and it was just about the right amount for us. We had two big eaters and two moderate eaters. The quick delivery and ease of ordering online was a plus. Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice.", "rating": 4, "date": "2016-04-13"}], "string bean prawns": [], "salt and pepper rock cod": [], "garlic scallops": [], "salt and pepper combination plate": [], "fish fillet rock cod with mixed vegetables": [], "string beans with fish filet in black bean sauce": [], "princess prawns": [], "clam with house black bean sauce": [], "rock cod with black bean sauce": [{"excerpts": ["Definitely recommend the Salt and Pepper Chicken Wings and the Rock Cod with Black Bean Sauce. ", "Tasty, tasty. ", "Shall have to try some of the other items as well."], "author": "Lily L.", "review": "Fast, friendly delivery service. And the lunch specials are a bargain! Definitely recommend the Salt and Pepper Chicken Wings and the Rock Cod with Black Bean Sauce. Tasty, tasty. Shall have to try some of the other items as well.", "rating": 4, "date": "2010-02-03"}], "mongolian salmon": [], "mongolian fish": [], "salt and pepper salmon": [], "sesame prawns": [], "mandarin spicy eggplant with shrimp and chicken": [], "salt  pepper prawns": [], "crispy hunan fish": [{"excerpts": ["I ordered the crispy Hunan fish with fried rice and expected to get a little plate with some soggy fish pieces swimming in sauce and some gummy rice...", "soooo not what I was served.  ", "The fish was crispy and delicious, the sauce was spicy and garlicky, the veggies (zucchini, onion, tomato, etc) all cooked so that they were tender, yet crisp, and the fried rice was delicious and NOT gummy or overly oily/salty.  "], "author": "Rena H.", "review": "I have absolutely no negative comments for golden Kim Tar...surprising, as I am very very picky about my Chinese food.  I went here because it was right across the street from the Federal Building and I had to go there for an appointment.  So very glad that I did!!!\n\nThe decor was very unassuming and I didnt have very high hopes for my meal, but I was knocked in the mouth-hole with one of THE BEST lunches that I have ever had.  I ordered the crispy Hunan fish with fried rice and expected to get a little plate with some soggy fish pieces swimming in sauce and some gummy rice...soooo not what I was served.  The fish was crispy and delicious, the sauce was spicy and garlicky, the veggies (zucchini, onion, tomato, etc) all cooked so that they were tender, yet crisp, and the fried rice was delicious and NOT gummy or overly oily/salty.  The lunch also came with a little bowl of soup and a pot of tea all for the low low price of $7 and some change.  \n\nTo top it off, the waitresses and waiter/manager were all extremely quick, attentive and friendly.  \n\nI will definitely be back!!!", "rating": 5, "date": "2012-08-14"}], "braised catfish": [], "whole pampano fish": [], "king salmon with fresh basil": [], "five flavor sesame scallops": [], "mango beef": [{"excerpts": ["Had the combo fried rice, combo wanton soup, cashew broccoli chicken, mango beef, and shrimp with lobster sauce. ", "Very clean restroom also. ", "Go!  ", "Liked: ", "Lots of great food, friendly staff"], "author": "Taràs C.", "review": "Great restaurant.  I found this on the phone while looking for Chinese restaurants near BART stations to stop in with my family, who had just come in from NY for graduation.  here's my google review: Wish we'd gotten the beers and soup before the food, but it was really great and filling. Had the combo fried rice, combo wanton soup, cashew broccoli chicken, mango beef, and shrimp with lobster sauce. Very clean restroom also. Go!  Liked: Lots of great food, friendly staff", "rating": 5, "date": "2012-05-14"}], "mango prawns": [], "ginger and scallion flounder": [], "black pepper beef short ribs": [], "seafood combination platter": [], "house combo clay pot": [], "lamb stew clay pot": [], "egg foo young": [{"excerpts": ["I tried their vegetable egg foo young a few times and liked it. ", "It had nice chunks of broccoli, carrots, onions,etc. ", "You have to pay extra for rice ", "so that's a rip-off but ", "a lot of Chinese restaurants in this city do that. ", "Tonight they used canned peas, carrots and corn in the egg foo young. ", "No fresh veggies except the bean sprouts. ", "What is it with these Chinese restaurants and canned vegetables? ", "I had the same experience with Manor Coffee Shop (see my review). ", "Also, the gravy was tasteless. ", "It's listed on their menu under chef's specials at $8.25. ", "Ok, I know that \"chef''s specials\", especially at Chinese restaurants, don't really mean anything, but considering the canned vegetables, it's a form of false advertising. ", "Another dive Chinese restaurant. ", "Survives, like many of them do, because of delivery orders. ", "It's in a convenient location, and their garlic eggplant appetizer has always been delicious ", "so I haven't given up on them completely, ", "but I'm not recommending them at all."], "author": "Reynolds L.", "review": "I visit this restaurant less and less frequently. The owners, husband and wife, are generally pleasant. However, the food is frequently substandard and inconsistent. I used to order the salt and pepper pork chop, but no more after paying for essentially a huge portion of fat and bone a couple of times.  I tried their vegetable egg foo young a few times and liked it. It had nice chunks of broccoli, carrots, onions,etc. You have to pay extra for rice so that's a rip-off but a lot of Chinese restaurants in this city do that. Tonight they used canned peas, carrots and corn in the egg foo young. No fresh veggies except the bean sprouts. What is it with these Chinese restaurants and canned vegetables? I had the same experience with Manor Coffee Shop (see my review). Also, the gravy was tasteless. It's listed on their menu under chef's specials at $8.25. Ok, I know that \"chef''s specials\", especially at Chinese restaurants, don't really mean anything, but considering the canned vegetables, it's a form of false advertising. Another dive Chinese restaurant. Survives, like many of them do, because of delivery orders. It's in a convenient location, and their garlic eggplant appetizer has always been delicious so I haven't given up on them completely, but I'm not recommending them at all.", "rating": 1, "date": "2014-04-02"}], "shrimp wonton": [{"excerpts": ["Shrimp Wonton -- ", "It means meat wonton soup WITH shrimp, not shrimp wonton soup.\n\n"], "author": "Max X.", "review": "After moving here from living abroad, various places int he U.S.  and whatever...blah blah, I am really disappointed with the food quality here in SF. So, before I write my review, let me explain this so that hopefully my review will help you make an informed decision on wither you want to order from this place, and ultimately anyplace in SF.\n\nOne of the big reasons why I moved back here is that there are tons of restaurants of pretty much anything you could ever want, in pretty close proximity. That is great, but the problem is that it seems like 85% are all kind of blah, the same thing, and not standing out for flavor profiles. Example: I've had 15 different bin mah sandwich's at 15 different places and non of them come close to the one's in Miami from one place (Miss Saigon), same thing with Fried Rice (either Chinese or Japanese) competitive with Denver and Miami (Go To Sushi -Miami- has the best Japanese fried rice that I have had outside of of the Kyoto tower and Osaka). This city is supposed to be Asian food heaven, but so far it has been a constant let down. Kinda like this place.\n\nThe good: \n1. They deliver, and they do it till late night with a minimum of $$$ for your order, and pretty quick (ours came in 35min), yay!\n2. Proportions are pretty big, yay!, you'll be eating it for a couple of days.\n3. Best overall pictures (taken by a person who works there and knows what they are doing..no stupid Instagram camera photo there) so you know what your ordering and what it will look like. \n\nThe bad:\n1. Everything is just.....bland, some people are writing that stuff here is yummy, but honestly, I have no idea what they are thinking. Have they been just eating non-big-favor food, were their parents horrible cooks? And, is just eating food is a joyous occasion because everything else in their lives tasted like cold oatmeal, without the flavor packets? Do they want the attention, of blathering on and on just to hear themselves talk (see what I did there...that's irony) I have no idea, but here is what we ordered, and why I was let down (so far have not found ANY Chinese places that are any better for delivery for when I'm particularly lazy):\n\nThai Ice Tea -- not very sweet (5/10), bitter, not enough condensed milk.\n\nPot Stickers (6) -- the thickness of the dough was perfect (thick but not a bun), and the filling was pretty good, but they refuse to give you any sauce, Which sucks, because that ginger, soy sauce, garlic green onion stuff is perfect for this, and I'm too lazy to get of my ass and make it, that's why we invented delivery.\n\nFried Rice -- Had the best pictures for any fried rice that I've ever seen (the guy who took a pic of the entire menu for Yelp did a great job), and was really excited. But, it was the blandest fried rice he's had. It was not the super oily, dark type (it was a short grain kinda fluffy, but you could tell that they were not using the leftover rice from yesterday, which is the secret for great consistently fried rice. But, there was hardly any flavor to it. They used dark meat chicken, did not add green onions, and asked for it spicy (not spicy). Fluffy=good, not tasty=bad.\n\nFresh Lemonade -- fresh made, semi sweet, perfect amount of sugar vs. bitter. Around 8 oz.\n\nGeneral Tsao's Chicken (Lunch Menu) -- Bland, no flavor, tasted mild spicy level (when ordered spicy), over use of corn starch = disappointment.\n\nWon Ton Soup (Large) -- Wontons where pretty good, but soup base was off, don't know how to explain it, but just didn't really go there like wonton normally does. Got directions correct for no veggies, but disregarded leave green onions.\n\nShrimp Wonton -- It means meat wonton soup WITH shrimp, not shrimp wonton soup.\n\nTofu Sweet Corn Soup -- it's eggdrop soup with tofu, corn and egg, not a unique soup.\n\nFried Crab Meat Rangoon (6) -- Oil has not been filtered (so that you can reuse oil), had a very burnt taste, refuse to give you dipping sauce (red cornstarch based stuff).\n\nOrder for 3 people.", "rating": 2, "date": "2014-01-14"}], "curry beef stew": [], "string bean with sliced pork": [], "boiled chicken on spicy sauce": [], "minced chicken in lettuce cups": [], "boiled beef in spicy sauce": [], "boiled fish fillet in spicy sauce": [], "five spice roast chicken": [], "vegetarian delight": [{"excerpts": ["My order: veg pot stickers, lemon chicken, and vegetarian delight\nTime: 6:30pm on a Tuesday\n\nDelivery took 40 minutes, which is the only reason I'm cutting a star. ", "The vegetarian delight was wonderful - blanched, then lightly sauteed broccoli, tomato, water chestnut and baby bok choy. "], "author": "Aimee K.", "review": "My order: veg pot stickers, lemon chicken, and vegetarian delight\nTime: 6:30pm on a Tuesday\n\nDelivery took 40 minutes, which is the only reason I'm cutting a star. The food was great. The chicken was breaded and in a sweet lemon sauce. No vegetables were served with it, so I'm glad I ordered some in another dish. The vegetarian delight was wonderful - blanched, then lightly sauteed broccoli, tomato, water chestnut and baby bok choy. The veggies were light and crisp with garlic and ginger, and not drowned in a heavy oily or sugary sauce.\n\nI'll definitely order again.", "rating": 4, "date": "2009-12-15"}], "vegetable with tofu": [], "string bean with tofu": [], "mandarin spicy eggplant with tofu": [], "bok choy with black mushroom": [], "sizzling basil tofu": [], "vegetarian kung pao with tofu": [], "sauteed asparagus": [], "mandarin spicy meatless chicken with eggplant": [], "fresh basil meatless chicken": [], "string bean meatless chicken": [{"excerpts": ["I ordered the lemongrass garlic noodles, string bean meatless chicken, and the vegetable mapo tofu.  ", "Portions were large at a low cost.  ", "It satisfied my Chinese food craving, and I have absolutely no regrets."], "author": "Lisa F.", "review": "This place is great for take-out.  I ordered the lemongrass garlic noodles, string bean meatless chicken, and the vegetable mapo tofu.  Portions were large at a low cost.  It satisfied my Chinese food craving, and I have absolutely no regrets.", "rating": 4, "date": "2018-05-08"}], "cashew broccoli meatless chicken": [], "mixed vegetables meatless chicken": [], "hoisin string bean": [], "salt and pepper string beans with tofu": [], "dry fried string beans with hot chili sauce": [], "black mushrooms with fried tofu": [], "pea sprouts with garlic sauce": [], "vegetable ma po tofu": [], "bitter melon in black bean sauce": [], "szechuan eggplant tofu": [], "general tsaos chicken wings": [], "spicy chicken with fresh basil": [], "cashew broccoli chicken": [{"excerpts": ["Cashew Broccoli Chicken - The first thing noticed where the cashews whole cashews (not bits and pieces) and sizeable. ", "The broccoli was cooked a little firm still and seasoned in a salty garlic sauce.\n", "Beef with Mushroom - Only ate the vegetables from my parents dish but they were well seasoned but too much of the starchy sauce for my liking."], "author": "Truc N.", "review": "If you're into lots of quantity for a low price, Golden Kim Tar will satisfy. My parents are frugal Asians not particularly adventurous with food. Coming from an afternoon visit to the Asian Art Museum, we back to Civic Center and this place caught their fancy with the lunch special and familiar looking dishes. \n\nIt was quiet during lunch, we were seated right away. Probably more of a takeout/delivery place. The service was very nice service and prompt. Complimentary egg drop soup and slices of oranges post-meal. They had generous lunch special portion sizes of both the main and the side of white rice (my parents love white rice). Mains are little on the oily side.\n\nFive Spice Chicken - Fragrant but not too sweet. I feel like I'd enjoy this more with tofu instead of meat actually. A very generous serving of meat on top of fresh broccoli. The chicken wasn't that good quality, I had a few bites and left the rest for my parents.\nCashew Broccoli Chicken - The first thing noticed where the cashews whole cashews (not bits and pieces) and sizeable. The broccoli was cooked a little firm still and seasoned in a salty garlic sauce.\nBeef with Mushroom - Only ate the vegetables from my parents dish but they were well seasoned but too much of the starchy sauce for my liking.", "rating": 3, "date": "2018-08-10"}, {"excerpts": ["Had the combo fried rice, combo wanton soup, cashew broccoli chicken, mango beef, and shrimp with lobster sauce. ", "Very clean restroom also. ", "Go!  ", "Liked: ", "Lots of great food, friendly staff"], "author": "Taràs C.", "review": "Great restaurant.  I found this on the phone while looking for Chinese restaurants near BART stations to stop in with my family, who had just come in from NY for graduation.  here's my google review: Wish we'd gotten the beers and soup before the food, but it was really great and filling. Had the combo fried rice, combo wanton soup, cashew broccoli chicken, mango beef, and shrimp with lobster sauce. Very clean restroom also. Go!  Liked: Lots of great food, friendly staff", "rating": 5, "date": "2012-05-14"}], "chicken with vegetables": [], "honey walnut chicken": [{"excerpts": ["We ordered garlic eggplant, chicken chow mein and honey walnut chicken. ", "They were all ok, but again, there's lots of better options in SF."], "author": "Amanda L.", "review": "An a bit below average chinese place. There's nothing particularly special about this place. We ordered garlic eggplant, chicken chow mein and honey walnut chicken. They were all ok, but again, there's lots of better options in SF.", "rating": 3, "date": "2018-05-22"}, {"excerpts": ["HONEY WALNUT CHICKEN. ", "Oh my goodness. ", "Amazing.\n", "2. ", "Fried rice. ", "Enough said.\n", "3. ", "Every single time I walk in there, I feel like the prodigal child. "], "author": "Brittany P.", "review": "I am absolutely obsessed with Golden Kim Tar. Allow me to craft a list of all the reasons why:\n1. HONEY WALNUT CHICKEN. Oh my goodness. Amazing.\n2. Fried rice. Enough said.\n3. Every single time I walk in there, I feel like the prodigal child. SO friendly and welcoming!! \n\nI've eaten at A LOT of Chinese places in the city, and this is the best by far. Do yourself a favor and try it- you won't be disappointed.", "rating": 5, "date": "2013-06-30"}, {"excerpts": ["Honey walnut chicken was probably the best ", "but it was not as crunch as I expected. ", "I would not order from this place again."], "author": "SeungJin N.", "review": "**only for delivery** I ordered food from here and everything looked like it was made long time ago.  Mongolian beef noodles were just all clumped together, bland and with probably 3 pieces of beef.  Both hot and sour soup and egg flower soup are just watered down bland and too sweet. Honey walnut chicken was probably the best but it was not as crunch as I expected. I would not order from this place again.", "rating": 1, "date": "2016-05-03"}], "chicken mu shu": [], "bitter melon chicken": [{"excerpts": ["I'm totally in love with from this restaurant, Bitter Melon Chicken with black bean sauce with steamed rice and BItter Melon Beef with black bean sauce and steamed rice. ", "Bitter Melon is an acquired taste, I grew up on it. ", "The chef at this restaurant cooks so much like my grandfather that passed on in 1995, that every time I want to remember my grandparents, I order from this restaurant.. ", "The food is amazing...", "I promise you would never be disappointed here. ", "I also love that when you order Won Ton Soup, they ask if you prefer Bok Choy or broccoli..."], "author": "Sakkara C.", "review": "I have found two more dishes I'm totally in love with from this restaurant, Bitter Melon Chicken with black bean sauce with steamed rice and BItter Melon Beef with black bean sauce and steamed rice. Bitter Melon is an acquired taste, I grew up on it. The chef at this restaurant cooks so much like my grandfather that passed on in 1995, that every time I want to remember my grandparents, I order from this restaurant.. The food is amazing...I promise you would never be disappointed here. I also love that when you order Won Ton Soup, they ask if you prefer Bok Choy or broccoli...", "rating": 5, "date": "2010-12-16"}], "mint chicken": [], "chinese teriyaki chicken": [], "yummy house pickled sour mustard with chicken": [], "general tsaos chicken": [{"excerpts": ["The lady and her husband are really great, honest people which I love dealing with because I know every time I go in that it won't be a challenge just to get some General Tsaos Chicken and their Salmon Fried Rice. ", "To me, that's one of the only reasons why I love this place because any restaurant that has salmon fried rice is my best friend. \n", "Honestly, they have been so consistent in their food quality and their service that I see why they are one of the lasting restaurant on the block. ", "All but 3 out of 7 have stayed open during the wave, and they are one of them. ", "But honestly, don't go if you're looking for a \"nice and hip\" spot to eat at. ", "Go for the food and not the atmosphere. ", "Other than that, once they get their remodel makeover in the years to come, I'll forever be their number one take-out customer ", ":). ", "But hey, the tenderloin is on a rise so I can totally see the owners getting their hands dirty with some cool new hip remodeling!"], "author": "Nick A.", "review": "When I'm thinking \"Chinese take-out\" for dinner, Golden Kim Tar is my go-to for delicious and consistent food and service. The reason for the 4 stars is because that nothing ever WOWs me. The lady and her husband are really great, honest people which I love dealing with because I know every time I go in that it won't be a challenge just to get some General Tsaos Chicken and their Salmon Fried Rice. To me, that's one of the only reasons why I love this place because any restaurant that has salmon fried rice is my best friend. \nHonestly, they have been so consistent in their food quality and their service that I see why they are one of the lasting restaurant on the block. All but 3 out of 7 have stayed open during the wave, and they are one of them. But honestly, don't go if you're looking for a \"nice and hip\" spot to eat at. Go for the food and not the atmosphere. Other than that, once they get their remodel makeover in the years to come, I'll forever be their number one take-out customer :). But hey, the tenderloin is on a rise so I can totally see the owners getting their hands dirty with some cool new hip remodeling!", "rating": 4, "date": "2018-03-25"}], "black pepper beef": [{"excerpts": ["I like their Mongolian beef and black pepper beef, although there is always a lot more veggie than beef. ", "Their sweet and sour chicken was mediocre; there was a lot of breading and some pieces tasted soggy instead of crispy. ", "I would choose the orange chicken over the sweet and sour chicken, at least it was more flavorful. "], "author": "Mimi K.", "review": "I come here for lunch sometimes with my coworker because it is fast and cheap. They always have lunch special, but it gets very crowded during lunch. They have added more items to their lunch special menu now. When you order the lunch special, it always comes with soup. I like their Mongolian beef and black pepper beef, although there is always a lot more veggie than beef. Their sweet and sour chicken was mediocre; there was a lot of breading and some pieces tasted soggy instead of crispy. I would choose the orange chicken over the sweet and sour chicken, at least it was more flavorful. You get a slice of orange with a fortune cookie at the end of each meal. \n\nOh, and it gets quite stuffy if you sit in the back near the kitchen area.", "rating": 4, "date": "2014-05-18"}], "string bean beef": [], "sizzling basil beef": [{"excerpts": ["I ordered the sizzling basil beef which came very quickly. ", "Portions were pretty large for the price ", "however I did not think the food was amazing by any means. ", "All in all this is a typical Chinese restaurant that does not differ from any other Chinese place but if you need fast food and larger portions, this is a good option."], "author": "Tuvshin T.", "review": "The restaurant is pretty cramped and had an authentic Chinese restaurant feel to it with which comes unsurprising sub par service. Waiters did not come by much and when they did, it was a bit difficult to communicate with them. I ordered the sizzling basil beef which came very quickly. Portions were pretty large for the price however I did not think the food was amazing by any means. All in all this is a typical Chinese restaurant that does not differ from any other Chinese place but if you need fast food and larger portions, this is a good option.", "rating": 3, "date": "2017-05-17"}, {"excerpts": ["We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. ", "We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. ", "There was a punch but no kick. ", "The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. ", "When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. ", "It was actually really tasty and every spoonful was a surprise. ", "The four of us enjoyed our meal and it was just about the right amount for us. ", "We had two big eaters and two moderate eaters. ", "The quick delivery and ease of ordering online was a plus. ", "Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice."], "author": "Jen L.", "review": "I used EAT24 for the first time the other day and had Golden Kim Tar deliver to us in the SOMA. The food arrived on time and piping hot! We ordered Wonton with Red Chili Oil, Combination Hot and Sour Soup, Salmon with Asparagus and String Bean, Salt and Pepper Calamari, General Tsao's Chicken and Sizzling Basil Beef. We had asked for spicy on the Chicken and Beef dishes but neither was that spicy. There was a punch but no kick. The Wontons were really good and the Combination Hot and Sour Soup was a total surprise for us in terms of taste and contents. When I read \"combination,\" I expected meat and seafood since the other options were seafood, chicken, pork, beef or vegetable, but instead, the soup contained Wontons, pork, chicken, vegetables all mixed in with the Hot and Sour Soup. It was actually really tasty and every spoonful was a surprise. The four of us enjoyed our meal and it was just about the right amount for us. We had two big eaters and two moderate eaters. The quick delivery and ease of ordering online was a plus. Also, the staff was able to effectively communicate with me when I called to add an order of steamed rice.", "rating": 4, "date": "2016-04-13"}], "hunan hot and sour beef": [], "beef with black mushroom": [{"excerpts": ["So far, I've had the Sesame Chicken, Orange Chicken, Beef with Black Mushroom, ", "Kung Pao Tofu (my fave so far), etc.  "], "author": "Leah E.", "review": "YAY! I'M A FAN because:\n\n1. Golden Kim Tar delivers within the Tenderloin/Civic Center area for FREE!\n\n2.  The portions are HUMONGOUS!\n\n3. Supercheap! $20 worth of food consists of 2 huge full entrees, an appetizer and a free chowmein or fried rice which can feed 3- 4 people.\n\n4.  The dishes are actually yummy.  Not yummy as in \"I'll brave the TL to get to this food\" yummy but as long as I work around the area, I'll eat here. So far, I've had the Sesame Chicken, Orange Chicken, Beef with Black Mushroom, Kung Pao Tofu (my fave so far), etc.  They are all delicious!!! \n\nFor the first time last week I tried their delivery service.  I phoned in my order and they delivered the food to my office punctually as I requested.\n\nI was ecstatic!  It means that I can have Chinese Food Nights with boyfriend for cheap and just a phonecall away!\n\nThe restaurant itself is non-descript but the servers were very friendly.\n\nTip:  If you are visiting the beautiful San Francisco Main Library (SFPL), you can ask Golden Kim Tar to deliver your food to  the library. Just don't eat your food at SFPL.  NO EATING/DRINKING ALLOWED AT THE LIBRARY!\n\nEnjoy!", "rating": 4, "date": "2009-04-08"}], "szechuan crispy beef": [], "house beef stew": [], "bbq pork with vegetables": [], "black pepper pork chop": [], "spicy string bean with minced pork": [], "mapo tofu with pork": [], "szechuan eggplant with pork": [], "peking pork chop": [], "mongolian shredded pork": [], "szechuan shredded pork": [], "orange pork": [], "yummy house pickled sour mustard with pork": [], "garlic sauce pork chop": [], "onion pork chop": [], "spicy bbq pork": [], "salmon and chicken fried rice": [], "fried brown rice": [], "roast duck fried rice": [], "chinese sausage fried rice": [{"excerpts": ["and I love their Chinese sausage fried rice."], "author": "Raeann L.", "review": "This is my go-to Chinese restaurant. Their portions are generous for their price point. Sesame chicken always comes out super crispy, even when I order for delivery! Chow fun is one of the best and I love their Chinese sausage fried rice.", "rating": 5, "date": "2018-02-24"}], "gravy seafood fried rice": [], "party size rice": [], "white meat chicken fried rice": [], "malaysia style chow fun": [], "singapore style noodle": [], "hong kong style pan fried noodle": [], "garlic noodle with basil and lemongrass": [], "mongolian beef chow mein": [], "curry tomato beef hong kong style": [], "tomato beef hong kong style": [], "three threaded meat stir vermicelli": [], "curry tomato beef chow mein": [], "mongolian beef party tray": [], "mongolian chicken party tray": [], "salt and pepper chicken wings party tray": [], "black pepper beef party tray": [], "black pepper chicken party tray": [], "curry beef party tray": [], "curry chicken party tray": [], "string bean beef party tray": [], "string bean chicken party tray": [], "broccoli and beef party tray": [], "broccoli and chicken party tray": [], "spicy chicken with fresh basil party tray": [], "kung pao chicken party tray": [], "kung pao beef party tray": [], "garlic chicken party tray": [], "garlic beef party tray": [], "sizzling basil chicken party tray": [], "sizzling basil beef party tray": [], "sweet and sour pork party tray": [], "sweet and sour chicken party tray": [], "mango beef party tray": [], "mango chicken party tray": [], "general tsaos chicken party tray": [], "sesame chicken party tray": [], "orange chicken party tray": [], "mixed vegetable with bbq party tray": [], "happy walnut prawns party": [], "fish with black bean sauce party tray": [], "kung pao prawns party tray": [], "mixed vegetables party tray": [], "mixed vegetables with tofu party tray": [], "mandarin spicy eggplant with tofu party tray": [], "string bean prawns party tray": [], "king salmon with fresh basil party tray": [], "salt and pepper prawns party tray": [], "mandarin spicy eggplant with shrimp and chicken party tray": [], "salt and pepper calamari party tray": [], "salt and pepper fish party tray": [], "crispy hunan fish party tray": [], "salmon with asparagus and string beans party tray": [], "chicken chow fun party tray": [], "beef chow fun party tray": [], "bbq chow fun party tray": [], "vegetable chow fun party tray": [], "vegetable fried rice party tray": [], "chicken fried rice party tray": [], "beef fried rice party tray": [], "pork fried rice party tray": [], "combination fried rice party tray": [], "chicken chow mein party tray": [], "beef chow mein party tray": [], "pork chow mein party tray": [], "combination chow mein party tray": [], "singapore style noodle party tray": [], "three threaded meat stir vermicelli party tray": [], "spicy bbq pork with fresh basil party tray": [], "happy walnut party tray": [], "dr pepper": [], "root beer": [{"excerpts": ["and I said Root Beer and here comes the delivery 30 minutes later with 3 free sodas! ", "AMAZING! ", "LoL! ", "( i get excited over free things lol ) "], "author": "Charlie D.", "review": "So of course I used Yelp to find a new chinese restaurant to try out and Golden Kim Tar came up with the highest average rating which I think is pretty much dead on.\n\nThe lady on the phone was amazingly hilarious. She seemed super excited to take my order and she called back to verify my card number and apologized and asked me how many people were eating and I said 3 people  thinkin thats how many chop sticks she'll throw in and such....and then asked what my fav soda was and I said Root Beer and here comes the delivery 30 minutes later with 3 free sodas! AMAZING! LoL! ( i get excited over free things lol ) The dude was super nice that delivered and had a huge smile on his face and thanked me and closed my door for me....\n\nSo yes...food....\n\nI ordered the Orange Chicken,General Tso, and Pineapple Fried Rice....\n\nYou really cant go wrong with the orange chicken or general tso, great portions and I got plenty of left over for lunch and dinner even after two of my other friends dug in.\nThe pineapple friend rice is better then most that i've had...it has a nice curry taste to it and pineapples seem freshly cut and its a huge portion for 6 bucks. \n\nSo far, my go to chinese joint till they mess up. LoL!", "rating": 4, "date": "2008-12-08"}], "arizona mucho mango": [], "arizona watermelon": [], "sobe strawberry banana": [], "sobe pina colada": [], "sobe strawberry daquiri": [], "young coconut juice": [], "whole young coconut fruit": [], "wonton noodle soup with chicken": [], "wonton noodle soup with beef": [], "wonton noodle soup with pork": [], "wonton noodle soup with vegetable": [], "beef stew wonton noodle soup": [], "roast duck wonton noodle soup": [{"excerpts": ["Was totally craving roast duck wonton noodle soup. "], "author": "Pickle R.", "review": "This a review from my UberEATS experience, not a sit down and eat in the restaurant. \n\nSo I was feeling slightly under the weather at work on Friday. Was totally craving roast duck wonton noodle soup. I pull out my iPhone and opened the UberEATS app, rifling through Chinese restaurants looking for roast duck. \n\nI stumbled on this restaurant that I had not heard of. I place my order and within a hour I was in heaven. I even called the restaurant to give them my love. It was so good that I didn't realize that there was no wonton. Next time she says. Lol\n\nThe roast duck noodle soup, and the beef stew noodle soup, was straight up comfort food for my soul. \n\nI'll be ordering here from now on, for their fresh juicy and fat roast duck. The beef stew is so tender, too. \n\nThank you.", "rating": 5, "date": "2017-01-15"}], "thai curry chicken noodle soup": [], "five spice roast chicken noodle soup": [], "beef stew noodle soup": [{"excerpts": ["The roast duck noodle soup, and the beef stew noodle soup, was straight up comfort food for my soul. \n\n"], "author": "Pickle R.", "review": "This a review from my UberEATS experience, not a sit down and eat in the restaurant. \n\nSo I was feeling slightly under the weather at work on Friday. Was totally craving roast duck wonton noodle soup. I pull out my iPhone and opened the UberEATS app, rifling through Chinese restaurants looking for roast duck. \n\nI stumbled on this restaurant that I had not heard of. I place my order and within a hour I was in heaven. I even called the restaurant to give them my love. It was so good that I didn't realize that there was no wonton. Next time she says. Lol\n\nThe roast duck noodle soup, and the beef stew noodle soup, was straight up comfort food for my soul. \n\nI'll be ordering here from now on, for their fresh juicy and fat roast duck. The beef stew is so tender, too. \n\nThank you.", "rating": 5, "date": "2017-01-15"}, {"excerpts": ["Look, you don't get between a girl and ngau lam mein (beef stew noodle soup), all right? ", "Maybe it's one of those Cantonese things like when you're craving pei dan jook (preserved egg congee) or egg custard tarts, but nothing else will do. ", "So the waitress came over and he ordered some veg spring rolls, a shrimp dish and rice first, and I ordered a bowl of beef stew noodle soup. ", "She vehemently tried to persuade me to order family style and get a bunch more dishes. ", "I explained that he doesn't eat red meat or poultry, and that I really wanted the ngau lam mein. ", "She then tried to persuade me to order some seafood dishes. ", "I told her that I really wanted ngau lam mein, and that I didn't want seafood. ", "She pointed at the vegetable dishes. ", "Again, I said that I really wanted ngau lam mein. ", "Having tried and failed to persuade me to order meat, seafood, or vegetables, totally exhausting the menu of options save for appetizers, she finally smiled at me and said that if I wanted ngau lam mein, then I could have ngau lam mein. ", "Yeah, it came out piping hot, the noodles were fine, and the stew meat that combination of chewy and tender that it's supposed to be, but the stew itself was really more like a thin broth with a few too many big old chunks of ginger. ", "It also had broccoli, which is not what you usually get. ", "I don't know. ", "Maybe I shouldn't have insisted on ngau lam. ", "The veg spring rolls were good, though."], "author": "Kristina L.", "review": "Look, you don't get between a girl and ngau lam mein (beef stew noodle soup), all right? Maybe it's one of those Cantonese things like when you're craving pei dan jook (preserved egg congee) or egg custard tarts, but nothing else will do. And I'm only Cantonese on my dad's side. \n\nAt any rate, I walked in here with the boyfriend, and when I saw that they had beef stew, that was it, and we agreed to not have stuff family style, 'cause he's a pescetarian. So the waitress came over and he ordered some veg spring rolls, a shrimp dish and rice first, and I ordered a bowl of beef stew noodle soup. She vehemently tried to persuade me to order family style and get a bunch more dishes. I explained that he doesn't eat red meat or poultry, and that I really wanted the ngau lam mein. She then tried to persuade me to order some seafood dishes. I told her that I really wanted ngau lam mein, and that I didn't want seafood. She pointed at the vegetable dishes. Again, I said that I really wanted ngau lam mein. Having tried and failed to persuade me to order meat, seafood, or vegetables, totally exhausting the menu of options save for appetizers, she finally smiled at me and said that if I wanted ngau lam mein, then I could have ngau lam mein. Yeah, it came out piping hot, the noodles were fine, and the stew meat that combination of chewy and tender that it's supposed to be, but the stew itself was really more like a thin broth with a few too many big old chunks of ginger. It also had broccoli, which is not what you usually get. I don't know. Maybe I shouldn't have insisted on ngau lam. The veg spring rolls were good, though.", "rating": 2, "date": "2010-05-14"}], "roast duck noodle soup": [{"excerpts": ["The roast duck noodle soup, and the beef stew noodle soup, was straight up comfort food for my soul. \n\n"], "author": "Pickle R.", "review": "This a review from my UberEATS experience, not a sit down and eat in the restaurant. \n\nSo I was feeling slightly under the weather at work on Friday. Was totally craving roast duck wonton noodle soup. I pull out my iPhone and opened the UberEATS app, rifling through Chinese restaurants looking for roast duck. \n\nI stumbled on this restaurant that I had not heard of. I place my order and within a hour I was in heaven. I even called the restaurant to give them my love. It was so good that I didn't realize that there was no wonton. Next time she says. Lol\n\nThe roast duck noodle soup, and the beef stew noodle soup, was straight up comfort food for my soul. \n\nI'll be ordering here from now on, for their fresh juicy and fat roast duck. The beef stew is so tender, too. \n\nThank you.", "rating": 5, "date": "2017-01-15"}], "fish fillet noodle soup": [], "beef w satay sauce noodle soup": [], "house special chicken noodle soup": [], "house special combination noodle soup": [], "fried banana with chocolate sauce": [], "butter pecan ice cream": [], "mini sweet potato": [], "new york style cheesecake": [], "lemon flavor cake": [], "yummy crispy waffle": [], "free fried rice with order of  or more": [], "free chow mein with order of  or more": [], "free egg roll with order of  or more": [], "free pot stickers with order of  or more": [], "free crabmeat rangoon with order of  or more": [], "free wonton soup with order of  or more": [], "free hot and sour soup with order of  or more": [], "free kung pao chicken with order of  or more": [], "free mongolian beef with order of  or more": [], "free fried banana with order of  or more": [], "free small hot and sour soup with order of  or more": [], "free fried wonton stripslices with order of  or more": [], "free cheesecake with order of  or more": [], "free edamame with order of  or more": [], "free seaweed salad with order of  or more": [], "free butter pecan ice cream with order of  or more": [], "free green tea ice cream with order of  or more": [], "free vanilla ice cream with order of  or more": [], "free garden salad with order of  or more": [], "free yummy crispy waffle with order of  or more": [], "free veggie hot and sour soup with order of  or more": [], "honey walnut chicken lunch": [], "spicy chicken with fresh basil lunch": [], "spicy beef with fresh basil lunch": [], "chicken with black mushroom lunch": [], "beef with black mushroom lunch": [], "satay beef with fresh basil lunch": [], "satay chicken with fresh basil lunch": [], "cashew broccoli chicken lunch": [], "cashew broccoli beef lunch": [], "asparagus chicken lunch": [], "asparagus beef lunch": [], "ginger and scallion chicken lunch": [], "ginger and scallion beef lunch": [], "general tsos chicken wings lunch": [], "fire flavor chicken lunch": [], "tomato beef hong kong style crispy noodle lunch": [], "house beef stew lunch": [], "honey walnut shrimp lunch": [], "mongolian fish lunch": [], "mongolian salmon lunch": [], "salt and pepper fish lunch": [], "salt and pepper shrimp lunch": [], "asparagus fish lunch": [], "asparagus shrimp lunch": [], "general tsos shrimp lunch": [], "general tsos fish lunch": [], "string bean fish lunch": [], "string bean shrimp lunch": [], "garlic scallops lunch": [], "mandarin spicy eggplant with tofu lunch": [], "sizzling basil tofu lunch": [], "dry fried string bean with hot chili lunch": [], "braised bean curd with asparagus lunch": [], "crispy hunan fish lunch": [], "sweet and sour chicken lunch": [], "bbq pork with vegetables lunch": [], "salt and pepper pork chop lunch": [], "garlic eggplant lunch": [], "sauteed string bean lunch": [], "vegetarian kung pao with tofu lunch": [], "bitter melon chicken lunch": [], "bitter melon beef lunch": [], "rock cod with black bean sauce lunch": [], "orange chicken lunch": [], "sesame chicken lunch": [], "mongolian beef chow fun lunch": [], "braised catfish lunch": [], "mapo bean curd lunch": [], "house curry beef stew lunch": [], "kung pao fish fillet lunch": [], "house special combination lunch": [], "mongolian combination lunch": [], "general taos meatless chicken over rice lunch": [], "kung pao meatless chicken over rice lunch": [], "salt and pepper chicken wings lunch": [], "black pepper chicken lunch": [], "black pepper beef lunch": [], "assorted vegetable chicken lunch": [], "string bean beef lunch": [], "string bean chicken lunch": [], "tofu beef lunch": [], "tofu chicken lunch": [], "tomato beef lunch": [], "tomato chicken lunch": [], "scrambled egg with beef lunch": [], "scrambled egg with shrimp lunch": [], "roast duck lunch": [], "mandarin spicy eggplant with shrimp and chicken lunch": [], "salmon with fresh basil lunch": [], "asparagus salmon lunch": [{"excerpts": ["I love the asparagus salmon lunch special. ", "The portions are very generous. ", "The fried rice is so fluffy and soft and fresh. ", "The salmon is always cooked perfectly. ", "And the asparagus. ", "oh my god. ", "the asparagus is the best i have ever eaten in my life. ", "It is tender and yet crisp at the same time, and meaty. ", "the sauce complements both the salmon and the asparagus and ties the dish together. ", "One top of that, before the meal arrives you get egg drop soup (which i normally hate) which you will crave for days. ", "I can't believe that this place exists, let alone in the middle of the tenderloin."], "author": "Faith G.", "review": "I love the asparagus salmon lunch special. The portions are very generous. The fried rice is so fluffy and soft and fresh. The salmon is always cooked perfectly. And the asparagus. oh my god. the asparagus is the best i have ever eaten in my life. It is tender and yet crisp at the same time, and meaty. the sauce complements both the salmon and the asparagus and ties the dish together. One top of that, before the meal arrives you get egg drop soup (which i normally hate) which you will crave for days. I can't believe that this place exists, let alone in the middle of the tenderloin.", "rating": 5, "date": "2013-04-25"}], "spicy bbq pork with fresh basil lunch": [], "shredded pork with szechuan garlic sauce lunch": [], "assorted vegetable prawns": []}