{"bean  cheese": [], "vege": [], "al pastor": [{"excerpts": ["Solid, good daily special (today was al pastor taco at $1.25 a pop) free refills, good salsa, flavorful, and fast. ", "I wish they included chips. ", "Not as shocking a display as Pancho Villa, but when your in the 'hood, go with the flow."], "author": "Andrew K.", "review": "Solid, good daily special (today was al pastor taco at $1.25 a pop) free refills, good salsa, flavorful, and fast. I wish they included chips. Not as shocking a display as Pancho Villa, but when your in the 'hood, go with the flow.", "rating": 4, "date": "2006-03-18"}, {"excerpts": ["I knew I should have gone with al pastor tacos, but I wanted something to dip chips in at my leisure. \r\n", "Burritos here are big, soft fatties. ", "In my opinion, too loosely rolled and juicy, but they are cheap, about $4."], "author": "Candice L.", "review": "After visiting the feeble sister Gordo on Geary, I had to make a second stop at the 9th Ave location to get a simple order of refried beans, spicy salsa, and chips. It can really be one of the most satisfying night snacks, mixing the salsa into the refritos and yielding a somewhat addictive bean dip for about $2. \r\nAnyway, at least this Gordo's had refried beans and chips, but they were not worth a return visit. When prepared with any amount of finesse, refritos can be sublime. Lard and salt combine to produce a fabulous mouth feel, the sum is greater than the parts. Anyway, these beans were bland, bland, and bland. Even spicy pico de gallo couldn't save them. I knew I should have gone with al pastor tacos, but I wanted something to dip chips in at my leisure. \r\nBurritos here are big, soft fatties. In my opinion, too loosely rolled and juicy, but they are cheap, about $4.", "rating": 2, "date": "2005-12-23"}, {"excerpts": ["Special on al pastor tacos for $1.25 each = fantastic value.\r\n\r\n", "Otherwise, average to above average tacos and burritos.  ", "A little too much rice and beans for my taste.  ", "Definitely worth visiting ", "if I'm in already in the neighborhood and need to grab a quick bite, but by no means a \"destination.", "\""], "author": "Leon R.", "review": "Special on al pastor tacos for $1.25 each = fantastic value.\r\n\r\nOtherwise, average to above average tacos and burritos.  A little too much rice and beans for my taste.  Definitely worth visiting if I'm in already in the neighborhood and need to grab a quick bite, but by no means a \"destination.\"", "rating": 3, "date": "2006-05-02"}, {"excerpts": ["I love tacos al pastor ", "so I ordered one and a quesadilla (which are the best things ever) but lets face it ", "how hard is it to f**k up a quesadilla. ", "Well I have had my share of disappointing quesadillas but not here. ", "It was simple and yummy, perfectly toasted flour tortilla and not some slop some fool threw together...", "so over all this taqueria has my stamp of approval ", "and it was quick and clean and fresh. ", "A sure plus in my book...you will be seeing me again GORDO!"], "author": "Yolanda O.", "review": "Prior to walking into Golden Gate Park for the Bluegrass festival we hopped off the N train and proceeded to walk down to grab a bite to grub on. So I have said it once and I will say it again- SF and mexican food don't always agree with me. Not to be a snob but mexican food doesn't have to be complicated- the simpler the better, anything that is too frou frou turns me off. When you invest more time and thought into your decor than your food I head for the hills. With this said: I liked this spot A LOT!\nI love tacos al pastor so I ordered one and a quesadilla (which are the best things ever) but lets face it how hard is it to f**k up a quesadilla. Well I have had my share of disappointing quesadillas but not here. It was simple and yummy, perfectly toasted flour tortilla and not some slop some fool threw together...so over all this taqueria has my stamp of approval and it was quick and clean and fresh. A sure plus in my book...you will be seeing me again GORDO!", "rating": 4, "date": "2009-10-05"}, {"excerpts": ["Have you wandered into the land of fog from the mission looking for a super carne asada or al pastor? ", "If so, march on back to the sunnier side of the city because you are about to be sorely disappointed.\n", "The hands down best thing at Gordos is the quesadilla. ", "Whether corn or flour, they are dipped in oil and fried with cheese (yes, you have officially entered a place loosely translated as Fatties). ", "Top that with either some mouth watering carnitas or boiled chicken and you are good to go partner. ", "Get a Gordos plate with carnitas and you will be equally satisfied. ", "If you do decide on a burrito, remember that Gordos burritos are the melty cheesy kind and that the usual king of meats, carne asada, is sub-par here.\n"], "author": "Mark K.", "review": "Your Gordos experience will very much depend on what you get and what your  Expectations are.\nHave you wandered into the land of fog from the mission looking for a super carne asada or al pastor? If so, march on back to the sunnier side of the city because you are about to be sorely disappointed.\nThe hands down best thing at Gordos is the quesadilla. Whether corn or flour, they are dipped in oil and fried with cheese (yes, you have officially entered a place loosely translated as Fatties). Top that with either some mouth watering carnitas or boiled chicken and you are good to go partner. Get a Gordos plate with carnitas and you will be equally satisfied. If you do decide on a burrito, remember that Gordos burritos are the melty cheesy kind and that the usual king of meats, carne asada, is sub-par here.\nAt the end of the day, if you know what to get, Gordos will satisfy you in a very unique way as compared to a mission taqueria, and thus, it should not be treated as such.\n\nP.S. Gordos has some of the best chips in the city, if not the best. They're deep fried goodness!", "rating": 4, "date": "2010-07-24"}, {"excerpts": ["Except for one crucial difference: AL PASTOR!"], "author": "Ben P.", "review": "Just like every other Gordo. Except for one crucial difference: AL PASTOR!", "rating": 4, "date": "2005-11-22"}, {"excerpts": ["Bonus points for having al pastor!"], "author": "Alex K.", "review": "Good, but not great.  Great location, the best burrito you can get in this area for sure.  If you are really a purist head out to the Mission instead.  Bonus points for having al pastor!", "rating": 3, "date": "2007-06-13"}], "rice  bean": []}