{"everest chicken momo": [{"excerpts": ["*Everest Chicken Momo: ", "Chicken dumpling filled with minced chicken, herbs and spices served with homemade fire-roasted tomato and sesame chutney ($7.95)\n", "*Samosa: ", "Mildly spiced potatoes and peas, served with extra mint sauce, 2 pcs, no tamarind sauce ($5.35)\n", "*", "Chicken Tikka Masala: ", "Boneless white meat chicken cooked to perfection in the tandoor, then simmered Indian classic sauce, Extra spicy ($13.45)\n"], "author": "Elena N.", "review": "I woke up starving! After a few nights of drinking, I needed some comfort food. Decided to order lunch / brunch from Gorkha Kitchen on Saturday, August 11th. I placed a delivery order through their website at 11:38am. It arrived at 12:47pm. I live in Outer Richmond.\n\n*Everest Chicken Momo: Chicken dumpling filled with minced chicken, herbs and spices served with homemade fire-roasted tomato and sesame chutney ($7.95)\n*Samosa: Mildly spiced potatoes and peas, served with extra mint sauce, 2 pcs, no tamarind sauce ($5.35)\n*Chicken Tikka Masala: Boneless white meat chicken cooked to perfection in the tandoor, then simmered Indian classic sauce, Extra spicy ($13.45)\n*Bullet Naan: Naan stuffed with chilies, garlic and cilantro ($2.95)\n*Garlic Naan: Fluffy Naan with cilantro and a hint of roasted garlic ($2.95)\n\nIf you order through their site, some dishes are priced a little lower. The samosas are normally $5.95 and the tikka masala $14.95, so I saved $2.10 ordering through their site versus another delivery service. Just something to keep in mind if you want to get delivery from Gorkha.\n\nI adored the naan. If was soft with a nice chew. And a good amount of garlic, chilis, etc. The tikka masala had a nice heat as I asked for it extra spicy. And it was nice and creamy. But I did find the curry a touch too sweet. The momos were good. The wrapper had a nice chew and they were very meaty. Also, that tomato and sesame chutney was very tasty. The samosas were crispy on the outside and soft on the inside. Very happy they gave me extra mint chutney as one side was enough for one samosa. I had enough for both.\n\nDefinitely fulfilled my Indian food craving. Such a great option when I need something warm and satisfying.", "rating": 4, "date": "2018-08-20"}, {"excerpts": ["My all time favorite is Gorkha Organic Chicken Curry, Everest Chicken Momo, Goat Sekuwa and Kathmandu style Chowmein.\n", "\"Food here makes your taste buds happy.", "\""], "author": "Chanda B.", "review": "One of my favorite Nepalese restaurant.\nI mostly order from here and delivery service is always on time.\nMy all time favorite is Gorkha Organic Chicken Curry, Everest Chicken Momo, Goat Sekuwa and Kathmandu style Chowmein.\n\"Food here makes your taste buds happy.\"", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["We shared the Everest Chicken Momo for an appetizer then the Butter Chicken with Bullet Naan as our meal. ", "My husband and I were more than full."], "author": "Kari M.", "review": "Amazing food! Highly recommend sharing since the portions are large. We shared the Everest Chicken Momo for an appetizer then the Butter Chicken with Bullet Naan as our meal. My husband and I were more than full.", "rating": 5, "date": "2018-08-08"}, {"excerpts": ["We ordered the Everest chicken momo, bengal shrimp, chicken Tikka Kebab and goat Sekuwam. ", "Everything was absolutely delicious, savory and cooked just right; eg the chicken and goat were tender and moist.  "], "author": "Stephan A.", "review": "Our new favorite restaurant in the Inner Sunset.\n\nWe through we'd try a new experience. We ordered the Everest chicken momo, bengal shrimp, chicken Tikka Kebab and goat Sekuwam. Everything was absolutely delicious, savory and cooked just right; eg the chicken and goat were tender and moist.  This was my first time trying goat, and I'm sold.\n\nThe owner and the staff were very kind and gracious; true to their Nepalese kind. We'll definitely be back for more and this time we'll invite friends.\n\nThank you,\nStephan", "rating": 5, "date": "2018-01-07"}], "momo chili": [{"excerpts": ["Because we're crazy for momos, we ordered their momo chili with chicken, buff momo of Mahaboudha (buffalo), and sakahari (vegetable) momo (6 nicely sized momos per order). ", "We also got some curries on the side (no rice included--you'd have to order it separately). ", "The chili momo is likely deep fried and doused in their sweet, tangy chili sauce--a bit too similar to a sweet and sour sauce for our liking, but the filling was generous, chivey and herbal. ", "The buffalo momos are good for carnivores because they're pretty much just packed with meat, and contain the rich, juicy flavors you'd expect from buffalo. "], "author": "Jade V.", "review": "The Inner Sunset has a decent selection of Indian restaurants, but Gorkha is unique. Their menu is a mix of Indian and Himalayan dishes, including curries, momo dumplings, tandoori meats (and cauliflower), and rice dishes like biryani. Peruse the appetizer menu for some unique dishes. We called them up for takeout and they were very professional and friendly. Prompt order processing and well within the estimated time frame.\n\nBecause we're crazy for momos, we ordered their momo chili with chicken, buff momo of Mahaboudha (buffalo), and sakahari (vegetable) momo (6 nicely sized momos per order). We also got some curries on the side (no rice included--you'd have to order it separately). The chili momo is likely deep fried and doused in their sweet, tangy chili sauce--a bit too similar to a sweet and sour sauce for our liking, but the filling was generous, chivey and herbal. The buffalo momos are good for carnivores because they're pretty much just packed with meat, and contain the rich, juicy flavors you'd expect from buffalo. The veggie momos contained spinach, herbs, and paneer.\n\nAs far as the curries go, they are creamy, aromatic and not overly spicy, and generous with the fillings (e.g., goat meat, tofu). The Gorkha goat curry is a tomato and onion based curry, similar to a rogan josh curry, and the meat practically fell off the bone. The saag tofu curry had some heat and the tofu comes crisped.\n\nOverall, a good experience. There are cheaper options for Indian food in the Sunset, but Gorkha creates a bit more ambiance and is worth experiencing for some classics made with quality as well as unique dishes.", "rating": 4, "date": "2017-05-11"}, {"excerpts": ["My wife and i tried roasted cumin chicken, goat curry, garlic naan and momo chili. ", "Everythig is amazing. ", "If they work abit harder, this must dunk michelin star next year."], "author": "Rc K.", "review": "This restaurant is very unique, probably the best ambiance and service in sunset area. Their menu is huge and great selection of wines. What? Free wine on yelp check in! \nMy wife and i tried roasted cumin chicken, goat curry, garlic naan and momo chili. Everythig is amazing. If they work abit harder, this must dunk michelin star next year.", "rating": 5, "date": "2017-11-06"}], "sakahari momo": [{"excerpts": ["The Sakahari Momo's and veg pakora were delish!!!\n\n"], "author": "Vijey A.", "review": "We went with my pals in the city. The Sakahari Momo's and veg pakora were delish!!!\n\nThe chowmein was very tasty (like how it's made in Delhi/India with that special sauce).\n\nLoved the Malai kofta and tea...the staff are very friendly. No attitude, what's so ever!\n\nWill totally come back when I visit the city!", "rating": 5, "date": "2017-10-01"}], "gorkha chili chicken": [{"excerpts": ["The gorkha chili chicken appetizer and baingan bharta were my favorites. ", "Highly recommend!!"], "author": "Mary M.", "review": "The food is delicious and the service was superb! I can't remember the last time I've been to a restaurant where the staff was so thoughtful. They don't have beer/wine yet but we brought our own wine, no corking fee. The gorkha chili chicken appetizer and baingan bharta were my favorites. Highly recommend!!", "rating": 5, "date": "2017-05-11"}], "goat sekuwa": [{"excerpts": ["My all time favorite is Gorkha Organic Chicken Curry, Everest Chicken Momo, Goat Sekuwa and Kathmandu style Chowmein.\n", "\"Food here makes your taste buds happy.", "\""], "author": "Chanda B.", "review": "One of my favorite Nepalese restaurant.\nI mostly order from here and delivery service is always on time.\nMy all time favorite is Gorkha Organic Chicken Curry, Everest Chicken Momo, Goat Sekuwa and Kathmandu style Chowmein.\n\"Food here makes your taste buds happy.\"", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["Goat Sekuwa was excellent flavors and cooked to perfection and great compliments to chilled Beer.\n\n"], "author": "Meshy S.", "review": "Fantastic restaurant with great food !!!\nwonderfully setting Nepali restaurant served mouth watering buff Momo \n & Gorkha Chicken Curry. Goat Sekuwa was excellent flavors and cooked to perfection and great compliments to chilled Beer.\n\nA classy wine bar. The service was amazing.....fantastic.. will be there soon.", "rating": 5, "date": "2018-04-30"}, {"excerpts": ["The two of us had the Buffalo Momo, Goat Sekuwa and Dal Bhat Tarkari. ", "The Momo and Sekuwa were really standout dishes ", "and I highly recommend trying them on your first visit. ", "Their flavors were complex and had the right amount of spice. ", "The Dal Bhat Tarkari (platter) with chicken is also good and an excellent choice for sharing. ", "Served with lentils, rice, yogurt, chutney and naan, the entree gives a little bit of everything. ", "The serving sizes were perfect and it was reasonably priced. ", "This is a must try in the Sunset."], "author": "JN W.", "review": "The two of us had the Buffalo Momo, Goat Sekuwa and Dal Bhat Tarkari. The Momo and Sekuwa were really standout dishes and I highly recommend trying them on your first visit. Their flavors were complex and had the right amount of spice. The Dal Bhat Tarkari (platter) with chicken is also good and an excellent choice for sharing. Served with lentils, rice, yogurt, chutney and naan, the entree gives a little bit of everything. The serving sizes were perfect and it was reasonably priced. This is a must try in the Sunset.", "rating": 5, "date": "2018-02-18"}, {"excerpts": ["We tried the momo, goat sekuwa and chicken tikka masala. ", "Momo was juicy and the side sauce was great. ", "Goat sekuwa was very tender and just the right amount of spices. ", "Chicken was very soft, creamy and tasty. ", "Will visit again. ", "Probably the best South Asian food in Sunset."], "author": "Marcus R.", "review": "This place is great. Absolutely loved the food, very tasty. Staff are very friendly and service was pretty fast. We tried the momo, goat sekuwa and chicken tikka masala. Momo was juicy and the side sauce was great. Goat sekuwa was very tender and just the right amount of spices. Chicken was very soft, creamy and tasty. Will visit again. Probably the best South Asian food in Sunset.", "rating": 5, "date": "2017-11-21"}], "bengali shrimp": [], "aloo bodi tama": [{"excerpts": ["Also tasted the aloo bodi tama. ", "It was great! ", "I was inspired and tried to make it at home. ", "It just does not compare. ", "It's a great excuse to go back! ", ";) ", "Tasted the saag, too! "], "author": "Dixi S.", "review": "Awesome place! I had the tadka daal with rice. It was soooo good! They also served me a lot. I didn't finish my dish, but I got help finishing it. The best garlic naan ever! Also tasted the aloo bodi tama. It was great! I was inspired and tried to make it at home. It just does not compare. It's a great excuse to go back! ;) Tasted the saag, too! Also awesome! \n\nBtw, the service was also great. Very friendly, attentive and fast service. \n\nI gotta go back!!!", "rating": 5, "date": "2017-07-11"}], "chicken mulligatawny": [], "tomatarka sorba": [], "himalayan salad": [{"excerpts": ["The Himalayan Salad was more than enough for two of us to share, and the Naan are very good sized. ", "For us, Gorkha's fried rice and three Naan for four people left a lot to be taken home."], "author": "Lawrence R.", "review": "Have been wanting to try Gorkha Kitchen since they moved in, but we don't go out to eat much.\n\nVery friendly and helpful. We didn't experience the slow derive others have mentioned in their reviews, although I would call it \"leisurely\" as in \"they didn't hurry US.\"\n\nNisha was our waitress, and she was very friendly, knowledgeable and helpful. One member of our party has a problem with too much spice.  As everyone knows, no two people's terminology will work for both parties; what's \"mild\" and what's \"medium\"? For those who try the delicious chicken momos, Nisha called them \"mild,\" and for me they were. For our friend they were at the edge of her tolerance! When we chatted with Nisha about that, she said that with the exception of the Tandoor items, anything on the menu could be customized to taste, and she seemed totally capable of figuring out where on the \"heat scale\" a patron was.\n\nWarning: if you order for \"family style,\" make sure YOU are all in agreement before you order! :)\n\nAnother thing to note is that the portions are generous. The Himalayan Salad was more than enough for two of us to share, and the Naan are very good sized. For us, Gorkha's fried rice and three Naan for four people left a lot to be taken home.", "rating": 4, "date": "2018-06-04"}], "tandoori rack of lamb": [], "chicken tikka kebab": [{"excerpts": ["We ordered the Everest chicken momo, bengal shrimp, chicken Tikka Kebab and goat Sekuwam. ", "Everything was absolutely delicious, savory and cooked just right; eg the chicken and goat were tender and moist.  "], "author": "Stephan A.", "review": "Our new favorite restaurant in the Inner Sunset.\n\nWe through we'd try a new experience. We ordered the Everest chicken momo, bengal shrimp, chicken Tikka Kebab and goat Sekuwam. Everything was absolutely delicious, savory and cooked just right; eg the chicken and goat were tender and moist.  This was my first time trying goat, and I'm sold.\n\nThe owner and the staff were very kind and gracious; true to their Nepalese kind. We'll definitely be back for more and this time we'll invite friends.\n\nThank you,\nStephan", "rating": 5, "date": "2018-01-07"}], "tandoori cocktail": [], "half moon bay salmon tikka": [{"excerpts": ["Then we ordered the Half Moon Bay Salmon Tikka, Goat Biryani, and a garlic naan.\n\n"], "author": "The Bottomless Pi T.", "review": "My friend has passed by this place many times before. He was hesitant to try it, because the windows were blacked out and he could not see inside. Would he be eating alone, or was it full of satisfied diners?\n\nWe decided to bite the bullet and give them a try. I was glad to see there were many other people eating here with us. We were greeted warmly and escorted to a table. If you dine in the very back of the restaurant, you can sit low to the floor on cushions.\n\nI was expecting a straight Indian restaurant from how my friend described it. No, they also serve Himalayan/Nepalese food here. And that's a good thing.\n\nLooking at the menu, we started with the Buff Momo. Then we ordered the Half Moon Bay Salmon Tikka, Goat Biryani, and a garlic naan.\n\nIf you like pot stickers, you will love the Buff Momo. The big difference is that these are stuffed with buffalo meat, and served with a side of sesame chutney. I really liked it. I'm not sure if it tasted better with or without the chutney. Try it and decide for yourself.\n\nThe Goat Biryani came with ample portion of rice. The meat was rather bony, but what was there was very tender. We were both hoping for boneless chunks of goat.\n\nThe garlic naan was excellent. Just a little crispy, without being doughy.\n\nI was really looking forward to the Salmon Tikka, which was cooked in a tandoor. It's one of my favorite Indian dishes if cooked well. But this was disappointing. There was a good portion of fish on the plate, but that was about it. The salmon was definitely overcooked and a little on the dry side. Some of the vegetables on the platter were more than a little burnt on the edges too. \n\nI love the blackened onions which stick to the bottom of the metal platter when I order fajitas. Given the condition of the vegetables, I was expecting to pick off a lot of them. But there were only a few onions like that to scrape off.\n\nService was excellent, their staff were very friendly.", "rating": 3, "date": "2017-06-21"}], "tandoori paneer": [], "tandoori cauliflower": [{"excerpts": [";)\nBest goat curry and tandoori cauliflower!"], "author": "Angela P.", "review": "I highly recommend this restaurant. Great food, ambiance and very attentive service!! Come even to see the expensive dishware. ;)\nBest goat curry and tandoori cauliflower!", "rating": 5, "date": "2017-05-09"}, {"excerpts": ["We got samosas, tandoori cauliflower, chicken tikka masala, butter naan and garlic naan. ", "The food was delicious and everything had a ton of flavor. ", "The tikka masala sauce was creamy and had a unique touch to it, maybe cinnamon? ", "Whatever it was, it was delicious and I will definitely be back!"], "author": "Kelly K.", "review": "I live in the neighborhood and am so excited to have Gorkha nearby! The staff could not have been more friendly. They were very polite and attentive. \n\nWe got samosas, tandoori cauliflower, chicken tikka masala, butter naan and garlic naan. The food was delicious and everything had a ton of flavor. The tikka masala sauce was creamy and had a unique touch to it, maybe cinnamon? Whatever it was, it was delicious and I will definitely be back!", "rating": 5, "date": "2017-05-12"}], "gorkha organic chicken curry": [{"excerpts": ["My all time favorite is Gorkha Organic Chicken Curry, Everest Chicken Momo, Goat Sekuwa and Kathmandu style Chowmein.\n", "\"Food here makes your taste buds happy.", "\""], "author": "Chanda B.", "review": "One of my favorite Nepalese restaurant.\nI mostly order from here and delivery service is always on time.\nMy all time favorite is Gorkha Organic Chicken Curry, Everest Chicken Momo, Goat Sekuwa and Kathmandu style Chowmein.\n\"Food here makes your taste buds happy.\"", "rating": 5, "date": "2018-05-14"}], "roasted cumin chicken": [{"excerpts": ["My wife and i tried roasted cumin chicken, goat curry, garlic naan and momo chili. ", "Everythig is amazing. ", "If they work abit harder, this must dunk michelin star next year."], "author": "Rc K.", "review": "This restaurant is very unique, probably the best ambiance and service in sunset area. Their menu is huge and great selection of wines. What? Free wine on yelp check in! \nMy wife and i tried roasted cumin chicken, goat curry, garlic naan and momo chili. Everythig is amazing. If they work abit harder, this must dunk michelin star next year.", "rating": 5, "date": "2017-11-06"}], "saag chicken": [{"excerpts": ["Food here is excellent: had the bhindi, baingan burtha, malai kofta and saag chicken, as well as a selection of breads, some rice, and chai. ", "Delicious all round, not super heavy and really flavorsome. ", "Not too busy and easy to get a table. ", "Only small comment: restaurant was a little cool so bring a sweater (or order chai)"], "author": "Gaurav V.", "review": "Food here is excellent: had the bhindi, baingan burtha, malai kofta and saag chicken, as well as a selection of breads, some rice, and chai. Delicious all round, not super heavy and really flavorsome. Not too busy and easy to get a table. Only small comment: restaurant was a little cool so bring a sweater (or order chai)", "rating": 5, "date": "2018-07-16"}], "gorkhes goat curry": [], "coconutbraised lamb shank": [], "shrimp curry": [], "curry leaf fish": [], "tadka dal": [], "tofu saag": [{"excerpts": ["I get the vegan tofu saag, vegan Chana masala, and vegan aloo gobi with cumin rice and "], "author": "CeeCee Y.", "review": "I LOVE the vegan options here!!! AMAZING and I crave it all the time. It's like the first time every time, WONDERFUL! I get the vegan tofu saag, vegan Chana masala, and vegan aloo gobi with cumin rice and bullet naan and I ask them not to put butter on it. Amazing amazing! Thank you Gorkha!", "rating": 5, "date": "2018-09-18"}, {"excerpts": ["As a resturant manager My self I am very pickky when comes to personnel hygiene\nLove their Tofu saag & palak paner very much and they are very neat & clean .\n", "Love this place.", "Highly recommend to any one."], "author": "Anil P.", "review": "This is one of my best resturant when comes to Indo- Nepalese food in san francisco .\nAs a resturant manager My self I am very pickky when comes to personnel hygiene\nLove their Tofu saag & palak paner very much and they are very neat & clean .\nLove this place.Highly recommend to any one.", "rating": 5, "date": "2018-01-06"}, {"excerpts": ["(^_^) Tofu Saag "], "author": "Dan B.", "review": "airline steward hats but this ain't united\nso no worries you won't get dragged out the restaurant or falling scorpions\n\nowait \"m night himalayan\" is that the mantra?\nnah brah the wifi password; we're not savages\n\ndishes interesting mix of indian & himalayan adds up to more than the sum of its parts #twss\n\n(^_^) Tofu Saag $12 / Palak Paneer $14 ()\ncreamed spinach etc\n\n(^_^) Tandoori Chicken $14 ()\nssssssmokinnn!\n\n(^_^) Goat Biryani $15 ()\nbony bones but tender meat\n\n(^_^) \"Crispy Tubes\" Appetizer $0 ()\ndat light crunchy texture\n\n(-_^) Buff Momo Of Mahaboudha $10 ()\ngyoza skins could've been lil less doughy nbd\n\n(-_^) Bread Basket Assortment $7 ()\nvariety's the way to go\n\nplucking harp(?) music the whole time\nhometown handmade cloths across the walls\nq2chick employee\ni'd return to try more; maybe round up to 4", "rating": 3, "date": "2017-04-28"}, {"excerpts": ["I couldn't stop eating the tofu saag, I usually like my poultry "], "author": "Janetto L.", "review": "Off to a great start, Gorkha Kitchen!!\n\nI came last Friday during their grand opening (4.21.17) and it was flooded with neighborhood patrons ready to support this event.  From students/residents/doctors at UCSF to neighbors that grew up in The Sunset (myself included), it was a fun evening getting to try new food and meet new friends.  The generous owner even offered a special 3-course grand opening tasting for only $8!  It was the first time I had a chicken momo (reminds me of a XLB) and it was delicious!!  Each tasting came with 2 entrees (4 to choose from), along with rice and naan, ending the evening with dessert (2 to choose from).  Everything was tasty with the perfect amount of heat/spices given that I cannot take spicy.  I appreciated the offerings of not only quality organic meats but also the fresh taste on the vegetarian dishes as well.  I couldn't stop eating the tofu saag, I usually like my poultry but that was probably my favorite entree that evening. \n\nNot only were the prices great, but we left very full with food still left on the table.  It was a very satisfying meal and if you picked up a flier on your way out, there's a 25% off coupon for your next visit. :)\n\nAside from the usual table/chairs seating...towards the right hand back corner of the restaurant, there's also floor seating with comfy pillows and cushions where you take off your shoes.  We got to sit in this part of the room and it was fun!  Met a lot of new friends sitting in the same area, we chatted while waiting for our food.  The owner shared with us that this is more of a traditional Northern style and it's great, really brings family and friends together.   \n\nThe owner himself was overwhelmed with the outpouring support.  While most customers waited patiently to be seated or get their food/bill, some had tired looks on the faces.  I'm sure the special pricing drew a lot of attention with the crowd and while dinner service was a bit longer than usual, it was expected for the first night.  The owner and staff were all hustling, doing their best to make sure things were running smoothly.  They were very apologetic and the owner himself came over several times to each table to check on everyone.  That's very commendable given that I overheard him say they ran out of food twice already in the course of the day.  However, he kept going and making sure his supplies got replenished yet with the utmost quality of food.  \n\nI got a chance to look at their regular menu as well and am excited to come back and try other things on the menu.  They will be offering both a la carte and tasting menu which I think are both great ways to introduce customer that are unfamiliar to Himalayan/Nepalese cuisine.  They are currently still in the process of getting their beer and wine license but everything else seems to be falling into place.  \n\nCheers Gorkha for being a new addition to the neighborhood!", "rating": 4, "date": "2017-04-30"}, {"excerpts": ["amazing food! got samosas for appetizers which were huge and delicious, and got chicken tikka masala and got tofu saag which was something i hadn't tried before. ", "i absolutely loved the tofu saag, it has become my new favorite indian dish!\n", "the server was also very attentive and nice, will definitely be coming back!"], "author": "Natalie R.", "review": "amazing food! got samosas for appetizers which were huge and delicious, and got chicken tikka masala and got tofu saag which was something i hadn't tried before. i absolutely loved the tofu saag, it has become my new favorite indian dish!\nthe server was also very attentive and nice, will definitely be coming back!", "rating": 5, "date": "2018-03-21"}, {"excerpts": ["Tofu saag hit the spot! ", "I was so shocked to find vegan saag but glad I came across this spot! ", "Nice level of spice but for those of you who can't handle it ", "I would ask to make it less spicy. ", "Solid portion size too(for delivery). ", "Will definitely come back to this spot :)"], "author": "Raman D.", "review": "Tofu saag hit the spot! I was so shocked to find vegan saag but glad I came across this spot! Nice level of spice but for those of you who can't handle it I would ask to make it less spicy. Solid portion size too(for delivery). Will definitely come back to this spot :)", "rating": 5, "date": "2017-11-04"}], "assorted vegetable curry": [], "sweet potato masala": [{"excerpts": ["The sweet potato masala curry was fantastic! ", "Rich in flavor, thick and creamy, and just the right amount of kick for my liking, and tender sweet potatoes to balance the spice. ", "Ordered some garlic naan to eat it with. ", "The naan was a great size and freshly baked. ", "The vegetarian Biryani was so moist (I hate dry rice!) ", "and I loved the mushrooms and caramelized onions. ", "The only let down was the fish curry. ", "It was lacking in flavor for us and we wished it had some spice to it. ", "We didn't think it was worth the price tag of $20."], "author": "Lexi R.", "review": "The sweet potato masala curry was fantastic! Rich in flavor, thick and creamy, and just the right amount of kick for my liking, and tender sweet potatoes to balance the spice. Ordered some garlic naan to eat it with. The naan was a great size and freshly baked. The vegetarian Biryani was so moist (I hate dry rice!) and I loved the mushrooms and caramelized onions. The only let down was the fish curry. It was lacking in flavor for us and we wished it had some spice to it. We didn't think it was worth the price tag of $20.", "rating": 4, "date": "2018-07-24"}], "dal bhat tarkari platter": [{"excerpts": ["Don't miss the vegetarian momos or the dal bhat tarkari platter. ", "The cowherd kheer (Himalayan rice pudding) for dessert is a delight."], "author": "Kate S.", "review": "This place is fantastic -- a great addition to the neighborhood. We've been multiple times since it opened and everything has been delicious. Complex, fresh flavors in every dish we've tried, nothing too heavy, lots of vegetarian options, and the right amount of spice. Don't miss the vegetarian momos or the dal bhat tarkari platter. The cowherd kheer (Himalayan rice pudding) for dessert is a delight.", "rating": 5, "date": "2017-06-17"}], "chow mein kathmandustyle": [], "gorkhas rice": [], "cumin rice": [{"excerpts": ["I get the vegan tofu saag, vegan Chana masala, and vegan aloo gobi with cumin rice and "], "author": "CeeCee Y.", "review": "I LOVE the vegan options here!!! AMAZING and I crave it all the time. It's like the first time every time, WONDERFUL! I get the vegan tofu saag, vegan Chana masala, and vegan aloo gobi with cumin rice and bullet naan and I ask them not to put butter on it. Amazing amazing! Thank you Gorkha!", "rating": 5, "date": "2018-09-18"}, {"excerpts": ["Of course I had to order the cumin rice as well. ", "Let me tell you guys, I ate this dish like it was my last meal. ", "The lamb stew was thick and hearty, just the right amount of spices and heat to bring everything together. ", "I gluttonously ate that food   without a care in this world. ", "It's like I was transported into another world where only myself and the delicious food were the only survivors. ", "You have to try this restaurant. ", "Oh....delivery is spot on. ", "If they say they will be there at a certain time, they will be there to the minute. ", "I am impressed. ", "Two thumbs up!!!!"], "author": "Julie K.", "review": "Listen.....I had to come back to the same restaurant. Today, I ordered Lamb Rogan Josh with Cabuli Naan which is a lavendered Naan stuffed with cashews and raisins. Of course I had to order the cumin rice as well. Let me tell you guys, I ate this dish like it was my last meal. The lamb stew was thick and hearty, just the right amount of spices and heat to bring everything together. I gluttonously ate that food   without a care in this world. It's like I was transported into another world where only myself and the delicious food were the only survivors. You have to try this restaurant. Oh....delivery is spot on. If they say they will be there at a certain time, they will be there to the minute. I am impressed. Two thumbs up!!!!", "rating": 5, "date": "2018-07-31"}], "lemon broccolini rice": [], "bullet naan": [{"excerpts": ["*Bullet Naan: ", "Naan stuffed with chilies, garlic and cilantro ($2.95)\n"], "author": "Elena N.", "review": "I woke up starving! After a few nights of drinking, I needed some comfort food. Decided to order lunch / brunch from Gorkha Kitchen on Saturday, August 11th. I placed a delivery order through their website at 11:38am. It arrived at 12:47pm. I live in Outer Richmond.\n\n*Everest Chicken Momo: Chicken dumpling filled with minced chicken, herbs and spices served with homemade fire-roasted tomato and sesame chutney ($7.95)\n*Samosa: Mildly spiced potatoes and peas, served with extra mint sauce, 2 pcs, no tamarind sauce ($5.35)\n*Chicken Tikka Masala: Boneless white meat chicken cooked to perfection in the tandoor, then simmered Indian classic sauce, Extra spicy ($13.45)\n*Bullet Naan: Naan stuffed with chilies, garlic and cilantro ($2.95)\n*Garlic Naan: Fluffy Naan with cilantro and a hint of roasted garlic ($2.95)\n\nIf you order through their site, some dishes are priced a little lower. The samosas are normally $5.95 and the tikka masala $14.95, so I saved $2.10 ordering through their site versus another delivery service. Just something to keep in mind if you want to get delivery from Gorkha.\n\nI adored the naan. If was soft with a nice chew. And a good amount of garlic, chilis, etc. The tikka masala had a nice heat as I asked for it extra spicy. And it was nice and creamy. But I did find the curry a touch too sweet. The momos were good. The wrapper had a nice chew and they were very meaty. Also, that tomato and sesame chutney was very tasty. The samosas were crispy on the outside and soft on the inside. Very happy they gave me extra mint chutney as one side was enough for one samosa. I had enough for both.\n\nDefinitely fulfilled my Indian food craving. Such a great option when I need something warm and satisfying.", "rating": 4, "date": "2018-08-20"}, {"excerpts": ["bullet naan ", "and I ask them not to put butter on it. ", "Amazing amazing! ", "Thank you Gorkha!"], "author": "CeeCee Y.", "review": "I LOVE the vegan options here!!! AMAZING and I crave it all the time. It's like the first time every time, WONDERFUL! I get the vegan tofu saag, vegan Chana masala, and vegan aloo gobi with cumin rice and bullet naan and I ask them not to put butter on it. Amazing amazing! Thank you Gorkha!", "rating": 5, "date": "2018-09-18"}, {"excerpts": ["I always get the bullet naan. ", "I can't even remember what's on it; all I know is the waiter brings it out, there's a hole in my memory, then it's all gone ", "and I'm smiling. "], "author": "Shawn W.", "review": "My only previous experience with Himalayan food was Bini's Kitchen in FiDi, which was...okay. Gorkha was my second experience with Himalayan, that all-important opportunity where life-long opinions are made. One bad experience with a new cuisine is bad luck, two, of course, is a pattern. I am happy to report that Gorkha was my third experience with Himalayan, as well as my fourth. This place is delicious.\n\nThe decor is really cool. Understated, but it's got a style to it. The staff were attentive and prompt, no doubt helped by the fact that the place is always weirdly empty. I always get the bullet naan. I can't even remember what's on it; all I know is the waiter brings it out, there's a hole in my memory, then it's all gone and I'm smiling. And y'know what, I'm perfectly happy with that.\n\nThe first time I went, I got...something. I don't remember because my dining partner got the chicken biryani. I tried that and immediately forgot what I ordered. I remember my own dish being good, but the biryani was incredible. It was a delicious mix of rice, countless herbs and spices, tender chicken, and a spicy mystery sauce that sealed the whole thing together perfectly. I always ask for another serving or two of the sauce before I leave.\n\nThey've got a pretty classy-looking wine bar too, but I still think Franzia is palatable so I am absolutely not the person to comment on that.\n\nIn summary, delicious food, reasonable dinner prices, great service, and a huge menu full of delicious-sounding things. It's close to my place so I'll definitely be back again, but even if it weren't it'd be well worth a trip.", "rating": 5, "date": "2017-08-11"}, {"excerpts": ["We shared the Everest Chicken Momo for an appetizer then the Butter Chicken with Bullet Naan as our meal. ", "My husband and I were more than full."], "author": "Kari M.", "review": "Amazing food! Highly recommend sharing since the portions are large. We shared the Everest Chicken Momo for an appetizer then the Butter Chicken with Bullet Naan as our meal. My husband and I were more than full.", "rating": 5, "date": "2018-08-08"}, {"excerpts": ["Gorkha's Goat Curry (fantastic)\n4) Garlic and bullet naan (YUM)\n5) Coconut rice\n\n"], "author": "Mikey J.", "review": "Fantastic food and service. Best damn Chicken Tiki Masala I've ever had.\n\nThis restaurant is a welcome addition to the Sunset. Walking in you'll see there are both tables and traditional on the floor seating. Very cool and authentic. We sat on the floor tables and enjoyed it. The cushions are comfortable, but be warned you will want to stretch your legs out at some point.\n\nThe service is friendly and fast. The server recommendations when we went were on point. We ordered (among others)\n\n1) Chicken Tiki Masala (amazing, thick and flavorful sauce) \n2) Gobi Munchurian (delicious cauliflower dish)\n3) Gorkha's Goat Curry (fantastic)\n4) Garlic and bullet naan (YUM)\n5) Coconut rice\n\nAll the dishes were amazing. I highly recommend!!", "rating": 5, "date": "2017-06-25"}, {"excerpts": ["I tried the chicken tikka masala, vegetable biryani and bullet naan. ", "Everything was solidly good and quite fresh, but nothing extraordinary. ", "Our waiter was very attentive and nice as well. ", "Would definitely come back or order take out again!"], "author": "Sarah S.", "review": "Good service, clean place and solid food. I tried the chicken tikka masala, vegetable biryani and bullet naan. Everything was solidly good and quite fresh, but nothing extraordinary. Our waiter was very attentive and nice as well. Would definitely come back or order take out again!", "rating": 4, "date": "2018-07-02"}], "cabuli naan": [{"excerpts": ["Today, I ordered Lamb Rogan Josh with Cabuli Naan which is a lavendered Naan stuffed with cashews and raisins. "], "author": "Julie K.", "review": "Listen.....I had to come back to the same restaurant. Today, I ordered Lamb Rogan Josh with Cabuli Naan which is a lavendered Naan stuffed with cashews and raisins. Of course I had to order the cumin rice as well. Let me tell you guys, I ate this dish like it was my last meal. The lamb stew was thick and hearty, just the right amount of spices and heat to bring everything together. I gluttonously ate that food   without a care in this world. It's like I was transported into another world where only myself and the delicious food were the only survivors. You have to try this restaurant. Oh....delivery is spot on. If they say they will be there at a certain time, they will be there to the minute. I am impressed. Two thumbs up!!!!", "rating": 5, "date": "2018-07-31"}], "lachcha paratha": [], "tandoori roti": [], "bread basket assortment": [{"excerpts": ["Bread Basket Assortment $7 ()\nvariety's the way to go\n\nplucking harp(?"], "author": "Dan B.", "review": "airline steward hats but this ain't united\nso no worries you won't get dragged out the restaurant or falling scorpions\n\nowait \"m night himalayan\" is that the mantra?\nnah brah the wifi password; we're not savages\n\ndishes interesting mix of indian & himalayan adds up to more than the sum of its parts #twss\n\n(^_^) Tofu Saag $12 / Palak Paneer $14 ()\ncreamed spinach etc\n\n(^_^) Tandoori Chicken $14 ()\nssssssmokinnn!\n\n(^_^) Goat Biryani $15 ()\nbony bones but tender meat\n\n(^_^) \"Crispy Tubes\" Appetizer $0 ()\ndat light crunchy texture\n\n(-_^) Buff Momo Of Mahaboudha $10 ()\ngyoza skins could've been lil less doughy nbd\n\n(-_^) Bread Basket Assortment $7 ()\nvariety's the way to go\n\nplucking harp(?) music the whole time\nhometown handmade cloths across the walls\nq2chick employee\ni'd return to try more; maybe round up to 4", "rating": 3, "date": "2017-04-28"}]}