{"perrier mineral water": [], "orangina": [{"excerpts": ["On top of that the bottle of Orangina I ordered was nearly impossible to open."], "author": "Lynne A.", "review": "The egg rolls were crisp and delicious, but the sauce they come with is very sweet and looks like jam.  The prawn and noodles tasted ok but there were only 3-4 prawns!  The broccoli and oyster sauce had no flavor at all, was there supposed to be a flavor in the sauce?  The Singapore noodles tasted fine, but had a strange crumbly texture. On top of that the bottle of Orangina I ordered was nearly impossible to open.", "rating": 2, "date": "2016-01-20"}], "piece fried egg rolls": [], "piece fried shrimp": [], "fried quail": [{"excerpts": ["We ordered the set menu which included seafood bean cake soup, crispy fried chicken, ginger/green onion crab (yummy and finger licking good), Peking duck which came with the buns and was pretty tasty, fried quail which I haven't had in ages (crispy and delish), black mushrooms with tender greens, steamed fish, and crystal shrimp with mixed vegetables.  ", "Plus we added bitter melon with beef.  ", "The food satiated our hungry group and there was not much left except for the bones after all was said and done and no leftovers to take home!  ", "We were able to be full for $20 a person which included tax and tip (which is not calculated ahead of time).  ", "Dessert included oranges and fortune cookies.  ", "When I came home ", "I read the health score ", "and I said yikes, and ", "I don't have a cast iron stomach!"], "author": "Karen W.", "review": "Came here with a group for dinner before an event and I haven't been here in over 20 years!  This place has been around for eons and gets crowded.  A friend made reservations for dinner here for our party of 10.  We ordered one of the set menu dinners for a group of 8 and then added one dish.  \n\nWe ordered the set menu which included seafood bean cake soup, crispy fried chicken, ginger/green onion crab (yummy and finger licking good), Peking duck which came with the buns and was pretty tasty, fried quail which I haven't had in ages (crispy and delish), black mushrooms with tender greens, steamed fish, and crystal shrimp with mixed vegetables.  Plus we added bitter melon with beef.  The food satiated our hungry group and there was not much left except for the bones after all was said and done and no leftovers to take home!  We were able to be full for $20 a person which included tax and tip (which is not calculated ahead of time).  Dessert included oranges and fortune cookies.  When I came home I read the health score and I said yikes, and I don't have a cast iron stomach!", "rating": 4, "date": "2016-09-11"}], "fried squid": [{"excerpts": ["Then, was perturbed when I returned the ''awful'' wontons my friend ordered, as well as the overly battered fried squid.  ", "The ginger beef was good, but general cao's chicken was dried out meat and much too sweet.  ", "The green beans I ordered were not even delivered to the table.  ", "I have been to this restaurant many times and have brought many friends there, bringing them much money.  ", "I will never return to this restaurant, nor bring any friends.  ", "I recommend Red Jade restaurant on Church street for much friendlier service and very good moderately priced food."], "author": "Patrick B.", "review": "Until last night, Gourmet Carousel was my favorite moderately priced restaurant.  The server, obviously, did not like me the minute I asked for water, no ice, with lemon.  Then, was perturbed when I returned the ''awful'' wontons my friend ordered, as well as the overly battered fried squid.  The ginger beef was good, but general cao's chicken was dried out meat and much too sweet.  The green beans I ordered were not even delivered to the table.  I have been to this restaurant many times and have brought many friends there, bringing them much money.  I will never return to this restaurant, nor bring any friends.  I recommend Red Jade restaurant on Church street for much friendlier service and very good moderately priced food.", "rating": 1, "date": "2010-07-01"}], "piece salt and pepper chicken wings": [], "scallion pancake": [], "dried oyster lettuce cups": [], "bbq spareribs": [], "jellyfish salad": [], "deluxe wonton soup": [], "bbq pork wonton soup": [{"excerpts": ["and I shared a BBQ pork wonton soup (it was HUGE) and most of all, so soothing to the tummy in cold weather. ", "We also shared this big ole rice plate of salt and pepper prawns. "], "author": "Sharon B.", "review": "Fast service and yummy food that I didn't find too greasy or heavy, it was perfect for lunch, even with a big group. \n\nMy co-worker and I shared a BBQ pork wonton soup (it was HUGE) and most of all, so soothing to the tummy in cold weather. We also shared this big ole rice plate of salt and pepper prawns. They're not shy about giving lots of rice, which is good for leftovers later on for dinner. \n\nThe prawns were fried and not too oily, I even ate the head for the first time. I've been missing out all this time! Super crispy, good flavor and texture.\n\nI like how although the place is extremely busy, they continue to serve you, never forget you and it's always fast, but not rushed at all.\n\nThe price was awesome. I paid less than $10 for my share and I was more than content with my lunch.\n\nCan't wait to come back!", "rating": 4, "date": "2012-07-19"}, {"excerpts": ["Try the bbq pork wonton soup or the egg fo yung."], "author": "Misha F.", "review": "Inexpensive and nothing fancy.\n\nTry the bbq pork wonton soup or the egg fo yung.", "rating": 3, "date": "2009-01-19"}, {"excerpts": ["Salt n pepper chicken wings\nbbq pork wonton soup \nBeef Steak Cubes w/ tender greens\nCrispy Fried Chicken (half)\nflounder fillet with salt and pepper\ntomato beef chow mein\nchicken chow mein\nblack bean sauce beef chow fun\n\nMu-Shu and Generl Tsou's were close calls but suffer from occasional quality control problems."], "author": "Jeff E.", "review": "Goodbye Gourmet Carousel\n\nGourmet is right down the street from me and I'm lazy, as a result I've probably eaten there a couple hundred times over the years.  They've never gotten me ill (that's 1 star), and Ive grown to like some of their dishes (that's the other star), but as others have pointed out, some of their food is horrible, eg. their Mongolian beef with mushrooms (see Nitzan W.'s review for details).\n\nAs a public service I was just going to pass along the list of dishes I've been able to safely order. Then it dawned on me, I'M DONE WITH THIS PLACE.\n\nI'm done with:\nThe rude little old lady yelling \"GOHMAAAAYYY!\" when I phone in my order (see Lauren Y. or Josua P.); \nBeing told the kitchen is closed when I call at 9:15; \nThe nasty looks I get when I ask for a fork, napkin or some garlic chilli for my potstickers;\nNever being charged the same price twice for a dish;\nThe questionable cleanliness of the kitchen and the cooking staff;\nThe occasional slimy gross-out dish that goes right to the trash;\nAll the deep fried and sugar coated crap making me fat, clogging my arteries and raising my blood sugar.\n\nSo... Goodbye Gourmet Carousel\n\n******************************************\n\nI'll be eating anywhere else, but for those of you who find yourselves at the Gourmet Carousel here's my safe ordering list:\n\nPotstickers\negg roll (don't make the mistake of calling it a spring roll)\nSalt n pepper chicken wings\nbbq pork wonton soup \nBeef Steak Cubes w/ tender greens\nCrispy Fried Chicken (half)\nflounder fillet with salt and pepper\ntomato beef chow mein\nchicken chow mein\nblack bean sauce beef chow fun\n\nMu-Shu and Generl Tsou's were close calls but suffer from occasional quality control problems.", "rating": 2, "date": "2009-04-07"}], "chicken wonton soup": [], "beef wonton soup": [], "shrimp wonton soup": [{"excerpts": ["Great shrimp wonton soup. ", "I also like their pot stickers, pea sprouts with garlic and almost anything with pork!"], "author": "Lauren H.", "review": "Great basic Chinese restaurant. Try the salt & pepper shrimp if you don't mind having to remove the shell. Delicious! Great shrimp wonton soup. I also like their pot stickers, pea sprouts with garlic and almost anything with pork!", "rating": 4, "date": "2017-02-06"}], "hung tao yee fried won ton soup": [], "shredded duck fried wonton soup": [], "rice noodle soup with shredded pork": [], "west lake beef soup": [], "sliced pork and seaweed soup": [], "salted egg pork and mustard green soup": [], "winter melon with diced pork soup": [{"excerpts": ["- Wrapped Chicken appetizer\n- Salted egg with pork and mustard green soup\n- Winter melon with diced pork soup\n- Prawns in Lobster sauce\n- Clams with ginger and scallions\n- Chinese style beef steak cubes\n- BBQ pork\n- Scrambled egg and chinese sausage over rice ", "*", "** REALLY GOOD.\n", "So go, and order these yummy things.  ", "You won't regret it."], "author": "Red F.", "review": "I've read some of the negative reviews of this Cantonese restaurant, and with Gourmet Carousel, it's all about knowing what to order.  Which, yes, I know, at an excellent restaurant you should be able to order anything and be satisfied, but, this is not an excellent restaurant.  It is very tasty if you order the right food, and farely cheap.  For instance, the lo mein and chow mein are not so good.  And if you are looking for typical sesame chicken, they don't have it.  Their's is not covered in sauce, the sauce comes on the side.  Apparently that bothers some people.  BUT let me tell you, the salt and pepper crab is so delicious that if a close friend said to me 'Red, I am so hungry, but I am sick and tired of all the restaurants in my area, and I don't feel like making food, what should I do?\"  I would send them straight to Gourmet Carousel for the salt and pepper crab.  It's that good.  Other things that are really good:\n\n- Wrapped Chicken appetizer\n- Salted egg with pork and mustard green soup\n- Winter melon with diced pork soup\n- Prawns in Lobster sauce\n- Clams with ginger and scallions\n- Chinese style beef steak cubes\n- BBQ pork\n- Scrambled egg and chinese sausage over rice *** REALLY GOOD.\nSo go, and order these yummy things.  You won't regret it.", "rating": 3, "date": "2007-07-03"}], "chicken corn soup": [], "crab corn soup": [], "fish maw and crab soup": [], "dried scallop soup": [], "moo shu chicken": [], "moo shu beef": [], "moo shu shrimp": [], "moo shu vegetable": [], "gourmet special over rice plate": [], "seafood over rice plate": [], "shrimp in lobster sauce over rice plate": [], "shrimp and chinese greens over rice plate": [], "scrambled egg shrimp over rice plate": [], "salt and pepper shrimp over rice plate": [], "salt and pepper rock cod filet over rice plate": [], "sweet and sour rock cod filet over rice plate": [], "rock cod filet with chinese green over rice plate": [], "salt and pepper squid over rice plate": [], "squid with preserved vegetables over rice plate": [], "squid with black bean sauce over rice plate": [], "squid with chinese green over rice plate": [], "mongolian beef over rice plate": [], "broccoli beef over rice plate": [], "beef with chinese greens over rice plate": [], "beef with tofu over rice plate": [], "curry beef over rice plate": [], "beef with bitter melon over rice plate": [], "tomato beef over rice plate": [], "beef with eggplant over rice plate": [], "scrambled egg and beef over rice plate": [], "mongolian chicken over rice plate": [], "general tsos chicken over rice plate": [], "lemon chicken over rice plate": [], "sweet and sour chicken over rice plate": [], "honey glazed chicken over rice plate": [], "chicken with string bean over rice plate": [], "chicken with bitter melon over rice plate": [], "chicken with black mushrooms over rice plate": [], "chicken with chinese greens over rice plate": [], "curry chicken over rice plate": [], "chicken with fresh mushrooms over rice plate": [], "cashew chicken over rice plate": [], "kung pao chicken over rice plate": [], "broccoli chicken over rice plate": [], "fresh pork with chinese green over rice plate": [], "shredded pork with preserved pickle over rice plate": [], "sweet and sour pork over rice plate": [], "bbq pork with chinese green over rice plate": [], "roast duck and bbq pork with chinese greens over rice plate": [], "roast duck with chinese green over rice plate": [], "salt and pepper spareribs over rice plate": [], "mandarin spareribs over rice plate": [], "black bean sauce spareribs over rice plate": [], "ma po tofu over rice plate": [], "ground pork with eggplant over rice plate": [], "scrambled egg chinese sausage over rice plate": [], "beef stew with chinese greens over rice plate": [], "pork belly with preserved vegetables over rice plate": [], "braised tofu and lamb stew over rice plate": [], "braised tofu over rice plate": [], "mixed vegetables over rice plate": [], "garlic string beans over rice plate": [], "chinese green and black mushrooms over rice plate": [], "baby shrimp fried rice": [], "yang chow fried rice": [{"excerpts": ["We normally get the pea shoots with garlic, yang chow fried rice, and some sort of meat."], "author": "Stephanie D.", "review": "Tasty and reasonably priced Chinese food. Husband and I like to get take out from here for a quick & easy dinner. We normally get the pea shoots with garlic, yang chow fried rice, and some sort of meat.", "rating": 4, "date": "2018-09-01"}, {"excerpts": ["Thumbs up: chinese broccoli beef, yang chow fried rice, pot stickers, foil-wrapped chicken\n\nThumbs down: kung pao shrimp, every kind of soup"], "author": "Jenny T.", "review": "I come here way too much. Waaaay too much. It doesn't help that I live nearby and can run out in my pajamas.\n\nThumbs up: chinese broccoli beef, yang chow fried rice, pot stickers, foil-wrapped chicken\n\nThumbs down: kung pao shrimp, every kind of soup", "rating": 3, "date": "2010-03-24"}, {"excerpts": ["My personal favorites are the Yang Chow Fried Rice and the Singapore Rice Noodles, both packed to the brim of their 32 oz. ", "takeout boxes.  ", "I've only dined-in once ", "and I ordered the dinner combination special.  ", "Not on par with the aforementioned rice and noodle plates but still great value.\r\n\r\n", "The good:\r\nPrice, portions, speed, variety, decent for large groups (I always see at least one party of 6+ on nights), possibly BYOW w/ no corkage fee, good mix of authentic and ", "\"Americanized\" Chinese dishes\r\n\r\n", "The bad:\r\nambiance and decor or nothing to write home about\r\n\r\n", "The notable:\r\nmixed clientele representative of diverse menu - there's something for everyone\r\n\r\n", "The Junius pick:\r\n", "Yang Chow Fried Rice\r\n\r\n", "The person you're dating:\r\nShould not be brought here.\r\n\r\n", "The significant other/spouse", ":\r\nShould come with you to pick up the order while you're double-parked on Pine.\r\n\r\n", "The last time I was there:\r\nApril 2, 2006\r\n\r\n", "The number of times I've been there:\r\nMore than 30."], "author": "Junius H.", "review": "The category:\r\nCheap eats\r\n\r\nThe seven-word skinny:\r\nInexpensive, plentiful, Chinese takeout for under five\r\n\r\nThe review:\r\nIt's a (insert adverse SF weather condition here) night and you're starving but don't want to cook or go out to eat.  Worse yet, a cursory glance at the wallet indicates that you have but a single Abraham Lincoln to your name.  Fear not, though, 'cuz Gourmet Carousel will fill your stomach with good food with change for your five bucks to boot!\r\n\r\nI've been ordering takeout from \"Gouhmay\" (as phone regulars have come to know it as) for nearly a year now and in terms of value, it's hard to top.  My personal favorites are the Yang Chow Fried Rice and the Singapore Rice Noodles, both packed to the brim of their 32 oz. takeout boxes.  I've only dined-in once and I ordered the dinner combination special.  Not on par with the aforementioned rice and noodle plates but still great value.\r\n\r\nThe good:\r\nPrice, portions, speed, variety, decent for large groups (I always see at least one party of 6+ on nights), possibly BYOW w/ no corkage fee, good mix of authentic and \"Americanized\" Chinese dishes\r\n\r\nThe bad:\r\nambiance and decor or nothing to write home about\r\n\r\nThe notable:\r\nmixed clientele representative of diverse menu - there's something for everyone\r\n\r\nThe Junius pick:\r\nYang Chow Fried Rice\r\n\r\nThe person you're dating:\r\nShould not be brought here.\r\n\r\nThe significant other/spouse:\r\nShould come with you to pick up the order while you're double-parked on Pine.\r\n\r\nThe last time I was there:\r\nApril 2, 2006\r\n\r\nThe number of times I've been there:\r\nMore than 30.", "rating": 3, "date": "2006-03-13"}, {"excerpts": ["their vegetables are very good and love the yang chow fried rice. ", "big portion, cheap and the place is pretty clean."], "author": "Nelle A.", "review": "not too bad of a place to go if you're craving for some chinese food. please DO NOT, i repeat DO NOT order the salted pork chop/ribs. it's just too dry, chewy & over fried! i'm glad we have ordered the rock cod with sweet & sour sauce (which wasn't bad at all) so i was dipping my pork  on the sauce...heheheeh...their vegetables are very good and love the yang chow fried rice. big portion, cheap and the place is pretty clean.", "rating": 3, "date": "2006-07-07"}], "chicken with salted fish fried rice": [], "canton dinner": [], "peking dinner": [{"excerpts": ["We decided to splurge and go with the preset Peking Dinner option for 3 people which is $12/person. ", "It comes with Hot and Sour Soup, Fried Shrimp, Kung Pao Chicken, Monglian Beef, Pork Fried Rice, and Sweet & Sour Spareribs. ", "Hah, if by 3 people they meant dinner for 8 people, then yes this was enough food. ", "The three of us stuffed ourselves silly and we hardly made a dent. ", "The to-go boxes we left the restaurant with seriously weighed like 10 lbs. ", "Looks likeI will be eating chinese leftovers for the rest of week."], "author": "Debbie C.", "review": "I'm a fan of this place because: \na) it's 2 blocks from my apt\nb) it's cheap \nc) the portions are massive \nd) they have good fried shrimp\n\n...the answer is e) all of the above. A few friends and I hit Gourmet Carousel to celebrate Chinese New Year. We decided to splurge and go with the preset Peking Dinner option for 3 people which is $12/person. It comes with Hot and Sour Soup, Fried Shrimp, Kung Pao Chicken, Monglian Beef, Pork Fried Rice, and Sweet & Sour Spareribs. Hah, if by 3 people they meant dinner for 8 people, then yes this was enough food. The three of us stuffed ourselves silly and we hardly made a dent. The to-go boxes we left the restaurant with seriously weighed like 10 lbs. Looks likeI will be eating chinese leftovers for the rest of week.", "rating": 4, "date": "2009-01-27"}], "salt and pepper shrimp": [{"excerpts": ["Black bean clams, ginger and green onion crab, lobster lo mein, fried chicken, minced squab in lettuce leaf, fried chicken, ma poh tofu, Peking duck, fried rice, soups, salt and pepper shrimp (with heads), chicken won ton, whole steamed fish, four season green beans are just a sample of our favorites. \n\n"], "author": "Joanna S.", "review": "My husband and I have been enjoying the food here since about 1983.  It's not fusion or trendy, but it is excellent value, made to order and very good quality.  \n\nThe menu is quite extensive. Black bean clams, ginger and green onion crab, lobster lo mein, fried chicken, minced squab in lettuce leaf, fried chicken, ma poh tofu, Peking duck, fried rice, soups, salt and pepper shrimp (with heads), chicken won ton, whole steamed fish, four season green beans are just a sample of our favorites. \n\nParking can be challenging, but the Van Ness end of the California Street cable car is only two blocks away. It is also walking distance to the opera house or symphony hall for a quick bargain pre-performance meal.  They also deliver.\n\nI think eating here is one of the things my twins will miss most about going away for college.", "rating": 5, "date": "2014-09-07"}, {"excerpts": ["It comes with a tofu and seafood soup, black bean clams, scallop and shrimp dish with vegetables,  salt and pepper shrimp, a really big whole fish, and fortune cookies and oranges. ", "Everything was very delicious. ", "The only thing I didn't like is we didn't order rice, but he assumed we did and bought it. ", "I thought it came with the meal, but we got charged for it. ", "That's not right because what if we didn't want to eat rice. ", "As we're facing a drought now, I also thought that it's unnecessary to give us a second dish without asking. ", "Our dishes weren't full of seafood shells yet. ", "Besides these two assumptions, everything else was great."], "author": "Jennifer T.", "review": "I came here as a kid with my parents and aunt's family. I came here again with my parents to celebrate my dad's birthday. It was an one hour walk from my work. I had a very big appetite by the time I arrived! They gave us some menus, but I asked where is the family dinner menu? Good thing I asked! There is a seafood combo for $48 estimated to feed 4 people. It comes with a tofu and seafood soup, black bean clams, scallop and shrimp dish with vegetables,  salt and pepper shrimp, a really big whole fish, and fortune cookies and oranges. Everything was very delicious. The only thing I didn't like is we didn't order rice, but he assumed we did and bought it. I thought it came with the meal, but we got charged for it. That's not right because what if we didn't want to eat rice. As we're facing a drought now, I also thought that it's unnecessary to give us a second dish without asking. Our dishes weren't full of seafood shells yet. Besides these two assumptions, everything else was great.", "rating": 5, "date": "2015-08-13"}, {"excerpts": ["Salt and Pepper shrimp come with head and tail because for Chinese its more to show the freshness. ", "The shrimp aren't really deveined either, so if that really bothers you, don't order shrimp, but it does taste good.\n", "I'd recommend ordering from that one sheet family menu, if you have 3 or more people. "], "author": "Pete L.", "review": "Yes I've had better Chinese food, but for the price, it's really quite good.\nBottomline, its cheap, the restaurant is clean, and the quality of what I've eaten so far, well exceeds what you are paying for. Its very casual and a little old school so don't come here expecting an elegant dining experience. Come here with low maintenance friends to get a really reasonably priced family style meal.\n\nYes some of the staff is inattentive and  can even seem a little surly at times, but the service is more old school Chinese. They are more about trying to be efficient than giving you warm fuzzies. I actually find it kind of funny, and again, this place is cheap, so don't expect 5 star service.\n\nYes the decor is lacking but its not dirty and the flat screen tv is bonus.\nIts definitely not a first date kind of place. \n\nSalt and Pepper shrimp come with head and tail because for Chinese its more to show the freshness. The shrimp aren't really deveined either, so if that really bothers you, don't order shrimp, but it does taste good.\nI'd recommend ordering from that one sheet family menu, if you have 3 or more people. No not the first page of the bigger menu, its the laminated one that has Chinese on one side.\n\n As a rule of thumb for any Chinese place, I usually order from the Chinese menu (sometimes in Chinese on the wall) if there is one because I hate to say it but many times we treat our people or those that recognize...a little better. That and many of the cooks come from HK or the mainland with training in more authentic dishes, so they aren't as good or take as much pride at making Americanized dishes.\nThat being said I've never ordered some of the more common staples here like sweet and sour anything, Mongolian, beef or potstickers so I can't say if its good or bad.\nTheir fish is pretty good if you don't mind it with the head on -Again..the whole freshness thing. Steamed or pan fried with green onion, both pretty good.", "rating": 4, "date": "2007-07-01"}], "stir fried shrimp with scallions": [], "honey walnut shrimp": [], "crystal shrimp with mixed vegetables": [{"excerpts": ["We ordered the set menu which included seafood bean cake soup, crispy fried chicken, ginger/green onion crab (yummy and finger licking good), Peking duck which came with the buns and was pretty tasty, fried quail which I haven't had in ages (crispy and delish), black mushrooms with tender greens, steamed fish, and crystal shrimp with mixed vegetables.  ", "Plus we added bitter melon with beef.  ", "The food satiated our hungry group and there was not much left except for the bones after all was said and done and no leftovers to take home!  ", "We were able to be full for $20 a person which included tax and tip (which is not calculated ahead of time).  ", "Dessert included oranges and fortune cookies.  ", "When I came home ", "I read the health score ", "and I said yikes, and ", "I don't have a cast iron stomach!"], "author": "Karen W.", "review": "Came here with a group for dinner before an event and I haven't been here in over 20 years!  This place has been around for eons and gets crowded.  A friend made reservations for dinner here for our party of 10.  We ordered one of the set menu dinners for a group of 8 and then added one dish.  \n\nWe ordered the set menu which included seafood bean cake soup, crispy fried chicken, ginger/green onion crab (yummy and finger licking good), Peking duck which came with the buns and was pretty tasty, fried quail which I haven't had in ages (crispy and delish), black mushrooms with tender greens, steamed fish, and crystal shrimp with mixed vegetables.  Plus we added bitter melon with beef.  The food satiated our hungry group and there was not much left except for the bones after all was said and done and no leftovers to take home!  We were able to be full for $20 a person which included tax and tip (which is not calculated ahead of time).  Dessert included oranges and fortune cookies.  When I came home I read the health score and I said yikes, and I don't have a cast iron stomach!", "rating": 4, "date": "2016-09-11"}], "shrimp with lobster sauce": [], "cashew shrimp": [], "shrimp with hot sauce": [], "curry shrimp": [], "clams with black bean sauce": [{"excerpts": ["Of note, their clams with black bean sauce and their fried chicken are both really good.  "], "author": "Winnie C.", "review": "Inexpensive Chinese food for Chinese people.\n\nYes, there is a distinction between Chinese food for the general public and Chinese food for Chinese people.  More specifically, Gourmet Carousel is for Southern (Cantonese) folks.  Their specialty is NOT pot stickers or green onion pancakes.  I think they only carry those items because a lot of people expect all Chinese restaurants to carry them.\n\nI've been eating here pretty regularly for the most part.  One of the only drawback is the difficulties with parking around the neighborhood.\n\nFor dinners, stick with their set menus.  There's always a good variety of stuff to satisfy.  Of note, their clams with black bean sauce and their fried chicken are both really good.  Their salt and pepper prawns may take some getting used to for some as they come complete with legs, head and everything in between.\n\nFor lunch, I really really really like their dry fried beef chow fun.  It's one of the best ANYWHERE.  Lately, I've also been liking their prawns with scrambled egg over rice.  The eggs are soft scrambled just the way I like them (a bit runny).", "rating": 4, "date": "2007-10-02"}, {"excerpts": ["Get my dad's favorite, which is the clams with black bean sauce."], "author": "Abby N.", "review": "I grew up eating at this restaurant and used to think it was great.  Fast forward to today and I realize that it's just ok.  You get good portions, it's inexpensive, and the food is alright, but the staff (who's been there since I was a kid) aren't the friendliest.  Then again, after so many years, I'm used to them.\n\nGet my dad's favorite, which is the clams with black bean sauce.", "rating": 3, "date": "2009-09-27"}], "clams with ginger and scallions": [{"excerpts": ["- Wrapped Chicken appetizer\n- Salted egg with pork and mustard green soup\n- Winter melon with diced pork soup\n- Prawns in Lobster sauce\n- Clams with ginger and scallions\n- Chinese style beef steak cubes\n- BBQ pork\n- Scrambled egg and chinese sausage over rice ", "*", "** REALLY GOOD.\n", "So go, and order these yummy things.  ", "You won't regret it."], "author": "Red F.", "review": "I've read some of the negative reviews of this Cantonese restaurant, and with Gourmet Carousel, it's all about knowing what to order.  Which, yes, I know, at an excellent restaurant you should be able to order anything and be satisfied, but, this is not an excellent restaurant.  It is very tasty if you order the right food, and farely cheap.  For instance, the lo mein and chow mein are not so good.  And if you are looking for typical sesame chicken, they don't have it.  Their's is not covered in sauce, the sauce comes on the side.  Apparently that bothers some people.  BUT let me tell you, the salt and pepper crab is so delicious that if a close friend said to me 'Red, I am so hungry, but I am sick and tired of all the restaurants in my area, and I don't feel like making food, what should I do?\"  I would send them straight to Gourmet Carousel for the salt and pepper crab.  It's that good.  Other things that are really good:\n\n- Wrapped Chicken appetizer\n- Salted egg with pork and mustard green soup\n- Winter melon with diced pork soup\n- Prawns in Lobster sauce\n- Clams with ginger and scallions\n- Chinese style beef steak cubes\n- BBQ pork\n- Scrambled egg and chinese sausage over rice *** REALLY GOOD.\nSo go, and order these yummy things.  You won't regret it.", "rating": 3, "date": "2007-07-03"}], "piece steamed oyster": [], "braised oysters with ginger and scallions": [], "scallops with fresh black mushrooms": [], "scallops with plum sauce": [], "salt and pepper squid": [{"excerpts": ["My personal favorite dish is the salt and pepper squid, but none of the food is bad. ", "Just come with the appropriate expectations-- this place is neither fancy nor creative. ", "It is reliable, and a good value, however."], "author": "Walter P.", "review": "When my office was in the neighborhood, I used to eat lunch here almost every day. Since I've moved on, I still come back every once in a while when I happen to be in the area.\n\n What this place offers is large portions of  Chinese food at rock-bottom prices. It is very popular, so the food doesn't just sit around. It always tastes fresh, if occasionally on the greasy side.\n\nMy personal favorite dish is the salt and pepper squid, but none of the food is bad. Just come with the appropriate expectations-- this place is neither fancy nor creative. It is reliable, and a good value, however.", "rating": 3, "date": "2008-12-12"}], "squid with pickled chinese cabbage": [], "squid with ginger and scallions": [{"excerpts": ["Really good pot stickers, squid with ginger and scallions, solid chow mein, but what really stands out and I find surprising is hardly mentioned in the reviews I've scanned is the God-like roast duck: lots more pieces than most restaurants serve, and what's more, 3/4 of them actually have meat on them, delicious, tender, almost paté-like texture.\n\n"], "author": "Ultiminio P.", "review": "I've been here quite a few times, always take out.  Fine value.  Really good pot stickers, squid with ginger and scallions, solid chow mein, but what really stands out and I find surprising is hardly mentioned in the reviews I've scanned is the God-like roast duck: lots more pieces than most restaurants serve, and what's more, 3/4 of them actually have meat on them, delicious, tender, almost paté-like texture.\n\nLame alert: Smallish, unsucculent prawns are the epitome of mediocrity.\n\nMIA: Belligerent but fun little Aqua-net headed matriarch who used to command the front desk, the phone and of course, the money, all the money.  Favorite nostalgic phone conversation:\n\n     Me:   One more thing, no tofu in the chow mein, please-\n     Her:  No tofu in chow mein!!!  We don't put tofu in chow mein!!!\n     Me:   OK, it's just last time I had some tofu in my chow-\n     Her:   No tofu in chow mein!!!  We don't put tofu in chow mein!!!", "rating": 4, "date": "2009-01-27"}], "pan fried flounder": [{"excerpts": ["We had the pan fried flounder (cripy and delicious, although the sauce on top was thicker than what I'm used to), sizzling rice soup, and spicy eggplant with pork (absurdly huge dish).  ", "I will definitely be back!"], "author": "Cristina C.", "review": "Gourmet Carousel is great for what it is--inexpensive Chinese comfort food.  They have most Chinese dishes that you can think of on the menu, and except for the seafood dishes, nothing is over $10.  I haven't been for lunch, but the portions were enormous.  Two entrees and soup definitely could have fed 3 people.  The service was also pretty standard Chinese restaurant service, plus our waiter spoke English, which was helpful. \n\nWe had the pan fried flounder (cripy and delicious, although the sauce on top was thicker than what I'm used to), sizzling rice soup, and spicy eggplant with pork (absurdly huge dish).  I will definitely be back!", "rating": 4, "date": "2009-01-11"}], "salt and pepper flounder fillet": [], "seafood birdsnest": [], "sliced abalone with black mushrooms": [], "sweet and sour rock cod fillet": [{"excerpts": ["The sweet and sour rock cod fillet is crispy and greasless with a well balanced sweet and sour sauce and fresh pineapple, bell pepper, and onion.  ", "I loved the free small order of winter melon soup with fresh, soft winter melon (a little bidder but good,) pork, and vegetables in a savory broth.  ", "The steamed rice is excellent; not soggy but firm.  "], "author": "Brian S.", "review": "From the outside, this place is not much for looks, but once inside, carpeting, table cloths, dark wood, and mirrors astonish one.!  I stopped in last night and had some excellent Cantonese cuisine.  The pot stickers, a little doughy, are excellent and crispy golden with a wonderful ground pork, ginger, and cabbage filling; perfect topped with a little vinegary and soy sauce on top.  The sweet and sour rock cod fillet is crispy and greasless with a well balanced sweet and sour sauce and fresh pineapple, bell pepper, and onion.  I loved the free small order of winter melon soup with fresh, soft winter melon (a little bidder but good,) pork, and vegetables in a savory broth.  The steamed rice is excellent; not soggy but firm.  My mother loved her chicken with green beans which I will have to try.  For $26.00, we definitely got our money's worth.  The service is friendly and efficient.  So, for excellent Cantonese cuisine at rock bottom prices with friendly service in a clean atmosphere, Gourmet Carousel cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2011-02-09"}], "black pepper baby beef ribs": [], "beef and green beans": [{"excerpts": ["The beef and green beans was tasty with lots of meat. ", "The pot stickers here is always better than the other Chinese restaurants with the right mix of veggies and pork. ", "The best dish is the fried wonton in duck soup - not the healthiest of dishes, but excellent.  ", "The dried fried jalapeño pork or chicken wings are "], "author": "Jon H.", "review": "Always the best Chinese food for the money.  The beef and green beans was tasty with lots of meat. The pot stickers here is always better than the other Chinese restaurants with the right mix of veggies and pork. The best dish is the fried wonton in duck soup - not the healthiest of dishes, but excellent.  The dried fried jalapeño pork or chicken wings are ways crispy\n\nThe nice thing is they do allow just about any substitution.  Our family always picks this restaurant as everybody has their favorites, and it always hits the spot.", "rating": 5, "date": "2014-04-23"}], "broccoli beef": [{"excerpts": ["My co-worker & I usually opt for the broccoli beef over fried rice and the Mongolian Beef chow mein.  ", "These two dishes have tons of flavor and will seriously leave you full.  "], "author": "Sabrina J.", "review": "Gourmet is ALWAYS crackin, no matter what time in the afternoon I come in for takeout. That in itself should tell you that their Chinese food is pretty tasty.\n\nGourmet has their variety of appetizers, soups, seafood, rice plates, e.t.c.  My co-worker & I usually opt for the broccoli beef over fried rice and the Mongolian Beef chow mein.  These two dishes have tons of flavor and will seriously leave you full.  Just a note, the Mongolian Beef chow mein is a bit on the spicy side. \n\nI have also tried their vegetable egg roles and salt/pepper spare ribs. WOAH! You definitely need to try the ribs.They are perfectly fried with a great amount of seasoning. I think they use cayenne pepper on them so that can be a but overpowering at times.\n\nGourmet is pretty reasonably priced.  Keep in mind though, meat substitutes are an extra charge.  For some odd reason they charge you almost an extra $2 to add chicken to your chow mein vs. the Mongolian, PASS! To me, that is a tad bit ridiculous when each dish is about $7-$8 as is.\n\nOverall, Gourmet is a pretty decent value of food and is perfect if your looking for a good tasting, quick meal!", "rating": 3, "date": "2016-05-05"}, {"excerpts": ["I don't think their western influenced dishes were that great, fried chicken w/ sweet syrup lemon or orange flavored, general, sesame, broccoli beef, etc. ", "Tastes all the same. ", "I dare you to evolve your palette."], "author": "Janno L.", "review": "TRY their Chef's Specials, they're always great. It's good to try new things sometimes.\n\nI enjoyed their pork-belly dish, the cloud-ear fungus / black fungus dish, lamb claypot, and the bitter melon.\n\nJust have to know what to order. \n\nI don't think their western influenced dishes were that great, fried chicken w/ sweet syrup lemon or orange flavored, general, sesame, broccoli beef, etc. Tastes all the same. I dare you to evolve your palette.", "rating": 5, "date": "2016-10-11"}, {"excerpts": ["Ordered: \n\nFried Wontons\nPotstickers\nHoney Chicken\nSauteed String Bean \nBuddha Delight\nBroccoli Beef\nSoy Sauce Chow Mein\nChicken Fried Rice"], "author": "Connie J.", "review": "Great food and great service.  Ordered catering from them to service about 25 people.  The food was fresh and tasty.  Would love to try out all the yummy food in their restaurant.  \n\nOrdered: \n\nFried Wontons\nPotstickers\nHoney Chicken\nSauteed String Bean \nBuddha Delight\nBroccoli Beef\nSoy Sauce Chow Mein\nChicken Fried Rice", "rating": 5, "date": "2017-01-26"}, {"excerpts": ["Thumbs up: chinese broccoli beef, yang chow fried rice, pot stickers, foil-wrapped chicken\n\nThumbs down: kung pao shrimp, every kind of soup"], "author": "Jenny T.", "review": "I come here way too much. Waaaay too much. It doesn't help that I live nearby and can run out in my pajamas.\n\nThumbs up: chinese broccoli beef, yang chow fried rice, pot stickers, foil-wrapped chicken\n\nThumbs down: kung pao shrimp, every kind of soup", "rating": 3, "date": "2010-03-24"}, {"excerpts": ["Each time we've tried the walnut prawns, mu-shu pork, pea sprouts, and broccoli beef, we had more than enough leftovers to last for a few servings."], "author": "Pelle Y.", "review": "Gourmet Carousel is the place to go to get pretty decent Chinese take-out food.  And pricewise, it's a good deal too.  Each time we've tried the walnut prawns, mu-shu pork, pea sprouts, and broccoli beef, we had more than enough leftovers to last for a few servings.", "rating": 3, "date": "2007-08-05"}], "beef with chinese broccoli": [], "beef with tofu": [], "beef with fresh mushrooms": [], "beef with ginger and scallions": [], "scrambled eggs beef": [], "tomato beef": [{"excerpts": ["we got takeout: tomato beef skinny noodles (jin mien), beef w/ black beans chow fun, & mixed veggies.  ", "everything was drowning in grease.  ", "like, even for a chinese restaurant, it's a stomach churning level of oily.  "], "author": "Miss K.", "review": "fast & cheap, but that's it.\n\nwe got takeout: tomato beef skinny noodles (jin mien), beef w/ black beans chow fun, & mixed veggies.  everything was drowning in grease.  like, even for a chinese restaurant, it's a stomach churning level of oily.  the beef was also sketchy tasting & chewy in a gross way.  \n\nat this point, i don't even care whether it's authentic chinese or not.  but just simply as food, it's disgusting.  not coming back.", "rating": 1, "date": "2012-12-30"}, {"excerpts": ["Salt n pepper chicken wings\nbbq pork wonton soup \nBeef Steak Cubes w/ tender greens\nCrispy Fried Chicken (half)\nflounder fillet with salt and pepper\ntomato beef chow mein\nchicken chow mein\nblack bean sauce beef chow fun\n\nMu-Shu and Generl Tsou's were close calls but suffer from occasional quality control problems."], "author": "Jeff E.", "review": "Goodbye Gourmet Carousel\n\nGourmet is right down the street from me and I'm lazy, as a result I've probably eaten there a couple hundred times over the years.  They've never gotten me ill (that's 1 star), and Ive grown to like some of their dishes (that's the other star), but as others have pointed out, some of their food is horrible, eg. their Mongolian beef with mushrooms (see Nitzan W.'s review for details).\n\nAs a public service I was just going to pass along the list of dishes I've been able to safely order. Then it dawned on me, I'M DONE WITH THIS PLACE.\n\nI'm done with:\nThe rude little old lady yelling \"GOHMAAAAYYY!\" when I phone in my order (see Lauren Y. or Josua P.); \nBeing told the kitchen is closed when I call at 9:15; \nThe nasty looks I get when I ask for a fork, napkin or some garlic chilli for my potstickers;\nNever being charged the same price twice for a dish;\nThe questionable cleanliness of the kitchen and the cooking staff;\nThe occasional slimy gross-out dish that goes right to the trash;\nAll the deep fried and sugar coated crap making me fat, clogging my arteries and raising my blood sugar.\n\nSo... Goodbye Gourmet Carousel\n\n******************************************\n\nI'll be eating anywhere else, but for those of you who find yourselves at the Gourmet Carousel here's my safe ordering list:\n\nPotstickers\negg roll (don't make the mistake of calling it a spring roll)\nSalt n pepper chicken wings\nbbq pork wonton soup \nBeef Steak Cubes w/ tender greens\nCrispy Fried Chicken (half)\nflounder fillet with salt and pepper\ntomato beef chow mein\nchicken chow mein\nblack bean sauce beef chow fun\n\nMu-Shu and Generl Tsou's were close calls but suffer from occasional quality control problems.", "rating": 2, "date": "2009-04-07"}, {"excerpts": ["I tried their Tomato Beef chow mein and had it delivered.   ", "It was absolutely drenched in oil.  ", "Literally glistening in the light.  ", "Why do they use soo much?  ", "They use way too many onions in their Tomato Beef chow mein and it was not sweet at all.  ", "Literally, it should have been called Onion chow mein.  ", "Tasteless."], "author": "Spiffy K.", "review": "I tried their Tomato Beef chow mein and had it delivered.   It was absolutely drenched in oil.  Literally glistening in the light.  Why do they use soo much?  They use way too many onions in their Tomato Beef chow mein and it was not sweet at all.  Literally, it should have been called Onion chow mein.  Tasteless.", "rating": 1, "date": "2010-04-04"}, {"excerpts": ["faves (and i have many) are whole steamed fish, crab with garlic and scallions, seafood bird nest, mandarin spareribs, tomato beef chow mein, salt and pepper pork, mu shu anything"], "author": "Christine Y.", "review": "One of the best Chinese restaurants in SF.  Almost everything on the menu is authentic and yummy and inexpensive.  take-out is a great option.  faves (and i have many) are whole steamed fish, crab with garlic and scallions, seafood bird nest, mandarin spareribs, tomato beef chow mein, salt and pepper pork, mu shu anything", "rating": 5, "date": "2006-08-15"}], "beef with pickled chinese cabbage": [], "beef and yu choy": [], "beef steak cubes and yu choy": [], "chinese beef steak cubes": [], "beef with bitter melon": [], "general tsos chicken": [], "hot sauce sesame chicken": [], "chicken with bitter melon": [], "chicken with green beans": [{"excerpts": ["My mother loved her chicken with green beans which I will have to try.  ", "For $26.00, we definitely got our money's worth.  ", "The service is friendly and efficient.  ", "So, for excellent Cantonese cuisine at rock bottom prices with friendly service in a clean atmosphere, Gourmet Carousel cannot be beat.  ", "Keep up the good work guys.!"], "author": "Brian S.", "review": "From the outside, this place is not much for looks, but once inside, carpeting, table cloths, dark wood, and mirrors astonish one.!  I stopped in last night and had some excellent Cantonese cuisine.  The pot stickers, a little doughy, are excellent and crispy golden with a wonderful ground pork, ginger, and cabbage filling; perfect topped with a little vinegary and soy sauce on top.  The sweet and sour rock cod fillet is crispy and greasless with a well balanced sweet and sour sauce and fresh pineapple, bell pepper, and onion.  I loved the free small order of winter melon soup with fresh, soft winter melon (a little bidder but good,) pork, and vegetables in a savory broth.  The steamed rice is excellent; not soggy but firm.  My mother loved her chicken with green beans which I will have to try.  For $26.00, we definitely got our money's worth.  The service is friendly and efficient.  So, for excellent Cantonese cuisine at rock bottom prices with friendly service in a clean atmosphere, Gourmet Carousel cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2011-02-09"}], "chicken with fresh mushrooms": [], "chicken with black mushrooms": [], "scallion chicken": [{"excerpts": ["i love their ginger scallion chicken, their squash and vermicelli clay pot, their braised tofu, their snow cabbage and pork noodle soup.  "], "author": "Helen L.", "review": "oh gourmet carousel.  \n\nit's a good thing i live next door (no, not the ugly dirty green building), because my roommates and i are fully addicted.  \n\nthis is THE default take out place when we run out of groceries, have the drunk munchies, or when i miss my mom's cooking.  and that's saying a lot, because my mom is a bomb ass cook.\n\ni must admit, im not so into their americanized chinese dishes, though i do have a soft spot for their singapore noodles (a big ol' vat of curry flavored deliciousness for under 4 bucks).\n\ntheir traditional chinese dishes are the shining stars.  i love their ginger scallion chicken, their squash and vermicelli clay pot, their braised tofu, their snow cabbage and pork noodle soup.  even their complimentary soup, all brown and boney and herbally.  \n\nit just tastes like home.  soul food.  \n\n... now if only they had congee.", "rating": 4, "date": "2007-03-16"}], "steamed salted chicken": [], "white cut chicken": [], "lotus steamed chicken": [], "deep fried stuffed tofu": [], "deep fried pork intestines": [], "mandarin spareribs": [{"excerpts": ["faves (and i have many) are whole steamed fish, crab with garlic and scallions, seafood bird nest, mandarin spareribs, tomato beef chow mein, salt and pepper pork, mu shu anything"], "author": "Christine Y.", "review": "One of the best Chinese restaurants in SF.  Almost everything on the menu is authentic and yummy and inexpensive.  take-out is a great option.  faves (and i have many) are whole steamed fish, crab with garlic and scallions, seafood bird nest, mandarin spareribs, tomato beef chow mein, salt and pepper pork, mu shu anything", "rating": 5, "date": "2006-08-15"}], "salt and pepper spareribs": [{"excerpts": ["The menu is packed with house specialties like Sizzling Chicken in a Clay Pot, Shredded Pork in Plum Sauce, Salt and Pepper Spareribs, and Prawns with Hot Sauce. ", "My favorite appetizers are the Fried Egg Rolls, Fried Won Tons, Pot Stickers, Hot and Sour Soup, and Won Ton Soup. "], "author": "Alice S.", "review": "Looking for excellent Chinese food at rock bottom prices? Look no further than Gourmet Carousel. Located in Lower Pacific Heights, Gourmet Carousel has been serving up delicious Chinese food for over 25 years. This restaurant epitomizes the saying \"don't judge a book by it's cover.\" The building is in desperate need of a new coat of paint and the dining room needs a complete make-over, but the food is tasty. The tables are a little too close, but that closeness lends to the authentic family feel of the restaurant. \n\nThe food at the restaurant is some of the best in San Francisco. A perk of eating in is the complementary \"house soup\" for the table. The last time I went it was a scrumptious potato and cabbage soup. Each dish is full of flavor and comes out fast. The menu is packed with house specialties like Sizzling Chicken in a Clay Pot, Shredded Pork in Plum Sauce, Salt and Pepper Spareribs, and Prawns with Hot Sauce. My favorite appetizers are the Fried Egg Rolls, Fried Won Tons, Pot Stickers, Hot and Sour Soup, and Won Ton Soup. Some of the main dish highlights are the Mu-Shu Chicken, Salt and Pepper Prawns, General Tso's Chicken, Mongolian Beef, and any of the fresh vegetable side dishes.\n\nGourmet Carousel is the best deal in town. Lunch specials start at $4.95 and don't top $5.95. Side dishes average $8 and are so large that my fiance couldn't even finish his Mongolian Beef by himself (that is a first ever).  The only downfall is that they don't deliver. (Gasp!) The Gourmet Carousel moves to it's own beat, but it's a tasty beat. Next time you are looking for a delicious, cheap, Chinese food experience try the Gourmet Carousel.", "rating": 5, "date": "2011-07-19"}], "spareribs with black bean sauce": [], "shredded pork in plum sauce": [{"excerpts": ["The menu is packed with house specialties like Sizzling Chicken in a Clay Pot, Shredded Pork in Plum Sauce, Salt and Pepper Spareribs, and Prawns with Hot Sauce. ", "My favorite appetizers are the Fried Egg Rolls, Fried Won Tons, Pot Stickers, Hot and Sour Soup, and Won Ton Soup. "], "author": "Alice S.", "review": "Looking for excellent Chinese food at rock bottom prices? Look no further than Gourmet Carousel. Located in Lower Pacific Heights, Gourmet Carousel has been serving up delicious Chinese food for over 25 years. This restaurant epitomizes the saying \"don't judge a book by it's cover.\" The building is in desperate need of a new coat of paint and the dining room needs a complete make-over, but the food is tasty. The tables are a little too close, but that closeness lends to the authentic family feel of the restaurant. \n\nThe food at the restaurant is some of the best in San Francisco. A perk of eating in is the complementary \"house soup\" for the table. The last time I went it was a scrumptious potato and cabbage soup. Each dish is full of flavor and comes out fast. The menu is packed with house specialties like Sizzling Chicken in a Clay Pot, Shredded Pork in Plum Sauce, Salt and Pepper Spareribs, and Prawns with Hot Sauce. My favorite appetizers are the Fried Egg Rolls, Fried Won Tons, Pot Stickers, Hot and Sour Soup, and Won Ton Soup. Some of the main dish highlights are the Mu-Shu Chicken, Salt and Pepper Prawns, General Tso's Chicken, Mongolian Beef, and any of the fresh vegetable side dishes.\n\nGourmet Carousel is the best deal in town. Lunch specials start at $4.95 and don't top $5.95. Side dishes average $8 and are so large that my fiance couldn't even finish his Mongolian Beef by himself (that is a first ever).  The only downfall is that they don't deliver. (Gasp!) The Gourmet Carousel moves to it's own beat, but it's a tasty beat. Next time you are looking for a delicious, cheap, Chinese food experience try the Gourmet Carousel.", "rating": 5, "date": "2011-07-19"}], "bbq pork with tofu": [], "bbq pork with peapods": [], "pork belly with preserved vegetables": [], "steamed minced pork with salted egg": [], "steamed minced pork with salted fish": [], "peking duck": [{"excerpts": ["We ordered the set menu which included seafood bean cake soup, crispy fried chicken, ginger/green onion crab (yummy and finger licking good), Peking duck which came with the buns and was pretty tasty, fried quail which I haven't had in ages (crispy and delish), black mushrooms with tender greens, steamed fish, and crystal shrimp with mixed vegetables.  ", "Plus we added bitter melon with beef.  ", "The food satiated our hungry group and there was not much left except for the bones after all was said and done and no leftovers to take home!  ", "We were able to be full for $20 a person which included tax and tip (which is not calculated ahead of time).  ", "Dessert included oranges and fortune cookies.  ", "When I came home ", "I read the health score ", "and I said yikes, and ", "I don't have a cast iron stomach!"], "author": "Karen W.", "review": "Came here with a group for dinner before an event and I haven't been here in over 20 years!  This place has been around for eons and gets crowded.  A friend made reservations for dinner here for our party of 10.  We ordered one of the set menu dinners for a group of 8 and then added one dish.  \n\nWe ordered the set menu which included seafood bean cake soup, crispy fried chicken, ginger/green onion crab (yummy and finger licking good), Peking duck which came with the buns and was pretty tasty, fried quail which I haven't had in ages (crispy and delish), black mushrooms with tender greens, steamed fish, and crystal shrimp with mixed vegetables.  Plus we added bitter melon with beef.  The food satiated our hungry group and there was not much left except for the bones after all was said and done and no leftovers to take home!  We were able to be full for $20 a person which included tax and tip (which is not calculated ahead of time).  Dessert included oranges and fortune cookies.  When I came home I read the health score and I said yikes, and I don't have a cast iron stomach!", "rating": 4, "date": "2016-09-11"}, {"excerpts": ["Black bean clams, ginger and green onion crab, lobster lo mein, fried chicken, minced squab in lettuce leaf, fried chicken, ma poh tofu, Peking duck, fried rice, soups, salt and pepper shrimp (with heads), chicken won ton, whole steamed fish, four season green beans are just a sample of our favorites. \n\n"], "author": "Joanna S.", "review": "My husband and I have been enjoying the food here since about 1983.  It's not fusion or trendy, but it is excellent value, made to order and very good quality.  \n\nThe menu is quite extensive. Black bean clams, ginger and green onion crab, lobster lo mein, fried chicken, minced squab in lettuce leaf, fried chicken, ma poh tofu, Peking duck, fried rice, soups, salt and pepper shrimp (with heads), chicken won ton, whole steamed fish, four season green beans are just a sample of our favorites. \n\nParking can be challenging, but the Van Ness end of the California Street cable car is only two blocks away. It is also walking distance to the opera house or symphony hall for a quick bargain pre-performance meal.  They also deliver.\n\nI think eating here is one of the things my twins will miss most about going away for college.", "rating": 5, "date": "2014-09-07"}, {"excerpts": ["We got:\n- Crab Meat and Corn Soup\n- Peking Duck + Buns\n- Pig Skin, Pork Belly, & Rice Noodles Clay Pot\n- Pea Sprouts in Garlic Sauce\n- Shrimp\n", "- Fried Rice\n- Clams\n"], "author": "Melissa K.", "review": "New favorite Chinese restaurant in SF!! I came here to celebrate a friend's birthday, and everything was fantastic--friendly and generous service, and every dish was delicious! \n\nWe got:\n- Crab Meat and Corn Soup\n- Peking Duck + Buns\n- Pig Skin, Pork Belly, & Rice Noodles Clay Pot\n- Pea Sprouts in Garlic Sauce\n- Shrimp\n- Fried Rice\n- Clams\n- Pork Pot Stickers\n- Rock Cod\n\nThis is authentic Cantonese food; you can't go wrong with the Chef Specials menu. The restaurant was very accommodating with our large party :) The menus are well-designed and easy to read, and the restaurant owners were so nice. I'd highly recommend it!", "rating": 5, "date": "2015-06-21"}, {"excerpts": ["The one thing I liked was the peking duck. ", "The buns were good and soft. "], "author": "Nick N.", "review": "Tried this place, as my mom recently tried it. She said it was ok and I would agree.\n\nIt has some pretty good weird selections, being away from from any of the Chinese communities. And it was pretty reasonably priced.\n\nThe one thing I liked was the peking duck. The buns were good and soft. And the flavor of the duck was pretty tasty.\n\nIt did seem like the majority of the food is a little on the salty side.", "rating": 3, "date": "2015-01-20"}, {"excerpts": ["*Peking duck with buns--missing the green onion slivers, but it was crispy, meaty & didn't have tons of fat & the buns were so hot!\n", "*", "Some kind of fish--didn't eat because I don't like fish.  ", "Waitress filleted it in less than a minute, gotta love that about Chinese restaurants.\n", "*", "Crispy skinned chicken with shrimp chips--loved it..", "moist and crispy skinned (of course), the shrimp chips were crispy (sometimes they're soggy) & they weren't really greasy.\n", "*Shrimp with shells & eyes in tact---didn't eat because I didn't want to get my hands totally messy...& shrimp in the shells with the eyes totally freak me out!\n", "*Black mushrooms and cabbage--", "Ate some of the cabbage, but not the mushrooms because I don't like black mushrooms.\n", "*Beef with bok choy--The beef was pretty tender and the sauce was good and not overly salty.\n", "*Braised yee fu noodles--\"The Birthday Noodles."], "author": "Cat C.", "review": "My relatives have been coming out here from the Richmond district for years for lunch take outs and having dinner banquets here because of their large portions and cheap prices.  The food is far from gourmet, and while I've had better Chinese food, some of their dishes are fairly tasty!  \n\nThis weekend, we had a birthday banquet for ten for my aunt's birthday.  You know what that means, eight courses...just when I thought all the glutinous eating was going to be over along with the holidays! Since it was a banquet menu, everything was ordered ahead of time, so sorry, that I don't know the proper names for everything!\n\n*Scallop soup (has some chicken in it too)--good for the seafood lovers.\n*Minced squab or chicken (it varies by restaurant) w/lettuce cups--okay, I thought it tasted slightly off, but my aunt says it was just me.  \n*Peking duck with buns--missing the green onion slivers, but it was crispy, meaty & didn't have tons of fat & the buns were so hot!\n*Some kind of fish--didn't eat because I don't like fish.  Waitress filleted it in less than a minute, gotta love that about Chinese restaurants.\n*Crispy skinned chicken with shrimp chips--loved it..moist and crispy skinned (of course), the shrimp chips were crispy (sometimes they're soggy) & they weren't really greasy.\n*Shrimp with shells & eyes in tact---didn't eat because I didn't want to get my hands totally messy...& shrimp in the shells with the eyes totally freak me out!\n*Black mushrooms and cabbage--Ate some of the cabbage, but not the mushrooms because I don't like black mushrooms.\n*Beef with bok choy--The beef was pretty tender and the sauce was good and not overly salty.\n*Braised yee fu noodles--\"The Birthday Noodles.\"  Came with plenty of veggies and was nice and light.  \n\nAll of this came with the standard cut orange slices (so sweet) and fortune cookies.  The wait staff was very attentive to our party and even poured the wine that we had brought and gave us paper plates for the cake we brought.  \n\nI always get worried if I don't see any Chinese people in a Chinese restaurant, don't worry it was about half the restaurant, so this is no Panda Express like restaurant!  I only continue to come to Gourmet Carousel for my family's banquet dinners, but if you're around the neighborhood and want some Chinese food, check it out..and walk or bus it, because parking can be difficult!", "rating": 3, "date": "2010-01-12"}, {"excerpts": ["Ordered Peking Duck--full order 12 buns. ", "$26.  ", "I got five legs, no breasts, the rest  chopped up parts with bone and gristle that were obviously the remainders of other dishes rather than the pieces of a single duck."], "author": "Robert M.", "review": "Ordered Peking Duck--full order 12 buns. $26.  I got five legs, no breasts, the rest  chopped up parts with bone and gristle that were obviously the remainders of other dishes rather than the pieces of a single duck.", "rating": 1, "date": "2013-12-21"}, {"excerpts": ["And we had Peking duck, garlic-scallion crab, abalone, a clay pot dish, Snow pea sprouts with garlic, seafood chow fun, and about 5 other things, and we had leftovers.  ", "Dungeness crab for dinner tonight!\n", "The killer is that everything was really good. ", "OK, the salt 'n pepper squid suffered a bit from the 15 minute drive home, but we ate really well, especially considering the pittance we spent.  ", "My friends and neighbors all raved!   \n"], "author": "Rob B.", "review": "Why haven't I reviewed GC before? Forgot, I guess. \nI've been going here for years, but not often enough, and not recently.\nI guess I always go with exactly 9 people and get a banquet-table and really pig out.  Do any of you other bok-goi's notice that Chinese people almost always eat out with a crowd?\n\nStart with the negative: It's a creepy-awful room.  Who needs windows?  Wood paneling.  Bad lighting.  Picture the spawn of a basement rec-room and a dentist office waiting room.  OK...it's darker than most of those flourescent-and-formica places, which is a good thing, but the place just feels claustrophobic.\n\nSo the other night I had 10 friends and neighbors down at my house. I said \"Chinese Banquet!\" but a couple people didn't want to go out, so I ordered take out (they don't deliver, unfortunately).  Also, there were a couple \"vegetarians\" who eat seafood. (RANT) What's up with that?  Are chickens smarter than salmon?  Do fish feel no pain?  Can you hear me screaming if I'm underwater? (/ RANT)\n\nSo we got a boatload of GOOD food for $107. Divide by 11 and you'll still be under the magic number of $10/person.  And we had Peking duck, garlic-scallion crab, abalone, a clay pot dish, Snow pea sprouts with garlic, seafood chow fun, and about 5 other things, and we had leftovers.  Dungeness crab for dinner tonight!\nThe killer is that everything was really good. OK, the salt 'n pepper squid suffered a bit from the 15 minute drive home, but we ate really well, especially considering the pittance we spent.  My friends and neighbors all raved!   \nAnd were were completely free of anything resembling cashew chicken, Mongolian lamb, or sweet and sour pork.  \n\nHow to eat well:\n1. Call 9 friends \n2. go to Gourmet Carousel\n3. order extravagantly\n4. eat like a king\n5. split the bill\n6. Start thinking of another 9 friends to impress with your ordering prowess.", "rating": 4, "date": "2009-03-03"}, {"excerpts": ["Peking Duck:  ", "I got a half order, which really was a full order with less steamed buns.  "], "author": "Jeanne C.", "review": "Gourmet Carousel is a place I always drive by but have never thought to try because the name is terrible!  It's really one of the cleaner Chinese restaurants, quiet with a homey feel.  The food is very good, authentic and so inexpensive!  The servings are huge, perfect for a family style meal.\n\nSpecial WonTon Soup: enough for 2 as a meal or 5 as a starter.  Flavorful broth with tons of beef and pork.\n\nPeking Duck:  I got a half order, which really was a full order with less steamed buns.  Not only do you get the crispy skin, but they give you a ton of meat too!\n\nSalt and Pepper Prawns & Salt and pepper pork:  These dishes could have used a little more salt and pepper but they were perfectly fried.\n\nStir Fried green beans with minced pork:  Powerful garlic flavor so bring your mints!  They were a little too greasy for me.\n\nDinner for four with way too much food and tons of leftovers: $50.00!!!", "rating": 4, "date": "2006-09-20"}, {"excerpts": ["We ordered a set menu (\"woh choy\") which had a variety of dishes: seafood and corn soup, peking duck with steamed buns, salt and pepper quail, ginger and scallion crab, baked chicken with shrimp chips, mushrooms and bok choy, and sweet and sour whole fish.  ", "The soup didn't have a ton of flavor, the buns from the peking duck were sort've pasty, and the crab wasn't really meaty.\n\n"], "author": "Christopher W.", "review": "My cousin was visiting SF from Boston and since she was craving good Chinese food we went here.  We have come here before, but I don't remember it :-).  The restaurant was quite busy when we walked in-- definitely a good sign!\n\nWe ordered a set menu (\"woh choy\") which had a variety of dishes: seafood and corn soup, peking duck with steamed buns, salt and pepper quail, ginger and scallion crab, baked chicken with shrimp chips, mushrooms and bok choy, and sweet and sour whole fish.  We added on szechuan tofu and egg foo young for my cousin's boyfriend who is vegetarian.\n\nWhile the food was tasty, I wouldn't say it was spectacular.  The food took a while and slowly came out one dish at a time.  The soup didn't have a ton of flavor, the buns from the peking duck were sort've pasty, and the crab wasn't really meaty.\n\nIf you are in the area, give the restaurant a try, butI probably wouldn't go out of my way in the future.", "rating": 3, "date": "2008-12-29"}, {"excerpts": ["NEVER order Peking Duck, as it is ROAST duck with buns!  ", "bones and all!!!  ", "Great Roasted, but it is NOT Peking.   ", "But the Won Ton Soup is AMAZINGLY FANTASTIC, as are the POTSTICKERS, the FRIED NOODLES say \"Geen Mean\"( served in a Pie Plate)---ask for prawns with it!  ", "Curry chicken is FABULOUS, Love the BBQ RIBS and Roast Duck Noodle Soup!!!  ", "(Good Roast Duck, but DEFINITELY is the same one they serve as Peking duck!!)  ", "The food service at lunch is FRESH and well cooked.  ", "We usually  eat lunch there 2 times a week  and  have dinner delivered at home at least once a week.  ", "Prices are GREAT (whole lobster with ginger and green onions $12.95)  ", "Servers  provide basic efficient service!  ", "Owner is a hoot and fills every pot sticker and egg roll herself ", "(No \"Ling Ling\" from Costco here!)She says she started the Delivery Service to keep her husband busy in the evenings!!  ", "fun place with some  GREAT foods.  ", "Enjoy!"], "author": "S G.", "review": "There are GREAT things on the menu, and NOT so great things!  NEVER order Peking Duck, as it is ROAST duck with buns!  bones and all!!!  Great Roasted, but it is NOT Peking.   But the Won Ton Soup is AMAZINGLY FANTASTIC, as are the POTSTICKERS, the FRIED NOODLES say \"Geen Mean\"( served in a Pie Plate)---ask for prawns with it!  Curry chicken is FABULOUS, Love the BBQ RIBS and Roast Duck Noodle Soup!!!  (Good Roast Duck, but DEFINITELY is the same one they serve as Peking duck!!)  The food service at lunch is FRESH and well cooked.  We usually  eat lunch there 2 times a week  and  have dinner delivered at home at least once a week.  Prices are GREAT (whole lobster with ginger and green onions $12.95)  Servers  provide basic efficient service!  Owner is a hoot and fills every pot sticker and egg roll herself (No \"Ling Ling\" from Costco here!)She says she started the Delivery Service to keep her husband busy in the evenings!!  fun place with some  GREAT foods.  Enjoy!", "rating": 3, "date": "2014-01-04"}, {"excerpts": ["- my favourites were: \n- shredded scallop soup - very generous with the scallop, verrrrry tasty;\n- dried oyster with lettuce - everyone loved this (me too);\n- peking duck (with 12 buns) (the best part was one dining companion's comment to another as she split the bun open: \"ya lookin' for a maaaan in there?\"  no men inside, we discovered, but i loved that melt-in-your-mouth thing about the steamed bun.  ", "hmm?)\n"], "author": "Lenita M.", "review": "could this be the place i've been looking for ever since i set foot in this town...?  it was great!  yee!  my palate is trained in toronto, the chinese food capital of north america, so the only things that get into my mouth are things i *actually* like... \n\nwe got the special family dinner - my favourites were: \n- shredded scallop soup - very generous with the scallop, verrrrry tasty;\n- dried oyster with lettuce - everyone loved this (me too);\n- peking duck (with 12 buns) (the best part was one dining companion's comment to another as she split the bun open: \"ya lookin' for a maaaan in there?\"  no men inside, we discovered, but i loved that melt-in-your-mouth thing about the steamed bun.  hmm?)\n- crispy fried prawns - just eat the whole damn thing (thank you, parents, for teaching me how to eat right).\n\ni see the place has a very unenthusiastic rating, but my experience here was great.  the only suck-ass thing is the parking -- but it opens up after 7 pm on the nearby streets.  happy eating!", "rating": 4, "date": "2007-12-12"}], "roast duck with tofu": [], "roast duck with broccoli": [], "piece salt and pepper quail": [], "gourmet special tofu clay pot": [], "seafood tofu clay pot": [], "salted fish chicken and tofu clay pot": [], "sizzling chicken and chinese sausage clay pot": [], "oyster and pork belly clay pot": [{"excerpts": ["In the same order, we also ordered the oyster and pork belly clay pot...both my boyfriend ", "and I found cracked oyster shells in the dish and ", "it tasted like we were eating sand when we were chewing on the oysters. ", "Overall, I would still say this is a pretty legit chinese place to eat."], "author": "Nina H.", "review": "When the food is good, it's really good, but when the food is bad it's pretty bad too. I really really like your deluxe won ton soup, it tastes almost exactly like the won tons I grew up eating in Taiwan! Their walnut prawns are great and so are there noodle dishes. In the same order, we also ordered the oyster and pork belly clay pot...both my boyfriend and I found cracked oyster shells in the dish and it tasted like we were eating sand when we were chewing on the oysters. Overall, I would still say this is a pretty legit chinese place to eat.", "rating": 4, "date": "2015-03-02"}], "curry chicken and potatoes clay pot": [], "pigskin pork belly and rice noodle clay pot": [], "lamb stew with braised tofu skin clay pot": [], "beef stew with tofu clay pot": [], "beef stew with taro clay pot": [], "beef tendon with taro clay pot": [], "beef stew and tendon with taro clay pot": [], "chinese melon dried shrimp and rice noodle clay pot": [], "dry string bean and ground pork sauteed in garlic sauce": [], "eggplant with ground pork in garlic sauce": [], "buddhas delight": [], "spinach with preserved egg in broth": [], "pea sprouts with garlic sauce": [{"excerpts": ["Favorite dishes include Salt & Pepper Chicken Wings, Pea Sprouts with Garlic Sauce and Eggplant with Pork clay pot."], "author": "Al M.", "review": "I live in Lower Pacific Heights and this is my go-to local restaurant for good Chinese food.  If you are looking for \"fancy\" place like R&G Lounge or Koi Palace, this isn't the place.  But if you want good, fast, reasonably priced Chinese food that will fill you up, then Gourmet fits the bill.  Favorite dishes include Salt & Pepper Chicken Wings, Pea Sprouts with Garlic Sauce and Eggplant with Pork clay pot.", "rating": 4, "date": "2015-09-03"}], "spinach with garlic sauce": [], "chinese broccoli with oyster sauce": [], "black mushroom with tender greens": [], "fresh mushrooms with tofu": [], "steamed tofu with oyster sauce": [], "pea pods with water chestnuts": [], "shrimp egg foo yung": [], "beef egg foo yung": [], "chicken egg foo yung": [], "bbq pork egg foo yung": [], "mixed vegetable egg foo yung": [], "deluxe lo mein": [], "bbq pork lo mein": [], "chicken lo mein": [], "beef lo mein": [], "beef stew lo mein": [], "beef tendon lo mein": [], "roast duck lo mein": [], "seafood lo mein": [], "mixed vegetables lo mein": [], "gourmet special chow mein": [], "shrimp chow mein": [], "shredded meats chow mein": [], "bbq pork chow mein": [], "cashew chicken chow mein": [{"excerpts": [",i ordered the cashew chicken chow mein, i wasn't expecting much, but when the plate came it was a big portion.\n", "I couldn't believe my eyes all this food, i thought i couldn't finish it ", "but i did.\n", "The workers are all nice, they refill your teas or water without asking.\n", "This place makes panda express look silly, i would rather eat here everyday if i could."], "author": "Corey W.", "review": "This placeis great! Ive passed by this place for years before i decided to try it today,i ordered the cashew chicken chow mein, i wasn't expecting much, but when the plate came it was a big portion.\nI couldn't believe my eyes all this food, i thought i couldn't finish it but i did.\nThe workers are all nice, they refill your teas or water without asking.\nThis place makes panda express look silly, i would rather eat here everyday if i could.", "rating": 4, "date": "2014-03-13"}], "gourmet special chow fun": [], "beef and chinese greens chow fun": [], "black bean sauce beef chow fun": [{"excerpts": ["Salt n pepper chicken wings\nbbq pork wonton soup \nBeef Steak Cubes w/ tender greens\nCrispy Fried Chicken (half)\nflounder fillet with salt and pepper\ntomato beef chow mein\nchicken chow mein\nblack bean sauce beef chow fun\n\nMu-Shu and Generl Tsou's were close calls but suffer from occasional quality control problems."], "author": "Jeff E.", "review": "Goodbye Gourmet Carousel\n\nGourmet is right down the street from me and I'm lazy, as a result I've probably eaten there a couple hundred times over the years.  They've never gotten me ill (that's 1 star), and Ive grown to like some of their dishes (that's the other star), but as others have pointed out, some of their food is horrible, eg. their Mongolian beef with mushrooms (see Nitzan W.'s review for details).\n\nAs a public service I was just going to pass along the list of dishes I've been able to safely order. Then it dawned on me, I'M DONE WITH THIS PLACE.\n\nI'm done with:\nThe rude little old lady yelling \"GOHMAAAAYYY!\" when I phone in my order (see Lauren Y. or Josua P.); \nBeing told the kitchen is closed when I call at 9:15; \nThe nasty looks I get when I ask for a fork, napkin or some garlic chilli for my potstickers;\nNever being charged the same price twice for a dish;\nThe questionable cleanliness of the kitchen and the cooking staff;\nThe occasional slimy gross-out dish that goes right to the trash;\nAll the deep fried and sugar coated crap making me fat, clogging my arteries and raising my blood sugar.\n\nSo... Goodbye Gourmet Carousel\n\n******************************************\n\nI'll be eating anywhere else, but for those of you who find yourselves at the Gourmet Carousel here's my safe ordering list:\n\nPotstickers\negg roll (don't make the mistake of calling it a spring roll)\nSalt n pepper chicken wings\nbbq pork wonton soup \nBeef Steak Cubes w/ tender greens\nCrispy Fried Chicken (half)\nflounder fillet with salt and pepper\ntomato beef chow mein\nchicken chow mein\nblack bean sauce beef chow fun\n\nMu-Shu and Generl Tsou's were close calls but suffer from occasional quality control problems.", "rating": 2, "date": "2009-04-07"}], "shredded meats fried rice noodles": [], "singapore style fried rice noodles": [], "shredded pork with preserved vegetables fried rice noodles": [], "birthday noodles and vegetables": [], "supreme soy sauce chow mein": []}