{"dryfried chicken wings": [], "deepfried chicken wings": [], "crispy salt and peppers chicken wings": [], "spicy slice beef": [], "kaufu": [], "cucumber and black fungus with garlic sauce": [], "crispy popcorn chicken": [], "six pieces samosafried curry potato": [], "deepfried intestine": [], "shanghai steamed dumpling": [{"excerpts": ["House Special Shanghai Steamed Dumpling (10)  $8.95\n         Should eat whole\n         Don't puncture the skin\n         ", "Juicy"], "author": "S.K. Y.", "review": "15.12.13   FIRST time\n                 Raw Review\n                 2nd day of opening\n\nFood ----------------------------- 3 - 3 1/2 Stars\nService -------------------------- No comment your highness\n                                             Gotha be fair\nDécor ---------------------------- Ok\n\nUsed to be Roadside BBQ\nTHEN\nNew ownership as\nGS Roadside BBQ made a switch\nTwice as Fajita joint then\nFusion Mexican\n\nIt looks like new ownership.\nGourmet Noodles and some loose items.\n45 main + small dishes + side of rice\n\nA4    Fried Calamari\n         Shoestring sized cut\n         Slivered Onions all deep fried\n         Too thin for me ... resulting less tender calamari\n\nN15  Shanghai Style Wonton (10)    $7.95\n         Ok\n\nN22  House Special Shanghai Steamed Dumpling (10)  $8.95\n         Should eat whole\n         Don't puncture the skin\n         Juicy", "rating": 3, "date": "2015-12-13"}], "pork and cabbage dumpling": [], "jicai and pork dumpling": [], "chicken and corn dumpling": [{"excerpts": ["3) chicken and corn dumpling. ", "This was just OK. ", "I have a suspicion they probably purchase these from one of the dumpling producers in the Richmond. "], "author": "Dom L.", "review": "Tasty noodle option. Shanghai style food. \n\nTried three dishes tonight:\n\n1) spicy five spice soup noodle. The noodles were tender but still toothsome. Really nice actually. The soup was similar to hot and sour soup; just spicy enough but not numbingly so. There was a a bit of pork, bamboo and black woods ear in the soup, also similar to hot and sour soup. Good option.\n\n2) combo Shanghai chow mein. Most restaurants call this dish Shanghai style thick noodle. The noodle was thick but not super thick. There were chunks of shrimp, chicken, pork and beef. Some cabbage and spinach also. Nice flavor and the balance of tastes was really good. \n\n3) chicken and corn dumpling. This was just OK. I have a suspicion they probably purchase these from one of the dumpling producers in the Richmond. It was ok, not outstanding.\n\nOverall a nice little noodle place, the prices are pretty reasonable. Bill for the above was $27. Not bad; will be back to try out some other dishes.", "rating": 3, "date": "2016-10-31"}], "pumpkin pan cake": [], "steamed vegetable dumpling": [], "ten shanghai style meat wonton soup": [], "shanghai pan fried pork buns": [], "vegetable and mushroom buns": [], "red bean pan cake": [], "sesame pancake": [{"excerpts": ["We loved the Sesame Pancake stuffed with green onions. ", "They have dessert options too ", "so we tried the Black Glutinous Rice Pudding. ", "It's not pudding but is a sticky black rice dish stuffed with red bean paste. ", "I've never had or seen anything like it before and it was ok. ", "I wouldn't order it again but it wasn't bad. ", "I just expected an actual pudding. ", "We'll try this place again for their other menu options."], "author": "Jen L.", "review": "On Sunday, it was freezing outside and I was pleasantly surprised to find that the restaurant turned on their heater. It's not a very cozy restaurant so heat and hot tea made the experience better. The service was good and they were friendly and the servers spoke both Mandarin and Cantonese. The dishes came out fast and fresh. We liked reading over their menu because it had a few dishes we don't typically see on menus of other Shanghai restaurants such as Marinated Egg, Soybean in Wine Sauce, Eel Noodle Soup and Smoked Fish but we weren't in the mood to try something new today. We went with the usuals: Shanghai Steamed Dumplings (Xiao Long Bao), Chive, Shrimp & Pork Dumplings, Spicy Wonton, Ji Vegetable & Pork Rice Cake (new to us), and Garlic Spinach. The Xiao Long Bao and dumplings were really good. We liked the tasty broth in the Xiao Long Bao and there were big pieces of shrimp in the dumplings. We didn't care for the spicy wonton though. The peanut sauce on the wonton was bland and not spicy. The rice cakes were different than the regular Shanghai style ones because the vegetable was something we hadn't had before and we really liked the flavor. We loved the Sesame Pancake stuffed with green onions. They have dessert options too so we tried the Black Glutinous Rice Pudding. It's not pudding but is a sticky black rice dish stuffed with red bean paste. I've never had or seen anything like it before and it was ok. I wouldn't order it again but it wasn't bad. I just expected an actual pudding. We'll try this place again for their other menu options.", "rating": 4, "date": "2016-12-23"}], "jicai tofu soup": [], "spicy beef and vermicelli curry soup": [], "house special spicy beef frank noodle soup": [], "braised beef noddle soup": [], "house special seafood noodle soup": [], "curry seafood noodle soup": [], "pickled cabbage and pork noodle soup": [], "hot and sour intestines noodle soup": [], "meatball noodle soup": [{"excerpts": ["We ordered shanghai salted chicken (4/5),  shanghai dumplings (4/5), house special noodle soup with beef flanks (3/5), and lion head meatball noodle soup (5/5). ", "We both like the lion head meatball noodle soup! ", "The meatballs (you get 2 pieces only) are well-seasoned and the soup is somewhat bland, but they go so well together. ", "The home-made noodle itself is fresh and chewy. ", "Highly recommend you to order the lion head noodle soup. ", "The dumplings are juicy, but the skin is too thick.  ", "The house special noodle soup was too spicy for me to finish it all ", "and the beef flanks were a bit overcooked which made it hard to chew. ", "I would definitely go back for more lion head meatballs noodle soup."], "author": "Cindy W.", "review": "My bf and I passed by this place several times and decided to try this place out for the first time. We were immediately greeted by a friendly waitress who can speak Mandarin, Cantonese and English. We ordered shanghai salted chicken (4/5),  shanghai dumplings (4/5), house special noodle soup with beef flanks (3/5), and lion head meatball noodle soup (5/5). We both like the lion head meatball noodle soup! The meatballs (you get 2 pieces only) are well-seasoned and the soup is somewhat bland, but they go so well together. The home-made noodle itself is fresh and chewy. Highly recommend you to order the lion head noodle soup. The dumplings are juicy, but the skin is too thick.  The house special noodle soup was too spicy for me to finish it all and the beef flanks were a bit overcooked which made it hard to chew. I would definitely go back for more lion head meatballs noodle soup.", "rating": 4, "date": "2016-09-25"}, {"excerpts": ["The 'Shanghai style fish' appetizer and the 'lion head meatball noodle soup' are my usuals here.  ", "They're quite good.  ", "I would stay away from their dishes involving clams or other seafood as those are not guaranteed to be fresh (like the 'beef, tomato clam noodle ", "soup'...", "you will want to spit the clams out and fort/unfort there are only like 4 of them in the soup dish).  ", "Overall the flavors are authentic Chinese ", "so I do rank this among the top chinese restaurants I'd like to frequent in the neighborhood."], "author": "Evelyn H.", "review": "The 'Shanghai style fish' appetizer and the 'lion head meatball noodle soup' are my usuals here.  They're quite good.  I would stay away from their dishes involving clams or other seafood as those are not guaranteed to be fresh (like the 'beef, tomato clam noodle soup'...you will want to spit the clams out and fort/unfort there are only like 4 of them in the soup dish).  Overall the flavors are authentic Chinese so I do rank this among the top chinese restaurants I'd like to frequent in the neighborhood.", "rating": 4, "date": "2016-06-17"}], "tomato beef clam noodle soup": [], "szechuan dan dan mein": [], "braised chicken noodle soup": [], "kimchi noodle soup": [{"excerpts": ["The Kimchi noodle soup is fantastic!!! ", "Spicy and fantastic!!! \n", "They took us in right as they were closing-  ", "and so glad they did!   ", "We'll be back!"], "author": "Aaron R.", "review": "The Kimchi noodle soup is fantastic!!! Spicy and fantastic!!! \nThey took us in right as they were closing-  and so glad they did!   We'll be back!", "rating": 5, "date": "2018-04-06"}], "delicacies noodle soup": [], "vegetable noodle pumpkin soup": [], "satay beef noodle soup": [], "chicken giblets with pickled peppers noodle soup": [], "boiled fish with pickled cabbage noodle soup": [], "spicy ground beef and mushroom noodle": [{"excerpts": ["My 2 personal favorites are #74 spicy ground beef and mushroom noodle and # 76 noodle with scallion and dry shrimp.\n\n"], "author": "Lawrence L.", "review": "Great Shanghai Chinese Noodle House in the heart of the Richmond District.  The noodles are authentically fresh and with great texture.    My 2 personal favorites are #74 spicy ground beef and mushroom noodle and # 76 noodle with scallion and dry shrimp.\n\nMust try!!!!   Great food, fast service, and super convenient location for pick-up.....  Usually double park in front of the driveway on the 2nd Avenue side.", "rating": 5, "date": "2018-09-22"}], "beijing bean sauce noodle": [], "noodle with scallion and dried shrimp": [], "satay beef dried noodle": [], "thai style seafood dried noodle": [], "baked noodle with seafood and cheese": [], "curry chicken baked noodle": [], "house special pan fried noodle": [], "vegetable pan fried noodle": [], "tomato beef pan fried noodle": [], "beef chow mein with black pepper sauce": [], "satay beef chow mein": [], "malaysia style chow mein": [], "preserved mustard greens rice cake with pork": [], "spicy twice cooked slice pork rice cake": [], "singapore style chow fun": [], "stir fried green beans": [], "stir fried spinach": [], "spicy generals tso chicken": [], "spicy curry chicken": [], "spicy kung pao chicken": [], "basil chicken with mixed green vegetable": [], "spicy beef with black paper sauce": [], "beef and asparagus with black bean sauce": [], "spicy mongolian beef": [], "spicy mango beef": [], "spicy shredded pork with garlic sauce": [], "shredded pork with sweet bean sauce": [], "spicy kung pao shrimp": [], "lion head meatballs casserole": [], "braised lion head meatballs": [], "spicy generals tso meatless chicken": [], "meatless chicken with lemon sauce": [], "spicy kung pao tofu": [], "stir fried mixed vegetable": []}