{"karaage appetizer": [], "geso age calamari": [{"excerpts": ["Tako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken "], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}], "tako wasabi marinated octopus": [{"excerpts": ["Tako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken "], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}], "mentai ika somen": [], "pieces mustard green": [], "piece ume pickled plum": [], "piece yaki onigiri": [], "daikon salad": [{"excerpts": ["They were out of the Daikon salad, so we went with the Gomae (spinach) and it was delicious.  ", "Probably the best I've had.  ", "The spinach was cooked and cooled perfectly, and there was just enough sauce, not too sweet.  "], "author": "Lindsay B.", "review": "What can I say that hasn't already been said about Halu...\n\nI found the small space charming, the Beatles memorabilia funny, the service friendly and helpful, and the food delicious.  Oh, and their \"no sushi\" poster on the front door made me laugh.  The television show they were playing was something with cute girls and baby animals.  It was very odd, but it made everyone in the place laugh.\n\nAs to the food...\nBacon wrapped mochi?  Yes please!\nBacon wrapped enoki?  Yum!\nYakitori chicken skins?  Mmmm!\nYakitori shitake mushroom?  Of course!\n\nThey were out of the Daikon salad, so we went with the Gomae (spinach) and it was delicious.  Probably the best I've had.  The spinach was cooked and cooled perfectly, and there was just enough sauce, not too sweet.  I sound like Goldilocks, but seriously, it was delicious.\n\nMy only complaint was that I would have liked the bacon to be cooked about a minute longer, but that's personal preference.  The bf thought it was cooked perfectly.  Guess I just like my bacon extra crispy.\n\nNext time I'll have to try the ramen, as the waitress told us the noodles don't have egg (I'm allergic) - yay!", "rating": 4, "date": "2011-05-18"}, {"excerpts": ["Onigiri \nRamen \nPork jowl skewers \nBacon-wrapped mochi \nDaikon salad \nCold tofu\n\nArrive early, although it's off the beaten path of the main drag of Clement Street, the six tables fill up quickly."], "author": "Lee H.", "review": "This diminutive spot adorned with Beatles paraphernalia really wowed me. The space is so small our waitress kept bumping into us, charming, but not for anyone who is the least bit claustrophobic. Despite being so small with an open kitchen, we couldn't smell frying food while dining, nor did we smell like fried food upon leaving. Major bonus. \n\nBecause it's izakaya style, we decided to go for it and order a mountain of small bites. \n\nStuffed mushrooms \nOnigiri \nRamen \nPork jowl skewers \nBacon-wrapped mochi \nDaikon salad \nCold tofu\n\nArrive early, although it's off the beaten path of the main drag of Clement Street, the six tables fill up quickly.", "rating": 5, "date": "2012-02-16"}, {"excerpts": ["Onigiri with pickled mustard greens, daikon salad with a nice sauce, cold tofu over ice, and fried stuffed mushrooms were all hitting the right spot.\n\n"], "author": "Henry H.", "review": "Great Izakaya, tiny space with good eats and great service.\n\nWe decided to try a little sampler covering most of the menu- yakitori of beef with shiso leaf, pork jowel, bacon wrapped mochi...all had great grilled flavor. Onigiri with pickled mustard greens, daikon salad with a nice sauce, cold tofu over ice, and fried stuffed mushrooms were all hitting the right spot.\n\nTop it off with the fried chicken ramen with a super tasty broth that had strong hints of ginger and we were satisfied.", "rating": 5, "date": "2012-01-16"}, {"excerpts": ["Great grilled and fried skewer foods, daikon salad, yaki onigiri, and more. ", "And the people who work here are always super nice and give great, honest suggestions. ", "This is a great local spot to come w/a group of friends or even a casual date."], "author": "Emy s.", "review": "I can't believe I haven't reviewed this place yet. \n\nI.Love.Halu.\nThis small, hole-in-the-wall spot in a random neighborhood has great izakaya food and REAL japanese beer. Not the kind that is \"imported\" from Canada, but actually from Japan. Great grilled and fried skewer foods, daikon salad, yaki onigiri, and more. And the people who work here are always super nice and give great, honest suggestions. This is a great local spot to come w/a group of friends or even a casual date.", "rating": 5, "date": "2010-06-16"}, {"excerpts": ["It takes a good thirty minutes for the first dish to arrive: the daikon salad...\n\n", "The daikon salad isn't so good. ", "The vinagrette dressing is a bit bland, and the dish itself tastes more like a radish salad -- it's not just sliced Oriental daikon, but Occidental radish as well. ", "The radish is strong, bitter, and a mismatch for the more delicate daikon. "], "author": "Perci N.", "review": "So I do as I say. I go in for seconds to try the ramen.\n\nWe get the counter -- very uncomfortable for someone with long legs. We get our menu. Not menus. They only have one available -- this happened my first visit, as well. Place our orders -- well, attempt to. As we're giving the girl our order, customers walk in. She actually stops taking the order, goes and seats them, gives them menus, then returns to start the ordering process again. The delay doesn't really matter. It takes a good thirty minutes for the first dish to arrive: the daikon salad...\n\nThe daikon salad isn't so good. The vinagrette dressing is a bit bland, and the dish itself tastes more like a radish salad -- it's not just sliced Oriental daikon, but Occidental radish as well. The radish is strong, bitter, and a mismatch for the more delicate daikon. Both are called radishes, but they have very different tastes.\n\nMy Ramune-hai (Japanese lime soda with shouchuu) -- not bad. Not bottom of the barrel soju. The tea we ordered? It never arrived -- this almost happened my first visit, as well. (We got tea at the very end of the meal the first time.)\n\nThe chashu shoyu ramen -- the broth was cloudy, a sign that the soup probably boiled over. It also didn't have a strong pork flavor -- not enough bones. The fresh Chinese egg noodles were fine. What bothered me the most was the too-fibrous, hard menma (bamboo shoots) from a can -- the kind you find in Chinese stores in the little tins used for stir fry, and not the ones used for ramen.\n\nTo finish things off, we tried the sake yaki onigiri (grilled salmon rice balls). I've never had an onigiri where the salmon was in little bits spread throughout the rice ball, as opposed to the normal way with salmon in the middle. And I've definitely never had a salmon onigiri with bones in it before... As for the yaki (grilled) part -- it was barely grilled. The rice was barely browned, and there definitely was no crunch to it. Definitely the weakest dish of the night.\n\nYeah, I think 1.5 star average is about right...", "rating": 1, "date": "2008-08-22"}, {"excerpts": ["Waited forty minutes for a plate of daikon salad and a bowl of ramen that was underwhelming."], "author": "Tangerine L.", "review": "Meh.\n\nWaited forty minutes for a plate of daikon salad and a bowl of ramen that was underwhelming.", "rating": 2, "date": "2008-08-22"}, {"excerpts": ["from the menu - shishamo and daikon salad.  ", "everything was so good.  ", "on cold days like these in sf, and ok sf wimps its not THAT cold.  ", "but the lava ramen really hits the spot.  ", "it is mouth tingling-ly spicy!  ", "the noodles are aldente and chewy.  ", "the broth is oily ", "but oh well. ", "fat keeps us warm!  ", "grilled mochi bacon.  ", "anything wrapped in bacon is good.  "], "author": "claudia y.", "review": "ok so you know how some things are just better on second look.  the more you look at it the more beautiful it becomes.  ok dont take it so literal.  but i came back to halu a second and third time a few days later and love this place!  \n\nthese two times we ordered almost exclusively off the specials menu on the whiteboard on the wall - the lava ramen, mochi wrapped in bacon, okonomiyaki.  from the menu - shishamo and daikon salad.  everything was so good.  on cold days like these in sf, and ok sf wimps its not THAT cold.  but the lava ramen really hits the spot.  it is mouth tingling-ly spicy!  the noodles are aldente and chewy.  the broth is oily but oh well. fat keeps us warm!  grilled mochi bacon.  anything wrapped in bacon is good.  and their okonomiyaki is thin and very good too!", "rating": 4, "date": "2009-12-11"}], "small spring salad": [], "kaisou salad": [], "okonomiyaki": [{"excerpts": ["While there are plenty of \"Japanese tapas\" in the form of skewers and okonomiyaki (my favs here), etc.", ", I would think of them as pairing to your beers and overall experience. ", "Difficult to become full here unless you plan on making it rain. ", "Or maybe that's just how SF is."], "author": "Jeffrey C.", "review": "Mindset: come here for dimly lit hole-in-the-wall / grungy vibes. Expect it to be cozy or cramped -- you know yourself the best.\n\nFood: beer (hey, it's an izakaya, and see below)\n\nOther food: I would approach this place not as a meal but a place to chill/chat. While there are plenty of \"Japanese tapas\" in the form of skewers and okonomiyaki (my favs here), etc., I would think of them as pairing to your beers and overall experience. Difficult to become full here unless you plan on making it rain. Or maybe that's just how SF is.", "rating": 4, "date": "2018-10-13"}, {"excerpts": ["Would recommend okonomiyaki, Mayo scallion chicken skewers, and tsukune meatballs. ", "Of course there are many other good items too. ", "Only downside is a lot of the items come out slightly burnt, a few dishes were like this ", "so I think they overcook it a bit on purpose."], "author": "Tom P.", "review": "Small authentic izakaya with a Beatles theme. Small paid public parking lot nearby. Great variety of items on the menu.\n\nWould recommend okonomiyaki, Mayo scallion chicken skewers, and tsukune meatballs. Of course there are many other good items too. Only downside is a lot of the items come out slightly burnt, a few dishes were like this so I think they overcook it a bit on purpose.", "rating": 4, "date": "2018-09-02"}, {"excerpts": ["OKONOMIYAKI $18 - ", "To be honest, not worth the price "], "author": "Angela P.", "review": "This place is the definition of hidden gem hole in the wall. From the outside, this restaurant is so unassuming that we almost walked right past it.Thankfully we didn't because this place was BOMB.\n\nThe inside is also pretty small so it fills up fast but you can put yourself on the waitlist on yelp ahead of time. So convenient and you don't have to wait!\n\nFYI they have a \"secret menu\" and we ordered a set from there called the Saikyo Set as well as other skewers.\n\nSAIKYO SET $25 - it came with a chicken gizzard, heart, skin, liver, and cartilage skewer. GET THIS ONE, it's a must. My favorites were the gizzard, heart and liver. The gizzard and heart were perfect and not too chewy, and the liver was amazingly soft and rich and DELICIOUS. \n\nBEEF TONGUE $8 - The individual meats comes with two skewers. This was probably my favorite of the night. It was amazingly flavorful and perfect texture, not too chewy like some other places make it!\n\nCHICKEN WING $6 - This one was kind of salty for my liking but I think it also comes with some thigh pieces that were classic and great for tasting the char flavor on the meat. \n\nOKONOMIYAKI $18 - To be honest, not worth the price but it tasted like I expected and made a good addition to our overall meal so we weren't just eating meat the whole time.\n\nI'm already thinking about when I can come back ...", "rating": 5, "date": "2018-06-05"}, {"excerpts": ["We ordered everything.. wings (twice!), gizzards, bacon-wrapped enoki (impossible to bite thru), shishitos, pork belly, beef tongue, calamari, takoyaki, okonomiyaki (ours was a bit undercooked), ramen... couple bottles of sake (there were 4 of us!)", "... ", "I'd say almost everything was a hit, or I'd order everything again except the enoki. "], "author": "Vivian H.", "review": "Lovely little hole-in-the-wall that seems like it's been here forever. Think I read somewhere this is second-generation now, continuing a tradition of great yakitori and unapologetically weird decor.\n\nI've had this place bookmarked forever and was stoked when my friend wanted to take me here. It's popular and tiny so prepare to wait. Pro tip: get on the waitlist remotely on yelp!\n\nBig menu of goodies, and a wide variety of sakes too. You can even do a sale flight! We ordered everything.. wings (twice!), gizzards, bacon-wrapped enoki (impossible to bite thru), shishitos, pork belly, beef tongue, calamari, takoyaki, okonomiyaki (ours was a bit undercooked), ramen... couple bottles of sake (there were 4 of us!)... I'd say almost everything was a hit, or I'd order everything again except the enoki. Go crazy. \n\nService was really friendly and helpful, but given how busy they were, drink orders were forgotten. When I did get my oolong cocktail I was disappointed.. kinda just tasted like diluted tea, which is what it is I suppose.", "rating": 4, "date": "2018-08-13"}, {"excerpts": ["But their okonomiyaki was really good, not too flat but not super thick."], "author": "Jerianne G.", "review": "This place is pretty much hidden and safe from the world lol.\n\nLocated on 8th street and Clement, you wouldn't even think about this place compared to the other stuff around but don't knock it till you try it.\n\nPros:\n- Friendly waiter  (it wasn't busy when I came with my cousin ) So he pretty much told us what was good.\n- Very homely feeling when you're there with an interesting interior.\n- Their menu has ramen, yakitori, appetizers and such. \n- Oldies are played so that's always cool\n\nCons:\n- Wait time is pretty long so.. get there early.\n- Super small interior, so not so great for big parties.\n- Food is on the pricier spectrum.\n- Parking around the area is always a con lol.\n\nI haven't been here in YEARS so I'm not sure if everything has changed or not. But their okonomiyaki was really good, not too flat but not super thick.", "rating": 4, "date": "2018-03-20"}, {"excerpts": ["We also got Okonomiyaki (japanese style pizza pancake topped with traditional tonkatsu sauce, mayo, aonori and red ginger)", ", it's vegetarian, very similar to a Korean seafood/non-seafood pancake. ", "I liked it, but if you don't like Korean savory pancakes in general "], "author": "Lilian L.", "review": "You either will die reading all of this or it will be beneficial.\n\nI like to remember things so yes, it's a long one.. \n\nTake-aways:\n\nGET THE:\n-Crispy Chewy Soft Skin\n- Yakitori Omakase Dinner\n\n-----\n\nLast night was my second experience here. The first with a friend and the latter with my cousins. It was Saint Patty's and honestly, we weren't going out for the holiday festivities (we actually forgot), but the Richmond was nice because.. even near the bars and the food places: it was 'dead': nothing packed, just the usual numbers. (If you want crazy: try the Castro and other areas.. or go to DTSJ like San Pedro Square). It was really nice not dealing with crazy people. We did walk to a local bar while we waited for our spot here (they said about 30 minutes and they called us). \n\nIt's a very small establishment with Beatle's memorabilia all over the place and Beatle's music playing in the background. I really like this place. My cousin and his girlfriend LOVE this place, but my other cousin has never gone. And it is sadly closed on Sundays (we were trying to go last Sunday after trying out couches at Living Spaces). So we did a raincheck and went last night.  \n\n-\n\nAnyways to the food..\n\n2nd experience:\n\nI ordered the beef tongue (comes in a set of two skewers). It was really good. And I appreciated that it was prepared differently than the beef tongue that I would also receive in my dinner set mentioned below. My dinner set was randomized so I didn't know I would be getting the 'same' thing, but it wasn't remotely the same. So thumbs up. \n\n------\n\nI also got the Yakitori Omakase Dinner which is one of their specials: \n7 assorted yakitori skewers (chef's choice so it varies on any given day)\n\nMy assortments came with a delicious beef tongue, \nplum soaked beef with herbs (that was my favorite), \norka (everyone loved this, but I thought it was okay),\npork (my cousin Kyle's favorite, but I'm not huge on charcoaled meats),\nmushrooms (super delicious), \nchicken meatball, and \nsalmon (my cousin Syd's favorite and it was good but it's not my go-to).\n\n*beef tounge isn't as chewy as the leunga of a burritto so if you were wondering on texture, I can't do super chewy meats, I think if you've never had tounge: it's a good starting dish to get here. It's really good.\n\nThe dinner comes is served with rice, miso soup and organic spring green mix salad.  The miso is really good here, they make it different than any place I've ever been too. They have enokitake mushrooms in their miso and it's not a super salty broth or anything, it's just dead-on good. \n\n**veggie choice available for the assortments \n\n--------\n\nWe also got Okonomiyaki (japanese style pizza pancake topped with traditional tonkatsu sauce, mayo, aonori and red ginger), it's vegetarian, very similar to a Korean seafood/non-seafood pancake. I liked it, but if you don't like Korean savory pancakes in general you won't like this, it's the same texture.\n\n------\n\nMy cousins got the Combination (I don't believe this is on the menu, but written on one of the boards on the wall) & Karaage Ramen. The ramens were good. This isn't really the right place to get Ramen, but it's good with the food we had.. we did order a lot.. so you might want to tone it down a notch. \n\n-----\n\nOne cousin got a sake flight (where they choose for you, but there's a lot of other options where it's not a surprise) and they enjoyed it. \n\nI just choose not drink so I can't comment on anything. \n\n----\n\nOne cousin got 2 Spicy Mentai Caviar Mayo Chicken, so all four of us got a skewer and it was really good. \n\n-----\n\nFirst experience:\n\nGot the takoyaki, crispy chicken wings (super small, my friend was disappointed.. I think it was typical sizing), I got the Crispy Chewy Soft Skin (comes in two) and that's my absolute favorite.", "rating": 5, "date": "2018-03-18"}, {"excerpts": ["We ordered the yakitori omakase, okonomiyaki, takoyaki, porridge (since there's no ramen), erichan and karaage.  \n", "The takoyaki was bomb!  ", "I wish I took a picture of it.  ", "They're so good ", "and we were super hungry, no one took a picture .  ", "The yakitori of course was awesome!  ", "Erichan and porridge were on the salty side but savory.  ", "The karaage and the okonomiyaki was also good.  ", "Although, my friend said she's had better some place else.\n", "Overall, their food is great, the service was also good and fast.  ", "Their waitresses stride from customers to customers.  ", "This place is small and gets packed.  ", "Not good for big groups."], "author": "Bash B.", "review": "The place itself is small.  It only has about 7 tables with a booth that can fit 5-6 people.  A lot of the reviews said their yakitori is super good.  Well, it's true!  They're super good! \nWe ordered the yakitori omakase, okonomiyaki, takoyaki, porridge (since there's no ramen), erichan and karaage.  \nThe takoyaki was bomb!  I wish I took a picture of it.  They're so good and we were super hungry, no one took a picture .  The yakitori of course was awesome!  Erichan and porridge were on the salty side but savory.  The karaage and the okonomiyaki was also good.  Although, my friend said she's had better some place else.\nOverall, their food is great, the service was also good and fast.  Their waitresses stride from customers to customers.  This place is small and gets packed.  Not good for big groups.", "rating": 5, "date": "2018-05-12"}, {"excerpts": ["The Okonomiyaki is pretty standard to other Okonomiyaki. ", "Don't get me wrong, it's good. ", "Good that I order it ", "almost Everytime ", "I'm there. "], "author": "A L.", "review": "So my first review was almost 8 years ago. I totally didn't dive into the yakitori back then during my initial review. Boy, did I miss out. After frequent visits, from then to now, I totally fell in love with the yakitori. By far the best in the city. \n\nEverything is good on the menu. I mean, everything. And I have tried it all. \n\nMy favorite has to be the okra and the eggplant. I can eat those everyday. Beef belly, beef tongue, and chicken skin are a must. \n\nThe Eri-Chan special is delicious. To try explain what it is based off of eating it for many years, the Edi-Chan special is mochi pan fried in butter, then wrapped in seaweed. So chewy and soft, so flavorful and warms the body. \n\nThe Okonomiyaki is pretty standard to other Okonomiyaki. Don't get me wrong, it's good. Good that I order it almost Everytime I'm there. It will fill you up for sure. \n\nOn a busy night, it can get pretty hectic and busy, so keep track with your order. Erika and Sayaka are awesome and keep the vibe going. It was cool to see their pops Shig at work when I first was there. It makes me happy to see after all the years, the cool vibe is still the same. \n\nPlaylist is always on point in there and paying respect to the guardian in the restroom is always cool. (If you have ever been, I hope you know what I'm talking about.) \n\nContinue the good work Halu! And I will continue to eat all the skewers and food you have to offer!", "rating": 5, "date": "2018-05-05"}, {"excerpts": ["We ordered the karaage ramen, chashu ramen, okonomiyaki, and bacon wrapped mochi. ", "It was a lot for two people, but to the surprise of our waitress (who warned us it was a lot!), we finished everything but half of the okonomiyaki. \n\n", "As for the food, the okonomiyaki was hot and delicious, and I actually liked it more than the ones we had in Osaka, Japan. ", "I enjoyed that it was lighter in flavor and not drenched in mayo. ", "The portion was huge and can be a meal in itself, rather than an appetizer.... ", "Same for the ramen, the portions were large! ", "The noodles were thin and the broth light as well. ", "The karaage was crispy on the outside and the meat moist - I would definitely suggest taking the karaage out of the bowl ASAP, so it doesn't get soggy in the broth. ", "Alternatively, request for the karaage to come in a separate plate.  ", "The bacon wrapped mochi was also delicious, though not special. ", "My favorites of the meal were definitely the okonomiyaki and ramen. \n\n"], "author": "Christine L.", "review": "Halu is definitely one of my favorite Japanese restaurants in SF. It is a little on the pricier end, but portions are large and the food is so delicious! We ordered the karaage ramen, chashu ramen, okonomiyaki, and bacon wrapped mochi. It was a lot for two people, but to the surprise of our waitress (who warned us it was a lot!), we finished everything but half of the okonomiyaki. \n\nSeating is limited here- we called in advance to check if there were any open tables, and when we arrived, were seated right away. The interior of the restaurant is small and retro styled - It makes for a cozy, intimate meal. \n\nAs for the food, the okonomiyaki was hot and delicious, and I actually liked it more than the ones we had in Osaka, Japan. I enjoyed that it was lighter in flavor and not drenched in mayo. The portion was huge and can be a meal in itself, rather than an appetizer.... Same for the ramen, the portions were large! The noodles were thin and the broth light as well. The karaage was crispy on the outside and the meat moist - I would definitely suggest taking the karaage out of the bowl ASAP, so it doesn't get soggy in the broth. Alternatively, request for the karaage to come in a separate plate.  The bacon wrapped mochi was also delicious, though not special. My favorites of the meal were definitely the okonomiyaki and ramen. \n\nOverall, great Japanese restaurant - will be coming back!", "rating": 5, "date": "2017-03-21"}, {"excerpts": ["Okonomiyaki  a bit on the pricy side for what it is., but tasty. ", "I'd take friends and guests here while touring the Clement street/ Richmond scene. ", "The decor is rock & roll from days past with Beatles featured prominently. ", "Funky and fun. ", "It can get crowded fast  as there are only about 25-30 seats. ", "Two people  food tab with a large beer each   $ 60-70- all in."], "author": "Aaron Z.", "review": "This little hideaway is one of the things that make SF so fun. It;s the kinda place you might find on some random street in Osaka, serving japanese tapas to small groups of friends drinking beer before heading out on the town. Yakitori is a must and you'll have no trouble finding other small bites, get the sampler and keep it simple. or ask for the \"secret menu\" . Okonomiyaki  a bit on the pricy side for what it is., but tasty. I'd take friends and guests here while touring the Clement street/ Richmond scene. The decor is rock & roll from days past with Beatles featured prominently. Funky and fun. It can get crowded fast  as there are only about 25-30 seats. Two people  food tab with a large beer each   $ 60-70- all in.", "rating": 4, "date": "2018-06-21"}, {"excerpts": ["Would definitely come back for more skewers and to try the okonomiyaki. ", "Come early; it's tiny, and there'll likely be a wait."], "author": "Kelly R.", "review": "I really enjoyed Halu! I've tried a lot of yakitori/skewer spots in San Francisco, and Halu has some of the largest skewer variety I've seen. While Halu is a little weaker in some areas (e.g., ramen, which I found bland), they excel with their meats.\n\nI enjoyed all of the skewers that I tried, but it's worth mentioning that beef belly skewer is one of the most delicious skewers I have ever had. It's absolutely unforgettable--melt-in-your-mouth fatty goodness and incredible flavor.\n\nWould definitely come back for more skewers and to try the okonomiyaki. Come early; it's tiny, and there'll likely be a wait.", "rating": 4, "date": "2016-12-17"}, {"excerpts": ["The Okonomiyaki was tasty and the Kara Age Ramen, though simple, was also satisfying. ", "One of the better izakayas in the city."], "author": "Mikey J.", "review": "It was good but not the best I've had. The food was at times salty and overall priced fairly high. They also were out of the sausage we came in specifically for. Service was not as fast with two different servers. We did not have to wait long for a seat. The Okonomiyaki was tasty and the Kara Age Ramen, though simple, was also satisfying. One of the better izakayas in the city.", "rating": 3, "date": "2017-08-29"}, {"excerpts": ["Okonomiyaki: A-.\n", "Nice texture and very tasty, flavorful sauce. ", "Not too thick. ", "I was hoping there could be more green onion to enhance the taste even more though. "], "author": "Simon C.", "review": "I have to say I'm quite pleasantly surprised by this tiny/hidden izakaya place!\n\n* * * EXPERIENCE * * *\n- Our server was pretty helpful in terms of suggesting us what food to order (which they came out to be really good too)\n- The restaurant was tiny but the seatings were still pretty comfortable, not too cramped nor loud\n\nCons:\n- The wait! (This is a big one) Halu does not take reservations, we arrived at 7 and were told there would be a 20 mins wait. But after 35 mins we still haven't got our table, so we went in and were told we would be the next party, then it took another 15 mins until we were finally seated... Granted we were asked to leave a phone number so they could call us when table's ready, but the extended waiting time was just too long compared with what we were quoted\n\n* * * FOOD * * *\nSpinach Salad: A-.\nA tiny appetizer recommended by our server, the spinach was fresh but it was the sauce that made the difference. It was peanut + miso kind of taste, good start of our meal.\n\nTontoro Skewer: A.\nCrunchy and tender, one of the best grilled pork belly I have ever had. Each piece of pork belly had an equal fat/meat ratio, the grilling time was just about right that the meat was still very juicy when it was served.\n\nChicken Skewer: A-.\nNothing surprising here but good quality of chicken meat and the addition of avocado was a nice match to the oily/greasy meat.\n\nGyutoro Skewer: A.\nThe beef belly was not as crunchy as pork belly, but definitely a lot more tender and juicy. Again the grilling time here was controlled very well. Some kind of sauce was put on the meat before it was served which made this dish even more delicious.\n\nChicken Katsu Skewer: A-.\nQuite an interesting skewer. Grilling a fried stuff seems to be an extra step and I couldn't really taste the grilling part of it anyway. There was some onion inside the chicken katsu too.\n\nGrilled Eggplant: B.\nQuite disappointed. Very bland even with the addition of ginger. Should have come with soy sauce instead.\n\nOkonomiyaki: A-.\nNice texture and very tasty, flavorful sauce. Not too thick. I was hoping there could be more green onion to enhance the taste even more though. Definitely a must-order dish.\n\nChicken Stuffed Mushroom: A-.\nAnother recommendation from our server. There was just a tiny bit of chicken meat in each piece of mushroom, but the combination of both was rather interesting.\n\nGeso Age: A-.\nThe squid legs were deep fried in just about the right amount of time, not too crunchy while the squid was still very tender. The sauce was once again very flavorful.\n\nSatisfied with almost all the dishes ordered! With beer and sake this little izakaya place is definitely a top choice for small group gathering!", "rating": 5, "date": "2016-03-27"}, {"excerpts": ["The menu features ramen, yakitori, and okonomiyaki--staples including choices with a spin, such as kara age ramen, sirloin yakitori, and a more-green-than-usual okonomiyaki. ", "Okonomiyaki ($17): ", "My favorite dish here, and probably the best okonomiyaki I've had in SF so far! ", "Usually I find it too saucy and carby, but Halu's version has a mild sauce drizzle, a slightly less starchy composition, and topped with a layer of nori flakes. "], "author": "Edna C.", "review": "Halu has personality. It's a pre-gentificatin-type OG that brings izakaya fare back to basics in a cozy unpretentious hole-in-the-wall. \n\nIzakayas in SF are all too often posh and shiny, striving to emulate authenticity with dramatic head-to-toe wood everything that almost looks more like a temple than a restaurant. In contrast, Halu's vintage diner ambiance and whimsical decor of Beatles paraphernalia makes me feel as if I had walked straight into a local joint tucked into alleyways in Japan. (Ironic that the quintessentially American aspects of the diner are what make Halu so authentically Japanese)\n\nThe menu features ramen, yakitori, and okonomiyaki--staples including choices with a spin, such as kara age ramen, sirloin yakitori, and a more-green-than-usual okonomiyaki. There are several good alchy selections as well, such as potato sake (reminiscent of vodka, as expected).\n\n(++) Kara-age ramen ($12): Personally I always find this to be an oxymoron since the kara-age would be good with anything besides sitting in a noodle soup and getting soggy. Although I still think the kara-age would be best on the side, I do commend the ramen here! The noodles are thin and bouncy, and unlike noodles typically found at ramen places (I suspect it's housemade or from Japan!) The broth is solid, a perfect balance of a nice robust flavor without being too thick and heavy.\n\n(+) Hiyashi chaku ($14): Not terrible, but I would pass. First of all, the plate is oval which looks pretty but makes it very difficult to mix all the ingredients together. Secondly, the chashu portions are a bit skimpy because the slices are very very thin. Overall it didn't stand out too much.\n\n(+++) Okonomiyaki ($17): My favorite dish here, and probably the best okonomiyaki I've had in SF so far! Usually I find it too saucy and carby, but Halu's version has a mild sauce drizzle, a slightly less starchy composition, and topped with a layer of nori flakes. Intriguing and tasty P:\n\nSince the place is small, the wait on a Friday night around 7pm is approximately 30 minutes, but they call when your table is ready, and there are various Asian grocery stores to browse around.\n\nIt came out to ~$24 per person: a little pricey but fairly standard in SF terms, and worth it for a  memorable food adventure in a fun setting.\n\nAnd yes, the food/decor do make good Instagrams, for those of you who take that into account :P", "rating": 4, "date": "2016-01-29"}, {"excerpts": ["The okonomiyaki is OK. ", "Not the best I've had, but edible.\n", "For my first izakaya experience out of Japan, it was really decent. ", "And the service is so friendly too."], "author": "Jenn T.", "review": "Great izakaya with a good menu. I highly recommend the beef tongue and gizzards! Yumm. I also enjoyed the ramen fairly well. That surprised me. The beer here is pretty good. I highly recommend the bacon wrapped mochi! Man, that was so good. I love the texture. The okonomiyaki is OK. Not the best I've had, but edible.\nFor my first izakaya experience out of Japan, it was really decent. And the service is so friendly too.", "rating": 4, "date": "2016-12-24"}, {"excerpts": ["I'm still on the hunt for okonomiyaki in the city.  ", "The one at Halu is a combination of beef, seafood, and chicken.  ", "I wish they stated that on their menu because I try not to eat beef, but I should've asked.  ", "Besides, it was really good and filling!  "], "author": "Vira P.", "review": "I'm still on the hunt for okonomiyaki in the city.  The one at Halu is a combination of beef, seafood, and chicken.  I wish they stated that on their menu because I try not to eat beef, but I should've asked.  Besides, it was really good and filling!  It really should be shared with two people.\n\nBecause I ate the entire thing, I didn't have room for anything else.  I know I need to come back on the days they have their specials.\n\nThe restaurant is intimate (seriously, a lot of couples dined here), with awesome Beatles memorabilia, and even better music.  It's nice to see places like this in my neighborhood.", "rating": 4, "date": "2015-12-13"}, {"excerpts": ["- Okonomiyaki pancake: 3/5, nothing special, not worth $17\n", "- Erichan special: 3/5, nothing special, pretty salty, very simple\n- Chashu ramen: 2/5, average, meat was tough\n", "- Hiyayakko: 1.5/5, literally tofu out of the box with some green onions and soy sauce. "], "author": "Jennifer H.", "review": "food: \n- Yakitori omakase dinner good 4.5/5, you can substitute out things you don't eat. Chicken wings especially good, got an additional order of it. comes with your standard miso soup, rice, and side salad.\n- Gyoza: 4/5, real crispy, comes on a sizzling plate. Filling was decent.\n- Okonomiyaki pancake: 3/5, nothing special, not worth $17\n- Erichan special: 3/5, nothing special, pretty salty, very simple\n- Chashu ramen: 2/5, average, meat was tough\n- Hiyayakko: 1.5/5, literally tofu out of the box with some green onions and soy sauce. Skip.\n\nservice: 2/5, this place is very understaffed. be prepared to receive your dishes out of order (appetizers came last).\n\njust come here for the yakitori. nothing else is memorable.", "rating": 4, "date": "2016-12-10"}, {"excerpts": ["For two people, we ordered and shared a five skewer saikyo chicken set, two beef steak skewers, a karaage ramen, and an okonomiyaki. ", "More than enough food, and took home a fourth of the okonomiyaki. ", "The saikyo set was a bit too exotic for our liking. ", "The gizzard was interesting. ", "The okonomiyaki ($17) is the item to get here. "], "author": "Christina G.", "review": "Went to Halu on a rainy Friday right when it opened. It is a very small and dimly lit restaurant and feels like youre at an old fashioned bar and hole-in-the-wall style atmosphere. There are a row of bar stools in the front and small tables in the back. I chose to sit at the small table in the back with the lamp under it. The server (super friendly and nice!) told us it was the most popular table since it was brightest. There are a bunch of beatles posters everywhere and beatles music playing in the background which gives it a cozy old vibe.\n\nFor two people, we ordered and shared a five skewer saikyo chicken set, two beef steak skewers, a karaage ramen, and an okonomiyaki. More than enough food, and took home a fourth of the okonomiyaki. The saikyo set was a bit too exotic for our liking. The gizzard was interesting. Two of them were quite bony, and we did not like the chicken liver. The belly steak was yummy as well as the avocado and guacamole beef skewer. Both were a little too chewy..\nI enjoyed the karaage ramen. It came with four big pieces of karaage, corn, red ginger, and onions. The okonomiyaki ($17) is the item to get here. It tasted authentic and reminded me of Japan. \n\nThere are many unique items to try. Food is tasty and a bit on the pricier side but I would come back. It was about $75 bucks total after tips.", "rating": 4, "date": "2016-03-12"}, {"excerpts": ["Love the karaage ramen (chicken on the side) and okonomiyaki."], "author": "Ariane M.", "review": "The bestttttt. Great vibe. great food. The owners and staff are so welcoming- i wish they were open 7 days a week. Love the karaage ramen (chicken on the side) and okonomiyaki.", "rating": 5, "date": "2018-04-04"}, {"excerpts": ["(3/5)\n- Okonomiyaki ", "(4/5) - Nice and filling, with a good mix of different savory flavors.  ", "A great dish to share.\n", "- Pork Jowl (4/5) ", "- Fatty and flavorful, served with a mustard dip.  ", "Good, but not quite as good as at Sozai.\n", "- Chicken stuffed mushroom (4/5) - Basically a chicken meatball inside of a mushroom.\n"], "author": "Simon L.", "review": "Relatively convenient even on a Saturday night at 7pm.  First, there's a small parking lot literally right next door.  Second, there's a great bar with tons of beer on tap one block away (Richmond Republic Draught House), so you're not twiddling your thumbs while waiting for your table.  For our party of 2, it took less than 30 minutes to get seated.\n\nWe tried a ton of different things:\n- Beef belly (5/5) - Absolutely awesome.  Well-marinated, nicely marbled, and perfectly cooked.  This was the best dish of the night.\n- Chicken heart (4/5) - Firm and crunchy - very tasty.\n- Chicken gizzard (4/5)\n- Chicken skin (4/5) \n- Chicken liver (3/5)\n- Chicken tendon? (3/5)\n- Okonomiyaki (4/5) - Nice and filling, with a good mix of different savory flavors.  A great dish to share.\n- Pork Jowl (4/5) - Fatty and flavorful, served with a mustard dip.  Good, but not quite as good as at Sozai.\n- Chicken stuffed mushroom (4/5) - Basically a chicken meatball inside of a mushroom.\n- Seaweed-wrapped mochi (2/5) - Not a huge fan of this, as it was definitely on the salty side.\n\nOverall, everything was really well seasoned, and it was a really enjoyable meal in a funky, cozy environment.  Would definitely come back!", "rating": 4, "date": "2016-02-14"}, {"excerpts": ["We also split a bowl of chasiu ramen which which had excellent broth and noodles, and a seafood okonomiyaki (pancake) which was pretty good. "], "author": "Allen T.", "review": "I had a fantastic dinner at Halu last night, with plenty of grilled offal on a stick and beer.  As others have said, this is a very tiny restaurant with very little seating - we took the last available seats at 5:45pm and I'm pretty sure that the people who showed up right after us must have waited more than 40 minutes. \n\nThe highlight of the dinner was definitely the outstanding yakitori. We had grilled tontoro (pork jowl) which was fatty and crunchy - much better than pork belly, chicken gizzards, chicken hearts, beef tongue, and beef belly (accurately described in the menu as \"melts in your mouth\"). We also split a bowl of chasiu ramen which which had excellent broth and noodles, and a seafood okonomiyaki (pancake) which was pretty good. Everything was accompanied with plenty of Sapporo beer. \n\nThe decor is very interesting - everything is Beatles themed, and the soundtrack for the night was fun 60's music.  Good times, and I'll be sure to come back again!", "rating": 5, "date": "2015-08-30"}, {"excerpts": ["I tried the: \n\nBeef & Veggie Okonomiyaki: The highlight of the night. ", "Order the okonomiyaki and stick to the yakitori, which seems to be quite popular here."], "author": "Maya S.", "review": "Small restaurant with Beatles galore. Service was friendly but a tad slow. The menu does warn that they operate in a very small kitchen so food may take a while. The music playing and the memorabilia covering the walls should keep you busy. I tried the: \n\nBeef & Veggie Okonomiyaki: The highlight of the night. It was crispy and soft with tasty bits of beef, topped with sauce, green onions and pickled ginger. I could have just eaten a whole one for dinner. \n\nLava Ramen / Karaage Ramen: Huge bowls. I wasn't impressed with the ramen broth, although I thought the karaage broth was tastier than the lava. Also, the noodles and the toppings weren't very exciting. Both bowls were spicy and definitely packed the heat (the karaage can be ordered not spicy). \n\nOrder the okonomiyaki and stick to the yakitori, which seems to be quite popular here.", "rating": 3, "date": "2013-08-22"}, {"excerpts": ["What didn't suck was the okonomiyaki. ", "What makes this version so great is texture. ", "I remember it like yesterday. ", "Crisp on the outside while being soft and gooey on the inside. ", "We ordered the seafood one ($15) but couldn't distinguish any of Nemo's friends in there ", "so I'd recommend saving a few bucks by getting the veggie and beef ($10). "], "author": "Earl G.", "review": "Quirky and fun little Japanese izakaya! \n\nBeatles memorabilia line the walls, Beatles music liven up the space, and the aroma of freshly grilled meats fill the air.\n\nThat's what you don't wanna miss here, the excellent yakitori. The grilled shisito peppers, pork cheeks, and beef tongue are my favorites. At about $2-3 a skewer it's best to share a bunch of dishes for the table and explore something interesting from their sake/beer menu.  Through the night the place gets noticeably louder.   \n\nThe ramen isn't the greatest but definitely solid, I got the lavu chashu ramen ($12.5) which was like a spicy oil slick of generous and \"tender enough\" pork pieces. Hearty bowl! I heart ramen.\n\n(I prematurely deleted all pics from this night!) Sucks! \n\nWhat didn't suck was the okonomiyaki. What makes this version so great is texture. I remember it like yesterday. Crisp on the outside while being soft and gooey on the inside. We ordered the seafood one ($15) but couldn't distinguish any of Nemo's friends in there so I'd recommend saving a few bucks by getting the veggie and beef ($10). (http://www.yelp.com/biz_photos/halu-san-francisco?select=57HhgYvmHiW__N0dEVcIjg#57HhgYvmHiW__N0dEVcIjg)\n\n~ Notes ~ \n*Given the size of the resto, parties of 4 is about the max you want to do. For my group of 3 on a Thurs, it was a 30 minute wait. \n\n*They text you when your table is ready. At least they did for us. \n\n*My type of hole in the wall. Parking took about 10 minutes. \n\nNext up, Ippuko in Berkeley. \n(http://www.yelp.com/biz_photos/halu-san-francisco?select=FiAiW7iIp1XVBaR6XOar8w#FiAiW7iIp1XVBaR6XOar8w)", "rating": 4, "date": "2013-03-15"}, {"excerpts": ["Their yakitori is excellent but sadly the okonomiyaki was too mushy without enough cabbage to give it some internal structure. ", "We went pretty early and didn't really have to wait which I hear is a rarity."], "author": "Misha T.", "review": "Pretty decent izakaya with a really great vibe/decor/soundtrack (beatles mostly). Their yakitori is excellent but sadly the okonomiyaki was too mushy without enough cabbage to give it some internal structure. We went pretty early and didn't really have to wait which I hear is a rarity.", "rating": 4, "date": "2016-06-13"}, {"excerpts": ["okonomiyaki)\n- erichan special (I believe this is the mochi)\n- meat lovers special \n- cha shu ramen\n\n"], "author": "Leslie L.", "review": "Beatles paraphernalia, endless yakkatori, and great timing makes this place a hit!\n\nFirst, love the decor and music. I couldn't help but stare at every bit of detail placed here. Now I enjoy minimalistic interiors but this place has the perfect balance of intrigue but not distraction (woops designerd rant).\n\nWe had:\n- seafood pancake (okonomiyaki)\n- erichan special (I believe this is the mochi)\n- meat lovers special \n- cha shu ramen\n\nI died with every bite starting with the mochi. I LOVE mochi and this just sparked my tastebuds because I've never had a savory version before. Try this is you're a mochi fan, you won't be disappointed! \n\nThe seafood pancake was huge for two people and woo was it tasty.  Sounds strange but my favorite part was the corn haha!\n\nIf you've never tried the yakkatori and crave meat, I'd just go for meat lovers to try versions flavors. Juicy, savory, melt in your mouth glory. Do it.\n\nLastly, I really enjoyed the ramen! I know a lot of people can be picky about ramen but all I know is that this hit the spot and really, that's all that matters.\n\nGo, and enjoy!", "rating": 5, "date": "2015-02-03"}, {"excerpts": ["The tendon, tongue, wings, and okonomiyaki were delicious, leaving me wanting for more after finishing the one that I shared with my wife. "], "author": "Stephen H.", "review": "Wonderful little izakaya that reminds me of the tucked away izakayas in Tokyo, particular one that I found underneath a big freeway overpass.\n\nThe tendon, tongue, wings, and okonomiyaki were delicious, leaving me wanting for more after finishing the one that I shared with my wife. The ramen was average so I would save your dollars there.\n\nService was friendly and helpful in choosing off the menu.", "rating": 4, "date": "2016-03-01"}, {"excerpts": ["Excellent tako wasabi, squid, ramen, okonomiyaki! "], "author": "Jenny W.", "review": "Excellent tako wasabi, squid, ramen, okonomiyaki! Service was a teeny bit slow because it's so busy and people order a lot, but it was worth it\n\nIt's soooo Japanese, cute, and cozy that it just reminded me of when I was studying abroad in Japan. My friends and I loved this place. Will be coming back again", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["The main reason my friends and I came to Halu one night was because we were craving okonomiyaki, which is not really all too common around SF.\n\n", "She recommended that we could share the okonomiyaki (we ended up all getting our own though), and recommended some drinks as well. ", "I think you should be prepared to be upsold on the alcohol though, so keep that in mind. ", "We ended up getting the sparkling peach jelly drink without checking the price, and we had acute sticker shock. ", "The okonomiyaki were very dense. ", "I got seafood and wasn't quite satisfied with the amount of seafood in it, but my friends got the beef one and were happy with it. ", "That being said, the okonomiyaki is better as a side, shared with a friend, rather than a full meal on its own. ", "I also got the beef tongue yakitori, and it was quite tasty and tender (not tough). "], "author": "Denise C.", "review": "Halu is a small little shop out in the Richmond. It's vibe is kinda like...old school cafe where there is live music (not that I know they actually do that). The main reason my friends and I came to Halu one night was because we were craving okonomiyaki, which is not really all too common around SF.\n\nHalu is quite small inside; it seats maybe 20 people max (I think I'm giving a generous estimate). The kitchen is actually right by the front, diner-style. You can actually sit by the kitchen, along the bar. There is a tiny bit more seating along the opposite wall and in the back. I would definitely not recommend this place for larger groups. Even with a group of 5, I feel like we were pushing it.\n\nOur waitress was very friendly and knowledgeable about the menu. She recommended that we could share the okonomiyaki (we ended up all getting our own though), and recommended some drinks as well. I think you should be prepared to be upsold on the alcohol though, so keep that in mind. We ended up getting the sparkling peach jelly drink without checking the price, and we had acute sticker shock. Service was very good nonetheless.\n\nThe food itself was good though. I mean, it wasn't extraordinary, but still satisfying. The okonomiyaki were very dense. I got seafood and wasn't quite satisfied with the amount of seafood in it, but my friends got the beef one and were happy with it. That being said, the okonomiyaki is better as a side, shared with a friend, rather than a full meal on its own. I also got the beef tongue yakitori, and it was quite tasty and tender (not tough). The drink I mentioned above was definitely a favorite at the table, everyone loved it.\n\nOverall, our experience at Halu was good. If I found myself back in the area, I would come back and try some other things :)", "rating": 4, "date": "2015-07-30"}, {"excerpts": ["We got the spicy chashu ramen and seafood Okonomiyaki (Japanese \"pizza\") for the mains.\n\n"], "author": "Alice W.", "review": "I have heard of the legend of Halu for ages. After years of years of yearning, I finally got a chance to try it out last weekend. We came early and were seated right away. To call the place a homage to the Beatles is a vast understatement. The walls are dripping with Beatles memorabilia and the speakers softly hum their tunes. There's even a Beatles drum set on the mezzanine. Well, you get the point, they love the Beatles. \n\nI'm not sure if it was intentional or not, but the restaurant is entirely staffed with women. Even the cook in the back is female. The vibe of the place reminded me of the venue in Kill Bill (the first one!) where our heroine went on a killing rampage in a Japanese restaurant/bar. Definitely very cool.\n\nNow we talk abut the food. To start, we went a bit wild on yakitori -- beef tongue, short ribs, bacon wrapped scallops, bacon wrapped tomatoes, chicken wings, and okra. We also ordered the spicy raw octopus and seaweed salad. We got the spicy chashu ramen and seafood Okonomiyaki (Japanese \"pizza\") for the mains.\n\nThe skewers were good. I loved everything, especially the bacon wrapped scallops and the beef tongue. The seasoning were light so you can really taste the freshness of the ingredients. Definitely order a few skewers to share!!\n\nThe spicy raw octopus had a strong wasabi kick that cleared our sinuses. This was my first time eating raw octopus and it was good. The seaweed salad is pretty standard and compared to other places, the portion size was good.\n\nNow, the main attraction, the ramen. I was amazed at how great the noodles were. The broth was top notch and the spiciness great for a cold night, but the noodles completely stole the show. It was so springy and the texture blew me away!! I asked the waitress and she told me that they air freight that stuff over from Japan. No wonder!!\n\nI didn't like the japanese pizza all that much because of all the sauce on top. It made it too salty for my taste. I think if that didn't have all the topping, it would be good. I would order it again, but sans the mayo and sauce.\n\nI will certainly be back to have more ramen and yakitori. A true SF gem!!", "rating": 5, "date": "2012-01-31"}, {"excerpts": ["We also tried the okonomiyaki. ", "It was a combination of pork beef and seafood. ", "This was super good. ", "Perfectly crisp on the outside and doughy and flavorful on the inside. ", "My only complaint is that I didn't like the combo of all the protein. ", "I'll probably just get pork next time. ", "I wish they made a Hiroshima style one. "], "author": "Joyce D.", "review": "Skewers are on point and most are between 5-9 dollars for two. Well flavored and perfectly cooked. \n\nI tried the chicken thigh katsu(probably my favorite thing ever. The breading was nice and crispy) citrus yuzu chicken wings (yummy but a little on a salty side for me at least. My bf loved it.) okra (nothing superbly special, but I love okra so much) beef tendon (I don't particularly like tendon but my bf loves it. From the one bite I took. It was very flavorful and soft) \n\nWe also tried the okonomiyaki. It was a combination of pork beef and seafood. This was super good. Perfectly crisp on the outside and doughy and flavorful on the inside. My only complaint is that I didn't like the combo of all the protein. I'll probably just get pork next time. I wish they made a Hiroshima style one. But I guess I'll have to continue my search for that kind. \n\nDocked one star cuz of service. Just a little inefficient and takes 5 mins to get a hold of a server. But overall. Loved this place. Will definitely come back!", "rating": 4, "date": "2016-02-20"}, {"excerpts": ["Halu combo okonomiyaki was like a chewy on the inside and crispy on the edges pancake. ", "It had a little of very meat in it. \n", "Their combo was also great. ", "Came with miso soup, rice, mini salad, and seven skewers of the chefs choice. "], "author": "Karen M.", "review": "Likes: Halu combo okonomiyaki was like a chewy on the inside and crispy on the edges pancake. It had a little of very meat in it. \nTheir combo was also great. Came with miso soup, rice, mini salad, and seven skewers of the chefs choice. The crispy chicken and beef steak were delicious. Two types of mushrooms were good. Another kind of chicken cut. I forget what the others were.  Friendly waitress. Parking not too bad on the street. \n\nDislikes: chicken was good but a little salty. My tongue was tingling afterward. Lucky for them I like salt, but even this salt lover has limits!  Also our cups of water smelled like soap, which is great because that means they're clean! But I was worried there might be some residual soap leftover so I didn't touch my water :(", "rating": 4, "date": "2015-08-11"}, {"excerpts": ["Do order up their Fried Chicken (Karaage) Ramen, Japanese Pancakes (Okonomiyaki) and Bacon Wrapped Mochi if you do decide to go!  "], "author": "Tiffany D.", "review": "The loooooong wait to get into this tiny hole-in-the-wall Japanese restaurant was agonizing!  \n\nMy friends and I, making it a party of ONLY 3, waited for 1.5 plus hours to get seated.  We were standing outside the entire time and even saw the fog gradually come in.  By the time we saw the fog, I was super antsy and super cold!\n\nTheir ramen, authentic Japanese dishes, selections of sake and ambiance of this place, is definitely worth checking out, but don't go for peak hours and never bring a huge party!  It's not made for big groups, but I would say a date for 2!\n\nThey gave us an order of complimentary sake for the wait.  I was not pleased still.  The time wasted waiting outside in the cold because the hole-in-the-wall restaurant is really small, does not balance out with 1 complimentary sake among 3 people!\n\nDo order up their Fried Chicken (Karaage) Ramen, Japanese Pancakes (Okonomiyaki) and Bacon Wrapped Mochi if you do decide to go!  Those three dishes surely makes a great combo!\n\nJust bring another person so you will be seated much faster and not become irritated by waiting!", "rating": 3, "date": "2013-05-30"}, {"excerpts": ["We decided to try various yakitori dishes (nonkotsu karaage, chicken and scallion, tsukune), takoyaki, okonomiyaki, and cucumuber/seaweed salad. ", "The yakitori skewers were all flavorful and quite filling. ", "The takoyaki was piping hot and the okonomiyaki was very tasty as well.\n\n"], "author": "J L.", "review": "Kitschy Beatles-themed restaurant with delicious yakitori and other small bites. This tiny restaurant is hidden away - I must have walked by it 4 or 5 times before realizing it even existed. However, apparently not everyone was as oblivious as me, since this place gets really crowded and there is likely to be a wait!\n\nI came here as a party of 3 and we waited for around 20 minutes for dinner on a Friday. Conveniently, they take your phone number down on the waitlist and will call you when a table is ready. There are plenty of bars in the area to get a drink at while you wait. \n\nWe decided to try various yakitori dishes (nonkotsu karaage, chicken and scallion, tsukune), takoyaki, okonomiyaki, and cucumuber/seaweed salad. The yakitori skewers were all flavorful and quite filling. The takoyaki was piping hot and the okonomiyaki was very tasty as well.\n\nService was alright - it's definitely a crowded and busy restaurant so the waitstaff were running around all the time and it was a little difficult to catch one of them to order our food. Nonetheless, everyone was very friendly and it was overall a positive dining experience. \n\nGood for dinner with small groups or a fun date.", "rating": 5, "date": "2016-05-12"}, {"excerpts": ["We ordered the following:\n\nCombination Okonomiyaki ($15)\n\nSkewers:\nChicken liver ($5)\n", "Okonomiyaki is a Japanese pancake. ", "The combination had veggies, seafood & beef. ", "The toppings is just like what they have on a yakitori. "], "author": "Kitty K.", "review": "On 8th street, it's the third establishment from the corner, you can easily miss this place. Literally,  a hole-in-the-wall, there's barely any room to walk into the restaurant. The decor is Beatles everywhere, which I absolutely loved! Table reading was Chinglish and provided amusing entertainment.\n\nCame here because was craving some yakitori and boy did they deliver! We ordered the following:\n\nCombination Okonomiyaki ($15)\n\nSkewers:\nChicken liver ($5)\nChicken hearts ($5)\nChicken gizzards ($5)\nBeef tongue ($6)\n\nThe skewers weren't dry & had just the right amount of char. Beef tongue was nice and tender. Seasoning was a simple salt & pepper for the skewers except the liver (which the marinated was delicious).\n\nOkonomiyaki is a Japanese pancake. The combination had veggies, seafood & beef. The toppings is just like what they have on a yakitori. So much flavor! \n\nLucky we came early because it got super packed very quickly. Definitely coming back :)", "rating": 5, "date": "2013-12-15"}, {"excerpts": ["Ramen and okonomiyaki were just Ok. ", "Okonomiyaki was heavy and doughy. "], "author": "Yuchi C.", "review": "Skewers are awesome, especially the beef tongue. We ordered 2 rounds of everything, love!\n\nRamen and okonomiyaki were just Ok. Okonomiyaki was heavy and doughy. Ramen was bland. \n\nWill definitely come back for more yakitori!", "rating": 4, "date": "2015-05-14"}, {"excerpts": ["It all started when I felt like having some okonomiyaki for dinner, and I was so eager to go to Japantown to order takeout.  ", "However, my mother had different ideas.  ", "She felt that Japantown is a little out of our way, despite the fact that I know the ins and outs of the area very well.  ", "I've had okonomiyaki before, and for the price we paid for our meals, I tasted more \"pancake\" than anything else.  ", "Although there was meat mixed into the dish just as I asked, I couldn't even taste it.  ", "Even with the sauce, mayonnaise, and aonori flakes, it was practically tasteless.  ", "Also, can somebody tell me what you have when you spell B-O-N-", "I-T-O followed by F-L-A-K-E-S?  ", "That's what their dish DOESN'T have; that's one of the main toppings you put onto it.  ", "Okonomiyaki is supposed to be a savory dish, and there was nothing appetizing about their version of it.\n\n", "Other than the good customer service, I would suggest that if you really want a taste of some real okonomiyaki to take a trip to Japantown.  ", "There's a couple of restaurants there ", "that prepare a very traditional and savory okonomiyaki, as well as a Westernized version of it as well."], "author": "Claudine P.", "review": "It all started when I felt like having some okonomiyaki for dinner, and I was so eager to go to Japantown to order takeout.  However, my mother had different ideas.  She felt that Japantown is a little out of our way, despite the fact that I know the ins and outs of the area very well.  I didn't want to argue with her anymore about it, so we chose a place that was a little closer to home -- low and behold, we found Halu.\n\nWhen we first walked in, I was actually a bit shocked of the decor for a Japanese restaurant.  It was a very rinky dinky place, with decor from the 1960s (i.e.: Beatlemania).  Although I'm not opposed to anything from the 50s and 60s, I found it redundant, considering that so many Beatles fans have vilified Yoko Ono as the woman who broke up the band.\n\nTo add more fuel to the fire, I felt that the food was nowhere near superb.  I've had okonomiyaki before, and for the price we paid for our meals, I tasted more \"pancake\" than anything else.  Although there was meat mixed into the dish just as I asked, I couldn't even taste it.  Even with the sauce, mayonnaise, and aonori flakes, it was practically tasteless.  Also, can somebody tell me what you have when you spell B-O-N-I-T-O followed by F-L-A-K-E-S?  That's what their dish DOESN'T have; that's one of the main toppings you put onto it.  Okonomiyaki is supposed to be a savory dish, and there was nothing appetizing about their version of it.\n\nThe reason why I gave this place a 2 is because despite the fact that the food wasn't to our liking, they definitely get points for their customer service; their waitresses were very kind and welcoming.  Originally when we walked in, the door was open, and where we were seated, we felt a really cold draft.  In an attempt to change seats with my mother, one of the waitresses noticed, and asked me if I wanted the door closed.  I said, \"yes\", and she did just that.  She was also very nice to allow us to take up one of their tables while we were waiting for our order to be boxed and bagged.\n\nOther than the good customer service, I would suggest that if you really want a taste of some real okonomiyaki to take a trip to Japantown.  There's a couple of restaurants there that prepare a very traditional and savory okonomiyaki, as well as a Westernized version of it as well.", "rating": 2, "date": "2015-02-15"}, {"excerpts": ["(2) Okonomiyaki (3) Ramen. ", "Seafood Okonomiyaki - It took close to 1.5 hours to make; however, the final product didn't quite justify the long preparation time. ", "It was tasty enough and the amount of seafood in it was generous, but the pancake itself was a little burnt. ", "After sitting on the table for a while, it hardened to a cracker-like texture. "], "author": "Natasha H.", "review": "With its kitschy decor, showcasing a vast collection of Beatles memorabilia and a giant poster of The Who, Halu feels more like a college dorm room than the restaurant that it purports to be. Not that this is necessarily a bad thing, as the Beatles-theme of this hole in the wall definitely offers a certain uniqueness that one would be hard-pressed to find elsewhere. \n\nHowever, this was sadly the most memorable aspect of our meal. While the food certainly wasn't poor, it remained largely unremarkable and if it weren't for its funky Beatles-theme, I may have forgotten about Halu altogether. \n\nFor starters, the wait time between arrival and actual food consumption is incredibly long. The restaurant is tiny, so it's almost guaranteed a table won't be readily available when you come. Combined with the snail's pace the kitchen maintains, a trip to Halu can be a pretty arduous one. \n\nWait time aside, the food was only middle of the line for me. I came to Halu for three reasons: (1) Bacon Wrapped Mochi (2) Okonomiyaki (3) Ramen. Unfortunately, none of these dishes excelled. \n\nBacon Wrapped Mochi - After months of fantasizing about it , I was super excited to finally sink my teeth into some. However, I was pretty disappointed with the real deal. While the texture of crispy bacon paired nicely with the the soft chewiness of mochi, Halu's was super greasy and on the bland side. \n\nSeafood Okonomiyaki - It took close to 1.5 hours to make; however, the final product didn't quite justify the long preparation time. It was tasty enough and the amount of seafood in it was generous, but the pancake itself was a little burnt. After sitting on the table for a while, it hardened to a cracker-like texture. So, try to eat it immediately, while it's still warm and kind of soft!\n\nRamen - This was the biggest disappointment. I opted for the Corn Butter one while my friends got the Lava and Spicy Karage Ramen. The annoying thing was that they staggered the timing of our ramen. The first two bowls came out together, but the third bowl didn't come out until 30 minutes later. As for the ramen itself, the noodles tasted like the instant kind and didn't have the springy texture that I prefer. The broth was nothing special. Too salty in my opinion. Also, if you have an aversion to spicy foods like I do, stay clear of the Lava and Spicy Karage Ramen. Even my friends who love spicy foods had a hard time getting these down. \n\nOverall, I might be willing to come here again. But, it definitely wouldn't be at the top of my list...especially not if I'm craving ramen. THREE STARS.", "rating": 3, "date": "2012-01-11"}, {"excerpts": ["* combo okonomiyaki was flavorful \n", "* stuffed mushrooms were okay \n", "* spicy chashu ramen was pretty good, loved the egg and big portion. ", "They don't skimp on the meat! "], "author": "Reggie L.", "review": "Came here on a Thursday night and got a table right away. Really a hole in the wall but they managed to fit my party of 7. I love the Beatles so the music and decor was awesome. Waitresses were super friendly and bubbly. Service was attentive. \nFood: they didn't have bacon that night :(\n* fried mochi was savory and really yummy \n* combo okonomiyaki was flavorful \n* stuffed mushrooms were okay \n* spicy chashu ramen was pretty good, loved the egg and big portion. They don't skimp on the meat! I'd say it's medium spicy\n\nGot a bottle of this sweet and spicy sake which was interesting and some asahi to finish the night. Overall, great service and extensive menu-- would come back to try their yakitori", "rating": 4, "date": "2014-10-10"}, {"excerpts": ["Included in my next to try list - bacon wrapped mochi, rib eye skewer, agedashi tofu and the seafood okonomiyaki (pancake).\n\n"], "author": "Geoff G.", "review": "The signage said it all: \"A Different Japanese Restaurant\". It was different alright. I have driven by a zillion times and never noticed the place until I read the reviews. I arrived @ 5.15pm and from the outside, it looked dark and dingy like there were some construction works going on inside. The sign at the front door still said \"closed\" and the frontage looked uninviting. The inside though was quite cute. The walls were adorned with Beatles paraphernalia, posters of the Grateful Dead, The Who and Jimi Hendrix. Signs of a bygone era like \"Love\", \"Peace\" and \"End of War\" were posted in the restaurant. The inside had a funky vibe and the ambience was like an old English pub. it also looked somewhat like my old college dorm! The atmosphere was incompatible with the kind of food they served though I don't mean it in a bad way. I found out that the reason for the upbeat hippie look. The yakitori chef (owner?) was a musician before and obviously a big Beatles fan.\n\nThe decor did bring back some fond memories of the 60s and 70s but the food didn't quite measure up. My biggest disappointment was the chashu ramen. The chashu smelled obnoxious and was a big turnoff. It smelled of pig's urine. Damn! This was the second time in three months that I was served with stinky chashu. My other experience was in Great Eastern in Chinatown. The bad pork spoiled the broth as well and my complaint to the server just fell on deaf ears. I can understand once in a while the shipment of pork they buy might be bad but I can't condone or understand how the chef could have failed to detect this and continue serving it to their customers. A big thumbs down on this one.  \n\nI always order skewer/yakitori items whenever i dined in an izakaya place. I am not sure why I picked the basic yakitori fare like chicken liver, chicken gizzard, shitake, stuffed mushroom and salmon yaki onigiri for the evening. They were not bad but were not great either. In addition, I tried the tako wasabi which had good flavor and did give my jaw a good work out. On hindsight, I am sure what I ordered were not their best. There were other stuffs in the menu yelpers raved about. Included in my next to try list - bacon wrapped mochi, rib eye skewer, agedashi tofu and the seafood okonomiyaki (pancake).\n\nThe restaurant does have a unique atmosphere that I like and has potential for improvement. On the ramen, they need to pay more attention to meat quality, go easier on the salt and allow the pork bones to simmer longer for better broth flavor.", "rating": 2, "date": "2013-01-04"}, {"excerpts": ["We ordered 5 kinds of skewers (chicken heart, beef tongue, pork jowl, bacon-wrapped asparagus x 2, and okra), veggie okonomiyaki (similar to pajeon), veggie don, some beverages, and later red bean ice cream. ", "The skewers arrived in several waves. ", "As described in the menu, it indeed took a while for the okonomiyaki to be prepared. ", "Somehow, it was this wait plus even more time before the veggie don (which I see as a much simpler dish) appeared. ", "The okonomiyaki included a faint scent x taste that I couldn't name, and I think it was from the combination of the herbs and fixin's on it. ", "I liked the crisp blackened areas on the top and bottom. ", "We took only three \"issues\" with the food. ", "Some of the salted skewers were a bit too salty for my friend, but my friend did appreciate the distinctiveness of the specially prepared house salt. ", "Also, the menu listed the veggie don as being over brown rice, but our rice was white. ", "The third thing I noted was that everything seemed oily: the meats, the vegetables, by association the rice - everything. ", "I realize it all had been made on the same greasy stove. ", "Also, props to our servers and cooks for their flexibility when, about 20 minutes after ordering, we remembered we'd wanted the okonomiyaki sans mayo.\n\n"], "author": "Dan B.", "review": "Coming here was a mishap. We intended to go to Kukje, but people were on CPT so we instead took the opportunity to cross this restaurant off the to-eat list. Even before entering, you know this place has spunk. The canopy says \"A Different Japanese Restaurant\" and the door has \"no sushi today (or tomorrow)\" and \"sushi free zone\" signs on it. The format is sign up and wait, but rather than a communal clipboard for soon-to-be diners, the list seemed to be managed mentally by the servers.\n\nOn a Tuesday evening, we were lucky enough to catch a table upon arrival due to the people before us on the list being neither present nor reachable by phone. Seating was quite limited, with 6 or 7 bar seats and about that many tables. We sat immediately by the door. If you're at the door table with a large(ish) person, I recommend seating them on the side of the table away from the door. As it was, the back of my chair was sometimes getting hit by the door, and a few times my elbow brushed passersby. The many people waiting mostly left and checked back later or waited outside.\n\nBeatles, Beatles, this place is absolutely crawling with Beatles. I hope you like them and I hope you've brushed up on your Beatles edition Rock Band. Beatles music plays from the psychedelic Beatles movie on the screen above the door. Posters are all over the walls and memorabilia crowds the bar top.\n\nAll this eye candy kept us busy during the long, drawn-out time it took for our order to be fulfilled in bits and pieces. The place was packed and something like two people were working the stove, so expect to be patient between ordering and getting your food. We ordered 5 kinds of skewers (chicken heart, beef tongue, pork jowl, bacon-wrapped asparagus x 2, and okra), veggie okonomiyaki (similar to pajeon), veggie don, some beverages, and later red bean ice cream. The skewers arrived in several waves. As described in the menu, it indeed took a while for the okonomiyaki to be prepared. Somehow, it was this wait plus even more time before the veggie don (which I see as a much simpler dish) appeared. Keep in mind that the tiny kitchen was cranking out dishes for everyone in the packed restaurant.\n\nThe food was, in a word, good. Picture in your mind - and mouth - much savory tastiness, and very slowly reread the food items I listed in our order. Imagine. Concentrate. Whatever feelings you had while doing that, that's how good the dishes were. The okonomiyaki included a faint scent x taste that I couldn't name, and I think it was from the combination of the herbs and fixin's on it. I liked the crisp blackened areas on the top and bottom. We took only three \"issues\" with the food. Some of the salted skewers were a bit too salty for my friend, but my friend did appreciate the distinctiveness of the specially prepared house salt. Also, the menu listed the veggie don as being over brown rice, but our rice was white. The third thing I noted was that everything seemed oily: the meats, the vegetables, by association the rice - everything. I realize it all had been made on the same greasy stove. Just be ready for it is what I'm saying.\n\nFrom the time we arrived to the time we departed (and afterward), the workers were more than nice. Friendly, patient, recommending, suggesting, describing... you know, the qualities and actions you want in people who are creating your meal experience. It was a pair of waitresses serving us, but the one who showed up more than the other was animated in her lively talk of the dishes. For example, the don bowl came and its recipient wondered how they'd eat it, as they only had chopsticks. My friend took this somewhat literally and asked our server how to eat the dish. Our server took this to another level and, along with hand gestures, told us her personal process of scooping a bit from one side, scooping some from the other, digging further to get the rice, etc.. This was after a showy recommendation of ways our table could mix up or split the dish to share it. Also, props to our servers and cooks for their flexibility when, about 20 minutes after ordering, we remembered we'd wanted the okonomiyaki sans mayo.\n\nI say the people were still nice after we left because, on our way to our car, we passed by one of the cooks who was hanging out on the sidewalk drinking a hot beverage. They had a friendly conversation with us, friendly even to the point of bowing way too many times. You know how it is. Maybe I'll have to return a few of those bows when friends and I go back to try some of the other dishes that we totally need to eat.", "rating": 5, "date": "2011-12-21"}, {"excerpts": ["beef and veggie okonomiyaki - BEWARE, there is some dried shrimp for those with seafood allergies!  ", "i wasn't a huge fan of this plate.  ", "there was too much sauce, too many flavors.  ", "but, i actually think this may be what authentic okonomiyaki is supposed to be like, "], "author": "Sandy L.", "review": "We came here tonight after my night class.  I've been wanting to eat at Halu for almost a year but never had an opportunity to go.  This place is GREAT!  \n\nRight when I walked in I can hear \"meeeshelllll my bell\" with the cute beatles themed interior.\n\nIt's a small mom and pop restaurant.  It probably can seat 20 on the tables and there's a bar seating area as well.  We arrived around 9pm so there wasn't a line to be seated, but the restaurant was a full house.\n\nWe ordered:\n\nchicken ka raage - A.  The batter was very light and served straight from the fryer.  Crispy on the outside, hot and juicy on the inside.  Cooked to perfection!  Some japanese restaurants serve the mayonnaise with the ka raage but. this place doesn't.  still a great appetizer full of flavor and juicy yummyness!\n\nmiso soup - i don't think i've ever had miso soup with enoki mushrooms and it was a nice complement to the tofu rather than just green onions.  i love how everything they serve is HOT, like they prepared it specifically for you.  it actually took me almost 5 minutes for me to drink the soup without being worried about burning my tongue!  the flavor was perfect.  salty, but not too salty. tofu was soft, but not so much that it was falling apart.  and i'm still loving the enoki mushroom!\n\nbeef and veggie okonomiyaki - BEWARE, there is some dried shrimp for those with seafood allergies!  i wasn't a huge fan of this plate.  there was too much sauce, too many flavors.  but, i actually think this may be what authentic okonomiyaki is supposed to be like, so it's probably just my personal taste in food.\n\nstuffed mushroom yakitori - my favorite of the night!  marinated to perfection.  again, served HOT.  you bite into the mushroom and it's a burst of delicious teriyaki, meat, mushroom all in one bite.  really really amazing.\n\nshort rib yakitori - very delicious!  i only had a small bite because i was getting full but definitely worth getting again the next time we go!\n\nbacon wrapped asparagus yakitori - who doesn't love bacon wrapped ANYTHING.  it was really delicious.  the asparagus was still crunchy and the bacon was cooked just the right amount to bring out all the toasty bacon flavor but soft enough to wrap like a blanket around the asparagus.  DROOL.  \n\ndef will come back again in the near future!  i want to try their ramen =)", "rating": 5, "date": "2010-11-24"}, {"excerpts": ["We had okonomiyaki and some skewers. ", "They are tasty. ", "I am skewers fan ", "and I love them! ", "However the tea is unbelievably expensive- $5.75 for a pot of tea made of a tea bag. ", "We expected it to be free since most Asian restaurant offer free hot teas. "], "author": "Amie Z.", "review": "Went with my boyfriend. It's our first try there and it's nice. We had okonomiyaki and some skewers. They are tasty. I am skewers fan and I love them! However the tea is unbelievably expensive- $5.75 for a pot of tea made of a tea bag. We expected it to be free since most Asian restaurant offer free hot teas. For six dollars we would expect real tea leafs rather than tea bag.\n\nAfter all we thought it was a nice restaurant to try.", "rating": 4, "date": "2014-01-09"}, {"excerpts": ["We were presented with an enormous menu, which, along with the specials list(s) and many handwritten labels for items on the wall, contained such wonders as \"Avochick\" or chicken thigh skewers with spicy guac, a savory fried butter mochi wrapped in nori, an array of yakitori items, several ramen options, ochazuke, okonomiyaki, and other intriguing specialties. "], "author": "CJ L.", "review": "This place was great.\n\nI went to the Richmond, fully expecting my friend would suggest Burma Superstar or some other tried-and-true place with a ridiculously long wait. Instead she said, \"there's this Japanese place around the corner, I've never been, do you want to check it out?\" I am game to try new spots, so we skipped on over to 8th and Clement to discover a small restaurant (I think hole-in-the-wall is an exaggeration unless you're talking Yamo-sized) which seemed packed but happened to have a table for two, and bar space as well for the people who came in after us.\n\nThe servers were very friendly, and seated us right away. Immediately I noticed the decor--this place was packed with Beatles memorabilia, and other bands as well--a Jimi Hendrix poster hung on the high wall over the front-of-house kitchen, a couple of Who posters--but mostly the Beatles. There was even a drum kit on a tiny balcony over the entrance, which looked possibly only just large enough to host a three-piece band, should one ever want to perform a rock concert in the tiny space. Despite the obvious theme, there was nothing precious or kitschy-seeming about the place--it felt like you were in someone's home, albeit someone who had a thing for classic rock posters. The vibe was totally friendly too... the servers seemed like they were down-to-earth, but there was no slacking when it came to attentiveness. \n\nWe were presented with an enormous menu, which, along with the specials list(s) and many handwritten labels for items on the wall, contained such wonders as \"Avochick\" or chicken thigh skewers with spicy guac, a savory fried butter mochi wrapped in nori, an array of yakitori items, several ramen options, ochazuke, okonomiyaki, and other intriguing specialties. I was pretty excited.\n\nOnce we finally made up our minds, we ordered yakitori, kara age \"don don,\" and the butter mochi appetizer. Everything came out pretty quickly, even though the restaurant was full, and my friend and I enjoyed catching up and checking out the scenery in the meantime. The rad server even offered an suggestion for how my friend could eat her meat (\"like a popsicle\") when she noticed my friend having trouble getting everything off the bone. The food runner (who maybe also was the chef?) presented everything formally and gave us the Japanese names. \n\nOh and the food? Super delicious... homey in presentation but served on super cute plates (apparently bought from the restaurant supply place around the corner) and succulent. Butter mochi? Buttery. Kara age? Light and with a small flavorful salad and scoop of rice for a totally satisfying meal. I didn't try my friend's yakitori but she practically licked her plate clean so I'm thinking that it was bomb. \n\nOur total bill, including tip, was $40, not bad for a fully satisfying, unpretentious, fun izakaya experience in SF, and with leftovers to boot. The servers were totally cool with us sitting and chatting, even for a while after we had paid (which I usually feel guilty about doing at most good and small SF restaurants). I totally would go back here again.", "rating": 5, "date": "2014-11-06"}, {"excerpts": ["We had the Karaage Ramen and Veggie Okonomiyaki. ", "The ramen came first. ", "The broth had a weird after taste. ", "I've had lots of ramen places, both modernized and authentic and this broth just left a weird after taste. ", "By the time my boyfriend finished his ramen, I waited 30 more minutes to get my pancake which tasted as if it wasn't cooked throughly and rushed. ", "Overall, the food was less than mediocre and definitely not worth $40 and over an hour of wait. ", "Oh, I almost forgot. ", "The reason they're getting only 1 star is I was served water with a bug in it. ", "I also want to add that as I'm writing this on my way home, both my boyfriend ", "and I have a stomach ache ", "and I'm starting to get a headache. ", "I wish I didn't waste my time and money."], "author": "Katrina L.", "review": "Worst service. Waited 20 minutes to get my order taken. 1 hour to get my food. We had the Karaage Ramen and Veggie Okonomiyaki. The ramen came first. The broth had a weird after taste. I've had lots of ramen places, both modernized and authentic and this broth just left a weird after taste. By the time my boyfriend finished his ramen, I waited 30 more minutes to get my pancake which tasted as if it wasn't cooked throughly and rushed. Overall, the food was less than mediocre and definitely not worth $40 and over an hour of wait. Oh, I almost forgot. The reason they're getting only 1 star is I was served water with a bug in it. I also want to add that as I'm writing this on my way home, both my boyfriend and I have a stomach ache and I'm starting to get a headache. I wish I didn't waste my time and money.", "rating": 1, "date": "2015-06-03"}, {"excerpts": ["I have been to Halu a few times now and have tried their Ramen and Okonomiyaki. ", "I finally tried their Okonomiyaki, My friend and I got the Beef and Veggie Oknonomiyaki. "], "author": "Jonathan W.", "review": "There are days where I want nothing but a nice hot bowl of noodles, whether it be Ramen, Pho, Udon, Soba or Mein. One thing to noe about me is  I am always down for soup and noodles. Today was one of those days, it was cold and rainy and nothing would make me feel better than sipping hot broth and slurping down some yummy noodles!  \n\nI have been to Halu a few times now and have tried their Ramen and Okonomiyaki. The Chasu Ramen has tender Chasu with bean sprouts, corn and a porky flavor broth. While on teh other hand the Karaage Ramen contains very flavorful Chiken Kaarage that is fried to perfection, not too oily and not overly fried. The broth is a bit richer than the Chasu Ramen broth but it is equally as good. \n\nhttp://static1.px.yelpcdn.com/bphoto/LE4E4-KNbSrZnIfXGs7hMw/\n\nWhile I was finishing up my Ramen the waitress popped up over the menu's which were right next to me since we were seated at the bar and nearly scared the crap outta me. In a kawaii koe she said \"Ramen no Aji wa doudesu ka \" wit a big smile. I replied Oishii since i was hella caught off guard :X. She then replied \"ii desu ne\" and went back to doing her work. Couldn't figure out if she was being nice or flirty! Shurgs\n\nI finally tried their Okonomiyaki, My friend and I got the Beef and Veggie Oknonomiyaki. http://static1.px.yelpcdn.com/bphoto/Bo2Eg8oc8zLFcM9HgyApZQ/l\n\nit was a work of art! Amazing, it was crisp and had a small crunch with every bite and I felt that the flavor was the best i have had. it had a homestyle taste to it and it was not masked by salt of richness. I will have to come back to check out their specialties which are grilled food! \n\nThe decor is pretty awesome i might add, they have alot of old skool vintage items, and they have Beatles memorabilia everywhere. This place looks like its a part of someones home but thats what makes it cool. It does however have limited seating and a bar area in the front. I feel right at home eating here.", "rating": 4, "date": "2010-04-03"}, {"excerpts": ["One of the few places offering okonomiyaki, I found them to be a little thinner than expected, but sublime nonetheless (go for the combination one). ", "Ramen was salty and not recommended, but you're going there for the yakitori anyway."], "author": "Cassie C.", "review": "Easy to miss this place tucked away on a Clement side street...well, except the usual mass of waiting patrons is a dead giveaway.\n\nI've been here a couple of times. Specializing in yakitori, and also unexpectedly catering to die-hard Beatles fans, the uniqueness alone keeps me coming back. \n\nThe waitresses are sweet and friendly and do their best amidst the raucous, cramped interior.\n\nAs plainly stated on the menu, the food really is best enjoyed with a couple of beers. The yakitori comes out piecemeal and it's one of those rare places you can take your time to share a meal and good company.\n\nNow as far as the food...No sushi ;) !! \nI've loved all the skewers I've tried, especially the stuffed mushroom and chicken liver (go figure). One of the few places offering okonomiyaki, I found them to be a little thinner than expected, but sublime nonetheless (go for the combination one). Ramen was salty and not recommended, but you're going there for the yakitori anyway.", "rating": 4, "date": "2013-07-15"}, {"excerpts": ["next time i want to try their okonomiyaki.\n\n"], "author": "Kimberly F.", "review": "anything with a 3 star rating means it's unlikely that I'd go back, but I would make an exception for Halu and give it one more try.\n\nWe got ramen and yakitori which were good, but not knock my socks off. next time i want to try their okonomiyaki.\n\ndecor is eclectic-- you can tell the owner is a music fanatic, especially of the beatles.", "rating": 3, "date": "2012-08-29"}, {"excerpts": ["I also love their ramen and okonomiyaki. ", "Thier Okonomiyaki is tasty and crispy on the outside. ", "Food & service is always perfect here. ", "I always wish I can order everything on the menu here, but I can only eat so much. ", ":)"], "author": "Jennifer K.", "review": "This is one of my favorite place to eat. This is a small, cute family owned restuarants and everyone is very friendly here.  Some of my favorite skewers are the fried stuffed mushrooms, beef tongue, chicken mayo and pork jowl, All of them are nicely seasoned.  I also love their ramen and okonomiyaki. Thier Okonomiyaki is tasty and crispy on the outside. Food & service is always perfect here. I always wish I can order everything on the menu here, but I can only eat so much. :)", "rating": 5, "date": "2014-12-19"}, {"excerpts": ["My personal favorite dishes are their Ramen, the Eri-chan special (mochi that is grilled and wrapped with nori) and the Okonomiyaki (another amazing dish that you have to try, originally from Okinawa).\n", "It gets busy, so if it's a cold night bring a warm coat. ", "This place is cosy and intimate, and everything you order is made right there on the spot. ", "I wouldn't have it any other way. ", "Do yourself a favor and give Halu a try."], "author": "Milhouse B.", "review": "I LOVE this place. From the Beatles decor, to the amazing staff that run this place. I used to live in Japan, and miss the food there often. Most places in the US serve sushi and that's kind of their highlight. That's great, but to be honest I didn't eat all that much sushi. There are a myriad of other Japanese dishes that exist that I thought I would never be able to eat again.\nThen I found Halu after moving to the bay area. I come all the way from East Bay to eat here.\nMy personal favorite dishes are their Ramen, the Eri-chan special (mochi that is grilled and wrapped with nori) and the Okonomiyaki (another amazing dish that you have to try, originally from Okinawa).\nIt gets busy, so if it's a cold night bring a warm coat. This place is cosy and intimate, and everything you order is made right there on the spot. I wouldn't have it any other way. Do yourself a favor and give Halu a try.", "rating": 5, "date": "2013-02-14"}, {"excerpts": ["I especially love their okonomiyaki (Japanese style savory pancake).  ", "It's crispy on the outside and chewy on the inside. "], "author": "Stephanie T.", "review": "One of my favorite Japanese go to places.  Everything on their yakitori menu\nis good.  I especially love their okonomiyaki (Japanese style savory pancake).  It's crispy on the outside and chewy on the inside. yummmm. \n\nI would highly suggest getting the chicken oysters, mochi bacon, and beef tongue.\n\nAlthough their ramen is not the best ramen ever, there's just something about the beefy broth and their chewy noodles that always makes me want more.  \n\nSomething that stands out about this tiny restaurant is their 60's decor and the Beatles music always playing in the background.  I know it gets busy and people complain about the wait, but it's totally worth it.  Plus the people there are so nice!  You can't really get frustrated with them.  If you don't like waiting just get there earlier. \nAnd if you need to wait, put down your number and go to the bars.  They'll call you.", "rating": 5, "date": "2012-03-05"}, {"excerpts": ["Not to miss -\n- shiso beef\n- bacon wrapped scallops\n- fried chicken with basil\n- okonomiyaki (I prefer the veggie one)\n- not much of a ramen person myself, but friends rave about the chashu\n\nI have had to wait just once out of five or so visits, but that's just my good luck I guess. "], "author": "Amrita M.", "review": "A very fun, slightly quirky izakaya with yummy yakitori and other small bites. \n\nYes, the bites are very small..so order a lot! Each plate is ridiculously cheap but the plates do add up.\n\nNot to miss -\n- shiso beef\n- bacon wrapped scallops\n- fried chicken with basil\n- okonomiyaki (I prefer the veggie one)\n- not much of a ramen person myself, but friends rave about the chashu\n\nI have had to wait just once out of five or so visits, but that's just my good luck I guess. Service is slightly slow but friendly. \n\nOne of my top SF picks!", "rating": 5, "date": "2013-03-19"}, {"excerpts": ["I was told that the yakitori + okonomiyaki here was good, and everything else on the menu sort of lacked--so I played it safe. ", "I definitely recommend coming here if you're in a small party and want to sit at the bar and have drinks with friends (their selection seems generous) and yakitori."], "author": "Ling C.", "review": "Walked into Halu from recommendation from a friend the weekend I was in San Francisco. Great decor, cozy joint, also great restaurant ambiance! Waitresses were extremely friendly, and despite having to wait 45 minutes to be seated it was worth it.\n\nWaiting for the food was a little long though, we were seated at around 9pm and food didn't come until nearly 10pm. I was ready to just stuff myself on yakitori, so I ordered bacon-wrapped quail egg, chicken hearts, gizzards, bacon-wrapped enoki, and some grilled mountain boar sausage. My friend ordered shiso steak, bacon-wrapped zucchini, and the same chicken innards. The food came out in segments rather than all at once, which kind of made me restless when I finished the portion and had to wait another 10-15 minutes for the second.\n\nYakitori isn't filling, but I didn't want to order anything else. Definitely didn't leave full, but I'd love to come back again to have a few drinks + yakitori. Something that bothered me was that the waitress said the kitchen closed at 10:45 so we couldn't order past that point, but there were people who came out as we left (10:30) so I'm guessing they know the owners or something. \n\nI was told that the yakitori + okonomiyaki here was good, and everything else on the menu sort of lacked--so I played it safe. I definitely recommend coming here if you're in a small party and want to sit at the bar and have drinks with friends (their selection seems generous) and yakitori.", "rating": 4, "date": "2012-10-27"}, {"excerpts": ["I still have yet to try the okonomiyaki ", "but I'm sure it doesn't disappoint. ", "A great neighborhood joint that I'd patron often if I lived in the city!"], "author": "Annie W.", "review": "Small place that can get super busy on a Sat night during Thanksgiving holiday which is good but at the same time, took a while to get a seat and even longer for our food. But that's pretty much the only gripe. \n\nTheir menu is extensive but not overwhelming and can satisfying all your taste desires in one sitting. Ramen? The yasai was chock full of different veggies and while the broth isn't as rich or porky as say, santouka/orenchi, but it was still fulfilling and the noodles were up to par. Yakitori? Beef tongue was done well! Donburi? Our koumi don (lightly breaded and fried chicken) was done really well, atop a bed of brown rice with salad and grilled eggplants on the side. And kushikatsu? You don't see much kushikatsu in other restaurants--breaded and lightly fried. Our pork and onion was yum. \n\nBasically, there's a little something to satiate every Japanese culinary desire in you. I still have yet to try the okonomiyaki but I'm sure it doesn't disappoint. A great neighborhood joint that I'd patron often if I lived in the city!", "rating": 4, "date": "2011-11-27"}, {"excerpts": ["We also tried the chicken wings, beef tongue, the special they had that night of liver/cartilage/heart/skin/gizzard, and the okonomiyaki. ", "Everything was bursting with flavor and good textures, my only disappointment about this place was the amount of food you get for what you're paying (e.g. four small chicken wings for $6.50). ", "I will definitely be back though!"], "author": "Sabrina L.", "review": "I love this restaurant! It's tiny, very cozy, and the waitresses are very nice and attentive. Everything we tried had lots of flavor. The chashu ramen's broth wasn't too greasy, and the noodles were a perfect al dente. We also tried the chicken wings, beef tongue, the special they had that night of liver/cartilage/heart/skin/gizzard, and the okonomiyaki. Everything was bursting with flavor and good textures, my only disappointment about this place was the amount of food you get for what you're paying (e.g. four small chicken wings for $6.50). I will definitely be back though!", "rating": 4, "date": "2014-05-12"}, {"excerpts": ["Lots of tasty veggie options (no veggie ramen, but there is an awesome veggie okonomiyaki), and it's been easy to accommodate gluten-free friends too."], "author": "Brigitte B.", "review": "Easily one of my favorite places in the city. Everyone I've dragged in has loved it, staff are always friendly and patient, and we've yet to have a bad dish.  \n\nLots of tasty veggie options (no veggie ramen, but there is an awesome veggie okonomiyaki), and it's been easy to accommodate gluten-free friends too.", "rating": 5, "date": "2013-10-27"}, {"excerpts": ["Their ramen is great to share, okonomiyaki is delicious (also a great item to share), salads are unique and fantastic.  ", "Also don't miss the yaki onigiri (grilled rice balls with salmon).  "], "author": "Mason N.", "review": "Their Twitter feed says they'll open on the 15th!  Cannot wait, as Halu is our favorite restaurant in San Francisco.  Their yakitori (meat and/or veggies grilled on skewers) are awesome, so many choices and all of them great.  But they also have great sake and beer, and the waitress is great at recommendations if you tell her what you like.  Their ramen is great to share, okonomiyaki is delicious (also a great item to share), salads are unique and fantastic.  Also don't miss the yaki onigiri (grilled rice balls with salmon).  Oh, and I almost forgot the kushikatsu; they take the yakitori and bread it and fry it, just wonderful.  \n\nHonestly, it's fantastic, and anyone and everyone should go check it out to get an idea of an awesome culinary offering from Japan.", "rating": 5, "date": "2013-10-10"}, {"excerpts": ["The seafood okonomiyaki was the star of the show here, really good, and a nice crust. ", "Would come back to order that, but I don't think it's worth an hour ", "wait just to get food when it seems like every other table around you is getting what they ordered."], "author": "David H.", "review": "Man I really wanted to like Halu, but let's be honest...if I have to wait an hour for my food there is a problem. Being seated for 20 minutes before even having someone stop by to get our order was criminal too.\n\nBut really, we're here to rate the food aren't we.\n\nHalu seems like a rip off.\n\nHonestly, if I order a donburi, or the soba, I do NOT want half the friggin plate to be a salad. And there's nothing under the salad, so it isn't like it's hiding more rice, or more soba noodles.\n\nAnd the soba, really, it comes with avocado. That's fine, I love avocado, I just don't love it when the dish is put in front of me and it's already turning brown and grey. Talk about a major turn off.\n\nThe seafood okonomiyaki was the star of the show here, really good, and a nice crust. Would come back to order that, but I don't think it's worth an hour wait just to get food when it seems like every other table around you is getting what they ordered.", "rating": 2, "date": "2011-05-28"}, {"excerpts": ["The izakaya type of dish is pretty dull and the okonomiyaki is skinny and tasteless. ", "During my three visits, the only thing worth eating is the minced chicken on the skewers. ", "Being an okonomiyaki snob, I would opt for those at Genki Ramen - which is only 2 blocks away.\n"], "author": "Fred F.", "review": "The ambiance is 5 star - elvis themed place in the middle of chinese restaurant zones of clement. \n\nEverything else is zero to one star unfortunately...\nThe izakaya type of dish is pretty dull and the okonomiyaki is skinny and tasteless. During my three visits, the only thing worth eating is the minced chicken on the skewers. Being an okonomiyaki snob, I would opt for those at Genki Ramen - which is only 2 blocks away.\nThe servers were not attentive and seemed to be busy in their own little bubble zone. \n\nSave your $ and run as far as you can from Halu.", "rating": 2, "date": "2011-01-30"}, {"excerpts": ["Okonomiyaki, Yakitori and Ramen!\n\n"], "author": "July N.", "review": "Okonomiyaki, Yakitori and Ramen!\n\nIt's a small hole-in-wall, with 4-people counter space and 6 tables. Very divey. It's such a great place for catching up with friends over beer and yakitori.... However, I dont think you want to bring a big group of friends due to the space constraint. Oh, they also charge automatic 20% gratuity for party of 5 or bigger.\n\nI love the Lava Ramen. Its quite flavorful with two huge pieces of pork, corn, and half of a hard-boiled egg.\nAs for the yakitori, Chicken Liver and Beef Tongue are must-try! \n\nService is very prompt and friendly and they accept credit cards.", "rating": 4, "date": "2011-09-28"}, {"excerpts": ["i had the seafood okonomiyaki which reminded me of being back in Osaka. ", "I love the hole in the wall, kansai atmosphere. ", "only complaint I have is that they do not have draft beer. ", "love this place"], "author": "John D.", "review": "dined here last night. Every now and then, I find a place that reminds me why I am so fortunate to live in San Francisco. Halu is such a place. \n\ngreat yakitori, great ochazuke. i had the seafood okonomiyaki which reminded me of being back in Osaka. I love the hole in the wall, kansai atmosphere. only complaint I have is that they do not have draft beer. love this place", "rating": 5, "date": "2011-01-26"}, {"excerpts": ["The okonomiyaki was really tasty too.  ", "In fact, everything was really good.  ", "Just rely on your fellow Yelpers to guide you as to what to order.  "], "author": "Cynthia G.", "review": "Yummy!  Was trying to go to Izakaya Sozai initially but the wait was so long we opted for Halu instead (thanks Yelp!)\n\nThe yakitori we got were pretty tasty, the ochazuke really good, and the kara-age perfectly fried.  The okonomiyaki was really tasty too.  In fact, everything was really good.  Just rely on your fellow Yelpers to guide you as to what to order.  Can't go wrong with anything on their menu!\n\nDefinitely a place to check out if you're looking for izakaya!  Not a full 5/5 because it's kind of small, crowded, and a little uncomfortable inside.  Definitely better for small parties.\n\nAnd yes, the decor is Beatles head to toe, makes for a kind of cool vibe and environment :)", "rating": 4, "date": "2011-03-11"}, {"excerpts": ["2 chicken wings\n1 chicken gizzard\n1 okra\n1 bacon wrapped asparagus\n1 grilled eggplant, skinned and topped with bonito and grated ginger\n1 seafood okonomiyaki\n1 bowl of kara age ramen, miso broth\n1 glass of chardonnay (please don't make fun of me)\n", "_", "_", "_", "_", "________", "The okonomiyaki was pretty good, but honestly, I think the ones I make at home are better.\n\n"], "author": "May T.", "review": "2 chicken wings\n1 chicken gizzard\n1 okra\n1 bacon wrapped asparagus\n1 grilled eggplant, skinned and topped with bonito and grated ginger\n1 seafood okonomiyaki\n1 bowl of kara age ramen, miso broth\n1 glass of chardonnay (please don't make fun of me)\n_____________\n\n$47 and some change\n\nThis place is fun-tastic. Beatles memorabilia and tunes play while you sit in a tiny dining room waiting in anticipation for your yakitori skewers and ramen. \n\nThe ramen broth was delicious; so rich, deep, creamy and porky. The yakitori were good too, but the eggplant was insane. They grill an entire small japanese eggplant to perfection, not to much that it turns to a pulp, but with enough texture and softness and the slightest hint of smokiness. Then, you add the grated ginger and dip in the tiniest spot of soy sauce. It was heaven in a bite, I tell you.\n\nThe okonomiyaki was pretty good, but honestly, I think the ones I make at home are better.\n\nI allocated my 10% of meat consumption and cooked foods this week right at this restaurant. Totally worth it, and I will be back next time to properly chow the goods with some Japanese beer instead of chardonnay.", "rating": 4, "date": "2010-04-21"}, {"excerpts": ["Also, serves things like okonomiyaki.  ", "Slightly different style than the okonomiyaki I've had before.  ", "A lot of mayonnaise "], "author": "Re-pley Z.", "review": "You say goodbye, and I say Halu.  Halu Halu. \n\nFun little restaurant off of Clement.  Walls were covered with Beatles memorabilia and they played a lot of sixties music while we were there. Felt like being in a little cafe in Japan (or Abbey Road).   Music was a little too high in volume.  Impressed with the interesting menu. Has a tremendous variety of yakitori and you can make a meal out of the yakitori alone. I had a salmon skewer which was great. The rice balls were a little too greasy and salty, though. Also, serves things like okonomiyaki.  Slightly different style than the okonomiyaki I've had before.  A lot of mayonnaise and they would not make it with ramen. \n\nService is a little on the slow side.  They're trying to be izakaya style but I think they should actually concentrate more on serving their food than serving drinks.   Wish that they were open for lunch.\n\nThe main thing we came for was the ramen. The noodles were good and the broth was outstanding, perfectly balanced. Was so good that I emptied the bowl.  I have had the butter corn ramen and the karaage and both were very tasty.   The ramen is some of the best in San Francisco and competitive with Suzu and Genki, and you know that can't be bad.   Yeah yeah yeah!", "rating": 4, "date": "2010-07-31"}, {"excerpts": ["I've always enjoyed the chicken kaarage and their okonomiyaki is very delicious. ", "Okonomiyaki is fairly thin compared to others I've had, a bit of crunch but nice and moist too. ", "One time I tried this mountain potato thing, kind had a slimy texture like okra..", "it was different", ", it was good ", "but i can't say it would be my favorite thing on the menu haha. ", "Grilled items, very tasty. ", "I did one time get a very salty skewer..", "i think it was beef tongue..but everything else was fine ", "so i guess i was unlucky that day "], "author": "phillip w.", "review": "Been here a couple times now, the food has always been very good.\n\nSee Halu is one of the few yakitori places in the city, with a good variety of items to choose from. I've always enjoyed the chicken kaarage and their okonomiyaki is very delicious. Okonomiyaki is fairly thin compared to others I've had, a bit of crunch but nice and moist too. One time I tried this mountain potato thing, kind had a slimy texture like okra..it was different, it was good but i can't say it would be my favorite thing on the menu haha. Grilled items, very tasty. I did one time get a very salty skewer..i think it was beef tongue..but everything else was fine so i guess i was unlucky that day haha\n\nI've never had the ramen here but one of these days I will definitely go check it out.\n\nAlso one of the major things I like about this place..well other than the food. Is the decor and music. Lots of vintage items and a lot of Beatles stuff. Its really great and makes me feel really comfortable eating here.", "rating": 4, "date": "2010-03-01"}, {"excerpts": ["The okonomiyaki (pancake) was $10 and resembled an Asian small personal pizza but was soggy and had way too much mayonnaise.  ", "We ordered the beef ", "but I think we got the seafood because it tasted and looked like it had a lot of white fish in it.  ", "Heavily topped with green onions.  "], "author": "Ry T.", "review": "We finished a great movie today, Avatar, and decided to go get Ramen for dinner.  \nI've passed this place multiple times as it's right next to the public parking lot in the Richmond, but never paid much attention to it until I read a recent Yelp review.\nWe arrived at 6 PM and they had no more tables which could fit 3 and we sat at the counter (right by the door) until a table opened up.  They have approx 4 tables in the back which can hold 4 skinny people and the rest were 2s.  This is a tiny place like Katana-ya in Downtown.  \nIf you like yakatori in small portions, they have a large selection but you will go away hungry unless you supplement with some of their other dishes.  Most of the yakatori items were $4-$5 for 2 skewers but the items on the skewers were probably only 4 in long.  \n\nWe started off with a very peppery and over-salted beef and onion yakatori that was so-so.  The panko breaded basil chicken was much better.  The okonomiyaki (pancake) was $10 and resembled an Asian small personal pizza but was soggy and had way too much mayonnaise.  We ordered the beef but I think we got the seafood because it tasted and looked like it had a lot of white fish in it.  Heavily topped with green onions.  Doubt that we'd try this again. \n\nJr. Yelper liked his karage-chicken with a large serving of rice and green salad.  Hubby had the karage-chicken ramen which was good.  I had the roasted pork ramen.  The meat was tender and good but hands down, the best pork ramen to be had would still be at Santa Ramen in San Mateo.  The noodles were good and I had 1/2 slice of hard-boiled egg in it but it was pretty salty.  I think the egg was marinated as the whites of the egg was tinted brownish, probably in soy sauce. \n\nThey were busy for dinner.  One primary waitress took the orders and the other 2 women in back were cooking and the owner would help out.  The primary cook was the male.  They really could benefit from having another staff work the tables or at least a busboy.  Service was exceedingly slow, even 'tho the staff was very nice.  If you're in a hurry, this is not the place to come eat.", "rating": 3, "date": "2010-01-30"}, {"excerpts": ["I'm not an okonomiyaki expert; I only had it 3 times a week for like 3 years of my life growing up in Japan. ", "It was my favorite food from the time I was 8 years old to 11 years old, so it definitely brought me back to that homey feeling of flavors from my childhood. "], "author": "Kristina A.", "review": "A secret gem with great Japanese street / communal style foods. \nThis place represents many types of food you will find at Japanese amusement parks and festivals. \n\nMust eats here:\n-Okonomiyaki\n-Yakitori's: bacon wrapped scallops, bacon wrapped asparagus, beef yakitori's, chicken thigh meat \n- Nori wrapped mochi\n\nI'm not an okonomiyaki expert; I only had it 3 times a week for like 3 years of my life growing up in Japan. It was my favorite food from the time I was 8 years old to 11 years old, so it definitely brought me back to that homey feeling of flavors from my childhood. I will be back here often. \n\nFor those that don't know what Japanese pizza is check it out ....http://www.justhungry.com/okonomiyaki-osaka-style", "rating": 5, "date": "2010-07-03"}, {"excerpts": ["okonomiyaki - definitely the most authentic ", "I've had since visiting Japan. ", "Although I don't prefer the amount of sauce put on it.\n", "*chicken karaage ramen ", "- it was ok. ", "the chicken was super flavorful, almost a little too salty and also remember to take out the chicken RIGHT AWAY unless you like soggy breaded chicken. ", "The noodles and broth could've been better, but it passed.\n", "*grilled onigiri - this is definitely the best thing I had here. ", "It's simple. ", "A rice ball with some salmon flakes mixed in, GRILLED. "], "author": "Julia K.", "review": "It's more like 3.5 stars only because of the crazy cool decorations and ambiance of the joint. It's a small space with an area with a few tables and a counter where 5 people can sit to eat. We sat at the counter and it was totally fine - except it was pretty cold that night so everytime someone opened the door I froze a little. But I didn't mind that much - just keep your jacket on!\n\nWhen you finally sit down and settle in, you start to look around and realize every single item/accessory the restaurant has put up, is some kind of Beatles memorabilia. If you really settle down, you'll also notice that the music played while you dine is some Beatles song or some rendition of it (acoustic, live recorded performance, etc). Pretty cool!\n\nAnyway, here's what was ordered:\n\n*bacon wrapped mochi - you get two skewers with two wrapped mochi on each. SO GOOD - eat while hot.\n*okonomiyaki - definitely the most authentic I've had since visiting Japan. Although I don't prefer the amount of sauce put on it.\n*chicken karaage ramen - it was ok. the chicken was super flavorful, almost a little too salty and also remember to take out the chicken RIGHT AWAY unless you like soggy breaded chicken. The noodles and broth could've been better, but it passed.\n*grilled onigiri - this is definitely the best thing I had here. It's simple. A rice ball with some salmon flakes mixed in, GRILLED. The rice is nice and crunchy - seriously perfection.\n\nI was pretty satisfied with my dining experience here. Just didn't like the 45 minute wait (we went at 8:30pm too!) when it was freezing cold outside. Ample amount of parking, which was good because we waited in the car with the heater on until we got seated. It was slightly pricey for some items, but they do specialize in yakitori, so definitely get those that are a little more novel and rare.", "rating": 3, "date": "2011-02-22"}, {"excerpts": ["Okonomiyaki (seafood) - a little salty & saucy but good\n\n"], "author": "Meredith K.", "review": "I took a chance and took granny goose to a much talked about restaurant in her neighborhood that's had rave reviews for their ramen.  She likes the Chinese version of ramen so I thought she'd dig the Japanese.  \n\nI ordered for us - \nBacon wrapped mochi - pretty tasty, bacon was fatty so it felt bad\nYaki onigiri - very tasty and I liked the bits of salmon in there\nChicken Karaage Ramen - super delish, especially the chx - good flavor and perfect breading\nOkonomiyaki (seafood) - a little salty & saucy but good\n\nThe ambiance is interesting - Beatles photos on the wall and that genre of music playing but in a Japanese mom & pop restaurant.  Cool & interesting.  It wasn't busy around 6ish on a Wednesday evening.  It was a little disappointing because service was kinda slow.  But a great authentic Japanese restaurant in granny's neighborhood.", "rating": 4, "date": "2011-01-22"}, {"excerpts": ["Expect the following:\n- Beatles mania\n- possibly the best ramen in SF city limits with a super thick and rich porky broth and perfect, toothsome noodles (sorry Katana-ya, but you're no longer #1)\n- excellent okonomiyaki (Japanese pancake)\n- awesome yakitori of all types: we had shishito, chicken skin, and mochi wrapped with bacon..", "yessss....", "precioussss"], "author": "Angi C.", "review": "Expect the following:\n- Beatles mania\n- possibly the best ramen in SF city limits with a super thick and rich porky broth and perfect, toothsome noodles (sorry Katana-ya, but you're no longer #1)\n- excellent okonomiyaki (Japanese pancake)\n- awesome yakitori of all types: we had shishito, chicken skin, and mochi wrapped with bacon..yessss....precioussss", "rating": 5, "date": "2009-11-19"}, {"excerpts": ["Didnt get to try the ramen or the okonomiyaki at this visit but will try next time.\n\n"], "author": "she q.", "review": "We've been snacking at little things all day so decided to try this place from a friends recommendation since we didnt want a full on meal.  We got there about 8ish on a Saturday.  The five of us had to sit at the bar but I think we were lucky since a bunch of other people came in right after us.  They were super busy so service wasnt quick because it took some time for us to order.  They do acknowledge you right away when you get in the door to let you know how long the wait would be.  Its tiny and packed in there.  They have a lot of Beatles memorabilia.  Didnt get to try the ramen or the okonomiyaki at this visit but will try next time.\n\nWe just got a bunch of yakitori:  all very yummy but they do all add up $$$\n\nbutter fried mochi wrapped in seaweed - sooo good \nbacon wrapped scallops \nbacon wrapped mochi\noyster chicken \nrib eye steak \nshort ribs\nokra\ntrumpet mushroom\n\nchicken karaage - nice since it wasnt heavily battered", "rating": 4, "date": "2011-03-23"}, {"excerpts": ["- The seafood okonomiyaki is a MUST! ", "Big, beautifully made, and delicious!\n", "- Chicken skin was good like last time!\n- the Oyster chicken is YUMMY!\n", "- bacon scallop is awesome... ", "I still craved for more!\n"], "author": "Gordon L.", "review": "I have the chance to revisit Halu tonight. I swear, this place is better every single time you come! At first I thought the first time I was here tasted good because I was kind of hungry and was afraid that it won't be as good anymore... but I found out how wrong I was to doubt this place! Halu, I will never doubt you again! You are the best! (I seriously mean it!)\n\nCame back this time and tried many things we didn't got last time.\n\n- The seafood okonomiyaki is a MUST! Big, beautifully made, and delicious!\n- Chicken skin was good like last time!\n- the Oyster chicken is YUMMY!\n- bacon scallop is awesome... I still craved for more!\n- enoki bacon is amazing like the last time I ordered it.\n- the chicken karaage ramen was so-so, but still better than a lot of ramen I tried around SF.\n\nThere were more food we ordered, but I was so hungry that I didn't bother to remember their names... I'll get them next time! \n\nAlso!!! GREAT SERVICE! Our waitress was very attentive, smart, and knew what we wanted before we even ask! She rocks!", "rating": 5, "date": "2011-01-28"}, {"excerpts": ["Okonomiyaki:  $9  ", "*", "** Huge enough for 4 to share *"], "author": "Kayan W.", "review": "Great place for ramen on a cold SF night.\n\nCharshiu Ramen:  $8.75\nSpicy Kara Age Ramen:  $10  *** Deliciously hot chili spicy ***\nOkonomiyaki:  $9  *** Huge enough for 4 to share ***\n\nWednesday nights:  NOT CROWDED!\n\nGood place to go by yourself too.\n\nNot a good place if you can't stand The Beatles while you're eating.", "rating": 4, "date": "2009-12-03"}, {"excerpts": ["The okonomiyaki says it was osaka style, but Ive HAD the one in osaka ", "and it was nothing like this. ", "This was more like a think pancake, it was beef okonomiyaki ", "and it tasted good "], "author": "Petri Y.", "review": "This place is great. Tiny, tiny place and reminded me of tokyo. Good selection of yakitori. Had stuffed mushrooms, beef tongue, chicken heart, Spicy pork ramen and onkonomiyaki. Everything was delicious, I could have 4 or 5 of that beef tongue skewer it was so tasty! The spicy pork ramen was just the right amount of spicy ness with a robust broth and good ingrediants. I would recommend not to share this as its not an extra large ramen, so to share for two is not really enough. The okonomiyaki says it was osaka style, but Ive HAD the one in osaka and it was nothing like this. This was more like a think pancake, it was beef okonomiyaki and it tasted good but we just wanted more for $10!\n\nSpent $40 sometihng and we werent stuffed but it was good. I think to be really full here you probably could spend easily $30 a head. Will come back for skewers and ramen for sure!", "rating": 4, "date": "2009-12-18"}, {"excerpts": ["Okonomiyaki was also much thinner than previous pancakes I've had and also more crispy which I liked.  ", "Too much sauce on top and not enough seafood. "], "author": "Beatrice T.", "review": "I'm always trying to find a ramen shop to out-do Katanaya.  Halu didn't quite do it but it was still a yummy dinner.  Their ramen is thin and soft (kinda like the packaged stuff but better), and their broth is very savory.  I prefer thicker ramen with more of a chew.  Average of $10 a bowl. \n\nOkonomiyaki was also much thinner than previous pancakes I've had and also more crispy which I liked.  Too much sauce on top and not enough seafood. ~ $10 again.  \n\nKushikatsu beef was really soft and tender, great panko crust, and good variety of seafood and meats to choose from ~$5\n\nOverall, not bad but since it's not in my neighborhood and not cheap or amazing enough to justify the commute, I think I'll keep searching..", "rating": 3, "date": "2010-05-22"}, {"excerpts": ["Finally, the Okonomiyaki came out. ", "I guess this takes longer than usual to make. ", "I hate onions and didn't realize it was going to be cooked with them. ", "So if any of you don't like onions, make sure to let the server know."], "author": "Andrew C.", "review": "The first thing I thought when I walked in was woah! Decor was all Beatles. I guess the owner is a huge Beatles fan. The restaurant itself is very small so I would recommend trying to go at an off meal time rather than just popping up. \n\nWe had the Yakitori meal, which consisted of a couple of grilled skewers (chicken, steak, and okra). I've always been a fan of okra, so for them to have it was awesome. \n\nNext we had the ramen. I thought it was just ok. Definitely had better elsewhere. \n\nFinally, the Okonomiyaki came out. I guess this takes longer than usual to make. I hate onions and didn't realize it was going to be cooked with them. So if any of you don't like onions, make sure to let the server know.", "rating": 3, "date": "2010-08-17"}, {"excerpts": ["there was Omar's review of their new okonomiyaki (no curry last night). ", "How many places in the bay area actually have this? ", "They were also offering up a stew later that night. ", "I'm sure having such a small kitchen makes it easier for the family to really experiment with the dishes they cook at home. "], "author": "Mimi L.", "review": "I'm the kind of gal who loves variety in my meals (family style eating, 3 course meals, and straight up \"give me a bite of your food now!\"), so when I'm craving non-sushi Japanese food, I always find myself at Halu. Last night's meal tasted even better than I remember even though I've had most of the same grilled items before. Even without bacon wrapped everything, the meats and vegetables are perfectly seasoned. You can see the \"good salt\" sprinkled on the beautifully presented skewers. When I skewer meat, it's never that pretty... I would never attempt to butterfly a chicken wing. Other delicious grilled items include stuffed mushrooms, shishito peppers (apparently only 1 of 5 are actually hot), and I always forget what those little silver fish that always seem to be pregnant are called. \n\nAnd when the small yakitori items are not enough, we always order a bowl of the chashu ramen. Delicious chewy noodles with piping hot broth. And really what sent me there was Omar's review of their new okonomiyaki (no curry last night). How many places in the bay area actually have this? They were also offering up a stew later that night. I'm sure having such a small kitchen makes it easier for the family to really experiment with the dishes they cook at home. You can easily eat here for $20/person without alcohol. \n\nI'm no music aficionado at all, lazily listening to radio and whatever friends download onto my laptop. But I grew up loving old time Rock 'n Roll, Motown, doo wop, etc. I cry a little inside whenever another member of the Four Tops passes. It must be because I loved watching Dance Party on KOFY when I was like 8 (apparently they're rebroadcasting old episodes!). But Halu gives me that fix that I can't get anywhere else. Last night they were playing the Beatles' early Motown cover songs. And among all the Rock 'n Roll memorabilia, there are little touches of their daughters' influences (girly hearts on the specials board, leopard print menu holder). It really warms my robotic heart to see the whole family involved in the business. I love this place. \n\nBeen listening to this as I wrote my review. Heard the Beatles' version last night, but I prefer Smokey's: http://www.youtube.com/watch?v=Y2EsZpobWJs", "rating": 5, "date": "2009-02-28"}, {"excerpts": ["Okonomiyaki--the pancake was a little thinner than what you'd expect but that just means the sides were nicely crisped.  "], "author": "Sandy W.", "review": "Just came back from Halu and $70 (for 2) will buy you a lot of food.  Highlights of the evening are as follows:\n\nOkonomiyaki--the pancake was a little thinner than what you'd expect but that just means the sides were nicely crisped.  Also, the chef drizzled a ton of mayo on top and was very generous with the seaweed powder so though it lacked the usual protein, the pancake was very yummy.  \n\nBeef tongue yakitori--if you're not squeamish about eating beef tongue, I'd highly recommend this dish.  It had a great chewy texture and was very well seasoned.  \n\nChicken skin yakitori--the skin was lightly salted and grilled to perfection!  Not overly chewy or charred.\n\nFor all the sake lovers out there, Halu has quite an extensive sake selection.  In fact, it carried two different varieties of my favorite sake--Hakkaisan--so thumbs up just for that.", "rating": 4, "date": "2009-10-17"}, {"excerpts": ["We ordered an appetizer and various grilled items as well as okonomiyaki, grilled mochi and ochazuke to finish it off.\n\n", "The Okonomiyaki was decent, but not fluffly enough to really enjoy the batter and ingredients. ", "Ochazuke was quite salty too that I couldn't enjoy the crisp taste of the tea and subtlety of the rice. ", "I really enjoyed the Mountain potato appetizer. ", "It was fresh and lightly garnished with seasoning "], "author": "Sean L.", "review": "Dropped by on a Saturday night with a close friend. Started off with Shochu mizuwari style.\n\nWe ordered an appetizer and various grilled items as well as okonomiyaki, grilled mochi and ochazuke to finish it off.\n\nThe vibe is wonderful and cozy. Atmosphere is top notch and if you are a fan of the 60s and the Beatles, even better. I wish they played more of the later Beatles music as the poppy stuff can get a bit tiresome. Luckily, it's quite easy to tune out.\n\nOwned by a husband/wife team, and what looks like their daughters as waitresses, service is friendly and very very warm. I felt like this was one of the hipper downtempo places you see popping up in Japan lately in the Koenji/Shimokita area (ie, reggae bars, themed yakitoris) run by very cool people.\n\nSo why the 3 stars? Well, they get everything right, EXCEPT the food. I hate to be picky, but this is what Yelp is for right?\n\nFirstly, the Yakitori wasn't cooked on a true Charcoal grill, so you don't get the smokey flavor that is intrinsic to eating grilled meat. Secondly, everything was much to salty and while this is great with beer, it was just a bit too much.\n\nThe Okonomiyaki was decent, but not fluffly enough to really enjoy the batter and ingredients. Ochazuke was quite salty too that I couldn't enjoy the crisp taste of the tea and subtlety of the rice. I really enjoyed the Mountain potato appetizer. It was fresh and lightly garnished with seasoning so I could really appreciate the texture.\n\nIt's hard to give a place negative review when everything else is so right on. Complimentary edamame, pickled cabbage and friendly service/atmosphere. \n\nThis is a place if I lived next door, you'd probably find me here often. Solid neighborhood joint. It's a shame it's ALMOST perfect.", "rating": 3, "date": "2009-04-20"}, {"excerpts": ["The okonomiyaki is good here too.\n\n"], "author": "Bill Z.", "review": "The spicy chicken kaarage ramen is great.  They use to make it in miso, but since not many people ordered it - they fully went with shio or shoyu instead.  (MISO WAS BETTER!!)\n\nThe yakitori can get a little pricey, but we all expect that when we go to these types of places.  So my top 3 choices are:\n\n1.) Beef Tongue (packed with flavor and cooked to perfection!)\n2.) Pork Jowel (Super salty goodness)\n3.) Mochi Special\n\nThe okonomiyaki is good here too.\n\nService is friendly and great, but the place can get cramped.  There might be a wait sometimes, but I feel that it is ALWAYS worth it.\n\nI have probably been here about 20 times (if not, more since they have opened).  If you want a place in the city for some good yakitori and ramen, just come here.", "rating": 5, "date": "2012-06-18"}, {"excerpts": ["Okonomiyaki is nice and thin. ", "Slightly crispy on the outside giving way to soft innards. ", "Good ratio of batter to vegetables and other stuff. "], "author": "Alan L.", "review": "I've been waiting for a while to write this review because after my first time here I was so giddy with the experience that I could've only attributed it to some magical combination of endorphin rush, sugar high and crack. How could a restaurant possibly make you feel these things? I couldn't decide if it was the food, the beatles blasting through the speakers, or maybe just the other people in the restaurant. In the end it's probably useless to try and disentangle all the stimuli, so I'm just going ahead with the facts. Fact: I've now been here twice and decided that it's my new favorite local - no, scratch that - all time favorite japanese place. Fact: this place is small and easy to miss, and I've been walking by it forever, so thank you yelp(ers) for helping me find things in my neighborhood.  \n\nFood Picks: Okonomiyaki is nice and thin. Slightly crispy on the outside giving way to soft innards. Good ratio of batter to vegetables and other stuff. The chef likes his worchestershire and mayo, so if you like things light like me, better ask em to take it easy with the sauces. \n\nVegi-Don with slices of avocado and brown rice (among other vegetables). This isn't for the same person who's ordering the deluxe yakitori dinner package, and it isn't meant to be, but it's very good in its own right. \n\nChicken gizzard yakitori. I'm not entirely sure what a gizzard is, but it sure tastes good when prepared on their grill. Its got a texture similar to liver, but with a little more bite, and possibly more gamey. \n\nDrink Pick: Echigo. It's like Singapore's Tiger beer, but a bit less hoppy and a little more sweet. Get it in a tall boy bottle, or as they say in japan, tall for asia but still short compared to the rest of the world.", "rating": 5, "date": "2009-01-28"}, {"excerpts": ["I wouldn't rule out a return visit if I was craving yakitori or wanted to try more things on the menu (like the okonomiyaki!).  ", "It's definitely cozy and charming, a nice change if you're in the mood."], "author": "Erika C.", "review": "The grilled skewers were good but I decided that it wasn't my thing.  I am really picky with ramen so I wasn't into that either.  I wouldn't rule out a return visit if I was craving yakitori or wanted to try more things on the menu (like the okonomiyaki!).  It's definitely cozy and charming, a nice change if you're in the mood.", "rating": 3, "date": "2011-10-20"}, {"excerpts": ["We definitely had to try the seafood okonomiyaki, which I heard was done in Yokohama style. ", "It was flatter than I'm used to but the edges were crispy and delicious. ", "I would have added corn and caramelized onions to flesh out the flavors more. ", "John M. ordered the chicken donburi with salad...", "we girls loved the salad...bitter greens and not a lot of crappy iceberg cabbage...", "that's what we like! ", "The rice is brown rice and it's healthier..."], "author": "Pauline L.", "review": "Cute! This place reminds me of the small mom and pop eateries in Japan including the kitchy Beatles paraphenalia. We were greeted by the staff in Japanese (Always a plus), and were seated promptly. We blew through $100 at one sitting and that's just 60% skewer orders.  My friends wanted to have double orders of chicken skins, hearts, gizzards, thighs, and pork/onions...some were good to great. Sandy M. tried the char-siu ramen which was okay, although the portions were huge. I liked Izakaya Sozai's ramen better. We definitely had to try the seafood okonomiyaki, which I heard was done in Yokohama style. It was flatter than I'm used to but the edges were crispy and delicious. I would have added corn and caramelized onions to flesh out the flavors more. John M. ordered the chicken donburi with salad...we girls loved the salad...bitter greens and not a lot of crappy iceberg cabbage...that's what we like! The rice is brown rice and it's healthier...I kept thinking, take that Uncle Ben (haha).\n\nUnfortunately they haven't developed a dessert menu beyond ice cream, so that's something they will have to work on in the future...as for the peeps...\nWe were outnumbered by the okasans and obasans that kept the place hopping. Lots of cries of \"oishii\" filtered through the air...all in all, a real good homemade feeling from the food. It was lovely!\n\nCome here early and sit by the counter stools to chat it up with the staff, they are very friendly!", "rating": 4, "date": "2010-10-10"}, {"excerpts": ["I will try the okonomiyaki next time on Nobu K's recommendation."], "author": "Adam C.", "review": "This is the real deal and staffed by Japanese people. All the yakitori was quite good. My ramen was good, but not authentic to Northern Japan where I fell in love with ramen. The noodles were tasty, and the broth was good as well. The tonkotsu broth was in a style I can only call gravy-like. It has an extremely rich pork taste and is similar to the broth at Izakaya Sozai. To my taste, it needed more complexity and less richness, but it was still very very good. I will try the okonomiyaki next time on Nobu K's recommendation.", "rating": 4, "date": "2013-08-31"}, {"excerpts": ["we also got the okonomiyaki was pretty good.  \n\n"], "author": "Miss P.", "review": "been wanting to try this place out for awhile.  nice, little restaurant.  so many options, too little of a tummy.  i got the bacon-wrapped mochi...yeah, you heard that correctly.  i'm a sucker for mochi, and don't get me started on the pig.  it was good.  \n\nthe chicken karaage was excellent.  my friends all got that too, so i can't really go into much detail about their other offerings.  the noodles were good.  i just got the donburi version...i'm not much into soup noodles.  wish they had some yakisoba, but that's neither here nor there.  \n\nwe also got the okonomiyaki was pretty good.  \n\nfunky decor, a bit loud in there (just because it's a small space), but really a great place.  i definitely want to go there some more and try out some of their yakitori.", "rating": 4, "date": "2010-09-18"}, {"excerpts": ["no okonomiyaki was on the menu when we visited, but the ramen and yakitori (along with the unusual anime and psychedelic guitar rock) were in full swing.\n\n"], "author": "Andrey C.", "review": "halu gets a very solid 4-stars for a wonderfully delicious and cozy thursday night dinner. no okonomiyaki was on the menu when we visited, but the ramen and yakitori (along with the unusual anime and psychedelic guitar rock) were in full swing.\n\nmy boyfriend and i shared the yakitori dinner and the chicken karaage ramen, both of which were great introductions to the flavors of the restaurant. the yakitori dinner came with one skewer each of the stuffed mushrooms (with chicken meatball stuffing), flank steak, chicken with green onion, chicken meatballs, okra with salt, shrimp, and chicken wings accompanied by a small side of salad greens with some crazy delicious dressing on it... i could have had a whole bowl of that simple salad on its own! all the skewers were excellent and would have been great with a nice beer or hot sake.\n\nthe chicken karaage ramen was also quite good with a rich flavorful broth, fresh noodles, tender fried chicken and corn. the serving size was pretty big and definitely worth the $9 or so. not the absolute best ramen in town, but it ranks up there.\n\ntogether with the nice and sincere service, this was all in all a good meal and i'm definitely looking forward for a return visit!", "rating": 4, "date": "2010-02-13"}, {"excerpts": ["these two times we ordered almost exclusively off the specials menu on the whiteboard on the wall - the lava ramen, mochi wrapped in bacon, okonomiyaki.  ", "and their okonomiyaki is thin and very good too!"], "author": "claudia y.", "review": "ok so you know how some things are just better on second look.  the more you look at it the more beautiful it becomes.  ok dont take it so literal.  but i came back to halu a second and third time a few days later and love this place!  \n\nthese two times we ordered almost exclusively off the specials menu on the whiteboard on the wall - the lava ramen, mochi wrapped in bacon, okonomiyaki.  from the menu - shishamo and daikon salad.  everything was so good.  on cold days like these in sf, and ok sf wimps its not THAT cold.  but the lava ramen really hits the spot.  it is mouth tingling-ly spicy!  the noodles are aldente and chewy.  the broth is oily but oh well. fat keeps us warm!  grilled mochi bacon.  anything wrapped in bacon is good.  and their okonomiyaki is thin and very good too!", "rating": 4, "date": "2009-12-11"}, {"excerpts": ["hot ramen, skewers, and okonomiyaki definitely hit the spot. ", "i didn't mind the draft that blows in whenever another party arrived as the place is so small and cozy that it quickly warmed up in there. ", "beatles music might have helped as well! ", "i just recommend getting there ", "when it opens to avoid the wait, food takes a while. looking forward to going back when i come home"], "author": "Diana B.", "review": "i remember sitting at the bar here with my bf on a cold sf evening before leaving for hong kong. hot ramen, skewers, and okonomiyaki definitely hit the spot. i didn't mind the draft that blows in whenever another party arrived as the place is so small and cozy that it quickly warmed up in there. beatles music might have helped as well! i just recommend getting there when it opens to avoid the wait, food takes a while. looking forward to going back when i come home", "rating": 4, "date": "2009-12-16"}, {"excerpts": ["Bacon wrapped asparagus, stuffed mushrooms, great miso soup, few vegi skewers, okonomiyaki ( my favorite) and a bottle of sake was a great filling dinner for two that cost us less than $50!!!\n\n"], "author": "Regina A.", "review": "Great place to impress friends that does not require a lot of money!!!\n\nBacon wrapped asparagus, stuffed mushrooms, great miso soup, few vegi skewers, okonomiyaki ( my favorite) and a bottle of sake was a great filling dinner for two that cost us less than $50!!!\n\nI also like to come to this place on a hot day for cold buckwheat soba noodles or on a cold day for a bowl of ramen!!!\n\nI would suggest to come early because the wait list after 8pm. can be quite long.", "rating": 5, "date": "2010-06-29"}, {"excerpts": ["It's rare to have Japanese own restaurants that offers combination of yakitori, ramen and okonomiyaki in one place. ", "The yakitori are authentic because they serve pork belly and chicken skin that many yakitori place doesn't serve. ", "The ramen noodles are very good and the broth is decent and can be great with beer. ", "The okonomiyaki is pretty good considered one of the better ones in SF and they don't put noodles in there. ", "Overall, it's a great place to get your drink on with your friends and eat beer snacks.  ", "Yum Yum!!!"], "author": "Aylee G.", "review": "It's rare to have Japanese own restaurants that offers combination of yakitori, ramen and okonomiyaki in one place. The yakitori are authentic because they serve pork belly and chicken skin that many yakitori place doesn't serve. The ramen noodles are very good and the broth is decent and can be great with beer. The okonomiyaki is pretty good considered one of the better ones in SF and they don't put noodles in there. Overall, it's a great place to get your drink on with your friends and eat beer snacks.  Yum Yum!!!", "rating": 4, "date": "2009-09-18"}, {"excerpts": ["We order Kara-age Ramen, Chasyu Ramen, Okonomiyaki and Kushikatsu dinner.\n\n", "Okonomiyaki is kinda too thin not much in it.\n", "I guess I like Hiroshima Style Okonomiyaki than Osaka.\n", "But I never taste Osaka style "], "author": "Faith I.", "review": "This place is own by Japanese and dishes here is very Osaka style.\nI assume this place totally own by Japanese.\n\nThe inside of restraunt strongly reflect I guess owner's hobby which is lot of 60's 70's music. \n\n\nIt was interesting Beatles drum set on the upper floor.\n\nWe order Kara-age Ramen, Chasyu Ramen, Okonomiyaki and Kushikatsu dinner.\n\nThe Ramen is just OK. Just little salty and not much flavor.\nActually my friend told me he can taste some burn.\n\nThe Kara-age is quite taste but little cold. Chasyu is just so ordinary.\nBut also this Chasyu was cold.\n\nOkonomiyaki is kinda too thin not much in it.\nI guess I like Hiroshima Style Okonomiyaki than Osaka.\nBut I never taste Osaka style so I am not sure.\n\nI like the Kushikatsu best. I guess this place good with something good with fried or Grill.\n\nI heard this place Yakitori is quite good so.\n\nI would like to try next time.\n\nService is kinda slow here. The girls seems very busy. \n\nBut over all is just OK.", "rating": 3, "date": "2009-05-15"}, {"excerpts": ["i simply ordered my routine of grilled okra, ribeye, mochi (get the erichan special!), ramen and drinks...now we have these other dishes i listed along with a rare find in the bay- OKONOMIYAKI!!! "], "author": "omar b.", "review": "entered a few minutes before closing and was greeted as usual by the whole loving halu family.  sat at the booth and erichan and her mama told us about the curry they just made which i was soo thrown off by as i never saw it on the menu before.\n\nalong with that sayachan said the oden was another new dish we should test drive, which made me wet my pants as the last few times i have been here i simply ordered my routine of grilled okra, ribeye, mochi (get the erichan special!), ramen and drinks...now we have these other dishes i listed along with a rare find in the bay- OKONOMIYAKI!!! (kanto-style)\n\nso the curry was impeccable, on par or better than muracci's.  the oden broth was savory, comforting and sweet enough to offset the flavorful mustard they provided for dipping of the various yummy morsels.\n\nthey made a small dish of sliced green beans flavored with a light miso w/ crushed walnuts and it was such a treat.\n\nshortly after closing the father and master griller- Shigsan ran off like he usually does to go play drums for his band the Shitones over at park chalet and it was so adorable how his wife was all excited and went off to support him, they even invited us!!!\n\nwe were laughing with eri and saya as their parents ran off to play and i commented to them how fun they are..so much flavor ; P  sayachan said yes they are different!  just like halu. my home away from home.", "rating": 5, "date": "2009-02-13"}, {"excerpts": ["We also had okonomiyaki (I can never resist okonomiyaki) ", "which was quite good and kara age chicken which is always good ", "(when is fried chicken not good?) ", "Service is fast and friendly and I love how everyone greets you so warmly and gives you menu advice", ", I was about to order a mountain potato dish but the waitress warned me it can be quite strange for people who had never had it before ", "and so I opted not to try it that night. ", "Can't wait to come back!"], "author": "Cathy T.", "review": "A Beatles/Who themed yakitori? YES PLEASE! I love this place. It's not amazing food or ambiance but it has that cool, unique feel where you know you won't find a place like this anywhere else in the country. It's a small mom and pop restaurant that serves traditional yakitori style Japanese food. And the place is plastered with Hendrix, Who and Beatles posters. Obviously, they played great music the whole time we were there and the food was pretty great too. We had the butter fried mochi wrapped in seaweed to start which was a new flavor combination for me which I quite enjoyed. We also had the ground chicken meatball skewers as well as the scallop wrapped in bacon and the asparagus wrapped in bacon. The two bacon wrapped skewers were okay, nothing to write home about but the chicken meatballs were pretty delicious. We also had okonomiyaki (I can never resist okonomiyaki) which was quite good and kara age chicken which is always good (when is fried chicken not good?) Service is fast and friendly and I love how everyone greets you so warmly and gives you menu advice, I was about to order a mountain potato dish but the waitress warned me it can be quite strange for people who had never had it before and so I opted not to try it that night. Can't wait to come back!", "rating": 4, "date": "2009-06-21"}], "koumi don": [{"excerpts": ["Had the Koumi don which was great and healthy (brown rice, side of salad, and marinated fried chik teriyaki).\n", "And then for the satays, had the Beef tounge, ground chicken, bacon mochi (1st time!), and chicken wings. "], "author": "Andrew T.", "review": "One of the best robatayaki places in the city IMO.\nHad the Koumi don which was great and healthy (brown rice, side of salad, and marinated fried chik teriyaki).\nAnd then for the satays, had the Beef tounge, ground chicken, bacon mochi (1st time!), and chicken wings. They were all great and highly recommended.\n\nAlso, the restaurant is decorated with Beetles and Jomi Hendrix memoribilia which i thought was pretty cool.", "rating": 4, "date": "2014-07-16"}, {"excerpts": ["Accepting the advice of Jen D, I ordered the Koumi Don (http://www.yelp.com/biz_photos/j7ZO28rAdTVlQdE2zJSSTA?select=3NIJPzPE04p8L6ve6iYdlA).  ", "The Koumi Don is a battered and fried piece of boneless chicken thigh meat served over a bed of toasty brown rice.  ", "The layer of batter is super thin so you can easily overlook it, but it adds a nice bit of crunch to the chicken.  "], "author": "Wilhelm Y.", "review": "I can't make it over to Halu every week like I proposed in my initial review, but I did find my way back tonight and I sort of pigged out because everything I ordered was so delicious.\n\nAccepting the advice of Jen D, I ordered the Koumi Don (http://www.yelp.com/biz_photos/j7ZO28rAdTVlQdE2zJSSTA?select=3NIJPzPE04p8L6ve6iYdlA).  The Koumi Don is a battered and fried piece of boneless chicken thigh meat served over a bed of toasty brown rice.  The layer of batter is super thin so you can easily overlook it, but it adds a nice bit of crunch to the chicken.  A spring mix of assorted greens combined with a vinegar-based dressing comes on the side along with some thin slices of grilled zucchini that had a wonderful sweetness to them.  \n\nIn addition I had an order each of the Rib Eye Yakitori and the Scallop Bacon Yakitori (http://www.yelp.com/biz_photos/j7ZO28rAdTVlQdE2zJSSTA?select=7IhdX5l9cpEvdaB1I1VA8w).  The rib eye steak cut into bite size pieces then skewered and grilled were very tender and perfectly seasoned.  The scallops wrapped in bacon were just dripping with bacon fat.  Mmmm, bacon fat.  Yes, it was excellent.\n\nI didn't stop there though.  I also had an order each of the Asparagus Bacon Yakitori and the Salmon Yakitori (http://www.yelp.com/biz_photos/j7ZO28rAdTVlQdE2zJSSTA?select=BC6SlJPsIVyuNMHD05mkFQ).  The bacon rolled asparagus pieces were also dripping in bacon fat.  Yum ... bacon fat!  It was the perfect unification of delicious bacon and crunchy asparagus.  The salmon was very good too basted in a sweet teriyaki sauce and topped with granules of black pepper.\n\nI washed everything down with an ice-cold Sapporo (http://www.yelp.com/biz_photos/j7ZO28rAdTVlQdE2zJSSTA?select=Ak2lgCTnp9Z7msFqxkuG-Q).  I left the restaurant happy and full, and I shall return again!", "rating": 5, "date": "2008-08-09"}, {"excerpts": ["Great ramen, chicken yakitori, and koumi don, but the service was incredibly slow."], "author": "Amin S.", "review": "Great ramen, chicken yakitori, and koumi don, but the service was incredibly slow.", "rating": 4, "date": "2014-03-09"}, {"excerpts": ["Our koumi don (lightly breaded and fried chicken) was done really well, atop a bed of brown rice with salad and grilled eggplants on the side. ", "And kushikatsu? ", "You don't see much kushikatsu in other restaurants--breaded and lightly fried. "], "author": "Annie W.", "review": "Small place that can get super busy on a Sat night during Thanksgiving holiday which is good but at the same time, took a while to get a seat and even longer for our food. But that's pretty much the only gripe. \n\nTheir menu is extensive but not overwhelming and can satisfying all your taste desires in one sitting. Ramen? The yasai was chock full of different veggies and while the broth isn't as rich or porky as say, santouka/orenchi, but it was still fulfilling and the noodles were up to par. Yakitori? Beef tongue was done well! Donburi? Our koumi don (lightly breaded and fried chicken) was done really well, atop a bed of brown rice with salad and grilled eggplants on the side. And kushikatsu? You don't see much kushikatsu in other restaurants--breaded and lightly fried. Our pork and onion was yum. \n\nBasically, there's a little something to satiate every Japanese culinary desire in you. I still have yet to try the okonomiyaki but I'm sure it doesn't disappoint. A great neighborhood joint that I'd patron often if I lived in the city!", "rating": 4, "date": "2011-11-27"}, {"excerpts": ["Koumi Don was, again, delicious and their Avocado Kinoko Veggie Don was also delicious. "], "author": "Wakaknee J.", "review": "Koumi Don was, again, delicious and their Avocado Kinoko Veggie Don was also delicious. In the Yakitori items, their chicken wings are salted just right and tsukune are so flavorful.\n\nThe last time we were here, the restaurant was busy, although we didn't have to wait for a table, they didn't bring yakitori dinner set in order... first they brought yakitori plate, then five to ten minutes later its rice came, then another 5 minutes later salad came, then another whatever minutes later misoshiru came... Anyway, my point is that when they were busy, the kitchen was not working efficiently enough to bring the set menu at once, and that was why I rated 4 stars previously. The server was very good and pleasant though.\n\nThis time, we came in around 6:10pm and we were the first customers of the night, or at least no one was eating in the restaurant when we came in. The food came out so efficiently and the service was again very good. The server here is very smart and nice. I can see myself coming to this restaurant more often, in the earleer time of night.", "rating": 5, "date": "2008-08-15"}, {"excerpts": ["The Koumi Don gets points for being served with brown rice, but it didn't blow anyone's socks off, the chicken was a bit too greasy.\n\n"], "author": "Ashley Q.", "review": "I was so hopeful.  Hopeful to find a go-to izakaya that served delicious food.  Hopeful that the Ramen would be on par with the Halu of San Jose.  Hopeful that I would have found a great new hole in the wall restaurant.  Hopeful that I would LOVE Halu.\n\nYou can wish and hope, but it will not always ring true.  Halu was good and up to standard, but I was not blown away.\n\nThe Ramen was good but not amazing.  The noodles were of good texture and the broth was yum.  The Koumi Don gets points for being served with brown rice, but it didn't blow anyone's socks off, the chicken was a bit too greasy.\n\nI might return to Halu for the Yakitori.  And yes, I will be hopeful.", "rating": 3, "date": "2008-08-08"}], "kara age donburi": [], "lovely halu salad": [], "ochazuke": [{"excerpts": ["Ordered the chicken set (heart,liver, bone, gizzard and skin), steak belly, yuzu wings, ochazuke, habanero chicken, and seaweed wrapped soy sauce butter mochi. ", "I'm still thinking about the food, so good!"], "author": "Al T.", "review": "So good! This was my second time here and their food just gets better and better. We got here early to beat the crowd as it is a tiny place. Ordered the chicken set (heart,liver, bone, gizzard and skin), steak belly, yuzu wings, ochazuke, habanero chicken, and seaweed wrapped soy sauce butter mochi. I'm still thinking about the food, so good!", "rating": 5, "date": "2018-09-16"}, {"excerpts": ["Great ochazuke and takoyaki. ", "I generally don't order the ramen but have sampled quite a few of their yakitori. ", "Place is tiny ", "so there's usually a wait between 6:30", "-8:30pm. ", "Friendly service!"], "author": "Q C.", "review": "Love coming here for a quick izakaya fix. Great ochazuke and takoyaki. I generally don't order the ramen but have sampled quite a few of their yakitori. Place is tiny so there's usually a wait between 6:30-8:30pm. Friendly service!", "rating": 4, "date": "2017-05-15"}, {"excerpts": ["Ochazuke with salmon ", "I prefer better then the noodles.  ", "Erichans special is awesome. ", "Love the atmosphere and the Beatles theme. ", "Great for vegetarians! ", "Worth the wait."], "author": "Alina Z.", "review": "My new favorite shop in San Fransisco. Veggie lover is amazing, agedashi tofu is one of the best I have had in the city. Ochazuke with salmon I prefer better then the noodles.  Erichans special is awesome. Love the atmosphere and the Beatles theme. Great for vegetarians! Worth the wait.", "rating": 5, "date": "2016-09-19"}, {"excerpts": ["We were presented with an enormous menu, which, along with the specials list(s) and many handwritten labels for items on the wall, contained such wonders as \"Avochick\" or chicken thigh skewers with spicy guac, a savory fried butter mochi wrapped in nori, an array of yakitori items, several ramen options, ochazuke, okonomiyaki, and other intriguing specialties. "], "author": "CJ L.", "review": "This place was great.\n\nI went to the Richmond, fully expecting my friend would suggest Burma Superstar or some other tried-and-true place with a ridiculously long wait. Instead she said, \"there's this Japanese place around the corner, I've never been, do you want to check it out?\" I am game to try new spots, so we skipped on over to 8th and Clement to discover a small restaurant (I think hole-in-the-wall is an exaggeration unless you're talking Yamo-sized) which seemed packed but happened to have a table for two, and bar space as well for the people who came in after us.\n\nThe servers were very friendly, and seated us right away. Immediately I noticed the decor--this place was packed with Beatles memorabilia, and other bands as well--a Jimi Hendrix poster hung on the high wall over the front-of-house kitchen, a couple of Who posters--but mostly the Beatles. There was even a drum kit on a tiny balcony over the entrance, which looked possibly only just large enough to host a three-piece band, should one ever want to perform a rock concert in the tiny space. Despite the obvious theme, there was nothing precious or kitschy-seeming about the place--it felt like you were in someone's home, albeit someone who had a thing for classic rock posters. The vibe was totally friendly too... the servers seemed like they were down-to-earth, but there was no slacking when it came to attentiveness. \n\nWe were presented with an enormous menu, which, along with the specials list(s) and many handwritten labels for items on the wall, contained such wonders as \"Avochick\" or chicken thigh skewers with spicy guac, a savory fried butter mochi wrapped in nori, an array of yakitori items, several ramen options, ochazuke, okonomiyaki, and other intriguing specialties. I was pretty excited.\n\nOnce we finally made up our minds, we ordered yakitori, kara age \"don don,\" and the butter mochi appetizer. Everything came out pretty quickly, even though the restaurant was full, and my friend and I enjoyed catching up and checking out the scenery in the meantime. The rad server even offered an suggestion for how my friend could eat her meat (\"like a popsicle\") when she noticed my friend having trouble getting everything off the bone. The food runner (who maybe also was the chef?) presented everything formally and gave us the Japanese names. \n\nOh and the food? Super delicious... homey in presentation but served on super cute plates (apparently bought from the restaurant supply place around the corner) and succulent. Butter mochi? Buttery. Kara age? Light and with a small flavorful salad and scoop of rice for a totally satisfying meal. I didn't try my friend's yakitori but she practically licked her plate clean so I'm thinking that it was bomb. \n\nOur total bill, including tip, was $40, not bad for a fully satisfying, unpretentious, fun izakaya experience in SF, and with leftovers to boot. The servers were totally cool with us sitting and chatting, even for a while after we had paid (which I usually feel guilty about doing at most good and small SF restaurants). I totally would go back here again.", "rating": 5, "date": "2014-11-06"}, {"excerpts": ["great yakitori, great ochazuke. "], "author": "John D.", "review": "dined here last night. Every now and then, I find a place that reminds me why I am so fortunate to live in San Francisco. Halu is such a place. \n\ngreat yakitori, great ochazuke. i had the seafood okonomiyaki which reminded me of being back in Osaka. I love the hole in the wall, kansai atmosphere. only complaint I have is that they do not have draft beer. love this place", "rating": 5, "date": "2011-01-26"}, {"excerpts": ["The yakitori we got were pretty tasty, the ochazuke really good, and the kara-age perfectly fried.  "], "author": "Cynthia G.", "review": "Yummy!  Was trying to go to Izakaya Sozai initially but the wait was so long we opted for Halu instead (thanks Yelp!)\n\nThe yakitori we got were pretty tasty, the ochazuke really good, and the kara-age perfectly fried.  The okonomiyaki was really tasty too.  In fact, everything was really good.  Just rely on your fellow Yelpers to guide you as to what to order.  Can't go wrong with anything on their menu!\n\nDefinitely a place to check out if you're looking for izakaya!  Not a full 5/5 because it's kind of small, crowded, and a little uncomfortable inside.  Definitely better for small parties.\n\nAnd yes, the decor is Beatles head to toe, makes for a kind of cool vibe and environment :)", "rating": 4, "date": "2011-03-11"}, {"excerpts": ["We ordered a few skewers, and a yakitori dinner (a good variety of skewers including totally cute little okras to chicken wings, minced chicken balls and stuffed mushroom), and ochazuke.\n\n", "The ochazuke was such a comforting dish, especially since it was so foggy in the Richmond that evening. "], "author": "v w.", "review": "If any of these apply to you, don't eat here.\n- You don't like your food in small pieces, skewered with bamboo, grilled and served in small portions\n- You don't like your food salty\n- You don't like odd parts of meat like tongue, gizzard\n- You don't like small places\n- You don't like The Beatles (!! what's wrong with you!?)\n- You don't believe good things come to those who wait\n- You're on a first date\n\nHalu is quaint. I love how it makes me feel like I could've stepped into a hole in the wall in Shinjuku when I walk in. The Beatles blares over the sound system, and you get tucked in a small corner with a menu and specials on the wall.\n\nWe ordered a few skewers, and a yakitori dinner (a good variety of skewers including totally cute little okras to chicken wings, minced chicken balls and stuffed mushroom), and ochazuke.\n\nEverything is a little on the salty side, just so you know. But yakitori usually is.\n\nMy personal favourites are the stuffed mushrooms - I love mushrooms, but grilled mushrooms? It's more than love. These fellas are grilled with a little minced meat, and the sauce tastes like coca cola. What can possibly go wrong in that combination?\n\nI also liked the shiso beef, and beef tongue. Pork jowl was not too bad too. Can give the kuro buta sausage a miss. \n\nThe ochazuke was such a comforting dish, especially since it was so foggy in the Richmond that evening. A reasonable piece of salmon floating in rice and broth with mustard seeds. \n\nBut meal though, was topped off by a seemingly awkward, deceptively tasty combination: mochi wrapped bacon. Soft, warm, toasty and chewy mochi wrapped with the crowd pleaser that is bacon. Ah. It was happiness.\n\nGo with a group of your pals, stuff yourselves silly, you'll have a good time. I wouldn't recommend it for a first date - it's hard to chat, and the food isn't for everyone.", "rating": 5, "date": "2010-09-18"}, {"excerpts": ["We ordered an appetizer and various grilled items as well as okonomiyaki, grilled mochi and ochazuke to finish it off.\n\n", "The Okonomiyaki was decent, but not fluffly enough to really enjoy the batter and ingredients. ", "Ochazuke was quite salty too that I couldn't enjoy the crisp taste of the tea and subtlety of the rice. ", "I really enjoyed the Mountain potato appetizer. ", "It was fresh and lightly garnished with seasoning "], "author": "Sean L.", "review": "Dropped by on a Saturday night with a close friend. Started off with Shochu mizuwari style.\n\nWe ordered an appetizer and various grilled items as well as okonomiyaki, grilled mochi and ochazuke to finish it off.\n\nThe vibe is wonderful and cozy. Atmosphere is top notch and if you are a fan of the 60s and the Beatles, even better. I wish they played more of the later Beatles music as the poppy stuff can get a bit tiresome. Luckily, it's quite easy to tune out.\n\nOwned by a husband/wife team, and what looks like their daughters as waitresses, service is friendly and very very warm. I felt like this was one of the hipper downtempo places you see popping up in Japan lately in the Koenji/Shimokita area (ie, reggae bars, themed yakitoris) run by very cool people.\n\nSo why the 3 stars? Well, they get everything right, EXCEPT the food. I hate to be picky, but this is what Yelp is for right?\n\nFirstly, the Yakitori wasn't cooked on a true Charcoal grill, so you don't get the smokey flavor that is intrinsic to eating grilled meat. Secondly, everything was much to salty and while this is great with beer, it was just a bit too much.\n\nThe Okonomiyaki was decent, but not fluffly enough to really enjoy the batter and ingredients. Ochazuke was quite salty too that I couldn't enjoy the crisp taste of the tea and subtlety of the rice. I really enjoyed the Mountain potato appetizer. It was fresh and lightly garnished with seasoning so I could really appreciate the texture.\n\nIt's hard to give a place negative review when everything else is so right on. Complimentary edamame, pickled cabbage and friendly service/atmosphere. \n\nThis is a place if I lived next door, you'd probably find me here often. Solid neighborhood joint. It's a shame it's ALMOST perfect.", "rating": 3, "date": "2009-04-20"}], "chashumen": [{"excerpts": ["both of us ordered the chashumen ramen (~10-11 bucks), which came with noodles, ginger, bean sprouts, onions, corn, and an egg in a pretty large sized bowl. ", "noodles were bomb and plentiful and cooked to al dente perfection. ", "broth was flavorful. ", "meat was PLENTIFUL! ", "i wasn't expecting that many pieces of meat floating around "], "author": "Caitlin C.", "review": "i'd say that this place totes has the potential to be quite hard to miss, but luckily, the HALU sign in size 1500 font makes it quite findable. you can see the sign from Clement street, even though the restaurant is off to the side on 8th Ave!\n\nthe place is tiny! it's crammed with Beatles paraphernalia and other knickknacks. there's a counter that squeezes about 6 stools, and a handful of tables for 2. i would recommend not coming with more than a party of 2, otherwise you'll be waiting for years.\n\nluckily, we were able to squeeze the two of us into the counter seating area. unluckily, i was seated next to a ... full grown bulky (buff?) dude. both of us are wearing fleeces, so we are essentially elbow to elbow. we laugh awkwardly at how cozy we are and remove our fleeces, so now there is about a 1 inch gap between our elbows. awkwardness slightly resolved, until i drop my  chopstick wrapper and it conveniently falls into his lap due to our close proximity to each other. and back to awkward we go...\n\nbathroom was cute, had one of those squishy toilet seats that you really get to sink your behind into. not enough room to open the (outswinging) door so i nearly hit the man in line for the bathroom outside.\n\nboth of us ordered the chashumen ramen (~10-11 bucks), which came with noodles, ginger, bean sprouts, onions, corn, and an egg in a pretty large sized bowl. noodles were bomb and plentiful and cooked to al dente perfection. broth was flavorful. meat was PLENTIFUL! i wasn't expecting that many pieces of meat floating around but hey, the more the merrier! pleasantly surprised.\n\nwe also ordered 3 types of yakitori - pork and onion, flat steak, and bacon wrapped scallops. delish! pork was tender and went perfectly well with the onion. the flat steak was seared . bacon wrapped scallops are self explanatory, aka oily heaven in my mouth.\n\noverall halu is in my top 5 for ramen, but it doesn't quite hit the top spot for me. however, i would be willing to come back here again to try the karaage ramen and the other yakitori!", "rating": 4, "date": "2013-08-04"}, {"excerpts": ["The chashumen ramen was pretty good. ", "Great soup and noodles. ", "However, the chashu pork was chewy, gamey, grey colored and cold as it was floating in the hot broth. ", "You could tell it was refrigerated. ", "Same for the hard boiled egg and corn. ", "The chashumen ramen is incredible!"], "author": "Suburban Shi-Shi J.", "review": "HALU gets a HELL NO from me. \n\nI went there on 4/27 with a friend and I had no idea that were going to eat in something a little bigger that a walk-in closet. Ok, not that bad, but you get the idea.\n\nThe chashumen ramen was pretty good. Great soup and noodles. However, the chashu pork was chewy, gamey, grey colored and cold as it was floating in the hot broth. You could tell it was refrigerated. Same for the hard boiled egg and corn. The only saving grace for this ramen was the delicious, thick broth and noodles. \n\nWe were told our yakitori order would come AFTER our ramen. It was not-so-good. We had the beef tongue - too chewy. Beef tongue should be tender.  Beef with shiso and ume paste. Traditionally ume(boshi) and flesh-meat are not eaten together. I wanted to try something different. It was OK, but wouldn't do it again. Chicken livers - tasted \"dirty\" and \"muddy.\"  Even my friend who's a fan of offal noticed the off taste. Oyster chicken - couldn't  really figure out where the oyster came in. The shishito peppers were spot on, but how can you f-that up? \n\nThe worst part is the service. Friendly wait staff, but 45 minutes for the ramen and the yakitori served AFTER our ramen?  For real?\n\nThe killer is the tiny space. Waitstaff constantly kicking my chair... Squeezing in between tables and patrons... F-ing distracting.  \n\nFor me, this is a Neverland (as in never to return) place. I think this place is OK for your hipsters and cosplay crowd, but not for two 40-some odd year olds. \n\nMy favorite ramen and japanese comfort food joint is HISAGO on Geary. Great food, place and space. The chashumen ramen is incredible!", "rating": 2, "date": "2013-08-04"}, {"excerpts": ["The chashumen (cha shu ramen) had really good pork. "], "author": "kristin e.", "review": "I went home to SF yesterday (and while I was driving in 90 degree heat, it was nice to walk to Halu from home bundled up in a peacoat) and made it a point to eat here for dinner because of Euge's many reviews. \n\nI like the fact that it's a few blocks away from home which means no scrambling around Clement for parking!\n\nWe got there at a reasonable time...8:30pm-ish on Sunday night. Noticed Beatles memorabilia inside and the classic rock being played. The place itself is cozy, tiny and intimate with a mom and pop feel and there is bar seating in front of the full view kitchen as well. \n\nNoticed all the yakitori and kushi katsu options and couldn't wait to order away. Started off with the kara age ramen (deep fried chicken pieces). The chicken was really meaty and very seasoned. The broth was very rich and savory though it lacked a bit of saltiness. The noodles were thinner than what I'm used to but they were still good. The chashumen (cha shu ramen) had really good pork. Very fall-off-the-bone good. \n\nAs for skewers, had the bacon wrapped scallop (nice meaty and sweet scallops), bacon wrapped enoki, chicken gizzards, shrimp and the salmon katsu. I really wanted to try the beef tongue but they were out and we canceled our order for the stuffed mushroom because we were so full that there still some salmon katsu that we didn't finish. I do want to try the other skewers that we didn't order. \n\nThe service was great and even though I wasn't really in the mood for beer (I babysat my glass of sapporo), I'd like to come back and have some yakitori and a few bottles of beer for that true izakaya feel and the bonus part is, I don't have to worry about driving home!\n\nBonus star: I did some research and found out that the owner (the husband) is a drummer for a surf-rock band and that he also used to be a drummer for a Jefferson Airplane spin-off band. How cool is that?!", "rating": 5, "date": "2008-08-11"}, {"excerpts": ["Even my pork eating boyfriend prefers it after trying the chashumen.  ", "This is not to say it's bad.  ", "Just that it's not as strong.  ", "Yakitori was good but not enough to order it over ramen if you have to choose.  ", "Yakionigiri=awesome.  ", "I don't have anything to compare it to since I've never ordered it elsewhere ", "but if it tastes anywhere near as good as ", "Halu's I'll order it everywhere ", "every chance I get.  ", "Green salad with strawberry=tiny mediocre dressing and not a good value.  ", "The boyfriend tried the katsu sampler.  ", "Some items were really good, most were just ok.  ", "I also tried the karaage and zuchinni brown rice bowl.  ", "Really tasty and the brown rice and salad ", "make eating fried chicken seem healthy.  "], "author": "M M.", "review": "I'm gonna forgive Halu for their lack of pork now.  I've been here a jillion times since that incident and haven't had any others.  I think I'm safe.  Plus, I still don't eat pork so I ultimately don't care if they have it or not.  I've had a few different things now so my review can expand.  Most items are winners.  Karaage ramen=awesome.  Even my pork eating boyfriend prefers it after trying the chashumen.  This is not to say it's bad.  Just that it's not as strong.  Yakitori was good but not enough to order it over ramen if you have to choose.  Yakionigiri=awesome.  I don't have anything to compare it to since I've never ordered it elsewhere but if it tastes anywhere near as good as Halu's I'll order it everywhere every chance I get.  Green salad with strawberry=tiny mediocre dressing and not a good value.  The boyfriend tried the katsu sampler.  Some items were really good, most were just ok.  I also tried the karaage and zuchinni brown rice bowl.  Really tasty and the brown rice and salad make eating fried chicken seem healthy.  Kind of.  \n\nAs with most restaurants, some items are better than others.  Service can be efficient when not too busy and slow when it is.  Pretty standard for mom and pop restaurants with only 1 server though.  Overall, the concept and execution of the simple menu at Halu works and I really hope it's successful.", "rating": 5, "date": "2008-09-18"}], "yasai ramen": [], "su ramen": [{"excerpts": ["From reading the reviews, I just went with the basics, a bowl of cha-su ramen. ", "The bowl of ramen contained only  a couple pieces of cha-su and less than 10 pieces of each - bean sports, corn and even green onions. ", "My sister asked to have her vegetables to be set on the side and that's how we have noticed that a $10.50 bowl of cha-su ramen has so LITTLE vegetables. ", "These were not high grade or the most expensive type of vegetables too. ", "The cha-su was just terrible in texture, I felt like I had some Chinese hard boiled pork from the soup base "], "author": "M W.", "review": "This is my first time and will be my last. My sister & I visited there just last Thursday for dinner and was hoping to experience a four star rating meal from this restaurant that was ranked by Yelp members. However, we were a bit shocked, disappointed and wasn't our cup of tea. \n\nThis place is small, which shows a good sign called \"HOLE IN THE WALL\", that also presents this place been here for a long time. I recall seeing this when I was still in High school, but not sure what they are really known for. \n\nFrom reading the reviews, I just went with the basics, a bowl of cha-su ramen. The bowl of ramen contained only  a couple pieces of cha-su and less than 10 pieces of each - bean sports, corn and even green onions. My sister asked to have her vegetables to be set on the side and that's how we have noticed that a $10.50 bowl of cha-su ramen has so LITTLE vegetables. These were not high grade or the most expensive type of vegetables too. The cha-su was just terrible in texture, I felt like I had some Chinese hard boiled pork from the soup base and it was just not satisfying. \n\nI would say that Ramen is not their \"best\" at this location. If you were considering having lots of sake, wine, or beer, maybe this is just the type of place to be - to have BAR food with your alcohol, but not a $$ worth 4 star rating restaurant. \n\nThe reason I gave one star is because at the end of my unfinished bowl of ramen, the waitress showed courtesy to ask how was the food.", "rating": 1, "date": "2011-10-11"}, {"excerpts": ["so we both had Soy Char Su Ramen", "....", "It was just as good.  ", "The noodle is not as good as Katana-ya ", "but the broth was the bomb.\n", "We also had Daikon Radish salad....awsome as well.\n"], "author": "Mel T.", "review": "We came here after work tonight looking for Miso Ramen and came to find out they do not have it today.....so we both had Soy Char Su Ramen....It was just as good.  The noodle is not as good as Katana-ya but the broth was the bomb.\nWe also had Daikon Radish salad....awsome as well.\nWe originally ordered the Chicken liver Yakitori & the Enoki Bacon but they were over whelm with a big table order of them b 4 us and didn't even remember to do it.....They apologize for the mistake but luckily we were full from the Ramen already.  \nThe place is small but cozy....music is kinda loud but cool!\nThey are about 1 month old and probably still trying to work out the timing thing as we have to wait for quite sometime to get our food.\nWill definitely come back......\nBTW....it is Japanese owned and operate!!!", "rating": 4, "date": "2008-07-23"}, {"excerpts": ["I ordered the Chay-su ramen and stuffed mushroom skewer. ", "The ramen and broth was good but there wasn't enough Chaysu. ", "I'm a meat person. ", "The skewer was good but there were only two mushroom for $2.50. ", "The chicken karage ramen was good and the amount of chicken was more satisfying."], "author": "Ginny M.", "review": "Beatles on the wall and on the sound system. This is a really small place and I was there with a group of nine. They warned us that our food could not all come out at the same time because our party was large and the kitchen was small. I ordered the Chay-su ramen and stuffed mushroom skewer. The ramen and broth was good but there wasn't enough Chaysu. I'm a meat person. The skewer was good but there were only two mushroom for $2.50. The chicken karage ramen was good and the amount of chicken was more satisfying.", "rating": 3, "date": "2009-02-27"}], "hiyashi chuka": [{"excerpts": ["My wife had the Hiyashi Chuka which was the most unique dish of the night (cold noodles, roasted pork, and lots of veggies arranged nicely on top, with a great tasting broth - waitress was nice enough to explain how to mix it all up before eating it - loved it).\n\n"], "author": "Lawrence L.", "review": "Was in my old hood, so we decided to try Halu.  Once we walked in, we felt like we were in a restaurant i the Haight, or Berkeley!  The Beatles were playing in the background, and the entire decor was old school 60's posters of the Beatles, Jimi Hendrix, the Who, the Monkees, etc.  We were seated right away, and were kind of expecting slow service (from reading all the other Yelp reviews).  Most other Yelp reviews were on the money; however, we read about this place being authentic homey Japanese food.  That was what attracted us to try this place out.  \n\nHad the wasabi marinated octopus salad (nice kick, and healthy chunks of tako).  Chicken gizzard and Bacon Wrapped Scallops Yakitori were both grilled up right, and Chashu Ramen was pretty good, noodles were pretty good, but the broth was a bit salty for my taste...  My wife had the Hiyashi Chuka which was the most unique dish of the night (cold noodles, roasted pork, and lots of veggies arranged nicely on top, with a great tasting broth - waitress was nice enough to explain how to mix it all up before eating it - loved it).\n\nAll-in-all, I would come back and try all the other yakitori choices.  Definitely recommend this little gem.", "rating": 4, "date": "2010-09-13"}], "wasabi chicken": [{"excerpts": ["Their beef tongue and wasabi chicken is good. \n\n"], "author": "Donna M.", "review": "I always come here and order Chasumen (+$1 for spicy). The slices of pork belly in the ramen is good and I like the firm texture and thickness of the ramen. The broth is usually pretty good but I have to admit the broth wasn't as good as I remembered it from before the last time I went. Maybe it was off that day. I love the variety of sides/yakitori and specials they have to offer on the menu and posted on the wall. Their beef tongue and wasabi chicken is good. \n\nThe wait times are long as the restaurant is tiny, but if put your phone number down with your name you can walk around the neighborhood and they will call you when your table is ready. However don't stray too far from the restaurant because you may lose your table if you take too long to come back.", "rating": 4, "date": "2018-04-21"}, {"excerpts": [": 1) Tsukune meat balls 2) wasabi chicken 3) "], "author": "Breck O.", "review": "Sake selection was really good. I'd rank the yakitori as follows: 1) Tsukune meat balls 2) wasabi chicken 3) Spicy chicken thigh 4) shiso plum chicken 5) beef belly. Karage wasn't bad but needed a mayo sauce. Gyoza wasn't bad but the wrapping was a bit thin... tasted like a loosely wrapped lumpia. Vibe/decor/service all good. Would come back", "rating": 5, "date": "2018-04-28"}], "chicken with scallions": [{"excerpts": ["The yakitori was delicious, we chose bacon wrapped scallops (how can you go wrong) and chicken with scallions (yum). ", "We ordered the gyoza which came out on a sizzling platter, these were not frozen from a bag gyoza! ", "They were delicious. ", "I also wanted to try some of their katsu. "], "author": "Jaime G.", "review": "Tiny hole-in-the-wall with a lot of character (60's music and Beatles decor). Was able to snag a table for 4 (luck!). We tried the ramen, which had a nice basic broth and thin ramen noodles (the spicy is nice and spicy). The yakitori was delicious, we chose bacon wrapped scallops (how can you go wrong) and chicken with scallions (yum). We ordered the gyoza which came out on a sizzling platter, these were not frozen from a bag gyoza! They were delicious. I also wanted to try some of their katsu. We got the chicken thighs and the stuffed mushrooms, both were very yummy, but the mushrooms were very new to me, so they were a pleasant surprise. We had drinks too, overall the cost for 4 of us sampling and sharing was not bad for such delicious food. This is a tiny place, so prepare yourself for a wait if you are not there early (and don't leave a bad review just because of a wait, come on...).", "rating": 4, "date": "2017-05-14"}], "mayo scallion chicken": [{"excerpts": ["Would recommend okonomiyaki, Mayo scallion chicken skewers, and tsukune meatballs. ", "Of course there are many other good items too. ", "Only downside is a lot of the items come out slightly burnt, a few dishes were like this ", "so I think they overcook it a bit on purpose."], "author": "Tom P.", "review": "Small authentic izakaya with a Beatles theme. Small paid public parking lot nearby. Great variety of items on the menu.\n\nWould recommend okonomiyaki, Mayo scallion chicken skewers, and tsukune meatballs. Of course there are many other good items too. Only downside is a lot of the items come out slightly burnt, a few dishes were like this so I think they overcook it a bit on purpose.", "rating": 4, "date": "2018-09-02"}], "shiso plum chicken": [{"excerpts": ["Spicy chicken thigh 4) shiso plum chicken 5) beef belly. ", "Karage wasn't bad but needed a mayo sauce. ", "Gyoza wasn't bad but the wrapping was a bit thin... tasted like a loosely wrapped lumpia. ", "Vibe/decor/service all good. ", "Would come back"], "author": "Breck O.", "review": "Sake selection was really good. I'd rank the yakitori as follows: 1) Tsukune meat balls 2) wasabi chicken 3) Spicy chicken thigh 4) shiso plum chicken 5) beef belly. Karage wasn't bad but needed a mayo sauce. Gyoza wasn't bad but the wrapping was a bit thin... tasted like a loosely wrapped lumpia. Vibe/decor/service all good. Would come back", "rating": 5, "date": "2018-04-28"}, {"excerpts": ["Seaweed wrapped mochi\nYuzu chicken\nShiso plum chicken \n\n"], "author": "Grace C.", "review": "Very small place. Filled w Beatles posters and Beatles music playing. Not great for groups. Thankfully we came before 6p and snagged a table for 6. My friends come frequently for the tapas. I would only come for Happy hour 5-7p as many of the skewers are discounted. \nSplit various dishea of which some are listed below. Friends liked the Sake drinks.\n\nGood:\nBacon wrapped mochi\nSeaweed wrapped mochi\nYuzu chicken\nShiso plum chicken \n\nJust ok:\nAvocado chicken- chicken was a bit dry but the avocado sauce was tasty\nChicken heart- didn't really care for the texture", "rating": 4, "date": "2016-07-09"}], "spicy mentai caviar mayo chicken": [{"excerpts": ["One cousin got 2 Spicy Mentai Caviar Mayo Chicken, so all four of us got a skewer and it was really good. \n\n"], "author": "Lilian L.", "review": "You either will die reading all of this or it will be beneficial.\n\nI like to remember things so yes, it's a long one.. \n\nTake-aways:\n\nGET THE:\n-Crispy Chewy Soft Skin\n- Yakitori Omakase Dinner\n\n-----\n\nLast night was my second experience here. The first with a friend and the latter with my cousins. It was Saint Patty's and honestly, we weren't going out for the holiday festivities (we actually forgot), but the Richmond was nice because.. even near the bars and the food places: it was 'dead': nothing packed, just the usual numbers. (If you want crazy: try the Castro and other areas.. or go to DTSJ like San Pedro Square). It was really nice not dealing with crazy people. We did walk to a local bar while we waited for our spot here (they said about 30 minutes and they called us). \n\nIt's a very small establishment with Beatle's memorabilia all over the place and Beatle's music playing in the background. I really like this place. My cousin and his girlfriend LOVE this place, but my other cousin has never gone. And it is sadly closed on Sundays (we were trying to go last Sunday after trying out couches at Living Spaces). So we did a raincheck and went last night.  \n\n-\n\nAnyways to the food..\n\n2nd experience:\n\nI ordered the beef tongue (comes in a set of two skewers). It was really good. And I appreciated that it was prepared differently than the beef tongue that I would also receive in my dinner set mentioned below. My dinner set was randomized so I didn't know I would be getting the 'same' thing, but it wasn't remotely the same. So thumbs up. \n\n------\n\nI also got the Yakitori Omakase Dinner which is one of their specials: \n7 assorted yakitori skewers (chef's choice so it varies on any given day)\n\nMy assortments came with a delicious beef tongue, \nplum soaked beef with herbs (that was my favorite), \norka (everyone loved this, but I thought it was okay),\npork (my cousin Kyle's favorite, but I'm not huge on charcoaled meats),\nmushrooms (super delicious), \nchicken meatball, and \nsalmon (my cousin Syd's favorite and it was good but it's not my go-to).\n\n*beef tounge isn't as chewy as the leunga of a burritto so if you were wondering on texture, I can't do super chewy meats, I think if you've never had tounge: it's a good starting dish to get here. It's really good.\n\nThe dinner comes is served with rice, miso soup and organic spring green mix salad.  The miso is really good here, they make it different than any place I've ever been too. They have enokitake mushrooms in their miso and it's not a super salty broth or anything, it's just dead-on good. \n\n**veggie choice available for the assortments \n\n--------\n\nWe also got Okonomiyaki (japanese style pizza pancake topped with traditional tonkatsu sauce, mayo, aonori and red ginger), it's vegetarian, very similar to a Korean seafood/non-seafood pancake. I liked it, but if you don't like Korean savory pancakes in general you won't like this, it's the same texture.\n\n------\n\nMy cousins got the Combination (I don't believe this is on the menu, but written on one of the boards on the wall) & Karaage Ramen. The ramens were good. This isn't really the right place to get Ramen, but it's good with the food we had.. we did order a lot.. so you might want to tone it down a notch. \n\n-----\n\nOne cousin got a sake flight (where they choose for you, but there's a lot of other options where it's not a surprise) and they enjoyed it. \n\nI just choose not drink so I can't comment on anything. \n\n----\n\nOne cousin got 2 Spicy Mentai Caviar Mayo Chicken, so all four of us got a skewer and it was really good. \n\n-----\n\nFirst experience:\n\nGot the takoyaki, crispy chicken wings (super small, my friend was disappointed.. I think it was typical sizing), I got the Crispy Chewy Soft Skin (comes in two) and that's my absolute favorite.", "rating": 5, "date": "2018-03-18"}, {"excerpts": ["Tako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken "], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}], "yuzu citrus thighs": [], "yuzu citrus wing": [], "tsukune meatballs": [{"excerpts": ["Would recommend okonomiyaki, Mayo scallion chicken skewers, and tsukune meatballs. ", "Of course there are many other good items too. ", "Only downside is a lot of the items come out slightly burnt, a few dishes were like this ", "so I think they overcook it a bit on purpose."], "author": "Tom P.", "review": "Small authentic izakaya with a Beatles theme. Small paid public parking lot nearby. Great variety of items on the menu.\n\nWould recommend okonomiyaki, Mayo scallion chicken skewers, and tsukune meatballs. Of course there are many other good items too. Only downside is a lot of the items come out slightly burnt, a few dishes were like this so I think they overcook it a bit on purpose.", "rating": 4, "date": "2018-09-02"}], "shiso beef steak": [{"excerpts": ["Tako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken "], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}], "eggplant with swiss cheese and basil": [], "crispy wings": [{"excerpts": ["We also ordered the Crispy Wings yakitori and I forgot the other one (it's something \"melt in your mouth?\" beef yakitori), that the waitress recommended and it was delicious! ", "I wish I had known about this restaurant before, because I'm definitely coming back for more. ", "I'm sorry I spilled the yuzu sake!"], "author": "Melinnie A.", "review": "I love everything in this restaurant! The atmosphere, the music, the waitress was very interesting. She was so enthusiastic. They have the coolest bathroom! the toilet seat was comfy, haha. And of course, the most important thing is THE FOOD! One of the best ramen in town. I ordered Karaage ramen, the taste of the broth was perfect for my taste! We also ordered the Crispy Wings yakitori and I forgot the other one (it's something \"melt in your mouth?\" beef yakitori), that the waitress recommended and it was delicious! I wish I had known about this restaurant before, because I'm definitely coming back for more. I'm sorry I spilled the yuzu sake!", "rating": 5, "date": "2015-10-02"}], "juicy thighs": [], "juicy tsukune chicken stuffed mushroom": [], "tender soft flap steak": [], "melts with every bite belly steak": [], "juicy shrimp": [], "soft and tender salmon": [], "aromatic shiitake": [], "steak of veggie trumpet mushrooms": [], "slimy okra": [], "juicy zucchini": [], "cherry tomato with basil": [], "bitter sweet ginko nuts": [], "butter soy potato": [], "eggplant with soy sauce and ginger": [{"excerpts": ["Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\n"], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}], "chewy hearts": [], "crunchy gizzards": [{"excerpts": ["Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\n"], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}], "pasty soft liver": [], "crunchy soft cartilage bones": [], "crispy chewy soft skin": [{"excerpts": ["I think it was typical sizing), I got the Crispy Chewy Soft Skin (comes in two) and that's my absolute favorite."], "author": "Lilian L.", "review": "You either will die reading all of this or it will be beneficial.\n\nI like to remember things so yes, it's a long one.. \n\nTake-aways:\n\nGET THE:\n-Crispy Chewy Soft Skin\n- Yakitori Omakase Dinner\n\n-----\n\nLast night was my second experience here. The first with a friend and the latter with my cousins. It was Saint Patty's and honestly, we weren't going out for the holiday festivities (we actually forgot), but the Richmond was nice because.. even near the bars and the food places: it was 'dead': nothing packed, just the usual numbers. (If you want crazy: try the Castro and other areas.. or go to DTSJ like San Pedro Square). It was really nice not dealing with crazy people. We did walk to a local bar while we waited for our spot here (they said about 30 minutes and they called us). \n\nIt's a very small establishment with Beatle's memorabilia all over the place and Beatle's music playing in the background. I really like this place. My cousin and his girlfriend LOVE this place, but my other cousin has never gone. And it is sadly closed on Sundays (we were trying to go last Sunday after trying out couches at Living Spaces). So we did a raincheck and went last night.  \n\n-\n\nAnyways to the food..\n\n2nd experience:\n\nI ordered the beef tongue (comes in a set of two skewers). It was really good. And I appreciated that it was prepared differently than the beef tongue that I would also receive in my dinner set mentioned below. My dinner set was randomized so I didn't know I would be getting the 'same' thing, but it wasn't remotely the same. So thumbs up. \n\n------\n\nI also got the Yakitori Omakase Dinner which is one of their specials: \n7 assorted yakitori skewers (chef's choice so it varies on any given day)\n\nMy assortments came with a delicious beef tongue, \nplum soaked beef with herbs (that was my favorite), \norka (everyone loved this, but I thought it was okay),\npork (my cousin Kyle's favorite, but I'm not huge on charcoaled meats),\nmushrooms (super delicious), \nchicken meatball, and \nsalmon (my cousin Syd's favorite and it was good but it's not my go-to).\n\n*beef tounge isn't as chewy as the leunga of a burritto so if you were wondering on texture, I can't do super chewy meats, I think if you've never had tounge: it's a good starting dish to get here. It's really good.\n\nThe dinner comes is served with rice, miso soup and organic spring green mix salad.  The miso is really good here, they make it different than any place I've ever been too. They have enokitake mushrooms in their miso and it's not a super salty broth or anything, it's just dead-on good. \n\n**veggie choice available for the assortments \n\n--------\n\nWe also got Okonomiyaki (japanese style pizza pancake topped with traditional tonkatsu sauce, mayo, aonori and red ginger), it's vegetarian, very similar to a Korean seafood/non-seafood pancake. I liked it, but if you don't like Korean savory pancakes in general you won't like this, it's the same texture.\n\n------\n\nMy cousins got the Combination (I don't believe this is on the menu, but written on one of the boards on the wall) & Karaage Ramen. The ramens were good. This isn't really the right place to get Ramen, but it's good with the food we had.. we did order a lot.. so you might want to tone it down a notch. \n\n-----\n\nOne cousin got a sake flight (where they choose for you, but there's a lot of other options where it's not a surprise) and they enjoyed it. \n\nI just choose not drink so I can't comment on anything. \n\n----\n\nOne cousin got 2 Spicy Mentai Caviar Mayo Chicken, so all four of us got a skewer and it was really good. \n\n-----\n\nFirst experience:\n\nGot the takoyaki, crispy chicken wings (super small, my friend was disappointed.. I think it was typical sizing), I got the Crispy Chewy Soft Skin (comes in two) and that's my absolute favorite.", "rating": 5, "date": "2018-03-18"}], "crunchy chewy tongue": [], "crunchy juicy tontoro": [], "chicken thighs": [{"excerpts": ["We also had fried chicken thighs, and those were fabulous. \n\n"], "author": "Steph D.", "review": "Funktown, USA, this place is cool. The mixture of the rock music, Beatles décor, and expansive menu makes for the perfect date night. It's small and unassuming from the outside. Hiding a few doors down from Clement, I would have probably walked by and not even noticed if it hadn't been for yelp. There are probably 6-10 tables and a very small bar that seats maybe 8 people.\n\nWe got lucky when we walked in at 730 and were seated right away. Honestly, the ramen is 3 stars. There is truly nothing special about it. I got the Karage ramen, spicy, and it definitely satiated my cravings. Gyoza are more like wontons, but good nonetheless. We also had fried chicken thighs, and those were fabulous. \n\nMy advice: bring your hot date here for some warm ramen on a typical, cold SF night. The place is tiny, so the two of you will have to sit close together to talk. 2 blocks away is an ice cream shop where you can get dessert.", "rating": 4, "date": "2016-12-28"}, {"excerpts": ["We got the chicken thighs and the stuffed mushrooms, both were very yummy, but the mushrooms were very new to me, so they were a pleasant surprise. ", "We had drinks too, overall the cost for 4 of us sampling and sharing was not bad for such delicious food. ", "This is a tiny place, so prepare yourself for a wait if you are not there early (and don't leave a bad review just because of a wait, come on...)."], "author": "Jaime G.", "review": "Tiny hole-in-the-wall with a lot of character (60's music and Beatles decor). Was able to snag a table for 4 (luck!). We tried the ramen, which had a nice basic broth and thin ramen noodles (the spicy is nice and spicy). The yakitori was delicious, we chose bacon wrapped scallops (how can you go wrong) and chicken with scallions (yum). We ordered the gyoza which came out on a sizzling platter, these were not frozen from a bag gyoza! They were delicious. I also wanted to try some of their katsu. We got the chicken thighs and the stuffed mushrooms, both were very yummy, but the mushrooms were very new to me, so they were a pleasant surprise. We had drinks too, overall the cost for 4 of us sampling and sharing was not bad for such delicious food. This is a tiny place, so prepare yourself for a wait if you are not there early (and don't leave a bad review just because of a wait, come on...).", "rating": 4, "date": "2017-05-14"}, {"excerpts": ["My companions ordered many of the meat items and the ones they enjoyed the most were the chicken wings (rock salt), chicken thighs (shiso/ume),  beef belly,  and gyozas. \n\n"], "author": "Lydia H.", "review": "Cute little place and was packed on a tuesday evening when my party of four came in. Waited approximately 20 min until we were seated right away when the bar opened up. Saw that they had echigo red so we had to try that and it was delicious (sort of like IPA). Service was prompt and efficient; our server Erica was very nice, attentive, and patient with all our questions (which we had a lot). She also knew what each of us ordered and seperated everything for us so we did not accidentally eat each other's order, because we did order a lottt of food. \nFood I had (all vegetarian) : \nVeggie pizza- very unique and interesting, not what I expected due to the tonkatsu sauce but not bad \nSoy sauce mochi app- not my favorite; thought it was a little too bland, but that's just mochi \nCold tofu app-very flavorful and appetizing \nUme onigiri- loved it! Perfect combination of sour and salty \nMustard green onigiri- not my thing but my companions liked it; the combination was a little too salty \nMushroom steak app- very unique and had a strong taste to it, pieces of tofu inside \nEringi yakotori- really good and grilled perfectly; tasted even better with sauce \n\nMy companions ordered many of the meat items and the ones they enjoyed the most were the chicken wings (rock salt), chicken thighs (shiso/ume),  beef belly,  and gyozas. \n\nOverall, 5 stars to the cute ambiance, good food, good alcohol, and good service.", "rating": 5, "date": "2014-04-17"}, {"excerpts": ["chicken wings, chicken thighs, kara age (fried chicken) Wouldn't get next time: bacon-wrapped asparagus. ", "Good idea, but I found that some of the bacon wasn't very crisp and was more limp. ", "I would try to get more vegetables overall if I were the one ordering next time. "], "author": "Lisa K.", "review": "Yum! Somehow I'd decided on the way over that I didn't feel like going here, didn't know why I was going, etc. So I was ready not to like it. But Halu excelled despite my negative attitude! At 7:30 on a Thurs night we actually didn't have to wait for a table for 5, which seemed lucky.\n\nWe went fairly all out on the food, focusing on the yakitori. Favorites: ground chicken (nice and loose, rather than having the hockey puck texture of so many meatball-type items), short ribs (a little chewy but very flavorful), fried tofu appetizer (delicious!!). Good: chicken wings, chicken thighs, kara age (fried chicken) Wouldn't get next time: bacon-wrapped asparagus. Good idea, but I found that some of the bacon wasn't very crisp and was more limp. I would try to get more vegetables overall if I were the one ordering next time. Surprisingly good: whichever salad we had, which had unusually sweet and tasty strawberries and nice chunks of creamy avocado.\n\nI really liked the overall saltiness of a lot of the items - I know it'll apparently kill you faster than you thought and everything, but it was a nice touch on crispy exteriors.\n\nAnd don't worry, fellow Beatles haters, they only played Beatles music for like half the time we were there.", "rating": 4, "date": "2010-05-13"}, {"excerpts": ["definitely have the chicken thighs, short rib, pork &onion. "], "author": "jessica c.", "review": "I would give this place 5 stars except i'm subtracting one star because of the cramped quarters and long wait for food. we went on tuesday night 7:30ish\n\nWe went there specifically because of the great reviews for the yakitori ( skewers). most were $4-5 for two skewers, no doubt, they were amazing. definitely have the chicken thighs, short rib, pork &onion. we really liked the chicken & basil katzu skewer served with katzu sauce and hot mustard sauce. \n\nthe service was great and apologetic for our wait. we only had the skewers because we weren't starving, so perhaps it would have been faster if we had something else to eat as well.\n\nI'd come back if it was only for a quick snack or if they had a taco truck with only the skewers!", "rating": 4, "date": "2013-02-06"}, {"excerpts": ["We ordered the Chicken Hearts, Flat Iron Steak, Short Ribs and Chicken Thighs.  ", "All were very good.  ", "It was a lot of food, and I Should Have Known Better, but never do.  ", "We finished it off.  ", "The Little Man was amazing.  ", "He scarfed down that food like it was water.  "], "author": "James K.", "review": "In My Life, I have traveled many a Long and Winding Road, and even though I've been lucky enough to have eaten at many fine establishments, there's only a few places I actually Get Back to on a regular basis, come Rain or shine.  Unfortunately, some of these places, well some have gone and some remain.  Let It Be.\n\nHalu is a very good place not only for the food, but also because it's one of those cozy places you can bring a gaggle of people and have a grand old time.  It's a little short on the beer and sake selection for an Izakaya, but you'll get by With A Little Help From [your] Friends.\n\nOn this day, my Better Half and the Little Man accompanied me.  We were given three seats in a row at the bar.  We did have to wait what seemed like a Long, Long, Long time, but it really was just a few minutes.  The restaurant was packed that day, so the delay can be forgiven.  The waitress and everyone there was very friendly and kind, and all in all, the atmosphere is like a Yellow Submarine.\n\nWife and I ordered the Charsu-men.  Ah, the little Piggies who gave us their succulent souls to accompany our noodles.  Nice, fatty pork might be the best food in the world, but mix that with noodles, and it's heaven.  The broth was very flavorful, thick and rich, the noodles had an excellent consistency albeit slightly soft (preference really).\n\nMay be even better than the ramen though was the yakitori.  We ordered the Chicken Hearts, Flat Iron Steak, Short Ribs and Chicken Thighs.  All were very good.  It was a lot of food, and I Should Have Known Better, but never do.  We finished it off.  The Little Man was amazing.  He scarfed down that food like it was water.  There's definitely Something in the way the little dude can put it down.\n\nAll in all, it's one of the places I would love to go after a Hard Day's Night of work.  Grab a beer, a sake and order up some food with your friends.  In a lot of ways, it reminds me of my college days, I remember that like Yesterday, hanging out, having a good time, enjoying good food and good drink in a cozy atmosphere.  Three cheers for (or rather, four cheers) for Halu.  All Together Now.\n\nMay be they can open a branch down in the Peninsula, although there is already a ramen place called Halu in San Jose on Saratoga.  May be they can buy the name rights.  Tomorrow Never Knows.\n\nShout out to the Yelpers who were there that night as well.  Looks like a splendid time was guaranteed for all.\n\nOh, and the Beatles motif, eh, it's interesting.  ;-)", "rating": 4, "date": "2008-08-04"}], "chicken liver": [{"excerpts": ["I started with the chicken liver skewers. ", "They were good, but a bit pricey ($5.75) for only two skewers. ", "I also expected the liver to have a bit more of a richer flavor. ", "Next, I got the Karaage Ramen. ", "I didn't really understand the idea behind putting fried chicken in soup. ", "As one would expect, the fried chicken was not that crispy after being soaked by the broth :/  ", "The broth was flavorful, but lacking spice for my taste. ", "Luckily, they had some red chili flakes for me to spice up my ramen. ", "$12.50 was a bit more than I would like to pay for ramen, but it was a large bowl and the broth was flavorful. ", "If you want a soft-boiled egg, it's extra. "], "author": "Vasiliy M.", "review": "Tiny place with maybe less than 20 seats. We got there shortly after 5pm when they opened, so we were able to snag a couple of seats before it filled up. What's funny is that we waited about 20 minutes for them to take our order, but we were [encouraged] to head out as soon as we finished our food. By the time we left, around 6:15pm, there were 5-6 people waiting outside in the rain (the space is so small there was nowhere for them to wait inside). \n\nThe food was ok. I started with the chicken liver skewers. They were good, but a bit pricey ($5.75) for only two skewers. I also expected the liver to have a bit more of a richer flavor. Next, I got the Karaage Ramen. I didn't really understand the idea behind putting fried chicken in soup. As one would expect, the fried chicken was not that crispy after being soaked by the broth :/  The broth was flavorful, but lacking spice for my taste. Luckily, they had some red chili flakes for me to spice up my ramen. $12.50 was a bit more than I would like to pay for ramen, but it was a large bowl and the broth was flavorful. If you want a soft-boiled egg, it's extra. I forgot to ask for one and they never asked me if I wanted one. \n\nHalu has lots of character and is super cozy, but a little pricey. There are a couple other place in SF where I can get a better bowl of ramen for less money.", "rating": 3, "date": "2016-03-12"}, {"excerpts": ["Two of them were quite bony, and we did not like the chicken liver. ", "The belly steak was yummy as well as the avocado and guacamole beef skewer. ", "Both were a little too chewy..\n", "I enjoyed the karaage ramen. ", "It came with four big pieces of karaage, corn, red ginger, and onions. "], "author": "Christina G.", "review": "Went to Halu on a rainy Friday right when it opened. It is a very small and dimly lit restaurant and feels like youre at an old fashioned bar and hole-in-the-wall style atmosphere. There are a row of bar stools in the front and small tables in the back. I chose to sit at the small table in the back with the lamp under it. The server (super friendly and nice!) told us it was the most popular table since it was brightest. There are a bunch of beatles posters everywhere and beatles music playing in the background which gives it a cozy old vibe.\n\nFor two people, we ordered and shared a five skewer saikyo chicken set, two beef steak skewers, a karaage ramen, and an okonomiyaki. More than enough food, and took home a fourth of the okonomiyaki. The saikyo set was a bit too exotic for our liking. The gizzard was interesting. Two of them were quite bony, and we did not like the chicken liver. The belly steak was yummy as well as the avocado and guacamole beef skewer. Both were a little too chewy..\nI enjoyed the karaage ramen. It came with four big pieces of karaage, corn, red ginger, and onions. The okonomiyaki ($17) is the item to get here. It tasted authentic and reminded me of Japan. \n\nThere are many unique items to try. Food is tasty and a bit on the pricier side but I would come back. It was about $75 bucks total after tips.", "rating": 4, "date": "2016-03-12"}, {"excerpts": [": If you love chicken liver, I suggest you get it. ", "If you're a liver lover, I suggest you get the regular chicken liver skewer instead."], "author": "Jackie T.", "review": "A \"hole in the wall\" type restaurant, only seats approximately 30 people. The whole environment screamed BEATLES!!!! which was pretty cool, (:\n\n-Okonomiyaki: Had bits of beef, seafood, and veggies inside! This is really reliant on the sauce and mayo, so ask for more! Tasted really good with the extra sauce but it wasn't fluffy enough for me if that makes sense. I would get this if you want something to fill you up, but other than that this was just mediocre.\n\n:::Skewers:::\n-Beef Belly Steak (*MUST GET!*): Very buttery and delicious. The flavors also popped and every bite was simply amazing.\n\n-Beef Tongue: (*MUST GET!*): Tender and flavorful. Wasn't tough at all!\n\n-Tontoro: (*MUST GET!*): if you love fat, I highly recommend this. The tontoro (fatty pork) skewer was juicy and delicious! \n\n-Chicken Cartilage: The texture was great, but this was slightly too salty for my liking. Also, after the umami from the beef/pork skewers, this was just a bit lacking. I'd say give it a try if you're a chicken cartilage lover like me.\n\n-Chicken Liver: If you love chicken liver, I suggest you get it. The sauce complemented the liver really well.\n\n:::Deep Fried Skewers:::\n-Scallops: This was honestly pretty good, but I wouldn't get it again. It was fried perfectly; light and airy. However, there wasn't anything special about this. It was simply fried scallops, no distinct flavors or anything. I do suggest dipping this in mayo or their other sauces.\n\n-Chicken Liver: Nope. I like my liver cooked WELL DONE because pasty consistency makes me cringe. This was cooked, but it was soft and the \"melt in your mouth\" kind of liver, so I was just not having it. Also, flavors weren't poppin. If you're a liver lover, I suggest you get the regular chicken liver skewer instead.", "rating": 4, "date": "2016-08-14"}, {"excerpts": ["That being said, my absolute favorites are the beef belly yakitori (you won't regret ordering this), beef tongue yakitori, chicken cartilage yakitori, mochi wrapped in seaweed with miso butter, chicken liver yakitori, and the bacon wrapped mochi. ", "I haven't tried the ramen yet "], "author": "Jennifer C.", "review": "This has become my go to spot for izakaya in the city. Compared to other places, they give you bigger portions for a cheaper price. They also are on Eat24 and Postmates which is a good option if you don't want to deal with the long wait. Oh yes, if you get there late then you'll be waiting for a table for at least an hour. I suggest you get there close to when they open at 5pm. \n\nAnyway, back to the food. Everything here is flavorful so you can't go wrong with trying something new. That being said, my absolute favorites are the beef belly yakitori (you won't regret ordering this), beef tongue yakitori, chicken cartilage yakitori, mochi wrapped in seaweed with miso butter, chicken liver yakitori, and the bacon wrapped mochi. I haven't tried the ramen yet but I hear that it's delicious as well. \n\nCan't wait for my next visit!", "rating": 4, "date": "2017-04-14"}, {"excerpts": ["If you like chicken and their organs, you should get the saikyo set which includes skewers of chicken liver, skin, cartilage, and heart."], "author": "Edwin N.", "review": "The chasu-men is legit here. Very comparable to Miki on Balboa. If you like chicken and their organs, you should get the saikyo set which includes skewers of chicken liver, skin, cartilage, and heart.", "rating": 5, "date": "2017-09-09"}, {"excerpts": ["- Chicken liver (3/5)\n- Chicken tendon? "], "author": "Simon L.", "review": "Relatively convenient even on a Saturday night at 7pm.  First, there's a small parking lot literally right next door.  Second, there's a great bar with tons of beer on tap one block away (Richmond Republic Draught House), so you're not twiddling your thumbs while waiting for your table.  For our party of 2, it took less than 30 minutes to get seated.\n\nWe tried a ton of different things:\n- Beef belly (5/5) - Absolutely awesome.  Well-marinated, nicely marbled, and perfectly cooked.  This was the best dish of the night.\n- Chicken heart (4/5) - Firm and crunchy - very tasty.\n- Chicken gizzard (4/5)\n- Chicken skin (4/5) \n- Chicken liver (3/5)\n- Chicken tendon? (3/5)\n- Okonomiyaki (4/5) - Nice and filling, with a good mix of different savory flavors.  A great dish to share.\n- Pork Jowl (4/5) - Fatty and flavorful, served with a mustard dip.  Good, but not quite as good as at Sozai.\n- Chicken stuffed mushroom (4/5) - Basically a chicken meatball inside of a mushroom.\n- Seaweed-wrapped mochi (2/5) - Not a huge fan of this, as it was definitely on the salty side.\n\nOverall, everything was really well seasoned, and it was a really enjoyable meal in a funky, cozy environment.  Would definitely come back!", "rating": 4, "date": "2016-02-14"}, {"excerpts": ["I followed suit and got me some Chicken Liver Kushi-age, also for $4.50 ' cause I loves me some fried chicken innards (see photo). ", "It looks like a Japanese-American couple runs the place with a hip-looking girl running around waiting on all the incoming diners. ", "It's all good comfort food for the undiscriminating sansei with a pork fetish. "], "author": "Ed U.", "review": "I am the eggman, they are the eggmen. \nI am the walrus, goo goo g'joob g'goo goo g'joob. \n\nThey're really into the Beatles here. When I was younger, so much younger than today, I never needed anybody's help in any way... until I discovered bacon-wrapped mochi. Me want more. It's a funky-retro closet of a place that beckons the hipster foodie like the sirens did when Ulysses passed by on the way between Scylla and Charybdis. Jamie W. and I got here fifteen minutes before they opened at 5PM last Saturday worried we would have to wait for a table. Not quite but it did start filling up relatively soon after that. \n\nSo many temptations, but we knew we wanted the ballyhooed ramen. It wasn't disappointing and a far cry better than what we had at Asuka a couple of weeks before. Jamie went for the $12.50 bowl of Spicy Kara Age Ramen (Fried Chicken), while I ordered predictably as well, the $12.50 bowl of Lava Ramen (Spicy Roast Pork Ramen) (see photos). Speckled with hot peppers, the broth was smooth without being too salty, and the slices of pork were particularly plentiful. The noodles had the right al dente bite, and even the hard-boiled egg was satisfying. Seriously delicious stuff, but drink plenty of water. \n\nBut even before the ramen, we dove into the $5.50 quartet of Mochi Bacon (see photo). So greasy, so chewy, so wrong. More skewers were needed. Jamie ordered the $4.50 Pork with Onion Kushikatsu, which was basically a pair of pork tonkatsu kebabs on a stick with sauce and mustard. I followed suit and got me some Chicken Liver Kushi-age, also for $4.50 ' cause I loves me some fried chicken innards (see photo). It looks like a Japanese-American couple runs the place with a hip-looking girl running around waiting on all the incoming diners. It's all good comfort food for the undiscriminating sansei with a pork fetish. That would be me. \n\nAnd in the end... \nThe mochi bacon you take \nIs equal to the mochi bacon you make. \n\nFOOD - 4 stars...awesome Japanese bar food with one whip-snapping bowl of spicy ramen \nAMBIANCE - 2.5 stars...Penny Lane is in my ears and in my eyes \nSERVICE - 3.5 stars...as fast as she could possibly serve \nTOTAL - 4 stars...a return visit to Liverpool is in the cards, love", "rating": 4, "date": "2011-07-14"}, {"excerpts": ["Ordered a couple of small yakatori dishes as appetizers: chicken liver, grilled shataki mushroom, chicken stuffed mushroom, and cold tofu. ", "Each was perfectly seasoned and with just the right amount breaking on the chicken liver. :-) ", "would definitely come back again when I'm in SF next."], "author": "Tina L.", "review": "Had the Karage ramen while the BF had the Chasu ramen. Broth was flavorful and just the right amount of portion. After finishing the dish, I was not too full and just right amount of satisfied. :) the restaurant was entirely Beatles themed, which was a bonus since the BF was a Beatles fan. Ordered a couple of small yakatori dishes as appetizers: chicken liver, grilled shataki mushroom, chicken stuffed mushroom, and cold tofu. Each was perfectly seasoned and with just the right amount breaking on the chicken liver. :-) would definitely come back again when I'm in SF next.", "rating": 4, "date": "2016-10-05"}, {"excerpts": ["We ordered the following:\n\nCombination Okonomiyaki ($15)\n\nSkewers:\nChicken liver ($5)\n", "Okonomiyaki is a Japanese pancake. ", "The combination had veggies, seafood & beef. ", "The toppings is just like what they have on a yakitori. "], "author": "Kitty K.", "review": "On 8th street, it's the third establishment from the corner, you can easily miss this place. Literally,  a hole-in-the-wall, there's barely any room to walk into the restaurant. The decor is Beatles everywhere, which I absolutely loved! Table reading was Chinglish and provided amusing entertainment.\n\nCame here because was craving some yakitori and boy did they deliver! We ordered the following:\n\nCombination Okonomiyaki ($15)\n\nSkewers:\nChicken liver ($5)\nChicken hearts ($5)\nChicken gizzards ($5)\nBeef tongue ($6)\n\nThe skewers weren't dry & had just the right amount of char. Beef tongue was nice and tender. Seasoning was a simple salt & pepper for the skewers except the liver (which the marinated was delicious).\n\nOkonomiyaki is a Japanese pancake. The combination had veggies, seafood & beef. The toppings is just like what they have on a yakitori. So much flavor! \n\nLucky we came early because it got super packed very quickly. Definitely coming back :)", "rating": 5, "date": "2013-12-15"}, {"excerpts": ["I am not sure why I picked the basic yakitori fare like chicken liver, chicken gizzard, shitake, stuffed mushroom and salmon yaki onigiri for the evening. ", "They were not bad but were not great either. ", "In addition, I tried the tako wasabi which had good flavor and did give my jaw ", "a good work out. ", "On hindsight, I am sure what I ordered were not their best. ", "There were other stuffs in the menu yelpers raved about. "], "author": "Geoff G.", "review": "The signage said it all: \"A Different Japanese Restaurant\". It was different alright. I have driven by a zillion times and never noticed the place until I read the reviews. I arrived @ 5.15pm and from the outside, it looked dark and dingy like there were some construction works going on inside. The sign at the front door still said \"closed\" and the frontage looked uninviting. The inside though was quite cute. The walls were adorned with Beatles paraphernalia, posters of the Grateful Dead, The Who and Jimi Hendrix. Signs of a bygone era like \"Love\", \"Peace\" and \"End of War\" were posted in the restaurant. The inside had a funky vibe and the ambience was like an old English pub. it also looked somewhat like my old college dorm! The atmosphere was incompatible with the kind of food they served though I don't mean it in a bad way. I found out that the reason for the upbeat hippie look. The yakitori chef (owner?) was a musician before and obviously a big Beatles fan.\n\nThe decor did bring back some fond memories of the 60s and 70s but the food didn't quite measure up. My biggest disappointment was the chashu ramen. The chashu smelled obnoxious and was a big turnoff. It smelled of pig's urine. Damn! This was the second time in three months that I was served with stinky chashu. My other experience was in Great Eastern in Chinatown. The bad pork spoiled the broth as well and my complaint to the server just fell on deaf ears. I can understand once in a while the shipment of pork they buy might be bad but I can't condone or understand how the chef could have failed to detect this and continue serving it to their customers. A big thumbs down on this one.  \n\nI always order skewer/yakitori items whenever i dined in an izakaya place. I am not sure why I picked the basic yakitori fare like chicken liver, chicken gizzard, shitake, stuffed mushroom and salmon yaki onigiri for the evening. They were not bad but were not great either. In addition, I tried the tako wasabi which had good flavor and did give my jaw a good work out. On hindsight, I am sure what I ordered were not their best. There were other stuffs in the menu yelpers raved about. Included in my next to try list - bacon wrapped mochi, rib eye skewer, agedashi tofu and the seafood okonomiyaki (pancake).\n\nThe restaurant does have a unique atmosphere that I like and has potential for improvement. On the ramen, they need to pay more attention to meat quality, go easier on the salt and allow the pork bones to simmer longer for better broth flavor.", "rating": 2, "date": "2013-01-04"}, {"excerpts": ["Beef tongue, pork cheek, chicken liver, cilantro/avocado chicken, shiso/ume beef, okra, eringi and shiitake mushrooms, etc are all things I normally order on skewer. ", "Gyoza, soba salad, and kara age is always good too for appetizers. "], "author": "Steven I.", "review": "I frequent Halu a lot and it's one of, if not my favorite, izakayas to go to in SF.\n\nI'll start off with the service. On a busy day, it is pretty hard to get a servers attention at time, but it's not because of negligence. Erika and co. are constantly moving around and when they do get to me, they're nothing but friendly. On a slow day, service is perfect. No complaints.\n\nNext is wait time. On a busy day, it can take awhile for certain things to come out, BUT there always seems to be a steady stream coming to keep me satisfied. I normally spend at least $100 and don't remember a time where we were just waiting with nothing to eat/drink.\n\nAs for food quality, it's amazing. I don't think I've had anything I've disliked at Halu. There are somethings that are better than others (in my opinion), but overall no complaints. Yes, the food is a little salty, but I like salty foods so it's not an issue (may be for others). Beef tongue, pork cheek, chicken liver, cilantro/avocado chicken, shiso/ume beef, okra, eringi and shiitake mushrooms, etc are all things I normally order on skewer. Gyoza, soba salad, and kara age is always good too for appetizers. On occasion they carry green tea tiramisu which is my favorite dessert there.\n\nI don't switch it up on drinks too much but they do have my 2 favorite Japanese alcohol beverages: Orion beer and Iichiko shochu. They do have normal sake, flavored sake, chu hai, etc as well, but I normally don't go for those so can't comment on quality.\n\nLastly, the atmosphere is great. It is a small place, but it reminds me of izakaya in Japan. The Beatles' memorabilia around the place is cool and they always play great tunes. If you don't mind getting cozy around other tables/people, check it out.", "rating": 5, "date": "2015-08-17"}, {"excerpts": ["I've loved all the skewers I've tried, especially the stuffed mushroom and chicken liver (go figure). "], "author": "Cassie C.", "review": "Easy to miss this place tucked away on a Clement side street...well, except the usual mass of waiting patrons is a dead giveaway.\n\nI've been here a couple of times. Specializing in yakitori, and also unexpectedly catering to die-hard Beatles fans, the uniqueness alone keeps me coming back. \n\nThe waitresses are sweet and friendly and do their best amidst the raucous, cramped interior.\n\nAs plainly stated on the menu, the food really is best enjoyed with a couple of beers. The yakitori comes out piecemeal and it's one of those rare places you can take your time to share a meal and good company.\n\nNow as far as the food...No sushi ;) !! \nI've loved all the skewers I've tried, especially the stuffed mushroom and chicken liver (go figure). One of the few places offering okonomiyaki, I found them to be a little thinner than expected, but sublime nonetheless (go for the combination one). Ramen was salty and not recommended, but you're going there for the yakitori anyway.", "rating": 4, "date": "2013-07-15"}, {"excerpts": ["http://tinyurl.com/45yagmg\n\nChicken Liver Skewers (I will not score it. ", "I do not like chicken liver ", "I tried it. ", "I still do not like chicken liver.)\n\n"], "author": "Mark D.", "review": "I really enjoyed our meal at Halu. Sure, it's a hole in the wall and it is very small. But that is all part of it's charm.\n\nPlus, can you beat a small Japanese restaurant sporting bunches of Beatles and rock memorabilia?\n\nThe service was friendly and fast. Our server was also helpful in making menu suggestions. After we ordered, there was a steady stream of food. Plus, we ordered a ton of food and some beers but the total was only about $87.\n\nWe mix up how we order and, for Halu, she did most of the ordering. I picked one dish. She picked the rest. I do not know the correct name for each dish we but I do know what the dishes basically were.\n\nShe selected:\nSausage Yakitori (4 stars)\nPork Yakitori (3 stars)\n\nhttp://tinyurl.com/3qcjble\n\nFried Chicken (3 stars)\n\nhttp://tinyurl.com/3ndlsnr\n\nBacon Stuffed Zucchini Skewers (5 stars)\n\nhttp://tinyurl.com/3b7uk2y\n\nChicken Skin Yakitori (3 stars)\n\nhttp://tinyurl.com/44n8pmk\n\nFried Scallops Skewers (3 stars)\n\nhttp://tinyurl.com/45yagmg\n\nChicken Liver Skewers (I will not score it. I do not like chicken liver I tried it. I still do not like chicken liver.)\n\nhttp://tinyurl.com/3p5mmn6\n\nSalad with strawberries (5 stars)\n\nhttp://tinyurl.com/3f9shhh\n\nEdamame (3 stars\n\nhttp://tinyurl.com/3myrtow\n\nSeafood Pancake (2 stars)\n\nhttp://tinyurl.com/3ktclg5\n\nStuffed Mushrooms (5 stars)\n\nhttp://tinyurl.com/3lvhfvk\n\nI selected:\nShiso Beef Yakitori (4 stars)\n\nhttp://tinyurl.com/3ha42as\n\nThe stuffed mushrooms were taste explosions. I could eat a dozen of them. Oh what is the best thing you can do with zucchini?  Yep you got it.  Wrap it in bacon. The salad was super fresh. The sweetness of the strawberries was a nice contrast to the slight bitterness of the greens.\nI did not really like the seafood pancake. It was a little soggy. Plus, the seafood flavor was just one big overpowering note.\n\nCool hole in the wall ambiance + fast. friendly. helpful service + great food = no-brainer to return or recommend.", "rating": 4, "date": "2011-04-28"}, {"excerpts": ["As for the yakitori, Chicken Liver and Beef Tongue are must-try! \n\n"], "author": "July N.", "review": "Okonomiyaki, Yakitori and Ramen!\n\nIt's a small hole-in-wall, with 4-people counter space and 6 tables. Very divey. It's such a great place for catching up with friends over beer and yakitori.... However, I dont think you want to bring a big group of friends due to the space constraint. Oh, they also charge automatic 20% gratuity for party of 5 or bigger.\n\nI love the Lava Ramen. Its quite flavorful with two huge pieces of pork, corn, and half of a hard-boiled egg.\nAs for the yakitori, Chicken Liver and Beef Tongue are must-try! \n\nService is very prompt and friendly and they accept credit cards.", "rating": 4, "date": "2011-09-28"}, {"excerpts": ["We originally ordered the Chicken liver Yakitori & the Enoki Bacon but they were over whelm with a big table order of them b 4 us and didn't even remember to do it.....", "They apologize for the mistake but luckily we were full from the Ramen already.  \n", "The place is small but cozy....music is kinda loud but cool!\n", "They are about 1 month old and probably still trying to work out the timing thing as we have to wait for quite sometime to get our food.\n", "Will definitely come back......\n", "BTW....", "it is Japanese owned and operate!!!"], "author": "Mel T.", "review": "We came here after work tonight looking for Miso Ramen and came to find out they do not have it today.....so we both had Soy Char Su Ramen....It was just as good.  The noodle is not as good as Katana-ya but the broth was the bomb.\nWe also had Daikon Radish salad....awsome as well.\nWe originally ordered the Chicken liver Yakitori & the Enoki Bacon but they were over whelm with a big table order of them b 4 us and didn't even remember to do it.....They apologize for the mistake but luckily we were full from the Ramen already.  \nThe place is small but cozy....music is kinda loud but cool!\nThey are about 1 month old and probably still trying to work out the timing thing as we have to wait for quite sometime to get our food.\nWill definitely come back......\nBTW....it is Japanese owned and operate!!!", "rating": 4, "date": "2008-07-23"}], "beef steak": [{"excerpts": ["Tako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken "], "author": "Camera P.", "review": "There was a little bit of a wait to get in so we decided to go grab some drinks while our name was placed on the waitlist. It was definitely worth it and we will be back for both the food, drinks, great service, and atmosphere. The place is a little small, but it packs a big punch with its flavors and welcoming vibe. We ordered a few rounds of sake, the unfiltered being my favorite, and they were chilled nicely and tasted great. We got a variety of skewers to share and everything was delicious.\n\nTako Wasabi Marinated Octopus, Geso Age Calamari, Chashu Men, Spicy Mentai Caviar Mayo Chicken, Shiso Beef Steak, Juicy Tsukune Chicken Stuffed Mushroom, Eggplant with Soy Sauce and Ginger, Crunchy Gizzards.\n\nThe only thing they were out of that we wanted to try were the hearts. Overall a very nice place to bring anyone and try. The servers were also amazing and very patient and informative. Definitely worth the wait and trip there. You got to find this little gem because it's a bit hidden. You will not be disappointed.", "rating": 5, "date": "2017-04-30"}, {"excerpts": ["For two people, we ordered and shared a five skewer saikyo chicken set, two beef steak skewers, a karaage ramen, and an okonomiyaki. ", "More than enough food, and took home a fourth of the okonomiyaki. ", "The saikyo set was a bit too exotic for our liking. ", "The gizzard was interesting. ", "The okonomiyaki ($17) is the item to get here. "], "author": "Christina G.", "review": "Went to Halu on a rainy Friday right when it opened. It is a very small and dimly lit restaurant and feels like youre at an old fashioned bar and hole-in-the-wall style atmosphere. There are a row of bar stools in the front and small tables in the back. I chose to sit at the small table in the back with the lamp under it. The server (super friendly and nice!) told us it was the most popular table since it was brightest. There are a bunch of beatles posters everywhere and beatles music playing in the background which gives it a cozy old vibe.\n\nFor two people, we ordered and shared a five skewer saikyo chicken set, two beef steak skewers, a karaage ramen, and an okonomiyaki. More than enough food, and took home a fourth of the okonomiyaki. The saikyo set was a bit too exotic for our liking. The gizzard was interesting. Two of them were quite bony, and we did not like the chicken liver. The belly steak was yummy as well as the avocado and guacamole beef skewer. Both were a little too chewy..\nI enjoyed the karaage ramen. It came with four big pieces of karaage, corn, red ginger, and onions. The okonomiyaki ($17) is the item to get here. It tasted authentic and reminded me of Japan. \n\nThere are many unique items to try. Food is tasty and a bit on the pricier side but I would come back. It was about $75 bucks total after tips.", "rating": 4, "date": "2016-03-12"}, {"excerpts": ["The crispy chicken and beef steak were delicious. ", "Two types of mushrooms were good. ", "Another kind of chicken cut. ", "I forget what the others were.  ", "Friendly waitress. "], "author": "Karen M.", "review": "Likes: Halu combo okonomiyaki was like a chewy on the inside and crispy on the edges pancake. It had a little of very meat in it. \nTheir combo was also great. Came with miso soup, rice, mini salad, and seven skewers of the chefs choice. The crispy chicken and beef steak were delicious. Two types of mushrooms were good. Another kind of chicken cut. I forget what the others were.  Friendly waitress. Parking not too bad on the street. \n\nDislikes: chicken was good but a little salty. My tongue was tingling afterward. Lucky for them I like salt, but even this salt lover has limits!  Also our cups of water smelled like soap, which is great because that means they're clean! But I was worried there might be some residual soap leftover so I didn't touch my water :(", "rating": 4, "date": "2015-08-11"}, {"excerpts": ["Beef steak fillet, Shiso Beef and Rib eye were So Tender!\n", "Salt Chicken breast was So Good!\n"], "author": "Nobu K.", "review": "I haven't been here for a while, it seems like Halu has new menu.\nNow, one of twin girl in the kitchen, I have heard that their dad past so she took her dad's position. It seems like they are really busy working here, keep their business going.\nWe were 4 of us here for Saturday night dinner having the Kushi-Yaki ( skewered bbq meat ) menu.\n( reason why I say \"Kushi-Yaki\" only because Yaki-Tori means BBQ-Skewered-Chicken only. Skewered-Beef isn't called Yaki-Tori, period. Doh! )\n\nWe got:\nYakitori dinner, 7 skewers combo, plus:\nPork sausage was So Juicy!\nTontoro (pork Jowl) was melt in my mouth!\nBeef steak fillet, Shiso Beef and Rib eye were So Tender!\nSalt Chicken breast was So Good!\nAlso,\nI really like the new Exotic Yaki-Tori menu:\nChicken hearts, liver, cartilage, gizzards, ummmm, so good!\n\nAll Kushi-Yaki are pretty big, 5 to 6 bucks for 2 skewers, is I think good deal.\n4 bucks for one small Onigiri is not a really good deal, but WTF?\nWe had a wonderful time.\n\nIt was full house, and there was a line for 30 minutes wait. \nI am so glad to see Halu is busy.\nThat means, real people know what's really good authentic Japanese.\n\nI think the twins and mom are doing good job, their dad is proud of them.\nHey old man, your Halu will be fine.", "rating": 5, "date": "2014-11-17"}], "trumpet mushroom": [{"excerpts": ["The shiitake and trumpet mushroom skewers were my favorites on the veggie set. \n\n"], "author": "Dan O.", "review": "Walking in to Halu you'll find a cozy, quaint, and friendly restaurant.  We went on a rainy Thursday evening so the crowd wasn't too bad.  We ordered the Kara age ramen with veggie lovers skewer set and grilled mochi w/ soy sauce and nori. Everything was delicious particularly the ramen w/ Broth full of spice and flavor.  The shiitake and trumpet mushroom skewers were my favorites on the veggie set. \n\nIn addition the service was fast, friendly, and very helpful.", "rating": 4, "date": "2016-03-10"}, {"excerpts": ["Other favorites include nori wrapped mochi, swiss cheese eggplant (special), & trumpet mushroom.\n\n"], "author": "Alysha K.", "review": "Previous to finally eating here, I've heard a lot of mixed reviews about Halu from the food to service. In a nutshell, I thought the izakaya / yakitori style food was amaze-balls, the ramen was bleh, and the service was slow.\n\nLuckily I arrived early enough so I didn't have to wait for a seat (around 630pm). However, after ordering, the wait was probably about 15 minutes before the food arrived. And if you want to order something else, you have to flag down the server, even though the restaurant is only \"so big.\" \n\nAll of the yakitori dishes were very tasty with a good amount of sea salt on it. I especially enjoyed the short ribs & beef tongue. Other favorites include nori wrapped mochi, swiss cheese eggplant (special), & trumpet mushroom.\n\nI have to warn that ALL of the decor/ambiance is Beatles, even the music! It didn't bother me, but just saying.\n\nDef will be back again soon to try more things!", "rating": 4, "date": "2011-03-14"}, {"excerpts": ["Trumpet mushroom ", "kushikatsu - good, not amazing.\n"], "author": "Karen C.", "review": "Another reviewer commented that this is a non-sushi Japanese restaurant. Having lived in Japan, we're always on the hunt for \"real\" Japanese food. We definitely found it at Halu! \n\nWe visited this restaurant around 7:45pm on Saturday night. We were seated right away at the bar. \n\nWe shared the Agedashi Tofu, which was just perfect, and an assortment of skewers as follows:\n\nBacon-wrapped asparagus - very tasty.\nAsparagus - good, not amazing.\nGyuu-shiso - delicious, with mild shiso flavor.\nPork jowl - good, a bit rubbery\nBacon-wrapped enoki mushrooms - amazing - our favorite dish!\nTrumpet mushroom kushikatsu - good, not amazing.\nChicken gizzards - he loves 'em (me = not so much).\n\nThe only drawback, and frankly why the restaurant gets three stars instead of four, is that it took more than an hour to get our skewers. The appetizer came in about 20 minutes, which is okay. But then, it was maybe another 45 minutes (or longer) till the skewers came. The restaurant is small, but it really shouldn't have been a two-hour meal since we weren't drinking (much) or planning a drawn-out experience.\n\nWe will definitely be back and I'll upgrade this review if we don't experience the same issues with speed. Either way, the food is great so check it out the next time you don't have anything else planned!", "rating": 3, "date": "2010-09-05"}, {"excerpts": ["but they do all add up $$$\n\nbutter fried mochi wrapped in seaweed - sooo good \nbacon wrapped scallops \nbacon wrapped mochi\noyster chicken \nrib eye steak \nshort ribs\nokra\ntrumpet mushroom\n\nchicken karaage - nice since it wasnt heavily battered"], "author": "she q.", "review": "We've been snacking at little things all day so decided to try this place from a friends recommendation since we didnt want a full on meal.  We got there about 8ish on a Saturday.  The five of us had to sit at the bar but I think we were lucky since a bunch of other people came in right after us.  They were super busy so service wasnt quick because it took some time for us to order.  They do acknowledge you right away when you get in the door to let you know how long the wait would be.  Its tiny and packed in there.  They have a lot of Beatles memorabilia.  Didnt get to try the ramen or the okonomiyaki at this visit but will try next time.\n\nWe just got a bunch of yakitori:  all very yummy but they do all add up $$$\n\nbutter fried mochi wrapped in seaweed - sooo good \nbacon wrapped scallops \nbacon wrapped mochi\noyster chicken \nrib eye steak \nshort ribs\nokra\ntrumpet mushroom\n\nchicken karaage - nice since it wasnt heavily battered", "rating": 4, "date": "2011-03-23"}, {"excerpts": ["trumpet mushroom yakitori- meaty and hearty\nchicken gizzard yakitori - not for me ", "- i don't like the texture of gizzard but heard it was the tastiest\npork belly yakitori- ", "the best bang for the buck and yummy\nkaraage ramen - noodles had good texture and broth was pretty good ", "but i think KatanaYa is still better\nagedashi tofu ", "-surprised they used such a soft tofu for this but the broth was sooooooo good\nokra ", "kushi - ", "i love okra", ", probably would try it yakitori next time\nthe place is probably a little pricey given the hole in the wall vibe but I'd come back!"], "author": "Amina B.", "review": "Super friendly staff and cool vibe.  Ordered mostly off the specials board.  I was bummed they didn't have the marinated fresh octupus.  We did have the \nchicken skin yakitori-  i expected it would be at least a little crispy but it was totally chewy.  don't get me wrong, i'm the kind of person that likes my bacon chewy vs. crispy but it just wasn't what i expected\ntrumpet mushroom yakitori- meaty and hearty\nchicken gizzard yakitori - not for me - i don't like the texture of gizzard but heard it was the tastiest\npork belly yakitori- the best bang for the buck and yummy\nkaraage ramen - noodles had good texture and broth was pretty good but i think KatanaYa is still better\nagedashi tofu -surprised they used such a soft tofu for this but the broth was sooooooo good\nokra kushi - i love okra, probably would try it yakitori next time\nthe place is probably a little pricey given the hole in the wall vibe but I'd come back!", "rating": 4, "date": "2009-11-29"}], "kushi katsu dinner": [], "halu special yakitori": [], "lava spicy": [{"excerpts": ["I ordered the chashu ramen lava spicy. ", "It wasn't too spicy when I first started eating ", "but then it slowly got more spicy. ", "I liked the ramen noodles. ", "They were not over cooked and had a good firmness to them. ", "There were several large pieces of chashu in the bowl. ", "The meat had good flavor. ", "There was also half an egg in the bowl. "], "author": "Alexander L.", "review": "I went here with a couple friends for dinner. I ordered the chashu ramen lava spicy. It wasn't too spicy when I first started eating but then it slowly got more spicy. I liked the ramen noodles. They were not over cooked and had a good firmness to them. There were several large pieces of chashu in the bowl. The meat had good flavor. There was also half an egg in the bowl. My friends ordered the yakitori and it looked very good.  \n\nThe service was pretty good. The restaurant is really small inside. They play beetles music and have beetles artwork covering the walls. They don't serve any sushi. Come here for the great ramen and yakitori. I Wish they would open for lunch.", "rating": 4, "date": "2012-04-29"}], "pieces chashu": [], "pieces kara age": [], "bean sprouts": [{"excerpts": ["I don't like that their egg is not soft-boiled (the yolkiness is soooo important) and they put a lot of bean sprouts in the broth that it gets into my way of slurpping the ramen. "], "author": "Ringo M.", "review": "Halu is cool because they decorate the small little restaurant with an abundance of Beatles collectibles. They also play oldie music in the background, so i guess it really takes you back to the 60's/70's if you grew up jamming to those tunes. If you sit in the bar area, you'll see a row of Japanese Premium Beer lined up on the counter. Each of those beer can run you up from $8-$12, so be careful where you point to!\n\nA couple of skewers are always fun, especially if you order things like the bacon-wrapped mochi or exotic things like those chicken/beef internal organ stuff (hope im not grossing anyone out!). I think most of the skewers just taste like oily crispy stuff, but they're fun to try. I think the $4 and up price tag would be more justified if I am able to distinguish the skewers by taste.\n\nI come to Halu for their ramen though, so that's the most important part of the review. The Lava Ramen looks Red Hot Chili Peppers, but it's actually not too spicy. I don't like that their egg is not soft-boiled (the yolkiness is soooo important) and they put a lot of bean sprouts in the broth that it gets into my way of slurpping the ramen. So overall, i don't think it's the best bowl of ramen ever, but it's still decent.\n\nI think this is a cool place to just enjoy the vibe with some beer/sake and snacks/skewers. I wouldn't stand in line just to wait and try their ramen.", "rating": 3, "date": "2013-09-16"}, {"excerpts": ["Maybe I just wasn't too impressed by the Chashu Lava Ramen... it was quite simple, with chashu, seaweed, green onions, bean sprouts, and some red veggie that I forget the name of... but nothing that makes me go ", "oh-my-goodness I want more! ", "I had a taste of the chicken karaage ramen, which I found was much, much more tastier.  ", "Super friendly service, but the food did take over half an hour to serve.  :c  Very limited seating and just waiting in general, kinda took forever.  :c  ", "Waiting to get seated... waiting for the appetizers to come one at a time ... waiting for the ramen... ", ":c  ", "I don't think I could ever come here starving and expect to have a satisfied tummy within the next 30 minutes.  ", ":", "c"], "author": "Carena N.", "review": "I think this is the first ramen place I've been to that I didn't finish all of my ramen... wuttttt!  Maybe I just wasn't too impressed by the Chashu Lava Ramen... it was quite simple, with chashu, seaweed, green onions, bean sprouts, and some red veggie that I forget the name of... but nothing that makes me go oh-my-goodness I want more! I had a taste of the chicken karaage ramen, which I found was much, much more tastier.  Super friendly service, but the food did take over half an hour to serve.  :c  Very limited seating and just waiting in general, kinda took forever.  :c  Waiting to get seated... waiting for the appetizers to come one at a time ... waiting for the ramen... :c  I don't think I could ever come here starving and expect to have a satisfied tummy within the next 30 minutes.  :c", "rating": 3, "date": "2013-09-09"}, {"excerpts": ["both of us ordered the chashumen ramen (~10-11 bucks), which came with noodles, ginger, bean sprouts, onions, corn, and an egg in a pretty large sized bowl. ", "noodles were bomb and plentiful and cooked to al dente perfection. ", "broth was flavorful. ", "meat was PLENTIFUL! ", "i wasn't expecting that many pieces of meat floating around "], "author": "Caitlin C.", "review": "i'd say that this place totes has the potential to be quite hard to miss, but luckily, the HALU sign in size 1500 font makes it quite findable. you can see the sign from Clement street, even though the restaurant is off to the side on 8th Ave!\n\nthe place is tiny! it's crammed with Beatles paraphernalia and other knickknacks. there's a counter that squeezes about 6 stools, and a handful of tables for 2. i would recommend not coming with more than a party of 2, otherwise you'll be waiting for years.\n\nluckily, we were able to squeeze the two of us into the counter seating area. unluckily, i was seated next to a ... full grown bulky (buff?) dude. both of us are wearing fleeces, so we are essentially elbow to elbow. we laugh awkwardly at how cozy we are and remove our fleeces, so now there is about a 1 inch gap between our elbows. awkwardness slightly resolved, until i drop my  chopstick wrapper and it conveniently falls into his lap due to our close proximity to each other. and back to awkward we go...\n\nbathroom was cute, had one of those squishy toilet seats that you really get to sink your behind into. not enough room to open the (outswinging) door so i nearly hit the man in line for the bathroom outside.\n\nboth of us ordered the chashumen ramen (~10-11 bucks), which came with noodles, ginger, bean sprouts, onions, corn, and an egg in a pretty large sized bowl. noodles were bomb and plentiful and cooked to al dente perfection. broth was flavorful. meat was PLENTIFUL! i wasn't expecting that many pieces of meat floating around but hey, the more the merrier! pleasantly surprised.\n\nwe also ordered 3 types of yakitori - pork and onion, flat steak, and bacon wrapped scallops. delish! pork was tender and went perfectly well with the onion. the flat steak was seared . bacon wrapped scallops are self explanatory, aka oily heaven in my mouth.\n\noverall halu is in my top 5 for ramen, but it doesn't quite hit the top spot for me. however, i would be willing to come back here again to try the karaage ramen and the other yakitori!", "rating": 4, "date": "2013-08-04"}, {"excerpts": ["I did not like the addition of bean sprouts and green onion. ", "The bean sprouts were raw and distracting with every bite! ", "Although a bit disappointed with the flavors, i get the cozy neighborhood vibe. ", "They're welcoming and the staff is obviously a hard working bunch."], "author": "Samantha L.", "review": "Quirky yet fun space filled with Beatles paraphernalia. The restaurant is extremely small. I felt a bit claustrophobic being seated by the doorway but heard great things about Halu and stayed. Props to the one young server trying to manage all these tables in a the tiny place. I skipped ordering any yakitori to leave room for sake and ramen. Took longer than expected for our dishes to come out. I had the chashu-men which came with all the usual fixings: corn, ginger, egg, & slices of pork. I did not like the addition of bean sprouts and green onion. The bean sprouts were raw and distracting with every bite! Although a bit disappointed with the flavors, i get the cozy neighborhood vibe. They're welcoming and the staff is obviously a hard working bunch.", "rating": 3, "date": "2013-11-24"}, {"excerpts": ["It comes with freshly fried chicken, bean sprouts, corn and a bit of ginger.  ", "I love it.  ", "It's great on a nice cold day.  ", "I'm not sure how else to describe it.  ", "The broth is spicy but not so spicy that it'll make you cry.  ", "It's at the perfect level of spiciness.  ", "However, the spicy ramen here is spicier than most other ramen places that I've tried.  ", "It's a great kick if you love spicy food that won't kill you."], "author": "Shirley T.", "review": "This place is such a hole-in-the-wall that I never noticed it until I yelped for ramen in San Francisco. The inside is as small as it looks on the outside but the unique thing about this place is that everything is about The Beatles and the 60s.  It's just way too funny.  It's just not very expected when you walk into a ramen place.  Oh, and NO sushi.  Halu makes it very clear before you walk into the door that it's not a sushi place.  They only serve yakitori and ramen.  \n\nLet me say that I think Halu serves the best spicy karage ramen.  It comes with freshly fried chicken, bean sprouts, corn and a bit of ginger.  I love it.  It's great on a nice cold day.  I'm not sure how else to describe it.  The broth is spicy but not so spicy that it'll make you cry.  It's at the perfect level of spiciness.  However, the spicy ramen here is spicier than most other ramen places that I've tried.  It's a great kick if you love spicy food that won't kill you.", "rating": 4, "date": "2010-11-18"}, {"excerpts": ["The Chasu Ramen has tender Chasu with bean sprouts, corn and a porky flavor broth. ", "While on teh other hand the Karaage Ramen contains very flavorful Chiken Kaarage that is fried to perfection, not too oily and not overly fried. "], "author": "Jonathan W.", "review": "There are days where I want nothing but a nice hot bowl of noodles, whether it be Ramen, Pho, Udon, Soba or Mein. One thing to noe about me is  I am always down for soup and noodles. Today was one of those days, it was cold and rainy and nothing would make me feel better than sipping hot broth and slurping down some yummy noodles!  \n\nI have been to Halu a few times now and have tried their Ramen and Okonomiyaki. The Chasu Ramen has tender Chasu with bean sprouts, corn and a porky flavor broth. While on teh other hand the Karaage Ramen contains very flavorful Chiken Kaarage that is fried to perfection, not too oily and not overly fried. The broth is a bit richer than the Chasu Ramen broth but it is equally as good. \n\nhttp://static1.px.yelpcdn.com/bphoto/LE4E4-KNbSrZnIfXGs7hMw/\n\nWhile I was finishing up my Ramen the waitress popped up over the menu's which were right next to me since we were seated at the bar and nearly scared the crap outta me. In a kawaii koe she said \"Ramen no Aji wa doudesu ka \" wit a big smile. I replied Oishii since i was hella caught off guard :X. She then replied \"ii desu ne\" and went back to doing her work. Couldn't figure out if she was being nice or flirty! Shurgs\n\nI finally tried their Okonomiyaki, My friend and I got the Beef and Veggie Oknonomiyaki. http://static1.px.yelpcdn.com/bphoto/Bo2Eg8oc8zLFcM9HgyApZQ/l\n\nit was a work of art! Amazing, it was crisp and had a small crunch with every bite and I felt that the flavor was the best i have had. it had a homestyle taste to it and it was not masked by salt of richness. I will have to come back to check out their specialties which are grilled food! \n\nThe decor is pretty awesome i might add, they have alot of old skool vintage items, and they have Beatles memorabilia everywhere. This place looks like its a part of someones home but thats what makes it cool. It does however have limited seating and a bar area in the front. I feel right at home eating here.", "rating": 4, "date": "2010-04-03"}, {"excerpts": ["then the garlic flavor started overpowering the soup and it also started to get too salty)\n\nChasu-Ramen - roast pork with corn, Ginger, egg, bean sprouts, and green onion $9.5 (didn't really like the broth; salty as well)"], "author": "jesiree b.", "review": "Stumbled upon this place while yelping for some Ramen on a cold night. Once we walked, we noticed the place was super small - bumps, bruises, and spills...oh my!  We couldn't even really open the door to enter because it was pushing on a seated customer in the way. I felt so bad.  It's even a challenge to get into the bathroom because it was so tight lol!  \n\nYou'll also notice the rock & roll decor that goes well with music they were playing. They had a bunch of Beatles memorabilia as well - i guess they're big fans.  I must say, a very unique place!  Our waitress was friendly and knew how to get along with customers very well. \n\nHalu is a \"sushi free\" zone!  They have a good assortment of Yakatori and also a \"Halu's Special Menu\" which you'll find on the wall.  Our small dishes came out pretty quick but it felt like the Ramen took awhile to come out.  Didn't thnk it would take THAT long - good thing \"Spirited Away\" playing on the the tv kept us busy.  \n\nI'll definately come back here to try more Yakitori and Kushikatsu.  I'm new to this Yakatoriness and think that its a little pricey for such such small, simple dishes (i.e., cherry tomatoes wrapped with bacon) - I guess you pay for the experience, which I don't mind...sometimes.  I probably won't come back for the Ramen though.  I came here with my boyfriend and a friend and we all got Ramen - each one of us complained that it started to get waaayy too salty!  Talk about risk for heart attack and dehydration!!\n\nOUR ORDERS...\n\nYaki Onigiri - grilled rice ball mixed w/ salmon & bonito flake with light soy sauce $5 (smelt burnt; tasty but not my fav)\n\nKushikatsu Stuffed Mushrooms - covered with crispy panko breaded w/ minced scallionson on top; came with Tonkatsu Sauce and Hot Mustard; 2 skewers for $4.75 (omg so good - best part of the night for me; mouth watering, w/ a surprising lemony juice flavor; don't really knew what it's stuffed with but I'd get it again)\n\nYakitori - scallop bacon 2sk/$5 (2 pieces on ea skewer;salty but hey...it's bacon!; scallops were good)\n\nCorn Butter Ramen - chasu, veggie, extra corn $10.5 and $0.50 extra for fresh grated garlic (lots to mix so mix well; broth was a great taste at first then the garlic flavor started overpowering the soup and it also started to get too salty)\n\nChasu-Ramen - roast pork with corn, Ginger, egg, bean sprouts, and green onion $9.5 (didn't really like the broth; salty as well)", "rating": 3, "date": "2010-03-10"}, {"excerpts": ["There was also no seaweed; i thought seaweed was a staple however the bean sprouts were a welcome addition.  ", "However, the broth was good, savory and not too salty.  ", "The food was average and the wait long, however, the waitresses were very outgoing.  ", "In addition, this cramped hole deserves a visit; the ambiance is unique and one of a kind and I will be back to try their specialty, the yakitori.  "], "author": "Brian V.", "review": "After playing basketball with a North Korean defector and brother (his volte-face act of political shift came first before I ultimately embraced him into the circle of trust), we left the gym completely exhausted, cold and ready to gormandize on burritos.  However, our minds changed upon walking out and being greeted by the rain.  Usually when its a cold day, social norm calls for a variation of soup, pho usually.  However, having recently tapped into the dish called ramen, I opted for that.  We drove to Izakaya Sozai, our initial choice, however, were crestfallen to learn that it was closed on that particular day.  Changing my search parameters on my yelp application, Halu had the next best rating.\n\nThis place is tiny and cozy, a true hole in the wall.  However, imagine this hole in the wall completely adorned with Beatles memorabilia.  Posters are hung and there are many books and booblehead variants of the Liverpool quartet; Beatles music softly serves as the soundtrack for your impending meal.   From reading previous yelp reviews, it seemed that wait would be a while, however, we came around 9:30 pm, and while the restaurant was jam packed, the waitress quickly had us seated at the makeshift bar.  Service was very slow as the waitresses took forever to give us water and even longer to take our order.  This seemed to be a reoccurring theme as I saw many patrons tap their nails impatiently on the table.  However, the waitresses were neither standoffish nor pretentious, offering a kind word of patience or chatting us up.  I ordered the chasu-men and a side of agadashi tofu while hahnjob ordered the special spicy ramen.\n\nMy tofu took about 20 minutes to get to us while our ramen took abou 40.  The tofu was good, fried just right and served in a bowl of some sauce.  I don't know exactly what it is...a variation of soy/ponzu....but it was delicious.  I prefer a little crispier tofu but all in all, this was a solid dish.  My ramen, however, was very average.  After eating Himiwari's ramen with pork belly, I can't go back to eating the pieces of chasu.  They are good pieces of pork, however, not as flavorful as the pork belly.  The noodles did not stand out at all.  They tasted eerily similar to the instant ramen noodles.  They were a bit too hard.  Himiwari also ruined my egg experience; I can no longer eat tea eggs with my ramen.  I prefer the boiled ones where the insides are still goeey and mix with the soup base once broken.  Scooping up corn pieces were scarce and I was amazed when my spoon finally ensnared one.  There was also no seaweed; i thought seaweed was a staple however the bean sprouts were a welcome addition.  However, the broth was good, savory and not too salty.  The food was average and the wait long, however, the waitresses were very outgoing.  In addition, this cramped hole deserves a visit; the ambiance is unique and one of a kind and I will be back to try their specialty, the yakitori.  Maybe ramen just isn't their forte.\n\nOb-la-di, ob-la-da, life goes on, brah!...\nLala how the life goes on.", "rating": 3, "date": "2011-03-06"}, {"excerpts": ["Meager amounts of bean sprouts. ", "feeling like I am just having starch and protein.\n-- all of the skewers are probably not grilled under high enough heat. ", "I love it when the bacon wrapping the asparagus becomes almost a crispy layer of the asparagus. "], "author": "Rebecca C.", "review": "the food was mediocre\n\n-- Spicy chasu ramen didn't have enough other ingredients than pork and half an egg. Meager amounts of bean sprouts. feeling like I am just having starch and protein.\n-- all of the skewers are probably not grilled under high enough heat. I love it when the bacon wrapping the asparagus becomes almost a crispy layer of the asparagus. Here the bacon is chewy and fatty around the bacon. \n\nService was horrible\n\n-- they first told us that chicken skin and shishito pepper were sold out. This is saturday night around 8.30pm -- height of dinner time during the weekend and completely sold out\n-- the food came quite late.\n-- they brought 4 out of 7 skewers that we ordered. When finishing, I asked one waitress to check on the other skewers.\n-- Few minutes later, the other waitress came with the bill, without mentioning anything. When i ask her if everything was served, she went back to check. Then she brought the check with everything we ordered, and I told her that we are still missing 3 skewers, she went back to the kitchen and informed us that gingo nuts and chicken gizzards are out as well, and crossed out the items on the bill. This is done after 3 times of prompting them that something needs to be adjusted.\n-- the waitresses were running around in this small space, knocking my elbow twice on the table, one spilled a whole stack of dishes. what a disaster.\n\nThis restaurant needs to have a process to keep better track of things ordered, served, available to be served, rather than running around aimlessly like chicken with heads cut off!", "rating": 2, "date": "2012-04-01"}, {"excerpts": ["The ramen, which consists of corn, ginger, bean sprouts, green onions and uber tender fried chicken, was so thick and rich, a slight film would form on top if you let it sit too long. ", "Kind of gross, but it tasted good. "], "author": "Sam L.", "review": "I am forever on the hunt for the best ramen in the Bay Area and I have yet to find one that tops Tenkaippin in Honolulu. In my years of searching, I've found Halu to be one of the better ramen spots in San Francisco. Decorated in Beatles paraphernalia and cycling through every Beatles album ever made on the speakers, the family-owned business hit a jackpot with the Beatlemania-themed restaurant.\n\nWhen I recommend this restaurant (with a seating capacity of about 20 people) to other ramen connoisseurs, I always tell them to go when you're not hungry because you will wait for your food. It took 25 minutes to get our 2 orders of the Kara Age (fried chicken) ramen ($10 each) and an order of the buttered mochi wrapped in nori (seaweed) ($6.50).\n\nThe mochi was seasoned with a buttery soy sauce, grilled until it's warm and chewy, then wrapped in seaweed before serving. The appetizer is definitely my favorite of the night. The ramen, which consists of corn, ginger, bean sprouts, green onions and uber tender fried chicken, was so thick and rich, a slight film would form on top if you let it sit too long. Kind of gross, but it tasted good. I have an appreciation for hand-made noodles, and I'm almost positive Halu uses packaged noodles, which is disappointing.\n\nOn my next venture to Halu, I'll try the yakatori (skewers). It's supposedly their specialty, but I can't bring myself to pay $5 for 3 tiny little skewers. In the meantime, Halu will remain my close substitute for ramen until my next trip to Hawaii.", "rating": 4, "date": "2010-01-11"}, {"excerpts": ["the soft boiled egg, the bamboo shoots, bean sprouts, corn, the \"al dente\" style noodles all contributed to a yummy ramen experience. "], "author": "elsie k.", "review": "my friend was craving ramen so we decided to try this place. it's a really small, cute restaurant near my house. i liked the coziness and the staff was super friendly.\n\nwhen it comes to ramen, this isn't the best spot in the city (katana-ya is my fav). but so far, this is the best that i've found in the richmond. i'm no ramen expert but i have to say that the ramen was pretty authentic, better than genki ramen. i had the chashu-men and i can see how some may think the broth is too salty but i love overly salty things so i didn't think it was too much. the soft boiled egg, the bamboo shoots, bean sprouts, corn, the \"al dente\" style noodles all contributed to a yummy ramen experience. the portion you get is pretty substantial too.\n\nwe also got a large sapporo in a can. it was ginormous and great for sharing!\n\nand if you love guitars, make sure to visit the bathroom.", "rating": 4, "date": "2009-06-03"}, {"excerpts": ["The fried chicken was crispy and juicy and accompanied the bean sprouts and green onions in the ramen. ", "We also ordered various yakitori (pork jowl, gizzards and chicken skin) which were good but salty. ", "We ordered a beer to go with the yakitori and it was a perfect combination. ", "Cute place but will probably only go if I'm ever in the neighborhood."], "author": "gail c.", "review": "Little hole in the wall restaurant we found on a list of Best Ramen in the City. Small seating and slow service due to Mom doing the cooking while the daughters provide the service but very charming. Chicken Kaarage Ramen was yummy. The noodles are thinner than what I'm used to but a nice bite. The fried chicken was crispy and juicy and accompanied the bean sprouts and green onions in the ramen. We also ordered various yakitori (pork jowl, gizzards and chicken skin) which were good but salty. We ordered a beer to go with the yakitori and it was a perfect combination. Cute place but will probably only go if I'm ever in the neighborhood.", "rating": 4, "date": "2010-08-05"}], "nori seaweed": [], "kaedama": []}