{"frisco club sandwich": [], "blt sandwich": [{"excerpts": ["Got the Frisco BLT sandwich and it is great. ", "The lady behind the counter helped me make.the right choice"], "author": "William C.", "review": "Get to the city, hungry and all of the sudden you find the perfect deli. As you walk in you can smell the rosemary chicken and fresh salsa. Got the Frisco BLT sandwich and it is great. The lady behind the counter helped me make.the right choice", "rating": 5, "date": "2017-11-25"}], "totally albacore sandwich": [], "veggie club sandwich": [], "chicken delight sandwich": [], "reuben sandwich": [{"excerpts": ["Delicious reuben sandwich with lot of mayo/mustard (if you are into it). ", "Loved my lunch and will be back again."], "author": "Mayank S.", "review": "This was my second order at Handy Deli and ordered ahead through yelp. Very seamless process, when I arrived my sandwich was just getting wrapped up. Took the sandwich and was out within a minute. As fast as it gets!\nDelicious reuben sandwich with lot of mayo/mustard (if you are into it). Loved my lunch and will be back again.", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["love going to Handy to get their Reuben sandwich!  ", "I love the Hunter's Club (rare roast beef, lettuce, tomato, onion, mayo, mustard) -- "], "author": "Jenn T.", "review": "I have to apologize to Jerry and his wife Leila-- the owners of Handy Deli, for taking such a LONG TIME to write this review!( I should have written it a year ago!)\n\nHandy Deli serves up some of the best quality sandwiches and hot food in the Sunset.  I work across the street and frequent Handy Deli almost once a week.  The service is EXTREMELY and GENUINELY friendly!  Jerry, his wife, Leila, their boys, Mohammed, are some of the sweetest and nicest people you'll ever meet!\n\n\nOrder their daily roast chicken plate.  Such a deal for the quality and quantity that you get! Their roast chicken is hot, flavorful, juicy, and tender!  It falls off the bone and goes great with their yummy rice (or roast potatoes), AND a generous side salad!  Lots of times (so I don't have to cook!) I would buy a couple of plates to take home for dinner.  They have other specials ( check their menu)-- \"Thanksgiving Tuesday\" (as I like to call it)-- slices of turkey with gravy and mashed potatoes, chicken cacciatore, pulled pork, meatballs, ... ALL YUM!!!!\n\n\nTheir sandwiches are equally yummy! Fresh and made to order!  My colleagues and ( even my own parents!) love going to Handy to get their Reuben sandwich!  I love the Hunter's Club (rare roast beef, lettuce, tomato, onion, mayo, mustard) -- Again... YUM!!!\n\n\nNow, the other reason why I wanted to write this very belated review-- Handy Deli also CATERS!  Last year, I was hunting around for a caterer for my son's 1st birthday-- instead of going to a restaurant. I inquired with Jerry on a whim, and my husband and I are sooo glad that we did!  We went with Jerry and he did NOT disappoint!  He worked  and stayed within our budget, gave a variety of menu items to choose from.   And on the day of our son's party, he AND his wife, Leila, catered the whole event BY THEMSELVES.  They arrived at the venue promptly, prepped all of the food, served and cleaned up everything!  And poor Jerry is so accommodating and flexible-- there was another event that \"shared\" the venue's kitchen ( we weren't informed of this) and he worked around them.\n\nGuests were served Handy's roast chicken and pulled pork, rice pilaf, roast potatoes, and roasted vegetables.\n\nALL of our guests raved about how DELICIOUS and plentiful the food was!!!\n\n\nYou cannot go wrong with HANDY!  Consider them to cater your next event, or if you are planning to go out for a picnic in the park, or to the ball park... call in an order for a couple of hot plates or freshly made sandwiches!  YOU CANNOT GO WRONG!!!\n\n=)", "rating": 5, "date": "2015-06-12"}], "hunters club sandwich": [], "new cubano sandwich": [], "handy salad": [{"excerpts": ["Everything on the deli menu is delicious but the Handy salad is amazing and big enough to be a meal. ", "The salads and sandwiches are big and totally good value for the price. ", "Jerry and staff are all super friendly and take pride in their food. ", "Best deli yummies in SF!"], "author": "Marisa L.", "review": "Everything on the deli menu is delicious but the Handy salad is amazing and big enough to be a meal. The salads and sandwiches are big and totally good value for the price. Jerry and staff are all super friendly and take pride in their food. Best deli yummies in SF!", "rating": 5, "date": "2015-11-07"}], "greco salad": [], "chicken cardini club": [{"excerpts": ["The food that they make is super delicious (Turkey Lulu and Chicken Cardini Club Rock my wolkd). ", "Their beer selection always has something new and great for me to try, and their entire staff is the best!"], "author": "Tim S.", "review": "Okay so I've now been a regular here for years. It's still amazing. The food that they make is super delicious (Turkey Lulu and Chicken Cardini Club Rock my wolkd). Their beer selection always has something new and great for me to try, and their entire staff is the best!", "rating": 5, "date": "2015-06-15"}], "chicken shawarma sandwich": [{"excerpts": ["A chicken shawarma sandwich, for example, was a gigantic helping of marinated shredded chicken and was complemented richly and deliciously with hummus, tomatoes, cucumbers, pickles, and tahini sauce. ", "It's so big, in fact, that half of it is satisfying enough for a meal. ", "You can refrigerate and save the other half for later. "], "author": "Vincent L.", "review": "A solid neighborhood deli and convenience store with a huge array of offerings.\n\nAs for the store portion, they've got a huge selection of drinks and packaged foods for all your last-minute boozin' and partyin' needs. As for the deli, not only do they offer meats and cheeses by the quarter pound, but they also make quality cold and hot sandwiches on demand.\n\nA chicken shawarma sandwich, for example, was a gigantic helping of marinated shredded chicken and was complemented richly and deliciously with hummus, tomatoes, cucumbers, pickles, and tahini sauce. It's so big, in fact, that half of it is satisfying enough for a meal. You can refrigerate and save the other half for later. Given the portion size and overall quality, the prices are quite decent.\n\nThe folks here are super friendly too. Although they take their time preparing orders, you at least know that they're not being sloppy or cutting corners in any way (say, when it comes to health standards or when it comes to simply making a quality sandwich). Highly recommended!", "rating": 5, "date": "2017-05-08"}, {"excerpts": ["Ordered a chicken shawarma sandwich and I'm thinking dreaming of it three days later..."], "author": "Crystal L.", "review": "Ordered a chicken shawarma sandwich and I'm thinking dreaming of it three days later...", "rating": 5, "date": "2015-04-18"}], "falafel supreme sandwich": [], "turkey lulu sandwich": [{"excerpts": ["I had the Turkey Lulu sandwich (turkey roasted in house, and the walnut pesto is incredible) and everything about it was perfect and not fattening ;o). ", "My boyfriend had the Bistro sandwich (basically a cheese steak with all fresh or homemade ingredients including the beef being roasted in house!!!!!) ", "and it was so delicious.  ", "It was our first of many visits to this place. "], "author": "Sarah S.", "review": "Damn, this place is the bomb.com.  Jerry is awesome and you can taste his passion for great food. Everything is homemade and amazing. I had the Turkey Lulu sandwich (turkey roasted in house, and the walnut pesto is incredible) and everything about it was perfect and not fattening ;o). My boyfriend had the Bistro sandwich (basically a cheese steak with all fresh or homemade ingredients including the beef being roasted in house!!!!!) and it was so delicious.  It was our first of many visits to this place. We will definitely become regulars.  \n\nPS: great beer, wine and liquor selection too.", "rating": 5, "date": "2014-09-02"}, {"excerpts": ["So after dropping in (without any solid intention of actually getting anything), Ieft with:\n\n- 4 pack Milk Stout\n- Turkey Lulu sandwich\n- pack of Nat Sherms\n\nTotal: $22.90\n\n"], "author": "Ericaceae S.", "review": "This place is amazing. I thought I was going to hangout with friends tonight, so I looked up place with good beer prices on yelp. Long story short, when i was on my way, plans canceled. I decided to check it out anyway, and man was I impressed! The beer, liquor and wine selections are extensive and at great prices to boot! I picked up a 4 pack of \"Milk Stout\" by Widmer Brothers Brewing Co (which I had never tried).\n\nThe deli aspect of the store is about as legit as it gets. The sauces and meats are made there and are high quality. No canned anything involved! Everyday of the week they have a different fresh specialty (e.g. roasted turkey with mushroom gravy, home made  meatballs, clam chowder, etc). Most of their sandwiches are $7 for a full size and worth every penny. I ordered the \"Turkey Lulu\" and it was incredibly tasty.\n\nAs if quality products and great prices weren't enough to keep me coming back, the customer service was EXCELLENT. While I was waiting for my sandwich I had a great conversation with the owner, who is evidently passionate about what he does.\n\nIt's also worth mentioning that they carry my favorite cigarettes (Nat Sherman MCDs) which are not always easy to find (let alone at a decent price).\n\nSo after dropping in (without any solid intention of actually getting anything), Ieft with:\n\n- 4 pack Milk Stout\n- Turkey Lulu sandwich\n- pack of Nat Sherms\n\nTotal: $22.90\n\nThis place is a new favorite. I will definitely be back.", "rating": 5, "date": "2013-07-15"}], "beef shawarma wrap": [], "bistro cheese steak sandwich": [], "sunset blue sandwich": [], "north beach sandwich": [], "the classic breakfast": [], "morning power": [], "sunrise wrap": [], "el dorado": [], "skinny": [{"excerpts": ["Highly recommended the \"skinny,\" it's my favorite sandwich and always hits the spot."], "author": "Tyson R.", "review": "Best deli I've been to in the city. Delicious sandwiches prepared right in front of you. Speedy service. Friendly staff. This is the first place I take friends for a quick meal, especially when we're trying to fight off a hangover. Highly recommended the \"skinny,\" it's my favorite sandwich and always hits the spot.", "rating": 5, "date": "2015-10-03"}, {"excerpts": ["Also, they have Skinny Girl Margarita! ", "The only store in the entire Sunset district to carry it! ", "I bought a bottle of Skinny Girl Margarita today and asked the Owners (nice young couple) to help me get a small bottle of tequila because the Skinny Girl was not strong enough, that's why it's skinny ;) ", "The husband offered a nice bottle of tequila ", "but it was above my price range. ", "Then he offered a larger bottle of similar price but if I keep a large bottle, I will drink too much. ", "The wife picked up on that! ", "She said maybe it's better to have a little ", "so it's not around. ", "Yes! ", "Great people, they really will accommodate you. ", "The husband then found the perfect little bottle for me. "], "author": "Yasmin E.", "review": "I have been going to Handy Delicatessen occasionally for a number of years and every time I stop by the owners and staff are warm and welcoming. I feel I am among family there. They are very knowledgeable and accommodating. \n\nOne day I was digging through the refrigerated cheese and packaged meat case and the young man who works there asked me if he could help. I told him I was looking for sliced American cheese. He looked for me and we both came to the conclusion that they where out. He then said I can buy freshly sliced American cheese from the deli counter. I am so glad I accepted his offer. The cheese was incredible and much better than the typical packaged cheese. Plus it was a decent price. I believe I paid about $5.00 for a lb. and at Safeway they charge $7.00. \n\nThey have an incredible selection of beer, Allagash being my favorite. Also, they have Skinny Girl Margarita! The only store in the entire Sunset district to carry it! The owner will brag about it, but that only means he is very proud of his business and he cares to please his customers. \n\nThis will continue to be my go-to spot. I do support the other stores nearby, but if I buy too much alcohol I feel they judge me. Not Handy Deli! I bought a bottle of Skinny Girl Margarita today and asked the Owners (nice young couple) to help me get a small bottle of tequila because the Skinny Girl was not strong enough, that's why it's skinny ;) The husband offered a nice bottle of tequila but it was above my price range. Then he offered a larger bottle of similar price but if I keep a large bottle, I will drink too much. The wife picked up on that! She said maybe it's better to have a little so it's not around. Yes! Great people, they really will accommodate you. The husband then found the perfect little bottle for me. Sold! \n\nEverything is right on spot here, I don't know why I would go anywhere else.", "rating": 5, "date": "2011-06-03"}], "nova": [], "basilico": [], "denver": [], "stylish": [], "serious": [{"excerpts": ["I tried one of the breakfast menu sandwiches and it was a hit (it's called Serious) ", "and I can't wait to try the rest of the menu !!"], "author": "Lulu R.", "review": "This deli has the best quality as a 5 star caffe !! They make everything from scratch!! Their home made hummus is top notch and don't forget to try their pesto  I tried one of the breakfast menu sandwiches and it was a hit (it's called Serious) and I can't wait to try the rest of the menu !!", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["I was hankering for a shawerma yesterday and spent some serious time doing research on Yelp.  ", "After way more time than I care to admit, I got off the N-Judah on 19th Ave. ", "with the intention of going to another deli close by for one, but then the hand-painted sign for Handy, a sign that I have seen hundreds of times in the past, made me curious about exactly what this place, seemingly more liquor store than deli, has to offer me.  ", "So I started looking at their online menu on the sidewalk, braving the strong wind that is blowing my hair willy-nilly.  ", "But, lo and behold, they actually offer chicken shawerma!  ", "They also have a slew of loyal regular customers, to read their reviews.  ", "So, in I went.  ", "While waiting for my food, I had a chance to look around and noticed that they have quite a selection of whisky, including a variety of Japanese ones.  "], "author": "Yvette F.", "review": "I was hankering for a shawerma yesterday and spent some serious time doing research on Yelp.  After way more time than I care to admit, I got off the N-Judah on 19th Ave. with the intention of going to another deli close by for one, but then the hand-painted sign for Handy, a sign that I have seen hundreds of times in the past, made me curious about exactly what this place, seemingly more liquor store than deli, has to offer me.  So I started looking at their online menu on the sidewalk, braving the strong wind that is blowing my hair willy-nilly.  But, lo and behold, they actually offer chicken shawerma!  They also have a slew of loyal regular customers, to read their reviews.  So, in I went.  While waiting for my food, I had a chance to look around and noticed that they have quite a selection of whisky, including a variety of Japanese ones.  Interesting...\n\nAnyway, back to the food, that ended up being my dinner and it was delicious!!  The wrap was perfectly creamy from the mix of tahini and hummus.  It included pickle logs, cubes of cucumbers and tomatoes and chunks of moist and tasty chicken. The lavash was toasted beforehand.  The portion was very generous and I was only able to finish half of it.  I ate the other half for breakfast this morning and enjoyed it just the same.  I liked it so much I'm already planning on when to return and what else to order next time!", "rating": 5, "date": "2016-08-11"}], "jericho": [], "meat ball sandwich": [], "meat ball plate": [], "soup of the day": [], "roasted veggies": [{"excerpts": ["They recently added hand made sandwiches but my favorite is their roast chicken w/ jasmine rice and roasted veggies or salad.  ", "The chicken is juicy, the rice fluffy, and the vegetables tender and buttery.  ", "There is love in that food!  ", "I live down the street", ", it's about the best corner store deli I've seen."], "author": "Will B.", "review": "Sixers of Trumer are $5.99 +tax, need I say more?  Ok fine, I will.  You can find great prices for just about anything alcoholic and snack related here.  The owner Jerry is a great guy, always friendly, always interested in feedback about his place.  They recently added hand made sandwiches but my favorite is their roast chicken w/ jasmine rice and roasted veggies or salad.  The chicken is juicy, the rice fluffy, and the vegetables tender and buttery.  There is love in that food!  I live down the street, it's about the best corner store deli I've seen.", "rating": 5, "date": "2013-07-11"}], "turkey plate": [], "chicken shawarma plate": [], "chicken cacciatore plate": [], "roasted pork plate": [], "pork lovers sandwich": [{"excerpts": ["Their weekly special pork lovers sandwich is exceptional, I encourage this reader to try it.  ", "You'll likely be dreaming of it that night and wanting it again the following week.  ", "The owner and wife team treat you like royalty."], "author": "Leslie F.", "review": "Their sandwiches are amongst the best I've ever had.  Their weekly special pork lovers sandwich is exceptional, I encourage this reader to try it.  You'll likely be dreaming of it that night and wanting it again the following week.  The owner and wife team treat you like royalty.", "rating": 5, "date": "2015-06-08"}], "lamb shawarma plate": [], "action salad": [], "east coast plate": [], "beef kabob plate": [], "diparma sandwich": [], "bugzy sandwich": [], "fat pete": [], "muffaletta": [], "chicken parmesan": [], "oh marie": [], "valdostana": [], "godfather": [], "bella vista": [], "bravo": [{"excerpts": ["My girlfriend got the bravo sandwich and that looked amazing too. ", "I would've have ate her food too ", "but the wrap had me stuffed! ", "I'm definitely going to visit again"], "author": "Alvin T.", "review": "Hands down one of the best falafel/shwarma wraps I've ever had! I went in about a week ago and ordered a chicken shwarma with falafel. When the wrap came out, it was the size of a stick of dynamite! The explosion of flavors made it taste like one too. The family who owns and runs the store is hilarious and very kind. The atmosphere is very warm and welcoming. My girlfriend got the bravo sandwich and that looked amazing too. I would've have ate her food too but the wrap had me stuffed! I'm definitely going to visit again", "rating": 5, "date": "2018-09-24"}], "oz soda": [], "water": [{"excerpts": ["Nabbed me a vitamin water to wash down number 1 on the menu. ", "I forgot what the name of the sandwich was ", "but, it involved chicken and bacon. ", "He kept telling me that everything they serve there was made by them. ", "I took that as: nothing there is frozen bs food. ", "Okay. ", "I ate the sandwich. ", "Yo, that sub is in my top two fav sandwiches, along with the Manhattan sandwich from Alondra Hot Wings. "], "author": "Mike C.", "review": "I bussed it from LA for a 1 day hike adventure. Stopped here after I saw how near it was from where I was when I checked in to yelp. Given that I was super exhausted from all the hiking I did, this place was super convenient for me -- and I'm glad it was too. \n\nThe main dude was really nice. Hooked it up with a free drink since I was new to the Deli and the city. Nabbed me a vitamin water to wash down number 1 on the menu. I forgot what the name of the sandwich was but, it involved chicken and bacon. He kept telling me that everything they serve there was made by them. I took that as: nothing there is frozen bs food. Okay. I ate the sandwich. Yo, that sub is in my top two fav sandwiches, along with the Manhattan sandwich from Alondra Hot Wings. You gotta stop here. \n\nNow, if you're going to eat there, I gotta tell you that there is only two coop tables available. Not a family friendly type thing; unless, you take it to go. \n\nCheck the spot out.", "rating": 5, "date": "2015-03-31"}], "specialty drinks": [{"excerpts": ["The selection is also great, including hard-to-find specialty drinks, imported candy, and all your favorite spirits and wines. ", "Rate$ are a tad high, but hey -- that's the price you pay for convenience at any liquor store. ", "We recently re-visited the place and it's only gotten better post-remodeling. ", "If only Handy would open up another location in my 'hood..!"], "author": "Julie D.", "review": "One of the worst things about my boyfriend's move out of the Sunset was that we lost access to a place like Handy's. This deli is so rad. The people are super sweet and friendly, yet able to deal with the characters that sometimes wander through their doors. They can also make a mean sandwich. The selection is also great, including hard-to-find specialty drinks, imported candy, and all your favorite spirits and wines. Rate$ are a tad high, but hey -- that's the price you pay for convenience at any liquor store. We recently re-visited the place and it's only gotten better post-remodeling. If only Handy would open up another location in my 'hood..!", "rating": 5, "date": "2013-07-24"}], "walnut baklava": [], "pistachio baklava": [], "halva": [], "borma pistachio": [], "turkish delight": [], "chips  small": [], "chips  large": []}