{"scramble  eggs": [], "pancakes": [{"excerpts": ["We had 2 bacon egg and cheese and pancakes.... "], "author": "Al L.", "review": "Well, we were in the area for Plow, and after waiting for 1 hour we walked to Hazel's, and boy where we glad we did! \n\nWe had 2 bacon egg and cheese and pancakes.... the sandwiches were perfect.... with a good amount of bacon....and eggs cooked to order, super! \n\nWe also had the pancake...... his exact words, \"There are very light\" and enjoyed them very much.... \"no butter needed\".. \n\nGreat job Hazel.... draw back.... seating..... can you create more seating.... then you can have the last star.....", "rating": 4, "date": "2017-10-22"}, {"excerpts": ["My niece got pancakes and eggs, she devoured it in about 5 minutes. ", "My boyfriend got the chicken melt, I had a bit and it was perfect!"], "author": "Solmayra M.", "review": "The food here is great! Staff was friendly and attentive. It's a very small comforting dinning place and we got there just in time to sit in there. I got the egg scrambler  (asked for egg whites only) they accommodated :) \nMy sister got the breakfast burrito, she said it was amazing! My niece got pancakes and eggs, she devoured it in about 5 minutes. My boyfriend got the chicken melt, I had a bit and it was perfect!", "rating": 5, "date": "2017-01-14"}, {"excerpts": ["PANCAKES WITH EGG AND BACON ($6.95) - ", "Pancakes were typical. ", "Actually, tasted like air and had to put more syrup then I like to get some kind of flavor. ", "Nothing special about the eggs. ", "Bacon, i love center cut bacon. ", "They served center cut bacon - like 8 pieces of bacon ", "but they were very tiny, fragile, and crispy. ", "Would really amount to 3 full juice bacon in real measurements. ", "yup, one of those rare occasions where I'm consuming meat/pork. ", "I figured the deli was almost like a drive-by window, decided to get my food \"to-go\" because it'll just be another mess trying to get a to-go box later. ", "all my food was just piled onto each other. ", "Seriously? ", "You couldn't separate them? "], "author": "Jane A.", "review": "The LOGISTICS suck.\n(2 stars)\n\nFelt like a drive-by deli. Order food here, order coffee there, pick food up where and when? sit where? Did i order the wrong thing? I don't understand the average 4-star rating for this place. Tempted not to write a review because I have no words for my experience, I'm literally searching for something to say. AH!!! This \"confused\" person does have something to say. One cook in a tiny kitchen, that's the only thing I couldn't hate on.\n\n- Food, I've had better\n- Prices, average\n- Service, ? \n- Ambiance, no seating except outside \n\nAfter my run Sunday morning, I was craving breakfast. Landed here.\n\nObservation\n- no seating inside. \n- No coffee/espresso on the menu? Was suggested I am welcome to order coffee next door. \n- Order my food (no number, no nothing, so how will i know its ready and if that's my order). Get coffee next door at Farley's (i passed). \n-Sit at a (dirty) table leaning on a slope (damn SF hills). \n- Pick up my own food asking \"is that my order?\" every few minutes. Eat my food in the cold and on a slope. \n\nHEFFER-STYLE STATUS.\n\nWATERMELON JUICE (~$2) - it was fresh and I liked it. \n\nPANCAKES WITH EGG AND BACON ($6.95) - Pancakes were typical. Actually, tasted like air and had to put more syrup then I like to get some kind of flavor. Nothing special about the eggs. Bacon, i love center cut bacon. They served center cut bacon - like 8 pieces of bacon but they were very tiny, fragile, and crispy. Would really amount to 3 full juice bacon in real measurements. yup, one of those rare occasions where I'm consuming meat/pork. I figured the deli was almost like a drive-by window, decided to get my food \"to-go\" because it'll just be another mess trying to get a to-go box later. all my food was just piled onto each other. Seriously? You couldn't separate them? I had to rearrange my food before eating it. \n\nMAYBE i should have ordered a sandwich, that's what everyone's yelping about. After my experience, i said to myself \"what a waste of a Sunday breakfast. I would have been better off eating at home saving money\".\n\nWill I be back? Maybe for glass of watermelon juice.", "rating": 2, "date": "2012-02-06"}, {"excerpts": ["I've never tried the pancakes, waffles, or the breakfast burrito, so I cannot speak to those items.\n\n"], "author": "Reena R.", "review": "Pretty hit or miss lunch and quick breakfast spot, but overall more hits than misses. The sandwiches are the mainstay of this place.  I've had the pastrami, the John's Special, and the tofu with sauteed vegetables: all were heaping with ingredients (a little sloppy but truly a bang for your buck, especially if you order the half sandwich for 5.25). These are all daily specials, and to mimic what an earlier reviewer said, you can't go wrong with them. The other day I ordered a sandwich from the regular menu and it was a disaster..I ordered the BLTA and there were all of 3 pieces of bacon in the entire sandwich. A very sad thing to behold.\n\n\nTheir soups are so-so; Ive only had the vegetarian chili and was not that impressed.\nTheir salads are actually quite good; I've had the chicken Caesar (the dressing was good but maybe overly garlicky in my opinion) and a few others..but I don't order them nearly as much as I had in the past since they remodeled last year (now the salads are not really displayed well, so they never catch my eye anymore).\n\nAs for breakfast...their oatmeal is by far the best deal, and probably best tasting thing I've had for breakfast there. Their bagels are only okay and compared to the cafe by my house, they are overpriced...This morning I ordered the granola, fresh fruit and yogurt for the first time. I guess it was a mistake. I mean, who puts honeydew and watermelon with their morning yogurt??? Those watery fruits don't really go well with dairy or grains in my opinion. There were a few strawberries, but they should have included bananas and other berries, in my humble opinion.\n\nI've never tried the pancakes, waffles, or the breakfast burrito, so I cannot speak to those items.\n\nA word about beverages: THEY DON'T HAVE COFFEE! They should. Farley's coffee tastes like caca. Hazel's serves pellegrino juices and Juice Squeeze, but I sincerely believe that the best thing on the menu is their Watermelon Aqua Fresca. It's not always advertised/on the menu, but when they have it, you would be doing yourself an unforgettable favor by ordering one. Really, really refreshing and delicious.\n\nContrary to what I've read here, I think the service is consistent, fast, hardworking and very sweet. The new woman who works there has botched up my order before, but I think she is getting better. I really  have no problem with the service; I don't know what the 1-star reviewer was talking about.", "rating": 3, "date": "2013-07-07"}, {"excerpts": ["And now they've expanded the lunch menu to include quesadillas & tacos, plus waffles, pancakes & eggs for breakfast. ", "The food is fresh, the people are friendly, and if you're really lucky, you get an official greeting outside Hazel's by my dog Otis. ", "What are you waiting for?"], "author": "P C.", "review": "It's 4+ years since my previous review and the only thing I would change is that I need more stars. Hazel's still makes fantastic, oversized sandwiches. And now they've expanded the lunch menu to include quesadillas & tacos, plus waffles, pancakes & eggs for breakfast. The food is fresh, the people are friendly, and if you're really lucky, you get an official greeting outside Hazel's by my dog Otis. What are you waiting for?", "rating": 5, "date": "2010-10-07"}], "belgian waffle": [{"excerpts": ["I ordered the breakfast burrito and my girlfriend got the Belgian waffle with bacon. ", "The burrito was absolutely delicious the best breakfast ", "burrito ", "I have ever had. ", "The waffles weren't great but we will totally be back to try lunch and get another breakfast burrito."], "author": "Matthew M.", "review": "We originally were headed to Plow for breakfast but the wait time was 45 minutes so we walked back and spotted Hazels Kitchen. I ordered the breakfast burrito and my girlfriend got the Belgian waffle with bacon. The burrito was absolutely delicious the best breakfast burrito I have ever had. The waffles weren't great but we will totally be back to try lunch and get another breakfast burrito.", "rating": 4, "date": "2013-08-17"}, {"excerpts": ["Plus- the $4.95 belgian waffle with egg, avocado and bacon is a steal!"], "author": "Kat L.", "review": "My coworkers and I go to Hazels pretty often because it's quick and tasty. We usually take it to go, but for people looking for seating there is outdoor seating and they have an agreement with the coffee shop next door, so you can eat in there too. \n\nMy favorites are the hot steak sandwich and the cajun sausage sandwich (when they have it as a special). The balsamic onions are delicious and the bread is super fresh. They also have good side salads like the beet and goat cheese salad with oranges. \n\nWhoever calls this place pricey is tripppin'...last time I checked $7-8 is pretty standard for a sandwich....especially in the potrero hill neighborhood. Plus- the $4.95 belgian waffle with egg, avocado and bacon is a steal!", "rating": 5, "date": "2011-04-06"}, {"excerpts": ["My recent fave for lunch are the tacos, and my new breakfast treat is the belgian waffle with fruit!  ", "Mmmm!  ", "Better than the food is the friendly service from Leslie, the talented and successful owner, and from Aimee, who remembers my order, and always offers a friendly smile.  ", "Thanks guys!  ", "This review is long overdue!!"], "author": "erica s.", "review": "Hazel's Kitchen is my favorite neighborhood eatery.  I have been eating at Hazel's nearly every day since I moved to the neighborhood, enjoying their sandwiches and breakfast burritos.  Recently Juan and Alma, the friendly chefs of the kitchen, have been creating some new tasty treats.  My recent fave for lunch are the tacos, and my new breakfast treat is the belgian waffle with fruit!  Mmmm!  Better than the food is the friendly service from Leslie, the talented and successful owner, and from Aimee, who remembers my order, and always offers a friendly smile.  Thanks guys!  This review is long overdue!!", "rating": 5, "date": "2010-03-22"}], "breakfast burrito or tacos": [], "yogurt fresh fruit  granola": [], "freshsqueezed orange juice": [], "butter": [{"excerpts": ["\"no butter needed\".. \n\nGreat job "], "author": "Al L.", "review": "Well, we were in the area for Plow, and after waiting for 1 hour we walked to Hazel's, and boy where we glad we did! \n\nWe had 2 bacon egg and cheese and pancakes.... the sandwiches were perfect.... with a good amount of bacon....and eggs cooked to order, super! \n\nWe also had the pancake...... his exact words, \"There are very light\" and enjoyed them very much.... \"no butter needed\".. \n\nGreat job Hazel.... draw back.... seating..... can you create more seating.... then you can have the last star.....", "rating": 4, "date": "2017-10-22"}], "butter  jam": [], "peanut butter  jam": [], "cream cheese": [{"excerpts": ["I've only been here for breakfast and recommend the smoked salmon bagel with cream cheese or their bacon, egg, cheese croissant. ", "Come here, order a breakfast sandwich, order a cup of coffee from Farley's next door and sit at the parklet and people watch."], "author": "Cindy A.", "review": "This is a great small neighborhood spot in Potrero Hill serving up amazing sandwiches. I've only been here for breakfast and recommend the smoked salmon bagel with cream cheese or their bacon, egg, cheese croissant. Come here, order a breakfast sandwich, order a cup of coffee from Farley's next door and sit at the parklet and people watch.", "rating": 4, "date": "2015-12-19"}, {"excerpts": ["Come with a generous topping of smoked salmon, cream cheese, onions, tomato, lettuce and chives. "], "author": "Filip M.", "review": "This has turned to my go to quick sandwich place since moving to Potrero. I usually go here for a quick breakfast on the weekends after a run. \n\nAll the condiments are fresh and the variety of sandwiches / burritos is enough to not get bored. \n\nThe smoked salmon bagel sandwich is great. Come with a generous topping of smoked salmon, cream cheese, onions, tomato, lettuce and chives. The whole package is very flavorful. \n\nThere usually is freshly made juice in the morning. The melon juice is my favorite, but it's a little steep at $4+. \n\nThey don't serve coffee, but going next door to Farley's will solve that.", "rating": 4, "date": "2012-06-10"}, {"excerpts": ["And of course cream cheese. ", "Yum ", ":)"], "author": "Julie P.", "review": "Awesome bagels!!! And of course cream cheese. Yum :)", "rating": 5, "date": "2011-07-10"}, {"excerpts": ["So you gotta add tomatoes or sprouts or cream cheese, etc. ", "Each additional topping costs more. ", "Lame. ", "Totally lame. ", "The giant \"WE HAVE BAGELS\" sign out front led me to believe they had bagels. ", "But, actually, what it should have said was, \"WE HAVE BAGEL\", as the only bagel choice that was left was a garlic bagel. ", "Not a bad bagel, but still worth noting that they don't have much of a selection. "], "author": "Jono K.", "review": "Note: this is a review for breakfast at Hazel's - not lunch. I plan on returning for lunch to see if it's any better!\n\nBeing next to Farley's, I had high hopes for Hazel's. I was really disappointed with their breakfast selection. Completely uninspired \"egg & bagel sandwich\" was just exactly that. Literally an egg plopped on a bagel. So you gotta add tomatoes or sprouts or cream cheese, etc. Each additional topping costs more. Lame. Totally lame. The giant \"WE HAVE BAGELS\" sign out front led me to believe they had bagels. But, actually, what it should have said was, \"WE HAVE BAGEL\", as the only bagel choice that was left was a garlic bagel. Not a bad bagel, but still worth noting that they don't have much of a selection. My $5 bagel sandwich was good, but definitely not worth $5. \n\nI am looking forward to returning for lunch - hoping it'll be a better experience!", "rating": 2, "date": "2009-08-17"}], "lox spread": [{"excerpts": ["I got a bagel with lox spread on it. ", "Super good price for what you get. ", "Everything is really fresh too. "], "author": "Anthea W.", "review": "Open on New Years day - major bonus points already!\n\nI got a bagel with lox spread on it. Super good price for what you get. Everything is really fresh too. I'm thoroughly impressed. \n\nFriendly staff as well and they play great music :)", "rating": 4, "date": "2015-01-03"}, {"excerpts": ["my favorites are the toasted bagel with lox spread, the tuna melt (with that amazing special sauce and balsamic onions!) and their veggie chili.  ", "the husband dreams about their baked tofu melt", ", we HAVE to eat here at least once a week!"], "author": "Archana P.", "review": "hazel's is great to grab a quick bite when you have no idea what you feel like but want a tasty, dependable meal.  my favorites are the toasted bagel with lox spread, the tuna melt (with that amazing special sauce and balsamic onions!) and their veggie chili.  the husband dreams about their baked tofu melt, we HAVE to eat here at least once a week!", "rating": 5, "date": "2016-03-02"}, {"excerpts": ["And they don't skimp on the lox spread. \n\n"], "author": "Brandi C.", "review": "I love Hazel's! Their menu is pretty big for such a tiny place, and has everything you might want for lunch. The fact that they have gluten-free bagels and bread for their sandwiches is what really wins me over, though. Even in S.F., it's rare that I can enjoy a sandwich or bagel anymore! And they don't skimp on the lox spread. \n\nThe employees are really friendly, and the owner seems like a great neighborhood person as well. I like the community feel of the place (especially the thankfulness tree out front- such a sweet idea!) and I usually stop in about once a week for lunch when I need to get away from work.", "rating": 5, "date": "2014-02-10"}, {"excerpts": ["I got a bagel with their lox spread which was pretty good. ", "They actually use real lox in the spread versus the over processed stuff you find at most places. ", "You could tell because the spread was  white with pink spots, not all pink. ", "My boyfriend got the scrambled egg sandwich. ", "I had a bite and it was terribly bland even though I watched them season it. ", "They make the eggs in the microwave which never fares well. ", "They were rubbery and dry. ", "Yuck. ", "The service here was pretty bad. ", "Super slow! ", "And before you ask -- no there were not a bunch of people in front of me. ", "I had time to go to Farley, order 2 lattes, and finish my whole latte in the time it took them to make my order. ", "It took about 15 minutes for us to get our orders and neither were difficult to make especially considering the eggs were microwaved. ", "I MIGHT go back to try their sandwiches but it is doubtful. ", "I'll just stick to Farley's and their yummy pastries."], "author": "Sierra d.", "review": "Decided to grab breakfast at Hazels when I was getting my coffee at Farley's next door. I got a bagel with their lox spread which was pretty good. They actually use real lox in the spread versus the over processed stuff you find at most places. You could tell because the spread was  white with pink spots, not all pink. My boyfriend got the scrambled egg sandwich. I had a bite and it was terribly bland even though I watched them season it. They make the eggs in the microwave which never fares well. They were rubbery and dry. Yuck. The service here was pretty bad. Super slow! And before you ask -- no there were not a bunch of people in front of me. I had time to go to Farley, order 2 lattes, and finish my whole latte in the time it took them to make my order. It took about 15 minutes for us to get our orders and neither were difficult to make especially considering the eggs were microwaved. I MIGHT go back to try their sandwiches but it is doubtful. I'll just stick to Farley's and their yummy pastries.", "rating": 2, "date": "2007-08-28"}], "sundried tomato spread": [], "smoked salmon": [{"excerpts": ["My friend got a smoked salmon sandwich, she received a generous amount of smoked salmon and it was so fresh and so tasty. ", "While we are enjoying our sandwiches, we see customers coming in/calling in "], "author": "Vivian C.", "review": "We stayed at an airbnb near hazel's kitchen and came here due to the rating. we def did not disappoint.\n\nOn a Monday 9am breakfast time, we are a group of 4 and we were able to sit down and had a nice sandwich. Where do I begin? Hazel's kitchen is hipster yet cozy to settle down. Genuine service and fresh ingredients. Wait time wasnt too bad after ordering, I would say maybe 5-10 min. My friend got a smoked salmon sandwich, she received a generous amount of smoked salmon and it was so fresh and so tasty. While we are enjoying our sandwiches, we see customers coming in/calling in and it is obvious that every one just loves this corner sandwich store.\n\nPoint to note, Hazel's Kitchen does not serve coffee but if you are craving for one, the store next to it has some really nice coffee.", "rating": 5, "date": "2015-12-17"}, {"excerpts": ["I've only been here for breakfast and recommend the smoked salmon bagel with cream cheese or their bacon, egg, cheese croissant. ", "Come here, order a breakfast sandwich, order a cup of coffee from Farley's next door and sit at the parklet and people watch."], "author": "Cindy A.", "review": "This is a great small neighborhood spot in Potrero Hill serving up amazing sandwiches. I've only been here for breakfast and recommend the smoked salmon bagel with cream cheese or their bacon, egg, cheese croissant. Come here, order a breakfast sandwich, order a cup of coffee from Farley's next door and sit at the parklet and people watch.", "rating": 4, "date": "2015-12-19"}, {"excerpts": ["Very friendly loved the Mediterranean sandwich egg bagel and smoked salmon bagel. ", "A great option when you can't get into prowler"], "author": "Chris B.", "review": "Excellent breakfast. Very friendly loved the Mediterranean sandwich egg bagel and smoked salmon bagel. A great option when you can't get into prowler", "rating": 4, "date": "2016-08-18"}, {"excerpts": ["The smoked salmon bagel sandwich is great. ", "Come with a generous topping of smoked salmon, cream cheese, onions, tomato, lettuce and chives. "], "author": "Filip M.", "review": "This has turned to my go to quick sandwich place since moving to Potrero. I usually go here for a quick breakfast on the weekends after a run. \n\nAll the condiments are fresh and the variety of sandwiches / burritos is enough to not get bored. \n\nThe smoked salmon bagel sandwich is great. Come with a generous topping of smoked salmon, cream cheese, onions, tomato, lettuce and chives. The whole package is very flavorful. \n\nThere usually is freshly made juice in the morning. The melon juice is my favorite, but it's a little steep at $4+. \n\nThey don't serve coffee, but going next door to Farley's will solve that.", "rating": 4, "date": "2012-06-10"}, {"excerpts": ["Bagels with smoked salmon! ", "Almost like being home on the East Coast....."], "author": "Emme D.", "review": "MMMMMM Hazel's!\n\nRoast beef with horseradish! Bagels with smoked salmon! Almost like being home on the East Coast.....", "rating": 5, "date": "2012-06-02"}], "egg  cheese": [], "egg cheese  bacon": [], "addons": []}