{"onion cake": [{"excerpts": ["Onion Cake (skip)\n", "Diana's Special Meat Pie (", "oh yes!)\n", "Dry-sauteed String Beans (Divine)\n"], "author": "Carla F.", "review": "Henry's Special (bomb)\nHot Sour Beef (bomb X2)\nOnion Cake (skip)\nDiana's Special Meat Pie (oh yes!)\nDry-sauteed String Beans (Divine)\nDumpling's (yup, I'll have 2 orders)\n\nLocation kinda sucks and so does parking but way worth it!", "rating": 5, "date": "2013-03-14"}, {"excerpts": ["Diana's special or the onion cake with ground meat reminded everyone of dog food. ", "Even the rice was hard and tasted old-- they screwed up white rice at a Chinese restaurant!!! ", "other dishes tasted overly salty, had way too much stir-fried onion (cheaper than meat or veggies I presume), or were just mleh... now you know, you've been warned"], "author": "Amy D.", "review": "OK, so I feel bad writing a negative review of this place, but it'll balance out all the overly positive reviews. It did have AMAZING hot and sour soup-- so if you're a fan of that dish, you should come here for that alone. The green bean dish and stir-fried beef with green onions were decent. Also, the service is friendly and it's one of the few restaurants near the Concourse if you're heading there for a concert, show etc.\n\nBut, out of the other 4 or 5 dishes we ordered, the rest of them were just bad. Diana's special or the onion cake with ground meat reminded everyone of dog food. Even the rice was hard and tasted old-- they screwed up white rice at a Chinese restaurant!!! other dishes tasted overly salty, had way too much stir-fried onion (cheaper than meat or veggies I presume), or were just mleh... now you know, you've been warned", "rating": 2, "date": "2006-07-21"}, {"excerpts": ["Rec's: spicy fried cod, smoked ham with green beans, Marty's special, mapo tofu (with respect to Jade, I like it), dry braised green beans, onion cake, and the complimentary hot and sour soup is pretty darned tasty. ", "Henry's is a dependable SOMA lunch destination."], "author": "Mark W.", "review": "Smoked pork, fermented black beans, and green beans = one happy Yelper. There's nothing Earth-shattering here, but it's good solid Hunan fare. The waiters remember us betwixt visits and the spice hits the spot.\n\nRec's: spicy fried cod, smoked ham with green beans, Marty's special, mapo tofu (with respect to Jade, I like it), dry braised green beans, onion cake, and the complimentary hot and sour soup is pretty darned tasty. Henry's is a dependable SOMA lunch destination.", "rating": 4, "date": "2008-08-10"}, {"excerpts": ["2/5\nonion cake 0/5\nliling chicken wings "], "author": "Cindy L.", "review": "bad food. but the server was super nice. but bad food\nI went here cus SO was closed 12/31 LOL\n\nill tell u what NOT to get:\n\nthe hot and sour soup2/5\nsauteed eggplant 3/5\nfried rice (no taste) 2/5\nonion cake 0/5\nliling chicken wings 1/5\n\nthese were the dishes we got.", "rating": 2, "date": "2012-01-02"}], "dumplings": [{"excerpts": ["They have NO dumplings (signature steamed 'pot stickers\") on the menu at all, how is that? ", "One dish that I always order, because it's wonderful, was delivered to our table unrecognizable. ", "I was dark and lifeless; I'm certain it had been previously cooked and reheated to serve. "], "author": "James G.", "review": "So sad, really.\n\nI have been going, consistently, to Hunan Restaurants (ever since they were on Kearny Street, in Chinatown, in 1979). Henry, who recently passed, after creating a classic San Francisco institution, would be mortified to see what THIS location of his family restaurant group has come to. \n\nUpon our arrival, the shabby waiter (as it turned out) was standing outside the front door, smoking. After flipping his cigarette into the street he came inside with us. (That's our waiter?!) We made some effort to have our order understood, in English, as he spoke nearly no English as far as we could discern. Not great for someone in a customer service position. After putting down our order we never saw him at our table-side again. Oh, ... except when I called him over and told him that one dish had been delivered nearly cold. \"No, ... hot.\" He told us, and set the dish back down on the table, and left.\n\nThis location, to which I have been many times in the past, is usually very busy at lunchtime. Yesterday, a week day, it was a ghost town. \nNow I know why. \n\nBesides terrible service, the food was abysmal. It makes me sad to say so, but it's true.They have NO dumplings (signature steamed 'pot stickers\") on the menu at all, how is that? One dish that I always order, because it's wonderful, was delivered to our table unrecognizable. I was dark and lifeless; I'm certain it had been previously cooked and reheated to serve. It was very sad.\n\nGreen beans were overly fried and blistered, which made them tough.\n\nDo yourself a favor and steer clear of this place and visit their OTHER location on Church Street @ Day Street if you want the original food Henry designed and was so proud of. There they still take pride in the legacy Henry left them. The manager there, Henry's grandson, Jeffrey, and his staff, deliver the home cooking of Hunan we know and love.", "rating": 1, "date": "2018-02-07"}, {"excerpts": ["No dumplings at least the last several times I've been there. ", "Other items on the menu aren't available but they don't take them off the menu for some reason, maybe they'll come back? ", "Food still has that nice spicy Henry's flavor but go to the one on NATOMA street if you can. ", "Much better. "], "author": "Chris N.", "review": "I love Henry's Hunan but this location isn't my fav. No dumplings at least the last several times I've been there. Other items on the menu aren't available but they don't take them off the menu for some reason, maybe they'll come back? Food still has that nice spicy Henry's flavor but go to the one on NATOMA street if you can. Much better. I do love the Harvest pork and the bean curd with meat sauce amongst my favorites.", "rating": 3, "date": "2017-11-06"}, {"excerpts": ["not so good\n-6ish dumplings had dryish meat inside, not juicy.\nshould go with the hot oil next time\nor the henry bacon lunch special over rice\n\ntakeouts:\n-order took about 20 minutes which seems a long time.\n"], "author": "Victor G.", "review": "first time at this Henry's for me. \nusually go the the sansome one. \ntried an old favorite the dumpling. either my bud's changed or the dumpling's changed.\n\neats: dumpling(4.5)\n-skipped the hot oil, what was left is the soy sauce. lots of it. not so good\n-6ish dumplings had dryish meat inside, not juicy.\nshould go with the hot oil next time\nor the henry bacon lunch special over rice\n\ntakeouts:\n-order took about 20 minutes which seems a long time.\n-decor is very casual. kind of rundown,\n-fanny's packed down the block.", "rating": 3, "date": "2013-09-26"}, {"excerpts": ["The dumplings are to die for, the sauces are peppery, hot goodness; and the atmosphere is so friendly!! ", "I love this place!!"], "author": "Addy Belle J.", "review": "OMG!! I am part Chinese so I can tell you that this is the closest thing to authentic Chinese food besides my mom's cooking! The dumplings are to die for, the sauces are peppery, hot goodness; and the atmosphere is so friendly!! I love this place!!", "rating": 5, "date": "2016-02-06"}, {"excerpts": ["The DUMPLINGS are amazing!!!"], "author": "Johnny K.", "review": "I work pretty close to Henry's Hunan and I've been coming here to eat at least once a week for the past couple of years. I'm pretty sure I'll keep coming back until something drastic happens. \n\nJason and the crew there is very nice and always working hard to give the best service. Sometimes the food can take a couple minutes more to be ready, but those extra couple minutes make all the difference when making food, let alone great food. \n\nThey have lunch deals that will keep your wallet heavy, will satisfy all of your taste buds, and will probably leave you with some to eat later. \n\nThe DUMPLINGS are amazing!!!", "rating": 5, "date": "2014-12-16"}, {"excerpts": ["LOVE the dumplings, meat pie and whatever the waiter recommend."], "author": "Ji C.", "review": "The service is so nice, the portions are huge and more importantly, you can find Chinese Chinese food here!\n\nLOVE the dumplings, meat pie and whatever the waiter recommend.", "rating": 5, "date": "2013-05-01"}, {"excerpts": ["Seriously, one order of chow mein and a beverage will fill you up, but I had to try the Dumplings too.  ", "My server was seated at a table folding these when I walked into the restaurant; one look at the ingredients was enough to convince me to try these.  ", "They're just like potstickers with a lean pork filling with just a bit of cabbage and ginger, but instead of being pan-fried crisp on one side these are steamed then presented in a bowl with a light, spicy soy sauce and chopped scallions (also pictured).  ", "The dumplings were very good.\n\n"], "author": "Wilhelm Y.", "review": "In my perfect world the perfect chow mein would be perfectly fried noodles and meat, that's it.  Henry's hasn't perfected the Chicken Chow Mein of my perfect world, but they've come pretty darn close.  With the version at Henry's (pictured) you'll find an occasional bean sprout, a tiny bit of shaved carrot, a single sliver of onion and a little green onion to go with a large portion of noodles and cubes of all white meat chicken.  If you like noodles and meat, you're going to like the chow mein at Henry's, and because it is a Hunan restaurant you can bet that your food will be effectively spicy.\n\nThat's another beautiful thing at Henry's Hunan.  If you can't handle the heat the kitchen will be more than happy to season your food to your preferred spicyness or mildness should that be the case.\n\nI often get carried away with ordering food and end up over-eating instead.  Seriously, one order of chow mein and a beverage will fill you up, but I had to try the Dumplings too.  My server was seated at a table folding these when I walked into the restaurant; one look at the ingredients was enough to convince me to try these.  They're just like potstickers with a lean pork filling with just a bit of cabbage and ginger, but instead of being pan-fried crisp on one side these are steamed then presented in a bowl with a light, spicy soy sauce and chopped scallions (also pictured).  The dumplings were very good.\n\nThe service was excellent, but I went there during an off-peak hour so I was the only diner there at the time.  Inexpensive and less than two blocks from my work, I wonder why I haven't eaten here more often.  In my perfect world I will.", "rating": 4, "date": "2007-12-22"}, {"excerpts": ["I tried a soup, dumplings, and a pork and cabbage dish. ", "The dumplings were steamed and in a spicy soy sauce. "], "author": "Erik F.", "review": "This spot is hard to assign a simple star rating. It is a place of extremes and I think there are some lovable things and some mediocre things. So I give it 3 stars and here is why. \n\nIt isn't your average Americanized corner beef-and-broccoli shop. They market themselves as distinctly Hunan and spicy. \n\nMy favorite thing about Henry's is the menu. It has odd and personal dishes that have a bit more explanation than just a list of ingredients. The menu speaks to you. \n\nI tried a soup, dumplings, and a pork and cabbage dish. Pork is a big feature on the menu. \n\nIn the case of the main dish, it came out very greasy and the pork had been cooked at least twice...and perhaps at least once too many times. \n\nThe dumplings were steamed and in a spicy soy sauce. Pretty good. \n\nThe soup was solid but not special. \n\nThe people are nice enough but not so attentive. The space is plain but that doesn't matter for this kind of meal. \n\nThe do have a TV on the wall which is tacky and distracting to the staff and guests in a resturant. It is probably a symptom of this also being the living room of a bunch of people who spend all their waking hours in this resturant. \n\nI didn't make any particular requests about the spiciness level and they didn't ask. It came out mildly spicy. \n\nIn the end I would say if you are a big eater who likes rich food that is outside the the norm and you like homespun dining experiences then this is a good spot for you. Otherwise, there are a lot of nice Chinese food options in SF to choose from. \n\nIf you work in the area I could see this as a part of a regular rotation.", "rating": 3, "date": "2013-09-26"}, {"excerpts": ["Skip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM."], "author": "Gwynnie P.", "review": "So, I see what happened. So, a child of San Tung opened up right next door to this Henry's Hunan location and appears to have killed the HH lunch business. So how mean!\n\nSkip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM.", "rating": 4, "date": "2010-03-26"}, {"excerpts": ["Dumplings and no flavor\n\nSpicy rock cod had a great sauce. "], "author": "Foodlover B.", "review": "I wanted to give three stars cause service was so nice but wow the food is just not tasty.\n\nDumplings and no flavor\n\nSpicy rock cod had a great sauce. The fish itself had a weird texture, not sure what it was.\n\nHot and sour soup was nice\n\nEnjoyed the green beans the most, but have had better.", "rating": 2, "date": "2013-03-21"}, {"excerpts": ["Many people have written about their dumplings. ", "I'll agree in that they are tasty. ", "Also, they make the best rice. ", "Chinese rice should be sticky. ", "Too many restaurants serve rice that you cannot eat with chopsticks."], "author": "Therese M.", "review": "This was my introduction to Henry's Hunan. I used to work in the SomArts building, and Jeff managed Henry's. I had complimentary hot and sour soup and piping hot tea while I decided. I almost never ordered from the lunch menu because with offerings such as black bean squid, smoked meats, and spicy green beans. Many people have written about their dumplings. I'll agree in that they are tasty. Also, they make the best rice. Chinese rice should be sticky. Too many restaurants serve rice that you cannot eat with chopsticks.", "rating": 5, "date": "2016-03-20"}, {"excerpts": ["Best dumplings ", "I've ever had. ", "These guys put the sauce in the bowl they're served in, yum.  ", "It lightly coats them as you stir it around.  ", "Had the first item on the menu, can't remember the name ", "but there's a great story about the dish that drew me to it.  "], "author": "Sport G.", "review": "Good, good good.  Been wanting to go to one of these for a while.  A friend was in town from NY and the opportunity presented itself to go within a very short walk from the Civic Center Motor Inn where she's staying.  Best dumplings I've ever had. These guys put the sauce in the bowl they're served in, yum.  It lightly coats them as you stir it around.  Had the first item on the menu, can't remember the name but there's a great story about the dish that drew me to it.  My friend had MooShoo Pork and loved it.\n\nTried the meat pie w/ sauce to say we did cuz it's one of their quirky specialties...tasty!  I'd order it again.  \n\nMy friend was happy to have lots of leftovers for the next couple days.  We were there during lunch on a Wednesday. Got there around 11:45. It never got super busy. Wait staff was very attentive. Decor is cafeteria tables and chairs...that's all you need.  \n\nI don't think I'll bother trying to get to the one in the Financial District any longer.  I'll just pop in here.  Might have to make it a pre-Giants game spot in the process.", "rating": 4, "date": "2012-05-16"}, {"excerpts": ["no Dumplings.... ", "Soy Sauce in packets....", "Filthy Bathroom...", "Employees out front smoking instead of helping...asked for hot sauce three times...", "Wow.... from Awesome to ", "Never Again..... bring Jeff back to run this place correctly such a bad experience made the food a mute point....;"], "author": "Matthew R.", "review": "I used to frequent often....Never Again  No Ice..Extremely slow service...no Dumplings.... Soy Sauce in packets....Filthy Bathroom...Employees out front smoking instead of helping...asked for hot sauce three times...Wow.... from Awesome to Never Again..... bring Jeff back to run this place correctly such a bad experience made the food a mute point....;", "rating": 1, "date": "2014-12-10"}, {"excerpts": ["Also Diana's meat pie and Chinese dumplings are the best appetizers I ever had. ", "I hope everyone can try these dishes."], "author": "Hao Z.", "review": "This restaurant is under new management  after June of 2010. The food over there is really traditional and delicious. Like henry's special, Kung pao chicken, harvest pork. Also Diana's meat pie and Chinese dumplings are the best appetizers I ever had. I hope everyone can try these dishes.", "rating": 5, "date": "2010-09-20"}, {"excerpts": ["On the other hand, I enjoyed the little complimentary bowls of soup, and the dumplings were pretty tasty. "], "author": "Jade L.", "review": "It was meh. I have been traveling around the Bay looking for GOOD mapo tofu, and i have NOT found it at Henry's Hunan. The beef bits with bean curd (i think thats a direct quote from the menu) was hardly flavorful and just mreh. and yes, I asked the waiter if that equated mapo tofu and he said yes. \n\nOn the other hand, I enjoyed the little complimentary bowls of soup, and the dumplings were pretty tasty. i think they're handmade somewhere or another, but it was pretty good.\n\nThe other food my colleagues got was pretty meh too. Its nice to switch it up and get away from the office, but I just meh.", "rating": 3, "date": "2008-07-31"}, {"excerpts": ["Dumplings and Green Bean Chicken are a must have. ", "If you like hot that can make you sweat ask for it spicy. ", "They don't mind making it mild for those faint of heart. ", "This place is great for family style meals and groups. ", "So come hungry and leave happy."], "author": "Charlene K.", "review": "Dumplings and Green Bean Chicken are a must have. If you like hot that can make you sweat ask for it spicy. They don't mind making it mild for those faint of heart. This place is great for family style meals and groups. So come hungry and leave happy.", "rating": 4, "date": "2011-01-23"}, {"excerpts": ["We had the dumplings, Kung Pao Chicken, and Henry's Short Ribs (first time dish).  ", "Dumplings were pleasant as usual. ", "The Kung Pao Chicken was hella ", "good and extra spicy.  ", "We thought it was possibly the best Kung Pao Chicken we have had at any Henry's location.  "], "author": "Nate B.", "review": "I am addicted to Henry and his gang of dragons in his kitchen.  I went to lunch at the Natoma Henry's for Lunch with some buddies, and one of them called me out for dinner at the Bryant Henry's the same day.  I accepted the challenge and we hit it up.  \n\nIt was our first time attending this location so I had to roll with my Henry Flexi-FIt cap to show them I was legit.  It was pretty empty, but the hostess was really nice.  Friendly faces from the Natoma location recognized us so we rapped about the Bryant location.  The chef from Natoma was working there for dinner.\n\nWe had the dumplings, Kung Pao Chicken, and Henry's Short Ribs (first time dish).  Dumplings were pleasant as usual. The Kung Pao Chicken was hella good and extra spicy.  We thought it was possibly the best Kung Pao Chicken we have had at any Henry's location.  The short ribs took some time to eat, but was definitely tasty.  \n\nWe survived back to back Henry outings in the same day with no problems.  I highly recommend it.  We didn't even need to use the sink faucet that hangs above one of the tables against the wall to shower off the sweat from the spice.\n\nSeems like this is very popular for takeout/delivery.  It was pretty quiet. Also, it is popular for slirkers to pop in and try to get free food.  Some dude came in and asked how much coca cola was and after he found out it was a buck fifty he left, but not without grabbing a handful of food from the plate of a customer who left.  Another dude came in a bought a carton of rice.  Just rice.", "rating": 5, "date": "2009-03-31"}, {"excerpts": ["The owners are very friendly and heck makes the best dumplings  in town...always fresh as you see him or other staff making them - simply yummy.  ", "I like spicy ", "so if you like Chinese on the hot end check this joint out.  ", "Odd location, and very dive-ish, but heck", ", again - it's the food that brings me back."], "author": "Tiberius A.", "review": "I've eaten here about a half dozen times now and for me it's damn good Hunan!  The owners are very friendly and heck makes the best dumplings  in town...always fresh as you see him or other staff making them - simply yummy.  I like spicy so if you like Chinese on the hot end check this joint out.  Odd location, and very dive-ish, but heck, again - it's the food that brings me back.", "rating": 5, "date": "2007-09-21"}, {"excerpts": ["I had the Chow Mein, and the dumplings, and both were great. ", "Tons of food- and the service was impersonal, but efficient."], "author": "Danielle V.", "review": "I had the Chow Mein, and the dumplings, and both were great. Tons of food- and the service was impersonal, but efficient.", "rating": 4, "date": "2007-12-04"}], "dianas special meat pie": [], "hot and sour soup": [{"excerpts": ["My favorite ten, their hot and sour soup, has been permanently removed."], "author": "Marcus B.", "review": "The food is amazing, but the service is incredibly slow. Don't expect to eat within a normal lunch break. Also, in recent months, the menu has a lot of redacted items. My favorite ten, their hot and sour soup, has been permanently removed.", "rating": 3, "date": "2016-12-15"}, {"excerpts": ["Cool, give me a large hot and sour soup.\n", "HH:  ", "Sorry, we don't have soup.\n", "Me:  Huh?\nHH:  ", "No soup today.\n", "Me:  ", "It's only 5:30 pm and you're out of soup?\n", "HH:  "], "author": "Sammy P.", "review": "Seriously, what did I do to piss this restaurant off??  I honestly don't know but I must have.\n\nAnyway, here's what happened.  This place is a neighborhood joint and I already went there once and it was ok.  Here are the subsequent visits:\n\nVisit #1:  Placed an order via phone.  Was told it'll be 35 mins.  Ok, showed up 40 mins later - they said I must have called the wrong restaurant because they couldn't find my order in the kitchen.   Ah, no, I showed them the call log on my phone.  They tried to blame me still, \"You didn't call us and that's why we missed your order, it is YOUR fault! Sorry.\"  But how do you expand your phone number in my call log?  \"Sorry, it is your fault.\"  I then asked how long will it take if place an order now?  \"One hour.\"  Seriously??  Walked out.\n\nVisit #2:  Not really an actually visit but I called them and tried to place an order.  \nHH:  It will take A Hour and a Half, do you still want to order?\nMe:   Come again?\nHH:  One hour and a half wait, do you still want?\nMe:  But you guys close in an hour.....\nHH:  Do you want or not?\nMe:  Hell no.\n\nVisit: #3:\nMe:  How long is the wait this time?\nHH:  15 minutes.\nMe:  Cool, give me a large hot and sour soup.\nHH:  Sorry, we don't have soup.\nMe:  Huh?\nHH:  No soup today.\nMe:  It's only 5:30 pm and you're out of soup?\nHH:  Yes.\n\nThis can't be all coincidence.   I don't know what it is, but somebody at HH is mad at me.  Oh well, I guess I'll have to go somewhere else; it's for the best.\n.", "rating": 1, "date": "2015-03-31"}, {"excerpts": ["On my first visit, I came with my girlfriend only to be told that none of the standard items that I had ordered in the past were available- no potstickers, no hot and sour soup, and no fish, and then we were told that it would be an hour wait. ", "The restaurant was half full. ", "I was the only white person in the restaurant. ", "We walked out. ", "Suspicious, but I decided to give it another go. ", "I went back a second time, this time by myself, tried to order a similar line up, and got the same reception. ", "I will not be returning."], "author": "John S.", "review": "I used to go to their Sansome street location, but that location closed recently. On my first visit, I came with my girlfriend only to be told that none of the standard items that I had ordered in the past were available- no potstickers, no hot and sour soup, and no fish, and then we were told that it would be an hour wait. The restaurant was half full. I was the only white person in the restaurant. We walked out. Suspicious, but I decided to give it another go. I went back a second time, this time by myself, tried to order a similar line up, and got the same reception. I will not be returning.", "rating": 1, "date": "2016-04-18"}, {"excerpts": ["Hot and sour soup was nice\n\nEnjoyed the green beans the most, but have had better."], "author": "Foodlover B.", "review": "I wanted to give three stars cause service was so nice but wow the food is just not tasty.\n\nDumplings and no flavor\n\nSpicy rock cod had a great sauce. The fish itself had a weird texture, not sure what it was.\n\nHot and sour soup was nice\n\nEnjoyed the green beans the most, but have had better.", "rating": 2, "date": "2013-03-21"}, {"excerpts": ["I had complimentary hot and sour soup and piping hot tea while I decided. ", "I almost never ordered from the lunch menu because with offerings such as black bean squid, smoked meats, and spicy green beans. "], "author": "Therese M.", "review": "This was my introduction to Henry's Hunan. I used to work in the SomArts building, and Jeff managed Henry's. I had complimentary hot and sour soup and piping hot tea while I decided. I almost never ordered from the lunch menu because with offerings such as black bean squid, smoked meats, and spicy green beans. Many people have written about their dumplings. I'll agree in that they are tasty. Also, they make the best rice. Chinese rice should be sticky. Too many restaurants serve rice that you cannot eat with chopsticks.", "rating": 5, "date": "2016-03-20"}, {"excerpts": ["The hot and sour soup is so salty. ", "I felt like the ingredients had their original flavors ripped off and replaced with salt and sauce. "], "author": "Liz H.", "review": "I couldn't bear people coming here hoping for some nice Chinese flavors because it has 3.5 stars on yelp. If you're looking for good flavor, this really is not the place. This is not about unauthentic, it's not about Americanized Chinese food: it just tastes bad. The hot and sour soup is so salty. I felt like the ingredients had their original flavors ripped off and replaced with salt and sauce. So sad. \n\nThe portions were huge. I asked to have half dine-in and half to go -- and I couldn't finish either portion. Partly because it's more comforting to stay hungry than to finish it. \n\nYes don't come here next time SO's closed. Walk another block to Sunrise Cafe.", "rating": 1, "date": "2010-06-16"}, {"excerpts": ["- I usually go with my co-workers for lunch and order close to the same thing - \n\nstring beans with shrimp - \nnapa cabbage - \nchicken chow mien - \n\nthe lunch comes with hot and sour soup which pretty good on a cold day - "], "author": "Tony G.", "review": "I've been eating here for a good year now and I would have to say that it's consistently good - I usually go with my co-workers for lunch and order close to the same thing - \n\nstring beans with shrimp - \nnapa cabbage - \nchicken chow mien - \n\nthe lunch comes with hot and sour soup which pretty good on a cold day - It's very salty and the spice varies but for the most part they make it hot -", "rating": 4, "date": "2009-02-16"}, {"excerpts": ["We ordered a few dishes, including hot and sour soup.  ", "Meanwhile, the waitress kept shuffling back and forth, avoiding eye contact.  ", "About 35 minutes later we flagged her down again and asked how much longer it would be.  ", "She said there were still 4 or so tables in front of us.  ", "Having observed that food had been coming out at a rate of one table every 5 minutes (apparently they only cook for one table at a time), we decided we weren't willing to wait ANOTHER 20 minutes for crappy Chinese food, and told the waitress we were leaving.  ", "Instead of apologizing, she seemed relieved.  ", "Come on, they've got to at least have a vat of hot and sour soup back in the kitchen. ", "It shouldn't take an hour to bring out something as simple as that."], "author": "natilee r.", "review": "Slowest Chinese restaurant ever.   We never even ended up getting our food.  After being seated, it was about 5 minutes before we were offered menus and 10 minutes later before were finally able to flag down the waitress to order.  Ok, no big deal.  We ordered a few dishes, including hot and sour soup.  Meanwhile, the waitress kept shuffling back and forth, avoiding eye contact.  About 35 minutes later we flagged her down again and asked how much longer it would be.  She said there were still 4 or so tables in front of us.  Having observed that food had been coming out at a rate of one table every 5 minutes (apparently they only cook for one table at a time), we decided we weren't willing to wait ANOTHER 20 minutes for crappy Chinese food, and told the waitress we were leaving.  Instead of apologizing, she seemed relieved.  Come on, they've got to at least have a vat of hot and sour soup back in the kitchen. It shouldn't take an hour to bring out something as simple as that.", "rating": 1, "date": "2014-09-18"}, {"excerpts": ["I do like that they provide a free hot and sour soup with the lunch though."], "author": "Tyler C.", "review": "This place is always packed during the lunch hour on weekdays!  Both times I've come, I wasn't able to get back to work on time and had to go over my hour for lunch.  The servers are actually really busy, and I see them running around, so it's not for lack of trying.  It's just that they don't have enough people for soooo many customers at lunch.  I actually eat in about 15 minutes or less, so the rest of my lunch hour is spent walking there and back(10 minutes each way), waiting for the food(20 minutes) and ordering/paying for the bill(10 minutes).\n\nMy low rating isn't for the wait time or service though.  While the wait time is super long, it's because they're one of the only options for Chinese in the area, and they're super cheap (lunch specials run from $6 to $8).  The service is actually pretty decent.  The poor waiters are always scurrying around to try to help all of the customers.  The rating is for the food itself...I just feel that the ingredients seem to lack flavor.  I got the kung pao shrimp once, and the shrimp didn't have much taste besides the taste of the sauce.  Plus, it was chopped up rather than being whole pieces, which was a turn off.  It just tasted like the shrimp had been frozen for too long and lost all of it's natural flavor.  I also got the combination chow mein, and once again, the beef and chicken didn't have much taste, besides the flavor from the sauces.  Both dishes were mediocre, if not disappointing.  I do like that they provide a free hot and sour soup with the lunch though.", "rating": 2, "date": "2011-02-03"}, {"excerpts": ["Rec's: spicy fried cod, smoked ham with green beans, Marty's special, mapo tofu (with respect to Jade, I like it), dry braised green beans, onion cake, and the complimentary hot and sour soup is pretty darned tasty. ", "Henry's is a dependable SOMA lunch destination."], "author": "Mark W.", "review": "Smoked pork, fermented black beans, and green beans = one happy Yelper. There's nothing Earth-shattering here, but it's good solid Hunan fare. The waiters remember us betwixt visits and the spice hits the spot.\n\nRec's: spicy fried cod, smoked ham with green beans, Marty's special, mapo tofu (with respect to Jade, I like it), dry braised green beans, onion cake, and the complimentary hot and sour soup is pretty darned tasty. Henry's is a dependable SOMA lunch destination.", "rating": 4, "date": "2008-08-10"}, {"excerpts": ["The hot and sour soup was so salty and yeasty that I couldn't force it down. ", "I had one spoonful and I thought I was going to vomit. "], "author": "Babys P.", "review": "I would give this place ZERO stars if that were an option. The hot and sour soup was so salty and yeasty that I couldn't force it down. I had one spoonful and I thought I was going to vomit. The beef with broccoli tasted like watered down horse shit. I have no idea how this place is still in business. I mean....how the hell can you fuck up Chinese food this badly? Stay away.", "rating": 1, "date": "2010-05-13"}, {"excerpts": ["Tried the hot and sour soup, was bland and watery. ", "Had Pork Chow Mein, tasteless. "], "author": "Mike C.", "review": "Been going to Henry Hunans for lunch for years. Was one of my favorite places to eat in the city, plus the staff was very friendly and efficient. But Henry Hunan's is under different ownership now, and the experience is very poor.\n\nWent yesterday and noticed that there seemed to be new staff. Tried the hot and sour soup, was bland and watery. Had Pork Chow Mein, tasteless. Orange chicken also disappointed.\n\nService was horrible even though the place was only 1/3 full. Asked for chopsticks 3 times before I ended up getting them myself. First two dishes served 5 minutes before the third dish and rice. One of the waiters also started yelling at his 7 year old daughter right in front of our table.\n\nIn all, poor service, poor food. Will not visit again.", "rating": 1, "date": "2009-06-02"}, {"excerpts": ["Great Hot and Sour Soup...very spicy!"], "author": "Diane R.", "review": "Great Hot and Sour Soup...very spicy!", "rating": 3, "date": "2005-01-28"}, {"excerpts": ["The hot and sour soup is really good.  ", "The decor is pretty basic but clean (for a Chinese restaurant).  ", "I can see this place being a regular lunch spot. ", "If only they would deliver . . ."], "author": "Su K.", "review": "Friendly staff, pretty good Chinese food. The sweet and sour beef was very tasty.  Orange chicken would have been better if I had ordered spicy. I got mild and it was a bit bland for me.  The hot and sour soup is really good.  The decor is pretty basic but clean (for a Chinese restaurant).  I can see this place being a regular lunch spot. If only they would deliver . . .", "rating": 4, "date": "2008-05-07"}, {"excerpts": ["Even got free very spicy hot and sour soup with chicken stock which was a great appetizer."], "author": "Xander S.", "review": "While I prefer the Minna and original Sansome locations, this place has the best family-run-business atmosphere.  Random location across from Bed Bath and Boring/Trader Joe's mall at Bryant and Ninth St.  Recommended dishes: hot/sour chicken; Henry's special; green beans without meat.  Only complaint is that rice is sometimes past its prime.  Dishes themselves are amazingly hot and fresh and truly as spicy as requested.  The other day my friend and I stopped for a late lunch here on the way to a movie downtown.  Easy on-street parking early afternoon on the weekend.  Even got free very spicy hot and sour soup with chicken stock which was a great appetizer.", "rating": 4, "date": "2007-12-26"}], "mo si soup": [], "bean sprout salad": [{"excerpts": ["Skip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM."], "author": "Gwynnie P.", "review": "So, I see what happened. So, a child of San Tung opened up right next door to this Henry's Hunan location and appears to have killed the HH lunch business. So how mean!\n\nSkip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM.", "rating": 4, "date": "2010-03-26"}], "harvest pork": [{"excerpts": ["(Including Harvest Pork", ", Which is why one should go to Henrys'.) "], "author": "Alex C.", "review": "Wow. Don't come here. I stopped in because I have eaten at the other two Henry's and have always loved their food. This is like the hillbilly cousin of Henry's with no teeth and no understanding of why anyone would WANT to have teeth. \n\nThis place greets you with a funny smell when you walk in. The service was beyond detached; it was intentionally unfriendly. (And I'm an \"excuse me sir, please and thank you\" kind of customer.) There's masking tape over one quarter of the menu; those things aren't available. (Including Harvest Pork, Which is why one should go to Henrys'.) The picture below shows part of the dining room. \n\nBut if you're still undecided, how's this: There Is No Hot Tea. There Is No Hot Sauce. There is just a sad plate of passable chow mein. \n\nJust don't.", "rating": 1, "date": "2018-09-04"}, {"excerpts": ["I do love the Harvest pork and the bean curd with meat sauce amongst my favorites."], "author": "Chris N.", "review": "I love Henry's Hunan but this location isn't my fav. No dumplings at least the last several times I've been there. Other items on the menu aren't available but they don't take them off the menu for some reason, maybe they'll come back? Food still has that nice spicy Henry's flavor but go to the one on NATOMA street if you can. Much better. I do love the Harvest pork and the bean curd with meat sauce amongst my favorites.", "rating": 3, "date": "2017-11-06"}, {"excerpts": ["Like henry's special, Kung pao chicken, harvest pork. "], "author": "Hao Z.", "review": "This restaurant is under new management  after June of 2010. The food over there is really traditional and delicious. Like henry's special, Kung pao chicken, harvest pork. Also Diana's meat pie and Chinese dumplings are the best appetizers I ever had. I hope everyone can try these dishes.", "rating": 5, "date": "2010-09-20"}, {"excerpts": ["So say Hi to Jeffery and then go straignt on to order the Harvest Pork.  ", "I freakin", "' LOVE that stuff. ", "I seriously cannot order anything else. ", "A am addicted and, NO, I won't go to counseling."], "author": "doug b.", "review": "A Chinese woman friend once told me that the only good Chinese Restaurants are the ones that have formica tables and flouresent lights.  Well, this fits that description.  Infact, they actually didn't completely take out the old kitchen when they \"remodeled\" and you can see the enormous satinless steel wall and hood of the old stove right in the dining room.  Gots to love tat.  \n\nAnyways, Jeffery (or Jeff) is a wonderful Chinese young man who works there constantly.  Seriously he's ALWAYS there.  I asked him about it and he says he NEVER gets a day off, holidays included as long as it's during the week.  He feels blessed that he doesn't have to work weekends because the place is closed, so he doesn't complain.  \nI look forward to discussing the Giants and A's with him.  He gets so excited by the prospect of baseball season and perhaps the Giants going all the way.  Unfortunately, the more excited he gets the less I understand, me being a white boy from CT.      ...and now that they've got Zito (yeah, I'm an A's freak) I can start rooting for the Gi's! \n\nSo say Hi to Jeffery and then go straignt on to order the Harvest Pork.  I freakin' LOVE that stuff. I seriously cannot order anything else. A am addicted and, NO, I won't go to counseling.", "rating": 5, "date": "2007-02-27"}, {"excerpts": ["Some of my favorites are Harvest pork, Henry's special, meat pie, cold noodle salad, the list goes on and on.  ", "They have a large menu selection that you can check out on line.  ", "You can order your entree mild, medium or hot.  ", "This is not health food people, it's Hunan at its finest.  ", "Go, eat and enjoy."], "author": "Brenda G.", "review": "Don't know why I haven't reviewed Henry's sooner...  I've been eating here for years...  first at the Sacto St. location but now the Soma spot as my office moved.  I absolutely love Henry's!  The food is always fresh and delicious.  Some of my favorites are Harvest pork, Henry's special, meat pie, cold noodle salad, the list goes on and on.  They have a large menu selection that you can check out on line.  You can order your entree mild, medium or hot.  This is not health food people, it's Hunan at its finest.  Go, eat and enjoy.", "rating": 5, "date": "2008-06-27"}], "shredded pork  celery": [], "bean curd with meat sauce": [{"excerpts": ["I do love the Harvest pork and the bean curd with meat sauce amongst my favorites."], "author": "Chris N.", "review": "I love Henry's Hunan but this location isn't my fav. No dumplings at least the last several times I've been there. Other items on the menu aren't available but they don't take them off the menu for some reason, maybe they'll come back? Food still has that nice spicy Henry's flavor but go to the one on NATOMA street if you can. Much better. I do love the Harvest pork and the bean curd with meat sauce amongst my favorites.", "rating": 3, "date": "2017-11-06"}], "lightly fried shredded pork": [], "hunan spareribs": [], "henrys shredded pork": [], "hunan style sweet  sour pork or chicken": [], "mo si pork  pancakes": [], "glass noodles with ground pork": [], "howards special kung pao pork": [], "hot  sour beef": [], "sliced beef with bell peppers": [], "curry beef": [], "beef with string beans": [], "beef with bean curd": [], "hot  sour chicken": [], "hunan orange sauce chicken": [], "liling chicken wings": [{"excerpts": ["2/5\nonion cake 0/5\nliling chicken wings "], "author": "Cindy L.", "review": "bad food. but the server was super nice. but bad food\nI went here cus SO was closed 12/31 LOL\n\nill tell u what NOT to get:\n\nthe hot and sour soup2/5\nsauteed eggplant 3/5\nfried rice (no taste) 2/5\nonion cake 0/5\nliling chicken wings 1/5\n\nthese were the dishes we got.", "rating": 2, "date": "2012-01-02"}], "braised rock cod fillet": [], "spicy  hot rock cod fillet": [], "hunan shrimp": [], "napa cabbage with shrimp": [], "spicy shrimp with bean curd": [], "kung pao shrimp": [{"excerpts": ["and I loooooved the Kung Pao Shrimp. ", "It's right on the cusp of being 'too spicy'. ", "Ohhhh, how I miss their Kung Pao Shrimp. "], "author": "Jen O.", "review": "Awwww,  Henry's is the MAN.\n\nEvery time my former boss would say to me, \"Let's get Chinese today\", I would do the human version of a tail wag. \n\nHenry's food is consistently good. Prepare to come hungry, as their portions are HUGE (A.K.A. 'Family Style'), and since I don't like sharing, I like to see if I can finish the whole meal in one sitting, because I'm a fat-ass. \n\nLunchtime is particularly hectic for these guys, so call ahead if you want your meal to-go, as it can take anywhere from 15-20 mins to prepare. \n\nMy former co-worker and I loooooved the Kung Pao Shrimp. It's right on the cusp of being 'too spicy'. Ohhhh, how I miss their Kung Pao Shrimp. Our bosses loved the Spicy and Hot Rock Cod Filet. \n\nSometimes these guys will throw in some Spring Rolls at no additional charge.\n\nAs an added bonus, they never use M.S.G. in any of their food. Just delicious, piping hot, perfectly prepared Hunan Chinese food every time. \n\nEven though I moved back to the East Bay, I will definitely be making the drive to SF to visit this place again in the near future. This place easily gets five stars. Thanks for  party-rockin', Henry's Hunan Restaurant!", "rating": 5, "date": "2013-01-23"}, {"excerpts": ["I got the kung pao shrimp once, and the shrimp didn't have much taste besides the taste of the sauce.  ", "Plus, it was chopped up rather than being whole pieces, which was a turn off.  ", "It just tasted like the shrimp had been frozen for too long and lost all of it's natural flavor.  ", "I also got the combination chow mein, and once again, the beef and chicken didn't have much taste, besides the flavor from the sauces.  ", "Both dishes were mediocre, if not disappointing.  "], "author": "Tyler C.", "review": "This place is always packed during the lunch hour on weekdays!  Both times I've come, I wasn't able to get back to work on time and had to go over my hour for lunch.  The servers are actually really busy, and I see them running around, so it's not for lack of trying.  It's just that they don't have enough people for soooo many customers at lunch.  I actually eat in about 15 minutes or less, so the rest of my lunch hour is spent walking there and back(10 minutes each way), waiting for the food(20 minutes) and ordering/paying for the bill(10 minutes).\n\nMy low rating isn't for the wait time or service though.  While the wait time is super long, it's because they're one of the only options for Chinese in the area, and they're super cheap (lunch specials run from $6 to $8).  The service is actually pretty decent.  The poor waiters are always scurrying around to try to help all of the customers.  The rating is for the food itself...I just feel that the ingredients seem to lack flavor.  I got the kung pao shrimp once, and the shrimp didn't have much taste besides the taste of the sauce.  Plus, it was chopped up rather than being whole pieces, which was a turn off.  It just tasted like the shrimp had been frozen for too long and lost all of it's natural flavor.  I also got the combination chow mein, and once again, the beef and chicken didn't have much taste, besides the flavor from the sauces.  Both dishes were mediocre, if not disappointing.  I do like that they provide a free hot and sour soup with the lunch though.", "rating": 2, "date": "2011-02-03"}, {"excerpts": ["We had the chicken and broccoli which I enjoyed but my wife was not crazy about and the kung pao shrimp which she liked."], "author": "Patrick Z.", "review": "Pretty good but rice was not great.  We had the chicken and broccoli which I enjoyed but my wife was not crazy about and the kung pao shrimp which she liked.", "rating": 3, "date": "2008-07-15"}], "shrimp with string beans": [{"excerpts": ["Tonight, I ordered my favorite dish, Shrimp with String Beans and steamed rice.  ", "The shrimp is tender and the green beans are cooked just right- with a bit of a snap, not soggy.  ", "If you get a chance to dine at any one of their locations, I highly recommend this combination.  ", "The serving was enough for two, so come with a hungry appetite and bring your friends.  ", "Great food for a great price."], "author": "Denny L.", "review": "Henry's Hunan is a small chain of restaurants at different locations throughout the city.  The food is consistent and the prices is reasonable!  Tonight, I ordered my favorite dish, Shrimp with String Beans and steamed rice.  The shrimp is tender and the green beans are cooked just right- with a bit of a snap, not soggy.  If you get a chance to dine at any one of their locations, I highly recommend this combination.  The serving was enough for two, so come with a hungry appetite and bring your friends.  Great food for a great price.", "rating": 4, "date": "2006-04-18"}], "hunan scallops": [], "henrys special": [{"excerpts": ["I ordered Henrys Special pork, usually good, but tonight the spinach was about 90% stems and ", "although I like to eat the entire leaf (and stem) this was too much.  ", "The fried rice does not have the depth of flavor that it used to.  ", "Furthermore, when I mentioned this, they didn't care.  ", "Finally, before I paid my bill they gave me a dollar off.  ", "Thanks, I promised not to spend it in one place.  ", "If they are listening, it is difficult to get to your restaurant now ", "and I worked to get there.  "], "author": "David M.", "review": "I am very disappointed now.  I have been going to this location for the past 5 years or so and have liked it, though noticed inconsistencies for the last year and a half.  Tonight was the worse and I may not go back. I ordered Henrys Special pork, usually good, but tonight the spinach was about 90% stems and although I like to eat the entire leaf (and stem) this was too much.  The fried rice does not have the depth of flavor that it used to.  Furthermore, when I mentioned this, they didn't care.  Finally, before I paid my bill they gave me a dollar off.  Thanks, I promised not to spend it in one place.  If they are listening, it is difficult to get to your restaurant now and I worked to get there.  I don't deserve second best.  \n\nThey even acknowledged the lack of spinach leaf but why didn't they say something.  Time to move on.....", "rating": 2, "date": "2011-01-26"}], "smoked ham hotmild": [], "smoked ham with string beans": [], "martys special hotmild": [], "chicken wiht black bean sauce": [], "chicken with broccoli": [], "garlic chicken": [{"excerpts": ["I asked them why does it take that long to make garlic chicken hoping to get an honest answer that someone dropped the ball, she then replied by saying \"there were a lot of people before me, do you still want your order", "\"  do I want my order? ", "I wanted to burn the place down ", "but that is obviously not an option. ", "And the waitress didn't even apologize. ", "What really happened was she forgot to place my order and didn't have the decency to admit it.  "], "author": "John G.", "review": "I am not a big fan of Chinese \"fast food\", but I am also open to try new things and give places a chance. I am well aware of the lack of customer service of majority of Chinese places I've been too (although some are great) but this one takes first place out of all and really brings it to a whole new level.\n\nI came here for the first time and sat myself in front of the waitress taking orders. I politely asked to see the menu after waiting for some time. After looking at the menu for some time and trying to get eye contact with the waitress getting orders, no one approached me to get my order even though I was in front of the servers, I then politely asked for the server to get my order.  After waiting for 40 minutes, I decided to follow up on my order only to be told that it was going to be another 15 minutes, thats almost an hour of waiting.  I asked them why does it take that long to make garlic chicken hoping to get an honest answer that someone dropped the ball, she then replied by saying \"there were a lot of people before me, do you still want your order\"  do I want my order? I wanted to burn the place down but that is obviously not an option. And the waitress didn't even apologize. What really happened was she forgot to place my order and didn't have the decency to admit it.  Oh well, I guess it goes with out saying that I am never going back to this place again.\n\nDon't expect this place to respect your time so be prepared to wait.", "rating": 1, "date": "2015-08-17"}, {"excerpts": ["The spicy garlic chicken dish I had was just what I was looking for. "], "author": "Gene G.", "review": "The spicy garlic chicken dish I had was just what I was looking for. My wife had the shrimp tofu dish and enjoyed it as well. \n\nNo frills as far as the ambient qualities are concerned. Kind of a plain jane establishment. \n\nThe service was pleasant. \n\nOverall not bad for 7 bucks.", "rating": 4, "date": "2008-07-16"}], "chicken with peking sauce": [], "beef with broccoli": [{"excerpts": ["The beef with broccoli tasted like watered down horse shit. ", "I have no idea how this place is still in business. ", "I mean....", "how the hell can you fuck up Chinese food this badly? ", "Stay away."], "author": "Babys P.", "review": "I would give this place ZERO stars if that were an option. The hot and sour soup was so salty and yeasty that I couldn't force it down. I had one spoonful and I thought I was going to vomit. The beef with broccoli tasted like watered down horse shit. I have no idea how this place is still in business. I mean....how the hell can you fuck up Chinese food this badly? Stay away.", "rating": 1, "date": "2010-05-13"}], "hunan velvet chicken": [], "sliced beef": [{"excerpts": ["I wish I was more adventurous with it, but sliced beef and smoked ham didn't sound appetizing.\n\n"], "author": "Amy D.", "review": "Unfortunately for Henry, I am back on the free wifi in the jury assembly room with plenty of time to review the mediocre lunch I just ate .  Very limited lunch menu.  I wish I was more adventurous with it, but sliced beef and smoked ham didn't sound appetizing.\n\nI ordered a kung pao dish, which had tough meat but good veggies.  Everything was way too salty, including the free soup.\n\nThey have a nice waitstaff, doing the best they can.", "rating": 2, "date": "2009-01-22"}], "chicken with string beans": [{"excerpts": ["And the menu had quite a few good looking items, including chicken with string beans, which was labeled the healthy option. ", "Sounded promising, and when I asked for it to be made without oil, there was no hesitation "], "author": "Jason B.", "review": "I want to give Henry a fourth star. Service was great - host was friendly, and he had no problem with me running to Trader Joe's while they made my food. And the menu had quite a few good looking items, including chicken with string beans, which was labeled the healthy option. Sounded promising, and when I asked for it to be made without oil, there was no hesitation what so ever.\n\nNow I can't say this for certain, but I'm pretty sure my dish was loaded with oil. It was also loaded with chicken, which was awesome, but there is no way something that tasty and smothered in some questionable sauce wasn't overloaded with unnecessary oil. I guess I'll never know, but the suspect nature of what was in my white takeout box limits me to only three stars.\n\nHenry, buddy, if you can refute this, send a shout! Fourth star is waiting.", "rating": 3, "date": "2008-08-08"}], "sauteed deluxe vegetables": [], "country style vegetables": [], "drysauteed string beans": [], "hot  sour vegetables": [], "sauteed eggplant": [{"excerpts": ["12/31 LOL\n\nill tell u what NOT to get:\n\nthe hot and sour soup2/5\nsauteed eggplant 3/5\nfried rice (no taste) "], "author": "Cindy L.", "review": "bad food. but the server was super nice. but bad food\nI went here cus SO was closed 12/31 LOL\n\nill tell u what NOT to get:\n\nthe hot and sour soup2/5\nsauteed eggplant 3/5\nfried rice (no taste) 2/5\nonion cake 0/5\nliling chicken wings 1/5\n\nthese were the dishes we got.", "rating": 2, "date": "2012-01-02"}], "sauteed broccoli": [], "hunan house bean curd": [], "chinese green": [{"excerpts": ["For vegetarians, I strongly recommend their dish called \"Chinese Green,\" which is basically steamed bok choy in a delicious garlic sauce."], "author": "Michael M.", "review": "This place has great, reliable Chinese food. I go here frequently -- it's a block away from where I work. \n\nPrices are decent, and portions are good. It's often very crowded, but you can usually find a table. Only thing to be concerned about: sometimes longer than usual wait times for food during the lunch hour.  \n\nFor vegetarians, I strongly recommend their dish called \"Chinese Green,\" which is basically steamed bok choy in a delicious garlic sauce.", "rating": 4, "date": "2015-02-15"}], "five spiced bean curd": [], "sauteed potato strips": [], "liling bean threads": [], "napa cabbage with chicken": [], "noodles": [{"excerpts": ["In my perfect world the perfect chow mein would be perfectly fried noodles and meat, that's it.  ", "Henry's hasn't perfected the Chicken Chow Mein of my perfect world, but they've come pretty darn close.  ", "With the version at Henry's (pictured) you'll find an occasional bean sprout, a tiny bit of shaved carrot, a single sliver of onion and a little green onion to go with a large portion of noodles and cubes of all white meat chicken.  ", "If you like noodles and meat, you're going to like the chow mein at Henry's, and because it is a Hunan restaurant you can bet that your food will be effectively spicy.\n\n"], "author": "Wilhelm Y.", "review": "In my perfect world the perfect chow mein would be perfectly fried noodles and meat, that's it.  Henry's hasn't perfected the Chicken Chow Mein of my perfect world, but they've come pretty darn close.  With the version at Henry's (pictured) you'll find an occasional bean sprout, a tiny bit of shaved carrot, a single sliver of onion and a little green onion to go with a large portion of noodles and cubes of all white meat chicken.  If you like noodles and meat, you're going to like the chow mein at Henry's, and because it is a Hunan restaurant you can bet that your food will be effectively spicy.\n\nThat's another beautiful thing at Henry's Hunan.  If you can't handle the heat the kitchen will be more than happy to season your food to your preferred spicyness or mildness should that be the case.\n\nI often get carried away with ordering food and end up over-eating instead.  Seriously, one order of chow mein and a beverage will fill you up, but I had to try the Dumplings too.  My server was seated at a table folding these when I walked into the restaurant; one look at the ingredients was enough to convince me to try these.  They're just like potstickers with a lean pork filling with just a bit of cabbage and ginger, but instead of being pan-fried crisp on one side these are steamed then presented in a bowl with a light, spicy soy sauce and chopped scallions (also pictured).  The dumplings were very good.\n\nThe service was excellent, but I went there during an off-peak hour so I was the only diner there at the time.  Inexpensive and less than two blocks from my work, I wonder why I haven't eaten here more often.  In my perfect world I will.", "rating": 4, "date": "2007-12-22"}, {"excerpts": ["Skip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM."], "author": "Gwynnie P.", "review": "So, I see what happened. So, a child of San Tung opened up right next door to this Henry's Hunan location and appears to have killed the HH lunch business. So how mean!\n\nSkip the trendier So and enjoy a delicious meal at Hunan, with hearty portions and all the great dishes like Diana's Meat Pie, Cold Chicken Noodles, Bean Sprout Salad, Dumplings.......YUM.", "rating": 4, "date": "2010-03-26"}, {"excerpts": ["Dude, where else can you get the biggest bowl of noodles, veggies, meat, and black bean sauce in the world for like $6? ", "That said, I think I'll stick to the rice plates next time, but ", "huge props for providing value. "], "author": "Josh K.", "review": "Dude, where else can you get the biggest bowl of noodles, veggies, meat, and black bean sauce in the world for like $6? That said, I think I'll stick to the rice plates next time, but huge props for providing value. I took about 80% of the noodle bowl home, refried it with garlic, mushrooms, and an egg, and it was lunch for two!\n\nHope it stays open, it looks like SO is sharking some of their business. It's a solid 3 star from me and I hope to keep it in my lunch rotation whenever I'm working from home.", "rating": 3, "date": "2010-05-19"}, {"excerpts": ["The food took a little too long to prepare, the noodles I got (with pork sauce) were oookay (not enough flavor), and to top it off, I found a piece of plastic the size of a quarter in my dumpling.\n\n"], "author": "Leslie C.", "review": "I was originally going to go to SO next door, but they were closed for Spring Break.  Against my coworker's warning, I went to Henry's Hunan instead.  \n\nThe food took a little too long to prepare, the noodles I got (with pork sauce) were oookay (not enough flavor), and to top it off, I found a piece of plastic the size of a quarter in my dumpling.\n\nI've had good food at other Henry's Hunan restaurant locations, but I was disappointed by this one.  Next time I want Chinese food at work, I'll be trying out SO.", "rating": 3, "date": "2013-04-05"}, {"excerpts": ["Could eat there noodles all day !! "], "author": "Xavior G.", "review": "There spicy food is spicy OK???  Thats good..  There chicken tastes like chicken..  There salad???  Like salad.  They do it all right and for a good price and thats good cause its San Fran..   NO BODY wants to pay millions of bucks for chow fun.. \n\nCould eat there noodles all day !! Spilled some on my pants eating in the truck but there not to greasy so it didn't stain haha !! \n\nGoing back here alot from now on so you could find me here some times..  Say HI or you could be a wiredo staring to I guess..", "rating": 4, "date": "2011-07-18"}, {"excerpts": ["Noodles", ": I'm not sure exactly what this dish is called, but I know it's noodles with spicy ground pork and lettuce?? ", "It's one of my favorites, but then again, I'm a really big fan of noodles. \n\n"], "author": "Alison N.", "review": "OMG, one of my faves. \n\nIt's funny...I've never really been a picky eater, but growing up one of the few things I couldn't eat was spicy food...but as I've gotten older I've learned to handle myself better and as a result...this is now one of my favorite restaurants. \n\nMy mom used to come here when they had their location in Chinatown and so, naturally, she introduced both me and my brother to their food. \n\nThings to try: \n\nDiana's pie: yes, it is greasy, but IT IS TOTALLY worth it. My brother is a...how should I say...purist, and refused to eat anything greasy or oily to be more healthy (funny, I should be doing that...not him) BUT even he is willing to eat this dish. It has spicy ground pork, lettuce, and some fried, crispy top and bottom. Please try it! \n\nNoodles: I'm not sure exactly what this dish is called, but I know it's noodles with spicy ground pork and lettuce?? It's one of my favorites, but then again, I'm a really big fan of noodles. \n\nMarty's special and Henry's special: I think one of them has scallops, chicken, and ham? All in a spicy sauce....which a delicious! And the other is ham and some veggies?? It's more smoky in flavor....both of these are pretty good. \n\nMy mom said Marty was another brother or son or some family member....my cousin made the general rule of thumb that if it's named after the restaurant it HAS to be good...and I feel like this is accurate! \n\nIf you're not a fan of spicy, don't come here...or ask for super super mild things. Obviously, if you're a health freak or on a diet...don't come here either...this is greasy, but good and hearty Chinese food.", "rating": 5, "date": "2012-07-19"}, {"excerpts": ["It's a block from my job, and they have great noodles. ", "Nothing amazing in ", "that it's just simple Hunan food, but I find myself craving this place all the same. ", "I'm going to take my brother there tomorrow ", ":) I need to try some of the other dishes on the menu, but for now I'm sticking with the noodles and of course the MEAT PIE. ", "Yes, I said Meat Pie "], "author": "Peter F.", "review": "I love coming here for lunch. It's a block from my job, and they have great noodles. Nothing amazing in that it's just simple Hunan food, but I find myself craving this place all the same. I'm going to take my brother there tomorrow :) I need to try some of the other dishes on the menu, but for now I'm sticking with the noodles and of course the MEAT PIE. Yes, I said Meat Pie and I'm not referring to English pub-grub. \n\nGet down, SF. Get down.", "rating": 4, "date": "2010-12-14"}, {"excerpts": ["For office workers looking for a lunch place: if you can wait, go to SO noodles next door - it's crowded at lunch hour; if you can't, go to the McDonalds by the Hall of Justice. ", "Just don't eat here. ", "I tried their smoked pork and twice-cooked pork. ", "Both were dry and hard to chew. "], "author": "YM L.", "review": "For office workers looking for a lunch place: if you can wait, go to SO noodles next door - it's crowded at lunch hour; if you can't, go to the McDonalds by the Hall of Justice. Just don't eat here. I tried their smoked pork and twice-cooked pork. Both were dry and hard to chew. I like their location on Natoma, but this one sucks.\n\nI am changing my rating from 2 stars to 4 stars. My recent experience has been good.", "rating": 4, "date": "2010-11-08"}, {"excerpts": ["I love the meat pie and noodles with pork meat and Hunan special sauce."], "author": "Brian C.", "review": "One of my favorite Chinese restaurants.  Decent prices.  I love the meat pie and noodles with pork meat and Hunan special sauce.", "rating": 5, "date": "2011-07-01"}, {"excerpts": ["Personally prefer Chow Fun (wide) style rice noodles, but unless they are fresh and cooked properly (not an easy thing to find) they can be yucky\n\nDecent size seating area\nVery hole-in-the-wall-esque, nothing fancy\nNot the type of place you'd want to bring a date to impress, unless you're a take out and movie at home type of gal, in that case, u need to contact me immediately :)\n\n"], "author": "G K.", "review": "Decent, flavorful Chinese food in outer SoMa\nGot the shredded pork Chow Mein, appropriate spice levels, tasty and needed nothing\nPersonally prefer Chow Fun (wide) style rice noodles, but unless they are fresh and cooked properly (not an easy thing to find) they can be yucky\n\nDecent size seating area\nVery hole-in-the-wall-esque, nothing fancy\nNot the type of place you'd want to bring a date to impress, unless you're a take out and movie at home type of gal, in that case, u need to contact me immediately :)\n\nWill go back for lunch sometime, when the mood strikes\n\nTIP: no w i f i there (yes put the spaces so non searchable)", "rating": 4, "date": "2008-03-17"}, {"excerpts": ["To balance out the greasy meat oreo (or so the logic works in my head), I always ordered the cold chicken noodles -- chicken, noodles, julienned cucumbers and peanut sauce. ", "Good stuff."], "author": "Law W.", "review": "Another lunch staple of my SOMA working days. Never could understand why we came here so much cuz there's nothing special about this place -- probably cuz I worked with a bunch of Bok-gwai (white people). However, they did have this meat pie thingy -- 2 deep fried onion pancakes filled with meat. Damn greasy but damn good. \n\nTo balance out the greasy meat oreo (or so the logic works in my head), I always ordered the cold chicken noodles -- chicken, noodles, julienned cucumbers and peanut sauce. Good stuff.", "rating": 3, "date": "2008-05-30"}, {"excerpts": ["Thankfully, the Dry-Sauteed String Beans and Tofu with rice noodles and vegetables brought relief.\n\n"], "author": "Sam T.", "review": "Henry's Hunan reminds me of the chinese restaurant at the end of A Christmas Story.\n\nAlthough the restaurant is located next to the freeway, it has that hole in the wall feel. And the staff might sing you Deck the Halls, while decapitating a roast duck right in front of you.\n\nThe food is hit or miss on a lot of occasions.  The Hunan Smoked Ham with Vegetables was insanely salty; compounded with the heat that the dish was packing, I was ready to dunk my head into a trough of water. Thankfully, the Dry-Sauteed String Beans and Tofu with rice noodles and vegetables brought relief.\n\nAlthough the scallop and shrimp dishes were nothing special, the Orange Chicken and the Beef with Vegetables were two of the better ones on the menu.", "rating": 2, "date": "2007-11-05"}, {"excerpts": ["Their braised cod fillets, smoked ham & string beans, and noodles and pork sauce are to die for! ", "i can't say enough about this place.. ", "we get take-out at the office and they are always friendly with us since we're regulars. ", "they even offer us discount coupons here and there!!!!!! ", "talk about customer service and keeping their customers happy! ", "their dishes are delicious, plentiful, and a lot of bang for your buck! ", ":) you won't be disappointed!"], "author": "Danielle C.", "review": "HOT & SOUR SOUP (MY FAVE) is a MUST HAVE, especially in our SF FOG WEATHER! Their braised cod fillets, smoked ham & string beans, and noodles and pork sauce are to die for! i can't say enough about this place.. we get take-out at the office and they are always friendly with us since we're regulars. they even offer us discount coupons here and there!!!!!! talk about customer service and keeping their customers happy! their dishes are delicious, plentiful, and a lot of bang for your buck! :) you won't be disappointed!", "rating": 5, "date": "2011-11-28"}, {"excerpts": ["Ordered some chicken, beans and noodles.  "], "author": "anthony l.", "review": "NASTY.  \n\nWent there because it was within walking distance for lunch.  Bad Idea.\n\nOrdered some chicken, beans and noodles.  Greasy and bland.\n\nWe would have been better off going to McDonalds next to the 850 Bryant-and that says a lot.", "rating": 1, "date": "2008-01-04"}, {"excerpts": ["Favorites are the eggplant salad and cold spicy noodles."], "author": "Kasima T.", "review": "Great for lunch.  Doesn't offer the typical crappy chinese food menu, which is refreshing.  Though some dishes are pretty one-dimensional in flavor.  Favorites are the eggplant salad and cold spicy noodles.", "rating": 4, "date": "2008-11-18"}], "chicken beef or pork chow mein": [], "combo chow mein": [{"excerpts": ["Lastly, the combo chow mein I had was so oily ", "I picked out the chicken and shrimp bits and just ate that."], "author": "Leina K.", "review": "I made the mistake of not calling SO before heading over. When they were closed I made the second mistake of the day and settled for Henry's next door. \n\nDon't make the same mistake!\n\nService was pretty horrible when we needed to ask for small plates and utensils to eat the food we had ordered. On top of that, employees were blatantly on their phones every second they weren't actually working. \n\nLastly, the combo chow mein I had was so oily I picked out the chicken and shrimp bits and just ate that.", "rating": 1, "date": "2015-02-07"}], "sliced hunan smoked ham  vegetables": [], "sliced beef  vegetables": [], "sliced bief bean curd  vegetables": [], "diced chicken minced garlic  vegetables": [], "chicken beef or pork fried rice": []}