{"onion cake": [{"excerpts": ["- The onion cake (yes, CAKE, not cakes) was different from what I'm used to, a more brown deep-fried style pancake, with very little spring onion popping out from the skin, but more buried within the layers. ", "Tasty, but kind of wished it came with a dipping sauce. "], "author": "Tom T.", "review": "More like 3.5 stars, but I gave it the extra .5 star because of service.\n\nA good friend (which I like to call her one of my sisters from another mister) drove up from San Jose and wanted to try out a place. First off, we wanted to go somewhere cheap but not quality wise. Second, we didn't want to venture off TOO far from Downtown San Francisco. Also, we both didn't have a chance to check Yelp for any good places around, so we did something DARING, we just wandered around until we found something good.\n\nWe first went to Kyo-Ya, because her GPS system recommended it, but saw it was a bit out of price range. As we were ABOUT to head to Tempura House, we found this hole-in-the-wall and debated about it for a while. She did ask me if Chinese food was okay, and I flat out said, \"I'll eat anything, just to get Yelp review.\"  And so we took our chances.\n\nAt first glance, we thought it was PRETTY dead, until we got seated in the back, which had a decent amount of people at tables. Taking our chances again, we ordered the Hunan Velvet Chicken (I decided on this dish because of the vegetables and \"velvet\" drew me towards this) and the Hot and Sour Pork (my friend is always in the mood for hot and sour entrees). Also, we ordered the onion cakes, because my friend wanted one.\n\nMy friend did ask me how the decor was. I said that it has a cozy atmosphere, a bit grungy, but cozy, even with the steel pillars running perpendicular to the floor made it cozy. Also, she did point out the fact that the kitchen was in plain view, with nothing blocking the way of how the chefs made our dishes.\n\n- The onion cake (yes, CAKE, not cakes) was different from what I'm used to, a more brown deep-fried style pancake, with very little spring onion popping out from the skin, but more buried within the layers. Tasty, but kind of wished it came with a dipping sauce. (It might be a Hunan region thing, but I'm not 100% sure).\n\n- The velvet chicken had an interesting taste. The veggies that came with it was delicious, but the chicken itself was kind of bland. Kind of wished that the chicken was marinated beforehand with the sauce that the dish came with; would have made the dish better.\n\n- The hot and sour pork was mixed. My friend said that she didn't like it so much, because it was deep fried a bit TOO long. At first, I didn't noticed it, since I'm LOVE fried things (like tempura, donuts, french fries, etc.) but I did see where she was coming from. The pork was left in the fryer a bit TOO long, because I did taste some burnt pieces here and there. Sauce was good, and plenty of veggies.\n\nI do like the fact the waiters were attentive, asking how our meal was and offered to refill our rice bowl when it gone empty.\n\nPrices were a little bit on the higher scaled, in comparison to what I'm used to in Los Angeles, but I do understand that San Francisco tends to be a bit more expensive.\n\nSomething that I don't see everyday, the fortune cookie is in a jar, and you have to use tongs to fish one out. My friend and I got one, and was surprised that it wasn't under or over baked. However, it could from the place they get their shipment from, not because they make the cookies themselves.", "rating": 4, "date": "2011-08-26"}, {"excerpts": ["I used to come to the Kearny Street hole-in-the-wall every day, when I was an office drudge in 1979-81, for the smoked ham rice plate and onion cake.  ", "They were the best part of my day back then, and this remains one of my favorite meals in memory.  ", "For old time's sake, I ordered these.  ", "While the rice plate is still good, it didn't seem as delicious as in the old days.  ", "The service was excellent, considering the much larger size of the place, but it has grown impersonal with the frosty hostess as gatekeeper.  ", "In 1980, at the old place, two thieves stole my wallet out of my purse during lunch, and the cashier could not have been more helpful.  ", "I think I paid for my lunch the next time I came in.  ", "I don't know if Mr. Chung is still the owner, but I missed the warmth of Kearny Street during yesterday's visit."], "author": "Lemora M.", "review": "I ate here yesterday after an absence of about 35 years.  I used to come to the Kearny Street hole-in-the-wall every day, when I was an office drudge in 1979-81, for the smoked ham rice plate and onion cake.  They were the best part of my day back then, and this remains one of my favorite meals in memory.  For old time's sake, I ordered these.  While the rice plate is still good, it didn't seem as delicious as in the old days.  The service was excellent, considering the much larger size of the place, but it has grown impersonal with the frosty hostess as gatekeeper.  In 1980, at the old place, two thieves stole my wallet out of my purse during lunch, and the cashier could not have been more helpful.  I think I paid for my lunch the next time I came in.  I don't know if Mr. Chung is still the owner, but I missed the warmth of Kearny Street during yesterday's visit.", "rating": 4, "date": "2016-12-21"}, {"excerpts": ["Favorite is hot and sour chicken and onion cake."], "author": "Anil K.", "review": "I give it 4 star and have been going there for a very long time. Disappointed that they will be closed on Saturdays from July onwards. I will have to go the one on Sansome.  Favorite is hot and sour chicken and onion cake.", "rating": 4, "date": "2015-07-12"}, {"excerpts": ["fried rice, onion cake and soup."], "author": "Satyam S.", "review": "all good. i love spicy fish here. i also like veg. fried rice, onion cake and soup.", "rating": 5, "date": "2016-03-02"}, {"excerpts": ["Order the onion cake...", "it's phenomenal.\n", "Try to show up a little early for lunch, as the lines are long. ", "The service is a bit on the slow side, but the food more than makes up for it."], "author": "KebabKing ..", "review": "\"????!\"\nThat's Chinese for \"Spicy and delicious!\" I love the Hunan. Any food that comes to your table with red chilies sticking out of it has to be good. Their daily specials are really yummy (the Monday Kung Pao Chicken special is especially recommended). The string bean dish is also a hit. Order the onion cake...it's phenomenal.\nTry to show up a little early for lunch, as the lines are long. The service is a bit on the slow side, but the food more than makes up for it.", "rating": 4, "date": "2007-10-25"}, {"excerpts": ["I usually don't order the Onion Cake because I love the other three appetizers so much, but it is a favorite of many of my friends and so I get treated to it now and again. \r\n\r\n", "For entrees I've had several Tofu dishes, Black Bean Chicken, and several variants of the Chow Mein noodle dishes (yes, I mean the good kind). ", "But my two favorite dishes are the \"String Beans and Shrimp\" and the \"Shrimp & Chicken Chow Mein\". ", "The String Beans and Shrimp has a spicy garlic and black bean sauce, isn't stingy on shrimp, and can pack quite a kick ", "so I generally ask for it served mild ", "so my mouth doesn't burst into flames or even worse; the lower part of my digestive track. ", "However, the Chow Mein also has a little kick, but never anything to be worried about. ", "And because I love Chicken and Shrimp above all things else in this great world, I just cut right to the chase whenever I order it. ", "I have tried a number of other dishes and I think they are all pretty good. ", "But in general I try to avoid the fried dishes like Orange Chicken or \"Sweet and Sour [insert meat type here]\" because they tend to be very heavy on the breading. ", "But if you want a real professional view, check out Greasepig who has been visiting Henry's Hunan for years and has given almost every dish in the place a 10 point scale review http://greasepig.com/henrys/\r\n\r\n", "There is one thing you should be aware of when you're in a group of three or more people. ", "My friends and I believe that there is an ancient Chinese curse placed on one random person whenever you have more than two at your table. ", "For some reason, almost every time a group of us goes, one lucky person always winds up waiting 10 or more minutes longer for their dish. ", "To be honest, it may actually only be 5 minutes, but when you're hungry, and all your friends are stuffing their faces, and then you realize you're \"that person\"", ", it feels like a heck of a long time. ", "Fortunately the food is so good, you'll forget about the curse until the next time it happens..."], "author": "George L.", "review": "Although I hear from all my Chinese friends that the food here is not \"true\" Hunan style, for the price I still feel that it's one of the best places to eat Chinese in the downtown San Francisco area. And as my family says, \"It is what it is.\" So get on line and enjoy their delicious food for what it is - Hunan or not.\r\n\r\nAnd let me preface this review by saying that I grew up on \"Chow Mein\" from Staten Island, New York in the 70's and 80's. And that I personally was very surprised to find that \"Chow Mein\" on the West Coast was a fresh noodle dish (no, I'm not kidding). Our \"Chow Mein,\" as it was called, was more like a soupy mix of onions, celery, sprouts, and pork strips which you would clump on top of a plate of rice and then sprinkle dry, short, Chinese noodles on top of. Like Chinese croutons of a sort. Anyway, I've come a long in the past 16 years and have become very picky about my Chinese food no matter what style it claims to be (Although I secretly am still curious about those dry, flat, crouton-like noodles and where I can get some).\r\n\r\nAnyway, as with any new restaurant I was a bit skeptical the first time I entered Henry's Hunan at 110 Natoma Street in downtown San Francisco. While waiting on the long line to get in, I read most of the plaques and awards on the wall but I stopped on one and squinted my eyes a bit. Then it registered, \"Oh my gawd! That's Don Johnson!\" WTF?!? Then the line moved quickly and we sat down at a large round table. The waiters are quick and there in minute or two and soon we were eating Spring Rolls and Dumplings. Minutes later, our food orders arrived and before we knew it we were nearly licking our plates trying to get just one more taste before we had to go back to work. It was a pleasant dining experience over all.\r\n\r\nAll that said, I've been eating at Henry's on and off for the past few years and here's the skinny on the place. First of all if you want to avoid the lunch lines you should go either before 12 noon or after 1PM. Parties of two usually get pulled quickly from the line and sat first, but large parties of five or more usually don't wait that much longer as the line moves pretty fast due to their large lunch room (notice I didn't call it a dining room; that's because it has more of a lunch room feel than an actual dining room).  \r\n\r\nOnce seated you'll probably wonder what you should order. For two people, I recommend splitting two appetizers and one entree as the dishes tend to be pretty hearty. That generally that will run you around $25 with tax and tip included. As for which appetizers definitely try the Hot and Sour Soup. It's pretty hearty and has great spicy undertones and a \"small order for two\" will get you both about two bowls each. The Spring Rolls are also a favorite of mine as they are made fresh and delicious. One order is three spring rolls cut in half (six halves). The Dumplings (6 served) are served more like pot-stickers, come in a mid sized bowl, and are also pretty darn good. I usually don't order the Onion Cake because I love the other three appetizers so much, but it is a favorite of many of my friends and so I get treated to it now and again. \r\n\r\nFor entrees I've had several Tofu dishes, Black Bean Chicken, and several variants of the Chow Mein noodle dishes (yes, I mean the good kind). But my two favorite dishes are the \"String Beans and Shrimp\" and the \"Shrimp & Chicken Chow Mein\". The String Beans and Shrimp has a spicy garlic and black bean sauce, isn't stingy on shrimp, and can pack quite a kick so I generally ask for it served mild so my mouth doesn't burst into flames or even worse; the lower part of my digestive track. However, the Chow Mein also has a little kick, but never anything to be worried about. And because I love Chicken and Shrimp above all things else in this great world, I just cut right to the chase whenever I order it. I have tried a number of other dishes and I think they are all pretty good. But in general I try to avoid the fried dishes like Orange Chicken or \"Sweet and Sour [insert meat type here]\" because they tend to be very heavy on the breading. But if you want a real professional view, check out Greasepig who has been visiting Henry's Hunan for years and has given almost every dish in the place a 10 point scale review http://greasepig.com/henrys/\r\n\r\nThere is one thing you should be aware of when you're in a group of three or more people. My friends and I believe that there is an ancient Chinese curse placed on one random person whenever you have more than two at your table. For some reason, almost every time a group of us goes, one lucky person always winds up waiting 10 or more minutes longer for their dish. To be honest, it may actually only be 5 minutes, but when you're hungry, and all your friends are stuffing their faces, and then you realize you're \"that person\", it feels like a heck of a long time. Fortunately the food is so good, you'll forget about the curse until the next time it happens...", "rating": 4, "date": "2006-10-19"}, {"excerpts": ["My favorites are House Bean Curd, Dumplings, Onion Cake, Chicken Salad and of course Hunan Bacon(now off the menu)"], "author": "Monica H.", "review": "my friend introduced me to this location in 2000. LOVE IT! the family and staff are very friendly and just nice people. Frank always takes care of me and remembers my favorites. We go every Tuesday for lunch and the whole staff smiles and says \"hello, Monica, is Katie coming?\", haa.  The food is YUMMY IN MY TUMMY! Tonight I had what will probably be my last order of Hunan Bacon :(. They decided to take it off the menu because people were complaining that is was too fatty or hot, silly people. It's an excellent dish and if you order something with \"Hunan\" and \"bacon\" in the title, well you should expect fat and chili peppers! But, I digress, the food is wonderful and cooked fresh to order. Many dishes have lots of ginger, mmmmm. My favorites are House Bean Curd, Dumplings, Onion Cake, Chicken Salad and of course Hunan Bacon(now off the menu)", "rating": 5, "date": "2008-07-09"}], "dianas special meat pie": [], "shredded pork  celery": [], "bean curd": [{"excerpts": ["My favorites include the Henry's Special, Kung Pao Shrimp, Five Spiced Bean Curd, chow mein and hot & sour soup.  "], "author": "Garrett D.", "review": "I have been going to Henry's Hunan for over 15 years now and am just getting around to writing a review.  Delinquent, I realize.  But this place is excellent.  My friends and I try to hit it up about once a month for lunch during the week and it always delivers.  I recommend going at 11:45 or 1:00 to avoid the rush and some long wait times, but if you have a small group of 2-4, you can usually get seated rather quickly. \n\nMy favorites include the Henry's Special, Kung Pao Shrimp, Five Spiced Bean Curd, chow mein and hot & sour soup.  Great dishes, pretty fast service and a good atmosphere for a large windowless room.\n\nI have been to all of the other locations as well and this one is my favorite.", "rating": 4, "date": "2014-02-04"}, {"excerpts": ["We ordered a bunch of different dishes to eat family style (onion pancakes, bean curd, string beans, eggplant, veggie chow mein, harvest pork, etc). ", "All of the dishes are vibrant, generous portions of chili peppers (you can ask for it to be mild), and rich in flavor. ", "My favorites were the harvest pork, bean curd and onion pancakes. ", "The only dish that fell short for me was the veggie chow mein - it tasted like electricity. ", "Yes, you read that right. ", "After telling my fellow guests that, they tried another bite and agreed. "], "author": "Stella C.", "review": "I had no idea this place existed, I rarely ever go out to buy Chinese food but so glad to have found this place. I love Hunan food, known for its liberal use of chili peppers, garlic and occasional use of black bean sauce. All my favorites!\n\nMy coworkers and I came here for lunch, we made a reservation for 14 and they had no problem accommodating us (even when 14 turned into 10). When we arrived, our table was ready. We ordered a bunch of different dishes to eat family style (onion pancakes, bean curd, string beans, eggplant, veggie chow mein, harvest pork, etc). All of the dishes are vibrant, generous portions of chili peppers (you can ask for it to be mild), and rich in flavor. My favorites were the harvest pork, bean curd and onion pancakes. The only dish that fell short for me was the veggie chow mein - it tasted like electricity. Yes, you read that right. After telling my fellow guests that, they tried another bite and agreed. It's not a burnt taste, it's a gasoline-like taste. \n\nWe ended up being filled to the brim, spent approx $12/person including tax and tip and had so much food leftover that we could feed maybe 3 other people. It was cheap, delicious and a good lunch. Thank you for taking good care of us Henry Hunan! I will definitely be back and I must try the famous meat pie next time.", "rating": 4, "date": "2012-01-27"}, {"excerpts": ["Okay, so I have had a number of the items on the menu and have liked each and every one of them, with a special love for the dumplings, Marty's Special, and the Hunan house bean curd. ", "I love my tofu and Henry's makes some awesome tofu dishes with just the right level of heat. "], "author": "Karim V.", "review": "My first time eating here was back in 2003 or 2004; I had eaten at another location before, but this one has been my go-to for years (same for many ex-coworkers of mine). \n\nOkay, so I have had a number of the items on the menu and have liked each and every one of them, with a special love for the dumplings, Marty's Special, and the Hunan house bean curd. I love my tofu and Henry's makes some awesome tofu dishes with just the right level of heat. The chicken fried rice is solid, as are the kung pao chicken and the chicken with black bean sauce plates. And one of my old favorites is the noodles w/pork meat sauce and Hunan special sauce...yummylicious.\n\nThe service isn't always great, but that doesn't bother me. I mean seriously, I see some hole in the wall places get high marks and we know how terrible the service is at those spots, yet the food is amazing so it gets a pass fine. I never remember the name of the gentleman who cashes people out, but he has always been great and remembers names like a human rolodex. \n\nThis is the restaurant I missed the most when I moved away to Seattle for a spell. I'd visit SF and swing by Henry's for some grub and it always hits the spot. Plus, Chinese/Hunan food in Seattle is TERRIBLE, with the exception of O'Asian. That wasn't nice of me, so I will end this review and go sit in the corner.", "rating": 5, "date": "2013-03-01"}, {"excerpts": ["All of their specials are good; kung pao chicken, curry chicken, beef with bean curd and even their fried rice. "], "author": "Laxme G.", "review": "Another regular spot for lunch downtown. All of their specials are good; kung pao chicken, curry chicken, beef with bean curd and even their fried rice. Throw some of their signature spicy oil on your dish and that's the cherry on top.\n\nBeat the wait, come early before noon or wait till after the lunch rush.", "rating": 4, "date": "2012-02-04"}, {"excerpts": ["Tonight we ordered:\n\nGreen Beans w/ Bean Curd\nGarlic Chicken\nHot and Sour Soup\n"], "author": "Sonya D.", "review": "Ok so other people rated this place really low, but I totally disagree. It's so yummy! It's also super cool because it is right next to 111 Minna, yay! \n\nTonight we ordered:\n\nGreen Beans w/ Bean Curd\nGarlic Chicken\nHot and Sour Soup\nAnother soup w/ ear mushrooms (?)\nDumplings\nSide of rice\n\nEverything was super tasty and the portions were quite large. We ordered two SMALL soups, and they were definitely not small...more like large? We got several small bowls filled from each one, and they only cost $4.50! Cheap much? The Hot and Sour soup was especially good, and totally warmed me up from the freezing rain outside. \n\nEverything was great, and we'll definitely be back!", "rating": 4, "date": "2011-05-17"}, {"excerpts": ["bean curd and marinated pork was ok\nbeef and picked pepper was ok"], "author": "Diane W.", "review": "bean curd and marinated pork was ok\nbeef and picked pepper was ok", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["I prefer only the dishes that have meat, rice, bean curd, tofu, or vegetables. "], "author": "Tim B.", "review": "I've now been there 8 or 9 times, and I've got to say: the place has grown on me. No, not in the \"honey, what's that on your neck?\" kind of way. \n\nThis is in the good way.\n\nThe food is consistently good, they will heavily spice it up on request (and believe you me: I do request them to do it), and there's a good enough variety on the menu that I've never had to have the same combo of stuff twice. Service is pretty quick (even during the busy lunch). I leave with hunger satiated and wallet not totally emptied.\n\nDo I have any particular favorites? I prefer only the dishes that have meat, rice, bean curd, tofu, or vegetables. Or some combination of those.\n\nYeah, I'm that picky. bwahaha", "rating": 4, "date": "2010-05-07"}, {"excerpts": ["Some favorites are the spicy shrimp with bean curd, braised fish balls with vegetables, and the homestyle plate of pickled vegetables (I forget the exact name of the dish).  "], "author": "Alison M.", "review": "This location is tucked away in a neat little alley.  Going here feels a little seedy, and I feel like I've found something secret!\n\nPretty decent as far as Chinese food goes, especially if you like things spicy.  Some favorites are the spicy shrimp with bean curd, braised fish balls with vegetables, and the homestyle plate of pickled vegetables (I forget the exact name of the dish).  You can get a lot of food for $10.\n\nQuality and service have been consistent every time I come here.  I recommend going at night when the place is dead, since it can get really crowded at lunch.", "rating": 3, "date": "2010-09-10"}, {"excerpts": ["My faves are the Garlic Chicken, Spicy Shrimp with Bean Curd and Braised Rock Cod. \n\n"], "author": "Donna V.", "review": "I like Henry's Hunan! Okay, so it isn't the best Chinese food around but it's close to the office and the service may not always be fast but it's always friendly- the staff is really nice! I've had a few dishes I haven't been crazy about but they have some really great ones too. My faves are the Garlic Chicken, Spicy Shrimp with Bean Curd and Braised Rock Cod. \n\nAlso, how can you not like a place that features a dish called Diana's Meat Pie on the menu??!!!", "rating": 3, "date": "2007-03-05"}, {"excerpts": ["Such fantastically delicious is the spiciness that the hunan house bean curd (say 25 times hot) "], "author": "ryan c.", "review": "Indeed, Henry's Hunan is the 'best Chinese restaurant in the world.' as it's often called. While some insist upon quoting the original scripture here in support, others maintain to this day that it is the best - despite the fact that in 1976 \"The New Yorker\"  called it the 'best Chinese restaurant in the world!'\nSo...\nBest known for being called the best Chinese restaurant in the world for the fourth consecutive decade, Henry's Hunan serves foods so delectable, so sublime as to render such prior discourse concerning its relative merits so crude in its reliance upon comparative terms that speak nothing to this experience. Such fantastically delicious is the spiciness that the hunan house bean curd (say 25 times hot) offers that to call it the best in San Francisco understates the point.\n\nReligious allusions and allegories usually aid clarity. So, to flesh out this point with an allegory: when faced with religious epiphany, those so inclined are apt to speak of their god's glory, etc. - and not the relative merits of this god compared to the other gods, and thereby eschewing the \"first commandment\" in exodus wherein the ineffable god goes on record insisting upon being #1 and that everyone hold all the other gods as second fiddles at best.  Although widely criticized for this shrewd move (not least of all those looking to improve the fiddle section), it seems almost quaint now in its understatement and has over time garnered much praise (even among monotheists, to whom it clearly does not apply): Firstly, for its role in providing much-needed filler in what's become the top all-time top-ten list - The Ten Commandments, and secondly for its role in silencing dissent.\n\nSo, much like the religious experience trivializes religious texts, so too does such an experience at Henry's Hunan trivialize not only the claim to being the \"world's best,\" but renders such commentary irrelevant.\nSo, goodbye New Yorker\nand Hello Henry's Hunan!", "rating": 5, "date": "2006-09-20"}, {"excerpts": ["Bean Curd & Meat Sauce\nKung Pao Pork - Hella Spicy\nCurry Chicken \nBeef & String Beans\nHot & Sour Beef\n\nFor those that are truly insane, get the Henry's Bacon.  "], "author": "Nate B.", "review": "This place is insanely amazing.  My favorite downtown lunch spot for the past 10 years.  A necessity at least once or twice a month.  For in house dining, get there before 12 or prepare to wait.  For take out, call it in, they have daily rice plate specials. \n\nSalty...Yes.  Greasy...Yes.  Hot & Spicy...Yes, even hotter if you request it.   Tasty...Hell Yes!\n\nThis is place is a haven for white people craving the tasty spicy hot goodness.  According to people on other reviews, this is not \"real Chinese food\".  If that is true, then I don't want \"real Chinese food\".  I want my Henry's Hunan.  I've also been here with people from China, non-Hunan province, and they also have enjoyed it.\n\nThis place makes my bald spot sweat and my fat belly swollen...and I love it.  A true feast with friends every time I go.  We believe there is a Dragon in the kitchen emptying his special sauce onto every plate.  That is why it tastes so good!\n\nI recommend the following:\nEliza's Meat Pie - An appetizer must (Think Taco Bell's Mexican Pizza they used to have back in the day, but better tostada, no beans,  and better)\nBean Curd & Meat Sauce\nKung Pao Pork - Hella Spicy\nCurry Chicken \nBeef & String Beans\nHot & Sour Beef\n\nFor those that are truly insane, get the Henry's Bacon.  Basically, part of the stomach of a pig in a bowl of broth.  This is not like any bacon we were used to.  Prepare for the staff to stand around and watch you eat it and keep asking if you like it.  Nod, smile, and force it all down.\n\nSack up and eat what the Dragon has cooked up for you.", "rating": 5, "date": "2007-09-26"}, {"excerpts": ["In 1974 Henry Chung founded his first Hunan restaurant in SF, bringing his own spin to dishes like Bean Curd with Meat Sauce, completely addictive and not  simple at all. ", "The pot stickers are Gyoza style. ", "I guarantee that you won't find this level of delicacy, complexity, and thrift outside China or at least Flushing, Queens. ", "Diana's Special Meat Pie is enough for two people, and I heart the chicken salad. ", "Some anonymous internet jokesters scoff at the service, but do you really need somebody asking how you're doing every two and a half minutes? ", "Get help!"], "author": "Jennifer W.", "review": "In 1974 Henry Chung founded his first Hunan restaurant in SF, bringing his own spin to dishes like Bean Curd with Meat Sauce, completely addictive and not  simple at all. The pot stickers are Gyoza style. I guarantee that you won't find this level of delicacy, complexity, and thrift outside China or at least Flushing, Queens. Diana's Special Meat Pie is enough for two people, and I heart the chicken salad. Some anonymous internet jokesters scoff at the service, but do you really need somebody asking how you're doing every two and a half minutes? Get help!", "rating": 5, "date": "2010-04-22"}, {"excerpts": ["I order the exact same thing almost every time I go there - beef with bean curd and the dry sauted string beans, but other dishes I would recommend are Marty's special, Diana's special meat pie, Henry's special, the shrimp with bean curd, and hot and sour soup.  \n", "This is my favorite location of the chain, but the one on Sansome Street is good too."], "author": "Claire T.", "review": "This is my favorite place to have lunch with my dad.  We love love love it.  The only negative thing I could ever think to say about it is that sometimes you have to wait a long time for a table at noon, because it is so good.  Dinner time is pretty empty, though, so that's a good time to go and avoid the rush.  \nI order the exact same thing almost every time I go there - beef with bean curd and the dry sauted string beans, but other dishes I would recommend are Marty's special, Diana's special meat pie, Henry's special, the shrimp with bean curd, and hot and sour soup.  \nThis is my favorite location of the chain, but the one on Sansome Street is good too.", "rating": 5, "date": "2006-12-12"}, {"excerpts": ["My favorites are House Bean Curd, Dumplings, Onion Cake, Chicken Salad and of course Hunan Bacon(now off the menu)"], "author": "Monica H.", "review": "my friend introduced me to this location in 2000. LOVE IT! the family and staff are very friendly and just nice people. Frank always takes care of me and remembers my favorites. We go every Tuesday for lunch and the whole staff smiles and says \"hello, Monica, is Katie coming?\", haa.  The food is YUMMY IN MY TUMMY! Tonight I had what will probably be my last order of Hunan Bacon :(. They decided to take it off the menu because people were complaining that is was too fatty or hot, silly people. It's an excellent dish and if you order something with \"Hunan\" and \"bacon\" in the title, well you should expect fat and chili peppers! But, I digress, the food is wonderful and cooked fresh to order. Many dishes have lots of ginger, mmmmm. My favorites are House Bean Curd, Dumplings, Onion Cake, Chicken Salad and of course Hunan Bacon(now off the menu)", "rating": 5, "date": "2008-07-09"}, {"excerpts": ["House Bean Curd Special is so yummy ", "that people who don't normally eat tofu really like it. ", "Diana's Meat Pie is excellent if you eat in. ", "I'm not to thrilled when I've ordered it to go. ", "The chicken salad is so tasty and refreshing. ", "It comes with thinly sliced cucumbers and skinny rice noodles and lettuce. ", "I wish I knew how to make the peanut dressing they serve with it."], "author": "Myra D.", "review": "Henry's Hunan is one of my favorite chinese restaurants. The food is always excellent. The dumplings are delicious. The chicken fried rice is so good and not greasy. #53. House Bean Curd Special is so yummy that people who don't normally eat tofu really like it. Diana's Meat Pie is excellent if you eat in. I'm not to thrilled when I've ordered it to go. The chicken salad is so tasty and refreshing. It comes with thinly sliced cucumbers and skinny rice noodles and lettuce. I wish I knew how to make the peanut dressing they serve with it.", "rating": 4, "date": "2009-10-05"}], "deepfried shredded pork": [], "hunan spareribs": [], "henrys shredded pork": [], "howards special kung pao pork": [], "polish sausage hunan style": [{"excerpts": ["What tipped me over was an unexpected dish, the $8.75 Polish Sausage Hunan Style - perhaps the most inauthentic concoction ever served in a Chinese restaurant. ", "Who cares? ", "It's greasy good in a Top Dog ", "meets Yank Sing ", "sorta way. "], "author": "Ed U.", "review": "After much soul-searching and mountaintop-sitting, I decided to lift my rating for Henry's Hunan to four stars. Yes, I know it's a controversial upgrade, and I am willing to take the slings and arrows of those unfortunate snobs who have dismissed this place for lent. What tipped me over was an unexpected dish, the $8.75 Polish Sausage Hunan Style - perhaps the most inauthentic concoction ever served in a Chinese restaurant. Who cares? It's greasy good in a Top Dog meets Yank Sing sorta way. Know what I'm sayin'? \n\nWell, we already know the $6.95 Diana's Meat Pie is about as Chinese as Charlie Chan in an opium den. It's one of the best tostadas you could possibly have outside of the Mission, although I have to remember to pick up some salsa from Taco Del Mar across the street the next time. Between Henry, Howard and Marty having their namesake specials, I was starting to think this was the West Coast outpost for Katz's Delicatessen, but alas, I think they're mostly hotter-than-the-hinges-in-hell kung pao dishes.\n\nRegardless, I just couldn't sleep tonight until I gave Henry's the extra star for their anything-for-a-buck sorta-Hunan dishes. Sure, it ain't David Chang. It ain't even Charlie Chan. Henry's Hunan is like the Kathy Griffin of Chinese restaurants. \n\nFOOD - 4 stars...yes, Sophie didn't have a tougher choice than having the Polish Sausage over Diana's Tostada Greasepool...I mean, Meat Pie \nAMBIANCE - 3 stars...well, it still needs a few more gongs \nSERVICE - 3.5 stars...getting better, not sure why \nTOTAL - 4 stars...this is not a Polish joke", "rating": 4, "date": "2009-11-20"}], "hot  sour beef": [], "shredded beef": [], "beef with string beans": [{"excerpts": ["The fish in chili sauce and the beef with string beans were amazingly tender. ", "The meat pie thing that they have was also full of flavor! ", "This is a must go back type of place."], "author": "Marlene T.", "review": "This place is a great place to get flavor packed delicious food. I've actually been craving it since I went with my boyfriend and our neighbor. He suggested it and I'm so grateful he did. We have been wanting to go back. The fish in chili sauce and the beef with string beans were amazingly tender. The meat pie thing that they have was also full of flavor! This is a must go back type of place.", "rating": 5, "date": "2013-12-11"}], "beef with bean curd": [{"excerpts": ["All of their specials are good; kung pao chicken, curry chicken, beef with bean curd and even their fried rice. "], "author": "Laxme G.", "review": "Another regular spot for lunch downtown. All of their specials are good; kung pao chicken, curry chicken, beef with bean curd and even their fried rice. Throw some of their signature spicy oil on your dish and that's the cherry on top.\n\nBeat the wait, come early before noon or wait till after the lunch rush.", "rating": 4, "date": "2012-02-04"}, {"excerpts": ["I order the exact same thing almost every time I go there - beef with bean curd and the dry sauted string beans, but other dishes I would recommend are Marty's special, Diana's special meat pie, Henry's special, the shrimp with bean curd, and hot and sour soup.  \n", "This is my favorite location of the chain, but the one on Sansome Street is good too."], "author": "Claire T.", "review": "This is my favorite place to have lunch with my dad.  We love love love it.  The only negative thing I could ever think to say about it is that sometimes you have to wait a long time for a table at noon, because it is so good.  Dinner time is pretty empty, though, so that's a good time to go and avoid the rush.  \nI order the exact same thing almost every time I go there - beef with bean curd and the dry sauted string beans, but other dishes I would recommend are Marty's special, Diana's special meat pie, Henry's special, the shrimp with bean curd, and hot and sour soup.  \nThis is my favorite location of the chain, but the one on Sansome Street is good too.", "rating": 5, "date": "2006-12-12"}], "hot  sour chicken": [], "liling chicken wings": [], "hunan orange sauce chicken": [], "braised rock cod filet": [], "braised fish balls": [{"excerpts": ["Some favorites are the spicy shrimp with bean curd, braised fish balls with vegetables, and the homestyle plate of pickled vegetables (I forget the exact name of the dish).  "], "author": "Alison M.", "review": "This location is tucked away in a neat little alley.  Going here feels a little seedy, and I feel like I've found something secret!\n\nPretty decent as far as Chinese food goes, especially if you like things spicy.  Some favorites are the spicy shrimp with bean curd, braised fish balls with vegetables, and the homestyle plate of pickled vegetables (I forget the exact name of the dish).  You can get a lot of food for $10.\n\nQuality and service have been consistent every time I come here.  I recommend going at night when the place is dead, since it can get really crowded at lunch.", "rating": 3, "date": "2010-09-10"}], "sweet  sour rock cod filet": [], "spicy  hot rock cod filet": [], "spicy shrimp": [{"excerpts": ["Some favorites are the spicy shrimp with bean curd, braised fish balls with vegetables, and the homestyle plate of pickled vegetables (I forget the exact name of the dish).  "], "author": "Alison M.", "review": "This location is tucked away in a neat little alley.  Going here feels a little seedy, and I feel like I've found something secret!\n\nPretty decent as far as Chinese food goes, especially if you like things spicy.  Some favorites are the spicy shrimp with bean curd, braised fish balls with vegetables, and the homestyle plate of pickled vegetables (I forget the exact name of the dish).  You can get a lot of food for $10.\n\nQuality and service have been consistent every time I come here.  I recommend going at night when the place is dead, since it can get really crowded at lunch.", "rating": 3, "date": "2010-09-10"}, {"excerpts": ["The only two things that I would probably consider ordering if I ever came here again would be their dumplings (actual homemade dumpling skins!) and spicy shrimp with string beans.  ", "They claim they don't use MSG in their food, but I came back to the office very parched and feeling slightly lethargic.  "], "author": "Diane L.", "review": "I would have never stepped into this place, reasons being 1) good Chinese in the FiDi? (gimme a break), 2) good spicy Chinese food in the FiDi? (come on, now you're teasing me...), and 3) my experience with restaurants that have \"Hunan\" in their name have never fared very well.\n\nBut as fate would have it, my department at work decided to hold our annual holiday luncheon here.  First off, lemme just say that this was a total downgrade from our usual holiday luncheons at Perbacco and Atrium.  But times are tough, and we have to save the firm a bit of dough, so I shouldn't be complaining.  At least we had the opportunity to get away from the office for a couple hours on the firm's dime, right?  Going anywhere on the firm's dime is A-OK with me.\n\nBut Henry's food was not A-OK with me.  Everything was either way too salty or was doused in the same cornstarch-y gravy.  The only two things that I would probably consider ordering if I ever came here again would be their dumplings (actual homemade dumpling skins!) and spicy shrimp with string beans.  They claim they don't use MSG in their food, but I came back to the office very parched and feeling slightly lethargic.  If you ask me, those sound like MSG-induced symptoms.\n\nHenry's was able to save itself from a 1-star rating for the efficient service they provided our three very large and very rowdy banquet tables and their nice selection of draft beers.", "rating": 2, "date": "2008-12-30"}, {"excerpts": ["My faves are the Garlic Chicken, Spicy Shrimp with Bean Curd and Braised Rock Cod. \n\n"], "author": "Donna V.", "review": "I like Henry's Hunan! Okay, so it isn't the best Chinese food around but it's close to the office and the service may not always be fast but it's always friendly- the staff is really nice! I've had a few dishes I haven't been crazy about but they have some really great ones too. My faves are the Garlic Chicken, Spicy Shrimp with Bean Curd and Braised Rock Cod. \n\nAlso, how can you not like a place that features a dish called Diana's Meat Pie on the menu??!!!", "rating": 3, "date": "2007-03-05"}, {"excerpts": ["The spicy shrimp and green beans are also pretty killah. ", "The spice burns a bit unless you request \"medium hot\".  "], "author": "Lauren G.", "review": "This review is based off four dishes at Henry's - of course, the best dishes.\n\nHave only had these specific four dishes here, but can recommend them all.\n\nThere is this Annie's Pie or Special Pie thing that's made of pork, spices and lettuce, kinda looks like a Taco Bell Mexican Pizza, but is deliciously (I'm assuming very fattening) assembled for a group of six - really easy to share.\n\nThe spicy shrimp and green beans are also pretty killah. The spice burns a bit unless you request \"medium hot\".  They have a great sauce and aren't overly oily like a lot of Chinese food tends to be.\n\nThen there are the dumplings - pork or chicken - I'll go with chicken.  They were really good and surprisingly light in flavor, none of that weird smelling funk pot stickers can sometimes have.\n\nThe Mu Shu Pork - I liked it, but the wrappers are most definitely microwaved because they start going really hard and crispy once they hit the table and they can sometimes tear when you pull them apart.\n\nBest part of Henry's?  You'll never have to wonder whether or not your eating cat.", "rating": 3, "date": "2007-07-13"}], "henrys special": [{"excerpts": ["Smoked Ham is the star of the show, and Henrys special is Scallop,chicken and shrimp, Marty's is Smoked ham with chicken. ", "When there was a Stock Exchange in San Francisco this was the official restaurant for 30 years! ", "This review is for all their branches."], "author": "Paul L.", "review": "Still one of the best in San Francisco.\nI have not found a Curry Chicken like this anywhere. \nDiana's Meat Pie will not travel and must be eaten on the spot. I give it about a 10 min decay window. Smoked Ham is the star of the show, and Henrys special is Scallop,chicken and shrimp, Marty's is Smoked ham with chicken. When there was a Stock Exchange in San Francisco this was the official restaurant for 30 years! This review is for all their branches.", "rating": 5, "date": "2012-03-04"}, {"excerpts": ["As for the food, we ordered ma po tofu, Henrys Special and Napa cabbage with prawns. ", "The dishes all were tasty, shrimp super fresh, (Henry Special is a seafood combo with veggies) ", "my primary complaint is that all seem to use the same base sauce.  ", "Everything kind of has the same flavor.  ", "Bill came to under $45 for the three of us.  ", "I think there are better choices out there.  ", "Parking as noted is tough, the great city of San Francisco now has street meter parking at $3.50 an hour if you can find a spot.  ", "Still better than local parking lots which want your pink slip and first born."], "author": "Jeff R.", "review": "Went to lunch at Henry's on Natoma yesterday with couple of friends who work in the area.  I have eaten at this restaurant 6 or 7 times over the years.  I like the industrial decor, one wall is brick, open kitchen.  We beat the crowd by arriving at 11:30 but by 12:30 there was a line of 6 or so people at the hostess station waiting.  Agree with many reviewers that service can be slow and the wait staff seems to rotate making it difficult to get questions answered.  As for the food, we ordered ma po tofu, Henrys Special and Napa cabbage with prawns. The dishes all were tasty, shrimp super fresh, (Henry Special is a seafood combo with veggies) my primary complaint is that all seem to use the same base sauce.  Everything kind of has the same flavor.  Bill came to under $45 for the three of us.  I think there are better choices out there.  Parking as noted is tough, the great city of San Francisco now has street meter parking at $3.50 an hour if you can find a spot.  Still better than local parking lots which want your pink slip and first born.", "rating": 3, "date": "2011-01-21"}], "smoked ham with string beans": [{"excerpts": ["It was smoked ham with string beans. ", "Ah the memories..."], "author": "Tim G.", "review": "Good ol' Henry's Hunan Restaurant. They've been around for years at this location and can you believe it's been over 10 years since I last ate here? I do remember the place and was excited to see if anything changed since my last visit. \n\nI ordered the kung pao chicken for pickup at 11:45am. The restaurant was slowly getting busy and my goal was to beat the lunch hour rush. I was instructed to pick up my order at the counter. They do appear to be new in the business because they were discussing putting up signage for Mealpal. I went up to the counter, gave them my name and I was off. \n\nThe portion was very generous and the chicken had plenty of spice. The red hot chilies were blackened so I plucked them out. The reviews complained of too many onions but I thought it was just fine. The upside is they had everything ready to go and the food was still hot by the time I brought it back to the office. Definitely bonus points on them for being so well organized. \n\nI remember what I ordered way back when. It was smoked ham with string beans. Ah the memories...", "rating": 3, "date": "2017-10-25"}, {"excerpts": ["The smoked ham with string beans, and the Henry's special (smoked ham and chicken).  \r\n\r\n", "Vegetarians get a laugh from the menu which says, \"Americans consume too much meat.", "\"   ", "One of my co-workers tried a veggie Kung Pao made just for her (not on the menu), and it seemed to satisfy.  ", "There are plenty of other veggie dishes to go around, just as tasty as the meat dishes.  \r\n\r\n", "I agree that the theme (as well as the name of the restaurant) is way off tune, and if I'm not mistaken, the smoked meat is based on Taiwanese recipes, not Hunan.   ", "But the tacky atmosphere sets us up for an enjoyable meal.   ", "Nothing spectacular here, but it definitely passes as a dot com mess hall and a palate-pleaser!"], "author": "Daniel C.", "review": "By my third visit, I have two favorite dishes:  The smoked ham with string beans, and the Henry's special (smoked ham and chicken).  \r\n\r\nVegetarians get a laugh from the menu which says, \"Americans consume too much meat.\"   One of my co-workers tried a veggie Kung Pao made just for her (not on the menu), and it seemed to satisfy.  There are plenty of other veggie dishes to go around, just as tasty as the meat dishes.  \r\n\r\nI agree that the theme (as well as the name of the restaurant) is way off tune, and if I'm not mistaken, the smoked meat is based on Taiwanese recipes, not Hunan.   But the tacky atmosphere sets us up for an enjoyable meal.   Nothing spectacular here, but it definitely passes as a dot com mess hall and a palate-pleaser!", "rating": 3, "date": "2006-08-03"}, {"excerpts": ["Favorite dishes here are kung pao chicken, string beans without meat (great wok HAY!), and the smoked ham with string beans.\n\n"], "author": "Eating Sleeping T.", "review": "Rule of thumb: Don't eat in a Chinese restaurant if none of the customers are Chinese.  I generally follow this rule, but I make an exception with Henry's.  For me, it's just nice to eat non-Cantonese once in a while.  Favorite dishes here are kung pao chicken, string beans without meat (great wok HAY!), and the smoked ham with string beans.\n\nI've eaten at all four Henry's Hunan restaurants because I've worked within a ten minute stroll of all of them: the one on Sacramento when I worked in the FiDi; the one on Bryant when I worked at 8th and Townsend; and the one on Sansome when I worked at the Ice House.  The Natoma Street location is now the closest one to my office.  Maybe it's the recency effect, but I feel this one is the best of the four.", "rating": 4, "date": "2007-11-13"}], "smoked chicken": [], "country style smoked ham": [], "martys special": [], "chicken with peking sauce": [], "hunan velvet chicken": [{"excerpts": ["Taking our chances again, we ordered the Hunan Velvet Chicken (I decided on this dish because of the vegetables and \"velvet\" drew me towards this) and the Hot and Sour Pork (my friend is always in the mood for hot and sour entrees). "], "author": "Tom T.", "review": "More like 3.5 stars, but I gave it the extra .5 star because of service.\n\nA good friend (which I like to call her one of my sisters from another mister) drove up from San Jose and wanted to try out a place. First off, we wanted to go somewhere cheap but not quality wise. Second, we didn't want to venture off TOO far from Downtown San Francisco. Also, we both didn't have a chance to check Yelp for any good places around, so we did something DARING, we just wandered around until we found something good.\n\nWe first went to Kyo-Ya, because her GPS system recommended it, but saw it was a bit out of price range. As we were ABOUT to head to Tempura House, we found this hole-in-the-wall and debated about it for a while. She did ask me if Chinese food was okay, and I flat out said, \"I'll eat anything, just to get Yelp review.\"  And so we took our chances.\n\nAt first glance, we thought it was PRETTY dead, until we got seated in the back, which had a decent amount of people at tables. Taking our chances again, we ordered the Hunan Velvet Chicken (I decided on this dish because of the vegetables and \"velvet\" drew me towards this) and the Hot and Sour Pork (my friend is always in the mood for hot and sour entrees). Also, we ordered the onion cakes, because my friend wanted one.\n\nMy friend did ask me how the decor was. I said that it has a cozy atmosphere, a bit grungy, but cozy, even with the steel pillars running perpendicular to the floor made it cozy. Also, she did point out the fact that the kitchen was in plain view, with nothing blocking the way of how the chefs made our dishes.\n\n- The onion cake (yes, CAKE, not cakes) was different from what I'm used to, a more brown deep-fried style pancake, with very little spring onion popping out from the skin, but more buried within the layers. Tasty, but kind of wished it came with a dipping sauce. (It might be a Hunan region thing, but I'm not 100% sure).\n\n- The velvet chicken had an interesting taste. The veggies that came with it was delicious, but the chicken itself was kind of bland. Kind of wished that the chicken was marinated beforehand with the sauce that the dish came with; would have made the dish better.\n\n- The hot and sour pork was mixed. My friend said that she didn't like it so much, because it was deep fried a bit TOO long. At first, I didn't noticed it, since I'm LOVE fried things (like tempura, donuts, french fries, etc.) but I did see where she was coming from. The pork was left in the fryer a bit TOO long, because I did taste some burnt pieces here and there. Sauce was good, and plenty of veggies.\n\nI do like the fact the waiters were attentive, asking how our meal was and offered to refill our rice bowl when it gone empty.\n\nPrices were a little bit on the higher scaled, in comparison to what I'm used to in Los Angeles, but I do understand that San Francisco tends to be a bit more expensive.\n\nSomething that I don't see everyday, the fortune cookie is in a jar, and you have to use tongs to fish one out. My friend and I got one, and was surprised that it wasn't under or over baked. However, it could from the place they get their shipment from, not because they make the cookies themselves.", "rating": 4, "date": "2011-08-26"}, {"excerpts": ["We got the pork fried rice, hot sour soup, chicken salad, hunan velvet chicken, dry-sauteed string beans, and henry's special. \n\n"], "author": "Joyce M.", "review": "Recently came to lunch here with a couple co-workers. We ordered a whole mess of food and I thought it was decent Chinese food. We got the pork fried rice, hot sour soup, chicken salad, hunan velvet chicken, dry-sauteed string beans, and henry's special. \n\nI thoroughly enjoyed the chicken salad but I thought everything else was decent. It was all a good deal though for a feast! All that for $65 including tip. :)", "rating": 3, "date": "2014-11-24"}, {"excerpts": ["They do have something called Hunan Velvet Chicken, which is like Kung Pao Chicken without the peanuts or the spiciness. "], "author": "Peter L.", "review": "Strange they don't have Hunan Beef or Hunan Chicken on the menu. They do have something called Hunan Velvet Chicken, which is like Kung Pao Chicken without the peanuts or the spiciness. It is pretty good.\n\nGranted most other dishes are okay (garlic chicken, green beans, soft tofu, etc.), but after awhile they all started to look and taste the same...with much black bean sauce. They claimed they don't use MSG, but I do like my MSG tbh.\n\nHowever, the thing that got to me was the waiter letting out a small laugh, saying \"nice try\" for ordering Hunan Beef or Hunan Chicken. Whaa? Oh no you diint! A generous four stars.", "rating": 4, "date": "2011-05-09"}], "chicken with broccoli": [], "chicken with black bean sauce": [{"excerpts": ["The chicken fried rice is solid, as are the kung pao chicken and the chicken with black bean sauce plates. "], "author": "Karim V.", "review": "My first time eating here was back in 2003 or 2004; I had eaten at another location before, but this one has been my go-to for years (same for many ex-coworkers of mine). \n\nOkay, so I have had a number of the items on the menu and have liked each and every one of them, with a special love for the dumplings, Marty's Special, and the Hunan house bean curd. I love my tofu and Henry's makes some awesome tofu dishes with just the right level of heat. The chicken fried rice is solid, as are the kung pao chicken and the chicken with black bean sauce plates. And one of my old favorites is the noodles w/pork meat sauce and Hunan special sauce...yummylicious.\n\nThe service isn't always great, but that doesn't bother me. I mean seriously, I see some hole in the wall places get high marks and we know how terrible the service is at those spots, yet the food is amazing so it gets a pass fine. I never remember the name of the gentleman who cashes people out, but he has always been great and remembers names like a human rolodex. \n\nThis is the restaurant I missed the most when I moved away to Seattle for a spell. I'd visit SF and swing by Henry's for some grub and it always hits the spot. Plus, Chinese/Hunan food in Seattle is TERRIBLE, with the exception of O'Asian. That wasn't nice of me, so I will end this review and go sit in the corner.", "rating": 5, "date": "2013-03-01"}], "beef with broccoli": [], "sliced beef with green onions": [], "beef or chicken with mixed vegetables": [], "sweet  sour pork or chicken hunan style": [], "napa cabbage with shrimp": [], "sauteed deluxe vegetables": [], "country style vegetables": [{"excerpts": ["Country Style Vegetables: ", "A mix medley of vegetables of questionable quality. ", "Soft and mushy, the country style vegetables was the least favorite of the dishes, simply because of the underwhelming taste, gross texture, and undesirable palette of soggy vegetables in sauce unidentified and mysterious to even its cooks. \n\n"], "author": "Richard L.", "review": "I've been working in SoMa for three years, but I haven't ate at the restaurant that's just down a block away from me, at Henry's, though I'd heard plenty of praises for it. \"They have great chicken curry,\" says my friend, \"and we have it every Thursdays at work. It's been a tradition, I guess.\" My friend either really, really loves Henry's, or doesn't know any other restaurants around work. \n\nSo, here's a question: why is my friend so obsessed over Henry's that it makes him eat there, religiously, every Thursdays? Won't the food, uh, get boring after a while? Is the food at Henry's so arresting that it causes men to devote one -- one! -- day a week for Chinese food made only by a guy named Henry? (Well, nowadays, Henry's probably hasn't worked in the kitchen for a hella long time.)\n\nStepping into Henry's Hunan at the SoMa location on Natoma, I thought the place would be small, no bigger than B&M, the other Chinese restaurant by my work. But Henry's is huge, physically, and teeming in activity! Waiters frantically rush by you, holding trays of food and drinks in their hands while weaving in and out of the standing patrons; the large, loud open kitchen on the side of the room fills the restaurant with the chatter of Chinese cooks and the rumble of the woks over the flaming stoves; the loud discordant sound of silverware clanging against the plates and the deafening thumps of chopsticks hitting the white rice bowls.   \n\nThere was a line when we'd arrived at Hunan's, about 15 people ahead of us, but we were seated in less than 10 mins, thanks to Henry's spacious dining room filled with lots and lots of tables. Seated, we looked over the menu, found what we wanted, then waited for someone, anyone, to take our order. Five minutes passed. Then ten minutes. Still, nobody came to take our order as we sat there, speechless, at the the staff's oversight.\n\nFinally, a waiter, or maybe it was the busboy, walks by, takes our order, and runs off to the kitchen. About 15 mins later, the food arrives one after the other, each plate steaming hot, fresh from kitchen. \n\nHere's what we ordered:\n\nGarlic Chicken:  The title gives this dish's flavor away: garlic, lots of it. Diced chicken covered in a soy and sugar sauce.The portions were generous, for sure, but the sauce was a overpowering. \n\nCountry Style Vegetables: A mix medley of vegetables of questionable quality. Soft and mushy, the country style vegetables was the least favorite of the dishes, simply because of the underwhelming taste, gross texture, and undesirable palette of soggy vegetables in sauce unidentified and mysterious to even its cooks. \n\nChicken with String Beans: Diced chicken in a soy sauce marinade served over a bed of crispy string beans. I loved this dish for the delicious string beans, not for the chicken, which wasn't that great. I wouldn't get this dish again, but I would order a dish solely for string beans.\n\nVegetarian Egg Rolls: Meh. Stringed vegetables including carrots, stuff, and other weird stuff, wrapped in a flour roll, flash fried until the outer layer turns a yellow or gold, whichever comes first. The title is a misnomer, though, since the there was no egg in this roll. Only vegies in a averagely made roll. Not worth the money, totally.\n\n I felt lethargic and tired after I'd ate the meal, like a lazy-ass sloth lolling in the trees. Of course, I'm the one to blame as I gorged my poor stomach on Chinese Food, spiking my system with excessively dangerous levels of MSG. Knowing full well that I may end up dead at my desk the next time I go to Henry's, would I come here again? Hrm, not really. The service is hit or miss, and the atmosphere is too noisy for a nice, relaxing hour on lunch. Takeout, perhaps? Yeah, I'll just get everything to-go, just like my obsessive friend.", "rating": 3, "date": "2008-02-24"}], "drysauteed string beans": [], "hot  sour vegetables": [], "fresh soybean sauteed": [], "hunan house bean curd": [{"excerpts": ["Okay, so I have had a number of the items on the menu and have liked each and every one of them, with a special love for the dumplings, Marty's Special, and the Hunan house bean curd. ", "I love my tofu and Henry's makes some awesome tofu dishes with just the right level of heat. "], "author": "Karim V.", "review": "My first time eating here was back in 2003 or 2004; I had eaten at another location before, but this one has been my go-to for years (same for many ex-coworkers of mine). \n\nOkay, so I have had a number of the items on the menu and have liked each and every one of them, with a special love for the dumplings, Marty's Special, and the Hunan house bean curd. I love my tofu and Henry's makes some awesome tofu dishes with just the right level of heat. The chicken fried rice is solid, as are the kung pao chicken and the chicken with black bean sauce plates. And one of my old favorites is the noodles w/pork meat sauce and Hunan special sauce...yummylicious.\n\nThe service isn't always great, but that doesn't bother me. I mean seriously, I see some hole in the wall places get high marks and we know how terrible the service is at those spots, yet the food is amazing so it gets a pass fine. I never remember the name of the gentleman who cashes people out, but he has always been great and remembers names like a human rolodex. \n\nThis is the restaurant I missed the most when I moved away to Seattle for a spell. I'd visit SF and swing by Henry's for some grub and it always hits the spot. Plus, Chinese/Hunan food in Seattle is TERRIBLE, with the exception of O'Asian. That wasn't nice of me, so I will end this review and go sit in the corner.", "rating": 5, "date": "2013-03-01"}, {"excerpts": ["Such fantastically delicious is the spiciness that the hunan house bean curd (say 25 times hot) "], "author": "ryan c.", "review": "Indeed, Henry's Hunan is the 'best Chinese restaurant in the world.' as it's often called. While some insist upon quoting the original scripture here in support, others maintain to this day that it is the best - despite the fact that in 1976 \"The New Yorker\"  called it the 'best Chinese restaurant in the world!'\nSo...\nBest known for being called the best Chinese restaurant in the world for the fourth consecutive decade, Henry's Hunan serves foods so delectable, so sublime as to render such prior discourse concerning its relative merits so crude in its reliance upon comparative terms that speak nothing to this experience. Such fantastically delicious is the spiciness that the hunan house bean curd (say 25 times hot) offers that to call it the best in San Francisco understates the point.\n\nReligious allusions and allegories usually aid clarity. So, to flesh out this point with an allegory: when faced with religious epiphany, those so inclined are apt to speak of their god's glory, etc. - and not the relative merits of this god compared to the other gods, and thereby eschewing the \"first commandment\" in exodus wherein the ineffable god goes on record insisting upon being #1 and that everyone hold all the other gods as second fiddles at best.  Although widely criticized for this shrewd move (not least of all those looking to improve the fiddle section), it seems almost quaint now in its understatement and has over time garnered much praise (even among monotheists, to whom it clearly does not apply): Firstly, for its role in providing much-needed filler in what's become the top all-time top-ten list - The Ten Commandments, and secondly for its role in silencing dissent.\n\nSo, much like the religious experience trivializes religious texts, so too does such an experience at Henry's Hunan trivialize not only the claim to being the \"world's best,\" but renders such commentary irrelevant.\nSo, goodbye New Yorker\nand Hello Henry's Hunan!", "rating": 5, "date": "2006-09-20"}], "chinese green": [], "eight delight vegetables": [], "five spiced bean curd": [{"excerpts": ["My favorites include the Henry's Special, Kung Pao Shrimp, Five Spiced Bean Curd, chow mein and hot & sour soup.  "], "author": "Garrett D.", "review": "I have been going to Henry's Hunan for over 15 years now and am just getting around to writing a review.  Delinquent, I realize.  But this place is excellent.  My friends and I try to hit it up about once a month for lunch during the week and it always delivers.  I recommend going at 11:45 or 1:00 to avoid the rush and some long wait times, but if you have a small group of 2-4, you can usually get seated rather quickly. \n\nMy favorites include the Henry's Special, Kung Pao Shrimp, Five Spiced Bean Curd, chow mein and hot & sour soup.  Great dishes, pretty fast service and a good atmosphere for a large windowless room.\n\nI have been to all of the other locations as well and this one is my favorite.", "rating": 4, "date": "2014-02-04"}], "hunan chicken beef or pork chow mein": [], "noodles wpork meat sauce and vegetables": [], "noodles wpork meat  hunan special sauc": [], "noodles wchicken and vegetable": [], "henrys shrimp chow mein": [], "hunan vegetable chow mein": [], "combo vegetable": [], "sliced hunan smoked ham  vegetables": [], "sliced beef  vegetables": [], "sliced beef bean curd  vegetables": [], "diced chicken minced garlic  vegetables": [], "shrimp or combination fried rice": [], "hunan chicken beef or pork fried rice": [], "hunan vegetables fried rice": []}