{"vegetarian egg rolls": [], "dumplings": [{"excerpts": ["We ordered egg rolls, dumplings, beef with broccoli, and curry chicken.  ", "The egg rolls may have been some of the best I've ever had.  ", "They taste like they were rolled to order and not overly fried.  ", "The Curry Chicken had a lot of spice and not overly saturated with yogurt.  ", "The beef was fresh and not overly sauced.  ", "I look forward to going back."], "author": "Shaun W.", "review": "The food tasted very fresh and flavorful.  We ordered egg rolls, dumplings, beef with broccoli, and curry chicken.  The egg rolls may have been some of the best I've ever had.  They taste like they were rolled to order and not overly fried.  The Curry Chicken had a lot of spice and not overly saturated with yogurt.  The beef was fresh and not overly sauced.  I look forward to going back.", "rating": 5, "date": "2018-03-31"}, {"excerpts": ["We started with the dumplings and they were excellent! ", "Perfectly cooked and juicy pork filling. ", "And the best part is they make their own chili oil which is phenomenal with the dumplings. ", "(I tend to rate Chinese restaurants based on their homemade chili oil haha). "], "author": "Sabina S.", "review": "Henry's Hunan is a great spot to grab Chinese food in North Beach and relatively inexpensive (came to $15 pp). We came when it was pretty much empty so service was speedy and attentive. \n\nWe started with the dumplings and they were excellent! Perfectly cooked and juicy pork filling. And the best part is they make their own chili oil which is phenomenal with the dumplings. (I tend to rate Chinese restaurants based on their homemade chili oil haha). Highly recommend this dish!\n\nFor entrees we shared Henry's Special and the Chicken Fried Rice and they were solid! Henry's Special comes with hunan chicken, shrimp, scallops, carrots, and oyster mushrooms in a flavorful and mildly spicy sauce. I was pleased that the scallops were cooked well and not overdone which is an easy thing to get wrong. The fried rice was excellent! Subtle flavors and nicely grilled chicken pieces - well done.\n\nAll in all I'd come again and likely stick to these same orders :)", "rating": 4, "date": "2017-03-26"}, {"excerpts": ["Food - We ordered the onion pancake, dumplings, sweet and sour soup, kung pao chicken, spicy & hot rock cod fillets, and spicy eggplant with meat sauce. ", "Mostly, everything was just OK. ", "The onion pancake was very different from the scallion pancakes ", "I'm familiar with - ", "it was crispy and flaky. ", "The eggplant was visually unappetizing and lacked unique favoring. "], "author": "Vivian N.", "review": "Ate here last weekend because my boyfriend loves the Henry's Hunan chain and wanted to bring me for my first time. Our visit left a lot to be desired for me. \n\nAmbiance - Walked in at 7:30pm on a Saturday night...the restaurant was empty minus one couple. Pretty surprising given its prime location in North Beach. The restaurant has relatively chic furniture/decor for a no-frills Chinese restaurant. Clean. Casual. Had the Warriors game on a large LCD. Seems to cater to mainly non-Asian clientele.\n\nService - Typical Chinese restaurant service. They take your order quickly after sitting down and are prompt bringing food out, but good luck trying to get their attention other than to take your order and bring your bill. \n\nFood - We ordered the onion pancake, dumplings, sweet and sour soup, kung pao chicken, spicy & hot rock cod fillets, and spicy eggplant with meat sauce. Mostly, everything was just OK. The onion pancake was very different from the scallion pancakes I'm familiar with - it was crispy and flaky. The eggplant was visually unappetizing and lacked unique favoring. Everything else was unmemorable.\n\nPricing is decent given its location and ambiance. Food is barely a step up from Panda Express, but in a sit-down restaurant. All-in-all, it was alright, but I don't plan on returning given the other Chinese food options in SF.", "rating": 2, "date": "2017-02-18"}, {"excerpts": ["Recommend dumplings, dianna meaty pie.  ", "Marty's special and kung pao chicken yummy!   ", "YELP needs to change the status to OPEN!!!"], "author": "T M.", "review": "The business is OPEN!! They updated their in dining experience.  Amazing food.  Recommend dumplings, dianna meaty pie.  Marty's special and kung pao chicken yummy!   YELP needs to change the status to OPEN!!!", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["We had egg rolls, hot and sour vegetables, dumplings and chicken lo "], "author": "Patrick P.", "review": "We came on a Sunday evening, no wait and we sat near a window. Parking was difficult but the area was walkable. We had egg rolls, hot and sour vegetables, dumplings and chicken lo mein along with moo shi. \n\nWill come back. It's a few blocks from Chinatown. Restaurant was clean and staff friendly and efficient.", "rating": 5, "date": "2016-07-10"}, {"excerpts": ["Since we had not really eaten all day, we were starving and ordered a bottle of wine, egg rolls, dumplings, chow mien, orange chicken,many Kung po chicken for three people!\n\n", "First egg rolls, the dumplings, then orange chicken"], "author": "Mallory E.", "review": "We didn't realize this was a chain until we went to the wrong one before we went to this location, but it was delicious.\n\nSince we had not really eaten all day, we were starving and ordered a bottle of wine, egg rolls, dumplings, chow mien, orange chicken,many Kung po chicken for three people!\n\nThe bill came at about $70 which wasn't terrible because the bottle of wine was $30. \n\nThe only weird thing is each dish came out one by one. First egg rolls, the dumplings, then orange chicken,mother chow mien, then finally the Kung po.\n\nEither way the food was delicious!", "rating": 4, "date": "2015-08-23"}, {"excerpts": ["As starters, do get their signature Meat Pie, Dumplings and Hot and Sour Soup!  "], "author": "Tiffany D.", "review": "Hunan food that warms and comforts the palate with its tasty, stir-fried entrees!\n\nAs starters, do get their signature Meat Pie, Dumplings and Hot and Sour Soup!  You can't go wrong with that opening combo! \n\nFor entrees, I do recommend their Mushu Pork, Beef and String Beans and Hot and Sour Chicken.  All three of these dishes are unique and tingles the palate in its own delightful way!\n\nThe service was attentive and accommodating. \n\nIt's a cozy, tight-knit spot in North Beach!", "rating": 5, "date": "2014-01-27"}, {"excerpts": ["The dumplings were amazing. ", "My friend doesn't eat pork, I don't think he noticed. ", "Lol. ", "We scarfed them down. "], "author": "Sarah S.", "review": "Saturday afternoon. Two other tables inside. Ridiculously slow service and because of what looked like a dinner between all the staff at one table. Reason for 3 stars instead of 4.\n\nThe dumplings were amazing. My friend doesn't eat pork, I don't think he noticed. Lol. We scarfed them down. They were delish.\n\nBeef and string beans is good but very MSG tasting. The beef is so tenderized it falls apart on the dish. Slightly off putting but has nice flavor.\n\nKung pao chicken was great. Chicken seemed to be of great quality. Overall  I think the place was great. It got a lot of good reviews considering the real Chinatown is up the block.", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["I had the dumplings, which were just okay.  ", "I also had onion rolls or fritters.   ", "It was an appetizer.  ", "It left me wondering what it was and why I ordered it.   ", "Four stars because my brother LOVED his dish and the place was clean."], "author": "Sharon F.", "review": "This is my brother's favorite Chinese restaurant.   He highly recommends the Hunan Smoked Ham which is stir fried wuthering bell pepper, onion and carrots.   I tried it but it was very salty and spicy, IMO.  \nI had the dumplings, which were just okay.  I also had onion rolls or fritters.   It was an appetizer.  It left me wondering what it was and why I ordered it.   Four stars because my brother LOVED his dish and the place was clean.", "rating": 4, "date": "2017-04-29"}, {"excerpts": ["Below average food (tried three different dishes-chicken, seafood, and rice) and they didn't bring out the dumplings that we had ordered as an appetizer.  ", "We were still charged for the dumplings and had to have the waitress change our bill-no apology or comp provided.  ", "I see why its busy (on Grant = drunk bar food) ", "but I wouldn't return again and would probably satisfy any food craving with the amazing italian in the area, or walk a few blocks to Chinatown."], "author": "Raina D.", "review": "Below average food (tried three different dishes-chicken, seafood, and rice) and they didn't bring out the dumplings that we had ordered as an appetizer.  We were still charged for the dumplings and had to have the waitress change our bill-no apology or comp provided.  I see why its busy (on Grant = drunk bar food) but I wouldn't return again and would probably satisfy any food craving with the amazing italian in the area, or walk a few blocks to Chinatown.", "rating": 2, "date": "2015-12-14"}, {"excerpts": ["We ordered dumplings (Filled with pork and vegetables. ", "He preferred them spicy), beef with broccoli, shrimp fried rice, and chicken chow mein. ", "All the food was amazing. ", "The only things I did not like was that they didn't give us too much beef with broccoli, and the chicken chow mein was a bit salty to my boyfriend and I. ", "Besides those two things, all the food came out hot and very quickly. ", "My boyfriend and I were extremely satisfied and full. ", "It had been a while since him "], "author": "Ashley M.", "review": "I came here Thursday night with my boyfriend. We wanted some great Chinese food, so we looked on yelp and found this place. \n\nParking: On the street where you have to pay meters\nLocation: In a cute neighborhood where some of the MUNI transit trains run\n\nOnce my boyfriend and I walked into the restaurant, we were greeted right away. We got to choose our seating. We sat in a booth where there were pillows. It was a little dimmed in the restaurant, and the booth was extremely comfortable. First thing we noticed about the menu was that the prices weren't bad at all, and the restaurant gave you  good amount off food. \n\nWe ordered dumplings (Filled with pork and vegetables. He preferred them spicy), beef with broccoli, shrimp fried rice, and chicken chow mein. All the food was amazing. The only things I did not like was that they didn't give us too much beef with broccoli, and the chicken chow mein was a bit salty to my boyfriend and I. Besides those two things, all the food came out hot and very quickly. My boyfriend and I were extremely satisfied and full. It had been a while since him and I ate great Chinese food, so we are pleased to put this restaurant down as one of the good places to grab food from. \n\nThe service: There seemed to be one girl mainly serving everyone. She was a bit inattentive. She didn't notice I even needed water until I was fully done with my meal. Also, my boyfriend and I couldn't flag her down for some sweet and sour sauce, so we ended up disturbing another waiter. \n\nConcluding, the food was pretty good besides the chow mein being a little bit salty. The meal portions were pretty good for the price you pay. It was the right amount of portions for my boyfriend and I that is. Not sure if their portions would be big enough for a group of 4 or so depending on how many orders you get. We got 4 different ones. Also, our waitress was a bit distracted when it wasn't even that busy in the restaurant.", "rating": 4, "date": "2016-05-09"}, {"excerpts": ["We started out with the dumplings and they were sooooo good! ", "Seriously, I was sad when we finished them. ", "Delicious! ", "I ordered Henry's special or something like that- chicken, shrimp, scallops and veggies. ", "The meats were good, the shrimp was fresh although not always deveined completely. ", "The sauce wasn't my favorite. ", "I ordered this dish mild and I don't know if that affected the flavor ", "but I'd guess not. ", "I still enjoyed the meat, but I would've liked a tasty sauce- a girl needs more than a plate of meat. ", "The veggies were minimal. ", "The carrots were sliced thin as paper which seemed unnecessary. ", "The rice was good but you need to order it separately. ", "The drinks are cans which I actually like but 1.75 for a can is a lot. ", "My husband got Kung pow chicken and said he would rate his meal a 4/5."], "author": "Reba B.", "review": "It took at least 15-20 minutes sitting at the table before anyone took our order. It wasn't crowded. We started out with the dumplings and they were sooooo good! Seriously, I was sad when we finished them. Delicious! I ordered Henry's special or something like that- chicken, shrimp, scallops and veggies. The meats were good, the shrimp was fresh although not always deveined completely. The sauce wasn't my favorite. I ordered this dish mild and I don't know if that affected the flavor but I'd guess not. I still enjoyed the meat, but I would've liked a tasty sauce- a girl needs more than a plate of meat. The veggies were minimal. The carrots were sliced thin as paper which seemed unnecessary. The rice was good but you need to order it separately. The drinks are cans which I actually like but 1.75 for a can is a lot. My husband got Kung pow chicken and said he would rate his meal a 4/5.", "rating": 3, "date": "2016-10-21"}, {"excerpts": ["Steamed dumplings and the rock cod fillets are other faves.\n\n"], "author": "Gwynnie P.", "review": "Yeah! Another stellar Henry's Hunan. The decor is fresh and clean and the hits are the same...we always go back to the Meat Pie and the Cold Chicken Noodles. Delicious. Steamed dumplings and the rock cod fillets are other faves.\n\nA great place to stop for lunch if you're shopping on Upper Grant. Such a fun neighborhood.", "rating": 5, "date": "2014-05-29"}, {"excerpts": ["The dumplings are also a must! ", "They are so fluffy and delicious. ", "Sometimes, if you go in to the restaurant, you can even see them making the dumplings at one of the tables. ", "YUM!"], "author": "Julia M.", "review": "I was sick recently and in need of some hot, spicy soup... I had heard good things about Henry's Hot and Sour Soup so I decided to give it a try. OMG, it was good! It's pretty spicy but the flavors are amazing. The dumplings are also a must! They are so fluffy and delicious. Sometimes, if you go in to the restaurant, you can even see them making the dumplings at one of the tables. YUM!", "rating": 4, "date": "2016-06-22"}, {"excerpts": ["We ordered the:\n\npork fried rice (awesome, highly recommend)\nchicken chow mein ( delicious, a little spicy) \nDumplings (pork and veggie I believe, very tasty)\nKung "], "author": "Cristina G.", "review": "Staff was very attentive and friendly, restaurant was clean and nice ambiance, and the food was awesome!   My husband and I arrived around 6:30pm on a Saturday night and though there were a lot of people there, we had no trouble getting a good table. We ordered the:\n\npork fried rice (awesome, highly recommend)\nchicken chow mein ( delicious, a little spicy) \nDumplings (pork and veggie I believe, very tasty)\nKung pao chicken (spicy and delicious)\nString beans and beef (don't recommend, too salty)\nTsing Tao beer (tasty) \n\nAll in all, great experience, we would definitely go back! Wish this place was in San Jose.", "rating": 4, "date": "2015-08-23"}, {"excerpts": ["Like a lot of Chinese restaurants, the entrees are served family style, so we ordered Kung Pao  Shrimp, Mongolian Beef, beef lo mein, pork fried rice, and for appetizer we ordered dumplings. ", "Dumplings came out first and they were ok- not much flavor. ", "I put the table side chili oil on them and their was no spice to the oil whatsoever. ", "My asian friend said it's because the oil was mixed with bean curd? ", "Entrees come out and everything is salty. ", "I don't know how many waters and pots of tea we went through because of the saltiness of the dishes. ", "The staff were all friendly and the prices were reasonable, but I wouldn't recommend this restaurant to friends and family."], "author": "Khrysten T.", "review": "When I think of San Francisco, I think of great Chinese food. It was a long day of driving and walking for miles, I just wanted some good, comforting Chinese food to welcome me to the city. I came across Henry's on Yelp! and its great reviews and decided to give it a try. We arrived around 7pm and it wasn't busy. Like a lot of Chinese restaurants, the entrees are served family style, so we ordered Kung Pao  Shrimp, Mongolian Beef, beef lo mein, pork fried rice, and for appetizer we ordered dumplings. Dumplings came out first and they were ok- not much flavor. I put the table side chili oil on them and their was no spice to the oil whatsoever. My asian friend said it's because the oil was mixed with bean curd? Entrees come out and everything is salty. I don't know how many waters and pots of tea we went through because of the saltiness of the dishes. The staff were all friendly and the prices were reasonable, but I wouldn't recommend this restaurant to friends and family.", "rating": 3, "date": "2016-03-24"}, {"excerpts": ["Garlic chicken, fried rice, and dumplings are yummy. ", "Enjoy!"], "author": "Crystal C.", "review": "Delicious! Nice 15 minute walk from Fisherman's Wharf. \nGarlic chicken, fried rice, and dumplings are yummy. Enjoy!", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["We ordered the Harvest Pork, Hot and Sour Chicken, and the Crescent Dumplings. ", "The two entrees were good sized portions and perfectly spicy (definitely on the hot side). ", "The pork dumplings were also quite good and surprisingly light.\n\n"], "author": "Max J.", "review": "Stumbled into this restaurant after realizing there was going to be a two hour wait at the place we were originally planning to go to. Overall, we were pleasantly surprised and look forward to eating here again next time we are in North Beach.\n\nAmbiance is very nice and everything is extremely clean. We ordered the Harvest Pork, Hot and Sour Chicken, and the Crescent Dumplings. The two entrees were good sized portions and perfectly spicy (definitely on the hot side). The pork dumplings were also quite good and surprisingly light.\n\n4 stars only because service was a little slow but not terribly so. Took awhile to get water and hot tea as there was only one waitress.", "rating": 4, "date": "2015-01-11"}, {"excerpts": ["Pork dumplings - wouldn't order again.  ", "The wrap was sort of doughy, chewy.  ", "It's really pot stickers not like the dumplings with a thin wrap and juicy center that you'd buy at San Tung on Irving Street. \n", "5. ", "Chicken fried rice - was pretty good and good portions.  ", "We ordered this by mistake because BFF's mom wanted chow fun ", "and I thought she said chow fon (rice).  \n", "6. ", "Beef chow mein.  ", "I didn't really like this dish that much.  "], "author": "Ry T.", "review": "This Hunan chain (there are 7 in all) restaurant opened in the North Beach area approximately a year ago.  The restaurant has a nice decor and I liked the floors.\n\nWe stopped in for lunch take out and the person taking our order at the register was so nice, he gave us a pot of tea to drink while we waited for our food. \nWe got 5 orders for about $40: (all ordered w/o hot sauce)\n\n1. Stir fried green beans - my favorite of all the dishes.  Good flavor and crispy.\n2. Beef and broccoli - The vegt. was not overcooked and tasted OK.\n3. Pork dumplings - wouldn't order again.  The wrap was sort of doughy, chewy.  It's really pot stickers not like the dumplings with a thin wrap and juicy center that you'd buy at San Tung on Irving Street. \n5. Chicken fried rice - was pretty good and good portions.  We ordered this by mistake because BFF's mom wanted chow fun and I thought she said chow fon (rice).  \n6. Beef chow mein.  I didn't really like this dish that much.  You can get better chow mein from deli stores in Chinatown. \n\nWith Chinatown being so close, I'd rather take the extra walk and head there for takeout food, but we were in a hurry so, we headed down from Telegraph Hill to this place.  \nNot sure I'd make an effort to go here and fight the parking in North Beach for the food here. The place was empty for lunch on a Saturday.  Saw a couple of other customers come for take out 'tho.  They sell their Hunan chili sauce in plastic jars at the counter.  Invented by the original Henry's of Hunan.", "rating": 3, "date": "2014-11-16"}, {"excerpts": ["We had the Mongolian beef, shredded pork, dumplings and hot and sour soup. ", "Everything was delicious, but the spicy dumplings were my favorite! ", "The service was great. ", "Lewis was very sweet and made sure that we were taken care of. ", "Thanks, Lewis! ", "We will definitely be returning and recommending. ", ":)"], "author": "Sam B.", "review": "Excellent food! We had the Mongolian beef, shredded pork, dumplings and hot and sour soup. Everything was delicious, but the spicy dumplings were my favorite! The service was great. Lewis was very sweet and made sure that we were taken care of. Thanks, Lewis! We will definitely be returning and recommending. :)", "rating": 5, "date": "2016-04-02"}, {"excerpts": ["My ideal order is:\n\n--Steamed dumplings  \n--Diana's meat pie\n--Bean curd with meat sauce ( a MUST!)\n--Chicken curry\n--String beans with meat sauce\n--Side of white rice\n"], "author": "Alex C.", "review": "I've been going to Henry's with my family since I was 5 years old, I'm now 26, and it's still my go-to Chinese restaurant in the world! The new North Beach location is just as good if not better than the other Henry's locations.\n\nMy ideal order is:\n\n--Steamed dumplings  \n--Diana's meat pie\n--Bean curd with meat sauce ( a MUST!)\n--Chicken curry\n--String beans with meat sauce\n--Side of white rice\n(All of this is equally delicious if you order spicy or mild!! I prefer very spicy)", "rating": 5, "date": "2014-09-25"}, {"excerpts": ["We just tried orange chicken, eggplant, dumplings and onion cake.\n", "Dumplings were the only thing that tasted good. \n", "The orange chicken is a big disappointment. ", "The onion cake was baked flour, with no onions. ", "The eggplant, is just not edible.\n", "The food also take a long time to arrive even though the restaurant is quite empty.\n", "This place does not meet any standard close to 1 star."], "author": "Gee B.", "review": "I have no idea how people have been rating this place so high. We just tried orange chicken, eggplant, dumplings and onion cake.\nDumplings were the only thing that tasted good. \nThe orange chicken is a big disappointment. The onion cake was baked flour, with no onions. The eggplant, is just not edible.\nThe food also take a long time to arrive even though the restaurant is quite empty.\nThis place does not meet any standard close to 1 star.", "rating": 1, "date": "2015-08-22"}, {"excerpts": ["Was looking for a good place to have pork soup dumplings. ", "This restaurant was listed, having them. ", "Disappointed to find they didn't, but made the best of the situation. ", "All the dishes we ordered were good and the service was very nice. ", "It was quiet at the time and a nice atmosphere to the store front."], "author": "Rachelle Z.", "review": "Spent the weekend in San Francisco for Anniversary/Mothers Day/Foodfest. Was looking for a good place to have pork soup dumplings. This restaurant was listed, having them. Disappointed to find they didn't, but made the best of the situation. All the dishes we ordered were good and the service was very nice. It was quiet at the time and a nice atmosphere to the store front.", "rating": 5, "date": "2015-07-20"}, {"excerpts": ["Dumplings were fast and toasted just the way we like them. ", "Thank you!"], "author": "Kenneth C.", "review": "Clean, quick service,friendly and attentive staff, and the food was perfect. What more could you want??? Seriously could not have asked for a nicer lunch. Henry's Rock Cod and the String Bean Chicken were big hits. Wife had Curry Tofu and left happy. Dumplings were fast and toasted just the way we like them. Thank you!", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["The garlic chicken was incredibly bland and dumplings were way to doughy. ", "Definitely skip."], "author": "Reba N.", "review": "Not that good. The garlic chicken was incredibly bland and dumplings were way to doughy. Definitely skip.", "rating": 2, "date": "2015-12-05"}, {"excerpts": ["We had the dumplings, egg rolls, won ton soup and Henry's special stir fry with white rice. ", "The dumplings were very flavorful and my favorite thing we ordered. ", "The won ton soup was very light and nothing special, I really wanted it to have more flavor. ", "Everything else was just very average."], "author": "Allie H.", "review": "Maybe we ordered the wrong things, but everything was just ok to me. We had the dumplings, egg rolls, won ton soup and Henry's special stir fry with white rice. The dumplings were very flavorful and my favorite thing we ordered. The won ton soup was very light and nothing special, I really wanted it to have more flavor. Everything else was just very average.", "rating": 3, "date": "2015-04-19"}, {"excerpts": ["I love the hot and sour soup and the dumplings.  ", "I have eaten in the restaurant only once ", "but the service was good.  ", "The best part about Henry's Hunan to me is that the food doesn't taste bad when I get it to go (unlike some places).. ", "it's not greasy."], "author": "Taylor P.", "review": "This place is a great Chinese spot in North Beach! I frequently call in my order, walk down the hill, and it's ready.  I love the hot and sour soup and the dumplings.  I have eaten in the restaurant only once but the service was good.  The best part about Henry's Hunan to me is that the food doesn't taste bad when I get it to go (unlike some places).. it's not greasy.", "rating": 5, "date": "2015-04-09"}, {"excerpts": ["We had the dumplings, Mongolian beef, Henry special, tofu, and everything was delicious. ", "All dishes were less than $10. ", "The only minor problem was that the food didn't arrive all at once. ", "Must try!"], "author": "Pedro R.", "review": "Excellent food, good service, overall a great place!\nWe had the dumplings, Mongolian beef, Henry special, tofu, and everything was delicious. All dishes were less than $10. The only minor problem was that the food didn't arrive all at once. Must try!", "rating": 5, "date": "2014-11-03"}, {"excerpts": ["The dumplings were very good and the Mongolian beef was exactly the way I like it, thin slices, not sweet, with a light sauce.  ", "Definitely returning."], "author": "Judi R.", "review": "Excellent flavors. Started with wonton soup that was the best I have ever tasted.  The dumplings were very good and the Mongolian beef was exactly the way I like it, thin slices, not sweet, with a light sauce.  Definitely returning.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["We had the Hunan Scallops, Chicken with Mixed Vegetables, Dumplings and Steamed Brown Rice. ", "Very reasonable prices, most especially for San Francisco. ", "The neighborhood is just a touch on the rough side, but nothing so serious as to prevent us from returning."], "author": "Steve A.", "review": "We dined here tonight based upon Yelp reviews, and it did not disappoint. It was very quiet, so service was very prompt and attentive. We had the Hunan Scallops, Chicken with Mixed Vegetables, Dumplings and Steamed Brown Rice. Very reasonable prices, most especially for San Francisco. The neighborhood is just a touch on the rough side, but nothing so serious as to prevent us from returning.", "rating": 5, "date": "2015-04-16"}, {"excerpts": ["We all loved the dumplings!  ", "The Chicken Chow Mein was spiced perfectly. ", "Loved the Pulled Pork. "], "author": "Kate M.", "review": "Two moms came here with two teenage boys. We all loved the dumplings!  The Chicken Chow Mein was spiced perfectly. Loved the Pulled Pork. The Hot and Sour Vegetables with added tofu was very delicious too.  The ambiance was crisp and clean and the staff was friendly and helpful.", "rating": 5, "date": "2015-04-11"}, {"excerpts": ["One thing you must order are the Dumplings. ", "Do not leave without them in your belly. ", "I'm sad that I'm not at Henry's right now. ", ":("], "author": "Katie D.", "review": "This place came highly recommended through Time Out and the internet. All I have to say is EAT HERE. It will not disappoint. Not kidding, it was 100% the best Chinese food I have ever had in my life. It was my last meal of my San Francisco trip and I was over the moon about it. I said \"wow\" at least twenty times throughout the meal. The service was amazing and genuine. Louis was so sweet, gracious and had wonderful suggestions. The food was clean, fresh and the flavors were true parties in my mouth. One thing you must order are the Dumplings. Do not leave without them in your belly. I'm sad that I'm not at Henry's right now. :(", "rating": 5, "date": "2014-10-28"}, {"excerpts": ["Fantastic dumplings, great hot and sour beef.\n", "The service was prompt and the meals were delivered on time except for the orange chicken whick came late...", "but WOW, it was worth the wait, w/o a doubt the best I've ever had!"], "author": "Brian M.", "review": "Fantastic dumplings, great hot and sour beef.\nThe service was prompt and the meals were delivered on time except for the orange chicken whick came late...but WOW, it was worth the wait, w/o a doubt the best I've ever had!", "rating": 5, "date": "2015-05-09"}, {"excerpts": ["Started out with Dumplings and Meat Pie.  ", "Meat pie was fantastic!   ", "That was new to me but everyone loved it.  ", "For the main course, we had Mu Shu chicken and spicy fried food. ", "Both were hits!  ", "Very friendly service and reasonable prices.  ", "Solid all the way around."], "author": "Don S.", "review": "Took a walk through China Town and landed at Henry's for dinner for two adults and two kids.  Started out with Dumplings and Meat Pie.  Meat pie was fantastic!   That was new to me but everyone loved it.  For the main course, we had Mu Shu chicken and spicy fried food. Both were hits!  Very friendly service and reasonable prices.  Solid all the way around.", "rating": 5, "date": "2015-03-20"}, {"excerpts": ["Great food, especially dumplings and meat pie! ", "Other dishes must be good the place was packed for lunch, but they have extra room up top to accommodate overflow. ", "Would definitely recommend!"], "author": "Bunny P.", "review": "Wonderful, fast service! Great food, especially dumplings and meat pie! Other dishes must be good the place was packed for lunch, but they have extra room up top to accommodate overflow. Would definitely recommend!", "rating": 5, "date": "2015-10-14"}, {"excerpts": ["The food was also fresh and delicious, especially the dumplings,  chicken with black bean sauce,  and string beans.  ", "I also liked the brown rice option. ", "I suspect this will be a regular go to place for me."], "author": "Grace K.", "review": "I'm so happy Henry's Hunan has moved into the neighborhood.  The restaurant is clean, and the wait staff was really friendly and attentive.  The food was also fresh and delicious, especially the dumplings,  chicken with black bean sauce,  and string beans.  I also liked the brown rice option. I suspect this will be a regular go to place for me.", "rating": 5, "date": "2013-11-19"}], "dianas special delicious meat pie": [], "onion cakes": [{"excerpts": ["Still the best onion cakes, and we loved the Diana's special version.  ", "Meaty and satisfying, balancing the spicy minced pork with the crispy, cooling lettuce.  ", "Wonderful eggplant, which basks in a richly flavorful garlic sauce.  ", "As always, well done."], "author": "Bill M.", "review": "An old favorite, dating back many years to when we first lived in the Bay Area and visited the original hole-in-the-wall Hunan.  Still the best onion cakes, and we loved the Diana's special version.  Meaty and satisfying, balancing the spicy minced pork with the crispy, cooling lettuce.  Wonderful eggplant, which basks in a richly flavorful garlic sauce.  As always, well done.", "rating": 4, "date": "2018-04-22"}, {"excerpts": ["Got the combination Chow Mein, harvest pork, Mongolian beef, onion cakes, and egg rolls. ", "The harvest pork was my favorite. ", "Come here!"], "author": "Jeff L.", "review": "Awesome Chinese food! Got the combination Chow Mein, harvest pork, Mongolian beef, onion cakes, and egg rolls. The harvest pork was my favorite. Come here!", "rating": 5, "date": "2015-07-13"}, {"excerpts": ["Onion Cakes: These are also great for an appetizer. ", "The Onion Cakes are fried, fluffy and crispy, but can use a little bit more flavor and more green onions.\n\n"], "author": "Stephen C.", "review": "HUNAN HOT.\n\nThe restaurant is a perfect place to for quick, fast, chinese food to-go. The restaurant tries to go for a healthy themed Chinese restaurant.\n\nFOOD: Chicken with mixed vegetables: Great dish that comes with sauteed chicken, bell peppers, onions, mushroom, carrots, and scallion. The sauce is not too heavy and it definitely tastes healthy without having you fill like you have over eaten.\n\nOnion Cakes: These are also great for an appetizer. The Onion Cakes are fried, fluffy and crispy, but can use a little bit more flavor and more green onions.\n\nSERVICE: The service here is great. The owners of the restaurant try to make sure you have everything you need. They also offered tea while you waited if the wait was too long. \n\nAMBIANCE: The restaurant looks modern with red wood floors and chairs. It's a typical modern restaurant that you would expect but serves chinese food.\n\nOverall: Great place for take out in North Beach if you are looking for something quick to eat!", "rating": 4, "date": "2013-12-22"}], "mixed seafood soup": [], "mo si soup": [{"excerpts": ["We also ordered the Mo Si soup (perfect portion for three people), the pork fried rice with an egg (my favorite dish of the night), the Kung Pao shredded pork, and the dry-sauteed string beans. ", "The only mediocre item was the string beans and only because they weren't cooked long enough. "], "author": "Regina L.", "review": "My family went to Henry's Hunan for dinner last night and had a great time. The food is super authentic and delicious, and the prices are totally reasonable! We went specifically for the meat pie because we heard it was one of a kind. It's worth making a trip over there JUST for the meat pie. The only way to explain is it like a Chinese tostada. We also ordered the Mo Si soup (perfect portion for three people), the pork fried rice with an egg (my favorite dish of the night), the Kung Pao shredded pork, and the dry-sauteed string beans. The only mediocre item was the string beans and only because they weren't cooked long enough. The beers are only 3.50 and you get hot tie right when you sit down. \n\nThe only reason this place gets four stars instead of five is because of the service. It was some of the slowest service I've experienced in a very long time, and the place was not that crowded. Not only did the food come out item by item (with 5-10 minutes in between), but when we would ask for something (like a glass of water or soy sauce) our server would forget and we'd have to remind him once or twice more. Getting the bill also took quite some time. Regardless, we will definitely be coming back, and ordering our Chinese takeout from there.", "rating": 4, "date": "2015-02-05"}, {"excerpts": ["This seriously might be the best Kung Pao beef I've ever had - the half order of Mo Si soup ", "I got was delicious as well! ", "Combined with a Tsing Tao and a great meal was had! ", "Will definitely come again when I'm town next!"], "author": "Kyle L.", "review": "This seriously might be the best Kung Pao beef I've ever had - the half order of Mo Si soup I got was delicious as well! Combined with a Tsing Tao and a great meal was had! Will definitely come again when I'm town next!", "rating": 5, "date": "2014-06-23"}], "bean sprout salad": [], "eggplant salad": [], "dry sauteed string beans": [], "mo si vegetables": [], "delight vegetables": [], "hot and sour vegetables": [{"excerpts": ["We got a bowl of vegetarian hot and sour soup, egg rolls, vegetable chow-mien, vegetable fried rice, king pao tofu and hot and sour vegetables. ", "EVERYTHING was delicious and perfectly portioned. ", "The stars of the dinner were definitely the soup and Kung Pao Tofu. \n", "Friendly servers, clean restaurant and quick service. ", "Definitely going back to try the other vegetarian dishes. ", "Great pick for vegetarian as they have plenty of options and can customize the ones they do not."], "author": "HCfoodler C.", "review": "Loved the food here! \nWent for dinner over the weekend; it was pretty busy. Got a table in minutes. \nWe got a bowl of vegetarian hot and sour soup, egg rolls, vegetable chow-mien, vegetable fried rice, king pao tofu and hot and sour vegetables. EVERYTHING was delicious and perfectly portioned. The stars of the dinner were definitely the soup and Kung Pao Tofu. \nFriendly servers, clean restaurant and quick service. Definitely going back to try the other vegetarian dishes. Great pick for vegetarian as they have plenty of options and can customize the ones they do not.", "rating": 5, "date": "2018-10-11"}, {"excerpts": ["We had egg rolls, hot and sour vegetables, dumplings and chicken lo "], "author": "Patrick P.", "review": "We came on a Sunday evening, no wait and we sat near a window. Parking was difficult but the area was walkable. We had egg rolls, hot and sour vegetables, dumplings and chicken lo mein along with moo shi. \n\nWill come back. It's a few blocks from Chinatown. Restaurant was clean and staff friendly and efficient.", "rating": 5, "date": "2016-07-10"}, {"excerpts": ["I picked out the hot and sour vegetables and we also ordered a plate of white rice, plus a glass of wine and a beer. ", "I was a bit surprised that the hot and sour vegetables came in a pale sauce, I was expecting something reddish or orange at least but no matter, I piled rice on my plate and a few spoonfuls of veggies and dove in. ", "The heat of this dish was intense, far spicier than I'm used to, but the sweetness of the bamboo shoots and the glass of wine plus the plainness of the rice helped dull it a bit. ", "It was delicious and I ate about half easily. "], "author": "Cassandra J.", "review": "After wandering around North Beach a bit and being disappointed that several of our favourite restaurants were closed at the time, I noticed Henry's Hunan right nearby and suggested we check it out, as I'd never been there before and my partner hadn't tried this particular location. We were both excited to have Chinese food and we were seated and our order taken promptly. \n\nMy partner ordered the chicken and string beans, a standard dish that's one of his favourites, and a good way of comparing some of our other preferred Chinese restaurants to here. I picked out the hot and sour vegetables and we also ordered a plate of white rice, plus a glass of wine and a beer. We didn't have to wait too long before our meal came out (although separately, with about 2 minutes between each plate but whatever). \n\nI was a bit surprised that the hot and sour vegetables came in a pale sauce, I was expecting something reddish or orange at least but no matter, I piled rice on my plate and a few spoonfuls of veggies and dove in. The heat of this dish was intense, far spicier than I'm used to, but the sweetness of the bamboo shoots and the glass of wine plus the plainness of the rice helped dull it a bit. It was delicious and I ate about half easily. The rest I took home for later since it was that good, I didn't want to let it go to waste.\n\nMy partner noticed the chicken and string beans came with a chili black bean sauce, one of his favourite sauces. He thought his dish was amazing and ate every last bit of it.\n\nService was a tad slow but there seemed to be a large family gathering in the central table, we're talking 20+ people, so I can forgive them for it. Because of the layout of the restaurant, the noise of the large party was practically deafening, so be warned that this place can get pretty loud if there's a lot of people in it. Overall though, we'd happily return here, there were quite a few things on the menu that looked delicious and I would love to try more.", "rating": 4, "date": "2015-07-12"}, {"excerpts": ["The Hot and Sour Vegetables with added tofu was very delicious too.  ", "The ambiance was crisp and clean and the staff was friendly and helpful."], "author": "Kate M.", "review": "Two moms came here with two teenage boys. We all loved the dumplings!  The Chicken Chow Mein was spiced perfectly. Loved the Pulled Pork. The Hot and Sour Vegetables with added tofu was very delicious too.  The ambiance was crisp and clean and the staff was friendly and helpful.", "rating": 5, "date": "2015-04-11"}], "curry vegetables": [{"excerpts": ["Also had curry vegetables, which were standard American veggies, broccoli, carrots, peppers, etc. \n\n"], "author": "David O.", "review": "The food was good, but definitely Americanized. For appetizer, the meat pie was very nice. Asked for extra spicy and was a little disappointed there as it was fairly mild. \n\nMain courses of harvest pork (twice cooked pork by another name) and Rock Cod fillets. Pork was Average and fish tasted as if they had been frozen. Also had curry vegetables, which were standard American veggies, broccoli, carrots, peppers, etc. \n\nGiven the proximity to Chinatown the food was a little disappointing. \n\nOnly other issue was the overall salt level was a little too high. \n\nThe place was very clean and inviting, the staff was very courteous and the service was very good.", "rating": 3, "date": "2014-03-09"}, {"excerpts": ["The curry vegetables had American vegetables so that was disappointing.  ", "We were surrounded by non Asians. ", "I think eating in Chinatown allows you better tasting food although the cleanliness & friendliness if this place cannot be beat."], "author": "Cherie O.", "review": "Food was salty & Americanized. The spicy Rick cod fish needed hot chili oil, yet it still lacked flavor. Hubby had Harvest Pork which he & I specifically requested to be spicy but again it was not spicy. He described it as twice cooked pork with a fancy name. The curry vegetables had American vegetables so that was disappointing.  We were surrounded by non Asians. I think eating in Chinatown allows you better tasting food although the cleanliness & friendliness if this place cannot be beat.", "rating": 3, "date": "2014-03-09"}, {"excerpts": ["The curry vegetables with tofu is the best example of its kind I've ever had (I think it's called dry curry).\n\n"], "author": "Chad D.", "review": "The place is fantastic: the food is delicious and the waiters are very nice and helpful. \n\nThe five spice tofu is wonderful. The curry vegetables with tofu is the best example of its kind I've ever had (I think it's called dry curry).\n\nThe portions are very large (large enough for 2 meals if you aren't super hungry and take away the leftovers) and they give much better free tea than other places with free tea.\n\nI think this is my favorite Chinese restaurant anywhere in the world!", "rating": 5, "date": "2014-01-12"}], "sauteed broccoli": [], "country style vegetables and tofu": [], "house bean curd": [], "braised tofu with chinese greens": [], "spice bean curd": [], "bean curd with meat sauce": [], "henrys shredded pork": [], "harvest pork": [{"excerpts": ["Main courses of harvest pork (twice cooked pork by another name) and Rock Cod fillets. ", "Pork was Average and fish tasted as if they had been frozen. "], "author": "David O.", "review": "The food was good, but definitely Americanized. For appetizer, the meat pie was very nice. Asked for extra spicy and was a little disappointed there as it was fairly mild. \n\nMain courses of harvest pork (twice cooked pork by another name) and Rock Cod fillets. Pork was Average and fish tasted as if they had been frozen. Also had curry vegetables, which were standard American veggies, broccoli, carrots, peppers, etc. \n\nGiven the proximity to Chinatown the food was a little disappointing. \n\nOnly other issue was the overall salt level was a little too high. \n\nThe place was very clean and inviting, the staff was very courteous and the service was very good.", "rating": 3, "date": "2014-03-09"}, {"excerpts": ["Got the combination Chow Mein, harvest pork, Mongolian beef, onion cakes, and egg rolls. ", "The harvest pork was my favorite. ", "Come here!"], "author": "Jeff L.", "review": "Awesome Chinese food! Got the combination Chow Mein, harvest pork, Mongolian beef, onion cakes, and egg rolls. The harvest pork was my favorite. Come here!", "rating": 5, "date": "2015-07-13"}, {"excerpts": ["We ordered the Harvest Pork, Hot and Sour Chicken, and the Crescent Dumplings. ", "The two entrees were good sized portions and perfectly spicy (definitely on the hot side). ", "The pork dumplings were also quite good and surprisingly light.\n\n"], "author": "Max J.", "review": "Stumbled into this restaurant after realizing there was going to be a two hour wait at the place we were originally planning to go to. Overall, we were pleasantly surprised and look forward to eating here again next time we are in North Beach.\n\nAmbiance is very nice and everything is extremely clean. We ordered the Harvest Pork, Hot and Sour Chicken, and the Crescent Dumplings. The two entrees were good sized portions and perfectly spicy (definitely on the hot side). The pork dumplings were also quite good and surprisingly light.\n\n4 stars only because service was a little slow but not terribly so. Took awhile to get water and hot tea as there was only one waitress.", "rating": 4, "date": "2015-01-11"}, {"excerpts": ["i ate their harvest pork 2 twice for lunch this week.  ", "i ate the left overs one additional time for breakfast.  ", "ok, ok, and i have left overs from today's lunch that i'll probably eat tomorrow for breakfast too.  ", "i'll have to see about all that once i get past the harvest pork."], "author": "lori s.", "review": "OMG! i love love love love LOVE henry's hunan.  i ate their harvest pork 2 twice for lunch this week.  i ate the left overs one additional time for breakfast.  ok, ok, and i have left overs from today's lunch that i'll probably eat tomorrow for breakfast too.  (can't wait!)\n\ni also had their sweet and sour soup which was amazing.\n\nthis is my new favorite chinese food place which is saying a lot for me b/c i'm not that wild about chinese food.  \n\nhenry's uses no mgs and their ingredients are all fresh and healthy.  they're also really nice and the prices are reasonable.  i really can't imagine what else you could possibly want.\n\nthe reason i went to henry's in the first place was for their chinese chicken salad.  some fancy shmancy famous foodie chef who's opening a new restaurant in the mission said he was addicted to it.  that's a pretty good recommendation, huh?  i'll have to see about all that once i get past the harvest pork.", "rating": 5, "date": "2014-01-29"}, {"excerpts": ["Hubby had Harvest Pork which he & I specifically requested to be spicy ", "but again it was not spicy. ", "He described it as twice cooked pork with a fancy name. "], "author": "Cherie O.", "review": "Food was salty & Americanized. The spicy Rick cod fish needed hot chili oil, yet it still lacked flavor. Hubby had Harvest Pork which he & I specifically requested to be spicy but again it was not spicy. He described it as twice cooked pork with a fancy name. The curry vegetables had American vegetables so that was disappointing.  We were surrounded by non Asians. I think eating in Chinatown allows you better tasting food although the cleanliness & friendliness if this place cannot be beat.", "rating": 3, "date": "2014-03-09"}], "shredded pork with celery": [], "deep fried shredded pork": [], "hunan spare ribs": [{"excerpts": ["We ate Hunan spare ribs which came chopped into ti lets and had a black bean sauce with onion and peppers. ", "Best ribs !! ", "So good. ", "The combo chow mein rounded out the meal. ", "We will be back'"], "author": "Brian D.", "review": "We had a fantastic lunch here. The restaurant is clean and the service very attentive. We ate Hunan spare ribs which came chopped into ti lets and had a black bean sauce with onion and peppers. Best ribs !! So good. The combo chow mein rounded out the meal. We will be back'", "rating": 5, "date": "2016-01-15"}], "mo si pork": [], "kung pao shredded pork": [{"excerpts": ["We also ordered the Mo Si soup (perfect portion for three people), the pork fried rice with an egg (my favorite dish of the night), the Kung Pao shredded pork, and the dry-sauteed string beans. ", "The only mediocre item was the string beans and only because they weren't cooked long enough. "], "author": "Regina L.", "review": "My family went to Henry's Hunan for dinner last night and had a great time. The food is super authentic and delicious, and the prices are totally reasonable! We went specifically for the meat pie because we heard it was one of a kind. It's worth making a trip over there JUST for the meat pie. The only way to explain is it like a Chinese tostada. We also ordered the Mo Si soup (perfect portion for three people), the pork fried rice with an egg (my favorite dish of the night), the Kung Pao shredded pork, and the dry-sauteed string beans. The only mediocre item was the string beans and only because they weren't cooked long enough. The beers are only 3.50 and you get hot tie right when you sit down. \n\nThe only reason this place gets four stars instead of five is because of the service. It was some of the slowest service I've experienced in a very long time, and the place was not that crowded. Not only did the food come out item by item (with 5-10 minutes in between), but when we would ask for something (like a glass of water or soy sauce) our server would forget and we'd have to remind him once or twice more. Getting the bill also took quite some time. Regardless, we will definitely be coming back, and ordering our Chinese takeout from there.", "rating": 4, "date": "2015-02-05"}], "smoked ham": [{"excerpts": ["Combo fried rice with smoked ham, chicken, beef, and shrimp.  ", "While the chicken & beef didn't have too much flavor ", "the smoked ham had a complex smoky and savory flavor.  ", "Shrimp was good but there were not very many of them ", "and they were tiny.  ", "The rice and egg didn't have too much flavor either.  ", "Next time I'm getting the smoked ham fried rice.\n\n"], "author": "Soo H.", "review": "My first visit to San Francisco with Mari we found the most delicious fried rice ever at Chef Jia's.  The flavors from the wok, the seasonings, and the meats were divine.  After they closed we have tried the fried rice at many places but none have been as good.  Seeing as Chef Jia's was a Hunan restaurant I had high hopes for Henry's Hunan.\n\nCombo fried rice with smoked ham, chicken, beef, and shrimp.  While the chicken & beef didn't have too much flavor the smoked ham had a complex smoky and savory flavor.  Shrimp was good but there were not very many of them and they were tiny.  The rice and egg didn't have too much flavor either.  Next time I'm getting the smoked ham fried rice.\n\nWhile the ham was excellent here I am going to keep searching for the one perfect fried rice dish like I had at Chef Jia's.", "rating": 3, "date": "2016-08-11"}, {"excerpts": ["He highly recommends the Hunan Smoked Ham which is stir fried wuthering bell pepper, onion and carrots.   ", "I tried it ", "but it was very salty and spicy, IMO.  \n"], "author": "Sharon F.", "review": "This is my brother's favorite Chinese restaurant.   He highly recommends the Hunan Smoked Ham which is stir fried wuthering bell pepper, onion and carrots.   I tried it but it was very salty and spicy, IMO.  \nI had the dumplings, which were just okay.  I also had onion rolls or fritters.   It was an appetizer.  It left me wondering what it was and why I ordered it.   Four stars because my brother LOVED his dish and the place was clean.", "rating": 4, "date": "2017-04-29"}, {"excerpts": ["Try their smoked ham dish and the Henry's special!  "], "author": "Theron L.", "review": "Most of their dishes can be made gluten free!  Try their smoked ham dish and the Henry's special!  These are my go to favorites here hands down!\n\nThis is around the street from my girlfriend's place so it's where we go when we're feeling lazy or simply have a craving.  Having a gluten-challenged immune system it's one of the few Chinese places I can eat at and not worry about having a stomach ache or swollen hands afterwards and it's strategically located right down the street from Tope which has a great happy hour until 10 pm.\n\n*emoji of pagoda here*\nEnjoy!", "rating": 4, "date": "2014-07-23"}, {"excerpts": ["First Hunan Smoked Ham might be my favorite food in the whole world.  ", "I have it at every Hunan restaurant I visit.  ", "I've made it myself from the recipe of Henry Chung himself.  ", "I'm actually eating it right now ", "as I write this - take out from a little place in San Jose (8.8 Kearneys), but I digress.  ", "Second I love salty food.  ", "I salt food that other people think is too salty.  ", "I love me some salt.  ", "But, on my last visit, the Hunan Smoked Ham was INSANELY salty.   ", "Not so salty that I couldn't eat it, but nobody else at the table could, and I didn't enjoy it. ", "Seriously, you need to find a way to cut down on the saltiness because it was nearly inedible the last time.  ", "Maybe it was just a bad night, and i'll try it again, but it would be a deal breaker for me if it is always that way.  ", "Everything else was delicious."], "author": "Vernon M.", "review": "Here are my \"bona fides\":   I have been a fan of Henry Chung's Hunan restaurants since 1979 when I first moved to the Bay Area and I used to go to his original little place on Kearny Street (man, I miss that place).  I've eaten a million times at the big place on Sansome over the years, which is good, but not Kearny Street good.  I've also eaten at virtually every Hunan restaurant from SF to SJC.  I dined at the new Henry's Hunan on Grant Street for the first time last night.  I give it 9.7 Kearnys out of 10!  I'm honestly not sure if it really deserves to fall short of a full 10 Kearny rating.  It may just be that nothing will ever be able to match my memory of the Kearny location.   You're probably getting the idea that I liked it.  Not only was the food the best Hunan cuisine I've had in a long time (and compared with some pretty fine food at other places), but the restaurant is really nicely appointed, and located on a really cute little section of Grant Ave.  It is North Beach, not Chinatown, but if you are looking for a fun place to walk around before and after dinner - or a real authentic old San Francisco atmosphere for your tourist friends, take them here.  It is, of course, spicy.  But we asked them for 'medium hot' because one of our party was not into ring stingers, and they hit perfectly.  Go.  Go now.  This is my new favorite Chinese restaurant.\n\nUpdate upon latest visit: ..and this is mostly in hope that the restaurant will read it.  Two things:  First Hunan Smoked Ham might be my favorite food in the whole world.  I have it at every Hunan restaurant I visit.  I've made it myself from the recipe of Henry Chung himself.  I'm actually eating it right now as I write this - take out from a little place in San Jose (8.8 Kearneys), but I digress.  Second I love salty food.  I salt food that other people think is too salty.  I love me some salt.  But, on my last visit, the Hunan Smoked Ham was INSANELY salty.   Not so salty that I couldn't eat it, but nobody else at the table could, and I didn't enjoy it. Seriously, you need to find a way to cut down on the saltiness because it was nearly inedible the last time.  Maybe it was just a bad night, and i'll try it again, but it would be a deal breaker for me if it is always that way.  Everything else was delicious.", "rating": 5, "date": "2014-02-14"}, {"excerpts": ["The waiter told me he was going to give me a small bowl, as well as a small plate of Hunan-style smoked ham fried rice. ", "Imagine my surprise at the size of this bowl. ", "And it has so much tofu, bamboo shoots and mushrooms. ", "It was a meal in itself."], "author": "François L.", "review": "I had walked in front of this place several times. It was only after a cold that I felt the need for hot and sour soup. The waiter told me he was going to give me a small bowl, as well as a small plate of Hunan-style smoked ham fried rice. Imagine my surprise at the size of this bowl. And it has so much tofu, bamboo shoots and mushrooms. It was a meal in itself.", "rating": 5, "date": "2014-03-21"}, {"excerpts": ["Then we shared Velvet Chicken, Orange Chicken and Smoked Ham Chow Mein with Boiled White Rice. ", "Everything was cooked nicely and spiced delicately. ", "Service was friendly. ", "Would come back any time :)"], "author": "Paul C.", "review": "First time here. Came for lunch for 5 and ordered Onion Cake and Meat Pie for appetizers. They were different, interesting and tasty. Then we shared Velvet Chicken, Orange Chicken and Smoked Ham Chow Mein with Boiled White Rice. Everything was cooked nicely and spiced delicately. Service was friendly. Would come back any time :)", "rating": 4, "date": "2014-04-18"}], "martys special": [], "smoked ham with string beans": [], "henrys special": [], "braised rock cod fillets": [], "spicy hot rock cod fillets": [], "kung pao shrimp": [], "hunan shrimp": [], "spicy shrimp with bean curd": [{"excerpts": ["I specially love the Spicy Shrimp with bean curd and meat sauce."], "author": "Don j. c.", "review": "One of my favorite restaurants in North Beach. I get it to go once a week and it is always delicious fast hot clean and friendly service. Everything I've tried on the menu is amazing. I specially love the Spicy Shrimp with bean curd and meat sauce.", "rating": 5, "date": "2015-04-19"}], "shrimp with string beans": [], "shrimp with napa cabbage": [], "hunan scallops": [{"excerpts": ["We had the Hunan Scallops, Chicken with Mixed Vegetables, Dumplings and Steamed Brown Rice. ", "Very reasonable prices, most especially for San Francisco. ", "The neighborhood is just a touch on the rough side, but nothing so serious as to prevent us from returning."], "author": "Steve A.", "review": "We dined here tonight based upon Yelp reviews, and it did not disappoint. It was very quiet, so service was very prompt and attentive. We had the Hunan Scallops, Chicken with Mixed Vegetables, Dumplings and Steamed Brown Rice. Very reasonable prices, most especially for San Francisco. The neighborhood is just a touch on the rough side, but nothing so serious as to prevent us from returning.", "rating": 5, "date": "2015-04-16"}], "fresh sauteed squid": [], "orange sauce chicken": [], "hunan velvet chicken": [], "chicken with broccoli": [], "hot and sour chicken": [{"excerpts": ["We got the hot and sour chicken and one of their rice dishes and both were absolutely delicious. ", "I'm used to sweet and sour chicken, but not hot and sour chicken so this was a new dish for me. ", "It tastes just like the soup, but is a thicker sauce. ", "The chicken was cooked really well. ", "The rice had the most fantastic flavor. "], "author": "Emma W.", "review": "I love Italian food, but was so relieved to see an Asian restaurant in North Beach (basically Little Italy). Sometimes you're just craving Asian food ya know? After bar hopping on a Saturday night, I stopped by around 8pm and was seated right away. Service was efficient and friendly, and our food arrived pretty quickly. Plus, I like that it's not expensive for such a pricey neighborhood! \n\nWe got the hot and sour chicken and one of their rice dishes and both were absolutely delicious. I'm used to sweet and sour chicken, but not hot and sour chicken so this was a new dish for me. It tastes just like the soup, but is a thicker sauce. The chicken was cooked really well. The rice had the most fantastic flavor. I can't really explain it, but let's just say I wish that plate would keep refilling itself. \n\nI would definitely recommend!", "rating": 4, "date": "2016-12-15"}, {"excerpts": ["For entrees, I do recommend their Mushu Pork, Beef and String Beans and Hot and Sour Chicken.  "], "author": "Tiffany D.", "review": "Hunan food that warms and comforts the palate with its tasty, stir-fried entrees!\n\nAs starters, do get their signature Meat Pie, Dumplings and Hot and Sour Soup!  You can't go wrong with that opening combo! \n\nFor entrees, I do recommend their Mushu Pork, Beef and String Beans and Hot and Sour Chicken.  All three of these dishes are unique and tingles the palate in its own delightful way!\n\nThe service was attentive and accommodating. \n\nIt's a cozy, tight-knit spot in North Beach!", "rating": 5, "date": "2014-01-27"}, {"excerpts": ["We ordered the Harvest Pork, Hot and Sour Chicken, and the Crescent Dumplings. ", "The two entrees were good sized portions and perfectly spicy (definitely on the hot side). ", "The pork dumplings were also quite good and surprisingly light.\n\n"], "author": "Max J.", "review": "Stumbled into this restaurant after realizing there was going to be a two hour wait at the place we were originally planning to go to. Overall, we were pleasantly surprised and look forward to eating here again next time we are in North Beach.\n\nAmbiance is very nice and everything is extremely clean. We ordered the Harvest Pork, Hot and Sour Chicken, and the Crescent Dumplings. The two entrees were good sized portions and perfectly spicy (definitely on the hot side). The pork dumplings were also quite good and surprisingly light.\n\n4 stars only because service was a little slow but not terribly so. Took awhile to get water and hot tea as there was only one waitress.", "rating": 4, "date": "2015-01-11"}, {"excerpts": ["We also got the fried rice and the hot and sour chicken, which were both good but didn't hold a candle next tithe meat pie and the smoked pork. ", "Next time we'll just get those two and share; it's plenty for two people."], "author": "Marty A.", "review": "Our first trip to Chinatown ended in a hike up to Henry's thanks to the reviews here on Yelp. I had a hard time believing a five-star restaurant could be reasonably priced. Boy am I glad we took the chance.\n\nOur waitress recommended the meat pie to start, and it was excellent. It's served in four slices that are probably big enough to each be an appetizer alone.\n\nI always order a house special when I'm at a new restaurant, and at Henry's those specialties are smoked Hunan-style. I decided to get the Marty's Special, because I thought it was funny, since my name's Marty and I don't see it often.\n\nThe waitress thought I had been here before and said I knew how to order, because the Marty's Special is fantastic. The chicken in it was good enough but the pork was worth the price alone. Tender and smoky, it was easily the best I've had yet.\n\nWe also got the fried rice and the hot and sour chicken, which were both good but didn't hold a candle next tithe meat pie and the smoked pork. Next time we'll just get those two and share; it's plenty for two people.", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["I love their hot and sour chicken, as well as the kung pao chicken. "], "author": "Caroline M.", "review": "I am so glad Henry's Hunan moved into the neighborhood - and approximately 100 feet from my house. \n\nEveryone here is incredibly friendly and the food is beautifully prepared.\n\nVery fresh, loaded with veggies and not super heavy. They have lots of gluten free options (if you're into that kinda thing) and hardly any of the menu items are fried.\n\nSoups are great to share. I love their hot and sour chicken, as well as the kung pao chicken. This one one of my favorite weekday places to grab dinner, when I don't feel like cooking.\n\nYUM!", "rating": 5, "date": "2013-11-09"}], "chicken with string beans": [], "garlic chicken": [{"excerpts": ["We've tried the Kung Pao chicken, Mongolian beef, stir fry string beans (really good), and the garlic chicken. "], "author": "Kate K.", "review": "This quickly became one of my go-to Chinese food spots anytime I visit SF. The food is easily 5 stars, as everything I've tried has been fresh, authentic, and delicious. It's a somewhat small place with about 12 tables, but it's extremely clean and has a simple, modern atmosphere. \n\nThey start you off with tea, which is a rarity these days unless you're getting dim sum. We always order the hot & sour soup, which is hands down the best I've ever had. We've tried the Kung Pao chicken, Mongolian beef, stir fry string beans (really good), and the garlic chicken. I try to get something different every time I go, since I have yet to be disappointed by anything. \n\nThe only reason I didn't bump to 5 stars is because the service is hit or miss. The first time we came, it was just OK, but it was pretty busy. The second time, it was excellent and super quick and this last time was pretty slow, and there was no crowd. Their prices are definitely inexpensive for the area, and again, it's cleaner than most of the places we've tried in Chinatown so we'll continue to come whenever we're in town.", "rating": 4, "date": "2016-01-03"}, {"excerpts": ["I've ordered the Garlic Chicken plate as well and enjoyed it. "], "author": "Ainslee S.", "review": "When I lived in the neighborhood, this place was a weekly treat. Having tasted many of the Chinese restaurants in the North Beach / Chinatown area this was consistently my favorite. \n\nLouis, the owner, is sweet and charismatic and scrambles around to make sure everybody's happy. You can tell right away he's the glue that holds this place together. When I came in with the sniffles, he sent me on my way with magical Won Ton soup to cure my cold. \n\nHenry's always tastes fresh to me - with deliciously spicy, clean flavors. And Diana's meat pie is a MUST. Start with that. End with that. Just make sure you try it. Slather it with the homemade chili sauce for a truly spiritual experience. \n\nI always order the Kung Pao chicken with a side of broccoli - a meal that perfectly satiates without feeling too heavy. But for kids or picky eaters, I would recommend the Orange Chicken - it's sweet and tangy. I've ordered the Garlic Chicken plate as well and enjoyed it. One thing - the plates do not come with rice so it is an extra charge (I believe). \n\nWith hearty and fresh tasting food, sweet and caring staff, and a modern but cozy atmosphere, I would recommend filling your belly with Henry's before hitting the bars on Grant or with a friend on a cold, rainy evening.", "rating": 5, "date": "2017-01-23"}, {"excerpts": ["Items ordered:\nMongolian Chicken\nChicken chow mein \nChicken fried rice (a little salty, but it was ok for my preference) \nHunan Spareribs\nGarlic chicken\nCombination fried rice and chow mein\n\n"], "author": "Rochelle E.", "review": "Service was fast and food was tasteful. Would come back if was in town. \nItems ordered:\nMongolian Chicken\nChicken chow mein \nChicken fried rice (a little salty, but it was ok for my preference) \nHunan Spareribs\nGarlic chicken\nCombination fried rice and chow mein\n\nThere was a lot of us", "rating": 4, "date": "2017-11-07"}, {"excerpts": ["Garlic chicken  came highly recommended  but it was overcooked and bland. ", "We did like the Mongolian beef ", "but it was mostly onions. ", "I would try it again but definitely  ask them to lower the salt"], "author": "Anthony K.", "review": "Made reservations  for 730 and we were seated promptly . The service  was a little slow to start. Once we ordered the food came quickly.  Tried their meat pie . This tasted like Indian fry bread . Moo shu pork was tasty but also very salty. The tofu was horrible . Garlic chicken  came highly recommended  but it was overcooked and bland. We did like the Mongolian beef but it was mostly onions. I would try it again but definitely  ask them to lower the salt", "rating": 3, "date": "2017-06-19"}, {"excerpts": ["Garlic chicken, fried rice, and dumplings are yummy. ", "Enjoy!"], "author": "Crystal C.", "review": "Delicious! Nice 15 minute walk from Fisherman's Wharf. \nGarlic chicken, fried rice, and dumplings are yummy. Enjoy!", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["Loved the garlic chicken and the hot and sour soup which was HOT and SOUR in all the right ways.  \n\n"], "author": "Marc I.", "review": "Real good Chinese food prepared effortlessly for a gluten-free diet.  The selection can all be basically prepared GF except for the obvious stuff (wheat noodles and breaded deep fried items). My daughter has celiac and Henry's was a revelation to her. She said it perfectly - \"this is so strange, having a full selection of Chinese food in an authentic Chinese restaurant. I'm so happy!!!\"  I'm also a dyed-in-the-wool New York Chinese food biased snob (but fun at parties) and this place clears that hurdle with room to spare.  Oh the fried rice is a must.  Loved the garlic chicken and the hot and sour soup which was HOT and SOUR in all the right ways.  \n\nService was also really nice, fast and understanding.  \n\nThank you Henry's!  You made my daughter happy and so, of course, her father is happy and not just because I enjoyed the food as well.", "rating": 4, "date": "2015-11-08"}, {"excerpts": ["The garlic chicken is meh (one note flavor, and it's not even garlicky-- just kinda...soy saucy?).  "], "author": "Lily N.", "review": "Hard place to rate.  \n\nThe chicken chow mein is really good (spicy and celery with cabbage make it awesome).  The garlic chicken is meh (one note flavor, and it's not even garlicky-- just kinda...soy saucy?).  I think dishes are hit or miss.\n\nHowever, the pricing here is amazingly fair for the neighborhood!  Their $1.50 rice is like double the size of what other restaurants usually give.  Very generous proportions.  I guess you get what you pay for (almost like Panda Express but bit fresher food).  \n\nThe restaurant itself is very clean and has wooden floors/benches, and the service was awesome!", "rating": 3, "date": "2014-12-15"}, {"excerpts": ["My buddy's garlic chicken was better but not amazing. ", "So overall an \"OK\" spot for me."], "author": "Travis B.", "review": "Food was decent and portions were good, but hard to complain given the low prices. Had the string bean chicken - I could tell the string beans were canned, and they used wayyy too much cooking oil. With less oil it would've been much better. That said, I ate it all. My buddy's garlic chicken was better but not amazing. So overall an \"OK\" spot for me.", "rating": 2, "date": "2015-07-26"}, {"excerpts": ["Also shared the garlic chicken and veggie chow mein. ", "We had leftovers. ", "Didn't break the bank. ", "Nice restaurant, nice staff. ", "Would definitely recommend to friends and family when visiting Chinatown :)"], "author": "Bryan B.", "review": "Wife and I had the beef pie appetizer which was very good. Also shared the garlic chicken and veggie chow mein. We had leftovers. Didn't break the bank. Nice restaurant, nice staff. Would definitely recommend to friends and family when visiting Chinatown :)", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["The garlic chicken was incredibly bland and dumplings were way to doughy. ", "Definitely skip."], "author": "Reba N.", "review": "Not that good. The garlic chicken was incredibly bland and dumplings were way to doughy. Definitely skip.", "rating": 2, "date": "2015-12-05"}, {"excerpts": ["Of particular note are the veggie egg rolls and garlic chicken. ", "The service was friendly and fast with the decor slightly minimal, but clean. ", "I was extremely happy to bring my guests from out of town here and find my new favorite Asian restaurant in town."], "author": "Raffi M.", "review": "In short, this is the best Chinese restaurant I have ever eaten at in terms of food. Everything tasted fresh, without the heaviness that accompanies many Chinese American establishments. Of particular note are the veggie egg rolls and garlic chicken. The service was friendly and fast with the decor slightly minimal, but clean. I was extremely happy to bring my guests from out of town here and find my new favorite Asian restaurant in town.", "rating": 5, "date": "2014-04-20"}, {"excerpts": ["The place was clean (almost spotless) and aesthetically pleasing (good layout), the staff were very friendly and attentive, and the food was incredible (I got the Garlic Chicken. ", "Highly recommended."], "author": "Michael S.", "review": "Easily the best Chinese Restaurant experience I've had in years.  The place was clean (almost spotless) and aesthetically pleasing (good layout), the staff were very friendly and attentive, and the food was incredible (I got the Garlic Chicken. Highly recommended.", "rating": 5, "date": "2014-04-21"}, {"excerpts": ["Beef with green onions and garlic chicken was delicious.  ", "Completely affordable at $35 for two people including drinks.  ", "Will definitely return."], "author": "Alex B.", "review": "New, clean, friendly.   Beef with green onions and garlic chicken was delicious.  Completely affordable at $35 for two people including drinks.  Will definitely return.", "rating": 5, "date": "2013-10-26"}], "chicken with peking sauce": [], "chicken with black bean sauce": [{"excerpts": ["The food was also fresh and delicious, especially the dumplings,  chicken with black bean sauce,  and string beans.  ", "I also liked the brown rice option. ", "I suspect this will be a regular go to place for me."], "author": "Grace K.", "review": "I'm so happy Henry's Hunan has moved into the neighborhood.  The restaurant is clean, and the wait staff was really friendly and attentive.  The food was also fresh and delicious, especially the dumplings,  chicken with black bean sauce,  and string beans.  I also liked the brown rice option. I suspect this will be a regular go to place for me.", "rating": 5, "date": "2013-11-19"}], "chicken with mixed vegetables": [{"excerpts": ["Chicken with mixed vegetables: Great dish that comes with sauteed chicken, bell peppers, onions, mushroom, carrots, and scallion. "], "author": "Stephen C.", "review": "HUNAN HOT.\n\nThe restaurant is a perfect place to for quick, fast, chinese food to-go. The restaurant tries to go for a healthy themed Chinese restaurant.\n\nFOOD: Chicken with mixed vegetables: Great dish that comes with sauteed chicken, bell peppers, onions, mushroom, carrots, and scallion. The sauce is not too heavy and it definitely tastes healthy without having you fill like you have over eaten.\n\nOnion Cakes: These are also great for an appetizer. The Onion Cakes are fried, fluffy and crispy, but can use a little bit more flavor and more green onions.\n\nSERVICE: The service here is great. The owners of the restaurant try to make sure you have everything you need. They also offered tea while you waited if the wait was too long. \n\nAMBIANCE: The restaurant looks modern with red wood floors and chairs. It's a typical modern restaurant that you would expect but serves chinese food.\n\nOverall: Great place for take out in North Beach if you are looking for something quick to eat!", "rating": 4, "date": "2013-12-22"}, {"excerpts": ["We had the Hunan Scallops, Chicken with Mixed Vegetables, Dumplings and Steamed Brown Rice. ", "Very reasonable prices, most especially for San Francisco. ", "The neighborhood is just a touch on the rough side, but nothing so serious as to prevent us from returning."], "author": "Steve A.", "review": "We dined here tonight based upon Yelp reviews, and it did not disappoint. It was very quiet, so service was very prompt and attentive. We had the Hunan Scallops, Chicken with Mixed Vegetables, Dumplings and Steamed Brown Rice. Very reasonable prices, most especially for San Francisco. The neighborhood is just a touch on the rough side, but nothing so serious as to prevent us from returning.", "rating": 5, "date": "2015-04-16"}], "mongolian chicken": [{"excerpts": ["Items ordered:\nMongolian Chicken\nChicken chow mein \nChicken fried rice (a little salty, but it was ok for my preference) \nHunan Spareribs\nGarlic chicken\nCombination fried rice and chow mein\n\n"], "author": "Rochelle E.", "review": "Service was fast and food was tasteful. Would come back if was in town. \nItems ordered:\nMongolian Chicken\nChicken chow mein \nChicken fried rice (a little salty, but it was ok for my preference) \nHunan Spareribs\nGarlic chicken\nCombination fried rice and chow mein\n\nThere was a lot of us", "rating": 4, "date": "2017-11-07"}, {"excerpts": ["I had the Combination Chow Mein with a side order of Chicken Fried Rice and my husband had the Mongolian Chicken that he loved."], "author": "DK J.", "review": "We came here for a late lunch and we're met with a clean and inviting atmosphere, kind service, lovely complimentary Jasmine tea and a delicious and hearty meal. I had the Combination Chow Mein with a side order of Chicken Fried Rice and my husband had the Mongolian Chicken that he loved.", "rating": 5, "date": "2016-02-23"}], "mo si chicken": [], "beef with string beans": [{"excerpts": ["But we ordered simple items, such as chow mien and beef with string beans in black bean sauce, never imagining that they would spicy. ", "They were not ridiculously hot, but hotter than my wife or I care for and hotter than my daughter would eat. ", "We wound up throwing most of it away. ", "I looked at the paper menu that I grabbed when I picked up and it did indicate that even the chow mien was spicy. ", "I wish the website indicated that these items were spicy because I would have told them to make it mild."], "author": "Rob H.", "review": "The menu on the website should be updated to indicate if the item is spicy.\n\nWe were driving and ordered off the website. I realize it is Hunan food and is often spicy. But we ordered simple items, such as chow mien and beef with string beans in black bean sauce, never imagining that they would spicy. They were not ridiculously hot, but hotter than my wife or I care for and hotter than my daughter would eat. We wound up throwing most of it away. I looked at the paper menu that I grabbed when I picked up and it did indicate that even the chow mien was spicy. I wish the website indicated that these items were spicy because I would have told them to make it mild.", "rating": 3, "date": "2015-03-08"}], "hot and sour beef": [{"excerpts": ["Fantastic dumplings, great hot and sour beef.\n", "The service was prompt and the meals were delivered on time except for the orange chicken whick came late...", "but WOW, it was worth the wait, w/o a doubt the best I've ever had!"], "author": "Brian M.", "review": "Fantastic dumplings, great hot and sour beef.\nThe service was prompt and the meals were delivered on time except for the orange chicken whick came late...but WOW, it was worth the wait, w/o a doubt the best I've ever had!", "rating": 5, "date": "2015-05-09"}], "shredded beef with bell pepper": [], "kung pao beef": [{"excerpts": ["We got the eggplant, kung pao beef, Henry's special, and some cold noodles. "], "author": "Alex Z.", "review": "This place is pretty decent. It has a nice decor, service is fast, most of the food is pretty good. We got the eggplant, kung pao beef, Henry's special, and some cold noodles. Pretty much everything was good except the eggplant, so don't get that I suppose.\n\nIn short it was a good place to get a meal and I would come again.", "rating": 4, "date": "2016-01-08"}, {"excerpts": ["This seriously might be the best Kung Pao beef I've ever had - the half order of Mo Si soup ", "I got was delicious as well! ", "Combined with a Tsing Tao and a great meal was had! ", "Will definitely come again when I'm town next!"], "author": "Kyle L.", "review": "This seriously might be the best Kung Pao beef I've ever had - the half order of Mo Si soup I got was delicious as well! Combined with a Tsing Tao and a great meal was had! Will definitely come again when I'm town next!", "rating": 5, "date": "2014-06-23"}, {"excerpts": ["The Kung Pao beef was average, but overall we had tons of food, great service, and would send my friends there in a heartbeat."], "author": "Andy L.", "review": "We came in here because of the high YELP rating, and we weren't disappointed.  We tried the dishes everyone talked about and had a nice lunch.  The meat pies (so not traditional Chinese) were light and fluffy and tasty, the Hot and Sour soup was both, and probably the best of that I have ever had.  The Kung Pao beef was average, but overall we had tons of food, great service, and would send my friends there in a heartbeat.", "rating": 5, "date": "2014-10-06"}], "beef with bean curd": [], "sliced beef with green onions": [], "noodles with pork meat and sauce and vegetables": [], "noodles with chicken lettuce and cucumber": [], "spicy curry chow mein": [{"excerpts": ["Their spicy curry chow mein.  ", "I do it w pork.  ", "No joke about the spicy.  "], "author": "Veronica M.", "review": "Every once in a while I feel adventurous & decide to order from a different Chinese restaurant.  \n\nAnd every time after I've done this, I always go back to Henry's.\n\nHere are all the reasons why...\n\nTheir spicy curry chow mein.  I do it w pork.  No joke about the spicy.  It's fantastic.\n\nTheir fried rice is the most un-fried rice I've ever had.  Light & fluffy.  Zero grease.  Though, depending on your preference, that could be a good or a bad thing.  I wish they did a barbecue pork fried rice instead of their version, which is w diced thin ham, but it's not a big deal.\n\nDiana's meat pie.  This is a dish that was introduced to me here.  I'd like to personally thank Diana.  I have no idea who she is, but I just love her meat pie.  The beef filling is rich, tender, & uber flavorful.  The crust is tender & flaky; the perfect encasement.  When this puppy is piping hot, it hits the peak levels of deliciousness.  Something to be devoured, not merely eaten.\n\nHonorable mention goes to the sweet & sour chicken, & the chicken salad.\n\nProps for the food always being fresh, & delivery always being on time.\n\nThere are 7 Henry's in the city.  Each one is run by a family member.  Nice.\n\n4 stars.", "rating": 4, "date": "2016-01-05"}], "smoked ham chow mein with vegetables": [], "prawn chow mein with vegetables": [], "fried rice with eggs": [], "smoked ham fried rice with eggs": [], "prawn fried rice with eggs": [], "combination fried rice with eggs": [], "rice with spicy hunan smoked ham and vegetables lunch": [], "rice with slice beef and vegetables lunch": [], "rice with slice beef vegetables and bean curd lunch": [], "rice with diced chicken minced garlic and vegetables lunch": [], "rice with spicy bean curd and meat sauce lunch": [], "rice with diced chicken and green beans lunch": [], "riced with meat and broccoli lunch": [], "rice with sauteed green beans lunch": []}