{"shredded pork  celery": [], "bean curd with meat sauce": [{"excerpts": ["Love the bean curd with meat sauce, but I don't care for the \"special meat pie\" but "], "author": "Bob D.", "review": "I just love this place. Food quality is great, and servers are friendly and fast. One of the cool things is sitting at the counter watching the chiefs cook. Try the specials!\n\nLove the bean curd with meat sauce, but I don't care for the \"special meat pie\" but that's just me.\n\nOnly open til 5PM, so it's for lunch, not dinner, and some people (not me) report spotty service.", "rating": 4, "date": "2009-12-02"}], "deepfried shredded pork with vegetable": [], "shredded beef with bell peppers": [], "beef with bean curd": [], "chicken with string beans": [{"excerpts": ["Food wise, Velvet chicken was very good and with tender pieces, Mongolian beef was with good flavour, Kung Pao chicken with string beans and veggies was also hot and spicy. ", "The rice was so so ", "(the only mild complaint) as it's drier "], "author": "T L.", "review": "More of 3.5 stars.\n\nThis has the same consistent quality as the one in SOMA. Good and solid somewhat medium spicy food (comparing with Spices but I am not sure if it really is Hunan), perfect on a coldee day in SF. \n\nIt has two floors and upstairs seems to be a bit less hectic.\n\nFood wise, Velvet chicken was very good and with tender pieces, Mongolian beef was with good flavour, Kung Pao chicken with string beans and veggies was also hot and spicy. The rice was so so (the only mild complaint) as it's drier but then with the good sauce I did end up having 2 full plates of food! \n\nService was good and fast except the last dish took a bit longer to come. Be sure to go there before 12:15pm or you will be waiting in line. \n\nAnd definitely a Peet's double shot Cap moment right afterwards to fight the starch coma!\n\nAnd it's only $40 for 4 including tip!! Can't beat that!!", "rating": 4, "date": "2008-12-17"}, {"excerpts": ["Among our favorites are also Chicken with String Beans and Velvet Chicken.  \n\n"], "author": "Lily T.", "review": "Whenever I dine out here with my coworkers, I have to order either Diana's Meat Pie or the Noodle with Meat Sauce dish--two examples of their \"non-spicy\" dishes.  Among our favorites are also Chicken with String Beans and Velvet Chicken.  \n\nHenry's service may be perceived as bad, but I like their no-nonsense policy, especially when I just want to get in, grub, and get out.  Sometimes, I really Heart Zero-Frills.", "rating": 5, "date": "2008-03-02"}, {"excerpts": ["The dish many say is the best, chicken with string beans comes in a black bean sauce and while flavorful and with just the right amount of spice, it also is overly salty.  ", "Could be personal taste, but to me, I need to drink a gallon of water to adjust for the saltiness (not the spicyness).  ", "They are quick and cheap though, so one plus in an area where lunch is very expensive!"], "author": "Ab B.", "review": "I do takeout, and Henry's while decent is not anything special.  The dish many say is the best, chicken with string beans comes in a black bean sauce and while flavorful and with just the right amount of spice, it also is overly salty.  Could be personal taste, but to me, I need to drink a gallon of water to adjust for the saltiness (not the spicyness).  They are quick and cheap though, so one plus in an area where lunch is very expensive!", "rating": 3, "date": "2008-12-18"}, {"excerpts": ["Definitely try the dumplings, chicken with string beans (or any meat with string beans), kung pao chicken, beef and broccoli, hot and sour beef, marty's special, henry's special, and the Diana meat pie.  ", "It's definitely not the healthiest meal you can eat, but its definitely one of the tastiest"], "author": "Maria B.", "review": "For people that work in the Financial District like myself love this place!  Every person I've met that works downtown knows this place and always says to try this dish or that dish.  Well people in my office order from them at least twice a week, and sometimes 3 times on a good week.  Definitely try the dumplings, chicken with string beans (or any meat with string beans), kung pao chicken, beef and broccoli, hot and sour beef, marty's special, henry's special, and the Diana meat pie.  It's definitely not the healthiest meal you can eat, but its definitely one of the tastiest", "rating": 5, "date": "2006-05-29"}], "liling chicken wings": [], "braised fish balls with vegetables": [], "spicy  hot rock cod filet": [], "hunan shrimp": [{"excerpts": ["Hunan Shrimp - A shrimp and veggies dish. "], "author": "Mark D.", "review": "We went for lunch. Ordered food to share.\n\nHot and Sour Soup was good. Not as spicy as I expected.\n\nMarty's Special - A combination dish with ham and chicken. We ordered spicy. It was very good. The mix of the ham and chicken worked very well.\n\nHunan Shrimp - A shrimp and veggies dish. It was also very good.\n\nAll of the dishes were above average. I will definitely be returning. \n\nVery basic ambiance.  Service was quick.", "rating": 3, "date": "2011-01-24"}, {"excerpts": ["I had the Hunan Shrimp and it was excellent. ", "The problem I have with Henry's Hunan is that it appeared dirty to me.  ", "They smash you in like sardines because it's the city and they have to make good use of the space. ", "I get that! ", "But I don't get a place that looks dirty.  ", "They are also cheap with their ice! ", "It's unbelievable. ", "How much is ice??? ", "They act like it's a precious commodity."], "author": "Sandra P.", "review": "The food was very good.  I had the Hunan Shrimp and it was excellent. The problem I have with Henry's Hunan is that it appeared dirty to me.  They smash you in like sardines because it's the city and they have to make good use of the space. I get that! But I don't get a place that looks dirty.  They are also cheap with their ice! It's unbelievable. How much is ice??? They act like it's a precious commodity.", "rating": 3, "date": "2010-09-26"}, {"excerpts": ["I'm also a fan of their Hunan Shrimp.  ", "It's not amazing, but it's very good.  ", "The sauce, whatever it is, complete it.  ", "Bamboo shoots are cooked enough to avoid the stringiness.  ", "The onions are rich in texture and work very well with the spicy sauce.  "], "author": "Dave H.", "review": "A great lunch spot with some addicting dishes that have me returning fairly often.\n\nCome early, especially if there are more than 2 of you.  There's typically a line out the door by 12:05 during the week.  Don't let the line intimidate you - you never have to wait more than 10 minutes or so, usually closer to 5.  Sit upstairs if you can, it's a little more relaxed.\n\nAfter spending the last few years trying other dishes there, I keep going back to the same impressive ones.   \n\nAs an appetizer, the \"Meat Pie\" is awesome.  It's a fried onion cake with what I believe is ground beef and pork  in a spicy sauce, topped with shredded lettuce, topped again with another fried onion cake.  While very different in taste, it could best be described as like a tostada.  If having as an appetizer, order one for every four people.  It can be a bit heavy as a starter if you wind up having two wedges of that (1/2 the \"pie\").\n\nThe single best entree they have originally sounded (to me) as the least appetizing (yes, even less appetizing than meat pie).  The Smoked Ham with String Beans is pretty incredible.   The smoked ham itself is more or less a kind of bacon.  It's smokiness bleeds into the balckbean sauce that lightly covers the entire dish.  These are probably some of the most satisfying green beans I've ever had.\n\nI'm also a fan of their Hunan Shrimp.  It's not amazing, but it's very good.  The sauce, whatever it is, complete it.  Bamboo shoots are cooked enough to avoid the stringiness.  The onions are rich in texture and work very well with the spicy sauce.  The carrots and bell, frankly, are forgettable.\n\nThey don't get the full five stars because they could improve upon their consistency.   For example, some days the green bean/ham dish isn't amazing, but just good.  Also, service is more miss than hit.  Finally, it's a damn madhouse in their.  They should really let you pay your bill through your server, but you have to go to the tiny counter with all the other people waiting to pay and waiting to be seated.", "rating": 4, "date": "2010-02-10"}], "spicy shrimp with bean curd": [], "hunan scallops": [], "beef with broccoli": [{"excerpts": ["For the four of us, we ordered Shrimp Chow Mein ($8.50), Chicken with Black Bean Sauce ($8.75), Beef with Broccoli ($8.75), Dry Sauteed String Beans ($8.25), and one of their specials of the day - Fish Fillet.  "], "author": "Teri C.", "review": "On one of my last few lunch dates with my colleagues, I suggested Henry's Hunan.  I was introduced to this chain by my previous employer who absolutely loved Henry's and ordered from there on a weekly basis.\n\nWe head over to the Sacramento location and find a few empty tables upstairs during their busy lunch rush.  This location isn't quite as nice as some of their other ones, but it'll do.\n\nFor the four of us, we ordered Shrimp Chow Mein ($8.50), Chicken with Black Bean Sauce ($8.75), Beef with Broccoli ($8.75), Dry Sauteed String Beans ($8.25), and one of their specials of the day - Fish Fillet.  And of course, a pot of steamed white rice.\n\nService is typical of the Chinese restaurant.  Just plain fast and efficient.  No frills here.  We were all surprised with how quickly our orders came out and we were woofing it down quick.  Everyone was pleased with all the food we got and we had minimal leftovers, only because we had ordered so much.  My favorite has been the Chicken with Black Bean Sauce and the Dry Sauteed String Beans.  They do them right here.  I've also had their Dumplings ($4.50) too.  \n\nYes, it's pretty pricey, too pricey for what I would normally pay for Chinese food, that's for sure.  But when it comes down to it, it's the kind of food that the masses enjoy from all ethnic backgrounds and usually has a little kick in it as well.  \n\nSolid 3.5 stars.", "rating": 3, "date": "2007-06-07"}, {"excerpts": ["Their Beef with broccoli, Beef stew and many other dishes are absolutely delicious. ", "Me and Co-Worker use to walk from the ballpark at least once a week to eat there. ", "Now I work much closer and introduced new co-workers to this place. ", "Fantastic, not 1 dish I don't like. ", "Not your typical American Chinese restaurant,  my friend from China loved this place and use to order stuff that wasn't even on the menu. ", "A+++++"], "author": "Gregory F.", "review": "Best Chinese food in the Financial District. They hand make their Dumplings which tastes fantastic. Their Beef with broccoli, Beef stew and many other dishes are absolutely delicious. Me and Co-Worker use to walk from the ballpark at least once a week to eat there. Now I work much closer and introduced new co-workers to this place. Fantastic, not 1 dish I don't like. Not your typical American Chinese restaurant,  my friend from China loved this place and use to order stuff that wasn't even on the menu. A+++++", "rating": 5, "date": "2008-04-10"}], "sliced beef with green onions": [], "sweet  sour pork or chicken hunan style": [], "hot  sour vegetables": [], "fresh soybean": [], "hunan house bean curd": [], "eight delight vegetables": [{"excerpts": ["The Eight Delight Vegetables ($7.50) was just literally just vegetables, oil, and spices, which is the authentic style, but it lacks flavor. \n\n"], "author": "Adam Z.", "review": "Really high-quality, authentic Chinese food with the exception that it is not as spicy as Hunanese food. So if, like me, you want it extra hot you need to order it extra hot.\n\nThe Harvest Pork ($8.00) was excellent and really tasty. The Eight Delight Vegetables ($7.50) was just literally just vegetables, oil, and spices, which is the authentic style, but it lacks flavor. \n\nDiana's Meat Pie Special ($6.95) is practically a must order appetizer. \n\nThe Polish Sausage ($8.75) dish is a personal favorite, and the pork dishes are really what they specialize in.\n\nThey have an open kitchen in the back where you can sit at a counter and watch them cook your food.", "rating": 4, "date": "2008-07-03"}, {"excerpts": ["I have tried the following vegetarian items and they all were very tasty:\nEight delight vegetables\nCountry Style vegetables\nHot and sour vegetables\n", "They make the dishes very spicy, and also quite oily, but the taste is good enough to make you think  ", "\"calories be damned, I just want to enjoy my food\". \n", "The waiters are polite and courteous and considering how crowded this place gets, I must say they do a pretty decent job of serving the customers."], "author": "kumar k.", "review": "This restaurant is a favorite among my co-workers.\nOn most Mondays we end up going there as the place is less crowded than on other week days. I have tried the following vegetarian items and they all were very tasty:\nEight delight vegetables\nCountry Style vegetables\nHot and sour vegetables\nThey make the dishes very spicy, and also quite oily, but the taste is good enough to make you think  \"calories be damned, I just want to enjoy my food\". \nThe waiters are polite and courteous and considering how crowded this place gets, I must say they do a pretty decent job of serving the customers.", "rating": 4, "date": "2007-03-17"}], "five spiced bean curd": [], "noodles wpork meat sauce and vegetables": [], "noodles wpork meat  hunan special sauce": [], "noodles wchicken and vegetable cold": [], "combo vegetable w hunan hotsour sauce": [], "sliced hunan smoked ham  vegetables": [], "sliced beef bean curd  vegetables": []}