{"ka ree puff": [{"excerpts": ["The basil chicken, ka ree puff, and wings were pretty good. ", "It seems like they are more authentic and people are expecting more American Thai. ", "I was surprised that the chicken was ground. ", "Yet, it still had a nice authentic flavor without trying to overpower with spice."], "author": "A R.", "review": "Initially, the service was a bit off-putting. However after a seating issue was addressed, the service was genuinely pleasant and prompt. The basil chicken, ka ree puff, and wings were pretty good. It seems like they are more authentic and people are expecting more American Thai. I was surprised that the chicken was ground. Yet, it still had a nice authentic flavor without trying to overpower with spice.", "rating": 4, "date": "2016-08-29"}], "fried egg roll": [], "fresh spring roll": [], "fresh spring roll with shrimp": [], "fried pumpkin": [{"excerpts": ["I've ordered many things from them, but here's a simple example: The fried pumpkin. ", "Sometimes it's more fried, sometimes it's fried but the pumpkin is undercooked, sometimes they give you a lot, but a couple times I was pissed because they only gave me like 4 pieces for the same price. "], "author": "Melle R.", "review": "Ordering from Hippie Thai is always inconsistent, what you get is always a bit different from last time, which is kind frustrating. They don't seem to follow specific recipes. I've ordered many things from them, but here's a simple example: The fried pumpkin. Sometimes it's more fried, sometimes it's fried but the pumpkin is undercooked, sometimes they give you a lot, but a couple times I was pissed because they only gave me like 4 pieces for the same price. When you order from here you can never be 100% certain as to what you will receive, especially portion wise.\n\nMost of the time the food is good, but it's a gamble.", "rating": 3, "date": "2018-11-03"}], "pork skewers": [{"excerpts": ["Last time I got Pad-thai and the moo ping pork skewers with sticky rice. ", "Love the sauce that comes with the pork sticks. ", "Yum!"], "author": "William B.", "review": "I love the new makeover! The old place had an inch of grease all over everything.\n\nBeen here a couple times so far. This time I had pad see ew chicken and egg rolls. Last time I got Pad-thai and the moo ping pork skewers with sticky rice. Love the sauce that comes with the pork sticks. Yum!", "rating": 5, "date": "2016-01-09"}, {"excerpts": ["The beef in the Pad Kee Mao is first rate, and the pork skewers are awesome. ", "The Pad Thai is improved, as well."], "author": "V. M.", "review": "A vast improvement over Best of Thai, where I've been eating for years. The beef in the Pad Kee Mao is first rate, and the pork skewers are awesome. The Pad Thai is improved, as well.", "rating": 5, "date": "2015-11-16"}], "chicken skewers": [{"excerpts": ["Came in here and ordered chicken skewers - the waiter actively discouraged me from getting those and insisted I get the satay chicken instead. ", "When it came out (in under 2 mins) it was extremely dry and cold- clearly someone else had ordered this dish before and cancelled it. ", "It was truly terrible. \n", "He also forgot my jasmine rice. ", "2 stars for having fresh coconut."], "author": "Sam M.", "review": "Pretty disappointed with the Thai food here. Came in here and ordered chicken skewers - the waiter actively discouraged me from getting those and insisted I get the satay chicken instead. When it came out (in under 2 mins) it was extremely dry and cold- clearly someone else had ordered this dish before and cancelled it. It was truly terrible. \nHe also forgot my jasmine rice. 2 stars for having fresh coconut.", "rating": 2, "date": "2017-11-05"}, {"excerpts": ["Curry is so good tho, beef salad, and chicken skewers. \n ", "The herbal choices dish recommendation are : goong ob woonsen , pad cha talay \n", "Drink: thai ice t, singha and thai herbal tea"], "author": "Chu O.", "review": "My dinner always here! If you like thaifood in thai street style,here is your place. Khao soi gai and thai herbal tea are super perfect match in my rainy cold day . Curry is so good tho, beef salad, and chicken skewers. \n The herbal choices dish recommendation are : goong ob woonsen , pad cha talay \nDrink: thai ice t, singha and thai herbal tea", "rating": 5, "date": "2016-03-13"}], "hippie chicken wings": [], "gai satay": [{"excerpts": ["Our order consisted of Pad Thai, Pad Kee Mao, and Gai Satay. ", "Each dish was very tasty, with wonderful flavor balance, not muted at all. ", "We are definitely adding it into our mix of places to get take (and eat out too) for our family. ", "Kudos to the new owners!"], "author": "Skip P.", "review": "Last night we ordered food to go for the first time from the re-branded and under new management restaurant. We live about 1-1/2 blocks away, so having this as a resource for those evenings when we don't have much time to prepare dinner is great. I needed to pick up a few things at Gus's first, and the food was ready to go by the time I finished with my shopping there.\n\nOur order consisted of Pad Thai, Pad Kee Mao, and Gai Satay. Each dish was very tasty, with wonderful flavor balance, not muted at all. We are definitely adding it into our mix of places to get take (and eat out too) for our family. Kudos to the new owners!", "rating": 5, "date": "2015-11-18"}], "sai krok isan": [], "sai ua": [{"excerpts": ["The Khao Soi is also very good, as is the larb and Sai ua. "], "author": "Reed T.", "review": "I've been coming here for two years now. Even after moving away, this is one of the spots I have to hit whenever I come back. I'm half Thai and grew up in Chiang Mai, and this is my favorite Thai place in SF. The quality and authenticity is unbeatable, and for such good prices! Everything I've ever ordered has been good, but their crown jewel is the glass noodles with shrimp in clay pot. I haven't found a place that makes that dish as well as Hippie Thai in the USA yet. The Khao Soi is also very good, as is the larb and Sai ua. Service is amazing and the waiters are so friendly. \n\nI don't understand how this place only has three stars right now! Hawker fare is probably as authentic, but they only serve northern or northeastern dishes and are quite a bit pricier. Imm is also as authentic, but it's all the way in Berkeley and the menu is much more limited than here. Can't think of another place I'd give #1 Thai place in SF award to.", "rating": 5, "date": "2018-01-31"}], "goong thot": [], "pla muk thot": [], "tod man pla": [], "crab roll cake": [], "tom yum soup": [{"excerpts": ["Oh god if I could take back my Tom Yum soup or Duck Curry. ", "Service was shotty. ", "They forgot I wanted duck on the side. ", "And when I said something she goes. ", "Oh sorry and walks away. "], "author": "Ninotchka A.", "review": "Oh god if I could take back my Tom Yum soup or Duck Curry. Service was shotty. They forgot I wanted duck on the side. And when I said something she goes. Oh sorry and walks away. The hell?\n\nAs goes for the food. Nothing about both of them jumped at me in anyway. Bland soup. Watery curry. Fail.", "rating": 1, "date": "2016-05-02"}, {"excerpts": ["I ordered the tom yum soup. ", "It was literally just overcooked chicken, mushrooms, and two giant chunks of underripe tomato. ", "The broth was kind of sweet which wasn't a good choice. ", "It seems like they use poor quality ingredients and don't put much care into preparation either. ", "Not cheap for what you get."], "author": "Sara S.", "review": "Very mediocre. I ordered the tom yum soup. It was literally just overcooked chicken, mushrooms, and two giant chunks of underripe tomato. The broth was kind of sweet which wasn't a good choice. It seems like they use poor quality ingredients and don't put much care into preparation either. Not cheap for what you get.", "rating": 2, "date": "2016-08-21"}, {"excerpts": ["Love the Tom Yum soup."], "author": "Kevin C.", "review": "Solid place for quick Thai food.  Tasty and big portions.  Love the Tom Yum soup.", "rating": 4, "date": "2016-05-07"}], "poh tak talay soup": [], "veggie noodle soup": [], "kuay tiew rua beef soup": [], "kuay tiew tom yum": [{"excerpts": ["I settled on #30 Kuay Tiew Tom Yum. ", "Yowza it was spicy!  ", "Not being experienced in Thai food I didn't realize how hot it would be. ", "The flavor was excellent and everything was very fresh. ", "My waiter came over several times to refill my water (a BIG thank you!). ", "I enjoyed my soup and would order it again just not as spicy. ", "Service was on point, food was served quickly and tasted good. ", "This place is solid."], "author": "Kimberly D.", "review": "Stopped in after a long afternoon of walking around The Haight. I was thinking some soup sounded good since it was a little chilly out (hey I'm from Vegas so anything under 80 degrees is cold to me). Was immediately seated & given water by a young gentleman. The menu featured quite a few main courses and a nice variety of soups. I settled on #30 Kuay Tiew Tom Yum. Yowza it was spicy!  Not being experienced in Thai food I didn't realize how hot it would be. The flavor was excellent and everything was very fresh. My waiter came over several times to refill my water (a BIG thank you!). I enjoyed my soup and would order it again just not as spicy. Service was on point, food was served quickly and tasted good. This place is solid.", "rating": 3, "date": "2016-05-27"}], "kow soi gai": [], "wonton noodle soup": [], "duck noodle soup": [], "som tum goong yang salad": [], "labb chicken salad": [], "labb pork salad": [], "pla goong salad": [], "laab ped salad": [], "labb tofu salad": [], "choo chee salmon curry": [], "red duck curry": [], "rad nah": [{"excerpts": ["I ordered vegetarian Rad Nah with tofu. ", "It is on their menu under \"stir fried rice and noodles\"described as \"Stir fried flat rice noodles, choice of meat, with Chinese broccoli, topped with soybean gravy sauce\"so ", "I expected a pan fried rice noodles like pad see ew. ", "what I got was a box of wide noodles that were stir fried and really oily and ", "a huge container of what seemed to be 1 and a half cups of water with a half cup of oil and some cornstarch with some vegetables and tofu. ", "I was confused by what I got because I didn't order soup. ", "I called them to confirm my order and the  guy on the phone said that it was the right order and that way because it was vegetarian...", "I gave it a try. ", "It tasted beyond bland, the texture of the goopy greasy sauce was unpleasant. ", "I brought leftovers home thinking I could drain most of the sauce and add siracha for dinner,when I opened it again later it had separated into pools of oil and water. ", "So gross!! ", "No amount of hot sauce and draining could save it. ", "My friend liked her food ", "but I don't think I will be recommending this place to my customers."], "author": "Leann W.", "review": "I work on Haight and I ordered lunch today from \"Hippie Thai\"for the first time and it turned out to be frighteningly bad. I ordered vegetarian Rad Nah with tofu. It is on their menu under \"stir fried rice and noodles\"described as \"Stir fried flat rice noodles, choice of meat, with Chinese broccoli, topped with soybean gravy sauce\"so I expected a pan fried rice noodles like pad see ew. what I got was a box of wide noodles that were stir fried and really oily and a huge container of what seemed to be 1 and a half cups of water with a half cup of oil and some cornstarch with some vegetables and tofu. I was confused by what I got because I didn't order soup. I called them to confirm my order and the  guy on the phone said that it was the right order and that way because it was vegetarian...I gave it a try. It tasted beyond bland, the texture of the goopy greasy sauce was unpleasant. I brought leftovers home thinking I could drain most of the sauce and add siracha for dinner,when I opened it again later it had separated into pools of oil and water. So gross!! No amount of hot sauce and draining could save it. My friend liked her food but I don't think I will be recommending this place to my customers.", "rating": 1, "date": "2017-03-27"}], "guay tiew kua": [], "goong ob woon sen": [{"excerpts": ["Goong Ob Woon Sen glass noodles. ", "We haven't found this central Thai dish done well in any other spot in the city ", "and I would definitely recommend it for any pork belly and shrimp lovers.  \n", "Another great dish is their Khao Soi. ", "Anyone who has been to Chiang Mai has probably fallen in love with this golden curry and Hippie Thai does it right! ", "Try it out. ", "The mixture of soft and crunchy egg noodles in turmeric-laced coconut soup is amazing on chilly SF nights. ", "We usually steer clear of old standards like Pad Thai, but if you're craving that, we can also say that their Pad Thai is also surprisingly delicious! "], "author": "Celine B.", "review": "Authentic Thai Food in SF!\n\nMy friends and I have spent the last couple years exploring Thai food all over SF. We're picky. Hippie Thai stands out for having authentic, unpretentious dishes that always hit the spot!\n\nOne of our favorites is the clay pot Goong Ob Woon Sen glass noodles. We haven't found this central Thai dish done well in any other spot in the city and I would definitely recommend it for any pork belly and shrimp lovers.  \nAnother great dish is their Khao Soi. Anyone who has been to Chiang Mai has probably fallen in love with this golden curry and Hippie Thai does it right! Try it out. The mixture of soft and crunchy egg noodles in turmeric-laced coconut soup is amazing on chilly SF nights. We usually steer clear of old standards like Pad Thai, but if you're craving that, we can also say that their Pad Thai is also surprisingly delicious! Really I would eat anything on that menu. \n\nThe service here is fast and all the wait staff are very accommodating, even when we drop by with a big group (because we always want to take our friends there). Thanks, Hippie Thai! We'll be back.", "rating": 5, "date": "2018-01-31"}], "hippie special": [], "pad prink king": [], "pad ma kuer": [], "pad ka pow": [], "praram long song": [], "pad med ma muang": [], "pad kra tiem plik thai": [], "pad preaw wan": [], "brown rice": [], "ginger rice": [], "garlic noodles": [{"excerpts": ["I only had the garlic noodles here as a snack, and they were definitely more sweet than garlic-y, almost to the point where they tasted like dessert! ", "The portion size was good, quite a lot of food for just $5. ", "I could only eat a few bites though and then had to pour in soy sauce in order to add some flavor and reduce the sweetness. ", "Would recommend trying other items on the menu, since the friends I went with seemed to enjoy the curries and such."], "author": "Sonia D.", "review": "I only had the garlic noodles here as a snack, and they were definitely more sweet than garlic-y, almost to the point where they tasted like dessert! The portion size was good, quite a lot of food for just $5. I could only eat a few bites though and then had to pour in soy sauce in order to add some flavor and reduce the sweetness. Would recommend trying other items on the menu, since the friends I went with seemed to enjoy the curries and such.", "rating": 3, "date": "2018-10-23"}], "cucumber salad": [], "steamed noodle": [], "roti with vanilla ice cream": [], "sweet sticky rice with mango": [], "sweet sticky rice with vanilla ice cream": [], "vanilla ice cream": [], "fried banana with vanilla ice cream": [], "roti with condensed sweet milk": [], "perrier sparkling mineral water": [], "fresh young coconut": [], "kow pad": [], "kow pad sub pa rot": [], "kow moo dang and moo krob": [], "kow pad gai tod": [], "kow ka na moo krob": [], "kow na ped": [], "kow ka pow gai kai dao": [], "kow pad boo": []}