{"apple sidra": [], "hey song sarsaparilla": [], "lemon black tea with lemon jelly": [{"excerpts": ["We ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. "], "author": "Jennifer X.", "review": "HoDaLa is a casual dining option for Taiwanese food.\n\nI'm a sucker for details and decor.\n\nJars of old school candy and tea eggs set at the entrance added to the retro feeling of the restaurant.\n\nC-pop music videos from the past 10 years with the likes of JJ Lin and Jay Chou are projected onto the wall behind me. Nostalgia...*~* \n\nService was great; the servers were friendly, attentive, and quick. \n\nWe ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. Both drinks were refreshing, and not too sweet. \n\nFor food, we ordered the pork belly bao, braised beef noodle soup, and fried chicken over rice. The pork belly bao was my favorite! The flavored pork belly and preserved vegetable between steamed buns was a perfect combination.\n\nOverall, the food was good with just the right flavors, but not particularly outstanding in quality. \n\nHoDaLa is currently in its soft opening stage, so there's potential. I would return to try other items on the menu including the minced pork over rice, beef rolls, and corn cheese.", "rating": 4, "date": "2018-04-14"}], "grass jelly milk tea": [{"excerpts": ["We ordered the TW gold medal Beer with lychee, Grass Jelly Milk Tea, and the Taro Ball Shaved ", "Ice(we were able to substitute the boba with Mochi!). ", "The beer came in an interesting glass skull jar and was really refreshing. "], "author": "Michael L.", "review": "Me and my friend came to get dessert on a Saturday night around 9pm and there was no wait. There is an iPad for you to put your name on the waitlist for when it gets busy. The vibe is Taiwanese with Asian music playing in the background and music videos projected onto a wall. \n\nWe ordered the TW gold medal Beer with lychee, Grass Jelly Milk Tea, and the Taro Ball Shaved Ice(we were able to substitute the boba with Mochi!). The beer came in an interesting glass skull jar and was really refreshing. I enjoyed the milk tea and taro ball shaved ice but my friend thought it was a bit too sweet. \n\nIf I didn't just come from dinner, I would have definitely tried their savory treats. Their steamed buns and rice bowls seem really authentic and promising! They also have Happy Hour Specials and non Taiwanese drinks like Sake, Sangria,and Soju!", "rating": 4, "date": "2018-09-23"}, {"excerpts": ["Grass Jelly Milk Tea\nDevour:  Pork Belly Baos, Meat Sticks, Preserved Egg w/ Sweet Potato Leaves, Shrimp Noodles & Pork Rib over Rice\nTotal:  $45.38"], "author": "Genevieve Y.", "review": "Date & Time:  Sunday February 25, 2018 @ 1:30pm\nLunch Date:  The Husband\nScene:  This is Us:  Husband in Barbour Jacket, Dents Driving Gloves, Zara Shirt, Acne Wall Street Pants, Crocket & Jones Fetbury Shoes.  Wife in Acne Studios Moto Jacket, Bella Freud Sweater Dress, White+Warren Scarf & Gloves, Stuart Weitzman Over-the-Knee Suede Boots & Mini Chanel Cross-Shoulder Flap Bag\nMusic:  Taiwan Girl Pop\nDecor:  Fun & Whimsical.  Candy Stand, Videos on Projector Screen & Theatre Chairs \nService:  Adorable, Sweet, Attentive Guy Similar to Leading Man in K-Drama\nImbibe:  Grass Jelly Milk Tea\nDevour:  Pork Belly Baos, Meat Sticks, Preserved Egg w/ Sweet Potato Leaves, Shrimp Noodles & Pork Rib over Rice\nTotal:  $45.38", "rating": 3, "date": "2018-02-25"}, {"excerpts": ["We ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. "], "author": "Jennifer X.", "review": "HoDaLa is a casual dining option for Taiwanese food.\n\nI'm a sucker for details and decor.\n\nJars of old school candy and tea eggs set at the entrance added to the retro feeling of the restaurant.\n\nC-pop music videos from the past 10 years with the likes of JJ Lin and Jay Chou are projected onto the wall behind me. Nostalgia...*~* \n\nService was great; the servers were friendly, attentive, and quick. \n\nWe ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. Both drinks were refreshing, and not too sweet. \n\nFor food, we ordered the pork belly bao, braised beef noodle soup, and fried chicken over rice. The pork belly bao was my favorite! The flavored pork belly and preserved vegetable between steamed buns was a perfect combination.\n\nOverall, the food was good with just the right flavors, but not particularly outstanding in quality. \n\nHoDaLa is currently in its soft opening stage, so there's potential. I would return to try other items on the menu including the minced pork over rice, beef rolls, and corn cheese.", "rating": 4, "date": "2018-04-14"}], "black tea": [{"excerpts": ["We ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. "], "author": "Jennifer X.", "review": "HoDaLa is a casual dining option for Taiwanese food.\n\nI'm a sucker for details and decor.\n\nJars of old school candy and tea eggs set at the entrance added to the retro feeling of the restaurant.\n\nC-pop music videos from the past 10 years with the likes of JJ Lin and Jay Chou are projected onto the wall behind me. Nostalgia...*~* \n\nService was great; the servers were friendly, attentive, and quick. \n\nWe ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. Both drinks were refreshing, and not too sweet. \n\nFor food, we ordered the pork belly bao, braised beef noodle soup, and fried chicken over rice. The pork belly bao was my favorite! The flavored pork belly and preserved vegetable between steamed buns was a perfect combination.\n\nOverall, the food was good with just the right flavors, but not particularly outstanding in quality. \n\nHoDaLa is currently in its soft opening stage, so there's potential. I would return to try other items on the menu including the minced pork over rice, beef rolls, and corn cheese.", "rating": 4, "date": "2018-04-14"}, {"excerpts": ["We ordered milk tea and the black tea with lemon, they were both pretty good!"], "author": "michele h.", "review": "Pretty good overall!\n\nOrdered:\n\nBraised beef noodle soup - 4.5 Stars, great taste and flavors, a must try here!\n\nFried chicken w/ rice - 4 Stars super yummy, taste like popcorn chicken\n\nScallion pancake - 3.5 Stars nothing special but it does come with a unique sauce\n\nMixed bao - pork belly bao 4.5 Stars sooo good! \nFried fish bao 2.5 Stars taste like frozen fish\nFried chicken bao 2.5 Stars taste like frozen chicken nuggets, if they changed it to the chicken they used in the rice, it'll be so much better\n\nWe ordered milk tea and the black tea with lemon, they were both pretty good!", "rating": 4, "date": "2018-05-06"}], "wintermelon milk tea": [], "passion fruit black tea": [], "lychee green tea": [{"excerpts": ["He said that's fine, he'll have the lychee green tea then. ", "He was confused when the drink didn't come out with grass jelly, but the server accused him of not asking for it. ", "I can see how it wasn't communicated that clearly, but I was pretty amused that he was essentially blaming the customer. ", "This would never happen in Taiwan amirite?"], "author": "Karen S.", "review": "Every time I meet another Taiwanese person, I feel an immediate kinship from our shared heritage. Inevitably, our conversations always veer toward food, because Taiwanese food is the BEST. I'll most likely ask questions like, when's the last time you visited Taiwan? What's your favorite Taiwanese dish? Where can I get good Taiwanese food in SF? The last question always stumps people, because we just don't have many options, and I can't just Uber to Cupertino on a whim. I can, however, Uber to HoDaLa (what does this name mean tho?) for an authentic taste of Taiwan. \n\nMy friends entrusted me to order for the table, so I picked the gua bao (pork belly bun), niu rou zian bing (beef roll pancake), niu rou mian (braised beef noodle soup), and lu rou fan (ground pork over rice). \n\nThe gua bao came in 3 pieces per order, and the first bite took me back to all my vacations in Taiwan. The crushed peanuts provided a nice crunch to the tender pork belly. \n\nEveryone agreed that the niu rou jian bing was by far the standout. DO NOT SLEEP ON THIS DISH. Despite being close friends, we were all being modest and/or selfless for some reason and nobody touched the last piece for a long time until I commanded W to just eat it. \n\nThe niu rou mian was pretty spicy, which the menu does warn you about. The broth was super flavorful but it was hard for me to drink much of it without chugging water. I'd still eat it again and again. \n\nLu rou fan was what I was most excited for, but I was somewhat disappointed. W and C were nice enough to let me eat most of the egg, but the rest of it was missing something. It's such a classic and might even seem like a poor man's dish, since it's pretty much scraps of pork mixed with rice, pickled veggies and sauce, but I guess it's actually hard to do right. It's the only item I wouldn't order again.\n\nIt would probably be a 5 star place if not for a weird service encounter when C was ordering a drink. He asked if they had boba? Nope, only grass jelly. He said that's fine, he'll have the lychee green tea then. He was confused when the drink didn't come out with grass jelly, but the server accused him of not asking for it. I can see how it wasn't communicated that clearly, but I was pretty amused that he was essentially blaming the customer. This would never happen in Taiwan amirite?", "rating": 4, "date": "2018-04-01"}], "grape fruit green tea": [], "grape fruit black tea": [], "peach black tea": [], "wintermelon tea": [], "red guava juice": [], "wintermelon with lemon": [], "date coke": [], "watermelon milk tea": [], "grass jelly with wintermelon tea": [], "peach milk tea": [], "mango milk tea": [], "boba milk tea": [], "milk foam green tea": [], "milk foam black tea": [], "potted plant green tea": [], "potted plant black tea": [], "potted plant milk tea": [], "tomato beef noodle soup": [{"excerpts": ["I ordered the tomato beef noodle soup and was slightly disappointed that the soup didn't taste like tomato. ", "I would like to see Xiao Long Bao's on the new menu!"], "author": "Mauricia L.", "review": "Came here on a Saturday for lunch and was pleasantly surprised! My favorite thing was the ground pork over rice which was great comfort food. I ordered the tomato beef noodle soup and was slightly disappointed that the soup didn't taste like tomato. I would like to see Xiao Long Bao's on the new menu!", "rating": 4, "date": "2018-10-20"}, {"excerpts": ["And tomato beef noodle soup was slightly spicy. "], "author": "Annie L.", "review": "Fantastic Taiwanese food, and best servers. I also really liked the decor - the owners definitely put a lot of thought in trying to recreate a standard Taiwanese storefront. \n\nAND they serve yam leaves. Which are my fav type of vegetable. Would prefer it without the preserved egg, but it was yummy regardless. Also maybe because we went during grand opening so the braised pork rice cake with a smaller than usual portion of pork. However, the flavor was out of this world and made me reminiscent of Taiwanese food stands. And tomato beef noodle soup was slightly spicy. Just like Taiwan!! \n\nPlus our server was the best. Parking in the Richmond is difficult on a Saturday and he was very conscientious that we were parked illegally (oops, what I do for food, heh) so he asked the kitchen to serve our food faster than normal. \n\nIf only this place was closer to SJ.....", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["My friend got the spicy fried chicken wings and pork bun (both apps), I got the tomato beef noodle soup, and we also split the beef roll. ", "I also got their milk tea with grass jelly that was good, but a bit too milky (not enough tea) and the grass jelly didn't taste super fresh (it was a bit harder than I was used to). ", "The pork buns were amazing, super fatty and tender (!! ", "a must try) and the chicken wings were good but nothing special (according to her). ", "The beef roll had a generous amount of beef which I loved, but I wish there was more cilantro or vegetables inside to balance it out texture wise. ", "The tomato beef noodle soup was yummy but a tad bit too salty/oily for me, and I can handle decently salty food... \n\n", "If they can make their signature dish, the tomato beef noodle soup a tad bit less greasy/salty I would give them a 4 hands down. \n\n"], "author": "Joy K.", "review": "I loved how you can get on the waitlist for HoDaLa through yelp so there's less time spent waiting in line in the freezing cold :)\n\nMy friend and I came here on a Sunday night around 6 pm. The wait wasn't too bad, only 20 minutes, but we got on the waitlist on yelp so really there was virtually no wait time. Our servers were accommodating and my water cup was never empty! \n\nMy friend got the spicy fried chicken wings and pork bun (both apps), I got the tomato beef noodle soup, and we also split the beef roll. I also got their milk tea with grass jelly that was good, but a bit too milky (not enough tea) and the grass jelly didn't taste super fresh (it was a bit harder than I was used to). The pork buns were amazing, super fatty and tender (!! a must try) and the chicken wings were good but nothing special (according to her). The beef roll had a generous amount of beef which I loved, but I wish there was more cilantro or vegetables inside to balance it out texture wise. The tomato beef noodle soup was yummy but a tad bit too salty/oily for me, and I can handle decently salty food... \n\nOverall I think the food was more of a 3 but because of the great service, super reasonable prices (aka dirt cheap), HUGE PORTIONS (not for apps but wows my soup was huge), and virtually no wait time, I gave the restaurant a 4. If they can make their signature dish, the tomato beef noodle soup a tad bit less greasy/salty I would give them a 4 hands down. \n\nI wouldn't go out of my way to come again but I wouldn't be opposed to going if a friend wanted to check it out!", "rating": 4, "date": "2018-05-05"}, {"excerpts": ["My favorite of the meal was the TOMATO BEEF NOODLE SOUP, I was obsessed. ", "It reminded me of my childhood, and I had always been on a search for tomato based bns. ", "This place has done a perfect job, and it had a really nice kick to the broth as well. "], "author": "Jamie Y.", "review": "I absolutely loved this restaurant. It was very hyped up for me and it definitely lived up to the hype, and this is coming from a Taiwanese girl who's from 626. The restaurant decor is very throwback with a ton of good ol Taiwanese candy, snacks and posters. \n\nI went so ham and ordered 6 things for 3 people. \nStir Fried Preserved Egg with Sweet Potato Leaves - Sweet potato leaves is such a Taiwanese staple vegetable, the preserved egg went really well with it, I'm definitely going to steal this recipe. \nPork Belly Gua Bao - The flavor is on point and the bao was fluffy, delicious and with a sweet aftertaste. The sauce went really well with the peanut crumbs. The pork belly was cooked really well, it was juicy and meaty. \nGrounded Pork over Rice - Another traditional dish that was done very well. The ground pork was juicy and flavorful, it had a mixture of ground mushrooms in it as well so the texture was great. It had enough sauce to make the rice really tasty. It also came with some sour cabbage (my favorite), marinated egg and also pickled radish for garnish and taste. \nFried Pork Chop over Rice - I love how thin the breading of the pork chop was, and how juicy the meat was. The sauce was on point but it made the fried pork chop a bit soggy in the end. Overall was still a great entree especially with the bamboo shoots on the side. \nSizzling Beef with Black Pepper and Mushroom Sauce - The flavor of this dish was on point! Just like the ones you'd get in a night market. The steak was too tough imo and the noodle was overcooked. I'd skip this dish next time.\n\nMy favorite of the meal was the TOMATO BEEF NOODLE SOUP, I was obsessed. It reminded me of my childhood, and I had always been on a search for tomato based bns. This place has done a perfect job, and it had a really nice kick to the broth as well. The beef was also a perfect balance of tendon and meat. \n\nI'd have to come back here again if I'm ever visiting sf!! The service was also friendly and attentive.", "rating": 5, "date": "2018-05-21"}, {"excerpts": ["Pluses:\n-The tomato beef noodle soup had the most authentic broth of any Taiwanese beef noodle in SF. ", "It's casual karaoke/bubble tea 簡餐 quality, not Michelin noodle master quality, but still, it's the only truly authentic broth in town. "], "author": "Ken H.", "review": "5 stars not because it's perfect (it is not) but because it's already the most authentic Taiwanese small-eats shop in SF. For that alone, I want them to stay in business.\n\nPluses:\n-The tomato beef noodle soup had the most authentic broth of any Taiwanese beef noodle in SF. It's casual karaoke/bubble tea 簡餐 quality, not Michelin noodle master quality, but still, it's the only truly authentic broth in town. The noodles though are store-brand and kinda blah.\n\n-The fried chicken dishes were all very succulent and juicy and good! I'd recommend the fried chicken on rice.\n\n-The decor is kinda cute!\n\nMinuses:\n-Hire +1 waiter please, even if it means raising each entree's price by a dollar. You're overworking the 1 waiter you have.\n\n-I like Wu Yue Tian/Mayday alright, but my god the music is too dang loud. You'll drive away all the adult customers like this, leaving only study abroad college students...", "rating": 5, "date": "2018-03-25"}, {"excerpts": ["Tomato Beef Noodle Soup: ", "It seems generally uncommon to find this dish in the Bay ", "so I was excited when I saw that they have this one! ", "The broth tasted nice and flavorful with a subtle kick of spiciness. ", "Meat was nice and tender with no fat. ", "The only thing we didn't like were the noodles, they didn't seem cooked all the way. "], "author": "Scott C.", "review": "HoDaLa means \"bottoms up\" in Taiwanese (that's what they said!). How often in the Bay do you come across a Taiwanese restaurant that's not named in Chinese?!\n\nI'm always on the hunt for good Taiwanese food, and the food here was great - better than I expected, but not amazing either.\n\nService was not as great, but the staff was super nice and humble. We came around 7:30pm on a Sunday and waited 30 min for a seat.\n\nWe ordered...:\n\nTomato Beef Noodle Soup: It seems generally uncommon to find this dish in the Bay so I was excited when I saw that they have this one! The broth tasted nice and flavorful with a subtle kick of spiciness. Meat was nice and tender with no fat. The only thing we didn't like were the noodles, they didn't seem cooked all the way. They also seemed to skimp a little on the veggies.\n\nPork Belly Gua Bao: The bao came out cold and the pork belly had a lot of fat on it. Otherwise the flavor was decent, especially the sweet peanut shavings. Looking around, a lot of parties ordered this.\n\nBlack Pepper Steak Noodle: One of the better versions I've had of this in the Bay. The pepper, garlic pieces, and noodles made for a good combination. However the meat was slightly tough and flavor-wise tasted slightly off, but we couldn't tell why.\n\nPrice-wise, the dishes seemed expensive than other Taiwanese places, however this *IS* SF so the prices were relatively reasonable.\n\nParking was a little challenging, but we parked 2 blocks away.", "rating": 4, "date": "2018-03-19"}, {"excerpts": ["I loved the spicy tomato beef noodle soup, pork belly bao and crispy beef roll in particular, but everything else was delicious as well. ", "Service was attentive and fast and the bill was about $100 for 4 adults and 3 kids...", "Not bad at all! ", "Glad we found another neighborhood gem and I hope this place sticks around!"], "author": "Cee J.", "review": "Pleasantly surprised with this place! I've never had Taiwanese food so I can't vouch for its authenticity but the food tasted great - bottom line. I loved the spicy tomato beef noodle soup, pork belly bao and crispy beef roll in particular, but everything else was delicious as well. Service was attentive and fast and the bill was about $100 for 4 adults and 3 kids...Not bad at all! Glad we found another neighborhood gem and I hope this place sticks around!", "rating": 5, "date": "2018-08-25"}, {"excerpts": ["Delicious tomato beef noodle soup! ", "Good atmosphere inside. ", "I would like to see some Taiwanese style coffee drinks on the new menu."], "author": "Wui I.", "review": "Delicious tomato beef noodle soup! Good atmosphere inside. I would like to see some Taiwanese style coffee drinks on the new menu.", "rating": 4, "date": "2018-07-08"}, {"excerpts": ["We ordered a bunch of dishes to share between 5 people that included Beef noodle soup, Tomato Beef noodle soup, chicken wings, pork belly buns, veggies, etc. "], "author": "Kevin W.", "review": "This is probably the first fully Taiwanese restaurant i've been to or seen around SF. Most of these places reside in south bay. Knowing that, I was extremely excited to try this place. It is a small restaurant in the inner Richmond area which is hard to find street parking. Walking into the restaurant, you can instantly see the whole place (it's not very big). But it is decorated with the different Taiwanese snacks that you can buy (chips, candy, etc. - most are about $2 each). We ordered a bunch of dishes to share between 5 people that included Beef noodle soup, Tomato Beef noodle soup, chicken wings, pork belly buns, veggies, etc. The dishes are not super big, but was big enough to share to 1 portion a person. \n\nOverall the food quality was decent but it is a little on the pricier side of things. I'd come back if i'm in the area and definitely would tell friends to try.", "rating": 4, "date": "2018-05-14"}, {"excerpts": ["The one dish that I was looking forward to was the tomato beef noodle soup..however that was the one dish that did disappoint. ", "Maybe I have high expectations since my mama has a pretty bomb recipe..but the broth just wasn't super flavorful and the beef was mediocre. ", "However, the other dishes that we did order--pork belly gua bao, ground pork rice (滷肉飯), pork chop over rice (排骨飯), beef wraps (牛肉捲餅), and sweet potato leaves with thousand year old egg (地瓜葉炒皮蛋) were all incredibly tasty ", "and I highly recommend ordering them. ", "Service was also decent--very efficient for only having 2 waitresses. ", "The restaurant was also decorated with Taiwanese 90s toys and candies. ", "Overall, the experience brought back a sense of home for a Taiwanese millennial and had authentic music and delicious food to top it off. ", "Highly recommend for anyone who enjoys Taiwanese music and food! ", "Will be back if I'm ever in the bay area."], "author": "Jenni W.", "review": "After Yelping a couple of restaurants, I stumbled upon this Taiwanese place--it was conveniently located and close to the Golden Gate Bridge, where my friends and I wanted to go to after lunch. I've got to say...my mood was lifted as I saw the wall with the old school (and semi recent) Jay Chou MVs. Definitely brought back nostalgic moments in early high school. The one dish that I was looking forward to was the tomato beef noodle soup..however that was the one dish that did disappoint. Maybe I have high expectations since my mama has a pretty bomb recipe..but the broth just wasn't super flavorful and the beef was mediocre. However, the other dishes that we did order--pork belly gua bao, ground pork rice (滷肉飯), pork chop over rice (排骨飯), beef wraps (牛肉捲餅), and sweet potato leaves with thousand year old egg (地瓜葉炒皮蛋) were all incredibly tasty and I highly recommend ordering them. Service was also decent--very efficient for only having 2 waitresses. The restaurant was also decorated with Taiwanese 90s toys and candies. Overall, the experience brought back a sense of home for a Taiwanese millennial and had authentic music and delicious food to top it off. Highly recommend for anyone who enjoys Taiwanese music and food! Will be back if I'm ever in the bay area.", "rating": 4, "date": "2018-04-02"}, {"excerpts": ["The spicy tomato beef noodle soup only had a couple pieces of tomato, but overall hearty for a cloudy cool day. ", "Surprisingly, the \"lo rau\" rice was our least favorite. ", "Too much vinegar and the pork was a little gamey tasting. ", "Staff was friendly and the food came out pretty quickly."], "author": "Ellen H.", "review": "Small but cute place with wooden banquet seating and old style theater chairs! They have a nice selection on the menu for snacks, appetizers, soup noodles, and meat/rice bowls. We got the beef roll, which was one of the best I've had in the Bay Area, however, you only get 4 small pieces for $8. The broth for the \"mai fun\" has good depth of flavor and wasn't too salty or oily. The spicy tomato beef noodle soup only had a couple pieces of tomato, but overall hearty for a cloudy cool day. Surprisingly, the \"lo rau\" rice was our least favorite. Too much vinegar and the pork was a little gamey tasting. Staff was friendly and the food came out pretty quickly.", "rating": 4, "date": "2018-03-31"}, {"excerpts": ["I've had both the tomato beef noodle soup and the braised beef noodle soup, and prefer the braised beef. ", "Both soups are very similar, however, and the texture of the noodles was spot on. ", "The braised beef soup definitely has a spicy kick to it which I loved. ", "We loved their yam leaves dish as well. ", "The pork belly rice bowl was a bit lacking, but decent. ", "I wish there were more veggie options on the menu (I think yam leaves was the only veggie dish if I recall...). ", "I wish the restaurant fit more people (is the center table/bar really necessary to sell $1 candies?) ", "But overall, very happy with the addition of this Taiwanese restaurant to the neighborhood, and we hope it sticks around! ", "(Especially given that previous restaurants in that same location fail every few years :( )"], "author": "Sophia L.", "review": "YUM. We came here for the first time on a Saturday night for take out (and thank goodness we did because the line for dine in was massive), and the food was so good we came back the next day for a round 2. I've had both the tomato beef noodle soup and the braised beef noodle soup, and prefer the braised beef. Both soups are very similar, however, and the texture of the noodles was spot on. The braised beef soup definitely has a spicy kick to it which I loved. We loved their yam leaves dish as well. The pork belly rice bowl was a bit lacking, but decent. I wish there were more veggie options on the menu (I think yam leaves was the only veggie dish if I recall...). I wish the restaurant fit more people (is the center table/bar really necessary to sell $1 candies?) But overall, very happy with the addition of this Taiwanese restaurant to the neighborhood, and we hope it sticks around! (Especially given that previous restaurants in that same location fail every few years :( )", "rating": 4, "date": "2018-05-07"}], "plain beef noodle soup": [], "plain tomato beef noodle soup": [], "mifun soup": [], "taro mifun soup": [], "fish ball mifun soup": [], "mix soup": [], "shrimp wonton noodle soup": [], "piece taiwaness pork belly gua bao": [], "piece kimchi pork belly gua bao": [], "piece deep fried fish gua bao": [], "piece fried chicken gua bao": [], "piece mix gua bao": [], "bbq pulled pork gua bao": [], "piece scallion pancake": [], "piece deep fried gyoza": [], "piece fried spicy chicken wing": [], "baked napa cabbage with cheese": [], "baked sweet corn with cheese": [], "cold seaweed salad": [], "kimchi pork with tofu": [], "steam rice cake": [{"excerpts": ["Loved the Taiwanese pork belly Gua Bao, steam rice cake, sizzling beef and noodle with black pepper and mushroom sauce (a bit too salty), beef noodle soup (a bit too salty), taro mi-fun soup, and friend chicken. \n\n"], "author": "Anya C.", "review": "A good Taiwanese place. Loved the Taiwanese pork belly Gua Bao, steam rice cake, sizzling beef and noodle with black pepper and mushroom sauce (a bit too salty), beef noodle soup (a bit too salty), taro mi-fun soup, and friend chicken. \n\nOthers we liked less were: stir fried preserved eggs with sweet potato leaves because he leaves were too old, winter mellow tea with grass jelly because the jelly is not smooth like what we had in Taiwan, Sapporo beer because it taste old, and rice was dry and not tasty. \n\nKeep the good work! Love the fact there is a good Taiwanese place in town!", "rating": 4, "date": "2018-07-04"}], "fried rice cake": [], "cold preserved eggs with tofu": [], "stir fried preserved eggs with sweet potato leaves": [{"excerpts": ["Others we liked less were: stir fried preserved eggs with sweet potato leaves because he leaves were too old, winter mellow tea with grass jelly because the jelly is not smooth like what we had in Taiwan, Sapporo beer because it taste old, and rice was dry and not tasty. \n\n"], "author": "Anya C.", "review": "A good Taiwanese place. Loved the Taiwanese pork belly Gua Bao, steam rice cake, sizzling beef and noodle with black pepper and mushroom sauce (a bit too salty), beef noodle soup (a bit too salty), taro mi-fun soup, and friend chicken. \n\nOthers we liked less were: stir fried preserved eggs with sweet potato leaves because he leaves were too old, winter mellow tea with grass jelly because the jelly is not smooth like what we had in Taiwan, Sapporo beer because it taste old, and rice was dry and not tasty. \n\nKeep the good work! Love the fact there is a good Taiwanese place in town!", "rating": 4, "date": "2018-07-04"}, {"excerpts": ["Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! "], "author": "Jenny S.", "review": "Came here on a Sunday night around 9pm with a party of 3. Waited about 20 minutes. *Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! Also recommend, but the sauce that goes with it is a bit too salty..\n\nBraised beef noodle soup; This dish was just okay. The noodles were still a bit hard and the soup didn't have as much flavor as I expected. Although the braised beef was super tender.\n\nGrounded pork over rice; my favorite dish the whole night. It was not as saucy as the usual Taiwanese dish, which made it less salty and more enjoyable. \n\nFried chicken over rice; JUICY CHICKEN! and definitely reminds me of the Taiwanese chicken steak you get in the street. \n\nOverall, the food was delicious but a bit on the pricier side for the portion you get. Got to try the bao's next time.. (They ran out ..boo)", "rating": 4, "date": "2018-03-19"}], "house special pork ribs": [], "beef wrap": [{"excerpts": ["The beef wrap was actually pretty salty. ", "I wish that they had the hoisin sauce instead of soy sauce, but even by itself it was pretty salty. ", "It was a tiny wrap, but packed with a lot of meat."], "author": "Stephanie C.", "review": "The shaved ice was fairly decent, I don't think you can really mess up this dessert. Lots of brown sugar flavor, loaded with red beans, grass jelly and the taro balls. I loved that taro balls because they were huge and soft/chewy. Big portion so perfect for sharing between 2-3 people. Their dessert selection wasn't as much as I thought but hoping that they can expand it. \n\nThe beef wrap was actually pretty salty. I wish that they had the hoisin sauce instead of soy sauce, but even by itself it was pretty salty. It was a tiny wrap, but packed with a lot of meat.", "rating": 4, "date": "2018-10-23"}, {"excerpts": ["but I settled with 3 items: popcorn chicken (happy hour item), braised beef noodle soup, and the beef wrap. \n\n", "I had hoped there'd be more sweetness to the beef broth and beef wrap. ", "The beef in the soup was somewhat tender, but the outside was slightly dry. ", "The popcorn chicken was surprisingly my favorite. ", "It was seasoned and battered well. "], "author": "Mary X.", "review": "I studied abroad in Taiwan and miss the food so much, so I was really looking forward to trying this out since there aren't many Taiwanese spots in SF.\n\nThere was a lot of variety on the menu but I settled with 3 items: popcorn chicken (happy hour item), braised beef noodle soup, and the beef wrap. \n\nMy overall impression of the food was that it was too salty. My mouth is still feeling pretty dry and it's been ~5 hours since I finished my meal. I had hoped there'd be more sweetness to the beef broth and beef wrap. The beef in the soup was somewhat tender, but the outside was slightly dry. Both dishes were meaty, however. \n\nThe popcorn chicken was surprisingly my favorite. It was seasoned and battered well. The sauces included weren't a good match though (wish they had a sweet chili sauce, they just had ketchup).\n\nI may give this place another try, but it doesn't seem worth the drive from the outer mission. I'll stick with my favorites in the sunset..", "rating": 3, "date": "2018-08-23"}, {"excerpts": ["Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! "], "author": "Jenny S.", "review": "Came here on a Sunday night around 9pm with a party of 3. Waited about 20 minutes. *Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! Also recommend, but the sauce that goes with it is a bit too salty..\n\nBraised beef noodle soup; This dish was just okay. The noodles were still a bit hard and the soup didn't have as much flavor as I expected. Although the braised beef was super tender.\n\nGrounded pork over rice; my favorite dish the whole night. It was not as saucy as the usual Taiwanese dish, which made it less salty and more enjoyable. \n\nFried chicken over rice; JUICY CHICKEN! and definitely reminds me of the Taiwanese chicken steak you get in the street. \n\nOverall, the food was delicious but a bit on the pricier side for the portion you get. Got to try the bao's next time.. (They ran out ..boo)", "rating": 4, "date": "2018-03-19"}, {"excerpts": ["The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap."], "author": "珮瑜", "review": "I'm from Taiwan and I've been here 3 times. The taste of dishes are similar to my hometown. That's why I took many of my friends who are from different countries there to taste Taiwanes food, and they really enjoyed the food. The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap.", "rating": 5, "date": "2018-10-18"}, {"excerpts": ["- Beef Wrap: ", "Gave this a try, but was disappointed. ", "The wrap was very dry as a whole and the pieces fell apart so easily that it was not easy to eat. "], "author": "Amanda C.", "review": "Came here with my boyfriend on a Saturday night, and boy were they packed with a line. Little known secret is to make a reservation, as those are first come first served and they have a limited amount they put aside for it. My boyfriend took nearly 45 minutes to find parking, so obviously take public transportation or rideshare to avoid such a waste of time. Luckily, he dropped me off to be seated first and I put in the order while waiting. The space is super small inside, but definitely gave me the Taiwanese restaurant vibe. I think it' mostly due to the decor of the space with candy and other goodies sold at the front and the seating behind the snacks. I started with a peach green tea, since boba tea originated in Taiwan. A bit disappointed that there wasn't boba with the drink. It was a little on the sweeter end versus tasting the actual tea, but it was okay. \n\nStarters:\n- Baked Cheese Corn: this plate came out a lot larger than I expected, but it was good! Cheese was good and the corn was sweet. I would definitely reorder when I return.\n- Beef Wrap: Gave this a try, but was disappointed. The wrap was very dry as a whole and the pieces fell apart so easily that it was not easy to eat. Flavor was also lacking in the wrap, and the meat had a bit of flavor but was super dry. \n\nMain Course:\n- Braised Beef Noodle Soup (spicy): The bowl was fairly large, and had a good kick of spice to it that I could handle. It wasn't overpowering so that you could taste the flavor of the rest of the dish, but a perfect amount for me to taste all the flavors. Noodles were a great texture and perfect firmness and the meat fell apart easily as it should for this dish.\n- Sizzling Whole Squid with Peppered and Mushroom Sauce: Originally I didn't want this because I don't like mushrooms, but the mushroom was just in the sauce and not all over the dish so I could deal. The peppery flavor was very apparent in the noodles and the fried squid was huge! Super flavorful and I couldn't finish the dish - had to take it home and it still was two more meals for me after that from this one dish.\n\nOverall, it was around $50 something to try all those dishes. I want to return to try the baos, but definitely filling entrees and portions.", "rating": 4, "date": "2018-03-31"}, {"excerpts": ["I ordered the Spice Braised Beef Noodle Soup and the Beef Wrap. ", "The Beef Noodle Soup seemed a bit smaller than expected, but it ended up being pretty filling. ", "The broth was super flavorful and just mildly spicy. ", "The beef was tender and savory. ", "It was a pretty dam satisfying bowl of Taiwanese beef noodle soup! ", "The beef wrap is just as tasty and not too greasy. ", "That dipping sauce is amazing, like now I wanna put it on everything. ", "Delicious!"], "author": "Nana L.", "review": "I've been wanting to try their beef noodle soup for a while. So my dinner option was obvious when I saw HoDaLa on UberEats. I ordered the Spice Braised Beef Noodle Soup and the Beef Wrap. The Beef Noodle Soup seemed a bit smaller than expected, but it ended up being pretty filling. The broth was super flavorful and just mildly spicy. The beef was tender and savory. It was a pretty dam satisfying bowl of Taiwanese beef noodle soup! The beef wrap is just as tasty and not too greasy. That dipping sauce is amazing, like now I wanna put it on everything. Delicious!", "rating": 5, "date": "2018-05-07"}, {"excerpts": ["My girlfriend and I ordered the beef wrap, braise beef over rice and the Taiwanese Pork Belly Gua Bao. ", "All three dishes were amazing. ", "We enjoyed the Taiwanese Pork Belly Bao the most. ", "The pork belly was super bomb!!"], "author": "Anthony L.", "review": "My girlfriend and I ordered the beef wrap, braise beef over rice and the Taiwanese Pork Belly Gua Bao. All three dishes were amazing. We enjoyed the Taiwanese Pork Belly Bao the most. The pork belly was super bomb!!", "rating": 5, "date": "2018-07-01"}], "dim sum combo ha gao  siu mai": [], "popcorn chicken": [{"excerpts": ["Fried Chicken- tastes like a giant popcorn chicken. ", "Liked. \n", "Sizzling Meat Lover- ", "strong black pepper sauce taste. ", "Steak was chewy. \n", "Tomato beef noodle soup- average. "], "author": "Tina S.", "review": "Really wanted to like this place. Customer service was great. Food was alright. \n\nMixed Gua Baos- pork belly, kimchee pork belly, fried fish. I enjoyed the pork belly, would skip on the kimchee pork belly. \nFried Chicken- tastes like a giant popcorn chicken. Liked. \nSizzling Meat Lover- strong black pepper sauce taste. Steak was chewy. \nTomato beef noodle soup- average. Would not order again. \n\nWill try the minced pork rice next time. Price was totally reasonable.", "rating": 3, "date": "2018-06-08"}, {"excerpts": ["Popcorn chicken is an old guilty pleasure and a snack i frequently ordered at boba shops. "], "author": "Samantha L.", "review": "In a neighborhood of heavily Asian restaurants, Taiwanese food is actually a much welcomed cuisine.\n\nYES to the braised beef noodle soup. Just the right amount of familiar noodles, soup, and a sprinkling of veggies. I wouldn't mind a few more carrot pieces though! Popcorn chicken is an old guilty pleasure and a snack i frequently ordered at boba shops. For a similar dish, get the fried pork chop over rice. Same seasoning, just a little heartier.  Between the chicken bao, the pork belly bao and the fried fish bao - the fried chicken bao took first place. While you can get all three, just opt for 3 of those!\n\nI'd come back again despite the uncomfortable seating! Are these former auditorium chairs? No one wants to eat noodle soup in these...", "rating": 4, "date": "2018-05-26"}, {"excerpts": ["but I settled with 3 items: popcorn chicken (happy hour item), braised beef noodle soup, and the beef wrap. \n\n", "I had hoped there'd be more sweetness to the beef broth and beef wrap. ", "The beef in the soup was somewhat tender, but the outside was slightly dry. ", "The popcorn chicken was surprisingly my favorite. ", "It was seasoned and battered well. "], "author": "Mary X.", "review": "I studied abroad in Taiwan and miss the food so much, so I was really looking forward to trying this out since there aren't many Taiwanese spots in SF.\n\nThere was a lot of variety on the menu but I settled with 3 items: popcorn chicken (happy hour item), braised beef noodle soup, and the beef wrap. \n\nMy overall impression of the food was that it was too salty. My mouth is still feeling pretty dry and it's been ~5 hours since I finished my meal. I had hoped there'd be more sweetness to the beef broth and beef wrap. The beef in the soup was somewhat tender, but the outside was slightly dry. Both dishes were meaty, however. \n\nThe popcorn chicken was surprisingly my favorite. It was seasoned and battered well. The sauces included weren't a good match though (wish they had a sweet chili sauce, they just had ketchup).\n\nI may give this place another try, but it doesn't seem worth the drive from the outer mission. I'll stick with my favorites in the sunset..", "rating": 3, "date": "2018-08-23"}, {"excerpts": ["The Fried Popcorn Chicken makes you feel like you're in the Taiwan night market.\n\n"], "author": "Chloe S.", "review": "Gua bao was on point.\n\nThe Fried Popcorn Chicken makes you feel like you're in the Taiwan night market.\n\nPrices are amazing!\n\nThe vibe is definitely very authentic for young Taiwanese folks. They play project Taiwanese music videos on the all's. They've got Taiwanese candies at the front desk that's reminiscent of childhood. \n\nI love this place. Will definitely come back and bring my friends. \n\nGreat for a chill, low-key, delicious meal.", "rating": 5, "date": "2018-06-30"}, {"excerpts": ["Popcorn chicken was good ", "but it's more like your standard fare Asian popcorn chicken you can get anywhere. "], "author": "Cecile X.", "review": "Solid food, the noodle soup was good. I enjoyed the texture of the noodle, flavor of the soup and tenderness of the beef. Popcorn chicken was good but it's more like your standard fare Asian popcorn chicken you can get anywhere. It is executed perfectly and was tasty but small portion for $6.99.\n\nWould like to see the intestine dog (aka big sausage wrap small sausage) and stinky tofu as they are Taiwanese staples.", "rating": 4, "date": "2018-08-31"}, {"excerpts": ["They should put basil popcorn chicken on the menu to go with the boba drinks!"], "author": "Michelle K.", "review": "This place has a very cute interior and gives a nice homey place. My friend and I came here for late night food and it really hit the spot. They should put basil popcorn chicken on the menu to go with the boba drinks!", "rating": 5, "date": "2018-08-11"}, {"excerpts": ["Fried chicken w/ rice - 4 Stars super yummy, taste like popcorn chicken\n\nScallion pancake - 3.5 Stars nothing special "], "author": "michele h.", "review": "Pretty good overall!\n\nOrdered:\n\nBraised beef noodle soup - 4.5 Stars, great taste and flavors, a must try here!\n\nFried chicken w/ rice - 4 Stars super yummy, taste like popcorn chicken\n\nScallion pancake - 3.5 Stars nothing special but it does come with a unique sauce\n\nMixed bao - pork belly bao 4.5 Stars sooo good! \nFried fish bao 2.5 Stars taste like frozen fish\nFried chicken bao 2.5 Stars taste like frozen chicken nuggets, if they changed it to the chicken they used in the rice, it'll be so much better\n\nWe ordered milk tea and the black tea with lemon, they were both pretty good!", "rating": 4, "date": "2018-05-06"}], "fried pork chop": [{"excerpts": ["For a similar dish, get the fried pork chop over rice. ", "Same seasoning, just a little heartier.  ", "Between the chicken bao, the pork belly bao and the fried fish bao - the fried chicken bao took first place. "], "author": "Samantha L.", "review": "In a neighborhood of heavily Asian restaurants, Taiwanese food is actually a much welcomed cuisine.\n\nYES to the braised beef noodle soup. Just the right amount of familiar noodles, soup, and a sprinkling of veggies. I wouldn't mind a few more carrot pieces though! Popcorn chicken is an old guilty pleasure and a snack i frequently ordered at boba shops. For a similar dish, get the fried pork chop over rice. Same seasoning, just a little heartier.  Between the chicken bao, the pork belly bao and the fried fish bao - the fried chicken bao took first place. While you can get all three, just opt for 3 of those!\n\nI'd come back again despite the uncomfortable seating! Are these former auditorium chairs? No one wants to eat noodle soup in these...", "rating": 4, "date": "2018-05-26"}, {"excerpts": ["I had the fried pork chop over rice ($9) and my boyfriend had the fried chicken over rice ($9), and both dishes were a disappointment. ", "The fried pork chop had no flavor, despite having a crumb filled coating. ", "The fried chicken over rice was a lot more satisfying, in terms of flavor, but after eating a few bites it got overly salty. ", "The rice dish came with some bamboo shoots and one piece of boiled bok choy. ", "Perhaps I am spoiled by 66 in Flushing, NY growing up but this place didn't live up to my Taiwanese pork chop over rice standards. ", "Dinner with a beer to share, after tax and tip came out to approx. ", "$28, which isn't bad in terms of a meal for two, but the money definitely could've been better spent elsewhere."], "author": "Victoria X.", "review": "*you can reserve a spot to wait on line via yelp*\nResidential and street parking available in the area. \nThey serve Taiwan Beer here\n\nI had the fried pork chop over rice ($9) and my boyfriend had the fried chicken over rice ($9), and both dishes were a disappointment. The fried pork chop had no flavor, despite having a crumb filled coating. The fried chicken over rice was a lot more satisfying, in terms of flavor, but after eating a few bites it got overly salty. The rice dish came with some bamboo shoots and one piece of boiled bok choy. Perhaps I am spoiled by 66 in Flushing, NY growing up but this place didn't live up to my Taiwanese pork chop over rice standards. Dinner with a beer to share, after tax and tip came out to approx. $28, which isn't bad in terms of a meal for two, but the money definitely could've been better spent elsewhere.", "rating": 3, "date": "2018-05-24"}, {"excerpts": ["For the fried pork chop over rice dish - a Taiwanese staple, the pork was fried well, but seasoning had a lot of room for improvement. \n\n"], "author": "Austin W.", "review": "Decent Taiwanese food, but there are better in this area (i.e. House of Pancakes and Taste of Formosa). \n\nFor the fried pork chop over rice dish - a Taiwanese staple, the pork was fried well, but seasoning had a lot of room for improvement. \n\nHoDaLa's beef pancake -- my absolute favorite food in the world, was a good effort, but missed the mark for me. While the beef pancake here is filled to the brim with meat, it definitely lacks the balance of a good beef pancake (i.e. needs more hoisin and cilantro).\n\nThe only dish that I thought was done well at HoDaLa was the beef noodle soup: definitely as good as a bowl you'd find in Taiwan. Restaurants will frequently overcook beef till it's fall of the bone tender, but that's actually not authentic to Taiwnese beef noodle soup. The best beef noodle soups will cook the beef just enough that you still are able to get the texture of the beef with every bite.\n\nI'd give HoDoLa another shot in the future, but if you could only choose one Taiwanese place to try out during your visit in SF, I'd look elsewhere.", "rating": 3, "date": "2018-06-26"}, {"excerpts": ["Fried Pork Chop over Rice ", "- I love how thin the breading of the pork chop was, and how juicy the meat was. ", "The sauce was on point but it made the fried pork chop a bit soggy in the end. ", "Overall was still a great entree especially with the bamboo shoots on the side. \n"], "author": "Jamie Y.", "review": "I absolutely loved this restaurant. It was very hyped up for me and it definitely lived up to the hype, and this is coming from a Taiwanese girl who's from 626. The restaurant decor is very throwback with a ton of good ol Taiwanese candy, snacks and posters. \n\nI went so ham and ordered 6 things for 3 people. \nStir Fried Preserved Egg with Sweet Potato Leaves - Sweet potato leaves is such a Taiwanese staple vegetable, the preserved egg went really well with it, I'm definitely going to steal this recipe. \nPork Belly Gua Bao - The flavor is on point and the bao was fluffy, delicious and with a sweet aftertaste. The sauce went really well with the peanut crumbs. The pork belly was cooked really well, it was juicy and meaty. \nGrounded Pork over Rice - Another traditional dish that was done very well. The ground pork was juicy and flavorful, it had a mixture of ground mushrooms in it as well so the texture was great. It had enough sauce to make the rice really tasty. It also came with some sour cabbage (my favorite), marinated egg and also pickled radish for garnish and taste. \nFried Pork Chop over Rice - I love how thin the breading of the pork chop was, and how juicy the meat was. The sauce was on point but it made the fried pork chop a bit soggy in the end. Overall was still a great entree especially with the bamboo shoots on the side. \nSizzling Beef with Black Pepper and Mushroom Sauce - The flavor of this dish was on point! Just like the ones you'd get in a night market. The steak was too tough imo and the noodle was overcooked. I'd skip this dish next time.\n\nMy favorite of the meal was the TOMATO BEEF NOODLE SOUP, I was obsessed. It reminded me of my childhood, and I had always been on a search for tomato based bns. This place has done a perfect job, and it had a really nice kick to the broth as well. The beef was also a perfect balance of tendon and meat. \n\nI'd have to come back here again if I'm ever visiting sf!! The service was also friendly and attentive.", "rating": 5, "date": "2018-05-21"}, {"excerpts": ["We tried their shaved ice, fried Bao, fried pork chop rice and Mi-Fun soup. ", "Everything was delicious! ", "I highly recommend coming with friends on a Friday night!"], "author": "Michelle C.", "review": "The food here is super authentic. I feel like I'm back in Taipei at a night market. We tried their shaved ice, fried Bao, fried pork chop rice and Mi-Fun soup. Everything was delicious! I highly recommend coming with friends on a Friday night!", "rating": 5, "date": "2018-09-07"}, {"excerpts": ["Fried Pork Chop over Rice", ": This dish was pretty good! ", "Nothing extraordinary but flavorful, and a good crunch."], "author": "Johnny F.", "review": "Came here with some friends and we all enjoyed the bao's offered here. Pricey but worth a try as it was delicious. We tried all of em.\n\nTomato noodle soup: I would never get this. There was a flavor too distinct and too strong to even swallow. It was hard to eat.\n\nFried Pork Chop over Rice: This dish was pretty good! Nothing extraordinary but flavorful, and a good crunch.", "rating": 4, "date": "2018-07-01"}, {"excerpts": ["Love the fried pork chop!!!! ", "Soo good! ", "Must get.  ", "Tried it when they just open ", "but now it's even better.  ", "Btw - their passion fruit beer and lychee beer is delicious!!! ", "oyster pancake in the future?  ", "Nice ambiance on the weekend!"], "author": "Kathy C.", "review": "Love the fried pork chop!!!! Soo good! Must get.  Tried it when they just open but now it's even better.  Btw - their passion fruit beer and lychee beer is delicious!!! oyster pancake in the future?  Nice ambiance on the weekend!", "rating": 5, "date": "2018-08-11"}, {"excerpts": ["I really like the fried pork chop, very cripsy. ", "i also like the fried Tofu( the dip sauce definitely brings to a different level. ", "And it's a very inexpensive place :)"], "author": "Jason J.", "review": "I really like the fried pork chop, very cripsy. i also like the fried Tofu( the dip sauce definitely brings to a different level. And it's a very inexpensive place :)", "rating": 4, "date": "2018-06-30"}, {"excerpts": ["We got bunch of things-a pitcher of beer, pork guabao, green scallion pancakes, fried meat sticks, braised beef noodle soup, and fried pork chop over rice. ", "There was a little wait when we got there, but somehow they skipped over some parties and took us to a table fairly quickly. ", "The two ladies waiting tables are super nice and kind, which is kinda amazing. ", "I tend to associate Asian restaurants with straight forward service aka North Korean style (just kidding) ", "sans any smiles. ", "The food overall was unfortunately very average and a bit of miss for me. ", "I was totally stoked that another Taiwanese eatery opened up. ", "The guabao was probably the best. ", "The meat was tender and flavors were nice and not over the top like chairman bao's in the tenderloin. ", "The buns were pretty cold or luke warm at best. ", "The pancake was little greasy and chewy.  ", "the fried meat sticks were ok. ", "They are like miniature fried wontons, and not memorable. ", "The pork chop over rice tasted really good but the meat was over cooked and became very stringy. ", "The braised beef noodle soup was similar. ", "The broth was really solid but the meat was very stringy, I had one piece that was tender and rest ", "felt like they were cooked to death. ", "But it was the noodle itself that did me in. ", "They were just flat,\nstore bought noodles with no texture ", "what so ever. ", "I was hoping that for 12 dollars, I'd get fresh hand made noodles, which ironically a lot of the Asian hotpot places (which line the street) have now. ", "So taking everything into account, I think the prices are a bit high for the quality of food dished out, but good and friendly service. ", "Will probably wait a while until we come back. ", "Hope they put a little more effort into the food and menu itself. ", "Now onto Walgreens to get some floss."], "author": "Charles L.", "review": "I liked this cozy place tucked away on Geary. The sign said soft opening so just take that into account. We got bunch of things-a pitcher of beer, pork guabao, green scallion pancakes, fried meat sticks, braised beef noodle soup, and fried pork chop over rice. There was a little wait when we got there, but somehow they skipped over some parties and took us to a table fairly quickly. The two ladies waiting tables are super nice and kind, which is kinda amazing. I tend to associate Asian restaurants with straight forward service aka North Korean style (just kidding) sans any smiles. The food overall was unfortunately very average and a bit of miss for me. I was totally stoked that another Taiwanese eatery opened up. The guabao was probably the best. The meat was tender and flavors were nice and not over the top like chairman bao's in the tenderloin. The buns were pretty cold or luke warm at best. The pancake was little greasy and chewy.  the fried meat sticks were ok. They are like miniature fried wontons, and not memorable. The pork chop over rice tasted really good but the meat was over cooked and became very stringy. The braised beef noodle soup was similar. The broth was really solid but the meat was very stringy, I had one piece that was tender and rest felt like they were cooked to death. But it was the noodle itself that did me in. They were just flat,\nstore bought noodles with no texture what so ever. I was hoping that for 12 dollars, I'd get fresh hand made noodles, which ironically a lot of the Asian hotpot places (which line the street) have now. So taking everything into account, I think the prices are a bit high for the quality of food dished out, but good and friendly service. Will probably wait a while until we come back. Hope they put a little more effort into the food and menu itself. Now onto Walgreens to get some floss.", "rating": 3, "date": "2018-05-23"}, {"excerpts": ["The fried pork chop was actually not bad ", "but I wouldn't go back for it. ", "Overall 2 stars. ", "Overly seasoned. ", "Decent customer service."], "author": "Jimmy C.", "review": "Best described as Taiwanese street food. I tried the three buns combination. The pork belly was wayyyy too salty and overwhelmed everything. The fish fillet (literally; on a bun) tasted like microwaveable fish sticks. Chicken fillet tasted like mc chicken on a Bun, also tasted microwaved. The meat lover was nothing special aside from the 19$. Noodles were overly dressed in sauce, sausage was different( in a bad way), steak was alright nothing special. The fried pork chop was actually not bad but I wouldn't go back for it. Overall 2 stars. Overly seasoned. Decent customer service.", "rating": 2, "date": "2018-05-23"}], "fried chicken cutlet": [{"excerpts": ["Fried chicken cutlet", ": this is a secret item not on the menu. "], "author": "Tom P.", "review": "Nice atmosphere and decorations. No line on a Thursday night at prime dinner time.\n\nFried chicken cutlet: this is a secret item not on the menu. Delicious, does not need any sauce, just the right amount if seasoning, fried perfectly, juicy, not too dry.\n\nTomato noodle soup: portion size was small and only contained one small square slice of a tomato, but was still pretty good.\n\nGround pork over rice: comes with a tea egg, again small portioned but was quite good, full of flavour.", "rating": 4, "date": "2018-06-08"}, {"excerpts": ["They have some unique dishes and traditional dishes like fried chicken cutlet and lu rou fan. ", "What stood out to me was the black pepper noodles and GRILLED SQUID! ", "omg that was super delicious! ", "I would go back just for that dish. ", "Their chicken was mediocre, it was a bit dry and thin.  ", "For dessert, we had the grass jelly and balls ice dessert ", "and it was pretty good! ", "I wish theyd add mee sua and oyster pancakes in the future."], "author": "Emi K.", "review": "SF doesnt have many Taiwanese restaurants so i was super excited to see this place open up! The decor is really cute and reminds me of Taiwan. They have some unique dishes and traditional dishes like fried chicken cutlet and lu rou fan. What stood out to me was the black pepper noodles and GRILLED SQUID! omg that was super delicious! I would go back just for that dish. Their chicken was mediocre, it was a bit dry and thin.  For dessert, we had the grass jelly and balls ice dessert and it was pretty good! I wish theyd add mee sua and oyster pancakes in the future.", "rating": 5, "date": "2018-09-18"}, {"excerpts": ["Their fried chicken cutlet is also very crispy and juicy. ", "I wish they will add oyster pancake to their menu."], "author": "Steffi H.", "review": "I like their Taiwanese pork belly gua bao. It's very authentic with a lot of peanuts powder. Their fried chicken cutlet is also very crispy and juicy. I wish they will add oyster pancake to their menu.", "rating": 4, "date": "2018-08-16"}], "fried cream cheese jalakemont poppers  pcs": [], "baked mashed potato with bacon cheese": [], "pork wrap": [], "napa cabbage stew": [], "grounded pork over rice": [{"excerpts": ["Grounded pork over rice; my favorite dish the whole night. "], "author": "Jenny S.", "review": "Came here on a Sunday night around 9pm with a party of 3. Waited about 20 minutes. *Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! Also recommend, but the sauce that goes with it is a bit too salty..\n\nBraised beef noodle soup; This dish was just okay. The noodles were still a bit hard and the soup didn't have as much flavor as I expected. Although the braised beef was super tender.\n\nGrounded pork over rice; my favorite dish the whole night. It was not as saucy as the usual Taiwanese dish, which made it less salty and more enjoyable. \n\nFried chicken over rice; JUICY CHICKEN! and definitely reminds me of the Taiwanese chicken steak you get in the street. \n\nOverall, the food was delicious but a bit on the pricier side for the portion you get. Got to try the bao's next time.. (They ran out ..boo)", "rating": 4, "date": "2018-03-19"}, {"excerpts": ["Grounded Pork over Rice - Another traditional dish that was done very well. ", "The ground pork was juicy and flavorful, it had a mixture of ground mushrooms in it as well ", "so the texture was great. ", "It had enough sauce to make the rice really tasty. ", "It also came with some sour cabbage (my favorite), marinated egg and also pickled radish for garnish and taste. \n"], "author": "Jamie Y.", "review": "I absolutely loved this restaurant. It was very hyped up for me and it definitely lived up to the hype, and this is coming from a Taiwanese girl who's from 626. The restaurant decor is very throwback with a ton of good ol Taiwanese candy, snacks and posters. \n\nI went so ham and ordered 6 things for 3 people. \nStir Fried Preserved Egg with Sweet Potato Leaves - Sweet potato leaves is such a Taiwanese staple vegetable, the preserved egg went really well with it, I'm definitely going to steal this recipe. \nPork Belly Gua Bao - The flavor is on point and the bao was fluffy, delicious and with a sweet aftertaste. The sauce went really well with the peanut crumbs. The pork belly was cooked really well, it was juicy and meaty. \nGrounded Pork over Rice - Another traditional dish that was done very well. The ground pork was juicy and flavorful, it had a mixture of ground mushrooms in it as well so the texture was great. It had enough sauce to make the rice really tasty. It also came with some sour cabbage (my favorite), marinated egg and also pickled radish for garnish and taste. \nFried Pork Chop over Rice - I love how thin the breading of the pork chop was, and how juicy the meat was. The sauce was on point but it made the fried pork chop a bit soggy in the end. Overall was still a great entree especially with the bamboo shoots on the side. \nSizzling Beef with Black Pepper and Mushroom Sauce - The flavor of this dish was on point! Just like the ones you'd get in a night market. The steak was too tough imo and the noodle was overcooked. I'd skip this dish next time.\n\nMy favorite of the meal was the TOMATO BEEF NOODLE SOUP, I was obsessed. It reminded me of my childhood, and I had always been on a search for tomato based bns. This place has done a perfect job, and it had a really nice kick to the broth as well. The beef was also a perfect balance of tendon and meat. \n\nI'd have to come back here again if I'm ever visiting sf!! The service was also friendly and attentive.", "rating": 5, "date": "2018-05-21"}, {"excerpts": ["We ordered three baos: fried chicken bao, pulled pork bao, and the Taiwanese pork bao and a grounded pork over rice. ", "The meat in all were a tiny bit dry and fatty ", "but it was okay. ", "The restaurant itself has a mini Asian snack market and the staff is pretty friendly here. ", "Over would come back and try some desserts!!"], "author": "Nicole W.", "review": "We originally joined the waitlist thinking there was a line but when we arrived we got seated right away. We ordered three baos: fried chicken bao, pulled pork bao, and the Taiwanese pork bao and a grounded pork over rice. The meat in all were a tiny bit dry and fatty but it was okay. The restaurant itself has a mini Asian snack market and the staff is pretty friendly here. Over would come back and try some desserts!!", "rating": 4, "date": "2018-09-19"}, {"excerpts": ["I ordered a grounded pork over rice. ", "It was delicious and the price was reasonable. ", "It was worth my money and will definitely come back to try their beef noodle soup!"], "author": "Tiffany L.", "review": "Came here a few days ago with my friend. The most Taiwanese Taiwanese restaurant I've ever seen in the bay. Also, one of the best. They're still at their soft opening, so they'll add more items to their menu later on. They have a really cute snack bar at the front and the candies are for sell. I ordered a grounded pork over rice. It was delicious and the price was reasonable. It was worth my money and will definitely come back to try their beef noodle soup!", "rating": 5, "date": "2018-02-25"}], "braised beef over rice": [{"excerpts": ["The braised beef over rice and pork over rice, chicken over rice were all really good!"], "author": "Cynthia C.", "review": "Excellent food! Catered to my kids peanut and egg allergies. Great presentation and tasty food. Friendly and accommodating service. We had the pork belly buns and they removed the peanuts. The braised beef over rice and pork over rice, chicken over rice were all really good!", "rating": 5, "date": "2018-09-09"}, {"excerpts": ["Ordered the spicy beef noodle, the pork belly bao, braised beef over rice and the mi fun pork Noodle soup.\n\n", "Braised Beef over Rice: "], "author": "Bor C.", "review": "Stopped in for lunch on the suggestion of a friend. Small place, interesting island of snacks/candy in the middle for around a dollar. Maybe that's what the name of this is themed - a whole dolla. Maybe.\n\nOrdered the spicy beef noodle, the pork belly bao, braised beef over rice and the mi fun pork Noodle soup.\n\nPork Belly Bao: Kinda can't go wrong with these. It was good.\n\nSpicy Beef Noodle: My benchmark dish and it was...  just like any other mediocre attempt I find in The City. Beef broth has the tang of bouillon use, flat in character and mildly spicy. The noodle were bordering undercooked as I chewed through a couple half cooked noodle strands. The beef was offensively firm for being braised.\n\nMi Fun Pork Noodle Soup: I had asked the waitress which dish she recommends that would have me coming back and this was it. In referencing the Plain Beef Noodle where it didn't come with actual beef, I asked if that's the same case with this. She assured it had pork in it. The broth was delicate and flavorful. The noodles slick and snappy. The pork... Where's the pork? About an ounce of pork bits. Annoying.\n\nBraised Beef over Rice: See review of spicy beef noodle, because it's the same.\n\nWould I come back? I dunno. Very average. I give it a 2.5 for this visit. Service was okay, but they forgot my Lagunitas IPA.", "rating": 2, "date": "2018-05-28"}], "pork ribs over rice": [{"excerpts": ["In addition, we also shared the Pork Ribs over Rice ($8.95). ", "Oh my goodness, the marinade smelled amazing as soon as it arrived on our table. ", "Even better, it tasted just as wonderful! ", "The bowl of rice was topped with two huge pieces of pork rib with a bok choy and pickled mustard greens. "], "author": "Cindy Z.", "review": "The boyfriend chose HoDaLa for a Friday date night, which was definitely a restaurant that's outside of our norm. It was a pleasant surprise for some cheap and yummy Taiwanese comfort food.\n\nThe two of us shared the Mixed Gua Bao ($10.95), which allowed us to sample multiple flavors. We opted for the Taiwanese Pork Belly Gua Bao, Kimchi Pork Belly Gua Bao, and Deep Fried Fish Gua Bao. These steamed buns usually come with pork belly filling, but both pork belly were rather dry here. On the other hand, the deep fried fish was so delicious! The deep fried fish is paired with a slice of waffle fries for a tasty and crunchy combo. I'd highly recommend the deep fried fish for the gua baos and pass on the pork belly options.\n\nIn addition, we also shared the Pork Ribs over Rice ($8.95). Oh my goodness, the marinade smelled amazing as soon as it arrived on our table. Even better, it tasted just as wonderful! The bowl of rice was topped with two huge pieces of pork rib with a bok choy and pickled mustard greens. The flavors from the pork rib was so juicy and savory with the meat just falling off the bone.\n\nThe rice bowls are so cheap and delicious here --must get! Also, note that this place does get pretty crowded during rush hour times. By the time we left at 7pm, there was a line.", "rating": 4, "date": "2018-05-14"}, {"excerpts": ["Would recommend getting the pork ribs over rice!"], "author": "Bryan L.", "review": "This is probably my favorite Taiwanese restaurant in the neighborhood. Good decor, good service and food are decently priced. \nWould recommend getting the pork ribs over rice!", "rating": 4, "date": "2018-07-08"}], "fried chicken over rice": [{"excerpts": ["I had the fried pork chop over rice ($9) and my boyfriend had the fried chicken over rice ($9), and both dishes were a disappointment. ", "The fried pork chop had no flavor, despite having a crumb filled coating. ", "The fried chicken over rice was a lot more satisfying, in terms of flavor, but after eating a few bites it got overly salty. ", "The rice dish came with some bamboo shoots and one piece of boiled bok choy. ", "Perhaps I am spoiled by 66 in Flushing, NY growing up but this place didn't live up to my Taiwanese pork chop over rice standards. ", "Dinner with a beer to share, after tax and tip came out to approx. ", "$28, which isn't bad in terms of a meal for two, but the money definitely could've been better spent elsewhere."], "author": "Victoria X.", "review": "*you can reserve a spot to wait on line via yelp*\nResidential and street parking available in the area. \nThey serve Taiwan Beer here\n\nI had the fried pork chop over rice ($9) and my boyfriend had the fried chicken over rice ($9), and both dishes were a disappointment. The fried pork chop had no flavor, despite having a crumb filled coating. The fried chicken over rice was a lot more satisfying, in terms of flavor, but after eating a few bites it got overly salty. The rice dish came with some bamboo shoots and one piece of boiled bok choy. Perhaps I am spoiled by 66 in Flushing, NY growing up but this place didn't live up to my Taiwanese pork chop over rice standards. Dinner with a beer to share, after tax and tip came out to approx. $28, which isn't bad in terms of a meal for two, but the money definitely could've been better spent elsewhere.", "rating": 3, "date": "2018-05-24"}, {"excerpts": ["Fried chicken over rice; ", "JUICY CHICKEN! "], "author": "Jenny S.", "review": "Came here on a Sunday night around 9pm with a party of 3. Waited about 20 minutes. *Do not recommend coming with more than 4 people*\n\nOrders: \nStir fried preserved eggs with sweet potato leaves; *recommend to try* slightly sweet veggies with soft eggs \n\nBeef wrap; YUMMMM! Also recommend, but the sauce that goes with it is a bit too salty..\n\nBraised beef noodle soup; This dish was just okay. The noodles were still a bit hard and the soup didn't have as much flavor as I expected. Although the braised beef was super tender.\n\nGrounded pork over rice; my favorite dish the whole night. It was not as saucy as the usual Taiwanese dish, which made it less salty and more enjoyable. \n\nFried chicken over rice; JUICY CHICKEN! and definitely reminds me of the Taiwanese chicken steak you get in the street. \n\nOverall, the food was delicious but a bit on the pricier side for the portion you get. Got to try the bao's next time.. (They ran out ..boo)", "rating": 4, "date": "2018-03-19"}, {"excerpts": ["The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap."], "author": "珮瑜", "review": "I'm from Taiwan and I've been here 3 times. The taste of dishes are similar to my hometown. That's why I took many of my friends who are from different countries there to taste Taiwanes food, and they really enjoyed the food. The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap.", "rating": 5, "date": "2018-10-18"}, {"excerpts": ["Today we had the fried chicken over rice and were so pleasantly surprised! "], "author": "Elise G.", "review": "This is my fourth time here :) super yummy and authentic Taiwanese food. My usual favorite is the beef noodle soup, which is really well done!! Soup is great, beef is not tough, very flavorful, and the noodles are good. \n\nToday we had the fried chicken over rice and were so pleasantly surprised! The batter wasn't too thick, and still added a great dimension to the already delicious chicken (not dry at all), also came with a little minced pork, which was a nice touch. \n\nI think I'd definitely be excited to see tofu pudding on the menu next!!  \n\nThanks HoDaLa for being here", "rating": 5, "date": "2018-09-01"}, {"excerpts": ["I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice ", "and they were all great! ", "I would love to try their shaved ice in the future!"], "author": "Elaine G.", "review": "My favorite place to go to with my friends! I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice and they were all great! I would love to try their shaved ice in the future!", "rating": 5, "date": "2018-08-24"}, {"excerpts": ["She ordered the beef over rice and I ordered the fried chicken over rice. ", "She got 5 pieces of the beef in a big bowl with rice. ", "Mine on the other hand had big pieces of chicken and it was breaded, the breading came off and it was spicy somewhat. ", "We had the tea with boba, my friend had peach tea ", "and I had the mango green tea. "], "author": "Alix J.", "review": "I wanted to try this place out since it opened, my friend and I came to try this place out.  She ordered the beef over rice and I ordered the fried chicken over rice. She got 5 pieces of the beef in a big bowl with rice. Mine on the other hand had big pieces of chicken and it was breaded, the breading came off and it was spicy somewhat. We had the tea with boba, my friend had peach tea and I had the mango green tea. The teas were better than the food we ordered. \n\nI hardly give one star reviews, but the service was lacking. My friend had to get up to get someone to bring the check.  When the girl took our order it looked like she was writing it on her hand.  I am not coming back, I don't get the hype about this place, it had good reviews that is why I wanted to try this place.", "rating": 1, "date": "2018-05-20"}, {"excerpts": ["For food, we ordered the pork belly bao, braised beef noodle soup, and fried chicken over rice. ", "The pork belly bao was my favorite! "], "author": "Jennifer X.", "review": "HoDaLa is a casual dining option for Taiwanese food.\n\nI'm a sucker for details and decor.\n\nJars of old school candy and tea eggs set at the entrance added to the retro feeling of the restaurant.\n\nC-pop music videos from the past 10 years with the likes of JJ Lin and Jay Chou are projected onto the wall behind me. Nostalgia...*~* \n\nService was great; the servers were friendly, attentive, and quick. \n\nWe ordered 2 drinks: lemon black tea with lemon jelly, and grass jelly milk tea. Both drinks were refreshing, and not too sweet. \n\nFor food, we ordered the pork belly bao, braised beef noodle soup, and fried chicken over rice. The pork belly bao was my favorite! The flavored pork belly and preserved vegetable between steamed buns was a perfect combination.\n\nOverall, the food was good with just the right flavors, but not particularly outstanding in quality. \n\nHoDaLa is currently in its soft opening stage, so there's potential. I would return to try other items on the menu including the minced pork over rice, beef rolls, and corn cheese.", "rating": 4, "date": "2018-04-14"}, {"excerpts": ["Chicken cutlet or fried chicken over rice is highly recommended. ", "Good for friends hanging out and get some small bites."], "author": "Venice M.", "review": "Cute dining place with tasty Taiwanese food. Chicken cutlet or fried chicken over rice is highly recommended. Good for friends hanging out and get some small bites.", "rating": 4, "date": "2018-07-04"}, {"excerpts": ["Ordered the fried chicken over rice ", "and it's the crunchiest Taiwanese chicken I've ever had. ", "It was extremely flavorful and reminded me of homestyle cooking. ", "The portion is generous and I really like how they put braised beef over the rice. ", "The side of bok choy really balanced the dish out."], "author": "Brittany W.", "review": "Previously came to this location when it was a noodle soup restaurant. I like how they changed the paint and added lights to brighten the place up.\n\nOrdered the fried chicken over rice and it's the crunchiest Taiwanese chicken I've ever had. It was extremely flavorful and reminded me of homestyle cooking. The portion is generous and I really like how they put braised beef over the rice. The side of bok choy really balanced the dish out.", "rating": 5, "date": "2018-05-07"}, {"excerpts": ["Beef roll was amazing, fried chicken over rice was bomb, I could go on and on. ", "Please go! ", "The decorations also remind me of Taiwan so much-- my friend ", "and I basically ordered the whole menu cuz it was that good!"], "author": "Sophia L.", "review": "Best Taiwanese food in Sf in my opinion! Beef noodle soup was spot on with a bit of spice in broth. Beef roll was amazing, fried chicken over rice was bomb, I could go on and on. Please go! The decorations also remind me of Taiwan so much-- my friend and I basically ordered the whole menu cuz it was that good!", "rating": 5, "date": "2018-03-29"}], "fried pork chops over rice": [{"excerpts": ["(My spice tolerance is abysmally low)\n\nFried pork chops over rice ($8.95) - pork chops were bland and not as crunchy for a dish that was fried. "], "author": "Dianna H.", "review": "Yay, there's finally a Taiwanese spot in the city!\n\nCame here for Sunday dinner in a group of 8. How is that possible for such a small place where the wait time can easily exceed an hour, you ask? I'll let you in on a little secret - they take reservations over the phone!\n\nMy friend called a couple days ahead to make the reservation and it was extremely simple. On the day of, they had the table ready for us when we arrived. Some people decided to get their own thing, but a couple of us shared as well. We ordered:\n\nPork belly bao ($8.95) - comes with 3 baos, so it's essentially $3/bao which isn't bad. This was probably my favorite dish out of everything we ordered. The chuck of pork belly is huge and has great flavor. I didn't like the slightly sweet peanut crumble on it though; it was a weird contrast to the savory pork belly\n\nPreserved eggs with sweet potato leaves ($9.99) - this was okay but the portion was a little small for the price\n\nBeef noodle soup spicy ($11.95) - the beef was deliciously tender but I couldn't eat more than a mouthful or two of this as it was a little too spicy for me, especially after I tried to drink the broth. (My spice tolerance is abysmally low)\n\nFried pork chops over rice ($8.95) - pork chops were bland and not as crunchy for a dish that was fried. Wouldn't get this again\n\nSizzling squid with black pepper and mushroom sauce ($14.95) - the squid was good (probably my second favorite dish of the night) but the noodles that came with it were smothered in a strong black pepper sauce. Not a fan of the noodles...\n\nGround pork over rice ($7.95) - not enough ground pork to go with the huge bowl of rice they give you. The ground pork is pretty fatty too. Wouldn't get this", "rating": 4, "date": "2018-05-25"}, {"excerpts": ["I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice ", "and they were all great! ", "I would love to try their shaved ice in the future!"], "author": "Elaine G.", "review": "My favorite place to go to with my friends! I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice and they were all great! I would love to try their shaved ice in the future!", "rating": 5, "date": "2018-08-24"}], "pork belly over rice": [{"excerpts": ["The ability to order family style is an extremely powerful one as you can satisfy your cravings in multiple areas like beef noodle soup, bbq squid, pork belly over rice, fried chicken, pancakes, etc etc and the list goes on.\n\n"], "author": "Sang P.", "review": "Came here and ordered a lot of food for a big group of people. Personally, I think this is the best way to tackle this place as they have many different selections that you'd want to try. The ability to order family style is an extremely powerful one as you can satisfy your cravings in multiple areas like beef noodle soup, bbq squid, pork belly over rice, fried chicken, pancakes, etc etc and the list goes on.\n\nAll of the food above + taiwan beer = happy brain and stomach. The place is very authentic and service is excellent. Food is reasonably priced. Parking is a bit hard which is one negative and portion size can be dauting for those from out of the country but this is fine for me.", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["I ordered:\n- Beef Noodle Soup Tomato\n- Pork Belly over Rice\n- Chicken Cutlet\n- Green Tea with Cheese Foam\n\nMy favorite thing here is the chicken cutlet, massive pieces and a lot for the price! "], "author": "Joann H.", "review": "This place is so cute! I love the theme and the theater chairs. They sell lots of snacks too, reminds me of my childhood ^__^\n\nI ordered:\n- Beef Noodle Soup Tomato\n- Pork Belly over Rice\n- Chicken Cutlet\n- Green Tea with Cheese Foam\n\nMy favorite thing here is the chicken cutlet, massive pieces and a lot for the price! The place is also a nice drinking spot too with plenty of snack foods, I can definitely see them adding more shareables like french fries with a Taiwanese twist. :)", "rating": 5, "date": "2018-10-13"}, {"excerpts": ["The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap."], "author": "珮瑜", "review": "I'm from Taiwan and I've been here 3 times. The taste of dishes are similar to my hometown. That's why I took many of my friends who are from different countries there to taste Taiwanes food, and they really enjoyed the food. The dishes that I recommend are braised beef noodle soup, fried chicken over rice, pork belly over rice, Gua Bao and beef wrap.", "rating": 5, "date": "2018-10-18"}, {"excerpts": ["Recommend the pork belly over rice and the bee pancakes.\n\n"], "author": "PJ T.", "review": "You know they did something right when the Taiwanese chica I was with couldn't stop grinning at all the details of HoDaLa.  The signs, the candy, the music, the chairs brought her back to when she was a girl.  \n\nFood: smallish portions but authentic. Recommend the pork belly over rice and the bee pancakes.\n\nThe service: attentive and quick. Reminded me of Asia and their attentive service. Sometimes asian places can be lacking here. \n\nThe ambience: causal drinking place with elements of Taiwan. Only have beer and wine.\n\nRecommend coming here for lunch walking to grab boba across the street.", "rating": 5, "date": "2018-07-07"}, {"excerpts": ["I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice ", "and they were all great! ", "I would love to try their shaved ice in the future!"], "author": "Elaine G.", "review": "My favorite place to go to with my friends! I tried their fried chicken over rice, fried pork chops over rice, and pork belly over rice and they were all great! I would love to try their shaved ice in the future!", "rating": 5, "date": "2018-08-24"}, {"excerpts": ["The pork belly melts in your mouth and the flavor soaked with the soft bun is such a good combo \n\nBraised pork belly over rice - huge piece of meat on top of the rice, with the meat sauce the rice just taste delicious \n\nBraised beef noodle soup (spicy) "], "author": "Sandy C.", "review": "Went to this place on a Sunday afternoon. They have a online waitlist timer and sign in which is amazing. For two people we waited for 10 minutes, parking was a bit difficult but that's just San Francisco. \nI got seated on the top table which is also very cool. The environment theme is set back to the old times around the 1990s? In Taiwan. I love the mood and environmental.\n\nThe food takes a bit of time to get here but I feel like is worth the wait.\n\nWe had grassjelly milk tea (half sweet and half ice) it's delicious and very milky.\n\nPork belly bun (3) small buns but it has big flavor. The pork belly melts in your mouth and the flavor soaked with the soft bun is such a good combo \n\nBraised pork belly over rice - huge piece of meat on top of the rice, with the meat sauce the rice just taste delicious \n\nBraised beef noodle soup (spicy) - this come in such a big bowl. The broth is very heavy and not oily flavored. I love beef noodle soup and every time I go to any Asian restaurant I always try they beef noodle, this place got the flavor down!!\n\nMy favorite is still the pork belly bun tho, such small bun packed with so much flavor.\n\nDefinitely will come back for more .", "rating": 5, "date": "2018-05-06"}, {"excerpts": ["I ordered the braised beef noodle soup, beef roll, and pork belly over rice! ", "Soooo delicious will definitely come back next time I'm in SF"], "author": "Kristen W.", "review": "Came here for the first time and omg everything was so good! I ordered the braised beef noodle soup, beef roll, and pork belly over rice! Soooo delicious will definitely come back next time I'm in SF", "rating": 5, "date": "2018-08-31"}, {"excerpts": ["The pork belly over rice has a great portion of meat, compared to the little meat for the ground pork over rice.\n\n"], "author": "A L.", "review": "The pork belly over rice has a great portion of meat, compared to the little meat for the ground pork over rice.\n\nI like the service though.", "rating": 3, "date": "2018-07-08"}, {"excerpts": ["I love the rice dishes- pork belly over rice and ground pork over rice are delicious. ", "Their braised beef noodle soup is amazing as well and has JUST the right amount of spice."], "author": "Kelly T.", "review": "I LOVE this place. My favorite dishes are anything with pork belly and the potato leaves with preserved egg. It can get crowded for dinner on weekends so make sure to make a reservation or sign in for your spot online. The interior is cute and well decorated. If you're new get the bao that lets you try one of each. \n\nI love the rice dishes- pork belly over rice and ground pork over rice are delicious. Their braised beef noodle soup is amazing as well and has JUST the right amount of spice.", "rating": 5, "date": "2018-07-30"}, {"excerpts": ["Came here because of the good reviews, left the place disappointed, we got pork belly over rice, ground pork over rice, spicy chicken wings, and mifun.\n", "Pork belly over rice: 2/5, 4 small pieces of pork belly over a lot of rice and veggies, at least put some sauce over the rice. ", "Meat to rice ratio left many rice unfunished.\n", "Ground pork over rice: 4/5, savory saucy and flavorful, the only good dish we got today.\n", "Spicy chicken wings: 3/5, nothing special.\n"], "author": "Jesse Y.", "review": "Came here because of the good reviews, left the place disappointed, we got pork belly over rice, ground pork over rice, spicy chicken wings, and mifun.\nPork belly over rice: 2/5, 4 small pieces of pork belly over a lot of rice and veggies, at least put some sauce over the rice. Meat to rice ratio left many rice unfunished.\nGround pork over rice: 4/5, savory saucy and flavorful, the only good dish we got today.\nSpicy chicken wings: 3/5, nothing special.\nMifun: 1/5, extremely rigid, easy to break apart noodle (frozen, probably) over watery, blend soup with very few companion ingredients, the worst thing we ordered, for the price of 8 dollars we can get a big hot bowl of beefy pho elsewhere.\n\nThe food are easy to make, and most of them are pre-made but it took over 30 to get out food served in a not so busy time. Will not return.", "rating": 2, "date": "2018-03-11"}, {"excerpts": ["We ordered the Braised Beef Noodle Soup (its REALLY good and perfectly flavored), the (3)GuaBao 刮包 with Pork Belly (my brother took a first bite and was surprised at how good it tasted!), and the Pork Belly over Rice (爌肉飯). ", "I had expected that I would like the 爌肉飯 the most, but it was dry (沒有汁) and kind of salty, and since the portions were pretty big, I had the rest to-go ", "so I can finish it at home for a late-night snack. ", "As for what I'd recommend to the menu, I would recommend some of my favorite Taiwanese foods: 肉圓 & 大腸包小腸. Overall, I really like this place ", "and I'd definitely come back! ^^"], "author": "Amy L.", "review": "Its my first time checking out this place with my brother, and its very comfortable sitting here chatting since this place have a nice ambiance. We ordered the Braised Beef Noodle Soup (its REALLY good and perfectly flavored), the (3)GuaBao 刮包 with Pork Belly (my brother took a first bite and was surprised at how good it tasted!), and the Pork Belly over Rice (爌肉飯). I had expected that I would like the 爌肉飯 the most, but it was dry (沒有汁) and kind of salty, and since the portions were pretty big, I had the rest to-go so I can finish it at home for a late-night snack. As for what I'd recommend to the menu, I would recommend some of my favorite Taiwanese foods: 肉圓 & 大腸包小腸. Overall, I really like this place and I'd definitely come back! ^^", "rating": 4, "date": "2018-07-15"}, {"excerpts": ["I like their pork belly over rice.  ", "If u aren't afraid of the fat, you must try it.   ", "And I have to mention the decorations of the restaurant.  ", "The owner must have put a lot of heart and effort in it.  ", "The chairs are cool - old movie theater seats.  ", "They also sell candies and snacks in a old-style way (put them in big glass jars).  ", "If you are from Taiwan or Hong Kong, you'll find them amusing."], "author": "Shirley C.", "review": "I went there twice.  I like the services there.  The waiter is polite and he chatted with us and took our advice/comments nicely.   Foods are good.  I like their pork belly over rice.  If u aren't afraid of the fat, you must try it.   And I have to mention the decorations of the restaurant.  The owner must have put a lot of heart and effort in it.  The chairs are cool - old movie theater seats.  They also sell candies and snacks in a old-style way (put them in big glass jars).  If you are from Taiwan or Hong Kong, you'll find them amusing.", "rating": 5, "date": "2018-04-03"}, {"excerpts": ["rice noodle was good\npork belly over rice was ", "a bit salty\ngua bao was good"], "author": "Diane W.", "review": "rice noodle was good\npork belly over rice was a bit salty\ngua bao was good", "rating": 4, "date": "2018-04-29"}], "soy sauce fried rice": [], "tomato fried rice": [], "sizzling beef": [{"excerpts": ["The steak was a little too well-done for my taste, but probably most Taiwanese sizzling beef is like that, and I had forgotten. ", "I wonder if they could cook it more rare for you if you asked. "], "author": "Julia C.", "review": "Ordered Sizzling Surf & Turf (steak and squid, $21.95) and the Kimchi Pork Belly Gua Bao ($8.95). This was more than enough food for two people. \n\nThe whole squid was delicious. The steak was a little too well-done for my taste, but probably most Taiwanese sizzling beef is like that, and I had forgotten. I wonder if they could cook it more rare for you if you asked. Also, the sauce coating the pasta was quite salty. \n\nThe baos were basically a really large hunk of pork belly and a single piece of kimchi. I would have preferred more kimchi, perhaps some other fillings as well?", "rating": 4, "date": "2018-07-07"}, {"excerpts": ["Loved the Taiwanese pork belly Gua Bao, steam rice cake, sizzling beef and noodle with black pepper and mushroom sauce (a bit too salty), beef noodle soup (a bit too salty), taro mi-fun soup, and friend chicken. \n\n"], "author": "Anya C.", "review": "A good Taiwanese place. Loved the Taiwanese pork belly Gua Bao, steam rice cake, sizzling beef and noodle with black pepper and mushroom sauce (a bit too salty), beef noodle soup (a bit too salty), taro mi-fun soup, and friend chicken. \n\nOthers we liked less were: stir fried preserved eggs with sweet potato leaves because he leaves were too old, winter mellow tea with grass jelly because the jelly is not smooth like what we had in Taiwan, Sapporo beer because it taste old, and rice was dry and not tasty. \n\nKeep the good work! Love the fact there is a good Taiwanese place in town!", "rating": 4, "date": "2018-07-04"}, {"excerpts": ["Sizzling Beef with Black Pepper and Mushroom Sauce - The flavor of this dish was on point! ", "Just like the ones you'd get in a night market. ", "The steak was too tough imo and the noodle was overcooked. "], "author": "Jamie Y.", "review": "I absolutely loved this restaurant. It was very hyped up for me and it definitely lived up to the hype, and this is coming from a Taiwanese girl who's from 626. The restaurant decor is very throwback with a ton of good ol Taiwanese candy, snacks and posters. \n\nI went so ham and ordered 6 things for 3 people. \nStir Fried Preserved Egg with Sweet Potato Leaves - Sweet potato leaves is such a Taiwanese staple vegetable, the preserved egg went really well with it, I'm definitely going to steal this recipe. \nPork Belly Gua Bao - The flavor is on point and the bao was fluffy, delicious and with a sweet aftertaste. The sauce went really well with the peanut crumbs. The pork belly was cooked really well, it was juicy and meaty. \nGrounded Pork over Rice - Another traditional dish that was done very well. The ground pork was juicy and flavorful, it had a mixture of ground mushrooms in it as well so the texture was great. It had enough sauce to make the rice really tasty. It also came with some sour cabbage (my favorite), marinated egg and also pickled radish for garnish and taste. \nFried Pork Chop over Rice - I love how thin the breading of the pork chop was, and how juicy the meat was. The sauce was on point but it made the fried pork chop a bit soggy in the end. Overall was still a great entree especially with the bamboo shoots on the side. \nSizzling Beef with Black Pepper and Mushroom Sauce - The flavor of this dish was on point! Just like the ones you'd get in a night market. The steak was too tough imo and the noodle was overcooked. I'd skip this dish next time.\n\nMy favorite of the meal was the TOMATO BEEF NOODLE SOUP, I was obsessed. It reminded me of my childhood, and I had always been on a search for tomato based bns. This place has done a perfect job, and it had a really nice kick to the broth as well. The beef was also a perfect balance of tendon and meat. \n\nI'd have to come back here again if I'm ever visiting sf!! The service was also friendly and attentive.", "rating": 5, "date": "2018-05-21"}, {"excerpts": ["The restaurant serves up traditional Taiwanese dishes, I had the sizzling beef plate which is beef stew meat served with spicy noodles and a egg served ", "sunny side up.- $14.99\n", "I got a IPA beer - $6.00 which was nice and very cold.\n", "Food is pretty good here and the service is also very good.\n", "I would recommend for Taiwanese cuisine lovers."], "author": "Dirk D.", "review": "This place is on the corner of Geary St. and on the outside it looks like a Taiwanese convenience store. Interesting décor gives the diner the impression that they are walking into a old style Taiwanese store.\nThe restaurant serves up traditional Taiwanese dishes, I had the sizzling beef plate which is beef stew meat served with spicy noodles and a egg served sunny side up.- $14.99\nI got a IPA beer - $6.00 which was nice and very cold.\nFood is pretty good here and the service is also very good.\nI would recommend for Taiwanese cuisine lovers.", "rating": 4, "date": "2018-07-10"}, {"excerpts": ["Soy garlic dipping sauce\n\nSizzling Beef "], "author": "S.K. Y.", "review": "18.02.17.  Soft Opening.   \n                  Raw review rating not final\n\nFood --- 3 1/2 to possible 4 \nService - 5\nSetting - Interesting, industrial, \n                W a little steampunk looking stools\n\nBeef wrapped in scallion pancake (special)\n   Pretty good\n   A little on the small side\n   Low grease ... Barely ... See pic\n   Soy garlic dipping sauce\n\nSizzling Beef w black pepper & mushroom sauce\n   Limited", "rating": 4, "date": "2018-02-17"}, {"excerpts": ["I had the sizzling beef with black pepper and mushroom sauce! ", "I highly recommend it, it was delicious. "], "author": "Casey D.", "review": "I had the sizzling beef with black pepper and mushroom sauce! I highly recommend it, it was delicious. Also have the Taiwan beer! \n\nGreat Taiwanese food!", "rating": 5, "date": "2018-06-30"}, {"excerpts": ["The sizzling beef noodle plate is to die for. ", "Our server Eddy was so nice and attentive. ", "Will definitely come back, love the environment. ", "Also a fan of the lychee beer! ", "Cheers helpers"], "author": "Crystal M.", "review": "The sizzling beef noodle plate is to die for. Our server Eddy was so nice and attentive. Will definitely come back, love the environment. Also a fan of the lychee beer! Cheers helpers", "rating": 5, "date": "2018-07-01"}, {"excerpts": ["The sizzling beef noodle plate is to die for. ", "Our server Eddy was so nice and attentive. ", "Will definitely come back, love the environment. ", "Also, a fan of the Taiwanese Passion Fruit beer! ", "Cheers, yelpers!"], "author": "Adriana C.", "review": "The sizzling beef noodle plate is to die for. Our server Eddy was so nice and attentive. Will definitely come back, love the environment. Also, a fan of the Taiwanese Passion Fruit beer! Cheers, yelpers!", "rating": 5, "date": "2018-07-01"}], "sizzling whole squid": [{"excerpts": ["Noodles were a great texture and perfect firmness and the meat fell apart easily as it should for this dish.\n- Sizzling Whole Squid with Peppered and Mushroom Sauce: Originally I didn't want this because I don't like mushrooms, but the mushroom was just in the sauce and not all over the dish ", "so I could deal. ", "The peppery flavor was very apparent in the noodles and the fried squid was huge! ", "Super flavorful "], "author": "Amanda C.", "review": "Came here with my boyfriend on a Saturday night, and boy were they packed with a line. Little known secret is to make a reservation, as those are first come first served and they have a limited amount they put aside for it. My boyfriend took nearly 45 minutes to find parking, so obviously take public transportation or rideshare to avoid such a waste of time. Luckily, he dropped me off to be seated first and I put in the order while waiting. The space is super small inside, but definitely gave me the Taiwanese restaurant vibe. I think it' mostly due to the decor of the space with candy and other goodies sold at the front and the seating behind the snacks. I started with a peach green tea, since boba tea originated in Taiwan. A bit disappointed that there wasn't boba with the drink. It was a little on the sweeter end versus tasting the actual tea, but it was okay. \n\nStarters:\n- Baked Cheese Corn: this plate came out a lot larger than I expected, but it was good! Cheese was good and the corn was sweet. I would definitely reorder when I return.\n- Beef Wrap: Gave this a try, but was disappointed. The wrap was very dry as a whole and the pieces fell apart so easily that it was not easy to eat. Flavor was also lacking in the wrap, and the meat had a bit of flavor but was super dry. \n\nMain Course:\n- Braised Beef Noodle Soup (spicy): The bowl was fairly large, and had a good kick of spice to it that I could handle. It wasn't overpowering so that you could taste the flavor of the rest of the dish, but a perfect amount for me to taste all the flavors. Noodles were a great texture and perfect firmness and the meat fell apart easily as it should for this dish.\n- Sizzling Whole Squid with Peppered and Mushroom Sauce: Originally I didn't want this because I don't like mushrooms, but the mushroom was just in the sauce and not all over the dish so I could deal. The peppery flavor was very apparent in the noodles and the fried squid was huge! Super flavorful and I couldn't finish the dish - had to take it home and it still was two more meals for me after that from this one dish.\n\nOverall, it was around $50 something to try all those dishes. I want to return to try the baos, but definitely filling entrees and portions.", "rating": 4, "date": "2018-03-31"}], "sizzling meat lover": [{"excerpts": ["After looking on Yelp, I got an order of the pork belly buns and an order of the \"sizzling meat lover\", which looked very good in pictures. "], "author": "Chris S.", "review": "Decent food but not exceptional, but unfortunately what I got was priced well above its quality.\n\nI have to say, looking at the menu made me a little excited, everything sounded really delicious. After looking on Yelp, I got an order of the pork belly buns and an order of the \"sizzling meat lover\", which looked very good in pictures. After eating, however, my overall analysis is that there are better options close by (just head up to Clement and go in almost anywhere - there are so many good and cheap restaurants nearby!)\n\nUnfortunately, the pork belly buns I would have to say were just pretty bland and a little dry; they could really use a little fish sauce or some other kind of sauce to liven them up. \n\nI definitely enjoyed the meat lovers more; the noodles were served with a tasty broth and properly cooked meats. It's not a soup but it's a little more juicy than say an Italian noodle dish. Definitely enjoyable, but still nothing to write home about - it was just good, nothing special. Unfortunately, this was priced at $19.95. (I did notice that price is $1 cheaper in the restaurant vs delivery)\n\nBetween the pricing and lack of anything special, 3 stars felt right. I'm not upset but i am disappointed. You can get better buns for $1.30 each just a few blocks away, or better noodles for less money even cheaper, and that's what you should do. \n\nI did notice there are some items on the menu - especially the cheaper entrees - that were not on uber eats, so perhaps I will stop by in person or get take out to try them sometime.", "rating": 3, "date": "2018-06-16"}], "sizzling surf and turf": [], "fried tangyuan rice ball w peaunt": [], "sesame bao steamed": [], "red bean bao steamed": [], "custard steamed bao steamed": [], "deep fried swirly roll": [], "taro ball shaved ice": [{"excerpts": ["After looking at the menu for a few minutes, we ordered the taro ball shaved ice (substituted mochi instead of boba) a milk tea with grass jelly and we were curious about the Taiwan beer with lychee "], "author": "Stacey Y.", "review": "I wanted some dessert after dinner and HoDaLa was within walking distance from where I was so we decided to give it a try!\n\nIt's a nice spot and it reminds me of Taiwan in some ways. There was no wait and we were seated immediately. After looking at the menu for a few minutes, we ordered the taro ball shaved ice (substituted mochi instead of boba) a milk tea with grass jelly and we were curious about the Taiwan beer with lychee so we went ahead and ordered that as well. \n\nOur order came out relatively quickly. My favorite was the beer with lychee! I'm not a big beer fan, but this was definitely chuggable LOL. The milk tea was standard, nothing too special. The shaved ice was alright, it was too sweet tbh with all the syrup and I wasn't a fan of how hard the ice was. \n\nI'd definitely come back to try their savory foods next time! I'm not too sure if I would order their shaved iced again, but their other sweets look really good as well!", "rating": 4, "date": "2018-09-24"}, {"excerpts": ["I enjoyed the milk tea and taro ball shaved ice "], "author": "Michael L.", "review": "Me and my friend came to get dessert on a Saturday night around 9pm and there was no wait. There is an iPad for you to put your name on the waitlist for when it gets busy. The vibe is Taiwanese with Asian music playing in the background and music videos projected onto a wall. \n\nWe ordered the TW gold medal Beer with lychee, Grass Jelly Milk Tea, and the Taro Ball Shaved Ice(we were able to substitute the boba with Mochi!). The beer came in an interesting glass skull jar and was really refreshing. I enjoyed the milk tea and taro ball shaved ice but my friend thought it was a bit too sweet. \n\nIf I didn't just come from dinner, I would have definitely tried their savory treats. Their steamed buns and rice bowls seem really authentic and promising! They also have Happy Hour Specials and non Taiwanese drinks like Sake, Sangria,and Soju!", "rating": 4, "date": "2018-09-23"}], "grass jelly shaved ice": [{"excerpts": ["Grass jelly shaved ice is a favorite and it would be super cool to see shaved snow getting added to the menu! ", "There's also lots of Asian candies, snacks and trinkets around that you can buy."], "author": "Maggie L.", "review": "Saw this place on yelp after eating lunch and had to try out the desserts! Grass jelly shaved ice is a favorite and it would be super cool to see shaved snow getting added to the menu! There's also lots of Asian candies, snacks and trinkets around that you can buy.", "rating": 5, "date": "2018-10-21"}], "pineapple shaved ice": [{"excerpts": ["*Pineapple shaved ice - was ok, good for sharing \n\n\n"], "author": "Sarah W.", "review": "Love the concept and how unique this place is.\n\nWhat I tried:\n*Taiwanese pork belly buns (3) - worth!\n\n*Scallion pancakes - was ok, little pricy\n\n*Beef tomato noodle soup - noodles were undercooked and too little broth. Maybe if the broth was less thick it would be better\n\n*Whole squid &noodles - worth it. Squid is good but noodles were a little too salty\n\n*Pineapple shaved ice - was ok, good for sharing \n\n\nOverall thoughts:\n*Surprisingly very crowded but on a Friday night. We took the last open table and there was a wait to be seated even when we were leaving. This location has changed restaurants/owners so many times. Looks like they are still trying to establish their menu tho. I hope this one lasts!\n\n*Tables were too close each other it was hard for people to get out without touching the table next to you and get close to them. I like the little island in the middle with seating but it really makes the restaurant cramped. \n\n*What is unique is are the Taiwanese fruit beers and snacks for sale in the middle of the restaurant as if it was a convenience store\n\n*Food ideas are good but some flavors/cooking style could be tweaked.\n\n*Quick service, quick food, loud music and overall good vibes.", "rating": 3, "date": "2018-09-08"}], "lemon aiyu jelly shaved ice": [], "sweet corn shaved ice": []}