{"masala papad": [{"excerpts": ["Badami chicken - beautifully creamy, nutty and mild; lamb vindaloo - tender and plenty spicy, just as it should be; peas pillau - just awesome; masala papad - crispy papad with a great salsa-like topping/dip; and the Naan (we got plain) was perfect and plentiful. ", "I look forward to trying everything else on the menu."], "author": "Susan A.", "review": "I'm happy to give 5 stars! Not only did we have fanastic Indian food speedily delivered to our door (less than 20 mins) but we had access to an efficient support system to help fix a mistake we made in our order. Badami chicken - beautifully creamy, nutty and mild; lamb vindaloo - tender and plenty spicy, just as it should be; peas pillau - just awesome; masala papad - crispy papad with a great salsa-like topping/dip; and the Naan (we got plain) was perfect and plentiful. I look forward to trying everything else on the menu.", "rating": 5, "date": "2014-11-13"}], "aloo tikki": [{"excerpts": ["Their chicken tikka masala is not my favorite in the city, but in addition to the korma, their appetizers such as samosas and aloo tikki are rivaled by none.\n\n"], "author": "Steph L.", "review": "Chicken tikka masala lovers, I highly recommend you change it up a bit and try their chicken korma (I order spicy medium), or even swap out the chicken for paneer. Your eyes will be rolling in the back of your head and this dish will be like a song on repeat for the remainder of your days. I've tried a fair amount of kormas in the city and this has the best balance of creaminess, texture, and tanginess from the tomatoes, plus the chicken is generally never too dry.\n\nTheir chicken tikka masala is not my favorite in the city, but in addition to the korma, their appetizers such as samosas and aloo tikki are rivaled by none.\n\nThis place doesn't get much foot traffic though it has a cute atmosphere. I've ordered delivery a fair amount as well, and neither disappoint.", "rating": 5, "date": "2017-08-28"}, {"excerpts": ["We ordered Aloo Tikki, Paneer Chili & GOBI MANCHURIAN(don't dare to miss this, its da bomb) for appetizer & then went for Chicken tikka masala, Lamb Curry, Malabar Fish Curry(was a new one to my taste, but glad we ordered it) & Chicken Tandoori for our entree with some Basmati rice & good o'll garlic naans. ", "Everything was tasty & spot on. ", "We ate so much that we couldn't even dare to go for dessert.\n", "So ya, go here, try their amazingly tasty foods, rub your tummy with a smile after u r done eating & thank me later if you felt happy like we did for coming in here. ", "CHEERS."], "author": "Jeni S.", "review": "Omg I love this place. It's a gem not to miss if your taste buds are craving in for some authentic Indian cuisine.\nYou get that positive vibe the moment you walk in. It is clean & everything seems to be in order. People here are very comforting & attentive, just the way we like it.\nWe were a group of 4 & we were very hungryyyyy. We ordered Aloo Tikki, Paneer Chili & GOBI MANCHURIAN(don't dare to miss this, its da bomb) for appetizer & then went for Chicken tikka masala, Lamb Curry, Malabar Fish Curry(was a new one to my taste, but glad we ordered it) & Chicken Tandoori for our entree with some Basmati rice & good o'll garlic naans. Everything was tasty & spot on. We ate so much that we couldn't even dare to go for dessert.\nSo ya, go here, try their amazingly tasty foods, rub your tummy with a smile after u r done eating & thank me later if you felt happy like we did for coming in here. CHEERS.", "rating": 5, "date": "2017-01-20"}, {"excerpts": ["Aloo Tikki: super-good!  ", "The deep-fried potato croquettes were just the right size and crispiness, and the tikki sauce it was served with was so flavorful and fragrant in a wonderful way.  "], "author": "Coleen C.", "review": "The best thing about Holy Kitchen is that it's not packed all the time.  The next best thing is the flavor of the food.  Here's what we had on our most recent visit and how we remember it:\n\nAloo Tikki: super-good!  The deep-fried potato croquettes were just the right size and crispiness, and the tikki sauce it was served with was so flavorful and fragrant in a wonderful way.  It doesn't look like much, but you will want to try this appetizer.\n\nFish Curry: generous chunks of white fish served in a chunky tomato sauce.  The tomato sauce is not overwhelming, because it's seasoned so nicely that it's actually quite complex.\n\nSaag Paneer: nothing special about this saag, it's pretty standard and by that I mean a decent staple.  There are huge cubes of homemade paneer floating around the curry, which is a good thing.\n\nLamb Vindaloo:  not the best vindaloo, but very decent, and the medium was spicy enough to make my husband wipe his brow and gulp his water several times.  Even though it was spicy, it was also (purportedly) rich in flavor.\n\nGarlic Naan:  for two people, it was one medium-sized serving that was cut into four little sections.  Not very generous and you'll definitely run out, even if you were metering that naan hardcore.  Also, it's delicious.\n\nNote: Medium spiciness is pretty spicy for most people.  Call ahead and put your name in.\n\nWe'd visit again - highly recommend.  Enjoy!", "rating": 5, "date": "2015-10-25"}, {"excerpts": ["I definitely recommend Aloo Tikki, Peas Pilau, and Lamb Bhuna. "], "author": "B F.", "review": "This is hands down the best Indian food we've gotten for delivery. I definitely recommend Aloo Tikki, Peas Pilau, and Lamb Bhuna. The Chicken Tikka Masala is great, it's not too sweet, and the chicken is nice and moist.\n\nI didn't want to give them 5 stars because I find the naan to be too salty, but other than that the naan is very good. Didn't seem like a good enough reason to hold that back.", "rating": 5, "date": "2014-07-18"}, {"excerpts": ["Loved the Aloo Tikki and Tandoori chicken. ", "My husband has tried both the chicken biryiani and the chicken vindaloo and loved them both. ", "He asked for them 'hot' and they didn't disappoint. ", "We are british and like a spicy, good curry. ", "Holy kitchen is very authentic and ticks all the boxes. ", "Best curry we've had in the 4 years since we moved here. ", "Looking forward to going back. ", "Oh, and the naan bread is outstanding..."], "author": "Jenny G.", "review": "Great restaurant. Dined here twice now and thoroughly enjoyed every dish. Service very attentive and personal. Hard to pinpoint a favorite dish. Loved the Aloo Tikki and Tandoori chicken. My husband has tried both the chicken biryiani and the chicken vindaloo and loved them both. He asked for them 'hot' and they didn't disappoint. We are british and like a spicy, good curry. Holy kitchen is very authentic and ticks all the boxes. Best curry we've had in the 4 years since we moved here. Looking forward to going back. Oh, and the naan bread is outstanding...", "rating": 5, "date": "2014-04-10"}], "papdi chat": [{"excerpts": ["The papdi chat and mattar paneer are particular favorites. \n\n"], "author": "Andrew J.", "review": "Holy Kitchen is great! We live just up the street and it is our go-to for a night in. The portions are generous, prices are completely reasonable, and we have yet to have a bad dish. The papdi chat and mattar paneer are particular favorites. \n\nI've never eaten in the restaurant itself so I can't speak to their table service, but I've always been greeted with a smile and pleasant conversation when I go to pick food up. If you find yourself in Noe Valley, definitely give it a try.", "rating": 5, "date": "2017-07-30"}, {"excerpts": ["Try the Papdi Chat to start. ", "It's like an indian version of nachos (but much better and better for you) with crunchy chips, garbanzo beans, potatoes, yogurt, & chutney. ", "The Chicken Tikka is excellent, the vegetarian dishes are fresh and flavorful and the Biryanis are more than a meal in themselves. ", "Overall the food is not too heavy, like it can be at some Indian places and the staff is very friendly. ", "Looking forward to a long and tasty relationship."], "author": "Josh D.", "review": "Writing this as I sit here eating my leftovers from our second visit to Holy Kitchen the other day. Food is delicious! So nice to have a great Indian restaurant nearby in the heart of Noe Valley (less than a block up the hill from 24th and Castro, still very central) for dining in or take-out/delivery. Portions are generous (still have MORE leftovers leftover) and the flavors are wonderful. Try the Papdi Chat to start. It's like an indian version of nachos (but much better and better for you) with crunchy chips, garbanzo beans, potatoes, yogurt, & chutney. The Chicken Tikka is excellent, the vegetarian dishes are fresh and flavorful and the Biryanis are more than a meal in themselves. Overall the food is not too heavy, like it can be at some Indian places and the staff is very friendly. Looking forward to a long and tasty relationship.", "rating": 5, "date": "2014-04-17"}], "paneer chili": [{"excerpts": ["We ordered Aloo Tikki, Paneer Chili & GOBI MANCHURIAN(don't dare to miss this, its da bomb) for appetizer & then went for Chicken tikka masala, Lamb Curry, Malabar Fish Curry(was a new one to my taste, but glad we ordered it) & Chicken Tandoori for our entree with some Basmati rice & good o'll garlic naans. ", "Everything was tasty & spot on. ", "We ate so much that we couldn't even dare to go for dessert.\n", "So ya, go here, try their amazingly tasty foods, rub your tummy with a smile after u r done eating & thank me later if you felt happy like we did for coming in here. ", "CHEERS."], "author": "Jeni S.", "review": "Omg I love this place. It's a gem not to miss if your taste buds are craving in for some authentic Indian cuisine.\nYou get that positive vibe the moment you walk in. It is clean & everything seems to be in order. People here are very comforting & attentive, just the way we like it.\nWe were a group of 4 & we were very hungryyyyy. We ordered Aloo Tikki, Paneer Chili & GOBI MANCHURIAN(don't dare to miss this, its da bomb) for appetizer & then went for Chicken tikka masala, Lamb Curry, Malabar Fish Curry(was a new one to my taste, but glad we ordered it) & Chicken Tandoori for our entree with some Basmati rice & good o'll garlic naans. Everything was tasty & spot on. We ate so much that we couldn't even dare to go for dessert.\nSo ya, go here, try their amazingly tasty foods, rub your tummy with a smile after u r done eating & thank me later if you felt happy like we did for coming in here. CHEERS.", "rating": 5, "date": "2017-01-20"}], "gobi manchurian": [{"excerpts": ["I found this place after craving for some Gobi Manchurian and this place was the first result on Yelp.\n\n", "I ordered the Gobi Manchurian, chilli chicken and chicken biryani. ", "The Gobi Manchurian was sweet. ", "I've never had sweet Gobi Manchurian ", "so it threw me off right away. ", "The biriyani rice was too oily. ", "The only saving grace was the chilli chicken which I enjoyed and was kinda spicy (good)."], "author": "Ruben M.", "review": "I drove all the way from sunset and was honestly disappointed. I found this place after craving for some Gobi Manchurian and this place was the first result on Yelp.\n\nI ordered the Gobi Manchurian, chilli chicken and chicken biryani. The Gobi Manchurian was sweet. I've never had sweet Gobi Manchurian so it threw me off right away. The biriyani rice was too oily. The only saving grace was the chilli chicken which I enjoyed and was kinda spicy (good).", "rating": 3, "date": "2017-09-15"}, {"excerpts": ["Try the Gobi Manchurian. ", "It is seriously amazing. ", "The butter chicken and the special chicken curry with cashew sauce are stars. ", "Badami, I believe. ", "Chai is great. ", "Their lunch specials are really delicious, huge, and inexpensive."], "author": "Aaron W.", "review": "I love this place. They are friendly, well-priced, great location, and kind. Try the Gobi Manchurian. It is seriously amazing. The butter chicken and the special chicken curry with cashew sauce are stars. Badami, I believe. Chai is great. Their lunch specials are really delicious, huge, and inexpensive.", "rating": 5, "date": "2016-12-20"}, {"excerpts": ["Ordered Papdi Chaat, Corn Chaat and Gobi Manchurian to start with. ", "Papdi Chaat was decent, Corn Chaat was pretty bland and the Gobi Manchurian was oh so crispy and delicious. ", "It was a little sweet and might not be to everyone's liking. "], "author": "Vinay R.", "review": "Went there on a Thursday night. The place has an interesting ambience and friendly staff. Ordered Papdi Chaat, Corn Chaat and Gobi Manchurian to start with. Papdi Chaat was decent, Corn Chaat was pretty bland and the Gobi Manchurian was oh so crispy and delicious. It was a little sweet and might not be to everyone's liking. So make sure to mention you would prefer it to be spicy if that's your thing.\n\nTo finish ordered the Vegetable biryani, I asked for medium spicy level and my mouth was on fire 5 minutes in. So choose your spice level carefully. Stuff noticed my obvious discomfort and offered to give me a milder version (which tasted awesome). \n\nWould definitely visit again", "rating": 4, "date": "2015-11-06"}, {"excerpts": ["Last visit, we had the Gobi Manchurian to start. ", "Then the Badamiu Chicken dish and the vegetarian Saag Paneer. ", "The staff is very pleasant. ", "The owner came and talked with us to see how we liked the meal. ", "We hope it does well although lacking the essential lunch-hour business due to location. ", "Great place for a private meal or to bring out of town guests."], "author": "Philip G.", "review": "We really like this restaurant. Great selection of tasty food. Last visit, we had the Gobi Manchurian to start. Then the Badamiu Chicken dish and the vegetarian Saag Paneer. The staff is very pleasant. The owner came and talked with us to see how we liked the meal. We hope it does well although lacking the essential lunch-hour business due to location. Great place for a private meal or to bring out of town guests.", "rating": 5, "date": "2016-02-02"}, {"excerpts": ["The Gobi Manchurian (batter dipped cauliflower with a sweet/spicy sauce) appetizer was amazing & Onion Kulcha was fresh with tons of onions. ", "The good/bad news is that they also deliver. ", "Dangerous, but good."], "author": "Bobbi L.", "review": "We stopped into Holy Kitchen a week or so ago just looking for something different for dinner.  We were totally surprised how good the food was. The Gobi Manchurian (batter dipped cauliflower with a sweet/spicy sauce) appetizer was amazing & Onion Kulcha was fresh with tons of onions. The good/bad news is that they also deliver. Dangerous, but good.", "rating": 5, "date": "2016-05-09"}, {"excerpts": ["We had a nice dinner of Gobi Manchurian, Corn Chaat, Lamb Tikka Masala, Saag Paneer and a mango lassi. ", "The lassi was one of the best that I ever had. ", "The \"mild\" versions of the food were ho-hum. ", "I will try again, but at a spicier level. "], "author": "Benjamin T.", "review": "We had a nice dinner of Gobi Manchurian, Corn Chaat, Lamb Tikka Masala, Saag Paneer and a mango lassi. The lassi was one of the best that I ever had. The \"mild\" versions of the food were ho-hum. I will try again, but at a spicier level. Hopefully that will make me love them as other reviews do. \n\nWe got in at 6:30 on a Thursday and were easily seated. The staff took extra care with our daughter who was surprisingly timid with them. So if you have kids, this is a good place to go.", "rating": 3, "date": "2014-08-07"}, {"excerpts": ["Was searching for some good Gobi Manchurian tonight and landed at this gem. ", "Very clean and inviting ambiance, good food and friendly service. ", "They kept my 1 1/2 year old entertained is what compels me to give them a 5 star review (We usually do to-go's as it is tough to get our kiddo to cooperate with eating in). ", "All the servers engaged warmly with my daughter. ", "We ordered Paneer Shaslik (mild spicy), Gobi Manchurian and some kulchas..", "It was correctly spiced, and was not reeking with oil (as is the case with many Indian restaurants we've eaten at). ", "Also its one of the low priced restaurants for the area. ", "Would love to come back again. ", "Thanks for a great dinner!"], "author": "Sreejitha V.", "review": "Was searching for some good Gobi Manchurian tonight and landed at this gem. Very clean and inviting ambiance, good food and friendly service. They kept my 1 1/2 year old entertained is what compels me to give them a 5 star review (We usually do to-go's as it is tough to get our kiddo to cooperate with eating in). All the servers engaged warmly with my daughter. We ordered Paneer Shaslik (mild spicy), Gobi Manchurian and some kulchas..It was correctly spiced, and was not reeking with oil (as is the case with many Indian restaurants we've eaten at). Also its one of the low priced restaurants for the area. Would love to come back again. Thanks for a great dinner!", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["We had the Gobi Manchurian as an appetizer to start, and it was fantastic!  "], "author": "Terri L.", "review": "Great staff!  Very attentive and excellent service for a Saturday night.  And such delicious food! We had the Gobi Manchurian as an appetizer to start, and it was fantastic!  The Lamb Saag and Chicken Tandoori were also excellent.  A wonderful, relaxing way to enjoy a meal on a Saturday evening.  Give them a try! :)", "rating": 5, "date": "2014-06-21"}, {"excerpts": ["Really enjoyed the gobi manchurian."], "author": "Roshni J.", "review": "Went there on a Saturday night - seated right away and had great service. The portion sizes are very generous and the food was great- everyone leaves with leftovers. Really enjoyed the gobi manchurian.", "rating": 4, "date": "2014-09-29"}], "tangdi kabab": [{"excerpts": ["I ordered the Butter Chicken for my husband, Tangdi Kabab for my 10-year old son, and Chana Masala for myself.  ", "My husband said the Butter Chicken was really good and that I was awesome to order it - 5 stars to the Butter Chicken of Love, lol.  ", "The chicken drumstick dish I ordered for my son was seasoned just right - not too spicy, yet tasty, which is perfect for my picky 10-year old son.  ", "I recently became a pescatarian and the Chana Masala was an excellent choice for me - super satisfying.  ", "Will definitely order from HK again when I'm too lazy to get to the restaurant!"], "author": "michele g.", "review": "Ordered delivery via Yelp and food was delivered on-time, organized neatly in the bag and labelled clearly.  The food was excellent!  I've been in the restaurant before and enjoyed the meal - the restaurant is clean, service is attentive and food was delicious.  I've been tried many Indian restaurants in SF, and HK is one of the best.  The delivery service was definitely on par to the in-restaurant dining experience.  I ordered the Butter Chicken for my husband, Tangdi Kabab for my 10-year old son, and Chana Masala for myself.  My husband said the Butter Chicken was really good and that I was awesome to order it - 5 stars to the Butter Chicken of Love, lol.  The chicken drumstick dish I ordered for my son was seasoned just right - not too spicy, yet tasty, which is perfect for my picky 10-year old son.  I recently became a pescatarian and the Chana Masala was an excellent choice for me - super satisfying.  Will definitely order from HK again when I'm too lazy to get to the restaurant!", "rating": 5, "date": "2018-10-06"}, {"excerpts": ["On the appetizer side I love their chats (both papdi and aloo) and Tangdi Kabab.  ", "The chats are an explosion of flavors while the Kabab is very tender.  "], "author": "Jyotshna K.", "review": "If you love Indian food, you have to Holy Kitchen it! After unsuccessfully looking a nice Indian restaurant that delivers in Bernal Heights, we discovered Holy Kitchen.  And are we happy we did! \n\nFood here is amazing - fresh, flavorful and overall delicious.  I have dined in and ordered in multiple times from here and have never been disappointed.  The food tastes very authentic and more than anything else, it is flavorful.  With each scoop of Lamb Masala, you appreciate the effort taken to make the complex flavors in the dish.  \n\nOn the appetizer side I love their chats (both papdi and aloo) and Tangdi Kabab.  The chats are an explosion of flavors while the Kabab is very tender.  On the curries side, I love the Lamb Tikka Masala, Fish Curry (one of my all time favs) and Bengan Bharta.\n\nThe servings here are very generous, the staff is friendly and ambiance is laid-back.  A perfect place to eat some tasty morsels and drink some chai as you chat with friends and family!", "rating": 5, "date": "2014-12-21"}], "aloo chat": [], "corn chat salad": [{"excerpts": ["We ordered curry of which there are many kinds, the corn chat salad, mango lassis and garlic naan. ", "Oh my. ", "So delicious. ", "The feeling in the restaurant is kind and the music was sublime. ", "We'll be back!"], "author": "Robert K.", "review": "First time here on a whim driving down 24th St. and found this restaurant open New Years Eve. Wonderful!  We ordered curry of which there are many kinds, the corn chat salad, mango lassis and garlic naan. Oh my. So delicious. The feeling in the restaurant is kind and the music was sublime. We'll be back!", "rating": 5, "date": "2017-12-31"}], "vegetables soup": [], "chicken tandoori": [{"excerpts": ["We ordered samosas, chicken tikka masala, saag paneer, chicken tandoori, garlic naan, and rice. "], "author": "PK R.", "review": "I've always ordered delivery from this place!\n\nMy boyfriend was in town for the holidays and so I decided that we should give it a try and dine-in.\n\nWe ordered samosas, chicken tikka masala, saag paneer, chicken tandoori, garlic naan, and rice. Everything we ordered was pretty damn good.\n\nIf you order in, order pickup or delivery. The food is still good!\n\nI suggest giving this place a try, if you haven't already.", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["We ordered Aloo Tikki, Paneer Chili & GOBI MANCHURIAN(don't dare to miss this, its da bomb) for appetizer & then went for Chicken tikka masala, Lamb Curry, Malabar Fish Curry(was a new one to my taste, but glad we ordered it) & Chicken Tandoori for our entree with some Basmati rice & good o'll garlic naans. ", "Everything was tasty & spot on. ", "We ate so much that we couldn't even dare to go for dessert.\n", "So ya, go here, try their amazingly tasty foods, rub your tummy with a smile after u r done eating & thank me later if you felt happy like we did for coming in here. ", "CHEERS."], "author": "Jeni S.", "review": "Omg I love this place. It's a gem not to miss if your taste buds are craving in for some authentic Indian cuisine.\nYou get that positive vibe the moment you walk in. It is clean & everything seems to be in order. People here are very comforting & attentive, just the way we like it.\nWe were a group of 4 & we were very hungryyyyy. We ordered Aloo Tikki, Paneer Chili & GOBI MANCHURIAN(don't dare to miss this, its da bomb) for appetizer & then went for Chicken tikka masala, Lamb Curry, Malabar Fish Curry(was a new one to my taste, but glad we ordered it) & Chicken Tandoori for our entree with some Basmati rice & good o'll garlic naans. Everything was tasty & spot on. We ate so much that we couldn't even dare to go for dessert.\nSo ya, go here, try their amazingly tasty foods, rub your tummy with a smile after u r done eating & thank me later if you felt happy like we did for coming in here. CHEERS.", "rating": 5, "date": "2017-01-20"}, {"excerpts": ["I recommend the Chicken Tandoori served hot on a skittle and the Lamp Chops are TDF. ", "( To Die For) Take out and open for lunch a plus."], "author": "Dani S.", "review": "Consistently good. This little gem located in Noe Valley is such a great fit! I recommend the Chicken Tandoori served hot on a skittle and the Lamp Chops are TDF. ( To Die For) Take out and open for lunch a plus.", "rating": 5, "date": "2014-04-05"}, {"excerpts": ["The Lamb Saag and Chicken Tandoori were also excellent.  ", "A wonderful, relaxing way to enjoy a meal on a Saturday evening.  ", "Give them a try! ", ":)"], "author": "Terri L.", "review": "Great staff!  Very attentive and excellent service for a Saturday night.  And such delicious food! We had the Gobi Manchurian as an appetizer to start, and it was fantastic!  The Lamb Saag and Chicken Tandoori were also excellent.  A wonderful, relaxing way to enjoy a meal on a Saturday evening.  Give them a try! :)", "rating": 5, "date": "2014-06-21"}], "lamb chop": [], "lamb seeikh kabab": [], "shrimp tandoori": [], "paneer shashlyk": [], "chicken rezala": [{"excerpts": ["The chicken rezala is super tasty and I love to dip my naan in it.  ", "So is the chana masala and lamb vindaloo.  ", "The fish curry was also quite nice - they used salmon, which was a little weird, but I also liked that I didn't feel as though I was eating mystery fish.  "], "author": "Tay H.", "review": "I've only ever eaten Holy Kitchen vis-à-vis delivery, but it has quickly become my favorite Indian food in SF. \n\nDelivery so far has been a breeze - you can order from Holy Kitchen through Seamless until 8:45pm (no fee), Uber Eats until 9:00pm (fee, don't recall what), and Door Dash until 9:15pm ($4.95 fee).  They typically quote a delivery time of about 45-60 minutes, but I've never waited longer than half an hour.  And, my food always arrives piping hot.  Maybe even uncomfortably so.  A++\n\nThe food is awesome and incredibly flavorful.  It's never oversalted or overcooked or gummy or fatty or any of the other bad adjectives that you could use to describe food.  The garlic naan is awesome and always arrives warm and soft.  I've never actually had garlic naan that's so tasty - I normally feel like it barely tastes of garlic, but this is like woah (without being gross or leaving you feeling like you could ward off vampires).  The chicken rezala is super tasty and I love to dip my naan in it.  So is the chana masala and lamb vindaloo.  The fish curry was also quite nice - they used salmon, which was a little weird, but I also liked that I didn't feel as though I was eating mystery fish.  The only thing I haven't loved was the chicken soup - it's just chicken, peas, and broth...and it tastes really overwhelmingly of peas.\n\nPlease note that this place doesn't provide rice for free with its entrees.  You have to order it on the side, or order naan and use that instead (which is what I do).\n\nI'll definitely be ordering this on the regular!", "rating": 4, "date": "2016-05-06"}], "badami chicken": [{"excerpts": ["We got the garlic naan, chicken tikka masala, badami chicken, and of course a side of white rice. ", "Everything was cooked to perfection. ", "Honestly, the chicken fell apart on the plate when we cut into the pieces. ", "We have never tried or heard of the badami chicken before. ", "It was very tasty. "], "author": "Suthida K.", "review": "O. M. G. The garlic naan! If you visit this place you'll have to get it. \n\nMy friend and I are in SF for a weekend and we tried this place for dinner. We got the garlic naan, chicken tikka masala, badami chicken, and of course a side of white rice. Everything was cooked to perfection. Honestly, the chicken fell apart on the plate when we cut into the pieces. We have never tried or heard of the badami chicken before. It was very tasty. Let just say I'm excited for the left over. \n\nThe service was super sweet but a tad bit slow. Maybe they are just really relaxed there?", "rating": 4, "date": "2018-03-23"}, {"excerpts": ["the badami chicken--this has become my favorite. ", "Highly advised."], "author": "Ted M.", "review": "Excellent!  I haven't seen any reviews mention the badami chicken--this has become my favorite. Highly advised.", "rating": 5, "date": "2018-10-12"}, {"excerpts": ["I decided to get the Badami Chicken based on a review here, as well as the Butter Chicken. ", "As other reviewers noted, the Butter Chicken is a bit more tomato-y than some places, but it is soooo savory and delicious. ", "The Badami chicken is also mouth-watering, and really creamy yellowy chicken dish where the spices are more subtle than many Indian dishes. "], "author": "Chris S.", "review": "Very solid Indian food. I decided to get the Badami Chicken based on a review here, as well as the Butter Chicken. As other reviewers noted, the Butter Chicken is a bit more tomato-y than some places, but it is soooo savory and delicious. The Badami chicken is also mouth-watering, and really creamy yellowy chicken dish where the spices are more subtle than many Indian dishes. I'm used to Indian flavors smacking me upside the head, and while I also love that, this was a great experience with something a little more benign. \n\nI'll gladly order again, but not /all the time/ due to prices.\n\nThe super delicious food would earn them 5 stars, but by the time you add naan and rice, you're over $20 for dinner...it caused my eyebrows to raise, especially for the neighborhood it's in, though the portions are at least hearty.", "rating": 4, "date": "2016-02-13"}, {"excerpts": ["We adventured to the Badami Chicken, with cashew and pistachio paste, and the delicious Peas Pilau rice. ", "Awesome! ", "We can't wait to be back!"], "author": "Augusto O.", "review": "Me and my partner have been coming to Holy Kitchen after being charmed by their delicious food and flavors! All their dishes seemed delicious but we decided to try something different out of their Chicken Tikka Masala dish we would usually have. We adventured to the Badami Chicken, with cashew and pistachio paste, and the delicious Peas Pilau rice. Awesome! We can't wait to be back!", "rating": 5, "date": "2018-01-26"}, {"excerpts": ["We're particularly fond of the Badami Chicken, a nutty, creamy curry, and the Peas Pilau, a rice dish with nuts and onions. ", "The Chicken Tikka Masala is a bit tomoato-y for my taste, but my daughter and sister-in-law love it. ", "My mom is a huge fan of the Chicken Vindaloo. ", "The Eggplant Bharta is a family favorite. ", "My husband must have the Corn Chat and Chana Masala. ", "We always get the Saag Paneer as well, and have enjoyed the Malabar Fish Curry a few times (it's a creamy coconut sauce similar to the Badami but less nutty). "], "author": "Gail C.", "review": "Hands-down the best Indian food this non-Indian gal has found in SF at a reasonable price point. Most everything tastes amazing, and I list particularly spectacular dishes below. The restaurant is clean, with a light happy atmosphere (think yellow walls and soft Indian music). Some reviews criticize the ambiance because the restaurant is empty, but as far as we can tell the only reason it's occasionally empty are reviews like those! \n\nThe staff are wonderfully accommodating, efficient, and polite. Everyone we take there raves about the food. For us though, the restaurant's kid-friendly nature is the real winner. They love having kids in the restaurant, don't mind when they get the tablecloths dirty, make mild dishes truly mild, have a centrally located and easy to monitor bathroom, offer more than enough highchairs, and don't bat an eyelash when you have to run when the wheels suddenly come off (they grab the check and pack all the leftovers in a snap). Our kids dine here regularly and with no stress. \n\nAs for food, all the chicken dishes we've had were made with large chunks of carefully trimmed breast meat, never gristle. We're particularly fond of the Badami Chicken, a nutty, creamy curry, and the Peas Pilau, a rice dish with nuts and onions. The Chicken Tikka Masala is a bit tomoato-y for my taste, but my daughter and sister-in-law love it. My mom is a huge fan of the Chicken Vindaloo. The Eggplant Bharta is a family favorite. My husband must have the Corn Chat and Chana Masala. We always get the Saag Paneer as well, and have enjoyed the Malabar Fish Curry a few times (it's a creamy coconut sauce similar to the Badami but less nutty). Just writing about it all is making my mouth water. \n\nSummary: delicious and kid-friendly without losing it's ambiance.", "rating": 5, "date": "2015-12-23"}, {"excerpts": ["Be sure to try the dishes you won't get elsewhere, like the lamb Achari, lamb Rezala, Badami chicken, and the two fish curries. ", "The standards like the okra, eggplant, butter chicken, and lamb rogan josh are also excellent. ", "The vindaloo also has a distinctive taste that I much prefer over the version common elsewhere."], "author": "Galen G.", "review": "The more I come here, the more I love it. The best Indian food in the City, no doubt. Be sure to try the dishes you won't get elsewhere, like the lamb Achari, lamb Rezala, Badami chicken, and the two fish curries. The standards like the okra, eggplant, butter chicken, and lamb rogan josh are also excellent. The vindaloo also has a distinctive taste that I much prefer over the version common elsewhere.", "rating": 5, "date": "2016-06-04"}, {"excerpts": ["Badami chicken - beautifully creamy, nutty and mild; lamb vindaloo - tender and plenty spicy, just as it should be; peas pillau - just awesome; masala papad - crispy papad with a great salsa-like topping/dip; and the Naan (we got plain) was perfect and plentiful. ", "I look forward to trying everything else on the menu."], "author": "Susan A.", "review": "I'm happy to give 5 stars! Not only did we have fanastic Indian food speedily delivered to our door (less than 20 mins) but we had access to an efficient support system to help fix a mistake we made in our order. Badami chicken - beautifully creamy, nutty and mild; lamb vindaloo - tender and plenty spicy, just as it should be; peas pillau - just awesome; masala papad - crispy papad with a great salsa-like topping/dip; and the Naan (we got plain) was perfect and plentiful. I look forward to trying everything else on the menu.", "rating": 5, "date": "2014-11-13"}], "bhuna lamb": [], "lamb achari": [{"excerpts": ["The lamb achari is delicious and the garlic naan is wonderful. ", "Prices are reasonable and the portions are large. ", "I'd highly recommend Holy Kitchen ", "- it's a great Noe Valley gem."], "author": "Stuart B.", "review": "I love ordering food from this place. Some of the best Indian food I've had in the city, and the service is great as well. The staff is always very friendly and attentive. The lamb achari is delicious and the garlic naan is wonderful. Prices are reasonable and the portions are large. I'd highly recommend Holy Kitchen - it's a great Noe Valley gem.", "rating": 5, "date": "2018-01-16"}, {"excerpts": ["I also really like their chana masala and lamb achari. ", "And unlike a lot of delivery places, they're consistent--"], "author": "Jeff W.", "review": "I've tried a bunch of different options for Indian delivery in SF, and Holy Kitchen is by far the best I've found. Their chicken tikka masala may be the tastiest I've had in SF. I also really like their chana masala and lamb achari. And unlike a lot of delivery places, they're consistent--if you liked something the last time you had it, you'll probably like it next time, too.\n\nAlso, Holy Kitchen's naan is unusually flavorful. They charge a bit more than I'd like for rice, but they do at least give you a generous portion.\n\nOn top of all that, they deliver at the speed of light, and their delivery people are very courteous. One time I was accidentally given the wrong order, but the folks at Holy Kitchen practically scrambled fighter jets and sent out the National Guard to fix things as quickly as possible.\n\nIf you're looking for tasty Indian food, give Holy Kitchen a try.", "rating": 5, "date": "2017-10-23"}, {"excerpts": ["Lamb achari, chicken curry, & basmati rice for the mains.  ", "The lamb achari was our favorite dish; the sauce was fragrant & delicious.  ", "We asked for spicy, & this delivered.  ", "The heat wasn't overbearing, but made its presence known.  ", "Only, I wasn't wowed by the flavor of the meat.  ", "Good lamb shouldn't taste gamey.  "], "author": "Veronica M.", "review": "Disclaimer: \nI'm Indian.\n\nWhile I consider myself culinarily fortunate to have grown up w homemade roti, puri, dal, & a rotation of lamb, chicken, salmon, & crab curries (I refused to eat goat, mutton, pigeon, spinach, & most other vegetables.  You know kids).  And forget about samosas & the desserts my grandmother used to make for me.  I was thoroughly spoiled.  \n\nIt naturally makes it difficult for me to eat in Indian restaurants.\n\nBut on a sleepy stay at home night, I wanted Indian, & I wanted delivery, & Holy Kitchen looked promising.\n\nSince this was my first experience w them, & my man has had limited exposure to Indian food, I was conservative & went w staples.\n\nSamosas to start.  Lamb achari, chicken curry, & basmati rice for the mains.  And garlic naan for our bread group.\n\nThe samosas were enormous.  They were tasty enough.  But bigger isn't always better.\n\nThe lamb achari was our favorite dish; the sauce was fragrant & delicious.  We asked for spicy, & this delivered.  The heat wasn't overbearing, but made its presence known.  Only, I wasn't wowed by the flavor of the meat.  Good lamb shouldn't taste gamey.  Ever.  \n\nHaving read & seen that their butter chicken is too tomatoey (it shouldn't be, plus, my heart belongs to Amber India for butter chicken), I went w the chicken curry instead.  One of my favorite dishes, I think you can measure how good an Indian restaurant is by how good their chicken curry is.  Indian curry is not like Thai or Japanese curry.  This was disappointing.  Very mediocre.  Pass.\n\nDisclaimer:\nYou shouldn't order chicken curry when you make a kick-ass version yourself...& so does your mom.\n\nThe garlic naan...\nIt had a good degree of garlic & it did satisfy the garlic craving.  But it was on the thick & doughy side.  Naan is not supposed to be focaccia.\n\nThe basmati rice was great.  Cooked to perfection.\n\nThe mango lassi was not bad.  A touch tart, but not bad (again, Amber India makes a great one).  They do a house \"lemon water,\" aka lemonade.  My man loved it.\n\nOverall, not bad.  Props for not being oily, & for delivering in an hour, as promised.\n\nYes, I'm picky.  But there are so many better options in SF for Indian.  \n\n3 stars.", "rating": 3, "date": "2015-08-09"}, {"excerpts": ["Hot fluffy naan dipped into spicy Lamb Achari with pickled spices is my new favorite delivery treat.\n\n"], "author": "Jessica T.", "review": "Hot fluffy naan dipped into spicy Lamb Achari with pickled spices is my new favorite delivery treat.\n\nI haven't eaten Indian food in a long while, but when some friends decided to splurge on some Holy Kitchen - I was intrigued. Each of my friends' dishes smelled amazing, the portions were generous, and the food wasn't swimming in grease.\n\nAnd so - the other day when I was craving something hearty - I ordered Holy Kitchen.\n\nThe Achari sauce was bursting with flavor, the lamb was perfectly cooked, and the naan was absolutely dreamy. Even their basmati rice was phenomenal.\n\nIf you're looking for some quality Indian food in the city - look no further than Holy Kitchen. You can tell that they're intent on having repeat customers  - in the way they package their orders, as well as the quality ingredients that they use.\n\nTrust.", "rating": 5, "date": "2015-04-17"}, {"excerpts": ["One of our favorite things to order is the Lamb Achari (lamb with pickling spices), which was heart and well seasoned. ", "We also enjoyed the Bengan Bharta (roasted eggplant), though it needs to be balanced out with other dishes that have more texture as it itself is pretty mushy."], "author": "Ali S.", "review": "This place is solid--great value, a diverse menu, friendly service, and best of all NO HASSLE! Holy Kitchen a great pick for those Friday or Saturday nights when we wait until the last minute to decide to go out to eat. \n\nThe food is hearty and the portions are pretty substantial. My husband and I usually order naan and two entrees, and each time we've ended up with a doggie bag for leftovers.\n\nI also like how they bring out a complimentary serving of pappadum and chutneys at the beginning of the meal.\n\nOne of our favorite things to order is the Lamb Achari (lamb with pickling spices), which was heart and well seasoned. We also enjoyed the Bengan Bharta (roasted eggplant), though it needs to be balanced out with other dishes that have more texture as it itself is pretty mushy.", "rating": 4, "date": "2015-06-07"}, {"excerpts": ["Recommend the Lamb Achari and the chicken tikka.  ", "Only thing that let it down was the Tandoori Roti."], "author": "Rajash S.", "review": "Surprisingly good! Authentic tasting and some complex flavors.  Recommend the Lamb Achari and the chicken tikka.  Only thing that let it down was the Tandoori Roti.", "rating": 5, "date": "2015-12-15"}, {"excerpts": ["I got the chicken tikka masala, lamb achari, samosas, and mango lassi. ", "Everything was good but the lamb was my favorite. ", "Delivery came earlier than the estimated time."], "author": "Maya E.", "review": "Ordered delivery and had a great experience. I've been looking for a good Indian restaurant to get delivery from for the past few months and Holy Kitchen has been the best so far. I got the chicken tikka masala, lamb achari, samosas, and mango lassi. Everything was good but the lamb was my favorite. Delivery came earlier than the estimated time.", "rating": 5, "date": "2016-12-22"}, {"excerpts": ["Be sure to try the dishes you won't get elsewhere, like the lamb Achari, lamb Rezala, Badami chicken, and the two fish curries. ", "The standards like the okra, eggplant, butter chicken, and lamb rogan josh are also excellent. ", "The vindaloo also has a distinctive taste that I much prefer over the version common elsewhere."], "author": "Galen G.", "review": "The more I come here, the more I love it. The best Indian food in the City, no doubt. Be sure to try the dishes you won't get elsewhere, like the lamb Achari, lamb Rezala, Badami chicken, and the two fish curries. The standards like the okra, eggplant, butter chicken, and lamb rogan josh are also excellent. The vindaloo also has a distinctive taste that I much prefer over the version common elsewhere.", "rating": 5, "date": "2016-06-04"}], "shrimp malai curry": [], "shrimp do piazza": [], "shrimp korma": [{"excerpts": ["After looking over the easy to read but difficult to decide menu, we ordered Lamb Curry, Lamb Tikka, Shrimp Korma and Bengan Bharta, as well as two orders of naan, and white & brown basmati rice, and waited.\n\n", "As I haven't had korma in a long time, I was thrilled to see shrimp korma, and the sauce was creamy and flavorful. ", "The two lamb dishes were also great, but were pretty close in flavor. "], "author": "Michael C.", "review": "Get take out.\n\nWe arrived on a Sunday night, and the place did have a crowd, but fortunately no wait for a seat. Nor was there a wait for service. But there was a wait for our food.\n\nEven with my vegetarian friend, we decided to go family style and order a bunch of dishes for the table. Granted we mostly ate our own dish, but there was sharing.\n\nAfter looking over the easy to read but difficult to decide menu, we ordered Lamb Curry, Lamb Tikka, Shrimp Korma and Bengan Bharta, as well as two orders of naan, and white & brown basmati rice, and waited.\n\nAnd we waited.\n\nAnd then we realized why: the staff was bringing out huge bags (at least 4 containers) of food for take out. And not just one order this way, at least 4. So this is why I recommend take out.\n\nWhile we waited, we did get complimentary papadum for the table, which was nice and the sauces were good, and the staff was keeping us updated during the wait - they were incredibly nice.\n\nThe food all came out at the same time, and I would say it was solid Indian food. As I haven't had korma in a long time, I was thrilled to see shrimp korma, and the sauce was creamy and flavorful. The two lamb dishes were also great, but were pretty close in flavor. And the eggplant was decent. \n\nEveryone enjoyed their dishes, but I wouldn't say this is the best Indian I've had in the bay area. But if you were in Noe Valley or Castro Valley and craving Indian, I would recommend this place. Just be aware of wait times before coming - I would first ask how many take out orders have been placed before sitting to get an idea.", "rating": 3, "date": "2014-11-12"}], "daal tadka": [{"excerpts": ["Daal tadka - mediocre \n5) "], "author": "Barnali D.", "review": "We ordered delivery from here, and frankly, were not impressed.  The food was average, the delivery (via Yelp) came a few minutes before the ETA (nice), but the delivery person left quickly without taking payment (which necessitated a call to the restaurant).\n\nWe ordered the following dishes and were not wowed by any of them:\n\n1) Chicken biriyani - disappointing - the chicken was a bit dry, and the dish had too much going on (too many cashews, for example)\n2) Lamb saag - ok, nothing special\n3) Okra - ok\n4) Daal tadka - mediocre \n5) Naan - ok\n\nThe delivery came a bit early, which was great, but the delivery person hurried away as my husband went to grab his wallet to pay cash (as we'd specified on our order).  We then had to call the restaurant to give them our credit card info to make sure they got paid, which was a slightly irritating added step.\n\nOverall, we were underwhelmed and will not be hurrying back.", "rating": 3, "date": "2018-03-01"}, {"excerpts": ["The Daal Tadka was so healthy and had great flavor (got it mild for the kids). ", "My husband loves anything spicy with cauliflower so the Aloo Gobi was perfect for him. "], "author": "Regina S.", "review": "Holy Kitchen has great veggie options and delivers to Bernal Heights!\n\nWe are vegetarian and live in Bernal, a bit of a no-persons-land for food delivery. It's so rare to find a place outside of Bernal that delivers, let alone good vegetarian food. Holy Kitchen fit the bill.\n\nMy picky eaters devoured the samosas. The naan was yummy. The Daal Tadka was so healthy and had great flavor (got it mild for the kids). My husband loves anything spicy with cauliflower so the Aloo Gobi was perfect for him. I got the Sahi Paneer and it was delish. I ended up feeding a little bowl to my 8 month old (no teeth) and she devoured it. Her first Indian food! I was a little nervous at first. But she slept blissfully the whole night. :)\n\nYou must get their mango chutney and raita. I put them on a little of everything we ordered. Not sure if that's traditional or allowed but I loved it. \n\nI didn't have to cook and this order fed a family of 5 for $55. There were some leftovers for lunch the next day. That's pretty darn awesome.", "rating": 4, "date": "2015-03-12"}], "vegetable malai kofta": [], "sahi paneer": [{"excerpts": ["Ordered the following:\n\nSahi Paneer - cheese & cashews in creamy sauce - this was a newish dish for us but have to say it tasted almost the same as the other items we'd selected - not that that's a bad thing!\n\n"], "author": "Adrienne G.", "review": "Holy Kitchen has been on my list of new ( to me ) Indian places to try & we are ever-seeking our takeout nirvana.  Ordered the following:\n\nSahi Paneer - cheese & cashews in creamy sauce - this was a newish dish for us but have to say it tasted almost the same as the other items we'd selected - not that that's a bad thing!\n\nMattar Paneer - this is 1 of Sis' go-to items & she was happily pleased with the creamy cheese cubes & peas\n\nMali Kofta - these dumplings were definitely homemade & still had whole spice pods in the mix\n\nVegetable Korma - veggies in a creamy tomato sauce - again the flavors were very similar to what we'd ordered above.....maybe it's b/c all the dishes we'd ordered said some version of \"creamy sauce\"??\n\nAlso to note: we'd asked for super spicy but there was barely any heat - lots of flavor but barely any heat.  Maybe next time we'll ask for \"Indian spicy\" or something to convey we do not want the \"American\" version of spicy - we actually mean bring on the heat!\n\nSamosa - the veggies were smashed together like maybe they'd been fried for too long & the outer shell almost tasted a little like chicken - although don't hold me to that\n\nMango Lassi - incredibly creamy & flavorful!\n\nSo have to say this was a good start for us & we'd come back & that has to make us fans", "rating": 4, "date": "2016-04-06"}, {"excerpts": ["I got the Sahi Paneer and it was delish. ", "I ended up feeding a little bowl to my 8 month old (no teeth) and she devoured it. ", "Her first Indian food! ", "I was a little nervous at first. ", "But she slept blissfully the whole night. "], "author": "Regina S.", "review": "Holy Kitchen has great veggie options and delivers to Bernal Heights!\n\nWe are vegetarian and live in Bernal, a bit of a no-persons-land for food delivery. It's so rare to find a place outside of Bernal that delivers, let alone good vegetarian food. Holy Kitchen fit the bill.\n\nMy picky eaters devoured the samosas. The naan was yummy. The Daal Tadka was so healthy and had great flavor (got it mild for the kids). My husband loves anything spicy with cauliflower so the Aloo Gobi was perfect for him. I got the Sahi Paneer and it was delish. I ended up feeding a little bowl to my 8 month old (no teeth) and she devoured it. Her first Indian food! I was a little nervous at first. But she slept blissfully the whole night. :)\n\nYou must get their mango chutney and raita. I put them on a little of everything we ordered. Not sure if that's traditional or allowed but I loved it. \n\nI didn't have to cook and this order fed a family of 5 for $55. There were some leftovers for lunch the next day. That's pretty darn awesome.", "rating": 4, "date": "2015-03-12"}, {"excerpts": ["Ordered Sahi Paneer and Garlic Naan. ", "Absolutely delicious... ", "Being an Indian i was surprised by the flavors it had. ", "I've been to a lot of Indian restaurants in Bay Area, this one comes in the top 5 I've tried. ", "A must try in this neighborhood."], "author": "Kristal T.", "review": "Was in the area for work and decided to come here for lunch. What a great decision. Ordered Sahi Paneer and Garlic Naan. Absolutely delicious... Being an Indian i was surprised by the flavors it had. I've been to a lot of Indian restaurants in Bay Area, this one comes in the top 5 I've tried. A must try in this neighborhood.", "rating": 5, "date": "2014-09-18"}], "basmati white rice": [], "basmati brown rice": [], "peas pillau": [{"excerpts": ["Badami chicken - beautifully creamy, nutty and mild; lamb vindaloo - tender and plenty spicy, just as it should be; peas pillau - just awesome; masala papad - crispy papad with a great salsa-like topping/dip; and the Naan (we got plain) was perfect and plentiful. ", "I look forward to trying everything else on the menu."], "author": "Susan A.", "review": "I'm happy to give 5 stars! Not only did we have fanastic Indian food speedily delivered to our door (less than 20 mins) but we had access to an efficient support system to help fix a mistake we made in our order. Badami chicken - beautifully creamy, nutty and mild; lamb vindaloo - tender and plenty spicy, just as it should be; peas pillau - just awesome; masala papad - crispy papad with a great salsa-like topping/dip; and the Naan (we got plain) was perfect and plentiful. I look forward to trying everything else on the menu.", "rating": 5, "date": "2014-11-13"}], "chicken biriyani": [{"excerpts": ["Chicken biriyani - disappointing - the chicken was a bit dry, and the dish had too much going on (too many cashews, for example)\n2) ", "Lamb saag - ok, nothing special\n3) ", "Okra - ok\n4) "], "author": "Barnali D.", "review": "We ordered delivery from here, and frankly, were not impressed.  The food was average, the delivery (via Yelp) came a few minutes before the ETA (nice), but the delivery person left quickly without taking payment (which necessitated a call to the restaurant).\n\nWe ordered the following dishes and were not wowed by any of them:\n\n1) Chicken biriyani - disappointing - the chicken was a bit dry, and the dish had too much going on (too many cashews, for example)\n2) Lamb saag - ok, nothing special\n3) Okra - ok\n4) Daal tadka - mediocre \n5) Naan - ok\n\nThe delivery came a bit early, which was great, but the delivery person hurried away as my husband went to grab his wallet to pay cash (as we'd specified on our order).  We then had to call the restaurant to give them our credit card info to make sure they got paid, which was a slightly irritating added step.\n\nOverall, we were underwhelmed and will not be hurrying back.", "rating": 3, "date": "2018-03-01"}, {"excerpts": ["Both vegetable and chicken biriyani was dry and overly spicy when we requested mild. ", "The garlic Naan was ok. ", "Clay Oven was a way much better."], "author": "Gordon C.", "review": "Not the best experience. Both vegetable and chicken biriyani was dry and overly spicy when we requested mild. The garlic Naan was ok. Clay Oven was a way much better.", "rating": 2, "date": "2015-09-20"}], "paneer kulcha": [], "rasmali": [], "kalakand": []}