{"fried squid legs": [{"excerpts": ["Food is good and I def recommend trying the fried squid legs (for seafood lovers like me). ", "Service is slow. ", "Almost as if they have to harvest and dry their own leaves to make their teas. ", "Restaurant is clean. ", "Accepts major credit cards for purchases $10 or more. ", "Has a stamp card promo of 10 stamps = 1 free drink."], "author": "Michelle G.", "review": "I personally believe their milk teas are much tastier than Purple Kow. Purple Kow's is watered down and it tasted bland. Prices are reasonable.  Food is good and I def recommend trying the fried squid legs (for seafood lovers like me). Service is slow. Almost as if they have to harvest and dry their own leaves to make their teas. Restaurant is clean. Accepts major credit cards for purchases $10 or more. Has a stamp card promo of 10 stamps = 1 free drink.", "rating": 4, "date": "2013-10-20"}], "egg puffs": [{"excerpts": ["This place is not my first choice, but this was the only place that was open in outer Richmond that I knew made egg puffs. ", "They were under down and tasted floury. ", "I'd prefer Eggettes over Honey B any day."], "author": "Angie Y.", "review": "This place is not my first choice, but this was the only place that was open in outer Richmond that I knew made egg puffs. They were under down and tasted floury. I'd prefer Eggettes over Honey B any day.", "rating": 3, "date": "2017-10-02"}, {"excerpts": ["Egg puffs also are yum."], "author": "RayRay M.", "review": "always order the black and green teas. slushies are great too. Ive had the fries and the wings-- not too bad. The sea salt is really really tasty! Egg puffs also are yum.", "rating": 5, "date": "2018-01-06"}, {"excerpts": ["variety of drinks: milk tea, slushes, egg puffs, coffee, fruit teas, tea, yogurt drinks, Taiwanese Styled milk teas, etc. \n", "-Accepts credit cards, however, MINIMUM $10\n-No stamp cards yet....\n-2 round tables and chairs against the windows, so a pretty small place\n-quiet and good for studying, for now, before people start crowding this place once they find out about it\n-cups are fat like Purple Kow and Half and Half, but a bit smaller. \n"], "author": "Chena N.", "review": "TPumps, I have cheated on you again. I am sorry. However, it was a fun experience! If NorCal's Purple Kow and SoCal's  Half and Half were to have a baby, it would be Honey B. \n\nWhatsup @ Honey B:\n-WHAT? SAY IT LOUDER! I CANT HEAR YOU!!! It takes only 10 minutes and NOT 45 minutes for my drink? WHAO....\n-wide variety of drinks: milk tea, slushes, egg puffs, coffee, fruit teas, tea, yogurt drinks, Taiwanese Styled milk teas, etc. \n-Accepts credit cards, however, MINIMUM $10\n-No stamp cards yet....\n-2 round tables and chairs against the windows, so a pretty small place\n-quiet and good for studying, for now, before people start crowding this place once they find out about it\n-cups are fat like Purple Kow and Half and Half, but a bit smaller. \n-their drinks are not sugar loaded like Purple Kow and Half and Half! \n\nJasmine Matcha Green Milk Tea (3 stars): With added Honey Boba, $3.78. Like I mentioned, the baby of Purple Kow and Half and Half would be Honey B. Similar tub size, but much cheaper and takes less time to receive it. It had strong tea tastes. I can see how some people would not like this because they're so used to powdered drinks like teaway. But its actually refreshing and had jasmine flavor and not just loads of sugar. Next time, I would ask for light ice because they put a little too much ice for me. The honey boba was sweet and soft to balance with the strong tea flavor!\nhttp://www.yelp.com/biz_photos/honey-b-tea-house-san-francisco?select=aYMNL84BxfkuEScnHh8xrQ#TvFwGtPumWqTcOoyUI3EGA\n\nHoney Boba, Pudding Taiwanese Style Milk Tea (3.5 stars): My friend ordered this and I had a sip. I enjoyed it thoroughly. It can be compared to Half and Half and Purple Kow's pudding boba caramel milk tea. It was definitely delicious and it was not twitchingly sweet. \nhttp://www.yelp.com/biz_photos/honey-b-tea-house-san-francisco?select=aYMNL84BxfkuEScnHh8xrQ#aYMNL84BxfkuEScnHh8xrQ\n\nA week ago I had intended to go here and try it but didnt have a chance, thanks to my Yelp friend, Felipe L., I was able to try it out today! Overall a good experience! However, they should work on their decor. Nothing special, but it's good in that its a bit cheaper, no 40 min wait, and its not overly sweet.", "rating": 3, "date": "2013-01-26"}, {"excerpts": ["Oh but as for food, they only have egg puffs to go with the big container of boba.\n\n"], "author": "Ann T.", "review": "This spot is just as good as purple kow and I'm so glad they opened up and took over the old quickly's!! It's like half and half in socal! \n\nThe honey boba... mMm... I've always preferred that over regular boba. \n\nWait time... is about 5-10 minutes. Oh and there's never a line!\n\nSeating... there's definetely not a lot of that. This spot is more of a grab and go.\n\nMenu... it's extensive and there's so much to choose from! Oh but as for food, they only have egg puffs to go with the big container of boba.\n\nFrom now on, this will be my choice over purple kow. All they need to do is give out the stamp cards and we'll be golden!", "rating": 4, "date": "2013-01-31"}, {"excerpts": ["The menu isn't ridiculously long and they don't sell snacks here except for egg puffs, but all the drinks sounds really appealing (matcha and taro drinks!). ", "I also asked the girl if they use real taro, and she said yes (!!) ", "you have no idea how exciting that is...", "I also tried the egg puffs because I didn't have CASH and there is $10 minimum if you want to use a card (strictly enforced)...", "and they were aiite (freshly made though), but then again I'm not a fan of egg puffs. ", "True story...", "I bought 2 orders of egg puffs that I didn't plan on eating just so I could meet the $10 minimum to use my card to get my iced milk drink."], "author": "Jessica C.", "review": "This was my second time ever having iced milk (first time was at half and half in LA) and I think it was equally if not even MORE delicious here! Every sip was an explosion of honey, sweet chewy boba, and egg pudding (they are very generous with everything!), and they didn't go overboard with the ice so the drink was milky until the very end. The sweetness took me off guard at first, but luckily I was in the mood for SWEET so it was pretty wonderful. I wasn't asked what sweetness level I preferred but I heard the girl asking other customers...so yes apparently you can ask for less/more (I recommend less sweet, unless you have a powerful sweet tooth). The texture/chewiness and sweetness of the boba was perfect, and they even have small boba as well. \n\nThe menu isn't ridiculously long and they don't sell snacks here except for egg puffs, but all the drinks sounds really appealing (matcha and taro drinks!). I also asked the girl if they use real taro, and she said yes (!!) you have no idea how exciting that is...I rarely come across boba shops that use real taro.\n\n\nI also tried the egg puffs because I didn't have CASH and there is $10 minimum if you want to use a card (strictly enforced)...and they were aiite (freshly made though), but then again I'm not a fan of egg puffs. True story...I bought 2 orders of egg puffs that I didn't plan on eating just so I could meet the $10 minimum to use my card to get my iced milk drink.", "rating": 4, "date": "2013-08-01"}, {"excerpts": ["The most disappointing part of the visit was when I asked them if the egg puffs were meant to be soggy since I've never had it that texture. ", "It was cold and limp like it has been sitting out in the display case for over 2 wks. ", "I asked NICELY if they could reheat it or do something with it since it didn't taste right and the guy just said \"oh it's served like that.", "\" ....."], "author": "Patricia K.", "review": "Expensive unflavorful boba and soggy/limp egg puffs= unhappy boba-lover who has vowed to never return. My honey green tea without boba cost $3.78 but I couldn't taste the tea or the honey. It was more like a fat cup of sweetened water with lots of ice and BAM there goes almost 4 bucks. \n\nThe most disappointing part of the visit was when I asked them if the egg puffs were meant to be soggy since I've never had it that texture. It was cold and limp like it has been sitting out in the display case for over 2 wks. I asked NICELY if they could reheat it or do something with it since it didn't taste right and the guy just said \"oh it's served like that.\" .....um ok. \n\nif you come here, i hope you have better luck but if you're not desperate and willing to drive just a little further, go elsewhere because this place definitely needs a lesson on customer service and making the stuff offered on their own menu. \n\nanother big negative= credit card minimum of $10.", "rating": 1, "date": "2013-07-22"}, {"excerpts": ["They only have one type of snack right now, egg puffs. "], "author": "Lolia S.", "review": "Quickly has been replaced by another boba drink shop, Honey B. Honey B doesn't have hundreds of drinks but it has plenty to choose from, including milk tea, yogurt drinks, tea lattes, fresh tea, fruit blend tea, fruit slush, coffee, etc. Drinks are available hot or cold. Drink add ins like boba, jellies and red beans are 50 cents each. They only have one type of snack right now, egg puffs. I hope they add more snacks, especially popcorn chicken.\n\n* Matcha green milk tea with honey boba ($3.78): It's a huge cup, the size and shape of Half & Half's (25 ozs.) and there's only one cup size available. The milk tea had a nice creaminess and real tea flavor. The pearls/boba were very sweet and chewy. They were a bit goopy. The drink was a little too sweet for me. What really bothered me is that 1/2 of the cup was filled with ice.That's way more ice than usual!\n\nThe décor was simple with pictures of drinks on the wall, counter seating and a few small tables. \n\n$10 credit card minimum.", "rating": 3, "date": "2013-01-21"}, {"excerpts": ["Egg puffs were really terrible... avoid.\n\n", "==\n\nService was slow especially for the egg puffs. ", "The drinks came out quite a while before the egg puffs were ready. \n\n== "], "author": "Steven B.", "review": "Honey B's a new milk tea place that opened up in a district filled with MT places. They have a really nice looking logo with bees on it.\n\n== Drinks ==\n\nTheir green milk tea is pretty mediocre. There wasn't a good tea flavor to the drinks. Tasted like milk and honey... Where's my tea...\n\nEgg puffs were really terrible... avoid.\n\n== Service ==\n\nService was slow especially for the egg puffs. The drinks came out quite a while before the egg puffs were ready. \n\n== Overall ==\n\nThere's better alternatives in this neighborhood.", "rating": 2, "date": "2013-04-05"}, {"excerpts": ["Egg Puffs were hard and dense, and lacked flavor\n"], "author": "Christina L.", "review": "ugh..no.  It's like a bad imitation of Purple Kow.   \n\nThe grass jelly taste off\nBoba was way too sweet\nRoasted Oolong Milk Tea lacked flavor\nEgg Puffs were hard and dense, and lacked flavor\nThe decor/layout is dated.\n\nNot coming back, sorry.", "rating": 2, "date": "2013-03-29"}, {"excerpts": ["We also ordered the egg puffs, which were tasty, but the consistency was a little disappointing because instead of being light and airy, they were dense and chewy.  ", "However, if your craving egg puffs, these will still hit the spot.\n\n"], "author": "Carrie C.", "review": "I'm always excited yet somewhat dubious to try new tea places, but Honey B came highly recommended by a friend, so we decided to give it a try.  Overall, I would give it a pretty solid 3 stars.  As in: it wasn't mind blowing or even sock rocking, but I would come back if conveniently close and be satisfied with the drinks.\n\nI ordered the oolong milk tea, and my friend ordered the honey milk tea.  Both of them were pretty good but not as flavorful as other places I've been.  We also ordered less sweet, and they were still plenty sweet (so I'm a little afraid to know what regular sweet tastes like).  We also ordered the egg puffs, which were tasty, but the consistency was a little disappointing because instead of being light and airy, they were dense and chewy.  However, if your craving egg puffs, these will still hit the spot.\n\nOverall, solid tea experience.  I would come here if I happened to be nearby, but i would not go out of my way to seek out Honey B.", "rating": 3, "date": "2013-02-24"}, {"excerpts": ["We tried the egg puffs and they were all right. ", "It definitely has room for improvement. ", "It was too doughy and needed more time on the machine. ", "The flavor was subtle. ", "It looks like they are gonna add more to their menu..."], "author": "Jay Z.", "review": "Honey B took over the old Quickly's location. This location hasn't had much luck in the past, so I hope Honey B fares well!\n\nWe tried the egg puffs and they were all right. It definitely has room for improvement. It was too doughy and needed more time on the machine. The flavor was subtle. It looks like they are gonna add more to their menu...I saw some crepe machines in the back!\n\nTheir cups are the same size as Purple Kow but its wait is definitely less than Purple Kow. We ordered the jasmine matcha milk tea and the red bean milk tea. The jasmine matcha milk tea was quite fragrant and had a hint of matcha. I prefer Purple Kow's fresh matcha milk tea, but if you like the jasmine tea as the base of the milk tea, then I'd say Honey B is pretty good. I like the fact that they use real red bean in their drink. Very few places make red bean milk tea the way I like it... Tpumps comes pretty close though. I liked the strong tea taste in the red bean milk tea. These beverages are definitely not watered down and you can definitely taste the tea. One gripe is the amount of ice... I hope they improve on this aspect. It's way too much ice!", "rating": 3, "date": "2013-02-01"}, {"excerpts": ["Don't get the egg puffs."], "author": "Jennifer H.", "review": "Good backup option to Purple Kow if you don't want to wait in a long line. Don't get the egg puffs.", "rating": 2, "date": "2013-03-24"}], "fried pot stickers": [], "red bean smoothie": [], "fried chicken wingps  fries": []}