{"mint lemonade": [{"excerpts": ["but it is worth the pain) and the freshly made mint lemonade (scrumptious and refreshing). ", "Also had the egg roll and golden purses which were amazing. ", "I was not in love with the fried tofu or fish cake, but everything else was excellent!"], "author": "Tyger L.", "review": "Delicious! I had the ma keur yao (spicy eggplant) w/ jasmine rice (spicier than I *should* have but it is worth the pain) and the freshly made mint lemonade (scrumptious and refreshing). Also had the egg roll and golden purses which were amazing. I was not in love with the fried tofu or fish cake, but everything else was excellent!", "rating": 4, "date": "2017-05-30"}, {"excerpts": ["I recommend the mint lemonade (one of the best drinks I've ever had). ", "The pad Thai is to die for and will have you eating even when you're already full."], "author": "Dylan H.", "review": "Amazing food, lots a variety and a good price. I recommend the mint lemonade (one of the best drinks I've ever had). The pad Thai is to die for and will have you eating even when you're already full.", "rating": 5, "date": "2017-08-08"}, {"excerpts": ["I tried the strawberry mojito...very fresh and tasty, as well as the mint lemonade."], "author": "Deanna R.", "review": "The food was freshly prepared after we ordered. The medium panang was hot, but not too hot. If you don't like spice, stick with the mild! The meat fell apart. The phad thai was delicious too with a side of carrot and bean sprouts. I tried the strawberry mojito...very fresh and tasty, as well as the mint lemonade.", "rating": 5, "date": "2017-07-06"}, {"excerpts": ["Mint Lemonade - So good! "], "author": "Vivian A.", "review": "I seriously haven't written a Yelp review for my favorite Thai place in Little Saigon? \n\nI've been getting House of Thai delivered for over a year now. It's without a doubt my most patronized Thai restaurant in SF. Ler Ros gets an honorable mention for being awesome as well and also highly frequented. Though I've never actually been inside House of Thai. Being the lazy and apartment dwelling bum that I am I get House of Thai delivered.\n\nFavorites include:\nPo Tak Soup - Jam packed full of sea critters. I get it almost every time. It's especially perfect on a cold day, or when you're sick.\n\nLarb Salad - Get it with duck, you won't be disappointed. I love this one!\n\nPla Mauk Tod - Perfect appetizer, I always ask for a 2nd sweet and sour sauce and one time I even got one!\n\nNuer Kem - All dat protein. This is the kinda thing I add to my order just to meet the delivery minimum but then it makes a perfect snack later or the next day.\n\nMint Lemonade - So good! And if you're the type to booze, it mixes really well with vodka. \n\nThai Iced Tea - It's Thai iced tea\n\nWhile these are my favorites I always add something like Pad Thai, Pad Se-Ew, Fried Rice, the Pork Leg Stew Noodles Soup, etc. Also, their crispy pork belly is good but not as good as Ler Ros. House of Thai has a huge menu and I love ordering a one or two of my favorites and then trying something new as well. I've yet to be disappointed. I love every meal I get from House of Thai (and you should too).", "rating": 5, "date": "2014-06-25"}, {"excerpts": ["I ordered a mint lemonade (which was very, very good, even if it was a tad sweet for my tastes) and it came in its own bag for extra protection. ", "It also had a piece of tape over the place where the straw is inserted. "], "author": "Ashley-Jayne O.", "review": "I haven't been to this place in person yet, but based on delivery, I have no doubt that it's a pleasant experience in-restaurant as well. \n\nSpeaking of delivery, it was prompt and the food was very well-packaged. I ordered a mint lemonade (which was very, very good, even if it was a tad sweet for my tastes) and it came in its own bag for extra protection. It also had a piece of tape over the place where the straw is inserted. Probably not important to most people, but the attention to detail was appreciated. \n\nFor our meals, I had the pumpkin curry with chicken (which has to be ordered with a side of rice if you want it, I chose brown) and my boyfriend had the Pad See-Ew. \n\nThe pumpkin curry was to die for! Seriously. I am a huge curry fan and it was perfect. I have never had pumpkin curry before, so it was a pleasant surprise. Huge, dense, tender pieces of pumpkin, perfectly cooked veggies, and big pieces of chicken. The curry itself was delicious--a red curry that I ordered mild, and it was the perfect amount of spice. I found out last week that I was allergic to dairy, so I've been feeling a bit deprived in terms of good food. Seeing as this is made with coconut milk, as is traditional, I wasn't robbed of delicious comfort food. It hit the spot and the portion, for me at least, was huge! I was able to have it for lunch for two days afterward! Love, love, love.\n\nMy boyfriend was thrilled with his Pad See-Ew. It's his go-to dish at thai restaurants, so he's had it many times in many different ways. Here, however, he had the option to order it with a \"hot\" heat level... and his reaction was priceless! He was so happy that a place followed through and actually served its food very spicy! So happy, in fact, that he called his brother up (who lives in LA) in the middle of dinner to tell him that they have to go to House of Thai next time his brother visits! \n\nOverall, we were very happy with our meals and will certainly be return customers here!", "rating": 5, "date": "2014-03-15"}, {"excerpts": ["Thai Iced Tea, of course, with its usual greatness; but they also have mint lemonade, which is AWESOME!, very freshly made, and lychee iced tea, a cool variation.\n\n"], "author": "Merrick W.", "review": "Thai House Express -- I thought this would be Thai version of Panda Express.  Wrong!  What a find -- the food is awesome.\n\nPad Thai is probably the best I've had in the city.  It even has pieces of tofu that are soft and fresh -- not overfried, like so many places seem to do.  And they also used very fresh white meat chicken -- white-meat-chicken-snob that I am, it made me very happy.\n\nOddly, they don't have chicken satay here (she said they don't have there right cooking area for it(?)), so instead I had the crispy beef appetizer -- which was excellent. \n\nI liked it so much I went back two more nights.  First night I had their mild yellow chicken curry.  The curry was great -- but, for some reason, they used dark meat for the curry, so everything ISN'T white meat, like I had thought (so those like me, take note -- or maybe you can order the curry with white meat?).  \n\nThe time after that I had their beef chunk red curry (pa nang nuer).  Very good, although I have to say that this is one dish that I like better at Cha Am on Folsom, despite the fact that almost everything else on their menu doesn't hold a candle to Thai House Express.\n\nThey also have some cool drinks.  Thai Iced Tea, of course, with its usual greatness; but they also have mint lemonade, which is AWESOME!, very freshly made, and lychee iced tea, a cool variation.\n\nAnd finally, this place has a great-looking staff.  The women, the men, both on the serving floor and in the kitchen are all nicely dressed and well-coiffed, as well as  being geniunely friendly.\n\nBe forewarned that if you plan on eating here. it's NOISY!!   They need some soundproofing on the walls and ceilings.\n\nBut for a big Thai food fan like me, I was really happy to find this place.", "rating": 5, "date": "2012-03-31"}, {"excerpts": ["My friends ordered Duck Noodle Soup and a rice plate with chicken I think, as well as a Mint Lemonade.\n\n"], "author": "Monica T.", "review": "I came here on Memorial Day for dinner after finding out that the Thai restaurant in Japantown was closed, and also after giving change to a homeless guy with a brown substance on the back of his pants, but enough of that...\n\nAt first thought, this place looked really Americanized but once inside and saw the workers, I was a bit relieved. I ordered Pad Thai and Thai Iced Tea. My friends ordered Duck Noodle Soup and a rice plate with chicken I think, as well as a Mint Lemonade.\n\nThai Tea was very sweet, but not as sweet as most Thai places I've been to. The lemonade was extremely sour and according to my friend, too sweet, but the sweetness seemed okay to me. It was just very sour, which could be good or bad depending on what you like.\n\nI thought the Pad Thai was pretty good at first, but then I tasted a weird aftertaste. I realized after a few bites that it was a really fishy aftertaste. I've NEVER tasted fishyness in any Pad Thai dishes from Thai restaurants I've ordered from, and this first time was not pleasant!! It was gross!!\n \nPortion-wise, I think it's decent for the price you pay. Not the best, but not bad either. I was filled up when I was done with my Pad Thai, but I can get full easily and I ate a snack not so long before I ate dinner.\n\nService was great. The waitress who attended my table was attentive and answered our questions. Water was refilled often enough. The only thing I would have liked to see are smiles!\n\nI say, stay away from the Pad Thai unless you aren't bothered by a fishy flavor in that dish.", "rating": 3, "date": "2012-05-29"}, {"excerpts": ["I also highly recommend the mint lemonade. ", "But be prepared to order two, and at around $4 if you're on a budget, I'd just avoid them all together. "], "author": "Alland B.", "review": "I've been eating here for about 4 years now, out of the 6 I've lived in SF. The best Thai in town. Ok, maybe not THE BEST, but for the price, i think it's one of my favorite places to eat some damn good thai. I also love Basil, Thep Phanom, but this place is the absolute jam!!! I would pick this over anywhere else. Every time we have guests in town to DJ our parties, I always petition to take them here, and they always love it. My girlfriend and I are here at least 3 times a month.\n\nI used to live around the corner and would eat the Panang Curry with beef a couple of times a week, these days I hardly ever go without ordering the Yellow Chicken Curry, It's always so thick and the chicken is choice. I love the appetizer #1. I forget what it's called, but it's some kinda pouch thingy. Basically little deep fried pouches of spiced curried ground chicken, tied off with little seaweed bows. The Thai beef jerky was an incredible surprise, and if you're looking for something basic, i'd go with the Pad Kee Mao. It comes super spicey, so if you're not into that, make sure to ask for mild. The Larb is amazing as well. \n\nI also highly recommend the mint lemonade. But be prepared to order two, and at around $4 if you're on a budget, I'd just avoid them all together. You'll be too hooked to watch your $.\n\nOnly flaw? No delivery. I think they'd probably need a fleet to cover all their deliveries. This place has a LOT of fans.\n\nOh, and they're open relatively late, which is friggin awesome.", "rating": 5, "date": "2009-11-23"}, {"excerpts": ["Not ten minutes later I was desperately trying to dilute my hideously sugared mint lemonade with my water while biting into a hot, tasty string roll.  ", "Yes, I know what you're thinking:  it's SPRING roll, Holly, not STRING roll.  ", "Perhaps you'd like to share that sentiment with the chef.  "], "author": "Holly B.", "review": "Thai House Express has escaped my review for so long because it's become one of those standard neighborhood places where I often stop in for soup or quick dishes on the way home.  I probably wouldn't have thought to review it until I took some friends there last weekend.\n\nIt was a weekend night and busier than usual, so we're waiting a few minutes for a table.  While near the cash register, I happen to see a recent health inspection notice just barely peeking out from behind another piece of paper.  78!  (\"78,\" I laugh to myself. \"But I eat here all of the time!\")  Not wanting to look like a jerk who takes their friends to less than clean spot in their 'hood (what can you expect in the 'loin?) I don't say anything to my dining companions.\n\nNot ten minutes later I was desperately trying to dilute my hideously sugared mint lemonade with my water while biting into a hot, tasty string roll.  Yes, I know what you're thinking:  it's SPRING roll, Holly, not STRING roll.  Perhaps you'd like to share that sentiment with the chef.  I pulled a generous length of twine from the shredded veggies tucked into said \"string roll,\" and quickly called over our waiter.  \n\nOur waiter didn't seem terribly concerned but dutifully gathered up my plate and disappeared into the kitchen.  He came back a few minutes later and said the string rolls would be on the house.  There was still one roll remaining on the table.  I looked at my friends and dared them to take it.  I told the waiter we needed a minute to decide if we wanted the rest of our order and he walked off with no apologies or other offers. \n\nI'm well aware that there are many worse things to find in one's food than string, but the couldn't care less attitude of this place is striking (at least appear sorry -or shocked!- and appropriately compensate your patrons for a mishap.)  I won't be back until the health inspector's score on this place improves: http://dphwww.sfdph.org/eh/Violations/Loc_CurrentViol.asp?LocationID=14089", "rating": 1, "date": "2008-04-27"}, {"excerpts": ["It's the first time I had a mint lemonade", ", I think I'll be making these at home."], "author": "Teri G.", "review": "I was in SF for a conference and found this place on Yelp. I had red curry with tofu and vegetables. It definitely hit the spot. Sweet and spicy, one of the better red curries I've had. Prices are very reasonable. It's the first time I had a mint lemonade, I think I'll be making these at home.", "rating": 5, "date": "2010-12-13"}, {"excerpts": ["The mint lemonade is refreshing as well as the thai iced tea.  "], "author": "erica d.", "review": "I really like the food in this place.   The food comes out within minutes of ordering, nice and hot...steam rising above it.  One of my favorite dishes is the #82-sauteed eggplant with basil and your choice of meat.  The mint lemonade is refreshing as well as the thai iced tea.  For dessert, the roti has just the right amount of sweetness without going overboard and causing a diabetic seizure. \n\n The only possible downside is the area....it's on the boarder of the TL (Tenderloin)... one of the more \"sketchier\" areas of the city, but otherwise, it's worth going to.", "rating": 4, "date": "2008-04-01"}], "toong gyen yung": [{"excerpts": ["Then again, maybe we were just that hungry...\n\n- TOONG GYEN YUNG - Minced Chicken, Onion, Carrot and Potatoes wrapped in a \"Golden Bag\" with Cucumber Salad..."], "author": "Mike L.", "review": "When my friend told me there was a Thai restaurant in the TL that was just as good as Lers Ros but without the lines, I was pretty stoked to check them out.  As much as I love Lers Ros, it sucks that they're always so busy!\n\nGiven how my friend sold me on House of Thai's typical lack of lines, it was quite ironic that we ended up having to wait about 15-20 minutes for a table (it was an abnormally busy night downtown/in the TL).  Not a big deal, but it seemed like the rest of the service went a little slow.  In particular, there was a drag before our first plate came out.  Then again, maybe we were just that hungry...\n\n- TOONG GYEN YUNG - Minced Chicken, Onion, Carrot and Potatoes wrapped in a \"Golden Bag\" with Cucumber Salad...$7.00\n(http://www.yelp.com/biz_photos/house-of-thai-san-francisco-2?select=JTOkkAc_mEeocpOAh_zbWA#irdePvDg5INkeflnlVwMAQ)\nMy friend ordered it for the table to share since it's one of her favorites.  The \"pouch\" is essentially a dumpling skin that's been tied off and baked.  Kind of a neat idea, and it really was tasty, but it's not something I would crave for either.  \n\n- KAO KA MOO - Pork Leg Stew over Rice with Special Secret Sauce...$8.00\n(http://www.yelp.com/biz_photos/house-of-thai-san-francisco-2?select=JTOkkAc_mEeocpOAh_zbWA#0luta6DtQBDq9NyJ5k8raA)\nWhile the dish looked great (albeit seemingly smaller than in the photos on Yelp), I have mixed feelings.  The pork was amazingly tender, and the taste was pretty good.  However, it was a little heavy on the herbs, and the dipping sauce was very sweet.\n \nAlthough I wasn't as impressed with the Pork Leg Stew as others, I did get to try their Chan Pad Poo (spicy crab noodles) and it was pretty solid.  The flavors were spot on, and they weren't kidding when they said it was spicy - just the way I like it!\n\nStill, until I get the chance to try more of their food, I'm rounding down from THREE AND A HALF STARS for now.  The menu certainly has potential, but I feel like I can get some of these dishes elsewhere (Amphawa on Geary has a similar Chan Pad Poo, and it's both closer and easier to park by).  Plus, since I don't frequent the TL often, I'd rather head over to Lers Ros to make the trip worthwhile.", "rating": 3, "date": "2013-04-18"}, {"excerpts": ["I had the Toong Gyen Yung, and Pad Prik King with shrimp. ", "The Toong Gyen Yung was good, your basic thai version of a samosa, but the Pad Prik King was amazing. ", "The sauce was clearly homemade and beyond flavorful, I mean really spiced well and not overly salty. ", "So good! ", "I can't wait to come back and try more."], "author": "Stephanie J.", "review": "This place was so delicious!! I would add a food pic but it was too good and I was too hungry! Simple inside, easy to get a seat, open late, area is alright, not great but tolerable. Friendly service and very fast. Come and try this! I had the Toong Gyen Yung, and Pad Prik King with shrimp. The Toong Gyen Yung was good, your basic thai version of a samosa, but the Pad Prik King was amazing. The sauce was clearly homemade and beyond flavorful, I mean really spiced well and not overly salty. So good! I can't wait to come back and try more.", "rating": 5, "date": "2016-08-04"}, {"excerpts": ["I ordered the pad thai (which was good), the Tom Yum soup (medium spicy, heads up this was pretty spicy even for someone that enjoys a little heat), and the Toong Gyen Yung  (aka golden bag, these were just okay.. pretty plain). ", "I would definitely go back for the soup and try something else!"], "author": "Natalie S.", "review": "Pretty good thai for for a decent price in the city.  I ordered for pick up and it was ready within 15 minutes.  I ordered the pad thai (which was good), the Tom Yum soup (medium spicy, heads up this was pretty spicy even for someone that enjoys a little heat), and the Toong Gyen Yung  (aka golden bag, these were just okay.. pretty plain). I would definitely go back for the soup and try something else!", "rating": 4, "date": "2016-07-12"}], "porpier sod": [], "tod mum pla": [], "porpier pak": [], "sai oou": [{"excerpts": ["Sai Oou (Deep-fried homemade Thai-style sausage served with Thai fresh chili, fresh ginger, peanut, cabbage, and red onion): $7\n", "*", "*Interesting presentation. ", "We ordered this because we were curious and it was recommended by our server. ", "However, we didn't know how to properly eat it at first, so we had to ask our server =", "P. ", "The sausage, chili, ginger, peanuts, & onions were arranged separately on the plate. ", "I guess you're supposed to use the cabbage leaves and wrap all the ingredients together to create your own \"cabbage wrap\" (similar to \"lettuce wraps\"). "], "author": "Juliet Rachel C.", "review": "I was in SF for a weekend and my friend and I just happened to stumble upon this cute little Thai restaurant just 2 blocks away from where we were staying. We were really hungry and I honestly wasn't expecting such authentic, tasty Thai food!! I've eaten at various Americanized Thai restaurants in So. Cal, but had never had Thai food like this before. The wide range of exotic spices and flavors in our dishes were exciting. I enjoyed every bite here.\n\nHere's what we ordered:\n\n1. Por Pier Sod (Fresh rice paper rolls stuffed with Chinese sausage, egg, tofu, and cucumber, topped with sweet and sour tamarind sauce): $7\n**LOVED this appetizer!! This was my favorite dish of the meal.\n\n2. Sai Oou (Deep-fried homemade Thai-style sausage served with Thai fresh chili, fresh ginger, peanut, cabbage, and red onion): $7\n**Interesting presentation. We ordered this because we were curious and it was recommended by our server. However, we didn't know how to properly eat it at first, so we had to ask our server =P. The sausage, chili, ginger, peanuts, & onions were arranged separately on the plate. I guess you're supposed to use the cabbage leaves and wrap all the ingredients together to create your own \"cabbage wrap\" (similar to \"lettuce wraps\"). The taste was interesting and VERY good, but it was too cumbersome to prep for eating.\n\n3. Pad Pak (Wok fried Mixed Vegetables w/side of Jasmine rice): $8\n**DELICIOUS! We added chicken to this stir fry. Soooo good. \n\n4. Thai House Beef (Marinated beef broiled to order; served with cilantro-tangy sauce over rice): $9\n**Tender, flavorful, thinly sliced beef. Loved the tangy cilantro sauce with the meat and rice.\n\n\nWe finished allllll the dishes!!! I was beyond full, but still wanted to eat because the food was just so good.\n\nStellar and attentive service. Our waiter checked up on us frequently and constantly refilled our waters & soft drinks when needed. Very nice staff.\n\nI definitely want to come back again the next time I'm in SF area!", "rating": 5, "date": "2013-02-02"}, {"excerpts": ["The Sai Oou (another favorite) was overcooked and too dry. ", "The only highlight was the Sweet Sticky Rice with Homemade Egg Custard which was very good. ", "I wouldn't go back."], "author": "Nate W.", "review": "I did not enjoy my meal. The pad thai was not flavorful. It is one of my favorite dishes and I order it all the time. I would have to say this was the worst I have ever tried. The Sai Oou (another favorite) was overcooked and too dry. The only highlight was the Sweet Sticky Rice with Homemade Egg Custard which was very good. I wouldn't go back.", "rating": 1, "date": "2013-11-03"}, {"excerpts": ["Last time we tried the sai oou too, b/c deep fried pork sausage intrigued. ", "The links are actually quite good, with interesting herbs and bits of fresh cilantro mixed in. ", "I'll opt to try something new on the next round though."], "author": "Candice L.", "review": "Both T.H.E.'s are great resources for dishes other than the run of the mill pad Thai and curries. They are also beloved b/c they stay open decently late, pack one hell of a ~spicy~ punch, and are totally affordable. As many before me have avowed, the kao ka moo is so, so very good. Never has a menu description given less away, \"special pork leg stew\" doesn't even begin to offer a hint of the tender fattiness that awaits you (I prefer this a la carte as opposed to over rice). \n\nEvery so often I forget how searingly hot \"spicy\" can actually be. Green papaya salad and pad kee mao ordered spicy have left my lips burnt in that hurts so good kind of way. I think medium spicy to spicy is the optimal range. Last time we tried the sai oou too, b/c deep fried pork sausage intrigued. The links are actually quite good, with interesting herbs and bits of fresh cilantro mixed in. I'll opt to try something new on the next round though.", "rating": 4, "date": "2006-12-26"}], "nuer kem": [{"excerpts": ["Nuer Kem - All dat protein. ", "This is the kinda thing I add to my order just to meet the delivery minimum "], "author": "Vivian A.", "review": "I seriously haven't written a Yelp review for my favorite Thai place in Little Saigon? \n\nI've been getting House of Thai delivered for over a year now. It's without a doubt my most patronized Thai restaurant in SF. Ler Ros gets an honorable mention for being awesome as well and also highly frequented. Though I've never actually been inside House of Thai. Being the lazy and apartment dwelling bum that I am I get House of Thai delivered.\n\nFavorites include:\nPo Tak Soup - Jam packed full of sea critters. I get it almost every time. It's especially perfect on a cold day, or when you're sick.\n\nLarb Salad - Get it with duck, you won't be disappointed. I love this one!\n\nPla Mauk Tod - Perfect appetizer, I always ask for a 2nd sweet and sour sauce and one time I even got one!\n\nNuer Kem - All dat protein. This is the kinda thing I add to my order just to meet the delivery minimum but then it makes a perfect snack later or the next day.\n\nMint Lemonade - So good! And if you're the type to booze, it mixes really well with vodka. \n\nThai Iced Tea - It's Thai iced tea\n\nWhile these are my favorites I always add something like Pad Thai, Pad Se-Ew, Fried Rice, the Pork Leg Stew Noodles Soup, etc. Also, their crispy pork belly is good but not as good as Ler Ros. House of Thai has a huge menu and I love ordering a one or two of my favorites and then trying something new as well. I've yet to be disappointed. I love every meal I get from House of Thai (and you should too).", "rating": 5, "date": "2014-06-25"}], "pla mauk tod": [{"excerpts": ["Pla Mauk Tod - Perfect appetizer"], "author": "Vivian A.", "review": "I seriously haven't written a Yelp review for my favorite Thai place in Little Saigon? \n\nI've been getting House of Thai delivered for over a year now. It's without a doubt my most patronized Thai restaurant in SF. Ler Ros gets an honorable mention for being awesome as well and also highly frequented. Though I've never actually been inside House of Thai. Being the lazy and apartment dwelling bum that I am I get House of Thai delivered.\n\nFavorites include:\nPo Tak Soup - Jam packed full of sea critters. I get it almost every time. It's especially perfect on a cold day, or when you're sick.\n\nLarb Salad - Get it with duck, you won't be disappointed. I love this one!\n\nPla Mauk Tod - Perfect appetizer, I always ask for a 2nd sweet and sour sauce and one time I even got one!\n\nNuer Kem - All dat protein. This is the kinda thing I add to my order just to meet the delivery minimum but then it makes a perfect snack later or the next day.\n\nMint Lemonade - So good! And if you're the type to booze, it mixes really well with vodka. \n\nThai Iced Tea - It's Thai iced tea\n\nWhile these are my favorites I always add something like Pad Thai, Pad Se-Ew, Fried Rice, the Pork Leg Stew Noodles Soup, etc. Also, their crispy pork belly is good but not as good as Ler Ros. House of Thai has a huge menu and I love ordering a one or two of my favorites and then trying something new as well. I've yet to be disappointed. I love every meal I get from House of Thai (and you should too).", "rating": 5, "date": "2014-06-25"}], "peak gai tod": [{"excerpts": ["Ordered Pad Kee Mao w/ beef and a side order of Peak Gai Tod (chicken wings). ", "The food was excellent, and the order was ready and hot when I picked it up. ", "Would've been 5 stars if the chicken wing pieces were separated from the tips!"], "author": "Mario A.", "review": "Ordered Pad Kee Mao w/ beef and a side order of Peak Gai Tod (chicken wings). The food was excellent, and the order was ready and hot when I picked it up. Would've been 5 stars if the chicken wing pieces were separated from the tips!", "rating": 4, "date": "2017-08-09"}, {"excerpts": ["The Peak Gai Tod (Fried Chicken Wings) were freaking amazing though.  "], "author": "Jason K.", "review": "$7.25 for the Pad See Ew, so it's only slightly more than Sai Jai Thai.  It's equally as good so it'd be a toss up.\n\nThe Peak Gai Tod (Fried Chicken Wings) were freaking amazing though.  I would highly recommend getting an order if you eat here.\n\nThey also have quite a bit of specials listed around the restaurant so those would be worth a check next time.\n\nNeed a $10 minimum if you want to use a credit card though.", "rating": 4, "date": "2010-02-04"}, {"excerpts": ["And their Peak Gai Tod (#9, fried chicken wings) just tasted weird.  "], "author": "Lauren C.", "review": "I have become all about this restaurant these last few weeks.  It's a new favorite.  I still particularly adore the Tom Kha Gai.  As a child, I ate tons of this stuff called Lucas.  It's a little shaker full of chili powder, citric acid, salt, and a little sugar.  The overwhelming sour/salty flavor gave me this visceral flavor high when I ate it.  Same with the Tom Kha Gai.  The intensity is almost too much, but it's exquisite.\n\nPad Kee-Mao (#66, spicy noodles with Chinese broccoli) is another favorite of mine.  The Pad King (#76, choice of meat with ginger, carrots, jalapeno, and black fungus) is great for anyone who loves ginger.  I just tried the Gang Panang Nuer (#52, beef in red curry) last night.  It was fantastic and may be my new favorite curry.  The beef had zero fat or gristle.  I've also tried the Roti dessert with ice cream.  It was flaky and wonderful, but I thought the ice cream didn't really mesh with the pancake.  I think it would have been better with some sweetened creme fraiche or as an appetizer with curry dipping sauce.  On its own, however, the coconut ice cream totally rocked.  I've only tried about five different varieties, but this was the best.  \n\nI do have to mention the Por-Pier Sod (#2, rice paper rolls stuffed with sausage, egg, tofu, and cucumber, topped with crab meat and sour tamarind sauce).  It was actually revolting.  I expected a regular cool, refreshing rice paper roll.  What I got was two giant rolls served side by side like a couple of burritos, cut into slices crosswise.  They were served warm (!?!) and were drenched in this gross sweet gravy.  They were disgusting and impossible to eat.  I also dislike their Por-Pier Pak (#4, vegetarian egg rolls).  And their Peak Gai Tod (#9, fried chicken wings) just tasted weird.  Boyfriend joked that maybe they were from Thai chickens and while absurd, it rang true.\n\nEven though I disliked those three dishes, I still adore Thai House Express.  And it's like magic- even though most their dishes cost the same $7-$8 that many other places do, the bill always comes to surprisingly little.  I don't want to know how, I just want to enjoy it.  Before I ate at Thai House Express, I thought that the number of Thai restaurants in the city was seriously ridiculous.  Now I get it.", "rating": 5, "date": "2008-06-23"}], "keaw tod": [{"excerpts": ["I then moved to their Keaw Tod as an appetizer.  ", "Very light, perfectly fried and absolutely delicious.  ", "Shrimp and pork very good.  "], "author": "Greg H.", "review": "I thought House of Thai was an excellent way to close out my trip to San Francisco. I was here on business for a technology conference.\n\nI started with Thai Iced Tea. It was an interesting beverage. By for me, but if you want to try something sweet and different it might work.\n\nI then moved to their Keaw Tod as an appetizer.  Very light, perfectly fried and absolutely delicious.  Shrimp and pork very good.  Sauce was also excellent.\n\nMy main was Pad Se-Ew with beef.  Also excellent.  Very similar to what I have had at other restaurants.  \n\nI would overall recommend.  I paid $25 with a $4 tip for everything I had.  I thought very reasonable.  If I'm back in San Francisco, I would return if the mood for Thai is there.", "rating": 4, "date": "2016-09-22"}], "hot combo": [], "som tom salad": [{"excerpts": ["15 Som Tom Salad", ": I didn't like it at all.\n", "31 Tom Yum Soup", ": I usually love this kind of soup, because I like sour things, but this one had more of a fishy under base to it, I ate most of it because the veggies were so fresh and soft, but I wish it had more of a sour flavor to it.\n", "51 Pad Thai Noodle: ", "This was so good, the tofu came in little mini cube shapes and it had a very sweet tangy sauce that clinged to the noodles.\n", "Taro Cake: ", "The top had a very thick taro , so I ate that up right away, the rest was layers upon layers of white cake mixed with taro and crème, I wouldn't order this again , it was wayyyy too sweet (and I love sweet things)\n", "Thai syrup Crème Soda", ": When I ordered over the phone the waitress didn't ask me wethere I wanted it with crème or soda , so when it arrived it came with crème.  ", "I drank it rather fast, but I really over all didn't like it.  "], "author": "Jennifer G.", "review": "So I ordered food from here the other night, here is what I got:\n\n5 Tofu Tod: This was so good I ate it all under ten minutes.\n15 Som Tom Salad: I didn't like it at all.\n31 Tom Yum Soup: I usually love this kind of soup, because I like sour things, but this one had more of a fishy under base to it, I ate most of it because the veggies were so fresh and soft, but I wish it had more of a sour flavor to it.\n51 Pad Thai Noodle: This was so good, the tofu came in little mini cube shapes and it had a very sweet tangy sauce that clinged to the noodles.\nTaro Cake: The top had a very thick taro , so I ate that up right away, the rest was layers upon layers of white cake mixed with taro and crème, I wouldn't order this again , it was wayyyy too sweet (and I love sweet things)\nThai syrup Crème Soda: When I ordered over the phone the waitress didn't ask me wethere I wanted it with crème or soda , so when it arrived it came with crème.  I drank it rather fast, but I really over all didn't like it.  I will order it again next time with soda instead, and maybe it will have more of a lighter flavor to it.\n\nOut of all the food I got from here I would just order the tofu again , it was sooooo ggooood , but I will eat their food again , just next time I will order different things.", "rating": 4, "date": "2015-05-23"}, {"excerpts": ["I ordered the Som Tom salad with crab.  ", "I was expecting crab meat not crab shells which I had to pick out.  "], "author": "Michelle H.", "review": "I ordered delivery from here after seeing all the great reviews, but the food was just OK  Food came in about 40 mins. \n\nI ordered the Som Tom salad with crab.  I was expecting crab meat not crab shells which I had to pick out.  Might also be a good idea for them to slice up the giant pieces of lettuce.  \n\nThe Pad Prik King was tasty but the green beans were a little on the soggy side, along with the steamed veggies.  \n\nI did enjoy their Pumpkin curry with chicken.", "rating": 3, "date": "2014-07-01"}], "naked ladies salad": [{"excerpts": ["Chowed down on Naked Ladies Salad, Por-Pier Pak, Kao Pad-Wok Fried Rice, Pad Thai Noodle, Pad Se-Ew Noodle & of course Thai Ice Tea.\n", "It was very flavorful. ", "Super convenient online ordering and again Free Delivery :-)"], "author": "Tameka X.", "review": "If you are ever in Frisko and stay the night and had too much fun to get back out to get you something to eat. ORDER FROM HERE! Can you say FREE DELIVERY.\n\nThe food here was sooooo good. Chowed down on Naked Ladies Salad, Por-Pier Pak, Kao Pad-Wok Fried Rice, Pad Thai Noodle, Pad Se-Ew Noodle & of course Thai Ice Tea.\nIt was very flavorful. Super convenient online ordering and again Free Delivery :-)", "rating": 5, "date": "2014-06-08"}, {"excerpts": ["Some of my favorite dishes: Naked Ladies salad, duck noodle soup, tom yum soup, duck curry and pork leg noodle soup. \n\n"], "author": "Ying Ying S.", "review": "One of my favorite Thai place around, for they have quick service, friendly servers, and consistently good food. I live in the neighborhood so I order take-out and eat here often. It's not fancy and gourmet like Lers Rose, but you can expect quick service and good food. \n\nSome of my favorite dishes: Naked Ladies salad, duck noodle soup, tom yum soup, duck curry and pork leg noodle soup. \n\nNote: if you havent been here, go with mild medium spicy first. I love spicy food but medium is quite spicy for me.", "rating": 5, "date": "2014-01-08"}], "salad nuer sun salad": [], "yum woonsen salad": [], "yum pla dook foo salad": [], "yum salad": [{"excerpts": ["Their Yum salad with Beef is also delicious, their spicy lime dressing is really refreshing and the beef is seasoned well and not overcooked. ", "The prices her are good - you'll end up spending $30 for 2 people which is pretty standard I think, but it also depends on how much food you order."], "author": "Carina P.", "review": "My boyfriend and I always come here for date night. It is by far one of the better Thai restaurants in the city and I love it because it is so close by to where we live. We always eat-in so i'm not quite sure how it is if you want to do takeout. My boyfriend always gets the Red Gang Dang Curry with Chicken every time we go. It's delicious and they add quite a bit of spicy kick to the dish. I'm personally not a fan of bamboo shoots but I love how their coconut curry sauce tastes and the flavors of the Red Curry meld very well. \n\nDepending of what i'm in the mood for, there are many other good things on their menu. My go-to curry is their Pumpkin curry and I always add either Chicken or Beef. I'm a sucker for butternut squash/pumpkin and the flavors always balance out nicely because they add garlic and basil and bell pepper. Whenever i'm in a noodle mood I always go with the Pad Se Ew or the Pad Thai, as you can't really go wrong there. Their Yum salad with Beef is also delicious, their spicy lime dressing is really refreshing and the beef is seasoned well and not overcooked. The prices her are good - you'll end up spending $30 for 2 people which is pretty standard I think, but it also depends on how much food you order.", "rating": 5, "date": "2017-11-17"}, {"excerpts": ["Skip the Yum salad. "], "author": "Cami R.", "review": "Excellent pumpkin curry. Rice a la carte. Skip the Yum salad. Free thai iced tea with yelp/facebook check-in. 5% student discount.\n\nDismal customer service.", "rating": 3, "date": "2015-09-06"}], "gang jerd woonsen soup": [], "gang garee gai": [{"excerpts": ["My favorite is the gang garee gai."], "author": "King L.", "review": "The best. I drove from San Bruno just to get some food from here. I had business in the city. I haven't found another Thai restaurant as satisfying as this one. I haven't been in many. I was fortunate to have found this place when I first learned about Thai food. My favorite is the gang garee gai.", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["My favorite dishes are Gang Garee Gai (chicken and potatos in a coconut curry) and the Barbeque Chicken.  ", "It used to be this ", "was pretty dry and over-salted, but they seem to have juiced up the recipe and it is much tastier.  ", "I usually get the a la carte as it comes with 5 pieces of chicken (a leg, a wing, thigh and two breasts).  "], "author": "Ethan R.", "review": "Thai Express is a lively Thai restaurant located on a busy corner of Larkin on the edge of the Tenderloin.  I grew to enjoy this place having lived in the neighborhood the past few years.  The food is consistently of good quality, the service friendly, and the restaurant clean.  Often, I get takeout from here. My favorite dishes are Gang Garee Gai (chicken and potatos in a coconut curry) and the Barbeque Chicken.  It used to be this was pretty dry and over-salted, but they seem to have juiced up the recipe and it is much tastier.  I usually get the a la carte as it comes with 5 pieces of chicken (a leg, a wing, thigh and two breasts).  I also like the Cucucmber Salad for 3 bucks.  \n\nThey did raise their prices a year ago or so, which had me miffed.  Over $10 for Asian take out just doesnt seem right.  Now, I concede inflation has taken a hit on everything so I guess that is the world we now live in.  \n\nI do wish they served Angel Wings (stuffed chicken wings) but apparently they take alot of effort to make.  For that, you can go down to O'Farrell and check out Sai Jai Thai.  Overall, my experience has been consistently good.", "rating": 4, "date": "2013-03-15"}], "gang panang": [{"excerpts": ["I just tried the Gang Panang Nuer (#52, beef in red curry) last night.  ", "It was fantastic and may be my new favorite curry.  ", "The beef had zero fat or gristle.  ", "I've also tried the Roti dessert with ice cream.  ", "It was flaky and wonderful, but I thought the ice cream didn't really mesh with the pancake.  ", "I think it would have been better with some sweetened creme fraiche or as an appetizer with curry dipping sauce.  ", "On its own, however, the coconut ice cream totally rocked.  "], "author": "Lauren C.", "review": "I have become all about this restaurant these last few weeks.  It's a new favorite.  I still particularly adore the Tom Kha Gai.  As a child, I ate tons of this stuff called Lucas.  It's a little shaker full of chili powder, citric acid, salt, and a little sugar.  The overwhelming sour/salty flavor gave me this visceral flavor high when I ate it.  Same with the Tom Kha Gai.  The intensity is almost too much, but it's exquisite.\n\nPad Kee-Mao (#66, spicy noodles with Chinese broccoli) is another favorite of mine.  The Pad King (#76, choice of meat with ginger, carrots, jalapeno, and black fungus) is great for anyone who loves ginger.  I just tried the Gang Panang Nuer (#52, beef in red curry) last night.  It was fantastic and may be my new favorite curry.  The beef had zero fat or gristle.  I've also tried the Roti dessert with ice cream.  It was flaky and wonderful, but I thought the ice cream didn't really mesh with the pancake.  I think it would have been better with some sweetened creme fraiche or as an appetizer with curry dipping sauce.  On its own, however, the coconut ice cream totally rocked.  I've only tried about five different varieties, but this was the best.  \n\nI do have to mention the Por-Pier Sod (#2, rice paper rolls stuffed with sausage, egg, tofu, and cucumber, topped with crab meat and sour tamarind sauce).  It was actually revolting.  I expected a regular cool, refreshing rice paper roll.  What I got was two giant rolls served side by side like a couple of burritos, cut into slices crosswise.  They were served warm (!?!) and were drenched in this gross sweet gravy.  They were disgusting and impossible to eat.  I also dislike their Por-Pier Pak (#4, vegetarian egg rolls).  And their Peak Gai Tod (#9, fried chicken wings) just tasted weird.  Boyfriend joked that maybe they were from Thai chickens and while absurd, it rang true.\n\nEven though I disliked those three dishes, I still adore Thai House Express.  And it's like magic- even though most their dishes cost the same $7-$8 that many other places do, the bill always comes to surprisingly little.  I don't want to know how, I just want to enjoy it.  Before I ate at Thai House Express, I thought that the number of Thai restaurants in the city was seriously ridiculous.  Now I get it.", "rating": 5, "date": "2008-06-23"}], "gang dang with duck": [], "gang khewwan": [], "gang dang with seafood": [], "gang khewwan with duck": [], "gang khewwan with seafood": [], "chan pad poo noodles": [], "pad woon sen noodles": [{"excerpts": ["Anyways, we got over that and decided what to order: thai iced tea, red curry tofu, and pad woon sen noodles with tofu. ", "The red curry tasted like we were eating a bowl of salt and spicy powder. ", "On the other hang, the pas woon sen noodels tasted like rice noodles soaked in soy sauce. ", "The highlight of the meal was definitely the thai iced tea! "], "author": "Malika R.", "review": "I'm so sad that this place turned out to not be good. I was craving good thai food one day and after reading the good reviews on yelp, I thought I would give this place a shot. We arrived and the server told us to sit anywhere. After picking a table to sit at, she came to us and asked us to move; if she had a preference for where we sat, why could't she just seat up properly in the first place? \n\nAnyways, we got over that and decided what to order: thai iced tea, red curry tofu, and pad woon sen noodles with tofu. The red curry tasted like we were eating a bowl of salt and spicy powder. On the other hang, the pas woon sen noodels tasted like rice noodles soaked in soy sauce. The highlight of the meal was definitely the thai iced tea! Wouldn't recommend any of the other 2 dishes at all.\n\nThe service was horrible throughout our meal; they never asked us how our food was or filled up our water glasses. To top all of that, there was a huge-cockroach looking bug roaming around the floor of the restaurant. To say the least, I will not be returning and don't recommend this place.", "rating": 1, "date": "2014-10-06"}], "kai soy noodles": [], "pad seew noodles": [], "pad kee mao noodles": [{"excerpts": ["My Pad Kee Mao noodles were perfection.  "], "author": "Christina L.", "review": "WARNING:  Do not underestimate the spiciness of the NAKED LADIES.  Your mouth and tongue will experience an excruciating and extreme burning sensation.\n\nJust thinking about the naked ladies makes my tongue burn with the residual memory of the spicy hotness of the Thai chili peppers.  If you order naked ladies, you'll get some raw shrimp covered with minced garlic, onions, and other garnishments, drizzled with the chef's spicy lime dressing.  There's also a side of this dressing served on the side, in case you really want to feel the burn, and perhaps ruin your ability to eat anything else.  They use Thai chilies that have a slow, long burn.\n\nNOTE, however, that you can ask them to tone down the hotness.  Friends of ours arrived after us, and ordered the naked ladies, but asked that they make it not as spicy after watching us guzzle down glasses of water (and for one friend, multiple glasses of water, and finally a glass of milk).  Their naked ladies weren't as spicy.\n\nAll the other food we ordered was good.  My Pad Kee Mao noodles were perfection.  The rice dishes were just so-so, but I can't give an accurate review of the other dishes because my tongue was still burning after the naked ladies for most of the meal, and right after the naked ladies, it actually kinda hurt to put food on my tongue.\n\nAll in all, I will come back for some more naked ladies.  Next time, though, I'll probably ask them to tone down the spiciness of the naked ladies, so I can better taste the other food.", "rating": 4, "date": "2012-03-08"}], "radna noodles": [], "sukiyaki noodles": [], "pork leg stew noodles soup": [{"excerpts": ["Pork Leg Stew Noodles Soup\n", "Soup: ", "soy sauce based is main taste\n", "Pork Leg: ", "Meat dry,dry dried up or mushy fat floating on top or very slippery fatty skin\n", "Vegetable: mustard cabbage 1 clump wilted spoiled taste discovered three chews in\nNoodles: nice texture \n  ", "I had to the stewed pork leg and rice as a delivery item before ", "and it was juicy and tender. \n", "Dining at the restaurant on a previous occasion, I thought the restaurant just had one slip up when My friend had ordered this same soup and thought the meat was very dry. ", "Now as a delivery the same inedible experience: Apparently their chosen meat for the \"pork leg stew noodle soup\" is jerky dry, over cooked pork and loose fat. ", "Definitely not going to order it again.\n", "Ive been happy with many other menu items however.\n", "Tip: When ordering Yelp Delivery, best to call and remind them to include eating utensils and napkins also confirm any added notes to your online/YelpDelivery order. ", "(They offer to send driver back, but c'mon who wants to go through all that?)"], "author": "S S.", "review": "This review is on DELIVERY:\nPork Leg Stew Noodles Soup\nSoup: soy sauce based is main taste\nPork Leg: Meat dry,dry dried up or mushy fat floating on top or very slippery fatty skin\nVegetable: mustard cabbage 1 clump wilted spoiled taste discovered three chews in\nNoodles: nice texture \n  I had to the stewed pork leg and rice as a delivery item before and it was juicy and tender. \nDining at the restaurant on a previous occasion, I thought the restaurant just had one slip up when My friend had ordered this same soup and thought the meat was very dry. Now as a delivery the same inedible experience: Apparently their chosen meat for the \"pork leg stew noodle soup\" is jerky dry, over cooked pork and loose fat. Definitely not going to order it again.\nIve been happy with many other menu items however.\nTip: When ordering Yelp Delivery, best to call and remind them to include eating utensils and napkins also confirm any added notes to your online/YelpDelivery order. (They offer to send driver back, but c'mon who wants to go through all that?)", "rating": 2, "date": "2017-05-08"}, {"excerpts": ["While these are my favorites I always add something like Pad Thai, Pad Se-Ew, Fried Rice, the Pork Leg Stew Noodles Soup, etc. ", "Also, their crispy pork belly is good but not as good as Ler Ros. ", "House of Thai has a huge menu and I love ordering a one or two of my favorites and then trying something new as well. ", "I've yet to be disappointed. ", "I love every meal I get from House of Thai ", "(and you should too)."], "author": "Vivian A.", "review": "I seriously haven't written a Yelp review for my favorite Thai place in Little Saigon? \n\nI've been getting House of Thai delivered for over a year now. It's without a doubt my most patronized Thai restaurant in SF. Ler Ros gets an honorable mention for being awesome as well and also highly frequented. Though I've never actually been inside House of Thai. Being the lazy and apartment dwelling bum that I am I get House of Thai delivered.\n\nFavorites include:\nPo Tak Soup - Jam packed full of sea critters. I get it almost every time. It's especially perfect on a cold day, or when you're sick.\n\nLarb Salad - Get it with duck, you won't be disappointed. I love this one!\n\nPla Mauk Tod - Perfect appetizer, I always ask for a 2nd sweet and sour sauce and one time I even got one!\n\nNuer Kem - All dat protein. This is the kinda thing I add to my order just to meet the delivery minimum but then it makes a perfect snack later or the next day.\n\nMint Lemonade - So good! And if you're the type to booze, it mixes really well with vodka. \n\nThai Iced Tea - It's Thai iced tea\n\nWhile these are my favorites I always add something like Pad Thai, Pad Se-Ew, Fried Rice, the Pork Leg Stew Noodles Soup, etc. Also, their crispy pork belly is good but not as good as Ler Ros. House of Thai has a huge menu and I love ordering a one or two of my favorites and then trying something new as well. I've yet to be disappointed. I love every meal I get from House of Thai (and you should too).", "rating": 5, "date": "2014-06-25"}], "kao padwok fried rice": [], "kao pad nam fried rice": [], "kao pad gang khew fried rice": [], "pad grapaw": [], "pad king rice plate": [], "pad himmaparn": [{"excerpts": ["We ordered pineapple fried rice, pad himmaparn, and pad prik king. ", "Really flavorful food! ", "We ordered Roti for dessert, which turned out to be yummy."], "author": "Prateek J.", "review": "Right off the bat, let me say that the service here is delightful. We ordered pineapple fried rice, pad himmaparn, and pad prik king. Really flavorful food! We ordered Roti for dessert, which turned out to be yummy.", "rating": 5, "date": "2018-10-22"}, {"excerpts": ["Pad Himmaparn with fried tofu and ", "it was super good.  ", "This doesn't happen all the time in regards to vegetarian dishes, but the vegetables were all cooked perfectly- ", "none overdone, none underdone.   ", "I asked for it spicy and it was spiced perfectly.   ", "The service is great too.  ", "I tend to drink a LOT of water with meals ", "so I'm constantly looking around for the wait staff to pour me more but my water glass never reached the half full (or empty) because the staff was always there to top it off! ", ":)"], "author": "Daisy A.", "review": "YUM!  I ordered (I think? looking back on the menu...) Pad Himmaparn with fried tofu and it was super good.  This doesn't happen all the time in regards to vegetarian dishes, but the vegetables were all cooked perfectly- none overdone, none underdone.   I asked for it spicy and it was spiced perfectly.   The service is great too.  I tend to drink a LOT of water with meals so I'm constantly looking around for the wait staff to pour me more but my water glass never reached the half full (or empty) because the staff was always there to top it off! :)", "rating": 5, "date": "2014-05-20"}], "pad kana": [], "pad gratiem": [], "pad ponggaree": [], "pad makeur": [], "ka moo": [{"excerpts": ["* KA MOO ($11) - 3.5/5\n[pork leg stew, served w/ spicy secret sauce, jasmine rice]\n", "Seeing ka moo on the menu reminded me of an amazing plate of pork leg stew I had in Thailand a few years ago and made me crave it again, especially since I don't see it a lot at Thai restaurants. ", "Like the papaya salad, their ka moo was on the sweet side, but the pickled mustard greens gave it some tangy flavor. ", "The pork was a little dry/overcooked in some parts ", "and it was probably half meat, half skin/fat. ", "The rice is definitely needed to soak up all the fat."], "author": "Jessie L.", "review": "TLDR - Not a top pick for Thai food, unless you're into overly sweet flavors\n\nI ordered delivery through UberEats so this review is for delivery only. Food was very average. Maybe below average actually. If you're a fan of sweeter palates for Thai food, House of Thai might be up your alley. A lot of Thai spots I've been to tend to be on the sweet side, but I found both dishes that I ordered here to be overly sweet and couldn't even compare to the authentic food I've had in Thailand.\n\n* SOM TOM PU ($10) - 3/5\n[salted crab, shredded green papaya, green bean, tomatoes, garlic, fresh chili, lime dressing]\nA lot of people judge Thai restaurants based on pad thai, but I like to use papaya salad as a basis for comparison. Theirs was way too sweet for me and was missing the complex flavors I like in papaya salads. No acidity and not that spicy. The only saltiness came from the salted crab. I usually get papaya salad with shrimp but decided to try the crab version, and I think I'd stay with the shrimp version in the future. I wasn't really fond of the crab so I ended up not eating it. \n\n* KA MOO ($11) - 3.5/5\n[pork leg stew, served w/ spicy secret sauce, jasmine rice]\nSeeing ka moo on the menu reminded me of an amazing plate of pork leg stew I had in Thailand a few years ago and made me crave it again, especially since I don't see it a lot at Thai restaurants. Like the papaya salad, their ka moo was on the sweet side, but the pickled mustard greens gave it some tangy flavor. The pork was a little dry/overcooked in some parts and it was probably half meat, half skin/fat. The rice is definitely needed to soak up all the fat.", "rating": 3, "date": "2017-07-07"}, {"excerpts": ["- KAO KA MOO - Pork Leg Stew over Rice with Special Secret Sauce...", "$8.00\n", "(http://www.yelp.com/biz_photos/house-of-thai-san-francisco-2?select=JTOkkAc_mEeocpOAh_zbWA#0luta6DtQBDq9NyJ5k8raA)\n", "While the dish looked great (albeit seemingly smaller than in the photos on Yelp), I have mixed feelings.  ", "The pork was amazingly tender, and the taste was pretty good.  ", "However, it was a little heavy on the herbs, and the dipping sauce was very sweet.\n \n", "Although I wasn't as impressed with the Pork Leg Stew as others, I did get to try their Chan Pad Poo (spicy crab noodles) ", "and it was pretty solid.  "], "author": "Mike L.", "review": "When my friend told me there was a Thai restaurant in the TL that was just as good as Lers Ros but without the lines, I was pretty stoked to check them out.  As much as I love Lers Ros, it sucks that they're always so busy!\n\nGiven how my friend sold me on House of Thai's typical lack of lines, it was quite ironic that we ended up having to wait about 15-20 minutes for a table (it was an abnormally busy night downtown/in the TL).  Not a big deal, but it seemed like the rest of the service went a little slow.  In particular, there was a drag before our first plate came out.  Then again, maybe we were just that hungry...\n\n- TOONG GYEN YUNG - Minced Chicken, Onion, Carrot and Potatoes wrapped in a \"Golden Bag\" with Cucumber Salad...$7.00\n(http://www.yelp.com/biz_photos/house-of-thai-san-francisco-2?select=JTOkkAc_mEeocpOAh_zbWA#irdePvDg5INkeflnlVwMAQ)\nMy friend ordered it for the table to share since it's one of her favorites.  The \"pouch\" is essentially a dumpling skin that's been tied off and baked.  Kind of a neat idea, and it really was tasty, but it's not something I would crave for either.  \n\n- KAO KA MOO - Pork Leg Stew over Rice with Special Secret Sauce...$8.00\n(http://www.yelp.com/biz_photos/house-of-thai-san-francisco-2?select=JTOkkAc_mEeocpOAh_zbWA#0luta6DtQBDq9NyJ5k8raA)\nWhile the dish looked great (albeit seemingly smaller than in the photos on Yelp), I have mixed feelings.  The pork was amazingly tender, and the taste was pretty good.  However, it was a little heavy on the herbs, and the dipping sauce was very sweet.\n \nAlthough I wasn't as impressed with the Pork Leg Stew as others, I did get to try their Chan Pad Poo (spicy crab noodles) and it was pretty solid.  The flavors were spot on, and they weren't kidding when they said it was spicy - just the way I like it!\n\nStill, until I get the chance to try more of their food, I'm rounding down from THREE AND A HALF STARS for now.  The menu certainly has potential, but I feel like I can get some of these dishes elsewhere (Amphawa on Geary has a similar Chan Pad Poo, and it's both closer and easier to park by).  Plus, since I don't frequent the TL often, I'd rather head over to Lers Ros to make the trip worthwhile.", "rating": 3, "date": "2013-04-18"}, {"excerpts": ["Pork stew (ka moo) ( our favorite)\nMinced pork\n\n"], "author": "Jie C.", "review": "My Thai friend recommended me this place because they have really amazing and authentic Thai food.\n\n\nWe ordered: \n\nPapaya salads (second favorite)\nFried fish appetizer (tod mun pla)\nGreen curry chicken (best green curry I have ever had)\nPork stew (ka moo) ( our favorite)\nMinced pork\n\nThey are all super delicious! Probably the best Thai food I have ever had. I can't wait to go back again!", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["The five stars is for the Ka Moo here. ", "Ka moo is a perfect trinity of stewed pork shank, served over rice, with pickled mustard greens on the side.\n\n"], "author": "C C.", "review": "The five stars is for the Ka Moo here. The rest of the dishes are around 3-4.\n\nKa moo is a perfect trinity of stewed pork shank, served over rice, with pickled mustard greens on the side.\n\nEach spoonful of this tender meat, stewed in a base of soy sauce and star anise further deepened by the pork shank, is barely held together by the collagen that has already slightly thickened the broth. This is further enhanced by the vinegary spicy dipping sauce, a piquant high note cutting through the undertone of sweetness and fattiness. The rice, rich from soaking up all the stewing juices, dulls the spiciness of the dipping sauce, and the pickled mustard provides a welcomed textured contrast to the rest of the dish.\n\nIf one pork dish is not enough for you, there's also the Moo Tod, golden-crispy outside and tender inside, with a sweet-sour dipping sauce.\n\nAll the fried rice are good, but I have a special fondness for the shrimp paste fried rice. Not everyone's thing, but if you like shrimp paste, you might want to try this.", "rating": 5, "date": "2014-08-27"}, {"excerpts": ["Our favorites are Chan Pad Poo, Ka Moo, Som Tum, and Pad Prig King with Crispy Pork. ", "The food tastes as authentic as it can get in the US, and the service is top notch."], "author": "Pim D.", "review": "I came here with family and the food was excellent. Our favorites are Chan Pad Poo, Ka Moo, Som Tum, and Pad Prig King with Crispy Pork. The food tastes as authentic as it can get in the US, and the service is top notch.", "rating": 5, "date": "2015-05-21"}, {"excerpts": ["Kao Ka Moo - Slow cooked stewed pork leg with sour pickled veggies and fresh chili garlic sauce.  "], "author": "Joanne G.", "review": "Kao Ka Moo - Slow cooked stewed pork leg with sour pickled veggies and fresh chili garlic sauce.  Get this with a side of rice and you have the absolute perfect comfort food.\n\nOther dishes here are good too, but lately I've been favoring Lers Ros over THE for authentic just-like-in-Thailand Thai.", "rating": 4, "date": "2010-01-25"}, {"excerpts": ["(Kao Ka Moo) there. \n\n"], "author": "Miss Bonnie B.", "review": "Solid but the last time we went, it wasn't as good as we remembered.\n\nWe love the spicy crab pad thai (Chan Pad Poo and the stewed pork  (Kao Ka Moo) there. \n\nWish this place was located somewhere less ghetto... maybe they should open one in the south bay.  =)", "rating": 4, "date": "2012-01-05"}, {"excerpts": ["Kau Gai Noodles - always delicious\n- Lad Nah noodles - very good\n- Kao Ka Moo, rice top with pork leg - very good\n\n"], "author": "Cholada C.", "review": "We ordered 7 dishes last night and liked them all.\n\n- Fish Cake - very good\n- Papaya Salad - the best\n- Thai Style Beef Jerky - very salty\n- Thai Style Bamboo Salad - too salty\n- Kau Gai Noodles - always delicious\n- Lad Nah noodles - very good\n- Kao Ka Moo, rice top with pork leg - very good\n\nThe price is reasonable.\nAll the waitresses were very nice and attentive.\nThis is the place we always go to when we are in the city.", "rating": 4, "date": "2013-10-04"}, {"excerpts": ["Kao Ka Moo (special pork leg stew over rice) - Very similar to my dad's Chinese style pork feet dish!!  ", "The only difference is that incredibly spicy chili sauce that comes on the side.  ", "Use the sauce but do NOT eat the chilis--my mouth was burning for 5 minutes straight ", "and I almost cried when I realized I had no milk in my fridge.  ", "This is a huge portion--lots of pork and lots of rice--so be hungry.  "], "author": "Shannon L.", "review": "This ain't your Americanized Thai restaurant!!!  This is authentic as it gets in the states.  I am soooooooooo glad I decided to come here last minute for take-out because I will definitely be coming back.\n\nI asked the waitress which non-beef appetizer she recommended and she suggested the Por-Pier Sod (fresh rice paper rolls stuffed with Chinese sausage, egg, tofu, cucumber; topped with crab meat and sweet and sour tamarind sauce).  This was EXCELLENT.  The rice paper had the perfect texture...not too flimsy or too hard from being undercooked.  I was initially hesitant on the tamarind sauce but it was light and sweet--usually it's too sour.  I definitely recommend that you get this.\n\nBeef Noodle Soup (noodle soup with sliced beef, beef balls, beef strew & tripe) - This was ok.  I probably wouldn't order it again.  The bf thinks there might be some MSG in it.  With noodle soups, you can get them with flat rice noodles, rice stick noodles, vermicelli or egg noodles.  I got flat rice noodles for both this and the dish below and they were great.\n\nTom Yum Noodle Soup (hot spicy noodle soup with ground pork, slice pork, pork balls and peanuts) - If you are pretty good with spiciness, GET THIS IN MEDIUM.  This was my favorite dish out of all the ones we ordered.  It has such a deep and rich flavor.  And the peanuts and cilantro make the noodles smell so fragrant.  I'm normally not a fan of anything tom yum but this has changed me forever.\n\nKao Ka Moo (special pork leg stew over rice) - Very similar to my dad's Chinese style pork feet dish!!  The only difference is that incredibly spicy chili sauce that comes on the side.  Use the sauce but do NOT eat the chilis--my mouth was burning for 5 minutes straight and I almost cried when I realized I had no milk in my fridge.  This is a huge portion--lots of pork and lots of rice--so be hungry.  It comes with a side of pickled veggies.\n\nThai House Beef (marinated beef broiled to order; served with chef's secret sauce) - The \"secret sauce\" is actually cilantro based and almost belongs in a Mexican restaurant.  It does go well with it.  The beef was tender and I'm thinking it would've tasted better in the restaurant; our 30 minute drive home probably dried it out a little.\n\nOrdering and getting take-out only took about 15 minutes total!  That's what I call quick service.  The total for 5 dishes was about $40.  I'm so glad there's a Thai restaurant with more than your typical Pad Thai and Thai Basil dishes.  Everything comes in really cute lunch type, plastic take-out boxes.  I think that's what this is meant to be... fast Thai food.  If I worked in the area, I would eat here all the time!", "rating": 5, "date": "2008-10-25"}, {"excerpts": ["#39 - Pad Woon Sen (Silver Noodles)\n#40 - Kao Ka Moo (Stewed Pork Leg)\nPineapple Fried Rice\n\n"], "author": "H. L.", "review": "My new Thai take-out place!  Typically we get these items:\n\nRed Curry with Pumpkin\nPad Thai\n#39 - Pad Woon Sen (Silver Noodles)\n#40 - Kao Ka Moo (Stewed Pork Leg)\nPineapple Fried Rice\n\nThe food is cheap and delicious!  They're also open late!  AWESOME!", "rating": 5, "date": "2010-05-25"}, {"excerpts": ["We also love the Kao Ka Moo, Gai Yang, papaya salad, pad thai and the Larb is especially good.\n\n"], "author": "Lyn s.", "review": "I love this place, but sadly they no longer deliver to my neighborhood.  \nThis was the best delivery Thai I've had. The pumpkin curry is awesome, but can be *very* spicy. We also love the Kao Ka Moo, Gai Yang, papaya salad, pad thai and the Larb is especially good.\n\nI so miss this place.", "rating": 5, "date": "2013-02-06"}, {"excerpts": ["Kao ka moo - slow cooked pork leg with picked veggies...."], "author": "Katie K.", "review": "It gets high marks for being open till midnight daily!\n\nStill reviewing about the place I hit last year after reading about the Yelp 2008 list - http://yelp.typepad.com/files/100bestchecklistsf-1.pdf\n\n#48. Kao ka moo - slow cooked pork leg with picked veggies....it is so good with the garlic sauce over rice making me feel like my mom was working in that kitchen \n\nOther dishes we tried:\n- Tom Ka Gai - creamy traditional chicken sour soup with coconut milk that warms my soul\n- Eggplant and Shrimp - great dish with a good heat us Chinese call \"wok hay\".....it is a good thing\n- Yum Shanghai - didn't know what to make of this with clear bean noodles stir-fry with meat but was a good combo\n\nI can't wait to start my softball season again so I have an excuse to venture out to the TL.", "rating": 4, "date": "2010-01-14"}, {"excerpts": ["It's Kao Ka Moo. ", "Pork leg stew over rice. ", "Also ordered Som Tum and Roti. ", "This pork leg stew is pretty good. ", "Reminiscent of a chinese-filipino called Pata Tim. ", "When I ordered it, the waitress asked me \"Is fat ok?", "\" ", "I of course said yes. ", "You can't eat pork leg stew without the fat. ", "I'm sold. ", "I love it. "], "author": "Ryan B.", "review": "Went here today for lunch. I've learned about a new thai dish I haven't tried yet. Sai Jai Thai doesn't have it so the waitress told me to go here since they have it.\n\nIt's Kao Ka Moo. Pork leg stew over rice. Also ordered Som Tum and Roti. This pork leg stew is pretty good. Reminiscent of a chinese-filipino called Pata Tim. When I ordered it, the waitress asked me \"Is fat ok?\" I of course said yes. You can't eat pork leg stew without the fat. I'm sold. I love it. It came with what I think some kind if pickled vegetable and a garlic chili vinegar sauce on the side.\n\nSom Tum was ok and you can't really go wrong with the roti dessert. They have a special on the white board that caught my attention. Spicy Crispy Skin-Pork. They said it's roasted 3 layered pork. I instantly knew what it was. Pork-Fat-Skin. Similar to the Filipino Lechon except maybe thai style. I'm gonna come back again to try that dish.", "rating": 4, "date": "2009-09-07"}, {"excerpts": ["We always order the Kao Ka Moo, which is the stewed pork leg over rice.  ", "This Chinese-y dish comes with a couple of spicy dipping sauces and \"zha cai\" (picked mustard greens).  ", "The pork leg, which is stewed in a five-spice sauce, is extremely tender.  "], "author": "Anna S.", "review": "Thai House Express is probably one of the few authentic Thai restaurants in the city.  I lived/worked in Thailand for 6 months so I had my share of Thai food.  We always order the Kao Ka Moo, which is the stewed pork leg over rice.  This Chinese-y dish comes with a couple of spicy dipping sauces and \"zha cai\" (picked mustard greens).  The pork leg, which is stewed in a five-spice sauce, is extremely tender.  I've seen this dish in one other Thai restaurant in the city but this is the gold standard.\n\nWe also like the pad thai with crab meat, which is not too sweet and contains fresh crab. The mango with sticky rice is excellent here.", "rating": 4, "date": "2009-04-01"}, {"excerpts": ["#40 Kao Ka Moo - Pork Leg Stew over Rice ", "- I am a sucker for braised meat and this is fantastic!   "], "author": "Lainie L.", "review": "RESTAURANT CUSTODY AGREEMENT\n\nLainie L. (Party A) and  Future Heart Breaker Scumbag (Party B), do hereby agree that each restaurant they bring into the relationship shall be in the sole custody of the person who brings the restaurant into the relationship.  Dissolution of relationship shall render all future visits by Party B null and void.\n\nAGREED that Party B shall never, ever bring new girlfriend to restaurant so that our regular waitress does not ask Party A if new girlfriend was Party B's sister.\n\nSo on and so forth. . . \n\nAll right, so I love restaurants. . .I search out great ones and make them my regular spots.  Thai House Express is a favorite.  They have great food and had really late night hours (they close at midnight now - boooooooo!).  I brought my last boyfriend here and he loved it.  He'd bring all his chef buddies and show off how they knew us and what kick ass food they had.  When we  broke-up he got custody of the restaurant by geographical default. . he ended up living four blocks away and began frequenting MY restaurant quite often.  \n\nHe recently moved so now I got custody back. . . and boy, did I miss my Thai House Express.  \n\nOne of the things I love about it is that they have dishes that not every Thai restaurant has - and they do them very well.  My favorites are #1 Toong Gern Yueng - little, fried, chicken dumplings.  They are so cute and delicious.  #15 - Som Tum Thai - green papaya salad.  They make a really tasty Larb (I like chicken best).  #40 Kao Ka Moo - Pork Leg Stew over Rice - I am a sucker for braised meat and this is fantastic!   Along the same lines is #43 - Kao Moo Dang which is roasted pork over rice with this yummy gravy saucy stuff.  My most favorite thing is #72 Kao Pad Nam - the waitress might try to persuade you not to order this dish as it features a Thai sausage that apparently most American eaters do not like.  .do not listen to her. . .it's so delicious!  The sausage, rice, cilantro and Chinese broccoli all meld together with chili sauce and it's one of my favorite Thai dishes.  \n\nAlways check out the white board - there are sometimes some phenomenal specials - one of the best is the pork leg noodle soup with pickled mustard greens, duck larb or Thai won tons.  \n\nIt is not your normal TL hole in the wall - it's clean, kind of hip and funky and comfortable.  If you go to Thai House Express - steer away from the usual suspects (pad Thai, etc.) and try something you've never had. . .I think you'll be happy.   They only get four  stars because their curries are a little weak and I once had to witness someone's naked package pancaked against the window (it's in the heart of  the TL . . it can happen).  \n\nI am just happy to get back custody of MY restaurant!", "rating": 4, "date": "2006-12-12"}, {"excerpts": ["Kao Ka Moo.  ", "This is the place to get adventurous.  "], "author": "suckafree c.", "review": "this place rocks.  If you ask for spicy - it's real.  no joke.\n\ni think the non noodle dishes are the stand outs.  Kao Ka Moo.  This is the place to get adventurous.  I did order the raw sausage - it was a bit too adventurous for me.\n\nall in all best thai in town - marnee and osha are close seconds.", "rating": 5, "date": "2008-04-21"}, {"excerpts": ["As many before me have avowed, the kao ka moo is so, so very good. "], "author": "Candice L.", "review": "Both T.H.E.'s are great resources for dishes other than the run of the mill pad Thai and curries. They are also beloved b/c they stay open decently late, pack one hell of a ~spicy~ punch, and are totally affordable. As many before me have avowed, the kao ka moo is so, so very good. Never has a menu description given less away, \"special pork leg stew\" doesn't even begin to offer a hint of the tender fattiness that awaits you (I prefer this a la carte as opposed to over rice). \n\nEvery so often I forget how searingly hot \"spicy\" can actually be. Green papaya salad and pad kee mao ordered spicy have left my lips burnt in that hurts so good kind of way. I think medium spicy to spicy is the optimal range. Last time we tried the sai oou too, b/c deep fried pork sausage intrigued. The links are actually quite good, with interesting herbs and bits of fresh cilantro mixed in. I'll opt to try something new on the next round though.", "rating": 4, "date": "2006-12-26"}, {"excerpts": ["The best dish is definitely: #40 Kao Ka Moo - pork leg stew over rice. ", "OMG, it is SOOOOO good. ", "I'm not even a huge pork fan but this dish is really something. ", "It's so tasty! ", "The only one dish I've been disappointed with is the cat fish salad - not sure there was really cat fish in it. ", "I'll let it slide because the Kao Ka Moo makes up for this and more."], "author": "Barney M.", "review": "This place is goooooood! They seem to have more variety than most Thai places but what do I know - I'm Chinese. Seriously, almost everything I've had here is really good and the prices are very reasonable.\n\nThe best dish is definitely: #40 Kao Ka Moo - pork leg stew over rice. OMG, it is SOOOOO good. I'm not even a huge pork fan but this dish is really something. It's so tasty! The only one dish I've been disappointed with is the cat fish salad - not sure there was really cat fish in it. I'll let it slide because the Kao Ka Moo makes up for this and more.", "rating": 4, "date": "2007-05-01"}, {"excerpts": ["After reviewing many ChowHound and Yelp reports, here's what we ordered from the blogs recos: Kao Ka Moo (Stewed Pork Leg over Rice), Shrimp Paste Fried Rice and the House Special Pumpkin Curry with Chicken (which was a special that day).\n\n"], "author": "Tai K.", "review": "So my friend Jas and I were on our merry way to the Tenderloin for what reviewers were calling \"the most authentic Thai food in San Francisco.\" We had Doris Day parking karma and found a spot 20 feet away on Larkin when we arrived.\n\nThe decor is really non-descript but the smells coming from the kitchen were fab. After reviewing many ChowHound and Yelp reports, here's what we ordered from the blogs recos: Kao Ka Moo (Stewed Pork Leg over Rice), Shrimp Paste Fried Rice and the House Special Pumpkin Curry with Chicken (which was a special that day).\n\nStewed Pork Leg Over Rice (3 stars out of 5)\nOverall, I enjoyed this subtle dish. It's very similar to the one my mom makes except she cooks with pork hock (read pigs feet). Me thinks this is really an Ethnic Chinese dish as it's prevalent in Chinese deli places all over SoCal. It is stewed with dark superior soy, ginger, garlic, sugar and star of anise. The skin has a deep complex flavor with that smokey soy and unmistakable flavor that only comes from star of anise after countless hours of stewing. It's served over rice with a clear broth that's been mixed in with the stewing liquid. The issue I have is that the broth was bland and really dumbed down the stewing liquid since they added too much of it. But I think I'm hardcore cause the version my mom makes is 10 times more flavorful and would give mainstream eaters an aneurysm.\n\nShrimp Paste Fried Rice (2.5 stars out of 5)\nOK, maybe I'm a food snob but I was disappointed with this dish because the name is misleading. Jas and I both agreed that the quality of the ingredients were really fresh and it was nicely presented. However, we could not taste any hint of Shrimp Paste in this dish! It was good \"Shrimp Fried Rice\" but where's the friggin' paste? And it was a tad greasy to boot (unforgiveable for good fried rice). Shrimp Paste is one of those things that if you cook with it, your entire apartment building will know because it will smell like you picked up a beached whale and it's been sitting in your hot humid apartment for a good month or so. But oh, the taste! It's one of those Stinky Tofu experiences - if you can relate. If you can't, ping me and I'll take you for some stinky tofu. Next time, if we order it, we'll ask for extra shrimp paste. I think it was dialed down for the Western audience. \n\nChicken Pumpkin Curry (2.5 stars out of 5)\nI never had Pumpkin Curry with so much Lemon Grass before. And they used white meat. Sorry, we don't know any \"authentic\" Asian restaurant that uses white meat. The meat was so dense, overcooked and fat-less that it just can't absorb the flavor of the sauce or curry.  I think it was fine but OSHA's version is much better. Smokey and complex with a million grams of fat from the coconut milk. I'm not a huge OSHA fan unless I'm expensing it but they do a couple of dishes really well like the Pumpkin Curry and Crispy Pork.\n\nOVERALL:\nI think this is a good Thai restaurant. They have some dishes that just do not exist on other menus but I think it's very overhyped. If I lived in the Tenderloin, I would totally come here for quick take-out.", "rating": 3, "date": "2008-08-10"}], "moo dang": [{"excerpts": ["Along the same lines is #43 - Kao Moo Dang which is roasted pork over rice with this yummy gravy saucy stuff.  ", "My most favorite thing is #72 Kao Pad Nam - the waitress might try to persuade you not to order this dish as it features a Thai sausage that apparently most American eaters do not like.  ", ".do not listen to her. . ", ".it's so delicious!  "], "author": "Lainie L.", "review": "RESTAURANT CUSTODY AGREEMENT\n\nLainie L. (Party A) and  Future Heart Breaker Scumbag (Party B), do hereby agree that each restaurant they bring into the relationship shall be in the sole custody of the person who brings the restaurant into the relationship.  Dissolution of relationship shall render all future visits by Party B null and void.\n\nAGREED that Party B shall never, ever bring new girlfriend to restaurant so that our regular waitress does not ask Party A if new girlfriend was Party B's sister.\n\nSo on and so forth. . . \n\nAll right, so I love restaurants. . .I search out great ones and make them my regular spots.  Thai House Express is a favorite.  They have great food and had really late night hours (they close at midnight now - boooooooo!).  I brought my last boyfriend here and he loved it.  He'd bring all his chef buddies and show off how they knew us and what kick ass food they had.  When we  broke-up he got custody of the restaurant by geographical default. . he ended up living four blocks away and began frequenting MY restaurant quite often.  \n\nHe recently moved so now I got custody back. . . and boy, did I miss my Thai House Express.  \n\nOne of the things I love about it is that they have dishes that not every Thai restaurant has - and they do them very well.  My favorites are #1 Toong Gern Yueng - little, fried, chicken dumplings.  They are so cute and delicious.  #15 - Som Tum Thai - green papaya salad.  They make a really tasty Larb (I like chicken best).  #40 Kao Ka Moo - Pork Leg Stew over Rice - I am a sucker for braised meat and this is fantastic!   Along the same lines is #43 - Kao Moo Dang which is roasted pork over rice with this yummy gravy saucy stuff.  My most favorite thing is #72 Kao Pad Nam - the waitress might try to persuade you not to order this dish as it features a Thai sausage that apparently most American eaters do not like.  .do not listen to her. . .it's so delicious!  The sausage, rice, cilantro and Chinese broccoli all meld together with chili sauce and it's one of my favorite Thai dishes.  \n\nAlways check out the white board - there are sometimes some phenomenal specials - one of the best is the pork leg noodle soup with pickled mustard greens, duck larb or Thai won tons.  \n\nIt is not your normal TL hole in the wall - it's clean, kind of hip and funky and comfortable.  If you go to Thai House Express - steer away from the usual suspects (pad Thai, etc.) and try something you've never had. . .I think you'll be happy.   They only get four  stars because their curries are a little weak and I once had to witness someone's naked package pancaked against the window (it's in the heart of  the TL . . it can happen).  \n\nI am just happy to get back custody of MY restaurant!", "rating": 4, "date": "2006-12-12"}, {"excerpts": ["The Kao Moo Dang is great but the portions were small and only served to build up our appetite."], "author": "Danny K.", "review": "The food's pretty good, the service not so much. The Kao Moo Dang is great but the portions were small and only served to build up our appetite.", "rating": 3, "date": "2011-09-20"}], "gai tom": [], "gai tod": [{"excerpts": ["Ordered Pad Kee Mao w/ beef and a side order of Peak Gai Tod (chicken wings). ", "The food was excellent, and the order was ready and hot when I picked it up. ", "Would've been 5 stars if the chicken wing pieces were separated from the tips!"], "author": "Mario A.", "review": "Ordered Pad Kee Mao w/ beef and a side order of Peak Gai Tod (chicken wings). The food was excellent, and the order was ready and hot when I picked it up. Would've been 5 stars if the chicken wing pieces were separated from the tips!", "rating": 4, "date": "2017-08-09"}, {"excerpts": ["Other notables include the Pad Kee Mao Noodle (can be super spicy depending on how you order it) and the Gai Tod. "], "author": "Taylor B.", "review": "One of my favorites in the area. I have eaten at House of Thai in the restaurant and through delivery at least twenty times over the past year and I am consistently pleased with the food and service. The staff is friendly and quick to get people seated even on busy nights, and the food and drink prices are very good. Delivery is always prompt and generally beats the Eat24 time estimates, but that may be in part because I live close by. \n\nOur normal orders are typically the Moo Tod crispy pork, the Gang Ga-Ree Gai yellow curry and the pad thai. Other notables include the Pad Kee Mao Noodle (can be super spicy depending on how you order it) and the Gai Tod. We generally order two of the above a la carte and add one or two orders of the garlic rice. \n\nI have tried most of the thai restaurants in the Polk Gulch area and always end up coming back to House of Thai.", "rating": 5, "date": "2015-02-18"}, {"excerpts": ["The Gai Tod and Moo Tod are incredible. ", "Their delivery is the cleanest and most neatly packaged of any delivery I've ordered in the city. ", "You can tell they put care into how they prepare your meal."], "author": "Jeremy S.", "review": "Best Thai delivery in the city. The Gai Tod and Moo Tod are incredible. Their delivery is the cleanest and most neatly packaged of any delivery I've ordered in the city. You can tell they put care into how they prepare your meal.", "rating": 5, "date": "2011-08-01"}, {"excerpts": ["The Peak Gai Tod (Fried Chicken Wings) were freaking amazing though.  "], "author": "Jason K.", "review": "$7.25 for the Pad See Ew, so it's only slightly more than Sai Jai Thai.  It's equally as good so it'd be a toss up.\n\nThe Peak Gai Tod (Fried Chicken Wings) were freaking amazing though.  I would highly recommend getting an order if you eat here.\n\nThey also have quite a bit of specials listed around the restaurant so those would be worth a check next time.\n\nNeed a $10 minimum if you want to use a credit card though.", "rating": 4, "date": "2010-02-04"}, {"excerpts": ["And their Peak Gai Tod (#9, fried chicken wings) just tasted weird.  "], "author": "Lauren C.", "review": "I have become all about this restaurant these last few weeks.  It's a new favorite.  I still particularly adore the Tom Kha Gai.  As a child, I ate tons of this stuff called Lucas.  It's a little shaker full of chili powder, citric acid, salt, and a little sugar.  The overwhelming sour/salty flavor gave me this visceral flavor high when I ate it.  Same with the Tom Kha Gai.  The intensity is almost too much, but it's exquisite.\n\nPad Kee-Mao (#66, spicy noodles with Chinese broccoli) is another favorite of mine.  The Pad King (#76, choice of meat with ginger, carrots, jalapeno, and black fungus) is great for anyone who loves ginger.  I just tried the Gang Panang Nuer (#52, beef in red curry) last night.  It was fantastic and may be my new favorite curry.  The beef had zero fat or gristle.  I've also tried the Roti dessert with ice cream.  It was flaky and wonderful, but I thought the ice cream didn't really mesh with the pancake.  I think it would have been better with some sweetened creme fraiche or as an appetizer with curry dipping sauce.  On its own, however, the coconut ice cream totally rocked.  I've only tried about five different varieties, but this was the best.  \n\nI do have to mention the Por-Pier Sod (#2, rice paper rolls stuffed with sausage, egg, tofu, and cucumber, topped with crab meat and sour tamarind sauce).  It was actually revolting.  I expected a regular cool, refreshing rice paper roll.  What I got was two giant rolls served side by side like a couple of burritos, cut into slices crosswise.  They were served warm (!?!) and were drenched in this gross sweet gravy.  They were disgusting and impossible to eat.  I also dislike their Por-Pier Pak (#4, vegetarian egg rolls).  And their Peak Gai Tod (#9, fried chicken wings) just tasted weird.  Boyfriend joked that maybe they were from Thai chickens and while absurd, it rang true.\n\nEven though I disliked those three dishes, I still adore Thai House Express.  And it's like magic- even though most their dishes cost the same $7-$8 that many other places do, the bill always comes to surprisingly little.  I don't want to know how, I just want to enjoy it.  Before I ate at Thai House Express, I thought that the number of Thai restaurants in the city was seriously ridiculous.  Now I get it.", "rating": 5, "date": "2008-06-23"}, {"excerpts": ["Gai Tod (good, but nothing spectacular)\n-Thai "], "author": "J. L.", "review": "Ordered via Grubhub and while the delivery time frame was an hour, the food came in 20! Here's what we ordered:\n-Gang Ga-Ree Gai (UH-MAZING!)\n-Pad Se-Ew w/ pork (yum!)\n-Peak Gai Tod (good, but nothing spectacular)\n-Thai Iced Tea (zing!)\n\nThe ga-ree gai was so so good! Too bad there were too few goodies & a lot of sauce. The Se-ew noodles were also really good, but I had to hunt for the pork, very few pieces. The Thai iced tea was made with the perfect proportion of half & half and tea. Overall, would definitely order here again AND you can't beat free delivery!", "rating": 4, "date": "2011-09-26"}], "moo grab graw praw": [], "house of thai plum sauce": [], "side of peanut sauce": [{"excerpts": ["Also ordered a side of jasmine rice and sticky rice--- upon recommendation from another reviewer,  we got a side of peanut sauce to dip the sticky rice into. ", "Jasmine was okay--not great--and the sticky rice was tasty. ", "Btw, i think this was your standard thai sticky rice. ", "They also had mango sticky rice on the menu, but, I'm fairly certain this was not the mango variety.  ", "It was very good dipped in the peanut sauce.\n", "One note about the peanut sauce: i was expecting a usual little side of peanut sauce. ", "What i got was a container of sauce which i actually saved for the next day. ", "I think it was around $4. ", "Next time I'll either get more things to dip or pour the sauce over, OR I'll ask for just a couple little condiment-sized peanut sauce containers, rather than a CUP of sauce. \n", "(", "*Note", "* I would've loved some chicken skewers to go with the peanut sauce ", "but i didnt see it anywhere on the menu and forgot to ask.)\n", "The bill came to $28 and change (tipped $6) ", "so...$35 out the door: ", "a bit pricey for one main dish, one appetizer and 2 sides of rice ", "BUT i did add chicken and of course, my small vat of peanut sauce.\n", "Next time we're near the Loin and craving some quick, tasty morsels, I'll definitely remember House of Thai and make a few small adjustments to my order. ", "Overall, a nice thai experience"], "author": "Lanie S.", "review": "Came to SF to see Book of Mormon and stayed in the Tenderloin. We wanted something yummy before the show and House of Thai was right outside our Motel 6 window....read the reviews and immediately called in our order. The lady was very nice on the phone and got everything down correctly. 10 minutes later we walked in, picked up our food (which was expertly packed for take out) trotted back to the motel and commenced to GRUB DOWN. The restaurant itself was clean and bright, with your standard import store decor. \nWe ordered the Pad Thai with chicken (the dish had tofu and shrimp in it by default--we wanted chicken too and there was lots of it!) I forgot to say \"medium heat/spice\" on the phone so i wasnt sure if it would be hot or not. It was NOT spicy--not even a little. Next time I'll definitely ask for a little heat, but its better to error on the side of \"not enough heat\" than to have a dish \"too spicy to eat\"....\nThe pad thai had great flavor and the tofu was very tender but kept its shape in nice little cubes. The chicken was sooooo tasty and the egg was AMAZING too (i love the egg in my pad thai--one of life's little perks!) Fyi, i didnt eat the shrimp--gave them to the BF. There were 3 big shrimp and he said they tasted good. The bean sprouts were placed on top of the dish--fresh and crunchy. (This was helpful, as i only like a few bean sprouts so i hate it when the sprouts are mixed with the pad thai noodles so I must rummage around my dish, pulling out sprouts. Its time consuming and looks janky...)  Props to House of Thai for putting them on top!! The sauce was great and stuck to the noodles, which were cooked perfectly. The pad thai gets a solid '4 stars'. I knocked off a star because i had to add chicken ($) and there was no spice.\nWe also got the #1 Golden Bag appetizer which was my fave thing about the meal. There were 5 deep fried, crunchy bags of goodness each tied with its own little deep fried tie wrapped around the top. The presentation was cool. I should've snapped a pic but ate those little fuckers pretty quick. They're made with minced chicken with excellent flavor, tiny potato cubes and green onion. YUUUMMMMERS.\nThese golden bags get '5 stars' as they were the highlight of the meal. \nAlso ordered a side of jasmine rice and sticky rice--- upon recommendation from another reviewer,  we got a side of peanut sauce to dip the sticky rice into. Jasmine was okay--not great--and the sticky rice was tasty. Btw, i think this was your standard thai sticky rice. They also had mango sticky rice on the menu, but, I'm fairly certain this was not the mango variety.  It was very good dipped in the peanut sauce.\nOne note about the peanut sauce: i was expecting a usual little side of peanut sauce. What i got was a container of sauce which i actually saved for the next day. I think it was around $4. Next time I'll either get more things to dip or pour the sauce over, OR I'll ask for just a couple little condiment-sized peanut sauce containers, rather than a CUP of sauce. \n(*Note* I would've loved some chicken skewers to go with the peanut sauce but i didnt see it anywhere on the menu and forgot to ask.)\nThe bill came to $28 and change (tipped $6) so...$35 out the door: a bit pricey for one main dish, one appetizer and 2 sides of rice BUT i did add chicken and of course, my small vat of peanut sauce.\nNext time we're near the Loin and craving some quick, tasty morsels, I'll definitely remember House of Thai and make a few small adjustments to my order. Overall, a nice thai experience", "rating": 4, "date": "2015-06-07"}], "garlic and ginger rice": [{"excerpts": ["Well, it turned out to be slices steamed white chicken on a mound of garlic and ginger rice. ", "It was accompanied by a soy bean chili sauce (photo: http://bit.ly/1H6lnSJ). ", "The reality was that there was little if any garlic or ginger in the brown rice, and the chicken was a bit dried out from being in the steamer too long. ", "There are plenty more Thai dishes to consider here, so I wouldn't dismiss this place entirely based on my experience. ", "It's just that based on the two dishes I had, they should consider tasting them again to continue refining the flavors. ", "After all, the competition is pretty fierce in this neighborhood for good-tasting Thai. "], "author": "Ed U.", "review": "I'm always up for a plate of steamed chicken. No, I'm not your long-lost Chinese grandmother who head-butts you on MUNI to get a seat. I just happened to like steamed chicken with a little minced garlic and ginger oil for dipping. I'm finally recognizing that I prefer it at old-school Chinese restaurants where I can get a whole chicken cut up and served that way versus Thai restaurants where they make it with less conviction, something that became clear when I tried this place out on the busy corner of Larkin and Geary in the Tenderloin. It's a bustling place in the early evening, but I managed to secure a table quite easily.\n\nGetting service once I sat down was more challenging, but the menu is fairly comprehensive so it took me a while to peruse it. I decided to order the $7 Por-Pier Sod, which sounded like a more carnivorous version of a spring roll since the thick rice paper wrapped Chinese sausage, egg, tofu and cucumber. I liked it enough since it had a nice crunch, although the gloopy sweet and sour tamarind sauce was ladled on far too thick to enjoy (photo: http://bit.ly/1cCGTGL). A proper peanut sauce positioned for optional dipping would have suited me just fine. For my entree, no surprise, I went for the $11 Kao Mun Kai. What is it, you ask?\n\nWell, it turned out to be slices steamed white chicken on a mound of garlic and ginger rice. It was accompanied by a soy bean chili sauce (photo: http://bit.ly/1H6lnSJ). The reality was that there was little if any garlic or ginger in the brown rice, and the chicken was a bit dried out from being in the steamer too long. There are plenty more Thai dishes to consider here, so I wouldn't dismiss this place entirely based on my experience. It's just that based on the two dishes I had, they should consider tasting them again to continue refining the flavors. After all, the competition is pretty fierce in this neighborhood for good-tasting Thai. Lers Ros anyone?\n\nFOOD - 3 stars...pretty average Thai dishes with steamed chicken that left me feeling meh\nAMBIANCE - 3.5 stars...fairly spacious for a 'Loin restaurant with a nice view of the passing derelicts\nSERVICE - 3 stars...fast and barely there\nTOTAL - 3 stars...when is a house not a home?...when it's House of Thai, I guess", "rating": 3, "date": "2015-05-14"}], "side of curry sauce": [], "side of steamed assorted vegetables": [], "the delivery fee may have been increased to comply with the san francisco bag ordinance": [], "fried banana and ice cream": [{"excerpts": ["For you fellas, it is the Fried Banana and Ice cream. ", "Sure to win the hearts of the ladies. ", "I spent most of my time there watching the TV and watching people walk by on the streets."], "author": "Teason M.", "review": "My wife took me to my first Thai Restaurant.\nThe prices were cheap and the food was great. The FBI is always the finisher. For you fellas, it is the Fried Banana and Ice cream. Sure to win the hearts of the ladies. I spent most of my time there watching the TV and watching people walk by on the streets.", "rating": 5, "date": "2011-08-17"}], "sweet sticky rice with egg custard": [], "taro ball": [{"excerpts": ["It's hard to pick favorites, but I'd absolutely recommend any of their curry dishes (Gang Ga-Ree Gai and Pad Pong-Ga-Ree are especially good), Pad Gra-Praw, the beef jerky, Chan Pad Poo (stick noodles with crab), and taro ball soup for dessert.\n\n"], "author": "Carl W.", "review": "This is hands down the best Thai food I've had in SF. I wish I could give 6 stars! I've ordered from this place dozens of times and not once was I let down. It's hard to pick favorites, but I'd absolutely recommend any of their curry dishes (Gang Ga-Ree Gai and Pad Pong-Ga-Ree are especially good), Pad Gra-Praw, the beef jerky, Chan Pad Poo (stick noodles with crab), and taro ball soup for dessert.\n\nAlso, kudos for never arriving late or mixing up any of my delivery orders.", "rating": 5, "date": "2018-08-16"}, {"excerpts": ["Taro ball in coconut milk was awesome.\n\n"], "author": "S N.", "review": "Great food. We had no expectations. Since we were in the area, went in after quickly looking at yelp reviews, but this place was hands down serves easily one of the best thai food in the bay area. You can order without fish sauce for example, they make it very easy and friendly for vegetarians who don't eat egg or fish, besides meat.\n\nTaro ball in coconut milk was awesome.\n\nThey are very busy and open late. Its not super fancy in terms of ambience but certainly superb food.\n\nDefinitely a destination in SF if you are looking for a great Thai food.", "rating": 5, "date": "2018-07-15"}, {"excerpts": ["Also, the taro ball with coconut milk or we call it Bua-loi , it was hella good ", "Must try!! ", "The taste is so Thai"], "author": "Tiratiwan L.", "review": "The staff very friendly and i went there becos craving of fresh roll which stuffed w/ Chinese sausage and it met my desire!!! Also, the taro ball with coconut milk or we call it Bua-loi , it was hella good Must try!! The taste is so Thai", "rating": 4, "date": "2017-06-05"}], "shrimppaste fried rice": [], "pad cha": [], "kha nom jeen": [{"excerpts": ["Secondly, there is a southern thailand regional dish called 'Kha Nom Jeen' which is my favorite. ", "It is fish curry with preserved vegetables over soft vermicelli rice noodles.  ", "That dish reminds me everytime of the well reputed Siam Square food courts  in Bangkok.  ", "Totally authentic, and every flavor as it should be.  ", "Keep in mind that 99% of Thai restaurants in the US do not carry this dish.  ", "So for a Thai food lover, this is a special treat! \r\n\r\n", "A third dish that I like is the grilled chicken with sticky rice.  ", "This dish is particular to the Northeast region of Thailand; ", "Isaan; and it is marinated with honey sauce.  ", "Thai House Express makes this grilled chicken superbly and truly like the one that I had in an Isaan specialty restaurant  in Bangkok.  ", "Not surprisingly, Thai House Express is frequented by Thai students, and American men  who bring along their Thai wives. ", "(Actually I should say it's the opposite; it's the Thai wives who drag their husbands to this restaurant because the food is so much like home).    ", "So, to see so many Thais at this restaurant tells you something about how authentic this place is.\r\n\r\n", "I also like the fact that they do not make the food overtly spicy.  ", "It is moderate/medium in spiciness; and you can add chili powder or green/red chilli sauce over your dish if you so prefer.  ", "Highly recommended; and you'll save yourself the $900 flight ticket  to Thailand."], "author": "Harry C.", "review": "This is the most authentic Thai restaurant that I have found in the United States period.  I have visited Bangkok two times; and Chiang Mai in the North of Thailand once.  I thus  got to eat at the famous street food vendors, and mom and pop restaurants that proliferate these cities; and since both Bangkok and Chiang Mai are the food centers of Thailand, folks who have been to or lived in these two cities know what makes Thai food great.  Thus, Thai House Express is the most authentic Thai restaurant as it is very comparable to Thai food you'll find in Thailand.  \r\n\r\nFor example, the Green Curry Chicken is well balanced and alive with flavor in the coconut milk, and spices.  This reminded me of the green curry chicken I had prepared by a master chef in a cooking school in Chiang Mai (Northern Thailand).  Secondly, there is a southern thailand regional dish called 'Kha Nom Jeen' which is my favorite. It is fish curry with preserved vegetables over soft vermicelli rice noodles.  That dish reminds me everytime of the well reputed Siam Square food courts  in Bangkok.  Totally authentic, and every flavor as it should be.  Keep in mind that 99% of Thai restaurants in the US do not carry this dish.  So for a Thai food lover, this is a special treat! \r\n\r\nA third dish that I like is the grilled chicken with sticky rice.  This dish is particular to the Northeast region of Thailand; Isaan; and it is marinated with honey sauce.  Thai House Express makes this grilled chicken superbly and truly like the one that I had in an Isaan specialty restaurant  in Bangkok.  Not surprisingly, Thai House Express is frequented by Thai students, and American men  who bring along their Thai wives. (Actually I should say it's the opposite; it's the Thai wives who drag their husbands to this restaurant because the food is so much like home).    So, to see so many Thais at this restaurant tells you something about how authentic this place is.\r\n\r\nI also like the fact that they do not make the food overtly spicy.  It is moderate/medium in spiciness; and you can add chili powder or green/red chilli sauce over your dish if you so prefer.  Highly recommended; and you'll save yourself the $900 flight ticket  to Thailand.", "rating": 5, "date": "2006-07-07"}], "kai jeaw moo sub": [], "kao tom pla": [], "guay tiew kua gai": [], "nam prik ong": []}