{"snapple ice tea": [], "cucumber salad with peanuts": [{"excerpts": ["Cucumber Salad with Peanuts", ": I nearly fell over when my compatriot ordered this. ", "I mean, there was Tofu Sticks Salad ", "With Cilantro and all kinds of fried stuff there. ", "I was expecting sliced cucumbers, Thai-style, perhaps even accompanied with peanut sauce. ", "Instead there was a lovely stack of cucumber toothpicks dressed in a delicate invisible sauce, and a piles naked peanuts. ", "Fresh and delicious. "], "author": "Seth G.", "review": "Cut the crap. This place is awesome! The only reason anyone would write a negative review about this place would be because they don't want to share it. These guys deserve success.\n\nYeah, I was worried when I saw it was right next to House of Nanking. And there is a better-decorated restaurant with a picture menu nearby with a lot of Sichuan items on it which almost threw me off my mission. But that place was packed and the menu looked kind of small.\n\nWe got there about 2pm on a Saturday and there was plenty of room. We were astonished by the menu, which had all kinds of interesting stuff on it as well as a lot of the traditional favorites. It was hard to decide\n\nHere's the rundown (for three very hungry people):\n\nSpicy Beef Tendon appetizer: my compatriot noted that this was superior to where we used to go. I'd have to agree and admit that I'm a sucker for the heavier, saltier sauce.\n\nCucumber Salad with Peanuts: I nearly fell over when my compatriot ordered this. I mean, there was Tofu Sticks Salad With Cilantro and all kinds of fried stuff there. I was expecting sliced cucumbers, Thai-style, perhaps even accompanied with peanut sauce. Instead there was a lovely stack of cucumber toothpicks dressed in a delicate invisible sauce, and a piles naked peanuts. Fresh and delicious. Heaven, honestly.\n\nHouse Braised Pork Knuckle: It took me a while to figure out this was pig foot. Once that was established I was perfectly comfortable with the way it giggled. Deeply seasoned with star anise, this is the best pig food dish you'll ever have for less than ten bucks.\n\nShanghai Soup Dumplings: served thoughtfully with three porcelain soup spoons, a no-nonsense version of the classic. Of all the dumplings we had, these had the thinnest skins.\n\nBoiled Radish Beef Dumplings: This was by far the most unique thing we ordered and the standout. I'm not sure what the colored radish they're using is, but it's delicious and completely accessible. Stop whining about the thickness of the skins. They're not going to slow you down.\n\nChives Fish Dumpling: I love chive dumplings but they always have shrimp in them, so I was thrilled to see this. I was not disappointed. Fresh and light!\n\nRed Bean Paste Pancake: a delicate pop-tart cut in 6 pieces, served perfectly hot, crispy, and not at all oily.\n\nBoiled Black Sesame Mochi: six little white mochi eggs filled with sweetened black sesame, served in a glass bowl with little metal spoons. A mind-blowing finish to the meal.", "rating": 5, "date": "2016-10-01"}], "beancurd stick salad with celery": [], "spicy shredded potato": [], "wide bean noodles salad": [], "house special braised slice beef": [], "shredded pig ear": [{"excerpts": ["The shredded pig ear appetizer scarred me for life. ", "I wasn't sure what to expect, but it was like hard gelatin that was kind of musty and minty at the same time. ", "I try to be adventurous, but my American palate can only take so much. ", "No regrets."], "author": "Milhouse N.", "review": "My sister and I came here upon realizing we wouldn't have time to eat at House of Nanking next door and still make our plans afterwards. Her pork pot stickers were much better than my non-fried cabbage and chicken dumplings. In fact, they were delicious. The shredded pig ear appetizer scarred me for life. I wasn't sure what to expect, but it was like hard gelatin that was kind of musty and minty at the same time. I try to be adventurous, but my American palate can only take so much. No regrets.", "rating": 3, "date": "2014-10-17"}], "sliced lotus roots salad": [], "deepfried onion rings": [], "house special sizzling rice": [{"excerpts": ["My friend studied the menu and ordered the following, all shared:\n\n1) House special sizzling rice (https://www.yelp.com/user_local_photos?select=BtPr2KvZsYXutCwKVgBtYA&userid=saJuyv784apZzH--psHZ3Q) "], "author": "Mike C.", "review": "A few years ago, a friend who works in the area told me about this neighborhood spot that borders North Beach, Jackson Square, and Chinatown.  He enjoyed their dumplings and noodles, but, being a bit of a, tsk, tsk, dumpling snob, I never found the time to try it.\nRecently, another friend surprised me by inviting me here for a weekday lunch.  \nArriving around 1 pm, there were four or five occupied tables as we were seated on a wall side table.  My friend studied the menu and ordered the following, all shared:\n\n1) House special sizzling rice (https://www.yelp.com/user_local_photos?select=BtPr2KvZsYXutCwKVgBtYA&userid=saJuyv784apZzH--psHZ3Q) - Do not advise ordering this unless you are a fan of the place a few doors over or just enjoy anything fried.\n\n2) Celery and shrimp dumpling (https://www.yelp.com/user_local_photos?select=W4F8BhJQCqb_VlZ5e7PqlQ&userid=saJuyv784apZzH--psHZ3Q) - Never heard of this combination but it works.  The celery flavor wasn't overwhelming and no fishiness from the shrimp.\n\n3) Xiao Lung Bao (https://www.yelp.com/user_local_photos?select=I8o17MDcDsQiLu-TOeEE9Q&userid=saJuyv784apZzH--psHZ3Q) - Very good version as the skin was thin, yet held the integrity of the fillings well.  Good soup content, but definitely eat them while hot.\n\n4) Braised beef noodle soup (https://www.yelp.com/user_local_photos?select=Bn8ZSjOC6xITHdgetU7igA&userid=saJuyv784apZzH--psHZ3Q) - Pretty good rendition as the broth flavor was clean and the meat pieces had a good mix of lean and tendon.  The noodles are on the wider side which lends me to believe that they are pulled in house.\n\n5) Sliced lotus root salad - Good change from the above with a pleasantly seasoned marinade while the lotus was shredded into easy to eat pieces.  My friend ate most of this while I mostly finished the noodle soup.\n\nService was efficient but pretty vanilla, empty plates removed and teapot checked from time to time.  The noise level is pretty good as we could have a decent conversation without having to raise our voices. \nBesides the above mentioned restaurant, there are a number of noodle places on Kearny Street now.  The menu here has more options especially if you are in the mood for dumplings.\nGood spot for a casual meal and will be back.", "rating": 4, "date": "2016-11-29"}], "grilled beef skewer": [], "grilled chicken skewer": [], "honey chili tofu": [{"excerpts": ["I've been here twice now, and plan to return for the fresh noodles, the boiled vegetarian dumplings (which are some of the best in SF, if you ask me) and the honey chili tofu (deep-fried chunks of tofu drizzled in sticky spicy-sweet sauce). ", "They have several choices of noodles (flat/regular hand-pulled, egg noodle, rice noodle) that you can pair with a fairly extensive list of soup/meat/veg broths & sauce bases. ", "We had the flat hand-pulled noodles with garlic shrimp and were impressed with how fresh and light it tasted, not to mention how generous the serving was. ", "The shrimp were delicately seasoned and perfectly cooked, and the broth was light but flavorful. ", "The additions of thinly sliced celery and garnish of cilantro made this a really nicely composed dish. ", "I think this place is going to be my standard when I have a dumpling craving (which is not rare!)"], "author": "Hillary D.", "review": "A small, no-frills spot on the edge of Chinatown serving fresh and affordable dumplings and hand-pulled noodles, among other standard Chinese fare.  I've been here twice now, and plan to return for the fresh noodles, the boiled vegetarian dumplings (which are some of the best in SF, if you ask me) and the honey chili tofu (deep-fried chunks of tofu drizzled in sticky spicy-sweet sauce). They have several choices of noodles (flat/regular hand-pulled, egg noodle, rice noodle) that you can pair with a fairly extensive list of soup/meat/veg broths & sauce bases. We had the flat hand-pulled noodles with garlic shrimp and were impressed with how fresh and light it tasted, not to mention how generous the serving was. The shrimp were delicately seasoned and perfectly cooked, and the broth was light but flavorful. The additions of thinly sliced celery and garnish of cilantro made this a really nicely composed dish. I think this place is going to be my standard when I have a dumpling craving (which is not rare!)", "rating": 4, "date": "2018-05-03"}, {"excerpts": ["We decided to order a few different appetizers and dim sums for dinner: pork potstickers, veggie potstickers, green onion pancakes and honey chili tofu. "], "author": "Cassandra J.", "review": "Don't let the tourist lure of House of Nanking sway you from this small nondescript Chinese food place! Filling in for the now-gone Chef Jia's, House of Xian Dumpling has a range of appetizers, dim sums, and entrees. We decided to order a few different appetizers and dim sums for dinner: pork potstickers, veggie potstickers, green onion pancakes and honey chili tofu. We had more than enough food to fill the two of us easily and it wound up being only $20 for the whole thing. \n\nThe surprising winner of the night was the tofu though. Fried tofu cubes with sweet chili sauce on top, it seemed simple and rather boring, but instead was delicious and crispy and amazing. I think I ate almost the entire plate. The potstickers were also a hit and the green onion pancakes were great for picking up leftover sauces.\n\nIf you're looking for quick, cheap, good Chinese food, come here for it instead of next door. You shouldn't be disappointed.", "rating": 4, "date": "2015-01-27"}, {"excerpts": ["As an appetizer, we decided on the honey chili tofu. ", "The tofu was crisp and extremely tasty! ", "The honey chili was amazing. ", "We also ordered their beef pancake, but you should skip on this. "], "author": "Hannah L.", "review": "I am very surprised that this restaurant has such a low rating! I was quite impressed with the food here when I went with my parents. \n\nTheir noodles are fresh and hand-pulled. You can see the cook pulling them right in front of you! It is quite refreshing to go to a Chinese restaurant and know that their food is fresh. I ordered their beef noodle soup, and thoroughly enjoyed it. The broth was light and tasty (not drowning in MSG) and the noodles were oh-so-wonderful. We ordered the XLB and pork&cabbage dumplings. Both were satisfactory, but not amazing. As an appetizer, we decided on the honey chili tofu. The tofu was crisp and extremely tasty! The honey chili was amazing. We also ordered their beef pancake, but you should skip on this. The pancake should have been crisp and crunchy, but instead was soggy and bland.\n\nAltogether, a solid experience. Note - I did come here after popular lunch hours (3 pm) so it wasn't too busy and we got wonderful service from them)", "rating": 4, "date": "2013-11-12"}, {"excerpts": ["(Honey Chili Tofu, Beef Pancake, Boiled Corn & Chicken Dumpling and -- for dessert -- Boiled Black Sesame Mochi.)"], "author": "Ken A.", "review": "If you value food over stylized ambience in a restaurant, this place should be on your list. A homey & and relaxed atmosphere, with friendly service, and the Hong Kong native in our party vouched for its authenticity. The traditional favorites we tried came off well, as did the items I picked specifically because I'd never had them elsewhere (Honey Chili Tofu, Beef Pancake, Boiled Corn & Chicken Dumpling and -- for dessert -- Boiled Black Sesame Mochi.)", "rating": 4, "date": "2014-05-10"}], "house special braised pork knuckle": [], "braised beef tendon noodle soup": [], "braised beef and beef tendon noodle soup": [{"excerpts": ["I tried the \"Braised Beef and Beef Tendon Noodle soup\" the soup had a nice spicey flavor and the noodles were just fine, but I noticed it had very little meat? "], "author": "Mr Bolo B.", "review": "I tried the \"Braised Beef and Beef Tendon Noodle soup\" the soup had a nice spicey flavor and the noodles were just fine, but I noticed it had very little meat? I had to look for the beef tendon and it was only a tiny piece , most places put a little more meat in the soup.\n\nfor $9.99 it should have some more meat, it was mostly soup not much noodles either.\n\nso I guess it was OK, but Ive had better.\n\nthe service was excellent, they accept credit cards on $15 or more order, thats good.\n\nI would still come back to try more dishes to get a better review, it's actually a pretty nice restaurant.", "rating": 4, "date": "2017-07-03"}], "pork chop noodle soup": [], "beef balls and fish balls noodle soup": [], "assortment of beef balls seaweed shrimps and bbq pork noodle soup": [], "vegetarian noodle soup": [{"excerpts": ["We tried the cabbage pork dumplings, noodle soup with chive shrimp dumplings, a vegetarian noodle soup and a plate of stir fried snow pea tips.  ", "We thought the food was a little better than average but not memorable.  ", "The service was attentive, and the place was tidy."], "author": "Frank L.", "review": "We tried the cabbage pork dumplings, noodle soup with chive shrimp dumplings, a vegetarian noodle soup and a plate of stir fried snow pea tips.  We thought the food was a little better than average but not memorable.  The service was attentive, and the place was tidy.", "rating": 3, "date": "2018-10-18"}, {"excerpts": ["We got soup dumplings, vegetarian noodle soup and lamb skewers. ", "The last one was really good. ", "I liked the space inside and the ambiance, but I was disappointed with the food."], "author": "J L.", "review": "It was honestly just okay. Food could have tasted better. We got soup dumplings, vegetarian noodle soup and lamb skewers. The last one was really good. I liked the space inside and the ambiance, but I was disappointed with the food.", "rating": 3, "date": "2016-08-01"}], "hot pickled mustard tuber and shredded pork noodle soup": [], "pork knuckle noodle soup": [{"excerpts": ["My favorite dish however, is the Pork Knuckle Noodle Soup with the hand-pulled flat noodle. ", "I love Pork Knuckle ", "and I was delighted to find a place east of Inner Richmond that actually serves a good amount of it! ", "The noodles are the right amount of chewiness and the broth is deliciously rich. "], "author": "Sophia V.", "review": "I'm SO happy a place like this opened a close proximity to where I live/work. \n\nHonestly speaking, I'm not a huge fan of most Chinese food. I find a majority of the dishes bland, overly salty, and one-dimensional. However, the two dishes I absolutely love are Xiao Long Bao and Beef Noodle Soup (with the thick, chewy noodles). Despite living near Chinatown, I hadn't been able to find any restaurant serving a decent portion of these two items (this is probably due to a fact that a majority of the restaurants are owned by Cantonese speaking immigrants from Southern Chinese provinces). Until now with the opening of House of Xian Dumpling!\n\nThe restaurant itself is small and a bit cramped, but cleaner than a majority of other Chinatown eateries, and better yet, the staff is friendly and accommodating to non-Chinese speakers (tourists, this means you!). The space is further occupied by a small stall with a staff member hand pulling noodles for the dishes in front of you. \n\nFood-wise, the Xiao Long Baos are not soupy enough in my opinion, but since I have a pretty high standard for XLBs (Joe's... I miss you), this wasn't surprising. \n\nI've had the Braised Beef Noodle Soup and Braised Tendon Noodle Soup, both good, filling, and SPICY. My favorite dish however, is the Pork Knuckle Noodle Soup with the hand-pulled flat noodle. I love Pork Knuckle and I was delighted to find a place east of Inner Richmond that actually serves a good amount of it! The noodles are the right amount of chewiness and the broth is deliciously rich. Best of all, a bowl will only set you back $6.95!\n\nIf you're coming alone, bring cash because there is a credit card minimum of $10.", "rating": 4, "date": "2014-05-12"}], "house spicy chicken noodle soup": [{"excerpts": ["With the benefit of hindsight, perhaps I should have ordered the House Spicy Chicken Noodle Soup or one of the many other noodle dishes on the menu. ", "I would recommend coming here if you want cheap food since their prices are pretty reasonable (hopefully your dish won't be a dud and mine was a fluke)."], "author": "Nelson X.", "review": "I came here on a weekday evening with a friend since we were feeling a bit hungry and didn't feel like splurging that day. When we walked in, the restaurant was roughly at a quarter capacity. We took a seat and started looking at the menu. I went straight to the noodle soup page and found the Hot Pickled Mustard Tuber & Shredded Pork Noodle Soup. I ordered it and then we waited for our dishes. \n\nA couple minutes later, our dishes arrived and I dug in. The noodles were pretty good and I did appreciate the fact that the noodles were hand-pulled. However, the soup was relatively bland and wasn't as sour as I hoped it would be. The shredded pork and the vegetables were alright and I didn't really have much to say about them. \n\nOverall, this dish was alright but not as good as I had expected. Perhaps I just ordered a noodle dish that they weren't really known for. With the benefit of hindsight, perhaps I should have ordered the House Spicy Chicken Noodle Soup or one of the many other noodle dishes on the menu. I would recommend coming here if you want cheap food since their prices are pretty reasonable (hopefully your dish won't be a dud and mine was a fluke).", "rating": 3, "date": "2018-06-09"}], "noodles with pork meat slices in thick gravy": [], "noodles with spicy sizzling oil": [], "noodles with minced pork sauce": [], "noodles with egg and tomato": [], "noodles with house spicy beef": [], "dandan noodles": [{"excerpts": ["Tried: the soup dumplings, beef noodle soup, and dandan noodles. \n\n"], "author": "Ming Y.", "review": "Tried: the soup dumplings, beef noodle soup, and dandan noodles. \n\nThis tiny restaurant was packed with people when I came, and I'm not sure why since the food is really nothing special. The noodles are bland and flavorless, and the soup dumplings don't even have any soup in them (?!). Service was alright. Skip this place and eat at one of the neighboring restaurants!", "rating": 1, "date": "2018-08-04"}, {"excerpts": ["My husband ordered us the soup dumplings, ordered DanDan noodles for himself, and the braised beef noodle soup for me.  ", "It was so delicious we made a point to come back the day we left and have the exact meal again for lunch."], "author": "Liz V.", "review": "My husband and I were visiting San Francisco from New Orleans, where there is a large Vietnamese population. We were excited to get to try Chinese food in Chinatown- specifically soup dumplings. It took us a while to get to House of Xian so by the time we were seated, we were starving.\n\nMy husband ordered us the soup dumplings, ordered DanDan noodles for himself, and the braised beef noodle soup for me.  It was so delicious we made a point to come back the day we left and have the exact meal again for lunch.", "rating": 5, "date": "2018-04-23"}, {"excerpts": ["We ordered the dandan noodles and pork dumplings with cabbage. ", "Both delicious!"], "author": "Lori S.", "review": "Delicious and friendly service. We ordered the dandan noodles and pork dumplings with cabbage. Both delicious!", "rating": 5, "date": "2018-08-20"}], "noodles with garlic shrimps": [], "pork and vegetables wonton soup": [], "shanghai soup dumplings": [{"excerpts": ["- Chinese Broccoli - Great\n- Pork Pot Stickers - Great\n- Shanghai Soup Dumplings - Great\n", "- ", "Shanghai Pan-Fried Pork Buns - "], "author": "Michelle B.", "review": "So yummy!\n\nAte here on a Friday right after work. About half the place was busy, so there is plenty of seating and the service is fast. Really great if you just want a variety of dumplings at reasonable prices with fast service.\n\nFood:\n- Dan Dan Noodles - I love the flavor of this, and the leftovers the next day were so good. It is a bit oily though.\n- Chinese Broccoli - Great\n- Pork Pot Stickers - Great\n- Shanghai Soup Dumplings - Great\n- Shanghai Pan-Fried Pork Buns - Just okay because the skins were a bit too thick and on the dry side.\n\nPrices: Super Reasonable for this part of the city\n\nService: Fast\n\nAtmosphere: Nothing fancy, but clean and well-lit.", "rating": 4, "date": "2018-10-01"}, {"excerpts": ["Many of the positive reviews for this restaurant quote the lamb skewers and Shanghai soup dumplings. ", "This is perplexing, as neither of these dishes are xian specialties. ", "Which is fine -- good food of a region doesn't have to come from a restaurant of that region. "], "author": "Dan Z.", "review": "If you hate food, why would you open a restaurant?\nOh, that's right -- because you like tourist money.\n\nInsider tip -- when you go into a xian restaurant and the hot chili pepper oil on the tables come from a bottle instead of from being rendered in the back room, when you can't smell a gust of peppery heat, leave. Turn around, don't look back.\n\nMany of the positive reviews for this restaurant quote the lamb skewers and Shanghai soup dumplings. This is perplexing, as neither of these dishes are xian specialties. Which is fine -- good food of a region doesn't have to come from a restaurant of that region. But this was not good food.\n\nThe only reason to come here is if Chongqing Noodle and House of Nanjing next door have a 30 minute + wait and you have to sit down immediately or you will literally die.\n\nLamb skewers are supposed to be dry rubbed to extract moisture and then grilled over smoke to impart flavor and render the fat. These lamb skewers were cut so tiny that there was no possibility of juiciness, and were fried, not grilled - the laziest of possible preparations. The result is a greasy, salty, leftover-scraps-after-barbecuing style of lamb skewer that's tasty only by virtue of being seasoned fried meat. Why drive to SF Chinatown for that, though?\n\nThe dumplings are previously frozen, not fresh or made on premises. When you come from a Chinese family that cooks as often as mine does, the difference is immediate and obvious, from the dough to the shape, doneness, texture, and flavor of the filling.\n\nIt's not my intention to be a stickler for rules or a snobby gourmand, but this place is a parasite that continues to exist only by the grace of the overflowing success of the two restaurants next door (which are quality), and by being in Chinatown. Within a 200m radius of this restaurant, there are literally tens of restaurants where you can get a more authentic, better value, better flavor Chinese food fix.\n\nLeave. Turn around. Don't look back.", "rating": 1, "date": "2018-06-03"}, {"excerpts": ["The waitress forgot to put in my order for Shanghai soup dumplings, but the noodles were enough to fill me up. ", "The service is quick. "], "author": "Victoria C.", "review": "Solid, consistent restaurant in Chinatown. I make a stop here the past 2 times I was in San Francisco. It's one of those places you can get in and get out fairly quickly. \n\nThe handpulled noodles are my favorite. I love the spicy beef hand pulled noodles. They're perfectly spicy, but not the type of spicy where I'm in pain. The noodles are good. Really good. I love the texture of the hand pulled noodles, they were literally perfect. \n\nThe dumplings are good. Not the best I ever had, but still pretty decent. The waitress forgot to put in my order for Shanghai soup dumplings, but the noodles were enough to fill me up. The service is quick. They're nicer than some Asian places. \n\nI don't know what it is about that spicy beef noodles, but I am seriously obsessed with them. Try it, you won't regret it. I miss it so much now that I'm not on the West Coast. I guarantee you the next time I'm in San Francisco, you'll find me here at one point.", "rating": 4, "date": "2015-12-12"}, {"excerpts": ["My favorites are Shanghai soup dumplings, chili oil wonton, enoki mushroom salad, Dan Dan noodles, wide bean noodle salad, and bean curd stick with cilantro."], "author": "Hosick F.", "review": "Now my go to place when I crave dumplings.  I also tend to recommend this place when I meet up with friends.  My favorites are Shanghai soup dumplings, chili oil wonton, enoki mushroom salad, Dan Dan noodles, wide bean noodle salad, and bean curd stick with cilantro.", "rating": 5, "date": "2017-12-03"}, {"excerpts": ["Shanghai Soup Dumplings: served thoughtfully with three porcelain soup spoons, a no-nonsense version of the classic. "], "author": "Seth G.", "review": "Cut the crap. This place is awesome! The only reason anyone would write a negative review about this place would be because they don't want to share it. These guys deserve success.\n\nYeah, I was worried when I saw it was right next to House of Nanking. And there is a better-decorated restaurant with a picture menu nearby with a lot of Sichuan items on it which almost threw me off my mission. But that place was packed and the menu looked kind of small.\n\nWe got there about 2pm on a Saturday and there was plenty of room. We were astonished by the menu, which had all kinds of interesting stuff on it as well as a lot of the traditional favorites. It was hard to decide\n\nHere's the rundown (for three very hungry people):\n\nSpicy Beef Tendon appetizer: my compatriot noted that this was superior to where we used to go. I'd have to agree and admit that I'm a sucker for the heavier, saltier sauce.\n\nCucumber Salad with Peanuts: I nearly fell over when my compatriot ordered this. I mean, there was Tofu Sticks Salad With Cilantro and all kinds of fried stuff there. I was expecting sliced cucumbers, Thai-style, perhaps even accompanied with peanut sauce. Instead there was a lovely stack of cucumber toothpicks dressed in a delicate invisible sauce, and a piles naked peanuts. Fresh and delicious. Heaven, honestly.\n\nHouse Braised Pork Knuckle: It took me a while to figure out this was pig foot. Once that was established I was perfectly comfortable with the way it giggled. Deeply seasoned with star anise, this is the best pig food dish you'll ever have for less than ten bucks.\n\nShanghai Soup Dumplings: served thoughtfully with three porcelain soup spoons, a no-nonsense version of the classic. Of all the dumplings we had, these had the thinnest skins.\n\nBoiled Radish Beef Dumplings: This was by far the most unique thing we ordered and the standout. I'm not sure what the colored radish they're using is, but it's delicious and completely accessible. Stop whining about the thickness of the skins. They're not going to slow you down.\n\nChives Fish Dumpling: I love chive dumplings but they always have shrimp in them, so I was thrilled to see this. I was not disappointed. Fresh and light!\n\nRed Bean Paste Pancake: a delicate pop-tart cut in 6 pieces, served perfectly hot, crispy, and not at all oily.\n\nBoiled Black Sesame Mochi: six little white mochi eggs filled with sweetened black sesame, served in a glass bowl with little metal spoons. A mind-blowing finish to the meal.", "rating": 5, "date": "2016-10-01"}, {"excerpts": ["Shanghai Soup Dumplings - Xiao Long ", "Bao's - "], "author": "David T.", "review": "This is a small restaurant that looks clean and well run.\n\nThe staff are friendly and they understand dinner theater. They have this cool hand pulled noodle pulling station in the middle of the small dining space. I did not appreciate how big this is in the tiny dining room, till I saw it myself.\n\nMost of the items I tried were quite good.\n\nBlack fungus with garlic - Looks like the lungs from an alien species, but they are delicious and apparently good for your heart.\n\nCold beef tendon. Once you get over the plasticized meat texture, it is quite good but still prefer Z and Y's version. The Z and Y version is sliced thinner and has a has a particularly addictive numbing peppercorn chili oil sauce.\n\nPea Sprouts in House Broth - Very good\n\nCurried Fish Balls - Texture is a cross between a marshmallow and a scallop. Loved these. Very good.\n\nPork and Vegetable Wonton Soup - Unusual tasting wontons, not as good as Hons Wun Ton House, but interesting.\n\nShanghai Soup Dumplings - Xiao Long Bao's - Not the best I've had but not bad either.\n\nPork Dumplings in Chili Oil - This one was disappointing. The dumplings were heavy and the sauce more vinegar than spice. Skip this one.\n\nBoiled Shrimp, Pork and Chive dumpling. Quite good. I liked this one.\n\nOverall I was very pleased with my dinner here and wish I'd tried this place sooner.", "rating": 4, "date": "2014-02-19"}, {"excerpts": ["Shanghai soup dumplings and an order of beef fried rice. ", "All were good and the portions were large. ", "The prices were reasonable, at least similar to other Chinatown restaurants. ", "The place was packed at noon on a weekday. ", "All happy diners with not a single table empty. ", "They were also filling huge take out orders. "], "author": "Steven G.", "review": "We loved this place!  So sooooo much better than House Of Nanking. \n\nWe had the braised beef noodle soup. Shanghai soup dumplings and an order of beef fried rice. All were good and the portions were large. The prices were reasonable, at least similar to other Chinatown restaurants. The place was packed at noon on a weekday. All happy diners with not a single table empty. They were also filling huge take out orders. This place was busy. \n\nThe formula is simple. Good food at a reasonable price. How hard is that?\" This place fills the bill. Stop by and have a bite. It is an enjoyable experience.", "rating": 5, "date": "2014-07-07"}, {"excerpts": ["For dinner for three, we got the cold pig ears, Shanghai soup dumplings, Westlake beef dumplings, and the lamb & chives dumplings. ", "The flavorings are a little more muted than Kingdom of Dumpling, but still nicely done. ", "Pig ears were great, so don't knock 'em until you try 'em."], "author": "Kevin L.", "review": "Much better service this second time around, though it might be due to the owner not being around. The waitress was attentive and nice, and the food was rocking like last time.\n\nFor dinner for three, we got the cold pig ears, Shanghai soup dumplings, Westlake beef dumplings, and the lamb & chives dumplings. The flavorings are a little more muted than Kingdom of Dumpling, but still nicely done. Pig ears were great, so don't knock 'em until you try 'em.", "rating": 4, "date": "2014-02-12"}, {"excerpts": ["I ordered Shanghai soup dumplings, Braised Beef noodle soup and the cold dish spicy beef tendon.\n\n"], "author": "Melody T.", "review": "This place certainly deserves more stars! I ordered Shanghai soup dumplings, Braised Beef noodle soup and the cold dish spicy beef tendon.\n\nAll of the noodles for noodle soup is hand-pulled, freshly made to order. You have to come at lunch to get the flat (wide) noodle, though.\n\nXiao Long bao is good but the filling can have some more flavor.\n\nThe spicy beef tendon is very well cooked and if you want a combo of\nbraised beef / tendon noodle soup, you can order a side of spicy beef tendon and the beef noodle soup and put the beef tendon into your noodle! Its a great combo that you have to try!!\n\nService- The server here is very attentive and nice, unlike other chinese restaurant where you do not get this kind of great service...", "rating": 5, "date": "2013-11-26"}, {"excerpts": ["Definitely order the Shanghai Soup Dumplings, Pan Friend Pork Buns, and the Beef Noodle Soup."], "author": "Ryan D.", "review": "As a huge fun of Xiao Long Bao's (Shanghainese Dumplings), House of Xian definitely hits the spot. The other Shanghainese restaurants I've been to in the Bay Area pales in comparison to this newly opened restaurant. Affordable dishes on the menu too and they're open 7 days a week! Definitely order the Shanghai Soup Dumplings, Pan Friend Pork Buns, and the Beef Noodle Soup.", "rating": 3, "date": "2014-03-23"}], "shanghai panfried pork buns": [], "chili oil wontons": [{"excerpts": ["Got their Chili Oil Wontons, Boiled Chives & Shrimp Dumplings and Shanghai Pan-Fried Pork Buns.  \n\n", "Chili Oil Wontons \n(5+ really delightful)\n\nBoiled Chives & Shrimp Dumplings \n(Solid 4.5, definitely up to a 5 when you use the soy/vinegar sauce. "], "author": "Valerie F.", "review": "Got their Chili Oil Wontons, Boiled Chives & Shrimp Dumplings and Shanghai Pan-Fried Pork Buns.  \n\nChili Oil Wontons \n(5+ really delightful)\n\nBoiled Chives & Shrimp Dumplings \n(Solid 4.5, definitely up to a 5 when you use the soy/vinegar sauce. Chive forward! YUM) \n\nShanghai Pan-Fried Pork Buns.  \n(Meh, 3 nothing wrong but not going to order it again from here. I know it's a bun but the skin is WAY too thick. Either that or they need to fill it with more 'stuff.')\n\nPostmates delivery fee was a bit pricey, but it looks like you can get it from here for $3 dollars less. Not going to rate them down for that.\n\nLooking forward to trying the lamb skewers, XLB, and pea sprouts.", "rating": 4, "date": "2018-06-19"}, {"excerpts": ["The chili oil wontons are excellent the place is very busy during lunch time so plan consider take-out as well."], "author": "N A.", "review": "The chive, pork and shrimp dumplings with soy, vinegar, and hot sauce are delicious. The chili oil wontons are excellent the place is very busy during lunch time so plan consider take-out as well.", "rating": 4, "date": "2016-10-24"}], "steamed thread rolls": [], "beijingstyle buns": [], "sweet soy bean milk": [], "savory soy bean milk": [], "pork dumplings in chili oil": [{"excerpts": ["Pork dumplings in chili oil - 2/5 - ", "Too much cabbage, sauce not spicy enough. \n", "XLB - 5/5 ", "- Best XLB ", "I've had so far in the city. "], "author": "Mark O.", "review": "Dumpling restaurant next to house of nanking in fidi. Limited seating, friendly service uncharacteristic of Chinese places. \n\nPan fried pork dumplings - 3/5 - Needed to be fluffier, more moist and more flavorful.\nBeef pancake - 5/5 - It's actually a beef dumpling fried inside of the pancake. Both unique and delicious. \nPork dumplings in chili oil - 2/5 - Too much cabbage, sauce not spicy enough. \nXLB - 5/5 - Best XLB I've had so far in the city. Balanced sauce, gentle flavor, decent wrapper. \n\nOverall, this might be my new go to xlb spot because both the beef pancake and the xlb were \"as good as it gets.\"", "rating": 5, "date": "2015-07-02"}, {"excerpts": ["The three of us shared pork dumplings in chili oil, house special chow mein, and the vegetable dumplings. ", "The chili oil was both tangy and spicy, the dumplings were perfect. ", "That was so far my best meal in Chinatown. \n", "Service was decent, waitress made a small mistake on the chow mein, but the manager corrected it immediately. ", "Place was about half full on a thursday night ", "so I suspect it might get super busy at times.\n", "The food is totally worth a small wait however."], "author": "Steven W.", "review": "Went to try this place out as a co worker traveled to Xainyang china and kept going on about the superiority of Xi'An noodle and dumpling dishes.\nHe was not wrong. \nThe three of us shared pork dumplings in chili oil, house special chow mein, and the vegetable dumplings. The chili oil was both tangy and spicy, the dumplings were perfect. That was so far my best meal in Chinatown. \nService was decent, waitress made a small mistake on the chow mein, but the manager corrected it immediately. Place was about half full on a thursday night so I suspect it might get super busy at times.\nThe food is totally worth a small wait however.", "rating": 5, "date": "2015-05-11"}, {"excerpts": ["Pork Dumplings in Chili Oil - ", "This one was disappointing. ", "The dumplings were heavy and the sauce more vinegar than spice. "], "author": "David T.", "review": "This is a small restaurant that looks clean and well run.\n\nThe staff are friendly and they understand dinner theater. They have this cool hand pulled noodle pulling station in the middle of the small dining space. I did not appreciate how big this is in the tiny dining room, till I saw it myself.\n\nMost of the items I tried were quite good.\n\nBlack fungus with garlic - Looks like the lungs from an alien species, but they are delicious and apparently good for your heart.\n\nCold beef tendon. Once you get over the plasticized meat texture, it is quite good but still prefer Z and Y's version. The Z and Y version is sliced thinner and has a has a particularly addictive numbing peppercorn chili oil sauce.\n\nPea Sprouts in House Broth - Very good\n\nCurried Fish Balls - Texture is a cross between a marshmallow and a scallop. Loved these. Very good.\n\nPork and Vegetable Wonton Soup - Unusual tasting wontons, not as good as Hons Wun Ton House, but interesting.\n\nShanghai Soup Dumplings - Xiao Long Bao's - Not the best I've had but not bad either.\n\nPork Dumplings in Chili Oil - This one was disappointing. The dumplings were heavy and the sauce more vinegar than spice. Skip this one.\n\nBoiled Shrimp, Pork and Chive dumpling. Quite good. I liked this one.\n\nOverall I was very pleased with my dinner here and wish I'd tried this place sooner.", "rating": 4, "date": "2014-02-19"}], "boiled cabbage and pork dumplings": [], "boiled chives and pork dumplings": [], "boiled cabbage and chicken dumplings": [{"excerpts": ["We got the boiled cabbage and chicken dumplings to go and "], "author": "Sung L.", "review": "I'm really sad right now... because I just ran out of dumplings! I don't get what some of the other reviews are talking about because these dumplings are sooo good. We got the boiled cabbage and chicken dumplings to go and now I regret not getting more... \n\nWe were around the area and wanted a quick bite, so we decided to drop in here cause it seemed comfortable and bright. The waiters greeted us well and we sat down. Although we changed our minds to just get something to go, they were kind to let us still sit there and serve us water right away. They also seemed appreciative of our business as we left. \n\nCan't go wrong with hand made dumplings and the hand pulled noodles we saw other tables get looked really good as well. I think this place is overshadowed by some of the fancier places around them and some bad reviews may make some people hesitant to try it. Maybe stick to what they're named after..? For a tourist area like that, it's good pricing too. \n\nThank you for the good dumplings and friendly service. We'll be back when we're around there again. :)", "rating": 5, "date": "2018-09-15"}], "boiled corn and chicken dumplings": [{"excerpts": ["We ordered Boiled Corn and Chicken Dumplings (12) ($8.95), Green Onion Pancake ($6.50), Grilled Skewered Lamb ($8.95), and Dandan Noodle ($9.95).  \n\n", "- Boiled Corn and Chicken Dumplings: ", "Right when I took a bite, the corn pieces fell out. ", "They were not mixed in well with the chicken. "], "author": "Kristina M.", "review": "This place made me feel like a gambler. The dishes were pretty much a hit or miss. We ordered Boiled Corn and Chicken Dumplings (12) ($8.95), Green Onion Pancake ($6.50), Grilled Skewered Lamb ($8.95), and Dandan Noodle ($9.95).  \n\nHits:\n- Green Onion Pancake: The pancake was very crispy on the outside and doughy in the inside. It seemed thicker than most green onion pancakes. There were not as many onion pieces as I thought there would be. Nevertheless, it was pretty good. \n\n- Dandan Noodle: These noodles tasted better than they looked. The dish was not salty and there was an adequate amount of meat. My friend would give this dish 5 stars. \n\nMisses:\n- Grilled Skewered Lamb: It was extremely dry, under seasoned, and a little cold. My friend thought it was a disappointment and warned the waitress about this.\n\n- Boiled Corn and Chicken Dumplings: Right when I took a bite, the corn pieces fell out. They were not mixed in well with the chicken. I think I would be better off buying chicken potstickers from Costco. \n\nIf you want to use your credit card, you have to spend at least $15. Only one credit card is accepted per table. \n\nSince we only liked 50% of the dishes we ordered, we will probably not come back. In general, I recommend not getting dumplings at House of Xian Dumplings.. ironically.", "rating": 3, "date": "2018-07-22"}], "boiled chives and shrimp dumplings": [], "boiled celery and shrimp dumplings": [], "boiled chives pork and shrimp dumplings": [], "boiled radish and beef dumplings": [], "boiled west lake lamb dumplings": [], "boiled chives and fish dumplings": [], "boiled vegetarian dumplings": [{"excerpts": ["I've been here twice now, and plan to return for the fresh noodles, the boiled vegetarian dumplings (which are some of the best in SF, if you ask me) and the honey chili tofu (deep-fried chunks of tofu drizzled in sticky spicy-sweet sauce). ", "They have several choices of noodles (flat/regular hand-pulled, egg noodle, rice noodle) that you can pair with a fairly extensive list of soup/meat/veg broths & sauce bases. ", "We had the flat hand-pulled noodles with garlic shrimp and were impressed with how fresh and light it tasted, not to mention how generous the serving was. ", "The shrimp were delicately seasoned and perfectly cooked, and the broth was light but flavorful. ", "The additions of thinly sliced celery and garnish of cilantro made this a really nicely composed dish. ", "I think this place is going to be my standard when I have a dumpling craving (which is not rare!)"], "author": "Hillary D.", "review": "A small, no-frills spot on the edge of Chinatown serving fresh and affordable dumplings and hand-pulled noodles, among other standard Chinese fare.  I've been here twice now, and plan to return for the fresh noodles, the boiled vegetarian dumplings (which are some of the best in SF, if you ask me) and the honey chili tofu (deep-fried chunks of tofu drizzled in sticky spicy-sweet sauce). They have several choices of noodles (flat/regular hand-pulled, egg noodle, rice noodle) that you can pair with a fairly extensive list of soup/meat/veg broths & sauce bases. We had the flat hand-pulled noodles with garlic shrimp and were impressed with how fresh and light it tasted, not to mention how generous the serving was. The shrimp were delicately seasoned and perfectly cooked, and the broth was light but flavorful. The additions of thinly sliced celery and garnish of cilantro made this a really nicely composed dish. I think this place is going to be my standard when I have a dumpling craving (which is not rare!)", "rating": 4, "date": "2018-05-03"}], "choy sum in house broth": [], "boy choy with garlic sauce": [], "sweet and sour shrimps": [], "szechuan hot spicy fish filet": [], "szechuan hot spicy beef": [], "boiled black sesame mochi": [{"excerpts": ["boiled black sesame mochi $4.25 - 6 small mochi dumplings w/ ", "the black sesame lava - "], "author": "Ann L.", "review": "2nd time to House of Xian Dumpling think I ordered pretty bad this time.\n\nI got:\n\nChive & fish dumplings $7.95 - very salty dumplings!  skip it.\n\nboy (sic) choy oyster sauce $5.25 - just boiled bok choy w/ some oyster sauce, not very tasty, skip it.\n\nboiled black sesame mochi $4.25 - 6 small mochi dumplings w/ the black sesame lava - I thought it was just ok, nothing special.\n\nWanted take-out box, lady took my bok choy in the back to box up and put in a plastic bag, then she charged me 10c for the bag, I said No to the bag and had it taken off my bill!  Evil!  Bring your own bag here!!\n\nCharged it, their minimum is $15, made it.", "rating": 3, "date": "2014-11-29"}, {"excerpts": ["Boiled Black Sesame Mochi: ", "six little white mochi eggs filled with sweetened black sesame, served in a glass bowl with little metal spoons. ", "A mind-blowing finish to the meal."], "author": "Seth G.", "review": "Cut the crap. This place is awesome! The only reason anyone would write a negative review about this place would be because they don't want to share it. These guys deserve success.\n\nYeah, I was worried when I saw it was right next to House of Nanking. And there is a better-decorated restaurant with a picture menu nearby with a lot of Sichuan items on it which almost threw me off my mission. But that place was packed and the menu looked kind of small.\n\nWe got there about 2pm on a Saturday and there was plenty of room. We were astonished by the menu, which had all kinds of interesting stuff on it as well as a lot of the traditional favorites. It was hard to decide\n\nHere's the rundown (for three very hungry people):\n\nSpicy Beef Tendon appetizer: my compatriot noted that this was superior to where we used to go. I'd have to agree and admit that I'm a sucker for the heavier, saltier sauce.\n\nCucumber Salad with Peanuts: I nearly fell over when my compatriot ordered this. I mean, there was Tofu Sticks Salad With Cilantro and all kinds of fried stuff there. I was expecting sliced cucumbers, Thai-style, perhaps even accompanied with peanut sauce. Instead there was a lovely stack of cucumber toothpicks dressed in a delicate invisible sauce, and a piles naked peanuts. Fresh and delicious. Heaven, honestly.\n\nHouse Braised Pork Knuckle: It took me a while to figure out this was pig foot. Once that was established I was perfectly comfortable with the way it giggled. Deeply seasoned with star anise, this is the best pig food dish you'll ever have for less than ten bucks.\n\nShanghai Soup Dumplings: served thoughtfully with three porcelain soup spoons, a no-nonsense version of the classic. Of all the dumplings we had, these had the thinnest skins.\n\nBoiled Radish Beef Dumplings: This was by far the most unique thing we ordered and the standout. I'm not sure what the colored radish they're using is, but it's delicious and completely accessible. Stop whining about the thickness of the skins. They're not going to slow you down.\n\nChives Fish Dumpling: I love chive dumplings but they always have shrimp in them, so I was thrilled to see this. I was not disappointed. Fresh and light!\n\nRed Bean Paste Pancake: a delicate pop-tart cut in 6 pieces, served perfectly hot, crispy, and not at all oily.\n\nBoiled Black Sesame Mochi: six little white mochi eggs filled with sweetened black sesame, served in a glass bowl with little metal spoons. A mind-blowing finish to the meal.", "rating": 5, "date": "2016-10-01"}, {"excerpts": ["(Honey Chili Tofu, Beef Pancake, Boiled Corn & Chicken Dumpling and -- for dessert -- Boiled Black Sesame Mochi.)"], "author": "Ken A.", "review": "If you value food over stylized ambience in a restaurant, this place should be on your list. A homey & and relaxed atmosphere, with friendly service, and the Hong Kong native in our party vouched for its authenticity. The traditional favorites we tried came off well, as did the items I picked specifically because I'd never had them elsewhere (Honey Chili Tofu, Beef Pancake, Boiled Corn & Chicken Dumpling and -- for dessert -- Boiled Black Sesame Mochi.)", "rating": 4, "date": "2014-05-10"}], "fried sesame balls": [], "shrimps chow mein": []}