{"hunan chicken over rice lunch": [], "kung pao chicken over rice lunch": [], "cashew nut chicken over rice lunch": [], "black mushroom chicken over rice lunch": [], "curry chicken over rice lunch": [], "chicken with mixed vegetable over rice lunch": [], "sweet and sour chicken over rice lunch": [], "garlic chicken over rice lunch": [], "chicken with string beans over rice lunch": [], "general tsos chicken over rice lunch": [], "broccoli chicken over rice": [], "beef in oyster sauce over rice lunch": [], "beef with tender green over rice lunch": [], "mongolian beef over rice lunch": [], "hunan beef over rice lunch": [], "beef with bean curd over rice lunch": [], "tomato beef over rice lunch": [], "broccoli beef over rice lunch": [], "beef with ginger and scallions over rice lunch": [], "ginger garlic shredded pork over rice lunch": [], "eggplant with shredded pork over rice lunch": [], "twice cooked pork over rice lunch": [], "sweet and sour pork over rice lunch": [], "bbq pork with bean curd over rice lunch": [], "prawns with mixed vegetable over rice lunch": [], "cashew nut prawns over rice lunch": [], "hunan prawns over rice lunch": [], "prawns with lobster sauce over rice lunch": [], "fish fillets in black bean sauce over rice lunch": [], "fish with mixed vegetables over rice lunch": [], "fish fillets with tender green over rice lunch": [], "sweet and sour fish over rice lunch": [], "squid with string bean over rice": [], "kung pao squid over rice lunch": [], "mongolian prawns chicken and beef over rice lunch": [], "mixed vegetable over rice lunch": [], "braised tofu with mushroom and tender green over rice lunch": [], "ginger garlic eggplant over rice lunch": [], "ma po tofu over rice lunch": [], "string bean in garlic sauce over rice lunch": [], "pieces egg rolls": [], "pieces fried wonton": [], "green onion cake": [], "pieces pot stickers": [], "pieces fried prawns": [], "combination plate": [{"excerpts": ["I had the combination plate (an appetizer) and a chow mein with pork, beef, shrimp and chicken."], "author": "Ana T.", "review": "This place is really good. The food taste pretty well, everything was served quickly. The staff is really nice.\nNice food, nice place, good price. I had the combination plate (an appetizer) and a chow mein with pork, beef, shrimp and chicken.", "rating": 5, "date": "2015-12-16"}], "crispy fried chicken wings": [], "pieces pork siu mai": [], "pieces pork steamed dumplings": [], "pieces steamed bbq pork buns": [], "westlake minced beef soup": [], "seafood and bean curd soup": [], "egg flower soup with chicken broth": [], "sliced pork mustard green and salted egg soup": [], "honey glazed walnut prawns": [], "prawns sauteed with mushroom snow peas and celery": [], "scallops and prawns sauteed with mushrooms snow peas and celery": [], "hunan prawns": [{"excerpts": ["We ordered the appetizers combo, general chicken and Hunan prawns. ", "Everything was really good. ", "The Hunan Prawns were too salty. ", "But good Chinese for the price."], "author": "Donna R.", "review": "Just arrived in San Francisco and was looking for a reasonably priced restaurant. We ordered the appetizers combo, general chicken and Hunan prawns. Everything was really good. The Hunan Prawns were too salty. But good Chinese for the price.", "rating": 4, "date": "2016-12-12"}], "ginger garlic prawns": [], "cashew nut prawns": [], "prawns roasted with salt and chili pepper": [], "squid sauteed with snow peas and mushrooms": [], "squid in black bean sauce": [], "fish fillets roasted with salt and chili pepper": [], "fish fillets sauteed with mushrooms snow peas and celery": [], "sweet and sour fish fillets": [], "fish fillets with tender greens": [], "sizzling assorted seafood": [], "sizzling prawn chicken and beef": [], "sizzling prawns": [], "sizzling chicken": [], "sizzling beef": [], "braised assorted seafood with tofu in clay pot": [], "chicken with sausage and black mushrooms in clay pot": [], "salted fish and chicken with eggplant in clay pot": [], "chicken in garlic sauce": [], "sauteed chicken with double mushrooms and snow peas": [], "hunan chicken": [{"excerpts": ["I couldn't decide which entree I should select, so I ordered two specials: Hunan Chicken and General Tsao Chicken. \n\n", "Hunan Chicken: if you enjoy spicy hot Chinese food that clears your sinuses, then this is the dish for you! "], "author": "Peggy H.", "review": "I made it to the restaurant by 3:30pm, so I was able to order off of the lunch special menu. I couldn't decide which entree I should select, so I ordered two specials: Hunan Chicken and General Tsao Chicken. \n\nHunan Chicken: if you enjoy spicy hot Chinese food that clears your sinuses, then this is the dish for you! The chicken was very tender, the sauce flavorful, and there was a lot of vegetables served with the steamed rice, and a side bowl of soup. \n\nGeneral Tsao Chicken: this dish was a disappointment. The flavor of the sauce was off, and there were only a few slices of carrots that were not completely steamed. This dish came with rice and a small bowl of soup, as well. \n\nOverall, when you come to San Francisco your mouth is already preparing itself to enjoy some completely outrageous tasting Chinese food. This food was at best, fair. The restaurant is within walking distance of hotels, and that's about the only advantage.", "rating": 3, "date": "2016-01-20"}, {"excerpts": ["Love the eggrolls, hunan chicken, and crispy wontons. ", "House special friend rice is also great."], "author": "Tia L.", "review": "Love this place. We(my office) go there at least once per week and order a variety of things. It is refreshing to have something authentic on union street since this area is often void of culture.  Love the eggrolls, hunan chicken, and crispy wontons. House special friend rice is also great.", "rating": 5, "date": "2015-04-29"}, {"excerpts": ["I had the chicken corn soup, hunan chicken, and fried rice.  ", "Nothing really stuck out to me, to be completely honest.  "], "author": "Vince S.", "review": "Pretty much your average Chinese restaurant.\n\nI had the chicken corn soup, hunan chicken, and fried rice.  Nothing really stuck out to me, to be completely honest.  But if you're craving for some decent chinese food in this area (without the marina pricetag), I wouldn't pass this place up.\n\nIt's tucked away from the street too, so you kind of have to seek it out.\n\nI've also had the lunch special here, which is also a pretty good value.", "rating": 3, "date": "2009-08-30"}, {"excerpts": ["Shirmp fried rice was good for $6 (dinner), Hunan Chicken was pretty tasty and the potstickers were good. ", "$24 with tip + tax for 2 people. ", "A steal in Marina!", "\""], "author": "Jocelyn L.", "review": "\"Cheap, pretty tasty and good service. Shirmp fried rice was good for $6 (dinner), Hunan Chicken was pretty tasty and the potstickers were good. $24 with tip + tax for 2 people. A steal in Marina!\"", "rating": 3, "date": "2009-02-08"}], "steamed chicken half": [], "crispy fried chicken half": [], "chicken wings roasted with salt and chili pepper": [], "sauteed chicken with string beans": [], "chicken broccoli": [{"excerpts": ["I recommend the chicken broccoli entree. ", "This is definitely our favorite little spot when we're home :)"], "author": "Baylee R.", "review": "My partner and I LOVE this hidden gem. We moved in right around the corner about a year ago and found this spot and we dine in or takeout at least once a week. Very cheap and delicious food. Never had a problem with orders. Employees are very very nice. The restaurant has lots of seating and is usually very quiet and relaxing. We love their rice - always cooked so well and tastes so good. I recommend the chicken broccoli entree. This is definitely our favorite little spot when we're home :)", "rating": 5, "date": "2018-08-26"}], "beef broccoli": [], "beef in orange sauce": [], "beef in oyster sauce": [], "beef with tender green": [], "beef with bean curd in oyster sauce": [], "sauteed beef with tomato": [], "sesame beef in sweet and hot sauce": [], "sauteed beef with double mushrooms and snow peas": [], "ginger garlic shredded pork": [], "imperial pork chop in sweet orange sauce": [], "dried fried pork chop with salt and chili pepper": [], "shredded pork sauteed with eggplant": [], "sliced pork sauteed with sweet ginger and pineapple": [], "mixed vegetable combination": [], "hunan string bean  dry stirfried with garlic": [], "braised tofu": [], "mixed vegetables with tofu": [], "ginger garlic eggplant": [{"excerpts": ["Ginger Garlic Eggplant ($6.75) is a classic dish and one of my favorites.\n", "Beef Chow Mein ($5.55) was solid.\n", "Steamed Half Chicken ($8.25) was a large portion of chicken.\n", "+ 1: ", "cheap - seriously, our dinner tab came out to $10 or $11 pp, and that was after tax and tip. ", "That's the kind of prices we should all be paying."], "author": "Cindy W.", "review": "I'm rounding up to 4 stars because Hunan Empire gets a big bonus for being an authentic Chinese restaurant in the heart of the Marina / Cow Hollow area. I mean, across the street is Betelnut, which pales in comparison for authenticity. I had always wondered how this random Chinese restaurant could survive here, but now I understand.\n\n+ 1: open late - where can one go for good grub on a weekday night at 9:30p. We had just finished rock climbing and were hungry. While even Osha was closed, Hunan Empire was open, and in fact stayed open just for our table of 5. That's awesome!\n+ 1: authentic - the menu features a wealth of dishes. There are comfort items from Ma Po Tofu to more specialized items like Twice Cooked Pork. Impressive.\n+ 1: food - we all liked what we ordered shared family style of course. Salt & Pepper Fish Fillet ($7.95) was freshly fried, nice light batter. Yum!\nGinger Garlic Eggplant ($6.75) is a classic dish and one of my favorites.\nBeef Chow Mein ($5.55) was solid.\nSteamed Half Chicken ($8.25) was a large portion of chicken.\n+ 1: cheap - seriously, our dinner tab came out to $10 or $11 pp, and that was after tax and tip. That's the kind of prices we should all be paying.", "rating": 4, "date": "2011-01-10"}], "black mushroom and tender green in garlic sauce": [], "mustard green sauteed with garlic sauce": [], "broccoli sauteed with garlic sauce": [], "steamed chinese broccoli in oyster sauce": [], "chinese broccoli with  kinds of mushrooms": [], "salt and chili pepper tofu": [], "shrimp and bbq pork fried rice": [], "mixed vegetable chow mein": [], "shrimp and bbq pork chow mein in curry sauce": [], "chow fun": [{"excerpts": ["Fried Rice & Chow Fun\n\n"], "author": "Lilian C.", "review": "I've ordered Delivery two times:\n1. House Special Fried Rice & Chow Mein \n2. Fried Rice & Chow Fun\n\nBoth times delivery was fast and food came hot, so I am happy with that.\n\nThe food was a O.K., but a bit tasteless. The quantity for the price is good! You get a lot of food for your money.\n\nOverall: it's not bad, but not super to my liking. But I might still order from here again.", "rating": 3, "date": "2018-01-22"}, {"excerpts": [": I returned to try the chicken chow fun. ", "It hit the spot. ", "Definitely have to just try the various dishes to find the one you like. ", "Yum!"], "author": "Lisa T.", "review": "Always walked past their huge menu posted on the building, finally decided to try it for lunch since they have a pretty cheap lunch menu.\n\nWalked in, empty place (guess they do more deliveries than people eating there).  Seated right away.  I ordered the chicken and green beans (my favorite Chinese dish) and a side of egg rolls.\n\nChicken & Green Beans - the taste wasn't what I was used to, didn't really like it but I didn't want to waste my money.  Since it was a lunch special it came with a side of rice and a small, small side soup (which is okay in taste).\n\nEggrolls were average in flavor, came with sweet/sour dipping sauce.\n\nYou pretty much get what you pay for in terms of quality.  I may return to try something else to see if they have anything better.\n\n\nUPDATE: I returned to try the chicken chow fun. It hit the spot. Definitely have to just try the various dishes to find the one you like. Yum!", "rating": 4, "date": "2011-09-24"}, {"excerpts": ["I also dashed in for some quick carry out and was met with an almost 40 min wait for my Chow Fun and Chinese Broccoli Not cool when I am on a limited lunch break and STARVING.\n", "Hmmph. ", "The food is decent enough, they use compost friendly starch containers, and the prices are reasonable, but somehow I just can't get the dirty toilet sponge image out of my head."], "author": "Drea L.", "review": "You can tell a lot about a place typically by the condition of their bathroom facilities. Pealing, moldy wallpaper  with a dirty scrubber sponge (whose whereabouts I don't even want to think about) sitting on the sink, made my appetite wane I must admit. I also dashed in for some quick carry out and was met with an almost 40 min wait for my Chow Fun and Chinese Broccoli Not cool when I am on a limited lunch break and STARVING.\nHmmph. The food is decent enough, they use compost friendly starch containers, and the prices are reasonable, but somehow I just can't get the dirty toilet sponge image out of my head.", "rating": 3, "date": "2008-03-27"}, {"excerpts": ["Chow fun is very tasty..\n\n"], "author": "Guy K.", "review": "Very Good Chinese food.  Very nice staff. Good prices.\n\nMo Shu Chicken is pretty darn good.  Potstickers are awesome.  Chow fun is very tasty..\n\nThey probably take a hit because of their hidden location.", "rating": 4, "date": "2009-07-30"}, {"excerpts": ["So I took my huge portion of chicken chow fun back to work...and it smelled sooooo GOOD. ", "Took 1 bite, and I'm hooked!"], "author": "Lola D.", "review": "Ordered take out from here a good couple of months ago. Totally forgot to write about it. Closet Chinese place I could find in the Marina on Union. I was sure they delivered, but when I asked for it (after lunch rush hour) they said it be best for me to pick it up. Lucky me, I work close by.\nThe place was empty when I arrived. A bit scattered looking, but most Chinese places are. The lady at the front was pleasant enough. So I took my huge portion of chicken chow fun back to work...and it smelled sooooo GOOD. Took 1 bite, and I'm hooked!", "rating": 4, "date": "2012-02-28"}], "happy family dinner": [], "general tsos chicken combo": [], "kung pao chicken combo": [], "cashew nut chicken combo": [], "beef broccoli combo": [], "mongolian beef combo": [], "hunan beef combo": [], "sweet and sour pork combo": [], "ginger garlic shredded pork combo": [], "string bean with tofu combo": [], "mixed vegetables combo": []}