{"saint agur": [], "serra de estrella": [{"excerpts": ["Accompanying the wines were two sheep's milk cheese (my favorite!), Serra de Estrella and Ossua-Iraty. ", "The first was from Portugal and soft; the second was from France and firm! ", "Now I love soft sheep's milk, but I was so impressed with the sweet, buttery flavor of the firm cheese. "], "author": "Liz T.", "review": "This is not a hotel in a dimly lit back street--it's just a bar in a dimly lit back street. My friend dan h. said we were having drinks at Hotel Biron before dinner at Alexander's Steakhouse, and I was admittedly weirded out for two seconds before seeing it listed as \"wine bar\" on Yelp. Whew--I'm not one to go to a hotel after dinner, let alone before dinner. Haha.\n\nI tried the 2006 Malbec from Argentina and 2009 Tempranillo from Spain, both of which were solid. The Malbec has converted me into a fan of Argentinian wine. I will be the first to confess I can't tell the difference between a $35 and a $135 bottle of wine, though.\n\nAccompanying the wines were two sheep's milk cheese (my favorite!), Serra de Estrella and Ossua-Iraty. The first was from Portugal and soft; the second was from France and firm! Now I love soft sheep's milk, but I was so impressed with the sweet, buttery flavor of the firm cheese. If only I had fruit to cut the savory cheese, I'd be in heaven.\n\nGreat wine bar and walking distance from my hub. Why do all my friends just want to drink cocktails?", "rating": 4, "date": "2011-02-13"}, {"excerpts": ["Serra de Estrella - Portugese washed rind sheep's milk cheese \nMahón-Menorca - Spanish firm washed rind raw cow's milk cheese\nCapricious - Californian hard aged goat's milk cheese\n", "Petit Agour - French hard sheep's milk cheese \nRocchetta - Italian semi-soft goat, sheep, & cow's milk cheese \n"], "author": "Kalani C.", "review": "Quite the opposite of the Hôtel Biron in Paris.  This literal hole in the wall along an alleyway behind Zuni Restaurant offers an experience not as grand as the original hôtel particulier, but charming nonetheless.  \n\nA nondescript entrance leads you to a narrow, dark space lit low with brick walls and copper pilings.  Ordering is done soley at the bar.  Delicious Spanish and Italian vino offerings, however their cheese platings impress and certaintly delight:\n\nOld Quebec - Canadian 3yr aged raw cow's milk cheddar \nGrevenbroeker - Belgian raw cow's milk blue cheese\nSerra de Estrella - Portugese washed rind sheep's milk cheese \nMahón-Menorca - Spanish firm washed rind raw cow's milk cheese\nCapricious - Californian hard aged goat's milk cheese\nPetit Agour - French hard sheep's milk cheese \nRocchetta - Italian semi-soft goat, sheep, & cow's milk cheese \nVignelait - French triple cream cow's milk cheese\n\nCheese selections are $6/each and accompaniments such as dried fruit, preserves and nuts are $3/each.\n\nService is simple and unnoticeable while the ambiance is cozy, intriguing and almost sinister.  A place perhaps Rodin would frequent to discuss why the Paris Salon rejected his masterpiece L'Age d'Airin in 1877.  Or perhaps Rodin would visit here to ponder the nuances of the wines and essence of the artisinal cheeses.\n\n\"What makes my Thinker think is that he thinks not only with his brain, with his knitted brow, his distended nostrils and compressed lips, but with every muscle of his arms, back, and legs, with his clenched fist and gripping toes.\"-Auguste Rodin", "rating": 5, "date": "2010-06-04"}, {"excerpts": ["There is nothing quite like ending a hard day at work with a glass of wine and a cheese plate with serra de estrella at hotel biron.\n", "This spot has a comfortable and relaxing ambiance. ", "It doubles as an Art Gallery with work from different artist which always adds a unique touch to every visit.\n", "They have many wines by the glass available and you can order a cheese plate until like 12am which is great for us restaurant folk who don't really feel like Jack in the Box downtown.\n", "Hotel Biron is awesome but not as awesome as Chris."], "author": "Caroline G.", "review": "There is nothing quite like ending a hard day at work with a glass of wine and a cheese plate with serra de estrella at hotel biron.\nThis spot has a comfortable and relaxing ambiance. It doubles as an Art Gallery with work from different artist which always adds a unique touch to every visit.\nThey have many wines by the glass available and you can order a cheese plate until like 12am which is great for us restaurant folk who don't really feel like Jack in the Box downtown.\nHotel Biron is awesome but not as awesome as Chris.", "rating": 5, "date": "2009-02-17"}], "capricious": [{"excerpts": ["Serra de Estrella - Portugese washed rind sheep's milk cheese \nMahón-Menorca - Spanish firm washed rind raw cow's milk cheese\nCapricious - Californian hard aged goat's milk cheese\n", "Petit Agour - French hard sheep's milk cheese \nRocchetta - Italian semi-soft goat, sheep, & cow's milk cheese \n"], "author": "Kalani C.", "review": "Quite the opposite of the Hôtel Biron in Paris.  This literal hole in the wall along an alleyway behind Zuni Restaurant offers an experience not as grand as the original hôtel particulier, but charming nonetheless.  \n\nA nondescript entrance leads you to a narrow, dark space lit low with brick walls and copper pilings.  Ordering is done soley at the bar.  Delicious Spanish and Italian vino offerings, however their cheese platings impress and certaintly delight:\n\nOld Quebec - Canadian 3yr aged raw cow's milk cheddar \nGrevenbroeker - Belgian raw cow's milk blue cheese\nSerra de Estrella - Portugese washed rind sheep's milk cheese \nMahón-Menorca - Spanish firm washed rind raw cow's milk cheese\nCapricious - Californian hard aged goat's milk cheese\nPetit Agour - French hard sheep's milk cheese \nRocchetta - Italian semi-soft goat, sheep, & cow's milk cheese \nVignelait - French triple cream cow's milk cheese\n\nCheese selections are $6/each and accompaniments such as dried fruit, preserves and nuts are $3/each.\n\nService is simple and unnoticeable while the ambiance is cozy, intriguing and almost sinister.  A place perhaps Rodin would frequent to discuss why the Paris Salon rejected his masterpiece L'Age d'Airin in 1877.  Or perhaps Rodin would visit here to ponder the nuances of the wines and essence of the artisinal cheeses.\n\n\"What makes my Thinker think is that he thinks not only with his brain, with his knitted brow, his distended nostrils and compressed lips, but with every muscle of his arms, back, and legs, with his clenched fist and gripping toes.\"-Auguste Rodin", "rating": 5, "date": "2010-06-04"}, {"excerpts": ["I've had the Grevenbroeker (blue cow), the Capricious (hard goat), the Vignelait (creamy cow), the Robiola (soft and creamy) and the Rochetta (semi-soft blend of goat, cow, and sheep).  ", "All are tasty, but I prefer the softer cheeses to the harder.  "], "author": "Kira K.", "review": "This narrow alleyway wine bar is wedged between buzzy Zuni cafe on Market Street on one side, and ever-congested Gough Street on the other.  But once you find Hotel Biron in all its discreet glory, and step inside, you'll be amazed at how divine of an experience you can have.  \n\nI recently came here on two separate occasions - once on a Friday night at around 9pm, and once on a Sunday night at around 8pm.  It seems that Friday nights are infinitely more popular (as is with any beverage or dining establishment) and it took me a while to warm up to the place.  I couldn't hear my bf talk, let alone myself, because the aluminum siding on one side of the room made everything echo in addition to amplifying the voices.  We had to stand for a while, too, because there was nary a spare seat to be found.  We got lucky and landed the comfy couch right next to the bar, and from there we were able to really enjoy the intimacy of the place.  I sampled a red from France and a Napa rosé and preferred the French more.  \n\nOur Sunday night excursion was MUCH, MUCH more enjoyable.  We found a seat immediately and had a glass of the Dow's Port and a Murphy's Irish Stout.  The cheese selection here is fantastic.  I've had the Grevenbroeker (blue cow), the Capricious (hard goat), the Vignelait (creamy cow), the Robiola (soft and creamy) and the Rochetta (semi-soft blend of goat, cow, and sheep).  All are tasty, but I prefer the softer cheeses to the harder.  Goes great with the baguette they serve you, or you also have your choice of fruit.\n\nI love how international the wine list is, and the art on the walls is fun to admire as you sip your worries away.", "rating": 4, "date": "2010-03-01"}], "ossuairaty": [], "la tur": [], "vignelait": [{"excerpts": ["Vignelait - French triple cream cow's milk cheese\n\nCheese selections are $6/each and accompaniments such as dried fruit, preserves and nuts are $3/each.\n\n"], "author": "Kalani C.", "review": "Quite the opposite of the Hôtel Biron in Paris.  This literal hole in the wall along an alleyway behind Zuni Restaurant offers an experience not as grand as the original hôtel particulier, but charming nonetheless.  \n\nA nondescript entrance leads you to a narrow, dark space lit low with brick walls and copper pilings.  Ordering is done soley at the bar.  Delicious Spanish and Italian vino offerings, however their cheese platings impress and certaintly delight:\n\nOld Quebec - Canadian 3yr aged raw cow's milk cheddar \nGrevenbroeker - Belgian raw cow's milk blue cheese\nSerra de Estrella - Portugese washed rind sheep's milk cheese \nMahón-Menorca - Spanish firm washed rind raw cow's milk cheese\nCapricious - Californian hard aged goat's milk cheese\nPetit Agour - French hard sheep's milk cheese \nRocchetta - Italian semi-soft goat, sheep, & cow's milk cheese \nVignelait - French triple cream cow's milk cheese\n\nCheese selections are $6/each and accompaniments such as dried fruit, preserves and nuts are $3/each.\n\nService is simple and unnoticeable while the ambiance is cozy, intriguing and almost sinister.  A place perhaps Rodin would frequent to discuss why the Paris Salon rejected his masterpiece L'Age d'Airin in 1877.  Or perhaps Rodin would visit here to ponder the nuances of the wines and essence of the artisinal cheeses.\n\n\"What makes my Thinker think is that he thinks not only with his brain, with his knitted brow, his distended nostrils and compressed lips, but with every muscle of his arms, back, and legs, with his clenched fist and gripping toes.\"-Auguste Rodin", "rating": 5, "date": "2010-06-04"}, {"excerpts": ["I've had the Grevenbroeker (blue cow), the Capricious (hard goat), the Vignelait (creamy cow), the Robiola (soft and creamy) and the Rochetta (semi-soft blend of goat, cow, and sheep).  ", "All are tasty, but I prefer the softer cheeses to the harder.  "], "author": "Kira K.", "review": "This narrow alleyway wine bar is wedged between buzzy Zuni cafe on Market Street on one side, and ever-congested Gough Street on the other.  But once you find Hotel Biron in all its discreet glory, and step inside, you'll be amazed at how divine of an experience you can have.  \n\nI recently came here on two separate occasions - once on a Friday night at around 9pm, and once on a Sunday night at around 8pm.  It seems that Friday nights are infinitely more popular (as is with any beverage or dining establishment) and it took me a while to warm up to the place.  I couldn't hear my bf talk, let alone myself, because the aluminum siding on one side of the room made everything echo in addition to amplifying the voices.  We had to stand for a while, too, because there was nary a spare seat to be found.  We got lucky and landed the comfy couch right next to the bar, and from there we were able to really enjoy the intimacy of the place.  I sampled a red from France and a Napa rosé and preferred the French more.  \n\nOur Sunday night excursion was MUCH, MUCH more enjoyable.  We found a seat immediately and had a glass of the Dow's Port and a Murphy's Irish Stout.  The cheese selection here is fantastic.  I've had the Grevenbroeker (blue cow), the Capricious (hard goat), the Vignelait (creamy cow), the Robiola (soft and creamy) and the Rochetta (semi-soft blend of goat, cow, and sheep).  All are tasty, but I prefer the softer cheeses to the harder.  Goes great with the baguette they serve you, or you also have your choice of fruit.\n\nI love how international the wine list is, and the art on the walls is fun to admire as you sip your worries away.", "rating": 4, "date": "2010-03-01"}, {"excerpts": ["kicking myself for not remembering the name, but it paired well with the cheese, Vignelait, a triple cream cow's milk.  "], "author": "Juv C.", "review": "A little pre-dinner buzz.  After a long day at work, its refreshing to sit back and relax with a couple glasses of wine over good conversation.  Actually, make that interesting conversation.  Did you know that animals believe in monogamy?  And that male animals have the right to an EPC (extra pair copulations) but if the female were to do the same thing, she would be shunned?  Yeah i didnt either.  Just goes to show that double-standards not only exist amongst humans, but the animal kingdom as well.  Males....cant live with em, cant live without em.  \n\nThe white wine i had was fantastic and im kicking myself for not remembering the name, but it paired well with the cheese, Vignelait, a triple cream cow's milk.  So soft and so creamy, i would have eaten more had dinner time not been slowly approaching.\n\nI like the secret location of Hotel Biron.  Its tucked away in a side alley you would never know it was there.  Very cozy and quaint wine bar, almost hallway-like with a few tables lining the entrance and a backroom with two couches.  And its extremely dim in here with candles illuminating each table.\n\nThis cute little hide-a-way wine bar is the kind of place i can enjoy multiple delicious bottles of wine with someone, and then ditch their body in the alley when im done if i decide their company is no longer needed.  4 stars!", "rating": 4, "date": "2009-08-03"}, {"excerpts": ["Strongly recommend you try the Vignelait  ", "French triple cream cow's milk cheese with your glass of Zin.  ", "It is simply put, divine."], "author": "Emily G.", "review": "This place is dark, cavernous and sexy.  The wine list is expansive and the mixed media art on the walls really adds to the ambiance. A friend brought me here for my birthday and it will certainly become one of my regular haunts once I move to the city (and definitely when I visit in the mean time).\n\nStrongly recommend you try the Vignelait  French triple cream cow's milk cheese with your glass of Zin.  It is simply put, divine.", "rating": 5, "date": "2010-01-16"}], "olives": [{"excerpts": ["We tried a couple of cheeses and some olives.  "], "author": "SalsaBoy S.", "review": "I liked Hotel Biron.  It was loud and crowded even at an early time, but it can be cozy and intimate (can be, but isn't necessarily, depending on where one sits).  I liked the bartender, who made some good suggestions about various types of wines I might like based on my preferences.  \n\nBiron also has some limited food options -- mostly charcuterie and cheeses.  We tried a couple of cheeses and some olives.  That was nice.\n\nBiron isn't what I'd call cheap.  A glass a wine, after tax and tip was $18.  For a date, a couple glasses of wine and a sampling of cheeses could easily run $100 or more for two for what would hardly be a substantial experience.  Hey, this is SF in 2014. What can you do?\n\nI'd go back.  I'd probably prefer to visit when it's not as likely to be as crowded.  There is no table-side service, so if its packed, it could take a while to stand in queue to order at the bar.", "rating": 4, "date": "2014-02-16"}, {"excerpts": ["tastes) a cheese plate with some amazing olives, quince paste, and choose-your-own cheeses, and several bottles of wine ", "and I THINK we had dinner at Paul K, nearby "], "author": "Nikki M.", "review": "A lovely place to spend a chilly afternoon...we selected Hotel Biron not wanting to deal with a whole scene for a happy hour one Friday afternoon. We scored a cozy couch and a bottle of Vino Verde and the four of us settled into what we thought was a relaxed intimate evening....\n\nFast forward to more friendly service and suggestions (read: tastes) a cheese plate with some amazing olives, quince paste, and choose-your-own cheeses, and several bottles of wine and I THINK we had dinner at Paul K, nearby but I can't be sure...\n\nYou want good times, you want hotel biron.", "rating": 4, "date": "2009-07-27"}, {"excerpts": ["The food offerings are fairly good, but I wasn't impressed by the cost to quality ratio of it all (we got cheese, baguette, dates, almonds, olives, etc. - basically, the works).\n\n"], "author": "B L.", "review": "Warning, this place doesn't have real food, so if you're hungry, get dinner first!\n\nThis is an amazingly amazing wine bar.  I've traveled and done wine tours around the world from Italy to Australia and I'm very big on wines.  They have an intensely awesome selection that was clearly put together by a refined palate.  However, I do have to say that the bartender was not very nice.  He seemed annoyed when I asked him for a wine suggestion, any wine, any color.  I've worked in fine dining before and when someone asks me for a suggestion and can't decide between red/white/pink/sparkling, I suggest one of everything.  I don't get pissed off at them for being indecisive, especially if they can't pick because everything sounds so good!\n\nThere is no table service, so any time you need anything, you have to go up to the bar to get it.  There is one guy who runs the place, so service can be slow if you show up around 7-8 PM.  The food offerings are fairly good, but I wasn't impressed by the cost to quality ratio of it all (we got cheese, baguette, dates, almonds, olives, etc. - basically, the works).\n\nIt is an amazing space with sprawled, varied seating and couches.  And apparently they often have live music coming from the back room.  Really great, intimate space, but get there early so you have somewhere to sit.  If you're looking to impress a foodie wine girl you're taking out, this is the spot.\n\nNOTE: People refer to this place as just \"B\" or \"B Wine Bar\" for the notorious bright yellow B sign on the outside.  However, if you need to Google map it, it is called Hotel Biron.", "rating": 4, "date": "2012-08-14"}, {"excerpts": ["The menu also offers a tasty selection of cheese and olives - yum!\n\n"], "author": "Fontane L.", "review": "Awesome place for happy hour with friends, or even a work event.  There is a great selection of foreign wines, and I love how they let you taste a few if you're unsure which one to get.  The menu also offers a tasty selection of cheese and olives - yum!\n\nThe main minus is the stinky alley storefront?  It does add some mystery, and it does keep the place a nice little secret, but sometimes I don't really want to pass garbage cans on the way in?  I admit that I tend to not mind so much after a few drinks...", "rating": 4, "date": "2010-06-03"}, {"excerpts": ["We enjoy one or two glasses of delectable wine accompanied by just the right amount of cheese and baguette and a little apple or pear or olives and melt away or into each other.  ", "We've always gone early in the evening and early in the week, so I imagine that it fills up and becomes much more lively later on..."], "author": "Mac M.", "review": "Update:  It most certainly does fill up later in the evening and especially on Friday's.\n+++\n\nMy honey and I love the Hotel B.  It feels like our private, secret, afterwork, decompress-zone.  We go almost once a week.  We enjoy one or two glasses of delectable wine accompanied by just the right amount of cheese and baguette and a little apple or pear or olives and melt away or into each other.  We've always gone early in the evening and early in the week, so I imagine that it fills up and becomes much more lively later on...", "rating": 4, "date": "2007-03-21"}, {"excerpts": ["Cheese, salami, fruit, nuts and olives are also available to nibble on. \n\n"], "author": "Tina Y.", "review": "Groupon.com deal of the day: $30 gift certificate to Hotel Biron for $15?!? Don't mind if I do!!\n\nTucked away in a small alley in Hayes Valley this place is a wonderful find! Identified only by the circular red \"B\" sign fixated above the door, this place is easy to miss. It's a small and narrow establishment with lots of round tables all around the room and a couch in the back. Pictures of naked women grace the walls. The dim lighting and soft flicker of candles makes this a great date spot. \n\nGreat wine selection. Cheese, salami, fruit, nuts and olives are also available to nibble on. \n\nI would have given this place 5 stars had it not been for the bartender. He was a bit snippy with me but I'm just going to assume you were having a bad day. Grab a glass of wine and chill, dude.", "rating": 4, "date": "2009-09-20"}, {"excerpts": ["A standard pairing of cheese, meat, and olives rounds out your tasting.\n\n"], "author": "Jeff H.", "review": "Intimate and old-worldly, and often impossible to find standing room in, Hotel Biron is in a class all by itself. Its tiny, cavernous-feeling space evokes continental Europe, where the gastronomy is second place to the conversation and communion of people.\n\nThat this place is located in Deco Ghetto makes it all the more oddball.\n\nI don't necessarily call B's limited wine selection a fault, or a con. The space just seems too small to accommodate anything more.\n\nThat said, the selection is good enough, and the people who work here are always friendly enough to help you find something should you need it.\n\nA standard pairing of cheese, meat, and olives rounds out your tasting.\n\nAs Nicole G. and Tara R. have said, the place is unassuming and cozy, which works well when it's cold or hot.\n\nIf you care for wine at all, and love getting out of the house to drink it, Hotel Biron is a must.", "rating": 5, "date": "2008-05-11"}, {"excerpts": ["Get your cheese your bottle some olives...mmmmm, and your good to go."], "author": "Marivel M.", "review": "Petite. Lets say INCOGNITO...because lord knows I have walked by that ally plenty of times...and never NEVER did I notice this cute little wine bar! So the atmosphere is relaxing, rusticky sort of you can say. Small seating, there was a fairly large group of us sitting on and around a couch. It was fine, not tooo tight, a bit snug though. To snack they have cheese (of course, its a wine bar!) your choice either a baguette or some crackers, and your choice of fruit to compliment the flavors of the cheese. We ordered the....forot the name, but its third in the list...nice Brie like cheese, but smoother...very nice on the tounge. With Apples...an excellent combination!! The wine was yummy. They have a good selection of wines from either Australia...Napa...Italy...France...Argentina....and more. \nCheck it out....Get your cheese your bottle some olives...mmmmm, and your good to go.", "rating": 4, "date": "2006-06-23"}, {"excerpts": ["I love olives. ", "I love nuts (hahahahahaha). ", "You put wine in that mix "], "author": "Stacy L.", "review": "On a cold, rainy San Francisco night its places like these that really make me appreciate and love this city.\n\nI'm a wino. And I'm not usually a discriminatory wino, in fact me and Mr. Two Buck Chuck have been involved seriously for quite sometime...\n\nHowever sometimes its really delectable (like that word usage? me too)to do the wine \"thing\".\n\nI love the environment in here. Very small, very cozy, very maroon. Their wine selection is amazing and they have a great industry deal on...shit. Monday? Tuesday? One of those days....dammit. where was I?\n\nCheese.\nI love cheese. I love olives. I love nuts (hahahahahaha). You put wine in that mix and I'm pretty much in heaven.\n\nBest part? ITS IN MY NEIGHBOORHOOD!!!! Booya.", "rating": 5, "date": "2008-01-22"}, {"excerpts": ["A brief food menu including cheeses, seasonal fruits, charcuterie, and olives is designed to complement the wines.\n\n\n"], "author": "Leah B.", "review": "Hotel Biron is a quite small but very cozy wine bar and art gallery that lends touches of Paris to its comfortable and appealing ambiance. Very dim lighting, modern yet comfy decor, a handful of copper tables, wrought-iron bistro chairs and zinc-green walls decked with a revolving exhibition of local add to the mood, and form the perfect setting for an after-work get-together or romantic rendezvous. The staff is friendly and knowledgeable, and the wine list is interesting and not expensive. If you can, it makes sense to buy by the bottle as for the most part bottle prices are only 3 times that of the glass prices when offered. A brief food menu including cheeses, seasonal fruits, charcuterie, and olives is designed to complement the wines.\n\n\nI arrived a bit earlier than my friend and luckily was able to snag a table near the bar area, and ordered a glass of 2006 Sur \"de los Andes\" Torrontes. It was light and refreshing, but lacked a fruity quality that I had hoped it would have. Once my friend arrived we tasted a few red varietals, and decided to go with a bottle of Jenke Vineyards Shiraz from the Barossa Valley. It needed to breathe just a bit, but notes of berries and a strong earthy quality made it really delicious and interesting. We also tried a couple of the cheeses. Old Quebec, a Canadian raw cow's milk cheddar aged for 3 years was rich and creamy, and Serra da Estrela, a Portugese washed rind raw sheep's milk cheese, was also decadent and delicious. Hotel Biron is really an adorable spot I hope you get a chance to check out if you haven't already done so. It's just off Market Street on Rose just behind Zuni Cafe.", "rating": 4, "date": "2008-04-23"}, {"excerpts": ["We ordered two bottles of wine and two cheeses with olives -- only $24 per person!  ", "Quibbles: it suddenly became crowded with people with asymmetric haircuts, ironic and/or striped tees and supertight jeans around 8:30. ", "That kind of place.   ", "Also, the bartender didn't pour us our wine -- just the first one to taste. ", "Then handed the bottle and the glasses over."], "author": "Vanessa H.", "review": "For the record, we arranged to go here before it was \"discovered\" by the NYT. I've been to many wine bars in the city and this place has great parisian brick arty little nook feel.  We ordered two bottles of wine and two cheeses with olives -- only $24 per person!  Quibbles: it suddenly became crowded with people with asymmetric haircuts, ironic and/or striped tees and supertight jeans around 8:30. That kind of place.   Also, the bartender didn't pour us our wine -- just the first one to taste. Then handed the bottle and the glasses over.", "rating": 4, "date": "2007-09-11"}, {"excerpts": ["I've had this side of the pond and the olives were spot on as well. ", "The only thing that makes this place a 4 star and not a 5 star in my book is that you really have to spend a decent amount of money to have wine and snacks (all cheeses, meats etc. ", "cost $5 and fruit costs $2). ", "Still its certainly worth it to go every once in a while for a chill night out ", "and I can't wait to find an excuse to come back again!"], "author": "Nicholas B.", "review": "Checked this place out for the first time last night with some friends of mine on a rainy evening not really knowing what to expect as it was my first real SF wine bar experience and I have to say it was a very positive one. \n\nThe comparisons to Parisian hole-in-the-wall joints is certainly justified, it reminds me a lot of a few places I used to go hang out at in the Marais. There certainly is something really cool about utilizing a very small physical space in a location that is a bit off the beaten path for a place of merriment and congregation. Even though this place might not be much a secret any more being there certainly feels like it. I can imagine it a great place to take a first date to impress someone or for a night out for a birthday or other celebrations.\n\nThe artwork that was on display was really cool, a bunch of silkscreen-ish prints of San Francisco scenes in bright colors. Although it looks like it changes quite a bit it also looks like they have really good taste, if I had money to burn I would actually consider buying one! \n\nThis place being a wine bar I should probably say something about the wine. We split a bottle of Malbec from Argentina which was really tasty but wasn't the best wine I've ever had (then again, it was one of the more affordable bottles on the menu). The bartender was really helpful and chatty, letting people taste several different wines before making a choice. The cheese was some of the dankest (that's a good thing) I've had this side of the pond and the olives were spot on as well. The only thing that makes this place a 4 star and not a 5 star in my book is that you really have to spend a decent amount of money to have wine and snacks (all cheeses, meats etc. cost $5 and fruit costs $2). Still its certainly worth it to go every once in a while for a chill night out and I can't wait to find an excuse to come back again!", "rating": 4, "date": "2007-02-11"}, {"excerpts": ["Don't do the olives, not worthwhile. ", "Get there early if you'd like to really converse with someone as once it gets busier ", "it's pretty noisy."], "author": "C T.", "review": "At first glance, this place is a dump. Mismatched chairs, dark lighting, and a small space all combined look like someone's unfinished basement. But it grows on you. Service is friendly! Wine is delicious and the cheese is pretty tasty. Don't do the olives, not worthwhile. Get there early if you'd like to really converse with someone as once it gets busier it's pretty noisy.", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["The fact that you can create your own little plates of delish cheese, fruit, salami, olives and most importantly membrillo to pair up with their fabulous manchego is such a great idea.    ", "When i don't know what i want suggestions are graciously offered as well as a a taste.  ", "I've never met a wine here ", "that i didn't like.  ", "BONUS ROUND: ", "i come out with knowledge of some new band every single time."], "author": "Liz V.", "review": "let's see, i love cheese & i adore wine more than my first born...if & when I decide i can be without wine for 9 months.   The fact that you can create your own little plates of delish cheese, fruit, salami, olives and most importantly membrillo to pair up with their fabulous manchego is such a great idea.    When i don't know what i want suggestions are graciously offered as well as a a taste.  I've never met a wine here that i didn't like.  BONUS ROUND: i come out with knowledge of some new band every single time.", "rating": 5, "date": "2005-06-20"}, {"excerpts": ["love olives and cheese.\n\n"], "author": "shaine h.", "review": "love alleyway entrance.\n\nlove exposed brick.\n\nlove olives and cheese.\n\nlove polite gentlemen buying wine for our table in attempt to hit on my gorgeous friends.\n\nlove hotel biron.", "rating": 4, "date": "2006-12-01"}, {"excerpts": ["Find it and enter and you're sure to enjoy a cozy atmosphere with a large and affordable selection of wines, excellent cheeses, salami, and olives to boot!  ", "I can't complain about much, but I would imagine that this place would be kind of a drag if it was packed.  ", "There is so little room that you're literally sitting back to back with the table behind you.  ", "Outside of that, it's a great stop before or after Zuni's or the Brazilian grill next door."], "author": "Ross H.", "review": "A tiny, quaint, wine-bar that is so small, if you blink while driving up Rose Street, you'll miss it.  Find it and enter and you're sure to enjoy a cozy atmosphere with a large and affordable selection of wines, excellent cheeses, salami, and olives to boot!  I can't complain about much, but I would imagine that this place would be kind of a drag if it was packed.  There is so little room that you're literally sitting back to back with the table behind you.  Outside of that, it's a great stop before or after Zuni's or the Brazilian grill next door.", "rating": 4, "date": "2007-10-08"}, {"excerpts": ["grab an argentinian wine, order up some roasted olives and triple cream cheese, and enjoy the low key lighting and contemporary art draped on the walls.  ", "its the kinda place that could easily be in the village in nyc.  ", "worth going to."], "author": "Kevin J.", "review": "this out of the way wine bar in hayes valley is a great spot to meet someone on a first date or post dinner drink.  grab an argentinian wine, order up some roasted olives and triple cream cheese, and enjoy the low key lighting and contemporary art draped on the walls.  its the kinda place that could easily be in the village in nyc.  worth going to.", "rating": 4, "date": "2006-05-11"}, {"excerpts": ["Cheeses, salami and olives all served with bread.  ", "Finally, there's the wine list, which for the most part is very Euro-centric, but very good and quite reasonably priced.  ", "They also have beers, and some interesting non-alcoholic drinks like Fizzy Lizzy's Pomegranate and Apple juice.  ", "You'll love this place.  ", "Cheers."], "author": "Nicolas T.", "review": "The Hotel Biron is really cute.  It's just a tiny little wine bar located in a small little alley behind Market Street.  The venue could host a maximum of forty people stuffed.  It's dark and intimate.  The bar is all of six feet, but it feels friendly and comfy.  The staff is amenable, the first glass I ordered was corked and they took it back and gave me a different wine sans questions.  The crowd was hip and cute, fun people enjoying the wines and having a good time.  They do art exhibits and I was there when they had a very interesting display of a local group that specialized in kinetic art and regular art. The kinetic art was hypnotizing (something about blood platelets running through the veins, but I couldn't stop watching it).  The menu is sparse, but quality.  Cheeses, salami and olives all served with bread.  Finally, there's the wine list, which for the most part is very Euro-centric, but very good and quite reasonably priced.  They also have beers, and some interesting non-alcoholic drinks like Fizzy Lizzy's Pomegranate and Apple juice.  You'll love this place.  Cheers.", "rating": 4, "date": "2009-04-30"}], "pate": [{"excerpts": ["The cheese, pate, and riette were all VERY delicious and well worth the $7.\n\n"], "author": "Jeremy T.", "review": "Love this place! It's just like a quaint, casual European wine bar. \n\nI dropped a star, because the service can be European, as well. The servers - while very friendly and polite - are not attentive to the tables. One has to walk up to the bar to get wine and order munchies. But don't let that deter you!\n\nThe cheese, pate, and riette were all VERY delicious and well worth the $7.\n\nI tasted three wines: one champagne and two reds (all French). Absolutely rock star wines. It seems pricey at $13 per glass, but they really do pour a full glass of quality wine. Patrons are meant to show up with a friend or two and order a bottle, which is why there are so many bottles listed. Besides, that's how it works in many places in Italy.\n\nI added back the star I dropped at the beginning, because this place is open until 2am. It seems that so few wine bars do this! I found my new spot.", "rating": 5, "date": "2015-11-13"}, {"excerpts": ["They also have a wide selection of cheese, pate, salami and?. ", "We had an order of Buffalo cheese and pate and they were very very generous portions with a big loaf of thinly soft sliced baguette.\n\n"], "author": "T L.", "review": "(See pics)\n\nYou know those warm nights when you met friends whom you have not seen for a long time and just wanted a place to chill, a place to have great import and local wines, to have a small gathering place, to be on a quiet street, to be cozy and intimate without pretension? Hôtel Biron is it.\n\nAfter Yelp Elite event a few of us came down to continue the evening. The wine bar has a great and varied list of wines, from the reliable French, Italian and Spanish, to Greek, German/Austrian and Portuguese, to Argentina/Chile, and a good section of Californian ones.\n\nI opted for Albariño which was excellent for a warm night. They also have a wide selection of cheese, pate, salami and?. We had an order of Buffalo cheese and pate and they were very very generous portions with a big loaf of thinly soft sliced baguette.\n\nThis is an excellent hide away spot. The bar owner was super friendly and nice. We even bumped into another elite here.\n\nAnd remember to look up to the ceiling while you're ordering wines and food, it's a cute ceiling of corks! Take a look at the picture.\n\nAnd take a trip to the dark bathroom and look up to the ceiling which has a neat glass boat, kind of a gesture of the Atlantis!\n\nOoo how I love my Yelper friends! And how I enjoyed this little hidden gem that is tucked away with only a B sign.", "rating": 4, "date": "2011-05-05"}, {"excerpts": ["It ended up being a great cozy spot with a couple couches (the kind you sink right into) and some tasty snacks (we had some cheeses and pate). ", "The wine can be a bit pricey, but that's expected..."], "author": "Karena Q.", "review": "A friend suggested meeting here for a mellow weekday happy hour and I'll admit I was a bit weary of the location...it IS in an alley after all.\n\nIt ended up being a great cozy spot with a couple couches (the kind you sink right into) and some tasty snacks (we had some cheeses and pate). The wine can be a bit pricey, but that's expected...you're in it for the ambience, right?\n\nI loved the Momo Sauvignon Blanc and will for sure be back next time I need a low key night out!", "rating": 3, "date": "2013-10-07"}, {"excerpts": ["and then we shared a plate of cheese and pate served with a baguette.  ", "Even with a 20% tip, the total only came to $18/person and the cheese/pate serving was a large portion.\n\n"], "author": "Kimberly B.", "review": "This wine bar is a nice little hideaway tucked into the alley right by Zuni Cafe.  How did I miss this place all these years?!\n\nIt's actually unmarked, so you'd have to be looking for it.  When you step inside you feel like you're in a wine bar in another city like Paris or something.  It's cozy and intimate with brick walls and a few sofas interspersed with tables.  \n\nThe wine list is extensive and the staff can help you with suggestions.  The prices are on par with most of the other wine bars I've visited in SF.  I went with two other friends and we each had a glass of wine and then we shared a plate of cheese and pate served with a baguette.  Even with a 20% tip, the total only came to $18/person and the cheese/pate serving was a large portion.\n\nIt's not a large place and it was busy when we got there around 9PM on a Thursday, but the three of us were able to snag a table in the very back and there were a few scattered tables for two available.\n\nI'm so glad I discovered this little gem of a place and am already planning another trip!", "rating": 4, "date": "2011-04-26"}, {"excerpts": ["That, and the cheese and pate plates are a real treat if you want to spoil yourself a bit."], "author": "Spencer J.", "review": "Rotating wine lists with a good balance of Old World/New World.  If you're looking for a cheapo wine bar, this is not it (if I remember correctly avg glass price was somewhere btwn $10-20).  However, if you are hoping to run into a delighful Savennieres from France or a great Pinotage from South Africa, then you will have some luck here.  \n\nWhatever the list says on their website, it won't be true when you get there so don't plan in advance (note how they don't put any prices up on their site!).  That is also what makes the place fun, every time you go you can explore the new list and they have a very healthy by the glass selection.\n\nThis is the kind of bar for people who know wine or want try something outside of what they get in their local liquor store.  They have some of the standard Cab/Chard/Merlots, but they shine with the alternatives and you won't be disappointed with the quality of the wine, worth every penny.  That, and the cheese and pate plates are a real treat if you want to spoil yourself a bit.", "rating": 4, "date": "2007-02-23"}, {"excerpts": ["They have the usual cheese, pate, olive platters along with a nice selection of wines.  ", "Though prices aren't cheap, they won't charge for getting a taste of the wine first."], "author": "Kimmie N.", "review": "Walk too fast and you'll miss the lighted letter B above the doorway in Rose Alley behind Zuni Cafe.  It's a difficult place to find if sending friends for the first time.  But well worth the trouble especially after you spend a good half hour scouring the streets for parking.  \r\n\r\nA small front room with intimate tables and couches leads into a narrow hallway, and then to a backroom that's big enough to fit 5-6 people.  They have the usual cheese, pate, olive platters along with a nice selection of wines.  Though prices aren't cheap, they won't charge for getting a taste of the wine first.", "rating": 4, "date": "2006-01-04"}, {"excerpts": ["The pate is delicious.  ", "Fresh bread, fresh snacks.  ", "You can certainly leave here spending $50 bucks easily.  "], "author": "Sabrina A.", "review": "The owner Chris is amazing and very friendly.  Every time I need help finding something I like he has a recommendation.  He will even let me taste.  They have an amazing selection from France, Italy, Spain, Portugal, and US wines.  \n\nMy personal favorites are Bordeaux and Brunello.  Some you can buy by the glass and others you need to wait when you are with friends to buy the bottle.\n\nThe pate is delicious.  Fresh bread, fresh snacks.  You can certainly leave here spending $50 bucks easily.  Since it's all so delicious.\n\nI've even made out with a girl that hit on me at this bar and who thought I'd be meet a lezzie at a wine bar!  She did point at her girlfriend afterward though.  I love San Francisco.  I don't care for dives.  I'd rather meet someone at a wine bar.", "rating": 5, "date": "2009-07-22"}, {"excerpts": ["The duck pate was especially nice. \n\n"], "author": "Gabriel R.", "review": "Well, after a few friends had clued me in on how great this place was I finally stopped by with a friend this weekend and wasn't disappointed. It's a narrow space, nice and dark, and offers a wide selection of wines from around the world. The bartender, Allison, was well-informed and nice.\n\nThey offer a small but nice food menu which is something that any good wine bar should have to compliment their wines. The duck pate was especially nice. \n\nOne thing that I would like to see here is a larger bar space. With only room for about 4 bar stools, it can be difficult to reach the bartender once the place is full. Overall though, I met some great people, drank some very nice wine, ate some good complimenting foods and enjoyed myself.\n\nGo enjoy this European-style environment for yourself.", "rating": 4, "date": "2008-08-11"}, {"excerpts": ["Added bonus is the Fatted calf pate! ", "Perfect for newbies as well as wine geeks. ", "Get off your ass and drink some wine. ", "I enjoy coming here during the week. ", "The weekends do get crowded. ", "It is a fun place for friendly people. \n", "My friend and I sat looking at the construction across the street pondering if we should buy into the housing development they are building across the street. ", "How cool would that be to live across the street from Biron."], "author": "Jennifer S.", "review": "I just love this place. Chris has such an amazing selection and fabulous taste.  He buys really crafted wines at great price points. I especially enjoy the German/Austrian selections. He has great finds. Plus he even offers a fantastic fromage plate. Added bonus is the Fatted calf pate! Perfect for newbies as well as wine geeks. Get off your ass and drink some wine. I enjoy coming here during the week. The weekends do get crowded. It is a fun place for friendly people. \nMy friend and I sat looking at the construction across the street pondering if we should buy into the housing development they are building across the street. How cool would that be to live across the street from Biron.", "rating": 5, "date": "2006-08-17"}, {"excerpts": ["The compte cheese was so-so and stay away from the pate' - not good.  ", "The bartender was pretty cool and easy going.  ", "Over all it was a so so."], "author": "Jacque P.", "review": "Went there for the first time last night.  It was nice but hard to see anything it was so dark.  Also the staff was so busy they never replaced a few silverware pieces we'd asked for.  The compte cheese was so-so and stay away from the pate' - not good.  The bartender was pretty cool and easy going.  Over all it was a so so.", "rating": 3, "date": "2008-03-29"}, {"excerpts": ["Oh, and the classic French nibbles like charcuterie, pate, cheeses, etc. pair wonderfully with the wines - and are quite generous portions.  ", "I've honestly made a whole meal out of a couple of plates of the generous nibbles they have here.  ", "This is definitely my favorite wine bar and is in the running for my favorite bar period.  ", "I always have an amazing time here... "], "author": "Chris P.", "review": "I can't believe I have spent so many awesome nights in this place and have yet to write it an appropriate review.  This has got to be the bar where I feel the most comfortable, the most happy, the most transported back to a simpler way of doing things, thinking about things... oh, and feel like I'm at some hidden gem of a bar in an alleyway in Paris.  Yes, they've definitely got the Parisian look and feel hands down here - exposed brick and stone, wrought iron fixtures, very dim lighting, classic looking bar.  The wines by the glass list runs the gamut, touching every major wine producing region across the world giving you plenty of room to explore and experiment.  Oh, and the classic French nibbles like charcuterie, pate, cheeses, etc. pair wonderfully with the wines - and are quite generous portions.  I've honestly made a whole meal out of a couple of plates of the generous nibbles they have here.  This is definitely my favorite wine bar and is in the running for my favorite bar period.  I always have an amazing time here... this place just has a knack for keeping dates and friends on their best behavior ensuring a relaxing, joyful evening.", "rating": 5, "date": "2011-01-24"}, {"excerpts": ["it's delicious with some pate.  ", "The service is non-pretentious and the ambiance is intimate but sometimes stuffy."], "author": "regina k.", "review": "Great brick cozy, art-on-the-wall place with beer, wine and kind of a swanky feel without a busy scene.  Order the cheese platter..it's delicious with some pate.  The service is non-pretentious and the ambiance is intimate but sometimes stuffy.", "rating": 4, "date": "2007-11-20"}], "rillettes": [], "salame": [{"excerpts": ["The prices are not cheap - most of the wines are in the $12-15 a glass range, and the cheese and salame selections are $6/for each small serving.  ", "But... I will definitely be going again - often."], "author": "Nick C.", "review": "Great find. Interesting and tasty selection of wines from California, France, Italy, Argentina/Chile and Australia. Very good and unusual cheese selection, and other nibblies.  They have quince paste - which is yummy and unusual. Tons of funky comfy ambiance. A terrific date place.\nThe prices are not cheap - most of the wines are in the $12-15 a glass range, and the cheese and salame selections are $6/for each small serving.  But... I will definitely be going again - often.", "rating": 4, "date": "2010-07-16"}], "dates": [{"excerpts": ["Last time I went, I'm pretty sure most of the patrons were on dates. ", "It's a great space to split a bottle of mid-price wine ($50+)."], "author": "Bre D.", "review": "The ambiance is the real sell here -- dimly lit, cozy space. Last time I went, I'm pretty sure most of the patrons were on dates. It's a great space to split a bottle of mid-price wine ($50+).", "rating": 4, "date": "2017-05-10"}, {"excerpts": ["Five stars for the relaxed atmosphere and decor with local artists displayed, but 1 star deducted for the inequitable seating amenities, which appear to reward one lucky couple at a time with long-term parking on one of 2 huge couches,  while the majority of patrons (many there on dates, too) are relegated to far less comfortable options.   ", "Humble recommendation:  slim-line banquettes or movable ottomans might work better in this narrow space and offer more romantic situations around the room a chance to develop  ; )."], "author": "AM K.", "review": "FIve stars for the quality, variety and value of the wine list and small plates.   Also for the friendly, knowledgeable service  (we got great wine advice & service from a great bartender who'd moved to SF from Astoria, NY).   And last but not least, for providing a classic late-night, escape experience to two wandering Manhattanites.  Where else could you go at 10:30PM on a Sunday night and pretend it was still Saturday?\n\nFive stars for the relaxed atmosphere and decor with local artists displayed, but 1 star deducted for the inequitable seating amenities, which appear to reward one lucky couple at a time with long-term parking on one of 2 huge couches,  while the majority of patrons (many there on dates, too) are relegated to far less comfortable options.   Humble recommendation:  slim-line banquettes or movable ottomans might work better in this narrow space and offer more romantic situations around the room a chance to develop  ; ).", "rating": 4, "date": "2012-08-26"}, {"excerpts": ["The food offerings are fairly good, but I wasn't impressed by the cost to quality ratio of it all (we got cheese, baguette, dates, almonds, olives, etc. - basically, the works).\n\n"], "author": "B L.", "review": "Warning, this place doesn't have real food, so if you're hungry, get dinner first!\n\nThis is an amazingly amazing wine bar.  I've traveled and done wine tours around the world from Italy to Australia and I'm very big on wines.  They have an intensely awesome selection that was clearly put together by a refined palate.  However, I do have to say that the bartender was not very nice.  He seemed annoyed when I asked him for a wine suggestion, any wine, any color.  I've worked in fine dining before and when someone asks me for a suggestion and can't decide between red/white/pink/sparkling, I suggest one of everything.  I don't get pissed off at them for being indecisive, especially if they can't pick because everything sounds so good!\n\nThere is no table service, so any time you need anything, you have to go up to the bar to get it.  There is one guy who runs the place, so service can be slow if you show up around 7-8 PM.  The food offerings are fairly good, but I wasn't impressed by the cost to quality ratio of it all (we got cheese, baguette, dates, almonds, olives, etc. - basically, the works).\n\nIt is an amazing space with sprawled, varied seating and couches.  And apparently they often have live music coming from the back room.  Really great, intimate space, but get there early so you have somewhere to sit.  If you're looking to impress a foodie wine girl you're taking out, this is the spot.\n\nNOTE: People refer to this place as just \"B\" or \"B Wine Bar\" for the notorious bright yellow B sign on the outside.  However, if you need to Google map it, it is called Hotel Biron.", "rating": 4, "date": "2012-08-14"}, {"excerpts": ["Yes, I was on a first date, and I definitely prefer to be incognito on first dates, since I'm already self conscious as it is.  \n\n"], "author": "Danielle B.", "review": "You know the Sex and the City episode where Carrie and Big are just starting to date, and he always takes her to that Szechuan restaurant that is filled with couples who don't want to be seen by anyone they know?  Well, that's kinda the feeling that I got from Hotel Biron.  OK, so not everyone in there was on a date, but it seemed to be very easy to \"hide\" from the general public if you wanted.  Yes, I was on a first date, and I definitely prefer to be incognito on first dates, since I'm already self conscious as it is.  \n\nSo, I actually did like this place, as it does have a pretty cool vibe and some interesting pieces of art on the walls.  My glass of Cava was tasty (I love bubbles!).  And the whole place doesn't actually feel like a hideaway; it actually started getting quite lively by the time we were leaving.\n\nI'm sure I'll be back at some point. . .when I need to hide!", "rating": 4, "date": "2009-05-02"}, {"excerpts": ["Perfect for dates and little social get together."], "author": "Stanley K.", "review": "Only a few words can describe this place.\n\nSecluded. Intimate. Small yet very comfortable. \n\nThe selection of wine is listed from country to country. I enjoyed the Pinot Noir and 39*. Very delicious!\n\nPerfect for dates and little social get together.", "rating": 5, "date": "2008-03-03"}, {"excerpts": ["Well in that case, I'll have the triple cream brie and sweet medjool dates.  "], "author": "Becca A.", "review": "Dear Hotel Biron, \n\nHow lucky I feel to have found you, wondering the streets at 11pm looking for a place to rest my stilettos...\n\nI knew as stooped into your warm and dimly lit interior that I had found my match.  Dark leathery couches, unpretentious, inviting...I could tell at first sight that you were someone I could really settle in with.  \n\nAnd it's not just looks, Hotel Biron, that keeps my heart afloat.  You got SUBSTANCE.  I mean, look at that wine list.  Australia, France, South Africa, you are so CULTURED.\n\nBut, like any good relationship, things started to become shrouded in doubt.  I loved your spirits, but my soul hungered for more.  \n\nWait, what's that you say dearest?  You have tasty tidbits a plenty?  Well in that case, I'll have the triple cream brie and sweet medjool dates.  Yeah, just like that...\n\nDarling, as long as you continue to pour your heart into making mine happy I think we will have ourselves a life long affair.\n\nUntil next time...", "rating": 5, "date": "2007-11-26"}, {"excerpts": ["The food menu is very  limited... and expect to pay $3.00 for like 8 almonds or 3 dates as a side munchie. ", "Other then that, the wine selection is tasty."], "author": "Amaline B.", "review": "Sweet cozy ambiance for a date or small gathering of friends who want a nice glass of wine. The food menu is very  limited... and expect to pay $3.00 for like 8 almonds or 3 dates as a side munchie. Other then that, the wine selection is tasty.", "rating": 3, "date": "2012-01-23"}, {"excerpts": ["It's not a hotel, but a cozy, very intimate wine bar, with helpful sommeliers, a healthy selection of domestic and international wines, and tight-knit, candlelit seating for dates and small groups.\n\n"], "author": "Clar L.", "review": "A somewhat hidden gem, tucked away from discovery in the alley behind Zuni. It's not a hotel, but a cozy, very intimate wine bar, with helpful sommeliers, a healthy selection of domestic and international wines, and tight-knit, candlelit seating for dates and small groups.\n\nThe cheapest glass on tonight's menu went for $8, and everything else was about $13-26. Bottles are also available. If you're not sure what to try, let the sommeliers recommend something. They're very genial and patient, and if you tell them a little about what you like, they'll be able to find you a suitable wine or champagne, and which of their cheeses and meats to pair it with. Most of the items on their food pairing menu went for $5 each, with enough to share, and certainly much better than the supermarket-grade stuff I've seen in other SF wine bars for triple the price (tsk tsk!). Between baguette or cracker, I'd say their crackers are a good choice. Yummy!\n\nAnother thing of note: I noticed there was nearly all professional female patrons in this tiny wine bar tonight. Just two men came in the entire 4 hours I was there, and one left quite early. Indicative of the normal scene here? Hmm.", "rating": 4, "date": "2007-02-28"}, {"excerpts": ["That said, I've had more blind dates there than I can shake a stick at, and if you look around, you'll notice others doing the same.  ", "Luckily, I'm now happily coupled, so I no longer have to suffer the embarrassment of the staff recognizing me with a different guy every week."], "author": "Leigh A.", "review": "They lose a star for being too hot and loud on weekends, but that's not really their fault.  Well, on second thought, rugs or acoustic ceiling tiles would do wonders.  And maybe a ceiling fan in the back.  But I don't really go out on weekends anymore, anyway.\n\nI love this place with all my heart and love it more on an early Sunday evening.  (Don't you all get the same idea.  Leave me and my book and shiraz in peace.)  \n\nThat said, I've had more blind dates there than I can shake a stick at, and if you look around, you'll notice others doing the same.  Luckily, I'm now happily coupled, so I no longer have to suffer the embarrassment of the staff recognizing me with a different guy every week.", "rating": 4, "date": "2007-08-27"}, {"excerpts": ["This is a super hot spot for dates, and I highly recommend it for those that would like to like wines, but just haven't found the right one yet."], "author": "Meredith N.", "review": "This place is magic.  I was brought here by a friend, she really wanted wine and I am really not usually a wine drinker.  Ok I whine a bit, but don't do wine at all.  We walked in and I fell in love with the ambiance.  The art on the walls is amazing.  Then we spoke with one of the bartenders, I told her what types of flavors I like, and what I tend to dislike about previous wines.  She picked something out for me that was absolutely perfect.  I wanted to live there forever and ever and never leave, living the entirety of my life off of that glass of heaven.  \n\nThis is a super hot spot for dates, and I highly recommend it for those that would like to like wines, but just haven't found the right one yet.", "rating": 5, "date": "2008-09-14"}, {"excerpts": ["Mood lighting isn't just for making your dates look better kids!"], "author": "Jennifer D.", "review": "As I was driving past Hotel Biron this morning, I started thinking about my last visit.  More specifically, my last visit versus my first visit.  \nThe first time I wandered into this lovely hidden gem was on a dark fall night with some friends.  I loved how moody and European it felt - I have a major crush on exposed brick walls and this place had them in spades.  The fact that I can drink wine to my heart's content was a definite bonus.  Little nooks and secluded corners for more romantic encounters, and larger tables and more open areas for chatting with others.  I was smitten and vowed to become a regular.\nFast forward to ages later when I finally made it back in.  It's now for a late spring happy hour and I've gotta say, I was nowhere near as twitterpated as I was on my first visit.  Maybe it's the daylight.  Maybe they covered up some of the brick with plaster, and the plaster was all chippy and nicked.  Maybe the new seating isn't as comfy as the couches I seem to remember.  Maybe it was the weird smell or the fact that I didn't love my wine.  I can't be sure but whatever it was, it knocked a star off my initial impression.\nI still have a soft spot for the space and I tend to love the artwork they have on display, so I'll definitely be back - I think I'll just wait until it's dark enough to gloss over some of the flaws and put me in a more forgiving mood.  Mood lighting isn't just for making your dates look better kids!", "rating": 3, "date": "2007-07-09"}, {"excerpts": ["A favourite spot - the platter of almonds, dates, apple and cheese - the range of quirky seating arrangements - the closed in zinc bar - the huge range of bottles open and ready for a glass. ", "Sure there are some drawbacks - a corked wine from time to time, the art exhibition that seems more trash than class, the overbearing din when the place is packed. ", "But it all seems to hang together. ", "But there is something of a celebration of wine about the place, coupled with the enthusiasm for wine that you sense from the staff. ", "The wine list is just superb. ", "An exhibition that states \"bacchus drowns more than neptune\" didn't take me where I expected - the bassins of Versailles. ", "With that I have added a shot of the \"bassin de bacchus\" - which indicates the spirit of this lovely little wine bar."], "author": "Vera N.", "review": "First time I walked in here I was ready to walk back out - then something kind of transfixed me. It was that smell of wine from European cellars. A favourite spot - the platter of almonds, dates, apple and cheese - the range of quirky seating arrangements - the closed in zinc bar - the huge range of bottles open and ready for a glass. Sure there are some drawbacks - a corked wine from time to time, the art exhibition that seems more trash than class, the overbearing din when the place is packed. But it all seems to hang together. But there is something of a celebration of wine about the place, coupled with the enthusiasm for wine that you sense from the staff. The wine list is just superb. An exhibition that states \"bacchus drowns more than neptune\" didn't take me where I expected - the bassins of Versailles. With that I have added a shot of the \"bassin de bacchus\" - which indicates the spirit of this lovely little wine bar.", "rating": 4, "date": "2009-03-01"}, {"excerpts": ["I've been there a few times on dates and with friends and always noticed the service was just okay. ", "This last Sunday night (1/11/08) ", "I went there with on a date and he ordered some cheeses to have with the bottle of wine. ", "The server behind the bar was rude. ", "She actually started arguing with my friend. ", "I was embarrassed because I spoke so highly of this place. ", "I have worked in the service industry and know the golden rule#1 that the customer is always right. ", "Rule #2- refer to Rule#1", ", right?  ", "Perhaps the bartender/server should re-learn this."], "author": "Olivia R.", "review": "I love this place for the wine and ambiance. Good prices for bottles. I've been there a few times on dates and with friends and always noticed the service was just okay. This last Sunday night (1/11/08) I went there with on a date and he ordered some cheeses to have with the bottle of wine. The server behind the bar was rude. She actually started arguing with my friend. I was embarrassed because I spoke so highly of this place. I have worked in the service industry and know the golden rule#1 that the customer is always right. Rule #2- refer to Rule#1, right?  Perhaps the bartender/server should re-learn this.", "rating": 3, "date": "2009-01-13"}, {"excerpts": ["Great place for dates."], "author": "Kat F.", "review": "Great initimate wine bar located in a dark alley.  They have a long extensive wine list that begins at about $9 a glass. The decor reminds me of some of the underground bars in Italy. Great place for dates.", "rating": 4, "date": "2007-01-28"}, {"excerpts": ["this place just has a knack for keeping dates and friends on their best behavior ensuring a relaxing, joyful evening."], "author": "Chris P.", "review": "I can't believe I have spent so many awesome nights in this place and have yet to write it an appropriate review.  This has got to be the bar where I feel the most comfortable, the most happy, the most transported back to a simpler way of doing things, thinking about things... oh, and feel like I'm at some hidden gem of a bar in an alleyway in Paris.  Yes, they've definitely got the Parisian look and feel hands down here - exposed brick and stone, wrought iron fixtures, very dim lighting, classic looking bar.  The wines by the glass list runs the gamut, touching every major wine producing region across the world giving you plenty of room to explore and experiment.  Oh, and the classic French nibbles like charcuterie, pate, cheeses, etc. pair wonderfully with the wines - and are quite generous portions.  I've honestly made a whole meal out of a couple of plates of the generous nibbles they have here.  This is definitely my favorite wine bar and is in the running for my favorite bar period.  I always have an amazing time here... this place just has a knack for keeping dates and friends on their best behavior ensuring a relaxing, joyful evening.", "rating": 5, "date": "2011-01-24"}, {"excerpts": ["Good wine bar for dates if you want to avoid a loud bar or restaurant. ", "very mellow if you're in the mood for it."], "author": "Food L.", "review": "cool place in a hidden alley. ideal for a quick stop when you'ew out for the night. would have never found this place if it wasn't for my friend who'd already been here. Artsy dark ambience. They allow a mini wine tasting before you order a glass or bottle. Nice service. Place is small. A couple couches, but mostly chairs. Good wine bar for dates if you want to avoid a loud bar or restaurant. very mellow if you're in the mood for it.", "rating": 4, "date": "2008-01-01"}, {"excerpts": ["good for tete a tete dates or planning world domination."], "author": "Mary V.", "review": "i want to like this place, i really do, and i dig the euro ambience, the owner, and the rotating art, but i don't like any of the wines. oh well. we went on a thursday, right at 5, and the owner poured me a selection of wines from south africa, france, spain, greece, etc, to try, and me no rikey. i like my california wines, bitches. but once i settled back on the couch and began quaffing, my cares melted away. feels like an outdoor cafe inside. dim candlelight. gets crowded and it aint cheap. good for tete a tete dates or planning world domination.", "rating": 4, "date": "2008-03-14"}], "apples": [{"excerpts": ["With Apples...an excellent combination!! ", "The wine was yummy. ", "They have a good selection of wines from either Australia...", "Napa...Italy...", "France...", "Argentina....and more. \n", "Check it out...."], "author": "Marivel M.", "review": "Petite. Lets say INCOGNITO...because lord knows I have walked by that ally plenty of times...and never NEVER did I notice this cute little wine bar! So the atmosphere is relaxing, rusticky sort of you can say. Small seating, there was a fairly large group of us sitting on and around a couch. It was fine, not tooo tight, a bit snug though. To snack they have cheese (of course, its a wine bar!) your choice either a baguette or some crackers, and your choice of fruit to compliment the flavors of the cheese. We ordered the....forot the name, but its third in the list...nice Brie like cheese, but smoother...very nice on the tounge. With Apples...an excellent combination!! The wine was yummy. They have a good selection of wines from either Australia...Napa...Italy...France...Argentina....and more. \nCheck it out....Get your cheese your bottle some olives...mmmmm, and your good to go.", "rating": 4, "date": "2006-06-23"}], "pears": [{"excerpts": ["You must try the dry jack cheese and pears...\n\nfab!"], "author": "aynne v.", "review": "love this little place....\n\nYou must try the dry jack cheese and pears...\n\nfab!", "rating": 4, "date": "2006-08-16"}, {"excerpts": ["And I'm a fan of any place that offers quince paste and pears as sides. ", "As far as I'm concerned, rose champagne + art + cheese = a pretty good Thursday night."], "author": "Autumn W.", "review": "I've added last night's bartender to my list of cute cheese boys in the Bay Area. And he's high on my list of the The Cheese Knowledgeable, as he told me about a triple cream brie from Tasmania (ohmigawd?!?!) and served me a trio of cheeses, none of which I'd tried before. Let me tell you, that is a rare feat. And I'm a fan of any place that offers quince paste and pears as sides. As far as I'm concerned, rose champagne + art + cheese = a pretty good Thursday night.", "rating": 4, "date": "2005-12-30"}], "walnuts": [{"excerpts": ["Be sure to get the quince paste, walnuts, and pear.\n\n"], "author": "Richie K.", "review": "I feel bad reviewing this place--I've always wanted to keep this place to myself, but seeing how I only learned about this place from friends and HB already has been written up in Zagat and the NYTimes, the jig is up.\n\nGreat selection of wine, friendly staff, and their cheese/olive/fruit selections pair extremely well with wine and friends. Be sure to get the quince paste, walnuts, and pear.\n\nFlattering candlelight abounds for you and your fabulous friends/date. (Not so good for admiring the artwork, but that's not why you're there, is it?)", "rating": 5, "date": "2008-01-03"}], "quince paste": [{"excerpts": ["tastes) a cheese plate with some amazing olives, quince paste, and choose-your-own cheeses, and several bottles of wine ", "and I THINK we had dinner at Paul K, nearby "], "author": "Nikki M.", "review": "A lovely place to spend a chilly afternoon...we selected Hotel Biron not wanting to deal with a whole scene for a happy hour one Friday afternoon. We scored a cozy couch and a bottle of Vino Verde and the four of us settled into what we thought was a relaxed intimate evening....\n\nFast forward to more friendly service and suggestions (read: tastes) a cheese plate with some amazing olives, quince paste, and choose-your-own cheeses, and several bottles of wine and I THINK we had dinner at Paul K, nearby but I can't be sure...\n\nYou want good times, you want hotel biron.", "rating": 4, "date": "2009-07-27"}, {"excerpts": ["We got two cheeses (both amazing), quince paste, almonds, and honey. ", "Got a very generous portion of both cheeses, about a cup of almonds, huge portion of the quince paste, and a little bowl of honey. ", "The biggest, and best, surprise was that you got what looked like an entire sliced baguette! ", "You actually had enough bread to eat all the cheese...a big improvement over my hummus debacle yesterday where I got two slivers of pita to eat an entire bowl of hummus!! ", "Only downside was that the red, although good, was served a little warmer than it should have been...", "but our white was crisp, cold, and perfect!"], "author": "Tricia B.", "review": "Seriously...so narrow you can almost stretch out both arms and touch each side...hard to find...a nondescript entrance on a dark street...but worth hunting for!! Far enough off the beaten path that it isnt crammed with out-of-towners (except for me!).  \n\nExcellent wine selection and helpful staff. Prices about average...but generous pours. The cheese plates are about triple the size of any I have gotten in any other wine-cheese haunt...a very pleasant surprise! We got two cheeses (both amazing), quince paste, almonds, and honey. Got a very generous portion of both cheeses, about a cup of almonds, huge portion of the quince paste, and a little bowl of honey. The biggest, and best, surprise was that you got what looked like an entire sliced baguette! You actually had enough bread to eat all the cheese...a big improvement over my hummus debacle yesterday where I got two slivers of pita to eat an entire bowl of hummus!! Only downside was that the red, although good, was served a little warmer than it should have been...but our white was crisp, cold, and perfect!", "rating": 4, "date": "2011-07-09"}, {"excerpts": ["A $6 plate plus a $2 quince paste or almond side can substitute for dinner.\n\n"], "author": "Gil S.", "review": "The perfect wine bar, the most lovable and heartfelt I have seen anywhere.  Where can I start?\n\n* Most wines are $9-12 for a generous pour in a burgundy glass, $30-40  a bottle.  Mostly European with a smattering of South America, Australia, and US, they are interesting and well-chosen, which means you will get a tastier glass of lesser known wine at this price than paying half more at most restaurants.\n\n* The cheese plates here are even better than the wine, and if you ask they know the menu and are great at pairing.  Huge hunks of thick cut cheese from all over the world and half a loaf of sliced baguette.  A $6 plate plus a $2 quince paste or almond side can substitute for dinner.\n\n* The place is comfortable and completely unpretentious.  A dark candlelit cave off a back alley, there is barely a sign, just a slightly illuminated blue B.  You nave to know where to look.  But what an alley!  It's in the same cluster as one of SF's landmark restaurants and another great but expensive wine bar: Zuni and Cav.  Half the crowd are neighborhood regulars who have been coming  for years.\n\n* They play good music, mostly eclectic alt rock, noise pop, post punk, 60s psychedelia, and European pop, at high volume from a good sound system considering the space.\n\n* It is open until 2AM.  Every.  Day.  \n\nIf I found Biron in any city in the world I would write home how good the wine bars are there.  For this to be in our little town makes me happy to be here.", "rating": 5, "date": "2009-03-26"}, {"excerpts": ["Be sure to get the quince paste, walnuts, and pear.\n\n"], "author": "Richie K.", "review": "I feel bad reviewing this place--I've always wanted to keep this place to myself, but seeing how I only learned about this place from friends and HB already has been written up in Zagat and the NYTimes, the jig is up.\n\nGreat selection of wine, friendly staff, and their cheese/olive/fruit selections pair extremely well with wine and friends. Be sure to get the quince paste, walnuts, and pear.\n\nFlattering candlelight abounds for you and your fabulous friends/date. (Not so good for admiring the artwork, but that's not why you're there, is it?)", "rating": 5, "date": "2008-01-03"}, {"excerpts": ["They have quince paste - which is yummy and unusual. ", "Tons of funky comfy ambiance. ", "A terrific date place.\n"], "author": "Nick C.", "review": "Great find. Interesting and tasty selection of wines from California, France, Italy, Argentina/Chile and Australia. Very good and unusual cheese selection, and other nibblies.  They have quince paste - which is yummy and unusual. Tons of funky comfy ambiance. A terrific date place.\nThe prices are not cheap - most of the wines are in the $12-15 a glass range, and the cheese and salame selections are $6/for each small serving.  But... I will definitely be going again - often.", "rating": 4, "date": "2010-07-16"}, {"excerpts": ["And I'm a fan of any place that offers quince paste and pears as sides. ", "As far as I'm concerned, rose champagne + art + cheese = a pretty good Thursday night."], "author": "Autumn W.", "review": "I've added last night's bartender to my list of cute cheese boys in the Bay Area. And he's high on my list of the The Cheese Knowledgeable, as he told me about a triple cream brie from Tasmania (ohmigawd?!?!) and served me a trio of cheeses, none of which I'd tried before. Let me tell you, that is a rare feat. And I'm a fan of any place that offers quince paste and pears as sides. As far as I'm concerned, rose champagne + art + cheese = a pretty good Thursday night.", "rating": 4, "date": "2005-12-30"}], "cookie wag truffles": []}