{"insalata del borgo": [{"excerpts": ["I had the Insalata del Borgo which was a great starter (fresh radicchio, Pine nuts and Gorgonzola cheese) - simple and just the right amount of dressing and herbs. ", "Followed by the Fettuccine Bolognese which was one of the best I've had in San Francisco - more meat than tomato sauce and not oily at all. ", "The pasta was cooked perfectly al dente, piping hot. ", "If you want simple, honest, authentic Italian food in a romantic, cozy setting with warm, gracious service then I highly recommend this neighborhood place!"], "author": "Sonya S.", "review": "Drive by this place at night all the time. Finally stopped in for dinner last night. It was lovely - the owner was serving I think. Great place to practice speaking Italian! Italian pop music from the 80s playing in the background - I felt like I was on vacation in an Italian villa. The candle sticks burning in Chianti bottles on the tables is a romantic touch. For food, the warm crusty bread they give you after ordering is so good. I had the Insalata del Borgo which was a great starter (fresh radicchio, Pine nuts and Gorgonzola cheese) - simple and just the right amount of dressing and herbs. Followed by the Fettuccine Bolognese which was one of the best I've had in San Francisco - more meat than tomato sauce and not oily at all. The pasta was cooked perfectly al dente, piping hot. If you want simple, honest, authentic Italian food in a romantic, cozy setting with warm, gracious service then I highly recommend this neighborhood place!", "rating": 4, "date": "2017-12-27"}, {"excerpts": ["Favorites:\n\ninsalata del borgo\nbruschetta \nlobster ravioli\nbolognaise\n\nand absolutely save room for the tiramisu.  "], "author": "B K.", "review": "Hideaway gem amongst gentrified, hipsterized sf dining.  \n\nExcellent, simple Italian dishes.  Warm, friendly staff.  The owner is always polite, welcoming and attentive.\n\nAlways always good food.\n\nFavorites:\n\ninsalata del borgo\nbruschetta \nlobster ravioli\nbolognaise\n\nand absolutely save room for the tiramisu.  Best I have every had.", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["I recommend the Insalata del Borgo, and the Funghi e Salsice pizza. ", "I was not as impressed with the Pasta Carbonara as the party I was with. ", "I felt that their pancetta was beautifully sliced, but seemed to overpower the sauce. "], "author": "Alyvia M.", "review": "The hostess was absolutely delightful, and began our wonderful evening at Il Borgo. She not only provided a beautiful ambiance, but was able to capture the essence of a family dining experience, which I believe every Italian establishment should have. They even had clothing strung up on a line above the kitchen to make it feel like home (not my home, but I'm sure that was what they were going for).\n\nWe walked in and were immediately transported to Italy. Pavarotti serenaded us with Nessun Dorma as we sipped our Nero D'avola (that's wine in case you were wondering). I digress.\n\nUnfortunately, the food was average (eh' slightly above). I should have begun by saying that I really didn't  tag along to eat, I was more interested in the wine list (which was extremely limited). I am also not a huge fan of pasta. I recommend the Insalata del Borgo, and the Funghi e Salsice pizza. I was not as impressed with the Pasta Carbonara as the party I was with. I felt that their pancetta was beautifully sliced, but seemed to overpower the sauce. I would have used more garlic.\n\nI would definitely return for wine and appetizers. The ambiance made it comfortable for us to converse, and the service was superb.", "rating": 3, "date": "2009-05-31"}, {"excerpts": ["The Insalata del Borgo is a highlight: ", "A wonderful radicchio salad with gorgonzola and pine nuts. "], "author": "Paris E.", "review": "We go to Il Borgo at least once a month. We think this place does gnocchi better than most places and certainly is THE best for the price. The Penne Arrabiata is fabulous if you like simple and spicy.  The chicken entrees are just OK. I'd stick with pasta basics instead. The Insalata del Borgo is a highlight: A wonderful radicchio salad with gorgonzola and pine nuts. My mother loves their homemade bread. \n\nAt Il Borgo I always feel as if I'm eating in a family Italian restaurant in Italy. It's a Euro-sized small place with warm decor. The owners are from Milan. The male owner always seems overworked but hanging in there. The female waitress/owner (?) is never there on weekends anymore when we are. We miss her. My sweetie loves that she speaks Italian to him. \n\nThere is a gray-haired waiter who once gave my group complimentary shots of Grappa, \"the national drink of Italy\" he said. I'm sure it was meant as a nice gesture but none of us drink hard alcohol and some didn't drink alcohol at all, so we had a hard time with this stuff especially since the rest of us had to polish it off. We always laugh about that experience.\n\nHowever one time that same talkative waiter said some rather inappropriate things to my sweetie and I, and we felt a little uneasy for the rest of the dinner and for the next few times we were there. He must be a cousin or something that the owners feel they must keep on the payrol. Well, that's the story we made up about it.  We liked it better when the woman worked on Saturday nights. \n\nIf you're bringing American out-of-towners who think that Italian food means spaghetti with meatballs, they'll be disappointed because this is a meatball-free joint. And they might have to go through the 'ol routine of  \"could I have some butter for my bread\" (yes they'll bring it out for you). \n\nOn our first visit years ago we were given a complimentary cannoli for dessert. It is the only restaurant-cannoli I've ever liked. \n\nBeware -- cash only!", "rating": 4, "date": "2006-12-08"}, {"excerpts": ["We had the Insalata del Borgo, the gnocchi with bolognese sauce, the tortellini, and the tiramisu.\n\n", "The Insalata del Borgo was simple but delicious. ", "It had a  light, and slightly garlicky vinaigrette. "], "author": "Miyas J.", "review": "Good, honest food at a reasonable price. The atmosphere is warm and cozy - A good casual date place.  \n\nWe had the Insalata del Borgo, the gnocchi with bolognese sauce, the tortellini, and the tiramisu.\n\nThe Insalata del Borgo was simple but delicious. It had a  light, and slightly garlicky vinaigrette. The gorgonzola and pine nuts paired really well with the bitter radicchio. \n\nThe gnocchi was great comfort food. A nice steaming plate of fluffy little pillows, surrounded by a tasty meat sauce. What more can I say? It really hit the spot.\n\nThe tortellini filled with sausage was straightforward and light. The tomato sauce was simple and fresh.  The tortellinis were tender, and perfectly stuffed.  \n\nThe tiramisu was light, creamy, and not overly sweet. The flavors of the coffee and cocoa were nicely balanced. We licked the plate.\n\nThis is a great neighborhood restaurant that has love in the food.  Don't forget to bring CASH.", "rating": 4, "date": "2008-03-16"}], "casareccia insalate": [], "mista insalate": [], "caprese insalate": [], "al gorgonzola pizza": [], "napoletana pizza": [], "funghi e salsice pizza": [{"excerpts": ["I ordered the Funghi E Salsice Pizza $13. ", "Everyone enjoyed their meals.\n", "My pizza was very good with a cracker thin crust and plenty of mushrooms and tasty Italian sausage. ", "Our friends finished their meal by sharing an order of Tiramisu. ", "The serving size of all the meals, and dessert, were generous.\n \n", "A special mention about the soup ", "- it does not appear on the menu, so you need to ask. ", "My friend's vegetable soup looked delicious ", "and I was a bit sorry ", "I passed on the soup, but I knew I had a pizza in my near term future.\n \n", "The service was quite good, especially considering the crowd in this small restaurant. \n \n", "Good Italian food at a good price, is reason enough to return to Il Borgo."], "author": "Len S.", "review": "My wife & I had dinner with another couple on Saturday 9 April. This was our second visit to this small family run Italian restaurant. We had a 5:15PM reservation and the restaurant quickly filled in shortly after we arrived. This is obviously a popular local eatery.\n \nMy wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. I ordered the Funghi E Salsice Pizza $13. Everyone enjoyed their meals.\nMy pizza was very good with a cracker thin crust and plenty of mushrooms and tasty Italian sausage. Our friends finished their meal by sharing an order of Tiramisu. The serving size of all the meals, and dessert, were generous.\n \nA special mention about the soup - it does not appear on the menu, so you need to ask. My friend's vegetable soup looked delicious and I was a bit sorry I passed on the soup, but I knew I had a pizza in my near term future.\n \nThe service was quite good, especially considering the crowd in this small restaurant. \n \nGood Italian food at a good price, is reason enough to return to Il Borgo.", "rating": 4, "date": "2016-04-10"}, {"excerpts": ["Since we wanted to share a couple of dishes, we ordered the Funghi e Salsice pizza (mushroom and sausage) and the Spaghetti Carbonara.  \n\n"], "author": "Mike L.", "review": "For the longest time, I've wanted to try Il Borgo.  Usually, when I'm coming off the Bay Bridge to go home, my route off Octavia leaves me stuck at a red light at Fell and Laguna.  During those 30 seconds, as I wait for the light to turn green, I would sit and wonder if Il Borgo was any good.  Just as I tell myself that I'm going to finally check them out though, the light changes, I go on my way, and I forget that Il Borgo even exists.  That is, until I'm stuck at that light again.  So when my friend recently suggested we go to Il Borgo for dinner, my immediate thought was \"Where the hell is that?\".\n\nWhen we arrived, it was nice that we were seated immediately, but it kinda sucked that our table was right next to the door.  Since it was such a cold night, there was a bit of a chill whenever someone walked in or out.  Skimming the menu, I was impressed to see they offered a good mix of dishes and at prices that are pretty reasonable compared to other Italian joints in SF.  Since we wanted to share a couple of dishes, we ordered the Funghi e Salsice pizza (mushroom and sausage) and the Spaghetti Carbonara.  \n\nAlthough the portions were pretty good for the price, our food left me conflicted.  The pizza tasted pretty good, and I liked how they didn't skimp on the toppings, but man was it oily.  Sure, there was sausage on it, but wow.  Plus, since the crust was so thin, the slices were kinda limp and soggy with oil.  As for the pasta, I really liked the pancetta (how can you not?), but I thought the sauce fell short.  Maybe this is the was it's supposed to be made, but it reminded me more of an alfredo dish than the spaghetti carbonaras I've had in the past.  \n\nThe service was pretty good, especially since the waitress (the owner?) was the only one taking care of each table.  It's a slight bummer that the place is CASH ONLY, but I think I saw an ATM towards the back (there are probably fees though).  Despite the prices, I'm not sure I would come all the way back, but at least I don't have to sit at that light and wonder what Il Borgo is all about anymore.", "rating": 3, "date": "2011-12-28"}, {"excerpts": ["This time around, I ordered the Funghi E Salsice pizza, and it was delicious! ", "The sausage pieces were large and had a notable licorice taste. ", "The dough was thin, but still firm enough to support the pizza and crisp enough to make even the crust a treat when dipped in oil at the end of each slice. ", "I also sampled my friends prosciutto lasagna. ", "I expected the lasagna to be taken over by sharp tomato sauce flavor, since the it was drowned in the stuff, but somehow the sauce was well balanced and satisfying. ", "What was most impressive, though, was the texture. ", "The lasagna noodles were incredibly thin with lots of layers, avoiding the rubbery texture I usually associate with Lasagna.\n", "I'm not really a coffee drinker, but if I were, I'd imagine the tiramisu would have been right on the money. ", "It was so moist ", "I could have mistaken it for rum cake, but also very coffee flavored. ", "I only had a taste."], "author": "Nik K.", "review": "A great, go-to place for Italian food in San Francisco. I'd been to Il Borgo once before, and both then, and now I was with a large group of 8 or more. In both cases they were able to accommodate us (we did make reservations.) I found the service to be adequate on both occasions. I had to turn around and wave over the attendant to have my bent fork replaced, and again to see the wine menu for a second bottle. In both instances, the waiter wasn't terribly busy, so he was able to see that I needed something and immediately assist. \nThe food is absolutely top notch. The bread appetizer is nicely soft and fluffy on the inside with a crisp outer crust (though not impossible to pull apart) Last time I was there, I had some sort of pasta dish, which was good, but I remember being really impressed with the pizza my neighbor had. This time around, I ordered the Funghi E Salsice pizza, and it was delicious! The sausage pieces were large and had a notable licorice taste. The dough was thin, but still firm enough to support the pizza and crisp enough to make even the crust a treat when dipped in oil at the end of each slice. I also sampled my friends prosciutto lasagna. I expected the lasagna to be taken over by sharp tomato sauce flavor, since the it was drowned in the stuff, but somehow the sauce was well balanced and satisfying. What was most impressive, though, was the texture. The lasagna noodles were incredibly thin with lots of layers, avoiding the rubbery texture I usually associate with Lasagna.\nI'm not really a coffee drinker, but if I were, I'd imagine the tiramisu would have been right on the money. It was so moist I could have mistaken it for rum cake, but also very coffee flavored. I only had a taste.", "rating": 4, "date": "2015-05-31"}, {"excerpts": ["I recommend the Insalata del Borgo, and the Funghi e Salsice pizza. ", "I was not as impressed with the Pasta Carbonara as the party I was with. ", "I felt that their pancetta was beautifully sliced, but seemed to overpower the sauce. "], "author": "Alyvia M.", "review": "The hostess was absolutely delightful, and began our wonderful evening at Il Borgo. She not only provided a beautiful ambiance, but was able to capture the essence of a family dining experience, which I believe every Italian establishment should have. They even had clothing strung up on a line above the kitchen to make it feel like home (not my home, but I'm sure that was what they were going for).\n\nWe walked in and were immediately transported to Italy. Pavarotti serenaded us with Nessun Dorma as we sipped our Nero D'avola (that's wine in case you were wondering). I digress.\n\nUnfortunately, the food was average (eh' slightly above). I should have begun by saying that I really didn't  tag along to eat, I was more interested in the wine list (which was extremely limited). I am also not a huge fan of pasta. I recommend the Insalata del Borgo, and the Funghi e Salsice pizza. I was not as impressed with the Pasta Carbonara as the party I was with. I felt that their pancetta was beautifully sliced, but seemed to overpower the sauce. I would have used more garlic.\n\nI would definitely return for wine and appetizers. The ambiance made it comfortable for us to converse, and the service was superb.", "rating": 3, "date": "2009-05-31"}], "quattro stagioni pizza": [], "spaghetti pomodoro fresco": [], "penne al arrabbiata": [], "penne alla puttanesca": [{"excerpts": ["I ordered the Penne alla Puttanesca, which comes with Tomatoes, anchovies, olives, capers.  ", "We paired that with a Barbera.  ", "Both were very good.  ", "The pasta was somewhat salty, which is what I was going for.  ", "The wine went well with the pasta.  ", "The prices were reasonable (around $24 each - the pasta was roughly $12 and the wine was $23), the atmosphere was quaint.  ", "We will definitely be coming back."], "author": "Anne Marie F.", "review": "I ordered the Penne alla Puttanesca, which comes with Tomatoes, anchovies, olives, capers.  We paired that with a Barbera.  Both were very good.  The pasta was somewhat salty, which is what I was going for.  The wine went well with the pasta.  The prices were reasonable (around $24 each - the pasta was roughly $12 and the wine was $23), the atmosphere was quaint.  We will definitely be coming back.", "rating": 4, "date": "2011-07-11"}], "fettuccine primavera": [{"excerpts": ["My favorite right now is the fettuccine primavera. ", "My husband had the Fettuccine Bolognese and loved it. ", "Great atmosphere and ideal for large parties. ", "Service is always fast and efficient. ", "So happy to live so close!"], "author": "Elvia D.", "review": "My go-to for Italian food. They have lots of vegetarian options. My favorite right now is the fettuccine primavera. My husband had the Fettuccine Bolognese and loved it. Great atmosphere and ideal for large parties. Service is always fast and efficient. So happy to live so close!", "rating": 5, "date": "2018-06-17"}, {"excerpts": ["I had the fettuccine primavera and the cream sauce just made it even more yummy! ", "We also received our food like 5-10 mins after ordering and it was still that good, not undercooked not over cooked just right!! ", "The place is a little small ", "but you can't beat the great food!"], "author": "Kalee K.", "review": "Food here was absolutely delicious!! If you want real home style Italian cooking this is where you want to come! I had the fettuccine primavera and the cream sauce just made it even more yummy! We also received our food like 5-10 mins after ordering and it was still that good, not undercooked not over cooked just right!! The place is a little small but you can't beat the great food!", "rating": 4, "date": "2017-04-15"}, {"excerpts": ["I ordered the fettuccine primavera and the hubs had the fettuccine in bolognese sauce. ", "The sauce was lacking in flavor and I found myself wanting to douse the dish in salt, which I might add that i refrained from doing. ", "The complimentary bread was cold and meh. "], "author": "Esther A.", "review": "Great attentive service the minute you walk in! However thats where the raving ends for Il Borgo. Their food was just so-so for me and I so wanted to enjoy a good plate of pasta for dinner that night!\n\nI ordered the fettuccine primavera and the hubs had the fettuccine in bolognese sauce. The sauce was lacking in flavor and I found myself wanting to douse the dish in salt, which I might add that i refrained from doing. The complimentary bread was cold and meh. A little warming up would have gone a long way.\n\nCash only but there is an ATM inside.", "rating": 3, "date": "2011-03-16"}, {"excerpts": ["I really love the fettuccine primavera here. ", "The noodles were the really wide, chewy kind and the sauce was perfect. ", "I know I should try something else, but I just can't bring myself to do it. "], "author": "Grace C.", "review": "I really love the fettuccine primavera here. The noodles were the really wide, chewy kind and the sauce was perfect. I know I should try something else, but I just can't bring myself to do it. My boyfriend really likes the arrabiata sauce though. \n\nAs for the atmosphere, what can I say? Very Lady and the Tramp sharing one noodle kind of thing. Nook-y, lit predominately with those candles stuck on top of a wine bottle. \n\nI also like the proprietor. My friends and I came in one night 15 minutes before closing and he didn't give us any shit about staying so long, although the poor man did seem relieved to see us go. A good moderately priced date place. If you go once before and make a little effort to talk to the owner, when you bring your date, you can excuse the not-outrageously-expensiveness of the place by saying you discovered this \"little hidden gem\" years ago and just love it.", "rating": 4, "date": "2006-10-16"}], "spaghetti al salmon": [], "fettucine bolognese": [{"excerpts": ["And sadly the pasta was inedible, I ordered the fettucine bolognese, and it was like american chop seuy back in grade school, just missing a good doughy hamburger bun. ", "So overall, not good, don't go unless you want a bad meal in a disney land setting."], "author": "Brando W.", "review": "I joined yelp today, just so I can write this review! This was by far the worst meal I have ever had in San Francisco, and probably in the top 5 of top worst meals ever. Let's start with the decor, we thought we were at the Italian section of epcot center, with the faux outside/inside decor, it was totally tacky, and I am all for campy kitsch, but it wasn't clever enough to be so. Ok, now the most important part, the food, the caprese was ice cold with dry oregeno flakes all over it, no taste and then shocks of spices. And sadly the pasta was inedible, I ordered the fettucine bolognese, and it was like american chop seuy back in grade school, just missing a good doughy hamburger bun. So overall, not good, don't go unless you want a bad meal in a disney land setting.", "rating": 1, "date": "2010-02-11"}, {"excerpts": ["Cons: Wasn't into the Fettucine Bolognese, but the person who ordered it enjoyed it. ", "The Ensalata Borgo could use another green thrown into it instead of being solely comprised of radicchio. ", "Also could have used a more prominent acidic element in the vinaigrette. ", "It seemed to be dressed only with oil. ", "Cruets of oil and vinegar were on the table, so I just added it myself. ", "The wines by the glass weren't listed on the menu, I prefer to know the origin and price of what I'm ordering. \r\n", "The decor abounds with baubles and bric-a-brac as well as those far too often utilized kitschy countryside murals. \r\n", "Bitching aside, I actually enjoyed my pasta quite a bit and it seriously was enough for 3 meals for me. ", "Price to value ratio is high, cash only."], "author": "Candice L.", "review": "A neighborhood corner restaurant with surprisingly decent Italian fare. Pros: The Fettuccine del Borgo with chicken, sun dried tomatoes, basil, and capers. With a few dashes of crushed red pepper, this was a satisfying meal with unexpectedly tender white chicken and a tasty sauce. No wait, usually a bonus. \r\nCons: Wasn't into the Fettucine Bolognese, but the person who ordered it enjoyed it. The Ensalata Borgo could use another green thrown into it instead of being solely comprised of radicchio. Also could have used a more prominent acidic element in the vinaigrette. It seemed to be dressed only with oil. Cruets of oil and vinegar were on the table, so I just added it myself. The wines by the glass weren't listed on the menu, I prefer to know the origin and price of what I'm ordering. \r\nThe decor abounds with baubles and bric-a-brac as well as those far too often utilized kitschy countryside murals. \r\nBitching aside, I actually enjoyed my pasta quite a bit and it seriously was enough for 3 meals for me. Price to value ratio is high, cash only.", "rating": 3, "date": "2006-01-06"}], "pollo e vegetali alla griglia": [{"excerpts": ["I opened the old school looking menu and decided on the classic caprese (how can anyone go wrong here), Pollo E Vegetali Alla Griglia, and Penne with Salciccia. \n\n", "Pollo E Vegetali Alla Griglia ", "- I was pretty disappointed with this. ", "Grilled chicken drizzled with sweet balsamic vinegar, steamed broccoli, roasted potatoes, and sautéed endive to top. ", "I like my chicken moist, but this chicken breast was flattened and dry; basically flavorless. ", "The potatoes were cooked really well, slightly crispy on the outside, but they were a bit over salted. ", "The expectedly bitter endive enhanced the bitterness of the grill marks on the chicken, rather than complimenting the supposedly sweet/tangy balsamic. ", "In fact, I couldn't detect any balsamic flavor at all. ", "Broccoli was the best thing on the dish; steamed, unseasoned, and not much room for a mess up. "], "author": "Ann S.", "review": "Friday night dinners in San Francisco are hardly ever convenient. Honking cars, limited parking, packed restaurants, long wait times, and slower service due to higher demand. \n\nThis Friday I wanted to be brilliant. Coming after work, the last thing I wanna deal with is a rowdy group of bros screaming and hollering after coming from the bar. No, this night, I purposely found a restaurant off the beaten path, all the while still being in the midst of the lively neighborhood of Hayes Valley. \n\nI moseyed into ll Borgo and even on a Friday night without reservations, I was seated immediately. Lighting was dim with real burning candlelight on each table; brick walls, wooden tables, a rustic type of feel. \n\nI opened the old school looking menu and decided on the classic caprese (how can anyone go wrong here), Pollo E Vegetali Alla Griglia, and Penne with Salciccia. \n\nCaprese salad - This dish came out surprisingly quick, which I love, but the ratio of mozzarella to tomato was a bit off. I tend to prefer 50/50 with both tomato and cheese slices close to identical in size. Though I appreciate this dish flying out to the table so fast, I think the preparation could've been a little more thoughtful. \n\nPollo E Vegetali Alla Griglia - I was pretty disappointed with this. Grilled chicken drizzled with sweet balsamic vinegar, steamed broccoli, roasted potatoes, and sautéed endive to top. I like my chicken moist, but this chicken breast was flattened and dry; basically flavorless. The potatoes were cooked really well, slightly crispy on the outside, but they were a bit over salted. The expectedly bitter endive enhanced the bitterness of the grill marks on the chicken, rather than complimenting the supposedly sweet/tangy balsamic. In fact, I couldn't detect any balsamic flavor at all. Broccoli was the best thing on the dish; steamed, unseasoned, and not much room for a mess up. This dish was $17.50. \n\nPenne with Salciccia - The penne was cooked to a perfect al dente and the tomato sauce coated beautifully, but the Salciccia was a bit too salty for my tastebuds. I'm usually very picky with tomato sauces too because it can come off either sour or acidic. This sauce, unfortunately, was not the exception. Grated cheese wasn't even offered to create more of a balance. $14 for this dish. \n\nService was really good though. Warm bread was offered to the table. \n\nFor a Friday night, I think Il Borgo was good enough. I accomplished avoiding the late night crowd. \n\n3.5 Stars", "rating": 3, "date": "2018-01-27"}, {"excerpts": ["We had the lasagnetta, the pollo e vegetali alla griglia and the antipasto misto. ", "Incredibly amazing and delicious. ", "The fresh bread was warm and crusty on the outside and soft as a pillow on the inside. ", "Food was cooked perfectly and so incredibly flavorful. ", "We will be back!!"], "author": "Angela B.", "review": "Okay... unsure how this place has anything less than five stars. We had the lasagnetta, the pollo e vegetali alla griglia and the antipasto misto. Incredibly amazing and delicious. The fresh bread was warm and crusty on the outside and soft as a pillow on the inside. Food was cooked perfectly and so incredibly flavorful. We will be back!!", "rating": 5, "date": "2018-06-02"}], "pollo pizzaiola": [{"excerpts": ["My friend had the Pollo Pizzaiola, breast of chicken with tomato, olives and caper sauce, and declared it very good. ", "Hers came with Broccoli and  delicious roasted (or sauteed) potatoes. ", "Pizzas and pasta at nearby tables  also looked delicious. ", "The portions were huge, and we both left with doggie bags. ", "Instead of three of the spiral lasagnetti, I would've like two and some broccoli.  ", "The Chianti was serviceable, and the prices were very reasonable.  ", "We will definitely go back."], "author": "Crystal C.", "review": "Based on Yelp Reviews and seeing the crowd queuing a few weeks back, we decided to try Il Borgo. We loved the sort of kitsch-ey Italian decor, and also the big Mickey Mouse who watches you in the bathroom. The waitress was attentive and steered us correctly on whether to share the salad or not.  I had read recommendations on yelp for the Lasagnetta, lasagna noodles rolled in spirals containing  prosciutto and mozzarella and topped with a yummy, slightly creamy red sauce. My friend had the Pollo Pizzaiola, breast of chicken with tomato, olives and caper sauce, and declared it very good. Hers came with Broccoli and  delicious roasted (or sauteed) potatoes. Pizzas and pasta at nearby tables  also looked delicious. The portions were huge, and we both left with doggie bags. Instead of three of the spiral lasagnetti, I would've like two and some broccoli.  The Chianti was serviceable, and the prices were very reasonable.  We will definitely go back.", "rating": 4, "date": "2015-06-28"}, {"excerpts": ["My pollo pizzaiola was right on as well - tender chicken breast with tomato, olives and caper sauce, with string beans and potatoes to accompany; I liked the sauce a lot but others in my party found it a bit heavy on the capers. ", "Their loss. ", "Margherita pizza (mozzarella, tomatoes, fresh basil) was just right as well, though my daughter prefers it heavier on the cheese. ", "My wife was blown away by the gorgonzola pizza (tomatoes, mozzarella, gorgonzola cheese), and everyone else who tried it liked it. ", "Our oldest was disappointed the fettuccine bolognese came out as a brown sauce when we were expecting red. ", "We finished by sharing cheesecake and homemade tiramisu; delicious. "], "author": "David L.", "review": "My family & I really enjoyed this place. Staying at the Hotel Kabuki in Japan Town, we were looking for something with good reviews within walking distance, and this fit the bill (it's .7 of a mile away). I called ahead to make a reservation; I'm not sure it was necessary, but it was pretty steadily busy until about 9:30. We crammed into a slightly uncomfortable booth, though there are no complaints from me, just one of my overtired kids who didn't like the hard bench. \n\nFood overall was great, and prices were right. Our bread came out a bit on the cold side but we were too hungry to care. As an opener we had bruschetta, which was done perfectly in my book - big chunks of tomato, olive oil, basil, and perfectly toasted bread. My pollo pizzaiola was right on as well - tender chicken breast with tomato, olives and caper sauce, with string beans and potatoes to accompany; I liked the sauce a lot but others in my party found it a bit heavy on the capers. Their loss. Margherita pizza (mozzarella, tomatoes, fresh basil) was just right as well, though my daughter prefers it heavier on the cheese. My wife was blown away by the gorgonzola pizza (tomatoes, mozzarella, gorgonzola cheese), and everyone else who tried it liked it. Our oldest was disappointed the fettuccine bolognese came out as a brown sauce when we were expecting red. We finished by sharing cheesecake and homemade tiramisu; delicious. Cappuccinos too. \n\nService was a bit slow; the two people running the place (one of whom I took to be the owner) tried valiantly to keep up with tables and were courteous, but they really need someone else to ease the load. We waited quite a while after we'd eaten so we could order dessert. But it's not something that would keep us away.", "rating": 4, "date": "2013-07-26"}], "saltimbocca": [{"excerpts": ["My wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. "], "author": "Len S.", "review": "My wife & I had dinner with another couple on Saturday 9 April. This was our second visit to this small family run Italian restaurant. We had a 5:15PM reservation and the restaurant quickly filled in shortly after we arrived. This is obviously a popular local eatery.\n \nMy wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. I ordered the Funghi E Salsice Pizza $13. Everyone enjoyed their meals.\nMy pizza was very good with a cracker thin crust and plenty of mushrooms and tasty Italian sausage. Our friends finished their meal by sharing an order of Tiramisu. The serving size of all the meals, and dessert, were generous.\n \nA special mention about the soup - it does not appear on the menu, so you need to ask. My friend's vegetable soup looked delicious and I was a bit sorry I passed on the soup, but I knew I had a pizza in my near term future.\n \nThe service was quite good, especially considering the crowd in this small restaurant. \n \nGood Italian food at a good price, is reason enough to return to Il Borgo.", "rating": 4, "date": "2016-04-10"}, {"excerpts": ["They have all of the classics like Scaloppini, Fettuccini Alfredo, Carbonara, Saltimbocca, Lasagna etc. \n\n"], "author": "Rew C.", "review": "I wanted to like it - I really did. I love those old style Dago restaurants that I grew up on. They have all of the classics like Scaloppini, Fettuccini Alfredo, Carbonara, Saltimbocca, Lasagna etc. \n\nI ordered the Chicken Piccata which should be pounded chicken with some cheese and a lemon butter sauce with capers. It was a big flattened piece of Chicken with cheese that had basil inside of it - kind of overwhelming unless you love basil that much. But more importantly it had this light brownish gelled or is it jello'd sauce on it - kind of like cold gravy but it wasn't cold. It was thick and tasted like they didn't wait for the sauce to get thicker but thickened it up with flour or cornstarch - but used too much. \n\nMy friend had the Lasagneta which is Lasagna - they roll a big piece then get slices and lay them on the plate - it's a good idea but the sauce is more like a cream sauce with a little bit of tomato sauce added in not the other way around. I personally thought both of them sucked. Can't be anymore descriptive than that - sure it was inexpensive if the dishes were decent but they weren't. The prices are mostly $14 thru $26. \n\nGood wine prices - I needed the wine to get through the meal. We also split a Carpaccio which was good and the bread was good too. And don't ask the lady for wine advice - not a clue.", "rating": 3, "date": "2014-08-20"}, {"excerpts": ["I had the veal saltimbocca which was delicious and served with broccoli and roasted potatoes. ", "The prices are reasonable and I would recommend ordering off of the chef's menu. ", "Good food, good value, decent location."], "author": "Bruce L.", "review": "Had a very nice dinner here with friends. Some were late and the owner was very accommodating. The ambience is rustic, but homey. The food was authentic with well seasoned veggies. I had the veal saltimbocca which was delicious and served with broccoli and roasted potatoes. The prices are reasonable and I would recommend ordering off of the chef's menu. Good food, good value, decent location.", "rating": 4, "date": "2016-08-21"}, {"excerpts": ["The veal saltimbocca was fantastic and we got a side a spaghetti to share between us which was also unbelievable.  ", "My colleges got chicken saltimbocca and a fettuccini which they both raved about.  ", "We washed everything down with a cheap $8 glasses of Chianti and had a great evening.  ", "Thank you for a great experience and a place we will return to."], "author": "Darold S.", "review": "First time and I really enjoyed it.  Very authentic Italian food and a great ambiance.  They say it's romantic which it is but I went with two other business colleges and it was fine, family seating at a long table.  The waitress might own it I forgot to ask but she speaks Italian to you to make you feel like your there.  I ordered a regular salad, which had quite a lot of garlic on it.  I like garlic but not quite that much.  The veal saltimbocca was fantastic and we got a side a spaghetti to share between us which was also unbelievable.  My colleges got chicken saltimbocca and a fettuccini which they both raved about.  We washed everything down with a cheap $8 glasses of Chianti and had a great evening.  Thank you for a great experience and a place we will return to.", "rating": 4, "date": "2016-01-19"}, {"excerpts": ["We ordered the Saltimbocca which was extremely salty & greasy. ", "It came with potatoes that were hard had been sitting for hours in grease. ", "The Bruchetta was also too salty. ", "Finally, what kind of restaurant does not accept credit cards especially when the bill is over a $100!! "], "author": "marcus c.", "review": "Fellow Yelpers...Pleeez are you kidding me??? First off the smell of the place, kinda like when you're walking down 16th & Mission and especially since there is no circulation/ventilation. Service was slow since there was only one person which was probably the owner. One of our friends had ordered a salad as her entree. It came first and about 30 min later our entrees came. Needless to say we felt bad that she had finished her salad and pass some food onto her plate.\n\nWe ordered the Saltimbocca which was extremely salty & greasy. It came with potatoes that were hard had been sitting for hours in grease. The Bruchetta was also too salty. Finally, what kind of restaurant does not accept credit cards especially when the bill is over a $100!! The meal was not of value.\n\nBetter off eating authentic Italian food in the North Beach", "rating": 2, "date": "2012-08-14"}, {"excerpts": ["Got my usual: chicken saltimbocca. ", "Still one of the best things I've put in my mouth. ", "So good. ", "Dave & I took another friend, she also had the saltimbocca- ", "she was thrilled with it. ", "Dave had his bolognese- ", "he loves it. ", "Mitra gave her usual outstanding service. ", "A glass of chianti before dinner and a shared gelato after- what could be better? ", "Il Borgo has NEVER disappointed me."], "author": "Trisha F.", "review": "Had dinner here last Tuesday. Got my usual: chicken saltimbocca. Still one of the best things I've put in my mouth. So good. Dave & I took another friend, she also had the saltimbocca- she was thrilled with it. Dave had his bolognese- he loves it. Mitra gave her usual outstanding service. A glass of chianti before dinner and a shared gelato after- what could be better? Il Borgo has NEVER disappointed me.", "rating": 5, "date": "2014-01-10"}, {"excerpts": ["My saltimbocca was ok, excellent side veggies. ", "But the whole thing was just eh. ", "Chianti was like drinking fire water.  ", "One waitress, so we hardly could ever get water etc, and the WORST, it was CASH ONLY. ", "ARE YOU KIDDING ME. "], "author": "Nicole F.", "review": "Pass. After seeing this place a million times we finally went and what a waste of $70.00. Carpaccio was good, caprese was a caprese, but the pasta bolagnese was super bland and did taste just like ground beef. My saltimbocca was ok, excellent side veggies. But the whole thing was just eh. Chianti was like drinking fire water.  One waitress, so we hardly could ever get water etc, and the WORST, it was CASH ONLY. ARE YOU KIDDING ME. That in itself was the kiss of death. \n\nOnce was plenty for me, won't be back.", "rating": 2, "date": "2010-11-05"}, {"excerpts": ["Another notable dish was Vitello Saltimbocca ($18.75, Veal scaloppini in Marsala wine, sage, topped withprosciutto and mozzarella).  "], "author": "Kioko O.", "review": "Dined here prior to seeing SF Ballet \"Romeo & Juliet\".  This is a cozy, casual restaurant which seems to fill up quickly on Friday night, so a reservation is probably recommended.  \n\nLasagnetta was excellent and I'd definitely recommend it  ($12.75, Rolled lasagna filled with prosciutto and mozzarella).  Another notable dish was Vitello Saltimbocca ($18.75, Veal scaloppini in Marsala wine, sage, topped withprosciutto and mozzarella).  Also I liked Mista ($6, Romaine lettuce, radicchio, arugula with Italian house dressing & fresh herbs), which I thought was really fresh and yummy.\n\nDidn't get to the dessert section as we were quite full, but heard that Tiramisu is also home-made.  I'm definitely going to try it the next time.", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["My husband ordered the chicken saltimbocca and enjoyed his sides (zucchini and potatoes) better than the main dish.  \n\n"], "author": "Rebecca S.", "review": "I loved the ambience of this restaurant on a rainy Friday evening: candle-lit, small, cozy, friendly.  The food however, left much to be desired.  I ordered the fettucini bolognese and although I was in the mood for comfort food, the first comparison to come to mind was hamburger helper.  My husband ordered the chicken saltimbocca and enjoyed his sides (zucchini and potatoes) better than the main dish.  \n\nNot sure we will go again.", "rating": 3, "date": "2010-02-21"}, {"excerpts": ["The veal saltimbocca will melt your soul.\n\n"], "author": "Carlos C.", "review": "The most un-assuming (bordering on camoflauged) italian cafe which I walked by for almost an entire year before finally venturing a try on a monday night when everything else seemed to be closed. \n\nMy expectations were low . . . \nbut wow, did they ever get exceeded.\n\nThe food is outstanding and nothing on the menu is over $20. \n\nThis place appears to be the real deal . . . it is family run (I'm pretty sure they are all from southern italy) and they make their own pasta.\n\nThe veal saltimbocca will melt your soul.\n\nOnce upon a time you never had to worry about getting a table which is still the case on week-nights but friday or saturday nights are now pretty brutal.\n\nThis is a great place to bring a date (on a weeknight).", "rating": 5, "date": "2007-03-10"}, {"excerpts": ["My recommendations:\nRaddicchio salad (a la Borgo)\nSaltimbocca"], "author": "Chris M.", "review": "Consistently tasty and authentic.\nWho knew Hayes Valley could do Italian?\n\nMy recommendations:\nRaddicchio salad (a la Borgo)\nSaltimbocca", "rating": 4, "date": "2006-05-23"}, {"excerpts": ["The antipasto was good, the Chicken Saltimbocca ", "(though I am not a big chicken person) was actually quite impressive in and had very good flavor throughout every bite. ", "The veggies served with the entreés were fairly vanilla, but were fresh and well prepared. ", "Another dish I had a few bites from were my buddy's lamb chops. ", "Wow, were they great! ", "The tiramisu was very soft, fluffy and just right after dinner."], "author": "Michael M.", "review": "Is Il Borgo a world-class, five-star jaw dropper? No, but this little Italian joint is well worth the trip for several reasons.\n\n1) The price is just right for a very tasty selection\n2) Service is on point.\n3) Cheap corkage fees\n4) Nice, quaint, quiet ambience\n\nSo the service was a tiny bit behind, but managed well. The owner was very involved and so was the service. To the point that when our water was left empty for a short time, a complimentary glass of wine was poured without question...to five of us.\n\nThe antipasto was good, the Chicken Saltimbocca (though I am not a big chicken person) was actually quite impressive in and had very good flavor throughout every bite. The veggies served with the entreés were fairly vanilla, but were fresh and well prepared. Another dish I had a few bites from were my buddy's lamb chops. Wow, were they great! The tiramisu was very soft, fluffy and just right after dinner.", "rating": 4, "date": "2009-03-15"}, {"excerpts": ["My old roommate Chris M. took me here one evening for dinner and recommended the Raddicchio salad and the Saltimbocca. ", "\"My recommendations:\nRaddicchio salad (a la Borgo)\nSaltimbocca\"\n\nNot feeling very adventurous Chris?"], "author": "Joe D.", "review": "My old roommate Chris M. took me here one evening for dinner and recommended the Raddicchio salad and the Saltimbocca. Both were very enjoyable.\n\nI just noticed his prior review and I quote:\n\n\"My recommendations:\nRaddicchio salad (a la Borgo)\nSaltimbocca\"\n\nNot feeling very adventurous Chris?", "rating": 4, "date": "2007-09-24"}, {"excerpts": ["and I can't stop thinking about the saltimbocca (sp?) ", "super good, with steamed broccoli and accurately salted rosemary potatoes.  \n", "My friend had a wonderful house made pasta with a cream sauce and English peas, yum-o! ;0) \n", "It is a place you can take your parents and it will remind them of the old neighborhood Italian restaurants THEY used to take you too,  except this one is waaaaaay better.  ", "I waited far too long to try this place as I've lived around the corner for 6 years!\n", "*P.S. ", "Each table comes complete with the dripping Chianti candles. ", "Nice..."], "author": "Suzanne L.", "review": "Although I have only been here once, I plan to return again and again.  It is a place I went to a couple of weeks ago and I can't stop thinking about the saltimbocca (sp?) super good, with steamed broccoli and accurately salted rosemary potatoes.  \nMy friend had a wonderful house made pasta with a cream sauce and English peas, yum-o! ;0) \nIt is a place you can take your parents and it will remind them of the old neighborhood Italian restaurants THEY used to take you too,  except this one is waaaaaay better.  I waited far too long to try this place as I've lived around the corner for 6 years!\n*P.S. Each table comes complete with the dripping Chianti candles. Nice...", "rating": 4, "date": "2007-06-04"}, {"excerpts": ["Just a good saltimbocca and a delicious antipasti dish.\n\n"], "author": "Todd X.", "review": "I've had the pleasure of two dinners at Il Borgo in the past 4 months or so.  This little unpretentious restaurant is in my neighborhood, but both times I've gone was with friends from other parts of the city who suggested we go there.  \n\nLet me just say thanks to those friends.  Will you have the most avant garde meal at Il Borgo?  No.  Will you have a relaxed, enjoyable meal with good food and an amusingly surly waitstaff?  Yes, most definitely. \n\nThe first time I went with my friends, our waiter kept bringing us alcohol to try.  I suspect he was flirting with my female companions, but he had us try grappa and some of the house port wine.  Then, at the end of our meal, he brought us tiramisu on the house.  Of course, we more than made up for it with the tip, but it was such a surprise from this semi-gruff man who we were convinced hated us.  Not so.  \n\nHe just wasn't putting on airs.  And that's Il Borgo for you.  No pretention.  Just a good saltimbocca and a delicious antipasti dish.\n\nThe next time you're craving some classic Italian fare and can't stand the trek to North Beach, head over to Hayes Valley and step into Il Borgo.", "rating": 4, "date": "2007-02-10"}, {"excerpts": ["Saltimbocca -  cut of veal hammered thin, with proscuitto on top. ", "served with veggies. ", "the color of the veal wasn't appetizing, slightly grey beige ", "but it tasted all right. ", "a favorite at the table.\n", "-Penne Puttanesca - tangy flavors from the olives and capers. ", "i thought this was more memorable.\n", "-Gnocchi in gorganzola sauce - very light, not heavy like most dead weight potato pastas. ", "another crowd favorite.\n", "-Fettuccine w/ sundried tomatoes and chicken - this was my favorite. "], "author": "Cindy W.", "review": "3.5 stars - Il Borgo is a solid, not great, but good italian restaurant with simple comfy fare. Portions are NOT huge. They're decent, probably a heathy size but we're pigs and we like to eat:\n\n-Bruschetta - 4 pieces of chunky fresh tomatoe on fresh white bread. good, but it's bruschetta. can't really ruin it.\n-Lobster Ravioli - served in a creamy pink sauce, I couldn't actually taste the lobster.\n-Veal Saltimbocca -  cut of veal hammered thin, with proscuitto on top. served with veggies. the color of the veal wasn't appetizing, slightly grey beige but it tasted all right. a favorite at the table.\n-Penne Puttanesca - tangy flavors from the olives and capers. i thought this was more memorable.\n-Gnocchi in gorganzola sauce - very light, not heavy like most dead weight potato pastas. another crowd favorite.\n-Fettuccine w/ sundried tomatoes and chicken - this was my favorite. al dente fettuccine, w/ tang from the sundried tomatoes and a bit of meatiness from the chicken.\n\nCan't forget dessert:\n***Tiramisu - the best! not overly sweet, light, fresh, and you get a big hunk of it\n-Vanilla gelato - 3 boules of this yummy vanilla beany italian delight\n-Spumoni - tri-colored and flavors (chocolate, cherry, and pistachio). i don't usually like this italian neapolitan but this wasn't artifical tasting at all)\n-Cheesecake w/ strawberries - a light cheesecake.\n\nWe also had a simple bottle of Pinot Nero (aka pinot noir) which was very easy on the palate.\n\nPluses: attentive service, no wait, quaint decor, unassuming, relaxing, quick to serve food too\nWhy it falls 1/2 star short of 4: smallish portions, somewhat uninventive dishes, cash only (pp tab w/ tip = $32)\n\nWould I go back? Sure, for basic Italian food in an unpretentious setting.", "rating": 3, "date": "2008-01-05"}, {"excerpts": ["Star for the chicken saltimbocca that was so delicious. \n\n"], "author": "Meghan L.", "review": "I have to agree with Omid T: Italian cuisine isn't too tricky to pull off.\n\nI tend to not enjoy eating out for Italian, since a lot of times, I feel like I could just as easily make the majority of what is on the menu at home. \n\n+1 Star for the cool music and neat settting. I read in someone's review that the music was overkill in one sense or another (I think they may have used the word \"kitcshy\" and \"Sinatra\" in the same sentence to describe it). During my visit, there was some weird electronica/experimental/acid-jazzy thing going on that seemed a little out of place, but was a welcome relief from the Olive Garden Rat Pack soundtrack that tends to overpower the ambiance in most Italian restaurants.\n\n+1 Star for the generous glass of chianti that I thoroughly enjoyed.\n\n+1 Star for the chicken saltimbocca that was so delicious. \n\n+1 Star for being the best part of my day.\n\n-1 Star for the service that seemed a little short and annoyed everytime he pulled up to fill water glasses. It was actually a little awkward: the guys who was waiting on us didn't say much. He'd just walk up to the table and stand there and stare. Maybe he just assumed that we knew the procedure at a restaurant, so he didn't need to waste his breath talking. But every now and then he'd bring his water pitcher with him, so I guess he was cool.", "rating": 4, "date": "2007-07-25"}, {"excerpts": ["My date had the Saltimbocca - it was excellent, a great Marsala-like sauce, the chicken was just right ", "and there was lots of prosciutto.  ", "The Vegetable medley was not the same old tired and soggy zucchini and carrots.... ", "it was freshly cooked and there were green beans, broccoli and fresh tomatoes. \n", "Our waitress was very friendly and attentive (it was 5:00 and we were the first in the place for the evening).  ", "this place is just as good and better than anyplace in North Beach and I will return!\n", "And the atmosphere is just perfect for the little neighborhood joint that it is!"], "author": "kris c.", "review": "I always wanted to stop here but I was always whizzing down Fell on my way home....\n\nfinally last night we stopped in  and had a great dinner.  The bread is excellent, reminds me of Italian Star bread I used to get in an Italian neighborhood back on the East Coast.  We had two helpings and ate it all!  I had the Penne alla Putenesca - the penne was cooked perfectly al dente and the sauce was tangy and delicious.  Lots of olives and capers.  My date had the Saltimbocca - it was excellent, a great Marsala-like sauce, the chicken was just right and there was lots of prosciutto.  The Vegetable medley was not the same old tired and soggy zucchini and carrots.... it was freshly cooked and there were green beans, broccoli and fresh tomatoes. \nOur waitress was very friendly and attentive (it was 5:00 and we were the first in the place for the evening).  this place is just as good and better than anyplace in North Beach and I will return!\nAnd the atmosphere is just perfect for the little neighborhood joint that it is!", "rating": 4, "date": "2010-02-11"}], "lasagnetta del borgo": [], "fettuccine del borgo": [{"excerpts": ["We had Carpaccio and Bruschetta for appetizer and Lasangeta Al Vegetali, Lobster Ravioli and Fettuccine Del Borgo for main dish. ", "All tested very good. ", "The portion was good as well. ", "Most of all, what a great environment!!"], "author": "Mike N.", "review": "One of the best authentic Italian restaurant in San Francisco, complemented by best in class service!! We had Carpaccio and Bruschetta for appetizer and Lasangeta Al Vegetali, Lobster Ravioli and Fettuccine Del Borgo for main dish. All tested very good. The portion was good as well. Most of all, what a great environment!!", "rating": 5, "date": "2015-12-31"}, {"excerpts": ["The second time around I ordered the Fettuccine Del Borgo which consisted of homemade pasta with prosciutto, peas and capers.  ", "I asked our waitress if it was possible to add mushrooms to the dish.  ", "Her reply: \"We can add anything for you here\".  ", "Now, that's what I'm talkin' about!  ", "Accommodation!!!  ", "The dish was great; a creamy sauce with flat thick sliced fettuccine.  ", "However... the dish contained too many peas.  ", "It seemed as if they put a whole can of peas in the dish.  ", "The pea to fettuccine ratio was pretty high.  "], "author": "Melissa M.", "review": "I've gone here twice and coincidentally with a group of four each time.  This place is quaintly nestled in the heart of Hayes Valley and its romantic setting is great for a first date.  The decor is cozy and has a rustic feel to it.  The walls are painted with murals reminiscent of Italia.  The hostess/waitress was very sweet and greeted us with Italian phrases.  The place seemed as if it was operated by the whole family.  Although, I don't know for sure... it seemed that way.  \n\nThe second time around I ordered the Fettuccine Del Borgo which consisted of homemade pasta with prosciutto, peas and capers.  I asked our waitress if it was possible to add mushrooms to the dish.  Her reply: \"We can add anything for you here\".  Now, that's what I'm talkin' about!  Accommodation!!!  The dish was great; a creamy sauce with flat thick sliced fettuccine.  However... the dish contained too many peas.  It seemed as if they put a whole can of peas in the dish.  The pea to fettuccine ratio was pretty high.  Despite the delta... I'd go there again.  \n\nModerately priced, great customer service, warm/romantic atmosphere and yummy food!", "rating": 4, "date": "2007-05-29"}, {"excerpts": ["I can't seem to get away from their Fettuccine del Borgo, although I have tasted dinner companion's lasagnetta, gnocchi pesto, and lobster ravioli and all were very good. ", "The salads are a bit boring (just lettuce and dressing) but not a bad start to the meal if that's what you're going for.  ", "(I prefer the antipasto. . ", "although I'm pretty sure I could live off of prosciutto and olives for quite some time.) ", "The tiramisu is HANDS DOWN the best I've ever had.  ", "Creamy, melt in your mouth, and (usually) free! "], "author": "Lauren K.", "review": "It may be the awesome yet affordable wine list, the cozy ambiance, the kick- ass home made pasta, or very possibly the complimentary champagne and tiramisu the owner often bestows upon us, but this is one of my favorite places to eat in the city.  I can't seem to get away from their Fettuccine del Borgo, although I have tasted dinner companion's lasagnetta, gnocchi pesto, and lobster ravioli and all were very good. The salads are a bit boring (just lettuce and dressing) but not a bad start to the meal if that's what you're going for.  (I prefer the antipasto. . although I'm pretty sure I could live off of prosciutto and olives for quite some time.) The tiramisu is HANDS DOWN the best I've ever had.  Creamy, melt in your mouth, and (usually) free! What more could a girl ask for? \n\nYes, it's cash only and that sucks. SUCKS! But they do have an ATM inside just in case you forget. Make a reservation, swing by Wamu, and gorge yourself on some of the best Italian food in the city.", "rating": 5, "date": "2009-01-31"}, {"excerpts": ["The Fettuccine del Borgo with chicken, sun dried tomatoes, basil, and capers. ", "With a few dashes of crushed red pepper, this was a satisfying meal with unexpectedly tender white chicken and a tasty sauce. ", "No wait, usually a bonus. \r\n"], "author": "Candice L.", "review": "A neighborhood corner restaurant with surprisingly decent Italian fare. Pros: The Fettuccine del Borgo with chicken, sun dried tomatoes, basil, and capers. With a few dashes of crushed red pepper, this was a satisfying meal with unexpectedly tender white chicken and a tasty sauce. No wait, usually a bonus. \r\nCons: Wasn't into the Fettucine Bolognese, but the person who ordered it enjoyed it. The Ensalata Borgo could use another green thrown into it instead of being solely comprised of radicchio. Also could have used a more prominent acidic element in the vinaigrette. It seemed to be dressed only with oil. Cruets of oil and vinegar were on the table, so I just added it myself. The wines by the glass weren't listed on the menu, I prefer to know the origin and price of what I'm ordering. \r\nThe decor abounds with baubles and bric-a-brac as well as those far too often utilized kitschy countryside murals. \r\nBitching aside, I actually enjoyed my pasta quite a bit and it seriously was enough for 3 meals for me. Price to value ratio is high, cash only.", "rating": 3, "date": "2006-01-06"}], "lasagnetta al vegetali": [], "gnocchi a piacere": [], "fusilli": [{"excerpts": ["My favorites are the artichoke ravioli, the lasagnetta (for which they are most well known), fusilli with eggplant, the pizzas, and the antipasto mixed tray. \n\n"], "author": "Heidi M.", "review": "I ate here for the first time this summer, and since then, this has become my favorite Italian restaurant in SF... maybe my favorite restaurant, full stop.  It's a tiny place, and even with reservations, there can be a wait.  Service is very, very slow and rather inattentive -- however, there seems to be only 3 people working in the restaurant, so that is understandable and is not problematic as long as you plan for it. (ie, do not show up here hoping to rush through dinner).  The decor is cute, the lighting is slightly dim, and it seems like it would be a wonderful place for a date.\n\nThe food is excellent.  I am afraid I am rather addicted to the artichoke ravioli.  I have trouble ordering a different entree at this point.  That said, I always end up trying my friends' entrees as well, and almost everything has been good.   The notable exception are their bolognese sauced dishes, which look like wet dog food.  Actually a dog may not even wish to eat it.  Everything else is delicious, really, though!  My favorites are the artichoke ravioli, the lasagnetta (for which they are most well known), fusilli with eggplant, the pizzas, and the antipasto mixed tray. \n\nIf I lived closer I would probably wind up here at least once a week...", "rating": 5, "date": "2011-12-15"}, {"excerpts": ["Tonight we had Fusilli with eggplant and mozzarella, and Lasagnetta.  ", "Both were very good --- excellent flavors and sensuous textures.  ", "We were cheerfully provided with boxes to take home our left-overs plus a large slice of tiramisu which was supposed to be for later, but it's so good we've eaten more than half already.  ", "\"", "Just one more bite. ", "Ooooh.", "\"  "], "author": "Janet M.", "review": "Il Borgo is a cozy unpretentious family restaurant that serves delicious food without a lot of frills.  We stay in the neighborhood a few times a year, and almost always fit in a meal at Il Borgo.  We've always been treated with kindness and good cheer, and have tried many things on the menu for many good meals.\n\nTonight we had Fusilli with eggplant and mozzarella, and Lasagnetta.  Both were very good --- excellent flavors and sensuous textures.  We were cheerfully provided with boxes to take home our left-overs plus a large slice of tiramisu which was supposed to be for later, but it's so good we've eaten more than half already.  \"Just one more bite. Ooooh.\"  All that for $45 including a good tip; quite reasonable for SF.\n\nWe've had faster service sometimes in larger places that can support more servers (but usually with higher prices also).  If you're ready to take your time and savor your food, it's not going to be a long wait.\n\nComfort food.", "rating": 4, "date": "2014-11-03"}, {"excerpts": ["My roommate's pasta was pretty good though (fusilli). ", "They did not comp my meal or give any sort of dessert. ", "In fact, they gave us the wrong bill that was more expensive but caught themselves. ", "The chef came out in search of some constructive criticism. ", "It was awkward ", "but I think I got my point across \"sick, bland, just bad.", "\""], "author": "Jackie M.", "review": "Il Borgo you made me ill & pissed off-o. I took my friend here for a birthday dinner because I heard it was good (but reasonably-priced) Italian food. The atmosphere of the corner restaurant was charming and warm. The service (one woman) was okay. \n\nBread was ok. Caesar salad was pretty good. BUT THEN, I ordered the Pasta Carbonara and all hell broke loose. I have had Lean Cuisines that taste better. I normally don't complain about a dish unless I deem it inedible. This was so sick I had to speak up. When I did, the woman asked if I have ever had the dish. I've been to Italy a couple times and I have had the dish multiple times. There was no excuse. It tasted like it had been sitting in the fridge for a week and they simply re-heated it. \nThe woman admitted she HATES pasta carbonara but didn't want to say anything when I ordered it. WTF?\n\nMy roommate's pasta was pretty good though (fusilli). They did not comp my meal or give any sort of dessert. In fact, they gave us the wrong bill that was more expensive but caught themselves. The chef came out in search of some constructive criticism. It was awkward but I think I got my point across \"sick, bland, just bad.\"", "rating": 2, "date": "2009-02-13"}, {"excerpts": ["I ordered gnocchi and my friend ate fusilli with mozzarella and eggplant.  ", "Both dishes were delicious, tasting very authentic.  "], "author": "Margaret H.", "review": "Stumbled upon this place and so glad we did.  The waitress was beyond sweet and so genuine.  Service was FANTASTIC.\n\nI ordered gnocchi and my friend ate fusilli with mozzarella and eggplant.  Both dishes were delicious, tasting very authentic.  Wine was also tasty.\n\nVery reasonable prices.  Will DEFINITELY go back!", "rating": 5, "date": "2011-11-29"}, {"excerpts": ["then we had the pizza and the fusilli. ", "WOW!!! ", "I am usually a little on gaurd at italian restaurants because of the wack sauce or the over creamyness of stuff :::cough::::(ernestos):::: cough cough ", "but this was AMAZING! ", "it could've been the contrast to GPES sushi at Domo, but i think the fusilli was packed with flavor, and had more than a healthy ratio of sauce to carb... an amazing dish.\n ", "It looks like people who are nice to the wait staff get respect. ", "It doesnt take more than a smile and a thank you...  ", "it might reach all the way to the kitchen? \n", "four stars... ", "AND this review has inspired me to write on people that are rude.... ", ":)"], "author": "Isao K.", "review": "\"wow, that was suck\"-nobu k. on domo\n\nwe left Domo hungry and dissapointed, and were thinking about where we were going to get some real sushi when I stopped to check the menu of the small Italian restaurant on the corner near where we parked.\nAt the top of the menu was carpaccio... Coming from Hawai'i, the only carpaccio i have ever seen was ahi.... so when I saw that they have raw beef carpaccio, i told dad, \n\"you know... this right here is good shit\" \ni then explained to him that most italian food i have been to in the city would not think of serving raw beef due to their lack of balls and authenticity, and that a restaurant that did not only had balls but was also probably really good. \n\"ahhhh\" was the response, and when nobu heard that I would eat the carpaccio, we had to go ( I am usually a vegitarian, but when in the city, dad takes me to sushi, and I felt like I needed to try the beef) \nThe service was great, good bread, dipping oil and viniger and the food was MARVILOSO! \nWe started with carpaccio, and I put a little too much lemon on it, but it was good, just watch the lemon.\nthen we had the pizza and the fusilli. WOW!!! I am usually a little on gaurd at italian restaurants because of the wack sauce or the over creamyness of stuff :::cough::::(ernestos):::: cough cough but this was AMAZING! it could've been the contrast to GPES sushi at Domo, but i think the fusilli was packed with flavor, and had more than a healthy ratio of sauce to carb... an amazing dish.\n It looks like people who are nice to the wait staff get respect. It doesnt take more than a smile and a thank you...  it might reach all the way to the kitchen? \nfour stars... AND this review has inspired me to write on people that are rude.... :)", "rating": 4, "date": "2008-07-07"}], "spaghetti carbonara": [{"excerpts": ["I saw several items on the menu that are standard orders for me at Italian restaurants: bruschetta, caesar salad with anchovies, and spaghetti carbonara.\n\n"], "author": "Michelle R.", "review": "We are staying in the area for a symphony concert, so wanted to find a place to eat that was vegetarian friendly and in walking distance, plus availability on OpenTable.\n\nI saw several items on the menu that are standard orders for me at Italian restaurants: bruschetta, caesar salad with anchovies, and spaghetti carbonara.\n\nMy assessment: not quality anchovies, dressing tasted out of the bottle, lettuce on the salad had bits of sand or dirt from not being washed well enough, bruschetta tomatoes were not ripe and cut too big, basil was cut into inedible chunks, bread was not even toasted, pancetta over done .... at least the actual pasta was perfect al dente. That's the only reason I'm not one starring this place.\n\nAll this for $60? I'm not coming back. Plenty of other places in the civic center area to walk to.", "rating": 2, "date": "2017-04-15"}, {"excerpts": ["He went with a classic $11.75 plate of Spaghetti Carbonara (see photo).\n\n"], "author": "Ed U.", "review": "This is the kind of old-fashioned Italian place that I thought existed only in mid-century romantic comedies probably starring Doris Day and Rock Hudson playing a bickering couple trying to rekindle the spark in their marriage by coming back to the place where he proposed. It has all the period-appropriate set decoration detail - the checkerboard tablecloths, the melted candles in aged Chianti bottles, the walls painted with Milanese cafe scenes. All they need now is a scruffy mutt and a cocker spaniel sharing a strand of spaghetti in the back alley.\n\nI wasn't even aware that Il Borgo existed until I convinced Jamie W. to bypass our regular Italian standby, Stelline, in favor of another similarly themed ristorante. We liked it for the no-frills choices on the menu. There are quite a few pasta dishes, several pizzas, some veal scallopini options - in other words, what you would expect a family-run neighborhood place to serve. We started with two very typical appetizers. The $7 Caprese was pretty standard - a quartet of Roma tomato slices with only a trio of Mozzarella slices with three basil leaves (see photo). Despite the perceived miscounting, it provided satisfaction.\n\nHowever, in making the inevitable comparison, I have to say it lies completely in the shadow of the much fresher-tasting Caprese at Stelline. What did stand out was the $7 Bruschetta, which was a generous mound of chopped tomatoes marinaded in olive oil and minced garlic, all of it atop a trio of oven-toasted bread slices (see photo). That was a genuinely delicious appetizer and not as wet as you expect since they were easy to pick up. Jamie and I both decided to order pasta dishes. He went with a classic $11.75 plate of Spaghetti Carbonara (see photo).\n\nIt was an abundant portion that seamlessly mixed pieces of pancetta, garlic, Parmigiana-Reggiano cheese and eggs. There was nothing extraordinary about the execution, but it was hearty eating on a chilly Friday evening. Mine was better, the $12.75 Penne E Funghi Salsiccie, which mixed nicely al dente penne with plenty of sautéed mushrooms and chunks of Italian sausage that provided a nice kick of spice to the dish (see photo). We didn't have enough room in our bellies for any dessert which I am guessing would have included a spumoni and a tiramisu. Predictable? sure. Good eats? Uh-huh.\n\nFOOD - 4 stars...good, no-frills, no-fuss Italian food that satisfies the belly\nAMBIANCE - 3.5 stars...an old-fashioned vibe that provides a nice contrast to  all the surrounding hipster joints\nSERVICE - 4 stars...definitely a family operation and part of its charm\nTOTAL - 4 stars...not as fresh-tasting as Stelline but a worthy Italiano contender, paisan!", "rating": 4, "date": "2013-02-18"}, {"excerpts": ["Since we wanted to share a couple of dishes, we ordered the Funghi e Salsice pizza (mushroom and sausage) and the Spaghetti Carbonara.  \n\n"], "author": "Mike L.", "review": "For the longest time, I've wanted to try Il Borgo.  Usually, when I'm coming off the Bay Bridge to go home, my route off Octavia leaves me stuck at a red light at Fell and Laguna.  During those 30 seconds, as I wait for the light to turn green, I would sit and wonder if Il Borgo was any good.  Just as I tell myself that I'm going to finally check them out though, the light changes, I go on my way, and I forget that Il Borgo even exists.  That is, until I'm stuck at that light again.  So when my friend recently suggested we go to Il Borgo for dinner, my immediate thought was \"Where the hell is that?\".\n\nWhen we arrived, it was nice that we were seated immediately, but it kinda sucked that our table was right next to the door.  Since it was such a cold night, there was a bit of a chill whenever someone walked in or out.  Skimming the menu, I was impressed to see they offered a good mix of dishes and at prices that are pretty reasonable compared to other Italian joints in SF.  Since we wanted to share a couple of dishes, we ordered the Funghi e Salsice pizza (mushroom and sausage) and the Spaghetti Carbonara.  \n\nAlthough the portions were pretty good for the price, our food left me conflicted.  The pizza tasted pretty good, and I liked how they didn't skimp on the toppings, but man was it oily.  Sure, there was sausage on it, but wow.  Plus, since the crust was so thin, the slices were kinda limp and soggy with oil.  As for the pasta, I really liked the pancetta (how can you not?), but I thought the sauce fell short.  Maybe this is the was it's supposed to be made, but it reminded me more of an alfredo dish than the spaghetti carbonaras I've had in the past.  \n\nThe service was pretty good, especially since the waitress (the owner?) was the only one taking care of each table.  It's a slight bummer that the place is CASH ONLY, but I think I saw an ATM towards the back (there are probably fees though).  Despite the prices, I'm not sure I would come all the way back, but at least I don't have to sit at that light and wonder what Il Borgo is all about anymore.", "rating": 3, "date": "2011-12-28"}, {"excerpts": ["That's how I felt about their Spaghetti Carbonara. ", "It's a unique dish where the sauce is essentially made with raw eggs and some type of bacon and grated cheese. ", "Awesome if it's done right. ", "Borgo's version is great, if you've never had it. ", "I also sampled one of their veal scalopini entrees which was also just a little let's say under seasoned. "], "author": "Rick V.", "review": "I've always wanted to try this place, simply because every time I came into town to visit my old neighborhood, I would see it there on the corner after you take that big left on Fell Street at the end of the Octavia freeway exit.\n\nIt's a tiny place, where you wouldn't expect an Italian restaurant. Atmosphere is a bit dark. It's actually very pleasant. Ideal for an intimate dinner date.\n\nBut the food is just OK. I'm not a huge fan of Italian to begin with, so it's got to be really special to impress me. My thinking is... \"How good could it be if I could do it better?\". That's how I felt about their Spaghetti Carbonara. It's a unique dish where the sauce is essentially made with raw eggs and some type of bacon and grated cheese. Awesome if it's done right. Borgo's version is great, if you've never had it. I also sampled one of their veal scalopini entrees which was also just a little let's say under seasoned. On a good note, I didn't see dishes that were ordered by any patrons that were \"smothered\" in tomato sauce.\n\nService was friendly enough, fairly fast and attentive. However, they don't accept credit cards. I wasn't prepared to empty my wallet, but there is an ATM machine there. There's probably a $2-$3 service charge, hopefully one way... but certain gratuitous fees had to suffer for that, if you know what I mean.\n\nNot a place I'd make a special trip for, unless you had to get rid of a guy named Solozzo.", "rating": 2, "date": "2011-12-27"}, {"excerpts": ["The spaghetti carbonara was good; more cheesy than creamy with a great red sauce.  "], "author": "Alan B.", "review": "This is a perfectly good neighborhood italian restaurant to go get an affordable plate of pasta in large portions.  If it's in your neighborhood, go for it; but I'm not going to leave my neighborhood again to get there.  We have \"italian\" food here too.  Reading other reviews, I wonder if the food varies with the cook of the night, but our meal was satisfactory.  And CASH ONLY.\n\nThey have a couple different red sauces.  Both are delicious.  One with a strong flavor of ripe tomatoes, and another which is tangy.  But overall, the food is standard \"italian\" food that reminds me of the place dad would chose for dinner with the extended family--food with no possibility of offending anyone; taking no risks and hitting no home runs.  The bruschetta was very good.  The lasagnetta is a lasagna noodle spun in a circle instead of layered, with one or two cheeses and minor bits of that fancy ham with a slightly tangy red sauce.  I was bored; STANDARD LASAGNA FROM COFFEEHOUSES THAT SERVE LUNCH IS MORE INTERESTING.  The spaghetti carbonara was good; more cheesy than creamy with a great red sauce.  I also want to note that the pasta plates don't come with any sides, but it is a lot of food.\n\nIt would have been a very comfortable place to eat dinner except the waiter seemed to want the door cracked open instead of closed and the cold wind was blowing the door completely open.  Another patron got up and closed the door after a couple rounds of this.\n\nThe decor is is generally charming, although it ranges from super high quality faux finishes to gaudy, which has the overall effect of \"trying too hard.\"  The waiter I would politely describe as \"efficient\", which is nearly a compliment.  But when there are only four patrons in the restaurant, \"efficient' seems borderline rude...\n\nThere are too many restaurants in S.F. for me to eat here again, but if you are hungry and nearby and on a medium budget it is okay with me if you eat here.", "rating": 2, "date": "2010-04-13"}, {"excerpts": ["Lovely caprese, lobster ravioli and spaghetti carbonara.  ", "Easy in and out in less than an hour.\n", "We'll return."], "author": "Nancy L.", "review": "What a neighborhood gem - and an easy walk (in daylight) to Davies Symphony Hall.   Lovely caprese, lobster ravioli and spaghetti carbonara.  Easy in and out in less than an hour.\nWe'll return.", "rating": 4, "date": "2012-05-07"}, {"excerpts": ["I had the artichoke ravioli which was really amazing, and my Irish husband had the Spaghetti Carbonara, which he said tasted just like his Mom used to make.  ", "Incidentally, I tried to make the same dish for him a few years ago, spaghetti, cream, and bacon, and he did not like it.  ", "At all.  ", "So, we were pretty impressed.  ", "They didn't offer a list of by-the-glass wine, which was unfortunate.  "], "author": "kelly m.", "review": "After a few years of driving by and mostly not noticing this place, I read the reviews and decided to take my husband here for dinner tonight.  After a too-long nap and getting ready session, we checked nextbus.org per a talk thread a few days ago, and realized we had only two minutes before the next 21 Hayes passed us by.   I grabbed my keys and unplugged my various hair straightening devices, and off we went.  It took us a good minute and a half to get out and a block over to the bus stop, and the bus was rolling down the street right on time.  This nextbus thing is priceless!  So, we got to Il Borgo and were sat right away, although they put us at a two-top right in the middle of the small room.  I don't like that; I feel put on display when I'm not on the perimeter, and there was a table for two available, though maybe it was reserved...don't know.  \n\nOur waiter was a middle-aged Italian guy, he seemed pretty authentically Italian.  He brought a loaf of nice soft crusty bread, but it was cold and it would have been nice it they'd given us the illusion that it was just baked by serving it warm.  It was still yummy though.  There was nothing to spread onto our bread or dip it into, although after looking around at other tables, I saw that we just seemed to be missing our olive oil and balsamic vinegar, and their accompanying dipping dish.  I stealthily stole these accoutrements from the empty table next to us and  we devoured the entire loaf over the course of our meal.  \n\nI had the artichoke ravioli which was really amazing, and my Irish husband had the Spaghetti Carbonara, which he said tasted just like his Mom used to make.  Incidentally, I tried to make the same dish for him a few years ago, spaghetti, cream, and bacon, and he did not like it.  At all.  So, we were pretty impressed.  They didn't offer a list of by-the-glass wine, which was unfortunate.  We both got glasses without knowing how much they were and would have been better off getting a bottle to split pricewise.  \n\nOur waiter took a bit too long to bring our check, and I paid in cash and he brought weird change, so that I had to either leave a tip that was either a buck too small or a couple of bucks too much.  I went for too much, because although he was slow, he was a sweetheart and I think we'll be going back to this place.  Hopefully next time he'll seat us on the perimeter of this great little space.", "rating": 4, "date": "2007-03-24"}, {"excerpts": ["spaghetti carbonara (seriously, I know this is a difficult dish to perfect, but still, I've had  a lot better)\n", "-Carpaccio is only so-so, a disappointment, since I was expecting better.\n", "-Cash ", "only. ", "Man, this is such a bummer-I want to earn my frequent flyer miles with my credit card!"], "author": "Selena L.", "review": "Let's start with the plus and minuses... \n\nPlus: \n-Cozy, intimate setting (this is a charming place, feels like one of those tiny and super cute Italian restaurants on a side street in Italy)\n-Charming hostess (she looks like the owner) who speaks to me in Italian, though I don't speak the language, very charming though \n-Cheap and wonderful wine. A bottle of chianti goes for only $25! \n-Lobster ravioli was tasty and not overwhelming. \n\nMinuses:\n-Bad spaghetti carbonara (seriously, I know this is a difficult dish to perfect, but still, I've had  a lot better)\n-Carpaccio is only so-so, a disappointment, since I was expecting better.\n-Cash only. Man, this is such a bummer-I want to earn my frequent flyer miles with my credit card!", "rating": 3, "date": "2009-05-18"}], "penne e funghi salsiccie": [{"excerpts": ["Mine was better, the $12.75 Penne E Funghi Salsiccie, which mixed nicely al dente penne with plenty of sautéed mushrooms and chunks of Italian sausage that provided a nice kick of spice to the dish (see photo). ", "We didn't have enough room in our bellies for any dessert which I am guessing would have included a spumoni and a tiramisu. ", "Predictable? ", "sure. ", "Good eats? "], "author": "Ed U.", "review": "This is the kind of old-fashioned Italian place that I thought existed only in mid-century romantic comedies probably starring Doris Day and Rock Hudson playing a bickering couple trying to rekindle the spark in their marriage by coming back to the place where he proposed. It has all the period-appropriate set decoration detail - the checkerboard tablecloths, the melted candles in aged Chianti bottles, the walls painted with Milanese cafe scenes. All they need now is a scruffy mutt and a cocker spaniel sharing a strand of spaghetti in the back alley.\n\nI wasn't even aware that Il Borgo existed until I convinced Jamie W. to bypass our regular Italian standby, Stelline, in favor of another similarly themed ristorante. We liked it for the no-frills choices on the menu. There are quite a few pasta dishes, several pizzas, some veal scallopini options - in other words, what you would expect a family-run neighborhood place to serve. We started with two very typical appetizers. The $7 Caprese was pretty standard - a quartet of Roma tomato slices with only a trio of Mozzarella slices with three basil leaves (see photo). Despite the perceived miscounting, it provided satisfaction.\n\nHowever, in making the inevitable comparison, I have to say it lies completely in the shadow of the much fresher-tasting Caprese at Stelline. What did stand out was the $7 Bruschetta, which was a generous mound of chopped tomatoes marinaded in olive oil and minced garlic, all of it atop a trio of oven-toasted bread slices (see photo). That was a genuinely delicious appetizer and not as wet as you expect since they were easy to pick up. Jamie and I both decided to order pasta dishes. He went with a classic $11.75 plate of Spaghetti Carbonara (see photo).\n\nIt was an abundant portion that seamlessly mixed pieces of pancetta, garlic, Parmigiana-Reggiano cheese and eggs. There was nothing extraordinary about the execution, but it was hearty eating on a chilly Friday evening. Mine was better, the $12.75 Penne E Funghi Salsiccie, which mixed nicely al dente penne with plenty of sautéed mushrooms and chunks of Italian sausage that provided a nice kick of spice to the dish (see photo). We didn't have enough room in our bellies for any dessert which I am guessing would have included a spumoni and a tiramisu. Predictable? sure. Good eats? Uh-huh.\n\nFOOD - 4 stars...good, no-frills, no-fuss Italian food that satisfies the belly\nAMBIANCE - 3.5 stars...an old-fashioned vibe that provides a nice contrast to  all the surrounding hipster joints\nSERVICE - 4 stars...definitely a family operation and part of its charm\nTOTAL - 4 stars...not as fresh-tasting as Stelline but a worthy Italiano contender, paisan!", "rating": 4, "date": "2013-02-18"}, {"excerpts": ["My wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. "], "author": "Len S.", "review": "My wife & I had dinner with another couple on Saturday 9 April. This was our second visit to this small family run Italian restaurant. We had a 5:15PM reservation and the restaurant quickly filled in shortly after we arrived. This is obviously a popular local eatery.\n \nMy wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. I ordered the Funghi E Salsice Pizza $13. Everyone enjoyed their meals.\nMy pizza was very good with a cracker thin crust and plenty of mushrooms and tasty Italian sausage. Our friends finished their meal by sharing an order of Tiramisu. The serving size of all the meals, and dessert, were generous.\n \nA special mention about the soup - it does not appear on the menu, so you need to ask. My friend's vegetable soup looked delicious and I was a bit sorry I passed on the soup, but I knew I had a pizza in my near term future.\n \nThe service was quite good, especially considering the crowd in this small restaurant. \n \nGood Italian food at a good price, is reason enough to return to Il Borgo.", "rating": 4, "date": "2016-04-10"}, {"excerpts": ["The Penne E Funghi Salsiccie was excellent. \n\n"], "author": "M Y.", "review": "Rustic italian food in a very likeable rustic old world setting. Had the Fettucine Del Borgo which came in a huge plate. I didn't really fancy the canned tomato flavor of the sauce but overall the dish tasted ok and the homemade pasta good with plenty of chicken and sundried tomato. The Penne E Funghi Salsiccie was excellent. \n\nGreat value for the portion and waitress was kind and friendly.  Unpretentious.\n\nFood: ***\nService: *****\nValue: *****\nOverall: ***.5", "rating": 4, "date": "2010-02-07"}, {"excerpts": ["Penne E Funghi Salsiccie (mushroom and sausage). ", "Grilled chicken entree. ", "Forgot the rest. ", "Overall, the food was decent and the penne dish was very good. "], "author": "Jonny Bobby G.", "review": "I've seen this place for years while heading up Fell and I was surprised to see the high marks on Yelp. Could I really have missed this great of a place after all these years?\n\nThe restaurant is located on the outskirts of the nicer part of Hayes Valley and parking is typical for the 'hood. The interior is decorated in a standard cheesy italian grotto scheme which instantly made my scepticism alarm go off. Our party of 6 sat right in the middle of restaurant (as it should be for any birthday) and then off we went with ordering. Menu? Standard italian (american) dishes. \n\nOrdered? Margherita pizza appetizer. Lobster Ravioli. Spaghetti Bolognese. Penne E Funghi Salsiccie (mushroom and sausage). Grilled chicken entree. Forgot the rest. Overall, the food was decent and the penne dish was very good. Was not a fan of the overly fishy lobster ravioli (mush?) or the bolognese - think noodles and meat lacking any hint of a flavored tomato sauce. \n\nWhile food was sufficiently satisfying (portions and flavors) I was left disappointed overall because of the terrible service. Yes, every table was full. Yes, she was working alone. Not my problem... especially if I catch you swigging a glass of wine behind the counter doodling on paper.  It took her over 30 min. to just take our order (thank God we were all just chatting it up) and even longer to make refills, take additional orders or even get us a starter basket of bread. She also had the audacity to moderately complain about all are ordering asking us to consolidate our needs because she was the only one working. WTF!?! Oh, and its cash only and she does all the checks by hand. \n\nThe place has decent food but put it this way, after walking out of the restaurant and strolling down the block, I saw two other places I would have rather visited. At least it's something to check off the list.", "rating": 2, "date": "2009-08-07"}], "artichoke ravioli": [{"excerpts": ["Highly recommend the linguini primavera and the artichoke ravioli. ", "Excellent service and great selection of wines."], "author": "Laura F.", "review": "Amazing Italian restaurant. Highly recommend the linguini primavera and the artichoke ravioli. Excellent service and great selection of wines.", "rating": 5, "date": "2017-09-08"}, {"excerpts": ["The artichoke ravioli was delicious! ", "This place is very worth a visit"], "author": "Debbie G.", "review": "I don't normally like getting pasta in a restaurant as I think it's overrated, but I'm glad I did here! The artichoke ravioli was delicious! This place is very worth a visit", "rating": 5, "date": "2017-08-20"}, {"excerpts": ["Fortunately now one can yelp to the world about the:\n\n- Outstanding tomato-sauce based spaghetti with arguably more salmon than other restaurants will give as a main dish at an amazing $14 price\n\n- Incredible in taste and quantity artichoke ravioli with more tomato sauce and the same amazing price of $14\n\n- Deliciously rich homemade pistachio gelato with each bite almost worth the more than reasonable "], "author": "Jason B.", "review": "Anticipated reunion.\n\nSuch good memories of the first time around. Lingered in such a way you very much want to do it again. Clearly better than most similar things encountered.\n\nTen plus years later made it back to what was and still might be my favorite Italian restaurant in San Francisco. Fortunately now one can yelp to the world about the:\n\n- Outstanding tomato-sauce based spaghetti with arguably more salmon than other restaurants will give as a main dish at an amazing $14 price\n\n- Incredible in taste and quantity artichoke ravioli with more tomato sauce and the same amazing price of $14\n\n- Deliciously rich homemade pistachio gelato with each bite almost worth the more than reasonable $6 price\n\n- Hard to believe wine list where most bottles are ~$30 including the Rosso Di Torgiano blend which paired perfectly with all the above\n\nSpace remains small and intimate and not too crowded. Service was prompt and efficient though the lights on and music off made it clear they wanted us to leave around 10:30.\n\nUnderstandable as it was past closing time but could have lingered a bit longer. After all it's hard to leave things that are better than you remember.", "rating": 5, "date": "2014-07-21"}, {"excerpts": ["My artichoke ravioli came a little while later. ", "The waitress said, \"Careful, it's very hot.", "\" ", "When I hesitated for a few seconds because I thought she was going to set it down on my table for me, she just handed it to me and said, \"Why don't you use your head? ", "If it's so hot, how can I be handling it?", "\" ", "I just couldn't believe she spoke to a customer this way. ", "I'm not sure why she didn't just walk two more steps to the side of the table to put it on the table, rather than handing me a dish over my boyfriend's shoulder. ", "I was pretty mad, but I rationalized that it's just because she's a kind of fiery Italian lady and doesn't mean anything by it. "], "author": "Lijia X.", "review": "I am torn on this place, but thought it was an interesting enough experience to write my first Yelp review in years. My boyfriend and I came here while starving since we live in the neighborhood and have walked by many times. It looks very cozy with nice lighting, ideal for a cute, neighborhood date. When we came in, there were 2-3 four tops open as well as another table for two by the window, but the waitress gestured for us to take a table for two right by the bathroom, where one chair was crowded right up against the chair of the table next to it. My boyfriend and I asked to have the other table for two instead, which was fine with the waitress. No big deal. \n\nThe problems started when I got some kind of a pasta that was not what I ordered. We let the one waitress know and she just said \"Okay, give me the mistake.\" No apologies. My artichoke ravioli came a little while later. The waitress said, \"Careful, it's very hot.\" When I hesitated for a few seconds because I thought she was going to set it down on my table for me, she just handed it to me and said, \"Why don't you use your head? If it's so hot, how can I be handling it?\" I just couldn't believe she spoke to a customer this way. I'm not sure why she didn't just walk two more steps to the side of the table to put it on the table, rather than handing me a dish over my boyfriend's shoulder. I was pretty mad, but I rationalized that it's just because she's a kind of fiery Italian lady and doesn't mean anything by it. I can see, though, how other reviewers have perceived her as being rude. \n\nThe problem though is that the ravioli was, as other reviewers have said, exquisite. The wrapper was clearly home made and the filling had a light, fresh artichoke flavor that was not overshadowed by the light tomato sauce. I would love to eat  it again anytime. The portions were just right. I think I would wrestle with myself when coming back however - the ravioli is amazing (five stars) but the bruschetta, salad, and pizza wre just okay (3.5 stars) and I feel like the service can be unpredictable (2 stars) - from warm and friendly to attitude. Maybe I can find a compromise in getting take out so I can avoid the service while still getting great ravioli a few blocks away from home.", "rating": 3, "date": "2012-01-03"}, {"excerpts": ["In other words, even though my dish was listed as $13.00 on the menu, my friend's dish was $12.75 (penne with mushrooms and sausage), my other friend's dish (artichoke ravioli) was $13.75, etc...we somehow all owed $14.95, according to the server and check that somehow encompassed six of our differently-priced dishes.\n \n", "\""], "author": "Deborah S.", "review": "I thought it was near impossible to screw up Italian food. Apparently, I was wrong. And it wasn't just our food that was screwed up--our checks were too. Big time (read: scam).\n\n-- Food: I got the Fettuccine Il Borgo, which was supposed to be fettuccine, sun dried tomatoes, chicken, and capers. The tomato sauce tasted stale and was severely lacking in flavor--I had to douse my food in red pepper flakes to taste ANYTHING. My fettuccine was oddly dense and definitely did not taste fresh at all. The WORST part: the chicken. Not only was it completely tasteless, the texture was so off-putting--soft and jelly-like, almost like tofu. One of my friends who also ordered this dish agreed wholeheartedly. The last time I checked, chicken is supposed to be...I don't know, fibrous? At least chewable. I don't think I've ever had chicken so strange and inedible in my life.\n\n-- Service (TERRIBLE, TERRIBLE, TERRIBLE): As a party of seven, we asked the server (ostensibly the owner) to split our checks. Of course, we understood that it would be an inconvenience, but we were prepared to tip generously in return. When we received our checks, they were not separate. Instead, six out of seven of us received the same check. \n\nIn other words, even though my dish was listed as $13.00 on the menu, my friend's dish was $12.75 (penne with mushrooms and sausage), my other friend's dish (artichoke ravioli) was $13.75, etc...we somehow all owed $14.95, according to the server and check that somehow encompassed six of our differently-priced dishes.\n \n\"Everyone came out to $15.00,\" the server and/or owner said. \n\nSeriously? What kind of outright scam is this? I'm pretty sure a five-year-old could figure out that with tax and whatever other charges they decided to tack on (as another diner recently noted, there was NO breakdown on our bill...is that even legal?), WE WOULD NOT ALL BE PAYING $14.95. Even if there was a gratuity charge for parties larger than x number of people, it should have been clearly listed on the menu or the bill.\n\nRegrettably, we didn't question the bill or the lack of breakdown of charges, but I literally have never been so confused after a meal, attempting to figure out how much I owed. I now realize that the server/owner/restaurant was essentially scamming us--essentially stealing our money.  \n\nContrary to what the website says, this is NOT \"a small gem\" with \"some of the best Italian cuisine in the city.\"\n\nDisgusting. Stay far, far away, unless you want awful food and appalling service.", "rating": 1, "date": "2013-09-07"}, {"excerpts": ["I am afraid I am rather addicted to the artichoke ravioli.  ", "I have trouble ordering a different entree at this point.  ", "That said, I always end up trying my friends' entrees as well, and almost everything has been good.   ", "The notable exception are their bolognese sauced dishes, which look like wet dog food.  ", "Actually a dog may not even wish to eat it.  ", "Everything else is delicious, really, though!  ", "My favorites are the artichoke ravioli, the lasagnetta (for which they are most well known), fusilli with eggplant, the pizzas, and the antipasto mixed tray. \n\n"], "author": "Heidi M.", "review": "I ate here for the first time this summer, and since then, this has become my favorite Italian restaurant in SF... maybe my favorite restaurant, full stop.  It's a tiny place, and even with reservations, there can be a wait.  Service is very, very slow and rather inattentive -- however, there seems to be only 3 people working in the restaurant, so that is understandable and is not problematic as long as you plan for it. (ie, do not show up here hoping to rush through dinner).  The decor is cute, the lighting is slightly dim, and it seems like it would be a wonderful place for a date.\n\nThe food is excellent.  I am afraid I am rather addicted to the artichoke ravioli.  I have trouble ordering a different entree at this point.  That said, I always end up trying my friends' entrees as well, and almost everything has been good.   The notable exception are their bolognese sauced dishes, which look like wet dog food.  Actually a dog may not even wish to eat it.  Everything else is delicious, really, though!  My favorites are the artichoke ravioli, the lasagnetta (for which they are most well known), fusilli with eggplant, the pizzas, and the antipasto mixed tray. \n\nIf I lived closer I would probably wind up here at least once a week...", "rating": 5, "date": "2011-12-15"}, {"excerpts": ["The artichoke ravioli was delicious.  "], "author": "Megan P.", "review": "Il Borgo was the scene of a lovely date.  The inside is made to look like a small Italian village complete with clothesline full of clothes.  It is small and intimate.  The staff is very attentive to your needs. \n\nWe ordered the Antipasto Misto which was piled high with meats and cheese.  We also enjoyed the Insalata de Borgo which has the perfect amount of blue cheese and radicchio.  The artichoke ravioli was delicious.  The chicken dish we ordered was a little salty.\n\nI will definitely return to this quaint little place next time I am in Hayes Valley. Just remember it is cash only.", "rating": 4, "date": "2011-07-31"}, {"excerpts": ["The homemade artichoke ravioli sauced in a wonderful house tomato sauce was a solid choice. "], "author": "Theresa T.", "review": "Full of surprises around every corner, San Fran has once again delivered delectable Italian food outside the famed Italian district of North Beach. \n\nAfter passing Il Borgo for about 2yrs coming off the lovely 101 N. the fam and I decided to give it a go. A late night dinner in Hayes Valley led to multiple bread baskets, large plates of pasta, vino rosso, and loads of Italian charm. \n\nStarting with a crisp and crunchy salad always gets a meal off to a nice start. Il borgo's house salad is composed of fresh radicchio dressed with a light olive oil and lemon dressing. Perfect to share. \n\nAs a little snack before the main dishes arrived we tried the bruschetta as we tend to at every Italian place we eat at. It was served on warm thick crostini slices with heaps of tomatoes covered in basil and olive oil. Moving onto the main dishes, it is apparent that pasta is the star of this restaurant. The homemade artichoke ravioli sauced in a wonderful house tomato sauce was a solid choice. The lasagnetta (rolled version of lasagna) was generous and delicious.  \n\nThe tiramsu is worth every bite if you can manage to eat a bit more!\n\nCasual ambiance and delicious Italian fare.", "rating": 4, "date": "2010-06-06"}, {"excerpts": ["Artichoke ravioli", ": These were homemade raviolis that looked like Chinese dumplings. ", "The ravioli skin wasn't bad. ", "I liked the texture, it was an appropriate thickness and overall, well made. ", "But the filling was a little lacking of artichoke flavor. ", "I couldn't really taste anything but just some mush in the middle. ", "If you didn't tell me what the ravioli was filled with, I would have never in a million years been able to taste or use visual cues to identify that it was artichoke. \n", "2) ", "Spaghetti: ", "Made with a white wine sauce instead of tomato. ", "The sauce was on the creamier side but it was well flavored. ", "The dish wasn't presented in the most appetizing manner. ", "It just looked like a large dish of spaghetti noodles cooked with nothing else. ", "No variety and very bland looking. \n", "3) ", "Bruschetta: Pretty good. ", "Tomatoes were diced into larger pieces. ", "They went liberal with the olive oil so it that was well pronounced in that taste of the dish. ", "The bread was baked to perfection. "], "author": "Amiee H.", "review": "I had dinner here with a group of friends and I wasn't too impressed with the food after the meal. Presentation of the food wasn't super impressive and the taste wasn't all the way there. \n\nFood: \n1) Artichoke ravioli: These were homemade raviolis that looked like Chinese dumplings. The ravioli skin wasn't bad. I liked the texture, it was an appropriate thickness and overall, well made. But the filling was a little lacking of artichoke flavor. I couldn't really taste anything but just some mush in the middle. If you didn't tell me what the ravioli was filled with, I would have never in a million years been able to taste or use visual cues to identify that it was artichoke. \n2) Spaghetti: Made with a white wine sauce instead of tomato. The sauce was on the creamier side but it was well flavored. The dish wasn't presented in the most appetizing manner. It just looked like a large dish of spaghetti noodles cooked with nothing else. No variety and very bland looking. \n3) Bruschetta: Pretty good. Tomatoes were diced into larger pieces. They went liberal with the olive oil so it that was well pronounced in that taste of the dish. The bread was baked to perfection. Well made dish overall. \n\n**Notes: I just felt like the whole meal was too carb heavy. It was one big carb party. I really feel like the dishes could have used a larger variety of ingredients to prepare. Like adding in a dash of veggies here and there to add color and flavor to the dishes would have really helped. Or at least adding some meat to give a little more nutritional value. Just my two cents...\n\nService:\nPretty nice. No complaints. \n\nAmbiance: \nHeavy Italian themed decor! I loved it! Romantic dim lighting with candles at every table. Made you really feel like you were in Italy, dining in a cozy alley somewhere, experiencing the essence of the Italian culture. The bathroom had this heavy dungeon type lock on it. No one's breaking in that door for sure! \n\nPrice: \nFor the quality and portion of the food here, I don't think it was very appropriately priced. But if you just base the price off of Italian food in general, then it was average. \n*There is no sign but CASH ONLY!!! There is an ATM inside there but who wants to pay stupid ATM fees?!?!\n\nOverall: \nNot too impressed with this place. The presentation and taste of the food was not that great but maybe I just didn't order the right thing? I don't think I'm coming back to give it another chance though :(", "rating": 3, "date": "2011-05-29"}, {"excerpts": ["Pizzettas are great, as is the Lobster ravioli, artichoke ravioli, penne e fungi and I just tried a chicken special: ", "breast rolled with mozzarella and ham in a mushroom sauce.  \n", "Also best tiramisu I've ever had.\n", "These types of places are going extinct, go there already."], "author": "Ian S.", "review": "Waaaa!  They won't take my credit card!  Businesses are now responsible for the fact that you no longer use paper money?\nThis place is great.  Cozy atmosphere, hospitable host and great food.  This is my wife's favorite place, so I've eaten there a lot.  Pizzettas are great, as is the Lobster ravioli, artichoke ravioli, penne e fungi and I just tried a chicken special: breast rolled with mozzarella and ham in a mushroom sauce.  \nAlso best tiramisu I've ever had.\nThese types of places are going extinct, go there already.", "rating": 5, "date": "2011-02-22"}, {"excerpts": ["I've only had one bad experience where instead of artichoke ravioli ", "I got some pork-filled pasta.  ", "Granted, that's a huge mess up, especially since I am vegetarian.   ", "I think under normal circumstances I would probably never go back after that ", "but I have a special place in my heart for Il Borgo.  "], "author": "Molly B.", "review": "This is my favorite Italian restaurant in the city because it's a perfect walk from the lower Haight to the edge of Hayes Valley, and a perfect walk from there to Hotel Biron afterward!\n\nI've only had one bad experience where instead of artichoke ravioli I got some pork-filled pasta.  Granted, that's a huge mess up, especially since I am vegetarian.   I think under normal circumstances I would probably never go back after that but I have a special place in my heart for Il Borgo.  It's so cute and romantic, with candles in chianti bottles and al fresco cafe style seating.   \n\nThey make the best Italian pizza in the city, hands down.  Cracker thin crust, fresh mozzarella, fresh basil ... its always perfect.  The pistachio gelatto is also to die for!  \n\nI think my love for Il Borgo is more sentimental than anything else, but its definitely worth a shot.", "rating": 5, "date": "2007-08-01"}, {"excerpts": ["Favorites are the massive meaty (or meatless, if you like) cheesy lasagnetta, the lobster ravioli, the artichoke ravioli, any of their wood-fired pizzas, their homemade bread served with every meal, and the Il Borgo salad. ", "Formaggio? ", "Buon appetito! "], "author": "Bridget J.", "review": "The first thing that struck me when I first went to this place is that there's a  charming pretend line of laundry strung from the ceiling at the back, reminding you that you're not just at an Italian restaurant, you're at home when you're at this Italian restaurant. Everything else about this experience concurs. \n\nIl Borgo is much better than what you can get in North Beach. A family from Northern Italy makes all of the pasta and sauces fresh daily. There are many choices. Gorgonzola, marinara, pesto, alfredo, and on. Their best is the Aurora sauce--tomato with a touch of cream. Favorites are the massive meaty (or meatless, if you like) cheesy lasagnetta, the lobster ravioli, the artichoke ravioli, any of their wood-fired pizzas, their homemade bread served with every meal, and the Il Borgo salad. Formaggio? Buon appetito! Prego! \n\nOh, and the tiramisu! Ohhhhhhh.\n\nSergio and his son are the chefs, and Mitra, the mother, manages the house and serves meals on weeknights. They're oh so friendly and genuine. They haven't taken down our Christmas postcard for four years. \n\nCash only--ATM at the back. Come hungry or ask for a to-go box. The portions are large, and like the good mother she is, Mitra won't let you leave anything on your plate.", "rating": 5, "date": "2009-02-21"}, {"excerpts": ["The artichoke ravioli was quite delicious, but the fusili appeared packaged and standard.  \n\n"], "author": "Kerry D.", "review": "Il Bargo is a cute, totally decent  Italian restaurant  nestled on a corner in  Hayes Valley.  We  were looking for a casual dinner, so this worked out perfectly.  The interior gives a lot to look at, with a faux awning and window box, balcony and working street lamps.  There is even a little clothesline draped across one corner with some hipster garb.  I half expected Tony from \"Lady and the Tramp\" to whip out his accordion and burst into a hymn-lengthened version of \"Bella Notte.\"\n\nThe food was....alright.  I really enjoy tasting other people's meals (because I am a greedy eater) but there was nothing too inventive about the pasta sauce.  Every dish had the same, ho-hum sauce with lack of flavor and freshness.  The artichoke ravioli was quite delicious, but the fusili appeared packaged and standard.  \n\nThe service was fabulous (they have a staff of some really nice folks) and ambiance was terrific.  Then we get the bill and hear the words of doom:  \"CASH ONLY.\"", "rating": 3, "date": "2008-07-31"}, {"excerpts": ["But yes, I did love their artichoke ravioli.  "], "author": "Jennifer R.", "review": "I wish I could say (for the sake of other readers) that I review objectively; that I enter every restaurant as a blank slate. However, the people I am with and the state I am in must have some effect on how I review. For clarification, by state I mean level of soberness. \n\nWith that said, I loved IL Borgo.  Yes, I may have had two or three glasses of wine before entering this establishment.  Yes, I was with many great people and I don't see how I could not have enjoyed this place.  But yes, I did love their artichoke ravioli.  Great bread and wine selection too!\n\nI agree with Catrinel that the ma and pa way of running things is a huge part of the appeal.  If I were like my parents and went to the same restaurant every Friday night, I could see IL Borgo as being that every Friday night type of place.  The type of place where you walk in, the servers know you by name, your favorite glass of wine is brought to you immediately, and the owner comes out and chats with you.  \n\nThe only downside is the cash only part.  But in light of all the pros of this place, this is only a minuscule con.", "rating": 5, "date": "2007-09-30"}, {"excerpts": ["My favorites are the sausage mushroom pizza, carbonara, and artichoke ravioli (home made)"], "author": "suckafree c.", "review": "I used to live in the hood and this was one of my favorites.  For the mix of price, authenticity, and maximum deliciousness it get 5 stars.  \n\nIt's really a home-y place with no scene... Just normal people.  No frills, friendly owners, it can be quirky but that's the charm.\n\nMy favorites are the sausage mushroom pizza, carbonara, and artichoke ravioli (home made)", "rating": 5, "date": "2009-09-22"}, {"excerpts": ["I had the artichoke ravioli which was really amazing, and my Irish husband had the Spaghetti Carbonara, which he said tasted just like his Mom used to make.  ", "Incidentally, I tried to make the same dish for him a few years ago, spaghetti, cream, and bacon, and he did not like it.  ", "At all.  ", "So, we were pretty impressed.  ", "They didn't offer a list of by-the-glass wine, which was unfortunate.  "], "author": "kelly m.", "review": "After a few years of driving by and mostly not noticing this place, I read the reviews and decided to take my husband here for dinner tonight.  After a too-long nap and getting ready session, we checked nextbus.org per a talk thread a few days ago, and realized we had only two minutes before the next 21 Hayes passed us by.   I grabbed my keys and unplugged my various hair straightening devices, and off we went.  It took us a good minute and a half to get out and a block over to the bus stop, and the bus was rolling down the street right on time.  This nextbus thing is priceless!  So, we got to Il Borgo and were sat right away, although they put us at a two-top right in the middle of the small room.  I don't like that; I feel put on display when I'm not on the perimeter, and there was a table for two available, though maybe it was reserved...don't know.  \n\nOur waiter was a middle-aged Italian guy, he seemed pretty authentically Italian.  He brought a loaf of nice soft crusty bread, but it was cold and it would have been nice it they'd given us the illusion that it was just baked by serving it warm.  It was still yummy though.  There was nothing to spread onto our bread or dip it into, although after looking around at other tables, I saw that we just seemed to be missing our olive oil and balsamic vinegar, and their accompanying dipping dish.  I stealthily stole these accoutrements from the empty table next to us and  we devoured the entire loaf over the course of our meal.  \n\nI had the artichoke ravioli which was really amazing, and my Irish husband had the Spaghetti Carbonara, which he said tasted just like his Mom used to make.  Incidentally, I tried to make the same dish for him a few years ago, spaghetti, cream, and bacon, and he did not like it.  At all.  So, we were pretty impressed.  They didn't offer a list of by-the-glass wine, which was unfortunate.  We both got glasses without knowing how much they were and would have been better off getting a bottle to split pricewise.  \n\nOur waiter took a bit too long to bring our check, and I paid in cash and he brought weird change, so that I had to either leave a tip that was either a buck too small or a couple of bucks too much.  I went for too much, because although he was slow, he was a sweetheart and I think we'll be going back to this place.  Hopefully next time he'll seat us on the perimeter of this great little space.", "rating": 4, "date": "2007-03-24"}, {"excerpts": ["The artichoke ravioli in marinara was exquisite."], "author": "Alex G.", "review": "Excellent Italian food... all homemade. I highly recommend this place. The artichoke ravioli in marinara was exquisite.", "rating": 5, "date": "2011-12-26"}, {"excerpts": ["I've stuck to the excellent pastas (artichoke ravioli, gnocchi) and pizza (quatro stagioni (sp)) "], "author": "Laurie A.", "review": "This is pretty much the place I picture in that Billy Joel tune....oh, man, the wax laden wine bottles, tiny cramped tables (unless you snag one of the boothes), the elder statesman and his (?) wife runnign the place on alternate nights....you rush in from the cold and it's warm and so so inviting.  I missed having a neighborhood Italian place for so long (Incanto is great but too \"upscale\" to fit the bill here).\n\nI've stuck to the excellent pastas (artichoke ravioli, gnocchi) and pizza (quatro stagioni (sp)) but recently ventured into the non carb world (very unlike me) and got the grilled salmon.\n\n\"Medium rare please\" I kinda admonished, I admit.  I expected well overdone and over oiled salmon and thought \"why'd i do this?\" till it arrived at the table - beautifully cooked, it almost looked like a piece of seared sashimi.  YUM.  Not over sauced.  And served up with 4 spears of tasty rosemary crusted potato (I wish they were even crispier) and some decadent but not overly so buttery broccoli w/a light dusting of a crisp cheese.  Much more restraint t han I ever would imagine.  \n\nSo happy to branch out.  Oh yeah, the pizza is still solid  - not life giving, just good.\n\nLastly, the carpaccio is EXCELLENT.  Very tender well seasoned meat made even better by the accoutrements of capers, lemon, shaved parm and s&p.  \n\nA meal here will set you back about $30 per person.  I agree w/the reviewer who said \"BYOB\".  Corkage is about $10 or $15.  2 red/2 whites by the glass, both forgettable, one beer and a limited and unexciting wine by the bottle list.", "rating": 3, "date": "2006-09-12"}, {"excerpts": ["A good selection of vegetarian dishes, the artichoke ravioli was excellent and well received by P's dad.\n\n"], "author": "Nadine S.", "review": "Heck yes, Il Borgo. Heck yes. You were kind of rude, but in an endearing way. Very European. You warmed up as the courses moved on, and as we ordered more. \n\nLasangetta was divine. We shared; it was plenty with a salad and their delicious crunchy crusty bread. Pistaccio gelato was the best we've ever had, and in the end, we loved our waiter, and the teddy bear in the bathroom was still unexpected, though I had been warned by fellow yelpers. There are plenty of other dishes I am looking forward to trying in the future. Lots of neighborhoodies and familiar faces. Definitely a nice non-pretentious off the track, but not out of the way comfortable Italian restaurant.\n\nA good selection of vegetarian dishes, the artichoke ravioli was excellent and well received by P's dad.\n\nCash only- but they have an ATM inside. No worries!", "rating": 5, "date": "2007-09-07"}, {"excerpts": ["I also sometimes give up my comfort meal and get the lobster or artichoke ravioli. ", "My hubby likes the Chicken Parmesan but they only have it on certain days. "], "author": "Katy D.", "review": "Ok - just order the Lasagnetta. Lasagnetta 12.75\nRolled lasagna filled with prosciutto and mozzarellaI. I think their cheaper bottle of Chianti pairs perfectly with the Lasagnetta. \n\n\n\nAll the pasta is hand made. I also sometimes give up my comfort meal and get the lobster or artichoke ravioli. My hubby likes the Chicken Parmesan but they only have it on certain days. You have to ask for it - it is never on the menu. \n\nSometimes the service is a little slow but they usually reward you with tiramisu (sp?).\n\nI suggest going during the week. I often order take out - they are fast and give you a huge piece of bread for the road. \n\nPS - If eating in, I suggest public trans or walking. Parking is pretty hard. During the week you can usually find a spot on the east /south side of Fell.", "rating": 4, "date": "2007-03-25"}, {"excerpts": ["One look at the menu and the bruscetta and artichoke ravioli (chef's special) were both no brainers. ", "BTW, I learned bruschetta is pronounced 'brus-ketta'. ", "Damn...", "and you think you know these things! ", "I think I learned a lot more italian than I could have on one of those CDs. "], "author": "Ranj V.", "review": "Screw the food..for now. The decor did it all for me. From rustic wooden tables, checkered italian-eatery style table cloths, a creative clothesline in a corner, painted walls to italian charm, this damn little hole is such an old-world turn on! The melting candle on each table was a delight and a point of disagreement between my dinner partner and I. \n\nThe wine-by-glass selection is very limited - there are only two you can do. Do the Merlot. I am not a chianti fan in any case and this Merlot was actually quite balanced. One look at the menu and the bruscetta and artichoke ravioli (chef's special) were both no brainers. BTW, I learned bruschetta is pronounced 'brus-ketta'. Damn...and you think you know these things! I think I learned a lot more italian than I could have on one of those CDs. The owner (assumed) insisted on speaking only italian with us (which is a little disconcerting when there is a communication gap and informative, when you dont know a shread of the language)\n\nSo this is where the fun tapers. Ordinary bread-n-tomatoes, a slightly sticky ravioli, uninteresting tomato sauce and insipid conversation dulled things a bit.\n\nI think I'd go back. This time..with better food for ear and different item off the menu?\n\nOh.. and don't forget cash. This place does not take credit cards, but they have a *conveniently* placed atm in one corner!", "rating": 3, "date": "2007-05-28"}, {"excerpts": ["I had artichoke ravioli, didn't realize how hungry I was until I took the first bite. ", "Next was dessert, and I had Chocolate, Strawberry and Vanilla gelato and Tiramisu. ", "Gelato was what you would expect, delicious but ", "the Tiramisu was the best, it was spongy and light and melted in my mouth. "], "author": "Caryl C.", "review": "If you want to know how it feels to be served in an Italian home with authentic Italian cooking, go here. The restaurant is very homey and the waitress is very courteous. The only thing that separates you from the kitchen is the waitress counter, everything from the pots hanging from the ceiling to the stone walls and stone oven makes the restaurant feel homey. The walls are painted to look like the streets in Italy, dinner is candle lit, since it was winter when I went-there were scarves hanging from a clothesline that ran across one corner of the room, the metal chairs have red comfy pillows, and the whole room smells like fantastic food. Now to the food, the food is delicious. I had artichoke ravioli, didn't realize how hungry I was until I took the first bite. Next was dessert, and I had Chocolate, Strawberry and Vanilla gelato and Tiramisu. Gelato was what you would expect, delicious but the Tiramisu was the best, it was spongy and light and melted in my mouth. If anything I would go back to try another ravioli and top it off with Tiramisu.\n\nThis restaurant is cash only, with an ATM located inside, in case customers forget or just don't know. And look to spend 13-20 per plate.", "rating": 5, "date": "2010-02-15"}, {"excerpts": ["I had the artichoke ravioli, which was perfect for me. ", "Made with love and detail, but classic Italian fare.  ", "My boyfriend went with the pesto gnocchi based on yelpers galore. ", "However, it was a bit overcooked and the large portion became a bit monotonous (sad that we are so used to getting 5 gnocchi). ", "Kitschy ambience fit well, better than trying to be hip or whatever, loved the cute little kitchen. ", "Overall, a great experience, I would go back for sure."], "author": "Cassie C.", "review": "Picked this place from Yelp for pre-symphony w/o major price tag or crowd. I would never had noticed this place and I am glad we went. It was so authentic, really felt like some random place in Italy. Even the bread rang true, no salt but you drench it in oil and yum. The antipasto platter was great, and the Prosecco bottle was a mere $29. I had the artichoke ravioli, which was perfect for me. Made with love and detail, but classic Italian fare.  My boyfriend went with the pesto gnocchi based on yelpers galore. However, it was a bit overcooked and the large portion became a bit monotonous (sad that we are so used to getting 5 gnocchi). Kitschy ambience fit well, better than trying to be hip or whatever, loved the cute little kitchen. Overall, a great experience, I would go back for sure.", "rating": 4, "date": "2007-03-08"}, {"excerpts": ["I ordered the lobster ravioli while she ordered the artichoke ravioli. ", "Both were very delicious, even though I was jealous of the insane amount of garlic that came with her dish. ", "The ravioli looks handmade, which made it extra delicious for me. "], "author": "Alexis C.", "review": "After being in the jungles of Costa Rica for roughly three weeks, I wanted three things: 1. Find out who won the Home Run Derby, 2. Get my hands on an iPhone, and 3. Have some good italian food. I still need to find someone with an iPhone.\n\nMy girlfriend and I decided to try Il Borgo out, seeing that they would be open after the All Star Game ended. I had seen this place many times (especially when the Fell Street freeway exit used to dump you right in front), but never had gone in. Parking can be a pain, which is about usual for this neighborhood, but we found parking right across the street. The place was near empty when we arrived, so we sat immediately and looked over the menu.\n\nI ordered the lobster ravioli while she ordered the artichoke ravioli. Both were very delicious, even though I was jealous of the insane amount of garlic that came with her dish. The ravioli looks handmade, which made it extra delicious for me. We also ordered a bottle of wine and a caprese salad that came with an obscene amount of fresh ground pepper (which to me, is a good thing).\n\nThe waitress, who may or may not have been the owner, was very nice and was very good about recommending the wine. The food was quick, as in the second we were done with the caprese our ravioli arrived. When we were done we sat and finished our wine and it was nice. There was some drum and bass playing, which I found a little odd, but I didn't really notice it after a while.\n\nUnfortunately, they are a cash only business. Having to double-check at the door that you have enough cash is a little annoying, but I'd say the food is worth it. Not sure why they do this, though. Also, even though the website says they close at 11:30 Monday - Saturday, we left around 10:30ish and they were closing. So I'm not sure about the time thing.\n\nJust remember to bring cash, for real.", "rating": 4, "date": "2007-07-11"}, {"excerpts": ["I remember eating garlic bread, mozzarella with tomatoes, and artichoke ravioli but ended up being sick all night. ", "The waiter was harsh and not very welcoming. ", "He rather seemed to be annoyed taking orders and serving food. ", "I have not eaten any pasta since then. ", "It wasn't a pleasant experience at all.  ", "I will never go back. ", "Ever!"], "author": "MS K.", "review": "First up, the restaurant design looks really nice and cozy. I remember eating garlic bread, mozzarella with tomatoes, and artichoke ravioli but ended up being sick all night. The waiter was harsh and not very welcoming. He rather seemed to be annoyed taking orders and serving food. I have not eaten any pasta since then. It wasn't a pleasant experience at all.  I will never go back. Ever!", "rating": 1, "date": "2009-03-26"}, {"excerpts": ["I had artichoke ravioli, it was fresh and just right", ", I actually ate every bit of it. ", "My boyfriend has penne with sausage and mushrooms and he liked it. ", "Everyone liked their food. ", "It was my friend's birthday and they brought her tiramusu with candle in it", ", that was a nice touch. ", "The prices are not bad and you get quite a bit of food. ", "I don't know if I would choose to come back here just because the wine list and lack of liquor choices, those things matter too much to me. ", "There are so many amazing wines in California, there really is no excuse for a bad selection of off tasting wines..."], "author": "Samantha J.", "review": "I still can't decide whether this place is cheesy and weird or authentic and fun. This place is funky, in so many ways. Things you should know before you venture through the doors. They only serve wine, and the wine list is all italian and very limited in selection. We tried four different bottles of red wine (eight of us...), there are only about eight choices of reds, even fewer of white, and one prosecco. I think we only enjoyed the last bottle we ordered (Nero D'Avila) because we were fairly buzzed by then. The wines were all dry and some even tasted effervescant like flat champagne, very off, even maybe \"corked\" per se. They don't serve beer or liquor. The service was one haughty looking italian woman who pretended for quite awhile that the eight of us were just some mirage in her way. We had to flag her down and ask her to take our orders etc.... This is a small place, one room schoolhouse type joint. The chairs are very heavy iron outdoor type chairs that my boyfriend had to haul aside everytime I needed to get up. They do have some wood booths that looked fun to sit in. They don't take credit cards but they do have an on-site ATM machine so they can charge you a frickin fee for cash, I hate that scam. The one shiny spot was the food. I had artichoke ravioli, it was fresh and just right, I actually ate every bit of it. My boyfriend has penne with sausage and mushrooms and he liked it. Everyone liked their food. It was my friend's birthday and they brought her tiramusu with candle in it, that was a nice touch. The prices are not bad and you get quite a bit of food. I don't know if I would choose to come back here just because the wine list and lack of liquor choices, those things matter too much to me. There are so many amazing wines in California, there really is no excuse for a bad selection of off tasting wines...", "rating": 3, "date": "2007-05-19"}], "lobster ravioli": [{"excerpts": ["Definitely going to come here again \n\nLobster ravioli was delicious. "], "author": "Brittany C.", "review": "This place was so nice! Very welcoming. Great food, good wine, awesome price. Definitely going to come here again \n\nLobster ravioli was delicious. Lasagna is not the classic style, but so tasty!", "rating": 5, "date": "2018-07-18"}, {"excerpts": ["Lobster Ravioli: I really enjoyed this! ", "and the sauce didn't overpower the taste of the lobster. ", "Only thing was the portion size was tinyyyyy ", "I was still a bit hungry after :(\n"], "author": "Jingxi Z.", "review": "Haven't had Italian food in a hot minute and popped into this one since we were in the neighborhood on a Saturday night with no wait!!\n\nFree bread at Italian restaurants is a must and their bread was pretty solid - crunchy on the outside, soft on the inside. We asked for seconds (lol, but who wouldn't) and the second batch was cold! Um?\n\nWe ordered:\n\nCaprese: Incredibly underwhelming taste...and they definitely skimped on the basil!\n Lobster Ravioli: I really enjoyed this! and the sauce didn't overpower the taste of the lobster. Only thing was the portion size was tinyyyyy I was still a bit hungry after :(\nFettuccine Bolognese: Carby, greasy, heavy, but delicious! \n\nI've never really had a bad experience with Italian food (how can you go wrong with carbs, cheese, and greasy meat) and we definitely enjoyed our time here BUT I didn't think anything really stood out for me. The price point was quite reasonable but portion size could be a bit bigger.", "rating": 3, "date": "2016-07-13"}, {"excerpts": ["I got the lobster ravioli and it was really tasty. ", "The pizza was great as well. ", "Everything was homemade even the bread! ", "I would definitely go back here."], "author": "Dianne P.", "review": "We came last night and we really enjoyed the dinner. The staff were nice and entertaining ! It was pretty busy but they attended to us every so often. The food is great too! I got the lobster ravioli and it was really tasty. The pizza was great as well. Everything was homemade even the bread! I would definitely go back here.", "rating": 5, "date": "2017-09-04"}, {"excerpts": ["She ordered the gnocci and I ordered the lobster ravioli. ", "The food came out quickly and upon serving she asked if we wanted grating cheese. ", "I said definitely and the waitress immediately put on a scorned face and said \" gnocci you put cheese on but in Italy we don't put cheese on seafood\". ", "She took two steps away and stopped and looked at me like there was something wrong with me and then got the cheese. ", "I came here to have a nice relaxing meal ", "and now I found myself irritated that she had such an attitude. ", "Italian/American, from Boston, I don't need her telling me how to eat Italian food!  ", "Even if that was the case, you don't chastise a customer. ", "From he start this woman had an edge.  ", "As I am eating, I am so aggravated about her attitude, when she came to the table to ask how everything was, I told her \"I'm Italian and I didn't think she should tell people how to eat their food\". ", "Now she said she was just telling me how they do it in Italy.  ", "She said she wasn't being critical and I was being intimidating.  ", "My wife tried to explain how her behavior was not appealing. ", "Now she says because I complained about her that I was mental! ", "I don't know how the dining experience can change so drastically in 1 year, but as I scanned through the reviews, I am not the only one who has a problem with this woman. ", "Plenty of restaurants around to spend your hard earned money. ", "Don't go here. ", "Food was better than good, but it isn't great. ", "Not worth the abuse!"], "author": "R C.", "review": "Visiting my son in SF from Boston, my wife and I had eaten here last year and were waiting to return because we were impressed. Not so much this year!  After seating, the waitress came over to ask about drinks, we also ordered at that time, but she really was  not very cordial and whisked my wife's wine glass off the table rather hastily as if she was annoyed because she didn't order any. She ordered the gnocci and I ordered the lobster ravioli. The food came out quickly and upon serving she asked if we wanted grating cheese. I said definitely and the waitress immediately put on a scorned face and said \" gnocci you put cheese on but in Italy we don't put cheese on seafood\". She took two steps away and stopped and looked at me like there was something wrong with me and then got the cheese. I came here to have a nice relaxing meal and now I found myself irritated that she had such an attitude. Italian/American, from Boston, I don't need her telling me how to eat Italian food!  Even if that was the case, you don't chastise a customer. From he start this woman had an edge.  As I am eating, I am so aggravated about her attitude, when she came to the table to ask how everything was, I told her \"I'm Italian and I didn't think she should tell people how to eat their food\". Now she said she was just telling me how they do it in Italy.  She said she wasn't being critical and I was being intimidating.  My wife tried to explain how her behavior was not appealing. Now she says because I complained about her that I was mental! I don't know how the dining experience can change so drastically in 1 year, but as I scanned through the reviews, I am not the only one who has a problem with this woman. Plenty of restaurants around to spend your hard earned money. Don't go here. Food was better than good, but it isn't great. Not worth the abuse!", "rating": 1, "date": "2018-03-15"}, {"excerpts": ["I have had and LOVED the carbonara, lobster ravioli, and lasagna. ", "I love them so much that I haven't ordered anything else! ", "Any friends I have taken have enjoyed whatever they have ordered. ", "The inside of the restaurant is painted so that it looks like you are in an outdoor square in Italy. ", "I highly recommend it for date night!! ", "My boyfriend lived in Italy for seven years and this is his favorite place to eat in the area. ", "The owner is very nice and every time we've eaten here, we have loved it."], "author": "K K.", "review": "We eat at Il Borgo before going to the sf symphony on a regular basis! What a cute restaurant and it's unlike all the other Hayes valley restaurants. I love the food, the decor, and the fact it's off the beaten path. The food is wonderful, perhaps one of the best Italian places in the city. It's not your typical Americanized Italian food, thankfully. I have had and LOVED the carbonara, lobster ravioli, and lasagna. I love them so much that I haven't ordered anything else! Any friends I have taken have enjoyed whatever they have ordered. The inside of the restaurant is painted so that it looks like you are in an outdoor square in Italy. I highly recommend it for date night!! My boyfriend lived in Italy for seven years and this is his favorite place to eat in the area. The owner is very nice and every time we've eaten here, we have loved it.", "rating": 5, "date": "2017-10-13"}, {"excerpts": ["Favorites:\n\ninsalata del borgo\nbruschetta \nlobster ravioli\nbolognaise\n\nand absolutely save room for the tiramisu.  "], "author": "B K.", "review": "Hideaway gem amongst gentrified, hipsterized sf dining.  \n\nExcellent, simple Italian dishes.  Warm, friendly staff.  The owner is always polite, welcoming and attentive.\n\nAlways always good food.\n\nFavorites:\n\ninsalata del borgo\nbruschetta \nlobster ravioli\nbolognaise\n\nand absolutely save room for the tiramisu.  Best I have every had.", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["I ordered the penne mushroom and sausage with Italian sauce and my friend ordered the lobster ravioli. ", "This \"waiter\" was very preoccupied his manner was one of impatience and he seemed irritated about something. ", "He was not pleasant. ", "So he poured the Grigio and left and later I got his attention and asked for a different wine as the Grigio was of poor quality. ", "I asked for a red wine this time, I couldn't understand what he said about the vintage ", "but I didn't like the taste of it either, however, I kept it.  ", "When the herb salad arrived it was fresh and tasty and the bread was also put upon the table at the same time. ", "A few bites into the salad the main meals arrived of penne and ravioli. ", "Now the tables in this restaurant are really small so our table was crowded with platters, the salad, bread, glasses of water, and wine glass. ", "My friend asked for tea so we had a tea pot on the table too of which our waiter, who never introduced himself, sloppily pushed 3 bags of green tea in between the dishes and made no offer to take away any of the dishes on the crowded table. ", "One of the two waiters happened to be walking by and we asked her to take away some of the dishes. ", "By the way the other two waiters were dressed professionally in black pants, white shirt, and white neat aprons. ", "The penne with mushroom and sausage was well prepared and tasty but nothing memorable and my friend was disappointed with his lobster ravioli as he said it was bland. ", "He said there was no noticeable lobster taste. ", "I tasted it for myself and there was just the slightest hint of a lobster taste and indeed the sauce was bland. ", "Sorry to say I was disappointed in the service and the meal. ", "The bathroom was cool with a big dungeon-like lock on the door."], "author": "Zii R.", "review": "I've passed by this restaurant many times as I live nearby and would stop and peek in the window at people eating their meals and admiring the quaint Italian decor.  So I was really looking forward to the ambiance and food when I finally got the chance to eat there.  I went on a Saturday (4/8/17) evening arriving about 6:30 pm meeting up with a friend who was already there. There were two waiters working that night neither of which paid any attention to us as we waited.  My friend got one of their attention and asked for another glass of water.  We read the menus which were already on the table and made our decision.  Waited and waited. Then a sort of unkempt older guy comes over wearing jeans and wrinkled shirt with a green apron haphazardly tied and asked us, I think, if we were ready to order. (He looked more like a short order cook than a waiter).  No greeting of any kind! I asked for a glass of wine and he named the three wines of which I could only make out \"Grigio\" as the place was buzzing with conversations from other tables and with his accent it was hard to make out what he was saying. I ordered the penne mushroom and sausage with Italian sauce and my friend ordered the lobster ravioli. This \"waiter\" was very preoccupied his manner was one of impatience and he seemed irritated about something. He was not pleasant. So he poured the Grigio and left and later I got his attention and asked for a different wine as the Grigio was of poor quality. I asked for a red wine this time, I couldn't understand what he said about the vintage but I didn't like the taste of it either, however, I kept it.  When the herb salad arrived it was fresh and tasty and the bread was also put upon the table at the same time. A few bites into the salad the main meals arrived of penne and ravioli. Now the tables in this restaurant are really small so our table was crowded with platters, the salad, bread, glasses of water, and wine glass. My friend asked for tea so we had a tea pot on the table too of which our waiter, who never introduced himself, sloppily pushed 3 bags of green tea in between the dishes and made no offer to take away any of the dishes on the crowded table. One of the two waiters happened to be walking by and we asked her to take away some of the dishes. By the way the other two waiters were dressed professionally in black pants, white shirt, and white neat aprons. The penne with mushroom and sausage was well prepared and tasty but nothing memorable and my friend was disappointed with his lobster ravioli as he said it was bland. He said there was no noticeable lobster taste. I tasted it for myself and there was just the slightest hint of a lobster taste and indeed the sauce was bland. Sorry to say I was disappointed in the service and the meal. The bathroom was cool with a big dungeon-like lock on the door.", "rating": 2, "date": "2017-04-09"}, {"excerpts": ["Lobster ravioli\n was very good for me.\n "], "author": "S.K. Y.", "review": "15.06.00     First Visit\n\nFood ------------------- 3 1/2 stars (overall)      \nFood/Price -----------  YES  (bang for the buck)\n                                  Let's be real\n                                  Most of us can't eat 4-5 stars everyday\n                                  Unless u are borned with a silver spoon\n                                  Able to enjoy the basic to fancy (diversity) is good                                  \n\nSolid Italian food\nGenerous portion\n  are u tired to eating $18 pasta dishes w half the portion of this place?\n  sometimes I wonder about those places\n\nMushroom Pizza was pretty good.\nLobster ravioli\n was very good for me.\n can't wait to get it again!\n\nSimple, Bang for the buck\nInterior ... \nA place I would revisit time to time\n good taste\n reasonable price", "rating": 4, "date": "2015-07-10"}, {"excerpts": ["We were a group and ordered the house salad, beef Carpaccio, mushroom pizza, lobster ravioli, chicken fettuccine, and meat lasagna, and a bottle of red wine. ", "Overall the food was good and decently priced. ", "The total bill was about $180. ", "My favorite dish was the rolled meat lasagna and ravioli. ", "Both I think had the same sauce. ", "The beef Carpaccio was not completely thawed. ", "However, a few small items that would have made the meal better:\n1. ", "All food consistently hot; only the lasagna temperature was to my liking.\n", "2. ", "Warm bread\n3. ", "A house salad that had a few more of the basic essentials", "; it was just romaine lettuce and dressing\n4. ", "Came on one of the colder "], "author": "Trudie S.", "review": "The restaurant came highly recommended as an unnoticed neighborhood gem. I agree; nice little gem that is good for a casual dinner with friends. Food was good. We were a group and ordered the house salad, beef Carpaccio, mushroom pizza, lobster ravioli, chicken fettuccine, and meat lasagna, and a bottle of red wine. Overall the food was good and decently priced. The total bill was about $180. My favorite dish was the rolled meat lasagna and ravioli. Both I think had the same sauce. The beef Carpaccio was not completely thawed. However, a few small items that would have made the meal better:\n1. All food consistently hot; only the lasagna temperature was to my liking.\n2. Warm bread\n3. A house salad that had a few more of the basic essentials; it was just romaine lettuce and dressing\n4. Came on one of the colder SF nights and little heat would have made the experience more comfortable.\n\nThe service was good; all provided by one woman who served as host and waitress. I would come again.", "rating": 3, "date": "2015-01-02"}, {"excerpts": ["I was craving Italian and remember their lobster ravioli being decent. ", "I don't know what happened but this place has gone down hill really fast. ", "I asked for merlot, she gave me chianti. ", "Everyone who came later got their food before us, and when I asked one of the workers about our food, the waitress yelled across the restaurant \"it's coming!", "\" ", "When the food came, it was so bland ", "I didn't want to waste the calories on it.... ", "and I never skip on pasta. ", "Never coming back."], "author": "Melanie S.", "review": "I was craving Italian and remember their lobster ravioli being decent. I don't know what happened but this place has gone down hill really fast. I asked for merlot, she gave me chianti. Everyone who came later got their food before us, and when I asked one of the workers about our food, the waitress yelled across the restaurant \"it's coming!\" When the food came, it was so bland I didn't want to waste the calories on it.... and I never skip on pasta. Never coming back.", "rating": 1, "date": "2015-11-06"}, {"excerpts": ["We had Carpaccio and Bruschetta for appetizer and Lasangeta Al Vegetali, Lobster Ravioli and Fettuccine Del Borgo for main dish. ", "All tested very good. ", "The portion was good as well. ", "Most of all, what a great environment!!"], "author": "Mike N.", "review": "One of the best authentic Italian restaurant in San Francisco, complemented by best in class service!! We had Carpaccio and Bruschetta for appetizer and Lasangeta Al Vegetali, Lobster Ravioli and Fettuccine Del Borgo for main dish. All tested very good. The portion was good as well. Most of all, what a great environment!!", "rating": 5, "date": "2015-12-31"}, {"excerpts": ["We had the lobster ravioli and the gorgonzola gnocci. "], "author": "Hector R.", "review": "Il Borgo is a nice little cozy Italian restaurant that makes you feel like you're eating just outside a restaurant in Italy.\n\nWe stumbled into this place by accident not 20 seconds after my girlfriend got a craving for gnocci. The hostess/waitress was really nice and took great care of us. We had the lobster ravioli and the gorgonzola gnocci. It was delicious and very reasonably priced.\n\nHighlights: the decoration! Real candles, murals that make it seem like you're on an Italian street, the streetlight...", "rating": 5, "date": "2014-10-27"}, {"excerpts": ["Lobster ravioli for 16 dollars, which isn't cheap. ", "A plain waxed box and a large cut of twisted baguette. ", "The bread, cold from my walk and undisguised by heat, was fantastic. ", "The ravioli was perfect -- not too salty, al dente, sturdy, savory. "], "author": "Christophe C.", "review": "Good to the last bite. I've ignored this spot for a while since 1) I'm not crazy about Italian 2) I'm not crazy about Italian in SF, and 3) the reviews aren't great.\n\nIt's pretty dingy on the outside. The inside reminds me of little Venice in Vegas, with the large murals and decor. There are the checker tablecloths, and the hostess even speaks with an Italian accent littered with ciaos and gracis.\n\nI don't know what service is like since I got takeout.\n\nLobster ravioli for 16 dollars, which isn't cheap. A plain waxed box and a large cut of twisted baguette. The bread, cold from my walk and undisguised by heat, was fantastic. The ravioli was perfect -- not too salty, al dente, sturdy, savory. It was a medium portion, but paired with the bread, the only thing that was missing was a glass of red wine.\n\nOh and the hostess preferred cash -- pretty lucky I had a few bills on me.", "rating": 4, "date": "2014-04-22"}, {"excerpts": ["But everything else we've had here is delicious too, from the Chicken Marsala to the Lobster Ravioli.  "], "author": "Grace C.", "review": "Love the food and hospitality here!\n\nMy boyfriend lives about half a block away from Il Borgo, so obviously this is our go-to Italian place in SF.\n\nDim lights, cozy atmosphere and delicious Italian food. I highly recommend the lasagnetta.  But everything else we've had here is delicious too, from the Chicken Marsala to the Lobster Ravioli.  Absolutely delish.\n\nIf you're in the area & looking for great Italian food, definitely give Il Borgo a try!  It's also very affordable.", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["Ordered the bruschetta, lobster ravioli, lagsanetta and a bottle of white.\n\n", "Lobster ravioli - A little disappointing. ", "The ravioli was alright. "], "author": "Wendy P.", "review": "Family-owned business that has definitely seen its better years. Decor is little old and dated, nevertheless, still charming.\n\nOrdered the bruschetta, lobster ravioli, lagsanetta and a bottle of white.\n\nBread - Served warmed and looked home made. \n\nBruschetta - Huge chunks of tomato, drizzled with balsamic vinegarette on top of nicely toasted bread. \n\nLobster ravioli - A little disappointing. The ravioli was alright. It would have been better if the sauce does not look exactly the same as the lagsanetta he got.\n\nLagsanetta - Interesting presentation, but the color and texture of the sauce kinda ruined it.\n\nAll in all, the price is not exorbitant, but the food is just A-OK. Hence, 3 stars.", "rating": 3, "date": "2013-07-08"}, {"excerpts": ["AMAZING lobster ravioli. ", "I ordered an Americano there ", "and it was the best ", "Americano I've had in a while. ", "I would definitely come back."], "author": "Summer L.", "review": "AMAZING lobster ravioli. I ordered an Americano there and it was the best Americano I've had in a while. I would definitely come back.", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["Try the Lobster Ravioli and Veal.  ", "The Tiramisu is a must.  ", "Enjoy :)"], "author": "Grace O.", "review": "SF GEM! I've drove past this joint for years and finally tried it about 2 months ago.  I've been back several times since and will continue to come back for the authentic Italian cuisine.  Try the Lobster Ravioli and Veal.  The Tiramisu is a must.  Enjoy :)", "rating": 5, "date": "2013-12-02"}, {"excerpts": ["Literally, as I was shovelling the Chef's Special Lobster Ravioli with Aurora sauce on to my palette, I kept exclaiming \"This is insane!\"  ", "If there is a place like this in SoCal, I would go every week.\n", "THANK YOU IL BORGO for an unforgettable dinner.  ", "Your fare and your service is impeccable!"], "author": "Amber P.", "review": "INSANELY DELICIOUS!\nAfter a mini road trip, we decided to have a proper dinner at a random place.  We pulled over, found parking in the city, walked five blocks, pointed, and found ourselves here at Il Borgo.  I would rate the bread and the Prosciutto 3 stars, but everything else is 5 stars (meal, wine, dessert, service).  Literally, as I was shovelling the Chef's Special Lobster Ravioli with Aurora sauce on to my palette, I kept exclaiming \"This is insane!\"  If there is a place like this in SoCal, I would go every week.\nTHANK YOU IL BORGO for an unforgettable dinner.  Your fare and your service is impeccable!", "rating": 5, "date": "2011-06-03"}, {"excerpts": ["My girlfriend and I went for a late dinner, shared the caprese salad and the lobster ravioli.\n\n", "The lobster ravioli was nothing to rave about either, presentation dull, not anything special.  \n\n"], "author": "Alicia T.", "review": "Il Borgo... Il is right!  \n\nMy girlfriend and I went for a late dinner, shared the caprese salad and the lobster ravioli.\n\nCaprese salad was horrible, I could have went to safeway, cut up tomatoes and mozzarella myself and it would've tasted better.  The cheese was sliced so thick, had no flavor, and the weirdest texture ever.  The tomatoes tasted unripe.\n\nThe lobster ravioli was nothing to rave about either, presentation dull, not anything special.  \n\nIt's a nice atmosphere, great staff, but the food just isn't that great.  I wish it had been better.", "rating": 2, "date": "2011-07-02"}, {"excerpts": ["I have to drop back one star on the lobster ravioli.  ", "The Aurora sauce (tomato-cream combo) didn't do a lot for me, and although the ravioli were cooked al dente, I could *swear", "* ", "I've bought these particular ones at Costco before.  "], "author": "Theresa B.", "review": "Although parking is horrendous in this part of the city, I can still safely say that'll I'll return to Il Borgo without a moment's hesitation.  \n\nTheir table bread is rustic, wholesome goodness.  It wasn't served warm, but it was fresh and good with a flavorful olive oil already waiting on the table.\n\nI can give 5 stars to the gorgonzola pizza, without reservation, and warn you ahead of time that if you order this as an appetizer (to share with one other person), you'll be too stuffed to enjoy your full dinner.\n\nI have to drop back one star on the lobster ravioli.  The Aurora sauce (tomato-cream combo) didn't do a lot for me, and although the ravioli were cooked al dente, I could *swear* I've bought these particular ones at Costco before.  Could be wrong, but they looked and tasted familiar.\n\nNote to folks who keep kosher, their food is laced with prosciutto, so be careful what you order -- that said everything I saw come out of the kitchen looked interesting and delicious. I also always find it amusing when the patrons don't hesitate to ask each other what they ordered or share tasting notes in a more convivial fellowship.\n\nFinal five star marks go to the lovely Italian hostess/waitress, and the warm, intimate decor.   \n\nOne last note (I should start labeling them p.s.s. or p.p.s.) - order the bottle.  The wine pours are not what I'd call overly generous for the price.\n\nAnd the final, final, final note, I regret that I didn't have room for the desserts.  I pledge a swift return and full report!", "rating": 4, "date": "2010-06-11"}, {"excerpts": ["Pizzettas are great, as is the Lobster ravioli, artichoke ravioli, penne e fungi and I just tried a chicken special: ", "breast rolled with mozzarella and ham in a mushroom sauce.  \n", "Also best tiramisu I've ever had.\n", "These types of places are going extinct, go there already."], "author": "Ian S.", "review": "Waaaa!  They won't take my credit card!  Businesses are now responsible for the fact that you no longer use paper money?\nThis place is great.  Cozy atmosphere, hospitable host and great food.  This is my wife's favorite place, so I've eaten there a lot.  Pizzettas are great, as is the Lobster ravioli, artichoke ravioli, penne e fungi and I just tried a chicken special: breast rolled with mozzarella and ham in a mushroom sauce.  \nAlso best tiramisu I've ever had.\nThese types of places are going extinct, go there already.", "rating": 5, "date": "2011-02-22"}, {"excerpts": ["Have had the lasagnetta and lobster ravioli on different occasions, and both were very good.  ", "The Il Borgo salad is absolutely delicious, made of fresh radicchio, the perfect amount of italian dressing, and crumbles of blue cheese.  "], "author": "Dave N.", "review": "I love Italian food.  I love Il Borgo.\n\nHave had the lasagnetta and lobster ravioli on different occasions, and both were very good.  The Il Borgo salad is absolutely delicious, made of fresh radicchio, the perfect amount of italian dressing, and crumbles of blue cheese.  They also pour a generous glass of house chianti.\n\nMy dining partner had the chicken stuffed with prosciutto and cheese, with perfectly seasoned side potatoes in a savory reduction sauce and steamed broccoli.  She said it was a bit on the salty side... I tried some of it and thought it was delicious.\n\nThe interior decor of the dining area is very charming and romantic, being lit mainly by beeswax candles.  It's a bit dark and subdued, but very relaxing.  I believe the proprietor waited on us herself, and she was very gracious and inviting.  \n\nOne important thing to note is that they accept CASH ONLY..  There is an ATM located inside the restaurant at least.  The guy next to us was a bit outraged to find this out after he and his wife finished their meal, but don't let that minor inconvenience stop you from trying some great Italian food at fair prices.", "rating": 5, "date": "2012-02-20"}, {"excerpts": ["For my main course, I had the lobster ravioli.  ", "Great choice- filling yet not too heavy.  "], "author": "Sarah F.", "review": "Super cute Italian joint, really great date spot.  It's pretty small inside, which adds to the charm of the restaurant.  \n\nBut goodness, it was so hot inside.  We started with a pizza that was divided into 3 toppings:  1/2 of the pizza had procuitto, 1/4 had artichoke, and 1/4 had mushrooms.  Very thin, hot, and a great way to start a meal if you're hungry.  \n\nFor my main course, I had the lobster ravioli.  Great choice- filling yet not too heavy.  The lobster was seasoned nicely inside the pasta.\n\nOne great thing about Il Borgo- no corkage fee!  So BYOB!", "rating": 4, "date": "2009-03-10"}, {"excerpts": ["The Lobster Ravioli is one of my favorite dishes! ", "The Insalate del Borgo is also a great starter to share."], "author": "Julie T.", "review": "This is hands down the best Italian restaurant in the neighborhood! The decor is cosy and the place has a very laid back feeling. Prices are fair plus you get a large basket of delicious bread at the beginning of your meal. The Lobster Ravioli is one of my favorite dishes! The Insalate del Borgo is also a great starter to share.", "rating": 5, "date": "2013-05-25"}, {"excerpts": ["Favorites are the massive meaty (or meatless, if you like) cheesy lasagnetta, the lobster ravioli, the artichoke ravioli, any of their wood-fired pizzas, their homemade bread served with every meal, and the Il Borgo salad. ", "Formaggio? ", "Buon appetito! "], "author": "Bridget J.", "review": "The first thing that struck me when I first went to this place is that there's a  charming pretend line of laundry strung from the ceiling at the back, reminding you that you're not just at an Italian restaurant, you're at home when you're at this Italian restaurant. Everything else about this experience concurs. \n\nIl Borgo is much better than what you can get in North Beach. A family from Northern Italy makes all of the pasta and sauces fresh daily. There are many choices. Gorgonzola, marinara, pesto, alfredo, and on. Their best is the Aurora sauce--tomato with a touch of cream. Favorites are the massive meaty (or meatless, if you like) cheesy lasagnetta, the lobster ravioli, the artichoke ravioli, any of their wood-fired pizzas, their homemade bread served with every meal, and the Il Borgo salad. Formaggio? Buon appetito! Prego! \n\nOh, and the tiramisu! Ohhhhhhh.\n\nSergio and his son are the chefs, and Mitra, the mother, manages the house and serves meals on weeknights. They're oh so friendly and genuine. They haven't taken down our Christmas postcard for four years. \n\nCash only--ATM at the back. Come hungry or ask for a to-go box. The portions are large, and like the good mother she is, Mitra won't let you leave anything on your plate.", "rating": 5, "date": "2009-02-21"}, {"excerpts": ["I ordered the lobster ravioli and my husband got the lasagnetta. ", "Both were fantastic. ", "My husband said the lasagnetta was the best lasagna he had ever had and would go back everyday if it was up to him. ", "It appeared to be lasagna rolled up and then sliced with lots of cheeses inside and out. ", "We had two cappuccinos for dessert. ", "They had homemade tarimessou that looked amazing ", "but I passed because I was so full. "], "author": "Caroline F.", "review": "I made reservations for my husband and I for dinner on Friday night at 6:30 just an hour or so before the time. We walked in and we ere seated right away in a cozy little table for 2. We had waters within minutes, bread shortly after, and ordered our food in a timely manner. \n\nI ordered the lobster ravioli and my husband got the lasagnetta. Both were fantastic. My husband said the lasagnetta was the best lasagna he had ever had and would go back everyday if it was up to him. It appeared to be lasagna rolled up and then sliced with lots of cheeses inside and out. We had two cappuccinos for dessert. They had homemade tarimessou that looked amazing but I passed because I was so full. I had a glass of house Chianti too.  \n\n$50 bucks for the whole meal and ate in under an hour!", "rating": 5, "date": "2010-02-21"}, {"excerpts": ["Lobster Ravioli. ", "Spaghetti Bolognese. ", "Was not a fan of the overly fishy lobster ravioli (mush?) or the bolognese - think noodles and meat lacking any hint of a flavored tomato sauce. \n\n"], "author": "Jonny Bobby G.", "review": "I've seen this place for years while heading up Fell and I was surprised to see the high marks on Yelp. Could I really have missed this great of a place after all these years?\n\nThe restaurant is located on the outskirts of the nicer part of Hayes Valley and parking is typical for the 'hood. The interior is decorated in a standard cheesy italian grotto scheme which instantly made my scepticism alarm go off. Our party of 6 sat right in the middle of restaurant (as it should be for any birthday) and then off we went with ordering. Menu? Standard italian (american) dishes. \n\nOrdered? Margherita pizza appetizer. Lobster Ravioli. Spaghetti Bolognese. Penne E Funghi Salsiccie (mushroom and sausage). Grilled chicken entree. Forgot the rest. Overall, the food was decent and the penne dish was very good. Was not a fan of the overly fishy lobster ravioli (mush?) or the bolognese - think noodles and meat lacking any hint of a flavored tomato sauce. \n\nWhile food was sufficiently satisfying (portions and flavors) I was left disappointed overall because of the terrible service. Yes, every table was full. Yes, she was working alone. Not my problem... especially if I catch you swigging a glass of wine behind the counter doodling on paper.  It took her over 30 min. to just take our order (thank God we were all just chatting it up) and even longer to make refills, take additional orders or even get us a starter basket of bread. She also had the audacity to moderately complain about all are ordering asking us to consolidate our needs because she was the only one working. WTF!?! Oh, and its cash only and she does all the checks by hand. \n\nThe place has decent food but put it this way, after walking out of the restaurant and strolling down the block, I saw two other places I would have rather visited. At least it's something to check off the list.", "rating": 2, "date": "2009-08-07"}, {"excerpts": ["Lovely caprese, lobster ravioli and spaghetti carbonara.  ", "Easy in and out in less than an hour.\n", "We'll return."], "author": "Nancy L.", "review": "What a neighborhood gem - and an easy walk (in daylight) to Davies Symphony Hall.   Lovely caprese, lobster ravioli and spaghetti carbonara.  Easy in and out in less than an hour.\nWe'll return.", "rating": 4, "date": "2012-05-07"}, {"excerpts": ["I can't seem to get away from their Fettuccine del Borgo, although I have tasted dinner companion's lasagnetta, gnocchi pesto, and lobster ravioli and all were very good. ", "The salads are a bit boring (just lettuce and dressing) but not a bad start to the meal if that's what you're going for.  ", "(I prefer the antipasto. . ", "although I'm pretty sure I could live off of prosciutto and olives for quite some time.) ", "The tiramisu is HANDS DOWN the best I've ever had.  ", "Creamy, melt in your mouth, and (usually) free! "], "author": "Lauren K.", "review": "It may be the awesome yet affordable wine list, the cozy ambiance, the kick- ass home made pasta, or very possibly the complimentary champagne and tiramisu the owner often bestows upon us, but this is one of my favorite places to eat in the city.  I can't seem to get away from their Fettuccine del Borgo, although I have tasted dinner companion's lasagnetta, gnocchi pesto, and lobster ravioli and all were very good. The salads are a bit boring (just lettuce and dressing) but not a bad start to the meal if that's what you're going for.  (I prefer the antipasto. . although I'm pretty sure I could live off of prosciutto and olives for quite some time.) The tiramisu is HANDS DOWN the best I've ever had.  Creamy, melt in your mouth, and (usually) free! What more could a girl ask for? \n\nYes, it's cash only and that sucks. SUCKS! But they do have an ATM inside just in case you forget. Make a reservation, swing by Wamu, and gorge yourself on some of the best Italian food in the city.", "rating": 5, "date": "2009-01-31"}, {"excerpts": ["I had the lobster ravioli that was simply  delish. \n\n"], "author": "Sam T.", "review": "Very  yummy Italian that's not she-she, is low key and is a great overall value. The first time my girlfriend and I ate there I had the lobster ravioli that was simply  delish. \n\nI enjoyed another meal there again last night  and started off with the the inslata mista followed by the uccelli scappati (chicken). The salad dressing was great, very flavorful with lots of yummy raw garlic and the greens were fresh, a solid overall combination. The chicken was good but I found it to be a bit too salty, my gf found it to be a bit salty for her taste as well. \n\nI would have rated the restaurant five stars but the overly salty chicken took it down a notch. The service is stellar, not too overbearing but very attentive and fun to talk with. I'll definitely be back.\n\nBTW my gf is an Italofile, lived in Italy and knows her Italian food! She likes Il Borgo as much as me.", "rating": 4, "date": "2007-05-02"}, {"excerpts": ["Our second dish was the lobster ravioli which came out moderately cold and just as bad....absolutely plain.  ", "What they lack in quality, they try to make up for in volume....", "20 big bright orange plain pasta cubes isn't better than 6 good hot ravioli.  ", "The bread was the best part of the meal, and I give it a 5 out of 10.  "], "author": "Frank S.", "review": "Il borgo..more like il crappo... what a RIP OFF! I would like this place to be gone and replaced by a used car dealership.  Summary:  The food is plain and really heavy on the carbs, the service is annoying... It is a sit down dinner restaurant that DOESN'T TAKE CARD!!!!    They have an atm that charges a fee in the restaurant.  This is a petty trick you encounter in pizza parlors, not something  for atmospheric urban dinner restaurants. \n\nThe food is really awful.  We ordered the eggplant fussili, and got a ridiculous amount of pasta that totally ruined the continuity of the sauce...making what would have been a plain dish HUGE and BAD.  Our second dish was the lobster ravioli which came out moderately cold and just as bad....absolutely plain.  What they lack in quality, they try to make up for in volume....20 big bright orange plain pasta cubes isn't better than 6 good hot ravioli.  The bread was the best part of the meal, and I give it a 5 out of 10.  A glass of average pinot rings in at almost $7(the price isnt even listed on the menu) \n\nThe place seems inexpensive, but our ticket for 2 came in at $40 after tip and tax...I could have gotten a MUCH better meal for that price, and had dessert, too.  Also, the waiter really pissed me off.\n\nBottom line--don't go here, the atmosphere belies the food, which SUCKS.  I feel really ripped off and somewhat deceived right now, and I might just cry.  8-(", "rating": 1, "date": "2008-06-27"}, {"excerpts": ["I had Lobster ravioli. ", "They were delicious and perfectly al dente (\"to the bite,\" as Giada would say!)  ", "The bread and olive oil / balsamic was also lovely.  ", "The house Chianti made me perfectly buzzy and fuzzy wuzzy too. ", "Warm, full of food, and fuzzy wuzzy, I went off to sing in my chorus.  "], "author": "Aaron W.", "review": "One of the highlights of my week was dinner at Il Borgo tonight.\n\nThe waitress couldn't have been kinder or had better timing.\n\nThe interior is charming and very cozy for this frosty weather.\n\nI had Lobster ravioli. They were delicious and perfectly al dente (\"to the bite,\" as Giada would say!)  The bread and olive oil / balsamic was also lovely.  The house Chianti made me perfectly buzzy and fuzzy wuzzy too. Warm, full of food, and fuzzy wuzzy, I went off to sing in my chorus.  I'll try to stop by again when I have time before rehearsal.\n\nI will say it wasn't a cheap place, so be careful. They also only take cash.  But that did not stop the place from being fully crowded (but still cozy and peaceful) by the time I was finished dining!\n\nThank you for making my week, Il Borgo!  BACI !!!", "rating": 5, "date": "2006-11-29"}, {"excerpts": ["Lobster Ravioli.\n", "The sauce is so good, especially with the bread. ", "Our plate was so clean that it looked like someone licked it clean. ", "The ravioli are great, but the whole dish is a little too straight forward (nothing else besides ravioli and sauce). ", "But it's what you get and what you expect in home cooking. "], "author": "Yuchi C.", "review": "I finally found it!!!!!!!\nI've been hoping to find an italian restaurant that makes me feel at home. Here it is. Random corner in the Hayes Valley, a place that I've known to be there for a while but never set my foot in there. But I'm SO GLAD that I went and I will be going back very often.\n\nThe decor was very cute, casual, but nice enough that we all thought would be a great 1st date spot. Just like the location, things here are just random, the random street lamp standing there right in front of you once you step in, random but artsy candles with melted wax, GORGEOUS italian lady (waitress? wife of the owner?). \n\nFood. Yes. Yes. \nHands down Best dish: Fettucine del Borgo, with sundried tomatoes, capers, and tomate sauce. Very simple, but sooooo delicious, with generous portion. The homemade Fettucine is just perfect in texture, not too soggy, not too tough, just the right right amount of chewiness that you just can't stop eating it. Sundried tomato adds the proper greasiness but finely balanced out by the sourness of capers. Such a great dish for only $13.\n\nHighly recommended by people: Lobster Ravioli.\nThe sauce is so good, especially with the bread. Our plate was so clean that it looked like someone licked it clean. The ravioli are great, but the whole dish is a little too straight forward (nothing else besides ravioli and sauce). But it's what you get and what you expect in home cooking. So I still think it's great.\n\nBruschetta was fresh, with very crunchy toasted bread. But I could make better Bruschestta.\n\nLast but not least, the Tiramisu'. If you don't the Tiramisu' here after your meal, you are missing out, your experience would not be complete. The Tiramisu' is SOOOOO GOOOOOOOD!!!!! It is indeed the only one I've tried in US that I've felt: wow!! it's better than the ones I made!! Get it, period.\n\nTo the lady who works there: I wish I could be as gorgeous as you are at your age.", "rating": 5, "date": "2008-03-10"}, {"excerpts": ["Try the lobster ravioli too! ", ":)"], "author": "Leyna T.", "review": "Cute environment! The lassagnetta was absolutely delicious!! Try the lobster ravioli too! :)", "rating": 4, "date": "2011-09-27"}, {"excerpts": ["tried the lobster ravioli - delicious! \n", "the pasta is all made daily  ", ":)\n", "and i have to say the tiramisu (my favorite dessert) FABULOUS!"], "author": "Miharu Y.", "review": "tried the lobster ravioli - delicious! \nthe pasta is all made daily  :)\nand i have to say the tiramisu (my favorite dessert) FABULOUS!", "rating": 5, "date": "2011-02-22"}, {"excerpts": ["I came here with my fraternity brothers for dinner, the service was impeccable, the lobster ravioli was divine, the atmosphere is perfect to chat it up with the bros or a date."], "author": "Calvin T.", "review": "I came here with my fraternity brothers for dinner, the service was impeccable, the lobster ravioli was divine, the atmosphere is perfect to chat it up with the bros or a date.", "rating": 4, "date": "2011-01-15"}, {"excerpts": [", I ordered the lobster ravioli and it melted in my mouth.  ", "Delicioso!!!  "], "author": "Benjamin B.", "review": "I really like the ambiance of this place.\n\nLike little Italy.  I like the hanging laundry, and awnings, and street lights on the inside.  I feel this adds a nice touch to the place.  Rather than just a boring old restaurant like many others.\n\nThe food is scrumptious.  There were six of us that went the other day, and half the group ordered the lasagna, which is something they say is one of their signature dishes.\n\nI had a bit of it and I agree - however, I ordered the lobster ravioli and it melted in my mouth.  Delicioso!!!  Molto Bene!\n\nWe will go back!", "rating": 3, "date": "2008-01-19"}, {"excerpts": ["The special lobster ravioli has me swooning for more. ", "And the handmade gnocchi pillows are a savory melt in the mouth. ", "Nothing fancy schmancy but just great Italian meals, even if I have to comfortably eat alone in peace and quiet without any tourists (woohoo!). ", "Everytime ", "I go, there is this tall Italian waitress who is so sweet. "], "author": "Cathy H.", "review": "Been going to this intimate and warm Italian neighborhood joint for the past year. I like to wander through neighborhoods and discover gems. I rarely remember names of places. So I always knew this place as the Italian restaurant that takes cash but has an indoor ATM, on the corner of Fell and that other street that Suppen Kuche is on. \n\nThis is where Yelp comes in and helps me search for an \"Italian restaurant\" near \"Hayes Valley, San Francisco, CA\" on the semi-decent search. Il Borgo pops up first. Of course Arlequin wine merchant pops up second, followed by Zoya, and then Blue Bottle Coffee Co., which are not even remotely Italian. * Clueless * Shrug. I like how Stelline isn't amongst the top 3, which serves pasta, but it is not Italian IMHO.\n\nIl Borgo serves true Italian restaurant fare. Each ingredient and handmade pasta is crafted with love. The special lobster ravioli has me swooning for more. And the handmade gnocchi pillows are a savory melt in the mouth. Nothing fancy schmancy but just great Italian meals, even if I have to comfortably eat alone in peace and quiet without any tourists (woohoo!). Everytime I go, there is this tall Italian waitress who is so sweet. She ensures that I am comfortable and my water cup is filled with no ice. \n\nEverytime I go, I find my eyes fixated on the classic 1800s indoor lamp post by the door. Then I glance over to the clothing line, that is suppose to help with the decor and ambiance, but it has turned into a lost and found for scarves. Cute.", "rating": 4, "date": "2007-10-10"}, {"excerpts": ["I had the lasagnetta, which was incredible -- the prosciutto was so flavorful... BF had the lobster ravioli -- also really quite tasty, with a tangy and bright seafood taste... \n", "Add in some candlelight, some red wine, and sparkling conversation, you've got the makings of a perfect date night.\n", "Definitely coming back for more of the same."], "author": "Fred L.", "review": "Charming place. The BF and I decided to stray from our usual saturday night comfort food stops, and I had long wondered about the charming-looking Il Borgo on the corner. We called ahead, were told there were tables available, and whisked there in a cab. \nThe carpaccio was succulent, the salad was crisp and fresh, the bread texture-perfect. That was just the appetizer. I had the lasagnetta, which was incredible -- the prosciutto was so flavorful... BF had the lobster ravioli -- also really quite tasty, with a tangy and bright seafood taste... \nAdd in some candlelight, some red wine, and sparkling conversation, you've got the makings of a perfect date night.\nDefinitely coming back for more of the same.", "rating": 4, "date": "2007-04-17"}, {"excerpts": ["The lobster ravioli is delicious and there's no shortage of garlic in any of their dishes as I believe was pointed out by someone already.  "], "author": "Hebrew K.", "review": "I took my ex here once and she really liked it.  She was living at my place and we had been living entirely off of food from the Lower Haight and it's various restaurants.  \n\nWhile I see no harm in that, we both wanted Italian food and didn't want to drive (drunk) or take a cab (kind of broke) and so it was that we discovered Il Borgo.  \n\nThe food is home-style Italian.  My Nana's  is much better but she lives back east so this will have to do.  The lobster ravioli is delicious and there's no shortage of garlic in any of their dishes as I believe was pointed out by someone already.  To me, this is a positive thing.\n\nThat and cheese.  They will give you a lot.  Whenever I go back, I will take it from them gladly.\n\nOh, I don't pretend to be a wine aficionado (or tard, whatever) but I am something of a wino.  Suffice it to say, the lady and I enjoyed two bottles of cheap red from across the street, one at the table and one on the way up Fell to Filmore.  \n\nNothing's so impressive as a drunk woman gracefully climbing the streets of San Francisco in crazy high heels without spilling a drop.\n\nOne star deducted for the pricing, which though mostly reasonable, does seem sort of arbitrary.  The outside is beyond quaint, for those who might be put off by that sort of thing, but it's a nice effect when you walk in.  \n\nGood for a date or the beginning to a night out with your boo.  \n\nNot cheap.", "rating": 4, "date": "2008-03-02"}, {"excerpts": ["I ordered a pasta of sausage and mushrooms (which was a special, not on the regular menu), and my girlfriend had the lobster ravioli.  ", "I can honestly say that I haven't had pasta like that since I was last in Italy ", "(then again, I don't get to explore restaurants as much as I'd like).  ", "The penne was cooked perfectly, and the dish as a whole wasn't weighed down with any heavy sauce.  ", "What sauce there was consisted mostly of tomatoes and spices.  ", "The lobster ravioli was also good, though it didn't have the combination of flavors that made the pasta dish so great.  "], "author": "Sam H.", "review": "I went there on a Friday night at around 6:30.  Judging by the high reviews for this place, I figured that this place would be pretty full.  To my amazement, it was completely empty.  We stayed until about 7:30, but even then there were no more than 5 people in the restaurant.\n\nA pity, since the food was terrific.  I ordered a pasta of sausage and mushrooms (which was a special, not on the regular menu), and my girlfriend had the lobster ravioli.  I can honestly say that I haven't had pasta like that since I was last in Italy (then again, I don't get to explore restaurants as much as I'd like).  The penne was cooked perfectly, and the dish as a whole wasn't weighed down with any heavy sauce.  What sauce there was consisted mostly of tomatoes and spices.  The lobster ravioli was also good, though it didn't have the combination of flavors that made the pasta dish so great.  The sauce for the ravioli was a bit plain, but still good.\n\nFor dessert, we split a tiramisu, which was wonderful.  It was very light, and not cloyingly sweet like other tiramisu I've tasted.\n\nIf this place accepted credit cards, it might get 5 stars.  The prices are quite reasonable, the service was prompt, and most importantly, the food was delicious.", "rating": 4, "date": "2008-05-10"}, {"excerpts": ["I ordered the lobster ravioli while she ordered the artichoke ravioli. ", "Both were very delicious, even though I was jealous of the insane amount of garlic that came with her dish. ", "The ravioli looks handmade, which made it extra delicious for me. "], "author": "Alexis C.", "review": "After being in the jungles of Costa Rica for roughly three weeks, I wanted three things: 1. Find out who won the Home Run Derby, 2. Get my hands on an iPhone, and 3. Have some good italian food. I still need to find someone with an iPhone.\n\nMy girlfriend and I decided to try Il Borgo out, seeing that they would be open after the All Star Game ended. I had seen this place many times (especially when the Fell Street freeway exit used to dump you right in front), but never had gone in. Parking can be a pain, which is about usual for this neighborhood, but we found parking right across the street. The place was near empty when we arrived, so we sat immediately and looked over the menu.\n\nI ordered the lobster ravioli while she ordered the artichoke ravioli. Both were very delicious, even though I was jealous of the insane amount of garlic that came with her dish. The ravioli looks handmade, which made it extra delicious for me. We also ordered a bottle of wine and a caprese salad that came with an obscene amount of fresh ground pepper (which to me, is a good thing).\n\nThe waitress, who may or may not have been the owner, was very nice and was very good about recommending the wine. The food was quick, as in the second we were done with the caprese our ravioli arrived. When we were done we sat and finished our wine and it was nice. There was some drum and bass playing, which I found a little odd, but I didn't really notice it after a while.\n\nUnfortunately, they are a cash only business. Having to double-check at the door that you have enough cash is a little annoying, but I'd say the food is worth it. Not sure why they do this, though. Also, even though the website says they close at 11:30 Monday - Saturday, we left around 10:30ish and they were closing. So I'm not sure about the time thing.\n\nJust remember to bring cash, for real.", "rating": 4, "date": "2007-07-11"}, {"excerpts": ["lobster ravioli and \"lasagnette\" spring to mind. \n\n"], "author": "Dan M.", "review": "the food here is always very good, and tastes quite fresh. many dishes on the special menu seem to be unique, but of course are delicious. lobster ravioli and \"lasagnette\" spring to mind. \n\nI don't really know how much wine is supposed to cost in restaurants, so I can't say whether its priced well or not (most bottles were $25-35?)\n\nthere is one crazy dude who works there, and will come to your table and start yammering on about some nonsense, to the bewilderment of you and your friends, but other than that the service is generally good.", "rating": 4, "date": "2007-01-27"}, {"excerpts": ["I love the lobster ravioli in aurora sauce. ", "They have a wonderful selection of wines and the staff makes you feel like family from your first visit. ", "Lax atmosphere makes you feel like your eating in an Italian courtyard complete with laundry drying on the line and light posts. ", "They play great music here I love pavoratti and old Italian love songs... there's always candle light, atmosphere, smiling faces and leftovers to take home. ", "Makes you want to fall in love ", "if your not already!"], "author": "Charlie B.", "review": "A short walk from the casa and a great setting for dinner. Really choice traditional Italian dishes as well as some great new additions. I love the lobster ravioli in aurora sauce. They have a wonderful selection of wines and the staff makes you feel like family from your first visit. Lax atmosphere makes you feel like your eating in an Italian courtyard complete with laundry drying on the line and light posts. They play great music here I love pavoratti and old Italian love songs... there's always candle light, atmosphere, smiling faces and leftovers to take home. Makes you want to fall in love if your not already!", "rating": 4, "date": "2007-02-07"}, {"excerpts": ["My bf loved the lobster ravioli as well. ", "Nice wine list too.  ", "We had an amazing bottle of sicilian wine for about $30.  ", "Service was leisurely, but attentive."], "author": "Anna M.", "review": "I had a great meal here last night--the carpaccio was delicious and tender, and the gnocchi with bolognese sauce was sensational.  My bf loved the lobster ravioli as well. Nice wine list too.  We had an amazing bottle of sicilian wine for about $30.  Service was leisurely, but attentive.", "rating": 4, "date": "2007-02-17"}], "salmone alla griglia": [], "pollo parmigiana": [], "piccata di vitello": [], "vitello saltimbocca": [{"excerpts": ["My wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. "], "author": "Len S.", "review": "My wife & I had dinner with another couple on Saturday 9 April. This was our second visit to this small family run Italian restaurant. We had a 5:15PM reservation and the restaurant quickly filled in shortly after we arrived. This is obviously a popular local eatery.\n \nMy wife ordered the Penne E Funghi Salsiccie $13, our friends ordered the Ravioli $13.50 with a Mista salad $7 , and Vitello Saltimbocca $23 with a bowl of vegetable soup $4. I ordered the Funghi E Salsice Pizza $13. Everyone enjoyed their meals.\nMy pizza was very good with a cracker thin crust and plenty of mushrooms and tasty Italian sausage. Our friends finished their meal by sharing an order of Tiramisu. The serving size of all the meals, and dessert, were generous.\n \nA special mention about the soup - it does not appear on the menu, so you need to ask. My friend's vegetable soup looked delicious and I was a bit sorry I passed on the soup, but I knew I had a pizza in my near term future.\n \nThe service was quite good, especially considering the crowd in this small restaurant. \n \nGood Italian food at a good price, is reason enough to return to Il Borgo.", "rating": 4, "date": "2016-04-10"}, {"excerpts": ["Another notable dish was Vitello Saltimbocca ($18.75, Veal scaloppini in Marsala wine, sage, topped withprosciutto and mozzarella).  "], "author": "Kioko O.", "review": "Dined here prior to seeing SF Ballet \"Romeo & Juliet\".  This is a cozy, casual restaurant which seems to fill up quickly on Friday night, so a reservation is probably recommended.  \n\nLasagnetta was excellent and I'd definitely recommend it  ($12.75, Rolled lasagna filled with prosciutto and mozzarella).  Another notable dish was Vitello Saltimbocca ($18.75, Veal scaloppini in Marsala wine, sage, topped withprosciutto and mozzarella).  Also I liked Mista ($6, Romaine lettuce, radicchio, arugula with Italian house dressing & fresh herbs), which I thought was really fresh and yummy.\n\nDidn't get to the dessert section as we were quite full, but heard that Tiramisu is also home-made.  I'm definitely going to try it the next time.", "rating": 4, "date": "2010-05-09"}], "vitello al marsala": [], "agnello scotta dito": []}