{"polpette al sugo": [{"excerpts": ["Apps like the polpette al sugo (ground beef meatballs with napoletana tomato sauce), the saffron risotto and mozzarella-stuffed arancini, or the nduja-stuffed potato croquettes are all very solid and could form a tapas-like meal. \n\n"], "author": "Vincent L.", "review": "Rounding a 4.5-star review up to 5. This might not be the bestest, most spectacular Italian fare ever, but it's still really good. Best of all, in an increasingly expensive and inaccessible West Bay, prices are quite reasonable and the atmosphere and service quite welcoming and casual. \n\nAlthough the menu is fairly compact, sometimes simpler is better. Even then, the menu covers a good range of items, all of them satisfying and super delish. Apps like the polpette al sugo (ground beef meatballs with napoletana tomato sauce), the saffron risotto and mozzarella-stuffed arancini, or the nduja-stuffed potato croquettes are all very solid and could form a tapas-like meal. \n\nThe pizza, meanwhile, was slightly less superlative. It's thin crust all right, but unless you use a fork and knife, it'll fall apart if you try to grab it with your hands. Nevertheless, you can't go wrong with the diavola or the prosciutto, and you can see everything being made before your eyes in the open preparation area and brick oven. \n\nService is on point, and despite the compact nature of the space, there's a reasonable amount of seats for parties large and small. Thanks Yelpers for a great find that rises above all the tired, touristy old-school establishments in this area!", "rating": 5, "date": "2018-07-30"}, {"excerpts": ["We ordered the Polpette Al Sugo (ground beef meatballs with napoletan tomato sauce) appetizer, a Diavola pizza (tomato sauce, mozzarella, Italian salami and calabrian peppers on the side) and a calzone (tomato sauce, mozzarella, ham, mushroom, arugula, raspa dura cheese). \n\n", "The Polpette Al Sugo was an amazing start, very tasty. ", "The main courses were also fabulous. "], "author": "Mike B.", "review": "Did a little research and discovered there is a little italy area in San Francisco. After burning off calories exploring the area we decided to look for an Italian place to eat.  We turned to trusty Yelp. \n\nWe got here about 6:15pm on a Friday. As with most places in the city that we have seen it is not very large in size but they use the space well. There are probably seats for 40 to 50 people including the counter area around where they prepare the food.\n\nWe reviewed the menu and placed our orders. We ordered the Polpette Al Sugo (ground beef meatballs with napoletan tomato sauce) appetizer, a Diavola pizza (tomato sauce, mozzarella, Italian salami and calabrian peppers on the side) and a calzone (tomato sauce, mozzarella, ham, mushroom, arugula, raspa dura cheese). \n\nThe Polpette Al Sugo was an amazing start, very tasty. The main courses were also fabulous. The pizza had just a little bite.\n\nWithin 45 minutes of our arrival, there was a line outside.\n\nOverall a great experience. The only negative I can think of is that it was a little noisy inside.", "rating": 5, "date": "2017-08-25"}, {"excerpts": ["I highly recommend the Polpette al Sugo (meatballs with tangy tomato sauce); the Cavolfiori (Roasted cauliflower, capers, garlic, calabrian chili oil); and the Arancini (fried rice balls with melted cheese in the middle). "], "author": "Kevin B.", "review": "I have to admit, I was surprised to find such a great pizza joint in North Beach. If you're a Bay Area native, you know that this neighborhood (aka \"Little Italy\") is mostly home to cheesy tourist spots. But I'm happy to report that this Neapolitan pizzeria is legit.\n\nI had the Diavola pizza (tomato sauce, mozzarella, Italian salami, Calabrian peppers served on a thin, chewy crust). With each bite, my taste buds were shouting \"Mamma mia!\"\nIt's actually quite a large pizza for one person, especially if you have an appetizer or two beforehand. I'd recommend sharing your pie with a friend. I could only eat half of mine, and wound up doggy-bagging the rest for lunch the next day. Though truth be told, by the time I got home, I couldn't help but dive back in to the leftovers. Yes, the pizza is that good.\n\nIf pizza ain't your jam, Il Casaro has other tasty offerings. I highly recommend the Polpette al Sugo (meatballs with tangy tomato sauce); the Cavolfiori (Roasted cauliflower, capers, garlic, calabrian chili oil); and the Arancini (fried rice balls with melted cheese in the middle). Everything was de-lish!\n\nService was friendly and fast. Keep in mind, this place gets crowded and loud. I wouldn't necessarily recommend this spot for an intimate date. And if you go with a group of 4 or more people, you'll have to shout to hear one another.\n\nMy only gripe is that they don't take reservations. So if you come here, be prepared to wait. But believe me, this pizza is well worth it!", "rating": 4, "date": "2017-08-04"}, {"excerpts": ["The Polpette Al Sugo: ", "Ground Beef Meatballs, Napoleon Sugo ($7): ", "http://bit.ly/1IVSejR was by far the worst meatballs I've had. ", "They were hard, dense, and clearly overworked. ", "I've had better balls at Buca Di Beppo which is pretty sad. ", "Best meatballs ever can be found nearby at Tosca Café. ", "It's $4 for a tiny golf ball ", "sized meatball "], "author": "Cherylynn N.", "review": "There's nothing worse than a limp, flaccid...\n\nPizza.\n\nAm I right, ladies? And gentlemen. \n\nWhat did you think I was going to say? Pervs. \n\nI visit North Beach as much as I visit my dentist...which is never. Both are pain in the ass for different reasons. Tater Tot had a grooming appointment in North Beach so what better way to kill time than to knock off some of my North Beach bookmarks.\n\nI've had II Casaro bookmarked since they opened in early 2014 so I was super ecstatic to finally pay a visit especially with all the glowing reviews. However, after our visit, I was scratching my head as to where all these glowing reviews are coming from (mainly from tourists). I held off on writing my review in the event our experience was an off day. With some recent bad reviews, our experience is unlikely a fluke so here we go...\n\nSorry folks, this is another overrated North Beach restaurant for tourists. Their current 76/100 health score is a bit scary as well especially with an open kitchen. \n\nII Casaro's menu: Antipasti (fried cheese, meatballs, aracini), Mozzarella Bar, Salumi (prosciutto, spicy coppa, mortadella), Piatti (tagliatelle, spaghetti, lasagna, gnocchi), and Pizzas (12+ options). Prices are really reasonable for this touristy area with mains in the $14-$16 range. Reservations accepted. \n\nWe started with the Imported Burrata & Proscuitto San Daniele ($7.75, $8): http://bit.ly/1MKvxPt. The burrata was hands down the best I've had. It was deliciously milky and soft with a tinge of sea salt and pepper to make it pop. I could eat this all day with the accompanying flatbread. I'm totally lactose intolerant (and had no lactaid) which made for a fun ride home with my dining companion. *emoji with medical mask* The prosciutto was ehhh; very salty and very lean.\n\nIf you're looking for deliciously tender balls, look elsewhere. The Polpette Al Sugo: Ground Beef Meatballs, Napoleon Sugo ($7): http://bit.ly/1IVSejR was by far the worst meatballs I've had. They were hard, dense, and clearly overworked. I've had better balls at Buca Di Beppo which is pretty sad. Best meatballs ever can be found nearby at Tosca Café. It's $4 for a tiny golf ball sized meatball but they're life changing. \n\nThe biggest disappointment of the night was the pizza. We shared the Broccoli + Salsiccia: Scamorza Cheese, Broccoli Rabe, Italian Sausage ($16.50 + $4 egg): http://bit.ly/1DnpfU1. The pizza was amazing to look at with its alluring leopard spots but it seriously made me want to cry. As soon as I picked up a slice, all the toppings slid off to reveal a bottom crust drenched in liquid. Now, I know Neapolitan pizzas are supposed to be a little soggy in the center but the center was like a wet sponge. We had to tear off the center crust and just eat the outer crust. The sausage was flavorless and very dry (tasted like turkey sausage) while the broccoli rabe was very bitter. Not a good combo. Who doesn't love a little egg porn? Well, there was egg porn in all its glory but the egg white was still translucent and raw (when you cut it). The menu stated it was $3 for \"eggs\" but we were charged $4 for one egg. WTF. \n\nOur waitress was really nice which was redeeming and it wasn't crowded so we got our food rather quickly. For the hour we were there, the owner or manager (?) was sitting at one of the four top tables in front on his ipad and talking on his cellphone. This was rather unprofessional. \n\nWe went on a Saturday and reservations were not needed as it wasn't even busy. When we left during peak dinner time, it was less than 1/4th filled with tourists. Plenty of seating (high tops) for larger groups.\n\nSorry II Casaro, I just wasn't feeling you...even after several drinks at The Boardroom. Maybe, Mr. Viagra can help ya.", "rating": 3, "date": "2015-08-04"}, {"excerpts": ["Had the Diavola (mozzarella, tomato sauce, spicy salami), Polpette Al Sugo  ", "(meatballs, Napoletean Sugo) and a glass of Nero Davola, Feudi Zitari (red)... ", "Transported to Italy...!"], "author": "Michael M.", "review": "Oh my, this is great! Had the Diavola (mozzarella, tomato sauce, spicy salami), Polpette Al Sugo  (meatballs, Napoletean Sugo) and a glass of Nero Davola, Feudi Zitari (red)... Transported to Italy...!", "rating": 5, "date": "2015-04-23"}], "cavolfiori": [{"excerpts": ["I highly recommend the Polpette al Sugo (meatballs with tangy tomato sauce); the Cavolfiori (Roasted cauliflower, capers, garlic, calabrian chili oil); and the Arancini (fried rice balls with melted cheese in the middle). "], "author": "Kevin B.", "review": "I have to admit, I was surprised to find such a great pizza joint in North Beach. If you're a Bay Area native, you know that this neighborhood (aka \"Little Italy\") is mostly home to cheesy tourist spots. But I'm happy to report that this Neapolitan pizzeria is legit.\n\nI had the Diavola pizza (tomato sauce, mozzarella, Italian salami, Calabrian peppers served on a thin, chewy crust). With each bite, my taste buds were shouting \"Mamma mia!\"\nIt's actually quite a large pizza for one person, especially if you have an appetizer or two beforehand. I'd recommend sharing your pie with a friend. I could only eat half of mine, and wound up doggy-bagging the rest for lunch the next day. Though truth be told, by the time I got home, I couldn't help but dive back in to the leftovers. Yes, the pizza is that good.\n\nIf pizza ain't your jam, Il Casaro has other tasty offerings. I highly recommend the Polpette al Sugo (meatballs with tangy tomato sauce); the Cavolfiori (Roasted cauliflower, capers, garlic, calabrian chili oil); and the Arancini (fried rice balls with melted cheese in the middle). Everything was de-lish!\n\nService was friendly and fast. Keep in mind, this place gets crowded and loud. I wouldn't necessarily recommend this spot for an intimate date. And if you go with a group of 4 or more people, you'll have to shout to hear one another.\n\nMy only gripe is that they don't take reservations. So if you come here, be prepared to wait. But believe me, this pizza is well worth it!", "rating": 4, "date": "2017-08-04"}, {"excerpts": ["*Cavolfiori: roasted cauliflower, capers, garlic ($8)\n", "*"], "author": "Elena N.", "review": "After the Chinatown bar crawl, we needed food. We walked in on Friday, August 7th around 11pm for dinner. Our group of four didn't have reservations. Luckily we got seated right away.\n\nFood:\n*Cavolfiori: roasted cauliflower, capers, garlic ($8)\n*Asparagi: roasted asparagus, raspa dura cheese ($8)\n*Buffalo mozzarella: served with arugula cherry tomato, bread ($9)\n*Lasagna: lasagna with bolognese and bechamel sauce ($16)\n*Il casaro: mozzarella, grana padana, cremini mushroom, prosciutto crudo ($16.50)\n*Affogato ($5)\n\nThe cheese was delicious! I love buffalo mozzarella. I wish we had ordered the burrata as well, but I don't think we would have been able to finish it. Maybe an excuse to go back? The asparagus was roasted nicely. The pizza crust was soft with a nice chew and I loved the mushrooms. I'm not a big pasta or cauliflower person, but everyone seemed to enjoy those dishes. The affogato looked great, but I was too full to try it.\n\nDrinks:\n*Double espresso ($3)\n*Americano ($3)\n*Pitcher of beer ($20)\n\nWe of course washed everything down with a pitcher of beer. What better combination than pizza and beer? Their espresso did the trick as we were headed to another stop after this. I needed some caffeine!\n\nI loved Vicoletto when I went. Il Casaro was is a great, more casual version. Next time I have to get the burrata though! And of course, try more pizzas!", "rating": 4, "date": "2015-08-18"}, {"excerpts": ["Also tried the Cavolfiori which was decent but very oily, and could have used more capers to balance the dish. \n\n"], "author": "Andrea Z.", "review": "One of the worst pizza's I have ever eaten. Ordered the Capricosa which was a huge disappointment, the pizza arrive not just soggy but wet, could not lift a slice up without all the pizza toppings falling off, even the cheese slide off the crust. Also tried the Cavolfiori which was decent but very oily, and could have used more capers to balance the dish. \n\nService was lack luster, but given it was a busy Friday night can't really doc too many points for that. \n\nPerhaps we ordered the wrong dishes, but not sure I would spend the $ to try this place again.", "rating": 1, "date": "2016-06-19"}], "olive": [{"excerpts": ["The cheese with flat breads and salad was delicious, wanted to lick the place to get all of the olive oil from it.\n\n"], "author": "Carlos P.", "review": "Came here for lunch, the place was mostly packed around 1pm and we got seated right away. The place get a good breeze and shadow, so it stays cool. Service was very good from the beginning to the end.\n\nWe ordered one of their lasagnas, mozzarella cheeses, and a pizza. Everything came out very fast, and it was delicious. The Lasagna was really juicy and perfectly cooked. \n\nThe cheese with flat breads and salad was delicious, wanted to lick the place to get all of the olive oil from it.\n\nThe pizza was also very delicious and the servers taking care of us made sure we always had water and everything else we needed.", "rating": 4, "date": "2018-10-09"}, {"excerpts": ["A sprinkle of dried chili and a splash of extra virgin olive oil compliment the pizza very well.\n\n"], "author": "Majeed F.", "review": "A relatively small but airy pizzeria with a warm and friendly ambiance. I sat at the bar counter opposite the pizza oven and observed how the oven master at work, cooked 4 pizzas at 63-65 sec each (timed him!) which is remarkable, pizzas come out perfect every time! He thinks the oven temp is around 700F.\n\nMy pizza was puffy at the edge and the cheese is perfectly cooked in the middle.  The dough / base is  slightly stretchy and has a good bite.  A sprinkle of dried chili and a splash of extra virgin olive oil compliment the pizza very well.\n\nService was friendly and Alex in particular was funny and great!\n\nOne VERY good pizzeria in SF.  Pizza lovers make a note!", "rating": 5, "date": "2018-02-15"}, {"excerpts": ["Grabbed two pizza's :\n\nMargherita -Tomato sauce, fior di latte mozzarella, extra virgin olive oil, basil \n\nQuattro Formaggi Mozzarella, goat cheese, asiago, "], "author": "Rod M.", "review": "Saw the great reviews on this place and had to hop in here. Grabbed two pizza's :\n\nMargherita -Tomato sauce, fior di latte mozzarella, extra virgin olive oil, basil \n\nQuattro Formaggi Mozzarella, goat cheese, asiago, gorgonzola \n\nWe both agreed that we definitely like the Margherita more than the Quattro Formaggi. \n\nWhile we thought the pizza was solid we think there are better options in the City/Bay Area for thin crust pizza hence the 3 star rating.  The speed they make the pizza's is impressive as other's have noted when your pizza is \"up\". However, this place does get busy and when I was there at least there was only one person making pizza's so if there is a back log of pizza's to be made you will be waiting for a lil bit so don't expect your pizza's to come out super quick. \n\nVibe and interior was nice and the wait staff was cool.", "rating": 3, "date": "2018-04-20"}, {"excerpts": ["They added some olive oil and pepper to the arugula, which was perfect. ", "The bread was chewy and a good complement to the buratta. "], "author": "Nicole H.", "review": "Stopped by with my family on a Saturday afternoon and there wasn't too much of a wait! \n\nWe got a buratta and il casaro pizza.\n\nThe buratta came with an arugula salad with cherry tomatoes and some bread (seemingly made of the same flour as the pizza dough)-- could basically be a small meal in and of itself. The buratta was creamy and nice. They added some olive oil and pepper to the arugula, which was perfect. The bread was chewy and a good complement to the buratta. 3.75/5.\n\nThe il casaro pizza came with mushroom and proscuitto.  Filling enough for 3 (albeit smaller sized) people. The oven is smack dab in the middle of the restaurant and the open kitchen makes it entertaining to watch the cooks prepare the food right in front of you if you sit at the center bar!\n--\n\nIt's national pizza day so we came back! Chewy (but not hard to pull apart) crust, which felt more like a very delicious breadstick. Compared to other spots, the crust has a little more charred taste to it (not in a bad way though). Super thin crust. The broccoli and sausage pizza reminded me of the weird pizza combos we had at school. The cheese didn't stand out to me like it did at Little Star, but it was still good.", "rating": 4, "date": "2018-02-09"}, {"excerpts": ["My only critiques for both dishes - a touch of salt would have gone a long way on the calamari and an herb infused olive oil as an accoutrement for the pizza dough triangles - but maybe I'm being picky because other people were just slathering the burrata straight on the triangles. "], "author": "Rachel A.", "review": "We only had appetizers here but will be back for some kickass looking (and smelling) pizza, I'm sure! Il Casaro was part of our \"tour\" of little Italy in north beach so we decided to make this place our first stop, since it boasted being a mozzarella bar as well as a pizzeria. While I was disappointed to find out they only serve mozzarella and burrata but no special variations on either (served simply with arugula, tomatoes, and crusty pizza dough triangles), I was very happy with the quality of the burrata. It was delicious and I could have eaten 3 more servings, easily. We also got the roasted calamari and zucchini which was PERFECTLY cooked. \n\nMy only critiques for both dishes - a touch of salt would have gone a long way on the calamari and an herb infused olive oil as an accoutrement for the pizza dough triangles - but maybe I'm being picky because other people were just slathering the burrata straight on the triangles. I was just happy eating it straight off the plate, lol.\n\nThe place is small and packed - we got lucky that we were only two people and got seated at the pizza bar right away. We loved the show! I would probably refrain from bringing a large group, you'll be really cramped.", "rating": 4, "date": "2017-07-08"}, {"excerpts": ["The burrata was average, it was creamy and had a nice little drizzle of olive oil, and served with some pizza dough. ", "The calamari skewers are a must!! ", "The squid was charred beautifully and not over cooked, the veggie slices were a great addition. ", "The olives were smooth and creamy, and had a drizzle of spicy olive oil. ", "We had 2 types of pizza, margherita pizza was simple and delicious, we dipped it in the spicy olive oil that they have on all the tables. ", "The prosciutto pizza, looked good, but my boys weren't a fan of all the parmesan(personally I would've loved it, but I don't eat meat, so I didn't try it) ", "the restaurant had a great vibe, the service was great, and the food was delicious!! ", "Next time I am in San Francisco I will make a trip back."], "author": "brittany d.", "review": "Everything was so delicious!! We started with burrata, calamari skewers, and olives. The burrata was average, it was creamy and had a nice little drizzle of olive oil, and served with some pizza dough. The calamari skewers are a must!! The squid was charred beautifully and not over cooked, the veggie slices were a great addition. The olives were smooth and creamy, and had a drizzle of spicy olive oil. We had 2 types of pizza, margherita pizza was simple and delicious, we dipped it in the spicy olive oil that they have on all the tables. The prosciutto pizza, looked good, but my boys weren't a fan of all the parmesan(personally I would've loved it, but I don't eat meat, so I didn't try it) the restaurant had a great vibe, the service was great, and the food was delicious!! Next time I am in San Francisco I will make a trip back.", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["Love the rich and creamy texture of the cheese, drizzled with some olive oil, and paired with the peppery arugula salad and sweet tomatoes. ", "So simple but so satisfying. ", "We split a couple of pizzas including the Margherita and the Diavola. ", "Tony's up the street probably serves a better pie but the pizzas here are pretty legit too. ", "Nice char on the crusts and the pies hold up well to the toppings. "], "author": "Jon L.", "review": "Oh a mozzarella bar. I totally get it... that makes so much sense!\n\nThe fresh pulled burrata is divine. Love the rich and creamy texture of the cheese, drizzled with some olive oil, and paired with the peppery arugula salad and sweet tomatoes. So simple but so satisfying. We split a couple of pizzas including the Margherita and the Diavola. Tony's up the street probably serves a better pie but the pizzas here are pretty legit too. Nice char on the crusts and the pies hold up well to the toppings. The Diavola pie stood out a little more and I liked the savory balance between the mozzarella cheese, spicy salami, and tomato sauce.\n\nService is really friendly and charming - some might say borderline flirty but hey, when in an Italian restaurant. Il Casaro has a decidedly younger, contemporary, and more casual vibe than its older counterparts in North Beach which should endure it to locals and tourists alike.", "rating": 4, "date": "2016-07-06"}, {"excerpts": ["Ingredients: romaine heart lettuce, roasted pine nuts, olive oil, lemon. ", "Price: $9.5, which sounds crazy, but first, it's San Francisco and, second", "Unfortunately, beyond a little bunch of romaine heart lettuce leaves, roasted pine nuts, olive oil and lemon, there was grated cheese all over the plate! ", "Wonderful, I can't eat cheese. ", "So I send them back my plate ", "and I order calamari"], "author": "Valentina G.", "review": "Disclaimer: my husband and I are both Italian expats - we moved to the Bay Area 2 years ago.\n\nWe went to Casaro after hearing every Italian on our Italian expats' group on Facebook praising their pizza. I used to rarely eat pizza even when I was living in Italy, but my husband is a great lover. We went there after the movie theatre where I ate too many pop-corns so I arrived there without any hunger, therefore I decided to order a salad. Ingredients: romaine heart lettuce, roasted pine nuts, olive oil, lemon. Price: $9.5, which sounds crazy, but first, it's San Francisco and, second, maybe it was quite abundant. \n\nMy husband ordered a marinara + mushrooms. It was about 1.45pm.\n\nAfter a wait of about 40-45 minutes, our plates arrive! In the meantime, I got really hungry and there was no bread or breadsticks to bunch on as we usually have in Italian pizzerias. But that's ok. Unfortunately, beyond a little bunch of romaine heart lettuce leaves, roasted pine nuts, olive oil and lemon, there was grated cheese all over the plate! Wonderful, I can't eat cheese. So I send them back my plate and I order calamari, that cost only 50cents more of my previous choice and are way more nutrient and satisfying. \n\nPizza: nope. Slightly burnt at the bottom and in little dots on the perimeter, quite uncooked the rest, yielding a very soft and pillowy pizza, with zero crunchiness. It was also full of black olives - which have a strong flavor, so he removed 1/2 of them - and the mushrooms were simply cremini - in Italy, you almost never put cremini on a pizza. At the end, he said no. We won't return.", "rating": 2, "date": "2017-08-06"}, {"excerpts": ["The cheese was perfection, and the plates came with some bread, arugula & cherry tomatoes that were put together so simply with drizzled olive oil, but everything tasted incredibly fresh and delicious. ", "We also ordered a prosciutto pizza & lasagna with butternut squash - Definitely recommend."], "author": "Jackie S.", "review": "Had the burrata cheese and wild boar for an appetizer. The cheese was perfection, and the plates came with some bread, arugula & cherry tomatoes that were put together so simply with drizzled olive oil, but everything tasted incredibly fresh and delicious. We also ordered a prosciutto pizza & lasagna with butternut squash - Definitely recommend.", "rating": 5, "date": "2018-03-10"}, {"excerpts": ["We started off with some mortadella which was served with some crostini, arugula and roma tomatoes drizzled in olive oil. ", "It was excellent. ", "The mortadella along with the crostini and greenery were great. "], "author": "Chuck D.", "review": "Had dinner here on a rainy Sunday night as we were walking around North Beach looking for a place to eat. Il Casaro on Columbus Ave was among the restaurants that had later hours on a Sunday aside from the usual suspects that have sidewalk dining. We looked at the menu outside and decided to try it out. First impression aside from a semi-busy crowd for a late Sunday night is how warm the room is because of the wood fired pizza oven. It definitely warms up the room. But even on a cold night like that, it was still a little too warm for my liking. \n\nWe were seated at one of the high tables towards the back side of the space. Our server was attentive and friendly and knew when to leave us alone & when to ask us if we needed anything. We started off with some mortadella which was served with some crostini, arugula and roma tomatoes drizzled in olive oil. It was excellent. The mortadella along with the crostini and greenery were great. It had great flavor and was a perfect appetizer. \n\nThe pizza we ordered was the broccoli & salsiccia. It came with italian sausage, broccoli rabe and mozzarella cheese. The crust was good, the cheese was great, so was the italian sausage but the broccoli rabe was just too bitter to my liking. I dont think I would get that pizza again. They have several other choices that I would rather try out. \n\nIl Casaro was a nice option for a casual meal in North Beach. Street parking only. Open late. Good service. Decent food.", "rating": 4, "date": "2016-01-19"}, {"excerpts": ["The pasta was well-seasoned with too much of olive oil for my taste- ", "but I'm pretty sure a true Italian would pour some more olive oil on it!  ", "This place is a great destination for small to large casual gathering, very low key yet trendy."], "author": "Megan K.", "review": "By first glance at the menu, you know you are in the right place to have an authentic pizza.  Where else could you find buffalo mozzarella on the menu anyway?  My hubby had been to this place with his Italian friend and wanted me to try it.  On a casual stroll from Financial district towards Columbus Ave- this airy casual place was welcoming us.  We ordered a pizza and pulled pork pasta dish.  The pizza is Napolitano style- thin and crispy.  The dough, tomato paste and excellent cheese on our margarita pizza were simply a marriage of taste and simplicity.  The pasta was well-seasoned with too much of olive oil for my taste- but I'm pretty sure a true Italian would pour some more olive oil on it!  This place is a great destination for small to large casual gathering, very low key yet trendy.", "rating": 4, "date": "2016-05-30"}, {"excerpts": ["Enjoyed great lasagne, olive plate and delicious meatball appetizer. ", "Great wine and service to boot. ", "Will return."], "author": "Matthew C.", "review": "Enjoyed great lasagne, olive plate and delicious meatball appetizer. Great wine and service to boot. Will return.", "rating": 5, "date": "2018-03-17"}, {"excerpts": ["they fire these up in the oven with olive oil, capers and a few pepperoncini.  ", "Need you ask?  ", "Calamari and zucchini:  tender and juicy squid bites, threaded onto skewers with roasted vegetables, drizzled with olive oil and sprinkled with plenty of salt and pepper.  "], "author": "Sondra H.", "review": "Ate:\n\nNorma (margherita with eggplant).  Classic wood-fired, brick-oven pizza.\n\nGolden beat and frisee salad.  The dressing was lemony and very salty, but paired really well with the beats, goat cheese and walnuts.\n\nStandout:\n\nCalabrian pepperoncini.  Un-fucking-believably good.  These plump, little red hotties are served as an accompaniment in a little ramekin of oil.  I bit off the tip of my first, felt the heat... and then the flavor hit me.  Sweet, citrusy and warm.  By the end of my last bite of pizza, I'd finished all of them and was dipping the crust in the remaining oil.\n\nUpdate (had additional items):\n\nRoasted cauliflower:  they fire these up in the oven with olive oil, capers and a few pepperoncini.  Need you ask?  Of course they were... delicious!\n\nCalamari and zucchini:  tender and juicy squid bites, threaded onto skewers with roasted vegetables, drizzled with olive oil and sprinkled with plenty of salt and pepper.  Simplicity and perfection!\n\nPanna cotta:  wow, get it.", "rating": 5, "date": "2015-12-17"}, {"excerpts": ["The Insalata Romana is such a simple but tasty dish, with perfectly toasted pine nuts and the right balance of lemon, olive oil and pepper. ", "We shared a slice of the lasagna, which offered a delicious blend of tomatoes, spices and meat. ", "Our final main dish was the Calabrese pizza - very yummy, except the sausage was a little too spicy for me. ", "To cool my mouth, I ended the meal with their soft serve ice cream topped with caramel sauce. ", "I loved every bite. ", "I highly recommend this restaurant."], "author": "Melanie N.", "review": "The food here is DELICIOUS and the service is excellent. My husband and I stopped in for a late lunch on a Saturday, and Il Casaro was more than worth our time and money. The Insalata Romana is such a simple but tasty dish, with perfectly toasted pine nuts and the right balance of lemon, olive oil and pepper. We shared a slice of the lasagna, which offered a delicious blend of tomatoes, spices and meat. Our final main dish was the Calabrese pizza - very yummy, except the sausage was a little too spicy for me. To cool my mouth, I ended the meal with their soft serve ice cream topped with caramel sauce. I loved every bite. I highly recommend this restaurant.", "rating": 5, "date": "2017-08-19"}, {"excerpts": ["The bread strips served with this dish were magnificently charred, soft as silk, and drizzled with potent premium olive oil (no canola blend detected). "], "author": "Elliott D.", "review": "TL;DR:\n\nFor the love of tastebuds, have I not been transported to Napoli itself with these familiar flavors!? Yes, brethren & sisters, I've been to the Old Country and supped at its greatest pie houses. This is an experience not less glorious.\n\nTHE DEETS:\n\n***IMPORTED BURRATA\n\nThough many a burrata have I ravaged, I do declare that never until today have I experienced burrata as it was truly intended. This celestial dairy must have poured forth from the most holy of golden calves, hand-fed the hand-manicured artisanal grass of an immortal world. The milk & cream from this cow are superior to all before it, and the cheese-making methods employed here are esoteric & second to none. There is no toughness, only gooey joy. When you bite in, the fresh panna flows forth as a divine gift.\n\nThe bread strips served with this dish were magnificently charred, soft as silk, and drizzled with potent premium olive oil (no canola blend detected). With it was a simple arugula & grape tomato salad, which masterfully satisfied the need for complexity by offering bitter & sweet notes.\n\nI'd come back for this dish alone.\n\n***DIAVOLA PIZZA - Mozzarella, tomato sauce, spicy salami\n\nI've searched high & low for true Napoli pizza on this continent and have not once found crust so beautifully charred and yet perfectly supple. Surely a sign of doppio zero flour. It was so soft that you could roll it up and wipe your face with it. The sauce was infinitely light & as delicately fruity as can be, enabling you to eat slice after slice without being bogged down by the slightest shadow of heaviness. The fact that they stuck \"Mozzarella Bar\" as part of the establishment's name corroborates my experience--these were sinfully moist, meaty, & yet somehow light chunks of moo product. And yes, the crucial basil centerpiece was equally toasted & wilted as is the divine degree.\n\nThe soft red chillies & spicy salami was a lovely treat, providing just enough heat & flavor without overwhelming the batch. \n\n***PROSCIUTTO PIZZA - San Daniele prosciutto, arugula, tomato sauce, mozzarella cheese\n\nThe crust, sauce, & mozzarella were just as meticulous & present as the last pizza; in addition, this pie was topped with delicious prosciutto, arugula, & raspadura shavings. The prosciutto provided a luxuriously moist layer, while the arugula offered some pleasant bitter contrast. The raspadura, while extremely fresh and flavorful, was in my opinion slightly excessive due to the dry nature of the cheese and the copious amounts that had to be consumed to get to the pizza below. Still, if generosity was their fault, the quality of the ingredients made this more than forgivable.\n\n***PANNA COTTA with raspberry sauce\n\nI've had more panna cotta than I can recall, but the consistency of this product (as had become a theme throughout the meal with each additional dairy offering) was much more refined & dare-I-say velvetier that anything I'd previously encountered. It was truly a cream-filled delight, finished gracefully with fresh vanilla bean seeds & tangy raspberry purée.\n__\n\nJust remember, you're very welcome.", "rating": 5, "date": "2015-07-05"}, {"excerpts": ["We had the mussels, burrata salad, and olive cesaro pizza. ", "All were fantastic.  ", "We will definitely return."], "author": "Adrienne P.", "review": "This place is a neighborhood gem. The people were friendly. Food was amazing and the atmosphere great. We sat at the bar were we watched the dough being pulled, the Parmesan shaved and the prosciutto thinly sliced. \n\nWe had the mussels, burrata salad, and olive cesaro pizza. All were fantastic.  We will definitely return.", "rating": 5, "date": "2016-10-31"}, {"excerpts": ["The burrata is drizzled with olive oil so pure you can drink it. ", "If you've never tried burrata, it's like eating heavenly pillows of cheese that gently caresses your mouth. "], "author": "Jamie C.", "review": "This place is phenomenal. We seriously come here once a week. \n\nEverything is made to order and all the ingredients are top notch. \n\nWe always get the burrata with spicy coppa to start. It comes bread they made right in the brick oven. The burrata is drizzled with olive oil so pure you can drink it. If you've never tried burrata, it's like eating heavenly pillows of cheese that gently caresses your mouth. Must try.\n\nMy favorite favorite pizza here is the Prosciutto. They shave fresh parmesan on top and watching it melt slightly but still hold its structure is one of my favorite things to see in the world. I would frame it in an art installation if I could - if I didn't eat it first. Every bite is a perfect balance of meat and cheese and sauce and crust. \n\nMy second favorite is Capricciosa because the olives, artichoke, and mushroom add a lot of extra flavor but is so simple still.\n\nThe crust on their pizzas is so light that it doesn't over power any of the other ingredients. It's not too salty or oily or thick. And I love using the crust to mop up the extra sauce and oil. And because the oil they use is so good, you don't feel disgusting eating it.\n\nThe atmosphere of the restaurant is great, too. I like sitting at the bar so I can watch them make the pizzas. They also have three TVs that always have some sort of games on, which tones down any sort of pretentiousness the scratch made nature of the place might get.\n\nI'm only scared that this place will get too popular and I won't be able to get a seat right away on a Friday night.", "rating": 5, "date": "2014-10-21"}, {"excerpts": ["Served with Arugula, good olive oil, grape tomatoes sliced in half and pizza crust points.  ", "All gently seasoned with salt and pepper.  ", "So simple and so amazing.  ", "We also split a prosciutto pizza.  ", "The crust is so light and delicate.  ", "It was served with the fresh arugula, fresh shaved Parmesan and beautiful sections of prosciutto lay atop this pizza.  "], "author": "Nikki W.", "review": "So, found this place totally due to other Yelpers.  What a discovery.  Feels super authentic.  We sat at the bar because there was a line out the door.  With good reason.  We started with the Mozzarella bar.  3 varieties to choose from left us choosing the traditional and most used.  Served with Arugula, good olive oil, grape tomatoes sliced in half and pizza crust points.  All gently seasoned with salt and pepper.  So simple and so amazing.  We also split a prosciutto pizza.  The crust is so light and delicate.  It was served with the fresh arugula, fresh shaved Parmesan and beautiful sections of prosciutto lay atop this pizza.  (I may have called it food porn on my social media site...)\n\nGo now!  You won't be disappointed.", "rating": 5, "date": "2015-07-31"}, {"excerpts": ["The food was good, a little heavy on the Olive oil but nonetheless very delicious. ", "Me and my hubby will definitely be back to try something different next time. ", "The spaghetti and meatballs were awesome, and the pizza looked tasty! ", "Love the window seats and our server was nice as well. ", "The whole staff assisted in pre-bussing and refills. ", "The service was up to par with the food and atmosphere. ", "Bravo!"], "author": "Homa K.", "review": "We came across this place while looking for restaurants to have dinner in little Italy. It has a very modern look, with a rustic feel. The food was good, a little heavy on the Olive oil but nonetheless very delicious. Me and my hubby will definitely be back to try something different next time. The spaghetti and meatballs were awesome, and the pizza looked tasty! Love the window seats and our server was nice as well. The whole staff assisted in pre-bussing and refills. The service was up to par with the food and atmosphere. Bravo!", "rating": 4, "date": "2015-07-01"}, {"excerpts": ["I will dream about the perfect balance of olive oil, saltiness, and texture. ", "We almost returned the next day, but had other reservations! ", "We will definitely return!"], "author": "Lindsay Y.", "review": "We were so impressed by this little spot! The menu is small, but perfect! My husband and I shared the Norma pizza and Spaghetti Carbonara, delicious. The best part of our meal was the mozzarella appetizer! I will dream about the perfect balance of olive oil, saltiness, and texture. We almost returned the next day, but had other reservations! We will definitely return!", "rating": 5, "date": "2015-10-19"}, {"excerpts": ["It was soft in the middle from the sauce, cheese and olive oil but is to be expected in that type of pizza. ", "The staff was friendly and helpful with suggestions and it was entertaining to watch the tossing of the dough. ", "The pizza and a glass of wine came to $22 and worth it. ", "I suggest sitting at the bar and watching the food prep. ", "I will be back to try the calzone!"], "author": "Sue Ann F.", "review": "Looking for authentic Italian pizza? This is your place. The margherita pizza was delicious. Airy and crispy with a mild wood smokey flavor.  It was soft in the middle from the sauce, cheese and olive oil but is to be expected in that type of pizza. The staff was friendly and helpful with suggestions and it was entertaining to watch the tossing of the dough. The pizza and a glass of wine came to $22 and worth it. I suggest sitting at the bar and watching the food prep. I will be back to try the calzone!", "rating": 5, "date": "2015-08-11"}, {"excerpts": ["Perfect thin crust, small fresh mozzarella, limited basil and wonderful light Olive oil.   ", "Wonderful service, extremely clean atmosphere with a good low volume of trendy, positive music.  ", "A great place to share, or devour alone and walk out feeling wonderful."], "author": "Drew W.", "review": "This was amazing.  Perfect thin crust, small fresh mozzarella, limited basil and wonderful light Olive oil.   Wonderful service, extremely clean atmosphere with a good low volume of trendy, positive music.  A great place to share, or devour alone and walk out feeling wonderful.", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["The olive oil also great taste\n", "Price is OK .\n", "Good place to Chile and eat!"], "author": "Aviv H.", "review": "Very tasty \nI enjoy from the pizza!\nThe olive oil also great taste\nPrice is OK .\nGood place to Chile and eat!", "rating": 4, "date": "2015-08-21"}, {"excerpts": ["Creamy, smooth, with a touch of olive oil and salted to perfection leaving it ridiculously delicious... ", "Served with yummy freshly toasted bread, arugula, and cherry tomatoes that make the whole thing taste fresh and balanced.  "], "author": "Alicia K.", "review": "Went to this place after the Beach Blanket Babylon show and holy cannoli were we ever THRILLED!!!\n\nThe imported burrata -- $9.75 for one of THE MOST INCREDIBLE bites of food I have EVER experienced!  Creamy, smooth, with a touch of olive oil and salted to perfection leaving it ridiculously delicious... Served with yummy freshly toasted bread, arugula, and cherry tomatoes that make the whole thing taste fresh and balanced.  I am NOT kidding -- this is an item NOT to be missed!!!\n\nProsciutto pizza -- some of the best tasting prosciutto I have ever had the privilege of putting in my mouth, again with arugula and tomato for freshness, and mozzarella and parmesan cheeses worth coming back for. This one was a huge win.\n\nBufalina pizza -- their most popular pizza, with tomato, buffalo mozzarella, EVOO, and fresh basil. I'll be honest -- while tasty and clearly made with high quality, fresh ingredients, this one's pretty plain/standard tasting and I would definitely recommend going to the Prosciutto instead.\n\nGreat service. Casual, clean, modern feel (which happens to be my style so I was obviously a fan).  And the price is RIGHT!!! All the food above plus a bottle of Primativo left three of us just $85 in the hole -- a complete value in this fine city!", "rating": 5, "date": "2014-10-22"}, {"excerpts": ["It was served grilled with vegetables and delicious olive oil and tomatoes.  ", "The service was friendly and quick without making us feel rushed. ", "Good wine also."], "author": "Cheryl C.", "review": "So good! Pizza that took me back to what we had in Rome. The prosciutto pizza is fantastic. We also had a margherita pizza and a tuna pizza that were very good. The burrata mozzarella and grilled calamari were also nice. My one year old gobbled the squid! It was served grilled with vegetables and delicious olive oil and tomatoes.  The service was friendly and quick without making us feel rushed. Good wine also.", "rating": 5, "date": "2017-01-15"}, {"excerpts": ["although i typically  prefer my burrata a little glammed up (with honey and hazelnuts), i still think the burrata here is also some of the best i have had in SF (served with arugula, olive oil, pizza crust triangles)\n\n"], "author": "Olivia T.", "review": "partially scared to write such a glowing review of this place, because i love how i can pretty much always get a table in 15-20 mins max, even on a saturday night.  however, everyone must know about the best pizza in SF!!!  \n\nthis place crushes delfina, beretta, tonys and zero zero.  the crust has the most perfect texture - both light/fluffy, yet chewy at the same time.  and the san marzano tomato sauce is super fresh, bright and flavorful.   \n\nOMG the proscuitto pizza with san daniele prosciutto, arugula, tomato, mozzarella, raspa dura is probably my favorite.  i have also had he broccolini/salsiccia and the norma (fried eggplant), which are both delicious and perfect.  although i typically  prefer my burrata a little glammed up (with honey and hazelnuts), i still think the burrata here is also some of the best i have had in SF (served with arugula, olive oil, pizza crust triangles)\n\nI also like how they are very generous with the toppings, unlike delfina.  their wines are pretty good too!", "rating": 5, "date": "2014-08-23"}, {"excerpts": ["They've clearly been marinating in an absolutely fantastic olive oil with a single red pepper. "], "author": "Vincent B.", "review": "In short: this is the best pizza I've had in the States! Went here with a few friends, so we grabbed a few things to share.\n\nWe had: the plate of olives, fried asparagus, lardo, wild boar salami, burrata, and the margherita pizza.\n\nThe asapagus and burrata were good, but not as amazing as the other items (e.g. the burrata was creamy but not as creamy as other burratas).\n\n-The olives were absolutely to die for! They've clearly been marinating in an absolutely fantastic olive oil with a single red pepper. We were practically licking the oil up after finishing the olives.\n\n- The lardo was amazing! It melts in your mouth and is so fully of flavor.\n\n- The salami was wonderful but let's talk about the star! \n\nThe pizza! The best margherita I've had in such a long time. The ingredients are clearly high quality, the sauce was perfect. The mozzarella is beautifully creamy and flavorful. The crust was wonderful and most importantly...they cooked it beautifully. Just a bit of char on the bottom of the pie but not overdone.", "rating": 4, "date": "2014-05-30"}, {"excerpts": ["I thought about licking the olive oil off each plate- ", "it was so delicious. ", "We ordered several different pizzas, gnocchi, pasta de mare and some prosciutto, mozzarella and burrata. ", "All were amazing and served in generous portions. ", "Usually restaurants will give you like three or four slices of prosciutto, but this place does it right and heaps it on the plate. ", "We will definitely be back."], "author": "Jori M.", "review": "You. Must. Go. Here. We waltzed in with a party of 11 (7 of which were kids aged 3-11) around 530pm on a Tuesday and this restaurant handled it like a BOSS. No stink eye, no problem when we spilled a cup of lemonade, lots of extra forks/napkins on the table and so on. AND the food is amazing.  I thought about licking the olive oil off each plate- it was so delicious. We ordered several different pizzas, gnocchi, pasta de mare and some prosciutto, mozzarella and burrata. All were amazing and served in generous portions. Usually restaurants will give you like three or four slices of prosciutto, but this place does it right and heaps it on the plate. We will definitely be back.", "rating": 5, "date": "2015-07-15"}, {"excerpts": ["The barrata cheese was delicious and so was the olive oil drizzled on it. ", "This is where this restaurant gets another star. ", "The pizza was ok... ", "Just ok. ", "It was super soggy and lacked true authentic Italian flavors. ", "The owner/manager was cocky and full of himself. ", "Shaking his head in front of everyone when one of the runners dropped a glass. ", "When we finished our food, the owner stood and stared at us and had his employees rush us so we would pay. ", "He wanted to push our table together with available one next to us in order to accommodate a large party. ", "I get it and am not hating on them being busy, but have some respect for your customers. ", "Unfortunately, another small restaurant in SF, where someone thinks he knows how to run a place ", "but it just ends up being mediocre."], "author": "Sherri A.", "review": "Surprised this place has such a high rating! we ordered 2 draft beers and they came out warm. Ended up getting bottled Italian beer, which was pretty good so I gave 1 star for that. The barrata cheese was delicious and so was the olive oil drizzled on it. This is where this restaurant gets another star. The pizza was ok... Just ok. It was super soggy and lacked true authentic Italian flavors. The owner/manager was cocky and full of himself. Shaking his head in front of everyone when one of the runners dropped a glass. When we finished our food, the owner stood and stared at us and had his employees rush us so we would pay. He wanted to push our table together with available one next to us in order to accommodate a large party. I get it and am not hating on them being busy, but have some respect for your customers. Unfortunately, another small restaurant in SF, where someone thinks he knows how to run a place but it just ends up being mediocre.", "rating": 2, "date": "2016-05-20"}, {"excerpts": ["We had the burrata + calamari to start (both drenched in wonderful, nutty olive oil) and then ordered two pizzas: Buffalina and Norma. ", "I was experiencing an awesome buzz from the yummy white wine I ordered by the time the pizza came out ", "I was having a major hedonistic experience. ", "The pizzas were flavorful, pillowy, crusty, warm, savory, a little sweet at times..."], "author": "Penelope E.", "review": "SO. DELICIOUS. \n\nI was visiting friends that live in North Beach and they took me out to dinner here, raving about what a great spot it is. Let me tell you friend, everything was excellent: food, wine, ambiance, service.\n\nWe had the burrata + calamari to start (both drenched in wonderful, nutty olive oil) and then ordered two pizzas: Buffalina and Norma. I was experiencing an awesome buzz from the yummy white wine I ordered by the time the pizza came out I was having a major hedonistic experience. The pizzas were flavorful, pillowy, crusty, warm, savory, a little sweet at times...I remember it like it was yesterday.\n\nTo make things even better than they already were, our waiter/host brought out a Prosciutto pizza on the house because he thought it had taken too long to bring us the other two pizzas. The prosciutto was amazing! And the fact that he was so considerate took it to another level. It's hard to find such attentive service.\n\nWish I lived in SF, I would come here all the time!", "rating": 5, "date": "2015-02-19"}, {"excerpts": ["I had the Bufalina which is just tomato sauce, buffalo mozzarella, basil, and olive oil - plain and simple ", "but that's what makes it so good is that the natural flavors of all these ingredients stand out so well. ", "When it was served to me, I went straight for the middle which is how they do it in Italy because its supposed to be the soupy delicious part from all the sauce. ", "It passed the test. ", "I seriously think this place is nearly the same as what they serve in Naples and can't wait to go back.....probably tomorrow night. ", "Thanks ", "Il Casaro, you showed the world that you can bring Naples pizza outside of Naples."], "author": "Jeffrey B.", "review": "I've lived in North Beach for nearly 5 years and have relished in the artisan pizza of Tony's because no other Italian pizza in the area came remotely close...until Il Casaro. This place blew my mind and tastebuds away, hopefully they will come back. I just came back from Naples, Italy and literally had the best pizza in my life. It was a struggle coming back to the states knowing the same pizza would be difficult to find. But Il Casaro delivers - I had the Bufalina which is just tomato sauce, buffalo mozzarella, basil, and olive oil - plain and simple but that's what makes it so good is that the natural flavors of all these ingredients stand out so well. When it was served to me, I went straight for the middle which is how they do it in Italy because its supposed to be the soupy delicious part from all the sauce. It passed the test. I seriously think this place is nearly the same as what they serve in Naples and can't wait to go back.....probably tomorrow night. Thanks Il Casaro, you showed the world that you can bring Naples pizza outside of Naples.", "rating": 5, "date": "2015-08-13"}, {"excerpts": ["But what really makes it the best, at least for me, are the chillies in marinated in olive oil. ", "I wish they would sell those!! ", "Maybe they do...?"], "author": "Alexandra V.", "review": "Yes the pizza is AMAZING. Better than any other place in SF. But what really makes it the best, at least for me, are the chillies in marinated in olive oil. I wish they would sell those!! Maybe they do...?", "rating": 5, "date": "2014-10-29"}, {"excerpts": ["The dough is superb, and tastes good on it's own with just a tad bit of olive oil. ", "It's almost kind of like naan. ", "It's not hard like some other American joints', and serves as an excellent base for the fantastic ingredients they place on top. ", "It's very well-balanced, and allows allows it's ingredients to shine. ", "A lot of other pizza joints, particularly American pizza places, love piling on the toppings. ", "Sometimes that works and sometimes you may crave a pizza like that, but overall I feel like that style of pizza is overpowering and takes away from the fine balance that pizza should have. ", "Il Casaro does an amazing job of showcasing ", "it's excellent mozzarella, tomatoes, and basil on an even more excellent crust. ", "Also, I love the little spicy peppers they give you. ", "Adds a nice *kick* to the meal. ", "Pizza connoisseurs, please come and experience this gem in Little Italy!"], "author": "Andrew S.", "review": "The Margherita here is on point. The dough is superb, and tastes good on it's own with just a tad bit of olive oil. It's almost kind of like naan. It's not hard like some other American joints', and serves as an excellent base for the fantastic ingredients they place on top. It's very well-balanced, and allows allows it's ingredients to shine. A lot of other pizza joints, particularly American pizza places, love piling on the toppings. Sometimes that works and sometimes you may crave a pizza like that, but overall I feel like that style of pizza is overpowering and takes away from the fine balance that pizza should have. Il Casaro does an amazing job of showcasing it's excellent mozzarella, tomatoes, and basil on an even more excellent crust. Also, I love the little spicy peppers they give you. Adds a nice *kick* to the meal. Pizza connoisseurs, please come and experience this gem in Little Italy!", "rating": 5, "date": "2015-04-12"}], "spiedini di calamari": [{"excerpts": ["Spiedini di Calamari starter was so-so.   ", "Calamari bordered on rubbery, perhaps overcooked.  ", "Music was a little loud.  ", "Will return and try another appetizer."], "author": "Steve B.", "review": "Margherita pizza was as good as I've had in Rome, Milan and Naples.  Cheese, sauce, basil, dough: all top-notch.  My daughter loved her Il Casaro pizza.  Server was attentive without being overbearing.  Spiedini di Calamari starter was so-so.   Calamari bordered on rubbery, perhaps overcooked.  Music was a little loud.  Will return and try another appetizer.", "rating": 4, "date": "2017-05-06"}], "insalata": [{"excerpts": ["The Insalata Romana is such a simple but tasty dish, with perfectly toasted pine nuts and the right balance of lemon, olive oil and pepper. ", "We shared a slice of the lasagna, which offered a delicious blend of tomatoes, spices and meat. ", "Our final main dish was the Calabrese pizza - very yummy, except the sausage was a little too spicy for me. ", "To cool my mouth, I ended the meal with their soft serve ice cream topped with caramel sauce. ", "I loved every bite. ", "I highly recommend this restaurant."], "author": "Melanie N.", "review": "The food here is DELICIOUS and the service is excellent. My husband and I stopped in for a late lunch on a Saturday, and Il Casaro was more than worth our time and money. The Insalata Romana is such a simple but tasty dish, with perfectly toasted pine nuts and the right balance of lemon, olive oil and pepper. We shared a slice of the lasagna, which offered a delicious blend of tomatoes, spices and meat. Our final main dish was the Calabrese pizza - very yummy, except the sausage was a little too spicy for me. To cool my mouth, I ended the meal with their soft serve ice cream topped with caramel sauce. I loved every bite. I highly recommend this restaurant.", "rating": 5, "date": "2017-08-19"}, {"excerpts": ["With chicory, dandelion greens, and shaved fennel, the insalata ($9.50) is topped with raspa dura (young, full flavored Lodigiano cow'a milk cheese) and dressed with a red wine vinaigrette with fierce acidity. ", "The Napolitana pizza arrives with just the right amount of blistering on the crust. ", "Neither too crispy, nor too chewy, it is just right. ", "With mozzarella, tomato sauce, and spicy sausage, the diavola ($14.75) is pleasantly piquant. ", "The pizza arrived before the insalata, but otherwise everything else went smoothly. ", "The all Italian wine list is short, but contains ample red and white selections to pair with the cuisine.  "], "author": "CJ G.", "review": "In the old Steps of Rome space, Il Casaro (Italian for \"cheesemaker\") puts out some top notch thin crust pizza. \n\nWith polished concrete floors, the sparely adorned dining room is highlighted by a large marble-topped counter that surrounds a giant, red tiled Stefano Ferrara wood-fired pizza oven. \n\nThere is no mistaking that pizza is the star here. The menu is short and to the point: one salad, a couple of antipasti, and a selection of mozzarella are only a pretext for the main attraction, the pizza. \n\nWith chicory, dandelion greens, and shaved fennel, the insalata ($9.50) is topped with raspa dura (young, full flavored Lodigiano cow'a milk cheese) and dressed with a red wine vinaigrette with fierce acidity. The Napolitana pizza arrives with just the right amount of blistering on the crust. Neither too crispy, nor too chewy, it is just right. With mozzarella, tomato sauce, and spicy sausage, the diavola ($14.75) is pleasantly piquant. Piled high with San Daniete prosciutto, the aptly named prosciutto ($17) is a sight to behold. \n\nService is friendly and well-meaning, but a little slow and confused.  The pizza arrived before the insalata, but otherwise everything else went smoothly. The all Italian wine list is short, but contains ample red and white selections to pair with the cuisine.  With  falanghina, Fiano di Avellino, and Taurasi, to name just a few, there is something for everyone.\n\nPeter Fazio of Vicoletto and chef Francesco Covucci are doing good things at Il Casaro.", "rating": 5, "date": "2014-03-20"}], "butternut squash insalata": [], "asparagi": [{"excerpts": ["Asparagi: roasted asparagus, raspa dura cheese ($8)\n", "*Buffalo mozzarella: served with arugula cherry tomato, bread ($9)\n", "*", "Lasagna: lasagna with bolognese and bechamel sauce ($16)\n", "*", "Il casaro: mozzarella, grana padana, cremini mushroom, ", "prosciutto crudo ($16.50)\n"], "author": "Elena N.", "review": "After the Chinatown bar crawl, we needed food. We walked in on Friday, August 7th around 11pm for dinner. Our group of four didn't have reservations. Luckily we got seated right away.\n\nFood:\n*Cavolfiori: roasted cauliflower, capers, garlic ($8)\n*Asparagi: roasted asparagus, raspa dura cheese ($8)\n*Buffalo mozzarella: served with arugula cherry tomato, bread ($9)\n*Lasagna: lasagna with bolognese and bechamel sauce ($16)\n*Il casaro: mozzarella, grana padana, cremini mushroom, prosciutto crudo ($16.50)\n*Affogato ($5)\n\nThe cheese was delicious! I love buffalo mozzarella. I wish we had ordered the burrata as well, but I don't think we would have been able to finish it. Maybe an excuse to go back? The asparagus was roasted nicely. The pizza crust was soft with a nice chew and I loved the mushrooms. I'm not a big pasta or cauliflower person, but everyone seemed to enjoy those dishes. The affogato looked great, but I was too full to try it.\n\nDrinks:\n*Double espresso ($3)\n*Americano ($3)\n*Pitcher of beer ($20)\n\nWe of course washed everything down with a pitcher of beer. What better combination than pizza and beer? Their espresso did the trick as we were headed to another stop after this. I needed some caffeine!\n\nI loved Vicoletto when I went. Il Casaro was is a great, more casual version. Next time I have to get the burrata though! And of course, try more pizzas!", "rating": 4, "date": "2015-08-18"}, {"excerpts": ["What our party of five enjoyed: asparagi, spicy coppa, burrata, castelvetrano olives, spaghetti carbonara, diavola, al salmone and prosciutto pizzas, and for our dismount... tiramisu and affogato. "], "author": "Patrick K.", "review": "MOLTO BENE! I've traveled Italy several times and I always love finding the authentic taste this side of the pond. The hundreds of favorable Yelp reviews caught our eye and the food and service (Grazie, Tania) will bring us back. \n\nWhat our party of five enjoyed: asparagi, spicy coppa, burrata, castelvetrano olives, spaghetti carbonara, diavola, al salmone and prosciutto pizzas, and for our dismount... tiramisu and affogato. We all loved this place and can't wait to return!    \n\n~ Patrizio at ForTheLoveOfItaly.com", "rating": 5, "date": "2016-07-14"}, {"excerpts": ["We ordered Burrata & Asparagi to start + Margherita & Diavola pizzas. ", "Our starters were served in short time. "], "author": "John M.", "review": "I have this friend (who's also a brewing partner & fellow Yelp Elite) who is borderline obsessed with finding an outstanding, classic, traditionally-prepared pizza. He's from the Old World & he's had the good stuff from over there. I guess it makes sense that he'd want to find that here.\n\nWell, his search led us (along with his wife) to Il Casaro Pizzeria & Mozzarella Bar after a YEE in SF. Parking was typical SF, a total CharlieFoxtrot. But we eventually got lucky & squeezed into a street space a few blocks away. Walking in, the place was about 1/2 full & we got a table right away.\n\nService was sort of friendly & fairly attentive. We ordered Burrata & Asparagi to start + Margherita & Diavola pizzas. Our starters were served in short time. Both were excellent & seemed to be a good sign of things to come.\n\nOur pizzas, curiously, took a while. When they finally did make their appearance at our, they looked fine. But were just OK once we started chowing down on both. The general consensus around the table was that both pizzas were average, not the best, not the worst.\n\nAltogether, eating at Il Casaro Pizzeria & Mozzarella Bar was OK. As far as finding the New World's best Margherita pizza in the SF Bay Area, the search goes on. There's certainly no shortage of pizza joints around here, so my friend still has lots of choices to fuel his obsession.", "rating": 3, "date": "2014-09-20"}], "mozzarella in carrozza": [{"excerpts": ["Menu changed and I'm missing some of my favorites like mozzarella in carrozza. \n", "Last time I visited with family (party of 5 - all Italians, mind you!) for evening pizza. ", "Pizza was OK, but 2 pizzas came 5-6 minutes after the first 3. ", "Service was rushed and unfriendly. ", "Got seated at a table  next to the window on a cool evening and we had to keep jackets and hats on because they refused to close the window despite the super cold draft coming in. ", "If you have ventilation issues find other solutions other than making your customers uncomfortable. ", "Not sure I will go back anytime soon."], "author": "Emanuele O.", "review": "Trending down. Used to be one of the best (and affordable) pizzas in SF. Prices went up and quality down. Menu changed and I'm missing some of my favorites like mozzarella in carrozza. \nLast time I visited with family (party of 5 - all Italians, mind you!) for evening pizza. Pizza was OK, but 2 pizzas came 5-6 minutes after the first 3. Service was rushed and unfriendly. Got seated at a table  next to the window on a cool evening and we had to keep jackets and hats on because they refused to close the window despite the super cold draft coming in. If you have ventilation issues find other solutions other than making your customers uncomfortable. Not sure I will go back anytime soon.", "rating": 3, "date": "2018-07-25"}], "prosciutto san daniele": [{"excerpts": ["Serving pizza cooked in wood fired oven with delicious ingredients such as Prosciutto San Daniele and Mozzarella di Bufala, the prices are so reasonable.\n\n"], "author": "Sergio C.", "review": "If you are looking for the ITALIAN pizza (not American) then Il Casaro is your place. Located in the heart of little Italy I consider this pizza place the best in town (being italian I was looking for a great pizza and finally have found it here).\n\nServing pizza cooked in wood fired oven with delicious ingredients such as Prosciutto San Daniele and Mozzarella di Bufala, the prices are so reasonable.\n\nThe host is super nice and would entertain without being aggressive or noise (other italian restaurants in the area are famous for the opposite behavior) and let you enjoy your hot pizza once it comes (fast and precise service).\n\nNever given 5 stars to a restaurant but Il Casaro and his owner definetely deserves that!", "rating": 5, "date": "2015-01-19"}, {"excerpts": ["Had the $18.75 Prosciutto Pizza with delicious fresh prosciutto San Daniele, arugula and Parmigiano cheese. ", "Yum!"], "author": "Staci A.", "review": "Great fresh ingredients! Had the $18.75 Prosciutto Pizza with delicious fresh prosciutto San Daniele, arugula and Parmigiano cheese. Yum!", "rating": 5, "date": "2016-04-10"}], "spicy coppa": [{"excerpts": ["Ordered burrata, roasted cauliflower, and spicy coppa salumi apps, and the Calabrese and Brocolli and Salsicia pizzas.  ", "The Burrata was amazing, the roasted cauliflower perfectly spicy and balanced, and the coppa salumi was very tasty.  ", "The calabrese was a little heavy handed but very good, and the Brocolli/Salsicia wasn't amazing to be honest - dull flavors and slightly undercooked.  ", "loved the Calabria chili oil at the table!  ", "Great ambiance, very busy.  ", "Wait staff and hosts were impersonal and seemed most focused on turning tables quickly."], "author": "Ben K.", "review": "Ordered burrata, roasted cauliflower, and spicy coppa salumi apps, and the Calabrese and Brocolli and Salsicia pizzas.  The Burrata was amazing, the roasted cauliflower perfectly spicy and balanced, and the coppa salumi was very tasty.  The calabrese was a little heavy handed but very good, and the Brocolli/Salsicia wasn't amazing to be honest - dull flavors and slightly undercooked.  loved the Calabria chili oil at the table!  Great ambiance, very busy.  Wait staff and hosts were impersonal and seemed most focused on turning tables quickly.", "rating": 4, "date": "2018-10-30"}, {"excerpts": ["The Burrata with Spicy Coppa is my favorite starter that comes with bread, arugula, and tomatoes. ", "The Prosciutto and Diavola are my top 2 pizzas ", "and I would bathe in their spicy chili oil if I could. ", "Rad is the best waiter and he really takes care of his customers. ", "Well worth the wait on a Friday night and great for any occasion!"], "author": "Danielle K.", "review": "Found this spot on Yelp a little over a year ago and now I eat here at least 2 times a month. The Burrata with Spicy Coppa is my favorite starter that comes with bread, arugula, and tomatoes. The Prosciutto and Diavola are my top 2 pizzas and I would bathe in their spicy chili oil if I could. Rad is the best waiter and he really takes care of his customers. Well worth the wait on a Friday night and great for any occasion!", "rating": 5, "date": "2018-07-28"}, {"excerpts": ["We only had some appetizers: pizza bread, spicy coppa, fresh mozarella (served with arugula salad) and roasted cauliflower.\n", "The cauliflower was my favorite, perfectly cooked, tender, slightly brown, tossed in a delicious oily caper garlicky sauce. ", "Wood oven baked. ", "5 stars.\n", "The mozzarella was nice but definitely not the best I had. ", "\"", "OK\" I'd say. ", "Spicy coppa was good, I'm wondering where / which brand they import for.\n", "The pizza bread was excellent, I was able to \"build\" perfect bites with arugula cheese and coppa. "], "author": "Sylvain B.", "review": "Stopped there for a snack on a lazy Sunday afternoon (and also because Caffè Macaroni was closed...). Great find, great surprise!\n\nWe only had some appetizers: pizza bread, spicy coppa, fresh mozarella (served with arugula salad) and roasted cauliflower.\nThe cauliflower was my favorite, perfectly cooked, tender, slightly brown, tossed in a delicious oily caper garlicky sauce. Wood oven baked. 5 stars.\nThe mozzarella was nice but definitely not the best I had. \"OK\" I'd say. Spicy coppa was good, I'm wondering where / which brand they import for.\nThe pizza bread was excellent, I was able to \"build\" perfect bites with arugula cheese and coppa. Loved it.\n\nQuality products are used here. The pizza dough is probably the best I had in USA.\nVery professional service.Staff gives good advice. I'll go back and try their pizza soon.\n\nCons: the music, doesn't fit the style of the restaurant and makes the place too loud.", "rating": 4, "date": "2017-09-05"}, {"excerpts": ["Spicy coppa was amazing (perfect portion amount) and the bread was tasty. "], "author": "Ralph A.", "review": "I was pleasantly surprised with this small pizzeria. A friend had a craving for fresh mozzarella so we decided on this restaurant. Reminiscent of small cafe / market which happens to serve pizza. The menu is expansive. You can stop in for a quick snack or enjoy a full of meal. \n\nI ordered the affettati di coppa along with castelvetrano olives to start. The antipasti plate is served with a small bed of arugula and a few slices of warm baked pizza bread. The salad was a bit salty but the remainder of the dish was delicious. Spicy coppa was amazing (perfect portion amount) and the bread was tasty. Almost made me wish we had ordered a small pizza.\n\nThe mozzarella was ok. I've tasted fresher buffala but not entirely bad considering many Italian restaurants don't offer this menu option. Castelvetrano olives was fresh and perfectly brined. Overall this place is pretty solid given we were only looking for an afternoon snack. I will definitely be back!", "rating": 4, "date": "2017-06-26"}, {"excerpts": ["What our party of five enjoyed: asparagi, spicy coppa, burrata, castelvetrano olives, spaghetti carbonara, diavola, al salmone and prosciutto pizzas, and for our dismount... tiramisu and affogato. "], "author": "Patrick K.", "review": "MOLTO BENE! I've traveled Italy several times and I always love finding the authentic taste this side of the pond. The hundreds of favorable Yelp reviews caught our eye and the food and service (Grazie, Tania) will bring us back. \n\nWhat our party of five enjoyed: asparagi, spicy coppa, burrata, castelvetrano olives, spaghetti carbonara, diavola, al salmone and prosciutto pizzas, and for our dismount... tiramisu and affogato. We all loved this place and can't wait to return!    \n\n~ Patrizio at ForTheLoveOfItaly.com", "rating": 5, "date": "2016-07-14"}, {"excerpts": ["What we ordered:\n\nil casaro pizza\nprosciutto pizza\nmargherita pizza\nimported burrata mozzarella\nbuffala mozzarella\nProsciutto plate\nspicy coppa plate\n\n"], "author": "Spencer W.", "review": "Excellent pizza, pizza crust and mozzy.  The crust is that nice and chewy napolese pizza crust, not \"crusty\" at all.  What we ordered:\n\nil casaro pizza\nprosciutto pizza\nmargherita pizza\nimported burrata mozzarella\nbuffala mozzarella\nProsciutto plate\nspicy coppa plate\n\nThe Burrata and prosciutto pizza were my personal favs.  They put a very generous amount of prosciutto and shaved parm on top of the pizza. (see pics).  Half the restaurants on Columbus are a northbeach tourist trap, but this new spot is not one of them.", "rating": 4, "date": "2015-07-07"}, {"excerpts": ["II Casaro's menu: Antipasti (fried cheese, meatballs, aracini), Mozzarella Bar, Salumi (prosciutto, spicy coppa, mortadella), Piatti (tagliatelle, spaghetti, lasagna, gnocchi), and Pizzas (12+ options). ", "Prices are really reasonable for this touristy area with mains in the $14-$16 range. "], "author": "Cherylynn N.", "review": "There's nothing worse than a limp, flaccid...\n\nPizza.\n\nAm I right, ladies? And gentlemen. \n\nWhat did you think I was going to say? Pervs. \n\nI visit North Beach as much as I visit my dentist...which is never. Both are pain in the ass for different reasons. Tater Tot had a grooming appointment in North Beach so what better way to kill time than to knock off some of my North Beach bookmarks.\n\nI've had II Casaro bookmarked since they opened in early 2014 so I was super ecstatic to finally pay a visit especially with all the glowing reviews. However, after our visit, I was scratching my head as to where all these glowing reviews are coming from (mainly from tourists). I held off on writing my review in the event our experience was an off day. With some recent bad reviews, our experience is unlikely a fluke so here we go...\n\nSorry folks, this is another overrated North Beach restaurant for tourists. Their current 76/100 health score is a bit scary as well especially with an open kitchen. \n\nII Casaro's menu: Antipasti (fried cheese, meatballs, aracini), Mozzarella Bar, Salumi (prosciutto, spicy coppa, mortadella), Piatti (tagliatelle, spaghetti, lasagna, gnocchi), and Pizzas (12+ options). Prices are really reasonable for this touristy area with mains in the $14-$16 range. Reservations accepted. \n\nWe started with the Imported Burrata & Proscuitto San Daniele ($7.75, $8): http://bit.ly/1MKvxPt. The burrata was hands down the best I've had. It was deliciously milky and soft with a tinge of sea salt and pepper to make it pop. I could eat this all day with the accompanying flatbread. I'm totally lactose intolerant (and had no lactaid) which made for a fun ride home with my dining companion. *emoji with medical mask* The prosciutto was ehhh; very salty and very lean.\n\nIf you're looking for deliciously tender balls, look elsewhere. The Polpette Al Sugo: Ground Beef Meatballs, Napoleon Sugo ($7): http://bit.ly/1IVSejR was by far the worst meatballs I've had. They were hard, dense, and clearly overworked. I've had better balls at Buca Di Beppo which is pretty sad. Best meatballs ever can be found nearby at Tosca Café. It's $4 for a tiny golf ball sized meatball but they're life changing. \n\nThe biggest disappointment of the night was the pizza. We shared the Broccoli + Salsiccia: Scamorza Cheese, Broccoli Rabe, Italian Sausage ($16.50 + $4 egg): http://bit.ly/1DnpfU1. The pizza was amazing to look at with its alluring leopard spots but it seriously made me want to cry. As soon as I picked up a slice, all the toppings slid off to reveal a bottom crust drenched in liquid. Now, I know Neapolitan pizzas are supposed to be a little soggy in the center but the center was like a wet sponge. We had to tear off the center crust and just eat the outer crust. The sausage was flavorless and very dry (tasted like turkey sausage) while the broccoli rabe was very bitter. Not a good combo. Who doesn't love a little egg porn? Well, there was egg porn in all its glory but the egg white was still translucent and raw (when you cut it). The menu stated it was $3 for \"eggs\" but we were charged $4 for one egg. WTF. \n\nOur waitress was really nice which was redeeming and it wasn't crowded so we got our food rather quickly. For the hour we were there, the owner or manager (?) was sitting at one of the four top tables in front on his ipad and talking on his cellphone. This was rather unprofessional. \n\nWe went on a Saturday and reservations were not needed as it wasn't even busy. When we left during peak dinner time, it was less than 1/4th filled with tourists. Plenty of seating (high tops) for larger groups.\n\nSorry II Casaro, I just wasn't feeling you...even after several drinks at The Boardroom. Maybe, Mr. Viagra can help ya.", "rating": 3, "date": "2015-08-04"}, {"excerpts": ["We always get the burrata with spicy coppa to start. ", "It comes bread they made right in the brick oven. "], "author": "Jamie C.", "review": "This place is phenomenal. We seriously come here once a week. \n\nEverything is made to order and all the ingredients are top notch. \n\nWe always get the burrata with spicy coppa to start. It comes bread they made right in the brick oven. The burrata is drizzled with olive oil so pure you can drink it. If you've never tried burrata, it's like eating heavenly pillows of cheese that gently caresses your mouth. Must try.\n\nMy favorite favorite pizza here is the Prosciutto. They shave fresh parmesan on top and watching it melt slightly but still hold its structure is one of my favorite things to see in the world. I would frame it in an art installation if I could - if I didn't eat it first. Every bite is a perfect balance of meat and cheese and sauce and crust. \n\nMy second favorite is Capricciosa because the olives, artichoke, and mushroom add a lot of extra flavor but is so simple still.\n\nThe crust on their pizzas is so light that it doesn't over power any of the other ingredients. It's not too salty or oily or thick. And I love using the crust to mop up the extra sauce and oil. And because the oil they use is so good, you don't feel disgusting eating it.\n\nThe atmosphere of the restaurant is great, too. I like sitting at the bar so I can watch them make the pizzas. They also have three TVs that always have some sort of games on, which tones down any sort of pretentiousness the scratch made nature of the place might get.\n\nI'm only scared that this place will get too popular and I won't be able to get a seat right away on a Friday night.", "rating": 5, "date": "2014-10-21"}, {"excerpts": ["We ordered the calzone, prosciutto pizza, spicy coppa plate, and a plate of burrata. ", "The spicy coppa and burrata were my dishes ", "and I was worried it wouldn't fill me up, but they came with a generous helping of bread and a tasty arugula tomato salad on the side, so I was definitely stuffed by the end. ", "The burrata was amazing. ", "I had never had it before- ", "it's so light, creamy, and buttery. ", "I could eat it everyday! ", "The calzone was HUGE. ", "Much bigger than I expected, but sized so a grown man can finish it no problem. ", "Pizza was also good. ", "They come in one size (18\" I think) and are perfect for sharing ", "OR just enough for a grown man to eat on his own. ", "Not a big space, but a great place for you and few friends to grab some great food!"], "author": "Khrysten T.", "review": "After the nighttime Alcatraz tour at 10pm, I was starving and did not want to deal with the crowds along Fisherman's Wharf. Luckily I found this gem! It was a Saturday night and the entire neighborhood was busy, Casaro being no exception, but our party of 6 was immediately seated. We ordered the calzone, prosciutto pizza, spicy coppa plate, and a plate of burrata. The spicy coppa and burrata were my dishes and I was worried it wouldn't fill me up, but they came with a generous helping of bread and a tasty arugula tomato salad on the side, so I was definitely stuffed by the end. The burrata was amazing. I had never had it before- it's so light, creamy, and buttery. I could eat it everyday! The calzone was HUGE. Much bigger than I expected, but sized so a grown man can finish it no problem. Pizza was also good. They come in one size (18\" I think) and are perfect for sharing OR just enough for a grown man to eat on his own. Not a big space, but a great place for you and few friends to grab some great food!", "rating": 5, "date": "2016-03-24"}, {"excerpts": ["We started with the burrata and spicy coppa. ", "Both absolutely flavorful and well paired. ", "Included was a delicious flatbread to accompany the soft mozzarella cheese. ", "It was all wonderful, I could have just eaten that all night. ", "Then we finished with a piizza, the diavola. ", "Very simple, a fresh tomato sauce, mozzarella and spicy salami. ", "it was perfect, the crust flavorful and the toppings as well. ", "We were very happy with our decision!"], "author": "Ashley B.", "review": "My fiance and I stopped by here and loved it. An impromptu dinner, after we decided to walk around. I've come to find I really love this area of San Francisco. This restaurant was a hipper version of the more traditional Italian restaurants around it. Much more casual as well, but it was nice. We started with the burrata and spicy coppa. Both absolutely flavorful and well paired. Included was a delicious flatbread to accompany the soft mozzarella cheese. It was all wonderful, I could have just eaten that all night. Then we finished with a piizza, the diavola. Very simple, a fresh tomato sauce, mozzarella and spicy salami. it was perfect, the crust flavorful and the toppings as well. We were very happy with our decision!", "rating": 5, "date": "2014-11-09"}], "wild boar salamino": [{"excerpts": ["We started with the Wild Boar Salamino.  ", "This is my new favorite thing.  ", "If you've never had it, go and get it immediately!  "], "author": "Ivy R.", "review": "This friend of mine used to live in Milan, Italy.  She has been on a quest for the most authentic Italian Pizza she could find.  She did her own research and found this place may just be the spot to satiate her Italian cravings.\n\nIm game for any new place, as you can tell.  We had a reservation but there was still a little bit of a wait.  We stood outside and the servers come out and ask you if you want Prosecco.  Are you kidding me?  Yes, I always want Prosecco, in a real champagne glass even.  You had me at Prosecco, I swear.\n\nWe started with the Wild Boar Salamino.  This is my new favorite thing.  If you've never had it, go and get it immediately!  Its amazing on every level.\n\nMy friend got her Pizza Margherita.  All of their pizza's are wood fire grilled right there in front of you.  The place does get rather hot, even on a cold night in San Francisco. You will not need a coat inside.  \n\nI had the Spaghetti Carbonara.  It was so buttery and rich.  The pancetta was cut so small and melted in your mouth.  It had just enough pepper to give it a little kick.  I was told that my dish was a very typical real Italian Carbonara.  I had zero complaints.\n\nService was excellent.  It helped my dinning partner speaks fluent Italian with the servers who are also, really Italian.  \n\nIf this is the most authentic Italian you can get out of Italy, Im convinced.", "rating": 5, "date": "2017-06-15"}], "imported buffalo mozzarella": [], "fior di latte mozzarella": [{"excerpts": ["Grabbed two pizza's :\n\nMargherita -Tomato sauce, fior di latte mozzarella, extra virgin olive oil, basil \n\nQuattro Formaggi Mozzarella, goat cheese, asiago, "], "author": "Rod M.", "review": "Saw the great reviews on this place and had to hop in here. Grabbed two pizza's :\n\nMargherita -Tomato sauce, fior di latte mozzarella, extra virgin olive oil, basil \n\nQuattro Formaggi Mozzarella, goat cheese, asiago, gorgonzola \n\nWe both agreed that we definitely like the Margherita more than the Quattro Formaggi. \n\nWhile we thought the pizza was solid we think there are better options in the City/Bay Area for thin crust pizza hence the 3 star rating.  The speed they make the pizza's is impressive as other's have noted when your pizza is \"up\". However, this place does get busy and when I was there at least there was only one person making pizza's so if there is a back log of pizza's to be made you will be waiting for a lil bit so don't expect your pizza's to come out super quick. \n\nVibe and interior was nice and the wait staff was cool.", "rating": 3, "date": "2018-04-20"}, {"excerpts": ["We ordered the Fior Di Latte mozzarella for starters - tasted fresh but the bread was a bit too hard. ", "For the main course, we ordered two Diavola pizzas and the lasagna. ", "The pizza was awesome - the sauce is tart, fresh and light while the salami adds a spicy kick. ", "But man, that lasagna! ", "That was THE BEST lasagna I've ever had! ", "Topped with freshly shaved parmesan chips, perfect!"], "author": "Martin A.", "review": "Me and my family picked this place over the Stinking Rose while in SF. They're both on the same street. I was happy with this place (Lowen not so much). We ordered the Fior Di Latte mozzarella for starters - tasted fresh but the bread was a bit too hard. For the main course, we ordered two Diavola pizzas and the lasagna. The pizza was awesome - the sauce is tart, fresh and light while the salami adds a spicy kick. But man, that lasagna! That was THE BEST lasagna I've ever had! Topped with freshly shaved parmesan chips, perfect!", "rating": 4, "date": "2014-09-02"}], "imported burrata": [{"excerpts": ["the Margherita and the Il Casaro pizzas, as well as the \"imported burrata\" and wood fired asparagus. ", "Quite a lot of food ", "but we were ok with getting some to go. ", "I loved the margherita, I thought it was perfect tomato to cheese to crust ratio. ", "Burrata was also excellent. "], "author": "Su Lin Y.", "review": "Came here after a weekend in New York because I clearly didn't get enough pizza there. Well, mostly, I just rediscovered my love for amazing thin crust proper Italian pizza and was on the search for some in SF.\n\nI was so pleasantly surprised by Il casaro's pizza. It tasted like it could rival some of the better establishments in NYC!! \n\nWe ordered (for 2 people) the Margherita and the Il Casaro pizzas, as well as the \"imported burrata\" and wood fired asparagus. Quite a lot of food but we were ok with getting some to go. I loved the margherita, I thought it was perfect tomato to cheese to crust ratio. Burrata was also excellent. I was surprised they named the il Casaro pizza after their establishment because I felt like the flavors were just ok. My boyfriend really liked that one though. He said he could taste garlic coming through but it just wasn't quite there for me. Still a great pie though! \n\nIt was also really chill atmosphere on a Friday evening, not too many people and not too loud. That's truly a miracle for a good place in SF. No line out the door?!! Fresh air coming through as well.\n\nWill definitely be back!", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["Brings me back to Rimini with their authentic Italian Pizzas and imported burrata. ", "The buffalo mozzarella is soft and fresh and I could taste the San Marzano tomatoes used in the sauce. ", "I knew I was in for a treat when I spotted the bright red light bowl of sauce. ", "This pizzeria is Italian owned and the service is prompt and friendly. ", "In true Italian fashion, I had to try their espresso. ", "Wow. ", "It was sweet, bold and aromatic with a perfect layer of crema. ", "Top it off with a Chinotto!"], "author": "Leanna L.", "review": "Brings me back to Rimini with their authentic Italian Pizzas and imported burrata. The buffalo mozzarella is soft and fresh and I could taste the San Marzano tomatoes used in the sauce. I knew I was in for a treat when I spotted the bright red light bowl of sauce. This pizzeria is Italian owned and the service is prompt and friendly. In true Italian fashion, I had to try their espresso. Wow. It was sweet, bold and aromatic with a perfect layer of crema. Top it off with a Chinotto!", "rating": 5, "date": "2018-04-21"}, {"excerpts": ["We had the imported burrata and mozzarella in carroza for appetizers and both were so delicious. ", "For the entree we couldn't decide so we decided to order a few pizzas along with lasagna and a calzone. ", "The mozzarella on the pizza was extremely fresh. ", "The crust was perfect. ", "The evening was made perfect by the service. ", "I can't recall the name of our server ", "but she was so friendly and patient with our 20 questions. ", "Her recommendations were on point. ", "I can't wait to visit San Fran again to stop by for round 2!"], "author": "Susie M.", "review": "Durning a Business trip to Oakland a group of coworkers and I decided to head to San Francisco one night. I stumbled across this place on Yelp and decided to give it a try. OMG!! I am so happy that I did! Everything was amazing. We had the imported burrata and mozzarella in carroza for appetizers and both were so delicious. For the entree we couldn't decide so we decided to order a few pizzas along with lasagna and a calzone. The mozzarella on the pizza was extremely fresh. The crust was perfect. The evening was made perfect by the service. I can't recall the name of our server but she was so friendly and patient with our 20 questions. Her recommendations were on point. I can't wait to visit San Fran again to stop by for round 2!", "rating": 5, "date": "2017-10-19"}, {"excerpts": ["What we ordered:\n\nil casaro pizza\nprosciutto pizza\nmargherita pizza\nimported burrata mozzarella\nbuffala mozzarella\nProsciutto plate\nspicy coppa plate\n\n"], "author": "Spencer W.", "review": "Excellent pizza, pizza crust and mozzy.  The crust is that nice and chewy napolese pizza crust, not \"crusty\" at all.  What we ordered:\n\nil casaro pizza\nprosciutto pizza\nmargherita pizza\nimported burrata mozzarella\nbuffala mozzarella\nProsciutto plate\nspicy coppa plate\n\nThe Burrata and prosciutto pizza were my personal favs.  They put a very generous amount of prosciutto and shaved parm on top of the pizza. (see pics).  Half the restaurants on Columbus are a northbeach tourist trap, but this new spot is not one of them.", "rating": 4, "date": "2015-07-07"}, {"excerpts": ["We started with the Imported Burrata & Proscuitto San Daniele ($7.75, $8): http://bit.ly/1MKvxPt. ", "The burrata was hands down the best I've had. ", "It was deliciously milky and soft with a tinge of sea salt and pepper to make it pop. ", "I could eat this all day with the accompanying flatbread. ", "I'm totally lactose intolerant (and had no lactaid) which made for a fun ride home with my dining companion. ", "*emoji with medical mask", "* "], "author": "Cherylynn N.", "review": "There's nothing worse than a limp, flaccid...\n\nPizza.\n\nAm I right, ladies? And gentlemen. \n\nWhat did you think I was going to say? Pervs. \n\nI visit North Beach as much as I visit my dentist...which is never. Both are pain in the ass for different reasons. Tater Tot had a grooming appointment in North Beach so what better way to kill time than to knock off some of my North Beach bookmarks.\n\nI've had II Casaro bookmarked since they opened in early 2014 so I was super ecstatic to finally pay a visit especially with all the glowing reviews. However, after our visit, I was scratching my head as to where all these glowing reviews are coming from (mainly from tourists). I held off on writing my review in the event our experience was an off day. With some recent bad reviews, our experience is unlikely a fluke so here we go...\n\nSorry folks, this is another overrated North Beach restaurant for tourists. Their current 76/100 health score is a bit scary as well especially with an open kitchen. \n\nII Casaro's menu: Antipasti (fried cheese, meatballs, aracini), Mozzarella Bar, Salumi (prosciutto, spicy coppa, mortadella), Piatti (tagliatelle, spaghetti, lasagna, gnocchi), and Pizzas (12+ options). Prices are really reasonable for this touristy area with mains in the $14-$16 range. Reservations accepted. \n\nWe started with the Imported Burrata & Proscuitto San Daniele ($7.75, $8): http://bit.ly/1MKvxPt. The burrata was hands down the best I've had. It was deliciously milky and soft with a tinge of sea salt and pepper to make it pop. I could eat this all day with the accompanying flatbread. I'm totally lactose intolerant (and had no lactaid) which made for a fun ride home with my dining companion. *emoji with medical mask* The prosciutto was ehhh; very salty and very lean.\n\nIf you're looking for deliciously tender balls, look elsewhere. The Polpette Al Sugo: Ground Beef Meatballs, Napoleon Sugo ($7): http://bit.ly/1IVSejR was by far the worst meatballs I've had. They were hard, dense, and clearly overworked. I've had better balls at Buca Di Beppo which is pretty sad. Best meatballs ever can be found nearby at Tosca Café. It's $4 for a tiny golf ball sized meatball but they're life changing. \n\nThe biggest disappointment of the night was the pizza. We shared the Broccoli + Salsiccia: Scamorza Cheese, Broccoli Rabe, Italian Sausage ($16.50 + $4 egg): http://bit.ly/1DnpfU1. The pizza was amazing to look at with its alluring leopard spots but it seriously made me want to cry. As soon as I picked up a slice, all the toppings slid off to reveal a bottom crust drenched in liquid. Now, I know Neapolitan pizzas are supposed to be a little soggy in the center but the center was like a wet sponge. We had to tear off the center crust and just eat the outer crust. The sausage was flavorless and very dry (tasted like turkey sausage) while the broccoli rabe was very bitter. Not a good combo. Who doesn't love a little egg porn? Well, there was egg porn in all its glory but the egg white was still translucent and raw (when you cut it). The menu stated it was $3 for \"eggs\" but we were charged $4 for one egg. WTF. \n\nOur waitress was really nice which was redeeming and it wasn't crowded so we got our food rather quickly. For the hour we were there, the owner or manager (?) was sitting at one of the four top tables in front on his ipad and talking on his cellphone. This was rather unprofessional. \n\nWe went on a Saturday and reservations were not needed as it wasn't even busy. When we left during peak dinner time, it was less than 1/4th filled with tourists. Plenty of seating (high tops) for larger groups.\n\nSorry II Casaro, I just wasn't feeling you...even after several drinks at The Boardroom. Maybe, Mr. Viagra can help ya.", "rating": 3, "date": "2015-08-04"}, {"excerpts": ["IMPORTED BURRATA\n\n"], "author": "Elliott D.", "review": "TL;DR:\n\nFor the love of tastebuds, have I not been transported to Napoli itself with these familiar flavors!? Yes, brethren & sisters, I've been to the Old Country and supped at its greatest pie houses. This is an experience not less glorious.\n\nTHE DEETS:\n\n***IMPORTED BURRATA\n\nThough many a burrata have I ravaged, I do declare that never until today have I experienced burrata as it was truly intended. This celestial dairy must have poured forth from the most holy of golden calves, hand-fed the hand-manicured artisanal grass of an immortal world. The milk & cream from this cow are superior to all before it, and the cheese-making methods employed here are esoteric & second to none. There is no toughness, only gooey joy. When you bite in, the fresh panna flows forth as a divine gift.\n\nThe bread strips served with this dish were magnificently charred, soft as silk, and drizzled with potent premium olive oil (no canola blend detected). With it was a simple arugula & grape tomato salad, which masterfully satisfied the need for complexity by offering bitter & sweet notes.\n\nI'd come back for this dish alone.\n\n***DIAVOLA PIZZA - Mozzarella, tomato sauce, spicy salami\n\nI've searched high & low for true Napoli pizza on this continent and have not once found crust so beautifully charred and yet perfectly supple. Surely a sign of doppio zero flour. It was so soft that you could roll it up and wipe your face with it. The sauce was infinitely light & as delicately fruity as can be, enabling you to eat slice after slice without being bogged down by the slightest shadow of heaviness. The fact that they stuck \"Mozzarella Bar\" as part of the establishment's name corroborates my experience--these were sinfully moist, meaty, & yet somehow light chunks of moo product. And yes, the crucial basil centerpiece was equally toasted & wilted as is the divine degree.\n\nThe soft red chillies & spicy salami was a lovely treat, providing just enough heat & flavor without overwhelming the batch. \n\n***PROSCIUTTO PIZZA - San Daniele prosciutto, arugula, tomato sauce, mozzarella cheese\n\nThe crust, sauce, & mozzarella were just as meticulous & present as the last pizza; in addition, this pie was topped with delicious prosciutto, arugula, & raspadura shavings. The prosciutto provided a luxuriously moist layer, while the arugula offered some pleasant bitter contrast. The raspadura, while extremely fresh and flavorful, was in my opinion slightly excessive due to the dry nature of the cheese and the copious amounts that had to be consumed to get to the pizza below. Still, if generosity was their fault, the quality of the ingredients made this more than forgivable.\n\n***PANNA COTTA with raspberry sauce\n\nI've had more panna cotta than I can recall, but the consistency of this product (as had become a theme throughout the meal with each additional dairy offering) was much more refined & dare-I-say velvetier that anything I'd previously encountered. It was truly a cream-filled delight, finished gracefully with fresh vanilla bean seeds & tangy raspberry purée.\n__\n\nJust remember, you're very welcome.", "rating": 5, "date": "2015-07-05"}, {"excerpts": ["We ordered the Imported Burrata, the Gnocchi, the Margherita, Quattro Formaggi, and the Capricciosa pizzas. ", "Hard to pick a favorite pizza, but we really enjoyed the Quattro Formaggi. "], "author": "Russ N.", "review": "I've come here a couple times now. We'd just come back from a trip to Italy and were hankering for some solid Italian-style pizza. This place doesn't disappoint. \n\nWe ordered the Imported Burrata, the Gnocchi, the Margherita, Quattro Formaggi, and the Capricciosa pizzas. Hard to pick a favorite pizza, but we really enjoyed the Quattro Formaggi. Burrata was fantastic, the gnocchi melted in your mouth.\n\nService is good and prices are fair, the host of the restaurant is very nice. However, the thing that stands out is the food, particularly the pizza. i'll come back often.", "rating": 5, "date": "2015-06-09"}, {"excerpts": ["The imported burrata, prosciutto pie and a glass of pinot. "], "author": "Katie O.", "review": "The imported burrata, prosciutto pie and a glass of pinot. Soooo good, i can't even. \n\nThe burrata is silky, buttery and rich paired with the smokey, charred flatbread. The prosciutto pie is thin, perfectly crisp and holds a nice balance of earthy shaved raspa dura, salty pork and tart marinara. Rocket greens (perhaps dressed in lemon & oil) provide that nice bitter pungency that rounds out both of these superb dishes.\n\nGet these and thank me later!", "rating": 5, "date": "2015-12-06"}, {"excerpts": ["You HAVE to order the Imported Burrata! "], "author": "Yu Sheng T.", "review": "You HAVE to order the Imported Burrata! It's really really really awesome. \n\nWe also ordered the Calzone pizza, which was pretty good too (but not nearly as heavenly as the Burrata).", "rating": 4, "date": "2014-12-28"}, {"excerpts": ["I ordered the calzone (San Marzano tomatoes, smoked mozzarella, ham, & mushrooms) and the imported Burrata. ", "Both were outstanding. ", "The arugula & cherry tomato salad w the calzone was a wonderful touch. ", "My only gentle complaint: two small bread pieces with the Burrata was not nearly enough. ", "Maybe at least double that for take-out?"], "author": "Fran C.", "review": "A few nights ago, I found myself home alone, hungry, & lazy. I was searching for something, & I thought the Internet could help me find my true match. I opened up my favorite site, Caviar, hoping to find the answer to my dilemma. I began to scroll through the photos, focusing on the \"type\" I was looking for tonight - Italian. Gorgeous photos of pizza were everywhere. But I'd been through so many of them before. Sure, they were fine, but I was sure that tonight I could do better. Some were clearly gold-diggers (Tony & his $45 pizza - yikes). I started to despair. Maybe this whole internet thing just isn't for me. Maybe I should just go old-school and call an old regular.\n\nBut remember, I'm lazy so I persevered. Suddenly, I came upon Il Casaro Pizzeria & Mozzarella Bar. The pictures were all I needed to see, not to mention the elevation of amazing mozzarellas in the very name. It was love at first sight. I could see us in Italy in a beautiful, romantic restaurant. I could use all the Italian words I know: per favore, Grazie, delizioso, formaggio, etc. \n\nArriving early, and not the worse for wear after the indignity of being shoved in a cardboard box for the trip across town, I was blown away by what came through my door. Always wondering if the photos would match the reality, and ladies (& gentlemen!) did it ever. This was the real deal. So, I'm here to say, do yourself a favor & spend an evening with il Casaro.\n\nP.S. I ordered the calzone (San Marzano tomatoes, smoked mozzarella, ham, & mushrooms) and the imported Burrata. Both were outstanding. The arugula & cherry tomato salad w the calzone was a wonderful touch. My only gentle complaint: two small bread pieces with the Burrata was not nearly enough. Maybe at least double that for take-out?", "rating": 5, "date": "2015-05-05"}, {"excerpts": ["The imported burrata was excellent and the prosciutto was even better. "], "author": "Shawn G.", "review": "The food and service was outstanding. Augustina was very welcoming and informative. Her wine recommendation was excellent. The imported burrata was excellent and the prosciutto was even better. The Buffalina pizza was the best Neapolitan pizza we've had since Ciccia Bamba in Rome. \n\nOne small issue -- we had dinner at 6:00pm and they were out of lasagna and tiramisu.", "rating": 5, "date": "2015-05-04"}, {"excerpts": ["I ordered the bruschetta and the imported burrata, and was surprised by the portion sizes of each - together it was more than enough food for one person.\n\n", "I would recommend coming here for the imported burrata alone. ", "Absolutely gorgeous. ", "I thought I'd died and gone to heaven. ", "It was creamy and silky soft with still a little elasticity. "], "author": "Katy M.", "review": "Just got blown away by the food here! Definitely some of the best Italian I've had.\n\nI went in around 3pm and it was very quiet so service was not lacking.\n\nI ordered the bruschetta and the imported burrata, and was surprised by the portion sizes of each - together it was more than enough food for one person.\n\nThe bruschetta was lovely, sweet red onions, and soft red capsicum and zucchini over velvety ricotta. The crispy, chewy bread was the perfect texture to accompany the soft toppings and wasn't soggy at all.\n\nI would recommend coming here for the imported burrata alone. Absolutely gorgeous. I thought I'd died and gone to heaven. It was creamy and silky soft with still a little elasticity. One of the most wonderful things I've ever put in my mouth.\n\nEverything was well worth what I paid and the staff were friendly and efficient. Highly recommended.", "rating": 5, "date": "2015-09-09"}, {"excerpts": ["The imported burrata -- $9.75 for one of THE MOST INCREDIBLE bites of food I have EVER experienced!  "], "author": "Alicia K.", "review": "Went to this place after the Beach Blanket Babylon show and holy cannoli were we ever THRILLED!!!\n\nThe imported burrata -- $9.75 for one of THE MOST INCREDIBLE bites of food I have EVER experienced!  Creamy, smooth, with a touch of olive oil and salted to perfection leaving it ridiculously delicious... Served with yummy freshly toasted bread, arugula, and cherry tomatoes that make the whole thing taste fresh and balanced.  I am NOT kidding -- this is an item NOT to be missed!!!\n\nProsciutto pizza -- some of the best tasting prosciutto I have ever had the privilege of putting in my mouth, again with arugula and tomato for freshness, and mozzarella and parmesan cheeses worth coming back for. This one was a huge win.\n\nBufalina pizza -- their most popular pizza, with tomato, buffalo mozzarella, EVOO, and fresh basil. I'll be honest -- while tasty and clearly made with high quality, fresh ingredients, this one's pretty plain/standard tasting and I would definitely recommend going to the Prosciutto instead.\n\nGreat service. Casual, clean, modern feel (which happens to be my style so I was obviously a fan).  And the price is RIGHT!!! All the food above plus a bottle of Primativo left three of us just $85 in the hole -- a complete value in this fine city!", "rating": 5, "date": "2014-10-22"}, {"excerpts": ["I'd wanted simply a very light lunch and it ordered the imported Burrata and the asparagus cheese. ", "With these I had a glass of Pinot Grigio. ", "But as I watched the pizza master twirling pizza dough and nurturing pizzas through the cooking process, I just had to order one myself. ", "For this course I ordered a glass of the Etna Russo red wine. ", "I enjoyed two slices and took the rest home. ", "Fantastic. ", "The room is great, the service very well done, and I found the food excellent. ", "This is a very good addition to North Beach cuisine, and an excellent replacement for the Steps of Rome. ", "Enjoy!"], "author": "Jerry H.", "review": "I had an excellent lunch here. I sat at the bar and watched the pizza master at work. This is a man who cooks with love. I was told he used to spin pizzas in Washington Sq., Park the delight of the crowds. I'd wanted simply a very light lunch and it ordered the imported Burrata and the asparagus cheese. With these I had a glass of Pinot Grigio. But as I watched the pizza master twirling pizza dough and nurturing pizzas through the cooking process, I just had to order one myself. For this course I ordered a glass of the Etna Russo red wine. I enjoyed two slices and took the rest home. Fantastic. The room is great, the service very well done, and I found the food excellent. This is a very good addition to North Beach cuisine, and an excellent replacement for the Steps of Rome. Enjoy!", "rating": 5, "date": "2014-05-02"}, {"excerpts": ["We started with the Imported Burrata and then moved onto the Margherita Pizza.  ", "Both were delicious!!  ", "I've never had burrata.  ", "What is not to love?!?!  ", "It is super soft mozzarella that you can spread on the toast provided.  ", "YUM!  ", "The pizza crust was fantastic with that brick oven taste, and the toppings were fresh and flavorful.  ", "It was a Thursday night so less than half of the restaurant's tables were occupied.  ", "The service was both fast and friendly.  ", "My husband and I especially liked the bus boy.  ", "He was super friendly and attentive.  ", "Prices are reasonable with our tab including tip hovering right around $30.00.  ", "We chose the table next to the front window so that we could \"people watch\" as we ate.  ", "I highly recommend Il Casaro if you are looking for a great casual dinner with top notch service.  ", "Oh, and it's great for kids.  ", "We don't have any, but the little girl at the table next to ours seemed to really be enjoying herself."], "author": "Danielle A.", "review": "It was our last night in San Francisco, and my husband and I wanted to grab dinner in North Beach before heading back to our hotel.  Thanks to Yelp, we found Il Casaro Pizzeria & Mozzarella Bar.  We started with the Imported Burrata and then moved onto the Margherita Pizza.  Both were delicious!!  I've never had burrata.  What is not to love?!?!  It is super soft mozzarella that you can spread on the toast provided.  YUM!  The pizza crust was fantastic with that brick oven taste, and the toppings were fresh and flavorful.  It was a Thursday night so less than half of the restaurant's tables were occupied.  The service was both fast and friendly.  My husband and I especially liked the bus boy.  He was super friendly and attentive.  Prices are reasonable with our tab including tip hovering right around $30.00.  We chose the table next to the front window so that we could \"people watch\" as we ate.  I highly recommend Il Casaro if you are looking for a great casual dinner with top notch service.  Oh, and it's great for kids.  We don't have any, but the little girl at the table next to ours seemed to really be enjoying herself.", "rating": 4, "date": "2014-11-02"}], "tagliatelle pasta": [], "spaghetti carbonara pasta": [], "bucatini all amatriciana pasta": [], "il casaro pizza": [{"excerpts": ["I was surprised they named the il Casaro pizza after their establishment because I felt like the flavors were just ok. ", "My boyfriend really liked that one though. ", "He said he could taste garlic coming through ", "but it just wasn't quite there for me. "], "author": "Su Lin Y.", "review": "Came here after a weekend in New York because I clearly didn't get enough pizza there. Well, mostly, I just rediscovered my love for amazing thin crust proper Italian pizza and was on the search for some in SF.\n\nI was so pleasantly surprised by Il casaro's pizza. It tasted like it could rival some of the better establishments in NYC!! \n\nWe ordered (for 2 people) the Margherita and the Il Casaro pizzas, as well as the \"imported burrata\" and wood fired asparagus. Quite a lot of food but we were ok with getting some to go. I loved the margherita, I thought it was perfect tomato to cheese to crust ratio. Burrata was also excellent. I was surprised they named the il Casaro pizza after their establishment because I felt like the flavors were just ok. My boyfriend really liked that one though. He said he could taste garlic coming through but it just wasn't quite there for me. Still a great pie though! \n\nIt was also really chill atmosphere on a Friday evening, not too many people and not too loud. That's truly a miracle for a good place in SF. No line out the door?!! Fresh air coming through as well.\n\nWill definitely be back!", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["We got a buratta and il casaro pizza.\n\n", "The il casaro pizza came with mushroom and proscuitto.  ", "Filling enough for 3 (albeit smaller sized) people. "], "author": "Nicole H.", "review": "Stopped by with my family on a Saturday afternoon and there wasn't too much of a wait! \n\nWe got a buratta and il casaro pizza.\n\nThe buratta came with an arugula salad with cherry tomatoes and some bread (seemingly made of the same flour as the pizza dough)-- could basically be a small meal in and of itself. The buratta was creamy and nice. They added some olive oil and pepper to the arugula, which was perfect. The bread was chewy and a good complement to the buratta. 3.75/5.\n\nThe il casaro pizza came with mushroom and proscuitto.  Filling enough for 3 (albeit smaller sized) people. The oven is smack dab in the middle of the restaurant and the open kitchen makes it entertaining to watch the cooks prepare the food right in front of you if you sit at the center bar!\n--\n\nIt's national pizza day so we came back! Chewy (but not hard to pull apart) crust, which felt more like a very delicious breadstick. Compared to other spots, the crust has a little more charred taste to it (not in a bad way though). Super thin crust. The broccoli and sausage pizza reminded me of the weird pizza combos we had at school. The cheese didn't stand out to me like it did at Little Star, but it was still good.", "rating": 4, "date": "2018-02-09"}, {"excerpts": ["I had the Il Casaro pizza with the addition of burrata and it was absolutely delicious. "], "author": "Elizabeth L.", "review": "An Italian friend and family have mentioned this is the best pizza they have had in America hands down so thats probably saying something.\n\nIt's a cute place to grab a few pizzas and wine. Loud and lively, a little chaotic, but still homey and comfortable. This is such a gem and can't wait to come back.\n\nI had the Il Casaro pizza with the addition of burrata and it was absolutely delicious. Burrata really takes it to the next level\n\nAtmosphere: 4/5\nFood: 5/5\nService: 5/5\nOverall Experience: 5/5", "rating": 5, "date": "2017-12-12"}, {"excerpts": ["and I got the Il Casaro pizza. ", "The pizza was so fresh and the crust was crispy but also light at the same time. ", "You can see them making everything in the pizza oven. ", "A great local spot with a simple pizza menu and all Italian servers and staff. ", "I'd definitely go back again and again."], "author": "Carol Ann V.", "review": "Tried Il Casaro for the first time last night. It was getting crowded when we got there around 6:00 but luckily got seated right away. They don't take reservations so have to get lucky on busy nights. W started with the olives and burrata! Both were amazing and the bread that comes with the burrata is like a crispy pizza crust flatbread. My husband got the calzone and I got the Il Casaro pizza. The pizza was so fresh and the crust was crispy but also light at the same time. You can see them making everything in the pizza oven. A great local spot with a simple pizza menu and all Italian servers and staff. I'd definitely go back again and again.", "rating": 5, "date": "2017-11-18"}, {"excerpts": ["The beet salad, mozzarella bar and the il Casaro pizza were all delicious. ", "Will definitely be back the next time I'm in the North Beach neighborhood."], "author": "Roshan L.", "review": "My daughter and I had a wonderful lunch here. The beet salad, mozzarella bar and the il Casaro pizza were all delicious. Will definitely be back the next time I'm in the North Beach neighborhood.", "rating": 5, "date": "2018-06-19"}, {"excerpts": ["What we ordered:\n\nil casaro pizza\nprosciutto pizza\nmargherita pizza\nimported burrata mozzarella\nbuffala mozzarella\nProsciutto plate\nspicy coppa plate\n\n"], "author": "Spencer W.", "review": "Excellent pizza, pizza crust and mozzy.  The crust is that nice and chewy napolese pizza crust, not \"crusty\" at all.  What we ordered:\n\nil casaro pizza\nprosciutto pizza\nmargherita pizza\nimported burrata mozzarella\nbuffala mozzarella\nProsciutto plate\nspicy coppa plate\n\nThe Burrata and prosciutto pizza were my personal favs.  They put a very generous amount of prosciutto and shaved parm on top of the pizza. (see pics).  Half the restaurants on Columbus are a northbeach tourist trap, but this new spot is not one of them.", "rating": 4, "date": "2015-07-07"}, {"excerpts": ["We ordered the tagliatelle and Il Casaro pizza. ", "They were both amazing. ", "The tagliatelle was made in a fresh tomato sauce with perfectly braised Pork belly. ", "The pasta was incredibly fresh. ", "The pizza was also perfect. ", "The crust was coal fired to perfection and the cheese, prosciutto and mushrooms ", "complemented each other very well. ", "Our service was mostly ok ", "but our waitress could have checked on us a few more times. ", "Other than that I would totally recommend this north beach gem!"], "author": "Alexa P.", "review": "My boyfriend and I were in San Fran for a few days and walked around north beach looking for some good Italian. It was a Wednesday evening and we walked past several places which were partially full and then came across Il Casaro which was packed. The majority of people seemed to be locals so we went for it. We ordered the tagliatelle and Il Casaro pizza. They were both amazing. The tagliatelle was made in a fresh tomato sauce with perfectly braised Pork belly. The pasta was incredibly fresh. The pizza was also perfect. The crust was coal fired to perfection and the cheese, prosciutto and mushrooms complemented each other very well. Our service was mostly ok but our waitress could have checked on us a few more times. Other than that I would totally recommend this north beach gem!", "rating": 5, "date": "2016-05-12"}, {"excerpts": ["Take the Il Casaro Pizza. ", "It's ", "stuff dreams are made of."], "author": "Florent C.", "review": "Take the Il Casaro Pizza. It's stuff dreams are made of.", "rating": 5, "date": "2017-01-22"}, {"excerpts": ["My daughter loved her Il Casaro pizza.  ", "Server was attentive without being overbearing.  "], "author": "Steve B.", "review": "Margherita pizza was as good as I've had in Rome, Milan and Naples.  Cheese, sauce, basil, dough: all top-notch.  My daughter loved her Il Casaro pizza.  Server was attentive without being overbearing.  Spiedini di Calamari starter was so-so.   Calamari bordered on rubbery, perhaps overcooked.  Music was a little loud.  Will return and try another appetizer.", "rating": 4, "date": "2017-05-06"}, {"excerpts": ["Il Casaro pizza with mozzarella and prosciutto was very good. ", "Service was good. ", "The only thing I think was lacking a bit was the atmosphere. ", "It was a rather stark, modern decor. ", "Not unpleasant, just not particularly charming."], "author": "P S.", "review": "The dreamy burrata appetizer comes with a delicious focaccia bread. Il Casaro pizza with mozzarella and prosciutto was very good. Service was good. The only thing I think was lacking a bit was the atmosphere. It was a rather stark, modern decor. Not unpleasant, just not particularly charming.", "rating": 4, "date": "2015-10-25"}, {"excerpts": ["Got the burrata mozzarella and the il Casaro pizza. ", "Beautiful clouds of gooey, delicious mozzarella. ", "Perfect wood fired pizza. ", "So good.  ", "One of the best pizzas I've had and well worth the trip."], "author": "Ed S.", "review": "I had some misgivings about getting pizza in San Francisco just because of the sheer quantity of dining options, and I don't think of the city as a pizza Mecca. But, when The Oracle tells me that is a must try, try it I must. Got the burrata mozzarella and the il Casaro pizza. Beautiful clouds of gooey, delicious mozzarella. Perfect wood fired pizza. So good.  One of the best pizzas I've had and well worth the trip.", "rating": 5, "date": "2016-01-05"}], "bufalina pizza": [{"excerpts": ["We also had the Bufalina pizza, but frankly, I couldn't really tell the difference between it and the Margherita.  ", "Maybe I was too full!   ", "We sat at the bar, and it was a treat to watch those master pizza makers showcase their craft.  ", "Thanks for an outstanding meal!"], "author": "Kathy W.", "review": "With so many places to eat in San Francisco, how do you pick one?  We picked this one since it was in walking distance and it had the words Mozzarella Bar in the name.   Il Casaro, you are a hit with our family!   We loooved the Margherita pizza.  The flavor was great and the crust was perfection.  We also had some delicious burrata cheese, asparagus, and lasagna.   We also had the Bufalina pizza, but frankly, I couldn't really tell the difference between it and the Margherita.  Maybe I was too full!   We sat at the bar, and it was a treat to watch those master pizza makers showcase their craft.  Thanks for an outstanding meal!", "rating": 5, "date": "2018-01-03"}, {"excerpts": ["Next we ordered the bufalina pizza and added sausage. ", "We enjoyed watching the pizza man make the pizzas in the wood fired oven. ", "Our pizza took about 3 mins and then handed over to us piping hot. ", "The mozzarella was creamy and tasted great. ", "The tomato sauce was bold and flavorful. ", "Some of the reviews talk about the crust being soggy.... pick up a fork, start in the center and enjoy delicious pizza. "], "author": "Bree D.", "review": "Ummm yes please! Server was legit Italiano, super friendly and kind and outgoing. \n\nWe started with a half bottle of Prosecco. Perfectly bubbly , dry and not too sweet. We ordered 2 arancinis and 2 croquettes. The potatoe croquettes were delish, crispy on the outside with a spicy meat inside. \n\nNext we ordered the bufalina pizza and added sausage. We enjoyed watching the pizza man make the pizzas in the wood fired oven. Our pizza took about 3 mins and then handed over to us piping hot. The mozzarella was creamy and tasted great. The tomato sauce was bold and flavorful. Some of the reviews talk about the crust being soggy.... pick up a fork, start in the center and enjoy delicious pizza. This is authentic to Italy! \n\nWe finished with a macchiato and cappuccino. After I gave my server a hard time about needing a creamy cappuccino, he asked me to trust him, (insert Italian accent here) \"that I make it a thea Italiano way\" Trusting him was best because it was the most creamy and bold cappuccino I've had! \n\nMy husband and I enjoyed the service, atmosphere, food and experience. Hands down a great North Beach find!", "rating": 5, "date": "2017-02-17"}, {"excerpts": ["Got the lasagna and bufalina pizza to share, both great! ", "House prosecco was also very good. ", "Very bus ", "but don't be deterred, there were seats at the bar. ", "Friendly waiter"], "author": "Chloé R.", "review": "Got the lasagna and bufalina pizza to share, both great! House prosecco was also very good. Very bus but don't be deterred, there were seats at the bar. Friendly waiter", "rating": 4, "date": "2017-03-29"}, {"excerpts": ["Their Bufalina pizza was as authentic and tasty, from the crust to the sauce to the cheese.  ", "We also had the beet salad; it was crisp and refreshing, on a beautiful warm day. ", "We have found a new favorite in our favorite city!"], "author": "Melissa L.", "review": "We love trying new places, especially places that have margarita pizza. Their Bufalina pizza was as authentic and tasty, from the crust to the sauce to the cheese.  We also had the beet salad; it was crisp and refreshing, on a beautiful warm day. We have found a new favorite in our favorite city!", "rating": 5, "date": "2017-10-16"}, {"excerpts": ["Bufalina pizza -- their most popular pizza, with tomato, buffalo mozzarella, EVOO, and fresh basil. ", "I'll be honest -- ", "while tasty and clearly made with high quality, fresh ingredients, this one's pretty plain/standard tasting "], "author": "Alicia K.", "review": "Went to this place after the Beach Blanket Babylon show and holy cannoli were we ever THRILLED!!!\n\nThe imported burrata -- $9.75 for one of THE MOST INCREDIBLE bites of food I have EVER experienced!  Creamy, smooth, with a touch of olive oil and salted to perfection leaving it ridiculously delicious... Served with yummy freshly toasted bread, arugula, and cherry tomatoes that make the whole thing taste fresh and balanced.  I am NOT kidding -- this is an item NOT to be missed!!!\n\nProsciutto pizza -- some of the best tasting prosciutto I have ever had the privilege of putting in my mouth, again with arugula and tomato for freshness, and mozzarella and parmesan cheeses worth coming back for. This one was a huge win.\n\nBufalina pizza -- their most popular pizza, with tomato, buffalo mozzarella, EVOO, and fresh basil. I'll be honest -- while tasty and clearly made with high quality, fresh ingredients, this one's pretty plain/standard tasting and I would definitely recommend going to the Prosciutto instead.\n\nGreat service. Casual, clean, modern feel (which happens to be my style so I was obviously a fan).  And the price is RIGHT!!! All the food above plus a bottle of Primativo left three of us just $85 in the hole -- a complete value in this fine city!", "rating": 5, "date": "2014-10-22"}, {"excerpts": ["Their Bufalina pizza was pricey for the size but absolutely delicious. ", "Surprised at the jump in price since a regular  and delicious Margherita pizza is just $13 but if you get the buffalo mozzarella on it instead (making it a Bufalina) it is bumped up to $18!!! "], "author": "Shay S.", "review": "Absolutely delicious and authentic ITALIAN pizza. (Not American). Their Bufalina pizza was pricey for the size but absolutely delicious. Surprised at the jump in price since a regular  and delicious Margherita pizza is just $13 but if you get the buffalo mozzarella on it instead (making it a Bufalina) it is bumped up to $18!!! But absolutely fantastic pizza that is incomparable in the Bay Area. \n\nAlso, the pizza comes out super fast. After they make it, it only goes into the oven for like 1 minute !", "rating": 5, "date": "2015-01-11"}], "marinara pizza": [{"excerpts": ["We ordered a margarita and the marinara pizza which was made right in front of us while we sat in the bar.  ", "What was amazing to us is that the the pizzas literally only cooked for about 30 seconds in the oven. ", "The pizzas were meh overall. ", "They looked amazing but the taste and flavor wasn't really there. ", "The sauce wasn't amazing but the cheese on the margarita was good. "], "author": "Ashley F.", "review": "After seeing such positive reviews for Il Casaro, my husband and I stopped in here to get some pizza one night while we were in the area. We ordered a margarita and the marinara pizza which was made right in front of us while we sat in the bar.  What was amazing to us is that the the pizzas literally only cooked for about 30 seconds in the oven. The pizzas were meh overall. They looked amazing but the taste and flavor wasn't really there. The sauce wasn't amazing but the cheese on the margarita was good. The service was also just fine, nothing amazing, just fine.\n\nOverall, Il Casaro was just alright and we probably would try somewhere new before we would come back here again.", "rating": 3, "date": "2018-04-13"}, {"excerpts": ["We ordered: burrata mozzarella, margherita pizza, marinara pizza, bucatini pasta.\n\n"], "author": "Vanessa M.", "review": "After walking around Little Italy, we decided to give this place a try based from high yelp rec plus the food looked good front he outside ;-) we were told around the area that they have the closest pizza to Naples style pizza. \n\nWe were seated right away (feeling thankful on a busy Saturday afternoon).  We placed our order and requested for it to all come at the same time. \n\nWe ordered: burrata mozzarella, margherita pizza, marinara pizza, bucatini pasta.\n\nHaving just gone back from a trip to Italy we were ready for some pizza and this place delivered. The dough is thin, tasty and the tomato sauce is superb. Why did this remind us of an authentic Napoli pizza? The center is soft, tender and the cheese is soupy in the middle- yummy. We would definitely come back to try all the other pizza. \n\nThe burrata was creamy and soft. My boys devoured it and claimed it to be so close to the ones they had in Italy. \n\nThe bucatini pasta was aldente. The sauce was perfectly balanced by a hint of sweetness from the onions. We cleaned off the bowl with our pizza dough. \n\nOverall, really good place to eat and experience oven wood pizza Napoli style. The place has more of an upscale, hip vibe to it that we did feel a bit out of place (with 2 boys with us). Seems like the manager was walking and talking to everyone but  never managed to acknowledge us- which is fine, we had a great server (May have been the busy Saturday afternoon too). \n\nOverall, I give it 4 stars. Our pizza came much later after we've already finished our other 2 meals (we were sharing all the meals). Our meal came to $55. \n\nGreat Napoli style pizzas.", "rating": 4, "date": "2016-05-08"}, {"excerpts": ["I usually get marinara pizza with fresh Parmesan cheese and olives. ", "We also sometimes get carbonara pasta which usually has fettuccine. ", "True Italians and they have a somewhat laid-back attitude toward service, but they are always friendly and willing to help. ", "I've never had a bad meal here. ", "I noticed the last time we visited they added asparagus cooked in the pizza oven, talk about delicious!!!"], "author": "David A.", "review": "I'm always really happy to come to this spot...it's one of the real Italian experiences. They have a wonderful woodfired pizza oven that produces fresh pizza in no time. I usually get marinara pizza with fresh Parmesan cheese and olives. We also sometimes get carbonara pasta which usually has fettuccine. True Italians and they have a somewhat laid-back attitude toward service, but they are always friendly and willing to help. I've never had a bad meal here. I noticed the last time we visited they added asparagus cooked in the pizza oven, talk about delicious!!!", "rating": 5, "date": "2017-01-22"}, {"excerpts": ["They have a marinara pizza listed with ingredients other that just sauce and garlic. ", "HUH? ", "What kind of marinara pizza is that? \n\n"], "author": "Tom T.", "review": "Very disappointed. A friend said there was this new pizzeria and it was OK. Not great, OK. I agree. They have a wood-fired oven which is good.\n\nI got a seat at the counter and enjoyed watching the pizzaiolo make the pizze. It took a while to get a menu and order. I ordered the pizza magrherita and a beer. They have like six beers on tap and two in bottles but the waiter said they were out of all the beers except for Sierra Pale Ale. How can you be out of seven beers?\n\nI saw they were slicing the pizze before delivery. How odd, I thought. So, I leaned toward the glass and told the pizzaiolo that I didn't want my pizza cut. So, naturally, he cut it and handed it to me over the glass. I should have refused it, but I didn't. Big mistake. The reason you don't cut the pizza is so that the soggy middle doesn't seep under the crust and make it soggy and that's exactly what happened. \n\nAlso, for my taste, it was a little too undercooked and doughy. They have a marinara pizza listed with ingredients other that just sauce and garlic. HUH? What kind of marinara pizza is that? \n\nThe price was OK at $13.00 for the pizza and $6.00 for the beer.\n\nThe search continues for authentic Napolitano pizza in San Francisco. Obviously, it's not here and I will never go back.", "rating": 1, "date": "2014-09-01"}], "norma pizza": [{"excerpts": ["For our food, we shared an order of olives (which were large and flavorful, and a huge portion for $5!); an order of burrata (also a huge portion and tasty, served with flat bread that was a similar consistency to the pizza dough); and a Norma pizza. ", "We loved everything, although the eggplant on the Norma wasn't really doing much to enhance the flavor of the slice. ", "The crust had the perfect amount of bite and chewiness, and the cheese and sauce were flavorful and nice complements to each other. ", "This was some of the best Neopolitan style pizza I've had in SF! "], "author": "Christine G.", "review": "What's not to like about Il Casaro? Even though it's busy, wait times are short; portions are generous; the pizza is delicious; and prices are very reasonable!\n\nCame here with a friend last weekend and had a great experience. They don't take reservations but will tell you how the line is looking if you call ahead. We were seated within 10 minutes of arrival. \n\nFor our food, we shared an order of olives (which were large and flavorful, and a huge portion for $5!); an order of burrata (also a huge portion and tasty, served with flat bread that was a similar consistency to the pizza dough); and a Norma pizza. We loved everything, although the eggplant on the Norma wasn't really doing much to enhance the flavor of the slice. The crust had the perfect amount of bite and chewiness, and the cheese and sauce were flavorful and nice complements to each other. This was some of the best Neopolitan style pizza I've had in SF! Pizzas are 12\" and we felt like this was plenty of food for two people, so we opted to share one instead of get two, and definitely didn't need a second. \n\nWe also shared a bottle of house red (that day it was nero d'avola) for just $30! With tip, we each paid less than $40 for what felt like a feast. The ambience is nice: a casual bistro type setting with regular height and high top tables, centered around the brick oven. There's plenty of bar seating too.", "rating": 5, "date": "2018-06-06"}, {"excerpts": ["(Got a Norma Pizza)\n", "Also had Buratta for the first time ...loved it"], "author": "Prateek R.", "review": "One of the best thin crust pizzas I have ever had ...PERIOD!!! (Got a Norma Pizza)\nAlso had Buratta for the first time ...loved it", "rating": 5, "date": "2018-08-14"}, {"excerpts": ["Norma pizza was a basic Margarita pizza topped with eggplant. ", "Simple flavors, yet delicious. ", "But it was a lot more soggy than Prosciutto pizza....  ", "Along side the pizzas, there were red chili soaked in spicy oil. ", "It was SO GOOD! ", "Gives the pizza a great kick of spice. ", "Norma pizza ($15.75) - mozzarella, tomato sauce, ricotta salata, fried eggplant"], "author": "Victoria L.", "review": "Food: 5/5       Price:3/5            Service:4/5            Ambience: 5/5\n\n*** MICHELIN Guide 2017 ***\n\nA modern looking Italian restaurant in Little Italy. Probably one of the only few Italian places around here that have great reviews and don't have a long wait. (Tony's and other places are 1.5+ hr) We were seated as soon as we got in, ordered our food, and the pizzas came within 5 minutes :)\n\nThe restaurant has its giant open windows to the street, so you can feel the breeze and see the people walking by. Very comfortable and welcoming. If you are lucky, you can even get a seat at the bar counter where you can watch the chefs roll out the pizzas and bake them in a wood oven. \n\nWe ordered 2 pizzas, Prosciutto and Norma. The size was a lot smaller than I expected, based off the price. Both pizza crust were very thin and soggy.  I could hardly pick up a piece without letting all the toppings drip and fall down my hand. However, the flavors were really good. \n \nWe especially enjoyed the Prosciutto pizza.  Prosciutto was very flavorful. In addition to the amazing melted mozzarella, the pizza was topped with large pieces of unmelted shredded cheese -  surprisingly good! Norma pizza was a basic Margarita pizza topped with eggplant. Simple flavors, yet delicious. But it was a lot more soggy than Prosciutto pizza....  Along side the pizzas, there were red chili soaked in spicy oil. It was SO GOOD! Gives the pizza a great kick of spice. When you're done with the middle part of your pizza slice, dip the end crust into the spicy oil - trust me, you will leave no crusts behind! \n\nOverall, fairly delicious pizza restaurant with great atmosphere. It's a great place to go if you cannot bear the wait at the other famous pizza restaurants.  \n\n\nFavorites: \n* Prosciutto pizza ($18.75) - San Daniele prosciutto, arugula, tomato sauce, mozzarella, cheese\n\nOther orders: \n* Norma pizza ($15.75) - mozzarella, tomato sauce, ricotta salata, fried eggplant", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["We ordered two pizzas and asked for extra eggplant on the Norma Pizza and extra sauce on the Capricciosa Pizza.  ", "The Norma was excellent.  ", "The other was tasty but with the extra sauce, it got soggy fast.  ", "Note:  ", "Don't be greedy and ask for extra sauce.  ", "It'll ruin your pie.  "], "author": "Veritas V.", "review": "Decided to take a break from working late last night and walked over to NB.  We ordered two pizzas and asked for extra eggplant on the Norma Pizza and extra sauce on the Capricciosa Pizza.  The Norma was excellent.  The other was tasty but with the extra sauce, it got soggy fast.  Note:  Don't be greedy and ask for extra sauce.  It'll ruin your pie.  For the extra sauce and extra eggplant, they tacked on an extra $2.50.\n\nI must admit that the novelty of the restaurant has worn off.  I like it and have frequented the place about 5 times.  Now I'm moving on.  I may come back in 6 months to check it out but there are just so many pizza joints out there.\n\nArrivederci!  See you next year!", "rating": 3, "date": "2014-07-23"}, {"excerpts": ["My husband and I shared the Norma pizza and Spaghetti Carbonara, delicious. ", "The best part of our meal was the mozzarella appetizer! "], "author": "Lindsay Y.", "review": "We were so impressed by this little spot! The menu is small, but perfect! My husband and I shared the Norma pizza and Spaghetti Carbonara, delicious. The best part of our meal was the mozzarella appetizer! I will dream about the perfect balance of olive oil, saltiness, and texture. We almost returned the next day, but had other reservations! We will definitely return!", "rating": 5, "date": "2015-10-19"}, {"excerpts": ["Had the Norma pizza (eggplant!) and added an egg on top, Salami plate, and short rib pasta... sososos good!!!! ", "Sit at the bar as you'll have the best view in the house watching the chefs make pizzas. ", "Love this spot!"], "author": "Joanne O.", "review": "Found this spot walking around the neighborhood and it was meant to be. My god, best pizza I've had in awhile. Everything tasted so fresh! Had the Norma pizza (eggplant!) and added an egg on top, Salami plate, and short rib pasta... sososos good!!!! Sit at the bar as you'll have the best view in the house watching the chefs make pizzas. Love this spot!", "rating": 5, "date": "2015-05-21"}, {"excerpts": ["Had the burrata, prosciutto pizza, margherita pizza, and Norma pizza. ", "The staff was wonderful and the food was great, can't ask for much more!"], "author": "Sarah B.", "review": "This place is delish! Had the burrata, prosciutto pizza, margherita pizza, and Norma pizza. The staff was wonderful and the food was great, can't ask for much more!", "rating": 5, "date": "2015-05-02"}, {"excerpts": ["And the Norma pizza.... ", "The only suggestion for improvements I would make is spicing up the sauce on the pizza a bit.... ", "The crust was outstanding! ", "For dessert.... ", "Pistachio gelato was creamy and smooth. ", "We took a 4 cheese pizza with broccoli rabe to go. ", "Also delicious."], "author": "Carol B.", "review": "Walked from the Omni Hotel.  small, but VERY lively, pizza plus kind of place.  Wines were excellent..Augustina, our server, went above and beyond in the packed restaurant helping us with wine selection..... Let us taste 3 different kinds.  We got the Aracini as an appetizer.... Yummy!  Then, we shared the lasagna made with homemade noodles.... Fabulous..... And the Norma pizza.... The only suggestion for improvements I would make is spicing up the sauce on the pizza a bit.... The crust was outstanding! For dessert.... Pistachio gelato was creamy and smooth. We took a 4 cheese pizza with broccoli rabe to go. Also delicious.", "rating": 5, "date": "2015-03-13"}], "broccoli and salsiccia pizza": [], "tonno and cipolla": [], "calzone pizza": [{"excerpts": ["We got a plate of prosciutto, and a Calzone pizza to share. ", "We were surprisingly amazed by the taste of the pizza, far away from greasy, and perfectly cook. ", "The atmosphere is cool, even it's noisy. ", "Love the fact that we were seating at the bar and could watch the preparation of the pizza. ", "Great experience, I'll be back for sure"], "author": "Lauu H.", "review": "Amazing Italian restaurant in Chinatown! \nWe got a plate of prosciutto, and a Calzone pizza to share. We were surprisingly amazed by the taste of the pizza, far away from greasy, and perfectly cook. The atmosphere is cool, even it's noisy. Love the fact that we were seating at the bar and could watch the preparation of the pizza. Great experience, I'll be back for sure", "rating": 5, "date": "2018-05-30"}, {"excerpts": ["I am a huge fan of Calzone pizza and they probably have the best in the city! ", "I highly recommend this place. ", "I found this place thanks to a food blogger in the city, and now I feel like everyone should know about this restaurant!! ", "Their pizza taste like the one you can find in Europe, very authentic, very traditional! ", "I recommend!"], "author": "Looblue L.", "review": "Best pizza place ever! I am a huge fan of Calzone pizza and they probably have the best in the city! I highly recommend this place. I found this place thanks to a food blogger in the city, and now I feel like everyone should know about this restaurant!! Their pizza taste like the one you can find in Europe, very authentic, very traditional! I recommend!", "rating": 5, "date": "2018-04-04"}, {"excerpts": ["We also ordered the Calzone pizza, which was pretty good too (but not nearly as heavenly as the Burrata)."], "author": "Yu Sheng T.", "review": "You HAVE to order the Imported Burrata! It's really really really awesome. \n\nWe also ordered the Calzone pizza, which was pretty good too (but not nearly as heavenly as the Burrata).", "rating": 4, "date": "2014-12-28"}], "panna cotta and raspberry": [], "san pellegrino aranciata": [], "baladin cedrata": [], "la nostra gazosa lemon": [], "la nostra gazosa quinotto": []}