{"unique and delicious": [], "only the best will do": [], "taste": [{"excerpts": ["Didn't taste as bitter as other nitros around town."], "author": "Adam B.", "review": "Love the outdoor seating in that little building alley.  Combined with beverages served in actual glasses, it makes for quite an urbane coffee break.  While the coffee is on point, the snacks could use a little work.\n\nBlack & White Whoopie Pie: The cakes tasted a little stale.  The cream was a bit tangy like Red Velvet frosting.  It was a rather unexciting use of afternoon snack calories.\n\nMeyer Lemon Bar: A lot better than I expected.  Quite smooth and tangy, with mostly filling and only a little crust (just the way I like).  Also, it didn't have that funky sour milk smell that a lot of lemon curd has.\n\nCaffè Mocha: Nowhere near as sweet as the equivalent at Starbucks.  But I'm ok with that since it lets you still appreciate the coffee.  The largest size available is a medium, but is just the right size to sit and enjoy from a proper glass at the cafe.\n\nNitro Coffee: This was quite foamy, like a Guinness.  Went down very smoothly.  Didn't taste as bitter as other nitros around town.", "rating": 3, "date": "2018-08-28"}, {"excerpts": ["Now I totally understand that everyone's taste for coffee is different. ", "But this has to be the smoothest espresso beverage I've had in a long time. ", "No bitterness; not too grainy; and not too acidic. ", "Perfectly balanced. ", "Have an Illy macchiato and then sip on a Starbucks macchiato. "], "author": "Kevin B.", "review": "Now THIS is a real European cafè!\n\nCame here for a quick caffeine fix after a FiDi meeting. I ordered a double macchiato. Now I totally understand that everyone's taste for coffee is different. But this has to be the smoothest espresso beverage I've had in a long time. No bitterness; not too grainy; and not too acidic. Perfectly balanced. Have an Illy macchiato and then sip on a Starbucks macchiato. You'll quickly see that there's simply no comparison.\n\nMy barista couldn't have been friendlier. He actually engaged me in conversation while he rang up my order. Asked me how my day was going, and inquired about my plans for the weekend. \n\nThere's plenty of comfy indoor and outdoor seating. You'll find a nice mix of people sipping and chatting away. Best of all, it's relatively quiet, so you can actually have a conversation without shouting over a loud espresso machine. This place just has a comfy, chill vibe to it. You almost forget that you're in the heart of downtown with cars buzzing down California and Battery streets. \n\nIf coffee isn't your thing, they also have a nice assortment of teas, cold beverages (including Hint water - my favorite!), and a decent selection of pre-made sandwiches and salads.\n\nIf you're in the Financial District and need a coffee break, pay a visit to Illy Cafe.", "rating": 4, "date": "2018-01-13"}, {"excerpts": ["The choice of blend Illy has for their espresso creates this unique taste of espresso I've never had before. ", "Within a a couple minutes (even though there was quite a line) my drink was crafted. ", "I ordered a wet cap. ", "The foam was delicately light and just the perfect temperature. ", "I would definitely come here again and encourage everyone I meet to come by."], "author": "Gabriel P.", "review": "Amazing quaint Illy café spot. Baristas and Cashiers all smiling and greeted me as soon as I walked into the café. Kelvin helped me out with my order and began to create my drink with precise artistic perfection. The choice of blend Illy has for their espresso creates this unique taste of espresso I've never had before. Within a a couple minutes (even though there was quite a line) my drink was crafted. I ordered a wet cap. The foam was delicately light and just the perfect temperature. I would definitely come here again and encourage everyone I meet to come by.", "rating": 5, "date": "2017-04-17"}, {"excerpts": ["The taste is a lot stronger than Starbucks, but I haven't tried anything else yet! ", "The shop is clean and has plenty of spots to sit inside and outside. ", "The guy who took my order was a cheerful young lad. ", "Their pastries looked good ", "so I will make sure to grab one of those next time as well! ", "Overall, it was stronger than I'm used to, but I will definitely drop by again!"], "author": "James R.", "review": "Pretty nice little coffee shop here! I came by today on my lunch when I stumbled across this place. I ordered a double macchiato and boy did it hit STRONG! I am still buzzing off of it. The taste is a lot stronger than Starbucks, but I haven't tried anything else yet! The shop is clean and has plenty of spots to sit inside and outside. The guy who took my order was a cheerful young lad. Their pastries looked good so I will make sure to grab one of those next time as well! Overall, it was stronger than I'm used to, but I will definitely drop by again!", "rating": 4, "date": "2015-04-07"}, {"excerpts": ["I'm no connoisseur, so my taste buds are still getting used to the bitterness of straight espresso. ", "They have a variety of pretty cups and glasses that they serve you "], "author": "Shirley V.", "review": "The first espresso machine that I received as a gift from my boyfriend came with a red topped can of Illy espresso beans. Ever since, I've had a little bit of a bias when it comes to Illy.\n\nEspressamente Illy looks pretty new, very clean, organized, contemporary, almost sterile. The workers are attentive and work quickly. I had a single espresso. I'm no connoisseur, so my taste buds are still getting used to the bitterness of straight espresso. They have a variety of pretty cups and glasses that they serve you drinks if you don't take it to go. \n\nThey had an array of pretty cans of beans on the side of the store. I was tempted to buy one when I remembered I still have two bags of recently roasted beans from a different local roaster that I didn't want to go to waste (I'm a bean hog, sigh). \n\nDelicious sounding cafe lattes on their menu included jasmine vanilla, clove vanilla, and lavender mint. They also have mini lattes, filter brewed coffee, and cold specialties (I have yet to find out what a Freddo Greco is). \n\nI might revisit if I were in the area again. I hope they carry more items in the future, like tamps and freddo glasses for sale.", "rating": 4, "date": "2013-04-02"}, {"excerpts": ["Whenever I'm in the mood for fine coffee that taste velvet smooth and rich, Espressamente illy is the place to go.  \n\n"], "author": "Jenny T.", "review": "Espressamente illy!  Espressamente illy! Espressamente illy! Espressamente illy! Espressamente illy! \n\nI feel so Italian after saying this name 5 times :)\n\nI've been a fan of Illy's coffee since it popped into this neighborhood.  The shop is a tiny take-out spot.  They serve dainty sized sandwiches and all kinds of fine pastries to please the palate.  Their red velvet stuffed with cream cheese fillings was scrumptious with my cup of freshly brewed coffee.  Whenever I'm in the mood for fine coffee that taste velvet smooth and rich, Espressamente illy is the place to go.  \n\nThis is my all time favorite coffee and I've actually bought several canisters of their coffee for home enjoyment also.  Whenever I see Illy's coffee being served at other establishments, I tend to drool a little.  \n\nGet your Italian on and Espressamente illy yourself!", "rating": 5, "date": "2013-01-30"}, {"excerpts": ["I ordered the lavender mint latte ($4 for a small) which had a nice & mild mint and hint of lavender taste ", "(I know it sounds weird, but it is good!). ", "The coffee flavor was more subtle making this drink a good choice for those who don't really like coffees and like more tea-like drinks. ", "The drink came out at the perfect temp- not too hot and I didn't have to wait for it to cool. ", "I really liked this drink! ", "If I worked in Fidi & had the salary I would order this quite often :P"], "author": "Emily C.", "review": "3.75 stars for the clean & sleek, but expensive coffee shop. The decor is nice and the red adds a bolder look than the mellow tones most coffee shops have. The staff is friendly. \n\nI ordered the lavender mint latte ($4 for a small) which had a nice & mild mint and hint of lavender taste (I know it sounds weird, but it is good!). The coffee flavor was more subtle making this drink a good choice for those who don't really like coffees and like more tea-like drinks. The drink came out at the perfect temp- not too hot and I didn't have to wait for it to cool. I really liked this drink! If I worked in Fidi & had the salary I would order this quite often :P", "rating": 3, "date": "2013-01-05"}, {"excerpts": ["but they taste pretty good. ", "During my first couple visits, I didn't know what to order and always ordered the wrong  drink because their drinks had some distinct names. ", "They told us that their store was actually different from other Illy cafes ", "so they don't have the shakerato. ", "I once got this iced latte drink that I wasn't used to and they made me another drink free of charge which was really generous of them ", ":)\n", "Their new tiramisu was FABULOUS! ", "We tried it with ans without the espresso shot ", "and it definitely tastes wonders after drizzling with espresso. ", "Highly recommend everyone to try this."], "author": "Judy C.", "review": "A little pricey for drinks but they taste pretty good. During my first couple visits, I didn't know what to order and always ordered the wrong  drink because their drinks had some distinct names. They told us that their store was actually different from other Illy cafes so they don't have the shakerato. I once got this iced latte drink that I wasn't used to and they made me another drink free of charge which was really generous of them :)\nTheir new tiramisu was FABULOUS! We tried it with ans without the espresso shot and it definitely tastes wonders after drizzling with espresso. Highly recommend everyone to try this.", "rating": 4, "date": "2012-09-03"}, {"excerpts": ["The taste is smoother than a punch, but the strong current still electrifies you afterwards.\n\n"], "author": "T L.", "review": "(See pics)\n\nReview #1073.\n\nWell, generally when you have an espresso, it's a quick shot with a couple sips and you are on the go. Usually it will be at a long counter with the whole row of espresso cups lined up with all the patrons come and grab one.\n\nThis is more like a fancy cafe where if you want to sit and enjoy a conversation with some pastries. The way they take out the pastries is like taking out some jewel from the glass case (in this case I think it's plastic but looks sparkling translucent), delicately. I have to admit, the fancy way how the case door opens up, instead of more typical sliding door, is like opening a lambo vs a cab door. Because, also then, the cafe has lots and lots of space.\n\nItalian beans, in my books, are lighter roast and more delicate. The taste is smoother than a punch, but the strong current still electrifies you afterwards.\n\nI had a cannoli and it was also very, very delicious. This is the kind of cafe where you can enjoy a breakfast jolt, an afternoon pick-me-up, or a late mellow out afternoon.", "rating": 4, "date": "2011-12-10"}, {"excerpts": ["I ordered my usual cortado to test the espresso taste and milk texture; not bad but the steamed milk came out a bit more on the foamier side."], "author": "Randall C.", "review": "The setup encourages customers to walk through as they come in order and receive. While there is some seating, it's definitely not a place to sit and camp out. Like another reviewer has mentioned the process of having customers sign a receipt with a tip line just for a cup of coffee seems silly, especially for an \"in and out\" type of place. I ordered my usual cortado to test the espresso taste and milk texture; not bad but the steamed milk came out a bit more on the foamier side.", "rating": 3, "date": "2016-10-18"}, {"excerpts": ["It could just be my own personal taste, but I really didn't like it at all! ", "It literally tasted like I was drinking a cup of milk with soap. ", "However, after a couple of sips, I ended up drinking it all since it was an expensive cup of coffee! ", "A friend of mine ordered the Clover Latte, and that tasted like cigarettes in a cup. "], "author": "Jennifer R.", "review": "I'd call this place an \"upscale coffee shop.\" It's right in the middle of the city, so it's a nice place to stop by while you're shopping or for a little break during work. \n\nI wanted to try their Lavender Latte since people had mentioned how good it tastes. I was a little hesitant since I'm a huge coffee lover, but ordered it after talking to the Barista about it. \n\nIt could just be my own personal taste, but I really didn't like it at all! It literally tasted like I was drinking a cup of milk with soap. However, after a couple of sips, I ended up drinking it all since it was an expensive cup of coffee! A friend of mine ordered the Clover Latte, and that tasted like cigarettes in a cup. Again we may just not like those flavors which is why we didn't like it, but if you love your drip coffee, those lattes may not be the best for you. \n\nOverall I think this place is worth trying, but I don't think I'd come here again.", "rating": 3, "date": "2013-01-17"}, {"excerpts": ["mint taste wasn't too apparent but the lavender was lovely. ", "just a slight hint of it in my coffee. ", "delicious. "], "author": "Susy C.", "review": "illy aficionados rejoice. espressamente exists.\nsure, illy isn't up there like Philz, Peets, Blue Bottle etc. \nstill, I have a great amount of love for illy. especially for their canned coffees. perfect for the mornings I'm late to leave for work and I don't have time to brew when I get to the office. their canned drinks are strong enough to keep a caffeine junkie like myself functioning (don't even bother with the starbucks double shot, that thing is garbage). \n\nhad the lavender mint latte. mint taste wasn't too apparent but the lavender was lovely. just a slight hint of it in my coffee. delicious. my latte was not overly sweet either (which is something i'm a little concerned about with flavored drinks)\n\nquaint little spot to drop in if you're in the area and need some decent caffeine.\n\nI also want to add that this is not the place for you if you want a vente triple non fat extra foam no whip nonsense bullshit. don't bother. \n\nthis place?\n\nyou sit and have your espresso/coffee then GO.\nyou stand and have your espress/coffee then GO.\n\ntrue to the Italian roots eh?", "rating": 5, "date": "2012-03-08"}, {"excerpts": ["I have to say that my taste buds responded to a regular latte better than to any other lattes, but they were all very good."], "author": "Dasha B.", "review": "illy coffee holds a special place in my heart.\n\nEspressamente is a great place to sit down and enjoy a cup of coffee with a desert.  Now, because I love lattes, I've had every single kind of lattes on their menu.  I have to say that my taste buds responded to a regular latte better than to any other lattes, but they were all very good.", "rating": 5, "date": "2013-03-25"}, {"excerpts": ["Can't taste the lavender flavor but a bit different from the normal latte. ", "The seating here is limited so don't expect to come with a few people."], "author": "Ashley C.", "review": "Tried their lavender latte. Didn't quite like it. Can't taste the lavender flavor but a bit different from the normal latte. The seating here is limited so don't expect to come with a few people.", "rating": 3, "date": "2014-03-17"}, {"excerpts": ["Decor is lovely and products are good but that price leaves a rather bitter after taste.\n", "Decor is lovely and products are good but that price leaves a rather bitter after taste."], "author": "Mark Anthony H.", "review": "Pretty mega expensive!\n\nIlly is quote common to find in the UK and is generally one of the better coffee shops but here it would seem it comes with an incredible markup for very small coffees. Decor is lovely and products are good but that price leaves a rather bitter after taste.\nPretty mega expensive!\n\nIlly is quote common to find in the UK and is generally one of the better coffee shops but here it would seem it comes with an incredible markup for very small coffees. Decor is lovely and products are good but that price leaves a rather bitter after taste.", "rating": 3, "date": "2012-09-26"}], "geography and history of coffee": [], "the coffee plant": [], "from flower to bean": [], "blending and roasting": [], "packaging": [], "the benefits of coffee": [], "the coffee ritual": [], "the five senses": [], "expresso": [{"excerpts": ["I would stick with the regular expresso drinks, the specialty ones aren't that great.\n\n"], "author": "Angela D.", "review": "Solid drink and food selection. I like the mini croissant sandwiches, perfect snack.\n\nI would stick with the regular expresso drinks, the specialty ones aren't that great.\n\nService is quick and this place is convientely located under my office.", "rating": 4, "date": "2015-02-11"}, {"excerpts": ["Espressamente lily looks like a leftover corner diamond  parcel converted into a coffee shop\n\nmenu: expresso, coffee, paninis, pastries, salads.\n\n"], "author": "Victor G.", "review": "Espressamente lily looks like a leftover corner diamond  parcel converted into a coffee shop\n\nmenu: expresso, coffee, paninis, pastries, salads.\n\npour(m, lily 2.5)\n-very smooth, bold swig, no harshness at all. 5 stars\n-fresh tasting\n\ndrips:\n-just a few seats/tables for sitdown (thus only 4 stars)\n-so narrow here seats get in the way of people trying to order\n-fastm efficient, courteous service.\n-no parking around.", "rating": 4, "date": "2013-01-10"}], "moka": [], "napoletana": [], "brewed coffee": [{"excerpts": ["They also have mini lattes, filter brewed coffee, and cold specialties (I have yet to find out what a Freddo Greco is). \n\n"], "author": "Shirley V.", "review": "The first espresso machine that I received as a gift from my boyfriend came with a red topped can of Illy espresso beans. Ever since, I've had a little bit of a bias when it comes to Illy.\n\nEspressamente Illy looks pretty new, very clean, organized, contemporary, almost sterile. The workers are attentive and work quickly. I had a single espresso. I'm no connoisseur, so my taste buds are still getting used to the bitterness of straight espresso. They have a variety of pretty cups and glasses that they serve you drinks if you don't take it to go. \n\nThey had an array of pretty cans of beans on the side of the store. I was tempted to buy one when I remembered I still have two bags of recently roasted beans from a different local roaster that I didn't want to go to waste (I'm a bean hog, sigh). \n\nDelicious sounding cafe lattes on their menu included jasmine vanilla, clove vanilla, and lavender mint. They also have mini lattes, filter brewed coffee, and cold specialties (I have yet to find out what a Freddo Greco is). \n\nI might revisit if I were in the area again. I hope they carry more items in the future, like tamps and freddo glasses for sale.", "rating": 4, "date": "2013-04-02"}, {"excerpts": ["Their red velvet stuffed with cream cheese fillings was scrumptious with my cup of freshly brewed coffee.  "], "author": "Jenny T.", "review": "Espressamente illy!  Espressamente illy! Espressamente illy! Espressamente illy! Espressamente illy! \n\nI feel so Italian after saying this name 5 times :)\n\nI've been a fan of Illy's coffee since it popped into this neighborhood.  The shop is a tiny take-out spot.  They serve dainty sized sandwiches and all kinds of fine pastries to please the palate.  Their red velvet stuffed with cream cheese fillings was scrumptious with my cup of freshly brewed coffee.  Whenever I'm in the mood for fine coffee that taste velvet smooth and rich, Espressamente illy is the place to go.  \n\nThis is my all time favorite coffee and I've actually bought several canisters of their coffee for home enjoyment also.  Whenever I see Illy's coffee being served at other establishments, I tend to drool a little.  \n\nGet your Italian on and Espressamente illy yourself!", "rating": 5, "date": "2013-01-30"}], "turkish coffee": [], "french press": []}