{"organic golden tip black tea": [], "organic lavender green": [], "organic dragon well": [], "organic sencha": [], "organic rooibos": [{"excerpts": ["Being sensitive to caffeine, I got the organic rooibos (an herbal tea), and it was steeped from a tea bag with a kettle of hot water. ", "The tea was warming and calming, and on the side, we got the chicken and lamb dumplings to nibble on, along with the snack platter consisting of almonds and two different kinds of cookies. ", "The food that we tried was not particularly special, and everything was pricey for what you got. ", "Nevertheless, this was a nice place to sit and chat, and our server was friendly and took the time to explain the teas to us!"], "author": "David K.", "review": "What a lovely setting for some nice conversation over tea and snacks! The tables and decorations here are beautiful and oriental. Being sensitive to caffeine, I got the organic rooibos (an herbal tea), and it was steeped from a tea bag with a kettle of hot water. The tea was warming and calming, and on the side, we got the chicken and lamb dumplings to nibble on, along with the snack platter consisting of almonds and two different kinds of cookies. The food that we tried was not particularly special, and everything was pricey for what you got. Nevertheless, this was a nice place to sit and chat, and our server was friendly and took the time to explain the teas to us!", "rating": 3, "date": "2017-08-31"}], "organic cloud mist": [], "organic tea sampler": [], "organic yunnan mao feng": [], "organic ceylon": [], "organic gunpowder": [], "organic english breakfast": [], "superior white peony": [], "imperial white peony and rose petals": [], "imperial white peony": [], "imperial silver needle jasmine": [{"excerpts": ["Steep (and steeped...ba-dum-bum) at $5 for the presentation, the premium Imperial Silver Needle Jasmine has a soothing delicate flavor, nothing like a Lipton's tea bag. ", "Since I was rather peckish, I also went for the $6 Snack Sampler, a plate of four types of nuts...imperial spice raisins, roasted almonds, green tea pumpkin seeds, and my personal favorite, the green tea walnuts. ", "Yeah, it was bird seed, but it seem to fit. ", "If they served hot food, it was not readily apparent. "], "author": "Ed U.", "review": "Smell the tea!...SMELL THE TEA!\n\nThe server will insist you do so, for it will soothe your soul with the elixir of Confucius. OK, they don't make that big a ta-dah of it, but I think they should do a show here like Teatro Zinzanni and have a female impersonator play Shanghai Lil with her fishnet beret and mysterious manner. She could go around singing \"Slow Boat to China\" with a Marlene Dietrich accent and pour arsenic in our tea cups from her golden dragon ring. They provide the opium den decor with the expensive-looking Chinese chairs, tables and room arches.\n\nI have to admit I was rather confused as to what to do when I entered...go to the counter to order?...grab a table and  hope for a server with a menu?...whisper government secrets to the waitress that will ensure Chinese political and economic domination of the world and bring the Bush administration to its knees? I went for the table...and waited...and waited. I think the Cultural Revolution was over with by the time she came.\n\nI decided I needed to go authentic so I went for the Gaiwan Tea Presentation, which amounted to a big pot of hot water, a covered tea cup, the above mentioned smell test and specific instructions on how to drink the tea...I felt like I was attending a special school for the tea leaf-challenged...perhaps making me a candidate for the Special Olympics if I could stop throwing a ball like a girl.\n\nSteep (and steeped...ba-dum-bum) at $5 for the presentation, the premium Imperial Silver Needle Jasmine has a soothing delicate flavor, nothing like a Lipton's tea bag. Since I was rather peckish, I also went for the $6 Snack Sampler, a plate of four types of nuts...imperial spice raisins, roasted almonds, green tea pumpkin seeds, and my personal favorite, the green tea walnuts. Yeah, it was bird seed, but it seem to fit. If they served hot food, it was not readily apparent. If you ever want to live out a Pearl Buck novel, this may be just the place for you.\n\nTEA and NUTS - 4 stars...flavorful in that oh-so-exotic way, a bit pricey\nAMBIANCE - 4 stars...Charlie Chan went that-away!\nSERVICE - 2.5 stars...quietly zen about their tea and really slow\nTOTAL - 3 stars...Shanghai Lily has a message for you...\"You just missed your ferry, Mac\"", "rating": 3, "date": "2007-02-24"}], "china white w chrysanthemum": [], "imperial silver needles": [], "jun shan yin zhen": [], "huoshan huang ya": [], "yunnan puerh": [], "special reserve puerh": [], "topaz puerh": [{"excerpts": ["I ordered the Topaz Puerh - described as \"An especially full-bodied gold-tip Puerh tea with superior richness, depth of color and a long, smooth finish.", "\" ", "It was smoky and nutty but extremely pure! ", "Very good - almost used an entire pot of very hot water with it. "], "author": "Mariangela S.", "review": "Had a delicious late tea here on Sunday afternoon. I ordered the Topaz Puerh - described as \"An especially full-bodied gold-tip Puerh tea with superior richness, depth of color and a long, smooth finish.\" It was smoky and nutty but extremely pure! Very good - almost used an entire pot of very hot water with it. My companion ordered the Imperial Green Tea, served with less hot water, described as \"Striking leaves with enchanting floral aroma and unexpected depth of flavor\".\n\nCan't wait to try more!", "rating": 5, "date": "2005-08-22"}], "preferred puerh": [], "edition superior puerh": [], "imperial puerh": [], "heritage edition lapsang souchong non smoky": [], "aged hong mei mao feng": [], "asian paradise blend": [], "superior yunnan black": [], "select yunnan black": [], "imperial keemun mao feng": [], "imperial chai": [{"excerpts": ["I settled on their imperial chai and imperial jasmine pearls while my friend took a few ounces of the cloud mist. \n\n"], "author": "Liz K.", "review": "While wandering around the ferry building one day I happened to wander in here. I didn't intend on purchasing any teas, but after smelling many of them, I knew I couldn't walk out with at least a *little* something. \n\nI settled on their imperial chai and imperial jasmine pearls while my friend took a few ounces of the cloud mist. \n\nThe tea is very good, especially the chai - no bitter aftertaste like you get with a brand like Tazo. I also like that is comes in heat sealed packets to preserve the freshness. \n\nWhat I didn't like was the service. The woman who helped us took moved at a glacial pace for no apparent reason. She also couldn't seem to remember what we wanted, and how many ounces. Another fellow was running around serving the restaurant customers, and he seemed on the ball, so I'm not sure what was up with the slacker behind the counter... it certainly shouldn't take 15min to package up 2oz of a couple kinds of tea.", "rating": 3, "date": "2009-06-24"}], "keemun hao ya gift tea": [], "imperial keemun hao ya": [], "jin hao li cha": [], "keemun black": [], "yunnan gold rings": [], "earl grey": [{"excerpts": ["And although not a traditional Chinese tea, the Earl Grey with lavender is awesome. ", "Great service, Joy was a great server! ", "Thanks!"], "author": "Luke C.", "review": "The pork bbq buns are amazing. I got the teahouse noodles with pork, good price for a nice portion of food, and the pork is seasoned perfectly. And although not a traditional Chinese tea, the Earl Grey with lavender is awesome. Great service, Joy was a great server! Thanks!", "rating": 5, "date": "2017-01-29"}, {"excerpts": ["We ordered the Afternoon Tea Dimsum Sampler with the Earl Grey & Lavender Tea and a spicy beef noodle soup. ", "We were not informed that the Tea Sampler came with only one cup of tea, and when we tried to ask for another cup so that you know, we could split the tea between the two of us, the waitress refused and said that the afternoon sampler only came with one cup. ", "Umm...", "Okay. ", "I don't see the big deal of giving another cup so that 2 people can share tea, unless you really expected one person to drink an entire teapot's worth of tea. ", "Dimsum sampler tasted stale but authentic. ", "Is that an oxymoron? "], "author": "Melody L.", "review": "Honest, the beef noodle soup reminded me so much of the way they make them in Taiwan that I spent the next week looking for something similar in the restaurants closer to me. But, that was pretty much the only positive part about my experience here. I came with a friend around 2:45PM for a late lunch, and the first thing we noticed was that there was no service. Now, I've been to China and Taiwan multiple times before, and while I've had \"bad service\", I've never had service as bad as what I got here. The waitress consistently ignored us, and when we had to call her over, she would make it obvious that she thought she was better than us and didn't want to wait on us at all.\n\nWe ordered the Afternoon Tea Dimsum Sampler with the Earl Grey & Lavender Tea and a spicy beef noodle soup. We were not informed that the Tea Sampler came with only one cup of tea, and when we tried to ask for another cup so that you know, we could split the tea between the two of us, the waitress refused and said that the afternoon sampler only came with one cup. Umm...Okay. I don't see the big deal of giving another cup so that 2 people can share tea, unless you really expected one person to drink an entire teapot's worth of tea. Dimsum sampler tasted stale but authentic. Is that an oxymoron? The tea was good.\n\nWhen the waitress came out with our food, she immediately set down a bill on our table. I don't think I've ever been to a restaurant like this that charged premium prices but was also rude enough to bring out the receipt so quickly. My friend and I took a look at the receipt though, and immediately noticed that it was not ours. We called over what seemed to be the head manager (white guy who worked more the store side), and he quickly fixed the mistake. Apparently it was meant for the lady at the table right next to us. Umm..\n\nIn the end our total came out to approximately $30. The beef noodle soup was yums, but everything else was okay. Until they train their waitresses better though, I don't think I want to come here again. Serious, even the waitresses at the divey Chinese restaurants in Chinatown treat me better...even when they discover I'm not an authentic Chinese and speak poor Chinese.\n\nTo be fair though, the white guy was the epitome of customer service, and he was who we had to turn to all the time. He even super eager split our bill between two credit cards just so that it would be more convenient. I feel bad for the guy, holding the fort down and compensating for the rest of his staff's rudeness.", "rating": 2, "date": "2012-07-07"}, {"excerpts": ["I've been many times, so I've had the sen cha, earl grey, rose petal tea etc, ", "all were very high standard. ", "The presentation is a tradition Chinese gaiwan style, hence the separate tea for each drinker. "], "author": "Sarah F.", "review": "I love this place. It is so relaxing to be in...a zen, calm environment in the heart of the Ferry Building. \n\nOk, so this is first and foremost a TEA place. And they do a pretty good job. The tea selection is amazing -- such an incredible variety of teas. I've been many times, so I've had the sen cha, earl grey, rose petal tea etc, all were very high standard. The presentation is a tradition Chinese gaiwan style, hence the separate tea for each drinker. Fun!You can also visit and just buy tea to have at home, and it seems like that's what a lot of people do. \n\nI would also recommend the food. The curry chicken is really something else... yum! I haven't had the dim sum platter so I cannot speak to the comments below.\n\nFinally, the service here is inpeccable. He was very attentive, and spends a lot of time explaining about individual teas. I would come back here time and time again.\n\n****\n\nUpdate: It seems like the server that I really liked there has left. It's a shame, he was the best thing about the place -- such a great knowledge and excellent customer service. The lady that usually works here is the opposite-- extremely rude, pushy and inconsiderate. I would fire her for sure if I was the manager...", "rating": 3, "date": "2009-07-30"}], "lapsang souchong": [], "superior muscatel darjeeling": [], "imperial breakfast": [], "red peony": [], "organic purple bamboo": [{"excerpts": ["Now I must admit that I am not the world's foremost fan of tea, but the tea we had, the 2009 Organic Purple Bamboo tea (?), pretty much had an imperceptible taste, which outweighed the interesting spiel we got about it and the guidance on the tea ritual and how it is drunk (out of a little tiny refillable pot, holding the lid so that there's only a small crack for the tea to flow through so that you don't get any of the leaves in your mouth).  "], "author": "moosedog i.", "review": "Really, this is another argument for being able to give half-stars.  I really liked the Imperial Tea Court at the Ferry Building location because of its ambience -- quiet, not overcrowded, vaguely Zen.  Now I must admit that I am not the world's foremost fan of tea, but the tea we had, the 2009 Organic Purple Bamboo tea (?), pretty much had an imperceptible taste, which outweighed the interesting spiel we got about it and the guidance on the tea ritual and how it is drunk (out of a little tiny refillable pot, holding the lid so that there's only a small crack for the tea to flow through so that you don't get any of the leaves in your mouth).  Had it been a really great tea, I would feel much differently, since this is their selling point, but even my lunch companion, who is a tea person, was not impressed.\n\nI also got the \"dim sum sampler,\" and although it had types of dim sum I had never seen before, it also consisted of very miniature versions of common dim sum.  Again, sort of the same story -- very nice and elegant presentation, but the substance was not to rave about.\n\nConclusion:  probably a great place for a quiet conversation if you are a tea aficionado and find a tea you like there.  And I do like that it's a little patch of quiet in what can be an intense atmosphere amidst the chic consumerism of the other businesses there,  But it would not be among my first choices of places to revisit.  2.5 stars.  PS:  it's also on the expensive side.", "rating": 3, "date": "2009-12-12"}], "osmanthus dragon well": [], "harvest imperial dragon well": [], "cui feng": [], "harvest snow water dragon tips": [], "rose garden dragon well": [], "dancing blossoms": [], "mountaineers green tea chai": [], "green peony": [], "lychee blossoms": [], "fu yang sparrow tongue dragon well": [], "hunan lotus heart": [], "gunpowder": [{"excerpts": ["-Organic Gunpowder - ordered entirely based on the name.  ", "It was good.  \n", "-Ginger ", "Ginseng Green Tea ", "- I can honestly say I felt like Superwoman after drinking this tea.  ", "Wow.  "], "author": "James M.", "review": "2007 is the new sobriety is the new intoxication.  It's true.  I have not had a drop of alcohol since the middle of December. . .actually, the last sip of alcohol I had was just that, a sip (or maybe two but they were teeny tiny) and it was some incredibly expensive, sophisticated herbal, aged, dark colored spirit.  I don't recall it's name - it was special and I know that much because someone had to travel down to some secret cave to a special locked room to fetch the bottle that was sealed with wax.  \n\nThis is a review about tea I know. . .\n\nSince my decision to see what life is like sans alcohol, I've started getting to know tea.  I'm more of a coffee (delicately crafted cappuccino thank you!) type of lady.  I never gave tea a chance because I love my cappuccinos.  There was no room for tea in my life before. . .you see, I had my wine (spicy Zinfandel, deep Chenin Blanc, port old port --- the memory of a delicate Riedel glass with finger prints on it, evidence of a dinner party enjoyed brings a tear to my eye. . .sniff), I had cappuccino's, I had water.  Now that I am not drinking alcohol, it's opened up a spot for tea.  \n\nIn my quest to find \"my tea\", I decided to check out Imperial Tea Court at the Ferry Plaza.  I'm not crazy about the layout.   It feels crowded to me, which might be okay if all the tables and chairs weren't so hard.  I enjoyed my tea, and have been back for tea to go.  Regarding the ambiance and layout, I would check out the original for the real Imperial experience.  \n\nOn to the tea. . .the low down. . .\n\nI got the Organic Dragonwell for a friend in Amsterdam who is crazy about tea.  He enjoyed it and thought it was pleasant.  \n\nI've tried the following:\n\n-Genmai Cha --- very good.\n-Organic Gunpowder - ordered entirely based on the name.  It was good.  \n-Ginger Ginseng Green Tea - I can honestly say I felt like Superwoman after drinking this tea.  Wow.  Experiencing something like this is what I mean when I say that \"sobriety is the new intoxication\"  Give up alcohol for two months and then go have a couple cups of this stuff and get back to me.\n\nAside from the fact that the Ginger Ginseng Green tea made me feel like putting glitter on my face and hopping a red-eye to go back in time to dance all night at the Tunnel NYC with six-inch vinyl thigh-high platform boot wearing drag queens on mirror paneled columns in the middle of a dancefloor that has a suspiciously white hue (phew!), the tea is all very nice.   \n\nI'm a new tea drinker so I don't know all the \"tea terms\" but I always feel good after drinking tea.  Imperial teas taste good - in my opinion.  I can't tell you if they're better than the other tea places in the city because to me, all fresh/organic tea is pleasant. . .\n\n. . .maybe it's time for a real tea tasting. . .to be continued!", "rating": 3, "date": "2007-02-10"}], "valentine rose": [], "genmai cha": [{"excerpts": ["We got some of the Genmai Cha tea, which is a DELICIOUS green tea with toasted rice that overwhelms the flavor deliciously. ", "They taught us how to pour the tea which was really cool, and we ended up walking away with a 1/4 pound bag for 11.25, which to me is decently priced. ", "We're still enjoying the tea today ", "and I'm glad we checked this place out to find it--I'd tried that tea a while ago and just couldn't figure out what kind it was, so it was great to find it here!"], "author": "Katie V.", "review": "This was a nice quiet spot in the midst of the busy Ferry Building on a Sunday afternoon. We stopped here for some tea and a bite to eat because it looked like a place where we might quickly get food, since everywhere else looked so busy.\n\nThe servers were all nice, although ours was SUPER quiet. We could barely hear him talk. The food also took a while to come out for the place being so empty. We decided on 4 or 5 of the dim sum dishes, which unfortunately ended up being enough for maybe one  moderately-hungry person, and we were two VERY hungry people. The slow service didn't help, and the food overall was kind of bland. So I suggest not coming here for the food, although the entrees may have been better--it looked like the few groups of people around us were getting those.\n\nThe tea was good though! We got some of the Genmai Cha tea, which is a DELICIOUS green tea with toasted rice that overwhelms the flavor deliciously. They taught us how to pour the tea which was really cool, and we ended up walking away with a 1/4 pound bag for 11.25, which to me is decently priced. We're still enjoying the tea today and I'm glad we checked this place out to find it--I'd tried that tea a while ago and just couldn't figure out what kind it was, so it was great to find it here!", "rating": 3, "date": "2015-02-10"}], "dragon well": [{"excerpts": ["Dragon Well Dumplings: The skin on these was definitely better, but I found the filling to be bland and had to dip the dumpling in soy sauce and chili oil to taste something. "], "author": "Sabina S.", "review": "After having a killer run on Embarcadero, we thought we deserved some hearty tasty dim sum! So we decided to check out Imperial Tea Court at the Ferry Building. I've always seen this place serving up steam buns at a stand directly outside the restaurant to attract the farmers market foot traffic inside the building. The dim sum menu seems promising and interesting/unique but overall after trying it, I have to say the food was lackluster and you can find better dim sum elsewhere.\n\nWe ordered the following:\n1) Shrimp Dumplings: While the filling in this was decently flavorful, the dumplings were so tiny and the dumpling skin was insanely thin. Every time we picked one up with our chopsticks, the skin would just fall apart and the filling would come out. Not a great experience.\n\n2) Dragon Well Dumplings: The skin on these was definitely better, but I found the filling to be bland and had to dip the dumpling in soy sauce and chili oil to taste something. I get the uniqueness of flavoring the filling with a tea seasoning, but I think there needs to be some other flavor component. \n\n3) Wontons in Jasmine Tea Broth: This dish sounded super unique, and it definitely was. I'll give the restaurant plus points for the size of this dish (I think there were 10-12 wontons). But, while the tea-infused broth gave it an interesting spin, the flavors weren't balanced. The jasmine tea from the broth combined with the peppercorn in the filling made the wontons bitter. This dish again needed something else to have complementing flavors (something salty, fatty, or sweet ideally). \n\nOverall, I think the food was just okay. It's not a bad place to come to if you're in the area craving dim sum, but it by no means comes close to solid dim sum spots around town.", "rating": 3, "date": "2018-03-12"}, {"excerpts": ["Oolong, dragon well and green tea are common selections.  ", "However, the prices has increased and it becomes tedious trying to share even with the extra fee for doing so.  ", "Therefore, the staff encourages that each person get a pot of tea that they barely finish unless you sit there for hours.  "], "author": "Jenny L.", "review": "The wide selection of teas make it worth a trip to try over lunch.  You may want to consult the staff for a recommendation.  Oolong, dragon well and green tea are common selections.  However, the prices has increased and it becomes tedious trying to share even with the extra fee for doing so.  Therefore, the staff encourages that each person get a pot of tea that they barely finish unless you sit there for hours.  Unfortunately, it becomes arduous to pour the water into a bowl and then hold the cap while you pour the bowl into your cup.  \n\nThe food is okay.  Nothing special.  The best dish is their signature spicy noodle soup with the Niman ranch beef, which is a bit too lean for the flavor of the fat to meld with each bite.  The Beijing style braised beef, which lacks flavor, is again too lean and not tender enough.  \n\nService is slow and sometimes friendly.  The ambiance is a traditional tea house in terms of furniture, but the feel of a private tea place is missing.  Parking is tough on the street unless you find spots in nearby garages.", "rating": 3, "date": "2011-11-27"}, {"excerpts": ["Take the Dragon Well dumplings for example.  ", "The description on the menu: \"Handmade dumplings filled with Niman Ranch ground pork shoulder and infused with Imperial Tea court's dragon well green tea.", "\"  Wow.  ", "Sounds amazing, right?  ", "Well, these were just alright.  ", "Plain ol' pork dumplings that were kinda small.  ", "They were savory.  ", "The skin wasn't that thick, but not thin enough that they fell apart.  ", "Big whoop.  "], "author": "Jeanne L.", "review": "Wow, they've really got some great people working on the descriptions of those menu items.  Everything sounded over-the-top fantastic on the menu.\n\nTake the Dragon Well dumplings for example.  The description on the menu: \"Handmade dumplings filled with Niman Ranch ground pork shoulder and infused with Imperial Tea court's dragon well green tea.\"  Wow.  Sounds amazing, right?  Well, these were just alright.  Plain ol' pork dumplings that were kinda small.  They were savory.  The skin wasn't that thick, but not thin enough that they fell apart.  Big whoop.  They didn't taste remarkably better than any other place.\n\nI had the Teahouse Spicy Noodles with pork. They were good. Satisfying if you want something warm.  The noodles were on the thin and soft side. The pork was ground up. Interestingly, the server offered me the option of \"spicy\" versus \"not-spicy\" for this dish.  Hmm... but it already says spicy in the name...?  Anyway, if you get it non-spicy, the broth is less oily.  I think they use chili oil to spice it up.  Overall a good dish, but not spectacular.  \n\nI suppose you'd be coming here for the tea, rather than the food.  There was quite a large selection of tea.  I got something with ginger and ginseng.  My partner got black lychee (which smelled way better than mine).  The tea is loose, and it comes in a little cup with a lid and a saucer.  There is a pot of hot water on the table. You're supposed to pour the water into this cup, wait for it to brew.  The difficult part comes when you're supposed to pour the tea from this cup into another cup for drinking.  The table just ends up getting wet.  Or you could just sip from the original cup.  \n\nI can't comment on the authenticity of this little tea ceremony.  I've never seen tea served this way in Chinese culture.  Or Japanese culture... or ... whatever.\nAnyway, this was a fun little experience.  Not for the food per se.  Maybe for the tea, but definitely for the lounging-factor and the people-watching.  I came here on a Saturday, and was able to avoid the massive crowds from the Farmer's Market.", "rating": 3, "date": "2013-11-08"}, {"excerpts": ["Regardless, I stopped in for a quick bite after seeing dragon well dumplings on the menu (DRAGON WELL DUMPLINGS!) and savored every bite. ", "Pair it with some tea, and maybe throw in a couple steamed buns and enjoy."], "author": "Phil C.", "review": "Not sure why this place isn't ranked higher. Maybe the location is held against it?\n\nRegardless, I stopped in for a quick bite after seeing dragon well dumplings on the menu (DRAGON WELL DUMPLINGS!) and savored every bite. Pair it with some tea, and maybe throw in a couple steamed buns and enjoy.", "rating": 4, "date": "2013-04-06"}], "harvest imperial lotus heart dr": [], "misty mountain": [{"excerpts": ["Monkey-Picked Ti Quan Yin, Misty Mountain, and Silver Needle Jasmine.\n\n"], "author": "Chris E.", "review": "I had Yunnan Mao Feng green tea. Others with me had Monkey-Picked Ti Quan Yin, Misty Mountain, and Silver Needle Jasmine.\n\nEven here, with a statement on the menu about using a temperature around 150 for green tea, they brew it too hot. :( The leaves are very good, though.", "rating": 3, "date": "2011-07-31"}], "yunnan spring tips": [], "longevity green": [], "flower of prosperity": [], "imperial ivory green tea": [], "sword of the emperor": [], "green tea ginger ginseng": [], "spring harvest imperial green oolong": [], "monkey picked tie guan yin": [], "aged oolong": [], "fancy tieguanyin": [], "winter harvest phoenix oolong huang zhi xiang": [], "jasmine oolong": [{"excerpts": ["I also had a jasmine oolong tea which the server instructed me to drink in a certain way, but it wasn't anything special.  ", "There were probably 50 varieties ", "so next time I will pick something a little more unique.  ", "Servers were really not in any rush, as others have mentioned."], "author": "Vivian W.", "review": "Pleasantly surprised by the food.  I fully expected to get really awful touristy Chinese food (Chinese food in the Ferry Building, and at a teahouse as opposed to a restaurant - what was I thinking?) Instead, the food was actually really good.  I ordered the wonton in tea broth.  Not that much of a fan of the broth which tasted like seaweed in water, but there were a generous number of wontons and they were good.  As advertised, the wonton skin was relatively thin, which is how it should be.  My boyfriend had the spicy teanoodles with beef and he really enjoyed it.  I also had a jasmine oolong tea which the server instructed me to drink in a certain way, but it wasn't anything special.  There were probably 50 varieties so next time I will pick something a little more unique.  Servers were really not in any rush, as others have mentioned.", "rating": 3, "date": "2010-11-14"}], "bai ye phoenix oolong": [], "edition bai ji guan": [], "harvest yan ru": [], "gui fei cha": [{"excerpts": ["Come back again for Teahouse spice noodle with Pork and Veggie and a Gaiwan cup of my favorite Oolong tea - Gui Fei Cha."], "author": "Yui D.", "review": "Come back again for Teahouse spice noodle with Pork and Veggie and a Gaiwan cup of my favorite Oolong tea - Gui Fei Cha.", "rating": 5, "date": "2015-11-23"}], "edition da hong pao": [], "orchid oolong": [{"excerpts": ["I had the orchid oolong, which I enjoyed very much in spite of not liking the gaiwan presentation. ", "Gaiwan presentation means the tea is put into a rather small cup, then the water is added. ", "You hold the saucer with the cup in it with your left hand, then with your right hand, employ the cup cover like a strainer to hold back the tea leaves while you sip the tea. ", "Maybe the waitress put a lot of tea in my cup, but by the time the leaves unfurled and expanded, there wasn't room for much water in the cup. \r\n\r\n", "I ordered the dim sum sampler platter; it arrived much later than the tea - I was beginning to think it wasn't coming at all.  ", "It was worth the wait. ", "There was quite a lot of food for $6.50: 2 wontons, 2 shu mai filled with what tasted like cornmeal mush with tasty bits in it - very unusual, 2 rice paper dumplings with shrimp and mushroom filling, a perfectly cooked eggroll filled with tofu, cabbage, etc., a steamed bun with garlic chive and ??", "mushroom?", "? ", "filling, and a steamed bun filled with red bean paste. ", "The eggroll filling was a little bland, but everything else was very good.\r\n\r\n", "$5 for the cup of tea and a gigantic (for 1 person) tea pot of hot water.\r\n", "I enjoyed the orchid oolong so much that I bought some to take home, along with some Ceylon black tea."], "author": "Debi L.", "review": "Had lunch here so late it was almost dinner. The place was almost empty; everyone else seemed to be at the wine bar next door ;-) \r\n\r\nThey have a nice selection of high quality teas, but not the huge number of teas on the tea tasting menu that Samovar has. The Imperial  doesn't seem to be as much of a scene as Samovar, probably due to its location in the Ferry Building and the fact that it closes at 6 pm. \r\n\r\nI had the orchid oolong, which I enjoyed very much in spite of not liking the gaiwan presentation. Gaiwan presentation means the tea is put into a rather small cup, then the water is added. You hold the saucer with the cup in it with your left hand, then with your right hand, employ the cup cover like a strainer to hold back the tea leaves while you sip the tea. Maybe the waitress put a lot of tea in my cup, but by the time the leaves unfurled and expanded, there wasn't room for much water in the cup. \r\n\r\nI ordered the dim sum sampler platter; it arrived much later than the tea - I was beginning to think it wasn't coming at all.  It was worth the wait. There was quite a lot of food for $6.50: 2 wontons, 2 shu mai filled with what tasted like cornmeal mush with tasty bits in it - very unusual, 2 rice paper dumplings with shrimp and mushroom filling, a perfectly cooked eggroll filled with tofu, cabbage, etc., a steamed bun with garlic chive and ??mushroom?? filling, and a steamed bun filled with red bean paste. The eggroll filling was a little bland, but everything else was very good.\r\n\r\n$5 for the cup of tea and a gigantic (for 1 person) tea pot of hot water.\r\nI enjoyed the orchid oolong so much that I bought some to take home, along with some Ceylon black tea.", "rating": 4, "date": "2006-01-18"}], "superior yellow gold oolong": [], "superior four season spring oolong": [], "wuyi tie luo han": [], "old bush shui xian tea cake": [], "high mountain green oolong": [], "imperial wuyi yan cha": []}