{"regular salad": [{"excerpts": ["The lasagna, burrata salad, and service were excellent, but the regular salad was mostly a sad pile of iceberg. ", "For the price, that was unexpected and disappointing, a departure from what should be a consistent level of quality."], "author": "David S.", "review": "The lasagna, burrata salad, and service were excellent, but the regular salad was mostly a sad pile of iceberg. For the price, that was unexpected and disappointing, a departure from what should be a consistent level of quality.", "rating": 3, "date": "2015-01-03"}], "mozzarella salad": [{"excerpts": ["The mozzarella salad was lovely and the mozarella was soft and fresh."], "author": "Jennifer C.", "review": "This was a great deli/ quick restaurant for people on the run. My husband and I dropped by here on a walk around fisherman's wharf. The fettuccini pasta was super delicious and a bit spicy with the chili peppers. The mozzarella salad was lovely and the mozarella was soft and fresh.", "rating": 5, "date": "2018-10-16"}, {"excerpts": ["We ordered a mozzarella salad and the vegetarian ravioli with marinara sauce to share. ", "Below is a picture of the mozzarella salad. "], "author": "Anna W.", "review": "When we first arrived, there was a line stretching a bit down the block (so clearly it had to be good). \n\nWe didn't have to wait that long either, maybe 1/2 an hour, to get inside. Once inside, we realized that it was a very small location and tables were hard to come by with the high population of customers. This created a bit of a hostile environment, as one of the girls behind us in line got a table before us and then rudely said \"you better start a fight, because I'm not giving this up.\" But we eventually found a table as a couple was leaving. \n\nWe ordered a mozzarella salad and the vegetarian ravioli with marinara sauce to share. Below is a picture of the mozzarella salad. The food itself was very good, I'm just a little disappointed with the amount of space the restaurant has because they seem to be doing well bringing in customers. \n\nThe restaurant also seemed to work with doordash if you'd prefer to order your food out. They also do to-go, and have a very good system for self-clearing the tables to ease the turn-around for tables a bit.", "rating": 3, "date": "2018-07-05"}, {"excerpts": ["I ordered the mozzarella salad, gnocchi rolls with marinara sauce, and the pappardelle with the Pasticciata sauce.  ", "Portions were pretty generous - I was able to split this between two meals.  ", "The mozzarella salad was really good and came with very tasty pieces of flat bread ", "- it was my favorite part of the meal! ", "The gnocchi rolls left a lot to be desired...while I know that gnocchi is made out of potato, these literally tasted like mashed potatoes, not like any gnocchi I have ever had.  ", "The pappardelle was okay, but extremely overcooked, so much so that the it was hard to separate the individual noodles from one another.  ", "The pasticciata sauce though was really good and full of flavor.  ", "All in all, I was sort of disappointed with this, only because of my extremely high expectations, but will go back and dine in to see if the pasta in-house is better."], "author": "Arthi N.", "review": "I heard about this place from my Italian friend and was really expecting what I thought would be an authentic experience.  I ordered delivery from Postmates, which may have made a difference in the taste of the food.  I ordered the mozzarella salad, gnocchi rolls with marinara sauce, and the pappardelle with the Pasticciata sauce.  Portions were pretty generous - I was able to split this between two meals.  The mozzarella salad was really good and came with very tasty pieces of flat bread - it was my favorite part of the meal! The gnocchi rolls left a lot to be desired...while I know that gnocchi is made out of potato, these literally tasted like mashed potatoes, not like any gnocchi I have ever had.  The pappardelle was okay, but extremely overcooked, so much so that the it was hard to separate the individual noodles from one another.  The pasticciata sauce though was really good and full of flavor.  All in all, I was sort of disappointed with this, only because of my extremely high expectations, but will go back and dine in to see if the pasta in-house is better.", "rating": 3, "date": "2018-10-07"}, {"excerpts": ["I Had the mozzarella salad followed up with a gnocchi with the meatball sauce. ", "Just phenomenal. ", "It is small and I don't believe they serve wine but this is still a must."], "author": "Scott S.", "review": "I walked by several times in the last time I was in SF.  and what caught my eye was that they serve the dishes on paper plates, but yet the place was packed each time I walked by. Well I finally stopped in and. I Had the mozzarella salad followed up with a gnocchi with the meatball sauce. Just phenomenal. It is small and I don't believe they serve wine but this is still a must.", "rating": 5, "date": "2018-06-14"}, {"excerpts": ["The simple Mozzarella salad with cherry tomatoes is a must have as well as Fettuccine with Pesto. ", "Don't leave San Francisco without stopping by this little pasta & sandwich cafe or you'll miss out on one of my favorite city's hidden gems."], "author": "Patrick S.", "review": "Absolutely the best Italian Cafe in San Francisco \nThe owners of this small but mighty in taste operation hail from Parma Italy. Where else in a major tourist town  can you get deletable hand made pasta like Pappardelle and Tagliatelle for $9 bucks ?!\nThe meatballs were rich and delicious and the Bolognese meat sauce was stellar. The simple Mozzarella salad with cherry tomatoes is a must have as well as Fettuccine with Pesto. Don't leave San Francisco without stopping by this little pasta & sandwich cafe or you'll miss out on one of my favorite city's hidden gems.", "rating": 5, "date": "2015-07-04"}, {"excerpts": ["I ordered lasagna with extra meatballs, mozzarella salad, and gnocci roll.  ", "The gnocci roll and salad were delicious, which is why I give this 2 stars.  ", "Now the bad part - They forgot to include the meatballs that I ordered.  ", "I asked to get them delivered, but all they could do was credit me back the difference.  ", "That doesn't help me as I'm still hungry.  ", "The lasagna would have been delicious as well, if it wasn't so salty.  ", "It was salty to the point of being inedible.  ", "I asked for them to deliver a new one.  ", "They refused to do anything to help me because this dish is their \"best seller\".   "], "author": "WINNIE B.", "review": "Ordered takeout and have to write about my experience.  I don't like to write negative reviews, but this was pretty bad.  First of all, be prepared to wait in the same line as everyone else who is ordering their food.  There was only one register and other workers milling about chit chatting while the person manning the register is busting her butt.  When I asked if I had to wait in line, even though my food is ready, they said yes.  \n\n  I ordered lasagna with extra meatballs, mozzarella salad, and gnocci roll.  The gnocci roll and salad were delicious, which is why I give this 2 stars.  Now the bad part - They forgot to include the meatballs that I ordered.  I asked to get them delivered, but all they could do was credit me back the difference.  That doesn't help me as I'm still hungry.  The lasagna would have been delicious as well, if it wasn't so salty.  It was salty to the point of being inedible.  I asked for them to deliver a new one.  They refused to do anything to help me because this dish is their \"best seller\".   Essentially, they didn't believe that the chef over salted the dish and wouldn't do anything about it.  \n\nThis place would have been a winner, except for the horrible service.  The search for my favorite Italian place continues!", "rating": 2, "date": "2017-01-05"}, {"excerpts": ["The mozzarella salad was fresh, perfect amount of dressing, and the balsamic was incredible. ", "Only drawbacks were uncomfortable seating and no wine."], "author": "Dee P.", "review": "Food is definitely a 5. The lasagna was light, if you can imagine that. So flavorful. Also had their version of a calzone, filled with sausage and peppers. Crispy crust with delicious filling. The mozzarella salad was fresh, perfect amount of dressing, and the balsamic was incredible. Only drawbacks were uncomfortable seating and no wine.", "rating": 5, "date": "2015-08-04"}, {"excerpts": ["The mozzarella salad is good too. ", "Nice staff friendly.... good service over all. ", "Will recommend and definitely worth coming back."], "author": "Lorna O.", "review": "We had the lasagna,  it's  moist and flavorful. Exceeded our expectation. The mozzarella salad is good too. Nice staff friendly.... good service over all. Will recommend and definitely worth coming back.", "rating": 4, "date": "2016-03-19"}, {"excerpts": ["our group all tried the gnocchi, which was perfect - as was the delicious mozzarella salad.  ", "a great find! ", "i am looking forward to picking up some fresh pasta next time i'm planning for a no holds barred pasta meal!"], "author": "Archana P.", "review": "solid place for a quick pasta bite, where the pasta is fresh but the sauce is so-so. both the pesto and marinara were obviously fresh but very simply and blandly seasoned.  the butter sage sauce was delicious on the other hand, but wouldn't be my go to choice given its richness. our group all tried the gnocchi, which was perfect - as was the delicious mozzarella salad.  a great find! i am looking forward to picking up some fresh pasta next time i'm planning for a no holds barred pasta meal!", "rating": 4, "date": "2015-06-24"}, {"excerpts": ["I had the vegetable ravioli with the meat and cream sauce, the mozzarella salad and the fresh bread- just amazing! ", "These guys are the real deal down to the Italian they were speaking to each other and the music they were humming along with!"], "author": "Austin L.", "review": "Since Italian food is my favorite kind of food, specifically ravioli and tortellini, I consider myself somewhat of a connoisseur of pasta. This is LITERALLY the BEST ravioli I have ever eaten. Every birthday of my 32 year of life, every anniversary of my 10 years of marriage, and countless date nights have been spent at fancy Italian restaurants. They all pale in comparison to this tiny hole in the wall deli/kitchen and the amazingly fresh and authentic food. I had the vegetable ravioli with the meat and cream sauce, the mozzarella salad and the fresh bread- just amazing! These guys are the real deal down to the Italian they were speaking to each other and the music they were humming along with!", "rating": 5, "date": "2015-04-17"}, {"excerpts": ["My friend and I split the Bufala mozzarella salad which was really tasty. ", "The tomatoes were particularly juicy and flavorful.  ", "I'm really glad we split it due to the large portion size. ", "I also ordered the papardelle with meatball sauce which exceeded my expectations. ", "The pasta was extremely fresh and the sauce was robust with flavor. ", "Make sure you time your visit right and avoid the lunch rush or you will be searching for a place to sit! ", "I will definitely be back!"], "author": "Mary B.", "review": "The food was excellent. My friend and I split the Bufala mozzarella salad which was really tasty. The tomatoes were particularly juicy and flavorful.  I'm really glad we split it due to the large portion size. I also ordered the papardelle with meatball sauce which exceeded my expectations. The pasta was extremely fresh and the sauce was robust with flavor. Make sure you time your visit right and avoid the lunch rush or you will be searching for a place to sit! I will definitely be back!", "rating": 4, "date": "2015-10-02"}, {"excerpts": ["& the mozzarella salad was also delicious! ", "Wish they had one of these restaurants in Houston, TX!! ", "The service was also great! ", "If we could give them a ten star rating we would!!"], "author": "Amy P.", "review": "Oh my goodness!! This place has the BEST lasagna we have ever had!! & the mozzarella salad was also delicious! Wish they had one of these restaurants in Houston, TX!! The service was also great! If we could give them a ten star rating we would!!", "rating": 5, "date": "2016-07-29"}], "piadina classica": [{"excerpts": ["The 'Piadina Classica' & 'Cassoni-Italian sausage, pepper, onion, mozz' was so delicious!"], "author": "Gabby G.", "review": "The absolute best Italian food. Homemade & Great customer service. You'll love it! I recommend checking it out if you love Italian Food! The 'Piadina Classica' & 'Cassoni-Italian sausage, pepper, onion, mozz' was so delicious!", "rating": 5, "date": "2018-10-12"}, {"excerpts": ["We shared the tortellini and meatballs and the piadina classica."], "author": "Bonnie J.", "review": "We went here for lunch based on reviews.  We were not disappointed.  Great food and friendly service!!!Come hungry - huge portions. Reasonable prices too.  We shared the tortellini and meatballs and the piadina classica.", "rating": 5, "date": "2016-08-12"}, {"excerpts": ["I usually get piadina classica or vegetarian ravioli with bolognese."], "author": "luca d.", "review": "I am Italian and I have been eating there at least once a week since they opened. I did not write a review sooner because I did not want too many people in my favorite place. But now I changed my mind because I want them to be more successful than McDonald's and open thousands of locations all over the world so I can always be close to a well done piadina or homemade pasta. I usually get piadina classica or vegetarian ravioli with bolognese.", "rating": 5, "date": "2016-07-13"}], "piadina special": [], "italian sausage pepper onion mozzarella cassoni": [], "italian sausage bacon potatoes mozzarella cassoni": [], "pappardelle pasta": [{"excerpts": ["Pappardelle pasta w/bolognese sause", ": This was probably our favorite dish.  ", "Their homemade pasta was so soft and bouncy and the sauce was very creamy and satisfying to the tast.  "], "author": "Tori G.", "review": "The food pasta here is very affordable for what you get compared to A LOT of other Italian restaurants.  As soon as you walk into their facility, they ask that you order your food first before sitting down.  The inside is SO charming, and the homey music gives the ambiance such a sweet feel.  Once we ordered the food came out within 7 minutes, so steamy, so fresh.\nThere's no line around 12:30 Saturday!  We had to try this place out because of all the good things we've heard from it and we were definitely not disappointed!  \nI can imagine that during their busier hours though that the lack of space inside could cause a problem with finding seating.  Luckily Washington Square is not too far away and that would make a great place to eat your food :)\nWe ordered 3 dishes\n1. Meatball Platter: This came with their very large and filling, homemade MOUTHWATERING meatballs as well as a kind of italian flatbread.  The bread complimented the meatballs very well.  This dish is smothered in their signature meat sauce and my taste buds were exploding.  I really really enjoyed this dish.\n2. Gnocchi with sage and butter:  The gnocchi is so soft and bouncy and plump and just the perfect way gnocchi should taste.  The butter and sage gave it a very herb and floral taste, I personally enjoyed it very much whereas my boyfriend mentioned the flowery taste was a bit too much for him although he loved the texture of the gnocchi.  Will probably get a pesto sauce next time instead of the butter sage.\n  \n*note* that's the really nice thing about this place is that you can customize your pasta how you want it and put whatever sauce on it.\n\n3. Pappardelle pasta w/bolognese sause: This was probably our favorite dish.  Their homemade pasta was so soft and bouncy and the sauce was very creamy and satisfying to the tast.  I loved how fat and wide pappardelle is and they really perfected the art of their pasta making skills.  \n\nI can't wait to come back and try more of their offerings =)  Will definitely tell others about this place!", "rating": 5, "date": "2018-10-01"}, {"excerpts": ["I ordered the meat raviolis, and my wife ordered the Pappardelle Pasta with two meat balls.  ", "Both dishes were absolutely delicious! ", "The sauces tasted fresh, and the flavors of the meats were just amazing.  "], "author": "Michael S.", "review": "My wife and I made a quick and spontaneous trip into the city (from the east bay) for something to do this afternoon.  We decided to grab a quick bite for dinner, and my wifed picked the Italian Homemade Company as our destination.  After a bit of an adventure finding parking (which is typical for SF), we arrived there right before the dinner rush.\n\nI ordered the meat raviolis, and my wife ordered the Pappardelle Pasta with two meat balls.  Both dishes were absolutely delicious! The sauces tasted fresh, and the flavors of the meats were just amazing.  The portions were just the right size for both of us.\n\nThere are PLENTY of reviews for this place, so I'm not sure I can add anything more that hasn't already been said. But from where I sit, this place had the great authentic food and the quaint and friendly atmosphere that we love in a family restaurant. I don't know when we will be back in SF, but I would love to go back to IHC to enjoy more of their wonderful food!\n\n--------------------\nIf spaghetti was to star in an action film, what would it be called?\nMission I'm-pasta-ble.", "rating": 5, "date": "2017-12-29"}, {"excerpts": ["I got the pappardelle pasta with the bolognese sauce and the hubby got the lasagna and both were amazing. ", "The meat, cheese and sauce were savory and flavorful. ", "I love the ambiance as well, right on little Italy. "], "author": "Joselyne T.", "review": "This is my favorite go to place for fresh pasta! I got the pappardelle pasta with the bolognese sauce and the hubby got the lasagna and both were amazing. The meat, cheese and sauce were savory and flavorful. I love the ambiance as well, right on little Italy. There's also outdoor seating if you wish to enjoy the scenery. \n\nI had to bump up my experience up to 5 stars because James Franco was sitting right behind me while I was eating so yes that was the kick off to a great day. So the food must be that amazing right? ;) LOL.", "rating": 5, "date": "2017-12-13"}, {"excerpts": ["I don't feel like I have tried enough to make suggestions on specific food items, but I will say the meatballs are delicious and the pappardelle pasta (wide noodles) with Bolognese sauce was also delicious.  ", "I would most definitely recommend this restaurant!"], "author": "Kate D.", "review": "The Italian Homemade Company is a small restaurant with a big heart. My friends introduced this restaurant to me and I am so thankful for it. You can pick your pasta and sauce when you order your food and they will bring it out to you. All of the pasta and sauces are homemade and they are fabulous! I cannot wait to get back to San Francisco and to this restaurant! I can imagine when they are busy it's hard to find a seat because there are not many tables, but they do also have outdoor seating.  I'd guess the best times to visit are for lunch during the week when you have time to sit and relax and enjoy the greatness that is made here.  I don't feel like I have tried enough to make suggestions on specific food items, but I will say the meatballs are delicious and the pappardelle pasta (wide noodles) with Bolognese sauce was also delicious.  I would most definitely recommend this restaurant!", "rating": 5, "date": "2017-10-20"}, {"excerpts": ["Pappardelle pasta itself was well made but the Bolognese sauce was only okay. ", "Carpaccio was pretty tough. ", "The space itself was active but unnecessary loud because of the piped in music. ", "You could do a lot worse but there are better alternatives out there. ", "Won't be back."], "author": "Ron C.", "review": "Okay. Nothing special. Pappardelle pasta itself was well made but the Bolognese sauce was only okay. Carpaccio was pretty tough. The space itself was active but unnecessary loud because of the piped in music. You could do a lot worse but there are better alternatives out there. Won't be back.", "rating": 2, "date": "2017-11-16"}, {"excerpts": ["the delicious pappardelle pasta soooo freaking good. ", "Went by happenstance more like happystance!"], "author": "michelle r.", "review": "OMGoodness this place ...this place ! I'm in love and I can't stop thinking about the burrata salad and the delicious pappardelle pasta soooo freaking good. Went by happenstance more like happystance!", "rating": 5, "date": "2016-12-21"}, {"excerpts": ["This place makes heavenly pappardelle pasta. ", "Never in my life have I had such perfectly cooked pasta. ", "For $12, $9 for the pasta and $2-$3.50 for the meat sauce", ", this is the best value for homemade pasta and homemade sauces. ", "Portions were decent. "], "author": "Anthony L.", "review": "This place makes heavenly pappardelle pasta. Never in my life have I had such perfectly cooked pasta. For $12, $9 for the pasta and $2-$3.50 for the meat sauce, this is the best value for homemade pasta and homemade sauces. Portions were decent. 5 out of 5.\n\nP.S. If you guys didn't know, this place is rated #9 out of 4,788 restaurants in San Francisco on Tripadvisor", "rating": 5, "date": "2015-12-20"}, {"excerpts": ["The red sauce is succulent & works perfectly with the homemade pappardelle pasta & meats. ", "Outstanding value for ", "it's deli prices!"], "author": "devorah h.", "review": "No fancy tablecloths here but really awesome meatballs the size of a tennis ball! The red sauce is succulent & works perfectly with the homemade pappardelle pasta & meats. Outstanding value for it's deli prices!", "rating": 5, "date": "2016-01-05"}], "tagliatelle pasta": [{"excerpts": ["My boyfriend loves pasta, so he ordered the tagliatelle pasta with the bolognese sauce. ", "The pasta itself is ~$9 and the sauce was another ~$2. ", "I ordered the meatball platter which came with 6 (giant) meatballs and Piadina flatbread ($12). ", "After you order you can watch them make everything for you on the stove right behind the cashier. ", "In the back you can even see them making fresh pasta! ", "The portions are generous, my boyfriend ", "and I ended up sharing the pasta and the meatballs which was the perfect meal! "], "author": "Cecille W.", "review": "Never in my life have I craved pasta. So if I saw the Italian Homemade Company I probably would have just walked right by and not given it a second thought. But one thing I do crave are..meatballs! And I'll say right off the bat that they have the BEST meatballs I've ever tasted. \n\nThe Italian Homemade Company is a cute little pasta shop where you order first and then sit down. They have a wide variety of different pasta, pasta sauces, sandwiches and even salads. My boyfriend loves pasta, so he ordered the tagliatelle pasta with the bolognese sauce. The pasta itself is ~$9 and the sauce was another ~$2. I ordered the meatball platter which came with 6 (giant) meatballs and Piadina flatbread ($12). After you order you can watch them make everything for you on the stove right behind the cashier. In the back you can even see them making fresh pasta! The portions are generous, my boyfriend and I ended up sharing the pasta and the meatballs which was the perfect meal! Even though I don't know much about pasta or eat it that often, I know that this was definitely the freshest pasta I've ever had and perfectly al dente! \n\nBut OMG, don't even get me started on the meatballs. 6 meatballs might not seem like a lot, but given how big these meatballs are, it's more than enough! I had to cut it up into six pieces and eat it that way. It comes with sauce and cheese on top as well as the flatbread drizzled with olive oil on the side. The Piadina flatbread was unlike anything I've ever had and my stomach is growling right now just thinking about dipping the flatbread into the meatball sauce. It was super thin and tasted dough-y - I know that sounds strange but trust me, it's good. \n\nService was fantastic and paired with the food, 5 stars all around! Me craving pasta might be a thing now ever since I discovered the Italian Homemade Company. 10/10 recommend!!", "rating": 5, "date": "2017-08-10"}, {"excerpts": ["I got the tagliatelle pasta with pasticcata sauce (blend of bolognese and béchamel). ", "It was a very comforting plate of pasta, and the sauce was great. "], "author": "Cynthia T.", "review": "I got the tagliatelle pasta with pasticcata sauce (blend of bolognese and béchamel). It was a very comforting plate of pasta, and the sauce was great. However, my pasta stuck to each other and made it harder to eat. \n\nVerdit: It's great comfort food and I'd definitely come back. But, this won't be my goto joint.", "rating": 4, "date": "2018-07-24"}, {"excerpts": ["I ordered the lasagna, tagliatelle pasta with pasticiatta sauce, meatballs, ravioli with white sauce and pesto. ", "It was unanimous from all the guests, that with the exception of the ravioli in pesto sauce, everything was mediocre at best. ", "It was so disappointing that all of the pasta was extremely mushy, nowhere near al dente. ", "The ratio of pasticiatta sauce relative to the amount of pasta was off, not enough sauce - such that everyone just felt like they were eating bland pasta. ", "The lasagna, which I was hoping to be the star, was a huge bust. "], "author": "April B.", "review": "I was really looking forward to trying the food out after reading all of the glowing reviews. Unfortunately, I can't say that I can agree with the rave reviews. I ordered food to-go for a party of 20 people. We had a bunch of other food ordered from different restaurants to have variety and I'm so glad we didn't put all our chips in this basket.\n\nI ordered the lasagna, tagliatelle pasta with pasticiatta sauce, meatballs, ravioli with white sauce and pesto. It was unanimous from all the guests, that with the exception of the ravioli in pesto sauce, everything was mediocre at best. It was so disappointing that all of the pasta was extremely mushy, nowhere near al dente. The ratio of pasticiatta sauce relative to the amount of pasta was off, not enough sauce - such that everyone just felt like they were eating bland pasta. The lasagna, which I was hoping to be the star, was a huge bust. The noodles barely held their form and the flavor was really bland. \n\nI was hugely disappointed, as we paid the most money for this food, and it was the least favored by everyone at the party and had the most leftover. When we went to pick up the food, I was looking around at the dishes people were eating and they looked really good and was excited, but upon opening our trays, we didn't see the same thing and probably didn't taste the same things. Perhaps I will give this place another shot, if I just visit the establishment to have lunch to experience what other patrons have, as I really want to like it. I suppose I just had a one-off disappointing experience. :(", "rating": 2, "date": "2018-04-16"}, {"excerpts": ["I opted for the tagliatelle pasta with the pastiacciata sauce which is basically a bolognese sauce with a hint of cream in it to make it creamier. ", "The first plate that was presented to me was completely inedible! ", "The pasta was SO tough, and severely undercooked. ", "I wish they would test the noodles first before plating so as to avoid crushing expectations.  ", "I normally never complain about food or have to return my plate and have them remake it "], "author": "Connie M.", "review": "This little restaurant is really cute! I love the fact that it's a low maintenance and seat yourself kind of restaurant.\n\nThe idea is you wait in line, pick your pasta, pick your sauce, and pick any sides. Sit yourself down and then wait for them to bring your your plate. I had high expectations for this place because my friends had hyped it up so much. I like the idea that you can mix and match and they also make the food right in front of you and you can watch. Also the pastas are handmade which adds an extra layer of authenticity and excitement. \n\nI opted for the tagliatelle pasta with the pastiacciata sauce which is basically a bolognese sauce with a hint of cream in it to make it creamier. The first plate that was presented to me was completely inedible! The pasta was SO tough, and severely undercooked. I wish they would test the noodles first before plating so as to avoid crushing expectations.  I normally never complain about food or have to return my plate and have them remake it but this time around it was just inedible. \n\nI asked them to remake it again. TAKE TWO. This time it was much better! The pasta was more cooked and al dente and the sauce was delicious with just the perfect amount of tomato to cream to meat.\n\nAll in all,  I love that everything truly is \"homemade\" here and also the fact that you wait on yourself. It's a great place to kick it with italian food for a chill low key vibe. I'd pay another visit  just to try their other menu options!", "rating": 4, "date": "2017-05-10"}, {"excerpts": ["We tried lasagna, \nTagliatelle Pasta with meatballs, Fettuccine with white sauce.  ", "It can be a little pricey, but worth every damn penny! ", "There's a bit of a process when ordering but someone lovely and helpful is always there to walk you through or guide you :-) "], "author": "Ed A.", "review": "We were in SF for a week vacation and I made sure to hit up all the hot spots based on Yelp. Coming here was so worth it.  If you're an out of towner...it might feel a bit intimidating at first and that's a good and bad thing.\n\nGood, because you feel like you just walked into someones moms kitchen...hustle and bustle in the kitchen, its a pretty small space inside but not uncomfortable. It felt very home...then again the bad in that could be you feel out of place if you're not a local. All in all, the ambience alone made it feel super homey and delightful.\n\nOnto the food! I can't imagine anywhere that has pasta that tastes as good as this place...probably the closest thing to Italy you're gonna get in SF. We tried lasagna, \nTagliatelle Pasta with meatballs, Fettuccine with white sauce.  It can be a little pricey, but worth every damn penny! There's a bit of a process when ordering but someone lovely and helpful is always there to walk you through or guide you :-) Lovely people, good vibes, amazing amazing FOOD!\n\nAAA+++", "rating": 5, "date": "2017-03-02"}, {"excerpts": ["I ordered the tagliatelle pasta with meatballs sauce (Bolognese sauce and 2 meatballs) for $12. ", "It came with cheese on top and was served piping hot on a paper plate. ", "The serving size was large and well worth the price! ", "The meatballs were insanely good and the pasta tasted so fresh. ", "I'm a huge fan and will definitely be back to try the other pasta and sauce combos."], "author": "Linda X.", "review": "One of my favorite Italian restaurants! It has such an authentic feel and the food is simple yet amazing. The service was really nice too. It's a casual restaurant - you order at the counter and pick a spot inside or outside to sit at. The place wasn't too big and it was really crowded already at on off hour so probably not best for large groups.\n\nI ordered the tagliatelle pasta with meatballs sauce (Bolognese sauce and 2 meatballs) for $12. It came with cheese on top and was served piping hot on a paper plate. The serving size was large and well worth the price! The meatballs were insanely good and the pasta tasted so fresh. I'm a huge fan and will definitely be back to try the other pasta and sauce combos.", "rating": 5, "date": "2015-11-15"}, {"excerpts": ["The dishes were a gnocchi with pesto and a tagliatelle pasta with a bolognese sauce. ", "Simply stunning. "], "author": "Cortney T.", "review": "Saw other reviews about this place and expected it to be good. To say the least, we were amazed at how awesome this place is! \n\nGreat food, friendly staff and cozy atmosphere. \n\nThe dishes were a gnocchi with pesto and a tagliatelle pasta with a bolognese sauce. Simply stunning. Fresh, aromatic and pasta that was cooked to perfection. \n\nWe would definitely go back again the next time we visit and we will surely recommend this place to others!", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["Had their tagliatelle pasta with meatballs and bolognese sauce and it was BOMB. ", "Great flavor. ", "The texture of the meatball was unique too (dont know if in a good or bad way) but I liked the overall taste. ", "Although it is on the pricier side."], "author": "Danny F.", "review": "Oh. My. Damn. Had their tagliatelle pasta with meatballs and bolognese sauce and it was BOMB. Great flavor. The texture of the meatball was unique too (dont know if in a good or bad way) but I liked the overall taste. Although it is on the pricier side.", "rating": 5, "date": "2017-02-28"}, {"excerpts": ["I had the Tagliatelle pasta with Bolognese cream sauce, a truly excellent and flavorful meal. ", "The cooking staff had excellent, quick service with our pasta orders and the cashier was especially friendly. "], "author": "Kellen W.", "review": "Having just moved to the neighborhood recently, I have made it a personal mission to find the truly authentic and most delicious Italian restaurants in North Beach. There is a wide variety of high quality Italian food in this area of San Francisco, and each restaurant has its own signature menu item, dinner atmosphere and food serving style. It is truly one of the best parts of the city for this cuisine, and tonight I discovered one of my new favorite places for homemade Italian food.\n\nWhen I had a good friend of mine from another part of the Bay Area come to visit me in this area tonight  I wanted to try a new place that serves tasty pasta with fast service and an authentic Italian feel. This is exactly what I experienced at The Italian Homemade Company. I had the Tagliatelle pasta with Bolognese cream sauce, a truly excellent and flavorful meal. The cooking staff had excellent, quick service with our pasta orders and the cashier was especially friendly. It had a nice relaxing atmosphere as well as authentic Italian pastas, sauces, oils, coffees and more items for sale to use for home cooking.\n\nI definitely will come back again to try more of their tasty pasta combinations, as well as other enticing menu items.", "rating": 5, "date": "2015-07-02"}, {"excerpts": ["Had the tagliatelle pasta with marinara and husband had the meatball flatbread. ", "Disappointed! ", "The sauce is from a jar and tastes terrible. ", "The gal at the counter seemed initially nice, but when I asked about the sauce, she sneered and said, \"you are an american and this is how it's made in Italy... ", "You are not used to good sauce and pasta in America.\"  ", "Ok, I've been to Italy and the sauce/ pasta is fantastic. ", "It is anything but what this place offers. ", "My husband said his sandwich was \"bleah.", "\" ", "I did not finish, because it was inedible. ", "One kid sitting near us kept telling his parents that his flatbread sandwich was awful. ", "Parents did not look happy with their dishes either. ", "Can someone please recommend a good, authentic, moderately priced Italian somewhere else in San Francisco, away from the tourist trap Italian eateries of North Beach? ", "Oh yes, and that serves wine?"], "author": "Shelley K.", "review": "Seriously, how can you give Italian Homemade good reviews?!! This place is awful.Don't be misled by some of the photos! We were looking forward to having lunch here. Never again. How can Italian Homemade even look people in the eye? Maybe the pasta is made there but mine was soggy. Had the tagliatelle pasta with marinara and husband had the meatball flatbread. Disappointed! The sauce is from a jar and tastes terrible. The gal at the counter seemed initially nice, but when I asked about the sauce, she sneered and said, \"you are an american and this is how it's made in Italy... You are not used to good sauce and pasta in America.\"  Ok, I've been to Italy and the sauce/ pasta is fantastic. It is anything but what this place offers. My husband said his sandwich was \"bleah.\" I did not finish, because it was inedible. One kid sitting near us kept telling his parents that his flatbread sandwich was awful. Parents did not look happy with their dishes either. Can someone please recommend a good, authentic, moderately priced Italian somewhere else in San Francisco, away from the tourist trap Italian eateries of North Beach? Oh yes, and that serves wine?", "rating": 1, "date": "2017-09-09"}, {"excerpts": ["I had the tagliatelle pasta with the bolognese meat sauce with meatballs. ", "The meatballs were so tasty and tender, and went perfectly with the pasta, which comes out perfectly al dente. ", "Love the set up of the restaurant! ", "Service was friendly, sort of a wait for the food, but everyone knows delicious food comes with a price to pay. ", "Will definitely be coming back soon to try the meat ravioli and lasagna. ", "Lahvvvvv this place!"], "author": "Elizabeth K.", "review": "Delicious pasta. I can really see this place blowing up with business soon. I had the tagliatelle pasta with the bolognese meat sauce with meatballs. The meatballs were so tasty and tender, and went perfectly with the pasta, which comes out perfectly al dente. Love the set up of the restaurant! Service was friendly, sort of a wait for the food, but everyone knows delicious food comes with a price to pay. Will definitely be coming back soon to try the meat ravioli and lasagna. Lahvvvvv this place!", "rating": 5, "date": "2015-10-18"}], "gnocchi roll": [{"excerpts": ["Oh and something called a gnocchi roll, which looks intriguing. "], "author": "Jeffrey S.", "review": "And then, as I was just walking around on Columbus and letting my appetite do the exploring, I stumbled into Italian Homemade. Even though I had actually started at a bakery for pastries, and then gone for truffles, I was still hungry for real food beyond desserts. It's an unassuming joint and looked quick, so I wandered in to the small space with a few tables, and walked up to the counter to look at the menu board and order.\n\nOver and over again I talk about how I love small, specific spots that fill a very small niche. I know it may not be en vogue to have a small menu, but I'd rather you stay in your wheelhouse and nail it, then have a super wide menu that tries too hard to please everyone.\n\nPasta is their game, and they stick to it. Pick your homemade noodle, pick your sauce, add a few bells and whistles if you like, but that's about it. Oh and something called a gnocchi roll, which looks intriguing. But they don't go out of control, and that's what I liked.\n\nI ordered tagliatelle with Bolognese sauce and only waited about 10 minutes, which they actually apologized for being too long. They were incredibly kind, especially as I had just wandered in without doing much research and wasn't sure what to expect. They smiled a lot, and made sure I felt comfortable. That goes a long way.\n\nIt's not fancy inside; the humble interior and homemade feel of things--even the signage--drives home the point that you are getting passion on the plate and not a pre-fab five course meal.\n\nThe pasta came out piping hot. I do love tagliatelle and it's served al dente (which is unexpected for a fresh pasta) but there were a few noodles that didn't get separated from each other and did cause some sticking. I'm not mad, as I like the chew of those stacks, but not everyone does. The Bolognese sauce was meaty enough to convey the carnivorous nature without weighing me down. I didn't feel like it was an overwhelming amount of food, but it's a nice, reasonable lunch.\n\nI sat there for a while as I was eating, at the bar that faces out the window onto Columbus. What a gorgeous street. What a busy, happening place. What a perfect place to slow down, and take it all in. It's so much of what I love about San Francisco--the people, the buzz, the noise, the smells, and most of all, the possibilities. I sat here and imagined coming back to this very block, time and time again. Getting chocolates, then wandering around in an infinite amount of adventures. Trying all the foods, and letting the city take us where it wants. \n\nI imagined the next time I'll be here--it may not be until next year--but what will that be like? Where will I go? Who will come with me for truffles and pastries and homemade pasta, or where will we decide to go instead? In five years, in ten years, as shops open and close, there are infinite adventures to be had. \n\nI sat and thought about all of this, and before I knew it, my tagliatelle was gone. I cleared my plate, took a deep breath, and once again opened to door back out to the street and all the opportunities that were about to present themselves once again.", "rating": 5, "date": "2018-06-19"}, {"excerpts": ["So far I've tried the meat ravioli w/ marinara, pesto gnocchi, and the gnocchi roll w/ marinara and they were all equally amazing in their own way. \n\n"], "author": "Marny N.", "review": "OFFICIALLY THE BEST PASTA I HAVE EVER HAD.\n\nNo fancy Italian spot could possibly beat this place. The ambiance is casual & chill but the food speaks for itself. So far I've tried the meat ravioli w/ marinara, pesto gnocchi, and the gnocchi roll w/ marinara and they were all equally amazing in their own way. \n\nI love the freshness of the pasta & the fact that it's cooked perfectly al dente. The texture could not be more amazeballs. The sauces are all perfectly seasoned and not too heavy, which is great b/c Italian food usually gives me major food coma. Not to mention, the portions are pretty generous and for about $10, you get an amazing plate of comfort food. I have found my new favorite Italian restaurant and I cannot wait to come back. The only downside is the parking situation since it is North Beach, but when there's a will, theres a way.", "rating": 5, "date": "2017-01-23"}, {"excerpts": ["I was gonna try the gnocchi roll specialty ", "but it was out of stock so ill ", "have to come back. ", "My friend really liked his lasagna as well."], "author": "Sean G.", "review": "Some of the best italian food in town. Small quaint spot in little italy where you choose a style of fresh made pasta and a sauce. I had the daily special of gnocchi with calamari amd tomatoes and loved it. All super fresh and tasty and loads of tender squid. Service was casual style but friendly and family ran. I was gonna try the gnocchi roll specialty but it was out of stock so ill have to come back. My friend really liked his lasagna as well.", "rating": 5, "date": "2017-09-16"}, {"excerpts": ["We had the meat ravioli with marinera, gnocchi roll, and lasagna.  ", "Every option incredible!"], "author": "Emilee H.", "review": "Oh. My. Italy.  This is the most exceptional food ever! Don't hesitate coming here, the owners/managers and staff are Italian.  Even the customers are Italian! We were extremely impressed!  We had the meat ravioli with marinera, gnocchi roll, and lasagna.  Every option incredible!", "rating": 5, "date": "2018-08-09"}, {"excerpts": ["We wanted to get a gnocchi roll for the table but unfortunately once we got to the cash register to order they told us they were out of it. ", "I heard the person in front of me in line try to order gnocchi and their pesto sauce, but they were out of that too. ", "Kind of disappointing for those people who waited in line for 20 minutes only to have to frantically change their order at the cash register. ", "We wanted to order wine for the table, but they don't serve alcohol. ", "The things they did have were wonderful, so I'll be back when I'm craving Italian."], "author": "Cameron R.", "review": "Check out talian Homemade Company for a satisfying, FILLING meal. I visited on Saturday evening with a group of four and there was a line out the door. It was packed inside and luckily a spot cleared by the time we ordered so we could sit down. We ordered the burrata salad for the table and everyone enjoyed it. I got the lasagna which was huge and delicious. Everyone else in my party was satisfied by their meals as well. \n\nThey did seem to be out of quite a few things at only 6:30. We wanted to get a gnocchi roll for the table but unfortunately once we got to the cash register to order they told us they were out of it. I heard the person in front of me in line try to order gnocchi and their pesto sauce, but they were out of that too. Kind of disappointing for those people who waited in line for 20 minutes only to have to frantically change their order at the cash register. We wanted to order wine for the table, but they don't serve alcohol. The things they did have were wonderful, so I'll be back when I'm craving Italian.", "rating": 4, "date": "2017-07-27"}, {"excerpts": ["I've also tried their gnocchi roll and Piadina sandwiches - "], "author": "Allen T.", "review": "Italian Homemade has the best pasta in the City - at any price! I'm a big fan of all of their pasta dishes, especially the meat lasagne, which is super stacked with at least 8 (count them!) layers, and their meat tortellini with pesto sauce. Their meatballs are excellent too - very tender, juicy, and meaty.\n\nI've also tried their gnocchi roll and Piadina sandwiches - they're fine, but they don't really compare to their pasta, which is not only handmade but also hand cut! \n\nAlthough their sauces are excellent, I often buy their fresh pasta to cook at home with my own sauce. Although it is pricey at about $12/lb, it's totally worth it, and is noticeably superior to any other fresh store bought pasta.", "rating": 5, "date": "2016-10-28"}, {"excerpts": ["GET THE GNOCCHI AND NOT THE GNOCCHI ROLL!! ", "These are pillows of heaven, so soft! ", "And the pesto is yum. ", "I tried a bite of my friend's dish and it delicious as well! ", "I wish it came with some sort of sauce; it's on the drier side, so we were dipping it in my pesto sauce. "], "author": "Noelle H.", "review": "I was in the area and was looking to grab a quick dinner with friends, so I decided to give Italian Homemade Company another shot. The first time I came, it was just so so, but I figured it was because I ordered the wrong things. \n\nI was originally eyeing the vegetarian cassoni, but unfortunately they were out =( so I decided on the gnocchi with pesto. My friend ordered the cassoni with sausage, bacon, potatoes and mozzarella. \n\nOur orders came out quick and this was much better than before! GET THE GNOCCHI AND NOT THE GNOCCHI ROLL!! These are pillows of heaven, so soft! And the pesto is yum. I tried a bite of my friend's dish and it delicious as well! I wish it came with some sort of sauce; it's on the drier side, so we were dipping it in my pesto sauce. But flavor wise it was on point! \n\nGreat place for an affordable, quick dinner in North Beach.", "rating": 4, "date": "2016-06-30"}, {"excerpts": ["There are also a couple of other specialties, such as meatballs, lasagna... and the gnocchi roll! ", "I had to get this because I was so intrigued. ", "It's essentially three thick slices of gnocchi dough stuffed with spinach and ricotta, and then smothered in marinara sauce. ", "It was fantastic! ", "My friends got more traditional pastas, and they looked very good as well. "], "author": "Dylan C.", "review": "Oh my goodness, the pasta here is so good! I need to keep coming back to try all of the combinations! The menu is pretty simple - you choose the cut of pasta you want and the sauce to go with it. There are prices for both the pasta and the sauce, which is a little weird, but I guess it makes sense. There are also a couple of other specialties, such as meatballs, lasagna... and the gnocchi roll! I had to get this because I was so intrigued. It's essentially three thick slices of gnocchi dough stuffed with spinach and ricotta, and then smothered in marinara sauce. It was fantastic! My friends got more traditional pastas, and they looked very good as well. It was so fun to watch the cooks make the orders while waiting in line, and the fact that they were all talking to each other in Italian made me know this place was legit before I even took a bite of their food.\n\nI'd love someone who is better at math to tell me how many pasta/sauce combinations there are on the menu...", "rating": 5, "date": "2016-05-08"}, {"excerpts": ["I ordered the gnocchi roll stuffed with spinach and ricotta with a layer of their bolognese on top. ", "The taste is indescribable. ", "I would eat it again in a heartbeat. ", "The gnocchi was perfect cooked and the spinach and ricotta were layered throughout. "], "author": "Ashley M.", "review": "I don't even know where to begin with this review. I read up on this place prior to vacationing in San Francisco and it was one of the \"must visit\" locations on my list.\n\nThe place is small-and nestled in the \"Little Italy\" section of San Francisco. So many small mom and pop restaurants surrounded the area and the aroma of amazing food was everywhere-but I had my Target.\n\nWhen we arrived it was packed. In time we would learn it was with good reason. We ordered our meal, grabbed our beverages and found an open table-and were met with someone there to clean it for us.\n\nThe meal arrived not much longer than us sitting down and it was beyond what I anticipated.\n\nI ordered the gnocchi roll stuffed with spinach and ricotta with a layer of their bolognese on top. The taste is indescribable. I would eat it again in a heartbeat. The gnocchi was perfect cooked and the spinach and ricotta were layered throughout. The bolognese was very flavorful and the Parmesan was obviously quality.\n\nIf I lived here-this would be a weekly visit.", "rating": 5, "date": "2017-01-09"}, {"excerpts": ["We ordered the lasagna and gnocchi roll and let me say, some of the best Italian I've ever had. ", "The pasta was as fresh as it gets and the homemade sauces were spot on. ", "I've had authentic Italian food all over Italy during my 4 months of study abroad travel and this was one of the places that actually brought your flavor profiles back. "], "author": "Charlie K.", "review": "This was a smaller, family owned operation located near the wharf. We stopped in based on high reviews on Yelp, as we were craving some Italian food. We ordered the lasagna and gnocchi roll and let me say, some of the best Italian I've ever had. The pasta was as fresh as it gets and the homemade sauces were spot on. I've had authentic Italian food all over Italy during my 4 months of study abroad travel and this was one of the places that actually brought your flavor profiles back. Thank you for a delicious experience -\n\nBest,\nCharlie", "rating": 5, "date": "2015-08-28"}, {"excerpts": ["Lasagna & the gnocchi roll are next on my list.  \n\n"], "author": "Veronica M.", "review": "OMG!  The aromas stemming from this kitchen are so amazing.  You feel as though you just walked right into nonna's kitchen!  Like a fashionista embraced in a cashmere wrap, once you enter you are completely enveloped in homemade Italian goodness.  It's intoxicating & blissfully overwhelming.  \n\nThe staff speaks fluent Italian.  My man (who is 100% Italian) also speaks fluent Italian.  I asked him to ask them what the difference between the piadina & the cassone was, then he explained it to me.  Of course the staff also speaks English, but I let my man take this opportunity to indulge in the language that he grew up speaking.\n\nThe piadina is a flatbread sandwich.  The cassone is a piadina that has been grilled.  \n\nWe ordered everything to go.  \nThe sausage cassone, the special gnocchi entree, & meatballs w flatbread.  \n\nThe cassone is a cleaner & modified version of a calzone.  And much better imo.  Delish.\n\nThe special gnocchi.  Asparagus & speck in a delicious white sauce.  The gnocchi were divine, pillowy perfection.  Dreamy.    \n\nThe meatballs were rich & full of flavor; but the star was the red sauce.  Thick & zesty, we sopped it all up w the flatbread...a perfect marriage.\n\nSeriously, their red sauce & that white gnocchi sauce could turn stale bread into straight up lusciousness on a plate.  \n\nWe enjoyed our dinner w a couple of glasses of red wine.  It was the perfect meal.\n\nUber homey & casual, w an array of outstanding Italian dishes.  Fresh pastas to take home & cook.  Various hot prepared items.  And those fab piadinas & cassones!  Lasagna & the gnocchi roll are next on my list.  \n\nIt's impressively apparent that TIHC is a product of love & passion.  It manifests in everything they prepare.  \n\nTIHC could not be more authentic, warm, or positive.  North Beach has gained an extraordinary addition to the neighborhood.  Mangia mangia!\n\n5 stars.", "rating": 5, "date": "2015-02-08"}, {"excerpts": ["Although I had my heart set on the gnocchi roll, we did ask for a recommendation for the piadine and went with his favorite, the classico.  \n\n", "Gnocchi Roll - Gnocchi is usually not the item I would normally order at an Italian restaurant but knowing that it was freshly made gnocchi dough surrounding spinach and ricotta and sliced so you can make sure you have some of the sweet and tangy tomato sauce in each bite ", "had me sold.  ", "Like Rachael Ray, one of my pet peeves is having a small blob of sauce on top of naked pasta.  ", "Prices run about $10-$12 each I believe for the gnocchi roll and piadine. \n\n"], "author": "Joyce Z.", "review": "Since finding parking in North Beach can be like finding a needle in a haystack, we decided to head over early on a foggy Sunday morning.  We arrived a little after 10:30 and was warmly greeted by Alesandro.  Although I had my heart set on the gnocchi roll, we did ask for a recommendation for the piadine and went with his favorite, the classico.  \n\nGnocchi Roll - Gnocchi is usually not the item I would normally order at an Italian restaurant but knowing that it was freshly made gnocchi dough surrounding spinach and ricotta and sliced so you can make sure you have some of the sweet and tangy tomato sauce in each bite had me sold.  Like Rachael Ray, one of my pet peeves is having a small blob of sauce on top of naked pasta.  Every bite deserves to be enrobed in flavorful sauce.  \n\nClassico Piadine - You cannot go wrong with prosciutto and arugula. The flatbread is thinner than pizza crust so is therefore crunchy but strong enough to hold the ingredients even wrapped like a sandwich.  \n\nPrices run about $10-$12 each I believe for the gnocchi roll and piadine. \n\nThey also had pannetone, sweets including the Spelari nougot, and sauces straight from Italy.  We went with the fresh made pasta (squid ink fettucine and tagliatelle) that you can take to go which averages about $15 per lb with two servings of the ones we got coming in at about 1/2 a lb.  If you want more than a lb I am assuming of each, they do recommend  you calling it in.  Since fresh made pastas have egg in it, make sure you get it right before heading home and in a cooler as it is best kept frozen to avoid sticking.  Once home, put it directly in the freezer and cook within 10-12 days.\n\nCheck out my final product with the fresh Squid Ink Pasta - http://www.cookwithzee.blogspot.com/2015/01/squid-ink-fettucine.html\n\nFinal product with the fresh Tagliatelle - http://www.cookwithzee.blogspot.com/2015/02/sicilian-eggplant-and-pepper-ragu.html", "rating": 4, "date": "2015-01-20"}, {"excerpts": ["For specialties, you just order that (eg lasagna or gnocchi roll). "], "author": "Traci H.", "review": "They know how to make PASTA!!!\n\nThis little north beach gem is full of Italian love. In fact that was the special of the day ;-)\n\nIt's a simple menu and they will help you out. For pasta just choose the kind of pasta you want and the sauce you want. For specialties, you just order that (eg lasagna or gnocchi roll). They also have panini type sandwiches and these big ravioli looking sandwich type things. \n\nSuper fresh pasta and perfectly cooked. \n\nThe sauces are good but it could use a little more oomph. The pesto needed a little more salt and garlic for my taste. \n\nThe lasagna is perfect. Even if it looks like it's been sitting in that pan for a little while, as long as it's fresh you should get it.  The lasagna. The lasagna. The lasagna. I don't think I can eat lasagna anywhere else anymore. \n\nI can't wait to go back!\n\nSmall sitting areas inside and a few outdoor tables too \n\nTakes credit card via square. \n\nNot sure if there's a bathroom.", "rating": 4, "date": "2015-01-11"}, {"excerpts": ["The gnocchi roll ", "I ordered BLEW MY MIND TWICE. ", "I haven't had gnocchi that soft, "], "author": "Irena L.", "review": "Alright people, this place is without a shadow of a doubt INCREDIBLE. \n\n1) The people behind the counter speak italian\n2) Everything is SO fresh\n3) The mozzarella on my salad actually blew my mind. It was so incredibly soft like a pillow of joy\n4) The gnocchi roll I ordered BLEW MY MIND TWICE. I haven't had gnocchi that soft, that puffy, that fresh in YEARS (since I was in Italy, and even then was it this good?)\n\nIf you are questioning coming in...do notttt because it is SO SO worth it.", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["The food was delicious, we had the Gnocchi Roll gnocchi dough filled with spinach and ricotta. ", "and the Cassoni with Italian Sausage, Bacon, Potatoes And Mozzarella Sandwich  both were delicious.  ", "Generous portion size", ", we did not leave hungry.   ", "Wish we could have come back again during our visit.\n", "The have interior and outside seating, nice place for lunch or dinner."], "author": "Marcia M.", "review": "What a great place to get a great Italian meal.  The people are so nice and make you feel at home like you walked into your grandmothers kitchen.  The food was delicious, we had the Gnocchi Roll gnocchi dough filled with spinach and ricotta. and the Cassoni with Italian Sausage, Bacon, Potatoes And Mozzarella Sandwich  both were delicious.  Generous portion size, we did not leave hungry.   Wish we could have come back again during our visit.\nThe have interior and outside seating, nice place for lunch or dinner.", "rating": 5, "date": "2017-10-09"}, {"excerpts": ["We had the veggie lasagna and the gnocchi roll.  ", "Bot were incredible. "], "author": "Etai M.", "review": "Real Italian authentic food and sooo good. The people are happy make you feel like you're on a quick trip to Italy. \n\nWe had the veggie lasagna and the gnocchi roll.  Bot were incredible. Two can share one dish if you're not that hungry. \n\nWould definitely come back as soon as I can. Loved this place", "rating": 5, "date": "2015-08-30"}, {"excerpts": ["They also have a gnocchi roll, meat and vegetarian lasagna, imported meats, and cheeses. ", "Everything is about $9-$13, and portions are massive. ", "Order at the counter and one of the friendly staff will bring your order to you. "], "author": "Cherylynn N.", "review": "One time Mr. NSS' bff told me when he was over at his house, Mr. NSS brought out a plate of fried chicken. He ate it ALL by himself...as his friends watched. \"We were so hungry and was drooling, and he didn't even offer any\", he further stated. \n\nMr. NSS completely denied it.\n\nLast week during a 4th of July gathering, his other bff said:\n\n\"Dude, remember that one time when we were at his house, he brought out a plate of fried chicken, and he ate the entire thing as we sat there watching him?\"\n\nMr. NSS was mid rib at this point with bbq smeared on the side of his face and gave the nonchalant \"so what\" look.\n\nGreat, not only am I dating a messy eater but a selfish, fried chicken hog.\n\nOk, I'll get to the point...\n\nThis came in handy because when we were eating at The Italian Homemade Company, 20 people stared on. Here he is annihilating his food upon arrival without a care in the world while I'm all self-conscious, making sure I take small bites and wiping the corners of my mouth afterwards. You know, pretending like I had manners. \n\nIf you come on the weekends, be prepared for North Beach food tour goers that frequent The Italian Homemade Company. They will watch as you savor every orgasmic bite.     \n\nThanks to Albertino M. for this awesome find. In the sea of North Beach overpriced, tourist traps is gem called The Italian Homemade Company that serves authentic, homestyle Italian cuisine. Even though there's seating, it's seemed more like a to-go place as food is served on paper plates. There's dog-friendly outdoor seating but there's too much commotion in the area that I wouldn't bring Tater Tot. On the menu are fresh, housemade pastas, piadas (Italian flatbread), and cassones (Italian sandwich). Pick your pasta (pappardelle, fettuccine, gnocchi, tagliatelle, squid ink, ravioli, etc.) and then your sauce (bolognese, pasticciata, meatballs, pesto, marinara, white, butter & sage). They also have a gnocchi roll, meat and vegetarian lasagna, imported meats, and cheeses. Everything is about $9-$13, and portions are massive. Order at the counter and one of the friendly staff will bring your order to you. Cc's accepted.\n\nWe shared the Meat Lasagna ($12) and added two meatballs ($1.70 each): http://bit.ly/1LeSZDs. Now this is what I call some good 'ol rustic Italian cuisine. The lasagna had multiple melt in yo mouth layers filled with meaty bolognese sauce that had a wonderful depth of flavor. I prefer my noodles a little more al-dente but there's no denying this was one hearty, comforting dish. The meatballs were deliciously plump, tender, and very flavorful. All we needed was some bread to slop up some of that sauce. \n\nI wish all firsts can be as good as I sunk my teeth into my very first Cassone ($10): http://bit.ly/1JfAmuE. This unassuming Italian sandwich, hot pocket, or whatever you call it was amazing! A large piece of flatbread is filled with mashed potatoes, sausage, cheese, AND bacon, folded in half, and griddled until both sides are golden brown. It's served with a side of béchamel sauce. If a quesadilla knocked up a pierogi, this would be it. Super crunchy on the outside, and warm and oozy in the center. They don't skimp on the sausage and bacon either. I get all warm and fuzzy just thinking about that cassone.\n\nAs we were finishing up lunch, another North Beach food tour group arrived and this little kid in the group gave me the stank eye.\n\nMr. NSS: \"Uhhh, I think you need to take a look in the mirror.\"\nMe: \"Why?\"\n\nMr. NSS: \"You have white sauce smeared on the side of your face and there's a piece of cheese hanging at the corner of your mouth.\"\n\nSo yeah, leave your manners at home (or whatever manners you're pretending to have) because the food is THAT good at The Italian Homemade Company!", "rating": 5, "date": "2015-07-14"}, {"excerpts": ["I had the gnocchi roll and meatballs and they were absolutely delectable...  "], "author": "Michael B.", "review": "Love this place!!!!\n\nCozy little Italian restaurant that makes the most amazing food with such warm hospitality and great service.  Everyone speaks Italian which only makes it that much better..\n\nI had the gnocchi roll and meatballs and they were absolutely delectable...  Seeing people eat other pastas/dishes and hearing them ooh and ahh reaffirms my suspicion that everything these guys serve is amazing and sooooo authentic.\n\nIncredible place.  Highly recommended.", "rating": 5, "date": "2015-10-02"}, {"excerpts": ["The gnocchi roll is a must-try, but really everything is incredibly delicious and comforting.\n\n"], "author": "Tricia R.", "review": "I really enjoy this place--truly tastes homemade! The gnocchi roll is a must-try, but really everything is incredibly delicious and comforting.\n\nWheelchair accessibility notes: The entrance is flat. Most tables (which are quite close together inside) are at bar-height but a really nice waitress went out of her way to find us a normal-height table when it was super crowded and brought us our food when it was ready. Haven't used the bathrooms. Street parking (which is hard to come by) only.", "rating": 4, "date": "2016-09-04"}, {"excerpts": ["A man arrived later than they, had gone up to the counter to order a gnocchi roll. ", "I recall the waitstaff telling me that was good too ", "but it sounded so unusual at the time. ", "We watched the gnocchi roll being served to that man who ordered it.  ", "The gnocchi roll looked like lasagna. ", "But the pasta was made of potato starch. ", "The sauce was rich and flavorful. ", "You could smell the aroma from a few tables down. ", "The girlfriend's beau went to the counter and ordered a gnocchi roll as well.  ", "For a mostly to-go food place the food was all made to order. ", "Thus patience is required. ", "While waiting, I learned that my girlfriend had moved into her beau's house in Inner Richmond, and they were settling down. ", "I happen to be eating out there a lot ", "so I offered them my opinion on the different Burmese places that were around their hood, and how Burmese food has its regional varieties given the influence from neighboring countries. ", "They seemed impressed with my in-depth analysis of a series of Burmese restaurants in their hood, or they were just  extremely polite. "], "author": "Victoria E.", "review": "Several months ago B and I came here in search of something to eat. It was super enticing but we ended up across the street at that sushi place because he did not feel Italian that day. Ever since I learned that he lived, for the most part, at his other place on 7th and Clement, and had a whole other life that I was not aware of, I had declared that 7th and Clement and it's immediate vicinity to be my no-fly zone. Alas, rules like such were made to be bend. From time to time, I continue to hover there, as T lived there too, and we were often out and about, doing our usual official food business. \n\nBut I prefer North Beach more. Yet that day, I was not here with B.  I was here to meet with a girlfriend of mine. And she's going to bring her new boyfriend. As I waited, I ordered the mozzarella and prosciutto sandwich based on the waitstaff's recommendation. The sandwich was served on a thin flat bread. Super delicious. Mouth watering. And the prosciutto was fresh. \n\nI told the waitstaff that I'm sure that my friends who are coming to meet here, would order something here too. You see, she was super sweet. She served my sandwich warm. Already cut up, half in a to-go box and half on a plate. A fast food with superb service. So considerate.\n\nThe girlfriend arrived with her new beau in tow. He was very intrigued about everything that was being served around us. A man arrived later than they, had gone up to the counter to order a gnocchi roll. I recall the waitstaff telling me that was good too but it sounded so unusual at the time. We watched the gnocchi roll being served to that man who ordered it.  The gnocchi roll looked like lasagna. But the pasta was made of potato starch. The sauce was rich and flavorful. You could smell the aroma from a few tables down. The girlfriend's beau went to the counter and ordered a gnocchi roll as well.  For a mostly to-go food place the food was all made to order. Thus patience is required. While waiting, I learned that my girlfriend had moved into her beau's house in Inner Richmond, and they were settling down. I happen to be eating out there a lot so I offered them my opinion on the different Burmese places that were around their hood, and how Burmese food has its regional varieties given the influence from neighboring countries. They seemed impressed with my in-depth analysis of a series of Burmese restaurants in their hood, or they were just  extremely polite. Just then the food arrived. \n\nI eyed their food jealously. Then I went to the counter and ordered one to go. It really could feed a family of four. Tried and true. Totally worth the wait.\n\nTime to head out. Hugs all around. I liked my girlfriend's new beau. As we waved goodbyes,  the beau turned around and said to me, \"You really should come to visit us. We MUST go out to eat. Or grab coffee. You can always find me at Village Market.\" He added.   \n\n\"Sure!\" \"Where do you guys live?\" I came to immediately regret my follow up question. \n\n\"7th and Clement.\" He cheerfully replied.", "rating": 4, "date": "2015-06-01"}, {"excerpts": ["Fresh homemade pasta \"just like momma used to make\" and reasonably priced\n\nI had the gnocchi roll which was excellent and unusual. "], "author": "Michelle S.", "review": "Incredibly good food, great overall experience. Fresh homemade pasta \"just like momma used to make\" and reasonably priced\n\nI had the gnocchi roll which was excellent and unusual. Wish I could have sampled everything on the menu!\n\nThe people who worked there were awesome, Italian accents and great service.\n\nDefinitely check it out!!", "rating": 5, "date": "2015-03-10"}, {"excerpts": ["Next time I come back, I want to try the gnocchi roll and squid ink pasta."], "author": "Victoria C.", "review": "This is definitely my favorite place in North Beach, maybe even my favorite place in San Francisco. The food is incredible, and there is no line (which I find hard to come by in this city).\n\nIt's very casual. Order at the front by choosing a pasta and a sauce. You can sit at one of the outdoor tables as you wait. Your food, served on paper plates, will be brought to you.\n\nThe gnocchi and panna cotta are amazing! The tiramisu is delicious too. Next time I come back, I want to try the gnocchi roll and squid ink pasta.", "rating": 5, "date": "2016-07-06"}, {"excerpts": ["Upon the recommendations from the friendly man behind the counter, we ordered the gnocchi roll, lasagna, veggie ravioli, pappardelle with pesto and a salad.  ", "THE LASAGNA.  ", "That first bite and my eyes rolled back and I went to heaven.  ", "I seriously think you can do no wrong ordering here, but get the lasagna!  ", "It was melt-in-your-mouth super delicious.  "], "author": "Jessica L.", "review": "Put your phones down!\n\nI know it's tempting to hop onto yelp to check out what other people have eaten, but trust in the staff, they'll tell you what's good!  Upon the recommendations from the friendly man behind the counter, we ordered the gnocchi roll, lasagna, veggie ravioli, pappardelle with pesto and a salad.  THE LASAGNA.  That first bite and my eyes rolled back and I went to heaven.  I seriously think you can do no wrong ordering here, but get the lasagna!  It was melt-in-your-mouth super delicious.  Everything is made fresh and you can taste it.\n\nTips and Tricks\n-Don't go too late, they can run out of their specials around or after lunch.\n-The pace looks small, but there's a lot of seating at the counter.\n-My friend was craving garlic bread, but I guess it's not very \"authentic Italian\"", "rating": 5, "date": "2015-01-05"}, {"excerpts": ["I had the fettuccine with meatballs and bolognese sauce and my wife had the gnocchi roll.  ", "We were both very impressed with this food!  ", "The pasta was awesome and cooked perfectly, and the meatballs and bolognese sauce were great!  ", "The gnocchi roll was absolutely amazing as well!  ", "They ran out of the meat lasagne, so I will definitely be back to try it out soon!  ", "Wonderful little restaurant with very friendly staff.  ", "Not a whole lot of seating though."], "author": "Matt E.", "review": "I had the fettuccine with meatballs and bolognese sauce and my wife had the gnocchi roll.  We were both very impressed with this food!  The pasta was awesome and cooked perfectly, and the meatballs and bolognese sauce were great!  The gnocchi roll was absolutely amazing as well!  They ran out of the meat lasagne, so I will definitely be back to try it out soon!  Wonderful little restaurant with very friendly staff.  Not a whole lot of seating though.", "rating": 5, "date": "2016-08-22"}, {"excerpts": ["Gnocchi Roll with bolognese sauce!\n", "Pesto was so fresh and tasty\n", "Lasagna !\n"], "author": "Nobu K.", "review": "The Best of Italian Homemade in the city!\nEspecially:\nCassone w/ Sausage, potato, bacon, & cheese \nGnocchi with Meatballs Ever!\nGnocchi Roll with bolognese sauce!\nPesto was so fresh and tasty\nLasagna !\nMeat Ravioli with pink sauce!\n\nThe Best, I mean it.\nItalian Homemade.\nI still think they should have Italian sandwich roll though.", "rating": 5, "date": "2014-12-18"}, {"excerpts": ["Gnocchi roll is delicious too but wouldn't order again \nPappardelle with meat sauce was fabulous.\n", "Meatballs are fresh and juicy\nWill definitely be back"], "author": "X M.", "review": "Fresh\nDelicious\nPretty fast for homemade\nGnocchi with sage butter is to die for\nGnocchi roll is delicious too but wouldn't order again \nPappardelle with meat sauce was fabulous.\nMeatballs are fresh and juicy\nWill definitely be back", "rating": 5, "date": "2016-03-31"}, {"excerpts": ["The only thing that I would say I wasn't too crazy about was the gnocchi roll, which was good... ", "Just not crazy about it."], "author": "Lana H.", "review": "It was authentic homemade Italian food alright! So good, I love the homemade pasta!! The only thing that I would say I wasn't too crazy about was the gnocchi roll, which was good... Just not crazy about it.", "rating": 5, "date": "2016-05-20"}, {"excerpts": ["The gnocchi roll is heaven on a plate. ", "Seriously. ", "Try it. ", "Did I mention you should try the gnocchi roll?"], "author": "Ananya M.", "review": "The gnocchi roll is heaven on a plate. Seriously. Try it. Did I mention you should try the gnocchi roll?", "rating": 5, "date": "2015-12-14"}, {"excerpts": ["We recently got the gnocchi roll with bolognese and it was perfection. ", "The lasagna is also fantastic and freakin huge. ", "I've also gotten the burrata salad and as much as I love cheese, it was a bit too much burrata for my liking. ", "If you don't eat all of it in one sitting, you can save it for another salad though. "], "author": "Sam L.", "review": "I come here every time I visit my friend in North Beach. So damn good every time. My friend and I always split the pappardelle with meatballs and fettucine with pesto. \n\nWe recently got the gnocchi roll with bolognese and it was perfection. The lasagna is also fantastic and freakin huge. I've also gotten the burrata salad and as much as I love cheese, it was a bit too much burrata for my liking. If you don't eat all of it in one sitting, you can save it for another salad though. I've also tried the ravioli, and it was still really good, just not my favorite. \n\nI will be back again and again!!!", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["I ordered the ever popular spinach and ricotta gnocchi roll with bolognese sauce ($12) and everything was well-executed.  ", "Surprisingly it was super filling even though the portion size didn't appear that hefty!  ", "I definitely suffered from food coma the rest of the evening...  ", "I also tried my friend's meatballs and they were super tender and flavorful.  ", "The flatbread was also nicely chewy despite being so thin - next time totally want to try a flatbread sandwich!"], "author": "Beatrice W.", "review": "The Italian Homemade Company is a casual joint serving Italian comfort food.  Pasta dishes are $10-12, or you can buy fresh pasta to cook at home.  We had to circle around for 20+ minutes looking for parking on a late Sunday afternoon, but thankfully our meal was worth it.  I ordered the ever popular spinach and ricotta gnocchi roll with bolognese sauce ($12) and everything was well-executed.  Surprisingly it was super filling even though the portion size didn't appear that hefty!  I definitely suffered from food coma the rest of the evening...  I also tried my friend's meatballs and they were super tender and flavorful.  The flatbread was also nicely chewy despite being so thin - next time totally want to try a flatbread sandwich!", "rating": 4, "date": "2015-10-03"}, {"excerpts": ["I recommend the Gnocchi Roll ", "but you basically can't go wrong no matter what you get. ", "Yum yum"], "author": "Amir M.", "review": "Delicious pasta and even more amazing sauces. Very low-key and non pretentious. I recommend the Gnocchi Roll but you basically can't go wrong no matter what you get. Yum yum", "rating": 5, "date": "2015-09-06"}, {"excerpts": ["Gnocchi roll - you MUST get this! ", "Such a unique and delicious dish. ", "Basically like a gnocchi filling wrapper inside this soft bread roll, with marinara sauce. ", "So so good and big service sizes!\n", "2. ", "Fettuccine pasta with pesto - simple and probably my least favorite out of the three things we got, but only because we didn't see the crushed red pepper / condiments table ", "so it tasted a little bland. ", "But the fettuccine tasted extremely fresh and I liked that the pesto wasn't too oily.\n", "3. ", "Burrata salad - Definitely recommend this one. ", "The burrata serving is generous and comes with balsamic vinegar, grape tomatoes and salad. "], "author": "Anu P.", "review": "Came here with two girlfriends on a Saturday night for dinner. We arrived around 6:30 and am glad we did because by 7pm, there was a line forming (closes at 8pm). \n\nBig menu but pretty simple items. We ordered:\n1. Gnocchi roll - you MUST get this! Such a unique and delicious dish. Basically like a gnocchi filling wrapper inside this soft bread roll, with marinara sauce. So so good and big service sizes!\n2. Fettuccine pasta with pesto - simple and probably my least favorite out of the three things we got, but only because we didn't see the crushed red pepper / condiments table so it tasted a little bland. But the fettuccine tasted extremely fresh and I liked that the pesto wasn't too oily.\n3. Burrata salad - Definitely recommend this one. The burrata serving is generous and comes with balsamic vinegar, grape tomatoes and salad. Good healthy addition to an otherwise rich / heavy meal. \n\nTips / Comments:\n+Arrive early to snag seats at dinner\n+Sit inside and explore - cute trinkets, sauces, baguettes and they even sell boxed pasta! \n+Get the gnocchi, but also explore some of their other pastas (which I wish I did in hindsight), like the fresh ravioli or the sandwiches! \n+Amazing staff - we got checked on twice and the staff was extremely friendly / helpful\n+Great music (no background, boring music) - lots of 90s / rock, loved it", "rating": 4, "date": "2015-04-15"}, {"excerpts": ["We had to try the gnocchi roll, which I recommend to anyone who hasn't tried it. ", "We topped with meat sauce and additional meatballs for a completely delicious and filling meal. ", "I think we will stop by here each time were in town."], "author": "Rhonda L.", "review": "Don't let the fast food environment fool you, this food is awesome. We had to try the gnocchi roll, which I recommend to anyone who hasn't tried it. We topped with meat sauce and additional meatballs for a completely delicious and filling meal. I think we will stop by here each time were in town.", "rating": 5, "date": "2015-09-06"}, {"excerpts": ["The Gnocchi Roll is absolutely amazing, wonderful texture, fully warm all throughout, and with a perfect ratio of gnocchi to ricotta / spinach that I have yet to have topped.\n\n"], "author": "Nijiko Y.", "review": "I've been here many times, and without a doubt this is some of the most authentic Italian food you can get in the city.\n\nYou'll leave the table feeling full from the generous portions. The Gnocchi Roll is absolutely amazing, wonderful texture, fully warm all throughout, and with a perfect ratio of gnocchi to ricotta / spinach that I have yet to have topped.\n\nThe second dish I would highly recommend is the Pasta Bolognese, once again another very authentic Italian dish that makes my mouth water every time I even think about it. The noodles are done the traditional Italian way, al dente, the sauce isn't overbearing or too much, and the meat blends in very well with the dish. It's perfect.\n\nThe restaurant itself feels like a deli or cafe, so it appears more traditional and it has limited seating, so prepare yourself if you're going to drop in. With the extremely warm owners, exceptional staff, and environment, I have to rate it as a 5 star restaurant.", "rating": 5, "date": "2015-03-05"}, {"excerpts": ["The Gnocchi Roll special with flat bread was amazing."], "author": "Jacob J.", "review": "Great find if you don't have a lot of time.  Even though it was busy, by the time we entered and had food at our table it had only been 10 mins.  The Gnocchi Roll special with flat bread was amazing.", "rating": 5, "date": "2016-10-21"}, {"excerpts": ["The gnocchi roll is so good! ", "We tried it on the Taste Buds Tour, our first stop in North Beach. ", "It was handmade and fresh with spinach, gooey mozzarella cheese, and tomato paste. ", "My friends and I came back and got the meatball, ravioli with white sauce, and pesto pasta. ", "They were all amazing."], "author": "Elise G.", "review": "The gnocchi roll is so good! We tried it on the Taste Buds Tour, our first stop in North Beach. It was handmade and fresh with spinach, gooey mozzarella cheese, and tomato paste. My friends and I came back and got the meatball, ravioli with white sauce, and pesto pasta. They were all amazing.", "rating": 5, "date": "2016-04-05"}, {"excerpts": ["I had the gnocchi roll, and it was perfect. ", "All the flavors were great. \n ", "Also tried the tortellini with pesto. ", "It was a little too oily. ", "But if you like a strong pesto flavor it was good. \n", "Everyone spoke Italian that worked there, I certainly got a home vibe from it. \n", "They don't have a lot of variety when it comes yo food, but what they do have is the best!"], "author": "Valerie J.", "review": "Really small place, but definitely delecious. The homemade pasta was so good. I had the gnocchi roll, and it was perfect. All the flavors were great. \n Also tried the tortellini with pesto. It was a little too oily. But if you like a strong pesto flavor it was good. \nEveryone spoke Italian that worked there, I certainly got a home vibe from it. \nThey don't have a lot of variety when it comes yo food, but what they do have is the best!", "rating": 4, "date": "2015-01-06"}, {"excerpts": ["A trio of Italian employees took out orders but only after giving us recommendations; try the Gnocchi roll!\n", "Pasta made to order, eat in or take away and other items like sauces were for purchase. ", "The tables seat two at the most both indoor & outdoor seating. ", "Very simple but good, frequented by locals; shhhhh don't tell the tourists!"], "author": "David P.", "review": "My friend Bessie and I were going to see our friend funny woman Carla Clay perform at Cobbs Comedy but before the show we wanted to grab a bite to eat. We walked up Columbus but to be honest I wasn't in the mood for a crowded, popular/trendy packed North Beach experience, I wanted something more relaxed, off the beaten path, authentic but good. I just happened to glance to the left and it was as if this small Italian restaurant  said, \"Mangia!\" A trio of Italian employees took out orders but only after giving us recommendations; try the Gnocchi roll!\nPasta made to order, eat in or take away and other items like sauces were for purchase. The tables seat two at the most both indoor & outdoor seating. Very simple but good, frequented by locals; shhhhh don't tell the tourists!", "rating": 5, "date": "2015-01-22"}, {"excerpts": ["Gnocchi roll was TO DIE FOR! ", "I got it with the bolgnese sauce and it was absolutely heavenly. ", "The staff were very helpful in suggesting dishes. ", "My friend got ravioli (I think), and we got meatballs on the side too. ", "EVERYTHING was so so so so good. ", "Believe the hype, wait in line if you have to. ", "You will not regret it."], "author": "Miranda Z.", "review": "Gnocchi roll was TO DIE FOR! I got it with the bolgnese sauce and it was absolutely heavenly. The staff were very helpful in suggesting dishes. My friend got ravioli (I think), and we got meatballs on the side too. EVERYTHING was so so so so good. Believe the hype, wait in line if you have to. You will not regret it.", "rating": 5, "date": "2015-12-30"}, {"excerpts": ["They also have a fabulous lunch and gnocchi roll. ", "Don't forget to order the bishop hats!"], "author": "Natalee T.", "review": "I thought this was just another Italian restaurant in in North Beach, but I was wrong.  This little place has amazing to go Italian, so I can take it back to my house and pretend i made it myself!  They also have a fabulous lunch and gnocchi roll. Don't forget to order the bishop hats!", "rating": 5, "date": "2015-04-30"}, {"excerpts": ["I got the gnocchi roll, which was unique and ", "like nothing I'd ever had or heard of before. ", "It was denser than my friend's gnocchi (which was literally like eating a pillow - amazing!) ", "and it was rolled in a pin wheel shape, stuffed with spinach and ricotta, and then cooked in marinara sauce. ", "One of my friends got the gnocchi with pesto, and the other got the pappardelle special, which was essentially in a carbonara sauce. ", "Everything was delicious, and was not overly heavy or salty, which is one of my biggest pet peeves with food in general. ", "I'd much rather have something bland than overly salty any day. ", "Italian food also usually leaves me feeling gross after, no matter how good it is, but I didn't get this with their food which was an unexpected plus. ", "The service there is also prompt and friendly, and the cooks and workers seem to have a family-like feel. ", "If you've never tried this place, I would definitely recommend trying it out!"], "author": "Michelle K.", "review": "I tried this place for the first time for a take-out dinner with two of my friends yesterday. One of them lives in the area and had eaten here several times before, so we took up his recommendation for a home style meal with some good comfort food. This place definitely didn't disappoint - it looks very unassuming from the outside, but the quality and taste of the food is up to par, very authentic, and you can tell that they put a lot of time and care into everything made there. The interior and set-up reminds me of something you would actually find in Europe - very homey, casual, and cozy. This is the type of place where you can grab a quick bite and eat at the small round tables they have set up inside with a small group of friends, or order there and take it to-go, like we did. They also have freshly made, frozen pasta that you can buy and make at home too.\n\nI got the gnocchi roll, which was unique and like nothing I'd ever had or heard of before. It was denser than my friend's gnocchi (which was literally like eating a pillow - amazing!) and it was rolled in a pin wheel shape, stuffed with spinach and ricotta, and then cooked in marinara sauce. One of my friends got the gnocchi with pesto, and the other got the pappardelle special, which was essentially in a carbonara sauce. Everything was delicious, and was not overly heavy or salty, which is one of my biggest pet peeves with food in general. I'd much rather have something bland than overly salty any day. Italian food also usually leaves me feeling gross after, no matter how good it is, but I didn't get this with their food which was an unexpected plus. The service there is also prompt and friendly, and the cooks and workers seem to have a family-like feel. If you've never tried this place, I would definitely recommend trying it out!", "rating": 4, "date": "2016-04-08"}, {"excerpts": ["I had the gnocchi roll with meatballs and a Flatbread sandwich. ", "The gnocchi roll with spinach was great with the homemade sauce and the meatballs were the perfect mix of spices, pork, and beef. ", "I took the food back to the hotel ", "were I enjoyed it ", "oh so well. ", "This place is for real, and I will be back."], "author": "Jim P.", "review": "Well I have to say WOW. I went there not knowing what to expect.  It is absolutely authentic from the people that wait on you to the food. I had the gnocchi roll with meatballs and a Flatbread sandwich. The gnocchi roll with spinach was great with the homemade sauce and the meatballs were the perfect mix of spices, pork, and beef. I took the food back to the hotel were I enjoyed it oh so well. This place is for real, and I will be back.", "rating": 5, "date": "2015-02-15"}, {"excerpts": ["The gnocchi roll was amazing if you like gnocchi."], "author": "Joe R.", "review": "Found this place on YELP and loved it.  Kids loved the ravioli and they made plain pasta for the boy.  The gnocchi roll was amazing if you like gnocchi.", "rating": 5, "date": "2015-01-18"}, {"excerpts": ["Tried Veg Ravioli with Mushroom sauce and Gnocchi roll. ", "The hype had raised our expectations. ", "Sadly, our experience turned out to be rather underwhelming. ", "I have this irrational preference for food that's served hot. ", "Ours was not. ", "And if this Gnocchi was soft, I don't feel any appetite for the hard ones. ", "Because the quantity turned out to be too much for two of us. ", "This place is pricey, busy, and the food fails to make up."], "author": "Abhishek D.", "review": "Tried Veg Ravioli with Mushroom sauce and Gnocchi roll. The hype had raised our expectations. Sadly, our experience turned out to be rather underwhelming. I have this irrational preference for food that's served hot. Ours was not. And if this Gnocchi was soft, I don't feel any appetite for the hard ones. Because the quantity turned out to be too much for two of us. This place is pricey, busy, and the food fails to make up.", "rating": 2, "date": "2015-05-22"}, {"excerpts": ["The gnocchi roll with meat sauce is where it's at."], "author": "Casey P.", "review": "So good! Friendly service and amazing, fresh food! The gnocchi roll with meat sauce is where it's at.", "rating": 5, "date": "2014-12-20"}, {"excerpts": ["My husband ordered the gnocchi roll with red sauce ", "and I had a flat bread sandwich with prosciutto, cheese and arugula. ", "They were all so very delicious. ", "Nothing froze or artificial going on here! ", "It was just like eating at our friends home (who are also Italian). ", "I would highly recommend eating here if you are in the neighborhood! ", "Can't wait to go back!"], "author": "Karen J.", "review": "We love to find new and unique places to eat in the city. We decided to try out The Italian Homemade Company for lunch on a Saturday afternoon. We took a walk through streets of little Italy to find this gem! It is not very spacious but perfect for us 3! We each ordered something different so we could all share and experience different items from the menu My son ordered the gnocchi with the white sauce, and a meat lasagna. My husband ordered the gnocchi roll with red sauce and I had a flat bread sandwich with prosciutto, cheese and arugula. They were all so very delicious. Nothing froze or artificial going on here! It was just like eating at our friends home (who are also Italian). I would highly recommend eating here if you are in the neighborhood! Can't wait to go back!", "rating": 5, "date": "2015-01-08"}, {"excerpts": ["I'm especially fond of the gnocchi roll, and my boyfriend and friends have confirmed the lasagna is the best they have ever had. ", "Keep in mind they close kind of early though (8 pm), so if you're a late eater like me, make a point to remember to go earlier."], "author": "Anna J.", "review": "North beach is full of Italian food, so I wasn't too excited when another Italian place opened up but honestly, this place is better than 98% of the rest of north beach Italian. This little place blew my mind! I live a couple blocks away, so Italian Homemade Co. is very convenient (perhaps a little too convenient for my waistline...). The food is absolutely incredible and the staff is helpful and friendly. I'm especially fond of the gnocchi roll, and my boyfriend and friends have confirmed the lasagna is the best they have ever had. Keep in mind they close kind of early though (8 pm), so if you're a late eater like me, make a point to remember to go earlier.", "rating": 5, "date": "2015-04-29"}, {"excerpts": ["We had the Piata sandwich and the gnocchi roll, which is gnocchi dough rolled out and filled with spinach and ricotta. ", "They were both delicious. ", "For the good and a large San Peligrino, the tab was $30. ", "The staff was very friendly and approachable."], "author": "Rachael W.", "review": "A great casual dinner. The restaurant is cute, but small. We had the Piata sandwich and the gnocchi roll, which is gnocchi dough rolled out and filled with spinach and ricotta. They were both delicious. For the good and a large San Peligrino, the tab was $30. The staff was very friendly and approachable.", "rating": 5, "date": "2015-01-03"}, {"excerpts": ["I would not re order the gnocchi roll again ", "but it was nice trying it out."], "author": "Nancy Y.", "review": "It's a warm and cute place for lunch in North Beach. The servers and staff were dressed up for Christmas. I don't like overpaying for pasta but these were perfect portions for one person and you could get a couple to share with friends easily. Get here before 11:45am to avoid the lunch rush and to grab a seat. I would not re order the gnocchi roll again but it was nice trying it out.", "rating": 3, "date": "2015-12-25"}, {"excerpts": ["My two favorites are the gnocchi roll and the pappardelle with bolognese but you really can't go wrong here. ", "Not a large seating area and I'd recommend this place for lunch or a casual dinner. ", "I've eaten my fair share of italian food in the north end in boston and now SF and their pasta dishes rank close to the top of my favorites."], "author": "John R.", "review": "Some of the best, authentic Italian food in North Beach. Nothing fancy with a menu mostly consisting of homemade pasta dishes. My two favorites are the gnocchi roll and the pappardelle with bolognese but you really can't go wrong here. Not a large seating area and I'd recommend this place for lunch or a casual dinner. I've eaten my fair share of italian food in the north end in boston and now SF and their pasta dishes rank close to the top of my favorites.", "rating": 5, "date": "2015-06-26"}, {"excerpts": ["I had the gnocchi roll covered with bolognese sauce and loved it. ", "I finished it off with a delicious tiramisu ", "and I was stuffed. ", "I actually ate here two nights  in a row and enjoyed both times equally as much. ", "The was quite impressive as well. ", "She actually remembered what I ordered the previous night. ", "She said it was just because it was a slow night, I think it is because I am such a handsome fellow from Wisconsin haha. ", "Great food and great service. ", "I will have another Gnocchi roll before I leave town."], "author": "Chad T.", "review": "I had the gnocchi roll covered with bolognese sauce and loved it. I finished it off with a delicious tiramisu and I was stuffed. I actually ate here two nights  in a row and enjoyed both times equally as much. The was quite impressive as well. She actually remembered what I ordered the previous night. She said it was just because it was a slow night, I think it is because I am such a handsome fellow from Wisconsin haha. Great food and great service. I will have another Gnocchi roll before I leave town.", "rating": 5, "date": "2015-08-01"}], "meatballs with piadina flatbread": [{"excerpts": ["I generally avoid getting pasta to-go as it gets soggy and lumpy by the time you get home, so after going through the menu I decided to get the Meatballs with Piadina Flatbread ($11). "], "author": "Ahmad J.", "review": "Italian Homemade Company popped up as the first restaurant when searching for Italian food in Russian Hill. It seemed to have good reviews and had an online ordering app on Yelp so I decided to give it a try. The menu is your standard Italian fare with salads, sandwiches, pasta, lasagna etc. I generally avoid getting pasta to-go as it gets soggy and lumpy by the time you get home, so after going through the menu I decided to get the Meatballs with Piadina Flatbread ($11). I honestly did not know what \"Piadina\" was, but went with it keeping an open mind.\n\nI reached the restaurant (It's on Columbus just ahead of Washington Square) 20 minutes after ordering to find that my food was ready so I was on my way. I got a heavy container with the meatballs along with the flatbread that was neatly wrapped in a silver foil. There were 6 huge meatballs. I mean these were gigantic. Unfortunately they were frozen solid. The plastic fork broke into pieces without even making a dent in these. The meatballs had to have been taken out of a freezer and used without thawing them out first. I am not sure what these folks were thinking when they gave me frozen meatballs. Would I not notice? Would they thaw out on the way home? Well, No & No. I let them stand for an hour hoping that they would thaw out. What these needed was about 3-4 minutes in a microwave, as I did not have one, I could not do much except to safely confine them in the trash. The flatbread was thin with a light dusting of raw flour. It was not built to soak up the sauce that came with the meatballs but could be used like a spoon to scoop up the sauce to quench my hunger.\n \nPrice wise this dish was cheap for the location. Most of the pastas on the menu are around the $15 mark which is also a little less when compared to other Italian places in the area. There are a ton of Italian restaurants to try in the area so I have no intention of returning here after this experience.", "rating": 1, "date": "2017-07-17"}]}