{"bacon  swiss buttery jack combo": [], "classic buttery jack combo": [], "sourdough jack combo": [], "jumbo jack cheeseburger combo": [], "double jack combo": [], "ultimate cheeseburger combo": [], "bacon ultimate cheeseburger combo": [], "spicy sriracha burger combo": [], "jacks spicy chicken combo": [], "sourdough grilled chicken club combo": [], "homestyle ranch chicken club combo": [], "crispy chicken strips combo  pieces": [], "chicken nuggets combo  pieces": [], "chicken fajita pita combo": [], "chicken teriyaki bowl combo": [], "supreme croissant combo": [], "sausage croissant combo": [], "grande sausage burrito combo": [], "meat lovers burrito combo": [], "sausage egg  cheese biscuit combo": [], "bacon egg  cheese biscuit combo": [], "loaded breakfast sandwich combo": [], "extreme sausage sandwich combo": [], "ultimate breakfast sandwich combo": [], "grilled breakfast sandwich combo": [], "jumbo breakfast platter  bacon combo": [], "jumbo breakfast platter  sausage combo": [], "jumbo breakfast platter  bacon  sausage combo": [], "breakfast jack combo": [], "bacon breakfast jack combo": [], "sausage breakfast jack combo": [], "bacon  egg chicken sandwich combo": [], "country scrambler plate  link combo": [], "country scrambler plate  sausage combo": [], "country scrambler plate  bacon combo": [], "country scrambler plate  link  sausage combo": [], "country scrambler plate  link  bacon combo": [], "brunch burger combo": [], "sriracha curly fry burger meal daytime": [], "stacked grilled cheeseburger munchie meal daytime": [], "chickntater munchie meal daytime": [], "spicy nacho munchie meal daytime": [], "sriracha curly fry burger meal nighttime": [], "stacked grilled cheeseburger munchie meal nighttime": [], "chickntater munchie meal nighttime": [], "spicy nacho munchie meal nighttime": [], "seasoned curly fries": [], "regular fries": [{"excerpts": ["Ordered regular fries with my order because I hate curly fries for their dryness. ", "Got it wrong both times that I came here. ", "Ordered a monster taco, wasn't in my order both times as well. ", "I do accept that it is my fault because people always tell me to check my  bag before I drive off because once you drive off they can make up any bullshit just to avoid finding a solution. ", "I usually don't check because I know what it feels like to wait ", "and I don't like making people wait that are behind me in line. ", "Moral of the story is spend that 10 seconds to check your bag to make sure they got it ", "all right. ", "I understand we all make mistakes ", "but either I'm unlucky ", "or it's just shitty service they don't even check what they send out"], "author": "Michael C.", "review": "I usually work night shift so when I leave work I get fast food from the drive through . Simple . I  put my order in and wait. It's fast food so how could anything possibly go wrong. Ordered regular fries with my order because I hate curly fries for their dryness. Got it wrong both times that I came here. Ordered a monster taco, wasn't in my order both times as well. I do accept that it is my fault because people always tell me to check my  bag before I drive off because once you drive off they can make up any bullshit just to avoid finding a solution. I usually don't check because I know what it feels like to wait and I don't like making people wait that are behind me in line. Moral of the story is spend that 10 seconds to check your bag to make sure they got it all right. I understand we all make mistakes but either I'm unlucky or it's just shitty service they don't even check what they send out", "rating": 2, "date": "2017-10-24"}], "bacon cheddar potato wedges": [{"excerpts": ["SO GOOD *drools* and the bacon cheddar potato wedges drenched in their butter milk sauce,. "], "author": "Chanel L.", "review": "Jack IN the CRACK.. only good when DRUNK and after a night of partying.  If you eat this when you're sober,.. prepare to fill GROSS!\n\nI only do take out/ drive thru.. \n\nI must do the jalepeno poppers,. SO GOOD *drools* and the bacon cheddar potato wedges drenched in their butter milk sauce,. O M G ! \n\nSometimes they charge you 25 cents each, for the butter milk sauce,.. If jack in the box EVER discontinues the buttermilk sauce,. I don't think I will be eating at jack in the box so often,..   \n\nMake sure you check your bag before leaving the window,. sometimes they forget a few items,. but I'm sure everyone does this after leaving any fast food drive thru places =)", "rating": 4, "date": "2010-06-06"}], "egg roll": [{"excerpts": ["Only thing they got right was my 3piece egg roll that's it. ", "And the food was alright. ", "Don't waste your time here tho."], "author": "Manuel H.", "review": "I asked for two 20 piece nuggets but got two 10 piece  churros. I asked for the nuggets after I found out and they gave them to me. I also asked for two bbq bacon burgers. They gave me 2 bbq bacon chicken sandwiches which I figured out after leaving. . Cmon! Idc anymore and just left after I got the nuggets. Didn't want to waste my time anymore. Only thing they got right was my 3piece egg roll that's it. And the food was alright. Don't waste your time here tho.", "rating": 1, "date": "2017-05-28"}, {"excerpts": ["Egg roll :)\n", "Variety of sandwiches/burger :)\nNo fish burger??? ", ":(\nHigh cholesterol :(\n", "What can I say, ", "but... great place to get some snack after a wholesome of clubbing :)"], "author": "dannydan d.", "review": "Fast food at 2 AM? Yes :) \nDebit/Credit card accepted :)\nCurly fries :)\nEgg roll :)\nVariety of sandwiches/burger :)\nNo fish burger??? :(\nHigh cholesterol :(\nWhat can I say, but... great place to get some snack after a wholesome of clubbing :)", "rating": 4, "date": "2007-07-19"}], "stuffed jalapenos": [], "panko onion rings": [], "side salad": [], "original monster taco": [], "bacon ranch monster taco": [], "nacho monster taco": [], "chocolate overload cake": [], "mini churros  pieces": [], "jumbo jack": [{"excerpts": ["This place is ghetto, they refuse to honor the 49ers take away promo that jack in the box offers which gives you a free jumbo jack with the purchase of a large fountain drink the day after the 49ers game. ", "Other location like the one on Geary Blvd honored the promo. ", "I have filed a corporate complaint to investor relations and better business bureau regarding this. ", "This is clearly false advertisement and fraud."], "author": "Chloe W.", "review": "This place is ghetto, they refuse to honor the 49ers take away promo that jack in the box offers which gives you a free jumbo jack with the purchase of a large fountain drink the day after the 49ers game. Other location like the one on Geary Blvd honored the promo. I have filed a corporate complaint to investor relations and better business bureau regarding this. This is clearly false advertisement and fraud.", "rating": 1, "date": "2016-09-13"}, {"excerpts": ["I love the Jumbo Jack and curly fries!"], "author": "Agent K.", "review": "This place has always been good to me. The staff is laid back and the food is consistent. The drive-thru is 24 hours and can get busy at night. This is the best fast food joint on Bayshore. I love the Jumbo Jack and curly fries!", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["Nothing like going to Jack-in-the-Crack to get your 99 cent tacos and Jumbo Jack in the middle of the night.  ", "I swear that this place has the longest line for a drive through...it goes out all the way to Bayshore Blvd. ", "I always make sure I lock my doors. ", "This is suppose to be a fast food joint, but the workers are soooo S-L-O-W!!!!"], "author": "hello k.", "review": "Nothing like going to Jack-in-the-Crack to get your 99 cent tacos and Jumbo Jack in the middle of the night.  I swear that this place has the longest line for a drive through...it goes out all the way to Bayshore Blvd. I always make sure I lock my doors. This is suppose to be a fast food joint, but the workers are soooo S-L-O-W!!!!", "rating": 3, "date": "2007-01-04"}], "jr jumbo jack": [], "jr bacon cheeseburger": [], "value fries": [], "value drink": [], "two tacos": [{"excerpts": ["I ordered a two tacos and a ultimate cheeseburger. ", "It's not bad for the value aspect. ", "It's Jack in da box. ", "I really feel silly but their commercials actually work on me. ", "I wound up giving away a taco and 50 cents to a homeless dude waiting outside the drivethru.  ", "It's true what they say about this place. ", "There's some ghetto feel to it? ", "Loud music and weird elements thats why i went through the drive through.", "There's really messed up dudes and females loitering. ", "But just don't make eye contact and just jet. ", "The homeless guy complimented my car and ask me if it was fast? ", "he said he was working on picking himself a car in the future? ", "I don't know bout that cuz he had serious health issues. ", "His hands were swollen and fingers cracked. ", "Sometimes you have to go out and experience all of san francisco. ", "Not just the pretty parts."], "author": "Selby C.", "review": "I thought it was cool. I ordered a two tacos and a ultimate cheeseburger. It's not bad for the value aspect. It's Jack in da box. I really feel silly but their commercials actually work on me. I wound up giving away a taco and 50 cents to a homeless dude waiting outside the drivethru.  It's true what they say about this place. There's some ghetto feel to it? Loud music and weird elements thats why i went through the drive through.There's really messed up dudes and females loitering. But just don't make eye contact and just jet. The homeless guy complimented my car and ask me if it was fast? he said he was working on picking himself a car in the future? I don't know bout that cuz he had serious health issues. His hands were swollen and fingers cracked. Sometimes you have to go out and experience all of san francisco. Not just the pretty parts.", "rating": 4, "date": "2015-01-24"}, {"excerpts": ["The two tacos are not a buck, nor the chicken sandwich.\n\n"], "author": "Kenneth Y.", "review": "This is the only Jack in The Box near my house! Hooray for that!  Late night meals and we come here get the cheap stuff.  This location open 24 hours and is never a bad choice.\n\nAnyhow, anytime on weekends starting Friday nights there is always a huge long line to order food. The long line extends on to the street of Bayshore Boulevard. \n\nThe people who work this location do a good job and keep the line moving ASAP.  Like any other fast food place now, certain sauces you need to pay extra if it does not come with the meal you order which sucks.  I remember the old days where you can just ask and boom you get it free \n\nThe food is mediocre, but there food is always super hot and fresh.  Some drive-thru is warm and disgusting.  Tacos are crunch and yummy when it's late night.  \n\nOverall this is a cool spot to hit up if you live near this Jack in The Box, but beware of long lines...  This place does not have any cheap menu because that's what people are used to ordering so they jacked up the prices.  The two tacos are not a buck, nor the chicken sandwich.\n\n**parking**\n\nIt's available inside or street\n\nCash or credit", "rating": 4, "date": "2011-09-02"}, {"excerpts": ["$1.50 for two tacos and super stingy on buttermilk, WTF!?\n\n"], "author": "Danny L.", "review": "I used to go to this place once a week late night until they got cheap.\n\n$1.50 for two tacos and super stingy on buttermilk, WTF!?\n\nI always get to-go since the place is super dirty.", "rating": 1, "date": "2010-06-05"}], "fountain drink": [{"excerpts": ["This place is ghetto, they refuse to honor the 49ers take away promo that jack in the box offers which gives you a free jumbo jack with the purchase of a large fountain drink the day after the 49ers game. ", "Other location like the one on Geary Blvd honored the promo. ", "I have filed a corporate complaint to investor relations and better business bureau regarding this. ", "This is clearly false advertisement and fraud."], "author": "Chloe W.", "review": "This place is ghetto, they refuse to honor the 49ers take away promo that jack in the box offers which gives you a free jumbo jack with the purchase of a large fountain drink the day after the 49ers game. Other location like the one on Geary Blvd honored the promo. I have filed a corporate complaint to investor relations and better business bureau regarding this. This is clearly false advertisement and fraud.", "rating": 1, "date": "2016-09-13"}], "original iced coffee": [], "caramel iced coffee": [], "mocha iced coffee": [], "unsweetened iced tea": [], "orange juice": [], "oreo cookie shake": [], "chocolate shake": [], "vanilla shake": [], "strawberry shake": [], "cheeseburger combo": [], "hamburger combo": [], "chicken nuggets combo  piece": [], "chicken strips combo": [], "club salad": [], "southwest salad": [], "bacon  swiss buttery jack": [], "classic buttery jack": [], "sourdough jack": [{"excerpts": ["Dry bread on my sourdough jack. ", "Meat was dry and old. ", "I threw it away. ", "I was so upset. ", "The cooks are playing around instead of making hot food."], "author": "Sean V.", "review": "The food here is terrible! Dry bread on my sourdough jack. Meat was dry and old. I threw it away. I was so upset. The cooks are playing around instead of making hot food.", "rating": 1, "date": "2018-08-21"}, {"excerpts": ["Just had a sourdough jack or what was supposed to be a sourdough jack.  ", "Was literally the most disgusting fucking burger I have every had. ", "I had to spit it out. ", "Fuck this place.  ", "They should be shut down   They should not be serving food like this to human beings.  ", "Fuck this place"], "author": "Devin J.", "review": "Just had a sourdough jack or what was supposed to be a sourdough jack.  Was literally the most disgusting fucking burger I have every had. I had to spit it out. Fuck this place.  They should be shut down   They should not be serving food like this to human beings.  Fuck this place", "rating": 1, "date": "2017-09-21"}, {"excerpts": ["Probably the best sandwich is the sourdough Jack because my girlfriend is in love with it. ", "It's pretty much a Beef patty topped with bacon, tomato, Swiss cheese, Mayo-Onion sauce, and ketchup on toasted sourdough bread. ", "Also the taco's are cheap! ", "It's like a dollar a taco which means trouble to my 6 pack underneath my  layers. ", "I also like that ", "hey have curly fries which is definitely better than the normal fast food straight cut fries."], "author": "Garreth G.", "review": "I wish there was Jack in the Box in NJ!\n\nThey have the 1-2 combo of Burgers and Tacos!! It's like McDonalds and Taco Bell had a baby and names in Jack and put it in a box. Probably the best sandwich is the sourdough Jack because my girlfriend is in love with it. It's pretty much a Beef patty topped with bacon, tomato, Swiss cheese, Mayo-Onion sauce, and ketchup on toasted sourdough bread. Also the taco's are cheap! It's like a dollar a taco which means trouble to my 6 pack underneath my  layers. I also like that hey have curly fries which is definitely better than the normal fast food straight cut fries.", "rating": 4, "date": "2013-07-30"}], "jumbo jack cheeseburger": [], "double jack": [], "ultimate cheeseburger": [{"excerpts": ["I ordered a two tacos and a ultimate cheeseburger. ", "It's not bad for the value aspect. ", "It's Jack in da box. ", "I really feel silly but their commercials actually work on me. ", "I wound up giving away a taco and 50 cents to a homeless dude waiting outside the drivethru.  ", "It's true what they say about this place. ", "There's some ghetto feel to it? ", "Loud music and weird elements thats why i went through the drive through.", "There's really messed up dudes and females loitering. ", "But just don't make eye contact and just jet. ", "The homeless guy complimented my car and ask me if it was fast? ", "he said he was working on picking himself a car in the future? ", "I don't know bout that cuz he had serious health issues. ", "His hands were swollen and fingers cracked. ", "Sometimes you have to go out and experience all of san francisco. ", "Not just the pretty parts."], "author": "Selby C.", "review": "I thought it was cool. I ordered a two tacos and a ultimate cheeseburger. It's not bad for the value aspect. It's Jack in da box. I really feel silly but their commercials actually work on me. I wound up giving away a taco and 50 cents to a homeless dude waiting outside the drivethru.  It's true what they say about this place. There's some ghetto feel to it? Loud music and weird elements thats why i went through the drive through.There's really messed up dudes and females loitering. But just don't make eye contact and just jet. The homeless guy complimented my car and ask me if it was fast? he said he was working on picking himself a car in the future? I don't know bout that cuz he had serious health issues. His hands were swollen and fingers cracked. Sometimes you have to go out and experience all of san francisco. Not just the pretty parts.", "rating": 4, "date": "2015-01-24"}, {"excerpts": ["Also go for the ultimate cheeseburger with onions and get your entire day's supply of calories!\r\n\r\n", "Did I mention the 24 hour drive-thru??  ", "On the way home off the freeway for me!"], "author": "Michael M.", "review": "Hey, it's fast food!  But after a night of bar hopping, there is nothing like a mess of those crunchy, calorie laden, grease dripping tacos!  With extra sauce, and me being the clutz that I am, drip red sauce on my white shirt.  Also go for the ultimate cheeseburger with onions and get your entire day's supply of calories!\r\n\r\nDid I mention the 24 hour drive-thru??  On the way home off the freeway for me!", "rating": 3, "date": "2006-05-11"}], "bacon ultimate cheeseburger": [], "spicy sriracha burger": [], "jacks spicy chicken": [], "sourdough grilled chicken club": [], "homestyle ranch chicken club": [], "crispy chicken strips  pieces": [], "chicken nuggets  pieces": [], "chicken fajita pita": [{"excerpts": ["I also almost always cancer chicken fajita pita. ", "This is absolutely delicious and unique. ", "For the price you cannot go wrong at Jack In The Box. ", "I recommend that you try if you're in the mood for good food and good service."], "author": "Malcom B.", "review": "If you haven't been to Jack In The Box then I recommend that you do so soon. They have a great variety here from their salads to burgers and Mexican food. Whenever I am in I usually get this going to cheeseburger which has a sirloin patty with american cheese and in number of veggies added in. The bakery-style bun is absolutely delicious and a perfect mix for this burger. I also almost always cancer chicken fajita pita. This is absolutely delicious and unique. For the price you cannot go wrong at Jack In The Box. I recommend that you try if you're in the mood for good food and good service.", "rating": 4, "date": "2017-12-19"}], "chicken teriyaki bowl": [], "supreme croissant": [{"excerpts": ["They've screwed up my Supreme croissant minus the meat order SO many times. ", "One time, they even said they COULDN'T do a meatless Supreme Croissant but the truth is, the people that were working that time were lazy bastards.\n\n"], "author": "Lauren L.", "review": "They've screwed up my Supreme croissant minus the meat order SO many times. One time, they even said they COULDN'T do a meatless Supreme Croissant but the truth is, the people that were working that time were lazy bastards.\n\nRecently, though my mom and saw they put no meat on the screen, they still put ham and just today, we said no meat but they just put no ham. Suddenly, bacon and ham don't constitute as meat but at different times? My mom complained with her old style sass and we got two new meat less croissants on the house. Damn straight Bayshore Jack in the Box, damn straight. Props to my mom though for having some backbone.\n\nThe Daly City on Top of the Hill is LOADS better; at least they've only screwed up and meated up my order ONCE.", "rating": 2, "date": "2008-12-07"}], "sausage croissant": [], "grande sausage burrito": [], "meat lovers burrito": [], "bacon egg  cheese biscuit": [], "sausage egg  cheese biscuit": [], "loaded breakfast sandwich": [], "extreme sausage sandwich": [], "ultimate breakfast sandwich": [], "grilled breakfast sandwich": [], "jumbo breakfast platter  bacon": [], "jumbo breakfast platter  sausage": [], "jumbo breakfast platter  bacon  sausage": [], "breakfast jack": [], "bacon breakfast jack": [], "sausage breakfast jack": [], "bacon  egg chicken sandwich": [], "country scrambler plate  link": [], "country scrambler plate  sausage": [], "country scrambler plate  bacon": [], "country scrambler plate  link  sausage": [], "country scramble plate  link  bacon": [], "brunch burger": [], "homestyle potatoes": [], "mini pancakes": [], "sriracha curly fry burger": [{"excerpts": ["My coworker had ordered a spicy sriracha curly fry burger and when we got our order we were checked out by a super sweet lady in a \"Jack\" Apron around 5:20AM with brown hair , it took like 15minutes for us to get our order of a burger(not the combo) and a shake...way too long for our taste but no big deal, we had just gotten off our long shifts and we wanted to eat and sleep.\n", "We get our food and leave..not even a couple hundred feet after exiting , my coworker notices they got the order wrong , it was the regular sriracha burger (i had no idea there was a difference ) . ", "We went back to the drivethrough and told the lady who checked us out and her expression changed so quickly. ", "She grabbed the bag, looked inside and SNAPPED at us that we ordered the sriracha burger. ", "We kept telling her we didn't (if i had the receipt i would've even shown her but she failed to give me that..) ", "she literally ARGUED with us. ", "My coworker and I were calm while she was raising her voice at us and telling us what we did order and what we didn't. ", "I was so taken aback to see someone's attitude change from completely sweet to a major b&tch. ", "My mouth was open in disbelief the entire time , she was moving her head and hands with attitude on top of it all. ", "We literally had to clarify with her that we weren't upset and we just wanted our order, that's all..", "then she took a deep breath, turned around and slammed the bag on the counter... ", "The guy who took our order came around when she walked off and asked us if she gave us the sriracha curly fry burger , even her own coworker clarified that she had messed up..give or take another 15 and she comes back with our order with a smile. ", "Talk about some major bipolar disorder. ", "We've all worked retail and i can only imagine the amount of terrible customers they have to deal with but jesus , that was BY FAR the worst experience ", "ive ever had at any retail/food place to this day. ", "Already taking steps to contact the manager"], "author": "Maddy F.", "review": "WOW did i just deal with the worst retail worker in my entire life ? At a jack in the box? \nMy coworker had ordered a spicy sriracha curly fry burger and when we got our order we were checked out by a super sweet lady in a \"Jack\" Apron around 5:20AM with brown hair , it took like 15minutes for us to get our order of a burger(not the combo) and a shake...way too long for our taste but no big deal, we had just gotten off our long shifts and we wanted to eat and sleep.\nWe get our food and leave..not even a couple hundred feet after exiting , my coworker notices they got the order wrong , it was the regular sriracha burger (i had no idea there was a difference ) . We went back to the drivethrough and told the lady who checked us out and her expression changed so quickly. She grabbed the bag, looked inside and SNAPPED at us that we ordered the sriracha burger. We kept telling her we didn't (if i had the receipt i would've even shown her but she failed to give me that..) she literally ARGUED with us. My coworker and I were calm while she was raising her voice at us and telling us what we did order and what we didn't. I was so taken aback to see someone's attitude change from completely sweet to a major b&tch. My mouth was open in disbelief the entire time , she was moving her head and hands with attitude on top of it all. We literally had to clarify with her that we weren't upset and we just wanted our order, that's all..then she took a deep breath, turned around and slammed the bag on the counter... The guy who took our order came around when she walked off and asked us if she gave us the sriracha curly fry burger , even her own coworker clarified that she had messed up..give or take another 15 and she comes back with our order with a smile. Talk about some major bipolar disorder. We've all worked retail and i can only imagine the amount of terrible customers they have to deal with but jesus , that was BY FAR the worst experience ive ever had at any retail/food place to this day. Already taking steps to contact the manager", "rating": 1, "date": "2018-08-27"}], "stacked grilled cheeseburger": [], "chickntater melt": [], "spicy nacho chicken": []}