{"spicy nacho munchie meal daytime": [], "spicy nacho munchie meal nighttime": [], "seasoned curly fries": [{"excerpts": ["Stuffed Jalapenos, Onion Rings, Seasoned Curly Fries - ", "All I can say is YUM YUM YUM!!! ", "And, for sure I've become a huge fan of all three, Yayyyy!!! ", "Crispy\nSeasoned Curly Fries ($1.99, $2.29 & $2.49) - Small, Medium & Large; very tasty and cooked justly at the right heating temperature\n\n"], "author": "Ramyaa V.", "review": "Well, this review is mainly for their sides or how they call it sandwich sidekicks!!\n\nStuffed Jalapenos, Onion Rings, Seasoned Curly Fries - All I can say is YUM YUM YUM!!! And, for sure I've become a huge fan of all three, Yayyyy!!! They taste so awesomely delicious, fried stuff but not dripping oily at all (I'm super impressed), very reasonably priced and comes in with different serving sizes too.\n\nStuffed Jalapenos ($2.19 & $4.19) - 3 piece and 7 piece; Cheese Stuffing\nOnion Rings ($2.29) - Just one portion size of about 97g; Crispy\nSeasoned Curly Fries ($1.99, $2.29 & $2.49) - Small, Medium & Large; very tasty and cooked justly at the right heating temperature\n\nThis facility was maintained clean, friendly staff at the bill counters with ample good high chair-round table seatings. I wouldn't say that the order was served real quick, but the wait time was neither too long. Great to learn that this spot is opened 24hours and is located at the heart of Downtown SF, big bonus to all night owls!!\n\nParking Tip, Street parking only!", "rating": 4, "date": "2015-12-07"}, {"excerpts": ["To their credit, the seasoned curly fries are pretty tasty, but I've yet to have a more than average \"entree\" here.\n\n"], "author": "Brian R.", "review": "I generally go here whenever I'm in the mood for fast food, but don't feel like walking to the nearest McDonalds or Burger King.  It's average fast food. There's nothing about it that really stands out, in a good or bad way. When I go here I know my taste buds will be going \"meh\" with every bite, but at least my stomach will be happy. To their credit, the seasoned curly fries are pretty tasty, but I've yet to have a more than average \"entree\" here.\n\nAs has been mentioned before, this place is a major homeless magnet. But what makes it worse is that the employees do not care in the slightest. At all. I can't think of a single other business I've been to in this city (outside of the Tenderloin obviously) that is as tolerant of homeless people as this place. I bet they'd let them sleep on the tables if they tried, that's honestly how little they care.\n\nAs you can imagine, this makes the dining experience here horrible. If you come here, it's in your best interest to just get your food as quickly as possible and leave. It's okay during the day, but at night... well, let me put it this way. The last time I dined here at night, a bum stole a dollar from me because I didn't have my \"bumdar\" active when he asked for a dollar in exchange for 4 quarters, two homeless people came up to my friend and I during our meal to ask for some change, and during the 15 seconds it took me to get a straw, a homeless person managed to run down from the upper level, beg my friend for her milkshake, and leave with it before I got back. That experience may be a bit worse than normal but I assure you that it's very much a rarity to have a bum-free experience here.", "rating": 3, "date": "2011-03-25"}], "mini churros  pieces": [], "jr bacon cheeseburger": [], "fountain drink": [], "strawberry shake": [], "hamburger combo": [{"excerpts": ["I ordered a hamburger combo.  ", "Burger was good, and fries and soda are ok.  "], "author": "Ray L.", "review": "Not many places are open at 5:00 am in San Francisco.  This is one of them.\n\nI ordered a hamburger combo.  Burger was good, and fries and soda are ok.  A lot of strange people at this time of hours....\n\nI just surfed the net while waited for my hotel breakfast is served at 7:00 am.  \n\nThis is a ok place for a late night eat.", "rating": 3, "date": "2017-02-27"}], "club salad": [{"excerpts": ["The Chicken Club salad is kinda boring. ", "Normal. ", "Fresh enough. \n", "I like the Southwest Chicken Salad better. ", "They have corn!! ", "Haha. ", "I like the Crispy Chicken that comes with the salad a lot better than the chicken strips. ", "These will actually be crispy."], "author": "Châu B.", "review": "I like Jack in the Box a lot! This location is always open so I can get food anytime!! \nI am addicted to their Spicy Chicken Burger. It's pretty filling with cheese or more crisp and refreshing with extra lettuce. \n\nThey have Tacos 2 for 99cents. Don't expext anything exciting. They make for a nice cheap snack. \n\nThe monster Tacos is bigger and around $1.5 ish but its too large to bite efficiently and so it's not as fun to eat.\n\nThe Chicken Sandwich is also cheap its like a chicken nugget patty with a lettuce leaf. Good for when you don't want to chew real chicken you know. \n\nThe Chicken Nuggets are alright. More expensive than McDonalds and the sauce selections are nowhere as food but it'll do. \n\nThe Crispy Chicken Strips aren't very crispy and a bit dry, the texture is unexciting. \n\nI LOVE their Curly Fries. So fun!! Very flavorful. Can be a bit salty at times. \n\nTheir normal Fries is kinda whatever. \n\nThe Bacon Cheddar Potato wedges is too carby fatty for my taste. They used to have chorizo cheese fried which I was addicted to. \n\nThe Mini Churros is fun to eat too. They bite-sizes and crispy with this curstardy filling. Don't expect too much, they're not Michelin quality - they're good for what they are. \n\nI think the ice cream shakes are a bit too thich. It's difficult to drink them theough the straw and that really hurt my cheeks. \n\nAll the Cheeseburger / Hamburger varieties are pretty allright. Theyre soft and easy to chew and swallow. Good enough for me. They don't have a lasting impression or anything thought. \n\nThe Munchie Meals are too crazy. They are overloaded with cheese it's impossible for me to finish but if you've been starbing for days or want a challenge then just try them out. Available after 9pm only, I think. \n\nI like Hash Browns. They have acceptable has browns. \nI really like their Breakfast Platter, especially the mini pancakes. So soft and cute and spongy and sweet. Breakfast is available allllllllll day. \n\nThe Chicken Club salad is kinda boring. Normal. Fresh enough. \nI like the Southwest Chicken Salad better. They have corn!! Haha. I like the Crispy Chicken that comes with the salad a lot better than the chicken strips. These will actually be crispy.", "rating": 4, "date": "2014-07-20"}], "double jack": [], "ultimate cheeseburger": [{"excerpts": ["I had a mac n' cheese lunch (craving for comfort food) and some curly fries, so I felt it would've been a daunting task to order a Bacon Bacon Cheeseburger, or a Bacon Ultimate Cheeseburger, or an Ultimate Cheeseburger.  ", "I was almost tempted to just get the Grilled Cheese (off the Kid's Menu), but I had to stay focused and get a sandwich that had some meat.  ", "I settled for a Sourdough Jack and a regular soda.  ", "Asked for two packets of mayonnaise "], "author": "Grace M.", "review": "When the world is giving me a big \"FUCK YOU, HAVE A NICE DAY!\", I have two choices in how I want to get instant gratification to make myself feel a little better:\n1) run 2-3 miles to get the endorphins going (healthier of the two options)\n2) satisfy my animalistic craving for comfort food, preferably those that contain some meat and cheese.\n\n Two nights ago, this was the case.  I knew i had some ground beef in the freezer... and some Cheeseburger Macaroni Hamburger Helper in my pantry.  I got all *sadface* when I realized I didn't have milk.  \n\nToday, I was elated to finally peep this JITB franchise, as I usually pass by this joint on my way to Katana-Ya.  Yes, I chose option two to cope.\n\nI asked Luis (a huge meat and cheese aficionado) to join me at JITB.  We synchronized our BlackJacks and met up at the corner of O'Farrell and Mason.  We've been talking about Ultimate Cheeseburgers and Sourdough Jacks in the past 48 hours, so it was exciting to know that we will eventually get satisfaction.\n\nI took the 6-Parnassus and got off on 6th and Market.  It was such a nice day for a stroll, so I walked up Mason, which was perfumed with the day's fresh sprinkling of urine.  I see Luis at the corner of the parking structure and we head up a block to JITB.\n\nHe was set on getting a sourdough jack and two-for-99cents tacos, and a regular-sized rootbeer.  I had a mac n' cheese lunch (craving for comfort food) and some curly fries, so I felt it would've been a daunting task to order a Bacon Bacon Cheeseburger, or a Bacon Ultimate Cheeseburger, or an Ultimate Cheeseburger.  I was almost tempted to just get the Grilled Cheese (off the Kid's Menu), but I had to stay focused and get a sandwich that had some meat.  I settled for a Sourdough Jack and a regular soda.  Asked for two packets of mayonnaise and we were set.\n\nLuis noticed that there was an upstairs dining area.  We ascended the stairs and marveled at how empty the area was.  There were fake floral arrangements everywhere, but the place was very clean and devoid of human presence.  We chose a cozy corner table, in front of one of three security cameras that monitored whatever activity at the upstairs area.  \n\nWe both agreed that this area was somewhat of a haven for vagabonds who may need a place to crash.  Speaking of vagabonds, a wise crack-head, with a bright turqouise 90s styled jacket and green pajamas (bedecked with Christmas bells prints), joined us upstairs.  He kept a distance, being careful not to cross whatever areas that can be captured by the security cameras.  Luis gave me the play by play, as I was not facing the dude. \n\nL: Grace, just keep eating your sandwich.  There's a guy right there who is changing his pants.\nG: I don't care.... can I look?\nL: well... yeah okay, he's done.\nG: oh.\n\nwe continue to eat.\n\nL: Grace, he has a shank\nG: (turns around)  wow.  I bet he's using it to cut up some coke or crack\nL:  yeah, he looks like he is cutting up something.\nG: oh yeah he is!  wow, i only heard of stories, but never really saw this stuff in action.  oh heck no, he is straight up sniffing some stuff.\n\nwe continue to enjoy our wonderfully-made Sourdough Jacks.\n\nL: Grace, he is smoking\nG: (thinking.... \"I can't smell cigarette smoke\") really?  I don't smell...\n     (turns around).... oh.... OH!!!  \n     (whispers).... you mean... crack?\nL: (nods)\n\nwe finish our food\n\nL: okay, he is straight up coming over here.... oh okay, he stopped.....  oh okay he's heading over.\n\nDude:  could you guys spare some money?\n\nL/G: sorry\n\nDude:  (makes : [  face)\n\nTIP OF THE DAY:  if you're a hobo or crackhead.... there are prime locations upstairs to do your thang (smoking or sleeping), with some limited privacy.  The areas adjacent to the staircases are actually not within the field of scope of the security cameras.  That is why Mr. Dude was successful at getting his fix.  (SEE YELLOW SHADED AREAS: http://static.px.yelp.com/photo/uo_OORk8SCifPF97_fri2A/l )\n\nDid I mention the Sourdough Jacks were delicious?... AND this place is open 24 hours?", "rating": 4, "date": "2008-03-11"}, {"excerpts": ["I love the bacon ultimate cheeseburger and I love their MAYONAISSE! ", "I don't know why, but Jack ", "In The Box's mayo is the best tasting mayo!!!"], "author": "Sakkara C.", "review": "IMO the BEST Jack in the Box in San Francisco, the food is always made when you order it, so it's always fresh, I've never had bad service in all the years I have been coming here even though I only crave Jack In The Box a few times a year. I love the bacon ultimate cheeseburger and I love their MAYONAISSE! I don't know why, but Jack In The Box's mayo is the best tasting mayo!!!", "rating": 4, "date": "2010-02-16"}], "chicken fajita pita": [], "chicken teriyaki bowl": [], "loaded breakfast sandwich": [], "ultimate breakfast sandwich": [{"excerpts": ["The somber cashier who took my order for an Ultimate Breakfast sandwich, two Monster Tacos, and a Jumbo Jack had clearly seen this behavior before so no judgment was implied or forthcoming on her behalf.  ", "I can't say for certain whether it was simply the alcohol or the alcohol COMBINED WITH the undercooked egg in the Ultimate Breakfast sandwich, the oily deep-fried tacos, and the mystery meat of the Jumbo Jack, but I WILL SAY it all tasted MUCH BETTER going down the second time.\n \n", "Also, the bathrooms here are an assault on the senses - all of them."], "author": "d s.", "review": "My stomach is an asshole.  \n\nAnd I'm in an abusive, codependent relationship with it.\n\nWhy just the other night it was screaming WHY YOUSE GOTSTA DRAANK SOOO MUCH WITHOUT FEEDING MEEE YOU ASIAN AND WEIGH 25 POUNDS YOU STUPID FUCK after a drinking session chez Esta Noche so I rolled into Jack In The Crack to placate The Fickle One with some post-inebriation mastication.   The somber cashier who took my order for an Ultimate Breakfast sandwich, two Monster Tacos, and a Jumbo Jack had clearly seen this behavior before so no judgment was implied or forthcoming on her behalf.  I can't say for certain whether it was simply the alcohol or the alcohol COMBINED WITH the undercooked egg in the Ultimate Breakfast sandwich, the oily deep-fried tacos, and the mystery meat of the Jumbo Jack, but I WILL SAY it all tasted MUCH BETTER going down the second time.\n \nAlso, the bathrooms here are an assault on the senses - all of them.", "rating": 3, "date": "2007-12-23"}], "breakfast jack": [{"excerpts": ["A $1 breakfast jack from this 24hr location has saved me from alcohol poisoning more times than I can count.\n\n"], "author": "Rocco B.", "review": "A $1 breakfast jack from this 24hr location has saved me from alcohol poisoning more times than I can count.\n\nAnd saving my life has gotta be worth at least four stars.", "rating": 4, "date": "2006-11-11"}, {"excerpts": ["Breakfast Jack you sick people."], "author": "Robert M.", "review": "BJ's in the morning..... BJ's at Night......  I love a good BJ\n\nBreakfast Jack you sick people.", "rating": 4, "date": "2008-09-30"}], "homestyle potatoes": [], "mini pancakes": [{"excerpts": ["I really like their Breakfast Platter, especially the mini pancakes. ", "So soft and cute and spongy and sweet. "], "author": "Châu B.", "review": "I like Jack in the Box a lot! This location is always open so I can get food anytime!! \nI am addicted to their Spicy Chicken Burger. It's pretty filling with cheese or more crisp and refreshing with extra lettuce. \n\nThey have Tacos 2 for 99cents. Don't expext anything exciting. They make for a nice cheap snack. \n\nThe monster Tacos is bigger and around $1.5 ish but its too large to bite efficiently and so it's not as fun to eat.\n\nThe Chicken Sandwich is also cheap its like a chicken nugget patty with a lettuce leaf. Good for when you don't want to chew real chicken you know. \n\nThe Chicken Nuggets are alright. More expensive than McDonalds and the sauce selections are nowhere as food but it'll do. \n\nThe Crispy Chicken Strips aren't very crispy and a bit dry, the texture is unexciting. \n\nI LOVE their Curly Fries. So fun!! Very flavorful. Can be a bit salty at times. \n\nTheir normal Fries is kinda whatever. \n\nThe Bacon Cheddar Potato wedges is too carby fatty for my taste. They used to have chorizo cheese fried which I was addicted to. \n\nThe Mini Churros is fun to eat too. They bite-sizes and crispy with this curstardy filling. Don't expect too much, they're not Michelin quality - they're good for what they are. \n\nI think the ice cream shakes are a bit too thich. It's difficult to drink them theough the straw and that really hurt my cheeks. \n\nAll the Cheeseburger / Hamburger varieties are pretty allright. Theyre soft and easy to chew and swallow. Good enough for me. They don't have a lasting impression or anything thought. \n\nThe Munchie Meals are too crazy. They are overloaded with cheese it's impossible for me to finish but if you've been starbing for days or want a challenge then just try them out. Available after 9pm only, I think. \n\nI like Hash Browns. They have acceptable has browns. \nI really like their Breakfast Platter, especially the mini pancakes. So soft and cute and spongy and sweet. Breakfast is available allllllllll day. \n\nThe Chicken Club salad is kinda boring. Normal. Fresh enough. \nI like the Southwest Chicken Salad better. They have corn!! Haha. I like the Crispy Chicken that comes with the salad a lot better than the chicken strips. These will actually be crispy.", "rating": 4, "date": "2014-07-20"}, {"excerpts": ["What we ordered:\n\nScrambled eggs, hash brown sticks, mini pancakes, and your choice of bacon or sausage - $2.99 (they server breakfast all day)!  "], "author": "Gloria H.", "review": "First time eating at Jack with hubby.  Think we may have ordered something to go once in Foster City some 15+ years ago.\n\nAnyway, didn't want to wait for Katana so we opted for Jack's.  I was actually tempted with quite a few items.  What we ordered:\n\nScrambled eggs, hash brown sticks, mini pancakes, and your choice of bacon or sausage - $2.99 (they server breakfast all day)!  This was a great deal.  We got the sausage patty and everything was quite good.  \n\nJumbo Jack with cheese combo medium size - we opted for regular fries, which was ok.  Burger was a bit bland and dry.  \n\n5 piece nuggets - ok, the bbq sauce was on the tart side\n\nShould have waited for Katana.", "rating": 3, "date": "2012-08-26"}], "sriracha curly fry burger": []}