{"honey glazed barbecued pork": [], "pieces crispy fried prawns": [], "pieces golden potstickers": [], "pieces spring egg rolls": [], "chicken salad": [], "hot and sour soup": [{"excerpts": ["Was craving hot and sour soup the other night ", "but I didn't wanna ", "leave my cozy bed ha. ", "So I picked Jade Cafe on random from the many Chinese restaurants on Postmates. ", "There's always a risk doing this, but sometimes you get something great - unfortunately this wasn't one of those times :( ", "The hot and sour soup wasn't \"sour\" enough - that vinegar-y flavor was mission, and it just tasted like plain bland soup with a bunch of vegetables and tofu. ", "Would not recommend the soup. ", "However I also ordered the shrimp in lobster sauce - which tasted exactly like what I expected, not super special but good enough."], "author": "Farrah N.", "review": "Was craving hot and sour soup the other night but I didn't wanna leave my cozy bed ha. So I picked Jade Cafe on random from the many Chinese restaurants on Postmates. There's always a risk doing this, but sometimes you get something great - unfortunately this wasn't one of those times :( The hot and sour soup wasn't \"sour\" enough - that vinegar-y flavor was mission, and it just tasted like plain bland soup with a bunch of vegetables and tofu. Would not recommend the soup. However I also ordered the shrimp in lobster sauce - which tasted exactly like what I expected, not super special but good enough.", "rating": 3, "date": "2018-07-08"}, {"excerpts": ["We usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. ", "The chicken chow mein is definitely a solid pick. ", "If you enjoy chow mein, definitely order it from here. ", "The hot and sour soup is ok, not as good as City Chopsticks. ", "The depth of flavor isn't there. "], "author": "Carolyn Z.", "review": "Le bf and I discovered Jade Cafe via Eat24. Our previous go-to Chinese delivery place was City Chopsticks. \n\nWe usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. The chicken chow mein is definitely a solid pick. If you enjoy chow mein, definitely order it from here. The hot and sour soup is ok, not as good as City Chopsticks. The depth of flavor isn't there. Everything else is very solid.\n\nWe will continue to order from Jade Cafe when we crave Chinese delivery. \n\nPro tip: Don't order from this place on Chinese New Year. We did this past Lunar New Year and they not only messed up our order, it also came 80 minutes later than it was supposed to. At one point, Eat24 stopped the restaurant from accepting more delivery orders because they were so far behind.", "rating": 4, "date": "2017-05-20"}, {"excerpts": ["And if you have cold order their hot and sour soup."], "author": "Madhubanti B.", "review": "Love the food and love their service. The house special fried rice is amazing. And if you have cold order their hot and sour soup.", "rating": 5, "date": "2017-03-08"}, {"excerpts": ["Best Mongolian beef, sesame chicken, hot and sour soup ... ", "So good!"], "author": "Katherine L.", "review": "OMG!  Great, fresh food!  Best Mongolian beef, sesame chicken, hot and sour soup ... So good!", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["Their fried rice, tofu with veggies and hot and sour soup are the best I have tried...."], "author": "Marcela M.", "review": "I have come to this place for the last 15 years, I just love their food and it's the only Chinese food I eat. I have known the servers for so long that it feels like family every time they walk in ( we come every week) They even speak Spanish!!! My kids love to come here ! Their fried rice, tofu with veggies and hot and sour soup are the best I have tried....", "rating": 5, "date": "2016-10-03"}, {"excerpts": ["I like the hot and sour soup they send out for your appetizer. \n\n"], "author": "Juliet W.", "review": "I love their lunch specials here and they are quick with the turnaround! I like the hot and sour soup they send out for your appetizer. \n\nI've had the Fish with black bean & asparagus over rice! Yummy!! Good portions, too! The shrimp(prawns) over rice with scrambled egg is always good for me..the Garlic noodles are delicious - I get it with Chicken - I'll have to try it with the other meats.\n\nThey have good Oxtail over rice as well - I think they only have this dish every once in a while....\n\nThe wait staff are always STERN looking, but are always nice & VERY accommodating when they get to your table.\n\nThey are GREAT for to go orders as well.", "rating": 4, "date": "2011-08-04"}, {"excerpts": ["throw in the complimentary hot and sour soup for the table and this is probably one of my favorite spots to eat!"], "author": "omid a.", "review": "The price alone warrants a 3 star rating. Add to that the tasty Chinese dishes and great service in this hole in the wall and I can't wait to grab lunch while at work from here again! I got the orange chicken with fried rice and although it took longest for it to come out ( I was the only one at the table who didn't get white rice), it was well worth it! I paid about 8 bucks total and had 2 meals out of this. Large portions!!\n\n\nupdate:\n\ncame back here and go the chow mein with orange chicken. same great meal with not as long a wait. throw in the complimentary hot and sour soup for the table and this is probably one of my favorite spots to eat!", "rating": 5, "date": "2010-12-14"}, {"excerpts": ["But...pretty solid hot and sour soup and potstickers. ", "Not too greasy and the soup was really flavorful. ", "One tip - don't leave the to-go bag in your car for too long...", "that stuff is Fragrant with a capital \"F\"."], "author": "Kate S.", "review": "Better than expected. It's not exactly luring you in with it's charm and good looks. But...pretty solid hot and sour soup and potstickers. Not too greasy and the soup was really flavorful. One tip - don't leave the to-go bag in your car for too long...that stuff is Fragrant with a capital \"F\".", "rating": 3, "date": "2009-06-29"}], "minced beef with egg white soup": [], "mixed vegetables soup": [], "seaweed with egg flower soup": [], "seafood with bean cake soup": [], "wor wonton soup": [], "chicken with corn soup": [{"excerpts": ["not fresh fish.i tried the Spicy Tuna roll, and the fish smells disgusting.i also tried the chicken with corn soup and it was all water,", "little chicken and a lot of corn.the kitchen was very dirty.a lot of msg and oil,when i tried the Rainbow Chicken.they delivery once very bad delivery guy,he asked me for more tips?! ", "their miso soup is just water.they are cheap but not fresh."], "author": "Tony B.", "review": "they have BAD SERVICE.sushi and chinese?!?! not fresh fish.i tried the Spicy Tuna roll, and the fish smells disgusting.i also tried the chicken with corn soup and it was all water,little chicken and a lot of corn.the kitchen was very dirty.a lot of msg and oil,when i tried the Rainbow Chicken.they delivery once very bad delivery guy,he asked me for more tips?! their miso soup is just water.they are cheap but not fresh.", "rating": 1, "date": "2009-06-01"}], "barbecued pork wonton soup": [], "beef wonton soup": [{"excerpts": ["One of my favorites is the beef wonton soup.  ", "It's always perfect.  ", "I actually just had some for dinner (maybe that was my inspiration for finally writing this review).  ", "The broth is flavorful, the wontons are fairly large and plentiful and the beef tender.  "], "author": "Lesliegh H.", "review": "This is my go to Chinese delivery place.  I was hooked because of the lemon chicken.  Crispy little nuggets with just enough of the lemony sauce! Over the years I tried many things off the menu, and can honestly say everything (so far) is so satisfying.  \n\nOne of my favorites is the beef wonton soup.  It's always perfect.  I actually just had some for dinner (maybe that was my inspiration for finally writing this review).  The broth is flavorful, the wontons are fairly large and plentiful and the beef tender.  It makes for a perfect starter and is consistently delicious!\n\nAnother fave, is the veggie fried rice.  It's a good balance of rice, egg, and a really good combo of different veggies (broccoli, zucchini, etc)\n\nDelivery is always fast and the food tastes fresh. \n\nThe waitresses are very friendly and sweet.  I recently ate in with my 14 month old niece, who made a bit of a mess but the ladies never made a bad face or said anything rude and were actually helpful when my niece wanted to play the \"throw the spoon on the floor\" game.  \n\nDefinitely give it a try if u haven't already!", "rating": 3, "date": "2010-12-19"}], "chicken wonton soup": [], "roasted duck wonton soup": [{"excerpts": ["I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, ", "Ma Po Dofu ", "(Spicy Hot Bean Curd with minced pork)..."], "author": "Will H.", "review": "I'm addicted to this place.  Very friendly and speedy delivery service that usually arrives at my place in under 25 minutes.  I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, Ma Po Dofu (Spicy Hot Bean Curd with minced pork)...well, pretty much everything that I've tried.\n\nI've heard that the actual establishment is pretty disgusting, so delivery is recommended.", "rating": 4, "date": "2006-07-24"}], "shrimp wonton soup": [], "barbecued pork noodle soup": [], "roasted duck noodle soup": [{"excerpts": ["* Roasted Duck Noodle Soup - Best bang for your buck on a cold winter day.  ", "Chinese style roast duck pieces with noodles.  "], "author": "Ronald L.", "review": "Tried 3 different dishes here on several occasions.  This place is a small family owned Chinese restaurant.  I'm assuming there's no MSG in any of the dishes since they didn't taste salty.  In addition, the food weren't very greasy (surprising!).  Here's the dishes.\n\n* Roasted Duck Noodle Soup - Best bang for your buck on a cold winter day.  Chinese style roast duck pieces with noodles.  Broth was pretty good.\n\n* House Chow Fun - Sorta bland but for the price you pay, you get a good amount.  Add some chili oil and you are set.\n\n* Salt & Pepper Pork Chop - Mmmm good stuff.  You can't mess up on this unless it's soggy.  Fortunately, it wasn't soggy and wasn't too salty.", "rating": 3, "date": "2013-11-27"}], "shrimp noodle soup": [], "cashew almond chicken": [], "sweet and sour chicken": [{"excerpts": ["the chicken chow mien was bomb the beef and green beans with black beans sauce was great and the sweet and sour chicken was great to ", "but I would like to see them not put so much sauce next time ", "it was kind of a over kill ", "I'm gald ", "I'm not dibetic because I would I been in a coma by the end of the frist bite of that sweet and sour chicken  ", "lol hope this helps"], "author": "Marie B.", "review": "They were really nice. I ordered for pick up and drove from my job which is on the wharf when I got there my food was ready and super fresh I then drove home and I was happy to see that my food was still hot I live right near daly city so I had some ways to go to make it home and the fact that when I opened the containers to what I knew was going to be a delicious meal and I saw steam release I was over come with pure intensity of what was about to hit my taste buds and just as I expected the food was great the chicken chow mien was bomb the beef and green beans with black beans sauce was great and the sweet and sour chicken was great to but I would like to see them not put so much sauce next time it was kind of a over kill I'm gald I'm not dibetic because I would I been in a coma by the end of the frist bite of that sweet and sour chicken  lol hope this helps", "rating": 3, "date": "2016-05-21"}, {"excerpts": ["I couldn't wait to get my hands on one of my sweet and sour chicken pieces. ", "Glistening Chinese ecstasy enveloped my taste buds as I crunched down on the crispy chicken pieces. ", "It finally had been done.  ", "I had finally found the most unforgettable sweet and sour chicken in the city.  "], "author": "Sarah L.", "review": "I went here for the first time this afternoon and had some extremely mixed emotions about everything.\n\nI had been told for 3 days straight that everyone in my building was telling me (the new girl) that I HAVE to go to the Chinese restaurant up the street.\n\n\"Well how good is it?\"\n\"It's so good, I live in the Sunset and come all the way over here on my days off just to get the broccoli beef\"\n\nWell damn, with a review like that how can I say no!\n\nSo I get an hour lunch break.  The restaurant is especially busy so i can understand if there wasn't enough of the staff there to tend to everyone, but I was completely ignored for a good 10 minutes before a woman shoved hot tea onto my table and rudely took my order.  I'm still not one to have this place be a one star review in my head only because I feel like I should give them a decent chance at wowing me.  So I am patient and I sip on my tea while the clock is slowly ticking away on my lunch hour.\n\nMy food arrives hot and fast which was a nice change from the silence I was subjected to at the beginning of my meal.  I thought the rice smelled a little funny but my eyes opened wide at the sight of the plate that was set in front of me.  The colors were vibrant and the food looked fresh and crisp. I couldn't wait to get my hands on one of my sweet and sour chicken pieces. Glistening Chinese ecstasy enveloped my taste buds as I crunched down on the crispy chicken pieces. It finally had been done.  I had finally found the most unforgettable sweet and sour chicken in the city.  I was hooked and the service I received slowly became a mere memory until I actually sat down to write this review.  \n\nAll in all, I gave the place 3 stars and that was based on the entire experience.  I mean, I could figure out a way to make extra crispy chicken pieces covered in homemade sweet and sour sauce, but I go out because its convenient and I am paying someone to serve me the goods.  If I could base this review strictly on the food it would get a 5 star rating hands down, but unfortunately for me I believe good service is at least worth 2 stars of a 5 star review, Sorry Jade!  Maybe next time I'll just have to learn that I will order in advance and take it back to my desk where I can enjoy a fully uninterrupted foodgasm in the privacy of my own cubicle instead of in a place where its going to cost me extra for service.  Seriously? \nOtherwise my meal would have only cost me $6.50.  It comes on a giant dinner plate and I came nowhere near finishing it all.  You get a good portion of some bomb ass take out...just don't eat there and you'll be golden. Seriously..don't...it was in my fortune cookie...", "rating": 3, "date": "2009-02-21"}], "lemon chicken": [{"excerpts": ["I was hooked because of the lemon chicken.  ", "Crispy little nuggets with just enough of the lemony sauce! "], "author": "Lesliegh H.", "review": "This is my go to Chinese delivery place.  I was hooked because of the lemon chicken.  Crispy little nuggets with just enough of the lemony sauce! Over the years I tried many things off the menu, and can honestly say everything (so far) is so satisfying.  \n\nOne of my favorites is the beef wonton soup.  It's always perfect.  I actually just had some for dinner (maybe that was my inspiration for finally writing this review).  The broth is flavorful, the wontons are fairly large and plentiful and the beef tender.  It makes for a perfect starter and is consistently delicious!\n\nAnother fave, is the veggie fried rice.  It's a good balance of rice, egg, and a really good combo of different veggies (broccoli, zucchini, etc)\n\nDelivery is always fast and the food tastes fresh. \n\nThe waitresses are very friendly and sweet.  I recently ate in with my 14 month old niece, who made a bit of a mess but the ladies never made a bad face or said anything rude and were actually helpful when my niece wanted to play the \"throw the spoon on the floor\" game.  \n\nDefinitely give it a try if u haven't already!", "rating": 3, "date": "2010-12-19"}, {"excerpts": ["it was very good, the chow fun is pretty average and the lemon chicken\nis average. ", "I do notice a lot of employees go here , must be from Costco,the shopping center across the street and General hospital. ", "food 3.5) portion4)  ", "taste4) service4) ", "(Mr Peabody system) will go back again cant be the price and parking."], "author": "Howard J.", "review": "I have been to Jade Cafe several times since I didn't want to eat the \n$1.50 hot dog and drink at 10th street Costco. The restaurants is pretty\nordinary Chinese food with a cheap price , $5-$7 dollar dishes or rice plates, the rice plates are served all day. We had the beef stew over rice it was very good, the chow fun is pretty average and the lemon chicken\nis average. I do notice a lot of employees go here , must be from Costco,the shopping center across the street and General hospital. food 3.5) portion4)  taste4) service4) (Mr Peabody system) will go back again cant be the price and parking.", "rating": 3, "date": "2008-08-30"}], "chicken with double mushrooms": [], "rainbow chicken": [{"excerpts": ["We usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. ", "The chicken chow mein is definitely a solid pick. ", "If you enjoy chow mein, definitely order it from here. ", "The hot and sour soup is ok, not as good as City Chopsticks. ", "The depth of flavor isn't there. "], "author": "Carolyn Z.", "review": "Le bf and I discovered Jade Cafe via Eat24. Our previous go-to Chinese delivery place was City Chopsticks. \n\nWe usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. The chicken chow mein is definitely a solid pick. If you enjoy chow mein, definitely order it from here. The hot and sour soup is ok, not as good as City Chopsticks. The depth of flavor isn't there. Everything else is very solid.\n\nWe will continue to order from Jade Cafe when we crave Chinese delivery. \n\nPro tip: Don't order from this place on Chinese New Year. We did this past Lunar New Year and they not only messed up our order, it also came 80 minutes later than it was supposed to. At one point, Eat24 stopped the restaurant from accepting more delivery orders because they were so far behind.", "rating": 4, "date": "2017-05-20"}, {"excerpts": ["My favorite thing here is rainbow chicken. ", "SO GOOD. ", "everything else is okay. ", "nothing crazy special. ", "My least favorite thing here is the salt and pepper fish. ", "Anything that's fried fish is not good here. ", "It had a weird texture and super fishy taste."], "author": "Tiffany C.", "review": "My co workers and I usually order here because they deliver to my work. My favorite thing here is rainbow chicken. SO GOOD. everything else is okay. nothing crazy special. My least favorite thing here is the salt and pepper fish. Anything that's fried fish is not good here. It had a weird texture and super fishy taste.", "rating": 4, "date": "2015-05-03"}, {"excerpts": ["I don't know why they call it Rainbow chicken (in s.f. ", "why not)", ", it's General Tso's ", "(Zhao, Zao, Tzo, etc.) ", "Chicken is my favorite. "], "author": "ToAsTy T.", "review": "i liked it better when it actually looked like a hole in the wall. Now they've repainted and look a notch more decent bleh!\n\nWhenever i'm in this part of town and need some eats Jade cafe is one of the places i'll visit. It's the typical chinese place with greasy bathroom floors and waitresses screaming orders to the kitchen. Oh wait they don't scream anymore, they've updated remember?\n\nFood is tasty, fresh and filling. Lunch specials are screaming deals. But i over-order just to pack leftovers for the next days lunch. \n\nI think this place never got in touch with other chinese restaurants because some items are named silly. I don't know why they call it Rainbow chicken (in s.f. why not), it's General Tso's (Zhao, Zao, Tzo, etc.) Chicken is my favorite. Followed by Peking Spicy Beef (aka Beef with Black pepper sauce). Spicy Eggplant with Chicken and Shrimp is good too!\n\nParking is decent but the area is kinda skuzzy. \n\nBest feat from Jade Cafe was i ordered 10 items, they told me that they'd be ready in 10 minutes. Went to Safeway for a 1/2 gallon of vanilla ice cream and came back 10minutes later with 2 boxes (cardboard, not the Styrofoam the food is in) of food ready to go. Daaang..\n\ni feel bad for the delivery guy though. He needs to see a chiropractor.. *Worried*", "rating": 4, "date": "2007-04-30"}, {"excerpts": ["The rainbow chicken is to die for! ", "One plate feeds both my husband and I! ", "7.00 for a meal for two people? ", "Can't beat it! ", ":)"], "author": "Chelsey S.", "review": "The rainbow chicken is to die for! One plate feeds both my husband and I! 7.00 for a meal for two people? Can't beat it! :)", "rating": 5, "date": "2010-09-14"}, {"excerpts": ["Love the rainbow chicken! ", "Just dont order for delivery the food shows up cold and greasy had to drive all the way back there and return it."], "author": "Michael W.", "review": "Decent food at a very affordable price. Love the rainbow chicken! Just dont order for delivery the food shows up cold and greasy had to drive all the way back there and return it.", "rating": 2, "date": "2009-07-15"}], "chicken with black bean sauce": [], "curry chicken": [{"excerpts": ["Curry Chicken was soupy and low rent. ", "Ok I wasn't expecting too much from a typical divey mom and pop chinese restaurant, but it was pretty awful. ", "One extra star for fast friendly service."], "author": "Dan A.", "review": "Curry Chicken was soupy and low rent. Ok I wasn't expecting too much from a typical divey mom and pop chinese restaurant, but it was pretty awful. One extra star for fast friendly service.", "rating": 2, "date": "2014-04-10"}], "kung pao chicken": [{"excerpts": ["The mushu pork is excellent, the curry beef is meaty and spicy, the won tons and the kung pao chicken, you name it, they cook it fast and fresh, and deliver it for a GREAT price.  ", "The curry beef with vegetables over rice for $6 -- who can beat that?  ", "The Jade is a regular stop for me."], "author": "Chilly M.", "review": "Who'd think that a hole in the wall restaurant with no decorations and furniture that came out of a discount restaurant supply store could have good food?  Well, this is often the case.  They spent their money on the food, not on the furnishings.  \n\nI've long liked the Jade, both the 16th and Bryant one and the long-established one in the Polk area.  \n\nThe mushu pork is excellent, the curry beef is meaty and spicy, the won tons and the kung pao chicken, you name it, they cook it fast and fresh, and deliver it for a GREAT price.  The curry beef with vegetables over rice for $6 -- who can beat that?  The Jade is a regular stop for me.", "rating": 4, "date": "2011-10-04"}, {"excerpts": ["My husband ordered Kung Pao chicken lunch special and guess what, no sugar! ", "The dishes weren't the greatest ", "but we had \nlunch specials and a beer each. ", "Total with tip 20.50. ", "Service was \nfriendly and top notch. ", "What happened to New World?! ", "Does anyone\nknow?"], "author": "Cindy J.", "review": "Does anyone remember New World Chinese restaurant on Clement Street? OMG, that was the best chinese restaurant in SF in the 80's. There was never a bad dish. Sadly, it closed and I have not had anything close to the quality of food and service that I experienced at New World. Most of the szechwan and mandarin restaurants that I try \njust flat out pour the sugar into the sauces and it makes me angry. If  I wanted dessert then I would order dessert. Sorry, I digress into a rant\nand that is not the point here. Jade Cafe #2 was just fine. I ordered \nBeef with tender greens over rice lunch special and guess what, no\nsugar. My husband ordered Kung Pao chicken lunch special and guess what, no sugar! The dishes weren't the greatest but we had \nlunch specials and a beer each. Total with tip 20.50. Service was \nfriendly and top notch. What happened to New World?! Does anyone\nknow?", "rating": 3, "date": "2007-09-23"}, {"excerpts": ["I ordered the walnut prawns and the kung pao chicken (extra hot). ", "Both of these dishes were specifically recommended. ", "When i got them, they were terrible. ", "The walnut prawns were tasteless and soggy. ", "The kung pao chicken was supposed to spicy and was definitely not at all. ", "It was over-sauced so much, ", "the chicken tasted like the peanuts, like the carrots, like the zucchini....."], "author": "Rachel G.", "review": "I ordered from this restaurant strictly because of the rave reviews i read from city search. Um, no. \n\n\"No\" SO MUCH that I decided to create a YELP account strictly to steer other sheep away from this Place !!!  How bad are you that it drives me to take the time to create an entire on line profile to complain about you?  \n\nI ordered the walnut prawns and the kung pao chicken (extra hot). Both of these dishes were specifically recommended. When i got them, they were terrible. The walnut prawns were tasteless and soggy. The kung pao chicken was supposed to spicy and was definitely not at all. It was over-sauced so much, the chicken tasted like the peanuts, like the carrots, like the zucchini.....all tasted like soy sauce..... \n\nI will cut  city searchers some slack. Maybe this is your first Chinese food experience ever? Maybe you are deathly ill and can't taste, or smell, or have blurry vision ?! Maybe you are used to eating at Chain Chinese Food Establishments like: Pick Up Sticks, or I Love Teriyaki......Or possibly you are co-owner of Jade Cafe and really need to promote your business. \n\n3 (Good) things about Jade (I am not a total bee-och)- Fast delivery, friendly and professional delivery driver and found our apartment which is not easy.... \n\nPros: Fast Deliver, Friendly Deliver Driver, Found our Apartment which is not easy.... \nCons: Terrible Quality of Food, Over Sauced, and OVER salty, Put us on hold six times when trying to order delivery.", "rating": 1, "date": "2008-01-04"}], "chicken with broccoli": [], "roasted duck": [{"excerpts": ["* Roasted Duck Noodle Soup - Best bang for your buck on a cold winter day.  ", "Chinese style roast duck pieces with noodles.  "], "author": "Ronald L.", "review": "Tried 3 different dishes here on several occasions.  This place is a small family owned Chinese restaurant.  I'm assuming there's no MSG in any of the dishes since they didn't taste salty.  In addition, the food weren't very greasy (surprising!).  Here's the dishes.\n\n* Roasted Duck Noodle Soup - Best bang for your buck on a cold winter day.  Chinese style roast duck pieces with noodles.  Broth was pretty good.\n\n* House Chow Fun - Sorta bland but for the price you pay, you get a good amount.  Add some chili oil and you are set.\n\n* Salt & Pepper Pork Chop - Mmmm good stuff.  You can't mess up on this unless it's soggy.  Fortunately, it wasn't soggy and wasn't too salty.", "rating": 3, "date": "2013-11-27"}, {"excerpts": ["I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, ", "Ma Po Dofu ", "(Spicy Hot Bean Curd with minced pork)..."], "author": "Will H.", "review": "I'm addicted to this place.  Very friendly and speedy delivery service that usually arrives at my place in under 25 minutes.  I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, Ma Po Dofu (Spicy Hot Bean Curd with minced pork)...well, pretty much everything that I've tried.\n\nI've heard that the actual establishment is pretty disgusting, so delivery is recommended.", "rating": 4, "date": "2006-07-24"}], "fried chicken": [{"excerpts": ["the beef broccoli tasted mushy and bland, the fried chicken wasn't seasoned. "], "author": "Bernadette F.", "review": "we had ordered from th is place 12/17 f/11 and spent $31 for family of 4. the food was skimpy:shrimp fried rice and beef br occoli. the beef broccoli tasted mushy and bland, the fried chicken wasn't seasoned. the only items that was good: shrimp fried rice and pot stickers. i've been to chinese food places that give u big portions for your money's worth.i just wanted to check this place out and give it a chance but not going to be on my list of favorite.", "rating": 2, "date": "2011-12-18"}], "chicken with mixed vegetables": [{"excerpts": ["Chicken with Mixed Vegetables on Rice  - I did not like this dish.  ", "It was extremely bland.  ", "I did not eat it.  ", "Who knows?  ", "Maybe, after drinking later on, it will taste better.  "], "author": "Mark D.", "review": "1.  Review of delivery from Jade Cafe.\n\n2.  Easy to order on Grubhub.com\n\n3.  Mongolian Beef - The meat was tender but oily.  It was rather bland. The portion was large.\n\nhttp://tinyurl.com/3uhazyj\n\n4.  Steamed Rice - The rice was clumpy.\n\n5.   Chicken with Mixed Vegetables on Rice  - I did not like this dish.  It was extremely bland.  I did not eat it.  Who knows?  Maybe, after drinking later on, it will taste better.  The portion was large.\n\nhttp://tinyurl.com/3lzpogn\n\n6.  Delivery took a little over the estimate.  It was just over an hour.\n\n7.  I asked for paper plates.  They did not bring them.\n\n8.  I asked for a side of hot sauce.  They did not bring it.\n\n9.   Low minimum for delivery ($10).\n\n10.  Good prices for delivery.  $16.43 including tax for 2 entrees and a side of rice.\n\n11.  My fortune was \"This year your highest priority will be your family\".\n\n12.  For lottery players, my lucky numbers were:\n      3, 8, 12, 16, 19, 20", "rating": 2, "date": "2011-04-01"}], "peking spicy beef": [{"excerpts": ["Followed by Peking Spicy Beef (aka Beef with Black pepper sauce). "], "author": "ToAsTy T.", "review": "i liked it better when it actually looked like a hole in the wall. Now they've repainted and look a notch more decent bleh!\n\nWhenever i'm in this part of town and need some eats Jade cafe is one of the places i'll visit. It's the typical chinese place with greasy bathroom floors and waitresses screaming orders to the kitchen. Oh wait they don't scream anymore, they've updated remember?\n\nFood is tasty, fresh and filling. Lunch specials are screaming deals. But i over-order just to pack leftovers for the next days lunch. \n\nI think this place never got in touch with other chinese restaurants because some items are named silly. I don't know why they call it Rainbow chicken (in s.f. why not), it's General Tso's (Zhao, Zao, Tzo, etc.) Chicken is my favorite. Followed by Peking Spicy Beef (aka Beef with Black pepper sauce). Spicy Eggplant with Chicken and Shrimp is good too!\n\nParking is decent but the area is kinda skuzzy. \n\nBest feat from Jade Cafe was i ordered 10 items, they told me that they'd be ready in 10 minutes. Went to Safeway for a 1/2 gallon of vanilla ice cream and came back 10minutes later with 2 boxes (cardboard, not the Styrofoam the food is in) of food ready to go. Daaang..\n\ni feel bad for the delivery guy though. He needs to see a chiropractor.. *Worried*", "rating": 4, "date": "2007-04-30"}], "mongolian beef": [{"excerpts": ["Not good at all\nFood burn/Mongolian beef\nBeef chow mein no flavor\n", "Bad customers  service"], "author": "Margarita L.", "review": "Not good at all\nFood burn/Mongolian beef\nBeef chow mein no flavor\nBad customers  service", "rating": 1, "date": "2017-11-14"}, {"excerpts": ["I ordered some Mongolian Beef from here and there were only a few tiny slivers of beef in the dish  scattered about hidden amongst some onion and mushroom made to look like beef . "], "author": "Ann Oyed ..", "review": "Where's the Beef ? I ordered some Mongolian Beef from here and there were only a few tiny slivers of beef in the dish  scattered about hidden amongst some onion and mushroom made to look like beef . This dish was absolute rubbish for $9.75 I won't order from here again\n\n*salty\n*burnt tasting\n*didn't include chopsticks\n*lots of rice and vegetable very little beef\n*vegetable overcooked to resemble beef instead of standing on their own\n*sad,  drink lots of water after eating this", "rating": 1, "date": "2017-02-20"}, {"excerpts": ["Mongolian Beef was also fantastic! ", "Will definitely be ordering again... ", "And often."], "author": "Dennis P.", "review": "Some of the best Chinese I've had in recent memory... Delivery was super fast, food was all fresh and delicious. The salt and pepper spicy prawns are amazing (ask for them without the shell IMO) although not spicy.... Mongolian Beef was also fantastic! Will definitely be ordering again... And often.", "rating": 5, "date": "2017-05-20"}, {"excerpts": ["The Mongolian beef was way too salty, overloaded with mushrooms, and lacked both flavor  and spice. ", "In addition, the sauce had spilled all over the bag, soaking everything in it by the time we opened it."], "author": "Michael C.", "review": "After 75 minutes, the food arrived missing an item. The egg rolls were soaked with grease and tasteless. The Mongolian beef was way too salty, overloaded with mushrooms, and lacked both flavor  and spice. In addition, the sauce had spilled all over the bag, soaking everything in it by the time we opened it.", "rating": 1, "date": "2016-10-24"}, {"excerpts": ["I am a very big fan of Mongolian Beef! ", "Every time I order Chinese food ", "I order mongolian beef, but its never cooked right. ", "I love a lot of chili peppers and onions. ", "I decided to order it from this place ", "and I feel in love! ", "The meet was tender and had plenty of flavor. ", "I called in my order when I was maybe 10 mins away ", "and it was ready when I go there. ", "I haven't tried anything else from this restaurant ", "but I do recommend this place if you like Mongolian beef."], "author": "Johanna G.", "review": "I am a very big fan of Mongolian Beef! Every time I order Chinese food I order mongolian beef, but its never cooked right. I love a lot of chili peppers and onions. I decided to order it from this place and I feel in love! The meet was tender and had plenty of flavor. I called in my order when I was maybe 10 mins away and it was ready when I go there. I haven't tried anything else from this restaurant but I do recommend this place if you like Mongolian beef.", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["I ordered Mongolian Beef over rice NO mushrooms light onions HEAVY GRAVY, Prawn Fried Rice ", "NO ", "EGGS ", "NO VEGGIES ", "They gave me an extra order of prawn fried rice regular with everything in it, another prawn fried rice just the way that I ordered  but they forgot to hold the shit (feces) in the prawns, the prawns felt overly swetty like soggy moist, no gravy at all on my mongolian beef, veggies all through the chow mein, and the bathroom had a lil turd (feces) on the floor. ", "I will completely slap the piss out of myself before I EVER come back here"], "author": "SHRONDA J.", "review": "I will NEVER order from here again.!!!! The customer service sucks and the man who took my order did not follow directions. Its to the point I want to say write in ENGLISH SO THAT I CAN SEE THAT YOU GOT MY ORDER RIGHT!  I ordered Mongolian Beef over rice NO mushrooms light onions HEAVY GRAVY, Prawn Fried Rice NO EGGS NO VEGGIES just green onions, Chicken Chow Mein NO VEGGIES, Oyster Beef over rice NO VEGGIES. They gave me an extra order of prawn fried rice regular with everything in it, another prawn fried rice just the way that I ordered  but they forgot to hold the shit (feces) in the prawns, the prawns felt overly swetty like soggy moist, no gravy at all on my mongolian beef, veggies all through the chow mein, and the bathroom had a lil turd (feces) on the floor. I will completely slap the piss out of myself before I EVER come back here", "rating": 1, "date": "2016-04-25"}, {"excerpts": ["Best Mongolian beef, sesame chicken, hot and sour soup ... ", "So good!"], "author": "Katherine L.", "review": "OMG!  Great, fresh food!  Best Mongolian beef, sesame chicken, hot and sour soup ... So good!", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["I order the Mongolian beef, very good. ", "But when I ordered it, the older lady who seems in charge is saying things under her breath. ", "Negative things, the majority of my friends are Chinese ", "so I know the bad words when I hear it. ", "So I don't tip. ", "Ever. ", "I continue to go here for lunch ", "and I order my food. ", "Parties come after me and sit, their appetizers & entrees come out before mine.  ", "So I hate this place.  ", "2 stars because of the Mongolian beef & they deliver."], "author": "Johnny C.", "review": "I work across the street so this place was very convenient during lunch. Not to sound racist but typically Asian restaurants have bad service but this place takes the medal. \n\nI order the Mongolian beef, very good. But when I ordered it, the older lady who seems in charge is saying things under her breath. Negative things, the majority of my friends are Chinese so I know the bad words when I hear it. So I don't tip. Ever. I continue to go here for lunch and I order my food. Parties come after me and sit, their appetizers & entrees come out before mine.  So I hate this place.  2 stars because of the Mongolian beef & they deliver.", "rating": 2, "date": "2014-08-22"}, {"excerpts": ["Last week I had a craving for their Mongolian Beef over rice (my old usual).\n\n"], "author": "Raymond G.", "review": "For those of us that work near 3rd/4th and Market, Jade Cafe on Geary St. was your easy place to go to if you needed quick fix of Chinese food for lunch.  My co-workers and I would always order for pickup from this place for countless workday lunches over the past 10 years or so.  So, it was kinda sad that location closed.  \n\nLuckily, they had a sister location near the Potrero Center on 16th and Bryant.  Last week I had a craving for their Mongolian Beef over rice (my old usual).\n\nI placed an order  through online on Seamless via Yelp.  Placed an order from the luxury of my own home and told that it would be ready for pickup within 15-30 minutes.  The order placed rather easily and uneventful - as it should.\n\nWhen I came by the order was ready, they had you sign that you picked your order and off you go.  Overall, the food was the same as it was before.  Yummy and it did the trick.\n\nWould order online from Jade again the future!", "rating": 4, "date": "2014-09-05"}, {"excerpts": ["I can go to some other restaurants and order a plate of Mongolian Beef for $7.50 + rice for $1.50 = $9.00, and end up with too much food for one person; or I can order a Mongolian Beef rice plate from Jade Cafe for $6, with the right portion.  ", "Which way do you think I'd go?  ", "Which way would you go?  "], "author": "Uncle L.", "review": "Ever notice that many Chinese restaurants stopped serving rice plates after lunch?  They think they can outsmart the customers by forcing them to order the plates and the rice separately ($$).  But ever notice that these restaurants are usually empty during dinner time?  \n\nAll those restaurants need to learn from Jade Cafe.  They serve rice plates from lunch to dinner.  End of story.  Viola!  Customers!!  I can go to some other restaurants and order a plate of Mongolian Beef for $7.50 + rice for $1.50 = $9.00, and end up with too much food for one person; or I can order a Mongolian Beef rice plate from Jade Cafe for $6, with the right portion.  Which way do you think I'd go?  Which way would you go?  I rest my case.\n\nBesides this is not a typical bland Chinese place out in the hood where there are few Chinese.  No, no, this is a genuine Chinese restaurant where the food has \"wok hei\", y'all!!  You will not go out of your way to dine at Jade's, but if you're in the neighborhood and you have an urging for good rice plates, this place will surprise you.", "rating": 4, "date": "2014-03-24"}, {"excerpts": ["Mongolian Beef - The meat was tender but oily.  ", "It was rather bland. "], "author": "Mark D.", "review": "1.  Review of delivery from Jade Cafe.\n\n2.  Easy to order on Grubhub.com\n\n3.  Mongolian Beef - The meat was tender but oily.  It was rather bland. The portion was large.\n\nhttp://tinyurl.com/3uhazyj\n\n4.  Steamed Rice - The rice was clumpy.\n\n5.   Chicken with Mixed Vegetables on Rice  - I did not like this dish.  It was extremely bland.  I did not eat it.  Who knows?  Maybe, after drinking later on, it will taste better.  The portion was large.\n\nhttp://tinyurl.com/3lzpogn\n\n6.  Delivery took a little over the estimate.  It was just over an hour.\n\n7.  I asked for paper plates.  They did not bring them.\n\n8.  I asked for a side of hot sauce.  They did not bring it.\n\n9.   Low minimum for delivery ($10).\n\n10.  Good prices for delivery.  $16.43 including tax for 2 entrees and a side of rice.\n\n11.  My fortune was \"This year your highest priority will be your family\".\n\n12.  For lottery players, my lucky numbers were:\n      3, 8, 12, 16, 19, 20", "rating": 2, "date": "2011-04-01"}, {"excerpts": ["EGG ROLLS are a must!!! \nbeef and brocolli, mongolian beef & chowfun/mein are top best items"], "author": "Mar L.", "review": "AFcknMazing\nwalnut shrimps are soooo worth it and they dont skimp on the shrimp\nawesome lunch specials\nEGG ROLLS are a must!!! \nbeef and brocolli, mongolian beef & chowfun/mein are top best items", "rating": 5, "date": "2011-11-01"}, {"excerpts": ["We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\n", "The yang chow fried rice and mongolian beef were okay ", "The yang chow fried rice and mongolian beef were okay ", "but I really liked the shrimp chow mein ", "it was yummy flavorful. ", "I'd go back in a heartbeat. "], "author": "Gary E.", "review": "My wife was suppose to attend her Zumba class across the street but quickly found out that the instructor she liked apparently opened up her own shop elsewhere and to top it off the class was full for the evening. So instead, we ended up stuffing our faces here.\n\nThis place was a pretty casual dive type hole in the wall. The menu offered had a good selection of Chinese food across the board. I quickly noticed that the flow of to-go phone in orders were steady so that's good news for the business. The place was half full and everyone seemed pleased with the food. We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\nIt didn't take long for the food to arrive. The yang chow fried rice and mongolian beef were okay but I really liked the shrimp chow mein it was yummy flavorful. I'd go back in a heartbeat. Fairly priced and good service!\n\nZumba turned into Jade...", "rating": 3, "date": "2011-03-22"}, {"excerpts": ["- Mongolian Beef\nVery tasty. "], "author": "Lawrence S.", "review": "There is something to be said for cheap, quick, decent Chinese food. If you have only about a good 30 minutes to grab lunch and head back to your cube, this place is a good choice. \n\nSome of my favorite dishes:\n\n- Beef Noodle Soup\nA beefy soup that has a grip of egg style noodles. You can add wontons to make it even more epic.\n\n- Ma po Tofu\nNice and filling for those days you don't really want meat.\n\n- Mongolian Beef\nVery tasty. Not too spicey\n\nThe potstickers aren't shabby either. \n\nThe ladies that work the counter don't have anytime to be nice to you. Its all business. What do you want. Ok its this much.\n\nYou then migrate over to the wall of waiting shame next to the bathroom to wait for your order. Luckily they are pretty quick. \n\nI have worked in this area for over 7 years and they have never failed me. \n\nProtip: Order 10-15 mins before you come for takeout. Most likely your food will be ready when you get there. Otherwise you might have to wait a \nwhile especially if you hit the middle of the lunch hour rush.", "rating": 3, "date": "2011-06-18"}, {"excerpts": ["Where else can you find your classic rice plate faves like Mongolian Beef over rice, Mango chicken, Won ton soup, or Honey walnut prawns all usually under 10 dollars. \n\n"], "author": "B H.", "review": "I like Americanized Chinese food, so kill me you cuisine purists out there! Working and living within close proximity to this place for close to 15 years I've seen and tasted the environment here all too well. Recently they put out this fancy glossy fivefold mailer/ menu, it makes their dishes look incredible, now if only a bit more effort were put into the actual presentation of the actual dishes then we can talk. No complaints on the portions here, I always take home a little doggie bag (and lucky me gets to play doggie since I have no pets). Where else can you find your classic rice plate faves like Mongolian Beef over rice, Mango chicken, Won ton soup, or Honey walnut prawns all usually under 10 dollars. \n\nMuch improved from the past, when I would eat in and thought that \"Palmolive dish soap\" was their secret ingredient. Service seems to be selective. Is it me or do they always seem mad at something or somebody, I can't comprehend any Cantonese, but you don't have to be a linguistics major to understand the staff snapping at each other like phirana fish in one tank. I've tried tipping well up to 20- 25% above the norm but just can't seem to get the same reaction? If you're a pudgy Caucasian blue collar man you seem to get a smile, maybe even a laugh from the always busy waitstaff, Oh well it's all about the food, my 45-50 minutes of freedom on my lunch hour, and pleasing my \"gut\" and it's instincts.", "rating": 3, "date": "2010-07-16"}, {"excerpts": ["We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. ", "Every was good and the portions were pretty big. "], "author": "L M.", "review": "Fast and friendly service, lots of different items on the menu. We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. Every was good and the portions were pretty big. Although this isn't my regular go-to place for Chinese, I was pleased and will be back here again. \n\nSmall family-run joint and worth a visit if you're in the area and craving Chinese.", "rating": 4, "date": "2011-04-04"}], "curry beef": [{"excerpts": ["The mushu pork is excellent, the curry beef is meaty and spicy, the won tons and the kung pao chicken, you name it, they cook it fast and fresh, and deliver it for a GREAT price.  ", "The curry beef with vegetables over rice for $6 -- who can beat that?  ", "The Jade is a regular stop for me."], "author": "Chilly M.", "review": "Who'd think that a hole in the wall restaurant with no decorations and furniture that came out of a discount restaurant supply store could have good food?  Well, this is often the case.  They spent their money on the food, not on the furnishings.  \n\nI've long liked the Jade, both the 16th and Bryant one and the long-established one in the Polk area.  \n\nThe mushu pork is excellent, the curry beef is meaty and spicy, the won tons and the kung pao chicken, you name it, they cook it fast and fresh, and deliver it for a GREAT price.  The curry beef with vegetables over rice for $6 -- who can beat that?  The Jade is a regular stop for me.", "rating": 4, "date": "2011-10-04"}], "beef with black bean sauce": [], "beef with broccoli": [], "beef with oyster sauce": [{"excerpts": ["I ordered beef with oyster sauce a few months ago from Jade, but it doesn't taste right. ", "If you are a Chinese grown up in China, you will know how beef with oyster sauce supposed to taste. ", "However, this dish had a very odd taste and it's nothing close to the original. ", "Maybe the chef is from other China province, it's not too big of the deal. ", "Couple days ago  I decided to give it another try, so I ordered BBQ pork with tofu for lunch assuming there is no way to F ", "this one up. ", "Guess what? ", "I'm wrong. ", "The BBQ pork tasted OK, but they managed to use tofu probably expired long ago and already turned sour. ", "I'm OK ", "due to ", "I didn't eat any of the tofu, but my co-worker got sick after lunch. ", "Food safety is a big concern. ", "I will definitely NOT recommend this place to anyone I know."], "author": "Kelly H.", "review": "I ordered beef with oyster sauce a few months ago from Jade, but it doesn't taste right. If you are a Chinese grown up in China, you will know how beef with oyster sauce supposed to taste. However, this dish had a very odd taste and it's nothing close to the original. Maybe the chef is from other China province, it's not too big of the deal. Couple days ago  I decided to give it another try, so I ordered BBQ pork with tofu for lunch assuming there is no way to F this one up. Guess what? I'm wrong. The BBQ pork tasted OK, but they managed to use tofu probably expired long ago and already turned sour. I'm OK due to I didn't eat any of the tofu, but my co-worker got sick after lunch. Food safety is a big concern. I will definitely NOT recommend this place to anyone I know.", "rating": 1, "date": "2018-05-17"}], "beef with snow peas": [], "beef with mixed vegetables": [], "cantonese style spare ribs": [], "spicy hot bean curd with minced pork": [], "succulent spicy pork with garlic sauce": [{"excerpts": ["I also ordered the succulent spicy pork with garlic sauce, this was good ", "but I always forget that the garlic sauce for this dish is supposed to be a little sweet ", "so just an FYI ", "-- I'll probably order a more savory/salty entree next time. "], "author": "Wendy V.", "review": "I avoided Jade Cafe for awhile because a friend told me he didn't like it. Then I had another friend who usually has good taste in food mention that he liked the place, so I finally went and I'm glad I did!\n\nFood:\nThey had probably the best chicken chow mein I've ever had (and I always order chow mein). The noodles were the perfect texture and the dish wasn't super oily. I also ordered the BBQ pork fried rice, and it was yummy but I would've liked the pork to be a little crispier and I added extra soy sauce -- not a huge deal though, I'd definitely order it again. I also ordered the succulent spicy pork with garlic sauce, this was good but I always forget that the garlic sauce for this dish is supposed to be a little sweet so just an FYI -- I'll probably order a more savory/salty entree next time. Lastly, their chili sauce on the table was good and would go well with potstickers.\n\nCustomer Service:\nI don't understand why this place gets such a bad rep for customer service. The waiters were really nice and would fill up our glasses of water often. One of them also came by and asked us how the food was. When you dine at an authentic mom-and-pop Chinese restaurant, you shouldn't expect good customer service, but this place treated my party really well.", "rating": 5, "date": "2018-06-18"}], "supermen sweet and sour pork": [], "mu shu pork": [], "spare ribs with black bean sauce": [], "barbecued pork with bean cake": [], "barbecued pork with mixed vegetables": [], "shrimp chicken with cashew almond": [], "shrimp with snow peas": [], "shrimp with double mushrooms": [], "shrimp with lobster sauce": [], "supermen sweet and sour shrimp": [], "kung pao shrimp": [], "curry shrimp": [], "shrimp with cashew": [], "seafood deluxe": [], "clams with ginger scallions": [], "clams with black bean sauce": [], "braised fish fillet": [], "fish fillet with black bean sauce": [], "sweet and sour whole fish": [], "steamed whole fresh fish": [], "fresh vegetables deluxe": [], "snow peas with water chestnuts": [], "eggplant with garlic sauce": [], "broccoli with oyster sauce": [], "double mushroom with oyster sauce": [], "vegetarian special": [], "braised bean cake": [], "mixed vegetables with bean cake": [], "house special bean cake": [], "kung pao tofu": [{"excerpts": ["If you're vegetarian, you must try the Kung Pao Tofu.  ", "It is the best that I have tried (and I've tried that dish at several restaurants in San Francisco).  ", "BUT, you must eat it at the restaurant or within a few minutes that it gets cooked.  ", "Otherwise, the tofu will become soggy and the taste will alter and it'll be just blah."], "author": "Ms D.", "review": "If you're vegetarian, you must try the Kung Pao Tofu.  It is the best that I have tried (and I've tried that dish at several restaurants in San Francisco).  BUT, you must eat it at the restaurant or within a few minutes that it gets cooked.  Otherwise, the tofu will become soggy and the taste will alter and it'll be just blah.", "rating": 5, "date": "2018-06-30"}, {"excerpts": ["The garlic eggplant was good and the kung pao tofu was ok. ", "I was kind of concerned with cleanliness though ", "and I'm usually not much of a germaphobe. ", "They got a 78 on their health inspection and the checkout lady stuck her hand in a bucket of loose fortune cookies to put in my dinner right after handling money."], "author": "Jenny S.", "review": "My takeout order was ready amazingly fast. The garlic eggplant was good and the kung pao tofu was ok. I was kind of concerned with cleanliness though and I'm usually not much of a germaphobe. They got a 78 on their health inspection and the checkout lady stuck her hand in a bucket of loose fortune cookies to put in my dinner right after handling money.", "rating": 3, "date": "2015-06-09"}, {"excerpts": ["Kung Pao Tofu.  ", "Potstickers.  "], "author": "Wendy P.", "review": "Seriously good Chinese food.  \n\nKung Pao Tofu.  Potstickers.  Chow Mein with Mixed Vegetables.\n\nThese are my current favorites.\n\nI usually do pickup, so I can't speak to the waiter service.  But the staff is always very friendly on the phone and in the restaurant.\n\nPrices are pretty cheap too.  Around $10 per person...and that is for a lot of food.", "rating": 4, "date": "2012-04-25"}, {"excerpts": ["Kung Pao Tofu!\n", "Broccoli in Oyster Sauce!\n"], "author": "Alicia C.", "review": "I just love this place. For awhile there I was here at least  two times a week. I have my favorite dishes and I rarely stray:\n\nKung Pao Tofu!\nBroccoli in Oyster Sauce!\nBlack Bean Tofu!\n\nOk, so I haven't had any meat here. But if you eat tofu, this is the place because it's big honking pieces; crispy on the outside and soft on the inside.\n\nI also can't say enough about the service here. It's a very casual place and family run. The ladies there are very nice, that they remember me. I love that.  You also get your food so fast, and it's really hot (temperature wise)\n\nThank you nice ladies for always feeding me yummy tofu.", "rating": 4, "date": "2008-05-08"}, {"excerpts": ["When I tried to order some steamed bean curd, the waitress told me I should get Kung Pao Tofu, if I liked tofu. ", "Uh, I wanted some steamed bean curd! ", "WTF? ", "But I never stand up for myself at restaurants, so fine, Kung Pao Tofu for me.\n\n"], "author": "Megan D.", "review": "Oh, dear.\n\nFor some reason, the office decided to come here for lunch. It was a sunny day, we walked down from Potrero Hill, getting further from our kind, delicious, standby lunch spots with every step.\n\nWe were seated promptly. Everything was a little scummy. My boss asked like 14 times for chopsticks. When I tried to order some steamed bean curd, the waitress told me I should get Kung Pao Tofu, if I liked tofu. Uh, I wanted some steamed bean curd! WTF? But I never stand up for myself at restaurants, so fine, Kung Pao Tofu for me.\n\nMy coworker needed to order something soft because she just had her wisdom teeth taken out, so KPT was not going to work for her. There was a big ordeal when she tried to order something else. Eventually she got some soft vegetables in sauce. Mmmm.\n\nThe food was not very good, even for cheap, greasy Chinese, but, inexplicably, there were sure a lot of people in there.\n\nI will not be back, and I really wouldn't recommend it. Sorry, Jade Cafe.", "rating": 2, "date": "2008-11-21"}, {"excerpts": ["The Kung Pao Tofu truly is a marvel of budget dining--large, hot, cheap, yet still cooked like they mean it.  ", "This puts them in at least the same league as other, closer lunch spots like Chow's or Fanny's.  ", "But then, maybe I'll wait to come back until the P-Center has been transformed into the mixed-use TOD ", "it so desperately ought to be (yeah, it's a long wait, but I'll manage)."], "author": "Wes M.", "review": "And now for the long-overdue final installment in my Potrero Center trilogy.  I was probably looking forward to Jade Cafe the least, but I was pleasantly surprised.  The Kung Pao Tofu truly is a marvel of budget dining--large, hot, cheap, yet still cooked like they mean it.  This puts them in at least the same league as other, closer lunch spots like Chow's or Fanny's.  But then, maybe I'll wait to come back until the P-Center has been transformed into the mixed-use TOD it so desperately ought to be (yeah, it's a long wait, but I'll manage).", "rating": 4, "date": "2009-07-17"}, {"excerpts": ["Where else can you get 3000 calories worth of homemade Kung Pao Tofu for $4.50?"], "author": "Amy S.", "review": "I love this place.  Where else can you get 3000 calories worth of homemade Kung Pao Tofu for $4.50?", "rating": 4, "date": "2007-09-28"}], "house special chow mein": [{"excerpts": ["We ordered the following dishes:\nPotstickers - mediocre (they had obviously been prepared earlier in the day)\nEggplant w/ chicken, shrimp in special sauce - good\nHouse Special Chow Mein - mediocre\nPork Fried Rice (free w/ order) "], "author": "Terry A.", "review": "We tried Jade Cafe for the first time this evening (delivery) after receiving a flyer at our home. We were extremely disappointed. \n\nWe ordered the following dishes:\nPotstickers - mediocre (they had obviously been prepared earlier in the day)\nEggplant w/ chicken, shrimp in special sauce - good\nHouse Special Chow Mein - mediocre\nPork Fried Rice (free w/ order) - mediocre\nFortune Cookies - were floating in sauce, mushy and inedible\n\nDelivery - very prompt (earlier than estimated)", "rating": 1, "date": "2012-10-15"}], "barbecued pork chow mein": [], "chicken chow mein": [{"excerpts": ["They had probably the best chicken chow mein I've ever had (and I always order chow mein). ", "The noodles were the perfect texture and the dish wasn't super oily. ", "I also ordered the BBQ pork fried rice, and it was yummy ", "but I would've liked the pork to be a little crispier ", "and I added extra soy sauce -- not a huge deal though, I'd definitely order it again. "], "author": "Wendy V.", "review": "I avoided Jade Cafe for awhile because a friend told me he didn't like it. Then I had another friend who usually has good taste in food mention that he liked the place, so I finally went and I'm glad I did!\n\nFood:\nThey had probably the best chicken chow mein I've ever had (and I always order chow mein). The noodles were the perfect texture and the dish wasn't super oily. I also ordered the BBQ pork fried rice, and it was yummy but I would've liked the pork to be a little crispier and I added extra soy sauce -- not a huge deal though, I'd definitely order it again. I also ordered the succulent spicy pork with garlic sauce, this was good but I always forget that the garlic sauce for this dish is supposed to be a little sweet so just an FYI -- I'll probably order a more savory/salty entree next time. Lastly, their chili sauce on the table was good and would go well with potstickers.\n\nCustomer Service:\nI don't understand why this place gets such a bad rep for customer service. The waiters were really nice and would fill up our glasses of water often. One of them also came by and asked us how the food was. When you dine at an authentic mom-and-pop Chinese restaurant, you shouldn't expect good customer service, but this place treated my party really well.", "rating": 5, "date": "2018-06-18"}, {"excerpts": ["We usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. ", "The chicken chow mein is definitely a solid pick. ", "If you enjoy chow mein, definitely order it from here. ", "The hot and sour soup is ok, not as good as City Chopsticks. ", "The depth of flavor isn't there. "], "author": "Carolyn Z.", "review": "Le bf and I discovered Jade Cafe via Eat24. Our previous go-to Chinese delivery place was City Chopsticks. \n\nWe usually get the chicken chow mein, hot and sour soup, golden pot stickers, fried egg rolls, and Rainbow Chicken. The chicken chow mein is definitely a solid pick. If you enjoy chow mein, definitely order it from here. The hot and sour soup is ok, not as good as City Chopsticks. The depth of flavor isn't there. Everything else is very solid.\n\nWe will continue to order from Jade Cafe when we crave Chinese delivery. \n\nPro tip: Don't order from this place on Chinese New Year. We did this past Lunar New Year and they not only messed up our order, it also came 80 minutes later than it was supposed to. At one point, Eat24 stopped the restaurant from accepting more delivery orders because they were so far behind.", "rating": 4, "date": "2017-05-20"}, {"excerpts": ["just green onions, Chicken Chow Mein NO VEGGIES, Oyster Beef over rice NO VEGGIES. "], "author": "SHRONDA J.", "review": "I will NEVER order from here again.!!!! The customer service sucks and the man who took my order did not follow directions. Its to the point I want to say write in ENGLISH SO THAT I CAN SEE THAT YOU GOT MY ORDER RIGHT!  I ordered Mongolian Beef over rice NO mushrooms light onions HEAVY GRAVY, Prawn Fried Rice NO EGGS NO VEGGIES just green onions, Chicken Chow Mein NO VEGGIES, Oyster Beef over rice NO VEGGIES. They gave me an extra order of prawn fried rice regular with everything in it, another prawn fried rice just the way that I ordered  but they forgot to hold the shit (feces) in the prawns, the prawns felt overly swetty like soggy moist, no gravy at all on my mongolian beef, veggies all through the chow mein, and the bathroom had a lil turd (feces) on the floor. I will completely slap the piss out of myself before I EVER come back here", "rating": 1, "date": "2016-04-25"}, {"excerpts": ["The chicken chow mein was greasy and totally flavourless. ", "Literally no sauce ", "what so ever. ", "Hardly any veggies to add colour and very poor quality \"chicken\" pieces. "], "author": "Liam G.", "review": "Pros: Cheap\nCons: Everything else!!!\n\nThey missed our wonton soup from the order. I called the driver immediately as he had just driven away - he said he'd call me back in 5minutes and drop off our soup, but he never did. Awful service. Check your order before you hand over the cash!\n\nSo to the products that we DID get... The chicken chow mein was greasy and totally flavourless. Literally no sauce what so ever. Hardly any veggies to add colour and very poor quality \"chicken\" pieces. Avoid!\n\nThe pot stickers were very soggy (a result of the very long delivery time sitting in a plastic container) but it was made even worse because the dumplings dough was very thick and the fillings very scarce, so they were mostly just flavourless mush. Avoid!\n\nThe chicken curry looked good with lots of veggies (again just a few scarce pieces of \"chicken\") but when I tasted it I instantly recognised the curry sauce was just a very plain and basic madras curry powder. Avoid!\n\nSo we paid for 4 items, got 3, even after instantly telling the driver. 2 were so bad we left them after a taste, and the final curry fish was mostly just an overpriced container of veggies.\n\nI guess you buy cheap, you buy twice! :-(", "rating": 1, "date": "2015-04-19"}, {"excerpts": ["lol \n\nHoney Walnut Shrimp, Chicken Friend Rice, Chicken Chow Mein and sometimes Egg Rolls. "], "author": "Drea W.", "review": "I'm a FAN.\n\nWhen I'm in the area or don't mind traveling to Jade's on a lazy Saturday- I do it!\n\nGREAT prices. I order the SAME THING every time. lol \n\nHoney Walnut Shrimp, Chicken Friend Rice, Chicken Chow Mein and sometimes Egg Rolls. Portions are pretty huge so when I order this it's for a family or friends night in. \n\nMy food is ALWAYS fresh. Never had an issue with my order. They usually throw in free stuff. The lady of the house has a dry humor so beware if you aren't use to it. I think she's hilarious.\n\nThe place isn't ever packed so come anytime.", "rating": 5, "date": "2015-03-25"}, {"excerpts": ["5.75 for an enormous portion of chicken chow mein. ", "I'll definitely be a regular there."], "author": "Chris P.", "review": "I was craving Chinese food while at work the other day and decided to check out Jade cafe across the street from me. You know that feeling when food absolutely satisfies what you crave? Thank you Jade Cafe. 5.75 for an enormous portion of chicken chow mein. I'll definitely be a regular there.", "rating": 5, "date": "2009-07-17"}], "beef with tomato chow mein": [], "shrimp chow mein": [{"excerpts": ["We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\n", "The yang chow fried rice and mongolian beef were okay ", "The yang chow fried rice and mongolian beef were okay ", "but I really liked the shrimp chow mein ", "it was yummy flavorful. ", "I'd go back in a heartbeat. "], "author": "Gary E.", "review": "My wife was suppose to attend her Zumba class across the street but quickly found out that the instructor she liked apparently opened up her own shop elsewhere and to top it off the class was full for the evening. So instead, we ended up stuffing our faces here.\n\nThis place was a pretty casual dive type hole in the wall. The menu offered had a good selection of Chinese food across the board. I quickly noticed that the flow of to-go phone in orders were steady so that's good news for the business. The place was half full and everyone seemed pleased with the food. We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\nIt didn't take long for the food to arrive. The yang chow fried rice and mongolian beef were okay but I really liked the shrimp chow mein it was yummy flavorful. I'd go back in a heartbeat. Fairly priced and good service!\n\nZumba turned into Jade...", "rating": 3, "date": "2011-03-22"}], "house special chow fun": [], "seafood chow fun": [{"excerpts": ["I think that's what I got on my Deluxe Seafood Chow Fun.  ", "Chow fun was not meant to be served this way ... ", "along with the flat rice noodles, I found a few coils of rubbery calamari, a few bits of scallops, a couple of shrimp, a few chunks of imitation crab, some zucchini, half a button mushroom, two straw mushrooms, water chestnut slices, celery, onion chunks, bamboo shoots, one string bean, two florets of broccoli, bean sprouts, two black beans, a few pieces of green bell pepper, and a single carrot slice.  ", "What happened here?  "], "author": "Wilhelm Y.", "review": "A co-worker suggested that I try this restaurant.  He told me the food was okay and the place fills up in the evening with many of the patrons who work out at the 24 Hour Fitness located across the street.\n\nThese folks must be working out pretty hard to be able to enjoy a dining experience here.  The floors are filthy and the place is loud, but it's not the restaurant patrons who are making all the noise.  The waitress managed to carry on a very loud conversation in Cantonese with members of the kitchen staff as she took orders and served food to restaurant patrons.  I would not have minded had the conversation's subject been a bit more interesting other than family gossip.  I was trying not to think of how much of her spit was flying into people's food as she carried on her conversation and served the food.\n\nTaste-wise, the food was edible and the portions are a good size.  Think back to my days in elementary school when the \"cook's choice\" served up every Friday was a combination of all the leftover parts of the lunches served on Monday through Thursday.  I think that's what I got on my Deluxe Seafood Chow Fun.  Chow fun was not meant to be served this way ... along with the flat rice noodles, I found a few coils of rubbery calamari, a few bits of scallops, a couple of shrimp, a few chunks of imitation crab, some zucchini, half a button mushroom, two straw mushrooms, water chestnut slices, celery, onion chunks, bamboo shoots, one string bean, two florets of broccoli, bean sprouts, two black beans, a few pieces of green bell pepper, and a single carrot slice.  What happened here?  Did the cook not find any cockroaches to throw into my plate because I was certainly anticipating it?  \n\nTry not to look too closely at the wood paneling because you will find that the walls are not cleaned very well either, and there are actually food particles stuck to it.  Gross!  Stick with a can of Coke because that was probably the best part of my meal.  You don't know unless you experience it, and this restaurant is a bad experience.", "rating": 1, "date": "2007-02-25"}], "shrimp with tender green chow fun": [], "shrimp with black bean sauce chow fun": [], "beef with bean sprout chow fun": [], "beef with black bean sauce chow fun": [], "singapore style chow rice noodle": [], "house special pan fried noodles": [], "seafood pan fried noodles": [], "beef with tender green pan fried noodles": [], "beef with broccoli pan fried noodles": [], "beef with black bean sauce pan fried noodles": [], "chicken with tender green pan fried noodles": [], "chicken with black bean sauce pan fried noodles": [], "shrimp with tender green pan fried noodles": [], "shrimp with mixed vegetable pan fried noodles": [], "shrimp with black bean sauce pan fried noodles": [], "house special fried rice": [{"excerpts": ["The house special fried rice is amazing. "], "author": "Madhubanti B.", "review": "Love the food and love their service. The house special fried rice is amazing. And if you have cold order their hot and sour soup.", "rating": 5, "date": "2017-03-08"}], "shrimp fried rice": [{"excerpts": ["Ordered the shrimp fried rice - good portion for the price. ", "The food was okay, the employees were polite, and the service was quick."], "author": "AK _.", "review": "Came in for lunch on a Saturday afternoon since I was closeby. Ordered the shrimp fried rice - good portion for the price. The food was okay, the employees were polite, and the service was quick.", "rating": 5, "date": "2018-06-23"}, {"excerpts": ["We always order the beef and bok choy chow fun, cod and veggies over rice, shrimp fried rice, and if you order over $20 you get a free chow mein! ", "They're won ton soup is really great too."], "author": "Nicole M.", "review": "My go-to chinese restaurant. We always order the beef and bok choy chow fun, cod and veggies over rice, shrimp fried rice, and if you order over $20 you get a free chow mein! They're won ton soup is really great too.", "rating": 5, "date": "2017-03-14"}, {"excerpts": ["There was a dirty pinkie fingernail in the shrimp fried rice that I ordered to go. ", "DISGUSTING!!  ", "Beware..."], "author": "Rhonda G.", "review": "There was a dirty pinkie fingernail in the shrimp fried rice that I ordered to go. DISGUSTING!!  Beware...", "rating": 1, "date": "2016-11-27"}, {"excerpts": ["the food was skimpy:shrimp fried rice and beef br occoli. ", "the only items that was good: shrimp fried rice and pot stickers. ", "i've been to chinese food places that give u big portions for your money's worth.i ", "just wanted to check this place out and give it a chance but not going to be on my list of favorite."], "author": "Bernadette F.", "review": "we had ordered from th is place 12/17 f/11 and spent $31 for family of 4. the food was skimpy:shrimp fried rice and beef br occoli. the beef broccoli tasted mushy and bland, the fried chicken wasn't seasoned. the only items that was good: shrimp fried rice and pot stickers. i've been to chinese food places that give u big portions for your money's worth.i just wanted to check this place out and give it a chance but not going to be on my list of favorite.", "rating": 2, "date": "2011-12-18"}], "yang chow fried rice": [{"excerpts": ["We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\n", "The yang chow fried rice and mongolian beef were okay ", "The yang chow fried rice and mongolian beef were okay ", "but I really liked the shrimp chow mein ", "it was yummy flavorful. ", "I'd go back in a heartbeat. "], "author": "Gary E.", "review": "My wife was suppose to attend her Zumba class across the street but quickly found out that the instructor she liked apparently opened up her own shop elsewhere and to top it off the class was full for the evening. So instead, we ended up stuffing our faces here.\n\nThis place was a pretty casual dive type hole in the wall. The menu offered had a good selection of Chinese food across the board. I quickly noticed that the flow of to-go phone in orders were steady so that's good news for the business. The place was half full and everyone seemed pleased with the food. We ordered Yang Chow Fried Rice, Shrimp Chow Mein and Mongolian Beef.\n\nIt didn't take long for the food to arrive. The yang chow fried rice and mongolian beef were okay but I really liked the shrimp chow mein it was yummy flavorful. I'd go back in a heartbeat. Fairly priced and good service!\n\nZumba turned into Jade...", "rating": 3, "date": "2011-03-22"}], "barbecued pork fried rice": [], "chicken fried rice": [{"excerpts": ["I pretty much always get the chicken fried rice and it's a good portion (enough for 2 meals) and quite delish.  ", "I guess the reviews here are saying that the food is bland and I do have to agree somewhat.  ", "It's really nothing some soy sauce and chili oil can't fix.  ", "And I prefer that over something overly salty.  ", "I'm rating this place pretty generously despite some pretty major flaws.  ", "For one, the chicken fried rice is listed at $5.50 on the menu but they always charge me $6 ", "(actually, I  just realized that's probably tax).  ", "I figure that's cool because they give me soup and tea with my meal.  ", "I also don't like all the rules about minimum order for take out and credit cards.  ", "Still, for cheap and filling lunch, it makes me happy."], "author": "Dan P.", "review": "Cheap Chinese food.  I pretty much always get the chicken fried rice and it's a good portion (enough for 2 meals) and quite delish.  I guess the reviews here are saying that the food is bland and I do have to agree somewhat.  It's really nothing some soy sauce and chili oil can't fix.  And I prefer that over something overly salty.  I'm rating this place pretty generously despite some pretty major flaws.  For one, the chicken fried rice is listed at $5.50 on the menu but they always charge me $6 (actually, I  just realized that's probably tax).  I figure that's cool because they give me soup and tea with my meal.  I also don't like all the rules about minimum order for take out and credit cards.  Still, for cheap and filling lunch, it makes me happy.", "rating": 4, "date": "2011-12-30"}, {"excerpts": ["I used to liked Chinese food, until the day that I went with my friends to eat to the jade's cofe restaurant, where we ordered four orders of chicken brocoli and two of chicken fried rice. ", "The food was undercook, but it  became disgusting when we saw a cockroach coming out from under the table. ", "the worts part was when we noticed that it was also a dead cockroach in  one of our dishes. ", "i sincerely  recommend you to pay a little more money when you go to eat. ", "its always better to spend a little more money and have a nice time, instead of having a horrible experience. ", "Jade's cofe restaurant is the worts place that i have ever been in my entire life. ", "ITS DISGUSTING AND ", "NASTY AS HELL :/"], "author": "fischer t.", "review": "I used to liked Chinese food, until the day that I went with my friends to eat to the jade's cofe restaurant, where we ordered four orders of chicken brocoli and two of chicken fried rice. The food was undercook, but it  became disgusting when we saw a cockroach coming out from under the table. the worts part was when we noticed that it was also a dead cockroach in  one of our dishes. i sincerely  recommend you to pay a little more money when you go to eat. its always better to spend a little more money and have a nice time, instead of having a horrible experience. Jade's cofe restaurant is the worts place that i have ever been in my entire life. ITS DISGUSTING AND NASTY AS HELL :/", "rating": 1, "date": "2010-12-08"}], "beef fried rice": [], "fresh vegetables fried rice": [], "chicken with salted fish fried rice": [{"excerpts": ["I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, ", "Ma Po Dofu ", "(Spicy Hot Bean Curd with minced pork)..."], "author": "Will H.", "review": "I'm addicted to this place.  Very friendly and speedy delivery service that usually arrives at my place in under 25 minutes.  I highly recommend the Roasted Duck Wonton Soup, Chicken with Salted Fish Fried Rice, Ma Po Dofu (Spicy Hot Bean Curd with minced pork)...well, pretty much everything that I've tried.\n\nI've heard that the actual establishment is pretty disgusting, so delivery is recommended.", "rating": 4, "date": "2006-07-24"}], "steamed rice": [{"excerpts": ["Ordered chicken wonton, and mixed vegetable with chicken and steamed rice. ", "The food was good. ", "I like that the mixed vegetable dish has pieces of ginger. ", "Really enjoyed."], "author": "Donald B.", "review": "Ordered chicken wonton, and mixed vegetable with chicken and steamed rice. The food was good. I like that the mixed vegetable dish has pieces of ginger. Really enjoyed.", "rating": 4, "date": "2018-07-09"}, {"excerpts": ["Steamed Rice - The rice was clumpy.\n\n"], "author": "Mark D.", "review": "1.  Review of delivery from Jade Cafe.\n\n2.  Easy to order on Grubhub.com\n\n3.  Mongolian Beef - The meat was tender but oily.  It was rather bland. The portion was large.\n\nhttp://tinyurl.com/3uhazyj\n\n4.  Steamed Rice - The rice was clumpy.\n\n5.   Chicken with Mixed Vegetables on Rice  - I did not like this dish.  It was extremely bland.  I did not eat it.  Who knows?  Maybe, after drinking later on, it will taste better.  The portion was large.\n\nhttp://tinyurl.com/3lzpogn\n\n6.  Delivery took a little over the estimate.  It was just over an hour.\n\n7.  I asked for paper plates.  They did not bring them.\n\n8.  I asked for a side of hot sauce.  They did not bring it.\n\n9.   Low minimum for delivery ($10).\n\n10.  Good prices for delivery.  $16.43 including tax for 2 entrees and a side of rice.\n\n11.  My fortune was \"This year your highest priority will be your family\".\n\n12.  For lottery players, my lucky numbers were:\n      3, 8, 12, 16, 19, 20", "rating": 2, "date": "2011-04-01"}, {"excerpts": ["I usually ate Orange Chicken and steamed rice.  ", "I haven't ordered take out in years, and hadn't eaten their food in about 10 years, but recently was desiring my old usual dish.  ", "I checked out Yelp, and was a bit taken aback by the negative comments.  ", "After a few days, I decided last Tuesday afternoon (I'm retired now and at home) to order delivery anyway.  ", "I got Orange Chicken, double steamed rice, Sweet and Sour Pork, and decided to try the String Beans and fried Tofu, so I'd have leftoevers, maybe to share with my brother.  ", "I received a pork fried rice too, as a freebie.  ", "I did it on the internet over Eat24 at @3:00.  ", "My doorbell rang @25 minutes later, it was here.  ", "Simon, the delivery guy, couldn't have been more polite and nice.  ", "It was like he was my friend bringing me food. ", "I asked about the owner, (with whom I was always friendly as well), by name (I don't want to say his name in this review) and was told he's still there.  ", "I had so much food.  ", "Today is Friday, and I just finished the last of it.  ", "Those four dishes have been all I've eaten for 4 days, reheated in the microwave, and the leftovers were more flavorful and delicious than the first.  ", "This is the kind of Chinese food that characterized San Francisco, except it's less greasy than those kind of dishes use to be.   ", "I will certainly begin ordering deleivery from time to time, now. ", "Thank you Mr. A, and thank you my new friend Simon, daytime delivery guy.  ", "I'm glad you are here."], "author": "Donald W.", "review": "CHINESE COMFORT FOOD\nAs a native SF (almost 60 years) who grew up mostly in the 60's, Chinese Delivery/Take out all use to come from China Town.  As I remember, the primary place was the Chinese Kitchen (no longer in existence).  This food is the food we all ate in those days before food became viewed as an enemy; something to assess, control and hold at bay; we ate what we liked, even here in San Francisco.  We've become too \"gormet\" and eccentric now for a variety of reasons.  That being said; I also was a frequent customer of theirs since moving into this neighborhood 19 years ago.  I usually ate Orange Chicken and steamed rice.  I haven't ordered take out in years, and hadn't eaten their food in about 10 years, but recently was desiring my old usual dish.  I checked out Yelp, and was a bit taken aback by the negative comments.  After a few days, I decided last Tuesday afternoon (I'm retired now and at home) to order delivery anyway.  I got Orange Chicken, double steamed rice, Sweet and Sour Pork, and decided to try the String Beans and fried Tofu, so I'd have leftoevers, maybe to share with my brother.  I received a pork fried rice too, as a freebie.  I did it on the internet over Eat24 at @3:00.  My doorbell rang @25 minutes later, it was here.  Simon, the delivery guy, couldn't have been more polite and nice.  It was like he was my friend bringing me food. I asked about the owner, (with whom I was always friendly as well), by name (I don't want to say his name in this review) and was told he's still there.  I had so much food.  Today is Friday, and I just finished the last of it.  Those four dishes have been all I've eaten for 4 days, reheated in the microwave, and the leftovers were more flavorful and delicious than the first.  This is the kind of Chinese food that characterized San Francisco, except it's less greasy than those kind of dishes use to be.   I will certainly begin ordering deleivery from time to time, now. Thank you Mr. A, and thank you my new friend Simon, daytime delivery guy.  I'm glad you are here.", "rating": 5, "date": "2014-02-14"}, {"excerpts": ["We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. ", "Every was good and the portions were pretty big. "], "author": "L M.", "review": "Fast and friendly service, lots of different items on the menu. We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. Every was good and the portions were pretty big. Although this isn't my regular go-to place for Chinese, I was pleased and will be back here again. \n\nSmall family-run joint and worth a visit if you're in the area and craving Chinese.", "rating": 4, "date": "2011-04-04"}, {"excerpts": ["I wasnt paying for the soup, She had the nerve to ask me to pay for the steamed rice that I got on the side! ", "RUDE! ", "Other times I have been there ", "they are extremly rude, ", "they yell, they roll their eyes and they just have NO customer service skills!"], "author": "Dee L.", "review": "Use to really like this place. Had great food flavor, Up until I found a HAIR in my soup. Aside from that being disgusting, The way they handled the situation was worse than the hair! (kinda) The woman thought I was joking about the hair, She was smiling the whole time. Then when she finally found it, Told her I wasnt paying for the soup, She had the nerve to ask me to pay for the steamed rice that I got on the side! RUDE! Other times I have been there they are extremly rude, they yell, they roll their eyes and they just have NO customer service skills!", "rating": 1, "date": "2012-02-29"}, {"excerpts": ["even the steamed rice kicked booty\n\n"], "author": "Matt V.", "review": "Every time I go here, this place just gets better...\n\nTonight we ordered more food than any two people should ever consume...to the point that the waitress even laughed...\n\nEverything was amazing\nHot & Sour soup was the best I've ever had\nSalt & Pepper shrimp was to die for (as always)\nSweet & sour chicken, which I normally don't do...was great\neven the steamed rice kicked booty\n\nThe daughter of one of the employees was cruising around the joint (she's like 6 or 7 years old) and made our night...she was chatting with us and asking all kinds of questions about our tattoos.  It was hilarious...her parents weren't too happy...no 7 year old girl should ask their parents for tattoos...", "rating": 5, "date": "2008-10-13"}], "house special on rice": [], "seafood on rice": [], "shrimp with mixed vegetables on rice": [], "shrimp with scrambled egg on rice": [], "shrimp with black bean sauce on rice": [], "bbq pork with bean cake on rice": [], "bbq pork with tender green on rice": [], "beef with broccoli on rice": [], "beef with oyster sauce on rice": [], "beef with ginger and scallions on rice": [], "beef with tender green on rice": [], "chicken with black bean sauce on rice": [], "chicken with mixed vegetables on rice": [{"excerpts": ["Chicken with Mixed Vegetables on Rice  - I did not like this dish.  ", "It was extremely bland.  ", "I did not eat it.  ", "Who knows?  ", "Maybe, after drinking later on, it will taste better.  "], "author": "Mark D.", "review": "1.  Review of delivery from Jade Cafe.\n\n2.  Easy to order on Grubhub.com\n\n3.  Mongolian Beef - The meat was tender but oily.  It was rather bland. The portion was large.\n\nhttp://tinyurl.com/3uhazyj\n\n4.  Steamed Rice - The rice was clumpy.\n\n5.   Chicken with Mixed Vegetables on Rice  - I did not like this dish.  It was extremely bland.  I did not eat it.  Who knows?  Maybe, after drinking later on, it will taste better.  The portion was large.\n\nhttp://tinyurl.com/3lzpogn\n\n6.  Delivery took a little over the estimate.  It was just over an hour.\n\n7.  I asked for paper plates.  They did not bring them.\n\n8.  I asked for a side of hot sauce.  They did not bring it.\n\n9.   Low minimum for delivery ($10).\n\n10.  Good prices for delivery.  $16.43 including tax for 2 entrees and a side of rice.\n\n11.  My fortune was \"This year your highest priority will be your family\".\n\n12.  For lottery players, my lucky numbers were:\n      3, 8, 12, 16, 19, 20", "rating": 2, "date": "2011-04-01"}], "chicken with curry on rice": [], "beef stew with curry on rice": [], "beef stew with original juice on rice": [], "spare ribs with black bean sauce on rice": [], "spare ribs with bean cake on rice": [], "roasted duck on rice": [], "roasted duck with bean cake on rice": [], "spicy salt pepper shrimp": [], "minced chicken with lettuce cup": [], "walnut prawns": [{"excerpts": ["Where else can you find your classic rice plate faves like Mongolian Beef over rice, Mango chicken, Won ton soup, or Honey walnut prawns all usually under 10 dollars. \n\n"], "author": "B H.", "review": "I like Americanized Chinese food, so kill me you cuisine purists out there! Working and living within close proximity to this place for close to 15 years I've seen and tasted the environment here all too well. Recently they put out this fancy glossy fivefold mailer/ menu, it makes their dishes look incredible, now if only a bit more effort were put into the actual presentation of the actual dishes then we can talk. No complaints on the portions here, I always take home a little doggie bag (and lucky me gets to play doggie since I have no pets). Where else can you find your classic rice plate faves like Mongolian Beef over rice, Mango chicken, Won ton soup, or Honey walnut prawns all usually under 10 dollars. \n\nMuch improved from the past, when I would eat in and thought that \"Palmolive dish soap\" was their secret ingredient. Service seems to be selective. Is it me or do they always seem mad at something or somebody, I can't comprehend any Cantonese, but you don't have to be a linguistics major to understand the staff snapping at each other like phirana fish in one tank. I've tried tipping well up to 20- 25% above the norm but just can't seem to get the same reaction? If you're a pudgy Caucasian blue collar man you seem to get a smile, maybe even a laugh from the always busy waitstaff, Oh well it's all about the food, my 45-50 minutes of freedom on my lunch hour, and pleasing my \"gut\" and it's instincts.", "rating": 3, "date": "2010-07-16"}, {"excerpts": ["We've tried:\nWalnut Prawns\n", "Shrimp "], "author": "Jessica R.", "review": "Friends and I have ordered from Jade twice now.\nWe've tried:\nWalnut Prawns\nShrimp w/Snow Peas\nFresh Vegetable Fried Rice\nFried Tofu w/Green Bean in Dry Spicy Garlic\n\nEverything has been veryyyyy delicious! And delivered quickly as well!", "rating": 4, "date": "2011-03-20"}, {"excerpts": ["The best Walnut Prawns anywhere. ", "BBQ pork wonton soup is fantastic, though not listed on the menu I don't think. ", "Just ask for it!"], "author": "Alex W.", "review": "Just as good as it always was. The best Walnut Prawns anywhere. BBQ pork wonton soup is fantastic, though not listed on the menu I don't think. Just ask for it!", "rating": 5, "date": "2013-07-11"}, {"excerpts": ["My daughter makes it a point to always get th honey walnut prawns!"], "author": "A M.", "review": "Great place to go to if you want good & quick chinese food. \n\nLove their crispy chicken, pan fried noodles and bbq pork chow mein. My daughter makes it a point to always get th honey walnut prawns!", "rating": 4, "date": "2012-01-16"}, {"excerpts": ["The minced beef soup was okay, the walnut prawns and salt and pepper pork chops were definitely very tasty.  "], "author": "John R.", "review": "If you feel like good, solid, cheap Chinese food, and if you're in the area, this is definitely a place to consider.  The minced beef soup was okay, the walnut prawns and salt and pepper pork chops were definitely very tasty.  and good sized portions too!\n\nThe waitress gave us great service, refilling water frequently, helped us pack up the leftovers, etc.  Probably it was just because my friend and I are both very cute.  Yea, that must be it.", "rating": 4, "date": "2007-03-19"}, {"excerpts": ["I ordered the walnut prawns and the kung pao chicken (extra hot). ", "Both of these dishes were specifically recommended. ", "When i got them, they were terrible. ", "The walnut prawns were tasteless and soggy. ", "The kung pao chicken was supposed to spicy and was definitely not at all. ", "It was over-sauced so much, ", "the chicken tasted like the peanuts, like the carrots, like the zucchini....."], "author": "Rachel G.", "review": "I ordered from this restaurant strictly because of the rave reviews i read from city search. Um, no. \n\n\"No\" SO MUCH that I decided to create a YELP account strictly to steer other sheep away from this Place !!!  How bad are you that it drives me to take the time to create an entire on line profile to complain about you?  \n\nI ordered the walnut prawns and the kung pao chicken (extra hot). Both of these dishes were specifically recommended. When i got them, they were terrible. The walnut prawns were tasteless and soggy. The kung pao chicken was supposed to spicy and was definitely not at all. It was over-sauced so much, the chicken tasted like the peanuts, like the carrots, like the zucchini.....all tasted like soy sauce..... \n\nI will cut  city searchers some slack. Maybe this is your first Chinese food experience ever? Maybe you are deathly ill and can't taste, or smell, or have blurry vision ?! Maybe you are used to eating at Chain Chinese Food Establishments like: Pick Up Sticks, or I Love Teriyaki......Or possibly you are co-owner of Jade Cafe and really need to promote your business. \n\n3 (Good) things about Jade (I am not a total bee-och)- Fast delivery, friendly and professional delivery driver and found our apartment which is not easy.... \n\nPros: Fast Deliver, Friendly Deliver Driver, Found our Apartment which is not easy.... \nCons: Terrible Quality of Food, Over Sauced, and OVER salty, Put us on hold six times when trying to order delivery.", "rating": 1, "date": "2008-01-04"}], "rainbow fish fillet": [], "orange peel beef": [], "orange peel chicken": [], "ginger green onion with oyster": [], "crispy fried oyster": [], "sesame chicken": [{"excerpts": ["and I got their sesame chicken as well as eggplant in garlic sauce. ", "Both were a-ok and exactly what I expected. ", "Not amazing, but just good, decent Americanized Chinese food. ", "What I ordered lasted me ", "~5 meals, which was amazing. ", "So much food for so little and was just pretty alright and good. ", "I'd go back. ", "Service was good too. ", "Nothing too great, but not horrible. ", "Just your normal hole in a wall type of restaurant that was physically a lot bigger than a normal hole in the wall."], "author": "Julie L.", "review": "This place is solid. I honestly came here because I didn't feel like really cooking and I got their sesame chicken as well as eggplant in garlic sauce. Both were a-ok and exactly what I expected. Not amazing, but just good, decent Americanized Chinese food. What I ordered lasted me ~5 meals, which was amazing. So much food for so little and was just pretty alright and good. I'd go back. Service was good too. Nothing too great, but not horrible. Just your normal hole in a wall type of restaurant that was physically a lot bigger than a normal hole in the wall.", "rating": 3, "date": "2015-05-22"}, {"excerpts": ["Best Mongolian beef, sesame chicken, hot and sour soup ... ", "So good!"], "author": "Katherine L.", "review": "OMG!  Great, fresh food!  Best Mongolian beef, sesame chicken, hot and sour soup ... So good!", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["I had the Mango Shrimp and my wife had the Sesame Chicken with both dishes spicy. ", "Neither of us could find fault with the dishes. "], "author": "Wayne B.", "review": "I ate here yesterday due to having to do pet things at the SPCA. \n\nI'll definitely eat here again. It's not the best but, it's far from the worst. \n\nThe prices are good. The portions are healthy and as several of the Yelpers stated...this is definitely a blue collar establishment. \n\nI had the Mango Shrimp and my wife had the Sesame Chicken with both dishes spicy. Neither of us could find fault with the dishes. We also washed it all down with a couple of cold Tsing-Tao beers. \n\nOur server was fantastic. She made us feel right at home and checked on us a few times. She made certain we were taken care of. I did notice two of the other servers that if they waited on us...I would be writing a different review. \n\nNo complaints from me folks. I'll eat there again. \n\nGive it a try.", "rating": 3, "date": "2010-06-30"}, {"excerpts": ["We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. ", "Every was good and the portions were pretty big. "], "author": "L M.", "review": "Fast and friendly service, lots of different items on the menu. We ordered chow fun, Mongolian beef, sesame chicken, steamed rice and pot-stickers. Every was good and the portions were pretty big. Although this isn't my regular go-to place for Chinese, I was pleased and will be back here again. \n\nSmall family-run joint and worth a visit if you're in the area and craving Chinese.", "rating": 4, "date": "2011-04-04"}, {"excerpts": ["My Sesame Chicken was freshly cooked and tender.\n\n"], "author": "Ryan V.", "review": "Let's keep this straightforward:\n\nI had a cheap Chinese lunch that was pretty decent. My Sesame Chicken was freshly cooked and tender.\n\nThis place won't win any points from germophobes, but I didn't feel the need to take a shower after leaving, so it's not so bad.\n\nOverall a solid choice for the neighborhood.", "rating": 3, "date": "2008-09-29"}, {"excerpts": ["Love the sesame chicken and orange chicken... ", "My wife loves this place so much"], "author": "Rene C.", "review": "Very tasty chinnese food. Love the sesame chicken and orange chicken... My wife loves this place so much", "rating": 4, "date": "2011-05-20"}], "crispy fried squid with spicy pepper": [], "fried tofu with green bean in dry spicy garlic": [], "eggplant with chicken shrimp in special sauce": [], "spicy salt pepper pork chop": [], "yellow onion pork chop": [], "hong kong style family dinner": [], "peking style family dinner": [], "deepfried banana": [], "can soda": []}