{"crab puff": [{"excerpts": ["Sometimes, after a trying day all you need is a crab puff, an egg roll, a pot sticker, some fried chicken wings and a good friend to remind you ", "that life's okay and maybe, just maybe, so are you. ", "If the crab puff-egg roll-pot sticker-fried chicken wings solution is one you want to employ order the appetizer combination (the good friend you will have to find on your own.) ", "Unlike in other Chinese restaurants, every single item on the plate is excellent.\r\n\r\n", "Keep the good vibes going with a dish of dry sauteed string beans. ", "They're flavorful and packed full of spice and pass the leftover test with flying colors. "], "author": "Miriam W.", "review": "Sometimes, after a trying day all you need is a crab puff, an egg roll, a pot sticker, some fried chicken wings and a good friend to remind you that life's okay and maybe, just maybe, so are you. If the crab puff-egg roll-pot sticker-fried chicken wings solution is one you want to employ order the appetizer combination (the good friend you will have to find on your own.) Unlike in other Chinese restaurants, every single item on the plate is excellent.\r\n\r\nKeep the good vibes going with a dish of dry sauteed string beans. They're flavorful and packed full of spice and pass the leftover test with flying colors. Chow mein is just okay and the Szechwan beef ought to be avoided - it was seriously disappointing.", "rating": 3, "date": "2006-06-14"}, {"excerpts": ["Crab Puff; 3. ", "Ostrich; 4. ", "Shanghai fish fillet; 5. ", "Seafood clay pot; ... ", "And, more important is it's making your money smarter!"], "author": "Yina M.", "review": "I can count from 1 to 10 about good dishes from them. They are not super pretty but they are super delicious. 1. Wonton Soup; 2. Crab Puff; 3. Ostrich; 4. Shanghai fish fillet; 5. Seafood clay pot; ... And, more important is it's making your money smarter!", "rating": 4, "date": "2005-06-17"}], "vegetable egg roll": [], "pork pot sticker": [], "onion pancake": [{"excerpts": ["Ordered the dim sum combination plate and onion pancake. \n\n", "Onion pancake - \nDidn't even get to take a picture of the pancake ", "bc I threw it out after the first bite. ", "It was dry, cardboard like with no real taste except for bitter oil. ", "Gross.. ", "so gross. ", "DONT GET ", "THIS SAVE ", "Dim sum combination plate -\nBbq pork buns were soggy and overly sweet. \n", "Shrimp dumplings - good. ", "Small but good. \n", "Siu mai - ", "the meat itself had a lot of flavor ", "but I wish the siu mai was fresh. ", "I have a feeling they keep their siu mai under a heated lamp for hours. ", "My siu mai was rubber like. ", "Dim sum combination plate -\nBbq pork buns were soggy and overly sweet. \n", "Shrimp dumplings - good. ", "Small but good. \n", "Siu mai - ", "the meat itself had a lot of flavor ", "but I wish the siu mai was fresh. ", "I have a feeling they keep their siu mai under a heated lamp for hours. ", "My siu mai was rubber like. "], "author": "AJ C.", "review": "It's a good thing I had a $7 delivery coupon. The food here is lacking in freshness. My food came cold and soggy. I'm disappointed but what do you expect with Chinese food deliveries... hit or miss. \n\nOrdered the dim sum combination plate and onion pancake. \n\nOnion pancake - \nDidn't even get to take a picture of the pancake bc I threw it out after the first bite. It was dry, cardboard like with no real taste except for bitter oil. Gross.. so gross. DONT GET THIS SAVE YOUR $6.\n\nDim sum combination plate -\nBbq pork buns were soggy and overly sweet. \nShrimp dumplings - good. Small but good. \nSiu mai - the meat itself had a lot of flavor but I wish the siu mai was fresh. I have a feeling they keep their siu mai under a heated lamp for hours. My siu mai was rubber like. Disappointing \n\n\nFirst and last time ordering food here. I don't think dining in will improve food quality either.", "rating": 2, "date": "2016-11-12"}, {"excerpts": ["Will say the hot & sour soup was tasty, and the onion pancake was fine, too. "], "author": "Sital P.", "review": "Seriously think our kung pao chicken was more like kung pao kitty. Texture was so off it turned us off. Will say the hot & sour soup was tasty, and the onion pancake was fine, too. But the chicken turned us away for life. \n\nAnd the search for cheap hunan style amazing chinese continues....", "rating": 2, "date": "2011-05-03"}, {"excerpts": ["The green onion pancake is a chunk of fried bliss and the general Tsao chicken is addictive. ", "However, the general Tsao has been inconsistent lately, which isn't a bad thing, but can be confusing. ", "For instance, sometimes it's more breaded and/or saucy than others. ", "It's all gravy though because this chicken is always tasty. ", "The veggie fried rice compliments ", "any entree well. ", "You can also dine in-house to enjoy the reasonable lunch specials."], "author": "Adam L.", "review": "I agree with Bill Clinton: Jasmine Tea House is the truth! This is by far my favorite Chinese delivery in the city. The green onion pancake is a chunk of fried bliss and the general Tsao chicken is addictive. However, the general Tsao has been inconsistent lately, which isn't a bad thing, but can be confusing. For instance, sometimes it's more breaded and/or saucy than others. It's all gravy though because this chicken is always tasty. The veggie fried rice compliments any entree well. You can also dine in-house to enjoy the reasonable lunch specials.", "rating": 4, "date": "2009-01-03"}, {"excerpts": ["Other dim sum is pretty good aside from the onion pancake.  ", "Food is VERY oily and favorite dish is probably the claypot or the chicken lettuce cups.  ", "Their noodle soups are acceptable and again the broth is a little oily and salty.  ", "Good place to have in your neighborhood but NOT good place to judge Chinese food."], "author": "Aeon G.", "review": "OK...I've been hear many many times.  Potstickers are VERY good (both the veggie and the pork ones).  Other dim sum is pretty good aside from the onion pancake.  Food is VERY oily and favorite dish is probably the claypot or the chicken lettuce cups.  Their noodle soups are acceptable and again the broth is a little oily and salty.  Good place to have in your neighborhood but NOT good place to judge Chinese food.", "rating": 3, "date": "2006-10-17"}], "deep fried oyster": [], "bbq pork spareribs": [], "fried prawn": [{"excerpts": ["we ordered chicken chow mein (which was outstanding) & vegetable soup \n6) and every dim sum item you can imagine: shrimp dumplings, chive dumplings, BBQ pork buns, shu mai, sticky rice with meatless chicken (highly recommend this one), vegetable dumplings & buns, & the fried prawn appetizer\n7) ", "we adored the tiny tea cups\n8) and the delicious jasmine tea to help digest all that not-that-heavy-but-still-kinda-heavy Chinese food\n9) ", "everything was about $11 per person (not including tip)\n10) "], "author": "Fancypants X.", "review": "In the spirit of FB--10 random things you didn't know about my dim sum experience at Jasmine Tea House:\n\n1) i love their colorful, neon lights that read \"Jasmine\"-- it makes me super excited for dim sum.\n2) our waiter was extremely friendly, like genuinely friendly & patient--he gets 10 stars!\n3) i brought three of my favorite ladies for lunch\n4) one of whom is a vegetarian (or rather pescatarian, i guess)\n5) we ordered chicken chow mein (which was outstanding) & vegetable soup \n6) and every dim sum item you can imagine: shrimp dumplings, chive dumplings, BBQ pork buns, shu mai, sticky rice with meatless chicken (highly recommend this one), vegetable dumplings & buns, & the fried prawn appetizer\n7) we adored the tiny tea cups\n8) and the delicious jasmine tea to help digest all that not-that-heavy-but-still-kinda-heavy Chinese food\n9) everything was about $11 per person (not including tip)\n10) my fortune read \"the current year will bring you much happiness.\" \n\nDo you feel you know me better now?", "rating": 4, "date": "2010-02-08"}], "combination plate": [{"excerpts": ["* DIM SUM COMBINATION PLATE ($9.50) - 3.5/5\n[3 each of shrimp dumpling, pork bun & siu mai]\nPretty standard as far as dim sum goes. ", "Shrimp dumpling and siu mai were a little greasier than average but otherwise normal. "], "author": "Jessie L.", "review": "TLDR - Not a bad option for delivery if you're looking for an easy fix for Chinese food/dim sum but quality is sacrificed for convenience\n\nI wasn't expecting much from the food here when I ordered delivery. Mainly picked this spot on GrubHub for the low $15 delivery minimum and $0 delivery fee. I was pleased the food actually travelled well with delivery (no soggy, cold food), but it took maybe 90 minutes from when I ordered for my food to be delivered.\n\nThe menu looked very Americanized, which held true when I got my delivery. As long as you're not expecting real Chinese food, you probably won't be disappointed.\n\n* DIM SUM COMBINATION PLATE ($9.50) - 3.5/5\n[3 each of shrimp dumpling, pork bun & siu mai]\nPretty standard as far as dim sum goes. Shrimp dumpling and siu mai were a little greasier than average but otherwise normal. The BBQ pork in the pork buns were overly artificially red in color and sweet, but the buns were soft and fluffy and balanced out the extra sweetness.\n\n* FRIED CHICKEN WINGS ($7.95) - 4.5/5\nDry fried, nicely salted. I was impressed that they managed to maintain most of their crispiness with delivery, but they could have been a little less greasy.", "rating": 4, "date": "2017-02-28"}, {"excerpts": ["Ordered the dim sum combination plate and onion pancake. \n\n", "Onion pancake - \nDidn't even get to take a picture of the pancake ", "bc I threw it out after the first bite. ", "It was dry, cardboard like with no real taste except for bitter oil. ", "Gross.. ", "so gross. ", "DONT GET ", "THIS SAVE ", "Dim sum combination plate -\nBbq pork buns were soggy and overly sweet. \n", "Shrimp dumplings - good. ", "Small but good. \n", "Siu mai - ", "the meat itself had a lot of flavor ", "but I wish the siu mai was fresh. ", "I have a feeling they keep their siu mai under a heated lamp for hours. ", "My siu mai was rubber like. ", "Dim sum combination plate -\nBbq pork buns were soggy and overly sweet. \n", "Shrimp dumplings - good. ", "Small but good. \n", "Siu mai - ", "the meat itself had a lot of flavor ", "but I wish the siu mai was fresh. ", "I have a feeling they keep their siu mai under a heated lamp for hours. ", "My siu mai was rubber like. "], "author": "AJ C.", "review": "It's a good thing I had a $7 delivery coupon. The food here is lacking in freshness. My food came cold and soggy. I'm disappointed but what do you expect with Chinese food deliveries... hit or miss. \n\nOrdered the dim sum combination plate and onion pancake. \n\nOnion pancake - \nDidn't even get to take a picture of the pancake bc I threw it out after the first bite. It was dry, cardboard like with no real taste except for bitter oil. Gross.. so gross. DONT GET THIS SAVE YOUR $6.\n\nDim sum combination plate -\nBbq pork buns were soggy and overly sweet. \nShrimp dumplings - good. Small but good. \nSiu mai - the meat itself had a lot of flavor but I wish the siu mai was fresh. I have a feeling they keep their siu mai under a heated lamp for hours. My siu mai was rubber like. Disappointing \n\n\nFirst and last time ordering food here. I don't think dining in will improve food quality either.", "rating": 2, "date": "2016-11-12"}, {"excerpts": ["Whenever I'm craving Dim Sum and not feeling up for a trip across town, Jasmine Tea House's Dim Sum Combination Plate is my go-to. ", "The Happy Buddha is also a great choice because of the variety of vegetables in the dish. ", "And I always order two entrees to get the free fried rice. ", "I really can't ask for better quality and quantity when it comes to take-out Chinese."], "author": "Iris L.", "review": "I am so glad Jasmine Tea House is open again. I was really panicking for a moment there!\n\nThere are not many decent Chinese food options in my immediate area and when I saw that it was closed I was so desperate that I nearly walked into Nulite. Fortunately, I will never have to do that. \n\nWhenever I'm craving Dim Sum and not feeling up for a trip across town, Jasmine Tea House's Dim Sum Combination Plate is my go-to. The Happy Buddha is also a great choice because of the variety of vegetables in the dish. And I always order two entrees to get the free fried rice. I really can't ask for better quality and quantity when it comes to take-out Chinese.", "rating": 4, "date": "2012-02-13"}, {"excerpts": ["We ordered the dim sum combination plate (shrimp dumplings, pork dumplings, and steamed bbq pork buns) as well as the chive dumplings and the steamed tofu roll. ", "Everything was completely unimpressive, but not terrible tasting as to make it hard to eat. ", "The first clue should have been that I was the only Asian customer in the entire place. "], "author": "Stephen C.", "review": "This review concerns the dim sum. We ordered the dim sum combination plate (shrimp dumplings, pork dumplings, and steamed bbq pork buns) as well as the chive dumplings and the steamed tofu roll. Everything was completely unimpressive, but not terrible tasting as to make it hard to eat. The first clue should have been that I was the only Asian customer in the entire place. But the food is passable for what we paid for it. \n\nWe also ordered the garlic eggplant lunch special to split between three of us. The waitress was nice enough to give us three soups instead of the single one that comes with it when she guessed we were going to be splitting it. The eggplant sauce itself was quite sweet, but otherwise cooked decently.", "rating": 2, "date": "2013-12-08"}, {"excerpts": ["We ordered the bak choy with black mushrooms and basil chicken, and their dimsum combination plate.  ", "The food was pretty good.  ", "The dimsum wasn't the BEST EVER kind of deal, but definitely up to par.  ", "(I'm Cantonese, I grew up eating dimsum in China, ", "Anyways, the basil chicken, really was basil chicken, it's really Americanized ", "( my friend ordered this, I would probably have never ordered it), but it tasted like what it says it is, BASIL and CHICKEN...lol the texture was good and the flavor was really basil-ish... wouldn't get that again..."], "author": "Zu W.", "review": "I usually don't like eating out for chinese food other than dimsum.  It's embarrassing because I can make it myself or eat at my mommy's.  But I've been too lazy to cook or drive all the way home, and definitely craving some chinese food, so I stopped by here for lunch today with my friend.\n\nStarting with the atmosphere.  The place was pretty open and wasn't too crowded.  There was a lot of in and outs for take out and what not. Atmosphere was nice, not too quiet but enough for me and my friend to have a chatty lunch without everybody in there hearing our convo.\n\nWe ordered the bak choy with black mushrooms and basil chicken, and their dimsum combination plate.  The food was pretty good.  The dimsum wasn't the BEST EVER kind of deal, but definitely up to par.  (I'm Cantonese, I grew up eating dimsum in China, so I would know =P).  \n\nAnyways, the basil chicken, really was basil chicken, it's really Americanized ( my friend ordered this, I would probably have never ordered it), but it tasted like what it says it is, BASIL and CHICKEN...lol the texture was good and the flavor was really basil-ish... wouldn't get that again...but it's not BAD...\n\nThe bak choy and black mushrooms was pretty good.  I wish they gave you more bak choy, I was really craving the vegetables, but then they weren't stingy with the mushrooms.  You can tell they used some oyster sauce for the mushrooms and it was really good.  It's a simple, common, easy to make dish, and it was well made. \n\nThe service is pretty good.  Fast and polite, and she was actually really nice.  I asked her for extra rice to go, we had left overs which i was going to bring to my boyfriend at work, and she gave me a whole to go box and she didn't charge me for it, or give me a dirty look which I feel like other places often do when you ask for stuff.  I was gonna give it 3 stars but because of that I'll give it an extra star! It's not about getting free stuff, it's about the fact that she quickly and nicely gave me what I wanted.\n\nAnyways, the only thing bad about the place is that when she first brought out the plate she didn't realize that one of them was still dirty...it had something crusty on it, eww.  But we told her and she apologized and quickly gave us a clean and new one.  \n\nI think I'm being so nice about this because they were truly really nice and were service oriented, and places like that I can definitely be more forgiving about stuff.  4 stars overall and I'd definitely go back again.", "rating": 4, "date": "2009-09-12"}, {"excerpts": ["I just polished off the leftovers from what I ordered last night: combination plate (rangoon, egg rolls, wontons, chicken wings, those potato-chippy things), vegetable fried rice (big chunks of veggies like broccoli, carrots and squash in it!) and walnut prawns.  ", "It hit the spot, both last night and today.  ", "Finally, a place that delivers to my 'hood that has decent grub!"], "author": "Bodacious T.", "review": "I'm the kind of gal who likes pu pu platters and appetizers and not the really spicy stuff.  I love a place with a nice combo plate.  I just polished off the leftovers from what I ordered last night: combination plate (rangoon, egg rolls, wontons, chicken wings, those potato-chippy things), vegetable fried rice (big chunks of veggies like broccoli, carrots and squash in it!) and walnut prawns.  It hit the spot, both last night and today.  Finally, a place that delivers to my 'hood that has decent grub!", "rating": 4, "date": "2005-07-18"}], "vegetable pot sticker": [], "hot  sour soup": [], "sizzling rice soup": [{"excerpts": ["We started out with the Sizzling Rice Soup.  ", "The broth was clear and filled with seafood and vegetables.  ", "The rice was toasted just right and added a just the right touch of flavor.  "], "author": "Stephanie G.", "review": "Why this place only has 3.5 stars is a mystery to me.  My husband and I stumbled upon this gem while we were trolling the Mission for some place new.   The decor is subtle, but then it does not have to be over the top when the food speaks for it's self.   \n\nWe started out with the Sizzling Rice Soup.  The broth was clear and filled with seafood and vegetables.  The rice was toasted just right and added a just the right touch of flavor.  We also ordered the Asparagus in Black bean, the  Tea Smoked Duck and the Pork in Garlic Sauce. \n\n The asparagus was thick and tender.  The sauce just slightly over salty, but went well with the sweet asparagus.  The Tea Smoked Duck was perfect.  Not very fatty, good amount of meat, crispy skin and a wonderful duck sauce.  \n\nThe Pork in Garlic Sauce was the Star, it was the perfect blend of garlic and spice.   This is my \"go to\" dish, the one I gauge a restaurant by.   I have got to tell you, I was never so happy with a plate of garlic pork than I was with this one.  \n\nA true Mission Treasure.", "rating": 5, "date": "2013-04-28"}, {"excerpts": ["I've tried the sizzling rice soup which was so delicious. ", "The orange chicken is really good too. ", "The broccoli beef was tasty and the kung pao chicken was great as well. ", "I recommend this place for anyoneo looking for an affordable place to eat delicious Chinese food. "], "author": "Priscilla A.", "review": "So I love coming here for the lunch special menu. It is affordable and has delicious options. I've tried the sizzling rice soup which was so delicious. The orange chicken is really good too. The broccoli beef was tasty and the kung pao chicken was great as well. I recommend this place for anyoneo looking for an affordable place to eat delicious Chinese food. The portion size is large which is great for sharing.  \n\nBottom line: tasty and affordable Chinese food!", "rating": 5, "date": "2014-04-06"}, {"excerpts": ["but i LOVE the sizzling rice soup -- "], "author": "isa i.", "review": "wow. i had such a horrible communication with them. they cancelled my order because of delivery issues and didn't let me know. I was very pissed about it. \n\nthe restaurant owner, Robert, called and talked with me multiple times over the course of an hour and it became clear to me that he was committed to trying to find a winning solution for us both even though i was being bitchy. \n\ni appreciate his efforts to really work things out and if this were a customer service review, ultimately, i'd have to give it 5 stars. :) \n\nas for the food, some is kind of greasy and eh. \n\nbut i LOVE the sizzling rice soup -- best i've ever had and some of the best soup i've had in SF especially if you're looking for high protein and low carbs and feeling full afterward. \n\ni also have a give a positive review for the pork buns and sesame balls, though admittedly, the latter is a bit greasy (but aren't they supposed to be??!?!?). :)", "rating": 3, "date": "2012-10-18"}, {"excerpts": ["Sizzling Rice Soup, General Tsao's Chicken, Walnut Prawns\n\nPass on the Steamed BBQ Pork Buns."], "author": "Justin P.", "review": "The Place: Small, Clean, Casual\nThe Service: Friendly, Inviting \nThe Food: Great Variety, Flavorful\n\nMust Haves: Sizzling Rice Soup, General Tsao's Chicken, Walnut Prawns\n\nPass on the Steamed BBQ Pork Buns.", "rating": 4, "date": "2010-01-14"}, {"excerpts": ["This past Friday I ordered the Sizzling Rice soup and crab puffs, omfg! ", "SOOO full and happy, let me tell you! ", "It's always a delight to come in here as well because the staff is warm and friendly, and since homeboy grew up in the area and gives them plenty of business they sure do welcome him LOL. ", "Gotta introduce more of my Bay Areans to this amazing establishment."], "author": "Nancy R.", "review": "Love, love, LOVE this place! So my favorite city boy ever has taken me here throughout the last 5years and I have yet to yelp it, oops? We've eaten here and ordered takeout many times over and every time it's on POINT. It's definitely a bit pricier than most because other than lunch they don't offer any kind of dinner specials and it's all single entrees. This past Friday I ordered the Sizzling Rice soup and crab puffs, omfg! SOOO full and happy, let me tell you! It's always a delight to come in here as well because the staff is warm and friendly, and since homeboy grew up in the area and gives them plenty of business they sure do welcome him LOL. Gotta introduce more of my Bay Areans to this amazing establishment.", "rating": 5, "date": "2010-01-04"}, {"excerpts": ["The sizzling rice soup is very flavorful.  ", "I really love the dim sum here and the shanghai dumplings are great.   ", "I always feel like I get great service here ", "and since I come here often, I am familiarly greeted which is nice.  ", "A big thumbs up here!"], "author": "Candice M.", "review": "I absolutely love this place.  Its subtle exterior definitely does not do it justice.  One might easily pass by on Mission Street and never notice what lies behind the doors.  Inside, you will find an ambiance that is simple and understated.  Its the food and the service that I really can't say enough about here.  The great thing is that dim sum is available throughout the day, you can even have it at night.  The chow fun is very tasty.  The sizzling rice soup is very flavorful.  I really love the dim sum here and the shanghai dumplings are great.   I always feel like I get great service here and since I come here often, I am familiarly greeted which is nice.  A big thumbs up here!", "rating": 5, "date": "2007-05-31"}], "fish ball seaweed soup": [], "seafood soup": [{"excerpts": ["E.g I ordered a cup of seafood soup (less than 5 bucks). ", "In that soup they give me whole prawn, scallops and squid. ", "Love this place!!"], "author": "Helen C.", "review": "This is my default chinese resto if I'm craving soup and dim sum. Not only is the price great for its location, they don't hold back on giving you content. E.g I ordered a cup of seafood soup (less than 5 bucks). In that soup they give me whole prawn, scallops and squid. Love this place!!", "rating": 4, "date": "2015-08-23"}], "combination won ton soup": [{"excerpts": ["The best combination Won Ton soup anywhere.\nPerfect broth.", "Generous portions of shrimp beef chicken pork and vegetables.", "Im full after eating the toppings and take most of won tons home for another meal.\n", "I ordered it delivery once ", "but it wasnt as good ", "because in the restaurant its served piping hot."], "author": "Ken K.", "review": "The best combination Won Ton soup anywhere.\nPerfect broth.Generous portions of shrimp beef chicken pork and vegetables.Im full after eating the toppings and take most of won tons home for another meal.\nI ordered it delivery once but it wasnt as good because in the restaurant its served piping hot.", "rating": 5, "date": "2018-01-24"}, {"excerpts": ["My boyfriend is obsessed with the combination won ton soup and recommends getting a large."], "author": "Gabi R.", "review": "This is my go-to Chinese restaurant and has been for many years. I have turned A LOT of people on to this place and they have also become loyal to jasmine tea house. I love their vegetarian food but overall there is a bit of inconsistency. I would say though, that the majority of the food is great and I haven't had a problem with food when dining in.\n\nTheir dim sum is good.\nMeatless chicken is a must try and my favorite (general tsao)\nMy boyfriend is obsessed with the combination won ton soup and recommends getting a large.", "rating": 4, "date": "2013-07-06"}, {"excerpts": ["The combination won ton soup!"], "author": "Veronica G.", "review": "Great place to eat at or have delivered. The combination won ton soup!", "rating": 4, "date": "2011-07-21"}, {"excerpts": ["The shrimp dumpings and combination won ton soup.  ", "Perfect amount of food!  "], "author": "blythewood m.", "review": "The shrimp dumpings and combination won ton soup.  Perfect amount of food!  I ate this about four days in a row (i get obsessive about things sometimes . . . )\n\nDelivery takes forever though, so if you can, just go pick it up.", "rating": 4, "date": "2008-04-01"}], "chicken corn soup": [{"excerpts": ["Chicken corn soup was pretty good. "], "author": "Emily C.", "review": "So my friend has this habit of ordering in Chinese food? And both places in the past has made her deathly ill or just plain grossed out. \n\nJasmine Tea House .. didn't. Yay!\n\nChicken corn soup was pretty good. Then again, I like anything with egg drop.\n\nI had the chow mein and beef. While their food claims to lack MSG, there was something in the beef that makes it kinda ... funky. No complaints. I'd say the food is pretty good. I'm just picky b/c the best Chinese food comes from my mommy!", "rating": 4, "date": "2008-07-10"}, {"excerpts": ["I got the chicken corn soup which I was craving ", "and it was gooood!  ", "The rest of the food was okay nothing spectacular.  ", "Good fast chinese food delivery."], "author": "Rosh C.", "review": "The delivery service is super fast and the prices are very reasonable.  I got the chicken corn soup which I was craving and it was gooood!  The rest of the food was okay nothing spectacular.  Good fast chinese food delivery.", "rating": 3, "date": "2010-12-04"}], "vegetarian soup": [], "vegetable salad": [{"excerpts": ["I recommend the combination won-ton soup and the vegetable salad (sans tomato). \n\n"], "author": "Roxanne B.", "review": "This is clean restaurant and the service is fast and friendly.  \n\nI recommend the combination won-ton soup and the vegetable salad (sans tomato). \n\nI want to come back and try a different entree because the Mongolian Beef wasn't that good (maybe I am just sick of Mongolian Beef now?).  However, everything else I had, including the tea, was great!", "rating": 4, "date": "2009-09-09"}], "mango prawn salad": [{"excerpts": ["Oh that mango prawn salad. ", "Not what you would expect at a chinese place, but oh so good. ", "The soups are generally quite good. "], "author": "Mindy L.", "review": "Not bad at all. I've been going here on and off for a few year. (Grew up in the neighborhood) There are a bunch of things on the menu that I really like, but it's hit and miss. The oolong duck was awful. The taste of the tea did nothing for the duck. On the contrary it took all the juice and sweetness out of the meat. \n\nThe highlights however! Oh that mango prawn salad. Not what you would expect at a chinese place, but oh so good. The soups are generally quite good. Their peking duck is wonderful!! \n\nOn the whole, there are other places I'd prefer (see my last review), but if you know what to order you'll leave quite satisfied.", "rating": 3, "date": "2008-10-19"}], "sesame cold noodle salad": [], "beef with black mushroom": [], "szechuan beef": [{"excerpts": ["4/5 Szechuan Beef - Great flavor, mildly spicy, all you can expect from a spicy beef dish. \n\n"], "author": "Ivy Z.", "review": "Ordered delivery last night so this review is fresh:\n\n4/5 for Delivery - They delivered my food on time.  Food was still pretty hot, my walnut prawns were still crunchy.  The delivery guy apologized and said he forgot the rice but as I unpacked my food, I did find a small box of rice.\n\n3/5 Walnut Prawns - The prawns were heavily battered.  Authentic walnut prawns have a very light batter so that's what I expected.  Because of the thick batter, the prawns were a little greasier than I usually like them.  I suspect they use a thick batter to keep the prawns more crispy.  Other than that, they tasted good, just not what I was craving for.\n\n4/5 Szechuan Beef - Great flavor, mildly spicy, all you can expect from a spicy beef dish. \n\n2/5 Mapo Tofu - Spicy level and consistency of the sauce was good but it lacked any real flavor.\n\n3/5 BBQ Pork Bun - My kids usually gobble up BBQ pork buns without hesitation but they did not like the BBQ pork filling at all.  The steamed bread of the bun was edible but nothing special.  \n\nI would order from them again for delivery but would stick to hard-to-mess-up dishes like stir fry dishes.", "rating": 3, "date": "2015-01-20"}, {"excerpts": ["General Tsao's Chicken, Szechuan Beef, and House Spicy Chow Fun, and every single dish was borderline disgusting.  ", "It also made me physically ill.  ", "The noodles were okay, I guess, if congealed and dripping with oil.  ", "But the General Tsao's and Szechuan Beef were virtually identical as far as I could tell -- deep fried to all hell, soaked in a vat of corn starch, syrup, and MSG, and then sprinkled with two slightly different flavor dusts.  ", "They were virtually inedible.  "], "author": "Bill S.", "review": "I am completely awestruck by the positive reviews for this place.  I ordered (take-out) General Tsao's Chicken, Szechuan Beef, and House Spicy Chow Fun, and every single dish was borderline disgusting.  It also made me physically ill.  The noodles were okay, I guess, if congealed and dripping with oil.  But the General Tsao's and Szechuan Beef were virtually identical as far as I could tell -- deep fried to all hell, soaked in a vat of corn starch, syrup, and MSG, and then sprinkled with two slightly different flavor dusts.  They were virtually inedible.  I threw it all out.  \n\nI mean, I realize we're in the Mission and there's no actual Chinese food here, but this was just gross -- like a good 117 steps below Panda Express.  How anyone could give this place four or five stars is totally beyond me -- have y'all been suffering lifetime imprisonment in leg irons with nothing to eat but stale gruel?", "rating": 1, "date": "2009-07-10"}, {"excerpts": ["My coworker has the szechuan beef which she loved.  ", "The portion sizes are great, we had a lot left over.  ", "We ended with some green tea and vanilla ice cream ...", "The service was nice, friendly, and quick.  "], "author": "Dee A.", "review": "My coworker and I were on business here from NY.  I wanted some chinese that was not TOO TRADITIONAL (if you know what i'm saying--no chicken feet..none of that)  So after reading many yelping reviews I decided to venture out on a bus from mission and 5th.  As my coworker and I rode across mission we noticed how drastic the neighborhood changed.  It wasnt anything scary to us, it was just a bit eclectic, retro cheezy with thrift stores and pawn shops all over the place..but anyway this didnt really phase me.\n\nI was pleased with the Jasmine Tea House.  We began with vegetarian spring rolls that were super yummy.  I had the chicken and corn soup which was super delicious and my coworker has a nice wonton soup in which she pleased to find chicken, beef, and shrimp in it (not your typical wonton soup)\n\nFor out entrees I had the mongolian beef which was super yummy!!!!!  There was a little red pepper next to the description on the menu but it wasnt hot at all =/ but it was still great.  The beef was so tender, juicy and lean.  My coworker has the szechuan beef which she loved.  The portion sizes are great, we had a lot left over.  We ended with some green tea and vanilla ice cream ...The service was nice, friendly, and quick.  Decor is cute...bathroom could use a little updating.\n\nThis was exactly the chinese I wanted.  I left very happy :)", "rating": 4, "date": "2008-02-18"}, {"excerpts": ["maybe i ordered the wrong things that day , general tsao chicken szechuan beef , ", "both deepfried wish i knew that couldnt taste the quality of the meat at all. "], "author": "NAEL K.", "review": "very fast delivery , food is pretty decent  maybe i ordered the wrong things that day , general tsao chicken szechuan beef , both deepfried wish i knew that couldnt taste the quality of the meat at all. free chow mein with delivery i take that , they were actually good , dim sum were nice and warm but not much in , 3 stars for a quick delivery but i dont know about bill clinton", "rating": 3, "date": "2010-05-19"}], "sesame beef": [{"excerpts": ["My sweetie ordered the sesame beef which he seemed to enjoy (I don't eat meat, but he does & he devoured his dish!). ", "The serving of his plate was very generous, as was mine. ", "I ordered the mango shrimp which was devine! ", "Both the shrimp and mangoes were perfectly cooked. ", "The sauce did not take over the natural flavors and the brown rice I ordered complimented the dish well. ", "In summary, service was outstanding, Americanized-style Chinese food was amazing and the price was totally worth it. ", "We even had leftovers which made it even more worth it! ", "I have been coming here for years and the above experience explains why. ", "I gave them four stars ", "ONLY because the food is not \"authentic,\" Chinese, but going in knowing they are catering to Americans, I think it's pretty great!"], "author": "Jasmine A.", "review": "Upon arrival my boyfriend & I were graciously greeted & seated side by side. I actually preferred that to across the table, which was a bit far and was glad the host had the foresight to seat us that way. It was evening and the lighting was dim, not dark, but perfect for evening dining.\nOur order was taken & we opted for the veggie egg rolls to start. They were delish! My sweetie ordered the sesame beef which he seemed to enjoy (I don't eat meat, but he does & he devoured his dish!). The serving of his plate was very generous, as was mine. I ordered the mango shrimp which was devine! Both the shrimp and mangoes were perfectly cooked. The sauce did not take over the natural flavors and the brown rice I ordered complimented the dish well. In summary, service was outstanding, Americanized-style Chinese food was amazing and the price was totally worth it. We even had leftovers which made it even more worth it! I have been coming here for years and the above experience explains why. I gave them four stars ONLY because the food is not \"authentic,\" Chinese, but going in knowing they are catering to Americans, I think it's pretty great!", "rating": 4, "date": "2014-04-05"}, {"excerpts": ["I even discovered a new dish that I just love: Sesame beef (substitute vegetarian chicken and its veggie-friendly). \n\n"], "author": "Erin M.", "review": "My boyfriend and I go through phases when it comes to good restaurants. We just can't stay away. We decide to go out for dinner, and somehow, we always end up back in the same spot we were the week before.\n\nWe had our phase with Jasmine Tea house about 6 months ago. I love their Seafood Chow Fun, their Happy Buddha, and I'm especially fond of any Chinese restaurant that serves tasty dim sum as an appetizer. We brought friends, and it was even Chinese-Friend-Lynn-Approved (CFLA). \n\nAnyway, long story short- Our Jasmine Tea house phase came to a close, and we moved on to Murasaki across the city. Today we decided to stop back in, on a whim... And it was just how I remembered it. Excellent food, excellent service, excellent price. I even discovered a new dish that I just love: Sesame beef (substitute vegetarian chicken and its veggie-friendly). \n\nOne last positive note on Jasmine Tea house: They are always so kind. One time I was taking my boyfriend on a surprise picnic with Jasmine food, and they packed to-go tea at my request. Today, in my clumsiness, I knocked over a glass of water, spilling everywhere. Instead of acting annoyed, the waitress fervently sopped up the mess and even refilled my glass!!!\n\nIn conclusion... Although our Jasmine Tea House fixation has come to a close, it will always have a place in my heart....", "rating": 5, "date": "2007-10-07"}, {"excerpts": ["Sesame Beef was crispy and savory, not greasy. ", "Spicy eggplant chicken was nice, not over-sauced, but with flavorful eggplant and crisp stir fried zucchini and veggies. "], "author": "Jon L.", "review": "I ordered from Jasmine as a backup because the place I was going to order from China Wok on Monterey Blvd (who has good food) exhibited poor service this last time. Wok's hours say til 1AM on their website, but they called and said they close at 10PM (it was 9:30PM when I placed online order, and 9:50 when the place called to tell me they couldn't deliver my order because the kitchen was closed). So on to Jasmine I found thru a Yelp review when searching for late Chinese delivery to  Bernal. \n\nWell, when I called to order it was 9:55pm and asked if they would still deliver. The guy asked where I lived, and he cheerfully said \"yes\" they would deliver and it would be the driver's last stop. He only asked that I tip the driver in cash (I was paying by card) since the driver would be going home after our stop. Fair enough. \n\nThe food that came was HOT, and fresh. Sesame Beef was crispy and savory, not greasy. Spicy eggplant chicken was nice, not over-sauced, but with flavorful eggplant and crisp stir fried zucchini and veggies. The free bbq pork chow mein (free rice or chow mein with 2 entree orders) was good aldente  with nice portion of bbq pork. Hot and sour soup was hearty but slightly under seasoned; I'd prefer some with a peppery kick. \n\nJasmine was certainly better and fresher tasting than some of the other mediocre places in the Bernal area. (Not a fan of Hunan Chef, they have live finches in cages in the dining room....seems a little against any health code).\n\nThey score on the customer service side, not declining business because it's 5 minutes before closing.", "rating": 4, "date": "2009-12-20"}, {"excerpts": ["Great Sesame Beef, good app combo plate. ", "Love the freebie w/ 2 entrees. ", "Will definately keep ordering. ", "Have passed the name on to others.\r\n", "Just tried the Ooling Duck, soooo good! ", "The dim sum app combo is also very good."], "author": "C B.", "review": "YUM. After reading reviews, I ordered form here. I do love Eric's, didn't think this was better, but very good for delivery. Best so far. Great Sesame Beef, good app combo plate. Love the freebie w/ 2 entrees. Will definately keep ordering. Have passed the name on to others.\r\nJust tried the Ooling Duck, soooo good! The dim sum app combo is also very good.", "rating": 4, "date": "2006-01-22"}, {"excerpts": ["Sesame Beef was way over-sauced. ", "The pieces of beef were swimming in the sauce. ", "The chicken and green beans dish was bland. "], "author": "Reza E.", "review": "We have been living in Mission/Noe area for almost 3 years now and still looking for good Chinese food. When I saw all the reviews here I decided to try it. Frankly I'm not sure what the fuss is all about. Maybe this place is popular because of the vegetarian choices. I'm not a vegetarian.\n\nSesame Beef was way over-sauced. The pieces of beef were swimming in the sauce. The chicken and green beans dish was bland. The vegetable chow mein was totally without flavor. It seemed like it was missing salt or something.\n\nI am going to try this place again because I believe that you have to give a restaurant at least two tries before you make a judgment. After my second try, I will come back and either adjust my rating or leave it as is.\n\nThe search for decent Chinese food in Mission/Noe continues.", "rating": 2, "date": "2007-12-10"}, {"excerpts": ["Erin had sesame beef she says \"it was really tasty - not too fatty and slightly sweet and crispy.", "\""], "author": "Julie C.", "review": "Some of the BEST Chinese food I have had in a long time.  I am gluten free and it is sometimes difficult to eat chinese.  I was able to order anything off the menu and they were able to accommodate me!  I had the garlic chicken and the veggie fried rice.  Just amazing!!  Erin had sesame beef she says \"it was really tasty - not too fatty and slightly sweet and crispy.\"", "rating": 5, "date": "2010-08-15"}, {"excerpts": ["(could be: sesame chicken, veggie potstickers, sesame beef, mu-shu pork, kung pao meatless chicken (both your vegetarian and carnivorous friends will flip for it)), and I need it now!\"  ", "I have no idea what we're going to do when we move away.  ", "I don't even like to think about it."], "author": "sunny d.", "review": "Huh, I can't believe I haven't reviewed Jasmine yet.  It took a bit of menu exploration before I fell in love, but now we're inseparable.  Once every couple weeks, I turn to the Mister and say \"I need that __________ (could be: sesame chicken, veggie potstickers, sesame beef, mu-shu pork, kung pao meatless chicken (both your vegetarian and carnivorous friends will flip for it)), and I need it now!\"  I have no idea what we're going to do when we move away.  I don't even like to think about it.", "rating": 4, "date": "2006-08-09"}, {"excerpts": ["Their Sesame Beef is the solution.  ", "Wonderful soups. ", "The large selection of food is consistently good and the atmosphere is nice for both lunch and dinner. "], "author": "F N.", "review": "Want to be hooked on crack but not lose all your friends? Their Sesame Beef is the solution.  Wonderful soups. The large selection of food is consistently good and the atmosphere is nice for both lunch and dinner. They also serve a small selection of dim-sum (though I wouldn't go just for that).  \n\n1 star deducted because their take-out  takes forever and arrives soggy and not so delicious.", "rating": 4, "date": "2008-07-06"}], "beef with pickled green": [], "pork siu mai": [{"excerpts": ["I noticed the dim sum combo meal, which includes pork siu mai, shrimp dumplings, and pork buns. \n\n", "The pork siu mai was tender, flavorful, and the outer wrapper was moist, not hard or dry like the ones that sit out for too long under a heat lamp. ", "The shrimp dumplings were juicy and popping. ", "The pork buns were really good. ", "Soft and doughy with sweet bbq pork filled inside. ", "All this for $9.50 too. "], "author": "Ann S.", "review": "Dim sum is a collection of small bites that can either be consumed as a snack or created into a full course meal. \n\nLooking at the menu, I knew I wanted just a small taste of what they had to offer. I noticed the dim sum combo meal, which includes pork siu mai, shrimp dumplings, and pork buns. \n\nSounds good enough. So I placed my order and had a seat in the dining area. \n\nFood took about 10-15 minutes to arrive because it was made fresh to order; came out piping hot. The pork siu mai was tender, flavorful, and the outer wrapper was moist, not hard or dry like the ones that sit out for too long under a heat lamp. The shrimp dumplings were juicy and popping. The pork buns were really good. Soft and doughy with sweet bbq pork filled inside. All this for $9.50 too. Great deal\n\nThe restaurant looks really run down from the outside, but the inside is clean enough, just really old looking. No frills, but service was really friendly and accommodating. \n\n$10 minimum when using credit or debit, otherwise, ca$h only. \n\nDon't forget to grab your complimentary fortune cookie at the counter!", "rating": 4, "date": "2018-01-28"}, {"excerpts": ["pork siu mai - super tasty, one of the best in town\n3. "], "author": "Kristen S.", "review": "Delivery arrived only 5 minutes late, which was quite good, everything considered.\n\nRecommend:\n1. combination wonton soup\n2. pork siu mai - super tasty, one of the best in town\n3. lunch plates (available even on weekends)\n\nAvoid:\n1. happy buddha - the meatless chicken is weird and tasteless\n2. Shanghai chicken - there's virtually no veggie in this dish, and the chicken is diced into super small pieces.  Plus, I had requested super spicy but it was not spicy AT ALL.  Not even a hint of peppers.\n\nPlus:\nThe guy on the phone speaks very decent English.\n\nOverall:\nStick to the pork stuff - siu mai, wontons, etc.  They seem to do that well.", "rating": 3, "date": "2012-11-03"}, {"excerpts": ["The dim sum is also pretty awesome, though, again, food quality concerns (gristly pork siu mai.. ", "This applies for the dim sum, as well - the pork siu mai and shanghai baby bun were, too, some of the best I've had in the city. ", "In general, I am very happy with how well the food is prepared, here. ", "It was worth getting on here to write a review for them. ", "Will frequent farrrr more often."], "author": "Cory H.", "review": "Ok. So I've frequented this place, plenty, over the past year (or maybe even 2?), and for shame, I only now write a review (UPDATE: Inaccurate ~ forgot I posted a review, before; see below..). My hope is that this message is read and received, with a mind for progress with this establishment..\n\nThey've gone from an absolutely spectacular little restaurant to order from to the subpar stature of most every other Chinese food place in the Mission area ~ one often blames popularity for this shift (and this place has definitely grown in popularity).. I would just hope that they haven't grown comfortable not trying as hard. As I continue this review, accept my apologies if I seem to wax nostalgic.\n\nA year+ ago, the food was *amazing*. I'd think I were being hyperbolic, but I distinctly recall coming away with the same impression about their food, each time, before. My measuring of Chinese food establishments tends to rest on a small set of 'staples' that I use to compare different establishments: the chow mein, the general tso's chicken, and their pot stickers. Price Matters, and is considered heavily (not specifically for being *cheap*, which is important, but if Free is the best spice on steroids, spendy Chinese better be Very freakin flavorful..).\n\nI write this review, and it pains me(kindanotreally), because where a year ago this place was absolute Top marks ~ not Only for price, which was just fantastically cheap (assuming because they were very new), but for Flavor & Quality. The pot stickers, here, at a time, were long and aways the best in the Mission. Period. AND amongst the cheapest. Now I feel a bit ripped off. They've gone up ~$2 per order, since.. their quality has gone down significantly (biting into hard chunks of gristle is Gross ~ this has happened at least a few times more recently), and the flavor's just not there, anymore, beyond those respects/concerns. \n\nWhen the pot stickers go, the rest follow ~ the other dishes have gone up in price, down in quality. The chow mein (once also really good) is just oilier and less flavorful. I still like the General Tso's chicken. Also, their combo Won Ton soup was a steal and a blessing lol, and I still love to order that to this day. The dim sum is also pretty awesome, though, again, food quality concerns (gristly pork siu mai.. ew)..\n\nAppreciate that this review is less a damning of the establishment and more the noted frustrations of a once-immensely pleased patron. It took a long enough time to find a place in the area that delivered really good Chinese food, and this was IT, once. I write this with the realization that this establishment has since come to risk attaining a similar mediocrity (at inflated price points)  that the rest of the Mission seems dead set upon resting on. And it's sad, really. Just not something I want to see..\n\n\n===== Original Review:\n\nI really have to say that I am impressed with the food that comes out of this place. I have ordered food here a few times, and they've been consistently delicious. For one, their potstickers are better than most everyone else's in town, period. Most anywhere I go, I order the potstickers (a. because iLoves them and b. its a good 'quality test' for a Chinese cuisine establishment), and consistently, Jasmine Tea House outclasses the rest for flavor and texture and just overall preparedness. \n\nThis applies for the dim sum, as well - the pork siu mai and shanghai baby bun were, too, some of the best I've had in the city. In general, I am very happy with how well the food is prepared, here. It was worth getting on here to write a review for them. Will frequent farrrr more often.", "rating": 3, "date": "2014-11-14"}, {"excerpts": ["Shrimp Dumplings\nPork Siu Mai\nVegetable Dumplings (Meatless chicken and spinach I believe)\nStuffed Eggplant (aaaamazing)\n"], "author": "H.S. G.", "review": "DIM SUM MECCA.\n\nFor about two years, off and on, we have sought the perfect combination for Dim Sum. This being:\n1) Not over-priced (Yank Sing I'm talkin to you)\n2) No questionable ingredients (what meat is this again/is this gray matter meat?)\n3) No 45 minute wait for a table (Eh hem Hong Kong Lounge)\n\nThis quest has taken us to some very expensive and to some very sketchy, \"wow, there are pigeon feathers all over the floor\" type establishments.  I think we have struck gold at Jasmine Tea House. \n\nThe Dim Sum here was all super fresh made with quality ingredients (my god, that really is shrimp in there!) and shockingly/sadly we were the only patrons in the restaurant - maybe because it was the 4th of July. \n\nWhat we had that was awesome:\nShrimp Dumplings\nPork Siu Mai\nVegetable Dumplings (Meatless chicken and spinach I believe)\nStuffed Eggplant (aaaamazing)\nSesame Ball\n\nSweet Rice (just okay)\n\nThe only thing they're missing from the menu is shanghai soup dumplings. We will be back!", "rating": 5, "date": "2012-07-06"}, {"excerpts": ["I ordered Dim Sum (pork siu mai and hai gow plus HK panned fried noodles)  ", "The Dim Sum, especially the Pork Siu Mai was excellent.  ", "Meat was tasty, lean, and( no gristle that sometimes lesser quality places ", "make you discover).  ", "What was great about the pan fried noodles was ", "the meat/vegetables/sauce was stored in separate container from the crispy noodles. ", "No soggy chowmein but delicious crispy noodles.  ", "I ordered it with Chinese Brocoli and they had it!!  ", "They did not skimp on the beef.  ", "Plenty of meat unlike other places.  ", "And because they delivered on time the sauce was piping hot!  ", "Translation excellent quality, fast delivery.  ", "I was so impressed by their lunch delivery I plan on ordering dinner tonight.  ", "This time I will pick up but I am sure it will be good. ", "Yelpers if you like good quality dim sum ", "this is a good place. ", "Now not everything I ordered from this place was good.  ", "I ordered the fried appetizer combo (shrimp chips, pot stickers, egg rolls) ", "That was not so good ", "but that was more my fault for selecting a more \"American Style\" Chinese dish.  ", "And yea ", "I am Asian too ", "so go figure."], "author": "Dwight S.", "review": "Yes, I was hungry and lazy.  Eat 24 says this place was good. Yelp says this place was good. I ordered Dim Sum (pork siu mai and hai gow plus HK panned fried noodles)  The Dim Sum, especially the Pork Siu Mai was excellent.  Meat was tasty, lean, and( no gristle that sometimes lesser quality places make you discover).  What was great about the pan fried noodles was the meat/vegetables/sauce was stored in separate container from the crispy noodles. No soggy chowmein but delicious crispy noodles.  I ordered it with Chinese Brocoli and they had it!!  They did not skimp on the beef.  Plenty of meat unlike other places.  And because they delivered on time the sauce was piping hot!  Translation excellent quality, fast delivery.  I was so impressed by their lunch delivery I plan on ordering dinner tonight.  This time I will pick up but I am sure it will be good. Yelpers if you like good quality dim sum this is a good place. Now not everything I ordered from this place was good.  I ordered the fried appetizer combo (shrimp chips, pot stickers, egg rolls) That was not so good but that was more my fault for selecting a more \"American Style\" Chinese dish.  And yea I am Asian too so go figure.", "rating": 5, "date": "2016-06-16"}, {"excerpts": ["I love and have never been disappointed by:\nPork Siu Mai\n", "Pork Pot Stickers\n", "Deep Fried Oysters\nSzechwan Beef\n", "ANY fried rice\n", "I have had a few of the Eggplant dishes and loved them.   ", "Forget which though.   "], "author": "Jack C.", "review": "My vegetarian friends LOVE the Meatless Chicken dish.   I think it is called the Happy Buddha.\n\nI love and have never been disappointed by:\nPork Siu Mai\nPork Pot Stickers\nDeep Fried Oysters\nSzechwan Beef\nANY fried rice\nI have had a few of the Eggplant dishes and loved them.   Forget which though.   :)\n\nThe only thing I have been disappointed with has been the Seafood Chow Fun.   It is very tasty and has some great seafood in it but is very soupy.\n\nFree delivery is available for lunch and dinner within the delivery area. Order 2 entrees and get free fried rice or chow mein (a choice of pork, chicken, beef or vegetable). $10 Minimum for credit card orders.\n\nSay Hi to Frank for me!", "rating": 5, "date": "2009-03-03"}], "vegetable dumpling": [{"excerpts": ["I ordered Steamed Tofu Roll (3), Vegetable Dumpling (3), Chive Dumpling (3) and liked them in that order.  ", "The name Steamed Tofu Roll isn't very descriptive for those of you who are new to dim sum; they are in fact steamed fried tofu skin wrapped around julienne veggies. ", "The normal version often comes with dice pork and shrimp and Jasmine Tea House does a fine vegetarian version.  ", "The Vegetable Dumplings and Chive Dumplings are pretty good as well although the dumpling skin is a little on the thick side. ", "In order for me to be full at say Yank Sing, I would probably need 4 plates of dim sums all to myself.  ", "The dumplings/servings at the Jasmine Tea House are huge.  ", "I basically ate half and pack the rest home.  ", "At $2.95 each, the price is right.  ", "Also love the fact that they don't break/close in the afternoon unlike most Chinese restaurants."], "author": "Tiffany L.", "review": "3.5 stars for the vegetarian dim sum.  \n\nAs a vegetarian, I almost have to swear off dim sum since most of these Chinese small plates have pork or seafood in them.  We stopped by here Jasmin Tea house one Saturday afternoon and stumbled across the \"large\" vegetarian dim sum selection. I ordered Steamed Tofu Roll (3), Vegetable Dumpling (3), Chive Dumpling (3) and liked them in that order.  The name Steamed Tofu Roll isn't very descriptive for those of you who are new to dim sum; they are in fact steamed fried tofu skin wrapped around julienne veggies. The normal version often comes with dice pork and shrimp and Jasmine Tea House does a fine vegetarian version.  The Vegetable Dumplings and Chive Dumplings are pretty good as well although the dumpling skin is a little on the thick side. In order for me to be full at say Yank Sing, I would probably need 4 plates of dim sums all to myself.  The dumplings/servings at the Jasmine Tea House are huge.  I basically ate half and pack the rest home.  At $2.95 each, the price is right.  Also love the fact that they don't break/close in the afternoon unlike most Chinese restaurants.", "rating": 4, "date": "2010-01-31"}], "steamed bbq pork bun": [], "shanghai baby bun": [{"excerpts": ["This applies for the dim sum, as well - the pork siu mai and shanghai baby bun were, too, some of the best I've had in the city. ", "In general, I am very happy with how well the food is prepared, here. ", "It was worth getting on here to write a review for them. ", "Will frequent farrrr more often."], "author": "Cory H.", "review": "Ok. So I've frequented this place, plenty, over the past year (or maybe even 2?), and for shame, I only now write a review (UPDATE: Inaccurate ~ forgot I posted a review, before; see below..). My hope is that this message is read and received, with a mind for progress with this establishment..\n\nThey've gone from an absolutely spectacular little restaurant to order from to the subpar stature of most every other Chinese food place in the Mission area ~ one often blames popularity for this shift (and this place has definitely grown in popularity).. I would just hope that they haven't grown comfortable not trying as hard. As I continue this review, accept my apologies if I seem to wax nostalgic.\n\nA year+ ago, the food was *amazing*. I'd think I were being hyperbolic, but I distinctly recall coming away with the same impression about their food, each time, before. My measuring of Chinese food establishments tends to rest on a small set of 'staples' that I use to compare different establishments: the chow mein, the general tso's chicken, and their pot stickers. Price Matters, and is considered heavily (not specifically for being *cheap*, which is important, but if Free is the best spice on steroids, spendy Chinese better be Very freakin flavorful..).\n\nI write this review, and it pains me(kindanotreally), because where a year ago this place was absolute Top marks ~ not Only for price, which was just fantastically cheap (assuming because they were very new), but for Flavor & Quality. The pot stickers, here, at a time, were long and aways the best in the Mission. Period. AND amongst the cheapest. Now I feel a bit ripped off. They've gone up ~$2 per order, since.. their quality has gone down significantly (biting into hard chunks of gristle is Gross ~ this has happened at least a few times more recently), and the flavor's just not there, anymore, beyond those respects/concerns. \n\nWhen the pot stickers go, the rest follow ~ the other dishes have gone up in price, down in quality. The chow mein (once also really good) is just oilier and less flavorful. I still like the General Tso's chicken. Also, their combo Won Ton soup was a steal and a blessing lol, and I still love to order that to this day. The dim sum is also pretty awesome, though, again, food quality concerns (gristly pork siu mai.. ew)..\n\nAppreciate that this review is less a damning of the establishment and more the noted frustrations of a once-immensely pleased patron. It took a long enough time to find a place in the area that delivered really good Chinese food, and this was IT, once. I write this with the realization that this establishment has since come to risk attaining a similar mediocrity (at inflated price points)  that the rest of the Mission seems dead set upon resting on. And it's sad, really. Just not something I want to see..\n\n\n===== Original Review:\n\nI really have to say that I am impressed with the food that comes out of this place. I have ordered food here a few times, and they've been consistently delicious. For one, their potstickers are better than most everyone else's in town, period. Most anywhere I go, I order the potstickers (a. because iLoves them and b. its a good 'quality test' for a Chinese cuisine establishment), and consistently, Jasmine Tea House outclasses the rest for flavor and texture and just overall preparedness. \n\nThis applies for the dim sum, as well - the pork siu mai and shanghai baby bun were, too, some of the best I've had in the city. In general, I am very happy with how well the food is prepared, here. It was worth getting on here to write a review for them. Will frequent farrrr more often.", "rating": 3, "date": "2014-11-14"}], "vegetable bun": [], "chive dumpling": [{"excerpts": ["I ordered Steamed Tofu Roll (3), Vegetable Dumpling (3), Chive Dumpling (3) and liked them in that order.  ", "The name Steamed Tofu Roll isn't very descriptive for those of you who are new to dim sum; they are in fact steamed fried tofu skin wrapped around julienne veggies. ", "The normal version often comes with dice pork and shrimp and Jasmine Tea House does a fine vegetarian version.  ", "The Vegetable Dumplings and Chive Dumplings are pretty good as well although the dumpling skin is a little on the thick side. ", "In order for me to be full at say Yank Sing, I would probably need 4 plates of dim sums all to myself.  ", "The dumplings/servings at the Jasmine Tea House are huge.  ", "I basically ate half and pack the rest home.  ", "At $2.95 each, the price is right.  ", "Also love the fact that they don't break/close in the afternoon unlike most Chinese restaurants."], "author": "Tiffany L.", "review": "3.5 stars for the vegetarian dim sum.  \n\nAs a vegetarian, I almost have to swear off dim sum since most of these Chinese small plates have pork or seafood in them.  We stopped by here Jasmin Tea house one Saturday afternoon and stumbled across the \"large\" vegetarian dim sum selection. I ordered Steamed Tofu Roll (3), Vegetable Dumpling (3), Chive Dumpling (3) and liked them in that order.  The name Steamed Tofu Roll isn't very descriptive for those of you who are new to dim sum; they are in fact steamed fried tofu skin wrapped around julienne veggies. The normal version often comes with dice pork and shrimp and Jasmine Tea House does a fine vegetarian version.  The Vegetable Dumplings and Chive Dumplings are pretty good as well although the dumpling skin is a little on the thick side. In order for me to be full at say Yank Sing, I would probably need 4 plates of dim sums all to myself.  The dumplings/servings at the Jasmine Tea House are huge.  I basically ate half and pack the rest home.  At $2.95 each, the price is right.  Also love the fact that they don't break/close in the afternoon unlike most Chinese restaurants.", "rating": 4, "date": "2010-01-31"}], "stuffed bell pepper": [{"excerpts": ["The shrimp stuffed bell pepper and shu mai caught my attention. ", "My party of 3 shared that along with 3 other dishes. ", "The Mongolian beef was ok, not spicy at all and more on the sweeter side, garlic fish was pretty good, and the roast duck was fatty and not fresh. ", "The dim sum were ok, but it wasn't the freshest, understandably so. ", "They gave huge rice portions with the food. ", "The service was attentive & friendly and the place was clean. . ", "Really nothing much more to say..."], "author": "Freckles H.", "review": "I thought this was a dim sum joint, but it's more of a Chinese restaurant that has a small selection of dim sum. I was disappointed, but I went ahead and looked at their dozen or so selection. The shrimp stuffed bell pepper and shu mai caught my attention. My party of 3 shared that along with 3 other dishes. The Mongolian beef was ok, not spicy at all and more on the sweeter side, garlic fish was pretty good, and the roast duck was fatty and not fresh. The dim sum were ok, but it wasn't the freshest, understandably so. They gave huge rice portions with the food. The service was attentive & friendly and the place was clean. . Really nothing much more to say...", "rating": 2, "date": "2009-10-28"}], "stuffed eggplant": [{"excerpts": ["Shrimp Dumplings\nPork Siu Mai\nVegetable Dumplings (Meatless chicken and spinach I believe)\nStuffed Eggplant (aaaamazing)\n"], "author": "H.S. G.", "review": "DIM SUM MECCA.\n\nFor about two years, off and on, we have sought the perfect combination for Dim Sum. This being:\n1) Not over-priced (Yank Sing I'm talkin to you)\n2) No questionable ingredients (what meat is this again/is this gray matter meat?)\n3) No 45 minute wait for a table (Eh hem Hong Kong Lounge)\n\nThis quest has taken us to some very expensive and to some very sketchy, \"wow, there are pigeon feathers all over the floor\" type establishments.  I think we have struck gold at Jasmine Tea House. \n\nThe Dim Sum here was all super fresh made with quality ingredients (my god, that really is shrimp in there!) and shockingly/sadly we were the only patrons in the restaurant - maybe because it was the 4th of July. \n\nWhat we had that was awesome:\nShrimp Dumplings\nPork Siu Mai\nVegetable Dumplings (Meatless chicken and spinach I believe)\nStuffed Eggplant (aaaamazing)\nSesame Ball\n\nSweet Rice (just okay)\n\nThe only thing they're missing from the menu is shanghai soup dumplings. We will be back!", "rating": 5, "date": "2012-07-06"}], "sweet rice chicken": [], "shrimp ball": [], "dim sum combination plate": [{"excerpts": ["* DIM SUM COMBINATION PLATE ($9.50) - 3.5/5\n[3 each of shrimp dumpling, pork bun & siu mai]\nPretty standard as far as dim sum goes. ", "Shrimp dumpling and siu mai were a little greasier than average but otherwise normal. "], "author": "Jessie L.", "review": "TLDR - Not a bad option for delivery if you're looking for an easy fix for Chinese food/dim sum but quality is sacrificed for convenience\n\nI wasn't expecting much from the food here when I ordered delivery. Mainly picked this spot on GrubHub for the low $15 delivery minimum and $0 delivery fee. I was pleased the food actually travelled well with delivery (no soggy, cold food), but it took maybe 90 minutes from when I ordered for my food to be delivered.\n\nThe menu looked very Americanized, which held true when I got my delivery. As long as you're not expecting real Chinese food, you probably won't be disappointed.\n\n* DIM SUM COMBINATION PLATE ($9.50) - 3.5/5\n[3 each of shrimp dumpling, pork bun & siu mai]\nPretty standard as far as dim sum goes. Shrimp dumpling and siu mai were a little greasier than average but otherwise normal. The BBQ pork in the pork buns were overly artificially red in color and sweet, but the buns were soft and fluffy and balanced out the extra sweetness.\n\n* FRIED CHICKEN WINGS ($7.95) - 4.5/5\nDry fried, nicely salted. I was impressed that they managed to maintain most of their crispiness with delivery, but they could have been a little less greasy.", "rating": 4, "date": "2017-02-28"}, {"excerpts": ["Ordered the dim sum combination plate and onion pancake. \n\n", "Onion pancake - \nDidn't even get to take a picture of the pancake ", "bc I threw it out after the first bite. ", "It was dry, cardboard like with no real taste except for bitter oil. ", "Gross.. ", "so gross. ", "DONT GET ", "THIS SAVE ", "Dim sum combination plate -\nBbq pork buns were soggy and overly sweet. \n", "Shrimp dumplings - good. ", "Small but good. \n", "Siu mai - ", "the meat itself had a lot of flavor ", "but I wish the siu mai was fresh. ", "I have a feeling they keep their siu mai under a heated lamp for hours. ", "My siu mai was rubber like. ", "Dim sum combination plate -\nBbq pork buns were soggy and overly sweet. \n", "Shrimp dumplings - good. ", "Small but good. \n", "Siu mai - ", "the meat itself had a lot of flavor ", "but I wish the siu mai was fresh. ", "I have a feeling they keep their siu mai under a heated lamp for hours. ", "My siu mai was rubber like. "], "author": "AJ C.", "review": "It's a good thing I had a $7 delivery coupon. The food here is lacking in freshness. My food came cold and soggy. I'm disappointed but what do you expect with Chinese food deliveries... hit or miss. \n\nOrdered the dim sum combination plate and onion pancake. \n\nOnion pancake - \nDidn't even get to take a picture of the pancake bc I threw it out after the first bite. It was dry, cardboard like with no real taste except for bitter oil. Gross.. so gross. DONT GET THIS SAVE YOUR $6.\n\nDim sum combination plate -\nBbq pork buns were soggy and overly sweet. \nShrimp dumplings - good. Small but good. \nSiu mai - the meat itself had a lot of flavor but I wish the siu mai was fresh. I have a feeling they keep their siu mai under a heated lamp for hours. My siu mai was rubber like. Disappointing \n\n\nFirst and last time ordering food here. I don't think dining in will improve food quality either.", "rating": 2, "date": "2016-11-12"}, {"excerpts": ["Whenever I'm craving Dim Sum and not feeling up for a trip across town, Jasmine Tea House's Dim Sum Combination Plate is my go-to. ", "The Happy Buddha is also a great choice because of the variety of vegetables in the dish. ", "And I always order two entrees to get the free fried rice. ", "I really can't ask for better quality and quantity when it comes to take-out Chinese."], "author": "Iris L.", "review": "I am so glad Jasmine Tea House is open again. I was really panicking for a moment there!\n\nThere are not many decent Chinese food options in my immediate area and when I saw that it was closed I was so desperate that I nearly walked into Nulite. Fortunately, I will never have to do that. \n\nWhenever I'm craving Dim Sum and not feeling up for a trip across town, Jasmine Tea House's Dim Sum Combination Plate is my go-to. The Happy Buddha is also a great choice because of the variety of vegetables in the dish. And I always order two entrees to get the free fried rice. I really can't ask for better quality and quantity when it comes to take-out Chinese.", "rating": 4, "date": "2012-02-13"}, {"excerpts": ["We ordered the dim sum combination plate (shrimp dumplings, pork dumplings, and steamed bbq pork buns) as well as the chive dumplings and the steamed tofu roll. ", "Everything was completely unimpressive, but not terrible tasting as to make it hard to eat. ", "The first clue should have been that I was the only Asian customer in the entire place. "], "author": "Stephen C.", "review": "This review concerns the dim sum. We ordered the dim sum combination plate (shrimp dumplings, pork dumplings, and steamed bbq pork buns) as well as the chive dumplings and the steamed tofu roll. Everything was completely unimpressive, but not terrible tasting as to make it hard to eat. The first clue should have been that I was the only Asian customer in the entire place. But the food is passable for what we paid for it. \n\nWe also ordered the garlic eggplant lunch special to split between three of us. The waitress was nice enough to give us three soups instead of the single one that comes with it when she guessed we were going to be splitting it. The eggplant sauce itself was quite sweet, but otherwise cooked decently.", "rating": 2, "date": "2013-12-08"}], "a jasmine prawn": [], "b ginger chicken": [], "c portabella mushroom with eggplant  tofu": [], "d sun flower chicken": [], "e ming chicken with lettuce shredded cup": [], "f walnut prawns": [], "g sizzling beef": [], "h happy buddha": [], "i half peking duck": [], "k yangtze spareribs": [], "l dry sauteed garlic prawn": [], "n scallops with garlic sauce": [], "p mandarin combo clay pot": [], "q shanghai fillet": [], "r seafood delicatessen": [], "s portabella mushrooms with prawns": [], "t sizzling salmon": [], "u mandarin lamb": [], "x oolong duck smoked": [], "y mango prawn  scallop": [], "z korean chicken wing": [], "v salt  pepper pork chop": [], "w dry garlic chicken wings": [], "vegetable delight": [{"excerpts": ["I ordered vegetable delight, asparagus with black bean sauce, the complementary vegetable chow mein that comes with two entrees, steamed rice, and vegetable potstickers.\n\n", "The asparagus with black bean sauce was wonderfully saucy, with onions and bell peppers.  ", "The chow mein noodles were subtly flavorful, not too greasy, with lots of fresh vegetables - bok choy, broccoli, cabbage... ", "(a lot of cruciferous veggies, huh?)  ", "I've always had trouble eating greasy foods, so it was a pleasant surprise to find them without too much, instead chewy and good.  ", "I put a little of the black bean sauce from the asparagus dish on it, and it tasted even better. ", "The vegetable delight was perfect, mild with crisp veggies - bok choy, mushrooms, broccoli, carrots, lettuce... ", "It dripped on me a bit, but that's because they didn't scrimp on the sauce.  ", "With all the dishes, they filled the containers all the way, and the balance between sauces and veggies was always perfect.  ", "I never felt like they were stingy about the main course. "], "author": "Yvea E.", "review": "Was having a rough day.  Pregnant and hearing voices, which tends to make one confused and disoriented... So I read about this place, Jasmine Tea House, and decided to try to order from them.\n\nI had a hard time making my order and I initially told them the wrong address - but in spite of that, they were very patient with me.\n\nI ordered vegetable delight, asparagus with black bean sauce, the complementary vegetable chow mein that comes with two entrees, steamed rice, and vegetable potstickers.\n\nThey came in half an hour, and only charged me $24. They were very polite. I gave them a $3 tip.\n\nIn spite of my difficulty with ordering, it was all there!  With extra sauce, utensils, and fortune cookies.\n\nThe asparagus with black bean sauce was wonderfully saucy, with onions and bell peppers.  The asparagus was nice and crisp and juicy, done to perfection.\n\nThe chow mein noodles were subtly flavorful, not too greasy, with lots of fresh vegetables - bok choy, broccoli, cabbage... (a lot of cruciferous veggies, huh?)  I've always had trouble eating greasy foods, so it was a pleasant surprise to find them without too much, instead chewy and good.  I put a little of the black bean sauce from the asparagus dish on it, and it tasted even better. :)\n\nThe vegetable delight was perfect, mild with crisp veggies - bok choy, mushrooms, broccoli, carrots, lettuce... It dripped on me a bit, but that's because they didn't scrimp on the sauce.  With all the dishes, they filled the containers all the way, and the balance between sauces and veggies was always perfect.  I never felt like they were stingy about the main course. :)\n\nI saved the potstickers for last - mmmm! Yummm!  They had a hint of ginger in them, and though they were slightly greasy to the touch (as you'd expect) they weren't dripping in grease.  They were full, hearty potstickers... doughy and good with the right amount of veggies inside. I just need to put a little soy sauce on them to make them perfect.\n\nAll in all, the food, the service, are great.  I highly recommend the asparagus in black bean sauce, especially much - it was my favorite out of all the dishes.  It was perfect for ordering delivery, perfect food to mellow out a confusing day (and for the little one!).\n\nThank you, Jasmine Tea House, I'll be back. ;)", "rating": 5, "date": "2010-09-20"}], "mapo bean cake": [], "dried sauteed string beans": [], "black mushrooms with baby bok choy": [], "garlic spinach": [{"excerpts": ["So you can get the basil ostrich and the garlic spinach (both highly recommended), and they'll throw in a free order of beef chow fun. ", "Yowza! "], "author": "Ess D.", "review": "One of our delivery stand-bys, but it's also pleasant to eat at, disproving the general rule that good Chinese restaurants have to have a noisy, chaotic ambiance. \n\nVegi dishes count as entrees. For delivery, two entrees = one free order of fried rice or chow mein/fun. So you can get the basil ostrich and the garlic spinach (both highly recommended), and they'll throw in a free order of beef chow fun. Yowza! What's with the folks calling it pricey?\n\nJasmine is far less greasy than most of the nearby Chinese places; you can get yucky sweet & sour whatever, but that's your own fault for ordering something predestined to be cloying. If you're dining there, they have a well thought-out tea selection and interesting dim sum. Shrimp/banana roll? Why not?", "rating": 4, "date": "2008-09-22"}, {"excerpts": ["I also liked the following vegetable dishes; chinese broccoli with oyster sauce, garlic spinach, garlic eggplant, and the baby bok choi in garlic sauce."], "author": "Francis A.", "review": "There are so many good dishes at this restaurant. My favorite is the Wor Wonton Soup. It probably has something to do with the seasoning of the beef, chicken, pork and prawn sauté that is mixed into the soup, but the broth has so much more flavor than the traditional clear vegetable/chicken stock found in most wonton soups. Other ingredients that can be found in the soup include carrots, baby bok choi, snow peas and mushrooms. If you like busy dishes, this is definitely a winner. \n\nI am a big fan of Generals Chicken and I have only been to a few places that use all white meat chicken chunks compared to the KFC popcorn style chicken pieces used at most Chinese restaurants. Here it is served with big pieces of tender chicken, covered with a crispy shell. \n\nOther notable dishes include the Szechwan Beef, Scallops with Garlic Sauce, and the House Spicy Chow Mein.\n\nI also liked the following vegetable dishes; chinese broccoli with oyster sauce, garlic spinach, garlic eggplant, and the baby bok choi in garlic sauce.", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["And I definitely require perfectly sauteed garlic spinach - a wee bit on the underdone side, not all limp with it's moisture pooling at the bottom of the plate, and well seasoned.  \r\n", "The Yangtze spareribs I tried was just ok to me, but the meat was cooked well, tearing from the bone easily.  \r\n", "I also tried a dim sum combo - again, just ok. \r\n", "There was a LOT to choose from on the menu, some typical, some really unusual, that I think I'll have to revisit another 4, maybe 5 times to be real certain of this place.\r\n", "But the lovely decor, nicely attentive staff, and decent prices will make it an easy return destination."], "author": "CINDY K.", "review": "Some will say that this is Chinese American fare, but I'm not one of them; seems like when people describe 'real' Chinese food, they pick places that seem to think the Chinese culinary point of view requires a 1/2 cup of canola oil for every stir-fry dish.  Um, no. I'm Chinese and I'm happy to pass on the grease and the MSG.  \r\nBut I won't pass on good loose leaf tea - which Jasmine Tea House certainly has. I tried a one called 'gunpowder' tonight - a smokier green tea, a nice change from Jasmine (eeeeverybody's got Jasmine, snooze).\r\nAnd I definitely require perfectly sauteed garlic spinach - a wee bit on the underdone side, not all limp with it's moisture pooling at the bottom of the plate, and well seasoned.  \r\nThe Yangtze spareribs I tried was just ok to me, but the meat was cooked well, tearing from the bone easily.  \r\nI also tried a dim sum combo - again, just ok. \r\nThere was a LOT to choose from on the menu, some typical, some really unusual, that I think I'll have to revisit another 4, maybe 5 times to be real certain of this place.\r\nBut the lovely decor, nicely attentive staff, and decent prices will make it an easy return destination.", "rating": 4, "date": "2006-07-13"}], "asparagus with black bean sauce": [{"excerpts": ["I ordered vegetable delight, asparagus with black bean sauce, the complementary vegetable chow mein that comes with two entrees, steamed rice, and vegetable potstickers.\n\n", "The asparagus with black bean sauce was wonderfully saucy, with onions and bell peppers.  ", "The chow mein noodles were subtly flavorful, not too greasy, with lots of fresh vegetables - bok choy, broccoli, cabbage... ", "(a lot of cruciferous veggies, huh?)  ", "I've always had trouble eating greasy foods, so it was a pleasant surprise to find them without too much, instead chewy and good.  ", "I put a little of the black bean sauce from the asparagus dish on it, and it tasted even better. ", "The vegetable delight was perfect, mild with crisp veggies - bok choy, mushrooms, broccoli, carrots, lettuce... ", "It dripped on me a bit, but that's because they didn't scrimp on the sauce.  ", "With all the dishes, they filled the containers all the way, and the balance between sauces and veggies was always perfect.  ", "I never felt like they were stingy about the main course. "], "author": "Yvea E.", "review": "Was having a rough day.  Pregnant and hearing voices, which tends to make one confused and disoriented... So I read about this place, Jasmine Tea House, and decided to try to order from them.\n\nI had a hard time making my order and I initially told them the wrong address - but in spite of that, they were very patient with me.\n\nI ordered vegetable delight, asparagus with black bean sauce, the complementary vegetable chow mein that comes with two entrees, steamed rice, and vegetable potstickers.\n\nThey came in half an hour, and only charged me $24. They were very polite. I gave them a $3 tip.\n\nIn spite of my difficulty with ordering, it was all there!  With extra sauce, utensils, and fortune cookies.\n\nThe asparagus with black bean sauce was wonderfully saucy, with onions and bell peppers.  The asparagus was nice and crisp and juicy, done to perfection.\n\nThe chow mein noodles were subtly flavorful, not too greasy, with lots of fresh vegetables - bok choy, broccoli, cabbage... (a lot of cruciferous veggies, huh?)  I've always had trouble eating greasy foods, so it was a pleasant surprise to find them without too much, instead chewy and good.  I put a little of the black bean sauce from the asparagus dish on it, and it tasted even better. :)\n\nThe vegetable delight was perfect, mild with crisp veggies - bok choy, mushrooms, broccoli, carrots, lettuce... It dripped on me a bit, but that's because they didn't scrimp on the sauce.  With all the dishes, they filled the containers all the way, and the balance between sauces and veggies was always perfect.  I never felt like they were stingy about the main course. :)\n\nI saved the potstickers for last - mmmm! Yummm!  They had a hint of ginger in them, and though they were slightly greasy to the touch (as you'd expect) they weren't dripping in grease.  They were full, hearty potstickers... doughy and good with the right amount of veggies inside. I just need to put a little soy sauce on them to make them perfect.\n\nAll in all, the food, the service, are great.  I highly recommend the asparagus in black bean sauce, especially much - it was my favorite out of all the dishes.  It was perfect for ordering delivery, perfect food to mellow out a confusing day (and for the little one!).\n\nThank you, Jasmine Tea House, I'll be back. ;)", "rating": 5, "date": "2010-09-20"}], "basil tofu": [{"excerpts": ["I had the basil tofu, and my boyfriend had the general tso's chicken. ", "Both dishes were bland and salty. ", "The general tso's chicken was sticky and mushy. ", "Every other chinese restaurant where I've had either of those dishes, they were spicy. ", "Not to mention that the online ordering didn't offer an option to add steamed rice, and I foolishly thought it would come with it if it wasn't a menu option. "], "author": "April S.", "review": "Wow. I really can't believe how bad the food was.\n\nWe ordered online, and while the delivery was prompt, the food was absolutely atrocious. I had the basil tofu, and my boyfriend had the general tso's chicken. Both dishes were bland and salty. The general tso's chicken was sticky and mushy. Every other chinese restaurant where I've had either of those dishes, they were spicy. Not to mention that the online ordering didn't offer an option to add steamed rice, and I foolishly thought it would come with it if it wasn't a menu option. We got no rice whatsoever.\n\nI certainly won't be ordering again.", "rating": 1, "date": "2010-03-14"}], "chinese broccoli with oyster sauce": [{"excerpts": ["I also liked the following vegetable dishes; chinese broccoli with oyster sauce, garlic spinach, garlic eggplant, and the baby bok choi in garlic sauce."], "author": "Francis A.", "review": "There are so many good dishes at this restaurant. My favorite is the Wor Wonton Soup. It probably has something to do with the seasoning of the beef, chicken, pork and prawn sauté that is mixed into the soup, but the broth has so much more flavor than the traditional clear vegetable/chicken stock found in most wonton soups. Other ingredients that can be found in the soup include carrots, baby bok choi, snow peas and mushrooms. If you like busy dishes, this is definitely a winner. \n\nI am a big fan of Generals Chicken and I have only been to a few places that use all white meat chicken chunks compared to the KFC popcorn style chicken pieces used at most Chinese restaurants. Here it is served with big pieces of tender chicken, covered with a crispy shell. \n\nOther notable dishes include the Szechwan Beef, Scallops with Garlic Sauce, and the House Spicy Chow Mein.\n\nI also liked the following vegetable dishes; chinese broccoli with oyster sauce, garlic spinach, garlic eggplant, and the baby bok choi in garlic sauce.", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["Had General Tsao's chicken (tasty), Chinese broccoli with oyster sauce (also tasty), and pork fried rice (pretty standard). ", "Best Chinese takeout we've had in quite a while."], "author": "Dan R.", "review": "Takeout to Noe Valley - took about 45 mins on a Sat night.   Had General Tsao's chicken (tasty), Chinese broccoli with oyster sauce (also tasty), and pork fried rice (pretty standard). Best Chinese takeout we've had in quite a while.", "rating": 4, "date": "2009-03-01"}], "sweet sour meatless chicken": [{"excerpts": ["Tonight we gave JTH the \"car test\" where we ordered two dishes of fake chicken to go, got stuck in traffic, and killed time waiting to get on the Bay Bridge by eating, sans utensils, the Kung Pao Meatless Chicken and the Sweet Sour Meatless Chicken. ", "Even though both dishes had cooled off and were messy to eat, they were still delicious. ", "The Kung Pao chicken is like a bonbon but made out of a fried shell with a soft fake chicken center instead of chocolate. "], "author": "Ross G.", "review": "Sometimes an actor will comment on the supreme virtuosity of a director by saying something like \"I would act in his movie if he directed the phone book.\" I feel the same way about Jasmine Tea House, only I would eat their breaded and fried phone book.\n\nTonight we gave JTH the \"car test\" where we ordered two dishes of fake chicken to go, got stuck in traffic, and killed time waiting to get on the Bay Bridge by eating, sans utensils, the Kung Pao Meatless Chicken and the Sweet Sour Meatless Chicken. Even though both dishes had cooled off and were messy to eat, they were still delicious. The Kung Pao chicken is like a bonbon but made out of a fried shell with a soft fake chicken center instead of chocolate. This dish is THE definition of the word \"delectable.\"\n\nAs always: a more decadent San Francisco alternative to Oakland's Great Wall (http://www.yelp.com/biz/8BUlhygOXr26Wfry7j1w7g). I have to admit: JTHs fake chicken is probably the best in the entire world.", "rating": 5, "date": "2007-08-01"}, {"excerpts": ["We got a mix of dim sum (basic ha gao, shu mai, bbq pork bun, and chives dumping), sweet sour meatless chicken, westlake fish, beef/broccoli, green beans and stuff like chow mein and a mix of brown/white rice. ", "All of it was really tasty - even the veggy stuff! ", "We spent about $240 to feed way over 25 people so it was well worth it."], "author": "dobi d.", "review": "I ordered a HUGE delivery for about 25 people at my company and it was an overall success. They delivered on time, gave me a 15% discount on my whole order, and gave us plenty of food! I got a lot of comments from coworkers that the food was the bomb (both Asian and non-Asian coworkers). Being Chinese myself, I was skeptical since the reviews were pretty mixed, but I have to say that the food was still very decent for \"American\" style Chinese food. We got a mix of dim sum (basic ha gao, shu mai, bbq pork bun, and chives dumping), sweet sour meatless chicken, westlake fish, beef/broccoli, green beans and stuff like chow mein and a mix of brown/white rice. All of it was really tasty - even the veggy stuff! We spent about $240 to feed way over 25 people so it was well worth it.", "rating": 4, "date": "2009-07-16"}], "kung pao meatless chicken": [{"excerpts": ["They have awesome veggie options (sweet and sour meatless chicken, or kung pao meatless chicken, for example). ", "And the price is right for Chinese in this city - ou get alot of food for the price.  ", "And the bonus is that they don't use MSG in the food, as I've requested many times for them not to put it in only for them to remind me constantly that they don't use it.  :-)"], "author": "Michael M.", "review": "One of the tastiest Chinese joints in town. I frequent Jasmine Tea House quite often, a I live across the street. I've really gotten to know the owner and his family, who are all super friendly and know what I typically order. They have awesome veggie options (sweet and sour meatless chicken, or kung pao meatless chicken, for example). And the price is right for Chinese in this city - ou get alot of food for the price.  And the bonus is that they don't use MSG in the food, as I've requested many times for them not to put it in only for them to remind me constantly that they don't use it.  :-)", "rating": 5, "date": "2013-03-13"}, {"excerpts": ["Tonight we gave JTH the \"car test\" where we ordered two dishes of fake chicken to go, got stuck in traffic, and killed time waiting to get on the Bay Bridge by eating, sans utensils, the Kung Pao Meatless Chicken and the Sweet Sour Meatless Chicken. ", "Even though both dishes had cooled off and were messy to eat, they were still delicious. ", "The Kung Pao chicken is like a bonbon but made out of a fried shell with a soft fake chicken center instead of chocolate. "], "author": "Ross G.", "review": "Sometimes an actor will comment on the supreme virtuosity of a director by saying something like \"I would act in his movie if he directed the phone book.\" I feel the same way about Jasmine Tea House, only I would eat their breaded and fried phone book.\n\nTonight we gave JTH the \"car test\" where we ordered two dishes of fake chicken to go, got stuck in traffic, and killed time waiting to get on the Bay Bridge by eating, sans utensils, the Kung Pao Meatless Chicken and the Sweet Sour Meatless Chicken. Even though both dishes had cooled off and were messy to eat, they were still delicious. The Kung Pao chicken is like a bonbon but made out of a fried shell with a soft fake chicken center instead of chocolate. This dish is THE definition of the word \"delectable.\"\n\nAs always: a more decadent San Francisco alternative to Oakland's Great Wall (http://www.yelp.com/biz/8BUlhygOXr26Wfry7j1w7g). I have to admit: JTHs fake chicken is probably the best in the entire world.", "rating": 5, "date": "2007-08-01"}, {"excerpts": ["And the Kung Pao Meatless Chicken is to die for; peanuts and sauce and fake meat, oh my!  ", "Be sure to get the monkey picked tea; it's more than just a fun name, it's a way of life.  ", "Also, don't miss out on the cinnamint candies at the door (shh, don't tell, I always take more than my fair share!)  ", "Yum, yum and more yum!"], "author": "Cassidy P.", "review": "Okay, so it pains me to give a four stars to my favorite neighborhood Chinese restaurant, but it's my favorite because of certain dishes (not all dishes are created equal).  My favorites: the vegetable pot stickers can't be beat, so tasty!  And the Kung Pao Meatless Chicken is to die for; peanuts and sauce and fake meat, oh my!  Be sure to get the monkey picked tea; it's more than just a fun name, it's a way of life.  Also, don't miss out on the cinnamint candies at the door (shh, don't tell, I always take more than my fair share!)  Yum, yum and more yum!", "rating": 4, "date": "2005-04-12"}, {"excerpts": ["The Jasmine Prawn was underwhelming, the Veggie Mu Shu tasty, the Kung Pao Meatless Chicken quite tasty (but the veggies were a little bland, but the tofu was wonderful), the ninjas were a nice touch. \n\n"], "author": "Benjamin T.", "review": "Since I can't go to Eric's any more, this is now my new go-to Chinese food place. It accells in what it should: quick, no frills food. The place was clean and the people friendly. We ordered and picked it up. The sign was a bit difficult to find, for some odd reason. \n\nThe Jasmine Prawn was underwhelming, the Veggie Mu Shu tasty, the Kung Pao Meatless Chicken quite tasty (but the veggies were a little bland, but the tofu was wonderful), the ninjas were a nice touch. \n\nWait, you didn't see 'em? They were in stealth mode...", "rating": 4, "date": "2009-01-23"}, {"excerpts": ["The Kung Pao Meatless chicken was invaded by soy sauce too. ", "And wouldn't you know it, they threw in some extra packets---like a foot in my ass kicking me out the door, never to return. ", "Of course, I've never been ", "cuz I'm too lazy to get up and go there."], "author": "Stumbalina b.", "review": "I've had food delievered twice from this place, and both times I was utterly underwhelmed. Blame it on the delivery, or blame it on my lackluster feelings for Chinese food if you must. You know what I say, give em' a second chance, but never a third.\n\nSadly, everything we got tasted (and looked) exactly the same--soaked in soy sauce. It wasn't horrible, but it was just really \"eh.\" You know, one of those meal that you keep eating while you continue to complain about it. The mu shu was a soggy mess of jumbled ingredients that were unidentifiable. The mu shu pancakes were too thin and the ones that weren't all stuck together tore easily. The zuchini was chopped in very large hunks and undercooked. The Kung Pao Meatless chicken was invaded by soy sauce too. And wouldn't you know it, they threw in some extra packets---like a foot in my ass kicking me out the door, never to return. Of course, I've never been cuz I'm too lazy to get up and go there.", "rating": 2, "date": "2006-07-17"}, {"excerpts": ["I had the Kung Pao Meatless Chicken (good, although the \"chicken\" turns out to have been deep fried, heavier than I expected) and vegetarian potstickers, which were nicely, non-greasily fried. ", "My dining companion had the Mandarin Claypot, with chicken and seafood in it."], "author": "Amy E.", "review": "Unlike the other comments here, I thought the service was pretty good, fast. Decent, unremarkable food. My dining companion called it \"standard flavor\", which seems like the best way to describe it. I had the Kung Pao Meatless Chicken (good, although the \"chicken\" turns out to have been deep fried, heavier than I expected) and vegetarian potstickers, which were nicely, non-greasily fried. My dining companion had the Mandarin Claypot, with chicken and seafood in it.", "rating": 3, "date": "2005-12-03"}, {"excerpts": ["(could be: sesame chicken, veggie potstickers, sesame beef, mu-shu pork, kung pao meatless chicken (both your vegetarian and carnivorous friends will flip for it)), and I need it now!\"  ", "I have no idea what we're going to do when we move away.  ", "I don't even like to think about it."], "author": "sunny d.", "review": "Huh, I can't believe I haven't reviewed Jasmine yet.  It took a bit of menu exploration before I fell in love, but now we're inseparable.  Once every couple weeks, I turn to the Mister and say \"I need that __________ (could be: sesame chicken, veggie potstickers, sesame beef, mu-shu pork, kung pao meatless chicken (both your vegetarian and carnivorous friends will flip for it)), and I need it now!\"  I have no idea what we're going to do when we move away.  I don't even like to think about it.", "rating": 4, "date": "2006-08-09"}, {"excerpts": ["Kung pao meatless chicken, veggie dim sum. ", "Some times the kung pao comes out and the meatless chicken chunks are not hot all the way through.  ", "Other than that this place is the best, just come here before the dinner rush or there might be a long delay between the time you get served and you dinning partner gets served. ", "I've seen three waiters taking delivery orders on three different phones at the same time."], "author": "Sarah J.", "review": "Kung pao meatless chicken, veggie dim sum. Some times the kung pao comes out and the meatless chicken chunks are not hot all the way through.  Other than that this place is the best, just come here before the dinner rush or there might be a long delay between the time you get served and you dinning partner gets served. I've seen three waiters taking delivery orders on three different phones at the same time.", "rating": 4, "date": "2009-01-03"}], "cashew chicken": [{"excerpts": ["We ordered the garlic fish and cashew chicken lunch specials. ", "Towards the end of my meal, I noticed a mushroom shaped object that turned out to be a hard piece of plastic! ", "I brought it up to my waiter but all they said was a simple \"sorry.", "\" ", "The waiter mentioned it to the owner and the owner didn't say a single word. ", "I do not recommend anyone eating here especially because of the many other options for chinese food here in SF."], "author": "Ray Daniel V.", "review": "Came here on 1/19/15. Not a very good experience here. The hours state that the restaurant opens at 11am but we didn't get seated until about 1130am. The food was average but very salty. We ordered the garlic fish and cashew chicken lunch specials. Towards the end of my meal, I noticed a mushroom shaped object that turned out to be a hard piece of plastic! I brought it up to my waiter but all they said was a simple \"sorry.\" The waiter mentioned it to the owner and the owner didn't say a single word. I do not recommend anyone eating here especially because of the many other options for chinese food here in SF.", "rating": 1, "date": "2015-01-19"}, {"excerpts": ["Unfortunately, the Cashew Chicken had no cashews and the Mu Shu came without plum sauce, one of the key ingredients. ", "Spring rolls were on the greasy side. ", "Other than that the food was okay."], "author": "Christel V.", "review": "We ordered take out from this place. Unfortunately, the Cashew Chicken had no cashews and the Mu Shu came without plum sauce, one of the key ingredients. Spring rolls were on the greasy side. Other than that the food was okay.", "rating": 3, "date": "2008-01-13"}], "general tsao chicken": [{"excerpts": ["to favorites General Tsao chicken was terrible. "], "author": "T J.", "review": "Gone way downhill. Used to come here regularly a decade ago, used to be awesome. Haven't been back for a while, looks like the same staff, price and menu about the same, but wow has it changed for the worse. \n\nRice was extremely clumpy and seemed like the \"microwave day-old rice\" trick. And the sauce of one of my (former) go-to favorites General Tsao chicken was terrible. So disappointed. \n\nAh well, other good places around here now, guess JTH had a good run.", "rating": 3, "date": "2017-12-28"}, {"excerpts": ["Ordered the peking duck, general tsao chicken and chow fun.\n\n"], "author": "Andrew E.", "review": "Ordered the peking duck, general tsao chicken and chow fun.\n\nAll of these items are what you'd expect from an \"americanized\" chinese restaurant. \nNot totally authentic chinese cuisine, as they have a mix of both american and real chinese dishes, but definitely hits the spot if you want something quick and convenient. A bit on the pricey end for chinese food, but there are definitely worse options in the mission.", "rating": 3, "date": "2015-10-02"}, {"excerpts": ["Ordered :\nGeneral Tsao Chicken Lunch Special : 5/5. "], "author": "Rachit A.", "review": "Ordered :\nGeneral Tsao Chicken Lunch Special : 5/5. Loved this\nNoodles Lunch Special : 2/5 . Too much oil\n\nWill order again : 4/5. Yes", "rating": 4, "date": "2013-11-03"}, {"excerpts": ["We ordered pork and vegetable Potstickers, I had the lunch size Sesame Chicken and he ordered the General Tsao Chicken. ", "The meal came with complimentary hot and sour soup. ", "Potstickers come in 4 and were yummy. ", "Our chicken dishes were very similar. ", "Crispy, breaded chicken pieces in a tangy sauce. ", "His was more spicy than mine, but mine had sesame seeds. ", "I wanted to finish my whole plate but after the big potstickers and soup, I was stuffed. ", "Nothing more satisfying than a reasonably priced a hole in the wall Chinese spot!"], "author": "Rochelle I.", "review": "My boyfriend and I were walking around the neighborhood looking for a good lunch spot on 4th of July and came across this place. Didn't look impressive from the outside but it was surprisingly good! We ordered pork and vegetable Potstickers, I had the lunch size Sesame Chicken and he ordered the General Tsao Chicken. The meal came with complimentary hot and sour soup. Potstickers come in 4 and were yummy. Our chicken dishes were very similar. Crispy, breaded chicken pieces in a tangy sauce. His was more spicy than mine, but mine had sesame seeds. I wanted to finish my whole plate but after the big potstickers and soup, I was stuffed. Nothing more satisfying than a reasonably priced a hole in the wall Chinese spot!", "rating": 4, "date": "2013-07-07"}, {"excerpts": ["So is their general tsao chicken & chicken with string beans (very crispy).\n\n"], "author": "Athena S.", "review": "Garlic eggplant is divine.  So is their general tsao chicken & chicken with string beans (very crispy).\n\nLunch specials are a whopping $5.25 DELIVERED FREE to your office if you're close enough!  Oh ya!", "rating": 4, "date": "2011-03-21"}, {"excerpts": ["**4.5 stars\n\nGeneral Tsao chicken...."], "author": "Karen S.", "review": "Jasmine Tea House...I love you!!! Muwaaaaaaaaaaaaaaaaaaaaaah!\n\nThis charming little place, in the Mission a coupla blocks from Army/Caesar Chavez...is one of my fave places in SF to eat.\nI have never ordered food for delivery, have always dined in...and why not when it's such a welcoming, airy energy... nice tables and chairs...it's not another chipped tile/plastic table/fluorescent lighting spots!  ..It seems to be a favorite stop of many uniformed (and un-uniformed SFPD) so better watch your manners and don't poke anyone with your chopsticks...unless they ask I guess...\n\nAnyway, here's a rundown of some of my favorite items:\n\nAny of the dumplings.....***5 stars\n\nSizzling soup or Combo won ton soup*****5 stars\n\nChicken salad......**4.5 stars\n\nGeneral Tsao chicken....** 5 Stars\n\nJasmine prawns....**10 stars\n\nHappy Buddha (wonderful veggie dish)  ***10 stars\n\nBasil Ostrich (yes, I said ostrich)  ***5 stars\n\nService is always ** 5 stars!!\n\nYou can get lucky with street parking...but the good news is there is a lot  RIGHT across the street  that usually has space and not too $$..and heck for the convenience, so worth it!!  \n(And if you do park in the lot, remember, it's much easier to jay walk from the lot to JTH...watch out for the fast moving cars or coppers,  Chachi...beep beep!!!!!)\n\nHave fun!!! Mangia la ostrich!!!", "rating": 5, "date": "2010-01-19"}, {"excerpts": ["Their crab rangoons, general tsao chicken, BBQ pork fried rice, hong kong style chow mein, and garlic prawns are also some of my favorites."], "author": "Bernadette R.", "review": "My sister introduced me to this place. I absolutely love it. Friends of mine are not as in love as I am, but I think you have to know what to order. My sister loves their dim sum and recommends it. I personally think their mongolian beef is some of the best in the city. Their crab rangoons, general tsao chicken, BBQ pork fried rice, hong kong style chow mein, and garlic prawns are also some of my favorites.", "rating": 4, "date": "2012-09-21"}, {"excerpts": ["General Tsao Chicken\nProbably my favorite of the dishes.  ", "Nice tangy black sauce, basted onto minimally breaded breast-meat chicken.  ", "This could possibly be my new favorite General Tsao Chicken in SF, and the reason why they got 2 stars instead of 1.  ", "There was a laughably small amount of broccoli in the container - ", "I think "], "author": "Paul L.", "review": "I like Bill Clinton.  I like food.  Bill Clinton likes food. Bill Clinton likes this place.  Thus, I thought odds were pretty good that I'd like this place... it was not to be.\n\nWe ordered delivery on Saturday at 6pm through a rather surly phone guy who spoke reasonable english.  The order showed up at 7:15pm, which I actually consider fine for a Saturday peak-dinner-delivery-time.  Despite the wait, the food did show up hot.\n\nWe ordered:\nC. Party Time [Prawn with walnut]\nThere was at least a quarter inch of batter fried onto each prawn.  My wife ate this one -- she said it was pretty bland.  The hot & sour soup that came with it was really inedible -- it tasted like someone had accidentally spilled apple vinegar into it.  An obscene amount of apple vinegar.\n\n36. Combination Wonton Soup\nThe soup had a decidedly fishy taste to it -- not what I was expecting.  Even after fishing out the prawns, I couldn't get past the fishy taste.  The pork in it was pretty good, as were the dumplings -- but the broth, prawns and chicken were pretty nasty looking and tasting.\n\n60. General Tsao Chicken\nProbably my favorite of the dishes.  Nice tangy black sauce, basted onto minimally breaded breast-meat chicken.  This could possibly be my new favorite General Tsao Chicken in SF, and the reason why they got 2 stars instead of 1.  There was a laughably small amount of broccoli in the container - I think one or two pieces.\n\n70. Szechwan Beef\nAgain, a heavy hand was used with the batter, pre-frying.  The beef had very little flavor, but the cooked onions they threw in were a really nice addition to give the dish some kick.  \n\nFor $46 (including delivery tip), we'd have been better off ordering from somewhere else.", "rating": 2, "date": "2010-05-09"}, {"excerpts": ["When I first started dating the now-new-husband, he swore the General Tsao chicken was the best he's ever had, and I gotta admit, I do love it; ", "the chicken, the rice and the broccoli was cooked just right.  ", "I make it a point to at least try different meals every time I go, but I always go back to the General chicken.  "], "author": "Eidelyn G.", "review": "Jasmine Tea House hits the spot when you're hungry!  When I first started dating the now-new-husband, he swore the General Tsao chicken was the best he's ever had, and I gotta admit, I do love it; the chicken, the rice and the broccoli was cooked just right.  I make it a point to at least try different meals every time I go, but I always go back to the General chicken.  Heck, even the fake chicken tastes good!\n\nThe service is fast and quick, and they prices are incredibly decent, especially the lunch specials.  The wait staff are totally nice, and they remember you if you're a repeat customer.  Definitely a great place.", "rating": 5, "date": "2007-12-10"}, {"excerpts": ["Their menu was clearly posted online, and I ordered the General Tsao Chicken and the combination Hong Kong Noodles.  ", "The food arrived about 35 minutes after I placed the order.  ", "The delivery guy was all smiles and super pleasant when he dropped the food off.  ", "There was seriously enough food for at least 4 meals (so good value)!  ", "The chicken came still crispy and well-sauced.  ", "The noodles had a good amount of beef, seafood, and veggies.  ", "Actually, everything was surprising tasty for chinese delivery!  ", "whooohoooo!  ", "I would definitely order again!"], "author": "Amy C.", "review": "I've been holing myself up over the weekend trying to study for a test next week, but a girl's gotta eat!  A few yelpy minutes later, I find Jasmine Tea House.  Their menu was clearly posted online, and I ordered the General Tsao Chicken and the combination Hong Kong Noodles.  The food arrived about 35 minutes after I placed the order.  The delivery guy was all smiles and super pleasant when he dropped the food off.  There was seriously enough food for at least 4 meals (so good value)!  The chicken came still crispy and well-sauced.  The noodles had a good amount of beef, seafood, and veggies.  Actually, everything was surprising tasty for chinese delivery!  whooohoooo!  I would definitely order again!", "rating": 4, "date": "2008-07-05"}, {"excerpts": ["The green onion pancake is a chunk of fried bliss and the general Tsao chicken is addictive. ", "However, the general Tsao has been inconsistent lately, which isn't a bad thing, but can be confusing. ", "For instance, sometimes it's more breaded and/or saucy than others. ", "It's all gravy though because this chicken is always tasty. ", "The veggie fried rice compliments ", "any entree well. ", "You can also dine in-house to enjoy the reasonable lunch specials."], "author": "Adam L.", "review": "I agree with Bill Clinton: Jasmine Tea House is the truth! This is by far my favorite Chinese delivery in the city. The green onion pancake is a chunk of fried bliss and the general Tsao chicken is addictive. However, the general Tsao has been inconsistent lately, which isn't a bad thing, but can be confusing. For instance, sometimes it's more breaded and/or saucy than others. It's all gravy though because this chicken is always tasty. The veggie fried rice compliments any entree well. You can also dine in-house to enjoy the reasonable lunch specials.", "rating": 4, "date": "2009-01-03"}, {"excerpts": ["The General Tsao Chicken, Fried Rice, Mongolian Beef and almost anything else you have is going to be tasty! ", "The restaurant  is small and clean and the service is great!  ", "The lunch specials are great and the prices are even better!  ", "This is definitely my go to place for Chinese food any time I am craving Chinese."], "author": "d p.", "review": "This place is great!  I've eaten here and have also had food delivered to my house.  It's always been delicious and consistent.  The General Tsao Chicken, Fried Rice, Mongolian Beef and almost anything else you have is going to be tasty! The restaurant  is small and clean and the service is great!  The lunch specials are great and the prices are even better!  This is definitely my go to place for Chinese food any time I am craving Chinese.", "rating": 5, "date": "2010-01-18"}, {"excerpts": ["maybe i ordered the wrong things that day , general tsao chicken szechuan beef , ", "both deepfried wish i knew that couldnt taste the quality of the meat at all. "], "author": "NAEL K.", "review": "very fast delivery , food is pretty decent  maybe i ordered the wrong things that day , general tsao chicken szechuan beef , both deepfried wish i knew that couldnt taste the quality of the meat at all. free chow mein with delivery i take that , they were actually good , dim sum were nice and warm but not much in , 3 stars for a quick delivery but i dont know about bill clinton", "rating": 3, "date": "2010-05-19"}], "chicken with string beans": [{"excerpts": ["We got general tso and chicken with string beans. ", "Both were delicious. ", "I asked for my string beans to be spicy which I'm glad I'm did. ", "The Tso's was one of the best I've had.\n", "We also had the shu mai and dumplings (def get them!)."], "author": "Alissa C.", "review": "So yummy!! \nWe got general tso and chicken with string beans. Both were delicious. I asked for my string beans to be spicy which I'm glad I'm did. The Tso's was one of the best I've had.\nWe also had the shu mai and dumplings (def get them!).", "rating": 5, "date": "2018-08-21"}, {"excerpts": ["So is their general tsao chicken & chicken with string beans (very crispy).\n\n"], "author": "Athena S.", "review": "Garlic eggplant is divine.  So is their general tsao chicken & chicken with string beans (very crispy).\n\nLunch specials are a whopping $5.25 DELIVERED FREE to your office if you're close enough!  Oh ya!", "rating": 4, "date": "2011-03-21"}], "flavor chicken": [], "basil chicken": [{"excerpts": ["Spicy basil chicken was underwhelming and the sauce was hard to describe. ", "Thick and slimy may be the best way to describe it. "], "author": "Anthony G.", "review": "Typical neighborhood Chinese joint. Staff was very pleasant. \n\nHot and sour soup was not my thing and a little bit too pungent (think sweaty boot) for me. \nPork sumai was pretty delicious. Highlight of the meal. Spicy basil chicken was underwhelming and the sauce was hard to describe. Thick and slimy may be the best way to describe it. Chicken was the weird preformed stuff you get in low-end Asian restaurants. \n\nSoup, tea, dim sum and large entree for under 9 dollars. WHAT!\n\nIf you are looking for a top notch meal, head elsewhere. For value at lunch time, this place simply can not be beat.", "rating": 3, "date": "2013-08-30"}, {"excerpts": ["We ordered the General TSO chicken , Basil Chicken , chicken fried rice and pork dumplings and it was all great. ", "They delivered and we were very happy to get a good meal."], "author": "Lynette D.", "review": "We ordered the General TSO chicken , Basil Chicken , chicken fried rice and pork dumplings and it was all great. They delivered and we were very happy to get a good meal.", "rating": 4, "date": "2014-08-29"}, {"excerpts": ["We ordered the bak choy with black mushrooms and basil chicken, and their dimsum combination plate.  ", "The food was pretty good.  ", "The dimsum wasn't the BEST EVER kind of deal, but definitely up to par.  ", "(I'm Cantonese, I grew up eating dimsum in China, ", "Anyways, the basil chicken, really was basil chicken, it's really Americanized ", "( my friend ordered this, I would probably have never ordered it), but it tasted like what it says it is, BASIL and CHICKEN...lol the texture was good and the flavor was really basil-ish... wouldn't get that again..."], "author": "Zu W.", "review": "I usually don't like eating out for chinese food other than dimsum.  It's embarrassing because I can make it myself or eat at my mommy's.  But I've been too lazy to cook or drive all the way home, and definitely craving some chinese food, so I stopped by here for lunch today with my friend.\n\nStarting with the atmosphere.  The place was pretty open and wasn't too crowded.  There was a lot of in and outs for take out and what not. Atmosphere was nice, not too quiet but enough for me and my friend to have a chatty lunch without everybody in there hearing our convo.\n\nWe ordered the bak choy with black mushrooms and basil chicken, and their dimsum combination plate.  The food was pretty good.  The dimsum wasn't the BEST EVER kind of deal, but definitely up to par.  (I'm Cantonese, I grew up eating dimsum in China, so I would know =P).  \n\nAnyways, the basil chicken, really was basil chicken, it's really Americanized ( my friend ordered this, I would probably have never ordered it), but it tasted like what it says it is, BASIL and CHICKEN...lol the texture was good and the flavor was really basil-ish... wouldn't get that again...but it's not BAD...\n\nThe bak choy and black mushrooms was pretty good.  I wish they gave you more bak choy, I was really craving the vegetables, but then they weren't stingy with the mushrooms.  You can tell they used some oyster sauce for the mushrooms and it was really good.  It's a simple, common, easy to make dish, and it was well made. \n\nThe service is pretty good.  Fast and polite, and she was actually really nice.  I asked her for extra rice to go, we had left overs which i was going to bring to my boyfriend at work, and she gave me a whole to go box and she didn't charge me for it, or give me a dirty look which I feel like other places often do when you ask for stuff.  I was gonna give it 3 stars but because of that I'll give it an extra star! It's not about getting free stuff, it's about the fact that she quickly and nicely gave me what I wanted.\n\nAnyways, the only thing bad about the place is that when she first brought out the plate she didn't realize that one of them was still dirty...it had something crusty on it, eww.  But we told her and she apologized and quickly gave us a clean and new one.  \n\nI think I'm being so nice about this because they were truly really nice and were service oriented, and places like that I can definitely be more forgiving about stuff.  4 stars overall and I'd definitely go back again.", "rating": 4, "date": "2009-09-12"}, {"excerpts": ["Add tofu to your veggie dish, or eliminate those darn water chestnuts from your basil chicken. "], "author": "Katie D.", "review": "This has been my favorite chinese restaurant hands down since moving out to San Francisco from New York in 2008. Their prices are reasonable and the staff is incredibly friendly and competent--my water glass never goes empty, which is very important to me in a restaurant. Food comes quickly and is always hot and I have never had to wait for a table, which means it's not crowded or noisy.\n\nAnd let's talk about the food. I haven't tried any of their meat dishes except the ostrich (which is freakin amazing), but I've loved everything else (especially the sesame meatless chicken, veg potstickers, hot & sour soup, & veg mushu). I find that some dishes have the over-saltiness or over-greasiness that many chinese take-out type places have, although it is very slight here (I may be extra-sensitive to this because I do a ton of chinese cooking at home and I use much less oil). But, that's easily solved by asking your waiter for less oil or less salt or whatever you want and they will do it! \n\nTheir meatless chicken is AMAZING and you can ask for it in the style of pretty much any of their chicken dishes even if it's not on the menu. I also like to ask for the meatless chicken not breaded or fried because it's much healthier that way, plus I like it better anyway. Basically, they will allow you to ask for substitutes or changes to their menu (within reason) without even frowning about it, so that alone wins them a ton of points in my book. Add tofu to your veggie dish, or eliminate those darn water chestnuts from your basil chicken. Go crazy!\n\nAs an added bonus, they give you a free lo/chow mein or fried rice if you order 2 entrees from take-out. And delivery is free. Love this place.", "rating": 5, "date": "2009-10-18"}, {"excerpts": ["Some really succulent platters landed, and several of us raved about the basil chicken and the lamb.  ", "I differ from Monkey S (is she the same monkey?...", "no, couldn't be) on the pot-stickers--I like Eliza's better--but ", "I'll be back.  ", "Definitely check them out if you need a reasonably priced place to take a big crowd."], "author": "Kevin S.", "review": "I'm a big fan of monkey-picked products.  I buy only monkey-picked stocks, for example.  And look how well we're doing with our monkey-picked President.  Well, maybe not that one.  \r\n\r\nMeanwhile, I was quite impressed with the way Jasmine Tea House handled a dinner for 30 of my dearest colleagues this week.  Things got off to a bit of a slow start, when the server laid down a plate of 3 tiny spring rolls, each cut in half, at our table of ten famished tech workers.  But they picked up speed through the rest of the appetizers and soup course and when they hit the main dishes, it was like a wall of food coming at us.  \r\n\r\nSome really succulent platters landed, and several of us raved about the basil chicken and the lamb.  I differ from Monkey S (is she the same monkey?...no, couldn't be) on the pot-stickers--I like Eliza's better--but I'll be back.  Definitely check them out if you need a reasonably priced place to take a big crowd.", "rating": 4, "date": "2006-01-12"}, {"excerpts": ["Basil Chicken and some other chicken dish + egg rolls.\n\n", "The egg rolls were ok, but egads - the main dishes were not only exactly the same (vegetables & flavor - other than the basil chicken had basil) ", "but wow - it was all very bland, a bit overcooked and stew-y.  "], "author": "Nancy R.", "review": "OMG.  So we were starving last night and ordered delivery.   Basil Chicken and some other chicken dish + egg rolls.\n\nThe egg rolls were ok, but egads - the main dishes were not only exactly the same (vegetables & flavor - other than the basil chicken had basil) but wow - it was all very bland, a bit overcooked and stew-y.  We struggled to finish half of our portions (and we were really hungry!).\n\nAlas - so we made a huge mistake.  To ensure it never happens again, we threw away the menu and will NEVER order again.  Unfortunately, I can't imagine that being at the restaurant is going to be substantially different, so will certainly never go.", "rating": 1, "date": "2008-11-08"}, {"excerpts": ["The basil chicken is also very good.  ", "Large portions...i usually leave with half my meal in a to go box."], "author": "Glenn B.", "review": "Good food.  Good service.  Close to my job.  I go about twice a month and always leave with a smile on my face.  The waiters are friendly and helpful.  So far the best on the lunch menu is the garlic eggplant.  The basil chicken is also very good.  Large portions...i usually leave with half my meal in a to go box.", "rating": 4, "date": "2009-12-23"}, {"excerpts": ["The service is great and the Basil Chicken is awesome as well as "], "author": "M R.", "review": "The service is great and the Basil Chicken is awesome as well as the General's Tso's Chicken, the chow mein, the veggie potstickers and the hot and sour soup.  I've never done takeout so I couldn't tell you about that but in general it really doesn't matter which restaurant you order takeout from the food will never taste the same as when you order to eat in because by the time the food gets to you since its in a container the temperature from the hot food continues to cook the food so the taste of the food is compromised. SO.... this place is great. I don't understand some of the negative reviews but then again everyone has different taste.  But I have great taste so I give this place 4 stars. Check it out you won't be disappointed.", "rating": 4, "date": "2009-12-05"}], "shanghai chicken": [{"excerpts": ["Shanghai chicken - there's virtually no veggie in this dish, and the chicken is diced into super small pieces.  ", "Plus, I had requested super spicy ", "but it was not spicy ", "AT ALL.  "], "author": "Kristen S.", "review": "Delivery arrived only 5 minutes late, which was quite good, everything considered.\n\nRecommend:\n1. combination wonton soup\n2. pork siu mai - super tasty, one of the best in town\n3. lunch plates (available even on weekends)\n\nAvoid:\n1. happy buddha - the meatless chicken is weird and tasteless\n2. Shanghai chicken - there's virtually no veggie in this dish, and the chicken is diced into super small pieces.  Plus, I had requested super spicy but it was not spicy AT ALL.  Not even a hint of peppers.\n\nPlus:\nThe guy on the phone speaks very decent English.\n\nOverall:\nStick to the pork stuff - siu mai, wontons, etc.  They seem to do that well.", "rating": 3, "date": "2012-11-03"}], "mango prawns": [{"excerpts": ["I did not like the mango prawns and scallops at all.  ", "Will order direct from them next time and see if there is a difference in delivery time and price. ", "And will try some other stuff. ", "But will always order the eggplant shrimp dim sum!"], "author": "Karen K.", "review": "Delivery took long like 1.5hrs . Eat 24 seems to charge $1 more than the menu (compared the menu that came with the food to eat 24 prices). The eggplant shrimp dim sum is delicious, other stuff was just alright. I did not like the mango prawns and scallops at all.  Will order direct from them next time and see if there is a difference in delivery time and price. And will try some other stuff. But will always order the eggplant shrimp dim sum!", "rating": 4, "date": "2017-01-28"}], "prawns lobster sauce": [], "kung pao prawn": [], "prawn black bean sauce": [], "dry garlic calamari": [{"excerpts": ["Particularly awesome highlights: Happy Buddha, Basil Ostrich, and Dry Garlic Calamari. ", "Joy!"], "author": "Abie H.", "review": "Favorite Chinese delivery in the city. Particularly awesome highlights: Happy Buddha, Basil Ostrich, and Dry Garlic Calamari. Joy!", "rating": 5, "date": "2008-12-04"}], "sweet and sour prawns": [{"excerpts": ["Think of a different version of sweet and sour prawns...with a white sauce. "], "author": "Charlene C.", "review": "Ahhhh.\n\nThis is what good clean chinese food is about. \n\nJasmine Tea House is located on the\n14, 49, 26 bus lines. \n\nThe staff are very friendly and accommodating.\n\nThe bathroom is clean and the restaurant is super clean. Good sign.\n\nI normally don't order from this restaurant for delivery, since it doesn't taste the same. The food you order must be eaten at the restaurant.\n\nBrad and I walked into the restaurant and were\nimmediately led to a nice quaint table. We were provided ice water and menus immediately upon sitting down.\n\nWe ordered the following:\nPotstickers\nCrab meat cheese wontons\nHoney Walnut Prawns\nWor Won ton soup\n\nOnce you order your appetizer, they immediately place a cute tray of sweet and sour sauce, hot mustard, soy sauce for dipping. \n\nAnd that's when happiness began.\n\nThe crab meat cheese puffs are 6 lightly fried triangles of won tons filled with imitation crab meat, green onion, spices and cream cheese. It's lightly crispy on the outside and tender on the inside.\nIt's extremely tasty when dipped in the hot mustard. It was fresh and wonderful.\n\nThe potstickers arrived next...and these potstickers put Superstar yong de to shame. Superstar yong de, you need to take your soggy potstickers and take lessons from Jasmine Tea House.\n\nJasmine Tea House prepared 6 perfect potstickers. They are lightly crisp on the bottom, and soft and tender all around. Once you bite into them, the flavors and juiciness of the potsticker will explode in your mouth. They were so good, that Brad and I had to fight for the last one....I lost. Boo hoo.\n\nHis Honey Walnut prawns arrived. Now these were huge delicately fried prawns (not shrimp) in batter, coated with a creamy sweet white sauce and tossed with Candied Walnuts. It was crispy, light, sweet and delicious. Think of a different version of sweet and sour prawns...with a white sauce. He was quiet the whole time, so I know he enjoyed his entree.\n\nMy Wor won ton soup arrived...and this to me was the piece de resistance. This is what won ton soup is about. This puts all won ton soup to shame.  All other won ton soups I eat in other chinese restaurants tastes like flavorless warm water with soggy won tons floating in it...yuck.\n\nThis soup is perfect..why you ask\n1. 8 perfectly cooked won tons floating in a wonderfully spiced and flavorful rich dark broth. The vegetables of mushrooms, greens add to the flavor, the bbq pork, chicken and beef sat atop of the dish like a crown jewel engulfed in a thick rich brown sauce to add this delicious explosion of heaven in your mouth. The bowl was beautiful and the temp of the broth is how soup should be...steaming hot! WOW. \n\nAnd folks, this is why this soup would be my last meal on earth. It's absolute heaven. And this restaurant created this wonderful concoction. So next time you go to this restaurant, sit down and enjoy their won ton soup. No soup will ever taste that good.", "rating": 5, "date": "2008-01-02"}], "ginger fish": [{"excerpts": ["You can have anything on the menu made with their fake meat (which is fabulous), but I love the ginger fish, the chow mein and any of their fake meat dishes (so basically everything on the menu)"], "author": "Kayla B.", "review": "Oh how I love Jasmine Tea House. You can have anything on the menu made with their fake meat (which is fabulous), but I love the ginger fish, the chow mein and any of their fake meat dishes (so basically everything on the menu)", "rating": 4, "date": "2015-01-10"}, {"excerpts": ["Great pot-stickers and the Ginger fish is very yummy!"], "author": "Barbara W.", "review": "I love this place. I eat here so often that they ask if I want 'the usual\". I just love that! Great pot-stickers and the Ginger fish is very yummy!", "rating": 5, "date": "2007-12-18"}], "west lake fish fillet": [], "vegetarian mu shu": [{"excerpts": ["I will however recommend the vegetarian mu shu, that the waiter rolled table side. \n", "In saying that the service was very good! ", "Almost surprisingly good for the price points of the food. ", "The staff was very attentive and friendly. \n", "I want to go back to try their entrees."], "author": "Marie-Claire R.", "review": "I had a little dinner her with a friend on Thursday; and if I hadn't read the reviews about the restaurant on yelp before hand I don't think I would have gone into the restaurant. The exterior looks very tacky!! But, the inside the restaurant is cute and comfortable. \nThe food was good; we order a few different appetizers. I would pass on the combination wonton soup; the shrimp dim sum was forgettable, not bad but nothing amazing. I will however recommend the vegetarian mu shu, that the waiter rolled table side. \nIn saying that the service was very good! Almost surprisingly good for the price points of the food. The staff was very attentive and friendly. \nI want to go back to try their entrees.", "rating": 4, "date": "2009-05-17"}], "chicken mu shu": [{"excerpts": ["I ordered the chicken mu shu. ", "The server made the first wrap for me using 3 spoons. ", "It reminded me of my mom who knew how to do that from working at other people's restaurants.  ", "It was ok. ", "Nothing spectacular. ", "Covered in sauce. ", ":"], "author": "Yan E.", "review": "Meh. \n\nI've dined here once. The service was good. They kept our waters filled.  I ordered the chicken mu shu. The server made the first wrap for me using 3 spoons. It reminded me of my mom who knew how to do that from working at other people's restaurants.  It was ok. Nothing spectacular. Covered in sauce. ::shrug:::\n\nA got the Wor Wonton soup. The soup weirded both of us out at first because on top is the meat covered with sauce. I've never seen wonton soup like that. A's final verdict was it tastes the same in the end. As everyone who's ever gone to a buffet with a cheap Chinese person (namely me) knows, \"eat the meat, it's worth more.\" The chicken, beef, and bbq pork in the soup was so low quality that when we packed up our leftovers, I dug the wontons and vegetables out of the soup and left the meat behind. Not worth eating.\n\nIn short, neither good nor bad. Just meh. And this is so clinched: did I eat at the same place as all the other reviewers?", "rating": 3, "date": "2009-06-23"}], "pork mu shu": [], "beef mu shu": [], "seafood mu shu": [], "shredded pork with hot pepper": [], "chopped pork with bean thread": [], "sweet  sour pork": [], "royal pork": [], "a i dont want to cook combination dinner": [], "b treat yourself combination dinner": [], "c party time combination dinner": [], "chow mein": [{"excerpts": ["The Chow Mein and Walnut Shrimp were bomb and the service was great. ", "Definitely will be coming back."], "author": "Hali Z.", "review": "Jasmine Tea House has some of the best Chinese food around. The Chow Mein and Walnut Shrimp were bomb and the service was great. Definitely will be coming back.", "rating": 5, "date": "2017-11-04"}, {"excerpts": ["I had the Walnut Shrimp, fried rice, chow mein, chow fung, and assorted dimsum. ", "Everything was so delicious!! ", "10/10."], "author": "Michelle G.", "review": "Jasmine Tea House has amazing food! I had the Walnut Shrimp, fried rice, chow mein, chow fung, and assorted dimsum. Everything was so delicious!! 10/10.", "rating": 5, "date": "2017-11-04"}, {"excerpts": ["My measuring of Chinese food establishments tends to rest on a small set of 'staples' that I use to compare different establishments: the chow mein, the general tso's chicken, and their pot stickers. ", "The chow mein (once also really good) is just oilier and less flavorful. ", "I still like the General Tso's chicken. ", "Also, their combo Won Ton soup was a steal and a blessing lol, and I still love to order that to this day. "], "author": "Cory H.", "review": "Ok. So I've frequented this place, plenty, over the past year (or maybe even 2?), and for shame, I only now write a review (UPDATE: Inaccurate ~ forgot I posted a review, before; see below..). My hope is that this message is read and received, with a mind for progress with this establishment..\n\nThey've gone from an absolutely spectacular little restaurant to order from to the subpar stature of most every other Chinese food place in the Mission area ~ one often blames popularity for this shift (and this place has definitely grown in popularity).. I would just hope that they haven't grown comfortable not trying as hard. As I continue this review, accept my apologies if I seem to wax nostalgic.\n\nA year+ ago, the food was *amazing*. I'd think I were being hyperbolic, but I distinctly recall coming away with the same impression about their food, each time, before. My measuring of Chinese food establishments tends to rest on a small set of 'staples' that I use to compare different establishments: the chow mein, the general tso's chicken, and their pot stickers. Price Matters, and is considered heavily (not specifically for being *cheap*, which is important, but if Free is the best spice on steroids, spendy Chinese better be Very freakin flavorful..).\n\nI write this review, and it pains me(kindanotreally), because where a year ago this place was absolute Top marks ~ not Only for price, which was just fantastically cheap (assuming because they were very new), but for Flavor & Quality. The pot stickers, here, at a time, were long and aways the best in the Mission. Period. AND amongst the cheapest. Now I feel a bit ripped off. They've gone up ~$2 per order, since.. their quality has gone down significantly (biting into hard chunks of gristle is Gross ~ this has happened at least a few times more recently), and the flavor's just not there, anymore, beyond those respects/concerns. \n\nWhen the pot stickers go, the rest follow ~ the other dishes have gone up in price, down in quality. The chow mein (once also really good) is just oilier and less flavorful. I still like the General Tso's chicken. Also, their combo Won Ton soup was a steal and a blessing lol, and I still love to order that to this day. The dim sum is also pretty awesome, though, again, food quality concerns (gristly pork siu mai.. ew)..\n\nAppreciate that this review is less a damning of the establishment and more the noted frustrations of a once-immensely pleased patron. It took a long enough time to find a place in the area that delivered really good Chinese food, and this was IT, once. I write this with the realization that this establishment has since come to risk attaining a similar mediocrity (at inflated price points)  that the rest of the Mission seems dead set upon resting on. And it's sad, really. Just not something I want to see..\n\n\n===== Original Review:\n\nI really have to say that I am impressed with the food that comes out of this place. I have ordered food here a few times, and they've been consistently delicious. For one, their potstickers are better than most everyone else's in town, period. Most anywhere I go, I order the potstickers (a. because iLoves them and b. its a good 'quality test' for a Chinese cuisine establishment), and consistently, Jasmine Tea House outclasses the rest for flavor and texture and just overall preparedness. \n\nThis applies for the dim sum, as well - the pork siu mai and shanghai baby bun were, too, some of the best I've had in the city. In general, I am very happy with how well the food is prepared, here. It was worth getting on here to write a review for them. Will frequent farrrr more often.", "rating": 3, "date": "2014-11-14"}, {"excerpts": ["I have tried the chow mein dishes and several rice dishes and the only negative thing I can think of is that the food can be a little too salty occasionally. "], "author": "Alan L.", "review": "Very cheap Americanized Chinese food that tastes pretty good! I highly recommend coming for the weekday lunch specials (located on the back of the menu) because the portions are huge and will fill your stomach for only $10 (includes tip and tax). I have tried the chow mein dishes and several rice dishes and the only negative thing I can think of is that the food can be a little too salty occasionally. The sweet and sour soup (which comes with your dish) is a favorite among my coworkers. \n\nThe service is good and the waiters are friendly and quick at responding to needs. \n\nI have not checked out the restroom yet, but I can say that the tables and utensils are clean. The ambiance and lighting are good.", "rating": 4, "date": "2014-01-22"}, {"excerpts": ["The food I got was fried chicken, pork buns, prawn fried rice, prawn chow mein, combination Hong Kong noddle and wonton soup the food is definitely worth the price it is great. ", "I recommend this place for everyone."], "author": "Erika B.", "review": "I love this place the food is fresh and even hot when delivered they pack it up nice. The food I got was fried chicken, pork buns, prawn fried rice, prawn chow mein, combination Hong Kong noddle and wonton soup the food is definitely worth the price it is great. I recommend this place for everyone.", "rating": 5, "date": "2016-07-11"}, {"excerpts": ["You can have anything on the menu made with their fake meat (which is fabulous), but I love the ginger fish, the chow mein and any of their fake meat dishes (so basically everything on the menu)"], "author": "Kayla B.", "review": "Oh how I love Jasmine Tea House. You can have anything on the menu made with their fake meat (which is fabulous), but I love the ginger fish, the chow mein and any of their fake meat dishes (so basically everything on the menu)", "rating": 4, "date": "2015-01-10"}, {"excerpts": ["Broccoli beef, veggie fried rice, sweet and sour chicken, mu shu pork, combination wonton soup, spicy string beans, chow mein, crab rangoons, prawns in lobster sauce and garlic prawns. ", "Big ups for the free chow mein or fried rice you get when you order 3 entrees.\n\n"], "author": "Lauren L.", "review": "My family orders delivery from here all the time.\n\nBroccoli beef, veggie fried rice, sweet and sour chicken, mu shu pork, combination wonton soup, spicy string beans, chow mein, crab rangoons, prawns in lobster sauce and garlic prawns. We've tried all of these and they're all delicious.\n\nSo glad they came back after re-modeling. My parents like the combo wonton soup the most. Big ups for the free chow mein or fried rice you get when you order 3 entrees.\n\nYaaay, Jasmine Tea House!", "rating": 4, "date": "2012-04-21"}, {"excerpts": ["Chow mein is just okay and the Szechwan beef ought to be avoided - it was seriously disappointing."], "author": "Miriam W.", "review": "Sometimes, after a trying day all you need is a crab puff, an egg roll, a pot sticker, some fried chicken wings and a good friend to remind you that life's okay and maybe, just maybe, so are you. If the crab puff-egg roll-pot sticker-fried chicken wings solution is one you want to employ order the appetizer combination (the good friend you will have to find on your own.) Unlike in other Chinese restaurants, every single item on the plate is excellent.\r\n\r\nKeep the good vibes going with a dish of dry sauteed string beans. They're flavorful and packed full of spice and pass the leftover test with flying colors. Chow mein is just okay and the Szechwan beef ought to be avoided - it was seriously disappointing.", "rating": 3, "date": "2006-06-14"}, {"excerpts": ["In my early 20's, a bout of food poisoning caused by a bunk dose of chow mein forced me to miss a NYE rave in East Oakland.  "], "author": "Kati K.", "review": "Haven't always been a fan of cheap Chinese food.  \n\nIn my early 20's, a bout of food poisoning caused by a bunk dose of chow mein forced me to miss a NYE rave in East Oakland.  Tragic.\n\nIn my mid 20's, an unclean batch of sweet 'n sour shrimps forced me to miss a cozy evening chez the CEO of a local tech company. Tragedy of all tragedies. \n\nHave kept an open mind re: cheap Chinese for the following reasons - \n\n* During the course of single motherhood, there've been quite a few nights when I could scarcely muster the energy to open a box of mac 'n cheese for the kids. (K, lots of nights.)\n\n* Secondly, my youngest adores anything Chinese.  Pretty sure this has something to do with Kai Lan, adorable cartoon cousin of Dora the Explorer.  On any given night, ask her what she wants for dinner, and the answer will always be \"Chinese.\"\n\nJasmine Tea House is our go-to Chinese because: a) they deliver, b) they're cheap, c) plenty of vegetarian options, and d) they offer dim sum for dinner. \n\nHave never had a bad meal from this joint, and my newly miserly ways allow me to stretch a $30 dinner for three days.\n\nThank you, Jasmine Tea House!", "rating": 4, "date": "2010-05-27"}, {"excerpts": ["Free beef chow mein was bland. ", "it looks very saucy ", "but it was bland", ", I added hot sauce to it and it tasted better. ", "That's it."], "author": "Karen T.", "review": "I was lazy to cook and walked by this place several times, saw that President Bill Clinton at there so if it's good enough for Bill it's good enough for me, Right? Well I'm Chinese and I've eaten lots of Chinese food in my life and this place is ok but not presidential standards. I ordered the korean chicken, which was heavily battered. The batter was so thick I was eating just batter at one point. The chicken was very meaty which I liked and the sauce looked scary kind of a very dark soy color but it wasn't overwhelming, not too sweet, not too salty. The Mopo tofu was good, nice firm tofu. I think they used a fermented tofu which is stiffer, but I could be wrong. Free beef chow mein was bland. it looks very saucy but it was bland, I added hot sauce to it and it tasted better. That's it.", "rating": 3, "date": "2011-03-11"}, {"excerpts": ["we ordered chicken chow mein (which was outstanding) & vegetable soup \n6) and every dim sum item you can imagine: shrimp dumplings, chive dumplings, BBQ pork buns, shu mai, sticky rice with meatless chicken (highly recommend this one), vegetable dumplings & buns, & the fried prawn appetizer\n7) ", "we adored the tiny tea cups\n8) and the delicious jasmine tea to help digest all that not-that-heavy-but-still-kinda-heavy Chinese food\n9) ", "everything was about $11 per person (not including tip)\n10) "], "author": "Fancypants X.", "review": "In the spirit of FB--10 random things you didn't know about my dim sum experience at Jasmine Tea House:\n\n1) i love their colorful, neon lights that read \"Jasmine\"-- it makes me super excited for dim sum.\n2) our waiter was extremely friendly, like genuinely friendly & patient--he gets 10 stars!\n3) i brought three of my favorite ladies for lunch\n4) one of whom is a vegetarian (or rather pescatarian, i guess)\n5) we ordered chicken chow mein (which was outstanding) & vegetable soup \n6) and every dim sum item you can imagine: shrimp dumplings, chive dumplings, BBQ pork buns, shu mai, sticky rice with meatless chicken (highly recommend this one), vegetable dumplings & buns, & the fried prawn appetizer\n7) we adored the tiny tea cups\n8) and the delicious jasmine tea to help digest all that not-that-heavy-but-still-kinda-heavy Chinese food\n9) everything was about $11 per person (not including tip)\n10) my fortune read \"the current year will bring you much happiness.\" \n\nDo you feel you know me better now?", "rating": 4, "date": "2010-02-08"}, {"excerpts": ["Their crab rangoons, general tsao chicken, BBQ pork fried rice, hong kong style chow mein, and garlic prawns are also some of my favorites."], "author": "Bernadette R.", "review": "My sister introduced me to this place. I absolutely love it. Friends of mine are not as in love as I am, but I think you have to know what to order. My sister loves their dim sum and recommends it. I personally think their mongolian beef is some of the best in the city. Their crab rangoons, general tsao chicken, BBQ pork fried rice, hong kong style chow mein, and garlic prawns are also some of my favorites.", "rating": 4, "date": "2012-09-21"}, {"excerpts": ["If you order two entrees you get free chow mein or fried rice. ", "We went with the chow mein and it was pretty bland until i put the kung pao sauce on it. ", "The delivery guy makes up for some of this because I have never had a more friendly, happy delivery person!"], "author": "Jackie O.", "review": "We ordered take out after they left a flyer on our door. That is not something I'd normally do but I was lazy. We ordered the mixed vegetables and kung pao chicken. The vegetables had good flavor but they were overcooked and super mushy which kind of put me off. The kung pao chicken was standard, good enough to eat but not good enough to get seconds. If you order two entrees you get free chow mein or fried rice. We went with the chow mein and it was pretty bland until i put the kung pao sauce on it. The delivery guy makes up for some of this because I have never had a more friendly, happy delivery person!", "rating": 3, "date": "2013-03-04"}, {"excerpts": ["As an added bonus, they give you a free lo/chow mein or fried rice if you order 2 entrees from take-out. ", "And delivery is free. ", "Love this place."], "author": "Katie D.", "review": "This has been my favorite chinese restaurant hands down since moving out to San Francisco from New York in 2008. Their prices are reasonable and the staff is incredibly friendly and competent--my water glass never goes empty, which is very important to me in a restaurant. Food comes quickly and is always hot and I have never had to wait for a table, which means it's not crowded or noisy.\n\nAnd let's talk about the food. I haven't tried any of their meat dishes except the ostrich (which is freakin amazing), but I've loved everything else (especially the sesame meatless chicken, veg potstickers, hot & sour soup, & veg mushu). I find that some dishes have the over-saltiness or over-greasiness that many chinese take-out type places have, although it is very slight here (I may be extra-sensitive to this because I do a ton of chinese cooking at home and I use much less oil). But, that's easily solved by asking your waiter for less oil or less salt or whatever you want and they will do it! \n\nTheir meatless chicken is AMAZING and you can ask for it in the style of pretty much any of their chicken dishes even if it's not on the menu. I also like to ask for the meatless chicken not breaded or fried because it's much healthier that way, plus I like it better anyway. Basically, they will allow you to ask for substitutes or changes to their menu (within reason) without even frowning about it, so that alone wins them a ton of points in my book. Add tofu to your veggie dish, or eliminate those darn water chestnuts from your basil chicken. Go crazy!\n\nAs an added bonus, they give you a free lo/chow mein or fried rice if you order 2 entrees from take-out. And delivery is free. Love this place.", "rating": 5, "date": "2009-10-18"}, {"excerpts": ["The free bbq pork chow mein (free rice or chow mein with 2 entree orders) was good aldente  with nice portion of bbq pork. "], "author": "Jon L.", "review": "I ordered from Jasmine as a backup because the place I was going to order from China Wok on Monterey Blvd (who has good food) exhibited poor service this last time. Wok's hours say til 1AM on their website, but they called and said they close at 10PM (it was 9:30PM when I placed online order, and 9:50 when the place called to tell me they couldn't deliver my order because the kitchen was closed). So on to Jasmine I found thru a Yelp review when searching for late Chinese delivery to  Bernal. \n\nWell, when I called to order it was 9:55pm and asked if they would still deliver. The guy asked where I lived, and he cheerfully said \"yes\" they would deliver and it would be the driver's last stop. He only asked that I tip the driver in cash (I was paying by card) since the driver would be going home after our stop. Fair enough. \n\nThe food that came was HOT, and fresh. Sesame Beef was crispy and savory, not greasy. Spicy eggplant chicken was nice, not over-sauced, but with flavorful eggplant and crisp stir fried zucchini and veggies. The free bbq pork chow mein (free rice or chow mein with 2 entree orders) was good aldente  with nice portion of bbq pork. Hot and sour soup was hearty but slightly under seasoned; I'd prefer some with a peppery kick. \n\nJasmine was certainly better and fresher tasting than some of the other mediocre places in the Bernal area. (Not a fan of Hunan Chef, they have live finches in cages in the dining room....seems a little against any health code).\n\nThey score on the customer service side, not declining business because it's 5 minutes before closing.", "rating": 4, "date": "2009-12-20"}, {"excerpts": ["(Wild Pepper, you had me at the free Chow Mein) when I did, it made eating chinese take-out on my couch with sporks seem somehow...Clintonian."], "author": "Jeremy W.", "review": "Very kind staff here and one of the best combo delivery deals around. For $10 you get soup, eggroll, an entree and rice. It's called, fittingly, \"I Don't Want To Cook\".\n\nThere is something about the housemade fake meat here. I was briefly addicted to it. I'm not even a Veganarian, but I found myself with the oddest cravings for their meatless Kung Pao. Then one day, poof, I was immune, nothing. It got under my skin though, quite inexplicably, so I'd be remiss not to bring this up.\n.\nBut I'm still giving this place the Trinity. Fast to your door Mission. There are far worse Chinese comestibles en El Barrio. That and Clinton ate here twice. He also ordered to go, and because he was Bill MFing Clinton Jasmine Tea House cooked him up some vittles even even though they'd closed the kitchen. So while I don't order from JTH anymore (Wild Pepper, you had me at the free Chow Mein) when I did, it made eating chinese take-out on my couch with sporks seem somehow...Clintonian.", "rating": 3, "date": "2007-01-05"}, {"excerpts": ["Order 2 entrees and get free fried rice or chow mein (a choice of pork, chicken, beef or vegetable). "], "author": "Jack C.", "review": "My vegetarian friends LOVE the Meatless Chicken dish.   I think it is called the Happy Buddha.\n\nI love and have never been disappointed by:\nPork Siu Mai\nPork Pot Stickers\nDeep Fried Oysters\nSzechwan Beef\nANY fried rice\nI have had a few of the Eggplant dishes and loved them.   Forget which though.   :)\n\nThe only thing I have been disappointed with has been the Seafood Chow Fun.   It is very tasty and has some great seafood in it but is very soupy.\n\nFree delivery is available for lunch and dinner within the delivery area. Order 2 entrees and get free fried rice or chow mein (a choice of pork, chicken, beef or vegetable). $10 Minimum for credit card orders.\n\nSay Hi to Frank for me!", "rating": 5, "date": "2009-03-03"}, {"excerpts": ["An uber-cool thing about this place is that if you order 2 entrees you get free fried rice or chow mein."], "author": "Aimee B.", "review": "My husband was a big fan of this place back in the day when he lived in Bernal, and now that we ware back in the city and within delivery distance he is a happy man once again.\n\nI am a big fan of the lemon chicken, and Mister B loooooves the Oolong duck (it is actually almost better the next day, still cold).   I think you can't go wrong with anything from their Chef's Special list.  \n\nAn uber-cool thing about this place is that if you order 2 entrees you get free fried rice or chow mein.", "rating": 5, "date": "2009-03-16"}, {"excerpts": ["I had the chow mein and beef. ", "While their food claims to lack MSG, there was something in the beef that makes it kinda ... funky. ", "No complaints. ", "I'd say the food is pretty good. ", "I'm just picky b/c the best Chinese food comes from my mommy!"], "author": "Emily C.", "review": "So my friend has this habit of ordering in Chinese food? And both places in the past has made her deathly ill or just plain grossed out. \n\nJasmine Tea House .. didn't. Yay!\n\nChicken corn soup was pretty good. Then again, I like anything with egg drop.\n\nI had the chow mein and beef. While their food claims to lack MSG, there was something in the beef that makes it kinda ... funky. No complaints. I'd say the food is pretty good. I'm just picky b/c the best Chinese food comes from my mommy!", "rating": 4, "date": "2008-07-10"}, {"excerpts": ["I ordered vegetable delight, asparagus with black bean sauce, the complementary vegetable chow mein that comes with two entrees, steamed rice, and vegetable potstickers.\n\n", "The asparagus with black bean sauce was wonderfully saucy, with onions and bell peppers.  ", "The chow mein noodles were subtly flavorful, not too greasy, with lots of fresh vegetables - bok choy, broccoli, cabbage... ", "(a lot of cruciferous veggies, huh?)  ", "I've always had trouble eating greasy foods, so it was a pleasant surprise to find them without too much, instead chewy and good.  ", "I put a little of the black bean sauce from the asparagus dish on it, and it tasted even better. ", "The vegetable delight was perfect, mild with crisp veggies - bok choy, mushrooms, broccoli, carrots, lettuce... ", "It dripped on me a bit, but that's because they didn't scrimp on the sauce.  ", "With all the dishes, they filled the containers all the way, and the balance between sauces and veggies was always perfect.  ", "I never felt like they were stingy about the main course. "], "author": "Yvea E.", "review": "Was having a rough day.  Pregnant and hearing voices, which tends to make one confused and disoriented... So I read about this place, Jasmine Tea House, and decided to try to order from them.\n\nI had a hard time making my order and I initially told them the wrong address - but in spite of that, they were very patient with me.\n\nI ordered vegetable delight, asparagus with black bean sauce, the complementary vegetable chow mein that comes with two entrees, steamed rice, and vegetable potstickers.\n\nThey came in half an hour, and only charged me $24. They were very polite. I gave them a $3 tip.\n\nIn spite of my difficulty with ordering, it was all there!  With extra sauce, utensils, and fortune cookies.\n\nThe asparagus with black bean sauce was wonderfully saucy, with onions and bell peppers.  The asparagus was nice and crisp and juicy, done to perfection.\n\nThe chow mein noodles were subtly flavorful, not too greasy, with lots of fresh vegetables - bok choy, broccoli, cabbage... (a lot of cruciferous veggies, huh?)  I've always had trouble eating greasy foods, so it was a pleasant surprise to find them without too much, instead chewy and good.  I put a little of the black bean sauce from the asparagus dish on it, and it tasted even better. :)\n\nThe vegetable delight was perfect, mild with crisp veggies - bok choy, mushrooms, broccoli, carrots, lettuce... It dripped on me a bit, but that's because they didn't scrimp on the sauce.  With all the dishes, they filled the containers all the way, and the balance between sauces and veggies was always perfect.  I never felt like they were stingy about the main course. :)\n\nI saved the potstickers for last - mmmm! Yummm!  They had a hint of ginger in them, and though they were slightly greasy to the touch (as you'd expect) they weren't dripping in grease.  They were full, hearty potstickers... doughy and good with the right amount of veggies inside. I just need to put a little soy sauce on them to make them perfect.\n\nAll in all, the food, the service, are great.  I highly recommend the asparagus in black bean sauce, especially much - it was my favorite out of all the dishes.  It was perfect for ordering delivery, perfect food to mellow out a confusing day (and for the little one!).\n\nThank you, Jasmine Tea House, I'll be back. ;)", "rating": 5, "date": "2010-09-20"}, {"excerpts": ["The vegetable chow mein was totally without flavor. "], "author": "Reza E.", "review": "We have been living in Mission/Noe area for almost 3 years now and still looking for good Chinese food. When I saw all the reviews here I decided to try it. Frankly I'm not sure what the fuss is all about. Maybe this place is popular because of the vegetarian choices. I'm not a vegetarian.\n\nSesame Beef was way over-sauced. The pieces of beef were swimming in the sauce. The chicken and green beans dish was bland. The vegetable chow mein was totally without flavor. It seemed like it was missing salt or something.\n\nI am going to try this place again because I believe that you have to give a restaurant at least two tries before you make a judgment. After my second try, I will come back and either adjust my rating or leave it as is.\n\nThe search for decent Chinese food in Mission/Noe continues.", "rating": 2, "date": "2007-12-10"}, {"excerpts": ["We ordered Orange Chicken, Veggie chow mein, and Mongolian beef. ", "All of it was spicy but all of it was wonderful! "], "author": "Kristin P.", "review": "Well, I knew I wouldn't be disappointed when I saw the signature round Yelp sticker in the door of the Jasmine Tea House.\n\nAfter giving a friend a ride back to his house in SF from Modesto last night, we needed some major grubbage before the journey back to the Valley. So, being that our friend lives in Bernal Heights, the Jasmine was a short two block walk away.\n\nAt first, I felt the service was a bit slow seeing as that it wasn't busy but, when our order was finally taken, the waitress was friendly as hell. This is the first time I've ever seen the waitress/waiter actually write the order down in Chinese! I thought that was a nice touch.\n\nWithin 10 minutes, our food started to arrive. We ordered Orange Chicken, Veggie chow mein, and Mongolian beef. All of it was spicy but all of it was wonderful! Between the three of us, we nearly cleared all three plates, and left with the feeling of satisfaction.\n\nI had read somewhere that Yelp has helped improve the service of restaurants in the city, and If this place was any inclination to that being true, I don't know what is.\n\nAlso to note: Their beer, sake and wine is very affordable. A small Sapporo or Anchor Steam is a mere $3.25. I'd be hard pressed to find cheaper beer in the city. They were also named to SF's Best of San Francisco in 2006 for a couple of their dishes.", "rating": 5, "date": "2008-08-04"}, {"excerpts": ["and they give you a FREE fried rice or chow mein.\n\n"], "author": "Josh M.", "review": "JTH is my \"go to\" Chinese restaurant in the neighborhood!  Everything I've ordered has been good...and not in a \"okay, kind of good way,\" but the really, really good 'n' tasty way!  A few must orders:\n\nCombo Clay Pot\nMeatless Chicken w/green beans and asparagus (this isn't on menu)\nSizzling Beef\nHot and Sour Soup\n\nI didn't think the Jasmine Prawn was over the top good, but I didn't  return it to the kitchen either!\n\nOh yeah, order two entrees to go and they give you a FREE fried rice or chow mein.\n\nNow, how can you beat that?!?", "rating": 4, "date": "2009-07-08"}, {"excerpts": ["Despite their claim to be a \"Mandarin Chinese Food\" restaurant, I always hear the staff at Jasmine Tea House jabbering in Cantonese, and they'll make you crispy Hong Kong style chow mein if you ask for it.\n\n"], "author": "Andrew H.", "review": "Despite their claim to be a \"Mandarin Chinese Food\" restaurant, I always hear the staff at Jasmine Tea House jabbering in Cantonese, and they'll make you crispy Hong Kong style chow mein if you ask for it.\n\nInterestingly, the best dish here is the fried rice. It's salty and delicious and the best I've had in the area. Their other dishes are pretty good, and true to their name, they serve a good pot of fresh brewed jasmine tea (they also have a wide selection of other Chinese teas).\n\nTheir staff is pretty friendly and gives suggestions (although be warned, when they're speaking in Chinese to each other in the background sometimes they're making fun of you). We live nearby and their delivery is always fast (usually 15-20 minutes) and the food still hot and fresh.", "rating": 5, "date": "2006-04-08"}, {"excerpts": ["It has a menu that diversifies greatly from standard \"Chinese\" fare---it's for the most part non-greasy and with complex flavors--it's not just chow mein and sesame chicken here! "], "author": "T.Z. R.", "review": "MMm, delicious! I've been going to this place ever since the owners split off from the Garden of Tranquility (circa 2000).  I'm Chinese myself and I can say that this place serves very authentic Mandarin food. It has a menu that diversifies greatly from standard \"Chinese\" fare---it's for the most part non-greasy and with complex flavors--it's not just chow mein and sesame chicken here! I recommend the eggplant dishes, you can also even order crab if you call in ahead of time.\n\nAnd come on, Bill Clinton approves.\n\nUpdate: I just tried their meatless chicken (in both sesame and sweet n sour morphos), and I feel compelled to award them +1 shiny red star. It possesses both sumptuous flavor --definitely tofu derived, and best when hot--and ingenious texturization--it's not as dense as tofu... it seriously has the flakiness of real meat.\n\nThis place kicks Mekong's inferior *puke* TVP chick to the curb. BAM!", "rating": 5, "date": "2007-06-29"}, {"excerpts": ["The food is good and very consistent, and I must say the chow mein and mongolian beef  are great the next day heated up in the microwave.\n\n"], "author": "David R.", "review": "I order from here on a regular basis, and yes I am a fan.\n\nThe delivery is always prompt - the only place I know that delivers faster than they quote, not longer.\n\nThe food is good and very consistent, and I must say the chow mein and mongolian beef  are great the next day heated up in the microwave.\n\nCheap, quick and plenty of food.  Everything I look for in Chinese take out.", "rating": 4, "date": "2008-06-14"}, {"excerpts": ["For delivery, two entrees = one free order of fried rice or chow mein/fun. "], "author": "Ess D.", "review": "One of our delivery stand-bys, but it's also pleasant to eat at, disproving the general rule that good Chinese restaurants have to have a noisy, chaotic ambiance. \n\nVegi dishes count as entrees. For delivery, two entrees = one free order of fried rice or chow mein/fun. So you can get the basil ostrich and the garlic spinach (both highly recommended), and they'll throw in a free order of beef chow fun. Yowza! What's with the folks calling it pricey?\n\nJasmine is far less greasy than most of the nearby Chinese places; you can get yucky sweet & sour whatever, but that's your own fault for ordering something predestined to be cloying. If you're dining there, they have a well thought-out tea selection and interesting dim sum. Shrimp/banana roll? Why not?", "rating": 4, "date": "2008-09-22"}, {"excerpts": ["A warning about the fried rice and chow mein, however. ", "Although tasty, they are both very dry. "], "author": "Megan C.", "review": "I have eaten at Jasmine Tea House only once, however, I've eaten the food many times. I prefer to get their food delivered as it is fast and free. There are so many great options to choose from we try something new every time. But the go-to foods we almost always get include the Korean wings and the duck.\n\nThe dim sum is good as well.\n\nI've never had anything that I absolutely didn't like and all the food seems fresh and made with high-quality ingredients.\n\nA warning about the fried rice and chow mein, however. Although tasty, they are both very dry. We often end up adding soy sauce when we get it (it comes free if you order enough food).\n\nOverall this is a solid Chinese restaurant with a good selection of unique specials worth giving a try.", "rating": 4, "date": "2011-03-20"}, {"excerpts": ["The best chow mein in all of Noe / Bernal / Outer Mission. ", "And mammoth portions."], "author": "B G.", "review": "In a neighborhood full of great Chinese food, this place stands out. The best chow mein in all of Noe / Bernal / Outer Mission. And mammoth portions.", "rating": 4, "date": "2013-03-13"}, {"excerpts": ["When ordering take out they have a coupon for free fried rice or chow mein for orders of $20 or more.  ", "The fried rice is good enough to feed 2-3 people."], "author": "Cedric F.", "review": "This place is one of the better chinese restaurants in my neighborhood.  The prices here are fare and the portions are hearty.  Their orange chicken is made with real orange peels not like that panda express crap.  When ordering take out they have a coupon for free fried rice or chow mein for orders of $20 or more.  The fried rice is good enough to feed 2-3 people.", "rating": 3, "date": "2009-07-30"}, {"excerpts": ["Other notable dishes include the Szechwan Beef, Scallops with Garlic Sauce, and the House Spicy Chow Mein.\n\n"], "author": "Francis A.", "review": "There are so many good dishes at this restaurant. My favorite is the Wor Wonton Soup. It probably has something to do with the seasoning of the beef, chicken, pork and prawn sauté that is mixed into the soup, but the broth has so much more flavor than the traditional clear vegetable/chicken stock found in most wonton soups. Other ingredients that can be found in the soup include carrots, baby bok choi, snow peas and mushrooms. If you like busy dishes, this is definitely a winner. \n\nI am a big fan of Generals Chicken and I have only been to a few places that use all white meat chicken chunks compared to the KFC popcorn style chicken pieces used at most Chinese restaurants. Here it is served with big pieces of tender chicken, covered with a crispy shell. \n\nOther notable dishes include the Szechwan Beef, Scallops with Garlic Sauce, and the House Spicy Chow Mein.\n\nI also liked the following vegetable dishes; chinese broccoli with oyster sauce, garlic spinach, garlic eggplant, and the baby bok choi in garlic sauce.", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["They deliver for an order of $12 or more and give free fried rice or chow mein if you order 2 entrees!!!  ", "What a bargain!"], "author": "Tabatha Y.", "review": "YUM!  Way better than Eric's in Noe Valley...and what a deal!!  They deliver for an order of $12 or more and give free fried rice or chow mein if you order 2 entrees!!!  What a bargain!", "rating": 5, "date": "2006-06-12"}, {"excerpts": ["We got a mix of dim sum (basic ha gao, shu mai, bbq pork bun, and chives dumping), sweet sour meatless chicken, westlake fish, beef/broccoli, green beans and stuff like chow mein and a mix of brown/white rice. ", "All of it was really tasty - even the veggy stuff! ", "We spent about $240 to feed way over 25 people so it was well worth it."], "author": "dobi d.", "review": "I ordered a HUGE delivery for about 25 people at my company and it was an overall success. They delivered on time, gave me a 15% discount on my whole order, and gave us plenty of food! I got a lot of comments from coworkers that the food was the bomb (both Asian and non-Asian coworkers). Being Chinese myself, I was skeptical since the reviews were pretty mixed, but I have to say that the food was still very decent for \"American\" style Chinese food. We got a mix of dim sum (basic ha gao, shu mai, bbq pork bun, and chives dumping), sweet sour meatless chicken, westlake fish, beef/broccoli, green beans and stuff like chow mein and a mix of brown/white rice. All of it was really tasty - even the veggy stuff! We spent about $240 to feed way over 25 people so it was well worth it.", "rating": 4, "date": "2009-07-16"}, {"excerpts": ["The soups, pork buns, vegetable stir-fry, and chow mein are also excellent, which is a testament to their range in dishes. ", "My group of 4 ate heartily amongst two appetizers, three main dishes and tea for about $45, which is a complete deal."], "author": "Jenz y.", "review": "I seriously love Chinese food like no other, and Jasmine Tea House is arguably the best I have everrrrrr gotten. The walnut shrimp was so fucking good I almost had to change my pants. The soups, pork buns, vegetable stir-fry, and chow mein are also excellent, which is a testament to their range in dishes. My group of 4 ate heartily amongst two appetizers, three main dishes and tea for about $45, which is a complete deal.", "rating": 5, "date": "2007-11-10"}, {"excerpts": ["Order 2 dishes and fried rice or chow mein is free!  ", "Definitely the best chinese delivery place yet but expect about 40 min wait cause they're popular!"], "author": "Tanger T.", "review": "Perfect for delivery. It's the only experience I've had with this place...never dined in. Order 2 dishes and fried rice or chow mein is free!  Definitely the best chinese delivery place yet but expect about 40 min wait cause they're popular!", "rating": 4, "date": "2005-04-18"}, {"excerpts": ["Plus they give you a free order of chow mein when you order 2 entreees. ", "Very friendly staff and quick service for phone orders."], "author": "Armand C.", "review": "Jasmine Tea House has the best chinese food in the city as far as I'm concerned. Their Dry Fried Prawns are absolutely fabulous. I've never had anything like them. Their Wor Wonton Soup is amazing, full of shrimp, pork, beef and fresh bok choy and black mushrooms. They use really good ingredients so you don't get any knuckly pieces or fat in the meat dishes. Plus they give you a free order of chow mein when you order 2 entreees. Very friendly staff and quick service for phone orders.", "rating": 5, "date": "2009-08-10"}, {"excerpts": ["Chow mein wasn't good, the soup was bland, the lemon chicken had no salt, the beef and broc was too mushy.  ", "Maybe it was a bad day for the chef but enough for me."], "author": "lori c.", "review": "I've had better....this place is not the same for me anymore.  I do love chinese food and use to come here but then it got new owners.  I just dont like the food here.  We always order big and have lots of different plates, all the plates were bland. Chow mein wasn't good, the soup was bland, the lemon chicken had no salt, the beef and broc was too mushy.  Maybe it was a bad day for the chef but enough for me.", "rating": 1, "date": "2009-07-22"}, {"excerpts": ["Their mu shu and chow mein are some of the best I've had - they are my favorites.  ", "And their hot and sour soup also passes my test - a bit more sour than hot, so I sometimes add a wee bit of hot sauce.  ", "However, sometimes I ask them to make it hot and they always happily oblige.  ", "Also, they are ridiculously nice and lovely people, both when I'm ordering delivery and visiting.  ", "Admittedly, I wouldn't trek across the city to go here because there are many other great Chinese places in other parts of the City ", "(San Tung was my favorite when I lived over in the Inner Sunset), "], "author": "Chris P.", "review": "I've been getting take out from here since I moved into the 'hood like 3 years ago - I've never been disappointed.  I mostly get delivery, but, I've also eaten in a few times.  Admittedly, the dim sum items could use a little bit of work - but, they get some credit back for offering them anytime of day.  I love their seafood, vegetarian, and \"chef's special\" dishes.  Their mu shu and chow mein are some of the best I've had - they are my favorites.  And their hot and sour soup also passes my test - a bit more sour than hot, so I sometimes add a wee bit of hot sauce.  However, sometimes I ask them to make it hot and they always happily oblige.  Also, they are ridiculously nice and lovely people, both when I'm ordering delivery and visiting.  Admittedly, I wouldn't trek across the city to go here because there are many other great Chinese places in other parts of the City (San Tung was my favorite when I lived over in the Inner Sunset), BUT, if you're in the hood, this is really good.\n\nHowever, please don't try and compare this place to Eric's or Alice's - those two places put a California twist on their dishes that Jasmine doesn't even try (and sometimes that California twist FAILS MISERABLY, in my opinion).  But, for straight ahead Chinese food, I've never gone wrong here.", "rating": 4, "date": "2008-08-06"}, {"excerpts": ["Get two entrees and get a free chow mein. ", "This is the only place I order from when I want Chinese. ", "Great for veggies...the fake meat is perfect."], "author": "Suzanne R.", "review": "Delish! And very cheap. Get two entrees and get a free chow mein. This is the only place I order from when I want Chinese. Great for veggies...the fake meat is perfect.", "rating": 5, "date": "2007-03-01"}, {"excerpts": ["Since I ordered two or more entrees I got my choice of free fried rice or chow mein.  ", "I went with the chicken chow mein.\n\n", "The chow mein was bland and tasteless.  ", "I had to add pepper and chili sauce to eke any modicum of flavor out of it.  ", "The green beans were the same.  ", "Now I'm no super chili eater, but the green beans are listed on the menu as spicy, and I didn't get even a tingle.  ", "Price with tax was less than $8 per dish, plus free chow mein.  ", "I will try them once more for their vegetarian dishes, as I love chinese vegetarian food."], "author": "Chris C.", "review": "*Edit* I must revise my take on the green beans.  They were bland at first, but it turns out all the sauce was at the bottom of the carton.  After a few days the beans at the bottom were soggy but delicious!  Upgrade to 4 stars.\n\n---------------\n\nSome hits, some misses here.  I ordered delivery because I was sick as a dog and couldn't cook or go out to eat.  I was craving chinese food for some strange reason, especially since I grew up eating mostly chinese food and don't go for it much these days.  Call it delerium.\n\nIn any case, I ordered a mix of four items, planning on living off the leftovers for a few days while I recuperate.  I had the mu shu chicken, general tso's chicken, dried sauteed green beans, and fish balls and seaweed soup.  Since I ordered two or more entrees I got my choice of free fried rice or chow mein.  I went with the chicken chow mein.\n\nThe misses first.  The chow mein was bland and tasteless.  I had to add pepper and chili sauce to eke any modicum of flavor out of it.  The green beans were the same.  Now I'm no super chili eater, but the green beans are listed on the menu as spicy, and I didn't get even a tingle.  It had less kick than a jar of Tostito's medium salsa.\n\nNow the hits.  The general tso's chicken was very flavorful and still crunchy under all that sweet and vinegary sauce.  It could've been spicier however.  The soup was delicious.  Good flavor of seaweed mixed in with fresh fish balls.  My only complaint is too much egg flower and corn starch.  The mu shu chicken had good flavor as well, though the filling was very watery and soggy, causing most of my wraps to burst open as I was trying to eat them.\n\nAll in all an ok experience for the price.  Price with tax was less than $8 per dish, plus free chow mein.  I will try them once more for their vegetarian dishes, as I love chinese vegetarian food.", "rating": 4, "date": "2008-08-23"}, {"excerpts": ["Free fried rice or chow mein with every entree, too. ", "So good. ", "(I love the five flavors chicken, but the meatless stuff is just as supremely edible.)"], "author": "Erin B.", "review": "This is, by far, the best delivery Chinese I've found in the city. Free fried rice or chow mein with every entree, too. So good. (I love the five flavors chicken, but the meatless stuff is just as supremely edible.)", "rating": 4, "date": "2006-12-21"}, {"excerpts": ["I particularly like the crab puffs, General Tsao's chicken, Budda's Veggie Delight, and the fact that you get free Chow Mein or Fried Rice if you order two entrees. ", "Yeah, it's a little greasy, but it's kinda good greasy, if you know what I mean."], "author": "Emmabelle S.", "review": "I like this place because it's fast and delivers to the Mission and it's consistent. No it's not the best Chinese food I've ever had, but I generally don't expect that with a 40-minute delivery. I particularly like the crab puffs, General Tsao's chicken, Budda's Veggie Delight, and the fact that you get free Chow Mein or Fried Rice if you order two entrees. Yeah, it's a little greasy, but it's kinda good greasy, if you know what I mean.", "rating": 3, "date": "2008-01-14"}, {"excerpts": ["free chow mein with delivery ", "i take that , they were actually good , dim sum were nice and warm but not much in , 3 stars for a quick delivery ", "but i dont know about bill clinton"], "author": "NAEL K.", "review": "very fast delivery , food is pretty decent  maybe i ordered the wrong things that day , general tsao chicken szechuan beef , both deepfried wish i knew that couldnt taste the quality of the meat at all. free chow mein with delivery i take that , they were actually good , dim sum were nice and warm but not much in , 3 stars for a quick delivery but i dont know about bill clinton", "rating": 3, "date": "2010-05-19"}, {"excerpts": ["JTH also gives you the same free chow mein deal.  ", "so i'm a semi regular now, just skip the dim sum and the \"fancy\" dishes and go for the spicy eggplant."], "author": "fletcher s.", "review": "i posess an invincible digestive system, except for pints of milk. i ate here, it was ok, until i got a horrible rash over my face and back. allergic reactions like that are a sign of gross negligence. the ostrich is probably dog.\n\nEdit: after that first experience it was a while until i went back, frequenting wild pepper instead.  but wild pepper is a whole bunch of  blocks away, and the tea house is within sight of my doorstep, so i gave it another go. the lunch specials are quite cheap, and much less greasy than wild pepper. JTH also gives you the same free chow mein deal.  so i'm a semi regular now, just skip the dim sum and the \"fancy\" dishes and go for the spicy eggplant.", "rating": 3, "date": "2006-08-29"}, {"excerpts": ["to add to the disappointment, got the free chow mein when i ordered the free fried rice. ", ":("], "author": "K K.", "review": "wow. no bueno. tried this place twice now...ordering different things, the \"chef's specials\" even. meh. to add to the disappointment, got the free chow mein when i ordered the free fried rice. :(", "rating": 1, "date": "2011-02-14"}, {"excerpts": ["the General's Tso's Chicken, the chow mein, the veggie potstickers and the hot and sour soup.  ", "I've never done takeout ", "so I couldn't tell you about that but ", "in general it really doesn't matter which restaurant you order takeout from the food will never taste the same as when you order to eat in because by the time the food gets to you since its in a container the temperature from the hot food continues to cook the food so the taste of the food is compromised. ", "SO.... this place is great. ", "I don't understand some of the negative reviews but then again everyone has different taste.  ", "But I have great taste ", "so I give this place 4 stars. ", "Check it out you won't be disappointed."], "author": "M R.", "review": "The service is great and the Basil Chicken is awesome as well as the General's Tso's Chicken, the chow mein, the veggie potstickers and the hot and sour soup.  I've never done takeout so I couldn't tell you about that but in general it really doesn't matter which restaurant you order takeout from the food will never taste the same as when you order to eat in because by the time the food gets to you since its in a container the temperature from the hot food continues to cook the food so the taste of the food is compromised. SO.... this place is great. I don't understand some of the negative reviews but then again everyone has different taste.  But I have great taste so I give this place 4 stars. Check it out you won't be disappointed.", "rating": 4, "date": "2009-12-05"}, {"excerpts": ["i'm so glad that i did, because:  the vegetarian eggrolls were amazing, the entrees were amazing, and did you know they have a coupon online somewhere for free chow mein if you get two or more other entrees?  ", "just perhaps, if you were planning on ordering the seafood chow mein, and ask if their free chow mein can have seafood added to it, they will say yes (maybe) and it will maybe taste bland to you, but the person who ordered it will enjoy it a lot.  ", "just perhaps."], "author": "Puck F.", "review": "i found yelp the other day searching for reviews of chinese places, and decided on jasmine.  i'm so glad that i did, because:  the vegetarian eggrolls were amazing, the entrees were amazing, and did you know they have a coupon online somewhere for free chow mein if you get two or more other entrees?  just perhaps, if you were planning on ordering the seafood chow mein, and ask if their free chow mein can have seafood added to it, they will say yes (maybe) and it will maybe taste bland to you, but the person who ordered it will enjoy it a lot.  just perhaps.", "rating": 5, "date": "2006-08-23"}, {"excerpts": ["And why would I when they deliver AND if you order 2 entrees, they throw in a free chow mein or fried rice dish? ", "Uh, yeah! ", "So my decision to call in an order one night when it was pouring rain was well well worth it. ", "Besides the delicious ostrich, I had an order of Happy Buddha - a cornucopia of veggies, fried tofu and mock chicken. ", "The mock chicken was so good, I got confused for a second and thought I had ordered 2 meat dishes. ", "The other notable in my order? ", "Wor ", "Won Ton soup! ", "I don't know if the cold pouring rain made the delectable concoction of wonton, slices of pork and fresh veggies all the more enjoyable but it was the perfect prescription for the wet weather blues."], "author": "ray e.", "review": "One word: Ostrich. Yes, you heard right - ostrich. Basil Ostrich in fact. It tastes like tender, juicy but not as salty beef. But it's ostrich. Anyway, besides ostrich and frog legs, Jasmine Tea House has other standard fare. Though most dishes I've tried were on the bland side, nothing that your own spicing up won't remedy. Oh, and I say your own because I've never eaten at the actual restaurant. And why would I when they deliver AND if you order 2 entrees, they throw in a free chow mein or fried rice dish? Uh, yeah! So my decision to call in an order one night when it was pouring rain was well well worth it. Besides the delicious ostrich, I had an order of Happy Buddha - a cornucopia of veggies, fried tofu and mock chicken. The mock chicken was so good, I got confused for a second and thought I had ordered 2 meat dishes. The other notable in my order? Wor Won Ton soup! I don't know if the cold pouring rain made the delectable concoction of wonton, slices of pork and fresh veggies all the more enjoyable but it was the perfect prescription for the wet weather blues.", "rating": 4, "date": "2008-02-07"}, {"excerpts": ["The pot stickers are a great appetizer and even the fried rice and chow mein noodles are top notch."], "author": "David M.", "review": "The real name of this restaurant is The Jasmine Tea house but some friends and I prefer to call it Clinton's Chinese because of the multiple plaques and newspaper articles in the entrance proclaiming it was Bill Clinton's favorite Chinese restaurant in SF.  Haha --- that is some funny shi-at...  But, anyway, almost every dish is great here.  They even have Ostrich.  The pot stickers are a great appetizer and even the fried rice and chow mein noodles are top notch.", "rating": 4, "date": "2006-06-19"}], "chow fun": [{"excerpts": ["Order either the beef chow fun or honey walnut shrimp."], "author": "Jacky Z.", "review": "Jasmine tea house is my new go-to for Chinese food. The  service is really nice and the food is the best. Definitely make sure to check them out whenever you are in SF! Order either the beef chow fun or honey walnut shrimp.", "rating": 5, "date": "2017-11-04"}, {"excerpts": ["Ordered the wonton soup for tonight, the chow fun noodles for my lunch tomorrow. ", "Just barely covered the minimum for delivery. ", "Under $20 for two meals, big meals actually, including the delivery, taxes, fees, etc. ", "Simply can't beat that. "], "author": "Sean B.", "review": "I absolutely never would have suspected that this was going to be a five-star review. Truth be told, my stomach's been upset the last two days (I'll spare you the gory details) and I just came home, put on sweatpants, and got on Foodler to order soup, since I wasn't feeling up to going out at all.\n\n$15 minimum (low) and no delivery fee? Score. Ordered the wonton soup for tonight, the chow fun noodles for my lunch tomorrow. Just barely covered the minimum for delivery. Under $20 for two meals, big meals actually, including the delivery, taxes, fees, etc. Simply can't beat that. As long as the food is good.\n\nThe wonton soup was outstanding. Tons of noodles, tons of shrimp, they really didn't skimp. Impressive, really. Joseph, the delivery driver, was very sweet, and even though his map program screwed him up and sent him to the wrong place (happened to me too with my own home address, don't know what's up with Google maps), he was still in good spirits and pleasant when he arrived.\n\nThis is my new go-to Chinese food delivery place for when I'm lazy. Which is, clearly, often.", "rating": 5, "date": "2014-10-16"}, {"excerpts": ["Ordered the peking duck, general tsao chicken and chow fun.\n\n"], "author": "Andrew E.", "review": "Ordered the peking duck, general tsao chicken and chow fun.\n\nAll of these items are what you'd expect from an \"americanized\" chinese restaurant. \nNot totally authentic chinese cuisine, as they have a mix of both american and real chinese dishes, but definitely hits the spot if you want something quick and convenient. A bit on the pricey end for chinese food, but there are definitely worse options in the mission.", "rating": 3, "date": "2015-10-02"}, {"excerpts": ["Very disappointed in the seafood chow fun and shrimp fried rice that I ordered this evening.  ", "Both dishes were lacking in seafood and flavor, and the chow fun was overly greasy.  ", "I also don't like how their hot and sour soup lacks strips of pork.  ", "It would also benefit from additional white pepper."], "author": "Monica O.", "review": "Very disappointed in the seafood chow fun and shrimp fried rice that I ordered this evening.  Both dishes were lacking in seafood and flavor, and the chow fun was overly greasy.  I also don't like how their hot and sour soup lacks strips of pork.  It would also benefit from additional white pepper.", "rating": 2, "date": "2016-02-19"}, {"excerpts": ["I love their Seafood Chow Fun, their Happy Buddha, and I'm especially fond of any Chinese restaurant that serves tasty dim sum as an appetizer. "], "author": "Erin M.", "review": "My boyfriend and I go through phases when it comes to good restaurants. We just can't stay away. We decide to go out for dinner, and somehow, we always end up back in the same spot we were the week before.\n\nWe had our phase with Jasmine Tea house about 6 months ago. I love their Seafood Chow Fun, their Happy Buddha, and I'm especially fond of any Chinese restaurant that serves tasty dim sum as an appetizer. We brought friends, and it was even Chinese-Friend-Lynn-Approved (CFLA). \n\nAnyway, long story short- Our Jasmine Tea house phase came to a close, and we moved on to Murasaki across the city. Today we decided to stop back in, on a whim... And it was just how I remembered it. Excellent food, excellent service, excellent price. I even discovered a new dish that I just love: Sesame beef (substitute vegetarian chicken and its veggie-friendly). \n\nOne last positive note on Jasmine Tea house: They are always so kind. One time I was taking my boyfriend on a surprise picnic with Jasmine food, and they packed to-go tea at my request. Today, in my clumsiness, I knocked over a glass of water, spilling everywhere. Instead of acting annoyed, the waitress fervently sopped up the mess and even refilled my glass!!!\n\nIn conclusion... Although our Jasmine Tea House fixation has come to a close, it will always have a place in my heart....", "rating": 5, "date": "2007-10-07"}, {"excerpts": ["General Tsao's Chicken, Szechuan Beef, and House Spicy Chow Fun, and every single dish was borderline disgusting.  ", "It also made me physically ill.  ", "The noodles were okay, I guess, if congealed and dripping with oil.  ", "But the General Tsao's and Szechuan Beef were virtually identical as far as I could tell -- deep fried to all hell, soaked in a vat of corn starch, syrup, and MSG, and then sprinkled with two slightly different flavor dusts.  ", "They were virtually inedible.  "], "author": "Bill S.", "review": "I am completely awestruck by the positive reviews for this place.  I ordered (take-out) General Tsao's Chicken, Szechuan Beef, and House Spicy Chow Fun, and every single dish was borderline disgusting.  It also made me physically ill.  The noodles were okay, I guess, if congealed and dripping with oil.  But the General Tsao's and Szechuan Beef were virtually identical as far as I could tell -- deep fried to all hell, soaked in a vat of corn starch, syrup, and MSG, and then sprinkled with two slightly different flavor dusts.  They were virtually inedible.  I threw it all out.  \n\nI mean, I realize we're in the Mission and there's no actual Chinese food here, but this was just gross -- like a good 117 steps below Panda Express.  How anyone could give this place four or five stars is totally beyond me -- have y'all been suffering lifetime imprisonment in leg irons with nothing to eat but stale gruel?", "rating": 1, "date": "2009-07-10"}, {"excerpts": ["The only thing I have been disappointed with has been the Seafood Chow Fun.   "], "author": "Jack C.", "review": "My vegetarian friends LOVE the Meatless Chicken dish.   I think it is called the Happy Buddha.\n\nI love and have never been disappointed by:\nPork Siu Mai\nPork Pot Stickers\nDeep Fried Oysters\nSzechwan Beef\nANY fried rice\nI have had a few of the Eggplant dishes and loved them.   Forget which though.   :)\n\nThe only thing I have been disappointed with has been the Seafood Chow Fun.   It is very tasty and has some great seafood in it but is very soupy.\n\nFree delivery is available for lunch and dinner within the delivery area. Order 2 entrees and get free fried rice or chow mein (a choice of pork, chicken, beef or vegetable). $10 Minimum for credit card orders.\n\nSay Hi to Frank for me!", "rating": 5, "date": "2009-03-03"}, {"excerpts": ["Favorite dishes: chow fun, Chinese broccoli. ", "I also like to order off the menu (like at most Chinese restaurants, they accommodate everything). "], "author": "kathy c.", "review": "C'mon, we all like Americanized Chinese food sometimes...\n\nI just moved to the neighborhood and have been on the lookout for my go to neighborhood Chinese restaurant. Thanks to Jasmine Tea, my search is over!\n\nDelivery: they came within 40-50 minutes as promised. Only catch is that they don't automatically provide rice with the order (how weird is that?). After we realized this, they quickly reappeared. \n\nDining In: has a homey feel. The owners and staff have their own dining area that is separated with a partition, and there are sounds of Cantonese mixed with other dialects coming from the kitchen. The service was friendly and prompt. We were the last table of the night and didn't feel rushed at all. My boyfriend actually forgot his credit card, and when we called the next day, they were very friendly and understanding. \n\nFavorite dishes: chow fun, Chinese broccoli. I also like to order off the menu (like at most Chinese restaurants, they accommodate everything). Their menu seems sparse,  but they have it all... not to mention rave reviews from President Clinton. \n\nI would give Jasmine Tea 5 stars, but rice doesn't automatically come with the entrees! It's still my favorite Chinese restaurant in SF so far.", "rating": 4, "date": "2007-01-20"}, {"excerpts": ["I had the\nChicken Chow Fun yesterday at lunch and it was WON DER FUL! ", "I won't do the delivery again ", "but I will return and eat in. ", "The 4 stars are for\ndining in. ", "2 stars for delivery."], "author": "Cindy J.", "review": "I've eaten in twice and had delivery once. The delivered food was very \nblah. The two times I have dined in the restaurant I was very happy. The\nservice was outstanding and the place is clean and well kept. I had the\nChicken Chow Fun yesterday at lunch and it was WON DER FUL! I won't do the delivery again but I will return and eat in. The 4 stars are for\ndining in. 2 stars for delivery.", "rating": 4, "date": "2007-05-20"}, {"excerpts": ["The other night, I got the chow fun with beef, and as often is the case with Chinese restaurants, the beef was super tender, but also lacking in flavor.  ", "This, I don't understand.  "], "author": "Ken Y.", "review": "I've gotten takeout and dine-in from this place a couple more times, and regrettably, I have to ding them a star.  The other night, I got the chow fun with beef, and as often is the case with Chinese restaurants, the beef was super tender, but also lacking in flavor.  This, I don't understand.  What happens to the beef that deprives it of both texture and flavor??\n\nAnother time, I got the Hong Kong Style Noodles, delivered, and I was appalled by how greasy the thing was.  On the other hand, they were HK noodles, so really, I can't complain too much here.", "rating": 3, "date": "2010-02-15"}, {"excerpts": ["I ordered tofu chow fun and it did not taste like anything.  ", "No smoky wok flavor, no sharp scallions, no nothing.  ", "It was so bland that I wondered if they used brown food coloring to make the noodles have color.  "], "author": "Dana H.", "review": "So I really did not feel like leaving the house, and I had read on Yelp that these guys deliver.  The delivery went smoothly and the guy showed up pretty quickly - that is the end of the good stuff.  \n\nI ordered tofu chow fun and it did not taste like anything.  No smoky wok flavor, no sharp scallions, no nothing.  It was so bland that I wondered if they used brown food coloring to make the noodles have color.  I knew that it could not have been from any type of sauce or seasoning.  \n\nI also ordered the house special ginger chicken.  Perhaps it was my fault for thinking it was the version with poached chicken and a delicious fresh green onion and ginger sauce on the side.  Their version was gloppy and made from pickled ginger (yeah, the kind that comes on the side of your sushi).  The fact that a Chinese restaurant was not using fresh ginger was telling that this place is both bland and dumbing down the flavor for their customers.  I will not be going back or ordering in again.", "rating": 1, "date": "2008-08-01"}, {"excerpts": ["So you can get the basil ostrich and the garlic spinach (both highly recommended), and they'll throw in a free order of beef chow fun. ", "Yowza! "], "author": "Ess D.", "review": "One of our delivery stand-bys, but it's also pleasant to eat at, disproving the general rule that good Chinese restaurants have to have a noisy, chaotic ambiance. \n\nVegi dishes count as entrees. For delivery, two entrees = one free order of fried rice or chow mein/fun. So you can get the basil ostrich and the garlic spinach (both highly recommended), and they'll throw in a free order of beef chow fun. Yowza! What's with the folks calling it pricey?\n\nJasmine is far less greasy than most of the nearby Chinese places; you can get yucky sweet & sour whatever, but that's your own fault for ordering something predestined to be cloying. If you're dining there, they have a well thought-out tea selection and interesting dim sum. Shrimp/banana roll? Why not?", "rating": 4, "date": "2008-09-22"}, {"excerpts": ["The chow fun is very tasty.  "], "author": "Candice M.", "review": "I absolutely love this place.  Its subtle exterior definitely does not do it justice.  One might easily pass by on Mission Street and never notice what lies behind the doors.  Inside, you will find an ambiance that is simple and understated.  Its the food and the service that I really can't say enough about here.  The great thing is that dim sum is available throughout the day, you can even have it at night.  The chow fun is very tasty.  The sizzling rice soup is very flavorful.  I really love the dim sum here and the shanghai dumplings are great.   I always feel like I get great service here and since I come here often, I am familiarly greeted which is nice.  A big thumbs up here!", "rating": 5, "date": "2007-05-31"}, {"excerpts": ["Due to a noodle emergency the other night (as in I needed some chow fun STAT), we found out JTH makes very authentic, Hong Kong-style noodles here. ", "Hurray!! ", "Now I don't have to go all the way to Chinatown just to get me some delicious beef chow fun or pan-fried noodles Hong Kong style."], "author": "Angi C.", "review": "Guess what? Due to a noodle emergency the other night (as in I needed some chow fun STAT), we found out JTH makes very authentic, Hong Kong-style noodles here. Hurray!! Now I don't have to go all the way to Chinatown just to get me some delicious beef chow fun or pan-fried noodles Hong Kong style.", "rating": 4, "date": "2009-06-18"}, {"excerpts": ["Spicy pork is good and I love the chicken chow fun.  ", "Try ordering a \"combination\" when you order for the first time.  ", "If you are hungry, get the \"I dont want to cook today.\"  ", "It comes with two entrees, white rice, soup and two rolls for like nine bucks.  ", "Not a bad deal and the delivery is free.  ", "Damn, I'm getting hungry."], "author": "Mr. G.", "review": "Great for delivery.  I live nearby and they usually take about 30 min to deliver, or are always on time if I walk over to pick it up.  Spicy pork is good and I love the chicken chow fun.  Try ordering a \"combination\" when you order for the first time.  If you are hungry, get the \"I dont want to cook today.\"  It comes with two entrees, white rice, soup and two rolls for like nine bucks.  Not a bad deal and the delivery is free.  Damn, I'm getting hungry.", "rating": 4, "date": "2006-01-29"}], "singapore noodles": [{"excerpts": ["Many of the dishes are huge (Singapore noodles are about 4 meals in one). ", "Walnut shrimp are so tasty but covered in an unusually large amount of fried batter - beware."], "author": "E T.", "review": "Very good Chinese, with an extensive menu. Many of the dishes are huge (Singapore noodles are about 4 meals in one). Walnut shrimp are so tasty but covered in an unusually large amount of fried batter - beware.", "rating": 4, "date": "2012-09-24"}, {"excerpts": ["also, the singapore noodles here are delicious, the wait staff is awesome and they deliver to my home and always throw in extra free food!  ", "plus, it's super cheap!  ", "i love jasmine tea house!  ", "oh yes and this is the place that bill clinton gets his delivery from when he is in town.  ", "and you are not cooler than bill clinton."], "author": "Laura B.", "review": "jasmine tea house has the absolute best fake chicken in all of san francisco.  you have to ask for the sesame fake chicken.  trust me.  my carnivore friends like it even better than real chicken (and they are not just scared of me and saying that because they know i am crazy and will cut a ho!) and my dad couldn't tell the difference!  it really is the taj mahal of fake meats.  or something.  also, the singapore noodles here are delicious, the wait staff is awesome and they deliver to my home and always throw in extra free food!  plus, it's super cheap!  i love jasmine tea house!  oh yes and this is the place that bill clinton gets his delivery from when he is in town.  and you are not cooler than bill clinton.", "rating": 5, "date": "2005-12-11"}], "hong kong style noodles": [{"excerpts": ["Another time, I got the Hong Kong Style Noodles, delivered, and I was appalled by how greasy the thing was.  ", "On the other hand, they were HK noodles, so really, I can't complain too much here."], "author": "Ken Y.", "review": "I've gotten takeout and dine-in from this place a couple more times, and regrettably, I have to ding them a star.  The other night, I got the chow fun with beef, and as often is the case with Chinese restaurants, the beef was super tender, but also lacking in flavor.  This, I don't understand.  What happens to the beef that deprives it of both texture and flavor??\n\nAnother time, I got the Hong Kong Style Noodles, delivered, and I was appalled by how greasy the thing was.  On the other hand, they were HK noodles, so really, I can't complain too much here.", "rating": 3, "date": "2010-02-15"}, {"excerpts": ["Their noodles are great (try the Hong Kong style noodles!) and their \"faux\" chicken entrees are excellent.  ", "Coming from a meat lover like myself, that's saying a lot.  "], "author": "Sharyn F.", "review": "If you live in the Upper Noe/Bernal Heights area, you gotta check this place out.  This is our \"standard\" Chinese takeout place and it's perfect for a family like ours with both meat eaters and vegetarians.  Their noodles are great (try the Hong Kong style noodles!) and their \"faux\" chicken entrees are excellent.  Coming from a meat lover like myself, that's saying a lot.  Eric's and Alice's don't compare to this place.\n\nUpdated 2/25/07:  I don't know if it's just me, but the food here seems to have taken a dive of late.  I've not been happy with the dinners I've had delivered the last few times so I'm removing one star.  I'm thinking about finding another place for Chinese delivery, but will probably give Jasmine Tea House one last shot.", "rating": 3, "date": "2006-12-20"}], "house special noodle soup": [{"excerpts": ["If I knew my next meal would be my last before leading this planet, I would have a very hard time choosing between Jasmine's House Special Noodle Soup and their General Tsao's Chicken. ", "If you're local, delivery is SUPER FAST, as well."], "author": "David K.", "review": "Jasmine Tea House is both a neighborhood gem and worth a visit even if you don't live in the neighborhood. Everything is good -- really good; the service is fast and friendly; and the prices cannot be beat. If I knew my next meal would be my last before leading this planet, I would have a very hard time choosing between Jasmine's House Special Noodle Soup and their General Tsao's Chicken. If you're local, delivery is SUPER FAST, as well.", "rating": 5, "date": "2015-02-28"}], "house spicy chow mein": [{"excerpts": ["Other notable dishes include the Szechwan Beef, Scallops with Garlic Sauce, and the House Spicy Chow Mein.\n\n"], "author": "Francis A.", "review": "There are so many good dishes at this restaurant. My favorite is the Wor Wonton Soup. It probably has something to do with the seasoning of the beef, chicken, pork and prawn sauté that is mixed into the soup, but the broth has so much more flavor than the traditional clear vegetable/chicken stock found in most wonton soups. Other ingredients that can be found in the soup include carrots, baby bok choi, snow peas and mushrooms. If you like busy dishes, this is definitely a winner. \n\nI am a big fan of Generals Chicken and I have only been to a few places that use all white meat chicken chunks compared to the KFC popcorn style chicken pieces used at most Chinese restaurants. Here it is served with big pieces of tender chicken, covered with a crispy shell. \n\nOther notable dishes include the Szechwan Beef, Scallops with Garlic Sauce, and the House Spicy Chow Mein.\n\nI also liked the following vegetable dishes; chinese broccoli with oyster sauce, garlic spinach, garlic eggplant, and the baby bok choi in garlic sauce.", "rating": 4, "date": "2010-08-11"}], "mango beef lunch special": [], "general tsos chicken lunch special": [], "lemon chicken lunch special": [], "hunan lamb lunch special": [{"excerpts": ["I was already pretty full and still had to devour their wonderful hunan lamb lunch special and sweet & sour pork lunch special (which came in surprisingly sturdy plastic ware sets instead of the usual chinese takeout cardboard boxes).  ", "I was curious about the korean chicken wings because I absolutely love joe's excellent chinese cuisine version and it tasted different from joe's but was just as good with a crunchier batter over the  wings, kind of pricey with 11 wings for $11 ", "but still, I felt satisfied.  ", "The dishes are as another reviewer wrote mainly ABC food (american born chinese) tasting food like joe's.  ", "The dishes came in good time in only 25 min after ordering online from their website.  ", "They give you more than enough of a generous serving to make you full, which to me is the main reason, as well as giving you tasty food, for a restaurant to exist.  ", "Over all, the dishes were excellent and yes, I would order for delivery from here again."], "author": "Frugal C.", "review": "I'm in the excelsior in sf and we have LOTS of chinese places here, but few are any that good, especially when it comes to delivery.  I ordered mine today around 1pm, attracted by the lunch special prices and the yelp reviews and I can say I was NOT disappointed.  As one reviewer wrote, the shrimp dumplings were of high quality with thin sleek dumpling shells even if they were small.  I was already pretty full and still had to devour their wonderful hunan lamb lunch special and sweet & sour pork lunch special (which came in surprisingly sturdy plastic ware sets instead of the usual chinese takeout cardboard boxes).  I was curious about the korean chicken wings because I absolutely love joe's excellent chinese cuisine version and it tasted different from joe's but was just as good with a crunchier batter over the  wings, kind of pricey with 11 wings for $11 but still, I felt satisfied.  The dishes are as another reviewer wrote mainly ABC food (american born chinese) tasting food like joe's.  The dishes came in good time in only 25 min after ordering online from their website.  They give you more than enough of a generous serving to make you full, which to me is the main reason, as well as giving you tasty food, for a restaurant to exist.  Over all, the dishes were excellent and yes, I would order for delivery from here again.", "rating": 5, "date": "2014-08-31"}], "garlic chicken lunch special": [], "sesame chicken lunch special": [], "spicy basil chicken lunch special": [], "mongolian beef lunch special": [], "kung pao chicken lunch special": [{"excerpts": ["I ordered their Kung pao chicken lunch special (comes with rice & hot/sour soup), pot stickers & crab ragoon. ", "Really good!!"], "author": "heather m.", "review": "Ordered lunch today because I have a cold and I swear their hot & sour soup is a cure all. I ordered their Kung pao chicken lunch special (comes with rice & hot/sour soup), pot stickers & crab ragoon. Really good!!", "rating": 5, "date": "2013-12-16"}], "sweet and sour chicken lunch special": [], "cashew chicken lunch special": [], "salted string bean lunch special": [], "broccoli with beef lunch special": [], "vegetable delight lunch special": [], "kung pao tofu lunch special": [], "mapo tofu lunch special": [], "garlic eggplant lunch special": [{"excerpts": ["We also ordered the garlic eggplant lunch special to split between three of us. ", "The waitress was nice enough to give us three soups instead of the single one that comes with it when she guessed we were going to be splitting it. ", "The eggplant sauce itself was quite sweet, but otherwise cooked decently."], "author": "Stephen C.", "review": "This review concerns the dim sum. We ordered the dim sum combination plate (shrimp dumplings, pork dumplings, and steamed bbq pork buns) as well as the chive dumplings and the steamed tofu roll. Everything was completely unimpressive, but not terrible tasting as to make it hard to eat. The first clue should have been that I was the only Asian customer in the entire place. But the food is passable for what we paid for it. \n\nWe also ordered the garlic eggplant lunch special to split between three of us. The waitress was nice enough to give us three soups instead of the single one that comes with it when she guessed we were going to be splitting it. The eggplant sauce itself was quite sweet, but otherwise cooked decently.", "rating": 2, "date": "2013-12-08"}], "curry tofu lunch special": [], "mushroom with bok choy lunch special": [], "sweet and sour meatless chicken lunch special": [], "kung pao meatless chicken lunch special": [], "happy buddha lunch special": [], "spicy eggplant lunch special": [], "hunan salmon lunch special": [], "prawn with lobster sauce lunch special": [], "roast duck lunch special": [{"excerpts": ["Specific dish impressions:\n\nsteamed pork bun - quite good, worth ordering again\nhung to yeo wonton soup - terrible, the wonton soup in Henry's on Church St. is so much better\nroast duck lunch special - rather good, but a small portion\n\nOverall, Jasmine seems most useful for round the clock dim sum with easy online ordering."], "author": "Natalya E.", "review": "Good turnaround time on online carry out orders in the middle of the day.  Specific dish impressions:\n\nsteamed pork bun - quite good, worth ordering again\nhung to yeo wonton soup - terrible, the wonton soup in Henry's on Church St. is so much better\nroast duck lunch special - rather good, but a small portion\n\nOverall, Jasmine seems most useful for round the clock dim sum with easy online ordering.", "rating": 3, "date": "2015-02-19"}], "garlic fish lunch special": [], "calamari in black bean sauce lunch special": [], "prawn with snow pea lunch special": [], "noodles lunch special": [{"excerpts": ["Loved this\nNoodles Lunch Special : 2/5 . "], "author": "Rachit A.", "review": "Ordered :\nGeneral Tsao Chicken Lunch Special : 5/5. Loved this\nNoodles Lunch Special : 2/5 . Too much oil\n\nWill order again : 4/5. Yes", "rating": 4, "date": "2013-11-03"}], "fried rice lunch special": [], "sweet and sour pork lunch special": []}