{"panini toasted french roll": [], "cinnamon toast": [{"excerpts": ["Try the cinnamon toast! ", "It's soooo good. ", "Also the Kelly Gold open faced grilled cheese blew my mind and my boyfriends! ", "He actually went home the next day and tried to recreate it ", "and it just made me salivate! ", "The hot tsunami sandwich is good, but the bread is too tough so next tine ", "I'll change the bread choice ", "so I can better eat it! ", "I often eat here after a weekend run and am never disappointed. ", "It is not a cheap cafe but the atmosphere and food are worth every penny!"], "author": "Julianne O.", "review": "Omg! Try the cinnamon toast! It's soooo good. Also the Kelly Gold open faced grilled cheese blew my mind and my boyfriends! He actually went home the next day and tried to recreate it and it just made me salivate! The hot tsunami sandwich is good, but the bread is too tough so next tine I'll change the bread choice so I can better eat it! I often eat here after a weekend run and am never disappointed. It is not a cheap cafe but the atmosphere and food are worth every penny!", "rating": 4, "date": "2018-07-03"}, {"excerpts": ["Delighted with my hot chocolate and cinnamon toast- not just any cinnamon toast but a Pullman Bread cinnamon toast- ", "a thick slice of fresh toasted bread topped with brown sugar, butter and cinnamon - so simple but ", "so delicious- ", "the hot cocoa is so perfect on a brisk day. ", "My kids loved the grilled cheese sandwich - 4 thick slices of bread topped with Ooey gooey cheese- ", "so ", "delicious- ", "you know it's good when you talk about the food days after! ", "A visit to ocean beach requires a stop at Java Beach cafe! ", "Sit and smell the ocean breeze."], "author": "Michelle B.", "review": "Delighted with my hot chocolate and cinnamon toast- not just any cinnamon toast but a Pullman Bread cinnamon toast- a thick slice of fresh toasted bread topped with brown sugar, butter and cinnamon - so simple but so delicious- the hot cocoa is so perfect on a brisk day. My kids loved the grilled cheese sandwich - 4 thick slices of bread topped with Ooey gooey cheese- so delicious- you know it's good when you talk about the food days after! A visit to ocean beach requires a stop at Java Beach cafe! Sit and smell the ocean breeze.", "rating": 5, "date": "2015-12-29"}, {"excerpts": ["The cinnamon toast is great for the post party days when the stomach ain't doing so hot. \n\n"], "author": "Jeremy R.", "review": "This is my slightly-out-of-the-way-but-worth-it spot to go to for a cup of coffee or even a decent lunch. Let me say that I totally think the place is slightly overrated and the staff could use some customer service lessons, yet somehow the place still keeps me coming back. \n\nThe food is always great, and how could it not be. They make it right when you order it. The cinnamon toast is great for the post party days when the stomach ain't doing so hot. \n\nThe coffee? So many to choose from (but totally overpriced) and you pour it yourself, so feel free to make yourself a hazelnut Colombian french press caffeinated dream escape and go power walk the beach on your Bluetooth. That way I can sit on the beach and vote \"Bluetooth or crazy\" with my friends and have something better to do hung over. \n\nI digress.  This place is marvelous regardless. Disregard all the unusual amounts of pretentiousness and drive away into the sunset.", "rating": 4, "date": "2012-08-03"}], "assorted bagels toasted": [], "veggie bagel": [{"excerpts": ["My husband thought his hummus veggie bagel sandwich was okay.\n\n"], "author": "Barnali D.", "review": "We popped in for late morning coffee and bagels, and had a pleasant experience.  Good food, friendly  service (you order and pick up at the counter), and nice outdoor seating.\n\nOur Americanos were decent, and I enjoyed my bagel sandwich with pesto cream cheese, lettuce, and tomato.  My husband thought his hummus veggie bagel sandwich was okay.\n\nWe ordered at the counter, and found the staff friendly.  We had to pick up our food and drinks at the counter, and everything was ready quickly.\n\nWe came on a sunny Sunday morning, and enjoyed sitting at one of the outside tables.  It was quite pleasant.\n\nOverall, this was a lovely spot for a casual meal.", "rating": 4, "date": "2018-10-14"}, {"excerpts": ["I had their hummus veggie bagel ", "and it was so good and a big portion. ", "If I am around this area in the city I would drop by again and try their baked goods. ", "They had a great variety of coffee as well. ", "I felt service was efficient even while having a crowd."], "author": "Daniela B.", "review": "A great little place we went on a whim. They had great breakfast choices ie many bagel sandwiches. My bf had their lox cream cheese bagel and it was really tasty. I had their hummus veggie bagel and it was so good and a big portion. If I am around this area in the city I would drop by again and try their baked goods. They had a great variety of coffee as well. I felt service was efficient even while having a crowd.", "rating": 4, "date": "2018-10-16"}, {"excerpts": ["Maybe it's the Ohioan in me talking, and SF is just such a big fish of inflation, but I honestly couldn't believe I paid close to $7 for a veggie bagel! ", "Don't get me wrong, it was delicious ", "and I barely had to wait, ", "but I'll just stick with coffee from now on..."], "author": "Hannah C.", "review": "Really cute place, and great location! I honestly can't complain because this place is only a 10 minute walk from my home, so I'm thankful for this quick stop on the corner. \n\nIt's my second time here, and everyone's been extremely kind and patient when I took 5 million years just to figure out what I want. I would give it 5 stars if the pricing would be a bit more reasonable. Maybe it's the Ohioan in me talking, and SF is just such a big fish of inflation, but I honestly couldn't believe I paid close to $7 for a veggie bagel! Don't get me wrong, it was delicious and I barely had to wait, but I'll just stick with coffee from now on...", "rating": 4, "date": "2018-01-17"}, {"excerpts": ["Their veggie bagel is awesome! ", "I'm not sure what type of coffee they use "], "author": "Stephanie C.", "review": "Java Beach is a must-visit for me when I'm by Ocean Beach or making a trip to the zoo. It's a cozy and casual spot to grab some breakfast and a much needed cup of coffee. Definitely has a \"locals only\" type of vibe but still very welcoming.\n\nTheir menu mostly consists of quick breakfasts like bagels and pastries but they also have a good selection of salads and sandwiches. Their veggie bagel is awesome! I'm not sure what type of coffee they use but I loved my soy latte on my last visit. \n\nService is quick and the ladies working there are really sweet. It can get extremely busy in the mornings and also on weekends - expect lines and limited seating. If you can snag a table, it's a great place to sip on coffee and catch up with a friend. \n\n*Free wifi!", "rating": 4, "date": "2014-07-21"}, {"excerpts": ["I grabbed a Pesto Veggie Bagel for around $5-6 since i thought their Salmon Lox Bagel was a tad too expensive (", "-$9 for a bagel... hmmm) ", "Anyway, I'm glad I got my pesto veggie bagel anyway because I believe it's probably the best bagel I've ever had in my entire life! ", "The first bite was pretty orgasmic, and I could not get over how good their pesto sauce was. ", "Anyway, I'm glad I got my pesto veggie bagel anyway because I believe it's probably the best bagel I've ever had in my entire life! ", "The first bite was pretty orgasmic, and I could not get over how good their pesto sauce was. "], "author": "Harriet W.", "review": "Field trip to the zoo! And no, I'm never too old for a field trip, esp to the zoo!\n\nCame here a bit too early, and i was pretty hungry, so I was browsing through yelp which would be he best cafe/restaurant for breakfast. Spotted this place, and thought, \"why not?\" \n\nI grabbed a Pesto Veggie Bagel for around $5-6 since i thought their Salmon Lox Bagel was a tad too expensive (-$9 for a bagel... hmmm) Anyway, I'm glad I got my pesto veggie bagel anyway because I believe it's probably the best bagel I've ever had in my entire life! The first bite was pretty orgasmic, and I could not get over how good their pesto sauce was. lol\n\nI wasn't hungry, but I felt like I could've stuffed more down my stomach if I could. \nKind of wish I tried their coffees too, but oh well, next time! \n\nDefinitely a great place to grab a bite if you're near the zoo!", "rating": 4, "date": "2013-04-19"}, {"excerpts": ["My most recent favorite is the veggie bagel, which includes tomatoes, cream cheese, lettuce, onions, and sprouts. ", "Though there was little too much cream cheese, it was really good! ", "As far as beverages go, I've only had the hot chocolate, which was a little dissappointing. ", "For me, a chocolate lover", ", it was a little too rich and not quiet up to par with other hot chocolates I've had. "], "author": "Alanna H.", "review": "When I'm in the neighborhood and have extra time to kill, Java Beach is the place I go to. With friendly staff and wifi, it's hard not to like this place. It's a great place to grab something quick to eat, do a little work, or just stop for a coffee. Located right across from the zoo, there's usually a crowd of people in the mornings, and seating can sometimes be hard to find. As far as parking, it's pretty easy to find parking. Sure, you may not get the parking spaces right in front, but there's still parking in the Avenues or the lots for the zoo (unless you come the first Wednesdays of the month around noon). Little bonus, there's a small bathroom if you need.\n\nUsually, I get some kinda of bagel, but I've heard all their sandwhiches are good. My most recent favorite is the veggie bagel, which includes tomatoes, cream cheese, lettuce, onions, and sprouts. Though there was little too much cream cheese, it was really good! As far as beverages go, I've only had the hot chocolate, which was a little dissappointing. For me, a chocolate lover, it was a little too rich and not quiet up to par with other hot chocolates I've had. Even though the hot chocolate's not the best, don't let that steer you away from this place.\n\nSo if you're in the area and need something to eat, come here and you won't be disappointed.", "rating": 4, "date": "2014-08-11"}, {"excerpts": ["Had the hummus veggie bagel, and the sundried tomato bagel. ", "Also awesome. ", "And, it's one of the few places that I found that has stevia as a sugar substitute, so again..... ", "Awesome ! ", "Will come back."], "author": "Alana S.", "review": "Awesome. Service was fantastic. Had the hummus veggie bagel, and the sundried tomato bagel. Also awesome. And, it's one of the few places that I found that has stevia as a sugar substitute, so again..... Awesome ! Will come back.", "rating": 5, "date": "2015-01-25"}, {"excerpts": ["I also got the Hummus Veggie bagel. ", "It had hummus, sprouts, tomato and lettuce "], "author": "M C.", "review": "Starbucks? Starbucks who? \n\nSeriously. My first time here and I am definitely coming back. I got a medium Vanilla Latte and it was perfect. Not too hot, but it didn't cool down too quickly either. I also got the Hummus Veggie bagel. It had hummus, sprouts, tomato and lettuce and it was delish. \n\nThe atmosphere is extremely friendly. Something I could get used to going to every day.", "rating": 5, "date": "2011-09-14"}, {"excerpts": ["My favorites: Veggie bagel, BBQ Chicken Sandwich, Toast with Nutella, any soup they offer...who am I kidding all the food is great, and I like trying something new when I am in there!\n\n"], "author": "Darcy W.", "review": "LOVE THIS PLACE! Java Beach by the Zoo is my favorite study spot in SF. The food is great, the coffee drinks are delicious, and when you need a sweet treat they even have swirl ice cream. I love the staff, and the area.\n\nMy favorites: Veggie bagel, BBQ Chicken Sandwich, Toast with Nutella, any soup they offer...who am I kidding all the food is great, and I like trying something new when I am in there!\n\nCheck it out ASAP!", "rating": 5, "date": "2012-11-08"}, {"excerpts": ["I also got a veggie bagel here ", "once, I just love how everything is very wholesome and healthy "], "author": "Jo G.", "review": "This is my favorite coffee shop in Cali.  The coffee and food are superb, and it's got a quaint neighborhood feel to it.  I ordered the steel cut oarmeal for bfast, it was delicious and the presentation was nice (came with raisins and brown sugar + flax).  Like I said the coffee is superb.  I also got a veggie bagel here once, I just love how everything is very wholesome and healthy (it came with hummus spread instead of fatty cream cheese, right on!), yet it still tasted awesome.\n\nI could bring my laptop and sit here all day, or just people watch sans-laptop.  Always a default pit stop for me when in SF, great place to stop by before surfing to pick up a hot coffee and snack!", "rating": 5, "date": "2011-01-04"}, {"excerpts": ["Love the coffee, love the friendly staff, delicious bfast fare (hello veggie bagel!), and sandwiches. ", "Great for kids too!"], "author": "Ce Ce M.", "review": "Love the coffee, love the friendly staff, delicious bfast fare (hello veggie bagel!), and sandwiches. Great for kids too!", "rating": 5, "date": "2013-08-27"}, {"excerpts": ["I always go for the Pesto Veggie bagel. ", "SO good. ", "Idk what they do to that pesto cream cheese ", "but it is amazing. "], "author": "Bat V.", "review": "love this place. The staff is always so nice and friendly even on crazy busy days. I live two blocks away, so whenever I forgot to go grocery shopping this is my go-to place. Their salads are delicious (Stacie's mexican salad w/Doritos.....wut). I'm a vegetarian, so I don't get sandwiches. The veggie sandwiches are a bit too cheesy for me, but that doesn't mean they are bad I just don't mix too well with large quantities of cheese. However, the bf gets the BLT every time and loves it. I always go for the Pesto Veggie bagel. SO good. Idk what they do to that pesto cream cheese but it is amazing. The other thing I'm in love with is their greek yogurt, fruit, and granola bowl.. I'm not a big fan of getting light granola bowls for breakfast(I love bread and eggs) but this is huge, and amazing!! So filling, and absolutely the best case scenario of opting out of the bagels for something healthier. Last but not least, their coffee is awesome. The bf and I have a perfect concoction: 3/4s Colombian, and 1/4 Hazelnut. Always perfect.", "rating": 5, "date": "2015-03-22"}, {"excerpts": ["After waiting in a line that went down the block, I finally made it to the cashier and placed my order: Hummus Veggie Bagel and a large coffee.  ", "When I finally got my order, it consisted only of hummus spread on a whole wheat bagel.  ", "Hmmm, I found that odd and went back to read the description of the bagel on the chalkboard menu--yup, there should have been some sprouts, lettuce, tomatoe, etc.  ", "When I asked Dalia (remember her?  ", "round faced tall-ish brunette) ", "why there weren't any veggies on my bagel, she proceeded to accuse me that I did not order any veggies.  ", "Well, I guess i MUST BE a simpleton if I assumed the Hummus VEGGIE bagel came with veggies!  ", "Should I have also specified, Dalia, that I would like some HUMMUS, as well?  ", "Well, I guess i MUST BE a simpleton if I assumed the Hummus VEGGIE bagel came with veggies!  ", "Should I have also specified, Dalia, that I would like some HUMMUS, as well?  ", "How about I mix things up and order my Hummus Veggie Bagel ON A BAGEL???  ", "I stood there a bit shell shocked, waiting for her to apologetically take my bagel and restore some normalcy to this whole situation...instead, she snapped at me and literally USED HER INDEX FINGER and pointed at me ", "and then the line and told me to get back in-line to tell the cashier that I wanted veggies.  ", "Well, considering the line at that point consists of 5+ ppl...how about NO FREAKING WAY, DALIA???  ", "How about you learn the meaning of customer service, take back my bagel, and add some sprouts with a flick of your wrist  rather than continue to waste my time????   ", "This girl's audacity was incredible.  ", "I have never met anyone in the service industry with such a huge chip on their shoulder.  ", "I had to take down her name because I was floored!  ", "I'm from NYC--ppl are always giving an I-don't-give-a-fuck-about-you kind of vibe, but even this was nothing compared to what I'm used to back at home.  ", "It felt like she was actively trying to humiliate me with all the finger pointing ", "like I was some child needing rehabilitation for my misguided food-ordering ways.  ", "If you're getting the slightest hint from this review that I'm a sensitive whiney person, I can only offer up that there was another patron  who witnessed this whole debacle and spoke to me in the back area about how inappropriate Dalia was.  ", "I couldn't agree more.  ", "Hey Dalia--", "GET ", "A NEW JOB....preferably one that doesn't require interaction with people.  ", "Maybe the Zoo across the street is hiring.", "How about I mix things up and order my Hummus Veggie Bagel ON A BAGEL???  ", "I stood there a bit shell shocked, waiting for her to apologetically take my bagel and restore some normalcy to this whole situation...instead, she snapped at me and literally USED HER INDEX FINGER and pointed at me ", "and then the line and told me to get back in-line to tell the cashier that I wanted veggies.  ", "Well, considering the line at that point consists of 5+ ppl...how about NO FREAKING WAY, DALIA???  ", "How about you learn the meaning of customer service, take back my bagel, and add some sprouts with a flick of your wrist  rather than continue to waste my time????   ", "This girl's audacity was incredible.  ", "I have never met anyone in the service industry with such a huge chip on their shoulder.  ", "I had to take down her name because I was floored!  ", "I'm from NYC--ppl are always giving an I-don't-give-a-fuck-about-you kind of vibe, but even this was nothing compared to what I'm used to back at home.  ", "It felt like she was actively trying to humiliate me with all the finger pointing ", "like I was some child needing rehabilitation for my misguided food-ordering ways.  ", "If you're getting the slightest hint from this review that I'm a sensitive whiney person, I can only offer up that there was another patron  who witnessed this whole debacle and spoke to me in the back area about how inappropriate Dalia was.  ", "I couldn't agree more.  ", "Hey Dalia--", "GET ", "A NEW JOB....preferably one that doesn't require interaction with people.  ", "Maybe the Zoo across the street is hiring."], "author": "Aimee C.", "review": "Food is good.  Coffee is good.  These two factors alone would warrant 3-4 stars.  BUT my main gripe is the service, in particular, the sandwich-maker, Dalia--young brunette girl with round face who is a serious liability to this place.  After waiting in a line that went down the block, I finally made it to the cashier and placed my order: Hummus Veggie Bagel and a large coffee.  When I finally got my order, it consisted only of hummus spread on a whole wheat bagel.  Hmmm, I found that odd and went back to read the description of the bagel on the chalkboard menu--yup, there should have been some sprouts, lettuce, tomatoe, etc.  When I asked Dalia (remember her?  round faced tall-ish brunette) why there weren't any veggies on my bagel, she proceeded to accuse me that I did not order any veggies.  Well, I guess i MUST BE a simpleton if I assumed the Hummus VEGGIE bagel came with veggies!  Should I have also specified, Dalia, that I would like some HUMMUS, as well?  How about I mix things up and order my Hummus Veggie Bagel ON A BAGEL???  I stood there a bit shell shocked, waiting for her to apologetically take my bagel and restore some normalcy to this whole situation...instead, she snapped at me and literally USED HER INDEX FINGER and pointed at me and then the line and told me to get back in-line to tell the cashier that I wanted veggies.  Well, considering the line at that point consists of 5+ ppl...how about NO FREAKING WAY, DALIA???  How about you learn the meaning of customer service, take back my bagel, and add some sprouts with a flick of your wrist  rather than continue to waste my time????   This girl's audacity was incredible.  I have never met anyone in the service industry with such a huge chip on their shoulder.  I had to take down her name because I was floored!  I'm from NYC--ppl are always giving an I-don't-give-a-fuck-about-you kind of vibe, but even this was nothing compared to what I'm used to back at home.  It felt like she was actively trying to humiliate me with all the finger pointing like I was some child needing rehabilitation for my misguided food-ordering ways.  If you're getting the slightest hint from this review that I'm a sensitive whiney person, I can only offer up that there was another patron  who witnessed this whole debacle and spoke to me in the back area about how inappropriate Dalia was.  I couldn't agree more.  Hey Dalia--GET A NEW JOB....preferably one that doesn't require interaction with people.  Maybe the Zoo across the street is hiring.", "rating": 1, "date": "2013-08-25"}, {"excerpts": ["Get the pesto veggie bagel cause its delicious & the veggie subs are always bomb. ", "The ambiance is real chill, cute and small but not too small to the point of being cramped. ", "Seems like it's almost always busy, but trust me...definitely better than the one on Judah--friendlier and prompter service. "], "author": "Alexa M.", "review": "This place is awesome! \nGet the pesto veggie bagel cause its delicious & the veggie subs are always bomb. The ambiance is real chill, cute and small but not too small to the point of being cramped. Seems like it's almost always busy, but trust me...definitely better than the one on Judah--friendlier and prompter service. It's near the beach and across from the zoo, how convenient.  \n\nGreat spot to just chill and relax for a quick and yummy bite!!", "rating": 4, "date": "2008-10-20"}, {"excerpts": ["I ordered the pesto veggie bagel and the spread is a must-have. ", "I think I could put that spread on anything "], "author": "Steph W.", "review": "Alright, so Java Beach numero dos! \n\nSo once again, me and my friend, and if you couldn't tell it's pretty much the same friend that I go with to all these places that I review (the lil stalker) minus the one I went to Frjtz & Miette. And let me just start by saying that this place's wait is 10x shorter than the one on Judah. Thank God. I didn't know if I could take waiting another 30-45 minutes for just one simple meal. The cafe would've undergone another form of sabotage..\n\nThe environment was really cute, and the outer appearance was cuter than the other one as well. It was larger, more colorful and just seemed more spacious. Workers were friendlier and actually seemed to give a shit about the food they were preparing. I ordered the pesto veggie bagel and the spread is a must-have. I think I could put that spread on anything and it would satisfy me. \n\nDilemma: Judah Java Beach or Sloat Java Beach. Without question, the one on Sloat. Not to mention it's by the zoo so you can go take a peek at those creatures there.", "rating": 4, "date": "2008-10-14"}, {"excerpts": ["So.... I am totally addicted to this spot's veggie bagel sandwiches!! ", "I can hear you all saying: \"What's so special about a veggie bagel sandwich? ", "All it is is a bagel toasted with cream cheese and some veggies on it?", "\" ", "You would THINK you could find a good one just about anywhere that serves bagel, but you would be mistaken, my friend. ", "Nope nope nope. ", "Not easy to find....at all. ", "Fluffy yummy bagel, melty gooey cheese, crispy fresh veggies..yuuuuummmers.  ", "I am telling you, no one else makes it as good as they do.  ", "In addition to these wonderful bageley treats....they also have some of the BEST coffee around. ", "I hear its all organic and fair trade too. ", "Extra bonus! ", "My boyfriend hits this spot up every day now for pastries and coffee...and it definitely out of his way (that says something right there). ", "Also, you can pull up a chair outside to enjoy your treats, and watch the people walk their pups, and I love that too. ", "I think I know what I will do this Saturday morning...."], "author": "Jenn T.", "review": "So.... I am totally addicted to this spot's veggie bagel sandwiches!! I can hear you all saying: \"What's so special about a veggie bagel sandwich? All it is is a bagel toasted with cream cheese and some veggies on it?\" You would THINK you could find a good one just about anywhere that serves bagel, but you would be mistaken, my friend. Nope nope nope. Not easy to find....at all. Fluffy yummy bagel, melty gooey cheese, crispy fresh veggies..yuuuuummmers.  I am telling you, no one else makes it as good as they do.  In addition to these wonderful bageley treats....they also have some of the BEST coffee around. I hear its all organic and fair trade too. Extra bonus! My boyfriend hits this spot up every day now for pastries and coffee...and it definitely out of his way (that says something right there). Also, you can pull up a chair outside to enjoy your treats, and watch the people walk their pups, and I love that too. I think I know what I will do this Saturday morning....", "rating": 5, "date": "2012-08-23"}, {"excerpts": ["I ordered their white mocha with a single shot and a pesto veggie bagel. ", "The white mocha was definitely better than starbucks hands down. ", "It was really sweet and does not have a strong taste of coffee. ", "The bagel was delish! ", "Toasted with pesto cream cheese and fresh veggies. ", "This was a perfect place to go especially on cold days like we did last week."], "author": "Lynn P.", "review": "I came here last week to grab a snack before meeting up with my class for a field trip at the zoo. I ordered their white mocha with a single shot and a pesto veggie bagel. The white mocha was definitely better than starbucks hands down. It was really sweet and does not have a strong taste of coffee. The bagel was delish! Toasted with pesto cream cheese and fresh veggies. This was a perfect place to go especially on cold days like we did last week.", "rating": 4, "date": "2009-12-14"}], "hummus veggie bagel": [{"excerpts": ["My husband thought his hummus veggie bagel sandwich was okay.\n\n"], "author": "Barnali D.", "review": "We popped in for late morning coffee and bagels, and had a pleasant experience.  Good food, friendly  service (you order and pick up at the counter), and nice outdoor seating.\n\nOur Americanos were decent, and I enjoyed my bagel sandwich with pesto cream cheese, lettuce, and tomato.  My husband thought his hummus veggie bagel sandwich was okay.\n\nWe ordered at the counter, and found the staff friendly.  We had to pick up our food and drinks at the counter, and everything was ready quickly.\n\nWe came on a sunny Sunday morning, and enjoyed sitting at one of the outside tables.  It was quite pleasant.\n\nOverall, this was a lovely spot for a casual meal.", "rating": 4, "date": "2018-10-14"}, {"excerpts": ["I had their hummus veggie bagel ", "and it was so good and a big portion. ", "If I am around this area in the city I would drop by again and try their baked goods. ", "They had a great variety of coffee as well. ", "I felt service was efficient even while having a crowd."], "author": "Daniela B.", "review": "A great little place we went on a whim. They had great breakfast choices ie many bagel sandwiches. My bf had their lox cream cheese bagel and it was really tasty. I had their hummus veggie bagel and it was so good and a big portion. If I am around this area in the city I would drop by again and try their baked goods. They had a great variety of coffee as well. I felt service was efficient even while having a crowd.", "rating": 4, "date": "2018-10-16"}, {"excerpts": ["Had the hummus veggie bagel, and the sundried tomato bagel. ", "Also awesome. ", "And, it's one of the few places that I found that has stevia as a sugar substitute, so again..... ", "Awesome ! ", "Will come back."], "author": "Alana S.", "review": "Awesome. Service was fantastic. Had the hummus veggie bagel, and the sundried tomato bagel. Also awesome. And, it's one of the few places that I found that has stevia as a sugar substitute, so again..... Awesome ! Will come back.", "rating": 5, "date": "2015-01-25"}, {"excerpts": ["I also got the Hummus Veggie bagel. ", "It had hummus, sprouts, tomato and lettuce "], "author": "M C.", "review": "Starbucks? Starbucks who? \n\nSeriously. My first time here and I am definitely coming back. I got a medium Vanilla Latte and it was perfect. Not too hot, but it didn't cool down too quickly either. I also got the Hummus Veggie bagel. It had hummus, sprouts, tomato and lettuce and it was delish. \n\nThe atmosphere is extremely friendly. Something I could get used to going to every day.", "rating": 5, "date": "2011-09-14"}, {"excerpts": ["After waiting in a line that went down the block, I finally made it to the cashier and placed my order: Hummus Veggie Bagel and a large coffee.  ", "When I finally got my order, it consisted only of hummus spread on a whole wheat bagel.  ", "Hmmm, I found that odd and went back to read the description of the bagel on the chalkboard menu--yup, there should have been some sprouts, lettuce, tomatoe, etc.  ", "When I asked Dalia (remember her?  ", "round faced tall-ish brunette) ", "why there weren't any veggies on my bagel, she proceeded to accuse me that I did not order any veggies.  ", "Well, I guess i MUST BE a simpleton if I assumed the Hummus VEGGIE bagel came with veggies!  ", "Should I have also specified, Dalia, that I would like some HUMMUS, as well?  ", "Well, I guess i MUST BE a simpleton if I assumed the Hummus VEGGIE bagel came with veggies!  ", "Should I have also specified, Dalia, that I would like some HUMMUS, as well?  ", "How about I mix things up and order my Hummus Veggie Bagel ON A BAGEL???  ", "I stood there a bit shell shocked, waiting for her to apologetically take my bagel and restore some normalcy to this whole situation...instead, she snapped at me and literally USED HER INDEX FINGER and pointed at me ", "and then the line and told me to get back in-line to tell the cashier that I wanted veggies.  ", "Well, considering the line at that point consists of 5+ ppl...how about NO FREAKING WAY, DALIA???  ", "How about you learn the meaning of customer service, take back my bagel, and add some sprouts with a flick of your wrist  rather than continue to waste my time????   ", "This girl's audacity was incredible.  ", "I have never met anyone in the service industry with such a huge chip on their shoulder.  ", "I had to take down her name because I was floored!  ", "I'm from NYC--ppl are always giving an I-don't-give-a-fuck-about-you kind of vibe, but even this was nothing compared to what I'm used to back at home.  ", "It felt like she was actively trying to humiliate me with all the finger pointing ", "like I was some child needing rehabilitation for my misguided food-ordering ways.  ", "If you're getting the slightest hint from this review that I'm a sensitive whiney person, I can only offer up that there was another patron  who witnessed this whole debacle and spoke to me in the back area about how inappropriate Dalia was.  ", "I couldn't agree more.  ", "Hey Dalia--", "GET ", "A NEW JOB....preferably one that doesn't require interaction with people.  ", "Maybe the Zoo across the street is hiring.", "How about I mix things up and order my Hummus Veggie Bagel ON A BAGEL???  ", "I stood there a bit shell shocked, waiting for her to apologetically take my bagel and restore some normalcy to this whole situation...instead, she snapped at me and literally USED HER INDEX FINGER and pointed at me ", "and then the line and told me to get back in-line to tell the cashier that I wanted veggies.  ", "Well, considering the line at that point consists of 5+ ppl...how about NO FREAKING WAY, DALIA???  ", "How about you learn the meaning of customer service, take back my bagel, and add some sprouts with a flick of your wrist  rather than continue to waste my time????   ", "This girl's audacity was incredible.  ", "I have never met anyone in the service industry with such a huge chip on their shoulder.  ", "I had to take down her name because I was floored!  ", "I'm from NYC--ppl are always giving an I-don't-give-a-fuck-about-you kind of vibe, but even this was nothing compared to what I'm used to back at home.  ", "It felt like she was actively trying to humiliate me with all the finger pointing ", "like I was some child needing rehabilitation for my misguided food-ordering ways.  ", "If you're getting the slightest hint from this review that I'm a sensitive whiney person, I can only offer up that there was another patron  who witnessed this whole debacle and spoke to me in the back area about how inappropriate Dalia was.  ", "I couldn't agree more.  ", "Hey Dalia--", "GET ", "A NEW JOB....preferably one that doesn't require interaction with people.  ", "Maybe the Zoo across the street is hiring."], "author": "Aimee C.", "review": "Food is good.  Coffee is good.  These two factors alone would warrant 3-4 stars.  BUT my main gripe is the service, in particular, the sandwich-maker, Dalia--young brunette girl with round face who is a serious liability to this place.  After waiting in a line that went down the block, I finally made it to the cashier and placed my order: Hummus Veggie Bagel and a large coffee.  When I finally got my order, it consisted only of hummus spread on a whole wheat bagel.  Hmmm, I found that odd and went back to read the description of the bagel on the chalkboard menu--yup, there should have been some sprouts, lettuce, tomatoe, etc.  When I asked Dalia (remember her?  round faced tall-ish brunette) why there weren't any veggies on my bagel, she proceeded to accuse me that I did not order any veggies.  Well, I guess i MUST BE a simpleton if I assumed the Hummus VEGGIE bagel came with veggies!  Should I have also specified, Dalia, that I would like some HUMMUS, as well?  How about I mix things up and order my Hummus Veggie Bagel ON A BAGEL???  I stood there a bit shell shocked, waiting for her to apologetically take my bagel and restore some normalcy to this whole situation...instead, she snapped at me and literally USED HER INDEX FINGER and pointed at me and then the line and told me to get back in-line to tell the cashier that I wanted veggies.  Well, considering the line at that point consists of 5+ ppl...how about NO FREAKING WAY, DALIA???  How about you learn the meaning of customer service, take back my bagel, and add some sprouts with a flick of your wrist  rather than continue to waste my time????   This girl's audacity was incredible.  I have never met anyone in the service industry with such a huge chip on their shoulder.  I had to take down her name because I was floored!  I'm from NYC--ppl are always giving an I-don't-give-a-fuck-about-you kind of vibe, but even this was nothing compared to what I'm used to back at home.  It felt like she was actively trying to humiliate me with all the finger pointing like I was some child needing rehabilitation for my misguided food-ordering ways.  If you're getting the slightest hint from this review that I'm a sensitive whiney person, I can only offer up that there was another patron  who witnessed this whole debacle and spoke to me in the back area about how inappropriate Dalia was.  I couldn't agree more.  Hey Dalia--GET A NEW JOB....preferably one that doesn't require interaction with people.  Maybe the Zoo across the street is hiring.", "rating": 1, "date": "2013-08-25"}], "pesto veggie bagel": [{"excerpts": ["I grabbed a Pesto Veggie Bagel for around $5-6 since i thought their Salmon Lox Bagel was a tad too expensive (", "-$9 for a bagel... hmmm) ", "Anyway, I'm glad I got my pesto veggie bagel anyway because I believe it's probably the best bagel I've ever had in my entire life! ", "The first bite was pretty orgasmic, and I could not get over how good their pesto sauce was. ", "Anyway, I'm glad I got my pesto veggie bagel anyway because I believe it's probably the best bagel I've ever had in my entire life! ", "The first bite was pretty orgasmic, and I could not get over how good their pesto sauce was. "], "author": "Harriet W.", "review": "Field trip to the zoo! And no, I'm never too old for a field trip, esp to the zoo!\n\nCame here a bit too early, and i was pretty hungry, so I was browsing through yelp which would be he best cafe/restaurant for breakfast. Spotted this place, and thought, \"why not?\" \n\nI grabbed a Pesto Veggie Bagel for around $5-6 since i thought their Salmon Lox Bagel was a tad too expensive (-$9 for a bagel... hmmm) Anyway, I'm glad I got my pesto veggie bagel anyway because I believe it's probably the best bagel I've ever had in my entire life! The first bite was pretty orgasmic, and I could not get over how good their pesto sauce was. lol\n\nI wasn't hungry, but I felt like I could've stuffed more down my stomach if I could. \nKind of wish I tried their coffees too, but oh well, next time! \n\nDefinitely a great place to grab a bite if you're near the zoo!", "rating": 4, "date": "2013-04-19"}, {"excerpts": ["I always go for the Pesto Veggie bagel. ", "SO good. ", "Idk what they do to that pesto cream cheese ", "but it is amazing. "], "author": "Bat V.", "review": "love this place. The staff is always so nice and friendly even on crazy busy days. I live two blocks away, so whenever I forgot to go grocery shopping this is my go-to place. Their salads are delicious (Stacie's mexican salad w/Doritos.....wut). I'm a vegetarian, so I don't get sandwiches. The veggie sandwiches are a bit too cheesy for me, but that doesn't mean they are bad I just don't mix too well with large quantities of cheese. However, the bf gets the BLT every time and loves it. I always go for the Pesto Veggie bagel. SO good. Idk what they do to that pesto cream cheese but it is amazing. The other thing I'm in love with is their greek yogurt, fruit, and granola bowl.. I'm not a big fan of getting light granola bowls for breakfast(I love bread and eggs) but this is huge, and amazing!! So filling, and absolutely the best case scenario of opting out of the bagels for something healthier. Last but not least, their coffee is awesome. The bf and I have a perfect concoction: 3/4s Colombian, and 1/4 Hazelnut. Always perfect.", "rating": 5, "date": "2015-03-22"}, {"excerpts": ["Get the pesto veggie bagel cause its delicious & the veggie subs are always bomb. ", "The ambiance is real chill, cute and small but not too small to the point of being cramped. ", "Seems like it's almost always busy, but trust me...definitely better than the one on Judah--friendlier and prompter service. "], "author": "Alexa M.", "review": "This place is awesome! \nGet the pesto veggie bagel cause its delicious & the veggie subs are always bomb. The ambiance is real chill, cute and small but not too small to the point of being cramped. Seems like it's almost always busy, but trust me...definitely better than the one on Judah--friendlier and prompter service. It's near the beach and across from the zoo, how convenient.  \n\nGreat spot to just chill and relax for a quick and yummy bite!!", "rating": 4, "date": "2008-10-20"}, {"excerpts": ["I ordered the pesto veggie bagel and the spread is a must-have. ", "I think I could put that spread on anything "], "author": "Steph W.", "review": "Alright, so Java Beach numero dos! \n\nSo once again, me and my friend, and if you couldn't tell it's pretty much the same friend that I go with to all these places that I review (the lil stalker) minus the one I went to Frjtz & Miette. And let me just start by saying that this place's wait is 10x shorter than the one on Judah. Thank God. I didn't know if I could take waiting another 30-45 minutes for just one simple meal. The cafe would've undergone another form of sabotage..\n\nThe environment was really cute, and the outer appearance was cuter than the other one as well. It was larger, more colorful and just seemed more spacious. Workers were friendlier and actually seemed to give a shit about the food they were preparing. I ordered the pesto veggie bagel and the spread is a must-have. I think I could put that spread on anything and it would satisfy me. \n\nDilemma: Judah Java Beach or Sloat Java Beach. Without question, the one on Sloat. Not to mention it's by the zoo so you can go take a peek at those creatures there.", "rating": 4, "date": "2008-10-14"}, {"excerpts": ["I ordered their white mocha with a single shot and a pesto veggie bagel. ", "The white mocha was definitely better than starbucks hands down. ", "It was really sweet and does not have a strong taste of coffee. ", "The bagel was delish! ", "Toasted with pesto cream cheese and fresh veggies. ", "This was a perfect place to go especially on cold days like we did last week."], "author": "Lynn P.", "review": "I came here last week to grab a snack before meeting up with my class for a field trip at the zoo. I ordered their white mocha with a single shot and a pesto veggie bagel. The white mocha was definitely better than starbucks hands down. It was really sweet and does not have a strong taste of coffee. The bagel was delish! Toasted with pesto cream cheese and fresh veggies. This was a perfect place to go especially on cold days like we did last week.", "rating": 4, "date": "2009-12-14"}], "plain croissant": [], "cheese croissant": [{"excerpts": ["When we came back the next time early enough for breakfast, we tried the oatmeal (which was a little thick for my taste), a pumpkin chocolate chip muffin (a little too thick and chewy), a bagel sandwich (awesome), and the ham and cheese croissant (also delicious).  "], "author": "Carrie C.", "review": "Food - 4\nService - 4\nAmbiance - 4\n\nI live so close to Java Beach but didn't discover the glory of this place until recently, and now I'm kicking myself for missing out for years!\n\nThe first time I came here it was a little after lunchtime, but my friend and I were still craving breakfast foods.  Unfortunately, I guess this place was so popular that they ran out of almost everything including bagels, pastries, and oatmeal.  Luckily, that lead us to discover the amazing arugula salad and fruit and granola bowl.  Their blueberry pie was also delicious and the perfect sweet end to our brunch.\n\nWhen we came back the next time early enough for breakfast, we tried the oatmeal (which was a little thick for my taste), a pumpkin chocolate chip muffin (a little too thick and chewy), a bagel sandwich (awesome), and the ham and cheese croissant (also delicious).  The beach is only few minute walk away, and on a beautiful sunny day (which I know is rare in this area), it's amazing to be able to have a hearty breakfast, walk along the beach, and then come back and grab a snack back at Java Beach.\n\nI would say their standouts are their sandwiches and salads, and I will definitely be coming back repeatedly to try everything on their menu!", "rating": 4, "date": "2015-11-21"}, {"excerpts": ["I've been here on beautiful SF days to sit outside and enjoy an iced tea and sandwich, and on gloomy cloudy rainy days to sit inside w/ a nice hot cup of tea and ham and cheese croissant.  "], "author": "Ninja H.", "review": "This place rocks!!  It's a perfect cafe in the area.  I've been here on beautiful SF days to sit outside and enjoy an iced tea and sandwich, and on gloomy cloudy rainy days to sit inside w/ a nice hot cup of tea and ham and cheese croissant.  I've killed time doing computer work by utilizing their free WiFi, or just sitting around talking.\n\nThey have a huge selection of drinks and food, so you are more than likely to find something you want...including alcohol (beer and wine only).  They have one bathroom and the counter seating is pretty chill also.\n\nDefinitely returning when it's convenient for me...maybe next time it'll be for food and drinks to go for a visit to the beach.", "rating": 4, "date": "2011-02-21"}, {"excerpts": ["I recommend their cheese croissant, although the sandwiches my friends ordered looked very, very appetizing as well. ", "They also give chips with their sandwiches, which is appreciated."], "author": "Samantha M.", "review": "This place's food is great. And their hot chocolate was amazing. \n\nI recommend their cheese croissant, although the sandwiches my friends ordered looked very, very appetizing as well. They also give chips with their sandwiches, which is appreciated.", "rating": 5, "date": "2012-08-03"}, {"excerpts": ["I ordered a chai and a cheese croissant .  ", "The chai unfortunately came out of a box.  ", "but the croissant was melted to perfection.  ", "My friend ordered a basque pie, which he loved.  ", "The meat pies come from Peasant Pies so I don't think Java Beach can really lay claim to them.  ", "If you are in the area and need a bite go for it, but I wouldn't make a trip out there just for fun."], "author": "Megan P.", "review": "This laid back little shop is just a hop, skip and a jump away from the SF zoo.  We popped in for a quick bite before a long day of running around.  I ordered a chai and a cheese croissant .  The chai unfortunately came out of a box.  but the croissant was melted to perfection.  My friend ordered a basque pie, which he loved.  The meat pies come from Peasant Pies so I don't think Java Beach can really lay claim to them.  If you are in the area and need a bite go for it, but I wouldn't make a trip out there just for fun.", "rating": 3, "date": "2011-02-27"}], "ham  cheese croissant": [], "turkey  cheese croissant": [], "granola bowl": [{"excerpts": ["Luckily, that lead us to discover the amazing arugula salad and fruit and granola bowl.  "], "author": "Carrie C.", "review": "Food - 4\nService - 4\nAmbiance - 4\n\nI live so close to Java Beach but didn't discover the glory of this place until recently, and now I'm kicking myself for missing out for years!\n\nThe first time I came here it was a little after lunchtime, but my friend and I were still craving breakfast foods.  Unfortunately, I guess this place was so popular that they ran out of almost everything including bagels, pastries, and oatmeal.  Luckily, that lead us to discover the amazing arugula salad and fruit and granola bowl.  Their blueberry pie was also delicious and the perfect sweet end to our brunch.\n\nWhen we came back the next time early enough for breakfast, we tried the oatmeal (which was a little thick for my taste), a pumpkin chocolate chip muffin (a little too thick and chewy), a bagel sandwich (awesome), and the ham and cheese croissant (also delicious).  The beach is only few minute walk away, and on a beautiful sunny day (which I know is rare in this area), it's amazing to be able to have a hearty breakfast, walk along the beach, and then come back and grab a snack back at Java Beach.\n\nI would say their standouts are their sandwiches and salads, and I will definitely be coming back repeatedly to try everything on their menu!", "rating": 4, "date": "2015-11-21"}, {"excerpts": ["For breakfast, I would recommend the granola bowl or a delicious scone. ", "They have a variety of lattes, my personal fav is the vanilla almond milk latte (it's toooooo good). ", "Their kale caesar salad is great too! ", "I've never had this plate with mushrooms, but it was a nice twist. ", "My friends have had their sandwiches, the club and the bbq. "], "author": "Sarin P.", "review": "I really LOVE this cafe. Everything on their menu is healthy and made fresh to order. I've been here multiple times. For breakfast, I would recommend the granola bowl or a delicious scone. They have a variety of lattes, my personal fav is the vanilla almond milk latte (it's toooooo good). Their kale caesar salad is great too! I've never had this plate with mushrooms, but it was a nice twist. My friends have had their sandwiches, the club and the bbq. Looked and smelled delicious! \n\nDefinitely give this place a try, you can't go wrong with anything on the menu.", "rating": 5, "date": "2014-10-14"}, {"excerpts": ["I've tried the Tsunami, Bonfire Delight, Granola Bowl, Caramel Latte, and the Mocha. ", "My faves are the Tsunami Sandwich and the Caramel Latte. ", "There is something about the sandwich that keeps me coming back to it, maybe its the crunchiness of the dutch crunch or the savory blend of ham/mortadella/salami, I don't know what it is but it works every time. ", "And as for the latte, I'm not a huge coffee connoisseur ", "but I think the coffee here is very addicting... ", "I just back from school for summer vacation a week ago "], "author": "Elaine N.", "review": "I Love Java Beach! I go to this location more often because it is a little closer to where I live than the one on La Playa/Judah.\n\nI've tried the Tsunami, Bonfire Delight, Granola Bowl, Caramel Latte, and the Mocha. My faves are the Tsunami Sandwich and the Caramel Latte. There is something about the sandwich that keeps me coming back to it, maybe its the crunchiness of the dutch crunch or the savory blend of ham/mortadella/salami, I don't know what it is but it works every time. And as for the latte, I'm not a huge coffee connoisseur but I think the coffee here is very addicting... I just back from school for summer vacation a week ago and I've been to Java Beach for their coffee 4 times already! \n\nI love that the cafe is so close to the beach (The one on La Playa/Judah is even closer!)  This place may be a little pricey in comparison to other cafes, but I think the quality of the food/drink is worth it. If you're looking for a quick bite/coffee break/cool place to chill, hit up Java Beach.", "rating": 4, "date": "2011-06-23"}, {"excerpts": ["My favorite are their mocha's and fruit and granola bowl with honey yummy! "], "author": "Jackie P.", "review": "My boyfriend and I go her religiously it's convenient and great food for breakfast lunch or even dinner. My favorite are their mocha's and fruit and granola bowl with honey yummy! Kelly's Cove is a super tasty sandwich fresh Turkey and pesto! \n\nMy only qualm is that there are tons of people that take up all the seating and don't buy anything just utilizing the wifi. This always takes up the space from paying customers with no where to sit. Other then that this place is a must staff is always friendly and sweet at well !", "rating": 4, "date": "2011-07-26"}, {"excerpts": ["The other thing I'm in love with is their greek yogurt, fruit, and granola bowl.. ", "I'm not a big fan of getting light granola bowls for breakfast(I love bread and eggs) but this is huge, and amazing!! ", "So filling, and absolutely the best case scenario of opting out of the bagels for something healthier. ", "Last but not least, their coffee is awesome. ", "The bf and I have a perfect concoction: ", "3/4s Colombian, and 1/4 Hazelnut. ", "Always perfect."], "author": "Bat V.", "review": "love this place. The staff is always so nice and friendly even on crazy busy days. I live two blocks away, so whenever I forgot to go grocery shopping this is my go-to place. Their salads are delicious (Stacie's mexican salad w/Doritos.....wut). I'm a vegetarian, so I don't get sandwiches. The veggie sandwiches are a bit too cheesy for me, but that doesn't mean they are bad I just don't mix too well with large quantities of cheese. However, the bf gets the BLT every time and loves it. I always go for the Pesto Veggie bagel. SO good. Idk what they do to that pesto cream cheese but it is amazing. The other thing I'm in love with is their greek yogurt, fruit, and granola bowl.. I'm not a big fan of getting light granola bowls for breakfast(I love bread and eggs) but this is huge, and amazing!! So filling, and absolutely the best case scenario of opting out of the bagels for something healthier. Last but not least, their coffee is awesome. The bf and I have a perfect concoction: 3/4s Colombian, and 1/4 Hazelnut. Always perfect.", "rating": 5, "date": "2015-03-22"}, {"excerpts": ["Another reason why I keep coming back is because their granola bowl with honey is AMAZING.. ", "I've tried making my own at home, but it's not even close to how good they make it. ", "You may argue their prices are a little steep, but you get what you pay for."], "author": "Andre T.", "review": "The staff here is flippin' awesome! It's seriously some of the best customer service I have been around in this city, which is a big reason why I have made this my go to spot. Another reason why I keep coming back is because their granola bowl with honey is AMAZING.. I've tried making my own at home, but it's not even close to how good they make it. You may argue their prices are a little steep, but you get what you pay for.", "rating": 5, "date": "2013-03-09"}, {"excerpts": ["Pastries are good here, I love their cheese croissants and fruit granola bowl. ", "There are days where this place is empty and quick and other days where the line is insane. ", "Sometimes they may even forget your order! ", "But oh wells, I'm still gonna come here because I need my fix!"], "author": "Jackie M.", "review": "Come here almost every time I have work. Usually has great coffee, but there have been a couple occasions where my white mocha was completely milk. Not a way I like to start my morning! Another time my cup of coffee was not even close to full. Pastries are good here, I love their cheese croissants and fruit granola bowl. There are days where this place is empty and quick and other days where the line is insane. Sometimes they may even forget your order! But oh wells, I'm still gonna come here because I need my fix!", "rating": 3, "date": "2011-08-12"}, {"excerpts": ["I like the granola bowl! ", "The coffee is good too!"], "author": "vernice l.", "review": "If you are around this area, this is a very good place to relax and enjoy breakfast on a sunny morning!  I like the granola bowl! The coffee is good too!", "rating": 5, "date": "2009-04-30"}], "simple mixed greens": [], "popeye special salad": [], "stacys mexican salad": [], "jb classic sandwich": [], "meat choices": [], "bread choices": [{"excerpts": ["They have all kinds of different bread choices which is always great and they make a pretty mean sandwich that fills you up for the rest of the day.\n\n"], "author": "Narek M.", "review": "A great place to grab delicious subs on the way to the zoo!\n\nThey have all kinds of different bread choices which is always great and they make a pretty mean sandwich that fills you up for the rest of the day.\n\nGrab a sandwich to go and take it down to the beach and enjoy a mini picnic before heading to the zoo or wherever your San Fran adventure takes you! \n\nThey make a really good Arnold Palmer as well, get the Jumbo size because you can and it's totally worth it. \n\nPretty reasonable prices and again the food is great! \n\nThe turkey club, the bbq chicken are my favorite so far!", "rating": 4, "date": "2013-07-21"}], "cheese choices": [], "classic veggie": [{"excerpts": ["I got the Classic Veggie sandwich on Dutch crunch, because I wanted something light. ", "I thought the sandwich was delicious, and I like the chips that come with it..."], "author": "Rachel A.", "review": "Stopped here today before a trip to the zoo. I got the Classic Veggie sandwich on Dutch crunch, because I wanted something light. I thought the sandwich was delicious, and I like the chips that come with it...but I still don't feel like it was an $8 sandwich. \n\nMaybe it's just me, but I've always felt that Java Beach (both locations) charge a bit too much for what they're dishing up. $3.25 could get me a chai double the size of their 'small' at Starbucks...which makes me sound like an anti-local-business she-devil, but I'm a student who needs to watch their wallet and I think about value. \n\nThat being said, if you crave a good sandwich and a very satisfying chai tea latte, and don't mind spending a little extra to support your local sandwich and coffee shop, you should definitely hit up Java Beach.", "rating": 4, "date": "2011-05-14"}], "san patricio": [{"excerpts": ["My friends and I ordered San Patricio and Kelly's Cove to share. ", "There is so much filling in both sandwiches, we couldn't even finish half of one! ", "Neither sandwich felt too heavy to eat; it was actually pretty refreshing. "], "author": "Teresa C.", "review": "I'm skeptical of sandwich shops because you never know how good the sandwich can be. This shop, surprised me and I would definitely come back! My friends and I ordered San Patricio and Kelly's Cove to share. There is so much filling in both sandwiches, we couldn't even finish half of one! Neither sandwich felt too heavy to eat; it was actually pretty refreshing. Will definitely come back! \n\nService is exceptional. Everyone is so friendly and warm. During lunch/brunch hours, there tends to be a ton of people. So finding seats tends to be difficult; especially on a weekend.", "rating": 5, "date": "2016-06-19"}, {"excerpts": ["Now onto the food, i got the San Patricio and its HUGEEEE i was full after eating half and had to give the rest to my friend. ", "I also got Arnorld Palmer and it was more on the sour side but still OK", ", i'd probably get the ice tea next time. ", "Oh downside is that there aren't many seating areas and it filled up fast since people come here in the laptops and stay for awhile. "], "author": "Debbie D.", "review": "Love love this place. It is by the beach and there's plenty of parking!! Double stars just for that cuz parking is ridicilous in SF! \n\nNow onto the food, i got the San Patricio and its HUGEEEE i was full after eating half and had to give the rest to my friend. I also got Arnorld Palmer and it was more on the sour side but still OK, i'd probably get the ice tea next time. Oh downside is that there aren't many seating areas and it filled up fast since people come here in the laptops and stay for awhile. Unless its sunny outside then they have tables outside too!\n\n Can't wait to be back and try their salads!", "rating": 4, "date": "2014-10-26"}, {"excerpts": ["I ordered the San Patricio sandwich and the Kelly's Cove, both were $8.50. ", "The San Patricio was a chicken sandwich with honey dijon spread, cheese,avocado, and spring mix greens on ciabatta bread. ", "The Kelly's Cove was a turkey sandwich with pesto, cheese and spring mix. ", "Both sandwiches come with a handful of potato chips. ", "The water dispenser is located by the coffee and napkins. \n", "Outdoor seating is great for people watching too!"], "author": "Connie C.", "review": "+Great place by the beach / zoo\n+Outdoor seating and also plenty of indoor seating\n+Soft Serve ice cream\n\nI came here with my bf and his friend during Sunday Streets on the Great Highway. It was fun to ride our bikes along Great Highway free of cars and Java Beach just topped it off for our day. We chose outdoor seating to avoid the risk of having our bikes stolen. I ordered the San Patricio sandwich and the Kelly's Cove, both were $8.50. The San Patricio was a chicken sandwich with honey dijon spread, cheese,avocado, and spring mix greens on ciabatta bread. The Kelly's Cove was a turkey sandwich with pesto, cheese and spring mix. Both sandwiches come with a handful of potato chips. The water dispenser is located by the coffee and napkins. \nOutdoor seating is great for people watching too!", "rating": 4, "date": "2011-07-12"}, {"excerpts": ["We went with our favorite, the pumpkin spice latte (haven't found a place that makes it better), soup of the day a red pepper chowder, and a San Patricio. ", "All delicious. ", "All down side was the sandwich was a bit messy to eat."], "author": "Jennifer H.", "review": "Great atmosphere. Great food. Great coffee. What more is there to ask for? Java Beach never fails impress. I'm not a big fan of sandwiches, last Sunday my bf and I were trying to decide what to have for lunch. He looks me with a hesitant express and ask Java Beach? He was worried I wouldn't want to go since they mostly serve sandwiches. By his surprise I agreed to go. We decide to try the one by the zoo guessing that it would be less crowded. They were busy however not super crowded like the one near the beach. We went with our favorite, the pumpkin spice latte (haven't found a place that makes it better), soup of the day a red pepper chowder, and a San Patricio. All delicious. All down side was the sandwich was a bit messy to eat.", "rating": 5, "date": "2013-01-07"}, {"excerpts": ["My favorites being the Garden Salad and the San Patricio sandwich. ", "There are many other items available here such as bagels, soups, pastries, and even wine and beer. ", "Prices are reasonable for what you're getting. ", "The salad portions are huge! ", "I don't know why I haven't tried the coffee yet, but I soon will."], "author": "Lauren D.", "review": "I normally come here after a nice jog around Lake Merced. It's close by and parking is fairly easy. It's a great spot to enjoy a healthy lunch and some sun. They have great salads and sandwiches! My favorites being the Garden Salad and the San Patricio sandwich. There are many other items available here such as bagels, soups, pastries, and even wine and beer. Prices are reasonable for what you're getting. The salad portions are huge! I don't know why I haven't tried the coffee yet, but I soon will.", "rating": 4, "date": "2012-05-25"}, {"excerpts": ["The San Patricio is yummy (chicken and pesto) and filling!  ", "It's convenient for me when I get off work late (9pm) and have nothing in the house for dinner =)  ", "The staff is really sweet, pretty much even when it's crazy busy and crowded--which it definitely is in the mornings and midday on the weekends!  ", "Prices are decent and the coffee is way better than what you get at Burnt Coffee Central aka Starbucks."], "author": "Nicholle B.", "review": "It's the coffee shop/cafe literally right around the corner from me and I often stop in for a mocha or a sandwich.  The San Patricio is yummy (chicken and pesto) and filling!  It's convenient for me when I get off work late (9pm) and have nothing in the house for dinner =)  The staff is really sweet, pretty much even when it's crazy busy and crowded--which it definitely is in the mornings and midday on the weekends!  Prices are decent and the coffee is way better than what you get at Burnt Coffee Central aka Starbucks.", "rating": 4, "date": "2009-10-20"}], "kellys cove": [], "ob hot sub sandwich": [], "create your own": [], "hot veggie": [{"excerpts": ["My favor here is the hot veggie sandwich. ", "Comes with avocado and veggies on toasted baguette. ", "Tsunami sandwich is also very popular here! \n", "If you have a dog, they've outdoor seating. ", "Also provide water outside for your pet."], "author": "Jaylene L.", "review": "My family loves coming here for sandwiches and soft serve. Especially on a hot day, lots of people come here for the soft serve. Pricing here are pretty reasonable! My favor here is the hot veggie sandwich. Comes with avocado and veggies on toasted baguette. Tsunami sandwich is also very popular here! \nIf you have a dog, they've outdoor seating. Also provide water outside for your pet.", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["My son and I split the hot veggie sub (so good!) ", "and an arugula salad, plus he had a muffin ", "and I had a latte. ", "I couldn't take a picture because we devoured our lunch too quickly. ", "So there's that: food so good you want to eat it instead of photograph it."], "author": "Merredith B.", "review": "Ocean Beach may not have lots of dining spots, but Java Beach's options are so delicious, it might make up for the lack.\n\nIt has a nice welcoming vibe, great food in generous portions, free wifi and really flipping delicious beverages, homemade doughnuts and pastries and desserts.\n\nMy son and I split the hot veggie sub (so good!) and an arugula salad, plus he had a muffin and I had a latte. I couldn't take a picture because we devoured our lunch too quickly. So there's that: food so good you want to eat it instead of photograph it.", "rating": 4, "date": "2015-06-12"}, {"excerpts": ["I did not have high expectations for this place because it was not crowded when I came, but I was impressed by their hot veggie sandwich! ", "It was served hot, and the bread was a little hard to bite because it was so hard. ", "Nonetheless the flavors were delicious. ", "It came with cucumbers,sprouts, tomatos, avocado, and 3 cheeses. "], "author": "Kristina N.", "review": "I did not have high expectations for this place because it was not crowded when I came, but I was impressed by their hot veggie sandwich! It was served hot, and the bread was a little hard to bite because it was so hard. Nonetheless the flavors were delicious. It came with cucumbers,sprouts, tomatos, avocado, and 3 cheeses. The small size is about 5 inches, but it's piled high. \n\nThe one complaint I have is all the gnats inside the restaurant. The whole time I was there, my friend and I were swatting them away from our food and table. We moved from the bar to the table area, and but could not escape the gnats. I noticed other customers swatting them away too.\n\nI would return back here to grab a sandwich to bring to the beach or to the zoo!", "rating": 4, "date": "2012-10-17"}, {"excerpts": ["I love the hot veggie sub, salads are great, now they are featuring Root Beer floats. \n", "They always have fresh fruit and it's consistently fresh. ", "I go there a few times a week, they are fast friendly and did I mention they have beer & wine ", ":)"], "author": "Courtney D.", "review": "I live in the hood, so this is my spot! They have lots of outlets for free WI-FI, a changing table in the bathroom for the diapered ones and a ton of ceiling fan's witch my son finds highly entertaining and leaves me time to surf the net! I love the hours they open @ 6am and close @ 11pm on most if not all nights (Sun. maybe 10) they have beer & wine, always a plus in my book! The weather is really nice alot of the time so the outdoor seating fills up fast but you can usually finagle a spot if your crafty. I love the hot veggie sub, salads are great, now they are featuring Root Beer floats. \nThey always have fresh fruit and it's consistently fresh. I go there a few times a week, they are fast friendly and did I mention they have beer & wine :)", "rating": 5, "date": "2009-06-21"}, {"excerpts": ["We ordered a Barbecue Chicken sandwich and Hot Veggie sandwich...both were small.\n\n"], "author": "Daddy F.", "review": "Based on Yelp reviews we decided to check this place out for lunch and I'm glad we did!\n\nWe ordered a Barbecue Chicken sandwich and Hot Veggie sandwich...both were small.\n\nThe bread and ingredients were fresh and flavorful..the portion was just the right amount and prices were good!\n\nThis is a nice local spot with surprisingly good sandwiches.\n\nWe will be back!", "rating": 5, "date": "2010-03-19"}], "mozzarella pesto  tomato melt": [], "bonfire delight": [{"excerpts": ["I tried the bonfire delight and the tsunami sandwich which were alright, nothing special. ", "I also had a swirl cone which was yummy. ", "Although the food was nothing to die for, what I loved about this place is the vibe. ", "The workers and people were friendly and easy to talk to. ", "I got to chit chat with a bunch of dog lovers while my pup played with his new doggy friends!"], "author": "Michelle H.", "review": "Came here on a sunny afternoon for some brunch because I wanted to take my pup out. I tried the bonfire delight and the tsunami sandwich which were alright, nothing special. I also had a swirl cone which was yummy. Although the food was nothing to die for, what I loved about this place is the vibe. The workers and people were friendly and easy to talk to. I got to chit chat with a bunch of dog lovers while my pup played with his new doggy friends!", "rating": 4, "date": "2015-07-10"}, {"excerpts": ["I've tried the Tsunami, Bonfire Delight, Granola Bowl, Caramel Latte, and the Mocha. ", "My faves are the Tsunami Sandwich and the Caramel Latte. ", "There is something about the sandwich that keeps me coming back to it, maybe its the crunchiness of the dutch crunch or the savory blend of ham/mortadella/salami, I don't know what it is but it works every time. ", "And as for the latte, I'm not a huge coffee connoisseur ", "but I think the coffee here is very addicting... ", "I just back from school for summer vacation a week ago "], "author": "Elaine N.", "review": "I Love Java Beach! I go to this location more often because it is a little closer to where I live than the one on La Playa/Judah.\n\nI've tried the Tsunami, Bonfire Delight, Granola Bowl, Caramel Latte, and the Mocha. My faves are the Tsunami Sandwich and the Caramel Latte. There is something about the sandwich that keeps me coming back to it, maybe its the crunchiness of the dutch crunch or the savory blend of ham/mortadella/salami, I don't know what it is but it works every time. And as for the latte, I'm not a huge coffee connoisseur but I think the coffee here is very addicting... I just back from school for summer vacation a week ago and I've been to Java Beach for their coffee 4 times already! \n\nI love that the cafe is so close to the beach (The one on La Playa/Judah is even closer!)  This place may be a little pricey in comparison to other cafes, but I think the quality of the food/drink is worth it. If you're looking for a quick bite/coffee break/cool place to chill, hit up Java Beach.", "rating": 4, "date": "2011-06-23"}, {"excerpts": ["Anyway, I really love their Bonfire Delight sandwich.. ", "Warm roasted beef with cheddar and some sesame ginger dressing. ", "Too bad I won't be having that today!"], "author": "Allyson L.", "review": "I reallyyyyyy want to love this place but it's the second time they screwed up my order. I got TWO totally different sandwiches. Maybe they bagged the wrong ones..... I don't know. I assumed it was mine cuz nobody else was waiting and I was waiting for a while already.... Please check your orders before leaving, even if they call your name. These are pricey sandwiches to get mixed up.... The lady before me got her drink messed up as well. \n\nAnyway, I really love their Bonfire Delight sandwich.. Warm roasted beef with cheddar and some sesame ginger dressing. Too bad I won't be having that today!", "rating": 3, "date": "2011-01-21"}, {"excerpts": ["Bonfire delight is one of my favorite sandwich. ", "Me and my friend usually hangout at java beach after a run by the beach which is few blocks from this place. ", "This is one of my favorite place to go on weekends !!! ", "I love java beach ", "and I recommend it to everyone who haven't been here:)"], "author": "Loraine C.", "review": "This place is beautiful! Bonfire delight is one of my favorite sandwich. Me and my friend usually hangout at java beach after a run by the beach which is few blocks from this place. This is one of my favorite place to go on weekends !!! I love java beach and I recommend it to everyone who haven't been here:)", "rating": 5, "date": "2013-08-20"}], "whirling dervish veggie sub": []}