{"jbs breakfast": [], "jbs junior breakfast": [], "rocky mountain high": [], "chorizoneggs": [], "two eggs any style": [], "eggs benedict": [], "two eggs any style and toast": [], "vegetarian omelette": [], "spinach omelette": [], "denver omelette": [], "avocado  cheese": [], "chili  cheese": [], "bacon  cheese": [], "pancakes": [], "belgian waffle": [], "jbs deluxe breakfast sandwich": [], "egg  bacon or ham or sausage": [], "egg  bacon or ham or sausage with cheese": [], "homefries or hashbrowns": [], "egg any style": [], "oatmeal or grits": [], "baconhamsausage": [], "jb burger double bacon avocado cheeseburger": [], "avocado cheeseburger": [{"excerpts": ["Avocado cheeseburger?  ", "Sounds good too!  ", "The JB Burger - double bacon avocado cheeseburger!  ", "Oh my!  ", "Yes, I'll have that!  ", "All of JB's burgers come with a massive order of shoestring fries on the side.  ", "I placed my order and paid for it along with a soda at the cash register where I was greeted by another friendly hello.  "], "author": "Wilhelm Y.", "review": "I'm always on the lookout for a great burger, and I found one just a few days ago at JB's Place on Potrero Hill.  I've wanted to try JB's for quite sometime, but whenever I'm in the area during the noon hours the place is usually super-packed.  Whenever I've gone later (around 3 PM) they're getting ready to close up shop.  I guess it was around 2 PM when I stopped in the other day.  There were just a handful of customers inside at the time.  I walked up to the sandwich counter, was greeted by a friendly hello, grabbed a menu and studied it.\n\nBacon cheeseburger?  Maybe.  Avocado cheeseburger?  Sounds good too!  The JB Burger - double bacon avocado cheeseburger!  Oh my!  Yes, I'll have that!  All of JB's burgers come with a massive order of shoestring fries on the side.  I placed my order and paid for it along with a soda at the cash register where I was greeted by another friendly hello.  The wait wasn't too bad either as my burger and fries were ready to go within ten minutes.\n\nNot only did I get a humongous portion of fries in the take out box, but the sandwich itself was huge too (http://www.yelp.com/biz_photos/bJNVd1HqilRD3F9RO3t20g?select=PUtDBz_likDKx2zeV1jrhA).  It's not always just the juicy, flavorful beef patties but often it takes a combination of things to make a great burger.  The JB Burger was drip all over my hands delicious.   Piled high on a soft and chewy sandwich roll were two hamburger patties, two slices of cheese, several slices of tender-seared bacon, thick tomato slices, super thin rings of red onion, crunchy pickle coins, creamy ripe avocado and shredded lettuce.  As I bit into the burger and juices ran down both of my hands all of these ingredients screamed out, \"This is an incredible burger!\"\n\nJB's is a bit of a hike from my workplace, but with a burger this good I'm definitely adding this restaurant to my lunch rotation.  The restaurant serves up breakfast until 11 AM and has an extensive list of sandwiches, burgers, soups and salads.  I've scanned and posted their current menu in the photos section.  The dining area inside consists of two seaters and bigger tables that can be parked together for a group.  There's limited seating outside too.  The friendly staff is very accommodating.", "rating": 5, "date": "2008-10-24"}, {"excerpts": ["The avocado cheeseburger is busting with just about everything and is a great big mess. ", "Not that it isn't delicious... ", "it's just a great big mess. "], "author": "Mariko F.", "review": "Try not to go during school lunch hours as this place will be overrun with kids, trying to get away from school. \n\nThat said, when the crowd subsides, what remains is a very cute little hole in the wall with really good burgers. The avocado cheeseburger is busting with just about everything and is a great big mess. Not that it isn't delicious... it's just a great big mess. All burgers come with more fries than you can ever hope to finish. \n\nI really want to come back to try all the pasta side dishes and the sandwiches.", "rating": 4, "date": "2009-01-15"}], "fish burger": [], "chicken breast burger": [], "spicy buffalo chicken burger": [{"excerpts": ["I had read about the Spicy Buffalo Chicken Burger so that's what I got ", "and I was pleased with it.  ", "I would say that it lacked on the spicy part "], "author": "Blake B.", "review": "After running some errands the other day I was looking for a sandwich place and JB's Place came up so I thought I'd give it a try.  Warning that parking might be difficult around here depending on the time you stop by.  Luckily I found a spot relatively close.  I had read about the Spicy Buffalo Chicken Burger so that's what I got and I was pleased with it.  I would say that it lacked on the spicy part but it was really tasty and the fires were really good as well.\n\nGood spot for a quick, quality lunch.", "rating": 3, "date": "2012-02-02"}, {"excerpts": ["My personal favorites have to be their Grilled Chicken Caesar salad, Spicy Buffalo Chicken Burger and lots of different deli sandwiches! ", "I like this place so much that when the company I work for has our monthly Project Mgr's meeting, I always volunteer to order the lunch, which comes frrooommmmm....??? ", "You guessed it! ", "JB's Place!!!"], "author": "Cesar N.", "review": "One of the BEST deli shops in SF!! A must try!! I've been coming here for a couple of yrs now and have gotten to know the owner, who, is at the register all the time.. that's the homie Nas!! The food is great, prices are superb and the environment is tranquil so read on! \n\nWhat I like about this deli is that everything is fresh and everything that they make is delish!! From the sandwiches and burgers, to the salads and special dishes! Prices are cool as well. The one thing that I will say to anyone going to this JB's Place is that from 12pm-1pm (lunchtime) there will be a line, which at times goes out the door (I've witnessed it). You can try calling ahead and placing an order but all in all, it's worth the wait!!  My personal favorites have to be their Grilled Chicken Caesar salad, Spicy Buffalo Chicken Burger and lots of different deli sandwiches! I like this place so much that when the company I work for has our monthly Project Mgr's meeting, I always volunteer to order the lunch, which comes frrooommmmm....??? You guessed it! JB's Place!!!", "rating": 5, "date": "2011-07-05"}], "double bacon cheeseburger": [], "boca burger": [{"excerpts": ["Falafal- wrap or sandwhich; boca burger, egg salad, avocado sandwhich... ", "every kind of salad. ", "everything here is good. ", "nicest people.  ", "basically every beverage you would want to drink with your meal. ", "packets of tapatio! ", "to take with you and cigarettes. ", "i think they thought of everything. ", "and girl scout cookies from the bosses daughter."], "author": "jessica s.", "review": "so many vegetarian options. and vegan even. Falafal- wrap or sandwhich; boca burger, egg salad, avocado sandwhich... every kind of salad. everything here is good. nicest people.  basically every beverage you would want to drink with your meal. packets of tapatio! to take with you and cigarettes. i think they thought of everything. and girl scout cookies from the bosses daughter.", "rating": 5, "date": "2009-03-27"}], "mushrooms or grilled onions": [], "extra cheese": [], "onion rings": [], "daily hot specials": [{"excerpts": ["I love that they have daily hot specials.  ", "The service is always friendly ... \"where everybody knows you name\" ... type of service.  ", "Try it.. ", "you'll like it!"], "author": "Nancy F.", "review": "Great Service... Good Food... How much better can you get?  \n\nI go to JB's for lunch about once a week and every thing there is good.  I love that they have daily hot specials.  The service is always friendly ... \"where everybody knows you name\" ... type of service.  Try it.. you'll like it!", "rating": 5, "date": "2009-03-13"}], "grilled steak sandwich": [{"excerpts": ["I had the grilled steak sandwich add tomatoes and lettuce ", "and it was pretty damn good ", "plus it looked like they had many other great sandwiches ", ":) cheers"], "author": "Jimmie J.", "review": "So it was my first time and out of town. I'm a home chef and like to think that I know good food... So I used yelp to help me and they did. I had the grilled steak sandwich add tomatoes and lettuce and it was pretty damn good plus it looked like they had many other great sandwiches :) cheers", "rating": 4, "date": "2014-05-22"}, {"excerpts": ["I ordered a grilled steak sandwich with meat and cheese only, which I repeated twice when I called in the order. ", "When I arrived to pick it up, I was surprised to find a grilled chicken sandwich with cheese, onions, peppers and mushrooms. "], "author": "C K.", "review": "Be careful when ordering over the phone at JBs. I ordered a grilled steak sandwich with meat and cheese only, which I repeated twice when I called in the order. When I arrived to pick it up, I was surprised to find a grilled chicken sandwich with cheese, onions, peppers and mushrooms. Disappointing because that steak sandwich is the main reason I hit up JBs. \n\nMake sure you get the person taking your order to repeat it back to you!", "rating": 1, "date": "2011-08-26"}, {"excerpts": ["If you come here you have to try there grilled steak sandwich. ", "The workers here are nice and friendly. ", "There's never a time where i had a bad experience at this place. ", "The only thing is that they close at 4 and there closed on the weekend. ", "If they open alittle bit longer and at least open on the weekends I would be coming here more often."], "author": "Jranel F.", "review": "JB's is one of my favorite places to eat! If you come here you have to try there grilled steak sandwich. The workers here are nice and friendly. There's never a time where i had a bad experience at this place. The only thing is that they close at 4 and there closed on the weekend. If they open alittle bit longer and at least open on the weekends I would be coming here more often.", "rating": 5, "date": "2010-07-11"}, {"excerpts": ["Grilled steak sandwich was basically a cheesesteak, except that I would have preferred provolone or something else besides American."], "author": "Rob T.", "review": "Great fries. Grilled steak sandwich was basically a cheesesteak, except that I would have preferred provolone or something else besides American.", "rating": 3, "date": "2009-04-29"}], "panini with chicken": [], "polish dog sandwich": [], "chili dog sandwich": [], "meatloaf sandwich": [], "veggie lovers": [], "veggie gyro platter": [], "middle eastern platter": [], "panini with veggie": [], "hot dog sandwich": [], "tritip sandwich": [], "eggplant delight": [], "gyro platter": [], "baked potato": [{"excerpts": ["They pretty much have everything: burgers, pasta, sandwiches, falafel wraps, baked potato, salads, soup, cookies, steak over rice (today's special), etc.  "], "author": "Jacquelynne S.", "review": "Don't you hate it when you only have an hour lunch break and you're trying to figure out where to eat with a bunch of your coworkers?  Someone is craving a turkey sandwich, while another is craving a burger.  Nobody can make up their damn mind and...oh wait, we just spent 10 minutes debating on where to go.  Great!  Now there's only 50 minutes left.\n\nThe best solution (for those that work close by), is JB's.  The food here is AMAZING, cheap, and fresh.  They pretty much have everything: burgers, pasta, sandwiches, falafel wraps, baked potato, salads, soup, cookies, steak over rice (today's special), etc.  You can't really go wrong.  \n\nThe staff's nice and the line is tolerable. \n\n+5, no complaints so far.", "rating": 5, "date": "2009-05-27"}], "bologna": [], "poor boy": [{"excerpts": ["They have the standard deli fare - and even some of the exotics like Gyros or, OMG a \"poor boy(?)\" sandwich. "], "author": "Percy C.", "review": "I was first introduced to this little nook of a deli/restaurant in the early 2003. Now I work in the area, and it's like visiting an old friend.\n\nIf you are SICK of paying too much for lunch or  dealing with FOO FOO restaurants that are more attitude and price versus good food, then you'll love JBs.\n\nThey have the standard deli fare - and even some of the exotics like Gyros or, OMG a \"poor boy(?)\" sandwich. There's soups, salads, sodas... omg sodas in San Francisco?!\n\nAnd you can sit down to eat, walk across the street to the park, or hang out on the curb and watch the SWAT team drive by.\n\nJBs is a piece of true San Francisco neighborhood. And if your collar runs blue, you'll enjoy this little breath of fresh air that won't send your wallet into the bay.", "rating": 5, "date": "2011-05-17"}], "liverwurst": [{"excerpts": ["They have all the sandwich combinations you could want (though their liverwurst oddly isn't my favorite), a decent selection of burgers, and *great* lunch/brunch options.\n\n"], "author": "Emilynne A.", "review": "Oh JB's.  How I heart you and your hot lunch specials and cold pasta salads.\n\nThis is a small, down to earth deli/lunch joint.  No extra frills, no crazy shenanigans, just great, solid fare for which I don't have to pay an arm and a leg.  I work down the street, so when I don't feel like trekking up the hill because I forgot my lunch, JB's is my standard go-to place.\n\nThey have all the sandwich combinations you could want (though their liverwurst oddly isn't my favorite), a decent selection of burgers, and *great* lunch/brunch options.\n\nHonestly, their French Toast could (and has in the past, really) keep me happy and satisfied, and maple syrup-dazed from the very first bite all the way through to when I realize that dinner time has come around and maybe a salad is the way to go.\n\nIt does get crowded and a bit noisy come lunch time, but off hours it's surprisingly nice to go in and just sit and read (according to my friend who had the time to do so back in the day).\n\nOmnomz , guys.  Just. Omnomz.", "rating": 4, "date": "2013-01-28"}], "avocado egg  bacon": [], "prosciutto": [], "smoked turkey": [], "black forest ham": [{"excerpts": ["The black forest ham sandwich on ciabatta bread with pesto garlic mayo and grilled red onions. ", "This is one of their daily specials so I never have any idea when they have it ", "but damn, it's GOOD. "], "author": "Patrick L.", "review": "There are three reasons why I keep coming back to JB's:\n\n1. It's a block away from my work.\n2. The people here are incredibly friendly. They make you feel right at home. \n3. The black forest ham sandwich on ciabatta bread with pesto garlic mayo and grilled red onions. This is one of their daily specials so I never have any idea when they have it but damn, it's GOOD. I find myself daydreaming about this sandwich. \n\nThank you JB's for killing my productivity after work because I'm in a massive food coma.", "rating": 4, "date": "2006-11-30"}], "mortadella": [{"excerpts": ["I usually get a cold sandwich; they have all the meats (ham, turkey, roast beef, mortadella, pastrami, etc.) and all the fixins (lettuce, tomato, sprouts, mayo, mustard, pickles, various cheeses and breads to choose from.  ", "Sometimes I'll get oil and vinegar on my sandwich to make it taste all east coasty.  ", "They also have a variety of burgers and hot sandwiches including meatloaf (which is cold by request, if you like) and chicken breast sandwiches.  ", "And OMG their fries, which come with the hot sandwiches, are delicious, always very hot and crisp.  ", "They also serve breakfast (the sausage for their breakfast sandwiches is super delicious) and have a bunch of fresh baked goods (muffins, donuts) if you just need to grab and go.  ", "JB's doubles as a convenience store, with several large wall coolers filled with beverages and a counter stacked with candy and chips.  ", "This is particular useful because when I worked downtown there was always a Walgreens or 7-11 nearby and now there isn't; for a quick 3pm snack there is really only JB's in the area.  ", "Overall I love this place but one of my co-workers and I agree that their chicken salad is terrible.  ", "Avoid.  ", "But I really like everything else, and have been very happy with their service and smiles."], "author": "Dave M.", "review": "I've been eating here 1 to 4 times per week for the last 5 months, since my company moved to the neighborhood.  JB's gets a lot of my lunch business because it's literally the closest restaurant to my office.  Staff is very friendly (I suppose being a regular helps!) and the sandwiches are good.  They also have some hot specials every day, so check the board.  They are quite good.  I've had the fried shrimp, the spaghetti, fettuccine alfredo with chicken, pesto salmon, a few others.  The hot lunch specials come with a side salad.  I usually get a cold sandwich; they have all the meats (ham, turkey, roast beef, mortadella, pastrami, etc.) and all the fixins (lettuce, tomato, sprouts, mayo, mustard, pickles, various cheeses and breads to choose from.  Sometimes I'll get oil and vinegar on my sandwich to make it taste all east coasty.  They also have a variety of burgers and hot sandwiches including meatloaf (which is cold by request, if you like) and chicken breast sandwiches.  And OMG their fries, which come with the hot sandwiches, are delicious, always very hot and crisp.  They also serve breakfast (the sausage for their breakfast sandwiches is super delicious) and have a bunch of fresh baked goods (muffins, donuts) if you just need to grab and go.  JB's doubles as a convenience store, with several large wall coolers filled with beverages and a counter stacked with candy and chips.  This is particular useful because when I worked downtown there was always a Walgreens or 7-11 nearby and now there isn't; for a quick 3pm snack there is really only JB's in the area.  Overall I love this place but one of my co-workers and I agree that their chicken salad is terrible.  Avoid.  But I really like everything else, and have been very happy with their service and smiles.", "rating": 5, "date": "2018-04-18"}], "italian salami": [], "club": [{"excerpts": ["Sandwiches start around around $5 and go up to $7.25 for the club sandwich.  ", "Great place to pick up a sandwich, whether one of their set ones or a build-your-own.  "], "author": "Connie L.", "review": "After years of living in Potrero, I thought I knew every good place to eat in the neighborhood.  But it's been several years since I lived there.  It was a surprise to see JB's Place just around the corner from the park.  Having a banner instead of a real sign made me think the place is new (though it's actually been there for quite a few years now), and the smell of fried onions and other greasy yumminess drew me to the door.  \n\nSandwiches have generous portions, and they can get pricey if you have a lot of additions (bacon: $1, avocado: $1, cheese, $0.50).  At least they give you quite a bit for the extra dough - I had several strips of bacon, a half cup of mashed avocados, and two slices of cheese.  You can add an order of fries to your sandwich for only a dollar, which is a decent deal.  Sandwiches start around around $5 and go up to $7.25 for the club sandwich.  Great place to pick up a sandwich, whether one of their set ones or a build-your-own.  Nice staff too.\n\nOne limited time plus: they have Girl Scout cookies!  All varieties were available when I went by earlier this week.", "rating": 4, "date": "2011-02-24"}], "egg  bacon": [], "avocado  egg": [], "veggie delight": [{"excerpts": ["I usually get either a hot pastrami sandwich, or a veggie delight, and am never disappointed."], "author": "Kay M.", "review": "This is one of our very few options for lunch around work, and is totally solid, sandwich/burger type lunch food. I usually get either a hot pastrami sandwich, or a veggie delight, and am never disappointed.", "rating": 4, "date": "2012-03-23"}], "macaroni": [{"excerpts": ["Pretty good side salads such as tortellini & sun-dried tomato, crab, and macaroni.  ", "The owners are dolls and the joint always has someone in it.  ", "A hood staple!"], "author": "Tara G.", "review": "A little hole in the wall deli that'll surprise ya!  Not much to look at but they make a decent sandy and a fantastic chicken caesar, with sauteed chicken, onions, & peppers in a barely there scrumptious dressing.  It's huge and filling!  Pretty good side salads such as tortellini & sun-dried tomato, crab, and macaroni.  The owners are dolls and the joint always has someone in it.  A hood staple!", "rating": 4, "date": "2006-08-29"}], "cheese tortellini": [], "caesar chicken": [], "caesar shrimp": [], "jb salad plate": [], "homemade chili beans with meat": [{"excerpts": ["Love the homemade chili beans with meat.. ", "it has the perfect spice! ", "Their fries are popular too! \n", "Definitely worth coming back to!"], "author": "Heidi B.", "review": "Love this place! I first learned about this place about 20 years ago when I attended a school nearby. They were great then and great now! \nThe prices are reasonable and the owners are very friendly and personal! \nLately I have been getting JB's salad with options to top it off with different salad concoctions (i.e. ceviche, falafel salad, grilled chicken breast, avocado, tuna salad, devil's egg etc).  The grilled chicken is so good, soft and flavor is just right! They give good recommendations if you are indecisive! They do catering too! They specialize in sandwiches but they have other homemade specials. Love the homemade chili beans with meat.. it has the perfect spice! Their fries are popular too! \nDefinitely worth coming back to!", "rating": 5, "date": "2017-09-20"}], "potato": [{"excerpts": ["They pretty much have everything: burgers, pasta, sandwiches, falafel wraps, baked potato, salads, soup, cookies, steak over rice (today's special), etc.  "], "author": "Jacquelynne S.", "review": "Don't you hate it when you only have an hour lunch break and you're trying to figure out where to eat with a bunch of your coworkers?  Someone is craving a turkey sandwich, while another is craving a burger.  Nobody can make up their damn mind and...oh wait, we just spent 10 minutes debating on where to go.  Great!  Now there's only 50 minutes left.\n\nThe best solution (for those that work close by), is JB's.  The food here is AMAZING, cheap, and fresh.  They pretty much have everything: burgers, pasta, sandwiches, falafel wraps, baked potato, salads, soup, cookies, steak over rice (today's special), etc.  You can't really go wrong.  \n\nThe staff's nice and the line is tolerable. \n\n+5, no complaints so far.", "rating": 5, "date": "2009-05-27"}, {"excerpts": ["super tasty salads/sides - potato salad is pure win."], "author": "Roger C.", "review": "Bombdiggity sammies and burgers -  super tasty salads/sides - potato salad is pure win.", "rating": 5, "date": "2011-05-26"}, {"excerpts": [", \nI get the baked potatoes at lunch time,\nthey are really nice and put what I want on the potato\nits tasty\nreasonably priced, \nthey use recyclable paper in the \"to go\" containers.\n", "they have one table outside.\n", "it looks like they take phone orders.\n"], "author": "adam m.", "review": "I like this place, \nI get the baked potatoes at lunch time,\nthey are really nice and put what I want on the potato\nits tasty\nreasonably priced, \nthey use recyclable paper in the \"to go\" containers.\nthey have one table outside.\nit looks like they take phone orders.\nI know they take credit cards\n\nif your in the area and want a fast lunch, \nthis is your place.", "rating": 4, "date": "2007-10-11"}], "fruit": [{"excerpts": ["We also shared a package of fresh cut fruit. ", "While appearances make this place look like a run of the mill sandwich/snack shop, everything was surprisingly tasty and made with care. ", "The environment and employees were super friendly. ", "If you get the falafel wrap make sure to get it spicy, the sauce added an excellent dimension to an already solid meal. ", "I want to come back and try more menu items."], "author": "Dan M.", "review": "I took my 5 year old here for lunch, it's right around the corner from Jackson Playground in Potrero. He had a grilled cheese and I had falafel wrap. We also shared a package of fresh cut fruit. While appearances make this place look like a run of the mill sandwich/snack shop, everything was surprisingly tasty and made with care. The environment and employees were super friendly. If you get the falafel wrap make sure to get it spicy, the sauce added an excellent dimension to an already solid meal. I want to come back and try more menu items.", "rating": 5, "date": "2014-05-14"}, {"excerpts": ["(Even Jumbo containers of fresh fruit slices. "], "author": "Kim I.", "review": "I work in the area, I go for lunch sometimes, I eat the veggie burger and fries and avocado sandwich, I chat with the nice people behind the counter, I enjoy.  \n\nThe guy and his wife who run the cash register are very, very nice.  Even nice to the rambling alcoholic man I saw ramble in and, um, ramble something incoherent about...something that had to do with coming back the next day?  Hm.  The owner nodded a \"whatever\" nod, politely, all three times in response to the rambler's promise to come back the next day.  That got to me.  THEY'RE NICE TO BUMS!  I'm giving this place my business forever.\n\nAnd their little kids running around are cute, too.  They need my money for their college funds.\n\nAnd the food--it's pretty good!  \n\nGreat selection. (Even Jumbo containers of fresh fruit slices. Nice.)\n\nFast service. \n\nGet your buns in there and be nice to the bums with them.  It's a family affair, yo.  It's a small world.", "rating": 4, "date": "2006-08-05"}, {"excerpts": ["love the chef salad, fruit salad has been perfect 95% of the time (hence 4 stars and not 5..) grilled chicken caesar, and the ham & cheese omelette is phenomenal."], "author": "Abigail W.", "review": "love the chef salad, fruit salad has been perfect 95% of the time (hence 4 stars and not 5..) grilled chicken caesar, and the ham & cheese omelette is phenomenal.", "rating": 4, "date": "2010-11-01"}, {"excerpts": ["oh they also have really good fruit salads and in large portions for only $3.50."], "author": "H. L.", "review": "this place gets pretty busy at lunch time.  they do classic deli sandwiches... but their ingredients reminds me of subway, and i hate subway.  they have a lot of variety of bread here, which is always a plus.  the guy over the counter was really nice and made my custom sandwich to order (dutch crunch, eggplants, red peppers, provolone, and vinaigrette dressing).  \ni know, i'm a pretty bossy person.  so for putting up with me, this deli gets 4 stars. \noh they also have really good fruit salads and in large portions for only $3.50.", "rating": 4, "date": "2008-06-12"}], "italian pasta": []}