{"kitsune udon": [{"excerpts": ["I ordered the Kitsune udon with tempura on the side. ", "Delicious and very filling!"], "author": "Brenna L.", "review": "Finally got to try this place! I love Maragume Udon and I would say this place is quite similar. Cafeteria style where you can choose your udon and help yourself to tempura, spam masubis, etc. I ordered the Kitsune udon with tempura on the side. Delicious and very filling!", "rating": 4, "date": "2018-10-25"}, {"excerpts": ["I got the kitsune udon, which was pleasant, though I would have liked a little more flavor in the broth and a bit more chew to my udon. ", "Other Yelp reviews mentioned the noodles being chewy, so I'm hoping it was just a little over that visit. "], "author": "Lydia C.", "review": "Finally tried Kagawa- Ya near the Civic Center/Van Ness area. They make fresh sanuki udon daily--look at these long strands! \n\nI got the kitsune udon, which was pleasant, though I would have liked a little more flavor in the broth and a bit more chew to my udon. Other Yelp reviews mentioned the noodles being chewy, so I'm hoping it was just a little over that visit. I would definitely try it again.\n\nYou can get a free piece of tempura with a Yelp check-in, so I opted for an ebi/shrimp. Pretty decent, and there's hot tempura sauce near the shichimi togarashi and other condiments.\n\nSeating is cafeteria style, but there are plenty of tables and it was clean.\n\nAll in all, it's a quick, enjoyable lunch, and well-priced for San Francisco.", "rating": 4, "date": "2018-07-08"}, {"excerpts": ["$5 Kitsune Udon on 4/12 for the first 100 diners!"], "author": "Charlene F.", "review": "I tried 4 of their udon and my favorite is the creamy kabocha with chicken! You can order the bowl without the udon, too! The concept is very much like Chipotle, you're in and out after going on their assembly line. Do yourself a favor and order some broccoli tempura! It's really good! The noodles are the right amount of chewy and the flavors are really unique. Don't expect your typical udon here, because they combine flavors to create new items!\n\n$5 Kitsune Udon on 4/12 for the first 100 diners!", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["I tried the Kitsune udon and grabbed a beef onigiri. ", "About $15 for lunch. ", "Sounds about right for San Francisco. ", "Anyways, I enjoyed my udon. ", "The noodles were soft and the broth was flavorful without being too salty. ", "My bowl didn't include any meat, but there were so many veggies that I didn't mind. ", "I enjoyed my beef onigiri a couple hours later. ", "It still tasted great. ", "Sadly, even with instructions, I couldn't open it correctly. ", "Practice makes perfect! ", "I was expecting it to just have a filling in the middle, but all the ingredients are mixed in with the rice. "], "author": "Tiffany N.", "review": "A little early to my interview, so I decided to check out this place if I'm going to be working in the area. Not many options to choose from, but what I like is how they cater to their customers. Quick, simple service for those who are on a time crunch during lunch.\n\nThe process is simple. Order what type of udon you want, grab a tray, pick up your bowl down the line, grab tempura/musubi/onigiri if you'd like, pay, and enjoy your meal. \n\nI tried the Kitsune udon and grabbed a beef onigiri. About $15 for lunch. Sounds about right for San Francisco. Anyways, I enjoyed my udon. The noodles were soft and the broth was flavorful without being too salty. My bowl didn't include any meat, but there were so many veggies that I didn't mind. I enjoyed my beef onigiri a couple hours later. It still tasted great. Sadly, even with instructions, I couldn't open it correctly. Practice makes perfect! I was expecting it to just have a filling in the middle, but all the ingredients are mixed in with the rice. You get all the ingredients in every bite.\n\nWhen you're done, recycle, compost, trash, and place your tray at the window. Water is self serve with cups right by it. Extra condiments and tempura sauce next to the water. Quick, simple process for some great food!", "rating": 4, "date": "2018-01-29"}, {"excerpts": ["The Kitsune udon is my go-to. ", "Light, flavorful broth. "], "author": "Ashley S.", "review": "Good fast causal go-to for good chewy udon noodz. Not the best you'll have, but very fulfilling. Ordered pickup once via Grubhub and walked-in another time and ordered takeout. \n\nI don't know if it just depends on who is working, but I like that they separate the noodles and soup in two bowls when I ordered takeout online. When I ordered takeout in-store they put everything in one bowl. Which makes the noodles soggy-ish. And you get less noodles. \n\nThe Kitsune udon is my go-to. Light, flavorful broth. Clean. \n\nSo far, I haven't enjoyed any of the tempura I've ordered (have tried the fish cake, egg, and broccoli). Will try again next time.", "rating": 4, "date": "2018-06-30"}, {"excerpts": ["I ordered the kitsune udon with a poached egg and a shrimp tempura on the side. ", "The broth was not hot enough for me, and the noodles were still a bit chewy. ", "The broth was decent, but I prefer a stronger taste. ", "There was a good amount of food though, with ample veggies and wakame too. ", "It was a decent, convenient meal close to Civic Center Bart. ", "I also liked how they gave us free onigiri when they were closing to avoid letting it go to waste."], "author": "Victoria L.", "review": "Pro tip: if you check in on Yelp, you get a free tempura of your choice. I would give this place 3.5 stars if I could. I came here during dinnertime on a Wednesday, and there was hardly anyone in the restaurant which was refreshing, given most places in SF always have a wait. \n\nThe set-up of the restaurant is like an udon bar where you get a tray, order your meal, receive it, and find seating on your own. It felt like a model of the famous Marukame udon bar in Honolulu. \n\nI ordered the kitsune udon with a poached egg and a shrimp tempura on the side. The broth was not hot enough for me, and the noodles were still a bit chewy. The broth was decent, but I prefer a stronger taste. There was a good amount of food though, with ample veggies and wakame too. It was a decent, convenient meal close to Civic Center Bart. I also liked how they gave us free onigiri when they were closing to avoid letting it go to waste.", "rating": 4, "date": "2018-04-09"}, {"excerpts": ["I thoroughly enjoyed my Kitsune udon. ", "Delicious, comforting broth with fresh udon, seaweed and sweet soybean skin. "], "author": "Mary L.", "review": "I finally got the chance to come back to Kagawa-Ya. I thoroughly enjoyed my Kitsune udon. Delicious, comforting broth with fresh udon, seaweed and sweet soybean skin. I added a few pieces of tempura - light and crunchy. \n\nSince my Kutsune lunch was so satisfying, i ordered the Spicy Beef Tan Tan Udon to go. I just ate it for lunch and it's become another favorite! The broth is spicy, rich and flavorful; the bean sprouts provided a nice crunch and the cilantro added a fresh note (yes, I like cilantro). \n\nI will definitely be back! But I won't know what to order; Kitsune, Spicy Beef Tan Tan, Curry...", "rating": 5, "date": "2018-10-10"}, {"excerpts": ["I've had the kitsune udon and the pumpkin one. ", "Both are delicious and very filling. ", "The only one I can't eat is the soup that has beef in it. "], "author": "Vira P.", "review": "I really like the soup at Kagawa-Ya Udon and I'm happy they have a spot on Market. \n\nIt's cafeteria-style with just a few options on the menu for quick service. I've had the kitsune udon and the pumpkin one. Both are delicious and very filling. The only one I can't eat is the soup that has beef in it. I know I'll have to come back and try the veggie option and the cold udon. \n\nI find the broth in the kitsune to be comforting, and I like the different textures from the tofu skin, tempura bits, and the seaweed. The tempura, after awhile, gets soaked into the soup so I prefer to dine in when choosing this option.  And the udon itself is cooked perfectly. The noodles are thick and have a good bite. \n\nThey also have assorted tempura for $1.50 each. As my coworker says, my eye be pimpin my brain because I always order at least 2 pieces of tempura, but can barely finish my lunch because the soup is so filling! Luckily I didn't get the musubi. That would've put me over the edge. So far I've had the shrimp tempura, curry potato, and the fish cake. Crunchy and it's not too greasy. \n\nThe space is open and very clean. The are different table set ups so it's easy for groups or solo diners to sit among each other. \n\nThe soups are around $11, and go up from there. I find it's a good place to easily get lunch, or dinner after work if you're really hungry, in the area, and just can't wait to eat.", "rating": 4, "date": "2017-07-27"}, {"excerpts": ["I opted for the #1 kitsune udon (no meat, but had greens and tofu) and with a check-in offer of a free piece of tempura. "], "author": "Christina G.", "review": "Was looking forward to this place since it opened, but never had the opportunity to be in the neighborhood until this past weekend. The menu prices were not the cheapest for udon, $9-$15. I opted for the #1 kitsune udon (no meat, but had greens and tofu) and with a check-in offer of a free piece of tempura. I got the chicken tempura and a curry potato croquette making the total to about $13. \n\nThe tempura and potato were cold and didn't taste very fresh as it was probably sitting out for a while. It was a Saturday afternoon, so probably not as fast-paced and busy as a weekday. There was a good amount of udon and the greens were good, but the broth was super salty. \n\nThe location is pretty close to Twitter and a bunch of other tech companies, so I can imagine it gets pretty busy during week day lunch time. Definitely not worth the trek of going to the area specifically to try this place.", "rating": 2, "date": "2018-02-18"}, {"excerpts": ["I wasn't that hungry, so I went with the basic kitsune udon ($9.50), which comes with dashi broth, sweet soybean skin, wakame seaweed, tempura crunch and green onions. ", "The kitsune udon doesn't come with any meat, so I also helped myself to some shrimp and fish cake tempura.\n\n"], "author": "Dianna H.", "review": "Kagawa-Ya Udon is perfect for a quick and casual bite to eat right before heading to a show. My friend and I had tickets to the Nutcracker on a Wednesday night, and I picked this spot since I've been meaning to check it out and it was conveniently nearby.\n\nOrdering is super simple. You choose a base udon (they have a decent selection with 7 options) and then grab any additional tempura toppings you want. \n\nI wasn't that hungry, so I went with the basic kitsune udon ($9.50), which comes with dashi broth, sweet soybean skin, wakame seaweed, tempura crunch and green onions. The kitsune udon doesn't come with any meat, so I also helped myself to some shrimp and fish cake tempura.\n\nTo me, udon is a simple but delicious meal. The hot dashi broth really hit the spot for a cold winter's night in San Francisco, and the shrimp and fish cake tempura helped add some flavor to what would have otherwise been a bland bowl of udon.\n\nThe space is nice and big too. It was well lit and had a very modern look to it. Given that it was a random Wednesday evening, it was pretty empty and we were able to take our pick of seating.", "rating": 4, "date": "2017-12-28"}, {"excerpts": ["We ordered the Kitsune Udon and the Niku udon and got a spam musubi, sweet egg tempura, and a curry croquette. ", "I didn't think anything special about the noodles. ", "I thought they would boil the noodles when I ordered it "], "author": "Avita S.", "review": "Came here on a Wednesday night before catching a show at the SHN Orpheum. I arrived a little bit after 6:30 and was slightly worried because they closed at 7PM. Ordering was super easy and the food came out fast. We ordered the Kitsune Udon and the Niku udon and got a spam musubi, sweet egg tempura, and a curry croquette. I didn't think anything special about the noodles. I thought they would boil the noodles when I ordered it but what I saw is that the noodles were already boiled waiting on a steam bed of some sorts. \n\nThe broth for the kitsune was very good and I liked the kitsune although different than what I had before. Their kitsune is a sweet soy sauce flavor which I liked. \n\nThe Niku udon was okay. The broth was too sweet for my taste. It reminded me of kbbq marinated bulgogi but udon style.\n\nSpam musubi was good but I thought the proportions were off. Lots of rice compared to the thickness of the spam. Made it seem healthier though.\n\nThe sweet egg tempura I got because it seemed interesting. It was okay, wish it was softer and air-re-er (I don't know how to spell). \n\nThe curry croquette was just okay too, I've had better at Nijiya market. Probably would not get that again.\n\nOverall pretty good and glad I made it in time!", "rating": 4, "date": "2017-07-20"}, {"excerpts": ["I got my kitsune udon and 3 pieces of tempura for around $15.  ", "If I find myself in SF on a weekday I'd return for sure."], "author": "Brent T.", "review": "On a week with no work I had to pop into Fatted Calf for something, and decided I'd have lunch nearby.  I chose to eat at Kagawa-Ya since it's only open on weekdays.\n\nThis is sort of like Marukame-light.  Last time I was in Hawaii I had Marukame Udon and it was great and a fun concept.  You get your udon (with handmade noodles) and a selection of tempura to accompany if you so choose.\n\nThat's basically what you get here as well.  I don't know if there's quite the selection of tempura but otherwise it's pretty much the same experience.\n\nEverything I had was tasty and being that I came in at the tail-end of lunch hour I was able to get my food pretty much immediately.  I got my kitsune udon and 3 pieces of tempura for around $15.  If I find myself in SF on a weekday I'd return for sure.", "rating": 4, "date": "2017-12-30"}, {"excerpts": ["I ended up going with the Kitsune Udon which came in at $9.5.  ", "The only udon under $10 just fyi.  ", "Anyways, it was alright.  ", "The broth had a great dashi flavor, noodles were cooked great.  ", "The inari was just ok, a bit too big, would've been nice if it had been cut in half or something.  ", "The inari also felt rather thick.  ", "The shrimp tempura was okay, seemed like frozen pre-battered kind.  ", "The vegetable tempura was great", ", I was glad they had pumpkin tempura available.  ", "As for the spam musubi, it was good, the rice was seasoned with furikake which added some extra flavor.  "], "author": "Bryson L.", "review": "Since there are probably a decent number of people familiar with it, I'll compare Kagawa to Marukame Udon in Hawaii (which is usually in Yelps top 100).  Kagawa-Ya is a cafeteria style udon restaurant in the heart of SF.  It has a good variety of udon choices as well as tempura.  I was even surprised to see spam musubis!  \n\nWhile the pricing isn't all that cheap, the portions for their udon are pretty large.  The tempura is about the right price at $1.50 per piece (regardless of vegetable or shrimp tempura).  Spam musubi is quite pricey at $3.  I ended up going with the Kitsune Udon which came in at $9.5.  The only udon under $10 just fyi.  Anyways, it was alright.  The broth had a great dashi flavor, noodles were cooked great.  The inari was just ok, a bit too big, would've been nice if it had been cut in half or something.  The inari also felt rather thick.  The shrimp tempura was okay, seemed like frozen pre-battered kind.  The vegetable tempura was great, I was glad they had pumpkin tempura available.  As for the spam musubi, it was good, the rice was seasoned with furikake which added some extra flavor.  It didn't appear to have any kind of teriyaki sauce like you might find in some musubis.\n\nOverall, it is no Marukame Udon, however, it is a good attempt at the cafeteria-style udon restaurant.  The food here is great if you're craving udon, especially since there aren't many restaurants in the Bay that specifically specialize in udon.  Personally, I wish the udon had a small-sized available, that way I could eat more tempura.  The udon portions are quite large.", "rating": 4, "date": "2017-10-25"}, {"excerpts": ["It can be on the pricey side, I think I ended up paying $20+, but I got a kitsune udon (beef sounded too heavy at the moment) with a bunch of tempura and a spam misubi and poached egg. "], "author": "Kenny N.", "review": "This place is dope! I've never really been into Udon, but I know every time I see one of my friends in Hawaii eating Marukame, I want tempura. What's not to love about tempura? \n\nIt can be on the pricey side, I think I ended up paying $20+, but I got a kitsune udon (beef sounded too heavy at the moment) with a bunch of tempura and a spam misubi and poached egg. Very tasty, and now I like udon, but probably only from places that have tempura (since tempura is awesome).\n\nIt's too bad this place is so far away. We need one of these down in the south bay so I don't always have to go up to SF to eat this :).", "rating": 5, "date": "2017-11-19"}, {"excerpts": ["Their kitsune udon is the taste of my childhood! ", "Great job!"], "author": "Young I.", "review": "Awesome! Great finesse and skill in the dashi broth, fried tofu, tempura, and fresh made noodles! People are so nice too! Their kitsune udon is the taste of my childhood! Great job!", "rating": 5, "date": "2018-08-25"}, {"excerpts": ["My only complaint about the Kitsune Udon was that I ate all the noodles and didn't want to stop! ", "This is udon done right.  \n", "The sweet soybean was a pleasant surprise. ", "I also had the sweet potato tempura, heavenly.  "], "author": "Teresa L.", "review": "(Note: I have a very sensitive palate. This means I don't like spicy foods, but I can taste the difference between generic, mass-produced noodles and handmade. If you can't get plain noodles right, you have no right being in business.)\n\nWhen it comes to noodles, Kagawa-Ya knocks it out of the park. My only complaint about the Kitsune Udon was that I ate all the noodles and didn't want to stop! This is udon done right.  \nThe sweet soybean was a pleasant surprise. I also had the sweet potato tempura, heavenly.  My friends got very excited about something that was essentially spam-fried-rice turned into a waffle cone and stuffed with chicken and other goodies.\n\nThe space is open and airy, and always very clean. I love that they have compost, recycling, and landfill bins. The staff is always very courteous to us, and very efficient.", "rating": 5, "date": "2018-08-15"}, {"excerpts": ["Kagawa-Ya's selection is significantly smaller (just six options) than Hanamaru's but thankfully one of them is my go to: Kitsune udon.\n\n", "I dig the concept and the offerings but wasn't wowed by my kitsune udon. ", "The tofu was denser than I prefer and the broth was just okay. "], "author": "Miriam W.", "review": "This place reminds me a lot of a chain I frequented in Japan called Hanamaru Udon where I could reliably get a cheap and delicious bowl of noodles. Kagawa-Ya's selection is significantly smaller (just six options) than Hanamaru's but thankfully one of them is my go to: Kitsune udon.\n\nAs in Japan, at Kagawa-Ya you grab a tray, choose an udon and after you're given your bowl you can serve yourself croquettes or pieces of tempura before settling your tab at the end of the counter.\n\nI dig the concept and the offerings but wasn't wowed by my kitsune udon. The tofu was denser than I prefer and the broth was just okay. The tempura bits that topped the dish turned slurry-like quickly which wasn't so pleasant. \n\nIf I were nearby I might stop in again to try the curry udon, but I wouldn't go out of my way to return to Kagawa-Ya Udon.", "rating": 3, "date": "2017-07-24"}, {"excerpts": ["Tried their basic Kitsune Udon with soft boiled egg (onsen style), tempura, spam masubi and onigiri.  ", "Only recommending the udon and tempura and you can skip the spam masubi and onigiri.  ", "Spam was about a 1/4\" think and rice almost 1.5\" thick, it's completely out of proportion with too much rice.  "], "author": "Shirley H.", "review": "Similar to Marukame, Kagawa serves the same kind of Sanuki style udon in a modern udon bistro and operate in the same cafeteria style.  They said their udon is made fresh daily.\n\nTake Muni and stop at \"Van Ness\" station and it's just a couple minutes walk after you exit to the street level.  It's located in the Square / Uber building ground floor.\n\nTo get your food, just line up like in a cafeteria, pick up a tray, place your order with the person behind the cook counter, grab your bowl of udon, select your choice of tempura ($1.5 each piece) if you want, then make your way down to the end of the line to the cashier for drinks and pay.  Get your water, tempura sauce, utensils, etc...then find your own table, eat, finish and return the tray to the window where they will collect your dirty dishes.  Pretty much everything is self-serve and you can be in and out fairly quickly if there's no line.\n\nTried their basic Kitsune Udon with soft boiled egg (onsen style), tempura, spam masubi and onigiri.  Only recommending the udon and tempura and you can skip the spam masubi and onigiri.  Spam was about a 1/4\" think and rice almost 1.5\" thick, it's completely out of proportion with too much rice.  The onigiri was pretty bland.  \n\nI think I will go back if I feel like a bowl of warm udon soup to warm my soul, I mean tummy in a cold chilly day but otherwise, it's pretty mediocre.", "rating": 3, "date": "2017-08-11"}, {"excerpts": ["Delicious Kitsune Udon.  ", "I recommend getting the shrimp and fish cake tempura as well as the creamy potato croquette.  ", "Will be back!"], "author": "Julian C.", "review": "Decided to check this place out before seeing Aladdin.  Delicious Kitsune Udon.  I recommend getting the shrimp and fish cake tempura as well as the creamy potato croquette.  Will be back!", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["I ordered the kitsune udon and picked up 2 shrimp tempura and 2 croquette. ", "I've always tended to stay away from udon places because I could make almost the same quality udon at home from those semi-instant noodle packets that are sold at Asian markets. ", "The noodles were ok, nothing too special. "], "author": "Carolyn Z.", "review": "I used to work near Uber and would pass the sign that indicated that Kagawa-Ya was opening soon. I've been telling my boyfriend that we needed to go when they opened. So when it finally opened, we went. \n\nI really liked how the layout was kind of like udon shops that can be found in Japanese subway stations. You get in line, grab a tray, and indicate which kind of udon you want. Then you move your tray along and pick up some tempura pieces before checking out. \n\nI ordered the kitsune udon and picked up 2 shrimp tempura and 2 croquette. I've always tended to stay away from udon places because I could make almost the same quality udon at home from those semi-instant noodle packets that are sold at Asian markets. The noodles were ok, nothing too special. The tempura and croquettes were crispy, but not hot. \n\nThe prices were a bit pricey, but understandable considering the location. The udon was $9.50 I think, which is ok. But after I added the tempura and croquette, it was an additional $6. \n\nI will go back if I'm craving udon near Market St. But ultimately, I would rather eat udon at home and go out for ramen.", "rating": 3, "date": "2017-05-04"}, {"excerpts": ["There's also the Cold and Kitsune Udon. \n\n"], "author": "Alice Z.", "review": "Really excited to have a good udon place open up in SOMA! I really like the efficiency and reasonable prices. I would say the portions are on the smaller side (I did get take-out). I did pay $13 for the Beef Curry Udon and still felt a bit hungry after, hence the 4/5 stars. However, I do admit that I have a large appetite. I came at around 3pm and there were only a couple diners, but given that Twitter and Dolby are right around the corner, I can imagine this place getting crowded. \n\n[Food]\nThere's only five options, so if you're indecisive like me that makes your life a lot easier! I really enjoyed the Beef Curry Udon! The beef was tender and was not overly heavy and the udon noodles were deliciously chewy (I like my noodles al-dente). I'll definitely be back to try the Niku and the Creamy Kabocha Udon. There's also the Cold and Kitsune Udon. \n\n[Service]\nThere's a line where you select among the five options. If you want take out they'll put it in a paper bowl for you to take away. Bag is 10 cents. I would say the portion for take away is smaller than eating from the larger bowl. \n\n[Decor]\nOpen space with an efficient ordering system. SOMA vibes. \n\nIf you're in SOMA and looking for a no hassle quick and delicious meal, definitely stop by and give this place a try!", "rating": 4, "date": "2017-04-14"}, {"excerpts": ["I recommend getting Kitsune udon (warm dashi broth) with 3 shrimp tempuras. "], "author": "Ken H.", "review": "Wew lads, this may be San Francisco's first authentic professional-grade udon noodle house!\n\nI get regular cravings authentic Japanese noodle dishes, but I'm rarely in the mood to line up for Mensho Tokyo or Hinodeya Ramen. Kagawa-Ya might be my solution from here on -- at 1pm, there was barely a line, and fast casual service meant that I was seated and eating within 5 minutes of entering the establishment.\n\nI recommend getting Kitsune udon (warm dashi broth) with 3 shrimp tempuras. That comes out at $14 for a hearty meal.\n\nThe noodles were very dense and chewy and clearly fresh made with a lot of care. It definitely surpasses the quality of frozen sanuki udon (which has more of a light tapioca springiness) and  the noodles at Udon Mugizo (which is often cooked so soggily by their careless staff). The dashi was very rich and satisfying, and the sprinkle of fried tempura batter in the soup definitely brings out a pleasing fragrance.\n\nKeep doing what you're doing, Kagawa-Ya! My only advice is to maybe watch out for your tempura cook (2 shrimps of mine were great, but the eggplant was under-fried and kind of raw). Smooth out kinks and I think this place will last long. Good luck! I will be back.", "rating": 5, "date": "2017-04-28"}, {"excerpts": ["Some of my favorites are the Kitsune Udon, Beef Curry Udon, and Niku Udon, along with their tempura and Spam Masubi.\n\n"], "author": "Dave W.", "review": "I don't eat carbs regularly, so when I have a cheat meal I have to choose what I want and it better be worth it and Kagawa-Ya Udon is SOOOO worth it. Some of my favorites are the Kitsune Udon, Beef Curry Udon, and Niku Udon, along with their tempura and Spam Masubi.\n\nThe udon noodles are so fresh and absolutely amazing, the texture is soft, but has enough bite which is exactly what makes a perfect noodle. The broths are all made from scratch and you can tell, the flavor is amazing and really comes through with every taste. The tempura is fried beautify, light and crispy, and you can't go wrong with the Spam masubi.\n\nIf you're in the area, and you want something that is from a legit kitchen, but is still fast and quick definitely check this pace out.", "rating": 5, "date": "2018-04-01"}, {"excerpts": ["The kitsune udon had some massive piece of thick, chewy \"kitsune\" which wasn't really pleasant to eat. "], "author": "masa s.", "review": "If you've ever been to Marukame Udon, imagine a menu with half the selection, 3x the price, and maybe 1.5x the wait, once you order. (If you've ever been to the Waikiki Marukame, you know what I'm talking about.)\n\nUdon doesn't have to be great. But, Kagawa's noodles had no body at all. The soup wasn't bad, but it was a little weak. The kitsune udon had some massive piece of thick, chewy \"kitsune\" which wasn't really pleasant to eat. I usually like to savor it as I eat, so that was a pretty big disappointment.\n\nI love Japanese noodles, so I really want to have more shops besides ramen in this town. But, I won't be eating here again. If you want to have some good udon, go to mugizo.", "rating": 2, "date": "2017-07-14"}, {"excerpts": ["If you're feeling like eating Udon, pack instant kitsune udon from nijiya priced around $1/$2 and skip this place. "], "author": "Tomo U.", "review": "The taste of the udon is good. I had both kitsune and cold udon. The main problem of this place is the price. This place is an insult to Japanese Udon. niku udon in the original Kagawaya is priced around 490 yen. That's $4.3 in today's conversion. The niku udon as of today is priced around $14. That's an insult to anyone who knows that a good udon can't only be good, but it also has to be cheap. I would understand if their portions are larger. I feel full after eating Orenchi ramen where their main ramen is priced around $13. This is not the case for this place, their portions barely makes me full. The tempura prices are alright.\n\nSo until they start pricing their niku udon around 8 to 9 dollars and their kitsune around $6 I am not going back. I'm okay if they keep their price but double the portions that is also acceptable. If you're feeling like eating Udon, pack instant kitsune udon from nijiya priced around $1/$2 and skip this place. I guarantee, if they keep their price and portions of today, they'll be out of business in around 6 months.\n\nEDIT:\n\nI'll change the review if they wake up and realize they're not in the ramen business. They're in the udon business.", "rating": 1, "date": "2017-05-11"}, {"excerpts": ["Will try the kitsune udon next time but the rest aren't as interesting, seems like they're just to round out the menu with more options palatable to the demographic.\n\n"], "author": "Peel S.", "review": "Pretty good for SF. There's not many places that make Udon fresh and this is one of the 3 prominent ones I'm aware of that do make it well. Noodles have a nice chew to it and the broth tastes freshly made with real ingredients.\n\nI've only had the Sanuki udon but do like the broth here. Its light and crisp tasting with just enough flavor for a light meal on a hot day. Will try the kitsune udon next time but the rest aren't as interesting, seems like they're just to round out the menu with more options palatable to the demographic.\n\nOne thing they could improve on is not making everything in one big batch. The noodles start tasting old and they lose that springiness near the end of the day. Hot crunchy tempura is a real treat with the sauce but degrades much quicker and starts getting chewier, stale as they turn room temp. It would make a huge difference if they fried to order or at least every hr or two.\n\nIt isn't really the place or kind of food that 'must be had' but rather if you already have a taste for it or crave it. The location isn't bad but the restaurant itself feels too much like a cafeteria. If it weren't for places like The Market down the block, it would feel more awkward. It most likely wouldn't do that well if it were an actual hole in the wall with cheaper rent and lower prices though.\n\nNot bad for a quick bite and a little overpriced but the quality is there for when you do want some decent udon.", "rating": 4, "date": "2017-06-20"}, {"excerpts": ["I like the kitsune udon best because it's savory and I can add tempura without feeling guilty. "], "author": "Jennifer W.", "review": "Nice to have an udon place to go to amongst all the ramen options around. I like that this place is fast-casual, but the price is where I get caught at. Menu is simple - choose an udon dish. There's only a handful or so. If you want, you can add pieces of tempura to your meal, but each tempura piece is $1.50!! If you eat with your eyes, this can add up easily. Under the heat lamps, they look real inviting. I like the potato and curry potato croquette. But other good ones include a veggie medly patty, pumpkin slice, and zucchini fan. The spam musubi and onigiri are $3 each. Pretty good portion and tasty. I like the kitsune udon best because it's savory and I can add tempura without feeling guilty. The cold udon comes with an egg and has a clean, simple taste. Niku udon has tons of beef. I can eat this one without adding tempura. Creamy kobocha is okay. Tastes buttery, creamy. The tomato udon reminded me of red pasta sauce. Not bad, but not my favorite. Interesting to try. Overall - you line up to order, pay for your order, find a place to sit, which isn't hard because the turnover is pretty high for this casual lunch spot. Clean digs. Bus your own trays.", "rating": 4, "date": "2017-09-21"}, {"excerpts": ["In the other day, I tried hot kitsune udon. ", "The broth is good. ", "But the noodles are not good for hot broth as well."], "author": "Satoshi N.", "review": "Don't expect good Sanuki udon noodles at this place.\n\nI had cold udon noodles at this place. It is the best item for quality test on udon noodles. Honestly speaking, it was below the bar. I expected it should be Sanuki udon noodles since the place name is \"Kagawa\" (Sanuki is the old name of Kagawa). Maybe my expectation was too high.\n\nIn the other day, I tried hot kitsune udon. The broth is good. But the noodles are not good for hot broth as well.", "rating": 2, "date": "2017-04-16"}, {"excerpts": ["I got the Kitsune udon ($9.50) and added a piece of fishcake tempura ($1.50 per).  ", "And I agree that it's a little pricey, especially for the non-meat (what is fish considered?) version.  ", "Flavor is okay.  ", "It had a lot of oil, and I felt a little greasy (and yeet hay) after. ", "Tempura wasn't the crispest, but it's also been sitting out for a while.  ", "The portion sizes worked for me. ", "I'd probably just add more tempura pieces on hungrier visits.  ", "I'm not opposed to going again, but I'm also not rushing back."], "author": "Glo T.", "review": "I want to like it more, but it's just okay.  I got the Kitsune udon ($9.50) and added a piece of fishcake tempura ($1.50 per).  And I agree that it's a little pricey, especially for the non-meat (what is fish considered?) version.  Flavor is okay.  It had a lot of oil, and I felt a little greasy (and yeet hay) after. Tempura wasn't the crispest, but it's also been sitting out for a while.  The portion sizes worked for me. I'd probably just add more tempura pieces on hungrier visits.  I'm not opposed to going again, but I'm also not rushing back.", "rating": 3, "date": "2017-07-22"}], "cold udon": [{"excerpts": ["What we got:\n1) cold udon --this was really refreshing and good, even on a colder day. ", "I don't think I have one bad thing to say about this bowl.\n", "2) creamy kabocha chicken udon--creamy, thick broth that gets you full quick. ", "I enjoyed this bowl a lot too!\n", "3) ", "tempura broccoli and pumpkin: the broccoli comes on a kebab, with about 3-4 pieces on it. ", "I enjoyed it ", "but which it was a little crispier/airy. "], "author": "Shannon N.", "review": "My sister and I came here on a Monday for lunch--the place is pretty tasty! You just tell the counter what udon you want (there are 5 choices), and from then, you can choose different types of tempura if you'd like. There was plenty of open seating for us also, and staff was super nice. \n\nWhat we got:\n1) cold udon --this was really refreshing and good, even on a colder day. I don't think I have one bad thing to say about this bowl.\n2) creamy kabocha chicken udon--creamy, thick broth that gets you full quick. I enjoyed this bowl a lot too!\n3) tempura broccoli and pumpkin: the broccoli comes on a kebab, with about 3-4 pieces on it. I enjoyed it but which it was a little crispier/airy. Same goes for the pumpkin.\n\nOverall, I think this is a solid place to go to if you're craving udon--The noodles were nice and chewy, and the portion definitely got my sister and I full. I'd come back again!", "rating": 4, "date": "2018-09-30"}, {"excerpts": ["My favorite dish is their #2 Cold Udon. "], "author": "Anh T.", "review": "Not sure how long it took for the ridiculous line to die down for good but it was a good 6 months or so before people realized they didn't want to spend $20 for a bowl of udon and tempura LOL\n\nMy favorite dish is their #2 Cold Udon. Perfectly fresh made noodles in a cold broth served with daikon, egg, green onion and nori with a lemon wedge. \n\nSean who is the owner...i believe? Is amazing and super friendly! At times when i am at work and on my coffee break i would pass by Kagawa-Ya and i would see him inside prepping noodles and waving at me from the inside. \n\nPretty big and decent place with great views for people watching on market street. They are located in the Uber building. i went in recently this week and noticed they are selling retail ! Super cute decal that i forgot to take a photo of. :) updates soon !", "rating": 4, "date": "2018-04-19"}, {"excerpts": ["I know I'll have to come back and try the veggie option and the cold udon. \n\n"], "author": "Vira P.", "review": "I really like the soup at Kagawa-Ya Udon and I'm happy they have a spot on Market. \n\nIt's cafeteria-style with just a few options on the menu for quick service. I've had the kitsune udon and the pumpkin one. Both are delicious and very filling. The only one I can't eat is the soup that has beef in it. I know I'll have to come back and try the veggie option and the cold udon. \n\nI find the broth in the kitsune to be comforting, and I like the different textures from the tofu skin, tempura bits, and the seaweed. The tempura, after awhile, gets soaked into the soup so I prefer to dine in when choosing this option.  And the udon itself is cooked perfectly. The noodles are thick and have a good bite. \n\nThey also have assorted tempura for $1.50 each. As my coworker says, my eye be pimpin my brain because I always order at least 2 pieces of tempura, but can barely finish my lunch because the soup is so filling! Luckily I didn't get the musubi. That would've put me over the edge. So far I've had the shrimp tempura, curry potato, and the fish cake. Crunchy and it's not too greasy. \n\nThe space is open and very clean. The are different table set ups so it's easy for groups or solo diners to sit among each other. \n\nThe soups are around $11, and go up from there. I find it's a good place to easily get lunch, or dinner after work if you're really hungry, in the area, and just can't wait to eat.", "rating": 4, "date": "2017-07-27"}, {"excerpts": ["As an aside, I wish they had more cold udon options besides the regular Cold Udon, and hopefully, they would expand their repertoire of cold udon. ", "Other than that, I would highly recommend Kagawa-Ya for anyone with a craving for good udon in SF."], "author": "Nelson X.", "review": "You know, I can't believe my unbelievable luck of having two new udon places open up in SF during the past year. Udon is one of my favorite foods, and to have smacked right on Market Street makes it even better. I was very excited to try out Kagawa-Ya, and I came here on a weekday evening with a friend to satisfy my hunger for udon. I was expecting it to be really crowded here since it's smacked right in the middle of where all the tech companies are and we came during dinner hours but was surprised when it was at 20% capacity. The good thing about that was that we got to choose our seats, and we decided to sit on the stools by the window peering outside. \n\nWe then went up to the line and ordered our respective udon dishes. I decided to go for the Beef Curry Udon and for the tempura I got the sweet egg tempura, vegetable fritter, and the curry potato. They have a wide selection of tempura and I like how you're able to just choose one of whatever tempura you want instead of having multiple of the same tempura. I sampled the beef curry udon first and was very pleased with my choice, as the curry tasted fantastic and the tender beef just falls apart once I bit into it. What I like even more than the beef personally was the potatoes, and curry is always better with potatoes. One thing about the curry udon is that it wasn't as thick as I would have liked, and this was honestly more personal preference than anything. I moved onto the tempura next, and I started with the sweet egg tempura. I think the sweet egg tempura was alright, but to be honest, I never had a sweet egg tempura before, and I think it's more likely that I just don't like sweet eggs as a tempura in general. The vegetable fritter, on the other hand, was to my liking, and it was pretty crunchy and was a nice meld of vegetables. However, my favorite tempura was the curry potato, since it had a soft crusty exterior and a very soft interior. The curry flavor wasn't strong in the curry potato, but that could be because I was eating the beef curry udon at the same time, which probably overwhelmed the subtle curry flavor in the curry potato. Nevertheless, I felt very satisfied with the curry potato.\n\nOverall, I was very pleased with the meal, and I really like how they gave a generous helping of beef and potatoes with the udon. One thing about the price is, it's actually more than what I would expect to pay for udon, and the curry udon alone was $14. I can somewhat justify this since there were very generous portions of udon, and I did feel really bloated after eating it. I would definitely come back here again, and I could see myself ordering the Creamy Kabocha with Chicken Udon, or the Cream of Clam & Leeks Udon the next time I come here. As an aside, I wish they had more cold udon options besides the regular Cold Udon, and hopefully, they would expand their repertoire of cold udon. Other than that, I would highly recommend Kagawa-Ya for anyone with a craving for good udon in SF.", "rating": 5, "date": "2018-04-21"}, {"excerpts": ["I got the cold udon dish and it was really refreshing.\n\n"], "author": "Cassie Z.", "review": "Wasn't quite sure what I was going to get with a fast food Udon place but this place was better than I expected. \n\nFirst of all, you can't come to Kagawa-Ya expecting super high restaurant quality Udon. But if you have tempered expectations, I think this place will be perfect for you. The pricing is pretty typical for SF and the portions are about what you would expect for that price. If you start adding all the add-ons, it does get to the pricier end of udon. I got the cold udon dish and it was really refreshing.\n\nDon't come here expecting restaurant quality food. It is a more cafeteria style, fast-food udon but it is good for that experience!", "rating": 4, "date": "2017-10-31"}, {"excerpts": ["You line up at first to select from their preset menu of udon styles (warm soup, cold udon). ", "After they heat the udon noodles, combine it with broth and toppings, you can take a plate and pick any tempura from a line of selections; ranging from tempura shrimp, carrot, broccoli, curry croquette, spam musubi etc. ", "This style of serving is very similar to Marukame Udon. ", "Overall, the style is similar but the price is 2x as expensive as its counter part in Hawaii. ", "In comparison, the tempura here was poorly made, lukewarm (not nice and piping hot, freshly fried), oily and very heavy to the palate. ", "I really like properly-made Japanese tempura, which seems to be so hard to find in the SF Bay Area.  ", "I guess compared to the average Japanese restaurant, the tempura here is alright. "], "author": "Jenny Z.", "review": "I was really excited to eat at Kagawa-Ya because I had hopes that it would be similar to or match up to Marukame Udon in Waikiki, Oahu, HI...but man, was I was disappointed. \n\nTo be fair, the concept here is similar to what I was looking for. An fresh udon bar with selections of tempura and yakimomo (pan-fried appetizers). In essence, I think Kagawa-Ya achieved that but San Francisco ruined this one for me. First off, the location is slightly unappealing. While it is in SOMA, close to Uber HQ and Twitter HQ, the neighborhood around it makes me uncomfortable to walk around at night (near Civic Center/Tenderloin). That said, the inside of the restaurant looks clean and modern. The quality and flavor here was mediocre in comparison to what I have had before, lackluster and oversalted at its worst. \n\nYou line up at first to select from their preset menu of udon styles (warm soup, cold udon). After they heat the udon noodles, combine it with broth and toppings, you can take a plate and pick any tempura from a line of selections; ranging from tempura shrimp, carrot, broccoli, curry croquette, spam musubi etc. This style of serving is very similar to Marukame Udon. Overall, the style is similar but the price is 2x as expensive as its counter part in Hawaii. In comparison, the tempura here was poorly made, lukewarm (not nice and piping hot, freshly fried), oily and very heavy to the palate. I really like properly-made Japanese tempura, which seems to be so hard to find in the SF Bay Area.  I guess compared to the average Japanese restaurant, the tempura here is alright. But again, not as fresh tasting or light as the restaurant in Oahu, Hawaii. \n\nI will say two of their udon soups were more inventive, going for fusion flavors like cream of clam and leek udon, and spicy tomato udon with roasted shiitake. I was quite excited when I saw them and ended up choosing the cream of clam and leek broth. One thing that I definitely surprised me was that the quality of their udon noodles was very underwhelming. It honestly tasted like frozen udon noodles from Japan. It didn't have the nice bouncy al dente texture and freshness from homemade udon, which it actually really quite nice and more alkaline. I don't know where their udon is made or sourced, but they didn't have a noodle chef making it and it also didn't taste homemade to me. \n\nNow onto the broth. I'm going to be honest, I might be more harsh and critical about broth and taste because I often cook Japanese food at home, eat out at mostly Japanese restaurants, and have stayed in Japan for 2 weeks recently. I expected the broth to taste light, clean, ungreasy and well-balanced. It was the exact opposite of that. The clam and leek broth was oversalted, heavy and did not have a single clam in it! It makes me wonder if they used clam juice/clams in a bottle instead of real clams cooked down. The broth did not have depth and was overly heavy. I couldn't finish my dish, which is actually REALLY rare for me.  My husband ordered the classic niku (beef) udon, which was slightly better. However, it too was oversalted and lacked depth and complexity. For the price of about ~$15-18 per bowl of udon, I was pretty disappointed. The spam musubi was pretty standard and nothing to write home about. Because the tempura was lukewarm, fried in a bad batter, it tasted greasy a lack of crispy texture. Tempura, when done well, does a great job at highlighting the freshness of the vegetables, which was not executed well here. \n\nOverall, it was not a pleasant experience. While seating was plentiful and clean, the environment felt sterile. It reminded me a dormitory cafeteria but without the liveliness and chatter of a college campus. The food was mediocre- broth, noodles AND tempura. I know I am a food snob when it comes to Japanese food, so I understand that my review is low and disagrees with others. That being said, I think even if you do not eat Japanese food much, there are still better options for udon in San Francisco. Maybe they are a bit further, but they'll be a better bang for your wallet and it will taste noticeably better. \n\nI will try to come back next year to see if there was been improvement.", "rating": 2, "date": "2017-12-08"}, {"excerpts": ["Their cold udon already has a broth in it ", "so it's not dipping like you'd imagine. ", "They're currently not open on weekends and once they do open, their hours are 11-7 which is pretty neat since I live at nema and work in the square building! ", "The interior was nice and minimalistic and the place smelled deliciously like my favorite noodles! ", "Excited to have an udon place inside the  building!"], "author": "Vanessa K.", "review": "Here for their soft opening today! They're gonna be officially opened next Wednesday, April 12th. They had reasonable price udon from 9.50-14 and each mini side (tempura) was 1.50 with the option of spam musubi as well as onigiri. Their cold udon already has a broth in it so it's not dipping like you'd imagine. They're currently not open on weekends and once they do open, their hours are 11-7 which is pretty neat since I live at nema and work in the square building! The interior was nice and minimalistic and the place smelled deliciously like my favorite noodles! Excited to have an udon place inside the  building!", "rating": 5, "date": "2017-04-08"}, {"excerpts": ["Both were delicious and as the summer approaches, I can't wait to try the Cold Udon.  "], "author": "Lesley Q.", "review": "Loving this new spot!  I've tried the Niku and the Beef Curry Udon.  Both were delicious and as the summer approaches, I can't wait to try the Cold Udon.  YASSSS!  \n\nYou really can tell the difference in the quality of their noodles and I love that the service is fast and friendly.  I'll definitely be back!!", "rating": 5, "date": "2017-04-26"}, {"excerpts": ["I normally get the #3 Niku udon and #2 cold udon with shrimp tempera and sweet egg tempera. ", "They are just awesome! ", "Words can't describe the feeling inside me, you just have to try it ", "and you'll know how awesome it is. "], "author": "Kalum Z.", "review": "Walked by everyday and been waiting for them to open since last year because I am a food craving person.\n\nA new FRESHLY made Udon in the Soma. This will be my new go-to and pick-up place for lunch since it's really convinenced right next to the office. Only 6 choices on the menu, pretty clear designed, easy to understand and pick, unlike some places where you need to spend few minutes to look for tiny words of the description of the food. Heard that they'll substitute some of the choices in every season/quarter. \n\nAgain, noodles are freshly made and been through stages before it gets to my bowl. So warm and touchy. Get some tempera pieces along with the noodles and I'm full and satisfied for lunch. They always have the Onigiri (the triangle thingy wrapped with seaweed) and spam musubi ready to go. I like to just grab one for snacks :P \n\nService is fast, although there's a line. I got my bowl and seated within 5-10 minutes. All you do is to tell the chef which bowl number you want, they will make it for you and you just have to take it on the side, follow the line, and tempera station is self served, keep moving in the line and pay! Staff are nice and helpful. There are tempera/katsu/spicy sauces on the side to adjust your customized taste. I like that they serve the same amount (one serving of the noodles) no matter you dine in or take out. No Cheat Cheat :) \n\nI normally get the #3 Niku udon and #2 cold udon with shrimp tempera and sweet egg tempera. They are just awesome! Words can't describe the feeling inside me, you just have to try it and you'll know how awesome it is. PS: ask them to add a soft boil egg if you like.\n\nSeats are well organized and clean. Staff will wipe down the table time to time. After you finish eating, just leave the bowl on the side window and the dish washer will take it from you. It's really like a cafeteria setting. \n\nAround $15-20 a meal depending what you get and my stomach is fully stratified. I will come back for sure just because the food is great and I won't get sick of it.", "rating": 5, "date": "2017-05-06"}, {"excerpts": ["I think the cold udon is next with summer weather approaching! \n\n"], "author": "j w.", "review": "Spam Musubi - unfortunately I'm picky with my spam to rice ratio, and I would want my spam crispier, so I'm better off making my own when I have the craving. But good to know where I can get some when craving it/dont' want to make a whole batch! \n\nBeef curry udon - If you want a gravy type of beef curry, with potatoes and carrots, but just swap out rice for udon, then this is for you. I like marugame beef curry better - that one is more soupy to my taste. \n \nCreamy Kabocha with Chicken Udon- texture of chicken can be hit or miss, but love the broth. This is the thickness consistency I wish the beef curry udon broth was like. \n\nSpicy Sweet Bean Zhajiang Udon - the best one out of the three thus far to me. Meat is tender, savory flavor, and good amount of veggies. \n\nI appreciate the unique flavors, quick service, and refreshing variety it brings to the neighborhood. Looking forward to try more flavors! I think the cold udon is next with summer weather approaching! \n\nPeople may complain about the price, but noodles made fresh, and portions to me are so huge. If you get the ones with meat, I can't see ordering tempura or musubi in addition anyway.  \n\nTip - like all the other places around, if your lunch is flexible, go before noon, or after 1pm to avoid the crowds.", "rating": 3, "date": "2018-04-20"}, {"excerpts": ["My favorite was the cold udon and the niku. ", "The cold udon  was perfect for a warm day in the city. ", "The broth was perfectly seasoned, and the egg, yummmmmmm! ", "The Niku was delicious", ", I squeeze the left over lemon from the cold udon  and it was perfect! ", "The beef was so tender and flavorful. ", "I only got a zucchini ", "tempura bc ", "I felt it was too much too for two people. ", "I will definitely have to try the others next time. ", "The dipping sauce was on point. ", "I was going to get the spam musubi, but I was too stuffed, the  portions was huge! ", "The prices didn't really bother me, if I'm willing to spend $20+ on ramen at mensho, then I don't think $14 is that bad. ", "I would definitely come back for more."], "author": "Tia O.", "review": "I thought this place was amazing! The service was great and the food was delicious! We ordered 3 bowls to share. The cold, kitsune, and niku. It was all very delicious and the noodles was perfectly cook. My favorite was the cold udon and the niku. The cold udon  was perfect for a warm day in the city. The broth was perfectly seasoned, and the egg, yummmmmmm! The Niku was delicious, I squeeze the left over lemon from the cold udon  and it was perfect! The beef was so tender and flavorful. I only got a zucchini tempura bc I felt it was too much too for two people. I will definitely have to try the others next time. The dipping sauce was on point. I was going to get the spam musubi, but I was too stuffed, the  portions was huge! The prices didn't really bother me, if I'm willing to spend $20+ on ramen at mensho, then I don't think $14 is that bad. I would definitely come back for more.", "rating": 5, "date": "2017-06-03"}, {"excerpts": ["My girlfriend and I came here multiple times and have tried the creamy chicken udon, cold udon and zhajiang udon. \n\n"], "author": "Pei Lun L.", "review": "Great food for the price. My girlfriend and I came here multiple times and have tried the creamy chicken udon, cold udon and zhajiang udon. \n\nAmbiance:3.5/5\n\nClean, modern and newly renovated, but market street is never that idyllic of a place to eat, not really the restaurants fault here but above average ambiance for a SF restaurant \n\nFood: 4/5 \nVery tasty udon and flavorings for the price! Zhajiang udon was my fave (reminiscent of my childhood) and surprisingly authentic in flavor\n\nService: 4/5\nFast and friendly, what else can you ask for. One star off for not allowing phone orders.. why not?? \n\nOverall solid 4 star restaurant for the area. Awesome for a quick lunch or dinner spot after work. Probably not the best place to bring a date but whatever floats your boat..", "rating": 4, "date": "2018-04-18"}, {"excerpts": ["I had both kitsune and cold udon. ", "The main problem of this place is the price. ", "This place is an insult to Japanese Udon. ", "niku udon in the original Kagawaya is priced around 490 yen. ", "That's $4.3 in today's conversion. ", "The niku udon as of today is priced around $14. ", "That's an insult to anyone who knows that a good udon can't only be good, but it also has to be cheap. ", "I would understand if their portions are larger. ", "I feel full after eating Orenchi ramen where their main ramen is priced around $13. ", "This is not the case for this place, their portions barely makes me full. "], "author": "Tomo U.", "review": "The taste of the udon is good. I had both kitsune and cold udon. The main problem of this place is the price. This place is an insult to Japanese Udon. niku udon in the original Kagawaya is priced around 490 yen. That's $4.3 in today's conversion. The niku udon as of today is priced around $14. That's an insult to anyone who knows that a good udon can't only be good, but it also has to be cheap. I would understand if their portions are larger. I feel full after eating Orenchi ramen where their main ramen is priced around $13. This is not the case for this place, their portions barely makes me full. The tempura prices are alright.\n\nSo until they start pricing their niku udon around 8 to 9 dollars and their kitsune around $6 I am not going back. I'm okay if they keep their price but double the portions that is also acceptable. If you're feeling like eating Udon, pack instant kitsune udon from nijiya priced around $1/$2 and skip this place. I guarantee, if they keep their price and portions of today, they'll be out of business in around 6 months.\n\nEDIT:\n\nI'll change the review if they wake up and realize they're not in the ramen business. They're in the udon business.", "rating": 1, "date": "2017-05-11"}, {"excerpts": ["The cold udon comes with an egg and has a clean, simple taste. ", "Niku udon has tons of beef. ", "I can eat this one without adding tempura. ", "Creamy kobocha is okay. ", "Tastes buttery, creamy. ", "The tomato udon reminded me of red pasta sauce. ", "Not bad, but not my favorite. ", "Interesting to try. ", "Overall - you line up to order, pay for your order, find a place to sit, which isn't hard because the turnover is pretty high for this casual lunch spot. ", "Clean digs. ", "Bus your own trays."], "author": "Jennifer W.", "review": "Nice to have an udon place to go to amongst all the ramen options around. I like that this place is fast-casual, but the price is where I get caught at. Menu is simple - choose an udon dish. There's only a handful or so. If you want, you can add pieces of tempura to your meal, but each tempura piece is $1.50!! If you eat with your eyes, this can add up easily. Under the heat lamps, they look real inviting. I like the potato and curry potato croquette. But other good ones include a veggie medly patty, pumpkin slice, and zucchini fan. The spam musubi and onigiri are $3 each. Pretty good portion and tasty. I like the kitsune udon best because it's savory and I can add tempura without feeling guilty. The cold udon comes with an egg and has a clean, simple taste. Niku udon has tons of beef. I can eat this one without adding tempura. Creamy kobocha is okay. Tastes buttery, creamy. The tomato udon reminded me of red pasta sauce. Not bad, but not my favorite. Interesting to try. Overall - you line up to order, pay for your order, find a place to sit, which isn't hard because the turnover is pretty high for this casual lunch spot. Clean digs. Bus your own trays.", "rating": 4, "date": "2017-09-21"}, {"excerpts": ["What we ordered - cold udon and traditional udon (tofu skin was extremely sweet), regular and curry potato, 3 shrimp tempura, spam musubi, tempura sweet egg, tempura fish cake and 2 drinks  for 45 dollars"], "author": "Vince L.", "review": "Cold Ramen \nFlavor - 2.5 out of 5, average, nothing spectacular \nUdon - 3 out of 5, cooked well \nPortion - 1 out of 5, for 11 dollars, not worth it for the size \n\nTempura variety - 2 out of 5, don't get the deep fried sweet egg or fish cake\n\nSpam musubi - 1 out of 5, lacking flavor and spam \n\nKatsu sauce was horrendous and super sour \n\n\nWhat we ordered - cold udon and traditional udon (tofu skin was extremely sweet), regular and curry potato, 3 shrimp tempura, spam musubi, tempura sweet egg, tempura fish cake and 2 drinks  for 45 dollars", "rating": 2, "date": "2017-05-11"}, {"excerpts": ["I had cold udon noodles at this place. ", "It is the best item for quality test on udon noodles. ", "Honestly speaking, it was below the bar. ", "I expected it should be Sanuki udon noodles since the place name is \"Kagawa", "\" (Sanuki is the old name of Kagawa). "], "author": "Satoshi N.", "review": "Don't expect good Sanuki udon noodles at this place.\n\nI had cold udon noodles at this place. It is the best item for quality test on udon noodles. Honestly speaking, it was below the bar. I expected it should be Sanuki udon noodles since the place name is \"Kagawa\" (Sanuki is the old name of Kagawa). Maybe my expectation was too high.\n\nIn the other day, I tried hot kitsune udon. The broth is good. But the noodles are not good for hot broth as well.", "rating": 2, "date": "2017-04-16"}], "niku udon  top seller": [], "creamy kabocha with chicken udon": [{"excerpts": ["I would definitely come back here again, and I could see myself ordering the Creamy Kabocha with Chicken Udon, or the Cream of Clam & Leeks Udon the next time I come here. "], "author": "Nelson X.", "review": "You know, I can't believe my unbelievable luck of having two new udon places open up in SF during the past year. Udon is one of my favorite foods, and to have smacked right on Market Street makes it even better. I was very excited to try out Kagawa-Ya, and I came here on a weekday evening with a friend to satisfy my hunger for udon. I was expecting it to be really crowded here since it's smacked right in the middle of where all the tech companies are and we came during dinner hours but was surprised when it was at 20% capacity. The good thing about that was that we got to choose our seats, and we decided to sit on the stools by the window peering outside. \n\nWe then went up to the line and ordered our respective udon dishes. I decided to go for the Beef Curry Udon and for the tempura I got the sweet egg tempura, vegetable fritter, and the curry potato. They have a wide selection of tempura and I like how you're able to just choose one of whatever tempura you want instead of having multiple of the same tempura. I sampled the beef curry udon first and was very pleased with my choice, as the curry tasted fantastic and the tender beef just falls apart once I bit into it. What I like even more than the beef personally was the potatoes, and curry is always better with potatoes. One thing about the curry udon is that it wasn't as thick as I would have liked, and this was honestly more personal preference than anything. I moved onto the tempura next, and I started with the sweet egg tempura. I think the sweet egg tempura was alright, but to be honest, I never had a sweet egg tempura before, and I think it's more likely that I just don't like sweet eggs as a tempura in general. The vegetable fritter, on the other hand, was to my liking, and it was pretty crunchy and was a nice meld of vegetables. However, my favorite tempura was the curry potato, since it had a soft crusty exterior and a very soft interior. The curry flavor wasn't strong in the curry potato, but that could be because I was eating the beef curry udon at the same time, which probably overwhelmed the subtle curry flavor in the curry potato. Nevertheless, I felt very satisfied with the curry potato.\n\nOverall, I was very pleased with the meal, and I really like how they gave a generous helping of beef and potatoes with the udon. One thing about the price is, it's actually more than what I would expect to pay for udon, and the curry udon alone was $14. I can somewhat justify this since there were very generous portions of udon, and I did feel really bloated after eating it. I would definitely come back here again, and I could see myself ordering the Creamy Kabocha with Chicken Udon, or the Cream of Clam & Leeks Udon the next time I come here. As an aside, I wish they had more cold udon options besides the regular Cold Udon, and hopefully, they would expand their repertoire of cold udon. Other than that, I would highly recommend Kagawa-Ya for anyone with a craving for good udon in SF.", "rating": 5, "date": "2018-04-21"}, {"excerpts": ["We tried the Creamy Kabocha with Chicken Udon ($11) and Beef Curry Udon ($13). ", "Though both were very flavorful, I'd have to say my favorite was the Creamy Kabocha. ", "The chicken was very tender and the broth was thick, rich, and flavorful. ", "I enjoyed how the bonito flakes garnish on top moved with the steam! ", "We also decided to try the beef oniguri ($3). ", "The ratio of rice to filling was a little more than I expected, but it was still pretty good. "], "author": "Kris C.", "review": "A quick, casual, convenient, and delicious noodle shop! Came here on a Thursday an hour before it closed and there was plenty of seating and no line. \n\nThe menu is pretty simple (6 different udons) and you can choose to add a soft boiled egg for $1.50 or tempura pieces for $1.50/each. \n\nWe tried the Creamy Kabocha with Chicken Udon ($11) and Beef Curry Udon ($13). Though both were very flavorful, I'd have to say my favorite was the Creamy Kabocha. The chicken was very tender and the broth was thick, rich, and flavorful. I enjoyed how the bonito flakes garnish on top moved with the steam! We also decided to try the beef oniguri ($3). The ratio of rice to filling was a little more than I expected, but it was still pretty good. Next time I'll probably opt out of additional small bites since the noodle portions themselves are quite large and filling! \n\nApart from the food, the staff here were super friendly! As soon as we entered, we were warmly greeted by the cashier. Overall, I was quite pleased with Kagawa-ya Udon. If you're looking for a quick warm bowl of noodles in the bustling city, this is the place to go!", "rating": 4, "date": "2017-07-28"}, {"excerpts": ["I got the Creamy Kabocha with Chicken Udon, which was a wonderful mix of rich broth, tender chicken, and of course, fresh and chewy udon! ", "The place offers classics such as niku and kitsune, as well as their own creations like the tomato and shiitake; it was really difficult to settle on one bowl out of so many tantalizing options. ", "An assortment of tempura was available at $1.50 per piece. "], "author": "Yen Ting L.", "review": "Haven't come across any places specializing in udon in the area; I was so excited to finally try Kagawa-Ya! I got the Creamy Kabocha with Chicken Udon, which was a wonderful mix of rich broth, tender chicken, and of course, fresh and chewy udon! The place offers classics such as niku and kitsune, as well as their own creations like the tomato and shiitake; it was really difficult to settle on one bowl out of so many tantalizing options. An assortment of tempura was available at $1.50 per piece. I got the vegetable kakiage and the potato curry croquette, two of my favorite appetizers, and they did not disappoint. There are also interesting tempura like the fish cake and the sweet egg, which I wanted to try as well. After my meal, I got the spam musubi and the beef onigiri to-go; portions for both were very hearty, and I especially liked how the flavors of the nori and green onion worked their way into the onigiri. As expected from the location, prices here are slightly on the higher end, but the creativity of the menu, as well as the quality and care the people here put into their food, more than make up for it. I'm looking forward to visiting again and trying more of their delicious udon and tempura!", "rating": 5, "date": "2017-11-08"}], "spicy tomato udon with roasted shiitake": [{"excerpts": ["I will say two of their udon soups were more inventive, going for fusion flavors like cream of clam and leek udon, and spicy tomato udon with roasted shiitake. ", "I was quite excited when I saw them and ended up choosing the cream of clam and leek broth. ", "One thing that I definitely surprised me was that the quality of their udon noodles was very underwhelming. ", "It honestly tasted like frozen udon noodles from Japan. ", "It didn't have the nice bouncy al dente texture and freshness from homemade udon, which it actually really quite nice and more alkaline. ", "I don't know where their udon is made or sourced, but they didn't have a noodle chef making it "], "author": "Jenny Z.", "review": "I was really excited to eat at Kagawa-Ya because I had hopes that it would be similar to or match up to Marukame Udon in Waikiki, Oahu, HI...but man, was I was disappointed. \n\nTo be fair, the concept here is similar to what I was looking for. An fresh udon bar with selections of tempura and yakimomo (pan-fried appetizers). In essence, I think Kagawa-Ya achieved that but San Francisco ruined this one for me. First off, the location is slightly unappealing. While it is in SOMA, close to Uber HQ and Twitter HQ, the neighborhood around it makes me uncomfortable to walk around at night (near Civic Center/Tenderloin). That said, the inside of the restaurant looks clean and modern. The quality and flavor here was mediocre in comparison to what I have had before, lackluster and oversalted at its worst. \n\nYou line up at first to select from their preset menu of udon styles (warm soup, cold udon). After they heat the udon noodles, combine it with broth and toppings, you can take a plate and pick any tempura from a line of selections; ranging from tempura shrimp, carrot, broccoli, curry croquette, spam musubi etc. This style of serving is very similar to Marukame Udon. Overall, the style is similar but the price is 2x as expensive as its counter part in Hawaii. In comparison, the tempura here was poorly made, lukewarm (not nice and piping hot, freshly fried), oily and very heavy to the palate. I really like properly-made Japanese tempura, which seems to be so hard to find in the SF Bay Area.  I guess compared to the average Japanese restaurant, the tempura here is alright. But again, not as fresh tasting or light as the restaurant in Oahu, Hawaii. \n\nI will say two of their udon soups were more inventive, going for fusion flavors like cream of clam and leek udon, and spicy tomato udon with roasted shiitake. I was quite excited when I saw them and ended up choosing the cream of clam and leek broth. One thing that I definitely surprised me was that the quality of their udon noodles was very underwhelming. It honestly tasted like frozen udon noodles from Japan. It didn't have the nice bouncy al dente texture and freshness from homemade udon, which it actually really quite nice and more alkaline. I don't know where their udon is made or sourced, but they didn't have a noodle chef making it and it also didn't taste homemade to me. \n\nNow onto the broth. I'm going to be honest, I might be more harsh and critical about broth and taste because I often cook Japanese food at home, eat out at mostly Japanese restaurants, and have stayed in Japan for 2 weeks recently. I expected the broth to taste light, clean, ungreasy and well-balanced. It was the exact opposite of that. The clam and leek broth was oversalted, heavy and did not have a single clam in it! It makes me wonder if they used clam juice/clams in a bottle instead of real clams cooked down. The broth did not have depth and was overly heavy. I couldn't finish my dish, which is actually REALLY rare for me.  My husband ordered the classic niku (beef) udon, which was slightly better. However, it too was oversalted and lacked depth and complexity. For the price of about ~$15-18 per bowl of udon, I was pretty disappointed. The spam musubi was pretty standard and nothing to write home about. Because the tempura was lukewarm, fried in a bad batter, it tasted greasy a lack of crispy texture. Tempura, when done well, does a great job at highlighting the freshness of the vegetables, which was not executed well here. \n\nOverall, it was not a pleasant experience. While seating was plentiful and clean, the environment felt sterile. It reminded me a dormitory cafeteria but without the liveliness and chatter of a college campus. The food was mediocre- broth, noodles AND tempura. I know I am a food snob when it comes to Japanese food, so I understand that my review is low and disagrees with others. That being said, I think even if you do not eat Japanese food much, there are still better options for udon in San Francisco. Maybe they are a bit further, but they'll be a better bang for your wallet and it will taste noticeably better. \n\nI will try to come back next year to see if there was been improvement.", "rating": 2, "date": "2017-12-08"}, {"excerpts": ["Spicy Tomato Udon with Roasted Shiitake. ", "So good. ", "Just the right amount of spicy. ", "Good, chewy noodles. ", "Got it without cheese for the vegan option, and didn't miss it, but might try it with cheese sometime. ", "So much flavor and every sip or bite a delight. "], "author": "Charles B.", "review": "Six words. Spicy Tomato Udon with Roasted Shiitake. So good. Just the right amount of spicy. Good, chewy noodles. Got it without cheese for the vegan option, and didn't miss it, but might try it with cheese sometime. So much flavor and every sip or bite a delight. While I wish they had a soba option, I can only rate what they do have, and what they do have is great.\n\nNote that they change their veggie/vegan option from time to time, but they always have something vegan available. This time they hit it out of the park.", "rating": 5, "date": "2018-02-17"}], "cream of clam  leek udon": [], "spicy sweet black bean udon": [], "mushroom curry udon vegan": [], "assorted tempura": [{"excerpts": ["They also have assorted tempura for $1.50 each. ", "As my coworker says, my eye be pimpin my brain because I always order at least 2 pieces of tempura, but can barely finish my lunch because the soup is so filling! ", "Luckily I didn't get the musubi. ", "That would've put me over the edge. ", "So far I've had the shrimp tempura, curry potato, and the fish cake. "], "author": "Vira P.", "review": "I really like the soup at Kagawa-Ya Udon and I'm happy they have a spot on Market. \n\nIt's cafeteria-style with just a few options on the menu for quick service. I've had the kitsune udon and the pumpkin one. Both are delicious and very filling. The only one I can't eat is the soup that has beef in it. I know I'll have to come back and try the veggie option and the cold udon. \n\nI find the broth in the kitsune to be comforting, and I like the different textures from the tofu skin, tempura bits, and the seaweed. The tempura, after awhile, gets soaked into the soup so I prefer to dine in when choosing this option.  And the udon itself is cooked perfectly. The noodles are thick and have a good bite. \n\nThey also have assorted tempura for $1.50 each. As my coworker says, my eye be pimpin my brain because I always order at least 2 pieces of tempura, but can barely finish my lunch because the soup is so filling! Luckily I didn't get the musubi. That would've put me over the edge. So far I've had the shrimp tempura, curry potato, and the fish cake. Crunchy and it's not too greasy. \n\nThe space is open and very clean. The are different table set ups so it's easy for groups or solo diners to sit among each other. \n\nThe soups are around $11, and go up from there. I find it's a good place to easily get lunch, or dinner after work if you're really hungry, in the area, and just can't wait to eat.", "rating": 4, "date": "2017-07-27"}], "curry potato croquette": [{"excerpts": ["I got the chicken tempura and a curry potato croquette making the total to about $13. \n\n"], "author": "Christina G.", "review": "Was looking forward to this place since it opened, but never had the opportunity to be in the neighborhood until this past weekend. The menu prices were not the cheapest for udon, $9-$15. I opted for the #1 kitsune udon (no meat, but had greens and tofu) and with a check-in offer of a free piece of tempura. I got the chicken tempura and a curry potato croquette making the total to about $13. \n\nThe tempura and potato were cold and didn't taste very fresh as it was probably sitting out for a while. It was a Saturday afternoon, so probably not as fast-paced and busy as a weekday. There was a good amount of udon and the greens were good, but the broth was super salty. \n\nThe location is pretty close to Twitter and a bunch of other tech companies, so I can imagine it gets pretty busy during week day lunch time. Definitely not worth the trek of going to the area specifically to try this place.", "rating": 2, "date": "2018-02-18"}, {"excerpts": ["I like the potato and curry potato croquette. ", "But other good ones include a veggie medly patty, pumpkin slice, and zucchini fan. ", "The spam musubi and onigiri are $3 each. ", "Pretty good portion and tasty. "], "author": "Jennifer W.", "review": "Nice to have an udon place to go to amongst all the ramen options around. I like that this place is fast-casual, but the price is where I get caught at. Menu is simple - choose an udon dish. There's only a handful or so. If you want, you can add pieces of tempura to your meal, but each tempura piece is $1.50!! If you eat with your eyes, this can add up easily. Under the heat lamps, they look real inviting. I like the potato and curry potato croquette. But other good ones include a veggie medly patty, pumpkin slice, and zucchini fan. The spam musubi and onigiri are $3 each. Pretty good portion and tasty. I like the kitsune udon best because it's savory and I can add tempura without feeling guilty. The cold udon comes with an egg and has a clean, simple taste. Niku udon has tons of beef. I can eat this one without adding tempura. Creamy kobocha is okay. Tastes buttery, creamy. The tomato udon reminded me of red pasta sauce. Not bad, but not my favorite. Interesting to try. Overall - you line up to order, pay for your order, find a place to sit, which isn't hard because the turnover is pretty high for this casual lunch spot. Clean digs. Bus your own trays.", "rating": 4, "date": "2017-09-21"}], "beef niku onigiri": [{"excerpts": ["Beef Niku Onigiri: Interesting presentation where the seaweed was wrapped in plastic and then wrapped around the rice/beef mixture.  ", "The pro is that you are guaranteed a crispy non-soggy seaweed wrap.  ", "The con is that you probably can't wrap an onigiri like a professional.  ", "The filling was just ok; felt a bit skimpy on the beef since it look like just flecks."], "author": "Adam B.", "review": "Fast casual udon bar with a bunch of soup choices and an à la carte tempura bar.  Seemed like comparable quality to Ramen Bar.  A strangely huge space given the sparse seating; hope they aren't being gouged in rent.\n\nNiku Udon: The udon noodles were large, firm and delicious.  The broth had a heavy ginger streak with some beefiness mixed in.  The meat was just ok.  It was like something at Yoshinoya, but clumped together and not as thinly sliced.  I kinda prefer the Yoshinoya beef more, though everything else in the Niku Udon was better.\n\nCurry Potato: A creamy curried potato mash deep fried in the shape of a hash brown.  Quite filling and bursting with texture/flavor contrasts.\n\nShrimp Tempura: Pretty much what you'd expect.  Compared to the Curry Potato, it wasn't as good for being at the same price point.\n\nBeef Niku Onigiri: Interesting presentation where the seaweed was wrapped in plastic and then wrapped around the rice/beef mixture.  The pro is that you are guaranteed a crispy non-soggy seaweed wrap.  The con is that you probably can't wrap an onigiri like a professional.  The filling was just ok; felt a bit skimpy on the beef since it look like just flecks.", "rating": 4, "date": "2017-04-24"}, {"excerpts": ["If you want something small, you can get spam musubi or beef niku onigiri for $3 each.\n\n"], "author": "Lilimae S.", "review": "I came here with 3 coworkers around 11:45 am Tuesday morning, and there were only 4 people eating inside, plenty of space! Most of the tables are right next to each other so you'll have to be comfortable potentially bumping elbows with strangers.\n\nThe restaurant is cafeteria style: you grab a tray, tell them your order, and watch them blanch the noodles, scoop up the broth of your choice, and hand you your bowl. \n\nNext you slide your tray by the tempura selection. They provide small plates so there's no need to soak them on your soup. They have curry potato and creamy potato coquettes, as well as shrimp, squash, sweet egg, sweet potato, zucchini, and fish cake tempura, all for $1.50 each. \n\nIf you want something small, you can get spam musubi or beef niku onigiri for $3 each.\n\nThey have a small side table with cold water, hot sauce, and tempura sauce. The tempura sauce was good, not watered down at all. \n\nOnly complaint: They need better soup spoons. It was very hard to get the yumminess at the bottom.\n\nI had their beef curry udon today. Very flavorful. I prefer my curry spicy so I had to shake some pepper into it, also available at the side table. Don't bother comparing it to Muraccis because nothing can compare. But as a near-by lunch option with yummy food, I will definitely be back!", "rating": 5, "date": "2017-05-16"}], "vegetable kakiage": [{"excerpts": ["I got the vegetable kakiage and the potato curry croquette, two of my favorite appetizers, and they did not disappoint. ", "There are also interesting tempura like the fish cake and the sweet egg, which I wanted to try as well. ", "After my meal, I got the spam musubi and the beef onigiri to-go; portions for both were very hearty, and I especially liked how the flavors of the nori and green onion worked their way into the onigiri. ", "As expected from the location, prices here are slightly on the higher end, but the creativity of the menu, as well as the quality and care the people here put into their food, more than make up for it. ", "I'm looking forward to visiting again and trying more of their delicious udon and tempura!"], "author": "Yen Ting L.", "review": "Haven't come across any places specializing in udon in the area; I was so excited to finally try Kagawa-Ya! I got the Creamy Kabocha with Chicken Udon, which was a wonderful mix of rich broth, tender chicken, and of course, fresh and chewy udon! The place offers classics such as niku and kitsune, as well as their own creations like the tomato and shiitake; it was really difficult to settle on one bowl out of so many tantalizing options. An assortment of tempura was available at $1.50 per piece. I got the vegetable kakiage and the potato curry croquette, two of my favorite appetizers, and they did not disappoint. There are also interesting tempura like the fish cake and the sweet egg, which I wanted to try as well. After my meal, I got the spam musubi and the beef onigiri to-go; portions for both were very hearty, and I especially liked how the flavors of the nori and green onion worked their way into the onigiri. As expected from the location, prices here are slightly on the higher end, but the creativity of the menu, as well as the quality and care the people here put into their food, more than make up for it. I'm looking forward to visiting again and trying more of their delicious udon and tempura!", "rating": 5, "date": "2017-11-08"}], "side of white rice": [], "side of dashi broth": [], "hawaiian soda": [], "ucc green tea": [], "ucc original coffee with milk": [], "ucc creamy mango soda": [], "ucc creamy melon soda": [], "ucc kona coffee with milk": [], "choya lemon yuzu soda": [], "choya plum soda": [], "beef rice bowl": []}