{"miso clam soup": [], "tuna tataki salad": [], "gomae salad": [], "ohitashi salad": [], "spring mixed salad": [], "tako sunomono salad": [], "garlic edamame": [{"excerpts": ["The garlic edamame is to die for. ", "I've never tried the fancy rolls, but the simple maki and sushi is consistently fresh and tasty. ", "Their delivery is always fast and courteous. ", "It's not going to blow you away, but for a mid priced sushi joint it meets expectations."], "author": "Diana G.", "review": "I've never actually eaten here, but I've ordered takeout from them several times. The garlic edamame is to die for. I've never tried the fancy rolls, but the simple maki and sushi is consistently fresh and tasty. Their delivery is always fast and courteous. It's not going to blow you away, but for a mid priced sushi joint it meets expectations.", "rating": 3, "date": "2016-01-18"}, {"excerpts": ["Kama has the best garlic edamame in the city (believe me I have tried them all) and order it with Tamari for a sweeter and gluten free bite. ", "The chicken karaage is also better than any other spot in the area! ", "I always have a wonderful dinner at Kama! ", "The service is friendly and genuine. ", "My partner and I eat at Kama once a week, we are foodies, and we love our neighborhood sushi hot spot! ", "Its not the most expensive, but it is the best! ", "Roku is the best host, so go get your sushi on now! ", "Ask for Roku and get the garlic edemame!! ", "xoxo"], "author": "Courtney W.", "review": "I love that Kama is a perfect after work hot spot in Noe Valley. Kama has the best garlic edamame in the city (believe me I have tried them all) and order it with Tamari for a sweeter and gluten free bite. The chicken karaage is also better than any other spot in the area! I always have a wonderful dinner at Kama! The service is friendly and genuine. My partner and I eat at Kama once a week, we are foodies, and we love our neighborhood sushi hot spot! Its not the most expensive, but it is the best! Roku is the best host, so go get your sushi on now! Ask for Roku and get the garlic edemame!! xoxo", "rating": 5, "date": "2015-05-29"}], "sushi rice": [{"excerpts": ["One of the fundamentals of solid sushi is the shari (sushi rice) and Kama's shari was terrible. ", "The rice was grossly overcooked, mushy, and underseasoned. ", "It reminded of the shari in Safeway sushi. ", "The fish to shari ratio was also off (too much rice). ", "Additionally, the quality of the fish was subpar and not fresh. ", "Even with the Sake and Hamachi Toro Nigiri from the regular menu, the fish tasted dull and stale; ", "no butteryness whatsoever. ", "Avoid the Saba, it was fishier than p.....never mind. "], "author": "Cherylynn N.", "review": "2.5 STARS \n\nWhen I need to be cheap...I can be c-h-e-a-p. \n\nJust over the weekend, I got into it with a manager at an Asian market over $2. The staff mislabeled the price for coconut water. I told her it was the law and that they need to charge customers the posted price which was lower than scanned price. She refused, claiming that a kid switched the price tag. \n\nMr. NSS: \"Please don't make a scene, I'll pay for it.\"\nMe: \"Ummm no, it's the phuckin' law!\"\n\nMr. NSS: \"Calm down, you're getting your granny panties ALL up in a bunch over $2 BUT you spent $360 for one meal at Saison?!?\" \nMe:  \"Hey, I love my granny panties dammit...have fun with PALMela tonight!\"\n\nChoose your battles wisely, fellas. If you're girl wants to haggle over $2 so let it be. \n\nWhat drew me to Kama Sushi was their Happy Hour (HH) Specials available every day from 5 pm - 6:30 pm: http://bit.ly/10sysXZ. On the menu are $5 large hot sake, $4 large beers, $5 hot apps, $4 nigiri, and $5 maki rolls. I compared it the regular menu and you save about $1 for most items. Make sure to check in on Yelp for a free small hot sake!\n\nI had a not so great experience at Kama's SoMa location aka mad Hershey squirts afterwards, however, I heard that their Noe Valley location was better. \n\nLIES.\n\nIf you're looking for solid and authentic sushi, you will not find it any of their Kama locations. As the infamous Nobu K. would say, it's 100% Chinese here (I'm 3/4ths Chinese and I heard the sushi chefs speaking in Canto) with a huge jive ass roll selection. Not to say, Chinese sushi is entirely bad because Hamano Sushi nearby does Chinese sushi right: http://www.yelp.com/biz/hamano-sushi-san-francisco.  Sakesan Bistro in Inner Richmond is also great as is Kamu Sushi and Amami Sushi in the Peninsula. \n\nWe came right when Kama opened and we were the only ones there until we left. \n\nOUR ORDER:\n*Soft Shell Crab (HH $5): http://bit.ly/1z2vFky\n*Shrimp Tempura (Reg $7.95): http://bit.ly/1tgXqR0\n*Yakitori: Kurobuta: Sausage & Butabura: Pork Belly (HH $5 each): http://bit.ly/1x6Xbj4\n*Albacore Tataki (HH $7): http://bit.ly/1s9Jmsl\n*HH CA Roll, Sake, Maguro, Saba ($5, $4, $4, $4) & Sake Toro & Hamachi Toro (Reg. $5.95, $7.95): http://bit.ly/1z2wj1E\n\nWhat Kama excels in is their fried items. Whoever their chef is, they have excellent frying technique. The soft shell crab was piping hot, uber crunchy, and not greasy. Equally delicious was their shrimp tempura which was light, airy, and deliciously crunchy. One of the best shrimp tempura I've ever had! \n\nYou can skip their yakitori skewers. The kurobuta sausage was store bought and decent enough but their pork belly thinly dry, overcooked, and insanely salty. \n\nWith Kama's sushi, expect mediocrity. Thank goodness most of the nigiri we ordered was off the HH menu because I would NOT pay full price for these items here. We also ordered two nigiri off the regular menu to gauge the sushi making skills. \n\nOne of the fundamentals of solid sushi is the shari (sushi rice) and Kama's shari was terrible. The rice was grossly overcooked, mushy, and underseasoned. It reminded of the shari in Safeway sushi. The fish to shari ratio was also off (too much rice). Additionally, the quality of the fish was subpar and not fresh. Even with the Sake and Hamachi Toro Nigiri from the regular menu, the fish tasted dull and stale; no butteryness whatsoever. Avoid the Saba, it was fishier than p.....never mind. As a comparison, the sushi here is a baby step higher than sushi found at an Asian buffet. \n\nWasn't fond of the service either. Our male server was curt. After we received our food, he left to use his phone and never came back. The female server seemed friendly and brought us our bill. Had she been our server, this would have been a solid 3 star place. \n\nKama is small compared to their SoMa location with seating for about 25 people. We usually sit at the sushi bar but it was very dim so we opted for window seats for some natural light. \n\nEasy street parking.\n\nWhile this reads to be more of a 2 star review, I'm giving them 2.5 stars rounded up because of the HH specials and no mad Hershey squirts afterwards.", "rating": 3, "date": "2014-11-06"}, {"excerpts": ["Their sushi rice was also too vinegary.  ", "Their seared fish rolls were hardly seared with a torch. "], "author": "Diana V.", "review": "So I ordered for delivery using DoorDash. Unfortunately, it was a very disappointing experience. I ordered the 24 piece sashimi combo and only got 18 pieces.  I paid $53 for their sashimi and only got 3/4 of what I was supposed to get. Also, their tuna just tasted off. It was bitter tasting.   Their sushi rice was also too vinegary.  Their seared fish rolls were hardly seared with a torch. It tasted like it was just boiled or steamed.  \n\nI was not impressed and will not be ordering from them again.", "rating": 1, "date": "2016-04-17"}, {"excerpts": ["Just don't expect top quality fish or sushi rice. \n\n"], "author": "Victoria W.", "review": "Pretty dependable as far as your standard San Francisco non-Japanese sushi goes. And happy hour has some pretty good deals. Just don't expect top quality fish or sushi rice. \n\nIf you like crazy mixed up rolls this might be the place for you. \n\nService was fairly prompt without being overly rude. \n\nThree stars is about right.", "rating": 3, "date": "2015-04-14"}, {"excerpts": ["Josh and Gerry almost always get the Chirashi Don, which is the chef's choice of fresh fish atop sushi rice.  ", "Plus, other random rolls that are consistently good.  ", "Topped off with some hot sake, you can't go wrong!"], "author": "Lily B.", "review": "We're a fan of this place.  Josh and Gerry almost always get the Chirashi Don, which is the chef's choice of fresh fish atop sushi rice.  Plus, other random rolls that are consistently good.  Topped off with some hot sake, you can't go wrong!", "rating": 5, "date": "2013-05-25"}, {"excerpts": ["Sushi rice was too sticky and dense for my taste. ", "Fish was average. ", "Grilled kama fish was very good. ", "A unique dish! ", "Raman was tasty too. ", "Service was ok. ", "Slow at times. ", "The place is cozy but can be loud."], "author": "Daniel L.", "review": "My date and I spent $60 with drinks for a fast. Sushi rice was too sticky and dense for my taste. Fish was average. Grilled kama fish was very good. A unique dish! Raman was tasty too. Service was ok. Slow at times. The place is cozy but can be loud.", "rating": 3, "date": "2012-03-10"}], "hamachi carppaccio": [], "beef tataki": [], "ankimo appetizer": [], "salmon tataki": [], "folsom hama": [], "salmon tuna tower": [], "sunset strip appetizer": [], "mango tango appetizer": [], "poki salad": [], "wasabi beef": [], "ika sukatayaki": [], "mixed tempura": [{"excerpts": ["We ordered 2 miso soups, mixed tempura, a rainbow roll, C27 and golden dragon rolls for about $57 before tip. \n\n"], "author": "Taylor G.", "review": "I've been here a few times, usually on weekday evenings. It's a very small, intimate restaurant that seats about 20 people maximum. The walls are berry colored with fake trees and branches suspended on the walls.\n\nThey close at 9:30 but stop taking orders about 9:20, fyi.\n\nOf the rolls I've tried, I love the golden dragon, C27 and crunchy scallop roll. The tempura is always super hot, light and crispy. The miso soup can be a bit watery in miso flavor but is packed with seaweed, chives and tofu.\n\nThe prices are moderate. We ordered 2 miso soups, mixed tempura, a rainbow roll, C27 and golden dragon rolls for about $57 before tip. \n\nEveryone is friendly and polite. I'd recommend this spot if you're nearby. Street parking is rough but manageable.", "rating": 4, "date": "2017-04-03"}, {"excerpts": ["For lunch really enjoy the special bento box with a lot of food for a good price: tea, soup, rice, great salad, pickled veggies, and 2 items [so far have enjoyed chicken katsu, chicken teriyaki, mixed tempura, various maki rolls, and spicy tuna roll]."], "author": "Shawn H.", "review": "We have been very pleased with the new addition of Kama Sushi to our neighborhood!  Love the wait staff and the food has always been fresh and tasty.  Tried the happy hour specials and the lunch offerings so far.  For lunch really enjoy the special bento box with a lot of food for a good price: tea, soup, rice, great salad, pickled veggies, and 2 items [so far have enjoyed chicken katsu, chicken teriyaki, mixed tempura, various maki rolls, and spicy tuna roll].", "rating": 5, "date": "2012-04-27"}], "fried oyste": [], "salmon kama": [], "geso fries": [], "fried aji": [], "japanese sui mai": [], "lamb chop": [], "amaebi nigiri sushi": [], "ebi nigiri sushi": [], "hamachi nigiri sushi": [], "hotate nigiri sushi": [], "ika nigiri sushi": [], "ikura nigiri sushi": [], "ikura with quail egg nigiri sushi": [], "maguro nigiri sushi": [], "saba nigiri sushi": [], "sake toro nigiri sushi": [], "sake nigiri sushi": [], "smoked sake nigiri sushi": [], "tako nigiri sushi": [], "tamago nigiri sushi": [], "tobiko nigiri sushi": [], "unagi nigiri sushi": [], "uni nigiri sushi": [], "uni with quail egg nigiri sushi": [], "ankimo nigiri sushi": [], "walu nigiri sushi": [], "hamachi toro sashimi": [], "sake toro sashimi": [], "piece chefs choice sashimi": [], "tekka handroll": [], "california handroll": [], "spicy hamachi handroll": [], "boston handroll": [], "spicy salmon handroll": [], "new york handroll": [], "philly handroll": [], "salmon skin handroll": [], "spicy scallop handroll": [], "spider handroll": [], "tempura handroll": [], "unacrab handroll": [], "the rock handroll": [], "unago handroll": [], "negi hama handroll": [], "spicy tuna handroll": [], "four leaf clover": [], "garden roll": [], "veggie futomaki": [{"excerpts": ["The Veggie Futomaki is deliciously spicy."], "author": "Giovanna C.", "review": "Now that the sting of Amberjack leaving has dissipated, I can say I love my new neighborhood sushi place. Such wonderful employees, and I love their veggie options (since I'm vegan). Most recently got their Veggie Dragon Roll... holy shite was it so tasty! The Veggie Futomaki is deliciously spicy.", "rating": 4, "date": "2014-08-06"}], "tempura veggie roll": [], "spinach roll": [], "tempura sweet potato roll": [], "cucumber avocado roll": [], "asparagus maki": [], "kanpyo maki": [], "eggplant nigiri": [{"excerpts": ["Plus, they have AMAZING eggplant nigiri for vegetarians like me. ", "I hate eggplant, and I have to restrain myself from getting several orders every time I visit!"], "author": "Kristan S.", "review": "Great neighborhood joint with a Yelp check-in deal to boot! Plus, they have AMAZING eggplant nigiri for vegetarians like me. I hate eggplant, and I have to restrain myself from getting several orders every time I visit!", "rating": 5, "date": "2012-12-09"}], "vegetable tempura entree": [], "spicy asparagus entree": [], "grilled eggplant entree": [], "veggie gyoza entree": [], "inari roll": [], "deluxe chirashi don": [], "bara chirashi don": [], "sushi deluxe dinner": [{"excerpts": ["My bf ordered the sushi deluxe dinner and a spicy tuna hand roll and I ordered the Foxy roll.  ", "All the fish was super fresh and they use REAL crab.  ", "The Foxy roll was awesome--highly recommend it!  ", "The only thing--and not a big deal--was that my bf ordered the red dragon roll, which came with his dinner combo, but they brought the rainbow roll instead.  "], "author": "Olivia D.", "review": "Kama is my new sushi spot!  The menu is nice and varied.  The edamame was complimentary (always nice), and the miso was really good (not water down like lots of places).  When you check in on Yelp you get a free small saki!  And I got the Yelp $20 for $10 deal!\n\nI hadn't even put one bite in my mouth and I already liked this place!  We started with the salmon tower which was amazing.  The sauces complimented each other perfectly--sweet and spicy--and the honey glazed fish was so so good with just a little crispiness from the sear.   \n\nMy bf ordered the sushi deluxe dinner and a spicy tuna hand roll and I ordered the Foxy roll.  All the fish was super fresh and they use REAL crab.  The Foxy roll was awesome--highly recommend it!  The only thing--and not a big deal--was that my bf ordered the red dragon roll, which came with his dinner combo, but they brought the rainbow roll instead.  Not a big deal--it wasn't disappointing.  \n\nThe service was prompt and friendly (my water glass was NEVER empty).  I loved the decor also--the beach wood branches were really cool--and it's nice and cozy, not cramped.\n\nI will definitely recommend this place and will definitely be back!", "rating": 4, "date": "2012-06-26"}, {"excerpts": ["I ordered the Sushi Deluxe dinner, which includes a roll and chef's choice sashimi and nigiri - a good value and fills you up, which is rare for a sushi place at that price.  ", "Even with a crowded dining room, I didn't have to wait long.  ", "The light salt on the endamame beans is a nice touch.  ", "The waiter knew a lot about sake, letting us taste different \"brews,\" which I found interesting."], "author": "Jim O.", "review": "The decor is nice and the staff is very friendly.  Had to sit at the counter because it was full when I arrived, but I got to watch the sushi chef put my dish together.  I ordered the Sushi Deluxe dinner, which includes a roll and chef's choice sashimi and nigiri - a good value and fills you up, which is rare for a sushi place at that price.  Even with a crowded dining room, I didn't have to wait long.  The light salt on the endamame beans is a nice touch.  The waiter knew a lot about sake, letting us taste different \"brews,\" which I found interesting.", "rating": 4, "date": "2011-10-24"}], "jo sushi dinner": [], "sake oyako don": [{"excerpts": ["so I ordered the Sake Oyako Don. ", "I can't get over how fresh the salmon tasted. ", "Literally melts in my mouth ", "and I was very satisfied. ", "My friends ordered ramen and few rolls to share. ", "We enjoyed every single bite. ", "Don't hesitate to try this place. ", "Staff was really friendly and the food blew me away. ", "When I'm craving for sushi again, this place will definitely be on my list to go."], "author": "Alice H.", "review": "A night out in town with some friends, I was hankering for some sushi. Looked up at yelp and found this place near by. I was not expecting much due to the ratings but after giving it a go, this place definitely deserves some credits. Other than the great service I received the food was delectable. Salmon has always been my favorite so I ordered the Sake Oyako Don. I can't get over how fresh the salmon tasted. Literally melts in my mouth and I was very satisfied. My friends ordered ramen and few rolls to share. We enjoyed every single bite. Don't hesitate to try this place. Staff was really friendly and the food blew me away. When I'm craving for sushi again, this place will definitely be on my list to go.", "rating": 5, "date": "2016-07-31"}], "karaage ramen": [{"excerpts": ["We got a bowl of the tonkatsu ramen and the karaage ramen and they were both ok.  ", "It definitely wasn't anything memorable, but it was fine."], "author": "Lisa C.", "review": "Maybe I just had too high expectations, but I just wasn't impressed by Kama Sushi.  The restaurant was super cute and small and the service was excellent and attentive, but the food was only ok.\n\nWe got a bowl of the tonkatsu ramen and the karaage ramen and they were both ok.  It definitely wasn't anything memorable, but it was fine.", "rating": 3, "date": "2013-06-13"}], "tonkatsu ramen": [{"excerpts": ["We had the tonkatsu ramen and the pork was very tender and cooked to perfection! "], "author": "Andrea V.", "review": "Happy hour is 5-6:30 daily. It was not crowded on a Monday night at 6pm but the place is very small (as most ramen restaurants are) so I imagine it could get crowded on any given night, especially later. Make reservations just in case. Could be a cute dinner date place - the interior design is charming and the restaurant faces west so there's a good amount of natural light before sundown. We also noticed a private table in one corner - dunno if you can reserve that but you could try :P\n\nFor HH, we took advantage of California rolls because my friend loves them ($5/6pc during happy hour compared to $6.50) and they did not disappoint. Just the right amounts of snow crab, avo, and rice!\n\nWhat really made this place was the delicious ramen broth! Deeelicious. We had the tonkatsu ramen and the pork was very tender and cooked to perfection! One of us had the pork replaced with the fried chicken - also very good, but I would go for the classic tonkatsu if you are trying this place for the first time.\n\nService was friendly. There was a slight miscommunication on our orders, but they were apologetic enough afterwards. The people here are very nice. :)", "rating": 4, "date": "2014-06-03"}, {"excerpts": ["We got a bowl of the tonkatsu ramen and the karaage ramen and they were both ok.  ", "It definitely wasn't anything memorable, but it was fine."], "author": "Lisa C.", "review": "Maybe I just had too high expectations, but I just wasn't impressed by Kama Sushi.  The restaurant was super cute and small and the service was excellent and attentive, but the food was only ok.\n\nWe got a bowl of the tonkatsu ramen and the karaage ramen and they were both ok.  It definitely wasn't anything memorable, but it was fine.", "rating": 3, "date": "2013-06-13"}, {"excerpts": ["I am particularly a fan of the tonkatsu ramen in pork broth.  ", "but i've also tried rolls which were good too.  ", "For a neighborhood joint, it has a pleasant ambience.  ", "Am definitely going back!"], "author": "cherie y.", "review": "I've been to Kama twice and gotten delivery once.  On both visits, I found them super friendly and attentive.  Free edamame when you dine in!  The food was tasty and reasonably priced.  I am particularly a fan of the tonkatsu ramen in pork broth.  but i've also tried rolls which were good too.  For a neighborhood joint, it has a pleasant ambience.  Am definitely going back!", "rating": 4, "date": "2012-03-18"}, {"excerpts": ["Must try Mango Tango, Cannon, Crunchy Lobster, and Tonkatsu Ramen! ", "They are to die for!!"], "author": "Linda F.", "review": "I love coming to Kama! I love the food! I love the ambiance. What else can I say more? \n\nStaffs are very attentive and polite. Rolls are creative and have good proportions between rice, seaweed, and fish. \n\nMust try Mango Tango, Cannon, Crunchy Lobster, and Tonkatsu Ramen! They are to die for!!", "rating": 5, "date": "2012-01-30"}], "veggie ramen": [{"excerpts": ["FANTASTIC veggie ramen! ", "Wish it was open more than only 4.5 hours a day. ", "Local spot."], "author": "S B.", "review": "FANTASTIC veggie ramen! Wish it was open more than only 4.5 hours a day. Local spot.", "rating": 4, "date": "2015-12-19"}], "curry rice": [], "curry udon": [], "plain udon": [], "grilled toro signature roll": [], "white out signature roll": [], "c signature roll": [], "rainbow signature roll": [], "dragon signature roll": [], "golden dragon signature roll": [], "red dragon signature roll": [], "er signature roll": [], "pyramid signature roll": [], "hot papa signature roll": [], "foxy signature roll": [], "crunchy lobster signature roll": [], "hot mama signature roll": [], "cannon signature roll": [], "super dynamite signature roll": [], "super spicy tuna signature roll": [], "august th signature roll": [], "lemon hama signature roll": [], "nor cal signature roll": [], "autumn signature roll": [], "fire cracker balls signature roll": [], "g": [], "real crab california roll": [], "checkerboard roll": [], "f": [{"excerpts": ["Happy Hour is EVERYDAY (yes, S M T W R F S) from 5PM - 6:30PM\n\n"], "author": "Drea B.", "review": "Kama Sushi has a solid happy hour! \n\nHappy Hour is EVERYDAY (yes, S M T W R F S) from 5PM - 6:30PM\n\nYou get a free hot sake if you check-in on Yelp, too! \n\nMy friend from LA and I visiting for the first time this past weekend. We told our waiter it was a our first time checking out the restaurant and he gave us some hot sake on the house! \n\nYou get a pretty good deal for nigiri: $2.95 for two pieces. I tried the sake (salmon) and I was pleased. Got a few other roles off the HH menu (each $4.95). Be sure to try the spicy salmon! \n\nFriendly staff, clean facilities, and quality sushi! \n\nYou should definitely check out this sushi spot if your looking for a great sushi in Noe Valley. It is definitely a quaint little hole-in-in the wall.", "rating": 4, "date": "2012-07-23"}, {"excerpts": ["How f-ed up is that?\n\n"], "author": "barry a.", "review": "I was sitting on this review for a few weeks mulling over what to say.  I've been to Kama Sushi enough times now to form an informed opinion.  I suppose the last visit there made me not want to return.  To sum up why I won't be back:  1) food is just OK but expensive, 2) menu is limited not many dinner choices and 3) the head waiter has a bad attitude, forgot to bring us our food -- and, get this,  gave us our bill before serving our food.  How f-ed up is that?\n\nAnyway, I had high expectations for this place after Amberjack left and Kama took over.  I gave the place enough chances, but am giving up on this one.  There's just too many other good restaurant choices in the city with much better prices, but I am still searching for a reasonably priced, good Japanese place.", "rating": 2, "date": "2011-10-23"}], "day and night roll": [], "alaska roll": [], "cherry blossom roll": [], "angel roll": [], "warrior roll": [], "bay scallop roll": [], "orange melody roll": [], "x roll": [], "dinner set": [], "negima skewers": [], "butabara skewers": [], "torikawa skewers": [], "shishito skewers": [], "tebasaki skewers": [], "kuroduta skewers": [], "beef skewers": [], "mochi lover": [], "japanese style cheesecake": [], "kids ramune soda": [], "spicy hamachi toro nigiri chef special": [], "sake harami nigiri chef special": [], "maki tray": [], "signature tray": [], "nigiri tray": [], "party tray combo": [], "boston roll": [{"excerpts": ["Nice cuts of sashimi, decent \"Boston roll\", decent deep fried soft shell crab."], "author": "Maximillian M.", "review": "Nice cuts of sashimi, decent \"Boston roll\", decent deep fried soft shell crab.", "rating": 3, "date": "2015-12-01"}, {"excerpts": ["We ended up getting the rainbow shrimp (grilled shrimp wrapped in bacon, $6.95), negi hana roll ($5.95), spicy scallop roll ($5.95), and Boston roll ($5.95).  ", "It ended up being just enough food for two mildly hungry people and we enjoyed all the items.  ", "The star of the show was the rainbow shrimp- ", "but that's not all that fair to the others because how can anything really compete with bacon?"], "author": "Cersei T.", "review": "I normally am a fan of what some would call \"white girl sushi\".  You know the type: cali rolls, anything with spicy mayo and deep fried.  Since being forced to go gluten free, my sushi experiences have been pretty limited.  I can't have soy sauce, anything fried, or imitation krab.  The waitstaff at Kama Sushi was extremely knowledgeable about the menu and was able to tell us exactly what we could and couldn't have.  They didn't offer tamari, but luckily we brought our own packets just in case.     We ended up getting the rainbow shrimp (grilled shrimp wrapped in bacon, $6.95), negi hana roll ($5.95), spicy scallop roll ($5.95), and Boston roll ($5.95).  It ended up being just enough food for two mildly hungry people and we enjoyed all the items.  The star of the show was the rainbow shrimp- but that's not all that fair to the others because how can anything really compete with bacon?", "rating": 4, "date": "2011-11-20"}], "tempura roll": [], "unacrab roll": [], "unago roll": []}