{"buffalo strips": [], "baked brie and fruit": [], "ballycastle sausage roll": [], "hibernian salad": [], "kells burger": [], "steak sandwich": [], "mac and cheese": [], "belfast bangers and mash": [], "kells fish and chips": [], "sausage roll": [{"excerpts": ["And just tried the sausage roll, expect a sausage, but it was more like ground sausage Ina pastry roll with savory sauce. "], "author": "Raymond H.", "review": "Loving Kells, and looking at other reviews, you gotta have the right expectations. Caught a standup show a couple weeks ago, and just stopped in for a snack and a shot of Jameson. \n\nOn food, tried bangers and mash, exactly what I was looking for with bockwurst and mashed potatoes. So good. And just tried the sausage roll, expect a sausage, but it was more like ground sausage Ina pastry roll with savory sauce. Hit the spot.\n\nDon't expect a trendy experience, just a great neighborhood pub with solid food and drinks. Cheers!", "rating": 4, "date": "2016-08-31"}, {"excerpts": ["Stopped in for a midweek lunch at 11:30 and enjoyed my pints and sausage roll appetizer (as a light meal). ", "The barkeep was a very friendly lad from County Sligo with whom I really enjoyed talking. ", "The atmosphere was slightly more authentic than most Irish pubs, and I appreciated keeping the TV volume muted so I could enjoy the campy Irish tunes!"], "author": "Séamus C.", "review": "Stopped in for a midweek lunch at 11:30 and enjoyed my pints and sausage roll appetizer (as a light meal). The barkeep was a very friendly lad from County Sligo with whom I really enjoyed talking. The atmosphere was slightly more authentic than most Irish pubs, and I appreciated keeping the TV volume muted so I could enjoy the campy Irish tunes!", "rating": 4, "date": "2015-07-01"}, {"excerpts": ["One of the appetizers was the sausage roll - which the waitress said was their signature dish, and it was pretty good. ", "All in all it was a nice place to have a drink ", "and I would be back."], "author": "Allie H.", "review": "Went here on a Monday night to catch up with an old friend after work. Place was not crowded, but there were quite a few people in there enjoying happy hour and watching MNF. We drank a couple of beers and had a couple of appetizers. One of the appetizers was the sausage roll - which the waitress said was their signature dish, and it was pretty good. All in all it was a nice place to have a drink and I would be back.", "rating": 3, "date": "2014-12-05"}, {"excerpts": ["Tried the sausage roll (yum) and the Irish stew, which was basically lamb stew except  in broth--tasty, but underwhelming. ", "Great service."], "author": "Maximillian M.", "review": "Tried the sausage roll (yum) and the Irish stew, which was basically lamb stew except  in broth--tasty, but underwhelming. Great service.", "rating": 3, "date": "2013-06-06"}, {"excerpts": ["Sausage roll was ok, bangers and mash was just ok, hamburger was just ok, shepherds pie was just ok. ", "It's a little disappointing that the food is not as good as the Kells in Portland."], "author": "Jeff P.", "review": "Was here on a Saturday around four. Was quiet. Service was good. Sausage roll was ok, bangers and mash was just ok, hamburger was just ok, shepherds pie was just ok. It's a little disappointing that the food is not as good as the Kells in Portland.", "rating": 3, "date": "2013-10-12"}]}