{"guava juice": [], "orange passion": [{"excerpts": ["They also have the Hawaiian Sun Orange Passion drink in a can, which I love.  ", "I'd come here again, but the parking in the area is much worse than in the Richmond.  ", "It's a good backup place to go if the wait is too much to bear at the other surrounding places."], "author": "Emy B.", "review": "Ah, so this is Kitaro's sister restaurant.  Kiki's menu looks almost exactly the same.  The wait over at Manna was ridiculously long on a Saturday night and we were hungry now so we walk over to Kiki and got seated right away.  Food is consistent with Kitaro and so glad there weren't any disappointments.  I enjoyed the Shrimp Tempura, miso soup, and the Teriyaki Beef.  They also have the Hawaiian Sun Orange Passion drink in a can, which I love.  I'd come here again, but the parking in the area is much worse than in the Richmond.  It's a good backup place to go if the wait is too much to bear at the other surrounding places.", "rating": 3, "date": "2014-04-21"}], "lady gaga": [{"excerpts": ["If you do get sushi, get the lady gaga roll. ", "It's soooo good and different. "], "author": "Julie L.", "review": "This place is solid for the price. I don't recommend the sushi, but their happy hour that is from 3-7pm is awesome. This place is really cheap. I honestly recommend the bento boxes. Skip the sushi. Bento boxes will have your best bang for your buck. \n\nIf you do get sushi, get the lady gaga roll. It's soooo good and different. Their lychee jelly soju cocktail is also pretty tasty. \n\nThis place can get pretty busy, but there is quite a bit of seating. Just remember, you're coming here for the food for what you're paying for and not the service for sure.", "rating": 3, "date": "2016-11-29"}, {"excerpts": ["This time I got the Lady Gaga (unagi & tofu wrapped and tempura battered/fried topped with spicy sauce and tobiko). ", "YUM. "], "author": "Savannah B.", "review": "I have been here twice, and both times I have had positive experiences. The food is really yummy and quite cheap. I have been to other sushi restaurants which were also cheap, and the  quality was not up to par. Kiki, on the other hand, is delicious! PLUS it's decorated with Studio Ghibli posters! I love that. =) \n\nThis time I got the Lady Gaga (unagi & tofu wrapped and tempura battered/fried topped with spicy sauce and tobiko). YUM. Also got an order of tobiko nigiri and a spicy tuna hand roll. \n\nWill definitely be making this a frequent lunch spot for myself.", "rating": 5, "date": "2017-09-21"}, {"excerpts": ["We had the Lady Gaga roll, that sriracha really makes you want to drink that water.  ", "Tea is extra charge."], "author": "Helen L.", "review": "No nonsense good Japanese affordable food.  Had the dinner bento with teriyaki salmon (good size portion) and chicken with teriyaki sauce on the side.  Small cup of rice and salad.  The dressing was light.  Portion was just enough but no next-day-lunch.  Got 15% off with my Lucky supermarket receipt.  We scored a parking spot nearby.  Other restaurants had lines out the door and this place just had a few seats left.  Hunger determines where to eat.  We had the Lady Gaga roll, that sriracha really makes you want to drink that water.  Tea is extra charge.", "rating": 3, "date": "2017-03-19"}, {"excerpts": ["I also got to try the lady gaga roll (4 piece, $3), which was pretty tasty.\n\n"], "author": "Tara A.", "review": "Kiki Japanese Restaurant is always a great choice when you're craving sushi, but don't want to break the bank. I've been coming here since high school, whether it's with friends or family.\n\nSashimi is really good quality for the price. The salmon and the yellowtail are favorites of mine! The salmon is always really buttery and the pieces are a good size. The sashimi dinners (14 pieces + salad and rice for ~$14) are a great deal. You also get a lot of bang for your buck with the combination dinners, because you get 2 items of your choice, and you can choose between a large variety of items including things like 7 piece sashimi, 6 piece rolls, or even heartier options like chicken karage, tempura, or tonkatsu. The chicken karage is really good, freshly fried and super hot when it comes out! The sriacha mayo that comes with it is good and not too spicy, or you can ask for teriyaki sauce on the side. They also have a bunch of cheap rolls. I like the alaska roll (yay, more salmon!) and the rock n roll (eel + avo), which is on the combo dinner menu too! Usually I can get 2 and it fills me up for lunch or dinner!\n\nThey have a bunch of new items on the menu that aren't included in the online menu. I really liked the curry udon with chicken katsu ($7). The udon was really soft and the broth was perfect!! I also got to try the lady gaga roll (4 piece, $3), which was pretty tasty.\n\nKiki's has a great happy hour now (every day, from 3-9pm), where you can get a large beer and a large sake for $5.50. Great deal!!! My parents love coming here for that and I can't wait to bring my friends here for happy hour too. \n\nService is usually very friendly, but sometimes they are understaffed. The place does get crowded around 6:30 pm for weekend dinners so try to go earlier than that!\n\nAnd be sure to save those safeway receipts! There's a 15% coupon on the back for kiki's! I think you can go on their website and get coupons too.", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["And because I guess a review isn't credible unless it's a 6 paragraph essay, the lady gaga roll was bomb."], "author": "Amanda K.", "review": "Good food, great prices, super cute atmosphere!\n\nAnd because I guess a review isn't credible unless it's a 6 paragraph essay, the lady gaga roll was bomb.", "rating": 5, "date": "2016-08-13"}, {"excerpts": ["My favorites are Firecracker roll, Lady Gaga, Godzilla and their chicken karage. \n", "I left one star out, because the restroom wasn't that great, and I had to get up and get my own utensils because all the server was too busy talking in the kitchen. ", "Overall, I had a good experience and will definitely come back."], "author": "Deneb T.", "review": "I've been here couple of time with my family and it never disappointed me. I always leave this place full. Plus, it's a good place to get sushi in the city once it gets a little dark out. It may look tiny from the outside, but once you walk in it's bigger than you imagine. \n\nAlso, it's great for college students or anyone on a budget; their food is pretty cheap ranging from $3 and up. Don't expect the $3 sushi to be a whole roll, more like 4 or 5. My favorites are Firecracker roll, Lady Gaga, Godzilla and their chicken karage. \nI left one star out, because the restroom wasn't that great, and I had to get up and get my own utensils because all the server was too busy talking in the kitchen. Overall, I had a good experience and will definitely come back.", "rating": 4, "date": "2014-10-28"}, {"excerpts": ["Enjoyed the new Lady Gaga! ", "Thought the Pink Dragon lacked flavor (but I also didn't read carefully to see that the salmon would be cooked). ", "I came during the off hours and found the service attentive and fast. ", "Overall, I would come back to this place before heading over to Golden Gate Park."], "author": "Mel G.", "review": "Enjoyed the new Lady Gaga! Thought the Pink Dragon lacked flavor (but I also didn't read carefully to see that the salmon would be cooked). I came during the off hours and found the service attentive and fast. Overall, I would come back to this place before heading over to Golden Gate Park.", "rating": 3, "date": "2017-04-05"}, {"excerpts": ["Its pretty cool, how they name their rolls after other things like the, \"Lady Gaga Roll\", the \"49ers Roll\", and etc. ", "What sucks about this place is that they don't have tea that's included for free like most Japanese sushi places."], "author": "Jeanette Q.", "review": "Went here yesterday for dinner with a few friends. The sushi here is pretty cheap compared to other places. We were lucky to be able to find parking right in front of the place. We thought the front of the place was cute with the slanted door, looked pretty small from the outside but the inside is pretty spacious. I got the two item bento box (with the ROCK N ROLL, Chicken Katsu, rice and salad) You get to pick any two items from the menu and the price is added together. One of my friends got the curry chicken udon, one got the pink dragon roll, and another got two sushi rolls. It was pretty good, we all enjoyed our food. It wasn't the best though. You can also ask them for any sauces that you may want for your sushi and stuff. One of my friends asked them for a siracha-mayo sauce and they gave it to her. Its pretty good with the sushi. \n\nIts pretty cool, how they name their rolls after other things like the, \"Lady Gaga Roll\", the \"49ers Roll\", and etc. What sucks about this place is that they don't have tea that's included for free like most Japanese sushi places.", "rating": 4, "date": "2013-06-16"}, {"excerpts": ["Lady Gaga rolls and hamachi nigiri ", "we're spot on; that's what happens when the stomach takes control of ordering...\n", "We're headed back very soon after the new Georgia O'Keefe works of art are up for display! ", "See ya Kiki!"], "author": "Meredith C.", "review": "Thank you Kiki...whoever you are!\nYou're a lifesaver for being open on this Labor Day.\nAfter a very pleasant day of visiting the artsy exhibits at the De Young Museum (eyes dazzled over the Bulgari gems display), the family was just famished and went searching  for a delicious meal. Found and checked out this place. Whaat?! You have combo meals and bentos that are unpretentious and delicious?!  Swooped in and immediately ordered up. Udon + unagi don was umami-licious! Bento box combo of chicken Katsu and tempura was heavenly! Lady Gaga rolls and hamachi nigiri we're spot on; that's what happens when the stomach takes control of ordering...\nWe're headed back very soon after the new Georgia O'Keefe works of art are up for display! See ya Kiki!", "rating": 5, "date": "2014-02-21"}, {"excerpts": ["The rolls we got were the red dragon roll and the lady gaga. ", "We got a third ", "but I don't remember the name. ", "The lady gaga was fried and it came with 4 pieces of sushi and the red dragon was spicy!! ", "Both rolls were delicious and I recommend them if you like a little bit of spiciness! ", "For dessert we wanted deep fried green tea ice cream but they didn't do that. ", "We still got the green tea ice cream and it tasted very fresh and not too heavy on the flavor. ", "Overall the service was good; the waiters were efficient and frequently checked up on us!"], "author": "Sandra C.", "review": "This place is awesome!!!! They have happy hour on the weekends, their rolls are super inexpesinve, and they have a wide variety of choices. The big bottle of Sappora and sake is only $5! The rolls we got were the red dragon roll and the lady gaga. We got a third but I don't remember the name. The lady gaga was fried and it came with 4 pieces of sushi and the red dragon was spicy!! Both rolls were delicious and I recommend them if you like a little bit of spiciness! For dessert we wanted deep fried green tea ice cream but they didn't do that. We still got the green tea ice cream and it tasted very fresh and not too heavy on the flavor. Overall the service was good; the waiters were efficient and frequently checked up on us!", "rating": 5, "date": "2014-10-19"}, {"excerpts": ["I ordered the Chicken Teriyaki and Gyoza bento and the Lady Gaga roll. ", "I would say the chicken was a bit too dry and the Lady Gaga roll was okay. ", "The service here was acceptable where our order came fast after we ordered. ", "Overall the food here is good for the price you pay for. ", "If you have a receipt from Safeway then you should also look out for their 15% off coupons on the back. ", "Would return later to try other items on their menu with a interesting name."], "author": "Peter C.", "review": "The sister restaurant of Kitaro with a similar menu. I ordered the Chicken Teriyaki and Gyoza bento and the Lady Gaga roll. I would say the chicken was a bit too dry and the Lady Gaga roll was okay. The service here was acceptable where our order came fast after we ordered. Overall the food here is good for the price you pay for. If you have a receipt from Safeway then you should also look out for their 15% off coupons on the back. Would return later to try other items on their menu with a interesting name.", "rating": 3, "date": "2013-06-20"}, {"excerpts": ["Oh I love the salmon and the Lady GaGa ", "roll w/spicy mayo-  ", "it was delicious. ", "I will definitely come back here again when I am in town."], "author": "An S.", "review": "Kiki Japanese Restaurant is real affordable! Quick service & inexpensive meals, what a combo right? Also, the awkward window in the front looks really cool and adds a nice vibe to this restaurant.\nAnyways, I did have a little issue with the waitress, I order a combo plate and I told her exactly what I wanted but we had a bit of a communication problem, I'm just going to blame myself since I had on my retainers and I sound like Daffy Duck- so I had to point to the pictures.\nWhen I took a bit into my food oh it felt orgasmic!  Oh I love the salmon and the Lady GaGa roll w/spicy mayo-  it was delicious. I will definitely come back here again when I am in town.", "rating": 5, "date": "2013-09-09"}, {"excerpts": ["dishes are great (Lady Gaga, Alaska roll, anything with unagi"], "author": "Stephanie D.", "review": "My review in 5 words or less: delicious cheap sushi, cafeteria lighting! \n\nThis is a great place to get reasonably priced, decent sushi with a GREAT happy hour sake/Sapporo special. Not recommended for first dates due to the cafeteria lighting/decor, but a great place for a quick bite nonetheless.\n\nPROS:\n-inexpensive sushi\n-awesome Sapporo/sake happy hour ($5.50 for large, $3.50 for small)\n-really cheap and tasty miso soup and edamame\n-very fast service\n-friendly wait staff\n-some dishes are great (Lady Gaga, Alaska roll, anything with unagi, crispy Spam roll, dragon roll)\n-kid friendly\n-very good lighting if you want to see absolutely every detail of everything\n\nCONS:\n-sticky tables/floor\n-sometimes you need to flag your waiter\n-some dishes are just OK (spicy tuna roll, udon noodles, firecracker roll)\n-decor not sexy\n\nNext door is a much fancier sushi place with much fancier prices (Ebisu). But my husband and I always go to Kiki because the service is fast, the prices are great, the sake is hot, the sushi is tasty, and the conversation is just as great. Plus we can really see each other a lot better.", "rating": 4, "date": "2013-06-05"}, {"excerpts": ["I recommend the Lady Gaga which is a four piece unagi & tofu roll in tempura style, topped with tobiko (caviar), onion & spicy sauce. ", "My sister usually orders the chicken karaage and she enjoys it. ", "I always order the rock and roll which is unagi (eel) and avocado. ", "What I like is that each piece of sushi is humongous! ", "It's not phenomenal but two rolls fill me and they taste pretty darn good. ", "Also, their udon is nothing special and the beef in it is extremely chewy. ", "Not for me. "], "author": "Joyce L.", "review": "If you didn't already figure it out, Kiki and Kitaro (on Geary) are sister companies. Same owner and alternating workers, just different names. I don't really understand why they do this though. Kiki's is my go to place for some decently priced sushi. I always come with the 15% off coupons I clip out from safeway receipts but can you blame me? I consider myself a frequenter of this restaurant as well.\n\nI recommend the Lady Gaga which is a four piece unagi & tofu roll in tempura style, topped with tobiko (caviar), onion & spicy sauce. My sister usually orders the chicken karaage and she enjoys it. I always order the rock and roll which is unagi (eel) and avocado. What I like is that each piece of sushi is humongous! It's not phenomenal but two rolls fill me and they taste pretty darn good. Also, their udon is nothing special and the beef in it is extremely chewy. Not for me. If anything, get the plain udon.\n\nThis isn't what I consider a \"real\" japanese restaurant but I'll still visit this joint rather than the two fancier neighboring ones because they're pretty pricey without offering much more than beautiful decor. Service at kiki's is still pretty exceptional and their wait times are extremely fast. I get seated quickly and wait less than 10 minutes for my food to arrive. If you're in a time crunch, call for to go! My friends and I once shared a party tray in the car after a long day because we didn't feel like going in and sitting. I definitely recommend trying this place out at least once!", "rating": 4, "date": "2013-05-08"}, {"excerpts": ["average to good sushi\ncute sushi names: the lady gaga\ngood customer service\nfree green tea!\n"], "author": "diana b.", "review": "So Kiki has done something right, that others should take notice of. They are located in a great neighborhood. Actually it's my neighborhood, but that's not what I mean. It's in a busyish street with a good balance of locals and tourists. It's stands out with its cute name and humorous crooked window. It has even more personality on the inside with it's yellow walls and anime photos. That's right people Anime like the cute cartoon characters from your geeky past, they are the focal art! \n\nPlus: \nCheapest sushi I've ever had period.\naverage to good sushi\ncute sushi names: the lady gaga\ngood customer service\nfree green tea!\nnever packed\n\nCons:\nI've had better Sushi\nThe Anime can feel a little childish\n\n\nSo, in summary great way to eat sushi without feeling guilty about it via your bank account. I do believe Kiki will be on my weekly rotation of places to eat and be merry :)", "rating": 4, "date": "2012-04-18"}, {"excerpts": ["Decent prices, decent food: had the veggie tempura with yellowtail sashimi, plus a Lady Gaga roll. ", "Yeah, that happened."], "author": "Maximillian M.", "review": "Decent prices, decent food: had the veggie tempura with yellowtail sashimi, plus a Lady Gaga roll. Yeah, that happened.", "rating": 3, "date": "2012-09-04"}, {"excerpts": ["My usual are Firecracker and Lady Gaga sushis. ", "Mmm, love those! ", "Prices are reasonable. ", "Place is cute (has Anime posters and paintings all over)."], "author": "Julie W.", "review": "I order takeouts here pretty often. My usual are Firecracker and Lady Gaga sushis. Mmm, love those! Prices are reasonable. Place is cute (has Anime posters and paintings all over).", "rating": 4, "date": "2013-12-20"}, {"excerpts": ["Lady Gaga, and 49's roll are my favs."], "author": "Yoli B.", "review": "Good sushi at good prices. Service can suck sometimes. Parking is almost always a pain. Lady Gaga, and 49's roll are my favs.", "rating": 4, "date": "2011-11-02"}, {"excerpts": ["They even had a new Lady Gaga roll (around $3 I believe, but 4 pieces) that I was debating on trying - I will most definitely come back and get that.\n\n"], "author": "Rae A.", "review": "Irving never fails me when I go looking for food to eat. I'm a fan of sushi, but I'm also a bigger fan of inexpensive, GOOD food. Kiki Sushi is the place to go for cheap, delicious sushi and/or bento.\n\nI went during lunch and had the lunch combination meal: Chicken Karaage with a Dynamite Roll (6 pieces) = $8.39\n\nThe meal came with a side of rice and salad as well, and they didn't skip out on the quantity of karaage either, so I was full by the time I managed to eat it all.\n\nTheir sushi rolls range from $3-9, pretty cheap considering most of them are 6 pieces. They even had a new Lady Gaga roll (around $3 I believe, but 4 pieces) that I was debating on trying - I will most definitely come back and get that.\n\nI came here with my two other people, and our meal totaled up to around $27, pretty good considering other sushi places would most likely charge a whole lot more.", "rating": 5, "date": "2011-06-22"}, {"excerpts": ["mmmmm....just wanted to let everyone know that the\nLADY GAGA roll is 2 die 4! ", "hurry! ", "go get one!"], "author": "B F.", "review": "mmmmm....just wanted to let everyone know that the\nLADY GAGA roll is 2 die 4! hurry! go get one!", "rating": 4, "date": "2011-08-12"}], "piece ebi fry": [], "shrimp and vegetable tempura": [{"excerpts": [".. i would stay away\n-the shrimp and vegetable tempura (3 shrimp pieces) was quite deep fried, but stale\n-the 49er roll was good, and the rock n roll was good. "], "author": "simon k.", "review": "What an interesting door on an interesting street, with the most..dull food. I suppose if you enjoy savin a buck or two on japanese food, kiki's would be a good restaurant to go to. My girlfriend and I came here on a mundane monday, defying the legion of yelp reviews on how this place was no good for the japanese restaurant go-er. I guess.. the yelp reviews were accurate afterall. This place is 3 star material. \n\nwalkin in, I am hit with the orange colored walls, decorated with mizayake film posters of totoro, spirited away, and princess mononoke. Aside from the beautiful posters, the restaurant lack.. decor. I felt as though I was at a shopping mall plaza.. you know that feeling you get when u are eating at a food court?.. that's how it felt like. I think it is because of the wild orange colored walls and the lack of japanese-esque decorations. I truly believe that a restaurant experience is not only in the food and service, but in the knicks and knacks of the store as well; a restaurant is nothing without the unique tastes of the owner. Without style.. there is not much of a restaurant to enjoy.. aside from the food.\n\nthe food was OK. My girlfriend and I both had the bento box. I had the chicken karaage and vegetable tempura. My girlfriend had the chicken teriyaki and the rock-n-roll. The bento boxes each came with a side salad, rice, and sauce. On the side, we also got the 49er roll. \n-the chicken teriyaki was decent, i would recommend if you must come here\n-the chicken karaage was way too dry, and way too deep fried.. i would stay away\n-the shrimp and vegetable tempura (3 shrimp pieces) was quite deep fried, but stale\n-the 49er roll was good, and the rock n roll was good. 3 and a 1/2 stars for the rolls.\n\n-wifive-", "rating": 3, "date": "2011-02-08"}], "piece tuna sashimi": [], "piece salmon sashimi": [], "yellowtail sashimi": [{"excerpts": ["Here is what we had today for lunch for me and my fiancee:\n7 pc yellowtail sashimi\n7 pc albacore sashimi\n7 pc tuna sashimi\nassorted sashimi appetizer (5 types of fish 10 pc) \nand my favorite there - Dragon roll with shrimp tempura inside, avocado and unagi on top.\n"], "author": "Anelya S.", "review": "I am officially fan of this place. Here is what we had today for lunch for me and my fiancee:\n7 pc yellowtail sashimi\n7 pc albacore sashimi\n7 pc tuna sashimi\nassorted sashimi appetizer (5 types of fish 10 pc) \nand my favorite there - Dragon roll with shrimp tempura inside, avocado and unagi on top.\nLg Sapporo\n\nIn the end 2 fully satisfied people and total check with tip = $60.\n\nWe tried everything out of sushi/sashimi on the menu and that's the best for us, so may be you will like it too, it definitely worth a shot!", "rating": 5, "date": "2008-09-13"}, {"excerpts": ["Decent prices, decent food: had the veggie tempura with yellowtail sashimi, plus a Lady Gaga roll. ", "Yeah, that happened."], "author": "Maximillian M.", "review": "Decent prices, decent food: had the veggie tempura with yellowtail sashimi, plus a Lady Gaga roll. Yeah, that happened.", "rating": 3, "date": "2012-09-04"}], "item combination dinner": [], "spicy miso udon": [], "curry udon": [{"excerpts": ["My mother and my younger brother were much hungrier than I was, so they ordred a pair of bento box plates while I ordered a new menu item, the Curry Udon. ", "The bento box plates were good, though not parcticularly amazing. ", "The Curry Udon was really flavorful, you taste the kick of the curry with each slurp. ", "However, the chicken katsu that topped the bowl of noodles was only okay, a bit bland and lesser than most katsu chicken. ", "Overall, it's a good place for a late lunch, and most certainly worth the price."], "author": "Nick R.", "review": "Went in during a foggy Saturday in San Francisco. I was looking for something very cheap but also a bit spicy. My mother and my younger brother were much hungrier than I was, so they ordred a pair of bento box plates while I ordered a new menu item, the Curry Udon. The bento box plates were good, though not parcticularly amazing. The Curry Udon was really flavorful, you taste the kick of the curry with each slurp. However, the chicken katsu that topped the bowl of noodles was only okay, a bit bland and lesser than most katsu chicken. Overall, it's a good place for a late lunch, and most certainly worth the price.", "rating": 4, "date": "2018-07-30"}, {"excerpts": ["I really liked the curry udon with chicken katsu ($7). ", "The udon was really soft and the broth was perfect!! "], "author": "Tara A.", "review": "Kiki Japanese Restaurant is always a great choice when you're craving sushi, but don't want to break the bank. I've been coming here since high school, whether it's with friends or family.\n\nSashimi is really good quality for the price. The salmon and the yellowtail are favorites of mine! The salmon is always really buttery and the pieces are a good size. The sashimi dinners (14 pieces + salad and rice for ~$14) are a great deal. You also get a lot of bang for your buck with the combination dinners, because you get 2 items of your choice, and you can choose between a large variety of items including things like 7 piece sashimi, 6 piece rolls, or even heartier options like chicken karage, tempura, or tonkatsu. The chicken karage is really good, freshly fried and super hot when it comes out! The sriacha mayo that comes with it is good and not too spicy, or you can ask for teriyaki sauce on the side. They also have a bunch of cheap rolls. I like the alaska roll (yay, more salmon!) and the rock n roll (eel + avo), which is on the combo dinner menu too! Usually I can get 2 and it fills me up for lunch or dinner!\n\nThey have a bunch of new items on the menu that aren't included in the online menu. I really liked the curry udon with chicken katsu ($7). The udon was really soft and the broth was perfect!! I also got to try the lady gaga roll (4 piece, $3), which was pretty tasty.\n\nKiki's has a great happy hour now (every day, from 3-9pm), where you can get a large beer and a large sake for $5.50. Great deal!!! My parents love coming here for that and I can't wait to bring my friends here for happy hour too. \n\nService is usually very friendly, but sometimes they are understaffed. The place does get crowded around 6:30 pm for weekend dinners so try to go earlier than that!\n\nAnd be sure to save those safeway receipts! There's a 15% coupon on the back for kiki's! I think you can go on their website and get coupons too.", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["I got a curry udon combo with a salmon donburi for around $10. ", "The curry udon was udon in a mixture of curry powder and water. ", "The Rock n' Roll (unagi and avocado) and the chicken teriyaki were both ok. ", "But, whenever I go to a restaurant that hands me unwashed utensils, bowls, or cups ", "I lose my appetite, such as I did here. ", "We ordered a bunch of sake bombs for happy hour but two of our sake glasses were filled with yellow food spots all over. ", "What made it worse was that the small glasses were flipped to cover the top of our Sapporos so the mouth of the bottle was grimy. "], "author": "Ingrid C.", "review": "Everything is abnormally cheap. Most of the sushi rolls are $5 and under. I got a curry udon combo with a salmon donburi for around $10. Keep in mind, what you pay for is what you get.\n\nThe curry udon was udon in a mixture of curry powder and water. The Rock n' Roll (unagi and avocado) and the chicken teriyaki were both ok. But, whenever I go to a restaurant that hands me unwashed utensils, bowls, or cups I lose my appetite, such as I did here. We ordered a bunch of sake bombs for happy hour but two of our sake glasses were filled with yellow food spots all over. What made it worse was that the small glasses were flipped to cover the top of our Sapporos so the mouth of the bottle was grimy. The bowls and soy sauce dishes were also sticky and not thoroughly washed. \n\nI don't recommend getting anything raw here... seeing how unsanitary this place is. The tuna was not fresh and it was still thawing when I bit into it. I felt like I was eating slices of fish soaked in water.\n\nKiki's is good for sake bombs ($5.50 for large sapporo and sake), drinking, and getting rowdy from drinking. Other than that, the cooked food is edible.\n\nI would give this place one star but Kiki's gets one additional star for its price and having affordable happy hour sake and beer deals.", "rating": 2, "date": "2015-07-14"}, {"excerpts": ["-Chicken curry udon ($6.49): ", "a very good sized portion for the price.  ", "My friend and I both ordered this (after hearing good things about it from another friend) and neither of us finished ours.  ", "There is a fair portion of chicken and some nice fried onions tossed in as well.  ", "The curry soup was very flavorful and a bit on the spicy side- ", "but it was still pretty good.  ", "The curry udon is probably the best thing I've had here.  ", "Their sushi rolls aren't really that spectacular, but if you want something like a California roll, they'll have it.  "], "author": "Samantha L.", "review": "I've eaten take-out from Kiki's several times, but a couple weeks ago, I actually made my first visit inside.  I went around 12:30 p.m. on a weekday and the place was about 1/3 full.  The restaurant has a very casual vibe and the four of us were seated very quickly.  \n\nThe menu has pretty much most things you'd expect from a Japanese restaurant: simple sushi rolls, curry, sesame chicken, teriyaki items, udon, etc.  So it's a good place for those who like variety.  The food itself is pretty decent and very fairly priced.\n\nI ordered:\n-Tea (free): warm tea is a nice touch- we even had the pot refilled once.\n\n-Chicken curry udon ($6.49): a very good sized portion for the price.  My friend and I both ordered this (after hearing good things about it from another friend) and neither of us finished ours.  There is a fair portion of chicken and some nice fried onions tossed in as well.  The curry soup was very flavorful and a bit on the spicy side- but it was still pretty good.  The noodles taste like any other udon that I would buy from the supermarket and cook up at home, but that's good enough for me.\n\nOverall, the food is decent and the price is right.  The curry udon is probably the best thing I've had here.  Their sushi rolls aren't really that spectacular, but if you want something like a California roll, they'll have it.  I probably won't be eating here that often, but it's alright for take out.\n\nNotes:\n-They frequently have 15% off coupons (back of Safeway receipt).", "rating": 3, "date": "2012-02-02"}, {"excerpts": ["In addition to many of the rolls, I've also had the curry udon and regular udon.  ", "I would have to say that my favorite rolls are the Spider, Dynamite, and Hawaii.  ", "I was VERY disappointed by the Rainbow roll due to the inconsistency in the quality of the fish.  ", "If I have to dip my sashimi pieces in wasabi soy sauce to augment the taste, there is something fishy.  ", "I like my sushi / sashimi straight up -- the way the Japanese intended.  ", "The wait staff is friendly and checks up on you at just the right intervals.  "], "author": "Catherine A.", "review": "since moving here from Beantown a 6 months ago, i've been looking for a replacement for Avana Sushi - a cheap but delicious sushi joint in the heart of Boston's Chi-town.  Kiki's comes pretty close, hitting the points of value, attentive service, funky decor...falling short in consistency of product...but making up for it with variety.\n\nIn comparison to other sushi restaurants in the Bay area, Kiki's is cheap.  You can get a decently full on sushi for under $15.  The other hot food menu items are not bad.  In addition to many of the rolls, I've also had the curry udon and regular udon.  I would have to say that my favorite rolls are the Spider, Dynamite, and Hawaii.  I was VERY disappointed by the Rainbow roll due to the inconsistency in the quality of the fish.  If I have to dip my sashimi pieces in wasabi soy sauce to augment the taste, there is something fishy.  I like my sushi / sashimi straight up -- the way the Japanese intended.  The wait staff is friendly and checks up on you at just the right intervals.  Decor goes with the theme of Kiki's delivery service anime. \n\n3 stars for the food\n4 stars for the service\n4 stars for the decor\n5 stars for value\n\nI've gone back a couple of times.  It's a great place to stop after work for a bite to eat on the way home.  But if they raised their prices, I'd reconsider.", "rating": 4, "date": "2012-01-17"}, {"excerpts": ["This place has BOMB chicken curry udon, and the sushi isn't too shabby either! ", "Love how the place looks with all the old school Japanese movie/cartoon posters around the place. ", "My and my girl try to go to this place every time we go to golden gate park because it is so good! ", "Will defiantly be coming here again!"], "author": "John C.", "review": "This place has BOMB chicken curry udon, and the sushi isn't too shabby either! Love how the place looks with all the old school Japanese movie/cartoon posters around the place. My and my girl try to go to this place every time we go to golden gate park because it is so good! Will defiantly be coming here again!", "rating": 5, "date": "2015-01-07"}, {"excerpts": ["This is only place I am able to find a curry udon noodle soup ", "and I love it.  ", "The price and portion is right.  "], "author": "Rama L.", "review": "Let's get this straight.  This isn't your high end Japanese restaurant.  This is a casual Japanese easy and economical eatery.  I do not expect nor compare this to the Japanese restaurant next store like ebisu.  \n\nHaving said that, we come from a family of 5 and what we look for is a fast, easy, and a place that the kids love.  The kids LOVES this place.  They practically beg to come here everything and you know how they are if we don't go there.  We'll definitely get an earful from them if they don't.  \n\nThe service is very pleasant.  The server has always been nice and attentive.  The food comes out quick which is very important for us with hungry impatient monkeys.  The food is again, not high quality but its enjoyable and consistent.  I'm a curry freak.  This is only place I am able to find a curry udon noodle soup and I love it.  The price and portion is right.  It definitely hits the spot for me when I am looking for a change outside of just Pho, beef noodle soup.  \n\nThis place is very consistent every time we visit this place.  This is our family favorite eatery in sunset.", "rating": 5, "date": "2014-04-04"}, {"excerpts": ["i came here on a cold night and got the curry udon topped with katshu chicken and fried onion ", "and wow it was really good!  ", "they also have different flavor udons and i will be back to try them."], "author": "Len L.", "review": "don't be fooled by the outside, this place is alot bigger inside!  this place is cheap and good.  i came here on a cold night and got the curry udon topped with katshu chicken and fried onion and wow it was really good!  they also have different flavor udons and i will be back to try them.", "rating": 4, "date": "2013-05-29"}], "wakame udon": [{"excerpts": ["I also get the wakame udon too!! ", "I used to get the veggie udon but they fill it with really bad vegetables that they use for their tempura fry. ", "Wakame udon is all good though.\n\n"], "author": "Stephanie W.", "review": "Kikis is an awesome place to do SAKE BOMBs!!! It's cheap sake bombs. $5.50 for a large sake bomb which will thoroughly eff you up. Well maybe not YOU. But definitely me. It definitely effs me up. Even a small sake bomb is a good deal. $3.50 for a regular sized beer and sake. The food..the fish...oh man..oh no...I never knew a fish could taste that fishy. I'm usually disappointed when I eat sushi there so that's a no go for me. The chicken teriyaki is delicious though. Juicy and nicely marinated. I also get the wakame udon too!! I used to get the veggie udon but they fill it with really bad vegetables that they use for their tempura fry. Wakame udon is all good though.\n\nKikis should be known as a bar first before it is known as a restaurant. Seems like all we do there is drink anyway. Don't forget your 15% coupon. It says not valid for happy hour promotions but we always use it on the happy hour sake bombs no problem. Kikis, you ain't bad even though your exterior is a little eccentric.", "rating": 4, "date": "2015-04-28"}], "lady gaga lunch": [], "edamame appetizer lunch": [], "piece gyoza appetizer lunch": [], "vegetable tempura apptizer lunch": [], "fried tofu appetizer lunch": [], "chicken karaage appetizer lunch": [], "piece ebi fry appetizer lunch": [], "soft shell crab appetizer lunch": [], "shrimp and vegetable tempura appetizer lunch": [], "fire cracker lunch": [], "beef teriyaki appetizer lunch": [], "chicken teriyaki appetizer lunch": [], "piece tuna sashimi appetizer lunch": [], "piece salmon sashimi appetizer lunch": [], "assorted sashimi appetizer lunch": [], "yellowtail sashimi appetizer": [], "lunch rice": [], "combination lunch": [], "plain udon lunch": [], "spicy miso udon lunch": [], "curry udon lunch": [], "wakame udon lunch": [], "lunch vegetable tempura": [], "lunch shrimp  veggie tempura": [], "lunch chicken karaage": [], "lunch tonkatsu": [], "lunch chicken teriyaki": [], "lunch beef teriyaki": [], "lunch salmon teriyaki": [], "lunch saba teriyaki entree": [], "lunch chicken katsu": [], "lunch sushi a": [], "lunch sushi b": [], "lunch sushi c": [], "lunch tuna sashimi": [], "lunch salmon sashimi": [], "lunch yellowtail sashimi": [], "lunch assorted sashimi": [], "shrimp  veggie tempura": [], "ebi fry": [], "salmon shioyaki": [{"excerpts": ["Salmon Shioyaki.  ", "It's about as hard to find in the city as an available, attractive, straight man who loves to shower me with gifts, flowers, trips to the islands and compliments.  ", "I found it here.  ", "The salmon shioyaki, dork, not the straight man.  \n\n"], "author": "Christina C.", "review": "Salmon Shioyaki.  It's about as hard to find in the city as an available, attractive, straight man who loves to shower me with gifts, flowers, trips to the islands and compliments.  I found it here.  The salmon shioyaki, dork, not the straight man.  \n\nI got the two item bento and it was incredibly filling and delicious.  The items were more plentiful than Ten.  The tempura was overwhelmingly delicious.  I think there is only 1 other place that may have more delicious tempura and I will dutifully report back when I have conclusive evidence.  The salad, though also drenched in dressing was more delicious.  There was more sesame flavor.  Since Miso soup did not come with it, I had to order it separately.  I do love me a good miso soup.  Bad miso soup will generally keep me away.  \n\nBecause I am a piggy and because I didn't expect that much tempura, I also ordered 1 order of Hamachi Nigiri.  It cost $3.19 and came with two pieces.  Not the most artful squeezed rice but the fish was acceptable.  A little too much rice, but the price reveals the quality of the sushi and for this price, the value was there.  \n\nThe tea was a bit weak.  \nThe seating was a touch cafeteria but that means they really captured the Asian lunch/dinner dining experience.  I will be back.  Bento-tastic.", "rating": 4, "date": "2009-08-20"}], "saba shioyaki": [{"excerpts": ["Tempura and saba shioyaki is what I usually get.  "], "author": "Vivian H.", "review": "Kiki's isn't the place for \"real\" sushi.  It's best for you want some really quick and cheap food.  This is when Kiki's comes into the picture, enticing you with many 15% off coupons on top of their already dirt cheap prices.\n\nI REALLY like their bentos.  Tempura and saba shioyaki is what I usually get.  They make the tempura really tasty and it always comes out piping hot.\n\nSometimes I am in the mood for rolls, and Kiki offers some simple ones that aren't drenched in sauce.\n\nJust don't get anything with raw fish.  It isn't great.\n\nThey also offer strange things like snowballs (fried cream cheese??) and firecracker (fried salmon skin) that I've tried and did not like at all.\n\nThis place definitely offers the best bang for your buck.\n\nWow, I have actually eaten here at least 17 times at the time of writing this review.. now I'm a little embarrassed.", "rating": 3, "date": "2011-12-21"}, {"excerpts": ["I got the lunch combo with saba shioyaki and albacore tuna sashimi.  ", "I can't tell you if this place is an authentic Japanese owned restaurant or not. ", "My saba came upside down on the lunch tray.  ", "And what strangest presentation on the albacore tuna sashimi?  ", "Oh wait", ", I think these are a pre-cut slices used for sushi, just bunched up and put on the lunch tray as sashimi, as they are all shaped like they should go on sushi, but not a proper cut for sashimi. ", "Rice was just ok, definitely not high quality stuff. ", "Salad is the typical iceburg mix with mayo like dressing.  ", "Lemon for the saba, but no daikon radish.  ", "Sorry, I think I'll skip this joint and go elsewhere for some real Japanese food done the right way."], "author": "Yoshiko D.", "review": "Pretty disappointing. I guess if you are going for the bang for the bucks maybe it would be ok.  I got the lunch combo with saba shioyaki and albacore tuna sashimi.  I can't tell you if this place is an authentic Japanese owned restaurant or not. My saba came upside down on the lunch tray.  And what strangest presentation on the albacore tuna sashimi?  Oh wait, I think these are a pre-cut slices used for sushi, just bunched up and put on the lunch tray as sashimi, as they are all shaped like they should go on sushi, but not a proper cut for sashimi. Rice was just ok, definitely not high quality stuff. Salad is the typical iceburg mix with mayo like dressing.  Lemon for the saba, but no daikon radish.  Sorry, I think I'll skip this joint and go elsewhere for some real Japanese food done the right way.", "rating": 2, "date": "2014-12-26"}, {"excerpts": ["Our favs are Saba Shioyaki, seafood salad, Chicken Karagi, and Alaska roll to name a few. ", "The sashimi is consistently fresh. ", "There's usually a table right away. "], "author": "Katie L.", "review": "Kiki is always a good option for a quick and inexpensive Japanese meal. Our favs are Saba Shioyaki, seafood salad, Chicken Karagi, and Alaska roll to name a few. The sashimi is consistently fresh. There's usually a table right away. Only drawback is the limited parking, especially on the weekends. \n\nP.S. On occasions, you may be able to find a 15% off coupon on the back of Safeway receipts.", "rating": 4, "date": "2013-07-08"}], "dinner sushi a": [], "dinner sushi b": [], "dinner sushi c": [], "dinner tuna sashimi": [], "dinner salmon sashimi": [{"excerpts": ["I love getting the dinner salmon sashimi entree. ", "$12.99 for 14 large pieces of fresh salmon, rice, and a house salad? ", "Sounds like a winner to me. ", "I'm confused why they don't give ginger with salmon sashimi though, but they'll give it with an order of california rolls. "], "author": "Jenna H.", "review": "Authentic Japanese? No. Decent? Yes. Cheap? Fairly. Fast service? Usually.\n\nWhenever the family is craving Japanese we ALWAYS come here. The chicken karage here is probably the best I've had so far. Yes I realize it's not authentic, but sometimes you don't need it to be. \n\nI love getting the dinner salmon sashimi entree. $12.99 for 14 large pieces of fresh salmon, rice, and a house salad? Sounds like a winner to me. I'm confused why they don't give ginger with salmon sashimi though, but they'll give it with an order of california rolls. I ALWAYS find myself asking for ginger.\n\nI HATE parking in this area...\nStill I'll most definitely be back. Bring in their coupons for 15% off the total bill (usually on the back of safeway receipts)", "rating": 4, "date": "2013-10-16"}], "dinner yellowtail sashimi": [], "dinner assorted sashimi": [], "albacore nigiri": [], "crab salad nigiri": [], "tamago nigiri": [{"excerpts": ["I ordered veggie tempura, pumpkin maki, and tamago nigiri. ", "It was all okay. "], "author": "Alison A.", "review": "I do not recommend this place for sushi snobs.. Its good if you're craving japanese and dont want to spend a lot of money, though! But I must note that parking is horrible in this area.\n\nThe food I got was alright. Not great, but not terrible.\n\nI ordered veggie tempura, pumpkin maki, and tamago nigiri. It was all okay. They skimped on the seaweed for my maki though, because it started coming apart before I even touched them.\n\nI tried the crunchy snowball, and it wasn't bad but very cream-cheesy.\n\nThe interior was spacious and clean, with still shots from some of Hayao Miyazaki's films on the wall. (Anyone else a Totoro fan?) Service was a bit lacking, though.", "rating": 3, "date": "2011-02-25"}], "asparagus nigiri": [], "seaweed salad nigiri": [], "tofu nigiri": [], "broccoli nigiri": [], "sweet potato nigiri": [{"excerpts": ["i also tried a vegetable teriyaki donburi and a sweet potato nigiri. ", "the nigiri was pretty good. ", "i like sweet potatoes, so i might be biased. ", "the waiter kinda forgot my veg donburi, but i forgive him 'cause it was pretty busy when we were there. ", "the rice was good...covered in teriyaki sauce. ", "but the veggies were basically julienned sweet potato, pumpkin (i think), green beans, and a little bit of american broccoli. "], "author": "Veggie J.", "review": "so we were supposed to eat at Pacific Catch, but unfortunately the wait was half an hour. and we were hungry. so we decided to see what else there was to eat around this area. the first awesome thing about this place is the door and window. they're crooked!! nothing beats a crazy door and window, so we just HAD to go here.\n\nnext best thing: CRUNCY SNOWBALLS!!! these are basically a sushi rice roll with cream cheese in it, deep-fried and topped with a spicy sauce. sooooo good. i never had anything like it. being vegetarian, it's hard to get a wide variety of sushi. it's usually the same. but these crunchy snowballs, dude, i couldn't get enough of it. \n\ni also tried a vegetable teriyaki donburi and a sweet potato nigiri. the nigiri was pretty good. i like sweet potatoes, so i might be biased. the waiter kinda forgot my veg donburi, but i forgive him 'cause it was pretty busy when we were there. the rice was good...covered in teriyaki sauce. but the veggies were basically julienned sweet potato, pumpkin (i think), green beans, and a little bit of american broccoli. a wider range of veggies would be better, but this donburi thing wasn't too bad. \n\nso if you want to come here, get the crunchy snowball. 'cause it's off the heezy. i give this place 4 stars just 'cause i didn't exactly fall head over heels for this place. maybe i need to come again...but seriously, crazy door? that's just awesome.", "rating": 4, "date": "2008-03-02"}], "pumpkin nigiri": [], "shrimp nigiri": [], "spicy tako nigiri": [{"excerpts": ["We had the udon plus chicken teriyaki don combo for $9, the alaska roll (salmon and crabmeat) $5.60, the philly roll (salmon and cream cheese) $4.50, and a spicy tako nigiri $3.60. \n\n"], "author": "Lindt C.", "review": "No frills Japanese restaurant serving good portions at low prices. \n\nWe came here on a Saturday night dinner and were able to be seated quickly although it was crowded. \n\nWe had the udon plus chicken teriyaki don combo for $9, the alaska roll (salmon and crabmeat) $5.60, the philly roll (salmon and cream cheese) $4.50, and a spicy tako nigiri $3.60. \n\nAll were pretty decent except for the spicy tako which was shredded cooked octopus with some drips of spicy mayo. I had expected tako wasabi and so I didn't enjoy this nigiri at all. \n\nOverall, for the low price and quick service I wouldn't mind dining here again if I'm in the area.", "rating": 4, "date": "2018-02-03"}], "spicy tuna nigiri": [], "tobiko nigiri": [{"excerpts": ["Also got an order of tobiko nigiri and a spicy tuna hand roll. \n\n"], "author": "Savannah B.", "review": "I have been here twice, and both times I have had positive experiences. The food is really yummy and quite cheap. I have been to other sushi restaurants which were also cheap, and the  quality was not up to par. Kiki, on the other hand, is delicious! PLUS it's decorated with Studio Ghibli posters! I love that. =) \n\nThis time I got the Lady Gaga (unagi & tofu wrapped and tempura battered/fried topped with spicy sauce and tobiko). YUM. Also got an order of tobiko nigiri and a spicy tuna hand roll. \n\nWill definitely be making this a frequent lunch spot for myself.", "rating": 5, "date": "2017-09-21"}], "tuna nigiri": [{"excerpts": ["got seaweed salad, alaska roll, and tuna nigiri - and they were all right.   ", "i'd probably go here to order takeout than dine-in. ", "although this place is good for rather loud conversations.  ", "my loud college buddy ", "and i were yelling away exchanging our stories about the dating game... ", "that no one seemed to mind... so this place isn't too bad. ", ";)"], "author": "ally o.", "review": "this place was 'okay.' you get what you pay for. pretty cheap for sushi.  got the food fast, didn't have to wait long for really anything.  but the table was sticky and the place felt a bit dirty.  the food was good for what it was though. got seaweed salad, alaska roll, and tuna nigiri - and they were all right.   i'd probably go here to order takeout than dine-in. although this place is good for rather loud conversations.  my loud college buddy and i were yelling away exchanging our stories about the dating game... that no one seemed to mind... so this place isn't too bad. ;)", "rating": 3, "date": "2007-12-24"}], "garlic albacore nigiri": [], "yellowtail nigiri": [{"excerpts": ["The yellowtail nigiri was mushy and a little stringy. ", "The albacore was decent. ", "I feel a little bad for dishing out two stars, but it's true that I've experienced better."], "author": "Kristina L.", "review": "As the boyfriend was quick to point out, this is one of those places where you go if you want rolls or a bento, not raw fish. Thus, he got a couple rolls and some unagi. Unfortunately, I have a thing for nigiri, so I got some yellowtail and albacore, as well as futo maki. When I was a kid, my neighbor used to make futo maki for me, so I order it when I'm feeling nostalgic, and Kiki's futo maki hit the spot. The rolls my boyfriend ordered were not very good even though he seemed to enjoy the pink dragon roll, but I dislike rolls that are deep-fried and/or covered in cream sauce. The yellowtail nigiri was mushy and a little stringy. The albacore was decent. I feel a little bad for dishing out two stars, but it's true that I've experienced better.", "rating": 2, "date": "2010-06-21"}], "unagi nigiri": [], "ikura nigiri": [{"excerpts": ["Fuji in west portal, but the salmon sashimi is fresh and delicious, and so is the Ikura nigiri... and they have the BEST green tea... ", "it has a yummy nuttiness to it.  ", "I think the only thing Kiki really lacks is ambiance; They should dim the lights a little.  ", "But I heart heart heart ", "this place ", "bc it allows me to eat sushi much more often than I'd be able to afford to otherwise.  ", "My tummy is full of Kiki right now and feeling quite satisfied.  ", "Had to share especially after noticing how quiet it was in there tonight compared to the other sushi joints in the neighborhood... ", "I'm wondering if ppl are scared of the low prices or bright lights or what but go, ppl, go! ", ":)  ", "I want Kiki to stick around."], "author": "Michelle H.", "review": "I love Kiki!!  So good for the price.  I end up spending so much less here, and the sushi is fresh and delicious, the rolls are maybe not quite as tasty as they are at say Fuji in west portal, but the salmon sashimi is fresh and delicious, and so is the Ikura nigiri... and they have the BEST green tea... it has a yummy nuttiness to it.  I think the only thing Kiki really lacks is ambiance; They should dim the lights a little.  But I heart heart heart this place bc it allows me to eat sushi much more often than I'd be able to afford to otherwise.  My tummy is full of Kiki right now and feeling quite satisfied.  Had to share especially after noticing how quiet it was in there tonight compared to the other sushi joints in the neighborhood... I'm wondering if ppl are scared of the low prices or bright lights or what but go, ppl, go! :)  I want Kiki to stick around.", "rating": 4, "date": "2011-07-15"}, {"excerpts": ["I don't think I would order things like ikura nigiri for fear that it wouldn't be as fresh as, say, Ebisu up the street. ", "But the maki rolls are satisfying, and you really can't beat the prices...under $7 for a Rainbow Roll??? "], "author": "B. Earl K.", "review": "Having recently moved to the neighborhood around Irving and 9th, the first thing I knew about this area was the abundance of good eateries.\n\nOn my way back from jogging in the park the other day, I walked into Kiki to grab a take-out menu. The first maki roll item that jumped out at me was the \"Mexican Roll\". Looking further down the menu, I spotted the \"Pink Dragon Roll\". And I thought to myself...\"Waaaiiiit a minute...I've seen these items on a menu before. But I've never been IN this place.\"\n\nThen it occurred to me...KITARO out on Geary! (The waiter at the register quickly confirmed the sister status of these two restaurants.)\n\nSeveral years ago, when I didn't live all the way on the east side of the city (which, of course, I no longer do), I used to order takeout from Kitaro on a regular basis. And the Mexican and Pink Dragon Rolls were steady faves.\n\nI just ordered the Pink Dragon Roll this past weekend when I went to Kiki with my brother. But, this time, I was offered the choice of having the salmon cooked or uncooked on top, something that I had never considered when going to Kitaro (and I also asked that it made without that obscure mayo-type cream sauce that they run across the top with Christmas-colored sprinkles). I opted for the uncooked, and the end result was much like the \"Salmon Tsutsumi Roll\" at one of my favorite won't-break-the-bank sushi places in SF: I Luv Teriyaki & Sushi on Potrero Ave. But the Pink Dragon doesn't have the slivers of avocado between the salmon pieces, as the Salmon Tsutsumi does. Bummer.\n\nThe Mexican Roll (shrimp tempura within a roll, with chili powder) didn't have as much chili powder on it as I recall from past visits to Kitaro. But it was still pretty tasty.\n\nWe also ordered a couple of deep-fried rolls (the Godzilla and the Dynamite). Both were decent.\n\nI don't think I would order things like ikura nigiri for fear that it wouldn't be as fresh as, say, Ebisu up the street. But the maki rolls are satisfying, and you really can't beat the prices...under $7 for a Rainbow Roll??? Try to find that price at another sushi place in the city.\n\nThis review may seem like it's all over the map (it's my first one!), but I'd have to say that, all in all, Kiki was a nice walk down \"low-cost sushi memory lane\" for me and my bro. For the record, that's not a walk a like to make very often.\n\n3 stars because, as sushi places go, I would give only the absolute best of the best places 5 stars, and there are many 4-star places in the city that come to mind as simply a better overall experience than Kiki/Kitaro. This place is decent nonetheless...", "rating": 3, "date": "2007-03-20"}], "crab salad roll": [], "albacore roll": [], "tamago roll": [], "green beans roll": [], "eggplant roll": [], "asparagus roll": [], "pumpkin roll": [{"excerpts": ["I especially like the veggie rolls (pumpkin roll, don't knock it till you try it!). ", "Salmon rolls are also great as are the bento boxes. ", "Efficient service, nothing special there. ", "Give it a try, maybe for lunch or an appetizer if you are skeptical."], "author": "Karen J.", "review": "Fresh, simple, casual and a bargain! I especially like the veggie rolls (pumpkin roll, don't knock it till you try it!). Salmon rolls are also great as are the bento boxes. Efficient service, nothing special there. Give it a try, maybe for lunch or an appetizer if you are skeptical.", "rating": 4, "date": "2012-11-11"}], "seaweed salad roll": [], "tobiko roll": [], "spicy tako roll": [], "negihama roll": [], "unakyu roll": [], "kiki roll": [{"excerpts": ["I've had the Kiki Roll, San Francisco Roll, California Roll, and other various rolls.\n\n"], "author": "Diana V.", "review": "This is a cheap sushi restaurant that my friend, who lives in the neighborhood, introduced me to a while ago.\n\nWe get together and have a \"kiki\" at Kiki (pop culture reference circa 2012 anyone? : ) \n\nI like the fact that we can hang out and chit chat and not get shooed out since this is a casual spot.\n\nI've had the Kiki Roll, San Francisco Roll, California Roll, and other various rolls.\n\nThe quality of the rolls is okay for the price. If you understand that you get what you pay for. It's basically on the *opposite* end of the price point and quality of Ebisu or Koo, but it's still good.\n\nEdamame is okay as well, although it can be a bit over-steamed.\n\nThis place is always on my list for a cheap bite to eat.", "rating": 3, "date": "2017-11-30"}, {"excerpts": ["Favorites include Kiki roll and Mexican roll."], "author": "Kelly N.", "review": "Favorite sushi in the neighborhood - and at a super reasonable price. Favorites include Kiki roll and Mexican roll.", "rating": 5, "date": "2017-07-20"}, {"excerpts": ["Crunchy snowball and the kiki roll. \n\n", "The kiki roll was okay. \n", "I really like the udon though. "], "author": "Chelsea C.", "review": "I got my money's worth.\nI ordered the udon with salmon sashimi donburi.\nCrunchy snowball and the kiki roll. \n\nThe crunchy snowball was really good!\nThe kiki roll was okay. \nI really like the udon though. It is not as salty as other places though. \n\nI also ordered tea...Costco's green tea. -_-\"\n\nThe service was good.", "rating": 4, "date": "2011-12-17"}, {"excerpts": ["I ordered Pink Dragon Rolls and a Kiki Roll (Chicken Teriyaki and Avocado Roll). "], "author": "Stephanie W.", "review": "Meh. I don't think I ordered the right things. I ordered Pink Dragon Rolls and a Kiki Roll (Chicken Teriyaki and Avocado Roll). The salmon on my Pink Dragon Roll was good, but the mayo-like sauce was NOT very good. One because I am not a fan of mayo, and two, I am definetly not a fan of mayo on my sushi. And the chicken and avocado roll was well just that - nothing extraordinary. So maybe...I just didn't order the right things. \n\nSigh. They did have a lot of tables and what not. So I am sure it was just me.", "rating": 3, "date": "2009-09-08"}, {"excerpts": ["California roll and Kiki roll."], "author": "H S.", "review": "Nice restaurant .Nice price.But I think that's not Japanese's .Maybe Chinese Waitress or waiter.I can see them. They are different .no problem. I like their  California roll and Kiki roll.", "rating": 3, "date": "2013-07-25"}, {"excerpts": ["We ordered the crunchy snowballs, gyoza,kiki roll, mexican roll and tempura roll. ", "When the snowballs came out I was like, WTF?! ", "They looked like the kids of the adult balls we used to get! ", "Then came then came the gyoza. ", "They tasted like the ones you get in the freezer ", "that's pre-fried and cooked! ", "All squishy but no crunch! ", "The sushi tasted warm and not fresh, like it had been sitting there for a bit!  ", "They put some new spice in the tempura roll that made my mouth taste like black licorice! ", "Yucko! ", "The reason behind the 2 stars? ", "It was cheap, $20.88 total. ", "On a lighter note, the tea was good...."], "author": "Connie T.", "review": "Just finished eating at Kiki's and I have to say I was very dissappointed. I used to go here all the time when I lived around the corner and they always tasted great. When my man suggest we go I was totally down. We go in and we are immeadiatly sat down. We ordered the crunchy snowballs, gyoza,kiki roll, mexican roll and tempura roll. When the snowballs came out I was like, WTF?! They looked like the kids of the adult balls we used to get! Then came then came the gyoza. They tasted like the ones you get in the freezer that's pre-fried and cooked! All squishy but no crunch! The sushi tasted warm and not fresh, like it had been sitting there for a bit!  They put some new spice in the tempura roll that made my mouth taste like black licorice! Yucko! The reason behind the 2 stars? It was cheap, $20.88 total. On a lighter note, the tea was good....", "rating": 1, "date": "2011-07-24"}, {"excerpts": ["My friend and I  ordered the pink dragon roll (crab w/ avocado with cooked salmon on top), kiki roll (chicken teriyaki w/ avocado), dynamite roll (tuna tempura w/ wasabi mayo), crunchy snow ball (tempura cream cheese w/ spicy sauce) and salmon, and tuna sashimi. ", "The fish didn't taste fresh. ", "It was close to spongy rather than buttery. ", "Granted I liked the different ideas they had, but in the end I wasn't impressed. "], "author": "Lola L.", "review": "A friend recommended this place I thought to give it a try. The place was pretty busy so I took this as a good sign. \n\nMy friend and I  ordered the pink dragon roll (crab w/ avocado with cooked salmon on top), kiki roll (chicken teriyaki w/ avocado), dynamite roll (tuna tempura w/ wasabi mayo), crunchy snow ball (tempura cream cheese w/ spicy sauce) and salmon, and tuna sashimi. The fish didn't taste fresh. It was close to spongy rather than buttery. Granted I liked the different ideas they had, but in the end I wasn't impressed. Oh and it didn't help that the cooked salmon burnt my tounge.\n\nThe prices are cheap so I guess you get what you paid for. There are no windows except for the ones on the roof so when eating here at night on an overcast day (like tonight) you have nothing but artificial lighting. I guess this can make the food look better? Opening this place next to Ebisu was a poor decision. The service is friendly but a little on the slow side.", "rating": 2, "date": "2008-07-30"}, {"excerpts": ["Next time I will go with the Kiki roll or something not fried. ", "All in all, it was a satisfying meal. ", "I didn't have any leftovers of my box \"b\" special (I usually do from Noreiga Teriyaki) ", "but I think for a quick, cheap eat it's worth it. ", "Save your Safeway receipts for those coupons!"], "author": "Bub B.", "review": "I've been wanting to try this place for awhile since on the back of most of my Safeway receipts there's a 15% off coupon. So I tried it today. It was really really busy, there was huge party. However, the service wasn't too bad! The waiter and waitress were very attentive and did not forget to bring us anything we asked for (water, chopsticks, etc) The food was ok, it reminds me of Noriega Teriyaki, but lesser portions/bit cheaper. It didn't come with miso soup either, but I enjoyed what little portion I had of the salad. I also tried some of the crunch snow ball. It was pretty good, but probably very unhealthy. Next time I will go with the Kiki roll or something not fried. All in all, it was a satisfying meal. I didn't have any leftovers of my box \"b\" special (I usually do from Noreiga Teriyaki) but I think for a quick, cheap eat it's worth it. Save your Safeway receipts for those coupons!", "rating": 3, "date": "2009-08-15"}], "rock n roll": [{"excerpts": ["we ordered the seafood salad and two rolls; rock n roll and tiger roll. ", "both seemed to have the same sauce which really disappointed me. ", "the rock n roll sushi roll was rolled messily and things were falling apart while i ate it. ", "the tiger roll was pretty good, a little bit on the salty side but not worth it for the price of $10 (there was only 4 small pieces of eel) ", "the seafood salad was way too salty with not enough sauce. ", "our total bill we $20."], "author": "Annie H.", "review": "I came here with high expectations because some friends of mine recommended this place to eat, but i was disappointed. their menu was all over the place and hard to navigate, some items were unclear of what was inside. we ordered the seafood salad and two rolls; rock n roll and tiger roll. both seemed to have the same sauce which really disappointed me. the rock n roll sushi roll was rolled messily and things were falling apart while i ate it. the tiger roll was pretty good, a little bit on the salty side but not worth it for the price of $10 (there was only 4 small pieces of eel) the seafood salad was way too salty with not enough sauce. our total bill we $20.", "rating": 3, "date": "2017-09-10"}, {"excerpts": ["and the rock n roll ", "(eel + avo), which is on the combo dinner menu too! "], "author": "Tara A.", "review": "Kiki Japanese Restaurant is always a great choice when you're craving sushi, but don't want to break the bank. I've been coming here since high school, whether it's with friends or family.\n\nSashimi is really good quality for the price. The salmon and the yellowtail are favorites of mine! The salmon is always really buttery and the pieces are a good size. The sashimi dinners (14 pieces + salad and rice for ~$14) are a great deal. You also get a lot of bang for your buck with the combination dinners, because you get 2 items of your choice, and you can choose between a large variety of items including things like 7 piece sashimi, 6 piece rolls, or even heartier options like chicken karage, tempura, or tonkatsu. The chicken karage is really good, freshly fried and super hot when it comes out! The sriacha mayo that comes with it is good and not too spicy, or you can ask for teriyaki sauce on the side. They also have a bunch of cheap rolls. I like the alaska roll (yay, more salmon!) and the rock n roll (eel + avo), which is on the combo dinner menu too! Usually I can get 2 and it fills me up for lunch or dinner!\n\nThey have a bunch of new items on the menu that aren't included in the online menu. I really liked the curry udon with chicken katsu ($7). The udon was really soft and the broth was perfect!! I also got to try the lady gaga roll (4 piece, $3), which was pretty tasty.\n\nKiki's has a great happy hour now (every day, from 3-9pm), where you can get a large beer and a large sake for $5.50. Great deal!!! My parents love coming here for that and I can't wait to bring my friends here for happy hour too. \n\nService is usually very friendly, but sometimes they are understaffed. The place does get crowded around 6:30 pm for weekend dinners so try to go earlier than that!\n\nAnd be sure to save those safeway receipts! There's a 15% coupon on the back for kiki's! I think you can go on their website and get coupons too.", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["Alaska roll and the Rock n Roll both had too much rice in it. ", "Everything here was just whatever.. ", "To be honest, I would've ordered from some place else.."], "author": "Michelle L.", "review": "We ordered Kiki's through ubereats and it was a little bit disappointing. We ordered the beef teriyaki dinner which was bland and small portioned. Alaska roll and the Rock n Roll both had too much rice in it. Everything here was just whatever.. To be honest, I would've ordered from some place else..", "rating": 3, "date": "2016-08-23"}, {"excerpts": ["I got the two item bento box (with the ROCK N ROLL, Chicken Katsu, rice and salad) ", "You get to pick any two items from the menu and the price is added together. "], "author": "Jeanette Q.", "review": "Went here yesterday for dinner with a few friends. The sushi here is pretty cheap compared to other places. We were lucky to be able to find parking right in front of the place. We thought the front of the place was cute with the slanted door, looked pretty small from the outside but the inside is pretty spacious. I got the two item bento box (with the ROCK N ROLL, Chicken Katsu, rice and salad) You get to pick any two items from the menu and the price is added together. One of my friends got the curry chicken udon, one got the pink dragon roll, and another got two sushi rolls. It was pretty good, we all enjoyed our food. It wasn't the best though. You can also ask them for any sauces that you may want for your sushi and stuff. One of my friends asked them for a siracha-mayo sauce and they gave it to her. Its pretty good with the sushi. \n\nIts pretty cool, how they name their rolls after other things like the, \"Lady Gaga Roll\", the \"49ers Roll\", and etc. What sucks about this place is that they don't have tea that's included for free like most Japanese sushi places.", "rating": 4, "date": "2013-06-16"}, {"excerpts": ["We ordered some fried tofu, veggie croquettes, the rock n roll, for appetizers. ", "I ordered the Sashimi lunch that which came with rice and a salad. ", "Amanda ordered the udon which came with a small sashimi lunch for only $8!! "], "author": "Andrea L.", "review": "After enduring a grueling hike around golden gate park my bestie and I decided to try this little gem.\n\nWe walked in and were seated right away. Their menu is fairly cheap and reasonable. The two of us ate more than our share for only $30, which is rare in SF nowadays. We ordered some fried tofu, veggie croquettes, the rock n roll, for appetizers. I ordered the Sashimi lunch that which came with rice and a salad. Amanda ordered the udon which came with a small sashimi lunch for only $8!! What a deal! \n\nService was awesome definitely coming back because this place is the bee's knees.", "rating": 5, "date": "2015-03-23"}, {"excerpts": [".. i would stay away\n-the shrimp and vegetable tempura (3 shrimp pieces) was quite deep fried, but stale\n-the 49er roll was good, and the rock n roll was good. "], "author": "simon k.", "review": "What an interesting door on an interesting street, with the most..dull food. I suppose if you enjoy savin a buck or two on japanese food, kiki's would be a good restaurant to go to. My girlfriend and I came here on a mundane monday, defying the legion of yelp reviews on how this place was no good for the japanese restaurant go-er. I guess.. the yelp reviews were accurate afterall. This place is 3 star material. \n\nwalkin in, I am hit with the orange colored walls, decorated with mizayake film posters of totoro, spirited away, and princess mononoke. Aside from the beautiful posters, the restaurant lack.. decor. I felt as though I was at a shopping mall plaza.. you know that feeling you get when u are eating at a food court?.. that's how it felt like. I think it is because of the wild orange colored walls and the lack of japanese-esque decorations. I truly believe that a restaurant experience is not only in the food and service, but in the knicks and knacks of the store as well; a restaurant is nothing without the unique tastes of the owner. Without style.. there is not much of a restaurant to enjoy.. aside from the food.\n\nthe food was OK. My girlfriend and I both had the bento box. I had the chicken karaage and vegetable tempura. My girlfriend had the chicken teriyaki and the rock-n-roll. The bento boxes each came with a side salad, rice, and sauce. On the side, we also got the 49er roll. \n-the chicken teriyaki was decent, i would recommend if you must come here\n-the chicken karaage was way too dry, and way too deep fried.. i would stay away\n-the shrimp and vegetable tempura (3 shrimp pieces) was quite deep fried, but stale\n-the 49er roll was good, and the rock n roll was good. 3 and a 1/2 stars for the rolls.\n\n-wifive-", "rating": 3, "date": "2011-02-08"}, {"excerpts": ["My favs are rock n roll, spider roll, dynamite and rainbow roll.\n\n"], "author": "Sharon G.", "review": "If your're on a tight budget but craving for sushi, go to Kiki's! You can get decent sushi for pretty low prices. My favs are rock n roll, spider roll, dynamite and rainbow roll.\n\nYum!", "rating": 2, "date": "2010-01-22"}, {"excerpts": ["- philadelphia roll ( if u like cream cheese.. it may be a bit cheesy for some)\n- rock n roll ( avacado & eel yumm!)\n", "- rainbow roll\n"], "author": "Shirley A.", "review": "Being that kikis had seem to have the same menu as kitaro ( a jap resteraunt on geary and 22nd), I presumed that the sushi here would not be as good. Surely I was terribly wrong!\n\nI came here with a group of 5 on a Friday evening, no wait, resteraunt was half full. As we walked in, it reminded me more of a cafe, much less of a japanese resteraunt. Sushi rolls were cheaper than average however the variety of the special rolls were limited.\n\nSince my bad experience for fresh fish at kitaro ( I ordered the sashimi dinner and the fish didn't seem fresh) , I thought sashimi here would be similar.. I was terribly wrong! We had the yellow tail (hamachi) & salmon (sake) and it was very fresh & delicious!\n\nRolls we had in which I definitely recommend..\n- kamakazii roll !! \n- philadelphia roll ( if u like cream cheese.. it may be a bit cheesy for some)\n- rock n roll ( avacado & eel yumm!)\n- rainbow roll\n- spider roll\n\n \nIf you're looking for a fancy place with nice decor and ambiance with special crazy rolls, maybe try somewhere else. I liked it here and won't mind comin back to fulfill my sushi cravings... delicious sushi for the very fair price you pay for! Our server this evening was nice & attentive too. \n\n8rolls...one plate of yellow tail sashimi.. one plate of salmon sashimi... beef udon.. & eel donburi for roughly $80 for five people.. defintely a steal!:)", "rating": 4, "date": "2010-08-21"}], "hawaii roll": [{"excerpts": ["(4) HAWAII ROLL, $4.75: tuna and avocado sushi roll! ", "Delish!\n", "(5) PHILADELPHIA ROLL, $3.80: salmon & cream cheese! ", "I haven't had this for such a long time... ", "I forgot how philadelphia roll tasted like! ", "But, so good!\n"], "author": "Mindy Y.", "review": "EVENT: after 4 hours of studying in the library... really need a drink... where do we gooo??? Happy hour at Kiki's anyone? From 3pm-9pm!!! A must gooo! Cheap sake bombs... everything cheap! I love it!\n\nPARKING: yeps... difficult to find parking... but! HEY! You might be lucky! \n\nSERVICE: Love the service... very friendly  service... especially when your group of friends are loud! Eks!!! You know... those sake bombs... killer!\n\nI'm going to start with drink... causeeee it so good and cheap!\n\nDRINKS: \n(1) Sake bombs - must a LARGE!!!! I can share it with 3 of my friends! Only $6!!! WOOTS!\n(2) Guava Soju - delish!!! $7 Def came in a huge bottle!\n\nFOOD:\n(1) 49ER'S ROLL, $5.10: delish spicy tuna and crab with avocado and tobiko! \n(2) KAMIKAZE ROLL, $5.10: yellowtail, crab, avocado & tobiko! This is one my favorites!!! \n(3) MEXICAN ROLL, $4.75: shrimp tempura & avocado. My other favorite!\n(4) HAWAII ROLL, $4.75: tuna and avocado sushi roll! Delish!\n(5) PHILADELPHIA ROLL, $3.80: salmon & cream cheese! I haven't had this for such a long time... I forgot how philadelphia roll tasted like! But, so good!\n(6) SAN FRANCISCO ROLL, $3.95: salmon salad, avocado & tobiko\n\n**MUST GET: LARGE SAKE BOMBS! Seriously... no joke! $6!!!", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["My favorites are kamikaze roll, Hawaii roll, Philadelphia roll. ", "The only complaint I have that they need to come up with some new rolls. ", "I am getting bored with everything now. ", "Kiki sushi chef PLEASE COME UP With NEW ROLLS. ", "Kitaro used to have a spicy California roll with wasabi tobiko on top and it was great. ", "Wish they would bring it back. ", "Looking forward to new things"], "author": "Tatyana M.", "review": "I've been a royal Kiki customer since they opened and before that their first restaurant Kitaro since 1996. It's pretty good for the price. My favorites are kamikaze roll, Hawaii roll, Philadelphia roll. The only complaint I have that they need to come up with some new rolls. I am getting bored with everything now. Kiki sushi chef PLEASE COME UP With NEW ROLLS. Kitaro used to have a spicy California roll with wasabi tobiko on top and it was great. Wish they would bring it back. Looking forward to new things", "rating": 5, "date": "2016-07-05"}, {"excerpts": ["I ordered the Udon combo with tuna bowl and a Hawaii Roll (tuna and avocado).  ", "While it is fairly cheap, there are reasons for that.  "], "author": "Anthony I.", "review": "Heard about Kiki's from a friend who said it's a cheap Japanese restaurant that I should check out for a yelp review.  I ordered the Udon combo with tuna bowl and a Hawaii Roll (tuna and avocado).  While it is fairly cheap, there are reasons for that.  One needs a keen eye to watch for ways they can be deceptive in the things they do in order to keep a low cost.\n\nService:  Pretty bad.  Not once were we asked how was our meal or asked if we needed a water refill.  The only time we even seen our waiter was when we ordered our food, and when he brought it to the table.  It's pretty bad when you have to flag down your waiter to get your check because they never even seemed to serve us in the first place.  1 star\n\nQuality:  I wasn't expecting much in the first place due to the price and I sure was right.  I noticed that they give you a very large bowl filled with a lot of bland broth but hardly any udon noodles.  In fact, it tasted exactly like the instant udon noodles I buy at the Japanese market!  The tuna bowl had a lot of sushi rice, but had small, skinny  slices of tuna that looked more like shabu shabu meat than sashimi.  On top of that the tuna was not fresh.  It was very dry and chewy.  The sushi roll had very little tuna and rice, but was filled mainly with avocado.  1 star\n\nPrice:  It's cheap sure.  But, with what you're given, to be charged any more would be an outrage.  I think a lot of people don't see through the little tricks that are pulled, (Big bowl with tons of broth and hardly any noodles.  Or the tiny slices of tuna covering the rice) but I can see right through that.   2 stars\n\nLook if you were only given $10 then I suppose this is the only place you could go to.  But do yourself a favor and pay a little more for a better Japanese restaurant experience.  Unfortunately for me, I have yet to find a good Japanese restaurant for the right price", "rating": 2, "date": "2013-04-21"}, {"excerpts": ["I got the 49er roll and Hawaii roll, finished eating it all by myself in 5 minutes. ", "I was hungry and this sushi hit the spot. ", "The service was quick and the restaurant is pretty big but not very busy. ", "There's so much more competition nearby, but they are pricier options."], "author": "Stephanie L.", "review": "Sure, it's not the best sushi I've had, but it is best for the price! I got the 49er roll and Hawaii roll, finished eating it all by myself in 5 minutes. I was hungry and this sushi hit the spot. The service was quick and the restaurant is pretty big but not very busy. There's so much more competition nearby, but they are pricier options.", "rating": 4, "date": "2011-07-26"}, {"excerpts": ["Wanted some tuna, so I got the Hawaii roll, which was just tuna and avocado, and then some salmon nigiri... which I really (oddly) loved because it tasted really fresh. "], "author": "Caroline L.", "review": "I thought it was okay, especially for the price. Ebisu was clearly more busy, and it was what I was craving, but I was too hungry to wait or even care... and damn, I'm trying not to spend a lot of money on food, you know? The place was filled with people on dates, quadruple dates, and people getting off work... and then, there were me and my two friends that were craving sushi like mad. \n\nAnyway... I ordered myself the Tiger Roll, which I thought was good except I think it could have used at least some form of vegetable in it... I basically just had a whole lot of meat in my mouth (... that's what she said). Wanted some tuna, so I got the Hawaii roll, which was just tuna and avocado, and then some salmon nigiri... which I really (oddly) loved because it tasted really fresh. Really!\n\nThe service was great, except that the lady never asked me if I wanted another pot of tea. I don't really think I'll come here ever again though, unless someone suggests it.", "rating": 3, "date": "2008-07-29"}, {"excerpts": ["My favorites are the alaska roll, 49er roll, spicy tuna roll and Hawaii roll to name a few.  ", "The lunch time prices are a little cheaper than the dinner time and the menu is a tad different during the dinner hours.  ", "The staff is really nice and the atmosphere in this restaurant is good as well.  ", "Just thinking about this place makes me hungry for sushi."], "author": "Jesse C.", "review": "My girlfriend and I used to frequent this place when we lived in the sunset.  Yeah we know its not the best sushi but for the price and atmosphere of the place, its really good.  We've tried the bento box with teriyaki chicken, various rolls, the miso soup, crunchy snowball etc.  Oh and the salad!  Love the salad, the miso dressing is awesome.  My favorites are the alaska roll, 49er roll, spicy tuna roll and Hawaii roll to name a few.  The lunch time prices are a little cheaper than the dinner time and the menu is a tad different during the dinner hours.  The staff is really nice and the atmosphere in this restaurant is good as well.  Just thinking about this place makes me hungry for sushi.", "rating": 5, "date": "2011-03-21"}], "spicy chicken roll": [{"excerpts": ["The Spicy Chicken Roll wasn't that great either.  ", "None of the rolls really had any flavor.  ", "No reason to ever come back."], "author": "Steven B.", "review": "Went here before the Bris.  Table was sticky.  The Pink Dragon Roll was gross.  I don't like cooked salmon, and the entire roll was hot, including the mayo.  The Spicy Chicken Roll wasn't that great either.  None of the rolls really had any flavor.  No reason to ever come back.", "rating": 1, "date": "2014-06-30"}, {"excerpts": ["I always grab a spicy chicken roll (chicken kara-age, lettuce and spicy sauce), a tempura roll (tempura shrimp, lettuce and not-spicy sauce) and if I'm real hungry maybe tekka maki or something small. ", "It usually winds up being 8-11 bucks which is a fantastic price. ", "Special rolls that are $6 at most Japanese restaurants are $4 here. "], "author": "Kyle K.", "review": "I think I've been here about 6 times in the past month. As the N approached the 9th and Irving stop I find myself pondering if I REALLY need to grab more take-out for here even though I already did two days before. The answer if usually yes so I leap out the doors right before they close and happily march my way towards towards the place with the tilted window. \n\nI like the fact that it's much more casual feeling than the average Japanese restaurant. The green may not be the best choice in the world, but you gotta love a place that has framed pictures of MIyazaki movies all over. \n\nI always grab a spicy chicken roll (chicken kara-age, lettuce and spicy sauce), a tempura roll (tempura shrimp, lettuce and not-spicy sauce) and if I'm real hungry maybe tekka maki or something small. It usually winds up being 8-11 bucks which is a fantastic price. Special rolls that are $6 at most Japanese restaurants are $4 here. There is a very slight decline in the quality of the rolls in that they tend to easily fall apart, but they taste just as good so it doesn't matter. \n\nCheap sushi, quick take-out (10 min wait), Miyazaki.\n\nThey have a \"Bring this receipt back in for 10% off!\" thing on the bottom of all their receipts, which is nice.", "rating": 4, "date": "2009-10-21"}, {"excerpts": ["I like it though because they offer the spicy chicken roll and the crunchy snowball roll.  ", "Those are my favorite rolls!  ", "I usually get the combination box with chicken karrage and vegetable tempura.  ", "I substituted the vegetables with all broccoli because I do not like the other vegetables.  ", "Yum!  ", "I got like 7 broccoli for only a .50 cent charge. ", ":) ", "Good stuff.  ", "I like this place better than Kitaro just because it is less crowded and the tables are bigger."], "author": "Victor L.", "review": "This place is good if you want cheap sushi, that tastes average.  This place is nothing special, but will satisfy your sushi needs.  I like it though because they offer the spicy chicken roll and the crunchy snowball roll.  Those are my favorite rolls!  I usually get the combination box with chicken karrage and vegetable tempura.  I substituted the vegetables with all broccoli because I do not like the other vegetables.  Yum!  I got like 7 broccoli for only a .50 cent charge. :) Good stuff.  I like this place better than Kitaro just because it is less crowded and the tables are bigger.", "rating": 4, "date": "2012-01-10"}, {"excerpts": ["My man got the spicy chicken roll and the SF roll. ", "He looked pleased and ate both in under a minute. ", "Not that they were tiny or anything, he was just really hungry "], "author": "Amanda C.", "review": "Three stars for the sushi and an additional one for all the cute art!    Miyazaki fans oughta come here for the cute references to films and poor folks oughta come here for decent prices. Totally perfect for a cheap-ass Totoro fan such as myself. \n\nI've ordered the udon, tempura, and a couple of rolls. I don't eat seafood but there were quite a few rolls to choose from other than the typical avocado or cucumber. They had pumpkin, asparagus, mushroom and some others that sounded tasty. Tonight I tried the \"Irish Roll\"- a bunch of avocado, veggies and rice with a sesame dressing- totally my thing.\n\nMy man got the spicy chicken roll and the SF roll. He looked pleased and ate both in under a minute. Not that they were tiny or anything, he was just really hungry and I guess it hit the spot.\n\nRED UMBRELLA", "rating": 4, "date": "2009-09-23"}, {"excerpts": ["but the spicy chicken roll is fantastic. ", "as is the gyoza, if not a bit small. ", "all for $7? ", "yep. "], "author": "shane r.", "review": "first off, this is my new favorite restaurant in the city. the ambiance is silly, with pictures of anime along with tilted windows and doorways. but the spicy chicken roll is fantastic. as is the gyoza, if not a bit small. all for $7? yep. i'm coming back.\n\ncheap and pretty good. i'm coming back.", "rating": 4, "date": "2009-05-24"}], "irish roll": [{"excerpts": ["Kiki gets a plus for the large vegetarian selection -- ordered the Irish roll which was good, but I couldn't get over the strangely bright green whatever they sprinkled on top.   ", "Rolls weren't cut too evenly either, ", "but hey, you don't come here for presentation.  ", "The Mexican roll made me happy with the globs of guacamole on top.  ", "I also really liked the tempura cream cheese sushi with sriracha...", "I don't know the name but made me think that it would fit right in with all the deep-fried twinkies and hot dogs I imagine at the county fair (which is a cultural experience I am still missing out on).  ", "I was disappointed by the edamame...they were plain, small, a bit soggy, and just uninspiring.  ", "I like them a little cold, crisp, and lightly salted..."], "author": "Leneve O.", "review": "Ah, don't want to repeat what everyone's said about prices and such.  I was pleasantly surprised they could accommodate our group of 12 and with decently fast service.\n\nKiki gets a plus for the large vegetarian selection -- ordered the Irish roll which was good, but I couldn't get over the strangely bright green whatever they sprinkled on top.   Rolls weren't cut too evenly either, but hey, you don't come here for presentation.  The Mexican roll made me happy with the globs of guacamole on top.  I also really liked the tempura cream cheese sushi with sriracha...I don't know the name but made me think that it would fit right in with all the deep-fried twinkies and hot dogs I imagine at the county fair (which is a cultural experience I am still missing out on).  I was disappointed by the edamame...they were plain, small, a bit soggy, and just uninspiring.  I like them a little cold, crisp, and lightly salted...but I'm no expert, and definitely spoiled by the amazing edamame at Blowfish.\n\nLooking around the table, everyone seemed satisfied.  If I could I'd rate this with 3.5 stars, but for not being a place I'd go out of my way for I'll default lower.  The hungry boys were actually full (yes, with sushi), and either way there's nothing like good company, sake, and sapporo.  Then part 2 of our evening revelry... ^.^", "rating": 3, "date": "2009-07-19"}], "pink dragon roll": [{"excerpts": ["We ordered the Pink Dragon Roll, fried tofu, and the fried pork with udon.\n\n", "The Pink Dragon roll's scalding hot rice, which is capped off with a piece of flat and lifeless fish that appears to have recently left its months-long hibernation in its vacuum-sealed cocoon, will make you squirm and retch. ", "It has little to no taste and is covered in a sickly watery orange mayonnaise that neither adds dignity nor taste. ", "My girlfriend had to vomit directly afterward and that is not hyperbole. "], "author": "Gerald C.", "review": "In a word: horrible. \n\nWe ordered the Pink Dragon Roll, fried tofu, and the fried pork with udon.\n\nThe interior looks like a basement level sushi restaurant in a shopping mall, an appropriate precursor to the quality of the food.\n\nThe Pink Dragon roll's scalding hot rice, which is capped off with a piece of flat and lifeless fish that appears to have recently left its months-long hibernation in its vacuum-sealed cocoon, will make you squirm and retch. It has little to no taste and is covered in a sickly watery orange mayonnaise that neither adds dignity nor taste. My girlfriend had to vomit directly afterward and that is not hyperbole. Furthermore, the ginger flanking the sushi has the consistency of a wet napkin. \n\nThe tea is served in cups of a plastic material sheathed in a beige color scheme that tries, and fails, to disguise itself as a higher quality ceramic. \n\nThe fried tofu is boring, tasteless, and generally awful. It comes coated in a thin film of a fried shell. It is lukewarm and insipid at best.\n\nThe fried pork tastes like leftovers. It is limp, dull in color, greasy, and, in all of it's microwaved glory, accompanied by a few sheets of fresh lettuce and decent rice.\n\nThe udon broth tastes like a diluted miso soup. The noodles are very basic. The pieces of seaweed are depressingly droopy. \n\nI am most disappointed in Yelp for making the one star review the lowest ranking available, because that is quite a generous score for this restaurant.", "rating": 1, "date": "2017-03-10"}, {"excerpts": ["the Pink Dragon Roll didn't have much flavor to it. ", "It was difficult to even pick up the sushi because the salmon was breaking apart as soon as we touched it. ", "The Spider Roll was a bit lack luster as well, but it's probably because I was comparing it to other spider rolls I've had which had tons of flavor, however for this dish ", "it ", "I didn't taste any crab in any bite. "], "author": "Fanny W.", "review": "This is the second time I've been to Kiki's and both times the food was only \"meh\". Perhaps it's because I didn't order the best dish on the menu but the Pink Dragon Roll didn't have much flavor to it. It was difficult to even pick up the sushi because the salmon was breaking apart as soon as we touched it. The Spider Roll was a bit lack luster as well, but it's probably because I was comparing it to other spider rolls I've had which had tons of flavor, however for this dish it I didn't taste any crab in any bite. The Rock N' Roll item was probably the best but barely since I can't even remember anything special about it other than it had the most flavor out of the three rolls we ordered that day.\n\nThe service was fairly quick, my friend and I arrived a little after 11:30. The place was empty so there was plenty of seating. \n\nHopefully next time I'll order something different and get the same great experience as all their other customers have had.", "rating": 3, "date": "2017-01-18"}, {"excerpts": ["My favorite is the pink dragon roll and their spam roll. ", "Ask for unagi sauce on the side ! ", "You'll thank me later, promise. "], "author": "Grace Anne D.", "review": "There's honestly not much that I can say about Kiki's. It's a great place if you're not willing to spend too much and are looking for VERY good sake bombs prices. \n\nThis place itself can be disorganized at times, especially when it gets hectic, which it really does during their happy hour (6-9PM?). It's been very rare that they take too long to bring something out and very rare that they'll forget something which is GREAT. But when I say it gets disorganized, I'm talking about seating people down. When it's happy hour or just dinner time, you have to get your name written down on a clipboard once you walk in. There's usually a sign that says, \"please wait to be seated\", so you can't miss it. STAY INSIDE the restaurant so you won't miss your name being called! \n\nThe outside and inside of Kiki's is quirky from start to finish. You can't miss this place and its Pee Wee Herman entrance. I love that they have Miyazaki film posters inside: Princess Mononoke, Totoro, Kiki's delivery service and I think Spirited Away. \n\nNow, the sushi and bento boxes are pretty good and they also do specials once in awhile (not in pricing, just new items). My favorite is the pink dragon roll and their spam roll. Ask for unagi sauce on the side ! You'll thank me later, promise. This place sure does make a good katsu; crispy panko and juicy chicken. \n\nService is usually sub par and I totally understand. I usually see this going on with Japanese restaurants that have below than average prices: people lose their shit and I'm not joking when I say that. My friends and I always order a bunch of rolls ($60+ for 3-4 people). Customers ordering sake bomb after sake bomb can get very rowdy and for me, if I was working there, I just can't with that. I don't know how these workers get through their shifts with the madness but I APPLAUD YOU ALL ! \n\nSo if you're looking for a place with minimal server talking, cheap rolls and cheap sake bombs: KIKI'S is the way to go.", "rating": 3, "date": "2015-07-16"}, {"excerpts": ["Pink Dragon Roll was good", "..it was hot when I first put it into my mouth. ", "Don't remember much of the Alaska Roll. ", "Oh, and the waiter forgot our plates. "], "author": "Mandy G.", "review": "If you a quick, inexpensive sushi meal, this is the place to go (..I guess). \n\nMy cousin, his gf, and I were planning to go to to Ebisu (few shops away) but decided that since Kiki's still open, we mind as well go. We entered 30 minutes before closing. My cousins gf has been here before but I haven't (first time). She said the place is cheaper than Ebisu. Looking from the storefront photo, the outside paint is yellow but when I came here, they recently painted it like a purple-ish color...which is a nice color for this place! \n\nEntering, I thought the place looked a bit odd and unique since the doorway and window were slanted. When we got to the hostess area, no one was there. Instead, this guy from across the restaurant got some menus in the back and walked reallyyy slow (probably a few steps) then signaled us to seat in the back on the right side (while he's still standing in the back).. \n\nWhile waiting, I noticed that what Joan T. said was true. Decor is a bit .... odd. They do have tacky Japanese writing covering the entrance lights. They also have funky lamps with lanterns as lights. There are also Kiki's Delivery Service & Totoro posters on the wall. When the three of us sat down, we noticed the place was reallyyy hot and stuffy! It felt like there was no air ventilation!! Ceilings are high but the room echo'ed with people's conversations. Tables were sticky. When the host had put down our menus on the table, and when I tried to pick it up, I could hear the sticky noise when I picked it up. Also, the for the \"special roll\" menu, there isn't much choices compared to other places in my opinion. I admit their prices are cheap though but you get what you paid for. \n\nThe sushi tasted quite bland.. I ordered the Tiger Roll and and there was so little sauce on it! Pink Dragon Roll was good..it was hot when I first put it into my mouth. Don't remember much of the Alaska Roll. Oh, and the waiter forgot our plates. We decided to just eat from our sushi plates instead of asking. \n\nOh, also, parking is hard! But that's Irving for ya'll... \n\nOverall, service was meh. Sushi was bland. Decor is odd.... Parking is hard! \nFinal say: Won't be back unless I'm in the area and I want a quick, inexpensive sushi meal. I rather pay a bit more for a better meal.", "rating": 2, "date": "2013-09-07"}, {"excerpts": ["One of my friends got the curry chicken udon, one got the pink dragon roll, and another got two sushi rolls. ", "It was pretty good, we all enjoyed our food. ", "It wasn't the best though. ", "You can also ask them for any sauces that you may want for your sushi and stuff. ", "One of my friends asked them for a siracha-mayo sauce and they gave it to her. "], "author": "Jeanette Q.", "review": "Went here yesterday for dinner with a few friends. The sushi here is pretty cheap compared to other places. We were lucky to be able to find parking right in front of the place. We thought the front of the place was cute with the slanted door, looked pretty small from the outside but the inside is pretty spacious. I got the two item bento box (with the ROCK N ROLL, Chicken Katsu, rice and salad) You get to pick any two items from the menu and the price is added together. One of my friends got the curry chicken udon, one got the pink dragon roll, and another got two sushi rolls. It was pretty good, we all enjoyed our food. It wasn't the best though. You can also ask them for any sauces that you may want for your sushi and stuff. One of my friends asked them for a siracha-mayo sauce and they gave it to her. Its pretty good with the sushi. \n\nIts pretty cool, how they name their rolls after other things like the, \"Lady Gaga Roll\", the \"49ers Roll\", and etc. What sucks about this place is that they don't have tea that's included for free like most Japanese sushi places.", "rating": 4, "date": "2013-06-16"}, {"excerpts": ["I don't think this is a terrible place to go, but don't order the pink dragon roll unless you want to burn off your taste buds. ", "The bento boxes make for a good lunch."], "author": "Cindy K.", "review": "Came here after my dentist appointment - my dentist was the one who recommended us to come here and even gave us a 15% off coupon. We were immediately surprised by how spacious the inside was. It seemed promising at first. \n\nDid not like:\n- our table was very very sticky, like it wasn't very well cleaned\n- it look a very long time till the waiter came by to take our order\n- my sushi burned my tongue\n\nWe ordered 2 bento boxes and 1 sushi roll. The bento boxes were alright, I probably could've gotten a larger portion from somewhere else, but for the price we paid it was good enough. OMG, my sushi was really hot. We ordered the \"pink dragon\" roll because it looked like something we never tried before. It seemed like they just boiled the salmon and laid it on top of the roll, which made the whole roll as hot as the salmon that was just cooked - even after 10 minutes the sushi was still too hot to put in my mouth. \n\nI don't think this is a terrible place to go, but don't order the pink dragon roll unless you want to burn off your taste buds. The bento boxes make for a good lunch.", "rating": 2, "date": "2010-06-06"}, {"excerpts": ["The pink dragon roll was good. "], "author": "Elliott N.", "review": "Accessibility (Parking / Wait Time)\n\n0/1 Star: parking is bad in the area for dinner. 5 minute wait but while I was eating people were waiting a long time\n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n0/1 Star: horrible service. Short staffed. Waited 15 minutes just to order food. \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n2/3 Stars: the food is ok. For the price it's pretty good. The pink dragon roll was good. The spam roll is smaller than it looks in the picture but was good. \n\n_____\n\nOverall Experience\n\n2/5 Stars \n\n_____\n\nLast Words\n\nCheap sushi", "rating": 2, "date": "2014-04-20"}, {"excerpts": ["The Pink Dragon Roll was gross.  ", "I don't like cooked salmon, and the entire roll was hot, including the mayo.  "], "author": "Steven B.", "review": "Went here before the Bris.  Table was sticky.  The Pink Dragon Roll was gross.  I don't like cooked salmon, and the entire roll was hot, including the mayo.  The Spicy Chicken Roll wasn't that great either.  None of the rolls really had any flavor.  No reason to ever come back.", "rating": 1, "date": "2014-06-30"}, {"excerpts": ["- Crunchy snowball (has crab - is fantastic)\n- 49ER'S roll - spicy tuna, avocado, crab & tobiko\n- Pink Dragon Roll - crab, avocado, wrapped in cooked salmon, topped w/sliced olives, tobiko & special cream sauce\n- Rock and Roll - barbecued eel & avocado\n\nSurprisingly enough, it was good and filling for all three of us without the guilt after that workout. "], "author": "Rebekah T.", "review": "I love sushi. Every time I think about how reluctant I was to try it before I was hooked, I laugh. \n\nMy friend recommended Kiki's after the Bay to Breakers. After the 12k walk, we walked something good yet healthy. My friend Rosy is a fan of Kiki's so we made our way over. The three of us (B2B walkstars - Tameka, Rosy and Myself) shared a few rolls and a bottle of Sho-Chiki-Bai Nigori Sake. \n\nThis is what we had.....\n- Crunchy snowball (has crab - is fantastic)\n- 49ER'S roll - spicy tuna, avocado, crab & tobiko\n- Pink Dragon Roll - crab, avocado, wrapped in cooked salmon, topped w/sliced olives, tobiko & special cream sauce\n- Rock and Roll - barbecued eel & avocado\n\nSurprisingly enough, it was good and filling for all three of us without the guilt after that workout. Definitely a good place on a budget too.", "rating": 4, "date": "2009-05-19"}, {"excerpts": ["The salmon on my Pink Dragon Roll was good, but the mayo-like sauce was NOT very good. ", "One because I am not a fan of mayo, and two, I am definetly not a fan of mayo on my sushi. ", "And the chicken and avocado roll was well just that - nothing extraordinary. "], "author": "Stephanie W.", "review": "Meh. I don't think I ordered the right things. I ordered Pink Dragon Rolls and a Kiki Roll (Chicken Teriyaki and Avocado Roll). The salmon on my Pink Dragon Roll was good, but the mayo-like sauce was NOT very good. One because I am not a fan of mayo, and two, I am definetly not a fan of mayo on my sushi. And the chicken and avocado roll was well just that - nothing extraordinary. So maybe...I just didn't order the right things. \n\nSigh. They did have a lot of tables and what not. So I am sure it was just me.", "rating": 3, "date": "2009-09-08"}, {"excerpts": ["My friend and I  ordered the pink dragon roll (crab w/ avocado with cooked salmon on top), kiki roll (chicken teriyaki w/ avocado), dynamite roll (tuna tempura w/ wasabi mayo), crunchy snow ball (tempura cream cheese w/ spicy sauce) and salmon, and tuna sashimi. ", "The fish didn't taste fresh. ", "It was close to spongy rather than buttery. ", "Granted I liked the different ideas they had, but in the end I wasn't impressed. "], "author": "Lola L.", "review": "A friend recommended this place I thought to give it a try. The place was pretty busy so I took this as a good sign. \n\nMy friend and I  ordered the pink dragon roll (crab w/ avocado with cooked salmon on top), kiki roll (chicken teriyaki w/ avocado), dynamite roll (tuna tempura w/ wasabi mayo), crunchy snow ball (tempura cream cheese w/ spicy sauce) and salmon, and tuna sashimi. The fish didn't taste fresh. It was close to spongy rather than buttery. Granted I liked the different ideas they had, but in the end I wasn't impressed. Oh and it didn't help that the cooked salmon burnt my tounge.\n\nThe prices are cheap so I guess you get what you paid for. There are no windows except for the ones on the roof so when eating here at night on an overcast day (like tonight) you have nothing but artificial lighting. I guess this can make the food look better? Opening this place next to Ebisu was a poor decision. The service is friendly but a little on the slow side.", "rating": 2, "date": "2008-07-30"}, {"excerpts": ["The pink dragon roll is what I always get here."], "author": "Sheena C.", "review": "This was my favorite place to go to for a long time.  But Because of parking I stopped going here so often.  This place is quaint and has a cutesy vibe to it.  It's not a fancy place if you're looking for a different type of ambiance.  The prices are affordable and there's always an open seat for you.  No long lines and waiting 30 min to eat.  The pink dragon roll is what I always get here.", "rating": 5, "date": "2011-07-18"}, {"excerpts": ["My favorite at both restaurants is the Pink Dragon roll.  ", "It's a $1 cheaper at Kiki's.   ", "Not the world's best sushi - but it's reasonably priced and there is a good variety available to satisfy your cravings.  ", "I'm not into hard core sashimi, so their menu of special rolls is perfect for me.  "], "author": "Denise M.", "review": "Anyone remember when House was in this location?  Now that was some good eats.  \n\nKiki is the sister restaurant to Kitaro.  I'm not sure if they're identical, but the menu is almost the same - but slightly cheaper.  My favorite at both restaurants is the Pink Dragon roll.  It's a $1 cheaper at Kiki's.   Not the world's best sushi - but it's reasonably priced and there is a good variety available to satisfy your cravings.  I'm not into hard core sashimi, so their menu of special rolls is perfect for me.  Anything with lots of unagi or shrimp tempura in it.  \n\nWhile Kitaro is cramped, Kiki's is much more spacious.  You actually have full tables to yourself, not side stepping into bench seating. Because of the high ceilings, it's much more echoey and loud.  Love the anime prints on the walls.", "rating": 4, "date": "2008-02-15"}, {"excerpts": ["The rolls my boyfriend ordered were not very good even though he seemed to enjoy the pink dragon roll, but I dislike rolls that are deep-fried and/or covered in cream sauce. "], "author": "Kristina L.", "review": "As the boyfriend was quick to point out, this is one of those places where you go if you want rolls or a bento, not raw fish. Thus, he got a couple rolls and some unagi. Unfortunately, I have a thing for nigiri, so I got some yellowtail and albacore, as well as futo maki. When I was a kid, my neighbor used to make futo maki for me, so I order it when I'm feeling nostalgic, and Kiki's futo maki hit the spot. The rolls my boyfriend ordered were not very good even though he seemed to enjoy the pink dragon roll, but I dislike rolls that are deep-fried and/or covered in cream sauce. The yellowtail nigiri was mushy and a little stringy. The albacore was decent. I feel a little bad for dishing out two stars, but it's true that I've experienced better.", "rating": 2, "date": "2010-06-21"}, {"excerpts": ["We had the pink Dragon Roll which was good ", "but it was hecka hot, like piping hot. ", "I burned my tongue....", "guess I didn't read the description too well. ", "Overall I give KiKi's two thumbs up, but the sushi isn't tightly wrapped. ", "You've been warned. ", "Eat in ecstacy my fellow Sushiadors."], "author": "D M.", "review": "Kiki's.... great prices for good food. Miso soup does not come with Bento Boxes, so you have to order seperate. We had the pink Dragon Roll which was good but it was hecka hot, like piping hot. I burned my tongue....guess I didn't read the description too well. Overall I give KiKi's two thumbs up, but the sushi isn't tightly wrapped. You've been warned. Eat in ecstacy my fellow Sushiadors.", "rating": 4, "date": "2010-12-14"}, {"excerpts": ["Looking further down the menu, I spotted the \"Pink Dragon Roll\". ", "And I thought to myself...", "\"Waaaiiiit ", "a minute...", "I've seen these items on a menu before. ", "I just ordered the Pink Dragon Roll this past weekend when I went to Kiki with my brother. ", "But, this time, I was offered the choice of having the salmon cooked or uncooked on top, something that I had never considered when going to Kitaro (and I also asked that it made without that obscure mayo-type cream sauce that they run across the top with Christmas-colored sprinkles). ", "I opted for the uncooked, and the end result was much like the \"Salmon Tsutsumi Roll\" at one of my favorite won't-break-the-bank sushi places in SF: ", "I Luv Teriyaki & Sushi on Potrero Ave. ", "But the Pink Dragon doesn't have the slivers of avocado between the salmon pieces, as the Salmon Tsutsumi does. "], "author": "B. Earl K.", "review": "Having recently moved to the neighborhood around Irving and 9th, the first thing I knew about this area was the abundance of good eateries.\n\nOn my way back from jogging in the park the other day, I walked into Kiki to grab a take-out menu. The first maki roll item that jumped out at me was the \"Mexican Roll\". Looking further down the menu, I spotted the \"Pink Dragon Roll\". And I thought to myself...\"Waaaiiiit a minute...I've seen these items on a menu before. But I've never been IN this place.\"\n\nThen it occurred to me...KITARO out on Geary! (The waiter at the register quickly confirmed the sister status of these two restaurants.)\n\nSeveral years ago, when I didn't live all the way on the east side of the city (which, of course, I no longer do), I used to order takeout from Kitaro on a regular basis. And the Mexican and Pink Dragon Rolls were steady faves.\n\nI just ordered the Pink Dragon Roll this past weekend when I went to Kiki with my brother. But, this time, I was offered the choice of having the salmon cooked or uncooked on top, something that I had never considered when going to Kitaro (and I also asked that it made without that obscure mayo-type cream sauce that they run across the top with Christmas-colored sprinkles). I opted for the uncooked, and the end result was much like the \"Salmon Tsutsumi Roll\" at one of my favorite won't-break-the-bank sushi places in SF: I Luv Teriyaki & Sushi on Potrero Ave. But the Pink Dragon doesn't have the slivers of avocado between the salmon pieces, as the Salmon Tsutsumi does. Bummer.\n\nThe Mexican Roll (shrimp tempura within a roll, with chili powder) didn't have as much chili powder on it as I recall from past visits to Kitaro. But it was still pretty tasty.\n\nWe also ordered a couple of deep-fried rolls (the Godzilla and the Dynamite). Both were decent.\n\nI don't think I would order things like ikura nigiri for fear that it wouldn't be as fresh as, say, Ebisu up the street. But the maki rolls are satisfying, and you really can't beat the prices...under $7 for a Rainbow Roll??? Try to find that price at another sushi place in the city.\n\nThis review may seem like it's all over the map (it's my first one!), but I'd have to say that, all in all, Kiki was a nice walk down \"low-cost sushi memory lane\" for me and my bro. For the record, that's not a walk a like to make very often.\n\n3 stars because, as sushi places go, I would give only the absolute best of the best places 5 stars, and there are many 4-star places in the city that come to mind as simply a better overall experience than Kiki/Kitaro. This place is decent nonetheless...", "rating": 3, "date": "2007-03-20"}, {"excerpts": ["I love the Pink Dragon Roll at Kitaro and was excited to see it on Kiki's menu, also.  ", "But it barely resembled the roll I'm used to getting at Kitaro.  ", "The roll was made with leftover sushi and was hard.  ", "Disappointing."], "author": "Jaclyn L.", "review": "I love the Pink Dragon Roll at Kitaro and was excited to see it on Kiki's menu, also.  But it barely resembled the roll I'm used to getting at Kitaro.  The roll was made with leftover sushi and was hard.  Disappointing.", "rating": 2, "date": "2008-12-01"}, {"excerpts": [", the waitresses are nice, they reconize me whenever i go eat there, i went there on monday, and ordered the pink dragon roll, its cooked salmon on top of a california roll, mmmm!! ", "the food is decent, the price is great."], "author": "Jessica C.", "review": "i really like this place, the waitresses are nice, they reconize me whenever i go eat there, i went there on monday, and ordered the pink dragon roll, its cooked salmon on top of a california roll, mmmm!! the food is decent, the price is great.", "rating": 4, "date": "2009-11-10"}, {"excerpts": ["The best ones in my opinion are the pink dragon roll and the godzilla roll.  ", "The pink dragon roll consists of  cooked salmon on top of california roll.  ", "Very tasty ", "but you have to wait a bit for the salmon to cool down", ", I've burned my lip a few times because it was a bit too hot.  ", "The godzilla roll is good because its deep-fried (always a plus) ", "The bento boxes are decent in size and taste.  ", "Overall, its not a fancy place, the staff is friendly, its cheap and the food is good. ", "Its worth a try"], "author": "Jollieanne J.", "review": "For cheap eats, this is one of my favorite spots. If I'm correct, they always have a sister restaurant on Geary called Kitaro's. The decor is straight from the IKEA floor plan with a few anime posters. The staff is always very welcoming, nice and attentive.  There is hardly ever a wait when I come here. The sushi selection is nothing too extensive but always very fresh, the most expensive roll is only like 6 bucks. The best ones in my opinion are the pink dragon roll and the godzilla roll.  The pink dragon roll consists of  cooked salmon on top of california roll.  Very tasty but you have to wait a bit for the salmon to cool down, I've burned my lip a few times because it was a bit too hot.  The godzilla roll is good because its deep-fried (always a plus) The bento boxes are decent in size and taste.  Overall, its not a fancy place, the staff is friendly, its cheap and the food is good. Its worth a try", "rating": 4, "date": "2009-02-15"}], "crunchy snow ball": [{"excerpts": ["The tiger roll and crunchy snow ball rolls are especially delicious. ", "If you are looking for some good crab, the spider roll is amazing. ", "I've yet to try a dish here that I did not like!"], "author": "Chelsea A.", "review": "Their Pickup orders are ready quickly and their prices are as to die for as their sushi rolls!! The tiger roll and crunchy snow ball rolls are especially delicious. If you are looking for some good crab, the spider roll is amazing. I've yet to try a dish here that I did not like!", "rating": 4, "date": "2013-03-09"}, {"excerpts": ["Ordered the 49ers roll, the chicken teriyaki bento box, crunchy snow ball, and the beef udon all for 25 bucks. ", "The service was very good with the refills. ", "Will definitely go back for their lunch specials."], "author": "Katie S.", "review": "They have a wide variety of things to choose from, are very inexpensive, and have great lunch specials/coupons. For all 3 of these things they deserve the 4-star rating. Definitely sushi on a budget. Don't expect it to knock your socks off but for the price you definitely get what you pay for and they are very generous with their portions. Ordered the 49ers roll, the chicken teriyaki bento box, crunchy snow ball, and the beef udon all for 25 bucks. The service was very good with the refills. Will definitely go back for their lunch specials.", "rating": 4, "date": "2009-12-15"}, {"excerpts": ["My friend and I  ordered the pink dragon roll (crab w/ avocado with cooked salmon on top), kiki roll (chicken teriyaki w/ avocado), dynamite roll (tuna tempura w/ wasabi mayo), crunchy snow ball (tempura cream cheese w/ spicy sauce) and salmon, and tuna sashimi. ", "The fish didn't taste fresh. ", "It was close to spongy rather than buttery. ", "Granted I liked the different ideas they had, but in the end I wasn't impressed. "], "author": "Lola L.", "review": "A friend recommended this place I thought to give it a try. The place was pretty busy so I took this as a good sign. \n\nMy friend and I  ordered the pink dragon roll (crab w/ avocado with cooked salmon on top), kiki roll (chicken teriyaki w/ avocado), dynamite roll (tuna tempura w/ wasabi mayo), crunchy snow ball (tempura cream cheese w/ spicy sauce) and salmon, and tuna sashimi. The fish didn't taste fresh. It was close to spongy rather than buttery. Granted I liked the different ideas they had, but in the end I wasn't impressed. Oh and it didn't help that the cooked salmon burnt my tounge.\n\nThe prices are cheap so I guess you get what you paid for. There are no windows except for the ones on the roof so when eating here at night on an overcast day (like tonight) you have nothing but artificial lighting. I guess this can make the food look better? Opening this place next to Ebisu was a poor decision. The service is friendly but a little on the slow side.", "rating": 2, "date": "2008-07-30"}, {"excerpts": ["Their appetizers were good: crunchy snow ball, fired cracker, chicken lollipop, mochi adegashi, and fried tofu were good. ", "My lunch consisted of alaska roll and the tonkatsu/shrimp & veggie tempura. ", "My kids ordered the udon and chicken teriyaki. ", "All were good and my kids loved their meals. ", "Affordable, clean, polite waitress and high ceiling place deserves an xtra star."], "author": "Marcus Y.", "review": "Their appetizers were good: crunchy snow ball, fired cracker, chicken lollipop, mochi adegashi, and fried tofu were good. My lunch consisted of alaska roll and the tonkatsu/shrimp & veggie tempura. My kids ordered the udon and chicken teriyaki. All were good and my kids loved their meals. Affordable, clean, polite waitress and high ceiling place deserves an xtra star.", "rating": 4, "date": "2011-07-13"}, {"excerpts": ["They are also famous for their crunchy snow ball which is basically a deep fried tempura sushi roll with rice, cream cheese and seaweed wrapping topped with teriyaki and a side of Sriracha sauce. ", "Service is very nice and never had a problem here with the food. ", "Definitely a place to check out for you college students like myself and its a pretty nice atmosphere as well. ", "=)"], "author": "Sean E.", "review": "This is definitely another hot spot for you Japanese cuisine bang for the buck lovers. They have not only lunch, but also DINNER specials as well. I usually get the 2 item salmon sashimi and salmon teriyaki bento though because the sashimi is probably one of the freshest ones I've ever had and the salmon teriyaki filet is so big. They are also famous for their crunchy snow ball which is basically a deep fried tempura sushi roll with rice, cream cheese and seaweed wrapping topped with teriyaki and a side of Sriracha sauce. Service is very nice and never had a problem here with the food. Definitely a place to check out for you college students like myself and its a pretty nice atmosphere as well. =)", "rating": 4, "date": "2010-05-19"}, {"excerpts": ["Recommended Dish: Crunchy Snow Ball (fried cream cheese sushi). ", "Its sister restaurant, Kitaro, on Geary is now better than this location. ", "Although Kiki's lines are shorter, in the past few months their quality has started to take a downturn. ", "Where they previously attempted to impress the customers with quantity and flavor they now barely pass. ", "Their prices are still extremely reasonable for their rolls and bento boxes, but the once impressive portion of Pink Dragon rolls with its generous slab of cooked salmon has shrunk to maybe half its previous size. ", "It is still worth the visit considering the value ", "but it just isn't the bargain it once was."], "author": "Ellen C.", "review": "Recommended Dish: Crunchy Snow Ball (fried cream cheese sushi). Its sister restaurant, Kitaro, on Geary is now better than this location. Although Kiki's lines are shorter, in the past few months their quality has started to take a downturn. Where they previously attempted to impress the customers with quantity and flavor they now barely pass. Their prices are still extremely reasonable for their rolls and bento boxes, but the once impressive portion of Pink Dragon rolls with its generous slab of cooked salmon has shrunk to maybe half its previous size. It is still worth the visit considering the value but it just isn't the bargain it once was.", "rating": 3, "date": "2006-10-08"}, {"excerpts": ["My favorites there is the crunchy snow ball, spider roll, and the dragon roll.  ", "It's easy to get full off of sushi for under $10.00.  ", "Oh and the coupons! ", "you can find the coupons anywhere.  ", "I printed a bunch of them online."], "author": "ShayShay G.", "review": "The great thing about Kiki's is that the sushi is good for it's price.  I go there alot of times during my lunch break because it's not that far.  I always call in my order from work, go down there and voila! it's done.  My favorites there is the crunchy snow ball, spider roll, and the dragon roll.  It's easy to get full off of sushi for under $10.00.  Oh and the coupons! you can find the coupons anywhere.  I printed a bunch of them online.", "rating": 4, "date": "2006-10-10"}]}