{"pork and shrimp wonton soup with wide rice noodle": [], "chicken and spinach wonton soup with wide rice noodle": [], "pork and chinese spinach wonton soup with wide rice noodle": [], "dumpling with qq noodle soup": [], "beef stew soup noodle": [{"excerpts": ["We ordered the green onion pancake, pork dumplings with napa, pork dumplings with chives, garlic pea shoots, shanghai soup dumpling, beef stew soup noodle and a beef chowfun. ", "Like mentioned before, the tables are super small so we barely fit all that food on our table. ", "The dumplings were REALLY good! ", "My family loves the dumplings with chives so much, they now go to the Kingdom of Dumpling wholesale to buy frozen ones to resteam and eat at home!"], "author": "Emily G.", "review": "Expect to wait because the interior of this place is pretty small. Because there's so much people, they take your orders while you're standing on the street. I understand that it is harder to take orders while people are seated as the waiter might block the small walkways, etc. So I let that go... I'm more interested in the food anyways. The first thing I noticed: this is literally your typical Chinese restaurant- place looks dirty, service isn't the best but the food looks good. \n\nWe ordered the green onion pancake, pork dumplings with napa, pork dumplings with chives, garlic pea shoots, shanghai soup dumpling, beef stew soup noodle and a beef chowfun. Like mentioned before, the tables are super small so we barely fit all that food on our table. The dumplings were REALLY good! My family loves the dumplings with chives so much, they now go to the Kingdom of Dumpling wholesale to buy frozen ones to resteam and eat at home!", "rating": 4, "date": "2018-08-16"}, {"excerpts": ["The first dish that came out was the BEEF STEW SOUP NOODLE, $7.45, which you can customize to be spicy (they just throw in some of their homemade orange spicy sauce). ", "My friend wanted it spicy, which, fortunately, is not that spicy for those weak-of-chile. ", "The noodles, like King of Noodles, are homemade, doughy, and not that chewy. ", "The broth is surprisingly light and unsalty in a good way. ", "The meat is thinly-cut beef shank, and some quarters of bok choy and black fungus mushrooms are thrown in for good measure. "], "author": "Adele F.", "review": "EDIT (5/18/16): Begoni Bistro in Chinatown is xiao long bao king.\n\nKingdom of Dumpling, you have earned your name. Also, you apparently have a twin called King of Noodles in Inner Sunset, which I did not know served xiao long bao! I guess I took your names at face value.\n\nThis place is quite petite, but the waiter has the best sense of humor. We ordered dumplings and noodles, after which he commented that we didn't have any vegetables. I replied, \"Carbs only!\" and he laughed and said, \"But you're so skinny!\" A+++ for you, my friend.\n\nThe first dish that came out was the BEEF STEW SOUP NOODLE, $7.45, which you can customize to be spicy (they just throw in some of their homemade orange spicy sauce). My friend wanted it spicy, which, fortunately, is not that spicy for those weak-of-chile. The noodles, like King of Noodles, are homemade, doughy, and not that chewy. The broth is surprisingly light and unsalty in a good way. The meat is thinly-cut beef shank, and some quarters of bok choy and black fungus mushrooms are thrown in for good measure. However, I personally prefer beef chuck cubes over beef shank, so I wasn't in love with the dish.\n\nThe next dish was the CHICKEN DUMPLINGS WITH GREEN CHIVES, 12 pieces for $6.95. Hearty filling, delicious dumplings. I like it.\n\nThird dish was the SHANGHAI SOUP DUMPLINGS (xiao long bao), 6 pieces for $4.95. The dumplings are shaped as thin peaks rather than wide blobs, which is a change of pace. The thickness of the wrapper is on par with that of Dumpling Kitchen, the soup is plentiful, but the amount of pork filling is somewhat lacking.\n\nSame issue with quantity of meat applies to their SHANGHAI PAN FRIED SOUP DUMPLINGS (sheng jian bao), which, despite the English description, contain no soup. $4.95 for 4 pieces, which is kind of pricey... BUT. Even though their meat insides are quite minuscule, they do the best job with a light, fluffy breading, shaped into a cute bun, fried golden brown on the bottom and topped with sesame seeds and chopped green onions on top. This has been the least dense and least oily of the sheng jian baos I've tried in the city, which makes it my favafav.\n\nDumpling Kitchen for xiao long bao, Kingdom of Dumpling for sheng jian bao and an ego booster.", "rating": 5, "date": "2016-05-17"}, {"excerpts": ["In need of something soupy, we also ordered the Beef Stew Soup Noodle with \"QQ\" noodles.  ", "QQ noodles are just thin clear noodles.  ", "Dish came with Mustard Greens, Mushrooms.  ", "There would've been more pieces of beef, but the broth was flavorful. \n"], "author": "Cass J.", "review": "There are certain foods that you just have to have during wet, cold evenings out.  For me, soupy things and dumplings just spell out the most perfect things to have to warm you right up.  \n\nCame here for an early dinner--before 6pm-ish.  And luckily, we only had to wait about 5 minutes.  Kingdom of Dumpling is a hole-in-the-wall place in all aspects; from the non-obviousness exterior, to literally feeling like you are dining in someone's low-ceiling garage.  The whole environment spells out seedy! \nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=4MhJsu-9LF7YTMtvrjF6Pg\nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=26xD66-_AIE2JMZP-3W1HQ\nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=1i76RAseg6wQttzQOfdhjg\n\nLuckily, being from San Francisco, you really know not to judge a spot by it's cover.  And despite the stuffy-ness from the low ceiling of the dining room, it was actually quite cozy and warm given the nippy weather outside. \n\nMind you, if you don't speak Mandarin, you might have a difficult time figuring out what certain items are because of the fact that the descriptions on the menu all are pretty similar.  \n\nFurthermore, the server's speak minimal English.  The owner, if you are lucky to have him on site, is friendly and cheerful and speaks great English.   But overall, you must definitely just go with your gut here when ordering.  \n\nSo one of the items with all of the talk is of course the Shanghai Soup Dumplings (Siew Loong Bao).  6 Dumplings for $4.95  Perfectly steamed, with a nice chewy texture; great amounts of broth inside as you bite into the dumpling.  I love the feeling of burning my mouth as I pop these little things in! Lol...it's a little fetish of mine.  =X\nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=EVHwrCGmhXQAM2B6lHW09A\nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=qdziasSuLL_E8yd5-HjL7g\nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=WKNAPBJdmAtAriwGJ2aZBg\n\nAlso ordered the Pork Dumplings with Napa Cabbage.  12 Pieces for $5.95.   Also quite yummy and nicely stuffed with pork.  I like when my dumplings are boiled and steamed perfectly without a sticky texture that I so often experience at other spots. \nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=xS7L42XUAt9fH0EI85k1Vw\n\nAnother hyped-up item here is the Onion Pancake.  *Eh* For me, this item did not live up to the excitement that I was looking forward to.  Pancakes were paper thin and soggy. \nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=Bhd0uEqd6FnjHop0U_Hm_w\n\nIn need of something soupy, we also ordered the Beef Stew Soup Noodle with \"QQ\" noodles.  QQ noodles are just thin clear noodles.  Dish came with Mustard Greens, Mushrooms.  There would've been more pieces of beef, but the broth was flavorful. \nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=bUXnZzwK-NCKGstNz8EV6Q\n\nLastly, we ordered the Shanghai Style Donut.  We ordered this blindly as the server really didn't have a good description for us other than that there is sesame top.  What it actually is close to the Sesame Balls with Red Bean Paste Inside (Jin Dui, when you eat this at dim sum).  But rather, it was filled with a black bean paste and the texture of the donut is more like a flakey puff pastry.  \nhttp://www.yelp.com/biz_photos/r19XhpINtQxhMwB0eKnmjA?select=D4ZSlHwECO_8lo7olrkVVg\n\nMy advice on this spot...come here if you aren't super starving as you definitely need to order a lot of dumplings to actually get full.  Our bill came out to about 30 bucks, which for dumplings is a bit steep in my eyes.  Definitely more of a snack spot. But what you will get here is a no frills meal enough to satisfy your craving for something nice and warm.  \n\nTo sum up, hole in the wall and minimal service, but maximum satisfaction to quickly warm your insides up!", "rating": 4, "date": "2010-01-24"}], "beef tendon soup noodle": [], "bei jing bean paste noodle": [{"excerpts": ["Bei Jing Bean Paste Noodle", ": This is their take on black bean noodles. ", "There was a decidedly unpleasant metallic taste that the noodles had. ", "The noodle texture also wasn't too great. ", "I only ate a couple spoons, and didn't want to eat any more. ", "Definitely not one of their stronger dishes.\n", "- Onion pancake", ": The flavor was pretty good, but dense and very oily -- so much so that some of the pieces were almost transparent. ", "Many other restaurants in the city do this dish much better."], "author": "Eric W.", "review": "The Bay Area, until the recent opening of the Din Tai Fung in San Jose, was severely lacking in restaurants that could make amazing Xiao Long Bao (soup dumplings). Since San Jose is too far away and the waits are ridiculous, does Kingdom of Dumpling scratch that XLB itch? For the most part, I'd have to say yes. \n\nThe xlb are flavorful and well constructed. They come 6 to an order, and were ready to go as soon as we sat down (they take your order while you're waiting, which I think is a pretty cool way to compensate for the lack of space within the restaurant). The broth has a good amount of depth and the pork is very flavorful. They're certainly not as delicate as the DTF offerings, but are delicious nonetheless. The thickness and consistency of the shell reminded me of the xlb at Shanghai Dumpling King, another one of SF's hole in the wall XLB joints. \n\nWe ordered several other dishes, some of which I actually enjoyed far more than the xlb (for just the xlb I would give this place 3 stars). \n\nOrder these:\n- Pig ears: Fantastically seasoned, chewy and tender. Served cold and was a great complement with the other hot dishes. I would order these again in a second.\n- Lamb dumpling w/ Chinese Vegetable: The lamb/veggie filling inside was delicious, and the dumpling skin was far more delicate than the xlb. Another must order dish.\n\nCould take or leave:\n- Black bean string beans; The flavor was pretty good, but they were really under-seasoned, The black bean sauce was fairly watery so it didn't really stick to the beans very well. Okay, would probably order again for a veggie dish.\n- Salt & Pepper Tofu: Again, it tasted good. The tofu was crispy on the outside and soft on the inside, which is what you want. However, when this dish came out the soft insides of the tofu were hotter than the surface of the sun. I ate and entire one and just bit into it, and am still feeling the burn on the top of my mouth today. Let these cool down for a few minutes unless you want to destroy the inside of your mouth.\n\nSkip these:\n- Bei Jing Bean Paste Noodle: This is their take on black bean noodles. There was a decidedly unpleasant metallic taste that the noodles had. The noodle texture also wasn't too great. I only ate a couple spoons, and didn't want to eat any more. Definitely not one of their stronger dishes.\n- Onion pancake: The flavor was pretty good, but dense and very oily -- so much so that some of the pieces were almost transparent. Many other restaurants in the city do this dish much better.", "rating": 4, "date": "2016-09-08"}], "muster green with tofu noodle soup": [], "spicy beef noodle soup": [{"excerpts": ["Pork and chive dumpling, Garlic string beans, Beef Chow fun, XLB, Spicy beef noodle soup. \n\n"], "author": "Sheewon B.", "review": "In order of fav to least fav: Pork and chive dumpling, Garlic string beans, Beef Chow fun, XLB, Spicy beef noodle soup. \n\nThe food has declined over the past few years. They still do a decent job on the pork dumplings, but the star used to be XLB. Today the dough texture was strangely brittle when you pick it up with your chopsticks yet mouthfeel was mushy. Flavor was decent, although the ginger soy sauce plays a big part in its balance. \n\nBeef chow fun was standard, what I expect out of a Chinese restaurant. The beef noodle soup was bland. \n\nNot sure if the owners recognized the Yelp reviews on service, but this time the greeter was too attentive; he asked us if everything was ok about 5 times during our meal, and we were only there for 20 min. But they did take our order while we were waiting for a table, so as soon as we sat down we had our first dish, which I find to be efficient. \n\nNot going back again. We'll go back to Dumpling Kitchen just a few blocks away.", "rating": 2, "date": "2017-09-09"}, {"excerpts": ["After looking thru yelp, we ordered the XLB (6), green string beans w/ garlic, pork & Napa cabbage dumplings (12), green chives pancake (2 cut into 4 pieces) & spicy beef noodle soup. ", "All were pretty good for the price you pay. ", "I would def recommend the green chives pancake; it was very crispy and full of flavor!! ", "The XLB was ok. ", "The dumplings seemed like they were boiled for a bit too long as the skin was soggy and was about to rip. ", "I would not recommend the spicy beef noodle soup because the soup base tasted like water with a HINT of beef flavor & they used chili oil to make it spicy. ", "The best part about the noodle soup was the beef itself-- very tender and flavorful. "], "author": "Emily L.", "review": "Small place located in the parkside/inner sunset district. I came in w/ my BF at 1pm on a Sunday for lunch and most tables were taken. After looking thru yelp, we ordered the XLB (6), green string beans w/ garlic, pork & Napa cabbage dumplings (12), green chives pancake (2 cut into 4 pieces) & spicy beef noodle soup. All were pretty good for the price you pay. I would def recommend the green chives pancake; it was very crispy and full of flavor!! The XLB was ok. The dumplings seemed like they were boiled for a bit too long as the skin was soggy and was about to rip. I would not recommend the spicy beef noodle soup because the soup base tasted like water with a HINT of beef flavor & they used chili oil to make it spicy. The best part about the noodle soup was the beef itself-- very tender and flavorful. It's too bad the soup and noodles couldn't complement it. \n\nService was great. The manager and serving staff were very kind and kept checking on us.", "rating": 3, "date": "2016-09-21"}, {"excerpts": ["Also had a very good garlic cucumber salad and a spicy beef noodle soup, and the onion pancake.  "], "author": "Michelle C.", "review": "Very good Shanghai dumplings, although I will admit my standards are probably a bit high since I recently returned from having Shanghai dumplings in Taipei.  But, still, Kingdom of Dumpling was quite good.  The skins of the dumplings were much thinner than most in the Bay Area, and the soup was very tasty.  Also had a very good garlic cucumber salad and a spicy beef noodle soup, and the onion pancake.  All very good, although the onion pancake was a bit greasy for my taste.\n\nWe waited about 15-20 minutes, and the lack of sign-in sheet can be a bit unnerving, but well worth the wait for some delicious xiao long bao on a cold evening!", "rating": 4, "date": "2011-09-06"}], "six pieces shanghai soup dumpling": [], "four pieces shanghai pen fried soup dumpling": [], "two pieces marinated raddish cake": [], "two pieces shanghai style donut": [], "one piece onion pancake": [], "two pieces green chives pancake": [], "one piece beef pancake": [], "two pieces seseme pancake with marinated beef": [], "four pieces spring roll with vegetable": [], "six pieces pork pot sticker": [], "six pieces vegetarian pot sticker": [], "spicy marinated beef": [{"excerpts": ["Also, you have to get two of the five spicy marinated beef, you will not regret this. ", "Please do not wear a sweater or some kind of jacket because it gets hot, and I mean hot. ", "You will be sweating by the time you finish eating. ", "The location is great, right in line with the L, but parking can be a bit iffy. ", "The prices are really cheap, spent $43 on a meal for 5 once, that's always good. "], "author": "Javier G.", "review": "Obviously the best dumplings ever.\n\nI come here again and again and every time I leave satisfied. This little whole in the wall somehow found it's way to make some of the best dumplings known to mankind. Please get any of the dumplings with green chives, along with the won ton dumplings. Also, you have to get two of the five spicy marinated beef, you will not regret this. Please do not wear a sweater or some kind of jacket because it gets hot, and I mean hot. You will be sweating by the time you finish eating. The location is great, right in line with the L, but parking can be a bit iffy. The prices are really cheap, spent $43 on a meal for 5 once, that's always good. The food is fresh as their factory is down the street and their service is okay, I can agree with some of the complaints that some of the Yelpers have addressed in other posts. \n\nI knocked off one star from my review due to my last visit here. Went with a couple of my buddies and we wanted to order more food and the guy wouldn't let us. I thought it was bullshit, like wassup bro you don't want my money?? But now that I look back at it, I guess it makes sense. They needed our table to seat some of the people that have been waiting outside for a while. The guy was apologetic and even gave me a coupon for some dumplings from their factory. \n\nAside from the spotty service, this place has it going on for sure. Just wish they were to move to a bigger location.", "rating": 4, "date": "2013-11-05"}], "grilled lamb skewer": [{"excerpts": ["For the most recent visit, we had Grilled Lamb Skewer, Shanghai Soup Dumpling (aka Xiao Long Bao), Stir-fried String Beans and Beef Roll. \n\n", "Grilled Lamb Skewer: be aware if you are not the citizens of spicy-land, they sprinkled canyon pepper on the top and that made us in fire, had to order soda to cool the tongues off. ", "Surprisingly it was less spicier the next day after re-heated in the microwave. "], "author": "Leslie C.", "review": "There are days when I just need some comfort food to warm me up in the cold weather. I've been visited Kingdom of Dumplings couple times but haven't really thought about writing a review for them.\n\nKingdom of Dumpling is the typical small and homey Chinese restaurant. The seats are limited and customers sit very close to each other when dine in, however, that doesn't affect any bit of the comfort food they've got here. Friendly with smiles on their faces, the staff sure know how to warm the customers' hearts up. \n\nFor the most recent visit, we had Grilled Lamb Skewer, Shanghai Soup Dumpling (aka Xiao Long Bao), Stir-fried String Beans and Beef Roll. \n\nGrilled Lamb Skewer: be aware if you are not the citizens of spicy-land, they sprinkled canyon pepper on the top and that made us in fire, had to order soda to cool the tongues off. Surprisingly it was less spicier the next day after re-heated in the microwave. Nice texture, meat itself was tender and very flavorful.\n\nShanghai Soup Dumpling: I guess I don't have to put anymore words on this but the portion was on point, I usually dip light in the sauce and then eat the whole dumpling, let the soup explode in my mouth and experience everything in that little thing.\n\nStir-fried String Beans: your go-to veggies. If you like medium cook and still have that little crunchy-ness when you chew it, this is for you. A little bit heavy on the dressing and I just dipped on the edge and it was all good.\n\nBeef Roll: different than I expected, I was thinking about the pancake and beef roll together (with cilantro which I usually hate), this one had the stuffing (beef and green onions) in the pancake, and slice in equal 4 piece -- think about pita bread (pocket) with meat patty in there -- here you go. Tasty, juicy, filled up my tummy. \n\nThe owner (seems like he is the owner) was busy checking on every table to make sure everything is alright. Before we left, he came up to the door with a big smile and said goodbye. I smiled back and said \"thank you\". Reasonable price, good portion, nice staff, I will be back again for sure. \n\nps. Came here pretty early and only waited for 10 minutes. Parking was easy in the neighborhood and we didn't mind to walk for 1-2 blocks.", "rating": 5, "date": "2015-12-09"}, {"excerpts": ["Food is good, the grilled lamb skewer is a must try. ", "I enjoy their small dishes more than the dumpling and noodle. "], "author": "Jason L.", "review": "This place is one of the best dumpling place in town. They've a couple different location and they offer raw dumpling for you to take home. Food is good, the grilled lamb skewer is a must try. I enjoy their small dishes more than the dumpling and noodle. They're very traditional Shanghai style. \n\nHowever, there's a couple thing that's a turn down. Seating is always a problem. Very few seat since this place is tiny. Average wait time will be at least 15-20 mins for a table. The place is hot, I really mean hot. Ventilation is poor. If you happen to has the boss take your order, be prepare he'll up sale you all kinda things. I'm a regular so he won't do that to me anymore. However I heard people complaint about this. The other staff is ok. Overall not bad but there's gonna be more dumpling place in Sunset area so choices a out there.", "rating": 3, "date": "2014-05-23"}], "salt pepper tofu": [{"excerpts": ["A couple items we ordered that I think I can skip next time - the salt pepper tofu and the green onion pancake. ", "The salt pepper tofu lacked a good salt pepper flavor and instead, kind of had a little odd flavor to it. ", "It was a little bland. ", "The green onion pancake was not bad, but it should be ordered with traditional small dishes that compliment the green onion pancake. "], "author": "Jean S.", "review": "It's been amazing to see this little hole in the wall dumpling shop grow into its \"kingdom.\" About 10 or more years ago, I would walk by this tiny shop in the evenings and it would usually be empty with just the owner inside. Over the last half decade, it has exploded with popularity and now, the place is always packed with a regular group of people waiting outside. \n\nTheir dumplings are soothing and delicious! I always order the pork and napa cabbage dumplings, which has a nice soft skin and subtle juicy flavors in the dumplings. Although the flavors by itself are not heavy, it pairs perfectly with the soy sauce/vinegar provided. I also love their garlic string beans and garlic cucumbers, very fresh, flavorful, and crunchy. The beef pancake is a pretty good size and tastes good also. It is a little oily, but that is to be expected with these types of pancakes. Recently, I tried their beef stew noodle soup, which has a nice and soothing soup broth with plenty chunks of beef stew, soft and delicious noodles, fresh bok choy, and mushrooms. This would be perfect for a cold day.\n\nA couple items we ordered that I think I can skip next time - the salt pepper tofu and the green onion pancake. The salt pepper tofu lacked a good salt pepper flavor and instead, kind of had a little odd flavor to it. It was a little bland. The green onion pancake was not bad, but it should be ordered with traditional small dishes that compliment the green onion pancake. By itself, it was a little plain and a little dry.  \n\nIt was HOT inside the little restaurant. We sat at the table next to the kitchen, which made it even hotter. The owner and staff were very attentive and talkative. Although I do like eating here, I usually don't like to wait long for a table. I definitely would recommend this restaurant, but incase you don't like to wait, you can come before or after peak lunch/dinner times...OR you can buy frozen dumplings from their to-go shop on Taraval and bring them home to cook.", "rating": 4, "date": "2015-08-17"}, {"excerpts": ["Food:\n- salt pepper tofu was Ok\n", "- crispy chicken wings were good, they are actually sweet in sweet sauce\n- pork dumpling with corn YUM\n- shanghai soup dumpling (xia long bao) "], "author": "Vol T.", "review": "We came here on Thanksgiving day.. figuring no one else would show up LOL. There were quite a few people but we got a table right away. Thankfully because this place is super tiny. I've walked by here before and have seen the long lines outside. Also it does get very warm/hot inside so dress in layers, jacket you can take off if it's cold. \n\nService is ok. I think the young guy working was upset to have to work on turkey day LOL. But other than that food was delivered quickly, and service was efficient if not friendly. \n\nFood:\n- salt pepper tofu was Ok\n- crispy chicken wings were good, they are actually sweet in sweet sauce\n- pork dumpling with corn YUM\n- shanghai soup dumpling (xia long bao) YUM\n- garlic string beans YUM\n\nThese were more than enough for 2 people, and very cheap. We'd order any of the dumplings there, very good. I did not give them 5 stars because there is a better place just down the street.. and I really don't want to tell LOL .. ok it's House of Pancakes. Kingdom of Dumpling is good though!\n\nOh and we live downtown but take L Taraval often to go to this part of town because of the really awesome Chinese food!", "rating": 4, "date": "2013-12-03"}, {"excerpts": ["We had an order of the pork and shrimp dumpling with green chives (12), salt pepper tofu, and spicy beef tendon.\n\n", "The spicy beef tendon were a ", "just okay too - definitely not what I expected nor craving for.  ", "I wanted the hot chili beef tendon kind with the oil on the plate.  ", "This one has nuts ", "The salt pepper tofu was a big disappointment.  ", "Definitely made me regret not waiting at T-28 for them.  "], "author": "Joanna W.", "review": "I came here against my wish since T-28 was full and there was a waiting line.  The first time I came here, I remembered I had a delicious meal.  However, after this time, I will most likely not come back.\n\nThe restaurant is small with a capacity of about 25; 10 square tables - some connected for the larger groups; not clean - what do you expect from a Chinese restaurant.\n\nIt was Sunday afternoon so it was crowded.  One waitress, two cooks.  We had to wait about 15 minutes for our first dish.\n\nWe had an order of the pork and shrimp dumpling with green chives (12), salt pepper tofu, and spicy beef tendon.\n\nThe dumplings were just okay - you can't really taste the shrimp. They give you the vinegar but you need to ask for the ginger to go with it.\n\nThe spicy beef tendon were a just okay too - definitely not what I expected nor craving for.  I wanted the hot chili beef tendon kind with the oil on the plate.  This one has nuts and I'm not a big fan of nuts unless it's macadamia nuts.\n\nThe salt pepper tofu was a big disappointment.  Definitely made me regret not waiting at T-28 for them.  Unlike T-28's tofu, there was no garnish (green onion, chinese celery, white onion, etc) and the skin was cooked too much. \n\nWhile we were waiting for our dishes, the boyfriend also saw a towel burning on the stove in the kitchen.", "rating": 3, "date": "2009-10-25"}, {"excerpts": ["*Salt Pepper Tofu - seasoned just right while being crispy on the outside  and so soft inside\n", "*Chinese Spinach and Pork Dumpling - other places usually serve chive but they make it special with \"chai choy\"\n*Corn and Pork Dumpling - for my little one who likes it sweet\n", "*", "Curry Fishball - perfect sweet and spicy flavors with the fishballs chewy\n", "*Beef Stew Noodle Soup - their soup is very flavorful without too much MSG\n", "*"], "author": "Katie K.", "review": "This is my dumpling shack in SF! Their XLB or Shanghai Dumpling is decent but not better than Little Shanghai in SM.\n\nI usually order the same thing and it used to be such a routine that the owner wouldn't even need to ask me what I wanted.\n\n*Salt Pepper Tofu - seasoned just right while being crispy on the outside  and so soft inside\n*Chinese Spinach and Pork Dumpling - other places usually serve chive but they make it special with \"chai choy\"\n*Corn and Pork Dumpling - for my little one who likes it sweet\n*Curry Fishball - perfect sweet and spicy flavors with the fishballs chewy\n*Beef Stew Noodle Soup - their soup is very flavorful without too much MSG\n*Chicken Chow Mein - is tasty with shreds of chicken\n\nNote that everything taste 10x better with their special hot sauce they refuse to sell. Crossing my finger they change their minds one day.", "rating": 5, "date": "2010-01-14"}], "cold wide bean noodle": [{"excerpts": ["Got the tofu skin and cold wide bean noodle + fish dumplings and some sort of pork dumpling situation (I don't eat meat sooo idk). \n\n"], "author": "Jennifer L.", "review": "Kingdom of Dumpling, while may have some of the best dumplings in the city, the rest of your menu is mediocre at best! Came here on a Friday evening - to no crowd - luckily. Tbh, it was 30mins to the start of the Finals Game 4 though. So I don't think that's the usual wait time. \n\nHonestly, came here one other time and wasn't impressed w the food quality. But I was in the area yesterday and thought I'd give KoD another try. Went family style and ordered two apps and two types of dumplings. Got the tofu skin and cold wide bean noodle + fish dumplings and some sort of pork dumpling situation (I don't eat meat sooo idk). \n\nIf you're not aware of this, they have a sister restaurant in SSF called Dumpling Empire. And it's awesomeeee. One of my fav restaurants. Food quality over there (with the exact same menu) is by far superior to Kingdom of Dumpling. \n\nThe tofu skin app was totally mushy and over boiled. Uhhhh wth? You only have so many dishes on your menu, it shouldn't be that hard. Then the wide bean noodles seemed a bit undercooked (too chewy). Guys, swap your cooking times or something! \n\nLuckily the fish dumplings were standard. Standard as in YUM. But they're made across the street at their Kingdom of Dumpling Wholesale (literally across and one block down), sooo they really just need to boil them. Thank goodness these came out perfectly. \n\nSlather the strange looking orange sauce at the table on EVERYTHING. It's their homemade hot sauce. YUM. 3 stars for salvaging the dumplings!", "rating": 3, "date": "2017-06-10"}, {"excerpts": ["shangai soup dumpling, pork and shrimp dumpling with green chives, chicken dumpling with napa cabbage, cold wide bean noodle, farmer's cucumber, duck curry, garlic green beans.......everything was just perfect.\n\n"], "author": "miss p.", "review": "Excellent place! \nThe menu is fantastic and with some help from my Chinese foodie friends, we chose items which were very tasty and fresh and not the usual safe Chinese menu choices. \n\nGarlic pea shoots, spicy beef tendon, shangai soup dumpling, pork and shrimp dumpling with green chives, chicken dumpling with napa cabbage, cold wide bean noodle, farmer's cucumber, duck curry, garlic green beans.......everything was just perfect.\n\nThe place is tiny, service is friendly and efficient, portions are large.\n\nI do not understand why it only has 3 and 1/5 stars. This place deserves a 5!", "rating": 5, "date": "2018-01-30"}, {"excerpts": ["Cold wide bean noodle - another good starter dish with cucumber and bean noodle. ", "It has a similar flavor to the farmer's cucumber though, so I'd probably order one or the other.\n:: Pork and corn dumplings - the corn gives a nice hint of sweetness to the dumplings. ", "Very authentic. \n:: Pot stickers - the skin has a nice chewy texture, and the bottom is slightly crispy. ", "They had originally botched up this order, and they made a whole new order for us. ", "The boss paid high attention to quality! "], "author": "Audrey L.", "review": "Dare I say the soupiest shanghai soup dumplings in SF? I think so. We came around 8:30pm on a Saturday, and our table of four was seated immediately. I think we were pretty lucky, because a few other groups came after us, and they had to wait for table. \n\nAs for the shanghai dumplings, each had a huge mouthful of soup in each one. The soup to meat ratio felt like 2:1. There actually wasn't all that much meat in each dumpling; it was mostly soup! The dumpling skin wasn't especially thin, but I guess that made easier to pick up. The dumplings were served PIPING HOT, so I'd recommend letting them cool for a good few minutes before popping the whole thing in your mouth. \n\nOther good dishes were:\n:: Farmer's cucumber - classic pickled cucumber served in China. Bonus, they use ORGANIC cucumber. \n:: Cold wide bean noodle - another good starter dish with cucumber and bean noodle. It has a similar flavor to the farmer's cucumber though, so I'd probably order one or the other.\n:: Pork and corn dumplings - the corn gives a nice hint of sweetness to the dumplings. Very authentic. \n:: Pot stickers - the skin has a nice chewy texture, and the bottom is slightly crispy. They had originally botched up this order, and they made a whole new order for us. The boss paid high attention to quality! Wish they had told us this rather than wait for us to ask about it before explaining.\n\nDishes I'd pass on: \n:: Pan-Fried Buns (Sheng Jian Bao) - the bottom wasn't crispy enough, and the bread was soggy from the soup. I've definitely had better.\n:: Canned soda - not served cold, and no ice.\n\nThe boss made the whole experience that much better, because he was extremely attentive to every table -- I don't know how he did it! He heard every comment that we made, even though he was rushing around serving dishes and taking orders. He was also very friendly and constantly came back to check that we were doing well. Great service, but he could've communicated better about the pot stickers instead of waiting for us to ask about it. Awesome that they take credit card!", "rating": 4, "date": "2014-05-25"}, {"excerpts": ["Some of my favorites are: cold wide bean noodle, cilantro and bean stick salad, green chive pancake, and ", "any of the dumplings are good! ", "Overall, 2 thumbs up!"], "author": "Bianca C.", "review": "Oldie but a goodie. I used to come here all the time, but it's gotten so popular from all the Yelp reviews. Now, there's always a wait. Today, I came back after a maybe 2 year hiatus and I've forgotten how good it is! It's definitely a hole in the wall, and it's always way too hot in there because of the kitchen. But I'm never disappointed with the food. Some of my favorites are: cold wide bean noodle, cilantro and bean stick salad, green chive pancake, and any of the dumplings are good! Overall, 2 thumbs up!", "rating": 4, "date": "2016-09-09"}, {"excerpts": ["Cold wide bean noodle: it's one of those things you're like... ", "What could this possibly be? ", "It's this noodle made of mung beans ", "and it's flat and chewy, kinda like a firmer rice noodle. ", "It's doused with sesame oil, garlic, and packed with flavor. "], "author": "Amy N.", "review": "I come here all the fricken time. I absolutely love this place. Here is a breakdown of the stuff I get:\n\nAppetizers:\nCold wide bean noodle: it's one of those things you're like... What could this possibly be? It's this noodle made of mung beans and it's flat and chewy, kinda like a firmer rice noodle. It's doused with sesame oil, garlic, and packed with flavor. They're also topped with cucumber shreds for an excellent dish when it's hot out (or inside). \n\nSalt and pepper tofu: pretty good, but I've had better elsewhere. They're tiny little morsels with lots of fried outer bits and only a dash of the salt and pepper flavor. If you're into that, then this is for you. I like bigger pieces with more flavor, but that's just my preference.\n\nDumplings:\nPork and Shrimp Dumplings with Chives: super delicious if you like chives! Also, it goes great with the habanero sauce that they have on the table (it's that orange thing) if you're into hot sauce. I've been trying to get them to bottle that stuff for years, but they won't do it. (Sad for me.) They make that sauce fresh every week, but I digress.\n\nShanghai Soup Dumplings: flavorful and soupy, but they come out super hot, so watch your tongue or you might get burned.\n\nVegetarian Dumplings: for friends that don't eat meat, I'd wish they put more variety in these dumplings, like ginger, woodear mushrooms, or shiitake mushrooms, but they mostly consist of cabbage. They're nice and crunchy though, and vegetarians won't complain about having a dumpling option. :)\n\nOther:\nGarlic string bean: the texture is firm and it's a staple every time I come. I will never come here to not get this. It's a mix of soy, garlic, and magic. It's delicious. If you ever look around the restaurant, you'll see that half of the people will order this.\n\nShanghai Donut: \nA light and flaky bun with sesame seeds on top, filled with ground up, sweet, black sesame filling. It's delicious and there's two in every order. One for you and one for a friend. The perfect snack to end the dinner!", "rating": 5, "date": "2015-11-05"}, {"excerpts": ["also, big fan of the cold wide bean noodle. ", "somewhat on the salad side, served with a tangy soy sauce. "], "author": "Ben T.", "review": "I love their lamb and veggie dumplings. They're fairly spectacular when you compare them to the very ordinary pork and chive dumplings, which taste like the same stuff you've probably had all your life. \n\nXLB is decent, and so is the pan-fried soup dumpling. also, big fan of the cold wide bean noodle. somewhat on the salad side, served with a tangy soy sauce. prices are on the higher side for chinese food, but the quality is good.\n\nthis place is tiny. can't be more than 20ish seats inside. if the place is packed, try dumpling kitchen down the street, also on taraval.", "rating": 4, "date": "2011-09-12"}], "spicy beef tendon": [{"excerpts": ["We ordered xiao long bao, pork dumpling with green chives, spicy beef tendon, sesame bean cures, Shanghai pan fried soup dumpling and sesame pancake with marinated beef.   ", "The pork dumpling skin was thicker and very little meat;  some bean cures were soft and some were chewy; the size of shanghai pan fried dumpling was smaller, almost like the size of xiao long bao.  ", "The spicy beef tendon was too salty to eat.\n\n"], "author": "Jane B.", "review": "Did this place change ownership recently?  We used to come here regularly so we are very familiar with their dishes.  Service used to be better too.  \n\nWhen we went today, we noticed the menu and interior were slightly different  Their once famous dishes recommended on the wall were gone.  We ordered xiao long bao, pork dumpling with green chives, spicy beef tendon, sesame bean cures, Shanghai pan fried soup dumpling and sesame pancake with marinated beef.   The pork dumpling skin was thicker and very little meat;  some bean cures were soft and some were chewy; the size of shanghai pan fried dumpling was smaller, almost like the size of xiao long bao.  The spicy beef tendon was too salty to eat.\n\nThe waitress was rude, when we asked for the tea be refilled or more napkin or an extra pair of chopsticks, she didn't respond.  She just kept walking, we didn't know if she heard us.  For the napkin, she did not put it on the table; she was more like a casino dealer serving you a card (napkin) on the table. \n\nWhen we arrived, we were surprised that there was no line unlike before.  All in all, this is a place we won't return and don't recommend.", "rating": 1, "date": "2018-09-13"}, {"excerpts": ["Ma La Niu Jin (spicy beef tendon) ", "- It's the best tendon dish I've had. ", "It's thinly sliced to perfection and easy to eat. "], "author": "Nancy W.", "review": "This is a classic hole in the wall Chinese restaurant. It is cramped and warm from the fire in the kitchen and I love it so so much! As with many Chinese restaurants, they excel at certain dishes and the rest is mediocre.  I've eaten here at least once every other month for many years and I still love it. Their orange hot sauce is house made mouthwatering. If you want to have more Kingdom of Dumpling in your life, you can walk down the street to their wholesale and buy bags of dumplings from their freezers. \n\nHere's the tasty bites you should try!\n\nAppetizers: \n\nMa La Niu Jin (spicy beef tendon) - It's the best tendon dish I've had. It's thinly sliced to perfection and easy to eat. I've fed it to many unsuspecting, unadventurous eaters who loved it. \n\nTofu noodle with cilantro - It's a very simple dish. It's light, fresh and satisfying.\n\nCong you bing (green onion pancake) - It's delicious and crunchy. I make it at home so I don't usually buy it, but it's great. \n\nDumplings:  \n\nMy favorite are the lamb dumplings and pork with chive. The rest are amazing as well, although I would not recommend the fish dumplings or the vegetarian dumplings since the filling texture is too mushy. \n\nSheng jian bao - pan fried buns with soup are excellent. I don't think they're listed in the menu but they always have them! \n\nDon't get their xiao long bao (soup dumplings). Often times they soup has already drained out of them and the skins are a little too thick. Stick with the dumplings and walk down the street to Dumpling Kitchen for your XLB. \n\nMains: \n\nFried string beans are delicious. You may feel like you're making a healthy choice by eating green beans but these babies are definitely pan fried in a thick layer of oil before they make it out to your plate. \n\nEnjoy!", "rating": 5, "date": "2017-06-14"}, {"excerpts": ["Garlic pea shoots, spicy beef tendon, "], "author": "miss p.", "review": "Excellent place! \nThe menu is fantastic and with some help from my Chinese foodie friends, we chose items which were very tasty and fresh and not the usual safe Chinese menu choices. \n\nGarlic pea shoots, spicy beef tendon, shangai soup dumpling, pork and shrimp dumpling with green chives, chicken dumpling with napa cabbage, cold wide bean noodle, farmer's cucumber, duck curry, garlic green beans.......everything was just perfect.\n\nThe place is tiny, service is friendly and efficient, portions are large.\n\nI do not understand why it only has 3 and 1/5 stars. This place deserves a 5!", "rating": 5, "date": "2018-01-30"}, {"excerpts": ["Started off with the spicy beef tendon which was spicy and okay.\n\n"], "author": "Derek S.", "review": "Came by for brunch the other day as Yelpers claim that this is \"the\" spot for dumplings in the City...\n\nThe restaurant is non-nondescript and parking is on the street only. Upon arrival, shortly before 12, we were immediately seated inside the hot and steamy restaurant...\n\nStarted off with the spicy beef tendon which was spicy and okay.\n\nMoved on to the beef pancake which was the highlight of the meal with the contrasting crispy pancake with the soft beef.\n\nThe Xlbs were mediocre as the meat was rather coarse and the skin was on the thick side...Cooking Papa's has better xlbs...\n\nMoved on to the garlic string beans which were okay, but came out as a small potion.\n\nLastly, we had the XO sauce beef chow fun. ...the dish didn't seem like it had any XO sauce in it..\n\nService was okay and they accept Visa/MC over $15.", "rating": 3, "date": "2012-08-25"}, {"excerpts": ["Next time I'll try their spicy beef tendon and stuffed pancake"], "author": "Yanakon D.", "review": "Their $5 coupon with $35 purchase is from 2013 and doesn't work anymore. My friend made a call tonight before we went to the restaurant.\n\nThe food were quick and tasty. \nBaby Bok Choi in garlic sauce, marinated cucumber, Xiao Long Bao and cabbage and pork dumplings, everything was great!!! \n\nNext time I'll try their spicy beef tendon and stuffed pancake", "rating": 4, "date": "2014-12-24"}, {"excerpts": ["That's all that matters :) we always order 2 orders of their soup dumplings & spicy beef tendon for sure. "], "author": "Joann W.", "review": "This place is soo bomb. Very tiny, but food's great!! That's all that matters :) we always order 2 orders of their soup dumplings & spicy beef tendon for sure. And we order whatever we feel like eating at the time.\n\nSoo yeah. Go try it out!\nPS: their orange hot sauce on the table is homemade. It's sooo good!", "rating": 5, "date": "2014-07-09"}, {"excerpts": ["We ordered the tofu noodles, spicy beef tendon, SLB of course and pork/chicken dumplings. ", "Everything was delicious. ", "The tendon was soft and the cilantro really added something extra. ", "The SLB was soft and the soup stayed in perfectly. "], "author": "Hev Z.", "review": "People are not kidding about this place being small, so when I say it's small, it's small. There might be a wait. But don't let the size of this place fool you, the food here is mouth watering.\n\nI came here with a couple buddies for lunch. We ordered the tofu noodles, spicy beef tendon, SLB of course and pork/chicken dumplings. Everything was delicious. The tendon was soft and the cilantro really added something extra. The SLB was soft and the soup stayed in perfectly. You can tell that they really put time and effort in making their dumplings here because you can obviously taste it.\n\nI will definitely be coming back to this place. Highly recommended. If only they had a bigger restaurant.. one can dream..", "rating": 4, "date": "2015-01-01"}, {"excerpts": ["We ordered XLBs, pork and shrimp dumplings, string beans, chives \"boxes\" pancakes and spicy beef tendon to share. ", "The beef tendon hit the spot -- it was spicy, numby, and shaved really thinly, with a generous serving of cilantro. ", "The pork and shrimp dumplings were very delicious as well, with fresh fillings and not-too-thin chewy skin. ", "However, the XLBs that everyone raves about are not as good as I had expected. ", "While the filling was great and there was plenty of soup, the skin was on the thick side. ", "I think Yang Sing still does it better, but at a price premium. "], "author": "Alice C.", "review": "5 stars for the food, but 2 stars for the environment.\n\nThis is a hole-in-the-wall joint with a whole lot of people waiting for a table on a Saturday night. They have very little space, but only around 6-8 tables, and they don't take reservations. If you want to get your hands on the yummy dumplings, you gotta get here early or at least snack a bit so you don't faint while waiting.\n\nIt is quite crowded in the restaurant, so don't expect to sit very comfortably. The decor looks like they haven't done much to it, and it's not very clean looking. Perhaps not a great place for a romantic date ;)\n\nWe ordered XLBs, pork and shrimp dumplings, string beans, chives \"boxes\" pancakes and spicy beef tendon to share. The beef tendon hit the spot -- it was spicy, numby, and shaved really thinly, with a generous serving of cilantro. The pork and shrimp dumplings were very delicious as well, with fresh fillings and not-too-thin chewy skin. However, the XLBs that everyone raves about are not as good as I had expected. While the filling was great and there was plenty of soup, the skin was on the thick side. I think Yang Sing still does it better, but at a price premium. The chive pancakes are not that great though, and as for the string beans...let's say I still haven't found anyone that does it right in the bay area.\n\nThe owner is super nice, and he even announced that if there is no soup in the XLBs he will put in another order for free. I understand that San Franciscans like to queue up for their favourite restaurants, but the restaurant could use a little interior upgrade.", "rating": 4, "date": "2013-02-14"}, {"excerpts": ["We always get Pork and corn dumplings, the shanghai soup dumplings, and either the spicy beef tendon or the salt and pepper tofu. ", "Its just so good and on top of all that the spicy orange sauce mixed with the soy sauce they give us is the best. \n", "The owner is always attentive and greets everyone when he walks in the restaurant. ", "He makes sure that we are always taken care of :) \n", "The place is actually really small so when its around lunch or dinner expect it to be crowded and hot inside. ", "They usually leave the door open so its not too bad. \n", "We honestly come here all the time and they never disappoint with the dumplings :D ", "Its not even that expensive either so it wont burn a hole in your wallet."], "author": "Vanessa L.", "review": "Me and my boyfriend come here all the time and its delicious! We always get Pork and corn dumplings, the shanghai soup dumplings, and either the spicy beef tendon or the salt and pepper tofu. Its just so good and on top of all that the spicy orange sauce mixed with the soy sauce they give us is the best. \nThe owner is always attentive and greets everyone when he walks in the restaurant. He makes sure that we are always taken care of :) \nThe place is actually really small so when its around lunch or dinner expect it to be crowded and hot inside. They usually leave the door open so its not too bad. \nWe honestly come here all the time and they never disappoint with the dumplings :D Its not even that expensive either so it wont burn a hole in your wallet.", "rating": 5, "date": "2015-08-20"}, {"excerpts": ["Next time I would love to try the Pan Fried Soup Dumplings, Green Onion Pancakes, Beef Pancake, Spicy Beef Tendon, and more dumplings. ", "Thanks to Hube and Jonathan for treating me to dinner. ", "I would love to have our group to meet here again."], "author": "Daniel L.", "review": "Thanks to Jason G's recommendation, a group of us came to this Shanghai dumpling house for dinner that included fellow Yelpers Fia R, Hube N, Janice S, Jonathan W, Wanugee N. This restaurant is only slightly bigger than a walk-in closet. The nondescript squared interior was stacked with small tables leaving very little elbow room for anyone to maneuver. The atmosphere was very festive as there was a long line of people waiting outside for a table. The servers seemed to be working on a frantic mode, and they were very kind to offer us hot tea as we looked on and drooled until seating became available for our group.\n\nWe shared Pork Dumplings with Corn (12/$6.95), Pork Dumplings with Spinach (12/$6.95), Shanghai Soup Dumplings/XLB (6/$4.95), Pork & Shrimp Dumplings with Chives (12/$6.95), Beef Stew Noodle Soup ($6.95), and String Beans ($6.95). Everything we had was outstanding and 5 stars quality. The ingredients that were used were fresh and the dumpling wrappers were spongy, flavorful, and came with a good bite. Excellent wrappers! The fillings were robust and not skimpy with the right balance of ingredients and great flavor. Furthermore, the Shanghai Soup Dumplings came with juicy squirts of flavorful broth until the rest of the steaming meaty dumpling collapse into the taste buds. From dumpling to dumpling, each bite was very consistent.\n\nI also enjoyed the Beef Stew Noodle Soup tremendously. The broth was light, flavorful and the thickness and texture of the noodles reminded me of the street vendors of Taiwan. I still prefer the same dish at Din Tai Fung, but I would not hesitate to order their Beef Noodle Soup again. As a string bean snob, I initially had under estimated this dish but it turned out perfect. The texture was stir fried to dry and there was wonderful flavor coming from the string beans itself. It was obvious that the chef knows a thing or two about the art of wok too in addition to their delicious dumplings. I was thrilled.\n\nI was torn between a 4 or 5-stars for the rating since I thought the service was very rushed and not attentive after our food arrived at the table. I also wished I could have more ginger to complement the soy sauce and dumplings, so those who are interested shouldn't expect too much from the service when dining here. Instead, their strength is at providing our group with taste and value that comes with a good price tag. All of us left the restaurant full and satisfied. Next time I would love to try the Pan Fried Soup Dumplings, Green Onion Pancakes, Beef Pancake, Spicy Beef Tendon, and more dumplings. Thanks to Hube and Jonathan for treating me to dinner. I would love to have our group to meet here again.", "rating": 4, "date": "2011-09-09"}, {"excerpts": ["My friends and I always get their spicy beef tendon which is a perfect appetizer to share between two or three people. ", "Their XLB (1 order = 6 dumplings) are always fresh and their soy sauce vinegar goes perfectly with it. ", "I tend to overdo it by ordering an order of XLB and another order of chicken and corn dumplings. ", "With other dumplings, they say they'll give you 12, but they often go over one or two so you end up with 13 or 14. ", "Hey, I'm not complaining. ", "Usually two orders of XLB are good enough for me. "], "author": "Tram H.", "review": "Kingdom of dumpling is ALWAYS a MUST whenever I come up to San Francisco. I crave for dumplings all the time thanks to this place.\n\nThere is always about a 12-20 minute wait whenever I go because, it's a pretty small space. To me, it is all worth the wait for dumplings and spicy tendon for cheap and reasonable prices too!\nMy friends and I always get their spicy beef tendon which is a perfect appetizer to share between two or three people. Their XLB (1 order = 6 dumplings) are always fresh and their soy sauce vinegar goes perfectly with it. I tend to overdo it by ordering an order of XLB and another order of chicken and corn dumplings. With other dumplings, they say they'll give you 12, but they often go over one or two so you end up with 13 or 14. Hey, I'm not complaining. Usually two orders of XLB are good enough for me. I also love chicken wings, but their chicken wings however were nothing special, just honey glazed wings. \n\nThe service is also super friendly which puts you in a good mood after waiting so long for a table and sitting in a cramped space. It also gets pretty hot inside because the kitchen is literally steaming 24/7. Overall, kingdom of dumpling has yet to disappoint! Which is why I come here any chance I get ^_^", "rating": 5, "date": "2014-08-03"}, {"excerpts": ["Try the beef pancake (yumm), string beans, noodles, lamb skewer, Shanghai soup dumpling, spicy beef tendon (my list can go on and on)...as for dessert the sesame bun is sooo good! \n\n"], "author": "Em Z.", "review": "Hmmm...where should I start....\nIf you want delicious homemade dumplings for a really good price then run to here!!\nI can not express how much I love this place. I was born in Beijing and I always ate dumplings growing up but after I moved to the states I always craved for homemade dumplings but no place made it right... until one day I came across Kingdom of dumpling!!!!\nThe dumplings here are really juicy and the skin has the perfect texture! My favorites are the lamb, corn and pork, and if you are vegetarian try out the chives with eggs. \nAll the other food here is really good too. Try the beef pancake (yumm), string beans, noodles, lamb skewer, Shanghai soup dumpling, spicy beef tendon (my list can go on and on)...as for dessert the sesame bun is sooo good! \n\nThe wait can be a pain in the...yeah. Don't come here during lunch or dinner time. I usually go a bit earlier to avoid the long wait. The restaurant is really really small..it's a very whole in the wall restaurant so don't expect anything fancy or nice (except the food). The owner is super nice and if you make friends with him, he will give you complimentary desserts ;)\n\nOh and they have a separate store that makes dumplings there, you can always purchase it frozen and bring it home to cook...it tastes exactly the same and it's a bit cheaper too! \n\nEnjoy!", "rating": 5, "date": "2014-06-09"}, {"excerpts": ["In addition to the xiao long baos, we also ordered pork and chive dumplings, spicy beef tendon & beef pancakes.  "], "author": "Cindy L.", "review": "Came in on a Tuesday evening around 6PM and there were already a good number of people here.  First off, you'll notice how small the space is, there's about 8 small tables (made for 2-4) in this place and the kitchen is separated from the dining area by a small wall.  I'm sure on busier days it can get pretty steamy in there.\n\nWe were seated right away and were brought tea.  I already knew what I wanted to order, XIAO LONG BAO (soup dumplings).  But they definitely had an extensive menu.  In addition to the xiao long baos, we also ordered pork and chive dumplings, spicy beef tendon & beef pancakes.  I really wanted the sheng jian baos (soup dumplings, but FRIED), but was told those would take 30 minutes, I was really disappointed; those are even rarer to come by in the states than xiao long baos.\n\nAfter ordering, we were given small sauce bowls of vinegar & ginger (?).  And our food came out in about 5 minutes, the chive and pork dumplings took the longest to come out, about 10 minutes.  The beef tendons were tasty - thinly sliced tendon, and it wasn't too spicy at all.  The pork and chive dumplings were good as well, I enjoyed them.  The xiao long baos were definitely the stars of the meal, delicious, a must if you come!  The beef pancakes definitely filled me up, pan-fried and huge. My friend and I couldn't even finish it, but that was probably we stuffed ourselves full of dumplings first.  And the hot sauce is definitely spicy, so beware!\nTook me a while, but I finally made it to Kingdom of Dumplings, and I'm so glad that I did.  All of that for under $30, amazing.", "rating": 5, "date": "2014-02-26"}, {"excerpts": ["We started off with a plate of spicy beef tendon and a bowl of beef stew noodle soup.  ", "First came the beef tendon.  ", "The spiciness was not overpowering like some other I had elsewhere, just enough numbing heat to remind you that you are eating northern Chinese food.  "], "author": "Harvey K.", "review": "This little restaurant definitely packs some big flavor!  Dumpling fans, rejoice!!\n\nMy buddy and I came here hungry a couple weeks ago and ordered a ton of food.  We started off with a plate of spicy beef tendon and a bowl of beef stew noodle soup.  First came the beef tendon.  The spiciness was not overpowering like some other I had elsewhere, just enough numbing heat to remind you that you are eating northern Chinese food.  The beef stew noodle soup was decent, although we thought the broth could have been hotter.  \n\nAnd now the main event...LET\"S GET READY FOR DUMPLINGS!!!!!  Let just say we were not disappointed one bit.  The xiao long bao was probably one of the best I've had in the whole Bay Area.  They were hot and juicy.  Some may think it's a little greasy, but who cares?  The two orders of boiled dumplings (pork/chive and pork/shrimp/chive) carried some well balanced flavors.  Some may think there's not enough meat in the dumplings, but to me the meat/chive ratio is proportionate.  We also had an order of sheng jian bao (pan fried).  They were very tasty also.\n\nThe total bill came to about $40.  Not bad for two hungry dudes.  If you crave Chinese dumplings, this is the place for you!", "rating": 4, "date": "2011-12-15"}, {"excerpts": ["I was most excited to have found spicy beef tendon on the menu, even more when it appeared before my eyes. ", "Beef tendons cooked in soy sauce, rock sugar and anise seed, chilled then thinly sliced. "], "author": "Fiona S.", "review": "It's not a figurative speech when they called Kingdom of Dumplings a hole-in-the-wall joint. Hidden far away in Park Side, without the sign and the line of people waiting in the from, it could easily been mistaken for some sort of elevated basement. Despite being tightly packed into the square room, the patrons waited patiently to be served, as the late afternoon shined through the front windows.\n\nI was most excited to have found spicy beef tendon on the menu, even more when it appeared before my eyes. Beef tendons cooked in soy sauce, rock sugar and anise seed, chilled then thinly sliced. It is then mixed with chili oil, garlic, pepper, chopped cilantro and sesame oil.\n\nThe tendons see-through when picked up. It was cold and refreshing at first, the texture gelatinous but on the chewy side. Chopped up cilantro brought a nice aroma that erased any unwanted fattiness. Then - as we sat and ate, before we knew it, the stealthy numbing spice hit us. Like wild fire it spread through our mouth, making us sweat yet unable to stop going for more.\n\nAs for the dumplings, you could really taste the hand-knead dough. Thicker than the store-bought, machine-made ones, the dumpling skin was thicker and a chewier, the perfect kind that holds the stuffing together. Inside, ground pork and cabbage made a great pair - juicy, sweet, with a nice crunch from the green veggie. A light dip in black vinegar and some ginger slices gave a rounded taste.\n\nNext up, the tiao long bao. These dumplings were steamed instead of boiled. Enveloped within is a pork filling, prepared with solid pork aspics that melted into the tasty broth when heated. Because of the hot soup that could burst at the bite, it was recommended that we open up the dumplings a bit to let it cool before eating.\n\nUmami was its profile. The broth was on the greasier side, but tasty nonetheless. It provided a whole different experience next to the spicy tendon and the boiled dumplings - which were felt like a hugely satisfying, working man's meal. The soup dumpling, despite its thicker skin, felt delicate and gentle. To my tummy that was happy, that went for a long sigh and said: What. A. Day.", "rating": 4, "date": "2011-07-23"}, {"excerpts": ["We started off with the spicy beef tendon and a plate of the fungus with cucumber. ", "I loved the tendon which was marinated perfectly, but found the fungus (wood ears) a bit bland. "], "author": "Lydia W.", "review": "I was amazed that we didn't have to wait for a table (for 3) at noon on a Sunday! \n\nKingdom of Dumpling is a tiny restaurant that doesn't try to look fancy, but you just know will be delightful. \n\nWe started off with the spicy beef tendon and a plate of the fungus with cucumber. I loved the tendon which was marinated perfectly, but found the fungus (wood ears) a bit bland. Definitely could be tastier.\n\nWe ordered the xiao long bao, which were absolutely delicious. \n\nAs far as dumplings go, we got a chicken with napa cabbage, and then a pork, shrimp and chinese veggie one. There are 12 dumplings per order. They are so good with the orange hot sauce, or even the vinegar/ginger combo. \n\nI really enjoyed finally getting to try this place and would highly recommend it for some wholesome Chinese food.", "rating": 4, "date": "2013-03-06"}, {"excerpts": ["This time around, the 5 of us ordered several dishes ranging from the Spicy Beef Tendon (definitely recommended!) to the Shanghai Style Donut ", "(Just okay...) to the dumplings (recommended!).  "], "author": "Allan H.", "review": "Wow, what a difference 5 years makes!  From my 3* review back in 2007 to this past weekend, the dumplings and service have evolved!  This time around, the 5 of us ordered several dishes ranging from the Spicy Beef Tendon (definitely recommended!) to the Shanghai Style Donut (Just okay...) to the dumplings (recommended!).  Everything came out quickly and was quite tasty, although the service left something to be desired.  \n\nIssues: \nWe had to ask 3 times for water before we actually got any.  \nWe had called to make a reservation, but they had no actual reservation for us when we arrived.\nThey had the offer for free pancake/bag of dumplings on the wall but refused to offer it despite it being advertised.\n\nOther than those three things above, I think I would return here again.", "rating": 4, "date": "2013-01-07"}, {"excerpts": ["For appetizers, I got the spicy beef tendon and onion pancake. ", "The tendons were okay, I was expecting it to be large chunks instead of thinly sliced pieces. ", "The onion pancakes were so addicting! ", "Not too oily or floury tasting, just right. ", "For the main dishes, I knew I had to try their shanghai soup dumplings, but they were nothing special. ", "Now for the actual dumplings, there were so many different kinds to choose from! ", "I tried the pork dumplings with corn. ", "Sooooo mouth watering and juicy", ".. thinking about it makes me want more!! ", "I like trying dishes from different sections of the menu, so I went with the pork dumping with chinese spinach in QQ noodles. ", "ALL the dumplings tasted fantastic and I can't wait to come back and try the other ones!"], "author": "Athena W.", "review": "This restaurant is very small, about 8-10 tables. If you plan on coming with a group of more than 4 people, expect to wait for awhile. I've been wanting to try this place out for some time now and every time I come here all the tables are full. Luckily today when I came in, a table was just leaving so no wait for me yay!\n\nThe food was so delicious. For appetizers, I got the spicy beef tendon and onion pancake. The tendons were okay, I was expecting it to be large chunks instead of thinly sliced pieces. The onion pancakes were so addicting! Not too oily or floury tasting, just right. For the main dishes, I knew I had to try their shanghai soup dumplings, but they were nothing special. Now for the actual dumplings, there were so many different kinds to choose from! I tried the pork dumplings with corn. Sooooo mouth watering and juicy.. thinking about it makes me want more!! I like trying dishes from different sections of the menu, so I went with the pork dumping with chinese spinach in QQ noodles. ALL the dumplings tasted fantastic and I can't wait to come back and try the other ones!", "rating": 4, "date": "2011-12-11"}, {"excerpts": ["And beef pancake \nAnd spicy beef tendon\n", "And pan fried xio lung bao\n"], "author": "C C.", "review": "If everyone says so it must be true...\nAMAZING xio lung bao!!!\nAnd beef pancake \nAnd spicy beef tendon\nAnd pan fried xio lung bao\nAnd radish cakes\n\nP.s. I think It also has alot to do with the hot suace!!!", "rating": 5, "date": "2012-11-27"}, {"excerpts": ["Spicy Beef Tendon\n5. "], "author": "Pearl L.", "review": "This is my favorite Chinese place in the city. Been here on multiple occasions with family, and friends. My brother liked this place so much, we had his birthday dinner here!\n\n\nAMBIANCE:\n1. This is not a fancy place! Just a typical hole-in-the-wall restaurant. Waiters are not rude, but they're not super attentive either.\n2. It is a COZY restaurant. Best for groups of 4 or less. \n\nFOOD - Make sure to get:\n1. the XLB and lots of it!!!!!!!! You're crazy if you don't.\n2. Garlic String Beans\n3. Chive Pancake or Beef Pancake\n4. Spicy Beef Tendon\n5. Lamb Skewers\n\nAlso try their hot sauce.", "rating": 5, "date": "2011-11-03"}, {"excerpts": ["Spicy beef tendon ", "- This dish turned out to be a lot different than I expected. ", "For some reason I thought there would be meat on this. ", "Nope. ", "Straight up tendon. ", "Thought it would be chunky tendon-ish but came out chopped up. \n", "3. ", "Shrimp and pork dumplings. ", "The better of the two dumpling dishes. ", "Dumplings were okay. ", "Not exceptional. \n4. ", "Chicken with spinach dumplings."], "author": "Michael K.", "review": "Visited Kingdom of Dumpling at 6pm and avoided the dinner rush.  I was excited to try this place out after getting a recommendation many times. \n\nOrdered the \n\n1. Onion pancakes. Light and relatively chewy.  \n2. Spicy beef tendon - This dish turned out to be a lot different than I expected. For some reason I thought there would be meat on this. Nope. Straight up tendon. Thought it would be chunky tendon-ish but came out chopped up. \n3. Shrimp and pork dumplings. The better of the two dumpling dishes. Dumplings were okay. Not exceptional. \n4. Chicken with spinach dumplings.", "rating": 3, "date": "2011-09-01"}, {"excerpts": ["We had an order of the pork and shrimp dumpling with green chives (12), salt pepper tofu, and spicy beef tendon.\n\n", "The spicy beef tendon were a ", "just okay too - definitely not what I expected nor craving for.  ", "I wanted the hot chili beef tendon kind with the oil on the plate.  ", "This one has nuts ", "The salt pepper tofu was a big disappointment.  ", "Definitely made me regret not waiting at T-28 for them.  "], "author": "Joanna W.", "review": "I came here against my wish since T-28 was full and there was a waiting line.  The first time I came here, I remembered I had a delicious meal.  However, after this time, I will most likely not come back.\n\nThe restaurant is small with a capacity of about 25; 10 square tables - some connected for the larger groups; not clean - what do you expect from a Chinese restaurant.\n\nIt was Sunday afternoon so it was crowded.  One waitress, two cooks.  We had to wait about 15 minutes for our first dish.\n\nWe had an order of the pork and shrimp dumpling with green chives (12), salt pepper tofu, and spicy beef tendon.\n\nThe dumplings were just okay - you can't really taste the shrimp. They give you the vinegar but you need to ask for the ginger to go with it.\n\nThe spicy beef tendon were a just okay too - definitely not what I expected nor craving for.  I wanted the hot chili beef tendon kind with the oil on the plate.  This one has nuts and I'm not a big fan of nuts unless it's macadamia nuts.\n\nThe salt pepper tofu was a big disappointment.  Definitely made me regret not waiting at T-28 for them.  Unlike T-28's tofu, there was no garnish (green onion, chinese celery, white onion, etc) and the skin was cooked too much. \n\nWhile we were waiting for our dishes, the boyfriend also saw a towel burning on the stove in the kitchen.", "rating": 3, "date": "2009-10-25"}, {"excerpts": ["Start off with the spicy beef tendon and garlic string beans, and of course the shanghai soup dumpling ( each order comes with 6, that's definitely not enough ) ", "So I always get two orders ! ", "And if I have room for dessert, I definitely wont forget about the sesame pancakes !! ", "Ive been to many shanghai dumping places but nothing ever came close to this! ", "but I do wish they had more room in the restaurant, because it could get very stuffy on hot days... ", "I mean im sure they make enough money for a two story restaurant by now ! ", "lol !"], "author": "Annie Y.", "review": "Yes, I come here almost everyday or at least once a week. Its very close to where I live . I order the same meal every time. Start off with the spicy beef tendon and garlic string beans, and of course the shanghai soup dumpling ( each order comes with 6, that's definitely not enough ) So I always get two orders ! And if I have room for dessert, I definitely wont forget about the sesame pancakes !! Ive been to many shanghai dumping places but nothing ever came close to this! but I do wish they had more room in the restaurant, because it could get very stuffy on hot days... I mean im sure they make enough money for a two story restaurant by now ! lol !", "rating": 4, "date": "2013-07-18"}, {"excerpts": ["Try spicy beef tendon and lamb dumplings. ", "I can't say enough praises to their food."], "author": "Try E.", "review": "I love this place. It's a tiny establishment but it is always packed. This is for a reason. The food is amazing, fresh and great tasting. \nTry spicy beef tendon and lamb dumplings. I can't say enough praises to their food.", "rating": 5, "date": "2011-07-26"}, {"excerpts": ["You will love the spicy beef tendon, mixed with peppercorn, chilli, and cilantro. ", "I've never been to a place that slices them so perfectly. "], "author": "Geo D.", "review": "Next time, I'm going to eeny meeny miny mo the menu so that I don't choose the same items. Any German head cheese lovers out there? You will love the spicy beef tendon, mixed with peppercorn, chilli, and cilantro. I've never been to a place that slices them so perfectly. Anyways, you dip it in the vinegar soy sauce and it's heaven! \n\nSome places marinate the tendons with a lot of chilli oil but this place doesn't.  I actually think it's better that they don't because the tendons are slighly oily. \n\nThe soup dumplings had the right amount of juice in them. The dumpling skin was tougher this time but it was still good. \n\nIf I ever figure out how to reverse engineer the orange chilli sauce, I'm going to dump it on everything I eat!", "rating": 4, "date": "2011-02-21"}, {"excerpts": ["We also ordered their cucumber and spicy beef tendon for appetizers.  "], "author": "Yun W.", "review": "This place is definitely petite, there are literally only six tables crammed inside what appears to be the size of my living room. Bundle up before you head to Kingdom of Dumplings because you will be waiting out in the cold.  \n\nNow on to the main event: dumplings.  The dumplings are good, I wouldn't say spectacular.  These homemade dumplings are filled with a variety of meats.  A plus is they do know how to make good dumpling skin (not too thin where it will puncture, but not too thick where it overwhelms the dumpling).  We ordered the lamb and their signature napa cabbage and pork dumplings.  Both were good, the technicality was definitely there with the meat being juicy and the skin retaining that heat.  But the taste, well, it just didn't wow me.  We also ordered their cucumber and spicy beef tendon for appetizers.  The beef tendon was really salty, but the cucumbers were very fresh and have some garlic drizzled with some soy sauce.  \n\nOne of our servers, who I assume is the owner, wasreally friendly and liked to push us to add more dishes, very slick salesman indeed.  \n\nOverall, Kingdom of Dumplings is good, but I must have been spoiled by some amazing dumplings made by my family, so I think they have already set the bar for me.  I will come back though, and hopefully try other items on the menu.", "rating": 3, "date": "2010-02-19"}, {"excerpts": ["They also serve onions pancakes (just like Mom used to make), pig ear, tofu \"noodles\" with cilantro and sesame oil, spicy beef tendon.  ", "It's a tiny hole in the wall.  ", "Stopped by last week and they were closed for renovations!  ", "Oh No!!!  ", "(I love hole in the wall places with excellent food)   ", "Luckily, their sister restaurant, King of Noodle on Irving and !", "8th was open.  ", "If you want it to go, it's better to get the fresh frozen dumplings and boil them at home.  ", "Enjoy!"], "author": "Kathy H.", "review": "Excellent fresh made authentic Chinese dumplings!   The owner carried in a huge tray of raw dumplings from home that had \"just made by Wai Poa\" written all over it.  Over twenty different types of \"water dumplings\".   Pork with chive, pork with Napa cabbage, chicken with corn (a hit with the kids), shrimp with chives, lamb.\nToo many to list.  They also serve onions pancakes (just like Mom used to make), pig ear, tofu \"noodles\" with cilantro and sesame oil, spicy beef tendon.  It's a tiny hole in the wall.  Stopped by last week and they were closed for renovations!  Oh No!!!  (I love hole in the wall places with excellent food)   Luckily, their sister restaurant, King of Noodle on Irving and !8th was open.  If you want it to go, it's better to get the fresh frozen dumplings and boil them at home.  Enjoy!", "rating": 4, "date": "2010-08-02"}, {"excerpts": ["Ordered quite a few different dumplings and spicy beef tendon.  ", "The Lamb Dumplings were actually good, and so were the tendons.  ", "The Shanghai soup dumplings were very good.  ", "A good amount of soup inside, soft and delicate skin, the meatball inside was small but it was still good.  ", "You can get some dumplings pan fried or steamed, which I thought was pretty cool. ", "I forget the other dumplings we ordered but it was good.  ", "Ordered 2 of the same, one steamed and one pan fried.  "], "author": "Marvin C.", "review": "The dumplings were indeed very good.  Ordered quite a few different dumplings and spicy beef tendon.  The Lamb Dumplings were actually good, and so were the tendons.  The Shanghai soup dumplings were very good.  A good amount of soup inside, soft and delicate skin, the meatball inside was small but it was still good.  You can get some dumplings pan fried or steamed, which I thought was pretty cool. I forget the other dumplings we ordered but it was good.  Ordered 2 of the same, one steamed and one pan fried.  Both very good.\n\nIt's a small place, seats maybe 15 max.  I'm going to assume it used to be a garage since its operating under a house.  When we got there (party of 4) we had to wait outside because there wasn't a table big enough for us, but luckily people were leaving.  So if it was a busy day, there will definitely be a wait (and I don't know how busy it can get.. seems like it can get busy)\n\nPrice was decent for what you get.  Bill came to be about $46.  It was pretty worth it.  The waiter was friendly.  Yeah, it looks a little run down, but I think it's worth it.  I would definitely go here again.", "rating": 3, "date": "2008-08-29"}], "sesame bean cake": [], "spicy bean cake": [], "cold bean cake": [], "fresh cilantro salad": [{"excerpts": ["Every time I come here, I always order the same stuff: Farmer's Cucumber, Fresh Cilantro Salad with Bean Stick, Beef Pancakes, Pork Dumplings with Chives, and Lamb Dumplings.  ", "SOOOO GOOD!  ", "I know this place is probably violating all sorts of health codes, but if you don't look in the kitchen, the filth is not there!"], "author": "Janny S.", "review": "Total hole in the wall restaurant and I love it!  It literally feels like I'm eating in someone's living room.  It's pretty cramped, but its all worth it.  Every time I come here, I always order the same stuff: Farmer's Cucumber, Fresh Cilantro Salad with Bean Stick, Beef Pancakes, Pork Dumplings with Chives, and Lamb Dumplings.  SOOOO GOOD!  I know this place is probably violating all sorts of health codes, but if you don't look in the kitchen, the filth is not there!", "rating": 4, "date": "2010-11-10"}], "fresh cilantro bean stick": [], "fresh cilantro bean noodle": [{"excerpts": ["The Fresh Cilantro Bean Noodle was one of their specialties, but it was just ok.  ", "To us, it was just a plate of cold noodles mixed with cilantro...", "nothing special.  ", "But the rest of the food was really good.  ", "I'd highly recommend the Shanghai Style Soup Dumplings.  ", "They were the juiciest dumplings that I've ever tasted...", "they just *burst* in your mouth!!!  ", "The Beef Stew Noodle Soup is also a winner.  ", "The broth was flavorful and not too salty.  ", "The noodles were fresh, and the beef was nice and tender.  "], "author": "Patra I.", "review": "I got home from work, I was tired, and I didn't want to cook.  What to do?  What to do?  So I called up my friend, and we decided to try out Kingdom of Dumpling. \n\nI was huuuuungry, so everything looked really good.  We ended up ordering 5 dishes....quite alot for two people!  \n\nHere's what my hungry tummy had me order:\n-Onion Pancake http://static.px.yelp.com/bphoto/40BiejYl9zvr6voybKvvOw/l\n-Shrimp and Chive Dumplings http://static.px.yelp.com/bphoto/2mDZUpu_TttfL1Ve1PK7-Q/l\n-Fresh Cilantro Bean Noodle http://static.px.yelp.com/bphoto/Y0UfZk-dJwQ9DbN83uha6g/l\n-Beef Stew Noodle Soup http://static.px.yelp.com/bphoto/nL-TfxPqxWoQCBCMPP44Jg/l\n-Shanghai Style Soup Dumplings http://static.px.yelp.com/bphoto/BHX2aKfBwQTmMDcsj_4YJw/l\n\nThe Fresh Cilantro Bean Noodle was one of their specialties, but it was just ok.  To us, it was just a plate of cold noodles mixed with cilantro...nothing special.  But the rest of the food was really good.  I'd highly recommend the Shanghai Style Soup Dumplings.  They were the juiciest dumplings that I've ever tasted...they just *burst* in your mouth!!!  The Beef Stew Noodle Soup is also a winner.  The broth was flavorful and not too salty.  The noodles were fresh, and the beef was nice and tender.  My tummy was super stuffed!\n\nThe restaurant is really small.  There were about 8 tables, and you could see right into the kitchen.  I wouldn't recommend going there with a large party.  Most of the tables are for 2 and only a few for 4.  There was no bathroom to be seen, so I'm assuming you had to walk to the kitchen to get to it....or just hold it until you get home!", "rating": 4, "date": "2008-12-29"}, {"excerpts": ["Here's what we ordered: \n1) fresh cilantro bean noodle (cold dish)\n2) pork and napa cabbage dumpling\n3) green chives and shrimp dumpling\n4) xiao long bao\n5) this bao looking like thing that was pan fried on the outside with shredded turnip inside (a savory dish). \n\n"], "author": "Eugenia G.", "review": "Was craving for xiao long bao and dumplings so I did what any other person may do-- yelp it! Came upon this place and decided to come here. This place is an easy miss if you are driving by because it's so tiny and the sign is a bit ambiguous and small. \n\nCome early or you'll have to wait outside because there is no waiting area inside. The place is smaller than my bedroom! There's about 10 tables that can fit about 2 people each. It's really hot and steamy inside-- you'll leave smelling like food due to poor ventilation so don't wear your fancy smancy clothes. \n\nHere's what we ordered: \n1) fresh cilantro bean noodle (cold dish)\n2) pork and napa cabbage dumpling\n3) green chives and shrimp dumpling\n4) xiao long bao\n5) this bao looking like thing that was pan fried on the outside with shredded turnip inside (a savory dish). \n\nI hated the green chives and shrimp dumpling. Made me feel jipped and was lacking flavor so I had to dunk that little dumpling in my sauce for flavor. I originally wanted the pork and shrimp with green chives but they were sold out.  The pork and napa cabbage dumpling was alright. Their dumpling skins are king of thin. I was too excited when the XLB came out and didn't wait long enough for it to cool down so I burned my tongue when I bit into it and all the soup came gushing out.... ouch. \n\nNot sure if I want to come back because of how small the place is-- literally a hole in the wall. This isn't the place to go to with a party larger than 4 or a place to have a long dinner at. You get in, order, eat and chat at the same time and pay as soon as you are done because trust me, once your dishes are empty, they shove the bill at you.", "rating": 3, "date": "2011-01-05"}], "marinated seaweed": [{"excerpts": ["Marinated seaweed: ", "This isn't the same seaweed you'd find at Japanese restaurants.  "], "author": "Audrey T.", "review": "A friend of mine introduced me to this place about 6 months ago and I've been back many times (even though I live in SJ). I crave for the hot, soupy dumplings hours after I have left the restaurant.  \n\nI usually go on Monday evenings when it is not too crowded (I always see the owner pull up with his car and taking out trays of freshly made dumplings).  I came on Sunday (1/23) and holy crap, was it cramped.  Barely any room to stand and  I had to be a little assertive to get a table. \n\nWe were a group of 3 girls and was seated in 10 minutes.  The owner greeted us with a \"Oh hai cutie girls!\", which was too hilarious and cute. \n\nShanghai Soup Dumplings: Hot, soupy and flavorful.  I couldn't ask for more.\n\nPork and shrimp dumplings: Delicious.  The skins were just the right thickness and not too doughy.  \n\nShrimp and chive dumplings: Yummy as well\n\nOnion pancake: Wasn't too oily, full of onion-y flavor.  Really good with the hot sauce provided at the table. \n\nMarinated seaweed: This isn't the same seaweed you'd find at Japanese restaurants.  It's still very good, but has a more ocean flavor. \n\nThai tea: comes in a huge soda cup.  The hot sauce is SPICY, so I needed this.  \n\nAlso, I always laugh whenever I see the menu.  The typos are too funny.", "rating": 5, "date": "2011-01-24"}], "boiled peanuts": [{"excerpts": ["A couple redeeming items include the boiled peanuts, which are flavorful and salty, and the green onion pancake. ", "You really can't go wrong with the green onion pancake. ", "Last time, I ate two. ", "By myself. ", "Mix some of the spicy mystery sauce (at your table) with some soy sauce, and use it as dipping sauce for the pancake. ", "Repeat."], "author": "Kristen B.", "review": "I REALLY want to like Kingdom of Dumpling. I want to like it so bad. But they make it really hard.\n\nThe service is very slow, and the food is sub-par. I am willing to admit that this PROBABLY has a lot to do with the fact that I am a vegetarian, so I can't partake in the magic that is the Shanghai Soup Dumpling. \n\nThe vegetarian dumplings are actually awful, and I don't think food is awful very often. In fact, I eat everything. Including hot pockets.\n\nA couple redeeming items include the boiled peanuts, which are flavorful and salty, and the green onion pancake. You really can't go wrong with the green onion pancake. Last time, I ate two. By myself. Mix some of the spicy mystery sauce (at your table) with some soy sauce, and use it as dipping sauce for the pancake. Repeat.", "rating": 3, "date": "2011-04-04"}, {"excerpts": ["Boiled peanuts with sweet and salty cucumber pieces, fried green onion pancakes and the tastiest juciest shanghai dumplings.. ", "Wish the spot was a lot bigger, it fills up pretty quickly ", "but I wouldn't mind waiting for some great tasting dumplings."], "author": "Anonymous P.", "review": "Boiled peanuts with sweet and salty cucumber pieces, fried green onion pancakes and the tastiest juciest shanghai dumplings.. Wish the spot was a lot bigger, it fills up pretty quickly but I wouldn't mind waiting for some great tasting dumplings.", "rating": 5, "date": "2012-03-03"}, {"excerpts": [", the [new item] Boiled Peanuts, the green chive pancakes, the Pork & corn dumplings, and the Lamb dumplings. ", "The Boiled Peanuts come with cucumber in a vinegar / soy sauce, cold. ", "Tasty and also a great dipping sauce for the dumplings!\n"], "author": "Ali W.", "review": "We had planned to go to the sushi place a few doors down, but it was closed [Tuesday!] and so decided to try KoD. So good! No wait after 8pm on Tuesday, nearly full, and ended up sharing our crammed-in-by-the-kitchen table area with some nice gals who'd been before.\n\nAlmost empty by the time we left, though -- we ordered a lot AND are slow eaters! :P\n\nWe got the chicken wings [sticky sweet sauce, Yum!], the [new item] Boiled Peanuts, the green chive pancakes, the Pork & corn dumplings, and the Lamb dumplings. Also, my fiance got a bottle of the Tsingtao beer, pretty reasonable at $3.25 & a good flavor accompaniment.\n\nThe Boiled Peanuts come with cucumber in a vinegar / soy sauce, cold. Tasty and also a great dipping sauce for the dumplings!\n(Closer to what my American potsticker-loving palate is used to, compared to the yummy but bitter black vinegar sauce!) ;p\n\nThe green chive pancakes are huge! They are like little calzones, there is so much stuffed in! We both liked them, but the garlic was a little strong, and I am sometimes sensitive to that, so stopped after a few bites. Delicious, though.\n\nDumplings! Both were great. Would order again, but also the gals told us to try the soup dumplings, so we'll definitely order those next time!\n\nIt was too much food for us, and we took home leftovers. So delish!\n\nWe weren't too stuffed, though, for the complimentary dessert!  We were a bit confused by the black filling. The gals sharing the table seemed to be watching for our reaction, and let us know it was black sesame paste.\nSo yummy! Hints of sugar, and the top is covered in sesame seeds. Kind of like a mini jelly donut, heh. :D\n\nWe'll definitely be going back! It has been several hours now and my tummy feels totally fine, btw. :P", "rating": 4, "date": "2009-10-28"}, {"excerpts": ["The boiled peanuts with cucumbers are freakin great as well. ", "Unfortunately the vegetarian dumplings are bland, but lamb and chicken are kickin'\nI am in love with this tiny little place which has warmed my friends, family and I on many occasions with scrumptious little dumplin's. ", "The service is great, very friendly."], "author": "Tim B.", "review": "The best,  cheap, quality northern style dumplings in town as far as I can tell. The Shanghai Soup Dumpling is the best I've had yet. Onion and Beef pancakes, Shanghai black sesame donut, and the hot sauce are all so good. The boiled peanuts with cucumbers are freakin great as well. Unfortunately the vegetarian dumplings are bland, but lamb and chicken are kickin'\nI am in love with this tiny little place which has warmed my friends, family and I on many occasions with scrumptious little dumplin's. The service is great, very friendly.", "rating": 4, "date": "2010-03-17"}, {"excerpts": ["I think I may have even have gotten a little teary-eyed when I tried their boiled peanuts and cucumbers for the first time.\n", "Authentic, inexpensive and tasty!"], "author": "Robyn K.", "review": "Aside from the fact that they: \n- have had the same 5 specials written on their white board for the entire 3 years we have been going there.\n- you sometimes have to translate the menu from Chinglish to whatever language you speak\n- there is ZERO ambiance\n-the tables may occasionally be sticky\nI LOVE THIS PLACE! The food is wonderful and cheap. And the owner is super friendly and occasionally comes and sits with us. I spent a little bit of time in Northern China and am so happy when I find a restaurant that replicates those flavors (it can be hard to find in SF as it seems most places have more southern cuisine). I think I may have even have gotten a little teary-eyed when I tried their boiled peanuts and cucumbers for the first time.\nAuthentic, inexpensive and tasty!", "rating": 5, "date": "2010-11-26"}], "boiled peanuts with celery": [], "crispy lotus roots": [{"excerpts": ["My friend and I ordered\nPork dumpling with napa\nShanghai soup dumplings\ngreen onion pancake\ncrispy lotus roots\n\n"], "author": "Twist' D.", "review": "I've been wanting to go for a while, but just never got around to it until one day our office was evacuated due to riots in Oakland and we skipped lunch in anticipation of getting sent home.  No one wants to be stopped in the middle of eating a meal in panic trying to find a ride home as to avoid BART on all cost.  So this was the chance to go grab a bite to eat.\n\nMy friend and I ordered\nPork dumpling with napa\nShanghai soup dumplings\ngreen onion pancake\ncrispy lotus roots\n\nEverything was good, service was quick, and the bill came out to to 13 a person.  We were stuff.\n\nOn my 2nd visit with my kids and one friend\nChicken dumpling with green chives\nDumpling with QQ noodles (glass noodles)\nBeef Chowfun\nPan fried Chicken Dumplings with napa cabbage\nonion pancake\n\nI was disappointed in the pan fried dumplings because it was greasy as hell and it didn't have a nice sear on the bottom to make it crisp.  The kids love the noodle soup and ate it all up plus the over dosed on the dumplings we order and what was in the soup.  They also loved the onion pancake.  We ordered way too much food and took 3 containers home which served as a midnight snack for the kids 5 hours later.  \n\nThis is a mom and pop place through and through.", "rating": 4, "date": "2010-11-16"}], "golden mushrooms": [{"excerpts": ["chicken Lo Mein (greasy but noodles were so good and moist), pork pot stickers (didn't try), golden mushrooms (enoki with cucumbers- good), and green beans (excellent/ ", "though super greasy).  ", "Last week, we were at a holiday party where they had pans of 6 different kinds of dumplings (I liked the vegetarian and the chicken with corn), the beef pancake, noodles, green beans and others.  ", "We all thought the food was great ", "and it was perfect for a party with kids and adults.  "], "author": "Vivian W.", "review": "I have recently had a couple of meals from Kingdom of Dumpling and am a fan. \n\nWe ordered takeout - where the delivery estimate was 85 minutes but it took 60 minutes- and we enjoyed the meal.  We had shrimp with chives dumplings (tasty), chicken with Chinese spinach dumplings (a bit dry- not my fave), chicken Lo Mein (greasy but noodles were so good and moist), pork pot stickers (didn't try), golden mushrooms (enoki with cucumbers- good), and green beans (excellent/ though super greasy).  Last week, we were at a holiday party where they had pans of 6 different kinds of dumplings (I liked the vegetarian and the chicken with corn), the beef pancake, noodles, green beans and others.  We all thought the food was great and it was perfect for a party with kids and adults.  They made sure the dumplings were kept heated in big catering pans.  \n\nBeen to the restaurant only once - it's small and there was a very long wait.  Hard to eat a large variety unless you have a group, so I think the delivery option is definitely the way to go!", "rating": 4, "date": "2017-12-17"}], "marinated pork elbow": [], "garlic black fungus": [{"excerpts": ["Their starters are def worth it, esp the garlic black fungus. ", "(fungers) \n", "They should really move to a different location or spot though, their space and setting is not nearly up to par with their popularity."], "author": "Eva Z.", "review": "This place is a small af but that has ABSOLUTELY NO EFFECT ON HOW FREAKING GOOD THEIR FOOD IS. \nI love the Xiao Long Bao -- my favorite dish of theirs. I'm personally not a fan of anything with lamb, so i stayed away from that after eating it the first time.\nThe waitresses/waiter is really nice too -- me gusta. Their suggestions are quite true, and you should heed it.\nTheir starters are def worth it, esp the garlic black fungus. (fungers) \nThey should really move to a different location or spot though, their space and setting is not nearly up to par with their popularity.", "rating": 5, "date": "2012-07-09"}, {"excerpts": ["Under latest new dishes, item 3 the grilled skewered lamb (4) USD 6.95, a slow low mild spiciness that builds, was very tasty; item 18 garlic black fungus with cucumbers with vinegar and garlic USD 5.95, was a cold, slightly crunchy, quite tasty and different.  "], "author": "George L.", "review": "Initially, I was put off by the small space, cramped, not much in atmosphere, seating for twenty people, and hot inside just poking my head inside.  This wasn't my first pick though it was on my list, it was Dumpling Kitchen we trying for, but found them closed for vacation.  Placed our name, number of people on a paper list, hanging by the doorway.  Wasn't too long, we got a table.\n\nUnder dim sum, item 2 the Shanghai pan fry soup dumplings (4) USD 4.95 wasn't available - a disappointment, so we settled on item 1 the Shanghai soup dumplings (6) USD 4.95, which was really good, but it was the pan fried, which I have had in Shanghai at Yang's Fried Dumpling which I considered to be the gold standard to measure other dumplings which none have come across to be as good.  Item 5 onion pancakes (1) USD 3.95, cut into eight pieces stacked, was hot, oily, crispy, quite tasty, I liked it.\n\nUnder latest new dishes, item 3 the grilled skewered lamb (4) USD 6.95, a slow low mild spiciness that builds, was very tasty; item 18 garlic black fungus with cucumbers with vinegar and garlic USD 5.95, was a cold, slightly crunchy, quite tasty and different.  Q style jelly fish is one of their latest items not on their printed menu, but is posted on the wall.  Also under this catagory are:  green chives dumpling with egg, farmer's cucumber, boiled peanut with celery.\n\nUnder Wok dishes, item 4 garlic string beans USD 6.95 was excellent, cooked, but still crispy, flavored with soy sauce, oil, garlic.  Under drinks, item 2 Thai tea USD 1.75 was iced, sweentened with milk, tasty, not too sweet as I have tasted at other places.\n\nWe ordered one dish too many or didn't really need.  This was before adding the onion pancakes afterward, asked if this was enough food, our waitress said not, so we added under soup noodle, item 1 pork & shrimp wonton with wide rice noodle USD 5.95, which came after every other dish ordered was okay, I thought the wonton skin was rather thick, the soup base passable, but Yin Du Wonton Noodle on Pacific Ave at Beckett St would be superior with thin wonton skin, amazing soup base.\n\nRecommend calling to see if they have Shanghai pan fried soup dumplings before making the trek to the restaurant.  But almost everything we ordered was very good.  The complimentary house tea arrived with a single tea bag and we thought didn't impart much flavor till the end of our meal when the tea was no longer hot.  We noticed a private tour bus pulled up and parked right in front, and service was provided to the passengers on the bus.  Credit cards accepted.\n\nhttp://www.foodspotting.com/reviews/4823566\nhttp://www.foodspotting.com/reviews/4823578\nhttp://www.foodspotting.com/reviews/4823572\nhttp://www.foodspotting.com/reviews/4823584\nhttp://www.foodspotting.com/reviews/4823605\nhttp://www.foodspotting.com/reviews/4823522", "rating": 4, "date": "2014-06-30"}, {"excerpts": ["we had the garlic black fungus and cucumber salad was awesome! ", "Go early coz there's a line to go in! ", "Def a place to go back to when im in town!"], "author": "Marie A.", "review": "First time at the place and loved the food, the place is small but the food is scrumptious...we had the garlic black fungus and cucumber salad was awesome! Go early coz there's a line to go in! Def a place to go back to when im in town!", "rating": 4, "date": "2015-11-12"}], "q style jelly fish": [{"excerpts": ["Q style jelly fish is one of their latest items not on their printed menu, but is posted on the wall.  "], "author": "George L.", "review": "Initially, I was put off by the small space, cramped, not much in atmosphere, seating for twenty people, and hot inside just poking my head inside.  This wasn't my first pick though it was on my list, it was Dumpling Kitchen we trying for, but found them closed for vacation.  Placed our name, number of people on a paper list, hanging by the doorway.  Wasn't too long, we got a table.\n\nUnder dim sum, item 2 the Shanghai pan fry soup dumplings (4) USD 4.95 wasn't available - a disappointment, so we settled on item 1 the Shanghai soup dumplings (6) USD 4.95, which was really good, but it was the pan fried, which I have had in Shanghai at Yang's Fried Dumpling which I considered to be the gold standard to measure other dumplings which none have come across to be as good.  Item 5 onion pancakes (1) USD 3.95, cut into eight pieces stacked, was hot, oily, crispy, quite tasty, I liked it.\n\nUnder latest new dishes, item 3 the grilled skewered lamb (4) USD 6.95, a slow low mild spiciness that builds, was very tasty; item 18 garlic black fungus with cucumbers with vinegar and garlic USD 5.95, was a cold, slightly crunchy, quite tasty and different.  Q style jelly fish is one of their latest items not on their printed menu, but is posted on the wall.  Also under this catagory are:  green chives dumpling with egg, farmer's cucumber, boiled peanut with celery.\n\nUnder Wok dishes, item 4 garlic string beans USD 6.95 was excellent, cooked, but still crispy, flavored with soy sauce, oil, garlic.  Under drinks, item 2 Thai tea USD 1.75 was iced, sweentened with milk, tasty, not too sweet as I have tasted at other places.\n\nWe ordered one dish too many or didn't really need.  This was before adding the onion pancakes afterward, asked if this was enough food, our waitress said not, so we added under soup noodle, item 1 pork & shrimp wonton with wide rice noodle USD 5.95, which came after every other dish ordered was okay, I thought the wonton skin was rather thick, the soup base passable, but Yin Du Wonton Noodle on Pacific Ave at Beckett St would be superior with thin wonton skin, amazing soup base.\n\nRecommend calling to see if they have Shanghai pan fried soup dumplings before making the trek to the restaurant.  But almost everything we ordered was very good.  The complimentary house tea arrived with a single tea bag and we thought didn't impart much flavor till the end of our meal when the tea was no longer hot.  We noticed a private tour bus pulled up and parked right in front, and service was provided to the passengers on the bus.  Credit cards accepted.\n\nhttp://www.foodspotting.com/reviews/4823566\nhttp://www.foodspotting.com/reviews/4823578\nhttp://www.foodspotting.com/reviews/4823572\nhttp://www.foodspotting.com/reviews/4823584\nhttp://www.foodspotting.com/reviews/4823605\nhttp://www.foodspotting.com/reviews/4823522", "rating": 4, "date": "2014-06-30"}], "farmers cucumber": [{"excerpts": ["Try the Xiao Long Bao, Green Chive Pancake (more stuffing than the green onion version), Shrimp and Chive dumpling , Farmers cucumber,\nTofu bean noodles, and the crispy sauté green beans. \n\n"], "author": "Yelp R.", "review": "The food was tasty and heart warming; it exuded that comfort food feeling regardless of your mood and feeling at the time. Come and relax from your day at this hidden gem. \n\nLee was nice and welcoming, yet efficient to greet you and handing you a menu so you know what you are getting into. Bonus: he takes your order while you are in line so by the time you sit down, your food arrives shortly thereafter!\n\nTry the Xiao Long Bao, Green Chive Pancake (more stuffing than the green onion version), Shrimp and Chive dumpling , Farmers cucumber,\nTofu bean noodles, and the crispy sauté green beans. \n\nSkip the Crispy Chicken Wings. \n\nExpect a line at meal time but order a beer to pass the time until you're seated.", "rating": 5, "date": "2018-05-30"}, {"excerpts": ["Any spicy dumpling and Farmers Cucumber. ", "5 stars on flavor. ", "Not going to be a snob about a dumpling house and write mean reviews when I know what to expect. ", "We re not eating at the Rosewood or Four Seasons people and realize your reviews could hurt people's livelihoods. ", "Just sayin."], "author": "Tammy L.", "review": "Lamb dumplings and chicken and corn dumplings my friends. Any spicy dumpling and Farmers Cucumber. 5 stars on flavor. Not going to be a snob about a dumpling house and write mean reviews when I know what to expect. We re not eating at the Rosewood or Four Seasons people and realize your reviews could hurt people's livelihoods. Just sayin.", "rating": 5, "date": "2018-04-26"}, {"excerpts": ["We got the farmers cucumber which is just cucumber with some kind of marinade and garlic. ", "It was great and refreshing on a hot day."], "author": "Nathan M.", "review": "This was all delicious. The pan fried dumplings (shen jian bao) aren't soupy like in shanghai (try shanghai flavor shop in sunnyvale for soupy ones).\n\nThe shao long boa are nice and soupy, I liked em. I think the standard dumplings are their signature, the wrapper appeared home-made, very good.\n\nI got the beef pancake, and LOVED it, it was a great compliment to everything else. We got the farmers cucumber which is just cucumber with some kind of marinade and garlic. It was great and refreshing on a hot day.", "rating": 5, "date": "2009-06-15"}], "honey flavored bitter melon": [], "piece pork dumplings with napa cabbage": [], "piece pork dumplings with green chives": [], "piece pork dumplings with celery": [], "piece pork dumplings with string beans": [], "piece pork dumpling with corn": [], "piece pork dumpling with chinese spinach": [], "piece pork dumplings with spinach": [], "piece chicken dumplings with napa cabbage": [], "pieces chicken dumplings with green chives": [], "pieces chicken dumpling with celery": [], "pieces chicken dumpling with corn": [], "pieces chicken dumpling with chinese spinach": [], "pieces chicken dumpling with spinach": [], "pieces pork and shrimp dumpling with green chives": [], "pieces beef dumpling with carrot": [], "pieces lamb dumpling with chinese vegetable": [], "pieces vegetarian dumpling": [], "pieces shrimp dumpling with green chives": [], "pieces green chives dumpling with egg": [], "pieces kale dumpling": [], "pieces fish dumpling": [], "xo beef chowfun": [{"excerpts": ["XO Beef ChowFun\n", "* Green Beans\n"], "author": "Miyeon L.", "review": "It was good fortune that brought us here. \nAnd how grateful I am.\n\nMy husband and I were in the bay area and we had originally planned to have lunch at SanTung on Christmas morning.  To me, it was the only visit-worthy restaurant on our short trip up north that would be open on Christmas day.  But to our disappointment, when we drove to SanTung, they were closed! \n\nSo after a quick search on Yelp and a phone call to Kingdom of Dumpling, our plans were changed.  \n\nWhen we arrived, there was no wait.  We were seated right away, which is surprising considering the many reviews and accolades that this place has received and also the small size of this restaurant.  How fortunate we were.  \n\nI didn't have much time to prepare myself on what I would order.  After all, this restaurant was a last minute decision and there was no wait time to see what others were ordering.  I had to trust my fellow Yelpers:\n\n* XLB (shanghai soup dumplings)\n* pan fried XLB (shanghai pan fried soup dumplings)\n* XO Beef ChowFun\n* Green Beans\n* Pork & Shrimp wonton with wide rice noodle soup\n\nEach dish was delicious.  \nAnd without a doubt, probably the best XLB I've ever had anywhere. In addition, their orange colored hot sauce is a beautiful mystery of its own.  I put that sauce on my dumplings, on my xo noodles, in the soup... it was outrageously addicting. \n\nI regret not ordering their non XLB dumplings or their Green Chives pancake. As I sat there eating my food, I noticed that these were also probably some of their staple items that I didn't get a chance to order.   By the time I looked up from my plate to notice the tables around me, I was already getting full. \n\nI am so glad that SanTung was closed on Christmas because it led us here. I will definitely be coming back for more.", "rating": 5, "date": "2016-12-27"}, {"excerpts": ["When I come here I usually order the Shanghai Soup Dumplings, Pork and Corn Dumplings, Garlic String Beans, Grilled Chicken Fried Rice, XO Beef Chowfun, and Onion Pancake. "], "author": "Ilene B.", "review": "KOD! I love this place for their dumplings and infamous orange hot sauce!! They need to sell that sauce in bottles btw lol \n\nWhen I come here I usually order the Shanghai Soup Dumplings, Pork and Corn Dumplings, Garlic String Beans, Grilled Chicken Fried Rice, XO Beef Chowfun, and Onion Pancake. Soo yummy!\n\nThe owner is super friendly and always makes the effort to make sure his customers are enjoying their meal. However, the servers could step up their game a bit. If you need a refill on water, they are quite slow and often forget. Nevertheless, I continue coming back for their amazing food! :)", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["This time around I also ordered other items such as the pork and corn dumplings, xo beef chowfun, crispy chicken wings, and fried tofu. ", "I enjoyed the pork and corn dumplings and the fried tofu. "], "author": "Andy N.", "review": "This is my 2nd time here because Kitchen Dumpling was closed. I was reluctant on giving this place another try because of my previous disappointment with the dry soup dumplings. This time howevever my Xiao Long Bao dumplings were juicy! I'm glad it came out right this time. \n\nThis time around I also ordered other items such as the pork and corn dumplings, xo beef chowfun, crispy chicken wings, and fried tofu. I enjoyed the pork and corn dumplings and the fried tofu. Those were both pretty good and I'd order it again\n\nThe food here is cheap and comes out fairly quick\n\n\nRecommendation: Xiao Long bao, pork/corn dumplings , and fried tofu", "rating": 4, "date": "2013-10-09"}, {"excerpts": ["*XO Beef Chowfun: YUM! ", "Although I didn't taste any components of XO sauce (dried scallop, fish, shrimp, chili paste, garlic, and etc), it was perfectly cooked and seasoned. ", "The noodles were al-dente and wasn't too oily. ", "The beef was tender and flavorful, although there very few pieces of it. "], "author": "Cherylynn N.", "review": "KINGDOM OF GOODNESS!\n\nMy search for the best XIAO LONG BAO in SF has ended with Kingdom of Dumpling.\n\nMy friends and I came here yesterday, 4.18 at 2:30 PM. As we came later in the day, we were seated within several minutes.\n\nFOOD:\n*XLB (3 orders): YUMMY! The XLB was perfectly bundled in its wrapper and steamed. The wrapper was a little thicker in texture than the ones from Shanghai Dumpling King, so it was a lot more sturdy and didn't fall apart and/or rip when you picked it up. The savory soup was bursting with flavor and the pork filling was moist, tender, and very flavorful. The accompanying soy vinegar ginger sauce was a perfect complement as it gave a salty, sweet, and tangy punch to the XLB.\n\n*Pan-fried XLB: Good! This XLB's wrapper was thicker and resembled and tasted more like a mini pan-fried pork bun. The wrapper was nice and crisp on the bottom and soft in the center. The pork filling was similar to the steamed XLB and was still moist and very flavorful despite not having the soup in it.\n\n*Beef Pancake: OMG--SOO GOOD! Who doesn't like a beef cake?!?! Lol! It was essentially a triple layer of a thin, crisp pancake filled with two thin flavorful beef patties. Their homemade creamy garlic chili sauce was a perfect complement to the pancake.\n\n*Green Chive Pancake: It was good! This was basically a chinese version of a pita wrap. The pancake was crisp and a nice doughy texture to it and was generously stuffed with a green onions and QQ noodles (clear vermicelli noodles). All the flavors were really subtle, so you must dip it on the garlic chili sauce.\n\n*Pork w/ Napa Cabbage Dumplings: GOOD! The dumplings wrapper was slightly thicker than a wonton wrapper and was al-dente. The pork filling was very moist, juicy, and flavorful. It went very well with the soy vinegar ginger sauce.\n\n*Shrimp and Chive Dumplings: It was just ok. The same wrapper was used as the pork dumpling. There was more chive than anything, so I didn't really taste the shrimp.\n\n*Shrimp and Pork Wonton Soup w/ Wide Noodles: Perfect hangover food! The wontons were perfectly cooked leaving an al-dente skin; the filling which was mainly pork was moist and flavorful. The broth was DELISH and was definitely very pure; none of that MSG killer. The wide noodles (chow fun) noodles were cooked al-dente which gave it a nice bite. \n\n*XO Beef Chowfun: YUM! Although I didn't taste any components of XO sauce (dried scallop, fish, shrimp, chili paste, garlic, and etc), it was perfectly cooked and seasoned. The noodles were al-dente and wasn't too oily. The beef was tender and flavorful, although there very few pieces of it. The bean sprouts and green onions gave it a nice crunch and freshness to the dish.\n\nPRICES:\n*Apps (i.e. pancakes): $3.95-$4.95\n*Dumplings (4-12 pieces): $4.95 to $6.95\n*Noodle soups/Noodle Dishes: $5.95-$6.95\n\nWe ordered 10 dishes among 4 people (yes, our eyes were and always BIGGER than our stomachs) and it came to $20/person including tip and we had leftovers to feed another 3 people.\n\nSERVICE:\nPretty good for a hole-in-the-wall. The manager/owner (?) was very friendly and even demonstrated on how to properly eat a XLB. Initially, they sat us at the back table near the kitchen which reeked of vinegar and he gladly let us move to another table when another party had left.\n\nThe first dish came out in 5-7 minutes and each dish after than came out in 4-5 min increments.\n\nAMBIANCE/DÉCOR:\nKOD is epitome of a hole-in-the wall. It's tiny and can accommodate about 20-24 people. The sticky tables are very close to each other, so don't be surprised if the table next to you bumps you with their chair. The place does reek of pungent vinegar, but you get use to the smell within 10 minutes or so.\n\nPARKING:\nSince it's located in Outer Sunset/Parkside, street parking is a little easier to come by than the Inner Sunset. But, nonetheless, do expect to circle around especially during peak lunch hour.\n\nKOD, I *bow down* to you!", "rating": 5, "date": "2010-04-19"}, {"excerpts": ["I ordered green onion pancake, pork and shrimp dumpling, soy milk, chinese doughnut, and XO beef chowfun. ", "The green onion pancakes get 3 stars. ", "They tasted good at the first bite but the taste doesn't exactly last. ", "I would have liked the pancake to be just a little crispier even though I usually prefer soft foods. ", "The pork and shrimp dumplings were good. ", "I was glad it wasn't soupy because i didn't end up with a burned tongue surprise. ", "The soy milk was not as sweet as I would have liked ", "but it was light and just right. ", "It was great with the chinese doughnut. ", "The XO beef chowfun was also good but a little oily. ", "However, whenever you eat chowfun, it should always expect oil since the noodle itself is already oily. "], "author": "Connie C.", "review": "I loved my first visit here! I came here with the bf since I read that it was a small place and small it was! I came just in time as a table cleared and was seated within minutes. If you plan to come here, expect an extremely small dining area and also for it to be stuffy. There aren't windows and the only fresh air you get is the air that blows through from the door opening. It also doesn't help that the dumplings are fresh hot and steamy . \n\nThough I was slightly uncomfortable, the food definitely made up for it. I ordered green onion pancake, pork and shrimp dumpling, soy milk, chinese doughnut, and XO beef chowfun. The green onion pancakes get 3 stars. They tasted good at the first bite but the taste doesn't exactly last. I would have liked the pancake to be just a little crispier even though I usually prefer soft foods. The pork and shrimp dumplings were good. I was glad it wasn't soupy because i didn't end up with a burned tongue surprise. The soy milk was not as sweet as I would have liked but it was light and just right. It was great with the chinese doughnut. The XO beef chowfun was also good but a little oily. However, whenever you eat chowfun, it should always expect oil since the noodle itself is already oily. It also had a nice kick from the XO sauce and it had a hint of spiciness. \n\nIt was great because during my visit, the owner came in with trays of freshly made dumplings and fresh it did taste! I can't wait to go back to try something new!", "rating": 4, "date": "2010-01-04"}], "xo chicken chowmein": [{"excerpts": ["We always get the soup dumplings, pork and corn dumplings, string beans and xo chicken chowmein.  ", "Comes out quickly and is hot and steaming!  "], "author": "Michelle K.", "review": "This place is tiny and a bit dingy, but so good!  We always get the soup dumplings, pork and corn dumplings, string beans and xo chicken chowmein.  Comes out quickly and is hot and steaming!  Never disappoints and is cheap!  \n\nSide note: as you can imagine, it gets pretty hot in that tiny place.", "rating": 4, "date": "2015-09-30"}], "grilled chicken fried rice": [{"excerpts": ["When I come here I usually order the Shanghai Soup Dumplings, Pork and Corn Dumplings, Garlic String Beans, Grilled Chicken Fried Rice, XO Beef Chowfun, and Onion Pancake. "], "author": "Ilene B.", "review": "KOD! I love this place for their dumplings and infamous orange hot sauce!! They need to sell that sauce in bottles btw lol \n\nWhen I come here I usually order the Shanghai Soup Dumplings, Pork and Corn Dumplings, Garlic String Beans, Grilled Chicken Fried Rice, XO Beef Chowfun, and Onion Pancake. Soo yummy!\n\nThe owner is super friendly and always makes the effort to make sure his customers are enjoying their meal. However, the servers could step up their game a bit. If you need a refill on water, they are quite slow and often forget. Nevertheless, I continue coming back for their amazing food! :)", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["The grilled chicken fried rice was awsome! ", "Full of flavor and big pieces of chicken. "], "author": "Xtina C.", "review": "Hole in the wall little place. Literally 10 tables  big. Came in with 6 adults 2 kids and 2 infants and they got us in with 10 min of us getting there. The food was amazing! It all came out at a decent time\n\nThe Shanghai pan fried soup dumplings were sooooo delicious and the regular shanghai soup dumplings were even better. It was mind bowling that they actually  got soup into a dumpling.  The grilled chicken fried rice was awsome! Full of flavor and big pieces of chicken. Not small tiny ones that you usually get in other fried rices. \n\nShrimp and chive dumplings were ok.they could of used a bit more seasoning.  The pork and shrimp dumplings were great!! The vegetarian potstickers and dumplings were off the hook! I never thought a veggie option would be so delicious!!! \n\nThe onion pancake!!! OH EM GEEEE!!!!!!! sooooooooooooo good!!!! You don't need any sauce at all! Just eat it straight. \n\nNot to sure how the food holds up for take out or if it sits there to long as soon as we got our food it was pretty much gone within  2 min lol\n\nVery good hidden gem!", "rating": 5, "date": "2015-06-27"}, {"excerpts": ["I am also a fan of their noodles and the grilled chicken fried rice.\n\n", "My friend was really impressed by that and loved everything we ordered:\n\nshanghai dumplings, shrimp and pork dumplings (with whole shrimp), lamb dumplings, and grilled chicken fried rice."], "author": "Michelle S.", "review": "Service is consistently not 100% there, but the food is consistently good.  The owner is a really nice guy.  He gets stressed easily, place is small, and gets packed!\n\nAlthough there is always a wave of people, they manage to get the food out in a timely manner. \n\nEach dumpling is filled with pockets of yummy juices.\n\nMy favorite dumplings there are the lamb dumplings.  \n\nI am also a fan of their noodles and the grilled chicken fried rice.\n\nI LOVE their hot sauce.  I have no idea what is in it, but I think there's chili peppers, vinegar, pureed garlic, and ????  It doesn't matter, it's good!\n\nService stepped up a notch on my last visit.  The owner actually had time to ask if our food was too salty and if so he can remake it.\n\nMy friend was really impressed by that and loved everything we ordered:\n\nshanghai dumplings, shrimp and pork dumplings (with whole shrimp), lamb dumplings, and grilled chicken fried rice.", "rating": 4, "date": "2011-02-10"}, {"excerpts": ["My mother enjoyed it all including her grilled chicken fried rice.  ", "So, for excellent Shanghainese & northern Chinese dumplings, Kingdom Of Dumpoling cannot be beat.  ", "Keep up the good w2ork guys."], "author": "Brian S.", "review": "I came here after myt glaucoma follow up at UCSF & were we ion heaven.  It was a brief wait, but so worth it; the owner was eager to & sat us at a nice table.  This is a hole in the wall, but serves some of the best food & is not dingy.  The service is friendly & prices low; $36.00 for all we had; not bad.  The pork & napa cabbage dumplings have a thin slightly chewy wrapper & a well seasoned filling; perfect topped with vinigre.  The pork pot stickers are crispy golden & have a well seasoned groun d pork, ginger, & cabbage filling; perfect with a little vinigre.  The beef pancake with crispy, a bit chewy & flavorful with a well seasoned ground beef mixture.  My mother enjoyed it all including her grilled chicken fried rice.  So, for excellent Shanghainese & northern Chinese dumplings, Kingdom Of Dumpoling cannot be beat.  Keep up the good w2ork guys.", "rating": 5, "date": "2015-11-25"}, {"excerpts": ["Some other faves of mine are the grilled chicken fried rice, onion pancake and stir fried string beans.\n\n"], "author": "Marie B.", "review": "LOVE this place! And LOVE that it's just right around the corner from me. Small hole in the wall kinda place but that's what makes it great! There are always people so sometimes there can be a wait but its never a long wait and totally worth it.  Any of the dumplings are delightful but the soup dumplings have the be the best. Some other faves of mine are the grilled chicken fried rice, onion pancake and stir fried string beans.\n\nThe owner is a very nice Chinese man and I go there often enough that he remembers me and always makes a point to stop and talk to the customers, especially when he knows you frequent the place.  I always bring new people to KOD (the nickname me and my friends have given the place) for an awesome and affordable meal.", "rating": 5, "date": "2010-07-20"}, {"excerpts": ["Grilled chicken fried rice:  ", "Probably the best fried rice ", "I've had in a long time.  ", "Almost as good as the one my dear daddy makes.  ", "And I'm not saying that because I was hungry.  "], "author": "Rosalind S.", "review": "There's always a line coming out of this place so we tried coming here for lunch.  I called ahead and the guy that answered said tho come on down. \n\nWe live near by and when we arrived we were given the last table in the corner.  The guy knew I was the one that called too. Wow!\n\nWe went a little crazy and over ordered, but it all worked out in the end.\n1.  Onion pancake: we polished that off quick.  It's not the best I've had but it was still good.\n2.  Salt and pepper tofu:  we got a heaping plate of tofu and it came out pipping HOT!  MMM, soo good.  It would have been better if the salt and pepper were more evenly coated.  Some bites were really salty.\n3.  Shang Hai Dumplings:  do I have to comment on this?  YUM!\n4.  Spring rolls:  I don't know why we thought there were going to come out fresh.  They're deep fried.  I had half of one because I knew we ordered too much food.  It was mediocre at best.\n5.  Pork and spinach dumplings:  we ate all 12 knowing we had more food coming.  This was partly because they took a long time getting the food out.  We tried holding off but it was too good.\n6.  Chicken and spinach dumplings:  so we found out why the food was taking forever to come out.  They ran out!  It looked like they had to get more delivered.  Our waiter asked us if we wanted to change our order.  We said no since we had fried rice coming out next.\n7.  Grilled chicken fried rice:  Probably the best fried rice I've had in a long time.  Almost as good as the one my dear daddy makes.  And I'm not saying that because I was hungry.  This dish came out last\n\nIt gets super crowded and while we were waiting for our food some people came in to eat and turned around to leave.  The waiter/owner? called them back and sure enough a table opened up.  I suggest calling ahead like I did, well, only if you live near by and get over there ASAP.", "rating": 4, "date": "2010-03-30"}], "garlic string beans": [{"excerpts": ["Garlic string beans\nShanghai soup dumplings\nPork, shrimp, and scallions dumplings ", "#14"], "author": "Michael B.", "review": "Really nice.\nGarlic string beans\nShanghai soup dumplings\nPork, shrimp, and scallions dumplings #14", "rating": 5, "date": "2018-09-02"}, {"excerpts": ["Even though we ordered 24 dumplings, we gave in and got the garlic string beans too.\n\n", "Garlic string beans - very good! ", "Lots of garlic! "], "author": "Wesley S.", "review": "This is a very small restaurant, always with a line of people waiting outside. Is it really that good here? Short answer: yes!\n\nWhen my girlfriend and I got to sit down after a ~10 minute wait, we ordered 1 order of the pork dumpling with napa cabbage, and 2 orders of Shanghai soup dumplings. The waitress kind of laughed at us, saying it's probably not enough food for the two of us and suggested a few other dishes to order. Even though we ordered 24 dumplings, we gave in and got the garlic string beans too.\n\nThe food came out promptly one at a time:\n\nPork dumpling with napa cabbage - pretty good. Plump little dumplings. I liked putting a tiny bit of the chili sauce on top and popping it in my mouth.\n\nShanghai soup dumplings - delicious! Make sure not to eat the entire dumpling in one bite, as the soup inside is very hot! Glad we got 2 orders of this.\n\nGarlic string beans - very good! Lots of garlic! We were glad we chose this dish when the waitress suggested us to order more.\n\nThe only thing I don't like is how this restaurant is pretty run down and old. The plates had cracks and chips on them. The teapot wobbled when set down on the flat table. The chopsticks weren't straight.\n\nBut overall, the food was delicious enough to make me want to come back next time, and the fact that they accept credit cards is a plus!", "rating": 4, "date": "2018-01-25"}, {"excerpts": ["We didn't waste time ordering as we started with the $7.95 Garlic String Beans which were wok-fried and thoroughly blistered the way I like 'em ", "(photo: http://bit.ly/2nYMAFs). ", "They were tasty if a tad oily. ", "Jamie must have been in a takeout mood because he ordered the $7.95 XO Chicken Chow Mein which turned out to be a hefty portion of thick noodles mixed with the standard vegetables and again heavy on the greasy side "], "author": "Ed U.", "review": "Why is parking such a major hassle in Parkside? I was circling and circling on those lookalike residential blocks hoping a space would open up, but no, I was constantly fooled by those little three-quarter spaces between the driveways. Alas, I finally found a place to park four blocks away from the restaurant, and Jamie W. and I were fighting the biting evening cold walking to this cramped spot. You can imagine our disappointment in having to sign a waiting list and sitting on a bench outside for our table to be ready.\n\nIndeed it was ten minutes later, but you had to squeeze between chairs, strollers and waitresses to get to it. We didn't waste time ordering as we started with the $7.95 Garlic String Beans which were wok-fried and thoroughly blistered the way I like 'em (photo: http://bit.ly/2nYMAFs). They were tasty if a tad oily. Jamie must have been in a takeout mood because he ordered the $7.95 XO Chicken Chow Mein which turned out to be a hefty portion of thick noodles mixed with the standard vegetables and again heavy on the greasy side (photo: http://bit.ly/2ogwHN2).\n\nI went with one of the specials way above my head on the whiteboard, the $13.95 Rack of Lamb with Rice. It wasn't a rack like Jayne Mansfield has a rack. It was three grilled lamb chops. The plate came with a bowl of rice, a dipping soy sauce, and three lonely asparagus spears - their idea of a gourmet dinner (photo: http://bit.ly/2oo5qsB). I was hoping for a little more lamb and a lot less salt but that's probably the best they can do for the price. Now you can't come to the Kingdom of Dumpling without ordering dumplings.\n\nIn order to fulfill our mission, we first ordered the $4.95 Shanghai Soup Dumplings because that's our litmus test for true dim sum and as expected, got a half-dozen in a basket (photo: http://bit.ly/2oQ5NwQ). They were just OK with a couple bereft of any broth inside. That was a bummer, and they certainly don't provide any worthy competition for Din Tai Fung. We ended our meal with the $5.95 Pork Pot Stickers (photo: http://bit.ly/2oWMO0t), which were steaming hot, hearty, and finally satisfying after all. Now for the Himalayan trek back to the car.\n\nFOOD - 3 stars...everything was just a bit off in flavor with excessive oil the major culprit\nAMBIANCE - 2 stars...like eating in a walk-in closet with a lot of other people\nSERVICE - 3 stars...servers seem to know how to maneuver around those tightly arranged tables and they are fast\nTOTAL - 3 stars...if this be the Kingdom of Dumpling, when was the coronation?", "rating": 3, "date": "2017-04-09"}, {"excerpts": ["Lamb dumpling\nBeef chow fun\nGarlic string beans\nSesame beef pancake\n\nCheap quick dirty Chinese food. "], "author": "Scott A.", "review": "Everything was fantastic.\nLamb dumpling\nBeef chow fun\nGarlic string beans\nSesame beef pancake\n\nCheap quick dirty Chinese food. Gotta love it.", "rating": 5, "date": "2018-06-16"}, {"excerpts": ["Pork and chive dumpling, Garlic string beans, Beef Chow fun, XLB, Spicy beef noodle soup. \n\n"], "author": "Sheewon B.", "review": "In order of fav to least fav: Pork and chive dumpling, Garlic string beans, Beef Chow fun, XLB, Spicy beef noodle soup. \n\nThe food has declined over the past few years. They still do a decent job on the pork dumplings, but the star used to be XLB. Today the dough texture was strangely brittle when you pick it up with your chopsticks yet mouthfeel was mushy. Flavor was decent, although the ginger soy sauce plays a big part in its balance. \n\nBeef chow fun was standard, what I expect out of a Chinese restaurant. The beef noodle soup was bland. \n\nNot sure if the owners recognized the Yelp reviews on service, but this time the greeter was too attentive; he asked us if everything was ok about 5 times during our meal, and we were only there for 20 min. But they did take our order while we were waiting for a table, so as soon as we sat down we had our first dish, which I find to be efficient. \n\nNot going back again. We'll go back to Dumpling Kitchen just a few blocks away.", "rating": 2, "date": "2017-09-09"}, {"excerpts": ["We also got the garlic string beans (always great to pair it with some veggies) and the chicken wings. ", "While the chicken wings were tasty, maybe we should have just stuck with all dumplings and just one side dish of veggies, since I could have used as much room in my stomach for those perfect little juicy dumplings. ", "It IS what I came for...hehe. "], "author": "Tina L.", "review": "I love you like a love song, baby! They have some of the best xiao long bao here. I'm from Chicago, so when I come to SF, I have to get my xiao long bao fix. They come out so steamy and delicious, with some juicy soupy goodness. Serious love song status here. \n\nWe also got the garlic string beans (always great to pair it with some veggies) and the chicken wings. While the chicken wings were tasty, maybe we should have just stuck with all dumplings and just one side dish of veggies, since I could have used as much room in my stomach for those perfect little juicy dumplings. It IS what I came for...hehe. Oh well, next time I'll just have to make sure to maximize the stomach space for all the XLB I can enjoy. \n\nAnd I keep it on re-pe-pe-pe-peat.", "rating": 5, "date": "2016-04-23"}, {"excerpts": ["The garlic string beans were decent. ", "They use the super long string beans. ", "Nothing too special about this dish and "], "author": "Julian Y.", "review": "Super small hole in the wall, but don't let that fool you. Great prices and decent food.\n\nI got the Shanghai dumplings which was 6 pieces for $5. There was a good amount of soup in it, but I wish the skin was not as dry. Nonetheless for the price, I can't complain and the vinegar helped fix my problem.\n\nThe garlic string beans were decent. They use the super long string beans. Nothing too special about this dish and I've had better.\n\nThey ran out of chow fun so I got beef chow mein instead. It's your average chow mein. Lots of veggies mixed into the noodles.\n\nDecent food that won't break you wallet, I approve.", "rating": 3, "date": "2016-07-28"}, {"excerpts": ["We shared an order of Pork & Chive Dumplings, Chicken & Chive Dumplings, Garlic String Beans, and two orders of their Soup Dumplings. ", "You can tell that each dumpling is made with love and care - the ratio of filling and dough was just absolutely perfect. ", "Each bite was very light, flavorful, and paired well with their housemade sauce. ", "The string beans were also super tasty and cooked perfectly. ", "If you're in the Sunset District make sure you stop by here for some authentic dumplings and Chinese food!"], "author": "Kelci L.", "review": "Have you ever wondered how many dumplings you can eat in one sitting before you become a dumpling yourself?! My boyfriend and I found out today after we finished 36 dumplings. The place itself is really small so you may have to wait for a table, but don't worry because the service is super quick! We shared an order of Pork & Chive Dumplings, Chicken & Chive Dumplings, Garlic String Beans, and two orders of their Soup Dumplings. You can tell that each dumpling is made with love and care - the ratio of filling and dough was just absolutely perfect. Each bite was very light, flavorful, and paired well with their housemade sauce. The string beans were also super tasty and cooked perfectly. If you're in the Sunset District make sure you stop by here for some authentic dumplings and Chinese food!", "rating": 5, "date": "2017-02-01"}, {"excerpts": ["The garlic string beans were hot off the wok. ", "For SF parking is pretty manageable just pay attention to the curb and street signs"], "author": "B K.", "review": "Amazing dumplings, the pancakes are like Chinese quesadillas they are \"fantastic\". The place is small but worth the wait. The garlic string beans were hot off the wok. For SF parking is pretty manageable just pay attention to the curb and street signs", "rating": 4, "date": "2018-04-29"}, {"excerpts": ["He also always recommends the garlic string beans without fail. ", "To get a little taste of all they have to offer, I'd recommend 1 order of a dozen dumplings (I love the lamb and chives dumplings), 1 order of flat noodle soup with dumplings (comes with 6 more of your choosing), and of course, the garlic string beans. ", "That's enough to share between 2 people. "], "author": "Greg Y.", "review": "SERVICE: If you speak Mandarin, service will be fantastic. If not, well, there's one dude who speaks English somewhat and he usually takes the orders. He also always recommends the garlic string beans without fail. They are pretty quick with the orders so if you're in a rush to go somewhere, you may want to consider a quick lunch here! \n\nFOOD: Most things on the menu do not exceed $9. Just be mindful of how much you order. Seriously. Everything is so cheap that I need to constantly keep myself from ordering half the menu. To get a little taste of all they have to offer, I'd recommend 1 order of a dozen dumplings (I love the lamb and chives dumplings), 1 order of flat noodle soup with dumplings (comes with 6 more of your choosing), and of course, the garlic string beans. That's enough to share between 2 people. Their dumplings are very juicy and seasoned well, that's what separates them from the rest. \n\nATMOSPHERE: Small place. It's not unusual to see a line of people outside this place on the weekends. Restaurant traffic flows pretty quickly so it's not a bad wait most of the time. This place is dirty/sticky too. But after writing several reviews like this, I'm starting to believe all the best places to grub are like this too. I'm going to choose to believe that these places choose to pour all their energy and resources into their food, hence the lack of time and funds for restaurant upkeep!", "rating": 4, "date": "2016-02-29"}, {"excerpts": ["Pig ears, garlic string beans,onion pancake, and pork amd napa cabbage...."], "author": "Classy M.", "review": "Sooooooo good!!! Pig ears, garlic string beans,onion pancake, and pork amd napa cabbage....", "rating": 5, "date": "2018-03-02"}, {"excerpts": ["I also love their garlic string beans and garlic cucumbers, very fresh, flavorful, and crunchy. ", "The beef pancake is a pretty good size and tastes good also. ", "It is a little oily, but that is to be expected with these types of pancakes. ", "Recently, I tried their beef stew noodle soup, which has a nice and soothing soup broth with plenty chunks of beef stew, soft and delicious noodles, fresh bok choy, and mushrooms. "], "author": "Jean S.", "review": "It's been amazing to see this little hole in the wall dumpling shop grow into its \"kingdom.\" About 10 or more years ago, I would walk by this tiny shop in the evenings and it would usually be empty with just the owner inside. Over the last half decade, it has exploded with popularity and now, the place is always packed with a regular group of people waiting outside. \n\nTheir dumplings are soothing and delicious! I always order the pork and napa cabbage dumplings, which has a nice soft skin and subtle juicy flavors in the dumplings. Although the flavors by itself are not heavy, it pairs perfectly with the soy sauce/vinegar provided. I also love their garlic string beans and garlic cucumbers, very fresh, flavorful, and crunchy. The beef pancake is a pretty good size and tastes good also. It is a little oily, but that is to be expected with these types of pancakes. Recently, I tried their beef stew noodle soup, which has a nice and soothing soup broth with plenty chunks of beef stew, soft and delicious noodles, fresh bok choy, and mushrooms. This would be perfect for a cold day.\n\nA couple items we ordered that I think I can skip next time - the salt pepper tofu and the green onion pancake. The salt pepper tofu lacked a good salt pepper flavor and instead, kind of had a little odd flavor to it. It was a little bland. The green onion pancake was not bad, but it should be ordered with traditional small dishes that compliment the green onion pancake. By itself, it was a little plain and a little dry.  \n\nIt was HOT inside the little restaurant. We sat at the table next to the kitchen, which made it even hotter. The owner and staff were very attentive and talkative. Although I do like eating here, I usually don't like to wait long for a table. I definitely would recommend this restaurant, but incase you don't like to wait, you can come before or after peak lunch/dinner times...OR you can buy frozen dumplings from their to-go shop on Taraval and bring them home to cook.", "rating": 4, "date": "2015-08-17"}, {"excerpts": ["We LOVED the garlic string beans. ", "The pancake was great, and both our dumplings were perfect. ", "Would eat again."], "author": "Rachel E.", "review": "Tiny little place with amazing food and a distinctly \"part-of-the-neighborhood\" vibe. We LOVED the garlic string beans. The pancake was great, and both our dumplings were perfect. Would eat again.", "rating": 5, "date": "2018-02-17"}, {"excerpts": [": I liked these overall - only comment would be maybe the filling:dough ratio could be improved a bit\n\nGarlic string beans: good, but disappointingly small portion for the price\n\n"], "author": "Delia Z.", "review": "I would say this is a place more for the boiled dumplings (jiaozi) than anything else. They have a lot of filling options, and they're all rather cheap. Other items we ordered:\n\nChicken wings: not much flavor at all, small portion size for the price, and overcooked/dry\n\nXiaolongbao: good texture and amount of broth, but also a bit lacking in flavor\n\nShengjianbao: I liked these overall - only comment would be maybe the filling:dough ratio could be improved a bit\n\nGarlic string beans: good, but disappointingly small portion for the price\n\nThis was my first visit, but I think I would only come here again if I wanted to get jiaozi. For all the other menu items, the prices were a bit too high for the portions, and Dumpling Kitchen does a better job with the Shanghai specialties.", "rating": 3, "date": "2015-06-21"}, {"excerpts": ["We ordered dumplings, garlic string beans, and chow mein. ", "We finished every single bite of all three of those dishes."], "author": "Dara S.", "review": "YUM! I'm not really sure what traditional Chinese food taste like, but this place seemed really authentic! Prices were good, food was delicious, and the service was great! \n\nThis is definitely a \"hole in the wall\" type of restaurant. I came on a random weekday night around 8pm and there was a huge crowd outside waiting to get seated. We waited for about 25 minutes, but the owner or host takes orders while you're outside waiting so when you finally get seated your food is ready! So time efficient and a great way to do business. \n\nWe ordered dumplings, garlic string beans, and chow mein. We finished every single bite of all three of those dishes.", "rating": 4, "date": "2016-01-06"}, {"excerpts": ["We tried the chicken and corn, chives and pork, Shanghai soup dumplings, garlic string beans, and the chive pancake. ", "All the dishes were sooo good ", "and I'll definitely be returning!!"], "author": "Kelly S.", "review": "I absolutely love the dumplings here! I used to coach the owners' daughter and they brought chicken and corn dumplings all the time and they're definitely my favorite. I finally visited kingdom of dumpling because I know longer coach her and missed their dumplings. LOL I came in around 6pm and there wasn't a wait. If I had come in any later there definitely would have been a line. It's a super small restaurant, but the food is delicious! We tried the chicken and corn, chives and pork, Shanghai soup dumplings, garlic string beans, and the chive pancake. All the dishes were sooo good and I'll definitely be returning!!", "rating": 4, "date": "2017-05-03"}, {"excerpts": ["- Chive pancake\n- Garlic string beans\n\n"], "author": "Kris C.", "review": "YUM DUMPLINGS!! My go-tos:\n\n- Shanghai soup dumplings\n- Chicken and corn dumplings\n- Pork, chives, and shrimp dumplings\n- Beef chow fun\n- Chive pancake\n- Garlic string beans\n\nDefinitely try dunking/bathing your dumplings (especially the shanghai soup dumplings!) in the ginger vinegar sauce. It took me a while to like that ginger vinegar sauce, but now I can't eat them without it! The orange spicy sauce on the table is also a must-try too - it gives a strong punch but it's very flavorful.\n\nService is one of those.. none-but-gets-the-job-done.. but that's okay because this place is pretty much a hole in the wall type restaurant. It can get stuffy in there... sometimes they leave the door open, sometimes not. To access the bathroom, you must pass the extremely small, humid, and stuffy kitchen... although it's pretty cool to have a glance of them cook and heat up the dumplings and what not!", "rating": 4, "date": "2015-09-30"}, {"excerpts": ["The garlic string beans and the green onion pancake on the other hand are really good still. ", "I like dipping the pancake into the sauce that comes on the string beans. ", "I love eating the farmer's cucumbers too cause it's refreshing. ", "One thing I do crave about this place is the spicy sauce! ", "They make their own concoction of peppers and spices that has the right amount of spiciness to it. "], "author": "Derek T.", "review": "This place used to be really good. The first time I came here years ago, I remembered that the Xiao Long Bao was amazing. Now, it's just alright...\n\nThe best thing about the Xiao Long Bao (soup dumplings) is that it's packed with a good amount of soup. There's very little meat inside the dumpling now compared before. And I don't really like the skin that holds everything together because it's so thick and chewy.\n\nThe garlic string beans and the green onion pancake on the other hand are really good still. I like dipping the pancake into the sauce that comes on the string beans. I love eating the farmer's cucumbers too cause it's refreshing. One thing I do crave about this place is the spicy sauce! They make their own concoction of peppers and spices that has the right amount of spiciness to it. My friends like to order the other dumplings with pork and green chives, but I think they're just okay.\n\nThe service here is decent. The owner is really friendly and always recognizes returning customers. He switched out our soup dumplings once because he said they didn't look good even after we ate almost half of it, which was nice.\n\nOverall, I do like coming here because I crave their food sometimes. It's also inexpensive to eat here which is a plus. I want to give this place four stars but I'm just a little sad it's not as good as it used to be...", "rating": 3, "date": "2015-12-22"}, {"excerpts": ["Garlic string beans ($6.95)\n\n"], "author": "Elena N.", "review": "2.5 STARS for Take Out\n\nSo I was in the area and since the roommate didn't want to wait for a table, we decided to get take out. Placed an order on Eat24 and got a confirmation my order would be ready in around 30 mins. I showed up around 30 mins later. \n\nWhen I walked in, no one would acknowledge me. When I finally talked to one of the ladies clearing a table, she checked in with someone from the kitchen. She told me to wait outside so I walked outside. After some back and forth between the employees, a man walked over to me and told me they didn't get my order. I mentioned that eat24 confirmed it, but he said since they have 2 locations, the boss who confirmed the order was at the other location so he hadn't sent the order to this restaurant yet. So I gave him my order again and waited outside. \n\nAt this point, the roommate had been circling around cuz parking in this area sucks. So now I had to tell him it'd be another 20 mins. He found a place to pull over but this was super annoying to say the least! The guy who took my order kept saying 5 more mins even though I knew it would take longer. We finally got our order and went home. We ordered the following:\n\nCrispy chicken wings ($5.95)\nShrimp dumpling with green chives ($6.95)\nShanghai soup dumpling ($4.95)\nShanghai pan fried soup dumpling ($4.95)\nPork pot sticker ($5.95)\nBeef pancake ($5.95)\nXO beef chow fun ($6.95)\nGarlic string beans ($6.95)\n\nI actually enjoyed a lot of the non dumpling dishes. The string beans were crunchy and flavorful. The XO beef chow fun had a good amount of beef and bean sprouts. The beef pancake was filled with delicious layers of beef. The dumplings were actually a disappointment. Not sure if it was cuz we got take out, but the Soup dumplings lost all their soup. The Shrimp dumpling with green chives was mostly chives and not so much shrimp.\n\nI might come back to sit down and eat since I really wanna try the deliciousness of the XLB that everyone seems to have experienced. But I'll probably never get take out from them again. If you decide to order online, make sure to call them to confirm!", "rating": 3, "date": "2014-05-18"}, {"excerpts": ["We got the onion pancakes, chives pancake, garlic string beans, pork and napa dumpling, pork shrimp and chives dumpling, and soup dumplings came out to be around $42 before tips. "], "author": "Bill Q.", "review": "3.5 stars\n\nI've been hearing a lot about this place and finally got the chance to try it. It is a pretty good spot for dumplings and other dishes. We got the onion pancakes, chives pancake, garlic string beans, pork and napa dumpling, pork shrimp and chives dumpling, and soup dumplings came out to be around $42 before tips. This was able to feed 4 people without a problem.\n\nAll the food was pretty darn good, tasty with good textures. The dumpling skins were really on point went we tried it, soft and moist with the a bit of chewiness. The soup dumpling really stood out, they were done well with the explosion of soup in the middle. Super tasty food. \n\nNotes:\nThere is plenty of street parking all around, you might have to walk a bit but it will be worth it. \n\nThe staff are generally friendly and the venue is pretty small. They have a small bathroom in the back. You have to go through the kitchen.", "rating": 4, "date": "2014-07-24"}, {"excerpts": ["The garlic string beans are pretty standard but tasty and the beef pancake is the one item that we probably would not order again. "], "author": "Andrew Y.", "review": "Initially we set out to try Dumpling Kitchen down the street, but they were closed for their holiday. What started out as a bummer, turned into a fortuitous brunch venture. We arrived a little earlier than the opening time posted, but were allowed to seat ourselves while the restaurant staff prepped for service. \n\nIn scale, the Kingdom of Dumpling was not so majestic: the restaurant is actually tiny; the dining room seats about 20 customers. The service was friendly and efficient. \n\nWe ordered, two orders of XLB, pork and corn dumplings, garlic green beans, cucumber salad, sesame beef pancake. The XLB were juicy and delicious and did not disappoint. Bathed in vinegar and their house hot sauce, these small delicious bites are sure to please. The corn flavor in the pork and corn dumplings was well balanced also making them a sweet addition to our meal. If you arrive hungry, the cucumber salad comes out almost immediately to fend off your hunger, but it's nothing to write home about. The garlic string beans are pretty standard but tasty and the beef pancake is the one item that we probably would not order again. It's all about the dumplings!\n\nOverall, we're really glad a small misfortune pushed us to try this little gem. It didn't hurt that the owner played an eager and warm host! We will definitely be back.", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["We ended up ordering: the chicken and Napa cabbage dumplings (12 pieces), chicken chow mein, garlic string beans, and the chicken and spinach soup with wide noodles.\n\n", "The garlic string beans were delicious! ", "I haven't had them anywhere else, so I can't compare it to another place. "], "author": "Fallon P.", "review": "Legit hole-in-the-wall! I've only been here once so far and I already love it!\n\nThe bf and I stopped by on a late Thursday afternoon, so we obviously didn't have to wait for a table. There were only 3 people dining inside. Anyway, my first impression was that the place was super small. So, the wait for dinner and the weekend must be long!\n\nWe ended up ordering: the chicken and Napa cabbage dumplings (12 pieces), chicken chow mein, garlic string beans, and the chicken and spinach soup with wide noodles.\n\nThe dumplings were good. The soy sauce that comes with it definitely helped with the flavor. \n\nI loved their chicken chow mein! I can probably eat the whole plate without sharing! The best chow mein I've tasted in a long time. \n\nThe garlic string beans were delicious! I haven't had them anywhere else, so I can't compare it to another place. But, a must order for sure!\n\nThe chicken and spinach noodle soup was disappointing. It was very bland and that's how I know they didn't use MSG. There was no flavor whatsoever. I had to put soy sauce in it. I don't recommend it. \n\nAll in all, good place to get your dumplings fix and other Chinese comfort food. Service wasn't the best, but by no means a deal breaker. \n\nTotal: $32+ including tip.", "rating": 4, "date": "2014-03-29"}, {"excerpts": ["The owner always suggests an appetizer when I order, such as salt & pepper tofu or garlic string beans - it ends up being delicious. \n\n"], "author": "Theresa M.", "review": "I'm in love with their green chives pancakes. The dumplings are good too, but the pancake is where it's at. They take awhile to make though - they said they can only cook one order of pancakes at a time. \n\nThe owner always suggests an appetizer when I order, such as salt & pepper tofu or garlic string beans - it ends up being delicious. \n\nIt gets really warm in there, which is great on cold nights, and not-so-great on hot afternoons.", "rating": 4, "date": "2015-10-05"}, {"excerpts": ["When I come here I usually order the Shanghai Soup Dumplings, Pork and Corn Dumplings, Garlic String Beans, Grilled Chicken Fried Rice, XO Beef Chowfun, and Onion Pancake. "], "author": "Ilene B.", "review": "KOD! I love this place for their dumplings and infamous orange hot sauce!! They need to sell that sauce in bottles btw lol \n\nWhen I come here I usually order the Shanghai Soup Dumplings, Pork and Corn Dumplings, Garlic String Beans, Grilled Chicken Fried Rice, XO Beef Chowfun, and Onion Pancake. Soo yummy!\n\nThe owner is super friendly and always makes the effort to make sure his customers are enjoying their meal. However, the servers could step up their game a bit. If you need a refill on water, they are quite slow and often forget. Nevertheless, I continue coming back for their amazing food! :)", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["GARLIC STRING BEANS: ", "These were AMAZING. ", "I swore there was crack in it or something. ", "I couldn't stop eating them. \n", "3) ", "GREEN ONION PANCAKE: ", "The Shanghai Dumpling King green onion pancake was a huge disappointment, so I was scared to get it here as well. ", "However, they made it well ", "it -- flaky goodness.\n", "4", ") SHANGHAI DONUTS: ", "We weren't sure what this was, so we decided to get it. ", "It's a flaky pastry with white sesame on top and black sesame filling within it. ", "It was not too filling and not too sweet. "], "author": "Joanne W.", "review": "So I've been to Shanghai Dumpling King.\nSo I've been to Dumpling Kitchen.\n\nBoth have been exceptional.\n\nMy friend and I decided that we wanted XLB that evening -- but the issue was this: we were driving from Point Reyes back to the city -- and we were reaching 9PM and we had to return our Zipcar in the Alamo Square area. Calculating the time, we figured out that we wouldn't make it to Dumpling Kitchen because it closes at 9:00 PM. Both Shanghai Dumpling King and Kingdom of Dumpling closed at 9:30 PM. We decided to go to Kingdom of Dumpling considering we both have never been there AND it's Zagat rated.\n\nWe were quickly seated (like whoa)! We had a little corner table to ourself. We ordered the following:\n1) XIAO LONG BAOS: Okay - you can do no wrong. The XLBs were totally on fleek.\n2) GARLIC STRING BEANS: These were AMAZING. I swore there was crack in it or something. I couldn't stop eating them. \n3) GREEN ONION PANCAKE: The Shanghai Dumpling King green onion pancake was a huge disappointment, so I was scared to get it here as well. However, they made it well it -- flaky goodness.\n4) SHANGHAI DONUTS: We weren't sure what this was, so we decided to get it. It's a flaky pastry with white sesame on top and black sesame filling within it. It was not too filling and not too sweet. Just the way I like it.\n\nMy friend and I were really happy with the amount of food that we had -- it was filling but we weren't dying from fullness.\n\nWould definitely come back again -- I'm just afraid of how packed it might be at a normal time (like... 6/7 PM).", "rating": 5, "date": "2015-04-06"}, {"excerpts": ["Moved on to the garlic string beans which were okay, but came out as a small potion.\n\n"], "author": "Derek S.", "review": "Came by for brunch the other day as Yelpers claim that this is \"the\" spot for dumplings in the City...\n\nThe restaurant is non-nondescript and parking is on the street only. Upon arrival, shortly before 12, we were immediately seated inside the hot and steamy restaurant...\n\nStarted off with the spicy beef tendon which was spicy and okay.\n\nMoved on to the beef pancake which was the highlight of the meal with the contrasting crispy pancake with the soft beef.\n\nThe Xlbs were mediocre as the meat was rather coarse and the skin was on the thick side...Cooking Papa's has better xlbs...\n\nMoved on to the garlic string beans which were okay, but came out as a small potion.\n\nLastly, we had the XO sauce beef chow fun. ...the dish didn't seem like it had any XO sauce in it..\n\nService was okay and they accept Visa/MC over $15.", "rating": 3, "date": "2012-08-25"}, {"excerpts": ["We followed up with garlic string beans, pork and chive dumplings, and Shanghai soup dumplings (aka xiao long bao) . ", "The garlic string beans were excellent, and we really liked the pork and chive dumplings, which were very plump and juicy. "], "author": "Allen T.", "review": "Kingdom of Dumpling is a little hole in the wall in the Sunset District that serves some really tasty dumplings.  They're pretty popular, and we had to wait about 15 minutes the Wednesday night that we went there.\n\nAs per the waiter's suggestion, we started off with the cilantro bean noodle, which is something that I never would have ordered, but it was surprisingly tasty and refreshing.  It's just stringy cold tofu noodles with what tasted like soy sauce and sesame oil, with a sprig of cilantro on top. It's very simple but very tasty.\n\nWe followed up with garlic string beans, pork and chive dumplings, and Shanghai soup dumplings (aka xiao long bao) . The garlic string beans were excellent, and we really liked the pork and chive dumplings, which were very plump and juicy. The soup dumplings were also pretty good, with a nice burst of liquid pork fat with every bite. \n\nEverything was really cheap ( $25 with tax and tip) and very tasty. Definitely looking forward to going back.", "rating": 4, "date": "2015-03-11"}, {"excerpts": ["The server talked us into ordering the garlic string beans. ", "Meh, these were okay. ", "I  can make better Sichuan green beans. ", "Theirs were salty without much flavor. ", "I'd cook mine with dried shrimp, mustard greens, and minced ginger. ", "I had a feeling that this plate was more suited for the American palate. "], "author": "Jennie T.", "review": "The wait is a bit ridiculous here. Good xiao long bao? Yes, it had a lot of potential! The best I ever had? Uh, not really. They give you six pieces, and by the time I finished my two (I split with my sister), the third had very little soup left in it. It seems that the skin soaked up a lot of the soup. That was a bit disappointing for me.\n\nMy sister and I also ordered the pork and cabbage dumplings which comes 12 pieces to a plate. These were good. I liked them a lot. In fact, I think I liked them more than the xiao long bao.\n\nWe also ordered a plate of the onion pancake because the server suggested that the chive pocket would take 45 minutes (time we didn't think we had). These were good, but he gave us the impression that the three items that we ordered wouldn't be enough. \n\nThe server talked us into ordering the garlic string beans. Meh, these were okay. I  can make better Sichuan green beans. Theirs were salty without much flavor. I'd cook mine with dried shrimp, mustard greens, and minced ginger. I had a feeling that this plate was more suited for the American palate. It was not spicy at all; don't pay any attention to the chili symbol on the menu.\n\nIn short, I'd come here again for dumplings but not much else.", "rating": 3, "date": "2012-05-31"}, {"excerpts": ["Garlic string beans-it was filled with a lot of soy sauce but didn't over power the beans at all. \n", "Scallion pancake: could've been a bit crispier. \n"], "author": "Christine T.", "review": "Kingdom of Dumpling is a hole in the wall joint that serves delicious handmade dumplings. \nThe restaurant itself has about 10 2-seat table tops. \nCome here right when they open or expect a long wait. \nI got there about 15 minutes after they opened and scored the last table before the wait list started forming.\n\nXiao long bao- excellent in taste and so juicy!\nGarlic string beans-it was filled with a lot of soy sauce but didn't over power the beans at all. \nScallion pancake: could've been a bit crispier. \nPork and shrimp dumpling with green chives - excellent! \n\nParking:  metered parking. Make sure to bring quarters!! The people here will not give you more than 4 quarters. I had to go to several shops to get change.", "rating": 4, "date": "2014-01-17"}, {"excerpts": ["We had garlic string beans, bok choy, pan seared soup dumplings and pork and cabbage dumplings. ", "It was packed the whole time and that was because the food was SO GOOD! ", "Will be back for sure."], "author": "Jessa Y.", "review": "Loved it. Hole in the wall? Yep. Old school grungy dining room? Yep. Way too tiny for the number of people in there? Fo sho. BUT the food is awesome. We had garlic string beans, bok choy, pan seared soup dumplings and pork and cabbage dumplings. It was packed the whole time and that was because the food was SO GOOD! Will be back for sure.", "rating": 5, "date": "2014-10-18"}, {"excerpts": ["I came in a group of four and we ordered a bunch of food - onion pancakes, chives pancakes, garlic string beans, pork and napa dumpling, pork shrimp and chives dumping, and of course, their famous Shanghai soup dumplings. ", "It was a bunch of food for an affordable price. ", "Out of all the food we ordered, I would have to say that my favorites were the onion pancakes and the soup dumplings. ", "All of their dumplings are well made, and I especially love their dumpling skins. "], "author": "Lisa T.", "review": "3.5\n\nI came in a group of four and we ordered a bunch of food - onion pancakes, chives pancakes, garlic string beans, pork and napa dumpling, pork shrimp and chives dumping, and of course, their famous Shanghai soup dumplings. It was a bunch of food for an affordable price. Out of all the food we ordered, I would have to say that my favorites were the onion pancakes and the soup dumplings. All of their dumplings are well made, and I especially love their dumpling skins. It's not the fragile type that breaks when you hold it up - it's thick and chewy.\n\nThe place is a bit small so I can see it being a bit problematic when it gets busy, but the area has plenty of street parking. Overall, worth the experience!", "rating": 4, "date": "2014-07-24"}, {"excerpts": ["Next time, I'll try the dumplings and garlic string beans.  ", "I heard those were good. ", "Maybe I'll even eat with a friend so that I can try more dishes."], "author": "Laina T.", "review": "I came here on a Saturday evening all by myself.  First, make sure you sign in on the clipboard to the left of the entrance.  I stood around for awhile without any acknowledgement from the workers.  It wasn't until a guy signed in first, then I signed in.  He was nice enough to let me go ahead of him when the waiter called out our names.\n\nI waited approximately half an hour in the cold.  Seating seemed to go in waves.  A bunch of the first round of diners finished around the same time.  The restaurant was small with a few tables.  The largest table seated six people, but they looked like they were cramped into the corner.  \n\nI ordered the pork and shrimp wonton noodle soup and onion pancake.  The soup came with a good amount of wontons, bok choy, shiitake mushrooms, and wide rice noodles.  The broth was okay.  It could have used a bit more seasoning.  The wontons had a good taste and the wrapper was cooked just right.  The onion pancake wasn't memorable.  It had a few pieces of green onion here and there.  I dipped it into the hot sauce that was on the table.  Be careful.  It's tangy and very spicy!\n\nAs I finished my two dishes, I noticed that the table beside me had ordered the lamb skewers.  They looked like they were enjoying it and I love lamb skewers!  Even though the waiter who took my order said they only take one order, I asked the waitress if I could order the lamb skewers to go.  She obliged and said I would have to wait.  I was fine with that.  I brought the box of lamb skewers to my car and ate two skewers.  Oh, they were so delicious!  The meat was flavorful with a little kick.  It was fairly lean and super tender.  Four skewers for less than $7, that's a bargain.  \n\nPrices were very reasonable.  Next time, I'll try the dumplings and garlic string beans.  I heard those were good. Maybe I'll even eat with a friend so that I can try more dishes.", "rating": 4, "date": "2013-06-18"}, {"excerpts": ["we ordered the xiao long bao, the dumplings with chives, onion pancakes with chives, and garlic string beans. ", "everything came out pretty fast, unlike what i've read in other reviews. ", "the dumplings were pretty delish and i had no complaints or thoughts, other than the fact that i wished i had a bigger stomach ", "so i could try more! ", "the garlic string beans were typical of asian restaurants. ", "one thing i did want to note is that the \"onion pancake with chive\" is NOT the usual \"green onion pancake\" that you order at another restaurant. ", "this \"onion pancake with chive\" was huge and almost like a quesadilla/omelette, with onions, egg, and vermicelli noodle inside! "], "author": "Caitlin C.", "review": "came here for some soup dumpling therapy on a sunday morning! i always mix this place up with dumpling kitchen down the street, but i've actually never tried kingdom of dumpling until now! the restaurant is pretty small, with only a handful of 4 people tables. at around 12pm, the wait for a party of 2 was only about 10 minutes. there were, however, a bunch of 4 person parties who were waiting before us and still were waiting when we were seated.\n\none thing to note about this place was that the ventilation is TERRIBLE. walking into the restaurant was like walking into a sauna. the doors were open, but it was still super muggy. i'm pretty sure if i had my glasses on, they would fog up completely. by the end of the meal, my friend and i were both perspiring quite profusely.\n\nwe ordered the xiao long bao, the dumplings with chives, onion pancakes with chives, and garlic string beans. everything came out pretty fast, unlike what i've read in other reviews. the dumplings were pretty delish and i had no complaints or thoughts, other than the fact that i wished i had a bigger stomach so i could try more! the garlic string beans were typical of asian restaurants. one thing i did want to note is that the \"onion pancake with chive\" is NOT the usual \"green onion pancake\" that you order at another restaurant. this \"onion pancake with chive\" was huge and almost like a quesadilla/omelette, with onions, egg, and vermicelli noodle inside! don't get me wrong, it was still yummy, but definitely not what we had expected.\n\noverall the food was good, but it wasn't jaw dropping or mind blowing. i would come here again to try the other dumpling types, though! i would definitely wear less clean, sweat friendly clothes as well.\n\nthis place takes card (unlike dumpling kitchen), just fyi!", "rating": 3, "date": "2015-07-15"}, {"excerpts": ["The only thing that was decent at the restaurant is the garlic string beans."], "author": "Zha L.", "review": "Bad dumplings!!\n\nI honestly don't see what's the hype about this place! Just like everyone else, I was intrigued by the amount of reviews this place has. I love finding hole in a wall restaurants with awesome hearty food, but this is not one of them. \n\nThe dumplings were very disappointing and lacked on flavor.  I don't think they have marinated the meat well enough to make it more savory. The quality of the XLB was also so-so. The lamb skewers were okay, but over spiced. The only thing that was decent at the restaurant is the garlic string beans.", "rating": 2, "date": "2013-01-30"}, {"excerpts": ["YUM\n- garlic string beans "], "author": "Vol T.", "review": "We came here on Thanksgiving day.. figuring no one else would show up LOL. There were quite a few people but we got a table right away. Thankfully because this place is super tiny. I've walked by here before and have seen the long lines outside. Also it does get very warm/hot inside so dress in layers, jacket you can take off if it's cold. \n\nService is ok. I think the young guy working was upset to have to work on turkey day LOL. But other than that food was delivered quickly, and service was efficient if not friendly. \n\nFood:\n- salt pepper tofu was Ok\n- crispy chicken wings were good, they are actually sweet in sweet sauce\n- pork dumpling with corn YUM\n- shanghai soup dumpling (xia long bao) YUM\n- garlic string beans YUM\n\nThese were more than enough for 2 people, and very cheap. We'd order any of the dumplings there, very good. I did not give them 5 stars because there is a better place just down the street.. and I really don't want to tell LOL .. ok it's House of Pancakes. Kingdom of Dumpling is good though!\n\nOh and we live downtown but take L Taraval often to go to this part of town because of the really awesome Chinese food!", "rating": 4, "date": "2013-12-03"}, {"excerpts": ["Garlic String Beans - yum overall and no complaints.\n", "Lamb Dumplings - surprisingly not bad. ", "I was afraid of the gaminess, but it actually wasn't too bad and was a nice out of the norm dumpling. ", "The soup/broth generated was nice also.\n", "Pork and Shrimp Dumplings - shrimp flavor was a bit lacking, but these were pretty good, juicy/soupy, and flavorful overall.\n"], "author": "Lana N.", "review": "Kingdom of Dumpling is the epitome of hole in the wall. The place is maybe the size of a (nice) walk in closet... no more than 20 people are seated inside, and even with that... you're packed in like sardines. We came in with a group of 6 people and it was a tight squeeze; wouldn't recommend this place for large parties... though by the time we got seated, we were all starving and it was a perfect opportunity to feast and try all they had to offer. \n\n4stars\nEgg and Chive Dumplings - no meat but surprisingly good; I could eat these all day!\nPork and Corn Dumplings - a favorite amongst the group! The bits of corn provided a sweetness that you don't normally see.\nBeef Sesame Roll - crispy fried sesame pancake with marinated beef inside... nothing like I've seen and really good! Not too oily either :)\n\n3stars\nBean Curd Noodles - nothing extraordinary but nice starter.\nGarlic String Beans - yum overall and no complaints.\nLamb Dumplings - surprisingly not bad. I was afraid of the gaminess, but it actually wasn't too bad and was a nice out of the norm dumpling. The soup/broth generated was nice also.\nPork and Shrimp Dumplings - shrimp flavor was a bit lacking, but these were pretty good, juicy/soupy, and flavorful overall.\nBeef Pancake - oily and pan fried, a fave amongst the boys. \n\n2stars\nPork and Napa Cabbage Dumplings - nothing extraordinary, I'd try pork and chive instead.\nXiao Long Bao (Pork Soup Dumplings) - these were disappointing. The skins were thick and chewy, and there was little to no meat, plus the meat and soup wasn't flavorful. The XLB were a definite low for KofD.\n\nIf you're not looking for specifically XLB, KofD is great! Beware of the small space though if you're coming with a group as there is generally a wait regardless of if its even just a party of 2. Marco Polo Italian Ice Cream (http://www.yelp.com/biz/marco-polo-italian-ice-cream-san-francisco#hrid:POR2qEzyUC_Ke7ZMcSQ-AA) is down the street though, which is great enough for me to consider coming back here.... but honestly I'd probably go elsewhere though for my dumplings since I'm searching more for XLB. Plus KofD does have a take-out grocery location... and how hard can it be to boil some dumplings??", "rating": 3, "date": "2013-01-05"}, {"excerpts": ["One of the things that I didn't discover until my 5th or 6th visit here is their GARLIC STRING BEANS. ", "I'll just leave it at that and leave you to discover for you its greatness. ", "We had to get two orders of that because it was just so good. "], "author": "Chris S.", "review": "tl;dr\n\nGreat place for a Chinese Dumplings 101 since they've apparently mastered the art of conjuring dumplings. Just come when you're hungry and hope there's not a long wait.\n\n---\n\nMy mom is from NE China (aka. home of fat dumplings and tall women), so I've literally had dumplings as soon as I could eat solid food. During Chinese New Year, my mom used to go to the bank to exchange completely new coins to be added to the filling and randomly wrapped into dumplings. The people who get the coins in their dumplings during the big family dinner is supposed to have a prosperous new year :)\n\nKingdom of Dumpling (KOD for short) is quite good, on par with Prosperity Dumpling in NYC if you've ever been there. They have a lot of variations so you'll probably find something you like.\n\nI love the cabbage and pork dumpling here - it's well balanced and perfectly seasoned. Napa cabbages usually emit a lot of water when cooked so even my mom's cabbage/pork dumplings tend to be soggier when she makes them, but you don't really find that at KOD. They're just perfect bursts of flavor and joy here :)\n\nIf you want a more nuanced taste, just replace cabbage with chives. Note they're not the western chives that you see on top of smoked salmon sometimes. Chinese chives have a stronger flavor, kind of like a mild green onion - it's great, try it! There, I've described for you the two big Chinese dumpling staples - cabbage and chives.\n\nOf course, depending on your dietary habit you could swap pork out for shrimp or chicken or even beef/lamb. I don't think I've ever tried a beef dumpling at KOD but their lamb dumplings were a surprising let-down (actually kind of bland). Their shrimp one is also good (although still a stretch from the pork IMO), if you want to switch things up a bit.\n\nOne of the things that I didn't discover until my 5th or 6th visit here is their GARLIC STRING BEANS. I'll just leave it at that and leave you to discover for you its greatness. We had to get two orders of that because it was just so good. The baby bok choy is a milder version of the string beans (and less oily :P), just FYI.\n\nIf you come by yourself, I'd recommend getting a boiled dumpling, another type of dumpling*, and you're good to go. It'll come out to about $15, but you'll feel great after washing everything down with a pot of tea :)\n\n* other dumpling assessments:\nXiao Long Bao - they have the funniest shaped XLBs I've ever seen...they're shaped like little turrets. They're not bad, but they're also not ridiculously good. Try it once and decide if you want to keep getting it - it's good to switch things up a bit and have a steamed dumpling though.\n\nPan-fried versions - a hot oily griddle + dumpling is a match made in heaven\n\nor you can also just get another order of boiled dumpling. or two. ;)\n\nps. The wait can be kind of long at lunch/dinner rush hours so try to come at an off time if you can. It'll save a lot of waiting since the restaurant is really small and there's no covered area to wait. Also, parking on Taraval can be kind of hard sometimes. I recommend parking on Santiago and then walking over.", "rating": 4, "date": "2013-01-18"}, {"excerpts": ["I always order the garlic string beans, pork&napa cabbage dumplings, pork&chives dumplings, and the XO beef chow fun. ", "I am not really a big fan of soup dumplings in general so can't say much about that ", "but the dumplings here are so delicious. ", "I like how it is small and is perfectly wrapped. ", "The owner of the place would usually walk around and make sure everything is okay. ", "The place is very, very small but you can get a table when you come during off times like at 2-4. ", "I knocked off one star because their portions are inconsistent. ", "Last time I came here, we got a very small portion of the XO beef chow fun and garlic string beans."], "author": "Crystal C.", "review": "I come here at least 3x a month :) Definitely a small hole in the wall place, but don't let that stop you from trying! One of my favorite places to eat in the city. I always order the garlic string beans, pork&napa cabbage dumplings, pork&chives dumplings, and the XO beef chow fun. I am not really a big fan of soup dumplings in general so can't say much about that but the dumplings here are so delicious. I like how it is small and is perfectly wrapped. The owner of the place would usually walk around and make sure everything is okay. The place is very, very small but you can get a table when you come during off times like at 2-4. I knocked off one star because their portions are inconsistent. Last time I came here, we got a very small portion of the XO beef chow fun and garlic string beans.", "rating": 4, "date": "2016-08-02"}, {"excerpts": ["We ordered pork dumpling with Napa cabbage, pork dumpling with green chives, pork and shrimp won ton with egg noodles, XO beef chow fun, XO chicken chow mein, garlic string beans, XLB, beef roll, and chicken dumplings. ", "Dumplings were juicy. ", "Pork and shrimp won ton with egg noodles in soup was good and temperature hot for a drizzly day in the city. ", "Grandma who has been having trouble eating had 10 chicken dumplings. ", "Garlic string beans were tasty and even the 8 year old had a few. ", "The dumplings were delicious and two granddaughters had no problem polishing off a platter of 12 dumplings. ", "There was not much food left on the table. ", "Everything tasted good. ", "Glad we had brunch here."], "author": "Belinda L.", "review": "Small place. Be patient. Host did a good job of combining 3 tables to sit together family party of 9. Additional help from male youth who set tables, brought menus, got extra soup bowls, and gave take out containers.\nWe ordered pork dumpling with Napa cabbage, pork dumpling with green chives, pork and shrimp won ton with egg noodles, XO beef chow fun, XO chicken chow mein, garlic string beans, XLB, beef roll, and chicken dumplings. Dumplings were juicy. Pork and shrimp won ton with egg noodles in soup was good and temperature hot for a drizzly day in the city. Grandma who has been having trouble eating had 10 chicken dumplings. Garlic string beans were tasty and even the 8 year old had a few. The dumplings were delicious and two granddaughters had no problem polishing off a platter of 12 dumplings. There was not much food left on the table. Everything tasted good. Glad we had brunch here.", "rating": 4, "date": "2015-07-08"}, {"excerpts": ["GARLIC STRING BEANS - These were yummy, but nothing special.\n\n"], "author": "Cindy T.", "review": "My husband and I were pretty amped when we rolled up to Kingdom of Dumpling at 8pm on a weeknight to see the little restaurant packed with diners and many names on a list by the door. While we're not fond of crowds or lines, it's usually a good sign at a restaurant. Also a good sign - all of the patrons were Chinese (points to the food being authentic). \n\nWe were seated soon enough. It was chilly outside, yet the kitchen made the dining room feel like the inside of a furnace. Thank goodness I dressed in layers. \n\nThe owner, managed the room with the theatrical flourish of a ringmaster, and alternated between greeting people, seating people, and taking orders. Since he was so busy, when you're ready to order, you have to be assertive to get his attention. When placing your order, stand tough. No matter what you've already decided on, he'll attempt to cajole you into also ordering an extra appetizer or one of their other specialties. My husband and I weren't prepared for the onslaught, and I'll sheepishly admit we ended up ordering 6 dishes between the 2 of us (lotsa leftovers!). I've listed them below FROM BEST TO WORST.\n\n1) STEAMED XIAO LONG BAO - This is what we came for, and they didn't disappoint.  The hot, juicy little buns had just the right balance of meat and fat. The wrapping could stand to be thinner, but then I'm holding them to a high bar against the likes of Ding Tai Fong.\n \n2) SESAME PANCAKE WITH STEWED BEEF - Just like what I ate at home growing up. My husband couldn't get enough of this. Word to the wise: if you like spice, try it dipped it in their secret hot sauce. \n\n3) GRILLED LAMB SKEWERS - This is apparently a popular street food in Beijing. Smoky cumin is the standout flavor and the meat itself is really tender. But I didn't like the occasional mouthful of fat. I would have been happy eating 1 skewer, no more.  \n\n4) GARLIC STRING BEANS - These were yummy, but nothing special.\n\n5) PORK, SHRIMP, AND CHIVE DUMPLINGS - For a place called Kingdom of Dumpling, I had high expectations. However, ours were overcooked. Several of the skins had broken apart and were mushy to the bite. The saving grace was that the few intact ones had a good amount of juice, like in the xiao long bao. \n\n6) PORK & CHINESE SPINACH WONTON SOUP WITH WIDE RICE NOODLES - Uber bland. We ordered this because many other patrons had ordered it. Big mistake. The broth was straight up chicken broth. The wonton skins were mushy and as flavorless as the broth.\n\nAll in all, the dishes were a little hit or miss and I didn't care for the up-selling, especially when we already had too much food. However, I would consider coming back some day.", "rating": 3, "date": "2013-11-07"}, {"excerpts": ["Also had the garlic string beans and chicken fried rice. ", "All the dishes were delicious and their homemade hot sauce was unlike any we've had."], "author": "Gaby E.", "review": "New to the sunset, we decided to check out this small restaurant as driving by one night there was this huge line in front and it caught our eye. I came here from NY so I've had my share of great dumplings. This place is super small but very welcoming with gingham red and white tablecloths. The staff is super friendly. We got there for an early dinner beating the dinner crowd that started piling up when we left. Had the onion pancake which was a nice thin pancake with the right amount of onion. Also had the garlic string beans and chicken fried rice. All the dishes were delicious and their homemade hot sauce was unlike any we've had.", "rating": 4, "date": "2015-01-29"}, {"excerpts": ["We followed up with garlic string beans, pork and celery dumplings, beef chow fun and Shanghai soup dumplings (aka xiao long bao) . ", "The garlic string beans were excellent, and we really liked the pork and celery dumplings, which were very plump and juicy. ", "The chow fun was great. ", "Tender beef and fresh fat rice noodle. ", "The soup dumplings were also pretty good, with a nice burst of liquid pork fat with every bite. \n", "Still my best dump-place!"], "author": "Nobu K.", "review": "Yes, you would not mind keep the dumplings in your footlocker.\nIt is that good.\n\nGunnery Sergeant Hartman: Holy Jesus! What is that? What the fuck is that? WHAT IS THAT, PRIVATE PYLE?\nPrivate Gomer Pyle: Sir, pork and chive dumplings, sir!\nGunnery Sergeant Hartman: pork and chive dumplings?\nPrivate Gomer Pyle: Sir, yes, sir!\nGunnery Sergeant Hartman: How did it get here?\nPrivate Gomer Pyle: Sir, I took it from the Kingdom of Dump, sir!\nGunnery Sergeant Hartman: Is chow allowed in the barracks, Private Pyle?\nPrivate Gomer Pyle: Sir, yes, sir!\nGunnery Sergeant Hartman: Are you allowed to eat pork and chive dumplings, Private Pyle?\nPrivate Gomer Pyle: Sir, Yes, sir!\nGunnery Sergeant Hartman: And why, Private Pyle?\nPrivate Gomer Pyle: Sir, because I'm too heavy, sir!\nGunnery Sergeant Hartman: Because you are a disgusting fat body, Private Pyle!\nPrivate Gomer Pyle: Sir, yes, sir!\nGunnery Sergeant Hartman: Then why did you try to sneak pork and chive dumplings in your footlocker, Private Pyle?\nPrivate Gomer Pyle: Sir, because I was hungry, sir!\nGunnery Sergeant Hartman: Because you were hungry...\n[turns and addresses rest of platoon]\nGunnery Sergeant Hartman: Private Pyle has dishonored himself and dishonored the platoon. I have tried to help him. But I have failed. I have failed because YOU have not helped me. YOU people have not given Private Pyle the proper motivation! So, from now on, whenever Private Pyle fucks up, I will not punish him! I will punish all of YOU! And the way I see it ladies, you owe me for pork and chive dumplings! NOW GET ON YOUR FACES!\n[rest of recruits get in front-leaning-rest position, Hartman turns to Pyle]\nGunnery Sergeant Hartman: Open your mouth!\n[shoves pork and chive dumplings into PYLE's mouth]\nGunnery Sergeant Hartman: They're payin' for it; YOU eat it! Ready! Exercise!\n\nfrom; Full Metal Jacket - Jelly Doughnut Scene\nhttps://www.youtube.com/watch?v=5NP8y63Ms4o\n\nJust makes want to eat more. Love the black vinegar.\nWe followed up with garlic string beans, pork and celery dumplings, beef chow fun and Shanghai soup dumplings (aka xiao long bao) . The garlic string beans were excellent, and we really liked the pork and celery dumplings, which were very plump and juicy. The chow fun was great. Tender beef and fresh fat rice noodle. The soup dumplings were also pretty good, with a nice burst of liquid pork fat with every bite. \nStill my best dump-place!", "rating": 5, "date": "2015-07-08"}, {"excerpts": ["We ordered the soup dumplings, shrimp and chives dumplings, pork and cabbage dumplings, lamb dumplings, crispy chicken, golden mushroom, and garlic string beans. \n\n", "The garlic string beans was the best on the table, but I wouldn't order again. ", "Everything was just bland. ", "Nothing was offensive, but nothing was notable. "], "author": "Philip B.", "review": "We ordered the soup dumplings, shrimp and chives dumplings, pork and cabbage dumplings, lamb dumplings, crispy chicken, golden mushroom, and garlic string beans. \n\nNothing stood out. The garlic string beans was the best on the table, but I wouldn't order again. Everything was just bland. Nothing was offensive, but nothing was notable. Maybe we hit an off night for the kitchen? \n\nWe sat by the window. There are signs taped to the inside of the window and there is undeniably black mold on those signs. Also, the lid of the hot sauce was black with something. \n\nNoticed the Zagat 2014 and 2015 stickers. My guess is that this restaurant is still riding those coat tails even though it is past it's prime.", "rating": 3, "date": "2016-04-30"}, {"excerpts": ["We ordered the XLB of course, onion pancake, garlic string beans, and chicken fried rice (ok I was embarrassed when my husband ordered that!)\n\n", "Garlic string beans were crisp, fresh, well seasoned, with a little char on them...", "omg yum ", "I want some right now! ", "The onion pancake was light, fluffy, crispy! ", "So good! "], "author": "Janee P.", "review": "I adore little hole in the wall places like this! And no joke, this place is teeny tiny. Eating here is an experience in and of itself. Crammed together with other patrons, sweaty, steam condensation on the windows, your elbow hitting the owner everytime you take a bite because he's standing over you to see your reaction. Oh did I mention the whole place shakes when the MUNI goes up the street? Visiting from AZ where everything is large and new and commercialized, I desperately wanted to take my husband for something authentic. We got it here for sure!\n\nThe food is amazing. Amazing! I told my husband, you know Chinese food doesn't have to be covered in sauce all the time! We ordered the XLB of course, onion pancake, garlic string beans, and chicken fried rice (ok I was embarrassed when my husband ordered that!)\n\nXLB was perfect! Good flavor too! Garlic string beans were crisp, fresh, well seasoned, with a little char on them...omg yum I want some right now! The onion pancake was light, fluffy, crispy! So good! I didn't waste my time with the fried rice but hubby said it was good.\n\nThey also bring jasmine tea. But if you want water, you'll need to ask for it. \n\nThe owner was very nice and accomodating as well. Oh I just loved eating here! And it's cheap! 4 dishes for $24!\n\nI can't give it 5 stars because I highly doubt the cleanliness of this place. I caught a glimpse of the kitchen as we were sitting down and screamed a little inside. Also there was a hair on my husband's plate. I mean, it's pretty dirty and run down, but to me it adds to the charm :) The place could use a good scrub down and some updating.", "rating": 4, "date": "2013-02-18"}, {"excerpts": ["Garlic String Beans - Mmmm, pretty simple but delicious. ", "The garlic soy sauce was the perfect seasoning, it wasn't too overbearing like many other places I've tried. ", "My only complaint, it's a little too oily for me.\n", "3. ", "Juicy Pork Dumpling - Actually tasted very similar to the Shrimp and Pork Dumplings, so I wouldn't recommend getting both.\n", "4. ", "Chow Fun - Pretty standard, lacks a little flavor in my opinion. \n", "5. ", "Crispy Chicken Wings ", "- These were a great choice, the flavoring was durrrrishush!\n", "6. ", "Beef Pancakes ", "- Okay, I lied...this was my FAVORITE dish. ", "It was like a little Asian burgers lol. ", "Thought a little on the fatty scale, I didn't mind it at all in this dish. "], "author": "Christina N.", "review": "Friends and I drove alllll the way across the city to get to here!\n\nDishes ordered:\n1. Shrimp & Pork Dumplings - Probably my favorite dish of them all. Super juicy and cooked to perfection.\n2. Garlic String Beans - Mmmm, pretty simple but delicious. The garlic soy sauce was the perfect seasoning, it wasn't too overbearing like many other places I've tried. My only complaint, it's a little too oily for me.\n3. Juicy Pork Dumpling - Actually tasted very similar to the Shrimp and Pork Dumplings, so I wouldn't recommend getting both.\n4. Chow Fun - Pretty standard, lacks a little flavor in my opinion. \n5. Crispy Chicken Wings - These were a great choice, the flavoring was durrrrishush!\n6. Beef Pancakes - Okay, I lied...this was my FAVORITE dish. It was like a little Asian burgers lol. Thought a little on the fatty scale, I didn't mind it at all in this dish. MUST TRY!\n\nOverall, with the exception of a few", "rating": 3, "date": "2014-03-25"}, {"excerpts": ["Also, be sure to get the garlic string beans!"], "author": "Jason S.", "review": "Always so delicious!!! The Shanghai Soup Dumplings are my favorite along with the pork and chives amid beef and carrot. Also, be sure to get the garlic string beans!", "rating": 5, "date": "2016-02-27"}, {"excerpts": ["We ordered three orders of soup dumplings, pan fried soup dumplings, beef chow fun, tendon soup, and garlic string beans. ", "Nothing really stood out except for the soup dumplings though. ", "Next time, definitely only ordering the dumps."], "author": "Angela S.", "review": "Best soup dumplings I've had ughhhhh. It's real cozy in there though so dress appropriately and prepare to get close to strangers. \nWe ordered three orders of soup dumplings, pan fried soup dumplings, beef chow fun, tendon soup, and garlic string beans. Nothing really stood out except for the soup dumplings though. Next time, definitely only ordering the dumps.", "rating": 5, "date": "2013-12-16"}, {"excerpts": ["Garlic string beans were crisp, garlicky, and quite oily. "], "author": "Lisa G.", "review": "I had been anticipating eating XLB in SF for months prior to my California trip.  I spent almost an hour on the Muni traveling to Kingdom of Dumpling, and I will advise others on XLB pilgrimages against wasting so much of their time: these soup dumplings are not worth the investment.\n\nThe restaurant itself is small, and there is a wait for tables during peak meal times. There is a sign-up sheet outside the door.\n\nThe XLBs (Shanghai soup dumplings on the menu) here have strangely sticky skins that were thicker than expected but paradoxically extra flimsy.  There were many breakages, and the dumplings were not filled with as much soup as I expected. The meat was also not very flavorful and had an over-processed, slightly chalky texture.\n\nThe shen jian bao were pretty good, but they are erroneously called \"Shanghai pan-fried soup dumplings\" on the menu-- these are not pan-fried XLB; there is no soup in these dumplings! They are more accurately small meat-filled buns that are pan-fried and steamed concurrently.  The \"skin\" is actually leavened dough instead of unleavened dumpling skin. These took about 20 min to come out because they are made fresh to order.\n\nGarlic string beans were crisp, garlicky, and quite oily. I like my string beans a little softer, but for fans of crisp string beans, these would probably be quite delectable.\n\nI had high hopes for Kingdom of Dumpling based on its hype, and I felt let down. It was not an awful experience, but I would recommend those who are seeking a XLB fix to look elsewhere.", "rating": 3, "date": "2014-07-16"}, {"excerpts": ["We ordered the garlic string beans, the green onion pancake, 3 orders of the xiao long bao, and 3 Thai-Iced Tea... all recommended from Yelp.\n\n", "Anyways, the garlic string beans were EXCELLENT. ", "It was prepared how my mom makes them (I'm Chinese), and I was happy eating them. ", "They stole the show of this meal, and I think the restaurant should consider changing their name to Kingdom of Garlic String Beans rather than Kingdom of Dumplings.\n\n"], "author": "Crystal L.", "review": "My two friends and I land in San Francisco and immediately open our yelp apps to find the \"best\"  Xiao Long Bao San Francisco has to offer. We find Kingdom of Dumpling with over 1000 reviews and a 4-star rating... so we unanimously decide to try it out!\n\nThe place is relatively small, there's about 8-10 tables and no public restroom. We waited around 10-15 minutes on a Thursday night and squished on a 2-person table. I didn't really mind that, given the space of the restaurant. We were just hungry!\n\nWe ordered the garlic string beans, the green onion pancake, 3 orders of the xiao long bao, and 3 Thai-Iced Tea... all recommended from Yelp.\n\nFirst, don't get the Thai Iced Tea. It tastes like milk. Trust me, just don't get it. I asked them to add more tea and got it back tasting the same. I have never experienced bad-tasting Thai tea and this place won that medal! I should have known better than to order Thai Iced Tea from a Chinese restaurant. \n\nAnyways, the garlic string beans were EXCELLENT. It was prepared how my mom makes them (I'm Chinese), and I was happy eating them. They stole the show of this meal, and I think the restaurant should consider changing their name to Kingdom of Garlic String Beans rather than Kingdom of Dumplings.\n\nThe dumplings weren't bad...... they just weren't as good as it gets. I think Din Tai Fung has set a high standard for dumplings and this place did not come even close. I think I need to stop getting dumplings when I'm in different cities and just stick to eating them when I'm in the Los Angeles area.\n\nCouple of tips if you want to come visit: you can only order once. This is kind of silly, but I understand why. The location is pretty small. I guess they want more people to get seated? Anyway, I can't say that the food was terrible, but I also can't say the food was delicious or noteworthy.", "rating": 3, "date": "2014-01-02"}, {"excerpts": ["Under Wok dishes, item 4 garlic string beans USD 6.95 was excellent, cooked, but still crispy, flavored with soy sauce, oil, garlic.  "], "author": "George L.", "review": "Initially, I was put off by the small space, cramped, not much in atmosphere, seating for twenty people, and hot inside just poking my head inside.  This wasn't my first pick though it was on my list, it was Dumpling Kitchen we trying for, but found them closed for vacation.  Placed our name, number of people on a paper list, hanging by the doorway.  Wasn't too long, we got a table.\n\nUnder dim sum, item 2 the Shanghai pan fry soup dumplings (4) USD 4.95 wasn't available - a disappointment, so we settled on item 1 the Shanghai soup dumplings (6) USD 4.95, which was really good, but it was the pan fried, which I have had in Shanghai at Yang's Fried Dumpling which I considered to be the gold standard to measure other dumplings which none have come across to be as good.  Item 5 onion pancakes (1) USD 3.95, cut into eight pieces stacked, was hot, oily, crispy, quite tasty, I liked it.\n\nUnder latest new dishes, item 3 the grilled skewered lamb (4) USD 6.95, a slow low mild spiciness that builds, was very tasty; item 18 garlic black fungus with cucumbers with vinegar and garlic USD 5.95, was a cold, slightly crunchy, quite tasty and different.  Q style jelly fish is one of their latest items not on their printed menu, but is posted on the wall.  Also under this catagory are:  green chives dumpling with egg, farmer's cucumber, boiled peanut with celery.\n\nUnder Wok dishes, item 4 garlic string beans USD 6.95 was excellent, cooked, but still crispy, flavored with soy sauce, oil, garlic.  Under drinks, item 2 Thai tea USD 1.75 was iced, sweentened with milk, tasty, not too sweet as I have tasted at other places.\n\nWe ordered one dish too many or didn't really need.  This was before adding the onion pancakes afterward, asked if this was enough food, our waitress said not, so we added under soup noodle, item 1 pork & shrimp wonton with wide rice noodle USD 5.95, which came after every other dish ordered was okay, I thought the wonton skin was rather thick, the soup base passable, but Yin Du Wonton Noodle on Pacific Ave at Beckett St would be superior with thin wonton skin, amazing soup base.\n\nRecommend calling to see if they have Shanghai pan fried soup dumplings before making the trek to the restaurant.  But almost everything we ordered was very good.  The complimentary house tea arrived with a single tea bag and we thought didn't impart much flavor till the end of our meal when the tea was no longer hot.  We noticed a private tour bus pulled up and parked right in front, and service was provided to the passengers on the bus.  Credit cards accepted.\n\nhttp://www.foodspotting.com/reviews/4823566\nhttp://www.foodspotting.com/reviews/4823578\nhttp://www.foodspotting.com/reviews/4823572\nhttp://www.foodspotting.com/reviews/4823584\nhttp://www.foodspotting.com/reviews/4823605\nhttp://www.foodspotting.com/reviews/4823522", "rating": 4, "date": "2014-06-30"}, {"excerpts": ["Garlic String Beans reminds me of my mom's food, and my mom was the family (as in when all your relatives gather around for CNY Eve dinner, cooking all 10 dishes) "], "author": "Jennifer K.", "review": "Cleanliness/Ambience/Visual points:\nIf you can overlook the fact the tables are icky, servers are sweating a lot, and the kitchen seems dodgy (you will pass it if you go to the bathroom) then don't worry, we didn't get sick eating here. It's hot and stuffy, there is no fan, never mind AC. A LOT of copies of magazine articles they were mentioned in and such on the walls which defeats the purpose really because I prefer to see what I'm going to eat than knowing how many awards you got. I'm in here already, give me pics!\n\nFood Quality/Quantity/Price:\nDumpling (1 Pork w/ chives and 1 w/ string beans) skins are just nice, not too thick, too thin, too salty or too bland (that's what the dipping sauce is for) and priced perfectly at $6-$7 per 12 pieces. The dipping sauce is not too sour, so that it a plus. The chili sauce bit my tongue (not much of spicy sauce person)! Was nice on hubby's tongue though. Shanghai Soup Dumpling is nice as well. Garlic String Beans reminds me of my mom's food, and my mom was the family (as in when all your relatives gather around for CNY Eve dinner, cooking all 10 dishes) cook! \n\nNote:\nA lot of previous reviewers complained about the wait. We got lucky, no wait at all. In the one hour period we were there, 4 tables ate quickly, moved on and all tables are refilled within 10-15 mins time. However, non of the 4 tables patrons had to wait, so maybe Sunday is a good day to eat here?", "rating": 4, "date": "2013-09-09"}, {"excerpts": ["Hi, I'll have 3 orders of the pork dumpling, 3 orders of siu lum bao, 2 orders of pork and chive dumpling, 1 order garlic string beans, hot tea and a large beer.  "], "author": "Miyako L.", "review": "Waiter: What would you like to order?\n\nMe: Hi, I'll have 3 orders of the pork dumpling, 3 orders of siu lum bao, 2 orders of pork and chive dumpling, 1 order garlic string beans, hot tea and a large beer.  Oh, and whatever they want.\n\nFriends at table: *awkward silence* Uhhhhh, is that for everyone? \n\nMe: Oh, um, no... I mean yeah... sure... I guess we can share. *forced smile*\n\nMe(internal thought): GODDAMN IT!", "rating": 4, "date": "2013-01-14"}, {"excerpts": ["Garlic bok choy, garlic string beans and salt and pepper tofu are highly recommended. ", "Also, come on a Friday or Weekend evening and expect to be waiting at least 30mins for a table. ", "Make sure you give your order clearly to the person taking your order or you may end up with something you didn't order. ", "They literally make the dumplings right up the block! ", "Place is extremely small and you have to walk through the kitchen to use the restrooms. ", "Don't forget to use the orange colored hot sauce to dip your dumplings in. ", "Can't vouch for the other items on their menu; when you know what's good and fresh and works, why change it? ", "4 stars because the place isn't the cleanest - hot sauce jar is always crusted over and don't look under the lid unless you want an unappetizing surprise, kitchen area is a little bleh as well ", "but oh well the food is awesome and have never gotten sick from eating here. ", "Wait ", "staff is polite and do a great job of juggling between taking phone orders and waiting tables. ", "It is definitely worth the wait should you find the line out the door. ", "Live close by and find the line too long for your liking? ", "Then order for pickup...usual wait times for me average about 20mins. ", "Be sure to rush home to enjoy the dumplings while they are still freshly cooked.  ", "It'll be your favorite dumpling spot ", "I'm sure!"], "author": "Roger E.", "review": "Best dumplings ever! Garlic bok choy, garlic string beans and salt and pepper tofu are highly recommended. Also, come on a Friday or Weekend evening and expect to be waiting at least 30mins for a table. Make sure you give your order clearly to the person taking your order or you may end up with something you didn't order. They literally make the dumplings right up the block! Place is extremely small and you have to walk through the kitchen to use the restrooms. Don't forget to use the orange colored hot sauce to dip your dumplings in. Can't vouch for the other items on their menu; when you know what's good and fresh and works, why change it? 4 stars because the place isn't the cleanest - hot sauce jar is always crusted over and don't look under the lid unless you want an unappetizing surprise, kitchen area is a little bleh as well but oh well the food is awesome and have never gotten sick from eating here. Wait staff is polite and do a great job of juggling between taking phone orders and waiting tables. It is definitely worth the wait should you find the line out the door. Live close by and find the line too long for your liking? Then order for pickup...usual wait times for me average about 20mins. Be sure to rush home to enjoy the dumplings while they are still freshly cooked.  It'll be your favorite dumpling spot I'm sure!", "rating": 4, "date": "2013-10-08"}, {"excerpts": ["After careful initial screening of pictures here, we ordered garlic string beans, green onion pancake, xia long bao, and pork and shrimp dumplings. \n\n", "Surprisingly the best one was the garlic string beans. ", "Tender and full of flavor. "], "author": "Joanna P.", "review": "We were recommended to this place by our host.\n\nAfter careful initial screening of pictures here, we ordered garlic string beans, green onion pancake, xia long bao, and pork and shrimp dumplings. \n\nPrice came down to $24 which was reasonable. We were a bit disappointed with xia long bao. It was just okay. Green onion pancake was too thin. The pictures of other pancakes were fluffy and thick so we expected the same. Maybe green onion pancake is the only thin one. \n\nPork and shrimp dumplings was juicy. Surprisingly the best one was the garlic string beans. Tender and full of flavor. I could eat them all day! \n\nI have had better dumplings and dimsum in LA. So giving the place 3 stars.", "rating": 3, "date": "2014-03-25"}, {"excerpts": ["The food was good and affordable (the highlight was the garlic string beans), but I couldn't get over the tiny space. ", "Using the word \"Kingdom\" in the name is deceiving. "], "author": "Allan L.", "review": "We came here for lunch on Christmas Eve and I was surprised at how small this place was. People were bumping into me constantly and it felt like I was in a club. The food was good and affordable (the highlight was the garlic string beans), but I couldn't get over the tiny space. Using the word \"Kingdom\" in the name is deceiving. It's more like \" Crawlspace of Dumpling.\"\n\nThe weirdest part of the meal was when we were ordering, we asked the waiter if we could order more later on once our friends arrived and he said \"no.\" He told us we could only order once. Here I was, basically throwing money at this waiter and he was refusing it left and right. Silly me for thinking he would want additional business from us.\n\nMy tummy gives Kingdom of Dumpling...3 Stars!", "rating": 3, "date": "2012-12-24"}, {"excerpts": ["The chicken chow mein and the garlic string beans are flavorful but are on the salty side.  \n\n"], "author": "Ms K.", "review": "If you're a fan of Din Tai Fung like me, you'd agree the dumplings here are not exactly the best.  I don't mind the hole-in-the-wall atmosphere of the restaurant.  In fact, I think it adds a certain charm if the food were so amazing that it wouldn't matter if you had to squeeze in a table in the corner next to the kitchen.\n\nWe ordered a variety of the dumplings along with a vegetable and noodle dish.  The dumplings in general are good, but the skin is too thick.  As good as the meat and vegetable fillings are, the dumpling skin plays an equally important role.  \n\nThe pork dumpling with chives and pork dumpling with corn fared better than the Shanghai soup dumpling and Shanghai pan fried soup dumpling.  The latter two are just too doughy for their kind.  \n\nThe chicken chow mein and the garlic string beans are flavorful but are on the salty side.  \n\nThis restaurant is ok if you're really craving dumplings, but it's not worth waiting in line for.\n\nBon appetit!", "rating": 3, "date": "2012-12-15"}, {"excerpts": ["Besides that, the garlic string beans and pork and corn dumplings are my new favorites! ", "The string beans are amazing when you dip it in their house spicy sauce and the dumpling was sweet because of the corn. ", "Once you dip it in the hot sauce, you got yourself a sweet and spicy dumpling. ", "I can't wait to come back!"], "author": "Brenda K.", "review": "The food is so good! The xiao long baos seemed a bit off when I had them. It seemed like they were made a couple hours earlier, so the dough was hard and wasn't supple at all. Once I dipped the bao in the sauce, it would immediately break apart and I would miss the soup! Besides that, the garlic string beans and pork and corn dumplings are my new favorites! The string beans are amazing when you dip it in their house spicy sauce and the dumpling was sweet because of the corn. Once you dip it in the hot sauce, you got yourself a sweet and spicy dumpling. I can't wait to come back!", "rating": 4, "date": "2014-10-31"}, {"excerpts": ["So we picked out the recommended dishes such as the xaio lung bao [6/order], shrimp and pork chive dumpling [boiled, comes in 12/order], chicken and napa cabbage dumpling [fan fried, comes in 10/order], garlic string beans, and beef pancake. ", "You do get 10 instead of 12, but the crunchy texture makes up for it\n\nGarlic String Beans"], "author": "Elaine Y.", "review": "I have been going to Shanghai Dumpling King for many times and really wanted to see where else in San Francisco serve good shanghai soup dumplings so my boyfriend and I decided to venture out to some new places. I went on yelp and saw this place.\n\nWhen everyone reviewed this place as small, please do not take that lightly. It is definitely a small small small space. If you are coming for dinner, please do intend to come early as there might be a wait for a table. I came for lunch, no wait, fast and breezy.\n\nService was decent, you wouldn't have the waitress coming every 15 minutes to check on you, but you wouldn't have to go looking for the waitress to get some service either. So we picked out the recommended dishes such as the xaio lung bao [6/order], shrimp and pork chive dumpling [boiled, comes in 12/order], chicken and napa cabbage dumpling [fan fried, comes in 10/order], garlic string beans, and beef pancake. Okay, I just realize that is actually a lot of food, but it was split among three people.\n\nXiao Long Bao: it was good, you can definitely taste that its handmade, fresh and lighter on the flavor. The skin is thin enough where about 1/3 of our dumplings' soup got drained when it got to our table. A little disappointing, but I manage to overlook it. $5 for 6 dumplings, a little heavy on the price\n\nShrimp and Pork Chive Dumpling: The skin is a bit doughier, but meant to be that way. With their housemade sauce, it was excellent.\n\nChicken and Napa Cabbage: Since it was fan fried, the texture was way better. You do get 10 instead of 12, but the crunchy texture makes up for it\n\nGarlic String Beans: Some call it a little bit salty, but some call it perfectly seasoned. It depends on personal preference. But some veggie on the table is good when you have balls of meat in every other dish\n\nBeef Pancake: it was okay, pan fried pancake stuff with a patty of beef. It's serves up to 4 people and it was okay. Nothing to rave about, but it's something new to try. It could be fried a little bit longer.", "rating": 3, "date": "2011-02-22"}, {"excerpts": ["definitely get the Shanghai soup dumplings and garlic string beans!! \n\n", "Garlic string beans - very addicting", ", I didn't see it in the menu but saw another table ordered it and glad we asked for it.  "], "author": "Raquel Y.", "review": "Best dumplings I've ever had!! definitely get the Shanghai soup dumplings and garlic string beans!! \n\nShanghai soup dumplings - SO JUICY.  The waiters give you dipping sauce that just adds more richness to the dumplings. Very flavorsome.\n\nGarlic string beans - very addicting, I didn't see it in the menu but saw another table ordered it and glad we asked for it.  However, it got oiler as you got to the bottom of the plate. \n\nAlso get the garlic cucumbers which were also addicting and pork and corn dumplings which were sweet and tasty", "rating": 4, "date": "2010-08-24"}, {"excerpts": ["We had the Shanghai soup dumplings, garlic string beans, the chicken dumpling with corn, and the chow fun. ", "Everything was great but the dumplings were spectacular. ", "The prices are very reasonable for SF."], "author": "Tim S.", "review": "This place is so good. You definitely won't regret waiting to get seats here. The restaurant is very small -- maybe about 12 or so tables, but it's worth ever6 wait. We had the Shanghai soup dumplings, garlic string beans, the chicken dumpling with corn, and the chow fun. Everything was great but the dumplings were spectacular. The prices are very reasonable for SF.", "rating": 4, "date": "2015-05-08"}, {"excerpts": ["Half way through our meal we noticed that all the other tables had ordered string beans but we were already getting full so garlic string beans is a must for next time!\n\n"], "author": "Oriel F.", "review": "The boyfriend brought me here the first time insisting that i tried their soup dumplings. \n\nWe did not wait that long for a table and ordered their famous Soup dumplings, Pork dumplings with Green Chieves, Chicken dumplings with Corn and because we thought it was not going to be filling we ordered XO Beef Choufun. Half way through our meal we noticed that all the other tables had ordered string beans but we were already getting full so garlic string beans is a must for next time!\n\nEverything was served steaming hot and tasted very good specially with their spicy orange sauce. I was happy.", "rating": 4, "date": "2012-06-25"}, {"excerpts": ["Their garlic string beans are fresh and crisp. ", "The dumplings and onion pancakes are moist and delectable. ", "And, the portion sizes are perfect. "], "author": "Roxana O.", "review": "I am by no means a connoisseur of Chinese food but this is by far the best I've ever had. It's Chinese food made by Chinese people for Chinese people. None of that sugary commercial stuff. Everything tastes homemade and balances. Their garlic string beans are fresh and crisp. The dumplings and onion pancakes are moist and delectable. And, the portion sizes are perfect. (Although, it is easy to over order, since everything looks so good and inexpensive.)\n\nIt's a hole in the wall. It's not necessarily the kind of place where you should expect spectacular or even great service, but everyone is very friendly.  It's fast, cheap, and delicious, and yet still intimate.\n\nCan't wait to go again.", "rating": 5, "date": "2012-09-26"}, {"excerpts": ["Also, the garlic string beans are insanely good as well. ", "My roommates have always ventured into the other menu options but I truly have just stuck with the Shanghai Soup Dumplings and garlic string beans ", "so I can't really comment on anything else."], "author": "Rachel M.", "review": "I've spent the past six months searching SF for the perfect Shanghai Soup Dumplings and this place WINS, no question. They are delicious little meat kisses. Everything about the Shanghai Soup Dumplings are perfect. They're delicate but I've never had one break. They're consistently juicy and delicious and you can tell they're homemade with high-quality ingredients. Yes, this place is a hole in the wall, in fact it looks like it's supposed to be someone's living room- but getting past the lack of ambiance and the almost nonexistent customer service, the food is excellent and so worth it. Sometimes there is a wait, but sometimes I've walked in and been the only one there so it really depends. Also, the garlic string beans are insanely good as well. My roommates have always ventured into the other menu options but I truly have just stuck with the Shanghai Soup Dumplings and garlic string beans so I can't really comment on anything else.", "rating": 5, "date": "2015-01-12"}, {"excerpts": ["My husband order the garlic string beans. "], "author": "Tina V. W.", "review": "Learned about XLB while yelping for Chinese restaurants in NYC. Saw that some Yelpers compared XLB's made in NYC to those made in San Francisco. :)\n\nIMHO, the XLB's, \"Pork Dumplings with Corn\", \"Pan Fried Soup Dumplings\" were completely bland...no salt, no soy sauce, nada, zippo, the total ewwwwwwwwwwww.\n\nThe \"Pan Fried Soup Dumplings\" had absolutely no soup in them. The meatball was this pink-beige mass of moistened meat fibers.\n\nI also ordered the pancake with the marinated beef. Unfortunately, the beef did not taste marinated. The pancake seemed to be stuffed with slices of beef with a little smear of hoisin sauce. Pretty uneventful.\n\nMy husband order the garlic string beans. Those beans were delicious.\n\nHe also ordered the fried tofu squares. Ummm...when you were lucky enough to just a hint of salt, the fried tofu squares were crunchy and tasty. Without the salt...well...chalk it up as bland food that was, at least, pleasantly crunchy.\n\nA touch of ginger, a hint of sesame oil, and/or a whisper of salt would have been some welcome touches to the food. It's pretty sad when the 2nd best-flavored item of a dinner consisting of 6 items was the soy-sauce/ginger condiment for the XLB's. :(\n\nThe food was disappointing, especially after having some great dim sum at some San Francisco restaurants like the \"Beijing Restaurant\" and \"Hong Kong Lounge\".\n\nOn the plus side, the service was polite. The unusual method of obtaining a seat in the restaurant gave us a chance to meet some new folks.\n\nPerhaps the normal dumpling makers are on vacation...I don't know...but for now, NYC seems to have the better XLB's. :)", "rating": 3, "date": "2010-09-19"}, {"excerpts": ["I highly recommend:\nShanghai Soup Dumplings\nBeef Dumplings\nLamb Dumplings\nOnion Pancake\nGarlic String Beans"], "author": "Honest R.", "review": "This is the best dumpling place in SF in my opinion and currently my absolute favorite restaurant. It's a tiny hole in the wall that might not look appealing at first, but the food speaks for itself.\n\nI highly recommend:\nShanghai Soup Dumplings\nBeef Dumplings\nLamb Dumplings\nOnion Pancake\nGarlic String Beans", "rating": 5, "date": "2013-05-21"}, {"excerpts": ["Garlic String Beans\n3. ", "Chive Pancake or Beef Pancake\n4. "], "author": "Pearl L.", "review": "This is my favorite Chinese place in the city. Been here on multiple occasions with family, and friends. My brother liked this place so much, we had his birthday dinner here!\n\n\nAMBIANCE:\n1. This is not a fancy place! Just a typical hole-in-the-wall restaurant. Waiters are not rude, but they're not super attentive either.\n2. It is a COZY restaurant. Best for groups of 4 or less. \n\nFOOD - Make sure to get:\n1. the XLB and lots of it!!!!!!!! You're crazy if you don't.\n2. Garlic String Beans\n3. Chive Pancake or Beef Pancake\n4. Spicy Beef Tendon\n5. Lamb Skewers\n\nAlso try their hot sauce.", "rating": 5, "date": "2011-11-03"}, {"excerpts": ["Garlic string beans: A bit on the saltier side, but it hit the spot ", "so I'm not complaining. "], "author": "Rosie W.", "review": "To say this is a hole in the wall is an understatement. My living room is bigger than this restaurant. We ended up sitting towards the back of the room, facing the back wall, right across from a guy (who was by himself) who was facing the front wall,  - so we were awkwardly unintentionally staring at each other. Our tables were like 2 inches apart from each other. Yeah, it was weird.\n\nThe food was decent, but no crazy wow factors. 7x7 - you've failed again.\n\nSoup dumplings: Good, but it didn't blow me away. They weren't super thin so it didn't break like they normally do when you pick them up with your chopsticks. Soup wasn't too hot. I thought the meat portion could have had a bit more flavoring to it.\n\nGarlic string beans: A bit on the saltier side, but it hit the spot so I'm not complaining. I tasted more of the soy sauce than the garlic though.\n\nGreen Onion Pancake: Thin, crispy and not too oily. I like.\n\nPork dumplings with cabbage: This dish was just mehh. I thought the dumpling wrap was too thick. I tasted more of the wrap than the meat, and the meat also could have used more flavoring. \n\nPepper fried tofu: Not enough flavor, though it was fried to perfection. -.5 points for forgetting our order! We had to remind them when we were almost done with our other dishes and she ran into the kitchen and screamed in Mandarin \"One more tofu!\"\n\nTheir turnover rate is pretty quick, so we didn't have to wait too long for food (except that one dish they forgot to put in). We came here on a Wednesday night around 7pm and only waited 10 minutes for 2 people.", "rating": 3, "date": "2012-06-14"}, {"excerpts": ["Beside that, we also ordered the green onion pancake and garlic string beans.  ", "The green onion pancake was good too.  ", "Not too oily ", "but I think if more green onions, it would be better.  ", "The garlic string beans was so good.  "], "author": "Liza T.", "review": "Simple but Delicious!  \n\nKingdom of Dumpling is a tiny restaurant, about 6 tables.  If you don't want to wait, please do not come at peak hours.  \n\nWe came there on a Thursday at 5:45pm.  The restaurant was already half full.  \n\nThe service was OK....efficient like other Chinese restaurants.  \n\nWe first wanted to try the Pork and Shrimp Dumpling, but they did not have it.  Then we asked for the Pork Dumpling with Chinese Spinach and they did not have it neither.  Finally we got the Pork Dumpling with Napa.  The dumplings were pretty good.  Juicy and flavorful.  Beside that, we also ordered the green onion pancake and garlic string beans.  The green onion pancake was good too.  Not too oily but I think if more green onions, it would be better.  The garlic string beans was so good.  Very flavorful, not overcooked...\n\nDefinitely want to go back to try more!", "rating": 4, "date": "2012-02-03"}, {"excerpts": ["Lotus root and garlic string beans were awesome. ", "12 dumplings was just right. ", "I was pretty disappointed to hear that pot stickers and pancakes would take 30minutes... ", "I guess it was just bad timing."], "author": "Jeremy W.", "review": "Dirty little room that looks like it's been around for decades. Good cheap food though. A few vegi options to make it worth a couple visits. Lotus root and garlic string beans were awesome. 12 dumplings was just right. I was pretty disappointed to hear that pot stickers and pancakes would take 30minutes... I guess it was just bad timing.", "rating": 4, "date": "2014-11-21"}, {"excerpts": ["Try the chicken and corn dumplings, the pork and corn dumplings, and the garlic string beans."], "author": "Ron L.", "review": "Outstanding dumplings. Try the chicken and corn dumplings, the pork and corn dumplings, and the garlic string beans.", "rating": 5, "date": "2015-12-21"}, {"excerpts": ["Friend and I stuffed our faces with the Soup Dumplings, 12 Shrimp Dumplings and the roasted, garlic string beans. "], "author": "Antonia L.", "review": "I have done Bikram yoga before but never Bikram eating :) \n\nKingdom of Dumplings is an amazing spot for tasty cheap eats. Yes, the space is small and YES it's like a hotbox in there but the food makes up for the initial shock of heat. \n\nFriend and I stuffed our faces with the Soup Dumplings, 12 Shrimp Dumplings and the roasted, garlic string beans. It was all sooo good, woke up actually wishing I could start my day with those lovely pillows of goodness. \n\nBeyond friendly service and again, damn good dumplings! \n\nOhh and its BYOB! Opened our beers as soon as we got there, no extra charge!", "rating": 5, "date": "2013-01-12"}, {"excerpts": ["nothing special\n-Sauteed garlic string beans: way too salty\n-Grilled chicken fried rice: pretty standard fried rice. "], "author": "Jennifer C.", "review": "2.5 stars. Wasn't all that great.\n\n-Shanghai dumplings weren't all that soupy and tasted like typical dim sum XLB (xiao long bao), and not like authentic XLB.\n-Green onion pancakes needed more seasoning\n-Pork with Chinese chives dumpling: my mama makes them WAY better. Even some frozen ones taste similar, if not better. Skin was too thick. San Tung's dumplings are better.\n-Chicken and napa cabbage dumpling: nothing special\n-Sauteed garlic string beans: way too salty\n-Grilled chicken fried rice: pretty standard fried rice. good but not great\n\nThis place is the size of a shoe box and is pretty dingy.  If you suffer from claustrophobia, stay away!  I associate dirty and small with really good food, but unfortunately i did not find that here. The manager guy is really nice though. He's a bit high strung, but was very accomodating. The hot sauce at the table is spicy as hell. Use with caution.", "rating": 3, "date": "2011-04-11"}, {"excerpts": ["I'm also a fan of the onion pancakes and garlic string beans. "], "author": "Kevin C.", "review": "Best xiao long bao in the City.  I'm also a fan of the onion pancakes and garlic string beans. The homemade hot sauce is fantastic!\n\nThe service could be better, but you don't go to a Chinese dumpling restaurant for the service!", "rating": 5, "date": "2012-08-19"}, {"excerpts": ["Five stars for the soup dumplings and garlic string beans. ", "That s***z the bomb. ", "suggestions - pork w/ chives dumplings, soup dumplings, garlic string beans"], "author": "Lucy A.", "review": "Five stars for the soup dumplings and garlic string beans. That s***z the bomb. I would eat that 4times a week if I could, but I can't. \n\nIt's small and steamy inside, embrace it.\n\nsuggestions - pork w/ chives dumplings, soup dumplings, garlic string beans", "rating": 5, "date": "2012-06-22"}, {"excerpts": ["We ordered 2 orders of the pan fried Shanghai soup dumplings, the regular Shanghai soup dumplings, and the garlic string beans. ", "While the food came out fairly quickly, I thought everything was pretty mediocre except the for the string beans, which was very flavorful! ", "For a place that is supposed to be popular for their dumplings, I thought both the fried and regular Shanghai soup dumplings were just ok...", "The Shanghai soup dumplings were kind of tiny and plain tasting. ", "The pan fried Shanghai soup dumplings barely had any meat in them and were also kind of bland. ", "Luckily I had ordered the garlic string beans, so I put some of that sauce onto the dumplings, which made them taste better. ", "Maybe next time I will try the the other dumplings instead of the Shanghai soup dumplings."], "author": "Mary C.", "review": "First time coming here and was excited for the Shanghai soup dumplings! This restaurant is pretty tiny so good thing we came when it was still empty. We ordered 2 orders of the pan fried Shanghai soup dumplings, the regular Shanghai soup dumplings, and the garlic string beans. While the food came out fairly quickly, I thought everything was pretty mediocre except the for the string beans, which was very flavorful! For a place that is supposed to be popular for their dumplings, I thought both the fried and regular Shanghai soup dumplings were just ok...The Shanghai soup dumplings were kind of tiny and plain tasting. The pan fried Shanghai soup dumplings barely had any meat in them and were also kind of bland. Luckily I had ordered the garlic string beans, so I put some of that sauce onto the dumplings, which made them taste better. Maybe next time I will try the the other dumplings instead of the Shanghai soup dumplings.", "rating": 3, "date": "2015-04-15"}, {"excerpts": ["Start off with the spicy beef tendon and garlic string beans, and of course the shanghai soup dumpling ( each order comes with 6, that's definitely not enough ) ", "So I always get two orders ! ", "And if I have room for dessert, I definitely wont forget about the sesame pancakes !! ", "Ive been to many shanghai dumping places but nothing ever came close to this! ", "but I do wish they had more room in the restaurant, because it could get very stuffy on hot days... ", "I mean im sure they make enough money for a two story restaurant by now ! ", "lol !"], "author": "Annie Y.", "review": "Yes, I come here almost everyday or at least once a week. Its very close to where I live . I order the same meal every time. Start off with the spicy beef tendon and garlic string beans, and of course the shanghai soup dumpling ( each order comes with 6, that's definitely not enough ) So I always get two orders ! And if I have room for dessert, I definitely wont forget about the sesame pancakes !! Ive been to many shanghai dumping places but nothing ever came close to this! but I do wish they had more room in the restaurant, because it could get very stuffy on hot days... I mean im sure they make enough money for a two story restaurant by now ! lol !", "rating": 4, "date": "2013-07-18"}, {"excerpts": ["I ordered the chicken dumplings with corn, shrimp and chives dumpling, green onion pancake and my two favorite items which were the chicken chow mein and garlic string beans. ", "All orders come served steaming hot and their hot sauce definitely compliments every dish.\n", "Can't really say the staff here is customer oriented. ", "The male waiter was very abrupt and rude. "], "author": "Jude A.", "review": "What a gem in the sunset! I'm a sunset native and with all the great places to eat out here, this place is definitely on top. Get ready for a crowded, packed atmosphere as others have quickly caught on to the great food served here.\nI ordered the chicken dumplings with corn, shrimp and chives dumpling, green onion pancake and my two favorite items which were the chicken chow mein and garlic string beans. All orders come served steaming hot and their hot sauce definitely compliments every dish.\nCan't really say the staff here is customer oriented. The male waiter was very abrupt and rude. I can look past it for now mainly because the food was that good but staff should definitely be more courteous to its patrons. \n\n5 stars for food\n3 stars for staff", "rating": 4, "date": "2014-04-01"}, {"excerpts": ["Ever since trying this place and coming back again, I literally dream about their baskets of dumplings, delicious XLB and garlic string beans. ", "I have been lucky with the wait at all of my visits here. ", "I am happy with the service here and have no complaints in that area. ", "Overall, I am happy with Kingdom of Dumpling and in a place like SF where there is just so much good stuff, it sets my standard especially when it comes to soup dumplings!"], "author": "Tracy Joy K.", "review": "Kingdom of Dumpling has really stolen my heart. Therefore, I am upgrading it to 5-stars. Ever since trying this place and coming back again, I literally dream about their baskets of dumplings, delicious XLB and garlic string beans. I have been lucky with the wait at all of my visits here. I am happy with the service here and have no complaints in that area. Overall, I am happy with Kingdom of Dumpling and in a place like SF where there is just so much good stuff, it sets my standard especially when it comes to soup dumplings!", "rating": 5, "date": "2012-07-19"}, {"excerpts": ["The first time I went, I was with the bestie:\n\n- Bean Curd Noodles with Cilantro\n- Pork Dumpling with chives\n- Garlic string beans\n- Shanghai soup dumplings\n\nPerfect. ", "As for the garlic string beans, I couldnt believe how delicious, crunchy, and complimentary they were to our meal. ", "Finally the soup dumplings. ", "HOLY CRAP. ", "He advised us to dip in the soy vinegar, bite off the top and slurp out the insides. ", "Freaking orgasmic. ", "Next time I went, I got the green onion pancake. ", "HOT. ", "as in HEAT hot. ", "And as other yelper's mentioned, its a little bit greasy, but just the outside because they need to get that crispy exterior which I love ", "oh so much. "], "author": "Jacklyn S.", "review": "First of all, I want to preface this by saying that any review based on the \"atmosphere\" of this place is not worth reading. Its a hole in the wall joint, and if you can't appreciate those kinds of places, then IMHO - don't go. Sure theres six tables, a curtain separating the dining room from the kitchen, and grease on the walls - I'll take that any day if you give me delicious food. I'll be damned if you find food thats as fantastic at a she-she restaurant elsewhere. \n\nEver since I saw Anthony Bourdain's episode of Shanghai, I was on a quest to find the best soup dumplings in the city. And I think even if its out of the way for some, the location (cold, foggy, misting outer sunset) for the type of food you're ordering (hot, steamy, spicy goodness) makes it all worthwhile. The first time I went, I was with the bestie:\n\n- Bean Curd Noodles with Cilantro\n- Pork Dumpling with chives\n- Garlic string beans\n- Shanghai soup dumplings\n\nPerfect. I was surprised at the bean curd noodles and how much I really enjoyed them! Couldn't believe they were tofu!. Pork dumplings - hearty, delicious and FILLING. As for the garlic string beans, I couldnt believe how delicious, crunchy, and complimentary they were to our meal. Finally the soup dumplings. HOLY CRAP. He advised us to dip in the soy vinegar, bite off the top and slurp out the insides. Freaking orgasmic. Next time I went, I got the green onion pancake. HOT. as in HEAT hot. And as other yelper's mentioned, its a little bit greasy, but just the outside because they need to get that crispy exterior which I love oh so much. So give me the grease.\n\nI would give this first experience 5 stars alone, but the rest of the times I've been there, the server is always in the back of the kitchen - and I always need another beer. And ice water. So thats really the only reason it gets four stars. If it was based soley on the food - 5 all the way.", "rating": 4, "date": "2010-09-08"}, {"excerpts": ["The garlic string beans were delicious!\n", "I would definitely go back"], "author": "Inbal M.", "review": "Very small place but feels very authentic.\nThe food was good and the price was very comforting!\nThe garlic string beans were delicious!\nI would definitely go back", "rating": 4, "date": "2011-06-20"}, {"excerpts": ["$36 for 3 people...and the beef dumplings and garlic string beans are insane!"], "author": "Ian P.", "review": "This is all I have to say...amazing food and really inexpensive, perfect mix! $36 for 3 people...and the beef dumplings and garlic string beans are insane!", "rating": 5, "date": "2012-12-30"}, {"excerpts": ["Pork and Chive, Chicken Chow Fun (good if you like bean sprouts), Garlic String Beans, Pork and Corn, Chive Pancake.\n\n"], "author": "Ally S.", "review": "To all of you people who give this place mediocre reviews, you're ordering the wrong thing. Who in their right mind goes to a restaurant named Kingdom of Dumpling and doesn't order dumplings!! I don't get it. Anyway, moving on. People complain about the atmosphere and the service, but you know what? I think all these things just add to the experience of eating here.\n\nThe restaurant is a complete hole in the wall, don't get me wrong. Its your typical San Francisco dingy eatery. Don't be afraid  to get comfy with the people around you. Its a little tight but its so worth it when your first plate comes out.\n\nShanghai Soup Dumplings. \n\nThese things are in a world of their own for me. They're my absolute favorite treat.\n\nNow, a few of my favorites.\nPork and Chive, Chicken Chow Fun (good if you like bean sprouts), Garlic String Beans, Pork and Corn, Chive Pancake.\n\nJust go and try this place for yourself and make your own decisions. If half the people on here hate a dish and half the people love it, try it anyway. If everyone loves it, try it anyway. If everyone hates it, try it anyway. You never know, it could end up becoming your favorite.", "rating": 5, "date": "2011-11-07"}, {"excerpts": ["Ordered a few of the most popular dishes on the menu - garlic string beans, XO beef chow fun , and Shanghai soup dumplings. ", "All were delicious and the food came out quick; only beef was the XO beef chow fun didn't have a lot of beef :("], "author": "Kristine C.", "review": "Came here today (on a Wednesday) around 1:30 pm. A few tables were open so my mom and I got a seat right away - there appears to be only 10 tables in the restaurant that can seat a max of four people. Ordered a few of the most popular dishes on the menu - garlic string beans, XO beef chow fun , and Shanghai soup dumplings. All were delicious and the food came out quick; only beef was the XO beef chow fun didn't have a lot of beef :(", "rating": 4, "date": "2014-06-11"}, {"excerpts": ["garlic string beans was good."], "author": "Ann L.", "review": "This place was pack on a wednesday night.  the shanghai dumplings were just alright. there was a lot of soup inside but it wasn't enough flavor for me.  the pork and dumpling was better.  garlic string beans was good.", "rating": 2, "date": "2011-12-15"}, {"excerpts": ["We also had the garlic string beans, the chicken wings (the sauce was amazing so sweet and tasty). ", "The service was good they sat us down in a small table and continue to apologize for it but made up for it by coming to serve us quickly."], "author": "Katherine L.", "review": "I came here with my friends on a Friday night ... it was packed and we waited a while BUT IT WAS SO WELL WORTH IT. I was looking for soup dumplings (xiao long bao). I had them for the first time in New York and I fell in love. Since then Ive been looking for them and found them here. Soup dumplings were full of nice warm yummy broth. EXCELLENT!! We also had the garlic string beans, the chicken wings (the sauce was amazing so sweet and tasty). The service was good they sat us down in a small table and continue to apologize for it but made up for it by coming to serve us quickly.", "rating": 5, "date": "2011-02-05"}, {"excerpts": ["my favorite dish was the garlic string beans....", "I love garlic and these were amazing! "], "author": "Nina R.", "review": "let me start off by mentioning that I've never had dumplings before.... i know, i know I've been missing out!\n\nvery good dumpling, I was especially fascinated by the soup dumplings!\nmy favorite dish was the garlic string beans....I love garlic and these were amazing! everything is at fair price (expect for the specials) \n\nAs for how little it is in there I really truly enjoyed it, it felt so romantic and movie like! but I'm weird like that! heh \nThe service was always nice, but it makes it hard to make a relaxing atmosphere when they are so busy (I went on a Saturday) \n\nlike some people have mention in passed post.... the waiting occurs outside, and there is no line or list. but people are pretty respectful of who got there first, just be attentive if your next... and you'll be good.", "rating": 4, "date": "2011-10-03"}, {"excerpts": ["The garlic string beans are also very delish and a great accompaniment to the dumplings.  ", "The lamb skewers are good as well.  ", "The hot sauce on the tables is very addicting, not sure what is in it.  ", "Whenever we crave for dumplings, we come here.  ", "Oh and they serve brown rice too -- ", "a plus in my book."], "author": "V B.", "review": "We love the dumplings here!  The garlic string beans are also very delish and a great accompaniment to the dumplings.  The lamb skewers are good as well.  The hot sauce on the tables is very addicting, not sure what is in it.  Whenever we crave for dumplings, we come here.  Oh and they serve brown rice too -- a plus in my book.", "rating": 4, "date": "2011-03-18"}, {"excerpts": ["The garlic string beans are great.  ", "I didn't love the onion pancake -- fine but not something to back  for.  ", "Friendly service, great price, but a limited number of tables."], "author": "jay w.", "review": "A really good dumpling place.  The Shanghai Soup Dumplings are great, the shrimp dumplings are good too.  The veggie dumplings are flavorless and I would avoid.   The garlic string beans are great.  I didn't love the onion pancake -- fine but not something to back  for.  Friendly service, great price, but a limited number of tables.", "rating": 4, "date": "2010-08-18"}, {"excerpts": ["I went here with my friend and ordered Shanghai Dumplings, Pork & Corn Dumplings, Pork & Napa Cabbage Dumplings, Garlic String Beans, Wide Cold Soybean Noodles, and Crispy Chicken Wings. ", "Yeahhhhh....", "We ordered a lot for 2 people because we were super hungry. ", "We didn't have to wait long to get seated but we had to wait to order. ", "The waiters went to tables that were seated after us and we waited a while. ", "The Shanghai Dumplings fell apart more than I was used to which is a disappointment because the whole reason for those dumplings is to have that burst of soup in your mouth. ", "The Chicken wings were gross. ", "I thought a customer told me to order it ", "but he was talking about a different restaurant", "....whoops. ", "Order the dumplings, its what they are known for and what they are good at."], "author": "Josephine S.", "review": "It was alright. I like Dumpling Kitchen better. I went here with my friend and ordered Shanghai Dumplings, Pork & Corn Dumplings, Pork & Napa Cabbage Dumplings, Garlic String Beans, Wide Cold Soybean Noodles, and Crispy Chicken Wings. Yeahhhhh....We ordered a lot for 2 people because we were super hungry. We didn't have to wait long to get seated but we had to wait to order. The waiters went to tables that were seated after us and we waited a while. The Shanghai Dumplings fell apart more than I was used to which is a disappointment because the whole reason for those dumplings is to have that burst of soup in your mouth. The Chicken wings were gross. I thought a customer told me to order it but he was talking about a different restaurant....whoops. Order the dumplings, its what they are known for and what they are good at.", "rating": 3, "date": "2013-03-23"}, {"excerpts": ["nice and super crunchy/fresh\n\ngarlic string beans - good.  "], "author": "Ali G.", "review": "tofu noodles - good.  had a very tasty oil on them.  i hate tofu but these were palatable from the sauce they were in.  and the fact that they were skinny noodles.\n\npickled cucumbers - good.  my tofu house has better flavor ones, but these were still pretty good.  nice and super crunchy/fresh\n\ngarlic string beans - good.  I prefer the ones at shanghai dumpling king.\n\npork dumpling with corn - yummy!  loved the thick skin on the outside, and the inside had great flavor.\n\nsoy milk - delicious!  i hate the stuff they sell at the supermarket, so i was pleasantly suprised how tasty this was.\n\nbeef pancake - fantastic!\n\nonion pancake - okay i guess.  dont bother ordering this.\n\nsteamed shanghai dumplings - okay.  half of them didnt have broth inside.  i prefer the flavor of both the soup and the meat at shanghai dumpling king for their steamed shanghai soup dumplings.\n\nthe owner/manager that works here was extremely friendly and accomodating.  you can tell that he genuinely wants to express his appreciation for his customers.  such a nice guy.\n\ni will definitely be going back to try more of the dumplings.  especially because, with the exception of the shanghai soup dumplings at shanghai dumpling king, i dont think any of their other dumplings are tasty... but the ones here sure were!", "rating": 4, "date": "2009-05-04"}, {"excerpts": ["The pork & corn dumplings were delicious as well as the garlic string beans, beef pancakes and the many other dishes we tried.  ", "The owner was extremely nice to us even though we had a large party.  ", "We can't wait to return to the bay area to eat here again!"], "author": "Doris K.", "review": "One of the best meals we had in San Francisco.  We had a party of 6 and although we had to wait a bit, it was well worth it.  We actually went here 3 times in a span of 5 days---it was close to San Francisco State University  (where my daughter just moved into her dorm).  The pork & corn dumplings were delicious as well as the garlic string beans, beef pancakes and the many other dishes we tried.  The owner was extremely nice to us even though we had a large party.  We can't wait to return to the bay area to eat here again!", "rating": 5, "date": "2010-09-03"}], "garlic pea shoots": [{"excerpts": ["We ordered the green onion pancake, pork dumplings with napa, pork dumplings with chives, garlic pea shoots, shanghai soup dumpling, beef stew soup noodle and a beef chowfun. ", "Like mentioned before, the tables are super small so we barely fit all that food on our table. ", "The dumplings were REALLY good! ", "My family loves the dumplings with chives so much, they now go to the Kingdom of Dumpling wholesale to buy frozen ones to resteam and eat at home!"], "author": "Emily G.", "review": "Expect to wait because the interior of this place is pretty small. Because there's so much people, they take your orders while you're standing on the street. I understand that it is harder to take orders while people are seated as the waiter might block the small walkways, etc. So I let that go... I'm more interested in the food anyways. The first thing I noticed: this is literally your typical Chinese restaurant- place looks dirty, service isn't the best but the food looks good. \n\nWe ordered the green onion pancake, pork dumplings with napa, pork dumplings with chives, garlic pea shoots, shanghai soup dumpling, beef stew soup noodle and a beef chowfun. Like mentioned before, the tables are super small so we barely fit all that food on our table. The dumplings were REALLY good! My family loves the dumplings with chives so much, they now go to the Kingdom of Dumpling wholesale to buy frozen ones to resteam and eat at home!", "rating": 4, "date": "2018-08-16"}, {"excerpts": ["xlb are the best i've had in the city, their hot sauce is delicious slathered on the onion (NOT CHIVE) pancake, as are the garlic pea shoots and green beans. ", "nothing is too oily or heavy, its goldilocks' just right. ", "always thinking about when i can eat here again."], "author": "Archana P.", "review": "what this restaurant lacks in ambiance, it makes up in delicious homestyle dumplings and accoutrement. xlb are the best i've had in the city, their hot sauce is delicious slathered on the onion (NOT CHIVE) pancake, as are the garlic pea shoots and green beans. nothing is too oily or heavy, its goldilocks' just right. always thinking about when i can eat here again.", "rating": 4, "date": "2018-07-24"}, {"excerpts": ["Garlic pea shoots, spicy beef tendon, "], "author": "miss p.", "review": "Excellent place! \nThe menu is fantastic and with some help from my Chinese foodie friends, we chose items which were very tasty and fresh and not the usual safe Chinese menu choices. \n\nGarlic pea shoots, spicy beef tendon, shangai soup dumpling, pork and shrimp dumpling with green chives, chicken dumpling with napa cabbage, cold wide bean noodle, farmer's cucumber, duck curry, garlic green beans.......everything was just perfect.\n\nThe place is tiny, service is friendly and efficient, portions are large.\n\nI do not understand why it only has 3 and 1/5 stars. This place deserves a 5!", "rating": 5, "date": "2018-01-30"}], "eggplant prawn with rice": [], "curry duck stew with rice": [], "fried bean paste cake": []}