{"piece gyoza": [], "garlic miso chicken wings": [{"excerpts": ["The garlic miso chicken wings were crispy and nicely flavored. ", "However I think the price is a bit steep for 4 wings ($6)."], "author": "Jess W.", "review": "Clean looking restaurant. Service is prompt. \n\nMiso ramen was a bit bland to me. The flavoring of the broth tasted a bit diluted. The noodles were al dente, a bit too stiff for my preference (I've ate my way through Japan). This is a personal preference, I tend to shy away from foods that are unexpectedly  sweet like the bamboo shoots, just not a fan. \n\nThe garlic miso chicken wings were crispy and nicely flavored. However I think the price is a bit steep for 4 wings ($6).", "rating": 3, "date": "2017-05-06"}, {"excerpts": ["I ordered the garlic miso chicken wings, Kio \"specialty\" ramen, and water.\n\n"], "author": "Alicia T.", "review": "I really wanted to like this place, unfortunately I will never come here again.\n\nI ordered the garlic miso chicken wings, Kio \"specialty\" ramen, and water.\n\nNo water. Ramen comes out and I ask again for water which finally comes. The presentation is poor. Spinach, stale nori, canned menma, the \"flavored\" egg was overcooked, noodles tasted like something out of a packet. The broth was so salty I couldn't even sip it (usually with good ramen I finish to the last drop).\n\nRemember the garlic miso wings? Yeah, it came as a dessert when I was already done with the ramen. No \"garlic miso\" flavor, just fried. So piping hot with hot oil leaking I didn't even dare eat it after being disappointed with the ramen. \n\nThree people working, six customers. Girl in front of restaurant was talking on her cell phone. The customer next to me had to go to the cashier to pay his bill. Luckily this other waiter came around and brought my check. $21.00 bucks is Definitely. Not. Worth. It. \n\nWait for Miki's to open, they know real ramen, or just go somewhere else.", "rating": 1, "date": "2018-01-04"}], "tamagoyaki": [], "grilled squid": [{"excerpts": ["But the absolute worst dish was this weird teriyaki grilled squid. "], "author": "June L.", "review": "Easily the worst restaurant I've been to in a very long time. The ramen is flavorless and overpriced. But the absolute worst dish was this weird teriyaki grilled squid. I actually gagged while eating it.\n\nIf you're craving ramen, go down the street to Miki, which is hands down the best ramen outside of Japan. Unfortunately they were closed one night which is why we ventured to this disaster of a restaurant, but next time I'll just wait until Miki is open.", "rating": 1, "date": "2017-05-13"}, {"excerpts": ["Ordered the Chicken Katsu Curry and Grilled Squid appetizer. ", "The chicken was pounded/flattened extremely thin, breaded and fried. ", "The result was a dry and tough chicken cutlet. ", "Just imagine eating a deep fried piece of leather. ", "The curry sauce was thin and runny. ", "At most other restaurants, the curry sauce is thick and more like gravy. ", "I suspect the \"sauce\" was used was a curry ramen broth or something. ", "The rest of the dish was passable (rice, couple of pickles, bland tomato slices and shredded cabbage). ", "It would be hard to mess that up. ", "The grilled squid dish arrived at our table stone cold. ", "The wait staff sent the dish back as we requested. ", "The second attempt was slightly warmer. ", "The waitress told us that the sauce that had been used was cold. "], "author": "Dan T.", "review": "Disappointing and below average. Ordered the Chicken Katsu Curry and Grilled Squid appetizer. The chicken was pounded/flattened extremely thin, breaded and fried. The result was a dry and tough chicken cutlet. Just imagine eating a deep fried piece of leather. The curry sauce was thin and runny. At most other restaurants, the curry sauce is thick and more like gravy. I suspect the \"sauce\" was used was a curry ramen broth or something. The rest of the dish was passable (rice, couple of pickles, bland tomato slices and shredded cabbage). It would be hard to mess that up. The grilled squid dish arrived at our table stone cold. The wait staff sent the dish back as we requested. The second attempt was slightly warmer. The waitress told us that the sauce that had been used was cold. They used way too much sauce IMHO as well.\n\nThe service is decent but the food is way below average. Halfway through the meal we just wanted to finish and get out of there.", "rating": 1, "date": "2017-04-21"}], "softshell crab tempura": [], "piece vegetable tempura": [], "garlic soy edamame": [], "okonomiyaki": [], "fried oysters": [], "mix sashimi salad": [], "curry beef udon": [], "pork flavor ramen": [{"excerpts": ["Ordered the Lobster Pork Flavor Ramen ($14.78) which was great! ", "Creamy broth, perfectly boiled ramen egg like bruh ", "the yolk was perfectly gelled and clear, melt in your mouth pork, and a whole soft shell crab. "], "author": "Melanie C.", "review": "Small restaurant that wasn't too busy around 9pm on a Friday night. Ordered the Lobster Pork Flavor Ramen ($14.78) which was great! Creamy broth, perfectly boiled ramen egg like bruh the yolk was perfectly gelled and clear, melt in your mouth pork, and a whole soft shell crab. Service and staff were friendly, quick, and excellent, maybe because we were seated next to the kitchen but still! \n\nAND it's by Purple Kow so you can have your quick boba fix afterward! \n\nDefinitely coming back :)", "rating": 5, "date": "2017-10-21"}, {"excerpts": ["I ordered a medium spicy pork flavor ramen (includes chasu, bamboo shoots, half an egg, spinach, roasted seaweed, and kikurage mushooms), while he got the Kio special (medium spicy miso garlic pork base soup, same toppings). \n\n"], "author": "Leslie C.", "review": "2.5 STARS.\n\nI was skeptical based on the mixed Yelp reviews, but my bf wanted to check this new establishment out, so I figured why not.\n\nThe space is relatively small and there were a few other parties in the restaurant. We were seated promptly. I ordered a medium spicy pork flavor ramen (includes chasu, bamboo shoots, half an egg, spinach, roasted seaweed, and kikurage mushooms), while he got the Kio special (medium spicy miso garlic pork base soup, same toppings). \n\nHonestly, I was not impressed. While my broth had a milky, flavorful broth, the ramen noodles were overcooked for my taste and was reminiscent of instant ramen left out to soak up the water for too long. It was mushy and did not have that al dente texture that I enjoy. The egg was flavorful, but the bamboo was a complete miss for me. It tasted like it came straight out of a can. I even made sure to bury it under everything else so that I could eat it last, in hopes that it would change the taste and texture. Nope, it was still dry and just all around not good. In regards to the KIO special, I felt that the soup base was overly salty and I unfortunately had that thirsty taste in my mouth for the rest of the afternoon.\n\nThe noodle portion was HUGE, so it'll definitely fill you up. I didn't finish my ramen and even though the prices were decent, I won't be back for a second round.", "rating": 3, "date": "2017-01-10"}, {"excerpts": ["I ordered the pork flavor ramen here, and it was decent.  ", "Nothing great like compared to other ramen restaurants I've been to, but not terrible either.  ", "I don't know... ", "Maybe it was the broth? ", "I also didn't like the Chashu.  ", "It's not like the pieces of red meat one might imagine at other Asian restaurants; instead it reminded me of boiled bacon.  ", "I was disappointed I didn't even get a whole egg, too."], "author": "Eric L.", "review": "I ordered the pork flavor ramen here, and it was decent.  Nothing great like compared to other ramen restaurants I've been to, but not terrible either.  I don't know... Maybe it was the broth? I also didn't like the Chashu.  It's not like the pieces of red meat one might imagine at other Asian restaurants; instead it reminded me of boiled bacon.  I was disappointed I didn't even get a whole egg, too.", "rating": 3, "date": "2016-09-25"}], "shoyu flavor ramen": [], "miso flavor ramen": [], "black garlic flavor": [], "spicy garlic flavor": [], "kio special flavor": [{"excerpts": ["*Kio Special Flavor: Base Broth of Pork & Chicken, Chashu, Flavored Egg, Spinach, Bamboo Shoots, Roasted Seaweed, Kikurage ($10.75)\n\n"], "author": "Elena N.", "review": "The roommate was craving pho for dinner, but I wanted to try a new spot. Realized KIO Ramen was down the street, so I decided to stop by. I went in on Tuesday, October 11th around 6pm to place an order for takeout.\n\n*Gyoza (4 Pieces): Pork and Cabbage Potstickers ($2.78)\n*Karaage: Japanese Style Fried Chicken ($3.58)\n*Kio Special Flavor: Base Broth of Pork & Chicken, Chashu, Flavored Egg, Spinach, Bamboo Shoots, Roasted Seaweed, Kikurage ($10.75)\n\nI was debating between the Hella Spicy and the KIO Special. I normally love super spicy food, but I wasn't in the mood to blow my palate in case it was actually hella spicy, so I just went for the KIO special. It wasn't really spicy at all, so I found myself wishing I got the hella spicy. The soup itself isn't necessarily super rich or super light, but I found the broth kind of sour. The bamboo that came with the ramen tasted like it was pickled, so maybe that was why the broth was sour? I'm a fan of spicy and sour soups, but it felt out of place in a bowl of ramen. I had some undercooked ramen noodles earlier in the week, so these were much better. Had a nice chew. The appetizers were good. The karaage was nice and crispy and the gyoza meaty.\n\nOverall, an all right bowl of ramen. I just wish it was richer and didn't have that sour flavor. At least the apps were good.", "rating": 3, "date": "2016-11-03"}, {"excerpts": ["Kio Special Flavor ", "(Miso, Homemade Chili Paste, Garlic) ", "Ramen = noodles were okay, very al dente; toppings were good (bamboo shoots, spinach, wood ear mushrooms, boiled egg, roasted seaweed & chashu). ", "Chasu was the best thing about this. ", "Broth was definitely as described. "], "author": "Fannie S.", "review": "Only had take-out. \n\nFood = okay. Disappointed.\n\nKio Special Flavor (Miso, Homemade Chili Paste, Garlic) Ramen = noodles were okay, very al dente; toppings were good (bamboo shoots, spinach, wood ear mushrooms, boiled egg, roasted seaweed & chashu). Chasu was the best thing about this. Broth was definitely as described. $11.28\n\nGyoza (4 Pcs) = good. $2.78\n\nPrices = reasonable to moderate. Dinner for one came out to $15.29 (before $2.00 EAT24 coupon).", "rating": 3, "date": "2016-12-30"}, {"excerpts": ["I got the Kio Special Flavor ", "and it was so good. ", "At first I thought I wanted it a little more spicy, but by the end I was content with my choice but a little more heat would have been fine too. "], "author": "Crystal A.", "review": "We just ate here and our food was great!  (Bonus for being open for Christmas Eve!!). My brother got the Hell Special Flavor Ramen and it was the kind of hot to me that didn't add any flavor but just added heat. He enjoyed it until he tasted my broth and agreed that mine was some of the best ramen we've had recently. I got the Kio Special Flavor and it was so good. At first I thought I wanted it a little more spicy, but by the end I was content with my choice but a little more heat would have been fine too. With it being cold outside, it was awesome to be able to have yummy ramen where I wanted to drink all of the broth. \n\nWe also had the Gyoza which were incredible and we thought were possibly made on site since they tasted so fresh compared to most places. My only complaint was that it came out with my ramen instead of shortly before, but in the long run that worked out well for us.\n\nRight before we finished we ordered some fried eggplant and assorted tempura to take back to the house for the others. One piece of the fried eggplant was pretty greasy but it was the piece at the bottom of the container. The rest of the fried eggplant and the tempura had some grease but were tasty.\n\nOverall we plan on coming back for Kio Special Ramen and Gyoza for sure and to slowly try other elements of the menu to see if we find any other favorites!", "rating": 5, "date": "2016-12-24"}], "hell spicy flavor": [{"excerpts": ["Had the hell spicy flavor, yes very spicy, but it kills the good taste of the broth, my husband had the regular, which is much better.  "], "author": "Meiko S.", "review": "Great place for ramen, good service too :)  Had the hell spicy flavor, yes very spicy, but it kills the good taste of the broth, my husband had the regular, which is much better.  Also, I had a soft shell crab topping, that wasn't fresh, tasted off a bit.\n\nOverall, if you just get the regular pork ramen, it is very tasty!", "rating": 4, "date": "2017-01-21"}], "curry flavor": [], "tsukemen": [{"excerpts": ["Oh, my only problem was eating the Tsukemen. ", "I was confused."], "author": "Alberto W.", "review": "The food is pretty good and tasty. \nThe environment is pleasant. \nThe waitress are nice and polite. \nI would come here again next time. \n\nOh, my only problem was eating the Tsukemen. I was confused.", "rating": 5, "date": "2017-02-11"}, {"excerpts": ["We ordered unagi don and tsukemen. ", "Super tasty and can't find it elsewhere in SF. ", "Their prices are very fair. ", "Services are good as well. ", "Will definitely come back even though I live faraway."], "author": "Angela C.", "review": "Food are unique. We ordered unagi don and tsukemen. Super tasty and can't find it elsewhere in SF. Their prices are very fair. Services are good as well. Will definitely come back even though I live faraway.", "rating": 5, "date": "2017-06-24"}], "soft shell crab ramen": [], "seafood ramen": [], "lobster ramen": [], "chicken shoyu flavor ramen": [], "chicken miso flavor ramen": [], "chicken kio special ramen": [], "vegetable shoyu flavor ramen": [], "vegetable miso flavor ramen": [], "vegetable kio special ramen": [], "curry flavor ramen": [], "hell spicy flavor ramen": [], "chicken teriyaki set": [], "beef teriyaki set": [], "salmon teriyaki set": [], "chicken katsu curry set": [], "tonkatsu curry set": [], "unagi set": [], "jumbo unagi don": [{"excerpts": ["Sashimi , Jumbo Unagi Don, clod soba, Beef Udon, Bento combo", "......", "I've had just about very sashimi item. "], "author": "Eric C.", "review": "Oh la la......All I can say is this is my ramen spot! Sashimi , Jumbo Unagi Don, clod soba, Beef Udon, Bento combo......I've had just about very sashimi item. Hot sake Cold Sapporo.\n\nAlways amazing fresh fish here. The service is amazing.\n\nI love here!", "rating": 5, "date": "2017-09-13"}], "fried chicken set": [], "shrimp tempura set": [], "assorted tempura set": [], "vegetable tempura set": [], "tuna poke bowl": [], "salmon poke bowl": [], "mix poke bowl": [], "hamachi poke": [], "plain soba": [], "salmon soba": [], "shrimp tempura soba": [], "vegetable tempura soba": [{"excerpts": ["Ordered Vegetable Tempura Soba for takeout. ", "Ended up with Vegetable Soba (no tempura), which is supposed to come with seasonal vegetables. ", "It had maybe a dozen kernels of sweet corn and, wait for it... ", "iceberg lettuce. ", "I called to confirm ", "and yes, it was intentional. ", "I mentioned that it was an unusual choice in a soup. ", "I suggested maybe spinach or cabbage. ", "Their response: \"We are sorry that you do not like lettuce. ", "We will be happy to substitute spinach or cabbage for you next time.", "\" ", "Friendly, considerate staff ", "but as this was my first time ordering from them (and they gave me the wrong order to begin with) ", "I wonder what \"seasonal vegetables\" they'll come up with in the spring, summer and fall."], "author": "Jackie J.", "review": "Ordered Vegetable Tempura Soba for takeout. Ended up with Vegetable Soba (no tempura), which is supposed to come with seasonal vegetables. It had maybe a dozen kernels of sweet corn and, wait for it... iceberg lettuce. I called to confirm and yes, it was intentional. I mentioned that it was an unusual choice in a soup. I suggested maybe spinach or cabbage. Their response: \"We are sorry that you do not like lettuce. We will be happy to substitute spinach or cabbage for you next time.\" Friendly, considerate staff but as this was my first time ordering from them (and they gave me the wrong order to begin with) I wonder what \"seasonal vegetables\" they'll come up with in the spring, summer and fall.", "rating": 2, "date": "2018-01-19"}], "cold tanuki udon": [], "cold ramen": [{"excerpts": ["Ordered soba noodles, cold ramen, some chicken karrage and California rolls.  ", "Salty, salty, salty.  ", "The California rolls were ok, but man!  ", "take your high blood pressure meds before you eat here."], "author": "Stephanie Y.", "review": "Ordered soba noodles, cold ramen, some chicken karrage and California rolls.  Salty, salty, salty.  The California rolls were ok, but man!  take your high blood pressure meds before you eat here.", "rating": 2, "date": "2018-09-08"}], "pork kimchi ramen": [], "chicken kimchi ramen": [], "beef ramen": [{"excerpts": ["I ordered a beef ramen and we also ordered a spicy garlic pork ramen! ", "The ramen is really good here, it's chewy and fresh! ", "The beef is really good too, it's cooked perfectly! ", "The pork was pretty good too, there was a lot of fat on it though. ", "The service is really amazing, i highly recommend trying this place out! ", "The atmosphere is really cool too, this is definitely a whole in the wall you MUST try!"], "author": "Carissa C.", "review": "The service here is phenomenal!! I ordered a beef ramen and we also ordered a spicy garlic pork ramen! The ramen is really good here, it's chewy and fresh! The beef is really good too, it's cooked perfectly! The pork was pretty good too, there was a lot of fat on it though. The service is really amazing, i highly recommend trying this place out! The atmosphere is really cool too, this is definitely a whole in the wall you MUST try!", "rating": 4, "date": "2018-04-20"}], "seafood kimchi ramen": [], "tomato beef ramen": []}