{"lunch fresh spring roll po sod": [], "lunch crispy imperial roll po pia": [], "lunch fried calamari pla muk tod": [], "lunch chicken satay": [], "lunch pork spare ribs appetizer": [], "lunch samui ravioli": [], "lunch crunchy puff": [], "lunch crispy triangle tofu": [], "lunch shrimp grabok": [], "lunch crying tiger salad": [], "lunch larb gai salad": [], "lunch green papaya salad": [], "lunch mango salad": [], "lunch tom ka gai soup": [], "lunch tom yam kung soup": [], "lunch tom yam sea food soup": [], "lunch kowtom soup": [], "lunch bangkok pad thai": [], "lunch noodles peanut sauce": [], "lunch pad kee mao": [], "lunch jatujak pad see ew": [], "lunch bangkok bbq chicken gai yang": [], "lunch grilled pork moo yang": [], "lunch asian beef": [], "lunch grilled lamb": [], "lunch honey roasted duck and pineapple": [], "lunch panang salmon curry": [], "lunch pumpkin curry chicken": [], "lunch yellow curry chicken": [], "lunch red curry chicken": [], "lunch panang curry beef": [], "lunch green curry beef": [], "crab roll": [{"excerpts": ["I had the Chicken Soup and the Crab Roll to start both great. "], "author": "Mark E. S.", "review": "First off I have a business on Yelp and do not like giving bad reviews.\n\nThat said...\n\nI'm still at this restaurant where I came to dinner. I had the Chicken Soup and the Crab Roll to start both great. Then I had a green shrimp and scallop curry and a side of eggplant both also tasty! \n\nI was halfway through the curry when my stomach started cramping and I started to throw up. I quickly asked the waiter where the bathroom was. I went in and threw up dinner. I came back out and told my waiter that I think I may have gotten a bad scallop. He walked away came back later with a scallop on a plate and said 'these are fine'. I said, \"I am sure it is fine it may be possible I just got a really bad one, it happens.\"\n\nHe said well I'll take off half that dish. I said I am happy to pay for everything else but please take the entire dish off.  He argued saying he could not and I said what? \"If you can talk half off you can take it all off!\" He finally removed that single dish, no apology and instead said, \"Our food does not agree with you, NEVER COME BACK!\"\n\nI am blown away at this treatment and of course will not come back but being treated like this is totally uncalled for. \n\nI am sure the food is normally good. Most of mine was as I said, but to speak to a customer like this is absurd! \n\nAt hearing that, I paid my bill and left him zero tip. \n\nSO PISSED AT BEING TREATED LIKE THIS HERE! The server is named Tae.", "rating": 1, "date": "2017-01-04"}], "bags of gold": [{"excerpts": ["The one thing I do enjoy is their Bags of Gold, so I just ordered from them via Grubhub. ", "To my disgust, I found a long thick hair in one the \"bags\" as I was biting into it. "], "author": "Avi B.", "review": "I love Thai food and used to like Koh Samui and the Monkey before it went downhill. The food is mediocre.\n\nThe one thing I do enjoy is their Bags of Gold, so I just ordered from them via Grubhub. To my disgust, I found a long thick hair in one the \"bags\" as I was biting into it. I had to fish it out of my mouth because it was so long...\n\nI called Koh Samui and was very polite (as I tend to be, I also don't usually write bad reviews) and to my surprise, the manager refused to refund this appetizer and could not care less. She did not offer any apology either and simply said, Call Grubhub.\n\nI called Grubhub, and the customer service guy was great, apologized and said he would call Koh Samui. After trying to reason with them, he called back and said: \"Wow, they don't seem to want to do anything about this. I'm so sorry!\"\n\nThis was only a (long) hair and not a finger but I'm left with a bad taste in my mouth and will never order from them again!", "rating": 1, "date": "2017-06-04"}, {"excerpts": ["Ordered Bags of gold, Clay pot seabass & Emerald Curry. ", "Eerything was very tasty, and the portions were satisfying. ", "I would definitely make another trip to this place."], "author": "John R.", "review": "Not sure why so many people had a problem with this place, then again, it was completely empty so the service couldn't have been bad. \n\nOrdered Bags of gold, Clay pot seabass & Emerald Curry. Eerything was very tasty, and the portions were satisfying. I would definitely make another trip to this place.", "rating": 4, "date": "2013-12-17"}, {"excerpts": ["For an appetizer we had the Bags of Gold and spare ribs. ", "I can't recommend both of those enough! "], "author": "Rachel S.", "review": "I can't remember the last time I left a restaurant so completely satisfied and happy!\n\nFor an appetizer we had the Bags of Gold and spare ribs. I can't recommend both of those enough! The ribs were fall off the bone yummy! \n\nOur entrées were the beef curry and cashew prawns. The prawns were spicy but deliciously flavored,  certainly not good for those who dislike spice! The beef curry was amazing, too.\n\nService is fine, cocktails are fantastic, and overall, it was a great dining experience. I definitely will eat here again.", "rating": 5, "date": "2015-01-18"}, {"excerpts": ["We also had the bags of gold: tasty inside and nice presentation.  ", "That's about "], "author": "Nancy P.", "review": "I've passed by this place maybe on two occasions.  It looked nice from the outside and it was very packed so I thought \"let me add this place on my bucket list\".   \n\nLast night the Mister and I stopped by here because we were on our way to the Giants game and didn't want to pay bank to eat overly processed and bland ballpark food.  Not impressed.  The food was just as bland and equally overly priced.  He ordered chicken pad thai: bland, unseasoned chicken, terrible presentation, cold tofu pieces that smelled sour (old).  I ordered tom yum goong extra spicy: very bland, no flavor dimension, very sweet and not close to extra spicy like I ordered.  We also had the bags of gold: tasty inside and nice presentation.  That's about it folks, nothing to rant and rave about and definitely not a place I'll be visiting any time soon, if ever at all...\n\nNote: There is a pretty nice bar set up.  Several flat screen TVs and at one point the place even set up a projector which played the game...this is the only real positive.", "rating": 2, "date": "2013-07-25"}, {"excerpts": ["We ordered the Bags of Gold and Corn Fritters for appetizers. ", "Both were excellent. ", "The pumpkin curry was delicious as always... ", "one of the best red curries I've ever had, and the pieces of squash are so yummy! ", "Our server recommended it with shrimp, which was a nice change from the usual chicken. ", "The grilled chicken was our least favorite... ", "the flavor was okay, but the chicken itself was dry, and my bf detested the papaya salad it came with even though he generally loves green papaya! ", "Aside from that, our server was very friendly and energetic... "], "author": "Kavita S.", "review": "So I was curious about the recent drop in rating, because I had been here a couple times about 3 years ago and loved it.\n\nAfter my recent return, I can say that the food is as good as ever. That being said, there are definitely a couple things that have changed for the worse. They have crammed in way too many tables in the space that they have... almost all were occupied, but it really doesn't create a positive dining experience when you are surrounded by other tables within an arm's reach. (A claustrophobic's nightmare!) And you can only imagine how loud it would be! We requested to sit at a table on the side, which was still quite loud, but bearable. In addition, when I dined here previously, they used to carve the outside of the \"pumpkin\" in which they serve the pumpkin curry... it was a nice touch. But it seems they no longer do this...\n\nWe ordered the Bags of Gold and Corn Fritters for appetizers. Both were excellent. The pumpkin curry was delicious as always... one of the best red curries I've ever had, and the pieces of squash are so yummy! Our server recommended it with shrimp, which was a nice change from the usual chicken. The grilled chicken was our least favorite... the flavor was okay, but the chicken itself was dry, and my bf detested the papaya salad it came with even though he generally loves green papaya! Aside from that, our server was very friendly and energetic... no complaints about the service.\n\nOverall, I really enjoy the food here. The atmosphere would be nice if it weren't so cramped... Change that, and Koh Samui would be back to a solid 4 stars.", "rating": 3, "date": "2011-03-09"}, {"excerpts": ["Their bags of gold is pretty good and the bacon wrapped scallops!!! "], "author": "Toby I.", "review": "This a little pricey thai, and I left kinda hungry still but didn't wnat to spend another 40 bucks here.  The food is a little salty but it's pretty tasty nonetheless. Their bags of gold is pretty good and the bacon wrapped scallops!!! really good.\n\nI had the sea bass but it was a little fishy like .. it was old..", "rating": 3, "date": "2014-01-24"}, {"excerpts": ["Bags of Gold rice paper sacks of minced chicken and shrimp, tied with banana leaf, fried to a medium crisp $9\n- not super impressive. ", "The filling is overcooked to the point of being rubbery "], "author": "Ziyan C.", "review": "Very fancy, slightly overpriced Thai dinner. Good thing is everything is legitimately spicy and the curries are really flavored well.\n\nBags of Gold rice paper sacks of minced chicken and shrimp, tied with banana leaf, fried to a medium crisp $9\n- not super impressive. The filling is overcooked to the point of being rubbery and you dont get to experience the texture of either meat\n\nChiang Mai Style Pork Sausage minced pork, egg, tumeric and ginger $10\n- spicy! the pork is hearty and not overly minced. nice dish, but not incredibly memorable.\n\nFire Cracker seafood Sizzling hot plate of prawns, squid, scallop, crab claw and spicy peanut sauce $18\n- a nice mixture of seafoods, cooked to a good tenderness. \n- spicy but not much else to the flavor (didnt taste the peanut), good but not very memorable\n\nBasil Gai* white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce $12\n- another solid dish, good spiciness to it, not very memorable\n\nMadame Sea Bass* simmered in green curry with green beans, bell pepper, fresh basil and eggplant $16\n- very nice dish, loved the green beans which are the thinner type that you normally only see in asian grocery stores that i grew up with and love\n- eggplant soft, good flavor to the curry (though it was a little thin for my liking)\n\nAromatic Pumpkin Curry* chicken, bell pepper in red curry sauce served in pumpkin $16\n- a really nice dish, great curry, and very impressive looking because it came out in a pumpkin!", "rating": 3, "date": "2011-06-08"}, {"excerpts": ["They have a pretty unique appetizer called Bags of Gold which is a fried wonton thing filled with meat that truly resembles a tiny bag of gold."], "author": "Thomas C.", "review": "Good thai food. They have a pretty unique appetizer called Bags of Gold which is a fried wonton thing filled with meat that truly resembles a tiny bag of gold.", "rating": 4, "date": "2012-10-05"}, {"excerpts": ["We had bags of gold for appetizer. ", "It was ok. ", "Nothing special ", "and I wouldn't have ordered it on my own. ", "I had this shrimp stir fry dish, my bf the the lamb, and we also ordered a pork belly dish and the green beans side dish to reach the $70. ", "The portions were actually smaller than I had expected. ", "I was able to finish my dish which is pretty rare. ", "Everything was good, tho not amazing. ", "I think I'd much prefer to go to a less swanky place to fill my Thai food cravings."], "author": "Jenny C.", "review": "We had a groupon for this place and checked it out one week night. It was not very busy as it was around 8 or so. The $70 value did not apply to alcohol so we had to order a bunch of food to fulfill the amount. We had bags of gold for appetizer. It was ok. Nothing special and I wouldn't have ordered it on my own. I had this shrimp stir fry dish, my bf the the lamb, and we also ordered a pork belly dish and the green beans side dish to reach the $70. The portions were actually smaller than I had expected. I was able to finish my dish which is pretty rare. Everything was good, tho not amazing. I think I'd much prefer to go to a less swanky place to fill my Thai food cravings.", "rating": 3, "date": "2013-10-02"}, {"excerpts": ["Like many others before me have said, get the Bags of Gold, Pumpkin Curry, and the Grilled Honey Duck. ", "(kick ass, says G)\nSaturday night 8:30pm, restaurant was packed busy, so we had to sit at a bar table ", "and we still had great service.\n", "Edging on pricey, we paid nearly $50 for the above and 2 small servings of rice. ", "It's Thai food, isn't that supposed to be cheap? ", "But I'm sure we'll be back when the time comes as it's really close to home."], "author": "Carnley P.", "review": "Like many others before me have said, get the Bags of Gold, Pumpkin Curry, and the Grilled Honey Duck. (kick ass, says G)\nSaturday night 8:30pm, restaurant was packed busy, so we had to sit at a bar table and we still had great service.\nEdging on pricey, we paid nearly $50 for the above and 2 small servings of rice. It's Thai food, isn't that supposed to be cheap? But I'm sure we'll be back when the time comes as it's really close to home.", "rating": 4, "date": "2010-02-20"}, {"excerpts": ["Favorites:\nPumpkin Curry!\nSide of Cucumber!\nBags of Gold!\nEggplant and Tofu! ", "(given what it is...)\n"], "author": "Janney B.", "review": "This place was named after the island party in Thailand where the owners met + the fact that she is the Year of the Monkey.  \n\nIf I ever want to start my own \"how-we-met\" restaurant, this makes me think I had better re-evaluate the places I hang out to meet men. For example, \"Las Vegas and the Dog\" doesn't sound like a happening nightspot in San Francisco, now does it?  Entrees would be served Janney B. style, which means that delicious over-priced dishes would be presented to customers and right before they finished eating, we would rip the plates away and leave them wanting more.  My dating life is sadly conducted in similar fashion.\n\nKoh Samui & the Monkey has a cozy, sexy feel.  The lighting is attractive.  The noise is loud, but not too loud - This is good thing if you don't want to hear every single word someone is saying, ie:  business lunch or date your mother set up with her best friend's gay \"not out of the closet, yet\" son.\n\nFavorites:\nPumpkin Curry!\nSide of Cucumber!\nBags of Gold!\nEggplant and Tofu! (given what it is...)\nChicken Pad Thai!\n\nBy closing time, my friends and I were the last ones here.  I'm not sure if this was because we were busy licking the plates clean, or because we were so cute & charming the waitstaff didn't want us to leave.  Probably the former.", "rating": 4, "date": "2008-04-14"}, {"excerpts": ["Turns out they're \"Bags of Gold,\" with minced shrimp and chicken in crispy rice paper sacks. ", "Mental note to try those next time!"], "author": "Nicole G.", "review": "Koh Samui & the Monkey -- what a posh little Thai joint! It's right up there with Osha as far as atmosphere goes...  and the food feels more upscale than your typical Thai hole in the wall. We just stopped in for a casual meal pre-fashion show, but I was pleasantly surprised at how date-ish it felt. Mew!\n\nThe pumpkin curry was served in the actual pumpkin, and had chunks of goodness floating throughout. The noodles with peanut sauce (though they sound boring) were actually fantastic, and mixed with lush greens. The mango salad was yummy and fresh, but suuuper spicy. A real kick in the pants, I tell you.\n\nOn our way out, we saw that everyone was chowing down on the same dish. Turns out they're \"Bags of Gold,\" with minced shrimp and chicken in crispy rice paper sacks. Mental note to try those next time!", "rating": 4, "date": "2008-05-01"}, {"excerpts": ["Bags of Gold (minced chicken, shrimps wrapped in rice paper sacks) look, indeed, like bags of gold.  "], "author": "Jennifer W.", "review": "Out of curiosity, I did a Yelp search to find out if ANY Thai restaurant in SF had a five star rating.  None.  Three have 4.5 stars.  And then a bazillion have 4 stars.\n\nThis is the problem when it comes to Thai food: it is really hard to mess it up.  Thai food tends to be both budget and vegetarian friendly, and so generally everyone wins.  Who doesn't love Thai Iced Tea?\n\nThe dilemma then becomes how do you differentiate between Thai restaurants in SF?  Sure, there's the ever important how far is it from your house factor, and the do they have unlimited supplies of Siracha (rooster) sauce factor, or do they have anything other than Geyser Peak wine factor.  But really, when it comes down to it, they are testament to that especially San Francisco of problems: they are all so good.\n\nHowever, for me, none stands out above the crowd more than Koh Samui and the Monkey.  Here's why:\n\n1) Atmosphere: at Koh Samui, they've taken SOMA warehouse/office building and turned it into a lush, bubbling fountain, Giant Buddha kind of place, but without being tacky.  The decor doesn't overwhelm nor underwhelm: it just fits.  The end result is when you go to Koh Samui, you feel like you're doing something a little special, but without paying \"special\" prices.\n\n2) Presentation: The Fresh Spring Rolls (with shrimp, mint leaf and noodle) come out in a little dish that reminds you of a boat, with an umbrella that suggests a long lazy float down a river.  The pumpkin curry (chicken with red curry sauce served in pumpkin) is served in an actual green pumpkin.  Bags of Gold (minced chicken, shrimps wrapped in rice paper sacks) look, indeed, like bags of gold.  Even the dish I get most often, the \"Tofu with peanut sauce topped with crispy basil\" looks like someone thought about where they would ladle the sauce, not the standard mashup of ingredients you find elsewhere.\n\nWine List: A Pinot Noir from Central Otago. A Spanish Tempranillo. A lovely Chilean Reisling.  These are not your average Thai restaurant wines.\n\nFood: I think about the Tofu with peanut sauce when I am away.  Plus a plethora of rice choices: white, brown, jasmine or COCONUT!\n\nIt is these small things that really set Koh Samui apart from all the other wonderful, but predictable, Thai places in the City.", "rating": 5, "date": "2008-04-18"}, {"excerpts": ["I have three words for you: BAGS OF GOLD.\n\n", "Speaking of golden, get the bags of gold. "], "author": "Defne A.", "review": "I have three words for you: BAGS OF GOLD.\n\nThis is a great spot for a group dinner. Inexpensive share plates, but none of that small plates crap. You got a few apps, everyone can pick an entree and let the fun begin. It's a little hectic in the beginning with a group, but as long as you take one minute to get the group on the same page, then you're golden. Speaking of golden, get the bags of gold. Since we ordered almost everything on the menu, of note is the cashew chicken, the duck dish, and red curry with chicken. \n\nDon't drink too much and have one of the members of the group tell the waiter it's your birthday. They dim the lights in the entire restaurant and sing for you. Semi-embarrassing for me, but kinda more embarrassing for the person who told the waiter it was my bday. Who does that?\n\nGo go, have fun!", "rating": 4, "date": "2007-04-12"}, {"excerpts": ["The bags of gold & jungle curry are my favorite."], "author": "Donna W.", "review": "We like to go & sit in the bar.  We sat in the dining room once.  The food is great & Thai spicy.  It's great.  The happy hour is the best & the drinks & bartenders are wonderful!  The bags of gold & jungle curry are my favorite.", "rating": 4, "date": "2014-02-15"}, {"excerpts": ["The bags of gold appetizers (minced chicken and veggies wrapped in rice paper) looked nice, but was a little too greasy.  ", "Crushed sesame sea scallops were also on the heavy side, and the pad thai was not bad, not good, not memorable."], "author": "Peter L.", "review": "Not bad for a Thai restaurant in SF, but not great either.  Nice space and bar, but the food was a bit band and oily.  The pumpkin curry was my favorite dish here.  The bags of gold appetizers (minced chicken and veggies wrapped in rice paper) looked nice, but was a little too greasy.  Crushed sesame sea scallops were also on the heavy side, and the pad thai was not bad, not good, not memorable.", "rating": 3, "date": "2007-06-23"}, {"excerpts": ["I personally recommend the Bags of Gold (minced pork wrapped in light shell of dough deep fried) and the pumpkin curry--it's out of this world. ", "They also has a great cocktail list and happy hour (food and drink) from 5-7 everyday. ", "I appreciate the attention to detail from the food presentation to the interior design. ", "It's not over the top and maintains an intimate eating setting. ", "Prices are average. ", "Definitely a go-to bar if you live in SoMa, otherwise it's definitely worth checking out if you haven't been."], "author": "Alex H.", "review": "On the taste level, Ko Samui is pretty legit. They're flavor profiles are delicious and light. I personally recommend the Bags of Gold (minced pork wrapped in light shell of dough deep fried) and the pumpkin curry--it's out of this world. They also has a great cocktail list and happy hour (food and drink) from 5-7 everyday. I appreciate the attention to detail from the food presentation to the interior design. It's not over the top and maintains an intimate eating setting. Prices are average. Definitely a go-to bar if you live in SoMa, otherwise it's definitely worth checking out if you haven't been.", "rating": 4, "date": "2010-03-25"}, {"excerpts": ["Had the bags of gold, spicy seafood soup, and curried sea bass. ", "All were very good. "], "author": "Ahsan M.", "review": "Solid Thai spot in SoMa. Went there for dinner last Friday before seeing a movie. Had to get in and out in an hour and it took them 45 minutes. Good combo of speed and quality. \n\nFood and drinks were well above average but not especially noteworthy. Had the bags of gold, spicy seafood soup, and curried sea bass. All were very good. Monkey-drop (lemon drop with a restaurant-theme-appropriate name) was ok at best.\n\nAtmosphere was what it was: sitting by a window seeing the deranged walk by is part of what you get South of Market. Didn't really care since I was in a rush. Like someone else said, apparently it's always busy but we didn't wait more than a couple minutes.\n\nOverall, good place to grab a meal but don't expect too much more.", "rating": 3, "date": "2007-01-17"}, {"excerpts": ["The bags of gold are a must as an appetizer and the spicy green bean dish has become a staple of me and my family. ", "Sometimes we just get spicy green beans to go. "], "author": "Morgan E.", "review": "Eat here!!!!!\n\nThe decor alone should lure you into this place, all the decorations are authentic thai pieces and they're beautiful....ok now for the food. Its good, i mean, really good. The bags of gold are a must as an appetizer and the spicy green bean dish has become a staple of me and my family. Sometimes we just get spicy green beans to go. The lunch rush can be a bit overwhelming, dinner is the best time to go. \n\nIt can be a dress up or dress down kind of place, well priced and pretty much anything you order will be tasty.", "rating": 4, "date": "2007-02-16"}, {"excerpts": ["The best dishes I've had are:  Bags of Gold, Mieng Kum, Pumpkin Chicken Curry, Madame Sea Bass, Pad Thai, Penang Beef (YUM!!).\n\n"], "author": "Miriam W.", "review": "I love Koh Samui.  Good vibe, tasty food, fun drinks.\n\nThe best dishes I've had are:  Bags of Gold, Mieng Kum, Pumpkin Chicken Curry, Madame Sea Bass, Pad Thai, Penang Beef (YUM!!).\n\nI've been a little underwhelmed by the specials but consistently pleased by the standard fare.\n\nService is very accommodating - they set a table for us in the extra room when we walked in and they were chock full.\n\nLove the Monkey!!", "rating": 4, "date": "2007-03-12"}, {"excerpts": ["Bags of gold: minced chicken, shrimps wrapped in rice paper sacks\nThe name made me think that it would be really good, ", "BUT is was just OK", "...it was a bit dry inside....but the dipping sauce was yummy....\n \n"], "author": "BrElla4eva H.", "review": "This place is a bit hidden. I drive on this street all the time but I never noticed this restaurant. There isn't really a big sign or anything, just a banner. The place was small but intimate. Service was average, nothing extraordinary. Food was good, but I have had better Thai food. Here's what was on our dinner menu:\n\nTo start off...\n\nBags of gold: minced chicken, shrimps wrapped in rice paper sacks\nThe name made me think that it would be really good, BUT is was just OK...it was a bit dry inside....but the dipping sauce was yummy....\n \nFried sweet corn Patties:  crispy corn spiced with curry paste served with cucumber vinaigrette dressing\nI actually really liked this appetizer....\n\n\nMain Couses...\n\nClassic Yellow Chicken Curry\nThis was OK.....wasn't feeling the carrots in it though...\n\nSliced chicken wok fried with fresh basil\nCan you say SPICY!?! \n\nOverall, this place is OK. I'ld go back again....", "rating": 3, "date": "2007-07-28"}, {"excerpts": ["Bags of gold were good, and everything else wasn't too memorable after the few months "], "author": "Lea G.", "review": "I come here mostly for their to-go counter at lunch and haven't been disappointed yet.  The good stuff goes quickly, unfortunately, so I have to be here before 1:00 or it's not worth it.  Pad Thai is always a go-to.\n\nI've only eaten here for dinner once, and that was because of an open-table deal.  Certainly good food, but I wouldn't want to come here full-price too often.  Bags of gold were good, and everything else wasn't too memorable after the few months it's been since we went.\n\nOn the whole, solid Thai food, highly recommend the lunch counter, but out of my budget for regular dinning.", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["We ordered fresh spring rolls, \"bags of gold\", a spinach duck dish, pumpkin curry, and mango beef. ", "All the dishes were great. ", "Also, the pumpkin curry comes in a pumpkin! ", "The servers were all very friendly and attentive."], "author": "Jamie W.", "review": "We came here on a whim when there was a 45 minute wait at the restaurant we intended to eat at. We pretty much picked it because it's called \"The Monkey\". The ambiance is really nice, another high-end Thai restaurant! Pricey but the food was good. We ordered fresh spring rolls, \"bags of gold\", a spinach duck dish, pumpkin curry, and mango beef. All the dishes were great. Also, the pumpkin curry comes in a pumpkin! The servers were all very friendly and attentive.", "rating": 3, "date": "2009-11-06"}, {"excerpts": ["I can just order the Bags of Gold for appetizer and go home.  ", "It's my favorite thing to order on the menu.  ", "Their creme brulee is really good too ", "it has a hint of lavender in it."], "author": "amber c.", "review": "I can just order the Bags of Gold for appetizer and go home.  It's my favorite thing to order on the menu.  Their creme brulee is really good too it has a hint of lavender in it.", "rating": 4, "date": "2010-07-31"}, {"excerpts": ["The bags of gold had a nice decor for it and the Mieng Kum (chicken satay) was something new and unique that stood out from other thai spots in the city."], "author": "Ken S.", "review": "Average overall- the dinner entrees were nothing outstanding- (the pumpkin curry is better at citizen thai). \n\nworth nothing though are some of the appetizers.  the Imperal rolls are intreresting stacked like a log cabin.  The bags of gold had a nice decor for it and the Mieng Kum (chicken satay) was something new and unique that stood out from other thai spots in the city.", "rating": 3, "date": "2008-02-10"}, {"excerpts": ["I recommend their Bags of Gold (usually a special app).  ", "It has a nice crispy crunch!  ", "The waitstaff has always been really friendly and courteous- though they don't really talk much.  ", "Not bad....", "not Excellent either.  ", "It's a good choice for something casual in that area :)"], "author": "Tracy B.", "review": "We always end up ordering mostly appetizers here.  Their selection is really nice.  I recommend their Bags of Gold (usually a special app).  It has a nice crispy crunch!  The waitstaff has always been really friendly and courteous- though they don't really talk much.  Not bad....not Excellent either.  It's a good choice for something casual in that area :)", "rating": 3, "date": "2005-06-21"}], "crispy imperial rolls": [{"excerpts": ["Crispy imperial rolls stuffed w/ ground pork, wood ear fungus, veggies and taro topped w/ fresh carrot - $8 - cut in half lengthwise and stacked them up for presentation purpose, not a fan at all.  "], "author": "Gloria H.", "review": "3.5 stars - came here for dinner with hubby and found a space right in front.  It was half full and we were lead to sit at a four top table even though there were quite a few 2 tops available.  Not complaining since we tend to order a lot of food.\n\nWhile we were going over the menu, our waitress came by and told us about their prix fixe at $40/person that includes a glass of wine, about 9 dishes total and dessert - quite a deal but it didn't have the items we were considering so we opted to order our own.  What we had:\n\nFat Tire ($5) for hubby and Thai iced tea ($3) for me.  \n\nEmperor steamed dumpling - stuffed w/ mixed pork, calamari and shrimp served with ponzu sauce - $10 - it looks like a pillow, tasted ok.\n\nCrispy imperial rolls stuffed w/ ground pork, wood ear fungus, veggies and taro topped w/ fresh carrot - $8 - cut in half lengthwise and stacked them up for presentation purpose, not a fan at all.  The sauce was too sweet and too much of it.  \n\nSea bass Mor Din - steamed seabass sauteed w/ vermicelli noodle, shitake mushroom, broccoli and carrots - $16 - it was ok.\n\nEggplant tofu sauteed w/ bell pepper, fresh basil in chili and garlic sauce - $9 - it was ok, a bit on the greasy side\n\nYoung pepper pork - $13 - this was the best dish.  It has a nice spicy flavor to it - the pork was pretty tender.\n\nSteamed jasmine rice - $2.50.\n\nWe mixed the eggplant tofu to the pork and brought it home.", "rating": 3, "date": "2011-07-26"}, {"excerpts": ["A lunch special of Yellow Curry with potatoes and curry came with a side of Crispy Imperial Rolls. \n\n"], "author": "Mike K.", "review": "The past few weeks have been a blurry of lunch meetings and early morning coffees, but along the way, I've been able to explore some great new spots.\n\nLast week we sat down at Koh Samui and The Monkey, and if the aroma that drifts for blocks isn't enticing enough, the bustle of wide eyed eaters that pack into the venue will excite you.\n\nThe menu offers a wide selection, inspired heavily by the many spices that accompany Thai cuisine. Heat, distinct flavor profiles and rounded for the American eater, the menu is easy to navigate.\n\nA lunch special of Yellow Curry with potatoes and curry came with a side of Crispy Imperial Rolls. \n\nThe curry has a smooth tone, that was gentle on the taste buds and cooperated with the heavy and rich imperial rolls. Freshly pickled greens accompany the dish which offer a refreshing reprieve from the bold flavors on the plate.\n\nService is genuine and although the venue is busy at lunch, each server took great care of us.\n\nA great lunch spot in the heart of SoMa, I'm glad to add this to my list of top Thai restaurants in the city.\n\n( I still have no clue where and how they got this name... )", "rating": 4, "date": "2010-06-30"}, {"excerpts": ["We had the calamari, crispy imperial rolls, vegatable samosas, and Mieng kum.  ", "All of it was delicious.  ", "Great flavor, great presentation - very very tasty.  ", "I definitely recommend all of the aforementioned appetizers.  ", "Unfortunately, the rest of the meal doesn't inspire such rave reviews.  ", "The pad thai was average, the spicy sirloin beef was alright ... meat didn't taste very tender, Fire cracker seafood sizzling hot plate ... didn't really seem to sizzle that much.  ", "It hits the spot if you want a variety of seafood, but I had hoped for more flavor.  "], "author": "Kathleen W.", "review": "I don't do well driving in the city ... especially when it's the night of a ballgame.  I was flustered, I was hungry ... I needed a drink.  We ended up here ... which is really a very odd name for a Thai Restaurant ... and it's \"The Monkey\" part that I remember.  \n\nAnywho, we had a waiter in \"training\" wait on us and he was super nice.  I know he was making every effort to be polite and do everything right.  I think he did a great job!  He seemed shy, so I didn't catch his name, he was a blonde kid, but I really respected that he wasn't all up in interrupting us so that he could take our orders and stuff.  I really dislike super aggressive waiters who interrupt you and get all up in your business when you're just trying to enjoy your friends.  Anyway, he was patient with us as we took forever on the wine list (and then ended up sending a bottle back ... prior to uncorking) and recommended the riesling which was delicious by the way.  \n\nI was very pleased with the appetizers here.  We had the calamari, crispy imperial rolls, vegatable samosas, and Mieng kum.  All of it was delicious.  Great flavor, great presentation - very very tasty.  I definitely recommend all of the aforementioned appetizers.  Unfortunately, the rest of the meal doesn't inspire such rave reviews.  The pad thai was average, the spicy sirloin beef was alright ... meat didn't taste very tender, Fire cracker seafood sizzling hot plate ... didn't really seem to sizzle that much.  It hits the spot if you want a variety of seafood, but I had hoped for more flavor.  It is afterall, a Thai restaurant ....\n\nIn anycase, I wouldn't be adverse to coming here again ... but I'd probably stick to the appetizers.  Those are worth a repeat visit.", "rating": 4, "date": "2007-07-26"}, {"excerpts": ["The crispy imperial rolls and Pumpkin Curry are worth a try. "], "author": "C L.", "review": "I am a fan of Osha so I decided to check this place out when some of the reviewers mentioned that they felt this was better than Osha.  First off, the ambiance of this restaurant is not better than Osha.  The next thing I noticed was that the prices were higher than Osha's. When I see a restaurant charging $16 for a curry, it better be some iron chef curry.\n\nThe food overall was good but not great and memorable.  The crispy imperial rolls and Pumpkin Curry are worth a try. My hubby had the Basil Gai which he uses as a measure for Thai Restaurants and he found it underwhelming and not worth it. The desserts did not seem appetizing enough to try for $10. \n\nFor the quality of the food and the actual ambiance of this restaurant, I think the prices are double what they should be.", "rating": 3, "date": "2010-10-12"}, {"excerpts": ["Started off with the crispy imperial rolls.  ", "They come looking like a Jenga game, stacked on top of each other.  ", "It looks like you're getting a lot, but in reality, because they slice the rolls in half before stacking them, you get 3 full rolls, and then the tower is topped with three rolls of basically fried carrot.  "], "author": "Denise M.", "review": "Another great meal.  Started off with the crispy imperial rolls.  They come looking like a Jenga game, stacked on top of each other.  It looks like you're getting a lot, but in reality, because they slice the rolls in half before stacking them, you get 3 full rolls, and then the tower is topped with three rolls of basically fried carrot.  All of it delicious.\n\nWe shared a yummy curry beef stew and grilled BBQ chicken.  We also ordered coconut rice (dinky bowl for $3, really?), and Pad Thai as well.  Everything was really good.  The pad thai, while delicious, was the smallest portion.  Basically, it would give three people a small serving.  \n\nThe only bad thing was that from the time our 'take home bag' was packed and sitting on our table, it took about 15 minutes to get the bill, pay for it, and get our credit card back.  It's like we were done with our meal and they forgot about us.", "rating": 4, "date": "2009-04-18"}, {"excerpts": ["and I both had one of their lunch specials which came with crispy imperial rolls, a curry dish and sticky rice.  ", "We also had a glass of wine ", "and I think the bill was barely over $20.  ", "Plenty of food, I polished mine off, co-worker couldn't finish hers.  ", "That, topped with the decor and friendly service makes me a fan."], "author": "Matt L.", "review": "Went here for lunch on a weekday - which was great.  We were seated right away.  Co-worker and I both had one of their lunch specials which came with crispy imperial rolls, a curry dish and sticky rice.  We also had a glass of wine and I think the bill was barely over $20.  Plenty of food, I polished mine off, co-worker couldn't finish hers.  That, topped with the decor and friendly service makes me a fan.", "rating": 4, "date": "2010-06-09"}, {"excerpts": ["what we ordered...crispy imperial rolls, grilled bankok bbq chicken and madame sea bass\n\n...", "crispy imperial roll was good and the madame sea bass was exceptional, it's sweetness, spicyness and light curry sauce just morphed into a perfect goodness dish. ", "now you may be wondering why the heck am i rating this a 1 STAR.... ", "well, they served me a precooked dish, if i am paying top dollar for something, you better serve me quality with no monkey trick's.\n", "the bbq chicken was ok but possibly grilled ", "way early in the morning or a leftover the night before. "], "author": "Gors P.", "review": "what we ordered...crispy imperial rolls, grilled bankok bbq chicken and madame sea bass\n\n...the place is uppity and you do see it in your bill. service and presentation was ok. \n\n...crispy imperial roll was good and the madame sea bass was exceptional, it's sweetness, spicyness and light curry sauce just morphed into a perfect goodness dish. now you may be wondering why the heck am i rating this a 1 STAR.... well, they served me a precooked dish, if i am paying top dollar for something, you better serve me quality with no monkey trick's.\nthe bbq chicken was ok but possibly grilled way early in the morning or a leftover the night before. a trick is a trick and i bet that monkey is still inside that kitchen. \n\nahhhhhhh!  i will miss that darn curry dish...", "rating": 1, "date": "2010-12-05"}, {"excerpts": ["I was given a generous serving of beef (guess beef costs less than cashews nowadays) and the noodles were pretty good, but what stood out above the rest were the Fried Calamari and Crispy Imperial Rolls. ", "I got heartburn afterward from all the grease, but it was worth it, they were delicious."], "author": "Jennifer L.", "review": "I went back today to celebrate my Supervisor's birthday and the food was much better the second time around, though I dared not order the cashew chicken again (maybe two cashews is enough for Mary Kate Olsen, but not me). Instead, I got the Bangkok Pad Thai with Beef. I was given a generous serving of beef (guess beef costs less than cashews nowadays) and the noodles were pretty good, but what stood out above the rest were the Fried Calamari and Crispy Imperial Rolls. I got heartburn afterward from all the grease, but it was worth it, they were delicious.", "rating": 3, "date": "2009-01-20"}], "crunchy puff": [{"excerpts": ["Their appetizers are always a delight to have and I recommend the chicken satay, fried calamari, and crunchy puff in this area. ", "They have some set meals for lunch which I believe come with a starter, entree, and drink for a good deal. ", "Their pad thai and pad kee mao are very solid dishes, with their pad thai having a good amount of sweetness and the pad kee mao packing in quite the heat. "], "author": "Joshua M.", "review": "Koh Samui & The Monkey, hidden away in the SoMa district, is home to lots of delicious quality Thai food!\n\nI come here every once in a while with coworkers as it's not too far from where I work and I enjoy the food here every time. Their appetizers are always a delight to have and I recommend the chicken satay, fried calamari, and crunchy puff in this area. They have some set meals for lunch which I believe come with a starter, entree, and drink for a good deal. Their pad thai and pad kee mao are very solid dishes, with their pad thai having a good amount of sweetness and the pad kee mao packing in quite the heat. There are also some interesting dishes here such as a seafood udon pad thai which was absolutely delicious and unique.\n\nThe service here is great and friendly. The seating and atmosphere is clean and nice for a casual meal. I highly recommend this place for anyone looking for some delicious thai food in a comfortable sit down environment!", "rating": 5, "date": "2016-05-27"}], "scallop satay": [{"excerpts": ["scallop satay good\nstuffed mushrooms ok\n", "tom kha gai soup good, tasty\nbelly basil tasty good but "], "author": "Y I L I W.", "review": "3.5 stars is pretty accurate . could easily be a four if the dishes were upped and tweaked a bit . ..\n\n+ :  ambiance (of bar area and inside the restaurant) . tasty food . pretty good wine beer sake selection . ..\n\nscallop satay good\nstuffed mushrooms ok\ntom kha gai soup good, tasty\nbelly basil tasty good but some bits a little chewy overcooked\nmiracle duck pretty good\nbrown rice had hard rice bits\nvolcano fried rice good\nTurley zinfandel wine bottle solid:\n\n-- :  service (several times throughout the visit we were given the wrong dish, luckily one of our party kept track - nice recovery though) . dishes were good but nothing extraordinarily so . ..", "rating": 3, "date": "2012-11-25"}], "fried sweet corn fritter": [], "chicken satay skewer": [], "tofu satay skewer": [], "tom yam sea bass hot pot": [], "green papaya salad": [{"excerpts": ["I also ordered the Green Papaya salad. ", "It has shredded green papaya, prawns, cherry tomatoes and peanuts with a spicy lime dressing. ", "This was really good also, but it is more of a side dish than a personal salad. "], "author": "Theo T.", "review": "My coworkers and I always make an effort to come here at least once a week. We usually say, \"Hey what do you want?\" and usually our response is \"Well we haven't had Thai food this week.\" It is like a weekly tradition to come here.\n\nI have tried a lot of things on the menu, some really good and some not so great. I have had the Fresh Spring Rolls (Po Sod). They come with shrimp, lettuce, mint leaves and noodles and served with peanut sauce. These are my favorite! I usually eat these as a meal also because they come with a good amount for one person. I also ordered the Green Papaya salad. It has shredded green papaya, prawns, cherry tomatoes and peanuts with a spicy lime dressing. This was really good also, but it is more of a side dish than a personal salad. It was so small that I was still hungry afterwards.\n\nNow for the things that are not terrible, but didn't blow me away. At every Thai restaurant you have to try their Pad Thai. Their's comes with thin rice noodles with tofu, egg, bean sprouts and lime in a tamarind sauce. I thought it was good, but nothing special about it. I definitely have had better elsewhere. Also, my all time favorite Thai dish is Panang Curry, so I always have to try this too and compare which is my favorite. The Panang Curry Beef is stewed with kaffir leaves in panang curry. This was a little on the bland side for me. I am used to a lot of yummy rich curry flavor and then the freshness of the kaffir leaves, but this just was subpar.\n\nThis place is great for a quick lunch, dinner, or a big party. The servers are really nice and quick. I don't think my water was ever empty during lunch.", "rating": 4, "date": "2016-01-28"}, {"excerpts": ["We dined on four dishes:  green papaya salad, shrimp spring rolls, pumpkin curry, and seabass.  "], "author": "Alex S.", "review": "I have never had a bad meal at Koh Samui & The Monkey.  This particular evening continued that streak.  Wanting to have a quiet, enjoyable meal before watching the Smuin Christmas Ballet, we originally had reservations for 5 p.m.; however, we had to make a last-minute delay until 5:15 and the restaurant accommodated us without a fuss.\n\nWe dined on four dishes:  green papaya salad, shrimp spring rolls, pumpkin curry, and seabass.  All the dishes were excellent and they accommodated our need to be finished by 6:30 p.m. in order to make it to our show.\n\nService was prompt and friendly, and the wines (by the glass) were quite good!  Merlot and Cabernet Sauvignon.\n\nCheers to the staff for an enjoyable, delectable meal!\n\nI'll be back!", "rating": 4, "date": "2015-03-29"}, {"excerpts": ["- I had a Green Papaya Salad (which wasn't as flavorful as it should be) and a Chicken Pad Thai (which was bland with crap on top of it). ", "The GPS wasn't sweet or tangy but rather it was a little stale and somewhat bland. ", "The pad thai was greasy and also very bland. ", "Not even the hot sauce helped. "], "author": "Billy W.", "review": "I was expecting a lot better, but like many others before me, I was also disappointed with this place. \n\nFood: 2/10 - I had a Green Papaya Salad (which wasn't as flavorful as it should be) and a Chicken Pad Thai (which was bland with crap on top of it). The GPS wasn't sweet or tangy but rather it was a little stale and somewhat bland. The pad thai was greasy and also very bland. Not even the hot sauce helped. I think the only thing they did relatively okay on is my thai iced tea.\n\nService: 7/10 - The waitress was really nice and very friendly as well as some of the other staff members. \n\nPrices: 1/10 - Expensive for crappy food. \n\nOverall: 3/10 - Food was meh and very pricey. However, the staff were great when I went there and that boosts their rating just a bit. I would avoid though since there are plenty of better thai places around SoMA.", "rating": 2, "date": "2013-08-04"}, {"excerpts": ["Our main entree was the $10 Bangkok B.B.Q. Chicken which came with a tangy green papaya salad. ", "The chicken came in small pieces perfectly grilled. ", "We were sated. "], "author": "Ed U.", "review": "To help me with this review, I have asked Dieter, the anally erect host of Sprockets, to interject with anomalous comments that disturb him almost to the point of insanity ...There. He is insane now.\n\n\"Would you like to touch my monkey? Touch him! Touch my monkey!\"\n\nKoh Samui & the Monkey sounds like a Siamese organ grinder and his pimpy chimp with the little bellboy hat and an even littler tin cup. But no, it's not....it's really an industrial-chic Thai restaurant with lots of Pier One touches to remind you that hey, you're in a Thai restaurant.\n\n...\"I am so filled with anticipation that my genitals have sucked up into my body cavity.\"\n\nSaturday in the early afternoon is a great time to go there. It's empty since you can barely tell it's open from the street. Jamie W. and I realized neither of us had been there in quite a while. He used to work a block away and get take-out, and I used to meet colleagues there after work. When it's quiet, the open space makes the place seem more inviting. That and the staff is relaxed and constantly smiling in that true Thai manner.\n\n...\"I appreciate a warm hand on my opening....your story has become tiresome.\"\n\nWe are trying to eat healthier these days, so we went for three dishes that did not appear to make our triglycerides do a sizable uptick. First up was the $8 Crying Tiger Salad, a provocatively named dish that mixed grilled strips of beef with lime juice, various herbs, chili flakes and red onion. Deliciously savory. I was genuinely excited to see Pea Shoots in Garlic as a vegetable side since I haven't had them since a visit to Ton Kiang out on Geary a couple of years ago. Extremely tasty with a nice bite to them.\n\n...\"Now I am as happy as a little girl!\" (Dieter is now pinching his black spandex shirt to simulate the erection of his nipples.)\n\nOur main entree was the $10 Bangkok B.B.Q. Chicken which came with a tangy green papaya salad. The chicken came in small pieces perfectly grilled. We were sated. The only blight on the afternoon were the expensive Diet Cokes, $3 a glass and no refills.\n\n...\"I feel spent...like a man who is forced to wear his genitals around his neck like a pendant.\"\n\nJamie and I decided we need to come back here more often, as this and Basil are easily the two best Thai restaurants in SoMa. By the way, what's with those funky \"Lost and Found\" postcards of faux-missing dogs in the restroom? I think they would have been funnier in a Vietnamese place since their fictitious canine dishes are the stuff of legend.\n\n ...\"I am emotionally obliterated ...now is the time on Sprockets when we dance ...DANCE!\"\n\nFOOD - 5 stars...really like every dish I've had at this place...fresh and never sauce-laden\nAMBIANCE - 5 stars...love the open space, and hey, I like Pier One\nSERVICE - 5 stars...forever smiling and attentive\nTOTAL - 5 stars... Dieter has the final word: \"This restaurant pulls down my pants and taunts me. But not in a mean-spirited way. It looks at me when I'm naked and calls its friends.\"...need I say more.", "rating": 5, "date": "2007-10-20"}, {"excerpts": ["We ordered the green papaya salad and I expected a little heat, but there was none.  "], "author": "Coy T.", "review": "Came last night for dinner and the ambience was nice, although a bit too dark, it couldn't save the meal.  I expected traditional fare not fusion.\n\nOur server, Linda, was absolutely the sweetest and so cute!  \n\nWe ordered the green papaya salad and I expected a little heat, but there was none.  The tomatoes were also overly ripe and too soft.  \n\nThe seabass green curry with eggplant was wonderful and cooked perfectly!  The crispy tofu was nice, but how can you mess that up?  The sauce was a bit too sweet/rich for my taste. \n\nCoconut rice was good.  \n\nA bit strange to have tv's in a such an elegant restaurant.", "rating": 3, "date": "2011-10-13"}, {"excerpts": ["Green papaya salad -OK dish. ", "The portion was a bit smaller than expected. ", "However I love green papaya salad at almost every place...so may not be able to give a fair judgment...\n", "3) "], "author": "Heidi M.", "review": "Despite a visit without a reservation on Friday night, we could easily get a table! Nice. \n\nFOOD\n1) Tom Yum Kung Soup -Bit too sweet and sour. The sourness tasted like coming from some vinegar or something like that... I believe Tom Yum Kung sourness must come from lime originally. Also it was not hot nor spicy. \n2) Green papaya salad -OK dish. The portion was a bit smaller than expected. However I love green papaya salad at almost every place...so may not be able to give a fair judgment...\n3) Pad thai -Mysterious sourness...and sweetness....\n\nDecor / Atmosphere\nClean and modern with cute a bit accent of Thai taste. Tables are set decently but the atmosphere is casual.\n\nService\nGood. Friendly and nice!\n\nPrice\nDecent. Total $45 for above with an orange juice and a glass of red wine.  Red wine was actually the most expensive of all ;-P \n\nOver all..., I don't think I would visit here again...", "rating": 2, "date": "2010-05-07"}, {"excerpts": ["We also ordered the green papaya salad. "], "author": "Daniel G.", "review": "I'm giving a 5 star rating not only for the food and ambiance, but especially the service.\n\nWe came here on the night that we were going to Cirque Du Soleil. The show was at 8 and we arrived at the restaurant at 7. Even though it was a Wednesday night, the place was pretty full. We told them right up front that we had a show and that we would need to be out of there by 7:45. While waiting to be seated, we took a look at the menu and figured out what we wanted to order. We were seated and ordered by 7:15. All of the food was out within the next 10 mins--a total of 5 dishes which i'll get to in a second--and we were done right on time. The waiters were very attentive and friendly, and they got us in and out right in time, I really appreciated that.\n\nNow back to the food:\n\nLarb Gai-excellent. Larb is a salad of sorts, which is mainly composed of a meat (or tofu), onion, cilantro, lime, fish sauce, and chili. They do it very well here and it's served in a bell pepper. We also ordered the green papaya salad. Not much to say here, other than it was fresh and tasty.\n\nDuck---something, i can't exactly remember what, but it was served with a soy based sauce and spinach and it was amazing--succulent, succulent duck. Unfortunately it was kinda skmipy.\n\nPad Thai- again, not much to say here, it's pad thai. I didn't order this one. I never order pad thai. We actually had a discussion about this before ordering, one of the other people said that pad thai is the best way to tell if the thai restaurant is any good...a barometer of sorts to gauge the place. I personally disagree, i feel like pad thai is like ordering refried beans at a Mexican restaurant, it doesn't really tell you anything. The curries are where it's at! to me pad thai is a waste of a dish, but some people like to stick with what they know, what are you going to do?\n\nSouthern Curry. Beef panang curry. So amazingly good, it was a great blend of sweet and spicy and it was a thick curry sauce--it really stuck to the meat and rice and added a lot of flavor. THAT was the gauge for me and it was really good.\n\nThe ambiance here is nice too, it was actually kind of a bummer that we were in a rush, because it would have been nice to hang out for a while. \n\nSo for the food, the ambiance, and especially the service, 5 stars for me. I would definitely come back.", "rating": 5, "date": "2010-01-10"}, {"excerpts": ["Our green papaya salad came in a tall and narrow wooden coconut looking thing that was hard to eat out of.  ", "It was tasty enough, but was accompanied by a random flock of butter ", "lettuce chunks on the side- ", "no dressing, just random chunks of butter lettuce.  ", "Decoration?  "], "author": "Nikki W.", "review": "Koh Samui has some rough edges.  First of all, they lost our reservation so we had to sit at the cramped and uncomfortable bar tables. \n\nSecondly, the place can't decide if it wants to be hip or kitchsy.  The decor is modern and clean, but the waitresses are gussied up in the most ridiculous Thai costumes.  And the drinks come with tacky plastic monkeys a la something you would find in the Tonga Room.  \n\nOur waitress- who was in training- was just awkward.  She mixed up our order and had a hard time communicating.  She came at the wrong times, interrupted our conversation, asked awkward questions.... just odd.  This is bad enough, but the food could not make up for the lack of service.  Our green papaya salad came in a tall and narrow wooden coconut looking thing that was hard to eat out of.  It was tasty enough, but was accompanied by a random flock of butter lettuce chunks on the side- no dressing, just random chunks of butter lettuce.  Decoration?  We couldn't figure it out.  \n\nThe margarita was terrible.  What more can I say?\n\nI ordered Tom Kha Gai soup- a perennial favorite of mine.   It was nearly inedible, however- terribly sweet as others have mentioned.\n\nThe main courses- seabass curry and pad thai were the highlights.  They alone nearly made up for all the other crappy bits.  Well prepared and very very good.  However, there are SO MANY other great Thai places in the city that I don't think I will return here again.", "rating": 2, "date": "2010-05-17"}, {"excerpts": ["we tried the beef and chicken satay, corn fritters, green papaya salad,  sea bass clay pot, eggplant and tofu, shrimp pad see ew, pumpkin chicken curry, and stew beef.  ", "everything was good.  ", "i thought i would like the sea bass a lot better ", "but it wasnt as moist as i would have liked.  ", "one of my pieces was all fat.  "], "author": "claudia y.", "review": "i had been here once before and i dont know why i thought it was a more formal place than it really was.  then i learned its name was not just koh samui but koh samui and the monkey and all romantic visions of candle lit white table cloths and formally clad patrons disappeared.  their tables are dressed in white table cloths and they do have candles on them though they are battery operated.  but anyways how formal can thai food be ...\n\nwe came early before my friends bday dinner to have drinks at the bar.  they only had one bartender it seemed and he couldnt get to everyone.  he had to give my bf a free beer for taking so long.  not a bad deal i guess since we were in no rush.  i got a mango margarita which was good.  we also got the bar small plates of shrimp and duck.  these plates are really small.  the duck was missing the cucumber salad as the menu described and came with cabbage on the botttom instead.  the shrimp had a really spicy sauce which made my mouth feel like it was on fire. the bar meny also had noodle bowls that they didnt serve in the restaurant.\n\nwhen we got to our table, our party of ten was stuck between the bathroom, the bar, and the kitchen.  not the best table, not the window view table but it was ok i guess.  our waitress was softspoken.  and i had to ask her twice for my drink.\n\nwe tried the beef and chicken satay, corn fritters, green papaya salad,  sea bass clay pot, eggplant and tofu, shrimp pad see ew, pumpkin chicken curry, and stew beef.  everything was good.  i thought i would like the sea bass a lot better but it wasnt as moist as i would have liked.  one of my pieces was all fat.  yucky.\n\ni dont know if i like osha or kohsamui better.  i think osha gives bigger portions for the same price.  both of their pumpkin chicken curries are $16.", "rating": 3, "date": "2009-01-20"}, {"excerpts": ["First and foremost, don't skip the Green Papaya Salad.  ", "That was worth the trip alone.  ", "Also, the Cashew Beef was very good.  ", "One person in our party remarked that there wasn't really anything that differentiated its taste from Chinese food, and he was right.  ", "However, it makes for a good transition dish for losers like me.  ", "The Pumpkin Curry Chicken was interesting, but I didn't especially care for it.  "], "author": "Adam W.", "review": "I'm not very familiar with Thai food, but that just makes this review valuable in a different kind of way.  Think of this as Thai for Dummies and/or Unadventurous Eaters.\n\nFirst and foremost, don't skip the Green Papaya Salad.  That was worth the trip alone.  Also, the Cashew Beef was very good.  One person in our party remarked that there wasn't really anything that differentiated its taste from Chinese food, and he was right.  However, it makes for a good transition dish for losers like me.  The Pumpkin Curry Chicken was interesting, but I didn't especially care for it.  Some other dishes I'm really looking forward to trying next time are the BBQ Chicken over even more papaya salad and the Red Curry Duck.\n\nIf I can eat there, anyone can.  Excellent variety, attentive service, and quality that's hard to beat for the price.  And who isn't at least a little intrigued by the name?", "rating": 4, "date": "2006-09-18"}, {"excerpts": ["I also recommend the tender and flavorful BBQ chicken salad that comes with a wonderful, fresh and tangy green papaya salad.  ", "And I like the won ton noodle soup and lemongrass tofu."], "author": "Lolia S.", "review": "I've eaten here many times and I've only been disappointed once (one dish was very oily - the spicy chili rice noodles).  They are consistent, even if they do get your order wrong every once in awhile (we would order take out usually).  For what it's worth, one of my colleagues was from Thailand and she liked this place.\n\nI also enjoyed dining at the actual restaurant as the decor is charming and it has an upscale feel.  The servers are attired in traditional Thai clothing (and they change outfits often) and the dining room is filled with interesting Thai art objects.  The dishes are plated so prettily.\n\nMy favorite lunch special is the pumpkin curry but I've enjoyed all their curry dishes.  You can also substitute brown rice.  You can ask them to make your dish spicier too (it still isn't very spicy, but I appreciate how accommodating they are).  I also recommend the tender and flavorful BBQ chicken salad that comes with a wonderful, fresh and tangy green papaya salad.  And I like the won ton noodle soup and lemongrass tofu.", "rating": 4, "date": "2007-07-28"}, {"excerpts": ["We had Green Papaya Salad, Corn Fritters, Pumpkin Curry, and the Asian Beef.  ", "All the dishes were seasoned beautifully, and layers of spice and heat kept coming through during the meal.  ", "We are anxious to try the Other Monkey as well."], "author": "John K.", "review": "Solid, well seasoned Thai food in a clean environment.  We arrived  early (6:00), and there were only about  4 other parties at tables.  Our service was very attentive and respectful from both wait and kitchen staff.  We had Green Papaya Salad, Corn Fritters, Pumpkin Curry, and the Asian Beef.  All the dishes were seasoned beautifully, and layers of spice and heat kept coming through during the meal.  We are anxious to try the Other Monkey as well.", "rating": 4, "date": "2010-10-06"}, {"excerpts": ["the green papaya salad is tasty though i'll be sure to ask for more spicy next time.\n", "the braised tofu dish is great too but also indicated spicy when it wasn't.\n", "but, a good dose of hot sauce fixed that up.\n"], "author": "Anh V.", "review": "cute lil spot in soma with a definite thai flavor in decor without being over the top.\n\nsit down for a laid back rendez vous or at the bar to watch the latest game and chat with the bartender and locals.\n\nthe food presentation is nice but the quantity is on the small side.\nthe green papaya salad is tasty though i'll be sure to ask for more spicy next time.\nthe braised tofu dish is great too but also indicated spicy when it wasn't.\nbut, a good dose of hot sauce fixed that up.\nalways ask for rice since it doesn't come with entrees necessarily.\n\nlooks like i have to try the rolls and pumpkin curry on my next visit.", "rating": 3, "date": "2008-08-29"}, {"excerpts": ["we enjoyed the green papaya salad as well.\n\n"], "author": "Jill M.", "review": "nice ambiance and delicious food.\n\n3 words: pumpkin curry chicken. absolutely delicious, with the perfect amount of heat/sweetness. my mouth is watering just thinking about it! we also had a green seafood curry special which I thought was pretty good but not quite as yummy as the chicken curry. we enjoyed the green papaya salad as well.\n\nbonus points for offering brown rice! :)", "rating": 4, "date": "2006-10-16"}, {"excerpts": ["the five of us shared the veggie samosas, corn fritters, green papaya salad, eggplant w/ tofu, pumpkin curry w/ tofu, pea sprouts, and veggie pad thai.  ", "all of it was good, particularly the pumpkin curry and pea sprouts, but the portions were kinda small.  "], "author": "Helen T.", "review": "after a LONG day of drinking and walking throughout the city for bay to breakers, we came here for dinner last night.  at around 8 pm, the restaurant was pretty empty, so we got some drinks and were seated right away.  the five of us shared the veggie samosas, corn fritters, green papaya salad, eggplant w/ tofu, pumpkin curry w/ tofu, pea sprouts, and veggie pad thai.  all of it was good, particularly the pumpkin curry and pea sprouts, but the portions were kinda small.  we got the monkey's mummy dessert, which was a bananas flambe w/ vanilla ice cream.  \n\ncocktails here are pretty good and fruity.", "rating": 3, "date": "2008-05-19"}, {"excerpts": ["The negatives were that we were sat at a table by the bathroom but the staff was very accommodating and moved our party of six and the green papaya salad was mediocre.  ", "Service was friendly but almost too quick with bringing out food."], "author": "Chrissy C.", "review": "Pumpkin curry was great. All other dishes we tried were stand outs too - monkfish served two different ways (even though I never saw this fish in Thailand) and scallops, and the beers were cold and refreshing. The negatives were that we were sat at a table by the bathroom but the staff was very accommodating and moved our party of six and the green papaya salad was mediocre.  Service was friendly but almost too quick with bringing out food.", "rating": 4, "date": "2011-12-01"}, {"excerpts": ["we typically order the fresh spring rolls (yummy!), the green papaya salad, the pad thai (i love the thicker than normal noodles), the chicken pumpkin curry (my boyfriend loves it), and the prawns and cashew nuts.  \n\n"], "author": "Harmony R.", "review": "i really like the interior of this place!  although we have only ordered take out- we have to go in to pick it up (one downside- they don't deliver) and it's very nicely designed.  i love how the windows are practically floor length- so the patrons can dine and watch the passersby (or cars drive by- i guess not as fun though).\n\nif you are ordering off their website- when you enter it you come to a blank brown screen that is rather confusing.  if you figure out you need to scroll all the way to the right you will find the menu button.  i think they need to redesign their website.\n\nwe typically order the fresh spring rolls (yummy!), the green papaya salad, the pad thai (i love the thicker than normal noodles), the chicken pumpkin curry (my boyfriend loves it), and the prawns and cashew nuts.  \n\nwe have ordered in the past- and never will again- the prawn salad (it was not a great size with very few prawns on it) and the grilled prawns entree (it was really disappointing- not many prawns sitting on top of a tasteless salad of greens).  and if you like your rice order at least one per person- the side rice is not a huge portion by any means.  \n\nthis is a great place for take out- and i would try it for dine in.  some of the dishes are hit and miss.  but the ones i have found i like are consistently good.  and the waitstaff is always pleasant.  i would give them 3 1/2 stars if i could.  they are our standby for take out thai food- as they are convenient (a few blocks away) and pretty good.  in my experience it's pretty hard to find a really good thai place- despite the fact that there are hundreds of them in most every major city.  my favorite thai place happens to be in federal way, washington- and whenever i visit i attempt to have a meal there.  i'd love to find a place like that in s.f.  but until then i will stick with koh samui.", "rating": 4, "date": "2006-12-19"}, {"excerpts": ["I tried one of the lunch specials ($7.95) - BBQ chicken w/green papaya salad and rice. ", "The sauce that came on the side was sooo...good! ", "The papaya salad was spicy and tasty. ", "I would love to return and try other dishes! ", "My friend had the Noodles w/peanut sauce and ate almost all of it (took the leftovers to go). ", "I thought the other lunch specials were a bit pricey ($10 - $12). ", "One thing to note if you haven't been there-- ", "I walked past the entrance because it didn't look like it led to the restaurant. ", "I peeked around the corner to see if the entrance was on the side. ", "As I waited for my friend, I someone else do that, too!"], "author": "Michele O.", "review": "Yum! I tried one of the lunch specials ($7.95) - BBQ chicken w/green papaya salad and rice. The sauce that came on the side was sooo...good! The papaya salad was spicy and tasty. I would love to return and try other dishes! My friend had the Noodles w/peanut sauce and ate almost all of it (took the leftovers to go). I thought the other lunch specials were a bit pricey ($10 - $12). One thing to note if you haven't been there-- I walked past the entrance because it didn't look like it led to the restaurant. I peeked around the corner to see if the entrance was on the side. As I waited for my friend, I someone else do that, too!", "rating": 4, "date": "2006-10-16"}], "sirloin salad": [{"excerpts": ["The beef in the sirloin salad was tough, the tom ka soup was average and the scallops were just okay.  ", "I think P and I had something else but neither us can remember what we had a few days later. "], "author": "Terry T.", "review": "What a disappointment. Although the red monkey cocktail, a blend of lime vodka, French ginger liqueur, fresh lime, sweet & sour, and pomegranate was good; the rest of the meal went downhill. The beef in the sirloin salad was tough, the tom ka soup was average and the scallops were just okay.  I think P and I had something else but neither us can remember what we had a few days later. I can enjoy better Thai food in my local neighborhood restaurants.\n\nAh the service, we were asked if what we wanted to order before we even were given menus and then not even give enough time to decide before we were asked again. Yet, when it came time to pay the bill it took forever to get our check.", "rating": 2, "date": "2011-08-10"}, {"excerpts": ["We ordered the Fresh Shrimp Spring Rolls and Sirloin Salad as starters.  ", "Six portions of Spring Roll arrived on a porcelain boat with a spicy peanut fish sauce dip.  ", "Cold, crisp, and delicious!  ", "The salad was a good 2-person portion.  ", "Slices of perfectly grilled and seasoned steak atop chunks of iceberg lettuce, red onion, cilantro, with a fish sauce and vinegar dressing.  "], "author": "Rick M.", "review": "Made Valentine's Day reservations at Koh Samui & The Monkey last night and had a fabulous time with my sweetie!  Koh Samui also gets extra props for managing to fit us in for a VD dinner reservation after I brain-farted and had to call the morning of.\n\nBrannon and 3rd Street is definitely a destination for us (we don't find ourselves strolling around this part of the City too often), but it was well worth the extra effort to get here ($10 cab from Financial District).  Unassuming and industrial outside belies the warm, chic, yet comfortable interior.\n\nCheck-in on a busy Valentine's Day evening was quick and painless.  We got a cozy window seat.  The interior is beautifully lit, nice music, oil lamps on tables, and seating not so close as to be eavesdropping on your neighbor's conversations.\n\nThe menu is extensive and is what I'd call Thai fusion.  What it's fused with is hard to tell, but I like the creativity!  We ordered the Fresh Shrimp Spring Rolls and Sirloin Salad as starters.  Six portions of Spring Roll arrived on a porcelain boat with a spicy peanut fish sauce dip.  Cold, crisp, and delicious!  The salad was a good 2-person portion.  Slices of perfectly grilled and seasoned steak atop chunks of iceberg lettuce, red onion, cilantro, with a fish sauce and vinegar dressing.  I could eat a bowl of this.\n\nWe ordered a $28 bottle of La Follette Pinot Noir which paired beautifully.  Light enough to not mask flavors, yet the crisp Pinot fruit came right through.\n\nWe decided to sample a few entrees so ordered the Belly Basil (crisp-skin pork belly slices stir fried with basil and vegetables), Eggplant Tofu (sauteed with bell pepper, fresh basil in chili and garlic sauce), and the Grilled Lamb To Die For (marinated lamb chops served with grilled asparagus and carrots in a white wine & garlic sauce with a side of sticky rice).  We also ordered a side of steamed brown rice and side of coconut rice.\n\nHands down, the lamb chops ruled!  Perfect grilling, slightly gamey taste that worked well against the sweet sticky rice.  The Belly Basil was addictive, spicy, basil-licious, and the portion of pork belly was generous.  Crisp pork skin added a great play of texture against the fatty deliciousness of the belly.  The Eggplant Tofu was good, but perhaps the weakest of the entrees we sampled.  The eggplant was well-cooked (still firm and well-flavored), but it was already only warm by the time it arrived to the table rather than piping hot.\n\nWhile the steamed brown rice was your average steamed rice, the coconut rice was OFF THE HOOK!  I'd go back just for a side of rice!\n\nNeedless to say, we had no room for desserts (and they had already run out of fresh Mango and Sticky Rice).\n\nAll in (apps, dinner, bottle of wine) we racked up a $120 tab (not including tip).  And we tipped well, as the service all around was impeccable.\n\nThis may have been a Valentine's Day destination dinner, but I think Koh Samui & The Monkey is now on our favorite list.  We'll be back often!", "rating": 4, "date": "2012-02-15"}], "yam talay salad": [], "salmon chardonnay salad": [], "whole snapper": [{"excerpts": ["We ordered the pumpkin curry (a MUST), the whole snapper and the green beans. ", "Wow... when it said 'Whole snapper' on the menu, I did NOT expect it to actually come out with a whole deep-fried snapper...", "yes, complete with head and all, manipulated such that it curled around the actual nuggets of snapper. ", "We just treated the whole fish as decoration, but I ate the eye just for shock value. ", "Wasn't bad! ", "The snapper itself had a great flavor and had great texture. "], "author": "Penny Y.", "review": "The atmosphere here just screams Soma -- the clean modern lines, large windows, and great lighting, but infused with a Thai theme. \n\nWe ordered the pumpkin curry (a MUST), the whole snapper and the green beans. Wow... when it said 'Whole snapper' on the menu, I did NOT expect it to actually come out with a whole deep-fried snapper...yes, complete with head and all, manipulated such that it curled around the actual nuggets of snapper. We just treated the whole fish as decoration, but I ate the eye just for shock value. Wasn't bad! The snapper itself had a great flavor and had great texture. The green beans were plated very nicely, but I wasn't too impressed with them after the pumpkin curry and snapper.\n\nFor dessert, we got the creme brûlée. It had an amazing jasmine flavor but the top wasn't torched enough because my spoon went clear through when I went to crack it. We also got the Monkey's Mummy, which was a flaming banana with coconut flakes. It was rich, sweet, and worked well with the cold coconut ice cream. \n\nThe service was pretty slow but the food was great. The presentation definitely upped my star rating. I'm glad to add an upscale Thai place to my repertoire.", "rating": 4, "date": "2010-07-01"}, {"excerpts": ["Now onto the food: we ordered the following dishes and shared family style:\n- Whole Snapper (fried and coated in a sweet sauce, it wasn't bad but the fish did not taste especially fresh)\n- Crunchy Tofu (with \\spinach and mushrooms covered in a thick peanut sauce - this one kind of sucked)\n- ", "Belly Basil (pork belly with basil and bell peppers", ", portion was very small and the pork belly was tough and greasy)\n- Chicken Pad Thai  ", "(how can you go wrong with pad thai at a thai restsaurant? "], "author": "Nancy J.", "review": "Came here on a Sunday night with a small group and didn't have any problem getting a table.  We arrived at around 6:30pm and the restaurant was pretty sparse, but by the time we left at 8ish it was already quite full.  That's a good sign I suppose.  \n\nNow onto the food: we ordered the following dishes and shared family style:\n- Whole Snapper (fried and coated in a sweet sauce, it wasn't bad but the fish did not taste especially fresh)\n- Crunchy Tofu (with \\spinach and mushrooms covered in a thick peanut sauce - this one kind of sucked)\n- Belly Basil (pork belly with basil and bell peppers, portion was very small and the pork belly was tough and greasy)\n- Chicken Pad Thai  (how can you go wrong with pad thai at a thai restsaurant? this one unfortunately was pretty dry and bland)\n- Duck Curry (with pineaples, again, portion is tiny with a couple meager pieces of duck floating around)\n- Tom Kha Gai soup (more sour than it should be, and not at all spicy or flavorful)\n\nThe thai iced tea tasted a bit watered down.\n\nOverall, the food was very underwhelming. As much as I hate to say it, you should just go to Osha instead.  And if you don't care about service or atmosphere, go to King of Thai.", "rating": 2, "date": "2011-05-16"}, {"excerpts": ["Have to admit - tried only one dish there, not enough to really judge, but it was the most expensive one (whole snapper with cashews and chilies, $22 for entry), so being rather disappointed by its preparation and taste accounts for a lot.\n\n"], "author": "Sasha M.", "review": "Have to admit - tried only one dish there, not enough to really judge, but it was the most expensive one (whole snapper with cashews and chilies, $22 for entry), so being rather disappointed by its preparation and taste accounts for a lot.\n\nHowever, it's good at accommodating large groups (lots of tables they have no problem moving together), and there is Bacar across the street to balance out Koh Samui's early closing time.", "rating": 2, "date": "2007-12-30"}], "andaman sea bass": [{"excerpts": ["We ordered the Andaman Sea Bass, Jurassic Park Shrimp and tom yum soup. ", "The tom yum was the worst that we've ever had. ", "It was very sweet with big whole pieces of cherry tomatoes floating in it. ", "When the sea bass arrived, the tiny little piece of fish was hidden under a bed of huge pile of veggies. ", "The fish was so less, $20 for the plate it was shocking. ", "We were 2 in our group. ", "When we divided the fish it was exactly two spoonfuls. ", "One spoon for each of us!! ", "The shrimp was also quite small, but not as less as the fish. ", "For $55 (without tip) we left feeling cheated. ", "There are many Thai restaurants in and around Soma where you can get a good portion of protein for $55! ", "While walking out, I politely told them about the disappointment about the food and the quantity. ", "I was told that sea bass is very expensive that's why the portion is so small. ", "Sea Bass is also one of my fav fishes and I order it in other restaurants quite often. ", "Never have I been served two spoonfuls of fish hidden under piles of onions, red peppers and some leafy vegetable. ", "So watch out for the Monkey! ", "I think the Monkey eats most of the food before it is served to you!"], "author": "Pakhi P.", "review": "Sitting at the restaurant, waiting for the bill and writing this review...the food is not bad, but the quantity is ridiculous. We ordered the Andaman Sea Bass, Jurassic Park Shrimp and tom yum soup. The tom yum was the worst that we've ever had. It was very sweet with big whole pieces of cherry tomatoes floating in it. When the sea bass arrived, the tiny little piece of fish was hidden under a bed of huge pile of veggies. The fish was so less, $20 for the plate it was shocking. We were 2 in our group. When we divided the fish it was exactly two spoonfuls. One spoon for each of us!! The shrimp was also quite small, but not as less as the fish. For $55 (without tip) we left feeling cheated. There are many Thai restaurants in and around Soma where you can get a good portion of protein for $55! While walking out, I politely told them about the disappointment about the food and the quantity. I was told that sea bass is very expensive that's why the portion is so small. Sea Bass is also one of my fav fishes and I order it in other restaurants quite often. Never have I been served two spoonfuls of fish hidden under piles of onions, red peppers and some leafy vegetable. So watch out for the Monkey! I think the Monkey eats most of the food before it is served to you!", "rating": 1, "date": "2016-06-24"}], "crispy soft shell crab": [{"excerpts": ["Between a party of three, we ordered 5 dishes: Shrimp Pad Thai, Pumpkin Curry, Mango Catfish, Crispy Soft Shell Crab and the Grilled Lamb to die for. ", "My favorite dishes were the Pumpkin Curry and the Shrimp Pad Thai. "], "author": "Viennelyn C.", "review": "Ever since I've moved to San Francisco, I have always wanted to have dinner at Koh Samui & The Monkey. This neighborhood gem is located in the SOMA district and has a notorious reputation for having the best Thai food in San Francisco. I'm surprised it is not known as one of the most romantic restaurants in San Francisco. With it's dim lighting and romantic ambiance it definitely fits the description.\n\nBetween a party of three, we ordered 5 dishes: Shrimp Pad Thai, Pumpkin Curry, Mango Catfish, Crispy Soft Shell Crab and the Grilled Lamb to die for. My favorite dishes were the Pumpkin Curry and the Shrimp Pad Thai. You can always tell if a Thai restaurant is amazing by how delicious their Pad Thai dish is!\n\nMy only disappointment was that my Pumpkin Curry came in bowl instead of an actual pumpkin. However, it was a delicious meal nonetheless! If I lived closer to the SOMA district, I would definitely be a frequent diner.", "rating": 4, "date": "2011-12-29"}, {"excerpts": ["For our main courses, we decided to order the Crispy Soft Shell Crab and the Pad Thai.  ", "I wasn't too impressed with the Pad Thai, but the soft shell crab was good.  ", "And luckily, the dish came with two, so we each got one to eat.  ", "After perusing through all the Yelp reviews for this restaurant, I had intended on ordered the Pumpkin Curry because of all the rave reviews, but I didn't.  ", "I'm just so not into the spicy and this one time I went to Osha Thai on a business lunch and ordered Pumpkin Curry ", "and it was waaaaay too spicy for me.  ", "So there I was trying to discuss business, but my mouth was burning!!!  ", "I didn't want another one of those spicy incidents.  ", "But back to the point, I might try ordering the Pumpkin Curry if I come back."], "author": "Kris L.", "review": "A and I have been talking about eating here for a while and finally made it out this past Saturday for lunch.  It was really empty inside.  I think only one table was occupied, but I guess it's more bustling on weekdays versus weekends.  I didn't really mind because we didn't have to wait and had the full attention of our waiter.\n\nThe decor is really nice inside and the waiters are dressed in traditional Thai outfits.\n\nThe food was good.  I guess on weekends they just have the dinner menu, even during lunch - because we totally had the dinner menu.  Anyway, we started with the Emperor Steamed Dumplings and the Fresh Spring Rolls.  I actually liked the dumplings a lot.  The spring rolls tasted like they do at any other restaurant.  Nothing stood out about them.  For our main courses, we decided to order the Crispy Soft Shell Crab and the Pad Thai.  I wasn't too impressed with the Pad Thai, but the soft shell crab was good.  And luckily, the dish came with two, so we each got one to eat.  After perusing through all the Yelp reviews for this restaurant, I had intended on ordered the Pumpkin Curry because of all the rave reviews, but I didn't.  I'm just so not into the spicy and this one time I went to Osha Thai on a business lunch and ordered Pumpkin Curry and it was waaaaay too spicy for me.  So there I was trying to discuss business, but my mouth was burning!!!  I didn't want another one of those spicy incidents.  But back to the point, I might try ordering the Pumpkin Curry if I come back.", "rating": 3, "date": "2009-11-03"}, {"excerpts": ["Crying tiger salad grilled sirloin beef mixed with lime juice, Thai herbs, chili flakes and red onion; Crispy soft shell crab with garlic and pepper served with cucumber vinaigrette; Sea bass clay pot sautéed assorted sea bass with mixed vegetables ", "(Sea Bass Mordin); Spicy sirloin beef with vegetables in green curry sauce.  ", "Our guests loved the dishes and enjoyed every course."], "author": "Lyn D.", "review": "I've been a long time regular customer of Citizen Thai and The Monkey (on Grant Ave at Vallejo St) but when they closed down I began dining at their sister restaurant - Koh Samui and the Monkey.  Every year I'd always throw a large dinner party at their restaurant.  This year, my husband (now) and I had our engagement party here and they were able to accomodate 32 people on a Thursday evening.  The menu is exceptional and really captures the authenticity of Thai cuisine!  Raffy the manager is awesome - he is very accomodating and very easy to talk to when it comes to customizing a pre fixe menu.  The staff is prompt and service is superb.  Dishes to die for:  Bag of gold minced chicken, shrimps wrapped in rice paper sacks; Prawns wrapped in crispy rice paper 8; Crying tiger salad grilled sirloin beef mixed with lime juice, Thai herbs, chili flakes and red onion; Crispy soft shell crab with garlic and pepper served with cucumber vinaigrette; Sea bass clay pot sautéed assorted sea bass with mixed vegetables (Sea Bass Mordin); Spicy sirloin beef with vegetables in green curry sauce.  Our guests loved the dishes and enjoyed every course.", "rating": 5, "date": "2008-09-14"}], "pla priew wan": [], "thai pork stew": [], "prawn cashew nuts": [{"excerpts": ["Prawn Cashew Nuts $18 versus $16, and even at $16 it would be a huge disappointment for a very small amount of food. ", "The Pad Thai was not traditional. "], "author": "O W.", "review": "Ordered here using Amazon Prime. Found that the Amazon Prime prices are inflated. Eat24 had Pad Thai for $10, we paid $13. Prawn Cashew Nuts $18 versus $16, and even at $16 it would be a huge disappointment for a very small amount of food. The Pad Thai was not traditional. Maybe it's traditional some parts of Bangkok, but definitely not like the ones we had (actually in Bangkok).\n\nI don't know who to blame for the markup, whether it's Amazon or the restaurant, but the food and value doesn't merit more than 2 stars.", "rating": 2, "date": "2016-04-28"}], "pork belly basil": [{"excerpts": ["We ordered pork belly basil which turned out dry, tough, and lacking in flavor.  "], "author": "Favoloso M.", "review": "Came here for dinner last night and the ambience was lovely but the service fell short! Only one waiter for the entire restaurant so you can imagine how things went.\n\nWe ordered the bacon wrapped scallops which were uhmazing! Loved the sauce! And the grilled steak salad - pretty good.  Then it went downhill from there.  We ordered pork belly basil which turned out dry, tough, and lacking in flavor.  Looking down on our plates we felt we really couldn't eat it we sent it back and ordered something else.\n\nWe tried the Beef Mango which didn't turn out much better.  The vegetable presentation was the same so meat with peppers, carrots, the beef was tough and tasted like boiled beef and the sauce was just a sauce.\n\nOne glass of wine and three beers plus this unmemorable meal came up to $79 before tips.  So close to $100 I'd say was expensive for mediocre food.  OSHA Thai is a more reliable bet for tasty food. And better service!", "rating": 2, "date": "2015-01-29"}, {"excerpts": ["The pork belly basil is one of my favorites but almost everything here is great.  ", "I try to order them at least once a month for catering at work.  ", "Love the pork hocks too.  ", "YUMMM!!!"], "author": "Erika S.", "review": "This is one of my favorite places to get thai in the city.  The pork belly basil is one of my favorites but almost everything here is great.  I try to order them at least once a month for catering at work.  Love the pork hocks too.  YUMMM!!!", "rating": 4, "date": "2013-05-21"}, {"excerpts": ["The pork belly basil was very greasy. ", "Dishes took forever to come out even though the place was not crowded at the time. ", "It was just a horrible experience. ", "There was nothing authentic about it.  ", "For authentic Thai food, go to Thai Time on 8th Avenue near Clement, or Marnee Thai."], "author": "A L.", "review": "I'd give them half a star if I could. Took 20 minutes to get our drinks after ordering. The batter on the calamari was too thick and had no flavor. The fish cakes were too salty and inedible. We ordered the chicken pumpkin curry, which was luke warm and had only three small pieces of pumpkin. It was mostly overcooked chicken pieces. The pork belly basil was very greasy. Dishes took forever to come out even though the place was not crowded at the time. It was just a horrible experience. There was nothing authentic about it.  For authentic Thai food, go to Thai Time on 8th Avenue near Clement, or Marnee Thai.", "rating": 1, "date": "2013-01-21"}], "beef mango": [{"excerpts": ["I got the Beef Mango Wok and the Honey Roasted Duck. ", "Both dishes were not thaat good. ", "They were just okay. ", "You need to go with a really close friend like I did so that you focus on the conversation than the food. ", "Service was excellent, however. ", "Dont go if you want to eat good Thai food."], "author": "Kirsten K.", "review": "This place is iite. \nI got the Beef Mango Wok and the Honey Roasted Duck. Both dishes were not thaat good. They were just okay. You need to go with a really close friend like I did so that you focus on the conversation than the food. Service was excellent, however. Dont go if you want to eat good Thai food.", "rating": 3, "date": "2017-02-21"}, {"excerpts": ["We tried the Beef Mango which didn't turn out much better.  "], "author": "Favoloso M.", "review": "Came here for dinner last night and the ambience was lovely but the service fell short! Only one waiter for the entire restaurant so you can imagine how things went.\n\nWe ordered the bacon wrapped scallops which were uhmazing! Loved the sauce! And the grilled steak salad - pretty good.  Then it went downhill from there.  We ordered pork belly basil which turned out dry, tough, and lacking in flavor.  Looking down on our plates we felt we really couldn't eat it we sent it back and ordered something else.\n\nWe tried the Beef Mango which didn't turn out much better.  The vegetable presentation was the same so meat with peppers, carrots, the beef was tough and tasted like boiled beef and the sauce was just a sauce.\n\nOne glass of wine and three beers plus this unmemorable meal came up to $79 before tips.  So close to $100 I'd say was expensive for mediocre food.  OSHA Thai is a more reliable bet for tasty food. And better service!", "rating": 2, "date": "2015-01-29"}, {"excerpts": ["Had the beef mango which was by far the best dish.  ", "The beef was perfectly stir fried to have a nice carmalized crust and the mango added a nice refreshing tart bite.  "], "author": "Scott C.", "review": "Glad to keep on finding good food in SOMA.  Make no mistake, this is expensive Thai.  That said, the food is good and there is a wide variety of options to suit any tastes.  \n\nHad the beef mango which was by far the best dish.  The beef was perfectly stir fried to have a nice carmalized crust and the mango added a nice refreshing tart bite.  Good balance in terms of both texture and flavor.\n\nThe duck curry was pretty good because they gave us lots of moist duck meat.  Most Thai places will give you lots of skin and bones with their curry dishes.  Not this place.  Good amounts of duck breast.  So you get something for the money.  \n\nCap it off with some spicy string beans and you have a great balanced meal.  \n\nVery happy with the food and the service was promt and enthusiastic so made for a very pleasant experience.  \n\nLooking forward to coming back.", "rating": 4, "date": "2011-01-06"}, {"excerpts": ["My recommendation for dinner - calamari app, beef mango with coconut rice and a sazerac. ", "It has a nice date vibe - quiet, low lights, cool decor. ", "You can go there casual "], "author": "Raquel L.", "review": "I love this place. I've been there about 5 times in the last couple months. Everything I've had has been delicious. My recommendation for dinner - calamari app, beef mango with coconut rice and a sazerac. It has a nice date vibe - quiet, low lights, cool decor. You can go there casual but then I feel a little under dressed. \n\nI would have given this place 5 stars after my first visit, but the service isn't consistant. The meals are definitely better some nights than others, the service as well. And on those off nights I feel a little miffed about the price. Take that with a grain of salt though since I will definitely go back.", "rating": 4, "date": "2013-02-12"}, {"excerpts": ["Crispy Pork Hocks - DELICIOUS - omg fried pork skin, NOMNOMNOM\nBeef Mango - pretty good - safe choice\nSpicy Wild Boar - also pretty good - safe choice\nCoconut Rice - meh, not as coconutty as I would have liked.\n\n"], "author": "YaYa S.", "review": "We sat for dinner. Unfortunately, you cannot order happy hour drinks at the dinner tables, which kinda sucks. Not sure why you should be penalized since we're spending more for dinner...\n\nWe ordered:\nGreen Salmon (noodle) - TERRIBLE - salmon super dry, noodles tasted and looked like packaged ramen noodles.\nCrispy Pork Hocks - DELICIOUS - omg fried pork skin, NOMNOMNOM\nBeef Mango - pretty good - safe choice\nSpicy Wild Boar - also pretty good - safe choice\nCoconut Rice - meh, not as coconutty as I would have liked.\n\nThe amount of food per plate is ok. Definitely on the pricier side.\nGenerally, the atmosphere was nice. It got crowded quickly on a Monday evening.\nI may come again, but the price is definitely a hurdle.", "rating": 3, "date": "2013-07-23"}, {"excerpts": ["Kee Mao Scallop pan seared scallops sauteed with basil, red bell peppers, tomatoes and fresh Thai chilies and served over squid ink noodles\nMain: Beef Mango flank beef stir fried with fresh mango, bell pepper, carrot, ginger, black pepper and chili garlic sauce\n\n"], "author": "Tia N.", "review": "I have eaten authentic Thai food, and this is the best I have ever had. The food is worth every penny! The cocktails are creative and delicious...thanks to Raffy...and the elegant dishes are created by Raffy's brother.\nI had the honor of meeting the owner and her stunning little daughter before dinner. I immediately picked up that she is internationally travelled and educated and has passed all this on to her daughter and businesses.\n\nHere are some dishes we had:\nSalad: Larb Gai minced chicken tossed with lime juice, chili flakes, parched rice and mint. Served in a bell pepper with lettuce on the side\nMain: Basil Gai white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce\nMain: Grilled Lamb To Die For marinated lamb, mixed vegetables in white wine & garlic sauce, and sticky rice\nNoodle: Sea Bass Mor Din steamed sea bass sauteed with glass noodle, shitake mushroom, broccoli and carrots\nNoodle: Kee Mao Scallop pan seared scallops sauteed with basil, red bell peppers, tomatoes and fresh Thai chilies and served over squid ink noodles\nMain: Beef Mango flank beef stir fried with fresh mango, bell pepper, carrot, ginger, black pepper and chili garlic sauce\n\nWe will definitely go there regularly...And as for the wine selection...wow! International and perfect as pairings to the food. Bravo!", "rating": 5, "date": "2011-11-06"}, {"excerpts": ["Tom Kha Gai Soup\nPumkin Curry\nBasil Gai\nBeef Mango\nSpicy Crispy Chicken Fried Rice\n"], "author": "Morena C.", "review": "This is my favorite Thai restaurant in San Francisco.  \n\nI just recently went again after not going for a few years...I was nervous it wouldn't be as good as I remembered.  It was just as good, maybe even better!  \n\nWe did a family dinner and shared a bunch of entrees - each was more delicious than the next.  Everyone must try the Pumpkin Curry - it is an absolute must.  \n\nDishes I highly recommend: \nTom Kha Gai Soup\nPumkin Curry\nBasil Gai\nBeef Mango\nSpicy Crispy Chicken Fried Rice\nCalamari Appetizer\n\nReasons CANNOT give the full 5 Stars: \n- A small bowl of plain white rice is $15....really?!?  (if one person orders, they charge for the whole table, $3/person)\n- We asked how many pieces came per appetizer order...he said he could do a platter so everyone would get one of everything.  In turn we got 3 massive appetizer platters with way too much food at $24 PER platter. \n- Good signature cocktails but the glasses are tiny and the bartenders are slow. \n\nOverall, this is a must try.  I will continue to go because it really is delicious.", "rating": 4, "date": "2011-12-08"}, {"excerpts": ["Also, the Beef Mango Rice was remarkably tasty and the meat very high quality.  \n\n"], "author": "Jordan F.", "review": "This is a review for delivery, I've never been to the actual restaurant.  Delivery was prompt- only an hour which is normal.  \n\nThe food was really tasty, although not spicy enough.  I had to put a lot of sriracha on the Pad See Ew to give it some spice and more flavor.  The best was the Crying Tiger Salad- very minty and fresh.  Also, the Beef Mango Rice was remarkably tasty and the meat very high quality.  \n\nI would recommend to anyone that has $40 to spend on a lunch for 2 people.", "rating": 5, "date": "2011-07-15"}, {"excerpts": ["We also had the beef mango.  ", "I was originally skeptical of the combination ", "but It was tasty.  ", "I may have actually enjoyed the mango more than the beef."], "author": "Maxwell S.", "review": "Very much enjoyed the scallops with sesame seeds.  We also had the beef mango.  I was originally skeptical of the combination but It was tasty.  I may have actually enjoyed the mango more than the beef.", "rating": 4, "date": "2012-07-05"}, {"excerpts": ["Other favorites are the beef mango. ", "Being Indian, we also love the veggie samosas as appetizers that come with a nice sweet and sour sauce and tastes just like you would get at an Indian restaurant. "], "author": "Sheena S.", "review": "This is definitely a neighborhood favorite. We bring all of our out of town guests here and the locals too. The service is always fast and good and although we usually call ahead, we've never had to wait for a table. \n\nThe pumpkin curry is my favorite. It tastes delicious and the presentation is amazing because it comes in a pumpkin which usually blows our out of town guests away. We also like ordering the pineapple fried rice for that reason because it comes in a pineapple. However, the pineapple fried rice will probably only feed two people so you'll need to order more. We like their brown rice and coconut rice.\n\nOther favorites are the beef mango. Being Indian, we also love the veggie samosas as appetizers that come with a nice sweet and sour sauce and tastes just like you would get at an Indian restaurant. My friend always get the tofu and eggplant that she loves. \n\nThe mango and sticky rice and flaming dessert are great paired with the herbal teas. Remember to order your dessert early because they usually won't take any more dessert orders after 10:30pm or so.\n\nAlmost anything we tried there is good. Although I've been there for the lunch-time specials too, I prefer dinner because of the presentation. The pumpkin curry doesn't come in a pumpkin during lunch...enough said! :)", "rating": 5, "date": "2011-03-09"}, {"excerpts": ["I had the beef mango which was fine and the koh tao noodle which was crazy disappointing. ", "On the koh tao noodle the peanut sauce was really good, but nothing else (noodles, chicken, spinach) had any flavor at all. ", "I threw half of it away. ", "So, of the two noodle dishes I've tried I would not bother eating either of them again. ", "I don't know about you, but I love noodles, so a thai place that doesn't have good noodles is not a thai place that I will frequent. ", "Sad."], "author": "Steffany F.", "review": "I've been here twice and I'm unimpressed. The first time I had the pad thai, which was only ok, and definitely not delicious enough to order a second time. The next time I went I had the beef mango which was fine and the koh tao noodle which was crazy disappointing. On the koh tao noodle the peanut sauce was really good, but nothing else (noodles, chicken, spinach) had any flavor at all. I threw half of it away. So, of the two noodle dishes I've tried I would not bother eating either of them again. I don't know about you, but I love noodles, so a thai place that doesn't have good noodles is not a thai place that I will frequent. Sad.", "rating": 2, "date": "2012-06-29"}, {"excerpts": ["For our entrees, we shared the pumpkin curry, beef mango and jurassic prawn. ", "I REALLY dislike pumpkin and the combination of meat and fruit, but they managed to make it not only edible, but so good I'd order it again. ", "For dessert, we had the coconut panna cotta. ", "It was a tasty and light way to end our meal."], "author": "Adelina W.", "review": "The cocktails were pretty phenomenal. The waitress recommended the Pink Monkey for my friend and I spotted the Lychee-politan so I had to give that a try. Neither of us were disappointed. We started off with the fried calamari. It wasn't the typical fried battered calamari rings, rather small little calamari steaks. Very delicious with the sweet & sour sauce. For our entree, we had each ordered and shared a variety of different rice, coconut, brown and sticky rice. For our entrees, we shared the pumpkin curry, beef mango and jurassic prawn. I REALLY dislike pumpkin and the combination of meat and fruit, but they managed to make it not only edible, but so good I'd order it again. For dessert, we had the coconut panna cotta. It was a tasty and light way to end our meal.", "rating": 4, "date": "2011-04-01"}], "jurassic prawn": [{"excerpts": ["For our entrees, we shared the pumpkin curry, beef mango and jurassic prawn. ", "I REALLY dislike pumpkin and the combination of meat and fruit, but they managed to make it not only edible, but so good I'd order it again. ", "For dessert, we had the coconut panna cotta. ", "It was a tasty and light way to end our meal."], "author": "Adelina W.", "review": "The cocktails were pretty phenomenal. The waitress recommended the Pink Monkey for my friend and I spotted the Lychee-politan so I had to give that a try. Neither of us were disappointed. We started off with the fried calamari. It wasn't the typical fried battered calamari rings, rather small little calamari steaks. Very delicious with the sweet & sour sauce. For our entree, we had each ordered and shared a variety of different rice, coconut, brown and sticky rice. For our entrees, we shared the pumpkin curry, beef mango and jurassic prawn. I REALLY dislike pumpkin and the combination of meat and fruit, but they managed to make it not only edible, but so good I'd order it again. For dessert, we had the coconut panna cotta. It was a tasty and light way to end our meal.", "rating": 4, "date": "2011-04-01"}], "basil gai": [{"excerpts": ["Koh Samui managed to fit the bill, so we trekked the one block to get there, glanced over a well-rounded menu, and ordered the Miracle Duck and Basil Gai for entrees, two sides of rice, and a green tea creme brulee for dessert.\n\n", "The basil gai was even less interesting: a simple stir-fried ground chicken dish that was a bit on the sweet side as well. "], "author": "Johnny W.", "review": "While I generally will avoid sub-4 star restaurants in the Bay (call me a snob, but I've found that even most 4 star restaurants have been mediocre here), it was almost 9pm on a Thursday night, we were without a car, and my friend was hungry, somewhat broke, and also in heels. Koh Samui managed to fit the bill, so we trekked the one block to get there, glanced over a well-rounded menu, and ordered the Miracle Duck and Basil Gai for entrees, two sides of rice, and a green tea creme brulee for dessert.\n\nOverall, everything was just okay, with nothing that stood out. The duck curry had good flavor overall (a bit sweet, with a bit of kick), but the texture of the duck was a bit unusual, and more akin to chicken. The basil gai was even less interesting: a simple stir-fried ground chicken dish that was a bit on the sweet side as well. And the creme brulee was a bit disappointing because the green tea flavor was not noticeable at all. \n\nService was very friendly, while the decor was interesting (very thematic, if any anything, which can sometimes err on the side of being too touristy). Total bill came out to $57 after tax and tip, which was probably a bit more than we were aiming for (they charge $2-3 dollars for a bowl of rice). All in all, not a bad Thai restaurant, but given the other options available to you in the city, there are much, much better places for your money (Ler Ros and Basil Thai, for example).\n\nAs an aside - one will notice that the restaurant is actually up on the second floor. For those in wheelchairs, they have a wheelchair lift near the entrance that you can self-operate to get up there.", "rating": 2, "date": "2012-05-12"}, {"excerpts": ["I started with the fresh spring roll, Basil Gai ground chicken med heat, coconut steamed rice and the traditional Bangkok Pad Thai with chicken.  ", "All topped off with a cold Singha that hit the spot after a long day of learning stuff. \n", "The service was excellent; the atmosphere was elegant yet friendly.  ", "This is the perfect place to take a date.  ", "I have added it to my list of places to return with my wife.  \n", "Good eats"], "author": "JORGE R.", "review": "I was in the Bay Area last week for some work related training and all I could think of was where was I going to eat.  I found Koh Sammui & the Monkey on one of my yelp friends reviews.  The review was well done and my experience matched my expectations.  I thank all of the yelpers for their time and effort in making sure we a good clear picture of a location.\nI love the fact that I can eat a local establishment that most out of town people would never realize even existed.   I started with the fresh spring roll, Basil Gai ground chicken med heat, coconut steamed rice and the traditional Bangkok Pad Thai with chicken.  All topped off with a cold Singha that hit the spot after a long day of learning stuff. \nThe service was excellent; the atmosphere was elegant yet friendly.  This is the perfect place to take a date.  I have added it to my list of places to return with my wife.  \nGood eats", "rating": 4, "date": "2011-11-21"}, {"excerpts": ["Basil Gai"], "author": "Ziyan C.", "review": "Very fancy, slightly overpriced Thai dinner. Good thing is everything is legitimately spicy and the curries are really flavored well.\n\nBags of Gold rice paper sacks of minced chicken and shrimp, tied with banana leaf, fried to a medium crisp $9\n- not super impressive. The filling is overcooked to the point of being rubbery and you dont get to experience the texture of either meat\n\nChiang Mai Style Pork Sausage minced pork, egg, tumeric and ginger $10\n- spicy! the pork is hearty and not overly minced. nice dish, but not incredibly memorable.\n\nFire Cracker seafood Sizzling hot plate of prawns, squid, scallop, crab claw and spicy peanut sauce $18\n- a nice mixture of seafoods, cooked to a good tenderness. \n- spicy but not much else to the flavor (didnt taste the peanut), good but not very memorable\n\nBasil Gai* white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce $12\n- another solid dish, good spiciness to it, not very memorable\n\nMadame Sea Bass* simmered in green curry with green beans, bell pepper, fresh basil and eggplant $16\n- very nice dish, loved the green beans which are the thinner type that you normally only see in asian grocery stores that i grew up with and love\n- eggplant soft, good flavor to the curry (though it was a little thin for my liking)\n\nAromatic Pumpkin Curry* chicken, bell pepper in red curry sauce served in pumpkin $16\n- a really nice dish, great curry, and very impressive looking because it came out in a pumpkin!", "rating": 3, "date": "2011-06-08"}, {"excerpts": ["Basil Gai white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce\n", "Main: ", "Grilled Lamb ", "To Die For marinated lamb, mixed vegetables in white wine & garlic sauce, and sticky rice\nNoodle: ", "Sea Bass Mor Din steamed sea bass sauteed with glass noodle, shitake mushroom, broccoli and carrots\n", "Noodle: "], "author": "Tia N.", "review": "I have eaten authentic Thai food, and this is the best I have ever had. The food is worth every penny! The cocktails are creative and delicious...thanks to Raffy...and the elegant dishes are created by Raffy's brother.\nI had the honor of meeting the owner and her stunning little daughter before dinner. I immediately picked up that she is internationally travelled and educated and has passed all this on to her daughter and businesses.\n\nHere are some dishes we had:\nSalad: Larb Gai minced chicken tossed with lime juice, chili flakes, parched rice and mint. Served in a bell pepper with lettuce on the side\nMain: Basil Gai white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce\nMain: Grilled Lamb To Die For marinated lamb, mixed vegetables in white wine & garlic sauce, and sticky rice\nNoodle: Sea Bass Mor Din steamed sea bass sauteed with glass noodle, shitake mushroom, broccoli and carrots\nNoodle: Kee Mao Scallop pan seared scallops sauteed with basil, red bell peppers, tomatoes and fresh Thai chilies and served over squid ink noodles\nMain: Beef Mango flank beef stir fried with fresh mango, bell pepper, carrot, ginger, black pepper and chili garlic sauce\n\nWe will definitely go there regularly...And as for the wine selection...wow! International and perfect as pairings to the food. Bravo!", "rating": 5, "date": "2011-11-06"}, {"excerpts": ["Tom Kha Gai Soup\nPumkin Curry\nBasil Gai\nBeef Mango\nSpicy Crispy Chicken Fried Rice\n"], "author": "Morena C.", "review": "This is my favorite Thai restaurant in San Francisco.  \n\nI just recently went again after not going for a few years...I was nervous it wouldn't be as good as I remembered.  It was just as good, maybe even better!  \n\nWe did a family dinner and shared a bunch of entrees - each was more delicious than the next.  Everyone must try the Pumpkin Curry - it is an absolute must.  \n\nDishes I highly recommend: \nTom Kha Gai Soup\nPumkin Curry\nBasil Gai\nBeef Mango\nSpicy Crispy Chicken Fried Rice\nCalamari Appetizer\n\nReasons CANNOT give the full 5 Stars: \n- A small bowl of plain white rice is $15....really?!?  (if one person orders, they charge for the whole table, $3/person)\n- We asked how many pieces came per appetizer order...he said he could do a platter so everyone would get one of everything.  In turn we got 3 massive appetizer platters with way too much food at $24 PER platter. \n- Good signature cocktails but the glasses are tiny and the bartenders are slow. \n\nOverall, this is a must try.  I will continue to go because it really is delicious.", "rating": 4, "date": "2011-12-08"}, {"excerpts": ["My hubby had the Basil Gai which he uses as a measure for Thai Restaurants and he found it underwhelming and not worth it. "], "author": "C L.", "review": "I am a fan of Osha so I decided to check this place out when some of the reviewers mentioned that they felt this was better than Osha.  First off, the ambiance of this restaurant is not better than Osha.  The next thing I noticed was that the prices were higher than Osha's. When I see a restaurant charging $16 for a curry, it better be some iron chef curry.\n\nThe food overall was good but not great and memorable.  The crispy imperial rolls and Pumpkin Curry are worth a try. My hubby had the Basil Gai which he uses as a measure for Thai Restaurants and he found it underwhelming and not worth it. The desserts did not seem appetizing enough to try for $10. \n\nFor the quality of the food and the actual ambiance of this restaurant, I think the prices are double what they should be.", "rating": 3, "date": "2010-10-12"}, {"excerpts": ["Highly recommend the Basil Gai.  ", "Delicious!  ", "Will definitely be ordering from them again!"], "author": "Ash S.", "review": "First time I've eaten Koh Samui and the Money's food and they didn't disappoint.  Ordered 4 dishes at 7:32pm and their deliver driver was ringing our doorbell at 7:50pm.  We were absolutely starved so you imagine how giddy we were to be eating so much sooner than we thought.  Highly recommend the Basil Gai.  Delicious!  Will definitely be ordering from them again!", "rating": 5, "date": "2010-11-18"}], "kurkling": [], "jungle curry": [{"excerpts": ["Got the papaya salad, jungle curry, spicy tofu. ", "Watched game 4 of the World Series with excellent seating, great beer, and we still got to scream as loud as we could. ", "This is a got-to-try, change up from all the other bars around the park."], "author": "Ben P.", "review": "Got the papaya salad, jungle curry, spicy tofu. Watched game 4 of the World Series with excellent seating, great beer, and we still got to scream as loud as we could. This is a got-to-try, change up from all the other bars around the park.", "rating": 4, "date": "2012-11-01"}, {"excerpts": ["The bags of gold & jungle curry are my favorite."], "author": "Donna W.", "review": "We like to go & sit in the bar.  We sat in the dining room once.  The food is great & Thai spicy.  It's great.  The happy hour is the best & the drinks & bartenders are wonderful!  The bags of gold & jungle curry are my favorite.", "rating": 4, "date": "2014-02-15"}, {"excerpts": ["Ive had the jungle curry and just last night the beef curry. ", "Both were excellant, just make sure to get rice with the curry. ", "They also have free delivery if the order is over thirty dollers. ", "While I have yet to eat in the restaurant, the interior is very charming, with a popular looking bar."], "author": "Scott C.", "review": "This Thai restaurant has yet to disappoint. Ive had the jungle curry and just last night the beef curry. Both were excellant, just make sure to get rice with the curry. They also have free delivery if the order is over thirty dollers. While I have yet to eat in the restaurant, the interior is very charming, with a popular looking bar.", "rating": 4, "date": "2011-08-03"}, {"excerpts": ["Most recently I ordered the jungle curry for the beef and the savory yellow curry which goes really well with the sticky rice. ", "My meat and potato friends loved the new flavours and their very strong cocktails."], "author": "Phillip T.", "review": "I ain't goin' to lie, I've been here three times in the past four weeks with former coworkers and friends. Curry is my comfort food and I normally order a new curry dish every visit. Most recently I ordered the jungle curry for the beef and the savory yellow curry which goes really well with the sticky rice. My meat and potato friends loved the new flavours and their very strong cocktails.", "rating": 4, "date": "2009-07-20"}], "panang salmon": [], "madame sea bass": [{"excerpts": ["I kinda liked \"Madame Sea Bass\", though it was a bit low on spices.\n\n"], "author": "Tito T.", "review": "Got Tom Kha Gai (soup) here. Tasted weird. We send it back. Waiter later informed us that some ingredients were missing. The rest of the food was ok. I kinda liked \"Madame Sea Bass\", though it was a bit low on spices.\n\nWaiter tried to memorize our order but ended up forgetting our Fried Rice.", "rating": 2, "date": "2015-04-09"}, {"excerpts": ["* white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce $12\n- another solid dish, good spiciness to it, not very memorable\n\nMadame Sea Bass"], "author": "Ziyan C.", "review": "Very fancy, slightly overpriced Thai dinner. Good thing is everything is legitimately spicy and the curries are really flavored well.\n\nBags of Gold rice paper sacks of minced chicken and shrimp, tied with banana leaf, fried to a medium crisp $9\n- not super impressive. The filling is overcooked to the point of being rubbery and you dont get to experience the texture of either meat\n\nChiang Mai Style Pork Sausage minced pork, egg, tumeric and ginger $10\n- spicy! the pork is hearty and not overly minced. nice dish, but not incredibly memorable.\n\nFire Cracker seafood Sizzling hot plate of prawns, squid, scallop, crab claw and spicy peanut sauce $18\n- a nice mixture of seafoods, cooked to a good tenderness. \n- spicy but not much else to the flavor (didnt taste the peanut), good but not very memorable\n\nBasil Gai* white meat ground chicken wok fried with fresh basil, green beans and chili garlic sauce $12\n- another solid dish, good spiciness to it, not very memorable\n\nMadame Sea Bass* simmered in green curry with green beans, bell pepper, fresh basil and eggplant $16\n- very nice dish, loved the green beans which are the thinner type that you normally only see in asian grocery stores that i grew up with and love\n- eggplant soft, good flavor to the curry (though it was a little thin for my liking)\n\nAromatic Pumpkin Curry* chicken, bell pepper in red curry sauce served in pumpkin $16\n- a really nice dish, great curry, and very impressive looking because it came out in a pumpkin!", "rating": 3, "date": "2011-06-08"}, {"excerpts": ["- Madame Sea Bass simmered in green curry with green beans, bell pepper, fresh basil and eggplant -- Apparently this is a house special and a popular choice. ", "I really liked the sea bass. ", "It was well cooked and "], "author": "D S.", "review": "The ambiance is what makes this place a four-star; iIn reality, it's more of a 3-star. I came here with co-workers and then again with my friends and both times (during lunch hours), the place is PACKED. Because the food was expensed on the company, we ordered a crapton of food.\n\nAmbiance: Very decorative- Thai statues, waiters/waitresses are all wearing traditional thai clothing. I'm a clean freak and judge a place based on the restaurants bathroom and Koh Samui fails in this area. So ghetto and ugly... And, it's in the corner of the restaurant. Meh... grosses me out. Besides that minor detail, the place itself is very clean and lots of open windows. \n\nService: Kind of on the slow side. We always have to wait ~15 minutes before anyone comes by to take our orders.\n\nFood: \nAppetizers\n- Fresh Spring Roll w/ shrimp, mint leaves and noodles. They are really fresh but pretty miniature\n- Crispy Imperial Roll stuffed with ground pork, silver noodles and vegetables-- basically your typical eggroll. I'd opt for something else given that they were $9.\n\nMain dishes:\n- Pumpkin Curry Chicken in red curry sauce with basil and bell pepper -- I just like pumpkin in general. I liked how there were big chunks of pumpkin and the sauce wasn't too sweet, which happens sometimes with pumpkin dishes.\n- Madame Sea Bass simmered in green curry with green beans, bell pepper, fresh basil and eggplant -- Apparently this is a house special and a popular choice. I really liked the sea bass. It was well cooked and the green curry with it wasn't overwhelming. \n\n**For spicy food lovers, the spicy level on the menu is a lot lower than I expected.  I was intimidated and ordered the regular spicy level and ended up having to add in more of the pepper sauce (this in the perspective of someone that needs sriracha sauce on virtually all everything hehe)\n\nDessert:\n- Monkey's Mummy (banana topped with flake coconut and orange zest served with coconut ice cream) -- if you have a sweet tooth this is a good choice.\n- Monkey's Mango (sticky rice and mango slices) -- my favvvvv. I loved the fresh mango. Sticky rice was okay too. Less sweet than other thai places.\n- Chocolate cake-- it was pretty damn random that they had CHOCOLATE cake at a thai place... but we ordered it anyway just for the heck of it. it was whatevers.... I'd go with one of the mango desserts than wasting your stomach space on this.\n\nNote: you can ask for brown rice or sticky rice in replace of white. I tried some of this unique sticky rice off of a friend's plate (She went to Thailand for a semester studying abroad) and it was very interesting! I think next time I'm at a Thai place, i'll order it.", "rating": 3, "date": "2011-04-11"}, {"excerpts": ["I recommend the Madame Sea Bass with green curry and the Pumpkin Curry Chicken. "], "author": "Debbie C.", "review": "Who's Koh Samui and where is his monkey? I looked it up on Wikipedia. Duh... turns out Koh Samui is Thailand's third largest island first inhabited about 15 centuries ago, settled by fishermen from Malay Peninsula and Southern China. Apparantly numerous animal attractions are dotted around the island, including a crocodile farm, monkey theatre, elephant trekking, a snake farm, an aquarium and a butterfly garden.  Sounds awesome! \n\nMy friend picked this place for her bday dinner. Comfortable atmosphere and pretty good creative dishes. The six of us went family style and got 6 dishes to share which was the perfect amount of food. I recommend the Madame Sea Bass with green curry and the Pumpkin Curry Chicken. Everything else was decent except the Koh Tao Noodle which was heavy on the peanut sauce light on the noodles and everything else.", "rating": 3, "date": "2008-04-20"}, {"excerpts": ["I had Madame Sea Bass, which is sea bass simmered in green curry with green beans, bell pepper, fresh basil and eggplant, with a side of boiled white rice. ", "Yummy!"], "author": "Raza M.", "review": "The place was packed, yet it wasn't noisy. I was able to have a nice conversation over a lunch interview. The decor was interesting, especially their aquarium, that looked like a bird cage. I food was great, and the quantity was just right. I had Madame Sea Bass, which is sea bass simmered in green curry with green beans, bell pepper, fresh basil and eggplant, with a side of boiled white rice. Yummy!", "rating": 4, "date": "2011-10-26"}, {"excerpts": ["The best dishes I've had are:  Bags of Gold, Mieng Kum, Pumpkin Chicken Curry, Madame Sea Bass, Pad Thai, Penang Beef (YUM!!).\n\n"], "author": "Miriam W.", "review": "I love Koh Samui.  Good vibe, tasty food, fun drinks.\n\nThe best dishes I've had are:  Bags of Gold, Mieng Kum, Pumpkin Chicken Curry, Madame Sea Bass, Pad Thai, Penang Beef (YUM!!).\n\nI've been a little underwhelmed by the specials but consistently pleased by the standard fare.\n\nService is very accommodating - they set a table for us in the extra room when we walked in and they were chock full.\n\nLove the Monkey!!", "rating": 4, "date": "2007-03-12"}, {"excerpts": ["May get prize for most uncomfortable chairs ever (big heavy flat wooden chairs), dinner lighting could be considered romantic\n\nGreat\n- madame sea bass, exceptional (+ the veg and the green curry are great)\n\n"], "author": "xo x.", "review": "May get prize for most uncomfortable chairs ever (big heavy flat wooden chairs), dinner lighting could be considered romantic\n\nGreat\n- madame sea bass, exceptional (+ the veg and the green curry are great)\n\nOk \n- fish cakes\n- larb gai\n- roast duck in red curry\n- singha beer on draft, thai ice tea, melon mojito, red wine\n\nNo go\n- papaya salad\n- chicken and veg\n- chicken satay\n\nTo try \n- po sod (some kind of spring roll)\n\nThe place gets quite busy for lunch, dinner should be ok", "rating": 3, "date": "2007-10-05"}, {"excerpts": ["what we ordered...crispy imperial rolls, grilled bankok bbq chicken and madame sea bass\n\n...", "crispy imperial roll was good and the madame sea bass was exceptional, it's sweetness, spicyness and light curry sauce just morphed into a perfect goodness dish. ", "now you may be wondering why the heck am i rating this a 1 STAR.... ", "well, they served me a precooked dish, if i am paying top dollar for something, you better serve me quality with no monkey trick's.\n", "the bbq chicken was ok but possibly grilled ", "way early in the morning or a leftover the night before. "], "author": "Gors P.", "review": "what we ordered...crispy imperial rolls, grilled bankok bbq chicken and madame sea bass\n\n...the place is uppity and you do see it in your bill. service and presentation was ok. \n\n...crispy imperial roll was good and the madame sea bass was exceptional, it's sweetness, spicyness and light curry sauce just morphed into a perfect goodness dish. now you may be wondering why the heck am i rating this a 1 STAR.... well, they served me a precooked dish, if i am paying top dollar for something, you better serve me quality with no monkey trick's.\nthe bbq chicken was ok but possibly grilled way early in the morning or a leftover the night before. a trick is a trick and i bet that monkey is still inside that kitchen. \n\nahhhhhhh!  i will miss that darn curry dish...", "rating": 1, "date": "2010-12-05"}, {"excerpts": ["I strongly recommend the Madame Sea Bass in green curry.  ", "The service was decent.  ", "Wish they came around sooner a couple times considering we had a baseball game to get to and the restaurant wasn't especially busy at the time."], "author": "Brent P.", "review": "Great dishes.  I strongly recommend the Madame Sea Bass in green curry.  The service was decent.  Wish they came around sooner a couple times considering we had a baseball game to get to and the restaurant wasn't especially busy at the time.", "rating": 3, "date": "2010-08-24"}, {"excerpts": ["Amazing honey roasted duck w/pineapple in red curry sauce, and I can't go there without ordering Madame Sea Bass. ", "Very friendly staff.  ", "Nice atmosphere."], "author": "Em P.", "review": "The best fried rice in the world. Amazing honey roasted duck w/pineapple in red curry sauce, and I can't go there without ordering Madame Sea Bass. Very friendly staff.  Nice atmosphere.", "rating": 5, "date": "2005-06-08"}, {"excerpts": ["My companion had the Madame Sea bass, which I'm assured was decent. ", "We also shared the fish cake appetiser, which was exquisitely presented and tastes delicious. ", "Our server had a \"training\" moniker on her nametag, so I cut her some slack regarding service. ", "I was always told to give 25% tip at nicer restaurants, but my friend informed me that it's only 20% in the US. ", "Odd that, but live and learn, I suppose. ", "One star off for the trainee we were assigned and the amount of fatty meat."], "author": "Hasan D.", "review": "I took a dear friend here tonight for a holiday dinner. I had the waitress-recommended beef steak, which had a tad too much fatty meat. My companion had the Madame Sea bass, which I'm assured was decent. We also shared the fish cake appetiser, which was exquisitely presented and tastes delicious. Our server had a \"training\" moniker on her nametag, so I cut her some slack regarding service. I was always told to give 25% tip at nicer restaurants, but my friend informed me that it's only 20% in the US. Odd that, but live and learn, I suppose. One star off for the trainee we were assigned and the amount of fatty meat.", "rating": 4, "date": "2008-12-18"}, {"excerpts": ["Madame sea bass is madame bliss.  ", "Mieng cum is a rarity in standard Thai restaurants, but was very fresh here.  ", "The salads are flavorful!  ", "Fish cakes and rice are a perfect take out meal, but if you have time do stop in to catch a bit of atmosphere with your Thai meal."], "author": "apple r.", "review": "Best Thai in the city if I do say so myself.  The atmosphere is grand and you can tell they really took care in selecting the decor, down the staff uniforms.  I like the green plates with elephants on them, the buddha, the modern chairs, white tableclothes.  They have a decent wine selection.  I loved the pumpkin curry, which I have seen crop up on other menus, but I think it was a first here.  Madame sea bass is madame bliss.  Mieng cum is a rarity in standard Thai restaurants, but was very fresh here.  The salads are flavorful!  Fish cakes and rice are a perfect take out meal, but if you have time do stop in to catch a bit of atmosphere with your Thai meal.", "rating": 4, "date": "2007-04-22"}, {"excerpts": ["They gained back that lost star when they brought out the madame sea bass, which was so buttery-flaky-delicious that I nearly lost my head. ", "The coconut curry sauce that came with it was to die for; almost tempted to lick it off my plate. ", "However, their pad thai left something to be desired. ", "It was a little dry, lacked flavor, and the beef we ordered in it  was a little chewy and fatty. ", "Their pumpkin chicken curry looked great, and I'd definitely have the madame sea bass again (not to mention the coconut rice!). ", "But if I am looking for pad thai, I'd go elsewhere."], "author": "Erica M.", "review": "Went here last night for the first time. The decor, ambiance, service and cocktail selection (mango mojito, yum!) got a 5 from me right away. It was a late dinner, so it wasn't crowded. However, they lose a star for being confusing with our appetizer. We asked for the chicken satay mieng kum appetizer, which neither of us had before. So when they brought out both a chicken satay appetizer on its own AND the chicken mieng kum, we figured they went together and gobbled both up (delicious, btw, thought I'm not a fan of ginger). However, we got the bill and realized they'd given us two separate appetizers. Too late, we'd already eaten them. They gained back that lost star when they brought out the madame sea bass, which was so buttery-flaky-delicious that I nearly lost my head. The coconut curry sauce that came with it was to die for; almost tempted to lick it off my plate. However, their pad thai left something to be desired. It was a little dry, lacked flavor, and the beef we ordered in it  was a little chewy and fatty. Pad thai is such a go-to dish that it better be made right, but this one definitely lost them 2 stars... \n\nI'd still go back and try other dishes. Their pumpkin chicken curry looked great, and I'd definitely have the madame sea bass again (not to mention the coconut rice!). But if I am looking for pad thai, I'd go elsewhere.", "rating": 3, "date": "2009-01-27"}], "crushed sesame scallops": [{"excerpts": ["Not so good\nMIRACLE DUCK - Not bad\nCrushed Sesame Scallops - Good but "], "author": "Diana Y.", "review": "Thai food--whether it's fancy or not--is all the same to me. I don't really believe in overpaying for thai food but it's a nice place to go with friends. \n\nOrdered a bunch of food for four:\n\nMIENG KUM -- literally bits and pieces that you put on leaves. Not so good\nMIRACLE DUCK - Not bad\nCrushed Sesame Scallops - Good but nothing special\nVolcano Fried Rice - Really flavorful and had a lot of stuff in it to make it delicious\nFire Cracker- delicious, spicy for my taste\n\nOkay, so all my descriptions were the same because that's generally how the food tasted to me. It's good but it's not great, it's filling but it's not memorable. \n\nFriendly and attentive service though.", "rating": 3, "date": "2011-05-05"}, {"excerpts": ["I had the Crushed Sesame Scallops in a yellow curry sauce. ", "It was soooo good. ", "My friend had the vegetarian samosas and the  Tom Kha Gai Soup adjusted to her vegetarian requirements which by the way they were happy to do.  ", "Great art work and a clean bathroom. ", "I can't wait to go back and bring friends! ", "Next time I'll order something from their extensive drink/wine list."], "author": "Amara R.", "review": "Wow! This is an amazing place to eat and take in the SF culture. The staff was great, the food was amazing  and the prices were right on. I had the Crushed Sesame Scallops in a yellow curry sauce. It was soooo good. My friend had the vegetarian samosas and the  Tom Kha Gai Soup adjusted to her vegetarian requirements which by the way they were happy to do.  Great art work and a clean bathroom. I can't wait to go back and bring friends! Next time I'll order something from their extensive drink/wine list.", "rating": 5, "date": "2010-12-29"}, {"excerpts": ["For entrees be sure to try the Asapragus Prawns and Crushed Sesame Scallops with baby bok choy in yellow curry sauce (my favorite dish of the night).  ", "The decor is real nice too and gives this place a cool vibe."], "author": "Julie K.", "review": "First off, Koh Samui needs better service.  We sat around waiting for our waiter and so did the nearby tables.  Second, they never brought a couple of cocktails we ordered.  That aside, their food is pretty good.  Their springs rolls were fresher than expected and the Tom Ka Gai soup gets an A.  For entrees be sure to try the Asapragus Prawns and Crushed Sesame Scallops with baby bok choy in yellow curry sauce (my favorite dish of the night).  The decor is real nice too and gives this place a cool vibe.", "rating": 3, "date": "2007-02-15"}], "honey roasted duck and pineapple": [{"excerpts": ["The honey roasted duck and pineapple simmered in red curry sauce was perfect - very savory and hearty.  ", "It was definitely the big winner at our table and will always be a \"must order\" dish in the future.  ", "The grilled honey duck with steamed spinach was pretty good too, but couldn't top the duck curry.  ", "The grilled sirloin beef served with pineapple salad and Thai spicy sauce was the least popular dish by far.  ", "Can't recommend that dish at all... ", "For the appetizers, I'd go for the fried sweet corn patties again... ", "delicious!  ", "Oh, and LOVE that Koh Samui delivers!!"], "author": "Tara C.", "review": "Service was awesome and the food very, very good... The honey roasted duck and pineapple simmered in red curry sauce was perfect - very savory and hearty.  It was definitely the big winner at our table and will always be a \"must order\" dish in the future.  The grilled honey duck with steamed spinach was pretty good too, but couldn't top the duck curry.  The grilled sirloin beef served with pineapple salad and Thai spicy sauce was the least popular dish by far.  Can't recommend that dish at all... For the appetizers, I'd go for the fried sweet corn patties again... delicious!  Oh, and LOVE that Koh Samui delivers!!", "rating": 4, "date": "2008-12-29"}, {"excerpts": ["And the mieng kum was the only thing that I didnt like-a bit too salty and sweet with a weird texture\n\nHoney roasted duck and pineapple simmered in red curry sauce\n"], "author": "Jane P.", "review": "Came here about a year ago with some friends and remembered liking it. So went back for dinner this week.  Our meal was as follows:\n\nChef's testing platter: Fresh Spring roll, Crispy imperial roll, Prawns, Sweet Corn, Mieng Kum, Chicken satay skewers and Mango Salad\nwith 3 dipping sauces\n*since I like variety, this was a great starter piece...especially liked the crispy imperial roll and prawns. Mango salad was okay. And the mieng kum was the only thing that I didnt like-a bit too salty and sweet with a weird texture\n\nHoney roasted duck and pineapple simmered in red curry sauce\n*highly recommend. not so generous with the duck, but the few pieces they had were appetizing.  The sauce was sweet (gathering it from the pinnaple and tomatoe) and flavorful.\n\npad thai-with tofu and chicken\n(definately skip this, hardly any flavor. barely saved by me adding hot sauce, peppers, and soy sauce)\n\nAnd definately skip the asian beers they have (forget the names...but one from singapore and one from Thailand).", "rating": 3, "date": "2008-12-11"}], "mango catfish": [{"excerpts": ["What I highly recommend: mango catfish curry, duck red curry, crisp pork belly, pumpkin curry, pineapple fried rice,vegetarian samosa, corn fritter, and shrimp papaya salad.\n\n"], "author": "Bailey N.", "review": "Thai food is so ubiquitous in the Bay Area that I don't even consider it exotic food.  Out of all the Thai places frequented, this has to be my default place for a few reasons: close to where I live, fast delivery, and damn good Thai curries.  I order from here about every other week and am not surprised if I've tried just about everything on the menu.  I am sad they've phased out the soft shell crab or wok fried duck meat.\n\nWhat I highly recommend: mango catfish curry, duck red curry, crisp pork belly, pumpkin curry, pineapple fried rice,vegetarian samosa, corn fritter, and shrimp papaya salad.\n\nThe ambiance is nice when I decide to dine in and service is always friendly and accommodating.  Had to knock it down a star because the price has risen over the years and kinda expensive when you could get decent Thai food easily in the City.  But that's SF inflation for you!", "rating": 4, "date": "2015-10-01"}, {"excerpts": ["I really liked the mango catfish dish. ", "Not sure why it's rated this low as I really enjoyed the experience. ", "Was also a pretty large place that didn't seem to be too busy since we had a large group. ", "The shrimp rolls I thought were pretty solid", ", imperials were fine too."], "author": "Victor D.", "review": "Came here for lunch, thought it was great. They had some specials which comes with appetizers like imperial roll or shrimp rolls and then a main dish. I really liked the mango catfish dish. Not sure why it's rated this low as I really enjoyed the experience. Was also a pretty large place that didn't seem to be too busy since we had a large group. The shrimp rolls I thought were pretty solid, imperials were fine too.", "rating": 4, "date": "2016-08-24"}, {"excerpts": ["Between a party of three, we ordered 5 dishes: Shrimp Pad Thai, Pumpkin Curry, Mango Catfish, Crispy Soft Shell Crab and the Grilled Lamb to die for. ", "My favorite dishes were the Pumpkin Curry and the Shrimp Pad Thai. "], "author": "Viennelyn C.", "review": "Ever since I've moved to San Francisco, I have always wanted to have dinner at Koh Samui & The Monkey. This neighborhood gem is located in the SOMA district and has a notorious reputation for having the best Thai food in San Francisco. I'm surprised it is not known as one of the most romantic restaurants in San Francisco. With it's dim lighting and romantic ambiance it definitely fits the description.\n\nBetween a party of three, we ordered 5 dishes: Shrimp Pad Thai, Pumpkin Curry, Mango Catfish, Crispy Soft Shell Crab and the Grilled Lamb to die for. My favorite dishes were the Pumpkin Curry and the Shrimp Pad Thai. You can always tell if a Thai restaurant is amazing by how delicious their Pad Thai dish is!\n\nMy only disappointment was that my Pumpkin Curry came in bowl instead of an actual pumpkin. However, it was a delicious meal nonetheless! If I lived closer to the SOMA district, I would definitely be a frequent diner.", "rating": 4, "date": "2011-12-29"}], "panang beef curry": [{"excerpts": ["We had Mojito, Imperial Rolls, Tom Kha Gai Soup and Panang Beef Curry. "], "author": "Suchismita D.", "review": "A good Thai place but nothing great about it!\n\nThe food and decor were ok. Alongside the waitress, we were also greeted by an old weird lady. We had Mojito, Imperial Rolls, Tom Kha Gai Soup and Panang Beef Curry. As I said earlier, everything was good but nothing great.\n\nI must mention here that they have a super fast and prompt service, so prompt that the server was too keen to take my plate away while I was still working.", "rating": 2, "date": "2016-02-28"}, {"excerpts": ["I ordered the \"Monkey Quick Set\" which comes with 3 fresh rolls and panang beef curry. ", "The 3 fresh rolls were basically 1 regular fresh roll cut into 3 pcs! ", "The beef curry was just gross (sorry, no other words to describe). ", "It was all stringy and the sauce was gloopy and argh nasty! ", "Also, 13$ for lunch is a bit on the high end, especially for thai food."], "author": "Seema M.", "review": "Went for lunch today and was very disappointed. I have been there a couple of times in the past and never had an issue..\n\nI ordered the \"Monkey Quick Set\" which comes with 3 fresh rolls and panang beef curry. The 3 fresh rolls were basically 1 regular fresh roll cut into 3 pcs! The beef curry was just gross (sorry, no other words to describe). It was all stringy and the sauce was gloopy and argh nasty! Also, 13$ for lunch is a bit on the high end, especially for thai food.", "rating": 3, "date": "2010-07-13"}], "emerald curry": [{"excerpts": ["People who think this place is great has never had great thai food before\n\nI ordered the emerald curry and friend got the pumpkin.  "], "author": "Vince L.", "review": "Another one of those...\"i rarely ever give one star\" reviews.  I had high expectations for Koh Samui when i looked at their menu, looked inside, read reviews.  However, after trying this place there are only 3 things that came across my mind.\n\n1. Flavors were not there\n2. EXTREMELY expensive for thai food\n3. People who think this place is great has never had great thai food before\n\nI ordered the emerald curry and friend got the pumpkin.  Both curries came out luke warm, diluted, and shrimps uncooked.\n\nSo the horrible food + being way overpriced = 1 star.  I hate to be one of those people who knock down restaurants because their expensive but this place is an exception.  go anywhere else and you'll get better thai food.\n\nService was good though....", "rating": 1, "date": "2014-01-20"}, {"excerpts": ["Ordered Bags of gold, Clay pot seabass & Emerald Curry. ", "Eerything was very tasty, and the portions were satisfying. ", "I would definitely make another trip to this place."], "author": "John R.", "review": "Not sure why so many people had a problem with this place, then again, it was completely empty so the service couldn't have been bad. \n\nOrdered Bags of gold, Clay pot seabass & Emerald Curry. Eerything was very tasty, and the portions were satisfying. I would definitely make another trip to this place.", "rating": 4, "date": "2013-12-17"}, {"excerpts": ["We ordered the Emerald Curry and the Kee Mao Scallops Noodles. ", "Both were tasty. ", "More surprising was how well the dishes survived the delivery lag.  ", "The scallops were succulent, he shrimp tender, and the temperature was spot on. "], "author": "Rob B.", "review": "We ordered delivery from Koh Samui & The Monkey with little foreknowledge of the restaurant's quality. What a gem! The food was fantastic and he delivery time was reasonable. \n\nWe ordered the Emerald Curry and the Kee Mao Scallops Noodles. Both were tasty. More surprising was how well the dishes survived the delivery lag.  The scallops were succulent, he shrimp tender, and the temperature was spot on. I will eagerly order delivery from KS&TM again. \n\nOh, and order the coconut rice. You won't regret it.", "rating": 5, "date": "2014-11-01"}, {"excerpts": ["I ordered takeout and got the emerald curry and some spring rolls.  ", "I was a little concerned when I went to pick up my order and was greeted by a dingy, depressing decor. ", "I paid my $36, picked up my food and left. "], "author": "Luke K.", "review": "Don't go unless someone has a gun to your head, and even then, make sure the assailant is paying.\n\nIt's hard to know where to start to warrant a 1 star, so I guess I'll go with chronology.\n\nI ordered takeout and got the emerald curry and some spring rolls.  I was a little concerned when I went to pick up my order and was greeted by a dingy, depressing decor. I paid my $36, picked up my food and left. That's a bit pricey for curry and spring rolls, but I took a gamble that it was worth it. \n\nWhen I got home, I found that they had not included rice in the order. Assuming that it was just a mistake, I called them up to get an order prepared. They informed me that rice isn't included with a curry order. What?! That's like ordering a PB&J and being told that you have to order the bread separately.  \n\nSo it's not a $20 curry. It's a $22.50 curry.  Thats right, a $22.50 curry from a restaurant nobody has ever heard of. \n\nSo I decided to take a bite of my spring rolls while I fumed over being bamboozled. Imagine my surprise (note heavy sarcasm) when I bit into iceberg lettuce poorly wrapped in rice paper.  That was $9.\n\nI will give them credit that the curry was actually decent, so if they shaved about $8 off the price, it might be passable.", "rating": 1, "date": "2013-08-17"}, {"excerpts": ["Emerald Curry\nSurprisingly packed a lot of prawns and scallops in that little coconut that was served in. "], "author": "Michelle L.", "review": "Koh Samui & The Monkey is fancier (and pricier) than your average Thai restaurant in the city - and I'm not sure if it's worth it.\n\nI mean, the service is awesome and the food is decent, but for the price you pay, I would much rather eat at regular Thai Restaurants for half the price (even with 30% on Savored.com). Yes, the dishes here are more unique, but eh..\n\nChicken Mieng Kum\nThis Thai snack is full of flavor - chicken, lime, ginger, coconut, peanut, jalapeno, onion all wrapped up with a spinach leave, and topped with some peanut sauce. I would've never imagined to combine all these ingredients together, but they do complement each other very well. I would recommend this to try! \n\nTom Yum Kung Soup\nA little bit too sour for me, but it was okay. Bf really enjoyed this soup, as the prawns inside tasted really fresh! \n\nLarb Gai\nOther than spiciness from the chilies, the chicken was otherwise bland. I felt that it was a little bit too spicy for my taste.. and just underwhelming. Would definitely skip this dish.\n\nKee Mao Pork Sausage\nLimited selection of noodle dishes. This dish was okay, but was a little bit disappointed when it came out because it wasn't the flat rice noodles.. instead it was like squid ink spaghetti.. This dish, too, was a bit too spicy and lacked some flavor of a Kee Mao noodle dish. The pork sausages were okay, but not a fan.\n\nEmerald Curry\nSurprisingly packed a lot of prawns and scallops in that little coconut that was served in. Yes, a little bit too spicy, but it was much more manageable with the sticky rice. \n\nFor two starters, one soup, one noodle, and one entree, it was about $70-80 total. If you were to eat at a regular Thai restaurant, it would've probably costed you $40-50. Luckily, we made reservations through Savored.com, so the meal came out to be $50ish. With gratuity, we walked out the door at about $70. In conclusion, pretty pricey for what it is. Not sure if I'll be returning.. definitely not for a long time.", "rating": 3, "date": "2012-12-15"}, {"excerpts": ["My Emerald Curry ( Keang Keow Wan Talay) was exquisite. ", "I asked for it ", "Thai spicy and didn't get it quite as hot as I wanted it, but it was hot enough and very good.  "], "author": "Geoff W.", "review": "I've been to Thailand many times, love authentic Thai Food. Tend to be leery of the \"California Thai Fusion\" restaurants that have popped up like the Osha chain.  I went here cuz I had a Groupon with two of my friends. Not expecting much... But was blown away. Is it Authentic?  Well it IS very well done Authentic Thai Fusion.  It would hold it's own in Bangkok.  Tofu Meing Kom, very fresh, nice flavorful ginger, only thing missing for me were the diced thai chillies, but I can understand, this is San Francisco and even though we think we are \"hip\" we can't really stand the heat.  My Emerald Curry ( Keang Keow Wan Talay) was exquisite. I asked for it Thai spicy and didn't get it quite as hot as I wanted it, but it was hot enough and very good.  My friends ordered the Sea Bass Clay pot, and a spicy pork Belly dish. All cooked to perfection and very tasty. We had two really nice upscale  glasses of sake and a \"Monkey in Paris\". Hell I would come here for the bar alone.  I will be back, and I will bring friends.\n\nEmmie,  sorry about the celebrity bug, some creatures will do anything to get on camera :)  I didn't see any.  I did eat fried crickets when I was in Thailand, maybe someone in the kitchen got carried away :)", "rating": 5, "date": "2013-01-13"}, {"excerpts": ["Tasty food, great atmosphere, and pleasant service!  Try the Pumpkin Curry Chicken, or the \"Emerald Curry,\" which is a seafood mixture with green curry served in a coconut bowl."], "author": "Corey C.", "review": "Tasty food, great atmosphere, and pleasant service!  Try the Pumpkin Curry Chicken, or the \"Emerald Curry,\" which is a seafood mixture with green curry served in a coconut bowl.", "rating": 5, "date": "2006-11-12"}], "pumpkin curry with prawns": [], "grilled bangkok bbq chicken": [], "srirachar grilled pork": [], "asian beef": [{"excerpts": ["Only bad item was the Asian beef. ", "It came out rarer than rare and not very warm.  ", "I will hold off ordering this dish."], "author": "Stefan N.", "review": "We were table for four we ordered a salad which is a very good size. The service can  be a little bit slow The prices are reasonable. The imperial rolls were very tasty and seem right out of the fryer. Only bad item was the Asian beef. It came out rarer than rare and not very warm.  I will hold off ordering this dish.", "rating": 4, "date": "2017-03-16"}, {"excerpts": ["I tried their Asian Beef and I almost didn't wanna share that with anybody! ", "Also loved their wine selection. ", "Definitely will go back there soon!"], "author": "V S.", "review": "After going to this place for a second time, I must say this place cooks good Thai food! I tried their Asian Beef and I almost didn't wanna share that with anybody! Also loved their wine selection. Definitely will go back there soon!", "rating": 5, "date": "2014-01-05"}, {"excerpts": ["I had the Asian beef which was cooled to order perfectly. ", "It tasted great with the pineapple salad and sticky rice.\n", "My wife ordered the pumpkin curry which was supposed to come in a pumpkin but didn't?! ", "It was also a good curry.\n", "I'm not sure whether everyone enjoyed their dish..."], "author": "Nick L.", "review": "This place was that busy on a Saturday night which is usually not a good sign. We needed a reservation for 9 and they had space so it was a go.\n\nWe got there at various times which didn't bother the restaurant which was nice as some places can get testy on that.\n\nWe ordered our food and the poor service began. The time between bringing out the first plate and the last plate was at least 15 mins. This meant that the first served meals were nearly done whilst the latter served meals were just getting started. \nAs if to add insult to injury they didn't even serve you properly - they just put the dish at one end of the table and you had to pass it down to the correct person?! Odd. Never been to a place like that before.\n\nThe food itself was fairly good IMO. I had the Asian beef which was cooled to order perfectly. It tasted great with the pineapple salad and sticky rice.\nMy wife ordered the pumpkin curry which was supposed to come in a pumpkin but didn't?! It was also a good curry.\nI'm not sure whether everyone enjoyed their dish...the grilled catfish looked good and our friend finished that off impressively.\n\nFor some reason, the wait staff kept dropping things - plates, forks, glasses.", "rating": 3, "date": "2011-10-19"}, {"excerpts": ["For the main course, we ordered the tofu pad thai, asian beef, and the southern kur king (spicy ground chicken). ", "We also ordered the spicy tofu, which NEVER SHOWED UP (and I forgot to check whether they billed us for it, because I had one too many glasses of wine at that point). ", "Anyway, the food that did show up was fantastic. "], "author": "Mansi A.", "review": "I was totally looking forward to checking out this place after I recently purchased a Groupon for it. However, post-dining experience, I have severe mixed emotions about the place!\n\nThe food was fantastic....no denying it. My fav Thai food in SF is probably Osha, but this was hands down delicious. To start with, we ordered the chicken satay, which was slightly overcooked but the flavor was still good. For the main course, we ordered the tofu pad thai, asian beef, and the southern kur king (spicy ground chicken). We also ordered the spicy tofu, which NEVER SHOWED UP (and I forgot to check whether they billed us for it, because I had one too many glasses of wine at that point). Anyway, the food that did show up was fantastic. When they mean spicy, they mean spicy, so beware.\n\nIn terms of ambiance, I was slightly disappointed upon first walking in. The shades were all pulled up, he light was pouring in, and the not-so-attractive scenery of Brannan St. was quite visible. Basically, it was nothing like the pictures on the website, and not why I chose this restaurant. In addition, the AC was cranked on, so it was FREEZING like an ice box (we politely asked them to turn down the air, and they complied). Oh, and this was at around 6pm. However, after the sun finally set, the interior ambiance started to show up in dark wood, dim lighting, and asian decor. It turned out to be very trendy and romantic.\n\nMY MAIN GRIPE: We went here for a birthday occasion, so upon making the dinner reservation via OpenTable.com, I indicated in the notes section that this was a special birthday dinner. Having completely forgotten about that note, I was completely shocked when they brought over a nice little plate of chocolate cake with coconut ice cream and a happy birthday serenade. It was very sweet! The cake was actually delicious (and I normally don't like cake), and the coconut ice cream complimented it quite well. We didn't have to go to our next spot for dessert. HOWEVER, and here it is...I got the bill, and they charged us a whole $9 for the cake!! WTF?? Who does that? First of all, birthday dessert is normally complimentary at restaurants, and when it's not, they specify....not just randomly bring something out to your table and then BILL you for it!? Especially on a tab that was already $80?? NOT COOL. Management needs to get its act together. Two stars for that shadyness.\n\nI'm uncertain whether I'll be back at this point...", "rating": 2, "date": "2010-11-02"}, {"excerpts": ["We had Green Papaya Salad, Corn Fritters, Pumpkin Curry, and the Asian Beef.  ", "All the dishes were seasoned beautifully, and layers of spice and heat kept coming through during the meal.  ", "We are anxious to try the Other Monkey as well."], "author": "John K.", "review": "Solid, well seasoned Thai food in a clean environment.  We arrived  early (6:00), and there were only about  4 other parties at tables.  Our service was very attentive and respectful from both wait and kitchen staff.  We had Green Papaya Salad, Corn Fritters, Pumpkin Curry, and the Asian Beef.  All the dishes were seasoned beautifully, and layers of spice and heat kept coming through during the meal.  We are anxious to try the Other Monkey as well.", "rating": 4, "date": "2010-10-06"}], "grilled lamb to die for": [{"excerpts": ["What I ate: Grilled lamb to die for, Pad thai with shrimp, Fire Cracker, Thai iced tea\nVisit date: November 9, 2011\nFirst time? "], "author": "Erin G.", "review": "What I ate: Grilled lamb to die for, Pad thai with shrimp, Fire Cracker, Thai iced tea\nVisit date: November 9, 2011\nFirst time? Yes.\n\nThe food wasn't bad, it just wasn't that great, especially for the price. First of all, the lamb was definitely not to die for. The lamb was tender (a plus!), but was over seasoned (too salty!). It did, however, come with some nice veggies to cut the salt factor. The pad thai was slightly too al dente for my taste and the flavor wasn't too memorable. The Fire Cracker (mixed seafood, bell, onion, carrot, green bean and spicy peanut sauce) had a great sauce and the seafood was cooked well. This was my dish of choice among the three we tried. The Thai iced tea was too sweet (but that is the case for a lot of places); I simply diluted with water.\n\nOverall, the food was probably at 3 stars, and at a 3-star level I would return to try other dishes, but because of the price tag I have to give this place a 2. The food is definitely not worth how much they charge. As far as coming back to this place... chances are I probably wouldn't unless someone was celebrating a birthday here.", "rating": 2, "date": "2011-11-12"}, {"excerpts": ["Between a party of three, we ordered 5 dishes: Shrimp Pad Thai, Pumpkin Curry, Mango Catfish, Crispy Soft Shell Crab and the Grilled Lamb to die for. ", "My favorite dishes were the Pumpkin Curry and the Shrimp Pad Thai. "], "author": "Viennelyn C.", "review": "Ever since I've moved to San Francisco, I have always wanted to have dinner at Koh Samui & The Monkey. This neighborhood gem is located in the SOMA district and has a notorious reputation for having the best Thai food in San Francisco. I'm surprised it is not known as one of the most romantic restaurants in San Francisco. With it's dim lighting and romantic ambiance it definitely fits the description.\n\nBetween a party of three, we ordered 5 dishes: Shrimp Pad Thai, Pumpkin Curry, Mango Catfish, Crispy Soft Shell Crab and the Grilled Lamb to die for. My favorite dishes were the Pumpkin Curry and the Shrimp Pad Thai. You can always tell if a Thai restaurant is amazing by how delicious their Pad Thai dish is!\n\nMy only disappointment was that my Pumpkin Curry came in bowl instead of an actual pumpkin. However, it was a delicious meal nonetheless! If I lived closer to the SOMA district, I would definitely be a frequent diner.", "rating": 4, "date": "2011-12-29"}], "bangkok pad thai": [{"excerpts": ["I started with the fresh spring roll, Basil Gai ground chicken med heat, coconut steamed rice and the traditional Bangkok Pad Thai with chicken.  ", "All topped off with a cold Singha that hit the spot after a long day of learning stuff. \n", "The service was excellent; the atmosphere was elegant yet friendly.  ", "This is the perfect place to take a date.  ", "I have added it to my list of places to return with my wife.  \n", "Good eats"], "author": "JORGE R.", "review": "I was in the Bay Area last week for some work related training and all I could think of was where was I going to eat.  I found Koh Sammui & the Monkey on one of my yelp friends reviews.  The review was well done and my experience matched my expectations.  I thank all of the yelpers for their time and effort in making sure we a good clear picture of a location.\nI love the fact that I can eat a local establishment that most out of town people would never realize even existed.   I started with the fresh spring roll, Basil Gai ground chicken med heat, coconut steamed rice and the traditional Bangkok Pad Thai with chicken.  All topped off with a cold Singha that hit the spot after a long day of learning stuff. \nThe service was excellent; the atmosphere was elegant yet friendly.  This is the perfect place to take a date.  I have added it to my list of places to return with my wife.  \nGood eats", "rating": 4, "date": "2011-11-21"}, {"excerpts": ["Instead, I got the Bangkok Pad Thai with Beef. "], "author": "Jennifer L.", "review": "I went back today to celebrate my Supervisor's birthday and the food was much better the second time around, though I dared not order the cashew chicken again (maybe two cashews is enough for Mary Kate Olsen, but not me). Instead, I got the Bangkok Pad Thai with Beef. I was given a generous serving of beef (guess beef costs less than cashews nowadays) and the noodles were pretty good, but what stood out above the rest were the Fried Calamari and Crispy Imperial Rolls. I got heartburn afterward from all the grease, but it was worth it, they were delicious.", "rating": 3, "date": "2009-01-20"}, {"excerpts": ["We ordered the panang curry with chicken and their Bangkok pad thai with beef. ", "The beef was a bit  over cooked in the pad thai, and a bit too chewy. ", "The panang curry was really good though. ", "Totally reminded me of the Burmese fish noodle dish, ", "oh no kauswe. ", "It had that same coconut-y milky taste and consistency. ", "I swear could just slather that all over my rice and be happy with just eating curry sauce and rice. ", "It's a nice comfort food feeling. ", "Service was great with very attentive servers. ", "My glass of water was never really empty, so I can't complain about not being hydrated."], "author": "amy y.", "review": "I came here on my lunch break with a friend, and we were slightly intimidated about prices once we walked in to see such hip looking Thai restaurant. Asian Fusion interiors will never cease to intimidate me. Hip decor aside, the food was just okay, but at least the lunch menu was affordable and comparable to other Thai places. We ordered the panang curry with chicken and their Bangkok pad thai with beef. The beef was a bit  over cooked in the pad thai, and a bit too chewy. The panang curry was really good though. Totally reminded me of the Burmese fish noodle dish, oh no kauswe. It had that same coconut-y milky taste and consistency. I swear could just slather that all over my rice and be happy with just eating curry sauce and rice. It's a nice comfort food feeling. Service was great with very attentive servers. My glass of water was never really empty, so I can't complain about not being hydrated.", "rating": 3, "date": "2008-08-16"}], "koh tao noodle": [{"excerpts": ["Everything else was decent except the Koh Tao Noodle which was heavy on the peanut sauce light on the noodles and everything else."], "author": "Debbie C.", "review": "Who's Koh Samui and where is his monkey? I looked it up on Wikipedia. Duh... turns out Koh Samui is Thailand's third largest island first inhabited about 15 centuries ago, settled by fishermen from Malay Peninsula and Southern China. Apparantly numerous animal attractions are dotted around the island, including a crocodile farm, monkey theatre, elephant trekking, a snake farm, an aquarium and a butterfly garden.  Sounds awesome! \n\nMy friend picked this place for her bday dinner. Comfortable atmosphere and pretty good creative dishes. The six of us went family style and got 6 dishes to share which was the perfect amount of food. I recommend the Madame Sea Bass with green curry and the Pumpkin Curry Chicken. Everything else was decent except the Koh Tao Noodle which was heavy on the peanut sauce light on the noodles and everything else.", "rating": 3, "date": "2008-04-20"}, {"excerpts": ["I had the beef mango which was fine and the koh tao noodle which was crazy disappointing. ", "On the koh tao noodle the peanut sauce was really good, but nothing else (noodles, chicken, spinach) had any flavor at all. ", "I threw half of it away. ", "So, of the two noodle dishes I've tried I would not bother eating either of them again. ", "I don't know about you, but I love noodles, so a thai place that doesn't have good noodles is not a thai place that I will frequent. ", "Sad."], "author": "Steffany F.", "review": "I've been here twice and I'm unimpressed. The first time I had the pad thai, which was only ok, and definitely not delicious enough to order a second time. The next time I went I had the beef mango which was fine and the koh tao noodle which was crazy disappointing. On the koh tao noodle the peanut sauce was really good, but nothing else (noodles, chicken, spinach) had any flavor at all. I threw half of it away. So, of the two noodle dishes I've tried I would not bother eating either of them again. I don't know about you, but I love noodles, so a thai place that doesn't have good noodles is not a thai place that I will frequent. Sad.", "rating": 2, "date": "2012-06-29"}], "clay pot": [{"excerpts": ["Ordered Bags of gold, Clay pot seabass & Emerald Curry. ", "Eerything was very tasty, and the portions were satisfying. ", "I would definitely make another trip to this place."], "author": "John R.", "review": "Not sure why so many people had a problem with this place, then again, it was completely empty so the service couldn't have been bad. \n\nOrdered Bags of gold, Clay pot seabass & Emerald Curry. Eerything was very tasty, and the portions were satisfying. I would definitely make another trip to this place.", "rating": 4, "date": "2013-12-17"}, {"excerpts": ["Cons: for the clay pot dish, the sea bass was overdone and dry, yuck! "], "author": "Nancy Z.", "review": "They have a extensive selection and most dishes are done really well. \n\nPros: the pumpkin curry have good flavor, vegetable stir-fry is light and flavorful. \nPad Thai here is one of my favorite in the city. They also have TV by the bar if you want to catch a game.\n\nCons: for the clay pot dish, the sea bass was overdone and dry, yuck! Their food is a bit high, although they do have happy hr at the bar if want to be frugal.\n\nOverall, this is my go-to neighborhood Thai place. Food is consistent, and perfect place for late nights or dessert or if you are craving Thai curry or pad Thai.", "rating": 4, "date": "2013-07-10"}, {"excerpts": ["Ordered the clay pot with sea bass, glass noodles and vegetables in a soy based sauce (needless to say, there was no clay pot). \n\n"], "author": "Ronnie S.", "review": "Got dinner to go from Koh Samui and picked it up when it was ready. Ordered the clay pot with sea bass, glass noodles and vegetables in a soy based sauce (needless to say, there was no clay pot). \n\nThe food was mediocre, but should have been better for the price. The flavor of the noodles was there, but the whole meal just didn't taste very fresh. The noodles were lukewarm and the vegetables soggy, making me feel that the food wasn't cooked to order. The sea bass was the worst part...it was on the bottom of the noodles, not too moist and not much flavor and overall disappointing. \n\nI had come to here in the past and remember the food being alright, so maybe the to go orders are a fluke.", "rating": 2, "date": "2014-06-03"}, {"excerpts": ["We ordered the mango salad, the spicy noodle dish, coconut rice and the sea bass clay pot.\n\n"], "author": "Jessica T.", "review": "I couldn't have enjoyed my meal more here last night.\n\nThe dim lighting was perfect for drawing attention away from our recently self-tan sprayed faces, and low-key hoodies, and sweats. The decor was sophistiacted and classy, and the service was attentive throughout the night.\n\nWe ordered the mango salad, the spicy noodle dish, coconut rice and the sea bass clay pot.\n\nThe mango salad was divine. Fresh shreds of mango, intermixed with dried  coconut, spices, peppers, and prawns.\n\nThe sea bass and spicy noodles kept the quality coming. The sea bass was moist, non-fishy tasting, and was snuggled beautifully amongst string beans, mushrooms, and thin noodles. The portion of fish was impressive considering the price. The spicy noodles were also delicious. There was a plethora of vegetables, and the spiciness and slight grease of the noodles complimented the sweet coconut rice and buttery sea bass perfectly.\n\nI'm definitely keeping this place in mind for future spontaneous dates with my bf in the future.  I'm confident that Koh can wrangle up delectable fresh food and spicy romance with the best of them. And even if you're looking for a fun roomy spot to meet up with a group of friends - Koh has plenty of room to accomodate.", "rating": 4, "date": "2008-04-17"}, {"excerpts": ["My friends ordered the Sea Bass Clay pot, and a spicy pork Belly dish. ", "All cooked to perfection and very tasty. ", "We had two really nice upscale  glasses of sake and a \"Monkey in Paris\". ", "Hell I would come here for the bar alone.  "], "author": "Geoff W.", "review": "I've been to Thailand many times, love authentic Thai Food. Tend to be leery of the \"California Thai Fusion\" restaurants that have popped up like the Osha chain.  I went here cuz I had a Groupon with two of my friends. Not expecting much... But was blown away. Is it Authentic?  Well it IS very well done Authentic Thai Fusion.  It would hold it's own in Bangkok.  Tofu Meing Kom, very fresh, nice flavorful ginger, only thing missing for me were the diced thai chillies, but I can understand, this is San Francisco and even though we think we are \"hip\" we can't really stand the heat.  My Emerald Curry ( Keang Keow Wan Talay) was exquisite. I asked for it Thai spicy and didn't get it quite as hot as I wanted it, but it was hot enough and very good.  My friends ordered the Sea Bass Clay pot, and a spicy pork Belly dish. All cooked to perfection and very tasty. We had two really nice upscale  glasses of sake and a \"Monkey in Paris\". Hell I would come here for the bar alone.  I will be back, and I will bring friends.\n\nEmmie,  sorry about the celebrity bug, some creatures will do anything to get on camera :)  I didn't see any.  I did eat fried crickets when I was in Thailand, maybe someone in the kitchen got carried away :)", "rating": 5, "date": "2013-01-13"}, {"excerpts": ["I had the pumpkin curry with beef and the clay pot glass noodles.  ", "The beef was old and plain bad; while the noodle dish was pretty decent, with a layer of fluffy, creamy sea bass on the bottom.  ", "If I'm back here again, I may try some other dishes since I have heard good things about this place, but the beef curry was a very disappointing dish."], "author": "Josh Q.", "review": "Very average to me, though it is possible I ordered wrongly.  I had the pumpkin curry with beef and the clay pot glass noodles.  The beef was old and plain bad; while the noodle dish was pretty decent, with a layer of fluffy, creamy sea bass on the bottom.  If I'm back here again, I may try some other dishes since I have heard good things about this place, but the beef curry was a very disappointing dish.", "rating": 3, "date": "2015-01-04"}, {"excerpts": ["My wife had the clay pot sea bass. ", "The sea bass was quite \"hard\", as if overcooked, and also smelled quite fishy. ", "Not really fresh. ", "Not a good choice. "], "author": "Heiko L.", "review": "We have been frequent guest at Koh Samui but hadn't been in a few months recently. I was looking forward to going back today but it was somewhat disappointing. \n\nWhen we entered the waiter asked \"Just two?\", which is not such a good start. Once we were seated the waitress was a bit curt, but oh well. They had mixed up the menu quite a bit, which I liked. \n\nWe had the fresh spring roles, pretty good as usual. My wife had the clay pot sea bass. The sea bass was quite \"hard\", as if overcooked, and also smelled quite fishy. Not really fresh. Not a good choice. I had the mango beef, which was fine.\n\nI had also ordered a 2nd drink, which never arrived but was on the bill later. The waitress was only removing it after some discussion.\n\nThe overall impression for us was that the place was slipping, in particular related to the service and the freshness of ingredients. What a pity. It was a nice place in our neighborhood.", "rating": 2, "date": "2013-03-28"}, {"excerpts": ["we tried the beef and chicken satay, corn fritters, green papaya salad,  sea bass clay pot, eggplant and tofu, shrimp pad see ew, pumpkin chicken curry, and stew beef.  ", "everything was good.  ", "i thought i would like the sea bass a lot better ", "but it wasnt as moist as i would have liked.  ", "one of my pieces was all fat.  "], "author": "claudia y.", "review": "i had been here once before and i dont know why i thought it was a more formal place than it really was.  then i learned its name was not just koh samui but koh samui and the monkey and all romantic visions of candle lit white table cloths and formally clad patrons disappeared.  their tables are dressed in white table cloths and they do have candles on them though they are battery operated.  but anyways how formal can thai food be ...\n\nwe came early before my friends bday dinner to have drinks at the bar.  they only had one bartender it seemed and he couldnt get to everyone.  he had to give my bf a free beer for taking so long.  not a bad deal i guess since we were in no rush.  i got a mango margarita which was good.  we also got the bar small plates of shrimp and duck.  these plates are really small.  the duck was missing the cucumber salad as the menu described and came with cabbage on the botttom instead.  the shrimp had a really spicy sauce which made my mouth feel like it was on fire. the bar meny also had noodle bowls that they didnt serve in the restaurant.\n\nwhen we got to our table, our party of ten was stuck between the bathroom, the bar, and the kitchen.  not the best table, not the window view table but it was ok i guess.  our waitress was softspoken.  and i had to ask her twice for my drink.\n\nwe tried the beef and chicken satay, corn fritters, green papaya salad,  sea bass clay pot, eggplant and tofu, shrimp pad see ew, pumpkin chicken curry, and stew beef.  everything was good.  i thought i would like the sea bass a lot better but it wasnt as moist as i would have liked.  one of my pieces was all fat.  yucky.\n\ni dont know if i like osha or kohsamui better.  i think osha gives bigger portions for the same price.  both of their pumpkin chicken curries are $16.", "rating": 3, "date": "2009-01-20"}, {"excerpts": ["My usual selections include the mango or papaya salad (get this mild unless you enjoy having your mouth on fire), sea bass clay pot and pad thai. ", "The food is just as yummy as Osha, and the prices are cheaper than Osha's as well. ", "And who doesn't love a cheap date place?"], "author": "Connie C.", "review": "The story behind the name of this restaurant is really sweet actually. Koh Samui = where the husband and wife owners met. Monkey = the wife was born in the year of the monkey. If my man and I were to open up a restaurant, I guess we'd have to name it Santana Row & the Snake. Hmmm... not sure what kind of food we'd serve there!\n\nAnyways, while dining in is nice in this lovely, dimly lit (makes you look dreamy to your date) Thai restaurant that never has a wait, I love getting take out from here. It only takes about 15 minutes and you can order online!\n\nMy usual selections include the mango or papaya salad (get this mild unless you enjoy having your mouth on fire), sea bass clay pot and pad thai. The food is just as yummy as Osha, and the prices are cheaper than Osha's as well. And who doesn't love a cheap date place?", "rating": 4, "date": "2008-11-21"}, {"excerpts": ["We started with some stuffed mushrooms which hit the spot and then really enjoyed our entrees: a delicious pumpkin chicken curry, a seafood clay pot,  and a spicy grilled salmon dish.  ", "Service was friendly and attentive from start to finish making this is a solid experience, I definitely plan on going back and trying more of the menu .  ", "Oh, and it's SOMA, so parking was quite easy."], "author": "Saminda W.", "review": "eth, my Dad, and I were in the mood for some Thai and checked out Koh Samui & The Monkey in SOMA.  It's a modern, chic Thai restaurant; concrete walls with bright green paint blended with a rich assortment of Thai decorations ranging from large statues of traditional deities to elephants and monkeys .  The food was good, there were plenty of choices but not not an overwhelming amount.  We started with some stuffed mushrooms which hit the spot and then really enjoyed our entrees: a delicious pumpkin chicken curry, a seafood clay pot,  and a spicy grilled salmon dish.  Service was friendly and attentive from start to finish making this is a solid experience, I definitely plan on going back and trying more of the menu .  Oh, and it's SOMA, so parking was quite easy.", "rating": 3, "date": "2009-10-11"}, {"excerpts": ["What I know I ordered was the Sea Bass clay pot. ", "It was so delicious. ", "I still remember how amazing it tasted and how the fish was cooked to divine perfection. ", "Sections of the fish easily separated off and the flavor was magnificent. ", "We also had a duck curry and some other noodle dish that I can't remember. "], "author": "Jessica C.", "review": "I went here a while back for a friend's going away party, and I still remember what I ordered and that it was delicious. That is truly a testament to how good this place really was. Not only that, but they reserved 4 tables for our party of about 40 people. That is a hefty order to fill. This place is cute, it doesn't look huge from the outside, but can seat many. The lighting was that normal dim  and classy thing, thankfully whenever I go to the city I am always dressed for the part.\n\nWe ordered the fresh spring rolls, corn patties, and satay to start and I believe we had the mango salad. What I know I ordered was the Sea Bass clay pot. It was so delicious. I still remember how amazing it tasted and how the fish was cooked to divine perfection. Sections of the fish easily separated off and the flavor was magnificent. We also had a duck curry and some other noodle dish that I can't remember. Those were good too. \n\nI also remember that the men's bathroom was clogged and as we waited for the women's room we were chatting with random patrons who were also waiting for the single stall men's room, and a little appalled that they had to actually wait for a men's room. Because seriously, it is unheard of that men actually have to wait to pee.", "rating": 4, "date": "2008-12-02"}, {"excerpts": ["For entrees, we ordered Southern Curry (chewy beef that had brown sauce slapped on at the last minute - the beef was utterly tasteless and the curry was bland), Sea Bass Clay Pot (bland, and to top it off, the vermicelli tasted like it was processed in an oil tanker), and sticky rice (I kid you not, the bf had to cut his sticky rice with a knife.  ", "Like, sawing motions.  ", "Let's actually cook the food the day of, shall we, instead of using a microwave?)  "], "author": "Doreen S.", "review": "Short version:  SUCKS.  Go to Grand Pu Bah on Berry & Division instead (just 4 long blocks south of this place) - similar prices, better food, better service, similar ambiance.\n\nLong version:\n\nYou know you're in trouble when there's a line out the door to get in, even when two people are behind the counter:  one who is jabbering to a customer, and the other who is ignoring the people waiting to be seated.  5 minutes to have someone seat you - and there were plenty of open tables.\n\nThis place puts emphasis on style/presentation and none on actual food prep.  For entrees, we ordered Southern Curry (chewy beef that had brown sauce slapped on at the last minute - the beef was utterly tasteless and the curry was bland), Sea Bass Clay Pot (bland, and to top it off, the vermicelli tasted like it was processed in an oil tanker), and sticky rice (I kid you not, the bf had to cut his sticky rice with a knife.  Like, sawing motions.  Let's actually cook the food the day of, shall we, instead of using a microwave?)  I will give them this - they'll give you sizeable portions... of inedible food.\n\nNo booze in my Mango Mojito.  I ordered booze with my syrupy sauce, thank you very much.\n\nThe service was awful.  We asked for a second beer and it literally took 10 minutes and 3 (yes, THREE) requests from our server for it to arrive.  Dude was nice, but c'mon.  If your busboys aren't bringing the beer, and your customer has requested it 2x already, why don't you go up to the bar and I don't know, retrieve it and serve your customer?  I know, it's a brilliant idea!  \n\nBottom line - go here if you want to look trendy, and don't care how long you wait for your food/beverage.  Or how your food tastes, for that matter.   Maybe we caught this place on a bad night, but I after reading a few other reviews, I don't know how this place stays open.  Haven't had such a crappy dining experience in a loooooooong time.", "rating": 1, "date": "2009-07-11"}, {"excerpts": ["I had a really yummy sea bass clay pot stir fried with vermicelli noodles and napa cabbage. ", "I was actually pleasantly surprised, having had a so-so experience at its now closed sister restaurant, Citizen Thai and The Monkey. "], "author": "serena l.", "review": "I had a really yummy sea bass clay pot stir fried with vermicelli noodles and napa cabbage. I was actually pleasantly surprised, having had a so-so experience at its now closed sister restaurant, Citizen Thai and The Monkey. The sea bass was extremely tender and flaky, with a perfect buttery flavor.\n\nI'm docking 2 stars bc the fried apps probably could've been better, as chichi thai food, it's pricier than it should be, and I'm taking into account my food at the sister restaurant which was subpar.", "rating": 3, "date": "2008-06-30"}, {"excerpts": ["Their seafood clay pot was one of the highlights of one of my visits - huge, almost overflowing, and filled with lots of different types of fish and crustaceans."], "author": "kimberly l.", "review": "(Edited to reflect terrible experience.) - I used to really love this place, but the last time I went, they took nearly twenty minutes to tell me they were out of my noodles, and then they gave me the wrong dish. Just as I was about to chomp down on that, they whisked the dish away and gave me the correct dish ten minutes later. I was given a free Thai iced coffee, which would have been great except for the fact that I DON'T DRINK coffee. The dish I had was also way over-salted, so much so that I could barely choke it down.\n\nExpensive for Thai food.  On the other hand, I love the decor, and the waiters' uniforms.  The food in general is good, but not amazing.  I love the imperial rolls, and their noodle soups are excellent.  Their seafood clay pot was one of the highlights of one of my visits - huge, almost overflowing, and filled with lots of different types of fish and crustaceans.", "rating": 2, "date": "2006-06-11"}, {"excerpts": ["We also had the sea bass clay pot (delicious), the pumpkin curry (good, but too sweet and, while the pumpkin as a bowl is indeed a pretty presentation, the actual amount of chicken and pumpkin was exceedingly skimpy), and the grilled pork (really good).  \n\n"], "author": "a t.", "review": "Usually in SF restaurants, you're in and out so quickly, you tend to forget what you ate.  At Koh Samui, it's almost the same thing, except in this case, it takes so long to order and then get your food, you may forget what you ordered or what you just ate.  The industrial space is beautifully decorated, sort of a Thai restaurant with a SOMA-loft flavor. The hostess definitely did not seem to grasp the concept of multi-tasking.  She was on the phone, apparently taking a (really looong) phone order or reservation, and she couldn't be bothered to look up to acknowledge our existence (nor the 2 other parties that showed up in the next 5 minutes). \n\nThe food was good, but as someone else said, a bit on the sweet side.  The MIENG KUM appetizer was good, but it wasn't well explained on the menu, and it was so loud in the restaurant, we could barely understand the server's explanation of the dish.  It was spinach leaves covered with the described ingredients  (dried coconut, lime, etc.); it felt more like a dessert (due to the coconut) than an appetizer.  We also had the sea bass clay pot (delicious), the pumpkin curry (good, but too sweet and, while the pumpkin as a bowl is indeed a pretty presentation, the actual amount of chicken and pumpkin was exceedingly skimpy), and the grilled pork (really good).  \n\nKoh Samui is definitely a cool restaurant with pretty good Thai food.  As long as you go there wit the expectation of a slow dining experience, you should have a good time.", "rating": 3, "date": "2008-09-04"}, {"excerpts": ["The seabass clay pot was disappointing.  ", "The extra stuff in the dish had more taste than the sea bass.  ", "Plus, I bit into a chunk of sand.  ", "This is kind of gross, but later that night before I brushed my teeth, a chunk of the sand dislodged from my teeth and my boy friend ", "looked at me in horror and thought I was eating a tooth filling.  ", "Needless to say I had nightmares abt the fillings in my teeth falling out and having no teeth  ", ":P"], "author": "Karena L.", "review": "Drinks are strong and tasty, but our waitress took mine away before I was finished... granted there was only a couple sips left, but when the drink is only abt 10 sips in the first place... couple sips can make a difference.. ok. maybe not :P   \nANYWAYS... the place was only half full, but it was really loud for the number of people there, I can't imagine the noise level when the place is full.They also filled the WHOLE place with tables.  It was like a maze trying to get to our table.  I have no idea how people would get by if the chairs actually had people in them.  \nThe food ... the eggplant and tofu was tasty but seemed to lacking in quantity.  The seabass clay pot was disappointing.  The extra stuff in the dish had more taste than the sea bass.  Plus, I bit into a chunk of sand.  This is kind of gross, but later that night before I brushed my teeth, a chunk of the sand dislodged from my teeth and my boy friend looked at me in horror and thought I was eating a tooth filling.  Needless to say I had nightmares abt the fillings in my teeth falling out and having no teeth  :P", "rating": 2, "date": "2009-03-06"}, {"excerpts": ["The clay pot is delicious! "], "author": "Foodie F.", "review": "Great value in a hip and elegant dining room. I took a date there after an event and we were pleased with the beautiful interior. Service was friendly but inattentive. One of our appetizers we had to special order with the coconut shavings put off to the side due to an allergy, and when the dish arrived it had coconut all over the plate. The server graciously took the plate and we ordered fried calamari with sweet and sour sauce instead. Much better choice. The clay pot is delicious! Give it a try.\n\nAffordable Thai food in a beautiful atmosphere. Great place for a date.", "rating": 3, "date": "2007-08-26"}, {"excerpts": ["Main course we had pumpkin curry, fried soft shell crab, sea bass in a clay pot and their special for the night fried scallops. ", "The pumpkin curry was fantastic. ", "Nice flavor, texture and presentation. ", "It comes in a small little pumpkin. ", "The fried soft shell crab was good but nothing out of the ordinary. ", "It came with some kind of tangy, spicy sauce that was delicious. ", "The fried scallops were ok ", "but I ate more of the fried breading than scallops. ", "Try to stay away from their sea bass in a clay pot dish. ", "The noodles and flavor were pretty good ", "but we only got 3 pieces of sea bass in the whole dish. ", "Stick to some authentic chinese restaurants for good clay pot dishes and avoid this one at all costs. \n\n"], "author": "Ken W.", "review": "Came here to have dinner and the place was constantly buzzing. It's not the biggest restaurant holding maybe 60 people. There were about 3 groups of at least ten people so there was a lot of chatter. Seems like a great place for a group party. They have a bar area with 2 big screen tvs. \n\nStarted with the stuffed mushrooms with peanut sauce. It's fried so it's pretty hard to mess up. There's a lot more meatball inside than mushroom which was fine with me. The peanut sauce was pretty good.  Main course we had pumpkin curry, fried soft shell crab, sea bass in a clay pot and their special for the night fried scallops. The pumpkin curry was fantastic. Nice flavor, texture and presentation. It comes in a small little pumpkin. The fried soft shell crab was good but nothing out of the ordinary. It came with some kind of tangy, spicy sauce that was delicious. The fried scallops were ok but I ate more of the fried breading than scallops. Try to stay away from their sea bass in a clay pot dish. The noodles and flavor were pretty good but we only got 3 pieces of sea bass in the whole dish. Stick to some authentic chinese restaurants for good clay pot dishes and avoid this one at all costs. \n\nThe restaurant had a plethora of exotic cocktails that looked pretty good. They had a few beers on tap and a nice wine selection too. Definitely a fun place to go, have some drinks and eat some good thai food. You will have to talk pretty loudly since the whole restaurant is pretty loud.  The service was fantastic. I'm basing my review completely on the food but I would give this place a 4 star rating for the entire experience. The curry is definitely a safe bet.", "rating": 3, "date": "2009-05-11"}, {"excerpts": ["Curries, noodle dishes, clay pot dishes and lots of appetizers.  ", "All of our food was very good.  ", "We had yellow curry chicken, sea bass in clay pot, and beef pad thai.  ", "We also ordered a nice bottle of cabernet savignon with our meal, which was very nice.  ", "The service was good...", "it was funny though ", "b/c we went on Thai new year, so the cooks were apparently throwing buckets of water on each other and our waitress went to every table to explain all the uproar from the kitchen.  ", "We thought it was cool...", "we didn't even know that Thailand had a separate new year let alone had the tradition of dousing one another with water.  ", "Overall a really good dining experience.  ", "We all agreed that we would return to try other tasty dishes on the menu."], "author": "Kristina D.", "review": "Came here for a late Saturday dinner with a couple of my friends.  We were craving something tasty and ethnic.  The decor of the restaurant is pretty modern and also has nice ethnic Thai touches.  The ambiance is upscale but casual.  We really liked the atmosphere.  \n\nWe had some tasty cocktails and then were seated a nice table next to the window.  There is a good drink menu and a decent wine list.  The menu has a wide variety of dishes.  Curries, noodle dishes, clay pot dishes and lots of appetizers.  All of our food was very good.  We had yellow curry chicken, sea bass in clay pot, and beef pad thai.  We also ordered a nice bottle of cabernet savignon with our meal, which was very nice.  The service was good...it was funny though b/c we went on Thai new year, so the cooks were apparently throwing buckets of water on each other and our waitress went to every table to explain all the uproar from the kitchen.  We thought it was cool...we didn't even know that Thailand had a separate new year let alone had the tradition of dousing one another with water.  Overall a really good dining experience.  We all agreed that we would return to try other tasty dishes on the menu.", "rating": 4, "date": "2008-04-18"}, {"excerpts": ["Crying tiger salad grilled sirloin beef mixed with lime juice, Thai herbs, chili flakes and red onion; Crispy soft shell crab with garlic and pepper served with cucumber vinaigrette; Sea bass clay pot sautéed assorted sea bass with mixed vegetables ", "(Sea Bass Mordin); Spicy sirloin beef with vegetables in green curry sauce.  ", "Our guests loved the dishes and enjoyed every course."], "author": "Lyn D.", "review": "I've been a long time regular customer of Citizen Thai and The Monkey (on Grant Ave at Vallejo St) but when they closed down I began dining at their sister restaurant - Koh Samui and the Monkey.  Every year I'd always throw a large dinner party at their restaurant.  This year, my husband (now) and I had our engagement party here and they were able to accomodate 32 people on a Thursday evening.  The menu is exceptional and really captures the authenticity of Thai cuisine!  Raffy the manager is awesome - he is very accomodating and very easy to talk to when it comes to customizing a pre fixe menu.  The staff is prompt and service is superb.  Dishes to die for:  Bag of gold minced chicken, shrimps wrapped in rice paper sacks; Prawns wrapped in crispy rice paper 8; Crying tiger salad grilled sirloin beef mixed with lime juice, Thai herbs, chili flakes and red onion; Crispy soft shell crab with garlic and pepper served with cucumber vinaigrette; Sea bass clay pot sautéed assorted sea bass with mixed vegetables (Sea Bass Mordin); Spicy sirloin beef with vegetables in green curry sauce.  Our guests loved the dishes and enjoyed every course.", "rating": 5, "date": "2008-09-14"}], "stir fried asparagus": [], "wok sauteed mushrooms": [], "basil eggplant": [{"excerpts": ["Whn we finally got our food, Entree's portion size was ridiculously small for Basil eggplant and , specially when charging for regular steamed rice $2.50. ", "None the less when the meal finished, the server didn't even bother to ask if we wanted dessert. \n", "My money will be better spent somewhere else."], "author": "N Z.", "review": "2 of us went for dinner; ambiance was great. The start of the service was good. We got water within 2 minutes, and server came to take order within 5 minutes. After we ordered, we had our appetizer (Chicken Mieng Kum) within 8-10 minutes; 5 pieces of spinach leaves with little to no chicken, was ridiculously pricey. After that we waited 50 minutes to get our entree; we saw other tables where people came and sat after us get their entree and finish their food, before we got ours. Whn we finally got our food, Entree's portion size was ridiculously small for Basil eggplant and , specially when charging for regular steamed rice $2.50. None the less when the meal finished, the server didn't even bother to ask if we wanted dessert. \nMy money will be better spent somewhere else.", "rating": 1, "date": "2013-03-11"}, {"excerpts": ["I've had the veggie fresh spring rolls, tofu pad thai, basil eggplant and a few other items. ", "Love their peanut sauce!\n", "1 star removed for service - as other reviews have pointed out, it is decidedly slower and less attentive even when they are not too busy. ", "I don't want a waiter hovering over me, but it would be nice if they would glance at you when they pass by or come by ask if you need anything ", "- I had to wave and signal for a few minutes before any passing waiter responded!"], "author": "What's in a nam e.", "review": "I like this place - pretty good Thai food and usually has seating available, especially via OpenTable. I found dinner-time reservations on New Year's Eve a few hours before, and while some may think that's a sign of a lame place, this place was actually quite busy. It just has more seating than many SF restaurants. So... that's a plus. It's also close to Caltrain, and to many SOMA locations if you have post-dinner plans.\nI've had the veggie fresh spring rolls, tofu pad thai, basil eggplant and a few other items. Love their peanut sauce!\n1 star removed for service - as other reviews have pointed out, it is decidedly slower and less attentive even when they are not too busy. I don't want a waiter hovering over me, but it would be nice if they would glance at you when they pass by or come by ask if you need anything - I had to wave and signal for a few minutes before any passing waiter responded!", "rating": 4, "date": "2015-01-02"}], "stir fried baby bok choy": [], "stir fried green beans": [], "stir fried chinese broccoli": [], "stir fried cabbage": [], "stir fried iceberg lettuce": [], "chicken mieng kum": [{"excerpts": ["For starters we ordered the pork spare ribs, fried sweet corn fritters, chicken mieng kum and a cup of tom yum kung soup.  ", "Everything was served hot which was nice, except the mieng kum which is a cold dish. ", "The pork spare ribs ( 4-5 avg sized ribs) had a little kick to them, luckily our daughter still ate it with her side of steamed rice. ", "She's 4 1/2 years old. ", "The corn fritters ( 6 pieces)  had a crisp to them on the outside and then soft on the inside which I did not expect. ", "Not bad, but different. ", "The mieng kum ( 6 spinach leave sizes)  was new for us and that tasted really good and refreshing. ", "The server instructed us on how to eat it and pretty yummy. ", "Lastly the cup of tom yum kung soup came and 3 prawns were included in it. "], "author": "Carolyn S.", "review": "We made same day reservations for a Saturday night at 5:15pm Because this area is near the ballpark, metered parking on a Saturday night until 10pm!!!! Ok back to my review. For starters we ordered the pork spare ribs, fried sweet corn fritters, chicken mieng kum and a cup of tom yum kung soup.  Everything was served hot which was nice, except the mieng kum which is a cold dish. The pork spare ribs ( 4-5 avg sized ribs) had a little kick to them, luckily our daughter still ate it with her side of steamed rice. She's 4 1/2 years old. The corn fritters ( 6 pieces)  had a crisp to them on the outside and then soft on the inside which I did not expect. Not bad, but different. The mieng kum ( 6 spinach leave sizes)  was new for us and that tasted really good and refreshing. The server instructed us on how to eat it and pretty yummy. Lastly the cup of tom yum kung soup came and 3 prawns were included in it. Very flavorful. \n\nBy this time we were pretty content. Although we still had 2 dishes coming. We had the shrimp pad thai and the Sri Ra Char Grilled Pork. The Pad Thai had was served with maybe 6 pieces of shrimp or more which was nice, although the noodles seemed a bit undercooked or stiff. Not as soft and lacked the kick I usually taste..maybe it could have used a little more fish sauce or rice vinegar? I'm not sure..but something... and the Grilled Pork was plentiful but it seemed more like it was panned fried vs. grilled? It came with sticky rice and some pickled cucumbers w/ mangos on the side which was a nice touch. \n\nWould we come back, maybe...although it was pricey although we did order a lot for just 2 1/2 people.  Service I would say was pretty good. Everything came out hot and fresh. You might think service may be slow, but it was fine for us... It enabled us to enjoy our dishes and digest and be ready for the next dish. \n\nBefore I forget..one thing I did notice was that the chairs you sit on are very heavy so if you have a child, I don't think you have to worry about your chair tipping over. LOL", "rating": 4, "date": "2014-02-24"}, {"excerpts": ["eh..\n\nChicken Mieng Kum\n"], "author": "Michelle L.", "review": "Koh Samui & The Monkey is fancier (and pricier) than your average Thai restaurant in the city - and I'm not sure if it's worth it.\n\nI mean, the service is awesome and the food is decent, but for the price you pay, I would much rather eat at regular Thai Restaurants for half the price (even with 30% on Savored.com). Yes, the dishes here are more unique, but eh..\n\nChicken Mieng Kum\nThis Thai snack is full of flavor - chicken, lime, ginger, coconut, peanut, jalapeno, onion all wrapped up with a spinach leave, and topped with some peanut sauce. I would've never imagined to combine all these ingredients together, but they do complement each other very well. I would recommend this to try! \n\nTom Yum Kung Soup\nA little bit too sour for me, but it was okay. Bf really enjoyed this soup, as the prawns inside tasted really fresh! \n\nLarb Gai\nOther than spiciness from the chilies, the chicken was otherwise bland. I felt that it was a little bit too spicy for my taste.. and just underwhelming. Would definitely skip this dish.\n\nKee Mao Pork Sausage\nLimited selection of noodle dishes. This dish was okay, but was a little bit disappointed when it came out because it wasn't the flat rice noodles.. instead it was like squid ink spaghetti.. This dish, too, was a bit too spicy and lacked some flavor of a Kee Mao noodle dish. The pork sausages were okay, but not a fan.\n\nEmerald Curry\nSurprisingly packed a lot of prawns and scallops in that little coconut that was served in. Yes, a little bit too spicy, but it was much more manageable with the sticky rice. \n\nFor two starters, one soup, one noodle, and one entree, it was about $70-80 total. If you were to eat at a regular Thai restaurant, it would've probably costed you $40-50. Luckily, we made reservations through Savored.com, so the meal came out to be $50ish. With gratuity, we walked out the door at about $70. In conclusion, pretty pricey for what it is. Not sure if I'll be returning.. definitely not for a long time.", "rating": 3, "date": "2012-12-15"}, {"excerpts": ["After we ordered, we had our appetizer (Chicken Mieng Kum) within 8-10 minutes; 5 pieces of spinach leaves with little to no chicken, was ridiculously pricey. ", "After that we waited 50 minutes to get our entree; we saw other tables where people came and sat after us get their entree and finish their food, before we got ours. "], "author": "N Z.", "review": "2 of us went for dinner; ambiance was great. The start of the service was good. We got water within 2 minutes, and server came to take order within 5 minutes. After we ordered, we had our appetizer (Chicken Mieng Kum) within 8-10 minutes; 5 pieces of spinach leaves with little to no chicken, was ridiculously pricey. After that we waited 50 minutes to get our entree; we saw other tables where people came and sat after us get their entree and finish their food, before we got ours. Whn we finally got our food, Entree's portion size was ridiculously small for Basil eggplant and , specially when charging for regular steamed rice $2.50. None the less when the meal finished, the server didn't even bother to ask if we wanted dessert. \nMy money will be better spent somewhere else.", "rating": 1, "date": "2013-03-11"}, {"excerpts": ["One bite into the over-hyped/overrated Chicken Mieng Kum appetizer (spinach leaves topped with a sprinkle of peanuts) before our food + laps were doused with the lovely orange-tinted Thai ice tea knocked over by our waiter...\n", "now I'm not one to cry over spilled milk, but you would think you'd get hooked up with a refill, or at least not get charged for your last drink as it continues to seep through your pants?! ", "Ah monkey, you've failed me."], "author": "Mahsa K.", "review": "My close friends would tell you that I'm  so laid-back I'm practically horizontal-- but even I had a \"dude, seriously?\" moment here...\nOne bite into the over-hyped/overrated Chicken Mieng Kum appetizer (spinach leaves topped with a sprinkle of peanuts) before our food + laps were doused with the lovely orange-tinted Thai ice tea knocked over by our waiter...\nnow I'm not one to cry over spilled milk, but you would think you'd get hooked up with a refill, or at least not get charged for your last drink as it continues to seep through your pants?! Ah monkey, you've failed me.", "rating": 2, "date": "2011-03-22"}, {"excerpts": ["The Chicken Mieng Kum is officially my FAVORITE Thai appetizer!  ", "So much flavor from such a simple and beautiful dish!  ", "A tiny piece of chicken, ginger, toasted coconut, a lime (with rind) and some peanut sauce atop a basil leaf is HEAVENLY!  ", "The flavors explode in your mouth and makes for the perfect appetizer!  "], "author": "Jennifer L.", "review": "I wouldn't say that this place is the BEST Thai Restaurant in the City, but I will say that it's the PRETTIEST, NICEST and CLEANEST Thai Restaurant in the City.  Oh, and the service is pretty on point, too...\n\nTheir drink menu is pretty good...sake, beer, cocktails...makes for an awesome happy hour spot.  I had a Mango Mojito and it had a cute little monkey hanging from it...it soon ventured into our interesting Sake Carafe...sneaky lil' monkey!\n\nThe Chicken Mieng Kum is officially my FAVORITE Thai appetizer!  So much flavor from such a simple and beautiful dish!  A tiny piece of chicken, ginger, toasted coconut, a lime (with rind) and some peanut sauce atop a basil leaf is HEAVENLY!  The flavors explode in your mouth and makes for the perfect appetizer!  Light, tasty and healthy!    \n\nSadly, the heavenly goodness stops at the CMK.  Everything else was good, but didn't set itself apart from other Thai restaurants.  The Mango Beef was spicy, the Crispy Tofu had good flavor, but I wasn't \"wowed\".  \n\nI'll definitely come back for the beautiful ambiance, monkey cocktails and of course, the Mieng Kum.", "rating": 3, "date": "2010-07-12"}, {"excerpts": ["She said it was the Tofu Mieng Kum, but we order the Chicken Mieng Kum and kindly apologized "], "author": "Mimi P.", "review": "3.5 stars is what I would like to give this place.\n\nI came here over the weekend for a friend's birthday dinner. Nice ambience, full bar and good location.\n\nOur waitress was a pretty gal but she seems like she's either new or just not very good at her job.  She didn't know the items on the menu very well and had us pointed our orders to her from the menu.  \n\nThe drinks came out swiftly and we're tasty, also, they had different beers to try from.  I would suggest the Mango Mojito. \n\nThe appetizers arrived shortly and there was one dish we couldn't tell what it was, therefore we verified with our waitress.  She said it was the Tofu Mieng Kum, but we order the Chicken Mieng Kum and kindly apologized and we weren't upset seeing how everyone makes mistake.\n\nAfter another ten minutes our entrees arrived and the server set down the Curry Sea Bass dish, we all asked each other who's this dish is for and realized none of us ordered it.  We, then again, had to asked our waitress over and turns out she gotten my ordered wrong, I ordered the Sea Bass Mor Din and not the Curry Sea Bass. While all my friends enjoyed their dinner, I sat there and waited nibbling from their dishes. Finally, my dish arrived after everyone was practically done.  Although, our waitress did give us a round of free shots to compensate her mistakes but there were several other mistakes here and there.\n\nI enjoyed their Jasmine Creme Brulee the most out of everything.\n\nLast, but not least, I noticed that when the server brought out my bowl of rice her thumb was deep into the bowl =T", "rating": 3, "date": "2011-04-07"}, {"excerpts": ["We had the Chicken Mieng Kum, the Garlic Pepper Shrimp, and the Golden Triangle. \n\n"], "author": "Jess W.", "review": "At first glance, you'd think it'd be a pretty expensive restaurant given the dark lighting and the decorations. But it's pretty decent and the food portions were a bit small but good. We had the Chicken Mieng Kum, the Garlic Pepper Shrimp, and the Golden Triangle. \n\nThe Mieng Kum was an interesting appetizer with many flavors to savor. The ginger was a bit strong and the lime had a kick to it, but the sauce was perfectly balanced. The Garlic Pepper Shrimp was pretty standard, nothing too special about it, but at least it tasted good. As for dessert, we wanted to try the more unique dessert and went for the Golden Triangle. It was a strange dish, the egg yolk spun cocoon thing had a good texture and yet it tasted like Filipino nan bread. Then, it had these little fruit-looking things, but it was mung bean filling with a gelatin covering to look like cherries and other fruits. Interesting, but not a standout.\n\nOverall, pretty good Thai food, service was pretty quick and efficient, and the ambiance was subtle. We went on a Wednesday, which seemed like a slow day since there weren't many people. Still, a good choice for decent Thai in SF.", "rating": 4, "date": "2008-12-17"}, {"excerpts": ["The Chicken Mieng Kum is now my official favourite appetizer of any cuisine. ", "We had the sea bass in ginger sauce special and it was divine, a bit like really tender lobster with a mild slightly sweet and slightly spicy ginger sauce. ", "The bar looked well stocked "], "author": "Dave B.", "review": "We were visiting from Vancouver and staying in the neighborhood so thought we'd try this San Francisco Thai restaurant to compare to those back.  A really good idea as it turns out, as Koh Samui is one of the best Thai restaurants we've had the pleasure to visit.  The Chicken Mieng Kum is now my official favourite appetizer of any cuisine. We had the sea bass in ginger sauce special and it was divine, a bit like really tender lobster with a mild slightly sweet and slightly spicy ginger sauce. The bar looked well stocked but we stuck to a local wine.\n\nThe service was friendly and efficient, the crowd was young, the music was trendy lounge, the atmosphere was relaxed and jovial, the decor was contemporary without being overdone, and it's easy to get to.", "rating": 4, "date": "2010-09-24"}, {"excerpts": ["the chicken mieng kum", ", we figured they went together and gobbled both up (delicious, btw, thought I'm not a fan of ginger). ", "However, we got the bill and realized they'd given us two separate appetizers. ", "Too late, we'd already eaten them. "], "author": "Erica M.", "review": "Went here last night for the first time. The decor, ambiance, service and cocktail selection (mango mojito, yum!) got a 5 from me right away. It was a late dinner, so it wasn't crowded. However, they lose a star for being confusing with our appetizer. We asked for the chicken satay mieng kum appetizer, which neither of us had before. So when they brought out both a chicken satay appetizer on its own AND the chicken mieng kum, we figured they went together and gobbled both up (delicious, btw, thought I'm not a fan of ginger). However, we got the bill and realized they'd given us two separate appetizers. Too late, we'd already eaten them. They gained back that lost star when they brought out the madame sea bass, which was so buttery-flaky-delicious that I nearly lost my head. The coconut curry sauce that came with it was to die for; almost tempted to lick it off my plate. However, their pad thai left something to be desired. It was a little dry, lacked flavor, and the beef we ordered in it  was a little chewy and fatty. Pad thai is such a go-to dish that it better be made right, but this one definitely lost them 2 stars... \n\nI'd still go back and try other dishes. Their pumpkin chicken curry looked great, and I'd definitely have the madame sea bass again (not to mention the coconut rice!). But if I am looking for pad thai, I'd go elsewhere.", "rating": 3, "date": "2009-01-27"}], "tofu mieng kum": [{"excerpts": ["She said it was the Tofu Mieng Kum, but we order the Chicken Mieng Kum and kindly apologized "], "author": "Mimi P.", "review": "3.5 stars is what I would like to give this place.\n\nI came here over the weekend for a friend's birthday dinner. Nice ambience, full bar and good location.\n\nOur waitress was a pretty gal but she seems like she's either new or just not very good at her job.  She didn't know the items on the menu very well and had us pointed our orders to her from the menu.  \n\nThe drinks came out swiftly and we're tasty, also, they had different beers to try from.  I would suggest the Mango Mojito. \n\nThe appetizers arrived shortly and there was one dish we couldn't tell what it was, therefore we verified with our waitress.  She said it was the Tofu Mieng Kum, but we order the Chicken Mieng Kum and kindly apologized and we weren't upset seeing how everyone makes mistake.\n\nAfter another ten minutes our entrees arrived and the server set down the Curry Sea Bass dish, we all asked each other who's this dish is for and realized none of us ordered it.  We, then again, had to asked our waitress over and turns out she gotten my ordered wrong, I ordered the Sea Bass Mor Din and not the Curry Sea Bass. While all my friends enjoyed their dinner, I sat there and waited nibbling from their dishes. Finally, my dish arrived after everyone was practically done.  Although, our waitress did give us a round of free shots to compensate her mistakes but there were several other mistakes here and there.\n\nI enjoyed their Jasmine Creme Brulee the most out of everything.\n\nLast, but not least, I noticed that when the server brought out my bowl of rice her thumb was deep into the bowl =T", "rating": 3, "date": "2011-04-07"}, {"excerpts": ["-Great tofu mieng kum", "; loved the spinach leaves, the coconut, and presentation!!!\n", "- don't know how the samosa snuck into the menu, but vegetarian samosa was tasty, cucumber dressing had a nice kick, but had small portions compared to normal Indian samosas I'd eat.\n", "-servers were very friendly and checked up on us, but were not overbearing. ", "We got here at 5pm on a Saturday; early dinner, but best time before it got packed!\n", "-great ", "monkey theme, if they only included Donkey Kong"], "author": "Neil N.", "review": "Few ppl know my history with monkeys: I ran from them in the rain forests of Nicaragua and nearly got stalked by one in a temple in Agra, India. So I decided to take on the Monkey head on...on Brannan Street!\n\n-Loved the chicken pumpkin curry! A+ for presentation, straight out of the pumpkin. Didn't realize pumpkin could be this spicy and tasty, they didn't skimp on the chicken either. \n-My fiancee had the spicy green beans and tofu, great seasoning and tofu was well prepared, also not too oily.\n-Great tofu mieng kum; loved the spinach leaves, the coconut, and presentation!!!\n- don't know how the samosa snuck into the menu, but vegetarian samosa was tasty, cucumber dressing had a nice kick, but had small portions compared to normal Indian samosas I'd eat.\n-servers were very friendly and checked up on us, but were not overbearing. We got here at 5pm on a Saturday; early dinner, but best time before it got packed!\n-great monkey theme, if they only included Donkey Kong...\nhttp://www.youtube.com/watch?v=4Ja70QXfkr0&feature=related\n\nWhy no fifth star:\n-loved the mango mojito, just a bit too much ice and not enough drink.\n-make reservations by phone/opentable, place gets booked fast.\n-loved the spicy green beans and ginger spice tofu, just a lil pricey for a small portion.\n\nWould not believe from the exterior that it's a Thai restaurant. But really liked the place, big UPs for their presentation of food. Great reviews from the get go, so I'd say they lived up to the hype. I'd go here for a fancy Thai dinner, but if you wanted quick Thai food, look someplace else. Those that wanna have a nice sit down meal before/after a Giants game or in SOMA, a pricey but fun option. Would come back to try more monkey-themed dishes!", "rating": 4, "date": "2010-03-15"}, {"excerpts": ["We started off with the tofu Mieng Kum. ", "They're little leaf wrapped, hand held goodies with a ton of flavor and killer sauce. ", "I wasn't impressed by our grilled honey duck (as highly recommended by other yelpers) but the sea bass Mor Din was really good. ", "The fish was done just right ", "and I love the glass vermicelli noodles. ", "They just soak up all the flavor. ", "Finally, we ordered a dessert and they remembered it was for a birthday, so it arrived with a candle and a happy birthday song. ", "I was impressed they remembered. ", "Thanks for making this dinner so special."], "author": "Kathleen T.", "review": "First off, I love the ambiance, and the name of the place is so unique for a restaurant! I celebrated a birthday for a friend of mine. I called in ahead of time for a reservation letting them know this. \nWe started off with the tofu Mieng Kum. They're little leaf wrapped, hand held goodies with a ton of flavor and killer sauce. I wasn't impressed by our grilled honey duck (as highly recommended by other yelpers) but the sea bass Mor Din was really good. The fish was done just right and I love the glass vermicelli noodles. They just soak up all the flavor. Finally, we ordered a dessert and they remembered it was for a birthday, so it arrived with a candle and a happy birthday song. I was impressed they remembered. Thanks for making this dinner so special.", "rating": 4, "date": "2010-03-22"}, {"excerpts": ["Except for the Tofu Mieng Kum appetizer, which was awesome. ", "This appetizer is a lettuce leaf containing a small piece of fried tofu, a tiny lime piece, onion, chopped peanut, chili and ginger. ", "You simply put some of the accompanying roasted coconut dip on top of the other ingredients, wrap it up, and devour. ", "I joked to my friends it was a \"flavor bomb.", "\" "], "author": "Jenny K.", "review": "I just had dinner here last night and enjoyed it. I've eaten at a lot of different Thai restaurants and while the food was good, it wasn't anything special. Except for the Tofu Mieng Kum appetizer, which was awesome. This appetizer is a lettuce leaf containing a small piece of fried tofu, a tiny lime piece, onion, chopped peanut, chili and ginger. You simply put some of the accompanying roasted coconut dip on top of the other ingredients, wrap it up, and devour. I joked to my friends it was a \"flavor bomb.\" Each bite of this wonderful appetizer packs an incredibly flavorful burst to the taste buds.\n\nWe had a chicken dish that was good but pretty basic - just some chicken with red and green bell peppers, onion and basil. The portion was pretty small. The green vegetable curry tasted good but was very watery. We also had tofu and shrimp pad thai (tasty, with noodles that were more al dente which I prefer) and pea sprouts sauteed with garlic. I loved the pea sprouts, which were flavorful and garlicky. I don't see pea sprouts served at many restaurants so this was a real treat for me. \n\nAll in all a good meal in a restaurant with pretty decor, a full bar, and very nice ambiance and service.", "rating": 3, "date": "2007-04-19"}], "lunch spicy tumeric salmon": [], "lunch chicken cashew nut": [], "lunch praram spinach chicken": [], "lunch sweet chili basil chicken": [], "lunch crispy chicken fried rice": [], "lunch prawn asparagus": [], "lunch thai pork stew": [], "lunch garlic and pepper beef": [], "lunch belly basil": [], "lunch beef mango": [], "lunch spicy tom yam fried rice": [], "lunch stir fried green beans": [], "lunch wok fried spicy basil": [], "lunch southern kurkling": [], "monday special": [], "tuesday special": [], "wednesday special": [], "thursday special": [], "friday special": [], "stirfried asparagus with oyster sauce": [], "woksauteed mushrooms": [], "stirfried green beans": [], "stirfried baby bok choy": [], "stirfried chinese broccoli": [], "stirfried cabbage": [], "stirfried iceberg lettuce": [], "royal curry": [{"excerpts": ["My Royal Curry with the red curry sauce option was horribly undercooked ", "and I was so hungry by the time the food arrived that I just ate it anyway. ", "The vegetables (carrots, etc) were hard, tofu in it was bland. ", "The only good thing about the curry was the sauce, which kind of tasted like it simply had been poured on. ", "My bf's pumpkin curry was better and tasted like it had been properly stewed a while, but for $16 a portion, I'm expecting a great curry, and not merely a small portion of decent curry ", "I could cook at home. ", "Since we had gotten a Bloomspot deal I decided to have a pumpkin curry without the chicken. ", "Which cued a repeat performance of blah-ness, though since squash is so easy to cook, it was soft enough for me.  ", "We probably should have demanded they take back the Royal curry and complained about our reservation, but BF and I aren't the types to make a scene. "], "author": "Kit A.", "review": "I wish I could write a better review for this place but it was one messup after another, and on Valentine's Day no less. As it is, this place very nearly ruined Valentine's Day for us.\n\nWe'd taken care to get our reservation in for Valentine's Day weeks before. They called to confirm, we had the confirmation email. What happens when we get there? We get told our reservation is not on the list at all, and they refused to seat us to boot - we had to dig out the email on my bf's phone for them to even give us a table.\n\nThe hostess then apologizes profusely and hastily gives us the tiny table along the aisle between the wall and the bar stools. Which turns out to be extremely drafty, and since I was dressed for the evening out I was shivering with cold and nearly got sick by the time the night was over.\n\nI'm not the sort to be turned off a good meal by cold, bad/rude service or crappy decor. But I've eaten better at holes-in-the-wall and this time the mixup with the reservations could not be saved by the food. My Royal Curry with the red curry sauce option was horribly undercooked and I was so hungry by the time the food arrived that I just ate it anyway. The vegetables (carrots, etc) were hard, tofu in it was bland. The only good thing about the curry was the sauce, which kind of tasted like it simply had been poured on. My bf's pumpkin curry was better and tasted like it had been properly stewed a while, but for $16 a portion, I'm expecting a great curry, and not merely a small portion of decent curry I could cook at home. Since we had gotten a Bloomspot deal I decided to have a pumpkin curry without the chicken. Which cued a repeat performance of blah-ness, though since squash is so easy to cook, it was soft enough for me.  The curry sauce did not fare so well and tasted hastily slapped on yet again.\n\nWe probably should have demanded they take back the Royal curry and complained about our reservation, but BF and I aren't the types to make a scene. If you are a curry enthusiast, and/or wanting to take no chances on impressing on special dinner date, this is a place best left unvisited.\n\nEdit: To the poster who called me an idiot - Oh sure, because other people have lives (including myself) to the extent they're busy on Valentine's Day and go to a restaurant post-work or college totally invalidates their previous review that the food sucked. I know what good curry tastes like and if you got offended that I slammed your favorite haunt, sorry, but it doesn't work that way. I say to you - I have standards when I eat, and I wouldn't have chosen this place, V-day or no, if I'd known the food and service was this bad. Had the restaurant cared about its customers they would have saved us a table in the main dining area, as well. My opinion still stands.", "rating": 1, "date": "2012-02-19"}, {"excerpts": ["The royal curry (veggie green curry) was bland and not so delicious.  ", "The spicy tofu was ok, but not really the shining beacon needed to pull this restaurant up."], "author": "Olivia T.", "review": "My family came here for dinner on a Sunday night and I'd have to say that the service was just terribly embarassing.  Like they weren't ready to be open that night.  First, we arrived on time for our 6:30 reservation and the hostess stood back to us and on the phone for a good 5+ minutes.  How rude!\n\nWhen we're finally seated, service was uber-slow and unattentive.  The worst was when we tried to pay and after 15 minutes of trying to flag someone down with our credit card, we finally gave up and scrounged up some cash instead.  \n\nOn top of the bad service, the food was only mediocre.  The royal curry (veggie green curry) was bland and not so delicious.  The spicy tofu was ok, but not really the shining beacon needed to pull this restaurant up.", "rating": 2, "date": "2011-04-11"}], "volcano fried rice": [{"excerpts": ["Pumpkin Curry, Seabass with glass noodles, chicken satay, volcano fried rice - all my favorites here. "], "author": "Jon H.", "review": "Pumpkin Curry, Seabass with glass noodles, chicken satay, volcano fried rice - all my favorites here. The food is always good, service is good, and cocktails are great!! \n\nIt's a little pricey, but worth it for a fun night out.", "rating": 4, "date": "2014-10-10"}, {"excerpts": ["Their volcano fried rice is amazing! ", "LOVE the catfish curry! ", "So flavorful. ", "Ive been to Thailand before and this is as authentic as it gets. ", "And their honey roasted duck curry...yummmmy. ", "This food is perfect for take out and never gets soggy on the way home."], "author": "sofia r.", "review": "I love this place. But Ive never eaten in before. We usually get take out and it's delicious!!! Their volcano fried rice is amazing! LOVE the catfish curry! So flavorful. Ive been to Thailand before and this is as authentic as it gets. And their honey roasted duck curry...yummmmy. This food is perfect for take out and never gets soggy on the way home.", "rating": 5, "date": "2015-08-23"}, {"excerpts": ["some bits a little chewy overcooked\nmiracle duck pretty good\nbrown rice had hard rice bits\nvolcano fried rice good\nTurley zinfandel wine bottle solid:\n\n-- :  service (several times throughout the visit we were given the wrong dish, luckily one of our party kept track - nice recovery though) . "], "author": "Y I L I W.", "review": "3.5 stars is pretty accurate . could easily be a four if the dishes were upped and tweaked a bit . ..\n\n+ :  ambiance (of bar area and inside the restaurant) . tasty food . pretty good wine beer sake selection . ..\n\nscallop satay good\nstuffed mushrooms ok\ntom kha gai soup good, tasty\nbelly basil tasty good but some bits a little chewy overcooked\nmiracle duck pretty good\nbrown rice had hard rice bits\nvolcano fried rice good\nTurley zinfandel wine bottle solid:\n\n-- :  service (several times throughout the visit we were given the wrong dish, luckily one of our party kept track - nice recovery though) . dishes were good but nothing extraordinarily so . ..", "rating": 3, "date": "2012-11-25"}, {"excerpts": ["nothing special\nVolcano Fried Rice - Really flavorful and had a lot of stuff in it to make it delicious\nFire "], "author": "Diana Y.", "review": "Thai food--whether it's fancy or not--is all the same to me. I don't really believe in overpaying for thai food but it's a nice place to go with friends. \n\nOrdered a bunch of food for four:\n\nMIENG KUM -- literally bits and pieces that you put on leaves. Not so good\nMIRACLE DUCK - Not bad\nCrushed Sesame Scallops - Good but nothing special\nVolcano Fried Rice - Really flavorful and had a lot of stuff in it to make it delicious\nFire Cracker- delicious, spicy for my taste\n\nOkay, so all my descriptions were the same because that's generally how the food tasted to me. It's good but it's not great, it's filling but it's not memorable. \n\nFriendly and attentive service though.", "rating": 3, "date": "2011-05-05"}, {"excerpts": ["Chicken satay, beef satay, red curry, pumpkin curry and volcano fried rice etc etc. ", "all of the meals are awesome. ", "The service is always very nice and polite. ", "We will go ack after we meet our dirt goals!"], "author": "Asato T.", "review": "My hubby and I have been going out to dinner here almost 2 years. I'm all about 'green salmon' and can't count how many times I ordered! The grilled salmon is not so salty but so tender, and the green noodles are made of moloheiya. Chicken satay, beef satay, red curry, pumpkin curry and volcano fried rice etc etc. all of the meals are awesome. The service is always very nice and polite. We will go ack after we meet our dirt goals!", "rating": 5, "date": "2012-03-24"}], "steamed coconut rice": [{"excerpts": ["Ordered steamed coconut rice which had a lovely flavour but should have been included with the entree. \n\n"], "author": "Deborah C.", "review": "Had the soft shell crab dish for dinner. Very good in terms of retaining crispiness but plating could have been better (vegetables were hard to eat and crowded the plate). Sauce was too spicy for my liking, and I didn't touch the cucumber vinaigrette. Ordered steamed coconut rice which had a lovely flavour but should have been included with the entree. \n\nI'm a little on the fence with this one. The restaurant started to \"break down\" a little after us arriving. We were a party of 5, so I sat on the end of the table, which was unfortunately underneath a dripping pipe from the A/C. Nearby servers rotated the table, and in the end, moved our party to a different table altogether.  I was waiting for the women's washroom (single stall) when a male server came out and told me the soap dispenser was damaged. And I'm not sure he actually washed his hands properly in the process of trying to fix it, because he came out to say he couldn't. \n\nAs for ambiance, it's a bit busy with the decorations, but it gets quite loud, to a level where it was hard to hear one of our dinner companions two seats away from me unless I really leaned forward and strained to listen in. \n\nI'm not sure that I would recommend it, but I wouldn't object if someone suggested going there for lunch (when rice is apparently included with meals). Other Yelpers seem to like the pumpkin curry, and now that I know you can substitute the protein for something other than shrimp, I wouldn't mind the opportunity to try that.", "rating": 3, "date": "2013-09-03"}], "fried rice with egg": [], "voss sparkling water": []}