{"spring roll": [{"excerpts": ["Another option for vegans is the spring rolls as they can do tofu and veggies for vegan spring roll yet please know that the peanut sauce for dipping comes with chicken stock so vegans best get soy sauce or sriracha.\n\n"], "author": "Shane S.", "review": "I was amped to check out this spot after reading the review of East Bay Elite yelper John B.\n\nExcellenct and affordable Banh mi sandwiches at this hole in the wall in the Tenderloin.\n\nFor vegans check out the marinated tofu Banh mi sandwich that comes with jalapeno, marinated tofu, and veggies such as shredded carrot along with cilantro. For vegans make sure to ask for the sandwich without mayo.\n\nA refreshing drink would be great to have the nectar from a young coconut as the cook will chop off the top for you giving you a straw and will also chop the coconut in half so you can enjoy the meat afterwards like I often did in my trips abroad in India.\n\nAnother option for vegans is the spring rolls as they can do tofu and veggies for vegan spring roll yet please know that the peanut sauce for dipping comes with chicken stock so vegans best get soy sauce or sriracha.\n\nGreat spot and friendly service yet don't come here with a crowd as there is limited seating. I will be back soon :-)", "rating": 5, "date": "2017-08-20"}, {"excerpts": ["Very small takeout standard viet sammich take out with spring roll and shrimp chip snacks on table"], "author": "Angela L.", "review": "Food:\nCombo banh mi = pretty good! Bread is a little tough tho \n\n\nService:\nNice Vietnamese family :) CASH ONLY. Atm at across the street at corner store \n\nAtmosphere:\nVery small takeout standard viet sammich take out with spring roll and shrimp chip snacks on table", "rating": 4, "date": "2015-05-14"}], "sticky rice": [], "special combination sandwich": [], "bbq pork sandwich": [{"excerpts": ["I got a BBQ pork sandwich and I enjoyed the taste and the rolls were fresh as well.  ", "I can't really say that one is clearly better than the other I would probably go to the one that had the smaller line."], "author": "Rod M.", "review": "I went to both this place and Saigon Sandwich across the intersection and i must say that they are both good.  This shop was operated by one lady who is really really sweet. \n\nI got a BBQ pork sandwich and I enjoyed the taste and the rolls were fresh as well.  I can't really say that one is clearly better than the other I would probably go to the one that had the smaller line.", "rating": 4, "date": "2018-01-11"}, {"excerpts": ["Highly recommended their BBQ pork sandwich n combi"], "author": "Aniko N.", "review": "Sandwich here is as good as Saigon sandwich from across the street. Best of all, it doesn't have those long lines. Highly recommended their BBQ pork sandwich n combi", "rating": 5, "date": "2016-11-25"}, {"excerpts": ["and I both ordered the BBQ pork sandwich ", "and we loved it!  ", "My husband orders a Bahn Mi whenever he gets the chance and he was in heaven!  ", "The woman who runs the hole in the wall is an absolute delight!  ", "We asked what a certain unrecognizable (to us) food was and she was so excited to let us try it, she gave us the whole package for free when we said we really liked it!  ", "I still don't know what the moist yellow thing was, but it was delicious and she said she had made it that morning. ", "My husband and I have eaten in a lot of foodie spots in SF, and while this is definitely NOT one of those, the sandwich and the whatever-that-thing-was were EXCELLENT in flavor and did not disappoint!!"], "author": "Jody T.", "review": "Staying at the hotel across the street, we asked the front desk which Bahn Mi place they recommended (there are two within a block), and they suggested L&G.  My husband and I both ordered the BBQ pork sandwich and we loved it!  My husband orders a Bahn Mi whenever he gets the chance and he was in heaven!  The woman who runs the hole in the wall is an absolute delight!  We asked what a certain unrecognizable (to us) food was and she was so excited to let us try it, she gave us the whole package for free when we said we really liked it!  I still don't know what the moist yellow thing was, but it was delicious and she said she had made it that morning. My husband and I have eaten in a lot of foodie spots in SF, and while this is definitely NOT one of those, the sandwich and the whatever-that-thing-was were EXCELLENT in flavor and did not disappoint!!", "rating": 5, "date": "2016-06-10"}], "bbq chicken sandwich": [{"excerpts": ["I got the BBQ Chicken sandwich and soon was on my way. ", "The sandwich was neatly packed ", "but it was haphazardly put together. ", "The French roll was not crunchy and the chicken had a weird smell. "], "author": "Ahmad J.", "review": "Tenderloin has an abundance of Vietnamese restaurants in-fact there are as many as 4 specialized Banh-Mi (sandwiches) restaurants. Saigon Sandwich and L&G Vietnamese Sandwich are two that are literally across from each other. After trying out Saigon Sandwich, I decided to give L&G Vietnamese Sandwich a try.\n\nThis is another small primarily to-go restaurant, but I think it has a couple of seats inside. At the peak lunch hour on Saturday it looked like they had just opened and there were a couple of people standing inside waiting for something. I did the same. After about 10 minutes of so they started taking orders. I think they were waiting for the bread or protein, can't be sure. Anyway the menu again is pretty simple a couple of different types of sandwiches including BBQ pork, BBQ chicken, meatball combination etc. Most of the sandwiches are around the $4 mark with tax.\n\nI got the BBQ Chicken sandwich and soon was on my way. The sandwich was neatly packed but it was haphazardly put together. The French roll was not crunchy and the chicken had a weird smell. Overall this was an average sandwich.\n\nI decided to give L&G another try but this time found that they had been closed due to a health code violation. That's when I decided no more tries, I'm sticking with Saigon sandwich which is just across the road.", "rating": 2, "date": "2018-04-11"}, {"excerpts": ["Got a BBQ chicken sandwich. \n\n"], "author": "Crisanto G.", "review": "Damn... \n\n\nProbably (one of) the best Vietnamese sandwich you can get in the city. \n\nCame here after a pool part at the Phoenix hotel across the street. \n\nGot a BBQ chicken sandwich. \n\nWhat else can I say?", "rating": 5, "date": "2016-10-30"}], "marinated tofu sandwich": [{"excerpts": ["Got the marinated tofu sandwich & a freshly made  Vietnamese iced coffee. ", "Good sandwich, fresh, nice amount of marinated veggies. ", "One of the better Tofu Bahn Mi in the neighborhood."], "author": "Wan T.", "review": "Nice family-owned Vietnamese sandwich shop. Got the marinated tofu sandwich & a freshly made  Vietnamese iced coffee. Good sandwich, fresh, nice amount of marinated veggies. One of the better Tofu Bahn Mi in the neighborhood.", "rating": 4, "date": "2015-02-05"}], "chipotle pulled pork sandwich": [], "broiled pork sandwich": [], "jello": [{"excerpts": ["Good sandwiches and the green jello taste good too. ", "Authentic sandwiches. ", "There are a lot of good snacks too.  ", "Highly recommend."], "author": "Jack B.", "review": "Good sandwiches and the green jello taste good too. Authentic sandwiches. There are a lot of good snacks too.  Highly recommend.", "rating": 5, "date": "2017-04-15"}, {"excerpts": ["Bonus points for the friendliness and the Jello. ", "I never get the Jello ", "but I like that it's there."], "author": "Loli L.", "review": "Don't look at this review. Please. It is not indicative of how often I come here. I don't need people knowing where I might happen to be and that I might happen to carry around cash (as this is a cash-only establishment.)\n\nYou do not need to know that they have delicious bread that is just the right amount of pillowy soft on the inside and hurt-your-mouth toasted on the outside. That's the sort of thing that carb-lovers care about. You're not into carbs, right? It's all about protein these days. \n\nSpeaking of protein, I'm here for the pork. I can't speak for any of the other meats because I just come in for the same thing over and over: my overdue pork sandwich. They don't skimp on the meat as of way of tricking me to keep coming back. It works.\n\nThe pickled veggies and cilantro help me feel like I'm eating salad, which I should probably eat more of these days, but where the heck am I going to find a filling salad for less than $5?\n\nBonus points for the friendliness and the Jello. I never get the Jello but I like that it's there.", "rating": 5, "date": "2015-07-04"}], "thai iced tea with tapioca": []}