{"hawaiian sun": [{"excerpts": ["Over Grubhub, I ordered for BBQ Short ribs with rice and Hawaiian Sun. ", "What I got instead was Chicken Katsu with rice and no drink. ", "I tried calling back L&L and the lady put me on hold. ", "I can hear another lady on the phone confirming my order but they haven't sent it out yet. ", "When I got to talk to the lady, I said I was the person they were talking about that I got a wrong order. ", "Then the call was dropped. ", "I called Grubhub instead and the best they could do is offer a refund. ", "I told them it's lunch time, and it's not like you can refund shoes. ", "You're hungry and you waited 20 minutes for your meal. ", "I didn't bother anymore and accepted the refund and a free future grubhub order. ", "To L&L management, please train your counter people better."], "author": "Raymond V.", "review": "Over Grubhub, I ordered for BBQ Short ribs with rice and Hawaiian Sun. What I got instead was Chicken Katsu with rice and no drink. I tried calling back L&L and the lady put me on hold. I can hear another lady on the phone confirming my order but they haven't sent it out yet. When I got to talk to the lady, I said I was the person they were talking about that I got a wrong order. Then the call was dropped. I called Grubhub instead and the best they could do is offer a refund. I told them it's lunch time, and it's not like you can refund shoes. You're hungry and you waited 20 minutes for your meal. I didn't bother anymore and accepted the refund and a free future grubhub order. To L&L management, please train your counter people better.", "rating": 1, "date": "2018-01-04"}, {"excerpts": ["My total (along with a can of Hawaiian Sun mango-orange drink) was just over $7. ", "Unfortunately, the wait was a little bit long - probably because everyone else is just as excited about the L&L reopening as I am! ", "Or just because it's a lunch place on Kearny. ", "Whatever."], "author": "Ada T.", "review": "I've been waiting for this L&L to reopen for months, so when I walked along Kearny and saw people entering the place, my heart skipped just a little bit. And by a little bit, I mean a lot. I instantly ditched my plans of going to Latte Express #5 for my favorite Vietnamese sandwich, and breathlessly ordered a mini chicken katsu lunch plate, as if the L&L would disappear before my eyes if I didn't speak quickly enough.\n\nThe food here, though, can't really be described as magical - it's hearty, filling, comforting, and cheap. Don't be fooled by the dinky \"mini\" container. They pack it very full, and it's a perfect amount for lunch. The choices at L&L are many (chicken, pork, beef BBQ; musubi; breakfast items; noodles; seafood; burgers; sandwiches; salad), but I think going with a combo plate is the way to go because you get a scoop of the totally crucial mac salad. Of course, you could always get a side order of mac salad for just $0.99, which I might do because I'm obsessed with it.\n\nMy total (along with a can of Hawaiian Sun mango-orange drink) was just over $7. Unfortunately, the wait was a little bit long - probably because everyone else is just as excited about the L&L reopening as I am! Or just because it's a lunch place on Kearny. Whatever.", "rating": 4, "date": "2008-10-31"}, {"excerpts": ["They have Hawaiian Sun drinks there and Saimin and spam musubi. ", "Points off for timid aloha spirit and hardly anyplace to plant your ass at lunch time."], "author": "Krismet C.", "review": "Loco moco: loco meaning crazy and moco meaning booger in Spanish.  That would be a scoop or two of rice with a fried egg on top, then a hamburger patty, then some brown gravy. I love it! \n\nThis is Hawaiian fast food and it is ono when you miss Hawaii and can't get to the islands for the real thing. They have Hawaiian Sun drinks there and Saimin and spam musubi. Points off for timid aloha spirit and hardly anyplace to plant your ass at lunch time.", "rating": 3, "date": "2007-05-01"}, {"excerpts": ["Chicken Katsu mini, sub rice for the mac salad, a spam musubi and a Hawaiian Sun drink ", "and I'm set for lunch.  "], "author": "Kelly K.", "review": "OK, so first off, this place is probably more like a 3 star rating, but I have to give it 4 simply because they will satisfy my Spam musubi craving in an instant.  \n\nChicken Katsu mini, sub rice for the mac salad, a spam musubi and a Hawaiian Sun drink and I'm set for lunch.  Not the best katsu I've had, not even close, but it definitely does the trick when I'm wanting comfort food.  \n\nThey are VERY slow, so the trick to speedy food is CALL IT IN 15 minutes beforehand.", "rating": 4, "date": "2007-10-01"}, {"excerpts": ["Be prepared to counter these effects with a nice sweet can of Hawaiian Sun juice. ", "The mac salad is as authentic as you can get it, its doused with mayo! ", "Beware, the its not as cheap as you think it would be, but it is still a good value."], "author": "Judy L.", "review": "Its open 6 days a week! Be expecting LARGE GREASY portions of food. The Pork Lau Lau special is quite tasty and salty. Be prepared to counter these effects with a nice sweet can of Hawaiian Sun juice. The mac salad is as authentic as you can get it, its doused with mayo! Beware, the its not as cheap as you think it would be, but it is still a good value.", "rating": 4, "date": "2006-03-25"}, {"excerpts": ["Service here is slower than most, but you get a free Hawaiian Sun with a meal, so that evens out! ", "There isn't much Hawaiian food around here (I'm from socal and it's all over the place), so it's better than nothing!"], "author": "The Sock S.", "review": "Although not reviewed here, I've eaten at many an L&L in my day... Service here is slower than most, but you get a free Hawaiian Sun with a meal, so that evens out! There isn't much Hawaiian food around here (I'm from socal and it's all over the place), so it's better than nothing!", "rating": 3, "date": "2006-11-02"}, {"excerpts": ["Be sure to get yourself a Hawaiian Sun drink to quench your thirst."], "author": "Luis M.", "review": "Hawaiian Plate Lunch.  If you don't know what that is then you might be thrown off by this place.  The BBQ dishes come with rice and macaroni salad.  A mini plate is actually enough to fill up the average person so only order the regular if you can really put it down or you are extra hungry.  The chicken katsu and BBQ chicken are both tasty.  Their hamburger patties are really good.  I prefer them in a loco moco but a cheeseburger is good every now and then.  I haven't tried the spam musubi or saimin at this location so I can't really comment but in general those are also two of my favorite dishes.  Be sure to get yourself a Hawaiian Sun drink to quench your thirst.", "rating": 3, "date": "2006-05-03"}], "bottled water aquafina": [], "bottled juice": [], "coconut water": [], "lemon lime sparkling water": [], "spam eggs and rice": [], "portuguese sausage eggs and rice": [{"excerpts": ["Portuguese sausage eggs and rice always hits the spot.\n", "This particular one is pretty small, it's better for take-out. ", "The line also gets pretty long at lunch so calling in your order is always a good idea. \n...", "mmmmmmm this review is making me hungry. ", "drooooooool\nGo there! ", "Dooooeeeeet!!!"], "author": "Janu A.", "review": "\"Musubi & short ribs & lau lau OH MY! What to get what to get?\"These are the types of things that run through my head when I walk into L&L every time! Thank Goodness they have combo meals! OK hmmmm where to start?...\nShort Ribs: finger lickin deeeelicious!\nChicken Katsu: crispy goodness\nBBQ chicken: tender moist tastiness\nSpam Musubi: I'll take 8!\nyou get the point right?\nOH they also have breakfast! Portuguese sausage eggs and rice always hits the spot.\nThis particular one is pretty small, it's better for take-out. The line also gets pretty long at lunch so calling in your order is always a good idea. \n...mmmmmmm this review is making me hungry. drooooooool\nGo there! Dooooeeeeet!!!", "rating": 4, "date": "2012-02-25"}, {"excerpts": ["Ordered Portuguese sausage eggs and rice and a side order of Chinese sausage. ", "They rudely insisted I pay an additional $5.00 for (3 small slices) ", "1/2 a link of Chinese sausage.  ", "Yeah right!  ", "Definitely NOT L&L service & will NOT return.  ", "I would've paid for it, if they were even nice about it. ", "Bad Karma to you guys!!  ", "No Aloha!!"], "author": "Keoni F.", "review": "Ordered Portuguese sausage eggs and rice and a side order of Chinese sausage. They rudely insisted I pay an additional $5.00 for (3 small slices) 1/2 a link of Chinese sausage.  Yeah right!  Definitely NOT L&L service & will NOT return.  I would've paid for it, if they were even nice about it. Bad Karma to you guys!!  No Aloha!!", "rating": 1, "date": "2015-02-20"}], "chinese sausage eggs and rice": [], "bacon eggs and rice": [], "chicken katsu plate": [{"excerpts": ["ORDERED BBQ mix plate with macaroni salad and white rice, mini mini chicken katsu plate, and grilled spam musubi.\n\n"], "author": "Nicholas G.", "review": "Portion sizes here are HUGE. You definitely get the bang for your buck. I walk looking for Hawaiian here in the city, and was surprised to find this spot tucked away downtown.\n\nAMBIANCE is nothing impressive, but they had an extensive menu outlining food options and cost alongthe wall (see photos). There are only a few seats inside. Nobody was there when my partner and I arrived, but a few people came in after we did and had to get creative. \n\nORDERED BBQ mix plate with macaroni salad and white rice, mini mini chicken katsu plate, and grilled spam musubi.\n\nFOOD was bomb. I ended up ordering so much I couldn't finish (which for me is a feat). The beef was well cooked and marinated, the katsu had a fresh and delicious crunch (and a good portion for a mini plate), and the spam musubi was a tasty first for me. Highly recommend the options above.\n\nRATING is a fantastic four. It takes a little while to get the food, but you'll realize it's worth the wait.", "rating": 4, "date": "2017-12-07"}, {"excerpts": ["I ordered the regular Chicken Katsu plate to-go. ", "The price was reasonable and the service was friendly. ", "There happened to be several people in the restaurant who looked like they could be Pacific Islanders so that made me somewhat hopeful that the food would be good. ", "And it was! ", "The portion was huge although the amount of mac salad was disproportionate to the rest (two big scoops of rice, a gigantic pile of chicken and a very meager scoop of mac) but that's fine because I'm not as huge a fan of it as most are.  ", "I would definitely recommend getting the mini size meal. ", "The mini is waaay smaller than the regular but the regular was just ridiculously large - enough for 3 meals. ", "The mini looked to be less than half the portion to me "], "author": "Emma H.", "review": "I haven't craved Hawaiian BBQ since I got food poisoning from Ono on Sloat 6 or 7 years ago but I saw a Hawaiian Mukbang recently and it stuck in my head. \n\nI ordered the regular Chicken Katsu plate to-go. The price was reasonable and the service was friendly. There happened to be several people in the restaurant who looked like they could be Pacific Islanders so that made me somewhat hopeful that the food would be good. And it was! The portion was huge although the amount of mac salad was disproportionate to the rest (two big scoops of rice, a gigantic pile of chicken and a very meager scoop of mac) but that's fine because I'm not as huge a fan of it as most are.  I would definitely recommend getting the mini size meal. The mini is waaay smaller than the regular but the regular was just ridiculously large - enough for 3 meals. The mini looked to be less than half the portion to me but I finished less than half of the regular portion and that food is not really the best to take leftovers of IMO.  \n\nThe spam masubis are huge and my coworker gets about three per day, so check those out too. Pro-tip: they sell the masubis half-price late in the afternoon.", "rating": 4, "date": "2016-12-29"}, {"excerpts": ["Highly recommend the Loco Moco and Chicken Katsu plate lunches."], "author": "Jerod K.", "review": "L&L has had a special place in my heart since I first moved to Hawaii back in 2002.  After moving to the Bay Area and working in San Francisco, I was pleasantly surprised to find this location less than two blocks from my office.  Some of the prep is a little different from what I'm used to (musubi seems to be...  \"squashed?\"), but the taste is still the same.  Highly recommend the Loco Moco and Chicken Katsu plate lunches.", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["2) i should have sticked with my old order \"mini-chicken katsu plate\" but everytime i eat it; my stomach hurts SO bad because of the grease. ", "now im begin to think if they ever changed the oil. ", "anything deep fried isn't healthy, anything deep fried on old oil... is gross. ", "the chicken katsu is pretty damn good but the aftermath is an awhful feeling especially when you have a half a day to go at work and your in pain as if the chicken came alive in your stomach and started beating the walls or the oil feels like its boiling in your stomach. "], "author": "Jane A.", "review": "2.75\n\nF&G (Fat & Grease) Hawaiian Barbecue \n\nfirst off, i hate the fake \"aloha\" sorry im not hawaiian and neither are these people and i know they try to mesh with the decor and wear plastic lei's but i don't ever get the \"hawaiian feel\" here. have the people who run this joint ever been to Hawaii? Seriously because the people in hawaii give you HUGE servings. this place is just a chain of wanna-be hawaiian food. back in 2006 i came here alot with my co-workers. we would wait 30 minutes just to get our mini plates and the food at that time would be \"Meh. I've experienced better.\"\n\nI haven't had L&L since 2006 and i came here a few weeks ago. I ordered the mini-shortribs plate.\n\n1) mini-Shortribs plate ($6.50) - its tasty because of the flavored grease oozed on my meat and rice. the shortribs was really a short rib, with hardly any meat and more of fat. \n\n2) i should have sticked with my old order \"mini-chicken katsu plate\" but everytime i eat it; my stomach hurts SO bad because of the grease. now im begin to think if they ever changed the oil. anything deep fried isn't healthy, anything deep fried on old oil... is gross. the chicken katsu is pretty damn good but the aftermath is an awhful feeling especially when you have a half a day to go at work and your in pain as if the chicken came alive in your stomach and started beating the walls or the oil feels like its boiling in your stomach. this truly is not the hawaiian experience! \n\nI likek hawaiian spots, especially the ones in hawaii, but the ones in the bay are WHACK. the ones in seattle are way better. \n\n\nUntil the next review...", "rating": 3, "date": "2009-03-01"}, {"excerpts": ["First, sample their mixed-plate or the chicken katsu plate. ", "Or, for those who live dangerously, upgrade it to a regular plate, not mini. ", "Weighing in at more than two pounds, a regular chicken katsu plate contains two slices of fried chicken on top two scoops of rice, as well as macaroni salad drenched in mayonnaise. "], "author": "Richard L.", "review": "Forget the haters here. Other than the Hukilau, L and L does a fine job of serving some quality Hawaiian fast food. \n\nLet's get this aside: L and L won't win any awards for healthiness. There's just a hint -- eh, more like a downpour -- of grease in the fried foods, and every dish is extremely caloric dense. It's definitely not weight-watchers friendly.\n\nBut if you don't mind running an extra block, then prepare yourself for some great grub. First, sample their mixed-plate or the chicken katsu plate. Or, for those who live dangerously, upgrade it to a regular plate, not mini. Weighing in at more than two pounds, a regular chicken katsu plate contains two slices of fried chicken on top two scoops of rice, as well as macaroni salad drenched in mayonnaise. And, oh, ask them for curry on top -- it's delicious.\n\nNot everything is great, however. Behind the counter, the cashiers are remarkably inane, slow to take and process your order. When this L and L first opened, under intense pressure, the service was painfully slow often botching their orders. Thankfully, things have smoothed out, but there are still plenty of hiccups. What the Hawaii L&L's excels in efficiency, the SF location squanders in incompetence. \n\nA word of warning: Don't let the cheap breakfast lure you in. Only  3.99? Sold...well, not quite. Unlike the heartiness of a plate lunch, the breakfast plates are neither satisfying nor fulfilling. There's a lack of food, in fact. No wonder the price is so cheap. Two lousy slices of Spam, a diminutive scoop of rice, and one sorry egg -- that's where your money went. Down the drain.", "rating": 3, "date": "2006-12-11"}], "chicken cutlet plate with gravy": [], "hawaiian bbq chicken plate": [], "chicken katsu curry plate": [], "kalua pork plate": [{"excerpts": ["The roomie got himself a kalua pork plate. ", "I didn't eat much of it, but I did steal some of his macaroni salad. "], "author": "Elena N.", "review": "The roommate was picking up some food next door and asked me if I also wanted some Spam Musubi. Of course, I said yes please! He picked up some food for takeout last Monday, April 9th.\n\n*Kalua Pork w/Cabbage: Smoke-flavored, shredded pork slowly roasted and mixed with cabbage\n*Chicken Katsu: pieces of boneless chicken coated with special seasoning and deep-fried, served with special L & L Hawaiian Barbecue Chicken Katsu sauce\n*Musubi: A block of rice with Spam, wrapped in flavored, dry seaweed\n\nI really like the spam musubi from L&L. It's a good ratio of rice to spam and it's always so flavorful. I actually wanted a piece of chicken katsu musubi too, but the roomie got me an actual order of chicken katsu instead. This turned out to be better cuz it fed us for two meals. It also came with a generous amount of katsu. I don't like L&L's sauce as it's too sweet, so we just used our own Japanese tonkatsu sauce we have at home. The roomie got himself a kalua pork plate. I didn't eat much of it, but I did steal some of his macaroni salad. I love a good macaroni salad mixed with sriracha.\n\nSolid and consistent Hawaiian food. I love their Spam musubi!", "rating": 4, "date": "2016-05-15"}], "lau lau plate": [], "bbq beef plate": [], "bbq short ribs plate": [], "hamburger steak plate": [], "loco moco plate": [], "healthy veggie patty plate": [], "healthy garlic shrimp plate": [], "healthier salmon patty plate": [], "healthy garlic fish plate": [], "healthy bbq chicken plate": [], "beef patty ramen burger": [], "veggie patty ramen burger": [], "bbq chicken ramen burger": [], "loco moco ramen burger": [{"excerpts": ["I got the loco moco ramen burger for myself, and the seafood + BBQ chicken combo for my family. ", "While it may not be the best Hawaiian restaurant on the west coast, the food was still really fresh and tasty. ", "This was actually the first ramen burger I ever had, and it was quite tasty. ", "I got some spam musubi to go, to take back to my friend in Ohio, and he and I both enjoyed the spam musubi. ", "Overall the food is fresh and delicious and I would recommend this place to others."], "author": "Benson K.", "review": "This is a small hole in the wall Hawaiian restaurant. Coming from the Midwest, I don't have very many opportunities to order Hawaiian food, and this was the closest location to Chinatown SF. I got the loco moco ramen burger for myself, and the seafood + BBQ chicken combo for my family. While it may not be the best Hawaiian restaurant on the west coast, the food was still really fresh and tasty. This was actually the first ramen burger I ever had, and it was quite tasty. I got some spam musubi to go, to take back to my friend in Ohio, and he and I both enjoyed the spam musubi. Overall the food is fresh and delicious and I would recommend this place to others.", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["Tried the Loco Moco Ramen burger here today. ", "It had good flavor overall ", "but here is the breakdown:\n1.  ", "Burger patty -  clearly a frozen patty resembling the look of a piece of cardboard with a very bland taste;\n2.  ", "Ramen \"bun\" - too small for the size of the burger patty, very dry and fried too hard but still failed to hold the burger together when I attempted to hold and eat like a \"traditional\" burger, I ended up giving up and eating with the fork and knife provided (ah ha moment - ", "\"No wonder they gave these to me!\", really came in handy);\n3.  ", "Fried egg- ", "I ordered it medium and it was overcooked, the yolk was cooked solid throughout not at all a little runny like I like my medium fried eggs to be;\n4. ", "Gravy, Green Onions, etc. "], "author": "Aisha M.", "review": "Tried the Loco Moco Ramen burger here today. It had good flavor overall but here is the breakdown:\n1.  Burger patty -  clearly a frozen patty resembling the look of a piece of cardboard with a very bland taste;\n2.  Ramen \"bun\" - too small for the size of the burger patty, very dry and fried too hard but still failed to hold the burger together when I attempted to hold and eat like a \"traditional\" burger, I ended up giving up and eating with the fork and knife provided (ah ha moment - \"No wonder they gave these to me!\", really came in handy);\n3.  Fried egg- I ordered it medium and it was overcooked, the yolk was cooked solid throughout not at all a little runny like I like my medium fried eggs to be;\n4. Gravy, Green Onions, etc. - The saving grace of this ramen burger, it gave the rest of the components some moistness and flavor, without these things, it would've been very hard for me to eat this.\n\nOverall, I would go there again if I was starving, in the area and no other burger place was open. It was a good experience though, I've been wanting to try the ramen burger for a year now. They're really hard to find! \n\nOne more thing checked off my bucket list!", "rating": 3, "date": "2014-06-06"}], "bbq hamburger": [], "bbq cheeseburger": [{"excerpts": ["The double BBQ cheeseburger was okay except I didn't like the sauce in it .. ", "it got very tiring . ", "The BBQ combo plate was alright . ", "The proportion was pretty generous . ", "Two scoops of rice , macaroni salad , and a lot of BBQ meat & chicken . ", "I didn't really like the macaroni salad though .."], "author": "Eileen L.", "review": "I decided to try L&L because I keep hearing about how good it is . The food here is OK but nothing special or anything . It was kind of nice how they they give each customer a free small piece haupia ( which is pretty good btw ) . The double BBQ cheeseburger was okay except I didn't like the sauce in it .. it got very tiring . The BBQ combo plate was alright . The proportion was pretty generous . Two scoops of rice , macaroni salad , and a lot of BBQ meat & chicken . I didn't really like the macaroni salad though ..", "rating": 3, "date": "2008-10-10"}], "veggie burger": [], "salmon burger": [{"excerpts": ["I ordered a salmon burger he ordered chicken katsu. ", "About 5 minutes later he gets his chicken katsu ", "and I can see the cook has just now bothered to put my salmon burger on the grill ", "And it tasted like a salmon burger I could get anywhere, ", "so I'll be getting it somewhere else from now on."], "author": "Alan G.", "review": "I stopped in tonight at 4:30 on a Tuesday. The place was empty. A guy came in right behind me. I ordered a salmon burger he ordered chicken katsu. About 5 minutes later he gets his chicken katsu and I can see the cook has just now bothered to put my salmon burger on the grill 5 minutes later I finally get it. \n\nAnd it tasted like a salmon burger I could get anywhere, so I'll be getting it somewhere else from now on.", "rating": 1, "date": "2008-11-25"}], "bbq beef sandwich": [], "fish sandwich": [], "kalua pork sandwich": [], "spam and egg sandwich": [], "grilled spam saimin": [], "hawaiian bbq chicken saimin": [], "chicken katsu saimin": [{"excerpts": ["I got full off their 5 dollar chicken Katsu saimin which was really great. ", "I will be coming back for sure!"], "author": "Diva H.", "review": "I've always passed by this place because it seemed pretty different from what I'm use to but it's AWESOME.\n\nTheir menu is very unique and not like anything you find elsewhere. It seems to have Asian style food but with a bit of a twist. They offer all day breakfast and include spam in many of their menu items. Aside from the great menu and food, this place is very inexpensive. I got full off their 5 dollar chicken Katsu saimin which was really great. I will be coming back for sure!", "rating": 5, "date": "2015-11-21"}], "hawaiian bbq beef saimin": [], "fried shrimp saimin": [], "grilled spam musubi": [{"excerpts": ["ORDERED BBQ mix plate with macaroni salad and white rice, mini mini chicken katsu plate, and grilled spam musubi.\n\n"], "author": "Nicholas G.", "review": "Portion sizes here are HUGE. You definitely get the bang for your buck. I walk looking for Hawaiian here in the city, and was surprised to find this spot tucked away downtown.\n\nAMBIANCE is nothing impressive, but they had an extensive menu outlining food options and cost alongthe wall (see photos). There are only a few seats inside. Nobody was there when my partner and I arrived, but a few people came in after we did and had to get creative. \n\nORDERED BBQ mix plate with macaroni salad and white rice, mini mini chicken katsu plate, and grilled spam musubi.\n\nFOOD was bomb. I ended up ordering so much I couldn't finish (which for me is a feat). The beef was well cooked and marinated, the katsu had a fresh and delicious crunch (and a good portion for a mini plate), and the spam musubi was a tasty first for me. Highly recommend the options above.\n\nRATING is a fantastic four. It takes a little while to get the food, but you'll realize it's worth the wait.", "rating": 4, "date": "2017-12-07"}, {"excerpts": ["I always make sure to get a couple of their delicious Grilled Spam Musubi. ", "I just adore those things!"], "author": "Robert T.", "review": "I really love their Loco Moco--it is so hearty and satisfying. I also love their Chicken Katsu and Chicken Cutlet w/ Gravy. It is so great that all of their regular combination lunch plates automatically come with rice and macaroni salad. What a feast! I always make sure to get a couple of their delicious Grilled Spam Musubi. I just adore those things!", "rating": 4, "date": "2010-12-14"}], "chicken katsu musubi": [{"excerpts": ["I actually wanted a piece of chicken katsu musubi too, but the roomie got me an actual order of chicken katsu instead. ", "This turned out to be better cuz it fed us for two meals. ", "It also came with a generous amount of katsu. ", "I don't like L&L's sauce as it's too sweet, so we just used our own Japanese tonkatsu sauce we have at home. "], "author": "Elena N.", "review": "The roommate was picking up some food next door and asked me if I also wanted some Spam Musubi. Of course, I said yes please! He picked up some food for takeout last Monday, April 9th.\n\n*Kalua Pork w/Cabbage: Smoke-flavored, shredded pork slowly roasted and mixed with cabbage\n*Chicken Katsu: pieces of boneless chicken coated with special seasoning and deep-fried, served with special L & L Hawaiian Barbecue Chicken Katsu sauce\n*Musubi: A block of rice with Spam, wrapped in flavored, dry seaweed\n\nI really like the spam musubi from L&L. It's a good ratio of rice to spam and it's always so flavorful. I actually wanted a piece of chicken katsu musubi too, but the roomie got me an actual order of chicken katsu instead. This turned out to be better cuz it fed us for two meals. It also came with a generous amount of katsu. I don't like L&L's sauce as it's too sweet, so we just used our own Japanese tonkatsu sauce we have at home. The roomie got himself a kalua pork plate. I didn't eat much of it, but I did steal some of his macaroni salad. I love a good macaroni salad mixed with sriracha.\n\nSolid and consistent Hawaiian food. I love their Spam musubi!", "rating": 4, "date": "2016-05-15"}, {"excerpts": ["i ordered spam musubi, chicken katsu musubi, side of mac salad and a guava soda.\n\n"], "author": "Diana C.", "review": "i ordered spam musubi, chicken katsu musubi, side of mac salad and a guava soda.\n\ni was on the pot for about 30 minutes afterwards praying to god my boss won't yell at me for having a super long lunch break.\n\nbut damnit to hell if im gonna let one bad case of food poisoning stop me from eating spam musubi again.\n\ni will be back\nin about 2 weeks\nafter work\n\njust in cases", "rating": 3, "date": "2008-02-07"}], "hawaiian bbq chicken musubi": [], "portuguese sausage musubi": [{"excerpts": ["and I had the chicken katsu, BBQ chicken, kalua pork and cabbage, spam musubi, and Portuguese sausage musubi. ", "(This was between two visits.) ", "Overall, the food was good - fairly standard Hawaiian plate lunch. ", "We both enjoyed what we had. ", "I wasn't as big of a fan of the spam musubi, but it was more of a preference thing. "], "author": "Sarah F.", "review": "There isn't much Hawaiian food on the other coast, so whenever I travel I always look for it. Overall, I've found L&L to be a reliable source to fulfill this Hawaiian food craving. This L&L was just as reliable as the others.\n\nMy travel partner and I had the chicken katsu, BBQ chicken, kalua pork and cabbage, spam musubi, and Portuguese sausage musubi. (This was between two visits.) Overall, the food was good - fairly standard Hawaiian plate lunch. We both enjoyed what we had. I wasn't as big of a fan of the spam musubi, but it was more of a preference thing. There was added shoyu or teriyaki sauce on the rice and I prefer something plain.\n\nUnless you're the Rock, or want leftovers a mini-plate is a good amount of food. The musubis were on the \"thin\" side.\n\nThe cashiers were friendly, and it was relatively clean. The first time we went we ate at the location and it felt awkward since it's small. The second time we took the food to go.", "rating": 4, "date": "2017-03-24"}, {"excerpts": ["I like the Portuguese sausage musubi.\n\n"], "author": "Luis C.", "review": "The food is okay. They cook to order, so there's usually a wait during lunch time. It's a nice option for a cheap lunch in downtown SF, you get freshly-made hot food that's inexpensive, instead of cold sandwiches or salads, or lukewarm food that's been sitting for hours. Not a good place if you want to lower your calorie intake. The space is small, with only a few counter seats, so most orders are to go.\n\nThe BBQ chicken is good. The fried foods, short ribs, Kalua pork, saimin, and burgers are okay. I like the Portuguese sausage musubi.\n\nOne amusing thing I find are the promo posters with the slender Hawaiian girl. If you really were to eat often at this place you wouldn't be able to keep that figure!", "rating": 3, "date": "2008-05-02"}], "bbq chicken bowl": [], "chicken katsu bowl": [], "bbq beef bowl": [], "fried shrimp plate": [], "shrimp curry plate": [], "fried fish plate": [], "regular garlic shrimp plate": [], "large green salad": [], "french fries with gravy": [], "scoop macaroni salad": [{"excerpts": ["a generous amount of chicken katsu, tartar sauce, katsu sauce, 2 scoops rice, and 1 scoop macaroni salad - $9.45) and a spam musubi (", "as I'd never had one before - $1.99). "], "author": "Rob D.", "review": "Walked by here for about five months, but just came in for the first time today. \n\nOverall verdict: Greasy and will probably contribute to an early death, but omg so tasty.\n\nI had the Seafood Combo with chicken katsu (3 fried shrimp, a mahi mahi filet, a generous amount of chicken katsu, tartar sauce, katsu sauce, 2 scoops rice, and 1 scoop macaroni salad - $9.45) and a spam musubi (as I'd never had one before - $1.99). The fried shrimp was crispy and delicious, the mahi mahi was great, the chicken katsu was great, and the spam musubi was intriguing (but tasty).\n\nOne of the things I often notice on Yelp is that the people say the portions are large, but said reviewers tend to be toothpick-like. I, on the other hand, am cheerfully rotund, so what fills them up usually doesn't fill me up. That said - this filled me up. A lot. \n\nService was a touch on the slow side, but not too bad. The lady at the register was very nice.\n\nI'd definitely come back here. I feel like I got my money's worth, and it was very tasty indeed - the only thing stopping me would be trying not to eat too much fried food that often.", "rating": 4, "date": "2009-03-24"}], "scoop steamed rice": [], "kimchi": [{"excerpts": ["But you are a foodie, you were vegetarian for years, you've never even BEEN to Hawaii and in utereo you were fed kimchi and ", "M&M's!  "], "author": "Amy C.", "review": "I have a confession to make.  I LIKE SPAM (the pink cubed meat kind NOT the \"Grow 6 inches overnight\" kind).  \n\nI know what you're thinking.  But you are a foodie, you were vegetarian for years, you've never even BEEN to Hawaii and in utereo you were fed kimchi and M&M's!  What's up with the love for spam?  \n\nAlas, I do not know the answer to this question.  What I do know, is that when the Spam craving hits me, it cannot be denied and it's time to go to L&L.  \n\nI always get something along with the Spam Musubi (lest I become known to them as that weird Spam Musubi girl), usually the \"mini\" BBQ chicken or the chicken katsu. \"Mini\"?  Pshaw.  Sure if by mini you mean scoop o' rice, scoop o' mac salad and ton o' greasy and/or fried meat!  \n\nMahalo L&L for helping me beat down that spam craving.", "rating": 3, "date": "2007-01-16"}, {"excerpts": ["I also got a side of kimchi ($0.99) - it helped add some flavor, which is sad."], "author": "Leily P.", "review": "Bland and dry - ordered the Kalua Pork (w/Cabbage) plate to go - the pork was really dry and bland. The macaroni salad was okay but only b/c it's drenched in mayonnaise. I also got a side of kimchi ($0.99) - it helped add some flavor, which is sad.", "rating": 1, "date": "2011-12-14"}], "pieces veggie lumpia": [], "pieces pork lumpia": [], "kauai cookies": [], "hawaiian host chocolate": [], "hawaiian kettle chips": [], "seafood combo": [{"excerpts": ["Seafood combo with BBQ short ribs. ", "Yum. ", "$11. ", "And you can ask for 2 scoops of mac and 1 scoop of rice. "], "author": "Angela L.", "review": "WHY is Hawaiian mac salad SOOOO good?! Oh, because it's probably like 1000 calories in that one scoop and so bad for you.\n\nSeafood combo with BBQ short ribs. Yum. $11. And you can ask for 2 scoops of mac and 1 scoop of rice. Instead of 1 mac and 2 rice. \n\nLunch is pretty packed, but was only about a 15 minute wait?", "rating": 4, "date": "2014-09-17"}, {"excerpts": ["I had the Seafood Combo with chicken katsu (3 fried shrimp, a mahi mahi filet, "], "author": "Rob D.", "review": "Walked by here for about five months, but just came in for the first time today. \n\nOverall verdict: Greasy and will probably contribute to an early death, but omg so tasty.\n\nI had the Seafood Combo with chicken katsu (3 fried shrimp, a mahi mahi filet, a generous amount of chicken katsu, tartar sauce, katsu sauce, 2 scoops rice, and 1 scoop macaroni salad - $9.45) and a spam musubi (as I'd never had one before - $1.99). The fried shrimp was crispy and delicious, the mahi mahi was great, the chicken katsu was great, and the spam musubi was intriguing (but tasty).\n\nOne of the things I often notice on Yelp is that the people say the portions are large, but said reviewers tend to be toothpick-like. I, on the other hand, am cheerfully rotund, so what fills them up usually doesn't fill me up. That said - this filled me up. A lot. \n\nService was a touch on the slow side, but not too bad. The lady at the register was very nice.\n\nI'd definitely come back here. I feel like I got my money's worth, and it was very tasty indeed - the only thing stopping me would be trying not to eat too much fried food that often.", "rating": 4, "date": "2009-03-24"}, {"excerpts": ["I ordered the Seafood Combo with BBQ Beef and it was da-bomb!  ", "The beef was tender with delicate flavors of (ginger, soy sauce, garlic)- yummy!  ", "Fried Shrimp, Mani Mahi, rice and Macaroni Salad.  ", "Not bad- ", "actually, it was great!  ", "The serving size is  generous and prices are very reasonable.  ", "I can't wait to try their breakfast foods.  ", "Definitely worth another visit.  ", "By the way, its best to call in an order as it might be a bit of a wait for your food, but worth the wait, indeed!"], "author": "Denny L.", "review": "My first taste with this restaurant came last year at Daly City and then today in downtown.  If you want local style (Hawaiian Barbecue), this is the place to go.  I ordered the Seafood Combo with BBQ Beef and it was da-bomb!  The beef was tender with delicate flavors of (ginger, soy sauce, garlic)- yummy!  Fried Shrimp, Mani Mahi, rice and Macaroni Salad.  Not bad- actually, it was great!  The serving size is  generous and prices are very reasonable.  I can't wait to try their breakfast foods.  Definitely worth another visit.  By the way, its best to call in an order as it might be a bit of a wait for your food, but worth the wait, indeed!", "rating": 4, "date": "2006-01-31"}], "seafood platter": [], "bbq mix": [{"excerpts": ["I had the BBQ mix "], "author": "Tyler T.", "review": "The place is a bit tiny, but there are seats available along the counters along the sides of the restaurant. The food is fairly priced, and they do take credit cards.\n\nThe portion sizes were not as big as I am used to in other Haiwaiian BBQ places I have been to. The mini scoops really are mini sized, and the meat doesn't taste all that great.\n\nFor example, in other places I have been, the meat has a nice BBQ taste to it, and a good flavor and texture. Here, it just kind of tastes like it's been sitting in the marinade and then kind of cooked but not really grilled that well. \n\nI had the BBQ mix so I had a bit of every meat, ranging from the rather dry bulgogi, to the not-so-great chicken teriyaki, to the somewhat acceptable short rib.\n\nOverall a pass and I wouldn't really come back here again, though the prices are reasonable for the area, at about $10 for that plate.", "rating": 3, "date": "2017-12-31"}, {"excerpts": ["ORDERED BBQ mix plate with macaroni salad and white rice, mini mini chicken katsu plate, and grilled spam musubi.\n\n"], "author": "Nicholas G.", "review": "Portion sizes here are HUGE. You definitely get the bang for your buck. I walk looking for Hawaiian here in the city, and was surprised to find this spot tucked away downtown.\n\nAMBIANCE is nothing impressive, but they had an extensive menu outlining food options and cost alongthe wall (see photos). There are only a few seats inside. Nobody was there when my partner and I arrived, but a few people came in after we did and had to get creative. \n\nORDERED BBQ mix plate with macaroni salad and white rice, mini mini chicken katsu plate, and grilled spam musubi.\n\nFOOD was bomb. I ended up ordering so much I couldn't finish (which for me is a feat). The beef was well cooked and marinated, the katsu had a fresh and delicious crunch (and a good portion for a mini plate), and the spam musubi was a tasty first for me. Highly recommend the options above.\n\nRATING is a fantastic four. It takes a little while to get the food, but you'll realize it's worth the wait.", "rating": 4, "date": "2017-12-07"}, {"excerpts": ["The bbq mix plate had no taste.  ", "The chicken, short ribs, and teriyaki did not taste like they were marinated at all.  "], "author": "Shevon R.", "review": "I grew up in Hawaii and I've had a lot of L&L.  This one is not great.  The chicken katsu was overcooked and dried out.  The bbq mix plate had no taste.  The chicken, short ribs, and teriyaki did not taste like they were marinated at all.  The place is pretty dirty and the girl behind the counter did not have much of a personality.\n\nIt is so disappointing to eat somewhere and know you could've made it yourself and it would've been better.", "rating": 2, "date": "2017-11-02"}, {"excerpts": ["I ordered the BBQ Mix, you get 1 short rib, 2 pieces of chicken and some teriyaki beef. "], "author": "Kevin L.", "review": "Hawaiian BBQ at a decent price point a few blocks away from Union Square. The restaurant itself doesn't give off the greatest impression when you first walk in, but the food is good. \n\nI ordered the BBQ Mix, you get 1 short rib, 2 pieces of chicken and some teriyaki beef. Usually has a bed of greens below the meat, however I was generously given 3/4 slices of thinly sliced lettuce. \n\nMacaroni salad and rice were good. May have to stick to the chicken katsu or musubi items instead of the BBQ entrees. Otherwise, the food gets the job done for a quick and dirty meal.", "rating": 2, "date": "2017-08-22"}, {"excerpts": ["I've tried their BBQ mix plate which has a little bit of everything. ", "The mac salad is great and I believe it also comes with rice. ", "So yeah, pretty heavy stuff. ", "Which is why I recently started getting the chicken bowl instead. ", "You don't get the variety of meat, but you also don't feel like you're about to have a heart attack after. ", "The chicken is delicious, and the chicken bowl comes with veggies too to make you feel a little better, haha. ", "The spam musubi here is good too! ", "A chicken bowl + spam musubi is the perfect lunch! ", "And prices are very reasonable. ", "Highly recommend!"], "author": "Ashley Y.", "review": "I come here every now and then when I want a heavier lunch. But still within a reasonable price range. The meats here are delicious! I've tried their BBQ mix plate which has a little bit of everything. The mac salad is great and I believe it also comes with rice. So yeah, pretty heavy stuff. Which is why I recently started getting the chicken bowl instead. You don't get the variety of meat, but you also don't feel like you're about to have a heart attack after. The chicken is delicious, and the chicken bowl comes with veggies too to make you feel a little better, haha. The spam musubi here is good too! A chicken bowl + spam musubi is the perfect lunch! And prices are very reasonable. Highly recommend!", "rating": 4, "date": "2017-12-01"}, {"excerpts": ["Was still hungry and ordered their bbq mix. ", "Totally worth it!"], "author": "Gavin T.", "review": "Stumbled on this little shop after having ramen at ramen underground. Was still hungry and ordered their bbq mix. Totally worth it!", "rating": 4, "date": "2016-11-28"}, {"excerpts": ["I got the BBQ mix plate ", "so I could get a little chicken, short rib and beef. ", "Not much seating inside, a few stools but nothing more. ", "Get the teriyaki sauce at smother everything in it. ", "It's the right mix of sweet and tangy. ", "You also get a choice of white or brown rice as well as macaroni salad on the side. ", "A very well balanced meal that left me really full and satisfied for the rest of the day."], "author": "Jeromy G.", "review": "I like this L&L location. I am aware that this is a chain restaurant and not 100% authentic, but I had a good experience here. \n\nFirst let's address the fact that the cashier says \"aloha\" and \"mahalo\" to each customer who orders. Keeping up with the theme, I dig it. I love the flowery Hawaiian shirts as well. It's the little things.\n\nNot only do they play the right part, the food comes out fast as well. Most L&L's will have slow turn around but this location was built for the fast paced city at lunch time. Got my food in under 10 mins. Good for when you don't have time to waste at lunch.\n\nI always get a combination plate because I can never choose just one meat entree. I got the BBQ mix plate so I could get a little chicken, short rib and beef. Not much seating inside, a few stools but nothing more. Get the teriyaki sauce at smother everything in it. It's the right mix of sweet and tangy. You also get a choice of white or brown rice as well as macaroni salad on the side. A very well balanced meal that left me really full and satisfied for the rest of the day.", "rating": 4, "date": "2015-11-18"}, {"excerpts": ["L&L Hawaiian BBQ Mix\nHawaiian BBQ Beef\nHawaiian BBQ Short Ribs\nHawaiian BBQ Chicken (so tasty)\nChicken Katsu\n\n"], "author": "Monalisa M.", "review": "Local spot. Quick pick up. Fresh hawaiian BBQ. Small shop if you don't look closely, you'll pass it. But it's good BBQ meats when you're craving BBQ - right down the street.\n\nL&L Hawaiian BBQ Mix\nHawaiian BBQ Beef\nHawaiian BBQ Short Ribs\nHawaiian BBQ Chicken (so tasty)\nChicken Katsu\n\nMUST HAVE: Musubi - A block of rice with your choice of meat, wrapped in flavored, dry seaweed. Available with spam, Portuguese sausage, chicken katsu, or barbecue chicken. A local favorite!", "rating": 3, "date": "2011-09-10"}, {"excerpts": ["I get the BBQ mix. ", "As can be expected, I'm trying not to pass out at work since I'm slowly falling into a food coma from all that delicious goodness. ", "They're a reliable place for lunch, and they are even open on the weekends (which is amazing considering that it is in FiDi). ", "The service is always friendly and even spunky. ", "I will be coming back."], "author": "Katia T.", "review": "This place is usually 50-50 for me. I've come here and had great food...and then I've been there and the food was burned to a crisp. Went today, and had a pretty awesome lunch. I get the BBQ mix. As can be expected, I'm trying not to pass out at work since I'm slowly falling into a food coma from all that delicious goodness. They're a reliable place for lunch, and they are even open on the weekends (which is amazing considering that it is in FiDi). The service is always friendly and even spunky. I will be coming back.", "rating": 3, "date": "2011-05-26"}, {"excerpts": ["If you like to grub in a similar way, get down there and hook up a BBQ mix plate, some chicken katsu, or some loco moco. ", "Now, L & L isn't the greatest Hawaiian food (if you want something more upscale hit up Hukilau or Punehele Island if it's still around), however, if you want a quick, pretty cheap option to satisfy your Hawaiian food craving you will leave happy."], "author": "Russ T.", "review": "I love Hawaiian food. I could eat plate lunches every day and spam musubi is one of my favorite things to snack on. If you like to grub in a similar way, get down there and hook up a BBQ mix plate, some chicken katsu, or some loco moco. Now, L & L isn't the greatest Hawaiian food (if you want something more upscale hit up Hukilau or Punehele Island if it's still around), however, if you want a quick, pretty cheap option to satisfy your Hawaiian food craving you will leave happy.", "rating": 4, "date": "2006-01-21"}], "kalua lau lau combo": [], "low carb plate": [{"excerpts": ["For healthier options, I really enjoy the Low Carb Plate and Regular Chicken Salad with a side of Fried Eggs or sometimes I get the salad with veggie patties, which are pretty good. ", "The others in the office enjoy the Spam Musubi and Ramen Burger which is not healthy but looks and tastes delicious. ", "On a cold day, I like their Saimen Soup Noodles. ", "Chain food can be good!"], "author": "Jen L.", "review": "They have really friendly service and the food is good. My colleagues love their plate options including the Fried Seafood and Chicken plate with Mac. For healthier options, I really enjoy the Low Carb Plate and Regular Chicken Salad with a side of Fried Eggs or sometimes I get the salad with veggie patties, which are pretty good. The others in the office enjoy the Spam Musubi and Ramen Burger which is not healthy but looks and tastes delicious. On a cold day, I like their Saimen Soup Noodles. Chain food can be good!", "rating": 5, "date": "2015-12-22"}], "half and half plate": [], "volcano chicken sandwich": [], "volcano jumbo chicken wing meal": [], "side order volcano jumbo chicken wing": []}