{"canned soft drinks": [], "mexican coke": [{"excerpts": ["I got a super burrito with carne asada (no sour cream), a small cream-filled churro, and a Mexican Coke. ", "The burrito was amazing!! ", "It was an awesome replacement for El Farolito and I almost ate it all in one sitting. ", "I'm very picky about burritos and it's hard to please me in this area. ", "Most of the time, burritos can be too dry or have too much of a filler in it. "], "author": "Karen R.", "review": "I'll be honest and say I only came here because I was too lazy to go to the ATM to get cash for El Farolito and it was too crowded there anyway. This was my first time and I was very happy with my experience. I got a super burrito with carne asada (no sour cream), a small cream-filled churro, and a Mexican Coke. The burrito was amazing!! It was an awesome replacement for El Farolito and I almost ate it all in one sitting. I'm very picky about burritos and it's hard to please me in this area. Most of the time, burritos can be too dry or have too much of a filler in it. Their burrito had the perfect amount of ingredients and everything tasted fresh and was seasoned well.\n\nThe only disappointment was the churro. It was too crunchy for my liking and didn't seem very fresh. It almost seemed stale to me? Maybe I'm just spoiled by the Churros Mexicanos cart in Fruitvale... But El Corneta's churro relleno did not meet my expectations.\n\nI was also very happy with the service here. The two young ladies who helped me were very attentive even though they seemed swamped with orders. The lady who ordered before me was rude to them and almost ran out with MY burrito because she wouldn't listen to what they were saying. Some of y'all customers need to chill and be more respectful to workers. Thankfully, they were able to stop her from running away with my burrito. \n\nI have no idea why some people are saying this taqueria is cash only. They accept cards too! Also, this place is very spacious and there's A/C. It's the perfect place to get lunch in the summer if you're in the area.", "rating": 4, "date": "2016-07-05"}, {"excerpts": ["I had my first Mexican Coke here 13 years ago and have been addicted to it."], "author": "N A.", "review": "This place is a legend in the mission the ingredients are always fresh and food is seasoned very well. They're also generous with chips and salsa I had my first Mexican Coke here 13 years ago and have been addicted to it.", "rating": 5, "date": "2016-12-20"}, {"excerpts": ["I paid almost $28 for 3 carnitas tacos, a veggie burrito, a mexican coke and arizona ice tea. ", "How was it this much, you might wonder??\n", "The tacos were $3.00 each so a total of $9.00. ", "Veggie burrito was $3.45. ", "Drinks were $1.50 and $1.05, fine there. ", "But the guy at the cash register charged me for an extra THREE carnitas tacos!  ", "So I paid an extra $9.00 for ghost tacos. ", "I didn't question it at the time because again, no prices posted on the menu board. ", "If there are prices on the board, you cannot see them with the naked eye. ", "That and you'd have to be behind the counter to see it. ", "But I really don't remember seeing the prices. ", "My girl friend paid $30 for a burrito and a combo plate and two drinks. ", "She thought it was ridiculously high too, but we figured it was due to the fact that the place was big (this is SF, rent must be expensive) and live entertainment. ", "I didnt' realize till later that evening that we got ripped off. ", "And this happened to my sister's boyfriend, in another instance. ", "He said he got charged for two burritos when he only got one. ", "He got the run around at the restaurant when he brought the error up (\"My supervisor isn't available, you will have to wait for him\" and he did wait), but eventually got his money back. ", "I would've gone back ", "but I live in Sacramento, and didn't want to pay the $5 bay bridge toll + gas to drive out there again to make a point there. ", "So this is why I'm posting it on Yelp. ", "If you go to La Corneta Taqueria, make sure you pay attention to what they are charging you, and if it seems abnormally high, question them on what each item costs. ", "I think its EXTREMELY shady to have a menu board that does not post their prices. ", "All the more room for them to overcharge you. ", "Not going there again."], "author": "Jasmine M.", "review": "Our group of 5 friends stumbled into this place Saturday 1/22/11 for lunch because a lot of the other restaurants around the Mission area did not have enough seating (we originally wanted to eat at Mr Pollo, but that place was TINY and no outdoor seating available). Its a beautiful restaurant, very clean (including the restrooms), ample seating, and nice music from a live band. \nThe food itself was OK...my carnitas tacos were bland, despite the big portions. My friends enjoyed their burritos and plates. But the HORRIBLE thing about this place is that (1) They don't post their prices on their menu board, which (2) led us to be overcharged. I paid almost $28 for 3 carnitas tacos, a veggie burrito, a mexican coke and arizona ice tea. How was it this much, you might wonder??\nThe tacos were $3.00 each so a total of $9.00. Veggie burrito was $3.45. Drinks were $1.50 and $1.05, fine there. But the guy at the cash register charged me for an extra THREE carnitas tacos!  So I paid an extra $9.00 for ghost tacos. I didn't question it at the time because again, no prices posted on the menu board. If there are prices on the board, you cannot see them with the naked eye. That and you'd have to be behind the counter to see it. But I really don't remember seeing the prices. My girl friend paid $30 for a burrito and a combo plate and two drinks. She thought it was ridiculously high too, but we figured it was due to the fact that the place was big (this is SF, rent must be expensive) and live entertainment. I didnt' realize till later that evening that we got ripped off. And this happened to my sister's boyfriend, in another instance. He said he got charged for two burritos when he only got one. He got the run around at the restaurant when he brought the error up (\"My supervisor isn't available, you will have to wait for him\" and he did wait), but eventually got his money back. I would've gone back but I live in Sacramento, and didn't want to pay the $5 bay bridge toll + gas to drive out there again to make a point there. So this is why I'm posting it on Yelp. If you go to La Corneta Taqueria, make sure you pay attention to what they are charging you, and if it seems abnormally high, question them on what each item costs. I think its EXTREMELY shady to have a menu board that does not post their prices. All the more room for them to overcharge you. Not going there again.", "rating": 2, "date": "2011-01-24"}, {"excerpts": ["They get points for having Mexican Coke and being about the right price. ", "I had a fish (salmon burrito) and it was pretty lackluster. ", "The fish was okay-to-tasteless and the rest of the burrito was dry. ", "I know purists will disagree, but I could have gotten a tastier burrito at Chipotle for cheaper. ", "I've certainly had better burritos in the Mission for cheaper, at any rate."], "author": "Adam D.", "review": "My roommate and I went here to meet up with an old friend from college. They get points for having Mexican Coke and being about the right price. I had a fish (salmon burrito) and it was pretty lackluster. The fish was okay-to-tasteless and the rest of the burrito was dry. I know purists will disagree, but I could have gotten a tastier burrito at Chipotle for cheaper. I've certainly had better burritos in the Mission for cheaper, at any rate.", "rating": 3, "date": "2009-07-07"}], "jarritos": [], "sangria": [{"excerpts": ["\"  I highly recommend the Sangria and the Mojitos the provided on the house. ", "Overall experienced was excellent and I will continue to have my events here."], "author": "Libby D.", "review": "This is my second event held here at La Corneta on 24th and Mission (first time was dinner this time was lunch) and the service has been excellent. The food was great and served the plate presentation was very nice, the set up was nice and prepped ahead of time with \"reserved tabs\" the staff was ready and attentive so everything arrived fast. The manager was regularly checking on us to make sure we were pleased and \"hydrated\"  I highly recommend the Sangria and the Mojitos the provided on the house. Overall experienced was excellent and I will continue to have my events here.", "rating": 5, "date": "2016-06-05"}, {"excerpts": ["They will then offer you a small glass of sangria as a starter, with the usual guacamole and salsa. \n\n"], "author": "Laetitia L.", "review": "Whenever I come to SF, I always make sure I stop by one of those great Mexican taquerias, something we don't really find in France. \n\nI asked one of my friends, Karina K., a fellow Yelper who lived in SF for years, and she recommended La Corneta. I have to say I wasn't disappointed at all. \n\nThe place is pretty big so you should find plenty of space for your lunch. You can either order from the counter for takeaways or sit down and wait for the friendly waitress to take your order. They will then offer you a small glass of sangria as a starter, with the usual guacamole and salsa. \n\nI was slightly afraid of the size of the real burritos for a light lunch so I went for the baby burrito. It was delicious and already huge so I'm glad I went for that. \nMy friend had chicken quesadillas, which were also really good. On the top of that, there was a group of musicians playing traditional Mexican music. \n\nThe only downside : the cleanliness. When I went in the restrooms, they were really dirty, probably because of dirty customers to start with, but not only. The tables themselves were not 100% clean either. Maybe I went there on the wrong day. This is too bad as everything else was really nice.", "rating": 4, "date": "2013-09-04"}, {"excerpts": ["try there salmon tacos ,there sangria ,yes to mention few things, everything it's amazing."], "author": "Maria S.", "review": "this has is one off my favorite places in San Francisco ca. great food ,wonderful drinks ,\nExcellent service .  try there salmon tacos ,there sangria ,yes to mention few things, everything it's amazing.", "rating": 5, "date": "2015-11-14"}, {"excerpts": ["Got bottled water and sangria tablesisde, on behalf of the management. ", "They were muy excellente! ", "I will be back without a doubt !"], "author": "Jamila C.", "review": "Management really made sure I ENJOYE my first time here. The portions are great, the options are versatile, and everything tastes great. Got bottled water and sangria tablesisde, on behalf of the management. They were muy excellente! I will be back without a doubt !", "rating": 5, "date": "2012-08-05"}, {"excerpts": ["Try the Sangria for a special treat."], "author": "Tom P.", "review": "Great service, great food and good people. If you like authentic then you'll like this place!  Try the Sangria for a special treat.", "rating": 5, "date": "2015-01-25"}, {"excerpts": ["our Sangria refilled?   ", "I think maybe he works there ", "or he's the manager or the owner?    ", "Our lunch here was a great experience today on a Easter sunday."], "author": "Tony W.", "review": "My friends and I was not expecting this.   Live music and singing.  The waitress service was excellent and was very attentative to us.   Then a guy from a table next to us refilled our nacho for us and ask if we like our Sangria refilled?   I think maybe he works there or he's the manager or the owner?    Our lunch here was a great experience today on a Easter sunday.", "rating": 5, "date": "2013-03-31"}, {"excerpts": ["The sangria is tasty as well. ", "IT was clean and suprisingly full."], "author": "Ayana K.", "review": "Heard about the baby burritos on here. I wanted to try it out because i can never finish a regular burrito. I really liked this place. Got the super baby chicken burrito. It was flavorful and bigger than I thought. The sangria is tasty as well. IT was clean and suprisingly full.", "rating": 4, "date": "2012-07-01"}, {"excerpts": ["for there DELICIOUS SANGRIA ", "but that is all."], "author": "Claudia R.", "review": "My boyfriend and i have been to this spot 3 times our first time there was very nice the food was fresh and tasty and we even had a lady come over to our table and sing a couple songs. the 2nd time there was ok my chicken was a little under cooked but i didn't have a complaint about anything else. My boyfriends brother on the other hand found a hair in his nachos and was discusted. Now my 3rd time there was yesterday we all went in around lunch time and ordered there Cesar salad that's topped with yummy grilled chicken. well apparently they do not wash the lettuce they buy because we found a black beatle in my boyfriends mothers salad and it was still alive! uughh! we had all ordered a salad so we told the waiter that we did not want anything anymore. This place is nice and the chicken is good but if they do not wash there lettuce it makes me question just how careful they are about handling the rest of the food. i give them 1 star for having good grilled chicken and for there DELICIOUS SANGRIA but that is all.", "rating": 1, "date": "2010-08-23"}, {"excerpts": [", there Sangria is good. ", "I'm not too sure if they have more drink options.. ", "anyway, there prices are really good, and give you lots of food.. "], "author": "Mariana O.", "review": "I LOVE comming here, one of my favorite places, I always get there grilled chicken supper burrito, with spinach tortilla, really good.. I'm not sure about there drink menu, but where they have there sodas and other drinks, they have few options for beers, there Sangria is good. I'm not too sure if they have more drink options.. anyway, there prices are really good, and give you lots of food.. a supper baby burrito would be probably around $6.75 or so, a regular around $7 maybe 8.. they do have a band that plays there almost every few days, or every other day.. they have there own desserts, lots of food choices, different meats, there veggiterian burrito is also VERY good.. they know how to stuff a burrito, lol.. this would be one of my main places to come to if I want Mexican food...", "rating": 5, "date": "2011-06-02"}, {"excerpts": ["(baby=smaller portion, and super=comes w/everything) and a bottle of sangria (even though it was non-alcoholic, it was was HELLA GOOD).  ", "the meal was perfect, i savored every bite of that burrito. "], "author": "Jennie L.", "review": "so yesterday after our belly dance class ended in the mission, we looked for a place to eat. there were taquerias on EVERY corner, so it was hard to decide on a place. we first passed on la corneta after seeing a sign on the door saying \"HOMOCIDE INFORMATION NEEDED, CALL POLICE.\" -we're like \"shit, i don't wanna get shot just tryna get a burrito!\" so we kept walking.... then 5 minutes later nothing else looked good so we turned around and went into la corneta, for some reason.\n\ni was looking on the menu at the burritos and saw they had baby burritos, and super baby burritos..\n\nme: oh shit, they have \"baby burritos\"! i wonder what the difference between that and a \"super baby burrito\" is??\nfriend: maybe it has a red cape attached to it.\nme: [blank face, trying to think..] *3 secs later*... OHHHH!! HAHAHAHHA. cuz its SUPER!!! AHHAHAHA\n\ni'm slow at getting jokes. and being starving made me 10 times even slower. so anyways i ordered a 'super baby burrito with chicken and no beans' (baby=smaller portion, and super=comes w/everything) and a bottle of sangria (even though it was non-alcoholic, it was was HELLA GOOD).  the meal was perfect, i savored every bite of that burrito. and before i left, i even got a churro to go for later :)\n\nin addition, the atmosphere was awesome -- they had a live bossanova band playing, and the high ceiling sun roof w/the little balconies with flowers on the walls made it seem like we were eating outdoors. a great place for families and cute for couples on a date ;) *hint hint*, i loooooove mexican food now! hahahah jk \n\n\np.s., don't let the homocide sign deter you from eating here, the food is reaaally good!!! :D", "rating": 5, "date": "2007-12-02"}, {"excerpts": ["PLUS a sample of sangria.  ", "Everything was yummy (", "so far)....", "then,  I ordered tamales and ended up not liking them because they did not taste like the ones I had in Mexico, and they tasted really bland.  ", "Though I did not complain, I didn't end up eating much of my food.  ", "A few minutes later, the owner came to apologize for the fact that they didn't cook their tamales right.  ", "He told me that he would change the way they cook them next time, and they would definitely be better.  ", "And somehow, I felt being treated like a family member instead of a customer.   ", "I got the feeling that the owner really did care about the customers and his food more than just his business.  ", "My gut feeling was right on, especially when it came to check time.  "], "author": "Numrin T.", "review": "I am not a big fan of mexican food, but somehow I got drawn into this place by the sound from the band (they happened to have live music that night, which was very very good), the smell of freshly cooked meat, and the very bright and warm atmosphere, especially when it was wet, cold and dark out.\n\nDefinitely five stars for the service.  As soon as I sat down, I got served warm crunchy tortilla chips with fried beans, guacamole, and fresh salsa...PLUS a sample of sangria.  Everything was yummy (so far)....then,  I ordered tamales and ended up not liking them because they did not taste like the ones I had in Mexico, and they tasted really bland.  Though I did not complain, I didn't end up eating much of my food.  A few minutes later, the owner came to apologize for the fact that they didn't cook their tamales right.  He told me that he would change the way they cook them next time, and they would definitely be better.  And somehow, I felt being treated like a family member instead of a customer.   I got the feeling that the owner really did care about the customers and his food more than just his business.  My gut feeling was right on, especially when it came to check time.  I realized that I wasn't charged for the tamales, though I insisted in paying for my food.  \n\nSometimes, it's nice to know that there are some compassion and care out there in this world.", "rating": 3, "date": "2010-10-24"}, {"excerpts": ["You have to try their Sangria, it is one of the best ones I've ever had. "], "author": "Diana N.", "review": "FRESH FRESH!\n\nI love the food, decor, cute ladies behind the bar...!!! You have to try their Sangria, it is one of the best ones I've ever had. Their prawn tacos are soooooooo good.\n\nParking sux but do you really expect to find parking in the mission?!?\nService was awesome! I will dftly be coming back to try their quesadillas!", "rating": 5, "date": "2009-09-21"}, {"excerpts": ["Sangria was GREAT!  ", "Lots of locals eat there.  ", "Food was very good.  ", "Great Music. ", "(live band).  ", "Plenty of room.  ", "Try it, you'll like it."], "author": "Kerry L.", "review": "Sangria was GREAT!  Lots of locals eat there.  Food was very good.  Great Music. (live band).  Plenty of room.  Try it, you'll like it.", "rating": 4, "date": "2010-11-02"}, {"excerpts": ["Holy Shit their sangria is off the hook, fresh fruit inside a glass of wine that is aged, is was unbelievable! ", "We walked in here last saturday after our photo shoot for our album and i was welcomed with smiles, great smelling food and great service. ", "The woman working the register is gorgeous by the way ", "and she is very effecient with her work. ", "Give her a raise folks! ", "I had gotten a super burrito with pastor and it was flavorful, fresh and filling and those are my 3 f's that i do not use often.  ", "Even though this was not the best burrito i have ever had in my whole life, it's fo sho up there! ", "I have been going to la corneta since the location in diamond first opened and this place is just as good and one of the best spots in mission. ", "La Altena is still the best on mission tho for just a burrito ", "but you have to go after 8 pm when the good cooks there. ", "Here at la corneta, you get the works of great things, like very clean restrooms, great service and the best sangria! ", "for that i will give more business and better rankings to LA CORNETA!"], "author": "supa m.", "review": "Holy Shit their sangria is off the hook, fresh fruit inside a glass of wine that is aged, is was unbelievable! We walked in here last saturday after our photo shoot for our album and i was welcomed with smiles, great smelling food and great service. The woman working the register is gorgeous by the way and she is very effecient with her work. Give her a raise folks! I had gotten a super burrito with pastor and it was flavorful, fresh and filling and those are my 3 f's that i do not use often.  Even though this was not the best burrito i have ever had in my whole life, it's fo sho up there! I have been going to la corneta since the location in diamond first opened and this place is just as good and one of the best spots in mission. La Altena is still the best on mission tho for just a burrito but you have to go after 8 pm when the good cooks there. Here at la corneta, you get the works of great things, like very clean restrooms, great service and the best sangria! for that i will give more business and better rankings to LA CORNETA!", "rating": 4, "date": "2010-02-02"}], "calistoga": [], "bottled apple juice": [], "aguas frescas": [{"excerpts": ["Whether it's the lack of salt in the guacamole, the lack of a legitimately spicy sauce in the \"picante\" super burrito, or the lack of ice in otherwise warm aguas frescas, it really seems like the place is half-a**ing things.\n\n"], "author": "Sergio G.", "review": "Everything here seems to be missing something. Whether it's the lack of salt in the guacamole, the lack of a legitimately spicy sauce in the \"picante\" super burrito, or the lack of ice in otherwise warm aguas frescas, it really seems like the place is half-a**ing things.\n\nI actually saw one of the ladies here place a plate of chicken in the microwave to serve someone.\n\nI guess gentrification isn't just affecting housing...", "rating": 1, "date": "2017-01-14"}, {"excerpts": ["Incredible menu, excellent choices of aguas frescas. ", "It's a place to eat well for cheap. ", "Beautiful murals on the walls as well."], "author": "Justin M.", "review": "Best burritos in San Francisco. Incredible menu, excellent choices of aguas frescas. It's a place to eat well for cheap. Beautiful murals on the walls as well.", "rating": 5, "date": "2015-09-08"}, {"excerpts": ["if you like aguas frescas then you should definitely order an horchatta grande.\n", "so good and always fresh and clean.\n", "my personal favorite in the mission."], "author": "Austin L.", "review": "la corneta is the best!\nthe food is always excellent and the atmosphere is vibrant.\ni love the crispy tacos and my wife always gets a super veggie burrito with black beans.\nthe nachos are also another family favorite.\nif you like aguas frescas then you should definitely order an horchatta grande.\nso good and always fresh and clean.\nmy personal favorite in the mission.", "rating": 5, "date": "2015-07-30"}, {"excerpts": ["Aguas frescas are too diluted with ice.  ", "Chips need some salting.  ", "No self-serve condiment bar.   ", "I only get burritos 'to go' here.  ", "They overwrap their burritos with foil (can mean unskilled composition and formation - loose burrito) and don't give you the plate and silverware necessary to really hunker down and do sloppy, carnivorous surgery and full-on salsa soaking."], "author": "Esther R.", "review": "Delicious super baby burrito in clean, bright surroundings with lots of tables.  This is what El Toro used to be like back in the day...  except I could actually inhale a full size super burrito and the super baby option didn't exist.\n\nApart from the burritos and the environment, which are big pluses in my book, I have a lot of unfulfilled expectations.  Aguas frescas are too diluted with ice.  Chips need some salting.  No self-serve condiment bar.   I only get burritos 'to go' here.  They overwrap their burritos with foil (can mean unskilled composition and formation - loose burrito) and don't give you the plate and silverware necessary to really hunker down and do sloppy, carnivorous surgery and full-on salsa soaking.", "rating": 4, "date": "2007-04-16"}], "fresh squeezed juices": [], "domestic": [], "importedpremium": [], "draft": [{"excerpts": ["They also have beer on draft along with bottled choices and the horchata is tops! ", "Very spacious inside with awesome murals and decor. ", "I feel like I'm in Guadalajara."], "author": "Sally M.", "review": "I've eaten here more times than I can remember. Their guacamole salsa is so good. I pour it on everything. Free chips with salsa with orders and they ask you if you want hot or mild. I'm in love with their tacos al pastor, lengua burritos, mushroom quesadillas but their chile relleno looks battered just like my mom used to make so I'm keen to try that. They also have beer on draft along with bottled choices and the horchata is tops! Very spacious inside with awesome murals and decor. I feel like I'm in Guadalajara.", "rating": 4, "date": "2017-03-15"}], "steak caesar salad": [], "chicken corneta salad": [], "taco with cheese": [], "taco with guacamole": [], "prawn taco": [{"excerpts": ["The prawn taco kicks ass.  ", "Nice size prawns, grilled to order, seasoned to perfection, juicy and delicious.  ", "I love the baby bean burrito.  ", "The refried beans are really good and simple. ", "Perfect serving, perfect flavor.  "], "author": "Jen C.", "review": "Years later I still like this place, although the quality it's a bit inconsistent. One night was perfect and the following afternoon was less perfect.  The prawn taco kicks ass.  Nice size prawns, grilled to order, seasoned to perfection, juicy and delicious.  I love the baby bean burrito.  The refried beans are really good and simple. Perfect serving, perfect flavor.  I had fresh carrot juice (20oz) for cheap.  \n\nOne thing I don't like is that you sort of have to advocate for your condiments and toppings.  They aren't offered to you, if you don't ask (limes and cilantro for example).", "rating": 4, "date": "2011-08-12"}, {"excerpts": ["-- I'm a prawn baby burrito or prawn taco girl."], "author": "Amy E.", "review": "I'm giving La Corneta a 5 because it must be pretty good for me to eat there 1-3 times per week.  I work  2 blocks away and it's the most reliably tasty and fast place I go.  Almost always, the tacos and burritos are great -- I'm a prawn baby burrito or prawn taco girl.", "rating": 5, "date": "2009-02-14"}, {"excerpts": ["The prawn taco is awesome (note: not the Super Prawn, which is just piled with unnecessary, distracting embellishments).  ", "The asada and al pastor are good, too.  ", "They are generous with the meat.  ", "Two tacos are usually enough for my appetite, although I always order more, knowing that once I'm back in Seattle l won't be finding anything quite the same."], "author": "Jon C.", "review": "I stop by here, usually repeatedly, whenever I'm in San Francisco.  The prawn taco is awesome (note: not the Super Prawn, which is just piled with unnecessary, distracting embellishments).  The asada and al pastor are good, too.  They are generous with the meat.  Two tacos are usually enough for my appetite, although I always order more, knowing that once I'm back in Seattle l won't be finding anything quite the same.", "rating": 4, "date": "2009-01-30"}], "super prawn taco": [], "super fish taco": [{"excerpts": ["However I liked the followings,\n\nSuper Fish Taco.\n"], "author": "Hasan A.", "review": "Best Mexican Food, Cool Live Latin Music and Super Cool Atmosphere are the best reasons why I chose La Corneta as my everyday Lunch place. \n\nThe people work there are very friendly and cordial.\n\nThere are many different Dishes to choose from, However I liked the followings,\n\nSuper Fish Taco.\nSuper Prawn Burrito.\nSuper Chicken Burrito.\nShrimp & Carne Asada  Burrito.\nChicken Casadilla.\n\nSi Te Gusta La Corneta, Llégale !!!!!!", "rating": 5, "date": "2012-11-05"}], "rice and beans taco": [], "super vegetarian taco": [], "regular crispy taco": [], "super crispy taco": [], "regular nachos": [{"excerpts": ["Second time I ordered regular nachos with chips, beans, cheese and salsa. ", "Overall, satisfying experience, good food and good service."], "author": "Bennett W.", "review": "La Corneta Taqueria is one of the best restaurants for Mexican food. I have eaten here twice. First time, I ordered a regular burrito with meat beans, rice and salsa at their Glen Park location. Second time I ordered regular nachos with chips, beans, cheese and salsa. Overall, satisfying experience, good food and good service.", "rating": 5, "date": "2011-04-10"}, {"excerpts": ["My oder is usually \"regular nachos, no beans, with carnitas\" sometimes I'll add avacado or guacamole and chicken instead of carnitas."], "author": "Henry C.", "review": "The carne asada is ok\nThe grilled chicken is better then most in SF\nThe Carnitas is quite good \n\nIf you order a \"fish\" taco, burrito, quesadilla ... the fish will be Salmon.\n\nI think there specialty is fish and shrimp entrees. They also add mushrooms to a lot of entrees. \n\nMy oder is usually \"regular nachos, no beans, with carnitas\" sometimes I'll add avacado or guacamole and chicken instead of carnitas.", "rating": 4, "date": "2008-11-25"}], "nachos with meat": [], "super vegetarian": [{"excerpts": ["We had a super vegetarian burrito and some chips and guacamole. ", "Friendly, fast, and clean!!!!"], "author": "Amy G.", "review": "Delicious ! Just brought our group of 13 Girl Scouts to have lunch based on a local's tip! \nSo glad we followed her lead. \nWe had a super vegetarian burrito and some chips and guacamole. Friendly, fast, and clean!!!!", "rating": 5, "date": "2018-05-16"}, {"excerpts": ["I got the super vegetarian burrito without cheese so basically vegan!! ", "And it was so delicious so yummy!!!! ", "5/5 stars yes!!!! ", "So affordable $6.50 with guac so like half of the cost of chipotle. ", "I am so happy"], "author": "Audrey K.", "review": "So so yummy!!! I got the super vegetarian burrito without cheese so basically vegan!! And it was so delicious so yummy!!!! 5/5 stars yes!!!! So affordable $6.50 with guac so like half of the cost of chipotle. I am so happy", "rating": 5, "date": "2017-06-20"}, {"excerpts": ["On my first visit my super vegetarian burrito ($5.25) came with complimentary chips, black beans, rice, cheese, guacamole, lettuce, tomato and salsa. ", "I wasn't too impressed with their burrito as it was dry on the spots that were without guacamole. ", "I thought it had too much fresh lettuce and the salsa was bland. "], "author": "Daniel L.", "review": "I've been on a quest to find a taqueria in the Mission that beats El Farolito. La Corneta has always piqued my interest with its clean and spacious ambiance decorated with red tiled floors and a colorful blend of red, orange, yellow, and other vibrant colors to bring a festive vibe. It's a bit smoky at the entrance where they broil and grill their meat to bring you an instantaneous aromatic introduction. This is also where you get to glance at the huge wall menu with a long food counter with all sorts of eye-popping meat, rice, beans and all the Mexican goodies you can imagine.\n\nI've been to here twice, once for dinner on a weeknight another on a festive weekend that had a celebratory mariachi band where the place was bursting with people from all walks of life. On my first visit my super vegetarian burrito ($5.25) came with complimentary chips, black beans, rice, cheese, guacamole, lettuce, tomato and salsa. I wasn't too impressed with their burrito as it was dry on the spots that were without guacamole. I thought it had too much fresh lettuce and the salsa was bland. It wasn't the most flavorful and the experience was over-dependent on the red and green salsa located at each table.\n\nMy second visit I ordered a chicken tamal and pork tamal with rice, black beans, lettuce, guacamole, and salsa ($7.75). The chicken tamal was dry and bland but the pork tamal was tasty with tender fat trimmings to keep me engaged the whole time. I thought the rice and beans were decent but the complimentary chips could be better warmed and salted. Salsa again could and should include chopped jalapeno to induce a spicy kick instead of letting it fell flat. My order of large melon aqua fresca ($2.50) was refreshing and a nice finisher. I did not receive my stack of tortillas even though it was clearly stated on the menu. \n\nOverall, I thought their prices were higher than others in the Mission while in exchange the food had very good portions but the flavor was not exciting enough to match its beautiful decor. I saw many Mexican customers ordering their carne asada so that might be a dish to look into for those interested. This place is spacious and has the room to support large groups and families. 3 stars for the overall experience.", "rating": 3, "date": "2009-12-31"}, {"excerpts": ["what I get here is a super vegetarian burrito. ", "However recently the burritos taste like they don't add enough love into them, seriously though a lot of the time I would be missing guacamole or sour cream and a few times I would just get beans rice and cheese. ", "Now, this kind of sucks already but also sometimes it would have a stale taste to me. ", "Still, burritos aren't the only thing they do. ", "They also serve entrees like sauteed shrimp with mushrooms. ", "These are great, I only wish they didn't add two huge sides of lettuce and refried beans and more shrimp or mushrooms instead. ", "This place is good but not my go-to anymore. ", "Definitely a good place to go and the mariachi music on fridays is nice if your into that."], "author": "Dan B.", "review": "This place was my go to burrito spot a while back. That's mostly what I get here is a super vegetarian burrito. However recently the burritos taste like they don't add enough love into them, seriously though a lot of the time I would be missing guacamole or sour cream and a few times I would just get beans rice and cheese. Now, this kind of sucks already but also sometimes it would have a stale taste to me. Still, burritos aren't the only thing they do. They also serve entrees like sauteed shrimp with mushrooms. These are great, I only wish they didn't add two huge sides of lettuce and refried beans and more shrimp or mushrooms instead. This place is good but not my go-to anymore. Definitely a good place to go and the mariachi music on fridays is nice if your into that.", "rating": 4, "date": "2013-05-20"}, {"excerpts": ["I had the super vegetarian burrito! ", "So yummy! ", "Great times, cheap price! ", "Can't wait to go back!"], "author": "Queen o.", "review": "Sweet place! Food is great! Comes out super fast! And is delicious! there was an amazing band playing during lunch on Saturday. I had the super vegetarian burrito! So yummy! Great times, cheap price! Can't wait to go back!", "rating": 4, "date": "2011-12-13"}], "fish nachos": [], "prawn nachos": [{"excerpts": ["My favorite meal, even though it's horribly cliche is the super steak and prawn nachos.  ", "It used to be the spicy prawn dinner, but I didn't always get the same level of spicy sauce.  ", "When it was good, it was great, but when they didn't get quite enough of the sauce, it was still good, but it didn't send me over the moon."], "author": "Janet V.", "review": "La Corneta is my favorite taqueria in San Francisco.  Hell, it may be my favorite restaurant in San Francisco.  I have to restrict myself to ONLY eating here ONCE a week, because if I didn't, I might be here every night.\n\nTheir food is always extremely fresh tasting.  I am one of those people who special orders everything, and I really never feel like I'm being a pain.  The way their order process works, it's accomodating to someone like me.\n\nMy favorite meal, even though it's horribly cliche is the super steak and prawn nachos.  It used to be the spicy prawn dinner, but I didn't always get the same level of spicy sauce.  When it was good, it was great, but when they didn't get quite enough of the sauce, it was still good, but it didn't send me over the moon.", "rating": 5, "date": "2011-02-24"}], "super fish nachos": [], "super prawn nachos": [], "steak and prawn nachos": [{"excerpts": ["My favorite meal, even though it's horribly cliche is the super steak and prawn nachos.  ", "It used to be the spicy prawn dinner, but I didn't always get the same level of spicy sauce.  ", "When it was good, it was great, but when they didn't get quite enough of the sauce, it was still good, but it didn't send me over the moon."], "author": "Janet V.", "review": "La Corneta is my favorite taqueria in San Francisco.  Hell, it may be my favorite restaurant in San Francisco.  I have to restrict myself to ONLY eating here ONCE a week, because if I didn't, I might be here every night.\n\nTheir food is always extremely fresh tasting.  I am one of those people who special orders everything, and I really never feel like I'm being a pain.  The way their order process works, it's accomodating to someone like me.\n\nMy favorite meal, even though it's horribly cliche is the super steak and prawn nachos.  It used to be the spicy prawn dinner, but I didn't always get the same level of spicy sauce.  When it was good, it was great, but when they didn't get quite enough of the sauce, it was still good, but it didn't send me over the moon.", "rating": 5, "date": "2011-02-24"}], "super steak and prawn nachos": [{"excerpts": ["My favorite meal, even though it's horribly cliche is the super steak and prawn nachos.  ", "It used to be the spicy prawn dinner, but I didn't always get the same level of spicy sauce.  ", "When it was good, it was great, but when they didn't get quite enough of the sauce, it was still good, but it didn't send me over the moon."], "author": "Janet V.", "review": "La Corneta is my favorite taqueria in San Francisco.  Hell, it may be my favorite restaurant in San Francisco.  I have to restrict myself to ONLY eating here ONCE a week, because if I didn't, I might be here every night.\n\nTheir food is always extremely fresh tasting.  I am one of those people who special orders everything, and I really never feel like I'm being a pain.  The way their order process works, it's accomodating to someone like me.\n\nMy favorite meal, even though it's horribly cliche is the super steak and prawn nachos.  It used to be the spicy prawn dinner, but I didn't always get the same level of spicy sauce.  When it was good, it was great, but when they didn't get quite enough of the sauce, it was still good, but it didn't send me over the moon.", "rating": 5, "date": "2011-02-24"}], "corn quesadilla": [{"excerpts": ["Something like 1.80 for a corn quesadilla with a little side salad. "], "author": "Claire G.", "review": "I am pretty damn impressed. \n\nI'm a picky mission-burrito-eater. I like a very specific kind of burrito at the right price, and La Corneta delivers. I'm traditionally a La Cumbre fan (c'mon, the original), but if I'm ever at the \"far end' of the mission by 24th, this has become my go to. \n\nI got the Super Veggie Burrito which was more than enough for dinner, and then lunch again the next day. Hefty, flavorful, well constructed. They offer \"baby burritos\" for you meat eaters that don't want a huge honking burrito, which is a refreshing option to see. It doesn't really make sense for veg-folk though, because the super is essentially the same price. Weird how it works out, but I'm not one to turn down leftovers. \n\nAs with seemingly all taquerias in the mission, the chips are made out of tasteless cardboard, but I'm perfectly happy with the burrito stealing the show. \n\nThe cheese quesadilla is also a surprisingly good deal. Something like 1.80 for a corn quesadilla with a little side salad. I like having cheap more snack like options for when my friends want a burrito but my stomach can't quite commit to that. \n\nmmmm, now I want a burrito...", "rating": 4, "date": "2013-08-10"}, {"excerpts": ["I got a corn quesadilla, a salad, chips and salsa for $1.96. ", "Highly recommend it. ", "There was great live music while we were eating"], "author": "Peter G.", "review": "Delicious tacos, and an incredible value. I got a corn quesadilla, a salad, chips and salsa for $1.96. Highly recommend it. There was great live music while we were eating", "rating": 5, "date": "2013-07-22"}, {"excerpts": ["I also order a simply corn quesadilla and Chile RELLENO to go.  ", "They had so many good offerings - including seafood selections which you can't find everywhere. ", "For dessert a chocolate, flan layer cake! ", "Can you believe that every.single.thing was delicious?  ", "Fresh, yummy, perfect.  ", "I have a new favorite.  ", "Yeah!!!!"], "author": "Dee B.", "review": "Love at first bite.  Seriously.  I was fiending for some La Taqueria but since just about everything along Mission was closed I wandered into La Corneta.  Relatively busy?  Check!  Clean-ish?  Check!  Food looks good and fresh? Check!  I placed my order for the super carna asata burrito with the works. I also order a simply corn quesadilla and Chile RELLENO to go.  They had so many good offerings - including seafood selections which you can't find everywhere. For dessert a chocolate, flan layer cake! Can you believe that every.single.thing was delicious?  Fresh, yummy, perfect.  I have a new favorite.  Yeah!!!!", "rating": 5, "date": "2008-08-06"}], "prawn quesadilla": [{"excerpts": ["I always get the prawn quesadilla whenever I come to La Corneta and it never disappoints.  ", "The prawns were really juicy, the tortilla was grilled to a perfect crisp, and paired with chips/guacamole the meal overall fills you up well!  ", "So for a rather large prawn quesadilla, a side salad, bottomless chips, some guacamole, a coke, and spicy salsa I only spent about ten dollars.  ", "This place is well worth your buck and there is about 2x the seating compared to glen park's location."], "author": "Jorel C.", "review": "Being extremely familiar with the glen park location, Mel and I decided to come here since El Farolito didn't accept cards.\n\nI always get the prawn quesadilla whenever I come to La Corneta and it never disappoints.  The prawns were really juicy, the tortilla was grilled to a perfect crisp, and paired with chips/guacamole the meal overall fills you up well!  We were very satisfied.\n\nThe manager came out to greet us and ask how the food was; he even brought us some extra chips, salsa, guacamole, and beans too!  \n\nSo for a rather large prawn quesadilla, a side salad, bottomless chips, some guacamole, a coke, and spicy salsa I only spent about ten dollars.  This place is well worth your buck and there is about 2x the seating compared to glen park's location.", "rating": 5, "date": "2014-09-15"}, {"excerpts": ["Ok, so maybe the Steak and Prawn Quesadilla wasn't so bad. ", "But definitely not as tasty as Glen Park. ", "Still points for having SPQ "], "author": "Faffy L.", "review": "After my near-mind-blowing visit to the La Corneta in Glen Park (http://www.yelp.com/user_details_review_search?userid=e331pQV1I-SSnWw_w0PfMA&q=corneta)   I had to check out their Mission location when I was in a hood a few weeks ago.\n\nUnfortunately, I am sad to report that it wasn't as good, as I was able to pay full attention to what my brother was saying....\n\nHe was talking about......wait, crap, I forgot.\n\nOk, so maybe the Steak and Prawn Quesadilla wasn't so bad. But definitely not as tasty as Glen Park. Still points for having SPQ but it didn't pack enough heat, and their horchata was too watery.\n\nPoints for have a huge seating area.", "rating": 3, "date": "2008-01-16"}, {"excerpts": ["But the \"Super Steak/Prawn Quesadilla\" that was ordered for me at La Corneta was enormous.  ", "At first, I'm thinking, \"Hmm... will I be full on just one quesadilla, super or not?", "\" ", "and then when it came flying in looking like half a XL pizza (ok maybe a slight exaggeration ", "but the thing was barely closing on itself because it was so full of \"stuff\")", "..... ", "I was officially worried.\n", "That ain't no Taco Bell Quesadilla, friends.  "], "author": "Grace K.", "review": "\"Super-size it!\" I can holler into a McD's drive-thru, and not fear a thing (not that I normally do, but I can without a second thought).  \nGirl can eat.  And girl can drink, too.  :-)\n\nBut at this place, think once, twice, thrice before you utter anything \"super ______\".  They don't kid around with super.\n\nNow, I remind you again, lest you forget, I can eat. \nBut the \"Super Steak/Prawn Quesadilla\" that was ordered for me at La Corneta was enormous.  At first, I'm thinking, \"Hmm... will I be full on just one quesadilla, super or not?\" and then when it came flying in looking like half a XL pizza (ok maybe a slight exaggeration but the thing was barely closing on itself because it was so full of \"stuff\")..... I was officially worried.\nThat ain't no Taco Bell Quesadilla, friends.  Welcome to the world of giants.\n\nI finished half with some work, and even then, I was full for the remainder of the day.  The only reason I could finish half was because of the perfectly toasted flour tortilla, and the fresh, juicy fillings, with lots of fresh guacamole, sour cream, lettuce, etc. that was too good to pass up....  I suspect most girls will finish about 1/4 of  this quesadilla, so dining \"family-style\" might be wise....\n\nThe establishment is bright and pleasant, and they have some nice seating in one section of the restaurant for a near \"patio-dining\" effect.  During lunch, it was pretty crowded, and I suspect the same will hold true for dinner.  Location was a bit fishy, but I didn't feel my life was in danger at any point.  Staff was so-so, but nothing to complain about.\n\nOh, and they have two kinds of salsa, one is mild and the other is hot, with fresh bits of jalapeno.  Now, for me, this was no challenge, but if you can't handle spicy - - go for the first, or pick out the jalapeno bits.  I didn't try the mild version but I could just eat up spoonfuls of the second one all day long and be happy.  Combined bite by bite with my quesadilla, it was perfect.\n\nI glanced around and noticed almost everything is big here.  It's not \"fast food cheap\" either, as lunch for two with two super quesadillas and two drinks was *almost* $20 if I recall correctly.  But service is fast, and the food is tasty and fresh.  Speaking of drinks - we tried the \"horchata\", I think it was called, and it was quite complementary to our food.  It's like sugar water with a good dose of cinnamon, what I imagine a churro to taste like if blended with water?  Doesn't sound appetizing but it was actually quite good.\n\nA strong 3-stars for the food, and an additional 1 star simply for being almost OVERLY generous with sizing.  While this meant i could not finish my meal, it does mean a big guy with a hearty apetite would walk out of here very, very, very happy.  :-)\n\nFYI - according to their menu, there are four locations, 2 in SF, one in Burlingame, and one in Redwood City.  They do take-out, phone orders, and have gift certificates.  Also, if planning a group event or big party -  they will also cater for you.  Not shabby at all!", "rating": 4, "date": "2007-04-19"}, {"excerpts": ["I usually get the super prawn quesadilla. ", "The staff is a little salty ", "but I like their no nonsense move em in move ", "em out attitude. ", "Don't get in line until you know what you want ", "or you'll suffer the scorn of those who take your order displayed fully in the raised arch of an artfully penciled brow line."], "author": "Pam D.", "review": "For burritos I usually head down 16th Street way,  but this is my quesadilla place. They don't skimp on the ingredients and they are nice and crispy and bursting at the seams. I usually get the super prawn quesadilla. The staff is a little salty but I like their no nonsense move em in move em out attitude. Don't get in line until you know what you want or you'll suffer the scorn of those who take your order displayed fully in the raised arch of an artfully penciled brow line.", "rating": 4, "date": "2006-01-11"}, {"excerpts": ["probably my favorite dish though is the super steak and prawn quesadilla--with their tomatillo salsa slathered all over it...all washed down with an agua fresca melon juice. ", "scrumptious..."], "author": "dusty d.", "review": "there's s*loads of taquerias in the mission, but i keep going back to la corneta. i rarely trust seafood in taquerias...but la corneta has awesome prawns and salmon. the baby burritos are nice too for those who don't want to have to tote the other half of their burrito around all night while partying in the mission. also they've got some excellent marinated meats--spicy chicken in roja and verda salsas, and the chile verde pork is tasty too. probably my favorite dish though is the super steak and prawn quesadilla--with their tomatillo salsa slathered all over it...all washed down with an agua fresca melon juice. scrumptious...", "rating": 4, "date": "2008-03-14"}, {"excerpts": ["usually it's the \"super prawn quesadilla\".  ", "oh yeah, their guacamole is also amazing.  ", "and not surprisingly, the line to order is always out the door. ", "but it moves quick."], "author": "Jason H.", "review": "yum!  i only ever order their seafood.  either the shrimp or the salmon.  not because the other stuff isn't good.  i hear it is.  it is just that the seafood is so good, i can't help myself but order it every time.  usually it's the \"super prawn quesadilla\".  oh yeah, their guacamole is also amazing.  and not surprisingly, the line to order is always out the door. but it moves quick.", "rating": 5, "date": "2007-07-30"}], "super prawn quesadilla": [{"excerpts": ["I usually get the super prawn quesadilla. ", "The staff is a little salty ", "but I like their no nonsense move em in move ", "em out attitude. ", "Don't get in line until you know what you want ", "or you'll suffer the scorn of those who take your order displayed fully in the raised arch of an artfully penciled brow line."], "author": "Pam D.", "review": "For burritos I usually head down 16th Street way,  but this is my quesadilla place. They don't skimp on the ingredients and they are nice and crispy and bursting at the seams. I usually get the super prawn quesadilla. The staff is a little salty but I like their no nonsense move em in move em out attitude. Don't get in line until you know what you want or you'll suffer the scorn of those who take your order displayed fully in the raised arch of an artfully penciled brow line.", "rating": 4, "date": "2006-01-11"}, {"excerpts": ["usually it's the \"super prawn quesadilla\".  ", "oh yeah, their guacamole is also amazing.  ", "and not surprisingly, the line to order is always out the door. ", "but it moves quick."], "author": "Jason H.", "review": "yum!  i only ever order their seafood.  either the shrimp or the salmon.  not because the other stuff isn't good.  i hear it is.  it is just that the seafood is so good, i can't help myself but order it every time.  usually it's the \"super prawn quesadilla\".  oh yeah, their guacamole is also amazing.  and not surprisingly, the line to order is always out the door. but it moves quick.", "rating": 5, "date": "2007-07-30"}], "fish quesadilla": [{"excerpts": ["Great huge burritos and an amazing fish quesadilla served by a very warm and welcoming waitress. ", "The atmosphere is clean and cheerful and it seems to be a favorite of the locals ..... Excellent!"], "author": "Virginia D.", "review": "Great huge burritos and an amazing fish quesadilla served by a very warm and welcoming waitress. The atmosphere is clean and cheerful and it seems to be a favorite of the locals ..... Excellent!", "rating": 5, "date": "2015-08-07"}, {"excerpts": ["1st time: fish quesadilla was BIG, cheesy, and delicious, especially with their spicy salsa.\n\n"], "author": "Inari T.", "review": "been here twice, liked it immensely. \n\n1st time: fish quesadilla was BIG, cheesy, and delicious, especially with their spicy salsa.\n\n2nd time: fish taco was a bit too small for me. i left still feeling hungry.\n\nhowever, while i was satisfied with the food, i was rather unhappy with the service and the way you order.\n\nmay be a tad pricey, but... hey, the food's good!\n\ni can't wait to try everything else though.", "rating": 3, "date": "2008-09-30"}], "super fish quesadilla": [], "steak and prawn quesadilla": [{"excerpts": ["Ok, so maybe the Steak and Prawn Quesadilla wasn't so bad. ", "But definitely not as tasty as Glen Park. ", "Still points for having SPQ "], "author": "Faffy L.", "review": "After my near-mind-blowing visit to the La Corneta in Glen Park (http://www.yelp.com/user_details_review_search?userid=e331pQV1I-SSnWw_w0PfMA&q=corneta)   I had to check out their Mission location when I was in a hood a few weeks ago.\n\nUnfortunately, I am sad to report that it wasn't as good, as I was able to pay full attention to what my brother was saying....\n\nHe was talking about......wait, crap, I forgot.\n\nOk, so maybe the Steak and Prawn Quesadilla wasn't so bad. But definitely not as tasty as Glen Park. Still points for having SPQ but it didn't pack enough heat, and their horchata was too watery.\n\nPoints for have a huge seating area.", "rating": 3, "date": "2008-01-16"}, {"excerpts": ["probably my favorite dish though is the super steak and prawn quesadilla--with their tomatillo salsa slathered all over it...all washed down with an agua fresca melon juice. ", "scrumptious..."], "author": "dusty d.", "review": "there's s*loads of taquerias in the mission, but i keep going back to la corneta. i rarely trust seafood in taquerias...but la corneta has awesome prawns and salmon. the baby burritos are nice too for those who don't want to have to tote the other half of their burrito around all night while partying in the mission. also they've got some excellent marinated meats--spicy chicken in roja and verda salsas, and the chile verde pork is tasty too. probably my favorite dish though is the super steak and prawn quesadilla--with their tomatillo salsa slathered all over it...all washed down with an agua fresca melon juice. scrumptious...", "rating": 4, "date": "2008-03-14"}], "super steak and prawn quesadilla": [{"excerpts": ["probably my favorite dish though is the super steak and prawn quesadilla--with their tomatillo salsa slathered all over it...all washed down with an agua fresca melon juice. ", "scrumptious..."], "author": "dusty d.", "review": "there's s*loads of taquerias in the mission, but i keep going back to la corneta. i rarely trust seafood in taquerias...but la corneta has awesome prawns and salmon. the baby burritos are nice too for those who don't want to have to tote the other half of their burrito around all night while partying in the mission. also they've got some excellent marinated meats--spicy chicken in roja and verda salsas, and the chile verde pork is tasty too. probably my favorite dish though is the super steak and prawn quesadilla--with their tomatillo salsa slathered all over it...all washed down with an agua fresca melon juice. scrumptious...", "rating": 4, "date": "2008-03-14"}], "regular burrito": [{"excerpts": ["I scanned the menu and chose a regular burrito ", "but I got and was charged for a especial burrito(with rice and cheese) ", "They gave chips and salsa but put my burrito in the chip bag... weird. \n"], "author": "Megan M.", "review": "Came here randomly because I didn't have cash for El Farlito. I scanned the menu and chose a regular burrito but I got and was charged for a especial burrito(with rice and cheese) They gave chips and salsa but put my burrito in the chip bag... weird. \nAnyway I was very please with my especial burrito. The beans were very yummy. The burrito was so good it should have fallen apart but it was wrapped perfectly so everything was contained. \nPretty good but very similar to other taquerias in the area.", "rating": 4, "date": "2018-01-18"}, {"excerpts": ["Got the baby regular burrito ", "and it was pretty good. ", "Chips provided and the salsa was great"], "author": "Alin C.", "review": "Clean and friendly place with live music and a nice energy! Got the baby regular burrito and it was pretty good. Chips provided and the salsa was great", "rating": 4, "date": "2018-08-05"}, {"excerpts": ["First time, I ordered a regular burrito with meat beans, rice and salsa at their Glen Park location. "], "author": "Bennett W.", "review": "La Corneta Taqueria is one of the best restaurants for Mexican food. I have eaten here twice. First time, I ordered a regular burrito with meat beans, rice and salsa at their Glen Park location. Second time I ordered regular nachos with chips, beans, cheese and salsa. Overall, satisfying experience, good food and good service.", "rating": 5, "date": "2011-04-10"}, {"excerpts": ["I wanted to try it out because i can never finish a regular burrito. ", "I really liked this place. ", "Got the super baby chicken burrito. ", "It was flavorful and bigger than I thought. "], "author": "Ayana K.", "review": "Heard about the baby burritos on here. I wanted to try it out because i can never finish a regular burrito. I really liked this place. Got the super baby chicken burrito. It was flavorful and bigger than I thought. The sangria is tasty as well. IT was clean and suprisingly full.", "rating": 4, "date": "2012-07-01"}, {"excerpts": ["It is not much smaller than the regular burrito, I will admit, but the fact that it is supposed to be makes me feel better about eating it in all its deliciousness.\n\n"], "author": "Megan D.", "review": "BABY BURRITO?!?!?!?!\n\nYes, please!!  \n\nIt is not much smaller than the regular burrito, I will admit, but the fact that it is supposed to be makes me feel better about eating it in all its deliciousness.\n\nGood guacamole, steamed tortillas, crazy clean, friendly service.", "rating": 4, "date": "2008-01-27"}, {"excerpts": ["I went today and got a \"baby\" burrito which was totally filling (a smaller version of their ginormous regular burrito...not a burrito made of babies)\n", "I also have to give them props on their salmon burrito. "], "author": "Fernando M.", "review": "I have gone to my fair share of Mexican joints here in SF and I must say that this is definitely one of my favorites.\nForget the fact that the place has a chain-restaurant look to it.  Forget that their food is \"just\" a bit over-priced compared to competitors in the area.\nThe food is fantastic. The ingredients are fresh and the portions are massive.\n\nI went today and got a \"baby\" burrito which was totally filling (a smaller version of their ginormous regular burrito...not a burrito made of babies)\nI also have to give them props on their salmon burrito. Im usually a bit hesitant about getting fish at fairly fast food establishments, but the salmon was quite fresh and very delicious.\n\nHighly recommended.", "rating": 5, "date": "2008-07-31"}, {"excerpts": ["At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  ", "All of their ingredients seem to be of a very good quality.  ", "Also, good chips."], "author": "Chadwick W.", "review": "While I know many people who swear by El Farolito when they're looking for a burrito, my vote goes to La Corneta.  Why?  Super Baby Burrito.  At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  All of their ingredients seem to be of a very good quality.  Also, good chips.", "rating": 5, "date": "2007-01-17"}], "especial burrito": [{"excerpts": ["The burrito (ESpecial burrito) ", "I had wasn't really delightful or enjoyable. ", "The rice was a bit soggy and the flavor of the rice does not feel very enjoyable. ", "First bite of my burrito ", "and I knew I wasn't going to like this. ", "I was on an empty stomach too; Usually when I'm on an empty stomach, literally everything would taste good to me. ", "I guess I just don't like this burrito all honestly. ", "What would be a huge improvement to this burrito would be to make it more juicy and not soggy and dry. ", "Oh yeah! ", "They give out free chips also too when I bought my burrito! ", "So.. I guess that was impressive. ", "I thought you had to pay for the extra chips! "], "author": "Jonathan Z.", "review": "Experience: 3/5 \n\nWait time: Less than 10 minutes.\n\nReview: The burrito (ESpecial burrito) I had wasn't really delightful or enjoyable. The rice was a bit soggy and the flavor of the rice does not feel very enjoyable. First bite of my burrito and I knew I wasn't going to like this. I was on an empty stomach too; Usually when I'm on an empty stomach, literally everything would taste good to me. I guess I just don't like this burrito all honestly. What would be a huge improvement to this burrito would be to make it more juicy and not soggy and dry. Oh yeah! They give out free chips also too when I bought my burrito! So.. I guess that was impressive. I thought you had to pay for the extra chips! Haha.\n\nCustomer service: Awesome! The lady was really nice and explained to me each and every kind of toppings for the burrito without any frustration. \n\nSo +1 for the chips, +1 for the burrito & +1 for the great customer service and efficiency.\n\nWill I be back? Maybe. It really depends on how they will make the burrito next time. More juices would really be preferred for me because the burrito they made me was really really dry.", "rating": 3, "date": "2017-08-07"}, {"excerpts": ["Anyway I was very please with my especial burrito. ", "The beans were very yummy. ", "The burrito was so good it should have fallen apart ", "but it was wrapped perfectly so everything was contained. \n", "Pretty good but very similar to other taquerias in the area."], "author": "Megan M.", "review": "Came here randomly because I didn't have cash for El Farlito. I scanned the menu and chose a regular burrito but I got and was charged for a especial burrito(with rice and cheese) They gave chips and salsa but put my burrito in the chip bag... weird. \nAnyway I was very please with my especial burrito. The beans were very yummy. The burrito was so good it should have fallen apart but it was wrapped perfectly so everything was contained. \nPretty good but very similar to other taquerias in the area.", "rating": 4, "date": "2018-01-18"}, {"excerpts": ["I always get the Especial Burrito; chicken, refried beans, red sauce. ", "I like how big and clean this place is. ", "The staff is really friendly and fast. ", "Proud to be the duke!"], "author": "Chase L.", "review": "This is my favorite burrito place. I always get the Especial Burrito; chicken, refried beans, red sauce. I like how big and clean this place is. The staff is really friendly and fast. Proud to be the duke!", "rating": 5, "date": "2013-01-20"}], "baby burrito": [{"excerpts": ["I got the super baby burrito with chicken. ", "It was really really good!! ", "The verde sauce is mild and delicious! "], "author": "Julia B.", "review": "Apparently, this is the spot where DIY burritos originated. You can customize your order, but nowhere near as much as chipotle. This is a good thing. You can choose between tortilla type, bean type, meat type and salsa type. According to someone I was eating with, you're supposed to be able to choose everything as they build our burrito in front of you. I just ordered with my options up front, and had no problem. \n\nI got the super baby burrito with chicken. It was really really good!! The verde sauce is mild and delicious! I really liked the flavor of the rice and beans. \n\nThe flour burrito it was wrapped in was thin, and wasn't great at holding in the filling. The last quarter of my burrito was eaten with a fork. If and when I go back, I'll ask them to double wrap it. \n\nMy dad got the gambas and said they were very good, not spicy. \n\nThey also have really yummy drinks (horchata, agua de fresa, agua de piña, etc) and churros.", "rating": 4, "date": "2018-03-29"}, {"excerpts": ["I normally order my standard carne asada super baby burrito and that normally fills me up. "], "author": "Melissa N.", "review": "This is a large sit down Mexican restaurant with a fairly large selection of things to order. It's located among a large number of Mexican eateries on Mission Street. Seating is abundant and during lunch time there normally is a line, but it goes by pretty quick as they push out freshly made orders fairly fast. There's also a mariachi band sometimes which can either be a good or bad thing.\n\nI normally order my standard carne asada super baby burrito and that normally fills me up. For about $7+ you get a decent size burrito with meat, cheese, lettuce, sour cream, rice, and salsa, plus a small bag of chips. What a deal! Though it's not my favorite or the most delicious tasting burrito, this place has great prices and value for their food. The service is also very fast compared to other places. Definately a win in my book!", "rating": 4, "date": "2016-10-26"}, {"excerpts": ["The portions here are generous in size - I got the Super Baby Burrito (sounds like an oxymoron!), but it's a smaller sized burrito that comes with meat, rice, beans, cheese, salsa, sour cream, guacamole, lettuce, tomato and salsa for $7. ", "You can get just the Baby Burrito for $5.50, but that just comes with the meat, rice, beans, cheese, and salsa, so I think it's worth the extra $1.50 for the guacamole and other things. ", "Seeing as that a burrito at Chipotle costs just as much as this Super Baby Burrito (if not more) ", "and it's not as authentic and flavorful", ", this is a much better option! ", "Seeing as that a burrito at Chipotle costs just as much as this Super Baby Burrito (if not more) ", "and it's not as authentic and flavorful", ", this is a much better option! ", "The Super Baby Burrito was filling but not to the point where I thought I would explode after eating.\n\n", "The Super Baby Burrito was filling but not to the point where I thought I would explode after eating.\n\n"], "author": "Christina L.", "review": "I know everyone loves La Taq and you can see the line snaking outside the restaurant sometimes, but I think it's overrated and overpriced and I actually prefer Pancho Villa or this little gem, La Corneta Taqueria. The location is super convenient, just half a block away from the 24th St. BART station (between 23rd and 24th on Mission St.), the restaurant is decently sized - maybe the same size as Pancho Villa and maybe 30-40% bigger than La Taq.\n\nThe portions here are generous in size - I got the Super Baby Burrito (sounds like an oxymoron!), but it's a smaller sized burrito that comes with meat, rice, beans, cheese, salsa, sour cream, guacamole, lettuce, tomato and salsa for $7. You can get just the Baby Burrito for $5.50, but that just comes with the meat, rice, beans, cheese, and salsa, so I think it's worth the extra $1.50 for the guacamole and other things. Seeing as that a burrito at Chipotle costs just as much as this Super Baby Burrito (if not more) and it's not as authentic and flavorful, this is a much better option! The Super Baby Burrito was filling but not to the point where I thought I would explode after eating.\n\nThe fillings: you can pick between refried or black beans, you can make your burrito spicy or mild. The rice is flavorful and has peas and some other veggies in there, so it's not just plain white rice with cilantro. The chicken I got was well seasoned and a little grilled, so it was better than the chicken at La Taq that seems to just be boiled and flavorless.\n\nIf you dine in, they have 2 kinds of salsa on the table that you can squeeze on your burrito. No salsa bar like Pancho Villa. They will give you some chips too, but they were a little bit too greasy for my taste.\n\nIf burritos aren't your thing, you can also get tacos, quesadillas, nachos, or other combinations/special plates. You should be able to find something that you like here - there are a ton of options. They take credit card which is always nice (unlike La Taq that is only cash), and the space is fairly large and spacious so you won't feel like you're eating on top of someone else.\n\nI'll definitely come back here again next time I'm in the mood for a burrito or authentic Mexican food. They have locations in Glen Park, San Carlos and Burlingame too!", "rating": 4, "date": "2017-04-04"}, {"excerpts": ["I ordered a chicken baby burrito and a small strawberry agua fresca for myself and a especial carne asada burrito to go for hubby.  ", "All this with free chips (for my dine in order and the to go) for under $17.  ", "I'm so happy I got the baby burrito because I was getting so full.  ", "The rice was orange rice with some peas and carrots in it, and had a light flavor.  ", "The grilled chicken was moist and diced up.  ", "A lot of times I try to refrain from chicken in my Mexican food due to fear of being dry, but this wasn't the case here.  ", "I used some of the verde salsa in their squirt bottle.  ", "The agua fresca was refreshing and not overly sweet or watery.  ", "Chips were standard, didn't get diced salsa in it.    ", "I don't get beans ", "but I appreciate that you can choose which beans ", "you'd like, ", "what type of salsa, and what type of tortilla for your order as well.  ", "My friend says she likes La Corneta because the meat isn't greasy ", "and she doesn't feel like the food is so heavy here "], "author": "Cat C.", "review": "First review of mine for 2017!  :-)  Last week, my friend and I sat at El Techo for about 5 minutes before we decided to leave (unimpressed by the menu, and I frankly didn't like the happy hour scene).  Looking and craving some Mexican food, we came to La Corneta.  The line was long, but not as excessive as the line I saw out the door earlier at El Farolito.  The colors are bright here, the restaurant is very clean, and the food looked and smells good.  While waiting, I saw the meats on the grill which permeated onto my hair and clothes.  \n\nThey take you order ahead of time in line and then by the time we reached the cashier to pay everything was all ready.  I ordered a chicken baby burrito and a small strawberry agua fresca for myself and a especial carne asada burrito to go for hubby.  All this with free chips (for my dine in order and the to go) for under $17.  I'm so happy I got the baby burrito because I was getting so full.  The rice was orange rice with some peas and carrots in it, and had a light flavor.  The grilled chicken was moist and diced up.  A lot of times I try to refrain from chicken in my Mexican food due to fear of being dry, but this wasn't the case here.  I used some of the verde salsa in their squirt bottle.  The agua fresca was refreshing and not overly sweet or watery.  Chips were standard, didn't get diced salsa in it.    I don't get beans but I appreciate that you can choose which beans you'd like, what type of salsa, and what type of tortilla for your order as well.  My friend says she likes La Corneta because the meat isn't greasy and she doesn't feel like the food is so heavy here like she feels at El Farolito.  \n\nThere's a La Corneta by me in Burlingame, I'm hoping this chain is very consistent as I was impressed by my dinner here last week and would like to find a great Mexican restaurant in the Peninsula.  I always have fond memories of going to La Taqueria for lengua tacos with my uncle as a kid, hubs and I used to go to Taqueria Los Coyotes for California burritos, now I know another delicious taqueria in the Mission.  I really hope this area of Mission doesn't continue to get over gentrified!  Viva los burritos!", "rating": 4, "date": "2017-01-01"}, {"excerpts": ["The carne asada super baby burrito was good and this place doesn't usually have a queue ", "so I would recommend if you're in the area ", ":) ", "Definitely had a food baby from that baby burrito"], "author": "Hana S.", "review": "Pro tip: I discovered that he super baby burritos are basically the same size as the regular burritos, but have guac and all the good stuff in them. They're of course a tiny bit cheaper which is nice (AND THEY HAVE GUAC). \n\nEvery order comes with a side of chips (YAY), the chips weren't the best and were kind of greasy but they were free so I loved them with no discrimination. Salsas are available and you can get a quarter pint of guac for ~$4. The carne asada super baby burrito was good and this place doesn't usually have a queue so I would recommend if you're in the area :) Definitely had a food baby from that baby burrito", "rating": 4, "date": "2017-01-30"}, {"excerpts": ["I always get the super baby burrito and try different meat each time.  ", "Boyfriend try's different meal each time as well. ", "Never go wrong with them. ", "A+++"], "author": "Angel C.", "review": "We love this place. Friendly staff always. Always clean. Super fast even when the line is long and reasonably  priced and great food. They will customize whatever you want without a complaint. I always get the super baby burrito and try different meat each time.  Boyfriend try's different meal each time as well. Never go wrong with them. A+++", "rating": 5, "date": "2018-03-02"}, {"excerpts": ["Ordered the typical chicken super baby burrito and it was lifeless. ", "While I was eating it, my mind drifted to wondering how much happier I would have been if I had one of the bacon wrapped hot dog just selling outside on the sidewalk a block away. ", "Their chips were a little thick for my liking and their fresh tomato salsa "], "author": "Elaine Y.", "review": "This place is like a fast-burrito food joint. You order your dish, they make it with pre-made ingredients at the counter, go down the line and boom, you end up with a luke warm burrito that doesn't sing with flavor. Ordered the typical chicken super baby burrito and it was lifeless. While I was eating it, my mind drifted to wondering how much happier I would have been if I had one of the bacon wrapped hot dog just selling outside on the sidewalk a block away. Their chips were a little thick for my liking and their fresh tomato salsa didn't look so fresh (I assumed so because the tomatoes used were very pale).\n\nThen I also had a major accident with one of their bottled salsa. It was so chunky that the tomato was stuck at the spout and when I squeezed a little harder, half a bottle of the salsa blasted on my boyfriend who was sitting next to me. I know when sometimes food get messy and everywhere, it means it's loaded with deliciousness, but this wasn't what I had pictured in mind.\n\n(+1 for having a big place with many seating)", "rating": 2, "date": "2012-01-18"}, {"excerpts": ["so I went for the baby burrito. ", "It was delicious and already huge ", "so I'm glad I went for that. \n", "My friend had chicken quesadillas, which were also really good. "], "author": "Laetitia L.", "review": "Whenever I come to SF, I always make sure I stop by one of those great Mexican taquerias, something we don't really find in France. \n\nI asked one of my friends, Karina K., a fellow Yelper who lived in SF for years, and she recommended La Corneta. I have to say I wasn't disappointed at all. \n\nThe place is pretty big so you should find plenty of space for your lunch. You can either order from the counter for takeaways or sit down and wait for the friendly waitress to take your order. They will then offer you a small glass of sangria as a starter, with the usual guacamole and salsa. \n\nI was slightly afraid of the size of the real burritos for a light lunch so I went for the baby burrito. It was delicious and already huge so I'm glad I went for that. \nMy friend had chicken quesadillas, which were also really good. On the top of that, there was a group of musicians playing traditional Mexican music. \n\nThe only downside : the cleanliness. When I went in the restrooms, they were really dirty, probably because of dirty customers to start with, but not only. The tables themselves were not 100% clean either. Maybe I went there on the wrong day. This is too bad as everything else was really nice.", "rating": 4, "date": "2013-09-04"}, {"excerpts": ["I love that you can get a baby burrito, which won't leave you feeling miserably full or with an awkward amount of leftovers.  ", "I always want to switch it up and try something new, but I can never turn down the carne asada.  ", "It's so savory and juicy, and during my stint as a vegetarian, I really missed it.  "], "author": "Amanda L.", "review": "I'm definitely a fan.  I love that you can get a baby burrito, which won't leave you feeling miserably full or with an awkward amount of leftovers.  I always want to switch it up and try something new, but I can never turn down the carne asada.  It's so savory and juicy, and during my stint as a vegetarian, I really missed it.  You just can't get that flavor from anything else.\n\nThe verdict: a reliable place for quick and friendly service, great value, and a tasty meal.  Give it a shot.", "rating": 4, "date": "2013-04-13"}, {"excerpts": ["The baby burrito is a nice, actually edible size, as opposed to the usual behemoths in the mission. ", "The pollo is salsa roja seemed to have a lot of white meat, which was tender and consistent, but a little boring. ", "The spicy salsa had some jalepenos but was still on the mild side. ", "I liked the carnitas more than I expected I would - they weren't too crispy but were pretty succulent. ", "The carne asada was pretty good, too, although my dining companion was less impressed. ", "The tortillas weren't too flavorful, disappointingly. ", "Good fresh-squeezed orange juice."], "author": "Lisa K.", "review": "Totally fine taqueria. They have a big menu, which is nice (constant supply of churros! Theoretically great, but maybe not so fresh always!). It has a clean, chain-y feeling, which is slightly off-putting, but they keep everything moving through pretty quickly.\n\nAnyway, the food. The baby burrito is a nice, actually edible size, as opposed to the usual behemoths in the mission. The pollo is salsa roja seemed to have a lot of white meat, which was tender and consistent, but a little boring. The spicy salsa had some jalepenos but was still on the mild side. I liked the carnitas more than I expected I would - they weren't too crispy but were pretty succulent. The carne asada was pretty good, too, although my dining companion was less impressed. The tortillas weren't too flavorful, disappointingly. Good fresh-squeezed orange juice.", "rating": 3, "date": "2010-01-23"}, {"excerpts": ["I ended up ordering the baby burrito with chicken and mole because of all the rave reviews. ", "She brought another salsa (making it 4 total different salsas). ", "Again, no flavor. ", "I had asked for no rice in the burrito (doesn't belong there!). ", "But, they didn't put any cheese in it like the menu described. ", "My husband got the super baby burrito with shrimp and his didn't have any cheese either. ", "I don't usually eat burritos in Mexican restaurants, I think of them as Gringo food because I've traveled all over Mexico and actually lived part of the year in Jalisco, and they don't serve burritos unless it's in an American style restaurant. ", "But, this food so lacked in flavor that I would be afraid to try the tacos. ", "I also have to say ", "although everyone speaks Spanish there, I don't think the operators of this Mexican restaurant are Mexican. ", "They sound Central American and the food is more Central American style. ", "If I want that, I would go down the street and have a pupusa or nacatamal. ", "Central American food isn't typically as spicy as Mexican ", "so I think my assumption is correct. ", "I'm really surprised that it's so hard to find good Mexican in SF, but I'll keep trying."], "author": "Tess S.", "review": "Yelpers, you really screwed me on this one! I was craving Mexican, so we made a special trip over here on a Saturday, had to park 5 blocks away, walk by the disgusting urine infested Bart depot (made me gag before I even got there). We walked in and there was a line at the counter, but we must've looked the type who were going to sit down, so the waitress came up to us and asked (in Spanish) if we were going to \"eat here\" and she told us to sit down and she brought us a basked of chips and menus. The salsa with the chips was pico de gallo. There were also two bottle of salsa on the table. NONE of these salsas had any flavor. No lie. They lacked salt. I have a heart condition, so I'm not a big salt eater, so that should tell you something. I ended up ordering the baby burrito with chicken and mole because of all the rave reviews. She brought another salsa (making it 4 total different salsas). Again, no flavor. I had asked for no rice in the burrito (doesn't belong there!). But, they didn't put any cheese in it like the menu described. My husband got the super baby burrito with shrimp and his didn't have any cheese either. I don't usually eat burritos in Mexican restaurants, I think of them as Gringo food because I've traveled all over Mexico and actually lived part of the year in Jalisco, and they don't serve burritos unless it's in an American style restaurant. But, this food so lacked in flavor that I would be afraid to try the tacos. I also have to say although everyone speaks Spanish there, I don't think the operators of this Mexican restaurant are Mexican. They sound Central American and the food is more Central American style. If I want that, I would go down the street and have a pupusa or nacatamal. Central American food isn't typically as spicy as Mexican so I think my assumption is correct. I'm really surprised that it's so hard to find good Mexican in SF, but I'll keep trying.", "rating": 2, "date": "2013-10-12"}, {"excerpts": ["I like that they offer a baby burrito and sauteed mushrooms. ", "I think La Corneta is in the same category/class as lets say Pancho Villa but not quite as good or clean."], "author": "Shannon Z.", "review": "I brought an out of town guest to La Corneta and a we sat near a normal seeming woman. The woman sitting at a table near us projectile vomit her huge taco salad across her table. It was like the watching the Exorcist but in slow motion, with smell. I saw my small-town guest stare in horror. He was looking for reasons to hate San Francisco and La Corneta found him his all his reasons.\n\nAs I have visited more frequently to this restaurant I have compiled a mix of memories that are ranging from good to very upsetting. I think the Glen Park location is much cleaner. I don't have a huge problem with the food. Just bad memories are holding me back. They have good vegetarian options but the refried beans have lard in them, I like that they offer a baby burrito and sauteed mushrooms. I think La Corneta is in the same category/class as lets say Pancho Villa but not quite as good or clean.", "rating": 2, "date": "2008-05-06"}, {"excerpts": ["Decided to grab a carne asada \"super baby burrito.", "\" ", "For being a baby burrito, it was a pretty good size. ", "Everything inside tasted fresh and delicious."], "author": "Sebastian C.", "review": "Pretty damn good. Rolled through here on a Sunday night after a long, tiring day at work. Decided to grab a carne asada \"super baby burrito.\" For being a baby burrito, it was a pretty good size. Everything inside tasted fresh and delicious.", "rating": 5, "date": "2013-09-22"}, {"excerpts": ["I love the option of the super BABY burrito, grilled chicken, with black beans on a spinach tortilla. ", "I love the super quesadilla. "], "author": "Val B.", "review": "I love the option of the super BABY burrito, grilled chicken, with black beans on a spinach tortilla. I love the super quesadilla. I love love loves the super nachos. \n\nThis place has so many memories for me. My dentist is within the area.  I always get a cleaning.  Mess it up by eating one nice juicy burrito.", "rating": 4, "date": "2010-05-16"}, {"excerpts": ["BABY BURRITO?!?!?!?!\n\n"], "author": "Megan D.", "review": "BABY BURRITO?!?!?!?!\n\nYes, please!!  \n\nIt is not much smaller than the regular burrito, I will admit, but the fact that it is supposed to be makes me feel better about eating it in all its deliciousness.\n\nGood guacamole, steamed tortillas, crazy clean, friendly service.", "rating": 4, "date": "2008-01-27"}, {"excerpts": ["And the baby burrito is the perfect size when you want to eat a whole burrito without a) feeling guilty or b) lapsing into a coma.  "], "author": "sarah K.", "review": "No longer in SF, I dream of La Corneta super baby chicken burritos on a regular basis.  I know everyone has their favorite taqueria, but La Corneta is mine.  It's sooooooooooooooooooo good!!!!  And the baby burrito is the perfect size when you want to eat a whole burrito without a) feeling guilty or b) lapsing into a coma.  *drool*\n\nWhy can't anyone in DC make a proper burrito?", "rating": 5, "date": "2008-02-19"}, {"excerpts": ["I loved grilled mushroom and steak baby burrito with a Tecate or their enchiladas or chips & guacamole. ", "My old office would get catering from them occasionally ", "and it was always such a great day to be able to eat La Corneta for free. ", "I miss this place."], "author": "Maria D.", "review": "I just remembered how often I would go to La Corneta when I lived at 22nd and Valencia and my ex would go out to do stenciling and I would be the lookout. I miss those days. \n\nAnyway, La Corneta is really good. It's very easy to overlook it in favor of the more bad ass El Farolito and overrated Papalote, but actual Mexican people come here and they have lots of options. I loved grilled mushroom and steak baby burrito with a Tecate or their enchiladas or chips & guacamole. My old office would get catering from them occasionally and it was always such a great day to be able to eat La Corneta for free. I miss this place.", "rating": 4, "date": "2005-06-11"}, {"excerpts": ["My favorite is the shrimp baby burrito or splitting a platter of the carne asada and shrimp, which comes with rice, beans, and tortillas. ", "Top it off with a fresa or melon agua fresa, and you're set. ", "Very clean, and very delicious."], "author": "Vanessa H.", "review": "We come here at least twice a month.  My favorite is the shrimp baby burrito or splitting a platter of the carne asada and shrimp, which comes with rice, beans, and tortillas. Top it off with a fresa or melon agua fresa, and you're set. Very clean, and very delicious.", "rating": 4, "date": "2006-09-25"}, {"excerpts": ["a supper baby burrito would be probably around $6.75 or so, a regular around $7 ", "maybe 8.. they do have a band that plays there almost every few days, or every other day.. ", "they have there own desserts, lots of food choices, different meats, there veggiterian burrito is also VERY good.. ", "they know how to stuff a burrito, lol.. this would be one of my main places to come to ", "if I want Mexican food..."], "author": "Mariana O.", "review": "I LOVE comming here, one of my favorite places, I always get there grilled chicken supper burrito, with spinach tortilla, really good.. I'm not sure about there drink menu, but where they have there sodas and other drinks, they have few options for beers, there Sangria is good. I'm not too sure if they have more drink options.. anyway, there prices are really good, and give you lots of food.. a supper baby burrito would be probably around $6.75 or so, a regular around $7 maybe 8.. they do have a band that plays there almost every few days, or every other day.. they have there own desserts, lots of food choices, different meats, there veggiterian burrito is also VERY good.. they know how to stuff a burrito, lol.. this would be one of my main places to come to if I want Mexican food...", "rating": 5, "date": "2011-06-02"}, {"excerpts": ["Delicious super baby burrito in clean, bright surroundings with lots of tables.  "], "author": "Esther R.", "review": "Delicious super baby burrito in clean, bright surroundings with lots of tables.  This is what El Toro used to be like back in the day...  except I could actually inhale a full size super burrito and the super baby option didn't exist.\n\nApart from the burritos and the environment, which are big pluses in my book, I have a lot of unfulfilled expectations.  Aguas frescas are too diluted with ice.  Chips need some salting.  No self-serve condiment bar.   I only get burritos 'to go' here.  They overwrap their burritos with foil (can mean unskilled composition and formation - loose burrito) and don't give you the plate and silverware necessary to really hunker down and do sloppy, carnivorous surgery and full-on salsa soaking.", "rating": 4, "date": "2007-04-16"}, {"excerpts": ["i wonder what the difference between that and a \"super baby burrito\" is??\n", "friend: maybe it has a red cape attached to it.\n", "me: [blank face, trying to think..] ", "*", "3 secs later", "*... OHHHH!! ", "HAHAHAHHA. ", "cuz its SUPER!!! ", "so anyways i ordered a 'super baby burrito with chicken and no beans' ", "so anyways i ordered a 'super baby burrito with chicken and no beans' "], "author": "Jennie L.", "review": "so yesterday after our belly dance class ended in the mission, we looked for a place to eat. there were taquerias on EVERY corner, so it was hard to decide on a place. we first passed on la corneta after seeing a sign on the door saying \"HOMOCIDE INFORMATION NEEDED, CALL POLICE.\" -we're like \"shit, i don't wanna get shot just tryna get a burrito!\" so we kept walking.... then 5 minutes later nothing else looked good so we turned around and went into la corneta, for some reason.\n\ni was looking on the menu at the burritos and saw they had baby burritos, and super baby burritos..\n\nme: oh shit, they have \"baby burritos\"! i wonder what the difference between that and a \"super baby burrito\" is??\nfriend: maybe it has a red cape attached to it.\nme: [blank face, trying to think..] *3 secs later*... OHHHH!! HAHAHAHHA. cuz its SUPER!!! AHHAHAHA\n\ni'm slow at getting jokes. and being starving made me 10 times even slower. so anyways i ordered a 'super baby burrito with chicken and no beans' (baby=smaller portion, and super=comes w/everything) and a bottle of sangria (even though it was non-alcoholic, it was was HELLA GOOD).  the meal was perfect, i savored every bite of that burrito. and before i left, i even got a churro to go for later :)\n\nin addition, the atmosphere was awesome -- they had a live bossanova band playing, and the high ceiling sun roof w/the little balconies with flowers on the walls made it seem like we were eating outdoors. a great place for families and cute for couples on a date ;) *hint hint*, i loooooove mexican food now! hahahah jk \n\n\np.s., don't let the homocide sign deter you from eating here, the food is reaaally good!!! :D", "rating": 5, "date": "2007-12-02"}, {"excerpts": ["I got a chicken baby burrito, and it was good, but not super noteworthy.  "], "author": "Nils J.", "review": "Excellent tacos.  My friend got a fish taco, which turned out to be salmon, something I'd never had in a taco before.  The salmon was easily the best single dish I'd tried during our entire wandering of the Mission and stopping at tacquerias.  It was simply seasoned, with salt and pepper, and then chargrilled to the perfect consistency and an excellent crust.  Amazing.\n\nI got a chicken baby burrito, and it was good, but not super noteworthy.  Definitely more charred than a few places, which I like.\n\nThe interior of this place is strange and huge, but there is ample seating and some good natural light.  If this were in New York, I would eat here every day and be a total lardass.", "rating": 4, "date": "2009-02-22"}, {"excerpts": ["A regular baby burrito is perfect for me, meaning I can get a full meal for only $4.00 here!  ", "What a deal!"], "author": "Diane L.", "review": "This place is one of the cleanest taquerias I've ever been to.  And the cleanliness doesn't come with a cost either, their prices are amazingly inexpensive, and are even lower than some neighboring competitors that like to charge for every addition and even exclusion of condiments (*ahem*cough* La Taqueria *cough*ahem*).  The ambiance is great, too.  The brightly colored murals on the walls and the live music makes for a really pleasant meal.\n\nCleanliness and ambiance aside, the food is good too.  My all-time favorite here is the carne asada.  It is so flavorful and with every bite, you can taste that fresh straight-off-the-grill flavor.  I like the portion sizes here too.  A regular baby burrito is perfect for me, meaning I can get a full meal for only $4.00 here!  What a deal!", "rating": 4, "date": "2008-03-10"}, {"excerpts": ["Super Baby Burrito.  ", "At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  ", "All of their ingredients seem to be of a very good quality.  ", "Also, good chips.", "At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  ", "All of their ingredients seem to be of a very good quality.  ", "Also, good chips."], "author": "Chadwick W.", "review": "While I know many people who swear by El Farolito when they're looking for a burrito, my vote goes to La Corneta.  Why?  Super Baby Burrito.  At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  All of their ingredients seem to be of a very good quality.  Also, good chips.", "rating": 5, "date": "2007-01-17"}, {"excerpts": ["I love the fact that you can order a baby burrito here.  ", "I can never finish a regular.  ", "As far as flavor, it is lacking a bit in this department ", "but i can't quite put my finger on it. ", "Let's talk about the rice-lose the peas and carrots please this isn't fried rice people!  ", "I prefer the one on Diamond but both locations are clean.  ", "Infact, so clean it smells like PineSol instead of Mexican food, ", "but ", "oh well!   ", "I give 3 stars for cleanliness and baby burrito option."], "author": "anne m.", "review": "I love the fact that you can order a baby burrito here.  I can never finish a regular.  As far as flavor, it is lacking a bit in this department but i can't quite put my finger on it. Let's talk about the rice-lose the peas and carrots please this isn't fried rice people!  I prefer the one on Diamond but both locations are clean.  Infact, so clean it smells like PineSol instead of Mexican food, but oh well!   I give 3 stars for cleanliness and baby burrito option.", "rating": 3, "date": "2008-06-25"}, {"excerpts": ["It used to be enough food for me, but for almost five dollars, their 'baby burrito\" would now leave a toddler hungry. ", "Love the mural, and the live music, but for take-out, I'm going elsewhere."], "author": "Linda F.", "review": "You can raise your prices, or reduce your portion size- but not both.   It used to be enough food for me, but for almost five dollars, their 'baby burrito\" would now leave a toddler hungry. Love the mural, and the live music, but for take-out, I'm going elsewhere.", "rating": 2, "date": "2009-01-30"}, {"excerpts": ["-- I'm a prawn baby burrito or prawn taco girl."], "author": "Amy E.", "review": "I'm giving La Corneta a 5 because it must be pretty good for me to eat there 1-3 times per week.  I work  2 blocks away and it's the most reliably tasty and fast place I go.  Almost always, the tacos and burritos are great -- I'm a prawn baby burrito or prawn taco girl.", "rating": 5, "date": "2009-02-14"}, {"excerpts": ["Love the super baby burrito! ", "The employees can be a bit rough around the edges but the end result is great."], "author": "Caroline S.", "review": "Love the super baby burrito! The employees can be a bit rough around the edges but the end result is great.", "rating": 3, "date": "2009-03-16"}], "super baby burrito": [{"excerpts": ["I got the super baby burrito with chicken. ", "It was really really good!! ", "The verde sauce is mild and delicious! "], "author": "Julia B.", "review": "Apparently, this is the spot where DIY burritos originated. You can customize your order, but nowhere near as much as chipotle. This is a good thing. You can choose between tortilla type, bean type, meat type and salsa type. According to someone I was eating with, you're supposed to be able to choose everything as they build our burrito in front of you. I just ordered with my options up front, and had no problem. \n\nI got the super baby burrito with chicken. It was really really good!! The verde sauce is mild and delicious! I really liked the flavor of the rice and beans. \n\nThe flour burrito it was wrapped in was thin, and wasn't great at holding in the filling. The last quarter of my burrito was eaten with a fork. If and when I go back, I'll ask them to double wrap it. \n\nMy dad got the gambas and said they were very good, not spicy. \n\nThey also have really yummy drinks (horchata, agua de fresa, agua de piña, etc) and churros.", "rating": 4, "date": "2018-03-29"}, {"excerpts": ["I normally order my standard carne asada super baby burrito and that normally fills me up. "], "author": "Melissa N.", "review": "This is a large sit down Mexican restaurant with a fairly large selection of things to order. It's located among a large number of Mexican eateries on Mission Street. Seating is abundant and during lunch time there normally is a line, but it goes by pretty quick as they push out freshly made orders fairly fast. There's also a mariachi band sometimes which can either be a good or bad thing.\n\nI normally order my standard carne asada super baby burrito and that normally fills me up. For about $7+ you get a decent size burrito with meat, cheese, lettuce, sour cream, rice, and salsa, plus a small bag of chips. What a deal! Though it's not my favorite or the most delicious tasting burrito, this place has great prices and value for their food. The service is also very fast compared to other places. Definately a win in my book!", "rating": 4, "date": "2016-10-26"}, {"excerpts": ["The portions here are generous in size - I got the Super Baby Burrito (sounds like an oxymoron!), but it's a smaller sized burrito that comes with meat, rice, beans, cheese, salsa, sour cream, guacamole, lettuce, tomato and salsa for $7. ", "You can get just the Baby Burrito for $5.50, but that just comes with the meat, rice, beans, cheese, and salsa, so I think it's worth the extra $1.50 for the guacamole and other things. ", "Seeing as that a burrito at Chipotle costs just as much as this Super Baby Burrito (if not more) ", "and it's not as authentic and flavorful", ", this is a much better option! ", "Seeing as that a burrito at Chipotle costs just as much as this Super Baby Burrito (if not more) ", "and it's not as authentic and flavorful", ", this is a much better option! ", "The Super Baby Burrito was filling but not to the point where I thought I would explode after eating.\n\n", "The Super Baby Burrito was filling but not to the point where I thought I would explode after eating.\n\n"], "author": "Christina L.", "review": "I know everyone loves La Taq and you can see the line snaking outside the restaurant sometimes, but I think it's overrated and overpriced and I actually prefer Pancho Villa or this little gem, La Corneta Taqueria. The location is super convenient, just half a block away from the 24th St. BART station (between 23rd and 24th on Mission St.), the restaurant is decently sized - maybe the same size as Pancho Villa and maybe 30-40% bigger than La Taq.\n\nThe portions here are generous in size - I got the Super Baby Burrito (sounds like an oxymoron!), but it's a smaller sized burrito that comes with meat, rice, beans, cheese, salsa, sour cream, guacamole, lettuce, tomato and salsa for $7. You can get just the Baby Burrito for $5.50, but that just comes with the meat, rice, beans, cheese, and salsa, so I think it's worth the extra $1.50 for the guacamole and other things. Seeing as that a burrito at Chipotle costs just as much as this Super Baby Burrito (if not more) and it's not as authentic and flavorful, this is a much better option! The Super Baby Burrito was filling but not to the point where I thought I would explode after eating.\n\nThe fillings: you can pick between refried or black beans, you can make your burrito spicy or mild. The rice is flavorful and has peas and some other veggies in there, so it's not just plain white rice with cilantro. The chicken I got was well seasoned and a little grilled, so it was better than the chicken at La Taq that seems to just be boiled and flavorless.\n\nIf you dine in, they have 2 kinds of salsa on the table that you can squeeze on your burrito. No salsa bar like Pancho Villa. They will give you some chips too, but they were a little bit too greasy for my taste.\n\nIf burritos aren't your thing, you can also get tacos, quesadillas, nachos, or other combinations/special plates. You should be able to find something that you like here - there are a ton of options. They take credit card which is always nice (unlike La Taq that is only cash), and the space is fairly large and spacious so you won't feel like you're eating on top of someone else.\n\nI'll definitely come back here again next time I'm in the mood for a burrito or authentic Mexican food. They have locations in Glen Park, San Carlos and Burlingame too!", "rating": 4, "date": "2017-04-04"}, {"excerpts": ["The carne asada super baby burrito was good and this place doesn't usually have a queue ", "so I would recommend if you're in the area ", ":) ", "Definitely had a food baby from that baby burrito"], "author": "Hana S.", "review": "Pro tip: I discovered that he super baby burritos are basically the same size as the regular burritos, but have guac and all the good stuff in them. They're of course a tiny bit cheaper which is nice (AND THEY HAVE GUAC). \n\nEvery order comes with a side of chips (YAY), the chips weren't the best and were kind of greasy but they were free so I loved them with no discrimination. Salsas are available and you can get a quarter pint of guac for ~$4. The carne asada super baby burrito was good and this place doesn't usually have a queue so I would recommend if you're in the area :) Definitely had a food baby from that baby burrito", "rating": 4, "date": "2017-01-30"}, {"excerpts": ["I always get the super baby burrito and try different meat each time.  ", "Boyfriend try's different meal each time as well. ", "Never go wrong with them. ", "A+++"], "author": "Angel C.", "review": "We love this place. Friendly staff always. Always clean. Super fast even when the line is long and reasonably  priced and great food. They will customize whatever you want without a complaint. I always get the super baby burrito and try different meat each time.  Boyfriend try's different meal each time as well. Never go wrong with them. A+++", "rating": 5, "date": "2018-03-02"}, {"excerpts": ["Ordered the typical chicken super baby burrito and it was lifeless. ", "While I was eating it, my mind drifted to wondering how much happier I would have been if I had one of the bacon wrapped hot dog just selling outside on the sidewalk a block away. ", "Their chips were a little thick for my liking and their fresh tomato salsa "], "author": "Elaine Y.", "review": "This place is like a fast-burrito food joint. You order your dish, they make it with pre-made ingredients at the counter, go down the line and boom, you end up with a luke warm burrito that doesn't sing with flavor. Ordered the typical chicken super baby burrito and it was lifeless. While I was eating it, my mind drifted to wondering how much happier I would have been if I had one of the bacon wrapped hot dog just selling outside on the sidewalk a block away. Their chips were a little thick for my liking and their fresh tomato salsa didn't look so fresh (I assumed so because the tomatoes used were very pale).\n\nThen I also had a major accident with one of their bottled salsa. It was so chunky that the tomato was stuck at the spout and when I squeezed a little harder, half a bottle of the salsa blasted on my boyfriend who was sitting next to me. I know when sometimes food get messy and everywhere, it means it's loaded with deliciousness, but this wasn't what I had pictured in mind.\n\n(+1 for having a big place with many seating)", "rating": 2, "date": "2012-01-18"}, {"excerpts": ["My husband got the super baby burrito with shrimp and his didn't have any cheese either. ", "I don't usually eat burritos in Mexican restaurants, I think of them as Gringo food because I've traveled all over Mexico and actually lived part of the year in Jalisco, and they don't serve burritos unless it's in an American style restaurant. ", "But, this food so lacked in flavor that I would be afraid to try the tacos. ", "I also have to say ", "although everyone speaks Spanish there, I don't think the operators of this Mexican restaurant are Mexican. ", "They sound Central American and the food is more Central American style. ", "If I want that, I would go down the street and have a pupusa or nacatamal. ", "Central American food isn't typically as spicy as Mexican ", "so I think my assumption is correct. ", "I'm really surprised that it's so hard to find good Mexican in SF, but I'll keep trying."], "author": "Tess S.", "review": "Yelpers, you really screwed me on this one! I was craving Mexican, so we made a special trip over here on a Saturday, had to park 5 blocks away, walk by the disgusting urine infested Bart depot (made me gag before I even got there). We walked in and there was a line at the counter, but we must've looked the type who were going to sit down, so the waitress came up to us and asked (in Spanish) if we were going to \"eat here\" and she told us to sit down and she brought us a basked of chips and menus. The salsa with the chips was pico de gallo. There were also two bottle of salsa on the table. NONE of these salsas had any flavor. No lie. They lacked salt. I have a heart condition, so I'm not a big salt eater, so that should tell you something. I ended up ordering the baby burrito with chicken and mole because of all the rave reviews. She brought another salsa (making it 4 total different salsas). Again, no flavor. I had asked for no rice in the burrito (doesn't belong there!). But, they didn't put any cheese in it like the menu described. My husband got the super baby burrito with shrimp and his didn't have any cheese either. I don't usually eat burritos in Mexican restaurants, I think of them as Gringo food because I've traveled all over Mexico and actually lived part of the year in Jalisco, and they don't serve burritos unless it's in an American style restaurant. But, this food so lacked in flavor that I would be afraid to try the tacos. I also have to say although everyone speaks Spanish there, I don't think the operators of this Mexican restaurant are Mexican. They sound Central American and the food is more Central American style. If I want that, I would go down the street and have a pupusa or nacatamal. Central American food isn't typically as spicy as Mexican so I think my assumption is correct. I'm really surprised that it's so hard to find good Mexican in SF, but I'll keep trying.", "rating": 2, "date": "2013-10-12"}, {"excerpts": ["Decided to grab a carne asada \"super baby burrito.", "\" ", "For being a baby burrito, it was a pretty good size. ", "Everything inside tasted fresh and delicious."], "author": "Sebastian C.", "review": "Pretty damn good. Rolled through here on a Sunday night after a long, tiring day at work. Decided to grab a carne asada \"super baby burrito.\" For being a baby burrito, it was a pretty good size. Everything inside tasted fresh and delicious.", "rating": 5, "date": "2013-09-22"}, {"excerpts": ["I love the option of the super BABY burrito, grilled chicken, with black beans on a spinach tortilla. ", "I love the super quesadilla. "], "author": "Val B.", "review": "I love the option of the super BABY burrito, grilled chicken, with black beans on a spinach tortilla. I love the super quesadilla. I love love loves the super nachos. \n\nThis place has so many memories for me. My dentist is within the area.  I always get a cleaning.  Mess it up by eating one nice juicy burrito.", "rating": 4, "date": "2010-05-16"}, {"excerpts": ["Delicious super baby burrito in clean, bright surroundings with lots of tables.  "], "author": "Esther R.", "review": "Delicious super baby burrito in clean, bright surroundings with lots of tables.  This is what El Toro used to be like back in the day...  except I could actually inhale a full size super burrito and the super baby option didn't exist.\n\nApart from the burritos and the environment, which are big pluses in my book, I have a lot of unfulfilled expectations.  Aguas frescas are too diluted with ice.  Chips need some salting.  No self-serve condiment bar.   I only get burritos 'to go' here.  They overwrap their burritos with foil (can mean unskilled composition and formation - loose burrito) and don't give you the plate and silverware necessary to really hunker down and do sloppy, carnivorous surgery and full-on salsa soaking.", "rating": 4, "date": "2007-04-16"}, {"excerpts": ["i wonder what the difference between that and a \"super baby burrito\" is??\n", "friend: maybe it has a red cape attached to it.\n", "me: [blank face, trying to think..] ", "*", "3 secs later", "*... OHHHH!! ", "HAHAHAHHA. ", "cuz its SUPER!!! ", "so anyways i ordered a 'super baby burrito with chicken and no beans' ", "so anyways i ordered a 'super baby burrito with chicken and no beans' "], "author": "Jennie L.", "review": "so yesterday after our belly dance class ended in the mission, we looked for a place to eat. there were taquerias on EVERY corner, so it was hard to decide on a place. we first passed on la corneta after seeing a sign on the door saying \"HOMOCIDE INFORMATION NEEDED, CALL POLICE.\" -we're like \"shit, i don't wanna get shot just tryna get a burrito!\" so we kept walking.... then 5 minutes later nothing else looked good so we turned around and went into la corneta, for some reason.\n\ni was looking on the menu at the burritos and saw they had baby burritos, and super baby burritos..\n\nme: oh shit, they have \"baby burritos\"! i wonder what the difference between that and a \"super baby burrito\" is??\nfriend: maybe it has a red cape attached to it.\nme: [blank face, trying to think..] *3 secs later*... OHHHH!! HAHAHAHHA. cuz its SUPER!!! AHHAHAHA\n\ni'm slow at getting jokes. and being starving made me 10 times even slower. so anyways i ordered a 'super baby burrito with chicken and no beans' (baby=smaller portion, and super=comes w/everything) and a bottle of sangria (even though it was non-alcoholic, it was was HELLA GOOD).  the meal was perfect, i savored every bite of that burrito. and before i left, i even got a churro to go for later :)\n\nin addition, the atmosphere was awesome -- they had a live bossanova band playing, and the high ceiling sun roof w/the little balconies with flowers on the walls made it seem like we were eating outdoors. a great place for families and cute for couples on a date ;) *hint hint*, i loooooove mexican food now! hahahah jk \n\n\np.s., don't let the homocide sign deter you from eating here, the food is reaaally good!!! :D", "rating": 5, "date": "2007-12-02"}, {"excerpts": ["Super Baby Burrito.  ", "At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  ", "All of their ingredients seem to be of a very good quality.  ", "Also, good chips.", "At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  ", "All of their ingredients seem to be of a very good quality.  ", "Also, good chips."], "author": "Chadwick W.", "review": "While I know many people who swear by El Farolito when they're looking for a burrito, my vote goes to La Corneta.  Why?  Super Baby Burrito.  At only a few cents more than the price of a Regular burrito at El Farolito, the Super Baby Burrito has all the fixins, and in my opinion it is a more manageable quantity.  All of their ingredients seem to be of a very good quality.  Also, good chips.", "rating": 5, "date": "2007-01-17"}, {"excerpts": ["Love the super baby burrito! ", "The employees can be a bit rough around the edges but the end result is great."], "author": "Caroline S.", "review": "Love the super baby burrito! The employees can be a bit rough around the edges but the end result is great.", "rating": 3, "date": "2009-03-16"}], "regular prawn burrito": [], "super prawn burrito": [{"excerpts": ["Got a Super Prawn Burrito and it was delicious. ", "Would defiantly go back to this Location."], "author": "Rebecca Q.", "review": "Got a Super Prawn Burrito and it was delicious. Would defiantly go back to this Location.", "rating": 4, "date": "2017-04-07"}, {"excerpts": ["Giving this little dine in restaurant 5 stars because the super prawn burrito was the highlight of my day!"], "author": "Ashley B.", "review": "Was looking for good mexican food in the mission and just bumped into this placed. Giving this little dine in restaurant 5 stars because the super prawn burrito was the highlight of my day!", "rating": 5, "date": "2016-04-01"}, {"excerpts": ["This past weekend, I split the super prawn burrito with my friend and got the nachos to share and got 2 al frescas (strawberry & cantaloupe). ", "Nachos were ok..great to share. "], "author": "James L.", "review": "I have not been here for years and surprised I have not yelped this place. I finally came by this weekend and was able to eat here again. \n\nI love their Super Prawn burrito or their Garlic Prawns..YUMMY!! I like to get away from the usual chicken or pork. This past weekend, I split the super prawn burrito with my friend and got the nachos to share and got 2 al frescas (strawberry & cantaloupe). Nachos were ok..great to share. The al frescas were flavorful. \n\nThis is my favorite Mexican restaurant, but I am not a connoisseur of Mexican food, but I do like the food here..=)", "rating": 5, "date": "2010-08-30"}, {"excerpts": ["I love the super prawn burrito. ", "I always thought that seafood tasted terrible when mixed with rice and beans but this taqueria showed me that I  was  wrong. ", "This restaurant and el farolito are the best places to get Mexican food in the outter mission."], "author": "Karina G.", "review": "I love the super prawn burrito. I always thought that seafood tasted terrible when mixed with rice and beans but this taqueria showed me that I  was  wrong. This restaurant and el farolito are the best places to get Mexican food in the outter mission.", "rating": 4, "date": "2014-07-26"}, {"excerpts": ["I paid about $9.71 (after tax) for a super prawn burrito which had prawns, rice, beans, guac, sour cream, cheese, and salsa. "], "author": "Nikhil G.", "review": "The food was delicious, and the burrito was huge. I paid about $9.71 (after tax) for a super prawn burrito which had prawns, rice, beans, guac, sour cream, cheese, and salsa. It was huge and tasty, but there were no more than maybe 8 prawns in the whole thing, which was unfortunate.\n\nThere was a ton of seating area, which was nice. I noticed that the entire menu was a decent bit pricier than a lot of the mission (for example, a single taco ran from $3-$5.50)...for a tiny taco! But the super burrito or quesadilla wasn't a bad deal.", "rating": 4, "date": "2012-07-15"}, {"excerpts": ["I have to recommend the super prawn burrito. ", "It's so damned good "], "author": "Mark G.", "review": "This place is great, albeit a bit expensive as taquerias go.\n\nI have to recommend the super prawn burrito. It's so damned good it'll make your head explode.\n\nPair that with a Negro Modelo and you'll have a fine meal, my friend.", "rating": 4, "date": "2007-01-30"}], "steak and prawn burrito": [{"excerpts": ["This place has the best steak and prawn burrito, hands down. ", "When you're looking to get away from El Farolito's tiny restaurant and the huge line, head down Mission to La Corneta to sit down and enjoy that burrito."], "author": "Marjo M.", "review": "This place has the best steak and prawn burrito, hands down. When you're looking to get away from El Farolito's tiny restaurant and the huge line, head down Mission to La Corneta to sit down and enjoy that burrito.", "rating": 5, "date": "2014-08-09"}, {"excerpts": ["I love their baby steak and prawn burrito. ", "They don't skimp on the meat and the food is always well seasoned and generously portioned. ", "Their chips and salsa are pretty standard ", "but I do love their agua fresca. ", "If you want a good burrito for a good price, can't beat this place."], "author": "Tab C.", "review": "My go-to place for burritos in the Mission. My whole family and I have lived in the mission for over 20 years and we have tried A LOT of taquerias. We have seen them have their ups and downs and right now my current favorite is La Corneta. They have a large selection of food and drink and a giant dining room so you can actually sit down and eat! The staff are all polite, they are very quick and not to mention the food is delicious. I love their baby steak and prawn burrito. They don't skimp on the meat and the food is always well seasoned and generously portioned. Their chips and salsa are pretty standard but I do love their agua fresca. If you want a good burrito for a good price, can't beat this place.", "rating": 4, "date": "2012-05-02"}], "super steak and prawn burrito": [], "baby prawn burrito": [], "super baby prawn burrito": [], "fish burrito": [{"excerpts": ["The fish burrito was not breaded fish, which is a nice distinction from most others in the mission."], "author": "Marcel M.", "review": "Big fan. Lots of seating, free chips, solid burritos, and creamy horchata. The fish burrito was not breaded fish, which is a nice distinction from most others in the mission.", "rating": 5, "date": "2017-10-11"}, {"excerpts": ["Got a super fish burrito. ", "Delicious! ", "The burrito is huge too! ", "I could only eat half before feeling full. ", "They have a green sauce and a red sauce in condiment bottles that you can take to your table. ", "The green sauce is amazing! ", "I couldn't really pinpoint what exactly it was, but I showered my burrito in it for sure. ", "They do give tortilla chips as well. ", "However, I wish they had a self-serve salsa bar life most taquerias have. ", "They literally give you 2 salsas to choose from, mild or hot."], "author": "Lexi R.", "review": "Got a super fish burrito. Delicious! The burrito is huge too! I could only eat half before feeling full. They have a green sauce and a red sauce in condiment bottles that you can take to your table. The green sauce is amazing! I couldn't really pinpoint what exactly it was, but I showered my burrito in it for sure. They do give tortilla chips as well. However, I wish they had a self-serve salsa bar life most taquerias have. They literally give you 2 salsas to choose from, mild or hot.", "rating": 4, "date": "2017-03-17"}, {"excerpts": ["Super baby fish burrito was my favorite - perfect portion and tasty! ", "Choice of salmon or tilapia. ", "Super baby size was just filling enough for me, with the \"super\" fillings (avocado etc.). ", "Would certainly come back for another super baby fish burrito or other items on their huge menu!", "Would certainly come back for another super baby fish burrito or other items on their huge menu!", "Would certainly come back for another super baby fish burrito or other items on their huge menu!"], "author": "Jaclyn C.", "review": "Used to go to El Farolito nearby, but they stopped having fish burritos and we discovered La Corneta. I loved the ambience of this taqueria, plenty of space, high ceiling, festive decor and they had mariachi band every time we were there.\n\nSuper baby fish burrito was my favorite - perfect portion and tasty! Choice of salmon or tilapia. Super baby size was just filling enough for me, with the \"super\" fillings (avocado etc.). I was hoping the tortilla could be more toasted, but it was great overall with complimentary chips.\n\nWe usually sit further away from the mariachi band, so that we could enjoy conversation with music in the background. Would certainly come back for another super baby fish burrito or other items on their huge menu!", "rating": 4, "date": "2016-03-28"}, {"excerpts": ["My super fish burrito and my friend's super veggie burrito ", "both sucked. ", "Cold cheese. ", "No sour cream or guacamole. ", "Crap food and bland flavor. ", "Cold burrito? ", "Seriously? ", "There are way better taquerias close by. ", "I don't know why everyone on yelp loves this place."], "author": "Kristen F.", "review": "My super fish burrito and my friend's super veggie burrito both sucked. Cold cheese. No sour cream or guacamole. Crap food and bland flavor. Cold burrito? Seriously? There are way better taquerias close by. I don't know why everyone on yelp loves this place.", "rating": 1, "date": "2012-11-06"}, {"excerpts": ["I also had a regular baby fish burrito which was pretty big.  ", "It had salmon, rice, beans and salsa ", "so it was very filling.  "], "author": "Seong P.", "review": "I need to stop forgetting to take water to the gym.  After working out at Mission Cliffs, we came here because the mango agua fresca was supposed to be really good.  It was but because I was very thirsty, I almost finished a large in one big slurp.  Then I got a strawberry one and it tasted like syrup.  Pass.\n\nI also had a regular baby fish burrito which was pretty big.  It had salmon, rice, beans and salsa so it was very filling.  I didn't find it to be a wet burrito like I have read in other reviews.  \n\nThe place is huge, clean and open fairly late.", "rating": 3, "date": "2009-05-20"}, {"excerpts": ["Before I got tired of the yummy greasy affair that is the Can Cun \"vegetarian\" burrito I never ate here because I couldn't see the point in ordering a steamed tortilla with cold cheese and lettuce on top of  otherwise decent ingredients, but having discovered the fish burrito, which begins with a fresh filet of salmon, I have to say that there is one thing I will overlook a steamed tortilla for: a fresh filet of salmon--with spanish rice, black beans, and salsa. ", "That's all. ", "Simple as can be, less than $8 (salmon prices what they are that ain't bad),  and absolutely delicious. ", "Your cats will pester you if you get one to go, but throw them a little piece of fish ", "and you'll be fine. ", "There's plenty to go around if you get the big boy size."], "author": "Erik S.", "review": "You steam a tortilla, you only get three stars. That's the rule.\n\nBefore I got tired of the yummy greasy affair that is the Can Cun \"vegetarian\" burrito I never ate here because I couldn't see the point in ordering a steamed tortilla with cold cheese and lettuce on top of  otherwise decent ingredients, but having discovered the fish burrito, which begins with a fresh filet of salmon, I have to say that there is one thing I will overlook a steamed tortilla for: a fresh filet of salmon--with spanish rice, black beans, and salsa. That's all. Simple as can be, less than $8 (salmon prices what they are that ain't bad),  and absolutely delicious. Your cats will pester you if you get one to go, but throw them a little piece of fish and you'll be fine. There's plenty to go around if you get the big boy size.", "rating": 3, "date": "2006-11-01"}, {"excerpts": ["The fish burrito (big slab of salmon, cooked on the grill) is unlike anything I've had anywhere else--and there are so many choices on the menu ", "I doubt I'll ever get to them all.  ", "While there are plenty of other great places for Mexican food in the Mission, this is a good one because the food is consistently excellent and it's big, clean and yep - clean bathrooms too."], "author": "Matt K.", "review": "Yeah, it's the clean Mission Burrito place.  I like the Diamond Street location too, but usually when I'm in the city, this one is more convenient.  The fish burrito (big slab of salmon, cooked on the grill) is unlike anything I've had anywhere else--and there are so many choices on the menu I doubt I'll ever get to them all.  While there are plenty of other great places for Mexican food in the Mission, this is a good one because the food is consistently excellent and it's big, clean and yep - clean bathrooms too.", "rating": 5, "date": "2010-01-26"}, {"excerpts": ["Super baby fish burrito is delicious (made with fresh salmon not nasty fried filet-o-fish that some \"tacquerias\" serve).  ", "The horchata (spelling is probably wrong b/c ", "I'm a white girl) is like liquified bread pudding.  ", "Quac is tasty as well.  "], "author": "AngelaS F.", "review": "LOVE IT!!!!!!!!!!!!!!!!!!!!!  Super baby fish burrito is delicious (made with fresh salmon not nasty fried filet-o-fish that some \"tacquerias\" serve).  The horchata (spelling is probably wrong b/c I'm a white girl) is like liquified bread pudding.  Quac is tasty as well.  This place uses quality ingredients and you can really taste the difference.\n\nLa Corneta has colorful murals, mariachi bands on occasion and decent bathrooms to boot.", "rating": 5, "date": "2007-01-30"}, {"excerpts": ["Great salmon burritos (order the \"Super Fish Burrito\"), steak quesadillas and salsa, plus the decor is very attractive. ", "My one big issue is that the cashier/checkout is usually pretty disorganized, with the staff trying to ring up customers while simultaneously helping out behind the food counter, fielding demands from restaurant customers who've suddenly remembered they want chips or drinks, or weirdly abandoning their post to wander back into the kitchen.  ", "But that's really my only issue, otherwise I love La Corneta and go there every week."], "author": "Marisa R.", "review": "Great salmon burritos (order the \"Super Fish Burrito\"), steak quesadillas and salsa, plus the decor is very attractive. My one big issue is that the cashier/checkout is usually pretty disorganized, with the staff trying to ring up customers while simultaneously helping out behind the food counter, fielding demands from restaurant customers who've suddenly remembered they want chips or drinks, or weirdly abandoning their post to wander back into the kitchen.  But that's really my only issue, otherwise I love La Corneta and go there every week.", "rating": 4, "date": "2011-07-08"}], "super fish burrito": [{"excerpts": ["Got a super fish burrito. ", "Delicious! ", "The burrito is huge too! ", "I could only eat half before feeling full. ", "They have a green sauce and a red sauce in condiment bottles that you can take to your table. ", "The green sauce is amazing! ", "I couldn't really pinpoint what exactly it was, but I showered my burrito in it for sure. ", "They do give tortilla chips as well. ", "However, I wish they had a self-serve salsa bar life most taquerias have. ", "They literally give you 2 salsas to choose from, mild or hot."], "author": "Lexi R.", "review": "Got a super fish burrito. Delicious! The burrito is huge too! I could only eat half before feeling full. They have a green sauce and a red sauce in condiment bottles that you can take to your table. The green sauce is amazing! I couldn't really pinpoint what exactly it was, but I showered my burrito in it for sure. They do give tortilla chips as well. However, I wish they had a self-serve salsa bar life most taquerias have. They literally give you 2 salsas to choose from, mild or hot.", "rating": 4, "date": "2017-03-17"}, {"excerpts": ["My super fish burrito and my friend's super veggie burrito ", "both sucked. ", "Cold cheese. ", "No sour cream or guacamole. ", "Crap food and bland flavor. ", "Cold burrito? ", "Seriously? ", "There are way better taquerias close by. ", "I don't know why everyone on yelp loves this place."], "author": "Kristen F.", "review": "My super fish burrito and my friend's super veggie burrito both sucked. Cold cheese. No sour cream or guacamole. Crap food and bland flavor. Cold burrito? Seriously? There are way better taquerias close by. I don't know why everyone on yelp loves this place.", "rating": 1, "date": "2012-11-06"}, {"excerpts": ["Great salmon burritos (order the \"Super Fish Burrito\"), steak quesadillas and salsa, plus the decor is very attractive. ", "My one big issue is that the cashier/checkout is usually pretty disorganized, with the staff trying to ring up customers while simultaneously helping out behind the food counter, fielding demands from restaurant customers who've suddenly remembered they want chips or drinks, or weirdly abandoning their post to wander back into the kitchen.  ", "But that's really my only issue, otherwise I love La Corneta and go there every week."], "author": "Marisa R.", "review": "Great salmon burritos (order the \"Super Fish Burrito\"), steak quesadillas and salsa, plus the decor is very attractive. My one big issue is that the cashier/checkout is usually pretty disorganized, with the staff trying to ring up customers while simultaneously helping out behind the food counter, fielding demands from restaurant customers who've suddenly remembered they want chips or drinks, or weirdly abandoning their post to wander back into the kitchen.  But that's really my only issue, otherwise I love La Corneta and go there every week.", "rating": 4, "date": "2011-07-08"}], "baby fish burrito": [{"excerpts": ["Super baby fish burrito was my favorite - perfect portion and tasty! ", "Choice of salmon or tilapia. ", "Super baby size was just filling enough for me, with the \"super\" fillings (avocado etc.). ", "Would certainly come back for another super baby fish burrito or other items on their huge menu!", "Would certainly come back for another super baby fish burrito or other items on their huge menu!", "Would certainly come back for another super baby fish burrito or other items on their huge menu!"], "author": "Jaclyn C.", "review": "Used to go to El Farolito nearby, but they stopped having fish burritos and we discovered La Corneta. I loved the ambience of this taqueria, plenty of space, high ceiling, festive decor and they had mariachi band every time we were there.\n\nSuper baby fish burrito was my favorite - perfect portion and tasty! Choice of salmon or tilapia. Super baby size was just filling enough for me, with the \"super\" fillings (avocado etc.). I was hoping the tortilla could be more toasted, but it was great overall with complimentary chips.\n\nWe usually sit further away from the mariachi band, so that we could enjoy conversation with music in the background. Would certainly come back for another super baby fish burrito or other items on their huge menu!", "rating": 4, "date": "2016-03-28"}, {"excerpts": ["I also had a regular baby fish burrito which was pretty big.  ", "It had salmon, rice, beans and salsa ", "so it was very filling.  "], "author": "Seong P.", "review": "I need to stop forgetting to take water to the gym.  After working out at Mission Cliffs, we came here because the mango agua fresca was supposed to be really good.  It was but because I was very thirsty, I almost finished a large in one big slurp.  Then I got a strawberry one and it tasted like syrup.  Pass.\n\nI also had a regular baby fish burrito which was pretty big.  It had salmon, rice, beans and salsa so it was very filling.  I didn't find it to be a wet burrito like I have read in other reviews.  \n\nThe place is huge, clean and open fairly late.", "rating": 3, "date": "2009-05-20"}, {"excerpts": ["Super baby fish burrito is delicious (made with fresh salmon not nasty fried filet-o-fish that some \"tacquerias\" serve).  ", "The horchata (spelling is probably wrong b/c ", "I'm a white girl) is like liquified bread pudding.  ", "Quac is tasty as well.  "], "author": "AngelaS F.", "review": "LOVE IT!!!!!!!!!!!!!!!!!!!!!  Super baby fish burrito is delicious (made with fresh salmon not nasty fried filet-o-fish that some \"tacquerias\" serve).  The horchata (spelling is probably wrong b/c I'm a white girl) is like liquified bread pudding.  Quac is tasty as well.  This place uses quality ingredients and you can really taste the difference.\n\nLa Corneta has colorful murals, mariachi bands on occasion and decent bathrooms to boot.", "rating": 5, "date": "2007-01-30"}], "super baby fish burrito": [{"excerpts": ["Super baby fish burrito was my favorite - perfect portion and tasty! ", "Choice of salmon or tilapia. ", "Super baby size was just filling enough for me, with the \"super\" fillings (avocado etc.). ", "Would certainly come back for another super baby fish burrito or other items on their huge menu!", "Would certainly come back for another super baby fish burrito or other items on their huge menu!", "Would certainly come back for another super baby fish burrito or other items on their huge menu!"], "author": "Jaclyn C.", "review": "Used to go to El Farolito nearby, but they stopped having fish burritos and we discovered La Corneta. I loved the ambience of this taqueria, plenty of space, high ceiling, festive decor and they had mariachi band every time we were there.\n\nSuper baby fish burrito was my favorite - perfect portion and tasty! Choice of salmon or tilapia. Super baby size was just filling enough for me, with the \"super\" fillings (avocado etc.). I was hoping the tortilla could be more toasted, but it was great overall with complimentary chips.\n\nWe usually sit further away from the mariachi band, so that we could enjoy conversation with music in the background. Would certainly come back for another super baby fish burrito or other items on their huge menu!", "rating": 4, "date": "2016-03-28"}, {"excerpts": ["Super baby fish burrito is delicious (made with fresh salmon not nasty fried filet-o-fish that some \"tacquerias\" serve).  ", "The horchata (spelling is probably wrong b/c ", "I'm a white girl) is like liquified bread pudding.  ", "Quac is tasty as well.  "], "author": "AngelaS F.", "review": "LOVE IT!!!!!!!!!!!!!!!!!!!!!  Super baby fish burrito is delicious (made with fresh salmon not nasty fried filet-o-fish that some \"tacquerias\" serve).  The horchata (spelling is probably wrong b/c I'm a white girl) is like liquified bread pudding.  Quac is tasty as well.  This place uses quality ingredients and you can really taste the difference.\n\nLa Corneta has colorful murals, mariachi bands on occasion and decent bathrooms to boot.", "rating": 5, "date": "2007-01-30"}], "rice and beans burrito": [], "regular vegetarian burrito": [], "super vegetarian burrito": [{"excerpts": ["We had a super vegetarian burrito and some chips and guacamole. ", "Friendly, fast, and clean!!!!"], "author": "Amy G.", "review": "Delicious ! Just brought our group of 13 Girl Scouts to have lunch based on a local's tip! \nSo glad we followed her lead. \nWe had a super vegetarian burrito and some chips and guacamole. Friendly, fast, and clean!!!!", "rating": 5, "date": "2018-05-16"}, {"excerpts": ["I got the super vegetarian burrito without cheese so basically vegan!! ", "And it was so delicious so yummy!!!! ", "5/5 stars yes!!!! ", "So affordable $6.50 with guac so like half of the cost of chipotle. ", "I am so happy"], "author": "Audrey K.", "review": "So so yummy!!! I got the super vegetarian burrito without cheese so basically vegan!! And it was so delicious so yummy!!!! 5/5 stars yes!!!! So affordable $6.50 with guac so like half of the cost of chipotle. I am so happy", "rating": 5, "date": "2017-06-20"}, {"excerpts": ["On my first visit my super vegetarian burrito ($5.25) came with complimentary chips, black beans, rice, cheese, guacamole, lettuce, tomato and salsa. ", "I wasn't too impressed with their burrito as it was dry on the spots that were without guacamole. ", "I thought it had too much fresh lettuce and the salsa was bland. "], "author": "Daniel L.", "review": "I've been on a quest to find a taqueria in the Mission that beats El Farolito. La Corneta has always piqued my interest with its clean and spacious ambiance decorated with red tiled floors and a colorful blend of red, orange, yellow, and other vibrant colors to bring a festive vibe. It's a bit smoky at the entrance where they broil and grill their meat to bring you an instantaneous aromatic introduction. This is also where you get to glance at the huge wall menu with a long food counter with all sorts of eye-popping meat, rice, beans and all the Mexican goodies you can imagine.\n\nI've been to here twice, once for dinner on a weeknight another on a festive weekend that had a celebratory mariachi band where the place was bursting with people from all walks of life. On my first visit my super vegetarian burrito ($5.25) came with complimentary chips, black beans, rice, cheese, guacamole, lettuce, tomato and salsa. I wasn't too impressed with their burrito as it was dry on the spots that were without guacamole. I thought it had too much fresh lettuce and the salsa was bland. It wasn't the most flavorful and the experience was over-dependent on the red and green salsa located at each table.\n\nMy second visit I ordered a chicken tamal and pork tamal with rice, black beans, lettuce, guacamole, and salsa ($7.75). The chicken tamal was dry and bland but the pork tamal was tasty with tender fat trimmings to keep me engaged the whole time. I thought the rice and beans were decent but the complimentary chips could be better warmed and salted. Salsa again could and should include chopped jalapeno to induce a spicy kick instead of letting it fell flat. My order of large melon aqua fresca ($2.50) was refreshing and a nice finisher. I did not receive my stack of tortillas even though it was clearly stated on the menu. \n\nOverall, I thought their prices were higher than others in the Mission while in exchange the food had very good portions but the flavor was not exciting enough to match its beautiful decor. I saw many Mexican customers ordering their carne asada so that might be a dish to look into for those interested. This place is spacious and has the room to support large groups and families. 3 stars for the overall experience.", "rating": 3, "date": "2009-12-31"}, {"excerpts": ["what I get here is a super vegetarian burrito. ", "However recently the burritos taste like they don't add enough love into them, seriously though a lot of the time I would be missing guacamole or sour cream and a few times I would just get beans rice and cheese. ", "Now, this kind of sucks already but also sometimes it would have a stale taste to me. ", "Still, burritos aren't the only thing they do. ", "They also serve entrees like sauteed shrimp with mushrooms. ", "These are great, I only wish they didn't add two huge sides of lettuce and refried beans and more shrimp or mushrooms instead. ", "This place is good but not my go-to anymore. ", "Definitely a good place to go and the mariachi music on fridays is nice if your into that."], "author": "Dan B.", "review": "This place was my go to burrito spot a while back. That's mostly what I get here is a super vegetarian burrito. However recently the burritos taste like they don't add enough love into them, seriously though a lot of the time I would be missing guacamole or sour cream and a few times I would just get beans rice and cheese. Now, this kind of sucks already but also sometimes it would have a stale taste to me. Still, burritos aren't the only thing they do. They also serve entrees like sauteed shrimp with mushrooms. These are great, I only wish they didn't add two huge sides of lettuce and refried beans and more shrimp or mushrooms instead. This place is good but not my go-to anymore. Definitely a good place to go and the mariachi music on fridays is nice if your into that.", "rating": 4, "date": "2013-05-20"}, {"excerpts": ["I had the super vegetarian burrito! ", "So yummy! ", "Great times, cheap price! ", "Can't wait to go back!"], "author": "Queen o.", "review": "Sweet place! Food is great! Comes out super fast! And is delicious! there was an amazing band playing during lunch on Saturday. I had the super vegetarian burrito! So yummy! Great times, cheap price! Can't wait to go back!", "rating": 4, "date": "2011-12-13"}], "chile relleno burrito": [{"excerpts": ["the chile relleno burrito we ordered was also not good. ", "i wouldnt recommend ordering from here online. ", "however, the sheer size of the burritos we got was pretty awesome"], "author": "Button L.", "review": "made an online order and was not impressed with 2/3 burritos we purchased.  i ordered a plain bean cheese rice burrito and i was given a burrito with peas and corn? the chile relleno burrito we ordered was also not good. i wouldnt recommend ordering from here online. however, the sheer size of the burritos we got was pretty awesome", "rating": 2, "date": "2017-01-06"}, {"excerpts": ["They are also one of the few places that has a chile relleno burrito.  ", "Like every other taqueria I've seen it's usually cold in a fridge and they microwave it on a plastic?! ", "(I assume microwave safe, I hate putting anything plastic in the microwave) plate.  ", "Their sliced jalapenos are AMAZING.  ", "The lady behind the counter told me they make them there.  ", "It tastes like they put oregano in the vinegar.  ", "Their whole jalapenos are great as well.  ", "My only problems with this place is the fact that you have to ask for salsa and jalapenos.  ", "Depending on who is working I can get dirty looks ", "and I feel like I am a beggar or trying to rip them off.  ", "They are usually so busy you really have to be aggressive in asking.  ", "I like how most taquerias have a self serve bar, but that can get disgusting if the clientele let the salsas fall into each other.  ", "You would think that it is more sanitary that the workers get the salsa for you, but I've seen times where it is busy and the workers (and I believe owner) dips a plastic container into the salsa with his bare hands after operating the register.  ", "Not very sanitary as I am a germ freak.  ", "However, I do notice MOST of the time they are washing their hands after operating the register.  ", "I haven't got sick yet, so far so good!  ", "I advise you also to call ahead with your orders.  ", "This place is popular and sometimes I would get behind a family that ordered 5-10 burritos and it really holds everyone up.  ", "The to-go order over the phone really gets your order done quickly.  ", "All in all this is a great place.  ", "I only took off one star for the handwashing I've observed."], "author": "Tyler J.", "review": "I've lived in the Mission 8 years and have my pick of tacquerias.  Taquera La Altena was the one I used to go to, but with the Mission fire in the building above it I had to try another one.  I also like Taqueria Guadalajara on 24th and Shotwell (Their salsas are awesome).  In search of a new taqueria close to where I live, I found this place.  I think the burritos here are very good.  I really like the carne asada burrito with shrimp.  It's $9.30 but they put 6 huge shrimp in them.  It's really nice to watch them cook it in front of you as well.  The carne asada doesn't have big hunks of fat in it like I've seen at a lot of places.  They are also one of the few places that has a chile relleno burrito.  Like every other taqueria I've seen it's usually cold in a fridge and they microwave it on a plastic?! (I assume microwave safe, I hate putting anything plastic in the microwave) plate.  Their sliced jalapenos are AMAZING.  The lady behind the counter told me they make them there.  It tastes like they put oregano in the vinegar.  Their whole jalapenos are great as well.  My only problems with this place is the fact that you have to ask for salsa and jalapenos.  Depending on who is working I can get dirty looks and I feel like I am a beggar or trying to rip them off.  They are usually so busy you really have to be aggressive in asking.  I like how most taquerias have a self serve bar, but that can get disgusting if the clientele let the salsas fall into each other.  You would think that it is more sanitary that the workers get the salsa for you, but I've seen times where it is busy and the workers (and I believe owner) dips a plastic container into the salsa with his bare hands after operating the register.  Not very sanitary as I am a germ freak.  However, I do notice MOST of the time they are washing their hands after operating the register.  I haven't got sick yet, so far so good!  I advise you also to call ahead with your orders.  This place is popular and sometimes I would get behind a family that ordered 5-10 burritos and it really holds everyone up.  The to-go order over the phone really gets your order done quickly.  All in all this is a great place.  I only took off one star for the handwashing I've observed.", "rating": 4, "date": "2015-03-10"}], "super chile relleno burrito": [], "enchilada flauta and chile relleno": [], "corn quesadilla prawns and taco": [], "carne asada and prawns": [{"excerpts": ["They dont skimp out on the carne asada and prawns at all. ", "The prawns are huge. ", "I had a a piece of prawn at every bite. ", "Damn it's so f***kin good!"], "author": "Chris M.", "review": "There is nothing better than the smell of grilled carne asada when you walk in the door.  La Corneta has the best carne asada and camarones (prawns) burrito in the city of San Francisco. They dont skimp out on the carne asada and prawns at all. The prawns are huge. I had a a piece of prawn at every bite. Damn it's so f***kin good!", "rating": 4, "date": "2009-07-20"}], "carne asada pollo and prawns": [], "spicy chicken prawns and enchilada": [], "quesadilla suiza prawns and grilled mushrooms": [], "grilled seasonal vegetables and mushrooms": [], "grilled salmon prawns and steak": [], "pieces enchiladas": [], "pieces flautas": [], "pieces tamales": [], "taco dinner": [{"excerpts": ["I had a taco dinner which included enough meat for 2-3 tacos, tortilla, beans, rice, guac, lettuce, tomato, and a side of chips and salsa. ", "All for $8! ", "We also had margaritas ($6 each). ", "They we very strong and delicious."], "author": "Gina P.", "review": "Great place and great prices! La Corneta Taqueria is kind of set up like a Chipotle where you order at the food bar, but the food is FAR from Chipotle. It is made fresh to order and very delicious! \n\nI came here with a friend for Cinco De Mayo, and the place was pretty busy. The line was to the door, but it definitely moves very quickly. I had a taco dinner which included enough meat for 2-3 tacos, tortilla, beans, rice, guac, lettuce, tomato, and a side of chips and salsa. All for $8! We also had margaritas ($6 each). They we very strong and delicious.", "rating": 5, "date": "2016-05-06"}], "carne asada dinner": [], "garlic prawns": [{"excerpts": ["For a dollar less, Jamie just had the $9.95 Garlic Prawns with Mushrooms (see photo). ", "Note that we both got a basket of chips! ", "Yes, it is a glutton's paradise in here, which may explain why the restroom is rather on the atrocious side. ", "Watch for puddles. ", "There's also this strangely hermetically sealed room with glass walls that we haven't quite figured out. ", "Perhaps when I remember to bring my Playtex gloves, I should try to go in there myself. ", "Needless to say, you'll be rolling out of there when you're done. ", "Maybe everybody will know my name next time. "], "author": "Ed U.", "review": "If \"Cheers\" was set in the Mission instead of Boston, surely La Corneta Taqueria would be Norm Peterson's feeding frenzy of choice. It's like a South-of-the-Border version of the Hungry Heifer because the combination plates here could easily feed a small army of migrant workers. Surprisingly, I've actually never been here before since El Farolito and Taqueria Cancun are so close by and satisfy my discriminating taste buds. OK, they're not that discriminating since sometimes I just like quantity. Norm! \n\nIt's a cavernous, brightly lit place just down the block from the 24th Street BART station. You just order upfront in front between the grill and the prep area. The overhead menu is positioned a little too far to the left to browse easily. It also doesn't help that the print is minuscule enough to make the experience akin to an appointment with an optometrist. Still, Jamie W. and I both saw the prawns and mushrooms sizzling on the grill and wanted what he was making. I went all Norm and went with the $12.55 Combination Plate of Carne Asada, Pollo and Prawns with Mushrooms. Oh yes, I did. \n\nIt was more a flattened slice of pork, a large marinaded chicken thigh, and a lotta jumbo prawns, mushrooms, garlic, and green onions, all of it hot off the grill. On the other side of the plate was a big pile of warm black beans. Flanking all of this was rice, shredded lettuce a ladleful of guacamole and what looked to be a slice of the world's largest tomatoes (see photo). You also get a half-dozen tortillas wrapped in aluminum foil, as well as a basket of chips with fresh salsa, mild or hot (see photo). I get exhausted thinking about it, but it was truck-driver good, especially the tender chicken and the succulent prawns. \n\nFor a dollar less, Jamie just had the $9.95 Garlic Prawns with Mushrooms (see photo). Note that we both got a basket of chips! Yes, it is a glutton's paradise in here, which may explain why the restroom is rather on the atrocious side. Watch for puddles. There's also this strangely hermetically sealed room with glass walls that we haven't quite figured out. Perhaps when I remember to bring my Playtex gloves, I should try to go in there myself. Needless to say, you'll be rolling out of there when you're done. Maybe everybody will know my name next time. See ya, Norm! \n\nFOOD - 4 stars...does abundance mean excess?...Stop judging me! \nAMBIANCE - 3.5 stars...bright, colorful, spacious...and then there's the men's room \nSERVICE - 3 stars...they must be judged on speed, certainly not eye contact or friendliness...I don't think I ever finished a sentence at the counter \nTOTAL - 4 stars...if you're really hungry and just can't push the plate away, this is good, tasty stuff", "rating": 4, "date": "2011-04-02"}, {"excerpts": ["burrito or their Garlic Prawns..YUMMY!", "! ", "I like to get away from the usual chicken or pork. "], "author": "James L.", "review": "I have not been here for years and surprised I have not yelped this place. I finally came by this weekend and was able to eat here again. \n\nI love their Super Prawn burrito or their Garlic Prawns..YUMMY!! I like to get away from the usual chicken or pork. This past weekend, I split the super prawn burrito with my friend and got the nachos to share and got 2 al frescas (strawberry & cantaloupe). Nachos were ok..great to share. The al frescas were flavorful. \n\nThis is my favorite Mexican restaurant, but I am not a connoisseur of Mexican food, but I do like the food here..=)", "rating": 5, "date": "2010-08-30"}], "spicy prawns": [{"excerpts": ["Super Nachos - with steak, beans, lettuce, chopped tomatoes, guacamole,  and of course chips really good ($7)\n\nSpicy Prawns Plate - beans, rice, salad,  tomato, and "], "author": "Deep S.", "review": "San Francisco is not known for their Taquerias, until now!\n\nBeing from San Jose the home of La Vics orange sauce, Chaleteco Chips/Salsa, and La Costa Burritos, I always have my doubts heading into any SF Taqueria but stumbled in here drunk after the Yelp Party as most places close at 9 this place was open till 10pm so I strolled by culo in here.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nPros:\n- customer service (they bring the food to you)\n- capacity/seating\n- tvs\n- bathrooms (super clean, i was truly amazed)\n\nCons:\n-parking\n-napkins\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nFood:\nSuper Nachos - with steak, beans, lettuce, chopped tomatoes, guacamole,  and of course chips really good ($7)\n\nSpicy Prawns Plate - beans, rice, salad,  tomato, and of course the prawns were damn good!!! ($9)\n\nSuper Tostada -  lettuce, tomatoes, guacamole, steak ($4)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nIn conclusion: \n\"La Corneta Taqueria Suavemente, besame que quiero sentir tus labios besandome otra vez, Suave!!!\"", "rating": 4, "date": "2012-01-18"}], "grilled tilapia": [], "tostadas de ceviche": [], "regular tostada": [], "super vegetarian tostada": [], "super tostada": [{"excerpts": ["($9)\n\nSuper Tostada -  lettuce, tomatoes, guacamole, steak ($4)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"], "author": "Deep S.", "review": "San Francisco is not known for their Taquerias, until now!\n\nBeing from San Jose the home of La Vics orange sauce, Chaleteco Chips/Salsa, and La Costa Burritos, I always have my doubts heading into any SF Taqueria but stumbled in here drunk after the Yelp Party as most places close at 9 this place was open till 10pm so I strolled by culo in here.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nPros:\n- customer service (they bring the food to you)\n- capacity/seating\n- tvs\n- bathrooms (super clean, i was truly amazed)\n\nCons:\n-parking\n-napkins\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nFood:\nSuper Nachos - with steak, beans, lettuce, chopped tomatoes, guacamole,  and of course chips really good ($7)\n\nSpicy Prawns Plate - beans, rice, salad,  tomato, and of course the prawns were damn good!!! ($9)\n\nSuper Tostada -  lettuce, tomatoes, guacamole, steak ($4)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nIn conclusion: \n\"La Corneta Taqueria Suavemente, besame que quiero sentir tus labios besandome otra vez, Suave!!!\"", "rating": 4, "date": "2012-01-18"}, {"excerpts": ["I ordered a Super Tostada which consisted of carne asada, avocado, beans, lettuce, sour cream, salsa, rice and a slice of tomato. ", "The meal came with chips and I washed it down with agua fresca (melon) very full and happy. ", "My colleagues were also very happy with their cheese enchiladas and burrito."], "author": "Jennifer M.", "review": "After a long meeting walking through my hood colleagues suggested Taqueria Corneta to have lunch. What I noticed was a bright, clean and spacious area to enjoy our meal. Went straight in line even with lots of situations going on at the register but staff are calm kept the line moving.\n\nI ordered a Super Tostada which consisted of carne asada, avocado, beans, lettuce, sour cream, salsa, rice and a slice of tomato. The meal came with chips and I washed it down with agua fresca (melon) very full and happy. My colleagues were also very happy with their cheese enchiladas and burrito.", "rating": 3, "date": "2012-03-07"}, {"excerpts": ["But my favorite item on the menu is the super tostada. ", "They make the shells there, and even without any meat, it is an explosion of flavor. ", "Just make sure you get a couple lime wedges to squeeze over it. "], "author": "Andi R.", "review": "I used to eat at Corneta A LOT. Way back in 2001 I worked on 21st and Mission and frequently went there for lunch. I made friends with the manager, who told me he was the owner's son. I can't remember his name but he was always super nice  to me and whoever I brought in there with me. Sometimes he would be flirty, but nothing too weird. I did get a sense he was a pervert on the DL, but it didn't bother me.\n\nOne night  I went in there and he chatted me up for a really long time and then he walked me 24th street. I thought it was funny, but I was like, oh he's just being friendly. So we get to the bart station and I say \"okay well, good night\" and he lunges at me and attempts to stick his tongue down my throat! I don't really remember what I said but I know I booked it down those stairs and ran to hop on a train as fast as I could.\n\nThe next few weeks I fretted about it, cuz while I wasn't really mad at him, I felt like I couldn't go in there to get food. And that made me sad. Eventually I returned to Corneta and the guy was just nice as usual, maybe a bit quiet, maybe a bit embarrassed. I never brought it up. That was so long ago, and the last few times I went there more recently he wasn't there. I have been informed that he was fired, and also that he was NOT the owner's son! \n\nSo all that being said, Corneta's food isn't exactly spectacular(especially with the other neighborhood options). But I do really like that it's clean and fresh and the fish items are typically good.  But my favorite item on the menu is the super tostada. They make the shells there, and even without any meat, it is an explosion of flavor. Just make sure you get a couple lime wedges to squeeze over it. Delicious.\n\nOh also, for whatever reason, they have the best refried beans. I believe they're vegetarian, but I could be wrong. They are scrumptious, and whenever I order I always get a side to go.", "rating": 4, "date": "2007-05-24"}], "fish tostada": [{"excerpts": ["I tried to order a taco salad -Aftering ordering what I thought was a going to be a salad because i did ask for taco salad and was directed to their- fish tostada, it showed up with no lettuce, when I request lettuce the woman who took my order and delivered my food to the table says in a huff- that's extra!! ", "Really ?? ", "I just spent $11 and you're telling me the lettuce I could have asked you for 10 mins ago ", "is now extra? ", "Sooo hubs stands in another 10 min line at the counter ... ", "For lettuce . ", "Now both our food is cold. ", "Total lunch fail."], "author": "Coco J.", "review": "Losing stars for very poor customer service and lots of attitude! I must say I have had some good meals here, but it's hard to communicate with the people taking the orders if you don't speak Spanish to them. I tried to order a taco salad -Aftering ordering what I thought was a going to be a salad because i did ask for taco salad and was directed to their- fish tostada, it showed up with no lettuce, when I request lettuce the woman who took my order and delivered my food to the table says in a huff- that's extra!! Really ?? I just spent $11 and you're telling me the lettuce I could have asked you for 10 mins ago is now extra? Sooo hubs stands in another 10 min line at the counter ... For lettuce . Now both our food is cold. Total lunch fail.", "rating": 2, "date": "2018-02-19"}, {"excerpts": ["Not at all bad place to order fish tostada with fried beans, and follow up with Negra Modelo."], "author": "Anya B.", "review": "The bright and colorful oasis in the neighbourhood, with backdrops of sky and beach scenes skillfully painted using primary colors. The long menu of options. Not at all bad place to order fish tostada with fried beans, and follow up with Negra Modelo.", "rating": 3, "date": "2007-02-13"}, {"excerpts": ["Super fish tostada is great. ", "love the Guadalupe mural."], "author": "Sia V.", "review": "Super fish tostada is great. love the Guadalupe mural.", "rating": 5, "date": "2008-09-24"}], "prawn tostada": [], "super fish tostada": [{"excerpts": ["Super fish tostada is great. ", "love the Guadalupe mural."], "author": "Sia V.", "review": "Super fish tostada is great. love the Guadalupe mural.", "rating": 5, "date": "2008-09-24"}], "super prawn tostada": [], "bag of chips": [{"excerpts": ["For about $7+ you get a decent size burrito with meat, cheese, lettuce, sour cream, rice, and salsa, plus a small bag of chips. ", "What a deal! ", "Though it's not my favorite or the most delicious tasting burrito, this place has great prices and value for their food. ", "The service is also very fast compared to other places. ", "Definately a win in my book!"], "author": "Melissa N.", "review": "This is a large sit down Mexican restaurant with a fairly large selection of things to order. It's located among a large number of Mexican eateries on Mission Street. Seating is abundant and during lunch time there normally is a line, but it goes by pretty quick as they push out freshly made orders fairly fast. There's also a mariachi band sometimes which can either be a good or bad thing.\n\nI normally order my standard carne asada super baby burrito and that normally fills me up. For about $7+ you get a decent size burrito with meat, cheese, lettuce, sour cream, rice, and salsa, plus a small bag of chips. What a deal! Though it's not my favorite or the most delicious tasting burrito, this place has great prices and value for their food. The service is also very fast compared to other places. Definately a win in my book!", "rating": 4, "date": "2016-10-26"}, {"excerpts": ["We received the order  one hour late, the burritos were cold and the chips delivered was a bag of chips that you buy at Costco for$3.00. ", "How tacky is that. ", "Needless to say the entire office asked we do not order from here again."], "author": "A. D.", "review": "I was very disappointed with the service provided.  I placed an order for work to celebrate 5 De Mayo.  It started on a bad note.  In the past we have used  this taqueria for the service and good food.  This time they really blew it. When I placed the order (30 burritos) I asked if we can have salsa and chips since in the past these was included the fellow who took my order said no and if we wanted salsa and chips we had to pay.  I went ahead and added to the price of the order.  We received the order  one hour late, the burritos were cold and the chips delivered was a bag of chips that you buy at Costco for$3.00. How tacky is that. Needless to say the entire office asked we do not order from here again.", "rating": 1, "date": "2011-05-07"}], "oz sour cream": [], "oz guacamole": [], "chile relleno each": [], "enchiladas each": [], "tamales each": [], "flautas each": [], "cream caramel": [], "churros": [{"excerpts": ["They also have really yummy drinks (horchata, agua de fresa, agua de piña, etc) and churros."], "author": "Julia B.", "review": "Apparently, this is the spot where DIY burritos originated. You can customize your order, but nowhere near as much as chipotle. This is a good thing. You can choose between tortilla type, bean type, meat type and salsa type. According to someone I was eating with, you're supposed to be able to choose everything as they build our burrito in front of you. I just ordered with my options up front, and had no problem. \n\nI got the super baby burrito with chicken. It was really really good!! The verde sauce is mild and delicious! I really liked the flavor of the rice and beans. \n\nThe flour burrito it was wrapped in was thin, and wasn't great at holding in the filling. The last quarter of my burrito was eaten with a fork. If and when I go back, I'll ask them to double wrap it. \n\nMy dad got the gambas and said they were very good, not spicy. \n\nThey also have really yummy drinks (horchata, agua de fresa, agua de piña, etc) and churros.", "rating": 4, "date": "2018-03-29"}, {"excerpts": ["If only the churros weren't dry and bland tasting, I would've awarded this taqueria chain a solid 5 stars."], "author": "Janice C.", "review": "The cafeteria style ordering at La Corneta makes tacos to mouth possible in 5 seconds flat!\n\nOk, kidding. It takes less than 10 minutes to put together your food, so munch on the gratis chips and salsa while you wait. \n\nAlso, take in your surroundings: it's actually clean! and the rich painted murals on the wall of the Birhen Maria will make you thoughtfully chew on your fish tacos while praying to the gods. You even get the choice of salmon or tilapia as your fish! (get the super fish tacos for $6 each and it comes with the works!) \n\nFor those of you who are not trying to eat healthy, the carnitas tacos are juicy, soft and just a bomb of flavor explosion in your mouth! ay carumba! una mas por favor ... \n\nIf only the churros weren't dry and bland tasting, I would've awarded this taqueria chain a solid 5 stars.", "rating": 4, "date": "2017-02-26"}, {"excerpts": ["we ordered tacos, nachos, and churros. ", "We were surprised by the mexican musicians and the instruments they were playing! ", "It was an amazing experience. ", "Everyone was friendly and super helpful. ", "We even danced to the songs! \n", "Must go if you are in mission!"], "author": "Parnika B.", "review": "If you want to feel in Mexico- this is the place! \nGreat food- we ordered tacos, nachos, and churros. We were surprised by the mexican musicians and the instruments they were playing! It was an amazing experience. Everyone was friendly and super helpful. We even danced to the songs! \nMust go if you are in mission!", "rating": 5, "date": "2018-08-14"}, {"excerpts": ["Maybe I'm just spoiled by the Churros Mexicanos cart in Fruitvale... "], "author": "Karen R.", "review": "I'll be honest and say I only came here because I was too lazy to go to the ATM to get cash for El Farolito and it was too crowded there anyway. This was my first time and I was very happy with my experience. I got a super burrito with carne asada (no sour cream), a small cream-filled churro, and a Mexican Coke. The burrito was amazing!! It was an awesome replacement for El Farolito and I almost ate it all in one sitting. I'm very picky about burritos and it's hard to please me in this area. Most of the time, burritos can be too dry or have too much of a filler in it. Their burrito had the perfect amount of ingredients and everything tasted fresh and was seasoned well.\n\nThe only disappointment was the churro. It was too crunchy for my liking and didn't seem very fresh. It almost seemed stale to me? Maybe I'm just spoiled by the Churros Mexicanos cart in Fruitvale... But El Corneta's churro relleno did not meet my expectations.\n\nI was also very happy with the service here. The two young ladies who helped me were very attentive even though they seemed swamped with orders. The lady who ordered before me was rude to them and almost ran out with MY burrito because she wouldn't listen to what they were saying. Some of y'all customers need to chill and be more respectful to workers. Thankfully, they were able to stop her from running away with my burrito. \n\nI have no idea why some people are saying this taqueria is cash only. They accept cards too! Also, this place is very spacious and there's A/C. It's the perfect place to get lunch in the summer if you're in the area.", "rating": 4, "date": "2016-07-05"}, {"excerpts": ["The let down is the dessert menu; the churros this restaurant has in the menu were not fresh at all "], "author": "Sylvester C.", "review": "Not a bad place to get lunch. I have tried their buttitos, tacos, enchilladas, chile relleno, ceviche and several other main courses and I never left dissapointed. The let down is the dessert menu; the churros this restaurant has in the menu were not fresh at all (I nearly cheap one of my front tooth while biting a churro) and the alfajores' powder sugar tasted like the kind of flour my great granma used to use to cook before we asked her to stop cooking for us. I will be back but no way I will be having desserts here, unless they replace the current menu items with decent ones.\n\nAn advice for the owner, please go ahead and fire the person who makes desserts or send him to pastry 101 at some community college in Tijuana.", "rating": 2, "date": "2016-05-20"}, {"excerpts": ["They have a big menu, which is nice (constant supply of churros! ", "Theoretically great, but maybe not so fresh always!). "], "author": "Lisa K.", "review": "Totally fine taqueria. They have a big menu, which is nice (constant supply of churros! Theoretically great, but maybe not so fresh always!). It has a clean, chain-y feeling, which is slightly off-putting, but they keep everything moving through pretty quickly.\n\nAnyway, the food. The baby burrito is a nice, actually edible size, as opposed to the usual behemoths in the mission. The pollo is salsa roja seemed to have a lot of white meat, which was tender and consistent, but a little boring. The spicy salsa had some jalepenos but was still on the mild side. I liked the carnitas more than I expected I would - they weren't too crispy but were pretty succulent. The carne asada was pretty good, too, although my dining companion was less impressed. The tortillas weren't too flavorful, disappointingly. Good fresh-squeezed orange juice.", "rating": 3, "date": "2010-01-23"}, {"excerpts": ["The texture of the dough of the churro is WAY different from churros you get at Costco (best value churro in the entire bay area that I know of... although I do see those dudes carrying a cart of home made churros that they sell on the streets). ", "The ridges on this churro kind of crumble? "], "author": "Irene C.", "review": "So a bunch of us were going to go to el farolito that is a couple doors down from la corneta. \n\nThen some of us were not really feeling so safe here, little bit of a sketchy crowd, and from a friend's past experience I'm told that it wouldn't be a good thing if we got stuck near a bar fight since el farolio was connected to the bar next door. Some of us don't really like being in the mission. Ok, Fair enough.\n\nWalked down the block to la corneta, the digs didn't seem as hole in the wall, down home, authentic, dirty tacos, but it'll have to do. Actually it was freaking well lit as heck and way cleaner (and gringo-ed out) than el farolito since it's a chain type restaurant, but yelp tells me this place got at least 4 stars, so we weren't in for an experience, but we wouldn't be eating crappy burritos and tacos. \n\nThis place is pretty much the same to me as poncho villa. Its good, but you kind of expect a place like this to at least be this good, so there was nothing that floored me, but at least it's safer, cleaner, and has TONS of seating. Since the venue was nicer, you could safely assume that you would be paying like a dollar more for a burrito here than el farolito down the block.\n\nI would like to eventually make my way over for a quick bite at el farolito tho. It did have a good sized line building around 8pm on a Sunday night. Where as there was pretty much no wait at la corneta. If you like to live semi-dangerously, please try el farolito out and tell me how good it is :)\n\n\nFOOD:\nBottled water is $0.92, you know what, it's such a simple pleasure, but you RARELY see bottled water for under a dollar at restaurants and convenience stores. \n\nI had the super taco. Comes with two soft corn tortillas, and literally a pile of food on top. I had the carne asada (grilled beef), so it came will a generous portion of meat, sour cream, avocado, lettuce, shredded cheese, salsa, pico de gallo (chopped up tomatoes and cilantro and lime ish salsa), beans, rice, slice of tomato and a wedge of a lime. It was pretty super to me. All this for $4.50! I was pretty filled up.\n\nGot a large churro (filled with creme or something), it wasn't warm, so I was disappointed, but I would not hesitate to try one again if it was fresh out of the deep fryer. The texture of the dough of the churro is WAY different from churros you get at Costco (best value churro in the entire bay area that I know of... although I do see those dudes carrying a cart of home made churros that they sell on the streets). The ridges on this churro kind of crumble? I don't know if I'm using the right word to describe it, but its def different when you bite into it. \n\nThey give you a generous basket of huge chips and lots of pico de gallo salsa. I had no complaints. If you want more salsa, just ask for it, they don't gripe. \n\nWould I come back? Maybe, only to try a warm fresh churro, only because there are so many other 'yelp 4 star' taquieras in the misson that I still need to try.", "rating": 3, "date": "2008-12-01"}, {"excerpts": ["When I saw the tray of churros, ", "some that were cream-filled.. "], "author": "Grace M.", "review": "I had a hankering for some street tacos, but my health conscious friend took me here.  Fine.  I had a feeling flavor was going to be compromised, somehow.\n\nWhen I saw the tray of churros, some that were cream-filled.. .I got ekchited.\n\nI tasted their al pastor, which was alright.  I opted to get the carne asada taco with black beans (already a healthy option).  \n\nThe taco was okay.  It did taste \"healthy\", which means I wasn't satisfied after the meal.  The cream-filled churro wasn't fresh nor flavorful.  My diet coke was cool, not ice cold.\n\nI guess I'll just stick to the rivers and the lakes that I'm used to, and go straight to the taco trucks.\n\n(  |  )", "rating": 3, "date": "2008-05-02"}, {"excerpts": ["The churros look damn tasty though."], "author": "Matt L.", "review": "Geeeee. Super baby with mole de pollo? Yes please. I haven't found anywhere else that has mole de pollo. And the super baby has all the goodness you want, without that overstuffed, undo the fly feeling of a full Super.\n\nI haven't tried anything else on the menu. The churros look damn tasty though.", "rating": 5, "date": "2008-09-18"}, {"excerpts": ["I saw churros at the counter and I had to get one, not such a good idea. ", "It was rubbery and cold even though it was sitting under a heat lamp. "], "author": "Felix T.", "review": "So it was lunchtime working at a new location and I had a little dilemma, where to eat. Across the street was my tried-and-true El Farolito, although this location I haven't tried before, and a huge selection of other restaurants in the area. On the advice of my manager for the day, I went to La Corneta on the same block as El Farolito.\n\nThis place was big, with lots of seating, lots of employees, and lots of choices on the menu. I saw churros at the counter and I had to get one, not such a good idea. It was rubbery and cold even though it was sitting under a heat lamp. I ordered my usual super burrito with carnitas, also not spectacular, considerably smaller than super burritos I've had at any other taqueria, and more expensive too. \n\nI placed my order stepped to the side to wait and watched everyone behind me order and get their food right away. After about 10 customers I started to wonder. So I walked up and asked, the cashier had apparently lost my order and she knew I was waiting. Someone else came up and fixed my order right on the spot.\n\nDefinitely would not go there again.", "rating": 2, "date": "2008-06-08"}], "alfajores": [{"excerpts": ["(I nearly cheap one of my front tooth while biting a churro) and the alfajores' powder sugar tasted like the kind of flour my great granma used to use to cook before we asked her to stop cooking for us. ", "I will be back "], "author": "Sylvester C.", "review": "Not a bad place to get lunch. I have tried their buttitos, tacos, enchilladas, chile relleno, ceviche and several other main courses and I never left dissapointed. The let down is the dessert menu; the churros this restaurant has in the menu were not fresh at all (I nearly cheap one of my front tooth while biting a churro) and the alfajores' powder sugar tasted like the kind of flour my great granma used to use to cook before we asked her to stop cooking for us. I will be back but no way I will be having desserts here, unless they replace the current menu items with decent ones.\n\nAn advice for the owner, please go ahead and fire the person who makes desserts or send him to pastry 101 at some community college in Tijuana.", "rating": 2, "date": "2016-05-20"}], "chocolate flan": [{"excerpts": ["Try the chocolate flan dessert."], "author": "B C.", "review": "Quite spacious. Service is quick. Free chips. Had quesadilla. Try the chocolate flan dessert.", "rating": 5, "date": "2018-04-10"}], "cream caramel flan": []}