{"chorizo scrambled eggs": [], "ham scrambled eggs": [], "mushroom scrambled eggs": [], "huevos a la mexicana": [{"excerpts": ["I got a chorizo taco and an huevos a la mexicana. ", "Both of these dishes filled me up easily. ", "The prices here are also very reasonable. ", "I would say it's a great value for the amount of food you get and the great taste. ", "They also have a salsa bar with three or four salsas to choose from."], "author": "Lynn T.", "review": "I was impressed with La Fonda. I got a chorizo taco and an huevos a la mexicana. Both of these dishes filled me up easily. The prices here are also very reasonable. I would say it's a great value for the amount of food you get and the great taste. They also have a salsa bar with three or four salsas to choose from.", "rating": 4, "date": "2016-01-09"}], "omelettes": [], "molletes": [{"excerpts": ["The molletes are done different then they are done in mexico but still, they are incredibly delicious. "], "author": "Bella G.", "review": "people are retarded when they think that its a \"burrito joint\". Somehow all americans think that Mexican food is all burritos. Its not. \n\nIn Mexico, we dont even have burritos... anywhere. A burrito is like a made up American thing. Just like chilli and all those other nasty fake mexican meals. So calling this place \"inauthentic\" or a \"burrito joint\" is ignorant and stupid.\n\nAs a Mexican i can actually say that this place is as authentic as it can get in the US. The sopes are amazing, the huaraches are delicious and the salsas actually taste like something. Of course they make them a little light tasting but thats only because Americans cant handle the spicyness and complain too much.\n\nThe molletes are done different then they are done in mexico but still, they are incredibly delicious. Their veggies are fresh and their aguas frescas taste home made and not like canned juices.\n\nGordos is a mexican fast food place that scores a 1 compared to la fonda. which BTW. its LAH PHONe DAH. not law fawnduh. it doesnt even SOUND like lawfawnduh. \n\nof course its hard to find real mexican food here cuz well.. there isnt. you want mexican food. real mexican food? GO TO MEXICO. no jodas.\n\nthis place is amazing and it has become my usual \"after the doctor visit\" food place. \n\nque pinche burrito joint ni que pinche burrito joint. pinches pendejos. FTP.", "rating": 5, "date": "2007-09-20"}], "vegetables fajitas": [], "steak chicken quesadilla": [], "al pastor or cheese quesadilla": [], "filetito asado": [{"excerpts": ["Filetito asado was tender and tasty.  ", "Al pastor was sweet - I'm not use to pineapples in tacos."], "author": "Elsie D.", "review": "Good tacos for being in the Sunset.  Filetito asado was tender and tasty.  Al pastor was sweet - I'm not use to pineapples in tacos.", "rating": 3, "date": "2011-05-12"}], "avocado  slices": [], "rice beans": [{"excerpts": ["the rice beans size ok. ", "I can't say terrible things about them or terribly great. "], "author": "Christine B.", "review": "The background: Mexican food restaurant that's not quite a fast food type joint, but not quite a sit down restaurant. Has a standard Mexican menu (buritos, fajitas, tacos, nachos, enchiladas, etc) and reasonably priced. \n\nThe details: The food was well OK ... unfortunately somewhat bland, nothing special or mouthwatering. I got a burito and the carne asada was ok, the rice beans size ok. I can't say terrible things about them or terribly great. Although, I would prefer eating a burito bowl at chipotle, but sometimes you just are in the neighborhood wishing for carne asada. \n\nFYI - there's seating upstairs, but you'll be forced to carry your burito, chips, and drink up the stairs on a tray so be careful... my burito almost went flying because the staircase is narrower and steeper than most.  Also - if you're on the journey to find Orange Bang in the city - this place will not have it! \n\nThe verdict: It's good for hey it's lunch time I'm hungry and it's right by work or school. I wouldn't NOT come here again, but I wouldn't go out of my way to come here.", "rating": 3, "date": "2012-12-17"}], "grilled garlic mushrooms": [], "tofu or veggies": [], "azteca nachos": [{"excerpts": ["I had the 'Azteca Nachos' last night for dinner. ", "30 minutes after my stomach starts hurting. ", "About two hours later, at home, it gets gradually worse to the point that I'm just laying on my bed clutching my side. ", "Later on in the night I finally just puked, it was all the nachos and that crap swimming in my toilet. ", "Soon as I puke I feel instantly better. ", "Don't ever go here. ", "It's horrible."], "author": "Luis R.", "review": "Don't ever come here!!! I'm trying to save everyone from experiencing what happened to me. I had the 'Azteca Nachos' last night for dinner. 30 minutes after my stomach starts hurting. About two hours later, at home, it gets gradually worse to the point that I'm just laying on my bed clutching my side. Later on in the night I finally just puked, it was all the nachos and that crap swimming in my toilet. Soon as I puke I feel instantly better. Don't ever go here. It's horrible.", "rating": 1, "date": "2012-07-22"}, {"excerpts": ["The azteca nachos are so fricken good ", "I eat the whole damn order by myself. ", "Plus they have the best lime fresca I\"ve had in awhile!  "], "author": "Heather H.", "review": "Ok, I admit that I turned my nose up at the thought of a different Mexican restaurant residing in the place where my beloved Pancho's one stood.  So I walked by it for a good 6 months or so with out ever stepping foot inside.  Then one of my roommates dragged me inside and demanded I try their nachos.  \n\nShe is EVIL I tell you EVIL.\n\nSo good.  So very awesomely good.  The azteca nachos are so fricken good I eat the whole damn order by myself. Plus they have the best lime fresca I\"ve had in awhile!  Annnnd you can buy a half pint of their mild salsa (the yummy pico de guio kind).  \n\nI admit I haven't really tried anything else due to my strange need to just stick with one dish per restaurant (I'm a freak, I know).  But I'm trying to adventure out.  The next time (aka tonight) I go to La Fonda's I want to try a taco or burrito or SOME thing different.  I've heard good things from all of my roommates so I'm ready to step outside my boundaries!\n\nClearly I take food way to seriously....", "rating": 4, "date": "2007-04-23"}], "broiled steak": [{"excerpts": ["I ordered it with broiled steak and whole black beans.  ", "The steak is precooked, chopped and reheated on the grill upon ordering.  ", "The preparation time was very fast even with a steady flow of customers coming in.  "], "author": "Wilhelm Y.", "review": "In the Inner Sunset I can't think of another place that serves better Mexican food than La Fonda.  I've only eaten here twice, both recently, but I've enjoyed my meals here.  The staff is nice, the restaurant is clean, the portions are filling and the food is very good.\n\nA big bowl of complimentary chips come with each meal and you can help yourself at the iced down salsa bar which features two types of red sauce, a tomatillo sauce (my favorite), whole jalapenos, chopped onion and chopped cilantro.\n\nOn my first visit I had an enchilada plate with chorizo (http://www.yelp.com/biz_photos/GPK6hwD_EGKCRVD1cWESig?select=w_ny-F33_YCddhpWBQL5fQ).  They offer you a choice of beans and I chose the black beans which is my default choice.  The enchiladas here are not rolled but are actually just meat inside a tortilla folded over like a taco and smothered in cheese and enchilada sauce.  The chorizo was very good with just a tad of kick.  I prefer more spice and found one of the red sauces in the salsa bar perfect for developing a little moisture on my forehead.  A small side of fresh, chunky guacamole is served on the side.  The guac here combines ripe avocado with chunks of fresh tomatoes and chopped onions.  It, too, was very good.\n\nOn my second visit I decided to try La Fonda's version of a wet burrito.  More often than not I tend to like my Mexican food smothered in cheese or smothered in sauce so whenever I dine in the chances are fairly high that I will order something smothered in cheese or sauce.  In this case my Azteca Burrito was smothered with both (http://www.yelp.com/biz_photos/GPK6hwD_EGKCRVD1cWESig?select=JwWhOT74QTXoIYrC81Cslg).  I ordered it with broiled steak and whole black beans.  The steak is precooked, chopped and reheated on the grill upon ordering.  The preparation time was very fast even with a steady flow of customers coming in.  The modified enchilada sauce had some nice spice to it and the burrito was overstuffed and wrapped up plump.\n\nFor hydration La Fonda carries many of your favorite beers and they have several varieties of agua frescas.  For me though I like that they have Mexican Coke and several varieties of Jarritos Mexican soda.\n\nFor excellent Mexican food you can find me somewhere in the Mission, but if I'm in the Inner Sunset and I feel like having above average Mexican food then La Fonda is my preferred choice.", "rating": 4, "date": "2010-04-29"}], "broiled chicken": [], "mild chicken": [], "mole chicken": [{"excerpts": ["I feel like some things are much better on the menu than others; the mole chicken is good, but it's always hard for me to finish. ", "They give you a lot of options for your choice of meat, if you're a met eater. ", "I can't even remember them all, but I think it's steak, chorizo, grilled chicken, mole chicken, carnitas, and more."], "author": "Ken L.", "review": "I come here a lot. I'm partial to the quesadilla with chorizo, the hot red salsa, and green tomatillo salsa. And the always friendly staff. Decent burritos and nachos also. I feel like some things are much better on the menu than others; the mole chicken is good, but it's always hard for me to finish. They give you a lot of options for your choice of meat, if you're a met eater. I can't even remember them all, but I think it's steak, chorizo, grilled chicken, mole chicken, carnitas, and more.", "rating": 4, "date": "2012-01-22"}], "tinga chicken": [{"excerpts": ["i tried the spicy/ tinga chicken burrito, it's kinda bland. ", "i like the chip, and salsa has distinct roasted flavor. ", "the place is quiet small but nice and clean, that's one point. ", "i found that burrito at burrito express in outer sunset are tastier (but i don't like the place)."], "author": "Suki S.", "review": "i tried the spicy/ tinga chicken burrito, it's kinda bland. i like the chip, and salsa has distinct roasted flavor. the place is quiet small but nice and clean, that's one point. i found that burrito at burrito express in outer sunset are tastier (but i don't like the place).", "rating": 3, "date": "2006-10-09"}], "flour": [{"excerpts": ["You can have 2 strips of crispy bacon with your eggs in the morning, chopped up in a nice albeit womanly salad, wrapped around a scallop and eaten while on ecstasy, or, the way La Fonda does it--layed across onions, peppers, and meat, and wrapped in a flour tortilla--the wonder that is \"The Alambre\". \n\n"], "author": "Steven H.", "review": "I feel like these days, bacon has a bad rep. I blame this on the North Beach dieters, Pilates loons, and health club nincompoops around the world. It's a little known fact that bacon is the greatest and most delicious meat in the universe. \n\nThe number one reason for its greatness is its versatility. You can have 2 strips of crispy bacon with your eggs in the morning, chopped up in a nice albeit womanly salad, wrapped around a scallop and eaten while on ecstasy, or, the way La Fonda does it--layed across onions, peppers, and meat, and wrapped in a flour tortilla--the wonder that is \"The Alambre\". \n\nIf you question the authenticity of this dish, then you my friend, have obviously never been to Mexico, where they kill and eat pigs on a daily basis and have no running water or electricity. I believe the main character in Desperado, the cinematic authority on Mexico, ate an Alambre whilst killing, playing guitar, and talking to Steve Buscemi. But, I digress. La Fonda is the go-to spot in the Sunset for hearty Mexican food. Just ask the guy from Desperado.", "rating": 4, "date": "2007-10-15"}, {"excerpts": ["I could have sewed it into a flour corset.  "], "author": "Courtney M.", "review": "Lo Siento La Fonda....La Comida es no bueno.  \n\n1. Food was bland, no spices, no flavor. \"Spanish rice\" tasted like white rice and i had to load it up with salt.  \n\n2. The lady said there were 4 tortillas in the box.  There was one. And it was so big I could have sewed it into a flour corset.  What good does this do for fajita tacos? \n\n3. I ordered it for takeout. There was no napkins, no plastic silverware, nada. \n\n4. Since there is no online menu, they will tell you on the phone that the fajitas come with guacamole and sour cream. Let me clarify: It comes with one ounce of guacamole and once ounce of watery substance that may imitate sour cream.", "rating": 2, "date": "2009-02-18"}, {"excerpts": ["Get it in a burrito, or in a Flour Tostada (aka a taco salad), or on some Sopes... so tomatoey and delicious!\n\n"], "author": "Vanessa R.", "review": "What? I haven't reviewed La Fonda yet?? Incredible!\n\nI really only have one thing to mention; Tofu Ranchero. Get it in a burrito, or in a Flour Tostada (aka a taco salad), or on some Sopes... so tomatoey and delicious!\n\nThe staff at this restaurant are super nice, and very accommodating to special requests and substitutions, and despite the recent price increase, I think I get more for my money here than at other spots in the neighborhood.", "rating": 4, "date": "2009-08-01"}, {"excerpts": ["If you get a burrito, make sure you get the flour tortilla.  ", "The others don't soften up and makes the burrito somewhat chewy."], "author": "Paul W.", "review": "This spot gets one extra star for being in the Inner Sunset.  When I lived there it was great to have an alternative to Gordo (blech).  If you get a burrito, make sure you get the flour tortilla.  The others don't soften up and makes the burrito somewhat chewy.", "rating": 4, "date": "2006-09-10"}, {"excerpts": ["they also make the best breakfast burrito (try the chorizo and mushroom), have a variety of choices for your tortilla wrapper (spinach, sun-dried tomato, flour, wheat), have delicious agua frescas (sandia and fresa are my faves), free chips w/ the meal (which deserves a \"yay!\" since some burrito places make you actually pay for the chips - poo on that), beer, and a fresh salsa/pepper bar (please don't sing that quiznos rat song about pepper bars). ", "super sweet folks work the counter and custom make your burrito exactly to your liking."], "author": "Veronica Y.", "review": "i love la fonda. it might sound ghetto-fabulous, but in actuality, it's just fabulous. it is the best place to get a burrito in the inner sunset, hands down. be warned that their burritos are big, so you need to welcome the inevitable food coma that follows.\n\nthey have really great carnitas and chicken mole that even my boyfriend (a self-described \"beaner\") loves. they also make the best breakfast burrito (try the chorizo and mushroom), have a variety of choices for your tortilla wrapper (spinach, sun-dried tomato, flour, wheat), have delicious agua frescas (sandia and fresa are my faves), free chips w/ the meal (which deserves a \"yay!\" since some burrito places make you actually pay for the chips - poo on that), beer, and a fresh salsa/pepper bar (please don't sing that quiznos rat song about pepper bars). super sweet folks work the counter and custom make your burrito exactly to your liking.", "rating": 4, "date": "2007-03-05"}], "whole beans": [], "refried": [{"excerpts": ["there was maybe 5 pieces of meat in the burrito, mainly refried beans.\n", "Been here several times, and each time is getting worse, not coming back anymore.\n", "The cashier was more into playing games or being on her cell phone that helping patrons."], "author": "Jim S.", "review": "the portions are pretty small. I got a regular burrito that looked like a baby burrito. the burrito was as thin as a 8oz can of soda and the length was about 7 to 8 inches. very little ingredients. there was maybe 5 pieces of meat in the burrito, mainly refried beans.\nBeen here several times, and each time is getting worse, not coming back anymore.\nThe cashier was more into playing games or being on her cell phone that helping patrons.", "rating": 1, "date": "2017-01-05"}, {"excerpts": ["The refried beans had flavor and seemed like they cared about vegetarian needs. ", "They also had a large menu of other vegetable burritos which made me want to come back and try those. ", "So far it's the best burrito I've had inside of SF, which for a good city is seriously lacking in Mexican excellence in is food. ", "Normally I have to drive outside of the city to Alameda to find a really great burrito. ", "This is a good local place."], "author": "Curtis M.", "review": "Best burrito in SF\n\nFirstly, let me say how rare it is to find a place which includes a full (mini) basket of free chips with a burrito... This alone puts it above most Mexican restaurants and taquerias in the city. Next, the salsa that also comes for free in a mini salsa bar is both flavorful and fresh! I had as my main entree the super vegetarian burrito which (at the time of this writing) was under $6 and it's medium size was a good value for what you're getting. The refried beans had flavor and seemed like they cared about vegetarian needs. They also had a large menu of other vegetable burritos which made me want to come back and try those. So far it's the best burrito I've had inside of SF, which for a good city is seriously lacking in Mexican excellence in is food. Normally I have to drive outside of the city to Alameda to find a really great burrito. This is a good local place.", "rating": 4, "date": "2014-08-30"}, {"excerpts": ["I had the Azteca burrito with carnitas and refried beans.\n\n"], "author": "Allen W.", "review": "Stopped in for a quick lunch -- food came out quickly and tasted pretty good. I had the Azteca burrito with carnitas and refried beans.\n\nThe person taking our order wasn't terribly friendly and seemed annoyed that we wanted to order. I asked for spicy but the burrito wasn't spicy at all.\n\nAlthough it's a small restaurant, they have an upstairs with more tables.", "rating": 3, "date": "2013-07-08"}, {"excerpts": ["The mix of rice, tofu, refried beans and salsa just makes the stomach sing. ", "Surprisingly delicious (when they choose to make it right).  ", "The portions are pretty big--"], "author": "Daisy T.", "review": "A-okay.  That's about the quickest summary I can give you about this sometimes-really-delicious, sometimes disappointing Mexican joint.  \n\nSo I'll just start out with the Good: Veggie Options & Portions.  The Tofu Ranchero just hits The Spot (sometimes). The mix of rice, tofu, refried beans and salsa just makes the stomach sing. Surprisingly delicious (when they choose to make it right).  The portions are pretty big--you'll probably have enough left over for a snack later on that night.   \n\nThe Bad: Service, Salsa Bar, Food. You just never know what to expect. The cashiers either greet you like you're the one they've been waiting for all their lives or like you're the thing the cat dragged in. The Salsa Bar is okay, but really, what would I know?  I've avoided it since I saw people using their bare hands to scoop out salsa. The Food is just inconsistent.  It can be the best thing you've eaten since forever or the most disappointing fare you've put 10 bucks down for in awhile.  \n\nThe Ugly:  Okay... this would be exaggerating.  Nothing is that bad here, but it definitely rounds out the review, don't you think?\n\nAll in all, come here with your expectations low and you'll be just fine. Heck, who knows, you might just be stopping by on a good day.", "rating": 3, "date": "2010-10-29"}, {"excerpts": ["(I had spicy pork/refried/green tortilla)\r\n", "Just a walk-in walk-out type place, has a few chairs/tables."], "author": "Wesley W.", "review": "Really good burrito for $5!  (I had spicy pork/refried/green tortilla)\r\nJust a walk-in walk-out type place, has a few chairs/tables.", "rating": 4, "date": "2006-02-19"}, {"excerpts": ["We had the mollettes, a sandwich of chorizo, on a large roll with melted cheese and pico de gallo with refried beans on the side---for $3.20!  ", "Great chips and a decent salsa bar."], "author": "Joc V.", "review": "A fortunate find in the Sunset...great Mexican food at unbeatable prices.  We had the mollettes, a sandwich of chorizo, on a large roll with melted cheese and pico de gallo with refried beans on the side---for $3.20!  Great chips and a decent salsa bar.", "rating": 4, "date": "2006-06-18"}, {"excerpts": ["At least the refried beans were good.  \n\n"], "author": "Staci M.", "review": "I was so bummed this wasn't that good.  I LOVE mex.  \n\nThe enchilada sauce was sweet.  I had to drench it in hot sauce.  The nachos were just okay.  The taco with filet was just okay.  At least the refried beans were good.  \n\nService is wonderful but DAMN I want some good mex food!!  If anyone can tell me of one remotely close to Inner Sunset, please do.  Thanks.", "rating": 2, "date": "2007-11-05"}, {"excerpts": ["/w refried, black, and pinto - I went with refried, yum!), rice (spanish rice! not nasty white steamed rice like Chipotle), salsa, and cheese. ", "I asked them to add guacamole into the burrito. ", "It was delicious! ", "Unlike a lot of burrito places, the portion size was filling, yet manageable. ", "I tried out the milder side salsa as well as the salsa verde and both were delicious - the verde was a bit spicier than the red salsa I got. ", "They also give you a side of tortilla chips with your meal. ", "Definitely worth a try and satisfied a recent craving I've been having for some quality mexican food."], "author": "Megan B.", "review": "Met up with some friends to grab dinner here prior to trivia night in the neighborhood. The entire menu looked great but I ended up going with the Veggie Burritto which consists of beans (you choose b/w refried, black, and pinto - I went with refried, yum!), rice (spanish rice! not nasty white steamed rice like Chipotle), salsa, and cheese. I asked them to add guacamole into the burrito. It was delicious! Unlike a lot of burrito places, the portion size was filling, yet manageable. I tried out the milder side salsa as well as the salsa verde and both were delicious - the verde was a bit spicier than the red salsa I got. They also give you a side of tortilla chips with your meal. Definitely worth a try and satisfied a recent craving I've been having for some quality mexican food.", "rating": 4, "date": "2010-04-28"}], "tamale dinner": [{"excerpts": ["But the tamale dinner was just average--the pork better than the chicken, I think--but don't waste your appetite. ", "Another visit I got some tacos for the family. ", "The tacos are ok, but way too simple. ", "I ordered some other steak-type taco, and it was essentially just meat and corn tortilla. ", "(Anyway, nothing beats a La Taqueria taco!). ", "When I asked the woman at the counter questions about the taco and the menu, she was short and pretty rude. ", "There was still a good half hour or more until closing when I left, and maybe she had a long day, but I don't think that should be a reason for her rudeness.  ", "I wouldn't return even for the free salsa."], "author": "Cara K.", "review": "The first time I went in the middle of the afternoon, I got a steak burrito and some other things for the family. My baby and I both gobbled the burrito down--almost fighting for it! But the tamale dinner was just average--the pork better than the chicken, I think--but don't waste your appetite. Another visit I got some tacos for the family. The tacos are ok, but way too simple. I ordered some other steak-type taco, and it was essentially just meat and corn tortilla. (Anyway, nothing beats a La Taqueria taco!). When I asked the woman at the counter questions about the taco and the menu, she was short and pretty rude. There was still a good half hour or more until closing when I left, and maybe she had a long day, but I don't think that should be a reason for her rudeness.  I wouldn't return even for the free salsa.", "rating": 2, "date": "2014-01-23"}], "sope masa boat": [], "huarache": [{"excerpts": ["I also recommend the huarache with chicken mole.\n\n"], "author": "Jose H.", "review": "Tacos are on the expensive side, but decent. I recommend the cochinita pibil tacos. I also recommend the huarache with chicken mole.\n\nThe agua de Jamaica was very refreshing!", "rating": 4, "date": "2017-02-26"}, {"excerpts": ["Give their Sopes, Chorizo, Chile Relleno, and Huarache's a try. ", "They're tasty and filling. "], "author": "Junia I.", "review": "As far as Mexican food in the Inner Sunset goes, this place isn't too bad. The great thing about La Fonda; they offer more then just burritos and tacos, so do yourself a favor and try their other items out. Give their Sopes, Chorizo, Chile Relleno, and Huarache's a try. They're tasty and filling. Another positive; you can have all the free salsa you want and don't have to go through that guilt of having to ask for more prepackaged salsa cups. \n\nLa Fonda isn't as authentically tasting as it comes, but it will give you that fix if you can't make it to the mission. They used to have Posole during the weekends, and for some reason they stopped. Which is really upsetting considering that was my favorite item on their menu. \n\nThey've also got really good Horchata and aqua frescas so do get some of those beverages when you eat there!", "rating": 3, "date": "2010-02-27"}, {"excerpts": ["The service leaves a little something to be desired, but you can't ask for very much with a $3 taco, or a $4 huarache...  ", "The \"salsa bar\" is also lacking....  stay away from the red salsas, but do try the tomatillo.  ", "It's deliciously tart and just enough heat to lend a little bit of kick."], "author": "vicarious c.", "review": "You can't beat the prices.  The corn tortillas are tasty and there are several vegetarian options (including a decent tofu taco).  The service leaves a little something to be desired, but you can't ask for very much with a $3 taco, or a $4 huarache...  The \"salsa bar\" is also lacking....  stay away from the red salsas, but do try the tomatillo.  It's deliciously tart and just enough heat to lend a little bit of kick.", "rating": 3, "date": "2006-06-10"}], "flour toastada": [], "kids corn quesadilla": [], "kids taco": [], "fountain sodas": [], "nantucket": [], "calistoga orangina": []}