{"tacos suavesoft  tortilla": [], "taco handmade corn tortilla": [], "taco dorados  crispy": [], "taco sonora": [], "tacos de canasta": [{"excerpts": ["i had a gordita, tacos de canasta, and french fries (freshly cut and made) ", "i did not like the long wait for food, its a very small cluddler space it took way to long to be served. ", "but the food made up for it....since it was really worth it!\n", ":)"], "author": "Erika A.", "review": "I loved the food. it was sooo soo good. i had a gordita, tacos de canasta, and french fries (freshly cut and made) i did not like the long wait for food, its a very small cluddler space it took way to long to be served. but the food made up for it....since it was really worth it!\n:)", "rating": 4, "date": "2010-06-03"}], "burrito super": [{"excerpts": ["I had a roasted chicken burrito super, and it was amazing! ", "I heard the sweet corn tamales were just as great, unfortunately they were out when I went. ", "I will be making La Palma a stop whenever I am in the City and craving real Mexican food and dining in an authentic San Francisco taqueria."], "author": "Zachary D.", "review": "I was taken here by my friend who moved to this city this past year. I was in town for last minute Christmas shopping and way dying for good food. La Palma was amazing! Sure, those who prefer a modern style of place may not like La Palma, but you can't substitute quality and heritage. Not only do they sell food, but they also sell Hispanic groceries and homemade tortillas, which by the way are used with any of the food you order that comes or is made with tortillas. I had a roasted chicken burrito super, and it was amazing! I heard the sweet corn tamales were just as great, unfortunately they were out when I went. I will be making La Palma a stop whenever I am in the City and craving real Mexican food and dining in an authentic San Francisco taqueria.", "rating": 5, "date": "2015-12-23"}, {"excerpts": ["A burrito with basically everything (burrito super) in it is $6, and the taco sorona (which is super large as in larger than my face) for about $4. ", "It has rice, sour cream, salsa fresca, cheese, and your choice of meat (I got the canitas).\n", "My boyfriend had the burrito super for $6. ", "It has gucamole, beans, rice, cilantro, sour cream, onions, and your choice of meat (he got the tongue).\n", "My boyfriend had to help me finish my taco sorono, (again its bigger than my face), and had to save part of his burrito for later. ", "(he's a big eater too).\n", "I've had their quesadillas and they're equally as yummy as the tacos and burritos.\n", "Lastly, I definitely recommend buying the gucamole. ", "It's sooo delicous. ", "The avocados in it are so fresh and aren't mushy at all. ", "It's to die for."], "author": "Rach K.", "review": "Best Mexican Food hands down. If it isn't La Palma Mexicatessen's Mexican food, then I can't eat it. \nI've met two of the owners and they are the nicest people in the world. Because of them and their staff, you'll understand why this place always has a line and filled with customers checking out their other grocery items.\nTheir prices are basically way too hard to believe. A burrito with basically everything (burrito super) in it is $6, and the taco sorona (which is super large as in larger than my face) for about $4. It has rice, sour cream, salsa fresca, cheese, and your choice of meat (I got the canitas).\nMy boyfriend had the burrito super for $6. It has gucamole, beans, rice, cilantro, sour cream, onions, and your choice of meat (he got the tongue).\nMy boyfriend had to help me finish my taco sorono, (again its bigger than my face), and had to save part of his burrito for later. (he's a big eater too).\nI've had their quesadillas and they're equally as yummy as the tacos and burritos.\nLastly, I definitely recommend buying the gucamole. It's sooo delicous. The avocados in it are so fresh and aren't mushy at all. It's to die for.", "rating": 5, "date": "2013-07-30"}, {"excerpts": ["I love this place for it's chile verde burrito super, with black beans and without crema.  ", "I can't speak about their other dishes, but the burritos are RICOS and very LARGE.  ", "You definitely get the bang for your buck.  ", "This place is legit, and the people that work there usually address you in spanish initially, but no worries if you can't speak it, they also speak english.  ", "The only bummer is there is no inside seating."], "author": "Kaitlin H.", "review": "I love this place for it's chile verde burrito super, with black beans and without crema.  I can't speak about their other dishes, but the burritos are RICOS and very LARGE.  You definitely get the bang for your buck.  This place is legit, and the people that work there usually address you in spanish initially, but no worries if you can't speak it, they also speak english.  The only bummer is there is no inside seating.", "rating": 5, "date": "2011-05-19"}], "burrito regular": [], "beans  cheese burrito": [], "huarachito ranchero": [], "machaca": [], "en burrito": [], "en taco mano": [], "huevos con chorizo": [], "en taco de mano": [], "torta mananera breakfast sandwich": [], "enchiladas caseras": [], "enchiladas verdes": [], "enchiladas rancheras": [], "quesocheese": [], "frijoies  quesobeans  cheese": [], "revueltas": [{"excerpts": ["Tried: carne asada super burrito, carne asada and carnitas taco, revueltas pupusas\n\n"], "author": "Hannah H.", "review": "Tried: carne asada super burrito, carne asada and carnitas taco, revueltas pupusas\n\nPerhaps we ordered the wrong items, but I can't see why La Palma is rated so highly. The carne asada and carnitas were both extremely dry (especially in the tacos), and the burrito was pretty flavorless and oversalted.\n\n2 stars because the pupusas were decent, although I've definitely had a lot better in the Mission.", "rating": 2, "date": "2017-09-05"}], "chicharron": [{"excerpts": ["THE BEST CHICHARRON IN TOWN! \n"], "author": "Yuan Z.", "review": "THE BEST CHICHARRON IN TOWN! \nThey are always busy but that's because their food and groceries option are amazing! \n\nOrder -- There were 4 pieces of chicharrones in the bags, which came out to be $3.45. They accept visa card with no minimum. Needless to say, I ate them all in one setting. The chicharrones were warm, crunchy, meaty, well seasoned, and just felt like love in every bite. \n\nSpace -- We sat outside beside the restaurant. They have shades and seatings available which added a very nice touch because there's no seating inside the shop.", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["I was on the hunt for some chicharron and the search led me to La Palma.  ", "As others have mentioned this is part grocery store part taqueria.  ", "The best part is that some of grocery items are freshly made - tortillas, gorditas, huaraches, chicharron, masa, etc.\n\n", "On my way to the cashier up front to pay I passed by the display of chicharron and stared at the jewels of pork meat and skin inside.  ", "They were not labeled ", "so I asked the cashier what was available ", "and she told me they had meat with fat, meat and meat with skin.  ", "I asked for a half pound ($9.99/lb) of the meat with skin but wish now I had purchased one pound.  ", "They were quite good and did not contain chunks of fat, but just relatively moist meat and crispy skin.   ", "I've had super dry and stale pork skin before that made me cough and choke when swallowing them ", "and these were NOT anything like that.  ", "They were delicious!  ", "They were almost like Chinese roast pig but the chicharron had different seasoning and were deep fried.  ", "I would definitely come back for these.  "], "author": "Melissa L.", "review": "I was on the hunt for some chicharron and the search led me to La Palma.  As others have mentioned this is part grocery store part taqueria.  The best part is that some of grocery items are freshly made - tortillas, gorditas, huaraches, chicharron, masa, etc.\n\nUpon entry I made a bee line for the fresh tortillas on the counter in the back.  I picked up a pack of the chicken huaraches, beads of condensation still present on the inside of the bag and warm to the touch.  I also picked up a bag of their tortillas.  \n\nOn my way to the cashier up front to pay I passed by the display of chicharron and stared at the jewels of pork meat and skin inside.  They were not labeled so I asked the cashier what was available and she told me they had meat with fat, meat and meat with skin.  I asked for a half pound ($9.99/lb) of the meat with skin but wish now I had purchased one pound.  They were quite good and did not contain chunks of fat, but just relatively moist meat and crispy skin.   I've had super dry and stale pork skin before that made me cough and choke when swallowing them and these were NOT anything like that.  They were delicious!  They were almost like Chinese roast pig but the chicharron had different seasoning and were deep fried.  I would definitely come back for these.  For leftovers, they were easy to heat up and softened up a bit (skin was crispy but not rock hard) after 10 minutes in the toaster oven.\n\nI tried the tortilla as soon as I returned home and it was thick, chewy and flavorful.  I ate it with some pork chile verde and liked how the tortilla held up pretty well to the wet filling.\n\nDuring my visit to La Palmas the store was relatively empty with a only couple of other patrons there.  The cashier was friendly.   A few tables are available outside for those that wish to dine there.  Parking was generally pretty easy during my visit at noon on a weekday.", "rating": 4, "date": "2018-07-11"}, {"excerpts": ["I went here to get some Chicharron because I've been wanting to compare it with my favorite place \"Belmar\".\n", "so I did", ", I bought a pound of Chicharron con Grasita e Carne (Mix).\n", "but also while I was there, I might as well trying their food.\n", "and I did.\n", "I bought a Quesadilla Suiza con Carnitas.\n", "the Chicharrones were good (still not as good as Belmar's), but the Quesadilla Suiza was disappointing.\n", "luckily the weather was nice and as I sat outside at the side patio, I met two incredibly friendly gentlemen Hector & Andres.\n", "we had such interesting conversation about Mexican Regional Cuisines (Puebla, Hidalgo, Morelia, Distrito Federal, Oaxaca, Yucatan, and El Chilango).\n", "so, it was great even though the Quesadilla wasn't."], "author": "Rudy H.", "review": "I went here to get some Chicharron because I've been wanting to compare it with my favorite place \"Belmar\".\nso I did, I bought a pound of Chicharron con Grasita e Carne (Mix).\nbut also while I was there, I might as well trying their food.\nand I did.\nI bought a Quesadilla Suiza con Carnitas.\nthe Chicharrones were good (still not as good as Belmar's), but the Quesadilla Suiza was disappointing.\nluckily the weather was nice and as I sat outside at the side patio, I met two incredibly friendly gentlemen Hector & Andres.\nwe had such interesting conversation about Mexican Regional Cuisines (Puebla, Hidalgo, Morelia, Distrito Federal, Oaxaca, Yucatan, and El Chilango).\nso, it was great even though the Quesadilla wasn't.", "rating": 3, "date": "2017-08-16"}, {"excerpts": ["The best chicharron and tortillas ever! ", "My entire family have been long time customers here. ", "I remember walking to La Palma as a small child after getting out of school at St. Peter's right across the street.  "], "author": "Veronica F.", "review": "The best chicharron and tortillas ever! My entire family have been long time customers here. I remember walking to La Palma as a small child after getting out of school at St. Peter's right across the street.  And even though I live in San Jose now I still make at least two trips a month for my comfort food! \n\nAnd as soon as the holidays come around it is just about a weekly trip to get masa for tamales!  \n\nIt is so nice to see that the clientele has grown so much! I recently found a group listening to an audio tour on an app called 'detour' guided/narrated by a local.  Who would have thought our neighborhood mexicatessen would be part of a tour available on a smart phone!!! Glad that more people will know of this gem!!! Good food! I hope my daughter and nephews will continue the family tradition of eating here and bringing friends!", "rating": 5, "date": "2017-11-05"}, {"excerpts": ["Also ordered some chicharron. ", "It's all just ok except for the burrito which was really good because their guacamole is pretty stellar. ", "I went back and got a thing of guac and a bag of chips to bring back with me. ", "The guac is super overpriced though which is disappointing. ", "Oh well. ", "Again, just ok."], "author": "Dang N.", "review": "This is a cool little bodega with food but honestly, the food here is just ok. Got a couple different tacos, a sopa and a burrito. Also ordered some chicharron. It's all just ok except for the burrito which was really good because their guacamole is pretty stellar. I went back and got a thing of guac and a bag of chips to bring back with me. The guac is super overpriced though which is disappointing. Oh well. Again, just ok.", "rating": 3, "date": "2017-07-25"}, {"excerpts": ["- They have 3 counters which can get a little confusing, but the one all the way in the back on the right is where you place your order, the counter closer to the door, where they sell various chicharron is where you pick up your order. \n", "- They accept cards!\n", "- If you know what you want, call ahead! ", "The food is usually ready in 10-15 minutes and all you have to do is go to the first counter on your right and pick up and pay!"], "author": "Jade C.", "review": "Super delicious food in the mission! HELL YEAH!\n\nI recently had a falling out with El Farolito and La Guadalajara, feeling like they weren't as good as they used to be! I was in search of a better place for some delicious mexican food!\n\nLa Palma is awesome! Their food is super delicious, and usually fast. The customer service is okay, but honestly their prices and food is what keeps me coming back. \n- The flauta plate was delicious, their quesadilla suiza was okay, it was a little too greasy for me. \n- The breakfast sandwich is tasty and will keep you full forever.\n- The huaraches are very good and are freshly made in the morning! I like buying a pack of that and salsa and eat it with over easy eggs and lettuce and call it a day!\n\nHere are a few tips:\n- It is a really tiny spot and inside is all retail, there is seating for eating outside around the corner, as well as standing tables right upfront. So don't plan on dining fancy while you're here. \n- If you can take public transportation or just walk. It's in the mission, on 24th, near Potrero, so finding parking is nearly impossible during day time. \n- La Palma is a grocery store as well, so it can get hectic and crazy busy at times. \n- They have 3 counters which can get a little confusing, but the one all the way in the back on the right is where you place your order, the counter closer to the door, where they sell various chicharron is where you pick up your order. \n- They accept cards!\n- If you know what you want, call ahead! The food is usually ready in 10-15 minutes and all you have to do is go to the first counter on your right and pick up and pay!", "rating": 5, "date": "2017-03-11"}, {"excerpts": ["It's a Mexicatessen, so much good looking baked goods, ready-made meats like chicharron, fresh made tortillas, and all the foodie eye candy I could handle.  \n\n", "Chicharron Super Burrito:  ", "it was decent in size. ", "The ingredients were mixed together nicely.  ", "As every yelper mentions about this place, the tortillas are nice, chewy, and fresh.  ", "A nice touch.  ", "The flavors were great.  ", "The only complaint was the burrito had a ton of orange grease.  ", "It was a little unsettling "], "author": "Michael L.", "review": "Y'all know what a delicatessen is?  It's a term meaning \"delicacies\" or \"fine foods, or specially prepared food. La Palma is just like that but the Mexican equivalent.  It's a Mexicatessen, so much good looking baked goods, ready-made meats like chicharron, fresh made tortillas, and all the foodie eye candy I could handle.  \n\nWhile I wanted to buy half the stuff in La Palma I chose to just order a burrito.\n\nChicharron Super Burrito:  it was decent in size. The ingredients were mixed together nicely.  As every yelper mentions about this place, the tortillas are nice, chewy, and fresh.  A nice touch.  The flavors were great.  The only complaint was the burrito had a ton of orange grease.  It was a little unsettling but hey, it tasted fine.\n\nThe Mexicatessan is packed with employees helping customers.  Also busy making those fresh tortillas they are so famous for.  Overall 4 stars worthy as a great place for Mexican ingredients, and 3 star worthy spot for a average but decent burrito.", "rating": 4, "date": "2014-08-09"}, {"excerpts": ["I know they're known for their chicharron "], "author": "Guilliana J.", "review": "Would definitely come back here! Large menu where you go to the back to order then pay upfront and wait for your meal. It functions as a food place and a small store. I know they're known for their chicharron but I was not able to try it. \n\nI went on a tuesday afternoon after a meeting and it wasn't too busy. The prices stated on yelp are incorrect, as they have been raised. I would say things have increased by about $2 but even then, everything is reasonably priced.\n\nI got the tacos dorados with potato and a cheese pupusa.\n\nDamnnnn was this good. Even though I had a long commute home which made the tacos a little soggy, they were amazing. The meal was around $8 but it was big portions as it came with three tacos, rice and beans. The potato tacos were nicely seasoned and was even better with the red sauce and cabbage that came on top of it. The pupusas were near $2 each and were pretty good. \n\nThis place is kind of far for me but I will be back.", "rating": 4, "date": "2016-07-24"}, {"excerpts": ["CHICHARRON BURRITO w/ Guacamole ($5.89 + .75 for guacamole) - 3.5 STARS\nhttp://www.yelp.com/biz_photos/bNvaWa9wSLHjlFlrD7i9Ow?select=fB6K7YnzoZkP8sAechgzqw\n", "I love chicharrons and lately I've been on a crazy Mexican food hiatus ", "so I thought this combo would be out of this world. ", "However, the most unlikely ingredient outshined the chicharron...THE TORTILLA! ", "Yup, you read right! ", "The harina tortilla was unlike any you would find at a regular taqueria. ", "It was thick, soft and chewy with a rich consistency. ", "HELLO LARD! ", "As far as the filling, the chicharron was very sparse. ", "The heat from the seasoned rice and refried beans softened the chicharron causing it to lose its crackling crunch so it tasted more like salty pork jerky.\n\n", "Next time, I'm going back just for the chicharron and the harina tortillas ", "so I can make my own chicharron soft tacos. ", "Pure Pork Fat + Lard? ", "Life's NEVER been so good...", "JUST FAT!"], "author": "Cherylynn N.", "review": "Donde Estoy?\n\nBeing a San Franciscan that was born and raised here, I felt like a total foreigner in La Palma Mexicatessen. I walk in and see three counters with no number dispensing machine in sight (as per Yelp reviews). I go around in circles like a touron until I see what seems to be a regular just walk in so I follow him; yup, hella stalker status! He orders in Spanish, gets a number, pays at another counter and picks up his food when his number is called. Damn, I'm stoopid.\n\nCOUNTER #1:\n*Chicharrons (by the pound): skin, skin with meat and skin with attached fat.\n*Tamales\n*Nacatamales (A Nicaraguan tamale that's larger than the typical tamale and filled with meat, potatoes, tomato paste and rice)\n\nCOUNTER #2 (back counter): THE KITCHEN\nThe entire menu is in Spanish but the employees do speak English and will be happy to help you.\n*Burritos\n*Tacos\n*Quesadillas\n*Tortas\n*Enchiladas\n*Papusas\n*Roast Chicken\n*Weekend Menu: Birria (Goat Stew) and Menudo (Tripe Stew)\n\nCatering is available. \n\nCOUNTER #3: THE MARKET LINE\n*Fresh Handmade Tortillas (still warm): Flour, Harina, Spinach, Tomato and Blue Corn \n*Tortilla Chips \n*Salsas and Guacamole \n*Chorizo\n*Cojita Cheese\n*Masa: Corn, Cactus, Blue Corn and Sweet \n*Corn Husks and Banana Leaves\n\nAlmost everything is sold by the pound. CC's accepted.\n\nWANT TO ORDER FOOD?\nGo to Counter #2 (back counter) to place your order and you will be given a ticket number. Pay and pick-up order at Counter #1 (to the right when you walk in). \nCHICHARRON BURRITO w/ Guacamole ($5.89 + .75 for guacamole) - 3.5 STARS\nhttp://www.yelp.com/biz_photos/bNvaWa9wSLHjlFlrD7i9Ow?select=fB6K7YnzoZkP8sAechgzqw\nI love chicharrons and lately I've been on a crazy Mexican food hiatus so I thought this combo would be out of this world. However, the most unlikely ingredient outshined the chicharron...THE TORTILLA! Yup, you read right! The harina tortilla was unlike any you would find at a regular taqueria. It was thick, soft and chewy with a rich consistency. HELLO LARD! I could have eaten this alone with salsa and be a happy camper; it was THAT good!\n\nAs far as the filling, the chicharron was very sparse. The heat from the seasoned rice and refried beans softened the chicharron causing it to lose its crackling crunch so it tasted more like salty pork jerky.\n\nI also bought a tub of Salsa de Guacamole. http://www.yelp.com/biz_photos/bNvaWa9wSLHjlFlrD7i9Ow?select=3-VodcFXM5OxqpO-JohmoA The salsa de guacamole was like an avocado cream that was seamlessly thick, rich and buttery; perfect as an accompaniment if you want to add a buttery layer. My only gripe is I wish there was more of a citrus (i.e. lime) component to brighten up the flavors.  \n\nNext time, I'm going back just for the chicharron and the harina tortillas so I can make my own chicharron soft tacos. Pure Pork Fat + Lard? Life's NEVER been so good...JUST FAT!", "rating": 4, "date": "2011-09-21"}, {"excerpts": ["One example, unlike other shops the chicharron (not pork rinds) is already cut into smaller pieces and sorted: con cuero (with skin), con carne (meaty), con sebo (fatty). ", "While still charging the same competitive prices ($7.50/lb.). ", "Home cooks can then simply toss the pieces into a stew, without the extra work of cutting and fat trimming. "], "author": "Luis C.", "review": "There's a reason why La Palma is the best Mexicatessen in SF. http://www.yelp.com/biz_photos/la-palma-mexicatessen-san-francisco?userid=8Ces6YdT6j7BYycnZLrSng#CVOJnPyYq2vqRi4cenn4zQ They know their customers, and take care of the extra little details that keep customers coming back. One example, unlike other shops the chicharron (not pork rinds) is already cut into smaller pieces and sorted: con cuero (with skin), con carne (meaty), con sebo (fatty). While still charging the same competitive prices ($7.50/lb.). Home cooks can then simply toss the pieces into a stew, without the extra work of cutting and fat trimming. Also a great place to buy food for catering parties (pachanga trays, serves 25). \n\nMost reviews talk about the ready to eat foods (tacos, burritos, tortas, quesadillas, enchiladas, huaraches, sopes, pupusas, roast chicken, etc.) from the menu in the back, as if this were simply another taqueria. Not many realize that this shop's main business is to supply meats, stews, handmade tortillas, spices, and other ingredients to cook at home or for wholesale to other busniesses.\n\nAlmost every single SF taco truck buys their tortillas from this store. Excellent handmade quality and super cheap. Ready to quit your job and start a street food taco business? u come here to buy the taco ingredients.\n\nHours:\nMon-Sat 8am-6pm\nSun 8am-5pm", "rating": 4, "date": "2011-01-14"}, {"excerpts": ["For its size, La Palma manages to jam tons of goods and people in, as well as fresh offerings like handmade tortillas, chicharron con cuero, and a pupusa-like dish whose name escapes me. "], "author": "Dave L.", "review": "La Palma Mexicatessen is one compact Mexican deli. Colorful too.\n\nFor its size, La Palma manages to jam tons of goods and people in, as well as fresh offerings like handmade tortillas, chicharron con cuero, and a pupusa-like dish whose name escapes me. My friend picked up pre-prepared items, while I made sure to grab a bottle of pineapple Jarritos to go - so refreshing!\n\nStaff here work fast to keep everyone moving. Bring cash, though credit cards are accepted.", "rating": 4, "date": "2010-11-12"}, {"excerpts": ["This is THE place to go if you like chicharron, and the flour tortillas are delicious too.\n\n", "* Quesadilla Suiza with Chicharron ($6) - ", "Unlike Taqueria Cancun's, this place serves the lettuce, sour cream, and other toppings on the side. ", "If you like that semi crispy / chewy texture of chicharron, you definitely need to order your item with chicharron. "], "author": "Jess C.", "review": "This is THE place to go if you like chicharron, and the flour tortillas are delicious too.\n\n* Taco Solano with Chili Rellano Pork (4.50) - The solano taco is more like a small quesadilla than a taco, filled with all the same ingredients plus rice, and is double the size of a taco. Chili Rellano is a tender pork that comes in large chunks, wish they used more meat. But overall, very wholesome and filling, just one is enough to fill the hungriest person up!\n\n* Quesadilla Suiza with Chicharron ($6) - Unlike Taqueria Cancun's, this place serves the lettuce, sour cream, and other toppings on the side. If you like that semi crispy / chewy texture of chicharron, you definitely need to order your item with chicharron. It's a good deal, and a large portion, but not quite as gigantic / cheesy / meaty as the ones at Cancun, which obviously is the bar for Mexican Food in the Mission.\n\nI got both of these for less than $12 after tax (they accept Visa and Mastercard), what a deal!", "rating": 4, "date": "2013-02-14"}, {"excerpts": ["Fresh tortillas and most importantly chicharron!!! ", "Do yourself a favor and order the chicharron with anything or even by itself, this is not for the faint of heart so if fried food and fat scare you simply don't order this, but if you're going to skip the diet for a day, this is my food drug of choice. ", "It can be a bit confusing how the place works but there are always people around and someone will certainly guide you, it's not a place to be shy. ", "Everything is good I promise."], "author": "Guisela L.", "review": "I love this place. Fresh tortillas and most importantly chicharron!!! Do yourself a favor and order the chicharron with anything or even by itself, this is not for the faint of heart so if fried food and fat scare you simply don't order this, but if you're going to skip the diet for a day, this is my food drug of choice. It can be a bit confusing how the place works but there are always people around and someone will certainly guide you, it's not a place to be shy. Everything is good I promise.", "rating": 5, "date": "2015-03-28"}, {"excerpts": ["Highly recommended: gorditas, tacos dorados and the chicharron! ", "Best Mexican food on 24th street."], "author": "Riley C.", "review": "This is a place where no matter what you order you will be happy. Great service, clean, outdoor seating, delicious, delicious, delicious! Highly recommended: gorditas, tacos dorados and the chicharron! Best Mexican food on 24th street.", "rating": 5, "date": "2016-08-19"}, {"excerpts": ["well I was very disappointed; I got into my car, popped a chicharron in my mouth only to nearly crack a tooth!! ", "I mean it was ROCK hard, not crispy, but ", "ROCK HARD! ", "WTH?  ", "I took it out and tried another piece...nothing but a blob of deep fried fat-I choked, coughed and hacked all the way home.  ", "Now this is from someone who can appreciate the tasty fatty bits-this was just a nasty blob of congealed deep fried grease that almost make me vomit.  ", "Seriously I would not buy meat or probably much of anything else here again-the only thing I'd be willing to pay for would be the huaraches with chorizo.  ", "So sad that another old school Mission institution has sold out..."], "author": "Wendy S.", "review": "Born & raised in San Francisco, I've been coming to La Palma since I was a child in the early 70's.  There used to be delicious carnitas sold in bulk along with small home made tortillas to make your own taquitos..those options are still available, but at a very hefty price.  Today I stopped by to buy some carnitas meat, chicharrones, huaraches with chorizo, arroz y frijoles refritos.  The prices were high, the ordering was chaotic, the woman behind the counter couldn't seem to understand (even though I told her in Spanish) that I wanted just 1lb of carnitas & 1 lb or chicharrones-finally she got it.  I went to the counter, paid for rice, beans, huaraches with chorizo (delicious by the way), 1 coke & 1 flan-$24.00, then a minute later I was asked to pay again (with a credit card for both transactions by the way) for the meat...?? Really?? Okay, anyway I paid, another $22.00-wow! For that price I would expect some really good meat, well I was very disappointed; I got into my car, popped a chicharron in my mouth only to nearly crack a tooth!! I mean it was ROCK hard, not crispy, but ROCK HARD! WTH?  I took it out and tried another piece...nothing but a blob of deep fried fat-I choked, coughed and hacked all the way home.  Now this is from someone who can appreciate the tasty fatty bits-this was just a nasty blob of congealed deep fried grease that almost make me vomit.  Seriously I would not buy meat or probably much of anything else here again-the only thing I'd be willing to pay for would be the huaraches with chorizo.  So sad that another old school Mission institution has sold out...", "rating": 2, "date": "2016-02-25"}, {"excerpts": ["I had part of my friend's chicharron papusa and I couldn't stop picking at it despite her swatting my hand away. "], "author": "Kara R.", "review": "As a Bay Area native, it's rare that I'm blown away by my meal at a taqueria. But there was something about my burrito yesterday that makes me want to come back every time I'm hungry. I'm pretty sure it was the tortilla - thick, chewy, crispy in all the right places, but the carnitas were delicious too.\n\nI know it's a Mexican place, but their papusas are also really amazing. I had part of my friend's chicharron papusa and I couldn't stop picking at it despite her swatting my hand away. I can't wait to go back to try more food!\n\nAnd the makeshift patio area on a nice day is pretty bomb.", "rating": 5, "date": "2011-06-22"}, {"excerpts": ["The chicharron here was a bit over fried IMO. ", "They had the mouth feel of small finishing nails. ", "It did have porky goodness once your teeth managed to break it down. ", "Maybe I was here on a bad day? ", "Be prepared to wait some time for your food during the lunch hour... ", "The huarache had nice corn flavor."], "author": "John H.", "review": "The chicharron here was a bit over fried IMO. They had the mouth feel of small finishing nails. It did have porky goodness once your teeth managed to break it down. Maybe I was here on a bad day? Be prepared to wait some time for your food during the lunch hour... The huarache had nice corn flavor.", "rating": 3, "date": "2013-03-30"}, {"excerpts": ["love the chicharron too"], "author": "Elizabeth D.", "review": "best tortillas ever! warm and delicious. love the chicharron too", "rating": 5, "date": "2013-11-02"}, {"excerpts": ["Chicharron, anyone? "], "author": "Veronica L.", "review": "We found La Palma while doing research on the best place to buy a large amount of carnitas for our housewarming party. We were delighted to find that this Mexicatessen's version of the tasty delight of carnivores everywhere lived up to expectations. The burritos are killer, the flat flour quesadillas only rivaled by La Taq, and their selection is the most authentic I've seen in San Francisco. Chicharron, anyone? La Palma is even complete with little old abuelas in the back hand rolling thick, doughy tortillas and hacking up huge mounds of crispy pork.\n\nDon't forget to grab a ticket as you enter, or you'll end up standing around like an idiot waiting for your turn. Oh, and it's extremely helpful to brush up on your Spanish ordering skills beforehand. As it's a Mexicatessen and not a restaurant or taqueria, all orders are take-out only. The plus side is that you can stock up on taco sauce and other grocery items while you wait.\n\nBy the way - 10 pounds of carnitas is more than you think. We could have done with half as much, but then wouldn't have had the joy of days of carnitas burritos at home and even a special carnitas chili I invented to use the leftovers. We still had to throw out 2 or 3 pounds, despite our best efforts. And we never even opened our second pack of 100 tortillas. Oops.", "rating": 4, "date": "2007-12-04"}, {"excerpts": ["my girlfriend and I went on an exploratory expedition here before the grand Carnitas Purchasing of 2007, and tried things from the back counter including a pork tamale (which I loved, had a jalapeno spanning its length inside that I didn't notice until the whole thing slid into my mouth on the first bite, and boy, was that spicy), a chicharron taco (crispy pork skin with bits of meat attached, ", "oh yeah, this thing clogged my arteries so fast I didn't even have time to say CARNITAS, g", "/f says I can only eat two a year", ", I am counting the days), a carne asada taco (my personal fave this time around), and a carnitas quesadilla (yummmm).  "], "author": "Walter K.", "review": "The rare five-star review.  I threw a party recently and bought ten (yes, ten!) pounds of carnitas from here, 180 handmade corn tortillas, a couple of Mexican salsas, and proceeded to have a full on Mexican gorge-fest back at the proverbial ranch.  We ate about 5 - 6 pounds of the carnitas when all was said and done several days later.  At $6 a pound, I can see why there are so many taquerias springing up, and it almost made me think I'd just make my own henceforth.  However, it turns out that having ten pounds of carnitas in one place can lead to a feeling of carnitas immersion rarely experienced.  I went at LEAST two weeks without eating carnitas, sort of on the rebound, and then tonight at Gordo Taqueria on 9th and Irving was when I finally broke through and had it again.\n\nOne more tale of glory -- my girlfriend and I went on an exploratory expedition here before the grand Carnitas Purchasing of 2007, and tried things from the back counter including a pork tamale (which I loved, had a jalapeno spanning its length inside that I didn't notice until the whole thing slid into my mouth on the first bite, and boy, was that spicy), a chicharron taco (crispy pork skin with bits of meat attached, oh yeah, this thing clogged my arteries so fast I didn't even have time to say CARNITAS, g/f says I can only eat two a year, I am counting the days), a carne asada taco (my personal fave this time around), and a carnitas quesadilla (yummmm).  All high qual.\n\nWhen we picked up the carnitas bag we also grabbed several burritos, this time I felt edificated so I got a carne asada burrito, my friend had same, and g/f had chicken.  It turns out their chicken is seriously tasty.\n\nThese guys have earned my undying love and affection.  It's tough to order since you really will do better if you know some spanish, and don't miss the number-ticket machine at the front right when you walk in.  But deal with it -- it's worth it.", "rating": 5, "date": "2007-09-02"}, {"excerpts": ["Same for the chicharron taco, but that one was a bit too tough for me.\n\n"], "author": "Maximillian M.", "review": "Weird. I found myself speaking really bad Spanglish ordering my food, though I had the accent going. The chicken taco, in a handmade tortilla, w/black beans and fresh salsa was delicious. Same for the chicharron taco, but that one was a bit too tough for me.\n\nRookies: get a number, order your food, pay at the front counter. You should've seen how lost I looked. :-)", "rating": 4, "date": "2008-05-13"}, {"excerpts": ["I liked the chicharron and mixed ones.\n", "This place is like my equivalent to Trader Joes, instead of stocking up on healthy groceries there, I come here. ", "I spend about $25 and the food lasts me all week. ", "It's probably not the healthiest option, but is still my favorite food. \n", "I also did catering here for my sister's surprise birthday party. ", "It was reasonably priced, and I had leftovers for days! ", "The only challenge was, since I am not fluent in Spanish, it was hard to articulate to the lady what exactly I wanted and how many. ", "All in all, I got what I wanted, and I didn't have to wait, it was all ready to go when I picked it up, nothing missing from my order. ", "I will definitely use them again for catering a party and everyone loved the food."], "author": "Kristy H.", "review": "I love, love, love La Palma. I almost don't want to write this review because then you will go there! \nBest burritos in the city hands down. My two favorites are the regular old BRC. Refried beans, rice & cheese, it can always brighten up my day. My other favorite burrito here is the chicken, refried beans, rice, cheese, and salsa. It is so good. Their refried beans never taste peanut buttery (like many other places- Pancho Villa & La Cumbre to name a few). \nHere's what I can't leave the store without:\nREFRIED BEANS\n-because they taste like how refried beans are supposed to taste. I know that sounds redundant, but seriously no refried beans should taste like peanut butter. period.\nPORK TAMALES\n-they are never too dry, shredded pork to perfection.\n-CORN TORTILLAS\nthey are handmade in the back, always fresh, I buy a huge bag and then eat them all week for lunch/dinner\n-RICE\n-always fresh & delicious\n-CHORIZO\n-so tasty for breakfast, might make your house smell like hot dogs, but worth it, every bite is so good \n-PUPUSAS\n-also amazing, fresh, never left out sitting since everyone always comes in and buys them, they are constantly making them right there, so yummy. I liked the chicharron and mixed ones.\nThis place is like my equivalent to Trader Joes, instead of stocking up on healthy groceries there, I come here. I spend about $25 and the food lasts me all week. It's probably not the healthiest option, but is still my favorite food. \nI also did catering here for my sister's surprise birthday party. It was reasonably priced, and I had leftovers for days! The only challenge was, since I am not fluent in Spanish, it was hard to articulate to the lady what exactly I wanted and how many. All in all, I got what I wanted, and I didn't have to wait, it was all ready to go when I picked it up, nothing missing from my order. I will definitely use them again for catering a party and everyone loved the food.", "rating": 5, "date": "2009-05-05"}, {"excerpts": ["This place is the BOMB with Carnitas, Fresh Tortillas and Chicharron........", "Etc", ".......\nHighly recommended and yes bring a person that can speak spanish for you."], "author": "W P.", "review": "This place is the BOMB with Carnitas, Fresh Tortillas and Chicharron........Etc.......\nHighly recommended and yes bring a person that can speak spanish for you.", "rating": 5, "date": "2007-07-27"}, {"excerpts": ["The tacos caseros de chicharron & the pupusas are top-notch and worth the wait on Saturday afternoons.  ", "SCIENCE EXPERIMENT", ":  Eat half a bag of blue-corn tortilla chips and see what happens.  ", "It'll blow your mind."], "author": "Andrea U.", "review": "The tacos caseros de chicharron & the pupusas are top-notch and worth the wait on Saturday afternoons.  SCIENCE EXPERIMENT:  Eat half a bag of blue-corn tortilla chips and see what happens.  It'll blow your mind.", "rating": 5, "date": "2008-01-30"}, {"excerpts": ["Fast forward to the present and I am now intimately familiar with La Palma and her offerings of papusas, tortas, quesadillas, chicharron and masa by the pound. ", "They still make papusas by hand right in front of you. ", "And they will make it without cheese if you ask, but you have to wait about ten minutes. ", "They do take credit/debit because I've done it several times but there is a $10 limit I believe. ", "A lot of things have changed on 24th Street. ", "There is much whirring of expresso machines and clicking of lap tops, but  rhythm of slap slap slapping of papusas coming from La Palma has remain constant."], "author": "Kara P.", "review": "I first heard of La Palma while my husband was courting me back in college way way back in the day. He was trying to enthrall me with the wonders of San Francisco. He told me these grandmas would make these delicious papusas, slapping it with their hands, right in front of you. I was fascinated. I was a small town East Coast girl, I had no idea what papusas or burritos were. Fast forward to the present and I am now intimately familiar with La Palma and her offerings of papusas, tortas, quesadillas, chicharron and masa by the pound. They still make papusas by hand right in front of you. And they will make it without cheese if you ask, but you have to wait about ten minutes. They do take credit/debit because I've done it several times but there is a $10 limit I believe. A lot of things have changed on 24th Street. There is much whirring of expresso machines and clicking of lap tops, but  rhythm of slap slap slapping of papusas coming from La Palma has remain constant.", "rating": 5, "date": "2008-02-03"}]}