{"mexican burrito": [{"excerpts": ["If you want a proper Mexican burrito with finely cut, seasoned carne asada don't go here. ", "They will serve you half ass made chunks of meat that you cant chew, is cold and tasteless. ", "I'm done giving this place a chance. ", "Ive been here 5 times or so and have been disappointed every time."], "author": "Julia P.", "review": "So tired of this place and the rude ladies who work there. When they take your order they act like your bugging them. And the lazy food perpetration is the worst. The steak they put in the tacos, burritos and quesadillas are the size of Legos and is tasteless. And don't bother asking for salt and lime to fix the flavoring unless you want to deal with more attitude. The only reason I attempted to eat here again and waste $18 for a cold carne asada burrito and quesadilla was because the pizza place was closed. Today is Thursday 8-24-17 @3:30. If you want a proper Mexican burrito with finely cut, seasoned carne asada don't go here. They will serve you half ass made chunks of meat that you cant chew, is cold and tasteless. I'm done giving this place a chance. Ive been here 5 times or so and have been disappointed every time.", "rating": 1, "date": "2017-08-24"}, {"excerpts": ["The Mexican burrito was a lot \"lighter\", as far as breakfast burritos go. ", "Ground beef with fresh pico de gallo, eggs and cheese ", "I really enjoyed it because the pico was really fresh tasting and provided a far less greasy alternative to the chorizo burrito. "], "author": "Andrew B.", "review": "Filling... Check.\nGreasy... Check.\nDelicious.... Check.\n\nNot the best breakfast burritos I've had but they were still very good. My fiancee and I shared the Chorizo and the Mexican Breakfast Burritos and both were very good in different ways.\n\nThe chorizo burrito is self-explanatory. Greasy and salty with just a bit of spice they did a great job of balancing the amount of chorizo in the burrito in relation to the eggs, sauce and cheese. It wasn't too overpowering but it was definitely in your face with flavor.\n\nThe Mexican burrito was a lot \"lighter\", as far as breakfast burritos go. Ground beef with fresh pico de gallo, eggs and cheese I really enjoyed it because the pico was really fresh tasting and provided a far less greasy alternative to the chorizo burrito. The meat wasn't overpowered with too much season, it all just combined together well.\n\nMy friends ordered the bacon burrito and I recommend just skipping that one. Too dry, not enough happening there.\n\nStill, the two that we ordered were definitely good and they hit the spot before we had to head to the airport for our flight home.\n\nCheers!", "rating": 4, "date": "2011-07-25"}], "spanish burrito": [], "spicy ortega burrito": [{"excerpts": ["I like the spicy Ortega burrito ", "and I have been eating here whenever I am in town. ", "The service is not very good . ", "Charging 50c for each container of sauce is just too much when I have already paid for extra sauce. "], "author": "Sid P.", "review": "I like the spicy Ortega burrito and I have been eating here whenever I am in town. The service is not very good . Charging 50c for each container of sauce is just too much when I have already paid for extra sauce. I paid about $10 with a tip for the burrito.\n\nI should look for other alternatives nearby.", "rating": 3, "date": "2016-08-17"}], "bacon burrito": [{"excerpts": ["I was in the mood for breakfast burritos and all i got was a bacon burrito with egg shells in ity. ", "ughhh. ", "i wont be going there fo a while"], "author": "B A.", "review": "I was in the mood for breakfast burritos and all i got was a bacon burrito with egg shells in ity. ughhh. i wont be going there fo a while", "rating": 1, "date": "2017-02-11"}, {"excerpts": ["My friends ordered the bacon burrito ", "and I recommend just skipping that one. "], "author": "Andrew B.", "review": "Filling... Check.\nGreasy... Check.\nDelicious.... Check.\n\nNot the best breakfast burritos I've had but they were still very good. My fiancee and I shared the Chorizo and the Mexican Breakfast Burritos and both were very good in different ways.\n\nThe chorizo burrito is self-explanatory. Greasy and salty with just a bit of spice they did a great job of balancing the amount of chorizo in the burrito in relation to the eggs, sauce and cheese. It wasn't too overpowering but it was definitely in your face with flavor.\n\nThe Mexican burrito was a lot \"lighter\", as far as breakfast burritos go. Ground beef with fresh pico de gallo, eggs and cheese I really enjoyed it because the pico was really fresh tasting and provided a far less greasy alternative to the chorizo burrito. The meat wasn't overpowered with too much season, it all just combined together well.\n\nMy friends ordered the bacon burrito and I recommend just skipping that one. Too dry, not enough happening there.\n\nStill, the two that we ordered were definitely good and they hit the spot before we had to head to the airport for our flight home.\n\nCheers!", "rating": 4, "date": "2011-07-25"}], "mushroom burrito": [], "mahimahi taco": [], "taco platter": [{"excerpts": ["Get the shrimp tacos (or the shrimp taco platter depending on how hungry you are) and make sure they don't skimp on the chipotle aioli. "], "author": "Katie A.", "review": "The shrimp tacos are the one and only reason I come here. You might think that Underdogs is the only decent taqueria in the Outer Sunset. Well my friends, this is simply not the case.\n\nGet the shrimp tacos (or the shrimp taco platter depending on how hungry you are) and make sure they don't skimp on the chipotle aioli. It's LIFE CHANGING.\n\nTheir hours can be wonky on any given night, so be sure to call before you visit. \n\nPS - call and order ahead - there is zero ambiance unless you want to grab a beer and sit outside, but they're efficient and chances are your order will be ready when you arrive.", "rating": 3, "date": "2015-01-13"}, {"excerpts": ["My bf had the taco platter which came with two tacos of your choice, rice & beans. ", "The mahi mahi taco with mango salsa was really good ", "but im biased because i like fish and mango's!"], "author": "Carol Y.", "review": "3.5  stars\n\nLa Playa Taqueria is definitely a great alternative from Mission. If you are craving for a burrito, taco or anything and is too lazy to drive all the way to Mission. Eat at La Playa instead. The prices are a little bit higher than Mission but considering the gas and time, its about the same at the end. Friendly & quick service. I ordered the chicken quesadilla ($5.35) which comes with salsa, guacamole & sour cream on the safe. The chicken was perfectly grilled and the cheese was just enough and didn't overpower the whole quesadilla. My bf had the taco platter which came with two tacos of your choice, rice & beans. The mahi mahi taco with mango salsa was really good but im biased because i like fish and mango's!", "rating": 3, "date": "2008-09-18"}, {"excerpts": ["The Baja fish taco platter is another excellent choice.  "], "author": "Roger P.", "review": "Taqueria La Playa is close to my home and I have eaten there many times.  The regular breakfast burrito is excellent with or without chorrizo.  The Baja fish taco platter is another excellent choice.  I also recommend the steak and shrimp burrito.  The service is friendly and fast and the prices are relatively cheap.", "rating": 4, "date": "2008-01-10"}], "regular nacho": [], "supreme nacho": [], "shrimp burrito": [{"excerpts": ["I ordered the shrimp burrito with black beans. ", "I learned that because of the woman's attitude, that if I add a tip to my credit card charge, I might get a little better service. ", "This time... she and the cook talked about me in front of me, assuming I couldn't understand what they were saying. ", "What happened was when my burrito came up... they had a little back and forth about how I had wanted black beans, but the cook at used pinto instead. ", "It was determined that he didn't make it right -- but they agreed to give it to me instead, since it was \"to go\". ", "She turned around and said, \"yeah ", "it's yours\". "], "author": "C L.", "review": "I agree with the other unfavorable reviews, especially the one saying how the woman there is trying to put them out of business. I was pretty hungry after work after not eating all day -- so I decided, why not? They aren't the best, but it's some food... That's was big mistake. \n\nI ordered the shrimp burrito with black beans. I learned that because of the woman's attitude, that if I add a tip to my credit card charge, I might get a little better service. This time... she and the cook talked about me in front of me, assuming I couldn't understand what they were saying. What happened was when my burrito came up... they had a little back and forth about how I had wanted black beans, but the cook at used pinto instead. It was determined that he didn't make it right -- but they agreed to give it to me instead, since it was \"to go\". She turned around and said, \"yeah it's yours\". I didn't believe her but hesitantly took it, thinking, well I can handle eating pinto beans even if she lied to me. \n\nTurns out the burrito was as disgusting as it gets. It had some sort of sloppy mayo sauce mixed with shredded iceberg -- and no beans at all. It was a soupy mess. Also the first bite I took had a shrimp skin and it felt like I had chewed on someone's gnasty finger nail! \n\nI actually drove back with my burrito and gave it back to them. She barely looked at me, took it and went over to the cook, and they snickered. She said to me, we're making you a new one. I said I didn't want it and wanted my money back. She gave it back, but tried to keep the tip. But she gave it back when I asked for it. Now I feel sick and have lost my appetite completely. I don't know why they are still in business, especially with all of the burrito places in SF! These people are rude and the burritos suck. I only eat there out of desperation. But from now on, I think I would rather starve to death.", "rating": 1, "date": "2018-09-05"}, {"excerpts": ["Yes, my shrimp burrito with refried beans was salty to the point I ate less than half, too wet, and the shrimp was not cooked enough, tasted cold, uncooked rice.\n", "The same with my friends' carne asada burrito. ", "Food is just not fresh. ", "To add, lady at the register has a bad attitude, close to rude."], "author": "Katy E.", "review": "So bad. The worst burrito place ever. I know I am spoiled living in the Mission where Mexican food is the best in town but La Playa Taqueria can't even cook their rice right. Yes, my shrimp burrito with refried beans was salty to the point I ate less than half, too wet, and the shrimp was not cooked enough, tasted cold, uncooked rice.\nThe same with my friends' carne asada burrito. Food is just not fresh. To add, lady at the register has a bad attitude, close to rude.", "rating": 1, "date": "2017-10-07"}, {"excerpts": ["Shrimp burrito: very average. ", "At least the shrimp wasn't over cooked, but the whole burrito was too mushy. ", "Too much watered down chipotle sauce and soggy lettuce. ", "Beans and rice were aite. ", "The pico ", "de gallo ", "they gave me with my burrito and chips were really bland. "], "author": "Sandy K.", "review": "Shrimp burrito: very average. At least the shrimp wasn't over cooked, but the whole burrito was too mushy. Too much watered down chipotle sauce and soggy lettuce. Beans and rice were aite. The pico de gallo they gave me with my burrito and chips were really bland. It didn't really taste like anything to be honest.\n\nPortion wise, It was decent. Burrito was definitely on the skinnier size. Was able finish one by myself and I'm a pretty petite individual. Definitely have room for more food as well.", "rating": 3, "date": "2015-08-14"}, {"excerpts": ["Steak and shrimp burrito was pretty good. ", "For the price and portion size it's a good value. ", "The burrito could be even better with some additional flavor thrown in. "], "author": "David G.", "review": "Recently passed through La Playa Taqueria to revisit prior opinions.\n\nOrders come with chips and salsa. Steak and shrimp burrito was pretty good. For the price and portion size it's a good value. The burrito could be even better with some additional flavor thrown in. If La Playa Taqueria were to start including a flavorful hot sauce with each order that would be a great way to bring up the burritos to the next level.\n\nQuesadilla with added shrimp was quite good. We were happy to get both guacamole and sour cream along with it. Tortilla is flavorful, can distinctly pick up the flavor of cheese with it and the shrimp compliments well. The seasonings the chef splashed over shrimp while cooking came through. \n\nThere was a different staff member at the register than I've seen on prior trips who was friendly and efficiently kept the line moving. Some of the comment concerns regarding unfriendly staff may have been addressed and improved on.\n\nI'm deducting a star due to past experiences where staff have locked the front door during posted business hours and started closing early, ignored surprised patrons at the door in the process. Life happens and there may be cases where it's necessary. A sign on the door explaining the situation would go a long way. To some degree I consider La Playa Taqueria undependable and a second-tier option due to finding the place closing during business hours. It will take some time to rebuild trust. \n\nConsidering price, portion size, tastiness, and convenient location I would give La Playa Taqueria 4 stars. If the friendliness shown on this trip and dependable hours holds could be the best burrito spot this side of the Mission. Especially if they expand on the hot sauce offerings!", "rating": 3, "date": "2016-07-17"}, {"excerpts": ["Their carnitas burrito and shrimp burrito are pretty good. ", "Take your burrito down by the beach or sit outside and eat."], "author": "Sherry L.", "review": "Solid taqueria in outer sunset. If you can't get to the mission, then this is a good bet. Their carnitas burrito and shrimp burrito are pretty good. Take your burrito down by the beach or sit outside and eat.", "rating": 3, "date": "2015-12-21"}, {"excerpts": ["The shrimp burrito, with sour cream. \n\n", "This all adds up to ithe shrimp burrito that may have me coming back other than last ditch late dinners."], "author": "Jon A.", "review": "Let's do some math: \n\n2 -- blocks away from my house\n1 -- year of living two blocks away\n365 -- opportunities to eat a burrito\n15 -- likely times I ate a burrito in the last year\n7 -- likely times I ate a burrito here. \n6 -- burritos I could have lived without.\n1 -- burrito I really liked, the most recent. The shrimp burrito, with sour cream. \n\nAn entire year passed of so-so burritos that were really just last ditch 10pm dinners after a long day of work where I didn't want to do anything for myself other than consider a selfie of my forearm with a forearm-sized burrito next to it, someone give me food, and eat it. \n\nThis all adds up to ithe shrimp burrito that may have me coming back other than last ditch late dinners.", "rating": 4, "date": "2013-11-14"}, {"excerpts": ["I had the carne asada and shrimp burrito ", "and I could not have been more devastated with it. ", "Initially I looked at it and thought wow, its pretty big, not bad for $8 or so. ", "About 1/4 of the way into the burrito ", "and I had not reached any carne asada or shrimp. ", "Didn't reach those two main ingredients until almost half of the thing was gone. ", "The carne asada lacked flavor and tasted pretty awful actually. "], "author": "Alyssa A.", "review": "I really hate to give anything a bad review, but really if you mess up a burrito, you may just want to stop calling yourself a taqueria! \n\nI had the carne asada and shrimp burrito and I could not have been more devastated with it. Initially I looked at it and thought wow, its pretty big, not bad for $8 or so. About 1/4 of the way into the burrito and I had not reached any carne asada or shrimp. Didn't reach those two main ingredients until almost half of the thing was gone. The carne asada lacked flavor and tasted pretty awful actually. Have to admit, my fault for forgetting to tell them to hold off on the lettuce, nothing worse than biting into soggy lettuce to top it off. \n\nYes, I am pretty picky when it comes to Mexican food, but I do take many factors into consideration when judging a restaurant, and I honestly have to say, I will not be returning nor recommending to anyone I know in the Sunset or SF.\n\nGiving it 2 stars because maybe something else there is actually good, but the boyfriend had a wet burrito and didn't seem so satisfied either so 2 is the best I can do.", "rating": 2, "date": "2013-07-01"}, {"excerpts": ["I haven't had it, but the shrimp burrito seems to be pretty popular."], "author": "Jose P.", "review": "The fish taco. The grilled mahi-mahi taco. Absolutely amazing!!!\n\nThe fish taco is breaded fried fish, guacamole, cabbage, so delicious. It is almost perfect, but on a few occasions the fish was over breaded. That said, I've had it a million times and the vast majority of times it was unbeatable.\n\nThe grilled mahi-mahi is topped with a mango pico de gallo that steals the show.\n\nThe tacos don't travel well, they are best enjoyed in the restaurant. Want to-go, get a burrito. I haven't had it, but the shrimp burrito seems to be pretty popular.", "rating": 4, "date": "2014-04-07"}, {"excerpts": ["Carne Asada & Shrimp Burrito, Any Quesadilla, Any Taco ("], "author": "Harry W.", "review": "Next to Chinese Food, Mexican food, or rather.. taqueria-style Mexican food is probably my favorite take-out cuisine for me.\n\nWhy does this place rank higher than the rest?\n1) MORE MEAT - plenty of it in my tacos, burritos, quesadillas!  No skimpin!\n\n2) TASTES BETTER!! - Where applicable (Carne Asada, Pollo Asada) Meats are cooked fully on the grill and have plenty of that grill flavor!\nYou can also specify black beans too, as I usually do.. \n\n3) Tasty favorites/regulars I order up:  The following menu items have happily earned a regular spot in my tummy:  Carne Asada & Shrimp Burrito, Any Quesadilla, Any Taco (esp. carnitas), and the occasional fish taco and torta fit the bill.  \n\nI've tried other taqueria places out here, but their offerings just seemed watery, tasteless, or just average.\n\nCaveats:  OK, first impressions from the street, La Playa TQ doesn't look all that impressive, especially being situated next to a very dive-y looking run down surfer coffee shop, but they still scored a very high 98 on the SF Dept of Health Inspections.\n\nSo, when it comes to the Sunset, La Playa ranks at the top for me in terms of flavor and ingredients when it comes to the wonderful burritos, tacos and quesadillas that they offer.", "rating": 4, "date": "2011-02-05"}, {"excerpts": ["My favorite burrito, the holy grail of burritos use to be this places shrimp burrito. ", "...not anymore. ", "They've totally watered down the Chipotle sauce :( ", "my burrito was about as bland as a bowl of white rice."], "author": "Priscilla L.", "review": "I haven't been here in almost 5 years till today.  My favorite burrito, the holy grail of burritos use to be this places shrimp burrito. ...not anymore. They've totally watered down the Chipotle sauce :( my burrito was about as bland as a bowl of white rice.", "rating": 2, "date": "2014-07-30"}, {"excerpts": ["I typically order the shrimp burrito, delicious. ", "Cheap, good eats. ", "Enjoy."], "author": "Jen D.", "review": "My neighborhood taqueria (besides Gordos). Love this place for take out and you can typically find parking (PLUS!). Not much space for dine-in, which is a shame. I typically order the shrimp burrito, delicious. Cheap, good eats. Enjoy.", "rating": 4, "date": "2014-09-21"}, {"excerpts": ["Went in for lunch today, ordered a steak n shrimp burrito, no guacamole and no lettuce. ", "Tell me why my burrito is soggy? ", "The beef had a boiled taste instead of asada \"grilled\" that messed up the burrito for me. ", "Point is who wants a hot soggy burrito for lunch??? ", "I don't, I won't be returning."], "author": "Selene P.", "review": "Burritos aren't what they use to be. Went in for lunch today, ordered a steak n shrimp burrito, no guacamole and no lettuce. Tell me why my burrito is soggy? The beef had a boiled taste instead of asada \"grilled\" that messed up the burrito for me. Point is who wants a hot soggy burrito for lunch??? I don't, I won't be returning.", "rating": 2, "date": "2014-02-21"}, {"excerpts": ["Steak and Shrimp Burrito ", "- This is one of the few places I can get a steak and shrimp burrito that is quite delicious sometimes.  "], "author": "Casey L.", "review": "La Playa Taqueria is a small business close to the beach on Noriega. The burritos and platters don't stand out so I can give this place a 3 - 3.5 stars. This Taqueria is a place I try if I'm doing laundry around the area, otherwise I don't really go out of my way to eat here. Their food is seasoned decently, and I don't find myself dousing their food with hot sauce to mask the taste.\n\nSteak and Shrimp Burrito - This is one of the few places I can get a steak and shrimp burrito that is quite delicious sometimes.  However, there was one incident I didn't feel too good eating my burrito and found refuge in the bathroom.\n\nNachos - Carne Asada on top of load bearing chips with refried beans and etc haven't disappointed me yet. Of course, this should be eaten as soon as it reaches your hands.\n\nA fairly average Taqueria that is convenient to small business and homes that are located nearby. However, I aim to try this place again for the breakfast menu and will update when that occurs.", "rating": 3, "date": "2011-11-01"}, {"excerpts": ["Second visit was for lunch and i have a carne asada & shrimp burrito and was barely ok. ", "Maybe will go for regualr burrito next time. ", "The tastiest was their homemade papas and salsa. ", "Hopefully next time I come I will be able to write something that gives good reviews about the food..but so far gotta say just barely a OK tasting place."], "author": "Jaime P.", "review": "My first visit i have one of their b-fast burritos....its was OK, but will try a different one on the next B-fast visit. Second visit was for lunch and i have a carne asada & shrimp burrito and was barely ok. Maybe will go for regualr burrito next time. The tastiest was their homemade papas and salsa. Hopefully next time I come I will be able to write something that gives good reviews about the food..but so far gotta say just barely a OK tasting place.", "rating": 2, "date": "2012-01-07"}, {"excerpts": ["I just love their steak and shrimp burrito but ", "the only problem I really got with it is that it's meat is way too overcooked(literally burnt). ", "Other than that pretty good food and pretty good service."], "author": "Ada H.", "review": "Since I live by here, when my mom and I feel lazy to cook, we take their burritos to go. I just love their steak and shrimp burrito but the only problem I really got with it is that it's meat is way too overcooked(literally burnt). Other than that pretty good food and pretty good service.", "rating": 4, "date": "2012-05-15"}, {"excerpts": ["Their steak and shrimp burrito is out of this world. ", "Large juicy shrimps piled on top of delicious steak. ", "Yum! ", "Their tacos are pretty bombs too. ", "If you're in the area and craving some Mexican, drop on by. ", "Prices are average - right around $10 for a burrito and a drink."], "author": "Andy T.", "review": "Not too many taquerias here in the outer sunset area but La Playa taqueria is definitely the real deal. Their steak and shrimp burrito is out of this world. Large juicy shrimps piled on top of delicious steak. Yum! Their tacos are pretty bombs too. If you're in the area and craving some Mexican, drop on by. Prices are average - right around $10 for a burrito and a drink.", "rating": 4, "date": "2014-07-17"}, {"excerpts": ["Imagine my surprise when I got home and bit into a shrimp burrito (and have felt a little ill since eating the small portion I did)."], "author": "Casey B.", "review": "Can't really recommend the place. Stopped in earlier, ordered a pork super burrito, when it was done, they told me my pork burrito was ready. Imagine my surprise when I got home and bit into a shrimp burrito (and have felt a little ill since eating the small portion I did).", "rating": 1, "date": "2012-11-27"}, {"excerpts": ["Their chicken super burrito was just okay, but their shrimp burrito made up for my last visit there (much more shrimp factor than I anticipated).  ", "I do wish they weren't so skimpy on their salsa. "], "author": "Kara B.", "review": "When your tummy is a rumbling and you can't decide on whether you want Chinese or Korean, Korean or Chinese, just go to the only Mexican place in this hood. \n\nIt seems that, other than the pizza place, one block up, you're going to be limited to Asian fare.\n \nOn our first visit, my crazy old man said \"if we walk in here, and there aren't any Mexicans cooking, I'm leaving\".  Well, lucky for him, he got to eat that day. \n\nIt isn't the best, but it ain't the worst either.  Their chicken super burrito was just okay, but their shrimp burrito made up for my last visit there (much more shrimp factor than I anticipated).  I do wish they weren't so skimpy on their salsa. And, I wish there was another option besides pico de gallo, or hot sauce.  \n\nI'm going to brush up on my Spanish (that's what happen to us half-breeds with bi-lingual parents who spoke different languages, so I didn't get to become tri-lingual) for my next visit and see if I can't order up some of the good salsa (I know they have some lingering somewhere) along with a Bret Michaels Trop-A-Rocka Snapple.  \nI'm kicking myself for not grabbing one while I had the chance. ¿Alguien sabe donde puedo encontrar que Bret Michaels jugo? Por favor?", "rating": 3, "date": "2010-08-09"}, {"excerpts": ["My sister got massive food poisoning on her first visit to La Playa years ago (though that was probably from the shrimp in her shrimp burrito), and I should've learned my lesson then.  ", "Shame on me, and shame on La Playa.  ", "Do yourself a favor and drive somewhere decent."], "author": "Jin D.", "review": "I can haz nacho?\nI venture to La Playa\nHoping things have changed\n_____\n\nI've given La Playa so many chances, but it continues to disappoint every time.  The other day I had a craving for nachos and I was too lazy to drive somewhere to fulfill that craving, so I walked over to La Playa, which is the only taqueria in this part of town.  I ordered nachos, paid extra for chicken, and proceeded to eat it all while still very much craving nachos and feeling sad and disappointed about the $8.50 that could've been spent on better, craving-satisfying nachos.\n\nMy sister got massive food poisoning on her first visit to La Playa years ago (though that was probably from the shrimp in her shrimp burrito), and I should've learned my lesson then.  Shame on me, and shame on La Playa.  Do yourself a favor and drive somewhere decent.", "rating": 1, "date": "2009-08-30"}, {"excerpts": ["I have cravings for La Playa's shrimp burrito!  ", "It will leave you very full if you can finish it, so I recommend saving a portion for later.  ", "Yummy."], "author": "Kara C.", "review": "I have cravings for La Playa's shrimp burrito!  It will leave you very full if you can finish it, so I recommend saving a portion for later.  Yummy.", "rating": 4, "date": "2014-08-01"}, {"excerpts": ["I don't even live in the city, but ALWAYS ALWAYS come here for their SHRIMP BURRITO. ", "It is that good."], "author": "Natalie W.", "review": "I don't even live in the city, but ALWAYS ALWAYS come here for their SHRIMP BURRITO. It is that good.", "rating": 5, "date": "2014-07-15"}, {"excerpts": ["La Playa's shrimp burrito will leave you more than satisfied in the hunger department. ", "Its got a chipotle sauce that's got quite a nice kick to it. "], "author": "Crystal A.", "review": "I'm a fan of seafood. I am also a fan of burritos. Thus I am a big fan of shrimp burritos. \n\nLa Playa's shrimp burrito will leave you more than satisfied in the hunger department. Its got a chipotle sauce that's got quite a nice kick to it. They've also got a variation with a shrimp and steak burrito which is also great, no chipotle sauce though.\n\nI've found that their veggie burritos are kind of hit or miss. I've gotten some that have been awesome....then i've got some that made me wish i went somewhere else. \n\nOther than that, great go to burrito place if you leave by the water.", "rating": 4, "date": "2007-11-29"}, {"excerpts": ["Update 10-15-07\n\nGet the steak and shrimp burrito.  "], "author": "C C.", "review": "Update 10-15-07\n\nGet the steak and shrimp burrito.  Go!  Now.  Double YUM.\n---------------------------------------------------------------------------------------------\nIt smelled amazing when we walked in.  The shrimp tacos were YUM.  The baja fish tacos were good but stuffed with too much cabbage.  Very reasonable in price.  Can't wait to try some of the other menu items.", "rating": 4, "date": "2007-10-05"}, {"excerpts": ["she got a steak/shrimp burrito. ", "i got a breakfast burrito. "], "author": "Ameer N.", "review": "i really wanted a 5 star, i really really wanted it!\n\nla playa just didn't deliver the one time i was there. she got a steak/shrimp burrito. i got a breakfast burrito. neither was awesome, tho i can't say bad.\n\ni'm going to come back one day, and we'll have a round 2. perhaps better results next time!", "rating": 3, "date": "2008-09-08"}, {"excerpts": ["The Steak and shrimp burrito is the Cadillac of all burritos. "], "author": "Delta d.", "review": "Banging burrito's. \nThe Steak and shrimp burrito is the Cadillac of all burritos. then the chorizo breakfast burrito (served all day) is also a consistent winner. \n\nI recommend ordering \"to go\" if your party is more then 2, there is just no place to sit. For two people its nice and cozy though. \nBut blocks from OB and your just that close to a burrito and a beer at the beach, no-matter what time of day.", "rating": 5, "date": "2009-04-18"}, {"excerpts": ["my favorite is the shrimp burrito with chipotle sauce on a spinach tortilla, and black beans (6.25)... makes me salivate..."], "author": "Mookey G.", "review": "A great lil hole in the wall in the outer sunset...\n\nthe people who work there are chill, the  chips are crispy and sometimes warm, the salsa is fresh. \n\nmy favorite is the shrimp burrito with chipotle sauce on a spinach tortilla, and black beans (6.25)... makes me salivate...", "rating": 5, "date": "2008-01-08"}, {"excerpts": ["I always order the shrimp burrito and look forward to taking the first bite.  ", "It boasts this spicy chipotle sauce (that isn't really that spicy at all).  "], "author": "Jeanne L.", "review": "I always order the shrimp burrito and look forward to taking the first bite.  It boasts this spicy chipotle sauce (that isn't really that spicy at all).  Only  after the second or third bite I realize it's not the fantastic goodness I made it out to be in my mind.  \n\nTo be fair that isn't the only item I order at La Playa Taqueria.  I've had the fish tacos and those are pretty straight forward.  Yet again nothing spectacular.\n\nWith all that said, this taqueria is decent if there isn't any other option.  The best way to describe the food here is awesomely bad eats.", "rating": 2, "date": "2008-08-07"}, {"excerpts": ["I ordered the super veggie and my bf ordered the steak and shrimp burrito which seemed pretty damn good. ", "The moral of the story is, don't forget to ask for hot sauce!"], "author": "Katie S.", "review": "Tastes more or less like most SF burritos (oh how i forever pine for socal mexican food). Not great but pretty good, and one of these reasons is because they don't give you hot sauce!! Apparently you have to ask for it but I have never experienced such a travesty before. I ordered the super veggie and my bf ordered the steak and shrimp burrito which seemed pretty damn good. The moral of the story is, don't forget to ask for hot sauce!", "rating": 3, "date": "2009-11-10"}, {"excerpts": ["I ordered the shrimp burrito with chipotle sauce.  ", "It was actually really good and ", "a memorable burrito.  ", "It was a good sunny day walking back from the beach ", "and I decided to try it out.  ", "From what I experienced the service was good and the burrito was really good.  ", "Definitely go for the shrimp burrito if you have a choice.  ", "It is worth the extra dollar or two to make a more memorable experience."], "author": "Michael L.", "review": "I ordered the shrimp burrito with chipotle sauce.  It was actually really good and a memorable burrito.  It was a good sunny day walking back from the beach and I decided to try it out.  From what I experienced the service was good and the burrito was really good.  Definitely go for the shrimp burrito if you have a choice.  It is worth the extra dollar or two to make a more memorable experience.", "rating": 4, "date": "2010-07-11"}, {"excerpts": ["Eaten here a few times and I've never been overly impressed... until I got the steak and shrimp burrito yesterday (only $7! "], "author": "Brandi C.", "review": "Eaten here a few times and I've never been overly impressed... until I got the steak and shrimp burrito yesterday (only $7! I feel like for steak and shrimp I'd expect to pay 7.50 or $8 in a lot of places).  \n\nThe burrito would have been just okay, except the shrimp were soooo delicious!  They must have been cooked with garlic butter or something, tasted like shrimp you'd get in a fancy dish at a nice restaurant. Delicious! Now I'm going to start craving La Playa all the time like some of my friends...\n\n(some of my friends have stopped talking about things in terms of money but rather in terms of La Playa... like \"going out to a movie matinee costs about one La Playa.\" That's how often they eat there.)", "rating": 4, "date": "2009-07-24"}, {"excerpts": ["I really like the shrimp burrito at La Playa... ", "even if I didn't live in the Outer Sunset, I would crave it.  ", "They have really good fresh chips that come with the burritos, and their tacos are great, too.  ", "My husband isn't as much of a fan of La Playa as I am, but I'd eat here once a week if he didn't protest each time with \"you want another damn burrito for dinner?\"  ", "It's right next to the Sea Biscuit, so there are always lots of surfers hanging out in the front with their dogs."], "author": "robyn s.", "review": "I really like the shrimp burrito at La Playa... even if I didn't live in the Outer Sunset, I would crave it.  They have really good fresh chips that come with the burritos, and their tacos are great, too.  My husband isn't as much of a fan of La Playa as I am, but I'd eat here once a week if he didn't protest each time with \"you want another damn burrito for dinner?\"  It's right next to the Sea Biscuit, so there are always lots of surfers hanging out in the front with their dogs.", "rating": 4, "date": "2006-09-29"}, {"excerpts": ["The steak and shrimp burrito is the bomb...seriously! ", "The service is awesome! ", "It's a california style taco joint in the sunset! ", "It's priced reasonably!"], "author": "Elle G.", "review": "The steak and shrimp burrito is the bomb...seriously! The service is awesome! It's a california style taco joint in the sunset! It's priced reasonably!", "rating": 5, "date": "2008-04-05"}, {"excerpts": ["I asked for a steak and shrimp BURRITO ", "and he thought I said steak QUESADILLA.  ", "Yeah I guess it was an honest mistake (a really stupid one), but it wouldn't have even bothered me if he wasn't so incredibly rude about it. ", "I didn't know he took down the wrong order until the quesadilla was done and ", "when I said that I ordered a burrito, he raised his voice and pointed at me, yelling \"I SWEAR to god you did not say that YOU said STEAK QUESADILLA!\". ", "Overdramatic much?! ", "Can someone please go there and give this guy a lesson in manners? ", "He's has wavy black hair and is almost always there. ", "Beware. ", "Steak and shrimp burrito with black beans! ", "Yum. ", "But I still hate that one worker."], "author": "Kari G.", "review": "I would've given this place 4 stars if it wasn't for the crappy service when I went there yesterday afternoon. I love their food, and the very first time I went there, I had the friendliest service from the guy taking the order. When my friend mentioned to me that it'd be cold to sit by the door, he offered to close it for us. He's also pretty funny if you're in the mood for small talk, but not pushy about it. Super nice guy. I have no idea where he went but the guy who was there the next few times was a total jackass! He always gives off a moody vibe and today, he misheard what I said and took down the wrong order. I asked for a steak and shrimp BURRITO and he thought I said steak QUESADILLA.  Yeah I guess it was an honest mistake (a really stupid one), but it wouldn't have even bothered me if he wasn't so incredibly rude about it. I didn't know he took down the wrong order until the quesadilla was done and when I said that I ordered a burrito, he raised his voice and pointed at me, yelling \"I SWEAR to god you did not say that YOU said STEAK QUESADILLA!\". Overdramatic much?! Can someone please go there and give this guy a lesson in manners? He's has wavy black hair and is almost always there. Beware. Definitely top 5 on my list of worst service ever received. \n\nOh yeah, the food. I've had burritos at a couple places and that one makes some good ones. Steak and shrimp burrito with black beans! Yum. But I still hate that one worker.", "rating": 3, "date": "2010-04-08"}, {"excerpts": ["Tonight my shrimp burrito was folded so that a thick double-wall of soggy tortilla ran down the entire center; dividing about 10 pinto beans on one side with lettuce, and a reservoir of scattered rice grains mixed in spicy sour cream on the other.  ", "My first bite was a winner: the butt end had 4 nice little shrimp in it.  ", "I found another later on in the other 3/4.  ", "It was extremely bland and almost half way ", "through I dissected it in hopes of extracting nourishment from the pinto beans that I had yet to find.  ", "I was sad to find that my allotment of pinto beans measured one tablespoon, to two parts rice.  ", "Aside from the mild spiciness, utterly bland and uninspired.  ", "Just yuck.\n", "I chopped the carcass and mixed it with kibble to serve  a slightly less particular friend.\n", "For this particular item's fans:\nL.P. Shrimp Burrito.\n", "1 Flour tortilla\n4-5 small shrimp, sauteed.\n", "1 tbs cooked pintos \n2 tbs cooked rice\n1/2 cup shredded iceberg lettuce\n1/2 cup sour cream mixed with 5 packets of taco bell \"fire\".\n-pour all items into bowl, microwave for 30 seconds, stir, repeat.\n-empty contents onto flour tortilla.\n-once wrapped, using fingers push center of burrito so that the burrito is divided in half by length. "], "author": "Philip P.", "review": "Every time I tell myself never, NEVER again... then the occasion warrants, and thank god it's only my taste buds and not my G.I. tract that pays the fine.  Tonight my shrimp burrito was folded so that a thick double-wall of soggy tortilla ran down the entire center; dividing about 10 pinto beans on one side with lettuce, and a reservoir of scattered rice grains mixed in spicy sour cream on the other.  My first bite was a winner: the butt end had 4 nice little shrimp in it.  I found another later on in the other 3/4.  It was extremely bland and almost half way through I dissected it in hopes of extracting nourishment from the pinto beans that I had yet to find.  I was sad to find that my allotment of pinto beans measured one tablespoon, to two parts rice.  Aside from the mild spiciness, utterly bland and uninspired.  Just yuck.\nI chopped the carcass and mixed it with kibble to serve  a slightly less particular friend.\nFor this particular item's fans:\nL.P. Shrimp Burrito.\n1 Flour tortilla\n4-5 small shrimp, sauteed.\n1 tbs cooked pintos \n2 tbs cooked rice\n1/2 cup shredded iceberg lettuce\n1/2 cup sour cream mixed with 5 packets of taco bell \"fire\".\n-pour all items into bowl, microwave for 30 seconds, stir, repeat.\n-empty contents onto flour tortilla.\n-once wrapped, using fingers push center of burrito so that the burrito is divided in half by length. Then wrap tightly in tinfoil.\n\nTen bucks says it tastes the same.\nOne hundred dollars says the servers don't eat the menu items as is.", "rating": 1, "date": "2009-08-16"}, {"excerpts": ["I had a steak and shrimp burrito with chipotle sauce (he is charging an extra $.50 for that).  ", "The truth of the matter is, it was delicious and filled me up.  ", "The flavor that the sauce gives warrants the extra sratch.  ", "Also my amigo behind the counter seemed happy to see me.  ", "So my business with them will resume, till he pisses me off again.  \n", "Note:  ", "The chips and salsa are weak at best.  ", "My dog is fine with the shitty chips.  ", "Since I don't eat them he gets them all.  ", "Apparently he is more into quantity than quality, who would have known?  ", "And if you have read this far you can probably deduce that the little man behind the counter can be unpleasent.  ", "However, the burritos always deliver."], "author": "Chris A.", "review": "The little dude that works there pissed me off severely about a month ago.  I am going to tell you about it.  \nSo I just rolled into town from a weekend of riding dirtbikes in Mendocino county.  I was sore, starving, tired, had road rage, etc... If you dont know there are not a lot of options for food in the Sunset in general, and it gets meager on a Sun night.  All I wanted was 2 steak and shrimp burritos.  One for me and one for my friend and some chips for Escobar.  It was about 3 min til 8 on Sun.  The sign in the window clearly stated that they were open til 8 on Sun.  There were about 3 people inside waiting for their food, but the other sign in the window said 'Closed.'  Now I have been there about 20 times in the last couple months.  So that little dude has seen my face plenty.  I am sure he bought an ipod or 2 with the amount of dinero I have given him.  Anyways, I poke my head in the door and politely ask if he could wrap a couple burritos up for me and my boy.  The little prick said they were closed and turned his back on me.  That pissed me off proper like.   I had pizza instead, which I absolutely was not in the mood for.   \nSo I boycotted them and eat less burritos.  Visited some other places some good some not so good.   \nYesterday my hunger strike ended.  I had a steak and shrimp burrito with chipotle sauce (he is charging an extra $.50 for that).  The truth of the matter is, it was delicious and filled me up.  The flavor that the sauce gives warrants the extra sratch.  Also my amigo behind the counter seemed happy to see me.  So my business with them will resume, till he pisses me off again.  \nNote:  The chips and salsa are weak at best.  My dog is fine with the shitty chips.  Since I don't eat them he gets them all.  Apparently he is more into quantity than quality, who would have known?  And if you have read this far you can probably deduce that the little man behind the counter can be unpleasent.  However, the burritos always deliver.", "rating": 3, "date": "2007-12-30"}, {"excerpts": ["I also recommend the steak and shrimp burrito.  ", "The service is friendly and fast and the prices are relatively cheap."], "author": "Roger P.", "review": "Taqueria La Playa is close to my home and I have eaten there many times.  The regular breakfast burrito is excellent with or without chorrizo.  The Baja fish taco platter is another excellent choice.  I also recommend the steak and shrimp burrito.  The service is friendly and fast and the prices are relatively cheap.", "rating": 4, "date": "2008-01-10"}, {"excerpts": ["Overall good food, enjoyed the steak and shrimp burrito & the vegetarian. ", "Didn't know that you had to request hot sauce, it should have been a given. which for a takeout order was very disappointing."], "author": "jeff P.", "review": "Overall good food, enjoyed the steak and shrimp burrito & the vegetarian. Didn't know that you had to request hot sauce, it should have been a given. which for a takeout order was very disappointing.", "rating": 3, "date": "2009-11-08"}], "three pepper burrito": [{"excerpts": ["The Three Pepper Burrito. ", "For $6.75, the burrito has Grilled Chicken or Grilled Steak, Roasted Green, Red, Poblano Peppers, Onions, Rice, Beans, Cheese, Avocado, and Salsa in a grilled Flour Tortilla. ", "Not many places make this kind of burrito. ", "And I like La Playa's version. ", "The Grilled Chicken was grilled and cooked nicely. ", "The Peppers add a nice kick with the other common ingredients in the greasy burrito. "], "author": "Matt G.", "review": "Compared to many of the taquerias that I've been to, this is probably the smallest one that I've visited and ate at. You can also say that to many of the businesses in the outer Sunset are limited with space as well. \n\nFor lunch I had one of the taqueria's popular burritos: The Three Pepper Burrito. For $6.75, the burrito has Grilled Chicken or Grilled Steak, Roasted Green, Red, Poblano Peppers, Onions, Rice, Beans, Cheese, Avocado, and Salsa in a grilled Flour Tortilla. Not many places make this kind of burrito. And I like La Playa's version. The Grilled Chicken was grilled and cooked nicely. The Peppers add a nice kick with the other common ingredients in the greasy burrito. My burrito: http://www.yelp.com/biz_photos/VhvVzBxyTkDKV1pFT1YwfA?select=t4Tr6TCHbnWzWKN36dS97g\n\nI also added a cold bottle of Sidral Mundet apple soda with my meal. \n\nThe lady that took my order was a bit stunned with my fluent speaking of Spanish. \n\n\"I've been to over 300 Taquerias and studied the language, I've better know how to speak the language!\"   \n\nDespite the low ratings, I like the food here and will come here once again.", "rating": 4, "date": "2011-06-09"}, {"excerpts": ["The reason I keep coming back, though, is the Three Pepper Burrito with chicken. ", "The roasted poblano peppers and super tender chicken are a match made in burrito heaven. "], "author": "Gun-Ik P.", "review": "Not the best taqueria I've ever been to. Their chips aren't that great, the prices are a little bit higher than most other taquerias, and the salsa is just average. The reason I keep coming back, though, is the Three Pepper Burrito with chicken. The roasted poblano peppers and super tender chicken are a match made in burrito heaven. The total for one of these burritos comes out to around $8, which isn't that bad.\n\nIf you are a fan of Chipotle's chicken, I would try Le Playa's chicken. You might be a convert.", "rating": 4, "date": "2011-09-10"}, {"excerpts": ["three pepper burrito. ", "Delicious. ", "Don't f*ck around with the stuff on the menu thats wack (breakfast burrito and other random American-Mex food, although this place technically makes American-Mex, but moving on). ", "Matter of fact, to all the uppity yups on here that are all \"they don't make a breakfast burrito like I'm used to at the pretentious little organic deli\", I have two remarks: one, what is the appeal of a breakfast burrito? ", "The very idea is disgusting! ", "Scrambled eggs in a burrito?!?! What are you thinking? ", "And where do you think that came from? ", "Some hellish kitchen in a bizarre state like Arizona or Florida no doubt. ", "Ok, back to La Playa and the delicious three pepper burrito. ", "They do it right, stuffed full with everything that's supposed to go in a burrito, the burritos are huge, and you can get several tasty salsas (just ask!). ", "They are also reasonably priced. ", "The girl at the counter can definitely be a little short but don't walk away until you get your salsa and your pico. "], "author": "Michael M.", "review": "Aight let me just tell you whats up: three pepper burrito. Delicious. Don't f*ck around with the stuff on the menu thats wack (breakfast burrito and other random American-Mex food, although this place technically makes American-Mex, but moving on). Matter of fact, to all the uppity yups on here that are all \"they don't make a breakfast burrito like I'm used to at the pretentious little organic deli\", I have two remarks: one, what is the appeal of a breakfast burrito? The very idea is disgusting! Scrambled eggs in a burrito?!?! What are you thinking? And where do you think that came from? Some hellish kitchen in a bizarre state like Arizona or Florida no doubt. Anyway. \n\nSecond: to those who note that \"the girl at the counter was rude\", you think the world revolves around you? Grow up and get a life. Better yet, move away from San Francisco! You're perfect for somewhere. Why don't you live above a shopping mall? PF Changs and Chipotle will be right next door. \n\nOk, back to La Playa and the delicious three pepper burrito. They do it right, stuffed full with everything that's supposed to go in a burrito, the burritos are huge, and you can get several tasty salsas (just ask!). They are also reasonably priced. The girl at the counter can definitely be a little short but don't walk away until you get your salsa and your pico. Just be patient, it will be worth it.  \n\nFour stars because the fish taco was nothing to write home about. In fact, it was kind of bad. But it had a tasty sauce in it, the fish was just cooked in a weird not good way. Know this and don't be tempted. Yes, fish tacos are delicious, but this is not the place.  \n\nFinal comment: the burrito really is fantastic! I've eaten California-Mex style burritos from Los Angeles to the Central Valley to San Francisco and La Playa gets high marks.", "rating": 4, "date": "2013-12-20"}, {"excerpts": ["By far the best chicken burrito I've ever had - The Three Pepper Burrito with your choice of grilled chicken or steak, roasted green, red, and poblano peppers, onions, garlic, rice, beans, cheese, avocado, salsa. \n\n"], "author": "Christine C.", "review": "By far the best chicken burrito I've ever had - The Three Pepper Burrito with your choice of grilled chicken or steak, roasted green, red, and poblano peppers, onions, garlic, rice, beans, cheese, avocado, salsa. \n\nThe grilled taste of the chicken and peppers really does the trick! A great amount of avocado, meat, peppers... it just is well-built burrito. \n\nBefore this amazing creation... I wasn't a fan of La Playa. I thought the fish tacos were mediocre. The guacamole it came with was lackluster. The salsa was bland. The chips were ok. And they don't make fish burritos though they have fish for tacos. I gave them many chances hoping I'd get a great fish taco... but it just didn't do it for me. I always opted for something else when Ryry wanted a burrito (he loved this place from the get-go).\n\nOne day I was feeling courageous and brave and decided to go all in and get a burrito with all the fixings... and boy was I happy and surprised! Now I never hesitate to go to La Playa for a delicious, filling, reasonable meal (half now, half for lunch tomorrow!)! yum... :D", "rating": 5, "date": "2010-11-06"}, {"excerpts": ["I had a vegetarian three pepper burrito. ", "It was good, but nothing that special. "], "author": "Jordan M.", "review": "I had a vegetarian three pepper burrito. It was good, but nothing that special. I would probably go there again if I was at the beach, but not for any other reason.\n\nThe staff seemed completely zombified. Normally that would be pretty awesome, but these are the most boring zombies I've ever encountered. They didn't even make the slightest attempt to eat my brain. I was extremely disappointed.", "rating": 3, "date": "2010-09-24"}, {"excerpts": ["The Three Pepper Burrito was awesome. ", "Very flavorful, good size and reasonably priced. ", "The first time it was delicious, the second time it was kinda dry and lacked any real flavor. ", "The chips are average but are included with the burrito. "], "author": "Chili B.", "review": "Pretty great place.\n\nThe Three Pepper Burrito was awesome. Very flavorful, good size and reasonably priced. The first time it was delicious, the second time it was kinda dry and lacked any real flavor. The chips are average but are included with the burrito. The hot sauce is good.\n\nThe fish tacos baja style are just ok, I've had a lot better. But then again, SF is not known for having great tacos, like down in SoCal.\n\nStay with the burritos here and you'll be happy.", "rating": 3, "date": "2007-09-27"}], "surfing wet burrito": [{"excerpts": ["I ordered a Surfing Wet burrito ", "and it was GIGANTIC, which is never a problem, but it was hands down ", "the worst burrito ", "I've ever attempted to eat. ", "Not only was it drowning in sauce (again not normally bad) but the sauce tasted way off, literally tasted closer to a pasta sauce than a red sauce. ", "The meat was beyond salty, over seasoned, overcooked, really the works. ", "And filled, I mean filled, with jalapeños."], "author": "Jessica G.", "review": "Im sorry, this use to be a pretty decent place to grab a burrito in the neighborhood, I dont know what happened or what changed, but I could not believe how bad its gotten. I ordered a Surfing Wet burrito and it was GIGANTIC, which is never a problem, but it was hands down the worst burrito I've ever attempted to eat. Not only was it drowning in sauce (again not normally bad) but the sauce tasted way off, literally tasted closer to a pasta sauce than a red sauce. The meat was beyond salty, over seasoned, overcooked, really the works. And filled, I mean filled, with jalapeños.", "rating": 1, "date": "2018-06-18"}, {"excerpts": ["Cons: cramped dining space, odd enchilada sauce on their surfing wet burrito, and took long to get food, carnitas lacked flavor. \n\n"], "author": "Marlon T.", "review": "This Mexican spot in the outer sunset is ok, and I do appreciate that they include grilled chiles in their burritos. \n\nPros: Good salsa, big portions, decent prices. \n\nCons: cramped dining space, odd enchilada sauce on their surfing wet burrito, and took long to get food, carnitas lacked flavor. \n\nI would give it another chance. Shouldn't have ordered the wet burrito, wonder how their carne asada tastes.", "rating": 3, "date": "2014-10-29"}], "super veggie burrito": [{"excerpts": ["I ordered their super veggie burrito and, as with other places in the Sunset, it was all right.\n\n"], "author": "Dan B.", "review": "I've come to the conclusion that if I want something resembling a Mission quality burrito I probably have to head out to the Mish to get one.\n\nIt's not to say the taquerias out in the Sunset are terrible, but in terms of flavor and freshness, they just can't compare.\n\nAnd after trying the veggie burrito at La Playa Taqueria, my fears have been confirmed.\n\nI ordered their super veggie burrito and, as with other places in the Sunset, it was all right.\n\nI would have appreciated some more rice and beans because it was thin in the middle and more tortilla than anything else at the end. \n\nAnd by the way, what is the deal with the chips?\n\nI get it if an accompanying side is so outstanding that it can be served alone.\nOtherwise, you really should include it or at least ask if they'd want some.\n\nMcDonald's french fries, for example, can stand alone because folks don't necessarily need or want a burger or sandwich to go with it.\n\nThat being said I haven't had chips and salsa so exceptional that I'd want to eat them by themselves.\n\nDid I totally just sound like a grumpy old man there?\nWhat's happening to me?\n\nNext thing you know my reviews will start off with, \"I remember the days when a dollar could buy you a . . . \"", "rating": 3, "date": "2012-08-29"}, {"excerpts": ["LOVE their super veggie burrito.  ", "I don't want to know the calorie content because if I did, I wouldn't be getting them as often as I do.  ", "Super good and very filling.  ", "Really big enough for 2 meals.  "], "author": "Lori B.", "review": "This place is great.  LOVE their super veggie burrito.  I don't want to know the calorie content because if I did, I wouldn't be getting them as often as I do.  Super good and very filling.  Really big enough for 2 meals.  It also comes with a size of fresh salsa and tortilla chips.  YUM!", "rating": 4, "date": "2012-05-27"}, {"excerpts": ["I tried their super veggie burrito ", "and it was killer.  ", "The last time I was there ", "I had their cheese enchiladas and they were excellent.  ", "The only thing I would do differently next time would be to ask for a little sour cream and guac on the side.  ", "The prices are really reasonable so I don't know where people are getting this dirt cheap Mexican food (unless they're talking Taco Bell) but my super burrito was around $4 and my enchilada dinner (3 enchiladas, rice, beans and salad) came to just over $6.  ", "This place is the best taqueria in the Outer Sunset--believe me."], "author": "Rabbit B.", "review": "I tried this place awhile ago and wasn't that happy with it but decided to give it another try.  I'm glad I did because I can see that they've really improved.  Maybe they've got a a new cook...who knows.  All I can say is I've been back a couple of times and each time it was very good.  I tried their super veggie burrito and it was killer.  The last time I was there I had their cheese enchiladas and they were excellent.  The only thing I would do differently next time would be to ask for a little sour cream and guac on the side.  The prices are really reasonable so I don't know where people are getting this dirt cheap Mexican food (unless they're talking Taco Bell) but my super burrito was around $4 and my enchilada dinner (3 enchiladas, rice, beans and salad) came to just over $6.  This place is the best taqueria in the Outer Sunset--believe me.", "rating": 4, "date": "2008-07-31"}], "chicken steak fajita burrito": [], "torta mexican sandwich": [], "steak fajita platter": [], "chicken fajita platter": [], "piece beef enchilada platter": [], "piece chicken enchilada platter": [], "piece cheese enchilada platter": [], "piece chile relleno platter": [], "carne asada platter": [], "carne asada and prawns platter": [], "mexican omelet": [], "spanish omelet": [], "spicy ortega omelet": [], "huevos con chorizo": [], "huevos a la mexican": [], "meat side": [], "fresh salsa": [{"excerpts": ["*Carnitas Taco ($2.75): Served with cilantro, onions and fresh salsa\n", "*Shrimp Taco ($2.95): Served with cilantro, onions and fresh salsa\n", "*", "Pollo Taco ($2.75): ", "Served with cilantro, onions and fresh salsa\n", "*Nachos Regular ($6): Served with melted cheese, Refried beans (on side), Hot salsa, Beef (+$1.50), Cheese (+$0.75), Guacamole (+$0.95), Jalapeno (+$0.75)\n"], "author": "Elena N.", "review": "I'm very prone to suggestion. When I realized it was National Taco Day (Tuesday, October 4th, 2016), I decided I wanted tacos for dinner. The usual spots on the way home seemed boring, so the roommate and I decided to get delivery via Postmates. (They were doing a special for taco day, so the delivery fee was only $1.99.) I placed the order at 6:21pm and it arrived at 6:54pm. I live in Outer Richmond.\n\n*Burrito Super ($9.30): Served with your choice of meat, rice, tortillas, beans, salsa - Refried beans, Carnitas, Hot salsa, Flour whole wheat tortilla (+$0.35), Guacamole (+$0.95), Jalapeno (+$0.75)\n*Carnitas Taco ($2.75): Served with cilantro, onions and fresh salsa\n*Fish Taco ($2.95): Served with baja style with cabbage, gaucamole and pancho sauce\n*Shrimp Taco ($2.95): Served with cilantro, onions and fresh salsa\n*Pollo Taco ($2.75): Served with cilantro, onions and fresh salsa\n*Nachos Regular ($6): Served with melted cheese, Refried beans (on side), Hot salsa, Beef (+$1.50), Cheese (+$0.75), Guacamole (+$0.95), Jalapeno (+$0.75)\n*Chicken Enchilada ($8.25)\n\nI got the four tacos and the nachos. The tacos were a good size. I actually couldn't eat all of them since my eyes were hungrier than my stomach. I ate the shrimp and fish taco that day and had the other two for lunch the next. (Though I did take a bite of each that day for taste purposes.) The fish taco was good. Crispy and I love the cabbage and sauce that came with it. Provided a nice fresh crunchy contrast. The shrimp tacos were okay. It had a good amount of shrimp, but I found them to be a little rubbery. The carnitas taco was good even with reheating. Nice, crispy, fried pork pieces. The chicken one was just all right. I found the chicken a little dry.\n\nI really enjoyed the nachos, but I wanted them to be cheesier. I paid for extra cheese, but I not sure if I got it. If so, then the dish doesn't normally come with much cheese. I did enjoy all the toppings though. The beef had a nice smokey grill flavor. The dish itself had a nice heat from the salsa and jalapenos. The roomie ordered the burrito and enchiladas. He seemed to enjoy them. We also got about four bags of chips and sides of pico. (I think they came with the tacos since I ordered four of them?) I didn't really eat the chips, but I liked throwing the pico on the tacos and nachos to give it an added element of freshness.\n\nOverall, I though their tacos were okay. And priced average at less than $3 each. (Not sure if Postmates inflates item prices, but I don't think they do based on past experience.) With Postmates delivery fee special, it was a nice way to celebrate National Taco Day.", "rating": 3, "date": "2016-10-16"}, {"excerpts": ["It also comes with a size of fresh salsa and tortilla chips.  ", "YUM!"], "author": "Lori B.", "review": "This place is great.  LOVE their super veggie burrito.  I don't want to know the calorie content because if I did, I wouldn't be getting them as often as I do.  Super good and very filling.  Really big enough for 2 meals.  It also comes with a size of fresh salsa and tortilla chips.  YUM!", "rating": 4, "date": "2012-05-27"}], "pancho sauce": [{"excerpts": ["*Fish Taco ($2.95): Served with baja style with cabbage, gaucamole and pancho sauce\n"], "author": "Elena N.", "review": "I'm very prone to suggestion. When I realized it was National Taco Day (Tuesday, October 4th, 2016), I decided I wanted tacos for dinner. The usual spots on the way home seemed boring, so the roommate and I decided to get delivery via Postmates. (They were doing a special for taco day, so the delivery fee was only $1.99.) I placed the order at 6:21pm and it arrived at 6:54pm. I live in Outer Richmond.\n\n*Burrito Super ($9.30): Served with your choice of meat, rice, tortillas, beans, salsa - Refried beans, Carnitas, Hot salsa, Flour whole wheat tortilla (+$0.35), Guacamole (+$0.95), Jalapeno (+$0.75)\n*Carnitas Taco ($2.75): Served with cilantro, onions and fresh salsa\n*Fish Taco ($2.95): Served with baja style with cabbage, gaucamole and pancho sauce\n*Shrimp Taco ($2.95): Served with cilantro, onions and fresh salsa\n*Pollo Taco ($2.75): Served with cilantro, onions and fresh salsa\n*Nachos Regular ($6): Served with melted cheese, Refried beans (on side), Hot salsa, Beef (+$1.50), Cheese (+$0.75), Guacamole (+$0.95), Jalapeno (+$0.75)\n*Chicken Enchilada ($8.25)\n\nI got the four tacos and the nachos. The tacos were a good size. I actually couldn't eat all of them since my eyes were hungrier than my stomach. I ate the shrimp and fish taco that day and had the other two for lunch the next. (Though I did take a bite of each that day for taste purposes.) The fish taco was good. Crispy and I love the cabbage and sauce that came with it. Provided a nice fresh crunchy contrast. The shrimp tacos were okay. It had a good amount of shrimp, but I found them to be a little rubbery. The carnitas taco was good even with reheating. Nice, crispy, fried pork pieces. The chicken one was just all right. I found the chicken a little dry.\n\nI really enjoyed the nachos, but I wanted them to be cheesier. I paid for extra cheese, but I not sure if I got it. If so, then the dish doesn't normally come with much cheese. I did enjoy all the toppings though. The beef had a nice smokey grill flavor. The dish itself had a nice heat from the salsa and jalapenos. The roomie ordered the burrito and enchiladas. He seemed to enjoy them. We also got about four bags of chips and sides of pico. (I think they came with the tacos since I ordered four of them?) I didn't really eat the chips, but I liked throwing the pico on the tacos and nachos to give it an added element of freshness.\n\nOverall, I though their tacos were okay. And priced average at less than $3 each. (Not sure if Postmates inflates item prices, but I don't think they do based on past experience.) With Postmates delivery fee special, it was a nice way to celebrate National Taco Day.", "rating": 3, "date": "2016-10-16"}]}