{"twice cooked fries": [{"excerpts": ["my early group ordered 4 orders of twice cooked fries with the entire range of dipping sauces...awesome fries that we cried how crispy it was and the soft center is super hot, so watch out for the roof of your mouths. \n\n"], "author": "Pauline L.", "review": "My group was hankering some Belgian food love and not necessarily the multitude of beers laid out at the bar.  We had to split up our party cause we were that big...my early group ordered 4 orders of twice cooked fries with the entire range of dipping sauces...awesome fries that we cried how crispy it was and the soft center is super hot, so watch out for the roof of your mouths. \n\nI ordered the mariniere style mussels and belgian fries. When they placed my seafood pot...I felt like I was brought to my feed bag..it was quite big and the mussels were super tasty. I love love the belgian fries.  My other friends ordered the rabbit stew (haha..she ate Thumper)....Dan M. ordered the Chicken Gentse Waterzooi and it was super delicious...it was also filling, he had to order a togo bag cause he was stuffed. All my other friends weren't as adventurous and chose the standard hamburgers and fries which they claimed was excellent.\n\nIf you make reservations here to eat, you need to have your entire party here or they won't seat you.  Also check on the board for their specials, they have the desserts listed there as well.", "rating": 5, "date": "2010-10-19"}, {"excerpts": ["GET THEIR TWICE COOKED FRIES if you're not looking for a meal. ", "They are delicious. ", "It comes with two sauces that you can choose from 10 or so. ", "The waitress recommended the Spicy Mustard and The Chipotle, of which I only liked the Chipotle. ", "I loved the Honey something Aioli. ", "Delicious.\n"], "author": "Rena Y.", "review": "Perched on a three way cross way, this restaurant has more bang than it looks from the outside. On a Wednesday night, the ground level was crickets-cricking quiet, but the place was surprisingly busy downstairs. Watch your steps though, the basement is darker than most places, which made me feel drunk before I sat down.\n\nService was very nice and helped us keep an eye out for a table for 10. They gave us a heads up about who they thought were going to leave soon and told us to hang tight. Also recommended a good beer that is on tap among their dictionary of a menu featuring a gazillion beers. I had the Affligem, a blonde beer, twice that night. We also had a \"shot\" of 13% beer--the name is eluding me right now, but it means devil in a language and dawns a little devil on the label. It was pretty good for a 13%, but also liked the Master Carlsburg that was about 12% in Denmark.\n\nGET THEIR TWICE COOKED FRIES if you're not looking for a meal. They are delicious. It comes with two sauces that you can choose from 10 or so. The waitress recommended the Spicy Mustard and The Chipotle, of which I only liked the Chipotle. I loved the Honey something Aioli. Delicious.\nI love my fries.\n\nIf you're looking for a filling meal, my friends gave great reviews for the San Francisco burger, which also comes with the fries.\nThe Mussels + Fries was also a great deal for $16--you get a medium sized pot of mussels and an order of fries.\n\nBeers averaged from $6-$8 on tap.\n\nI would definitely go back, but probably not often because of the 20 min bus ride from SOMA.", "rating": 4, "date": "2009-06-04"}, {"excerpts": ["The mussels come with twice cooked fries... can we say fried heaven? ", "You have the choice of two of eight dipping sauces. "], "author": "Lan H.", "review": "Mussels four different ways? Heaven!! \n\nIf you're headed to La Trappe for the mussels and are indecisive about the four different ways they are served, here are my favorites in order of preference: \n\n1) Provencal (White wine and garlic tomato sauce with parsley)\n2) Spicy Tomato (tomatos, pureed with rosemary and dried chili)\n3) Mariniere (white beer sauce with lemon, shallots, and fresh herbs)\n4) Coconut Curry on Jasmine Rice (Jalapeños, lemon grass, cilantro and fresh lime juice)\n\nThe mussels come with twice cooked fries... can we say fried heaven? You have the choice of two of eight dipping sauces. Favorites were Roasted Red Pepper Aoli, Honey Graham Dijon Aoli and Spicy Ketchup. \n\nI would love to comment on the EXTENSIVE beer list; however, I just listened to the server's recommendations as I held the 2390438 page beer menu in my hand. Ok, I exaggerate but as an amateur beer drinker, I entrusted my beer choice to the waitress and was not disappointed.\n\nMy advice is to call for a reservation to ensure a seat downstairs in the more lively drinking and dining area. If there's a bit of a wait, at least you have 2390438 pages of beer selections to digest :)", "rating": 4, "date": "2009-06-03"}, {"excerpts": ["Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. "], "author": "David P.", "review": "First stop on trip to San Francisco. Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. The one disappointment and reason I gave 4 stars instead of 5 was the smoked trout endive cups, which just really fell short. Highly recommended overall.", "rating": 4, "date": "2011-12-17"}, {"excerpts": ["the mussels in dark beer was the perfect app, and i LOVE that they bring you a plate full of diff sauces for the twice cooked fries - nom nom nom."], "author": "Lucy C.", "review": "great food, impressive beer list and awesome service. they don't take reservations but we went here with 20 people - luckily before the dinner rush. the people were very accommodating, going beyond to make sure they can set up a table to fit our large group. love a service with a smile :) \n\nthe beer list is insane, it's booklet of all different types of beer! it's a bit overwhelming if you first look at it but the people are helpful and when in doubt, just start with the beers on tap specials. didn't know beer can mess me up until i had the 9% ones. \n\nfood is also very very yummy! i had the sausage (nothing can go wrong with beer + sausage), but the winning dish of the night was the rabbit stew (my friend ordered and it was awesome). the mussels in dark beer was the perfect app, and i LOVE that they bring you a plate full of diff sauces for the twice cooked fries - nom nom nom.", "rating": 4, "date": "2009-05-18"}, {"excerpts": ["The three of us tried the marinated mussels with \"twice cooked fries\" (yes, that's how you have to make them!). ", "Overall, I wasn't too impressed. ", "The fries were almost cold, the mussels a bit overcooked and dry. ", "And we really missed the typical mussels sauce. ", "On the other hand,  they had a great selection of beer, but then again, failed to present them in the appropriate glass (this is oh so important to a Belgian!). ", "The Trappist in Oakland does a much better job here. ", "Finally, they overcharged us on all beers (1, 2 or even 4 (!) dollars on the Grimbergen). ", "So double check your bill. "], "author": "bart a.", "review": "As Belgians, living in San Francisco, we had to check out this place. You can see it's co-owned by a Belgian. There are some typical Belgian entrees on the menu (Gentse waterzooi, mosselen met frieten, etc.). The three of us tried the marinated mussels with \"twice cooked fries\" (yes, that's how you have to make them!). Overall, I wasn't too impressed. The fries were almost cold, the mussels a bit overcooked and dry. And we really missed the typical mussels sauce. On the other hand,  they had a great selection of beer, but then again, failed to present them in the appropriate glass (this is oh so important to a Belgian!). The Trappist in Oakland does a much better job here. Finally, they overcharged us on all beers (1, 2 or even 4 (!) dollars on the Grimbergen). So double check your bill. The server corrected his mistakes though and gave us a 10$ discount.\n\nThis place has all the potentials to be a true 5-star must-check-it-out place, so I am willing to give them some time...", "rating": 3, "date": "2008-01-27"}], "portobello mushroom": [{"excerpts": ["I shared a pesto pasta and portobello mushroom sandwich with another son and it was okay, but wouldn't order again.  ", "The last person got the vegetable stew and didn't share her opinion.  ", "I also feel I got overcharged for beers.  ", "A few times the server got confused ", "and I feel we were charged for more than we drank. ", "I know it was up to me to question the bill but decided to just settle the bill and depart.  ", "I think it would be fun to go here for a beer after eating somewhere else."], "author": "Kathy T.", "review": "I wish I could give this restaurant better reviews.  A friend recommended it for being a fun place to eat and great beer.  I liked the location, the atmosphere, and the beer selection was amazing, but the food was not good.  There were seven of us celebrating my son's 25th birthday.  Three of the guys got the hamburger and thought it was extremely bland.  My husband got the stew and thought it was okay.  I shared a pesto pasta and portobello mushroom sandwich with another son and it was okay, but wouldn't order again.  The last person got the vegetable stew and didn't share her opinion.  I also feel I got overcharged for beers.  A few times the server got confused and I feel we were charged for more than we drank. I know it was up to me to question the bill but decided to just settle the bill and depart.  I think it would be fun to go here for a beer after eating somewhere else.", "rating": 2, "date": "2018-10-04"}, {"excerpts": ["I had the portobello mushroom burger ", "AND IT WAS ", "SO GOOD. ", "Mouthwatering fried mushroom topped with goat cheese. ", "We also split the belgium fries which were huge portion wise, and came with our choice 2 dipping sauces. ", "We had the garlic mayo and the curry. ", "I preferred the curry which had a spicy kick to it, but the garlic was good too even though I'm not a mayo fan. ", "All in all, the service was exceptional and though the food may seem slightly on the pricy side, La Trappe is worth every penny."], "author": "Umeet S.", "review": "Came here for NYE dinner and I was so impressed! We were immediately seated downstairs, by the bar at a table with a built in chessboard. When we asked our waitress if they had chess pieces, she was ecstatic - really happy to see people interested in playing and brought out a box of pieces. While we were playing, our food was brought out and the server made it a point to arrange our food without interrupting our game. The food itself was fantastic - I had the portobello mushroom burger AND IT WAS SO GOOD. Mouthwatering fried mushroom topped with goat cheese. We also split the belgium fries which were huge portion wise, and came with our choice 2 dipping sauces. We had the garlic mayo and the curry. I preferred the curry which had a spicy kick to it, but the garlic was good too even though I'm not a mayo fan. All in all, the service was exceptional and though the food may seem slightly on the pricy side, La Trappe is worth every penny.", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["I got the portobello mushroom burger and it was great! "], "author": "Emily T.", "review": "Great for groups. We came here with about 16 people and had a blast. we didn't have a reservation but we came early to get a couple of tables upstairs. \n\nThe fries and the sauces are pretty awesome (esp the wasabi aioli) I got the portobello mushroom burger and it was great! The rabbit and steak and mussels were all tasty but not spectacular. \n\nWe asked for recommendation for beers and they were all pretty good. We just ordered a bunch of bottles and we all shared\n\nOverall great experience!", "rating": 4, "date": "2011-05-09"}, {"excerpts": ["The portobello mushroom burger, mussels provencal, fries and Belgium waffle were all very tasty.  "], "author": "Seong P.", "review": "I always forget the places I want to go when the moment comes for me to choose a destination but luckily some people have great memories (yay, Wakako) so I finally got to check out La Trappe.\n\nDo they seat people upstairs?  All I know is that it was empty around 7pm but I was directed downstairs where my group already was.  The interior was warm, full of people and cavelike.  I also believe we were sitting by a waterfall.  We chatted with the owner and tasted several of the beers on tap before making our decisions.\n\nThe portobello mushroom burger, mussels provencal, fries and Belgium waffle were all very tasty.  The Belgium waffle, in particular, disappeared in seconds.   \n\nAt one point, someone asked what time I wanted to leave.  I asked if it was almost midnight since I had taken BART.  I was looked at like I was crazy and told it was 8:30.  Good thing since I wasn't done yet.", "rating": 4, "date": "2008-12-28"}, {"excerpts": ["We immediately moved downstairs and enjoyed the two appetizers-- portobello mushroom on polenta that was simple but delicious, and the mussels in white beer sauce that was very mouth-watering flavourful!\n\n"], "author": "T L.", "review": "Came here for a quick pre-show bite. While sitting on street level and waiting for the food, I went downstairs to use the bathroom and found they have a great basement that was filled with mellow wooden furniture and a small waterfall, warm ambience with chessboard tables, which was a complete contrast to the upstairs bright white table-clothed dinning area. We immediately moved downstairs and enjoyed the two appetizers-- portobello mushroom on polenta that was simple but delicious, and the mussels in white beer sauce that was very mouth-watering flavourful!\n\nThey also have one section where only drinks are allowed (no food) with cozy sofa seats.\n\nDefinitely a hidden gem to come back and enjoy drinks (they have a great selection of Belgian beer), food and atmosphere!", "rating": 4, "date": "2008-05-10"}, {"excerpts": ["Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. "], "author": "David P.", "review": "First stop on trip to San Francisco. Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. The one disappointment and reason I gave 4 stars instead of 5 was the smoked trout endive cups, which just really fell short. Highly recommended overall.", "rating": 4, "date": "2011-12-17"}, {"excerpts": ["I had the Portobello Mushroom Burger with fries.  ", "Dee-li-cious!  ", "The bun was tender and the right proportion to the bello-shroom, cooked + seasoned just right.  "], "author": "Cathy K.", "review": "Thanks to Yelp, I gave this place a try - I would've otherwise walked right by since there wasn't a patron in sight on the main street level.\n\nThanks to Yelp, I ventured down the curved staircase and voila!  There were quite a few souls enjoying their beers and chowing down.\n\n19 beers on tap, and an abundance of bottled.  You can't go wrong.  \n\nI had the Portobello Mushroom Burger with fries.  Dee-li-cious!  The bun was tender and the right proportion to the bello-shroom, cooked + seasoned just right.  The fries were crisp and a good warm - not too hot to burn.\n\nAmbiance is calming, dim, and kinda medieval looking.  Good thing they don't serve giant turkey legs, which would've been over the top.", "rating": 5, "date": "2008-09-18"}, {"excerpts": ["The Portobello mushroom were OK.  ", "The steak was OK, beside one guest had asked for medium-well cooked and he got a medium-rare.  ", "Oh, did I say that the mossels were absolutely horrible..."], "author": "Pierre S.", "review": "A true Trappe that is a insult to Belgian food, but, I have to admit, has a great beer selection.  Go for the beers and NOT NOT NOT NOT NOT for the food.\n\nWe got there last night, a group of 5, including 3 Belgians.  Nice place looking a little like home, beside the paintings hanging on the wall that were out of place.  then we saw the beer menu and the menu.  It started well.  Got a great beer.\n\nBut then the food came in and that's when all fell apart. The soup and salad were just served than the second dish was thrown on the table at the same time!  It this an error?  Actually, that was the start. The mossels were the worst thing I ever tasted, and I am Belgian and have eaten it hundred of times.  The fries were just OK, but definitely not belgian cooked.  The rabbit was horrible. The Portobello mushroom were OK.  The steak was OK, beside one guest had asked for medium-well cooked and he got a medium-rare.  Oh, did I say that the mossels were absolutely horrible...yes, HORRIBLE.\n\nThen the bill came in.  They remove the cost of the steak that was not cooked properly.  Gor the bill for $85.  Then the waitress came back with another bill of $130, overcharging one of the beers by $2.  We did not complain and just wanted to get out that trappe, disgusted.\n\nBad service; very bad food; great beers.  So good as a bar, and a horrible mistake to try to cook anything.\n\nMy recommendation: if you want good mossels, go to Frjtz on Valencia St.  Don't waste any penny in this Trappe.", "rating": 1, "date": "2008-07-25"}, {"excerpts": ["the portobello mushroom burger w/pesto and goat cheese.  "], "author": "Michelle W.", "review": "this place veddy veddy dangerous for me.\n\nomg.  the beer selection.  duh.\n\nthe portobello mushroom burger w/pesto and goat cheese.  yummo.\n\nthe FRIES!!\n\njust be mindful that belgian brews are pricy.  i'm sure you know that already.  i had a peach lindemann's lambic and the burger for $25 plus tip (18% gratuity included for party of 6+).\n\noh, and eat in the basement.  it's so bohemian (like, actual bohemian, not mary-kate olsen bohemian), it reminded me a lot of dingy dives in prague (but more so budapest).  mucha posters in the bathroom, can i get a what what.", "rating": 4, "date": "2009-04-19"}], "moules pastis": [{"excerpts": ["I ordered the moules pastis (creamy baked mussels) with an Affligem blonde (Belgium ale) while my friend got the chicken videe (shredded organic chicken with cream in a puff pastry). \n\n"], "author": "Sofia R.", "review": "My friend and I were looking to grab something to eat before going out. We parked close to this place and decided to eat here because Belgian food was a mystery to the both of us and we were both curious.\n\nThe place looked empty when we walked in but we were lead downstairs to the more crowded pub area. Overall atmosphere was very cute in the old-fashioned pub way it looks. The menu was semi-interesting food-wise. Beer menu was HUGE (a whole ALBUM of different types of beers and descriptions). They had a cheese and wine menu too.\n\nOur server was nice but wasn't that good about checking up on us. Average. Granted, the place was a bit busy. Everyone who was working seemed to be rushing to get things done (whatever they were doing).\n\nI ordered the moules pastis (creamy baked mussels) with an Affligem blonde (Belgium ale) while my friend got the chicken videe (shredded organic chicken with cream in a puff pastry). \n\nThe mussels were delicious. I was very happy with my choice. The fennel sauce really added a nice depth of flavor to the entire dish. Without it, it would have been just okay. I wasn't particularly happy with the slice of bread they gave me since they placed it on my platter to make it look normal...but was burnt on the other side. \n\nThe beer was pretty good. It was exactly what I was expecting based on the description in the beer menu. My friend said her chicken was pretty good too. Nothing too special.\n\nOverall good place. I expect that this place is best for their beer rather than the food but I liked the food too. It might vary depending on what you order.", "rating": 4, "date": "2012-01-06"}, {"excerpts": ["I'd also love to come back to try the Moules Pastis appetizer because it sounds delicious: baked mussels in a fennel & Pastis sauce, yum!"], "author": "Stephanie S.", "review": "I met a friend for dinner here last Thursday night. She had recently broken her foot, so I waited for her upstairs. Downstairs seems to be where the party's at though - it was so loud you could hear everything upstairs, and it seemed really crowded. Service wasn't exactly prompt or attentive, and confusingly, we had at least three different servers. It seemed like we waited quite a while for one of the three to notice that we were definitively ready to order.\nThe only reason to come to a Belgian place aside from the beer is to try the classic Moules Frites. So we went for the traditional Mariniere preparation with white wine and shallots. A steaming cauldron of mussels & broth showed up. I asked for an additional bowl and got a perplexed look. We were *sharing* - was I supposed to lean over my friend's shoulder and pick out my mussels from the pot on her side of the table? The mussels that we were able to eat were delicious. Unfortunately, at least 6 or 7 of the mussels at the bottom of the pot were still closed, ergo inedible. The broth was a little watery as well, but had good flavor. The cone of frites was on the average side. It was a good-sized portion to share, but the fries were quite unevenly fried - some nice and crispy, others limp. The roasted garlic mayo and the spicy ketchup were both very tasty though.\nI'll reserve my highest praise for the beer selection. There is so much going on with this beer list! Their draft selection is extensive, and then there's an additional bottle list! It's organized by style and even includes a brief glossary of beer styles, which is very helpful. We had 4 beers in total, including the St. Feuillien Trippel, the Affligem Blond, the Ertvelds Wit, and the Ephemere Cassis. All except the Canadian Ephemere were Belgian, but they were all incredibly good and arrived in the appropriate glassware. The Ephemere was a great \"dessert\" beer - the cassis flavor wasn't overpowering at all, just subtly tart. I really want to come with a larger group so that we can explore the bottle list a bit more - they apparently have over 400 beers.\nIf this place stepped up the service, I'd definitely award another star. I'd also love to come back to try the Moules Pastis appetizer because it sounds delicious: baked mussels in a fennel & Pastis sauce, yum!", "rating": 3, "date": "2011-08-15"}], "pajottenland toast": [], "smoked trout endive cups": [{"excerpts": ["The one disappointment and reason I gave 4 stars instead of 5 was the smoked trout endive cups, which just really fell short. ", "Highly recommended overall."], "author": "David P.", "review": "First stop on trip to San Francisco. Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. The one disappointment and reason I gave 4 stars instead of 5 was the smoked trout endive cups, which just really fell short. Highly recommended overall.", "rating": 4, "date": "2011-12-17"}], "chicken videe": [{"excerpts": ["Chicken Videe ", "+", "+", "+:\nThe appearance was beautiful and the taste was rich and creamy. \n", "I love it a lot."], "author": "Hiromi S.", "review": "(Rating: +++ is perfect)\nAtmosphere+++:\nRustic\n\nService+++:\nFriendly, They know well about beer.\n\nValue++:\nA little bit expensive\n_________________\nFood\n\nMoules A La Biere +++:\nApparently, it was huge and the taste was wonderful.\nBeer and Moules make a good combination. \n\nBelgian fries +++:\nWe could choose some in many unique dips.\n\nChicken Videe +++:\nThe appearance was beautiful and the taste was rich and creamy. \nI love it a lot.", "rating": 4, "date": "2014-03-07"}, {"excerpts": ["I ordered the moules pastis (creamy baked mussels) with an Affligem blonde (Belgium ale) while my friend got the chicken videe (shredded organic chicken with cream in a puff pastry). \n\n"], "author": "Sofia R.", "review": "My friend and I were looking to grab something to eat before going out. We parked close to this place and decided to eat here because Belgian food was a mystery to the both of us and we were both curious.\n\nThe place looked empty when we walked in but we were lead downstairs to the more crowded pub area. Overall atmosphere was very cute in the old-fashioned pub way it looks. The menu was semi-interesting food-wise. Beer menu was HUGE (a whole ALBUM of different types of beers and descriptions). They had a cheese and wine menu too.\n\nOur server was nice but wasn't that good about checking up on us. Average. Granted, the place was a bit busy. Everyone who was working seemed to be rushing to get things done (whatever they were doing).\n\nI ordered the moules pastis (creamy baked mussels) with an Affligem blonde (Belgium ale) while my friend got the chicken videe (shredded organic chicken with cream in a puff pastry). \n\nThe mussels were delicious. I was very happy with my choice. The fennel sauce really added a nice depth of flavor to the entire dish. Without it, it would have been just okay. I wasn't particularly happy with the slice of bread they gave me since they placed it on my platter to make it look normal...but was burnt on the other side. \n\nThe beer was pretty good. It was exactly what I was expecting based on the description in the beer menu. My friend said her chicken was pretty good too. Nothing too special.\n\nOverall good place. I expect that this place is best for their beer rather than the food but I liked the food too. It might vary depending on what you order.", "rating": 4, "date": "2012-01-06"}, {"excerpts": ["I also had the Chicken Videe which was shredded chicken cooked in yummy cream sauce and baked in a flaky, puffed pastry. ", "I was afraid it would taste like chicken pot pie (which I do not enjoy), but to my surprise it was really great! ", "Not too salty and not too heavy (which summarizes how I feel about chicken pot pie). ", "The Chicken Videe is served over a bed of greens, which creates a really nice balance.\n\n"], "author": "Evonne L.", "review": "The beer here is legit. If you love crafty beers on draft, this place will be pure heaven. I had the Peche Mel and the Duchess here. Both were delicious. If you like strong fruit flavored beers, the peche mel is the way to go. Please stop and smell it before your first sip. Its fragrance is absolutely delightful and totally fruity without being overly powerful. The duchess is a sour beer that pretty much tastes like black cherry champagne. I'm HOOKED. A glass of the beers will cost you $8.50-$9.50 on average. There are more expensive bottled beers available if you want to go all out. As an amateur of craft beers however, I'm well satisfied with the $8-$9 selections.\n\nThe ambiance is warm, cozy, and underground. One star off for being sat next to a huge portrait of Edith Piaf's stuffed dead cat. Its face is literally grotesque. It looked like it was rotting and molting all at once. Not exactly the most appetizing view, which is a shame because the food is so very appetizing.\n\nFor example, take the Belgian fries. You can choose from a variety of  dipping to accompany them. From roasted garlic mayo to dijon mustard or spicy ketchup, these fries are sure to delight the palette. I also had the Chicken Videe which was shredded chicken cooked in yummy cream sauce and baked in a flaky, puffed pastry. I was afraid it would taste like chicken pot pie (which I do not enjoy), but to my surprise it was really great! Not too salty and not too heavy (which summarizes how I feel about chicken pot pie). The Chicken Videe is served over a bed of greens, which creates a really nice balance.\n\nI will definitely come back to this place to try more beers and eat more delicious food!", "rating": 5, "date": "2011-11-21"}, {"excerpts": ["The group had several orders of twice-cooked fries and beef sliders, and a few people tried the mussels, mac n cheese, and \"Chicken Videe,\" a kind of take on chicken pot pie. ", "There's a great selection of dipping sauces for the fries, and aside from a lack of salt (I suppose if we weren't in the lounge we could have used the table salt), they were pretty good. ", "Everyone seemed to enjoy the sliders, especially with the Chimay cheese, and the couple who got the mac n cheese raved about it. "], "author": "Kristen L.", "review": "I should come clean and start by saying that I went into La Trappe with a giant bias. My mom is from Belgium, I went there every few years growing up, and I was literally there three weeks ago, so I may have a big Belgian chip on my shoulder. I went into La Trappe expecting reasonable greatness, and I ended up finding good-ish food but horrendously overpriced beers. This was, in short, disappointing.\n\nAs many of the other reviewers have said, the beer selection at La Trappe is huge. You pretty much need the drink menu to sort through all your options, and there are pages and pages of options. My issue was with the prices of the selections. Okay, I know we're in San Francisco and drinks aren't cheap here (and yes, I was spoiled by the cheap Belgian beer in, you know, Belgium), but this was too much. The basest Belgian beer will put you out $7, and if you want anything you've (or I've) heard of, you're looking at spending A LOT more. I gravitated immediately towards the Lindeman's Kriek and Gueuze, family favorites, and was shocked to see that they were on the menu for $29. \"Maybe it's a giant bottle,\" I thought to myself. No siree, it's $29 for your run-of-the-mill 12 oz. bottle. And yes, I do realize that importing beer is expensive, but you can go down to Cost Plus World Market to buy Lindemans and you won't pay more than $9 for a big bottle. I resigned myself to a cheaper, less delicious beer and put our group's name on the list for a table.\n\nHere's where I had another issue with La Trappe. We were a group of eight, and I know that that can be very hard to accommodate, especially on a Saturday night in the city. When I arrived there were only two of us, so I was more than happy to wait at the bar with my cheap beer for a while until more people in our group arrived. Not too much later, we had six of our eight people and asked if we could be seated. Unfortunately, we were told that we couldn't be seated until our full group had arrived, and any other full groups that came in the meantime could take the table we had our eyes on. In principle, this seems like a pretty good system so you don't have groups taking up a table long before they're ready, but I know that when we came in, we were asked if we were a part of a partial group that was... already sitting at a table. I don't mind being told to wait, but not if I know the rules aren't being applied across the board.\n\nYou'll be shocked to hear that by the time our last two people showed up, our table had been taken not five minutes before. We were told we could wait in the lounge area, but we could only have appetizers there and not the regular entrees. Since we had a show to get to, we decided that appetizers would be the best option; there were a lot of choices and many were just smaller plates of the entrees anyways. The group had several orders of twice-cooked fries and beef sliders, and a few people tried the mussels, mac n cheese, and \"Chicken Videe,\" a kind of take on chicken pot pie. There's a great selection of dipping sauces for the fries, and aside from a lack of salt (I suppose if we weren't in the lounge we could have used the table salt), they were pretty good. Everyone seemed to enjoy the sliders, especially with the Chimay cheese, and the couple who got the mac n cheese raved about it. All-in-all, the food was enjoyable and reasonably priced for the amount we got.\n\nGood food aside, I still couldn't get over the drink prices and the inconsistent service we received from the host (I should say that the bartenders were very nice). Maybe you'll think my two-star rating is a little harsh, but I won't be bringing my Belgian mom here any time soon.", "rating": 2, "date": "2012-07-15"}], "mac n cheese": [{"excerpts": ["Mac n cheese was delish.  \n", "Oysters w/ the sauces were nom.  \n", "Mussels...", "I dun even know how to describe the awesomness. \n", "The salad with salmon n goat cheese was full of flavor...just enough dressing too. \n", "Oh!!~ the fries...the fries were just like any ordinary fry, but the have 11 different dipping sauces...since we couldn't decide we had 1 of each."], "author": "aja h.", "review": "I would like to give this place a 5 but since I have only been once...4 it gets. \n\nAfter a day of Macworld, I came here with a few close friends.  Luckily we got here right before the dinner rush so we were able to be seated with no problems. I would say if we got in about 30 min later...we would have had to wait to get seated\n\nThe beer menu is like 30+ pages long with at least 5 beers w/ description per page.  The food menu on the other hand is like a page front and back.  \n\nWe all tried to order something different... in short it was all yummeriffic!!~ \n\nMac n cheese was delish.  \nOysters w/ the sauces were nom.  \nMussels...I dun even know how to describe the awesomness. \nThe salad with salmon n goat cheese was full of flavor...just enough dressing too. \nOh!!~ the fries...the fries were just like any ordinary fry, but the have 11 different dipping sauces...since we couldn't decide we had 1 of each.", "rating": 4, "date": "2012-02-27"}, {"excerpts": ["We had everything from soup, to mussels, to mac n cheese, to burgers (portobello and 100% grass fed organic).  "], "author": "Jessica F.", "review": "My friends and I came here for my birthday dinner and we all loved it.  True to form all the girls showed up about an hour late, so the guys waited patiently drinking beers at the bar until we arrived.\n\nThe whole establishment is small and cozy.  Everyone that worked there was very friendly and when we finally showed up our waiter helped us pick out beers that would suit our likings.  We shared the french fry appetizers. Lots and lots of homemade sauces to chose from.  We had everything from soup, to mussels, to mac n cheese, to burgers (portobello and 100% grass fed organic).  Everything we ordered was delicious.  \n\nI just love this place. Love love love. Great place for an intimate dinner or just to grab some appetizers and drinks with friends after work.", "rating": 5, "date": "2012-03-23"}, {"excerpts": ["But the fries and mac n cheese is nothing to write home about. \n\n"], "author": "Carrie A.", "review": "+ Food is okay. I have to say it is true -  the mussels are great. But the fries and mac n cheese is nothing to write home about. \n\n- Service is lousy. \n\n+ Love the vibe and neighborhood. \n\n- WAY too expensive. Beer prices are ridiculous. \n\nI will most likely never return.", "rating": 2, "date": "2012-05-06"}, {"excerpts": ["The group had several orders of twice-cooked fries and beef sliders, and a few people tried the mussels, mac n cheese, and \"Chicken Videe,\" a kind of take on chicken pot pie. ", "There's a great selection of dipping sauces for the fries, and aside from a lack of salt (I suppose if we weren't in the lounge we could have used the table salt), they were pretty good. ", "Everyone seemed to enjoy the sliders, especially with the Chimay cheese, and the couple who got the mac n cheese raved about it. "], "author": "Kristen L.", "review": "I should come clean and start by saying that I went into La Trappe with a giant bias. My mom is from Belgium, I went there every few years growing up, and I was literally there three weeks ago, so I may have a big Belgian chip on my shoulder. I went into La Trappe expecting reasonable greatness, and I ended up finding good-ish food but horrendously overpriced beers. This was, in short, disappointing.\n\nAs many of the other reviewers have said, the beer selection at La Trappe is huge. You pretty much need the drink menu to sort through all your options, and there are pages and pages of options. My issue was with the prices of the selections. Okay, I know we're in San Francisco and drinks aren't cheap here (and yes, I was spoiled by the cheap Belgian beer in, you know, Belgium), but this was too much. The basest Belgian beer will put you out $7, and if you want anything you've (or I've) heard of, you're looking at spending A LOT more. I gravitated immediately towards the Lindeman's Kriek and Gueuze, family favorites, and was shocked to see that they were on the menu for $29. \"Maybe it's a giant bottle,\" I thought to myself. No siree, it's $29 for your run-of-the-mill 12 oz. bottle. And yes, I do realize that importing beer is expensive, but you can go down to Cost Plus World Market to buy Lindemans and you won't pay more than $9 for a big bottle. I resigned myself to a cheaper, less delicious beer and put our group's name on the list for a table.\n\nHere's where I had another issue with La Trappe. We were a group of eight, and I know that that can be very hard to accommodate, especially on a Saturday night in the city. When I arrived there were only two of us, so I was more than happy to wait at the bar with my cheap beer for a while until more people in our group arrived. Not too much later, we had six of our eight people and asked if we could be seated. Unfortunately, we were told that we couldn't be seated until our full group had arrived, and any other full groups that came in the meantime could take the table we had our eyes on. In principle, this seems like a pretty good system so you don't have groups taking up a table long before they're ready, but I know that when we came in, we were asked if we were a part of a partial group that was... already sitting at a table. I don't mind being told to wait, but not if I know the rules aren't being applied across the board.\n\nYou'll be shocked to hear that by the time our last two people showed up, our table had been taken not five minutes before. We were told we could wait in the lounge area, but we could only have appetizers there and not the regular entrees. Since we had a show to get to, we decided that appetizers would be the best option; there were a lot of choices and many were just smaller plates of the entrees anyways. The group had several orders of twice-cooked fries and beef sliders, and a few people tried the mussels, mac n cheese, and \"Chicken Videe,\" a kind of take on chicken pot pie. There's a great selection of dipping sauces for the fries, and aside from a lack of salt (I suppose if we weren't in the lounge we could have used the table salt), they were pretty good. Everyone seemed to enjoy the sliders, especially with the Chimay cheese, and the couple who got the mac n cheese raved about it. All-in-all, the food was enjoyable and reasonably priced for the amount we got.\n\nGood food aside, I still couldn't get over the drink prices and the inconsistent service we received from the host (I should say that the bartenders were very nice). Maybe you'll think my two-star rating is a little harsh, but I won't be bringing my Belgian mom here any time soon.", "rating": 2, "date": "2012-07-15"}, {"excerpts": ["had the mac n cheese and the veggie raviolis which they had infused with CINNAMON!!! ", "wozers 2 must haves... only docking one star bc ", "it took the server super long to get to us ", "but they seemed a bit short staffed and busy =)"], "author": "Darlene T.", "review": "Holy moly this place was good! had the mac n cheese and the veggie raviolis which they had infused with CINNAMON!!! wozers 2 must haves... only docking one star bc it took the server super long to get to us but they seemed a bit short staffed and busy =)", "rating": 4, "date": "2012-02-23"}], "grilled sardines": [{"excerpts": [":) \nGrilled sardines were surprisingly great. ", "We had to wait to be seated, it was a busy evening for them. ", "However, they have benches inside of the restaurant ", "and we ordered beer during our wait, so ", "it wasn't a big deal. ", "(vs restaurants where you wait outside)"], "author": "Galina F.", "review": "Awesome selection of beers and great food. :) \nGrilled sardines were surprisingly great. We had to wait to be seated, it was a busy evening for them. However, they have benches inside of the restaurant and we ordered beer during our wait, so it wasn't a big deal. (vs restaurants where you wait outside)", "rating": 5, "date": "2012-06-01"}], "moules a la biere": [{"excerpts": ["Rabbit stew, Moules a la Biere, and a very decent NY Strip.  ", "Well beyond acceptable. "], "author": "David D.", "review": "Expensive yet not overpriced.  The hours great for a restaurant, but not phenomenal for a bar, so check this out: \n\n1. Hands down the best beer selection in the bay. Toronado and Church Key are the only other places of its class (although they are not full restaurants) \n\n2. Underground. Enough said. \n\n3. Excellent food. Rabbit stew, Moules a la Biere, and a very decent NY Strip.  Well beyond acceptable. I'd be happy with just their incredible drink selection. \n\n4. Staff: Completely knowledgeable, reasonably speedy, professional and friendly. \n\n\nA total hidden gem.", "rating": 5, "date": "2010-07-18"}, {"excerpts": ["The beer can be practically a meal in itself, so it may be a while before I even make an attempt at the Moules a la Biere and Frites."], "author": "Bryan T.", "review": "I really wish I lived close to La Trappe.  Then again, if I did I would probably convert 1/2 of my income into beer and subsequently a lot of calories leading to a ginormous beer belly.  I guess that's not a bad thing since I like beer, but I like to keep \"fit\".\n\nWe almost always hit this place on a GNO (Guys Night Out) or a Bachelor Party pub crawl.  It's quite perfect for that type of event.\n\nThe selection of Belgian beers here is superb and is rivaled only by a few establishments in the bay area.  Definitely some exotics served here, including even the occasional Flemish Sour, which is my favorite varietal of beer - for those unaware, it's an acquired taste.\n\nWhat really turns me on to La Trappe is the ambiance.  It's dark, mysterious and cave-like.  It reminds me of some of the deep basement brick-walled bars I've been to in Munich.  You walk down a dark staircase that leads you to a room with a bar and tables where jolly people laugh and chat with one another.  It makes you feel special.  Like you're in a secret place that nobody knows about.  That gives it an elevated status as far as I'm concerned.  It can make you feel cool when you definitely are not!  \n\nThere is a restaurant up top, but I've never sampled any of the food here.  I just head straight for the underground.  Hey, a man has to have his priorities, right?  The beer can be practically a meal in itself, so it may be a while before I even make an attempt at the Moules a la Biere and Frites.", "rating": 4, "date": "2010-05-11"}, {"excerpts": ["Its got a certifiably Disneyland-sized selection of beers, an exciting/sweet take on Moules a la Biere, and their Boudin Blanc will make you wonder why you never ate more tubed meats in white sauce.  ", "Do yourself a favor and stop by; you'll need to fuel up before taking on the Defense Against the Dark Arts teacher ", "(Who eats at Sizzler, BTW)."], "author": "Michael D.", "review": "La Trappe has some Harry Potter magic going on, from its secluded downstairs pub atmosphere to its innovative take on the gastropub label.  Its got a certifiably Disneyland-sized selection of beers, an exciting/sweet take on Moules a la Biere, and their Boudin Blanc will make you wonder why you never ate more tubed meats in white sauce.  Do yourself a favor and stop by; you'll need to fuel up before taking on the Defense Against the Dark Arts teacher (Who eats at Sizzler, BTW).", "rating": 4, "date": "2011-12-24"}, {"excerpts": ["Moules a la Biere was good.  ", "Steak, eh.  ", "Gnocchi, YUCK!  ", "Undercooked pieces of raw dough.  ", "We first thought, maybe there was some type of cheesy filling.  ", "For the appetizer, we ordered the moules a la biere and the artisanal cheese plate.  ", "Both were huge servings and extremely tasty.  ", "When we received our beer, we were surprised that the specialty glasses were full.  "], "author": "Jory R.", "review": "Update:\n\nCame here last weekend.  \n\nBeer - still good\n\nService - not so good.  Sat there with menu's and some empty glasses for about 15 minutes.  Finally, we flagged a waitress and said we were ready.  She was like, oh, no one has waited on you.  Takes forever to get a beer. \n \nFood - Burger was good.  Fries were good.  Moules a la Biere was good.  Steak, eh.  Gnocchi, YUCK!  Undercooked pieces of raw dough.  We first thought, maybe there was some type of cheesy filling.  But not really.  \n\nOverall, it seems like many of the employees are in constant motion, but not getting too much accomplished.  The bussers are very efficient, though.\n\n************************\n\nMy husband made reservations for us on Valentine's Day.  I greatly dislike going out on Valentine's Day, as you're usually surrounded by starry-eyed couples who make me want to throw-up.  We're not old, but the last time we dined out on Valentine's Day was in 2000, when we just started started dating.  So, I was very apprehensive about going out.  \n\nMy husband chose this place, as I LOVE french fries and Belgian beer.  Unfortunately, even through he called in the reservation on Monday, no one mentioned to him that the regular menu would not be available.  Luckily, we found this out on Wednesday when I went to peruse the menu and saw only the set-price four course dinner was the only option available for $60/person.  So, we were not taken-aback when we were seated on Thursday (as some other couples obviously were).\n\nWhen the hostess gave us the menus, she said for $20 more, one could get the suggested beer pairings with each course.   My husband said, so like, 4-6 ounce tastings, and she confirmed yes.  \n\nFor the appetizer, we ordered the moules a la biere and the artisanal cheese plate.  Both were huge servings and extremely tasty.  When we received our beer, we were surprised that the specialty glasses were full.  Having not quite finished the complementary glass of prosecco and realizing that we'd be getting four beers each, I said this is going to be a long night.  \n\nLong story short, the experience at La Trappe was wonderful.  Great beer: an extensive list of Belgian and Belgian style beers from around the world (though they are missing the Corsendonk Brown); and great food: huge servings, excellent flavors (we had, in addition to the above-mentioned appetizers, Cream of Ginger Carrot Soup, Harvest Salad with Roquefort toast, the filet with potatoes au gratin and green beans, Ricotta and Spinach Ravioloni, and for dessert, the Chocolate Ganache and Creme Brulee).  \n\nThe service in my opinion was good.   Perhaps it was because we were experiencing a differently paced meal.  But our server was friendly and the busser always kept our water glasses full and cleared our plates.  \n\nThe atmosphere was nice.  It seemed a little off the beaten path of North Beach establishments, so it looked pretty free of touristy type people.  All the tap handles for the different Belgians certainly doesn't detract :-)\n\nWe will definitely be returning.  Hopefully so I can sample some of the frites.  But the extensive list of Belgian beers is enough to draw us back.", "rating": 4, "date": "2008-02-17"}], "organic beef sliders": [], "smoked salmon arugula": [{"excerpts": ["The smoked salmon arugula was great too-  ", "served with a lemon vinaigrette, cherry tomatoes red onions and goat cheese. ", "We also dipped our frites with the sauces they recommended.  ", "Garlic mayo and spicy ketchup were good ", "(We killed the garlic mayo first.  ", "Duh)  ", "I wanted to bring the mussels home, but for some odd reason, La Trappe doesn't allow guests to take home food?  ", "Their excuse is because mussels go  bad.  ", "Listen, I eat Chinese seafood all damn day, and I take that shiz home too.  "], "author": "Cat A.", "review": "....North Beach.  I would imagine that we would eat at an Italian place, but he had other plans...\n\nThe downstairs was PACKED.  I mean packed. The bar top was filled and the booths and tables were filled with beer drinkers.  We somehow got the attention of a busser who put us on the wait list and also recommended beers for us.  We couldn't pronounce it for the life of us so he wrote them down for us to show the bartender.  Bartender wasn't too friendly, but I suspect it's because his bar was crowded and getting a bit out of control.  We got our drinks and sipped them and people-watched while we waited for a table to open up.  No more than 10 minutes is what it felt like when the Asian busser came to us and asked us if we wanted to sit upstairs.  \n\nHELL YEAH!\n\nWe sat upstairs literally, next to the door, so cold air came around us everytime the door opened.  Pretty wack, BUT we wanted to sit and it's not their fault it's cold, right?  Later on through the meal, the table next to us left and our kind server let us scoot over so we weren't' next to the door.  \n\nWe ordered a few small plates.  the mussels and frites with the garlic white-wine, sardines and a smoked salmon salad. \n\nThe mussels were the highlight of our dinner.  We just kept dipping our bread and fries into that gorgeous broth.  The mussels were ridiculously good-  and it didn't cost an arm and leg.  The sardines were on point too, grilled, served with lemon, fennel and a duo of herb sauces.  The smoked salmon arugula was great too-  served with a lemon vinaigrette, cherry tomatoes red onions and goat cheese. We also dipped our frites with the sauces they recommended.  Garlic mayo and spicy ketchup were good (We killed the garlic mayo first.  Duh)  I wanted to bring the mussels home, but for some odd reason, La Trappe doesn't allow guests to take home food?  Their excuse is because mussels go  bad.  Listen, I eat Chinese seafood all damn day, and I take that shiz home too.  It ain't bad, It's wasting!\n\nI think the best part of our meal, aside from the mussels, was the service.  Not the bartender, really but more so our server and busser.  Our server was gracious, on-point and always around to help us.  The dining room was small and he somehow managed to practically dance the ballet weaving in and out of the limited space he had to drop off food.  I always appreciate good service, as I once did a heavy amount of time at the restaurant.  \n\nHe told us he had to work St Patty's day, so we hooked him up extra, cause nothing's worse than working on a night where you should be enjoying beer and festivities, NOT serving obnoxious, singing drunkards.  We'll be back!", "rating": 4, "date": "2012-03-29"}, {"excerpts": ["Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. "], "author": "David P.", "review": "First stop on trip to San Francisco. Everything was great, including great Belgian beers, and I highly recommend the portobello mushroom, twice cooked fries, and smoked salmon arugula salad. The one disappointment and reason I gave 4 stars instead of 5 was the smoked trout endive cups, which just really fell short. Highly recommended overall.", "rating": 4, "date": "2011-12-17"}], "nicoise": [{"excerpts": ["Their Nicoise salad was the best I've ever had with perfectly seared rare tuna, delicious veggies and a glorious presentation.\n\n"], "author": "Lilah L.", "review": "This place is amazing!\n\nI had eaten moules frites a ton of times, but had never had the pleasure of experiencing a full Belgian menu before visiting La Trappe. \n\nTheir Nicoise salad was the best I've ever had with perfectly seared rare tuna, delicious veggies and a glorious presentation.\n\nI ate here with a few friends, and though we were all sober, we left feeling euphoric from the great food and magical time we had eating here.\n\nCan't for the life of me remember what the traditional Belgian dish we had was called, but it was fricken amazing! I think we just asked our waiter what his favorite was, and ordered it.\n\nEasily my best restaurant find of the year. If you like French, and you enjoy inventive cuisine, you will absolutely love this place!", "rating": 5, "date": "2016-06-25"}, {"excerpts": ["The asparagus was delightful, my nicoise salad was quite perfect, lush and well-portioned...especially for a spot known more for schnitzel and frites. ", "Oh, and I may have snuck a few frites with aioli for good measure, what would a beer be without them? ", "Full of carbs. ", "Well, stick a fork in me..."], "author": "Colleen C.", "review": "La Trappe caught me on a downward spiral...\n\nOn the tail end of a hellaciously fast-paced week, eyeing a red-eye flight to Detroit (of all places), already jet lagged and feigning time zone stability...I had one last meal to enjoy in beautiful San Francisco. \n\nAnd by a stroke of fate and a drop of excellent beer...La Trappe was the destination, by no fault or choice of my own. Chalk it up to swell colleagues originating from 3 different countries. International flava' dinner, indeed. Not too crowded despite the hour on a Friday evening, and even kind enough to stow my suitcase while I imbibed. \n\nAs many reviews have already stated...downstairs is where its at. Something with the lighting and the formica in the upstairs lends itself to a bit more \"geriatric\" and a bit less \"beer sexy.\" The lower level is dimly lit, heartily furnished, buzzing at a key level and feels a bit more...well, underground. \n\nAn Affligem Blond met me at my table...and was quickly followed by an organic heirloom cider. Both prepped me ostensibly for the fuckofaflight I was about to embark on. Kudos, fine Belgian brewers and organic cider makers. I'd reorder either of these beverages in a quick second. \n\nAs for the food? Well, not a miss in the bunch. The asparagus was delightful, my nicoise salad was quite perfect, lush and well-portioned...especially for a spot known more for schnitzel and frites. Oh, and I may have snuck a few frites with aioli for good measure, what would a beer be without them? Full of carbs. Well, stick a fork in me...I'm done.\n\nThe service was impeccable, and though it began to hop as the drinking hour approached...never did we feel rushed out of our cozy, comfy booth for 4. Not a once...so as I retrieved my suitcase to head to SFO, I swigged the last drops, bid La Trappe farewell, and thanked it for a string of legitimately enjoyable moments filled with coworkers-cum-comrades, Belgian ale and the kind of smiles only born by way of genuine surprise and elation. And bad date stories.", "rating": 5, "date": "2010-09-07"}, {"excerpts": ["The salade nicoise was pretty good - love that they actually do put in anchovies. ", "Although it was so dark I ended up eating a whole one at once. "], "author": "Monica C.", "review": "Vegetarians, beware. You pretty much will have to concoct your dinner out of a mixture of side dishes.\n\nIf you're a meat lover, this place is aight. Nothing particularly spectacular. But decent food and a great beer selection. The salade nicoise was pretty good - love that they actually do put in anchovies. Although it was so dark I ended up eating a whole one at once. Luckily, I had a delicious belgian to wash down all the salty goodness.\n\nThere's often a huuuuuge wait for big parties. I think we waited over an hour and a half. At least they kept us hydrated with tasty beers while we waited.", "rating": 3, "date": "2011-03-04"}, {"excerpts": ["The greens and tuna in the Nicoise salad were very nice. "], "author": "Martha M.", "review": "Very cozy atmosphere in the main room downstairs, with a nice bar, sloping brick walls, warm lighting, and comfortable tables nestled into interesting nooks and crannies.\n\nExtensive and interesting beer selection, each variety served in its own special glass.  Equally interesting wine selection; I tried the Albarino which was very good.\n\nThe food was good not great.  In our party , we enjoyed the fig salad, the fries, the steak, and the Boudin Blanc Sausage.\n\nThe greens and tuna in the Nicoise salad were very nice. Unfortunately the anchovies were overly fishy and this flavor polluted the potatoes and eggs.\n\nService was mostly decent, although I wish the waitress hadn't left my second glass of wine sitting at the bar for so long, finally bringing it to the table after I had finished my meal.", "rating": 3, "date": "2010-09-19"}], "small two cheese": [], "large four cheese": [], " grass fed organic hamburger": [], "stewed rabbit": [{"excerpts": ["We ordered mussels, the steak and fries and the stewed rabbit. ", "The mussels were perfectly cooked, the broth was amazing and I can't stop thinking about the steak! ", "But my favorite part would have to be the fries - perfectly crispy on the outside and soft on the inside. ", "You get to pick a couple sauces out of a wide selection and my favorite was the garlic mayo (you can never go wrong!). ", "Pro tip: The sauce from the rabbit is also an awesome dipping sauce for the fries! ", "They also have a wide selection of beers and are very nice about supplying small tastings before you make your final choice. "], "author": "Christina L.", "review": "When our group of three walked into La Trappe on a Friday evening we were a little bit concerned - where were all the people?? In an overcrowded city like San Francisco it's always a good rule of thumb to \"follow the crowds\" to good food but in this case I guess La Trappe is still an undiscovered gem!!\n\nWe ordered mussels, the steak and fries and the stewed rabbit. The mussels were perfectly cooked, the broth was amazing and I can't stop thinking about the steak! But my favorite part would have to be the fries - perfectly crispy on the outside and soft on the inside. You get to pick a couple sauces out of a wide selection and my favorite was the garlic mayo (you can never go wrong!). Pro tip: The sauce from the rabbit is also an awesome dipping sauce for the fries! They also have a wide selection of beers and are very nice about supplying small tastings before you make your final choice. We ended up with Vapeur En Folie, a Belgian pale ale, and were very happy with it! \n\nWill be back!!", "rating": 5, "date": "2016-06-06"}, {"excerpts": ["I mean stewed rabbit ", ":P ", "& it wasn't too bad "], "author": "Jenny Q.", "review": "Neat spot with an overwhelming but excellent beer selection, & chill atmosphere.\n\nWe came at about 8pm and had to wait about 20 minutes for a table so we grabbed some beers. The Bink blond, Ichtegems Grand Cru, & Duvel Strong Pale Ale were all pretty good.\n\nThe food, however, is pretty mediocre. \nSteak frites were the highest priced entree on the menu yet the steak was pretty chewy and flavorless. I got the scallops 3 ways which wasn't anything special. \nI tried my sister's little bunny Foo Foo..I mean stewed rabbit :P & it wasn't too bad but she seemed to really enjoy it.\n\nNext time I return, I'll pass on the food & go straight to the beers. They make me pretty full anyway :)", "rating": 4, "date": "2014-02-04"}, {"excerpts": ["We ordered the toast, twice fried fries, beet salad, stewed rabbit, asparagus and had the small cheese plate and belgian waffle for dessert.  ", "Everything was great except for the toast.  ", "I found it flavorless...", "but everything else was really scrumptious.  ", "I would eat here again and try the other things on their menu."], "author": "Elena F.", "review": "First time here last night.  Friends and I were having dinner before the show at Bimbos.  Service was really good and I loved that they give you a menu \"book\" for their beers along with their food menu.  We ordered the toast, twice fried fries, beet salad, stewed rabbit, asparagus and had the small cheese plate and belgian waffle for dessert.  Everything was great except for the toast.  I found it flavorless...but everything else was really scrumptious.  I would eat here again and try the other things on their menu.", "rating": 5, "date": "2010-04-04"}], "grilled organic pork chop": [], "chicken gentse waterzooi": [{"excerpts": ["Dan M. ordered the Chicken Gentse Waterzooi and it was super delicious...", "it was also filling, he had to order a togo bag cause he was stuffed. "], "author": "Pauline L.", "review": "My group was hankering some Belgian food love and not necessarily the multitude of beers laid out at the bar.  We had to split up our party cause we were that big...my early group ordered 4 orders of twice cooked fries with the entire range of dipping sauces...awesome fries that we cried how crispy it was and the soft center is super hot, so watch out for the roof of your mouths. \n\nI ordered the mariniere style mussels and belgian fries. When they placed my seafood pot...I felt like I was brought to my feed bag..it was quite big and the mussels were super tasty. I love love the belgian fries.  My other friends ordered the rabbit stew (haha..she ate Thumper)....Dan M. ordered the Chicken Gentse Waterzooi and it was super delicious...it was also filling, he had to order a togo bag cause he was stuffed. All my other friends weren't as adventurous and chose the standard hamburgers and fries which they claimed was excellent.\n\nIf you make reservations here to eat, you need to have your entire party here or they won't seat you.  Also check on the board for their specials, they have the desserts listed there as well.", "rating": 5, "date": "2010-10-19"}, {"excerpts": ["Had the chicken gentse waterzooi for the entree.  ", "Love the name.  ", "Described as a cross between stew and soup.  ", "Very on par description.  ", "Getting a little bit tipsy at this point.  ", "My waterzoooooiii tasted great with my corked beer (with delicious grains and hops) with high abv %.  ", "Grabbed the voluminous beer menu.  ", "Ordered another."], "author": "Mitchell L.", "review": "Had dinner and drinks at La Trappe with one of my buds on a Saturday night.  The beer menu is voluminous.  And I never use the word voluminous.  Asked the bartender for a suggestion.  He gave me a \"really??\" look.  I'm telling you - voluminous.  The place was full.  The crowd was young.  Hit up the bar to wait for a table.    \n\nNever had beer in a corked wine bottle.  Felt cultured.  Talking about hops and grains.  Wait - don't really know what that means.  High alcohol volume percentage?  I know what that means...yeaaaa...\n\nThe waitress is pleasant, service is pretty good.  Ordered the fries with spicy ketchup (great).  Very well cooked fries - almost McD quality.  Had the chicken gentse waterzooi for the entree.  Love the name.  Described as a cross between stew and soup.  Very on par description.  Getting a little bit tipsy at this point.  My waterzoooooiii tasted great with my corked beer (with delicious grains and hops) with high abv %.  Grabbed the voluminous beer menu.  Ordered another.", "rating": 4, "date": "2010-11-25"}], "boudin blanc": [{"excerpts": ["My two favorite items on the menu are the Boudin Blanc (white sausage with a creamy mustard sauce) and the Ghentse Chicken Waterzooi (chicken stew). "], "author": "Regina L.", "review": "The vibe and ambiance of La Trappe have changed a lot since my first time there in 2012. Sometimes it's a hit, and sometimes it's a total miss. Given how many different experiences we've had here, it's a bit hard to write this review so I'll break it down the best that I can.\n\n*Ambiance: the restaurant itself is pretty unassuming. When you walk by, the top dining area is usually empty, but if you head downstairs, you find yourself in a grotto-like space where the Belgian beer flows and people get rowdy. At some point a few years ago, they started playing house/techno music downstairs and we stopped going. The vibe is definitely less party-party now, but it hasn't really regained the charm that it had back in the day (or maybe my mind is playing tricks on me - I guess we'll never know). \n\n*Beer: they have a very extensive beer list that comes in the form of a book that is reminiscent of Harry Potter. The beers are categorized really well, and the server is usually really helpful when it comes to choosing what to drink. If you are a beer aficionado or have a very international palette, I highly recommend you come here for a drink. \n\n*Food: the food here is pretty damn good. Their main dishes are mussel or french fry based (try both if you can). The mussels and fries come in/with an array of sauces or dipping sauces respectively, and they also have a variety of traditional Belgian dishes. My two favorite items on the menu are the Boudin Blanc (white sausage with a creamy mustard sauce) and the Ghentse Chicken Waterzooi (chicken stew). It's a hearty, filling meal no matter what you order. \n\n*Service: four out of five times, the service is pretty bad. The downstairs area goes from empty to packed really quickly, and they never seem to have enough staff to handle the influx of customers. We've had forgotten orders and item mix-ups more than a few times, and the wait time for your order can be anywhere from 15 to 40 minutes. The servers usually seem frazzled and more often than not, dirty dishes and empty water glasses litter your table until you ask a passing staff member to clear and/or refill. \n\nLa Trappe has become a place that I wouldn't necessarily recommend to people, but would certainly end up at for a casual Friday evening meal. I would love to see this place get a dose of TLC from management in terms of getting consistent service and a warmer ambiance.", "rating": 3, "date": "2016-09-26"}, {"excerpts": ["Then we shared the Boudin Blanc (3 white sausages in a mustard sauce with scalloped potatoes). ", "The BB was a lot lighter than I expected.  ", "It was so good--my companion was like, \"Please, make me stop eating this.", "\" ", "So I took my plate and put it on top of the BB, and was about to signal our server to remove the plates when my friend removed my plate and continued eating. ", "Well then! "], "author": "Sunny S.", "review": "Just. Wow. \n\nI came by with a close friend on a Friday night, after a full day of marathon boot shopping (for her). \n\nAt 7:00 p.m. on a Friday evening, we were able to be sat immediately. *Cartwheels!  In fact, one of the things I liked the most about LT was that it was not uncomfortably crowded. We were able to enjoy our evening in peace, relatively speaking. \n\nWe sat downstairs, which definitely embraces an old school pub atmosphere. If I could picture what the inside of the shire looks like, this would be it. It's warm, dark, old and wooden. Nothing fancy. \n\nThe beer menu is frakking epic. I normally fear no beer, and certainly no beer menu, to be sure, but I must admit that with 400 imported beers and a beer menu exceeding 35 pages, I was a little flummoxed. But fear not, friends, your server knows what SHE'S doing (*throws another wrench into assumption that beer drinking is a man's sport). If you tell her what you normally like, she can walk you through it and make recommendations based on your tastes.\n\nWe started with a traditional lambic, moved on to a red, and finished with a very sweet lambic. We shared bottled import beers, which I strongly recommend because you can try more that way (and you drink less as well). With such an enormous beer list, you're going to want to try a few and figure out what you like (and don't like). Don't forget, practically everything is imported, so even the most seasoned American beer drinker might run into questions. Again, the staff knows what they're doing, so please ask. \n\nFood wise, we started with the ratatouille, which I was only lukewarm about ordering--but it turned out to be delicious!  It was flavorful, fresh and healthy. Then we shared the Boudin Blanc (3 white sausages in a mustard sauce with scalloped potatoes). The BB was a lot lighter than I expected.  It was so good--my companion was like, \"Please, make me stop eating this.\" So I took my plate and put it on top of the BB, and was about to signal our server to remove the plates when my friend removed my plate and continued eating. Well then! It was that good. \n\nWe were physically unable to do dessert. So full. \n\nFor three bottled import beers, ratatouille and BB, it was about $70, which isn't too bad for dinner in SF. Overall, what a great experience, from start to finish.  \n\nProst!", "rating": 5, "date": "2014-01-20"}, {"excerpts": ["We had the Boudin Blanc (amazing) and Fried Brussel Sprouts with Bearnaise sauce ( to die for). ", "My husband hates Brussel Sprouts and he loved them.\n", "The prices are great too, we had dinner for $20 per person and the portions were so big we should have split one meal. ", "Don't miss this place when in town."], "author": "Sherri E.", "review": "This place is a hidden gem!!!!!! Love the food and the ambiance! Do not be fooled if you look in the window, the restaurant is downstairs with old world romantic ambiance. Great date restaurant! \nWe had the Boudin Blanc (amazing) and Fried Brussel Sprouts with Bearnaise sauce ( to die for). My husband hates Brussel Sprouts and he loved them.\nThe prices are great too, we had dinner for $20 per person and the portions were so big we should have split one meal. Don't miss this place when in town.", "rating": 5, "date": "2014-08-28"}, {"excerpts": ["It's rare to find a bar that does steak and fries the right way, and the Boudin Blanc is done to equal perfection. ", "Don't pass up this bar, it's one of a kind."], "author": "Brett D.", "review": "I've been to my share of Belgian beer bars in Los Angeles, and this one blows them all away. The key here is not so much the selection, which is still very good, but the food. It's rare to find a bar that does steak and fries the right way, and the Boudin Blanc is done to equal perfection. Don't pass up this bar, it's one of a kind.", "rating": 5, "date": "2016-01-08"}, {"excerpts": ["The boudin blanc is also amazing. ", "If you don't know what it is, look it up, because it's so suggestive sounding that I really shouldn't describe it in a review..."], "author": "Angeline P.", "review": "Oh god, I have a serious problem with this place. I love Belgian food. I love Belgian beer. I have acid reflux. This is not a great combination.\n\nFor a while, I was taking people here every two weeks. Someone would visit, and I would insist that they come to La Trappe. It's actually one of my favorite bars in San Francisco. I came here during SF Beer week and sampled cheeses with beer pairings (oh man, I feel so refined). If you are intimidated by their album of a menu, stick to the first page. Their draft beers have never steered me wrong (Except for that one time a friend of mine ordered a beer that was very reminiscent of soy sauce. But 1/25 beers I've tasted here is not a terrible ratio). \n\nThe food here is also delicious, but avoid the burgers because I feel they're not up to the same standard as the rest of their food. Mussels + fries are delicious. The fries come with two dipping sauces, so choose wisely! I like wasabi mayo and curry ketchup, but to be honest, I haven't tried every sauce yet. The boudin blanc is also amazing. If you don't know what it is, look it up, because it's so suggestive sounding that I really shouldn't describe it in a review...Their fish is also pretty good.\n\nBasically, it's difficult to go wrong here. Give it a shot! You'll probably be hooked :)", "rating": 5, "date": "2011-04-05"}, {"excerpts": ["The Boudin Blanc. ", "Dear god. ", "There are no words. "], "author": "Amanda M.", "review": "My husband and I went to La Trappe last night and it gets 5 stars for a few reasons.\n\n1. My husband has been to all the 7 Trappist monasteries. He did a beer trip to Belgium two years ago. He is a bit of a fanatic when it comes to beer...so if I can take him to a place where he can order some of his favorite beers (some on tap) and they come in the beers own special glass-five stars for making him smile. \n\n2. Service. We arrived at 6pm on a Friday night and went straight downstairs. We picked a small table for the two of us. Our server, at tall beautiful gal, explained a couple of changes on the menu to us. She was very attentive and kind. Towards the end of our meal the place was packed and I was worried that the service was going to go south but I started to realize that other people were helping her. Moving plates on and off the table, refilling waters etc. All the staff worked as a team to keep everyone happy and that really impressed me-5 stars.\n\n3. Food...We had a cheese plate. 2 cheeses were $12 dollars. Typically when we order cheese you get such a small amount. NOT HERE. Holy Queso my friends! There was so much cheese as well as grapes, honey, dates, olives, gherkins and this delicious dark nutty bread. My husband had the lasagna which was moist and very tasty. It wasn't an Italian lasagna but was very flavorful and a welcome surprise. I order The Boudin Blanc. Dear god. There are no words. The sausage was amazing, the gratin was cheesy and flavorful...bring it all together with the sauce and it's like an orgasm in your mouth! 5 stars!\n\n4. They have Duchesse Du Bourgogne on tap. This alone gets the place 5 stars. Not many people are into Flemish Sour Ales but I am. I didn't see anyone else order one that night. I have a feeling that if all those women that ordered wine would have been a little adventurous they could have enjoyed something so amazing and not a glass of wine made 20 miles away. This is a BEER place people. Not a wine bar...suck it up and try something new!", "rating": 5, "date": "2010-12-04"}, {"excerpts": ["In our party , we enjoyed the fig salad, the fries, the steak, and the Boudin Blanc Sausage.\n\n"], "author": "Martha M.", "review": "Very cozy atmosphere in the main room downstairs, with a nice bar, sloping brick walls, warm lighting, and comfortable tables nestled into interesting nooks and crannies.\n\nExtensive and interesting beer selection, each variety served in its own special glass.  Equally interesting wine selection; I tried the Albarino which was very good.\n\nThe food was good not great.  In our party , we enjoyed the fig salad, the fries, the steak, and the Boudin Blanc Sausage.\n\nThe greens and tuna in the Nicoise salad were very nice. Unfortunately the anchovies were overly fishy and this flavor polluted the potatoes and eggs.\n\nService was mostly decent, although I wish the waitress hadn't left my second glass of wine sitting at the bar for so long, finally bringing it to the table after I had finished my meal.", "rating": 3, "date": "2010-09-19"}, {"excerpts": ["I've also had the boudin blanc sausage, which was served in a tasty mustard sauce over a potato leek gratin. "], "author": "Britt M.", "review": "I think you can experience La Trappe two different ways, depending on when you want to go. Either way you're going to have excellent beers, hearty food, and great ambiance; it's simply a question of how long you want to wait for it.\n\nYou can eat upstairs, but I recommend the basement, with its rustic brick walls, dim lighting, and bar crowd that provides an ideal locale for good company and beer. On a weeknight the sound level is perfect for conversations while still feeling decently full. On weekends, I recently waited an hour for a table (no reservations accepted) and it was uncomfortably crowded and more suitable for drinking than dinner. \n\nNonetheless, the meal was superbly satisfying once it arrived. In true Belgian form, they specialize in moules frites (mussels and french fries) which are served up in many different forms - classic mariniere (beer sauce), provencal, spicy tomato, and an alternative coconut curry sauce. They're all served with two dipping sauces you get to choose (wasabi mayo, roasted red pepper aioli, etc.) I've also had the boudin blanc sausage, which was served in a tasty mustard sauce over a potato leek gratin. The cheese plates are also a good starter.\n\nOf course you're really coming for the beer list, which is extensive. A good number on tap, and many many more to choose from. I buy a number of Belgian beers from Whole Foods and I must say, however, that La Trappe does mark up their prices considerably. But if you're coming for these calibers of beer, you probably weren't expecting anything cheap anyhow.\n\nMy friend likened his last experience to coming into a small Belgian tavern for some hearty food and tasty beer to escape the winter cold. Hopefully you'll get that experience too.", "rating": 4, "date": "2009-08-31"}, {"excerpts": ["Mussels & frites, mini burgers and the boudin blanc are badass."], "author": "Alex F.", "review": "Belgian & local beer selection is awesome. Duchesse has been on tap lately--get it.\n\nMussels & frites, mini burgers and the boudin blanc are badass.", "rating": 5, "date": "2010-01-20"}, {"excerpts": ["Its got a certifiably Disneyland-sized selection of beers, an exciting/sweet take on Moules a la Biere, and their Boudin Blanc will make you wonder why you never ate more tubed meats in white sauce.  ", "Do yourself a favor and stop by; you'll need to fuel up before taking on the Defense Against the Dark Arts teacher ", "(Who eats at Sizzler, BTW)."], "author": "Michael D.", "review": "La Trappe has some Harry Potter magic going on, from its secluded downstairs pub atmosphere to its innovative take on the gastropub label.  Its got a certifiably Disneyland-sized selection of beers, an exciting/sweet take on Moules a la Biere, and their Boudin Blanc will make you wonder why you never ate more tubed meats in white sauce.  Do yourself a favor and stop by; you'll need to fuel up before taking on the Defense Against the Dark Arts teacher (Who eats at Sizzler, BTW).", "rating": 4, "date": "2011-12-24"}, {"excerpts": ["My son raved about his boudin blanc. "], "author": "Jeff A.", "review": "Arrived 5:30 pm on Saturday, greeted by friendly staff that directed us to the bar downstairs. The beer selection is overwhelming. Tried several from the tap. Stayed on for dinner. My rabbit was the best I've had. My son raved about his boudin blanc. My wife had the portobello burger and said it was okay, clearly she regretted not ordering the rabbit. Our waiter was great and good with our dumb questions. The place packed out by just after 6:00, and that made the downstairs very noisy.", "rating": 5, "date": "2012-07-26"}, {"excerpts": ["Oh man, the boudin blanc sausage was to die for, or atleast die from ( the sauce was sooo rich!) ", "the beer selection was good with a serious concentration in Belgium and Belgian styles (don't remember any IPAs on the menu). ", "Be warned though the beer book has an index in the front for better organization; which I mistook the page number for prices at first ( pg31 not $31 phew! )"], "author": "Steve L.", "review": "Oh man, the boudin blanc sausage was to die for, or atleast die from ( the sauce was sooo rich!) the beer selection was good with a serious concentration in Belgium and Belgian styles (don't remember any IPAs on the menu). Be warned though the beer book has an index in the front for better organization; which I mistook the page number for prices at first ( pg31 not $31 phew! )", "rating": 4, "date": "2009-04-29"}], "steak and fries": [{"excerpts": ["-Steak Frittes - steak and fries, a classic. ", "But this was so well done. ", "The steak was cut into strips, making it a very share-able plate. ", "It was tender, juicy, and perfectly cooked. ", "The fries were, as mentioned above, fry-perfection.\n", "-The grand finale, my favorite dish of the day: GHENTSE CHICKEN WATERZOOI, a traditional light Belgian Mary's organic chicken stew with cream, potatoes, carrots, onion, and celery. ", "TRUST ME PLEASE, THIS IS INSANELY GOOD. ", "I did not expect this to blow me away, but it was creamy, just sweet enough from the aromatics, hearty without being heavy, and had such a unique flavor. ", "It was crazy crazy good. ", "I would recommend this dish over and over and over, and will over it over and over and over.\n", "-Dessert was delicious and light. ", "I forget the name (not helpful) but someone from my party said they could now die happy. "], "author": "Tiffany D.", "review": "One of my favorite SF meals ever. It's cozy, euro, inviting, and everything on the menu is DELICIOUS!!! I was not expecting this from the modest exterior, but OMG come in, especially on a cold, SF day, go down the stairs to the more \"taverny\" downstairs, and enjoy a true feast!\n\nService is amazing - the wait staff are beyond friendly and will go way out of their way to make sure you have a good experience.\n\nThe beers and wine selection is on point. The waiters all can guide you to the perfect beer/wine if you can describe what you're looking for. I wanted a dry, sour cider, and they got me to the perfect one for my meal. They're also happy to provide samples, so just ask!\n\nAnd now the food. Oh. My. God. \n-The Frites - you cannot go to a Belgian spot and not try the frites. They invented fries! These are crispy all around but not overcooked like some twice-fried fries can be. There's a plethora of sauces available, my favorites being wasabi mayo, chipotle ketchup, and the traditional belgian ketchup. I'd recommend getting one mayo-based and one ketchup-based sauce to try. For added kicks, mix them for a blush sauce!\n-The mussels - we ordered a large order for 6 people to snack and share, in the traditional Mariniere style (The classic preparation with shallots, garlic, celery, onions, wine and witbier). It was so good! The sauce seeped into the mussels and they tenderly burst with flavor. It's a lighter, white sauce and not too thick, perfect for dipping bread or fries into.\n-Steak Frittes - steak and fries, a classic. But this was so well done. The steak was cut into strips, making it a very share-able plate. It was tender, juicy, and perfectly cooked. The fries were, as mentioned above, fry-perfection.\n-The grand finale, my favorite dish of the day: GHENTSE CHICKEN WATERZOOI, a traditional light Belgian Mary's organic chicken stew with cream, potatoes, carrots, onion, and celery. TRUST ME PLEASE, THIS IS INSANELY GOOD. I did not expect this to blow me away, but it was creamy, just sweet enough from the aromatics, hearty without being heavy, and had such a unique flavor. It was crazy crazy good. I would recommend this dish over and over and over, and will over it over and over and over.\n-Dessert was delicious and light. I forget the name (not helpful) but someone from my party said they could now die happy. I'm sure whatever you get here, you won't be disappointed!\n\nHighly recommended for a cool date night, a group outing, guys meet up, or anytime you just want good, homey food and drink!", "rating": 5, "date": "2017-01-30"}, {"excerpts": ["We ordered mussels, the steak and fries and the stewed rabbit. ", "The mussels were perfectly cooked, the broth was amazing and I can't stop thinking about the steak! ", "But my favorite part would have to be the fries - perfectly crispy on the outside and soft on the inside. ", "You get to pick a couple sauces out of a wide selection and my favorite was the garlic mayo (you can never go wrong!). ", "Pro tip: The sauce from the rabbit is also an awesome dipping sauce for the fries! ", "They also have a wide selection of beers and are very nice about supplying small tastings before you make your final choice. "], "author": "Christina L.", "review": "When our group of three walked into La Trappe on a Friday evening we were a little bit concerned - where were all the people?? In an overcrowded city like San Francisco it's always a good rule of thumb to \"follow the crowds\" to good food but in this case I guess La Trappe is still an undiscovered gem!!\n\nWe ordered mussels, the steak and fries and the stewed rabbit. The mussels were perfectly cooked, the broth was amazing and I can't stop thinking about the steak! But my favorite part would have to be the fries - perfectly crispy on the outside and soft on the inside. You get to pick a couple sauces out of a wide selection and my favorite was the garlic mayo (you can never go wrong!). Pro tip: The sauce from the rabbit is also an awesome dipping sauce for the fries! They also have a wide selection of beers and are very nice about supplying small tastings before you make your final choice. We ended up with Vapeur En Folie, a Belgian pale ale, and were very happy with it! \n\nWill be back!!", "rating": 5, "date": "2016-06-06"}, {"excerpts": ["It's rare to find a bar that does steak and fries the right way, and the Boudin Blanc is done to equal perfection. ", "Don't pass up this bar, it's one of a kind."], "author": "Brett D.", "review": "I've been to my share of Belgian beer bars in Los Angeles, and this one blows them all away. The key here is not so much the selection, which is still very good, but the food. It's rare to find a bar that does steak and fries the right way, and the Boudin Blanc is done to equal perfection. Don't pass up this bar, it's one of a kind.", "rating": 5, "date": "2016-01-08"}, {"excerpts": ["Went with the Steak and Fries for the dinner.  "], "author": "Timothy W.", "review": "As if you haven't heard it before, the beer list here is simply majestic.  Was in SF on business and we made a pact to hit a different Brewpub each night.  Well this place isn't actually a brew pub, but after reading the numerous awesome reviews on Yelp, we moved this up on our to-do list.  \n\nWent with the Steak and Fries for the dinner.  Steak was good, a little fatty, the fries were excellent as was the peanut sauce that I had to dip them in.  \n\nThe atmosphere in this place is awesome, dark dungeoness but still inviting.  The beer list was why we came so we didn't let the food disappoint.  Not that the food was bad, I've just had better elsewhere.  Now the beer list is why I would give this place 6 stars if I could.  My friend and I did our best to work our way through as much of the beer book as we could :-)  I soooo   wish we had something like this back in NY.  \n\nOur waitress, I think her name was Theresa was very helpful with suggestions based on the style that we wanted to drink.  Being a self confessed Bud-Light drinker prior to working at La Trappe her selections were spot on.\n\nI would definitely hit this place up again if I ever find myself in San Francisco in the future...   \n\nMaybe my only complaint is that last call was a little early.  It was a Wed. night and we'd", "rating": 5, "date": "2010-09-02"}, {"excerpts": ["I recommend the pork loin special or the steak and fries; although really everything on the menu was great."], "author": "Svetlana F.", "review": "Wonderful decor, atmosphere, food and beer selection! I went here for a casual,fun work dinner and it couldn't be more perfect.  \n\nThe downstairs decorations and aesthetics made me feel like I was back in Belgium.  I love beer and I couldn't be happier with their huge beer selection! This place is definitely a must visit.  I recommend the pork loin special or the steak and fries; although really everything on the menu was great.", "rating": 5, "date": "2014-09-05"}, {"excerpts": ["24 dollars for a steak and fries??? "], "author": "katrien z.", "review": "I visited La Trappe, with my husband and two other Belgians, last night. I had been told it was not a big place so I went ahead and made reservations.\n\nThe service was ok. Despite the reservations, our table was not ready and we had to wait 5 minutes for them to pull out an extra chair for us.\n\nThe food was definitely nothing special. There were only a few Belgian food  items on the menu and everything was overpriced. 24 dollars for a steak and fries??? You pay that much and you expect your fries to be warm and at least to be served with mayonaise! \n\nThe beer list was great but the beer wasn't always served in the correct glass, which was disappointing. On top of that, we were overcharged for almost 10 bucks so keep your eyes on the bill and double check with the prices on the menu! The waiter did apologize and added that he was not yet familiar with the beer price list.\n\nLa Trappe did do a good job of remodelling the basement. It has a crypt-like feel to it, featuring brick alcoves, and the bar set-up is perfect.\n\nAll in all, I'd go back to La Trappe for the beers if I happen to be in the city. We have The Trappist here in Oakland so I don't even have to cross the bay to get Belgian beer! Food-wise, I prefer Frjtz on Hayes. Their fries are much better and served in a traditional Belgian cone.", "rating": 3, "date": "2008-01-27"}], "fish of the day": [{"excerpts": ["The fish of the day has been bland in the past and I give the burger a strong \"B\" grade.  ", "Food highlights include oysters (always fresh), mussels, and Bugs Bunny Stew.  ", "Desserts are worth a look too... we really liked the Ginger Snap Ice Cream Thing."], "author": "Ryan S.", "review": "Plain and simple, you cannot beat La Trappe's beer selection and when you don't know what to pick, Mike the owner helps you pick the right beer like a Level 5 Sommelier helps you pick a fine wine! \n\nDon't bother coming here if you are planning to order a Coors Light or a Budweiser as you might not make it out alive.  This place has serious beer for serious beer drinkers!  Good news too... if you are bringing a date and they don't like beer, worry not.  Order them a Fruity Lambic or something along those lines.  The \"Beer Bible\" has a verse that will touch any person's heart.\n\nI gave it 4 stars out of 5 because the dinner doesn't always wow me.  The fish of the day has been bland in the past and I give the burger a strong \"B\" grade.  Food highlights include oysters (always fresh), mussels, and Bugs Bunny Stew.  Desserts are worth a look too... we really liked the Ginger Snap Ice Cream Thing.", "rating": 4, "date": "2010-11-11"}], "oostende fish gratin": [], "mariniere": [{"excerpts": ["We started off and split the mussels mariniere. ", "We were in mussels heaven. "], "author": "Jerry D.", "review": "This was a Yelp find! \n\nWe aren't from the area and had no idea where to eat. Wanted something different. More importantly DID NOT want to eat at a tourist trap. We saw the reviews here and headed over.\n\nWhen we arrived I was nervous. There wasn't anyone there and that can't be a good sign, can it? Then we were taken downstairs. What a cool place! I already had a great vibe. \n\nOnce we were seated we were given the drink bible, I mean menu. It was substantial! I have never seen so many beer selections. Definitely a beer lover's paradise. \n\nWe started off and split the mussels mariniere. We were in mussels heaven. Dipping our bread,  with all the dipping sauces was yummy, but in the mussel broth was just divine. \n\nMy son ordered the steak frittes, my friend the roti de porc, and I the stoofvlees. Everything was perfectly seasoned and cooked to order. The steak was tender and juicy. His fries were perfectly cooked. The pork was seasoned well and the veggies made a nice compliment. My stew was something I had never eaten before and it was very good. \n\nWe all agreed that this was our best meal during our SanFran stay!", "rating": 5, "date": "2017-07-11"}, {"excerpts": ["Moreover, there's a good food selection, whether burgers, bistro fare, moules in a variety of styles (mariniere, a la biere, "], "author": "Vincent L.", "review": "I'd had La Trappe bookmarked here on Yelp for a while, and one time I walked by only to turn away upon seeing nobody in the airy, high-ceilinged ground floor dining room. Boy, was I wrong. Turns out there's far more space in the basement, which is a reasonably sized yet far more intimate space. And, most importantly, there's a tremendous beer selection, good food offerings, and good service at the bar.\n\nThere's a huge variety of beers here, whether domestic, Belgian, or global, many of which pair very well with both savory and spicy dishes on the menu. Some brews I've enjoyed include a Petrus Aged Red, a Verdi Imperial Stout from Birrificio del Ducato, and a Hitachino Nest XH. The servers were very knowledgeable about the beers, and it seemed a lot of the patrons were too. Moreover, there's a good food selection, whether burgers, bistro fare, moules in a variety of styles (mariniere, a la biere, Konkan, you name it), or Belgian specialties like stewed half rabbit, Ghentse chicken waterzooi (traditional Belgian chicken stew), or stoofvlees (traditional Flemish beef beer stew).\n\nSo if you love beer like I do, especially in a Belgian pub-inspired setting, La Trappe is a reasonably authentic place to get your booze and grub on.", "rating": 4, "date": "2017-08-15"}, {"excerpts": ["I went all traditional and ordered the classic $16 Mussels Mariniere bathing in white wine and butter filled with thyme, onions, shallots, garlic and parsley ", "(photo: http://bit.ly/2esTmxw). ", "This is indeed where they excelled as the mussels were fresh and succulent, full of the brothy flavor I was expecting. ", "It would have been a shame if we didn't try any of their beers, so Jamie had an 48 pint of a local brew called Defenestration, a nice, golden beer (photo: ", "http://bit.ly/2fpPIXp). "], "author": "Ed U.", "review": "This subterranean Belgian brewpub has been around for quite a while, but I always figured it was mostly for people who are really into foreign draft beers. Maybe that's why I haven't been all that motivated to come here until Jamie W. and i strolled by on the way back from the Marina one Saturday. We peeked through the window and didn't see anybody in the dining room. It wasn't until we walked in that we realized all the activity was downstairs in the basement where we saw a lot of chugging and guzzling underway.\n\nWe secured a table for two and noticed yes, they serve food, too. We knew we had to have the $8 Belgian Fries since we just assumed it was a house specialty. It came with our choice of two dipping sauces, so we tried the Roasted Garlic Mayo and the Belgian Mayo which had a tangier flavor from the white wine vinegar (photo: http://bit.ly/2fRjNSO). It definitely held us over as we waited for our appetizer. I ordered the $10 Vegetable Tart for us, a nice surprise with slices of zucchini, yellow squash, red onion, and tomato with herbs, lemon and melted goat cheese on a flatbread pastry shell (photo: http://bit.ly/2feJ3yO).\n\nThat was a much lighter treat than you would expect from an underground pub. For his entree, Jamie was a bit adventurous and had the $18 Ghentse Chicken Waterzooi, which looked like a creamy soup except it was centered around pieces of chicken, fennel, celery and onion. A Dutch specialty originating in Flanders, it was actually more of a stew with a soup base made of egg yolk, cream and thickened vegetable broth. The fries had yet another place for dipping beyond the double mayos (photo: http://bit.ly/2fvmMfq).\n\nI went all traditional and ordered the classic $16 Mussels Mariniere bathing in white wine and butter filled with thyme, onions, shallots, garlic and parsley (photo: http://bit.ly/2esTmxw). This is indeed where they excelled as the mussels were fresh and succulent, full of the brothy flavor I was expecting. It would have been a shame if we didn't try any of their beers, so Jamie had an 48 pint of a local brew called Defenestration, a nice, golden beer (photo: http://bit.ly/2fpPIXp). Not being a major beer drinker, I just had an $8 bottle of Hank's Gourmet Diet Root Beer to wet my whistle (photo: http://bit.ly/2fpQFyT). \n\nFOOD - 4 stars...unique Belgian specialties served here and there's the beer, too\nAMBIANCE - 3.5 stars...dark underground spot enlivened by the beer drinkers, a bit loud with the tables a bit too close together\nSERVICE - 4 stars...quite attentive and helpful in explaining the dishes\nTOTAL - 4 stars...it it's Tuesday, it must be Belgium...or it could be Saturday, too", "rating": 4, "date": "2016-11-06"}, {"excerpts": ["-The mussels - we ordered a large order for 6 people to snack and share, in the traditional Mariniere style (The classic preparation with shallots, garlic, celery, onions, wine and witbier). ", "It was so good! ", "The sauce seeped into the mussels and they tenderly burst with flavor. ", "It's a lighter, white sauce and not too thick, perfect for dipping bread or fries into.\n"], "author": "Tiffany D.", "review": "One of my favorite SF meals ever. It's cozy, euro, inviting, and everything on the menu is DELICIOUS!!! I was not expecting this from the modest exterior, but OMG come in, especially on a cold, SF day, go down the stairs to the more \"taverny\" downstairs, and enjoy a true feast!\n\nService is amazing - the wait staff are beyond friendly and will go way out of their way to make sure you have a good experience.\n\nThe beers and wine selection is on point. The waiters all can guide you to the perfect beer/wine if you can describe what you're looking for. I wanted a dry, sour cider, and they got me to the perfect one for my meal. They're also happy to provide samples, so just ask!\n\nAnd now the food. Oh. My. God. \n-The Frites - you cannot go to a Belgian spot and not try the frites. They invented fries! These are crispy all around but not overcooked like some twice-fried fries can be. There's a plethora of sauces available, my favorites being wasabi mayo, chipotle ketchup, and the traditional belgian ketchup. I'd recommend getting one mayo-based and one ketchup-based sauce to try. For added kicks, mix them for a blush sauce!\n-The mussels - we ordered a large order for 6 people to snack and share, in the traditional Mariniere style (The classic preparation with shallots, garlic, celery, onions, wine and witbier). It was so good! The sauce seeped into the mussels and they tenderly burst with flavor. It's a lighter, white sauce and not too thick, perfect for dipping bread or fries into.\n-Steak Frittes - steak and fries, a classic. But this was so well done. The steak was cut into strips, making it a very share-able plate. It was tender, juicy, and perfectly cooked. The fries were, as mentioned above, fry-perfection.\n-The grand finale, my favorite dish of the day: GHENTSE CHICKEN WATERZOOI, a traditional light Belgian Mary's organic chicken stew with cream, potatoes, carrots, onion, and celery. TRUST ME PLEASE, THIS IS INSANELY GOOD. I did not expect this to blow me away, but it was creamy, just sweet enough from the aromatics, hearty without being heavy, and had such a unique flavor. It was crazy crazy good. I would recommend this dish over and over and over, and will over it over and over and over.\n-Dessert was delicious and light. I forget the name (not helpful) but someone from my party said they could now die happy. I'm sure whatever you get here, you won't be disappointed!\n\nHighly recommended for a cool date night, a group outing, guys meet up, or anytime you just want good, homey food and drink!", "rating": 5, "date": "2017-01-30"}, {"excerpts": ["Followed this up with Mussels Mariniere, which was delightful. ", "Both of us got the steak frittes which leads us to our only complaint about the place. ", "The steak was a bit cool for our liking. ", "I thought it was just me, but my friend agreed. "], "author": "Vijay K.", "review": "To be honest, We weren't expecting much when we walked in. It is quite unassuming, from the outside. Then they take you downstairs, to your table and it's just great. Dark, almost like a chapel; the benches would fit right in, at a church. We were then given a tome, no other word for it. A tome with descriptions of all kinds of beers and ales, from all over the world. We took 15 minutes to get our beer order in, Pliny for me and Trippel, for my friend. Followed this up with Mussels Mariniere, which was delightful. Both of us got the steak frittes which leads us to our only complaint about the place. The steak was a bit cool for our liking. I thought it was just me, but my friend agreed. This is the only reason for me, not to give this place 5 stars.\n\nNonetheless, we will be back, because it's the kind of place that deserves it. And I desperately want to update my review, with 5 stars.", "rating": 4, "date": "2016-03-21"}, {"excerpts": ["I had the mussels Mariniere (white wine and  white beer sauce reduction with lemon, shallots, and fresh herbs) and the boy a burger. \n\n"], "author": "Alice W.", "review": "Came here last Friday before seeing Chappell at Cobb's. I had the mussels Mariniere (white wine and  white beer sauce reduction with lemon, shallots, and fresh herbs) and the boy a burger. \n\nFirst of all, i was a bit taken aback by the ginormous cauldron that contained the mussels when it arrived. These people meant business when it comes to seafood. Since the dish came with fries, I get my pick of two condiments. I decided on the peanut sauce and wasabi mayo. I also tried Orin's roasted red bell pepper mayo; think that was my favorite. The fries had a lovely crispiness and mushy on the inside, just the way I like it. The mussels were plump although I think the French do it much better. \n\nWe had a rather rushed dinner, but the place looks great for groups. Will definitely come back with more people next time and try out more things on the menu.", "rating": 4, "date": "2011-04-18"}, {"excerpts": ["Mariniere mussels were yummy and well-priced. ", "Bartender also brought us 2 half glasses of Gouden Carolus Cuvee van de Keizer Blauw on the house. ", "Friendly service. ", "Will come back."], "author": "Emily W.", "review": "Mariniere mussels were yummy and well-priced. Bartender also brought us 2 half glasses of Gouden Carolus Cuvee van de Keizer Blauw on the house. Friendly service. Will come back.", "rating": 4, "date": "2014-10-07"}, {"excerpts": ["As for our second dish, we went with the Mussels Mariniere which was cooked with shallots and onion that were sauteed in white wine, witbier, butter, creme fraiche and parsley served with fries and two dipping sauces of our choice. ", "I absolutely adored this dish. ", "The mussels were tender and soaked up all the flavors of the wine and witbier, and a silence descended upon our table as we enjoyed these. ", "The frites were perfectly crispy and dipping sauces ", "(Chipotle BBQ Mayo and Roasted Red Pepper) were great additions to the dish. "], "author": "Megan K.", "review": "I absolutely adored my experience at La Trappe when visiting San Francisco this past week. La Trappe was just a short walk down the hill from our hotel, which was incredibly convenient.\n\nUpon arriving you walk right into the kitchen/small restaurant area where the host told us to head downstairs for drinks and dinner. The downstairs area has no windows, but is dark and cozy, making for a great dinner and/or date spot. We were promptly greeted by our waiter who gave us the impressively long beer list and let us browse through it for a solid 10-15 minutes before checking back on us. It was hard to narrow down our selections, but my boyfriend and I went with a draft tripel and a saison, both of which we were happy with. \n\nAs we were sipping on our beers, we put in an order for the charcuterie plate. While this was being prepared the waiter brought us over some freshly made bread with butter. The bread was absolutely delicious--very soft and flavorful on the inside with a nice contrasting crunch of the crust. The charcuterie plate arrived a short time thereafter, which I was thankful for as we had done quite a number on the bread basket.  The charcuterie plate provided a great variety of delicious items, including cured duck sausage, garlic salami and pork rillette with a side of pickled onion and bell peppers. My favorites were the duck sausage and the salami, and the vegetables were slightly pickled which gave a nice contrast between the freshness of the vegetables and the vinegar flavor. I'd highly recommend getting this as a starter as it went wonderfully with our Belgian brews.\n\nFor the main plates, we decided to split two items, the first being the Birds Nest which was a trio of organic beef meatballs, breaded and deep fried with hard boiled quail egg in center and topped with a tomato based sauce. These were fantastic as all of the flavors complimented one another while standing out individually. The beef was flavorful and well seasoned and the richness of the quail egg was outstanding. They weren't overly breaded as many places tend to do and the frying process didn't rob the meatball of its unique flavor. As for our second dish, we went with the Mussels Mariniere which was cooked with shallots and onion that were sauteed in white wine, witbier, butter, creme fraiche and parsley served with fries and two dipping sauces of our choice. I absolutely adored this dish. The mussels were tender and soaked up all the flavors of the wine and witbier, and a silence descended upon our table as we enjoyed these. The frites were perfectly crispy and dipping sauces (Chipotle BBQ Mayo and Roasted Red Pepper) were great additions to the dish. I have no complaints whatsoever about the meal!\n\nWe finished our dining experience with another saison and the tiramisu. The tiramisu was probably my least favorite dish of the evening. It wasn't bad, but it fell short when compared to other tiramisus that I've had in the past. The dessert was a bit dry and lacked the almost overpoweringly strong coffee/espresso flavors.\n\nThe service was friendly and attentive, and food came out promptly, so I have no complaints there.\n\nLa Trappe is definitely worth the visit, so if you're in the mood for frites, Belgian Beers, and mussels, definitely check this place out.", "rating": 4, "date": "2013-03-27"}, {"excerpts": ["Husband and I enjoyed the mariniere, a beer and lemon broth.  ", "Prices are *really* affordable, considering this is high quality food AND San Francisco.  "], "author": "Mac O.", "review": "It's nice to visit places where your friends live, because then they can take you to establishments you'd never know about as a tourist, like La Trappe.  Definitely not a tourist trappe.  Oh, ha. Ha. Ha.  The nice thing about La Trappe, tho, is that you can indulge that dorky tourist side of you that wants to experience \"real\" San Francisco by riding the cable car right to the front door -- the Mason Street line stops practically smack in front of this homey little place.\n\nLove the rustic brick atmosphere of the downstairs dining room with its long wooden benches and low, sleek bar.  The Belgian beer list is extensive, and I do so love Belgian beer.  Portabello burger gets a new twist by being stuffed with goat cheese and fried.  Good stuff.  Moules frites are delish, too, plump, nicely cooked, very fresh tasting, and come in your choice of beautiful sauce.  Husband and I enjoyed the mariniere, a beer and lemon broth.  Prices are *really* affordable, considering this is high quality food AND San Francisco.  I was pleased to get out of La Trappe for relatively cheap, all things considered.\n\nThis was a great place to meet up with an old friend, drink some wonderful brew, and eat some tasty food.  I will definitely go back on my next visit to SF!", "rating": 4, "date": "2010-05-26"}, {"excerpts": ["I got moules mariniere which was a bit overcooked. ", "I chose spicy ketchup and curry ketchup as my condiments for the fries and spicy ketchup reminded me of sriracha sauce. "], "author": "Candice B.", "review": "Two things I hate more than anything when I dine out: going with a large group where someone isn't on time, and a restaurant that makes you feel like the worst customer because you are with a large group where not everyone is on time. \n\nOn one hand, I don't want to wait an hour and half for everyone to show up and THEN start to wait for the next table available (supposedly there is only one place in La Trappe that fits 10 people), on the other hand, I can see why the staff is irritated that our group got bigger and bigger over the night around our table that's supposed to fit 7. \n\nActually, I don't really see why the staff got that irritated. We never burdened them with our problem. We just kept on getting cozier and cozier as more people came. And we asked people around us for empty chairs and everyone around us was totally cool about it (afterall, no tables crammed like we did; most tables that seat four comfortably were occupied by two people.) And it's not like the late-comers didn't order anything and just took up space. \n\nMaybe the staff is just over worked, so the mere thought of having to rearrange chairs after we leave got them all riled up. In the entire basement, there was one waitress and one guy who waited AND acted as the host. \n\nThe food came out pretty slow after we ordered, but it was okay because everyone was enjoying their beers. Most of us got the moules et frites for $17. I got moules mariniere which was a bit overcooked. I chose spicy ketchup and curry ketchup as my condiments for the fries and spicy ketchup reminded me of sriracha sauce. Fries were fine, but I am not sure if you can really mess up fries. \n\nDespite the mediocre food and grumpy service, there were a couple of highlights of La Trappe. We came with a friend who is Belgian and he totally endorsed it. He had been here before and thought the food was authentic. And he licked his bowl of rabbit stew clean, so it must have been good. \n\nThe restaurant itself is super cute. The basement is a bit stuffy, but still really spacious and comfortable for a basement. The lighting was great: not too bright, not too dim. \n\nThe beer selection is outstanding. They have a whole binder of choices and have (if i remember correctly) 19 beers on tap. It reminds me of my favorite hang out when I lived in Lyon, this cozy bar called La palais de la biere where our manly friends can enjoy brews that are way too bitter for me, and I can enjoy a very girlie framboise bierre. And I don't think SF has places like this, so this really fills a void for all the beer lovers here. \n\nSo, if you want to impress your beer connoisseur friends (don't bring more than 3) while munch on some Belgian food, this is a perfect and chill place. But don't try to come here with a large group. It'll drive you and the staff crazy.", "rating": 3, "date": "2010-02-08"}, {"excerpts": ["In true Belgian form, they specialize in moules frites (mussels and french fries) which are served up in many different forms - classic mariniere (beer sauce), provencal, spicy tomato, and an alternative coconut curry sauce. ", "They're all served with two dipping sauces you get to choose (wasabi mayo, roasted red pepper aioli, etc.) "], "author": "Britt M.", "review": "I think you can experience La Trappe two different ways, depending on when you want to go. Either way you're going to have excellent beers, hearty food, and great ambiance; it's simply a question of how long you want to wait for it.\n\nYou can eat upstairs, but I recommend the basement, with its rustic brick walls, dim lighting, and bar crowd that provides an ideal locale for good company and beer. On a weeknight the sound level is perfect for conversations while still feeling decently full. On weekends, I recently waited an hour for a table (no reservations accepted) and it was uncomfortably crowded and more suitable for drinking than dinner. \n\nNonetheless, the meal was superbly satisfying once it arrived. In true Belgian form, they specialize in moules frites (mussels and french fries) which are served up in many different forms - classic mariniere (beer sauce), provencal, spicy tomato, and an alternative coconut curry sauce. They're all served with two dipping sauces you get to choose (wasabi mayo, roasted red pepper aioli, etc.) I've also had the boudin blanc sausage, which was served in a tasty mustard sauce over a potato leek gratin. The cheese plates are also a good starter.\n\nOf course you're really coming for the beer list, which is extensive. A good number on tap, and many many more to choose from. I buy a number of Belgian beers from Whole Foods and I must say, however, that La Trappe does mark up their prices considerably. But if you're coming for these calibers of beer, you probably weren't expecting anything cheap anyhow.\n\nMy friend likened his last experience to coming into a small Belgian tavern for some hearty food and tasty beer to escape the winter cold. Hopefully you'll get that experience too.", "rating": 4, "date": "2009-08-31"}, {"excerpts": ["I ordered the mariniere style mussels and belgian fries. ", "When they placed my seafood pot...", "I felt like I was brought to my feed bag..", "it was quite big and the mussels were super tasty. ", "I love love the belgian fries.  ", "My other friends ordered the rabbit stew (haha..she ate Thumper)...."], "author": "Pauline L.", "review": "My group was hankering some Belgian food love and not necessarily the multitude of beers laid out at the bar.  We had to split up our party cause we were that big...my early group ordered 4 orders of twice cooked fries with the entire range of dipping sauces...awesome fries that we cried how crispy it was and the soft center is super hot, so watch out for the roof of your mouths. \n\nI ordered the mariniere style mussels and belgian fries. When they placed my seafood pot...I felt like I was brought to my feed bag..it was quite big and the mussels were super tasty. I love love the belgian fries.  My other friends ordered the rabbit stew (haha..she ate Thumper)....Dan M. ordered the Chicken Gentse Waterzooi and it was super delicious...it was also filling, he had to order a togo bag cause he was stuffed. All my other friends weren't as adventurous and chose the standard hamburgers and fries which they claimed was excellent.\n\nIf you make reservations here to eat, you need to have your entire party here or they won't seat you.  Also check on the board for their specials, they have the desserts listed there as well.", "rating": 5, "date": "2010-10-19"}, {"excerpts": ["Fries were good, but the mussels were a mess: not cooked enough, and the Moules Mariniere  was quite spicy (it really should not be.)   ", "They serve 20 mussels per pot, which is about half of what you'd get in Belgium/France/ or any decent restaurant. \n", "Our waitress was good, but when we explained the problems with the mussels, we were only offered a free beer, which we declined, and the check came full price.  ", "We then asked to speak to the manager, who did not take the time to talk to us, but authorized the waitress to take the mussels off the bill.  ", "Thanks for that, but don't you care about the quality of your food??\n", "I guess not.  ", "Most of the customers looked like beer dudes anyway.\n - \"A good pub, definitely not a restaurant, and no customer service from the management.", "\""], "author": "danielle d.", "review": "\"I think that place should not serve food.\"\nThis coming from my husband... beer is good, but pours are small.  Fries were good, but the mussels were a mess: not cooked enough, and the Moules Mariniere  was quite spicy (it really should not be.)   They serve 20 mussels per pot, which is about half of what you'd get in Belgium/France/ or any decent restaurant. \nOur waitress was good, but when we explained the problems with the mussels, we were only offered a free beer, which we declined, and the check came full price.  We then asked to speak to the manager, who did not take the time to talk to us, but authorized the waitress to take the mussels off the bill.  Thanks for that, but don't you care about the quality of your food??\nI guess not.  Most of the customers looked like beer dudes anyway.\n - \"A good pub, definitely not a restaurant, and no customer service from the management.\"", "rating": 1, "date": "2009-07-19"}, {"excerpts": ["Mariniere (white beer sauce with lemon, shallots, and fresh herbs)\n4) Coconut Curry on Jasmine Rice "], "author": "Lan H.", "review": "Mussels four different ways? Heaven!! \n\nIf you're headed to La Trappe for the mussels and are indecisive about the four different ways they are served, here are my favorites in order of preference: \n\n1) Provencal (White wine and garlic tomato sauce with parsley)\n2) Spicy Tomato (tomatos, pureed with rosemary and dried chili)\n3) Mariniere (white beer sauce with lemon, shallots, and fresh herbs)\n4) Coconut Curry on Jasmine Rice (Jalapeños, lemon grass, cilantro and fresh lime juice)\n\nThe mussels come with twice cooked fries... can we say fried heaven? You have the choice of two of eight dipping sauces. Favorites were Roasted Red Pepper Aoli, Honey Graham Dijon Aoli and Spicy Ketchup. \n\nI would love to comment on the EXTENSIVE beer list; however, I just listened to the server's recommendations as I held the 2390438 page beer menu in my hand. Ok, I exaggerate but as an amateur beer drinker, I entrusted my beer choice to the waitress and was not disappointed.\n\nMy advice is to call for a reservation to ensure a seat downstairs in the more lively drinking and dining area. If there's a bit of a wait, at least you have 2390438 pages of beer selections to digest :)", "rating": 4, "date": "2009-06-03"}, {"excerpts": ["So we went for the traditional Mariniere preparation with white wine and shallots. ", "A steaming cauldron of mussels & broth showed up. ", "I asked for an additional bowl and got a perplexed look. ", "We were *sharing* ", "- was I supposed to lean over my friend's shoulder and pick out my mussels from the pot on her side of the table? ", "The mussels that we were able to eat were delicious. ", "Unfortunately, at least 6 or 7 of the mussels at the bottom of the pot were still closed, ergo inedible. ", "The broth was a little watery as well, but had good flavor. ", "The cone of frites was on the average side. ", "It was a good-sized portion to share, but the fries were quite unevenly fried - some nice and crispy, others limp. ", "The roasted garlic mayo and the spicy ketchup were both very tasty though.\n", "I'll reserve my highest praise for the beer selection. ", "There is so much going on with this beer list! ", "Their draft selection is extensive, and then there's an additional bottle list! ", "It's organized by style and even includes a brief glossary of beer styles, which is very helpful. ", "We had 4 beers in total, including the St. Feuillien Trippel, the Affligem Blond, the Ertvelds Wit, and the Ephemere Cassis. ", "All except the Canadian Ephemere were Belgian, but they were all incredibly good and arrived in the appropriate glassware. ", "The Ephemere was a great \"dessert\" beer - ", "the cassis flavor wasn't overpowering at all, just subtly tart. ", "I really want to come with a larger group so that we can explore the bottle list a bit more - they apparently have over 400 beers.\n", "If this place stepped up the service, I'd definitely award another star. "], "author": "Stephanie S.", "review": "I met a friend for dinner here last Thursday night. She had recently broken her foot, so I waited for her upstairs. Downstairs seems to be where the party's at though - it was so loud you could hear everything upstairs, and it seemed really crowded. Service wasn't exactly prompt or attentive, and confusingly, we had at least three different servers. It seemed like we waited quite a while for one of the three to notice that we were definitively ready to order.\nThe only reason to come to a Belgian place aside from the beer is to try the classic Moules Frites. So we went for the traditional Mariniere preparation with white wine and shallots. A steaming cauldron of mussels & broth showed up. I asked for an additional bowl and got a perplexed look. We were *sharing* - was I supposed to lean over my friend's shoulder and pick out my mussels from the pot on her side of the table? The mussels that we were able to eat were delicious. Unfortunately, at least 6 or 7 of the mussels at the bottom of the pot were still closed, ergo inedible. The broth was a little watery as well, but had good flavor. The cone of frites was on the average side. It was a good-sized portion to share, but the fries were quite unevenly fried - some nice and crispy, others limp. The roasted garlic mayo and the spicy ketchup were both very tasty though.\nI'll reserve my highest praise for the beer selection. There is so much going on with this beer list! Their draft selection is extensive, and then there's an additional bottle list! It's organized by style and even includes a brief glossary of beer styles, which is very helpful. We had 4 beers in total, including the St. Feuillien Trippel, the Affligem Blond, the Ertvelds Wit, and the Ephemere Cassis. All except the Canadian Ephemere were Belgian, but they were all incredibly good and arrived in the appropriate glassware. The Ephemere was a great \"dessert\" beer - the cassis flavor wasn't overpowering at all, just subtly tart. I really want to come with a larger group so that we can explore the bottle list a bit more - they apparently have over 400 beers.\nIf this place stepped up the service, I'd definitely award another star. I'd also love to come back to try the Moules Pastis appetizer because it sounds delicious: baked mussels in a fennel & Pastis sauce, yum!", "rating": 3, "date": "2011-08-15"}, {"excerpts": ["The fries were rockstar as were the mussels mariniere.  ", "Suited my beers quite nicely.  "], "author": "Ed H.", "review": "It's almost perfect.  They need a beaten down dude wearing a beaten down tux playing music on a piano while people in berets speak with French accents plot the resistance and there should be a cow wearing galoshes... no wait, that's Top Secret.\n\nIt's a fantastic list of Belgian beers, some Germans and I think I saw an Italian on there.  Each served in the appropriate glass, just one of those beautiful moments, probably tops out holding my baby niece for the first time, but don't tell my sister that.\n\nThe fries were rockstar as were the mussels mariniere.  Suited my beers quite nicely.  Cheese plate was gut, but honestly, the only purpose of the food here is to compliment the beer.\n\nTwo drawbacks.  First, they didn't have Corsendonk.  I may have been slurring a bit, but seriously... \n\nSecond... actually, I know I had a second, but I forget... Stupid delicious beer.", "rating": 4, "date": "2008-09-23"}, {"excerpts": ["Anyway, we split the moules frites (mariniere), carrot/ginger soup and the smoked trout and endive cups.\n", "I have to say, La Trappe serves the most enormous portion of mussels I've ever seen and the fries were crisp and perfect.  ", "I don't think it's been mentioned yet, but it's worth noting that the fries are served with a tasty wasabi aioli.\n", "Wish we could have stayed longer and tried dessert!"], "author": "Becca V.", "review": "If you love Belgian beer, this is the place for you. But because we were pressed for time, I couldn't wrap my mind around the menu fast enough to make a decision.\nAnyway, we split the moules frites (mariniere), carrot/ginger soup and the smoked trout and endive cups.\nI have to say, La Trappe serves the most enormous portion of mussels I've ever seen and the fries were crisp and perfect.  I don't think it's been mentioned yet, but it's worth noting that the fries are served with a tasty wasabi aioli.\nWish we could have stayed longer and tried dessert!", "rating": 4, "date": "2008-02-23"}, {"excerpts": ["My mussels (which I ordered in the Mariniere style), were of a generous portion, and the fries were hot and crisp and consistant in size and style. ", "They were also well seasoned - where they were not too salty, nor did they need any additional work should you so desire to eat them plain. ", "They also come with 2 of their dips. ", "The Black Cod (which is now off the menu, sucks to be you) was served with some potatoes and veggies, and was cooked pretty much to perfection; I remember it being moist and fresh seafood flavorful. "], "author": "Jessica S.", "review": "I am definitely a fan of La Trappe, and would come back for another round. This was my choice when The Boy came up to SF for a dinner date. He just wanted something laid-back with tasty food. I knew that he liked beer, and wanted some place quiet-ish for us to relax and chat while we ate dinner as well. La Trappe has over 200 different types of bottled beer, and about 30 on tap. They do serve wine as well, but that seems rather, well...stupid. \n\nWe walked in, and noticed about six tables upstairs, and asked if we could go and seat ourselves downstairs. You walk down, and are in this cozy warm lit space that has a bar, several tables set up, and a back space that was being used for what looked like a little party going on. We decided to sit at the bar, as there were 2 seats next to each other on the end, and it was obvious that no tables were going to free up anytime soon in the larger space. We were almost snuggled up right under the stairs, and we were quickly handed the beer book and their 1 page menu after being greeted by one of the beermen. I was totally overwhelmed by the list, and The Boy seemed pretty impressed as well. \nI actually managed to wade through a bit of the beer book and select something, and we ordered the sliders as a starter. My suggestion? Get the sliders. You can thank me later.\n\nThe beer man that helped us was so wonderful at giving us some of his time (as it quickly became PACKED within 15 minutes of us sitting down) in explaining the different kinds of beer, why they cleaned certain glasses and not others, and the types of glassware that they used at the bar. He did check in with us from time to time, but not so often that we felt smothered. I ordered the mussels and frites, and The Boy ordered the black cod. My food came pretty quickly, and as we sat and waited for his food (and nibbled at my fries), they realized that the fish order hadn't gone in, and quickly put it in with their apologies. No worries, we said, and they got that order down to us in lightening time. We ordered 2 more beers at this point, and the one The Boy picked the beerman said had a very distinct, almost sour taste, and let him taste it (since it was on tap), and let him choose something else to finish off his meal with. \n\nWhile obviously, this place is about the Beer, the food is certainly not to be missed. My mussels (which I ordered in the Mariniere style), were of a generous portion, and the fries were hot and crisp and consistant in size and style. They were also well seasoned - where they were not too salty, nor did they need any additional work should you so desire to eat them plain. They also come with 2 of their dips. The Black Cod (which is now off the menu, sucks to be you) was served with some potatoes and veggies, and was cooked pretty much to perfection; I remember it being moist and fresh seafood flavorful. It really was high end pub style food. \n\nWhile it did get busy, it never seemed like I was shouting at The Boy  in order to have a conversation with him, though we did have to cozy up to each other at the bar to let other people get in and order. When we asked for the bill, our beerman has comped one of our rounds of beer since we had to wait for the fish (which was almost the price of the dish anyways). They quickly processed our order, and we got out the door for a very reasonable dinner about for the amount of food and drink we consumed. \n\nKeep in mind that the beer here is not cheap - you won't be getting any $5 PBR. Be nice, be patient, and enjoy. I am excited to bring people back.", "rating": 4, "date": "2009-07-13"}], "konkan": [{"excerpts": ["My boyfriend ordered their Konkan and Marinere Mussels - both broths tasted amazing. \n\n"], "author": "Johanna M.", "review": "\"They have a Beer Bible... what!\" I thought that was pretty dope. My boyfriend took me here since he always raves about thee La Trappe. And I must say, he was right once again. \n\nEverything in the menu sounded scrumptious, it was hard to pass up on several of my options. I went for their Beef Beer Stew with the side of Belgium Fries. The beef was so tender and melted in my mouth. Also, the gravy was so flavorful and rich. The Belgium Fries was amazing, seasoned to perfection - I'm getting hungry just writing this review.  My boyfriend ordered their Konkan and Marinere Mussels - both broths tasted amazing. \n\nOur waitress was very attentive and sweet, despite of the very loud noise and amount of people dining in since we decided to eat downstairs.\n\nWe will differently stop by again, this time for lunch.", "rating": 4, "date": "2018-11-03"}, {"excerpts": ["Konkan, you name it), or Belgian specialties like stewed half rabbit, Ghentse chicken waterzooi (traditional Belgian chicken stew), or stoofvlees (traditional Flemish beef beer stew).\n\n"], "author": "Vincent L.", "review": "I'd had La Trappe bookmarked here on Yelp for a while, and one time I walked by only to turn away upon seeing nobody in the airy, high-ceilinged ground floor dining room. Boy, was I wrong. Turns out there's far more space in the basement, which is a reasonably sized yet far more intimate space. And, most importantly, there's a tremendous beer selection, good food offerings, and good service at the bar.\n\nThere's a huge variety of beers here, whether domestic, Belgian, or global, many of which pair very well with both savory and spicy dishes on the menu. Some brews I've enjoyed include a Petrus Aged Red, a Verdi Imperial Stout from Birrificio del Ducato, and a Hitachino Nest XH. The servers were very knowledgeable about the beers, and it seemed a lot of the patrons were too. Moreover, there's a good food selection, whether burgers, bistro fare, moules in a variety of styles (mariniere, a la biere, Konkan, you name it), or Belgian specialties like stewed half rabbit, Ghentse chicken waterzooi (traditional Belgian chicken stew), or stoofvlees (traditional Flemish beef beer stew).\n\nSo if you love beer like I do, especially in a Belgian pub-inspired setting, La Trappe is a reasonably authentic place to get your booze and grub on.", "rating": 4, "date": "2017-08-15"}, {"excerpts": ["We finished off two orders of Konkan Mussels - they were so on point.  "], "author": "Jessica T.", "review": "The best mussels I have ever had. \n\nHands down.\n\nMy dad was in town and I knew La Trappe would be a perfect fit for us all to go out - for a casual Friday night.\n\nLa Trappe always has a low-key vibe without a wait - so if you want attentive service and to be seated quickly - it's perfect.\n\nWe finished off two orders of Konkan Mussels - they were so on point.  Each mussel was huge and brimming with flavor and the service was superb and personable.\n\nFor quality, affordable food without pretension - come here. \n\nTrust.", "rating": 5, "date": "2016-07-29"}, {"excerpts": ["The food: we got a pot of mussels w spicy sauce (Konkan) and they were amazing. ", "Perfectly cooked ", "and I couldn't stop dipping my bread in the rich sauce. ", "The sauces that come w the Belgian fries are awesome too. ", "Get the gribiche or chipotle BBQ garlic mayo. ", "My gf got the STOOFVLEES - CARBONNADE FLAMANDE, a beef stew w excellent meat that melted in my mouth. ", "The giant book of beers let's you pick something special from anywhere in the world. ", "Will come again next time I'm in SF!"], "author": "El C.", "review": "The food: we got a pot of mussels w spicy sauce (Konkan) and they were amazing. Perfectly cooked and I couldn't stop dipping my bread in the rich sauce. The sauces that come w the Belgian fries are awesome too. Get the gribiche or chipotle BBQ garlic mayo. My gf got the STOOFVLEES - CARBONNADE FLAMANDE, a beef stew w excellent meat that melted in my mouth. The giant book of beers let's you pick something special from anywhere in the world. Will come again next time I'm in SF!", "rating": 5, "date": "2017-05-29"}], "spicy tomato": [{"excerpts": ["Mussels are amazing (especially the spicy tomato)."], "author": "Rachel K.", "review": "Updating to five stars because of how quick the service was. Mussels are amazing (especially the spicy tomato).", "rating": 5, "date": "2018-01-26"}, {"excerpts": ["We were seated quickly as the tables were still mostly empty and I ordered the spicy tomato mussels which were sooooo delicious!  ", "Great place to hang out and catch up with friends if you get there early enough.  ", "By the time we left there was quite the wait, so we made the right move in getting there a bit early.  ", "I would love to go back and sample more of their beers/sit at the bar where the customers seemed to be getting some advice from the bartenders.  ", "It's a little overwhelming in terms of beer selection otherwise!"], "author": "Raina D.", "review": "I came in early on a Saturday evening (around 6: 45) with three other people and had a beer at the bar after defaulting to a draft beer that sounded good in the very large beer book.  It was a blonde ale that was delicious! We were seated quickly as the tables were still mostly empty and I ordered the spicy tomato mussels which were sooooo delicious!  Great place to hang out and catch up with friends if you get there early enough.  By the time we left there was quite the wait, so we made the right move in getting there a bit early.  I would love to go back and sample more of their beers/sit at the bar where the customers seemed to be getting some advice from the bartenders.  It's a little overwhelming in terms of beer selection otherwise!", "rating": 4, "date": "2013-04-04"}, {"excerpts": ["The mussels in spicy tomato sauce is very good. "], "author": "Abhi M.", "review": "The mussels in spicy tomato sauce is very good. Please order yourself a Chimay Blue.\n\nThe overall atmosphere is wicked good. One of my favorite restaurants/bars/hang out spots in SF.", "rating": 5, "date": "2012-04-28"}, {"excerpts": ["They had the 3 options for broth, but I went with spicy tomato broth... ", "The mussels came in a HUGE pot piled all the way up with tons of fresh mussels soaking in excellent spicy tomato broth, and a big cone filled with fries and mayo on the side.  ", "I devoured the mussels.  ", "Literally.  sat there and ignored the party and totally devoured them.  ", "Then I went on to taking one of the shells as spoon and drank up half the broth.  ", "I ate about half of the fries which were also excellent but by the time I got to it "], "author": "Sascha O.", "review": "One of the BEST mussels and Belgian fries I've had in my LIFE.  No joke.\n\nI am not at all a beer drinker, so I was a bit worried how my night was going to turn out to be when my husband's friends were gathering here for one of the guys' bday... but when I saw their menu out front and saw their steamed mussels, 3 styles, I was totally sold.  And I was not at all disappointed!\n\nSorry I can't comment much on their beers but here's my big fat 5 stars on their food.\n\nI had their roasted fig salad and their mussels and Belgian fries combo.  They had the 3 options for broth, but I went with spicy tomato broth... and boy o boy were they good?!  \n\nThe fig salad was a good portion of leafy, dark greens with sweet, intense roasted figs.  The flavor was complex and beautiful.\n\nThe mussels came in a HUGE pot piled all the way up with tons of fresh mussels soaking in excellent spicy tomato broth, and a big cone filled with fries and mayo on the side.  I devoured the mussels.  Literally.  sat there and ignored the party and totally devoured them.  Then I went on to taking one of the shells as spoon and drank up half the broth.  I ate about half of the fries which were also excellent but by the time I got to it I was getting pretty full : )\n\nMy husband ordered their burger which looked HUGE and extremely juicy too.  \n\nI told him and his friends that I am down to coming here every Friday after my ballet class if I can get my hands on those mussels and they can get their beers and do whatever the heck they want, I'd be happy lol.\n\nSeriously, that good.  And I really hope it wasn't a one-time streak of luck because I am going to come back here for sure and they better be as good the next time too!", "rating": 5, "date": "2010-10-14"}, {"excerpts": ["I always order the spicy tomato mussels, I can't get enough of them. ", "I also love their fries and choices of dipping sauces. ", "By the way this dish is gluten free and goes impeccably well with the greens gluten free beer."], "author": "Ali A.", "review": "My favorite restaurant in North Beach. I love the atmosphere downstairs, a great place to enjoy dinner or just beer. I always order the spicy tomato mussels, I can't get enough of them. I also love their fries and choices of dipping sauces. By the way this dish is gluten free and goes impeccably well with the greens gluten free beer.", "rating": 5, "date": "2014-02-05"}, {"excerpts": ["I love the coconut curry & spicy tomato sauces.\n", "2. ", "Every beer in the world (not literally but probably close)\n3. ", "Great atmosphere, European feeling."], "author": "Sara P.", "review": "A go-to establishment for these reasons:\n1. Moules Frites. I love the coconut curry & spicy tomato sauces.\n2. Every beer in the world (not literally but probably close)\n3. Great atmosphere, European feeling.", "rating": 4, "date": "2010-10-29"}, {"excerpts": ["In true Belgian form, they specialize in moules frites (mussels and french fries) which are served up in many different forms - classic mariniere (beer sauce), provencal, spicy tomato, and an alternative coconut curry sauce. ", "They're all served with two dipping sauces you get to choose (wasabi mayo, roasted red pepper aioli, etc.) "], "author": "Britt M.", "review": "I think you can experience La Trappe two different ways, depending on when you want to go. Either way you're going to have excellent beers, hearty food, and great ambiance; it's simply a question of how long you want to wait for it.\n\nYou can eat upstairs, but I recommend the basement, with its rustic brick walls, dim lighting, and bar crowd that provides an ideal locale for good company and beer. On a weeknight the sound level is perfect for conversations while still feeling decently full. On weekends, I recently waited an hour for a table (no reservations accepted) and it was uncomfortably crowded and more suitable for drinking than dinner. \n\nNonetheless, the meal was superbly satisfying once it arrived. In true Belgian form, they specialize in moules frites (mussels and french fries) which are served up in many different forms - classic mariniere (beer sauce), provencal, spicy tomato, and an alternative coconut curry sauce. They're all served with two dipping sauces you get to choose (wasabi mayo, roasted red pepper aioli, etc.) I've also had the boudin blanc sausage, which was served in a tasty mustard sauce over a potato leek gratin. The cheese plates are also a good starter.\n\nOf course you're really coming for the beer list, which is extensive. A good number on tap, and many many more to choose from. I buy a number of Belgian beers from Whole Foods and I must say, however, that La Trappe does mark up their prices considerably. But if you're coming for these calibers of beer, you probably weren't expecting anything cheap anyhow.\n\nMy friend likened his last experience to coming into a small Belgian tavern for some hearty food and tasty beer to escape the winter cold. Hopefully you'll get that experience too.", "rating": 4, "date": "2009-08-31"}, {"excerpts": ["Spicy Tomato (tomatos, pureed with rosemary and dried chili)\n3) "], "author": "Lan H.", "review": "Mussels four different ways? Heaven!! \n\nIf you're headed to La Trappe for the mussels and are indecisive about the four different ways they are served, here are my favorites in order of preference: \n\n1) Provencal (White wine and garlic tomato sauce with parsley)\n2) Spicy Tomato (tomatos, pureed with rosemary and dried chili)\n3) Mariniere (white beer sauce with lemon, shallots, and fresh herbs)\n4) Coconut Curry on Jasmine Rice (Jalapeños, lemon grass, cilantro and fresh lime juice)\n\nThe mussels come with twice cooked fries... can we say fried heaven? You have the choice of two of eight dipping sauces. Favorites were Roasted Red Pepper Aoli, Honey Graham Dijon Aoli and Spicy Ketchup. \n\nI would love to comment on the EXTENSIVE beer list; however, I just listened to the server's recommendations as I held the 2390438 page beer menu in my hand. Ok, I exaggerate but as an amateur beer drinker, I entrusted my beer choice to the waitress and was not disappointed.\n\nMy advice is to call for a reservation to ensure a seat downstairs in the more lively drinking and dining area. If there's a bit of a wait, at least you have 2390438 pages of beer selections to digest :)", "rating": 4, "date": "2009-06-03"}, {"excerpts": ["I had the spicy tomato, but I also smelled the coconut curry and they must be amazing. ", "Loved all the dipping sauces I recommend the curry ketchup, chipotle mayo, and Dijon mayo. "], "author": "Katie M.", "review": "Walking down the spiral stair case and seeing Manneken Pis I knew I was a fan. I loved their beer selection, not quite as many as Monk's Kettle but their prices were a few dollars cheaper on most bottles.\n\nGreat mussels in many different variations. I had the spicy tomato, but I also smelled the coconut curry and they must be amazing. Loved all the dipping sauces I recommend the curry ketchup, chipotle mayo, and Dijon mayo. I liked the fried but they were pretty standard nothing that amazing.\n\nThe Barbar Honey beer was some of the tastiest beer I have ever had, with an awesome but not overwhelming honey after taste. \n\nWould def recommend for a party or large group fun atmosphere downstairs, but if you want a quieter date spot stay upstairs.", "rating": 4, "date": "2008-07-13"}], "roasted beet arugula sandwich": [], "portobello burger": [{"excerpts": ["I had the best veggie portobello burger I have ever had, the pesto complimented the whole dish beautifully, and the fries were to die for! ", "I only want double cooked, Belgian fries from now on!! ", "I'm not a big fan of beer, but whatever Clayton recommended to me (I don't remember at all) was a big hit, and I ordered another round. ", "Overall, a very lovely place with great beer and food selection, and with an amazing staff. ", "I highly recommend!"], "author": "Nat C.", "review": "We were recommended this place. It was a rainy late Thursday night, and the only thing I wanted was something homey and relaxed (I was afraid this will be too posh). This place was just what I needed, the basement had a lovely and comforting feel, and it also delivered with food and drinks. I had the best veggie portobello burger I have ever had, the pesto complimented the whole dish beautifully, and the fries were to die for! I only want double cooked, Belgian fries from now on!! I'm not a big fan of beer, but whatever Clayton recommended to me (I don't remember at all) was a big hit, and I ordered another round. Overall, a very lovely place with great beer and food selection, and with an amazing staff. I highly recommend!", "rating": 4, "date": "2016-11-06"}, {"excerpts": ["My wife had the portobello burger and said it was okay", ", clearly she regretted not ordering the rabbit. ", "Our waiter was great and good with our dumb questions. ", "The place packed out by just after 6:00, and that made the downstairs very noisy."], "author": "Jeff A.", "review": "Arrived 5:30 pm on Saturday, greeted by friendly staff that directed us to the bar downstairs. The beer selection is overwhelming. Tried several from the tap. Stayed on for dinner. My rabbit was the best I've had. My son raved about his boudin blanc. My wife had the portobello burger and said it was okay, clearly she regretted not ordering the rabbit. Our waiter was great and good with our dumb questions. The place packed out by just after 6:00, and that made the downstairs very noisy.", "rating": 5, "date": "2012-07-26"}], "seasonal belgian dumplings": []}