{"house salad": [], "house salad with chicken": [], "tuna salad": [], "smoked ham  swiss": [], "smoked turkey procvolone  bacon": [], "grilled chicken": [{"excerpts": ["I ordered the grilled chicken which was fantastic (w queso fresco and jalepenos).  ", "Simple, no nonsense grub.   ", "OJ freshly squeezed filled with pulpy goodness.  ", "Will def be hitting this place up for future meals!"], "author": "Heather F.", "review": "So glad I stopped in here!  Amazingly good, legit tortas.  I ordered the grilled chicken which was fantastic (w queso fresco and jalepenos).  Simple, no nonsense grub.   OJ freshly squeezed filled with pulpy goodness.  Will def be hitting this place up for future meals!", "rating": 4, "date": "2012-12-23"}, {"excerpts": ["We both got the junior grilled chicken with refried beans, which we agreed was anything but junior. ", "The guy taking our order was very accommodating, adhering to our requests to leave the bad stuff (cheese, mayo) off and put the good stuff (spinach, tomato) on. "], "author": "Jason B.", "review": "Can you picture a more quintessential 24th street scene? Spanish music playing. The guy who yells \"GOAL\" doing his thing on TV. Tortas being served. It was my sister's first time in this part of town, and I was hoping La Torta Gorda would deliver the goods. Indeed they did.\n\nWe both got the junior grilled chicken with refried beans, which we agreed was anything but junior. The guy taking our order was very accommodating, adhering to our requests to leave the bad stuff (cheese, mayo) off and put the good stuff (spinach, tomato) on. We also agreed it was absolutely delicious.\n\nSplendid service, quintessential atmosphere, great prices, fantastic food. And an Obama picture on the door. The Mission at its finest!", "rating": 5, "date": "2009-08-02"}, {"excerpts": ["My friend and I had a good meal of grilled chicken chilequiles in a green sauce. ", "It was one of the better versions I've had. ", "The chicken was large chunks of white breast meat and overall it was not salty and not greasy."], "author": "E. M.", "review": "I am  a fan of the small inexpensive take out place in 24th in the Mission. I headed over there to  have breakfast the other day then realized they have a sit down restaurant next door. My friend and I had a good meal of grilled chicken chilequiles in a green sauce. It was one of the better versions I've had. The chicken was large chunks of white breast meat and overall it was not salty and not greasy.", "rating": 4, "date": "2011-03-26"}, {"excerpts": ["i been getting the grilled chicken sandwich at least once or twice a week, served on a dutch crunch roll and i usually include some queso fresco to give it a bit more flavor. "], "author": "fern d.", "review": "I just tried the pancakes from here and theyre HUGE! I swear they must be genetically enhanced, maybe they poured some of that ooze on it that made the ninja turtles. the pancakes are real thick, they give you 3 of them for under 5 bucks...best cakes ive ever had. hopefully they dont go skimpy on them later or this just wasnt a mistake.\n\nalso tried the croussaint chorizo egg and cheese sandwich...  \n\ni been getting the grilled chicken sandwich at least once or twice a week, served on a dutch crunch roll and i usually include some queso fresco to give it a bit more flavor. way healthier than a torta de milanesa and tastier too\n\n5 stars to all this stuff...this is still my favorite spot for a quick breakfast or lunch", "rating": 5, "date": "2009-12-04"}], "turkey avocado": [], "chicken parmigiana": [], "tuna melt": [{"excerpts": ["Tuna Melt is great.  ", "Tortas (except for their El Pastor meat...", "and I can't say anything about beef) are excellent.  ", "They make it fresh.  ", "They make their aguas frescas fresh.  ", "It's good shite.  ", "Go there for lunch and converse with the construction workers.  ", "There are seats, but only outside, and only in the way of the order window.  ", "This is the only reason I give it 4 stars."], "author": "Ben H.", "review": "Tuna Melt is great.  Tortas (except for their El Pastor meat...and I can't say anything about beef) are excellent.  They make it fresh.  They make their aguas frescas fresh.  It's good shite.  Go there for lunch and converse with the construction workers.  There are seats, but only outside, and only in the way of the order window.  This is the only reason I give it 4 stars.", "rating": 4, "date": "2006-09-30"}], "smoked ham": [{"excerpts": ["We ordered their signature #12 Pierna Enchilada, #7 Hawaiian (smoked ham and pineapple) and mango madness! ", "They were all excellent!!! ", "Since this is a michelin recommended restaurant, i had a bit expectation when driving there! ", "It ended up surprised me by excellent bread, generous portion and friendly service! ", "Everything was on point! ", "I'll definitely come back!"], "author": "Lily M.", "review": "My friend and I had late lunch there. We ordered their signature #12 Pierna Enchilada, #7 Hawaiian (smoked ham and pineapple) and mango madness! They were all excellent!!! Since this is a michelin recommended restaurant, i had a bit expectation when driving there! It ended up surprised me by excellent bread, generous portion and friendly service! Everything was on point! I'll definitely come back!", "rating": 5, "date": "2017-07-21"}], "carnitas": [{"excerpts": ["Got the carnitas torta and the pierna enchilada torta. ", "Both really fresh. ", "The cheese with avocado accompanied the carnitas so well. ", "Delicious! ", "Will definitely go again next time we are in the mission."], "author": "Vaiya S.", "review": "Really good torta!! Went in on our way to a show on a whim. So happy we walked in here! Got the carnitas torta and the pierna enchilada torta. Both really fresh. The cheese with avocado accompanied the carnitas so well. Delicious! Will definitely go again next time we are in the mission.", "rating": 5, "date": "2018-06-22"}, {"excerpts": ["Did not like the service and the Carnitas tortas ", "I had ", "I actually had more beans that meat will definitely not come back"], "author": "Daniel B.", "review": "Did not like the service and the Carnitas tortas I had I actually had more beans that meat will definitely not come back", "rating": 1, "date": "2018-02-26"}, {"excerpts": ["Tortas are huge and tasty, their carnitas is a more wet version compared to the torta place down the street. ", "Don't sleep on the huitlacoche tacos though, sweet, nutty with a stewed mushroom texture. ", "They're hard to find and it's a nice change of pace from your standard Mission Mexican."], "author": "Patrick T.", "review": "Quaint and classy dinner vibes at this monster torts spot, and one of the few places to serve tasty tasty huitlacoche (corn fungus).\n\nTortas are huge and tasty, their carnitas is a more wet version compared to the torta place down the street. Don't sleep on the huitlacoche tacos though, sweet, nutty with a stewed mushroom texture. They're hard to find and it's a nice change of pace from your standard Mission Mexican.", "rating": 4, "date": "2016-02-26"}, {"excerpts": ["I picked the carnitas torta and it was delicious! ", "The only thing that was a little irritating was the jalapenos that were hidden in the flavorful carnitas ", "but I picked them out, no biggie. ", "The bread was nice and toasty too! ", "If I'm ever in the area I'll be sure to come back here then head over to the ice cream shop on the corner of the building."], "author": "Taylor H.", "review": "Came in on a Friday afternoon to grab something quick to eat before my Uncle and I headed out to go hiking. We walked in and it wasn't to packed but there were a few people in there. The service was quick and easy - I picked the carnitas torta and it was delicious! The only thing that was a little irritating was the jalapenos that were hidden in the flavorful carnitas but I picked them out, no biggie. The bread was nice and toasty too! If I'm ever in the area I'll be sure to come back here then head over to the ice cream shop on the corner of the building.", "rating": 4, "date": "2015-08-23"}, {"excerpts": ["We tried the piernas enchiladas and carnitas tortas. ", "Both lacked seasoning and the piernas was too saucy, soaking through the bread quite quickly. ", "The carnitas didn't have the crispy bits or seasoning we enjoy with say like the carnitas from La Tapatia in SSF. ", "The tabletop salsas were good with three choices: smoky/sweet, red/spicy, and a fresh bright green one. "], "author": "K. S.", "review": "We tried the piernas enchiladas and carnitas tortas. Both lacked seasoning and the piernas was too saucy, soaking through the bread quite quickly. The carnitas didn't have the crispy bits or seasoning we enjoy with say like the carnitas from La Tapatia in SSF. The tabletop salsas were good with three choices: smoky/sweet, red/spicy, and a fresh bright green one. They really added to the tortas. \n\nI do have to say the employees are friendly, although not too organized or efficient with seating and taking orders. Once our orders were taken, the food arrived relatively quickly. And it's nice to go in to a place in the Mission and have indoor (and private outdoor) seating.  \n\nMaybe I would have enjoyed the torta recommended on the Serious Eats torta guide. . . But the two tortas we tried were underwhelming.", "rating": 3, "date": "2015-01-02"}, {"excerpts": ["It was packed with carnitas, cheese, pickled jalapenos, onions, and sauce.  "], "author": "Vicente G.", "review": "No wonder the Pierna Enchilada Torta made the 7x7 Big Eat list!  That thing was a monster and oh so AMAZING!  I ordered the junior size but was only able to finish half since it was SO large.  It was packed with carnitas, cheese, pickled jalapenos, onions, and sauce.  The guy working the register brought it out to me with a squeeze bottle of deliciously smoky salsa that I liberally used on every bite.\n\nThe place is tiny, but they have a great patio in the back with tables and umbrellas.  The guys working there are some of the friendliest, most helpful around!", "rating": 5, "date": "2011-09-13"}, {"excerpts": ["I ordered a mango agua fresca and a large torta with carnitas. ", "This thing was pretty huge but served on a flat round roll which I never had before. ", "The torta was good but the flavors didn't really pop as I would've expected. "], "author": "Art O.", "review": "After getting hooked up with my new board at Mission Skateboards, I wandered down 24th St for a bite to eat. I remember reading about La Torta Gorda on Yelp and decided to seek it out. Luckily, I'm a visual learner and remembered what La Torta looked like based on the signage since I had no clue what the cross street was.\n\nI was the second or third person in the restaurant and was served promptly. I ordered a mango agua fresca and a large torta with carnitas. This thing was pretty huge but served on a flat round roll which I never had before. The torta was good but the flavors didn't really pop as I would've expected. The agua fresca was excellent though.\n\nOverall, more like 3.5 stars. Great service and a pretty decent torta.", "rating": 4, "date": "2009-01-03"}, {"excerpts": ["my other friend got two tacos, i think the chicken and carnitas. "], "author": "Lina O.", "review": "after walking around mission district, admiring all the murals, my friends and i started to get hungry. one of my friends, who is a SF native and recently moved back home after living on the east coast for the past few years, had said something like \"i think i remember this place having a really good mole\". it looks like a random hole in the wall and im really not sure if it really was the place she was thinking about, or if we had just stumbled upon another hidden gem.\n\nits a small homey restaurant with counter seating and a few tables. the owner and other workers were very friendly, and even offered to take a group pic of us, without us even asking or hinting. \n\ni ordered the carne asada torta. it came on what looked like a whole wheat bun (!) with refried beans, avocado, queso fresco, onions, mayo and jalapenos or chipotle. i got the junior size which was a pretty good size torta. i wonder how big the regular size is then.\n\nmy friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). we called it a man sandwich. hahaah it looked pretty much like a cholesterol packed torta. he said it was good but it looked like there was a hot dog in it too. i think if you have a weak heart, you shouldnt get this. ahha\n\nmy other friend ordered the chile relleno and the taco placero (with your choice of meat, queso fresco, avocado and nopales). i forgot what kind she got but the owner offered to put two different kinds split on the taco since it was so big. in the menu it says its an XXL taco. its basically a really huge taco on a homemade tortilla. my friend is vegetarian so he made her a meatless taco. im not sure what was in it but it looked really good. the chile relleno was a red sauce kind. it was lightly battered and cheesy in the inside. you could taste the cheese and the chile. it was really good. not heavy at all.\n\nmy other friend got two tacos, i think the chicken and carnitas. they were small tacos, so i think two or three would be a good amount to get. \n\nmy friends ordered mexican hot chocolate, which tasted like rich chocolate with a little cinnamon in it. i ordered a strawberry agua fresca. it was so good! it was like eating a fresh juicy strawberry. \n\nthe owner said that his restaurant was featured in 3 different SF magazines and even had a \"people on yelp love us!\" sticker in the window :) he was super nice and even offered to let us pay our bill separately. my friend that lives in SF says that the mexican food in SF is nothing like what we have in LA, but this place was pretty good. i'd definitely recommend this place, just make sure you get there before they close. they close at 4PM on saturdays and sundays!\n\ni left a gordita", "rating": 5, "date": "2010-12-22"}, {"excerpts": ["best quality ingredients, incredible bread, amazing carnitas, and mango smoothie - fresh, whole mango smoothie for 3 bucks? and watermelon aguas frescas (which tastes like smooshed watermelon but without any sugar added... 16 oz for 3 bucks? ", "unheard of... watermelon is expensive). ", "Um... what else - clean restaurant, great breakfast... amazing sauces, great quality of QUESO FRESCO, my favorite cheese, ", "oh ", "and, I don't know, the food speaks for itself. ", "And the left overs keep well, too. ", "Just turn the oven onto 400 degrees and cook for 10-15 in the paper. ", "Don't bother with the tortas at El Farolito (even though it's amazing) or Cancun (even though it's fantastic). ", "Don't bother. "], "author": "Y K.", "review": "BEST TORTAS IN TOWN. best quality ingredients, incredible bread, amazing carnitas, and mango smoothie - fresh, whole mango smoothie for 3 bucks? and watermelon aguas frescas (which tastes like smooshed watermelon but without any sugar added... 16 oz for 3 bucks? unheard of... watermelon is expensive). Um... what else - clean restaurant, great breakfast... amazing sauces, great quality of QUESO FRESCO, my favorite cheese, oh and, I don't know, the food speaks for itself. And the left overs keep well, too. Just turn the oven onto 400 degrees and cook for 10-15 in the paper. Don't bother with the tortas at El Farolito (even though it's amazing) or Cancun (even though it's fantastic). Don't bother. Walk the few extra blocks to La Torta Gorda and have your meal here.\n\nOh, and thumbs up to the awesome staff. Truly a great mom-and-pop shop.", "rating": 5, "date": "2010-06-14"}, {"excerpts": ["We ordered the Jr. Steak torta, a regular carnitas taco and Taco Placero Al Pastor. ", "The Steak Torta had no flavor, the carnitas taco was moist yet also lacking in taste, now the Placero Al Pastor taco was a little better but the nopales tasted like the came out of a jar.\n\n"], "author": "Raw W.", "review": "I was craving some authentic Mexican food and this place claims to have it. I have had more flavorful tacos from a taco cart on the street than this place.\n\nThis place is a little runed down and looks like it's had better days.\n \nWe ordered the Jr. Steak torta, a regular carnitas taco and Taco Placero Al Pastor. The Steak Torta had no flavor, the carnitas taco was moist yet also lacking in taste, now the Placero Al Pastor taco was a little better but the nopales tasted like the came out of a jar.\n\nWith all that being said, the only reason I would stop back into this place would be if it's raining and I needed to get out of the rain.", "rating": 2, "date": "2011-11-07"}, {"excerpts": ["I got the jr.-sized carnitas torta. ", "It was tasty. ", "The other guys I was with ordered chorizo. ", "They seemed to enjoy. ", "Think I paid less than $10, including a drink. ", "I'll go back...at the very least, to thank them for saving my thumb."], "author": "Aaron Z.", "review": "Stopped in because the Street Food Fest was a fuckin mess. Seriously. 50+ person lines for every booth. Wanted to chop my thumb off. \n\nAnyways.... I got the jr.-sized carnitas torta. It was tasty. The other guys I was with ordered chorizo. They seemed to enjoy. Think I paid less than $10, including a drink. I'll go back...at the very least, to thank them for saving my thumb.", "rating": 3, "date": "2010-08-21"}, {"excerpts": ["I had a 'Large' Torta de Carnitas for $7.95. ", "If I knew how bid the portions are I would have ordered the 'Reg' for $5.95. ", "Most amazing. ", "Great Carnitas!\n\n"], "author": "BigJohnS F.", "review": "*** PATIO SEATING!!! ***\n\nReasonable prices. Yummy, spicy Mexican food.\n\nI had a 'Large' Torta de Carnitas for $7.95. If I knew how bid the portions are I would have ordered the 'Reg' for $5.95. Most amazing. Great Carnitas!\n\nEven if it's too cold to sit outside the inside part is like an old ice cream parlor.\n\nI'll be back.", "rating": 4, "date": "2010-11-16"}, {"excerpts": ["The carnitas was tender and not too greasy, the blend of ingredients was portioned just right and the bread was truly amazing - crispy on the ouside yet tender and moist on the inside, not chewy or tough at all. ", "The topper was the homemade chipotle sauce. \n", "This sandwich was so good ", "I went back the next day. ", "For people with normal sized stomaches, I recommend the \"junior\" size. "], "author": "Dave F.", "review": "Man, this is one of the best Tortas I've had, ever. I've passed this place a hundred times and finally decided to try it. The carnitas was tender and not too greasy, the blend of ingredients was portioned just right and the bread was truly amazing - crispy on the ouside yet tender and moist on the inside, not chewy or tough at all. The topper was the homemade chipotle sauce. \nThis sandwich was so good I went back the next day. For people with normal sized stomaches, I recommend the \"junior\" size. The \"regular\" is enough to feed 2.\n\nNom nom nom...", "rating": 4, "date": "2011-01-22"}, {"excerpts": ["I frequented this place a lot more when I lived around the corner, but even now that I've moved and have lots of torta places around, I still sometimes make the special trip to get one of their carnitas tortas. ", "Yum!! ", "I hear that their tacos and other offerings are also yummy, but honestly I can never bring myself to stray from the torta menu. "], "author": "Nicole A.", "review": "I frequented this place a lot more when I lived around the corner, but even now that I've moved and have lots of torta places around, I still sometimes make the special trip to get one of their carnitas tortas. Yum!! I hear that their tacos and other offerings are also yummy, but honestly I can never bring myself to stray from the torta menu. They even have some frou-frou veggie sandwiches, though I mostly come here when I'm craving meat. \n\nAlso, the service is awesome, unassuming and friendly. They also let the school I work at have fundraisers where a percentage of food purchased go to our school- gotta love an establishment that gives back to the community!", "rating": 4, "date": "2010-05-23"}, {"excerpts": ["Two of us opted for the regular sized carnitas torta.  ", "We both only ate half and had the other half for dinner.  ", "It was chock full of delicious carnitas, and the saucy flavors (including my fav: mayo) tied it all together.  ", "If I worked near here I'd probably grab a junior torta on a regular basis for lunch.  ", "Our other lunchmates went for a quezadilla and taco.  ", "neither seemed to have any complaints, so i call it win-win.  ", "Our misison mexican food craving was beyond satisfied with these giant sandwiches of deliciousness."], "author": "Anne Marie B.", "review": "this place serves a 5 star torta.  we were at SFGH yesterday for work so we walked down the street to La Torta Gorda per the recommendation of an SFGH employee.  Smart move on our part to listen. \n\nWe were seated out on the back patio and had a delicious lunch.  Two of us opted for the regular sized carnitas torta.  We both only ate half and had the other half for dinner.  It was chock full of delicious carnitas, and the saucy flavors (including my fav: mayo) tied it all together.  If I worked near here I'd probably grab a junior torta on a regular basis for lunch.  Our other lunchmates went for a quezadilla and taco.  neither seemed to have any complaints, so i call it win-win.  Our misison mexican food craving was beyond satisfied with these giant sandwiches of deliciousness.", "rating": 5, "date": "2010-09-24"}, {"excerpts": ["I ordered a junior carnitas torta (definitely appreciate the junior size) and was pleased with the thick fresh bread and well-seasoned meat. \n\n"], "author": "Susan L.", "review": "This was my first torta experience, which is surprising seeing that I've been living in the deep Mission for 3 years now. I didn't find anything all that special with tortas but I did appreciate a Mexican cuisine that wasn't just some other arrangement of tortilla, meat, cheese, and salsa. I ordered a junior carnitas torta (definitely appreciate the junior size) and was pleased with the thick fresh bread and well-seasoned meat. \n\nLa Torta Gorda gets 4 stars because they provide a quick, cheap, simple option for when you're hungry. Also, service was great - we got the royal treatment when they set up a table for us in the back patio. I'm completely satisfied with this torta joint and don't feel the need to try out any others in my hood.", "rating": 4, "date": "2008-08-09"}, {"excerpts": ["I've had the milanesa and the carnitas tortas so far, and both were quite good.  ", "I found the milanesa tender and flavorful, while though the carnitas were good, they were a tad dry.  ", "As you've probably read, each sandwich comes with refried beans, cheese, avocado, and jalepenos.  ", "I found the milanesa tender and flavorful, while though the carnitas were good, they were a tad dry.  ", "As you've probably read, each sandwich comes with refried beans, cheese, avocado, and jalepenos.  "], "author": "Adrian L.", "review": "My life sucks!  I have to work on many weekends (unlike like 99% of my coworkers), I don't have a car (not necessarily sucky, but when your in BFSSF, far from any cookery type place, some suckiness starts to set in) and there are not too many places i can pick up a lunch on my way to work on a Sunday morning (I guess thing could be worse).  La Torta Gorda is open at 6:30 AM on SUNDAY!!!  Not that I am even close to getting up by then, but it does mean that when I drag myself out of bed, i can get a fat torta on my way through the mission.  One mean sannie too, they not cheap, but when i get a regular size, they are two meals worth of food easily, so in the end they are a bargain.  \n\nI've had the milanesa and the carnitas tortas so far, and both were quite good.  I found the milanesa tender and flavorful, while though the carnitas were good, they were a tad dry.  As you've probably read, each sandwich comes with refried beans, cheese, avocado, and jalepenos.  The bread might be a little thick, but it's soft and doesn't get too much in the way of enjoying the fillings.      \n\nOh man, i gotta try the Cubano, and the chorizo con huevos...\nOh man, i gotta try the horchata....", "rating": 4, "date": "2008-08-01"}, {"excerpts": ["The carnitas are pretty tasty, not fatty enough, but still good.\n\n"], "author": "David C.", "review": "Tortas Los Picudos is much, much better.  Tortas El Primo is better.\n\nPros:\n\n(1) The regular size sandwich is gigantic.\n\n(2) The carnitas are pretty tasty, not fatty enough, but still good.\n\nCons:\n\n(1) Milanesa de res is too thin.  This results in a breaded jerky sandwich.\n\n(2) Refried beans on the torta.  I know this is a style, but it is not a good one.\n\n(3) No veggies on the torta.  I forget this when I order, and I am surprised when my sandwich only has meat, cheese, beans, avocado, and jalepeno on it.  A little lettuce and tomato go a long way (and yes, tomato is a fruit, I know).\n\n(4) The bread is huge, but something is not quite right.  I can't say for sure, but maybe it is a little dry / too crumbly / too thick so that it doesn't heat properly.\n\nI feel like I've given this place a fair share of chances, and I always regret coming here instead of Tortas Los Picudos.  On my last visit here, I was the only guy in the joint, and TLP had a giant crowd waiting to order.\n\nHonestly, I would give this place two stars, but the staff is very nice  This review is based only on the tortas, I have not tried any of their other food.", "rating": 3, "date": "2008-09-09"}, {"excerpts": ["The bf and I placed our orders (torta carnitas for me, torta carne asada for the bf) and sat down. "], "author": "Dianne d.", "review": "Alright. I'll admit it. I was a sucker and paid for 7x7's June \"Best of\" issue. Nestled amongst the \"best of\"'s was La Torta Gorda. The bf is in love with tortas, and since I've never had one before, I decided this may be worth the trek out to the Mission. I kept this place filed away in the back of my brain for one of those days when we get tired of the restaurants around us in the Richmond District.\n\nThat day came last week and I draaaagged the bf and myself off our lazy butts and into my car, me driving and silently hoping that my pain-in-the-ass-ishness about going would be rewarded with a tasty dinner choice. \n\nWe were rewarded. Oh lordy, were we rewarded.\n\nThe place was empty, which seemed strange because of all the praise 7x7 and Yelpers were heaping onto it. The bf and I placed our orders (torta carnitas for me, torta carne asada for the bf) and sat down. The food came up fast and while we were waiting, 3 or 4 people (regulars, it seemed) came and went, all ordering food to go.\n\nWe bit into those tortas and mmmm.. heavenly. The cheese was good, the bread was wonderful, the meat.. meaty deliciousness. It was definitely worth the trek and assuaged my worries that I'd. be. made. a. fool. (Nobody ever likes to be the person who drags someone else to the lame party, the whack bar, or.. the bad torta place?)\n\nHA! IN YOUR FACE, THESE TORTAS WERE AWESOME AND WORTH THE TRIP!\n\nAhem. So, in summary. Go here. Eat the tortas. If you are uber-hungry, get the regular. Otherwise the junior is a good size to get.\n\nFunny side note: you can buy (order?) cup of noodles here!\n\nOh, oh, oh! I almost forgot: the staff is awesome. They were really nice and even handed us different hot sauce when they noticed that we were using the El Tapatio (sp?) sauce. \"Oh, here you go. This hot sauce is better.\" Sweeeet!", "rating": 5, "date": "2007-08-25"}, {"excerpts": ["And the Carnitas Torta is close behind as my fave! \n", "They do breakfast, lunch and early dinner as well as great shakes, smoothies & agua frescas.  \n", "I love this place!!"], "author": "k k.", "review": "RUN! DO NOT WALK TO LA TORTA GORDA!! Fantastic Tortas & Poblanas Dishes!  Everyone who works here is super nice and helpful and the prices are really budget friendly.  \nYou MUST try the Pambazos Torta--chorizo, potatoes, lettuce,cheese & sour cream with a great red sauce!!  And the Carnitas Torta is close behind as my fave! \nThey do breakfast, lunch and early dinner as well as great shakes, smoothies & agua frescas.  \nI love this place!!", "rating": 5, "date": "2010-08-17"}, {"excerpts": ["I asked the guys working there if I should get carnitas or pastor. ", "Pastor was recommended ", "so I ordered one with everything on it.  ", "Went for the large size since it was only like $2 more. ", "It turned out to be a huge sandwich. ", "It was tastey, although not the best pastor I've had."], "author": "Brian J.", "review": "Started my quest for the perfect torta last weekend. Decided to try this place first having passed by it many times and seeing some good reviews on here. Walked in and grabbed a seat at the counter. I asked the guys working there if I should get carnitas or pastor. Pastor was recommended so I ordered one with everything on it.  Went for the large size since it was only like $2 more. It turned out to be a huge sandwich. It was tastey, although not the best pastor I've had.", "rating": 3, "date": "2009-01-12"}, {"excerpts": ["it comes packed with FOUR kind of meat...ham, turkey, carnitas-esque pork and hot dog. ", "yes, hot dog. ", "at that moment in time while i was eating my sandwich my whole mind, body and existence were centered around this most legendary of legendary foods. ", "if there was a culinary embodiment of the term \"wins\" it was this torta. ", "oh and their horchata is the best i've ever had. ", "they make it fresh on the spot in the blender, it's not sitting in some container all day, so it's real rich and frothy. ", "pure excellence."], "author": "Dan C.", "review": "my girlfriend brought me here a month ago and i was skeptical. i'm more of a burrito guy, even a quesadilla or nachos get my vote before tortas. but i'm always willing to try new things. and i'm glad i did....i got a cubana torta and good lord this thing was epic. it comes packed with FOUR kind of meat...ham, turkey, carnitas-esque pork and hot dog. yes, hot dog. at that moment in time while i was eating my sandwich my whole mind, body and existence were centered around this most legendary of legendary foods. if there was a culinary embodiment of the term \"wins\" it was this torta. oh and their horchata is the best i've ever had. they make it fresh on the spot in the blender, it's not sitting in some container all day, so it's real rich and frothy. pure excellence.", "rating": 5, "date": "2007-11-16"}], "milanesa": [{"excerpts": ["Do try the beef milanesa and the pierna enchilada (pulled pork) for juicy deliciousness. \n\n"], "author": "Mitzi G.", "review": "This is a Mexican restaurant specializing in cuisine from the state of Puebla- their selection of tortas is their take on a toasted sandwich.  \n\nDo try the beef milanesa and the pierna enchilada (pulled pork) for juicy deliciousness. \n\nAsk for Habanero peppers for some real heat, if you can handle it.\n\nTry the hot Champurrado... you won't have many opportunities to come by this drink and it's not always done right. This place makes it not too watery and not too sweet, so it tastes like a creamy cinnamon hot chocolate. So good!", "rating": 4, "date": "2017-04-29"}, {"excerpts": ["Here's what happened:\n\nI bought a \"milanesa de res\" torta. "], "author": "Hector M.", "review": "SPOILED MEAT ALERT!\n\nThis rating is based on the owner's reaction to my complaint. Here's what happened:\n\nI bought a \"milanesa de res\" torta. I take the first bite and the smell and taste of the meat was disgusting. As a former sever at a steakhouse, I know when meat has gone bad from 3 miles away. \n\nSo I emailed the owner and he demands evidence. I emailed him back asking him what kind of evidence he's looking for (this is 2 days ago) and I still haven't heard back. I understand he might think someone is trying to hustle him. Then I realized this locale's health score is 75.\n\nI will post pictures of the meat soon so he can believe me. Stay tune.", "rating": 1, "date": "2015-01-25"}, {"excerpts": ["Got food poisoning from there Torta de Milanesa. ", "The milanesa was chicken milanesa. ", "The sad part is, it was really tasty. ", "Unfortunately no matter how good something is you can't bypass it making you sick...."], "author": "Jessica Y.", "review": "Got food poisoning from there Torta de Milanesa. The milanesa was chicken milanesa. The sad part is, it was really tasty. Unfortunately no matter how good something is you can't bypass it making you sick....", "rating": 1, "date": "2017-01-16"}, {"excerpts": ["Their Milanesa isn't very good but everything else stood out pretty well. ", "The bread is 10x more delicious than other tortas in the area but it doesn't hold up with a lot of stuff, so don't expect to be able to eat too big a torta on this bread. "], "author": "Rohan D.", "review": "Man that was a long wait for a sandwich, I don't recommend coming in for lunch for a to go order unless you feel like waiting for a while.\n\nBut about the torta, I ordered the mega cubana and the sandwich was delicious. Their Milanesa isn't very good but everything else stood out pretty well. The bread is 10x more delicious than other tortas in the area but it doesn't hold up with a lot of stuff, so don't expect to be able to eat too big a torta on this bread. The junior is already pretty big, I don't recommend the regular unless you're a big guy.\n\nHonestly, this place is pretty damn good.", "rating": 4, "date": "2013-10-20"}, {"excerpts": ["my friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). ", "we called it a man sandwich. ", "hahaah it looked pretty much like a cholesterol packed torta. ", "he said it was good ", "but it looked like there was a hot dog in it too. ", "i think if you have a weak heart, you shouldnt get this. "], "author": "Lina O.", "review": "after walking around mission district, admiring all the murals, my friends and i started to get hungry. one of my friends, who is a SF native and recently moved back home after living on the east coast for the past few years, had said something like \"i think i remember this place having a really good mole\". it looks like a random hole in the wall and im really not sure if it really was the place she was thinking about, or if we had just stumbled upon another hidden gem.\n\nits a small homey restaurant with counter seating and a few tables. the owner and other workers were very friendly, and even offered to take a group pic of us, without us even asking or hinting. \n\ni ordered the carne asada torta. it came on what looked like a whole wheat bun (!) with refried beans, avocado, queso fresco, onions, mayo and jalapenos or chipotle. i got the junior size which was a pretty good size torta. i wonder how big the regular size is then.\n\nmy friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). we called it a man sandwich. hahaah it looked pretty much like a cholesterol packed torta. he said it was good but it looked like there was a hot dog in it too. i think if you have a weak heart, you shouldnt get this. ahha\n\nmy other friend ordered the chile relleno and the taco placero (with your choice of meat, queso fresco, avocado and nopales). i forgot what kind she got but the owner offered to put two different kinds split on the taco since it was so big. in the menu it says its an XXL taco. its basically a really huge taco on a homemade tortilla. my friend is vegetarian so he made her a meatless taco. im not sure what was in it but it looked really good. the chile relleno was a red sauce kind. it was lightly battered and cheesy in the inside. you could taste the cheese and the chile. it was really good. not heavy at all.\n\nmy other friend got two tacos, i think the chicken and carnitas. they were small tacos, so i think two or three would be a good amount to get. \n\nmy friends ordered mexican hot chocolate, which tasted like rich chocolate with a little cinnamon in it. i ordered a strawberry agua fresca. it was so good! it was like eating a fresh juicy strawberry. \n\nthe owner said that his restaurant was featured in 3 different SF magazines and even had a \"people on yelp love us!\" sticker in the window :) he was super nice and even offered to let us pay our bill separately. my friend that lives in SF says that the mexican food in SF is nothing like what we have in LA, but this place was pretty good. i'd definitely recommend this place, just make sure you get there before they close. they close at 4PM on saturdays and sundays!\n\ni left a gordita", "rating": 5, "date": "2010-12-22"}, {"excerpts": ["My husband got the Milanesa de res torta which only came with extras of beans, cheese and some jalapeño with bread so dense it soaked up any flavor.  ", "It's hard trying new places and is really a let down when it doesn't work out.  ", "Nice layout though and ", "service was good - but not for us ", ":/"], "author": "Carissa S.", "review": "Came here because of the good reviews - but was disappointed with the food.  I ordered huevos rancheros and expected a more authentic dish but instead was greeted with a plate full of flavorless tomato sauce with two eggs and some random fried rice.  My husband got the Milanesa de res torta which only came with extras of beans, cheese and some jalapeño with bread so dense it soaked up any flavor.  It's hard trying new places and is really a let down when it doesn't work out.  Nice layout though and service was good - but not for us :/", "rating": 3, "date": "2014-12-20"}, {"excerpts": ["way healthier than a torta de milanesa and tastier too\n\n5 stars to all this stuff...this is still my favorite spot for a quick breakfast or lunch"], "author": "fern d.", "review": "I just tried the pancakes from here and theyre HUGE! I swear they must be genetically enhanced, maybe they poured some of that ooze on it that made the ninja turtles. the pancakes are real thick, they give you 3 of them for under 5 bucks...best cakes ive ever had. hopefully they dont go skimpy on them later or this just wasnt a mistake.\n\nalso tried the croussaint chorizo egg and cheese sandwich...  \n\ni been getting the grilled chicken sandwich at least once or twice a week, served on a dutch crunch roll and i usually include some queso fresco to give it a bit more flavor. way healthier than a torta de milanesa and tastier too\n\n5 stars to all this stuff...this is still my favorite spot for a quick breakfast or lunch", "rating": 5, "date": "2009-12-04"}, {"excerpts": ["I've had the milanesa and the carnitas tortas so far, and both were quite good.  ", "I found the milanesa tender and flavorful, while though the carnitas were good, they were a tad dry.  ", "As you've probably read, each sandwich comes with refried beans, cheese, avocado, and jalepenos.  ", "I found the milanesa tender and flavorful, while though the carnitas were good, they were a tad dry.  ", "As you've probably read, each sandwich comes with refried beans, cheese, avocado, and jalepenos.  "], "author": "Adrian L.", "review": "My life sucks!  I have to work on many weekends (unlike like 99% of my coworkers), I don't have a car (not necessarily sucky, but when your in BFSSF, far from any cookery type place, some suckiness starts to set in) and there are not too many places i can pick up a lunch on my way to work on a Sunday morning (I guess thing could be worse).  La Torta Gorda is open at 6:30 AM on SUNDAY!!!  Not that I am even close to getting up by then, but it does mean that when I drag myself out of bed, i can get a fat torta on my way through the mission.  One mean sannie too, they not cheap, but when i get a regular size, they are two meals worth of food easily, so in the end they are a bargain.  \n\nI've had the milanesa and the carnitas tortas so far, and both were quite good.  I found the milanesa tender and flavorful, while though the carnitas were good, they were a tad dry.  As you've probably read, each sandwich comes with refried beans, cheese, avocado, and jalepenos.  The bread might be a little thick, but it's soft and doesn't get too much in the way of enjoying the fillings.      \n\nOh man, i gotta try the Cubano, and the chorizo con huevos...\nOh man, i gotta try the horchata....", "rating": 4, "date": "2008-08-01"}, {"excerpts": ["Cons:\n\n(1) Milanesa de res is too thin.  "], "author": "David C.", "review": "Tortas Los Picudos is much, much better.  Tortas El Primo is better.\n\nPros:\n\n(1) The regular size sandwich is gigantic.\n\n(2) The carnitas are pretty tasty, not fatty enough, but still good.\n\nCons:\n\n(1) Milanesa de res is too thin.  This results in a breaded jerky sandwich.\n\n(2) Refried beans on the torta.  I know this is a style, but it is not a good one.\n\n(3) No veggies on the torta.  I forget this when I order, and I am surprised when my sandwich only has meat, cheese, beans, avocado, and jalepeno on it.  A little lettuce and tomato go a long way (and yes, tomato is a fruit, I know).\n\n(4) The bread is huge, but something is not quite right.  I can't say for sure, but maybe it is a little dry / too crumbly / too thick so that it doesn't heat properly.\n\nI feel like I've given this place a fair share of chances, and I always regret coming here instead of Tortas Los Picudos.  On my last visit here, I was the only guy in the joint, and TLP had a giant crowd waiting to order.\n\nHonestly, I would give this place two stars, but the staff is very nice  This review is based only on the tortas, I have not tried any of their other food.", "rating": 3, "date": "2008-09-09"}, {"excerpts": ["I tried the junior milanesa (beef) with chipotle.\n", "It was the perfect size! ", "Just the perfect amount.\n", "The bread they use is fantastic, the torta is constructed perfectly.\n", "No drips of grease here.\n", "Don't forget to ask for the home made hot sauce. ", "It has the perfect amount of heat, enough to break a sweat but not enough to need to drink 2 liters of water. ", "It has a sweet after taste too.\n", "Next time, Regular size?"], "author": "Geordie E.", "review": "The best torta in the City.\nI tried the junior milanesa (beef) with chipotle.\nIt was the perfect size! Just the perfect amount.\nThe bread they use is fantastic, the torta is constructed perfectly.\nNo drips of grease here.\nDon't forget to ask for the home made hot sauce. It has the perfect amount of heat, enough to break a sweat but not enough to need to drink 2 liters of water. It has a sweet after taste too.\nNext time, Regular size?", "rating": 5, "date": "2008-07-08"}, {"excerpts": ["Their tortas aren't have bad, pollo milanesa is slightly dry but they have other options for food that look pretty good. ", "I've just always gotten the pollo milanesa because it comes with queso fresco and avocados. ", "The bread is nice and soft and it goes great with the rest of the insides of the sandwich!"], "author": "Gina R.", "review": "Their tortas aren't have bad, pollo milanesa is slightly dry but they have other options for food that look pretty good. I've just always gotten the pollo milanesa because it comes with queso fresco and avocados. The bread is nice and soft and it goes great with the rest of the insides of the sandwich!", "rating": 3, "date": "2008-12-16"}, {"excerpts": ["I ordered the Milanesa sandwich and when I got it, it tasted really bland ", "and it was riddled with jalepenos.  ", "Well, I don't like or eat jalepenos ", "and I wished they had asked me if i wanted it. ", "(spicy food is NOT for everyone, you know).  ", "And when I ordered the horchata, it was way too sweet.  ", "So for my nearly $10 lunch, I think I rather spend it somewhere else."], "author": "N A.", "review": "This is my first time eating at La Torta Gorda and sadly, I will probably not return.  I ordered the Milanesa sandwich and when I got it, it tasted really bland and it was riddled with jalepenos.  Well, I don't like or eat jalepenos and I wished they had asked me if i wanted it. (spicy food is NOT for everyone, you know).  And when I ordered the horchata, it was way too sweet.  So for my nearly $10 lunch, I think I rather spend it somewhere else.", "rating": 3, "date": "2008-04-28"}], "jamon": [{"excerpts": ["Jamon con ", "Huevo sin ", "Queso is the best. ", "Not the best service (if you come in during the lunch hour) takes them a while, and with good reason, lots and lots of people call in big orders. ", "Great prices. ", "I always leave happy with a full belly."], "author": "Arnold S.", "review": "Best tortas in the City. Jamon con Huevo sin Queso is the best. Not the best service (if you come in during the lunch hour) takes them a while, and with good reason, lots and lots of people call in big orders. Great prices. I always leave happy with a full belly.", "rating": 3, "date": "2007-04-19"}], "chorizo  egg": [], "cubana": [{"excerpts": ["Cubana torta, pierna enchilada and ", "I can't forget their tinga quesadillas ", "it reminds me the ones from Mexico !!"], "author": "Myra M.", "review": "Good place to eat if u are craving for REAL MEXICAN QUESADILLAS AND TORTAS. Cubana torta, pierna enchilada and I can't forget their tinga quesadillas it reminds me the ones from Mexico !!", "rating": 5, "date": "2018-09-25"}, {"excerpts": ["I ordered a junior carne asada torta while my partner ordered a junior torta cubana.  ", "The sandwiches came promptly and were hot.\n", "I liked my torta just fine although I have had better tortas at other places in the Mission District.  ", "My partner agreed.  ", "He said his torta was good, but he's had better.\n", "Hard telling why the tortas were not better.  ", "Perhaps a little more seasoning would help."], "author": "Philip C.", "review": "We tried this place early on Friday evening.  The place was nearly empty, not a good sign.\nWe seated ourselves and very nice server took our order.\nWe both ordered melon agua fresca.\nI ordered a junior carne asada torta while my partner ordered a junior torta cubana.  The sandwiches came promptly and were hot.\nI liked my torta just fine although I have had better tortas at other places in the Mission District.  My partner agreed.  He said his torta was good, but he's had better.\nHard telling why the tortas were not better.  Perhaps a little more seasoning would help.", "rating": 3, "date": "2014-03-29"}, {"excerpts": ["The cubana was good not best cubana I've had in the Mission ", "but I give it a pass since I didn't get the SUPER cubana which would've been more comparable to the huge monster tortas that ", "That's ", "It Market made famous. ", "If the super Cubana is bomb "], "author": "Jeff T.", "review": "I've only tried three of their Tortas but all of them were painfully delicious.\n\nActually I shamefully ate 2 1/2 tortas during a shift at work when I brought them to share but they were forgotten. \n\nBest. Mistake. Ever.\n\nThe cubana was good not best cubana I've had in the Mission but I give it a pass since I didn't get the SUPER cubana which would've been more comparable to the huge monster tortas that That's It Market made famous. If the super Cubana is bomb I'll probaby make this 5 stars.\n\nI also got the Palmazo(?) which I've never tried before but I thought it was pretty good. had a bright red bread, loaded with chorizo and potatoes. Not my favorite carb on carb action but I enjoyed it and ate the hell out of it (Giggitty).\n\nMy absolute favorite which I wasn't expecting was the Raza con Queso. \nIT WAS FREAKING VEGETARIAN. I didn't really order this one for me but it was my favorite, the grilled chile and cheese had a meaty texture and balanced the sandwich really well.\n\nOne thing to note is DRENCH those tortas in their sauce without the sauce the tortas rest at 3 stars but saucing them up brings them up so much.\n\nToss some meat on that Raza con Queso and I think these guys will have something magical.", "rating": 4, "date": "2015-05-01"}, {"excerpts": ["I sampled the Cubana and the Pierna Enchilada Tortas. ", "I opted for the juniors, but it was not a cost effective decision. ", "The Cubana was so-so. ", "It was a monstrosity of pork, steak, hot dog, cheese, beans, and mayo-- but it never really had an identity. ", "While the pork was a standout for the Pierna, the Cubana felt like a random mishmash with no theme. ", "If I'm you, I opt for the Pierna or try a different item, but don't go for the Cubana."], "author": "Neal C.", "review": "I sampled the Cubana and the Pierna Enchilada Tortas. I opted for the juniors, but it was not a cost effective decision. You pay $7.75 for a junior and $10.75 for a regular, but the regular delivers 2.5 times the amount of food: perfect for eating half then and half later. \n\nThe Pierna enchilada torta was one of the best Tortas I have had. Incredibly tender, moist pork in enchilada sauce served on a crispy bun. Wow, it was incredible and did not ever get boring. Ask for the bun extra crispy-- it really makes it even better. \n\nThe Cubana was so-so. It was a monstrosity of pork, steak, hot dog, cheese, beans, and mayo-- but it never really had an identity. While the pork was a standout for the Pierna, the Cubana felt like a random mishmash with no theme. If I'm you, I opt for the Pierna or try a different item, but don't go for the Cubana.", "rating": 4, "date": "2015-02-14"}, {"excerpts": ["This Mexican here approves la torta cubana and la torta de tinga. ", "I've had authentic ones in my life, but these are pretty good. ", "Probably the best you can find in the mission."], "author": "Oskar D.", "review": "This Mexican here approves la torta cubana and la torta de tinga. I've had authentic ones in my life, but these are pretty good. Probably the best you can find in the mission.", "rating": 4, "date": "2015-11-17"}, {"excerpts": ["I ordered the torta mega cubana here ", "and it was huge and delicious!  ", "Homemade bread and salsas.  ", "At least I think the bread is homemade.  "], "author": "Billy H.", "review": "The best torta I've ever had!  Simply amazing!  I ordered the torta mega cubana here and it was huge and delicious!  Homemade bread and salsas.  At least I think the bread is homemade.  Wash it down with a hot champurrada and go into hibernation for a week until you're hungry again!  \n\nThis place is as good as it gets when it comes to tortas.  Amazing!", "rating": 5, "date": "2013-05-04"}, {"excerpts": ["carne asada, regular cubana, and tinga. ", "I can't speak on the last two tortas ", "but I must say that my carne aside torta, was great. ", "Light, not heavy, the carne.. was seasoned well. ", "It was cool. ", "Jr. Size looks like the size of a Mc Chicken sandwich, maybe a tad bit bigger? ", "Perfect for a lunch or an easy small dinner. ", "The green sauce was great! ", "If you like spicy, you'll love. ", "This was on the mark of almost being too spicy for me to enjoy, but I was able to manage. ", "I'll be back bc ", "they serve bfast all day and take debit."], "author": "Sweets N.", "review": "Yum! It was delicious! The waitress was helpful with my bf and I. We ordered french toast, a jr. carne asada, regular cubana, and tinga. I can't speak on the last two tortas but I must say that my carne aside torta, was great. Light, not heavy, the carne.. was seasoned well. It was cool. Jr. Size looks like the size of a Mc Chicken sandwich, maybe a tad bit bigger? Perfect for a lunch or an easy small dinner. The green sauce was great! If you like spicy, you'll love. This was on the mark of almost being too spicy for me to enjoy, but I was able to manage. I'll be back bc they serve bfast all day and take debit.", "rating": 4, "date": "2015-05-12"}, {"excerpts": ["But about the torta, I ordered the mega cubana and the sandwich was delicious. "], "author": "Rohan D.", "review": "Man that was a long wait for a sandwich, I don't recommend coming in for lunch for a to go order unless you feel like waiting for a while.\n\nBut about the torta, I ordered the mega cubana and the sandwich was delicious. Their Milanesa isn't very good but everything else stood out pretty well. The bread is 10x more delicious than other tortas in the area but it doesn't hold up with a lot of stuff, so don't expect to be able to eat too big a torta on this bread. The junior is already pretty big, I don't recommend the regular unless you're a big guy.\n\nHonestly, this place is pretty damn good.", "rating": 4, "date": "2013-10-20"}, {"excerpts": ["I had such hope for my Cubana that barely delivered :( ", "The service however, its great. ", "Service with a smile is always appreciated :)"], "author": "Miss E.", "review": "I've had amazing tortas in the city.. This was not one of them. If I have to season it at home myself, then I could have just made it too. I had such hope for my Cubana that barely delivered :( The service however, its great. Service with a smile is always appreciated :)", "rating": 3, "date": "2014-10-24"}, {"excerpts": ["If you want a filling, coma inducing, feast of a sandwich... the super mega cubana or whatever it was called is exactly what you want.\n\n", "the mega cubana full size- is precisely what your liver needs to recover from a night out in the mission, on a mission haha\n\nin other perspectives, they offer a large variety of tortas and the bread holds very good. "], "author": "Leo M.", "review": "If you want a filling, coma inducing, feast of a sandwich... the super mega cubana or whatever it was called is exactly what you want.\n\nyou know when you have those cravings that no matter what you have in your fridge or where you go to eat you are still unsatisfied and feel like blah... \n\nwell, this place- if you order the mega cubana full size- is precisely what your liver needs to recover from a night out in the mission, on a mission haha\n\nin other perspectives, they offer a large variety of tortas and the bread holds very good. they take your order and present it to you exactly as you ask it.\n\nCarl's jr. commercials meet your reality! mmmmmmm", "rating": 5, "date": "2012-10-02"}, {"excerpts": ["my friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). ", "we called it a man sandwich. ", "hahaah it looked pretty much like a cholesterol packed torta. ", "he said it was good ", "but it looked like there was a hot dog in it too. ", "i think if you have a weak heart, you shouldnt get this. "], "author": "Lina O.", "review": "after walking around mission district, admiring all the murals, my friends and i started to get hungry. one of my friends, who is a SF native and recently moved back home after living on the east coast for the past few years, had said something like \"i think i remember this place having a really good mole\". it looks like a random hole in the wall and im really not sure if it really was the place she was thinking about, or if we had just stumbled upon another hidden gem.\n\nits a small homey restaurant with counter seating and a few tables. the owner and other workers were very friendly, and even offered to take a group pic of us, without us even asking or hinting. \n\ni ordered the carne asada torta. it came on what looked like a whole wheat bun (!) with refried beans, avocado, queso fresco, onions, mayo and jalapenos or chipotle. i got the junior size which was a pretty good size torta. i wonder how big the regular size is then.\n\nmy friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). we called it a man sandwich. hahaah it looked pretty much like a cholesterol packed torta. he said it was good but it looked like there was a hot dog in it too. i think if you have a weak heart, you shouldnt get this. ahha\n\nmy other friend ordered the chile relleno and the taco placero (with your choice of meat, queso fresco, avocado and nopales). i forgot what kind she got but the owner offered to put two different kinds split on the taco since it was so big. in the menu it says its an XXL taco. its basically a really huge taco on a homemade tortilla. my friend is vegetarian so he made her a meatless taco. im not sure what was in it but it looked really good. the chile relleno was a red sauce kind. it was lightly battered and cheesy in the inside. you could taste the cheese and the chile. it was really good. not heavy at all.\n\nmy other friend got two tacos, i think the chicken and carnitas. they were small tacos, so i think two or three would be a good amount to get. \n\nmy friends ordered mexican hot chocolate, which tasted like rich chocolate with a little cinnamon in it. i ordered a strawberry agua fresca. it was so good! it was like eating a fresh juicy strawberry. \n\nthe owner said that his restaurant was featured in 3 different SF magazines and even had a \"people on yelp love us!\" sticker in the window :) he was super nice and even offered to let us pay our bill separately. my friend that lives in SF says that the mexican food in SF is nothing like what we have in LA, but this place was pretty good. i'd definitely recommend this place, just make sure you get there before they close. they close at 4PM on saturdays and sundays!\n\ni left a gordita", "rating": 5, "date": "2010-12-22"}, {"excerpts": ["The cubana had too much meat and was dry compared to the al pastor. ", "Also, I don't think hot dog slices should be in my sandwich, so I wouldn't order the cubaba again. ", "The tortas are huge, so share with friends if you don't have a big appetite. ", "We split 2 among 4 people and I was stuffed!"], "author": "Cindy L.", "review": "3.5 stars for the al pastor torta which has marinated pork and pineapples! The pineapples and jalapenos were a good touch since they made the torta a lot juicier! The cubana had too much meat and was dry compared to the al pastor. Also, I don't think hot dog slices should be in my sandwich, so I wouldn't order the cubaba again. The tortas are huge, so share with friends if you don't have a big appetite. We split 2 among 4 people and I was stuffed!", "rating": 3, "date": "2011-07-31"}, {"excerpts": ["i got a cubana torta and good lord ", "this thing was epic. "], "author": "Dan C.", "review": "my girlfriend brought me here a month ago and i was skeptical. i'm more of a burrito guy, even a quesadilla or nachos get my vote before tortas. but i'm always willing to try new things. and i'm glad i did....i got a cubana torta and good lord this thing was epic. it comes packed with FOUR kind of meat...ham, turkey, carnitas-esque pork and hot dog. yes, hot dog. at that moment in time while i was eating my sandwich my whole mind, body and existence were centered around this most legendary of legendary foods. if there was a culinary embodiment of the term \"wins\" it was this torta. oh and their horchata is the best i've ever had. they make it fresh on the spot in the blender, it's not sitting in some container all day, so it's real rich and frothy. pure excellence.", "rating": 5, "date": "2007-11-16"}], "pollo en mole": [], "queso de puerco": [], "turkey": [{"excerpts": ["It sounds like the most un-Latino thing on their menu, but the Turkey Torta is really good. ", "So are a lot of the other Tortas. ", "It's got an old school cafeteria/diner feel inside, and the staff is friendly and efficient. "], "author": "Rusty H.", "review": "It sounds like the most un-Latino thing on their menu, but the Turkey Torta is really good. So are a lot of the other Tortas. It's got an old school cafeteria/diner feel inside, and the staff is friendly and efficient. One of my favorite places on 24th.\n\nProTip: Don't order at the register. Sit down at a table, there are menus there, and someone will come take your order.", "rating": 5, "date": "2018-10-26"}, {"excerpts": ["my friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). ", "we called it a man sandwich. ", "hahaah it looked pretty much like a cholesterol packed torta. ", "he said it was good ", "but it looked like there was a hot dog in it too. ", "i think if you have a weak heart, you shouldnt get this. "], "author": "Lina O.", "review": "after walking around mission district, admiring all the murals, my friends and i started to get hungry. one of my friends, who is a SF native and recently moved back home after living on the east coast for the past few years, had said something like \"i think i remember this place having a really good mole\". it looks like a random hole in the wall and im really not sure if it really was the place she was thinking about, or if we had just stumbled upon another hidden gem.\n\nits a small homey restaurant with counter seating and a few tables. the owner and other workers were very friendly, and even offered to take a group pic of us, without us even asking or hinting. \n\ni ordered the carne asada torta. it came on what looked like a whole wheat bun (!) with refried beans, avocado, queso fresco, onions, mayo and jalapenos or chipotle. i got the junior size which was a pretty good size torta. i wonder how big the regular size is then.\n\nmy friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). we called it a man sandwich. hahaah it looked pretty much like a cholesterol packed torta. he said it was good but it looked like there was a hot dog in it too. i think if you have a weak heart, you shouldnt get this. ahha\n\nmy other friend ordered the chile relleno and the taco placero (with your choice of meat, queso fresco, avocado and nopales). i forgot what kind she got but the owner offered to put two different kinds split on the taco since it was so big. in the menu it says its an XXL taco. its basically a really huge taco on a homemade tortilla. my friend is vegetarian so he made her a meatless taco. im not sure what was in it but it looked really good. the chile relleno was a red sauce kind. it was lightly battered and cheesy in the inside. you could taste the cheese and the chile. it was really good. not heavy at all.\n\nmy other friend got two tacos, i think the chicken and carnitas. they were small tacos, so i think two or three would be a good amount to get. \n\nmy friends ordered mexican hot chocolate, which tasted like rich chocolate with a little cinnamon in it. i ordered a strawberry agua fresca. it was so good! it was like eating a fresh juicy strawberry. \n\nthe owner said that his restaurant was featured in 3 different SF magazines and even had a \"people on yelp love us!\" sticker in the window :) he was super nice and even offered to let us pay our bill separately. my friend that lives in SF says that the mexican food in SF is nothing like what we have in LA, but this place was pretty good. i'd definitely recommend this place, just make sure you get there before they close. they close at 4PM on saturdays and sundays!\n\ni left a gordita", "rating": 5, "date": "2010-12-22"}, {"excerpts": ["What a crazy sandwich that thing is...pork, turkey , hot dogs...you name it.   ", "It was yummy and deadly all at the same time.   ", "I foresee many trips to the Gorda in my future.   ", "I think the next trip will involve a breakfast torta.    ", "Should be good times...."], "author": "Scott W.", "review": "This is one of my favorite spots so far in my new home.   I've always been a fan of the Torta, but this place is a whole other level.   \n\nThe first time I went in there it was during the lunch rush and it was quite busy.   It took 15 minutes or so to get my sammich, which is excessive, but again, it was busy so I just chilled up at the counter.   The lady who took my order was friendly despite being pretty overwhelmed with annoying customers....\n\nOn that note, let me just say that I hate white people.   I know, I know...I'm white...but believe me, I hate myself too.   If your new age hippy diet isn't in line with what's on the menu, go somewhere else.  Don't waste the staff's time with a barrage of questions about the ingredients and then expect them to build you a custom tie-dyed torta for you and your fellow Berkeley faculty members.  I'm a hater.  I know.\n\nBack to the Gorda.    Fabulous.   My first sammy was a carne asada and i was a happy little clam.    One thing to note:  They offer both \"Junior\" and \"Regular\" size tortas.  Since I'm a wannabe, I order the regular and so far have not made it trhough more than 3/4 of a sandwich.  Apparently I'm not a boy, but not yet a man.   \n\nMy second trip I had to try the Cubano.  What a crazy sandwich that thing is...pork, turkey , hot dogs...you name it.   It was yummy and deadly all at the same time.   I foresee many trips to the Gorda in my future.   I think the next trip will involve a breakfast torta.    Should be good times....", "rating": 5, "date": "2008-02-25"}, {"excerpts": ["it comes packed with FOUR kind of meat...ham, turkey, carnitas-esque pork and hot dog. ", "yes, hot dog. ", "at that moment in time while i was eating my sandwich my whole mind, body and existence were centered around this most legendary of legendary foods. ", "if there was a culinary embodiment of the term \"wins\" it was this torta. ", "oh and their horchata is the best i've ever had. ", "they make it fresh on the spot in the blender, it's not sitting in some container all day, so it's real rich and frothy. ", "pure excellence."], "author": "Dan C.", "review": "my girlfriend brought me here a month ago and i was skeptical. i'm more of a burrito guy, even a quesadilla or nachos get my vote before tortas. but i'm always willing to try new things. and i'm glad i did....i got a cubana torta and good lord this thing was epic. it comes packed with FOUR kind of meat...ham, turkey, carnitas-esque pork and hot dog. yes, hot dog. at that moment in time while i was eating my sandwich my whole mind, body and existence were centered around this most legendary of legendary foods. if there was a culinary embodiment of the term \"wins\" it was this torta. oh and their horchata is the best i've ever had. they make it fresh on the spot in the blender, it's not sitting in some container all day, so it's real rich and frothy. pure excellence.", "rating": 5, "date": "2007-11-16"}], "vegtearian": [], "mole poblano": [{"excerpts": ["The chef/owner/server had to pause and make sure we really did want a plate of the mole poblano, 3 kinds of quesadilla, the carne asada huraches, AND the chile relleno.  ", "For the three of us.\n", "Um, yes.  ", "And that was us practicing restraint.  \n", "I'm just not much of a sandwich person, but if I were, I'm sure I'd be all over these l-o-a-d-e-d tortas.  ", "Happily La Torta Gorda does way more...breakfasts, lunch/dinner platters of some of the most fantastic mexican food I've had.  \n", "Mole is no joke....there's some 20 ingredients in that stuff? ", "Easy to be too sweet, or too thick, or too flavorless.  ", "La Torta Gorda's is right up there with the best with a rich color, and deeply layered tangy flavor.  ", "This is like grandma's-secret-recipe good.  ", "That, and the quesadillas were just stand-out amazing to me, though the other entrees we got were good, too.  ", "The hand-made corn tortillas were thick, crusty and made everything stuffed into them that much better.\n", "It just kinda sucks that they close so early!  ", "I often don't get out of work before they close at 7", "? 8?  \n", "Still - I'm jonesing to go back. ", "There's still the chilaquiles to try....and the huevos divorciados....", "OOH the enchilades, the ENCHILADES....and the sopas...."], "author": "CINDY K.", "review": "The chef/owner/server had to pause and make sure we really did want a plate of the mole poblano, 3 kinds of quesadilla, the carne asada huraches, AND the chile relleno.  For the three of us.\nUm, yes.  And that was us practicing restraint.  \nI'm just not much of a sandwich person, but if I were, I'm sure I'd be all over these l-o-a-d-e-d tortas.  Happily La Torta Gorda does way more...breakfasts, lunch/dinner platters of some of the most fantastic mexican food I've had.  \nMole is no joke....there's some 20 ingredients in that stuff? Easy to be too sweet, or too thick, or too flavorless.  La Torta Gorda's is right up there with the best with a rich color, and deeply layered tangy flavor.  This is like grandma's-secret-recipe good.  That, and the quesadillas were just stand-out amazing to me, though the other entrees we got were good, too.  The hand-made corn tortillas were thick, crusty and made everything stuffed into them that much better.\nIt just kinda sucks that they close so early!  I often don't get out of work before they close at 7? 8?  \nStill - I'm jonesing to go back. There's still the chilaquiles to try....and the huevos divorciados....OOH the enchilades, the ENCHILADES....and the sopas....", "rating": 4, "date": "2010-09-11"}], "enchiladas poblanas": [], "mixiotes de pollo": [], "chile relleno": [{"excerpts": ["Considering my weakness for chile relleno this was really not fair. ", "I'm not sure you could find a better sandwich for my target demographic of chile relleno lovers.\n\n", "If you aren't into chile relleno this might not be your thing. ", "I got the jr size "], "author": "Jean K.", "review": "With Best Sandwiches of the Mission (http://www.seriouseats.com/2013/10/the-nine-best-sandwiches-period-in-the-missio.html) they had me at roasted poblano peppers, cheese and cheese for the Rajas con Queso. Considering my weakness for chile relleno this was really not fair. I'm not sure you could find a better sandwich for my target demographic of chile relleno lovers.\n\nWeekday mornings the place is pretty quiet. Small clean joint with a long countertop. Friendly peeps. Relaxing atmosphere. Good start.\n\nOf course the sandwich was yummy. And unlike any other sandwich I've had in terms of ingredients. But like I said, I'm the target demographic. If you aren't into chile relleno this might not be your thing. I got the jr size and I don't recommend getting the bigger one unless you're super hungry because in this case jr size is like a normal sized sandwich that you can finish for lunch.\n\nI noticed some signs saying they were on the 7x7 list of things to eat so I asked them what sandwich it was for. Turns out it's the pierna enchilada. Though I said I would be back to try it seriously I'm not sure if I can resist ordering the Rajas Con Queso again.", "rating": 4, "date": "2013-10-27"}, {"excerpts": ["Patty and I dug into that delicious Chile Relleno ($9.45) served with rice and beans. ", "It was stuffed with (cotija?) ", "cheese and swimming in tasty sauce!  ", "Tortillas are provided with this dish so you can sop up the saucy goodness.  ", "The rice and bean portions are on the smaller side. "], "author": "Janice C.", "review": "* 4.5 stars *\n\nI get excited easily.\n\nWhen the brilliant Patty P came up with the idea of getting together for lunch so we can cross off another item on the Big Eat SF list, I wanted to respond with something cool, but can only come up with \"YAY!\"\n\nOn the 7 x 7 list is:\n\n#39 Pierna Enchilada from La Torta Gorda\n\nI love how this place is casual and homey.  Spanish music playing in the background, there's counter seating available, fresh juices in their big containers on your left when you walk in.\n\nI was sipping on my sweet cantaloupe juice while looking at the menu and noticed that a lot of the names are in Spanish.  (you know this place has got to be authentic) Our server was more than happy to help us with the translation.\n\nPatty and I dug into that delicious Chile Relleno ($9.45) served with rice and beans. It was stuffed with (cotija?) cheese and swimming in tasty sauce!  Tortillas are provided with this dish so you can sop up the saucy goodness.  The rice and bean portions are on the smaller side. (or maybe I'm just so used to seeing rice and beans that fill up half my plate?)\n\nThat torta was akin to a sammy, but this one didn't leave me hungry two hours later. It must be from the avocado, refried beans, queso freso, mayo , onions and jalapeno that filled the torta.  The tender pork just pulled everything together. I now think that torta translates to \"so good\" in English. Get the junior size for $5.45 and it's enough to tide you over til the next meal. \n\nIf the affordable prices and the good food here don't get you excited, then you my friend, are just hopeless.", "rating": 4, "date": "2009-08-26"}, {"excerpts": ["my other friend ordered the chile relleno and the taco placero (with your choice of meat, queso fresco, avocado and nopales). ", "i forgot what kind she got but the owner offered to put two different kinds split on the taco since it was so big. ", "in the menu it says its an XXL taco. ", "its basically a really huge taco on a homemade tortilla. ", "my friend is vegetarian ", "so he made her a meatless taco. ", "i", "m not sure what was in it ", "but it looked really good. ", "the chile relleno was a red sauce kind. ", "it was lightly battered and cheesy in the inside. ", "you could taste the cheese and the chile. ", "it was really good. "], "author": "Lina O.", "review": "after walking around mission district, admiring all the murals, my friends and i started to get hungry. one of my friends, who is a SF native and recently moved back home after living on the east coast for the past few years, had said something like \"i think i remember this place having a really good mole\". it looks like a random hole in the wall and im really not sure if it really was the place she was thinking about, or if we had just stumbled upon another hidden gem.\n\nits a small homey restaurant with counter seating and a few tables. the owner and other workers were very friendly, and even offered to take a group pic of us, without us even asking or hinting. \n\ni ordered the carne asada torta. it came on what looked like a whole wheat bun (!) with refried beans, avocado, queso fresco, onions, mayo and jalapenos or chipotle. i got the junior size which was a pretty good size torta. i wonder how big the regular size is then.\n\nmy friend ordered the mega cubana (milanesa, sausage, pierna, ham, chorizo, fried egg, turkey, queso fresco and american cheese). we called it a man sandwich. hahaah it looked pretty much like a cholesterol packed torta. he said it was good but it looked like there was a hot dog in it too. i think if you have a weak heart, you shouldnt get this. ahha\n\nmy other friend ordered the chile relleno and the taco placero (with your choice of meat, queso fresco, avocado and nopales). i forgot what kind she got but the owner offered to put two different kinds split on the taco since it was so big. in the menu it says its an XXL taco. its basically a really huge taco on a homemade tortilla. my friend is vegetarian so he made her a meatless taco. im not sure what was in it but it looked really good. the chile relleno was a red sauce kind. it was lightly battered and cheesy in the inside. you could taste the cheese and the chile. it was really good. not heavy at all.\n\nmy other friend got two tacos, i think the chicken and carnitas. they were small tacos, so i think two or three would be a good amount to get. \n\nmy friends ordered mexican hot chocolate, which tasted like rich chocolate with a little cinnamon in it. i ordered a strawberry agua fresca. it was so good! it was like eating a fresh juicy strawberry. \n\nthe owner said that his restaurant was featured in 3 different SF magazines and even had a \"people on yelp love us!\" sticker in the window :) he was super nice and even offered to let us pay our bill separately. my friend that lives in SF says that the mexican food in SF is nothing like what we have in LA, but this place was pretty good. i'd definitely recommend this place, just make sure you get there before they close. they close at 4PM on saturdays and sundays!\n\ni left a gordita", "rating": 5, "date": "2010-12-22"}, {"excerpts": ["The chef/owner/server had to pause and make sure we really did want a plate of the mole poblano, 3 kinds of quesadilla, the carne asada huraches, AND the chile relleno.  ", "For the three of us.\n", "Um, yes.  ", "And that was us practicing restraint.  \n", "I'm just not much of a sandwich person, but if I were, I'm sure I'd be all over these l-o-a-d-e-d tortas.  ", "Happily La Torta Gorda does way more...breakfasts, lunch/dinner platters of some of the most fantastic mexican food I've had.  \n", "Mole is no joke....there's some 20 ingredients in that stuff? ", "Easy to be too sweet, or too thick, or too flavorless.  ", "La Torta Gorda's is right up there with the best with a rich color, and deeply layered tangy flavor.  ", "This is like grandma's-secret-recipe good.  ", "That, and the quesadillas were just stand-out amazing to me, though the other entrees we got were good, too.  ", "The hand-made corn tortillas were thick, crusty and made everything stuffed into them that much better.\n", "It just kinda sucks that they close so early!  ", "I often don't get out of work before they close at 7", "? 8?  \n", "Still - I'm jonesing to go back. ", "There's still the chilaquiles to try....and the huevos divorciados....", "OOH the enchilades, the ENCHILADES....and the sopas...."], "author": "CINDY K.", "review": "The chef/owner/server had to pause and make sure we really did want a plate of the mole poblano, 3 kinds of quesadilla, the carne asada huraches, AND the chile relleno.  For the three of us.\nUm, yes.  And that was us practicing restraint.  \nI'm just not much of a sandwich person, but if I were, I'm sure I'd be all over these l-o-a-d-e-d tortas.  Happily La Torta Gorda does way more...breakfasts, lunch/dinner platters of some of the most fantastic mexican food I've had.  \nMole is no joke....there's some 20 ingredients in that stuff? Easy to be too sweet, or too thick, or too flavorless.  La Torta Gorda's is right up there with the best with a rich color, and deeply layered tangy flavor.  This is like grandma's-secret-recipe good.  That, and the quesadillas were just stand-out amazing to me, though the other entrees we got were good, too.  The hand-made corn tortillas were thick, crusty and made everything stuffed into them that much better.\nIt just kinda sucks that they close so early!  I often don't get out of work before they close at 7? 8?  \nStill - I'm jonesing to go back. There's still the chilaquiles to try....and the huevos divorciados....OOH the enchilades, the ENCHILADES....and the sopas....", "rating": 4, "date": "2010-09-11"}, {"excerpts": ["May I have a chile relleno torta, no red sauce, extra green sauce, extra jalapenos...\" and so on. ", "What's that you say? ", "You'll deliver these delectable, cranium sized heart stoppers? ", "I would marry this place if I could."], "author": "Emma G.", "review": "This place is heaven on earth! The tortas are freakin amazing. The guy that works the counter is always very nice. They make special concessions for my persnickety vegetarian tendency. \"May I have a chile relleno torta, no red sauce, extra green sauce, extra jalapenos...\" and so on. What's that you say? You'll deliver these delectable, cranium sized heart stoppers? I would marry this place if I could.", "rating": 5, "date": "2010-02-11"}], "tostadas de tinga": []}