{"vegetable egg rolls": [], "chicken rolls": [{"excerpts": ["it took over an hour, and they never even did bring us those chicken rolls we ordered..."], "author": "erica r.", "review": "very disappointing. it's hard for thai food to be bad, but they managed... the pumpkin and chicken in the pumpkin and chicken curry were both very hard. the beef pad see ew was, well, eeew. it literally had no flavor. we had to pour the curry sauce over the beef dish for it to taste like anything at all. and the beef was chewy and gross. on top of it, service was slow.. it took over an hour, and they never even did bring us those chicken rolls we ordered...", "rating": 2, "date": "2007-08-30"}], "fried fish cakes": [{"excerpts": ["not fresh\n Fried Fish Cakes - little too overcooked and small portion\n\nFood was mediocore.  "], "author": "Doraemon T.", "review": "This review is strictly for the Happy Hour.  I must agree, that this place has a pretty good happy hour menu.  Price is $3.95 for appetizers and well drinks, draft beer, house wine $3.50.  Came here cuz a friend wanted to meet up.  It is fairly close to the Civic Center Bart Station.  \n\nI agree with other yelpers...the price vs the portions are just not equivalent.  Been to other happy hours where the price is good and the portions are good.  Nothing we ordered really stood out in terms of taste.  \n\nOrdered:\n\n Corn Fritters -- Little too fried\n Shrimp Rolls - Too small of a portion\n Grilled & Fried Calamari - Fried was a little too sweet, grilled was just ok\n Silver Noodle Salad - way too salty\n Fish Balls - Nothing too special.  Can make this at home\n Chicken Sate - portion was ridiculous\n Half a grilled Chicken - moist, but a little too sweet\n Spicy Raw Shrimp (A.K.A Naked Shrimp at some Thai Places) -- shrimp was def. not fresh\n Fried Fish Cakes - little too overcooked and small portion\n\nFood was mediocore.  The only reason I gave this place 3 stars was because of the Lychee Martini. This was the only thing that stood out the whole night.  Considering the location that it's in with the small portions of food, I really doubt I would return.", "rating": 3, "date": "2011-11-18"}, {"excerpts": ["The fried fish cakes were no good either.. and it cost me 20 dollars!!!!! ", "For an app and an entree??? ", "Do Not waste your money at Lalita Thai.(peiod)"], "author": "Stephfon B.", "review": "It was dark and wednesday. Was getting ready to party.. I was damn hungry. I live in the TL.. I'm po' I got pad thai and it was bland and expensive! The fried fish cakes were no good either.. and it cost me 20 dollars!!!!! For an app and an entree??? Do Not waste your money at Lalita Thai.(peiod)", "rating": 1, "date": "2010-03-04"}], "crispy pumpkin": [{"excerpts": ["Crispy pumpkin app is amazing...as is the Panang curry.  ", "I would give it five stars except the place ", "smells awful because they have an overgrown fish pond in the corner.  ", "Once the food comes, you don't notice really, but before that...yuck."], "author": "John Z.", "review": "Best Thai food I've found in San Fran.  Crispy pumpkin app is amazing...as is the Panang curry.  I would give it five stars except the place smells awful because they have an overgrown fish pond in the corner.  Once the food comes, you don't notice really, but before that...yuck.", "rating": 4, "date": "2012-04-02"}], "crispy tofu yam and taro root": [], "crispy mushrooms": [], "crispy chicken wings": [], "crispy jumbo softshell crab": [], "grilled calamari skewers": [], "sate chicken skewers": [], "salt and pepper rib eye beef strips": [], "fresh rolls with tofu": [], "special deluxe": [], "vegetable soup": [], "tom kha  coconut soup": [], "tom yum  spicy and sour soup": [], "tom yum or tom kha": [], "green papaya salad": [], "minced chicken salad": [{"excerpts": ["Salads: \nThe spicy minced chicken salad and especially the grilled prawns w/ spicy papaya salad impressed the hell out of my wife. "], "author": "David L.", "review": "This place is a great restaurant for pre theater dining. It is a short walk to either the Orpheum or the Golden Gate. Just let them know you are going to see the show and you will be out in plenty of time. \n\nNow the food: \nWe have eaten here twice and everything is very good. I would like to make a meal of only appetizers next time as they are truly tasty. The fried calamari with sweet & sour sauce is a huge portion even for two. It is very well prepared. Not at all spicy, but great flavor. The salt & pepper beef strips with cashews and fried basil is better than the calamari. Next time I'm going for the corn fritters....\n\nSalads: \nThe spicy minced chicken salad and especially the grilled prawns w/ spicy papaya salad impressed the hell out of my wife. She had these on different occasions and is a fan. \n\nEntrees: \nThe basil krapow w/ pork was good, but the pad kee mao w/ chicken was better. The grilled rib eye is also very good if you want something \"not so Thai\". \n\nThe service is friendly and the decor is very colorful. Happy Hour on Friday nights is pretty loud due to all the students blowing off steam.... \n\nThis is another keeper!", "rating": 4, "date": "2011-06-13"}], "minced duck salad": [], "grilled prawns salad": [], "minced chicken and prawns with silver noodle salad": [], "grilled seafood or grilled prawns with green papaya salad": [], "crispy jumbo softshell crab salad": [], "bbq half chicken": [{"excerpts": ["Went on a quiet evening for dinner and ordered the bbq half chicken - and it was die for...", "I couldn't believe chicken could taste so good. ", "Bravo!"], "author": "Tiberius A.", "review": "For me this joint is a diamond in the rough - literally.  Its location isn't the greatest or prettiest, but the food I found to be great.  Further the layout of the restaurant is a bit weird but the drinks and menu items is better than good.  Went on a quiet evening for dinner and ordered the bbq half chicken - and it was die for...I couldn't believe chicken could taste so good. Bravo!", "rating": 4, "date": "2008-07-06"}], "grilled duck": [{"excerpts": ["I was going to give it three stars because although service was slow and the food was expensive and I asked for no bean sprouts in my pad thai and there were bean sprouts in my pad thai, the food was tasty...until I got home and found out that the waitress did not pack all the leftovers from my grilled duck dish.  "], "author": "C L.", "review": "I was going to give it three stars because although service was slow and the food was expensive and I asked for no bean sprouts in my pad thai and there were bean sprouts in my pad thai, the food was tasty...until I got home and found out that the waitress did not pack all the leftovers from my grilled duck dish.  She left out the steamed vegetables, which for $14 for the dish, I think she should have packed.\n\nNot going back again.", "rating": 2, "date": "2014-08-26"}, {"excerpts": ["My grilled duck was tasty. ", "Tasty like, it tasted flame grilled. ", "Flame grilled as in, like Burger King. ", "What I mean to say is that I was eating \"duck\" and thought the whole time it was actually a whopper from BK."], "author": "Emily D.", "review": "My grilled duck was tasty. Tasty like, it tasted flame grilled. Flame grilled as in, like Burger King. What I mean to say is that I was eating \"duck\" and thought the whole time it was actually a whopper from BK.", "rating": 3, "date": "2011-04-29"}], "grilled rib eye steak": [], "grilled lamb chops": [], "grilled scallops": [], "grilled dancing jumbo prawns stuffed": [], "thai fried rice with chicken beef pork or tofu": [], "basil chicken fried rice": [], "basil duck fried rice": [], "thai fried rice topped with crispy chicken or crispy pork": [], "thai fried rice with prawns or seafood": [], "tofu and vegetables": [{"excerpts": ["The green curry and Pad Kee Mao (both with tofu and vegetables) were surprisingly good.  "], "author": "Mee-Sun Y.", "review": "GOOD FOOD + FULL BAR = Perfect after a long day at work.\n\nWe wanted to grab some food and a drink before watching Wicked, and we happened to park right in front of this restaurant (it's a block away from the Orpheum).  I tried using an iPhone to Yelp the place, but alas the 3G was too slow for me.  But we saw that it was a restaurant with a bar... so we went in anyways.\n\nIn short:\n+ Pretty decent Thai food!  \n+ Great portions for our appetites (we didn't even finish).\n+ Easy access to the full bar.  Strong mojitos.\n- Don't get a Mai Tai, it's like spiked Robitussin.\n\nDetails:\nWe sat at the small tables right next to the bar, and the food and drinks were served pretty fast.  The green curry and Pad Kee Mao (both with tofu and vegetables) were surprisingly good.  I might have to take my extreme hunger and low expectations into account, but everything tasted fresh and authentic.\n\n(By the way, we were able to find parking really easily on Leavenworth RIGHT next to the restaurant.  Good place to look if you're headed to the Orpheum for an evening show.)", "rating": 4, "date": "2009-02-06"}, {"excerpts": ["The food was average/good; I has spring rolls and tofu and vegetables with peanut sauce, he had deep fried calamari and seafood clay pot. ", "It's a bit higher priced than many Thai places with most entrees at $10.50 and up, given the unexceptional quality. ", "I did like the enormous jungle mural, though."], "author": "Amy E.", "review": "My dining companion and I went there after a late Thursday visit to the nearby Asian Art Museum. The food was average/good; I has spring rolls and tofu and vegetables with peanut sauce, he had deep fried calamari and seafood clay pot. It's a bit higher priced than many Thai places with most entrees at $10.50 and up, given the unexceptional quality. I did like the enormous jungle mural, though.", "rating": 3, "date": "2005-11-04"}], "fish balls and pork": [], "bbq pork and wonton": [], "combination beef": [], "tom yum seafood": [{"excerpts": ["I got the Tom Yum seafood noodle soup today. ", "I rarely not like Tom yum and this place just about to push me over the edge! ", "They messed up my favorite"], "author": "Kris J.", "review": "Food is always consistently ok, nothing that impresses me. No dish stands out where I'm like oooo ahhhh I will come back, not here. If you're looking for a quick lunch, come here. They are quick and customer service is always good, just wish the food can get better too. \n\nI would def pick the lunch special over their soup. I got the Tom Yum seafood noodle soup today. I rarely not like Tom yum and this place just about to push me over the edge! They messed up my favorite", "rating": 3, "date": "2018-05-16"}], "sticky rice wrapped": [], "roti  flat bread": [], "steamed egg noodles": [], "fried egg": []}