{"tohm kah kai": [], "kang lieng": [], "noodle soup": [{"excerpts": ["The seafood noodle soup was just as bad. ", "No flavor other than the onion pieces. ", "Seafood was chewy and bland.\n", "I would give it a negative rating if I could."], "author": "Henry T.", "review": "Can't believe people still eat here. There was only 6 other people eating here before we sat down. It took 10 minutes to get our drinks. 30 Minutes to get our first soup. Over 40 minutes to finally get our food. Serve only checked in on us once to apologize for the wait but there was no reason for a wait in the first place. \nThai ice tea was watered down and just tasted like sugar water. Ordered the Pad Thai with prawns combo which tasted like soy sauce vermicelli noodle and only came with \"one\" tiny shirmp. Some weird tasting chicken in a very pasty clumpy sweet sauce that looks like curry sauce. Soup was luke warm and flavorless. The seafood noodle soup was just as bad. No flavor other than the onion pieces. Seafood was chewy and bland.\nI would give it a negative rating if I could.", "rating": 1, "date": "2017-06-16"}, {"excerpts": ["special noodle dish today was the chicken curry noodle soup.\n", "WOW!\n", "wider egg noodles in a curry broth that was incredibly awesome.\n", "think about the best yellow chicken curry you've ever had and turn the curry sauce into a curry soup.\n", "here it is.\n", "order it and walk away completely satisfied."], "author": "Jeff W.", "review": "special noodle dish today was the chicken curry noodle soup.\nWOW!\nwider egg noodles in a curry broth that was incredibly awesome.\nthink about the best yellow chicken curry you've ever had and turn the curry sauce into a curry soup.\nhere it is.\norder it and walk away completely satisfied.", "rating": 4, "date": "2008-10-25"}, {"excerpts": ["The egg rolls were great, but the yellow curry and the noodle soup (tried looking for the name, couldn't find it) were pretty bland. ", "I definitely had better Thai, but the service and price made up for lack of flavor."], "author": "B B.", "review": "Five stars for service\n\nFive stars for price\n\nFive stars for variety\n\nThree stars for flavor\n\nRarely are we in the Sunset, but we had an oil change to take care of and a Thai craving to satisfy. This was the closest Thai place to the oil change and four stars on Yelp didn't hurt. The place was nearly empty when we arrived, so we were promptly seated. The older guy was super nice and cheery and made sure we were taken care of throughout the meal. The egg rolls were great, but the yellow curry and the noodle soup (tried looking for the name, couldn't find it) were pretty bland. I definitely had better Thai, but the service and price made up for lack of flavor.", "rating": 4, "date": "2010-02-16"}, {"excerpts": ["The food is reasonably good -- my favorites are the noodle soup and their thai iced tea."], "author": "C C.", "review": "Service is the winning quality at Lanna Thai.  The friendly husband-wife team is so cute!  They're actually Thai, which is refreshing since all the other restaurants on Noriega Street are Chinese-operated.  The food is reasonably good -- my favorites are the noodle soup and their thai iced tea.", "rating": 4, "date": "2010-02-19"}, {"excerpts": ["I ordered the curry noodle soup. ", "At first, I thought the curry and the coconut juice would be over-powering, but it was absolutely not. ", "Not to mention, our meals came with a complimentary soup. ", "The owner was very nice. ", "Their prices are pretty cheap especially during their lunch specials. ", "My friend ordered their \"Special of the Day\" and it came with a small portion of Pad Thai, rice, and a peanut-tasting curry. ", "I had a try and it was delicious!"], "author": "Dianne I.", "review": "I absolutely enjoyed my first experience here. I ordered the curry noodle soup. At first, I thought the curry and the coconut juice would be over-powering, but it was absolutely not. Not to mention, our meals came with a complimentary soup. The owner was very nice. Their prices are pretty cheap especially during their lunch specials. My friend ordered their \"Special of the Day\" and it came with a small portion of Pad Thai, rice, and a peanut-tasting curry. I had a try and it was delicious!", "rating": 4, "date": "2009-01-04"}], "with chicken": [{"excerpts": ["We started with a hearty $6.95 bowl of Tohm Kah, the coconut milk soup with chicken, mushroom, baby corns, green onion, lemongrass and lemon juice (see photo). ", "Perfect starter on a cold night. ", "We went even more predictable with the $7.25 Pad Kee Mao, which offered the thick chow fun noodles mixed with chicken, broccoli and bok choy (see photo). \n\n"], "author": "Ed U.", "review": "Lanna is not a place I would have found on my own. San Francisco is not one city but a cluster of culinary micro-climates like the heavily Asian fog bank that makes up this stretch of Noriega in the Outer Sunset. My massage therapist (yes, I have one...sometimes...don't judge me!) recommended it to me a while ago, and he looks like a very healthy eater with a penchant for spicy Southeast Asian by way of his Malaysian-bred wife. So I convinced Jamie W. to make the trek with me to try it on an evening where we felt the need to try something healthy. We didn't accomplish \"healthy\", but we managed to have some surprisingly good eats for the drive. \n\nWe started with a hearty $6.95 bowl of Tohm Kah, the coconut milk soup with chicken, mushroom, baby corns, green onion, lemongrass and lemon juice (see photo). Perfect starter on a cold night. The $6.25 order of Chicken Satay came with a couple of skewers marinated in curry paste and accompanied by the all-critical peanut sauce with a nice consistency (see photo). Entrees were solid. We went even more predictable with the $7.25 Pad Kee Mao, which offered the thick chow fun noodles mixed with chicken, broccoli and bok choy (see photo). \n\nJamie went back to his Kentucky roots when he was drawn to the $8.50 Barbecue Chicken, which came with four big pieces slathered with a sweet curry sauce that wasn't too overwhelming (see photo). It didn't seem like a particularly Thai dish but who cares. We should have been sated, but we decided to try the desserts since we made room. The $2.75 Flan was delicious enough, but the standout was the $3.75 Fried Banana with Coconut Ice Cream. Fried with a crunchy crust and a nice contrast to the bracing coconut flavor of the ice cream (see photos). Definitely worth a trip out to the far reaches of the Sunset for us downtown types. \n\nFOOD - 4 stars...excellent Thai dishes, well priced \nAMBIANCE - 3.5 stars...compact place, could do without the lotto boards \nSERVICE - 3.5 stars...good though attention wavers when big parties come in \nTOTAL - 4 stars...barbecue chicken and fried bananas almost give this Thai place a country twang", "rating": 4, "date": "2011-01-04"}, {"excerpts": ["we ordered an extra cup since there were 3 of us)\nFish Cake Appetizer\nYellow Curry with Chicken\nGarlic Pork\nSteamed rice\n- Sauteed veggies with tofu (don't remember the name, it wasn't very memorable)\n\n"], "author": "Jenna H.", "review": "~3.5 Stars~\n\nWhile the food was tasty and delicious, their portions were a bit lacking. I didn't know if it was because we walked in 30 minutes before closing, but it seems from other reviews that we were not the only ones who felt this way. (I felt bad right before closing--but we spent all day moving into a place a couple blocks away so we were hungry and it was the only open closeby option)\n\nWE ORDERED:\n- $30 dinner for 2 set which included:\nTom Yum Soup (2 cups -- we ordered an extra cup since there were 3 of us)\nFish Cake Appetizer\nYellow Curry with Chicken\nGarlic Pork\nSteamed rice\n- Sauteed veggies with tofu (don't remember the name, it wasn't very memorable)\n\nTHE GOOD: \n+ Everything was tasty\n+ The Soup wasn't overly sour and I really enjoyed this\n+ The Curry flavor was very good\n+ I like the mom&pop service atmosphere\n+ Very friendly and fast to refill water\n\nTHE BAD:\n- Small portions and therefore not worth the price\n- Slow service getting food out (even though we were the ONLY people in the place)\n- Thai curry is made with coconut milk which gives it a thinner consistency than Chinese/Japanese Curry. I found it very odd that they served this on a plate instead of in a bowl, so it just spread out over the entire plate which made the amount of chicken seem very sparse and made it more difficult to spoon it onto the rice (very tasty though!).", "rating": 3, "date": "2015-02-05"}, {"excerpts": ["Pad Thai with Chicken\nPad Thai with Vegetables\n", "Pad Thai with Prawns\n"], "author": "Jason C. J.", "review": "Pad Thai with Chicken\nPad Thai with Vegetables\nPad Thai with Prawns\nPad Thai taste so good here.\n\nCurry this, \nCurry that,\nCurry Yellow, \nCurry Green, \nCurry spicy light me on fire,\nWhy didn't I order a Thai tea prior?\n\nI would walk by this place every morning on the way to work, it was always closed because I would walk by at 6am. I finally had a day off and decided to try it after reading the many Yelp reviews, hearing the mixed feelings from friends, and looking at the menu as I would wait for the 28 outbound bus. \n\nI'm glad I tried the food here because I think it may be my new lunch spot throughout the year on days off!\n\nSERVICE:\n\nImpeccable. Friendly. The waiter made sure that the cook would only cook the food with half the amount of oil normally used for making the Pad Thai. I like my rice noodles to be less crispy sometimes. \n\nATMOSPHERE: \n\nIf I ever go on a date, I would bring a date here OR come here with a small group of friends and family. \n\nUNTIL NEXT TIME!", "rating": 4, "date": "2014-01-02"}, {"excerpts": ["Today is Monday, so I had Monday's daily special which is Pad Thai & Panang Curry with Chicken. ", "Out of all the specials, I would say Monday's seemed the most appetizing to me, you get PAD THAI & PANANG CURRY WITH CHICKEN, a good deal to me since I probably would have gotten that anyways. ", "Both items were good. ", "Curry came with rice and pad thai was yummy too. ", "Out of all the specials, I would say Monday's seemed the most appetizing to me, you get PAD THAI & PANANG CURRY WITH CHICKEN, a good deal to me since I probably would have gotten that anyways. ", "Both items were good. ", "Curry came with rice and pad thai was yummy too. "], "author": "Kylie L.", "review": "Made a date with Mona C. last week for today. I chose the restaurant because I wanted something not too far from home or school, because I have school right after, night classes really suck. After reading and finding this on yelp (maybe half a year ago) I really really wanted to try this place, that's why it's been bookmarked FOREVER on yelp & Mozilla. I came here once before, but I think I came too early on a weekday for lunch, so ended up going elsewhere. I FINALLY had the chance to go today.\n\nI was reluctant to go because she always takes pictures of EVERYTHING, and it's so embarrassing...I guess it informs the yelp community by taking pictures of everything. I sometimes do that too, I wonder if it's embarrassing for others. She takes pics of the place and the FOOD. If I'm starving, she has to take a perfect picture (and the first shot is never good enough) of the food before anyone can eat, so I always try to mess it up by eating the food before she remembers to take a picture, I'm so evil. She even took a picture of my water today. It wasn't so embarrassing today, since there weren't many people.\n\nI looked at their website prior to coming and it showed that everyday had a special, except Sunday (I guess they rest on the Sabbath Day). Today for lunch, it wasn't crowded, only another group of people were there. \n\nToday is Monday, so I had Monday's daily special which is Pad Thai & Panang Curry with Chicken. Out of all the specials, I would say Monday's seemed the most appetizing to me, you get PAD THAI & PANANG CURRY WITH CHICKEN, a good deal to me since I probably would have gotten that anyways. Both items were good. Curry came with rice and pad thai was yummy too. Lots of variety for only $6.29.\n\nI would come back during other days to see what all the other specials are like.", "rating": 4, "date": "2009-10-05"}, {"excerpts": ["lunch special:  panang curry with chicken (6.25)\n-generic green onion and veggie soup: ok\n-curry pronounced, good flavored, chicken tender not tuff,  eggplant and pea kind of mushy, zuchinni and bamboo ", "shoots ok.\n", "-jasmine ", "rice generic, ", "ok though, lunch 3 stars. ", "regular menu probably 4\n"], "author": "Victor G.", "review": "Lanna thai has been around for ages. (saw it here decades ago. may have dined here once.)  the sunfaded wallpaper is a tell. this doesn't detach from the homespun ambience of lanna thai. an  annoyance is the  flatscreen constantly flashing pics and numbers of items on the menu.\n\nmany items on lunch special, hard to choose one.\n\nsampling: lunch special:  panang curry with chicken (6.25)\n-generic green onion and veggie soup: ok\n-curry pronounced, good flavored, chicken tender not tuff,  eggplant and pea kind of mushy, zuchinni and bamboo shoots ok.\n-jasmine rice generic, ok though, lunch 3 stars. regular menu probably 4\n(you get what you pay for for)\n\nleftovers:\n-service excellent,  refilled water 3 times, no msg problem, just thirst.\n-service leisurely, heartell it's mom & pop.\n-def return when i finish noreiga st.", "rating": 3, "date": "2011-05-27"}, {"excerpts": ["One more star for the Tom Kah Kai soup -- coconut milk-based soup with chicken, mushrooms, and baby corn -- which was very flavorful and definitely the best part of the meal. "], "author": "Justine M.", "review": "Disappointing overall -- I expected more from a place with a 4-star average. Got take-out from here today for lunch and felt that the portions were pretty small given the prices. The deep-fried tofu appetizer came with ~8 pieces ($5.45!), which was cold; however, one star goes to the peanut sauce that came with it on the side.\n\nOne more star for the Tom Kah Kai soup -- coconut milk-based soup with chicken, mushrooms, and baby corn -- which was very flavorful and definitely the best part of the meal. The Pad Thai came with 3 prawns and the rest was a clump of very dry noodles without much flavor: probably some of the worst I've had.\n\nI'd like to give a third star for the Rama Thai, as the combination of delicious peanut sauce, chicken, and spinach was excellent... the only problem was that the entire portion could be consumed in a few bites, which was disappointing (again) for the $7 it costs for that one \"special.\"\n\nGlad that there are plenty of other Thai restaurants around, as my search for a good one must continue.", "rating": 2, "date": "2013-10-12"}, {"excerpts": ["So we had the panang curry, yellow curry, fried calamari, pumpkin curry and one of the daily special with chicken, pad thai, and white rice.\n\n", "The yellow curry and panang curry were all right but the portions were so meager. ", "The pumpkin curry was pretty good with a lot of shrimp ", "but it could have used a little but more flavor.\n", "The fried calamari was pretty good too, just some simple salt and pepper.\n", "The yellow curry and panang curry were all right but the portions were so meager. ", "The pumpkin curry was pretty good with a lot of shrimp ", "but it could have used a little but more flavor.\n", "The fried calamari was pretty good too, just some simple salt and pepper.\n"], "author": "Wilson T.", "review": "So the 5 of us walked into the little restaurant and there were seats right away.\n\nIt is a really nice and cozy place. We tried a variety of curry and dishes. UNfortunately, they didn't have any fish cakes and stuffed chicken wings we asked for, both of which we really wanted to try.\nSo we had the panang curry, yellow curry, fried calamari, pumpkin curry and one of the daily special with chicken, pad thai, and white rice.\n\nThe yellow curry and panang curry were all right but the portions were so meager. The pumpkin curry was pretty good with a lot of shrimp but it could have used a little but more flavor.\nThe fried calamari was pretty good too, just some simple salt and pepper.\nThe pad thai was actually my favorite, and the chicken was my 2nd.\n\nWe also ordered fried banana, which was good except for the fact that they used regular butter in the batter. They should have used unsalted butter because it was really satly!\n\nAll in all, not a bad experience but you have to serve it up a little better to convince my parents to come back. At least I will come back to try the stuffed chicken wings.", "rating": 3, "date": "2012-08-05"}, {"excerpts": ["- Panang Curry with chicken was decent\n\nService was very friendly and good."], "author": "Coco L.", "review": "A small little place with decent Thai food.  It wasn't too packed for Sat. dinner.  My friend was able to get a table quickly\n\n- Rama Tofu was very good!\n- Panang Curry with chicken was decent\n\nService was very friendly and good.", "rating": 3, "date": "2009-10-12"}, {"excerpts": ["so i always order the Tom Kha Kai Soup with chicken. ", "The balance of all the spices combined and the way it smells, makes it #1 in my book from anywhere in the city. ", "As well as the Pad See Ew Noodles, the perfect amount of soy sauce and spices, it can be a bit on the sweet side, but i prefer it that way. \n", "The great thing about Lanna Thai is that they have a wide menu of dishes to choose from as well as Lunch and Dinner Specials and Plates! "], "author": "Mia G.", "review": "I am giving Lanna Thai 5 star because they are amazingggg!\nAlways very friendly and the food gets even better. \n\nI eat poultry so i always order the Tom Kha Kai Soup with chicken. The balance of all the spices combined and the way it smells, makes it #1 in my book from anywhere in the city. As well as the Pad See Ew Noodles, the perfect amount of soy sauce and spices, it can be a bit on the sweet side, but i prefer it that way. \nThe great thing about Lanna Thai is that they have a wide menu of dishes to choose from as well as Lunch and Dinner Specials and Plates! The price is very affordable as well.\n\nI am never let down, and i keep coming back for more. Send people their way, you will have a great experience and enjoy the food ever more!", "rating": 5, "date": "2012-11-16"}], "with prawn": [], "with seafood": [], "larb kai": [], "yum nuer": [], "yum khung": [], "som tum seafood": [], "deepfried tofu": [], "spicy angel wing": [], "deepfried prawn or calamari": [], "khung ka borg": [{"excerpts": ["We started with the Khung Ka Borg, then moved on to  the bbq chicken, yellow curry, Pad Thai Wonton, and Lanna Fried Rice. ", "WOW!!! ", "All excellent. ", "It's the kind of food you wake up craving in the middle of the night. ", "I would definitely go again."], "author": "Tricia S.", "review": "Best Thai I've had in a long time! I went with my dad and sister. We started with the Khung Ka Borg, then moved on to  the bbq chicken, yellow curry, Pad Thai Wonton, and Lanna Fried Rice. WOW!!! All excellent. It's the kind of food you wake up craving in the middle of the night. I would definitely go again.", "rating": 5, "date": "2011-01-27"}], "deepfried wonton": [], "combination appetizers": [], "mus sa mun curry": [], "sauted mixed vegetables": [], "sweet  sour with vegetables": [], "gaprow with vegetables spicy vegetables": [], "yellow curry with vegetables": [], "panang curry with vegetables": [], "green curry with vegetables": [], "rama thai with tofu": [], "vegetarian red curry": [{"excerpts": ["The food on the menu looked amazing and so reasonable (about $7-10 an entree) so we ordered the vegetarian red curry, seafood combo, Tomh Kah (medium size) and drinks for the both of us.  ", "more than Vegetarian Red Curry Panang.  ", "What the hell is wrong with this place??!!!.  \nThe next dish - Seafood Combo - looked better and tasted a bit better (less slim, more spice and a good amount of seafood - mussels, shrimp, and calamari) but obviously not better because I got up in the middle of the night to barf coloful pieces of green mussels and pink shrimp out!  ", "I should have known not to eat any of their food because my tongue tiggled the whole time (like when you eat too much sugar), which only happens to me when food is ladden with MSG.\n", "After all the crap we had to endure eating at this joint from hell (more like something you would find at a shady rest stop in middle america) we had to pay for it.  ", "The nice suprise came when we discovered that the shady bastard who runs this place (who had been very pleasant to us throughout the meal - though he never asked us how our food was because he already knew the answer) charged us $6 for the rice.  ", "To be honest, the rice was actually edible and was probably the most delicious part of our dinner.  ", "However, why the hell would you charge $6 for rice for two???? ", "I politely, being a timid sweet Asian girl I am, if there was a mistake with the pricing of the rice.  ", "To this, the waiter gave us a shady grin and said he charged us for two large rice ($3/each person).  ", "Uhhh...are you kidding me??? ", "What restaurant (besides Yuzu in the Marina - which charge about $3 for their delicious shitake rice), especially this shitty establishment, would dare charge $3 for two scoops of rice per person.  ", "Because of this manipulative move, each of our entrees were now $10-13 each, making it not in the one $ category.  \n", "Being so stupid, I sadly accepted this answer and walked meekly back to my table.  ", "We decided to give the guy a 10% tip, which we would never dare do anywhere else because my boyfriend and I have both worked in numerous restaurants (email me and I will give you the behind the scene descriptions of Liliana's, Castle Hill Inn and Resort, CJ's, and the Barking Crab, all in Rhode Island) and understand the importance of a tip.  \n", "As we were writing the tip, but owner creeped behind us in the shadows and pounced on the chech the moment we left the table - an obviously bold and rude move.  ", "We walked out of the restaurant and wanted to scream and throw up all the gross, dumpster - dived finds we just ate and paid for.  ", "All we could say to one another is ", "\"WHY????", "\" ", "Why would you have a restaurant where you microwave old crap and present it to customers and then charge them for it? ", "Why would you make disgusting food? ", "Aren't you embarassed or ashamed?? ", "I don't get it ", "and I guess I will never get an answer. ", "Do yourself a favor and go anywhere else ", "but here. ", "Igot fooled but you don't have to!\n", "P.S. photos are by owners!"], "author": "trang n.", "review": "My boyfriend and I went on Yelp last night looking for a new Thai restaurant because we were getting tired of Marnee Thai (which is our usual favorite Thai in the city).  Yelp had Lanna Thai rated at four stars and the reviews were overall very positive, so we thought \"why not?\".\nBIG FREAKIN MISTAKE!!!!\n\nThe first bad sign was the fact that the place was practically empty (one table of two leaving as we walked in), but we were both so hungry and we wanted to help support a wife/husband/brother/whatever family restaurant.  \n\nThe gentleman was polite and sat us near the window.  The food on the menu looked amazing and so reasonable (about $7-10 an entree) so we ordered the vegetarian red curry, seafood combo, Tomh Kah (medium size) and drinks for the both of us.  At this point we were very excited about the food, but still wondering why the place was empty.\n\nThe place was empty on a Saturday night because the food is PURE FILTHY GARBAGE!!!! As we sat there waiting patiently for our food, we could hear the beeping  and the opening of the microwave in the kitchen, which looked pretty filthy as well through the little hole in the wall where the food comes out of. \nWe got the soup, which consisted of congealed globs of coconut in a mustard colored soup base with onions and mushrooms and other random pieces of obviously recycled vegetables.  However, the combo of spicy sour tamarind and lemongrass with the smooth creaminess of coconut can never go wrong, so that dish was palatable.  However, the microwaving sounds made the experience eating this soup difficult.   \nThe next course that came was the panang red curry - which looked like wilted precooked and then microwaved crap vegetables in a maroon slim that WAS NOT FREAKIN PANANG.  I gavve my boyfriend a disgusted look but preceded to try it because I was not going to throw it away or send back food at a restaurant where I was the only one present.  It tasted worst than it looked!  The jelly like texture of the \"sauce\" and the melt-in-your-mouth texture of the \"vegetables\" made the dish more of baby food for babies in third world countries (I was born in Vietnam so I know what I am talking about!) more than Vegetarian Red Curry Panang.  What the hell is wrong with this place??!!!.  \nThe next dish - Seafood Combo - looked better and tasted a bit better (less slim, more spice and a good amount of seafood - mussels, shrimp, and calamari) but obviously not better because I got up in the middle of the night to barf coloful pieces of green mussels and pink shrimp out!  I should have known not to eat any of their food because my tongue tiggled the whole time (like when you eat too much sugar), which only happens to me when food is ladden with MSG.\nAfter all the crap we had to endure eating at this joint from hell (more like something you would find at a shady rest stop in middle america) we had to pay for it.  The nice suprise came when we discovered that the shady bastard who runs this place (who had been very pleasant to us throughout the meal - though he never asked us how our food was because he already knew the answer) charged us $6 for the rice.  To be honest, the rice was actually edible and was probably the most delicious part of our dinner.  However, why the hell would you charge $6 for rice for two???? I politely, being a timid sweet Asian girl I am, if there was a mistake with the pricing of the rice.  To this, the waiter gave us a shady grin and said he charged us for two large rice ($3/each person).  Uhhh...are you kidding me??? What restaurant (besides Yuzu in the Marina - which charge about $3 for their delicious shitake rice), especially this shitty establishment, would dare charge $3 for two scoops of rice per person.  Because of this manipulative move, each of our entrees were now $10-13 each, making it not in the one $ category.  \nBeing so stupid, I sadly accepted this answer and walked meekly back to my table.  We decided to give the guy a 10% tip, which we would never dare do anywhere else because my boyfriend and I have both worked in numerous restaurants (email me and I will give you the behind the scene descriptions of Liliana's, Castle Hill Inn and Resort, CJ's, and the Barking Crab, all in Rhode Island) and understand the importance of a tip.  \nAs we were writing the tip, but owner creeped behind us in the shadows and pounced on the chech the moment we left the table - an obviously bold and rude move.  We walked out of the restaurant and wanted to scream and throw up all the gross, dumpster - dived finds we just ate and paid for.  All we could say to one another is \"WHY????\" Why would you have a restaurant where you microwave old crap and present it to customers and then charge them for it? Why would you make disgusting food? Aren't you embarassed or ashamed?? I don't get it and I guess I will never get an answer. Do yourself a favor and go anywhere else but here. Igot fooled but you don't have to!\nP.S. photos are by owners!", "rating": 1, "date": "2009-02-01"}], "sauted delight chicken": [], "sweet and sour chicken": [], "cashew nut chicken": [], "lanna chicken available with tofu": [], "kai pad khing ginger chicken": [], "gaprow with eggplant spicy eggplant": [], "gaprow": [], "rama thai": [{"excerpts": ["I'd like to give a third star for the Rama Thai, as the combination of delicious peanut sauce, chicken, and spinach was excellent... the only problem was that the entire portion could be consumed in a few bites, which was disappointing (again) for the $7 it costs for that one \"special."], "author": "Justine M.", "review": "Disappointing overall -- I expected more from a place with a 4-star average. Got take-out from here today for lunch and felt that the portions were pretty small given the prices. The deep-fried tofu appetizer came with ~8 pieces ($5.45!), which was cold; however, one star goes to the peanut sauce that came with it on the side.\n\nOne more star for the Tom Kah Kai soup -- coconut milk-based soup with chicken, mushrooms, and baby corn -- which was very flavorful and definitely the best part of the meal. The Pad Thai came with 3 prawns and the rest was a clump of very dry noodles without much flavor: probably some of the worst I've had.\n\nI'd like to give a third star for the Rama Thai, as the combination of delicious peanut sauce, chicken, and spinach was excellent... the only problem was that the entire portion could be consumed in a few bites, which was disappointing (again) for the $7 it costs for that one \"special.\"\n\nGlad that there are plenty of other Thai restaurants around, as my search for a good one must continue.", "rating": 2, "date": "2013-10-12"}, {"excerpts": ["But it still took a Yelp review (KayJay's) to get me to try the Rama Thai. ", "WOW! ", "When I read the review, it got me in the mood for peanut sauce, but it was Sunday ", "so I went to some other Thai place nearby and had their peanut sauce chicken. ", "It was fine. ", "Today, I wound up going to Lanna, because I'm lazy like that. ", "Ordered the Rama. ", "Having the ability to compare it to yesterday's inferior peanut sauce made it even better! ", "I recommend you go somewhere else that you think is good, then come here. "], "author": "sina t.", "review": "I eat here a lot. A LOT. seriously. Twice in the past three days, and they were closed yesterday. (Closed on Sundays, take note)... My boyfriend and I love Thai food. And Lanna is a staple in our lives. But it still took a Yelp review (KayJay's) to get me to try the Rama Thai. WOW! When I read the review, it got me in the mood for peanut sauce, but it was Sunday so I went to some other Thai place nearby and had their peanut sauce chicken. It was fine. Today, I wound up going to Lanna, because I'm lazy like that. Ordered the Rama. Having the ability to compare it to yesterday's inferior peanut sauce made it even better! I recommend you go somewhere else that you think is good, then come here. You'll be impressed, I promise.\n\nOther goodies: bbq chicken (it's part of the daily lunch special), tom kah (doesn't look like other places', but it's still yummy), panang curry (duh), pad thai (isn't too sweet like a lot of places nowadays)... and so much more.\n\nThe service is always the same reliable guy who always recognizes you, or tries to, and never really remembers you. I like him. He's smiley and polite. He always asks me at the end of the meal if I want dessert and it's become a joke because I never save room, being the pig I am.\n\nThere're about a dozen tables. I've never seen it full, which is a shame. I want them to have great business so they'll always be there when I need them.", "rating": 4, "date": "2008-10-06"}], "garlic prawn": [], "lanna seafood": [], "sauted seafood delight": [], "chao taley": [], "chefs favorite fish panang chili sauce": [], "chefs favorite fish sweet  sour sauce": [], "gaprow khung spicy prawn": [], "spicy crispy fish": [{"excerpts": ["My boyfriend got the spicy crispy fish, he thought it was okay.  ", "I thought it was too salty and tasted really fishy like the fish had been sitting in the fridge for a while. \n", "We got the sampler appetizer. ", "The egg rolls were tiny but pretty good. "], "author": "Melinda M.", "review": "Meh.\nIt has potential. We came here craving Thai food and it had pretty good reviews. I guess if you like plain Thai food this is the place to go. But I love Thai because of its amazing flavored. I got the yellow curry. It wasn't gross, it was just alright. It tastes like something my mom could make. My boyfriend got the spicy crispy fish, he thought it was okay.  I thought it was too salty and tasted really fishy like the fish had been sitting in the fridge for a while. \nWe got the sampler appetizer. The egg rolls were tiny but pretty good. The chicken satay tastes like yellow curry and peanut sauce and the fried stuffed chicken was really weird. My boyfriend wouldn't even eat it after the first bite. The soup and the beginning was weird too. It reminded me of swimming pool water haha\n\nThe waiter was really nice but the service took a life time. We were there for over an hour. Waiting 20 minutes just for them to take our credit card. Eventually my boyfriend just went to the window and paid. \n\nLike I said its not terrible but I probably wouldn't eat there again. If I do for some reason I'd try the pad Thai next time. \n\nSuper cheap though so that's great. I guess.", "rating": 2, "date": "2013-07-10"}], "gaprow taley spicy seafood": [], "panang seafood": [], "kai yang bbq chicken": [], "thai style barbeque steak": [], "beef brochette": [{"excerpts": ["hub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) ", "w/ sauce & veggie on the side & an order of rice OR  ", "the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\n"], "author": "Cindi N.", "review": "stars are for the consistently good food, friendly service & reliability (explained below).\n\nhave been coming here for years!  this is a family owned (husband & wife) restaurant.  has a nice, cozy, homey feel -- just eat, no scene restaurant, .   we're always welcomed by the husband's friendly service.  once in a great while we get to say \"hi\" to the wife, when she's not busy cooking in the kitchen.  nice \"reliable\" restaurant in the sense that, if we're starving & we want to eat now, we know we don't have to wait to be seated, tables are readily available.  or we go here if we don't want to get dressed up & deal with the scene, cause there's absolutely no scene here....and we know what we're getting, our usual -- which is consistently good.\n\nour usual:\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  deilish, perfect combination -- all compliment each other well.........bbq chicke is very tasty.  note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but i like it & appreciate that lanna has its own flavor..........\n\nhub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) w/ sauce & veggie on the side & an order of rice OR  the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\noccassionally we've ordered:\n- deep-fried calamari tossed w/ garlic, salt & pepper, carrot, red onion, cilantro & green onion........one of our favorite deep-fried calamari, tasty, spicy, a bit on the salty side.....\n- thai iced tea -- nothing special\n\nwe've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........i remember i thought they all tasted good.........but the past 8 - 10 years i've stuck to the usual & happy with that............i  go there specifically cause i'm craving the usual.......\n\ni'll have to agree w/ the other reviews -- they do have one of the best peanut sauce.  used to buy a jar of peanut sauce to take home & dip bbq chicken or add to a bbq chicken sandwich (asian/thai style).", "rating": 4, "date": "2007-07-25"}], "lanna brochette": [{"excerpts": ["the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\n"], "author": "Cindi N.", "review": "stars are for the consistently good food, friendly service & reliability (explained below).\n\nhave been coming here for years!  this is a family owned (husband & wife) restaurant.  has a nice, cozy, homey feel -- just eat, no scene restaurant, .   we're always welcomed by the husband's friendly service.  once in a great while we get to say \"hi\" to the wife, when she's not busy cooking in the kitchen.  nice \"reliable\" restaurant in the sense that, if we're starving & we want to eat now, we know we don't have to wait to be seated, tables are readily available.  or we go here if we don't want to get dressed up & deal with the scene, cause there's absolutely no scene here....and we know what we're getting, our usual -- which is consistently good.\n\nour usual:\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  deilish, perfect combination -- all compliment each other well.........bbq chicke is very tasty.  note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but i like it & appreciate that lanna has its own flavor..........\n\nhub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) w/ sauce & veggie on the side & an order of rice OR  the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\noccassionally we've ordered:\n- deep-fried calamari tossed w/ garlic, salt & pepper, carrot, red onion, cilantro & green onion........one of our favorite deep-fried calamari, tasty, spicy, a bit on the salty side.....\n- thai iced tea -- nothing special\n\nwe've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........i remember i thought they all tasted good.........but the past 8 - 10 years i've stuck to the usual & happy with that............i  go there specifically cause i'm craving the usual.......\n\ni'll have to agree w/ the other reviews -- they do have one of the best peanut sauce.  used to buy a jar of peanut sauce to take home & dip bbq chicken or add to a bbq chicken sandwich (asian/thai style).", "rating": 4, "date": "2007-07-25"}], "garlic pork chop": [{"excerpts": ["To our dismay, we ended up ordering the Pad Thai dish and the garlic pork chop dish.\n\n"], "author": "Erica K.", "review": "The first time we came here, my mom and I checked the hours from their pictures and decided to go. I noticed that some Yelpers stated that there were differences in the Yelp hours and the pictures of the restaurant's hours. Even when we went during the restaurant's hours, they were closed! \n\nThe second time I came back here with my mom and all was well. The restaurant was opened. We specifically came back the second time to order the stuffed chicken. We placed our order and drank our tea (btw they charge 1.25$ for tea). The server (he's also the owner of the restaurant) reported back to us that they were out of stuffed chicken. To our dismay, we ended up ordering the Pad Thai dish and the garlic pork chop dish.\n\nFinally, after learning our lesson multiple times, I called the restaurant specifically to ask if they had stuffed chicken. I was expecting a \"No sorry we ran out\" or even a \"Yes we do,\" but I was left listening to a dial tone. Even when the hours were specifically stated that they'd be open, apparently they were closed.\n\nDays later, I called to ask if the stuffed chicken was available and the owner said yes. I ordered takeout and went to pick it up. Let me just tell you, all those times of perseverance paid off...\n\nbecause their stuffed chicken is so so so delicious. They stuff the chicken with vermicelli and cabbage (aka Heaven). The vegetables on the side are cooked with butter. The sauce they provide with the stuffed chicken is like a universal sauce they give as a side for other dishes.\n\nMoral of the story: Call a restaurant before arriving, you never know if they decided to open or close. Make sure to ask if they have that one specific item you're looking for. Their Thai food differs from King of Thai or other Thai restaurants because they literally cook it there fresh for you; you can taste it! I hate how good their stuffed chicken is because now I'll keep wanting more, even when their hours of operation are fluctuating.", "rating": 4, "date": "2016-09-13"}, {"excerpts": ["Another favorite of mine is the garlic pork chop. ", "It is super flavorful and super garlicky. ", "Yum. ", "And the cabbage soup that comes at the beginning of your meal is perfect. "], "author": "Michelle Q.", "review": "Whenever I come here, I feel like I'm going over to a family member's house and it's my aunt and uncle who are cooking me food. This place is so homey and immediately makes you feel comfortable. \n\nThe first thing you notice about this place is how immaculately clean it is! Paul, the owner, walks around in his spare time windexing the glass tabletops and making sure each table is spotless. \n\nFor me, the service has always been very good. I've been here so much that my family and I know the owners and they are always very friendly and attentive. \n\nThe food is sooo good! When you look at this place from the street, you'd probably think this place was a little dingy and disappointing. But seriously, I would say Lanna is one of the best kept Thai secrets in San Francisco. Try their stuffed chicken wings--seriously the best I have ever had. Juicy and stuffed with ground pork and noodles and cabbage and fried to a perfect golden brown. Another favorite of mine is the garlic pork chop. It is super flavorful and super garlicky. Yum. And the cabbage soup that comes at the beginning of your meal is perfect. Simple, and perfect. \n\nDid I mention this place is ridiculously cheap? Lunch specials are $6.49 and always come with 2 items (i.e. pad thai and curry, curry and bbq chicken, stuffed chicken wings and pad thai, etc). And any item off the lunch special menu is typically $8 or less. I could pig out here and never feel guilty about the damage (or lack thereof) to my wallet. \n\nAs an added bonus (?) you have the opportunity to partake in the California Lottery here! Granted, I didn't win the $640 million jackpot when I  played here, but I got some tasty grub out of it.", "rating": 5, "date": "2012-05-07"}, {"excerpts": ["ew, chicken fried rice, garlic pork chop, and a side of steamed veggies.  ", "The clear broth soup they serve is a nice start.  ", "The owners are so nice and we can always find parking.  ", "Good Thai iced coffee and iced tea too!"], "author": "Winnie L.", "review": "I heart Lanna Thai Restaurant!  We went for dinner last night - been going there for 20 years and have never been disappointed.  Our family faves:  combo appetizer, pad see ew, chicken fried rice, garlic pork chop, and a side of steamed veggies.  The clear broth soup they serve is a nice start.  The owners are so nice and we can always find parking.  Good Thai iced coffee and iced tea too!", "rating": 4, "date": "2013-06-04"}], "pad thai wonton without noodle": [], "lanna fried rice": [{"excerpts": ["This place is actually better than expected, the Lanna fried rice are super delicious! \n\n"], "author": "Priscilla F.", "review": "A really good Thai food! \nThe owner are really friendly and attentive. \n\nThis place is actually better than expected, the Lanna fried rice are super delicious! \n\nMe and my friends enjoy dinner here will def come back again next time!", "rating": 5, "date": "2017-12-26"}, {"excerpts": ["they actually use to stuff the filling between the bones but that was 10-15 years ago?\n\n- lanna fried rice, the rice with everything in it "], "author": "Myron L.", "review": "I've been here coming here for years. I swear the food has never changed. I can't say what is authentic but Paul and his wife makes it as authentic as I think it can be to me. Every other Thai restaurant Just doesn't cut it for me compared to lanna's.\n\n- Thai ice tea, can't go wrong or maybe I just like the one here more \n\n-Tom kah Kai aka coconut soup is my favorite soup here. The lemony scent and slight sourness with the aromatic coconut flavor just makes me want some now talking about it. What can I say. This soup got some of my favorite flavors in there and they make it good.\n\n- appetizers . I don't think I've gone wrong with any of the apps here. the appetizer sampler is great for 2 people to try a few things\n\n- stuffed chicken wings is fried, soft, and it's just good. they actually use to stuff the filling between the bones but that was 10-15 years ago?\n\n- lanna fried rice, the rice with everything in it and it's really good. Pineapples, tomatoes, dried pork shreds, raisins, chicken, shrimp. The seasoning is yum\n\n- Kai yang, the bbq chicken isn't always available but it's a great deal for the quantity, flavor, and price\n\n-fried banana fritter , I can't eat like I use to but this was really the best part for the end of the meal. Crispy crunch outside, soft inside. Love it with coconut ice cream", "rating": 5, "date": "2016-03-16"}, {"excerpts": ["A shame, since I love their Lanna Fried Rice.  "], "author": "Anthony D.", "review": "Good food with erratic business hours.  Some days they open on time and some days they open late and some days they don't even open.  A shame, since I love their Lanna Fried Rice.  I wanted to order take out at least once each month, now I only call them about once each year.\n\nI'm baffled that they've managed to stay in business all this time.", "rating": 3, "date": "2012-03-02"}, {"excerpts": ["The owner remembers my name because I always go there for Lanna fried rice. ", "Their other food is good too but the fried rice is my favorite. ", ":)"], "author": "Ryan R.", "review": "I love Lanna Thai. The owner remembers my name because I always go there for Lanna fried rice. Their other food is good too but the fried rice is my favorite. :)", "rating": 5, "date": "2013-12-04"}, {"excerpts": ["Love their Lanna Fried Rice, Tom Yum soup, and stuffed chicken wings!!"], "author": "Chloé N.", "review": "Steps away from my house, order takeout there often~simple, pretty cheap, but good thai food.\n\nLove their Lanna Fried Rice, Tom Yum soup, and stuffed chicken wings!!", "rating": 3, "date": "2010-11-18"}, {"excerpts": ["lanna fried rice is pretty good.\n\n"], "author": "Erica L.", "review": "lanna fried rice is pretty good.\n\nthe panang curry noodle look good but was very disappointing.\n\nthis is a miss for me. sorry", "rating": 3, "date": "2012-09-12"}, {"excerpts": ["We started with the Khung Ka Borg, then moved on to  the bbq chicken, yellow curry, Pad Thai Wonton, and Lanna Fried Rice. ", "WOW!!! ", "All excellent. ", "It's the kind of food you wake up craving in the middle of the night. ", "I would definitely go again."], "author": "Tricia S.", "review": "Best Thai I've had in a long time! I went with my dad and sister. We started with the Khung Ka Borg, then moved on to  the bbq chicken, yellow curry, Pad Thai Wonton, and Lanna Fried Rice. WOW!!! All excellent. It's the kind of food you wake up craving in the middle of the night. I would definitely go again.", "rating": 5, "date": "2011-01-27"}, {"excerpts": ["Pad Thai (covered in prawns, a delight), Chicken Satay (mmmm), rolls (double mmmm) and Lanna Fried Rice (their specialty). ", "Although I have not eaten at the restaurant, I can say they had been courteous and prompt with our order. ", "I would recommend going there for dinner."], "author": "Valerie V.", "review": "We had Lanna Thai cater a birthday party. The food was good. Pad Thai (covered in prawns, a delight), Chicken Satay (mmmm), rolls (double mmmm) and Lanna Fried Rice (their specialty). Although I have not eaten at the restaurant, I can say they had been courteous and prompt with our order. I would recommend going there for dinner.", "rating": 3, "date": "2008-05-06"}], "house special prawn": [], "prawn curry": [{"excerpts": ["I ordered the prawn curry, which was a little on the spicy side, but I like spicy. ", "I loved my dish...bell pepper, pineapple, curry and prawns. ", "I should have taken a picture ", "but I ate it too fast! ", "But they have pictures of almost all their food on their menu, which is helpful. ", "Oh, I almost forgot! ", "We also had an appetizer of fried calamari which was also excellent....sweet and spicy and definitely satisfying! ", "Will for sure go back here again, the combination of great service, delicious food and fair pricing is a winning combination."], "author": "Sara W.", "review": "YUM! We went to SF to see the mosaic steps on 16th ave and then were looking for a good spot to have lunch. My boyfriend wanted Thai, and we found this place on Yelp. He ordered the Saturday special (stuffed chicken wing and Thai curry chicken), which had so much flavor! I ordered the prawn curry, which was a little on the spicy side, but I like spicy. I loved my dish...bell pepper, pineapple, curry and prawns. I should have taken a picture but I ate it too fast! But they have pictures of almost all their food on their menu, which is helpful. Oh, I almost forgot! We also had an appetizer of fried calamari which was also excellent....sweet and spicy and definitely satisfying! Will for sure go back here again, the combination of great service, delicious food and fair pricing is a winning combination.", "rating": 5, "date": "2015-01-04"}, {"excerpts": ["Can't say the same for the prawn curry, which tasted something like pineapple soup with shrimp, not quite a crime against nature, but a head-scratcher nonetheless.\n\n"], "author": "Hugh B.", "review": "A tough choice the other night:  Pizza delivery accompanied by the 1,427th showing of  \"The History of Bricks\" on the History Channel, or get off our butts and follow our appetites towards something we might actually enjoy.  We chose the latter, and headed west, drawn by the siren song of  Lanna Thai peanut sauce, seemingly oblivious to the surrounding culinary wreckage of Noriega street.   \n\nThe Rhama Thai with tofu was a sure thing, with tofu and spinach drenched in the revered Lanna peanut sauce (buy some pre-packed to take home).  Vegetarian egg rolls were also terrific, crispy and flavorful.  Can't say the same for the prawn curry, which tasted something like pineapple soup with shrimp, not quite a crime against nature, but a head-scratcher nonetheless.\n\nAn endearing and enduring feature of Lanna, aside from the lovely family that owns the place, is the ongoing Lotto Hot Spot game and ceiling-mounted video monitor for your playing enjoyment.  Thai food enthusiasts who also happen to be gambling addicts will surely enjoy the never-ending 5-minute lotto cycles, where players can play to win anywhere from $1-$20 a round.  Sadly, no one was enjoying this novelty during our dinner.\n\nWe hadn't paid particularly close attention to the menu prices,  and were somewhat shocked to get out the place for $30.  I can't remember the last time I had any dinner that cheap, let alone a good one.  Such a nice experience, a great dinner, a night out, and secure in the knowledge that \"History of Bricks\" will undoubtedly be airing for the 1,428th time sometime soon.", "rating": 4, "date": "2007-09-17"}], "pumpkin curry with prawn": [], "stuffed chicken wing": [{"excerpts": ["But really, the only thing we weren't sold on was the stuffed chicken wing. ", "This family business really needs to stick around - please eat at Lanna!"], "author": "Elizabeth S.", "review": "One of my favorite neighborhood eats, Lanna always leaves me feeling satiated without a big hit to the wallet. My go to's are the pad Thai & cashew chicken, yum! My fiancé is a big fan of the ga-prow. But really, the only thing we weren't sold on was the stuffed chicken wing. This family business really needs to stick around - please eat at Lanna!", "rating": 5, "date": "2015-04-28"}, {"excerpts": ["I have to say I didn't care much for the stuffed chicken wing. "], "author": "Eric M.", "review": "I came here because the pictures for this restaurant looked really good. I got the Pad Thai and Stuffed wings daily special. The Pad Thai tasted a bit different than it does at other places which i found interesting, not in a bad way but different than what i'd expect. I have to say I didn't care much for the stuffed chicken wing. I felt the stuffing didn't compliment the chicken very well. \n\nI don't think I'd come back since there are so many other Thai options in the area.", "rating": 2, "date": "2013-04-24"}, {"excerpts": ["He ordered the Saturday special (stuffed chicken wing and Thai curry chicken), which had so much flavor! "], "author": "Sara W.", "review": "YUM! We went to SF to see the mosaic steps on 16th ave and then were looking for a good spot to have lunch. My boyfriend wanted Thai, and we found this place on Yelp. He ordered the Saturday special (stuffed chicken wing and Thai curry chicken), which had so much flavor! I ordered the prawn curry, which was a little on the spicy side, but I like spicy. I loved my dish...bell pepper, pineapple, curry and prawns. I should have taken a picture but I ate it too fast! But they have pictures of almost all their food on their menu, which is helpful. Oh, I almost forgot! We also had an appetizer of fried calamari which was also excellent....sweet and spicy and definitely satisfying! Will for sure go back here again, the combination of great service, delicious food and fair pricing is a winning combination.", "rating": 5, "date": "2015-01-04"}, {"excerpts": ["I ordered the daily special ($6.50 rice, pad thai, bbq chicken, soup) and the Saturday special ($6.95 rice, panang curry, stuffed chicken wing, soup). ", "Doesn't it already sound mouth watering? "], "author": "Connie C.", "review": "I'm glad yelp can be my trusty sidekick whenever I'm out and about and need to pick up something to eat. It hasn't failed me yet!\n\nI found this place when i need to pick up some lunch for my boyfriend and I. I found out about this place because of the cheap lunch specials. I was also attracted by the fact that they offer rice plates with pad thai on the side? AND chicken? AND soup? wow and for only under $7, it's a wonder why they don't have more ratings. \n\nI ordered the daily special ($6.50 rice, pad thai, bbq chicken, soup) and the Saturday special ($6.95 rice, panang curry, stuffed chicken wing, soup). Doesn't it already sound mouth watering? All my favorite dishes combined into one plate, unique indeed! \n\nThe owner was also very sweet. He could tell I was in a rush and tried his best to get me my food. He was welcoming and hospitable and made an effort to check on all his customers. Loved the service!\n\nI got my food and took it to my boyfriend. We definitely enjoyed the food, though it's not exactly the best I've had, I love the fact they offer the unique lunch plates and for that, plus the service, I'll definitely come back for more visits!", "rating": 4, "date": "2011-04-29"}], "chicken satay dinner": [], "panang curry over noodle": [], "rama thai over noodle": [], "sauteed noodle": [], "yellow curry noodle soup": [], "yellow curry": [{"excerpts": ["I had the pad see ew and the yellow curry. ", "Both were delicious. ", "I plan on going back here."], "author": "Lisa Y.", "review": "I had the pad see ew and the yellow curry. Both were delicious. I plan on going back here.", "rating": 5, "date": "2018-02-28"}, {"excerpts": ["we ordered an extra cup since there were 3 of us)\nFish Cake Appetizer\nYellow Curry with Chicken\nGarlic Pork\nSteamed rice\n- Sauteed veggies with tofu (don't remember the name, it wasn't very memorable)\n\n"], "author": "Jenna H.", "review": "~3.5 Stars~\n\nWhile the food was tasty and delicious, their portions were a bit lacking. I didn't know if it was because we walked in 30 minutes before closing, but it seems from other reviews that we were not the only ones who felt this way. (I felt bad right before closing--but we spent all day moving into a place a couple blocks away so we were hungry and it was the only open closeby option)\n\nWE ORDERED:\n- $30 dinner for 2 set which included:\nTom Yum Soup (2 cups -- we ordered an extra cup since there were 3 of us)\nFish Cake Appetizer\nYellow Curry with Chicken\nGarlic Pork\nSteamed rice\n- Sauteed veggies with tofu (don't remember the name, it wasn't very memorable)\n\nTHE GOOD: \n+ Everything was tasty\n+ The Soup wasn't overly sour and I really enjoyed this\n+ The Curry flavor was very good\n+ I like the mom&pop service atmosphere\n+ Very friendly and fast to refill water\n\nTHE BAD:\n- Small portions and therefore not worth the price\n- Slow service getting food out (even though we were the ONLY people in the place)\n- Thai curry is made with coconut milk which gives it a thinner consistency than Chinese/Japanese Curry. I found it very odd that they served this on a plate instead of in a bowl, so it just spread out over the entire plate which made the amount of chicken seem very sparse and made it more difficult to spoon it onto the rice (very tasty though!).", "rating": 3, "date": "2015-02-05"}, {"excerpts": ["We had the Yellow Curry with a side of white rice http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=B8x0c8VnTHY4LLQGLS860A, Veggie Pad Thai http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=G61x-p3lL8IjO96vC2DHmQ, and a Banana Fritter with Green Tea Ice Cream http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=gaT9Am3XHOHNf7AabUcQSw. ", "The owner was really nice as well and his service was quick too.\n \n", "[W] ", "We were just 1 of the 2 couples in the restaurant ", "so it wasn't that busy. ", "Parking was extremely easy today; basically we got a parking spot right in front of the restaurant. "], "author": "Mona C.", "review": "[M]ona: 4 Stars\n[W]ayne: 4.5 Stars\nAverage: 4.25 Stars\n\n+ Excellent Service\n+ Accepts Credit Cards\n+ Inexpensive\n+ Extensive Menu\n+ Daily Specials\n+ Quick Service\n\n[W] So tonight me and Mona had a craving for rather Thai or some other Asian spot and I'm really glad we came here. Mona has a knack of dragging me to places where she HAD eaten before but she just procrastinates so much that she forgets how everything was so she takes me to review it first haha. \n\n[M] That's why I have you baby! XD\n\nThe food here was actually pretty good. We had the Yellow Curry with a side of white rice http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=B8x0c8VnTHY4LLQGLS860A, Veggie Pad Thai http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=G61x-p3lL8IjO96vC2DHmQ, and a Banana Fritter with Green Tea Ice Cream http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=gaT9Am3XHOHNf7AabUcQSw. The owner was really nice as well and his service was quick too.\n \n[W] We were just 1 of the 2 couples in the restaurant so it wasn't that busy. Parking was extremely easy today; basically we got a parking spot right in front of the restaurant. There was really nothing bad to say at all with this restaurant dispute the Caucasian couple behind us was speaking Jesus and talking VERY loudly. \n\nThe curry didn't taste pasty or sandy (if you ever had bad curry) and the pad thai was very saucy and smooth. It was funny because when the other couple left, the owner was cleaning the table and he looked at us and he was like \"wow you guys are so clean!\" My bad was to their table so I looked back and mannnnnn, they were pigs lol. Crap on the table, crap on the floor.....aiya lol. Anyways, yea this place is awesome and the owner was awesome also. JUST AWESOME!! lol (Relating to I Love You Man).", "rating": 4, "date": "2010-04-07"}, {"excerpts": ["Other dishes we ordered: The Pad Thai and the Beef w/ spinach were probably the best out of everything we tried; Panang Beef (okay); Yellow Curry (okay); And Chicken Satay (super dry)"], "author": "jesiree b.", "review": "Since we were in the area, my family and I decided to try this spot for dinner. The staff was very attentive, which is probably the only thing that was memorable. I'm saying this because every dish we had was just OKAY...not bad, but just okay.  Our entrees didn't really look too presentable and there was just way more sauce on the dish than there was meat or vegetables - we didn't have enough to share amongst 6 ppl. \n\nI made sure to order the peanut sauce (which we had with tofu as an appetizer) since it was one of the highlights of Lanna on Yelp. They even sell their sauce for $5 a jar!  When I finally got to taste it, I was pretty disappointed because it tasted like they just melted spoonfuls of Skippy.\n\nOther dishes we ordered: The Pad Thai and the Beef w/ spinach were probably the best out of everything we tried; Panang Beef (okay); Yellow Curry (okay); And Chicken Satay (super dry)", "rating": 3, "date": "2010-03-10"}, {"excerpts": ["So we had the panang curry, yellow curry, fried calamari, pumpkin curry and one of the daily special with chicken, pad thai, and white rice.\n\n", "The yellow curry and panang curry were all right but the portions were so meager. ", "The pumpkin curry was pretty good with a lot of shrimp ", "but it could have used a little but more flavor.\n", "The fried calamari was pretty good too, just some simple salt and pepper.\n", "The yellow curry and panang curry were all right but the portions were so meager. ", "The pumpkin curry was pretty good with a lot of shrimp ", "but it could have used a little but more flavor.\n", "The fried calamari was pretty good too, just some simple salt and pepper.\n"], "author": "Wilson T.", "review": "So the 5 of us walked into the little restaurant and there were seats right away.\n\nIt is a really nice and cozy place. We tried a variety of curry and dishes. UNfortunately, they didn't have any fish cakes and stuffed chicken wings we asked for, both of which we really wanted to try.\nSo we had the panang curry, yellow curry, fried calamari, pumpkin curry and one of the daily special with chicken, pad thai, and white rice.\n\nThe yellow curry and panang curry were all right but the portions were so meager. The pumpkin curry was pretty good with a lot of shrimp but it could have used a little but more flavor.\nThe fried calamari was pretty good too, just some simple salt and pepper.\nThe pad thai was actually my favorite, and the chicken was my 2nd.\n\nWe also ordered fried banana, which was good except for the fact that they used regular butter in the batter. They should have used unsalted butter because it was really satly!\n\nAll in all, not a bad experience but you have to serve it up a little better to convince my parents to come back. At least I will come back to try the stuffed chicken wings.", "rating": 3, "date": "2012-08-05"}, {"excerpts": ["I got the yellow curry. ", "It wasn't gross, it was just alright. ", "It tastes like something my mom could make. ", "The chicken satay tastes like yellow curry and peanut sauce and the fried stuffed chicken was really weird. ", "My boyfriend wouldn't even eat it after the first bite. ", "The soup and the beginning was weird too. "], "author": "Melinda M.", "review": "Meh.\nIt has potential. We came here craving Thai food and it had pretty good reviews. I guess if you like plain Thai food this is the place to go. But I love Thai because of its amazing flavored. I got the yellow curry. It wasn't gross, it was just alright. It tastes like something my mom could make. My boyfriend got the spicy crispy fish, he thought it was okay.  I thought it was too salty and tasted really fishy like the fish had been sitting in the fridge for a while. \nWe got the sampler appetizer. The egg rolls were tiny but pretty good. The chicken satay tastes like yellow curry and peanut sauce and the fried stuffed chicken was really weird. My boyfriend wouldn't even eat it after the first bite. The soup and the beginning was weird too. It reminded me of swimming pool water haha\n\nThe waiter was really nice but the service took a life time. We were there for over an hour. Waiting 20 minutes just for them to take our credit card. Eventually my boyfriend just went to the window and paid. \n\nLike I said its not terrible but I probably wouldn't eat there again. If I do for some reason I'd try the pad Thai next time. \n\nSuper cheap though so that's great. I guess.", "rating": 2, "date": "2013-07-10"}, {"excerpts": ["Egg rolls, yellow curry, fried rice and pad ke mao. ", "Everything was delicious! ", "Very fresh and not greasy. ", "Best thai food I've had in the sunset. ", "I highly recommend this place"], "author": "Stacey K.", "review": "I got take out it. Egg rolls, yellow curry, fried rice and pad ke mao. Everything was delicious! Very fresh and not greasy. Best thai food I've had in the sunset. I highly recommend this place", "rating": 5, "date": "2014-05-19"}, {"excerpts": ["Prices are definitely reasonably during lunch, but my yellow curry dish was uninspiring today. ", "They put peas in it, which I have never seen at a Thai restaurant. ", "My friend's pad thai looked better."], "author": "Natalie S.", "review": "Prices are definitely reasonably during lunch, but my yellow curry dish was uninspiring today. They put peas in it, which I have never seen at a Thai restaurant. My friend's pad thai looked better.", "rating": 3, "date": "2011-12-27"}, {"excerpts": ["We started with the Khung Ka Borg, then moved on to  the bbq chicken, yellow curry, Pad Thai Wonton, and Lanna Fried Rice. ", "WOW!!! ", "All excellent. ", "It's the kind of food you wake up craving in the middle of the night. ", "I would definitely go again."], "author": "Tricia S.", "review": "Best Thai I've had in a long time! I went with my dad and sister. We started with the Khung Ka Borg, then moved on to  the bbq chicken, yellow curry, Pad Thai Wonton, and Lanna Fried Rice. WOW!!! All excellent. It's the kind of food you wake up craving in the middle of the night. I would definitely go again.", "rating": 5, "date": "2011-01-27"}, {"excerpts": ["The egg rolls were great, but the yellow curry and the noodle soup (tried looking for the name, couldn't find it) were pretty bland. ", "I definitely had better Thai, but the service and price made up for lack of flavor."], "author": "B B.", "review": "Five stars for service\n\nFive stars for price\n\nFive stars for variety\n\nThree stars for flavor\n\nRarely are we in the Sunset, but we had an oil change to take care of and a Thai craving to satisfy. This was the closest Thai place to the oil change and four stars on Yelp didn't hurt. The place was nearly empty when we arrived, so we were promptly seated. The older guy was super nice and cheery and made sure we were taken care of throughout the meal. The egg rolls were great, but the yellow curry and the noodle soup (tried looking for the name, couldn't find it) were pretty bland. I definitely had better Thai, but the service and price made up for lack of flavor.", "rating": 4, "date": "2010-02-16"}, {"excerpts": ["Other things from the menu that you should try is the yellow curry dish and the stuffed chicken wings are killer to! ", "All and all I am a Huge fan of this place and the prices are just as nice! ", "Satisfaction Guaranteed!"], "author": "Steven H.", "review": "If you order anything on the menu get the Spicy Angel Wings !!!! They are Amazing and are the reason I go there every time I'm in town! The food here is tasty but Nothing comes close to the Angel wings! Other things from the menu that you should try is the yellow curry dish and the stuffed chicken wings are killer to! All and all I am a Huge fan of this place and the prices are just as nice! Satisfaction Guaranteed!", "rating": 4, "date": "2009-11-12"}, {"excerpts": ["we've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........", "i remember i thought they all tasted good.........", "but the past 8 - 10 years i've stuck to the usual & happy with that............", "i  go there "], "author": "Cindi N.", "review": "stars are for the consistently good food, friendly service & reliability (explained below).\n\nhave been coming here for years!  this is a family owned (husband & wife) restaurant.  has a nice, cozy, homey feel -- just eat, no scene restaurant, .   we're always welcomed by the husband's friendly service.  once in a great while we get to say \"hi\" to the wife, when she's not busy cooking in the kitchen.  nice \"reliable\" restaurant in the sense that, if we're starving & we want to eat now, we know we don't have to wait to be seated, tables are readily available.  or we go here if we don't want to get dressed up & deal with the scene, cause there's absolutely no scene here....and we know what we're getting, our usual -- which is consistently good.\n\nour usual:\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  deilish, perfect combination -- all compliment each other well.........bbq chicke is very tasty.  note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but i like it & appreciate that lanna has its own flavor..........\n\nhub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) w/ sauce & veggie on the side & an order of rice OR  the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\noccassionally we've ordered:\n- deep-fried calamari tossed w/ garlic, salt & pepper, carrot, red onion, cilantro & green onion........one of our favorite deep-fried calamari, tasty, spicy, a bit on the salty side.....\n- thai iced tea -- nothing special\n\nwe've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........i remember i thought they all tasted good.........but the past 8 - 10 years i've stuck to the usual & happy with that............i  go there specifically cause i'm craving the usual.......\n\ni'll have to agree w/ the other reviews -- they do have one of the best peanut sauce.  used to buy a jar of peanut sauce to take home & dip bbq chicken or add to a bbq chicken sandwich (asian/thai style).", "rating": 4, "date": "2007-07-25"}], "panang curry": [{"excerpts": ["My girlfriend got their egg noodles with Panang curry. ", "Both dishes had great flavor, though perhaps a tad on the sweet side. ", "There's tons of dishes to choose from and they all look good. ", "I really enjoyed the variety of the combo and it was exactly what I wanted on the chilly evening. "], "author": "Joe M.", "review": "Craving some good ol' Thai food, I discovered a hole-in-the-wall place nearby by the same name as my old stomping grounds in Marin, Lanna Thai. I obviously had to give it a try and compare it to what I remember.\n\nI ordered their Friday combo with Pad Thai and mussamun curry, which at under $10, is an amazing deal. My girlfriend got their egg noodles with Panang curry. Both dishes had great flavor, though perhaps a tad on the sweet side. There's tons of dishes to choose from and they all look good. I really enjoyed the variety of the combo and it was exactly what I wanted on the chilly evening. I look forward to going back many times!\n\nService was very friendly and, evening with the one big party in the restaurant, we still got good service. The prices are just right and the food is delicious. Along with King of Thai Noodles, it's my new go-to Thai places in the city.\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 7/10", "rating": 4, "date": "2012-08-23"}, {"excerpts": ["We ordered vegetarian pad thai and panang curry with steamed rice on the side. ", "Rosé is $2.75 a (small) glass too which is definitely a plus! ", "Since we went at a super busy time on a super busy night we asked another two diners to share a table with us and ended up meeting some lovely new friends!"], "author": "Rachel P.", "review": "We came after Hardly Strictly Bluegrass and waited quite a while for food but it was DELICIOUS. We ordered vegetarian pad thai and panang curry with steamed rice on the side. Rosé is $2.75 a (small) glass too which is definitely a plus! Since we went at a super busy time on a super busy night we asked another two diners to share a table with us and ended up meeting some lovely new friends!", "rating": 4, "date": "2016-10-01"}, {"excerpts": ["Today is Monday, so I had Monday's daily special which is Pad Thai & Panang Curry with Chicken. ", "Out of all the specials, I would say Monday's seemed the most appetizing to me, you get PAD THAI & PANANG CURRY WITH CHICKEN, a good deal to me since I probably would have gotten that anyways. ", "Both items were good. ", "Curry came with rice and pad thai was yummy too. ", "Out of all the specials, I would say Monday's seemed the most appetizing to me, you get PAD THAI & PANANG CURRY WITH CHICKEN, a good deal to me since I probably would have gotten that anyways. ", "Both items were good. ", "Curry came with rice and pad thai was yummy too. "], "author": "Kylie L.", "review": "Made a date with Mona C. last week for today. I chose the restaurant because I wanted something not too far from home or school, because I have school right after, night classes really suck. After reading and finding this on yelp (maybe half a year ago) I really really wanted to try this place, that's why it's been bookmarked FOREVER on yelp & Mozilla. I came here once before, but I think I came too early on a weekday for lunch, so ended up going elsewhere. I FINALLY had the chance to go today.\n\nI was reluctant to go because she always takes pictures of EVERYTHING, and it's so embarrassing...I guess it informs the yelp community by taking pictures of everything. I sometimes do that too, I wonder if it's embarrassing for others. She takes pics of the place and the FOOD. If I'm starving, she has to take a perfect picture (and the first shot is never good enough) of the food before anyone can eat, so I always try to mess it up by eating the food before she remembers to take a picture, I'm so evil. She even took a picture of my water today. It wasn't so embarrassing today, since there weren't many people.\n\nI looked at their website prior to coming and it showed that everyday had a special, except Sunday (I guess they rest on the Sabbath Day). Today for lunch, it wasn't crowded, only another group of people were there. \n\nToday is Monday, so I had Monday's daily special which is Pad Thai & Panang Curry with Chicken. Out of all the specials, I would say Monday's seemed the most appetizing to me, you get PAD THAI & PANANG CURRY WITH CHICKEN, a good deal to me since I probably would have gotten that anyways. Both items were good. Curry came with rice and pad thai was yummy too. Lots of variety for only $6.29.\n\nI would come back during other days to see what all the other specials are like.", "rating": 4, "date": "2009-10-05"}, {"excerpts": ["lunch special:  panang curry with chicken (6.25)\n-generic green onion and veggie soup: ok\n-curry pronounced, good flavored, chicken tender not tuff,  eggplant and pea kind of mushy, zuchinni and bamboo ", "shoots ok.\n", "-jasmine ", "rice generic, ", "ok though, lunch 3 stars. ", "regular menu probably 4\n"], "author": "Victor G.", "review": "Lanna thai has been around for ages. (saw it here decades ago. may have dined here once.)  the sunfaded wallpaper is a tell. this doesn't detach from the homespun ambience of lanna thai. an  annoyance is the  flatscreen constantly flashing pics and numbers of items on the menu.\n\nmany items on lunch special, hard to choose one.\n\nsampling: lunch special:  panang curry with chicken (6.25)\n-generic green onion and veggie soup: ok\n-curry pronounced, good flavored, chicken tender not tuff,  eggplant and pea kind of mushy, zuchinni and bamboo shoots ok.\n-jasmine rice generic, ok though, lunch 3 stars. regular menu probably 4\n(you get what you pay for for)\n\nleftovers:\n-service excellent,  refilled water 3 times, no msg problem, just thirst.\n-service leisurely, heartell it's mom & pop.\n-def return when i finish noreiga st.", "rating": 3, "date": "2011-05-27"}, {"excerpts": ["So we had the panang curry, yellow curry, fried calamari, pumpkin curry and one of the daily special with chicken, pad thai, and white rice.\n\n", "The yellow curry and panang curry were all right but the portions were so meager. ", "The pumpkin curry was pretty good with a lot of shrimp ", "but it could have used a little but more flavor.\n", "The fried calamari was pretty good too, just some simple salt and pepper.\n", "The yellow curry and panang curry were all right but the portions were so meager. ", "The pumpkin curry was pretty good with a lot of shrimp ", "but it could have used a little but more flavor.\n", "The fried calamari was pretty good too, just some simple salt and pepper.\n"], "author": "Wilson T.", "review": "So the 5 of us walked into the little restaurant and there were seats right away.\n\nIt is a really nice and cozy place. We tried a variety of curry and dishes. UNfortunately, they didn't have any fish cakes and stuffed chicken wings we asked for, both of which we really wanted to try.\nSo we had the panang curry, yellow curry, fried calamari, pumpkin curry and one of the daily special with chicken, pad thai, and white rice.\n\nThe yellow curry and panang curry were all right but the portions were so meager. The pumpkin curry was pretty good with a lot of shrimp but it could have used a little but more flavor.\nThe fried calamari was pretty good too, just some simple salt and pepper.\nThe pad thai was actually my favorite, and the chicken was my 2nd.\n\nWe also ordered fried banana, which was good except for the fact that they used regular butter in the batter. They should have used unsalted butter because it was really satly!\n\nAll in all, not a bad experience but you have to serve it up a little better to convince my parents to come back. At least I will come back to try the stuffed chicken wings.", "rating": 3, "date": "2012-08-05"}, {"excerpts": ["I ordered the daily special ($6.50 rice, pad thai, bbq chicken, soup) and the Saturday special ($6.95 rice, panang curry, stuffed chicken wing, soup). ", "Doesn't it already sound mouth watering? "], "author": "Connie C.", "review": "I'm glad yelp can be my trusty sidekick whenever I'm out and about and need to pick up something to eat. It hasn't failed me yet!\n\nI found this place when i need to pick up some lunch for my boyfriend and I. I found out about this place because of the cheap lunch specials. I was also attracted by the fact that they offer rice plates with pad thai on the side? AND chicken? AND soup? wow and for only under $7, it's a wonder why they don't have more ratings. \n\nI ordered the daily special ($6.50 rice, pad thai, bbq chicken, soup) and the Saturday special ($6.95 rice, panang curry, stuffed chicken wing, soup). Doesn't it already sound mouth watering? All my favorite dishes combined into one plate, unique indeed! \n\nThe owner was also very sweet. He could tell I was in a rush and tried his best to get me my food. He was welcoming and hospitable and made an effort to check on all his customers. Loved the service!\n\nI got my food and took it to my boyfriend. We definitely enjoyed the food, though it's not exactly the best I've had, I love the fact they offer the unique lunch plates and for that, plus the service, I'll definitely come back for more visits!", "rating": 4, "date": "2011-04-29"}, {"excerpts": ["- Panang Curry with chicken was decent\n\nService was very friendly and good."], "author": "Coco L.", "review": "A small little place with decent Thai food.  It wasn't too packed for Sat. dinner.  My friend was able to get a table quickly\n\n- Rama Tofu was very good!\n- Panang Curry with chicken was decent\n\nService was very friendly and good.", "rating": 3, "date": "2009-10-12"}, {"excerpts": ["I like the panang curry (it's a red curry) with prawns.  ", "The pad thai is good too ", "and I like that you can heat it up afterwards ", "and it's not like eating rubber bands.  ", "I'm just gonna warn you though, at times I've felt the pad see ", "ew was a little bland.  "], "author": "Paz R.", "review": "*slow motion* OHHHH YEAHHHH.\n\nThe owner is really nice, in my experience he has been consistently pleasant.  He works with his wife, who cooks and is equally sweet.  The food is good, and not too expensive.  I mean, kinda but there's a lunch menu, and even daily specials where you get a bunch of stuff for under $10.  I like the panang curry (it's a red curry) with prawns.  The pad thai is good too and I like that you can heat it up afterwards and it's not like eating rubber bands.  I'm just gonna warn you though, at times I've felt the pad see ew was a little bland.  Just sayin.\n\nOh yeah, and if you are ordering pick-up and you call in with your order, it will be helpful for you to know that they don't really answer the phone like a business, so there's a potential for confusion.  They'll be like \"hello?\" so you think you just called someone's house or something.  One time I really did call someone's house and started ordering thai food... but that time was my fault. :/", "rating": 4, "date": "2011-05-16"}, {"excerpts": ["the panang curry noodle look good but was very disappointing.\n\n"], "author": "Erica L.", "review": "lanna fried rice is pretty good.\n\nthe panang curry noodle look good but was very disappointing.\n\nthis is a miss for me. sorry", "rating": 3, "date": "2012-09-12"}, {"excerpts": ["(big plus for me because I always drink my water quickly) definitely coming back to try out their pad see ew and panang curry."], "author": "Jennie L.", "review": "Just moved into the area and this was one of the first restaurants I tried. the waiter/owner(?) was so sweet and friendly when I asked questions, he's just awesome! the food was uber delicious, and they made my curry to just the right level of spicyness requested. the daily specials are such a great deal! soup, (a LOT of) pad thai, musamun chicken curry + rice for less than $10. he came by to check on us frequently and my glass was always filled! (big plus for me because I always drink my water quickly) definitely coming back to try out their pad see ew and panang curry.", "rating": 5, "date": "2009-02-12"}, {"excerpts": ["we've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........", "i remember i thought they all tasted good.........", "but the past 8 - 10 years i've stuck to the usual & happy with that............", "i  go there "], "author": "Cindi N.", "review": "stars are for the consistently good food, friendly service & reliability (explained below).\n\nhave been coming here for years!  this is a family owned (husband & wife) restaurant.  has a nice, cozy, homey feel -- just eat, no scene restaurant, .   we're always welcomed by the husband's friendly service.  once in a great while we get to say \"hi\" to the wife, when she's not busy cooking in the kitchen.  nice \"reliable\" restaurant in the sense that, if we're starving & we want to eat now, we know we don't have to wait to be seated, tables are readily available.  or we go here if we don't want to get dressed up & deal with the scene, cause there's absolutely no scene here....and we know what we're getting, our usual -- which is consistently good.\n\nour usual:\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  deilish, perfect combination -- all compliment each other well.........bbq chicke is very tasty.  note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but i like it & appreciate that lanna has its own flavor..........\n\nhub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) w/ sauce & veggie on the side & an order of rice OR  the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\noccassionally we've ordered:\n- deep-fried calamari tossed w/ garlic, salt & pepper, carrot, red onion, cilantro & green onion........one of our favorite deep-fried calamari, tasty, spicy, a bit on the salty side.....\n- thai iced tea -- nothing special\n\nwe've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........i remember i thought they all tasted good.........but the past 8 - 10 years i've stuck to the usual & happy with that............i  go there specifically cause i'm craving the usual.......\n\ni'll have to agree w/ the other reviews -- they do have one of the best peanut sauce.  used to buy a jar of peanut sauce to take home & dip bbq chicken or add to a bbq chicken sandwich (asian/thai style).", "rating": 4, "date": "2007-07-25"}, {"excerpts": ["Other goodies: bbq chicken (it's part of the daily lunch special), tom kah (doesn't look like other places', but it's still yummy), panang curry (duh), pad thai (isn't too sweet like a lot of places nowadays)... and so much more.\n\n"], "author": "sina t.", "review": "I eat here a lot. A LOT. seriously. Twice in the past three days, and they were closed yesterday. (Closed on Sundays, take note)... My boyfriend and I love Thai food. And Lanna is a staple in our lives. But it still took a Yelp review (KayJay's) to get me to try the Rama Thai. WOW! When I read the review, it got me in the mood for peanut sauce, but it was Sunday so I went to some other Thai place nearby and had their peanut sauce chicken. It was fine. Today, I wound up going to Lanna, because I'm lazy like that. Ordered the Rama. Having the ability to compare it to yesterday's inferior peanut sauce made it even better! I recommend you go somewhere else that you think is good, then come here. You'll be impressed, I promise.\n\nOther goodies: bbq chicken (it's part of the daily lunch special), tom kah (doesn't look like other places', but it's still yummy), panang curry (duh), pad thai (isn't too sweet like a lot of places nowadays)... and so much more.\n\nThe service is always the same reliable guy who always recognizes you, or tries to, and never really remembers you. I like him. He's smiley and polite. He always asks me at the end of the meal if I want dessert and it's become a joke because I never save room, being the pig I am.\n\nThere're about a dozen tables. I've never seen it full, which is a shame. I want them to have great business so they'll always be there when I need them.", "rating": 4, "date": "2008-10-06"}], "green curry": [{"excerpts": ["Ordered the green curry and red curry by the way.\n\n "], "author": "Anna B.", "review": "I really liked this place! Looks nice and presentable inside, great customer service and food was very good! Ordered the green curry and red curry by the way.\n\n Will definitely come back!", "rating": 5, "date": "2018-06-18"}, {"excerpts": ["Green curry tasted good, the satay was on point, and the complimentary soup was good. ", "And the hot fried banana dessert that came with dinner for an extra $3 was more than worth it. "], "author": "Jack R.", "review": "$10.00 dinner specials an great service, what's not to like about that?\n\nThe food was good too, not overly great, but for the price it was well worth it.\n\nGreen curry tasted good, the satay was on point, and the complimentary soup was good. And the hot fried banana dessert that came with dinner for an extra $3 was more than worth it. It was an up charge of $3 for dessert, tea, and the satay which was worth it.\n\nThe owner was super friendly, and I would definitely return again.", "rating": 4, "date": "2016-04-24"}, {"excerpts": ["We had the green curry, pineapple curry, and the coconut soup. ", "All delicious!"], "author": "Becky G.", "review": "My boyfriend and I came for dinner. Very reasonably priced food and wine for $4 a glass! Amazing. The staff were very gracious and helpful. A great place to find vegan and vegetarian food. We had the green curry, pineapple curry, and the coconut soup. All delicious!", "rating": 5, "date": "2017-07-03"}, {"excerpts": ["We had Tom Yum soup and Tofu green curry. "], "author": "Victoria M.", "review": "We are new to San Francisco and wanted to try out a Thai restaurant near by so we decided on Lanna Thai. I am glad we did! We had Tom Yum soup and Tofu green curry. Both were excellent!\n\nI also really liked the small and cozy feel of the restaurant itself. It's perfect to relax and enjoy tasty food, cold beer, and good conversation.", "rating": 5, "date": "2013-09-06"}, {"excerpts": ["My friend and I then shared orders of the Rama Tofu and Green Curry Veggies. ", "The Rama Tofu is a peanut-curry dish that comes on a bed of steamed spinach - almost had a flavor of a Japanese Gomae. ", "We both felt that there was maybe too much sweetness/sugar though. ", "Would like to see it with the sweetness toned way down, because the dish has great potential - I'd even see if I could order it less sweet, and maybe do some hot sauce with it. ", "The green curry we ordered with just veggies and it was full of them all ", "cooked to perfection. ", "I ordered it hot, which was maybe one degree too much for my friend, but I didn't even have to ask for water ", "so I had no issues with it. "], "author": "Emily C.", "review": "Very tasty and fresh. We came here for late lunch/early dinner while our car was getting serviced a few blocks down at  Sunset Service. The Tom Kha and Tom Yum soups were both fantastic, we each got a cup and traded back and forth. The soups deserve 5 stars alone.\n\nWe then got the veggie tofu version of the ground rice salad like Larb which was also really good. They use lettuce with it here; I have had it other places with cabbage which maybe is a little more of an acquired taste, but still this was very very good. \n\nMy friend and I then shared orders of the Rama Tofu and Green Curry Veggies. The Rama Tofu is a peanut-curry dish that comes on a bed of steamed spinach - almost had a flavor of a Japanese Gomae. We both felt that there was maybe too much sweetness/sugar though. Would like to see it with the sweetness toned way down, because the dish has great potential - I'd even see if I could order it less sweet, and maybe do some hot sauce with it. The flavor and consistency of the fried tofu in it was excellent, as was the spinach, which is why I might see if the sweet level could be modified.\n\nThe green curry we ordered with just veggies and it was full of them all cooked to perfection. I ordered it hot, which was maybe one degree too much for my friend, but I didn't even have to ask for water so I had no issues with it. It was great.\n\nComplete dinner including a Thai Iced Tea for my friend and my diet drink was under $35 including the tip.\n\nI will go back, for sure.", "rating": 4, "date": "2011-02-26"}, {"excerpts": ["The vegetarian Pad See Yoo and the green curry are a definite must. ", "Filled with fresh veggies. ", "The green curry is spice and they can't make it mild for some reason. ", "The coconut soup is super good for one of those cold nights. "], "author": "Katie Anne N.", "review": "Wow, this place is good. The decor looks like the inside of a 1970's single family home. It is cute and quaint. The food is excellent. The vegetarian Pad See Yoo and the green curry are a definite must. Filled with fresh veggies. The green curry is spice and they can't make it mild for some reason. The coconut soup is super good for one of those cold nights. Medium fills 2 tummies. \n\nGreat Thai place for the Sunset District. Parking can be tough but is do-able with patience.", "rating": 5, "date": "2008-11-30"}, {"excerpts": ["if ordering, stay away from the pad see ew and the green curry ", "it looked like they reheated someone else's leftover box they forgot to take after their meal. ", "ugh! "], "author": "curi k.", "review": "wow this place was insanely not that good.  where the spices yo!\n\nwhat is the sunset smoking or maybe lanna was having a bad night cuz clearly the vegetables on my dish came from the frozen food isle, possibly the canned isle. \n\nif ordering, stay away from the pad see ew and the green curry it looked like they reheated someone else's leftover box they forgot to take after their meal. ugh! but i kept chugging into my mouth cuz im asian and need to eat everything on my plate.\n\ngood luck guys. sorry for the bad review, i know you cherish your yelp reviews but it had to have been said.", "rating": 2, "date": "2008-05-02"}], "fish cake": [{"excerpts": ["Nothing special and the soup water tastes funny4/10 \n\nFish cake 6 small ass pieces cut in half with sweet dipping sauce 7/10. "], "author": "Dan M.", "review": "Microwave beeping in the kitchen. Beep beep beep red flags \nOne of the worst Thai food I have ever tasted.\nLacked flavor , authenticity , skill.\n\nLocal mom and pop shop. Nice decor and good service. Guy takes orders lady cooks in the back. Since 1988 but place was empty when I arrived and how you manage to stay open for so long with the type of product you provide \n\nsome house soup cabbage msg water. \nNothing special and the soup water tastes funny4/10 \n\nFish cake 6 small ass pieces cut in half with sweet dipping sauce 7/10. Had some ok flavor but the portion is way to skimp.\n\nPad thai worst I have ever had in the city. Skimp portion meat and tofu looked so skimp. 3/10\nHollywood Thai pad Thai where are you in SF? \n\nI had high hopes but when you tried good Thai food in LA this place can't compare/compete. Save yourself the trouble and money and stay away from the food here. \nOverall the food sucks! The service is good but who goes for service unless you want to :)", "rating": 1, "date": "2016-09-03"}, {"excerpts": ["we ordered an extra cup since there were 3 of us)\nFish Cake Appetizer\nYellow Curry with Chicken\nGarlic Pork\nSteamed rice\n- Sauteed veggies with tofu (don't remember the name, it wasn't very memorable)\n\n"], "author": "Jenna H.", "review": "~3.5 Stars~\n\nWhile the food was tasty and delicious, their portions were a bit lacking. I didn't know if it was because we walked in 30 minutes before closing, but it seems from other reviews that we were not the only ones who felt this way. (I felt bad right before closing--but we spent all day moving into a place a couple blocks away so we were hungry and it was the only open closeby option)\n\nWE ORDERED:\n- $30 dinner for 2 set which included:\nTom Yum Soup (2 cups -- we ordered an extra cup since there were 3 of us)\nFish Cake Appetizer\nYellow Curry with Chicken\nGarlic Pork\nSteamed rice\n- Sauteed veggies with tofu (don't remember the name, it wasn't very memorable)\n\nTHE GOOD: \n+ Everything was tasty\n+ The Soup wasn't overly sour and I really enjoyed this\n+ The Curry flavor was very good\n+ I like the mom&pop service atmosphere\n+ Very friendly and fast to refill water\n\nTHE BAD:\n- Small portions and therefore not worth the price\n- Slow service getting food out (even though we were the ONLY people in the place)\n- Thai curry is made with coconut milk which gives it a thinner consistency than Chinese/Japanese Curry. I found it very odd that they served this on a plate instead of in a bowl, so it just spread out over the entire plate which made the amount of chicken seem very sparse and made it more difficult to spoon it onto the rice (very tasty though!).", "rating": 3, "date": "2015-02-05"}], "chicken satay": [{"excerpts": ["I ordered Chicken Satay. ", "No peanuts in sauce, tastes sweet and pre-made. ", "Chicken tasted bad, like it was microwaved. ", "No Thai tea with out cream and sugar. ", "Pre made. "], "author": "Mario A.", "review": "Walking around and walk in here. Clean, friendly waiter but... Food is , ok. No where near the quality of Marnies and on the lower end of Thai food. \n\nI ordered Chicken Satay. No peanuts in sauce, tastes sweet and pre-made. Chicken tasted bad, like it was microwaved. No Thai tea with out cream and sugar. Pre made. Food looked nothing like the picture. \n\nNot good for San Francisco. This pace belongs in the Burbs. Disappointed.", "rating": 2, "date": "2017-10-25"}, {"excerpts": ["The $6.25 order of Chicken Satay came with a couple of skewers marinated in curry paste and accompanied by the all-critical peanut sauce with a nice consistency (see photo). ", "Entrees were solid. "], "author": "Ed U.", "review": "Lanna is not a place I would have found on my own. San Francisco is not one city but a cluster of culinary micro-climates like the heavily Asian fog bank that makes up this stretch of Noriega in the Outer Sunset. My massage therapist (yes, I have one...sometimes...don't judge me!) recommended it to me a while ago, and he looks like a very healthy eater with a penchant for spicy Southeast Asian by way of his Malaysian-bred wife. So I convinced Jamie W. to make the trek with me to try it on an evening where we felt the need to try something healthy. We didn't accomplish \"healthy\", but we managed to have some surprisingly good eats for the drive. \n\nWe started with a hearty $6.95 bowl of Tohm Kah, the coconut milk soup with chicken, mushroom, baby corns, green onion, lemongrass and lemon juice (see photo). Perfect starter on a cold night. The $6.25 order of Chicken Satay came with a couple of skewers marinated in curry paste and accompanied by the all-critical peanut sauce with a nice consistency (see photo). Entrees were solid. We went even more predictable with the $7.25 Pad Kee Mao, which offered the thick chow fun noodles mixed with chicken, broccoli and bok choy (see photo). \n\nJamie went back to his Kentucky roots when he was drawn to the $8.50 Barbecue Chicken, which came with four big pieces slathered with a sweet curry sauce that wasn't too overwhelming (see photo). It didn't seem like a particularly Thai dish but who cares. We should have been sated, but we decided to try the desserts since we made room. The $2.75 Flan was delicious enough, but the standout was the $3.75 Fried Banana with Coconut Ice Cream. Fried with a crunchy crust and a nice contrast to the bracing coconut flavor of the ice cream (see photos). Definitely worth a trip out to the far reaches of the Sunset for us downtown types. \n\nFOOD - 4 stars...excellent Thai dishes, well priced \nAMBIANCE - 3.5 stars...compact place, could do without the lotto boards \nSERVICE - 3.5 stars...good though attention wavers when big parties come in \nTOTAL - 4 stars...barbecue chicken and fried bananas almost give this Thai place a country twang", "rating": 4, "date": "2011-01-04"}, {"excerpts": ["Other dishes we ordered: The Pad Thai and the Beef w/ spinach were probably the best out of everything we tried; Panang Beef (okay); Yellow Curry (okay); And Chicken Satay (super dry)"], "author": "jesiree b.", "review": "Since we were in the area, my family and I decided to try this spot for dinner. The staff was very attentive, which is probably the only thing that was memorable. I'm saying this because every dish we had was just OKAY...not bad, but just okay.  Our entrees didn't really look too presentable and there was just way more sauce on the dish than there was meat or vegetables - we didn't have enough to share amongst 6 ppl. \n\nI made sure to order the peanut sauce (which we had with tofu as an appetizer) since it was one of the highlights of Lanna on Yelp. They even sell their sauce for $5 a jar!  When I finally got to taste it, I was pretty disappointed because it tasted like they just melted spoonfuls of Skippy.\n\nOther dishes we ordered: The Pad Thai and the Beef w/ spinach were probably the best out of everything we tried; Panang Beef (okay); Yellow Curry (okay); And Chicken Satay (super dry)", "rating": 3, "date": "2010-03-10"}, {"excerpts": ["The chicken satay tastes like yellow curry and peanut sauce and the fried stuffed chicken was really weird. ", "My boyfriend wouldn't even eat it after the first bite. ", "The soup and the beginning was weird too. "], "author": "Melinda M.", "review": "Meh.\nIt has potential. We came here craving Thai food and it had pretty good reviews. I guess if you like plain Thai food this is the place to go. But I love Thai because of its amazing flavored. I got the yellow curry. It wasn't gross, it was just alright. It tastes like something my mom could make. My boyfriend got the spicy crispy fish, he thought it was okay.  I thought it was too salty and tasted really fishy like the fish had been sitting in the fridge for a while. \nWe got the sampler appetizer. The egg rolls were tiny but pretty good. The chicken satay tastes like yellow curry and peanut sauce and the fried stuffed chicken was really weird. My boyfriend wouldn't even eat it after the first bite. The soup and the beginning was weird too. It reminded me of swimming pool water haha\n\nThe waiter was really nice but the service took a life time. We were there for over an hour. Waiting 20 minutes just for them to take our credit card. Eventually my boyfriend just went to the window and paid. \n\nLike I said its not terrible but I probably wouldn't eat there again. If I do for some reason I'd try the pad Thai next time. \n\nSuper cheap though so that's great. I guess.", "rating": 2, "date": "2013-07-10"}, {"excerpts": ["We also had this coconut-based soup, spring rolls, chicken satay, and fried banana with coconut ice cream. ", "So yum. ", "I will be back when I'm craving Thai again!"], "author": "Stephanie G.", "review": "This place is a fairly small, family-owned restaurant. Our server was very friendly and I thought their food was pretty good.  I really liked that you could make your entree a combo by paying only $5.99 more! The combo includes soup, an appetizer, and dessert; such a good deal! i ordered the pad see ew and my boyfriend ordered a seafood curry dish (forgot what it's called). We also had this coconut-based soup, spring rolls, chicken satay, and fried banana with coconut ice cream. So yum. I will be back when I'm craving Thai again!", "rating": 4, "date": "2013-03-22"}, {"excerpts": ["Chicken Satay Skewers- ", "Tasted like they were microwaved\nPad See ", "Ew- Discolored, bland, with weeks old broccoli\nSpicy Angel Chicken Wings- "], "author": "jeff c.", "review": "Are you serious!? How is this place even averaging four stars? I must have come in on an off day or something because this was one of the worst Thai joints I've ever dined at.\n\nA few friends and I came here for lunch a few days ago. I was pretty excited to try the place out because I used to eat at a Lanna Thai out in Oklahoma when I lived there for a little bit. Thai food in the Midwest? Yeah I know...I was blown away too because it was the best Thai I've ever had. I was hoping that by some small chance this Noriega one was part of a huge chain. Let me tell you...shit didn't even come close.\n\nHere's what we ordered:\n\nPad Thai- Strangely discolored, and painfully bland\nChicken Satay Skewers- Tasted like they were microwaved\nPad See Ew- Discolored, bland, with weeks old broccoli\nSpicy Angel Chicken Wings- Only thing that could pass as edible\nLanna Fried Rice- Supposedly their specialty, but once again was dreadfully bland, overcooked, and looked like cafeteria food.\n\nI would have given this place a one star, but the fact they had video Keno to keep me entertained bumped it up to two. If you're looking for bargain Thai in the Sunset, do King of Thai--it's quick and decent. If you're in the mood for something a little more high end, drop on by Marnee Thai. Whatever you do, though, I'd advise you to stay away from this place.", "rating": 2, "date": "2008-08-19"}, {"excerpts": [":) whenever I come here I always order the chicken Satay, spicy angle wings ", "( it's spicy and the sauce is really really good) ", "the soup with the coconut is really good too because u can actually taste the coconut inside (sorry don't remember the name). ", "Overall the food is really good. ", "I come here often because the service is outstanding, always very nice and friendly ", ":)"], "author": "Phuong N.", "review": "This is so far one of the best Thai restaurant in sf :) whenever I come here I always order the chicken Satay, spicy angle wings ( it's spicy and the sauce is really really good) the soup with the coconut is really good too because u can actually taste the coconut inside (sorry don't remember the name). Overall the food is really good. I come here often because the service is outstanding, always very nice and friendly :)", "rating": 4, "date": "2011-06-05"}, {"excerpts": ["The chicken satay with peanut sauce is the best I've ever tasted, and the custard dessert.... ", "well, if it weren't for a sense of what's right, I would probably eat 4-5 of them at one sitting."], "author": "Arthur C.", "review": "This was the first place I ever tried Thai food, so it set the standards for me. The chicken satay with peanut sauce is the best I've ever tasted, and the custard dessert.... well, if it weren't for a sense of what's right, I would probably eat 4-5 of them at one sitting.", "rating": 5, "date": "2007-08-09"}, {"excerpts": ["Pad Thai (covered in prawns, a delight), Chicken Satay (mmmm), rolls (double mmmm) and Lanna Fried Rice (their specialty). ", "Although I have not eaten at the restaurant, I can say they had been courteous and prompt with our order. ", "I would recommend going there for dinner."], "author": "Valerie V.", "review": "We had Lanna Thai cater a birthday party. The food was good. Pad Thai (covered in prawns, a delight), Chicken Satay (mmmm), rolls (double mmmm) and Lanna Fried Rice (their specialty). Although I have not eaten at the restaurant, I can say they had been courteous and prompt with our order. I would recommend going there for dinner.", "rating": 3, "date": "2008-05-06"}], "moo yang barbeque pork": [], "barbeque chicken": [], "broccoli beef": [], "mondays special": [], "tuesdays special": [], "wednesdays special": [], "thursdays special": [], "fridays special": [], "saturdays special": [], "pad thai  barbeque chicken": [], "house soup": [{"excerpts": ["Since 1988 but place was empty when I arrived and how you manage to stay open for so long with the type of product you provide \n\nsome house soup cabbage msg water. \n"], "author": "Dan M.", "review": "Microwave beeping in the kitchen. Beep beep beep red flags \nOne of the worst Thai food I have ever tasted.\nLacked flavor , authenticity , skill.\n\nLocal mom and pop shop. Nice decor and good service. Guy takes orders lady cooks in the back. Since 1988 but place was empty when I arrived and how you manage to stay open for so long with the type of product you provide \n\nsome house soup cabbage msg water. \nNothing special and the soup water tastes funny4/10 \n\nFish cake 6 small ass pieces cut in half with sweet dipping sauce 7/10. Had some ok flavor but the portion is way to skimp.\n\nPad thai worst I have ever had in the city. Skimp portion meat and tofu looked so skimp. 3/10\nHollywood Thai pad Thai where are you in SF? \n\nI had high hopes but when you tried good Thai food in LA this place can't compare/compete. Save yourself the trouble and money and stay away from the food here. \nOverall the food sucks! The service is good but who goes for service unless you want to :)", "rating": 1, "date": "2016-09-03"}, {"excerpts": ["Even though she couldn't drink the house soup (chicken broth!), we got pad see ew and pad thai vegetarian dishes, as well as the coconut soup and a vegetarian curry. ", "All were quite delicious and I got the stuffed chicken wings to satisfy my carnivorous side "], "author": "Kris Q.", "review": "STILL one of my favorite Thai joints in the city. It's a lovely couple owned and operated business and, after a trip down to Anaheim, one of the reasons I love living in the city -- for delicious, unique food made by pleasant people.\n\nCame here with a foreign friend that was allergic to dairy as well as a vegetarian. Didn't realize just how many vegetarian options Lanna has to offer. Even though she couldn't drink the house soup (chicken broth!), we got pad see ew and pad thai vegetarian dishes, as well as the coconut soup and a vegetarian curry. All were quite delicious and I got the stuffed chicken wings to satisfy my carnivorous side :).\n\nYou really can't go wrong with Lanna's specialty, stuffed chicken wings. I just need to emphasize just HOW good they are, plus you can have them almost every day of the week paired with a curry or noodle through the daily lunch specials.\n\nAs like most Thai joints, lunches are relatively cheap and dinners are considerably pricier. Lanna is like this, but like GOOD Thai joints, completely worth it. The menu has something for everyone from classic dishes to more unique ones that you WON'T be able to find just anywhere.\n\nService is usually very good unless there's a surge of customers. The food is consistently delicious. And best of all, the restaurant is VERY clean (look at those scorecards!!). Bonus: I love drinking the water out of the wine glasses like I'm a huge deal. Score!\n\nParking: Noriega isn't as horrible as Irving but not as good as Taraval. When I go for lunch, I try to parking across 19th avenue near the more residential side (no meters). Beware of street cleaning!", "rating": 5, "date": "2011-08-01"}, {"excerpts": [":\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  ", "deilish, perfect combination -- all ", "compliment each other well.........", "bbq chicke is very tasty.  ", "note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but ", "hub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) ", "w/ sauce & veggie on the side & an order of rice OR  "], "author": "Cindi N.", "review": "stars are for the consistently good food, friendly service & reliability (explained below).\n\nhave been coming here for years!  this is a family owned (husband & wife) restaurant.  has a nice, cozy, homey feel -- just eat, no scene restaurant, .   we're always welcomed by the husband's friendly service.  once in a great while we get to say \"hi\" to the wife, when she's not busy cooking in the kitchen.  nice \"reliable\" restaurant in the sense that, if we're starving & we want to eat now, we know we don't have to wait to be seated, tables are readily available.  or we go here if we don't want to get dressed up & deal with the scene, cause there's absolutely no scene here....and we know what we're getting, our usual -- which is consistently good.\n\nour usual:\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  deilish, perfect combination -- all compliment each other well.........bbq chicke is very tasty.  note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but i like it & appreciate that lanna has its own flavor..........\n\nhub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) w/ sauce & veggie on the side & an order of rice OR  the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\noccassionally we've ordered:\n- deep-fried calamari tossed w/ garlic, salt & pepper, carrot, red onion, cilantro & green onion........one of our favorite deep-fried calamari, tasty, spicy, a bit on the salty side.....\n- thai iced tea -- nothing special\n\nwe've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........i remember i thought they all tasted good.........but the past 8 - 10 years i've stuck to the usual & happy with that............i  go there specifically cause i'm craving the usual.......\n\ni'll have to agree w/ the other reviews -- they do have one of the best peanut sauce.  used to buy a jar of peanut sauce to take home & dip bbq chicken or add to a bbq chicken sandwich (asian/thai style).", "rating": 4, "date": "2007-07-25"}], "sweet chili sauce": [{"excerpts": [":\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  ", "deilish, perfect combination -- all ", "compliment each other well.........", "bbq chicke is very tasty.  ", "note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but ", "hub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) ", "w/ sauce & veggie on the side & an order of rice OR  "], "author": "Cindi N.", "review": "stars are for the consistently good food, friendly service & reliability (explained below).\n\nhave been coming here for years!  this is a family owned (husband & wife) restaurant.  has a nice, cozy, homey feel -- just eat, no scene restaurant, .   we're always welcomed by the husband's friendly service.  once in a great while we get to say \"hi\" to the wife, when she's not busy cooking in the kitchen.  nice \"reliable\" restaurant in the sense that, if we're starving & we want to eat now, we know we don't have to wait to be seated, tables are readily available.  or we go here if we don't want to get dressed up & deal with the scene, cause there's absolutely no scene here....and we know what we're getting, our usual -- which is consistently good.\n\nour usual:\ni get the daily special:  starting with their tom kah kai soup (chicken, lemongrass coconut soup -- instead of the house soup, add $1),  bbq chicken w/side of sweet chili sauce, pad thai & rice.  deilish, perfect combination -- all compliment each other well.........bbq chicke is very tasty.  note, not your typical pad thai -- noodles aren't flat & are thinner, does taste different -- but i like it & appreciate that lanna has its own flavor..........\n\nhub starts with the tom kah kai soup (instead of the house soup, add $1), then he either gets the beef brochette (charcoal broiled) w/ sauce & veggie on the side & an order of rice OR  the lanna brochette which is the same beef brochette with charcoal broiled prawns.  delish too!   \n\noccassionally we've ordered:\n- deep-fried calamari tossed w/ garlic, salt & pepper, carrot, red onion, cilantro & green onion........one of our favorite deep-fried calamari, tasty, spicy, a bit on the salty side.....\n- thai iced tea -- nothing special\n\nwe've had the special with  pad thai w/ one of the following curries: mussamun curry or thai yellow curry (good, but nothing special) or panang curry..........i remember i thought they all tasted good.........but the past 8 - 10 years i've stuck to the usual & happy with that............i  go there specifically cause i'm craving the usual.......\n\ni'll have to agree w/ the other reviews -- they do have one of the best peanut sauce.  used to buy a jar of peanut sauce to take home & dip bbq chicken or add to a bbq chicken sandwich (asian/thai style).", "rating": 4, "date": "2007-07-25"}], "carrot sauce": [], "peanut sauce oz jar": [], "custard": [{"excerpts": ["The chicken satay with peanut sauce is the best I've ever tasted, and the custard dessert.... ", "well, if it weren't for a sense of what's right, I would probably eat 4-5 of them at one sitting."], "author": "Arthur C.", "review": "This was the first place I ever tried Thai food, so it set the standards for me. The chicken satay with peanut sauce is the best I've ever tasted, and the custard dessert.... well, if it weren't for a sense of what's right, I would probably eat 4-5 of them at one sitting.", "rating": 5, "date": "2007-08-09"}], "banana fritter": [{"excerpts": ["banana fritter ", ", I can't eat like I use to but this was really the best part for the end of the meal. ", "Crispy crunch outside, soft inside. ", "Love it with coconut ice cream"], "author": "Myron L.", "review": "I've been here coming here for years. I swear the food has never changed. I can't say what is authentic but Paul and his wife makes it as authentic as I think it can be to me. Every other Thai restaurant Just doesn't cut it for me compared to lanna's.\n\n- Thai ice tea, can't go wrong or maybe I just like the one here more \n\n-Tom kah Kai aka coconut soup is my favorite soup here. The lemony scent and slight sourness with the aromatic coconut flavor just makes me want some now talking about it. What can I say. This soup got some of my favorite flavors in there and they make it good.\n\n- appetizers . I don't think I've gone wrong with any of the apps here. the appetizer sampler is great for 2 people to try a few things\n\n- stuffed chicken wings is fried, soft, and it's just good. they actually use to stuff the filling between the bones but that was 10-15 years ago?\n\n- lanna fried rice, the rice with everything in it and it's really good. Pineapples, tomatoes, dried pork shreds, raisins, chicken, shrimp. The seasoning is yum\n\n- Kai yang, the bbq chicken isn't always available but it's a great deal for the quantity, flavor, and price\n\n-fried banana fritter , I can't eat like I use to but this was really the best part for the end of the meal. Crispy crunch outside, soft inside. Love it with coconut ice cream", "rating": 5, "date": "2016-03-16"}, {"excerpts": ["We had the Yellow Curry with a side of white rice http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=B8x0c8VnTHY4LLQGLS860A, Veggie Pad Thai http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=G61x-p3lL8IjO96vC2DHmQ, and a Banana Fritter with Green Tea Ice Cream http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=gaT9Am3XHOHNf7AabUcQSw. ", "The owner was really nice as well and his service was quick too.\n \n", "[W] ", "We were just 1 of the 2 couples in the restaurant ", "so it wasn't that busy. ", "Parking was extremely easy today; basically we got a parking spot right in front of the restaurant. "], "author": "Mona C.", "review": "[M]ona: 4 Stars\n[W]ayne: 4.5 Stars\nAverage: 4.25 Stars\n\n+ Excellent Service\n+ Accepts Credit Cards\n+ Inexpensive\n+ Extensive Menu\n+ Daily Specials\n+ Quick Service\n\n[W] So tonight me and Mona had a craving for rather Thai or some other Asian spot and I'm really glad we came here. Mona has a knack of dragging me to places where she HAD eaten before but she just procrastinates so much that she forgets how everything was so she takes me to review it first haha. \n\n[M] That's why I have you baby! XD\n\nThe food here was actually pretty good. We had the Yellow Curry with a side of white rice http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=B8x0c8VnTHY4LLQGLS860A, Veggie Pad Thai http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=G61x-p3lL8IjO96vC2DHmQ, and a Banana Fritter with Green Tea Ice Cream http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=gaT9Am3XHOHNf7AabUcQSw. The owner was really nice as well and his service was quick too.\n \n[W] We were just 1 of the 2 couples in the restaurant so it wasn't that busy. Parking was extremely easy today; basically we got a parking spot right in front of the restaurant. There was really nothing bad to say at all with this restaurant dispute the Caucasian couple behind us was speaking Jesus and talking VERY loudly. \n\nThe curry didn't taste pasty or sandy (if you ever had bad curry) and the pad thai was very saucy and smooth. It was funny because when the other couple left, the owner was cleaning the table and he looked at us and he was like \"wow you guys are so clean!\" My bad was to their table so I looked back and mannnnnn, they were pigs lol. Crap on the table, crap on the floor.....aiya lol. Anyways, yea this place is awesome and the owner was awesome also. JUST AWESOME!! lol (Relating to I Love You Man).", "rating": 4, "date": "2010-04-07"}, {"excerpts": ["love the Banana fritter desert as well as the stuffed chicken wings. ", "The dining area is small and cozy and service attentive. ", "Enjoy!"], "author": "Gilski R.", "review": "We have been coming to Lanna Thai over the years and the food is always consistently good. love the Banana fritter desert as well as the stuffed chicken wings. The dining area is small and cozy and service attentive. Enjoy!", "rating": 5, "date": "2013-11-29"}, {"excerpts": ["The banana fritter and coconut ice cream were very delicious! ", "I will probably be back, since it's the only thai place in my hood."], "author": "Lily P.", "review": "I just tried this place for the first time. It's a few blocks from my house so I decided to check it out. We got the appetizer combo, and it was alright. I got the tom kha soup with tofu and it was pretty good. It had a lot of lemongrass, which i like, but not enough coconut milk. There were a lot of veggies in the soup though, so that made up for it. The banana fritter and coconut ice cream were very delicious! I will probably be back, since it's the only thai place in my hood.", "rating": 3, "date": "2009-11-10"}], "banana fritter with vanilla ice cream": [], "banana fritter with coconut ice cream": [], "banana fritter with green tea ice cream": [{"excerpts": ["We had the Yellow Curry with a side of white rice http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=B8x0c8VnTHY4LLQGLS860A, Veggie Pad Thai http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=G61x-p3lL8IjO96vC2DHmQ, and a Banana Fritter with Green Tea Ice Cream http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=gaT9Am3XHOHNf7AabUcQSw. ", "The owner was really nice as well and his service was quick too.\n \n", "[W] ", "We were just 1 of the 2 couples in the restaurant ", "so it wasn't that busy. ", "Parking was extremely easy today; basically we got a parking spot right in front of the restaurant. "], "author": "Mona C.", "review": "[M]ona: 4 Stars\n[W]ayne: 4.5 Stars\nAverage: 4.25 Stars\n\n+ Excellent Service\n+ Accepts Credit Cards\n+ Inexpensive\n+ Extensive Menu\n+ Daily Specials\n+ Quick Service\n\n[W] So tonight me and Mona had a craving for rather Thai or some other Asian spot and I'm really glad we came here. Mona has a knack of dragging me to places where she HAD eaten before but she just procrastinates so much that she forgets how everything was so she takes me to review it first haha. \n\n[M] That's why I have you baby! XD\n\nThe food here was actually pretty good. We had the Yellow Curry with a side of white rice http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=B8x0c8VnTHY4LLQGLS860A, Veggie Pad Thai http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=G61x-p3lL8IjO96vC2DHmQ, and a Banana Fritter with Green Tea Ice Cream http://www.yelp.com/biz_photos/6y26VcGgSuiJrcXk6YKXyw?select=gaT9Am3XHOHNf7AabUcQSw. The owner was really nice as well and his service was quick too.\n \n[W] We were just 1 of the 2 couples in the restaurant so it wasn't that busy. Parking was extremely easy today; basically we got a parking spot right in front of the restaurant. There was really nothing bad to say at all with this restaurant dispute the Caucasian couple behind us was speaking Jesus and talking VERY loudly. \n\nThe curry didn't taste pasty or sandy (if you ever had bad curry) and the pad thai was very saucy and smooth. It was funny because when the other couple left, the owner was cleaning the table and he looked at us and he was like \"wow you guys are so clean!\" My bad was to their table so I looked back and mannnnnn, they were pigs lol. Crap on the table, crap on the floor.....aiya lol. Anyways, yea this place is awesome and the owner was awesome also. JUST AWESOME!! lol (Relating to I Love You Man).", "rating": 4, "date": "2010-04-07"}], "fried banana with vanilla ice cream": [], "fried banana with coconut ice cream": [{"excerpts": ["For dessert, we shared the fried banana with coconut ice cream, and savored it to the last bite. ", "The environment is pretty ornate ", "and there's lots of seating. ", "Service was great and our waiter was funny. ", "I will be back!"], "author": "Corinna T.", "review": "Try this place out!! I was pleasantly surprised at the tastiness of the food here for under $7! Daily lunch specials M-F cost only $6.95, are filling, and the whole menu ranges around the same price too. Today my friends and I all ordered the daily special and we all loved it: pad thai with rice and bbq chicken. For dessert, we shared the fried banana with coconut ice cream, and savored it to the last bite. The environment is pretty ornate and there's lots of seating. Service was great and our waiter was funny. I will be back!", "rating": 4, "date": "2014-12-10"}, {"excerpts": ["The $2.75 Flan was delicious enough, but the standout was the $3.75 Fried Banana with Coconut Ice Cream. ", "Fried with a crunchy crust and a nice contrast to the bracing coconut flavor of the ice cream (see photos). "], "author": "Ed U.", "review": "Lanna is not a place I would have found on my own. San Francisco is not one city but a cluster of culinary micro-climates like the heavily Asian fog bank that makes up this stretch of Noriega in the Outer Sunset. My massage therapist (yes, I have one...sometimes...don't judge me!) recommended it to me a while ago, and he looks like a very healthy eater with a penchant for spicy Southeast Asian by way of his Malaysian-bred wife. So I convinced Jamie W. to make the trek with me to try it on an evening where we felt the need to try something healthy. We didn't accomplish \"healthy\", but we managed to have some surprisingly good eats for the drive. \n\nWe started with a hearty $6.95 bowl of Tohm Kah, the coconut milk soup with chicken, mushroom, baby corns, green onion, lemongrass and lemon juice (see photo). Perfect starter on a cold night. The $6.25 order of Chicken Satay came with a couple of skewers marinated in curry paste and accompanied by the all-critical peanut sauce with a nice consistency (see photo). Entrees were solid. We went even more predictable with the $7.25 Pad Kee Mao, which offered the thick chow fun noodles mixed with chicken, broccoli and bok choy (see photo). \n\nJamie went back to his Kentucky roots when he was drawn to the $8.50 Barbecue Chicken, which came with four big pieces slathered with a sweet curry sauce that wasn't too overwhelming (see photo). It didn't seem like a particularly Thai dish but who cares. We should have been sated, but we decided to try the desserts since we made room. The $2.75 Flan was delicious enough, but the standout was the $3.75 Fried Banana with Coconut Ice Cream. Fried with a crunchy crust and a nice contrast to the bracing coconut flavor of the ice cream (see photos). Definitely worth a trip out to the far reaches of the Sunset for us downtown types. \n\nFOOD - 4 stars...excellent Thai dishes, well priced \nAMBIANCE - 3.5 stars...compact place, could do without the lotto boards \nSERVICE - 3.5 stars...good though attention wavers when big parties come in \nTOTAL - 4 stars...barbecue chicken and fried bananas almost give this Thai place a country twang", "rating": 4, "date": "2011-01-04"}, {"excerpts": ["We also had this coconut-based soup, spring rolls, chicken satay, and fried banana with coconut ice cream. ", "So yum. ", "I will be back when I'm craving Thai again!"], "author": "Stephanie G.", "review": "This place is a fairly small, family-owned restaurant. Our server was very friendly and I thought their food was pretty good.  I really liked that you could make your entree a combo by paying only $5.99 more! The combo includes soup, an appetizer, and dessert; such a good deal! i ordered the pad see ew and my boyfriend ordered a seafood curry dish (forgot what it's called). We also had this coconut-based soup, spring rolls, chicken satay, and fried banana with coconut ice cream. So yum. I will be back when I'm craving Thai again!", "rating": 4, "date": "2013-03-22"}], "fried banana with green tea ice cream": [], "fried ice cream": [{"excerpts": ["The pad thai and egg rolls were both bomb and the fried ice cream for desert left me so full, but in the best possible way. ", ":)"], "author": "Olympia Z.", "review": "This place was awesome. Very nice homey feeling. The pad thai and egg rolls were both bomb and the fried ice cream for desert left me so full, but in the best possible way. :)", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["FRIED ICE CREAM!!", "! "], "author": "Gillian Y.", "review": "My husband and I come here very often. The owners are from Chiang Mai and have been in business for many years. The wife cooks and her husband serves. Very homey and feels like you are visiting family. I really like the Pad Thai because i don't like the very sweet or oily renditions elsewhere. The Basil Fish is really yummy too. My husband likes to get the daily special (usually Pad Thai, rice and different types of curry depending in the day, sometimes include their stuffed chicken wings). Oh! FRIED ICE CREAM!!! need i say more. \n\nIt is a little quiet but I personally like it without the rush and wait!", "rating": 5, "date": "2010-01-03"}, {"excerpts": ["Fried ice cream! ", "Probably the best I've ever had.  ", "Honey over a crispy doughy shell over ice cream.... can't ask for more *drool*"], "author": "S. D.", "review": "Great neighborhood eat!  I love this wife and husband duo.  They're always in the mood for conversation if you want, and the food is not bad.  Nothing fancy but definitely still worth your while.  My favorite thing on the menu? Fried ice cream! Probably the best I've ever had.  Honey over a crispy doughy shell over ice cream.... can't ask for more *drool*", "rating": 4, "date": "2011-10-11"}, {"excerpts": ["The best kept secret dessert in the Sunset neighborhood is Lanna Thai's fried ice cream.  ", "$3 and enough to share with someone."], "author": "George K.", "review": "The best kept secret dessert in the Sunset neighborhood is Lanna Thai's fried ice cream.  $3 and enough to share with someone.", "rating": 5, "date": "2010-07-28"}, {"excerpts": ["I also had the fried ice cream for dessert which was awesome as well. ", "The gentleman who waited on us was so sweet and cute. ", ":) will def be going back!"], "author": "Tara T.", "review": "My friend and I found this place on a whim. It was incredible! The calamari was the best I have ever had with an amazing blend of spices. I also had the fried ice cream for dessert which was awesome as well. The gentleman who waited on us was so sweet and cute. :) will def be going back!", "rating": 5, "date": "2013-11-12"}, {"excerpts": ["- they got fried ice cream! "], "author": "Karin L.", "review": "- nice small quiet place. great place to chat. \n\n- lots of Thai decorations on the walls, lots of mirrors\n\n- we were the only customer. went around 12:40pm.\n\n- there was no one around..stood around a while.. until the waiter came out from the restroom.\n\n- we get to choose where to sit.\n\n- they got a decent menu~ dish price range around $5 up.\n\n- they got fried ice cream! which my friend was interest in.. but \ncomplained it was kinda of too sweet as honey was added to it.\n\n- we had to wait a bit for the food, as i believe only one person was cooking it~ maybe the wife?\n\n- the service was great~ maybe because we were the only ones.. he refilled our water without asking~~ as we got curry rice.\n\n- friend also complained that they gave small portions. so if you like to big portions..this is not the place~ unless you either order more, or go get more food outside of this restaurant.\n\n- oh yeah. before our dishes came, we were given a small bowl of soup~ I'm not sure if this was included in our order or not. But the soup was pretty good. Very Fresh aftertaste. haha or maybe i was just thirsty\n\n- 3 people = around $30.  3 dishes, 2 drinks, and a dessert.\n\n-overall, this place is great, food is okay~ normal. not very great, but not very poor...it's right in the middle. Feels like I'm eating a home dinner or the sort.  if you like Thai food. this is the place. =)", "rating": 4, "date": "2008-04-17"}], "vanilla ice cream": [], "green tea iced cream": [], "hot coffee or hot tea": [], "iced tea sweetened": [], "water melon with tapioca pearl": [], "honey dew with tapioca pearl": [], "thai coffee with tapioca pearl": [], "thai tea with tapioca pearl": []}