{"san pellegrino sparkling mineral water": [], "tavern salad": [{"excerpts": ["I had the tavern salad with chicken and a happy hour margarita.  ", "I wondered about the flavor of a $5 drink but it was very tasty.  ", "The $5 is for the small glass I think.  ", "The salad was very good- ", "although next time I'll ask for the dressing on the side- ", "the chef had a heavy had this time.  ", "Service is friendly and quick.  ", "I was surprised there wasn't more folks in the bar since the prices are very reasonable for the area and the food terrific."], "author": "Buzzy B.", "review": "This is an awesome neighborhood bar.  Was staying at a local hotel and the front desk recommended this.  I had the tavern salad with chicken and a happy hour margarita.  I wondered about the flavor of a $5 drink but it was very tasty.  The $5 is for the small glass I think.  The salad was very good- although next time I'll ask for the dressing on the side- the chef had a heavy had this time.  Service is friendly and quick.  I was surprised there wasn't more folks in the bar since the prices are very reasonable for the area and the food terrific.", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["Tavern salad, burger and chicken sandwich did not disappoint. ", "We will be back!"], "author": "Sara P.", "review": "Great food and even better atmosphere! Immaculately clean and Shibley, the manager, went out of his way to make sure we were taken care of! We were in from out of town for the weekend and came here twice! Tavern salad, burger and chicken sandwich did not disappoint. We will be back!", "rating": 5, "date": "2015-10-04"}], "spinach and kale salad": [], "pear gorgonzola salad": [{"excerpts": ["The pear Gorgonzola salad was nice. ", "The seating is unique because you can sit at the bar, at tables, or little nook type boothes."], "author": "Gretchen H.", "review": "Cool little sports bar that plays classic rock. Relaxed atmosphere, except the server was a bit hasty. The pear Gorgonzola salad was nice. The seating is unique because you can sit at the bar, at tables, or little nook type boothes.", "rating": 3, "date": "2015-11-19"}], "grilled new york steak": [], "anchor steam beer battered fish and chips plate": [], "sizzling fajitas plate": [], "jagerschnitzel": [{"excerpts": ["Asked for recommendations and was told the Jagerschnitzel with mushroom sauce and spaetzle was excellent.  ", "boy was that not right.  ", "the meat was dry and tasteless.  ", "and you know this is the case when they overloaded with the brown sauce (brown sauce is always used to hide bad food).  ", "unfortunately that sauce was also tasteless.  ", "finally i cannot believe that this place thinks spaetzle was to be grilled and serviced last it were hash browns.  "], "author": "Tim F.", "review": "3- ambiance is nice.   interesting location.  interesting interior design.  a bit dark but that is okay.  Multiple tvs to watch games.   \n3.  Services.  Great.  Friendly people.  attentive.  might be a 4 but the recommendation of what i ate was so off, knocked a point off the rating.\n1. food.   this is where it went to bad.  Asked for recommendations and was told the Jagerschnitzel with mushroom sauce and spaetzle was excellent.  boy was that not right.  the meat was dry and tasteless.  and you know this is the case when they overloaded with the brown sauce (brown sauce is always used to hide bad food).  unfortunately that sauce was also tasteless.  finally i cannot believe that this place thinks spaetzle was to be grilled and serviced last it were hash browns.  just awful.  \n\nthe place's name is correct in what it is telling you, go to all of the other taverns first for food.", "rating": 2, "date": "2018-08-30"}], "last drop burger": [{"excerpts": ["I also had a bite of the Last Drop burger which was equally as excellent."], "author": "Maya S.", "review": "Lots of big screen tvs and great food + drink. I caught a Warriors game here and there were tvs everywhere. They'll even change the channel for you if you want to watch something else on the tv you're facing (dude asked to change the channel from the Warriors to a Pac-12 game and we were like really dude). \n\nAnyhoo, service was great! We came here with a larger group late on a Friday night and we got seated right away. My blood orange margarita was nice and fruity. I loved my buttermilk fried chicken sandwich. The batter on the chicken was unbelievably crunchy yet light and I could have fallen asleep on the fresh and fluffy house made bun. I also had a bite of the Last Drop burger which was equally as excellent.", "rating": 5, "date": "2016-03-15"}, {"excerpts": ["The Last Drop Burger with garlic fries was good. ", "It was made perfectly to order. ", "The garlic fries were delicious. "], "author": "Hiroshi K.", "review": "This is a nice bar/ restaurant. It has a nice, dark, and cozy atmosphere. The food is good. Customer service is very good. Based on my previous visits, I really enjoyed the Baja Fish Tacos. It was well made. The Fried fish tasted very good. I also enjoyed their BBQ ribs. The meat was tender and the sauce was tasty. The Last Drop Burger with garlic fries was good. It was made perfectly to order. The garlic fries were delicious. Their desert offerings (chocolate flourless cake, dulce de leche ice cream) were okay.", "rating": 4, "date": "2016-10-18"}], "black forest ham melt": [{"excerpts": ["I got the Black Forest Ham Melt, which was a bit of a disappointment. ", "The apples were mushy, almost like apple sauce. ", "The ham was dry."], "author": "Gretty T.", "review": "My family decided to wing it for our trip to SF and we ended up choosing this place. The food was alright, but most certainly overpriced. But being in SF, what else could you expect? The waitress was extremely rude to me and my sister. She didn't write down any orders. She messed up my sister's order, giving her sweet potato fries instead of normal fries. When my sister asked about it, the waitress said \"hmmm are you sure??\" in  condescending manner as if my sister was incapable of remember what she ordered and it was her fault. The waitress did not even offer to make her the correct order.\nMy sister who is vegetarian, got the Portobello Mushroom Sandwich. She was happy about the vegetarian option. She enjoyed the sandwich itself, but not the sweet potato fries.\nI got the Black Forest Ham Melt, which was a bit of a disappointment. The apples were mushy, almost like apple sauce. The ham was dry.", "rating": 2, "date": "2017-04-16"}], "buttermilk fried chicken sandwich": [{"excerpts": ["I had the buttermilk fried chicken sandwich with slaw, and ", "the garlic fries. ", "Chicken was great, freshly fried, not frozen with breading. ", "Fries were disappointing, not crispy, not hot, and just some minced garlic spread over them. ", "My server was good though. ", "I would try it again."], "author": "Stewart G.", "review": "Looking for local place with character, nice spot, comfy feeling. I had the buttermilk fried chicken sandwich with slaw, and the garlic fries. Chicken was great, freshly fried, not frozen with breading. Fries were disappointing, not crispy, not hot, and just some minced garlic spread over them. My server was good though. I would try it again.", "rating": 3, "date": "2017-05-08"}, {"excerpts": ["I loved my buttermilk fried chicken sandwich. ", "The batter on the chicken was unbelievably crunchy yet light and I could have fallen asleep on the fresh and fluffy house made bun. "], "author": "Maya S.", "review": "Lots of big screen tvs and great food + drink. I caught a Warriors game here and there were tvs everywhere. They'll even change the channel for you if you want to watch something else on the tv you're facing (dude asked to change the channel from the Warriors to a Pac-12 game and we were like really dude). \n\nAnyhoo, service was great! We came here with a larger group late on a Friday night and we got seated right away. My blood orange margarita was nice and fruity. I loved my buttermilk fried chicken sandwich. The batter on the chicken was unbelievably crunchy yet light and I could have fallen asleep on the fresh and fluffy house made bun. I also had a bite of the Last Drop burger which was equally as excellent.", "rating": 5, "date": "2016-03-15"}, {"excerpts": ["We had soup of the day (Lentil) and shared a buttermilk fried chicken sandwich. ", "Both were excellent! ", "I'm not usually a big fan of lentil soup, but I ate every last drop and even considered licking the bowl, clean. ", "The sandwich was nothing extraordinary, but was very good. \n", "Laid back vibe and cool music. ", "Oldies R&B and early rock-n-roll, during our visit.\nSmoooooth!"], "author": "Charles S.", "review": "Cool little place. Excellent service!\nIt was unseasonably hot, so I  ordered a glass of water. We received a giant green bottle of water, along with two icy glasses of cubes.\nSmall draught beer selection, but not a wasted tap in the house. I had a Racer 5 and a Mirror Pond. Cocktails are fantastic!\nThe food is very good. We had soup of the day (Lentil) and shared a buttermilk fried chicken sandwich. Both were excellent! I'm not usually a big fan of lentil soup, but I ate every last drop and even considered licking the bowl, clean. The sandwich was nothing extraordinary, but was very good. \nLaid back vibe and cool music. Oldies R&B and early rock-n-roll, during our visit.\nSmoooooth!", "rating": 4, "date": "2015-09-07"}, {"excerpts": ["To top off all the deliciousness I had their 'Buttermilk fried chicken sandwich' ", "Yummmmm-ie!  ", "The staff always makes me feel welcome and ensures my satisfaction.  ", "Thank you! ", "XOXO"], "author": "Stacy P.", "review": "This is one of those places where you go if you want some fancy high end cocktail... with so many high end labels it's hard to choose. There are a lot of martini glasses floating around with a cocktail list, items I'm sure you've never heard of. \n\nThe food... I'm really big on the quality of beef. And I'll have to say I loved the hamburger sliders with Cheddar cheese, caramelized onions, and bacon aioli.  And for something I never order ....ribs. OMG they are great zesty sauce. To top off all the deliciousness I had their 'Buttermilk fried chicken sandwich' Yummmmm-ie!  The staff always makes me feel welcome and ensures my satisfaction.  Thank you! XOXO", "rating": 5, "date": "2015-11-23"}, {"excerpts": ["buttermilk fried chicken sandwich,  small tacos--", "all delicious. \n", "But even more delightful was our host Shebli.  ", "He graciously offered samples of beer for my wife's tasting and made us all feel welcome and right at home.  \n", "A great spot for lunch or an afternoon pick me up. \n", "Thanks,  Shebli and your beautiful missus!"], "author": "Robert L.", "review": "Family and I visiting from Los Angeles,  dropped into the Last Drop Tavern for an afternoon snack. \nWhat a wonderful experience!\nGrilled cheese bites with tomato soup,  buttermilk fried chicken sandwich,  small tacos--all delicious. \nBut even more delightful was our host Shebli.  He graciously offered samples of beer for my wife's tasting and made us all feel welcome and right at home.  \nA great spot for lunch or an afternoon pick me up. \nThanks,  Shebli and your beautiful missus!", "rating": 5, "date": "2015-07-22"}], "portobello mushroom sandwich": [{"excerpts": ["My sister who is vegetarian, got the Portobello Mushroom Sandwich. ", "She was happy about the vegetarian option. ", "She enjoyed the sandwich itself, but not the sweet potato fries.\n"], "author": "Gretty T.", "review": "My family decided to wing it for our trip to SF and we ended up choosing this place. The food was alright, but most certainly overpriced. But being in SF, what else could you expect? The waitress was extremely rude to me and my sister. She didn't write down any orders. She messed up my sister's order, giving her sweet potato fries instead of normal fries. When my sister asked about it, the waitress said \"hmmm are you sure??\" in  condescending manner as if my sister was incapable of remember what she ordered and it was her fault. The waitress did not even offer to make her the correct order.\nMy sister who is vegetarian, got the Portobello Mushroom Sandwich. She was happy about the vegetarian option. She enjoyed the sandwich itself, but not the sweet potato fries.\nI got the Black Forest Ham Melt, which was a bit of a disappointment. The apples were mushy, almost like apple sauce. The ham was dry.", "rating": 2, "date": "2017-04-16"}, {"excerpts": ["For mains we had the ham and Brie sandwich and portobello mushroom sandwich.  ", "Both excellent.  ", "Great selection of tap and bottle beer also. ", "I didn't partake, but the scotch selection looked great also. ", "Highly recommend this place if you are in the area."], "author": "R T.", "review": "Stopped in for lunch without reading any reviews.  Pleasantly surprised with the great service and good food. Sat at the bar. Started with the grilled cheese bites, very tasty. For mains we had the ham and Brie sandwich and portobello mushroom sandwich.  Both excellent.  Great selection of tap and bottle beer also. I didn't partake, but the scotch selection looked great also. Highly recommend this place if you are in the area.", "rating": 4, "date": "2016-04-25"}], "sweet potato fries plate": [], "drunken mussels": [], "street style tacos": [{"excerpts": ["I ordered the street style tacos. ", "Definitely tasted like an English pub's attempt at street tacos. "], "author": "Will S.", "review": "Cozy, dark tavern mostly full of tourists. Prices are reasonable. I ordered the street style tacos. Definitely tasted like an English pub's attempt at street tacos. Eh, they went down well enough with my beer.\n\nThe atmosphere is what really stands out here. I'd love to pull up a stool at the bar and hang out for a few hours, drink some beers, eat some fries and watch some baseball. I'm sure you'd see all walks of life shuffle through here. And when you're done, you can hop on the cable car and head back to your hotel.", "rating": 4, "date": "2016-10-13"}], "baja fish tacos": [{"excerpts": ["I also got the baja fish tacos (3 for $9) and the chips and guacamole ($5). ", "The food was so delicious, tacos covered in savory sauce, and the guacamole was really fresh. ", "My marg was strong but not bitter, nor did I struggle by ANY means to drink them both down. "], "author": "Jordan B.", "review": "Not from San Francisco, I stumbled upon Last Drop Tavern after failing to find a chill restaurant that wouldn't blow every last dollar. To be completely honest, I was little unsure because it's a tavern (whatever that means) but it absolutely exceeded expectations. I came in on a Thursday around 7pm to pretty quiet, but still lively restaurant and bar. It's a little hidden and dark on the inside, with castle-like decor.\n\nBecause I took myself on a date, I sat at the bar so as not to take a table from someone else. There are TVs behind the bar anyway, so I just watched soccer and enjoyed the peace and quiet. There was an awesome happy hour special - $5 for a margarita! I had 2. I also got the baja fish tacos (3 for $9) and the chips and guacamole ($5). The food was so delicious, tacos covered in savory sauce, and the guacamole was really fresh. My marg was strong but not bitter, nor did I struggle by ANY means to drink them both down. Took my food maybe 10 minutes tops to get to me.\n\nThe bartender who was taking care of me was super nice, and attentive that he was not too in my face, but also didn't make me feel like I was forgotten. Overall, it's a great spot for a solo dinner, drinks, and a little quiet. I'll definitely be back next time I'm in SF and wanting to take myself on another date.", "rating": 5, "date": "2017-08-10"}, {"excerpts": ["For dinner, we shared the California Sliders and Baja Fish Tacos. ", "Both were excellent, and we were surprised how good everything was for just randomly finding this place! ", "You don't often expect to find amazing food at no-frills bars like this but it was on point. ", "I also had a Sazerac for my second drink; really good! ", "This place is definitely worth a try."], "author": "Pooja C.", "review": "I found this place randomly when searching for a bar in the area that has decent dinner options. We came in at around 8:30pm on a Thursday night and easily got a table. The server was very friendly and accommodating. I got the Lollipop for my first drink which was really pretty! For dinner, we shared the California Sliders and Baja Fish Tacos. Both were excellent, and we were surprised how good everything was for just randomly finding this place! You don't often expect to find amazing food at no-frills bars like this but it was on point. I also had a Sazerac for my second drink; really good! This place is definitely worth a try.", "rating": 5, "date": "2017-09-13"}, {"excerpts": ["Based on my previous visits, I really enjoyed the Baja Fish Tacos. ", "It was well made. ", "The Fried fish tasted very good. ", "I also enjoyed their BBQ ribs. ", "The meat was tender and the sauce was tasty. "], "author": "Hiroshi K.", "review": "This is a nice bar/ restaurant. It has a nice, dark, and cozy atmosphere. The food is good. Customer service is very good. Based on my previous visits, I really enjoyed the Baja Fish Tacos. It was well made. The Fried fish tasted very good. I also enjoyed their BBQ ribs. The meat was tender and the sauce was tasty. The Last Drop Burger with garlic fries was good. It was made perfectly to order. The garlic fries were delicious. Their desert offerings (chocolate flourless cake, dulce de leche ice cream) were okay.", "rating": 4, "date": "2016-10-18"}, {"excerpts": ["Their happy hour list consists of those mentioned plus baja fish tacos and buffalo wings. ", "Our server was very attentive and was very generous on every drink pour ", "(yeah, they were really strong drinks) ", "especially the redbull vodka but definitely a bang for your buck! ", "Would come back if ever in town."], "author": "Tien N.", "review": "This bar has amazing happy hour. Actually let me get into it some more, this place has AMAZING bacon deviled eggs and bourbon bbq ribs! Came here with my group on Monday for happy hour and had the best time. Its located on a fairly steep hill a couple blocks from Union Square San Fran and sunken down from street level but its not one to miss! Their happy hour list consists of those mentioned plus baja fish tacos and buffalo wings. Our server was very attentive and was very generous on every drink pour (yeah, they were really strong drinks) especially the redbull vodka but definitely a bang for your buck! Would come back if ever in town.", "rating": 5, "date": "2016-10-04"}, {"excerpts": ["I love the Baja Fish Tacos (3 for $9). ", "Moist, perfectly seasoned. ", "Draft beer (I always get a local) $5. ", "I deviated once to the Calamari but it doesn't hold a candle. \n", "Service courteous and professional. \n", "I'll eat here even if it's not happy hour!\n", "PS-if you find a civilized way to eat these, please let me know. ", "I hope no one watches me when I eat them. ", "BUT I DON'T CARE ", "IF THEY DO!  ", "They're THAT good."], "author": "A. J.", "review": "I've come here several times over the last few years when I'm in town and go to a local theater. After today I'll not try another spot. \nHappy Hour DAILY (!) 4-7. I love the Baja Fish Tacos (3 for $9). Moist, perfectly seasoned. Draft beer (I always get a local) $5. I deviated once to the Calamari but it doesn't hold a candle. \nService courteous and professional. \nI'll eat here even if it's not happy hour!\nPS-if you find a civilized way to eat these, please let me know. I hope no one watches me when I eat them. BUT I DON'T CARE IF THEY DO!  They're THAT good.", "rating": 5, "date": "2016-05-31"}], "hand cut fries": [{"excerpts": ["We split the fish tacos, guac and chips, and hand cut fries.  \n\n", "Hand cut fries were soft and fluffy on the inside with a great crunch on the outer. "], "author": "Andrea G.", "review": "My fiends and I stopped in for happy hour, $5 margaritas and mojitos.\n\nWe split the fish tacos, guac and chips, and hand cut fries.  \n\nFish tacos were bigger than we were expecting, and seemingly more than the tortilla was expecting too as I totally fell part as soon as you picked it up ;) still very tasty. \n\nGuac was light and fluffy, but needed some lime and/or salt (problem solved via my margarita ingredients). Would not get this again. Chips slightly stale.\n\nHand cut fries were soft and fluffy on the inside with a great crunch on the outer. Fries came with a tangy chili aioli condiment which straight up delicious.\n\nDidn't get the wings but the people behind us did, looked like a good decision. \n\nHighlights: Decent bar food, cheap cocktails, medieval decor, friendly/helpful staff.\n\nWould I go back? If I lived in San Francisco, you betcha.", "rating": 4, "date": "2017-09-14"}, {"excerpts": ["I waited here for myself a Mojito and some hand cut fries. ", "The Mojito was a little on the lite side as it had more of the mix then alcohol , the fries was good as well."], "author": "Rahul C.", "review": "A really good dive bar, I stumbled in here while I was waiting for my friends to show up and did not want to walk 10 blocks down the hilly San Francisco. I waited here for myself a Mojito and some hand cut fries. The Mojito was a little on the lite side as it had more of the mix then alcohol , the fries was good as well.", "rating": 4, "date": "2016-01-05"}], "veggie quesadilla": [{"excerpts": ["I normally get a veggie quesadilla which is great. ", "Comes with guacamole salsa and sour cream.  ", "I mostly order just to get that ", "but they have a minimum of 25 ", "so I get random stuff besides that.  ", "I'll order from them again."], "author": "Nick S.", "review": "Good food. I normally order take out.  They deliver what the promise.  I normally get a veggie quesadilla which is great. Comes with guacamole salsa and sour cream.  I mostly order just to get that but they have a minimum of 25 so I get random stuff besides that.  I'll order from them again.", "rating": 4, "date": "2017-09-17"}], "bourbon bbq ribs": [{"excerpts": ["Actually let me get into it some more, this place has AMAZING bacon deviled eggs and bourbon bbq ribs! ", "Came here with my group on Monday for happy hour and had the best time. ", "Its located on a fairly steep hill a couple blocks from Union Square San Fran and sunken down from street level but its not one to miss! "], "author": "Tien N.", "review": "This bar has amazing happy hour. Actually let me get into it some more, this place has AMAZING bacon deviled eggs and bourbon bbq ribs! Came here with my group on Monday for happy hour and had the best time. Its located on a fairly steep hill a couple blocks from Union Square San Fran and sunken down from street level but its not one to miss! Their happy hour list consists of those mentioned plus baja fish tacos and buffalo wings. Our server was very attentive and was very generous on every drink pour (yeah, they were really strong drinks) especially the redbull vodka but definitely a bang for your buck! Would come back if ever in town.", "rating": 5, "date": "2016-10-04"}], "bacon deviled eggs": [{"excerpts": ["I partook in and enjoyed these three, which I am listing in order of favorite:\n\nBacon deviled eggs\nBourbon barbeque ribs\nOld-fashioned"], "author": "Camille L.", "review": "Delighted to find Last Drop Tavern. To me it feels like a secret hideaway/nook/cave, and it's just a block off the heart of Union Square.\n\nI partook in and enjoyed these three, which I am listing in order of favorite:\n\nBacon deviled eggs\nBourbon barbeque ribs\nOld-fashioned", "rating": 5, "date": "2018-02-10"}, {"excerpts": ["We've tried almost everything that is on the menu but our favorite is the the buffalo wings and bacon deviled eggs.  "], "author": "Retired M.", "review": "This place is located 2 blocks from Union Square.  We come here every time we visit San Francisco and we've never been disappointed.  Food is good, the bartenders are friendly especially May who always remember our names even though we only come to the city 4-5 times a year.  The food is excellent.  We've tried almost everything that is on the menu but our favorite is the the buffalo wings and bacon deviled eggs.  My husband loves their beef slider and the crab cake slider.  For a bar food, this place ranks high up there.", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["Appetizers are all very tasty (bacon deviled eggs!!).  ", "Nice atmosphere.  ", "Overall, no complaints!"], "author": "Chris C.", "review": "Quick service at the bar from May.  Appetizers are all very tasty (bacon deviled eggs!!).  Nice atmosphere.  Overall, no complaints!", "rating": 5, "date": "2017-10-09"}, {"excerpts": ["Actually let me get into it some more, this place has AMAZING bacon deviled eggs and bourbon bbq ribs! ", "Came here with my group on Monday for happy hour and had the best time. ", "Its located on a fairly steep hill a couple blocks from Union Square San Fran and sunken down from street level but its not one to miss! "], "author": "Tien N.", "review": "This bar has amazing happy hour. Actually let me get into it some more, this place has AMAZING bacon deviled eggs and bourbon bbq ribs! Came here with my group on Monday for happy hour and had the best time. Its located on a fairly steep hill a couple blocks from Union Square San Fran and sunken down from street level but its not one to miss! Their happy hour list consists of those mentioned plus baja fish tacos and buffalo wings. Our server was very attentive and was very generous on every drink pour (yeah, they were really strong drinks) especially the redbull vodka but definitely a bang for your buck! Would come back if ever in town.", "rating": 5, "date": "2016-10-04"}, {"excerpts": ["The bacon deviled eggs were basic deviled eggs with a pinch of bacon and scallions on them. ", "Nice enough, but we expected something a little more interesting, maybe bacon-wrapped? ", "The street tacos had some kick from the salsa, and good cilantro coverage. ", "The guacamole and chips were nothing special, bland with cheap bulk chips. "], "author": "Emily H.", "review": "\"You're the first to complain.\"\n\nYeah, and? The Stella Artois was strangely metallic-tasting and flat. The manager confrontationally standing over me sneering and demanding I taste a second pour of skunked Stella after my husband and I both tasted my drink and found it lacking didn't change my opinion of its skunkiness. \n\nThe cherry on top of this sadsack service sundae was the manager loudly and rather rudely demanding to know if I still wanted it or not after forcing me to taste it in front of him and stomping away without a word when (obviously) I said no.\n\nThankfully there was a boisterous gaggle of Brits next booth over drinking Guinness, which prompted me to switch over to that dark beer lover of my youth. I doubt they would have put up with putrid Guinness, so I was happy to have that vote of confidence.\n\nThe Last Drop as a bar is small but pretty. The place actually smelled nice, and had a surprising surplus of antlers on the wall. Weird sort of haphazard seating warranted by a small and oddly shaped interior, it came off as cozy and comfortable.\n\nThe bacon deviled eggs were basic deviled eggs with a pinch of bacon and scallions on them. Nice enough, but we expected something a little more interesting, maybe bacon-wrapped? The street tacos had some kick from the salsa, and good cilantro coverage. The guacamole and chips were nothing special, bland with cheap bulk chips. Overall a decent middle of the road experience marred only by the tantrum from management.\n\n(Oh and FYI - I've had to send a beer back a total of 2 times in the past decade, this being the second. Check your draft lines for contamination guys!)", "rating": 3, "date": "2016-05-22"}, {"excerpts": ["We had the pulled pork sliders and bacon deviled eggs and they were both great. ", "I would definitely come back here for a happy hour drink or two!"], "author": "Megan M.", "review": "Nice atmosphere with friendly service. They have a fun drink menu with an array of specialty cocktails and an eclectic selection of beers. We had the pulled pork sliders and bacon deviled eggs and they were both great. I would definitely come back here for a happy hour drink or two!", "rating": 4, "date": "2016-08-14"}, {"excerpts": ["Sliders are amazing and the bacon deviled eggs absolutely delish!"], "author": "Jodie M.", "review": "Excellent food. Best bar food we had in four days in SF. Good beer selection and attentive service. HH prices very reasonable. Sliders are amazing and the bacon deviled eggs absolutely delish!", "rating": 5, "date": "2015-04-06"}], "mac n cheese": [{"excerpts": ["The food was good, I heard many things about the Mac n Cheese, and it lived up to expectations."], "author": "Bryan M.", "review": "I came here with a group of coworkers for Happy Hour, the drinks were ok, but the service was fairly slow. It took us a while to get our drinks, and I was thinking we might have to start ordering doubles. Next time I think I will go to the bar and get my own drinks.\n\nThis place offers 7% off your bill via Yelp Cash Back, so I will most likely stop in again and give it another try.\n\nThe food was good, I heard many things about the Mac n Cheese, and it lived up to expectations.", "rating": 3, "date": "2018-01-05"}, {"excerpts": ["Great happy hour, great service, and great mac n cheese, what more can you ask for? ", "Went here on the recommendation of yelp after some shopping, and was impressed. ", "Although it isn't on the happy hour menu, we also had to try the mac n cheese. ", "Best decision of the meal. ", "First nicety: it comes inherently vegetarian with the option to add different meats for an additional small charge. ", "I hate removing meat for dishes to make them vegetarian--the dish is relying on the meat for flavor ", "and I'm paying for meat ", "I'm not getting--so this set up was a welcome change. ", "But the best part was the cheesiness! ", "Lifting a forkful, you could see the cheese strings stretch to keep your bite attached to the rest of the bowl. ", "It was mac ", "n cheese heaven"], "author": "Cara W.", "review": "Great happy hour, great service, and great mac n cheese, what more can you ask for? Went here on the recommendation of yelp after some shopping, and was impressed. The happy hour has discounted beer, wine, and appetizers (some of which can stand in as a main, i.e. the fish tacos), allowing you to get a fun late lunch/early dinner in with drinks for a very affordable price. \n\nOver the course of our visits here we've tried most of the happy hour offerings. The top pickings: the fries (thick cut and served with a spicy aioli) and the fish tacos (very good and an amazing deal for the portion size). The boyfriend also liked the wings (they were just barely edged out by the fish tacos because of the portions) and the deviled eggs. The artichoke dip was a little too salty for my tastes, but my friends really enjoyed it. The guacamole was the only thing that really fell short (just not as flavorful as most). \n\nAlthough it isn't on the happy hour menu, we also had to try the mac n cheese. Best decision of the meal. First nicety: it comes inherently vegetarian with the option to add different meats for an additional small charge. I hate removing meat for dishes to make them vegetarian--the dish is relying on the meat for flavor and I'm paying for meat I'm not getting--so this set up was a welcome change. But the best part was the cheesiness! Lifting a forkful, you could see the cheese strings stretch to keep your bite attached to the rest of the bowl. It was mac n cheese heaven; you must try this!\n\nWe've always been served by a waitress with light blonde hair, though I've yet to get her name. She's always very nice, and the perfect amount of attentive without being overbearing. She also patiently helped us pick beers which the boyfriend and I are still learning to do (we're wine people).\n\nCome check this place out!!", "rating": 5, "date": "2017-09-27"}, {"excerpts": ["Mac n cheese with bacon- hearty and creamy and on your mind later too! \n", "They have a nice selection of local beers on tab as well as imports you would like to find at a tavern. ", "However, the craft cocktails really shine! ", "Try the sours. ", "Any of them! ", "All amazing! ", "And can't go wrong with any of their crushed iced mules, your choice of vodka, mezcal or bourbon. ", "Blood orange margarita? ", "Yes please! \n", "Right in the heart of the city and a cozy and comfortable, yet refined vibe, I find myself here almost every weekend!"], "author": "Yvette G.", "review": "This Tavern is definitely more than just a bar! The food is that kind of really good-hits the spot-craving it later type of food. Buttermilk fried chicken sandwich- amazing. Mac n cheese with bacon- hearty and creamy and on your mind later too! \nThey have a nice selection of local beers on tab as well as imports you would like to find at a tavern. However, the craft cocktails really shine! Try the sours. Any of them! All amazing! And can't go wrong with any of their crushed iced mules, your choice of vodka, mezcal or bourbon. Blood orange margarita? Yes please! \nRight in the heart of the city and a cozy and comfortable, yet refined vibe, I find myself here almost every weekend!", "rating": 5, "date": "2015-02-06"}], "spinach and artichoke dip": [{"excerpts": [", we got the spinach and artichoke dip and it was good. ", "Wish it came with more bread, there was a lot of extra dip leftover.  ", "Good deal for the area, not overly touristy either. ", "Will definitely come back when I'm in the area."], "author": "Jessica G.", "review": "Came here yesterday on Thanksgiving and was happy to find a low key bar in Union Square. The interior is very cozy and has almost a medieval type of decor. Dimly lit but it was relaxing. They have a really good happy hour from 4 to 7 I believe. $5 for draft beers, house wines and a list of cocktails too. They have bar bites during happy hour too, we got the spinach and artichoke dip and it was good. Wish it came with more bread, there was a lot of extra dip leftover.  Good deal for the area, not overly touristy either. Will definitely come back when I'm in the area.", "rating": 4, "date": "2016-11-25"}], "grilled cheese bites": [{"excerpts": ["My friends and I enjoyed the grilled cheese bites as well as the sweet potato fries although I cannot say I loved the cinnamon dipping sauce. ", "The atmosphere is nice, definitely good for a date. ", "My only complaint was the service. ", "Our waitress was very slow at bringing our drinks and food. ", "I thought this may be due the amount of people on our crawl but they appeared to be getting served by others."], "author": "Dequetta D.", "review": "We visited this place while on a pub crawl. My friends and I enjoyed the grilled cheese bites as well as the sweet potato fries although I cannot say I loved the cinnamon dipping sauce. The atmosphere is nice, definitely good for a date. My only complaint was the service. Our waitress was very slow at bringing our drinks and food. I thought this may be due the amount of people on our crawl but they appeared to be getting served by others.", "rating": 3, "date": "2017-11-19"}, {"excerpts": ["Order the grilled cheese bites and carnitas street tacos, both outstanding.  ", "Service, brews, and conversation made it worth a return visit next time ", "I'm in the area.  ", "Really dig the vibe and decor at the LD Tavern."], "author": "Scott B.", "review": "Laid back place with great food and service.  Order the grilled cheese bites and carnitas street tacos, both outstanding.  Service, brews, and conversation made it worth a return visit next time I'm in the area.  Really dig the vibe and decor at the LD Tavern.", "rating": 5, "date": "2018-06-12"}, {"excerpts": ["but we were able to get a table, some drinks, fajitas, and the grilled cheese bites, which come with tomato soup for dipping. \n\n"], "author": "Sarah H.", "review": "This place is awesome. It was near our hotel and is open late so we stopped in after our late flight for a drink. They make great drinks (we had martinis and old fashioneds) and their food is surprisingly tasty for having a pub feel. The kitchen does close before the bar does though so keep that in mind. \n\nWe went back before our flight home and the bartender remembered us!  It was game day and so it was pretty busy but we were able to get a table, some drinks, fajitas, and the grilled cheese bites, which come with tomato soup for dipping. \n\nAll in all a great neighborhood spot and I'll be going back next time I'm up north!", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["I had the beef sliders, boyfriend had the grilled cheese bites (add bacon) and we both shared the garlic fries. ", "Beef sliders were some of the tastiest I've ever had. ", "Not over cooked and super flavorful. ", "Boyfriend said his grilled cheese bites were absolutely awesome with the multiple cheeses and bacon. ", "He also really liked the \"tomato soup\" because it wasn't your traditional soup (which he isn't a fan of). ", "He said it more tasted like a tomato sauce of some kind. ", "The garlic fries were outstanding. ", "The fries were super crispy but not even the slightest bit burnt. ", "The sauces they gave with them were on point too. ", "We would definitely recommend!"], "author": "Steph H.", "review": "We arrived in San Francisco and were looking for a quick bite to eat while waiting for our hotel room. We spotted the Last Drop from the intersection and thought we would swing in. I had the beef sliders, boyfriend had the grilled cheese bites (add bacon) and we both shared the garlic fries. Beef sliders were some of the tastiest I've ever had. Not over cooked and super flavorful. Boyfriend said his grilled cheese bites were absolutely awesome with the multiple cheeses and bacon. He also really liked the \"tomato soup\" because it wasn't your traditional soup (which he isn't a fan of). He said it more tasted like a tomato sauce of some kind. The garlic fries were outstanding. The fries were super crispy but not even the slightest bit burnt. The sauces they gave with them were on point too. We would definitely recommend!", "rating": 5, "date": "2017-04-19"}, {"excerpts": ["Ordered the grilled cheese bites with the tomato soup to dip that sh!t ", "it's ", "SO GOOD - hands down best thing we ordered. \n", "Chips and guac - good but seriously how do you even mess this up. \n", "Chicken street tacos - would pass....", "not good.  ", "Little dry squares of chicken, not much else at all on the tacos. ", "Sad naked chicken square tacos.  "], "author": "Christina L.", "review": "Ambiance: Divey, darkish, but kinda cute.  Not sure what vibe they were going for...American...Pirate....Sports....Dive bar?\n\nFood: Ordered the grilled cheese bites with the tomato soup to dip that sh!t it's SO GOOD - hands down best thing we ordered. \nChips and guac - good but seriously how do you even mess this up. \nChicken street tacos - would pass....not good.  Little dry squares of chicken, not much else at all on the tacos. Sad naked chicken square tacos.  I drenched mine in Tapatio and it was reminiscent of college but in a bad way. \n\nThey have a happy you until 7pm by the way, some apps and drinks are a few dollars cheaper, $5 wine yo!!!\n\nSide rant: I had kind of a strange experience here with servers that were OVERLY attentive.  It was the kind of attention you might expect at like a $$$$ restaurant or a 5 star restaurant, not a little dive bar in San Francisco.  I'm not sure why either, but they were literally checking on us every 3 minutes. Not even exaggerating.  My friend and I both confirmed with each other afterwards it felt over the top, and was getting in the way of us having a flowing conversation....so strange why they were that attentive unless they were trying to get us to leave or something who knows lol. \n\nI'd come back for the melted cheese bites and $5 HH wine.", "rating": 3, "date": "2016-05-05"}, {"excerpts": ["The cheddar burger sliders and grilled cheese bites with tomato soup were awesome."], "author": "Tommy Y.", "review": "Nice selection of beer on tap. The cheddar burger sliders and grilled cheese bites with tomato soup were awesome.", "rating": 4, "date": "2017-04-26"}, {"excerpts": ["Grilled cheese bites were the perfect combination of crunchy toast and gooey cheese. ", "The veggie quesadillas  were packed with flavor and lots of veggies...and the house chardonnay was nice. ", "We should have tried it earlier on our trip."], "author": "Lynette g.", "review": "Grilled cheese bites were the perfect combination of crunchy toast and gooey cheese. The veggie quesadillas  were packed with flavor and lots of veggies...and the house chardonnay was nice. We should have tried it earlier on our trip.", "rating": 5, "date": "2015-09-23"}, {"excerpts": ["Grilled cheese bites with tomato soup,  "], "author": "Robert L.", "review": "Family and I visiting from Los Angeles,  dropped into the Last Drop Tavern for an afternoon snack. \nWhat a wonderful experience!\nGrilled cheese bites with tomato soup,  buttermilk fried chicken sandwich,  small tacos--all delicious. \nBut even more delightful was our host Shebli.  He graciously offered samples of beer for my wife's tasting and made us all feel welcome and right at home.  \nA great spot for lunch or an afternoon pick me up. \nThanks,  Shebli and your beautiful missus!", "rating": 5, "date": "2015-07-22"}, {"excerpts": ["Little grilled cheese bites were great. ", "Fun cocktail list. ", "We brought our three kids and strangely (unlike many other places in SF ) ", "no one rolled their eyes. ", "We went twice for drinks and apps during our week."], "author": "Liz W.", "review": "Great service. Yummy food for bar food. Little grilled cheese bites were great. Fun cocktail list. We brought our three kids and strangely (unlike many other places in SF ) no one rolled their eyes. We went twice for drinks and apps during our week.", "rating": 4, "date": "2015-10-17"}, {"excerpts": ["Friendly staff, cozy atmosphere, and the best grilled cheese bites with tomato soup I have ever had in my life."], "author": "Felicia M.", "review": "First time to San Francisco and it rained the entire day. I was looking for a warm cozy pub with hearty food. I found exactly what I was looking for. Friendly staff, cozy atmosphere, and the best grilled cheese bites with tomato soup I have ever had in my life.", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["Started with the grilled cheese bites, very tasty. "], "author": "R T.", "review": "Stopped in for lunch without reading any reviews.  Pleasantly surprised with the great service and good food. Sat at the bar. Started with the grilled cheese bites, very tasty. For mains we had the ham and Brie sandwich and portobello mushroom sandwich.  Both excellent.  Great selection of tap and bottle beer also. I didn't partake, but the scotch selection looked great also. Highly recommend this place if you are in the area.", "rating": 4, "date": "2016-04-25"}, {"excerpts": ["The grilled cheese bites are awesome as well as the beef sliders.  ", "Great place to stop in and get good beer and good food."], "author": "Imran K.", "review": "In San Francisco on business and happened on this place. Great service and great beer.  The grilled cheese bites are awesome as well as the beef sliders.  Great place to stop in and get good beer and good food.", "rating": 5, "date": "2015-07-30"}, {"excerpts": ["Had the grilled cheese bites with tomato soup. ", "It was delish. ", "The white sangria was perfectly done. ", "Great service and music too."], "author": "Mercedes G.", "review": "Had the grilled cheese bites with tomato soup. It was delish. The white sangria was perfectly done. Great service and music too.", "rating": 4, "date": "2015-02-12"}, {"excerpts": ["Everything was fantastic, including the grilled cheese bites and bbq ribs. ", "Happy hour was a special bonus, as draft beers were only $5. ", "However, we should have went with the $5 well whiskey. ", "As it was my birthday, I decided to allow my girlfriends grandmother to treat me to a shot of Jameson Black. ", "While delicious, at $15, it was between $5-$7 more than any other place I'd had it in a number of different states. ", "That was the least of our worries. ", "When it came time to check out, 5 minutes after giving her our card, she alerted us to the fact that the credit card machine was down and we could pay cash or wait 5-10 minutes. ", "After 15 minutes, she informed us that there was an ATM outside if we didn't want to wait any longer. ", "Of course, we weren't interested in paying an ATM fee on top of our already inflated bill. ", "20 minutes later, after running the card several times, they insisted that we did not have enough money in our account. ", "Turns out, we did, and our card was charged twice for a grand total of $114.26. ", "They then informed us that our account would not be credited the overcharged amount until the next day. ", "Then they made us sign a permission slip giving them authority to recharge the card for the original amount. ", "As a final gesture of good will, they said they were sorry and wished they could comp it. ", "Don't let the lure of happy hour fool you, take your money and your debit card somewhere else. ", "In closing, I will say they lived up to their name, as I left the \"last drop\" of my patience on the bar."], "author": "Pac N.", "review": "Everything was fantastic, including the grilled cheese bites and bbq ribs. Happy hour was a special bonus, as draft beers were only $5. However, we should have went with the $5 well whiskey. As it was my birthday, I decided to allow my girlfriends grandmother to treat me to a shot of Jameson Black. While delicious, at $15, it was between $5-$7 more than any other place I'd had it in a number of different states. That was the least of our worries. When it came time to check out, 5 minutes after giving her our card, she alerted us to the fact that the credit card machine was down and we could pay cash or wait 5-10 minutes. After 15 minutes, she informed us that there was an ATM outside if we didn't want to wait any longer. Of course, we weren't interested in paying an ATM fee on top of our already inflated bill. 20 minutes later, after running the card several times, they insisted that we did not have enough money in our account. Turns out, we did, and our card was charged twice for a grand total of $114.26. They then informed us that our account would not be credited the overcharged amount until the next day. Then they made us sign a permission slip giving them authority to recharge the card for the original amount. As a final gesture of good will, they said they were sorry and wished they could comp it. Don't let the lure of happy hour fool you, take your money and your debit card somewhere else. In closing, I will say they lived up to their name, as I left the \"last drop\" of my patience on the bar.", "rating": 1, "date": "2015-12-17"}], "herb roasted red potatoes": [], "grilled seasonal vegetables": [], "dulce de leche ice cream": [{"excerpts": ["Their desert offerings (chocolate flourless cake, dulce de leche ice cream) were okay."], "author": "Hiroshi K.", "review": "This is a nice bar/ restaurant. It has a nice, dark, and cozy atmosphere. The food is good. Customer service is very good. Based on my previous visits, I really enjoyed the Baja Fish Tacos. It was well made. The Fried fish tasted very good. I also enjoyed their BBQ ribs. The meat was tender and the sauce was tasty. The Last Drop Burger with garlic fries was good. It was made perfectly to order. The garlic fries were delicious. Their desert offerings (chocolate flourless cake, dulce de leche ice cream) were okay.", "rating": 4, "date": "2016-10-18"}], "beef slider": [{"excerpts": ["My husband loves their beef slider and the crab cake slider.  ", "For a bar food, this place ranks high up there."], "author": "Retired M.", "review": "This place is located 2 blocks from Union Square.  We come here every time we visit San Francisco and we've never been disappointed.  Food is good, the bartenders are friendly especially May who always remember our names even though we only come to the city 4-5 times a year.  The food is excellent.  We've tried almost everything that is on the menu but our favorite is the the buffalo wings and bacon deviled eggs.  My husband loves their beef slider and the crab cake slider.  For a bar food, this place ranks high up there.", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["The Beef Slider was perfectly cooked.  "], "author": "Sandi L.", "review": "I ordered Delivery tonight.  The Beef Slider was perfectly cooked.  Fried calamari and Garlic Fries were  delicious.  \n\nMy only problem is the plastic containers don't allow the steam to escape so the French Fries and Calamari were a bit soggy.  I popped them in in my toaster oven \non high heat to crisp them again.  Very tasty and timely delivered.", "rating": 4, "date": "2018-04-30"}], "california slider": [], "crab cake slider": [{"excerpts": ["My husband loves their beef slider and the crab cake slider.  ", "For a bar food, this place ranks high up there."], "author": "Retired M.", "review": "This place is located 2 blocks from Union Square.  We come here every time we visit San Francisco and we've never been disappointed.  Food is good, the bartenders are friendly especially May who always remember our names even though we only come to the city 4-5 times a year.  The food is excellent.  We've tried almost everything that is on the menu but our favorite is the the buffalo wings and bacon deviled eggs.  My husband loves their beef slider and the crab cake slider.  For a bar food, this place ranks high up there.", "rating": 5, "date": "2018-09-22"}], "pulled pork slider": [], "penne bolognese": []}