{"baba ghanouj": [{"excerpts": ["We started with the Baba Ghanouj which had a perfect smoky eggplant flavor with olive oil and lemon juice layered in. ", "For my entree, I went with the beef kebab and my friends both ordered the lamb having had it before and raved about it. ", "My beef was cooked perfectly and the rice was delicious. "], "author": "Bianca B.", "review": "This is a hidden gem and I considered hiding my review but they earned it. Parking is a bit tricky, but if you drive around a bit you'll find a spot. \n\nThe dining aesthetic is warm and cozy, very welcoming. We dined on a Wednesday night and they weren't slammed so we got very attentive service. I can imagine they get packed on the weekends, as many people stopped in to pick up takeout. \n\nWe started with the Baba Ghanouj which had a perfect smoky eggplant flavor with olive oil and lemon juice layered in. For my entree, I went with the beef kebab and my friends both ordered the lamb having had it before and raved about it. My beef was cooked perfectly and the rice was delicious. We closed up with baklava (of course) and that was also delicious. \n\nNormally I'm a lush at dinner time but they had this amazing lemonade with pomegranate and I could stop asking for refills. \n\nThe service throughout our meal was attentive and courteous. We'll definitely be back to eat at Layaly!", "rating": 5, "date": "2017-10-08"}, {"excerpts": ["We had the mezza platter to start with: Hummus, baba ghanouj, tabouli, falafel,  borek and warm pita. ", "All were very good...but the Borek (Fried filo dough stuffed with feta cheese and parsley) "], "author": "David G.", "review": "Right smack dab across the street from Hard Knox southern food is Layaly.\n\nYelp gives this cute little Mediterranean restaurant four stars ( and it really does deserve it). From the atmosphere, to the wonderful service, and the good food. Layaly is a nice gem.\n\nWe had the mezza platter to start with: Hummus, baba ghanouj, tabouli, falafel,  borek and warm pita. All were very good...but the Borek (Fried filo dough stuffed with feta cheese and parsley) was like Lebanese crack...omg.\n\nFor our mains we had the: Kofte Kebab which was a mixture of ground beef and lamb, onions and fresh herbs. served with rice and vegetables. Really tender and flavorful Kebabs with fluffy light rice. \n\nLamb Kebab Entrée marinated tender cubes of lamb skewered with onions and peppers. served with rice and vegetables. Very tender and sucullent lamb with not too much fat and cooked to perfection.\n\nDajaj chicken sautéed with onions, peppers, mushrooms and garlic in a tomato white wine sauce. served with rice. This Tajine ( think wonderful stew) was intensly arromatic and rich. The mushrooms and chicken were out of this world. Generous portion as well.\n\nWe took home two dishes for two family members that were revolting about dinning out (typical). They had the Falafel Wrap:  falafels with hummus, lettuce, tomatoes, pickles and tahini. This was the best Falafel sandwhich I have every tasted...so yummy and flavorful. They both had french fries with them  seasoned sumac.....they are the best. Crispy fries with that amazing sumac flavor. Only other place I know that does this is in Las vegas.\n\nPrices for dinning out are really reasonable. \n\nService was just fantastic. The wonderful lady that helped us always refilled our water, was super pleasant, and just super cool.\n\nOnly thing I didnt like, and it is petty, was one of the owners just hanging out playing on his cell phone.\n\nI would highly recommend checking this place out/", "rating": 4, "date": "2015-06-18"}, {"excerpts": ["It has a little of every appetizer (Hummus, baba ghanouj, tabouli, falafel, borek and haydari).   "], "author": "Rose Z.", "review": "Every time I eat here I feel like I'm being taken on a fabulous trip to the Mediterranean!  \n\nMy favorite dish has to be the Tantouni, which is one of their Tajines.   It is Sirloin sauteed in a white wine cream sauce with onion, bell pepper and mushrooms.  However, I prefer mine without the bell peppers. It's almost like the Mediterranean version of Beef Stroganoff, but over rice.  YUM!\n\nTheir meza platter is another great item to try.  It has a little of every appetizer (Hummus, baba ghanouj, tabouli, falafel, borek and haydari).   And if all else fails, you can't go wrong with kebabs. \n\nThe ambiance is very pleasant, and the staff is very friendly.  As well as they have a nice wine selection.\n\nHowever, if your feeling tired or lazy, you can always just order this great food to you.  They deliver!", "rating": 5, "date": "2015-03-10"}, {"excerpts": ["w/ Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek ($15) - 4 STARS\n", "http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=l-aiPHAOl0jH77o_FAB4zw\n", "We liked and devoured everything on the platter except the tabouli (parsley salad). ", "The hummus and haydari (yogurt sauce) was amazingly rich and creamy. ", "The baba ghanouj (mashed eggplant) was smooth yet still had some texture to it. ", "The falafel had a nice crunchy exterior with a soft center and the borek (fillo stuffed with feta) was like a savory cheese egg roll. \n\n", "It was served with warm pita bread which was perfect for sopping up all the yummy hummus, haydari and baba ghanouj.\n\n"], "author": "Cherylynn N.", "review": "Layaly is EVERYTHING you would expect from a neighborhood restaurant: Quaint, Delicious Food and Friendly Service!\n\nMy friends started off our Sunday with dim sim and went onto munch on silvanas (Filipino macarons) and sip on red velvet lattes. Being fatasses, we decide to end with dinner at Layaly because my friend had a Scoutmob - 50% off up to $15 deal. \n\nBe forewarned that parking in the area is a complete nightmare. There is a parking lot a block away for $6/hour. \n\nOn Sunday 9.4.11, my friend and I came in a little after 6 PM and Layaly was empty except for one couple. We were seated promptly (without reservations) while we waited for two of other friends to arrive.\n\nF O O D\n*MEZZA PLATTER: w/ Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek ($15) - 4 STARS\nhttp://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=l-aiPHAOl0jH77o_FAB4zw\nWe liked and devoured everything on the platter except the tabouli (parsley salad). The hummus and haydari (yogurt sauce) was amazingly rich and creamy. The baba ghanouj (mashed eggplant) was smooth yet still had some texture to it. The falafel had a nice crunchy exterior with a soft center and the borek (fillo stuffed with feta) was like a savory cheese egg roll. \n\nIt was served with warm pita bread which was perfect for sopping up all the yummy hummus, haydari and baba ghanouj.\n\n*LAYALY MIXED GRILL w/ Kofte, Chicken, Beef, Lamb, and Shrimp ($34 for 2 people) - 4 STARS\nhttp://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=xiCzw2TLqT2ga_WNAQreGQ\nEverything on the plate was packed with flavor and deliciously mouth-watering. The kofte (beef and lamb) was rich and juicy with a subtle gaminess. The beef and lamb were tender and filled with garlicky spices. The shrimp was nicely tender. The chicken, being white pieces was surprisingly very tender and moist. The accompanying yogurt sauce help cut through some of the richness while adding a tangy creaminess. I absolutely loved the rice pilaf as it had great texture and flavor. \n\nPortion sizes were very generous and the Layaly Mixed Grill could easily feed 3 people. \n\nS E R V I C E\nOur waitress was very approachable and friendly but spread thin because she was the only one in the front of the house. In the beginning, she was attentive but as it got busy, it was hard for her to keep up. They really need to hire additional help especially during peak hours on the weekends. Nonetheless, she did a great job making sure we were ok and that our water glasses were filled.\n\nMy only gripe is our entrees took a while to arrive. \n\nA M B I A N C E / D E C O R\nCasual, yet very warm and cozy. The mellow yellow walls and the red wooden furnishings created a very welcoming and charming feel to Layaly. There's also a back patio for hookah. \n\nP A R K I N G\nAs previously stated, street parking in the area is a NIGHTMARE. Your best bet is looking for parking a block away on California. There is a parking lot a block away for $6/hour.\n\nWith the Scoutmob deal, we each paid $21 (including tax and gratuity) which was very affordable. They even have $7 lunch specials offered every day. \n\nOther Note(s):\nWe noticed A LOT of people coming into Layaly wanting to do hookah but they didn't offer it on the Sunday we were there, so I highly recommend calling ahead of time to make sure it's being offered that night. \n\nDid you know that Mediterranean food is THE healthiest ethnic cuisine according to CNN? There goes another reason to check out Layaly. Sorry, spanakopita does NOT count.", "rating": 4, "date": "2011-09-09"}, {"excerpts": ["* Mezza Platter (Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek with lots of grilled pita to pile on your mezza - mmm, it was hard not to totally devour everything ", "and it was a lot! ", "My fave was the falafel, baba ghnaouj and borek)\n", "* ", "Layaly Mixed Grill Plate (Kofte, Chicken, Beef, Lamb, Shrimp, Zucchini and rice ", "- this was a generous grill plate, I was rather full from the mezza platter, but I enjoyed the chicken and zucchini very much, flavorful, tender, filling, it is going to be good as leftovers tonight too)\n", "*  ", "Baklava (sweet, crispy", ", I could only have a bite because I was so full, but will enjoy it as leftovers tonight as well)\n"], "author": "Maile N.", "review": "I love it when online deals stretch my boundaries and bring me all the way to Outer Richmond - I hardly come out this way but I know the restaurants out here are yum too!  \n\nWe had:\n\n* Mezza Platter (Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek with lots of grilled pita to pile on your mezza - mmm, it was hard not to totally devour everything and it was a lot! My fave was the falafel, baba ghnaouj and borek)\n* Layaly Mixed Grill Plate (Kofte, Chicken, Beef, Lamb, Shrimp, Zucchini and rice - this was a generous grill plate, I was rather full from the mezza platter, but I enjoyed the chicken and zucchini very much, flavorful, tender, filling, it is going to be good as leftovers tonight too)\n*  Baklava (sweet, crispy, I could only have a bite because I was so full, but will enjoy it as leftovers tonight as well)\n*  Glass of Zinfandel from Lodi (nice combination with my meal)\n\nOur waitress was super friendly and she took the time to explain everything on the menu, the origins of the dishes, the pricing on our receipt after the online deal was calculated.  Really really lovely dining experience all around.  I would definitely be back.  Nice find!", "rating": 4, "date": "2013-01-15"}, {"excerpts": ["I LOVE the Baba Ghanouj and eat it sans bread by the forkful... those two dishes alone make a pretty fierce lunch that will keep me coming back again and again.  ", "However, in addition, I have enjoyed the tajine plates, kabobs, and salads as well and have not been disappointed... though, in the end, I mostly go back to the tasty variety of the mezze platter.  "], "author": "Kathryn E.", "review": "Since I I have started working in the area, the mezze platter at Layaly has been an almost weekly staple of my lunch hours.  The Tabouli is fantastic... lots of parsley and minimal grain, the way tabouli should be!  I LOVE the Baba Ghanouj and eat it sans bread by the forkful... those two dishes alone make a pretty fierce lunch that will keep me coming back again and again.  However, in addition, I have enjoyed the tajine plates, kabobs, and salads as well and have not been disappointed... though, in the end, I mostly go back to the tasty variety of the mezze platter.  The service is always friendly and warm, though the kitchen can definitely move at its own pace at times (meaning, don't expect to pop in and out for a 20 minute lunch), and if you need a caffeine jolt to make it through the rest of your workday, take a moment for the delicious coffee.\n\nIf you're in the Richmond, this is a solid restaurant for a midday or evening bite!", "rating": 5, "date": "2013-02-15"}, {"excerpts": ["We ordered the baba ghanouj.  ", "It tasted burnt to me, but I was told it was suppose to taste like that.  ", "It was explained that it was \"smoked.\"  ", "I still taste burnt.  ", "We had the Groupon for $29-one appetizer (crab cake) and two entrees and one dessert-Baklava-it needs some more pistachio or nuts.  ", "We still had to pay $24 extra", ", 18% tips added whether you like service or not.  ", "Tax and whatever extra you ordered.  ", "If we didn't have the groupon, we would have paid $84 for two and we didn't even drink."], "author": "Helen L.", "review": "I have to read things more carefully.  When it said \"Grilled\", everything was grilled!  My bass was grilled to perfection, but it was still grilled.  Everything seems to be  blackened.  Grilled would not be my choice.  My friend had the kebab.  It was okay.  The grilled veggie was my favorite, melts in your mouth.  We ordered the baba ghanouj.  It tasted burnt to me, but I was told it was suppose to taste like that.  It was explained that it was \"smoked.\"  I still taste burnt.  We had the Groupon for $29-one appetizer (crab cake) and two entrees and one dessert-Baklava-it needs some more pistachio or nuts.  We still had to pay $24 extra, 18% tips added whether you like service or not.  Tax and whatever extra you ordered.  If we didn't have the groupon, we would have paid $84 for two and we didn't even drink.", "rating": 3, "date": "2013-04-08"}, {"excerpts": ["http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=oCZIOGfyYBySHDEsocekpA, Garlic Fries http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=Tx34Ian7ImSDpfxoOupb_w, Mezza Platter (\"hummus, baba ghanouj, haydari, tabouli, falafel, and borek\") "], "author": "Mona C.", "review": "[M]ona: 3.5 Stars\n[W]ayne: 3.5 Stars\nAverage: 3.5 Stars\n\n+ Reasonable Prices\n+ Filling\n+ Good Portions\n+ Accepts Credit Cards\n\n- Slow Service\n- Dark\n \n[W] We came here because Mona had a restaurant.com certificate from here and it was a great deal. If you come here, I suggest just to stick with the appetizers because you get a lot of different choices to choose from and it's kind of inexpensive to try out many things. So tonight we had nothing BUT appetizers and man, I think we had a little too much haha.\n \n[M] We ordered the Borek (\"fried fillo dough stuffed with feta cheese and parsley\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=NXVBpB01xZBkdoZOYuGYpQ, Cacik (\"Yogurt English cucumber, garlic, mint\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=pbLNNiUlk5C8gIIun2FOPQ, Falafel (\"garbanzo with herbs and spices, fried served with tahini\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=oCZIOGfyYBySHDEsocekpA, Garlic Fries http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=Tx34Ian7ImSDpfxoOupb_w, Mezza Platter (\"hummus, baba ghanouj, haydari, tabouli, falafel, and borek\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=HfDL2S2ZVOI7jwyYWkMJ1Q and a side of rice http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=QTDSx9QtiSg9PvJ7aL_6vw.\n\n[W] I personally didn't like the Cacik because the dip was wayyyyy to sour for me. Mona liked it on the other hand. It looked like some sort of thicker dip but it just had a little too much lemon or lime juice in it. \n\nMy 2nd suggestion is that if you get the Mezza Platter, DO NOT get the Falafels also. The platter already has the falafels and the 2 on the platter was already enough for me and Mona. \n\n[M] The Falafels tasted good at first but it was too fried for us. The insides were tasty but weren't really enjoyable because it's like eating something really burnt and crispy on the outside. \n\n[W] The other dish that was really good was their Rice haha. You're probably saying Rice? How can that be any good? But yea, trust me, IT WAS GOOOOOD. You really have to taste it to understand me. \n \nThe nice thing about this restaurant was that everything comes with some sort of dipping sauce which makes a big difference because if it didn't, I think everything would be extremely dry. \n\nThe only thing that bothered me was that the host was more attentive to his customers in their little secret back room. I guess this place has a hooka lounge in the back because people were walking out of nowhere from the back of the restaurant. That was kind of weird in my opinion because we're sitting in a restaurant and here comes some stoned people walking out of nowhere. I think they should have another entrance for those folks. That lead to another problem which was not being attentive to your other paying guests i.e. US. \n \nWe were done eating for a while and nobody was on the dining floor to assist us. So we just had wait until someone came out of the hooka room I guess. I guess that service could've been better. Oh well.  3.5 Stars.", "rating": 4, "date": "2010-03-22"}, {"excerpts": ["We came here for lunch and my boyfriend wanted the baba ghanouj while i wanted hummus. ", "So we ended up ordering the Mezza Platter as an appetizer. ", "We were amazed by how much they gave us and it came with a basket of flat bread. ", "I didnt want baba ghanouj because i didnt like eggplants, but it was actually really good. ", "My fav was the hummus and baba ghanouj. ", "The haydari was ok... the mint made me think of toothpaste... and the tabouli had parsley in it which I dislike. ", "The falafel was yummy though ", "but it was even better when I added more hummus (from the platter) and baba ghanouj. ", "I ordered fries with this and was amazed how well the fries were cooked. "], "author": "Alicia W.", "review": "My boyfriend wanted to come here after driving past this place a lot. Took us a while to figure out where it was... because he had an idea of where this place was but not exactly sure. We almost gave up looking for it but I told him to try one more block and we found it! \n\nWe came here for lunch and my boyfriend wanted the baba ghanouj while i wanted hummus. So we ended up ordering the Mezza Platter as an appetizer. We were amazed by how much they gave us and it came with a basket of flat bread. I didnt want baba ghanouj because i didnt like eggplants, but it was actually really good. My fav was the hummus and baba ghanouj. The haydari was ok... the mint made me think of toothpaste... and the tabouli had parsley in it which I dislike. The falafel was yummy though and so was the borek.\n\nI ordered the Falafel Wrap and it was sooo yummy. it was a little dry but not too bad. It has hummus inside but it was even better when I added more hummus (from the platter) and baba ghanouj. I ordered fries with this and was amazed how well the fries were cooked. The outside was crispy but the inside was really really soft.\n\nMy boyfriend had the sauteed chicken. I took a bit of it and the chicken was cooked really well, but I think it should have more flavor (or maybe i didnt eat enough of it.) My boyfriend enjoyed it though, he finished the whole thing.\n\nThis place is really good. Definitely will come back.", "rating": 4, "date": "2010-07-23"}, {"excerpts": ["Mezza platter hummus, baba ghanouj, haydari, tabouli, falafel, and borek   14\n\n", "Baba ghanuj didn't have much flavor, haydari was good and creamy, and the borek was not memorable to me and looked like a skinny a fried egg roll. \n\n"], "author": "Brent W.", "review": "3.5 stars * My friends decided to make a dinner date at Layaly at 8pm Monday. Not know what type of food this place served, and doing what must of us do, I YELPed it. Mediterranean... I was never a big fan on Mediterranean. I always found it bland and empty. However given a 4 stars and knowing mediterranean food is one of the healthiest diets around (watching what I eat lately). I wanted to give it a taste. 8pm this place was quiet. Then again aren't most place quiet around this lower Clement?\n\n\nFriend 1- Beyti ground sirloin, and lamb, wrapped in lavash bread, tomato sauce   $13\n\nLooked like stuffed meat wrapped like a burrito and cut in half, topped with tomato sauce. Tomato sauce was good. The meat wasn't too greasy. Mouth size. Good.\n\nFriend 2-Layaly Mix Grill kofte, chicken, beef, lamb and shrimp $24\n (he would get this...) \n\nMe- Kofte Kebab ground beef and lamb (4), onions, and fresh herbs   14\n\nVery simple ground beef and lamb kebab. I couldnt tell visually which kebab was beef or lamb. Came with a side of wild rice. It was delicious better than I expected. Right texture and flavor of the meat, with the dipping sauce BOMB!\n\nMezza platter hummus, baba ghanouj, haydari, tabouli, falafel, and borek   14\n\nA MUST TRY. Hummus was my favorite. Just the right amount of salt. Baba ghanuj didn't have much flavor, haydari was good and creamy, and the borek was not memorable to me and looked like a skinny a fried egg roll. \n\nI have to give this place 3.5 stars\n\n3.5 stars- Nice place you can take a date here. Food was higher than my expectations, flavoruful, variety on the meun., and the dished come out  like works of art. HOOKA!\n\n-1.5 stars- Service and food was little slow. A group after us got their food before us?!, little on the pricey side for what you get in portions.\n \n\nI'D come back best Mediterranean I had by far... BTW its also a Hooka restaurant. Though I didnt smoke the hooka, when I go back for hooka i'll updated.\nCheers!", "rating": 4, "date": "2010-06-10"}, {"excerpts": ["Enjoyed the mixed grill plate for two, as well as dolmas, feta and olives, delicious baba ghanouj, and yummy cacik which is a yogurt cucumber sauce. ", "My husband loved the warm pita bread (I'm gluten-free)... ", "All delicious! ", "Delivery was earlier than quoted on Grubhub.com and courteous as well. ", "A bit on the pricey side for delivery but worth it. ", "Just looked them up and found out they are a hookah lounge too! ", "Planning to eat and hookah in person soon!"], "author": "Rosie S.", "review": "Hubby and I just moved to the Parkside and found an awesome Mediterranean place that delivers! Enjoyed the mixed grill plate for two, as well as dolmas, feta and olives, delicious baba ghanouj, and yummy cacik which is a yogurt cucumber sauce. My husband loved the warm pita bread (I'm gluten-free)... All delicious! Delivery was earlier than quoted on Grubhub.com and courteous as well. A bit on the pricey side for delivery but worth it. Just looked them up and found out they are a hookah lounge too! Planning to eat and hookah in person soon!", "rating": 4, "date": "2011-07-19"}], "borek": [{"excerpts": ["Food is delicious, loved the borek rolls and hummus plater for appetizers and the mix grill kabobs were amazing! ", "Also enjoyed the pomegranate lemonade it was so good! ", "Will definitely recommend to friends and family and we will return for sure!"], "author": "RamonaEliza D.", "review": "Came here with a few friends and wanted to try something new. This place is clean and welcoming. Ambiance is relaxing. Food is delicious, loved the borek rolls and hummus plater for appetizers and the mix grill kabobs were amazing! Also enjoyed the pomegranate lemonade it was so good! Will definitely recommend to friends and family and we will return for sure!", "rating": 4, "date": "2018-01-22"}, {"excerpts": ["We had the mezza platter to start with: Hummus, baba ghanouj, tabouli, falafel,  borek and warm pita. ", "All were very good...but the Borek (Fried filo dough stuffed with feta cheese and parsley) "], "author": "David G.", "review": "Right smack dab across the street from Hard Knox southern food is Layaly.\n\nYelp gives this cute little Mediterranean restaurant four stars ( and it really does deserve it). From the atmosphere, to the wonderful service, and the good food. Layaly is a nice gem.\n\nWe had the mezza platter to start with: Hummus, baba ghanouj, tabouli, falafel,  borek and warm pita. All were very good...but the Borek (Fried filo dough stuffed with feta cheese and parsley) was like Lebanese crack...omg.\n\nFor our mains we had the: Kofte Kebab which was a mixture of ground beef and lamb, onions and fresh herbs. served with rice and vegetables. Really tender and flavorful Kebabs with fluffy light rice. \n\nLamb Kebab Entrée marinated tender cubes of lamb skewered with onions and peppers. served with rice and vegetables. Very tender and sucullent lamb with not too much fat and cooked to perfection.\n\nDajaj chicken sautéed with onions, peppers, mushrooms and garlic in a tomato white wine sauce. served with rice. This Tajine ( think wonderful stew) was intensly arromatic and rich. The mushrooms and chicken were out of this world. Generous portion as well.\n\nWe took home two dishes for two family members that were revolting about dinning out (typical). They had the Falafel Wrap:  falafels with hummus, lettuce, tomatoes, pickles and tahini. This was the best Falafel sandwhich I have every tasted...so yummy and flavorful. They both had french fries with them  seasoned sumac.....they are the best. Crispy fries with that amazing sumac flavor. Only other place I know that does this is in Las vegas.\n\nPrices for dinning out are really reasonable. \n\nService was just fantastic. The wonderful lady that helped us always refilled our water, was super pleasant, and just super cool.\n\nOnly thing I didnt like, and it is petty, was one of the owners just hanging out playing on his cell phone.\n\nI would highly recommend checking this place out/", "rating": 4, "date": "2015-06-18"}, {"excerpts": ["*Mezza platter ($14): hummus, baba ghanouji, tabouli, falafel, borek and haydari, served with pita\n", "*Spinach salad (no feta) $9: baby spinach, tomatoes, mandarins tossed in a tahini citrus dressing\n", "*Layala mix grill (one person) $20: kofte, chicken, beef, lamb and shrimp skewers, served with rice and ", "arugula salad\n"], "author": "Elena N.", "review": "The roommate isn't a huge fan of Mediterranean food. So when he's on a diet or working in SJ, I tend to take advantage and order what I want for delivery. Last August 2013, he was on a diet, so I ordered from Layaly via Eat24.\n\n*Mezza platter ($14): hummus, baba ghanouji, tabouli, falafel, borek and haydari, served with pita\n*Spinach salad (no feta) $9: baby spinach, tomatoes, mandarins tossed in a tahini citrus dressing\n*Layala mix grill (one person) $20: kofte, chicken, beef, lamb and shrimp skewers, served with rice and arugula salad\n*Hummus (free with any order of $35 or more, normally $6.50): blend of garbanzo with tahini, lemon juice, olive oil and garlic, served with pita\n\nThe spinach salad was the roommate's pick. Not worth $9 without the feta. They should have made it bigger for us since we didn't want the cheese. Also, it had dried cranberries and olives. These were never mentioned in the description and the roommate hates olives.\n\nThe rest of the dishes were my choices. The mezza platter was a great way to sample a bunch of apps. I love hummus, tabouli and falafel especially, so I really enjoyed this. The mixed grill was the same. I was able to sample all their meats which was great! They were all flavorful and tender.\n\nGlad there's a Mediterranean restaurant with combo plates that deliver. Perfect for my lazy days when I'm on my own!", "rating": 4, "date": "2014-11-08"}, {"excerpts": ["It has a little of every appetizer (Hummus, baba ghanouj, tabouli, falafel, borek and haydari).   "], "author": "Rose Z.", "review": "Every time I eat here I feel like I'm being taken on a fabulous trip to the Mediterranean!  \n\nMy favorite dish has to be the Tantouni, which is one of their Tajines.   It is Sirloin sauteed in a white wine cream sauce with onion, bell pepper and mushrooms.  However, I prefer mine without the bell peppers. It's almost like the Mediterranean version of Beef Stroganoff, but over rice.  YUM!\n\nTheir meza platter is another great item to try.  It has a little of every appetizer (Hummus, baba ghanouj, tabouli, falafel, borek and haydari).   And if all else fails, you can't go wrong with kebabs. \n\nThe ambiance is very pleasant, and the staff is very friendly.  As well as they have a nice wine selection.\n\nHowever, if your feeling tired or lazy, you can always just order this great food to you.  They deliver!", "rating": 5, "date": "2015-03-10"}, {"excerpts": ["w/ Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek ($15) - 4 STARS\n", "http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=l-aiPHAOl0jH77o_FAB4zw\n", "We liked and devoured everything on the platter except the tabouli (parsley salad). ", "The hummus and haydari (yogurt sauce) was amazingly rich and creamy. ", "The baba ghanouj (mashed eggplant) was smooth yet still had some texture to it. ", "The falafel had a nice crunchy exterior with a soft center and the borek (fillo stuffed with feta) was like a savory cheese egg roll. \n\n", "It was served with warm pita bread which was perfect for sopping up all the yummy hummus, haydari and baba ghanouj.\n\n"], "author": "Cherylynn N.", "review": "Layaly is EVERYTHING you would expect from a neighborhood restaurant: Quaint, Delicious Food and Friendly Service!\n\nMy friends started off our Sunday with dim sim and went onto munch on silvanas (Filipino macarons) and sip on red velvet lattes. Being fatasses, we decide to end with dinner at Layaly because my friend had a Scoutmob - 50% off up to $15 deal. \n\nBe forewarned that parking in the area is a complete nightmare. There is a parking lot a block away for $6/hour. \n\nOn Sunday 9.4.11, my friend and I came in a little after 6 PM and Layaly was empty except for one couple. We were seated promptly (without reservations) while we waited for two of other friends to arrive.\n\nF O O D\n*MEZZA PLATTER: w/ Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek ($15) - 4 STARS\nhttp://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=l-aiPHAOl0jH77o_FAB4zw\nWe liked and devoured everything on the platter except the tabouli (parsley salad). The hummus and haydari (yogurt sauce) was amazingly rich and creamy. The baba ghanouj (mashed eggplant) was smooth yet still had some texture to it. The falafel had a nice crunchy exterior with a soft center and the borek (fillo stuffed with feta) was like a savory cheese egg roll. \n\nIt was served with warm pita bread which was perfect for sopping up all the yummy hummus, haydari and baba ghanouj.\n\n*LAYALY MIXED GRILL w/ Kofte, Chicken, Beef, Lamb, and Shrimp ($34 for 2 people) - 4 STARS\nhttp://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=xiCzw2TLqT2ga_WNAQreGQ\nEverything on the plate was packed with flavor and deliciously mouth-watering. The kofte (beef and lamb) was rich and juicy with a subtle gaminess. The beef and lamb were tender and filled with garlicky spices. The shrimp was nicely tender. The chicken, being white pieces was surprisingly very tender and moist. The accompanying yogurt sauce help cut through some of the richness while adding a tangy creaminess. I absolutely loved the rice pilaf as it had great texture and flavor. \n\nPortion sizes were very generous and the Layaly Mixed Grill could easily feed 3 people. \n\nS E R V I C E\nOur waitress was very approachable and friendly but spread thin because she was the only one in the front of the house. In the beginning, she was attentive but as it got busy, it was hard for her to keep up. They really need to hire additional help especially during peak hours on the weekends. Nonetheless, she did a great job making sure we were ok and that our water glasses were filled.\n\nMy only gripe is our entrees took a while to arrive. \n\nA M B I A N C E / D E C O R\nCasual, yet very warm and cozy. The mellow yellow walls and the red wooden furnishings created a very welcoming and charming feel to Layaly. There's also a back patio for hookah. \n\nP A R K I N G\nAs previously stated, street parking in the area is a NIGHTMARE. Your best bet is looking for parking a block away on California. There is a parking lot a block away for $6/hour.\n\nWith the Scoutmob deal, we each paid $21 (including tax and gratuity) which was very affordable. They even have $7 lunch specials offered every day. \n\nOther Note(s):\nWe noticed A LOT of people coming into Layaly wanting to do hookah but they didn't offer it on the Sunday we were there, so I highly recommend calling ahead of time to make sure it's being offered that night. \n\nDid you know that Mediterranean food is THE healthiest ethnic cuisine according to CNN? There goes another reason to check out Layaly. Sorry, spanakopita does NOT count.", "rating": 4, "date": "2011-09-09"}, {"excerpts": ["* Mezza Platter (Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek with lots of grilled pita to pile on your mezza - mmm, it was hard not to totally devour everything ", "and it was a lot! ", "My fave was the falafel, baba ghnaouj and borek)\n", "* ", "Layaly Mixed Grill Plate (Kofte, Chicken, Beef, Lamb, Shrimp, Zucchini and rice ", "- this was a generous grill plate, I was rather full from the mezza platter, but I enjoyed the chicken and zucchini very much, flavorful, tender, filling, it is going to be good as leftovers tonight too)\n", "*  ", "Baklava (sweet, crispy", ", I could only have a bite because I was so full, but will enjoy it as leftovers tonight as well)\n"], "author": "Maile N.", "review": "I love it when online deals stretch my boundaries and bring me all the way to Outer Richmond - I hardly come out this way but I know the restaurants out here are yum too!  \n\nWe had:\n\n* Mezza Platter (Hummus, Baba Ghanouj, Haydari, Tabouli, Falafel and Borek with lots of grilled pita to pile on your mezza - mmm, it was hard not to totally devour everything and it was a lot! My fave was the falafel, baba ghnaouj and borek)\n* Layaly Mixed Grill Plate (Kofte, Chicken, Beef, Lamb, Shrimp, Zucchini and rice - this was a generous grill plate, I was rather full from the mezza platter, but I enjoyed the chicken and zucchini very much, flavorful, tender, filling, it is going to be good as leftovers tonight too)\n*  Baklava (sweet, crispy, I could only have a bite because I was so full, but will enjoy it as leftovers tonight as well)\n*  Glass of Zinfandel from Lodi (nice combination with my meal)\n\nOur waitress was super friendly and she took the time to explain everything on the menu, the origins of the dishes, the pricing on our receipt after the online deal was calculated.  Really really lovely dining experience all around.  I would definitely be back.  Nice find!", "rating": 4, "date": "2013-01-15"}, {"excerpts": ["Every one of the appetizers sounds delicious, but my favorites are the borek (filo dough with feta and a yummy dipping sauce) and dolmas. ", "I love the pomegranate chicken tajine, unique sweet flavor, and I think the kofte kebab is my favorite entre (it's a combination of beef and lamb). ", "Their wine selection is great and they always have a house wine for $5. ", "They also have wraps which look really good! ", "It's a great place to have a date night :)"], "author": "Kylie B.", "review": "Layaly is my favorite spot in the Richmond. My biggest problem when I come here is its hard to decide what to get. Every one of the appetizers sounds delicious, but my favorites are the borek (filo dough with feta and a yummy dipping sauce) and dolmas. I love the pomegranate chicken tajine, unique sweet flavor, and I think the kofte kebab is my favorite entre (it's a combination of beef and lamb). Their wine selection is great and they always have a house wine for $5. They also have wraps which look really good! It's a great place to have a date night :)", "rating": 5, "date": "2015-09-25"}, {"excerpts": ["The falafel and borek were equally chewy and tasteless. ", "I was so excited for the chicken wrap, and it tasted like something I'd order at an airport kiosk. "], "author": "Sam D.", "review": "I got this delivered. I pondered the whole time if I should order a Diet Coke with it and then eventually went with no. If I would have ordered the Diet Coke, it would have been the best part of the meal, hands down.\n\nThe lentil soup was decent, but I wouldn't order it again. The falafel and borek were equally chewy and tasteless. I was so excited for the chicken wrap, and it tasted like something I'd order at an airport kiosk. The chicken was dry and the tzatziki sauce was watery and gross. \n\nThere was a house salad and that was good. Too bad it was only one corner of my plate.\n\nEw.", "rating": 2, "date": "2013-11-16"}, {"excerpts": ["My mom and I split the mezza platter which was great- hummus, baba ganouj, falafel, borek, tabouli, and we substituted the haydari (or something like that) with the dolma. ", "It came with a lot of  warm and soft pita bread. \n"], "author": "Jenn A.", "review": "Wonderful, flavorful Mediterranean food with great service. My mom and I split the mezza platter which was great- hummus, baba ganouj, falafel, borek, tabouli, and we substituted the haydari (or something like that) with the dolma. It came with a lot of  warm and soft pita bread. \nMy mom ordered the kofte wrap and it came with a salad. The kofte meat was definitely the highlight of the wrap. \nI ordered the tantouri tajine- sirloin in a white wine cream sauce with peppers, mushrooms, and onions. It was some of the best meat I've ever eaten. I don't know how they get the sirloin so soft but it was amazing. Really great spices. And it's served in a cute clay pot and comes with rice. \nThe service was also great. The waitress with the pink hair was super nice and helpful. The food came promptly and was served with a smile. \nI'll definitely be returning here soon.", "rating": 5, "date": "2014-05-22"}, {"excerpts": ["We ordered the Borek (\"fried fillo dough stuffed with feta cheese and parsley\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=NXVBpB01xZBkdoZOYuGYpQ, Cacik (\"Yogurt English cucumber, garlic, mint\") ", "http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=pbLNNiUlk5C8gIIun2FOPQ, Falafel (\"garbanzo with herbs and spices, fried served with tahini\") ", "http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=oCZIOGfyYBySHDEsocekpA, Garlic Fries http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=Tx34Ian7ImSDpfxoOupb_w, Mezza Platter (\"hummus, baba ghanouj, haydari, tabouli, falafel, and borek\") "], "author": "Mona C.", "review": "[M]ona: 3.5 Stars\n[W]ayne: 3.5 Stars\nAverage: 3.5 Stars\n\n+ Reasonable Prices\n+ Filling\n+ Good Portions\n+ Accepts Credit Cards\n\n- Slow Service\n- Dark\n \n[W] We came here because Mona had a restaurant.com certificate from here and it was a great deal. If you come here, I suggest just to stick with the appetizers because you get a lot of different choices to choose from and it's kind of inexpensive to try out many things. So tonight we had nothing BUT appetizers and man, I think we had a little too much haha.\n \n[M] We ordered the Borek (\"fried fillo dough stuffed with feta cheese and parsley\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=NXVBpB01xZBkdoZOYuGYpQ, Cacik (\"Yogurt English cucumber, garlic, mint\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=pbLNNiUlk5C8gIIun2FOPQ, Falafel (\"garbanzo with herbs and spices, fried served with tahini\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=oCZIOGfyYBySHDEsocekpA, Garlic Fries http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=Tx34Ian7ImSDpfxoOupb_w, Mezza Platter (\"hummus, baba ghanouj, haydari, tabouli, falafel, and borek\") http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=HfDL2S2ZVOI7jwyYWkMJ1Q and a side of rice http://www.yelp.com/biz_photos/9KeTKDuHdLMhRFku0HAIxw?select=QTDSx9QtiSg9PvJ7aL_6vw.\n\n[W] I personally didn't like the Cacik because the dip was wayyyyy to sour for me. Mona liked it on the other hand. It looked like some sort of thicker dip but it just had a little too much lemon or lime juice in it. \n\nMy 2nd suggestion is that if you get the Mezza Platter, DO NOT get the Falafels also. The platter already has the falafels and the 2 on the platter was already enough for me and Mona. \n\n[M] The Falafels tasted good at first but it was too fried for us. The insides were tasty but weren't really enjoyable because it's like eating something really burnt and crispy on the outside. \n\n[W] The other dish that was really good was their Rice haha. You're probably saying Rice? How can that be any good? But yea, trust me, IT WAS GOOOOOD. You really have to taste it to understand me. \n \nThe nice thing about this restaurant was that everything comes with some sort of dipping sauce which makes a big difference because if it didn't, I think everything would be extremely dry. \n\nThe only thing that bothered me was that the host was more attentive to his customers in their little secret back room. I guess this place has a hooka lounge in the back because people were walking out of nowhere from the back of the restaurant. That was kind of weird in my opinion because we're sitting in a restaurant and here comes some stoned people walking out of nowhere. I think they should have another entrance for those folks. That lead to another problem which was not being attentive to your other paying guests i.e. US. \n \nWe were done eating for a while and nobody was on the dining floor to assist us. So we just had wait until someone came out of the hooka room I guess. I guess that service could've been better. Oh well.  3.5 Stars.", "rating": 4, "date": "2010-03-22"}, {"excerpts": ["and so was the borek.\n\n"], "author": "Alicia W.", "review": "My boyfriend wanted to come here after driving past this place a lot. Took us a while to figure out where it was... because he had an idea of where this place was but not exactly sure. We almost gave up looking for it but I told him to try one more block and we found it! \n\nWe came here for lunch and my boyfriend wanted the baba ghanouj while i wanted hummus. So we ended up ordering the Mezza Platter as an appetizer. We were amazed by how much they gave us and it came with a basket of flat bread. I didnt want baba ghanouj because i didnt like eggplants, but it was actually really good. My fav was the hummus and baba ghanouj. The haydari was ok... the mint made me think of toothpaste... and the tabouli had parsley in it which I dislike. The falafel was yummy though and so was the borek.\n\nI ordered the Falafel Wrap and it was sooo yummy. it was a little dry but not too bad. It has hummus inside but it was even better when I added more hummus (from the platter) and baba ghanouj. I ordered fries with this and was amazed how well the fries were cooked. The outside was crispy but the inside was really really soft.\n\nMy boyfriend had the sauteed chicken. I took a bit of it and the chicken was cooked really well, but I think it should have more flavor (or maybe i didnt eat enough of it.) My boyfriend enjoyed it though, he finished the whole thing.\n\nThis place is really good. Definitely will come back.", "rating": 4, "date": "2010-07-23"}, {"excerpts": ["Mezza platter was good, but the borek is not as interesting as before and tabouleh was good, but did not excite us the way it did back in February. "], "author": "Jean K.", "review": "UNDER NEW OWNERS!\n\nService is enthusiastic and very good. But the food has slipped a little, not quite as exciting as our first visit in Feb 2010, and the portions have been reduced a little. Kebabs (we tried three different ones) were a little overcooked this time, although the cubes are good-sized.\n\nMezza platter was good, but the borek is not as interesting as before and tabouleh was good, but did not excite us the way it did back in February. The baba ghanoush (eggplant), kefir cheese, and hummus are still excellent, however, and the pita triangles are soft and warm.\n\nAfter our first visit we ranked them ahead of Oasis in Pleasanton, a similar restaurant (although the menus are quite different). Now - they are a tad below Oasis, although still very good.", "rating": 3, "date": "2010-11-01"}, {"excerpts": ["Mezza platter hummus, baba ghanouj, haydari, tabouli, falafel, and borek   14\n\n", "Baba ghanuj didn't have much flavor, haydari was good and creamy, and the borek was not memorable to me and looked like a skinny a fried egg roll. \n\n"], "author": "Brent W.", "review": "3.5 stars * My friends decided to make a dinner date at Layaly at 8pm Monday. Not know what type of food this place served, and doing what must of us do, I YELPed it. Mediterranean... I was never a big fan on Mediterranean. I always found it bland and empty. However given a 4 stars and knowing mediterranean food is one of the healthiest diets around (watching what I eat lately). I wanted to give it a taste. 8pm this place was quiet. Then again aren't most place quiet around this lower Clement?\n\n\nFriend 1- Beyti ground sirloin, and lamb, wrapped in lavash bread, tomato sauce   $13\n\nLooked like stuffed meat wrapped like a burrito and cut in half, topped with tomato sauce. Tomato sauce was good. The meat wasn't too greasy. Mouth size. Good.\n\nFriend 2-Layaly Mix Grill kofte, chicken, beef, lamb and shrimp $24\n (he would get this...) \n\nMe- Kofte Kebab ground beef and lamb (4), onions, and fresh herbs   14\n\nVery simple ground beef and lamb kebab. I couldnt tell visually which kebab was beef or lamb. Came with a side of wild rice. It was delicious better than I expected. Right texture and flavor of the meat, with the dipping sauce BOMB!\n\nMezza platter hummus, baba ghanouj, haydari, tabouli, falafel, and borek   14\n\nA MUST TRY. Hummus was my favorite. Just the right amount of salt. Baba ghanuj didn't have much flavor, haydari was good and creamy, and the borek was not memorable to me and looked like a skinny a fried egg roll. \n\nI have to give this place 3.5 stars\n\n3.5 stars- Nice place you can take a date here. Food was higher than my expectations, flavoruful, variety on the meun., and the dished come out  like works of art. HOOKA!\n\n-1.5 stars- Service and food was little slow. A group after us got their food before us?!, little on the pricey side for what you get in portions.\n \n\nI'D come back best Mediterranean I had by far... BTW its also a Hooka restaurant. Though I didnt smoke the hooka, when I go back for hooka i'll updated.\nCheers!", "rating": 4, "date": "2010-06-10"}, {"excerpts": ["The borek is also a good starter.\n\n"], "author": "Monarch B.", "review": "We discovered Layaly a few years ago, and it never disappoints. We've been back several times, and they also deliver to a wide area (for free).\n\nStart with the hummus and warm pita. It's creamy and not overpowering, and all too easy to eat too much before your meal arrives. The borek is also a good starter.\n\nThere are so many good entrees to choose from. I recommend the Beyti, the Chilean sea bass or the Kofte kebab. \n\nGood value for the price.", "rating": 4, "date": "2012-02-27"}, {"excerpts": ["Got the Borek-fried fillo dough stuffed with feta cheese and parsley.  ", "Seriously, if that description doesn't get you, let me say that this was possibly one of the best things I have ever eaten.  ", "I dreamed about it for night afterwards.  \n", "Also got the Layaly Mix Grill-kofte, chicken, beef, lamb and shrimp.  ", "Very good quality meats, nice grilled flavor, and excellent spices.  ", "That being said, I am not a huge huge meat fan, though my companion is.  ", "He loved everything on this platter.  ", "Personally, I could have just have like 8 orders of the Borek.\n\n"], "author": "Anya W.", "review": "Fantastic.  Everything just fantastic.  \nWent on a weeknight, so it was pretty empty  (which I never mind...empty=better service)  \nGot the Borek-fried fillo dough stuffed with feta cheese and parsley.  Seriously, if that description doesn't get you, let me say that this was possibly one of the best things I have ever eaten.  I dreamed about it for night afterwards.  \nAlso got the Layaly Mix Grill-kofte, chicken, beef, lamb and shrimp.  Very good quality meats, nice grilled flavor, and excellent spices.  That being said, I am not a huge huge meat fan, though my companion is.  He loved everything on this platter.  Personally, I could have just have like 8 orders of the Borek.\n\nAfter dinner we went into the back for some hookah.  Totally different atmosphere.  Very relaxed, with group of arabic guys sitting around playing cards.  Projection screen with the arabic top 40 music videos playing.  We got ourselves a deck of cards, ordered a hookah (with Lemon Mint Shisha. Good, I also recommend the watermelon flavor) and tea.  I have to note, I am not a smoker, and I hate the feeling of smoking (cigs or other).  However, this is smooth, cool, and easy....as sign of a well packed hookah, which is an indication of a great hookah bar.  Well done. I think we sat there enjoying the atmosphere for over an hour.  Great way to spend an evening.\n(The only possibly complaint is that you are not allowed to eat where you smoke.  Oh well, I guess it is a permit issue)", "rating": 5, "date": "2009-11-05"}, {"excerpts": ["I ordered the soup, falafel, kibbeh, borek, haydari, and the mixed grill.  ", "I found the food to be clean, fresh, and nicely seasoned.  ", "My favorite of the order was the shrimp, which had excellent flavor, followed by the haydari.  ", "The falafel was ok, as were the kebabs.  ", "The lentil soup was good but not great. ", "I would not recommend the kofte or kibbeh- and definitely steer clear of the borek.  ", "The borek, which was my least favorite had so little filling that it was almost hollow inside.  ", "At first I thought it was a freak borek, but all the others in the order were the same."], "author": "N A.", "review": "I ordered delivery from this place.  The food was good, and if I were in the neighborhood and hungry I would certainly go there, but I think that Tuba (Turkish), Park Gyros (Turkish), Lavash (Persian), and Mazzat (Lebanese) are superior choices.  That being said, I haven't sat down at this restaurant and the experience could be different. I ordered the soup, falafel, kibbeh, borek, haydari, and the mixed grill.  I found the food to be clean, fresh, and nicely seasoned.  My favorite of the order was the shrimp, which had excellent flavor, followed by the haydari.  The falafel was ok, as were the kebabs.  The lentil soup was good but not great. I would not recommend the kofte or kibbeh- and definitely steer clear of the borek.  The borek, which was my least favorite had so little filling that it was almost hollow inside.  At first I thought it was a freak borek, but all the others in the order were the same.", "rating": 3, "date": "2012-04-24"}], "greek shrimp": [{"excerpts": ["We got our appetizers (Greek shrimp and Dolmas) at 9pm.  ", "The Dolmas of course were cold . . . . ", "so was the shrimp!  ", "The plates were good, but not fantastic and let me emphasize the shrimp was COLD.  ", "We finally received our entrees around 9:30pm and we were starving, we got the Musaka, and the Beef, Chicken and Lamb Kebabs . . . . . . ", "They were all COLD.  ", "The Kebabs were charred, I know they cooked them on a grill of some sort why didn't they bring them out then!?  ", "The Kebabs at least weren't ground up meat it was all sliced ", "but I hate cold food I feel like I'm eating left overs.  ", "This restaurant NEEDS ", "TO INVEST IN A FOOD WARMER or bring the food out right after it is cooked instead of making you wait 1.5 hours for it.  ", "Again at this time there was only one other table of three people in the place . . . . ?  ", "And I didn't see any to-go orders go out "], "author": "Erin B.", "review": "I'm so sad writing this review.  This place has so much potential to be a great Mediterranean restaraunt.  The ambience is relaxing and welcoming the decor of the restaurant is appealing and there is a wide variety of dishes listed on the menu . . . . . they don't just focus on falafels.  \n\nI went to Layaly last night with two of my girl friends.  We showed up around 7:45pm and there were about five other parties eating.  We placed our food order around 8pm and then told the waitress we needed a little more time to decide on a bottle of vino . . . . . . at 8:30 she returned to take our order and we didn't get our Pinot till about 9pm.  The wine was good but seriously I was worrying about driving at that time because I thought the place closed at 9:30.  At this time there was only one other party in the restaurant waiting for their food . . . . . the other tables had their checks.\n\nWe got our appetizers (Greek shrimp and Dolmas) at 9pm.  The Dolmas of course were cold . . . . so was the shrimp!  The plates were good, but not fantastic and let me emphasize the shrimp was COLD.  We finally received our entrees around 9:30pm and we were starving, we got the Musaka, and the Beef, Chicken and Lamb Kebabs . . . . . . They were all COLD.  The Kebabs were charred, I know they cooked them on a grill of some sort why didn't they bring them out then!?  The Kebabs at least weren't ground up meat it was all sliced but I hate cold food I feel like I'm eating left overs.  This restaurant NEEDS TO INVEST IN A FOOD WARMER or bring the food out right after it is cooked instead of making you wait 1.5 hours for it.  Again at this time there was only one other table of three people in the place . . . . ?  And I didn't see any to-go orders go out so I have no idea why it took so long.\n\nSo much potential, the menu and decor are both appealing, the ambience is great . . . . but you need to wait forever to get your food and when it comes out it's COLD.  Also, there was no soap in the bathroom so bring your hand sanitizer for the chef if you go =/", "rating": 1, "date": "2013-02-07"}, {"excerpts": ["ok, I tried the hummus with steak (the best of the entire meal), Greek shrimp, mixed grills, pomegranate chicken, and a few other.  "], "author": "Jen C.", "review": "Come here only if you have hours to wait!  Don't come if you are starving, you won't get your food quick.\n\nFoods ok, I tried the hummus with steak (the best of the entire meal), Greek shrimp, mixed grills, pomegranate chicken, and a few other.  I agree with some other reviews, the kabobs are slightly too burnt.  \n\nServices - they do have enough servers to manage in house customers, but the kitchen does not have the capacity for  in-house guest + to-go orders.  It took a loooong time for food to come out!!!", "rating": 2, "date": "2014-04-22"}], "hummus billham": [], "gyro pita": [], "chicken pita": [{"excerpts": ["The Chicken Pita sandwich served at lunchtime is excellent. ", "A generous portion of white meat chicken rolled into 2 crisp servings of pita, makes this one of my favorite sandwiches in the city. \n", "Two thumbs up!"], "author": "Zach D.", "review": "I finally found great Mediterranean food in SF. Awesome food, fair prices and good service. The Chicken Pita sandwich served at lunchtime is excellent. A generous portion of white meat chicken rolled into 2 crisp servings of pita, makes this one of my favorite sandwiches in the city. \nTwo thumbs up!", "rating": 5, "date": "2009-07-26"}], "falafel pita": [], "gyro plate": [], "chicken plate": [{"excerpts": ["I got the sauteed chicken plate and it came with a nice helping of rice and chicken. ", "It was tomato based and had a lot of nice flavor... "], "author": "Sara K.", "review": "Came here by accident, which was probably a good thing to begin with. I was drawn in by their \"$7 lunch special.\" I thought, what a deal! The last time I had Med. food, it cost me my current paycheck, and the paycheck after.\n\nI didn't expect much quality or quantity wise due to the price, but I was pleasantly surprised. I got the sauteed chicken plate and it came with a nice helping of rice and chicken. It was tomato based and had a lot of nice flavor... And it filled me up!\n\nThe staff is very friendly and attentive, another bonus. I wouldn't come here all the time because parking sucks, but if I'm ever in the neighborhood for lunch, this is definitely a place I'd wanna go to.", "rating": 4, "date": "2010-04-03"}], "falafel plate": [], "salmon dinner entree": [], "grilled shrimp kebab dinner entree": [], "rack of lamb dinner entree": [], "stuffed eggplant dinner entree": [], "layaly mixed grill for  dinner entree": [], "couscous dinner entree": [], "lamb kebab dinner entree": [], "beef kebab dinner entree": [], "chicken kebab dinner entree": [], "kofte kebab dinner entree": [], "braised lamb shank dinner entree": [], "side of jasmine rice": [], "side of couscous": [], "side of fries": [{"excerpts": ["The side of fries were cripsy and seasoned to perfection. ", "Opa!"], "author": "Rachel Y.", "review": "I'm not usually a huge fan of Mediterranean/Greek food. It can get kind of bland in my opinion. Layaly has turned me into a believer! After a late lunch here, I have bookmarked it for the future cravings I'm sure to have. \n\nThe Mezza Platter was a good amount of food and came with a heaping pile of toasty warm pita points. The Kofte Wrap was also above par thanks to a thin pita wrap that was grilled to provide a nice crunch. The side of fries were cripsy and seasoned to perfection. Opa!", "rating": 4, "date": "2012-11-04"}, {"excerpts": ["so I decided to get it with some side of fries. "], "author": "Isaac B.", "review": "Let's just say that I'm amazed of how unique and creative this place is. This place has a really nice combo of a restaurant in the front and a hookah lounge in the back. I'm a huge fan of Falafels and haven't had any for years so I decided to get it with some side of fries. Presentation was neat, customer service was excellent, and the food was great. \n\nNext time I'll be back for some Hookah.", "rating": 4, "date": "2010-05-26"}, {"excerpts": ["he said, before biting into his lovely warm falafel sandwich with a side of fries and four pickle slices.  \n\n"], "author": "Harley B.", "review": "We just wandered in after a day at Baker Beach and this place was so great - spotless, the food awesome, the service excellent, the prices soooo loooow... that after demolishing half the Greek salad we shared my sweetheart said \"I want to buy a lottery ticket here.\"  \n\n\"Hmm?\" I queried, digging more warm pita into perfect smooth fresh hummous... \n\n\"Because they wouldn't stoop so low as to sell a loser.\" he said, before biting into his lovely warm falafel sandwich with a side of fries and four pickle slices.  \n\nWe will look forward to it for after every nekked beach day.", "rating": 5, "date": "2007-04-28"}], "side of feta and olives": [], "side of pita": [], "side of grilled vegetables": [], "kofte wrap": [{"excerpts": ["mediterranean KOFTE WRAP? ", "ve\nyo mediterranean hit the spot? ", "ry!"], "author": "Dan B.", "review": "yo mediterranean at the lounge? LA\nyo mediterranean at the brrr? YA\nyo mediterranean at the club? LY\nyo mediterranean at dinner? ok!\nyo mediterranean SALMON WRAP? de\nyo mediterranean TANTUNI? li\nyo mediterranean KOFTE WRAP? ve\nyo mediterranean hit the spot? ry!", "rating": 4, "date": "2018-02-03"}, {"excerpts": ["Ordered a Kofte Wrap with fries to go. \n\n"], "author": "Wendi A.", "review": "Ordered a Kofte Wrap with fries to go. \n\nWrap was very well balanced and made good left overs as well! \n\nCan't wait to try an eat-in order!", "rating": 4, "date": "2017-04-15"}, {"excerpts": ["The Kofte Wrap was also above par thanks to a thin pita wrap that was grilled to provide a nice crunch. "], "author": "Rachel Y.", "review": "I'm not usually a huge fan of Mediterranean/Greek food. It can get kind of bland in my opinion. Layaly has turned me into a believer! After a late lunch here, I have bookmarked it for the future cravings I'm sure to have. \n\nThe Mezza Platter was a good amount of food and came with a heaping pile of toasty warm pita points. The Kofte Wrap was also above par thanks to a thin pita wrap that was grilled to provide a nice crunch. The side of fries were cripsy and seasoned to perfection. Opa!", "rating": 4, "date": "2012-11-04"}, {"excerpts": ["My mom ordered the kofte wrap and it came with a salad. ", "The kofte meat was definitely the highlight of the wrap. \n", "I ordered the tantouri tajine- sirloin in a white wine cream sauce with peppers, mushrooms, and onions. ", "It was some of the best meat I've ever eaten. ", "I don't know how they get the sirloin so soft ", "but it was amazing. ", "Really great spices. ", "And it's served in a cute clay pot and comes with rice. \n", "The service was also great. ", "The waitress with the pink hair was super nice and helpful. ", "The food came promptly and was served with a smile. \n", "I'll definitely be returning here soon."], "author": "Jenn A.", "review": "Wonderful, flavorful Mediterranean food with great service. My mom and I split the mezza platter which was great- hummus, baba ganouj, falafel, borek, tabouli, and we substituted the haydari (or something like that) with the dolma. It came with a lot of  warm and soft pita bread. \nMy mom ordered the kofte wrap and it came with a salad. The kofte meat was definitely the highlight of the wrap. \nI ordered the tantouri tajine- sirloin in a white wine cream sauce with peppers, mushrooms, and onions. It was some of the best meat I've ever eaten. I don't know how they get the sirloin so soft but it was amazing. Really great spices. And it's served in a cute clay pot and comes with rice. \nThe service was also great. The waitress with the pink hair was super nice and helpful. The food came promptly and was served with a smile. \nI'll definitely be returning here soon.", "rating": 5, "date": "2014-05-22"}, {"excerpts": ["I got the kofte wrap and dolmas, both were pretty good and the wrap came with a salad. ", "I have nothing bad to say but also nothing wow'ed me there."], "author": "Tatyana K.", "review": "I got tricked to come here by their deal on Scoutmob - 50% off up to $15 but what they don't tell you is that's only valid for dinner. Had I known, I would've much rather went to Gordo's or the new Russian place near by today. \n\nThe restaurant was completely empty, during lunch on Friday which seems reasonable as I don't see too much demand for sit-down lunches in the Outer Richmond. The food still took ~15 minutes to come which tells me it's made fresh but also that I might've not made it back home on time for my meeting.\n\nI got the kofte wrap and dolmas, both were pretty good and the wrap came with a salad. I have nothing bad to say but also nothing wow'ed me there.", "rating": 3, "date": "2011-09-02"}, {"excerpts": ["I really enjoyed my kofte wrap.  ", "Unfortunately my enjoyment was very reluctant as they took over an hour and 45 minutes to deliver my food! ", "This is after they had quoted me with an hour maximum delivery time.  ", "If they had just been honest with how long it would take, I would have waited to order from them on a day they were less busy and ordered something quicker.  ", "I understand that sometimes delivery will take a while, but I can't stand when restaurants aren't honest about how long it will actually take."], "author": "Ryan C.", "review": "I wish I could give them a higher rating, because the food was delicious.  The Mezza Platter was great to share with so many different but excellent flavors. I really enjoyed my kofte wrap.  Unfortunately my enjoyment was very reluctant as they took over an hour and 45 minutes to deliver my food! This is after they had quoted me with an hour maximum delivery time.  If they had just been honest with how long it would take, I would have waited to order from them on a day they were less busy and ordered something quicker.  I understand that sometimes delivery will take a while, but I can't stand when restaurants aren't honest about how long it will actually take.", "rating": 3, "date": "2014-09-21"}], "steak wrap": [{"excerpts": ["I ordered the steak wrap, which was very fulfilling. ", "The food and service here is great. ", "My server was very kind."], "author": "Maggie T.", "review": "Came in on a Wednesday evening and it wasn't too crowded. My friends and I were seated right away. The inside of the restaurant was very nice. It was very dim, but it seemed to lean more on the extravagant side. I ordered the steak wrap, which was very fulfilling. The food and service here is great. My server was very kind.", "rating": 4, "date": "2017-08-03"}, {"excerpts": ["- Stuffed Eggplant\n- Steak Wrap\n", "- Dajaj\n- Baklava: not very sweet which was what we like"], "author": "Lily L.", "review": "My girlfriends and I came here to celebrate a birthday on a Wed evening. The place was quite empty. But it was good for us because we got almost an undivided attention from the waitress. All the dishes that we ordered were very tasty and the portions were quite generous. We would definitely go back again. Hopefully business would be picked up more. I will hate to see this restaurant closes.\n\nWe ordered the following. \n-Mezza Platter: a good sampler platter of appetizers. Hummus was delicious and the pita bread was served warm. The portion was very generous.\n- Stuffed Eggplant\n- Steak Wrap\n- Dajaj\n- Baklava: not very sweet which was what we like", "rating": 5, "date": "2017-12-03"}, {"excerpts": ["Ingredients all fresh, price for a steak wrap, pistachio salad ( which was huge, included pita and hummus) and vegetable wrap was very reasonable. ", "It was to much food for two of us. ", "Food was delivered fast. ", "Also got fries with both our wraps. ", "After we finished eating my wife said to make sure to bookmark this place. ", "Guess we have a new favorite delivery. ", "Will probably go to restaurant soon. ", "Love the food."], "author": "David M.", "review": "This place has the best food my wife and I have ever had delivered. Ingredients all fresh, price for a steak wrap, pistachio salad ( which was huge, included pita and hummus) and vegetable wrap was very reasonable. It was to much food for two of us. Food was delivered fast. Also got fries with both our wraps. After we finished eating my wife said to make sure to bookmark this place. Guess we have a new favorite delivery. Will probably go to restaurant soon. Love the food.", "rating": 5, "date": "2017-06-25"}, {"excerpts": ["We like the hummus, dolma, salmon wrap, steak wrap, tarjines especially the sabanihk, salmon dinner, and lamb shank dinner.  ", "They have recently raised the prices ($1-$3) and took out the sabanikh tarjine."], "author": "G D.", "review": "Good food and good service!!!\n\nWe enjoy this neighborhood restaurant.  It has the best waitresses and manager Jessica - knowledgeable, polite, professional, and efficient.  They know the menu in the back of their head.  We eat in or do take-outs twice monthly.  We like the hummus, dolma, salmon wrap, steak wrap, tarjines especially the sabanihk, salmon dinner, and lamb shank dinner.  They have recently raised the prices ($1-$3) and took out the sabanikh tarjine.", "rating": 4, "date": "2016-07-19"}], "salmon wrap": [{"excerpts": ["mediterranean SALMON WRAP? ", "de\nyo ", "mediterranean TANTUNI? ", "li\nyo "], "author": "Dan B.", "review": "yo mediterranean at the lounge? LA\nyo mediterranean at the brrr? YA\nyo mediterranean at the club? LY\nyo mediterranean at dinner? ok!\nyo mediterranean SALMON WRAP? de\nyo mediterranean TANTUNI? li\nyo mediterranean KOFTE WRAP? ve\nyo mediterranean hit the spot? ry!", "rating": 4, "date": "2018-02-03"}, {"excerpts": ["The food: \nI had the salmon wrap. ", "It came with a choice of salad or fries. ", "Opted for fries which were really tasty with just a hint of salt. ", "The salmon wrap was delicious too. ", "My niece had the chicken kebab (I sampled it ", "and it was moist and tender and delicately spiced). ", "Brother had shrimp kebab and his wife had the shrimp tajine.  ", "We shared a pistachio ice cream and chocolate cake for dessert. "], "author": "William Y.", "review": "Had dinner here tonight with Family. Firstly, have to say that the restaurant is small, but a nice small with \nAn Ambience that was welcoming, comfortable and inviting. Cozy decor. \n\nSecondly, the waitress was very pleasant and attentive. This is what made her so amazing since she seem to be the only one on the floor working. She took our orders, seated others, brought us our food, took care of takeout orders, cleared tables and took care of the check! Talk about multi-tasking. All with a smile. \n\nThe food: \nI had the salmon wrap. It came with a choice of salad or fries. Opted for fries which were really tasty with just a hint of salt. The salmon wrap was delicious too. My niece had the chicken kebab (I sampled it and it was moist and tender and delicately spiced). Brother had shrimp kebab and his wife had the shrimp tajine.  We shared a pistachio ice cream and chocolate cake for dessert. Both were sweet- but just right. \n\nI will be back!", "rating": 4, "date": "2016-04-07"}, {"excerpts": ["I had the salmon wrap for dinner which was juicy and cooked to perfection with thin fries that were very tasty. ", "My husband had the falafel wrap and declared it to be the best he's had so far."], "author": "Elizabeth S.", "review": "Hidden gem of goodness. We started with the assortment of dips and dolmas accompanied by warm bread. Everything was super yummy the Haydari was smooth and oh so good. We shared the Greek salad which was a good size and prepared perfectly. I had the salmon wrap for dinner which was juicy and cooked to perfection with thin fries that were very tasty. My husband had the falafel wrap and declared it to be the best he's had so far.", "rating": 5, "date": "2017-02-08"}, {"excerpts": [":\n\nSalmon Wrap: "], "author": "Guilliana J.", "review": "Overall: 8/10 \n\nNice ambience, a bit busy but very nice waiting staff. The server was very attentive and welcoming\n\nWe started off with an appetizer;\n\nFalafel: Firm yet crisp. Spicy and good if eaten with mint leaves. Good for the price (4 for $5)\n\nFor the dinner:\n\nSalmon Wrap: Crunchy wrap with flavorful salmon. Solid and delicious especially for its price.\n\nShrimp Tajine: Very buttery, smooth tomato sauce. Very good if poured on the rice it comes with. Shrimp a bit spicy but good.\n\nShrimp Kabob: Good portion. Does not have a smoky flavor. \n\nChicken Kabob: Flavorful, Smooth and delicious. Mint sauce on side compliments it. Rice was a standout, light yet filling.\n\nAfter we had desserts:\n\nPistachio Ice Cream: Creamy and whole pistachios were nice touch. \n\nChocolate Cake: More mousse and frosting then cake. The only dish that did not live up to our expectations but it did not negatively impact the experience. \n\nMint Tea (forgot the name of it): Clean and refreshing. Good for drinking throughout the meal.\n\nVery good first time experience. The highlight was the waitress. Will go back soon!", "rating": 4, "date": "2016-04-07"}, {"excerpts": ["We like the hummus, dolma, salmon wrap, steak wrap, tarjines especially the sabanihk, salmon dinner, and lamb shank dinner.  ", "They have recently raised the prices ($1-$3) and took out the sabanikh tarjine."], "author": "G D.", "review": "Good food and good service!!!\n\nWe enjoy this neighborhood restaurant.  It has the best waitresses and manager Jessica - knowledgeable, polite, professional, and efficient.  They know the menu in the back of their head.  We eat in or do take-outs twice monthly.  We like the hummus, dolma, salmon wrap, steak wrap, tarjines especially the sabanihk, salmon dinner, and lamb shank dinner.  They have recently raised the prices ($1-$3) and took out the sabanikh tarjine.", "rating": 4, "date": "2016-07-19"}], "eggplant wrap": [], "lamb kebab lunch": [], "beef kebab lunch": [], "chicken kebab lunch": [], "kofte kebab lunch": [], "mix vegetable kebab lunch": [], "grilled shrimp lunch entree": [], "salmon lunch entree": [], "sauteed chicken lunch entree": [], "stuffed eggplant lunch entree": [], "pistachio salad": [{"excerpts": ["Ingredients all fresh, price for a steak wrap, pistachio salad ( which was huge, included pita and hummus) and vegetable wrap was very reasonable. ", "It was to much food for two of us. ", "Food was delivered fast. ", "Also got fries with both our wraps. ", "After we finished eating my wife said to make sure to bookmark this place. ", "Guess we have a new favorite delivery. ", "Will probably go to restaurant soon. ", "Love the food."], "author": "David M.", "review": "This place has the best food my wife and I have ever had delivered. Ingredients all fresh, price for a steak wrap, pistachio salad ( which was huge, included pita and hummus) and vegetable wrap was very reasonable. It was to much food for two of us. Food was delivered fast. Also got fries with both our wraps. After we finished eating my wife said to make sure to bookmark this place. Guess we have a new favorite delivery. Will probably go to restaurant soon. Love the food.", "rating": 5, "date": "2017-06-25"}], "stuffed falafel salad": [{"excerpts": ["Everything I've ordered is amazing, especially the stuffed falafel salad."], "author": "John F.", "review": "This is seriously the best middle Eastern food I have ever had. Everything I've ordered is amazing, especially the stuffed falafel salad.", "rating": 5, "date": "2016-02-20"}], "dajaj tajine": [{"excerpts": ["Here's the lowdown:\n\nDajaj tajine (Chicken, onion and mushroom in a tomato broth) - Delicious and best dish of night\nTantouni tajine (Beef in a creamy white sauce) "], "author": "Ali F.", "review": "Had a dine-in experience here and it was great food! No wait for a seat either in the evening. I normally get kabobs when ordering Mediterranean food. Although our meal did include the mixed grill kabobs, that turned out not to be the highlight of the meal. Deciding to try something new, we went with a couple of tajines (clay pot) and they come with a side of rice. And it turned out to be a nice surprise. Here's the lowdown:\n\nDajaj tajine (Chicken, onion and mushroom in a tomato broth) - Delicious and best dish of night\nTantouni tajine (Beef in a creamy white sauce) - Great flavor and beef was really tender. Second best dish of night\nBazinjan tajine (Beef and eggplant in spicy tomato sauce) - A little spicy but good. Beef was also very tender\nMixed Grill (Beef, chicken, shrimp, lamb) - Didn't get much lamb in this entree and meat was a bit charred. Yogurt dipping  sauce was good. Ok dish.\n\nGood experience and would love to come back to try more of the tajines...", "rating": 4, "date": "2014-12-29"}], "tantouni tajine": [{"excerpts": ["Here's the lowdown:\n\nDajaj tajine (Chicken, onion and mushroom in a tomato broth) - Delicious and best dish of night\nTantouni tajine (Beef in a creamy white sauce) "], "author": "Ali F.", "review": "Had a dine-in experience here and it was great food! No wait for a seat either in the evening. I normally get kabobs when ordering Mediterranean food. Although our meal did include the mixed grill kabobs, that turned out not to be the highlight of the meal. Deciding to try something new, we went with a couple of tajines (clay pot) and they come with a side of rice. And it turned out to be a nice surprise. Here's the lowdown:\n\nDajaj tajine (Chicken, onion and mushroom in a tomato broth) - Delicious and best dish of night\nTantouni tajine (Beef in a creamy white sauce) - Great flavor and beef was really tender. Second best dish of night\nBazinjan tajine (Beef and eggplant in spicy tomato sauce) - A little spicy but good. Beef was also very tender\nMixed Grill (Beef, chicken, shrimp, lamb) - Didn't get much lamb in this entree and meat was a bit charred. Yogurt dipping  sauce was good. Ok dish.\n\nGood experience and would love to come back to try more of the tajines...", "rating": 4, "date": "2014-12-29"}], "dhanie tajine": [], "bazinjan tajine": [{"excerpts": ["For our entrees, we ended up ordering the Kofte Kebab (mixture of ground lamb and beef with onions and herbs, served with rice and salad) and the Bazinjan Tajine (sirloin sautéed in a spicy garlic tomato sauce, with eggplant, onions, and bell peppers, served with a side of rice).\n\n"], "author": "Jenny C.", "review": "*Dined in 5/14/16*\n\nI have grown up in the Richmond my whole life, but I don't know when Layal was established there. Even if I knew, it has only been in the past year have I grown to enjoy Mediterranean food. It's been my go-to when I want to eat generally healthy. \n\nIt's the night before Bay to Breakers and the hubby and I didn't want to eat anything to heavy before our race so I Yelp'd around the area and came upon Layal. I recall walking by it a few times, and one time even looking at the menu but always disregarded it. This time, I checked out the photos and it was an easy decision. [Note: This is a good sign because my husband knows I can be indecisive, and then i get hangry.] I called in to ask about the wait time for 2 and the girl who picked up the phone said there wasn't any wait but she'll put her name down since it looked like people were slowly trickling in. We weren't too far away so it worked out. \n\nWhen we arrived, there were a few parties sitting down, with much of the tables open. They sat us down and served us water immediately. On it! We took some time to glance over the menu and started off with the hummus, since everyone on here raved about it :) It was a good thing we ordered an appetizer because the kitchen was kind of slow and they were short a server. Jessica was able to get it done though, so helpful! For our entrees, we ended up ordering the Kofte Kebab (mixture of ground lamb and beef with onions and herbs, served with rice and salad) and the Bazinjan Tajine (sirloin sautéed in a spicy garlic tomato sauce, with eggplant, onions, and bell peppers, served with a side of rice).\n\nThe hummus was excellent! So smooth and creamy with the perfect amount of flavoring. The drizzle of the olive oil on top was the perfect addition. The pita bread was so fresh and soft!! You really can't yourself from eating it. Since we had to wait a bit for our order to come out, I asked for extra bread to pass the time, and again, it came out piping hot!\n\nMy kofte kebab was delicious! When you cut the meat into bite size pieces, it may appear tough or dry, when you eat it, it's tender and juicy. They know how to do it right! I didn't want the rice and asked for extra salad, and they delivered. Half my plate was covered with fresh arugula with a sprinkle of salt. The tzatziki sauce that came with it was BOMB! Yelpers mentioned that as well. The meat was good and flavorful so I didn't really feel the need to dip too much in it. But I typically don't drench things in sauce or dressing, less is more. Hubbs enjoyed his bazinjan, it is a bit on the spicy side but the amount of spice was good enough where you can still savor and enjoy the flavors of the dish. However, to avoid any upset stomachs, we felt that he best not finish it, since he had to run in 12 hours. Lucky for him, he got to help me with my kofte. \n\nAt the end of the meal, Jessica brought us a baklava for dessert since we had to wait for our meal. What a nice gal! It was good, but it might have given me an allergic reaction. I don't have any known allergies but when I got home, I got a little itchy and was getting red dots on my body. Don't know if it was the baklava cause it has pistachios (something I'm used to eating) or the meal itself. Whatever it is, I'm willing to go back and test it out. It's that good!\n\nSo glad I discovered this quiet, cozy, almost hole-in-the-wall restaurant in the neighborhood. Can't wait to try the other items on the menu. Hopefully next time, the service will be a bit faster too.", "rating": 4, "date": "2016-05-17"}, {"excerpts": ["Second best dish of night\nBazinjan tajine (Beef and eggplant in spicy tomato sauce) - ", "A little spicy but good. ", "Beef was also very tender\nMixed Grill (Beef, chicken, shrimp, lamb) ", "- Didn't get much lamb in this entree and meat was a bit charred. ", "Yogurt dipping  sauce was good. "], "author": "Ali F.", "review": "Had a dine-in experience here and it was great food! No wait for a seat either in the evening. I normally get kabobs when ordering Mediterranean food. Although our meal did include the mixed grill kabobs, that turned out not to be the highlight of the meal. Deciding to try something new, we went with a couple of tajines (clay pot) and they come with a side of rice. And it turned out to be a nice surprise. Here's the lowdown:\n\nDajaj tajine (Chicken, onion and mushroom in a tomato broth) - Delicious and best dish of night\nTantouni tajine (Beef in a creamy white sauce) - Great flavor and beef was really tender. Second best dish of night\nBazinjan tajine (Beef and eggplant in spicy tomato sauce) - A little spicy but good. Beef was also very tender\nMixed Grill (Beef, chicken, shrimp, lamb) - Didn't get much lamb in this entree and meat was a bit charred. Yogurt dipping  sauce was good. Ok dish.\n\nGood experience and would love to come back to try more of the tajines...", "rating": 4, "date": "2014-12-29"}], "falafel wrap lunch": [], "kofte wrap lunch": [], "chicken wrap lunch": [], "eggplant wrap lunch": [], "steak wrap lunch": [], "salmon wrap lunch": [], "mixed pickles": []}