{"crab cake beurre blanc": [{"excerpts": ["I'll have the Crab Cake Beurre Blanc.  \n\n"], "author": "Kim D.", "review": "Real bistro fare that isn't shy about butter and cream - check.\nHard-core Vietnamese waiters kickin' it old school, Colonial style - check.\nMini-chalkboard menu brought to your tiny table - check.\nWillie Brown sitting at his window table every Friday for lunch - check.\n\nI've been here for lunch and dinner at least a dozen times and I am always the youngest person in the house... by a solid 2 decades.  It's loud, boistrous, and the seating arrangements border on claustrophobic.\n\nDuck rillettes.  Two words that keep me coming back.  Oh, that... and \"duck aspic\".  Which is served cubed and generously scattered across the serving plate... When no one is looking, I scoop a few pieces into my mouth, and let my tongue play over them as they yield and melt across my taste buds.  \n\nWhy can't I buy duck-flavored jello at the store?  \n\nThis gorgeous slab of decadent... duckness... liberally spread across sliced table bread and sprinkled with some gelee... followed by a mini-bite of cornichon is as close to lunch-hour heaven as it gets.  For $7.50, and without risking a misdemeanor, that is.  \n\nAnd that's my appetizer!  I also adore the leeks vinaigrette, the sexy salad nicoise and when I'm feeling like a splurge (which is often) I'll have the Crab Cake Beurre Blanc.  \n\nThe latter is a portly, fist-sized crustacean-cake that arrives crisped and coated lightly in bread crumbs... basking in a freshly-poured puddle of buerre blanc.  While this item is listed as an appetizer, if you start with something else... and share a few bites of your fellow diner's dishes... the crab cake can serve as an entree. \n\nI, personally am over tiny little appetizers... like the \"lobster ceviche\" that I ordered at Nobu back in 1999 for $20 and was nothing more than a short stack of tortilla chips with a paltry sprinkling of dry lobster crumbs between them. Not that I'm holding a grudge or anything.  \n\nOkay - back to my crab cake:  it's refreshingly free of fillers and chunks of not-crab.  It is perfect with a swipe of the beurre blanc and should be consumed reverently, at a leisurely pace.  \n\nSo... maybe this place is a bit stodgy... but between the authentic bistro fare, which includes seasonal delicacies and a charcuterie selection that never leaves me wanting... I always hit that gustatory sweet spot.  \n\nLook for me if you stop by for lunch; I'll be the only other person who doesn't have an AARP membership, blissfully attending to my rillette or pate de campagne.", "rating": 3, "date": "2008-02-20"}], "mussels marinière": [], "lescargot bourguignon": [], "onion soup gratinée": [{"excerpts": ["Onion Soup Gratinée was OK but Escargots de Bourgogne was over the top... and the Souffle Glacee was exceptional"], "author": "William T.", "review": "wife and I went to set menu as part of restaurant week.  as so many others have said, the Cassoulet was to die for but so was the Beef Bourguignon!  the appetizers Onion Soup Gratinée was OK but Escargots de Bourgogne was over the top... and the Souffle Glacee was exceptional", "rating": 4, "date": "2017-01-19"}], "foie gras terrine": [], "roasted fresh beets": [], "belgian endive": [{"excerpts": ["Excellent pate, lovely Belgian endive. ", "Service was appropriate for slow food and charming bistro as ambiance. ", "Although we arrived too late to take advantage of it, their happy hour looked excellent. ", "If you love traditional French bistro food (and know what that actually is) you will love Le Central, too."], "author": "Jordana G.", "review": "Love love love Le Central. I ate here many times when it first opened in 1974. Still takes you back to France every meal. Classic and traditional French bistro fare. Excellent pate, lovely Belgian endive. Service was appropriate for slow food and charming bistro as ambiance. Although we arrived too late to take advantage of it, their happy hour looked excellent. If you love traditional French bistro food (and know what that actually is) you will love Le Central, too.", "rating": 5, "date": "2017-06-16"}], "butter lettuce": [{"excerpts": ["The second course was a butter lettuce salad with nothing exciting to speak of. ", "The third course was a French onion soup ($12) which was very mediocre. "], "author": "Danielle A.", "review": "Le Central is a French restaurant offering French cuisine in the heart of San Francisco. We stumbled on this restaurant. When we walked in we were greeted by the bartender behind the bar and he pointed to a table and we proceeded to sit ourselves. We were greeted several minutes later by a server that had little to no knowledge of the menu and wine list. Or he just didn't want to be bothered with talking to us. He was rushed, distracted and was not engaging. \n\nWe started with a CA house cab which was $48 and very tasty. From there we had escargot and sourdough bread. The appetizer was garlicky, buttery and yummy. \n\nThe second course was a butter lettuce salad with nothing exciting to speak of. The third course was a French onion soup ($12) which was very mediocre. For the restaurant being French cuisine, I expected a top notch soup. \n\nNext, was the main, beef bourgeoisie and the duck confit special. Both dishes were overly salty with very little flavor. \n\nWe ended with a blah experience which we will not be repeating. For San Francisco this restaurant is one I would pass on.", "rating": 2, "date": "2018-03-24"}, {"excerpts": ["We also had the butter lettuce salad which was delicious, ", "the french fries which were really good, and the escargot because when at a French restaurant, go big or go home. ", "Flavors on everything were solid, the dishes were well prepared, and and it was great for a group of eight."], "author": "Sophie S.", "review": "I'll admit, I wasn't psyched to come here for a group dinner a few weeks ago. There are so many new, trendy restaurants in San Francisco, and French food isn't usually high on my list. But I was very pleasantly surprised by Le Central!\n\nThe atmosphere is warm and feels a lot like the bistros you'd see in the streets of Paris--it was fun to feel transported when we walked in. They also have a good happy hour deal on house wines but you have to order it at the bar, can't get it at your table!\n\nThe cassoulet was definitely the standout. It's quite heavy--I split it with another person and it was still a lot of food. I'd actually suggest three people go for it and then get sides. But the flavors were excellent, it was comforting, and not something you find at most restaurants in San Francisco. We also had the butter lettuce salad which was delicious, the french fries which were really good, and the escargot because when at a French restaurant, go big or go home. Flavors on everything were solid, the dishes were well prepared, and and it was great for a group of eight.", "rating": 4, "date": "2017-09-28"}, {"excerpts": ["We did split a butter lettuce salad to start and that is always good with a light creamy vinaigrette dressing and a small amount of chopped egg on top.\n\n"], "author": "Mary A.", "review": "It's time to update my review of Le Central.   We like this small restaurant and have been here several times for lunch.  One of these times we must try dinner here. Not sure the menu is any different.  But the service is always consistent.  Once seated, water or beverage is offered and then you are presented with menus and a small blackboard listing the specials of the day.  I highly recommend those!\n\nWe both had Petrale sole in a lemon butter sauce with boiled potato, carrot, and broccoli on the side.  It was perfectly cooked with an egg wash and then sautéed.  At least that's how I tasted it.  There were two portions of sole so my husband and I could've easily shared this dish.  We did split a butter lettuce salad to start and that is always good with a light creamy vinaigrette dressing and a small amount of chopped egg on top.\n\nWe had excellent black coffee and skipped dessert.  We were full.  And we will  definitely be back.  One can always count on Le Central for a good meal---it rarely changes and it's nice to be able to know what to expect!", "rating": 5, "date": "2015-06-08"}, {"excerpts": ["Also had butter lettuce salad which was good. ", "Didn't drink or eat any dessert but will definitely come back on my own with a friend or two. ", "A good place to take out of town guests I think."], "author": "Vol T.", "review": "Came here with coworkers for holiday luncheon. My meal was paid for.. so maybe I'll be grading them on a curve LOL. I liked this place. Really nice French cute vibe. Food was good. I had the special which was lobster and scallops in what I would call a pot pie LOL. It was delicious with big chunks of lobster and scallops. Also had butter lettuce salad which was good. Didn't drink or eat any dessert but will definitely come back on my own with a friend or two. A good place to take out of town guests I think.", "rating": 4, "date": "2014-01-13"}, {"excerpts": ["Fresh and good butter lettuce salad. ", "Awesome creme brulee and chocolate mousse. "], "author": "David S.", "review": "Great old school French place (full of old school people). Traditional atmosphere, good service, cool Maitre'd.\n\nVery good steaks with fries. Mine was perfectly cooked and tasty. Fresh and good butter lettuce salad. Awesome creme brulee and chocolate mousse. Great selection of wines.\n\nI'll definitely go back!", "rating": 3, "date": "2010-12-14"}, {"excerpts": ["Always a butter lettuce salad to start and wonderful sweet French baguette and sweet butter to accompany everything. ", "I never have a problem making a reservation and the staff are always kind and attentive."], "author": "Hotel B.", "review": "I've been dining at LeCentral for over 30 years. It's like the old suede coat in the back of my closet - comfortable, unpretentious and hasn't changed a bit. The French brothers that owned it have long retired but the new owners have retained the menu - my favorites being the Chicken - roasted or cold - or the Cold Poached salmon. Always a butter lettuce salad to start and wonderful sweet French baguette and sweet butter to accompany everything. I never have a problem making a reservation and the staff are always kind and attentive.", "rating": 5, "date": "2012-10-05"}, {"excerpts": ["the greens on the side were ordinary, so maybe for next time, a starter salad like their goat cheese cheese or butter lettuce will be make a nice addition.\n\n"], "author": "Oanh N.", "review": "I've heard good things about this bistro and it is your place for french comfort food. I had a tiny bad experience which was a lipstick stained water glass. The waiter took it away and poured my water into a new glass =\\ why he had not just handed me a new glass...i do not know. \ni ordered the CHICKEN POT PIE and it was very good. it had a nice flakey crust. the chicken, peas, potatoes were oozing with comfort. not too salty, not too bland, it was just right. the greens on the side were ordinary, so maybe for next time, a starter salad like their goat cheese cheese or butter lettuce will be make a nice addition.\n\nMake reservation if having lunch here on a weekday. it can get very crowded.", "rating": 3, "date": "2008-08-07"}, {"excerpts": ["The Butter lettuce salad was good, true to the menu. ", "Desert was good too, and true to the menu. ", "For me, the heart of the night is the main dish and it really fell short. ", "I did look at our neighbors who ordered the filet and it looked really good ", "and they totally cleaned their plates.. ", "I am up for trying this place again.. ", "Perhaps I need to ask many questions before I make my decision on what I am going to order so I am not disappointed."], "author": "Martina L.", "review": "Okay, so Le Central is really nice, quant, good Martini's, attentive bar staff. However, I have an issue with the description on the menu. I had \"Grilled Jumbo Prawns Saffron green pea risotto, tomato sauce\" What I did get was 4 perfectly cooked jumbo prawns with rice with green peas, NOTHING close to risotto.. At $25 if it had been a proper risotto then I would have been, okay there was some work involved in the dish and perhaps justification of the cost of the entree, but it was plain old rice, and grilled prawns, no special talent needed to do this.. So basically it was like $5 a prawn and $5 for a portion of rice.. I know you are close to Union Square and get a lot of tourists (BTW, I am not a tourist, I might have an accent but I've lived here for 22 years). Set the expectations for the diner. I was expecting risotto, I got rice with peas. The Butter lettuce salad was good, true to the menu. Desert was good too, and true to the menu. For me, the heart of the night is the main dish and it really fell short. I did look at our neighbors who ordered the filet and it looked really good and they totally cleaned their plates.. I am up for trying this place again.. Perhaps I need to ask many questions before I make my decision on what I am going to order so I am not disappointed.", "rating": 2, "date": "2014-02-02"}, {"excerpts": ["This time we sat at the table where Herb Caen used to sit and had the French onion soup, butter lettuce salad, tomato and anchovy salad, and the smoked trout plate, along with some stiff drinks and ending off with the creme caramel and chocolate pot de creme.  ", "Like J said, just basic ingredients, but all prepared correctly.  ", "Staff was very nice, friendly and attentive."], "author": "Pelle Y.", "review": "I first came here for Bastille Day and had really good French onion soup and  escargots.  This time we sat at the table where Herb Caen used to sit and had the French onion soup, butter lettuce salad, tomato and anchovy salad, and the smoked trout plate, along with some stiff drinks and ending off with the creme caramel and chocolate pot de creme.  Like J said, just basic ingredients, but all prepared correctly.  Staff was very nice, friendly and attentive.", "rating": 4, "date": "2007-10-28"}], "dayboat scallops provençale": [{"excerpts": ["Followed it with the cassoulet (over 13,000 days old and still going strong!), rack of lamb, and Dayboat Scallops Provençale.  ", "Everything was flavored perfectly and not a bit was left at the end of our meal.  ", "The serving sizes were very generous, and even though we were stuffed we had to try the creme brulee "], "author": "Carolyn S.", "review": "Was at the restaurant Friday night and it was wonderful.  I spent the summer in Paris 2 years ago and this gem of a restaurant took me right back.  It's decor is authentic, food delicious, and service wonderful.\n\nSat on the bar side with a group of 4.  The bar was full and only a few tables free but I did not feel crowded as some reviewers have mentioned.  In fact, this is just like restaurants on Ile St-Louis where I stayed and added to the authenticity.\n\nThe food was amazing.  We started with escargot, duck rillettes, and herb crusted goat cheese.  Followed it with the cassoulet (over 13,000 days old and still going strong!), rack of lamb, and Dayboat Scallops Provençale.  Everything was flavored perfectly and not a bit was left at the end of our meal.  The serving sizes were very generous, and even though we were stuffed we had to try the creme brulee and we were so glad we did.\n\nServers were great.  Fast, efficient, attentive and generous with the wine pouring.   Also, you can tell that regulars come to this place time and time again.  We heard servers greet people by name and ask after family members.  This is the kind of place you want to come back to time and time again.  I know I will.  Especially for that lamb and ratatouille.", "rating": 5, "date": "2013-03-09"}], "beef bourguignon": [{"excerpts": ["Where else could you get Escargot, Beef Bourguignon, and a Chocolate Mousse for only forty dollars total? ", "As for my second course I debated between the Beef Bourguignon and the Cassoulet. ", "Against my better judgement I went with the Cassoulet, with its white bean stew topped with duck confit, shreds of lamb and pork and served with one half of a Toulouse sausage. ", "I felt that the dish, although well prepared, was filled with too many beans for my liking and not enough meat protein. ", "Thankfully, there was plenty of baguette bread to go with my bean stew because I was in serious search for a starch to go with my main course and the beans weren't doing it. ", "The dish does go well with the Cotes du Rhone red wine that I was able to purchase at the discount price of 5 dollars thanks to it being Restaurant Week. ", "My dining companion got the Petrale Sole topped with lemon-butter-caper sauce, and served with cauliflower gratin and fingerling potatoes. ", "She loved it and I had a small bite and loved how lightly pan fried the fish was. ", "To finish off our meal, we each ordered both dessert options I liked the Mousse au Chocolat which was a chocolate mousse topped with both a creme chantilly and two rolled gaufrette pastries. ", "But the real delight was the Souffle Glacee which was a chilled lemon souffle and berry compote. "], "author": "Jason F.", "review": "A solid place for French food in the heart of San Francisco's downtown. I have seen the outside Le Central for decades now driving on Bush Street heading back to the East Bay in my car but this was the first time I had walked from the Montgomery Street BART station and eaten at Le Central and it was all thanks to San Francisco Restaurant Week. A friend and I wanted to meet up to commemorate another great year and so we looked on the website to see what affordable options that were out there that sounded good but also didn't break our wallets and we found a really solid option with Le Central.   \n\nUpon entry I noticed that Le Central could resemble a local watering hole in any American city or small local restaurant in Paris. It was cozy and warm without coming across as too pretentious. There was a huge long bar on one side of a double sided restaurant with small two top tables and booths abound. As for their menu they seem to have a number of dishes that best represent the best of what Parisian flair has to offer. Their San Francisco Restaurant Week menu best exemplifies some of the dishes they serve at a fairly decent price point. Where else could you get Escargot, Beef Bourguignon, and a Chocolate Mousse for only forty dollars total? No where in San Francisco outside of that ten day period every January.\n\nSince this was SF Restaurant Week and we were here to take advantage of the meal deal they were offering up I had to go with the traditional Onion Soup Gratinee with a boatload of Gruyere cheese and herb croutons this starter was just the way I like my French Onion Soup, gooey and cheesy.  As for my second course I debated between the Beef Bourguignon and the Cassoulet. Against my better judgement I went with the Cassoulet, with its white bean stew topped with duck confit, shreds of lamb and pork and served with one half of a Toulouse sausage. I felt that the dish, although well prepared, was filled with too many beans for my liking and not enough meat protein. Thankfully, there was plenty of baguette bread to go with my bean stew because I was in serious search for a starch to go with my main course and the beans weren't doing it. The dish does go well with the Cotes du Rhone red wine that I was able to purchase at the discount price of 5 dollars thanks to it being Restaurant Week. My dining companion got the Petrale Sole topped with lemon-butter-caper sauce, and served with cauliflower gratin and fingerling potatoes. She loved it and I had a small bite and loved how lightly pan fried the fish was. To finish off our meal, we each ordered both dessert options I liked the Mousse au Chocolat which was a chocolate mousse topped with both a creme chantilly and two rolled gaufrette pastries. But the real delight was the Souffle Glacee which was a chilled lemon souffle and berry compote. It was a light dessert without being overly sweet.\n\nI liked Le Central which of course is centrally located in between the Financial District and the entryway to Chinatown. An uncomplicated French Bistro the middle of the chaotic hustle and bustle of the city. Their menu deals for San Francisco Restaurant Week were solid for the price and hope they got more business than usual because of it. If I'm ever in the area again, I'll be sure to stop by and sample some of their other dishes on their regular menu, all of which sounded rather delicious. Merci Le Central!", "rating": 3, "date": "2017-02-11"}, {"excerpts": ["I had the beef bourguignon which was very good, especially the mashed potato. ", "The serving seemed slightly on the smaller side "], "author": "Teegan L.", "review": "We went to La Central during SF Restaurant Week and had the prix fixe menu. \n\nThe food was mostly delicious, but the restaurant was crowded. We both had the onion soup and it was fantastic, would definitely recommend. \n\nMy husband had the cassolette and wasn't blown away by it, he found it a little bland. I had the beef bourguignon which was very good, especially the mashed potato. The serving seemed slightly on the smaller side but I ended up not being able to eat it all. \n\nFor dessert Husdude had the Soufflé which was excellent and I had the chocolate mousse which was very good but I don't think there's actually that much difference between a decent chocolate mousse and a really good one so I wished I'd picked the Soufflé instead. \n\nThe bar was out of one of the ingredients for the cocktail I wanted to order and the cocktail menu was far from extensive so that was disappointing. I later heard the waiter tell someone else that they had a full bar but when I'd tried to ask for something off menu similar to what I'd wanted the waiter was entirely unhelpful. \n\nThe tables were extremely close together so if you're looking for an intimate restaurant for a date this is not really appropriate, unless you're ok with being intimate with the folks at the tables on either side of you as well! Overall this is a decent restaurant with good food but you definitely come for the food rather than the ambiance and don't feel inclined to linger.", "rating": 3, "date": "2017-02-12"}, {"excerpts": ["but so was the Beef Bourguignon!  ", "the appetizers "], "author": "William T.", "review": "wife and I went to set menu as part of restaurant week.  as so many others have said, the Cassoulet was to die for but so was the Beef Bourguignon!  the appetizers Onion Soup Gratinée was OK but Escargots de Bourgogne was over the top... and the Souffle Glacee was exceptional", "rating": 4, "date": "2017-01-19"}, {"excerpts": ["My bf got the beef bourguignon and it was also good (I was practically picking off his plate). ", "As recommended my our waitress, we got the chocolate mousse for dessert. ", "The presentation could have been a little fancier (kind of looked like a scoop of poop on a plate), but it satisfied. ", "Still wish I got the tiramisu or creme caramel instead though. ", "Aside from that, the staff was very nice and accommodating. "], "author": "Stephanie Joyce D.", "review": "This restaurant is stuck in time.\n\nIt's a shame because the food is actually pretty good. The french onion soup is solid with it's ooey gooey gruyere. I ordered the Rack of Lamb Persillé and was delighted that they gave me such a hefty portion of ribs (a full rack vs. usually getting a half rack at other French restaurants for the same price). They were succulently medium rare and went great with the creamy potato gratin. My bf got the beef bourguignon and it was also good (I was practically picking off his plate). As recommended my our waitress, we got the chocolate mousse for dessert. The presentation could have been a little fancier (kind of looked like a scoop of poop on a plate), but it satisfied. Still wish I got the tiramisu or creme caramel instead though. Aside from that, the staff was very nice and accommodating. We called ahead and got there barely before closing, and they still waited for us and were very attentive.\n\nBack to my first remark... this place needs some serious renovation. I didn't look at any pictures of the location beforehand and ate here because the menu looked promising, but I was REALLY disappointed that it looked like a diner inside. Even though I was very satisfied with my meal, I was conflicted because the interior lacked ambience and just didn't match my expectations. I was even feeling chilly! I don't think I will return because there are other French restaurants at a similar price point that are simply nicer and more intimate inside. Sorry.", "rating": 2, "date": "2016-02-22"}, {"excerpts": ["sausage or porcetta \nBeef bourguignon--", "didn't try, by my dining companion ", "said it was very good, and cleaned his plate!\n", "Dessert: Souffle glace & chocolate mousse both excellent ways to finish off the meal. "], "author": "Noelle L.", "review": "Solid three stars. (Service 3/5, Food 4/5, and Ambiance 2.5/5) and I came here for dinner Saturday at 8pm for Restaurant Week.  I picked this restaurant over the others because the prix fixe menu actually offered their signature dishes at a good deal, which is not the case for all restaurants that participate. I'm not sure why the reviews are so bad on service. We came 15 minutes before our reservation, and was seated right away. We actually weren't too fond of the spot, and the hostess was kind enough to accommodate by moving us to another table. Our server was also very sweet. He tended to us, but not in an annoying way. I took some points off because he kept mixing up our dishes as he served them and only gave one of us water, when we both had asked. The comments regarding how dated the restaurant is are pretty accurate. It's not terrible, but the old lighting fixtures and dated surroundings make you think what the kitchen is like. I'm sure it needs a general face lift.\n\nFood was good.  We got the following:\nEscargot--very tender and seasoned well. perhaps a little salty, but great for dipping bread\nFrench onion soup--I honestly don't know what good French onion soup is supposed to taste like, but just know...they use a very pungent cheese on the top, so if the smell hits you when you walk in the door...that's what it is.\nDuck cassoulet--stand out dish in my opinion. Flavorful and rich. For those of you who don't know a cassoulet is like French white bean chili with poultry and something fatty like sausage or porcetta \nBeef bourguignon--didn't try, by my dining companion said it was very good, and cleaned his plate!\nDessert: Souffle glace & chocolate mousse both excellent ways to finish off the meal. One refreshing and light and the other rich and creamy.\n\nOverall I'd say try Le Central for a taste of French food. (Nothing would compare to being in Paris...so I don't know why some reviewers bother with that comparison.) It's better if you can snag a deal like happy hour or Restaurant Week.", "rating": 3, "date": "2017-01-30"}, {"excerpts": ["Beef Bourguignon - Flavorful!\n\n"], "author": "Christine T.", "review": "Absolue fantastique !!\n\nThis is the ideal spot to celebrate Bastille Day (July 14th). It's all about traditional, heavy country style French cuisine. (Not the modern light fair.) It's frequented by old money personalities dressed to impress. I'm told Willie Brown has a permanent table at the entrance of the restaurant. \n\nWe made last minute dinner reservations through OpenTable in honor of Bastille Day. The moment I walked in from the streets of downtown San Francisco, I was transformed to Aix en Provence, France. Once we arrived, they greeted us and seated us immediately. Everyone was dressed in French berets and patriotic neckties. The two small dining rooms and bar area were serenaded by a talented accordion player with traditional French tunes. At times, the musician would hum along with his music and customers hummed or sang along as well.\n\nThis is a small restaurant with lots of tables close to each other so we made new friends with revelers on both sides of us. Every time someone got up, the servers were right there to shift the table to help you in and out. It felt just like a packed family dinner table. The entire dining room felt like someone's home. Great service throughout our dinner. \n\nInstead of the regular dinner menu, a special Bastille Day menu was offered. It included several of their popular dishes. We couldn't resist the aromas coming from the kitchen.\n\nAppetizers:\nFrench Onion Soup - hmmm....skip next time.\nEscargots - Great!\n\nEntree:\nCassoulet - Delicious!  (if you've never had it, it has white beans, sausage and duck served in a little iron pot cassoulet.)\nBeef Bourguignon - Flavorful!\n\nDessert:\nLemon Souffle - Light and tart! Absolute must order!\n\nA wonderful neighborhood gem right down the street from the French Consulate. It's a must visit if you live in SF or just visiting. It's a small and very popular restaurant so reservations are highly recommended.", "rating": 4, "date": "2010-07-15"}, {"excerpts": ["I ordered the goat cheese salad, beef bourguignon, and the berry crumble. ", "All the dishes I ordered were pretty delicious. ", "However, the service was unacceptable. ", "Since we had five people in the group, one of my friends was facing an empty seat. ", "The waiter opened a bottle of wine for the two customers sitting next to us at the empty seat. ", "He didn't even speak to my friend before doing that, but just pretended my friend was not existed. ", "AND, there was a completely empty table literally two steps away from our table. ", "I will NOT re-visit due to the poor customer service."], "author": "Sara Z.", "review": "Four stars for the food and two stars for service!\n\nI went there with four other friends to try out their food for dine about town. I ordered the goat cheese salad, beef bourguignon, and the berry crumble. All the dishes I ordered were pretty delicious. However, the service was unacceptable. Since we had five people in the group, one of my friends was facing an empty seat. The waiter opened a bottle of wine for the two customers sitting next to us at the empty seat. He didn't even speak to my friend before doing that, but just pretended my friend was not existed. AND, there was a completely empty table literally two steps away from our table. I will NOT re-visit due to the poor customer service.", "rating": 3, "date": "2014-06-05"}, {"excerpts": ["The Beef Bourguignon was a perfect marriage of tender beef and red wine. ", "The carrots were soft yet not overdone and it was a very comforting dish for the slighty chilly northern California evening. ", "Things continued to get better with the creme brulee. ", "I'm not much for sweets but this one was done perfectly. ", "I'm usually sort of unimpressed by creme brulee, by this one was perfectly creamy and not overpowering with sweetness. ", "The smooth vanilla texture went along well with the tasty caramelized sugar. ", "Admittedly I am a sucker for caramel."], "author": "Zorin D.", "review": "I did some searching and ended up having dinner at Le Central Bistro which was just a short walk from my hotel. I looked through the menu for a short period of time before deciding on the crab cakes for my first course. The presentation was phenomenal. I just wish the flavours were equally as stunning. The burr blanc was kind of mediocre, though I must admit the crab cake was very meaty and a good portion of crab. Everything just seemed slightly under-seasoned. Things picked up with the second course. The Beef Bourguignon was a perfect marriage of tender beef and red wine. The carrots were soft yet not overdone and it was a very comforting dish for the slighty chilly northern California evening. Things continued to get better with the creme brulee. I'm not much for sweets but this one was done perfectly. I'm usually sort of unimpressed by creme brulee, by this one was perfectly creamy and not overpowering with sweetness. The smooth vanilla texture went along well with the tasty caramelized sugar. Admittedly I am a sucker for caramel.", "rating": 3, "date": "2013-03-18"}, {"excerpts": ["I tried the herb crusted goat cheese salad with walnuts, the beef Bourguignon, and the berry tart with Creme fraiche for dessert. ", "I also tried a bit of M's cassoulet, a white bean stew with slow cooked lamb and duck. ", "The salad was so so, not well presented and the goat cheese came in one big block. ", "The entrees tasted like standard French comfort food; I half expected the theme song from ratatouille to start playing in the background. ", "I could only finish half of my beef as it was very filling. ", "I think the cassoulet is better than the beef because the meat is more tender and the white bean stew is quite savory. ", "Dessert was the best part, though not something I'd specifically come back here for. ", "Service was meh. ", "Overall, convenient location on Bush Street but probably will not be back."], "author": "Joyce H.", "review": "Dine about town 2013, looked for a place close to Jonny foleys dueling piano bar for a friends bday right after. Parking was easy, managed to snag a spot right across the street. The decor/ambiance was ok; if I had to describe it all in one word, \"musty\" comes to mind. I tried the herb crusted goat cheese salad with walnuts, the beef Bourguignon, and the berry tart with Creme fraiche for dessert. I also tried a bit of M's cassoulet, a white bean stew with slow cooked lamb and duck. The salad was so so, not well presented and the goat cheese came in one big block. The entrees tasted like standard French comfort food; I half expected the theme song from ratatouille to start playing in the background. I could only finish half of my beef as it was very filling. I think the cassoulet is better than the beef because the meat is more tender and the white bean stew is quite savory. Dessert was the best part, though not something I'd specifically come back here for. Service was meh. Overall, convenient location on Bush Street but probably will not be back.", "rating": 2, "date": "2013-01-21"}], "seared salmon béarnaise": [], "roasted half chicken au jus": [], "le central cheeseburger": [], "filet mignon au poivre": [{"excerpts": ["My friend had already decided months in advance she was having their popular chicken pommes frites (side of super-garlicky aioli, by request) and I had the filet mignon au poivre. ", "It was the best piece of beef I'd had in years, so tender and buttery ", "-and ", "it was perfectly cooked (rare). "], "author": "Jennifer O.", "review": "I love a restaurant where the owner greets you warmly as does the wait staff like you're old friends. \n\nThat wouldn't be enough, however, to garner the consistently great reviews and loyal customers that Le Central has and deserves unless they also served delicious, often sophisticated, bistro fare. \n\nThey do -and they do it so well..\n\nToday, I took my BFF for a belated birthday lunch. We'd actually planned this lunch for 8 months at her very specific request - based on my rave reviews - to celebrate her birthday at Le Central.\n\nWe grazed through the menu so she could sample their classic fare of the onion tart (so buttery and delicious), the crab cake (pure crab meat, plated on a beurre blanc sauce) and then for me, a difficult choice of what to choose for an entree. \n\nMy friend had already decided months in advance she was having their popular chicken pommes frites (side of super-garlicky aioli, by request) and I had the filet mignon au poivre. It was the best piece of beef I'd had in years, so tender and buttery -and it was perfectly cooked (rare). Despite its generous portion, I have to admit I did eat every bite.\n\nFrequent Le Central customer Willie Brown was having lunch there with Ron Dellums and Wilkes Bashford generously let me intrude on a talk of current movies (I overheard him saying how much he loved the movie, \"The King's Speech.\")\n\nEven though he really doesn't know me, but has spotted me from time to time at Le Central, Mr. Bashford gave me a gracious good-bye and good wishes for the New Year. Le Central engenders that unpretentious and friendly atmosphere.\n\nAnd the good food and service put it on my \"Top 5\" places to dine in the City. \n\nIf you haven't gone there yet, put it on your New Year's resolution list.", "rating": 5, "date": "2011-01-06"}, {"excerpts": ["We had the Filet Mignon au Poivre. ", "It was the best we both have ever tasted. ", "Simply perfection melting in your mouth. ", "I had a Sea Bass ", "I believe, but I kept eating from my husband's plate instead. "], "author": "Brenda S.", "review": "We spent the past Valentine's Day here. It was good!\n\nIt took longer than we thought to get there so I called them to let them know we would be late for our reservation. They appreciated the call they said. A half hour later, we walked in and they accommodated us with no problem. Very nice of them.\n\nThe space is very tight. However, it seemed to work out ok. You get to know fellow diners and what they are having.\n\nIt was a pre fixed menu for the evening. Having been to France the year before we were eager to try the American version of the foods we loved. \n\nThe Escargots de Bourgogne was succulent. I could not stop dipping my baguette into the left over sauce of garlic, herbs and butter. \n\nThe French onion soup was exactly what we had hoped for with the abundance of gruyere cheese and savory broth.\n\nWe had the Filet Mignon au Poivre. It was the best we both have ever tasted. Simply perfection melting in your mouth. I had a Sea Bass I believe, but I kept eating from my husband's plate instead. YUM!\n\nOur experience with the Crème Brulee was not as good. We found it to have an egg-like consistency rather than a smooth texture.\n\nThe wait staff was helpful and courteous. I think we were expecting the waiter to clean the crumbs from the table with a crumb sweeper. But only because we experienced that before in other French restaurants\n\nI must give applause to our waiter (which I forgot his name, blonde gentleman).\n\nWe told him we were on our way to the symphony and he advised us on a shortcut to get us there on time. \n\nWe made it! Thank you Sir. :)\n\nAnd thank you all for a lovely Valentine evening for my husband and I.\nCheers!", "rating": 4, "date": "2014-02-21"}, {"excerpts": ["*Rack of lamb-good and cooked perfectly\n*Filet Mignon Au Poivre-delicious and cooked a perfect medium!\n", "*", "Pomme Frittes-fresh of the fryer..yum!\n", "*scallop entree-yummo\n", "*"], "author": "Betty C.", "review": "i don't know why we decided to come here for New Year's Eve dinner but so glad that we did.  We probably passed by this place a gazillion times in Union Square without ever noticing it! This was one of the only restaurants that had a reservation for 8pm available for a table of 7 so off we went.  \n\nUpon entering, the place is really charming. In addition to the NYE decor, I like the exposed brick wall, the two dining rooms separated by the bar, and the cozy bistro feeling of the restaurant (it's the oldest French bistro in the city!). Our hostess was really friendly and seated us to our table even though only 1/3 of our party was there. Our waiter was the no nonsense efficient but nice kind of guys-kinda reminded us of Chris Farley.\n\nReviews from the peanut gallery:\n\n*Cassoulet-pretty good, heavy stew if you are in the mood\n*Rack of lamb-good and cooked perfectly\n*Filet Mignon Au Poivre-delicious and cooked a perfect medium!\n*Pomme Frittes-fresh of the fryer..yum!\n*scallop entree-yummo\n*Cappucinos-just the way I like it and the perfect way to end the meal.\n\nI was really worried that this place would be a disappointment but I think everyone enjoyed their meal (whew). The portions are also perfect, not too big, not too small, just right!", "rating": 4, "date": "2011-01-02"}], "onion tart": [{"excerpts": ["Bring back the onion tart!"], "author": "Earl P.", "review": "What a shame. The chef retired from this great bistro and now whoever took over for him has completely screwed it up. They've lost 2/3 of the menu items, half the staff, and the poor waiters as well as the other owner are completely overworked. I was told they hired a \"consultant\" who told them to rework the place. What a nightmare. This bistro has been the go-to spot for power brokers and those in the know for years. But you could also go have a nice quiet romantic dinner there with your wife, with great service and reliable very good food. If some newbie thinks they are going to turn it into a millenial hotspot they are idiots. It was never that kind of place and never will be. This change will just drive it into the ground. They even changed their famous roast chicken. WTF??? Bring back the onion tart!", "rating": 2, "date": "2017-09-22"}, {"excerpts": ["Doesn't appear to be cook to order\nSteak tartare was really basic while onion tart with too much onions but taste good."], "author": "Claire C.", "review": "We walked in for week diner. Not terribly authentic French. Doesn't appear to be cook to order\nSteak tartare was really basic while onion tart with too much onions but taste good.", "rating": 2, "date": "2014-07-22"}, {"excerpts": ["We grazed through the menu so she could sample their classic fare of the onion tart (so buttery and delicious), the crab cake (pure crab meat, plated on a beurre blanc sauce) and then for me, a difficult choice of what to choose for an entree. \n\n"], "author": "Jennifer O.", "review": "I love a restaurant where the owner greets you warmly as does the wait staff like you're old friends. \n\nThat wouldn't be enough, however, to garner the consistently great reviews and loyal customers that Le Central has and deserves unless they also served delicious, often sophisticated, bistro fare. \n\nThey do -and they do it so well..\n\nToday, I took my BFF for a belated birthday lunch. We'd actually planned this lunch for 8 months at her very specific request - based on my rave reviews - to celebrate her birthday at Le Central.\n\nWe grazed through the menu so she could sample their classic fare of the onion tart (so buttery and delicious), the crab cake (pure crab meat, plated on a beurre blanc sauce) and then for me, a difficult choice of what to choose for an entree. \n\nMy friend had already decided months in advance she was having their popular chicken pommes frites (side of super-garlicky aioli, by request) and I had the filet mignon au poivre. It was the best piece of beef I'd had in years, so tender and buttery -and it was perfectly cooked (rare). Despite its generous portion, I have to admit I did eat every bite.\n\nFrequent Le Central customer Willie Brown was having lunch there with Ron Dellums and Wilkes Bashford generously let me intrude on a talk of current movies (I overheard him saying how much he loved the movie, \"The King's Speech.\")\n\nEven though he really doesn't know me, but has spotted me from time to time at Le Central, Mr. Bashford gave me a gracious good-bye and good wishes for the New Year. Le Central engenders that unpretentious and friendly atmosphere.\n\nAnd the good food and service put it on my \"Top 5\" places to dine in the City. \n\nIf you haven't gone there yet, put it on your New Year's resolution list.", "rating": 5, "date": "2011-01-06"}, {"excerpts": ["Had the Onion Tart (it was lunch) and it was good. ", "Next time I will get the long-time-cooking stew."], "author": "Brian S.", "review": "Nice upscale restaurant. Had the Onion Tart (it was lunch) and it was good. Next time I will get the long-time-cooking stew.", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["I had the onion tart as well- ", "My dining partner had the duck rillettes with aspic yum yum yum yum and the escargot and the cassoulet- ", "all SUPER great.  ", "He did not really eat all of it himself, for I, of course ate some too.  "], "author": "Lisa M.", "review": "Went here again last evening. Yum yum yum yum.  I had the special.  It was brisket with a horseradish sauce, potatoes and spinach.  It was PERFECTLY done brisket and it exceeded my expectations.  I had the onion tart as well- My dining partner had the duck rillettes with aspic yum yum yum yum and the escargot and the cassoulet- all SUPER great.  He did not really eat all of it himself, for I, of course ate some too.  Everything was delicious!!!\n\nI love this place, can't you tell?  It is a down and dirty French restaurant.  The cassoulet has been on the stove for 13,000 some plus days and a few months thus far.  The service is so nice and unpretentious, and it is not over priced.  We got to sit at a table by the window and talk and enjoy ourselves for a few hours.  I hope this place stays open forever!", "rating": 5, "date": "2011-04-15"}, {"excerpts": ["High points: the onion tart, the cassoulet, and the grilled salmon. ", "We look forward to returning later in the summer."], "author": "Mary P.", "review": "We stayed at Union Square  this week, and walked in the general direction of Belden Alley, thinking we'd end up there. We stopped to look at menus at Cafe De La Presse, then Le Central, and were pleasantly surprised to find that Le Central is not as expensive as I'd always assumed.\n\nWe had a quiet table on Tuesday night, excellent service, and everything we ordered was fantastic. The atmosphere was intimate and comfortably elegant. \n\nThe maitre'd who seated us, who we were with for all of one minute, impressed us both with his attentiveness to the arrangement on our table after we were seated, bringing the salt, pepper and small floral arrangement neatly to the far corner opposite our seats. A small but elegant gesture. \n\nOur waiter, Scott, was friendly, attentive, and very knowledgeable about the menu, answering questions about preparation. He  arranged for a salad we were sharing to be served on two separate plates, something both of us appreciated. Both Scott and the busboy knew how to serve and remove plates properly, something that we've seen plenty of clumsiness around lately at other restaurants. \n\nEverything (table, food, service, vibe) was impeccable yet natural and relaxed, not uptight at all. High points: the onion tart, the cassoulet, and the grilled salmon. We look forward to returning later in the summer.", "rating": 5, "date": "2011-06-23"}, {"excerpts": ["The standout dishes we had included a kickin' onion tart and a rich onion soup that any French grandma would be proud of.  "], "author": "Gracie-C Y.", "review": "I was fairly suspicious of Le Central before going.\nAfter all, this place has been around a long time and has quite a bit of history... good and bad.\n\nLe Central's pretty proud of some of their more high-profile clients:  Wilkes Bashford, Herb Caen, and who could forget, former mayor \"Slick\" Willie Brown.  If you go at the right time, you may even see Slick Willie trying to proposition some nubile blonde in the corner, a definite Kodak moment.\n\nAnyway, wifey and I pass by this place all the time and finally decided to step in to see what all the hubbub's about.\n\nThe maitre'd was delightful and accomodated our last-minute seating request without hesitation.  We sat in Herb Caen's table right next to the window so we could make fun of the tourists walking by...\n\nThe menu consists of straightforward and unpretentious French bistro fare.  Nothing wild or fancy, just solid classics.  Sometimes classic dishes are the best way to gauge the skill of the kitchen.\n\nThe standout dishes we had included a kickin' onion tart and a rich onion soup that any French grandma would be proud of.  Wifey's prawn risotto was nothing to sneer at either.\n\nThe staff was efficient and unobtrosive and prices were more than reasonable.\n\nMy assessment, great food and a fine experience.\nI can see why Slick Willie brings the girlies here.", "rating": 4, "date": "2008-11-20"}, {"excerpts": ["The onion tart was a mass of gooey butter and flour with no texture whatsoever. ", "The cassoulet was overcooked with soggy flavorless meat and the chicken frites arrived raw. ", "After sending back the chicken it was returned burned to a rock-like texture. ", "We also had to send the wine back as well and had everyone come over to our table to give us dirty looks.  ", "The place was empty and we should have taken the hint. ", "My friend grew up in France and I am a caterer.  ", "Stay away and find someplace good to eat."], "author": "wwmb b.", "review": "I can't say one good thing about this restaurant and can't for the life of me figure out what others have liked. The host was morose. The unintelligible manager was confrontational and the waitress was surly. The onion tart was a mass of gooey butter and flour with no texture whatsoever. The cassoulet was overcooked with soggy flavorless meat and the chicken frites arrived raw. After sending back the chicken it was returned burned to a rock-like texture. We also had to send the wine back as well and had everyone come over to our table to give us dirty looks.  The place was empty and we should have taken the hint. My friend grew up in France and I am a caterer.  Stay away and find someplace good to eat.", "rating": 1, "date": "2010-08-07"}], "le central cassoulet": [], "pommes purée": [], "haricots verts": [], "sautéed mushrooms": [], "brussels sprouts": []}