{"idaho ham sandwich": [], "roast beef sandwich": [{"excerpts": ["But that hasn't stopped me from ordering their roast beef sandwich.  "], "author": "Dwigt S.", "review": "\"I can't eat beef. I have a degenerative problem with my intestinal lining and beef really gives me gas.\"  But that hasn't stopped me from ordering their roast beef sandwich.  The meat is slightly pink and its juices soak right through their freshly-baked sourdough bread.  \n\nBad gas is a small price to pay for a bite of heaven.\n\n(I also like the Basil Cream Chicken, the Tuna, and the Turkey Pastrami.)", "rating": 4, "date": "2007-03-19"}], "roast turkey sandwich": [], "the sourdough sandwich": [], "russian hill sandwich": [], "pastrami sandwich": [{"excerpts": ["I ended up ordering #15 Turkey and pastrami sandwich with everything on it because I love everything. ", "Took it to-go as a meal,  with chips and soda.  ", "It was exactly what I'd hope for.  ", "The sourdough was perfect,  crunchy outside and tender inside. ", "The sandwich itself was huge...kinda like a tiny baby.  ", "You will not be disappointed. ", "Come hungry or get half a sandwich."], "author": "Dax P.", "review": "This place rocks. Located near the Tenderloin,  is this hole in the wall sandwich spot you'd miss if you weren't looking. The talk is they have the best sourdough bread in town.  I had to give it a try. The space is small with a few indoor tables and a walk up counter to order. Situated on the back wall is the menu.  I salivated as I read each sandwich item. I hate menus like this because everything looked so good. I ended up ordering #15 Turkey and pastrami sandwich with everything on it because I love everything. Took it to-go as a meal,  with chips and soda.  It was exactly what I'd hope for.  The sourdough was perfect,  crunchy outside and tender inside. The sandwich itself was huge...kinda like a tiny baby.  You will not be disappointed. Come hungry or get half a sandwich.", "rating": 5, "date": "2016-09-09"}, {"excerpts": ["My friend picked me up at hot pastrami sandwich.\n\n"], "author": "Susy C.", "review": "How is it that I have been working in this area since 2007 and I haven't tried Le Petit's!??! \nGOODNESS GRACIOUS I HAVE BEEN MISSING OUT!!\n\nMy friend picked me up at hot pastrami sandwich.\n\nOMFG.\n\nMy very first thought after that first bite:\n\nDAMN. This is really good bread. DAMN this pastrami is tasty.  DAM DAM DAM IT'S SO GOOD. \nThen I find out the sourdough bread is made in house. Wow. That's a lot of love. My co-workers took a bite and loved it as well. One of them doesn't even like pastrami but she really liked the pastrami from here. \n\n1/2 of the full sized sandwich is huge. It got me pretty full. I decided to save my other half to eat at the Warriors vs Trailblazers game.\n\nFreaking Oracle Arena security threw away my sandwich.\nI have been lamenting over the loss of that delicious sandwich.\nI am still sad. So sad that I have to go to LePetit myself and grab another hot pastrami.", "rating": 5, "date": "2012-01-26"}, {"excerpts": ["My personal favorite is a hot pastrami sandwich on their oh-so-good sourdough bread, a side salad, and a drink. ", "Mmmm...a great place to grab lunch since the Hastings Law Cafe (now known as the Hastings Stand) really gets old. ", "Just watch out for pooping people on your walk down Golden Gate Ave."], "author": "Dalia K.", "review": "Their lunch special rocks. My personal favorite is a hot pastrami sandwich on their oh-so-good sourdough bread, a side salad, and a drink. Mmmm...a great place to grab lunch since the Hastings Law Cafe (now known as the Hastings Stand) really gets old. Just watch out for pooping people on your walk down Golden Gate Ave.", "rating": 4, "date": "2006-07-06"}], "reuben sandwich": [{"excerpts": ["Reuben sandwich is not good. ", "Others look good. ", "Meat was stacked not folded. ", "Overall would try again"], "author": "Silver T.", "review": "Inexpensive food. Nice sour dough bread but it's the only bread. Reuben sandwich is not good. Others look good. Meat was stacked not folded. Overall would try again", "rating": 3, "date": "2016-09-04"}], "salami sandwich": [], "golden gate sandwich": [], "cheese sandwich": [{"excerpts": ["I had the # 11 cheese sandwich and it was terrific!  ", "Not too cheesy! ", "Great service too ", "and my boyfriend adds great coffee!"], "author": "Sandra P.", "review": "I love it here!! Excellent service and really nice people!! I had the # 11 cheese sandwich and it was terrific!  Not too cheesy! Great service too and my boyfriend adds great coffee!", "rating": 4, "date": "2014-06-23"}], "liverwurst sandwich": [], "italian bologna sandwich": [], "pastrami and turkey sandwich": [], "corned beef and turkey sandwich": [], "idaho ham and roast beef sandwich": [], "vegetarian sandwich": [{"excerpts": ["Last week, a friend  brought me a vegetarian sandwich from here. ", "Gotta say, their vegetarian option has not improved--it was worse. ", "Seriously, if you are vegetarian, go to Morty's across the street."], "author": "Wan T.", "review": "I had not been to this place in years. Last week, a friend  brought me a vegetarian sandwich from here. Gotta say, their vegetarian option has not improved--it was worse. Seriously, if you are vegetarian, go to Morty's across the street.", "rating": 1, "date": "2014-04-09"}, {"excerpts": ["The vegetarian sandwich was big for the price; however, the bread was not fresh and the vegetables were ok. ", "I will probably try out other sandwich places nearby before trying any other sandwich here."], "author": "Sid P.", "review": "I went there for a quick lunch and to try out this place. However, I was disappointed with the food. The vegetarian sandwich was big for the price; however, the bread was not fresh and the vegetables were ok. I will probably try out other sandwich places nearby before trying any other sandwich here.", "rating": 2, "date": "2013-09-23"}], "north beach sandwich": [], "turkey pastrami sandwich": [], "chicken salad sandwich": [{"excerpts": ["The Chicken Salad Sandwich is one of my go-to lunch choices close to work. ", "They fresh bake their bread and all the ingredients are fresh and delicious. ", "Plus every 10 sandwiches you get a free one!"], "author": "Rebecca D.", "review": "Such a wonderful TL sandwich place with great bread, great service, and great prices. The Chicken Salad Sandwich is one of my go-to lunch choices close to work. They fresh bake their bread and all the ingredients are fresh and delicious. Plus every 10 sandwiches you get a free one!", "rating": 5, "date": "2012-08-14"}, {"excerpts": ["Today I had the chicken salad sandwich which was very filling and delicious! ", "They arent shady with the amount of meat they put in your sandwich which makes it such a good deal! ", "The employees here are really nice!"], "author": "M W.", "review": "Le Petitt's Kitchen has some really good sourdough bread! Today I had the chicken salad sandwich which was very filling and delicious! They arent shady with the amount of meat they put in your sandwich which makes it such a good deal! The employees here are really nice!", "rating": 4, "date": "2009-09-15"}, {"excerpts": ["Outside of the chicken salad sandwich and the fact that their bread is freshly made ... the place is just a regular sandwich place.  ", "They do get bonus points ", "b/c the sandwiches are freshly made to order and their freshly baked bread is worthwhile and makes it stand out from most the joints in the TL.  ", "Oh, and the service is always friendly ... so that is always nice.  ", "Oh, be sure to collect your sandwich points!  ", "I never did and probably could've gotten a free sandwich over the three years I spent hopping in and out of this place.  ", "Oh, just one more note ... ", "the place is TINY ... ", "you'll be eating likethisclose to other people, so it may be best if you take your food to go."], "author": "Roni R.", "review": "This local joint is in the TL ... right by my law school ... so I often ran over to this place to grab a quick bite.  Outside of the chicken salad sandwich and the fact that their bread is freshly made ... the place is just a regular sandwich place.  They do get bonus points b/c the sandwiches are freshly made to order and their freshly baked bread is worthwhile and makes it stand out from most the joints in the TL.  Oh, and the service is always friendly ... so that is always nice.  Oh, be sure to collect your sandwich points!  I never did and probably could've gotten a free sandwich over the three years I spent hopping in and out of this place.  Oh, just one more note ... the place is TINY ... you'll be eating likethisclose to other people, so it may be best if you take your food to go.", "rating": 4, "date": "2008-03-11"}, {"excerpts": ["I just had a delicious Chicken Salad Sandwich.  ", "Very good service and its nice that they throw in a little bite-sized candy as a treat.  ", "My sandwich was made very fast even before I could finish going through the rest of the menu.  ", "The sandwich was good and the sourdough bread that is often spoken of was good too.  ", "Even though I am not too big of a sourdough bread fan, I enjoyed it.  ", "One of the reasons I would definitely come back is because I am so close.  ", "Otherwise I probably wouldn't go out of my way for it.  ", "Good stuff though, ", "but I am just not quite hooked yet."], "author": "Bert N.", "review": "I just had a delicious Chicken Salad Sandwich.  Very good service and its nice that they throw in a little bite-sized candy as a treat.  My sandwich was made very fast even before I could finish going through the rest of the menu.  The sandwich was good and the sourdough bread that is often spoken of was good too.  Even though I am not too big of a sourdough bread fan, I enjoyed it.  One of the reasons I would definitely come back is because I am so close.  Otherwise I probably wouldn't go out of my way for it.  Good stuff though, but I am just not quite hooked yet.", "rating": 3, "date": "2009-07-13"}], "chicken cordon bleu sandwich": [], "dusty dog sandwich": [], "basil cream chicken sandwich": [{"excerpts": ["I got a basil cream chicken sandwich and the tangy basil cream was outstanding on the sourdough bread. ", "It was so fresh and delicious.  ", "Definitely going back often. ", "This bread was almost like Cuban bread.  ", "Thy for great salads and soups too"], "author": "David C.", "review": "Wow, was this place unexpected.  My coworker told me she was taking me to a sandwich shop and we walked through a Tenderloin street , sketchy, and came to this unassuming sandwich shop.  The staff was prompt friendly and very nice.   I got a basil cream chicken sandwich and the tangy basil cream was outstanding on the sourdough bread. It was so fresh and delicious.  Definitely going back often. This bread was almost like Cuban bread.  Thy for great salads and soups too", "rating": 5, "date": "2015-11-13"}, {"excerpts": ["Specifically the Basil Cream Chicken sandwich was very yummy!  ", "I look forward to my next visit to try something else on their delicious sourdough."], "author": "Derek D.", "review": "My friend Mike just introduced me to this place last week and much to my delight they make a kick ass sandwich.  Specifically the Basil Cream Chicken sandwich was very yummy!  I look forward to my next visit to try something else on their delicious sourdough.", "rating": 4, "date": "2006-03-30"}], "blt sandwich": [], "italian beef meatball sandwich": [], "mediterranean vegetarian sandwich": [], "egg salad sandwich": [], "italian sub sandwich": [], "the club sandwich": [], "chicken parmesan sandwich": [{"excerpts": ["Ordered a chicken parmesan sandwich, caesar salad and clam chowder.   ", "Yuck, yuck, and yuck.   ", "It tasted like chicken flavored bread, the salad had inedible croutons, and the chowder was... well unrecognizable.  ", "This kitchen certainly is small... on taste."], "author": "Dave C.", "review": "An enormous waste of money.   Ordered a chicken parmesan sandwich, caesar salad and clam chowder.   Yuck, yuck, and yuck.   It tasted like chicken flavored bread, the salad had inedible croutons, and the chowder was... well unrecognizable.  This kitchen certainly is small... on taste.", "rating": 1, "date": "2014-05-30"}, {"excerpts": ["Chicken parmesan sandwich had the sorriest excuse for a piece of chicken with little to no sauce. "], "author": "R W.", "review": "Gross...Ordered roasted turkey sandwich and got deli meet. Chicken parmesan sandwich had the sorriest excuse for a piece of chicken with little to no sauce. Clam chowder was bland and tasted old. Who puts cucumbers and tomatoes in a caesar salad?? 2 giant croutons, both hard as a rock and inedible. Would never order again. And p.s...you call that a pickle?", "rating": 1, "date": "2014-05-30"}], "grilled fish sandwich": [], "ham and pastrami sandwich": [], "chicken noodle soup": [], "minestrone soup": [], "clam chowder": [{"excerpts": ["Ordered a chicken parmesan sandwich, caesar salad and clam chowder.   ", "Yuck, yuck, and yuck.   ", "It tasted like chicken flavored bread, the salad had inedible croutons, and the chowder was... well unrecognizable.  ", "This kitchen certainly is small... on taste."], "author": "Dave C.", "review": "An enormous waste of money.   Ordered a chicken parmesan sandwich, caesar salad and clam chowder.   Yuck, yuck, and yuck.   It tasted like chicken flavored bread, the salad had inedible croutons, and the chowder was... well unrecognizable.  This kitchen certainly is small... on taste.", "rating": 1, "date": "2014-05-30"}, {"excerpts": ["Clam chowder was bland and tasted old. ", "Who puts cucumbers and tomatoes in a caesar salad?? ", "2 giant croutons, both hard as a rock and inedible. ", "Would never order again. ", "And p.s...you call that a pickle?"], "author": "R W.", "review": "Gross...Ordered roasted turkey sandwich and got deli meet. Chicken parmesan sandwich had the sorriest excuse for a piece of chicken with little to no sauce. Clam chowder was bland and tasted old. Who puts cucumbers and tomatoes in a caesar salad?? 2 giant croutons, both hard as a rock and inedible. Would never order again. And p.s...you call that a pickle?", "rating": 1, "date": "2014-05-30"}, {"excerpts": ["New England style clam chowder and basil cream chicken on in-store sourdough.\n\n"], "author": "John D.", "review": "I went to Morty's 'cause they have the rep, but found even with no line at 11 a.m.  I was invisible.  Guessing 'service orientation' is not in the Morty lexicon.\n\nAfter a few minutes of not being acknowledged, crossed the street to Le Pettit - greeted by not one, not two but three smiling, friendly employees.  Went for the 1/2 sandwich and soup, $6.  New England style clam chowder and basil cream chicken on in-store sourdough.\n\nExcellent in all ways!", "rating": 5, "date": "2010-06-25"}], "chicken caesar salad": [], "chefs salad": [], "cobb salad": [{"excerpts": ["Every time I order a sandwich I realize I don't really like sandwiches, so although I had perfectly reasonable encounters with the salami and the roast beef, I now order the Cobb salad. \n", "The lettuce flows free at Le Petitt's and the salads are no exception. ", "Topped with a generous portion of grilled chicken, you can also expect some cucumbers, tomatoes, blue cheese, hard-boiled egg and smidge of bacon to make it to the party. "], "author": "Vanessa W.", "review": "An extra star for delivering the rare \"WTF?\" Tenderloin experience that DIDN'T involve feeling violated or in need of a shower.\n\nI'm talking about you, Rueben.\n\nWhere to begin?\nIf your idea of a Rueben involves tender rye bread, sliced corned beef, sauerkraut, and Swiss cheese... served up ice cold along with a heaping helping of shredded lettuce, a life-altering portion of red onions, some sliced tomatoes and plenty of mayo, well... where in the heck did you grow up?\nOne imagines Arnold Rueben is turning over in his grave.\nIt's a perfectly acceptable corned beef sandwich, but it ain't no Rueben.\nBuy hey, it's $3.75 for a half and $7.35 for a whole, so it'll do.\n\nOtherwise, the scuttlebutt is right on: the sourdough is fresh - and yes, a little doughy and par-baked-ish, but it doesn't destroy the roof of your mouth, so I'm down with it - and the ladies who run the joint could not be nicer.\nEvery time I order a sandwich I realize I don't really like sandwiches, so although I had perfectly reasonable encounters with the salami and the roast beef, I now order the Cobb salad. \nThe lettuce flows free at Le Petitt's and the salads are no exception. Topped with a generous portion of grilled chicken, you can also expect some cucumbers, tomatoes, blue cheese, hard-boiled egg and smidge of bacon to make it to the party. There isn't so much as a slice of avocado to be found, but they do include  more of that much-lauded sourdough bread on the side.\n\nAt $7.75 for a large, it's easily enough for two people.\n\nPlus, if you're a woman (or maybe even man?) of reasonable attractiveness, prepare to feel like a supermodel. The folks on the streets outside are dying to sing your (beer and god-knows-what-else goggles enhanced) praises: bad hair day, baggy sweatshirt, zero makeup and all.", "rating": 4, "date": "2014-05-22"}], "greek salad": [], "green salad": [], "oz macaroni salad": [], "oz potato salad": [], "oz bean salad": [], "oz italian pasta salad": [], "fruit cup": [], "lettuce wrap": [{"excerpts": ["Last Friday, I passed by Le Petit's Kitchen before heading over to a Dr.'s appointment and ordered the Basil Cream Chicken Lettuce Wrap w/ Avocado. ", "For a mere $4, I got this bad boy which I had no idea how to even begin to eat. ", "The most viable option? ", "FACEPLANT INTO IT! ", "Yeah buddy! ", "http://www.yelp.com/biz_photos/au6IWLg6TlCK7z-QYgTIEA?select=7FO_BqmD7ZyCWXowRrtNMA\n", "The freshly crisp iceberg lettuce was nicely filled with tender, seasoned chicken breast generously (but not overwhelmingly) dressed in an herbaceous creamy sauce, ripen tomatoes, and crisp red onion slices. ", "so I can wear the lettuce wrap on my head like an overgrown cabbage patch kid and no one would give a sh*t. ", "Or do they? "], "author": "Cherylynn N.", "review": "Artisanal sandwiches served on FRESH, HOUSE-BAKED BREAD in the TL?!?!?\n\nIn the heart of the TL, home to the crazies, the druggies, and the trannies, lies a non-descript gem of a sandwich shop. Le Petit's Kitchen has over 30 sandwich combos served on their fresh, house-baked sourdough bread ($3.50 for half, $6.75 for whole). They even roast their own turkey and roast beef. Thanks, Susy C. for this find. \n\nI \"somewhat\" gave up refined carbs (yah, we'll see how long that lasts) so too bad for me that I can't have a taste of Le Petit's Kitchen or is it? They ALSO give you the option to have any sandwich wrapped in lettuce. Whooo Hoooo! Crazy land, here I come... \n\nLast Friday, I passed by Le Petit's Kitchen before heading over to a Dr.'s appointment and ordered the Basil Cream Chicken Lettuce Wrap w/ Avocado. For a mere $4, I got this bad boy which I had no idea how to even begin to eat. The most viable option? FACEPLANT INTO IT! Yeah buddy! http://www.yelp.com/biz_photos/au6IWLg6TlCK7z-QYgTIEA?select=7FO_BqmD7ZyCWXowRrtNMA\nThe freshly crisp iceberg lettuce was nicely filled with tender, seasoned chicken breast generously (but not overwhelmingly) dressed in an herbaceous creamy sauce, ripen tomatoes, and crisp red onion slices. I'm glad I opted to add avocado as it added another layer of creamy decadence. \n\nWith cream all over my face, I was glad they provided extra napkins. The TL ain't sNob Hill so I can wear the lettuce wrap on my head like an overgrown cabbage patch kid and no one would give a sh*t. Or do they? (o_O)\n\nOTHER NOTES:\n*Open Monday to Fridays 9:30 AM - 3 PM\n*Friendly service\n*Free delivery with $15 minimum\n*Catering available\n*Seating for 10\n*1.5 blocks from UC Hastings and 2.5 blocks from the Art Institute \n*CC's accepted", "rating": 4, "date": "2012-02-08"}], "cookie": [{"excerpts": ["You can get a half (which is still pretty big), plus potato or macaroni salad, and a cookie for under $6.\n\n"], "author": "Joseph N.", "review": "I still come to Le Petitt's once or twice a week.  I usually get the vegetarian with cucumbers, carrots, and bell peppers in addition to the standard lettuce, tomato, onions and cheese.  I always add avocado for $.25, and it's always good.\n\nI've also become a fan of the half sandwich.  You can get a half (which is still pretty big), plus potato or macaroni salad, and a cookie for under $6.\n\nOh and I previously said sourdough is the only bread, which isn't true.  They also have wheat, rye, and I think white, but I've yet to try any of them because the sourdough is so damn good.", "rating": 5, "date": "2010-04-14"}], "muffin": [], "combination a": [], "combination b": [], "combination c": [], "combination d": [], "fountain soda": [], "canned soda": [{"excerpts": ["Canned soda, bottled water, and limited small sides are available.  ", "This place is clean, the service is consistently excellent.  ", "More important, the breads and meats are fresh.  ", "A pickle and candy are also included with the combos.  ", "I find that a half sandwich combo is just right for lunch."], "author": "Antonio E.", "review": "Le Petitt's is a hidden gem.  I had no idea it existed until a co-worker mentioned it by name.  This place in unique for the neighborhood.  It's atmosphere is totally different than Morty's, more importantly - it is totally different than the neighborhood right outside its doors.  More go to Morty's to chat and eat.  Le Petitt's, though it has tables, is more for pick up and run.  It has an impressive selection of sandwiches to go.  Combos include a fountain drink and selection from a good selection of chips.  Canned soda, bottled water, and limited small sides are available.  This place is clean, the service is consistently excellent.  More important, the breads and meats are fresh.  A pickle and candy are also included with the combos.  I find that a half sandwich combo is just right for lunch.", "rating": 4, "date": "2009-02-10"}], "bottled soda": [], "hot chocolate": [], "hot tea": [], "specialty coffee": [], "geyser plain sparkling water": [], "tropicana orange juice": [], "martinelli apple juice": [], "san pellegrino soda": [], "v juice": [], "nectars": [], "the delivery fee may have been increased to comply with the san francisco bag ordinance": []}