{"breakfast buffet": [{"excerpts": ["Further props for the good service, including letting me sneak a no charge taste of their house granola in the breakfast buffet. ", "The only thing keeping this from five stars was the prices (bit steep) and decor (red carpets? tacky). ", "I probably won't race back for dinner, but would definitely recommend Level III for brunch, er, breakfast."], "author": "Jason B.", "review": "Note to all brunch fans - if Level III is your destination, go by 11. You'd think they'd extend breakfast on the weekends till the afternoon, but that is not the case. We got there right after 11, and after putting our order in, the waiter came back to say they were no longer serving. We were going to leave, but after a bit of double checking, the waiter came back to tell us they'd go ahead and make our order. It was not a good start.\n\nFortunately, the food was excellent.  Since perusing their menu online, I had been obsessing about their French toast - wheat bread dipped in egg beaters, complemented by grilled cornflakes and fruit. Ah, yeah. It tastes as amazing as it sounds. And my friend had no complaints about his eggs benedict.\n\nFurther props for the good service, including letting me sneak a no charge taste of their house granola in the breakfast buffet. The only thing keeping this from five stars was the prices (bit steep) and decor (red carpets? tacky). I probably won't race back for dinner, but would definitely recommend Level III for brunch, er, breakfast.", "rating": 4, "date": "2008-06-22"}], "good start buffet": [], "all american breakfast": [], "egg omelet": [], "stack of pancakes": [], "belgium waffle": [], "brioche french toast": [], "crunchy whole wheat toast": [], "chefs sandwich": [], "chorizo sausage scrambled eggs": [], "joes eggs": [], "steak and eggs": [{"excerpts": ["My husbands steak and eggs was very good. ", "I would say it's a good place to eat if you are staying in the hotel, but I would not travel out of the way to go there. ", "FYI- ", "The restaurant is open to the lobby of the Marriott. ", "The lobby is pretty."], "author": "Amber S.", "review": "Our waitress was not very attentive and did not know the menu or what was available. The manager seemed to recognize this and came over to get us drinks after we sat for 5 minutes without drinks. The food was pretty good. My husbands steak and eggs was very good. I would say it's a good place to eat if you are staying in the hotel, but I would not travel out of the way to go there. FYI- The restaurant is open to the lobby of the Marriott. The lobby is pretty.", "rating": 3, "date": "2018-09-29"}], "black stone": [], "dungeness crab cake": [], "florentine": [], "fresh fruit platter": [], "ruby red": [], "bowl of seasonal berries": [], "hot oatmeal": [], "cereal or house made granola": [], "honey yogurt parfait": [], "two eggs you choice": [], "breakfast bread toast or pastries": [], "breakfast meats": [], "breakfast potatoes": [], "banana berry smoothie": [], "pot of coffee": [], "mighty leaf teas": [], "whole": [{"excerpts": ["Pulled into the whole holiday spirit, we decided to hit up the hotel bar, get a little festive and order a nice little strong cocktail. "], "author": "Rebekah T.", "review": "Pulled into the whole holiday spirit, we decided to hit up the hotel bar, get a little festive and order a nice little strong cocktail. As I ordered a Maker's Mark Manhattan from the bartender he asked me \"Sweet\" or \"Spicy\"?\n\nUmmm, always spicy. He adds some Ancho Chile powder to my Manhattan and slips me the bill - $16. One drink, sixteen dollars? Wow, it was good but not that good. I've had better Manhattans with better bourbon than that. \n\nAlthough the cocktail was delicious, it really didn't make me want to stick around for another one. Off to another place instead.", "rating": 3, "date": "2011-11-21"}, {"excerpts": ["( an idea suggested in the book A Whole New Mind).\n", "Drinks were well mixed by a personable local mixologist.  ", "Conversation flowed easily.  ", "It was nice to get out of the comfort zone of one's regular haunts."], "author": "Thomas D.", "review": "We stopped in for drinks after having dinner in Union Square.  The bar and restaurant are quite trendy looking and reside in a large open space.  I enjoyed the look and took the time to appreciate the design that someone created. ( an idea suggested in the book A Whole New Mind).\nDrinks were well mixed by a personable local mixologist.  Conversation flowed easily.  It was nice to get out of the comfort zone of one's regular haunts.", "rating": 4, "date": "2011-03-11"}, {"excerpts": ["Level III takes \"shared plates\"  to a whole new level, and does not disappoint!"], "author": "Grace K.", "review": "I am seriously impressed by the food at Level III!\n\nLocated inside  the new JW Marriott, it's the hotel restaurant on the third level of the building - - hence, Level III.  One thing to note that the front desk is also on this level, and essentially, you are dining IN THE LOBBY.  It's a bit weird, but they've designed it in a way that works - - the lobby sort of melds right into the lounge, which melds right into the restaurant.... and while you may technically be eating your dinner in the \"lobby\" - - it's not bothersome.\n\n\nWhile it is a hotel restaurant, it's not all that formal, and quite bright.  Service was excellent - - every server we encountered was trained to the JW Marriott style - friendly, pleasant, and polite.  \n\nBut the food was EXEMPLARY.\nI am tempted to give it 5 stars because it was so good, but as I always say - - 5 stars is a class of its own, and while Level III really impresses me, the overall experience is not quite up to par.\n\nLevel III is a \"shared plates\" concept, tapas-like, if you will.  They do have larger entrees which could serve as your main course, but that, too, is best shared.  All \"level 1\" items are very small, all \"level 2\" items are a bit bigger, and all \"level 3\" items are similar to main entrees.\n\nOn this night, we started with the seafood salad, which was EXCELLENT.  I can't begin to explain how good this was, full of real lobster meat, clams, scallops and tons of flavor - - 5 stars hands down.  I could eat four plates of this by myself.  We also had the tuna tartare, and contrary to how bland it looked, with the green sauce, it was really quite good.  Then we had the Kobe Beef Sliders - - which were PERFECT.  We requested rare, and it came close... two patties with an onion ring inside the slider, it was perfect.  Last, but not least, was the Mac and Cheese w/ Black Truffles (the truffles are an added option, as is lobster mac and cheese).  At $17, this was one FANTASTIC mac and cheese, with Gruyere and mascarpone cheese.  The pasta itself was a bit overcooked for my taste, but it didn't take away from the final 5-stars I give this dish.  (Edited to add:  We also had ice cream sandwiches and freshly fried donuts with chocolate dipping sauce --  the sandwiches were excellent, piled high between cookies... the fresh donuts were good but I've had better.)\n\nCombined with a bottle of J Pinot Gris, which was quite good, the total was a $135 or so and we were stuffed.  Frankly, for hotel dining, I thought this was quite reasonable.,,, and factoring in the food quality, I'd HIGHLY recommend Level III.\n\nThis is, without a doubt, a welcomed addition to the San Francisco dining scene, and with a little time, undoubtedly will become well-known for their great food and good service, at reasonable cost.  It's a fantastic date place, if you secure private booth seating - - or in my case, I preferred a table on the outskirts of the restaurant as it was quieter on this night.  Be it a date or a group outing, Level III can host your dinner, and I'd assume groups of up to 20 people could easily eat here.\n\nLevel III takes \"shared plates\"  to a whole new level, and does not disappoint!", "rating": 4, "date": "2008-07-05"}, {"excerpts": ["Mind you, we were there at 6, and there were only two other seated tables in the whole place. ", "We didn't get our first course until 6:40, at which point we told the head waiter that we needed to make an 8 p.m. curtain. "], "author": "Stevi C.", "review": "I like a good-looking restaurant, and I like all the hanging chandeliers and the plush booths at Level III, but the food here is, as many people say, overpriced and sub-par. And on top of that, the service is slow and inattentive. We'd made a reservation at 6 p.m., thinking that in any ordinary universe, two hours would be a perfect amount of time for a practically empty restaurant such as Level III to serve up a coursed meal, but because the wait staff was so inattentive, we ended up rushing to get our check taken care of by 7:30 so that we had enough time to walk to the theatre. \n\nWhen we first came in, there was no host at the host stand and had to wait. Then, once we were seated, it was 10 minutes before a waitress came by to take our drink order. And another 10 before she brought back our wine. Mind you, we were there at 6, and there were only two other seated tables in the whole place. We didn't get our first course until 6:40, at which point we told the head waiter that we needed to make an 8 p.m. curtain. At which point, they picked up the pace a bit, which was appreciated. \n\nI can barely even remember what I ate there, save to say that their French Onion soup is unmemorable and the butternut squash pasta had no subtlety (basically just tasted like butternut squash). My desserts were three little ice cream sandwiches, that I left unfinished because it was 7:40 and I had to get to the Orpheum.\n\nSlow service plus uninspired food? Not a place I'm likely to return to.", "rating": 1, "date": "2009-04-30"}, {"excerpts": ["Go get off that chair and stop spending your whole time on the computer, smile and enjoy your life."], "author": "marcus o.", "review": "Recently had dinner for a party of 13. The restaurant in general looks pretty current with the nice design and layout of furniture and tables. I thought it was a great spot for dinner.  The food was good and the wine was refreshing.  Enjoyed the company at dinner talking bout life and all that good stuff you talk about at dinner.  Overall it was a plus in my book, just marked it off my list of restaurants to check out.  As with any other reviews that you are reading, go out and try it yourself and see whats up.  Go get off that chair and stop spending your whole time on the computer, smile and enjoy your life.", "rating": 4, "date": "2009-01-04"}]}