{"spicy chicken wings": [{"excerpts": ["(Little Star dominates for sure), kale salad and spicy chicken wings. ", "The Little Star slices were the star of my meal, hands down. "], "author": "Carissa G.", "review": "One of the few deep dish places in the city. (Pro: parking is plentiful on a Monday evening) I like the variety of the menu and the happy hour specials - all night Monday/Tuesday and until 6:30PM W-F. I came here on a Monday night at 6:30PM with a few tables still available. Note that they don't seat you until most of your party is there so make sure your friends are on time! ... but we ended up opting to sit at the bar because the Warriors game was playing.\n\nFor our party of 3 we shared a Large deep dish pizza - half Little Star and half Pollo (Little Star dominates for sure), kale salad and spicy chicken wings. The Little Star slices were the star of my meal, hands down. The cheese was so gooey and went on and on when you first bite into the slice (sign of a well cheesed-up pizza imo)\n\nBe cautious of the pizza size you order because they come in generous portions! We easily could've downsized to a Small pizza since we ordered apps. We ended up having 40% of the pie as leftover!\n\nOverall, we enjoyed the meal but will venture out to discover other deep dish spots in the city before making our way back to this spot", "rating": 4, "date": "2017-05-17"}, {"excerpts": ["You have the best spicy chicken wings I've had in years ", "and oh how I will long for them ", "anytime I'm in the city. ", "The smoky rub with spice in oven baked wings are to die for. "], "author": "Shane T.", "review": "Oh Little Star how much do I love you! You have the best spicy chicken wings I've had in years and oh how I will long for them anytime I'm in the city. The smoky rub with spice in oven baked wings are to die for. If I were asked to have my last meal these wings would be part of my request.\n\nThe pizza was awesome and I wish I had enough courage to go after the deep dish! I made my own 3 topping with pepperoni, mushroom, and olive. We sat at the bar and our server Irena was absolutely the best. She was charming, patient, and attentive! She definitely enhanced our dining experience!\n\nThe interior decor is quaint and dark. Fortunately the bar has a television and local brews on tap (only 4). Wine and mixed drinks are available to order. Happy hour ran all night on a Monday so it's a good time to take advantage of the limited happy hour menu if you come in a little later in the evening. \n\nAn order of wings and a small pizza with a couple drinks was perfect to share. I'm afraid if we went with the deep dish we wouldn't have been able to finish everything and ended up in a food coma! I do recommend getting the large and the deep dish if you want to take home some leftovers otherwise the small is good for two!", "rating": 5, "date": "2017-03-21"}, {"excerpts": ["(^_^) Spicy Chicken Wings ", "$9HH/$12SH (http://bit.ly/2fGYwL3)\ngood spicy not cray spicy\n1 pound of chicken! "], "author": "Dan B.", "review": "underwear!\niron man!\nunderwear!\n\"sincere\" is when you really mean it\n\"insincere\" is when ydgaf\nunderwear!\n(and more nonstop underwear...)\n\nthis was my dinner at Little Star. \"Little\" as in a whopping 7 tables had kids, with convos to match.\n\nbut you know what? if this is sf's robotless skeeballless version of chuck e cheese, i feel hopeful for our future hipsters of trumpmerica.\n\nbecause this place is cool.\n(read: you had me at semialt lifestyle whtchx servers)\n\n(^_^) Spicy Chicken Wings $9HH/$12SH (http://bit.ly/2fGYwL3)\ngood spicy not cray spicy\n1 pound of chicken! #twss\n\n(^_^) Los Pollo Hermano $27 (http://bit.ly/2fCroBx)\nget Large Deep Dish ffff anything else\nmeat was a little tough tho #twss\n\nnext time i might throw on the jukebox, see if i can drown out some adjacent talk. does the juke have busta rhymes? just tell me it doesn't have a song about ffffin underwear...", "rating": 4, "date": "2016-11-10"}, {"excerpts": ["$12.50 Spicy Chicken Wings - pound of wings with baby carrots and blue cheese dressing:\nThese wings seemed to be baked with a spice rub, as opposed to fried. ", "The result is considerably less messy than most chicken wings. ", "It had quite a bit of heat and spicy kick to it, which I attempted to quell with the baby carrots. "], "author": "Joy W.", "review": "I always thought I didn't like deep dish, but turns out I like deep dish pizza here! Well, by now, I'm used to being wrong about everything. \nI put aside my preconceived notions about deep dish, because at the time, I was too hungry to care. There were a few people waiting outside, but luckily a couple vacated the table behind the jukebox, so we were seated pretty quickly. There's a narrow row of small of tables opposite a bar and next to the bar, there are a couple of mismatched couches. It actually kind of worked and was a good use of the space.\n\n$20.50 Little Star - spinach blended with ricotta & feta, mushrooms, onions, garlic, \n+ $2.10 sausage: Very, very good!\nIn the past, I thought all deep dish pizzas had soggy, limp crusts under an overwhelming amount of tart, tomato sauce. Neither wet crust nor a mouthful of sauce appeals to me.\nHowever, the cornmeal crust on this deep dish pizza is delightfully crunchy and substantially thick enough to support the weight of the filling. \nInstead of a heavy tomato sauce, the interior was stuffed with spinach and mushrooms. There was so much spinach that I think they must have sautéed and wilted down the leaves first before mixing it into the creamy ricotta & feta. \nAlso, it was so incredibly cheesy that the gooey strings just kept on stretching. \nSince the tomato sauce sits on top of the cheesy filling, the crust does not absorb the moisture from the sauce. The order of the toppings must be the reason why their pizzas come out solid and crunchy instead of wet and soggy.\n\n$12.50 Spicy Chicken Wings - pound of wings with baby carrots and blue cheese dressing:\nThese wings seemed to be baked with a spice rub, as opposed to fried. The result is considerably less messy than most chicken wings. It had quite a bit of heat and spicy kick to it, which I attempted to quell with the baby carrots. I didn't use too much of the blue cheese dressing since the flavor is too sharp for my preferences. \n\nThe pizzas range from about $20-$30. Deep dish pizzas come in 9\" & 12.\" Thin crust pizzas come in 12\" and 16.\" There are also plain cheese pizzas, and you can basically build your own by adding toppings for ~$2-$3 for each topping. \nOur server informed us that deep dishes here typically take about 25 minutes, which isn't too bad compared to baking times for most deep dish pizzas. \nApparently, the wait times during weekend peak dining times can be rough. For lazy people like me, I'd rather opt for delivery.", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["We ordered the spicy chicken wings as a starter and these were delicious! ", "My boyfriend actually polished 10 of them off within a few minutes. ", "We also ordered the large Classic deep dish pizza. "], "author": "Jeantelle L.", "review": "5 stars for amazing service! This is actually my first Yelp review, and the exemplary service I received has compelled me to turn my Twitter fingers into Yelp fingers (haha).\n\nI walked in with my boyfriend on a Saturday evening around 5 and we were seated immediately. Awesome. The interior is nice and the music was cool. Queen was playing in the background, and any establishment that plays Freddie Mercury is okay with me.\n\nWe ordered the spicy chicken wings as a starter and these were delicious! My boyfriend actually polished 10 of them off within a few minutes. We also ordered the large Classic deep dish pizza. The food came out promptly and we were checked on regularly. \n\nAfter a few bites of our pizza, our server (her name was Mer) came and informed us that they accidentally gave us the Little Star pizza instead of the Classic that we originally ordered. Now, my boyfriend and I are pretty easy going people. We actually didn't notice the difference and thought the pizza was delicious, and we were fine with what we received. But the staff apologized profusely and went above and beyond by giving us a discount for the error AND firing up a Classic pizza for us to take home without us asking! \n\nI was in awe. Honestly, who does that!? I was surprised and really pleased with their professionalism and generosity. It's hard to find establishments that really care about their customers, and I'm really happy with Little Star's service. We'll definitely be back. Thanks so much to Mer and the rest of the staff for the wonderful service (and the delicious food!)", "rating": 5, "date": "2016-02-14"}, {"excerpts": ["(1/2 Classic + pepperoni and 1/2 Brass Monkey aka Little Star + sausage)\n- Spicy Chicken Wings\n\n"], "author": "Vincent L.", "review": "Always wanted to come here after recommendations from my coworkers and housemate. And I'm glad I had an opportunity to try it out. \n\nAs a party of 2, we were seated within 15 minutes and we ordered the following:\n\n- Small Half And Half Deep Dish Pizza (1/2 Classic + pepperoni and 1/2 Brass Monkey aka Little Star + sausage)\n- Spicy Chicken Wings\n\nThe pizza was the star of the show. I've had deep dish pizzas in Chicago (i.e. Lou Malnati's and Giordano's) and I have to say, this blew those away. There's something about the corn meal crust that adds a great flavor and feels a bit lighter. The brass monkey was enjoyable, as the combination of fixins felt very reminiscent of lasagna. The Classic was my FAVE! The texture and flavor combinations of the meat with green pepper, mushrooms and onions were delicious!\n\nIn conclusion...Little Star is packed with Big Star flavor!", "rating": 4, "date": "2015-03-29"}, {"excerpts": ["Spicy chicken wings ($11.50) - Pound of wings served with baby carrots & blue cheese dressing. ", "I was expecting the usual buffalo wings, but I was pleasantly surprised. "], "author": "Elena N.", "review": "Little star has been in my bookmarks for some time. When the roommate said he was craving pizza, I suggested Little star. Finally, I get to try their pizza! I know they're known for their deep dish, but I wasn't in a deep dish kind mood, so we stuck to their thin crust pizzas. We got take out of the following:\n\nSpicy chicken wings ($11.50) - Pound of wings served with baby carrots & blue cheese dressing. I was expecting the usual buffalo wings, but I was pleasantly surprised. The wings were juicy, crunchy and had a nice little kick. \n\nHalf White pie & half Pesto chicken ($19.50 for a small 12\") - I couldn't decide which pizza I wanted, so I went for the half and half. The White pie ($19.25 for a small 12\") came with a garlic infused olive oil base, roasted zucchini, fresh tomatoes & feta. The Pesto chicken ($19.50 for a small 12\") came with a pesto base, roasted chicken, roasted red peppers, mushrooms & onions. Being the carnivore that I am, I was surprised that I liked the White pie the best. The zucchini,  tomatoes and feta made it very simple and delicious. And I loved the garlic olive oil base. I enjoyed the Chicken pesto as well. Who can go wrong with chicken and pesto sauce?! But I could have done w/o the roasted red peppers. I felt like the pesto, chicken, mushrooms & onions already made it a good slice. The peppers seemed out of place.\n\nMeateor ($19.50 for a small 19\") - Sausage, pepperoni, mushrooms & onions. This was the roommate's pizza. He loves meat pizzas so this was perfect for him! I love a good pepperoni & mushroom pizza, so I'm glad he picked this one so I could have a slice! I loved the quality of the toppings and pizza, but this one suffered since I got it for take out. It wasn't hot and melty like it should have been. Who wants lukewarm meat and cheese?!\n\nI'd love to come back and try their deep dish pizzas. Would probably go for another half and half so I can try more things!", "rating": 4, "date": "2014-08-24"}, {"excerpts": ["(4 stars)\n\nSpicy Chicken Wings ($11) was our appetizer. "], "author": "Michael S.", "review": "Deep Dish Pizza is the star attraction of Little Star, but the starburst wasn't the depth of the pizza pie ... the stars were the startlingly delish crust and toppings. While one huge Little Star Pizza obliterated my starvation, I was left a little starstruck by the friendliness of the starlet Hostess, a spicy starter of Chicken Wings, and a deep-dish pizza destined for stardom.\n\n   Star light, star bright,\n       At Little Star Pizza tonight;\n   I wish I may, I wish I might\n      Have the Deep Dish I wish tonight\n\nA Large Deep Dish Pizza ($25) -- half Classic (Sausage, Mushrooms, Bell Peppers, and Onions) and half the Daily Special (Meatballs & Ricotta) -- was recommended by the hostess who placed the order prior to seating us. These 2 inch pizzas do take a little time. She was cool. The pizza was cooler. Our small group agreed the Meatball side was the better of the two. The the crust was near perfect ... strong and dry enough to hold the hefty toppings while soft enough to be delicious. (4 stars)\n\nSpicy Chicken Wings ($11) was our appetizer. The wings were a little spicy. A single order was full pound of Wings served with a few Baby Carrots and basic Blue Cheese Dressing. (4 stars)\n\nParking meters were turned off on the street the evening we went, so, it surprisingly was easy to find a spot. Good luck. \n\nLittle Star Pizza is a little pizza joint with some big pizzas and totally worthy of four little twinkling stars.", "rating": 4, "date": "2014-01-13"}, {"excerpts": ["We ordered the Crispy Kale ($5), Spicy Chicken Wings ($9), and BYO Deep Dish Pizza: small Cheese ($14) with Sausages ($2.75) and Feta ($1.85). ", "To begin with the appetizers, the kale completely exceeded my expectations. ", "It was baked with parmesan cheese on top, which was so delicious! ", "A little bit of veggies to balance out your meal is always nice as well. ", "For the wings, they were tiny but came in plenty. ", "The flavor was okay, but still pretty good with the ranch dressing as a good snack before the main course. ", "I was very excited for the pizza and it was just as great as I remembered it. ", "It is comparable to the ones I've had in Chicago and is super filling. ", "Never underestimate a deep dish pizza with all the fillings inside of it! ", "I didn't taste so much of the feta, but still good. ", "I only finished one slice, so took my other two home. ", "They were even better the next day --yum! ", "This is the spot for some good ol' comfort food with the dim-lit setting, which was quaint and intimate."], "author": "Cindy Z.", "review": "After a long day of moving into my new place, I decided to treat myself by coming here for dinner with a friend. The last time I been to Little Star was probably 5 years ago in Berkeley, so when I realized that there was one nearby, I had to come! Plus, I do miss the deep dish pizzas from Chicago. So we arrived around 5:30pm on a Friday night with an hour left of happy hour, whoo! We ordered the Crispy Kale ($5), Spicy Chicken Wings ($9), and BYO Deep Dish Pizza: small Cheese ($14) with Sausages ($2.75) and Feta ($1.85). To begin with the appetizers, the kale completely exceeded my expectations. It was baked with parmesan cheese on top, which was so delicious! A little bit of veggies to balance out your meal is always nice as well. For the wings, they were tiny but came in plenty. The flavor was okay, but still pretty good with the ranch dressing as a good snack before the main course. I was very excited for the pizza and it was just as great as I remembered it. It is comparable to the ones I've had in Chicago and is super filling. Never underestimate a deep dish pizza with all the fillings inside of it! I didn't taste so much of the feta, but still good. I only finished one slice, so took my other two home. They were even better the next day --yum! This is the spot for some good ol' comfort food with the dim-lit setting, which was quaint and intimate.", "rating": 4, "date": "2017-01-03"}, {"excerpts": ["We ordered two Blue Paddle Pilsner ($4.75 each), the Spicy Chicken Wings ($11), and a 9 inch pizza that had half with the Mediterranean Chicken ($19.75 for 9 inch and $25.50 for 12 inch) and the other half with the Classic ($19.50 for 9 inch and $25 for 12 inch).  ", "The Spicy Chicken Wings came out first and there were 10 pieces.  ", "It was pretty tasty and good.  ", "I didn't think it was spicy, but it was pretty hot temperature-wise.  ", "I nearly burned my fingers trying to hold it, but I also don't have callus on my fingertips since I haven't played guitar for a long time.  ", "The pizza came later (maybe 30 minutes after we ordered) and it looked like one topping for the whole pizza ", "but it wasn't.  ", "The side with the Mediterranean Chicken was good as well as the side with the Classic.  ", "When the pizza was hot, then it tasted good; however, as it got cooler, the pizza's taste went down as well.  "], "author": "Daniel H.", "review": "I was at my aunt's place which was a few blocks away so my dad and I decided to walk here for dinner on a Friday night.  I didn't see a whole lot of parking on the street so that could be an issue for anybody not walking.  It took a couple of minutes before anybody noticed us at the door.  There were a lot of people here and at the bar.  The lighting gradually got darker was we approached the back where our table was.  There were candles at each table so at least there was some kind of lighting to read the menu. \n\nOur waiter told us a 9 inch pizza would be enough for two people and if it were two hungry people, then an appetizer would be enough in addition to the 9 inch deep dish pizza.  We ordered two Blue Paddle Pilsner ($4.75 each), the Spicy Chicken Wings ($11), and a 9 inch pizza that had half with the Mediterranean Chicken ($19.75 for 9 inch and $25.50 for 12 inch) and the other half with the Classic ($19.50 for 9 inch and $25 for 12 inch).  We felt that should be enough for both of us. \n\nThe Spicy Chicken Wings came out first and there were 10 pieces.  It was pretty tasty and good.  I didn't think it was spicy, but it was pretty hot temperature-wise.  I nearly burned my fingers trying to hold it, but I also don't have callus on my fingertips since I haven't played guitar for a long time.  The pizza came later (maybe 30 minutes after we ordered) and it looked like one topping for the whole pizza but it wasn't.  The side with the Mediterranean Chicken was good as well as the side with the Classic.  When the pizza was hot, then it tasted good; however, as it got cooler, the pizza's taste went down as well.  The Blue Paddle Pilsner was not bad and I wouldn't have known what else to order since the selection on tap was limited to beer I've never drank before. \n\nOverall, pretty good food and I would recommend trying their deep dish pizzas.", "rating": 4, "date": "2013-07-17"}, {"excerpts": ["I also heard that the Spicy Chicken Wings are worth a valiant effort, as well as the Cheesecake for dessert. ", "Here's a link to their online website, in case you want to window shop their everyday menu. "], "author": "Chris C.", "review": "My friends from the Golden Gate City advise that there at two Chicago style deep dish pizza restaurants that I must try if I'm in Northern CA. One is Patxi's and the other being Little Star. From the rumorville, Patxi's has the better sauce on top, while Little Star has the better crust on the bottom.\n\nTHE SLICE IS RIGHT\nI ordered the smaller 9 inch size, rather than the larger 12 inch, knowing very well that these deep dish pizzas make your stomach quite full. One half of the Classic and the other fifty percent as the Little Star. It takes about 25 minutes to prepare. The Classic contains sausage, mushrooms, onions, and green bells. The Little Star has spinach blended with ricotta and feta, mushrooms, onions, and garlic. I'll make sure to add sausage to the Little Star next time, but more on that later.\n\nI pretentiously favored the Classic, given that it had the combination of toppings that I liked. But, the side that contained the Little Star was far superior. Probably because of the salty and tangy taste of the different cheeses that the other half lacked. For not having any meat topping whatsoever, it was quite scrumptious.\n\nThe crust felt rather delicate, yet crisp with a flaky quality. Just the right amount of lightly sweet tomato sauce and seasoning. I normally don't enjoy deep dish pizzas that are super thick and bready, when it's so hard to chew because there's so much of the cornmeal crust. This however, was different. For those of you that's had the deep dish pizza crust at Masa of Echo Park in Southern CA, this version is way, way better.\n\nIf you're gonna have the Deep Dish, you gotta try the Thin Crust, right? I also heard that the Spicy Chicken Wings are worth a valiant effort, as well as the Cheesecake for dessert. Here's a link to their online website, in case you want to window shop their everyday menu. (http://www.littlestarpizza.com/index.html)\n\nTHE HIDDEN MENU\nTwo pies that are absent from the usual are - the Brass Monkey & the Abba Zabba (aka the Half Baked). Remember, how I said that I'd add sausage to the Little Star pizza? Well, that's the Brass Monkey. Almost like a lasagna, but not soggy. The Abba Zabba is any pie that's half cooked and then thrown into a TO GO box. At home, you cook it for another 25 minutes until it's ready to be served.", "rating": 5, "date": "2014-07-13"}, {"excerpts": ["I had the delicious spicy chicken wings with a Wyders pear cider for my appetizer. ", "The Classic Little Star deep dish was the main course and was more than enough for two people.  ", "If you come to The City you must visit."], "author": "Jamie C.", "review": "Great dining experience!!! Went to this place while visiting San Francisco and was not disappointed. They are located in a nice little area of SF not to far from downtown. The friendly customer service , dim lighting and casual environment only enhanced the atmosphere. I had the delicious spicy chicken wings with a Wyders pear cider for my appetizer. The Classic Little Star deep dish was the main course and was more than enough for two people.  If you come to The City you must visit.", "rating": 5, "date": "2016-03-26"}, {"excerpts": ["The order consisted of a large caprese, spicy chicken wings, and the classic deep dish, add pepperoni. "], "author": "Anthony B.", "review": "Once again, this place stands the test of time. \n\nOrdered my togo order via Postmates to arrive prior to turning on some Steel Magnolias with a southern friend whilst we imbibed enough wine to kill a small mammal. \n\nThe order consisted of a large caprese, spicy chicken wings, and the classic deep dish, add pepperoni. Guzzled a few bottles of Groth with it.\n\nThe pizza: not for beginners. It's cornmeal crusted, toasted to a perfect golden suppleness. Piled onto it is boatloads of cheese, sausage, onions. Topped with a rich and hearty tomato sauce that is decadent, perfect. I add to it some lovely spicy pepperoni slices for added mouth explosion. \n\nThis review is kind of turning me on. I think I have a problem with my addiction. Clearly.\n\nThe service inside is always on point, their beer is always a great selection, and I can't describe how much I look forward to making another order. No other pizza I've encountered in the world compares to that of little star. Sorry Chicago.", "rating": 5, "date": "2015-08-05"}, {"excerpts": ["Warm bread topped with butter, fresh garlic, mozzarella & fresh basil\n\nSpicy Chicken Wings (Appetizers)2x\n$29.90\nSpicy. "], "author": "Joel J.", "review": "Was craving Little Star during this holiday visit in SF.  Decided to order it for the fam.  SF is the best during the holiday season approaching Dec 25th -I notice that there isn't ANY traffic and my guess is that it's the slowest time of year for the city. Highly recommended you come by in the winter season : )\nAnyways, let's get to it... Here's what I ordered:\n\nGarlic Bread (Appetizers) 2x\n$15.00\nVery garlicy. Very nice. Warm bread topped with butter, fresh garlic, mozzarella & fresh basil\n\nSpicy Chicken Wings (Appetizers)2x\n$29.90\nSpicy. But wouldn't order it again, since Little Star is known for it's pizza. My brother and his husband recommended a place in this city called \"Wing Wings\" that specializes with chicken. A pound of wings served with baby carrots & blue cheese dressing\n\nClassic (Deep Dish Pizzas)\nDeep Dish Size: 12\" Large ($6.95)\n$30.90\nVery good and the reason why I was craving the Chicago style pizza. Heavy, but not too heavy. Sausage, mushrooms, onions, green bells\n\nWhite Pie (Thin Crust Pizza)\nThin Crust Pizza Size: 16\" Large ($6.50)\n$29.45\nExcellent. Would order it again. Garlic infused olive oil base, mozzarella, roasted zucchini, fresh tomatoes, feta\n\nMoney wise. Here's how it looked:\nSubtotal: 105.25\nTax: 9.21\nDelivery Fee: 11.98 and yes I was way too lazy to walk and pick it up because I'm in full R&R vacation mode. Sorry SF locals\nDiscount: -2.00\nDelivery Tip: 33.00\nTotal: 157.44", "rating": 5, "date": "2015-12-23"}, {"excerpts": ["While tasty and piquant, the spicy chicken wings ($11) are not your traditional Buffalo wings. "], "author": "CJ G.", "review": "Little Star Pizza is one of the best Chicago-style deep dish pizzas in the Bay Area.\n\nWith a wooden bar and a casual atmosphere, you won't mistake Little Star Pizza on Divisadero for anything other than the pizza joint it is.  No white table cloths here, just great deep dish pizza worth driving across The City for.\n\nServed with melted butter and olive oil, the sourdough garlic bread ($5.75) is a good choice to take the edge off your hunger. While tasty and piquant, the spicy chicken wings ($11) are not your traditional Buffalo wings. The delicious Caprese salad ($11), with fresh, soft mozzarella slices and tomatoes that tasted as if they were just picked, was topped with shredded basil and presented in a mixture of olive oil and balsamic vinegar--the embodiment of summer. \n\nWith spinach, ricotta, mushrooms, onions, and garlic, the Little Star ($19/$24.50) puts other deep dish pizzas to shame.  The cornmeal crust was perfectly cooked--just toasted enough, not burned.  The deep dish Mediterranean chicken pizza ($19.75/$25.50) was also fantastic.  The cheese was melted, but not greasy, and the combination of artichokes, feta, and green olives was a perfect foil for the tanginess of the tomato sauce.\n\nService is friendly, if a little rushed.  While there is a good selection of beers on tap and by the bottle, oenophiles may be disappointed, as the wine choices were rather limited.\n\nFor deep dish pizza, Little Star is really a star.", "rating": 5, "date": "2013-12-30"}, {"excerpts": ["I came here with some seasoned regulars, who ordered the spicy chicken wings (which are a bit dry but come with blue cheese sauce) and two thin cornmeal crust pizzas to share.\n\n"], "author": "Tiffany W.", "review": "Yes, yes, yes!!!!!!!\n\nThe hype is real. Little Star Pizza is a shining beacon of hope in San Francisco's pie world.\n\nI came here with some seasoned regulars, who ordered the spicy chicken wings (which are a bit dry but come with blue cheese sauce) and two thin cornmeal crust pizzas to share.\n\nI can't speak for the deep dish, but the thin crust pizzas are so. damn. good. I can't get over how flavorful the cheese is?! And garlic olive oil base is brilliant.\n\nLittle Star truly takes pizza to another level -- one that does SF proud! Even the New Yorker at the table agreed.", "rating": 4, "date": "2014-10-02"}, {"excerpts": ["We sat down and I ordered (split between two) the spicy chicken wings with the Little Star Deep Dish Pizza with a nice beer. ", "The wings were awesome. ", "Deep fried perfectly so the skin is soo nice and crispy! ", "The wings had just enough spicy for a good kick. ", "The pizza was delicious! ", "Very hearty with a lot of spinach. ", "I couldn't get through three slices without tapping out. ", "And for about 25 bucks (splitting wings, pizza, beer, and tip) ", "I say it was a successful post New Years Meal. ", "I will be coming back very soon"], "author": "Andy H.", "review": "Prior to my experience here, I've never had deep dish pizza before. Sacramento isn't known for their deep dish pizza so I never bothered to try it. After our New Years festivities, we decide to try this place for a hearty meal. This place is a little bit hard to find because there outside is pretty plain with a small sign in front. The inside is very nice with a bar and wood tables. It only fits about 30 people max so it may not be ideal if you have a large group of 10+.\n\nWe sat down and I ordered (split between two) the spicy chicken wings with the Little Star Deep Dish Pizza with a nice beer. The wings were awesome. Deep fried perfectly so the skin is soo nice and crispy! The wings had just enough spicy for a good kick. The pizza was delicious! Very hearty with a lot of spinach. I couldn't get through three slices without tapping out. And for about 25 bucks (splitting wings, pizza, beer, and tip) I say it was a successful post New Years Meal. I will be coming back very soon", "rating": 5, "date": "2014-01-08"}, {"excerpts": ["Spicy Chicken Wings ($11)\n", "1lb of slightly seasoned chicken wings that was either heavily peppered or slighlty brunt. ", "Good flavor but dont expect it to be your traditional buffalo wings. "], "author": "Robert Y.", "review": "Zachary's is better\n\nCame here to get their famous chicago style deep dish pizza. The decor here is dim for a slightly romantic atmosphere.\n\nSpicy Chicken Wings ($11)\n1lb of slightly seasoned chicken wings that was either heavily peppered or slighlty brunt. Good flavor but dont expect it to be your traditional buffalo wings. 3.5/5\n\nMediterranean Chicken chicago pizza ($20 for a small 9')\nI think this pizza would have benefited greatly if they used a white sauce instead but the flavoring isnt as good as zachary's. The freshness was there but I felt something was missing. 3/5\n\nOverall, decent place for pizza with the a decent selection of deep dish and thin crust but not the best around.", "rating": 3, "date": "2013-12-14"}, {"excerpts": ["Shared an order of the spicy chicken wings.  "], "author": "Dan H.", "review": "Deep dish leads to overfull bellies.\n\nOverall, amazing.\n\nWe started with a few drinks, beer and wine, nothing exciting, just what you'd want while digging in to deep dish.\n\nShared an order of the spicy chicken wings.  Great flavor and looked like they had been thrown on the grill for a second which gave them an awesome slightly charred and smokey flavor.\n\nThe dish.  \n\nWe ordered two small pies (definitely enough for 3 people) Mediterranean chicken and a Cheese with Pepperoni and Sausage.  Both pizzas were amazing. The biggest surprise for me was the crust as it seemed to be cornmeal based which was awesome.  One of my dining companions mentioned that some people get honey to eat with the crust (which I can understand it, but still thought it was weird.)\n\nBoth were loaded with cheese and just the right amount of sauce, filled with toppings.  The Chicken had artichokes, red bell peppers, feta cheese and olives, and we added pepperoncini too.\n\nI'd definitely return to indulge and maybe I'll bring a small bottle of honey too..", "rating": 4, "date": "2014-06-13"}, {"excerpts": ["We also got the spicy chicken wings which had a nice bite to it.\n\n"], "author": "Amberlynn A.", "review": "Little star is a cute little place with a classy dimmed ambiance at night that's perfect for a date night and a friendly laid back staff.\n\nI went here with some friends and ordered a large deep dibs pizza half classic and half little star. Both were pretty good. We also got the spicy chicken wings which had a nice bite to it.\n\nI took one star away because they don't have ranch or honey. It's crazy to me that a pizza place does not have ranch at all, instead they use bleu cheese dressing. Not having honey is a little more understandable but the crust does taste much better with it. I'll probably be back but next time I'll be sure to bring my own condiments.", "rating": 4, "date": "2014-03-20"}, {"excerpts": ["Seated and ordered the spicy chicken wings, a deep dish large brass monkey pizza, and the thin crust large italian combo small pizza. ", "Was debating on getting 2 larges but the waiter was nice enough to say I think that would be too much food (which is nice of him, cause he really didn't have to). ", "The chicken wings were alright, kind of forgettable... ", "but I guess they aren't known for their chicken wings. ", "I've never had a deep dish pizza ", "so this was my first ", "and it did not disappoint. ", "Sure, it was hard to eat ", "(I just gave up and ate with my fork) but it was pretty good. ", "I'm not a huge pizza fan, so I can't go into too much detail, but it was definitely pretty good and worth the wait... ", "I can see why some people go crazy over this place. ", "The Italian combo pizza was good too... just because it had a variety of toppings that complimented each other. ", "Deep dish or thin crust... ", "I think I'm more of a thin crust kind of guy... just because I felt like I was eating a quiche while I was eating the deep dish pizza. ", "May come back to try the little star pizza (but it's basically the same as brass monkey except there is sauage in it) and other pizzas. ", "Worth a try if you're not starving and willing to wait a bit for some pizza!"], "author": "Johnson S.", "review": "Been meaning to try this place for the longest time and finally had the chance to. Came on a Friday night around 7, luckily we found parking right away. Sat and waited about 30-45 minutes for a party of 4. Seated and ordered the spicy chicken wings, a deep dish large brass monkey pizza, and the thin crust large italian combo small pizza. Was debating on getting 2 larges but the waiter was nice enough to say I think that would be too much food (which is nice of him, cause he really didn't have to). The chicken wings were alright, kind of forgettable... but I guess they aren't known for their chicken wings. I've never had a deep dish pizza so this was my first and it did not disappoint. Sure, it was hard to eat (I just gave up and ate with my fork) but it was pretty good. I'm not a huge pizza fan, so I can't go into too much detail, but it was definitely pretty good and worth the wait... I can see why some people go crazy over this place. The Italian combo pizza was good too... just because it had a variety of toppings that complimented each other. Deep dish or thin crust... I think I'm more of a thin crust kind of guy... just because I felt like I was eating a quiche while I was eating the deep dish pizza. May come back to try the little star pizza (but it's basically the same as brass monkey except there is sauage in it) and other pizzas. Worth a try if you're not starving and willing to wait a bit for some pizza!", "rating": 4, "date": "2014-11-08"}, {"excerpts": ["Another great selection are their thin crusts pizzas, hearty salads, and their good old fashion spicy chicken wings. ", "If you live in the neighborhood and haven't tired this place, try it out you don't know what you are missing. ", "However if you live not in the neighborhood ", "I\nI suggest taking Muni"], "author": "Krishan S.", "review": "I'm so lucky to live close by to this laid back hip place! Otherwise I'll be driving in circles for hours looking for a spot (perk for living in the Western Addition). Hands down the best pizza place in the city. I always order their Deep Dish Pizzas and always yearn for more when I finish the entire pie! Their cornmeal crusts is flaky, fresh and best of all not heavy! Another great selection are their thin crusts pizzas, hearty salads, and their good old fashion spicy chicken wings. If you live in the neighborhood and haven't tired this place, try it out you don't know what you are missing. However if you live not in the neighborhood I\nI suggest taking Muni", "rating": 5, "date": "2013-07-29"}, {"excerpts": ["We also tried the spicy chicken wings, which were solid though they were pretty mild. ", "I wish we'd tried one of the pizzas as a thin crust pizza-- ", "the thin crusts on the other tables looked really good, but I was incredibly satisfied with our deep dish extravaganza. ", "I guess I'll have to come back to try more! ", ":)"], "author": "Erin S.", "review": "This pizza is incredible. We went on a Wednesday at around 7:30 and there was no wait (though it was pretty busy). The deep dish takes a while, but it's worth waiting for. Our group tried the Little Star, the Pesto Chicken, and the Meateor all as deep dish pizzas, and oh my god were they delicious. Surprisingly, my favorite was the Little Star, despite the fact that it's meatless! We also tried the spicy chicken wings, which were solid though they were pretty mild. I wish we'd tried one of the pizzas as a thin crust pizza-- the thin crusts on the other tables looked really good, but I was incredibly satisfied with our deep dish extravaganza. I guess I'll have to come back to try more! :)", "rating": 5, "date": "2015-08-14"}, {"excerpts": ["I recommend complementing the pizza with an order of spicy chicken wings.\n\n"], "author": "Alfred L.", "review": "My favorite pizza spot in SF. \n\nIf its your first time here, you must get the Little Star deep dish. The sauce and the corn crust was unbelievable. Once you've had that, also try the Mediterranean chicken deep dish. A large deep dish is enough to feed four hungry people. What I usually do if I want to have some variety: ask to have half the pizza with one style and the other half with another.\n\nI recommend complementing the pizza with an order of spicy chicken wings.\n\nIf its nice out, get your pizza to go, get a six-pack, and eat at Alamo square!", "rating": 5, "date": "2013-06-16"}, {"excerpts": ["But the real surprise are the Spicy Chicken wings. ", "These are done just right with the balanced combination of spicy/sweet and tender and juicy on the inside. "], "author": "J N.", "review": "We've been at Little Star a few times and haven't been disappointed. Of course, their deep dish pizzas are the star here. The crust is always a great combination of the right crispiness (never soggy) and nutty butterness. You can't go wrong with any but our favorite are the Classic and the Mediterranean Chicken. But the real surprise are the Spicy Chicken wings. These are done just right with the balanced combination of spicy/sweet and tender and juicy on the inside. If you love wings, you can't miss these wings. \n\nService is friendly, efficient but not fussy. Parking is sometimes tough in the evenings but not impossible.", "rating": 4, "date": "2013-02-24"}, {"excerpts": ["We tried spicy chicken wings and pesto chicken pizza, both were great. ", "Definitely coming again."], "author": "Manveer C.", "review": "It has nice casual ambience and friendly hospitality. But more than that food was good, after all that is what you go to restaurant for. We tried spicy chicken wings and pesto chicken pizza, both were great. Definitely coming again.", "rating": 5, "date": "2014-12-08"}, {"excerpts": ["So we ordered a couple of appetizers to share, including their Spicy Chicken Wings (not to be confused for Buffalo style), and the Caprese salad, the latter of which was the highlight of the menu.  ", "The chicken wings could best be described as gummy, but somewhat tasty; certainly no more appealing than what you can get at Original Buffalo Wings further down Divisadero at Lombard Ave... "], "author": "Brian B.", "review": "First off, huge kudos to all of the staff, from the host who courteously and patiently kept us updated on the substantial waiting list, to the awesome girl at the take-out bar and to Patrick, our waiter.  Based on the plethora of 5-star reviews and the considerable delay for a table, I anticipated nothing less than the \"Soup Nazi\" treatment from the staff; I was pleasantly surprised.\n\nMy buddy and I were wisely advised by the many reviews here, to pre-order the deep-dish pizza in advance, since it takes 35 minutes to prepare.  This was good planning, as we were famished, and luckily we got a table at just around the 30 minute mark; pizza arrived about 10 minutes later.  So we ordered a couple of appetizers to share, including their Spicy Chicken Wings (not to be confused for Buffalo style), and the Caprese salad, the latter of which was the highlight of the menu.  The chicken wings could best be described as gummy, but somewhat tasty; certainly no more appealing than what you can get at Original Buffalo Wings further down Divisadero at Lombard Ave... I think we ate about three of them, and tossed the rest.\n\nBut really, it's about the pizza.  If this represents the best that San Francisco has to offer, then by all means avoid the city like the plague when you have a pizza craving.  While the pie was hearty and loaded with all the stuff your cardiologist warned you about, it wasn't worth the indulgence.  Sausage that tasted on the verge of its expiration date, ditto for the pepperoni; a lumpy layer of acidic and metallic-tasting tomato sauce; chicken that was roasted to dry flavorless-ness; and a dry cornmeal crust that reminded me of muffins that were on the clearance rack at Safeway.  I think if we weren't nearly starving by the time  this pie was served, this wreck would have gone back to the kitchen for a re-do.  It was edible in a pinch, but barely so.\n\nAgain, thank you to all the staff for being courteous.  We tipped 20%, but it would have been nice if the waiter actually asked or cared about the mediocrity he served, but I think he already knew.  Stick to North Beach; there are a handful of places that can make a reasonably tasty pie, even if its only thin-crust.", "rating": 2, "date": "2013-05-25"}, {"excerpts": ["The spicy chicken wings app is also a must try.", "We always get a large deep dish and a large thin crust because it is so nice to have leftovers the next day.\n", "They don't take reservations,and although the wait may be long,it is totally worth it. ", "Have a drink and play some tunes on the jukebox."], "author": "Shelley M.", "review": "Absolutely the best pizza in town..the classic is awesome,add garlic for some extra flava! Also try the Little Star with ricotta and feta,delicious!! The spicy chicken wings app is also a must try.We always get a large deep dish and a large thin crust because it is so nice to have leftovers the next day.\nThey don't take reservations,and although the wait may be long,it is totally worth it. Have a drink and play some tunes on the jukebox.", "rating": 5, "date": "2012-04-28"}, {"excerpts": ["We were hungry, famished really, so we ordered the $8 Spicy Chicken Wings as an appetizer. ", "Unlike those served at honky-tonk bars across this great land of ours, these were blessedly not greasy, and the spiciness provided a great kick even when doused in the cooling blue cheese dressing. ", "I would have licked the ramekin dry ", "had I not realized I was in public. ", "Oh...", "and I ate the accompanying mini-carrot sticks "], "author": "Ed U.", "review": "You must be my Little Star\n'cause you shine on me even though you're far\nI just think of you and I start to grow\nAnd I need your special pie\nAnd baby, you know...\n\nFor my 400th review - count 'em 400 (...and I do get depressed thinking of all the time I could have spent solving world peace) - I decided to review Little Star Pizza because I had never tried it before last evening. Ever since I saw Nish wax on about it on \"Check Please! Bay Area\", I had been curious what the fuss was all about. But like many who caught sight of the place from the outside, I merely shrugged at the sight of the waiting throngs.\n\nYesterday was a particularly blustery day, and Little Star was not even our first choice. I had actually been meaning to try the bar burger at NOPA. Even though both places open at 5PM, NOPA doesn't serve food until 6, so alas, that will have to wait for another time. Even at a scant 2 1/2 blocks between establishments, it was like barreling through a wind tunnel on Divisadero, though I was heartened to see that Lilly's Bar-B-Q finally replaced their old Brothers-in-Law sign.\n\nIf you wait about ten minutes before 5, you get the privilege of waiting in the little cove of a doorway. One by one, the staff - all very skinny and on bicycles (...I hate them) - give the secret knock and enter the door, as we shiver in the cold wind. Jamie W. and I got dibs on the table next to jukebox. No reason except it provided a bit more light than the ones in the back, and we ended up dodging a bullet when a gaggle of shrieking, South Asian girls galumphed toward the back... apparently to raise the decibel level of the place several inches.\n\nWe were hungry, famished really, so we ordered the $8 Spicy Chicken Wings as an appetizer. Unlike those served at honky-tonk bars across this great land of ours, these were blessedly not greasy, and the spiciness provided a great kick even when doused in the cooling blue cheese dressing. I would have licked the ramekin dry had I not realized I was in public. Oh...and I ate the accompanying mini-carrot sticks so I could pretend I had a vegetable.\n\nGiven the excessive protein content of our appetizer, we went for the small Little Star Special ($17), a smart choice as it turns out. I refuse to call it Chicago-style pizza since a meal at Giordano's or Gino's East could hardly be more different. First, the crust was a lot lighter and crunchier than a standard-issue deep-dish pizza with a cornmeal flavor and consistency similar to what they served at Nancy's in Chicago.\n\nSecond, the filling was a lot fresher-tasting, not the heavy tomato sauce I would normally associate with deep-dish pizza. In fact, the fresh tomatoes used in the sauce moistened the bottom just enough to make the crust that much easier to chew without overwhelming it. The equally fresh spinach had obviously been reduced and then mixed with ricotta, feta and sauteed onions. The combination was ideal, and if a deep-dish pizza could ever taste light, they actually achieve that objective here.\n\nI like the place, even though it was a bit too trendy-dark for my taste. Definitely go as early as you can to avoid the inevitable wait. But if you wait, rest assured, your patience will be rewarded. This is one place where the hype may actually be warranted because...\n\nPie light, pie bright, first pie I ate tonight\nPie light, [Pie bright!] makes everything all right\n\nFOOD - 5 stars...worthy of the hype, at least as far as the Little Star Special and chicken wings are concerned\nAMBIANCE - 4 stars...a bit dark, a bit crowded..but a warmish, welcome vibe all things considered\nSERVICE - 4.5 stars...fast and unobtrusive...perhaps to increase turnover but met my needs for a relatively quick meal\nTOTAL - 5 stars...Nish is right yet again", "rating": 5, "date": "2007-05-27"}, {"excerpts": ["Spicy Chicken Wings. ", "Beers. ", "Wine. "], "author": "Patricia G.", "review": "Dinner for four. Large Italian Combo Deep Dish.  Spicy Chicken Wings. Beers. Wine. Done.\n\nWait was what it was, a wait.  Parking was a challenge but there's a parking garage next door for $10.  One restroom.\n\nIt's no Chicago Deep Dish. Zachary's still takes the win in comparison. Still, not bad.", "rating": 3, "date": "2012-04-11"}, {"excerpts": ["Spicy Chicken Wings - pound of wings served with baby carrots and blue cheese dressing.  ", "Chicken wasn't very spicy.  ", "They give you 5 pieces of baby carrots.  "], "author": "Shannon L.", "review": "REVIEW IS FOR TAKEOUT ONLY.\n\nNow the \"just okay\" 3 stars could be the fact that I waited 30 minutes to actually eat the pizza because of the long drive home.  But it's also because they messed up on one of our pizzas.  They gave us a thin crust instead of a deep dish and I really wanted to try the deep!  The take out counter people were very friendly and the wait for our pizza was only 20 minutes!\n\nMediterranean Chicken - chicken breast, artichoke hearts, red bell peppers, green olives, onions, feta.  Very good!  All ingredients went well together and didn't overpower each other (I was worried about the olives because they were cut bigger than normal, the artichoke hearts which can be tart & the feta which is just strong in general).  I couldn't taste the feta distinctively in any bite so they must incorporate it throughout the sauce.  Overall, a very unique pizza and delight to eat.\n\nPesto Chicken - pesto, roasted chicken, mushrooms, onions.  This was okay.  The pesto is very lightly distributed on the pizza.  Tasted generic.\n\nSpicy Chicken Wings - pound of wings served with baby carrots and blue cheese dressing.  Chicken wasn't very spicy.  They give you 5 pieces of baby carrots.  Nothing special.\n\nDon't get me wrong.  I definitely want to come back for a dine-in visit and see what the pizza is like... deep dish and FRESH.\n\n**Note: They only take cash but there's an ATM machine instead with a transaction fee of only $.25!!  Amazing.", "rating": 3, "date": "2008-05-18"}, {"excerpts": ["In addition to deep dish pizzas, Little Star's menu also includes thin crust pizza, a variety of topping options, garlic bread, spicy chicken wings, cheesecake and gelato. \n\n"], "author": "Cathy K.", "review": "Wonderful deep dish pizza with a cornmeal crust. We had the signature Little Star Pizza ~ spinach-ricotta-feta blend with mushrooms, garlic and onions topped with a delicious tomato sauce. I enjoyed its flavor and cornmeal texture. \n\nThe mixed green salad was a nice balance to the pizza. \nIn addition to deep dish pizzas, Little Star's menu also includes thin crust pizza, a variety of topping options, garlic bread, spicy chicken wings, cheesecake and gelato. \n\nLocations in San Francisco's Western Addition & Mission Districts, as well as Albany in the East Bay. This place is popular, so expect a wait, but highly recommended.\n\nPS: Even the cold leftovers were good for breakfast the next day.", "rating": 4, "date": "2010-09-05"}, {"excerpts": ["We ordered the garlic bread, spicy chicken wings and two large deep dish pizzas, one Classic and one Mediterranean Chicken.  ", "Awesome, awesome, and double awesome.  ", "This is probably the best pizza I have had so far in the city.  "], "author": "Grant W.", "review": "So worth the wait!\n\nI came here on a Friday with a big group, so the wait was quite long.  The waitress let us pre-order as we waited for our table to free up so we wouldn't have to wait as long for our food.\n\nWe ordered the garlic bread, spicy chicken wings and two large deep dish pizzas, one Classic and one Mediterranean Chicken.  Awesome, awesome, and double awesome.  This is probably the best pizza I have had so far in the city.  The pizza crust was crispy (unlike other deep dish pizzas I've tried) and the toppings were fresh and chunky.\n\nBy the end of the meal, I was completely stuffed, but at the same time, tempted to eat one of the remaining pizza slices.  My brain and stomach were playing a chess match to determine the fate of the remaining pizza slices.  Stomach to brain: check mate.", "rating": 5, "date": "2011-10-25"}, {"excerpts": ["Also love the spicy chicken wings, great heat, not greasy dunked in the blue cheese=scrumptious. ", "Wine selection, on tap, is great. ", "If u don't want to travel to tony's in north beach try this restaurant."], "author": "Kelly K.", "review": "Second time here, just as great and used my previous yelp review to order the white pizza again. Love the thin crust, great garlic tang and topped with seasonal veggies. Also love the spicy chicken wings, great heat, not greasy dunked in the blue cheese=scrumptious. Wine selection, on tap, is great. If u don't want to travel to tony's in north beach try this restaurant.", "rating": 5, "date": "2012-09-02"}, {"excerpts": ["we had:\nspicy chicken wings: this plate had ONE POUND of chicken!! ", "sooo much. ", "and it was suuureeee ", "SPICY!!!", "! ", "they didnt have ketchup on the table but they were nice enough to find some in the kitchen for me because chicken cannot be eaten without ketchup! ", "all in all. "], "author": "Linda N.", "review": "theee best deep dish pizza i've ever eaten. \n\nwe decided to come here because so many people raved to us about it but i was never a deep dish pizza kind of girl because my previous experence was not that great in palo alto. so since it was date night, we tried it anyways.\n\nthe restaurant is small and cozy which is very different from a pizza place. we were seated right away and the menu was pretty small so there wasnt much of a variety.\n\nwe had:\nspicy chicken wings: this plate had ONE POUND of chicken!! sooo much. and it was suuureeee SPICY!!!! they didnt have ketchup on the table but they were nice enough to find some in the kitchen for me because chicken cannot be eaten without ketchup! all in all. it was sooo good.\n\ndeep dish pizza with pepporoni, mushroom, sausage, and chicken: the crust was crispy and the inside was moist and sooo good. it had mozarella cheese and tomato sauce on top but it wasnt TOO MUCH..it was JUSt enough and the taste was just undescribably good. we ordered a small and was STUFFED. \n\ndinner was about 30 bucks with tip. and there was soo much food. soo worth it!!!", "rating": 5, "date": "2010-10-12"}, {"excerpts": ["Spicy chicken wings, a good portion", ", I didn't count how many, but i would presume there was around 10? delicious and didn't even need the ranch! ", "However, by the time I had finished these (shared) "], "author": "Celine L.", "review": "One of the TOP TWO pizzas i've had. The other winner goes to a popular pizza joint in NY. I've never been to chicago, so i don't know how chicago pizza is. I do not like deep dish. I much prefer THIN crust pizza.\n\nBut whoa. This blew me away!\n\nGot here on a late sunday afternoon, around 5.30pm. Parking wasn't good and had to park like 4 blocks away. It was surprisingly a full house for being 5.30pm. \n\nOrdered the garlic bread and spicy wings, which was brought out speedily.\n\nGarlic Bread, the bread was warm but nothing special. However, the butter was melted to perfection. The garlic was, well, a softened whole garlic, which is plenty for your bread and guaranteed stinky breaths!\n\nSpicy chicken wings, a good portion, I didn't count how many, but i would presume there was around 10? delicious and didn't even need the ranch! However, by the time I had finished these (shared) I was regretting the order of 2 appetisers.\n\nThe pizza took about an additional 10 minutes. I didn't think it looked big, only 12\" long (that's what she said =p) By long, i mean in diameter! But after the first slice, even if you skip the crust...you remember, it is a deep dish with an overload of ingredients on it, leaving the quest to finish the pizza to be a very daunting task. Actually, impossible after eating the two appetisers. I only managed to squeeze in 2 slices and was full for the next 12 hours. Meanwhile, my bf finished 3 slices. The pizza was indeed, very well made. The crust wasn't soggy at all. The best of the pizza was somewhat crunchy and a great foundation for the pizza. I personally preferred the Little Star, even though it lacked the meat, it was filling enough. the Mediterranean chicken had a little sourness from the artichoke and i didn't think it matched well. Overall though, incredibly well made! Water, which was essential, was refilled every so often. \n\nWhat's even more amazing was that after 3 days, I had 3 slices of pizza left. I microwaved a slice for 1 minute and toasted it in my toaster oven for another 10 minutes in 350 degree. It was still very good! Not soggy at all! Amazing!\n\nThey accept card now!!! Thank goodness! But the ATM is only $0.25 anyways.\n\n***\n\nTips: Get the little star, get the garlic bread, get the wings, dare i say one of the best wings and pizza ever! One appetizer to share, with a large pizza is enough for 2! Leftovers aren't that bad. Get half and half! Weekends, come early and you wouldn't have to wait for a seat.\n\nFavorites: Little star pizza and chicken wings!\n\nDo not want: Too full. Garlic bread was too stuffy. A little plain on the bread. I expected more?\n\nLast words: Come and get a pizza, you will not regret it!", "rating": 5, "date": "2010-05-27"}, {"excerpts": ["We ordered a small Classic for the two of us, along with some Spicy Chicken Wings to tide us over while they made the pizza.  ", "The pizza itself was very good, with the perfect blend of tomato sauce and sausage, onion, bell peppers, and my personal favorite, mushrooms.  ", "The only negative was the crust, which was a bit crumbly ", "and just didn't feel right for some reason.  ", "The chicken wings were pretty average, though they were mildly spicy and had a good kick.  "], "author": "Aaron T.", "review": "1 star to start.\n\nFood (1 star):\nWe came here for one thing and one thing only, the deep dish pizza.  We ordered a small Classic for the two of us, along with some Spicy Chicken Wings to tide us over while they made the pizza.  The pizza itself was very good, with the perfect blend of tomato sauce and sausage, onion, bell peppers, and my personal favorite, mushrooms.  The only negative was the crust, which was a bit crumbly and just didn't feel right for some reason.  The chicken wings were pretty average, though they were mildly spicy and had a good kick.  The blue cheese dressing that came with them was a nice addition.\n\nService (0.5 stars):\nThe service was alright here, they were very busy so we had to wait a while to get the attention of our waiter whenever we needed something.  Because of the long wait, they took our order while we were waiting so it wouldn't take as long to get our food, but it still took about 20 minutes after we were seated.\n\nValue (0.5 stars):\nPrices here are almost the same as the local competition (Zachary's, Patxi's).  A small deep dish was more than enough for two people, and the chicken wings were plentiful though a bit on the pricey side.\n\nExperience (0.5 stars):\nThe restaurant is located in the Mission and we had a really hard time finding parking.  It was very crowded inside, though it was a Saturday night, and there was a nice waiting area.  The restaurant is quite dark inside and tables feel rather crowded as well, unnecessarily so.  Overall, we had a good experience here and wouldn't mind coming back.\n\nOverall:\n1.0 - Baseline\n1.0 - Food\n0.5 - Service\n0.5 - Value\n0.5 - Experience\n=============\n3.5 stars", "rating": 4, "date": "2010-05-26"}, {"excerpts": ["After we got to our table, we also decided to get the spicy chicken wings. ", "I was hoping our pizza was gonna come in the next few minutes. "], "author": "Derrick L.", "review": "It's good pizza, but it doesn't exactly blow me away like I thought I would be. \n\nWe came here on a Friday night at around 6:45. Our wait was close to about 25 minutes and the lady told me that if I ordered first, she'll send it to the kitchen so it should arrive when we get seated. I liked this idea because my gf and I were very hungry and the thought of being able to eat as soon as we sit was great.\n\nWe decided on the vegetarian deep dish and added sausage. After we got to our table, we also decided to get the spicy chicken wings. I was hoping our pizza was gonna come in the next few minutes. Nope. \n\nAfter about 20 minutes, our chicken wings came. These were really good! Spicy but not the kind of spicy that you get from hot sauce or chili, spicy due to some undetectable spices that they coat the chicken in before baking. It hits your tongue but sort of in an indirect way. The heat is definitely there but it isn't overwhelming, it peaks then it slowly disappears, leaving you all confused and wanting to chomp down on the next one. I sensed some cumin and the gf sensed some celery root or coriander. Definitely a puzzler. \n\nAfter about 30 minutes our pizza finally arrived. It looked great! It was sauced nicely and the crust looked amazing with the flecks of cornmeal on it. So I took a bite, and it was good, you definitely know it was a vegetarian pizza because there was a lot of different textures from the zucchini, mushroom, and I forget what else was in there. The sausage was a bit bland, and maybe overpowered by the veggies. So after the initial slice, everything started to just wear off. I guess this place is the kind of place where you come with a big group, order a bunch of pies, and then try a slice each. It's good, and I'll definitely be back to try the thin crust pizzas.", "rating": 4, "date": "2010-05-13"}, {"excerpts": ["The order was: \n\n* Spicy Chicken Wings - Pound of wings served with baby carrots and blue cheese dressing $10.50 (4 of 5) Good flavors and spicy. "], "author": "Janice T.", "review": "Solid 3.5. Dark and cozy pizzeria on Divisadero Street. Good for dining in and serves great selection of wine/beer/light champagne cocktails. I would recommend for date night, but it is a little too cheesy for a first date. \n\nThe order was: \n\n* Spicy Chicken Wings - Pound of wings served with baby carrots and blue cheese dressing $10.50 (4 of 5) Good flavors and spicy. Had spicy heat but it was not overwhelming. Tasty. And delicious with beer. I totally recommend this. \n\n* Half and half 9 inch thick crust (3 of 5) \n** Half Mediterranean Chicken - Chicken breast, artichoke hearts, red bells, green olives, onions, feta $19.50/2 \n** Half Classic - Sausage, mushrooms, onions, green bells $19.25/2\n\nSo the 9 inch was a good size three people. There are six slices and it takes about 25 minutes to come to the table. Mind your timing. The dough was very different. The dough is probably the thinnest thick crust I ever tried. And the sides were very light, airy, and crunchy. Similiar texture to a biscotti, but with much more finer pores in the dough. The sauce was chunky with lots of tomatoes. And I though this chunky sauce perfectly complimented its crunchy crust. It reminded me of how well the Tostito Scoop works with a scoop of thick salsa. It just holds the fillings perfectly. It was amazing dough and sauce. But the pizza fillings weren't strong enough for me. I ordered half and half, but I could barely taste the difference since both sides were heavy filled with the chunky tomato sauce. It looked like they lined the pizza with the cheese, then the fillings, and then topped it with the chunky tomato sauce. When it is presented on the table, you just saw a lot of tomato sauce. No doubt, it was good crust and sauce, but I don't feel like I tasted any  sausage or chicken.  \n\nOn another note, there was lots of cheese on the bottom layer of the pizza and I find myself twirling the cheese 3 to 5 times before I was able to break it off. This pizza is definitely a fork and knife kind of meal.\n\nThis was a darling fun place and if you are a fan of thick crust and lots of tomato, I  definitely recommend trying this place.", "rating": 4, "date": "2012-09-10"}, {"excerpts": ["We ordered the spicy chicken wings (plentiful and YUM) and the small veggie pizza. ", "I kinda regret not getting a meat pizza, but the veggie was absolutely DELISH. ", "You know how you eat pizza ", "and there's always the crusts on everyone's plate afterwards? ", "Not with these pizzas! ", "Cornmeal crust = completely devoured.  \n", "Only downside was that it's very dark and LOUD inside, but it's so nice and chill, food is great, it's not deserving of less-than-five rating."], "author": "Christine Y.", "review": "Aww! I just read the tues/wed night half off pizza with an appetizer deal! Dayam... Ah well, this place was worth every penny, but a pizza for $9??!! Woulda been amazing... \nService was awesome, very nice, laid-back guys who look like they all ride fixies to and from work, welcomed me and my friend in and seated us right away. We ordered the spicy chicken wings (plentiful and YUM) and the small veggie pizza. I kinda regret not getting a meat pizza, but the veggie was absolutely DELISH. You know how you eat pizza and there's always the crusts on everyone's plate afterwards? Not with these pizzas! Cornmeal crust = completely devoured.  \nOnly downside was that it's very dark and LOUD inside, but it's so nice and chill, food is great, it's not deserving of less-than-five rating.", "rating": 5, "date": "2010-07-20"}, {"excerpts": ["And then you can take it back home and watch a movie while you eat your Little Star deep dish, spicy chicken wings, or whatever else you decide to imbibe on that evening.\n\n"], "author": "Tommy C.", "review": "Oh man, do I ever miss this place.\n\nWhen I moved to LA I mourned the loss of Little Star. I can count on one hand the times I actually got a table there -- the fact that they don't take reservations really needs to change, 'cause standing around waiting for hours (literally, sometimes) for a table is ridiculous -- but you just get around that by calling in your order and walking there to pick it up if you live in the neighborhood. And then you can take it back home and watch a movie while you eat your Little Star deep dish, spicy chicken wings, or whatever else you decide to imbibe on that evening.\n\nThe chunks of tomatoes they throw on there for the sauce and the layers of cheese and garlic embedded in the toppings made me change my mind forever about my previous preference for thin pies. I had moved to San Francisco from New York, where pizza is praised for its foldable, gargantuan slices. I wasn't ready for the greatness of  a Little Star deep dish. I had to be persuaded, and it only took a few bites before I was convinced. \n\nBe forewarned, you will be THIRSTY after consuming those salty (delicious) tomatoes and that buttery crust. But that's not necessarily a bad thing, and it's a small price to pay for damn good pizza.", "rating": 5, "date": "2010-11-25"}, {"excerpts": ["and the spicy chicken wings.\n\n"], "author": "Danielle A.", "review": "maybe our expectations were too high, the deep dish pizza was certainly good, but it didn't blow us away.\n\nwe got half little star and half cheese with meat. and the spicy chicken wings.\n\neverything was delicious, and reasonably priced, but just wouldn't say it is the best pizza ever just yet.", "rating": 3, "date": "2014-07-04"}, {"excerpts": ["We started with garlic bread and spicy chicken wings, which were both yummy, and then ordered two pizzas:\n\nDEEP DISH: "], "author": "Dana D.", "review": "This place is amazing.  We started with garlic bread and spicy chicken wings, which were both yummy, and then ordered two pizzas:\n\nDEEP DISH: Classic - Sausage, mushrooms, onions, green bells\n\nTHIN CRUST: White Pie - Garlic olive oil base, mozzarella, roasted zucchini, fresh tomatoes, feta\n\nThe white pie was one of the best pizzas I've ever tasted!  We had ordered a large but they brought out a small (plus the large deep dish - which ended up being more than enough for 4 adults.  Because of the screw up they ended up comp'ing our large deep dish which was not necessary).  \n\nEven if they hadn't comp'd one of the pizzas, I would have still given the service 5 stars.\n\nI'll definately be going back here more frequently!", "rating": 5, "date": "2009-11-30"}, {"excerpts": ["Spicy chicken wings are quite good as well."], "author": "Mara B.", "review": "The Little Star special is our favorite. Delicious cornmeal crust. Spicy chicken wings are quite good as well.", "rating": 4, "date": "2012-04-28"}, {"excerpts": ["We ordered the Spicy Chicken Wings and a small deep dish Classic Pizza and were stuffed and happy by thte time we left.  ", "Friendly, fast service as well (excluding the wait)!"], "author": "Keika L.", "review": "\"For 2, name's Keika.\"\r\n\"Just letting you know, it's going to be at least a half hour wait.\"\r\n\"THAT'S FINE WITH ME!\" I said with a big-ass smile.\r\n\r\nAnd WHY do you ask was I willing to wait 30 minutes for a pizza pie?  Because of all the hype I heard from friends and Yelpers about how f'in good this place is AND I drove out there on a weeknite to avoid the weekend crowd!  They don't take reservations AND it's cash only...but I didn't give a hoo-ha.  We ordered the Spicy Chicken Wings and a small deep dish Classic Pizza and were stuffed and happy by thte time we left.  Friendly, fast service as well (excluding the wait)!", "rating": 5, "date": "2006-10-04"}, {"excerpts": ["We were promptly seated and then ordered of course the deep dish pizza and an order of spicy chicken wings. ", "The deep dish was a bit disappointing...", "I guess that's what happens when things are hyped up. ", "I was expecting some sort of fiesta in my mouth but it never came. ", "The chicken wings were actually pretty good. ", "Pizza on the otherhand, could have been better. ", "I think the sauce was a bit too tart for my taste and needed more of a marinara zing to it. ", "The pie itself did look very appetizing. ", "Maybe a different combination would have made a difference? ", "Prices aren't to die for either. ", "Pretty reasonable. "], "author": "Stine H.", "review": "It's pretty easy to miss this little place. We actually drove by 3 times looking for parking and were still unable to locate where little star was. That was until I actually spotted a \"little star\" and I got a little peek inside the restaurant. Place seemed a bit like those shady night clubs where they open a little slit and ask you for a password before you come in. Just my opinion. \n\nWe found parking a lot easier than we were anticipating which was good because SF street parking could be a little B. We got in, the restaurant seemed to be lit only by natural sunlight haha. Not super crowded on a Thursday evening. We were promptly seated and then ordered of course the deep dish pizza and an order of spicy chicken wings. The deep dish was a bit disappointing...I guess that's what happens when things are hyped up. I was expecting some sort of fiesta in my mouth but it never came. The chicken wings were actually pretty good. Pizza on the otherhand, could have been better. I think the sauce was a bit too tart for my taste and needed more of a marinara zing to it. The pie itself did look very appetizing. Maybe a different combination would have made a difference? Prices aren't to die for either. Pretty reasonable. I don't think the pizza is good enough for me to crave in the future though.\n\n3.5 stars", "rating": 4, "date": "2010-07-04"}, {"excerpts": ["The spicy chicken wings are amazing as well. ", "Nice selection of beer. ", "Love the atmosphere. ", "Kinda easy to miss if you're just driving by, but if you find it you'll be in love! ", "The Classic was amazing so was the pesto and the mediteranean."], "author": "David Y.", "review": "Pizza here is amazing. Got a surprise bday party here and couldn't have been happier. The spicy chicken wings are amazing as well. Nice selection of beer. Love the atmosphere. Kinda easy to miss if you're just driving by, but if you find it you'll be in love! The Classic was amazing so was the pesto and the mediteranean.", "rating": 5, "date": "2009-11-24"}, {"excerpts": ["I usually order the classic, with a caprese salad and sometimes the spicy chicken wings.  ", "I feel lucky to have this spot in my hood."], "author": "jane d.", "review": "Their cornmeal crust rocks.  I usually order the classic, with a caprese salad and sometimes the spicy chicken wings.  I feel lucky to have this spot in my hood.", "rating": 5, "date": "2009-08-20"}, {"excerpts": ["We started with appetizer of :\n\nSpicy Chicken Wings - pound of wings served with baby carrots and blue cheese dressing $9 - these were delicious. "], "author": "Lulu C.", "review": "Little Star has always had a reputation for being one of the best pizza joints around town...and for good reason.  The pizza here is top notch and very tasty.  However, the ridiculously long wait times, plus the snottiness and rudeness of the host here takes away from the charm of the place and knocked it down to 3 stars instead of 4 for me.  \n\nThe host had given us an estimated wait time of 1 hour...an hour and 20 minutes later, we watched as he sat another large party who came in after us..I went up to ask him why he was seating them before us, and he snapped back at me that they were on the list before us.  If that's true, fine..but it seemed like he knew these people & were giving them the table because of that.  When i gently pointed out to him that we had been waiting a long period over the time he had given us, he decided it was good customer service to tell me that I hadn't been waiting an hour and 20...but an hour and 10 minutes instead.  And he didn't say it nicely either.  He was outright rude, and a flat out ASSHOLE.  Very unnecessary and uncalled for, and if the manager of Little Star is reading this...he's the shorter, thin mustached/bearded host with long hair pulled back into a ponytail.  This was Saturday Jan 17th. RUDE RUDE RUDE.  He should NOT be in the service industry if he doesn't know what it means to treat customers with kindness. \n\nWe were finally seated about 20 minutes after that..and the food was very good.  We started with appetizer of :\n\nSpicy Chicken Wings - pound of wings served with baby carrots and blue cheese dressing $9 - these were delicious. VERY good. spicy & not overly sauced.  \n\nClassic Deep Dish pizza - sausage, mushrooms, green bell peppers & onions $22 (for large) - the deep dish pizzas are definitely the way to go. TONS of toppings, piping hot and cheesy, for crust lovers (like me!) the crust is a deliciously crunchy buttery indulgence. \n\nThin Crust Chicken Pesto - pesto sauce, roasted chicken, mushrooms & onions -$17 (for small) - also very good, but in deep dish i think it would have been even better! \n\nFYI:  the large/small sizes did not seem to differ much at all.  it was right in front of me, and I couldn't tell the difference.", "rating": 3, "date": "2009-01-21"}, {"excerpts": ["When we got our seat, we ordered their Spicy Chicken Wings. ", "This comes with baby slices of carrots and blue cheese, they don't serve ranch here. ", "The wings were a bit salty, but was very flavorful. ", "We wanted to try out their garlic bread, but they ran out! ", "I'm not sure if that's a good or bad thing. ", "We had their large deep dish half vegetarian-mushrooms, onions, zucchini, black olives, bell peppers, garlic and half Classic- sausage, mushrooms, bell peppers, and onions. ", "Both were very delish! ", "How come I never thought about putting the sauce on the top to keep the bottom nice and crunchy?! ", "The cheese was gooey, toppings were generous and sauce was perfect. ", "If you love non-oily, crispy, flaky, hot, gooey pizza, this is one to try. \n", "Best time to come is during the weekdays between 5-7, an inside source had said. \n", "Cash only! ", "ATM machine there only charges .25 for a transaction and whatever your bank charges you."], "author": "Annie D.", "review": "Came here on a Sunday night and there was a 40 minute wait for a seat. There are also options to get a bar seat, which is full service or order take out. We decided to just wait for a seat. As time past, more and more people showed up and put their name on a list. Not your average pizza joint with a waiting list. The staff here are very quick and super friendly. When we got our seat, we ordered their Spicy Chicken Wings. This comes with baby slices of carrots and blue cheese, they don't serve ranch here. The wings were a bit salty, but was very flavorful. We wanted to try out their garlic bread, but they ran out! I'm not sure if that's a good or bad thing. We had their large deep dish half vegetarian-mushrooms, onions, zucchini, black olives, bell peppers, garlic and half Classic- sausage, mushrooms, bell peppers, and onions. Both were very delish! How come I never thought about putting the sauce on the top to keep the bottom nice and crunchy?! The cheese was gooey, toppings were generous and sauce was perfect. If you love non-oily, crispy, flaky, hot, gooey pizza, this is one to try. \nBest time to come is during the weekdays between 5-7, an inside source had said. \nCash only! ATM machine there only charges .25 for a transaction and whatever your bank charges you.", "rating": 4, "date": "2009-03-24"}], "roasted kale": [{"excerpts": ["As for this restaurant we ordered the Meteor 2.0 deep dish pizza along with an appetizer of roasted kale. ", "I was impressed with the kale - it was fresh and crunchy and flavorful as well as not overly salty. ", "It was a good prelude to the pizza itself. ", "I usually prefer thin crust to deep dish pizzas as I find many deep dishes to be too oily as well as over saturated with sauce. ", "Neither was applicable to Little Star's pizza as it was honestly one of the tastiest pizzas I have ever had in the Bay Area. "], "author": "Mike G.", "review": "My first time coming to Little Star even though I had heard plenty of good things beforehand. Interesting back story to the Little Star Pizza \"chain\" as apparently they are not all the same with the Valencia and Albany locations under a different owner.\n\nAs for this restaurant we ordered the Meteor 2.0 deep dish pizza along with an appetizer of roasted kale. I was impressed with the kale - it was fresh and crunchy and flavorful as well as not overly salty. It was a good prelude to the pizza itself. I usually prefer thin crust to deep dish pizzas as I find many deep dishes to be too oily as well as over saturated with sauce. Neither was applicable to Little Star's pizza as it was honestly one of the tastiest pizzas I have ever had in the Bay Area. Service was friendly and timely and the ambience was a nice small neighborhood vibe that makes you feel good about being in the city.\n\nFirst timer but soon not to be. Recommended.", "rating": 5, "date": "2017-09-07"}, {"excerpts": ["I ordered one order of the roasted kale then snuck in a second order before happy hour was up because it was THAT GOOD. ", "I highly recommend it. "], "author": "Betty R.", "review": "Super family friendly, good service and KILLER FOOD makes for an awesome combo any night of the week. \n\nDecided to come here for an early dinner tonight with my family. Was stoked to see that they had happy hour food and drink specials until 6:30p. Woot woot! \n\nWe started our meal with some appetizers off of the weekday happy hour menu. The caprese salad was your typical sliced tomatoes, fresh mozzarella, basil chiffonade, and olive oil and balsamic vinegar--delicious and definitely didn't disappoint. I ordered one order of the roasted kale then snuck in a second order before happy hour was up because it was THAT GOOD. I highly recommend it. You simply can't go wrong with big pieces of kale topped with sprinkle of Parmesan and feta, roasted to perfection and topped with fresh lemon wedge for you to finish off at your table. \n\nFor our meal, we had the portobello pie deep dish pizza with tomato sauce. Crust was crispy and not crazy thick which I love because then you can really taste the toppings instead of every bite just being a mouthful of doughy crust. The ratio or crust to sauce to toppings and cheese was perfection! Sauce was very balanced between tart and sweet. Getting the big chunks of flavorful portobello was the best though. I normally like sausage or some type of meat on my pizza but this really didn't need it. Pizza also came out piping hot which made me really happy because last time I had deep dish pizza across town at another pizza place, my pie came out cold and crust was doughy like it wasn't fully cooked through. No such nonsense at Little Star! No wonder these guys have a 4.5 stars rating out of over 2500 Yelp reviews! \n\nFor those of you with kiddos, little ones 10 and under get a free mini pizza during happy hour with order of a regular pizza for the grown ups. What a deal, right? Just make sure they don't sit you close to the door because as soon as anyone comes in, a bunch of cold air blows in and can be unpleasant when the temp gets below 60 outside.", "rating": 5, "date": "2017-02-03"}, {"excerpts": ["My only complaint is about the Roasted Kale & Parm Salad... ", "it tasted ok but the serving size was very small and should be more of a \" tasting \" size or maybe even a table sample bowl."], "author": "Terrance G.", "review": "The deep Dish pizza is really good. Atmosphere is basic but pleasant and serves it purpose. Waiting staff was very nice and the hostess especially . My only complaint is about the Roasted Kale & Parm Salad... it tasted ok but the serving size was very small and should be more of a \" tasting \" size or maybe even a table sample bowl.", "rating": 4, "date": "2018-03-30"}, {"excerpts": ["We have tried both the garlic bread and roasted kale as appetizers and would recommend skipping the appetizers. ", "The wine selection pairs well with the pizza."], "author": "T K.", "review": "We have been here almost a handful of times -- we have spent a fair share of time in Chicago and will admit that this pizza rivals chicago deep dish in terms of taste and quality. As vegetarians we enjoy the Little star, which comes with spinach and ricotta as well as garlic and feta. The tomato sauce is delicious. This is not a stuffed pizza (like patxis or zachary's -- or giordanos) but is a deep dish (like lou malnatis, gino's east or pizzeria uno). We have never been disappointed here and can recommend it to chicago natives and deep dish lovers without hesitation. We have tried both the garlic bread and roasted kale as appetizers and would recommend skipping the appetizers. The wine selection pairs well with the pizza.", "rating": 5, "date": "2016-11-21"}], "classic  dd": [], "pollo  th or dd": [], "margherita plus  th": [], "little star  dd": [], "white  th or dd": [], "meateor   th or dd": [], "bbq chicken  th or dd": [], "pear pie  th": [], "italian combo  th or dd": [], "gluten free": [{"excerpts": ["This review is for the gluten free pizza only. ", "Solid pizza... ", "I got the Little Star with spinach, onion, garlic etc. ", "Even though the menu said DD only they made it for me on GF crust. ", "The toppings were high quality and delicious. ", "They mentioned this was the most popular pizza. ", "The gluten free crust was just ok...definitely not the best I've ever had. ", "Tony's GF pizza is for sure better. ", "BUT this pizza still hit the spot and when you can't get all the way to North Beach this is still a solid choice. "], "author": "Christina C.", "review": "This review is for the gluten free pizza only. Solid pizza... I got the Little Star with spinach, onion, garlic etc. Even though the menu said DD only they made it for me on GF crust. The toppings were high quality and delicious. They mentioned this was the most popular pizza. The gluten free crust was just ok...definitely not the best I've ever had. Tony's GF pizza is for sure better. BUT this pizza still hit the spot and when you can't get all the way to North Beach this is still a solid choice. Even my non-gf husband and brother enjoyed the pizza a lot!\n\nI have Celiac so I always check on the cross contamination situation. They use the same oven for all pizzas but assured me they try to keep everything separate and use a cooking sheet under the gf pizza in the oven. I didn't get sick. \n\nAlso, I ordered this pizza to go (for pick up), and it was ready as soon as my husband walked in the door to get it! I literally thought he may have stolen the pizza he walked out so fast ;)", "rating": 4, "date": "2017-12-27"}, {"excerpts": ["The Italian (deep dish) and the Pollo (gluten free) are both tasty. \n\n"], "author": "Enrique F.", "review": "Great pizza, great appetizers, and great happy hour rate on beers ($5 for craft brews until 6:30pm W-F). \n\nAppetizers: Chicken wings and garlic bread are delicious. Pizza: The Italian (deep dish) and the Pollo (gluten free) are both tasty. \n\nDepending on the time you go, the wait can be long, but worth the wait. FYI: They won't seat you until a majority of your party arrives.", "rating": 5, "date": "2017-08-29"}, {"excerpts": ["We ordered the gluten free pizza ($2/more and only comes in medium) and it was perfect for my husband and I to share (and we both have decent appetites)! ", "You can half the specialty pizzas for $1/more ", "so he got the bbq chicken ", "and I got the Brussels sprouts, both without cheese. ", "The flavors were great and the gf crust was good, as long as you are okay with a crispy, cracker like crust (which we are)! ", "We also tried the kale appetizer and it was delicious. ", "Definitely recommend this place!!! ", "We'll be back!"], "author": "Nikki R.", "review": "Yelp reviews did not disappoint on this one! Came here for dinner tonight and wasn't sure at first. Looks from the outside are deceiving. They're doing construction on the street so it's a bit hidden, but find street parking and give it a try. It's worth the trouble! \n\nI wish I knew our servers name. She was super sweet and helpful. I should note that we were here at about 6 on a Monday night and there was no wait and it was super family friendly. We took our two kiddos there and they loved their \"mini pizzas\". Monday is happy hour all day and kids pizzas are $4 or free with a large pizza. They also have some specials on wine and appetizers. We ordered the gluten free pizza ($2/more and only comes in medium) and it was perfect for my husband and I to share (and we both have decent appetites)! You can half the specialty pizzas for $1/more so he got the bbq chicken and I got the Brussels sprouts, both without cheese. The flavors were great and the gf crust was good, as long as you are okay with a crispy, cracker like crust (which we are)! We also tried the kale appetizer and it was delicious. Definitely recommend this place!!! We'll be back!", "rating": 5, "date": "2017-11-20"}, {"excerpts": ["Pretty good gluten free crust pizza at this place. ", "My friends and I got takeout because she lives right across the street ", "and we weren't in the mood to wait to sit at a table. ", "We ordered some wings and pizza. ", "They originally said the wings were gluten free, but at the end of our order they told us they were not. ", "Everyone enjoyed their pizzas; I got the Brussels sprouts one ", "and it was pretty good even without the cheese. ", "I was disappointed that the wings weren't gluten free; they looked like they were though not that great... ", "Guess I'll do with anchovies as my protein again next time!"], "author": "Samira I.", "review": "Pretty good gluten free crust pizza at this place. My friends and I got takeout because she lives right across the street and we weren't in the mood to wait to sit at a table. We ordered some wings and pizza. They originally said the wings were gluten free, but at the end of our order they told us they were not. Everyone enjoyed their pizzas; I got the Brussels sprouts one and it was pretty good even without the cheese. I was disappointed that the wings weren't gluten free; they looked like they were though not that great... Guess I'll do with anchovies as my protein again next time!", "rating": 4, "date": "2018-01-06"}, {"excerpts": ["The Gluten Free / Celiac accommodations they made for me and my party were above and beyond. "], "author": "Maude B.", "review": "The Gluten Free / Celiac accommodations they made for me and my party were above and beyond. Everyone took our dietary restrictions seriously and I am grateful for that - esp at a pizza place! \n\nThe service was great and portions beyond filling! We got two small pizzas for 3 hungry people and left with a doggy bag. Be sure to try their salads, as well.  \n\nThe GF thin crust pizza here is nice and crispy!", "rating": 5, "date": "2018-02-08"}, {"excerpts": ["They also have really good gluten free crust, if you're into that. ", "Unfortunately they aren't open for lunch, but give them a try for dinner!"], "author": "Justin J.", "review": "Little Star is a quality choice for pizza. They serve deep dish with a corn bread crust. Not as good as Chicago style, but certainly a satisfying pie. They also have really good gluten free crust, if you're into that. Unfortunately they aren't open for lunch, but give them a try for dinner!", "rating": 4, "date": "2017-10-30"}, {"excerpts": ["They have gluten free options! ", "Get on wait list and order in advance. ", "Overall good for quick bite."], "author": "Amir P.", "review": "Delicious food and outstanding service. They have gluten free options! Get on wait list and order in advance. Overall good for quick bite.", "rating": 5, "date": "2018-01-18"}, {"excerpts": ["And still, i had the gluten free crust. ", "That says ALOT about the quality of the food. ", "5 out of 5 easy!"], "author": "Fanny M.", "review": "Best pizza i've ever tasted in my entire life. Cant even call it pizza it's art. And still, i had the gluten free crust. That says ALOT about the quality of the food. 5 out of 5 easy!", "rating": 5, "date": "2017-08-26"}, {"excerpts": ["The music, the service, the salad and the gluten free pizza all came together for an awesome dinner."], "author": "Valerie P.", "review": "The music, the service, the salad and the gluten free pizza all came together for an awesome dinner.", "rating": 5, "date": "2017-06-19"}, {"excerpts": ["Excellent gluten free pizza!  ", "My BF loves his deep dish. ", "(And it really looked amazing). ", "Also loved the kale appetizer. ", "Happy hour all night on mon and tues. ", "Unfortunately the service wasn't the great ", "and we sat at the table near the front door with a curtain dividing us from the people waiting. ", "People kept bumping me through the curtain and almost spilled my wine several times. ", "Lucky for them the food spoke for itself. ", "We will be coming back often."], "author": "Daniel A.", "review": "Excellent gluten free pizza!  My BF loves his deep dish. (And it really looked amazing). Also loved the kale appetizer. Happy hour all night on mon and tues. Unfortunately the service wasn't the great and we sat at the table near the front door with a curtain dividing us from the people waiting. People kept bumping me through the curtain and almost spilled my wine several times. Lucky for them the food spoke for itself. We will be coming back often.", "rating": 5, "date": "2017-02-20"}], "deep dish cheese": [{"excerpts": ["I'll circle for a half an hour, just for a simple deep dish cheese! ", "So flavorful and such a delight. ", "A weekly splurge (for now!)."], "author": "Michelle D.", "review": "Dare I say this is the best pizza in SF? IMO.  Best Little Star location, too. Parking can be hard to find, but it's so worth it! I'll circle for a half an hour, just for a simple deep dish cheese! So flavorful and such a delight. A weekly splurge (for now!).", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["We ordered a deep dish cheese with ricotta, roasted garlic, fresh mozzarella, pepperoni and fresh basil. ", "It was delicious! ", "It's too bad ", "we were only visiting for a few days, or we would have definitely broken our rule to not visit any food place more than once on our trip!"], "author": "Barby M.", "review": "All the 5-star reviews are on point! Little star pizza is perfect in every way! We ordered a deep dish cheese with ricotta, roasted garlic, fresh mozzarella, pepperoni and fresh basil. It was delicious! It's too bad we were only visiting for a few days, or we would have definitely broken our rule to not visit any food place more than once on our trip!", "rating": 5, "date": "2014-02-23"}, {"excerpts": ["We ordered (reproduced from their menu)\n- Garlic Bread - Warm sourdough served with a blend of butter & extra virgin olive oil and a bulb of roasted garlic\n- Large deep dish cheese pizza with pepperoni\n- Large Italian Combo - Thin crust, Pepperoni, salami, onions, green bells, black olives, pepperoncini\n- Large Special - Thin crust, roasted potatoes, garlic and bunch of other veggies "], "author": "Badri N.", "review": "What an amazing pizzeria!!  While I would give the pizza itself 4 stars, the whole experience that includes the ambiance, setting and staff easily elevate this to a full five star dining experience at an incredibly affordable price!  Yes, 5 stars it is!\n\nWe came here as a large group of 8 about 30 minutes before closing and were lucky to be seated almost right away.  They accommodated us readily and with a smile :)\n\nThis place is small, cozy and packed tight but you still get a lot of privacy for your group at your table- I never felt that my space was being intruded upon.  Simple menu and a fantastic special for the night!\n\nWe ordered (reproduced from their menu)\n- Garlic Bread - Warm sourdough served with a blend of butter & extra virgin olive oil and a bulb of roasted garlic\n- Large deep dish cheese pizza with pepperoni\n- Large Italian Combo - Thin crust, Pepperoni, salami, onions, green bells, black olives, pepperoncini\n- Large Special - Thin crust, roasted potatoes, garlic and bunch of other veggies I can't remember\n\nI didn't try the Italian combo but I did try a small piece of the deep dish and it was delicious.  But I'm not a fan of deep dish pizza so my favorite for the night was the special - the vegetables were done perfectly.  \n\nYes, three large pizzas are a lot of food for 8 people and we had the leftovers to prove it :D\n\nOh, we also killed a couple of bottles of the Sangiovese which was adequate and quite good to complement the pizza.  $10 corkage if you want to bring your own (I'll remember to do that the next time!!!)\n\nTotal bill including tips and gratuity for 8 people was about $150 - heck, that's cheap for such a fun filled evening!!!\n\nAs mentioned before the ambiance is quite charming, kind of a rustic/modern fusion.  The staff was outstanding till we left well past closing.  We did end up closing the place but left with satisfied stomachs after a fantastic evening with some amazing friends!\n\n~ 5 stars overall for a great experience with food that was perfect for the occasion.\n\n# 230", "rating": 5, "date": "2011-03-05"}, {"excerpts": ["The deep dish cheese and tomatoes blended together in a way that makes my eyes and mouth water just thinking about them right now :", "Q_", "_", "___.... ", "And the New York wasn't that spectacular. "], "author": "Victor T.", "review": "Ho. Ly. Crap.\nThe pizzas here were amazing. I sort of wish my big group of friends wasn't so strapped on time during our trip to SF so that we could eat it all over again as a dine-in... but damn, I digress. Where do I even begin writing about this place? The pizza was amazing. It's blotting out my ability to write coherently, but here goes anyway:\n\nDeep dish: we got half something awesome and half something vegetarian and awesome.\nNew York style: again with the half something good and half something vegetarian good.\nOverall the Chicago Deep Dishes easily won over the New York styles. The deep dish cheese and tomatoes blended together in a way that makes my eyes and mouth water just thinking about them right now :Q_____.... And the New York wasn't that spectacular. It was kind of like any other New York pizza: crispy, thin, tasted a little burnt from the oven.\n\nThe garlic bread was also pretty good. They have an interesting philosophy on garlic bread. They sliced open the bottom of a bulb of garlic and baked it with the bread until it got all gooey, and you just pop a clove onto your slice and spread it until it dissolves onto the bread in a delicious little .... *ghhhaaaaaa* :Q_____________", "rating": 5, "date": "2011-08-17"}, {"excerpts": ["A regular ole deep dish cheese pizza and a few champagne cocktails"], "author": "Kelly F.", "review": "A little taste of Chicago style pizza (my home) right here in our neighborhood. \n\nA regular ole deep dish cheese pizza and a few champagne cocktails, I'm good to go.\n\nJust be prepared to pay cash- no credit cards accepted. Although, there is an ATM inside that charges only $.25 to take out cash. That rules.", "rating": 4, "date": "2009-09-20"}, {"excerpts": ["My friend and I had a small deep dish cheese pizza to which we added an assortment of our own toppings. \n\n"], "author": "C G.", "review": "First time visit last night and we got lucky w/ immediate seating since it was only about 6pm. Our server was super nice and very attentive. \n\nHad a large mixed green salad w/ vinaigrette, tomatoes, chopped walnuts, gorgonzola cheese and red bell peppers. Normally I hate walnuts, but together w/ the cheese it was awesome and there was no bitterness to the nuts. \n\nMy friend and I had a small deep dish cheese pizza to which we added an assortment of our own toppings. \n\nWOW---I LOVE THIS CRUST. When I told my Zachary's Pizza-loving friend that I think it's better than Zachary's, he paused, hemmed, hawed, and wanted to debate me. But he only persuaded me to agree that it's equally good, just different. I think the cornmeal in the crust gives it an extra boost of flavor and crunchiness that Zachary's is missing. Zach's crust is just too thick, tough and filling sometimes.\n\nAnyway---to top off a perfect meal, the freaking music on the jukebox was the best I've heard from a jukebox in a long time. Depeche Mode and The Smiths, for real? YAY!  Yes yes yes, I know, someone had to pay to pick those songs and they deserve some of the credit, but props to Little Star for even having those bands as an option in the machine!\n\nAND finally-they have one of the best logos in the City.", "rating": 5, "date": "2011-02-11"}, {"excerpts": ["so we settled on a deep dish cheese and a little star. ", "both were amazing!!! "], "author": "jen r.", "review": "i love pizza but chicago style has never been my thing. maybe its my miami roots and the fact that deep dish isnt very popular down south.\nive been to chicago and wasnt too impressed since i thought the pizzas were too saucy and heavy.\n\nso needless to say i was a little hesitant about little star especially when we got there and they told us they were out of thin crust.\nso we settled on a deep dish cheese and a little star. both were amazing!!! omg that crust is divine!!!\n\nwe got a cheesecake to share for the table and it was devoured in less than a minute. it was so soft and smooth it almost felt like ice cream!!\n\ni wish little star existed in miami (hint, hint) i think it would be a huge hit!!", "rating": 5, "date": "2010-05-24"}, {"excerpts": ["Their simple deep dish cheese pizza is a work of art."], "author": "Jared E.", "review": "Little Star is my new favorite pizza in SF (and perhaps the world, hehe).  Their simple deep dish cheese pizza is a work of art.", "rating": 5, "date": "2010-05-02"}, {"excerpts": ["Still, I could've done this as a deep dish cheese pizza and been more than happy with all of it.\n\n"], "author": "L F G.", "review": "Craving pizza the first night of a business trip, my coworkers and I drove into San Fran, and after looking for parking for about 20 min, we managed to find something a few blocks away.  This place was BUSY BUSY BUSY, and we waited another 20 min for a table.  During that time, we saw a ton of carry out from this place, and it smelled so good in there, we were dying to try it.\n\nWe ordered a large Thin Crust and Large Deep Dish for 4 people.   At $20+ a pie, it's not cheap, but the pizza is pretty large.  Since we had multiple tastes, the restaurant was nice enough to let us split each pizza and have 2 separate flavors on each pie to accommodate everyone.  \n\nThin crust - the spinach and feta special (can't remember all of the toppings) but it was awesome.  The spinach was perfectly wilted without being too wet, and the flavors really popped your mouth perfectly.  The sauce is perfectly flavored and amazing. \n\nDeep Dish - sausage and mushrooms.  The crust is delicious and amazing.  One thing I didn't like was the sauce is put on top of the pie, and fills in the crust and toppings are underneath.  But there is so much sauce, I couldn't even tell what toppings were on the pizza.  Still, I could've done this as a deep dish cheese pizza and been more than happy with all of it.\n\nHad a black cherry soda which was also a nice little addition to the meal.  \n\nService was awesome and I can see why this place had such a wait.  It's a good thing I don't live in San Fran, as i'd be carrying out regularly and be broke!  For a party of 4, I believe our meal came out to just over $50.  Totally reasonable and would go back in a heartbeat!", "rating": 5, "date": "2008-11-12"}, {"excerpts": ["Their deep dish cheese w/ ", "the sauce on top is amazing....", "oh so good."], "author": "E G.", "review": "Best and most likely most fattening pizza in town.  Their deep dish cheese w/ the sauce on top is amazing....oh so good.", "rating": 5, "date": "2007-11-06"}], "thin crust cheese": [{"excerpts": ["I love their pizza and the thin crust cheese pizza was outstanding as well."], "author": "Lucy D.", "review": "I don't like deep dish pizza - usually gooey and yucky. Zachary's wasn't good either, but this place, man oh man! It was so good! Everything seemed to be reasonably priced and nice selection of wine, beer.\n\nI love their pizza and the thin crust cheese pizza was outstanding as well.", "rating": 5, "date": "2010-08-19"}, {"excerpts": ["i get the thin crust cheese for the kids and thin crust classic for the grownups.\n\n"], "author": "Fred C.", "review": "we order from here about once a week even tho it's not close to our house.\n\ni get the thin crust cheese for the kids and thin crust classic for the grownups.\n\nvery delicious. highly recommend.", "rating": 5, "date": "2009-05-08"}], "standard": [{"excerpts": ["Both were pretty standard, nothing too special. ", "The pizza though was delicious! ", "We were able to do half-half and ended up ordering the \"White\" and \"Little Star\". ", "The pizza was well balanced, but the star was the crust - provided great texture in contrast to the cheese! ", "We also ordered the warm brownie to share for dessert, but it was only so-so "], "author": "Alyssa P.", "review": "As a lover of thin crust pizza, I must say I was almost converted after eating deep dish at Little Star! \n\nAmbiance: typical for most SF restaurants, this place was pretty small and the entryway definitely felt cramped while my group was waiting for a table. That being said, the actual dining area was spaced out well and I never felt cramped! \n\nService: Very friendly staff! LOVE that you can order your deep dish ahead of time while waiting for a table. By the time our first appetizer had come out our deep dish was already on the table! \n\nFood: We ordered two appetizers to start-  the chicken wings and the garlic cheesy bread. Both were pretty standard, nothing too special. The pizza though was delicious! We were able to do half-half and ended up ordering the \"White\" and \"Little Star\". The pizza was well balanced, but the star was the crust - provided great texture in contrast to the cheese! We also ordered the warm brownie to share for dessert, but it was only so-so and I probably wouldn't get it again. \n\nOverall, my pizza craving was definitely satisfied and this is a great go-to place if you are a deep dish lover! Would love to come back and try their thin crust!", "rating": 4, "date": "2017-02-20"}, {"excerpts": ["We've also tried the mixed greens salad in the past and it's pretty standard. ", "Their wings are decent. ", "You really can't go wrong with their deep dish though. ", "I love their sauce and the ingredients are fresh every time. ", "Always a winner in our book! ", "As far as drinks are concerned, the bf usually gets an Arrogant Bastard beer and recently I tried the Hey Kool-Aid champagne cocktail "], "author": "Fallon P.", "review": "Hands down my favorite place to get deep dish pizza! The bf and I love coming here. The wait is so worth it! We always get a small \"Classic\" with chicken instead of the sausage. The small is definitely enough for 2. But, today we got a large and obviously had some slices leftover to take home. \n\nWe've also tried the mixed greens salad in the past and it's pretty standard. Their wings are decent. You really can't go wrong with their deep dish though. I love their sauce and the ingredients are fresh every time. Always a winner in our book! As far as drinks are concerned, the bf usually gets an Arrogant Bastard beer and recently I tried the Hey Kool-Aid champagne cocktail and it was alright.\n\nParking can be difficult. It takes us on average 20-30 mins to find parking. The longest we've ever had to wait was 30 mins. Don't be dissuaded by the long wait for a table. I feel like some people are impatient once they hear that they have to wait for an hour or longer and they just walk away. That just gives others the chance to get seated faster. We were once told that the wait for a table for 2 was going to be an hour and 15 mins. But, they texted us within 30 mins and a table had opened up for us. So, don't give up right away.\n\nI mean, what else is there left to say that hasn't already been said? This place is great and their deep dish is amazing, granted I haven't had deep dish anywhere else. But, I don't mind staying loyal to this place. The service is always good too and I think it's neat how they send you a text when your table opens up if you aren't waiting inside. Hurry, you won't be disappointed!", "rating": 5, "date": "2013-12-14"}, {"excerpts": ["If you aren't into feta cheese like me, which comes standard in the white pie, they allow a substitute ingredient in its place. ", "In my case, I always go for the pepperoni or mushroom as a replacement depending on my level of carnivorousness. ", "Oh yeah, the cornmeal crust adds a interesting twist of texture that I've never yet encountered before. ", "They don't do delivery, but I've never had a problem calling in, getting an ETA, and dropping by to pick up without having much of a wait."], "author": "David L.", "review": "We were looking for a go-to pizza parlor after moving back to SF from Brooklyn. Fresh mozzarella, oh baker where art thou? We're still searching for you, but the thin white pizza at Little Star is a mighty replacement for our mutant ninja turtle needs. If you aren't into feta cheese like me, which comes standard in the white pie, they allow a substitute ingredient in its place. In my case, I always go for the pepperoni or mushroom as a replacement depending on my level of carnivorousness. Oh yeah, the cornmeal crust adds a interesting twist of texture that I've never yet encountered before. They don't do delivery, but I've never had a problem calling in, getting an ETA, and dropping by to pick up without having much of a wait.", "rating": 5, "date": "2016-11-04"}, {"excerpts": ["Save the sundried tomatoes for a pesto pizza because they just don't go great with the tomato stuff on their standard deep dish pizzas. ", "The sundried tomatoes added a sour flavor. ", "As for mushrooms, salami, and sausage, there was not much of any at all. ", "I actually forgot we ordered salami until I ate the leftovers the next day in a brightly lit room and saw a piece. ", "The cornmeal crust had good texture but wasn't impressed with the flavor. "], "author": "Cheryl Q.", "review": "I might get some shit from my fellow Yelpers, but Little Star Pizza just did not do our deep dish cravings justice. First off, we walked in at 9:30 pm when they close at 10, so our waitress was grumpy and gave us attitude the entire night until we turned around and asked for the bill; her attitude did a total 180. \n\nWe ordered a deep dish and built our own-mushrooms, salami, sausage, and sundried tomatoes. Save the sundried tomatoes for a pesto pizza because they just don't go great with the tomato stuff on their standard deep dish pizzas. The sundried tomatoes added a sour flavor. As for mushrooms, salami, and sausage, there was not much of any at all. I actually forgot we ordered salami until I ate the leftovers the next day in a brightly lit room and saw a piece. The cornmeal crust had good texture but wasn't impressed with the flavor. Something was missing, but we couldn't seem to pinpoint what. \n\nWe asked the waitress how big a small size was and the size she made with her hands looked like a tiny frozen personal sized pizza so we ordered a large. LIAR. Big mistake. The large wasn't as big as a normal large sized pizza elsewhere, but the small definitely wouldnt have been as small as she had shown. The two of us each had one slice then tapped out cause it was so rich and had so much cheese on it-the one thing we actually enjoyed. $36 for a pizza is a no-no when Costco sells better tasting and same sized deep dish pizzas for $10. Sorry, but you have been outshined Little Star!", "rating": 3, "date": "2013-11-16"}, {"excerpts": ["It's thin crust, but gooey, delicious sauce with a broader variety for vegetarians than your standard bell peppers and onions. \n\n"], "author": "Carolina S.", "review": "Since parking can be a hassle in this neighborhood (and we don't live in Lower Haight anymore), we order out and have it delivered. They are a great alternative to Paxtis, especially since Patxi won't deliver everywhere in the city. However, don't think you'll get Chicago style pizza here. It's thin crust, but gooey, delicious sauce with a broader variety for vegetarians than your standard bell peppers and onions. \n\nAlso, they do have salads, which I wish came in a larger portion. \n\nSo, in case you don't live nearby, order through trycaviar.com- they feature Little Star and a plethora of other great finds in San Francisco.", "rating": 5, "date": "2013-09-27"}, {"excerpts": ["Little Star manages to avoid all of that with a standard of memorably good pizza. \n\n"], "author": "Brian S.", "review": "I've had pizza in Chicago, and pizza in Brooklyn, and this place is as good as it gets for California deep dish. \n\nI'm a fan of pizza (surprise). Part of how I judge a city is by its best pizza joints. I've tried to make it a point to visit the best rated pizza shops in every major city I've walked through. From the folding thin crust of coal-fired Brooklyn slices, the generous pies of Chicago, to the fresh wood-fired oven Neapolitan pizza of Tony's Pizza Napoletana here in SF and innumerable shops in-between, I've somehow managed to refine a fairly snobby palate for the end product of cooking tomato and cheese on dough.\n\nMost places with mediocre to decent ratings manage them with the portions. It takes more than a lot of food to make me remember it, though. I need personality/flavor to keep me coming back. National chains reliably suck at accomplishing this, and everywhere else just throws heaps of frozen, processed or greasy food at you. Little Star manages to avoid all of that with a standard of memorably good pizza. \n\nThough I've had several types here, my weakness is the deep dish. It's the only thing I've had that comes close to standing up to the immensely flavorful Lou Malnatti's in Chicago. Little Star deep dish crust is crispy and substantial, the cheese is real, and its tomato sauce rivals most. The ingredients aren't limp or bland. While this is a deep dish, the similarities with Sicilian style pizza are only good: the bottom is the crispiest, and the dough above that soft and pillowy. It's a quality crafted gourmet pizza, and you realize it the minute you sink your teeth into its old-world perfectly ratioed wedges.\n\nThe thin crust is above serviceable if you're a homesick New Yorker, but I wouldn't be tempted to call it better than a Di Fara's (good flat pizza in SF can be found at Tonys Pizza Napoletana, or Emilia's Pizzeria in Berkeley). Still, it's some of the best you're likely to find on the West Coast. The deep dish is where Little Star shines.\n\nThe last I checked they don't sell by the slice, and the cost is a bit steep as you add more ingredients, but for the quality, it's easily worth a visit. This isn't drunk food. It's where you go to get quality pizza.", "rating": 4, "date": "2014-01-18"}, {"excerpts": ["So one day I went with a few friends of mine and casually ordered their standard pizza and to my surprise, it was extremely enjoyable! ", "Now, it doesn't convert me into a deep disher but it has elicited my business twice in the 2 weeks following that first encounter! "], "author": "Julia P.", "review": "I could easily sum this review up in one sentence:\n\n\"I don't like deep dish pizza, but I love Little Star Pizza.\"\n\nThere I said it...but okay some more details. When I first moved to San Francisco, I was told about this place and it definitely wasn't first on my list of places to eat because honestly, I'm not a deep dish pizza fan. So one day I went with a few friends of mine and casually ordered their standard pizza and to my surprise, it was extremely enjoyable! Now, it doesn't convert me into a deep disher but it has elicited my business twice in the 2 weeks following that first encounter! That's how good it is.\n\nI'm more of a NY thin cruster (having lived in NYC for the majority of my young adult life) so if any of you have recs, send them my way!", "rating": 4, "date": "2011-10-01"}, {"excerpts": ["My standard bearer, for Chicago Deep Dish is Lou Malnati's in Chicago, closely followed by Zachary's in Oakland.  ", "Why are these pizzas so good?  ", "It's a combination of buttery crust that just breaks in your mouth ever so easily and the tomato sauce and cheese proportions.  "], "author": "Kyle W.", "review": "Review #200.  I'm dedicating this landmark review towards something that's near and dear to my cholesterolized heart, Chicago mutha fucking deep dish pizza!!  All those midwestern/Chicago transplants in the Bay Area have made San Francisco a heaven for Chicago Deep Dish pizza.\n\nMy standard bearer, for Chicago Deep Dish is Lou Malnati's in Chicago, closely followed by Zachary's in Oakland.  Why are these pizzas so good?  It's a combination of buttery crust that just breaks in your mouth ever so easily and the tomato sauce and cheese proportions.  Crazily enough, you can actually have too much cheese and too little tomato sauce, like Giordano's in Chicago.\n\nLittle Star Pizza comes close to reproducing what Lou Malnati's does, but it falls just slightly short.  The taste of the crust is great, but that texture falls short.  There's an absolutely buttery, airy flakiness in Lou Malnati's crust.  It makes you crave the crust, which is an amazing feat considering how many of us don't eat crusts on any type of pizza.  Little Star's crust is just slightly too crunchy.\n\nAs for the pizza itself, we had the Classic (sausage, mushrooms, onions, green bells).  There was no complaint about the pizza at all.  The toppings were plenty, the taste was what I expected.  There was a good balance cheese and tomato sauce.  (holy shit, my mouth is really watering right now).\n\nThe wait at Little Star is probably the worst in San Francisco/Bay Area out of all the Chicago Deep Dish places in the city.  Patxi's and Zachary's seem to have better wait times.  We waited 80 minutes for a table of 3 on a Saturday night around 9pm.\n\nOverall a pretty good effort in recreating Chicago Deep Dish.  Less wait time and more buttery crust would get an extra star for me.", "rating": 4, "date": "2013-03-24"}, {"excerpts": ["My gold standard if I am craving deep dish pizza. "], "author": "Sally T.", "review": "My gold standard if I am craving deep dish pizza. My stomach is seriously growling right now just thinking of this place.\n\nAll of their pizzas have a unique corn meal crust which is always perfectly cooked and amazingly tasty. I have yet to sample another pizza place with a crust that rivals the one at Little Star.\n\nThe Little Star pizza is my go-to. It has spinach and ricotta, as well as mushrooms, garlic, and onions. Or for those of you craving a little bit of meat, order the Brass Monkey. It's off menu, and is basically the Little Star with sausage added to it.  I've had the vegetarian pizza here as well, and while not quite as good as the Little Star, it's definitely worth a try.\n\nI almost always get the garlic bread appetizer. The bread is served nice and warm and accompanied with butter an d an entire bulb of roasted garlic! If you're a garlic lover like I am, or just trying to ward off vampires, you will not be disappointed with this dish.\n\nThe only reason why I need to dock off one star is because I have issues with the consistency of this place. I don't know if it depends on who is back in the kitchen or how busy the place is that particular night, but sometimes I leave Little Star feeling happy as a clam, and sometimes the pizza disappoints since it wasn't as good as previous experiences. It's still always satisfying, but some times are better than others.", "rating": 4, "date": "2012-12-12"}, {"excerpts": ["But it's a pretty standard and awesome place ", "that's standard in all LIttle Star dishes-"], "author": "Jessica K.", "review": "I'm filled with grief and pizza sauce when I come to Little Star since I'm a life long Chicago girl. I've been to Little Star far more times than I'd like to admit and in fact, have been here twice in the past week! I just couldn't overturn the decisions of the other 3 people I was with at the time. But it's a pretty standard and awesome place so of course, I kind of had to oblige. \n\nFirst of all, get some reservations in and add about 30 minutes to said reservations to calculate actual seating time. No joke. But the place is so darn tiny, I can't blame them really and you could always order appetizers and beers at the bar so what's the big deal really? Sure there's a ugly horde of people squished in like sardines at the waiting area, the scenery outside is nothing awesome to look at and there's less than 10 actual bar stools but it's all part of the experience.\n\nIf I may, I'd like to recommend the caprese salad for all of you mozzarella cheese lovers. Imagine getting the best of the best in regards to salads without the nonsense of lettuce. Gorgeous beefsteak tomatoes, olives, buffalo mozzarella, olive oil and vinagrette with a sprinkling of cracked pepper. How much more perfect can you get with that? I could just about drink/eat that concoction every day. I try to perfect it at home but I'm just not getting something right. It's the basil, it's the size of the mozzarella balls, it's my lack of crack that's standard in all LIttle Star dishes-I just don't know.\n\nI debate over getting appetizers and pizza because the small pizza is just too big for two people. It reminds me of home in a way with the cornmeal crust and the tomato sauce that's not too thin and acidic. My friend and I had the classic and each bite was just magical. It seriously takes me back home each time I bite into it. I can almost see the little finger pinches of the crust which makes me appreciate it that much more. \n\nSave some room in your tummy and don't go overboard with the pizza 'cause their cheesecake is pretty awesome and there's a gorgeous raspberry to go with it too. If only I was a wealthy independent woman with the metabolism of a hummingbird, I'd be front and center here once a week at least.", "rating": 4, "date": "2010-09-29"}, {"excerpts": ["Lighter than the standard ones (for me that's a bonus point) but the usual great taste. ", "Love this place"], "author": "Luigi P.", "review": "Good deep style pizza. Lighter than the standard ones (for me that's a bonus point) but the usual great taste. Love this place", "rating": 5, "date": "2015-04-20"}, {"excerpts": ["It was a pretty standard wait time for two deep dish pizzas.  ", "The service was great - we were seated almost immediately and our waiter was attentive.  ", "The vibe I got from this LSP location was equivalent to a dive bar - relaxed atmosphere, dim lighting, and chill music.  "], "author": "Ashley O.", "review": "What better way to show my love for Little Star Pizza than to dedicate my 50th review to this deep dish pizza goldmine.   \n\nI was lured to Little Star Pizza by its coveted spot on the 7x7's list of 100 things to eat before you die.  I couldn't resist the temptation of devouring one of the most delicious creations in SF.  Chicago deep dish, watch your back. Little Star Pizza won't go down without a fight.      \n\nTo die for pizza:       \n- Brass monkey (secret menu item): The Little Star (spinach blended with ricotta and feta, mushrooms, onions, garlic) with sausage  \n- Mediterranean Chicken - Chicken breast, artichoke hearts, red bell peppers, green olives, onions, feta\n\nLittle Star Pizza creates some delicious pies that pack some serious punch.  I'm really at a loss for words when I try to describe the gloriousness of their pizza.  The deep dish pizza is cheesy, loaded with toppings and covered with a layer of chunky tomato sauce.  But the real kicker is the crispy cornmeal crust.  The texture of the crust is well balanced with the spectacular flavors of the toppings.  Be prepared - it will knock your socks off!  \n\nIt was a pretty standard wait time for two deep dish pizzas.  The service was great - we were seated almost immediately and our waiter was attentive.  The vibe I got from this LSP location was equivalent to a dive bar - relaxed atmosphere, dim lighting, and chill music.  A perfect place to kick back after a long day to enjoy some cold brewskies and unforgettable pizza.    \n\nConsider yourself warned: CASH ONLY!!!\n\nBrass Monkey deep dish at Little Star Pizza - check! I can officially die happy.", "rating": 5, "date": "2009-11-23"}, {"excerpts": ["I make a mean thin crust at home, so the standard is high for us.\n\n"], "author": "Jade F.", "review": "This place is pretty dang tasty.  My husband is from Chicago, and I make homemade pizza just about every week.  So it's safe to say, we know good pizza.  \n\nWe really like their deep dish.  It is so incredibly flavorful.  The sauce is on point -- the right amount of salt and sweetness, and full of chunky tomatoes.  Their veggies are fresh and delicious.  Their sausage and pepperoni will make you wonder why you ever considered being vegetarian.  Their crust is crunchy on the outside, soft on the inside, made with a yummy cornmeal flour.  It's not at all greasy.  \n\nWe aren't a big fan of their thin crust, however.  It was ok, but not memorable.  I make a mean thin crust at home, so the standard is high for us.\n\nTheir mixed salad is really good, if you're into rabbit food.  The vegetables are so fresh, full of perfectly ripe tomatoes and other goodies.\n\nIf you're into deep dish pizza, give this place a shot... it's delicious!", "rating": 4, "date": "2012-06-12"}, {"excerpts": ["First, the crust was a lot lighter and crunchier than a standard-issue deep-dish pizza with a cornmeal flavor and consistency similar to what they served at Nancy's in Chicago.\n\n"], "author": "Ed U.", "review": "You must be my Little Star\n'cause you shine on me even though you're far\nI just think of you and I start to grow\nAnd I need your special pie\nAnd baby, you know...\n\nFor my 400th review - count 'em 400 (...and I do get depressed thinking of all the time I could have spent solving world peace) - I decided to review Little Star Pizza because I had never tried it before last evening. Ever since I saw Nish wax on about it on \"Check Please! Bay Area\", I had been curious what the fuss was all about. But like many who caught sight of the place from the outside, I merely shrugged at the sight of the waiting throngs.\n\nYesterday was a particularly blustery day, and Little Star was not even our first choice. I had actually been meaning to try the bar burger at NOPA. Even though both places open at 5PM, NOPA doesn't serve food until 6, so alas, that will have to wait for another time. Even at a scant 2 1/2 blocks between establishments, it was like barreling through a wind tunnel on Divisadero, though I was heartened to see that Lilly's Bar-B-Q finally replaced their old Brothers-in-Law sign.\n\nIf you wait about ten minutes before 5, you get the privilege of waiting in the little cove of a doorway. One by one, the staff - all very skinny and on bicycles (...I hate them) - give the secret knock and enter the door, as we shiver in the cold wind. Jamie W. and I got dibs on the table next to jukebox. No reason except it provided a bit more light than the ones in the back, and we ended up dodging a bullet when a gaggle of shrieking, South Asian girls galumphed toward the back... apparently to raise the decibel level of the place several inches.\n\nWe were hungry, famished really, so we ordered the $8 Spicy Chicken Wings as an appetizer. Unlike those served at honky-tonk bars across this great land of ours, these were blessedly not greasy, and the spiciness provided a great kick even when doused in the cooling blue cheese dressing. I would have licked the ramekin dry had I not realized I was in public. Oh...and I ate the accompanying mini-carrot sticks so I could pretend I had a vegetable.\n\nGiven the excessive protein content of our appetizer, we went for the small Little Star Special ($17), a smart choice as it turns out. I refuse to call it Chicago-style pizza since a meal at Giordano's or Gino's East could hardly be more different. First, the crust was a lot lighter and crunchier than a standard-issue deep-dish pizza with a cornmeal flavor and consistency similar to what they served at Nancy's in Chicago.\n\nSecond, the filling was a lot fresher-tasting, not the heavy tomato sauce I would normally associate with deep-dish pizza. In fact, the fresh tomatoes used in the sauce moistened the bottom just enough to make the crust that much easier to chew without overwhelming it. The equally fresh spinach had obviously been reduced and then mixed with ricotta, feta and sauteed onions. The combination was ideal, and if a deep-dish pizza could ever taste light, they actually achieve that objective here.\n\nI like the place, even though it was a bit too trendy-dark for my taste. Definitely go as early as you can to avoid the inevitable wait. But if you wait, rest assured, your patience will be rewarded. This is one place where the hype may actually be warranted because...\n\nPie light, pie bright, first pie I ate tonight\nPie light, [Pie bright!] makes everything all right\n\nFOOD - 5 stars...worthy of the hype, at least as far as the Little Star Special and chicken wings are concerned\nAMBIANCE - 4 stars...a bit dark, a bit crowded..but a warmish, welcome vibe all things considered\nSERVICE - 4.5 stars...fast and unobtrusive...perhaps to increase turnover but met my needs for a relatively quick meal\nTOTAL - 5 stars...Nish is right yet again", "rating": 5, "date": "2007-05-27"}, {"excerpts": ["we got the standard cheese pizza, no toppings. ", "definitely the real deal. ", "none of that cracker thin cali style pizza. ", "the magic of a pizza for me is in the cheese. ", "the cheese in this pizza was super thick and substantial. ", "like how its suppose to be. ", "the crust i believe is made from cornbread. ", "the lowest layer of the crust (the part where you can touch on the underbelly of a slice) was slightly hard and crispy. "], "author": "Ferman H.", "review": "came here with the bro and sis. we got the standard cheese pizza, no toppings. definitely the real deal. none of that cracker thin cali style pizza. the magic of a pizza for me is in the cheese. the cheese in this pizza was super thick and substantial. like how its suppose to be. the crust i believe is made from cornbread. the lowest layer of the crust (the part where you can touch on the underbelly of a slice) was slightly hard and crispy. so when you bite, you go through the softness of the sauce, cheese, dough until your met with the crispiness of the bottom layer.\n\nonly modification i would make is to add more salt to the cheese. but yeah, this is the best pizza i've had in cali.", "rating": 4, "date": "2014-04-18"}, {"excerpts": ["Pretty much an outstanding standard pizza, which got us into some pretty outstanding conversation (let's just say our conversation heightened the taste of our pizza...).  ", "Do what you will with that comment, use your imagination.  ", "But DAYAM, it was a good pizza!  ", "Ennnnd Sceeeene!  ", ":)"], "author": "Jennifer L.", "review": "Finally, LITTLE STAR!!!!!  It IS all that it's cracked up to be and IS totally worth the 30 min wait!  Well, you wouldn't be waiting too long if you took the sweet hostess' suggestion and ordered your pie while you wait for your table.  (Thanks!)  While you're waiting, grab a drink at the bar and before you know it, you're seated and a deep dish of wonderment appears in front of you.  Yay!\n\nI had to take a moment to stare at it for a bit because the pie is pretty intriguing and smells delicious (Wafting...Wafting...!).  \n\nFirst question that came to mind was: Is this a fork-and-knife kind of pie or does the crust withstand the weight of the ingredients making it okay to eat with your hands?  Both!  Start off with a fork and knife and cut into the ooey gooey goodness atop the still-crunchy cornmeal crust.  Once at the top, pick it up and devour!  \n\nWe had a Classic Deep Dish, with Sausage, Mushrooms, Green Bells and Onion.  Pretty much an outstanding standard pizza, which got us into some pretty outstanding conversation (let's just say our conversation heightened the taste of our pizza...).  Do what you will with that comment, use your imagination.  But DAYAM, it was a good pizza!  Ennnnd Sceeeene!  :)", "rating": 4, "date": "2010-07-12"}, {"excerpts": ["The pizza took about thirty minutes to arrive, which seemed standard.  ", "One bite ", "and we both agreed that the pizza was fantastic!  ", "It's all about the cornmeal crust, which was crunchy on the outside and soft inside.  "], "author": "Joanne G.", "review": "So I'm on a strict cheapish eats budget for the rest of the summer and Little Star had been at the top of my list for months.   After driving around the TL and finding nothing appealing, we somehow ended up on Divis in front of Little Star.\n\nShared the Mediterranean Chicken deep dish, with feta, green olives, and artichoke hearts.  The pizza took about thirty minutes to arrive, which seemed standard.  One bite and we both agreed that the pizza was fantastic!  It's all about the cornmeal crust, which was crunchy on the outside and soft inside.  Ohh, so good.\n\nI'm not sure what possessed us to get a large, but after about two huge slices, I was completely stuffed.  A 9\" pizza probably would've been plenty.\n\nAdd on a glass of Racer 5 IPA and dinner for two was $30.  With a serious amount of leftovers the next day.\n\nCash only and no reservations taken, though we only waited about 15 minutes for a table.  Atmosphere is kind of hipster, but friendly with good service.\n\nStill thinking about that crust.  And it even holds up well after a night in the fridge!", "rating": 4, "date": "2008-06-21"}, {"excerpts": ["I was a bit apprehensive about coming here because I usually don't enjoy Chicago style pizza and prefer a traditional New York slice over the standard SF thin crust. ", "I had no idea what I was missing! ", "Little Star is the best. ", "I still go to Tony's sometimes when I get the craving for a slice but Little Star has become my favorite place for pizza in the city."], "author": "Ryan S.", "review": "I'm from the East Coast and I admit that I am a snob when it comes to pizza. I was a bit apprehensive about coming here because I usually don't enjoy Chicago style pizza and prefer a traditional New York slice over the standard SF thin crust. I had no idea what I was missing! Little Star is the best. I still go to Tony's sometimes when I get the craving for a slice but Little Star has become my favorite place for pizza in the city.", "rating": 5, "date": "2013-09-09"}, {"excerpts": ["Standard for SF.\n\n"], "author": "Sabeen c.", "review": "After trying LSP two times, i've formed a consistent opinion that I'm ready to share!\n\nLittle star pizza is delicious, deep dish goodness. The slices are really heavy, and 1.5 usually fill me up (to capacity). \n\nThe good? It's no LOSS, with their awesome SAUCE! Seriously, it makes the pizza worth while!\n\nI wish the crust were just as delightful, but it always leaves me wanting something more. Don't get me wrong, the crust is great...but It tends to run a bit dry, and just doesn't make the cut when compared to Paxti's incredibly prepped delicioso crust.\n\nIf only the two places could join forces...\n\nOther Tips:\nParking: not easy, but you can get lucky. Standard for SF.\n\nThe wait: Be prepared, it takes a while. Still worth your time.\n\nOverall, it's a great place to get your deep dish fix!", "rating": 4, "date": "2011-08-27"}, {"excerpts": ["Whenever I go to a place for the first time, I make it a point to either get the standard or the special.  "], "author": "Thomas K.", "review": "I've heard nothing but great things about Little Star.  After my first experience here, it's hard to argue with the majority of the comments I've read and heard.\n\nI went with a friend who's been here before.  The special was a meatball, ricotta, mushroom deep dish.  Whenever I go to a place for the first time, I make it a point to either get the standard or the special.  I want to give a place the best opportunity to succeed.\n\nIt was totally decent.  The meatballs were appropriately spiced, the mushrooms had a nice texture, and they use a good quality cheese.  The sauce was just a hair on the sweet side for me, but everything else met or exceeded expectations.  The one thing I have to say is the crust was amazing; absolutely amazing.\n\nWe (two healthy guys) split a small deep dish.  I definitely could've eaten more, but I didn't leave hungry.\n\nPrice: 4 stars, totally appropriate for the amount of food (note: cash only)\nAmbiance: 4 stars, A little crowded, a little noisy, but an appropriate experience for a pizza joint.\nService: 4 stars, the crowd made seating a challenge, but our server was excellent.\nFood: 4.5 stars, I might upgrade to 5 after further dining experiences. \n\nOverall, I'm a supporter.\n\nOne final thing, I didn't try it, but I hear their cheese cake is amazing.", "rating": 4, "date": "2010-01-10"}, {"excerpts": ["* appetizer: buffalo wings (~$8) pretty standard. ", "Not spicy at all. \n"], "author": "Sarah C.", "review": "I love the deep dish pizza. For four people, we got:\n\n* appetizer: buffalo wings (~$8) pretty standard. Not spicy at all. \n* one large deep dish: 1/2 classic and 1/2 little star (I think the lg deep dish pizza is ~$23 which isn't too expensive for a deep dish pizza)\n\nThe pizza is amazing!!! I also love that they let you do half / half.. \nI'm getting myself confused, but one of them is more meaty with sausage bits, while the other is more vegetarian (eg. spinach / ricotta cheese, mushrooms, etc). I liked both.. but if you have guy friends in your party, may want to consider the meaty one of the two! \n\nOn a side note - they also have DELICIOUS pear cider for $4 / glass.\n\nCon:\n1) Parking here is a NIGHTMARE! There are no garages, very hill-y, and street parking only!\n\n2) They don't take reservations OR call-ins.. meaning, you HAVE to show up and wait around.. we arrived at 8pm on Saturday night and ended up waiting about 50 minutes! :(", "rating": 5, "date": "2011-01-31"}, {"excerpts": ["Sure, the wait was long and the service took a while, but that's pretty standard with any restaurant with 4+ stars on yelp.  "], "author": "Alyxandra D.", "review": "Sure, the wait was long and the service took a while, but that's pretty standard with any restaurant with 4+ stars on yelp.  A bonus was that they put the order in for our pizza while we waited, so our wait once seated wasn't nearly as long!\n\nThe food was really good - tasty deep-dish (and no extra charge for splitting toppings - half no meat!), delicious garlic bread (basically a mini pizza, and creative drinks.", "rating": 4, "date": "2013-03-24"}, {"excerpts": ["Take a Chicago transplant here for a first date and expect a call back sooner than the standard 3 Day Rule."], "author": "Kerry D.", "review": "Little Star Review #968.  \n\nTake a Chicago transplant here for a first date and expect a call back sooner than the standard 3 Day Rule.", "rating": 5, "date": "2009-01-26"}, {"excerpts": ["one of best had....\n\nsecond choice standard thin-crust pizza pie....standard sizing sixteen-inch large for same/similar pricing.....", "standard thin being unworthy of praise...", "in fact below standard, subpar...."], "author": "Hen A.", "review": "admit facts....digging deep dish...pizza pie...toppings thick hearty....over inch thickness...fine little star deep dish, little small, little pricy....twelve-inch large at $twenty-two....although repeat...fine deep dish pie...one of best had....\n\nsecond choice standard thin-crust pizza pie....standard sizing sixteen-inch large for same/similar pricing.....standard thin being unworthy of praise...in fact below standard, subpar....", "rating": 3, "date": "2008-10-02"}, {"excerpts": ["The salad was simple and good, but the chicken wings were just standard. "], "author": "MJ W.", "review": "I don't know what is the deal w/ all the other 4 & 5 star ratings. I can only say satisfactory over all. I had better deep dish pizza else where although I am not a pizza aficionado. I don't like the crust so much, not with cornmeal. Also, i would prefer a bit more cheese. The sauce is not too bad; so, for the pizza. I would say 2 stars. \n\nThe salad was simple and good, but the chicken wings were just standard. Plus the modest interior but not the usual Italian cliche, I give an overall 3 stars.\n\nI will have another try of the thin pizza. I hope that's what I am missing. \n\nLast thing, it's very hard to find it at night. I drove by three times not seeing it. It's sign was dark and small. Maybe I was expecting the usual cliche for the sign like white, green, and red stripe awning says\" Little Star Pizzeria,\" but, no. It is at the end of the strip and doesn't seem to have any more business, you know.  Should the management pay some attention to this ^_^, I don't know. \n\nAnyway, you need to have its address to find it. It's at the conner of an unlikely place.", "rating": 3, "date": "2008-12-19"}, {"excerpts": ["When I moved to San Francisco, my friends introduced this place to me, and it has since become the standard at which I now measure all pizzas.\r\n\r\n", "I can't say enough good things about this place. ", "When you go, expect to wait 10-20 minutes to get a table. ", "Before thinking twice, i'll tell you now, its WORTH THE WAIT!\r\n\r\n", "They have a nice bar there, where you can order some beer or wine to drink while you wait. ", "The music and atmosphere there is great. ", "They don't spend a lot on the decor of the place, but, whatever they have done seems to work really well. ", "Low light, lots of people, good drinks, almost makes you forget that you actually came to this place to eat pizza. ", "So, the wait flies by.\r\n\r\n", "The pizza - wow. ", "Deep dish, and thin crust. ", "I recommend the white pizza veggie thin crust, and the meat deep dish. ", "Unreal. ", "Something about their crust is different, and tastes really really good.\r\n\r\n", "I haven't been in over a month, and I can't stop thinking about it!\r\n\r\n\r\n", "Update:\r\n---------\r\n\r\n", "Just went. ", "Holy crap! ", "Tried the deep dish with spinach and garlic, etc.. and had an out of body experience.\r\n\r\n", "One other note - BRING CASH - they don't accept plastic."], "author": "Lee M.", "review": "When I moved to San Francisco, my friends introduced this place to me, and it has since become the standard at which I now measure all pizzas.\r\n\r\nI can't say enough good things about this place. When you go, expect to wait 10-20 minutes to get a table. Before thinking twice, i'll tell you now, its WORTH THE WAIT!\r\n\r\nThey have a nice bar there, where you can order some beer or wine to drink while you wait. The music and atmosphere there is great. They don't spend a lot on the decor of the place, but, whatever they have done seems to work really well. Low light, lots of people, good drinks, almost makes you forget that you actually came to this place to eat pizza. So, the wait flies by.\r\n\r\nThe pizza - wow. Deep dish, and thin crust. I recommend the white pizza veggie thin crust, and the meat deep dish. Unreal. Something about their crust is different, and tastes really really good.\r\n\r\nI haven't been in over a month, and I can't stop thinking about it!\r\n\r\n\r\nUpdate:\r\n---------\r\n\r\nJust went. Holy crap! Tried the deep dish with spinach and garlic, etc.. and had an out of body experience.\r\n\r\nOne other note - BRING CASH - they don't accept plastic.", "rating": 5, "date": "2006-07-16"}, {"excerpts": ["but it wasn't anything standard or normal like pepperoni- ", "will have to do that next time. "], "author": "Panda B.", "review": "Just plain good pizza. Everything just works. Not overly greasy, flavorful... I can't remember what I had but it wasn't anything standard or normal like pepperoni- will have to do that next time. One tip: Don't go during high-traffic hours if possible.\n\n-1 star for cash only. Wtf is that?", "rating": 4, "date": "2009-08-30"}, {"excerpts": ["They have a bar and the tables are a mix of high tops and standard.\n\n"], "author": "Nick B.", "review": "I gotta start this one off with a.. BABY BABY!\n\nBefore coming to Little Star, I would have always taken a really good slice of NY style pizza over Chicago. Don't get me wrong - I still would BUT Little Star would make me hesitate.\n\nLittle Star has a really quaint yet hip vibe inside. Everything is low lit. They have a bar and the tables are a mix of high tops and standard.\n\nOn to the good stuff:\nPizza - We ordered a Brass Monkey - not even on the menu but our bartender put us up on the \"not so secret, secret menu\". The pizza was delicious!! Just the right amount of cheese to topping ratio. The dough wasn't too think but wasn't think like a cracker. All of the toppings tasted fresh. Awesome!\n\nBeer - I only had the Amber Boont. There was no need to try anything else. Double Awesome! Too bad the wine selection was lacking.\n\nWord of advise to all my east bay people out there... Skip Zachary's and just keep driving to Little Star. Its better!", "rating": 4, "date": "2009-08-25"}, {"excerpts": ["Being from St. Louis, I have a very high standard when it comes to thin crust pizza, Chicago style pizza (a.k.a. deep dish), calzones...", "you name it. ", "As far as I'm concerned St. Louis, Chicago and New York set the bar for good pizza.  \n"], "author": "Stephanie W.", "review": "Oh my God.\nFINALLY.  \nReal pizza west of the Mississippi.\n\nBeing from St. Louis, I have a very high standard when it comes to thin crust pizza, Chicago style pizza (a.k.a. deep dish), calzones...you name it. As far as I'm concerned St. Louis, Chicago and New York set the bar for good pizza.  \nLittle Star just put the West Coast on the map.\n\nThis pizza is perfection.  More specifically the deep dish, which usually isn't my favorite style of pie.  Melts in your mouth kinda good.  The amount of cheese is perfect.  It's not too doughy, has plenty of toppings, but isn't overflowing with them. \nAdd a beautiful amber beer to the mix and I'm in heaven.\n\nIs there a Yelp Elite event in the works that somehow involves this pizza??  If not, hook it up Nish!", "rating": 5, "date": "2007-09-24"}, {"excerpts": ["To date, Little Star is my standard for pizza.\r\n\r\n", "Biases.  ", "For me, it's all about the crust.  ", "Little Star does one of the best cornmeal crusts around.  ", "Others may disagree and say it's all about the toppings.  ", "Anyone can change the toppings, but for me, that crust takes a little more time and effort to perfect.  ", "So ask yourself, are you about toppings or crust?  ", "Are you a top or a bottom?  ", "LOL\r\n\r\nParking on a Friday night.  ", "Forget it.  ", "This is SF and it'll take you some time to find street parking.  ", "We were able to find street parking 2 to 3 blocks away.\r\n\r\n", "Waited and waited.  ", "Adapt to the wait time.  ", "It'll take up to 1 1/2 hours to get your food.  ", "Upon our arrival, we were told it was a 35 minute wait to be seated and that mandatory 1/2 hour wait required for deep dish pizza.  ", "Okay, no problem.  ", "Wading through the standing room only waiting crowd, we made our way to the bar.  ", "We ended up ordering a pint each of an ale that had the name \"Racer 5\" in it.  ", "We were buzzing after a few sips.  ", "Hmmmm.  ", "I later found out that it had 7+% alcohol in it.  ", "The buzz, the decent crowd and the conversation made time fly.  ", "I want more Racer 5.\r\n\r\n", "The halogen track lighting highlit spots at various tables.  ", "The wait staff was energetic and easy to reach when flagging them down.  ", "Even with the smart and polite crowd about the restaurant, I'm not sure I'd recommend this place to kids.  ", "It was more of a bar room intimate ", "dim inside.  ", "Hmmmm.  ", "Maybe bring the kids on a weekend afternoon?\r\n\r\n", "The main event.  ", "We ordered 1/2 the Little Star and 1/2 the Classic.  ", "We were impressed with both.  ", "Again, it's that crust that had me at hello.  ", "I'll definitely be returning to Little Star, but my search for other good pizza continues, and the journey may be long.  ", "Again, if you're a crust fan, Little Star is a must have."], "author": "D. A.", "review": "To date, Little Star is my standard for pizza.\r\n\r\nBiases.  For me, it's all about the crust.  Little Star does one of the best cornmeal crusts around.  Others may disagree and say it's all about the toppings.  Anyone can change the toppings, but for me, that crust takes a little more time and effort to perfect.  So ask yourself, are you about toppings or crust?  Are you a top or a bottom?  LOL\r\n\r\nParking on a Friday night.  Forget it.  This is SF and it'll take you some time to find street parking.  We were able to find street parking 2 to 3 blocks away.\r\n\r\nWaited and waited.  Adapt to the wait time.  It'll take up to 1 1/2 hours to get your food.  Upon our arrival, we were told it was a 35 minute wait to be seated and that mandatory 1/2 hour wait required for deep dish pizza.  Okay, no problem.  Wading through the standing room only waiting crowd, we made our way to the bar.  We ended up ordering a pint each of an ale that had the name \"Racer 5\" in it.  We were buzzing after a few sips.  Hmmmm.  I later found out that it had 7+% alcohol in it.  The buzz, the decent crowd and the conversation made time fly.  I want more Racer 5.\r\n\r\nThe halogen track lighting highlit spots at various tables.  The wait staff was energetic and easy to reach when flagging them down.  Even with the smart and polite crowd about the restaurant, I'm not sure I'd recommend this place to kids.  It was more of a bar room intimate dim inside.  Hmmmm.  Maybe bring the kids on a weekend afternoon?\r\n\r\nThe main event.  We ordered 1/2 the Little Star and 1/2 the Classic.  We were impressed with both.  Again, it's that crust that had me at hello.  I'll definitely be returning to Little Star, but my search for other good pizza continues, and the journey may be long.  Again, if you're a crust fan, Little Star is a must have.", "rating": 5, "date": "2006-08-29"}, {"excerpts": ["We got the small standard deep dish.  ", "It was good, but almost too much for us -- it's heavy.  ", "I think I prefer the thin crust-style. ", "That being said, I think it's a fun, cool place for SF pizza."], "author": "Andrew G.", "review": "We visited the outlet in NOPA, which was packed on a Sunday night.  Despite the mob, the service was great and we ended up sitting at the bar.  We got the small standard deep dish.  It was good, but almost too much for us -- it's heavy.  I think I prefer the thin crust-style. That being said, I think it's a fun, cool place for SF pizza.", "rating": 3, "date": "2011-08-07"}, {"excerpts": ["Standard issue hipster-ish interior with low lights, mixture of wood and metal, and some art on the wall. "], "author": "Alvaro H.", "review": "Little Star, Delfina, Golden Boy, Pizza Orgasmica...there are many pizza places in the city that word has it 'do not suck', because let's be honest, West Coast pizza sucks. That's right, I said it, and you should have known this already. Golden Boy is my favorite so far but after trying Little Star it's going to be my local favorite (the schlop on Lower Haight is only good for drunk eating).\n\nAmbiance (4): Standard issue hipster-ish interior with low lights, mixture of wood and metal, and some art on the wall. Not complaining, it's good to go, just not what I expect of a pizza joint. \n\nFood (4): They are known for their deep dish but after going to Chicago a few times, I have sworn off deep dish pizza. It's just too much...too much! We had a thin crust with pancetta, goat cheese, chicken, and I don't remember what else (it had me at pancetta). It was pretty tasty and the crust was good and crisp. We ordered the smaller size since we were having wings too and it was just the right size. The chicken wings were not bad, but I haven't had a chicken wing that doesn't remind me of microwaveable buffalo wings since Sports Grill (new English rule: double negative bad, triple negative good). This might be related to the wings not being grilled, which is my preferred wing preparation method. In terms of drinks, I appreciate that they have tempranillo and malbec in stock in addition to the usual suspects, so if you like red wine, they are bound to have something that appeals to your tastes. Of course they have beer and white wine too. Also the 10 dollar corkage fee is appreciated.\n\nService (4): Great, friendly service. The timing of the dishes arriving was perfect and I don't know if it's coincidence or the server putting in the order in a certain way or us eating at just the right rate. Anyway, I felt welcomed and being taken care of without the incessant and forced niceties of some fancy restaurants (I am looking at you Gary Danko). There always seems to be a wait to get a table though, but what can you do when the place has good foodie cred?\n\nValue (4): The prices of all menu items seemed just right. That includes the cost of drinks and I already mentioned the corkage fee.\n\nOverall: I liked this place but did not love it like I do Golden Boy. The quality is good and the flavors were good but just not amazing. However, this the best option in my area, so next time take out will be the way to go to avoid the wait. Oh and if you have a deep dish craving, this is one of the few places in the city that I have spotted it so far.", "rating": 4, "date": "2010-05-22"}, {"excerpts": ["there was a nice NOPA hipster parade going on, which is different than the standard Mission hipster parade - HOORAY for different thrift shops and koi tattoos instead of dragons.  ", "As a city, are we really so divided that we have MICROCLIMATES as well as ", "MICROCULTURE?  "], "author": "Melissa Y.", "review": "OH MAH GAWD.\n\nI waited AN HOUR AND A HALF for a two top on a Wednesday night.  there was a nice NOPA hipster parade going on, which is different than the standard Mission hipster parade - HOORAY for different thrift shops and koi tattoos instead of dragons.  As a city, are we really so divided that we have MICROCLIMATES as well as MICROCULTURE?  Can't we all just get along? \n\nAnyway, I wasn't that hungry when I walked in but after that long wait, I was ready for some killer pizza.  I had the Little Star deep dish and the house salad.  We got a large for 2 people and had four slices left over.  Delicious crust and ingredients.  Oh, and then we also ordered the homemade cheesecake because nothing tops off deep dish pizza better than deep dish cheesecake.  So effing good. \n\nThe food absolutely rescued this dining experience.", "rating": 4, "date": "2008-03-27"}, {"excerpts": ["If your standard is Zachary's, you've wasted a lot of time. ", "The sooner you get over to LS, the sooner you'll get back on track. ", "Seriously, if Little Star is a 4, Zachary's is a 2. ", "I've tried the Classic, the Little Star, and the Mediterranean Chicken. ", "The MC is my favorite, but the LS is pretty good too."], "author": "Bib G.", "review": "This is the best Chicago-style pizza that I've tried in the Bay Area. If your standard is Zachary's, you've wasted a lot of time. The sooner you get over to LS, the sooner you'll get back on track. Seriously, if Little Star is a 4, Zachary's is a 2. I've tried the Classic, the Little Star, and the Mediterranean Chicken. The MC is my favorite, but the LS is pretty good too.", "rating": 5, "date": "2010-05-01"}, {"excerpts": ["There was one Elliott Smith track, but for the most part it was standard top 40 radio: Sting, Radiohead, and R.E.M.   ", "But played at ear-shattering volume.  ", "I've been to quieter rock concerts.\r\n\r\n", "It took close to an hour to get the pizza, at which point we got doggy bags and took the pizza to Cafe Azur because we just couldn't take it any more.  ", "I was partially deaf, my 19 year old brother's ears were ringing, and his girlfriend had a headache for the next two hours.  \r\n\r\n", "Great pizza, but you have to be drunk to find this appealing.  ", "Either that, or you REALLY REALLY want to be cool.\r\n\r\n", "Incidentally, I've tried posting this review on citysearch.com, and it just never shows up.  ", "Makes me doubt citysearch's objectivity, to say the least.  ", "As at least one other person did, I signed up on Yelp specifically to warn people off this place."], "author": "Will S.", "review": "We went to this place at 6:30 pm Sunday, based on the reviews here and got immediate seating \"because the person before you got a beer and then walked out.\"  (Note to self: take the hint next time.)\r\n\r\nThe place was packed.  Contrary to the reviews and the LSP website, the music is nothing special.  There was one Elliott Smith track, but for the most part it was standard top 40 radio: Sting, Radiohead, and R.E.M.   But played at ear-shattering volume.  I've been to quieter rock concerts.\r\n\r\nIt took close to an hour to get the pizza, at which point we got doggy bags and took the pizza to Cafe Azur because we just couldn't take it any more.  I was partially deaf, my 19 year old brother's ears were ringing, and his girlfriend had a headache for the next two hours.  \r\n\r\nGreat pizza, but you have to be drunk to find this appealing.  Either that, or you REALLY REALLY want to be cool.\r\n\r\nIncidentally, I've tried posting this review on citysearch.com, and it just never shows up.  Makes me doubt citysearch's objectivity, to say the least.  As at least one other person did, I signed up on Yelp specifically to warn people off this place.", "rating": 1, "date": "2005-08-08"}, {"excerpts": ["they use a cornmeal crust which is different than your standard pizza crust, but it works well, and is delish. if you're a pizza lover, give this place a try, but go with the deep dish."], "author": "Bernie S.", "review": "awesome deep dish pizza! this place is great. get there early because it gets packed fairly quickly. they use a cornmeal crust which is different than your standard pizza crust, but it works well, and is delish. if you're a pizza lover, give this place a try, but go with the deep dish.", "rating": 5, "date": "2011-04-04"}, {"excerpts": ["Not only are these guys members of the Viv network (www.doyouviv.com), but they're also eco-friendly beyond the standard call of duty. \n\n"], "author": "Ryan O.", "review": "I don't think there's much I could add to the glowing descriptions that people have already given except as to inform ya'll of Little Star's eco-friendliness. \n\nNot only are these guys members of the Viv network (www.doyouviv.com), but they're also eco-friendly beyond the standard call of duty. \n\nTheir composting program is remarkable, and their recycling is throughly comprehensive. \n\nAll of this is very suprising for such a popular spot, with such great food, and with such a following purely for pizza-sake- But nonetheless, little star gets 5 stars as a sustainable business.\n\n...and as you can see- they get 5 for the food. (thats 10 stars!)\n\njust go and eat there. its that simple. i would recommend it to anyone who visits SF.", "rating": 5, "date": "2009-09-02"}, {"excerpts": ["My standard lineup: mixed salad followed up by the Little Star deep dish, all washed down with a lovely glass (or two) of Cotes du Rhone. ", "The cornmeal crust is to-die-for, the chunky tomatoes are addictive ... mmmm. ", "I had it twice last week and was jonesing for s'more today ... a girl can keep on hoping, ", "can't she?"], "author": "lisa p.", "review": "If only Little Star would open up a third spot in the Inner Sunset ... I'd be there weekly. Yes, everybody loves this place, so I'm not alone there. I never thought I'd say that LS kicks Zachary's ass, but ... ahem ... I'm afraid it does. My standard lineup: mixed salad followed up by the Little Star deep dish, all washed down with a lovely glass (or two) of Cotes du Rhone. The cornmeal crust is to-die-for, the chunky tomatoes are addictive ... mmmm. I had it twice last week and was jonesing for s'more today ... a girl can keep on hoping, can't she?", "rating": 5, "date": "2008-03-24"}, {"excerpts": ["Little Star makes two types of pizza: a Chicago-inspired deep dish and a more standard thin crust. ", "Unfortunately, both of these pizzas arrive with more than a tinge of California. ", "Just look at the menu of pizza specials and toppings... ", "feta? ", "artichoke hearts? ", "Please. ", "Being a Chicagoan, of the two pizza styles, I prefer the deep dish. ", "Chicago-style deep dish pizza should be hefty and artery-clogging. ", "Little Star's version seems to be inspired by the top-notch pizza at Chicago's Gino's East, which has a cornmeal crust and, if you order right, an enormous thick Italian sausage patty. ", "Little Star's got the cornmeal crust, but here it's a little more rustic... ", "sort of polenta-y, almost. ", "And it's particularly crumbly when cold, which sucks. ", "The tomato sauce is good, with a nice herb flavor. ", "But the toppings and cheese seem to get lost underneath the sauce. ", "I prefer a thick well-done crust of cheese on top, a la Chicago's Carmen's Pizzeria. ", "Vis a vis the thin crust pizza", ", it's passable. ", "Who cares about thin crust when deep dish is on the menu? ", "Recently, I enjoyed a Pompagne... a generous champagne cocktail with pomegranate juice. ", "Yummy and drunk-making. ", "Final gripe: ", "why no delivery? ", "What is it with you people?"], "author": "Jon L.", "review": "I can't believe I just gave a pizza place in San Francisco four stars. I better write this review before I change my mind. Little Star Pizza is the best pizzeria in San Francisco, hands down. That does not, however, mean that they have great pizza. The four stars that I have awarded this establishment are for attitude and effort, not achievement. Little Star makes two types of pizza: a Chicago-inspired deep dish and a more standard thin crust. Unfortunately, both of these pizzas arrive with more than a tinge of California. Just look at the menu of pizza specials and toppings... feta? artichoke hearts? Please. Being a Chicagoan, of the two pizza styles, I prefer the deep dish. Chicago-style deep dish pizza should be hefty and artery-clogging. Little Star's version seems to be inspired by the top-notch pizza at Chicago's Gino's East, which has a cornmeal crust and, if you order right, an enormous thick Italian sausage patty. Little Star's got the cornmeal crust, but here it's a little more rustic... sort of polenta-y, almost. And it's particularly crumbly when cold, which sucks. The tomato sauce is good, with a nice herb flavor. But the toppings and cheese seem to get lost underneath the sauce. I prefer a thick well-done crust of cheese on top, a la Chicago's Carmen's Pizzeria. Vis a vis the thin crust pizza, it's passable. Who cares about thin crust when deep dish is on the menu? Recently, I enjoyed a Pompagne... a generous champagne cocktail with pomegranate juice. Yummy and drunk-making. Final gripe: why no delivery? What is it with you people?", "rating": 4, "date": "2006-05-09"}], "premium": [{"excerpts": ["With Janice leading the charge (you don't think our vesper knew Peter was bringing premium vino, do you?)", ", we had no problem demolishing both the wine and the pizza in short order.  ", "Thanks ", "Peter - "], "author": "Glenn G.", "review": "It's staggering to think about how many pizza joints there are in the Bay Area.  Even if you consider only the ones in a single category, say Chicago-style, there are still more of them then there are Doyles in Boston.  That makes it all the more impressive that Little Star is so outstanding that it's one of only three pizzerias in the Bay Area good enough to be included in the \"Holy Trinity\" of Chicago-style deep-dish pizza joints.\n\nWhich of the Trinity is the best of the best?  I've weighed in with my opinion before:  http://www.yelp.com/biz/patxis-chicago-pizza-palo-alto#hrid:rIQ6W8ebPxMBcGCOd1VkAQ Several of my friends have also weighed in with theirs, and horror of horrors: our opinions differ!  With the other two Holy Trinity pizza joints still fresh in my mind from recent visits, I set out to revisit Little Star at the end of February.  Maybe I'd change my mind, maybe my friends would change theirs; either way, you can't go wrong with pizza as good as this, and Yelpers that are this cool!  I organized a small PYE and set out to meet uber-Elites Cecilia S., Janice C., Bobby L., and Peter L. for an evening of world-class pizza, drinking, and (eventually) Karaoke.  Our first stop was Little Star in Western Addition.\n\nThe first of us hit Little Star at 5:30 and immediately proceeded to the bar (we Elites have our priorities straight); a table became available just as the third and fourth of our number arrived.  The atmosphere is a little dark, but decidedly classier then your average pizza joint.  The very friendly and accommodating staff served up some excellent recommendations about toppings, and got our pizza and drink orders started in short order.  \n\nFirst up, we got an order of garlic bread for the table.  The garlic bread is a \nloaf of warm sourdough served with a blend of butter & extra virgin olive oil and a bulb of roasted garlic. http://www.yelp.com/biz_photos/__I9HmtBMV4dDkEgT22V4g?select=9zl79X8GugMmlChpiTMTNw As I didn't know Peter was coming loaded for bear, I ordered a Red Tail on draft to compliment the bread.  http://www.yelp.com/biz_photos/__I9HmtBMV4dDkEgT22V4g?select=J1o2YGM2OylQBpRqlUcfjQ\n\nDeep dish being Chicago style pizza's claim to fame, we ordered a large Little Star - Spinach blended with ricotta and feta, mushrooms, onions, garlic, to which we added sausage, as we're all unrepentant Carnivores. http://www.yelp.com/biz_photos/__I9HmtBMV4dDkEgT22V4g?select=6IEfuIUvVz5Ko2DKoXOVMA Because diversity is the spice of life, and (more importantly) because Yelpers eat like Grizzly Bears coming out of hibernation, we also ordered a White Pie - Garlic olive oil base, mozzarella, roasted zucchini, fresh tomatoes, feta. http://www.yelp.com/biz_photos/__I9HmtBMV4dDkEgT22V4g?select=BYJZd609SPcwcpqCtx67Dg\n\nJanice C., who quite out of character started out the evening drinking water, traded up her beverage when Peter L. arrived; he brought a couple of outstanding bottles of Imagery wine to share!  With Janice leading the charge (you don't think our vesper knew Peter was bringing premium vino, do you?), we had no problem demolishing both the wine and the pizza in short order.  Thanks Peter - next time, it's my turn to bring the wine! :-)\n\nThe $64,000 question - just how good is their pizza?  I for one am convinced that Little Star unquestionably belongs in the \"Holy Trinity\"; their corn-meal crust is without equal, their sauce and their toppings are first tier, and every slice of their pies drips with lush, gooey, cheesy goodness.  For my money, while I think Chicago style pizza is at it's best with double-crusted variants like those that can be found at Zachary's and Paxti's, I'd happily consume mass-quantities of Little Star pizza multiple times a week.  Mammon only knows what I was thinking on my first visit to the Little Star on Valencia Street - five stars all the way!\n\nNow, on to the drinking and Karaoke!", "rating": 5, "date": "2012-04-28"}, {"excerpts": ["I guess you could call this high end pizza as the speciality pizza prices are $19 for a small and $21 for a large, but I've never been reluctant to pay the premium prices....because the quality is truly worth it.  \n\n"], "author": "LaSha G.", "review": "I've been here twice and have been happy both times.  I guess you could call this high end pizza as the speciality pizza prices are $19 for a small and $21 for a large, but I've never been reluctant to pay the premium prices....because the quality is truly worth it.  \n\nAnyways, the 5 star rating comes because I ordered three pizzas and some appetizers for a movie night this week and the order was ready at 6:45pm like I requested and everything was piping hot and properly labeled.  I only had to wait 5 minutes or so for them to accumulate and double check my order.  I was very much impressed.\n\nThe pesto chicken is quite tasty and the sausage/ pepperoni/ mushroom is my favorite.  The mushrooms are thinly sliced and flavorful...not big and chunky which I detest.  I plan to try the deep dish next time since it was gobbled up before I could get to it...but from the feedback i received from my movie night guests, the LIttle Star deep dish pizza is \"comparable\" to Zachary's but not better.   I haven't tried Zacahary's yet so we'll see...", "rating": 5, "date": "2007-01-31"}, {"excerpts": ["We got stuck in the corner table by the window which made space a premium and it was quite dark in this section so it was hard to see the food."], "author": "O'Shea J.", "review": "Staff was great - the hostess took our order while we waited on a table and our server kept us laughing every time she came by. I'm not into Chicago style deep dishes but the pizza here is just amazing. It wasn't a big sloppy, soggy mess. Instead, the bottom was crisp, forming a solid foundation making it very hand holdable. LOTS of cheese, which I like. The wings were spicy but good. Garlic bread is awesome here (see pics). We got stuck in the corner table by the window which made space a premium and it was quite dark in this section so it was hard to see the food.", "rating": 4, "date": "2010-09-24"}]}