{"himalayan momo": [{"excerpts": ["Himalayan Momo ", "(We ordered vegetable)\n", "Minced chicken, pork or vegetable wrapped in flour dough and steamed. ", "Served with chutney sauce made of sesame, chili and tomato. \n"], "author": "Shruti D.", "review": "My friend and I came here on a chilly Sunday evening around 8:30pm. One guest was just leaving, otherwise, it was just us and then another group that showed up around 9:30pm. The ambiance is warm and calming and staff is friendly.\n\nFor appetizer, we ordered:\n\nHimalayan Momo (We ordered vegetable)\nMinced chicken, pork or vegetable wrapped in flour dough and steamed. Served with chutney sauce made of sesame, chili and tomato. \n$6.99\n\n\nFor main entrees we ordered:\n\nAlu Tama Bodi\nPotato, black-eyed beans, and bamboo shoot cooked with fresh tomatoes, garlic, ginger and spices.\n$11.99 (a la carte)\n\nTofu Tarkari (We substituted paneer)\nTofu and green beans cooked in light cream with fresh tomatoes, garlic, ginger and spices.\n$11.99 (a la carte)\n\n\nThe momo's were nice. The momo sauce was good, could have had a little more pop and flavor to it though, maybe some salt.\n\n\nFor the tarkari, we substituted paneer for the tofu. As a paneer tikka masala fan, this was tasty and quite filling because of the creaminess. The green beans were a nice touch.\n\nThe bean dish was interesting and different with the bamboo shoots addition, but I'd say this dish was very light and delicious. Also, a more healthy pick.\n\nThe naan and rice come with order of an entree and the naan and rice we're done right.\n\nI'd recommended trying out this restaurant. \n\n\nExcuse the messy food/table in the photos!", "rating": 4, "date": "2017-06-04"}, {"excerpts": ["We started off with the Himalayan Momo - really tasty dumplings especially when dipped in the sauce along with Samosas and the Mismas Pakauda - a spinach dish with onion and spices. ", "All served as a great prelude to our main courses of Poleko Khasi (lamb) and Poleko Kukhura (chicken) - that was served beautifully. ", "Lamb especially is a tricky dish to prepare as many times "], "author": "Mike G.", "review": "Went here a few nights ago with family and was treated to a truly delicious dinner. We started off with the Himalayan Momo - really tasty dumplings especially when dipped in the sauce along with Samosas and the Mismas Pakauda - a spinach dish with onion and spices. All served as a great prelude to our main courses of Poleko Khasi (lamb) and Poleko Kukhura (chicken) - that was served beautifully. Lamb especially is a tricky dish to prepare as many times the gamey taste is too obvious but this was not the case at all here.\n\nThe service was timely, polite and courteous and the ambience was perfect. Photos of Nepalese culture and locations line the walls and might even inspire some to climb Everest at some point. I am looking forward to returning here for another meal in the future.", "rating": 5, "date": "2017-09-14"}, {"excerpts": ["Himalayan momo  is a no go! ", "Not yummy, skin was too soft and it was dry, the sauce that came with it didn't help either \nPoleko Kashi sizzling tandoori plate wasn't too bad, tasty\n", "Chowmein ra sabi was the best plate for me, it was the perfect noodle dish ", "but then again it's hard to mess up on chowmein...\n", "Kukhurako Ledo was an entree but it was so small! \n", "Ordered one more vegetable curry that was not memorable as well"], "author": "Christina T.", "review": "This place was  okay, the spices aren't too strong. Nothing really caught my taste buds... \nHimalayan momo  is a no go! Not yummy, skin was too soft and it was dry, the sauce that came with it didn't help either \nPoleko Kashi sizzling tandoori plate wasn't too bad, tasty\nChowmein ra sabi was the best plate for me, it was the perfect noodle dish but then again it's hard to mess up on chowmein...\nKukhurako Ledo was an entree but it was so small! \nOrdered one more vegetable curry that was not memorable as well", "rating": 2, "date": "2014-09-29"}, {"excerpts": ["We started our Saturday night dinner with the Himalayan Momo ($6.85). ", "http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=Hcc-htAdOZs_JFtxw7PWCw ", "The potsticker-like dumplings were steamed and served with chili, sesame and tomato chutney. ", "The skin was a bit doughier than expected (I'm trying to stay away from refined carbs) ", "so I just ate the pork filling which was packed with robust seasonings. ", "I loved the accompanying aioli-like chutney which gave a fiery tang. ", "Next, came the Tofu Tarkari ($10.35), a tofu and green been curry dish which was a lot SMALLER than anticipated. ", "http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=nouAWbMVfKn2dEB3Uj7CVw ", "The mini silver bowl had only three fried tofu pieces and green beans swimming in a fragrant light tomato cream sauce with prominent garlic and ginger spices. ", "The silkiness and tantalizing flavors of the sauce was purely addicting and a perfect accompaniment to the basmati rice and soft naan which I sneaked several bites of (SHHHHH!). ", "As the aroma of sizzling onions permeated in the air, I knew our Poleko Kukhura (Chicken Tandoori -$13) ", "dish was arriving. ", "http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=SbjYhwXJ-k7lAWOJLDOq0A ", "Yelpers weren't lying when they say this is the \"best chicken tandoori\" they've had. ", "Marinated in yogurt and spices and then grilled, the chicken breasts were succulently moist (from the dairy in the yogurt) with aromatic nuances of garlic and ginger. "], "author": "Cherylynn N.", "review": "Wikipedia IS my best friend.\n\nYou see, Wikipedia has saved me from some potentially embarrassing moments. \n\nColleague: \"Cherylynn, what did you think about the Dalai Lama controversy?\"\nMe *thinking*: \"The f*ck?...Dolly, the (cloned) sheep?\" *scurries to the restroom*\nMe: \"Ahh yes, the spiritual leader of Tibet...\" *phew*\n\nClearly, politics are not my forte and neither is geography. I stumbled upon Little Nepal (Himalayan/Nepalese cuisine) on Yelp and immediately thought it was Eskimo food because you know, Eskimos are from the Himalayan Mountains. I'm not even going to try to explain my logic here. :/\n\nWith a quick tap to Wikipedia, I found out that Himalayan/Nepalese cuisine is similar to Indian cuisine with Chinese influences. Lentils, curries, and tandoori are some common dishes. Ok, interesting enough to give it a shot. \n\nTucked along the cute Bernal Heights neighborhood, Little Nepal's contemporary and festive vibe with crisp white linens, shiny wooden furnishings, bright orange walls and colorful mini portrait quilts was a pleasant surprise. With seating for about 35 people, this cute restaurant was nice and cozy.\n\nWe started our Saturday night dinner with the Himalayan Momo ($6.85). http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=Hcc-htAdOZs_JFtxw7PWCw The potsticker-like dumplings were steamed and served with chili, sesame and tomato chutney. The skin was a bit doughier than expected (I'm trying to stay away from refined carbs) so I just ate the pork filling which was packed with robust seasonings. I loved the accompanying aioli-like chutney which gave a fiery tang. Next, came the Tofu Tarkari ($10.35), a tofu and green been curry dish which was a lot SMALLER than anticipated. http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=nouAWbMVfKn2dEB3Uj7CVw The mini silver bowl had only three fried tofu pieces and green beans swimming in a fragrant light tomato cream sauce with prominent garlic and ginger spices. The silkiness and tantalizing flavors of the sauce was purely addicting and a perfect accompaniment to the basmati rice and soft naan which I sneaked several bites of (SHHHHH!). As the aroma of sizzling onions permeated in the air, I knew our Poleko Kukhura (Chicken Tandoori -$13) dish was arriving. http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=SbjYhwXJ-k7lAWOJLDOq0A Yelpers weren't lying when they say this is the \"best chicken tandoori\" they've had. Marinated in yogurt and spices and then grilled, the chicken breasts were succulently moist (from the dairy in the yogurt) with aromatic nuances of garlic and ginger. I could have scarfed down the whole platter by myself (SHHHHH! x2). \n\nService was friendly and attentive but rushed. Towards the end of dinner, our waitress asked us twice within a 2 minute span if we were finished when we still had food on our plates. My friends and I are fast eaters and I can understand if we were taking our leisurely time and if they were closing but that wasn't the case. \n\nI heart Wikipedia. It has allowed me to discover and savor unknown cuisines not to mention save me from looking like an Asian Jessica Simpson because you know, Dalia IS Dolly as Tuna IS Chicken (of the Sea)...", "rating": 4, "date": "2012-03-15"}, {"excerpts": ["I had the Himalayan Momo appetizer... ", "Thumbs Up!\n", "The Poleko Khasi was also very tasty! \n", "If you're a beer drinker, order yourself a large Taj Mahal, you won't be disappointed."], "author": "Jaime P.", "review": "Very good food!  My experience with Indian food is very minimal, however this place has a Great Palak Paneer.... The flavors are very rich and the plates are sized to share.   I had the Himalayan Momo appetizer... Thumbs Up!\nThe Poleko Khasi was also very tasty! \nIf you're a beer drinker, order yourself a large Taj Mahal, you won't be disappointed.", "rating": 5, "date": "2015-03-08"}, {"excerpts": ["The Himalayan Momo vegetable dumplings were good. ", "It comes with a chili chutney that had a nice kick to it.  "], "author": "Jeff H.", "review": "Nice place.  First of all, they're have an audio rotation of mild chanting and some Nepalese music.  It's pretty darn calming.  The staff is very friendly, but are not fully versed in English (if you need a fuller description of your meal).\n\nI only ordered a couple of appetizers for myself.  The Himalayan Momo vegetable dumplings were good. It comes with a chili chutney that had a nice kick to it.  I also ordered Sabjiko Jhol (lentil soup) which was awesome.  Just a hearty tasty soup.\n\nI'll come again soon and order an entree.", "rating": 4, "date": "2013-06-05"}, {"excerpts": ["We had the Himalayan Momo - which is like a potsticker but with a nice spicy sauce, Kukhura Jhol - light tomato based a little touch of lentil, Kukhura Ledo - I can just ask for the Ledo soup with butter naan and my tummy would be delighted and Tandoori mixed - chicken/salmon was perfectly cook but the lamb was a little well done for my taste. ", "We tried the Himalayan tea which was creamy and tasty! ", "The mango shake was also excellent. ", "The service was excellent and what made it extra sweet was the owner gave us mango lassi and Himalayan tea to go that is on the house! ", "We definitely enjoyed the experience and can't wait to come back!"], "author": "Kay D.", "review": "The first time my family and I tried Nepalese cuisine and it was scrumptious! Little Nepal is a great find that we enjoyed very much. We had the Himalayan Momo - which is like a potsticker but with a nice spicy sauce, Kukhura Jhol - light tomato based a little touch of lentil, Kukhura Ledo - I can just ask for the Ledo soup with butter naan and my tummy would be delighted and Tandoori mixed - chicken/salmon was perfectly cook but the lamb was a little well done for my taste. We tried the Himalayan tea which was creamy and tasty! The mango shake was also excellent. The service was excellent and what made it extra sweet was the owner gave us mango lassi and Himalayan tea to go that is on the house! We definitely enjoyed the experience and can't wait to come back!", "rating": 5, "date": "2015-03-15"}, {"excerpts": ["We started with the Himalayan momo - a chewy sort of dumplings very similar to Chinese potstickers. ", "We opted for vegetarian and the filling was way better than any Chinese veggie dumpling.  ", "They also came with a fantastic spicy sauce. "], "author": "Ivan L.", "review": "Checked out Little Nepal yesterday night with the wife. Don't know exactly when but I had bookmarked it. Turns out I have good taste in bookmarking... And I'm modest. \n\nThe food was familiar as a riff on North Indian.  The Nepalese bent seemed to be a more mellow spice mix and a somewhat lighter fare with more tomato in place of lentils. I think I enjoyed it more than Indian food. \n\nWe started with the Himalayan momo - a chewy sort of dumplings very similar to Chinese potstickers. We opted for vegetarian and the filling was way better than any Chinese veggie dumpling.  They also came with a fantastic spicy sauce. Warning: it's hot.\n\nI had the tandori chicken as my main. It was again the best tandori I've had. The chicken was so moist and so full of flavor. Get this dish!", "rating": 4, "date": "2011-09-03"}, {"excerpts": ["CHICKEN HIMALAYAN MOMO served with chutney. ", "This appetizer looked similar to pot stickers. ", "The chutney sauce was made of chili, sesame, and tomato. "], "author": "Liz K.", "review": "Cute and quaint little restaurant tucked in Bernal Heights. The staff greets you with a respectful namaste, which is always welcoming.\n\nI thought the appetizers were delicious. \n\nCHICKEN HIMALAYAN MOMO served with chutney. This appetizer looked similar to pot stickers. The chutney sauce was made of chili, sesame, and tomato. So, it was delightfully spicy.\n\nVEGETABLE SAMOSA with mint sauce...yum. If they went wrong here,  I would have judged them very harshly - like whip harshly. But, they perfected the samosa. I just love samosas!\n\nLITTLE NEPAL SPECIAL CHOILLA - This was absolutely divine. There was a spice that I couldn't quite figure out that gave it a nice little kick. I was thinking horseradish...but still not sure.\n\nKUKHURAKO LEDO - tandoori chicken...tender and delicious. I was stuffed by the time the entrees arrived!\n\nThe best part about this place is the ventilation is amazing. You don't leave the restaurant smelling like tandoori meat and curry. Which is cool because the neighborhood dogs don't start following you to your car like they want to lick you from head to toe. But, the down side to that...it gets quite cold in there. Then again, it could just be me. I like to be snuggled in warmth.", "rating": 4, "date": "2008-02-24"}, {"excerpts": ["I always start with the Little Nepal Special Chhoila (pork) and the Himalayan Momo (potstickers). "], "author": "Yvette K.", "review": "Little Nipple (as my friends and I call it) is yummy delicious! I have been going there since it opened a few years ago and I have never been disappointed. \n\nNepalese food is very similar to Indian food, but this place is better than almost any local Indian restaurant. (Take that Zante's Pizza!) \n\nThere are a few items on the menu that you must try. I always start with the Little Nepal Special Chhoila (pork) and the Himalayan Momo (potstickers). Both of these items are unique and excellent. \n\nFor entrees the big crowd pleaser is the Kukhurako Ledo (like Chicken Tikka Massala, but BETTER), the Chhayau Tarkari (mushroom curry), the Machhako Mitho Tarkari (salmon curry), and Tofu Tarkari (Tofu curry) are all fantastic. \n\nYou should try this little Bernal Heights gem out immediately. The restaurant has decent enough surroundings and the wait staff is good, but I usually order take-out.", "rating": 5, "date": "2007-10-16"}, {"excerpts": ["We started with the Himalayan Momo. ", "We didn't know what to expect, so when we saw the appetizer, we both looked at each other puzzled and said \"oh... pot stickers??", "? ", "with curry sauce?", "\" ", "We gave it a try and it seriously tasted like what we thought. ", "It was good, but not impressive. ", "Next, we had the tandoori king prawns. ", "The platter was sizzling and the prawns where huge. ", "I thought they were good, but it certainly did not wow me. ", "Then we had the curry chicken with tomato, onions and spices with rice and garlic naan. ", "It was good, but nothing special. ", "Oh.. don't order wine there.. "], "author": "Denise L.", "review": "My boyfriend and I drove to Cortland last night looking for a new restaurant to try. We stumbled upon Little Nepal and decided to give it a try. We started with the Himalayan Momo. We didn't know what to expect, so when we saw the appetizer, we both looked at each other puzzled and said \"oh... pot stickers??? with curry sauce?\" We gave it a try and it seriously tasted like what we thought. It was good, but not impressive. Next, we had the tandoori king prawns. The platter was sizzling and the prawns where huge. I thought they were good, but it certainly did not wow me. Then we had the curry chicken with tomato, onions and spices with rice and garlic naan. It was good, but nothing special. Oh.. don't order wine there.. NOT good.\n\nOverall, the food wasn't bad, but it was that good. I probably won't come running back....", "rating": 2, "date": "2006-05-20"}, {"excerpts": ["First came out two appetizers, a pot sticker like creation called a Himalayan Momo ... man, I would go back in a moment and eat an order of those alone. ", "Totally fabulous- great taste, texture, everything. ", "The other appetizer was a Pakauda - deep fried onion and spinach. "], "author": "Misha M.", "review": "What a charming night... 6 of us went for dinner, and got the 6 person combo. First came out two appetizers, a pot sticker like creation called a Himalayan Momo ... man, I would go back in a moment and eat an order of those alone. Totally fabulous- great taste, texture, everything. The other appetizer was a Pakauda - deep fried onion and spinach. Deep fried anything isn't my favorite thing isn't normally my thing, but I still went back for seconds :)\n\nFor entrees, we and a tandoori chicken that was surprisingly tender. The lamb that we had was perfect- rich, and not too gamey.  The salmon was perfectly cooked.  In the end, everything that we had was totally delicious. The staff is sweet and warm, and they helped to make for a great evening for friends.", "rating": 4, "date": "2007-05-04"}, {"excerpts": ["We started out with the Himalayan Momo for $5.95.  ", "These are Minced Chicken, Pork or Vegetable wrapped in flour dough and steamed.  ", "Served with chutney sauce made of sesame, chili and tomato.  ", "These are basically pot stickers.  "], "author": "Pele N.", "review": "The first (and only?) Nepalese restaurant in SF.  The place is real cozy, but feels clean.  I say feels, because there are a few things, like hanging drapes that are very dirty when looked at closely, but the place feels modern and clean for the most part.  We had the chef come out and give us his personal recommendations, so we assume we had the best the place had to offer.  \n\nWe started out with the Himalayan Momo for $5.95.  These are Minced Chicken, Pork or Vegetable wrapped in flour dough and steamed.  Served with chutney sauce made of sesame, chili and tomato.  These are basically pot stickers.  You get quite a few and were quite good.\n\nFor Entrees we got a Kukhurako Ledo Combo for $14.40.  This is Boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices.  This was our favorite dish.  We also got the Mismass Poleko Masu combo for $17.95.  This is Mixed Tandoori chicken, Atlantic Salmon and lamb marinated in olive oil, garlic, ginger and spice.   This is good, but kind of bland.\n\nAll in all I would recommend this place if you live, or are driving through, Bernal Heights, but I wouldn't drive across town for it.", "rating": 3, "date": "2006-07-12"}, {"excerpts": ["The samosas were best of show and the Himalayan Momo (steamed dumplings) were wonderfully light, savory, and served with an excellent medium-spicy chutney. \n\n"], "author": "Scooby S.", "review": "At the risk of making my new favorite East Asian spot very popular, I am highly recommending Little Nepal. We dined at Little Nepal for the first time on a very slow Sunday evening, so I can't comment on service or food quality on a busy night, but on the night we visited, the staff was very friendly, the courses were timely, and the food was super tasty. \n\nLittle Nepal is the best of three Nepalese restaurants I have tried so far. If you have not had Nepalese food before, the flavoring and spices will seem similar to North Indian cuisine and equally as savory. However, Nepalese food is lighter on oils and dairy, so I don't find myself as uncomfortably full as when I have eaten a number of Indian dishes. In addition to a number of excellent vegetarian offerings, Little Nepal serves chicken, lamb, prawns, and (okaaaay) Atlantic Salmon. There is a dash of Chinese influence as well - Little Nepal serves tofu and a chow mein dish. \n\nWe stayed vegetarian. The samosas were best of show and the Himalayan Momo (steamed dumplings) were wonderfully light, savory, and served with an excellent medium-spicy chutney. \n\nWe ordered three entrees for two people (one ala carte and two as combination dinners with naan, vegetable stew, and chutney. That was plenty and we arrived with an appetite. The mustard greens (Saagko Tarkari) were heavenly, and the potato/blackeyed peas/bamboo shoot (Alu Tama Bodi) and mushrooms (Chhayau Tarkari) were very good. Washed down with several tall bottles of Indian beer, we walked out of Little Nepal for $20 each before tip. \n\nThe decor is modern, but nicely done. We were very comfortable on a night when the fog was blowing in sideways down the Alemany Gap. Tell your friends (or keep it to yourself). Little Nepal is very, very good.\n\nFour stars instead of five not for any fault, but merely because this is a neighborhood family restaurant and as good as it gets in that category.", "rating": 4, "date": "2010-09-14"}, {"excerpts": ["Himalayan momo (steamed pork dumplings) and mismass pakauda (spinach and onion fritters) make great starters. ", "Naan and rice are perfect additions to any main course, but skip the lentils and vegetables, which tend to be overcooked and uninspiring. ", "Never a fan of soybean curd, I need to go back and see if the tofu takari recommended by Kristie will warrant the addition of another star."], "author": "Gourmet G.", "review": "The menu borrows elements from Indian, Thai, and Chinese cultures, with familiar curries, stir-fries, and sizzling tandoor platters the dominating dishes. The spicing is subtle, perhaps too much so for those expecting a bit of fire in the food. Himalayan momo (steamed pork dumplings) and mismass pakauda (spinach and onion fritters) make great starters. Naan and rice are perfect additions to any main course, but skip the lentils and vegetables, which tend to be overcooked and uninspiring. Never a fan of soybean curd, I need to go back and see if the tofu takari recommended by Kristie will warrant the addition of another star.", "rating": 3, "date": "2005-08-12"}, {"excerpts": ["We had \"Himalayan Momo\" as appetizer and Khasiko Pakuwa and Chhayau Tarkari  as entry.\n", "They were delicious enough to satisfy our hungry stomach.  ", "However, my husband pointed that Lamb should have been more juicy and softer.  ", "Other than that we were happy to be there.  ", "Please experience different and oriental style food if you want to experience new adventure."], "author": "rie k.", "review": "It is a cute little place up on the hill.  Before I entered this place with my husband, this woman outside said, \"You are making a good choice\". So we felt easy on going inside.  A lot of people.  They all look settled down cozily.  I thought that was a \"good sign\" :-)  Because we sometimes do adventure stuff, trying out new restaurant spontaneously.  You never know what you are getting into.\nWe had \"Himalayan Momo\" as appetizer and Khasiko Pakuwa and Chhayau Tarkari  as entry.\nThey were delicious enough to satisfy our hungry stomach.  However, my husband pointed that Lamb should have been more juicy and softer.  Other than that we were happy to be there.  Please experience different and oriental style food if you want to experience new adventure.", "rating": 4, "date": "2010-02-02"}, {"excerpts": ["we got the vegetarian himalayan momo as an appetizer. ", "yum. ", "kind of like a steamed wonton with much more flavor. ", "we also ordered the alaskan salmon. ", "dear lord, these big chunks of fish come out piping hot on a sizzling platter, and with a little lemon squeezed on top they are just to die for. ", "i found myself scraping the crispy onions and green pepper off the plate with my fingers. "], "author": "jean w.", "review": "what a find! i came here last night with a bunch of raucous girlfriends.  when the food came, that sure shut us up.\n\nwe got the vegetarian himalayan momo as an appetizer. yum. kind of like a steamed wonton with much more flavor. we also ordered the alaskan salmon. dear lord, these big chunks of fish come out piping hot on a sizzling platter, and with a little lemon squeezed on top they are just to die for. i found myself scraping the crispy onions and green pepper off the plate with my fingers. mmm...shameless. \n\nbonus: the waiters pour your water from way up high and it somehow makes it into the glass without spilling a drop. go li'l nepal!", "rating": 5, "date": "2007-09-20"}], "little nepal special chhoila": [{"excerpts": ["We got the:\n\nLittle Nepal Special Chhoila \n     "], "author": "Nina S L.", "review": "One of my favorite spots! There's never a wait and it is super cozy inside.  Super friendly service... A real neighborhood gem!\n\nWe got the:\n\nLittle Nepal Special Chhoila \n     Cubes of barbecued Chicken marinated in olive oil, mixed with garlic, ginger.\n\nKukhura Ra Palak \n    Boneless chicken cooked with spinach, fresh tomato, onion, garlic, ginger, spices and light creamy sauce.  \n\nPalak Paneer \n     Minced Spinach and home-made Cheese cubes cooked in fresh tomato, onion, garlic, ginger, spices and creamy sauce.    \n\nChhayau Tarkari \n    Mushroom cooked with fresh tomato, onion, ginger, garlic,and spices   \n\nEVERYTHING was super fresh and flavorful! Just the right amount of spice and heat. And we had plenty for leftovers... If they make them home. ;)\n\nCan't wait to come back soon!", "rating": 5, "date": "2015-03-21"}, {"excerpts": ["A few suggestions:\n\nKukhurako Ledo for dinner (obviously)\n\nLittle Nepal Special Chhoila or Himalayan House Salad as an appetizer \n\nExtra order of naan (a side of naan comes with your entre, but if anyone in your party is a big eater you're gonna need it!) \n\n"], "author": "Nattles L.", "review": "I went to Little Nepal tonight for what had to be like my millionth serving of Kukhurako Ledo. As I sat there scooping up the last delicious morsels with a bit of naan I wondered, yet again, if I should write a review. I've weighed the pros and cons and as much as I don't want my cozy little dinner spot to be invaded by the masses, EVERYONE should experience it - I think word is getting out anyway.(: The food is ABSOLUTELY fantastic and very fairly priced, especially by San Francisco standards. I must admit I have not tried the entire menu (for Kukhurako Ledo & me it was love at first bite), but what I have had I highly recommend. A few suggestions:\n\nKukhurako Ledo for dinner (obviously)\n\nLittle Nepal Special Chhoila or Himalayan House Salad as an appetizer \n\nExtra order of naan (a side of naan comes with your entre, but if anyone in your party is a big eater you're gonna need it!) \n\nOn top of the food being to die for, the service is flawless! All of the servers are incredibly sweet and attentive. They go above and beyond to accommodate their patrons and ALWAYS remember that I drink my water through a straw.(: The chef and the general manager are also very friendly and pop in from time to time. It's just a great little spot overall. Dim lighting, soft music and shareable entrees make Little Nepal perfect for a date night as well.", "rating": 5, "date": "2010-01-29"}, {"excerpts": ["I always start with the Little Nepal Special Chhoila (pork) and the Himalayan Momo (potstickers). "], "author": "Yvette K.", "review": "Little Nipple (as my friends and I call it) is yummy delicious! I have been going there since it opened a few years ago and I have never been disappointed. \n\nNepalese food is very similar to Indian food, but this place is better than almost any local Indian restaurant. (Take that Zante's Pizza!) \n\nThere are a few items on the menu that you must try. I always start with the Little Nepal Special Chhoila (pork) and the Himalayan Momo (potstickers). Both of these items are unique and excellent. \n\nFor entrees the big crowd pleaser is the Kukhurako Ledo (like Chicken Tikka Massala, but BETTER), the Chhayau Tarkari (mushroom curry), the Machhako Mitho Tarkari (salmon curry), and Tofu Tarkari (Tofu curry) are all fantastic. \n\nYou should try this little Bernal Heights gem out immediately. The restaurant has decent enough surroundings and the wait staff is good, but I usually order take-out.", "rating": 5, "date": "2007-10-16"}, {"excerpts": ["For an appetizer, I would definitely recommend the Little Nepal Special Chhoila. ", "So friggin' good.  ", "It looks like tandoori chicken, but has this strong (but not overpowering) "], "author": "Mark G.", "review": "We had a good meal here. It's a small, quiet place that's somewhat off the beaten path. Definitely recommend stopping by.\n\nFor an appetizer, I would definitely recommend the Little Nepal Special Chhoila. So friggin' good.  It looks like tandoori chicken, but has this strong (but not overpowering) Dijon mustard taste.\n\nPlus, it's cool that they say \"Namaste\" when you leave. This probably means that I have been watching too much \"Lost.\"", "rating": 4, "date": "2007-04-13"}], "kukhurako butan": [], "sabjiko jhol": [{"excerpts": ["I also ordered Sabjiko Jhol (lentil soup) which was awesome.  "], "author": "Jeff H.", "review": "Nice place.  First of all, they're have an audio rotation of mild chanting and some Nepalese music.  It's pretty darn calming.  The staff is very friendly, but are not fully versed in English (if you need a fuller description of your meal).\n\nI only ordered a couple of appetizers for myself.  The Himalayan Momo vegetable dumplings were good. It comes with a chili chutney that had a nice kick to it.  I also ordered Sabjiko Jhol (lentil soup) which was awesome.  Just a hearty tasty soup.\n\nI'll come again soon and order an entree.", "rating": 4, "date": "2013-06-05"}, {"excerpts": ["I had the sabjiko jhol and sabjiko tarkari combo.  ", "The flavors popped!  ", "I was impressed.  ", "I wish I had a Little Nepal closer to my house."], "author": "Hester B.", "review": "The atmoshpere is homey and the service staff is super friendly.  It just feels good to be there, so you'll find yourself lingering.\n\nThe food, OMG the food!  At the time when I dined here with a friend I wasn't eating any animal products.  That didn't take anything away from this experience.  I had the sabjiko jhol and sabjiko tarkari combo.  The flavors popped!  I was impressed.  I wish I had a Little Nepal closer to my house.", "rating": 5, "date": "2012-06-08"}, {"excerpts": ["Sabjiko Jhol is a great lentil soup that has a bit of a kick to it but nothing that even a person who hates spicy food can't cope with.\n\n"], "author": "Dean M.", "review": "I've eaten here about 6x already so I felt now was a good time to review them.\n\nI've had a few of the dishes on here but I won't get into all of them, just the ones I recommend.\n\nI will also say that for the price, you get a very fair amount of food, especially if you order the Full Combination on take out...you get a LOT of food for your money...I eat like a damn pig and I have leftovers.\n\nThe service? the people I've dealt with on the phone and in person have always been nice to me and very accommodating. When I went there to pick up my food they gave me tea as I waited for my order.\n\nalways smiling, always cool and polite...\n\nthe dishes...\nI've favored the Tofuko Tarkari lately to be honest, it has a very creamy texture and taste with some sweet overtones in it. The sauce is plainly put...incredible. I've eaten it alone with just rice and had a meal in itself. The tofu that accompanies it is soft on the inside with a bit of a skin on the out. It is obviously flash fried to seal the skin. Very tasty and again mixed in rice...fantastic.\n\nPoleko Kukhura is also a very good dish, the meat is never over cooked or dry and retains a lot of the flavor from the spices and yogurt.\n\nSabjiko Jhol is a great lentil soup that has a bit of a kick to it but nothing that even a person who hates spicy food can't cope with.\n\nRice is rice and its done right here as well with just the right amount of starch to add to the stickiness.\nthe mango shake is very good as is the Naan bread...especially the G-Naan which is basically Garlic Naan.\n\nwell that's it kids...that's my review of this place, check it out...for 50.00 in San Francisco you can eat a lot worse TRUST ME...this restaurant is on my speed dial", "rating": 5, "date": "2009-10-01"}], "kukhurako jhol": [], "mismas pakauda": [{"excerpts": ["We started off with the Himalayan Momo - really tasty dumplings especially when dipped in the sauce along with Samosas and the Mismas Pakauda - a spinach dish with onion and spices. ", "All served as a great prelude to our main courses of Poleko Khasi (lamb) and Poleko Kukhura (chicken) - that was served beautifully. ", "Lamb especially is a tricky dish to prepare as many times "], "author": "Mike G.", "review": "Went here a few nights ago with family and was treated to a truly delicious dinner. We started off with the Himalayan Momo - really tasty dumplings especially when dipped in the sauce along with Samosas and the Mismas Pakauda - a spinach dish with onion and spices. All served as a great prelude to our main courses of Poleko Khasi (lamb) and Poleko Kukhura (chicken) - that was served beautifully. Lamb especially is a tricky dish to prepare as many times the gamey taste is too obvious but this was not the case at all here.\n\nThe service was timely, polite and courteous and the ambience was perfect. Photos of Nepalese culture and locations line the walls and might even inspire some to climb Everest at some point. I am looking forward to returning here for another meal in the future.", "rating": 5, "date": "2017-09-14"}, {"excerpts": ["We started off with their mismas pakauda, which was a fried spiced spinach and onion mix with mint sauce.  ", "We all really enjoyed this dish and ", "it was sort of like Nepalese onion rings.  ", "Next came the Himalayan pork momo's, which were steamed flour dumplings served with a couple different sauces.  "], "author": "Joe M.", "review": "Little Nepal  |  925 Cortland Ave, San Francisco, CA 94110  |  415.643.3881\n\nSome old college buddies and I were meeting up for dinner in San Francisco and wanted to find something convenient to public transportation.  We don't have the opportunity to get together often since we live all over the Bay Area, but we were excited to finally catch up over some yummy Nepalese food in Bernal Heights.\n\nTo make things simple, we decided to order their set menu for 4 people, which we were told would be plenty of food for our little group.  We started off with their mismas pakauda, which was a fried spiced spinach and onion mix with mint sauce.  We all really enjoyed this dish and it was sort of like Nepalese onion rings.  Next came the Himalayan pork momo's, which were steamed flour dumplings served with a couple different sauces.  This was another delicious dish that I really enjoyed, and the dipping sauces were all really tasty and spicy.\n\nOur entrees consisted of alu tama bodi (a curry of potatoes, black-eye beans, and bamboo shoots cooked with fresh tomato, garlic, ginger, and spices), khasiko masino masu (minced lamb curry cooked with mushroom, green peas, and spices), and poleko kukhura (tandoori boneless chicken marinated in yogurt, ginger, garlic, and spices).  I really enjoyed the lamb curry and the vegetable curry was ok too.  The chicken was a little bit dry for me, but had good flavor overall.  Along with the entrees, we were served rice with naan, some lentil curry, and another side dish that I couldn't identify.  I didn't think it would be enough food, but it turned out to be quite a bit, and we were all very full by the time the rice pudding dessert came.\n\nThe food here is pretty yummy, but the service is something else entirely.  I actually thought it was pretty bad and there was a language barrier that made communication almost impossible.  Checking out was slow and we did our best to try to accelerate the process considering people had buses and trains to catch.  Overall, I think it's worth coming for the food if you're willing to be patient with the service and not ask too many questions.  You'll only be frustrated in seeking a response.\n\nFood: 7/10\n\nService: 4/10\n\nPrice: $$\n\nAtmosphere: 7/10", "rating": 3, "date": "2013-08-31"}, {"excerpts": ["For appetizers, we enjoy the Mismas Pakauda (deep fried onion & spinach with green sauce - delicious), the samosas, and the momo (Nepalese dumplings). ", "For entrees, the tandoori dishes are all good, as is the Khasiko Masio Masu (a delicious combination of minced lamb and green peas), Kukhurako Ledo (in the same vein as Indian chicken masala). ", "It's always nice to have a glass of house-made mango juice to go with."], "author": "David K.", "review": "We've been here so many times, I'm surprised I haven't written a review before now. Little Nepal is a comfortable, modern-looking neighborhood spot with what I believe is authentic Nepalese food. For appetizers, we enjoy the Mismas Pakauda (deep fried onion & spinach with green sauce - delicious), the samosas, and the momo (Nepalese dumplings). For entrees, the tandoori dishes are all good, as is the Khasiko Masio Masu (a delicious combination of minced lamb and green peas), Kukhurako Ledo (in the same vein as Indian chicken masala). It's always nice to have a glass of house-made mango juice to go with.", "rating": 4, "date": "2015-10-07"}, {"excerpts": ["For an appetizer we had the Mismas pakauda... enough to feed four.  ", "I ordered the Saagko Tarkari (mustard green curry) combo and my partner the Tofu Tarkari. ", "The vegetable curry that it is included with the combo dinner is quite delightfully spicy. ", "The two main-dish curries were a nice contrast and made for a very satisfying meal. ", "The Saago made me feel very healthy. ", "It was on the salty side, but not overly so. "], "author": "David S.", "review": "Healthy and Spiritual Eating\n\nI eat some kinds of meat, but I dine with a vegetarian. Finding a restaurant that we can both get excited about can be a challenge. Tucked away at the East end of Cortland Street in Bernal, Little Nepal belongs to that rare breed, and that's even without having ordered anything with meat on our last visit. \n\nFor an appetizer we had the Mismas pakauda... enough to feed four.  I ordered the Saagko Tarkari (mustard green curry) combo and my partner the Tofu Tarkari. The vegetable curry that it is included with the combo dinner is quite delightfully spicy. The two main-dish curries were a nice contrast and made for a very satisfying meal. The Saago made me feel very healthy. It was on the salty side, but not overly so. The Tofu was fluffy and the bright orange sauce just rich enough to be perfectly delightful but not indulgent. \n\nOverall the meal was quite filling without resulting in post-meal fatigue. The price was very reasonable, and combined with the quality of the food makes for a rating of excellent in the value category. The service was flawless, and the ambience is peaceful and relaxing.", "rating": 5, "date": "2013-01-05"}, {"excerpts": ["Momos were soggy,  Mismas Pakauda cold, soggy, falling apart and completely unedible.  ", "I tried something new, Khaskihki Masio Masu which is like lamb Hamberger Helper.  ", "Awful - even piping hot "], "author": "Cinnamon Z.", "review": "Oh boy . . . . .\n\nCalled at 5:04 to order food for delivery.  I'd ordered once before and was very happy.\n\nOne hour and 45 minutes later it arrived, stone cold, soggy, falling apart.  Cold pizza on the morning of a hangover is more appealing.\n\nYes, I had called to see what the delay was.  I called 5 times.   The driver is new and was lost . . . . like super lost.  My house is an 8 minute drive from Little Nepal, minimal turns, off a main road.  Easy!   But I guess they don't give their drivers GPS.  Hello, this is 2000freaking9 . . .why no GPS or even an old school paper map?\n\nAnyway, on my last phone call I said I did not want to pay full price for what would be cold food.  She told me  \"We give you a discount, next time\"  NEXT TIME?  What about THIS time?   She was willing to take $9 off a $48 bill!  What an insult!\n\nSo much so that I paid the full amount - I believe in my own good karma.  They can stew in their own rotten karma.\n\nAnyway, the food arrived just as I feared - stone COLD.  Momos were soggy,  Mismas Pakauda cold, soggy, falling apart and completely unedible.  I tried something new, Khaskihki Masio Masu which is like lamb Hamberger Helper.  Awful - even piping hot it was obvious that it would be awful.\n\nI would have been better off telling them to not bother completing the delivery, and making toast and butter for dinner.\n\nThey answer their phone with a Namaste . . .I'd say it's more Na-Nasty.   Note to owners of Little Nepal - ethics in business is everything.   You should have comped me this meal which mostly ended up in the trash.", "rating": 1, "date": "2009-06-30"}, {"excerpts": ["we ordered Mismas pakauda (deep fried spinach and onion) for an appetizer. ", "It was interesting, very good and very fried. ", "Maybe too heavy to start for some people. ", "For an entree I ordered the Tofu Tarkari, which was really lovely. ", "The Poleko Kukhura was also ordered and apparently very good as well. ", "You can order your meal a la carte, or combo (includes Basmati rice, naan, lentil, mixed seasonal vegetables and Chutney sauce). ", "Getting the combo is only a couple dollars more and the sides are great- ", "-also provides enough food for a good take-home portion. ", "I recommend having the Talus Pinot; it goes well with all the flavors."], "author": "Yes P.", "review": "Love Little Nepal!\n\nI wish it were closer, so I could go there more often. I guess it does get me out of the neighborhood though... The staff is quite nice and patient with my insulting pronunciation of their dishes.\n\nThe last time I was here we ordered Mismas pakauda (deep fried spinach and onion) for an appetizer. It was interesting, very good and very fried. Maybe too heavy to start for some people. For an entree I ordered the Tofu Tarkari, which was really lovely. The Poleko Kukhura was also ordered and apparently very good as well. You can order your meal a la carte, or combo (includes Basmati rice, naan, lentil, mixed seasonal vegetables and Chutney sauce). Getting the combo is only a couple dollars more and the sides are great- -also provides enough food for a good take-home portion. I recommend having the Talus Pinot; it goes well with all the flavors.", "rating": 5, "date": "2009-05-02"}, {"excerpts": ["We enjoyed the vegetable momos (dumplings), vegetable samosas, mismas pakauda (pakoras), and lentil soup.  "], "author": "Rachel R.", "review": "The appetizers are lovely and I only wish they offered tamarind sauce.  We enjoyed the vegetable momos (dumplings), vegetable samosas, mismas pakauda (pakoras), and lentil soup.  The menu is heavy on the Indian food, but is still delish.\n\nThe decor is really lovely, but not so comfortable.  The benches should have cushions for your back and the heavy wooden chairs make a terrible noise when scraped across the floor.  We arrived right when they opened at 5 and had to listen to the crush ice for five minutes.  Otherwise, the service was very attentive.\n\nNext time I would love to try to Alu Tama Bodi (potatoes, black-eyed beans and bamboo shoots).  Visit MaggieMudd (http://www.yelp.com/biz/RY3jZ3_jzj9eMXddYLN8uQ?hrid=yIm3y1Glwszyvkt7kWACFQ) for dessert.", "rating": 4, "date": "2006-05-07"}, {"excerpts": ["We shared the MIsmas pakauda for a starter and also shared the Kukhurako Ledo and Machhako Mitho Tarkari. ", "The service was gracious and fast, but not hurried. ", "The spices were perfect and the portions generous. ", "Never having had Nepalese cuisine before - I am now a HUGE fan. ", "I can't wait to go back!"], "author": "Erica C.", "review": "I just used Urbanspoon on the iphone to make my choice of cuisine tonight. It said Little Nepal, so off I went. We were greated with \"Namaste\" and a bow before being seated near the window.  We shared the MIsmas pakauda for a starter and also shared the Kukhurako Ledo and Machhako Mitho Tarkari. The service was gracious and fast, but not hurried. The spices were perfect and the portions generous. Never having had Nepalese cuisine before - I am now a HUGE fan. I can't wait to go back!", "rating": 5, "date": "2008-08-10"}], "himalayan house salad": [{"excerpts": ["A few suggestions:\n\nKukhurako Ledo for dinner (obviously)\n\nLittle Nepal Special Chhoila or Himalayan House Salad as an appetizer \n\nExtra order of naan (a side of naan comes with your entre, but if anyone in your party is a big eater you're gonna need it!) \n\n"], "author": "Nattles L.", "review": "I went to Little Nepal tonight for what had to be like my millionth serving of Kukhurako Ledo. As I sat there scooping up the last delicious morsels with a bit of naan I wondered, yet again, if I should write a review. I've weighed the pros and cons and as much as I don't want my cozy little dinner spot to be invaded by the masses, EVERYONE should experience it - I think word is getting out anyway.(: The food is ABSOLUTELY fantastic and very fairly priced, especially by San Francisco standards. I must admit I have not tried the entire menu (for Kukhurako Ledo & me it was love at first bite), but what I have had I highly recommend. A few suggestions:\n\nKukhurako Ledo for dinner (obviously)\n\nLittle Nepal Special Chhoila or Himalayan House Salad as an appetizer \n\nExtra order of naan (a side of naan comes with your entre, but if anyone in your party is a big eater you're gonna need it!) \n\nOn top of the food being to die for, the service is flawless! All of the servers are incredibly sweet and attentive. They go above and beyond to accommodate their patrons and ALWAYS remember that I drink my water through a straw.(: The chef and the general manager are also very friendly and pop in from time to time. It's just a great little spot overall. Dim lighting, soft music and shareable entrees make Little Nepal perfect for a date night as well.", "rating": 5, "date": "2010-01-29"}], "kukhurako ledo a la carte": [{"excerpts": ["Kukhurako Ledo a la carte, extra rice, extra naan. \n\n"], "author": "Jessie N.", "review": "I'm a regular here and I love that they know my order right when I walk in. I still look at the menu for show, but always get the same thing: Kukhurako Ledo a la carte, extra rice, extra naan. \n\nKukhurako Ledo is a chicken dish in a creamy sauce that is to die for, rich and savory and spiced without being spicy. There is a spicy chutney sauce that comes with the combo that a lot of people I've taken here love, but I'm not a fan of spicy, so I don't go for it. Indian food is usually too potent for me, but I love this Nepalese place because it's like Indian food without the overwhelming spices. \n\nThe atmosphere is subdued with clean and modern decoration, while there's traditional music playing and pictures of the Himalayas on the walls. The staff are always courteous and are usually waiting, scanning the room to see who needs help, rather than running around and stressed.", "rating": 5, "date": "2014-06-16"}], "kukhura ra mula a la carte": [], "kukhurako pakuwa a la carte": [], "kukhura ra palak a la carte": [], "khasiko pakuwa a la carte": [], "khasiko masio masu a la carte": [], "khasi ra tulsi a la carte": [], "machhako mitho tarkari a la carte": [], "jhinge machako tarkari a la carte": [], "kukhurako ledo combo": [{"excerpts": ["For Entrees we got a Kukhurako Ledo Combo for $14.40.  ", "This is Boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices.  ", "This was our favorite dish.  ", "We also got the Mismass Poleko Masu combo for $17.95.  ", "This is Mixed Tandoori chicken, Atlantic Salmon and lamb marinated in olive oil, garlic, ginger and spice.   "], "author": "Pele N.", "review": "The first (and only?) Nepalese restaurant in SF.  The place is real cozy, but feels clean.  I say feels, because there are a few things, like hanging drapes that are very dirty when looked at closely, but the place feels modern and clean for the most part.  We had the chef come out and give us his personal recommendations, so we assume we had the best the place had to offer.  \n\nWe started out with the Himalayan Momo for $5.95.  These are Minced Chicken, Pork or Vegetable wrapped in flour dough and steamed.  Served with chutney sauce made of sesame, chili and tomato.  These are basically pot stickers.  You get quite a few and were quite good.\n\nFor Entrees we got a Kukhurako Ledo Combo for $14.40.  This is Boneless chicken from clay oven (Tandoori) cooked in light cream, cashew nut, fresh tomato sauce, garlic, ginger and spices.  This was our favorite dish.  We also got the Mismass Poleko Masu combo for $17.95.  This is Mixed Tandoori chicken, Atlantic Salmon and lamb marinated in olive oil, garlic, ginger and spice.   This is good, but kind of bland.\n\nAll in all I would recommend this place if you live, or are driving through, Bernal Heights, but I wouldn't drive across town for it.", "rating": 3, "date": "2006-07-12"}], "kukhura ra mula combo": [], "kukhurako pakuwa combo": [{"excerpts": ["For two, the lamb Chholia, Kukhurako Pakuwa combo and the Saagko Tarkari  was more than enough.  ", "We like leftovers.  "], "author": "Lani N.", "review": "We've eaten both at the restaurant and had delivery.  We've always enjoyed the food. The food is like Indian food but not (I know, that was not a great description)... let's try: wonderful sauces full of flavor, but not as heavy, oily or creamy. \n\nTonight's meal was the best we've eaten from Little Nepal so far.  We always order the Lamb Chhoila (so, so, so good) and we try to order something we haven't yet had.  The lamb Chhoila never disappoints, melt in your mouth, busting with flavor cubes of lamb (in the future, I plan to order 2 lamb Chhoilas and a veg curry combo, and that will be plenty with leftovers to spare). Kukhurako Pakuwa was awesome too, chicken in a tomato sauce full of spices.  We ordered the chicken as a combo, so it comes with naan, rice, potato, lentils and a spicy sauce situation. And last but not least, Saagko Tarkari.  We both looked at it and said 'looks meh,' but it was delicious, Indian greens meet Southern greens.  \n\nFor two, the lamb Chholia, Kukhurako Pakuwa combo and the Saagko Tarkari  was more than enough.  We like leftovers.  I lied, I like the idea of leftovers and pretend to like them and my bf actually likes leftovers.\n\nThey quoted us 45 minutes for delivery, it was literally here in 15. AWESOME.  Thanks Little N!", "rating": 5, "date": "2012-04-18"}], "kukhura ra palak combo": [{"excerpts": ["We ordered a Kukhura Ra Palak combo and a Poleko Kukhura combo. ", "Both were very good, the chicken was surprisingly moist and juicy. ", "To be honest though, it tasted very similar to Indian food to me, just way more expensive. "], "author": "Sarah K.", "review": "My boyfriend and I were in the mood to try something new so we decided on Himalayan food! We went on a Wednesday night, so it wasn't busy (two other parties in the restaurant). Service was a bit slow at first, and they forgot to bring our beer until we waved someone over. They were very apologetic about it though, so that made up for it.\n\nWe ordered a Kukhura Ra Palak combo and a Poleko Kukhura combo. Both were very good, the chicken was surprisingly moist and juicy. To be honest though, it tasted very similar to Indian food to me, just way more expensive. We finished everything and were both really full.\n\nOverall, very good quality food, though pretty pricey for what it is and how much you get, but definitely a good spot to try. I'll be back in the future, just not any time soon.", "rating": 4, "date": "2015-03-29"}], "khasiko pakuwa combo": [{"excerpts": ["For our entree, we order the Bhanta Tarkari  veggie curry combo and Khasiko Pakuwa combo - both were delicious. "], "author": "R H.", "review": "I'm a fan of Little Nepal. I was looking for a nice, quiet, and casual restaurant for dinner one evening... and I'm glad I stumbled upon this restaurant. \n\nWe were one of the two patrons at 7:30, but the place quickly filled up afterwards. Started off with the pork momos. I was a little disappointed with what looked like potstickers, but the spicy chutney mix really made this appetizer better. For our entree, we order the Bhanta Tarkari  veggie curry combo and Khasiko Pakuwa combo - both were delicious. And the naan... little flaky bits of buttered heaven. \n\nThe service was great. The wait staff were very welcoming and attentive. Not once did my water glass fall below the half-way point without it quickly being filled up again. I will definitely be back next time I'm in the area.\n\nOne other thing.. the spoon was gigantic compared to the rest of the utensils. Thank goodness for Ikea.", "rating": 4, "date": "2008-11-01"}], "khasiko masio masu combo": [], "khasi ra tulsi combo": [], "machhako mitho tarkari combo": [], "jhinge machako tarkari combo": [{"excerpts": ["I ordered the Jhinge Machako Tarkari combo which came with the nan and the other side vegetable and side sauce.   "], "author": "Ahnee M.", "review": "I met a taxi driver last year that told me the best place for Nepalese food is Little Nepal....don't ask me how I remembered this after all that time.\n\nI guess, if I'm not traveling there directly, I want to at least experience the food by getting a taste of it here in SF.\n\nWhat a nice surprise.... it was a very refreshing experience the moment you walk in the door with bright colored walls and a nice warm feeling to it.\n\nI too noticed the music which sounded like Gregorian chanting and was quite soothing and created a nice ambiance for our evening.\nAgain, it wasn't crowded so it felt very relaxing inside.\n\nI ordered the Jhinge Machako Tarkari combo which came with the nan and the other side vegetable and side sauce.   The prawns were very fresh and the dish was very flavorful!\n\nI also ordered the Mango shake (not the juice), which is pretty much like the Indian lassi drink and was quite delish!\n\nI thought overall the food was reasonable and staff were friendly although as my 'date' indicated in his review, she forgot to bring his order.  Maybe English wasn't her first language...all the more to make the experience truly authentic!\n\nIts in Bernal heights and it seems like a quaint neighborhood but a bit far  to go when coming from South of Market.\nStill I'm glad we went to check it out.  I feel good that I honored my words to a taxi driver and went to check it out!", "rating": 4, "date": "2009-02-26"}], "poleko kukhura a la carte": [], "poleko kukhura combo": [{"excerpts": ["We ordered a Kukhura Ra Palak combo and a Poleko Kukhura combo. ", "Both were very good, the chicken was surprisingly moist and juicy. ", "To be honest though, it tasted very similar to Indian food to me, just way more expensive. "], "author": "Sarah K.", "review": "My boyfriend and I were in the mood to try something new so we decided on Himalayan food! We went on a Wednesday night, so it wasn't busy (two other parties in the restaurant). Service was a bit slow at first, and they forgot to bring our beer until we waved someone over. They were very apologetic about it though, so that made up for it.\n\nWe ordered a Kukhura Ra Palak combo and a Poleko Kukhura combo. Both were very good, the chicken was surprisingly moist and juicy. To be honest though, it tasted very similar to Indian food to me, just way more expensive. We finished everything and were both really full.\n\nOverall, very good quality food, though pretty pricey for what it is and how much you get, but definitely a good spot to try. I'll be back in the future, just not any time soon.", "rating": 4, "date": "2015-03-29"}], "poleko khasi a la carte": [], "poleko khasi combo": [], "poleko machha a la carte": [], "poleko machha combo": [], "poleko jhinge machha a la carte": [], "poleko jhinge machha combo": [], "mismas poleko masu a la carte": [], "mismas poleko masu combo": [], "sabjiko tarkari curry a la carte": [], "sabjiko tarkari curry combo": [], "saagko tarkar curry a la carte": [], "saagko tarkar curry combo": [], "daal misuwa curry a la carte": [], "daal misuwa curry combo": [], "tofu tarkari curry a la carte": [], "tofu tarkari curry combo": [], "bhanta tarkari curry a la carte": [], "bhanta tarkari curry combo": [], "alu tama bodi curry a la carte": [], "alu tama bodi curry combo": [], "chhayau tarkari curry a la carte": [], "chhayau tarkari curry combo": [], "palak paneer curry a la carte": [], "palak paneer curry combo": [], "chana saag curry a la carte": [], "chana saag curry combo": [], "chowmein ra sabji curry a la carte": [], "chowmein curry a la carte": [], "national nepalese bhojan meal": [], "krishnarpan bhojan meal": [], "plain naan": [{"excerpts": ["Also, the portions were quite small for the price (adding plain naan and white rice does not justify increasing the price of these dishes).  ", "I might go back to try other dishes, but the first impression was not memorable."], "author": "Janelle F.", "review": "Lentil soup was delicious (even if it just was a small bowl), but the tandoori chicken and spinach/garbanzo dish were pretty bland.  Also, the portions were quite small for the price (adding plain naan and white rice does not justify increasing the price of these dishes).  I might go back to try other dishes, but the first impression was not memorable.", "rating": 3, "date": "2015-06-01"}, {"excerpts": ["Both great dishes, and they came with a small dish of lentils, a small portion of veggies, and two pieces of plain naan.  ", "My only complaint is that the prices are a bit high.  ", "I felt that each of our dishes should have been about $5 less."], "author": "Emille L.", "review": "Great neighborhood restaurant. I got the curry tofu dish with green beans (cannot remember the name) and my husband got the tandoori combination platter.  Both great dishes, and they came with a small dish of lentils, a small portion of veggies, and two pieces of plain naan.  My only complaint is that the prices are a bit high.  I felt that each of our dishes should have been about $5 less.", "rating": 4, "date": "2012-07-09"}], "aloo naan": [], "plain rice": [], "mango chutney": [], "aanp ra dahi": [{"excerpts": ["We started with the Lamb Samosas and each ordered an Aanp Ra Dahi (Mango Shake), but we couldn't decide on what entree to get.  ", "As it turned out, the Mismas Poleko Masu was the perfect dish for us - a sizzling platter of Tandoori Chicken, Atlantic Salmon, and Lamb (marinated in yogurt, olive oil, garlic, ginger, and spices).  ", "I would certainly get the Aanp Ra Dahi again (nice balance of fruity and creaminess... http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#fsHvURTcO3DxTzVhiyX_5w), but I'm not sure if/when I'll be coming back to Little Nepal.  ", "I know fellow Yelpers are quite fond of the place, but I'd rather check out some of the Nepalese places in the East Bay first."], "author": "Mike L.", "review": "Despite having lived in SF for so long, I've never really trekked out to Bernal Heights to check out the neighborhood.  Cortland Avenue's strip of restaurants and cafes is pretty cool, but who knew it was also home to the only Nepalese restaurant in SF?  Surprising, given they city's vast food scene, but apparently true according to Yelp.\n\nSince my friend and I were having Nepalese food for the very first time, we both wanted to try a variety of items.  We started with the Lamb Samosas and each ordered an Aanp Ra Dahi (Mango Shake), but we couldn't decide on what entree to get.  As it turned out, the Mismas Poleko Masu was the perfect dish for us - a sizzling platter of Tandoori Chicken, Atlantic Salmon, and Lamb (marinated in yogurt, olive oil, garlic, ginger, and spices).  Making it a dinner combination (instead of a la carte), the sizzling platter also came with basmati rice, buttered naan, lentil soup, mixed vegetables in curry, and a spicy dipping sauce.\n\nThe lamb and curry in the Samosas matched really well (though I could have done without the peas) and I liked how the dough wasn't chalky, but it was the size of each piece that impressed me the most (http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#Clv1Iljrd6k2ENruckjMPw).  Just based on that, I already knew I wasn't going to be able to finish my entree.  Out of the three (http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#9wRyp0L7xMUTSv6toidyQQ), I liked the Atlantic Salmon the best - flavorful and the center stayed surprisingly moist.  The Tandoori Chicken was pretty decent overall (although a touch dry), but the lamb felt overcooked and dry.  The taste might have been okay, but I can't say for sure since I couldn't get past a couple of bites.\n\nAs for the side platter (http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#W_YJtWRC2JsR_rYQHMCatw), it was just okay.  The buttered naan and lentil soup were pretty good, but the vegetable curry wasn't anything special and the basmati rice was literally tasteless.  I would certainly get the Aanp Ra Dahi again (nice balance of fruity and creaminess... http://www.yelp.com/biz_photos/Kx1WExNj5ogaFe0cyg9L6A?select=kHHFjcxOyoUuVt19RcYclg#fsHvURTcO3DxTzVhiyX_5w), but I'm not sure if/when I'll be coming back to Little Nepal.  I know fellow Yelpers are quite fond of the place, but I'd rather check out some of the Nepalese places in the East Bay first.", "rating": 3, "date": "2012-07-29"}], "aanp ko ras": [], "sudha dahi": [{"excerpts": ["Himalayan milk (chai w/ milk), sudha dahi (sweet yogurt)\n\n", "Chhoila and sudha dahi is a must."], "author": "Randy M.", "review": "I've never had Himalayan/Nepalese food. So, I was a little nervous bringing my wife, and 75-year-old mother here.  Nepal is northeast of India and thought that my mom would burn her mouth on everything she ate and blame me for pooping fire.  \n\nI was wrong. She was very happy. The short: we were  not disappointed with any of the dishes I was served here.  Everything was delicious. The restaurant has a very cozy feel to it.  It is well lit and well decorated without feeling overly done. The servers were nice.\n\nDishes: chicken momo (potsticker-like dumplings), lamb chhoila (bbq-ed meat, even my lamb hating wife loved), alu tama bodi (think lentil soup with bamboo shoots), kukhura ra mula (marinated boneless chicken served with bell peppers and onion on a sizzing platter), and the machhako mitho takari (salmon on a sizzling platter).\n\nDrinks: Himalayan milk (chai w/ milk), sudha dahi (sweet yogurt)\n\nAte way too much. Chhoila and sudha dahi is a must.", "rating": 5, "date": "2016-10-31"}], "himalayan milk masala chiya": [], "mint tea": [{"excerpts": ["Mint tea was also a ripoff at $2.99 for a bag of Stash in a small coffee cup that wasn't refilled.\n\n"], "author": "Liz K.", "review": "I have an iron stomach and something my friend and I ate did NOT sit well with us. Mint tea was also a ripoff at $2.99 for a bag of Stash in a small coffee cup that wasn't refilled.\n\nWe are regular spicy and Indian-esque food eaters. No idea what happened.", "rating": 2, "date": "2013-12-24"}, {"excerpts": ["goes great with the mint tea.  ", "also, fun photos of the himalayas all over.  ", "who can argue with that?"], "author": "kate s.", "review": "this place is adorable and delicious and the staff is so friendly and helpful!  they will make all vegetarian dishes vegan, even the bread if you ask for it without butter (you won't miss it).  everything is super flavorful and if you get the combination you'll have tons of dipping sauces and rice and bread.  i love the alu tama bodi curry--potatoes with black-eyed peas and bamboo.  goes great with the mint tea.  also, fun photos of the himalayas all over.  who can argue with that?", "rating": 5, "date": "2008-04-25"}, {"excerpts": ["I do recommend the mint tea with ice for easy digestion.  ", "The bill turned out to be $23.00 per person and it is worth every penny. ", "I will definitely be back to sample more of it."], "author": "Allison H.", "review": "A bunch of friends and I went to dine at Little Nepal on Saturday and all of us loved the food. Napalese food is similar to Indian food with chutney, naan, cooking style but a lot less greasy and heavy. We ordered the following food to share: chicken momo, Chicken Ledo (combo), Chicken Pakuwa (a la carte), Lamb Masu (a la carte)  and the Tandoori chicken (combo). All entrees come with naan bread, rice and sauce and combos come with that plus salad, lentil (soup) and chutney sauce. The chicken momo is like a dumpling stuffed with chicken and comes with chutney sauce (not spicy.) The Chicken Ledo is sort of like curry with tandoori chicken cooked in creamed sauce. The sauce was excellent with rice and naan but the chicken was overcooked. My favorite is the Chicken Pakuwa (chicken cooked with tomato sauce similar to the marsala) because the meat was very tender and delicious. I normally do not eat much rice but I overate that night because the sauces were so delicious. The tandoori was a very tasty breast meat cooked to perfection with spices. The Lamb Masu was very tender (taste like Rendang beef) but it still taste a bit gamey. My other three friends loved this dish and ate everything even the sauce with naan bread. I do recommend the mint tea with ice for easy digestion.  The bill turned out to be $23.00 per person and it is worth every penny. I will definitely be back to sample more of it.", "rating": 4, "date": "2009-06-08"}]}