{"goi cuon tom": [], "goi cuon ga nuong": [], "goi cuon thit nuong": [], "cha gio": [{"excerpts": ["The rice noodles with imperial rolls and grilled pork (Bun Cha Gio Thit Nuong) and Vietnamese Sandwiches are so trill.  ", "Highly recommended.  ", "There is only limited seating (4 or 5 seats) along the windows though.  ", "Also it is cash only."], "author": "Matthew H.", "review": "Viet-tastic!\n\nThis is my new favorite Vietnamese place in San Francisco.  The rice noodles with imperial rolls and grilled pork (Bun Cha Gio Thit Nuong) and Vietnamese Sandwiches are so trill.  Highly recommended.  There is only limited seating (4 or 5 seats) along the windows though.  Also it is cash only.", "rating": 4, "date": "2007-01-06"}, {"excerpts": ["we ordered:\n\nbun cha gio (rice noodles with egg rolls)\n"], "author": "Brian S.", "review": "i finally went here after reading about this place in the chronicle.\nthis place is great!  we ordered:\n\nbun cha gio (rice noodles with egg rolls)\npho ga (chicken pho)\n\nportions are plentiful, and our bill came out to $15 total.  the rice noodles dish was really delicious: noodles, fresh veggies, bbq pork and egg rolls.  what is not to like?  the pho ga was definitely not the best i've  had in the city (turtle tower is better), but good nonetheless.  i can't wait to go again to try their banh mi (sandwiches).  i'd recommend taking the food to-go since parking can be a pain, and the restaurant only has a small bar and a few tables outside for seating.", "rating": 4, "date": "2010-06-29"}], "goi ga": [], "pho ga": [{"excerpts": ["I've also tried their Pho Ga, which tastes different from what I'm used to but really tasty. ", "Pretty garlicy and really soothing to the throat! "], "author": "An-Nhien L.", "review": "Bread is great--I love either the pork or 5 spice chicken sandwich. Sometimes when I'm feeling a little crazy I go for the Peter Special which is a sunny side up egg with special sauce!\n\nI've also tried their Pho Ga, which tastes different from what I'm used to but really tasty. Pretty garlicy and really soothing to the throat! Noodles are softer and wider too.\n\nSo glad this place is only a bus ride away!", "rating": 5, "date": "2012-06-27"}, {"excerpts": ["I understand that the perfect balance is hard to strike for a bowl of pho, especially for pho ga (chicken), which is often bland compared to the beef. ", "This is my first time eating here, so it is very possible that the restaurant was just \"having a bad day\" or my bowl was the \"1 in a 100 miss\". ", "In any case, here's the breakdown: the broth was the blandest I've ever had. ", "Period. ", "The absence of taste actually grossed me out. ", "The noodles were okay, the texture was a little off ", "but it wasn't what made the soup bad. ", "The chicken also had absolutely no flavor and some pieces were undercooked. ", "Overall, one of my least satisfying bowls of pho. \n", "Considering the other reviews of this place, my advice would be to stick to the sandwiches."], "author": "Yana N.", "review": "This review is for the chicken pho.\nService was fast and friendly. Prices were standardly cheap.\nI'm not a picky eater, especially when it comes to pho. I understand that the perfect balance is hard to strike for a bowl of pho, especially for pho ga (chicken), which is often bland compared to the beef. This is my first time eating here, so it is very possible that the restaurant was just \"having a bad day\" or my bowl was the \"1 in a 100 miss\". In any case, here's the breakdown: the broth was the blandest I've ever had. Period. The absence of taste actually grossed me out. The noodles were okay, the texture was a little off but it wasn't what made the soup bad. The chicken also had absolutely no flavor and some pieces were undercooked. Overall, one of my least satisfying bowls of pho. \nConsidering the other reviews of this place, my advice would be to stick to the sandwiches.", "rating": 2, "date": "2013-06-17"}, {"excerpts": ["Very tasty pho ga and bbq pork rolls. ", "Inexpensive but not cheap."], "author": "John F.", "review": "Come here right now for lunch. Can't wait to try the sandwiches. Very tasty pho ga and bbq pork rolls. Inexpensive but not cheap.", "rating": 5, "date": "2011-08-05"}, {"excerpts": ["My bf lucked out as the noodles for the pho ga were fine.  ", "Not sure how sanitary this place is, my guess is not very.  ", "The dude took my cash, then went into the kitchen, where I could see him put our veggies in pouches.  ", "Didn't see him stop anywhere to was his hands tho.  ", "Will try a sandwich next time."], "author": "Nancy V.", "review": "Can't speak for the sandwiches, but I should have known better than to order bun Bo hue from this joint.  Yuck!  I don't know if it was the end of the day or what, but the bun noodles were soggy as eff. They were in two in pieces and mushy.  I wanted the bun rieu, but they were out.  Guessing I would have gotten the same noodles though.  My bf lucked out as the noodles for the pho ga were fine.  Not sure how sanitary this place is, my guess is not very.  The dude took my cash, then went into the kitchen, where I could see him put our veggies in pouches.  Didn't see him stop anywhere to was his hands tho.  Will try a sandwich next time.", "rating": 3, "date": "2012-07-04"}, {"excerpts": ["pho ga (chicken pho)\n\nportions are plentiful, and our bill came out to $15 total.  ", "the pho ga was definitely not the best i've  had in the city (turtle tower is better), but good nonetheless.  ", "i can't wait to go again to try their banh mi (sandwiches).  ", "i'd recommend taking the food to-go since parking can be a pain, and the restaurant only has a small bar and a few tables outside for seating."], "author": "Brian S.", "review": "i finally went here after reading about this place in the chronicle.\nthis place is great!  we ordered:\n\nbun cha gio (rice noodles with egg rolls)\npho ga (chicken pho)\n\nportions are plentiful, and our bill came out to $15 total.  the rice noodles dish was really delicious: noodles, fresh veggies, bbq pork and egg rolls.  what is not to like?  the pho ga was definitely not the best i've  had in the city (turtle tower is better), but good nonetheless.  i can't wait to go again to try their banh mi (sandwiches).  i'd recommend taking the food to-go since parking can be a pain, and the restaurant only has a small bar and a few tables outside for seating.", "rating": 4, "date": "2010-06-29"}], "pho tai nem": [], "pho bo vien": [], "pho dac biet": [{"excerpts": ["Get the pho dac biet here and maybe other noodle soups but DONT get the garlic noodles unless you like eating mush.  ", "The garlic noodles are just not up to par in the city so stick with pho."], "author": "Vince L.", "review": "I don't know why its hard to find a HOT bowl of pho or just soups that are HOOOOT but this place sure does it.  Get the pho dac biet here and maybe other noodle soups but DONT get the garlic noodles unless you like eating mush.  The garlic noodles are just not up to par in the city so stick with pho.", "rating": 4, "date": "2018-03-07"}, {"excerpts": ["I ended up not just having the coffee but tried the Pho Dac Biet and their Goi Cuon. ", "Ngon qua(DELICIOUS)!"], "author": "Brenda L.", "review": "I came pass by this area and I saw the Ha Long Bay painting outside the store. I miss Viet Nam so I decided to drop by and grab some Vietnamese coffee. I was really happy  to see some of my favorite Vietnamese food like the Pho and their spring rolls. I ended up not just having the coffee but tried the Pho Dac Biet and their Goi Cuon. Ngon qua(DELICIOUS)!", "rating": 4, "date": "2016-11-07"}], "mieng ga": [], "bun bo hue": [{"excerpts": ["A bowl of Bun Bo Hue or Pho will go around $8.80 - $9.30.  ", "I had the Bun Bo Hue, which is a spicy beef noodle dish.  ", "I've had this plenty of times ", "and I was not impressed with this one.  ", "It's tough to review this one, because I'm use to the broth having a strong flavor with a hint of spice.  ", "This one was bland to be honest.  ", "Also, I've always heard food in Vietnam tend to be on the bland side.  ", "So may be ", "this is very accurate and representative, not sure.  "], "author": "Kevin N.", "review": "Had a lot of expectations going into this place, but after leaving, my GF and I felt a little disappointed.  First off, the place is very small, a couple of tables for seating outside and like 5-10 very tight seats along the wall on the inside.\n\nPrice wise, I'd actually have to go $$ on this one.  It's fairly expensive for Vietnamese food.  A bowl of Bun Bo Hue or Pho will go around $8.80 - $9.30.  Banh Mi sandwiches are around $5.25 which is pretty steep considering these kinds of sandwiches are very simple.\n\nI had the Bun Bo Hue, which is a spicy beef noodle dish.  I've had this plenty of times and I was not impressed with this one.  It's tough to review this one, because I'm use to the broth having a strong flavor with a hint of spice.  This one was bland to be honest.  Also, I've always heard food in Vietnam tend to be on the bland side.  So may be this is very accurate and representative, not sure.  Either way this was just OK.\n\nMy GF had the garlic noodles which turned out to be OK too.  These garlic noodles were really dry...SUPER dry.  It's not oily like other garlic noodles.  Sad to say, but it was a little on the bland side as well.  We have pretty bland taste buds too - we don't like strong flavors and even to us, it's bland!\n\nThe imperial rolls were pretty good - typical and is what I expected.  Sorry guys, but I'm going to have to say the fish sauce was on the bland side as well XD !  Fish sauce tend to be really strong but this one was very light.\n\nPortion wise, it wasn't bad, we were full and satisfied.  Overall, I don't think we would come back.  It's just OK.", "rating": 3, "date": "2016-05-01"}, {"excerpts": ["Bun bo hue was, so far, the best I've ever had.\n\n"], "author": "Aren A.", "review": "I really dig this place. I really do. \n\nFamily-owned; extremely friendly people. \n\nFive-spice chicken bunh mi was exceptional.\n\nBun bo hue was, so far, the best I've ever had.\n\nNow, if they served french fries....that would just be amazing. \n\nCan't go wrong with this joint. \n\nHIT. IT. UP.", "rating": 5, "date": "2014-03-30"}, {"excerpts": ["I don't know if they call these things on the menu by these names instead of bun bo hue or pho etc because theyre not supposed to be those things or what, but they definitely weren't exactly what we were expecting.  ", "The spicy beef soup wasnt very spicy, and didn't have any of the big chunks of tendon etc that I'm used to in bun bo hue.  ", "The combo soup was relatively bland, not much there.  ", "The beef rice plate we got was also very bland, and too fatty.  "], "author": "Jon B.", "review": "Friendly staff.  Mediocre soups.  Good sandwiches.\n\nWe came here looking to get some morning pho.  They were supposed to open at 9am, but they actually weren't quite ready yet at that time.  We came back a little while later after getting some coffee and ordered, then sat down.  All the staff there was attentive and friendly, and our food was served FAST!  Unfortunately, it wasn't all that great.\n\nWe tried the spicy beef soup, combination beef soup, and a beef rice plate.  I don't know if they call these things on the menu by these names instead of bun bo hue or pho etc because theyre not supposed to be those things or what, but they definitely weren't exactly what we were expecting.  The spicy beef soup wasnt very spicy, and didn't have any of the big chunks of tendon etc that I'm used to in bun bo hue.  The combo soup was relatively bland, not much there.  The beef rice plate we got was also very bland, and too fatty.  I don't usually mind fat, but when there is lots of fat and still no flavor, es no bueno.\n\nJust so I could have a taste of everything, I ordered a couple sandwiches to go.  A few hours later, I ate my combo vietnamese sandwich.  It was delicious!  And pretty big!  It was exactly how it should be, with pickled carrots, pate, headcheese, ham, cilantro, jalepenos, etc.  They're cheap too, at only $4.10 per sandwich.  My only complaint is that the guy asked me if I wanted it spicy, and I said yes, but my sandwich had no heat at all.\n\nIf I were to come back, itd just be for sandwiches.  No more soup for me!", "rating": 3, "date": "2013-12-20"}, {"excerpts": ["I cannot get enough of their Bun Bo Hue (spicy beef noodle soup).  ", "The broth is flavorful, spicy, and the meat is tender - the fattiness just falls apart in your mouth.  ", "Most places the pork is chewy and you end up pushing it under your noodles.  "], "author": "Josie M.", "review": "\"5/5 SERVICE: attentive hostess was full of great recommendations.  food came out fast\n3/5 AMBIANCE: definitely a take-out/quick bite joint.  very clean.\n5/5 FOOD:  like vietnamese home cooking!\n5/5 VALUE:  where can you get a meal for under $5 anymore? \n\nLittle Vietnam is the quick fix to my noodle cravings.  I cannot get enough of their Bun Bo Hue (spicy beef noodle soup).  The broth is flavorful, spicy, and the meat is tender - the fattiness just falls apart in your mouth.  Most places the pork is chewy and you end up pushing it under your noodles.  I've had the Bun Rieu (Tomato Crab Noodle Soup) there and it was delish too - clean tasting tomato broth with chunks of juicy crab & shrimp meatball.   This is like eating in your mom's kitchen!\n\nFor dessert, pick any one of the many to take home - I love the one with the tropical fruit and little jellies in coconut milk.\n\nBeing a recreational vegetarian every few weeks, I was so happy to see that they have tons of Viet veggie dishes that are hard to find in other places, like tofu spring rolls & the aforementioned Bun Rieu!  I'll have to test next time when I'm in a non meat mode...", "rating": 5, "date": "2006-04-27"}], "cari ga": [], "bun bo kho": [], "bun rieu": [{"excerpts": ["In previous visits, I've also come by for bun rieu aka crab noodles aka super delish. \n\n"], "author": "Jennifer L.", "review": "Banh mi sandwiches have been all rage recently, and Little Vietnam Cafe happens to be one of the fave in the city. To caveat, I only eat fish and veggie, so that's what I'll be reviewing here. \n\nOther banh mi spots in the city that have options that I can eat tend to be fish cake, tofu, or some sort of a shredded veggie situation, which isn't always a crowd pleaser. BUTTTT what I love about the fish option here is that it's a freshly breaded/fried lemongrass fish filet! REALLY great lemongrass flavor. Perfectly flakey fish. Yum. In previous visits, I've also come by for bun rieu aka crab noodles aka super delish. \n\nService is very basic bc it's mostly a to-go spot. There are a few seats inside and outside, but not really a sit-down restaurant by any means. Sandwiches are def on the pricier side, which bothers me a bit when you can get these sandwiches for half the price elsewhere. I'm usually pretty happy w the banh mis overall, but today, the bread was a bit on the stale-esque side. I toasted the other half when I got home, and it was MUCHH better. 4 stars!", "rating": 4, "date": "2017-11-20"}, {"excerpts": ["Came here to eat today and had ordered my usuals, one of which included bun rieu. ", "It turned out to be very bland today (they tend to be pretty inconsistent with the way they make their bun rieu here). ", "So I went up to ask for some shrimp paste. ", "It took them a while to get that to me as I was standing there in front of the register waiting. ", "After going back to my table I realized I needed more lemon as well ", "so I went back inside to ask for one more slice of lemon. ", "The owner/cashier told me abruptly that I can't keep asking for one thing after another rudely, and that completely threw me OFF to the point where I told him to forget it. \n \n", "It's one thing where I'm intentionally being an annoying and inconsiderate customer asking like 3+ times for additional condiments ", "but I wasn't. ", "I simply didn't realize I needed more lemon until after. ", "I'm a usual regular here at this place ", "and I was astounded by how rude this person was to me today. ", "I come here very often ", "and he's usually pretty nice ", "but now I probably won't be returning as much after this incident. ", "Would much rather bring my business elsewhere where it's appreciated lol"], "author": "Sunia L.", "review": "Came here to eat today and had ordered my usuals, one of which included bun rieu. It turned out to be very bland today (they tend to be pretty inconsistent with the way they make their bun rieu here). So I went up to ask for some shrimp paste. It took them a while to get that to me as I was standing there in front of the register waiting. After going back to my table I realized I needed more lemon as well so I went back inside to ask for one more slice of lemon. The owner/cashier told me abruptly that I can't keep asking for one thing after another rudely, and that completely threw me OFF to the point where I told him to forget it. \n \nIt's one thing where I'm intentionally being an annoying and inconsiderate customer asking like 3+ times for additional condiments but I wasn't. I simply didn't realize I needed more lemon until after. I'm a usual regular here at this place and I was astounded by how rude this person was to me today. I come here very often and he's usually pretty nice but now I probably won't be returning as much after this incident. Would much rather bring my business elsewhere where it's appreciated lol", "rating": 2, "date": "2017-03-20"}, {"excerpts": ["I was craving for Bun Rieu, an original Northern noodle dish. ", "Here they made it with a Southern flare: the toppings include pork ham as well as the shrimp paste ball which was absolutely delicious. ", "The broth has a strong shrimp paste flavor, which instantaneously made me salivate. ", "A good amount of tomato wedges were included. ", "The tofu slices were very thin though. ", "I prefer a thick piece of tofu that is juicy when biting into it. ", "This was not the case. ", "This is one of the reason I gave 4 stars. ", "Also the amount of noodles were meager compared to the amount of topping. ", "I ordered the small size as recommended by the dude at the register, but it was too little for me. ", "I read other reviews about inconsistency with this particular noodle dish. ", "Maybe I was there on their good day. ", "Hope for the best in my future visits."], "author": "Thuy V.", "review": "Small place good for grab and go food. They have Banh Mi, spring rolls with different toppings: pork, chicken, cold cut, tofu,etc. They also offer a variety of noodle soups. I was craving for Bun Rieu, an original Northern noodle dish. Here they made it with a Southern flare: the toppings include pork ham as well as the shrimp paste ball which was absolutely delicious. The broth has a strong shrimp paste flavor, which instantaneously made me salivate. A good amount of tomato wedges were included. The tofu slices were very thin though. I prefer a thick piece of tofu that is juicy when biting into it. This was not the case. This is one of the reason I gave 4 stars. Also the amount of noodles were meager compared to the amount of topping. I ordered the small size as recommended by the dude at the register, but it was too little for me. I read other reviews about inconsistency with this particular noodle dish. Maybe I was there on their good day. Hope for the best in my future visits.", "rating": 4, "date": "2018-05-13"}, {"excerpts": ["We also ordered bun rieu to share. ", "It definitely had that home made taste to it. ", "Definitely has a more traditional recipe than most places. ", "Not the best bun rieu, but definitely a convenient spot to get quick noodle soup and sandwiches."], "author": "Ada H.", "review": "This place use to be a lot better before they remodeled. It's a tiny hole in the wall right by smart and final. There is literally only 5 seats inside. if you go on a busy day, be prepared to take your food to go.\n\nMy boyfriend and I usually get there combination pork banh mi with extra pate. The baguette has a nice toasty crunch to it. The meat was good, but I was kind of disappointed that they didn't fully spread the pate over the baguette. Felt like they skimped on the page even though we ordered extra. We also ordered bun rieu to share. It definitely had that home made taste to it. Definitely has a more traditional recipe than most places. Not the best bun rieu, but definitely a convenient spot to get quick noodle soup and sandwiches.", "rating": 3, "date": "2016-11-18"}, {"excerpts": ["It's like bun rieu but with fish paste. "], "author": "Jackie N.", "review": "Among all the Chinese restaurants around here, you find this awesome place. Everyone in the back is Vietnamese cooking, making food authentic. The people are so nice here, you can't resist them. \nThey have thick pho noodles, Banh mi, goi cuon, bun bowls, rice plates. It's nice and convenient to get great food at reasonable price. They are really great at to-go orders. \n\nThe place is a little small so it doesn't accommodate large parties. You can sit outside on a nice day. They serve veggie broth and chicken broth for pho if you don't want the beef broth. \n\nAt lunch time, they get super busy. The vermicelli bowl was good! And they had another noodle soup dish called bun ga that's really good! It's like bun rieu but with fish paste. Must try!  \n\nStop by if you are in the area. You won't be disappointed.", "rating": 5, "date": "2016-02-27"}, {"excerpts": ["Decent bun rieu on this side of the bay. ", "The soup was quite tasty as the herbs used in the broth had just the right kick in it. ", "I have passed by this place all the time, however would not hesitate to come back again!"], "author": "Tracy C.", "review": "Decent bun rieu on this side of the bay. The soup was quite tasty as the herbs used in the broth had just the right kick in it. I have passed by this place all the time, however would not hesitate to come back again!", "rating": 4, "date": "2016-08-13"}, {"excerpts": ["their bun rieu is a bit bland, so i'm staying away from the soup based items and going for the bowls and sandwiches."], "author": "Vanae W.", "review": "LOVE THIS PLACE! it's my new neighborhood spot that reminds me a 'taste of home'.\n\ni think it's cash-only. super, super friendly service.\n\ni love their vermicelli bowls - esp the lemongrass pork. portions are big. and i like to add eggrolls.\n\ntheir bun rieu is a bit bland, so i'm staying away from the soup based items and going for the bowls and sandwiches.", "rating": 5, "date": "2014-01-16"}, {"excerpts": ["On the non-sandwich side of things, their Bun Rieu ($8.00)--featuring generous servings of crab, egg and tomato--is the Richmond's ultimate comfort food. ", "Excellent Sandwiches, excellent Bun Rieu, and excellent service makes this hole-in-the-wall one of my favorite places to grab a lunch on the go.\n\n"], "author": "Casey U.", "review": "If you're not into paying over five dollars for Banh Mi, but looking for a high quality lunch in the Richmond District, Little Vietnam Cafe is the way to go. \n\nFor a mere $4.15 plus tax, you get a well sized, freshly toasted French roll filled with slightly sweet, slightly acidic pickled carrots, jalapeños and daikon, and exceptionally tender, well spiced meat. While they're famous for Five Spiced Chicken Banh Mi (which honestly may be the best in the city), the lemongrass pork never has disappointed me with its delecate interplay of well-heeled citrus notes and slightly charred exterior. Neither one of these options are overly salty, and the ratio of meat to veggies is absolutely perfect.\n\nIf your feeling spendy, order your Banh Mi with \"Peter's Special\". Despite sounding like an act you would find in the pages of \"Fifty Shades of Grey\", the extra $1.25 will get an over-easy egg and a generous dose of \"special sauce\" added to your lunch. The rich flavor of the cholesterol-endowed egg helps immensely to unify the textures and flavors of the sandwich, while the fish-sauce and garlic based jus seeps into the bread, imparting every bite with a fantastic marriage of flavors not to be found anywhere else in the City.\n\nOn the non-sandwich side of things, their Bun Rieu ($8.00)--featuring generous servings of crab, egg and tomato--is the Richmond's ultimate comfort food. Served piping hot and with a side of vermicelli noodles, the soup is extraordinarily filling, and an absolutely delightful panacea against the cold and foggy nights pervasive in the outside lands.\n\nService in this family-run restaurant is superb, with sandwiches and soup coming out quickly. Everyone is exceptionally friendly, and the owner (who works the counter) doesn't forget a face.\n\nFive Stars: Excellent Sandwiches, excellent Bun Rieu, and excellent service makes this hole-in-the-wall one of my favorite places to grab a lunch on the go.\n\nExtras:\n\n-Outdoor tables available. Counter seating inside.\n\n-Their Vietnamese Iced Coffee is remarkably potent.\n\n-Spring rolls and Salads available.\n\n-Near the 1 California, 2 Clement, 44 O'Shaugnessy, and 38 Geary.", "rating": 5, "date": "2013-05-05"}, {"excerpts": [", I would get it again if I was desperate for bun rieu and was to lazy to make it myself but its not as authentic as people claim it to be. \n"], "author": "Reiko n.", "review": "I really liked my sandwhich. I had the combination and it was almost perfect, I just like more pate than others. My boyfriends sandwhich looked pretty good and he said he loved it. So on to my main review, the crab tomatoe soup. It was super salty, did not have a good tomato taste, and very little noodles.It was just ok, I would get it again if I was desperate for bun rieu and was to lazy to make it myself but its not as authentic as people claim it to be. \nThe rice dish with pork was super fatty ( although my friend to like that alot) . \n\nPrices: decent, doesn't rape your wallet Bahn mi: around 4 dollars, Soup like 7:50, and rice dish was around 7. \n\nFood: Sandwhiches are better but everything else was just ok to maybe not great.\n\nService: great\n\nAmbiance: clean and small\n\nParking is a super bitch.", "rating": 3, "date": "2013-05-25"}, {"excerpts": ["Bun Rieu. \n\n", "The Bun Rieu had a nice light tomato base soup that was balanced with the tofu and eggs with bits of crab meat. ", "Topped with a generous portion of greens and bean sprouts. ", "I recommend to those that crave Bun Rieu and other Bun dishes to try it here."], "author": "Nam L.", "review": "As a Vietnamese person who is spoiled by food in the OC, I was glad to have stubled upon this place. The one thing you notice right when you come in is the friendly owner greeting you and taking your order. It has has indoor seating as well as a few tables outside. A lot of his regular customers come here while I was eating here. The food is ready within minutes of ordering; something that I'm use to seeing in OC but is rare to see here in other Vietnamese\n places in San Francisco. \n\nI come here to eat something that is hard to do well in a restaurant establishment but is also hard to cook for yourself at home: Bun Rieu. \n\nThe Bun Rieu had a nice light tomato base soup that was balanced with the tofu and eggs with bits of crab meat. Topped with a generous portion of greens and bean sprouts. It was fulfilling to eat, yet light, and it reminded me of what I use to eat at home. \n\nI also tried the Vermicilli with lemon grass pork, which I took home for a later meal. The vegetables were fresh and there was a generous portion of pork. Good quality Vietnamese food. \n\nI am ambivalent on the sandwiches though. I think they need to work on the texture of their bread, but the ingredients are always fresh. \n\nI recommend to those that crave Bun Rieu and other Bun dishes to try it here.", "rating": 4, "date": "2012-04-14"}, {"excerpts": ["All you need to try are the grilled pork sandwiche (don't order it like a yuppie by calling it bahn mi) and crab noodle soup (bun rieu).\n\n"], "author": "Sunny W.", "review": "One of my favorite cheap eat joints in the City.  All you need to try are the grilled pork sandwiche (don't order it like a yuppie by calling it bahn mi) and crab noodle soup (bun rieu).\n\nYou won't be disappointed by this hole in the wall in the Richmond.", "rating": 4, "date": "2011-12-17"}, {"excerpts": ["On a search for a place that serves both bun rieu and vietnamese sandwiches to satisfy our cravings. ", "Thanks to Yelpers, we came across this place. ", "Vietnamese sandwiches, packaged spring rolls, dry noodle bowls, rice plates, and specialty noodle soups. ", "Small little hole in the wall with limited seating indoors and a few tables/chairs outside. ", "We came here a while back and remember it was scorching hot inside the store, but we still ended up ordering a bowl of noodle soup and snagged a seat indoors...", "- Bun Rieu (tomato crab meat soup): ", "It even came with a little plate of veggies including bean sprouts, mint, etc. "], "author": "Tracy T.", "review": "On a search for a place that serves both bun rieu and vietnamese sandwiches to satisfy our cravings. Thanks to Yelpers, we came across this place. Vietnamese sandwiches, packaged spring rolls, dry noodle bowls, rice plates, and specialty noodle soups. Small little hole in the wall with limited seating indoors and a few tables/chairs outside. We came here a while back and remember it was scorching hot inside the store, but we still ended up ordering a bowl of noodle soup and snagged a seat indoors...what was I thinking?! \n\n- Shrimp spring rolls: Nothing special to note, alright. \n- Grilled lemongrass pork sandwich: Flavorful and toasted, but I've had better and it was pricier in comparison to some other Vietnamese sandwich shops. \n- Bun Rieu (tomato crab meat soup): It even came with a little plate of veggies including bean sprouts, mint, etc. Everything from the meat, tofu, to soup was very tasty, but made me super thirsty afterward. \n\nNon-stop customers coming in and out during lunch time on a weekend day. No sign of a public restroom, but the friendly staff allowed me to use their bathroom hidden inside, plus! \n\nP.S. Cash only!", "rating": 3, "date": "2010-12-28"}, {"excerpts": ["One suggestion: Bun Rieu. ", "By far the most authentic version of it. ", "It comes dead second in comparison to my mom's which is THE BEST (hi mom!). ", "Their bun rieu was perfectly tasting, great portion, full of crab rieu, and fresh veggies. ", "Great value. ", "Not expensive. "], "author": "Katie Anne N.", "review": "Wow, I've finally found my weakness. Finally the most authentic Vietnamese food in San Francisco. My coworker usually dubS me as the \"Vietnamese food order-er\" . I don't mind that at all, because I rarely I get to showcase my Vietnamese skills. \n\nOne suggestion: Bun Rieu. By far the most authentic version of it. It comes dead second in comparison to my mom's which is THE BEST (hi mom!). Their bun rieu was perfectly tasting, great portion, full of crab rieu, and fresh veggies. Great value. Not expensive. Highly recommend this place for real great Vietnamese soup. \n\nThey even have Vietnamese desserts in the refrigerated section. Kinda like in the fast food joints.", "rating": 5, "date": "2008-02-20"}, {"excerpts": ["I've been occasionally known to make a mistake (none yet in my Yelp reviews) and I would suggest the Bun Rieu.  ", "Yep - you heard it here.  ", "Break out of the sandwich shell and try their Bun Rieu.\n", "You like Bun Rieu ", "- you know what is - what's your favorite place in SF to get it?  ", "Try this place's."], "author": "RiCH K.", "review": "I love getting Pho on rainy days, which is an unfortunate way to go when entering the parking gauntlet that is the Inner Clement area.\n\nThere seems to be a ratio of inevitability that the more you have to do the parking tango in the rain, all the while having to circle further from you real goal - the greater the desire grows (and sometimes the expectations).\n\nAnd Whoa is the experience if expectations are sorely missed.  Thus was mine.\n\nThis was the 1st time me getting the Pho at this place - and my last.\nBut I'll be back for foods other than the Pho.   But the lesson learned is to: \"Go here for the sandwiches only\".\n\nThis isn't the cleanest place, or the biggest, or the cleanest, and I would give it more stars were it not for the recent Pho meltdown.  But I do like the older folks behind the counter. \n\nBUT WAIT!!!! I've been occasionally known to make a mistake (none yet in my Yelp reviews) and I would suggest the Bun Rieu.  Yep - you heard it here.  Break out of the sandwich shell and try their Bun Rieu.\nYou like Bun Rieu - you know what is - what's your favorite place in SF to get it?  Try this place's.", "rating": 3, "date": "2009-03-23"}, {"excerpts": ["Besides the sandwiches, another superstar on the menu is the bun rieu - tomato crab noodle soup. ", "if you've never had it, TRY IT!!!  ", "the flavor combination may sound strange to those with primarily western palates, but trust me, it works."], "author": "Leona K.", "review": "A sandwich for $3 is a total steal, especially when it is damn good.   I don't know what they do to their tofu, but the texture and spices are perfect with the crunchy shredded carrots, cilantro, jalepeno and spiced mayo. Great friendly service also.   I'm withholding the final star because the tofu sandwich used to be EVEN yummier when they did not add big chunks of raw onion in it.  I'm not sure why they started doing that, because as far as I saw in Vietnam, that ain't how it's done.\n\nBesides the sandwiches, another superstar on the menu is the bun rieu - tomato crab noodle soup. if you've never had it, TRY IT!!!  the flavor combination may sound strange to those with primarily western palates, but trust me, it works.", "rating": 4, "date": "2007-03-17"}, {"excerpts": ["So we got one of each, a grilled pork banh mi and a bun rieu (tomato crab meat soup). ", "I love bun rieu, and it's hard to find a good full-flavored bun rieu that doesn't require the addition of more fish sauce to get more flavor. ", "Their bun rieu rocks! ", "It tasted home made, the egg/crab meat/shrimp was tasty, and the fried tofu were thin slices, so it absorbed the full flavors of the soup.  ", "I can't believe I waited this long to try their bun rieu, but will definitely be back for some more good ole comfort food."], "author": "Annie Y.", "review": "Today Tony and I came by for a lite lunch, either a banh mi or some noodle soup. So we got one of each, a grilled pork banh mi and a bun rieu (tomato crab meat soup). I love bun rieu, and it's hard to find a good full-flavored bun rieu that doesn't require the addition of more fish sauce to get more flavor. Their bun rieu rocks! It tasted home made, the egg/crab meat/shrimp was tasty, and the fried tofu were thin slices, so it absorbed the full flavors of the soup.  I can't believe I waited this long to try their bun rieu, but will definitely be back for some more good ole comfort food.", "rating": 5, "date": "2009-08-23"}, {"excerpts": ["I wanted the bun rieu, but they were out.  ", "Guessing I would have gotten the same noodles though.  "], "author": "Nancy V.", "review": "Can't speak for the sandwiches, but I should have known better than to order bun Bo hue from this joint.  Yuck!  I don't know if it was the end of the day or what, but the bun noodles were soggy as eff. They were in two in pieces and mushy.  I wanted the bun rieu, but they were out.  Guessing I would have gotten the same noodles though.  My bf lucked out as the noodles for the pho ga were fine.  Not sure how sanitary this place is, my guess is not very.  The dude took my cash, then went into the kitchen, where I could see him put our veggies in pouches.  Didn't see him stop anywhere to was his hands tho.  Will try a sandwich next time.", "rating": 3, "date": "2012-07-04"}, {"excerpts": ["I've never had a sandwich here, but they have the most legit bun rieu in the city. ", "Their bun rieu is nice and hearty with big chunks of tomatoes, fish cake, tofu, and shredded crab, swimming in a flavorful sour broth with vermicelli noodles. ", "Greens and sprouts arrive on a styrofoam plate and the only seating is counter seating. ", "Definitely not a place you go for ambiance, but somewhere you go for nothing more than the food itself."], "author": "Victoria N.", "review": "I've never had a sandwich here, but they have the most legit bun rieu in the city. Their bun rieu is nice and hearty with big chunks of tomatoes, fish cake, tofu, and shredded crab, swimming in a flavorful sour broth with vermicelli noodles. Greens and sprouts arrive on a styrofoam plate and the only seating is counter seating. Definitely not a place you go for ambiance, but somewhere you go for nothing more than the food itself.", "rating": 4, "date": "2009-10-30"}, {"excerpts": ["I've had the Bun Rieu (Tomato Crab Noodle Soup) ", "there ", "and it was delish too - clean tasting tomato broth with chunks of juicy crab & shrimp meatball.   ", "Being a recreational vegetarian every few weeks, I was so happy to see that they have tons of Viet veggie dishes that are hard to find in other places, like tofu spring rolls & the aforementioned Bun Rieu!  ", "I'll have to test next time when I'm in a non meat mode..."], "author": "Josie M.", "review": "\"5/5 SERVICE: attentive hostess was full of great recommendations.  food came out fast\n3/5 AMBIANCE: definitely a take-out/quick bite joint.  very clean.\n5/5 FOOD:  like vietnamese home cooking!\n5/5 VALUE:  where can you get a meal for under $5 anymore? \n\nLittle Vietnam is the quick fix to my noodle cravings.  I cannot get enough of their Bun Bo Hue (spicy beef noodle soup).  The broth is flavorful, spicy, and the meat is tender - the fattiness just falls apart in your mouth.  Most places the pork is chewy and you end up pushing it under your noodles.  I've had the Bun Rieu (Tomato Crab Noodle Soup) there and it was delish too - clean tasting tomato broth with chunks of juicy crab & shrimp meatball.   This is like eating in your mom's kitchen!\n\nFor dessert, pick any one of the many to take home - I love the one with the tropical fruit and little jellies in coconut milk.\n\nBeing a recreational vegetarian every few weeks, I was so happy to see that they have tons of Viet veggie dishes that are hard to find in other places, like tofu spring rolls & the aforementioned Bun Rieu!  I'll have to test next time when I'm in a non meat mode...", "rating": 5, "date": "2006-04-27"}], "hu tieu dac biet": [], "bun cha gio": [{"excerpts": ["The rice noodles with imperial rolls and grilled pork (Bun Cha Gio Thit Nuong) and Vietnamese Sandwiches are so trill.  ", "Highly recommended.  ", "There is only limited seating (4 or 5 seats) along the windows though.  ", "Also it is cash only."], "author": "Matthew H.", "review": "Viet-tastic!\n\nThis is my new favorite Vietnamese place in San Francisco.  The rice noodles with imperial rolls and grilled pork (Bun Cha Gio Thit Nuong) and Vietnamese Sandwiches are so trill.  Highly recommended.  There is only limited seating (4 or 5 seats) along the windows though.  Also it is cash only.", "rating": 4, "date": "2007-01-06"}, {"excerpts": ["we ordered:\n\nbun cha gio (rice noodles with egg rolls)\n"], "author": "Brian S.", "review": "i finally went here after reading about this place in the chronicle.\nthis place is great!  we ordered:\n\nbun cha gio (rice noodles with egg rolls)\npho ga (chicken pho)\n\nportions are plentiful, and our bill came out to $15 total.  the rice noodles dish was really delicious: noodles, fresh veggies, bbq pork and egg rolls.  what is not to like?  the pho ga was definitely not the best i've  had in the city (turtle tower is better), but good nonetheless.  i can't wait to go again to try their banh mi (sandwiches).  i'd recommend taking the food to-go since parking can be a pain, and the restaurant only has a small bar and a few tables outside for seating.", "rating": 4, "date": "2010-06-29"}], "bun thit nuong": [{"excerpts": ["Okay, so for bun thit nuong, now we're getting into some quality territory. ", "This is a tiny little place, and it's best to go ahead and call in advance. ", "Also, be careful -- they sell prepackaged bun, which is pretty meh. ", "What you want is the fresh made stuff, because it's pretty right on. "], "author": "Jake S.", "review": "Okay, so for bun thit nuong, now we're getting into some quality territory. This is a tiny little place, and it's best to go ahead and call in advance. Also, be careful -- they sell prepackaged bun, which is pretty meh. What you want is the fresh made stuff, because it's pretty right on. The pork is very flavorful, the vegetables just right, and the sauce is just the right amount of sweet and spicy.\n\nThe sandwiches are okay, depending on when you get them. I absolutely concur with the stale bread thing -- get a bad one and it'll cut up the roof of your mouth something fierce. But we're not coming here for sandwiches, we're coming here for some fucking bun fucking thit noung.", "rating": 4, "date": "2007-10-04"}], "bun ga nuong": [], "bun cha gio thit nuong": [{"excerpts": ["The rice noodles with imperial rolls and grilled pork (Bun Cha Gio Thit Nuong) and Vietnamese Sandwiches are so trill.  ", "Highly recommended.  ", "There is only limited seating (4 or 5 seats) along the windows though.  ", "Also it is cash only."], "author": "Matthew H.", "review": "Viet-tastic!\n\nThis is my new favorite Vietnamese place in San Francisco.  The rice noodles with imperial rolls and grilled pork (Bun Cha Gio Thit Nuong) and Vietnamese Sandwiches are so trill.  Highly recommended.  There is only limited seating (4 or 5 seats) along the windows though.  Also it is cash only.", "rating": 4, "date": "2007-01-06"}], "bun tom thit nuong": [], "bun cha gio nem nuong": [], "banh mi cha lua": [], "banh mi xiu mai": [], "banh mi dac biet": [{"excerpts": ["A true banh mi dac biet (combo) ", "consists of slices of pork, pork skin, pate, and cha lua (a type of vietnamese sausage/meat).  ", "Little Vietnam's cafe sandwich consists of regular cured American ham, a slice of cha lua, and american mayonnaise.  ", "It was horrific!!!!  ", "If you want an authentic sandwich, I strongly suggest another sandwich place.  ", "Do not visit this shop!!!"], "author": "Vivian T.", "review": "I would give this place zero stars if I could. I am a Vietnamese sandwich expert. I know my stuff.  Little Vietnam Cafe is a poor excuse for a Vietnamese restaurant.  Their sandwiches are utter disgraces to the Vietnamese cuisine.  The bread was soggy, not crispy as it should be.  There was not enough meat. It was poorly seasoned.  Because it was so soft, the sandwich fell apart before you could even bite into it.  I bought three sandwiches on my first and last visit.  Purchased the chicken, pork and combo.   I judge a sandwich shop by their combination sandwich. A true banh mi dac biet (combo) consists of slices of pork, pork skin, pate, and cha lua (a type of vietnamese sausage/meat).  Little Vietnam's cafe sandwich consists of regular cured American ham, a slice of cha lua, and american mayonnaise.  It was horrific!!!!  If you want an authentic sandwich, I strongly suggest another sandwich place.  Do not visit this shop!!!", "rating": 1, "date": "2008-02-11"}], "banh mi thit nuong": [{"excerpts": ["I got the traditional Banh Mi Thit Nuong (vietnamese sandwich with grilled pork). ", "The french baguette was nicely toasted not like Lee's sandwiches where it's rock hard and tears up the roof of your mouth when you first bite into it. "], "author": "David W.", "review": "I got lost looking for a dim sum restaurant and when I finally found it I couldn't find parking. When I found parking it was just too far for me to walk to so I gave up. When I made the decision to give up I turned left and noticed this place. I hate to say this especially when my hometown is San Jose, but this place is pretty darn good! \n\nI got the traditional Banh Mi Thit Nuong (vietnamese sandwich with grilled pork). The french baguette was nicely toasted not like Lee's sandwiches where it's rock hard and tears up the roof of your mouth when you first bite into it. The pickled carrots, daikon, cucumber, cilantro, and jalapenos tasted really fresh. \n\nI'm not sure what made this sandwich so good. Maybe it's their secret sauce that they put in it? Either way friendly service and good food = 5 stars from me. \n\nOne more thing...I think San Jose has bigger sandwiches. Size does matter! At least for me....in a non homosexual way. :)", "rating": 4, "date": "2013-01-06"}, {"excerpts": ["I usually get the Banh Mi Thit Nuong - BBQ pork sandwich - with extra jalapenos!  ", "I've also had vietnamese coffee, some of their rolls, and other starters - can't say that I have a single complaint.  ", "Except for the fact that they're lagging on opening their Mission store!"], "author": "Nicole N.", "review": "I love this place!  Last time I was there I chatted with the owner and I asked him when he was going to open up a shop in the Mission.  He told me they were working on it!  If anyone hears about the progress on this, please let me know!\n\nI've had sandwiches from them about 3 times now and they've been consistently good.  I usually get the Banh Mi Thit Nuong - BBQ pork sandwich - with extra jalapenos!  I've also had vietnamese coffee, some of their rolls, and other starters - can't say that I have a single complaint.  Except for the fact that they're lagging on opening their Mission store!", "rating": 4, "date": "2007-05-28"}], "banh mi ga nuong": [], "com thit nuong": [], "com ga nuong": [], "com suong nuong": [], "com suong bi cha": [], "com suon dai han": [], "com ga chien": [], "com tom chien": [], "trung chien": [], "banh mi chay": [{"excerpts": ["We ordered: (1) Banh Mi Chay sandwich with tofu (no mayo) (2) Vermicelli Bowl with tofu and a fried spring roll and (3) fresh jicama rolls. \n\n"], "author": "Kelly L.", "review": "My fiance and I went to a tea-tasting at Aroma Tea, which is right across the street from Little Vietnam Cafe. We were planning on going someplace else for lunch, but thought we'd check out their menu for future reference. One of the customers waiting for his order told us how great this place is, and since they had lots of vegan options, we decided to stay. \n\nWe ordered: (1) Banh Mi Chay sandwich with tofu (no mayo) (2) Vermicelli Bowl with tofu and a fried spring roll and (3) fresh jicama rolls. \n\nI have to say that everything tasted super fresh, flavorful and amazing! Out of everything, my favorite has to be the vermicelli bowl (which was like a deconstructed fresh spring roll). Their prices are very affordable, which is nice b/c you can try a few different things in one visit. Also it should be noted that they have limited seating, but usually if you wait a few minutes, tables become available. \n\nI can't wait to go back and try their other veg options!", "rating": 4, "date": "2014-07-15"}, {"excerpts": ["and I'm happy to report that the banh mi chay (tofu) from Little Vietnam Cafe not only amounts to a delicious $3.50, but it includes one of the best iterations of tofu I've had, ever. \n\n", "Alas, this is the only dish I've actually tried at LVC... but, when the banh mi chay is yummy, cheap, and filling, you can't go wrong!"], "author": "Sam S.", "review": "I'm no banh mi expert, but I DO love a good vegetarian sandwich -  and I'm happy to report that the banh mi chay (tofu) from Little Vietnam Cafe not only amounts to a delicious $3.50, but it includes one of the best iterations of tofu I've had, ever. \n\nI'm actually not the biggest fan of tofu, despite its (ideally) versatile nature and my status as a vegetarian... and that's because most people DON'T know how to cook it!! (c'mon, how many times have you had a really, awfully bland tofu dish?!) The fried tofu here, however, has an interesting texture and is super flavorful, especially when combined with the other ingredients.\n\nAlas, this is the only dish I've actually tried at LVC... but, when the banh mi chay is yummy, cheap, and filling, you can't go wrong!", "rating": 4, "date": "2010-12-15"}, {"excerpts": ["Truly excellent banh mi chay (vegetarian sandwich).  ", "Nice slabs of flavorful tofu and plentiful vegetables.  "], "author": "Ethan R.", "review": "Truly excellent banh mi chay (vegetarian sandwich).  Nice slabs of flavorful tofu and plentiful vegetables.  Great bread and a generous size - just enough to allow me to leave without too much regret about not ordering a second one.\n\nThe space is tiny but there are a few window seats.  Definitely go for the hot sauce on the counter - I assume it's homemade, but either way it's delicious.\n\nUp there with my gold standard, Mei Sum in Boston ... (http://www.yelp.com/biz/mei-sum-inc-boston#hrid:SbJYwqwQ4YTxkPZFUwVfGw)", "rating": 5, "date": "2010-03-03"}], "goi cuon chay": [], "goi chay": [], "thap cam cari chay": [], "rau thap cam chay": []}