{"sweet iced tea": [{"excerpts": ["My boss got 3 pieces of chicken with waffles and sweet iced tea and I ordered the bbq shrimp po boy. ", "The sweet tea is made with honey I think and my boss was all about it. "], "author": "Tiffany V.", "review": "Hey Tiff what'd you do at work today? Oh I went to lunch. \n\n**I think a good 50% of these reviews are for the actual restaurant. This is just a small window you order out of in an alley in SOMA and you sit on this weird cement block across the street to eat pending the weather. \n\nMy boss was craving waffles and after shooting down every option I presented him with, he said we were going to Farmerbrowns. Yay! I had been meaning to go there for the longest time, little did I know we were going to Farmerbrowns Skillet and not the actual restaurant downtown. \n\nThe line moves super slow but the food comes out fast. My boss got 3 pieces of chicken with waffles and sweet iced tea and I ordered the bbq shrimp po boy. The sweet tea is made with honey I think and my boss was all about it. I thought the size was really small though. \n\nMy po boy was good and packed with shrimp but there was way too much bread. I think I must not be a fan of soul food because I also HATED the ever popular Brendas. The cayenne chips were pretty good and they give you a huge portion. \n\nThey have biodegradable utensils, three different kinds of hot sauce (try the honey jalapeno!), water cups, wet naps, etc next to the window. I took full advantage! It was super windy that day and everyones stuff was flying all over the street...litter     -____- There is also a coffee shop right next door! \n\n\n$30 for lunch and I saw like 10 different guys I would marry.", "rating": 3, "date": "2013-03-12"}, {"excerpts": ["Basically, you don't come here for anything but the fried chicken (and the bomb sweet iced tea!). ", "As of last Saturday, they had a few new items in the menu--wings and drumettes(?) with waffles for ~$10! ", "I have always over-ordered or under-ordered at Little Skillet, but this new item is exactly the amount of food that I would like, and has wings, which are essentially my favorite chicken part along with the thighs. "], "author": "Clarisse V.", "review": "I *love* Little Skillet. It's my go-to place for solid fried chicken. There was even a time when I was here for 3 consecutive weekends (consuming something like 10 pieces of chicken total)! It's great that you can now actually sit and eat at a table as opposed to finding a place on the street, although that was charming in its own way.\n\nThe mac n' cheese is good, the big waffles are delicious but lacks the crispness that I prefer my waffles to have, and the cornbread is just ok (they throw the little guys in for free!).\n\nBasically, you don't come here for anything but the fried chicken (and the bomb sweet iced tea!). As of last Saturday, they had a few new items in the menu--wings and drumettes(?) with waffles for ~$10! I have always over-ordered or under-ordered at Little Skillet, but this new item is exactly the amount of food that I would like, and has wings, which are essentially my favorite chicken part along with the thighs. I hope it never goes away!  \n\nIn closing, the staff has always been accommodating and pleasant, there has never been too long of a wait for me, and the decor of the place is pretty cool in a steampunk western kind of way. Definitely come here for an awesome chicken-filled morning/afternoon!", "rating": 5, "date": "2014-11-25"}, {"excerpts": ["Southern style sweet iced tea in Cali? ", "The breakfast po-boy was tasty and the sweet iced tea I was overwhelmed with joy how it tastes just like southern style sweet iced tea. ", "All in all I recommend this place to anybody looking for a good meal to go with their sweet iced tea."], "author": "Eric H.", "review": "Southern style sweet iced tea in Cali? This place has it and it is dead on.\n\nThis place is a hole in the wall, no literally, there is a hole in a wall and that is the entire place. The breakfast po-boy was tasty and the sweet iced tea I was overwhelmed with joy how it tastes just like southern style sweet iced tea. The ambiance is very SF, so if that is what you are looking for, you found it.\n\nAll in all I recommend this place to anybody looking for a good meal to go with their sweet iced tea.", "rating": 4, "date": "2010-08-06"}], "housemade lemonade": [], "ginger lemonade": [{"excerpts": ["I also had their ginger lemonade, which really hit the spot.\n\n"], "author": "Lily W.", "review": "Pretty decent place! I found myself wandering the area with a friend when we were car-less to go to our original intended locale. She lives in the area, and we ended up walking over. \n\nWe decided to get the Chicken and Waffles with a side of cornbread, and a blackened shrimp po'boy. Overall the food was pretty good.\n\nChicken: Very crispy. Had strong chicken flavor, but not a lot of seasoning. It was a solid pairing with the waffles. They only used the thigh/wing, so not sure how i feel about this. I usually like a mix of white/dark meat to compare the quality.\n\nWaffles: Super crispy. The syrup was GOLD. mmm...a little goes a long way. But a lot wouldn't be too bad.\n\nJalapeno Cornbread: The side of cornbread are 5 mini-muffin sized cornbreads. They were okay, but I felt a little dry. And not very Jalapeno-flavored. So...if you don't like spicy, this is fine for you. Kinda wish they had some butter to go with this though. \n\nPo'Boy: Probably the best thing out of it all. The shrimp were pretty giant, and the portion for the price. It was also really flavorful, and came with a side of chips. Mmm.\n\nI also had their ginger lemonade, which really hit the spot.\n\nAmbiance: It's crowded and LOUD. Looked like half their space was taken up by a private party, but I couldn't hear very well. Also...folks, check your privilege. Throwing your jacket on a table you're not using in a crowded room is basically saying \"my jacket is more important than the business's business.\"  Rude. Also, creating a little conversation circle in the MIDDLE of space staff walk through? RUDE!!", "rating": 4, "date": "2015-11-13"}, {"excerpts": ["A side of greens and the hibiscus lemonade and the ginger lemonade. ", "The hibiscus one was pretty good. ", "The actual restaurant was nice. ", "It was temperature wise- perfect. ", "It was cool and not all bright and sunny- ", "I had a migraine so this worked for me. ", "They had CNN, basketball, and some other sports channel on at the bar. ", "There's a smaller room where there's a bar on the right side of the place- ", "it's probably for parties- ", "I don't know. ", "The bathroom was dark. ", "But pretty cool as far as the cranks they have as stall handles. ", "All the steel was nice. ", "It was clean and smelled like it was recently wiped down. ", "The food was done pretty quickly. ", "The chips? ", "Super good. ", "The sandwich I had was good. ", "The chicken was one big breast piece. ", "And when I bit it- the whole piece of meat came out. ", "Slaw and pickles as well. ", "But I ate every bit of it. ", "The fish sandwich was supposedly good. ", "I don't eat fish. ", "But, I'll suggest that to anybody who does eat ", "fish- ", "it looked yummy. ", "This place for me- was pretty pricey. ", "I wouldn't go here again because of that part- ", "I could think of so many other places I'd rather go for the amount of money. ", "That lemonade tho? ", "I'd gladly buy that by the pitcher. ", "Three stars for the lemonade and cool dining area. ", "Minus one for the corny drink names. ", "And minus one more for the prices."], "author": "Tracy R.", "review": "Sooooo, we ended up here after a two day hype of looking for a chicken sandwich. It's a nicely located place. One of those alley joints- where once junkies slept- is now a really nice place to eat. So, me and one other person came here and ordered the chicken po boy and a fish sandwich, I think. A side of greens and the hibiscus lemonade and the ginger lemonade. The hibiscus one was pretty good. The actual restaurant was nice. It was temperature wise- perfect. It was cool and not all bright and sunny- I had a migraine so this worked for me. They had CNN, basketball, and some other sports channel on at the bar. There's a smaller room where there's a bar on the right side of the place- it's probably for parties- I don't know. The bathroom was dark. But pretty cool as far as the cranks they have as stall handles. All the steel was nice. It was clean and smelled like it was recently wiped down. The food was done pretty quickly. The chips? Super good. The sandwich I had was good. The chicken was one big breast piece. And when I bit it- the whole piece of meat came out. Slaw and pickles as well. But I ate every bit of it. The fish sandwich was supposedly good. I don't eat fish. But, I'll suggest that to anybody who does eat fish- it looked yummy. This place for me- was pretty pricey. I wouldn't go here again because of that part- I could think of so many other places I'd rather go for the amount of money. That lemonade tho? I'd gladly buy that by the pitcher. Three stars for the lemonade and cool dining area. Minus one for the corny drink names. And minus one more for the prices.", "rating": 3, "date": "2017-03-08"}], "kiwi lemonade": [{"excerpts": ["Also, try the Kiwi Lemonade.  ", "I had a sip of my friend's ", "but I wanted to drink it all."], "author": "Shannon L.", "review": "Walking by this place you'd think it was out of an advertisement or commercial.  It's a small stand-in-a-wall located in an alley with groups of trendy looking people are sitting outside on ledges and benches eating their trendy food.\n\nI shared a 2 piece/1 waffle chicken meal ($8) and the waffle is a lot bigger than I expected.  It's as big as the entire bottom of the box!  It's the thick Belgian style so if you're expecting the thin kind at Roscoe's, then you might be disappointed.  But in it's own way, it still works.  It's lightly dusted with powdered sugar.  The syrup is THICK and I'm really thinking there is some molasses mixed in there.\n\nI like how the fried chicken is fried because it tastes like they very thoroughly tried to drain all the oil out.  If you get some good pieces, the skin can be very delicious.  Two pieces mean you get a gigantic breast and a drumstick.  For hot sauce, they even have Tapatio packets!  I had no idea these existed.\n\nAlso, try the Kiwi Lemonade.  I had a sip of my friend's but I wanted to drink it all.", "rating": 4, "date": "2010-02-27"}, {"excerpts": ["They also had freshly made kiwi lemonade which was bomb-diggity in the sunlight (I liked how the little black seeds of the kiwis mingle in the bottom of the drink).\n\n"], "author": "Jordan Reis C.", "review": "There is no dining room, there is no waiter, there is no silverware, or even tables... there is a window and a truck loading type area to sit in an alley, basics.\n\nThe chicken and waffles are awesome. Its not Roscoe's and can't really be compared as the waffle is completely different, but it is delicious and pretty cheap for my waffle and 2 pc chix at around $8. The chix was the culinary highlight of the dish which I paired with an elegant bottle of '09 Crystal Estate hot sauce. They also had freshly made kiwi lemonade which was bomb-diggity in the sunlight (I liked how the little black seeds of the kiwis mingle in the bottom of the drink).\n\nAlso, there is a window serving blue bottle coffee right next door, so it pretty much has everything you need to enjoy your afternoon.", "rating": 4, "date": "2010-03-16"}], "seafood gumbo": [{"excerpts": ["The seafood gumbo could have used a little more flavor. ", "They tasted like they were hastily prepared. ", "However, The fried chicken and waffle were very fresh. ", "Even though the skin should've had a little more seasoning. \n", "The patrons taking the order were super friendly but were offset by the staff who brought the food out. ", "Would've been nice to have a little friendliness and hospitality from the service staff. \n", "Overall I'd go here if I had limited choices for places, but wouldn't make a date to go there."], "author": "Maisha R.", "review": "Food,atmosphere and staff were decent. The angel biscuit was pretty creamy and substantial. The seafood gumbo could have used a little more flavor. They tasted like they were hastily prepared. However, The fried chicken and waffle were very fresh. Even though the skin should've had a little more seasoning. \nThe patrons taking the order were super friendly but were offset by the staff who brought the food out. Would've been nice to have a little friendliness and hospitality from the service staff. \nOverall I'd go here if I had limited choices for places, but wouldn't make a date to go there.", "rating": 3, "date": "2018-09-03"}, {"excerpts": ["Seafood gumbo. ", "Spicy kick but otherwise no other flavor. "], "author": "Lexy C.", "review": "Inexplicably meh. \n\nCajun fries. These had been sitting around the kitchen for awhile, just barely warm. Cajun flavor was completely lacking.\n\nSeafood gumbo. Spicy kick but otherwise no other flavor. There is no other apparent seafood except shrimp, despite the menu description. \n\nChicken wings. Nothing special. \n\nWouldn't come again, but it's not awful if you're in a pinch.", "rating": 2, "date": "2018-07-17"}, {"excerpts": ["Other things are good here too like the seafood gumbo. \n\n"], "author": "Inga C.", "review": "I'm a convert to the fried chicken and waffles establishment and Little Skillet has one of the best. \n\nOther things are good here too like the seafood gumbo. \n\nDrinks are unlimited refills. Lots of seating, adorable interior decor, great vibe.", "rating": 4, "date": "2016-06-19"}, {"excerpts": ["Seafood Gumbo: They do NOT skimp on the seafood. "], "author": "Krystle T.", "review": "Our uber driver took us into a alley and I started praying.\nLittle did I know, we soon arrived at Little Skillet. Upon walking in, I was ready to smoke a cigar and chill at the bar.\n\nPrice: Look to spend about $10 per item.\n\nParking: UNSURE\n\nService: Ehh\n\nDrinks: They have a full bar and serve bloody marys.\n\nFood:\nChicken & waffles: Fried chicken was ON POINT. Crispy on the outside and juicy on the inside. The waffles were crispy, but not soft. \n\nPecan Pie: SPOT ON. Full of pecans and less of that gooey sugar stuff.\n\nSeafood Gumbo: They do NOT skimp on the seafood. Bomb stuff.\n\nNotes: The vibe of this place is awesome. Food is presented super cute-ly.", "rating": 5, "date": "2015-12-24"}, {"excerpts": ["The greens had a nice sour kick to it and the seafood gumbo was delicious!\n\n"], "author": "Yan F.", "review": "Kind of disappointed both times I went here.\n\nFirst time, I got the shared chicken and waffles set. Chicken was OK--a little on the dry side and I thought that the meatier parts of the chicken weren't as flavorful. I expected better from a chicken and waffles place.\n\nI love the waffles here--they are on the crispier side, which is what I prefer. I wouldn't get the waffles if you like yours fluffy.\n\nWe also got a market salad to share, which wasn't terribly good. Very plain. Maybe we didn't drown it in enough dressing.\n\nSecond time, I got the ribs, a cup of gumbo, and a side of collard greens. The greens had a nice sour kick to it and the seafood gumbo was delicious!\n\nI would definitely recommend the gumbo--big, juicy morsels of seafood and nicely spiced.\n\nThe ribs though, were disappointing--a bit dry and I was pretty unimpressed by the BBQ sauce. It left much to be desired.\n\nOverall, some hits, some misses. Decor and ambience are a very SF rendition of the hipster south. Prices are fine.", "rating": 3, "date": "2016-08-13"}, {"excerpts": ["Large seasoned fries - cold and stale\nLarge bbq ribs (8 pcs) with side of mac and cheese - false advertistment....does not fall off the bones and it taste like sauce was just brush on the outside , meat pretty tuff not soft at all\n8 pcs chicken & waffle - chicken are juicy but breading was tacky and tuff\nSeafood gumbo - big kick and by far the best out of all was ordered"], "author": "Linh D.", "review": "Maybe the experience would of been better if it wasnt sold through a window during a private event held...\n\nOrdered the following....\nLarge seasoned fries - cold and stale\nLarge bbq ribs (8 pcs) with side of mac and cheese - false advertistment....does not fall off the bones and it taste like sauce was just brush on the outside , meat pretty tuff not soft at all\n8 pcs chicken & waffle - chicken are juicy but breading was tacky and tuff\nSeafood gumbo - big kick and by far the best out of all was ordered", "rating": 2, "date": "2015-12-12"}, {"excerpts": ["The  Shrimp PoBoy and seafood gumbo hit the spot. ", "Well done Little Skillet."], "author": "Justin D.", "review": "As someone from Southeast Texas that travels frequently I'm always looking for taste of home. The  Shrimp PoBoy and seafood gumbo hit the spot. Well done Little Skillet.", "rating": 4, "date": "2017-02-11"}, {"excerpts": ["Pulled Pork Sandwich & Seafood Gumbo!\n", "Shame I couldn't return to try the rest of the menu.\n", "Thanks heaps guys... ", "It was delicious!"], "author": "Ad R.", "review": "Best meal I had in San Fran!... Pulled Pork Sandwich & Seafood Gumbo!\nShame I couldn't return to try the rest of the menu.\nThanks heaps guys... It was delicious!", "rating": 5, "date": "2016-11-30"}, {"excerpts": ["Seafood Gumbo - Plain and had two pieces of shrimp and a small piece of catfish. ", "WHY DID I ORDER THIS?!!?!?!? "], "author": "Andrew D.", "review": "I can't believe this has 4 stars...granted the layout is really cool.\nWent there this morning and the girl handling the cash register (girl with the nose ring) was SO RUDE and had such a bad attitude. Despite that I still ordered the following below (even though I wish I didn't)...\n\nShrimp Po Boy -THE BREAD WAS SO BAD. They probably got it from a supermarket that was tossing out old food. The shrimp wasn't crunchy or hot at all. It also tasted like it was leftover from the night before...\n\nSeafood Gumbo - Plain and had two pieces of shrimp and a small piece of catfish. WHY DID I ORDER THIS?!!?!?!? WHYYYYY\n\n2 Piece Chicken and Waffles with a side of Mac - The chicken is just OK. I'd compare it to popeyes to be honest. I can't complain but for the price I'm paying I expect MORE. The syrup was tasty albeit the consistency was a bit too watery for my liking. The MAC n CHEESE was horrible....I could have made it better with KRAFT!The WAFFLE...omg DID THEY BUY IT FROM COSTCO? They didn't even bother to reheat it!!!! ASFKDSLFKj dlkfjdlkjslkdfj kdfj lksgjhlrdzs; flkjxd NO NO NO NO NO!!!!\n\nI had such an unpleasant experience that I'm even tempted to call my credit card company and report fraud!!!! Never have I ever used my caps lock button as much as I have in this review.\n\nNEVER AGAIN. To all you yelp reviewers that gave it 4 stars or higher...shame on you. Grow some taste buds.....", "rating": 1, "date": "2015-10-10"}, {"excerpts": ["Their catfish po'boy and seafood gumbo was incredibly yummy and in fact, the best gumbo I've had so far while the bf said their chicken and waffles was the best he's ever had."], "author": "Sherry P.", "review": "I've had my fair share of walking down Ritch quite a few times and never had I known there was such an amazing restaurant inside this bar! Their catfish po'boy and seafood gumbo was incredibly yummy and in fact, the best gumbo I've had so far while the bf said their chicken and waffles was the best he's ever had.", "rating": 5, "date": "2015-07-03"}, {"excerpts": ["Ended up ordering the seafood gumbo because I was eager to have more. ", "Everything I had was great and they had ballast point sculpin on draft. ", "Will definitely return."], "author": "Andrew V.", "review": "Wow what can I say. Had the 2 piece chicken and waffles and was blown away. The location has an odd setup depending on which way you come down the alley but once you get inside you're welcome by a nicely designed interior will a beautifully wooden bar.\n\nYou order at a window in the back and are brought your food. Service was great and food took about as expected. \n\nEnded up ordering the seafood gumbo because I was eager to have more. Everything I had was great and they had ballast point sculpin on draft. Will definitely return.", "rating": 5, "date": "2014-12-07"}], "hearty cobb salad": [], "fried chicken poboy": [{"excerpts": ["I like the fried chicken poboy, though the chicken in a box is good too. ", "Treat yourself to a mexican coke too. ", "I like to get one anytime "], "author": "L C.", "review": "Cash only -- which kind of sucks 'cause it's kind of pricey. Though, somewhat worth it every once in awhile if you can afford the calories. ;)\n\nThis place is great and I prefer this over sitting down at Farmer Brown's (due to slow seating if you don't have a reservation). \n\nWith Little Skillet you order at the window, find a spot on the sidewalk or platform to sit and wait (sometimes awhile) until they call your order. Grab a coffee next door and enjoy where you're at. In a SF alley. Which is a cool and unique experience on it's own.\n\nI like the fried chicken poboy, though the chicken in a box is good too. Treat yourself to a mexican coke too. I like to get one anytime I see them. \n\nThis is the \"fast food\" version of Farmerbrown's but upholds it's quality food.", "rating": 4, "date": "2012-01-08"}], "shrimp poboy": [{"excerpts": ["The  Shrimp PoBoy and seafood gumbo hit the spot. ", "Well done Little Skillet."], "author": "Justin D.", "review": "As someone from Southeast Texas that travels frequently I'm always looking for taste of home. The  Shrimp PoBoy and seafood gumbo hit the spot. Well done Little Skillet.", "rating": 4, "date": "2017-02-11"}, {"excerpts": ["So maybe next time I try the shrimp poboy or the burger or the cobb salad, which were my other inklings today that inevitably lost out to the thoughts of chicken and waffle bliss.  ", "And maybe I'll be blown away ", "and maybe I won't.  ", "But I think the point is, there will be a next time."], "author": "Lance H.", "review": "I've never had chicken and waffles before.  I mean, I've had chicken before. Lots of times.  I've probably eaten more chicken than... well, someone else who also eats a lot of chicken but not quite as much as me.  And I've also had waffles.  Great waffles.  Waffles you'd write stories about, how they're made by unicorns in some fantasy rainbow city and sprinkled with little wisps of cloud dust.  But I've never had them together is my point. And the whole concept was very intriguing to me.\n\nSo today, mere moments ago, I ventured out into this personally unexplored culinary realm seeking excitement and previously undiscovered bliss. My journey fell short of those expectations, though it was not a complete disappointment by any means.\n\nQuite literally a hole-in-the-wall establishment, the Little Skillet offers no seating, save for the raised loading dock of the business across the street (lucky them). Many reviews have said that they accept cash only, though I paid today with my credit card with no issue at all. The service was prompt and friendly and the young lady at the register did a great job of balancing customers ordering and picking up food.\n\nThe Little Skillet did indeed deliver what it promised: chicken and waffles.  It was simply displayed on the menu as such and, wouldn't you know, that's what ended up in my same-as-every-other-restaurant-in-SoMa to go container. The fried chicken was brown and crispy on the outside and moist and tender on the inside, just a hair this side of perfect.  The waffles were... well, relatively unexciting.  They weren't particularly sweet and they were decidedly colder than the chicken.  The tops were crunchy and the bottoms were soft.  The syrup was perhaps the least satisfying of the whole package; It seemed to be more tart than sweet.  \n\nAs I mentioned before, I'm new to this, so consider the source here.  And maybe I have this wrong.  But in my perception of this culinary combination, I assumed that the enticement here was the contrast of flavors, the savory and the sweet.  For me, that didn't really happen.  Let me be clear, I was not displeased with the meal as a whole.  The food was good.  The chicken was REALLY good, and I'm not a huge fan of straight-up fried chicken per se.  But after all I've heard, with the hype of the chicken & waffle experience, this sadly did not live up to it.\n\nSo maybe next time I try the shrimp poboy or the burger or the cobb salad, which were my other inklings today that inevitably lost out to the thoughts of chicken and waffle bliss.  And maybe I'll be blown away and maybe I won't.  But I think the point is, there will be a next time.", "rating": 4, "date": "2013-02-21"}, {"excerpts": ["I shared a 2piece chicken and waffle and a shrimp poboy with the bf. ", "Since today is a Monday, they give out free lemonade or ice tea (but we only got it after asking the girl for it). "], "author": "Whitney W.", "review": "I have been here a few times and every time I had delicious chicken and waffle, there is usually a line around noon time but the wait isn't too bad. Today, I went there around 11, and there was no line. I shared a 2piece chicken and waffle and a shrimp poboy with the bf. Since today is a Monday, they give out free lemonade or ice tea (but we only got it after asking the girl for it). We got the lemonade (so good!).\n\nWaffles-The waffles today were cold...not freshly made like the previous times I've been there. The waffles are usually warm and fluffy and goes perfectly with the syrup, but not today. Based on today's experience I would probably give it a 3 star (just b/c of the waffle), but overall I think it still deserves a 4-5 star. \n\nChicken- So good!! Probably the best fried chicken I've had. Goes really well with the hot sauce and waffles. The right amount of flavoring and also very crispy, warm, and tender. The only thing that is puzzling to me is the portion. Last time I ordered a 2 piece chicken and waffle I actually got 2 prices of wings and one huge piece of breast. This time I ordered the same thing but I only got breast and a small drum stick. Not too sure about how consistent the portions are...but the quality is good regardless of the portion.\n\nShrimp poboy- Surprisingly yummy. I wasn't expecting much since I usually come here for chicken and waffles, but it is good! The portion is generous and the shrimp is very juicy, plump, and well flavored. The amount of shrimp is proportioned well with the baguette. The poboy also comes with seasoned chips (tasty, but a little on the salty side). This is $12.\n\nLemonade- really good lemonade, does not taste artificial like the ones you make with powder. It has lemon pulp in it(or taste like it) and has other fruity taste to it ( can't quite figure out what it was... Pear?strawberry? O well... It's delicious). Usually cost $3 but probably worth it. \n\nI've tried many chicken and waffle places but this is yet my favorite chicken and waffle spot!\n\nNote: Monday you get free lemonade or ice tea, Tuesday you get a free mini cupcake, and Wednesday you get free chips with purchase.", "rating": 4, "date": "2011-12-19"}, {"excerpts": ["I had the shrimp poboy ", "and it was just ok.  ", "I hated how the shrimp wasn't fried.  "], "author": "Jenny W.", "review": "Took a pit stop here en route to Treasure Island Music Fest w/ Phil H for some delicious grub we could bring with us.  \n\nI like the location, how you order up the counter, and for the most part, the menu.  They have fried chicken, waffles, chicken boxes, salads (blah), a bacon wrapped waffledog, po boys and sandos, and some delicious looking sides (potato salad, macaroni salad, coleslaw, fries, etc), and grits.  Little Skillet is apparently famous for their chicken and waffles, but sadly, I wasn't craving that yesterday.\n\nI had the shrimp poboy and it was just ok.  I hated how the shrimp wasn't fried.  The bread was super delicious and all the sauteed veggies, but the sauce was just alright and the shrimp were small and again, not fried. \n\nHowever, I will come back for the frieeeed chicken.", "rating": 3, "date": "2009-10-18"}], "skillet burger and blackened fries": [], "piece fried chicken and waffle": [{"excerpts": ["I ordered the two piece fried chicken and waffle with a side of fruit salad and a Bloody Mary. ", "THE FOOD WAS ON POINT. ", "Waffles were delicious, came topped with powdered sugar and a side of syrup. ", "Fried chicken was tender and juicy and ugh so amazing. ", "One of the best chicken and waffles places I've ever been for sure. ", "The fruit salad was a mix of watermelon and oranges mostly but nice and fresh. ", "Food was about $17 total. ", "The Bloody Mary was very savory. ", "A little on the saltier side ", "but I dig it. ", "There's a lot of vodka in this babe. ", "$9 for some tomato-y alcoholic goodness. ", "Overall the combination of the food and atmosphere made the experience that much better. ", "THIS PLACE IS GREAT."], "author": "Amy T.", "review": "This place is a gem. It's straight up in an alleyway in SOMA. The interior is so freaking cute. Very hipster. Lots of tables and two separate bars. Order (food and non alcoholic beverages only) in the front and sit wherever, they'll bring you your food when it's ready. Fun fact: apparently this place was on food network last month LOL. \n\nI ordered the two piece fried chicken and waffle with a side of fruit salad and a Bloody Mary. THE FOOD WAS ON POINT. Waffles were delicious, came topped with powdered sugar and a side of syrup. Fried chicken was tender and juicy and ugh so amazing. One of the best chicken and waffles places I've ever been for sure. The fruit salad was a mix of watermelon and oranges mostly but nice and fresh. Food was about $17 total. The Bloody Mary was very savory. A little on the saltier side but I dig it. There's a lot of vodka in this babe. $9 for some tomato-y alcoholic goodness. Overall the combination of the food and atmosphere made the experience that much better. THIS PLACE IS GREAT.", "rating": 4, "date": "2015-07-19"}, {"excerpts": ["We each got the 2 piece fried chicken and waffle meal and it was delicious! ", "The chicken batter was crunchy, salty and tasty and the meat was super juicy and moist. "], "author": "Sarah A.", "review": "Yummmm! Me and the fellow foodie co-worker are now attempting to do the 7X& 100 Things to Eat list. So our lunch stop today was at Littleskillet (disclaimer: I wanted to eat here BEFORE the list came out since it is near work anyways).\n\nWe each got the 2 piece fried chicken and waffle meal and it was delicious! The chicken batter was crunchy, salty and tasty and the meat was super juicy and moist. It was everything I hoped it would be, added a little tapatio, crystal sauce and some sweet chili sauce which made the experience all the better. \n\nThe waffle was nice and fluffy and was a tasty treat after I finished my chicken. I am stoked we finally tried this place and will definitely be back (they were out of red velvet cupcakes and the cashier kindly made up for it by treating me to a Mexican coke). So i will be back for chicken, waffles, Mexi coke and a cupcake.", "rating": 5, "date": "2010-02-22"}], "mini chicken and waffle basket": [{"excerpts": ["Food:\n- Mini chicken and waffle basket (small, $10): ", "We had to try the chicken and waffles of course, but honestly, I wasn't that impressed. ", "The chicken was very crispy and fried very well, but I felt like it was lacking in flavor. ", "I was a little disappointed. ", "The waffles were quite good and the syrup was more on the thin side, which I liked. "], "author": "Lillian Z.", "review": "Hmmm. I love fried chicken, but I was a little disappointed with Little Skillet, to be honest. \n\nLocation: The main entrance for Little Skillet is somewhat hidden in an alley way, but inside the building, it's actually quite spacious. The decor has a very rustic feel to it. Lots of wood and mismatched tables, but still very cute. There's definitely more large tables here (think picnic table type), rather than smaller tables, so if you're coming with a smaller party (e.g. 2-3), be prepared to sit at a larger table that you may end up sharing with others if they get busy.\n\nFood:\n- Mini chicken and waffle basket (small, $10): We had to try the chicken and waffles of course, but honestly, I wasn't that impressed. The chicken was very crispy and fried very well, but I felt like it was lacking in flavor. I was a little disappointed. The waffles were quite good and the syrup was more on the thin side, which I liked. But even in terms of the chicken and waffles combo, I've had better. \n\n- Skillet hot wings (small, $9): We ordered these in the buffalo flavor, which was quite good. I feel like we paid too much for the portion size that we were given though...\n\n- Cajun seasoned fries (small, $5): We asked the guy at the counter whether he recommended the cajun fries or the smothered fries, and he responded as if we had asked the most inane, obvious question ever: cajun seasoned fries. So on his \"enthusiastic\" recommendation, we ordered the cajun fries. The verdict? Meh. I love fries, and I thought these were only alright. They didn't taste particularly seasoned to me, but that seemed to be the general theme for food here.\n\n- Side of collard greens: Pretty standard side of collard greens in my opinion. Probably one of the more flavorful parts of the meal.\n\nService:\nAs you can probably tell from my description above, I was not wow-ed by the service here. You order food at a counter on the side of the bar, which would have been fine if it wasn't for the fact that the guy working that counter was so unpleasant. He never smiled at us, which also could have been forgivable if he had at least attempted to be nice. But alas... he treated us like we were the stupidest people to ever set foot in Little Skillet. When we asked for recommendations, he treated our questions like they had obvious answers that we were just too stupid to see. After we finished ordering our food, we asked whether or not we could also order drinks at the counter or if we had to go to the bar. He started repeating \"at the bar\" over and over as if were so dumb that he was worried we wouldn't understand him. Not a great way to make your patrons feel, dude.\n\ntl;dr: Little Skillet was ok food wise, but I do think that our not so pleasant encounter with the guy taking our order left a sour taste in my mouth. Bleh.", "rating": 3, "date": "2017-05-13"}, {"excerpts": ["I definitely would order whole pieces instead of the wings next time (wings are served in the mini chicken and waffle basket), but overall, delicious.  ", "What I found to be lacking were the waffles. ", "Mine were a bit flat and crispy and I would have preferred fluffier ones. ", "The syrup was quite disappointing though as there's a strong alcohol flavor to it (bourbon?) "], "author": "Maria F.", "review": "Came on a Saturday around 4pm, there was no wait and it only took about 10 minutes to receive our meals. Not bad at all. Highly suggest coming around this time. \n\nThe chicken was good; crispy on the outside, juicy on the inside. I definitely would order whole pieces instead of the wings next time (wings are served in the mini chicken and waffle basket), but overall, delicious.  What I found to be lacking were the waffles. Mine were a bit flat and crispy and I would have preferred fluffier ones. The syrup was quite disappointing though as there's a strong alcohol flavor to it (bourbon?) and I just wasn't a fan.  \n\nSurprisingly, my favorite dish was the mac and cheese. It had a hint of nutmeg, which was unexpected. So delicious and filling. I think next time I'd skip the waffles and make a meal out of just the chicken and sides.", "rating": 3, "date": "2015-07-20"}], "bbq ribs": [{"excerpts": ["Large seasoned fries - cold and stale\nLarge bbq ribs (8 pcs) with side of mac and cheese - false advertistment....does not fall off the bones and it taste like sauce was just brush on the outside , meat pretty tuff not soft at all\n8 pcs chicken & waffle - chicken are juicy but breading was tacky and tuff\nSeafood gumbo - big kick and by far the best out of all was ordered"], "author": "Linh D.", "review": "Maybe the experience would of been better if it wasnt sold through a window during a private event held...\n\nOrdered the following....\nLarge seasoned fries - cold and stale\nLarge bbq ribs (8 pcs) with side of mac and cheese - false advertistment....does not fall off the bones and it taste like sauce was just brush on the outside , meat pretty tuff not soft at all\n8 pcs chicken & waffle - chicken are juicy but breading was tacky and tuff\nSeafood gumbo - big kick and by far the best out of all was ordered", "rating": 2, "date": "2015-12-12"}], "blackened gulf shrimp and grits": [], "pulled pork sliders": [{"excerpts": ["We got the BBQ pulled pork sliders. ", "The biscuits were actually delicious, moist& flaky.. ", "the pork was dry & didn't have much sauce. \n", "The turkey chili was flavorful, topped with sharp cheddar cheese.. \nprobably will not order from this place again, just because of the lack of and rude service we experienced."], "author": "Maria C.", "review": "HORRIBLE customer service. \nOrdered through Yelp 24, and had a missing order..\nCalled the restaurant, and the host literally denied that my fried chicken was missing.. what type of customer service is that? \nShe offered no solution because the restaurant was already closed by the time we got our food. \nThe distasteful cust service unfortunately made us not enjoy our food. \nWe got the BBQ pulled pork sliders. The biscuits were actually delicious, moist& flaky.. the pork was dry & didn't have much sauce. \nThe turkey chili was flavorful, topped with sharp cheddar cheese.. \nprobably will not order from this place again, just because of the lack of and rude service we experienced.", "rating": 1, "date": "2017-07-03"}, {"excerpts": ["We also ordered the pulled pork sliders which was AMAZING. \n\n"], "author": "Tammy K.", "review": "1 star: the location is perfect. It's not too busy outside and it's super easy to find. Inside, there were two different sections which made it seem open and not too crowded. The noise level was typical and didn't bother me. \n\n1 star: a lot of places to eat. We went in while it was a little busy. A group started to leave and the table was cleaned and ready to go super fast. The way everything works is so smooth. The food wait time was not that bad. \n\n1 star: drinks were good but the bartender sucked. It seemed like he didn't really want to help us. I understand that it can get busy and I'm a pretty patient person. But if you're gonna take my order and then go talk to someone and be on your phone for a hot ass minute and then come back to me to ask me what my order was, I'm gonna get upset because homie, I've been here for 15 minutes. It's not like there were other customers waiting for drinks . \n\n1 star: the food was AMAZING. loved the chicken and waffles. Apparently it's their signature dish. You can also order a large platter to share. It was filling for sure. We also ordered the pulled pork sliders which was AMAZING. \n\nI'm excited to go back to try more delicious food. I'll just steer clear of that particular bartender. I wish I got his name but whatever. Maybe he was having a bad night. Idk. \n\n4 stars total. Definitely a great place to go and hang out with friends and eat great food! Would've been 5 if the bartender was cool.", "rating": 4, "date": "2017-08-25"}, {"excerpts": ["My friends also ordered the gumbo, chicken po' boy, pulled pork sliders, and some more chicken and waffles. ", "One of my friends thought his gumbo was good, while two thought their chicken po' boy and pulled pork sliders were okay. ", "Everyone else that ordered chicken and waffles thoroughly enjoyed their food. ", "So the consensus is, go for the chicken and waffles. ", "Eat everything else at your own risk."], "author": "Anny T.", "review": "Ever since I moved to California, the one thing I miss is southern comfort food. While chicken and waffles isn't entirely southern, I do enjoy some dang good finger-lickin' fried chicken and that's definitely southern. I enjoy waffles as well. (Yes, I do eat them separately.) \n\nFor about $12, you can get an order of 2 pieces of chicken that comes with one side. I opted for waffles as my side. Waffles were light and fluffy with a hint of banana flavor. It was topped with powdered sugar and a small cup of syrup. The 2 pieces of chicken were one leg and one breast. They were full of flavor, especially the skin. I was impressed that the chicken breast was really juicy. \n\nMy friends also ordered the gumbo, chicken po' boy, pulled pork sliders, and some more chicken and waffles. One of my friends thought his gumbo was good, while two thought their chicken po' boy and pulled pork sliders were okay. Everyone else that ordered chicken and waffles thoroughly enjoyed their food. So the consensus is, go for the chicken and waffles. Eat everything else at your own risk.", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["The pulled pork sliders with cole slaw were just meh. ", "The sliders tasted like cha siu bao. "], "author": "Christine S.", "review": "Chicken and waffle: the famous soul food pairing of fried chicken and waffles (with syrup). I've read that the tradition comes from the south where people didn't eat chicken often and ate more pancakes than waffles. So pairing these two things together became somewhat of a delicacy. \n\nI've had Roscoe's House of Chicken and Waffles quite a few times in Southern California and thought it was mediocre at best. The chicken and waffles here at Farmerbrown's Little Skillet, however, is totally fantastic! It's no wonder people claim this restaurant to have the best chicken and waffles in SF.\n\nFor $11, you get two pieces of perfectly fried chicken (one dark meat and one white meat) and two squares of waffles. Perfection!\n\nI'd skip any of the other food items though. The pulled pork sliders with cole slaw were just meh. The sliders tasted like cha siu bao. The mac n cheese looked drool-worthy, but it tasted just a little better than Kraft's mac n cheese that you can make at home.\n\nTLDR: come here for their famous chicken and waffles... and nothing else!", "rating": 4, "date": "2015-03-01"}, {"excerpts": ["Pulled Pork Sliders ", "- These are arguably better than the fried chicken, not even joking\nSkillet Pancake - if you like sweet and pancakey for breakfast, this is your thing. ", "This is not for me, but my husband loved it. "], "author": "Miriam W.", "review": "I'm really kind of sorry I'm within walking distance of this place for brunch. I'm going to die of a heart attack. \n\nFried Chicken - Amazing, well fried, great flavor. Also they have this amazing blackstrap molasses syrup that's got a rich depth of flavor. Waffles are good, but the chicken is the star here.\nPulled Pork Sliders - These are arguably better than the fried chicken, not even joking\nSkillet Pancake - if you like sweet and pancakey for breakfast, this is your thing. This is not for me, but my husband loved it. I would much rather have traded it for his\nBiscuits and Gravy - which had awesome flavor to it (we tried the sausage gravy). A+++. \n\nAs a added caloric bonus, they have angel biscuits by the counter that are topped with black pepper and brown sugar. These things are like crack.", "rating": 4, "date": "2015-03-15"}], "handcut kennebec seasoned fries": [], "skillet hot wings": [{"excerpts": ["- Skillet hot wings (small, $9)", ": We ordered these in the buffalo flavor, which was quite good. "], "author": "Lillian Z.", "review": "Hmmm. I love fried chicken, but I was a little disappointed with Little Skillet, to be honest. \n\nLocation: The main entrance for Little Skillet is somewhat hidden in an alley way, but inside the building, it's actually quite spacious. The decor has a very rustic feel to it. Lots of wood and mismatched tables, but still very cute. There's definitely more large tables here (think picnic table type), rather than smaller tables, so if you're coming with a smaller party (e.g. 2-3), be prepared to sit at a larger table that you may end up sharing with others if they get busy.\n\nFood:\n- Mini chicken and waffle basket (small, $10): We had to try the chicken and waffles of course, but honestly, I wasn't that impressed. The chicken was very crispy and fried very well, but I felt like it was lacking in flavor. I was a little disappointed. The waffles were quite good and the syrup was more on the thin side, which I liked. But even in terms of the chicken and waffles combo, I've had better. \n\n- Skillet hot wings (small, $9): We ordered these in the buffalo flavor, which was quite good. I feel like we paid too much for the portion size that we were given though...\n\n- Cajun seasoned fries (small, $5): We asked the guy at the counter whether he recommended the cajun fries or the smothered fries, and he responded as if we had asked the most inane, obvious question ever: cajun seasoned fries. So on his \"enthusiastic\" recommendation, we ordered the cajun fries. The verdict? Meh. I love fries, and I thought these were only alright. They didn't taste particularly seasoned to me, but that seemed to be the general theme for food here.\n\n- Side of collard greens: Pretty standard side of collard greens in my opinion. Probably one of the more flavorful parts of the meal.\n\nService:\nAs you can probably tell from my description above, I was not wow-ed by the service here. You order food at a counter on the side of the bar, which would have been fine if it wasn't for the fact that the guy working that counter was so unpleasant. He never smiled at us, which also could have been forgivable if he had at least attempted to be nice. But alas... he treated us like we were the stupidest people to ever set foot in Little Skillet. When we asked for recommendations, he treated our questions like they had obvious answers that we were just too stupid to see. After we finished ordering our food, we asked whether or not we could also order drinks at the counter or if we had to go to the bar. He started repeating \"at the bar\" over and over as if were so dumb that he was worried we wouldn't understand him. Not a great way to make your patrons feel, dude.\n\ntl;dr: Little Skillet was ok food wise, but I do think that our not so pleasant encounter with the guy taking our order left a sour taste in my mouth. Bleh.", "rating": 3, "date": "2017-05-13"}, {"excerpts": ["For our party of 6 (4 adults + 2 kids), we ordered the smothered fries (fries covered sausage gravy, topped with cheddar, sour cream and green onions), crispy fried chicken with waffles, and skillet hot wings with BBQ sauce. ", "The pieces of chicken were HUGE - probably almost double the size of the ones you would find at KFC. ", "They were perfectly fried and didn't seem too greasy. ", "Then again, I only ate one piece ", "so I didn't feel too disgusting afterwards. "], "author": "Mel T.", "review": "Apparently, Little Skillet goes by a lot of different names. You'll see Little Skillet, Farmer Brown's, Brown's Little Skillet, or really just any combination of those. Just know that it's located on 360 Ritch St., inside of Victory Hall bar. You order at the counter, grab a table, and pick up your food once it's ready.\n\nFor a Saturday from 6-7, the place wasn't crowded. Lines start forming at around 8. For our party of 6 (4 adults + 2 kids), we ordered the smothered fries (fries covered sausage gravy, topped with cheddar, sour cream and green onions), crispy fried chicken with waffles, and skillet hot wings with BBQ sauce. The pieces of chicken were HUGE - probably almost double the size of the ones you would find at KFC. They were perfectly fried and didn't seem too greasy. Then again, I only ate one piece so I didn't feel too disgusting afterwards. The wings were also pretty good, but just to warn you - their BBQ sauce is actually pretty spicy.\n\nI don't think this is the best fried chicken I've had but it's definitely worth a try if you're in the area.", "rating": 3, "date": "2017-03-02"}, {"excerpts": ["Their chicken and waffles is great and their skillet hot wings aren't bad.  ", "My only complaints are their sides are a little pricy for the size (the mac and cheese is tiny, and just kind of meh) and about 50% of the time when I specify dark meat only they still give me white meat.  ", "The last time though, I complained to Eat 24 and they sent me a new order."], "author": "T.J. H.", "review": "I get delivery from Little Skillet once in a while and am a big fan.  Their chicken and waffles is great and their skillet hot wings aren't bad.  My only complaints are their sides are a little pricy for the size (the mac and cheese is tiny, and just kind of meh) and about 50% of the time when I specify dark meat only they still give me white meat.  The last time though, I complained to Eat 24 and they sent me a new order.", "rating": 4, "date": "2017-09-06"}], "jalapeno coleslaw": [{"excerpts": ["We got chicken and waffles, angel biscuits, mac & cheese, and jalapeno coleslaw. ", "The food came out quick, but was pretty cold. ", "I was pretty disappointed by the dry biscuits and the dry chicken (though the fried skin was tasty). ", "The mac & cheese was also gritty and not that flavorful. ", "It's a cute little spot, part of a great bar (Victory Hall), but I wouldn't necessarily come back for the food."], "author": "Mariecar M.", "review": "Arrived around noon on NYE. We got chicken and waffles, angel biscuits, mac & cheese, and jalapeno coleslaw. The food came out quick, but was pretty cold. I was pretty disappointed by the dry biscuits and the dry chicken (though the fried skin was tasty). The mac & cheese was also gritty and not that flavorful. It's a cute little spot, part of a great bar (Victory Hall), but I wouldn't necessarily come back for the food.", "rating": 3, "date": "2017-12-31"}, {"excerpts": ["Mac and Cheese was ok, and the jalapeno coleslaw needed more jalapeno, in my opinion.  ", "But you can always add hot sauce, so ", "no worries. "], "author": "Aneesh B.", "review": "Damn good chicken.  If you haven't had it yet, you're missing out.\n\nFood:\nMy one-line assessment above pretty much says it all.  Best fried chicken I have had in a long time.  My previous fave fried chicken was at Wayfare Tavern, but Little Skillet has supplanted TyFlo's recipe.  It's.  Just.  Magic.  A friend and I took down an 8-piece order without prejudice. Crispy, meaty, and delicious.  Not greasy and not heavy.\nSides are tasty, too.  Don't skip the collard greens.  Mac and Cheese was ok, and the jalapeno coleslaw needed more jalapeno, in my opinion.  But you can always add hot sauce, so no worries. Full marks awarded.\n\nService:\nCounter service inside Victory Hall and Parlor is great.  No fuss and food came out pretty quickly.\n\nVibe:\nSpeakeasy-chic.  I love Victory Hall for its mellow vibe and great bartenders.  Having kick-ass fried chicken added to the mix just makes sense.\n\nFamily-friendly:\nIf your kids like the stuff that comes in a red-and-white bucket, then they will LOVE this.  Teach the young'uns what real fried chicken tastes like.\n\nSummary:\nYou need some of this fantastic stuff. Go get yourself a cocktail and some chicken.  You deserve it.", "rating": 5, "date": "2016-01-07"}, {"excerpts": ["Food:\n- Jalapeno Coleslaw: 1 jalapeno. ", "Lots of disappointment. ", "There was nothing special about this side, and since I expected some spice, it was an even bigger letdown when I tasted nothing but the dressing. "], "author": "Kat P.", "review": "Little Skillet didn't live up the hype, or maybe I'm not the biggest fan of chicken and waffles.\n\nService and Space:\nSmall, cramped, and slow. Even though the workers were friendly when taking your order, it felt at times that the kitchen had forgotten some people's orders. Even at the back end of the lunch hour, there were still a handful of customers who had been standing around waiting for their food to arrive for what seemed like way too long.\n\nThat being said, the decor is pleasant (succulents galore!) and you can head to the bar next door to sit down and eat your food afterwards.\n\nFood:\n- Jalapeno Coleslaw: 1 jalapeno. Lots of disappointment. There was nothing special about this side, and since I expected some spice, it was an even bigger letdown when I tasted nothing but the dressing. Luckily, there's a substantial amount of slaw.\n\n- 2 pieces of chicken + waffles: The chicken was moist, but also way too oily for my taste. The waffles were sweet, but by the time I got mine it was already soggy and not at all crisp like I expected it to be.\n\nThe hot sauce and relish saved the day, and if you head to the sit-down restaurant you can grab some dijon mustard to put on your chicken. Tip? Skip the plastic stuff, and grab some of the metal utensils inside. Your life will be a lot easier.\n\nNext time, I'm going to go for the po boy and skip the overrated chicken and waffles.", "rating": 3, "date": "2015-08-06"}, {"excerpts": ["The jalapeno coleslaw was pretty good.  ", "It's not spicy at all.  ", "The potato chips were pretty good too, pretty crispy, right amount of salt, and portion.  "], "author": "Kevin N.", "review": "I've heard a lot about this place!  It's very popular, so we decided to go try this out.  Just briefly glancing through the pictures, I didn't know this place was a bar - thought it was a restaurant.  We were surprised, but went ahead and ordered our food to go.  I had the fried chicken po'boy sandwich.  It's like a fried chicken banh mi sandwich.  It was OK, the chicken kind of dry and not one of the crispier sandwiches I've had.  The jalapeno coleslaw was pretty good.  It's not spicy at all.  The potato chips were pretty good too, pretty crispy, right amount of salt, and portion.  The chicken was just OK, I've had much better elsewhere.\n\nMy girlfriend had the 2 piece and 1 side.  She choose the mac n' cheese which was alright.  They give you a lot too.  It's very creamy but light on the cheese flavor.  The flavor in general is just not very strong.  The chicken was not dry but not too moist, kind of between.  The batter is very thin which makes the chicken not very crispy.  I believe a corn muffin is suppose to come with this meal, but they forgot it.  Don't quote me on this, since we took it to go, we couldn't go back and check, but I remember reading on the menu that a corn muffin comes with it.\n\nAnyway the food was kind of disappointing when looking at the many raving reviews.  I have to say they have good service though, very nice, and the cashier was good!", "rating": 2, "date": "2016-02-08"}], "organic cheddar grits": [], "mashed sweet potatoes": [{"excerpts": ["Ordered the chicken & waffles, angel biscuits with gravy and sides of mashed sweet potatoes and mac & cheese. ", "I should have only ordered the chicken & waffles ", "but i found parts of the chicken dry. ", "The famous biscuits were also hard and dry even covered with gravy. ", "And the sides mediocre. ", "They were bland and under seasoned. ", "If they had more loving they would be delicious. ", "But the atmosphere of the restaurant was hip, and very nice. ", "The only plus for the day."], "author": "Keira R.", "review": "Went to Little Skillet in hopes of a good brunch, and i left disappointed. Ordered the chicken & waffles, angel biscuits with gravy and sides of mashed sweet potatoes and mac & cheese. I should have only ordered the chicken & waffles but i found parts of the chicken dry. The famous biscuits were also hard and dry even covered with gravy. And the sides mediocre. They were bland and under seasoned. If they had more loving they would be delicious. But the atmosphere of the restaurant was hip, and very nice. The only plus for the day.", "rating": 2, "date": "2018-04-16"}, {"excerpts": ["The mashed sweet potatoes are pretty good if you add salt and butter.\n ", "Side orders are too pricey if you order anything in addition to the tiny \"choice\" that comes with some of the main orders.                \n   ", "Haven't  tried the rest of the menu , so I can't fully rate this place ", "but I bet it's pretty good. ", "THEY ARE  DOING SOMETHING RIGHT; FRIED CHICKEN, and that's a tall order these days!  ", "( for $1.00 extra you can get all white meat and that's a great policy! )", "Fry ON ;Little Skillet, Fry ON!"], "author": "Phoebe C.", "review": "I've been looking for decent fried chicken in SF for years in this town,( ever since Grisons closed many moons ago), and this isn't THAT, but it's definitely THE BEST FRIED CHICKEN, ANYWHERE YET! \n   It's cooked thoroughly, evenly battered but not \" battery\",  Just a great, even, crispy coating...mildly but well seasoned, and the meat is tasty and not oily!  It's better cold the next day, IMO, and the packaging on \"To Go\" orders is brilliant, allowing the chicken to stay crispy and good! ( I WISH SOME PLACE IN SF WOULD BUY A BROASTER AND SERVE REAL BROASTED CHICKEN...hint: ( Little Skillet might be the perfect place! )...\n   I'd also  like to see more choices in the sides, and wish they would learn how to make a good baking soda biscuit! Forget the \" angel biscuits\" if you want anything traditional. They are flat, small and overpriced. The mashed sweet potatoes are pretty good if you add salt and butter.\n Side orders are too pricey if you order anything in addition to the tiny \"choice\" that comes with some of the main orders.                \n   Haven't  tried the rest of the menu , so I can't fully rate this place but I bet it's pretty good. THEY ARE  DOING SOMETHING RIGHT; FRIED CHICKEN, and that's a tall order these days!  ( for $1.00 extra you can get all white meat and that's a great policy! )Fry ON ;Little Skillet, Fry ON!", "rating": 4, "date": "2018-07-15"}, {"excerpts": ["I love this place because their freaking mashed sweet potatoes are the BOMB! ", "It's so creamy and good"], "author": "Maggie L.", "review": "I love this place because their freaking mashed sweet potatoes are the BOMB! It's so creamy and good, I honestly prefer it over the fried chicken. \n\nNot that the chicken is bad, but they definitely have good or bad days. Sometimes it would be slightly overcooked and other times it would be cooked perfectly. \n\nSTILL, this place is one of the best fried chicken places in the Bay Area. It's very popular and gets pretty crowded, so I recommend getting here early or during off peak times.", "rating": 4, "date": "2016-12-27"}, {"excerpts": ["I got the two piece chicken with mashed sweet potatoes for $11. ", "This was a lot of food. ", "Enough for two meals. ", "And the chicken? ", "Delicious. ", "Cooked perfectly. ", "Moist on the inside, crispy on the outside. ", "Not too greasy  (but a little bit, hence the one start deduction) ", "Spiced perfectly. ", "Definitely worth the calories. ", "And the mashed sweet potatoes? ", "Heaven. "], "author": "Shoole S.", "review": "I love fried chicken. I rarely eat it anymore, so when I do get it, it's kinda a big deal, a special treat. The fact that it's a special treat makes bad fried chicken especially disappointing. I was not disappointed here. \n\nLittle Skillet is inside a bar, tucked away in a corner. I ordered at the front desk and give minutes later my food was ready. I got the two piece chicken with mashed sweet potatoes for $11. This was a lot of food. Enough for two meals. And the chicken? Delicious. Cooked perfectly. Moist on the inside, crispy on the outside. Not too greasy  (but a little bit, hence the one start deduction) Spiced perfectly. Definitely worth the calories. And the mashed sweet potatoes? Heaven. I was super full but still had to force myself to stop eating.\n\nMy recommendation: Go here. Get the chicken.  It's totally worth the calories, after all, sometimes You have to treat yourself. You can thank me later.", "rating": 4, "date": "2017-05-12"}, {"excerpts": ["fried chicken isn't bad, cornbread is tiny, biscuits ok, mashed sweet potatoes ok, waffles odd flavor and not cooked through.\n\n"], "author": "Lizzy C.", "review": "If you're from the southeast this food wont compare to grandmas cookin but its not bad. Its...okay\n\nIve eaten food from here twice first delivery which the service is standard. second i picked it up because its quicker. The place is a bar with a little restaurant and karaoke. interesting set up kinda feels like I'm in a barn with all the open space\n\nThe food isn't bad but the flavors are unfamiliar.  I don't expect to find real southern soul food all the way over here on the west coast. but they claim its soul food smh. fried chicken isn't bad, cornbread is tiny, biscuits ok, mashed sweet potatoes ok, waffles odd flavor and not cooked through.\n\nOverall this place is just okay and you only get enough food for one meal but for the price for one person you'd expect a lil left over. \n\nJust okay", "rating": 3, "date": "2017-10-16"}, {"excerpts": ["And for a side, I got their mashed sweet potatoes which was definitely sweet, but I wasn't too crazy about. ", "Still decent, though. "], "author": "Venus L.", "review": "CHICKEN AND WAFFLES. NOM. NOM.\n\nMy boyfriend and I randomly came here one night while out in SF. We weren't sure what to eat so I just yelped \"food\" and looked at whatever came up. 4 stars for Little Skillet? Sounds good to me! And their location is so close to caltrain that it's perfect for lazy people to get a meal and go! \n\nComing in, Little Skillet is connected to a bar now I guess and there's someone outside who checks your ID to insure you're of age. Little Skillet is towards the back, you can't really miss it. Their menu is small so ordering doesn't really take long. \n\nService was nice and quick. You order and pay, the worker gives you a number to take to a table, you sit and wait, get your food and utensils, and boom. Time to eat\n\nI got their 2 piece side with chicken and I was surprised it came with waffles because it didn't say so on the menu, but boy am I happy it did. The waffles are delicious and their maple syrup is actually, like, fresh maple syrup. None of that Mrs. Butterworth stuff, no sirree.  And the chicken was amazing. So much flavor. Argh. I wasn't crazy about their corn bread muffin because it had a bit of a jalapeno flavor mixed in there. And for a side, I got their mashed sweet potatoes which was definitely sweet, but I wasn't too crazy about. Still decent, though. Don't get me wrong! \n\nOverall, definitely going to come back. Their chicken and waffles were the best I've had so far. :)", "rating": 4, "date": "2014-07-14"}, {"excerpts": ["But then my friend ordered the seasoned fries and the mashed sweet potatoes ", "The seasoned fries were good. ", "The cajun seasoning was flavorful but not overwhelming. ", "The jalapeno corn muffin is TINY. ", "But good. ", "My favorite side dish by far was the mashed sweet potatoes. ", "I want to come back just to order this for myself. ", "They taste like sweet potatoes which is great, and they also have a hint of mashed potato taste!! ", "IT ", "WAS DELICIOUS. "], "author": "Josephine L.", "review": "I ordered the 2 piece chicken box for $12.50. Comes with a jalapeño corn muffin and your choice of side. I had the hardest time choosing which side because everything looked so good!! I ended up ordering the biscuit side because I. Adore. Biscuits. And am compelled to order them if they are an option, everywhere I go. But then my friend ordered the seasoned fries and the mashed sweet potatoes so I got to try those too.\n\nThe biscuit was disappointing. It was hard, and not warm. It might have been one of the worst biscuits I've ever had. KFC biscuits are more tasty, and fluffier. However, the biscuit did come with some butter that was slightly sweet and hence unique so after I slathered a bunch of it on the biscuit, the taste greatly improved after that.\n\nThe fried chicken was good, but not amazing. I liked the drumstick piece so much more than the thigh piece. But it's small. Small drumstick! The seasoned fries were good. The cajun seasoning was flavorful but not overwhelming. The jalapeno corn muffin is TINY. But good. I think it would have been amazing if it came warmed.\n\nMy favorite side dish by far was the mashed sweet potatoes. I want to come back just to order this for myself. They taste like sweet potatoes which is great, and they also have a hint of mashed potato taste!! IT WAS DELICIOUS. 10/10 recommend!\n\nLove the decor in here! There are a bunch of different types of seating available, and you seat yourself after you place your order at the front. There is a parlor that doesn't seem like it's always open, but that area has two tables with high cushy seats for 2-4 people and then a long L couch (I wanted to sit here but it was occupied by a large group when we got there). The numbers they give you to put on your table so they can deliver your food to you aren't numbers. Each \"number\" is a different vegetable on a card! I thought that was neat. \n\nCame on a Wednesday night around 7:30 pm and was able to find a seat easily. It's a nice space! Great to meet up casually with friends. Also has a bar if you are partial to having a drink with dinner.", "rating": 4, "date": "2015-07-09"}, {"excerpts": ["Ordered a 2 piece with Mac and cheese with Mashed sweet potatoes. ", "chicken is really salty. ", "sweet potatoes are just that, not yams. ", "Mac and cheese is descent. ", "This was a different experience. ", "Maybe the waffles and chicken mix is better."], "author": "Helani H.", "review": "Ordered a 2 piece with Mac and cheese with Mashed sweet potatoes. chicken is really salty. sweet potatoes are just that, not yams. Mac and cheese is descent. This was a different experience. Maybe the waffles and chicken mix is better.", "rating": 2, "date": "2016-11-18"}, {"excerpts": ["I tried the mashed sweet potatoes, mac n cheese , and jalapeno cord bread muffins. ", "The atmosphere is great and lots of drinks to choose from. ", "I would go again, just for the beer and chicken. ", "Waitstaff was cool and the food came out fast. ", "It was a busy Thursday night ", "so I was impressed."], "author": "Stacey G.", "review": "I loved the chicken. Flavor was good. The sides ...not so good. No flavor at all. Very bland. I tried the mashed sweet potatoes, mac n cheese , and jalapeno cord bread muffins. The atmosphere is great and lots of drinks to choose from. I would go again, just for the beer and chicken. Waitstaff was cool and the food came out fast. It was a busy Thursday night so I was impressed.", "rating": 3, "date": "2017-05-31"}, {"excerpts": ["I had the fried chicken and waffle combo with mashed sweet potatoes. ", "Fried chicken was well seasoned, but I liked the waffles way more than the chicken. ", "The mashed sweet potatoes were interesting. "], "author": "Karen H.", "review": "It was okay... Good, but not exceptionally amazing. \n\nI had the fried chicken and waffle combo with mashed sweet potatoes. Fried chicken was well seasoned, but I liked the waffles way more than the chicken. The mashed sweet potatoes were interesting. They didn't taste bad, but they didn't taste great either.  \n\nShout out to the bartender though because my senorita was delicious.", "rating": 3, "date": "2014-08-07"}, {"excerpts": ["Ordered 3 pieces with mashed sweet potatoes. ", "2 stars automatic when you get 2 Thighs on an all dark order of 3...nice.\n", "The sweet potatoes are good, if just a bit on the bland side. ", "The chicken is the deal though right? ", "Nicely spiced, juicy and tender as expected with properly brined birds....", "but...the leg was hot while the thighs  were just warm. ", "Maybe a challenge at a slow time to fry chicken to order, but damn. ", "Excellent skin...", "I so wish I could have experienced it hot out of the grease. ", "I definitely would give it another go...but hate to think of the crowds at prime time."], "author": "Tim D.", "review": "2:00 on a Saturday aftrenoon, the spacious room was virtually empty, making for a very efficient lunch. Fun airy space with very pleasant staff. Ordered 3 pieces with mashed sweet potatoes. 2 stars automatic when you get 2 Thighs on an all dark order of 3...nice.\nThe sweet potatoes are good, if just a bit on the bland side. The chicken is the deal though right? Nicely spiced, juicy and tender as expected with properly brined birds....but...the leg was hot while the thighs  were just warm. Maybe a challenge at a slow time to fry chicken to order, but damn. Excellent skin...I so wish I could have experienced it hot out of the grease. I definitely would give it another go...but hate to think of the crowds at prime time.", "rating": 3, "date": "2014-06-28"}, {"excerpts": ["That said, the chicken is consistently delicious and I love the mac and cheese and mashed sweet potatoes. ", "The waffles don't always taste fresh but that doesn't stop me from eating them."], "author": "John H.", "review": "I like the food and hate the service. I don't think I've ever waited less than 20 minutes for my food, even during lunchtime on a weekday. That said, the chicken is consistently delicious and I love the mac and cheese and mashed sweet potatoes. The waffles don't always taste fresh but that doesn't stop me from eating them.", "rating": 3, "date": "2015-04-25"}], "seasoned fries": [{"excerpts": ["Had the waffles (they didn't have chicken and waffles on the to go menu!), angel biscuit, cheddar grits, and seasoned fries. \n\n", "Finally, seasoned fries. ", "The fries were alright, with mashy sort of centers and crispy outsides. ", "I think they used the red Cajun seasoning. ", "Standard. "], "author": "Nicole H.", "review": "Guess I've solidified myself as a compare and contrast person now-- first it was boba, then poke, onto BBQ, and now...Southern food? Stay tuned.\n\nI checked out the famed Brenda's French soul food on Friday and loved it. A friend mentioned this spot over the weekend, so I felt like checking it out. Had the waffles (they didn't have chicken and waffles on the to go menu!), angel biscuit, cheddar grits, and seasoned fries. \n\nFirst the waffles. I still don't get the appeal of chicken and waffles, but at least these waffles were really fluffy and slightly eggy. Best waffles I've had, from a certified waffly person on waffles. The syrup had a slight...spiced taste to it? Maybe vanilla extra with a little edge? It was like the fancy grown up version of the $1.50 elementary school breakfast I used to get. Eggs (got scrambled) could've used some salt, and could've been a bit more runny. Bacon was the thicker cut kind and they left the fat chewy! 3.5/5 for the waffles and bacon.\n\nAngel biscuit-- this was an alright biscuit, but it wasn't a gamechanger for me. The one at Brenda's was a bit fluffier. 3/5.\n\nThe cheddar grits consisted of a layer of cheddar atop some more or less flavorless grits-- probably healthier than the one at Brenda's, but who goes to eat healthy restaurant Southern food? More flavoring would've been appreciated. It was still good though, but probably only because I like grits. Baby onions sprinkled across the top made it look fancy. 3/5.\n\nFinally, seasoned fries. The fries were alright, with mashy sort of centers and crispy outsides. I think they used the red Cajun seasoning. Standard. 3.25/5.\n\nOverall a 3.25 on this place for me.", "rating": 3, "date": "2018-09-02"}, {"excerpts": ["The seasoned fries were good, but the mac & cheese was even better. "], "author": "Henry W.", "review": "\"Hey, what'd you do over the weekend?\"\n\"Bruhhhhh..I had the best chicken & waffles ever\"\n\"Where at?!\"\n\"LITTLE SKILLET IN SF!\"\n\nThis restaurant has truly perfected their fried chicken and waffle recipe. I ordered the large Mini Chicken & Waffle Basket for me and my gf. Basically, the \"shareable basket\" (tbh i didn't want to share with her - I wanted it all to myself) consists of fried chicken wings and drumsticks in contrast to the regular fried chicken breast which is larger in size. But dont be fooled! The large size is still more than enough food for two people. There was about 12 pieces of fried chicken.\n\nWhat I really enjoyed about the meal was that the fried chicken was made perfectly. The fried chicken skin was crispy and extremely flavorful, it wasn't extremely greasy or salty. Also, the chicken was juicy and was not overcooked to a dry sandpaper like texture (thank god). \n\nThe waffles were also splendid. It was light and fluffy. Crisp, but slightly chewy and soft on the side. Their maple syrup also tasted very fancy; I believe there were hints of cinnamon in it. \n\nThe seasoned fries were good, but the mac & cheese was even better. The cheesy goodness was topped with some breadcrumbs, which added a nice contrast to it.\n\nY'all better make a trip out here!", "rating": 5, "date": "2018-02-14"}, {"excerpts": ["My favorite was the seasoned fries, mostly because it had the most flavor. ", "The mac n cheese was decadent as well because it comes with breadcrumbs and a real cheddar taste. ", "Overall, I had a good experience here. ", "It's a good place to come hang out with friends or take a date."], "author": "Crystal N.", "review": "Little Skillet is a lovely place outside the busy hustle and bustle of downtown San Francisco on a Saturday night. I was thoroughly worried that there would be a huge wait and the restaurant would be crowded on a Saturday night. What's better than some soul food and drinks for a date?\n\nWe parked on the street not too far away and it was 50 cents per hour! That's not bad for SF at all. The entrance of Little Skillet is in a rather dark alleyway and it was very quiet. To my surprise, it wasn't crowded at all! There were groups of people but the atmosphere was enjoyable.\n\nWe ordered at the counter and were seated with a sign for them to bring our order over. I felt like the food took awhile to come but maybe we were just hungry! We got the large mini shareable chicken and waffles with sides of fries and mac n cheese. There large shareable chicken was a good size! We had three pieces leftover to take home- they come with a variety of wings and thighs. There were 4 mini pieces of waffles covered in powdered sugar and a cup of syrup. The syrup was runny (in a good way!) and cinnamon flavored (maybe?) aka DELICIOUS! Chicken was crispy although I could use some more flavor on them.\n\nMy favorite was the seasoned fries, mostly because it had the most flavor. The mac n cheese was decadent as well because it comes with breadcrumbs and a real cheddar taste. Overall, I had a good experience here. It's a good place to come hang out with friends or take a date.", "rating": 4, "date": "2018-02-12"}, {"excerpts": ["We ordered a pretty good spread for four hungry and inebriated ladies: 8 piece fried chicken, Mac n cheese, seasoned fries, collard greens, shrimp and grits, waffles and corn muffins with honey butter. ", "We actually wanted the angel biscuits but they were sold out. ", "We also had some cocktails (madame president, lost pants, and a martini). ", "Service is order at the counter and food brought out to you. ", "Seasoned fries were crispy and well seasoned.\n\n"], "author": "Semuteh F.", "review": "3.5 Stars!\n\nWhen I saw that little skillet was from the creators of farmerbrown I was skeptical (I've had several bad experiences at farmerbrown). We came to little skillet because we were at Bluxome Street Winery and they had no food so we needed something to soak up all the alcohol :)\n\nWe ordered a pretty good spread for four hungry and inebriated ladies: 8 piece fried chicken, Mac n cheese, seasoned fries, collard greens, shrimp and grits, waffles and corn muffins with honey butter. We actually wanted the angel biscuits but they were sold out. We also had some cocktails (madame president, lost pants, and a martini). Service is order at the counter and food brought out to you. Really spacious and lots of seating including a large bar. \n\nTwo stars off because of some food execution issues. The grits were WATERY. Flavor was actually good on the shrimp and grits dish but please fix the consistency of those grits! Also, on principal you can't run out of biscuits at a southern/soul food restaurant. The collard greens were yummy as was the fried chicken. Waffles were just okay (some pieces more crisp than others). Corn muffins and honey butter were really good but wish corn muffins were a little bigger. Seasoned fries were crispy and well seasoned.\n\nOverall an above average meal for sure but some things can be tweaked to make it exceptional.", "rating": 3, "date": "2017-10-01"}, {"excerpts": ["I feel like we paid too much for the portion size that we were given though...\n\n- Cajun seasoned fries (small, $5): ", "We asked the guy at the counter whether he recommended the cajun fries or the smothered fries, and he responded as if we had asked the most inane, obvious question ever: cajun seasoned fries. ", "So on his \"enthusiastic\" recommendation, we ordered the cajun fries. ", "The verdict? ", "Meh. ", "I love fries, and I thought these were only alright. "], "author": "Lillian Z.", "review": "Hmmm. I love fried chicken, but I was a little disappointed with Little Skillet, to be honest. \n\nLocation: The main entrance for Little Skillet is somewhat hidden in an alley way, but inside the building, it's actually quite spacious. The decor has a very rustic feel to it. Lots of wood and mismatched tables, but still very cute. There's definitely more large tables here (think picnic table type), rather than smaller tables, so if you're coming with a smaller party (e.g. 2-3), be prepared to sit at a larger table that you may end up sharing with others if they get busy.\n\nFood:\n- Mini chicken and waffle basket (small, $10): We had to try the chicken and waffles of course, but honestly, I wasn't that impressed. The chicken was very crispy and fried very well, but I felt like it was lacking in flavor. I was a little disappointed. The waffles were quite good and the syrup was more on the thin side, which I liked. But even in terms of the chicken and waffles combo, I've had better. \n\n- Skillet hot wings (small, $9): We ordered these in the buffalo flavor, which was quite good. I feel like we paid too much for the portion size that we were given though...\n\n- Cajun seasoned fries (small, $5): We asked the guy at the counter whether he recommended the cajun fries or the smothered fries, and he responded as if we had asked the most inane, obvious question ever: cajun seasoned fries. So on his \"enthusiastic\" recommendation, we ordered the cajun fries. The verdict? Meh. I love fries, and I thought these were only alright. They didn't taste particularly seasoned to me, but that seemed to be the general theme for food here.\n\n- Side of collard greens: Pretty standard side of collard greens in my opinion. Probably one of the more flavorful parts of the meal.\n\nService:\nAs you can probably tell from my description above, I was not wow-ed by the service here. You order food at a counter on the side of the bar, which would have been fine if it wasn't for the fact that the guy working that counter was so unpleasant. He never smiled at us, which also could have been forgivable if he had at least attempted to be nice. But alas... he treated us like we were the stupidest people to ever set foot in Little Skillet. When we asked for recommendations, he treated our questions like they had obvious answers that we were just too stupid to see. After we finished ordering our food, we asked whether or not we could also order drinks at the counter or if we had to go to the bar. He started repeating \"at the bar\" over and over as if were so dumb that he was worried we wouldn't understand him. Not a great way to make your patrons feel, dude.\n\ntl;dr: Little Skillet was ok food wise, but I do think that our not so pleasant encounter with the guy taking our order left a sour taste in my mouth. Bleh.", "rating": 3, "date": "2017-05-13"}, {"excerpts": ["I got their seasoned fries and mac n cheese. ", "Their mac n cheese is perfect and creamy in my opinion. ", "Just the way I like it. ", "I would definitely come back."], "author": "John N.", "review": "One of the best fried chicken places in town for sure. I really like the atmosphere and the friendly staff members. Parking can be hard, but then again it's SF. Self seating - two rooms with plenty of tables. A bar on the side. What else can you ask for. But let's be real, everybody comes here for their fried chickens. It's freaking delicious! Also, their sides are tasty as well. I got their seasoned fries and mac n cheese. Their mac n cheese is perfect and creamy in my opinion. Just the way I like it. I would definitely come back.", "rating": 5, "date": "2017-06-13"}, {"excerpts": ["Seasoned fries were seasoned with some generic seasoning, and they tasted worst than In N Out fries.  "], "author": "Bailey N.", "review": "Uh, no to soul food from here.  \n\nPerhaps we were too lazy to cook for Easter and Little Skillet happened to be open via Eat24, but the food was cold.  Like left out all day cold.  I was even surprised when I got an Eat24 text alert that my food would arrive in 20 minutes but now I know why.\n\nChicken was okay, juicy but cold, but also not impressive compared to Popeye's or even Happy Donuts in the neighborhood vicinity.  I want juicy greasy chicken on the inside and a crispy outer layer.  \n\nSeasoned fries were seasoned with some generic seasoning, and they tasted worst than In N Out fries.  Oh, and they were cold.\n\nRibs were okay and generic tasting but I've had better.  And it was cold.\n\nMac and cheese was stale with few bits of Panko crumbs.  When I think of good Mac and cheese, I'm talking about loaded with bacon pieces, Panko crumbs to give it texture and put on a surprise cheese element like blue cheese on top.\n\nWe tossed our leftovers and that rarely happens. \n\nSo my lesson learned is to stay away from soul food cooked my hipsters (I'm assuming based on the delivery dude) and stick to soul food places that are crazy packed with homeless people, a la Happy Donuts or Popeye's.  They know what's up.", "rating": 2, "date": "2016-03-29"}, {"excerpts": ["Two piece chicken, with sweet potato mash and seasoned fries with strawberry lemonade. "], "author": "Nina X.", "review": "Two piece chicken, with sweet potato mash and seasoned fries with strawberry lemonade. So delicious. \n\nChicken: crispy on the outside, moist and tender on the inside \nSweet potatoes: smelled like Mac n cheese a little but so creamy and the perfect amount of sweetness\nSeason fries: nice and crisp, delicious with or without ketchup\nStrawberry lemonade: so divine - so refreshing \n\nThe place was loud and the ordering set up confused me at first. But the food is worth is.", "rating": 5, "date": "2017-06-14"}, {"excerpts": ["The seasoned fries I ordered as my side was delicious! "], "author": "Kristi T.", "review": "Delicious! Best place that serves chicken n' waffles in San Francisco, hands down!\n\nMy friend and I shared the 8 piece chicken and waffles. The waffles were perfect! Just the right amount of crunchiness and softness. Also, the syrup wasn't overly sweet and tasted like it contained a bit of cinnamon? We got to choose which type of meat we preferred, which was awesome, since we love legs and thighs! The skin was flavorful and the meat was tender and juicy. I'm drooling just thinking about that meal!\n\nThe 2 piece chicken and waffles combo with a side is great as well! The seasoned fries I ordered as my side was delicious! Do pair the yummy chicken with their hot sauce!\n\nAmbience is nice. Perfect place to hang out with friends, even though it is always crazy packed and loud. Also, it is located in an alleyway so it is not a place you casually stumble into. Parking is also difficult in the area. Despite all this, I will definitely be back whenever I am craving chicken and waffles!", "rating": 5, "date": "2015-01-10"}, {"excerpts": ["Seasoned fries for me ", "- What can I say? ", "It was a fries kind of day for me. ", "Anyway, the food came on a metal food tray that was super reminiscent of those old school cafeteria meals. ", "Upon first glace, the chicken looked amazing and I wanted to gobble up the fries. ", "I didn't understand the extremely small corn muffin or bite size piece of watermelon. ", "For the record, the corn muffin was just okay - ", "I like a little more crunchy to soft contrast. ", "The watermelon was good - too bad "], "author": "Jonathan C.", "review": "Where are we? Isn't this a bar? \nYes, well it's also Little Skillet!\n\nI enjoyed the layout of Little Skillet because there's so much seating and you can even sit at the bar and watch the football games on Sunday! The location itself is a bit out of the way - around AT&T Park and tucked into a random alleyway. \n\nI ordered the 2 piece fried chicken with a side. Seasoned fries for me - What can I say? It was a fries kind of day for me. Anyway, the food came on a metal food tray that was super reminiscent of those old school cafeteria meals. Upon first glace, the chicken looked amazing and I wanted to gobble up the fries. I didn't understand the extremely small corn muffin or bite size piece of watermelon. For the record, the corn muffin was just okay - I like a little more crunchy to soft contrast. The watermelon was good - too bad I got something the size of an orange slice. \n\nWait wait wait! Back to the old school cafeteria tray plating. I was slightly bothered by how it affected the meal. I appreciate the concept BUT I would prefer a plate. Since it was a metal tray it came with a thin brown paper lining. It definitely was NOT the sturdy butcher paper you'd wrap nice cuts of meat with, so as I tried to portion out the large pieces of chicken the paper softened and tore. Since I don't really like the sound of cutting metal on metal, I spent the entire meal trying to delicately eat my food and avoid paper sticking to my chicken. \n\nAt last.. the food. Good portions for the price, however, it was noticeably disappointing a few minutes in. The chicken skin was crispy and the meat was juicy while the fries were wonderfully seasoned with a crisp outer and soft inside. Unfortunately, after a few bites I noticed the chicken was a bit under-seasoned and the same went for the fries. Although cooked well, the chicken meat was bland and the seasoning only touched the top layer of the fries. \n\nWould I come back? Maybe for a drink. I think I'll pass on brunch.", "rating": 3, "date": "2015-10-05"}, {"excerpts": ["Large seasoned fries - cold and stale\nLarge bbq ribs (8 pcs) with side of mac and cheese - false advertistment....does not fall off the bones and it taste like sauce was just brush on the outside , meat pretty tuff not soft at all\n8 pcs chicken & waffle - chicken are juicy but breading was tacky and tuff\nSeafood gumbo - big kick and by far the best out of all was ordered"], "author": "Linh D.", "review": "Maybe the experience would of been better if it wasnt sold through a window during a private event held...\n\nOrdered the following....\nLarge seasoned fries - cold and stale\nLarge bbq ribs (8 pcs) with side of mac and cheese - false advertistment....does not fall off the bones and it taste like sauce was just brush on the outside , meat pretty tuff not soft at all\n8 pcs chicken & waffle - chicken are juicy but breading was tacky and tuff\nSeafood gumbo - big kick and by far the best out of all was ordered", "rating": 2, "date": "2015-12-12"}, {"excerpts": ["But then my friend ordered the seasoned fries and the mashed sweet potatoes ", "The seasoned fries were good. ", "The cajun seasoning was flavorful but not overwhelming. ", "The jalapeno corn muffin is TINY. ", "But good. ", "My favorite side dish by far was the mashed sweet potatoes. ", "I want to come back just to order this for myself. ", "They taste like sweet potatoes which is great, and they also have a hint of mashed potato taste!! ", "IT ", "WAS DELICIOUS. "], "author": "Josephine L.", "review": "I ordered the 2 piece chicken box for $12.50. Comes with a jalapeño corn muffin and your choice of side. I had the hardest time choosing which side because everything looked so good!! I ended up ordering the biscuit side because I. Adore. Biscuits. And am compelled to order them if they are an option, everywhere I go. But then my friend ordered the seasoned fries and the mashed sweet potatoes so I got to try those too.\n\nThe biscuit was disappointing. It was hard, and not warm. It might have been one of the worst biscuits I've ever had. KFC biscuits are more tasty, and fluffier. However, the biscuit did come with some butter that was slightly sweet and hence unique so after I slathered a bunch of it on the biscuit, the taste greatly improved after that.\n\nThe fried chicken was good, but not amazing. I liked the drumstick piece so much more than the thigh piece. But it's small. Small drumstick! The seasoned fries were good. The cajun seasoning was flavorful but not overwhelming. The jalapeno corn muffin is TINY. But good. I think it would have been amazing if it came warmed.\n\nMy favorite side dish by far was the mashed sweet potatoes. I want to come back just to order this for myself. They taste like sweet potatoes which is great, and they also have a hint of mashed potato taste!! IT WAS DELICIOUS. 10/10 recommend!\n\nLove the decor in here! There are a bunch of different types of seating available, and you seat yourself after you place your order at the front. There is a parlor that doesn't seem like it's always open, but that area has two tables with high cushy seats for 2-4 people and then a long L couch (I wanted to sit here but it was occupied by a large group when we got there). The numbers they give you to put on your table so they can deliver your food to you aren't numbers. Each \"number\" is a different vegetable on a card! I thought that was neat. \n\nCame on a Wednesday night around 7:30 pm and was able to find a seat easily. It's a nice space! Great to meet up casually with friends. Also has a bar if you are partial to having a drink with dinner.", "rating": 4, "date": "2015-07-09"}, {"excerpts": ["but I liked how bitesize they were) and seasoned fries (must try!!).  ", "The chicken was split up into: 2 drumsticks, 2 wings and 4 breasts.  ", "The pieces, especially the breast, were ginormous.  ", "We couldn't finish everything ", "but I think this meal would be perfect for a group of 4. ", "It was hard not to overeat when the chicken was ", "that juicy and the skin was that crispy,  ", "We also luckily came in during National Waffle Day and they gave us 2 free waffles.  ", "The waffles were alright, nothing noteworthy.  ", "They came with a small side of syrup which didn't seem enough.  ", "Syrup tasted a little strange to me."], "author": "Michelle B.", "review": "I have to start off htis post by mentioning that I have had my fair share of fried chicken.  As a fried chicken lover, I've been to a few different locations (whether they specialize in fried chicken or not) to taste test.  This one is probably my favorite that I've had in downtown SF!  You order at the counter and seat yourself.  Tables and seating were clean which I definitely appreciate for a bar/fried chicken joint (not so typical).  there's seating in two different rooms, one with more light which was quieter and one in the main area next to the bar.  So you have your pick of what ambience to go for, loud and exciting or quiet to have more private conversations.  I went on a Wednesday after work and it wasn't hard to find a table.  While you're waiting, you can grab a drink at the bar - oh, btw this place is half restaurant, half bar!!  Double win!  Unfortunately, I didn't order a drink because I didn't want to take up space before the food came.  But side note to self to try their cocktails next time I go.\n\nMy 2 friends and I shared the 8 piece fried chicken meal which also comes with 2 sides of your choice or waffles.  We opted in for the sides and chose the jalapeno cornbread muffins (a little lackluster and dry but I liked how bitesize they were) and seasoned fries (must try!!).  The chicken was split up into: 2 drumsticks, 2 wings and 4 breasts.  The pieces, especially the breast, were ginormous.  We couldn't finish everything but I think this meal would be perfect for a group of 4. It was hard not to overeat when the chicken was that juicy and the skin was that crispy,  We also luckily came in during National Waffle Day and they gave us 2 free waffles.  The waffles were alright, nothing noteworthy.  They came with a small side of syrup which didn't seem enough.  Syrup tasted a little strange to me.", "rating": 4, "date": "2016-08-25"}, {"excerpts": ["I had gotten the fried chicken with waffles and seasoned fries. ", "The chicken was excellent: crunchy on the outside and yet moist inside. ", "It was well seasoned and the texture was really nice. ", "The waffles were fluffy and light, and came with some bourbon flavoured maple syrup. ", "And the fries were skin on and seasoned lightly, yet just enough. ", "Next time, I'm going to order to stay, because the place looked very warm and friendly. ", "And the drinks looked inviting too. "], "author": "Avadhut P.", "review": "Note: Takeout only.\n\nThe only reason I ordered from here was because I had a hankering for some fried chicken and these guys had a Takeout option on Yelp. Seemed convenient enough. I wasn't expecting much, to be honest, but I was pleasantly surprised. First off, I did not have to wait at all. The food was ready, packed, and bagged at the time I had asked for. I had gotten the fried chicken with waffles and seasoned fries. The chicken was excellent: crunchy on the outside and yet moist inside. It was well seasoned and the texture was really nice. The waffles were fluffy and light, and came with some bourbon flavoured maple syrup. And the fries were skin on and seasoned lightly, yet just enough. Next time, I'm going to order to stay, because the place looked very warm and friendly. And the drinks looked inviting too. Awesome place. :-)\n\nBonus story: Back in April 2015, I had visited Kate's kitchen, on Haight street. And I had, surprise surprise, fried chicken. The girl who waited on me, I remember very clearly, was very friendly and had curly hair. And today when I went to pick up my fried chicken from Little Skillet, it was the same girl who handed it to me! I wonder if she serves fried chicken all over SF :-)", "rating": 5, "date": "2015-06-21"}, {"excerpts": ["Then the seasoned Fries ", "oh man was very good ", "everything was Hot and ready for me to Chow down the plate presentation ", "was great ", "the staff was nice and helpful but the Ambience is so nice music playing two televisions the bar was very nice as well very clean place ", "I'm going to be Coming back to eat here ", "For sure next time  I'll bring my Boo."], "author": "Enjoli L.", "review": "First of all I work right down the street and I have been wanting to come to  little skillet for the longest of time.i have been Craving for some fried chicken and just to be able walk in to this hidden Gem is so appreciated Man the fried chicken on point,seasoned Right I had the Mac&cheese Now that Mac&Cheese omg!!!Bomb!!! Then the seasoned Fries oh man was very good everything was Hot and ready for me to Chow down the plate presentation was great the staff was nice and helpful but the Ambience is so nice music playing two televisions the bar was very nice as well very clean place I'm going to be Coming back to eat here For sure next time  I'll bring my Boo.", "rating": 5, "date": "2016-07-06"}, {"excerpts": ["We got an 8 piece to go with seasoned fries and coleslaw.  ", "Fries were nice and crispy - love crispy NOT burnt fries!  ", "And the jalapeño coleslaw was yummy!"], "author": "Loreta N.", "review": "OMG!  The fried chicken is on point! Crispy, juicy goodness!  We got an 8 piece to go with seasoned fries and coleslaw.  Fries were nice and crispy - love crispy NOT burnt fries!  And the jalapeño coleslaw was yummy!", "rating": 5, "date": "2016-05-22"}, {"excerpts": ["I got the 2-piece chicken with a side of seasoned fries. ", "Excellent fried chicken: crispy & juicy. "], "author": "Paul L.", "review": "I got the 2-piece chicken with a side of seasoned fries. Excellent fried chicken: crispy & juicy. The fries were were also excellent: nicely seasoned and plenty of them.\n\nI had updated my review to report that they reduce the sizes of the pieces of chicken. That seems to have reversed itself, so now they're back to good sizes. Let's hope it stays that way.", "rating": 5, "date": "2015-02-16"}, {"excerpts": ["The seasoned fries is crispy too and really good. ", "Use the milk cartons as seats and tables too, but make sure you share!"], "author": "Vinkin Ken T.", "review": "Mmm crispy buttermilk fried chicken and waffles. 2 great combinations. You can even see them batter up the fried chicken in their big kitchen. You can choose which piece of chicken you want in your combos. The menu is a bit small to read on the wall. Chicken is juicy and tender with a crispy buttermilk skin. The skin is the best part! Waffle is crispy and soft in the inside, and combine that with a piece of chicken and maple syrup, it is heaven in your mouth. The seasoned fries is crispy too and really good. Use the milk cartons as seats and tables too, but make sure you share!", "rating": 5, "date": "2013-12-25"}, {"excerpts": ["We read good reviews, and ordered fried chicken, seasoned fries and strawberry lemonade. ", "Well, finally when the chicken arrived, to my extreme disappointment, it was cold, soggy, and at least a day old. ", "I mean, for whatever they're charging for 3 pieces of chicken, they had the audacity to bring 1 day old fried chicken? ", "I was furious, so I went up to the waitress and told her to make me a fresh one. ", "She took a great offense, and said, well we make fresh to order, and kept repeating it. ", "I'm like then ", "why isn't it crispy and hot? ", "and fries were also soggy, but I couldn't return them because I was starving ", "and I had to eat something ", ":/ ", "The strawberry lemonade was too sour, and let me tell you, \"Sizzlers\" has 100 times better strawberry lemonade. ", "Then after good 45 minute they brought a new order. ", "The chicken was fried fresh , and I was excited to eat. ", "But OH. ", "MY. ", "GOD ", "it was toooooo salty and inedible.  ", "I felt sick after 1 bite. ", "Ugh. "], "author": "Fatimah Q.", "review": "I heard really really good things about this place. We normally go to \"The front porch\" for fried chicken, but we though we should check this out. So, we went there. Now, considering it is far from where we live, and we went only for fried chicken. We read good reviews, and ordered fried chicken, seasoned fries and strawberry lemonade. Well, finally when the chicken arrived, to my extreme disappointment, it was cold, soggy, and at least a day old. I mean, for whatever they're charging for 3 pieces of chicken, they had the audacity to bring 1 day old fried chicken? I was furious, so I went up to the waitress and told her to make me a fresh one. She took a great offense, and said, well we make fresh to order, and kept repeating it. I'm like then why isn't it crispy and hot? and fries were also soggy, but I couldn't return them because I was starving and I had to eat something :/ The strawberry lemonade was too sour, and let me tell you, \"Sizzlers\" has 100 times better strawberry lemonade. Then after good 45 minute they brought a new order. The chicken was fried fresh , and I was excited to eat. But OH. MY. GOD it was toooooo salty and inedible.  I felt sick after 1 bite. Ugh. What a waste of time, and money!\n\nI NEVER run in this problem at \"The front Porch\" Their fried chicken is the best one I've ever had. We have been there so many times, and It is consistently good...hmmmm.yummmmmm when I think about it. The price is the same. Little skillet's fried chicken was so horrible, and worse than the KFC. We regretfully left this place to never return again :/  Avoid at all cost!", "rating": 1, "date": "2016-06-02"}, {"excerpts": ["* Sides ~ mac-n-cheese, coleslaw, seasoned fries\n"], "author": "Cathy K.", "review": "Open Monday thru Saturday, 9a - 3.30p, in an alley near the Ball Park, this place was off the beaten path from my normal route. \n\nLS is a charming, brick hole in the wall, take out window that serves:\n \n* Fried Chicken (1, 2, or 3 pieces)\n* fresh Waffles\n* Waffledogs\n* Sandwiches ~ po'boys + BBQ pulled pork\n* Salads ~ cobb + market (sides of potato, mac, and fruit salads)\n* Grits ~ a variety\n* Biscuits ~ named after an angel\n* Sides ~ mac-n-cheese, coleslaw, seasoned fries\n* Desserts ~ pecan pie + red velvet cupcake\n\n...and for those Blue Bottle coffee lovers, there is a kiosk right next door.\n\nPlaces to graze include:\n* one of the nearby docks\n* picnic on the Bay a few blocks away ~ I can hear the Otis Redding song now... http://www.youtube.com/watch?v=8nA18g_PwG0", "rating": 4, "date": "2010-01-12"}, {"excerpts": ["We also tried the greens, mac n' cheese, seasoned fries, and grits. ", "Everything was great , but the service slowed down towards the end . ", "I would love to go back and try more of the menu ."], "author": "Bryan Y.", "review": "The chicken and waffles are some of the best i've had . I hear a lot of people comparing Brown Sugar Kitchen and 900 Grayson to this place. Out of the 3 , FB's is it . We also tried the greens, mac n' cheese, seasoned fries, and grits. Everything was great , but the service slowed down towards the end . I would love to go back and try more of the menu .", "rating": 5, "date": "2015-01-29"}, {"excerpts": ["Got a side of seasoned fries that came with my chicken, and they are BOMB! ", "Every piece was crunchy! ", "I hate soggy fries! "], "author": "Sara K.", "review": "YUMMY!\n\nFinally a place that lives up to its hype. I got the 2 piece chicken with a side of waffles and it was DELICIOUS! The fried chicken was a drumstick and a breast, not a cheap thigh! The breast was a little on the dry side, but I understand it's difficult to cook, let alone fry, breast meat and have it be really moist.\n\nThe waffle was excellent, the syrup even more so. Got a side of seasoned fries that came with my chicken, and they are BOMB! Every piece was crunchy! I hate soggy fries! Even their ketchup is homemade, and I usually hate ketchup but upon trying theirs, I wanted more.\n\nThe grits were mouthgasmic. I've never had such creamy grits with such a nice texture.\n\nThe only thing I need to warn you about is the menu that is pictured here is not the updated one, so don't expect to go there and pay those prices. Although it's more expensive now, I still think it's a great deal.\n\nThe service was cool. The girl gave me the wrong change (by $10) and when I went back and told her what happened, she didn't question me or anything! Remembered quickly she made the mistake and gave me the correct change. You don't find that very often.\n\nNext up, I will try the pork sandwich and Cobb salad!", "rating": 5, "date": "2010-03-19"}, {"excerpts": ["I ordered seasoned fries as a side ", "and I'm pretty sure those suckers were reheated. "], "author": "Felix L.", "review": "Over hyped.. the chicken was alright, I've had better. The price range is $ if you intend to starve for the rest of the day. If you want a decent amount expect to pay $10+ and thats only 2 pieces of chicken + a side.\n\nI ordered seasoned fries as a side and I'm pretty sure those suckers were reheated. They were rock hard.\n\nSo was it worth the 30+ minute wait to just order and then another 15 minutes to get the food? \n\nUmm no.\n\nThat leaves 15 minutes to walk back and eat? I think I can wait until a Tuesday to get my fried chicken fix.", "rating": 3, "date": "2011-06-24"}, {"excerpts": ["Only complaint: the seasoned fries are a little lacking... ", "But, the cucumber salad is divine, so it totally makes up for it!"], "author": "Natahley B.", "review": "This adorable little place is tucked away on a side street, giving it a \"hidden gem\" kinda feel. And what is the crown jewel of this gem? FRIED CHICKEN!\n\nEasily the best fried chicken I have ever had! It's crunchy, salty, and seasoned just right, not to mention, the chicken is juicy, top quality white meat. Even the thigh piece seemed more like breast meat! \n\nOnly complaint: the seasoned fries are a little lacking... But, the cucumber salad is divine, so it totally makes up for it!", "rating": 4, "date": "2010-09-13"}, {"excerpts": ["I ordered the two piece chicken with seasoned fries, and JALAPENO cornbread!  ", "with a side of crystal hot sauce.......mmmmmmm    ", "I loved how it was casual and the menu was to the point.  ", "No fuss with pretty words and blah blah blah.  ", "The people there were very nice and made you feel welcomed and warm.  "], "author": "Saba C.", "review": "ok..... this is a hole in the wall.  Literally.  However, it is the cutest hole in the wall ever...... with the most delicious soul food in the area.  I work on Brannan and it only takes 2 minutes to walk  to this place.\n\nLittle Skillet would be one of those places you would treat yourself to if youve had a good day and wanted something yummy.\n\nToday was one of those days.  I sat at my desk contemplating what to have for lunch.    I have been making smoothies for lunch for several months now, and knew that was what I should stick with.  A coworker gchats me, and asks what I was doing for lunch.  I, of course, was always stuck on some deadline, and responded that I had to eat at my desk.   Little did I know he was going to the Little Skillet.  So while in the copy room, two of my other fave coworkers asked if i wanted fried chicken.  oh my, smoothie was  no longer a lunch option for the day.  \n\nLong story short (i know I can go on and on) I ordered the two piece chicken with seasoned fries, and JALAPENO cornbread!  with a side of crystal hot sauce.......mmmmmmm    I loved how it was casual and the menu was to the point.  No fuss with pretty words and blah blah blah.  The people there were very nice and made you feel welcomed and warm.  AND the little coffee shop next to it was divine!\n\nThe chicken was juicy, the fries crunchy, and the JALAPENO cornbread warm, mushy, and just YUM.  \n\nuntil next time, Little Skillet, until next time.  =)", "rating": 5, "date": "2012-01-13"}, {"excerpts": ["The seasoned fries are alright but nothing special, again at $4/serving.\n", "3) ", "Jalapeno corn bread--great if you like corn bread, but a little on the dry side.\n", "4) ", "I would not suggest taking the food to go if you're traveling far.  ", "The steam from the food inside the box causes the waffle to get rather soggy before you get a chance to eat it.\n", "5) Remember to bring cash---this is a Cash Only joint."], "author": "Suzi F.", "review": "I've had chicken waffles one time, 5 years ago, and it was at the well-known Roscoe's chicken and waffles.  I didn't care for it much and never tried it again......until yesterday.  Valentine's day lunch with my bff and my bf at Little Skillet.\n\nWhen I approached the literal hole in the wall, I was taken aback a bit.  But I figured, if the place had been reviewed this many times, it was worth a try.\n\nI'm glad I gave chicken and waffles another try.  It was really yummy!  I am the type of person who swears she loves fried chicken but NEVER eats the skin.  Since Little Skillet was so highly reviewed, I gave everything a try.  I ate the waffles WITH the chicken.  I even ate the chicken skin.  $8.50 for two pieces of fried chicken and a sizeable waffle are not a bad price.  Definitely worth the taste and quantity.\n\nWhat I would recommend against:\n1) Do not get the mac and cheese, $4 for a small cup.  Too watery and not much flavor.  I actually prefer Kraft Easy Mac.  \n2) The seasoned fries are alright but nothing special, again at $4/serving.\n3) Jalapeno corn bread--great if you like corn bread, but a little on the dry side.\n4) I would not suggest taking the food to go if you're traveling far.  The steam from the food inside the box causes the waffle to get rather soggy before you get a chance to eat it.\n5) Remember to bring cash---this is a Cash Only joint.", "rating": 4, "date": "2011-02-15"}, {"excerpts": ["My side is usually the seasoned fries because they're crispy and way delicious. ", "Take it from the potato lady, eat these fries! ", "And the angel biscuit! ", "Oh man, if it wasn't past my bedtime right now", ", I'd give it ", "it's own paragraph. ", "Fluffy, moist and delicious. ", "SO worth trying. "], "author": "Salina Z.", "review": "I love Little Skillet. No, really, I LOVE LITTLE SKILLET. And I LOVE LOVE LOVE Fried Chicken (look to the left on my profile). Thus, I LOVE Little Skillet. It has been on heavy rotation for many, many months now. We usually sleep in, put in a phone order and roll up to the window after parking illegally (sshhh) since it's the weekend. They always sound surprised when we called in but the food was always piping hot. Actually it was mostly the girl that sounded preoccupied and surprised, not the guy.\n\nFood: I have no idea what they put in the breading of this chicken. I would consider trading in my DVR for this business. OK, that's probably a little dramatic but man, this chicken is good. My usual steez is the 2 piece chicken box. The breast is SUPER SUPER SUPER juicy and is usually piping hot. I'm Asian so you know I usually stick to the dark meat but I am not complaining if I get some breast in there, know what I mean? My side is usually the seasoned fries because they're crispy and way delicious. Take it from the potato lady, eat these fries! And the angel biscuit! Oh man, if it wasn't past my bedtime right now, I'd give it it's own paragraph. Fluffy, moist and delicious. SO worth trying. And there's Coke in a bottle (aka Mexican Coke)!\n\nBoo usually has the 2 piece chicken and waffle. Solid waffle and syrup. Yum.\n\nService: Love the guy who seems to run the joint. He's friendly but not in a fake way. And although someone like him (cool) would usually intimidate me (not cool), he's actually really personable. Yay for not being too cool!\n\nOh right, like everyone else said... loading dock. Lovely on a sunny day. Those are rather unlikely though so don't feel ashamed eating in your car. I sure don't!\n\nI do have to mention the latest visit which was a little bit of a disappointment but was given a one time pass because of all the solid visits beforehand. The breast seemed a bit lukewarm and had been sitting a bit. Same for the fries (usually my favorite fries ever). The biscuit seemed cold cold cold as well. However, the skin is still the best tasting fried chicken skin. Just an off day. I hope. I hope.\n\nAnd the post fatty trip to Phiz is always good too.", "rating": 5, "date": "2010-02-17"}, {"excerpts": ["I also tried the seasoned fries which were very solid, though kind of paled in comparison to the angel biscuits.  ", "I tried one of my friends waffles and was not very impressed.  "], "author": "Dana H.", "review": "Ok, so the best deal here is to get the 8 piece family pack.  It comes with two sides and plenty of biscuits to share - plus it comes in this giant box with a handle.  All of this for only $18 bucks and it easily feeds three.  \n\nThe chicken here is really good, nicely fried with a batter that is not too thick.  The biscuits were absolutely delicious and were very light (I guess that is why they call them angel biscuits).  I also tried the seasoned fries which were very solid, though kind of paled in comparison to the angel biscuits.  I tried one of my friends waffles and was not very impressed.  I prefer the thin crispy waffles served at Roscoe's to the Belgian variety at Little Skillet.  \n\nThe place is really just a take out window, but there is a great little stoop across the alley where people sit and enjoy their delicious chicken in the sun (or fog...).  My plan is to grab the family pack and head over AT&T park to watch the Giants on a nice Saturday afternoon - way better than a stadium hot dog!", "rating": 4, "date": "2010-06-02"}, {"excerpts": ["The other items on the menu are so-so, like the pulled pork sandwich, and I found the seasoned fries to be ridiculously salty.\n\n"], "author": "Kira K.", "review": "Within 5 minutes of getting the fried chicken, I devoured every last crispy, yet moist, morsel.  It seriously is the best fried chicken I've ever tasted.  The other items on the menu are so-so, like the pulled pork sandwich, and I found the seasoned fries to be ridiculously salty.\n\nBut that chicken - winner winner fo sho!!!", "rating": 5, "date": "2009-11-02"}, {"excerpts": ["The seasoned fries were lightly flavored but with the ketchup, super nice! \n", "Service was really warm and friendly, and they have condiments and free water in the cart next to the ordering station. ", "I really like that all the plastics were bio-degradable or made from recycled by-products. ", "AND all coke sodas are sold by the bottle! ", "None of those cans..hehe..\n", "Comfort food for the takeout crowd, definitely drop on by here if you're down by 3rd and Townsend area!"], "author": "Pauline L.", "review": "It's raining like crazy and I'm feeling like chicken for lunch. I'm hearing only good things about Little Skillet so my one and only excursion into downtown landed me in the area.\n\nFirst off, this is one narrow alleyway, but I got to snag a yellow zone to wait out for my take out. There're specials written on a chalkboard hanging from the awning, but I'm here for clucking goodness. I grabbed myself the 2 piece chicken and side with an extra sweet kick of red velvet cupcake.  The chicken was fried nice and golden with none of the super oily greasiness of other places. The seasoned fries were lightly flavored but with the ketchup, super nice! \nService was really warm and friendly, and they have condiments and free water in the cart next to the ordering station. I really like that all the plastics were bio-degradable or made from recycled by-products. AND all coke sodas are sold by the bottle! None of those cans..hehe..\nComfort food for the takeout crowd, definitely drop on by here if you're down by 3rd and Townsend area!", "rating": 4, "date": "2010-04-02"}, {"excerpts": ["Next time I'll try the seasoned fries.\n\n"], "author": "Bianca R.", "review": "Not too shabby for a walk up window in SOMA.  The 2-piece Chicken Box is a great deal.  Nice crispy chicken and sweet angel biscuit (I like it sweet!).  My coleslaw side was just OK.  Next time I'll try the seasoned fries.\n\nAnd yes, they have Faygo drinks, so WhyNotGo?", "rating": 4, "date": "2010-02-05"}, {"excerpts": ["bring cash since it's cash only and bring lots of cash since you will be enticed to order extra sides like biscuits, seasoned fries, grits, and potato salad.\n\n"], "author": "Carli F.", "review": "after discovering little skillet on the new 7x7 list for 2010 and walking distance from my place, i decided to venture out to try this place on ritch.  bring cash since it's cash only and bring lots of cash since you will be enticed to order extra sides like biscuits, seasoned fries, grits, and potato salad.\n\nthe fried chicken was really good: i had the two piece with the waffle.  they were out of grits by the time we got there so i would definitely recommend coming earlier since they are only open from 9-3:30 pm, monday-saturday.  \n\nfor best enjoyment, eat your meal at the loading dock located right across from little skillet.  enjoy!", "rating": 4, "date": "2010-02-18"}, {"excerpts": ["Their seasoned fries and potato salad are yummy and they've added little cushions to sit on outside."], "author": "Nina L.", "review": "Hooray for having Saturday hours!  I've eaten at this place several times since my first visit and they are still going strong.  I still roll with their fried chicken and go back and forth between the chicken and waffles and 2-piece box (comes with a side and flaky biscuit).  Their seasoned fries and potato salad are yummy and they've added little cushions to sit on outside.", "rating": 5, "date": "2010-07-26"}], "angel biscuits with butter": [], "jalapeno corn muffins": [{"excerpts": ["We ordered the shrimp and grits, the 2 piece chicken and waffle box, a side of jalapeno corn muffins and an arnold palmer. ", "Everything was delicious. ", "The shrimp and grits came with big juicy crunchy shrimp and the grits were cooked to a perfect consistency and texture. ", "The chicken was pretty good, nice crispy crunchy skin and juicy chicken inside. ", "The waffle was average, it would have been better a little crispy, it was very soft. ", "The arnold palmer was ok", ", it was more on the sour tart side, could have used a little more sugar. ", "But the jalapeno and corn muffins were my favorite of everything. ", "These cute little muffins of goodness with hints of jalaeno. "], "author": "Stephanie L.", "review": "I wouldn't have known about this place if it weren't for Paypal and it's offers!\n\nDecided to stop by Farmerbrown's Little Skillet for lunch on a weekday. Parking is all street parking and during the day means it's metered.\n\nThis little place is hidden in an alley and it's just a window that makes delicious food.\n\nWe ordered the shrimp and grits, the 2 piece chicken and waffle box, a side of jalapeno corn muffins and an arnold palmer. Everything was delicious. The shrimp and grits came with big juicy crunchy shrimp and the grits were cooked to a perfect consistency and texture. The chicken was pretty good, nice crispy crunchy skin and juicy chicken inside. The waffle was average, it would have been better a little crispy, it was very soft. The arnold palmer was ok, it was more on the sour tart side, could have used a little more sugar. But the jalapeno and corn muffins were my favorite of everything. These cute little muffins of goodness with hints of jalaeno. yummms.\n\nIt is a bit on the pricey side. the food we ordered was about $25 but luckily with the paypal offer we saved a few dollars.\n\nI felt very hipster ordering food and eating on the sidewalk. Very cool vibe and good food. But they also have seating inside.\n\nWorkers are very friendly and helpful too!", "rating": 4, "date": "2014-12-09"}, {"excerpts": ["Get the combo pack and get some tasty sides as well, including the jalapeno corn muffins (a bit too dry), fries, collared greens (gotta have something to offset the grease), and cole slaw. ", "Make sure you also order a side of waffles because Chicken & Waffles has a new meaning here! ", "Be prepared to experience the most wonderfully flavorful first piece of chicken, and then slowly make your way to your second, before struggling to finish a third or fourth piece because of the grease, but the chicken tastes so good, you know you'll dig deep into yourself to cross that finish line, because it is so worth it, grease and all, cause it's so finger-licking good!!!"], "author": "Stanley C.", "review": "LITTLE SKILLET\nOK....get ready for the best Southern fried chicken ever and the greatest order of heart attack ever!!! Hidden in an alleyway in San Francisco, Little Skillet is a giant when it comes to Southern fried chicken and artery-clogging grub. The interior reminds me of a barn, very rustic, and very warm and welcoming, supposedly like the Gentlemen South. As for the chicken, we order up a storm of the most crispy, juicy, and flavorful fried chicken in the South Bay!!! The chicken pieces were huge, like they were raised on steroids, making each breast, wing, and drumstick a joy to bite into! The crispy skin was absolutely wonderful!!! Get the combo pack and get some tasty sides as well, including the jalapeno corn muffins (a bit too dry), fries, collared greens (gotta have something to offset the grease), and cole slaw. Make sure you also order a side of waffles because Chicken & Waffles has a new meaning here! Be prepared to experience the most wonderfully flavorful first piece of chicken, and then slowly make your way to your second, before struggling to finish a third or fourth piece because of the grease, but the chicken tastes so good, you know you'll dig deep into yourself to cross that finish line, because it is so worth it, grease and all, cause it's so finger-licking good!!!", "rating": 5, "date": "2016-03-22"}], "mushroom gravy": [{"excerpts": ["Here's what we ordered:\n-Biscuits and Gravy: They do have a mushroom gravy if you're vegetarian. ", "I wish they made the buscuits more buttery and put more gravy, but I guess you can't have it all, can you? ", "(6/10)\n-2 piece Fried Chicken: Nice and greasy! ", "Lots of white meat- ", "they give you a drum stick and a breast. ", "(9/10)\n-Cheese and grits: ", "Good amount of cheese. ", "Mix with a bit of syrup for optimal taste. "], "author": "Vasiliy M.", "review": "If you like good ol' Southern cookin', than you've found a place in the city to meet your needs. Little Skillet brings the tastes of the South to life in a cool ware-house-like setting.\n\nHere's what we ordered:\n-Biscuits and Gravy: They do have a mushroom gravy if you're vegetarian. I wish they made the buscuits more buttery and put more gravy, but I guess you can't have it all, can you? (6/10)\n-2 piece Fried Chicken: Nice and greasy! Lots of white meat- they give you a drum stick and a breast. (9/10)\n-Cheese and grits: Good amount of cheese. Mix with a bit of syrup for optimal taste. (8/10).\n\nOverall, this is a great place for brunch and I would definitely come back. My only complaint is that they left the door open until 1pm to welcome people in, which made the food get cold faster. Shut the door! haha, just a thought..", "rating": 4, "date": "2017-01-23"}, {"excerpts": ["They sometimes non-apologetically serve you beef gravy instead of the mushroom gravy, if you don't eat meat beware of what you get served!!"], "author": "Nikhil S.", "review": "Food is good. Not always consistent though.\nThey sometimes non-apologetically serve you beef gravy instead of the mushroom gravy, if you don't eat meat beware of what you get served!!", "rating": 2, "date": "2018-08-12"}, {"excerpts": ["We ordered the smothered fries, small mini chicken and waffle plate, 8 piece chicken and waffle with side of mushroom gravy. \n\n", "MUSHROOM GRAVY: ", "4/5 I recommend having the fries with the mushroom gravy or sausage gravy. "], "author": "Ky H.", "review": "Just ate here after work with my coworkers. \n\nTwo stars because of the awful customer service from one guy. \n\nWe ordered the smothered fries, small mini chicken and waffle plate, 8 piece chicken and waffle with side of mushroom gravy. \n\nTen minutes later, the server, KYLE, brought out a skillet of smothered fries and sliders. We told the cashier we didn't order the sliders. \n\nWhen Kyle came out with what looked like our order 30 minutes later, we told him what happened. We asked him what size our fries were since it said there were two sizes. He responds with mad attitude. \n\nHe then proceeded to take our food and walk around the whole facility finding out where to put it only to make a full circle with no one who ordered it...except us. \n\nThe lovely cashier, JENNIFER, tells Kyle that the food is ours. He says, \"they already had fries. why the f*ck would I give them more food!\" She explains we never got the rest of our order. \n\nHe put the food down and says nothing. We say nothing because why would we? \n\nI'm such an easy going person, if the food is sh*t, I don't even care, but this... not okay. \n\nJennifer was great. I asked for some gravy and mushroom because they didn't bring it out. She said it was no problem and brought it out. She had to pick up after this guy. I saw someone else get a wrong order as well and all Kyle could do was give attitude. Jennifer also brought us a piece of cake. She was extremely helpful and kind! \n\n\nThe food itself:\n\nCHICKEN: 3.5/5. It wasn't as hot as I would have liked but that's probably cause Kyle had to take a detour. \n\nMUSHROOM GRAVY: Fire. \n\nSMOTHERED FRIES: 4/5 I recommend having the fries with the mushroom gravy or sausage gravy. Much better ! \n\nBourbon cake: 4/5 nom nom nom", "rating": 2, "date": "2017-09-12"}, {"excerpts": ["I got the off-menu \"Eggs MaMahon\" per yelp recommendations, which is waffles topped with either sausage or mushroom gravy (your choice) and 2 over-easy eggs - ", "it was super indulging, savory, and flavorful. ", "However, it did get a bit heavy towards the end. ", "I would maybe recommend splitting it with someone. ", "I also tried my friend's fried chicken po'boy, which was pretty tasty, especially the cajun remoulade. "], "author": "Marie H.", "review": "Lovely place for brunch and some delicious comfort food! The entrance is off an alley and looks kinda hole-in-the-wall but the inside is actually huge (2 separate dining areas) and beautifully decorated, especially during the holiday season! We came around 1pm on a Sunday and there was plenty of seating. You order at a counter and they'll bring your food out to you wherever you find a place to sit.\n\nI got the off-menu \"Eggs MaMahon\" per yelp recommendations, which is waffles topped with either sausage or mushroom gravy (your choice) and 2 over-easy eggs - it was super indulging, savory, and flavorful. However, it did get a bit heavy towards the end. I would maybe recommend splitting it with someone. I also tried my friend's fried chicken po'boy, which was pretty tasty, especially the cajun remoulade. Chicken is inherently kind of dry though, I'd go for shrimp or fish instead. \n\nThey also have a pretty extensive brunch cocktail menu if you're in the mood. I would definitely come back to try some of these and the fried chicken/waffles! :)", "rating": 4, "date": "2015-12-22"}, {"excerpts": ["If you do order the eggs mcman ask for the sausage gravy not the mushroom gravy, never say no to meat hahaa. ", "the eggs mcman was good, portion wise good to feed two people sadly again do not get the mushroom gravy stick with the sausage gravy, I will have to come back and try other options on their menu. ", "the eggs mcman was good, portion wise good to feed two people sadly again do not get the mushroom gravy stick with the sausage gravy, I will have to come back and try other options on their menu. ", "the waffles were not heavy they were light fluffy the mushroom gravy ", "again was good ", "but I can only imagine the sausage gravy to be way better, not salty, ", "eggs mcman (get the sausage gravy), ", "** fried chicken has all the eye appeal but sadly under seasoned, ", "*", "*", "** dog with bacon wrapped that dog got a snap and is decently sized\nprice $$\nservice ", "*", "*", "** helpful staff\nambiance ", "*", "*", "** no seating here ", "there is a small area on the right to the spot where you can sit inside but on a nice day in the city just have it outside and use the concrete ramps as a table"], "author": "Clarence A.", "review": "Off menu eggs mcman!!\n\nIf you do order the eggs mcman ask for the sausage gravy not the mushroom gravy, never say no to meat hahaa. The bacon wrapped brat with chips was good, there chicken was fried to perfection but for me lacked taste, not enough seasoning, the skin was crisp the chicken portion was  huge, sadly the meat was dry in the middle, usually with chicken this size it is difficult to keep the meat juicy just my experience with fried chicken\n\nthe eggs mcman was good, portion wise good to feed two people sadly again do not get the mushroom gravy stick with the sausage gravy, I will have to come back and try other options on their menu. the waffles were not heavy they were light fluffy the mushroom gravy again was good but I can only imagine the sausage gravy to be way better, not salty, the mushrooms where sliced thin and seemed to be grilled because they were soft the kind of mushroom you can tell were grilled or steamed a bit to give it that slight elastic look\n\nthe fried chicken sadly I was not impressed mainly because there was no flavor, let me point out the pros, skin - crisp perfectly fried, that crunch man they made it perfect, but getting to the insides the meat was dry, and sadly it was not seasoned which makes the chicken on a whole not so great, maybe it is just me expecting things to be more on the salty side, again that is just my experience\n\nAlso sampled their dog wrapped in bacon, this dish I would order again as an appitizer and share with my group, that dog had a snap the bacon was crisp hell yeah I recommend there dogs!! Not spicy, semi thin slices to open up the dog and let it breath a little....YASE!!! Sample this item\n\nfood *** eggs mcman (get the sausage gravy), ** fried chicken has all the eye appeal but sadly under seasoned, **** dog with bacon wrapped that dog got a snap and is decently sized\nprice $$\nservice **** helpful staff\nambiance **** no seating here there is a small area on the right to the spot where you can sit inside but on a nice day in the city just have it outside and use the concrete ramps as a table", "rating": 3, "date": "2015-08-27"}, {"excerpts": ["I love that they offer vegetarian/mushroom gravy for their biscuits and gravy. "], "author": "Hailey H.", "review": "I'm a fan! They have some good vegetarian options which is always a plus for me. I love that they offer vegetarian/mushroom gravy for their biscuits and gravy. I've also had the veggie omelet was above average.\n\nMy friends like the chicken and waffles - if I ate meat I'd definitely try that out. One of these days I'm going to try the cheesy grits. \n\nThere is plenty of seating & it's a very relaxed/chill vibe. No wait service - you order your food up at the front and they give you a number. There is a full bar and several TVs. The mimosa I ordered with brunch was pretty cheap compared to other places ($6 I think).", "rating": 4, "date": "2015-11-20"}, {"excerpts": ["This time along with a 3 piece Chicken & Waffles, we got biscuits with mushroom gravy and pulled pork grits. ", "Man....", "why didn't I return after my first visit? ", "Shame on me. ", "Everything was so delicious! "], "author": "Stephanie K.", "review": "On my first trip here I just tried the Chicken & Waffles. I enjoyed my meal, but for some unknown reason I didn't find myself returning. I do think that their limited hours might have been a factor as they used to be closed on Sundays.\n\nHowever, it took me over two years and a craving to get me back to Little Skillet again. This time along with a 3 piece Chicken & Waffles, we got biscuits with mushroom gravy and pulled pork grits. Man....why didn't I return after my first visit? Shame on me. Everything was so delicious! The two of us devoured it all (with help from our yummy sweet tea).\n\nOverall thoughts: Great food tucked in a quaint little alley. Be prepared to sit on the loading dock to enjoy your meal. I will not be waiting 2 years to come back again.", "rating": 4, "date": "2013-08-24"}, {"excerpts": ["Ask for a side of mushroom gravy--it goes great with your waffles if syrup isn't your thing."], "author": "Daniel C.", "review": "A great hole in the wall spot for chicken & waffles. \n\nThe chicken skin was hot and super crispy, just the way I like it.  However once you dive deep into the chicken breast, it can get a tad bit dry. Luckily, their tasty homemade Jalapeno honey sauce comes to the rescue. Eating can get messy because there's no seating (we posted up along the street on the curb) so be sure to grab a bunch of napkins. Ask for a side of mushroom gravy--it goes great with your waffles if syrup isn't your thing.", "rating": 4, "date": "2013-02-06"}, {"excerpts": ["I also elected to get the sausage/cheddar grits and mushroom gravy (I come correct). \n\n"], "author": "Pete F.", "review": "My wife was given a takeout menu from here and brought it home. I found it and demanded that we come down in the morning and get the 2-piece chicken & waffles. I also elected to get the sausage/cheddar grits and mushroom gravy (I come correct). \n\nWOW. Every single bite was glorious. The chicken is real motherfunkin' fried chicken. Perfectly seasoned and juicy, perfect crunch. Shake a little chipotle tabasco and slather on some gravy and you'll have a mouthgasm. The grit could of had a bit more cheddar and sausage but they we expertly cooked and I hardly noticed.\n\nWhy does this place have to be two blocks from my work? How will I ever lose weight now?", "rating": 5, "date": "2012-07-07"}, {"excerpts": ["Went with a couple of co-workers to Farmer Brown's Little Skillet for lunch and ordered a 2 piece chicken meal with biscuits and mushroom gravy. ", "The deep friend chicken from FBLS had wonderful flavor and the best thing was that it wasn't oily. ", "I know it's cliche ", "but it was finger ", "licking good ", "and I know "], "author": "Emi H.", "review": "Holy mama shakers! I have died and gone to chicken heaven! Went with a couple of co-workers to Farmer Brown's Little Skillet for lunch and ordered a 2 piece chicken meal with biscuits and mushroom gravy. The deep friend chicken from FBLS had wonderful flavor and the best thing was that it wasn't oily. I know it's cliche but it was finger licking good and I know in some way it will ruin fried chicken for me anywhere else.\n\nThe biscuits and gravy really didn't do it for me but I partially think it was because nothing could compare to the beauty of the FBLS chicken. I also enjoyed the Sweet Tea which was a refreshing accompaniment to my lovely chicken. If you're not into sugar then you probably won't like the Sweet Tea because it's a gallon of water, tea and two gallons of sugar. My friends all ordered the pecan tarts and red velvet cupcakes but I just didn't have any room left in my tummy for dessert. I know its one of those choices I'll look back on with regret! FBLS is very busy so be sure to phone in your order before you head down there. Also know that there is no outdoor seating so you'll have to picnic ghetto style and sit on a crate.", "rating": 4, "date": "2010-02-02"}, {"excerpts": ["I finally tried their angel biscuits with herb/mushroom gravy ", "and they were great! ", "The biscuits are more like a fluffy bread than a layered biscuit, but still very good. "], "author": "Noey P.", "review": "Still as good as it gets. I finally tried their angel biscuits with herb/mushroom gravy and they were great! The biscuits are more like a fluffy bread than a layered biscuit, but still very good. I went with the same chick&waffle combo so nothing changed there. \n\nMy bf ordered a waffledog and although it was cold (which I thought was weird), he said it was good. I threw in a \"Hibiscus Drink\" that I saw on the menu and was glad I did. If you like the Hibiscus Cooler at Peet's, you'll LOVE this. It's called Prince Neville's Famous Authentic Jamaican Hibiscus Drink and has the most deliciously unique flavor. The ingredients are ginger, water, hibiscus, lime, and honey and I must say that they mesh so well together, forming a spicy, sweet, herbal flavor that is quite pleasing to the palette. I've been trying to find it elsewhere, but alas it is only available at select locations in SF. Darn! \n\nI love this place. Oh and  if you're a coffee lover, Cento is next door and brews Blue Bottle.", "rating": 5, "date": "2009-11-04"}, {"excerpts": ["I got the two piece chicken with waffles and mushroom gravy on the side, because I love me some mushrooms. ", "The mushroom gravy was delicious! "], "author": "Angeline P.", "review": "Everyone claims that Roscoe's does the best chicken and waffles, Roscoe's is the original, someone out there owes Roscoe's their firstborn son, etc etc. Why have few people caught on and realized that Roscoe's uses their waffles and syrup to compensate for dry chicken? Their chicken isn't juicy at all, and sometimes it's even burnt in places! Disgusting.\n\nEnter Farmerbrown's Little Skillet (or Little Brown's Farmer Skillet, or Farmer Slice Home Skillet, all of which I have used to refer to this place, since I can't ever seem to remember what it's called). This chicken is not dry at all. Not only is it moist and juicy, but man is it delicious! I got the two piece chicken with waffles and mushroom gravy on the side, because I love me some mushrooms. The mushroom gravy was delicious! It was the perfect thing to dip my chicken into, and something I didn't realize until just then. \n\nSo the place doesn't have seating, because it's supposed to be a take-out place that caters to the lunch crowd, and they assume you are taking the chicken and goodness back to your place of employment. It's not a big deal if you are willing to sit on some concrete for some goodness (and street cred). Four stars.", "rating": 4, "date": "2009-08-04"}, {"excerpts": ["Chicken + Waffle + Mushroom gravy + Maple syrup all in one big mouthful = FLAVOR EXPLOSION FTW!  \n\n", "But my friend and I each paid $12 for a ton of food: 2 pc chix/waffles each, biscuits with jam, biscuits with mushroom gravy, and grits with sausage and cheddar.  ", "A bit expensive for lunch, but worth it considering how much food we got. \n", "+ This alleyway was so sunny, and the location is cute.  ", "There's a perfect concrete ledge across this hole-in-the-wall where everyone sits and enjoys their meal.  ", "We ordered biscuits with jam, but for some reason, they also gave us biscuits with mushroom gravy.  ", "The biscuits themselves were nothing special; it was just mediocre bread.  ", "The mushroom gravy was flavorful, but it's really still not worth ordering the biscuits just for the gravy.  ", "Just order gravy on the side if you want.\n", "- The waffle was too soft and soggy.  "], "author": "Vivian C.", "review": "This was a Happy Meal.\n\nI'd been wanting to try chicken and waffles for ages and finally got my chance today.  \n\nI loved it.  Absolutely loved it.  \n\nChicken + Waffle + Mushroom gravy + Maple syrup all in one big mouthful = FLAVOR EXPLOSION FTW!  \n\nIt's like when Remy from Ratatouille has flavor explosion fireworks when he eats a mushroom and some cheese together!  That was my experience!\n\nOkay, aite, here we goes again:\n\nTHE YAY:\n+ The chicken was spectacular.  Succulent, crispy, hot, juicy pieces of meat.  Both the dark and white meats were spectacular.  I am picky with fried chicken, it being one of my favorite foods, and this was cooked well.  The perfect combination of crispy skin, juicy meat, and flavorful herbs.\n+ We also got the grits with Andouille sausage and cheddar.  The grits themselves were alright, but the sausage was perfect.  Generous chunks scattered all over the top.  Makes for a very hearty meal.  \n+ They give you big, generous portions for everything, which I appreciated.\n+ It's a bit pricey for chix and waffles, which I hear should be cheaper.  But my friend and I each paid $12 for a ton of food: 2 pc chix/waffles each, biscuits with jam, biscuits with mushroom gravy, and grits with sausage and cheddar.  A bit expensive for lunch, but worth it considering how much food we got. \n+ This alleyway was so sunny, and the location is cute.  There's a perfect concrete ledge across this hole-in-the-wall where everyone sits and enjoys their meal.  Makes for a very casual and happy meal.  \n\nTHE NAY:\n- I wouldn't suggest the biscuits.  We ordered biscuits with jam, but for some reason, they also gave us biscuits with mushroom gravy.  The biscuits themselves were nothing special; it was just mediocre bread.  The mushroom gravy was flavorful, but it's really still not worth ordering the biscuits just for the gravy.  Just order gravy on the side if you want.\n- The waffle was too soft and soggy.  I prefer crispy, thick waffles.  \n\nOtherwise, it was a hearty and delicious meal.  Everything worked so well together.  I love sweet/salty combinations all in one bite, so this was perfect.  Tip: If you call in on your way there, you won't have to wait in line.  We found this very useful; we called as soon as we jumped on the bus to this place, and when we arrived at the storefront 15 minutes later, they had our order all ready!  Saves a lot of time for fellow working folks!\n\nOn a sunny day,\nIn an alleyway, \nThis made my day.", "rating": 4, "date": "2009-08-27"}, {"excerpts": ["The mushroom gravy was pretty good too. ", "It's good stick-to-your-ribs kind of food"], "author": "Eugene Z.", "review": "Came here after seeing their chicken and waffles on 7x7 and they definitely did not disappoint. The chicken skin was crunchy while the meat was o so juicy. The waffle was so fluffy on the inside, crisp on the outside, and had a bit of tang from what I think is buttermilk. The mushroom gravy was pretty good too. It's good stick-to-your-ribs kind of food", "rating": 5, "date": "2012-03-13"}, {"excerpts": ["Breakfast is mostly just biscuits (with mushroom gravy, sausage gravy, or butter and jam) or a waffle and lunch is primarily fried chicken (with or without waffles), pulled pork, or a couple of other options. ", "Everything is fresh and homemade at cheap prices which is nice. ", "I got the biscuits and sausage gravy with eggs for breakfast ", "and I thought it was ok ", "but it was definitely not traditional. ", "The gravy was quite thin and there was some sort of seasoning in it that was very reminiscent of some Thai like flavors that I couldn't place. ", "I wouldn't say that it was amazing ", "but it was certainly the best breakfast I've ever gotten from a window before and for under $7 I'd say it was worth it."], "author": "Matt E.", "review": "3.5 stars...\n\nThe little skillet is just a couple of windows down in a shady area of town with a small menu of southern specialties. One window is for the beverages (mostly coffee) and the other is for the food. Luckily they have a bench and a long concrete platform across the street to sit and eat if you're not taking it elsewhere (they provide seat cushions too if you want). Breakfast is mostly just biscuits (with mushroom gravy, sausage gravy, or butter and jam) or a waffle and lunch is primarily fried chicken (with or without waffles), pulled pork, or a couple of other options. Everything is fresh and homemade at cheap prices which is nice. I got the biscuits and sausage gravy with eggs for breakfast and I thought it was ok but it was definitely not traditional. The gravy was quite thin and there was some sort of seasoning in it that was very reminiscent of some Thai like flavors that I couldn't place. I wouldn't say that it was amazing but it was certainly the best breakfast I've ever gotten from a window before and for under $7 I'd say it was worth it.", "rating": 4, "date": "2010-10-08"}, {"excerpts": ["The mushroom gravy is a good addition to the chicken as well. "], "author": "Nette A.", "review": "Farmer Brown's Little Skillet is way better than the Chicken n Waffles from 3rd! The Chicken is always so juicy and tasty never dry..  The mushroom gravy is a good addition to the chicken as well. THe waffles are pretty good with powdered sugar.. \n\nThere isn't anywhere to sit so if you are planning on checkin this spot out know that you're takin it to go.. Try to get there a little early and beat the lunch hour rush.", "rating": 4, "date": "2009-11-20"}, {"excerpts": ["1 angel biscuits w/ mushroom gravy (mine)\n    1 mini pecan pie (mine)\n+  1 sweet tea (mine)\n----------------------------\n    around $25. ", "And yes, I'm one greedy bitch. ", "But I shared my food! ="], "author": "B B.", "review": "Oh Mah Gaaaaaawd! I think I'm in love!\n\nMy boyfriend and I came here for the chicken and waffles. But the fat ass in me decided to order some additional stuff. I couldn't help it. Everything sounded so delicious! This is what we...err... * I * ordered: \n\n    2 orders of 2 pc chicken + waffles (one for me and BF)\n    1 angel biscuits w/ mushroom gravy (mine)\n    1 mini pecan pie (mine)\n+  1 sweet tea (mine)\n----------------------------\n    around $25. And yes, I'm one greedy bitch. But I shared my food! =P \n\nI heard about this place while reading some local SF magazine at a hair salon. The article had me at chicken and waffles. It was my very first time eating chicken and waffles. And- Oh. My. Gawd! As I was telling fellow Yelper Darryl P... That stuff was Bukkake status, yo!  Highly recommended! You can thank me later! =)\n\nEverything from the chicken to the pecan pie tasted awesome! Chicken was cooked perfectly. Not too much batter and it was pretty juicy.  The biscuits were nice and fluffy. The gravy was very good and had a nice flavor. The sweet tea was very refreshing and not too sweet. The pecan pie was very yummy. A little too sticky but thats only cause I have braces. My only complaint was the waffle. I just wish it was a tad bigger! But other than that, it was delicious! I want more!\n\nNow that my chicken and waffle cherry has been popped, I think I'm ready to try their waffle dog. I follow them on Twitter. Yes, I'm such a dork. But they actually let you know what type of specials they have for the day.\n\nBTW, no seats here. Just a couple benches, a dock, and the curb. Next time I'm bringing my A's seat cushion. Oh and just an FYI, we came here around 2pm on a Saturday. There was no line. Its probably best to avoid this place during lunch time. Just sayin. Oh and this is some good eats to take to a Giants game. I mean, thats if you're a Giants fan. Its soooo close to the ball park. Maybe when the A's are in town I'll take it to the game. =)\n\nI'll definitely be back. But first, I have to burn off all these calories. Yadadamean.", "rating": 5, "date": "2009-09-28"}, {"excerpts": ["A vegetarian coworker turned me on to the biscuits and gravy with mushroom gravy and two scrambled eggs. ", "After one bite, I thought, who needs chicken? ", "Super rich but really delicious ", "and if you have restraint (I said *IF*) ", "you can easily get away with eating half and having the rest later. ", "If they have em that day, snatch up a brown sugar black pepper biscuit. ", "or 3 or 4 of em. ", "just sayin."], "author": "Dama J.", "review": "Turns out I should have explored the menu more. A vegetarian coworker turned me on to the biscuits and gravy with mushroom gravy and two scrambled eggs. After one bite, I thought, who needs chicken? Super rich but really delicious and if you have restraint (I said *IF*) you can easily get away with eating half and having the rest later. If they have em that day, snatch up a brown sugar black pepper biscuit. or 3 or 4 of em. just sayin.", "rating": 4, "date": "2012-03-09"}, {"excerpts": ["Luckily, I had the foresight to order a $1 side of mushroom gravy. "], "author": "Jessica T.", "review": "Well, there we were. Three girls on our lunch break: wearing suits and squatting on milk crates in a sunny alleyway while furtively eating our friend chicken, glancing around nervously every time a car passed by. It wasn't exactly a comfortable dining experience, but was the food worth it? Heck yeah.\n\nI got a 2-piece + side lunch box. The fried chicken was scrumptious: hot, juicy, crispy, and well-seasoned. Not too greasy, and not too fatty. In my opinion, it was just right. At Christina C.'s insistence, I shook some add'l seasoning on, for flavor enhancement. I chose macaroni salad as my side, on the advice of a previous yelper. The macaroni salad is lovely: pesto-y, crispy veggie-y, non-mayonnaise-y goodness. It's got a nice vinegar bite. The biscuit itself was the only thing I wasn't crazy for- alone, it was only \"fine\". Luckily, I had the foresight to order a $1 side of mushroom gravy. One dunk, and that so-so biscuit became so-good! \n\nCheck this place out, it's good eats. It's also quite an experience eating fried chicken with your fingers while hunkered down on a milk crate, low bench, curbside, or loading dock. The food is so good that your self-consciousness over nibbling at food in an alleyway like a common street rat will just disappear in a fog of chicken fried heaven.", "rating": 4, "date": "2009-12-02"}, {"excerpts": ["An extra $1 yielded some mushroom gravy which was also awesome, though it seems like a fancy option. ", "Bare-bones chicken is better. ", "The sausage gravy, which my cousin had, was not as good with the chicken (as was the mushroom gravy), though it had a really nice flavor itself. ", "All in all, the whole experience was goddamn incredible - I will definitely be coming back as long as this place remains open."], "author": "Shelby C.", "review": "A while ago I vowed that I wouldn't ever give 5 stars - and if I did (which I am susceptible to, since I am only human and there are tons of amazing food to be had), it would be sparingly. Thus is the reason for the four stars given to Little Skillet. Another reason would be because there just isn't any seating except for a loading dock. While that's fine and fresh by me, it really dashed my hopes of having some crazy-good fried chicken on rainy days (and I guess when there are trucks in the loading dock).\n\nON to the good. I heard about this literal hole-in-the-wall in San Francisco magazine, then did some research on Yelp and found it to be quite popular. After looking at the menu and reviews, I had this innate yearning to get out of the house and do whatever it took to get there, but decided to go the next day. When we got there, it took a little effort to find parking, 'cause it's right next to AT&T Park as well as in tons of business locales. BRING QUARTERS - it's gonna be meter parking and the lines are long here. We waited about 10-15 minutes in line but when we got the the window, the people were friendly and helpful, and in no way hurrying (as is often the case for places that are busy like this). I ordered the three piece chicken + waffle but forgot to tell them what I wanted, which I was kinda bummed about. The wait was not long at all. Oh - they also have Dr. Pepper in bottles. \n\nThe chicken was incredible though - as in OUT OF THIS WORLD good, probably some of the best chicken I've ever had. The batter was thick and crunchy, perfect with the moist chicken. Incredible. An extra $1 yielded some mushroom gravy which was also awesome, though it seems like a fancy option. Bare-bones chicken is better. The sausage gravy, which my cousin had, was not as good with the chicken (as was the mushroom gravy), though it had a really nice flavor itself. All in all, the whole experience was goddamn incredible - I will definitely be coming back as long as this place remains open.", "rating": 4, "date": "2009-08-01"}, {"excerpts": ["so if you like gravy with your chicken/biscuit/waffle go with the mushroom gravy, it has a more creamy texture.\n\n"], "author": "Myron J.", "review": "When you think of hole in the wall places you don't take it literally but this is an actual HOLE in the WALL!!!\n\nThe FRIED CHICKEN here is AMAZING!!! I'm hooked! It is finger-lickin' good! I got the 3 piece+Waffle with Sausage Gravy. I asked for thigh and breast and got just that. The food was hot!!! \n\nThe waffle was soo soo dry, needed some syrup but didn't want to pay $1 for some syrup. The biscuits were not that great. I hear it is better at Brenda's. The sausage gravy made everything taste funny so if you like gravy with your chicken/biscuit/waffle go with the mushroom gravy, it has a more creamy texture.\n\nThere is seating on the loading dock across the alley and a bench or two. \n\nThe service is fast and the line does get quite long. Parking is meter only... and CASH ONLY!\n\nBring wet napkins and maybe a packet of syrup :D", "rating": 4, "date": "2009-07-31"}, {"excerpts": ["- Tried the mushroom gravy side - really tasty.\n", "- Lemonade - WOW - its really sour!!!!!\n"], "author": "X L.", "review": "Planning to gain weight in my quest to complete a Bay Area Chicken & Waffles runoff!\n\nFinally tried this place. Have to say it was pretty good. It's basically a take out place (don't expect to eat in). Really liked the chicken! \n\nPros\n- Really tasty chicken w/great flavor & done just right. Wish I had ordered the 3 piece. \n- Waffle were OK - I should have eaten right away as mine was a little cold. Also 2pc $7 meal only had 1 waffle (see photos) - wish I had more.\n- Price was about right - but wished my chicken pieces were just a little larger.\n- Tried the mushroom gravy side - really tasty.\n- Lemonade - WOW - its really sour!!!!!\n- Fast service\n\nCons\n- Street parking only - can be hard to find a space\n- Street seating (they have a loading dock across the alley/street that many folks were eating).\n\nReturn Visit\n- Next time I'm in SF craving waffles", "rating": 4, "date": "2010-01-17"}, {"excerpts": ["Get yours with the mushroom gravy!! ", "Trust me!!"], "author": "Mertani G.", "review": "A great hole in a wall place for chicken and waffles! You order your food and can eat it outside around the area like other people are doing, or you can take it home. My husband and i were craving a good place for chicken and waffles after going to roscoe's during our disneyland trip. Get yours with the mushroom gravy!! Trust me!!", "rating": 4, "date": "2012-08-12"}, {"excerpts": ["She had the waffle + 2 pieces of chicken with a side of maple syrup, and I ordered the 2 piece chicken box with an angel biscuit,  french fries and mushroom gravy. \n\n"], "author": "Sharand N.", "review": "Nerda M. took me here for my birthday lunch today, bless her heart. We called in our order ahead of time to skip the line and it was ready at 12:15 - exactly the time we told them we'd swing by.\n\nShe had the waffle + 2 pieces of chicken with a side of maple syrup, and I ordered the 2 piece chicken box with an angel biscuit,  french fries and mushroom gravy. \n\nWe sat out on the concrete picnic-style, with the sun warming us and for quite awhile there were no sounds but that of two mouths busy gnawing the chicken down to the bones and occasionally moaning in ecstasy. \n\nThe fried chicken was exquisite: perfectly fried, tender, moist, and finger-lickin', frickkin' delicious! \n\nLittle Skillet got everything else exactly right too & they have a friendly & hip staff to boot. \n\nI can't wait to go back to have more chicken & try their shrimp po'boy!", "rating": 5, "date": "2009-08-05"}, {"excerpts": ["I added in some mushroom gravy just to round things out.\n\n", "Spice it up with some mushroom gravy and don't forget to add in the waffle and syrup!!!"], "author": "Brian T.", "review": "Yet another place that was recommended by a co-worker.\n\nAlthough I've only been here once so far, I know for sure I'll be coming back for more.  The place is located in what appears to be an alley - yes an alley.  If you come around noon though you won't have a difficult time finding the place b/c there will be a long line (usually about 10 deep) in font of a pick up window.  Don't worry though, b/c the line is amazingly fast.\n\nTheir menu is simple...they have fried chicken, waffles and po'boys.. ohh and some amazing biscuits (more on that later).  My coworker raved about the fried chicken and I was in the mood for some waffles (go figure) so that's what I ordered.  I added in some mushroom gravy just to round things out.\n\nAfter ordering my food I stepped to the side and waited.  After about 5 minutes I heard my name called from the window which is lighting fast (especially during lunchtime).  While waiting though, I was able to admire the 20 or so people sitting across the street on the \"dock\" taking in the sun and enjoying their food.  It had a neighbor hood vibe which is cool.\n\nOkay...so on to the food.  I must admit. I eat food in sections.  Yes, you heard it, \"sections\".  That means I eat the appetizer first, the sides next and then the main course.  And the most important rule, is that I don't mix these things...EVER.  So following these rules, I ate one piece of chicken (which was okay) and then had a bite of the waffle (which was okay too).  I was like man..there has to be more to this b/c ppl were lining up to get their food.  So what did I do...I threw the rules out the window.  I put the waffle on the plate, poured some syrup on it then put a piece of chicken on top of the waffle and poured the gravy right on top.  By now other people in the office were curious and wanted to know how it would taste.  So I dove right in.  I got a little piece of everything and I must say the combination is OFF DA HOOK!!!!!!! I was so smitten by the taste that I turned to my coworker and told him he had to construct his food the same way.  I was raving about the food and couldn't get enough. I wanted to go back after work to and get some chicken and waffles for dinner.  While enjoying this amazing combination I was offered a biscuit.  I bit into the biscuit and it had this biscuit like texture but also reminded me of a roll.  I was confused at first but with each bite I fell in love with the satisfaction of having both a biscuit and a roll at the same time.  Its definitely something that I've never had before.\n\nSo...the bottom line.  This place is great and the prices are perfect.  The service is quick and I just love the fact that you order out of a window and there are people hanging out at the dock.  I'll have to give this place four stars b/c they don't take credit cards and the chicken by itself is okay.  Spice it up with some mushroom gravy and don't forget to add in the waffle and syrup!!!", "rating": 4, "date": "2009-07-10"}, {"excerpts": ["Whenever I come here, I always get the mushroom gravy to compliment the chicken and also, if money permits, get the andouille sausage angel biscuit. ", "My only gripes is the cars that are driving right by you while eating on milk crates."], "author": "Rich L.", "review": "Hands down the best chicken & waffle in San Francisco. It is literally a hole in the wall. Whenever I come here, I always get the mushroom gravy to compliment the chicken and also, if money permits, get the andouille sausage angel biscuit. My only gripes is the cars that are driving right by you while eating on milk crates.", "rating": 4, "date": "2010-01-18"}, {"excerpts": ["And your mushroom gravy and maple syrup all drenched over everything, yikes!  ", "Coleslaw is my fave too!  ", "And don't forget about the homemade lemonade!"], "author": "Jen C.", "review": "Oh Little Skillet How I Love Thee!  You have the best tasting Chicken and Waffles I have had!  Roscoe's Chicken and Waffles in LA no longer compares.  I love your crispy light skin and your juicy tasty meat, and your waffles are so fluffy yet crisp! And your mushroom gravy and maple syrup all drenched over everything, yikes!  Coleslaw is my fave too!  And don't forget about the homemade lemonade!", "rating": 5, "date": "2010-02-06"}, {"excerpts": ["i also got the biscuit and mushroom gravy, which weren't much better."], "author": "Chao L.", "review": "i walked 30 min from my office to this place but only got some hairy fried chicken that were way too salty, the meat wasn't tender nor juicy and the batter wasn't crispy. i also got the biscuit and mushroom gravy, which weren't much better.", "rating": 2, "date": "2010-11-02"}, {"excerpts": ["Didn't anyone else notice that the herb-mushroom gravy tasted exactly like Campbell's cream of mushroom soup?? ", "The waffle wasn't that great either. ", "I will definitely not go back to this place"], "author": "Eduardo I.", "review": "i heard about Little Skillet from a friend..i have to say that I was expecting a lot more after seeing the line of people waiting at the place. The food was cheap.which is a plus, but the chicken was just ok. The gravy was horrible!! Didn't anyone else notice that the herb-mushroom gravy tasted exactly like Campbell's cream of mushroom soup?? The waffle wasn't that great either. I will definitely not go back to this place", "rating": 2, "date": "2009-08-22"}], "sausage gravy": [{"excerpts": ["Always order the chicken n waffles and also the biscuits with either mushroom or sausage gravy. "], "author": "Mitzi G.", "review": "This place can be as casual as a drive by window or a Sunday brunch with a full bar and brass band inside. \n\nAlways order the chicken n waffles and also the biscuits with either mushroom or sausage gravy. Add on cheesy grits and when you feel your arteries are about to burst, wash it down with a good cocktail or bottomless mango mimosa.\n\nI came here during a New Year's all-you-can-eat Brunch. It was fantastic! They recreated that festive New Orleans atmosphere where good food and music go hand in hand.", "rating": 5, "date": "2017-04-29"}, {"excerpts": ["For our party of 6 (4 adults + 2 kids), we ordered the smothered fries (fries covered sausage gravy, topped with cheddar, sour cream and green onions), crispy fried chicken with waffles, and skillet hot wings with BBQ sauce. ", "The pieces of chicken were HUGE - probably almost double the size of the ones you would find at KFC. ", "They were perfectly fried and didn't seem too greasy. ", "Then again, I only ate one piece ", "so I didn't feel too disgusting afterwards. "], "author": "Mel T.", "review": "Apparently, Little Skillet goes by a lot of different names. You'll see Little Skillet, Farmer Brown's, Brown's Little Skillet, or really just any combination of those. Just know that it's located on 360 Ritch St., inside of Victory Hall bar. You order at the counter, grab a table, and pick up your food once it's ready.\n\nFor a Saturday from 6-7, the place wasn't crowded. Lines start forming at around 8. For our party of 6 (4 adults + 2 kids), we ordered the smothered fries (fries covered sausage gravy, topped with cheddar, sour cream and green onions), crispy fried chicken with waffles, and skillet hot wings with BBQ sauce. The pieces of chicken were HUGE - probably almost double the size of the ones you would find at KFC. They were perfectly fried and didn't seem too greasy. Then again, I only ate one piece so I didn't feel too disgusting afterwards. The wings were also pretty good, but just to warn you - their BBQ sauce is actually pretty spicy.\n\nI don't think this is the best fried chicken I've had but it's definitely worth a try if you're in the area.", "rating": 3, "date": "2017-03-02"}, {"excerpts": ["Eggs McMahon waffles eggs sausage gravy mmm, some of best fried chicken (n waffles) in city"], "author": "Syrah F.", "review": "Eggs McMahon waffles eggs sausage gravy mmm, some of best fried chicken (n waffles) in city", "rating": 4, "date": "2018-06-22"}, {"excerpts": ["4/5 I recommend having the fries with the mushroom gravy or sausage gravy. "], "author": "Ky H.", "review": "Just ate here after work with my coworkers. \n\nTwo stars because of the awful customer service from one guy. \n\nWe ordered the smothered fries, small mini chicken and waffle plate, 8 piece chicken and waffle with side of mushroom gravy. \n\nTen minutes later, the server, KYLE, brought out a skillet of smothered fries and sliders. We told the cashier we didn't order the sliders. \n\nWhen Kyle came out with what looked like our order 30 minutes later, we told him what happened. We asked him what size our fries were since it said there were two sizes. He responds with mad attitude. \n\nHe then proceeded to take our food and walk around the whole facility finding out where to put it only to make a full circle with no one who ordered it...except us. \n\nThe lovely cashier, JENNIFER, tells Kyle that the food is ours. He says, \"they already had fries. why the f*ck would I give them more food!\" She explains we never got the rest of our order. \n\nHe put the food down and says nothing. We say nothing because why would we? \n\nI'm such an easy going person, if the food is sh*t, I don't even care, but this... not okay. \n\nJennifer was great. I asked for some gravy and mushroom because they didn't bring it out. She said it was no problem and brought it out. She had to pick up after this guy. I saw someone else get a wrong order as well and all Kyle could do was give attitude. Jennifer also brought us a piece of cake. She was extremely helpful and kind! \n\n\nThe food itself:\n\nCHICKEN: 3.5/5. It wasn't as hot as I would have liked but that's probably cause Kyle had to take a detour. \n\nMUSHROOM GRAVY: Fire. \n\nSMOTHERED FRIES: 4/5 I recommend having the fries with the mushroom gravy or sausage gravy. Much better ! \n\nBourbon cake: 4/5 nom nom nom", "rating": 2, "date": "2017-09-12"}, {"excerpts": ["The biscuits are burned and dry (see pics),  and the sausage gravy has more chunks of flour than sausage!  ", "If you cant even make the gravy without flour lumps, find another job.   ", "I paid for a pathetic and worthless attempt at this dish...and for 9 bucks?"], "author": "Evan M.", "review": "Avoid.  Biscuits and gravy are open to interpretation.  It is one thing for me to not enjoy a particular style or seasoning of the gravy...but bad is just, well, bad.  I'm a southerner who transplanted here 5 years ago, and I should know better by now to think anyone will make me happy with this dish.   The biscuits are burned and dry (see pics),  and the sausage gravy has more chunks of flour than sausage!  If you cant even make the gravy without flour lumps, find another job.   I paid for a pathetic and worthless attempt at this dish...and for 9 bucks?", "rating": 1, "date": "2017-11-10"}, {"excerpts": ["For me I got the three piece with waffles and biscuits and sausage gravy which I enjoyed a lot. ", "The chicken had a nice crisp skin with a good amount of flavor, the meat was juicy but lacked flavor maybe if it was a bit more like salted or marinated, it would've been superb. ", "My favorite was the waffles, it was crispy and had a fluffy center which was amazing! ", "the gravy and biscuits were okay ", "but the gravy was really good creamy and flavorful. ", "We also got the beignets ", "but I didn't really like it ", "because it had like a thick dinner roll like texture. ", "Even though it was counter style ordering the food runners were really nice. ", "Overall this is a nice little brunch spot to enjoy some yummy chicken and waffle."], "author": "Maybeline C.", "review": "A little gem, hidden in an alley street! A perfect casual brunch/lunch place with a nice little outdoor seating area, there was also inside seating but we chose to sit outside because it was a bit more quiet compared to the inside. We came as a party of four, we all go the fried chicken with sides. For me I got the three piece with waffles and biscuits and sausage gravy which I enjoyed a lot. The chicken had a nice crisp skin with a good amount of flavor, the meat was juicy but lacked flavor maybe if it was a bit more like salted or marinated, it would've been superb. My favorite was the waffles, it was crispy and had a fluffy center which was amazing! the gravy and biscuits were okay but the gravy was really good creamy and flavorful. We also got the beignets but I didn't really like it because it had like a thick dinner roll like texture. Even though it was counter style ordering the food runners were really nice. Overall this is a nice little brunch spot to enjoy some yummy chicken and waffle.", "rating": 4, "date": "2018-01-09"}, {"excerpts": ["Pulled pork benedict - 4/5\nBiscuits and sausage gravy - 2/5\n\nOverall, \"A-OK."], "author": "Mark O.", "review": "Brunch review. \n\nSkillet pancake - 3/5\nPulled pork benedict - 4/5\nBiscuits and sausage gravy - 2/5\n\nOverall, \"A-OK.\"", "rating": 3, "date": "2015-11-08"}, {"excerpts": ["Two waffles, so buttery and lightly delicious, a little too cooked over easy eggs, and your choice of mushroom or sausage gravy. ", "We're huge fungi fans ", "so we went with mushrooms. ", "I wish there was more because it is delicious. ", "We also got the 3 piece chicken and waffles. ", "Again waffles were, in the previously stated condition, amazing. ", "Fried chicken was moist, crunchy, and I tried to put it down, but I couldn't due to the urge to shove it in my face again before I had taken a full breath. ", "We will eat there every time we are in the city. ", "It was one of the best breakfasts I've ever had. ", "So funny. ", "We were actually going somewhere else that morning, but it was closed on Sundays. ", "The food gods, by that I mean Adam Richmond's show Man Finds Food, stepped in and led us here. ", "Praise the lard! "], "author": "Joe E.", "review": "I really hate paying big bucks for breakfast. It always tastes like I could have done it better at home and for a third of the price. It's really the only meal I'll avoid going out to eat at all costs. But when you're away from home, waking up after a little heavy drinking, and need some fuel for the trip home, paying top dollar for bacon and eggs was unavoidable. Little Skillet, you rocked my breakfast world.\n\nEggs McMahohn was off the menu and awesome. Two waffles, so buttery and lightly delicious, a little too cooked over easy eggs, and your choice of mushroom or sausage gravy. We're huge fungi fans so we went with mushrooms. I wish there was more because it is delicious. We also got the 3 piece chicken and waffles. Again waffles were, in the previously stated condition, amazing. Fried chicken was moist, crunchy, and I tried to put it down, but I couldn't due to the urge to shove it in my face again before I had taken a full breath. We will eat there every time we are in the city. It was one of the best breakfasts I've ever had. So funny. We were actually going somewhere else that morning, but it was closed on Sundays. The food gods, by that I mean Adam Richmond's show Man Finds Food, stepped in and led us here. Praise the lard! (no lard was involved in the meal, I think).\n\nLittle Skillet shares a space with Victory Hall & Parlor. It is an amazing bar that I will review in the near future. It was also on the amazing level of Little Skillet. It's like a match made in heaven.", "rating": 5, "date": "2015-06-02"}, {"excerpts": ["The smothered fries was amazing with sausage gravy."], "author": "Jeffrey S.", "review": "This place is pretty darn good. We had order their signature fried chicken. It was delicious, juicy and light on the batter. The mac and cheese was decent. The smothered fries was amazing with sausage gravy.", "rating": 5, "date": "2017-08-12"}, {"excerpts": ["If you do order the eggs mcman ask for the sausage gravy not the mushroom gravy, never say no to meat hahaa. ", "the eggs mcman was good, portion wise good to feed two people sadly again do not get the mushroom gravy stick with the sausage gravy, I will have to come back and try other options on their menu. ", "the eggs mcman was good, portion wise good to feed two people sadly again do not get the mushroom gravy stick with the sausage gravy, I will have to come back and try other options on their menu. ", "the waffles were not heavy they were light fluffy the mushroom gravy ", "again was good ", "but I can only imagine the sausage gravy to be way better, not salty, ", "eggs mcman (get the sausage gravy), ", "** fried chicken has all the eye appeal but sadly under seasoned, ", "*", "*", "** dog with bacon wrapped that dog got a snap and is decently sized\nprice $$\nservice ", "*", "*", "** helpful staff\nambiance ", "*", "*", "** no seating here ", "there is a small area on the right to the spot where you can sit inside but on a nice day in the city just have it outside and use the concrete ramps as a table"], "author": "Clarence A.", "review": "Off menu eggs mcman!!\n\nIf you do order the eggs mcman ask for the sausage gravy not the mushroom gravy, never say no to meat hahaa. The bacon wrapped brat with chips was good, there chicken was fried to perfection but for me lacked taste, not enough seasoning, the skin was crisp the chicken portion was  huge, sadly the meat was dry in the middle, usually with chicken this size it is difficult to keep the meat juicy just my experience with fried chicken\n\nthe eggs mcman was good, portion wise good to feed two people sadly again do not get the mushroom gravy stick with the sausage gravy, I will have to come back and try other options on their menu. the waffles were not heavy they were light fluffy the mushroom gravy again was good but I can only imagine the sausage gravy to be way better, not salty, the mushrooms where sliced thin and seemed to be grilled because they were soft the kind of mushroom you can tell were grilled or steamed a bit to give it that slight elastic look\n\nthe fried chicken sadly I was not impressed mainly because there was no flavor, let me point out the pros, skin - crisp perfectly fried, that crunch man they made it perfect, but getting to the insides the meat was dry, and sadly it was not seasoned which makes the chicken on a whole not so great, maybe it is just me expecting things to be more on the salty side, again that is just my experience\n\nAlso sampled their dog wrapped in bacon, this dish I would order again as an appitizer and share with my group, that dog had a snap the bacon was crisp hell yeah I recommend there dogs!! Not spicy, semi thin slices to open up the dog and let it breath a little....YASE!!! Sample this item\n\nfood *** eggs mcman (get the sausage gravy), ** fried chicken has all the eye appeal but sadly under seasoned, **** dog with bacon wrapped that dog got a snap and is decently sized\nprice $$\nservice **** helpful staff\nambiance **** no seating here there is a small area on the right to the spot where you can sit inside but on a nice day in the city just have it outside and use the concrete ramps as a table", "rating": 3, "date": "2015-08-27"}, {"excerpts": ["we ordered the bacon wrapped hot dog and a waffle, the po' boy sandwich with cornmeal shrimp, and the biscuits w sausage gravy. \n\n", "Five stars on the biscuits w sausage gravy", ", I would definitely have those again. "], "author": "JC C.", "review": "Not sure what all the hype is about. Between  a friend and myself we ordered the bacon wrapped hot dog and a waffle, the po' boy sandwich with cornmeal shrimp, and the biscuits w sausage gravy. \n\nFive stars on the biscuits w sausage gravy, I would definitely have those again. It's everything you'd want it to be, creamy gravy, flakey biscuit.\n\nEverything else lacked luster without the hot sauce. I would go back for the biscuit but if I return it's likely just be for the beer.", "rating": 3, "date": "2015-06-26"}, {"excerpts": ["I would much rather have traded it for his\nBiscuits and Gravy - which had awesome flavor to it (we tried the sausage gravy). "], "author": "Miriam W.", "review": "I'm really kind of sorry I'm within walking distance of this place for brunch. I'm going to die of a heart attack. \n\nFried Chicken - Amazing, well fried, great flavor. Also they have this amazing blackstrap molasses syrup that's got a rich depth of flavor. Waffles are good, but the chicken is the star here.\nPulled Pork Sliders - These are arguably better than the fried chicken, not even joking\nSkillet Pancake - if you like sweet and pancakey for breakfast, this is your thing. This is not for me, but my husband loved it. I would much rather have traded it for his\nBiscuits and Gravy - which had awesome flavor to it (we tried the sausage gravy). A+++. \n\nAs a added caloric bonus, they have angel biscuits by the counter that are topped with black pepper and brown sugar. These things are like crack.", "rating": 4, "date": "2015-03-15"}, {"excerpts": ["Waffles could be crisper, grits were ok, sausage gravy needed a bit more salt, but these were minor things. ", "Ambiance rustic, good for groups and babies. ", "We'll be back."], "author": "Bruce C.", "review": "Finally got around to trying this place for dinner. Fried chicken is really good -- juicy, crispy, very nicely cooked,  and the ribs are superlative -- meaty, tender, nice sauce, in my book the best ribs that I've had lately. Waffles could be crisper, grits were ok, sausage gravy needed a bit more salt, but these were minor things. Ambiance rustic, good for groups and babies. We'll be back.", "rating": 4, "date": "2016-04-03"}, {"excerpts": ["Herb mushroom or sausage gravy. ", "Waffle + powdered sugar. ", "Chicken + gravy + hot sauce. "], "author": "Marti L.", "review": "Yay I'm 2000 and late as always. Had this place bookmarked before it got super hot on Yelp. Finally finally made our way over, and definitely was not disappointed!\n\n2 Pieces of Chicken + Waffle: (http://www.yelp.com/biz_photos/SdI0uCelI4ihCwGyMLv03A?select=O5eAkfuticejZioNDJ3Ejg) Delicious! Freshly made hot waffle sprinkled with powdered sugar. Crispy juicy fried chicken without that layer of fat under its skin. Neither of us was a fan of the syrup. Tasted like honey. But definitely recommend springing that extra dollar for their gravy. And my oh my, can't go wrong with either one of them. Herb mushroom or sausage gravy. Waffle + powdered sugar. Chicken + gravy + hot sauce. Deadly combo combos!\n\nMy Foodie-In-Crime and I must've been looking cute (or at least thats the story we're sticking to =P) since we both ordered 2 pieces of chicken but received 3 pieces each. Extra thigh for me, extra drumstick for her!!!! YAY!\n\nThis will be my #1 spot for Chicken and Waffles! =D", "rating": 5, "date": "2009-07-30"}, {"excerpts": ["The sausage gravy was not so good on the McMahon? ", "McMann? ", "The chicken skin was very crisp, but the chicken lacked flavor. ", "I don't think it was marinated. ", "We were very hungry and just could not stomach the McMann. ", "I would only sort of recommend the fried chicken."], "author": "Jay R.", "review": "The sausage gravy was not so good on the McMahon? McMann? The chicken skin was very crisp, but the chicken lacked flavor. I don't think it was marinated. We were very hungry and just could not stomach the McMann. I would only sort of recommend the fried chicken.", "rating": 2, "date": "2016-01-14"}, {"excerpts": ["We had ordered the 3 piece fried chicken with the waffle and a side of sausage gravy. ", "One bite and ", "wow, I was blown away by everything we ordered. ", "I was dipping my waffle, my chicken and even my spoon to drink up the sausage gravy. ", "It is one highly addictive gravy ", "and I am thinking about it right now. ", "One time I tried to go to Farmer Brown's located in the Tenderloin district and the wait was too long that I decided not to go. ", "But I am glad they opened up Little Skillet "], "author": "Danster L.", "review": "For my 500th review, I never thought I would make it this far but I saved the big 5-0-0 for my favorite new place, Little Skillet. I stumbled across this place on Yelp one day trying to find fried chicken and of course I want to try Ad Hoc in Yountville but it's so far and really expensive at $49 bucks for the 4 course meal I believe, but that will be saved for later this year. So after bookmarking Little Skillet, my friend and I went to check it out.\n\nWhat a long line that I dropped my friend off and he waited in line while I searched for parking. The place is located in an alley way and all it is, is a brick a mortar building with a window. How cute is that, a true hole in the wall lol. We had ordered the 3 piece fried chicken with the waffle and a side of sausage gravy. One bite and wow, I was blown away by everything we ordered. I was dipping my waffle, my chicken and even my spoon to drink up the sausage gravy. It is one highly addictive gravy and I am thinking about it right now. One time I tried to go to Farmer Brown's located in the Tenderloin district and the wait was too long that I decided not to go. But I am glad they opened up Little Skillet and now I can see why their are lines at F.B.\n\nI have gone back a few more times and every time has been such a great experience with people just relaxing in the area on the loading dock, on crates, or just standing and digging into their boxed lunches. I enjoyed everything about Little Skillet and can't wait to go back a million more times. San Jose needs more places like, places where you don't have to worry about the fuss of waiting for a table, hailing your server down or even taxes. Great place and worth the wait and best fried chicken in SF for now lol! I LOVE YOU LITTLE SKILLET!!!", "rating": 5, "date": "2009-08-06"}, {"excerpts": ["We ordered chicken and waffles, as well as biscuits with sausage gravy and scrambled eggs. ", "The biscuits and gravy didn't quite satisfy my southern craving.  ", "There was something missing from the gravy.  ", "Not enough pepper?  Not enough fat?  ", "Hot sauce?  ", "All of the above, maybe? "], "author": "Claudine D.", "review": "My 11yo made a special request for chicken and waffles from Little Skillet Wednesday morning, and I was happy to oblige.  We lived in North Carolina for eight years and we have been missing some of that southern cuisine.\n\nWe ordered chicken and waffles, as well as biscuits with sausage gravy and scrambled eggs. The biscuits and gravy didn't quite satisfy my southern craving.  There was something missing from the gravy.  Not enough pepper?  Not enough fat?  Hot sauce?  All of the above, maybe? It certainly didn't take me back to the Carolinas, and maybe that was an unrealistic expectation of mine.\n\nHowever, the chicken and waffles were yummy!  If you saw my 11yo and I eat those, you would have thought we hadn't eaten in days.  So embarrassing, but they were finger lickin' good.  You take some of the chicken and wrap a piece of waffle around it, and dip them both in the sweet syrup which I could've drank straight.  *sigh* So good.", "rating": 4, "date": "2011-03-30"}, {"excerpts": ["It's their waffle coated in sausage gravy topped with a fried egg and scallions and bacon ", "and it will make your tastebuds SING!"], "author": "Tiffany C.", "review": "It pains me to give a less than 5 star review for one of my favorite places in the city (with chicken and waffles that could definitely make up my last meal request) but I feel I must protest against the astronomical prices! The prices have gone up significantly since the posted image of the menu seen on Yelp, but little has changed in terms of flavor, quantity, and additions to the menu.\n\nThat being said, those high rollers who don't mind shelling out the double digits for lunch that has street seating (literally.. it's on the street in an alley), the food quality is still excellent. The staple, chicken and waffles, is so delicious, crispy and chewy and warm. The syrup was more watery than syrup-y, which was disappointing, but still lent a good sweet note to balance out the savory flavors.\n\nI've also tried their pulled pork and grits which were quite good as well, but my favorite (even more than the chicken and waffles perhaps!) is the Eggs McMahon, which is on the secret menu. For some reason, the cashier never knows what it is and is always flabbergasted when you request it, and yet when you describe it for them and they ring you up, you end up getting an incredible waffle lunch that I can only describe as a party of yumminess in your mouth. It's their waffle coated in sausage gravy topped with a fried egg and scallions and bacon and it will make your tastebuds SING!", "rating": 4, "date": "2013-02-21"}, {"excerpts": ["Oh and also ordered their biscuits with sausage gravy.\n\n", "Their biscuits with gravy was pretty good, I really liked taht sausage gravy and their biscuits though kind of small compared to what I'm used to was very nice and tasty. "], "author": "phillip w.", "review": "After hearing all these raving reviews from yelpers and friends about their fried chicken..my friend Dee decided that it was time I went to Little Skillet. So I picked up Dee and Jason G. and we headed down there.\n\nIt was a beautiful sunny day and we found decent street parking, yes it was meter and yes the meter probably ate up all my change from my car but I didnt mind...I kept thinking the chicken better be good.\n\nWalking towards little skillet this place is literally a hole in the wall. You go up to that hole (window) and order your goodies. Dee went for their breakfast sandwich which was friggin huge.  Jason and I decided to share an 8 piece which came with two sides. Got the potato salad and fries..I really should went with the cole slaw but I'll get to that later. Oh and also ordered their biscuits with sausage gravy.\n\nNow there is like one bench against the wall across from little skillet or you can just sit on the high curb. Its a beautiful day so I guess its kind of like having a picnic...in the middle of an alley.\n\nThe fried chicken had a lot of flavor..but I wish it was crispy. It didnt have that crunch. There were some juices but not as much as I would of liked. I like my fried chicken crispy, juicy and flavorful. I guess little skillet got like 2 out of 3. or maybe 1.5 out 3 on my list. So its ok.\n\nTheir biscuits with gravy was pretty good, I really liked taht sausage gravy and their biscuits though kind of small compared to what I'm used to was very nice and tasty. And the gravy had nice bits of sausage. \n\nI got a bite out of that enormous breakfast sandwich and I'm sure that would of lasted me for the whole day if I had ordered that. Its on a ciabatta loaf i believe and they probably used like a carton of eggs. That thing was gigantic.\n\nOverall its a cool place for lunch as long as you dont mind sitting on a bench or curb, and if you are fiending for coffee I believe Blue Bottle is just the next door. I will definitely come back but next time, but i hope they'll have that crunch that I like in my fried chicken..", "rating": 4, "date": "2010-03-25"}, {"excerpts": ["Biscuits were hard and hardly fresh, sausage gravy was thin and runny and didn't even soak into the bisquits, eggs weren't cooked to order unless over easy is broken yolks in fried eggs, and the amount of food for the price was outrageous.  ", "$15 for something they can fit in a 4x4 box, left me hungry for more. ", "Charging sit down prices when there is nowhere to sit unless it's later in the day and the bar is open. ", "This was my first and will be my only time eating at this hole in the wall. ", "I would have given it less than 1 star if possible."], "author": "Corey E.", "review": "Ordered biscuits and gravy. Biscuits were hard and hardly fresh, sausage gravy was thin and runny and didn't even soak into the bisquits, eggs weren't cooked to order unless over easy is broken yolks in fried eggs, and the amount of food for the price was outrageous.  $15 for something they can fit in a 4x4 box, left me hungry for more. Charging sit down prices when there is nowhere to sit unless it's later in the day and the bar is open. This was my first and will be my only time eating at this hole in the wall. I would have given it less than 1 star if possible.", "rating": 1, "date": "2014-11-05"}, {"excerpts": ["luckily we had sausage gravy-which was super delicious-to add some warmth to my waffles! ", "My fried chicken was decent ", "but I've had better. ", "The ambience was nice but the fact that my waffles weren't warm kinda killed it for me. ", "I'd come back and give this place a second chance though."], "author": "Leanne E.", "review": "Came here this past Friday night with some friends. Parking kinda sucks and had to feed the meter (that's SF for you though!) I was pretty excited once I walked in because of the ambience! Felt like I was in a modern barn. Big space with a big bar in the main room and a smaller bar in the back. A cool spot to chill with friends for a drink and some food. You walk up to order and they bring out your food to you. I ordered the works with mac and cheese. I swear I barely sat down and my food was already at the table! I found that to be a little too fast. I touched my waffles and they weren't even that warm :( luckily we had sausage gravy-which was super delicious-to add some warmth to my waffles! My fried chicken was decent but I've had better. The ambience was nice but the fact that my waffles weren't warm kinda killed it for me. I'd come back and give this place a second chance though.", "rating": 3, "date": "2015-02-09"}, {"excerpts": ["Also, the biscuits were nothing special especially with the cold sausage gravy on top of it.  ", "If you are wondering how long we let it sit, let's just say we grabbed it as soon as it was at the window and popped it open to eat it within a minute.  ", "I really don't know if little skillet deserves a second try, because the outcome could very well be the same."], "author": "Steven T.", "review": "Came here a few weekends ago to grab some fryyyy cheeken and waffles. You basically order at a window, grab your food, and then take up some real estate outside to eat your food. I don't know if it was that particular weekend, but there were also some vendors for lack of a better word selling other food right outside on the street. \n\nMuch like some other reviews, this place is hit and miss (this visit was definitely a miss). I feel as if the food would have tasted a whole degree better had it just been HOT or even reallllly warm? Our food was barely luke warm which kind of killed it for me personally. The waffle was cold and soggy, chicken was as if it might have been fried and sitting on a counter for some time... and grits were just... grits. Also, the biscuits were nothing special especially with the cold sausage gravy on top of it.  If you are wondering how long we let it sit, let's just say we grabbed it as soon as it was at the window and popped it open to eat it within a minute.  I really don't know if little skillet deserves a second try, because the outcome could very well be the same.", "rating": 2, "date": "2009-11-18"}, {"excerpts": ["If you're willing to splurge $2 to get some of their sausage gravy and add that to it, it makes these 2 items taste wonderfully together. ", "I could buy that sausage gravy and just drink that as a meal. ", "Soooo good. ", "I just wish it didn't cost an extra $2 and that it'd come with the meal or have an option to get that as a side instead of the maple syrup."], "author": "Gajan K.", "review": "What can I say about Chicken and Waffles other than...Mmmmmm good. Every time I've come here, the chicken is fried perfectly and tastes awesome. My only annoyance is that while the waffle is usually pretty good too, it just doesn't seem to complement the chicken that well. I love eating them both and they are both are delicious but I just wish they would taste better when eating them together.\n\nHowever, I will say this. If you're willing to splurge $2 to get some of their sausage gravy and add that to it, it makes these 2 items taste wonderfully together. I could buy that sausage gravy and just drink that as a meal. Soooo good. I just wish it didn't cost an extra $2 and that it'd come with the meal or have an option to get that as a side instead of the maple syrup.", "rating": 4, "date": "2010-09-26"}, {"excerpts": ["Our order: 2 orders of 3piece white chicken w waffle and side of sausage gravy, 1 shrimp o'boy sandwich, and 2 pecan tartlets. \n\n"], "author": "Dina V.", "review": "Call in your order! It'll be ready in 5 minutes.\n\nMy brother, remember he's a foodie too, actually read about this place on Chow and took my cousin here last Friday. He called me soon after and told me that it was \"off the hook\" and that he would be trying it again on Monday, today!\n\nI have never had chicken and waffles but the concept has always intrigued me. We don't have Roscoe's here and I'm hardly ever in Oakland to try that place so I have no basis.\n\nAfter reading the reviews here I wanted to try the angel biscuit and chicken. My brother swayed me and said the chicken and waffle combo is where it's at. So I went with what he said.\n\nOur order: 2 orders of 3piece white chicken w waffle and side of sausage gravy, 1 shrimp o'boy sandwich, and 2 pecan tartlets. \n\nI like that you can choose if you want white or dark meat. And I'm really glad I got the white meat, even though most times I like dark. The chicken meat as everyone has said was moist and seasoned to perfection. And yes even though we asked for the 3 piece, we both got 4 pieces in our boxes. The waffle was a nice accompaniment to the chicken. The gravy is so very tasty and yummy and I dipped both the chicken and the waflle in it. Lol.\n\nMy SIL ordered the po'boy and I got a little taste. The shrimp was seasoned so nicely with a little touch of heat. It comes with some house made chips were also very good. And served on a ciabatta roll which held the sandwich together very well b/c they heap the shrimp on.\n\nThe pecan tartlet is yummy and a nice finish to lunch.\n\nDefinitely call your order in especially if you're planning to go during the lunch rush. There was a line along the perimeter of people waiting for their orders and people waiting to put their orders in. We drove up parked down the street and as soon as my brother got to the window they were calling his name. The patrons in line were NOT happy. Pwahahahaha.", "rating": 4, "date": "2009-06-29"}, {"excerpts": ["Fried chicken with sausage gravy - so good. ", "I like that it's not overcrowded but not empty either, as a weekend brunch place."], "author": "Veronica J.", "review": "One of the best, and fairly secret, brunch places in SF. The skillet pancake is amazing. I only wish it was larger. Biscuits and gravy - amazing. Fried chicken with sausage gravy - so good. I like that it's not overcrowded but not empty either, as a weekend brunch place.", "rating": 5, "date": "2015-12-29"}, {"excerpts": ["I give this place 4 stars because of the sausage gravy and the epic breakfast po-boy.  ", "I'd avoid the waffles - ", "just ain't my thing "], "author": "Michael S.", "review": "Fried chicken is good - but still not better than homemade (check out my Front Porch review for a recipe).  I give this place 4 stars because of the sausage gravy and the epic breakfast po-boy.  I'd avoid the waffles - just ain't my thing and they get soggy fast. \n\nAlso - the lines here suck.", "rating": 4, "date": "2012-10-25"}, {"excerpts": ["Next time, I'll try to one-up my order by getting the chicken with the sausage gravy :)"], "author": "Marlon E.", "review": "Today, I got the 3 piece chicken meal with a waffle.  The line was super long today, most likely due to the promo on Thrillist, but overall, I would say that it was worth the wait.\n\nI'll go out on a limb and say that their fried chicken is the best in the SOMA district (and considering that up until now, that title was with Louisiana Fried Chicken inside of Happy Donuts, which isn't saying much).  Moist, but not greasy, and still tasty!\n\nTheir waffle on the other hand, I was disappointed with.  Way too soft for my liking.  If they could make it so it turns out crispy on the outside, I would have liked it a lot better.  It was still good though.\n\nIt looks like their permanent hours will be 8am to 8pm, and also they will be open late nights, which should make them an easy success since this would make a nice post-clubbing meal.\n\nNext time, I'll try to one-up my order by getting the chicken with the sausage gravy :)", "rating": 4, "date": "2009-05-14"}, {"excerpts": ["a side of sausage gravy for an additional $1. ", "The service was quick, friendly and more importantly my box felt very warm. ", "Upon opening my take out box I immediately discovered an extra piece of chicken!, alongside a very generous container of gravy, a small yet well proportioned side of maple syrup and one quarter of a Belgian style waffle. "], "author": "Mark B.", "review": "I have never been to the south but can tell you that Little Skillet just made me the best fried chicken I have ever had. After hearing about it through some co-workers I decided to finally check it out. Situated on Ritch Alley just off of Townsend, Little Skillet is literally just a take out window and most patrons seek refuge on the loading dock across the street (which is amazingly clean for a loading dock). I went with the 3pc Chicken + Waffle ($8.50) w/ a side of sausage gravy for an additional $1. The service was quick, friendly and more importantly my box felt very warm. Upon opening my take out box I immediately discovered an extra piece of chicken!, alongside a very generous container of gravy, a small yet well proportioned side of maple syrup and one quarter of a Belgian style waffle. Here's the breakdown:\n\n-The Chicken: Amazing- perfectly cooked, battered &amp; seasoned. Big thanks for the extra piece! \n-Waffle: Definitely on the small side and could be cooked perhaps a little bit longer but delicious overall... If they included two pieces of waffle we are looking at a 5-Star meal.\n-Sausage Gravy: Not sure why people complain about the amount of gravy you get because I had a bit left over. It's excellent as well but I'm not sure it's needed since the chicken is so good by itself. \n-Syrup: Awesome... nothing else to say.\n\nOverall, I am a fan and will be going back to Little Skillet. Everything I ate was delicious, however, I am still a little bit hungry and would have liked a bigger portion of waffles (maybe an add-on down the road). I think breakfast will be my next stop at Little Skillet... I'll keep you posted.", "rating": 5, "date": "2009-06-11"}, {"excerpts": ["I ordered a waffle, topped with sausage gravy, scallions, cheese AND A FRIED EGG! ", "Ruggy! ", "I thought we were friends. ", "Why are you trying to kill me? ", "The guy behind the counter yelled my name and my order was up. ", "As Ray LaMontagne sang \"Trouble\" in my ear, I cut a piece and took a bite. ", "SLAP MY ASS AND CALL ME SUSAN (no, ", "really. ", "Do it.)! ", "This.is.", "THE.Business!! ", "Take it from a Southerner, everything was right about this. ", "The waffle was light and seasoned. ", "The gravy was the right consistency and packed with sausage in every bite. ", "The egg was the perfect texture. "], "author": "Johnny T.", "review": "First, Tina B. Now, Ruggy J. What's with all these people trying to kill me? I'm a nice guy. I pay my taxes. I remember my mom's birthday. Stop trying to take me out, people! Where Tina B tried with fritters the size of children, Ruggy's weapon of choice was massive cholesterol... and deliciousness.\n\nAfter a week of eating and drinking, we decided that we needed to eat some more. SF's fearless leader told me that he knew the perfect place to go grab some grub. After participating in a death march from the office to an alley, I was winded, lost and confused. What was about to happen? Where had he taken me? All fear was lost when I saw the counter. Mmmm. Chicken. Waffles. Biscuits. Love! Even though I am doing my best city slicker impression, I am a Southern boy at heart. This food spoke to me. It also kills, people. Which path had Ruggy chosen for me? Nostalgia or death? There was only one way to find out.\n\nWith a wink and a nod, he suggested I order the Eggs McMahon. Okay. It sounded like something I could handle. Not learning my lesson from the fritter incident™, I ordered a grape soda to wash it all down. Wow. What did i do? I ordered a waffle, topped with sausage gravy, scallions, cheese AND A FRIED EGG! Ruggy! I thought we were friends. Why are you trying to kill me? The guy behind the counter yelled my name and my order was up. As Ray LaMontagne sang \"Trouble\" in my ear, I cut a piece and took a bite. SLAP MY ASS AND CALL ME SUSAN (no, really. Do it.)! This.is.THE.Business!! Take it from a Southerner, everything was right about this. The waffle was light and seasoned. The gravy was the right consistency and packed with sausage in every bite. The egg was the perfect texture. The cheese and scallions added the fullness of flavor that forced me to devour my meal...and the grape soda cut just enough of the cholesterol for me to live another day.\n\nWell played, Ruggy J. Good try. Actually, the sprint back to the office is what almost took me out. Have you ever tried to keep up with this guy? He's fast. Fried food smothered in gravy and topped off with grape soda, I can do. No problem. Physical fitness after said activity...trouble. Oh, trouble, trouble, trouble...", "rating": 5, "date": "2010-02-11"}, {"excerpts": ["Biscuits served hot & fluffy, lots of good butter flavor - tasty with honey, syrup or the cream-style sausage gravy.  ", "Breakfast sandwich was nice & hearty with plenty of eggs, cheese & chorizo sausage.  "], "author": "Christina S.", "review": "Amazing, awesome, fabulous food!  Ditto other explanations about location (limited parking, window only, no seating except for loading dock) and cash-only policy.  I loved all of the condiments offered, as well as the filtered water in compostable cups and little cushions for when you sit on the loading dock.\n\nWent two weekdays in a row for breakfast around 9am.  Fried chicken quite possibly the best I've ever had - enjoyed it plain (hot, crispy, salty goodness), with the maple syrup and with the hot sauce.   The waffle was good but as another Yelper said, most notable for its syrup; it had cooled by the time I finished one piece of chicken.  Biscuits served hot & fluffy, lots of good butter flavor - tasty with honey, syrup or the cream-style sausage gravy.  Breakfast sandwich was nice & hearty with plenty of eggs, cheese & chorizo sausage.  Grits with chorizo & cheddar were sinfully rich & creamy.\n\nAlso very good: The coffee from the little shop next door was Blue Bottle, drip or espresso drinks.", "rating": 5, "date": "2010-09-14"}, {"excerpts": ["Breakfast is mostly just biscuits (with mushroom gravy, sausage gravy, or butter and jam) or a waffle and lunch is primarily fried chicken (with or without waffles), pulled pork, or a couple of other options. ", "Everything is fresh and homemade at cheap prices which is nice. ", "I got the biscuits and sausage gravy with eggs for breakfast ", "and I thought it was ok ", "but it was definitely not traditional. ", "The gravy was quite thin and there was some sort of seasoning in it that was very reminiscent of some Thai like flavors that I couldn't place. ", "I wouldn't say that it was amazing ", "but it was certainly the best breakfast I've ever gotten from a window before and for under $7 I'd say it was worth it."], "author": "Matt E.", "review": "3.5 stars...\n\nThe little skillet is just a couple of windows down in a shady area of town with a small menu of southern specialties. One window is for the beverages (mostly coffee) and the other is for the food. Luckily they have a bench and a long concrete platform across the street to sit and eat if you're not taking it elsewhere (they provide seat cushions too if you want). Breakfast is mostly just biscuits (with mushroom gravy, sausage gravy, or butter and jam) or a waffle and lunch is primarily fried chicken (with or without waffles), pulled pork, or a couple of other options. Everything is fresh and homemade at cheap prices which is nice. I got the biscuits and sausage gravy with eggs for breakfast and I thought it was ok but it was definitely not traditional. The gravy was quite thin and there was some sort of seasoning in it that was very reminiscent of some Thai like flavors that I couldn't place. I wouldn't say that it was amazing but it was certainly the best breakfast I've ever gotten from a window before and for under $7 I'd say it was worth it.", "rating": 4, "date": "2010-10-08"}, {"excerpts": ["Regular biscuit with sausage gravy\nSame excellent biscuit sans sugar and pepper. "], "author": "Jacquee P.", "review": "Sandy C. took me here for a birthday lunch. As I write this review, I wish I was back on that little bench, sitting in the sun, with crumbs on my face and chicken in hand. \n\nBrown sugar and black pepper biscuits\nExcellente. The density and moistness of the biscuit was perfect. The brown sugar caramelized and made the top slightly chewy and sweet. The black pepper was a beautiful and unexpected contrast to the sweetness. \n\nFried chicken - dark meat only\nI could have eaten another five pieces (everyday for the rest of my life) but I can't afford to buy new clothes. \n\nRegular biscuit with sausage gravy\nSame excellent biscuit sans sugar and pepper. Gravy was tasty with a hint of curry (?). \n\nWaffle of the day - Apple Jack with sour cream\nI have to admit that I loved the waffle more than the toppings. Next time I'm getting a clean waffle.", "rating": 5, "date": "2009-11-24"}, {"excerpts": ["Unlike Roscoe's, they do more of a thick Belgian style waffle dusted in powdered sugar to go with the chick, but it was still fluffy and light and just right to wrap around a juicy morsel of thigh and dip into some sausage gravy. ", "Maple syrup and fried chicken are surprisingly good together and it turns out powdered sugar and sausage gravy rock just as well. \n\n", "Like any other alley escapade I'd recommend partaking sparingly, but when you do, go crazy and order the side of sausage gravy and pour it all over everything can. ", "You only live once."], "author": "dawson s.", "review": "Between the random alley walk-up locale and the fact that they do chicken and waffles, this place is right up my, well, alley. \n\nYou line up in the -  you guessed it - alley with a grip of cash (they don't do cards) like some crackhead ready to get your fix, place your order at the little window and wait. And wait. And wait some more. (Speed is not their forte here, so you call ahead to place your order like the clever boy or girl you are, and then you don't have to stand around all twitchy waiting). When they call your name, you collect your brown handle bag of goods and take your place amongst the masses huddling and hunkering right there in the street to get some lunch on.\n\nUnlike Roscoe's, they do more of a thick Belgian style waffle dusted in powdered sugar to go with the chick, but it was still fluffy and light and just right to wrap around a juicy morsel of thigh and dip into some sausage gravy. Maple syrup and fried chicken are surprisingly good together and it turns out powdered sugar and sausage gravy rock just as well. \n\nThe potato salad and macaroni salad sides were less than inspired and left me craving some good greens. Had to settle for a brown sugar and black pepper topped biscuit that was kinda sorta just ok, but I took one for the team and ate it anyway. I'm cool like that. The fries are another story. They were all super crispy and fabulous. Too bad chicken and waffles don't really leave me craving fries. I want greens!\n\nLike any other alley escapade I'd recommend partaking sparingly, but when you do, go crazy and order the side of sausage gravy and pour it all over everything can. You only live once.", "rating": 4, "date": "2009-09-01"}, {"excerpts": ["The sausage gravy, which my cousin had, was not as good with the chicken (as was the mushroom gravy), though it had a really nice flavor itself. ", "All in all, the whole experience was goddamn incredible - I will definitely be coming back as long as this place remains open."], "author": "Shelby C.", "review": "A while ago I vowed that I wouldn't ever give 5 stars - and if I did (which I am susceptible to, since I am only human and there are tons of amazing food to be had), it would be sparingly. Thus is the reason for the four stars given to Little Skillet. Another reason would be because there just isn't any seating except for a loading dock. While that's fine and fresh by me, it really dashed my hopes of having some crazy-good fried chicken on rainy days (and I guess when there are trucks in the loading dock).\n\nON to the good. I heard about this literal hole-in-the-wall in San Francisco magazine, then did some research on Yelp and found it to be quite popular. After looking at the menu and reviews, I had this innate yearning to get out of the house and do whatever it took to get there, but decided to go the next day. When we got there, it took a little effort to find parking, 'cause it's right next to AT&T Park as well as in tons of business locales. BRING QUARTERS - it's gonna be meter parking and the lines are long here. We waited about 10-15 minutes in line but when we got the the window, the people were friendly and helpful, and in no way hurrying (as is often the case for places that are busy like this). I ordered the three piece chicken + waffle but forgot to tell them what I wanted, which I was kinda bummed about. The wait was not long at all. Oh - they also have Dr. Pepper in bottles. \n\nThe chicken was incredible though - as in OUT OF THIS WORLD good, probably some of the best chicken I've ever had. The batter was thick and crunchy, perfect with the moist chicken. Incredible. An extra $1 yielded some mushroom gravy which was also awesome, though it seems like a fancy option. Bare-bones chicken is better. The sausage gravy, which my cousin had, was not as good with the chicken (as was the mushroom gravy), though it had a really nice flavor itself. All in all, the whole experience was goddamn incredible - I will definitely be coming back as long as this place remains open.", "rating": 4, "date": "2009-08-01"}, {"excerpts": ["I got a 2 piece chicken and waffle combo with sausage gravy.  "], "author": "Christina C.", "review": "I am guilty of kidnapping Erica.  But she was kind of asking for it. \n\nOn Tuesday, I nabbed Erica from work and I brought her to an undisclosed location so I could gorge myself on chicken and waffles.  \n\nThis place is located in an alley.  A one-way alley luckily so I could watch for cops and meter maids.  It's a window, and they served the most delicious food in cardboard boxes.\n\nI got a 2 piece chicken and waffle combo with sausage gravy.  Though the gravy was effing delicious, it was $2 for a container the size of eye cream.  \n\nThe waffle was dusted with powdered sugar and I destroyed it in 4 bites.  Sure, I drowned it in maple syrup.  But it didn't stand a chance. \n\nAnd the chicken.  By the wrath of Thor.  I have never had a religious experience before eating this chicken.  There was one time I had some bad shrimp and I thought I saw demons, but that was completely different.  \n\nThis chicken was hot, steaming, well seasoned, crunchy, supple, not fatty and it was mine to eat.  \n\nI'd lied to my BF about where I was that morning.  The taste of the chicken made me feel really guilty.  As if I was really doing something immoral and hiding it from my BF.  Something more than mere epicurious promiscuity.  The fried chicken was so good, I felt GUILT.  \n\nAnd now, the day before thanksgiving, all I can think about is when I can sin again.", "rating": 5, "date": "2009-11-25"}, {"excerpts": ["The fried chicken is divine - not greasy and VERY tasty - but my favorite thing to order is the Biscuits and Sausage Gravy.  ", "YUM!  "], "author": "Rebekah D.", "review": "Love this place, but wish it was open later and on Sundays.  The fried chicken is divine - not greasy and VERY tasty - but my favorite thing to order is the Biscuits and Sausage Gravy.  YUM!  Best eaten sitting on the stoop across the street on a sunny day and extra filling if ordered with eggs.  \n\nSadly the price has gone up since last I was there - almost double what it was before - but since they are mostly open when there are worker bees around it's not like I could eat there that often anyway.  \n\nGirl who works the counter is always super nice and it should be noted they are CASH only (though I could have sworn I'd used my card there a time or two before).", "rating": 4, "date": "2011-01-29"}, {"excerpts": ["I had 2 pieces of fried chicken and waffle combination with a side of sausage gravy. ", "It was heavenly. ", "The fried chicken pieces were gigantic, crunchy on the outside and soft, tender, and piping hot on the inside. ", "Much to my surprise, it wasn't greasy! ", "MMM MMM! ", "And to top it off, the sausage gravy complemented the chicken. ", "The sausage gravy was thick with chunks of sausage pieces. ", "The waffle was soft and a bit crunchy on the outside, just the way I love it. ", "I wish I knew what the batter was made of because I want to make it all day long for myself! ", "I was going to get more waffles a la carte after my meal, but realized that a food coma was just around the corner. ", "And sure enough, this food coma is not going away anytime soon! "], "author": "Christine L.", "review": "I am in pure bliss right now after eating Farmerbrown's Little Skillet for the first time. Environmentally conscious and exceptionally DELICIOUS, I can vouch that this little eatery is as good as it gets. \n\nLike others have said, bring cash! And don't forget to bring a hungry stomach :) When I went today at 12:30pm, it was crowded, but my order came within 5 minutes. There are no tables or chairs to sit at so expect to get nice and comfy on the street of the alley. \n\nI had 2 pieces of fried chicken and waffle combination with a side of sausage gravy. It was heavenly. The fried chicken pieces were gigantic, crunchy on the outside and soft, tender, and piping hot on the inside. Much to my surprise, it wasn't greasy! MMM MMM! And to top it off, the sausage gravy complemented the chicken. The sausage gravy was thick with chunks of sausage pieces. The waffle was soft and a bit crunchy on the outside, just the way I love it. I wish I knew what the batter was made of because I want to make it all day long for myself! I was going to get more waffles a la carte after my meal, but realized that a food coma was just around the corner. And sure enough, this food coma is not going away anytime soon! Expect good-sized portions people!\n\nAm I exaggerating? Maybe so. But my happiness and content stomach do not lie. Farmerbrown's Little Skillet is a MUST EAT!", "rating": 5, "date": "2009-07-21"}, {"excerpts": ["I got the 3 piece+Waffle with Sausage Gravy. ", "I asked for thigh and breast and got just that. ", "The sausage gravy made everything taste funny "], "author": "Myron J.", "review": "When you think of hole in the wall places you don't take it literally but this is an actual HOLE in the WALL!!!\n\nThe FRIED CHICKEN here is AMAZING!!! I'm hooked! It is finger-lickin' good! I got the 3 piece+Waffle with Sausage Gravy. I asked for thigh and breast and got just that. The food was hot!!! \n\nThe waffle was soo soo dry, needed some syrup but didn't want to pay $1 for some syrup. The biscuits were not that great. I hear it is better at Brenda's. The sausage gravy made everything taste funny so if you like gravy with your chicken/biscuit/waffle go with the mushroom gravy, it has a more creamy texture.\n\nThere is seating on the loading dock across the alley and a bench or two. \n\nThe service is fast and the line does get quite long. Parking is meter only... and CASH ONLY!\n\nBring wet napkins and maybe a packet of syrup :D", "rating": 4, "date": "2009-07-31"}, {"excerpts": ["Not specified, but I'm gonna go with Jim.) was super scrump - awesome sausage gravy smothered a fried egg with scallions and cheese all over a waffle.\n\n"], "author": "Laura B.", "review": "Cute, friendly, smells good, cash only, and sweet and savory at the same time.  Your new girlfriend or Farmerbrown's Little Skillet?\n\nI probably should have gone with one of the chicken and waffles combos for tradition's sake, but my Eggs McMahon (Ed, Vince, or Jim? Not specified, but I'm gonna go with Jim.) was super scrump - awesome sausage gravy smothered a fried egg with scallions and cheese all over a waffle.\n\nSince it was the first sunny day in over a week, we relished the extra Vitamin D and posted up on the loading dock with everyone else to enjoy our lunch/brunch hipster picnic.\n\nAs far as other bites of food I tried, the grits were creamy, the fries crunchy, the chips WAY too salty, and the lemonade perfectly refreshing.\n\nThe menu is posted along with daily specials, which on Saturday included a SMURF WAFFLE - blueberry waffle topped with whip and more berries.  Awesome because, smurfs!\n\nI have a feeling we'll be seeing more of each other, home skillet.", "rating": 4, "date": "2010-02-01"}, {"excerpts": ["To complement my chicken I also tried the sausage gravy, and while not altogether necessary, it too was delicious and swimming with tasty sausage-y chunks.\n\n"], "author": "Katherine C.", "review": "Completely delicious.  \n\nThe 2-piece chicken and waffle combo was great.  Honestly the waffle is just a waffle and I could probably have done without, but the chicken...the chicken was heaven.  Make sure to request what pieces of chicken you want, I chose a Breast and Thigh.  Both were tender and juicy and perfectly fried.  The batter is really well flavored, a little spicy and not too heavy.  To complement my chicken I also tried the sausage gravy, and while not altogether necessary, it too was delicious and swimming with tasty sausage-y chunks.\n\nI also tried the Grits with Pulled Pork, Cheese, and Onions.  The grits were very creamy and combined with the pulled pork it made for a delightful treat.  \n\nI'm sure I'll be back.", "rating": 5, "date": "2009-07-28"}, {"excerpts": ["Ordered the 3 piece chicken and waffles with a side of fries and sausage gravy. "], "author": "Jason B.", "review": "I decided to make the walk from work today for my second helping of fried chicken (other was from LFC). Ordered the 3 piece chicken and waffles with a side of fries and sausage gravy. Right about now I am feeling the effects of stuffing my fat arse with greasy food, but I must say, it was well worth it! \n\nI ordered 2 legs and 1 breast and both of these were very juicy with a thick layer of crunch on the outside. I must have got the end of the batch with the fries because most of them were tiny pieces that probably fell to the bottom. However, they still were very tasty, just a bit more work to eat them. \n\nOne word of advice, get there as early as possible! I got there at about 12:45pm and the line was about 20 people deep and about a 15 minute wait to place my order.", "rating": 4, "date": "2009-07-02"}, {"excerpts": ["I ordered the 2 piece plus waffle (to go) while my cousin ordered a waffle and biscuits and sausage gravy. ", "The chicken was crisp and fairly juicy and not too salty. ", "The waffle was lightly dusted with powdered sugar and the syrup provided was top notch. "], "author": "Brian C.", "review": "Visiting my cousin in San Francisco, I was pleased to hear that this little place was just down the street. Having never experienced chicken and waffles together, I was determined to try this tasty concoction. Suffice to say, I was very pleased. I ordered the 2 piece plus waffle (to go) while my cousin ordered a waffle and biscuits and sausage gravy. The chicken was crisp and fairly juicy and not too salty. The waffle was lightly dusted with powdered sugar and the syrup provided was top notch. I also sampled the biscuits and gravy (always a big fan) and was happy with the results. \n\nOverall, great first experience and you can't beat the convenient location!", "rating": 4, "date": "2010-07-31"}, {"excerpts": ["Got two pieces of chicken, sausage gravy and a waffle. "], "author": "Patrick M.", "review": "This place was featured in a list of Chicken n Waffle houses around the nation on Digg so i happen to venture out on a little walk for lunch. \n\nI arrived at 11am and a line had already formed. Got two pieces of chicken, sausage gravy and a waffle. $8, what u'd expect for lunch around downtown. \n\nChicken was amazing. Perfectly fried with spices and not too much fat in the skin. Gravy had chunks of sausage and very complimentary to the fried chicken. \n\nPersonally, i thought the waffle was better without the syrup which tasted too sweet and honey-ish. \n\nWill definitely go again real soon to try the Po' Boy Pulled Pork shoulder sandwich. Also, they have great variety of bottled sodas like Vanilla Creme and Grape soda. \n\nMMMMM mmmm delish.", "rating": 5, "date": "2009-07-31"}, {"excerpts": ["I tried the 3 piece chicken with waffle and a side of sausage gravy. ", "Apparently there's no tax at this place. ", "The chicken was moist and delicious. ", "Dipping it in the sausage gravy just made things even better. ", "The waffle was crunchy with a good amount of powdered sugar. "], "author": "Peter N.", "review": "This hole in the wall (literally, it's a hole in the wall) is hidden in an alleyway that if you were to pass by it, you wouldn't even realize this little place was even there. I wonder how people even found this place. The ordering window is much like a drive-thru window. You go up and order and give them your name. They'll call your name when  your order is finished.\n\nI tried the 3 piece chicken with waffle and a side of sausage gravy. Apparently there's no tax at this place. The chicken was moist and delicious. Dipping it in the sausage gravy just made things even better. The waffle was crunchy with a good amount of powdered sugar. It's not really needed to use syrup on the waffle as it is already excellent without it.\n\nNext to the ordering window, there are condiments for people who want to add some kick to their food and water on the side for people who don't wanna spend money on drinks. On a side note, there are no tables so you gotta eat in the alleyway.\n\nI love this place and it is probably one of my favorite restaurants in SF now.", "rating": 4, "date": "2009-07-03"}, {"excerpts": ["I love eating the waffle with sausage gravy and the chicken with the warm maple syrup provided!\n\n"], "author": "Langdon N.", "review": "Best lunch joint in the SOMA district of San Francisco!\n\nThe fried chicken and waffles are by far one of my favorite lunches of all time! The waffles are your ordinary Eggo waffles you buy from the store, but they are quality Belgian Waffles! The chicken is great and its not your everyday KFC, but its free range, locally bought, fresh chicken. I've also read in a few articles that they use mainly organic ingredients, which is great! I love eating the waffle with sausage gravy and the chicken with the warm maple syrup provided!\n\nThe lines are usually never too long and go by fairly quickly. I love the scenery around the place and eating on the curb, it fully captures the essence of city life and the ambiance of the great weather!\n\nThe service is great as well! One time, they forgot a piece of chicken in a 3-piece that I had ordered with two other orders of 2-piece chicken and waffles. So they felt so bad for forgetting the piece of chicken that they were going to hook us up with 3 more pieces of chicken total! Since the pieces of chicken are fairly large, we declined but gratefully thanked them for the great service!\n\nThe chicken and waffles has been features on the \"100 things to try in San Francisco before you die\" and it is well deserved!", "rating": 5, "date": "2010-03-01"}, {"excerpts": ["Got the 2 piece chicken box with sausage gravy and a side of fruit salad. ", "Lucky me found 3 pieces instead. ", "Chicken was pretty good, and definitely better with the sausage gravy. ", "It's worth the extra 2 bucks."], "author": "Bonnie Y.", "review": "Located along an alley. Looks like it used to be a pizza place.\n\nIt's pretty good fooding considering the SOMA location. Long lines during lunch hour rush, and is cash only.\n\nGot the 2 piece chicken box with sausage gravy and a side of fruit salad. Lucky me found 3 pieces instead. Chicken was pretty good, and definitely better with the sausage gravy. It's worth the extra 2 bucks.", "rating": 4, "date": "2009-09-02"}, {"excerpts": ["The waffle is great dipped into that sausage gravy.\n\n", "Po Boy comes with fried which are fine, great for dipping in that sausage gravy.\n\n"], "author": "Cinnamon Z.", "review": "Lucky you if you work nearby!\n\nFried chicken - juicy and perfect, just the way it should be.  \n\nSauage gravy - be sure to get this, an absolutely must - heaven!  However, I don't like my hot food touching plastic, so if you live/work nearby bring a glass container.\n\nWaffle - its good, but next time I'll ask them not to put the powdered sugar on top.  Powdered sugar w/fried chicken?  Kind of weird.  The waffle is great dipped into that sausage gravy.\n\nAngel biscuits - not my favorite thing here\n\nPo Boy - I was expecting a fried oyster Po Boy, but instead you have a choice of 3: pulled pork, vegetarian, and shrimp.  I had shrimp.  It was good, prawns are nice and juicy, the sauces are just the right amount of spice - not too much, but the bread is rather bready.  \n\nPo Boy comes with fried which are fine, great for dipping in that sausage gravy.\n\nLemonaide - great, not very sugary, just right.\n\nOnly complaint, they are a bit slow.", "rating": 5, "date": "2009-05-26"}, {"excerpts": ["yes, you can get other things - the biscuits and sausage gravy are particularly awe-inducing - but the fried chicken and waffles are perfection. ", "The waffles stay crispy not matter how much (real!) ", "maple syrup you put on them, and the fried chicken is crispy amazing on the outside and juicy tender on the inside. ", "Brilliant. ", "They don't have real seating, there is a single bench, but they do supply you with little seat pads ", "so you can walk across the alley and sit on this shipping platform thing. ", "On a sunny day, this is kind of surreal. ", "Eating fried chicken in an alley with at least fifteen other people is not something I thought I would be doing a lot of!\n", "Pluses-\n", "They are two blocks from my fiance's house. ", "Rock on!\n", "Centro - the cutest little coffee shop, a kiosk really, is located right next door (erm, window?) and they serve Blue Bottle coffee and their drip coffee is made with a ceramic drip cone. ", "Love."], "author": "Steffany F.", "review": "Little Skillet is MAGIC. \nImagine, a window cut directly into a brick wall, with the menu posted to the right of the window and a chalkboard with specials suspended above. You walk to the window and order the chicken and waffles. Yes yes yes, you can get other things - the biscuits and sausage gravy are particularly awe-inducing - but the fried chicken and waffles are perfection. The waffles stay crispy not matter how much (real!) maple syrup you put on them, and the fried chicken is crispy amazing on the outside and juicy tender on the inside. Brilliant. They don't have real seating, there is a single bench, but they do supply you with little seat pads so you can walk across the alley and sit on this shipping platform thing. On a sunny day, this is kind of surreal. Eating fried chicken in an alley with at least fifteen other people is not something I thought I would be doing a lot of!\nPluses-\nThey are two blocks from my fiance's house. Rock on!\nCentro - the cutest little coffee shop, a kiosk really, is located right next door (erm, window?) and they serve Blue Bottle coffee and their drip coffee is made with a ceramic drip cone. Love.", "rating": 5, "date": "2010-05-03"}, {"excerpts": ["Get the sausage gravy to top it all off.\n\n"], "author": "Rishi M.", "review": "Masterfully cooked chicken & delicious waffles. Get the sausage gravy to top it all off.\n\nThis place is really great--but the lines are long and they're not open very long (lunchtime only right now)", "rating": 5, "date": "2009-06-04"}, {"excerpts": ["I ordered the 2 piece chicken and waffle with a side of sausage gravy and sweet tea.  ", "While waiting for our meal to arrive we sat across the street on the cement slab with the other customers devouring their chicken.  ", "The smell of fried chicken was heavenly and couldn't wait to for our names to be called.  ", "An experience you definitely must try and cross this off on the 7x7 list of 100 Things to Eat+Drink ", "Before You Die."], "author": "Grace C.", "review": "Nestled in the middle of a random street people are lined up to get their fried chicken and waffle fix.  As I waited in line I wondered how many first times were there.  I ordered the 2 piece chicken and waffle with a side of sausage gravy and sweet tea.  While waiting for our meal to arrive we sat across the street on the cement slab with the other customers devouring their chicken.  The smell of fried chicken was heavenly and couldn't wait to for our names to be called.  An experience you definitely must try and cross this off on the 7x7 list of 100 Things to Eat+Drink Before You Die.", "rating": 4, "date": "2010-09-29"}, {"excerpts": ["also had the yuzu ginger limeade (da bomb), brown sugar and black pepper biscuits, and sausage gravy.\n\n"], "author": "Andrey C.", "review": "finally had the pleasure of trying little skillet last friday during their happy hour/street food gathering and oh man, am i in heaven! i just can't get enough (still on my depeche mode high) of those perfectly seasoned fried chicken and delicious waffles! also had the yuzu ginger limeade (da bomb), brown sugar and black pepper biscuits, and sausage gravy.\n\nit's over, i can die a content soul now.", "rating": 5, "date": "2009-08-23"}, {"excerpts": ["i wish i had gotten sausage gravy too.\n\n"], "author": "Jade L.", "review": "yum!\n\ngot: 3 pc fried chicken with andouille + cheddar grits with angel biscuit.\n\nthe grits were heavenly--salty and savory and smooth, fresh grated cheddar on top with chopped sausage and green onion on top. It looked fresh and inviting, and by the time i got back to the office with my lunch, the cheese had melted and formed a nice layer on top. i'd say it was the most delicious part of the lunch.\n\nthe fried chicken was good, but not desperately so. i eat EVERYTHING on a piece of fried chicken--cartilage and bits and all. And it was all tasty. I don't feel heavy or greasy at all after eating it. and thats a fantastic thing.\n\nthe angel biscuit had a distinct taste that i could not recall...but my friend did--croissant! and then we agreed that its because its filled with butter. fluffy. i wish i had gotten sausage gravy too.\n\nall that for $9.50. a really fantastic lunch, served in a brown waxed box with compostable fork and spoon. super cute booth in the alley too. i saw a pug and a baby! on a sunny day in SF, what more could you want?\n\n(note: metered parking wasn't that bad when i went at 11am on a Friday. around the corner there were at least 8 spots up and down the street. a quarter for five minutes though, yow. we put in 15 minutes, and saw a meterman drive up to my car when i was about to cross. the light had just turned red and i was trying to dance between zooming cars and yelling out \"sir! please! sir! that's my car!\". luckily i ran up and said pleeeease don't give me a ticket i was here and the light was red and...he said be more careful and zoomed off. i feel like i defeated a dragon, yay! thank you sir!)", "rating": 5, "date": "2009-06-26"}, {"excerpts": ["Yes I agree with all please get the sausage gravy on the side ", "it was good!"], "author": "Karen T.", "review": "The chicken was good I got a piece of white meat and it was moist but not succulent moist but very flavorful. The tea was yummy refreshing and the biscuit was yummy! Yes I agree with all please get the sausage gravy on the side it was good!", "rating": 4, "date": "2009-10-11"}, {"excerpts": ["The sausage gravy is the BOMB!"], "author": "C G.", "review": "I love this spot! When it's around 10:30am and you're stuck at work only able to daydream about a leisurely  brunch w/ friends, it's great to have a dee-lish option nearby to at least fulfill the waffle portion of your daydream.\n\nSo far I've had the fried chicken, Cobb salad, curried sweet potato/coconut/cilantro soup, and waffles and everything's been yummy. My friend had a shrimp po'boy that looked decent, but messy to eat when you're hanging out on the loading dock across the way. \n\nThe sausage gravy is the BOMB!", "rating": 5, "date": "2010-01-13"}, {"excerpts": ["- side of fries\n(dump the bay seasonings, siracha and side o' sausage gravy on the fries.) \n\n- dublin dr. "], "author": "eliza w.", "review": "it's true. i'm one of those cubical workers that never gets out for lunch. that may all change, thanks to this fab hole in the wall! \n\nhad a lovely sunny lunch with boss lady and roxy...will hafta get back for the waffle dog (andoille in a blanket!) and next time I'll skip the waffle, and go for the chicken box, or get a po'boy. and a biscuit. and gravy. \n\nmmmmm...ok, here's what we ordered:\n\n- 2 pcs chicken \n(leg and thigh. make sure you eat the them down to the bone. bonus--crunch through to the marrow)\n\n- waffle\n(smallish, but good. bsk's waffles still reign supreme. true that the syrup coulda been thicker, but it was reasonably tasty.)\n\n- side of fries\n(dump the bay seasonings, siracha and side o' sausage gravy on the fries.) \n\n- dublin dr. pepper\n(overpriced at two bucks, but yer paying for cute packaging and cane sugar. it's ok.) \n\nand yes, stay tooned for the upcoming chicken and waffles listy. it's time.", "rating": 4, "date": "2009-07-06"}, {"excerpts": ["The waffle + sausage gravy is the perfect side.  ", "The seemed to have a really steady flow of people buying fried chicken.  ", "The wait sucked at noon...but it does move.  ", "It's in a really odd location as you have to head down an alley and look for the walk up counter.  ", "This place is definitely going into the normal lunch rotation..."], "author": "Simon Y.", "review": "So far so good.  I went here last week and got the fried chicken + waffle special.  The fried chicken really is good.  The waffle + sausage gravy is the perfect side.  The seemed to have a really steady flow of people buying fried chicken.  The wait sucked at noon...but it does move.  It's in a really odd location as you have to head down an alley and look for the walk up counter.  This place is definitely going into the normal lunch rotation...", "rating": 4, "date": "2009-05-25"}], "lunch  piece": [], "lunch jalapeno coleslaw": [], "lunch cheddar grits": [], "lunch mac n cheese": [], "lunch collard greens": [], "lunch mashed sweet potatoes": [], "lunch angel biscuits": [], "lunch mushroom gravy": [], "lunch sausage gravy": [], "lunch mini jalapeno corn muffins": [], "lunch seasoned fries": [], "lunch  piece crispy fried chicken": [], "lunch blackened gulf shrimp and grits": [], "lunch andouille and cheddar grits": [], "lunch bbq pulled pork grits": [], "lunch veggie grits": [], "lunch bbq pork sandwich": [], "lunch fried chicken poboy": [], "lunch shrimp poboy": [], "lunch catfish poboy": [], "lunch breakfast poboy": [], "lunch veggie poboy": [], "lunch seafood gumbo": [], "lunch smoked turkey chili": [], "lunch market salad": [], "lunch hearty cobb salad": [], "lunch caesar salad": [], "lunch breakfast waffle plate": [], "lunch big skillet breakfast sandwich": [], "lunch angel biscuits and gravy": [], "piece fried chicken and side": [{"excerpts": ["Parking: expensive metered sf parking - take bus \nLine: no line\nService: order your self and they bring food to your table\n\nOrdered the two piece fried chicken and side of Mac&cheese "], "author": "Simon L.", "review": "Parking: expensive metered sf parking - take bus \nLine: no line\nService: order your self and they bring food to your table\n\nOrdered the two piece fried chicken and side of Mac&cheese which was $12 and filling for one person.  The fried chicken came with a wing and a breast but varied for other people.  The outside was crispy and the white meet inside was not dry and flavorful.  I'd you ordered the waffles instead, add the syrup to the chicken for a sweeter flavor.  The Mac and cheese was super cheesy.  Plates also come with a slice of watermelon to cleanse the palette a little at the end.  Hella good, perfect place to go after a Giants game.\n\n\nRecommend it!", "rating": 5, "date": "2016-10-02"}], "piece fried chicken and  sides": []}