{"salt cod beignets with tartar sauce": [{"excerpts": ["Salt Cod Beignets with Tartar Sauce ", "(snack)--This is a must-order. "], "author": "Liz S.", "review": "My foodie friend Nora was in town and had been wanting to go to Lord Stanley, so we decided to give it a go on a Wednesday. \n\nFirst, I want to say that I felt the service was 5 stars. Our server was super knowledgable about wines, very friendly and attentive. I also was poundinggggg water and the filled it up constantly. \n\nThe other thing that put the service over the top, was that my boyfriend joined us at the end of the meal and they not only let him pull up a chair, (It's a very small space, so not a ton of extra seating) but also included him in the complimentary after-dinner fudge pieces they served us. \n\nThe food however, was really hit or miss. Some dishes were really tasty and innovative and others really felt confused. \n\nAs many of the other reviews have said, the portion sizes are pretty small. We got two snacks, one starter, two entrees, and a dessert between the two of us, and I didn't leave feeling full. \n\nWe ended up ordering: \n\nAged Gouda Puffs (snack)--I *think* they were delicious but there were also smaller than bite-sized. I would skip these and also don't really remember anything about them other than the size.\n\nSalt Cod Beignets with Tartar Sauce (snack)--This is a must-order. Perfectly fried and savory, we also dipped our remaining table bread into the tartar sauce until the bowl was clean. \n\nScallop and White Onion (starter)--This dish was one that seemed confused and also wasn't the best looking dish. (Everything on the plate is dark green, cream, or brown,) We were served four thin scallops on top of an pretty large onion slice, with some brown seaweed on top. (They market this as \"mermaid's hair.\") I thought it was OK, but would not order this again. Overall, our consensus was that the scallops were not that exciting... They were just sort of served as cooked scallops, not seared or anything. \n\nBlack Cod with Green Cabbage and peas (Main)--The mains were the best part of the meal, in my opinion. They were cooked the best, tasted the best, and looked the best. I loved the curry sauce they served the fish in, and the peas were tasty and colorful. \n\nLamb Chop and Belly with Roasted Potatoes--This was by far my favorite thing we ordered. I'd never have lamb belly before, and they did this so, so well. My friend described it as, \"Like pork belly, but wayyyy danker.\" If you come to Lord Stanley, I would go as far to say, this is the one thing you should not miss eating. \n\nRed Berry Eaton Mess with Ice-Cream and Verjus--MAN was this dessert confused and dare I say--was kind of a mess. I'd never eaten a dessert that had more going on and it definitely did not need to. There were berries, there was ice-cream, there were little jello pieces, and to top it all over there were these freeze-dried pieces of pink, fruit slabs... the only way I can describe them is they looked like and had the consistency of styrofoam you would use for home construction. \n\nThe dessert looked really pretty but, whoa, so much going on and did not really taste good. \n\nI really enjoyed my time at Lord Stanley because our server was fun and the service was so good. However, the food was very up and down, and coupled with the Michelin Star price tag, I don't think I would come back.", "rating": 3, "date": "2018-06-01"}, {"excerpts": ["The salt cod beignets with tartar sauce was surprisingly light for a savory beignet. \n\n"], "author": "Bailey Z.", "review": "It's been a while since I've dined at a Michelin starred restaurant, but after reading a feature in the Chronicle last evening, I thought I'd give Lord Stanley a try. Recently voted as the #3 Best New Restaurant in Bon Appétit magazine, I was intrigued by a menu that had local Californian dishes with Asian and European influences. The space is somewhat small, holding no more than 30 people, but the high ceiling and second level gives it a roomier appearance. \n\nThe menu features an $83 tasting menu (7-8 courses with a supplemental confit foie gras) as well as an a la carte menu. Many restaurants now feature a snacks section; small bites meant to tide one over until starters are served. These hors d'oeuvre have become my favorite part of the meal and is usually the most flavorful. Although I loved them all, my favorite has to be the roasted chicken wings with lemon (aïoli). That one bite of chicken was very tender and juicy and left me wanting more. Coming in at a close second was the onion petals and sherry vinegar. One of the most unique and aesthetically pleasing plates, I think the Bon Appétit article described it best as \"Cipolline onion petals, filled with a thimble of puréed sherry-vinegar soubise, tasted like the purest distillation of an onion.\" The salt cod beignets with tartar sauce was surprisingly light for a savory beignet. \n\nBecause of the multitude of snack items and house baked bread, we decided to skip the starters and go straight to the entrees. I tried the halibut, short ribs, and the roasted lamb loin and belly. All the meats were cooked to perfection. Of the three, if you're a fan of lamb, it's a must try. The potatoes soaked up all the lemon and the acidity really brightened the dish. \n\nFor desserts, if you're feeling adventurous, try the goats cheese tart; otherwise, stay clear. The tart taste was sharper than I imagined. It had a light crust, which I liked, but the black garlic and lavender combination takes some getting used to. I loved the chocolate pudding, especially the black sesame crisp. The sesame flavor was bold and the entire dish tasted like a deconstructed version of sesame mochi ice cream. \n\nOverall, the service and the food were excellent. The execution on the dishes were spot on.  And the value is great for a Michelin starred restaurant. Parking around Polk was relatively easy since the meters end at 6 pm. Lastly, don't give up on reservations as I rechecked times on Reserve on the day of (in the morning) and found one around a more reasonable dining hour pop up.", "rating": 5, "date": "2016-08-25"}, {"excerpts": ["-- SALT COD BEIGNETS with Tartar Sauce...", "$7\n", "(http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=lfFIyZgEhdjJlYTjl1hEag)\n", "It may have looked weird/unappetizing, but this was my favorite dish (I should've just had a few of these for dinner).  ", "The beignets were slightly crispy on the outside and soft, fluffy, and delicious on the inside.  "], "author": "Mike L.", "review": "*check in on Yelp*\n\nTen minutes later...\n\n(text from friend): Dude, saw you're at Lord Stanley.  Hope your experience goes better than ours did.  Two stars, at best.\n\nNeedless to say, reading that didn't inspire much faith in what I had (literally) just ordered.  However, after recalling our differing views on State Bird Provision and Mission Chinese Food, as well as after learning from one of my dining companions that Lord Stanley had received a Michelin star, I still had some hope that my experience would end differently.\n\nTwo and a half hours later...it didn't.\n\nNow, to be fair, nothing I had was terrible, though I question the Michelin star.  The menu changes relatively often, but it definitely tilts towards Modern European (much like the decor's IKEA-esque showroom look).  A tasting menu (~$78) is usually offered alongside the a la carte option, but the four of us passed on it since it didn't include any of the dishes that caught our eye.\n\n-- ONION PETALS with Sherry Vinegar...$5\n(http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=ZjTN2JRc529Cg7dS-NNumg)\nWhile the presentation was admittedly nice, I wasn't a fan of their use of wood chips.  As for the petals, I thought the onion's sweetness worked well with the filling.  However, it was hard for me to get past the fact that the overall taste was similar to French onion chip dips.\n\n-- ROASTED CHICKEN WINGS with Orange Sweet & Sour Sauce...$5\n(http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=UsGes_em8i0J5s-yyz4qIg)\nWings?  More like bites.  As much as I appreciated the chicken being deboned, this dish left me with mixed feelings.  I liked the chicken itself (the skin was decently crisp and the meat was juicy), but the sauce was a miss (a little too citric and sweet for me).\n\n-- SALT COD BEIGNETS with Tartar Sauce...$7\n(http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=lfFIyZgEhdjJlYTjl1hEag)\nIt may have looked weird/unappetizing, but this was my favorite dish (I should've just had a few of these for dinner).  The beignets were slightly crispy on the outside and soft, fluffy, and delicious on the inside.  Plus, I liked how the tartar sauce tasted slightly herbaceous.\n\n-- FOIE GRAS CONFIT with Quince, Walnut, and Warm Brioche...$24\n(http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=_ap15ML2BslcO-jcZ4WDNg)\nMy first foie gras dish since the ban ended and it underwhelmed.  The overall taste was no different than any other foie gras confit I've had in the past and the quince could've used more acidity to cut through the dish's richness.  Also, while I liked the brioche itself, another type of bread might have made for a better vessel.\n\n-- BARBECUED PORK SHOULDER with Turnips, Licorice, and Burnt Apple...$27\n(http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=z5xGmLzDtajkrEVQowZOpg)\nA Tale of Two Cities?  More like a tale of two porks.  One piece was great (slightly fatty, moist, and tasty) while the other failed (overcooked, dry, and burnt).  Sadly, the rest of the plate didn't help either, as the overly charred turnips and apples only added to the bitterness.\n\n-- LEMON & YUZU TART with Sea Salt Meringue...$11\nOutside: (http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=SpzuAHBESLm7HNW014BFoA)\nInside: (http://www.yelp.com/biz_photos/lord-stanley-san-francisco?select=BqDib4mLPehiUFh5hNkxjg)\nAs disappointed as I was with most of what I had, I still had hopes for the dessert.  Thankfully, it was actually pretty decent.  The crust was neither dense nor thick, the lemon added just the right tartness, and I liked the overall contrast of salt and sweet from the meringue.\n\nAlso, for what it's worth, there were a few dishes that my friends ordered which seemed a bit more successful than what I had.  While I didn't try either one, the Roasted Duck and Pan Fried Monkfish went over relatively well with my friends, so they might be worth a shot.  However, we all agreed that the Chocolate Chiboust dessert is a must get (the one bite I had was enough).\n\nAs far as service went, I thought our two main servers were generally friendly, helpful, and prompt with our requests.  However, things got rather awkward when, after having confirmed with a server that tip was already incorporated into their prices, a gentleman (manager?) came up to our table to notify us that their policy changed and that, as such, we didn't tip them.  Obviously, it was just a misunderstanding (we explained what happened), but we all agreed his approach could have used a softer touch (he came across mildly condescending, particularly when he went into detail about why their previously policy was unsustainable).\n\nAll in all, TWO AND A HALF STARS rounded down.  While there were some highlights, there were just too many negatives to the experience, especially given the price point.", "rating": 2, "date": "2016-02-08"}], "onion petals and sherry vinegar": [{"excerpts": ["-- Onion Petals and Sherry Vinegar ($5) - people had raved about this dish, but unfortunately was a miss for us.  ", "Texture was slightly off-putting- ", "our petals were a bit on the soft side so overall ate very mushy and heavy on the palette.  ", "We both had one bite and didn't want to eat any ", "more(and "], "author": "Audrey H.", "review": "Unfortunately a disappointment for a birthday dinner with my date.  Ambiance and service was nice, but food was mediocre / small / makes me think it isn't quite to Michelin Star level.  Maybe I'm nit-picking b/c it was a birthday, but I almost felt bad for taking my date here.\n\nVenue / Service: surprised how many people they fit into the space; slightly cramped for me but not the worse I've seen.  Nice minimal decor and romantic lighting.  It did seem to be a bit slow in the kitchen that day since we had to wait 15 min from our reservation time before sitting down and food overall was coming out a bit on the slow side, considering how small the dishes were (see below).  Otherwise, the staff were pretty nice- they remembered I had called asking a birthday question and so our menus had a birthday message for my date!\n\nFood: overall, not terrible but I feel like I've had better quality Michelin Star meals than this.  Also doesn't help that portions were on the smaller side.  \n-- Grilled Trumpet Mushrooms with Miso-Yam Dip ($7) - interesting combo of the miso with yams, perhaps one that I am ok not revisiting.  Mushrooms were a bit on the oily side and were slightly limp when you picked it up with a fork but otherwise tasted good.  In fact, we mainly ate the mushrooms without the dip.\n\n-- Onion Petals and Sherry Vinegar ($5) - people had raved about this dish, but unfortunately was a miss for us.  Texture was slightly off-putting- our petals were a bit on the soft side so overall ate very mushy and heavy on the palette.  We both had one bite and didn't want to eat any more(and my date usually hates leaving food uneaten).  \n\n-- Razor Clams with Vinaigrette (price unknown per clam) - at least this appetizer made up for the onion petals a bit!  Love the refreshing sweet-sour flavors from the sweet razor clams and the vinaigrette, and the slightly chewy / crunchy texture of the clams made the dish even more interesting.  Only wish we could have had more of it!\n\n-- Pan Fried Scallop w/ Candied Parsnip, Beurre Blanc and Vegetable Jus ($18) - we asked to split this, and didn't realize it only included one scallop (so they served each of us half a scallop).  Feel like most places would give 2 scallops for an appetizer at least, so we were slightly disappointed with the portion size.  Scallop itself was nicely cooked, but wasn't a fan of the beurre blanc since it made the dish overall feel a bit heavy and rich.\n\n-- Seared Monkfish w/ Mushroom Broth, Black Trumpets and Cauliflower ($34) - another favorite of the night!  Monkfish was well cooked- not overcooked and not mushy like some places had served before.  The monkfish worked well with the earthy broth and black trumpets!  Again, wish I could have had more.\n\nMy date ordered the Roasted Lamb Chop and Belly with Carrot Tart, Min and Lamb Jus ($36) and they only serve one measly chop.  My date, who loves lamb, felt a little jipped, even though it was tasty (but not mind-blowingly so).  I even thought that we should have ordered a second portion for him to fill him up.\n\nBecause of all of this, we decided to skip dessert and ended up leaving and grabbed fish tacos somewhere else, which made the night so much better.\n\nAll in all, maybe it was a busy night or something, but we both felt the quality / quantity wasn't quite there.  Perhaps we should have ordered more dishes, but unfortunately this Michelin Star was a miss for me... and that's a first.", "rating": 3, "date": "2018-02-20"}, {"excerpts": ["Coming in at a close second was the onion petals and sherry vinegar. ", "One of the most unique and aesthetically pleasing plates, I think the Bon Appétit article described it best as \"Cipolline onion petals, filled with a thimble of puréed sherry-vinegar soubise, tasted like the purest distillation of an onion.", "\" "], "author": "Bailey Z.", "review": "It's been a while since I've dined at a Michelin starred restaurant, but after reading a feature in the Chronicle last evening, I thought I'd give Lord Stanley a try. Recently voted as the #3 Best New Restaurant in Bon Appétit magazine, I was intrigued by a menu that had local Californian dishes with Asian and European influences. The space is somewhat small, holding no more than 30 people, but the high ceiling and second level gives it a roomier appearance. \n\nThe menu features an $83 tasting menu (7-8 courses with a supplemental confit foie gras) as well as an a la carte menu. Many restaurants now feature a snacks section; small bites meant to tide one over until starters are served. These hors d'oeuvre have become my favorite part of the meal and is usually the most flavorful. Although I loved them all, my favorite has to be the roasted chicken wings with lemon (aïoli). That one bite of chicken was very tender and juicy and left me wanting more. Coming in at a close second was the onion petals and sherry vinegar. One of the most unique and aesthetically pleasing plates, I think the Bon Appétit article described it best as \"Cipolline onion petals, filled with a thimble of puréed sherry-vinegar soubise, tasted like the purest distillation of an onion.\" The salt cod beignets with tartar sauce was surprisingly light for a savory beignet. \n\nBecause of the multitude of snack items and house baked bread, we decided to skip the starters and go straight to the entrees. I tried the halibut, short ribs, and the roasted lamb loin and belly. All the meats were cooked to perfection. Of the three, if you're a fan of lamb, it's a must try. The potatoes soaked up all the lemon and the acidity really brightened the dish. \n\nFor desserts, if you're feeling adventurous, try the goats cheese tart; otherwise, stay clear. The tart taste was sharper than I imagined. It had a light crust, which I liked, but the black garlic and lavender combination takes some getting used to. I loved the chocolate pudding, especially the black sesame crisp. The sesame flavor was bold and the entire dish tasted like a deconstructed version of sesame mochi ice cream. \n\nOverall, the service and the food were excellent. The execution on the dishes were spot on.  And the value is great for a Michelin starred restaurant. Parking around Polk was relatively easy since the meters end at 6 pm. Lastly, don't give up on reservations as I rechecked times on Reserve on the day of (in the morning) and found one around a more reasonable dining hour pop up.", "rating": 5, "date": "2016-08-25"}, {"excerpts": ["We started ONION PETALS AND SHERRY VINEGAR - this is the most unique and addictive thing I've ever had. ", "Get this, it's a good $5 bucks spent. ", "For two people I'd order two of these because you'll want more trust me. ", "Next we got the ENGLISH PEAS, FRESH CURDS, CARROTS AND DILL. ", "This was so fresh and light! ", "Our last starter was the BEEF TARTAR WITH SEAWEED, CUCUMBER, AND NORI CRACKER. ", "My fiancé LOVED this "], "author": "Jess O.", "review": "I'm SO happy this place is finally open! I live 2 houses down from Lord Stanley and I have been waiting for it to open. Holy Cow this place is my new favorite! \n\nWe started ONION PETALS AND SHERRY VINEGAR - this is the most unique and addictive thing I've ever had. Get this, it's a good $5 bucks spent. For two people I'd order two of these because you'll want more trust me. Next we got the ENGLISH PEAS, FRESH CURDS, CARROTS AND DILL. This was so fresh and light! Our last starter was the BEEF TARTAR WITH SEAWEED, CUCUMBER, AND NORI CRACKER. My fiancé LOVED this I like it, but the reason I  say liked is because I'm just starting to appreciate beef tartar.\n\nFor our entrees I ordered the POACHED HEN, RADISHES AND BARLEY, POULTRY JUS. Very flavorful! The only thing I wished was it didn't come with chicken thighs. They give you both the breast and thigh but I'm more of a breast person in general. My fiancé got the SLOW COOKED AND GRILLED LAMB SHOULDER, ALLIUMS AND LEMON and wow I wish I got that but next time!\n\nRemember this place includes tip in their menu already. I think that's such a wonderful idea.\n\nGo here! You won't be disappointed!", "rating": 5, "date": "2015-06-16"}], "roasted chicken wings with lemon": [{"excerpts": ["Although I loved them all, my favorite has to be the roasted chicken wings with lemon (aïoli). ", "That one bite of chicken was very tender and juicy and left me wanting more. "], "author": "Bailey Z.", "review": "It's been a while since I've dined at a Michelin starred restaurant, but after reading a feature in the Chronicle last evening, I thought I'd give Lord Stanley a try. Recently voted as the #3 Best New Restaurant in Bon Appétit magazine, I was intrigued by a menu that had local Californian dishes with Asian and European influences. The space is somewhat small, holding no more than 30 people, but the high ceiling and second level gives it a roomier appearance. \n\nThe menu features an $83 tasting menu (7-8 courses with a supplemental confit foie gras) as well as an a la carte menu. Many restaurants now feature a snacks section; small bites meant to tide one over until starters are served. These hors d'oeuvre have become my favorite part of the meal and is usually the most flavorful. Although I loved them all, my favorite has to be the roasted chicken wings with lemon (aïoli). That one bite of chicken was very tender and juicy and left me wanting more. Coming in at a close second was the onion petals and sherry vinegar. One of the most unique and aesthetically pleasing plates, I think the Bon Appétit article described it best as \"Cipolline onion petals, filled with a thimble of puréed sherry-vinegar soubise, tasted like the purest distillation of an onion.\" The salt cod beignets with tartar sauce was surprisingly light for a savory beignet. \n\nBecause of the multitude of snack items and house baked bread, we decided to skip the starters and go straight to the entrees. I tried the halibut, short ribs, and the roasted lamb loin and belly. All the meats were cooked to perfection. Of the three, if you're a fan of lamb, it's a must try. The potatoes soaked up all the lemon and the acidity really brightened the dish. \n\nFor desserts, if you're feeling adventurous, try the goats cheese tart; otherwise, stay clear. The tart taste was sharper than I imagined. It had a light crust, which I liked, but the black garlic and lavender combination takes some getting used to. I loved the chocolate pudding, especially the black sesame crisp. The sesame flavor was bold and the entire dish tasted like a deconstructed version of sesame mochi ice cream. \n\nOverall, the service and the food were excellent. The execution on the dishes were spot on.  And the value is great for a Michelin starred restaurant. Parking around Polk was relatively easy since the meters end at 6 pm. Lastly, don't give up on reservations as I rechecked times on Reserve on the day of (in the morning) and found one around a more reasonable dining hour pop up.", "rating": 5, "date": "2016-08-25"}], "pickled trumpet mushrooms with almond and garlic": [{"excerpts": ["A little crunchy and almost buttery - delicious.\n- Pickled trumpet mushrooms with almond and garlic. ", "Also delicious, not too vinegar-y as we had worried. \n", "- Confit trout. ", "Perfect, smokey and practically melted in your mouth. ", "Our favorite dish.\n- Short rib with charred eggplant. ", "Didn't love the eggplant but the short rib was outstanding. ", "Perfectly cooked.\n"], "author": "R M.", "review": "Really outstanding experience from start to finish. My girlfriend and I came here on a random, last minute decision since we live in the neighborhood and have been most everywhere else in the Polk vicinity. We were a bit concerned about the price, that it would be a fistful of cash for tiny portions. It's not cheap, but we both left very satisfied and felt it was worth it.\n\nWe had:\n- Onion petals with sherry vinegar. A little crunchy and almost buttery - delicious.\n- Pickled trumpet mushrooms with almond and garlic. Also delicious, not too vinegar-y as we had worried. \n- Confit trout. Perfect, smokey and practically melted in your mouth. Our favorite dish.\n- Short rib with charred eggplant. Didn't love the eggplant but the short rib was outstanding. Perfectly cooked.\n- Roasted lamb loin and belly. Lamb made exactly how it should be, juicy and great flavor.\n- Summer berry and elderflower desert (\"Eton Mess\"). Very good, perfect to share for two. We weren't even that hungry at this point and we devoured it.\n\nComing out of the dinner, we tried to rate what our favorite dish was (the confit trout won), but agreed everything could have been labelled a \"favorite\" since it was really all that good.\n\nWe also got a bottle of wine, but I can't remember the name exactly. It was similar to beaujolais, and was around $60. The wine list has a lot of reasonably priced options (and some not so reasonable if you're into that). You can definitely find a bottle in the $50 - $70 range no problem.\n\nFinally this leaves the service, which was excellent. Recommendations were forthcoming, the knowledge of the wine list was obvious, and dishes were quickly removed when we were done.\n\nAs an aside, I'm sorry to hear this Michelin star rated restaurant is \"way below\" Sora's standards, but she's flat wrong. A highly rated restaurant isn't just about \"unique\" ingredients, it's about the quality, presentation, and most importantly the TASTE of the food, not to mention the service, etc. It definitely is at least on par with SQPR or Aster (both have one star), both of which I've been to recently.\n\nGlad to have Lord Stanley in the neighborhood! I'll definitely be back.", "rating": 5, "date": "2016-07-22"}], "sweet corn pudding egg yolk paprika and spice bread": [], "confit trout yukon potato beurre blanc and sorrel": [], "heirloom tomato cherry tomato water with fresh curds and cardamom": [], "wagyu tartar with tomato mustard and smoked oil": [], "seared sweet potato": [], "local halibut": [{"excerpts": ["Local Halibut (from Monterey), $35: ", "This was the only dish I was very disappointed with. "], "author": "Andy L.", "review": "This was a fantastic meal and evening overall, from atmosphere to service to of course, the aliments. I'll break this down one-by-one from the a la carte menu:\n\nOnion Petals, $5: the only item that's been on the menu throughout its 2+ years of existence. These were INCREDIBLE. Everything from the crunchy vs. silky texture juxtaposition, to the freshness of the onions and the tantalizing tang of the sherry cream, it was all mouthwatering. ***Don't miss out on these.***\n\nOlives, $6: really potent smoky flavor - very unique - would recommend if sharing with at least 4 people, as you'll only need a few each.\n\nPan-seared scallop, $18: probably the best scallop I've ever had. This one from was Cape Cod, and it was cooked to perfection.\n\nLocal Halibut (from Monterey), $35: This was the only dish I was very disappointed with. It was definitely overpriced by about $15-20, and despite its really awesome delicate texture, it lacked flavor and the accompaniments did not complement it well.\n\nHeritage Hen, $35: By far the best thing on the menu. Where to begin, wow this was an amazing dish. From the presentation, to the layers and layers of taste, texture, surprises, etc. The hen jus, the small button mushrooms, and the picture-perfect potato galette underneath all contributed to the majesty that is the Lord Stanley Heritage Hen.\n\nHoney-glazed Tomato, $12 (dessert): This was also fantastic. Have you ever had a sweet (but still savory) version of a sun-dried tomato? I hadn't. Oh, but wait, the tomato still oozes out warm juice from the inside upon biting into it! All with a creme fraîche ice cream and a brûlée of poppyseed to give it a beautiful appearance, this was one of the most unique and satisfying desserts I've had in a long time.\n\nThank you Melanie, Catherine, Chef Rupert, and others for the amazing experience! Michelin star well deserved. I will surely be back to this neighborhood gem soon.", "rating": 5, "date": "2017-10-18"}, {"excerpts": ["Wagyu beed tartar with summer truffle and hazelnut\nLocal Halibut with mussels and garlic, lemongrass braissage\nRoasted suckling pig with toasted almond, daikon and radish\nStrawberry and elderflower 'Eton Mess'\nChocolate tart with se salt and fennel pollen\n\nAs you can see we had a great tasting of what Lord Stanley has to offer. "], "author": "Deanna B.", "review": "Loved every minute of our experience.  \nBeginning with the wonderful service.  Our waiter was our main point of contact the entire time.  I say this because often you go to restaurants and you have one person seat you, one take your order, different ones bring you your food, etc.  I liked the intimacy of the one point of contact and it goes with the intimacy of the small space and small but carefully curated menu.\nThe helpful descriptions and recommendations were all winners.  I was convinced to order the halibut rather than the mushroom dish and was extremely pleased with the decision.\n\nAs for the food - all such interesting mixes of flavors and creativity went into every dish and each bite was incredible.  For example the first small plate we had was the fava beans.  Served inside the open pod carefully placed among avocado cream, alongside slices of green olives and a sprinkling of sprouts on top.  These are the kind of combinations of flavors you never expect but pair perfectly.  The presentation is like art and the flavor is extraordinary.\nEvery dish that followed felt the same way.  The other dishes we had between the 2 of us were: Onion petals with sherry vinegar\nChicken wings with lemon\nEnglish peas with fresh curds, mint and pistachio\nWagyu beed tartar with summer truffle and hazelnut\nLocal Halibut with mussels and garlic, lemongrass braissage\nRoasted suckling pig with toasted almond, daikon and radish\nStrawberry and elderflower 'Eton Mess'\nChocolate tart with se salt and fennel pollen\n\nAs you can see we had a great tasting of what Lord Stanley has to offer. Nothing here is ordinary or basic.  Nothing is done without considerable thought into every aspect of the dish and its presentation.\n\nIt is expensive, but well worth it for a special dinner out.", "rating": 5, "date": "2016-05-23"}], "slow cooked short rib": [{"excerpts": ["[Mains]\n- Slow cooked short rib - This was definitely my favorite dish of the night. ", "The short rib was fatty, tender, and full of flavor. \n", "- Pan fried Seabass - I was not feeling the sauce in this dish. "], "author": "Cindy A.", "review": "3.5 stars\n\nMy friend suggested Lord Stanley and I was hesitant at first due to the wide range of ratings. Many of my Yelp friends who I usually agree with gave Lord Stanley a 1-2 stars. \n\nIt may be that I came in with low expectations, but I was happy with my meal here. My friend and I decided not to do the tasting menu and did dinner a la carte . We ordered the following:\n\n[Snacks]\n- Black squid ink churro - the dish sounds better than it taste. First off, the dish does not look appealing, at all (imagine poop emoji). Second, the churro was not crispy like a normal churro.\n\n[Starters]\n- Sweet potato with sweet potato ribbons - They took thin ribbons of sweet potato, deep fried them and placed it on top of a piece of sweet potato. The ribbons were tasty and fun to eat. Almost like chips. \n- Pickled mussels with dill - interesting flavors and it works, but I wish there were a bit more mussels. \n\n[Mains]\n- Slow cooked short rib - This was definitely my favorite dish of the night. The short rib was fatty, tender, and full of flavor. \n- Pan fried Seabass - I was not feeling the sauce in this dish. It was some type of Asian fish sauce that was just not doing it for me. \n\nMy friend and I both spent about $70 and walked out very full from our meal.", "rating": 3, "date": "2017-01-10"}, {"excerpts": ["For entrees, we ordered the monkfish with curried almond and green olive, and the slow cooked short rib with red win jus. ", "The short rib was one of the most tender pieces of meat I've ever had. ", "I'd order it again! ", "The red wine jus complemented it nicely. ", "The monkfish, on the other hand, fell really flat. ", "The curry sauce it was paired with was mostly a dull, sour flavor, and the starchy root vegetable that came with it didn't elevate anything. ", "I'm all for new experiences, and I have never experienced flavors like this before! "], "author": "Sarah Z.", "review": "This review is mostly for the food. The service and venue were spectacular. It's a beautiful restaurant and I couldn't have had a better experience.\n\nThat said, we didn't have anything we would order again--especially for the price. (The dense, moist, springy bread with cultured butter, that was a highlight! But we didn't pay extra for that.) \n\nWe got the chicken wings and onion petals to start. Out came two little bites of chicken sitting on top of a preserved lemon sauce. Salty/sweet is great! But the chicken wasn't seasoned enough to offset the sweetness of the thick lemon sauce, and the textures were all moist and slimy. The onion petal were super cute! Not sure I would spend $5 on them, though. I was happy to have experienced the creativity of them. \n\nNext, we got the wagyu tartare, which was awesome. It came with what I believe was a browned butter cracker. Delicious! That was the highlight of the meal.\n\nFor entrees, we ordered the monkfish with curried almond and green olive, and the slow cooked short rib with red win jus. The short rib was one of the most tender pieces of meat I've ever had. I'd order it again! The red wine jus complemented it nicely. The monkfish, on the other hand, fell really flat. The curry sauce it was paired with was mostly a dull, sour flavor, and the starchy root vegetable that came with it didn't elevate anything. I'm all for new experiences, and I have never experienced flavors like this before! But I wouldn't choose them over much else. \n\nAnd finally, for dessert we got the goat cheese tart with black garlic and lavender. It was definitely a cheese course and not a sweet dessert like you'd normally expect from a dessert menu. It was tasty, but I wanted something sweet. I also felt a little jipped because they don't give you a full tart--they give you half of a tart. It was clearly once whole, but someone else ate the other half... I get the different presentation, but that thing was once whole. Not that I would have wanted to eat the whole thing! It may have been too big... But the idea that we only got half sort of bothers me, especially when the prices are steep. \n\nSorry I'm being all whiny about the price--everything was done really well! (Except the chicken wings.) But if I'm going to pay a lot for a meal/experience, then I want to be able to say I enjoyed the flavors a lot.", "rating": 3, "date": "2016-11-11"}], "roasted lamb loin and belly": [{"excerpts": ["I tried the halibut, short ribs, and the roasted lamb loin and belly. ", "All the meats were cooked to perfection. ", "Of the three, if you're a fan of lamb, it's a must try. "], "author": "Bailey Z.", "review": "It's been a while since I've dined at a Michelin starred restaurant, but after reading a feature in the Chronicle last evening, I thought I'd give Lord Stanley a try. Recently voted as the #3 Best New Restaurant in Bon Appétit magazine, I was intrigued by a menu that had local Californian dishes with Asian and European influences. The space is somewhat small, holding no more than 30 people, but the high ceiling and second level gives it a roomier appearance. \n\nThe menu features an $83 tasting menu (7-8 courses with a supplemental confit foie gras) as well as an a la carte menu. Many restaurants now feature a snacks section; small bites meant to tide one over until starters are served. These hors d'oeuvre have become my favorite part of the meal and is usually the most flavorful. Although I loved them all, my favorite has to be the roasted chicken wings with lemon (aïoli). That one bite of chicken was very tender and juicy and left me wanting more. Coming in at a close second was the onion petals and sherry vinegar. One of the most unique and aesthetically pleasing plates, I think the Bon Appétit article described it best as \"Cipolline onion petals, filled with a thimble of puréed sherry-vinegar soubise, tasted like the purest distillation of an onion.\" The salt cod beignets with tartar sauce was surprisingly light for a savory beignet. \n\nBecause of the multitude of snack items and house baked bread, we decided to skip the starters and go straight to the entrees. I tried the halibut, short ribs, and the roasted lamb loin and belly. All the meats were cooked to perfection. Of the three, if you're a fan of lamb, it's a must try. The potatoes soaked up all the lemon and the acidity really brightened the dish. \n\nFor desserts, if you're feeling adventurous, try the goats cheese tart; otherwise, stay clear. The tart taste was sharper than I imagined. It had a light crust, which I liked, but the black garlic and lavender combination takes some getting used to. I loved the chocolate pudding, especially the black sesame crisp. The sesame flavor was bold and the entire dish tasted like a deconstructed version of sesame mochi ice cream. \n\nOverall, the service and the food were excellent. The execution on the dishes were spot on.  And the value is great for a Michelin starred restaurant. Parking around Polk was relatively easy since the meters end at 6 pm. Lastly, don't give up on reservations as I rechecked times on Reserve on the day of (in the morning) and found one around a more reasonable dining hour pop up.", "rating": 5, "date": "2016-08-25"}, {"excerpts": ["- Roasted lamb loin and belly. ", "Lamb made exactly how it should be, juicy and great flavor.\n", "- Summer berry and elderflower desert ", "(\"Eton Mess\"). ", "Very good, perfect to share for two. "], "author": "R M.", "review": "Really outstanding experience from start to finish. My girlfriend and I came here on a random, last minute decision since we live in the neighborhood and have been most everywhere else in the Polk vicinity. We were a bit concerned about the price, that it would be a fistful of cash for tiny portions. It's not cheap, but we both left very satisfied and felt it was worth it.\n\nWe had:\n- Onion petals with sherry vinegar. A little crunchy and almost buttery - delicious.\n- Pickled trumpet mushrooms with almond and garlic. Also delicious, not too vinegar-y as we had worried. \n- Confit trout. Perfect, smokey and practically melted in your mouth. Our favorite dish.\n- Short rib with charred eggplant. Didn't love the eggplant but the short rib was outstanding. Perfectly cooked.\n- Roasted lamb loin and belly. Lamb made exactly how it should be, juicy and great flavor.\n- Summer berry and elderflower desert (\"Eton Mess\"). Very good, perfect to share for two. We weren't even that hungry at this point and we devoured it.\n\nComing out of the dinner, we tried to rate what our favorite dish was (the confit trout won), but agreed everything could have been labelled a \"favorite\" since it was really all that good.\n\nWe also got a bottle of wine, but I can't remember the name exactly. It was similar to beaujolais, and was around $60. The wine list has a lot of reasonably priced options (and some not so reasonable if you're into that). You can definitely find a bottle in the $50 - $70 range no problem.\n\nFinally this leaves the service, which was excellent. Recommendations were forthcoming, the knowledge of the wine list was obvious, and dishes were quickly removed when we were done.\n\nAs an aside, I'm sorry to hear this Michelin star rated restaurant is \"way below\" Sora's standards, but she's flat wrong. A highly rated restaurant isn't just about \"unique\" ingredients, it's about the quality, presentation, and most importantly the TASTE of the food, not to mention the service, etc. It definitely is at least on par with SQPR or Aster (both have one star), both of which I've been to recently.\n\nGlad to have Lord Stanley in the neighborhood! I'll definitely be back.", "rating": 5, "date": "2016-07-22"}], "fresh goats cheese tart black garlic and olive": [], "summer berry and elderflower eton mess": [], "grilled peach with lillet and green olive": [], "chocolate chiboust genmai cha ice cream and tea cake": []}