{"market fresh oyster selection": [], "gulf prawns": [], "tuna tartare": [{"excerpts": ["The tuna tartare was so different.  ", "It had cucumber and avacado in it.  ", "I guess that's not what I expected. "], "author": "Rachael C.", "review": "My friend and I got there around 8:30 after a few drinks from another place.  \nWe wanted somewhere that served good drinks and decent food. \n\nI got a cocktail, which is pretty good. \nThe food was just okay.  The tuna tartare was so different.  It had cucumber and avacado in it.  I guess that's not what I expected. The duck rillette was just okay.  The burger was probably the best. Very juicy.  I probably will go back for drinks only.", "rating": 3, "date": "2016-10-15"}, {"excerpts": ["We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. ", "AH-MAZING. ", "We will definitely be back!"], "author": "Alexis N.", "review": "Fantastic food! Lots of delicious options. We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. AH-MAZING. We will definitely be back!", "rating": 5, "date": "2018-03-10"}, {"excerpts": ["We also had the tuna tartare, and to be quite frank, this was the most disappointing tuna tartare I've ever had. ", "The fish seemed fresh enough, but there were too many cucumbers, and the avocado was nowhere near ripe enough. "], "author": "Yasir S.", "review": "A couple of weeks ago, a few of us were looking for a bite on a Sunday evening in SOMA. The reviews for Lord George looked pretty good, so we decided to try it out.\n\nWhen we arrived, the kitchen was closing (so most of the main menu was unavailable to us), but our server told us that there were a few things we could still order. So order we did.\n\nThe charcuterie plate was good. We had 3 meats and 2 cheeses, and added the asparagus to that as well. The asparagus was great. There's no way to screw up cured meats and cheese (unless you offer bad selections), so that was a win.\n\nWe also ordered some french fries to share. They were good, but again, a side dish that's hard to mess up.\n\nI had two glasses of wine, both of which I enjoyed.\n\nTwo of us also order the clam chowder. This is where it went south (record scratch!). Not trying to sound overly sensationalistic, but I've had better chowder out of a can. It was watery with very little flavour, the clams were rubbery (perhaps forgivable since it was the end of the night for their kitchen), but essentially I got a big bowl of potatoes. The menu described it as being made with bacon (as a good chowder should), but instead, we got bacon bits crumbled on top. No smoky flavour in the soup. In fact, no flavour at all.\n\nWe also had the tuna tartare, and to be quite frank, this was the most disappointing tuna tartare I've ever had. The fish seemed fresh enough, but there were too many cucumbers, and the avocado was nowhere near ripe enough. On top of that, there seemed to be no flavour in it at all -- just completely bland (see a theme here?).\n\nI'm not completely writing them off, as I didn't get to try their mains, and we caught them at a time which might not have allowed them to put their best foot forward. But between the lousy chowder and tartare, and the grim, unwelcoming, snarky attitude of our server (don't worry, the rest of the staff were nice), I would have to be pretty desperate not to immediately go elsewhere.", "rating": 2, "date": "2016-06-24"}], "the lords platter": [], "charcuterie  salame calabrese  salame rosa  capicola": [], "cheese  brillat savarin cow  barely buzzed cow  ewenique sheep": [], "crudite  heirloom carrot  delta asparagus  broccolini": [], "warm marinated olives": [], "sweet  salty almonds": [], "french fries": [{"excerpts": ["To balance out our meal, we also ordered some french fries ($7). "], "author": "Annie N.", "review": "My bf and I stopped by for a late night snack because I was craving oysters. It was Sunday night and they had a great all day happy hour special going on. EVERY Saturday and Sunday, ALL DAY, you can get half off oysters and $25 bottles of bubbles. Our main draw was the $1 oyster special. \n\nWe got a dozen of fanny bay oysters for $1 each (they were the dollar special ones for that day) and a dozen of the church point oysters for $1.87 each. All the oysters were cold and fresh. The church points were incredibly creamy with a slight sweetness. The fanny bays weren't as creamy which was a nice texture difference since we got so many oysters. To balance out our meal, we also ordered some french fries ($7). They came with a delicious garlic aioli and were super crisp and tasty.\n\nOverall will definitely be back for the oyster specials.", "rating": 4, "date": "2017-12-04"}, {"excerpts": ["The French fries took about 30 minutes to come out -well worth the wait. ", "When we checked on the status he told us it'll come when it comes... "], "author": "Shannon H.", "review": "Food - We ordered the fries in the afternoon. It was very delicious. You could tell they were made fresh. It was perfectly cooked. I cannot complain about that! I ended up ordering two plates for myself. \n\nService - It can definitely be worked on. The bartender was not very friendly. After we ordered our drinks, a group of 6 people came in and sat in the back (couch area?). They sat there for 30 minutes before being able to flag down the bartender. He was pretty rude when he walked over and responded to them by saying cant you see I'm the only one working? I get that he was stressed or was having a bad day, but it isn't an excuse to snap at customers. He wasn't exactly the most polite when he came to our table either. The French fries took about 30 minutes to come out -well worth the wait. When we checked on the status he told us it'll come when it comes... well then, okay lol. \n\nEnvironment - Very inviting and casual. I would definitely come here more often if I lived in Berkeley. \n\nRecommendation - Give this place a chance. But there is a very grumpy bartender that works Saturdays. Beware if he is the only one working. He does get upset if you take too long or ask too many questions. I am giving him the benefit of doubt by assuming he was going through some personal things and that was a one time interaction. I will give this place another shot if I return to Berkley.", "rating": 4, "date": "2017-11-22"}, {"excerpts": ["Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\n"], "author": "Sebastian F.", "review": "Cocktails and oysters. Lively and friendly vibe. Great food and even better drinks. What more can you ask for?\n\nPre-Giants game the whole AT&T Park area is crowded, and we were lucky to still get a table here. Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\nThe real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\nDefinitely a great pre-gamer. Will be back for more.", "rating": 4, "date": "2016-07-24"}, {"excerpts": ["*French fries ($6): meyer lemon aioli\n", "*Ham & Cheese ($13): prosciutto, gruyere, egg\n"], "author": "Elena N.", "review": "Met up a few friends for Happy Hour at Lord George last Wednesday, May 4th a little before 6pm. HH is Monday through Friday, 4pm to 6pm, so I had my friend order a HH item before I got there. He arrived around 5:30pm to snag a table as I wasn't sure if I was going to make it in time for HH.\n\nHappy Hour: Mon - Fri, 4-6pm\n*Half priced oyster of the day: Fanny Bay, BC ($19 for a dozen)\n*Beer: Carlsberg ($4)\n*Wine: Cava ($7), Rose ($8)\n*Cocktail: John Rose - rye, apple brandy, grenadine, lime, bitters ($8)\n\nI wanted to try the oysters, so we got a dozen HH oysters. They are half priced during HH, so they were $1.58 each making them $3.16 at full price. The oysters were crisp, creamy and clean with a nice briny flavor. My favorite way to eat them was just with some lemon and hot sauce. My friend got a HH beer and I got a HH cava. Though they charged me for a Rose which I didn't notice til after we left. Oh well, it's only a dollar difference.\n\n*Rye Manhattan: rye, Italian vermouth, bitters ($12) x2\n*Carlsberg ($6)\n*Money For Nothin': bonded rye, reposado tequila, pineau de charentes, ginger, grapefruit, lemon, walnut bitters\n*Nikka coffey still ($14)\n*Cobra Kai: Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters ($14)\n*Highland park 12 year ($14)\n*Springbank 12 year cask strength ($15)\n\nWe spent a good two hours at Lord George, so I needed some drinks! I love the rye manhattan. It was nice and strong and not too sweet. After that, I just stuck with straight ours. I wanted Oban 14, but they didn;t have it. So I got a highland park 12 and nikka coffey.\n\n*French fries ($6): meyer lemon aioli\n*Ham & Cheese ($13): prosciutto, gruyere, egg\n*Clam Chowder ($15 bowl): manila clam, bacon, toast\n\nWe got a couple snacks as well. I only tried the clam chowder. I really only wanted a cup, but a friend of mine wanted to have some as well so we ordered the bowl. This bowl is huge, so unless you want A LOT of soup, a cup should be fine. It had a nice savory flavor due to the bacon and lots of clams, but it was a little too salty for me. And I love salty food!\n\nGreat place for HH. If you can make it by 6pm, order the HH oysters! That and a glass of HH bubbly and I'm a happy girl!", "rating": 4, "date": "2016-05-12"}, {"excerpts": ["We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. ", "AH-MAZING. ", "We will definitely be back!"], "author": "Alexis N.", "review": "Fantastic food! Lots of delicious options. We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. AH-MAZING. We will definitely be back!", "rating": 5, "date": "2018-03-10"}, {"excerpts": ["Then we ordered the French fries with garlic aioli sauce which was good. ", "Wish the portion was a little larger but they were delicious. ", "Our server was very friendly and had great memory with our order. ", "Nice space, will be back again someday!"], "author": "Danielle M.", "review": "Solid bar. I ordered the French 75 New Orleans style (cognac instead of gin) which tasted really good I was happy. Then we ordered the French fries with garlic aioli sauce which was good. Wish the portion was a little larger but they were delicious. Our server was very friendly and had great memory with our order. Nice space, will be back again someday!", "rating": 4, "date": "2017-02-16"}, {"excerpts": ["Oysters, shrimp cocktail & french fries for the soft opening...yes please!!  "], "author": "Lauren B.", "review": "Much needed spot by the ball park. Classy & inviting location with friendly & knowledge staff. The Lord George has great spirits and a growing food menu. Oysters, shrimp cocktail & french fries for the soft opening...yes please!!  Great for groups, work outing or a date.\n\nI hear they'll have brunch too ;) \n\nI'll be back for the Grand Opening next Thursday!!", "rating": 5, "date": "2015-08-28"}, {"excerpts": ["We also ordered some french fries to share. "], "author": "Yasir S.", "review": "A couple of weeks ago, a few of us were looking for a bite on a Sunday evening in SOMA. The reviews for Lord George looked pretty good, so we decided to try it out.\n\nWhen we arrived, the kitchen was closing (so most of the main menu was unavailable to us), but our server told us that there were a few things we could still order. So order we did.\n\nThe charcuterie plate was good. We had 3 meats and 2 cheeses, and added the asparagus to that as well. The asparagus was great. There's no way to screw up cured meats and cheese (unless you offer bad selections), so that was a win.\n\nWe also ordered some french fries to share. They were good, but again, a side dish that's hard to mess up.\n\nI had two glasses of wine, both of which I enjoyed.\n\nTwo of us also order the clam chowder. This is where it went south (record scratch!). Not trying to sound overly sensationalistic, but I've had better chowder out of a can. It was watery with very little flavour, the clams were rubbery (perhaps forgivable since it was the end of the night for their kitchen), but essentially I got a big bowl of potatoes. The menu described it as being made with bacon (as a good chowder should), but instead, we got bacon bits crumbled on top. No smoky flavour in the soup. In fact, no flavour at all.\n\nWe also had the tuna tartare, and to be quite frank, this was the most disappointing tuna tartare I've ever had. The fish seemed fresh enough, but there were too many cucumbers, and the avocado was nowhere near ripe enough. On top of that, there seemed to be no flavour in it at all -- just completely bland (see a theme here?).\n\nI'm not completely writing them off, as I didn't get to try their mains, and we caught them at a time which might not have allowed them to put their best foot forward. But between the lousy chowder and tartare, and the grim, unwelcoming, snarky attitude of our server (don't worry, the rest of the staff were nice), I would have to be pretty desperate not to immediately go elsewhere.", "rating": 2, "date": "2016-06-24"}, {"excerpts": ["The French fries hit the spot too. ", "I'd come back anytime."], "author": "Eric A.", "review": "Lord George is great! Drinks were perfect. Oysters were fresh. The staff was fun to talk to. We were there on a Saturday afternoon - was empty when we got there and was starting to fill up by the time we left. The French fries hit the spot too. I'd come back anytime.", "rating": 5, "date": "2015-10-25"}], "avocado toast": [{"excerpts": ["We also had the avocado toast and the smoked salmon, both very good. ", "The avocado toast came with a burrata cheese on the side topped with kalamata olives, cherry tomatoes and sweet corn. ", "It was a delicious topping, and I appreciated that it was on the side so it gives you the option of using it as a topping or not. ", "Since we were just at the game, I stuck with beer and didn't get a cocktail, but I could tell the quality of the cocktails just by watching them being made. ", "The bartenders were doing the best job they could, and were friendly. ", "Will definitely be back."], "author": "Lynne H.", "review": "If Yelp had a feature that allowed responses to reviews, I would respond specifically to Bruce P.'s. We were there the same night and time, and while they might have experienced slow service, it doesn't warrant Lord George getting a 1 star. This was right after the Giants game so it was pretty steady, and keep in mind this is a specialty cocktail bar - good cocktails take time to make. \n\nThe oysters are great and there's a nice variety. Certain oysters are $1 are the weekends! We also had the avocado toast and the smoked salmon, both very good. The avocado toast came with a burrata cheese on the side topped with kalamata olives, cherry tomatoes and sweet corn. It was a delicious topping, and I appreciated that it was on the side so it gives you the option of using it as a topping or not. Since we were just at the game, I stuck with beer and didn't get a cocktail, but I could tell the quality of the cocktails just by watching them being made. The bartenders were doing the best job they could, and were friendly. Will definitely be back.", "rating": 4, "date": "2018-05-19"}, {"excerpts": ["ate some very good avocado toast", ", I love burrata, proceeded to order one dozen of the happy hour oysters until we had finished 4 dozen.\n", "They were clean cold and crispy, the fanny bay oyster are what is the happy hour oyster and we thoroughly enjoyed them. \n", "Lord George was quite a find."], "author": "pua R.", "review": "The have a great Saturday Sunday all day oyster special. However we, my wife and I came in right at 4:00pm on a Monday sat relaxed ate some very good avocado toast, I love burrata, proceeded to order one dozen of the happy hour oysters until we had finished 4 dozen.\nThey were clean cold and crispy, the fanny bay oyster are what is the happy hour oyster and we thoroughly enjoyed them. \nLord George was quite a find.", "rating": 5, "date": "2017-02-21"}, {"excerpts": ["We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. ", "AH-MAZING. ", "We will definitely be back!"], "author": "Alexis N.", "review": "Fantastic food! Lots of delicious options. We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. AH-MAZING. We will definitely be back!", "rating": 5, "date": "2018-03-10"}, {"excerpts": ["The oysters and sauces were delicious and the avocado toast was not too shabby. ", "We had hoped for a little more mischief, as advertised in the window...."], "author": "Sarah M.", "review": "This place is a little pricey for the selection, but the quality is good. The drinks were yummy, though maybe slightly watered down in the fancifying process. The oysters and sauces were delicious and the avocado toast was not too shabby. We had hoped for a little more mischief, as advertised in the window....Maybe next time? \n\nMusic was fantastic-90's R&B made it all worthwhile!", "rating": 4, "date": "2017-01-21"}, {"excerpts": ["5 minute walk from my apartment, half off oysters on Saturday & Sunday, plus burrata served with avocado toast... omg. ", "My new favorite place! ", "Oysters were SO fresh. ", "Thank you Lord George!"], "author": "Madison F.", "review": "5 minute walk from my apartment, half off oysters on Saturday & Sunday, plus burrata served with avocado toast... omg. My new favorite place! Oysters were SO fresh. Thank you Lord George!", "rating": 5, "date": "2017-06-25"}, {"excerpts": ["We had clam chowder, kale Cesar salad, avocado toast, and oysters.  ", "The food was quite pricey for what it was.  ", "The oysters were half price because it was a weekend.  ", "The total tab for the two of us without ordering any alcohol came out to be about $80.  ", "During the dinner, the bar lost several group of customers who wandered into the establishment but left since no one greeted them or seated them; one was a big group of 8 people.  ", "As we paid our bill, one of the bartenders came out and put signs onto the tables that informed customers to give their orders to the bartenders to get service.  ", "Here is my advice for the restaurant:  GREET YOUR CUSTOMERS and teach workers to be hospitable (even the people chucking oysters in front."], "author": "Aaron K.", "review": "Walked into the restaurant after watching a Giants game.  My wife and I don't drink but were interested in getting dinner here after reading the Yelp reviews about the clam chowder.  There was a small party in the back and people seated at the bar.  Upon arrival, no one greeted us or told us what to do.  We saw a sign that read seat your self so my wife and I sat at a table.  We waited and waited and waited.  Another couple walked into the restaurant and sat at the bar.  They received their drinks as we waited for a server.  My wife and I decided to go to the remaining two seats at the bar instead of continue waiting for a server.  The area we sat at was still a little wet so I asked the bartender to wipe it.  He did not do a good job since there was a puddle of water on my side of the bar.  I asked him if he can give me a towel so that I can clean it.  He gave me a towel and smirked, \"Normally people don't sit at the bar where it is dirty.\"  Was it our fault that we did not get acknowledged on the way in or waited at a table with no service?   Already I am thinking the raving reviews on Yelp was misguided and this will probably be my last time here.  The only saving grace for this restaurant is that the food was decent.  We had clam chowder, kale Cesar salad, avocado toast, and oysters.  The food was quite pricey for what it was.  The oysters were half price because it was a weekend.  The total tab for the two of us without ordering any alcohol came out to be about $80.  During the dinner, the bar lost several group of customers who wandered into the establishment but left since no one greeted them or seated them; one was a big group of 8 people.  As we paid our bill, one of the bartenders came out and put signs onto the tables that informed customers to give their orders to the bartenders to get service.  Here is my advice for the restaurant:  GREET YOUR CUSTOMERS and teach workers to be hospitable (even the people chucking oysters in front.", "rating": 1, "date": "2017-09-10"}, {"excerpts": ["Music is great, vegetable board, avocado toast , duck confit Tartine .. ", "So so good! ", "Friendly service! ", "Will be back ."], "author": "C A.", "review": "Love this place! Great little secret (or not so secret) spot! I just discovered it & already been there lots. Music is great, vegetable board, avocado toast , duck confit Tartine .. So so good! Friendly service! Will be back .", "rating": 5, "date": "2016-08-09"}], "foie gras torchon": [], "duck rillette": [{"excerpts": ["The duck rillette was just okay.  ", "The burger was probably the best. ", "Very juicy.  ", "I probably will go back for drinks only."], "author": "Rachael C.", "review": "My friend and I got there around 8:30 after a few drinks from another place.  \nWe wanted somewhere that served good drinks and decent food. \n\nI got a cocktail, which is pretty good. \nThe food was just okay.  The tuna tartare was so different.  It had cucumber and avacado in it.  I guess that's not what I expected. The duck rillette was just okay.  The burger was probably the best. Very juicy.  I probably will go back for drinks only.", "rating": 3, "date": "2016-10-15"}], "brandade croquette": [], "roasted tomato": [], "summer quinoa salad": [], "chopped salad": [{"excerpts": ["To eat, we had the chopped salad, which didn't captivate my taste buds. ", "In fact, I felt it was a bit soupy (likely owing to the small amount of lettuce in favor of cucumber and the choice of dressing). ", "However, the other two members of my party were delighted by it, so I'd give the salad 4 stars with the understanding that its execution was fine and that it simply didn't agree with my palate."], "author": "Alastair C.", "review": "My spouse and I recently met a friend here for drinks. We each had two drinks. Specifically, I had Dreams Old Men Dream and Federal Sword. Dreams was a combination of three cocktails: Negroni, Manhattan, and Old Fashioned. And despite the enthusiasm displayed by our waitress for the drink, I felt that it was disappointing. The unique characteristics of each of the 'constituent drinks' were sacrificed in the creation of this cocktail. And while I like innovation--and absurdity even--I also like thoughtful balance. Harmony is the key to a good cocktail, and this one lacked it. Federal Sword, meanwhile, was much better balanced and had a delightful nose, though that is to be expected from rye and calvados.\n\nTo eat, we had the chopped salad, which didn't captivate my taste buds. In fact, I felt it was a bit soupy (likely owing to the small amount of lettuce in favor of cucumber and the choice of dressing). However, the other two members of my party were delighted by it, so I'd give the salad 4 stars with the understanding that its execution was fine and that it simply didn't agree with my palate.", "rating": 3, "date": "2015-12-22"}], "the bistro burger   lb angus patty": [], "fudge brownie á la mode": [], "daredevil": [], "nd street shim": [], "minted mule": [{"excerpts": ["Definitely recommend the minted mule that drink was amazing"], "author": "Steven L.", "review": "Only had two drinks here with a side of fries. For the most part this bar was cool. The dude helping us out though forgot to bring water on two separate occasions, after being asked. Definitely recommend the minted mule that drink was amazing", "rating": 4, "date": "2017-04-08"}, {"excerpts": ["I got similar feedback from my friends regarding their drinks, a minted mule, a mojito ", "and I forgot what the last one was "], "author": "Jared S.", "review": "Decided to stop by here after work with some friends and I am now a fan.  All the tables were occupied but there were four seats at the bar open which was perfect for us. The noise level was not excessive and they had a baseball game on the big screen and it gave the place a laid back and sporty atmosphere.  Jason(?), our bartender, was courteous and kept an eye out for us in case we needed anything. \n\nWe ordered drinks first, mine was a Manhattan and it came out perfect.  I got similar feedback from my friends regarding their drinks, a minted mule, a mojito and I forgot what the last one was but I think it was a gold rush. For food, we ordered a dozen mixed oysters and they came out on a raised, iced tray with 3 different sauces (one had soy sauce, one had vinegar, and the last was cocktail, none plain, all altered to compliment the oysters). The oysters were chilled, fresh and very tasty, although we ordered a dozen I could've eaten a 100. We also ordered some fries and they came out great. They came with a side of ketchup and mayo but the mayo seemed either made from scratch or something was added which did not turn out bad at all.  We enjoyed the drinks so much our \"one drink, we're in a hurry\" turned into an \"alright, one more lets get a cobra Kai\" which was a tasty and unique drink that came out tasting like oranges, lemons and chocolate. We will definitely be back! Our total tab for a dozen oysters, fries and six drinks came out to $110 including tip.", "rating": 5, "date": "2015-10-10"}], "gold rush": [{"excerpts": ["The bartender served up an amazing \"gold rush\" cocktail. ", "Pricing is fairly reasonable."], "author": "Martin D.", "review": "This is a really great place to stop by and have a drink, especially before the ballgame. The bartender served up an amazing \"gold rush\" cocktail. Pricing is fairly reasonable.", "rating": 4, "date": "2018-04-29"}, {"excerpts": ["- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\n", "These two are very popular! "], "author": "Christine S.", "review": "My coworkers and I were \"going up on a Tuesday\" (did I use this correctly? I don't think I'm as hip as I used to be...) at Lord George since it is conveniently located a block away. It definitely reminds me of a smaller and more mature looking Southside Spirit House.\n\n5pm on a Tuesday, the whole place was packed. Crazy! I guess everyone had the same idea as us. Although it says they don't take reservations on Yelp, a few tables in the back were reserved. They have 2 TVs, so yay sports!\n\nHappy Hour (4pm-6pm):\n- 1/2 off oysters (oysters are normally $3)\n- $4 Trumer\n- $7 cava\n- $8 rose\n\nTheir beers on tap are around $6-8, and they have my second favorite beer (Black Butte Porter)! Simple and fancy cocktails cost around $10-13. The difference? The fancy cocktails have a few more ingredients than the simple ones. \n\nRecommendations:\n\n- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\nThese two are very popular! A bit on the sweet side.\n\n- Oxford Comma ($13): armagnac, aged rum, French and Italian Vermouth, grenadine, bitters.\n\n- Snake Bite Kit ($12): mezcal, tequila, Galliano, grapefruit, lime, bitters.\nThis was very easy to drink. A bit too light for my taste!\n\n- Dreams Old Men Dream ($12): Manhattan, negroni, Old Fashioned, combined!\nThis dream sounds like the dream! Smokey and overall a great drink!\n\nBesides drinks, they also serve oysters and food. The food items are definitely on the pricey side, and they're not full meals, just light bar bites. The bartenders at Lord George seem like the cool kind of bartenders you want to be great buddies with! \n\nCheers to new and awesome bars!", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["I dream of Cobra Kais and Gold Rush's now. \n\n"], "author": "Niana D.", "review": "If I had the skill and temperament to open an establishment it would be LORD GEORGE.\n\nThis place is in a class of its own. I don't have the bar history to give a great comparative review, but there is something special about the way this gastropub carries itself.\n\nIt is warm and inviting with a modern and masculine twist.\n\nThe drinks were awesome! The fries were awesome! The oysters were awesome!\n\nEven the bathroom is awesome!!!!\n\nI have to come here a few more times though to make sure the experience and service are consistent. You know how all that new hype works. The drinks here are top notch and really worth a try.\n\nThis is a place I would go out of my way for.\n\nI dream of Cobra Kais and Gold Rush's now. \n\n(p.s if you have the extra dough and it is deserved tip the oyster man - he is just awesome and shucking there all day and the sun tends to reside right above his station - or not - live your own life! LOL)", "rating": 5, "date": "2015-10-15"}, {"excerpts": ["but I think it was a gold rush. ", "For food, we ordered a dozen mixed oysters and they came out on a raised, iced tray with 3 different sauces ", "(one had soy sauce, one had vinegar, and the last was cocktail, none plain, all altered to compliment the oysters). ", "The oysters were chilled, fresh and very tasty, although we ordered a dozen I could've eaten a 100. ", "We also ordered some fries and they came out great. ", "They came with a side of ketchup and mayo but the mayo seemed either made from scratch or something was added which did not turn out bad at all.  "], "author": "Jared S.", "review": "Decided to stop by here after work with some friends and I am now a fan.  All the tables were occupied but there were four seats at the bar open which was perfect for us. The noise level was not excessive and they had a baseball game on the big screen and it gave the place a laid back and sporty atmosphere.  Jason(?), our bartender, was courteous and kept an eye out for us in case we needed anything. \n\nWe ordered drinks first, mine was a Manhattan and it came out perfect.  I got similar feedback from my friends regarding their drinks, a minted mule, a mojito and I forgot what the last one was but I think it was a gold rush. For food, we ordered a dozen mixed oysters and they came out on a raised, iced tray with 3 different sauces (one had soy sauce, one had vinegar, and the last was cocktail, none plain, all altered to compliment the oysters). The oysters were chilled, fresh and very tasty, although we ordered a dozen I could've eaten a 100. We also ordered some fries and they came out great. They came with a side of ketchup and mayo but the mayo seemed either made from scratch or something was added which did not turn out bad at all.  We enjoyed the drinks so much our \"one drink, we're in a hurry\" turned into an \"alright, one more lets get a cobra Kai\" which was a tasty and unique drink that came out tasting like oranges, lemons and chocolate. We will definitely be back! Our total tab for a dozen oysters, fries and six drinks came out to $110 including tip.", "rating": 5, "date": "2015-10-10"}], "french": [{"excerpts": ["To balance out our meal, we also ordered some french fries ($7). "], "author": "Annie N.", "review": "My bf and I stopped by for a late night snack because I was craving oysters. It was Sunday night and they had a great all day happy hour special going on. EVERY Saturday and Sunday, ALL DAY, you can get half off oysters and $25 bottles of bubbles. Our main draw was the $1 oyster special. \n\nWe got a dozen of fanny bay oysters for $1 each (they were the dollar special ones for that day) and a dozen of the church point oysters for $1.87 each. All the oysters were cold and fresh. The church points were incredibly creamy with a slight sweetness. The fanny bays weren't as creamy which was a nice texture difference since we got so many oysters. To balance out our meal, we also ordered some french fries ($7). They came with a delicious garlic aioli and were super crisp and tasty.\n\nOverall will definitely be back for the oyster specials.", "rating": 4, "date": "2017-12-04"}, {"excerpts": ["The French fries took about 30 minutes to come out -well worth the wait. ", "When we checked on the status he told us it'll come when it comes... "], "author": "Shannon H.", "review": "Food - We ordered the fries in the afternoon. It was very delicious. You could tell they were made fresh. It was perfectly cooked. I cannot complain about that! I ended up ordering two plates for myself. \n\nService - It can definitely be worked on. The bartender was not very friendly. After we ordered our drinks, a group of 6 people came in and sat in the back (couch area?). They sat there for 30 minutes before being able to flag down the bartender. He was pretty rude when he walked over and responded to them by saying cant you see I'm the only one working? I get that he was stressed or was having a bad day, but it isn't an excuse to snap at customers. He wasn't exactly the most polite when he came to our table either. The French fries took about 30 minutes to come out -well worth the wait. When we checked on the status he told us it'll come when it comes... well then, okay lol. \n\nEnvironment - Very inviting and casual. I would definitely come here more often if I lived in Berkeley. \n\nRecommendation - Give this place a chance. But there is a very grumpy bartender that works Saturdays. Beware if he is the only one working. He does get upset if you take too long or ask too many questions. I am giving him the benefit of doubt by assuming he was going through some personal things and that was a one time interaction. I will give this place another shot if I return to Berkley.", "rating": 4, "date": "2017-11-22"}, {"excerpts": ["Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\n"], "author": "Sebastian F.", "review": "Cocktails and oysters. Lively and friendly vibe. Great food and even better drinks. What more can you ask for?\n\nPre-Giants game the whole AT&T Park area is crowded, and we were lucky to still get a table here. Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\nThe real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\nDefinitely a great pre-gamer. Will be back for more.", "rating": 4, "date": "2016-07-24"}, {"excerpts": ["*French fries ($6): meyer lemon aioli\n", "*Ham & Cheese ($13): prosciutto, gruyere, egg\n"], "author": "Elena N.", "review": "Met up a few friends for Happy Hour at Lord George last Wednesday, May 4th a little before 6pm. HH is Monday through Friday, 4pm to 6pm, so I had my friend order a HH item before I got there. He arrived around 5:30pm to snag a table as I wasn't sure if I was going to make it in time for HH.\n\nHappy Hour: Mon - Fri, 4-6pm\n*Half priced oyster of the day: Fanny Bay, BC ($19 for a dozen)\n*Beer: Carlsberg ($4)\n*Wine: Cava ($7), Rose ($8)\n*Cocktail: John Rose - rye, apple brandy, grenadine, lime, bitters ($8)\n\nI wanted to try the oysters, so we got a dozen HH oysters. They are half priced during HH, so they were $1.58 each making them $3.16 at full price. The oysters were crisp, creamy and clean with a nice briny flavor. My favorite way to eat them was just with some lemon and hot sauce. My friend got a HH beer and I got a HH cava. Though they charged me for a Rose which I didn't notice til after we left. Oh well, it's only a dollar difference.\n\n*Rye Manhattan: rye, Italian vermouth, bitters ($12) x2\n*Carlsberg ($6)\n*Money For Nothin': bonded rye, reposado tequila, pineau de charentes, ginger, grapefruit, lemon, walnut bitters\n*Nikka coffey still ($14)\n*Cobra Kai: Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters ($14)\n*Highland park 12 year ($14)\n*Springbank 12 year cask strength ($15)\n\nWe spent a good two hours at Lord George, so I needed some drinks! I love the rye manhattan. It was nice and strong and not too sweet. After that, I just stuck with straight ours. I wanted Oban 14, but they didn;t have it. So I got a highland park 12 and nikka coffey.\n\n*French fries ($6): meyer lemon aioli\n*Ham & Cheese ($13): prosciutto, gruyere, egg\n*Clam Chowder ($15 bowl): manila clam, bacon, toast\n\nWe got a couple snacks as well. I only tried the clam chowder. I really only wanted a cup, but a friend of mine wanted to have some as well so we ordered the bowl. This bowl is huge, so unless you want A LOT of soup, a cup should be fine. It had a nice savory flavor due to the bacon and lots of clams, but it was a little too salty for me. And I love salty food!\n\nGreat place for HH. If you can make it by 6pm, order the HH oysters! That and a glass of HH bubbly and I'm a happy girl!", "rating": 4, "date": "2016-05-12"}, {"excerpts": ["We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. ", "AH-MAZING. ", "We will definitely be back!"], "author": "Alexis N.", "review": "Fantastic food! Lots of delicious options. We dug into the oysters (2x), the fois gras, French fries, tuna tartare, the burrata avocado toast and the beet salad. AH-MAZING. We will definitely be back!", "rating": 5, "date": "2018-03-10"}, {"excerpts": ["- Oxford Comma ($13): armagnac, aged rum, French and Italian Vermouth, grenadine, bitters.\n\n"], "author": "Christine S.", "review": "My coworkers and I were \"going up on a Tuesday\" (did I use this correctly? I don't think I'm as hip as I used to be...) at Lord George since it is conveniently located a block away. It definitely reminds me of a smaller and more mature looking Southside Spirit House.\n\n5pm on a Tuesday, the whole place was packed. Crazy! I guess everyone had the same idea as us. Although it says they don't take reservations on Yelp, a few tables in the back were reserved. They have 2 TVs, so yay sports!\n\nHappy Hour (4pm-6pm):\n- 1/2 off oysters (oysters are normally $3)\n- $4 Trumer\n- $7 cava\n- $8 rose\n\nTheir beers on tap are around $6-8, and they have my second favorite beer (Black Butte Porter)! Simple and fancy cocktails cost around $10-13. The difference? The fancy cocktails have a few more ingredients than the simple ones. \n\nRecommendations:\n\n- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\nThese two are very popular! A bit on the sweet side.\n\n- Oxford Comma ($13): armagnac, aged rum, French and Italian Vermouth, grenadine, bitters.\n\n- Snake Bite Kit ($12): mezcal, tequila, Galliano, grapefruit, lime, bitters.\nThis was very easy to drink. A bit too light for my taste!\n\n- Dreams Old Men Dream ($12): Manhattan, negroni, Old Fashioned, combined!\nThis dream sounds like the dream! Smokey and overall a great drink!\n\nBesides drinks, they also serve oysters and food. The food items are definitely on the pricey side, and they're not full meals, just light bar bites. The bartenders at Lord George seem like the cool kind of bartenders you want to be great buddies with! \n\nCheers to new and awesome bars!", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["Highly recommend the French 75 and Moscow Mule. ", "I would definitely revisit again. ", "They have a great happy hour with oysters as well."], "author": "Kristen H.", "review": "Great Charcuterie tray, delicious signature cocktails. Dark inside, ambience is nice. Great for chilly day. Highly recommend the French 75 and Moscow Mule. I would definitely revisit again. They have a great happy hour with oysters as well.", "rating": 4, "date": "2017-10-29"}, {"excerpts": ["I ordered the French 75 New Orleans style (cognac instead of gin) which tasted really good ", "I was happy. ", "Then we ordered the French fries with garlic aioli sauce which was good. ", "Wish the portion was a little larger but they were delicious. ", "Our server was very friendly and had great memory with our order. ", "Nice space, will be back again someday!"], "author": "Danielle M.", "review": "Solid bar. I ordered the French 75 New Orleans style (cognac instead of gin) which tasted really good I was happy. Then we ordered the French fries with garlic aioli sauce which was good. Wish the portion was a little larger but they were delicious. Our server was very friendly and had great memory with our order. Nice space, will be back again someday!", "rating": 4, "date": "2017-02-16"}, {"excerpts": ["Oysters, shrimp cocktail & french fries for the soft opening...yes please!!  "], "author": "Lauren B.", "review": "Much needed spot by the ball park. Classy & inviting location with friendly & knowledge staff. The Lord George has great spirits and a growing food menu. Oysters, shrimp cocktail & french fries for the soft opening...yes please!!  Great for groups, work outing or a date.\n\nI hear they'll have brunch too ;) \n\nI'll be back for the Grand Opening next Thursday!!", "rating": 5, "date": "2015-08-28"}, {"excerpts": ["We also ordered some french fries to share. "], "author": "Yasir S.", "review": "A couple of weeks ago, a few of us were looking for a bite on a Sunday evening in SOMA. The reviews for Lord George looked pretty good, so we decided to try it out.\n\nWhen we arrived, the kitchen was closing (so most of the main menu was unavailable to us), but our server told us that there were a few things we could still order. So order we did.\n\nThe charcuterie plate was good. We had 3 meats and 2 cheeses, and added the asparagus to that as well. The asparagus was great. There's no way to screw up cured meats and cheese (unless you offer bad selections), so that was a win.\n\nWe also ordered some french fries to share. They were good, but again, a side dish that's hard to mess up.\n\nI had two glasses of wine, both of which I enjoyed.\n\nTwo of us also order the clam chowder. This is where it went south (record scratch!). Not trying to sound overly sensationalistic, but I've had better chowder out of a can. It was watery with very little flavour, the clams were rubbery (perhaps forgivable since it was the end of the night for their kitchen), but essentially I got a big bowl of potatoes. The menu described it as being made with bacon (as a good chowder should), but instead, we got bacon bits crumbled on top. No smoky flavour in the soup. In fact, no flavour at all.\n\nWe also had the tuna tartare, and to be quite frank, this was the most disappointing tuna tartare I've ever had. The fish seemed fresh enough, but there were too many cucumbers, and the avocado was nowhere near ripe enough. On top of that, there seemed to be no flavour in it at all -- just completely bland (see a theme here?).\n\nI'm not completely writing them off, as I didn't get to try their mains, and we caught them at a time which might not have allowed them to put their best foot forward. But between the lousy chowder and tartare, and the grim, unwelcoming, snarky attitude of our server (don't worry, the rest of the staff were nice), I would have to be pretty desperate not to immediately go elsewhere.", "rating": 2, "date": "2016-06-24"}, {"excerpts": ["Highly recommend the French 75, husband had a gin martini.  ", "Both were as good as it gets.  ", "Nice a strong, and tasty.  \n", "Really good food too. ", "We ordered prawns, the duck confit open faced sandwich and a side of fries.  ", "All delicious. ", "The fries were noteworthy, probably double fried. ", "Crispy with delish aoli that wasn't overpowering.  ", "Nice!  \n", "The decor is sophisticated but comfortable,the lighting perfect. ", "Our bartender and waiter were the kind of people you'd like to invite to join you for a drink.  ", "Smart and genuine,acted as if they owned the place, which maybe they do. ", "Good job Lord George!"], "author": "Stacey O.", "review": "Exceptional cocktails -- heard tables on either side remarking on how good their cocktails were as well. Highly recommend the French 75, husband had a gin martini.  Both were as good as it gets.  Nice a strong, and tasty.  \nReally good food too. We ordered prawns, the duck confit open faced sandwich and a side of fries.  All delicious. The fries were noteworthy, probably double fried. Crispy with delish aoli that wasn't overpowering.  Nice!  \nThe decor is sophisticated but comfortable,the lighting perfect. Our bartender and waiter were the kind of people you'd like to invite to join you for a drink.  Smart and genuine,acted as if they owned the place, which maybe they do. Good job Lord George!", "rating": 5, "date": "2016-02-14"}, {"excerpts": ["The French fries hit the spot too. ", "I'd come back anytime."], "author": "Eric A.", "review": "Lord George is great! Drinks were perfect. Oysters were fresh. The staff was fun to talk to. We were there on a Saturday afternoon - was empty when we got there and was starting to fill up by the time we left. The French fries hit the spot too. I'd come back anytime.", "rating": 5, "date": "2015-10-25"}], "clean getaway": [{"excerpts": ["My personal favorite was the Clean Getaway (yum). ", "If you're an oyster person, this will be your heaven and if not, there are plenty tartines and snacks to keep you full and happy. ", "Loved the atmosphere and the service was great. ", "Honestly, I rarely have no complaints, but I really can't think of one."], "author": "Christina D.", "review": "Lord George is the perfect spot for a cocktail and quick bite before or after dinner. We stopped by for an afternoon pick me up and that is exactly what we got. The cocktails are perfectly curated without being pretentious; nor do they take forever to make. My personal favorite was the Clean Getaway (yum). If you're an oyster person, this will be your heaven and if not, there are plenty tartines and snacks to keep you full and happy. Loved the atmosphere and the service was great. Honestly, I rarely have no complaints, but I really can't think of one.", "rating": 5, "date": "2015-11-19"}, {"excerpts": ["the clean getaway cocktail and damn was that thing smooth. ", "Super fresh oysters, crispy salty fries, And legit charcuterie board. ", "These are pretty much all the things I need. ", "I see some people hating on them because they don't serve a full menu. ", "It's a bar people. ", "Enjoy the delicious bar bites they serve, or go back to the Cheesecake Factory for your popcorn shrimp and 7 alarm chili. ", "This place is the real deal ", "and I'm spreading the word."], "author": "jeff w.", "review": "My new favorite bar in sf. Staff is awesome, drinks are awesome, snacks are awesome. I'm a big gin guy and it's so rare when you find a bar that can actually make a good gin martini. Also had the clean getaway cocktail and damn was that thing smooth. Super fresh oysters, crispy salty fries, And legit charcuterie board. These are pretty much all the things I need. I see some people hating on them because they don't serve a full menu. It's a bar people. Enjoy the delicious bar bites they serve, or go back to the Cheesecake Factory for your popcorn shrimp and 7 alarm chili. This place is the real deal and I'm spreading the word.", "rating": 5, "date": "2015-10-26"}], "gin martini": [{"excerpts": ["Highly recommend the French 75, husband had a gin martini.  ", "Both were as good as it gets.  ", "Nice a strong, and tasty.  \n", "Really good food too. ", "We ordered prawns, the duck confit open faced sandwich and a side of fries.  ", "All delicious. ", "The fries were noteworthy, probably double fried. ", "Crispy with delish aoli that wasn't overpowering.  ", "Nice!  \n", "The decor is sophisticated but comfortable,the lighting perfect. ", "Our bartender and waiter were the kind of people you'd like to invite to join you for a drink.  ", "Smart and genuine,acted as if they owned the place, which maybe they do. ", "Good job Lord George!"], "author": "Stacey O.", "review": "Exceptional cocktails -- heard tables on either side remarking on how good their cocktails were as well. Highly recommend the French 75, husband had a gin martini.  Both were as good as it gets.  Nice a strong, and tasty.  \nReally good food too. We ordered prawns, the duck confit open faced sandwich and a side of fries.  All delicious. The fries were noteworthy, probably double fried. Crispy with delish aoli that wasn't overpowering.  Nice!  \nThe decor is sophisticated but comfortable,the lighting perfect. Our bartender and waiter were the kind of people you'd like to invite to join you for a drink.  Smart and genuine,acted as if they owned the place, which maybe they do. Good job Lord George!", "rating": 5, "date": "2016-02-14"}, {"excerpts": ["I'm a big gin guy and it's so rare when you find a bar that can actually make a good gin martini. ", "Also had "], "author": "jeff w.", "review": "My new favorite bar in sf. Staff is awesome, drinks are awesome, snacks are awesome. I'm a big gin guy and it's so rare when you find a bar that can actually make a good gin martini. Also had the clean getaway cocktail and damn was that thing smooth. Super fresh oysters, crispy salty fries, And legit charcuterie board. These are pretty much all the things I need. I see some people hating on them because they don't serve a full menu. It's a bar people. Enjoy the delicious bar bites they serve, or go back to the Cheesecake Factory for your popcorn shrimp and 7 alarm chili. This place is the real deal and I'm spreading the word.", "rating": 5, "date": "2015-10-26"}], "anejo old fashioned": [{"excerpts": ["I really like the Anejo Old Fashioned."], "author": "Andrew L.", "review": "I think this is one of the more underrated bars in the neighborhood. Partially because the super-popular 21st amendment is next door (which is also a great bar, but with a much different vibe). Lord George has great cocktails and very quality food. The food menu is limited, but everything I've ordered has been excellent. I've had the burger, the ham & cheese sandwich, the charcuterie and the fries. I'm not exaggerating when I say they have the best ham & cheese sandwich I've ever had. Also, the cocktail selection is excellent and the service is always great. I really like the Anejo Old Fashioned.", "rating": 4, "date": "2018-10-30"}], "rye manhattan": [{"excerpts": ["*Rye Manhattan: rye, Italian vermouth, ", "bitters ($12) x2\n", "*Carlsberg ($6)\n", "*Money For Nothin': bonded rye, reposado tequila, pineau de charentes, ginger, grapefruit, lemon, walnut bitters\n", "*", "Nikka coffey still ($14)\n", "*", "I love the rye manhattan. ", "It was nice and strong and not too sweet. ", "After that, I just stuck with straight ours. ", "I wanted Oban 14, but they didn;t have it. "], "author": "Elena N.", "review": "Met up a few friends for Happy Hour at Lord George last Wednesday, May 4th a little before 6pm. HH is Monday through Friday, 4pm to 6pm, so I had my friend order a HH item before I got there. He arrived around 5:30pm to snag a table as I wasn't sure if I was going to make it in time for HH.\n\nHappy Hour: Mon - Fri, 4-6pm\n*Half priced oyster of the day: Fanny Bay, BC ($19 for a dozen)\n*Beer: Carlsberg ($4)\n*Wine: Cava ($7), Rose ($8)\n*Cocktail: John Rose - rye, apple brandy, grenadine, lime, bitters ($8)\n\nI wanted to try the oysters, so we got a dozen HH oysters. They are half priced during HH, so they were $1.58 each making them $3.16 at full price. The oysters were crisp, creamy and clean with a nice briny flavor. My favorite way to eat them was just with some lemon and hot sauce. My friend got a HH beer and I got a HH cava. Though they charged me for a Rose which I didn't notice til after we left. Oh well, it's only a dollar difference.\n\n*Rye Manhattan: rye, Italian vermouth, bitters ($12) x2\n*Carlsberg ($6)\n*Money For Nothin': bonded rye, reposado tequila, pineau de charentes, ginger, grapefruit, lemon, walnut bitters\n*Nikka coffey still ($14)\n*Cobra Kai: Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters ($14)\n*Highland park 12 year ($14)\n*Springbank 12 year cask strength ($15)\n\nWe spent a good two hours at Lord George, so I needed some drinks! I love the rye manhattan. It was nice and strong and not too sweet. After that, I just stuck with straight ours. I wanted Oban 14, but they didn;t have it. So I got a highland park 12 and nikka coffey.\n\n*French fries ($6): meyer lemon aioli\n*Ham & Cheese ($13): prosciutto, gruyere, egg\n*Clam Chowder ($15 bowl): manila clam, bacon, toast\n\nWe got a couple snacks as well. I only tried the clam chowder. I really only wanted a cup, but a friend of mine wanted to have some as well so we ordered the bowl. This bowl is huge, so unless you want A LOT of soup, a cup should be fine. It had a nice savory flavor due to the bacon and lots of clams, but it was a little too salty for me. And I love salty food!\n\nGreat place for HH. If you can make it by 6pm, order the HH oysters! That and a glass of HH bubbly and I'm a happy girl!", "rating": 4, "date": "2016-05-12"}, {"excerpts": ["Dreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\n"], "author": "Tom P.", "review": "Pre-Giants game\n\nWith the crowds growing pre game, I was shocked that we were able to walk into venue and get a table.  \n\nIf you are looking for some of the best craft cocktails, and fresh oysters, this is the place. \n\nDreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\nThe freshest oysters, Duck Confit Tartine, and assorted meats and cheeses on a board. All amazing. \n\nI might also add , that service was impeccable !!\n\nThis will be my go to, for any future games or events at the ballpark. \n\nCheers", "rating": 5, "date": "2016-04-23"}], "jungle spy": [{"excerpts": ["I had the Cobra Kai, which is a Japanese whiskey, but I liked my gf's drink more - Jungle Spy. ", "The price for the Cobra Kai was $14.... after tax, SF tax (4%) and tip, my total came out to be $18 for one drink."], "author": "Anna C.", "review": "To celebrate my gf's new job, she chose this place. \n\nDrinks: 3/5 - There's an Alice in Wonderland themed menu. She ordered a drink from that menu that came in a tea cup & she said it wasn't strong. I had the Cobra Kai, which is a Japanese whiskey, but I liked my gf's drink more - Jungle Spy. The price for the Cobra Kai was $14.... after tax, SF tax (4%) and tip, my total came out to be $18 for one drink.", "rating": 3, "date": "2017-06-20"}, {"excerpts": ["The Jungle Spy is a refreshing gin-based drink that reminds me of a cross between a mojito and a mint julep.\n\n"], "author": "Terry L.", "review": "Came here for a late Sunday lunch. Usually I'm skeptical of bars that also advertise themselves as slash \"gastropubs.\" Seems to me like a pretentious way of labeling food that's slightly better than the typical fish n chips and sliders. However, Lord George's food menu deserves whatever added prestige that silly label is meant to confer. \n\nWe had a dozen oysters to start with, sampling all the different types offered. They were all quite fresh and tasty, although I later balked at the $38 price tag (my fault, really, for throwing caution to the wind with Market Prices). I had the Duck Confit Banh Mi Tartine, basically a roast duck open-faced sandwich. The duck was smoky and flavorful without being too dry, but it wasn't actually anything like a banh mi, and it was a bit unnecessarily difficult to eat (I guess I don't understand the point of serving two halves of a sandwich separately, but to each their own). My girlfriend had the clam chowder, which wasn't too salty and had a nice home-cooked taste.\n\nThe beer and cocktail selection has some quirky looking options and I will definitely want to try some other options when I come back. The Jungle Spy is a refreshing gin-based drink that reminds me of a cross between a mojito and a mint julep.\n\nOverall a solid, classier bar with better than average food. I'll come back if I'm hungry and happen to be in the area.", "rating": 4, "date": "2016-05-30"}, {"excerpts": ["The Jungle Spy was perfection and you could really taste the lemongrass, mint, citrus, and honey. ", "The Clam Chowder was on point (creamy with lots of clams and topped with crispy bacon)."], "author": "Jessica G.", "review": "The Jungle Spy was perfection and you could really taste the lemongrass, mint, citrus, and honey. The Clam Chowder was on point (creamy with lots of clams and topped with crispy bacon).", "rating": 5, "date": "2017-01-05"}], "spearmint daiquiri": [], "money for nothin": [], "cobra kai": [{"excerpts": ["Excellent cocktails - try the Cobra Kai for a fresh citrus twist on a whiskey cocktail"], "author": "Rebecca L.", "review": "Excellent cocktails - try the Cobra Kai for a fresh citrus twist on a whiskey cocktail", "rating": 4, "date": "2018-10-09"}, {"excerpts": ["I had the Cobra Kai, which is a Japanese whiskey, but I liked my gf's drink more - Jungle Spy. ", "The price for the Cobra Kai was $14.... after tax, SF tax (4%) and tip, my total came out to be $18 for one drink."], "author": "Anna C.", "review": "To celebrate my gf's new job, she chose this place. \n\nDrinks: 3/5 - There's an Alice in Wonderland themed menu. She ordered a drink from that menu that came in a tea cup & she said it wasn't strong. I had the Cobra Kai, which is a Japanese whiskey, but I liked my gf's drink more - Jungle Spy. The price for the Cobra Kai was $14.... after tax, SF tax (4%) and tip, my total came out to be $18 for one drink.", "rating": 3, "date": "2017-06-20"}, {"excerpts": ["The real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\n"], "author": "Sebastian F.", "review": "Cocktails and oysters. Lively and friendly vibe. Great food and even better drinks. What more can you ask for?\n\nPre-Giants game the whole AT&T Park area is crowded, and we were lucky to still get a table here. Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\nThe real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\nDefinitely a great pre-gamer. Will be back for more.", "rating": 4, "date": "2016-07-24"}, {"excerpts": ["Cobra Kai: Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters ($14)\n", "*", "Highland park 12 year ($14)\n", "*"], "author": "Elena N.", "review": "Met up a few friends for Happy Hour at Lord George last Wednesday, May 4th a little before 6pm. HH is Monday through Friday, 4pm to 6pm, so I had my friend order a HH item before I got there. He arrived around 5:30pm to snag a table as I wasn't sure if I was going to make it in time for HH.\n\nHappy Hour: Mon - Fri, 4-6pm\n*Half priced oyster of the day: Fanny Bay, BC ($19 for a dozen)\n*Beer: Carlsberg ($4)\n*Wine: Cava ($7), Rose ($8)\n*Cocktail: John Rose - rye, apple brandy, grenadine, lime, bitters ($8)\n\nI wanted to try the oysters, so we got a dozen HH oysters. They are half priced during HH, so they were $1.58 each making them $3.16 at full price. The oysters were crisp, creamy and clean with a nice briny flavor. My favorite way to eat them was just with some lemon and hot sauce. My friend got a HH beer and I got a HH cava. Though they charged me for a Rose which I didn't notice til after we left. Oh well, it's only a dollar difference.\n\n*Rye Manhattan: rye, Italian vermouth, bitters ($12) x2\n*Carlsberg ($6)\n*Money For Nothin': bonded rye, reposado tequila, pineau de charentes, ginger, grapefruit, lemon, walnut bitters\n*Nikka coffey still ($14)\n*Cobra Kai: Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters ($14)\n*Highland park 12 year ($14)\n*Springbank 12 year cask strength ($15)\n\nWe spent a good two hours at Lord George, so I needed some drinks! I love the rye manhattan. It was nice and strong and not too sweet. After that, I just stuck with straight ours. I wanted Oban 14, but they didn;t have it. So I got a highland park 12 and nikka coffey.\n\n*French fries ($6): meyer lemon aioli\n*Ham & Cheese ($13): prosciutto, gruyere, egg\n*Clam Chowder ($15 bowl): manila clam, bacon, toast\n\nWe got a couple snacks as well. I only tried the clam chowder. I really only wanted a cup, but a friend of mine wanted to have some as well so we ordered the bowl. This bowl is huge, so unless you want A LOT of soup, a cup should be fine. It had a nice savory flavor due to the bacon and lots of clams, but it was a little too salty for me. And I love salty food!\n\nGreat place for HH. If you can make it by 6pm, order the HH oysters! That and a glass of HH bubbly and I'm a happy girl!", "rating": 4, "date": "2016-05-12"}, {"excerpts": ["Cobra Kai: Delicious and fruity. ", "It had hard liquor in the recipe, but you can't waste it at all.\n", "Fries: "], "author": "Natalie L.", "review": "My new go-to happy hour spot! Inside is very clean and bright, I love the layout, it's definitely a good place to catch the game.\n\nWe ordered:\nOysters + Prawns: It was all very fresh and prawns were juicy! You can choose from different oysters, they have 3 different kinds, so we get four of each. Delicious, I prefer the big oysters. \nThe Broads: SO good, definitely a good snack to munch on. You can mix and match. The meat inside had bits of pistachios, and cheese was super smooth and carrots were yummy with their green sauce!\nBloody Mary: Some of the best blood mary I've have had, it's not too strong and has a great kick to it! Loved it.\nCobra Kai: Delicious and fruity. It had hard liquor in the recipe, but you can't waste it at all.\nFries: Thin and crispy and fresh out the over.\n\nOverall, love this place and service was great, the bartenders are super friendly and has great recommendations!", "rating": 5, "date": "2016-03-20"}, {"excerpts": ["I got the Cobra Kai cocktail that sounded really interesting, but it was just kind of meh. ", "I've had better hand crafted cocktails at other places, so that's why I'm giving this bar 3 stars. ", "Definitely a cool ambiance though and lots of people were ordering oysters."], "author": "Caitlin R.", "review": "Stopped in for a cocktail and light snack. The chowder with bits of bacon and sourdough bread was really tasty. The first bartender was so soft spoken, I could barely hear her. Another bartender took over and he was on top of checking on us. I got the Cobra Kai cocktail that sounded really interesting, but it was just kind of meh. I've had better hand crafted cocktails at other places, so that's why I'm giving this bar 3 stars. Definitely a cool ambiance though and lots of people were ordering oysters.", "rating": 3, "date": "2017-03-07"}, {"excerpts": ["- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\n", "These two are very popular! "], "author": "Christine S.", "review": "My coworkers and I were \"going up on a Tuesday\" (did I use this correctly? I don't think I'm as hip as I used to be...) at Lord George since it is conveniently located a block away. It definitely reminds me of a smaller and more mature looking Southside Spirit House.\n\n5pm on a Tuesday, the whole place was packed. Crazy! I guess everyone had the same idea as us. Although it says they don't take reservations on Yelp, a few tables in the back were reserved. They have 2 TVs, so yay sports!\n\nHappy Hour (4pm-6pm):\n- 1/2 off oysters (oysters are normally $3)\n- $4 Trumer\n- $7 cava\n- $8 rose\n\nTheir beers on tap are around $6-8, and they have my second favorite beer (Black Butte Porter)! Simple and fancy cocktails cost around $10-13. The difference? The fancy cocktails have a few more ingredients than the simple ones. \n\nRecommendations:\n\n- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\nThese two are very popular! A bit on the sweet side.\n\n- Oxford Comma ($13): armagnac, aged rum, French and Italian Vermouth, grenadine, bitters.\n\n- Snake Bite Kit ($12): mezcal, tequila, Galliano, grapefruit, lime, bitters.\nThis was very easy to drink. A bit too light for my taste!\n\n- Dreams Old Men Dream ($12): Manhattan, negroni, Old Fashioned, combined!\nThis dream sounds like the dream! Smokey and overall a great drink!\n\nBesides drinks, they also serve oysters and food. The food items are definitely on the pricey side, and they're not full meals, just light bar bites. The bartenders at Lord George seem like the cool kind of bartenders you want to be great buddies with! \n\nCheers to new and awesome bars!", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["I had the Cobra Kai and my GF had the Trampoline Jack. ", "They had other specialty drinks that sounded interesting "], "author": "Scott L.", "review": "Lord George!! Trendy bar with a great setting. Seating at the bar or at one of the high tops. We went on a Saturday evening, around 6:30 and there were only a few people there. Then again, who eats at 6:30 in the City on a Saturday night?!\n\nOur server was friendly, courteous and helpful. We had a dozen of assorted oysters, fries, duck confit Tartine, steak & potatoes Tartine. Their Tartine is an open faced sandwich. Lord George's specialty drinks were infused with lots of flavor. I had the Cobra Kai and my GF had the Trampoline Jack. They had other specialty drinks that sounded interesting but I will save that for another visit.\n\nI mentioned no HH on weekends but they do have HH Mon-Fri from 4-6PM but not on game nights. AT&T Park is a few blocks away. Good place to have a pre game drink. Great for groups.\n\nThe only complaint I have is that they charged us a SF Mandate fee.  I understand why they have it but if they embedded that charge in the price of the food, I wouldn't be that bitter about it. Lol!!", "rating": 4, "date": "2016-04-02"}, {"excerpts": ["The smallest oysters ( I forgot the name) were my favorite, and I just couldn't get enough of the Cobra Kai ($12). ", "Had to order it twice, back to back. "], "author": "Christina L.", "review": "A perfect happy hour spot during the week and with great service! I arrived here around 5:20pm, and it was pretty surprisingly empty. I did a 360 degree observation of the crowd once we received our food around 6:15pm, and the place definitely got crowded, really quick. I do that from time to time since I love people watching. But if you're someone like me, I guess you get used to the 1-2 hr waits and standing around in the bar section for a good 30-45 minutes.\n\nHH was a bit pricier than we expected and would not recommend this spot if you're looking for a full meal... but the oysters really fresh and the craft cocktails were delicious! The smallest oysters ( I forgot the name) were my favorite, and I just couldn't get enough of the Cobra Kai ($12). Had to order it twice, back to back. The charcuterie plate was also one of the better ones I've had and was huge! \n\nOverall, I enjoyed my experience here and would come back if I wanted a quick bite and/or drinks. And as they say, drink like a lord!", "rating": 5, "date": "2016-03-21"}, {"excerpts": ["Dreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\n"], "author": "Tom P.", "review": "Pre-Giants game\n\nWith the crowds growing pre game, I was shocked that we were able to walk into venue and get a table.  \n\nIf you are looking for some of the best craft cocktails, and fresh oysters, this is the place. \n\nDreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\nThe freshest oysters, Duck Confit Tartine, and assorted meats and cheeses on a board. All amazing. \n\nI might also add , that service was impeccable !!\n\nThis will be my go to, for any future games or events at the ballpark. \n\nCheers", "rating": 5, "date": "2016-04-23"}, {"excerpts": ["He made me such yummy cocktails included Cobra Kai. ", "I cannot remember the second cocktail he made with Bourbon for me. ", "Will ask him about it when I go back there this weekend. ", "Since it was the Game day, Happy hour specials were unavailable. ", "I had no idea. ", "Loved the decor and ambience. ", "The place got filled up quickly. ", "Great, friendly, professional and attentive service with delicious fresh oysters and cocktails. ", "Look forward to going there soon."], "author": "Athena K.", "review": "I really loved having Adam as my bartender at Lord George! It should be Lord Adam, not Lord George. ;) He made me such yummy cocktails included Cobra Kai. I cannot remember the second cocktail he made with Bourbon for me. Will ask him about it when I go back there this weekend. Since it was the Game day, Happy hour specials were unavailable. I had no idea. Loved the decor and ambience. The place got filled up quickly. Great, friendly, professional and attentive service with delicious fresh oysters and cocktails. Look forward to going there soon.", "rating": 4, "date": "2016-09-16"}, {"excerpts": ["We enjoyed the drinks so much our \"one drink, we're in a hurry\" turned into an \"alright, one more lets get a cobra Kai\" which was a tasty and unique drink that came out tasting like oranges, lemons and chocolate. ", "We will definitely be back! ", "Our total tab for a dozen oysters, fries and six drinks came out to $110 including tip."], "author": "Jared S.", "review": "Decided to stop by here after work with some friends and I am now a fan.  All the tables were occupied but there were four seats at the bar open which was perfect for us. The noise level was not excessive and they had a baseball game on the big screen and it gave the place a laid back and sporty atmosphere.  Jason(?), our bartender, was courteous and kept an eye out for us in case we needed anything. \n\nWe ordered drinks first, mine was a Manhattan and it came out perfect.  I got similar feedback from my friends regarding their drinks, a minted mule, a mojito and I forgot what the last one was but I think it was a gold rush. For food, we ordered a dozen mixed oysters and they came out on a raised, iced tray with 3 different sauces (one had soy sauce, one had vinegar, and the last was cocktail, none plain, all altered to compliment the oysters). The oysters were chilled, fresh and very tasty, although we ordered a dozen I could've eaten a 100. We also ordered some fries and they came out great. They came with a side of ketchup and mayo but the mayo seemed either made from scratch or something was added which did not turn out bad at all.  We enjoyed the drinks so much our \"one drink, we're in a hurry\" turned into an \"alright, one more lets get a cobra Kai\" which was a tasty and unique drink that came out tasting like oranges, lemons and chocolate. We will definitely be back! Our total tab for a dozen oysters, fries and six drinks came out to $110 including tip.", "rating": 5, "date": "2015-10-10"}, {"excerpts": ["Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters) and the Snakebite Kit (mezcal, tequila, Galliano, vanilla, grapefruit, lemon, and bitters."], "author": "Rachel C.", "review": "A friend and I went on a Tuesday night so it wasn't super busy. Really good drinks, friendly bartenders, and non-hipster patrons. My favorite cocktails were the  Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters) and the Snakebite Kit (mezcal, tequila, Galliano, vanilla, grapefruit, lemon, and bitters.", "rating": 5, "date": "2016-02-05"}, {"excerpts": ["The bartender recommended the Cobra Kai - Japanese wiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, and bitter. ", "And man was it good! ", "Great concoction of flavors. ", "My friend asked for something sweet and the classic daiquiri they brought her hit the spot. ", "Nice spot."], "author": "Nikita K.", "review": "Stopped by here at 5pm on a Friday for a drink with a friend, and really liked their drink options. The bartender recommended the Cobra Kai - Japanese wiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, and bitter. And man was it good! Great concoction of flavors. My friend asked for something sweet and the classic daiquiri they brought her hit the spot. Nice spot.", "rating": 4, "date": "2015-10-17"}, {"excerpts": ["He recommended me the Cobra Kai - which I proudly had 6 of throughout the night - and is now one of my favorite drinks. ", "The food was also spectacular - Fresh tuna bites on a crisp cracker was FANTASTIC!! ", "So happy I found this place. ", "Highly recommend it! ", ":)"], "author": "Allen S.", "review": "Woah - this place kicks ass. My first impression was great ambiance then when I began interacting with the staff, I was so surprised at how friendly and sociable they were. Boots is quite literally the best bartender EVER. He recommended me the Cobra Kai - which I proudly had 6 of throughout the night - and is now one of my favorite drinks. The food was also spectacular - Fresh tuna bites on a crisp cracker was FANTASTIC!! So happy I found this place. Highly recommend it! :)", "rating": 5, "date": "2015-10-28"}, {"excerpts": ["When we ordered the Cobra Kai cocktail to taste/share he even put it in 2 glasses for us. ", "That was also very well made and delicious with a lemon twist in it. ", "The oysters were incredibly fresh (one of the freshest I've tasted in the city thus far). ", "The price is higher than many other gastropubs/bars nearby but truly well worth it! ", "I would definitely come back for the food and good service!"], "author": "m s.", "review": "Came here after a late night long run with a friend at 10pm. We were starving and we were bummed at first when the waiter/bartender said there were only oysters, fries, and charcuterie to eat. We ordered all of the above to share and it was all delicious and filled us up! 1/2 dozen of a variety of oysters, 3 item board (calabrese, buzzed cheese, and broccolini), and fries. The cheese had an espresso/lavender rind and was amazing. Presentation for everything was very good. The waiter was very nice and explained our food each time and was super patient. When we ordered the Cobra Kai cocktail to taste/share he even put it in 2 glasses for us. That was also very well made and delicious with a lemon twist in it. The oysters were incredibly fresh (one of the freshest I've tasted in the city thus far). The price is higher than many other gastropubs/bars nearby but truly well worth it! I would definitely come back for the food and good service!", "rating": 5, "date": "2016-01-12"}], "the slow clap": [{"excerpts": ["I tried the Slow Clap because it smelled amazing, but I didn't love the taste. \n\n"], "author": "Jenée S.", "review": "Lord George is a sports bar, and they have loads of specials for Giants fans. The fries here are fantastic, and it's a nice place to relax. The fries are much yummier than the burger, and the drinks are alright.\n\nThey were playing the World Cup, and the place was full, but you could chat with a friend and hear them speak. \n\nOrdered the bistro burger with foie gras, clam chowder, and cider. I tried the Slow Clap because it smelled amazing, but I didn't love the taste. \n\nThe burger did not come with any foie gras, which we paid extra for. We asked the bartender about this, he assured us it was there. We could not see what he was pointing at, or taste it. The bun was dry. \n\nThe chowder was fine. They give you bread to dip in your chowder, this was a nice touch. \n\nThe fries were fantastic: they were salty and tangy, and these were garnished with parsley and rubbed with garlic. They tasted like a fancier version of McDonald's fries, in the best way possible.", "rating": 3, "date": "2018-06-16"}], "captain crook": [], "dragon blood": [], "dreams old men dream": [{"excerpts": ["If you're looking for something really stiff, give the Dreams Old Men Dream a go: it's a combination Manhattan, Negroni, and Old-Fashioned, and it definitely shows in the size of the glass!\n\n"], "author": "Johnny W.", "review": "*** In Short ***\n\nFantastic bar focusing on classics and their own originals built upon the classics.\n\n*** In Depth ***\n\nI've been to Lord George a couple of times now, though I can't quite seem to recall my earlier visits. Drinks are a little bit on the pricier end for the city, at an average of $13 per, but their pours are generous and their cocktails are strong, and the staff is pretty friendly too.\n\nIf you're looking for something really stiff, give the Dreams Old Men Dream a go: it's a combination Manhattan, Negroni, and Old-Fashioned, and it definitely shows in the size of the glass!\n\n***Accessibility Info***\n\nVenue - Pretty much all high-top counter seating, so not really particularly accessible. But hey, if you don't mind sitting a bit lower than everyone else, and having to reach a bit for your glass, there's usually enough space to just park yourself somewhere.\n\nBathroom - Didn't try them.", "rating": 4, "date": "2017-12-23"}, {"excerpts": ["The real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\n"], "author": "Sebastian F.", "review": "Cocktails and oysters. Lively and friendly vibe. Great food and even better drinks. What more can you ask for?\n\nPre-Giants game the whole AT&T Park area is crowded, and we were lucky to still get a table here. Our attentive waiter took great care of our group and brought out a tasty Clam Chowder ($8), a dozen oysters ($33), and French Fries ($5). \n\nThe real gem here are the drinks though: nicely crafted, we got the boozy Dreams Old Men Dream (Manhattan, Negroni, Old Fashioned combined, $12), the Snake Bite Kit (Mezcal, Tequila, Galliano, $12) and the Cobra Kai (Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters, $12).\n\nDefinitely a great pre-gamer. Will be back for more.", "rating": 4, "date": "2016-07-24"}, {"excerpts": ["- Dreams Old Men Dream ($12): Manhattan, negroni, Old Fashioned, combined!\n", "This dream sounds like the dream! "], "author": "Christine S.", "review": "My coworkers and I were \"going up on a Tuesday\" (did I use this correctly? I don't think I'm as hip as I used to be...) at Lord George since it is conveniently located a block away. It definitely reminds me of a smaller and more mature looking Southside Spirit House.\n\n5pm on a Tuesday, the whole place was packed. Crazy! I guess everyone had the same idea as us. Although it says they don't take reservations on Yelp, a few tables in the back were reserved. They have 2 TVs, so yay sports!\n\nHappy Hour (4pm-6pm):\n- 1/2 off oysters (oysters are normally $3)\n- $4 Trumer\n- $7 cava\n- $8 rose\n\nTheir beers on tap are around $6-8, and they have my second favorite beer (Black Butte Porter)! Simple and fancy cocktails cost around $10-13. The difference? The fancy cocktails have a few more ingredients than the simple ones. \n\nRecommendations:\n\n- Cobra Kai ($12): Japanese whiskey, cocoa, ancho chile, vino aperitivo, citrus, honey, bitters. \n- Gold Rush ($11) bourbon, lemon, honey.\nThese two are very popular! A bit on the sweet side.\n\n- Oxford Comma ($13): armagnac, aged rum, French and Italian Vermouth, grenadine, bitters.\n\n- Snake Bite Kit ($12): mezcal, tequila, Galliano, grapefruit, lime, bitters.\nThis was very easy to drink. A bit too light for my taste!\n\n- Dreams Old Men Dream ($12): Manhattan, negroni, Old Fashioned, combined!\nThis dream sounds like the dream! Smokey and overall a great drink!\n\nBesides drinks, they also serve oysters and food. The food items are definitely on the pricey side, and they're not full meals, just light bar bites. The bartenders at Lord George seem like the cool kind of bartenders you want to be great buddies with! \n\nCheers to new and awesome bars!", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["Dreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\n"], "author": "Tom P.", "review": "Pre-Giants game\n\nWith the crowds growing pre game, I was shocked that we were able to walk into venue and get a table.  \n\nIf you are looking for some of the best craft cocktails, and fresh oysters, this is the place. \n\nDreams Old Men Dream,  Cobra Kai, Rye Manhattan, all stellar\n\nThe freshest oysters, Duck Confit Tartine, and assorted meats and cheeses on a board. All amazing. \n\nI might also add , that service was impeccable !!\n\nThis will be my go to, for any future games or events at the ballpark. \n\nCheers", "rating": 5, "date": "2016-04-23"}, {"excerpts": ["DREAMS OLD MEN DREAM"], "author": "aj s.", "review": "Good neighborhood bar.Tasty bar food,stiff drinks and friendly bartenders.FAVE DRINK:DREAMS OLD MEN DREAM", "rating": 4, "date": "2016-05-09"}, {"excerpts": ["Specifically, I had Dreams Old Men Dream and Federal Sword. ", "Dreams was a combination of three cocktails: Negroni, Manhattan, and Old Fashioned. ", "And despite the enthusiasm displayed by our waitress for the drink, I felt that it was disappointing. ", "The unique characteristics of each of the 'constituent drinks' were sacrificed in the creation of this cocktail. ", "And while I like innovation--and absurdity even--I also like thoughtful balance. ", "Harmony is the key to a good cocktail, and this one lacked it. "], "author": "Alastair C.", "review": "My spouse and I recently met a friend here for drinks. We each had two drinks. Specifically, I had Dreams Old Men Dream and Federal Sword. Dreams was a combination of three cocktails: Negroni, Manhattan, and Old Fashioned. And despite the enthusiasm displayed by our waitress for the drink, I felt that it was disappointing. The unique characteristics of each of the 'constituent drinks' were sacrificed in the creation of this cocktail. And while I like innovation--and absurdity even--I also like thoughtful balance. Harmony is the key to a good cocktail, and this one lacked it. Federal Sword, meanwhile, was much better balanced and had a delightful nose, though that is to be expected from rye and calvados.\n\nTo eat, we had the chopped salad, which didn't captivate my taste buds. In fact, I felt it was a bit soupy (likely owing to the small amount of lettuce in favor of cucumber and the choice of dressing). However, the other two members of my party were delighted by it, so I'd give the salad 4 stars with the understanding that its execution was fine and that it simply didn't agree with my palate.", "rating": 3, "date": "2015-12-22"}, {"excerpts": ["Order \"Dreams Old Men Dream\" and don't look back.  ", "It's a Manhattan, Negroni and Old Fashioned...", "combined.  ", "One of the best cocktails I've ever had.  ", "Fun bartenders and better vibe.  ", "Stumble in or plan it out, you won't go wrong."], "author": "Gustavo R.", "review": "I wandered into this bar by accident.  What a treat.  Order \"Dreams Old Men Dream\" and don't look back.  It's a Manhattan, Negroni and Old Fashioned...combined.  One of the best cocktails I've ever had.  Fun bartenders and better vibe.  Stumble in or plan it out, you won't go wrong.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["I ordered the Dreams Old Men Dream (combo of Old Fashioned, Negroni, and Manhatten) and really enjoyed it. ", "It's definitely on the sweeter side and but still enjoyable. ", "We also ordered the oysters, charcuterie platter, clam chowder and duck confit open sandwich. ", "I thought the food was solid but very typical of what you can find in many other similar venues in SF. ", "I found the volume a bit loud loud to the point where it required us to yell so the waiter could get our order. ", "Also made it hard for a conversation between two people. ", "I recommend coming here with a larger group or make sure to sit at the bar of its just for a party of two. ", "Kind of felt like an a-hole for taking up a whole table with just two people."], "author": "Victor H.", "review": "Solid place for drinks and food near AT&T park. I ordered the Dreams Old Men Dream (combo of Old Fashioned, Negroni, and Manhatten) and really enjoyed it. It's definitely on the sweeter side and but still enjoyable. We also ordered the oysters, charcuterie platter, clam chowder and duck confit open sandwich. I thought the food was solid but very typical of what you can find in many other similar venues in SF. I found the volume a bit loud loud to the point where it required us to yell so the waiter could get our order. Also made it hard for a conversation between two people. I recommend coming here with a larger group or make sure to sit at the bar of its just for a party of two. Kind of felt like an a-hole for taking up a whole table with just two people.", "rating": 3, "date": "2015-12-01"}], "cavaperelada brutnvcatalonia spain": [], "cremant de borgogne brut rosejcb no nvburgundy france": [], "sauvignon blanclucas  lewellensanta barbara ca": [], "unoaked chardonnaycaratelli on tapsonoma valley ca": [], "gruner vertlinerpratsch on tapaustria": [], "dry rieslingtrefethen on tapoak knoll napa ca": [], "chardonnaysequoia grovenapa valley ca": [], "rosécommanderie de la bargemoneprovence france": [], "pinot noirreata three county on tapmonterey  sonoma  san benito ca": [], "grenachedomaine de cristiarhone france": [], "zinfandeldashe cellarsdry creek sonoma ca": [], "barbera di paviatiamo on taplombardy italy": [], "cabernet sauvignonthe federalist on tapnapa valley ca": [], "trumer pilsnerberkelely ca": [], "carlsberg lagerdanmark as denmark": [], "hoegaarden original whitebelgium": [], "magnolia brewing proving ground ipasan francisco ca": [], "deschutes black butte porterbend or": [], "speakeasy prohibition ambersan francisco ca": [], "bud lightst louis mo": [], "ace apple cidersebastopol ca": [], "calicraft cali coast kolschberkeley ca": [], "st amendment down to earth session ipasan leandro ca": [], "modern times fortunate islandsan diego ca": [], "fullers esblondon uk": [], "ommegang hennepin saisoncooperstown ny": [], "bear republic racer  ipahealdsburg ca": []}