{"mixed veggie pakoras": [], "chicken pakoras": [{"excerpts": ["Chicken pakoras \nVegetable pakoras"], "author": "Sydney E.", "review": "Amazing food that is as delicious as it is healthy! I've never had such perfectly flavorful Indian food, and yet it doesn't leave me feeling overstuffed because it's made with such high quality ingredients. \n\nThey are also very accommodating of any dietary needs. \n\nService is also fantastic!\n\nOne of my favorite restaurants (if not my favorite) in San Francisco!\n\nDishes I have tried and loved:\nAloo gobi\nChicken masala\nChicken Curry \nCoconut curry with prawns \nGluten free naan (pesto is the best!)\nChicken pakoras \nVegetable pakoras", "rating": 5, "date": "2018-07-24"}, {"excerpts": ["Chicken Pakoras and Vegetable Samosas are too, as well as the dessert Gulab Jamun! ", "It's honestly like fine dining status, but a fraction of the cost and again, the service is sooooo nice and friendly. ", "I hope they continue to serve us their amazing food for decades to come! ", "If you're like me who supports your neighborhood mom and pop shops, this is absolutely fantastic and you'll love it", "-I guarantee!!! "], "author": "Bridgette P.", "review": "Absolutely delicious and adorable new Indian hot spot in the heart of the Mission!!! I totally go for new and up in coming neighborhood restaurants! This is adorable, cozy, romantically and beautifully decorated. A bit chic too to be honest! Great atmosphere, but above all, amazing service and DELICIOUS FOOD!!! I definitely recommend this place! Their Butter Chicken Masala and Paneer Tikka Masala is to die for!!! Their starters- Chicken Pakoras and Vegetable Samosas are too, as well as the dessert Gulab Jamun! It's honestly like fine dining status, but a fraction of the cost and again, the service is sooooo nice and friendly. I hope they continue to serve us their amazing food for decades to come! If you're like me who supports your neighborhood mom and pop shops, this is absolutely fantastic and you'll love it-I guarantee!!! It's better than those \"hot and trendy restaurants\" that already have a tremendous amount of success. \n\n\nThank you Lotus for your humble and kind service and delicious and memorable dishes!!! We'll definitely be back and spread the word to all our friends and colleagues! By the way, Amit and Binod were our servers and they were SO kind and super attentive and professional! THANK YOU!!! :)", "rating": 5, "date": "2018-01-20"}], "pieces vegetable samosas": [], "paneer pakora": [], "lentil soup": [], "lotus mixed salad": [], "super food powergreen salad": [], "naan": [{"excerpts": ["Had tikka masala and paneer appetizer and garlic naan. ", "All three were amazing and the service was great too. "], "author": "S C.", "review": "Had tikka masala and paneer appetizer and garlic naan. All three were amazing and the service was great too. New fav indian restaurant in SF; love it\n\nBest of it all -- there was no wait for a table on a friday night and the seats and atmosphere were amazingly comfortable", "rating": 5, "date": "2018-10-20"}, {"excerpts": ["My boyfriend ordered brown rice, fish tikka masala, and naan. ", "He said his fish tikka masala was delicious. ", "Overall, we really enjoyed our food. "], "author": "Tanya D.", "review": "Wow just wow. This place was perfect.\n\nMy boyfriend and I arrived at this place 9ish. So the place was not busy whatsoever. When we arrived we were quickly greeted and sat down.\n\nFood: I ordered the Chapati and Bengan Bharta. The Bengan bharta was not vegan so I asked the server if he could make it vegan and he said yes. When I got my food, I was extremely excited to try it because it looked so delicious! I first tried it with my chapati bread and it was so delicious. I definitely loved the spices with the eggplant. The flavor was so exceptional! I also tried it with brown rice and again amazed because it genuinely tasted that good to me. I'm definitely glad I ordered the Benga Bertha! \nMy boyfriend ordered brown rice, fish tikka masala, and naan. He said his fish tikka masala was delicious. Overall, we really enjoyed our food. It was definitely a 5/5 for me!  \n\nService: From the beginning and end of our meal the service was spot on. Everyone was so helpful and kind. Especially when I asked for my dishes to be veganised. The servers were extremely spot on with the timing on asking us if we needed anything. It's such a small aspect but I really enjoy when they wait for all the food to be cooked and then serving it to us. Such a great experience with customer service!\n\nThe atmosphere of the place was quite relaxing! The decor and the look of the place was pleasing. Additionally, the whole restaurant is really clean!\n\nI definitely recommend this place because the food is just very delicious, the place is clean, and the customer service is spot on. It's quite difficult to impress me but this place definitely did :)", "rating": 5, "date": "2018-10-14"}, {"excerpts": [", I got the vegetarian Korma with garlic naan. ", "I asked for spicy sauce on the side and it was on point! ", "The Korma was nice and creamy and the taste was different from every other Korma I've had (in a good way!)! ", "I'll be back"], "author": "Marisol Z.", "review": "Wonderful service and ambiance, I got the vegetarian Korma with garlic naan. I asked for spicy sauce on the side and it was on point! The Korma was nice and creamy and the taste was different from every other Korma I've had (in a good way!)! I'll be back", "rating": 5, "date": "2018-10-29"}, {"excerpts": ["First came a basket of naan that was enough for a family of four, none of whom could afford to be anorexic (photo: http://bit.ly/2yMAXv9).\n\n"], "author": "Ed U.", "review": "You probably know already that the Mission is home to a number of appetizing Indian eateries that run the gamut from modern street cart to more traditional fare. Places like Deccan Spice (review: http://bit.ly/2IvTrj2), Ritu (formerly DUM) Indian Soul Food (review: http://bit.ly/2Mx1i1Z), and Aslam's Rasoi (review: http://bit.ly/2tAeImW) impress with their diverse executions and tasty results. I came here for a quiet lunch after perusing appliances at Cherin's nearby and honestly didn't think Lotus SF was quite in the memorable category.\n\nThey have all the expected dishes on their menu - curries, biriyani, naans, tandoori - and they offer lunch specials worthy of attention. I decided to go for the reasonably priced $11.95 Tandoori Chicken Lunch Special  because it was dark meat only, definitely my preference. It certainly came with a lot of extras which in heftier days would have been a plus but now just seemed more like a carbalooza. First came a basket of naan that was enough for a family of four, none of whom could afford to be anorexic (photo: http://bit.ly/2yMAXv9).\n\nThen came the tandoori chicken leg and thigh, a medium-size portion though a bit over cooked as it lay sitting on a bed of sautéed white onions (photo: http://bit.ly/2tBGtLT). This came with a cup of dal (photo: http://bit.ly/2KqiRnf). But wait, there was more. On another plate were a salad, a big helping of basmati rice, and a huge samosa, very crusty from its bath in the fryer (photo: http://bit.ly/2N4hw3K). It was a lot of food, and if you're looking for by-the-numbers execution, this place was as good as any. But portion didn't rule out everything else for me as I felt mixed on the results.\n\nFOOD - 3 stars...lots to eat at lunch but it was light on poultry and way heavy on carbs\nAMBIANCE - 4 stars...the decor was quite nice in a traditional way\nSERVICE - 3.5 stars...very quiet and efficient and a lot of guys on staff at once\nTOTAL - 3 stars...middle-of-the-road Indian food in a 'hood with a whole lotta strong South Asian choices", "rating": 3, "date": "2018-06-27"}, {"excerpts": ["The samosas are great though, and they have gluten free naan. ", "If price were no object, this would be my Indian spot of choice."], "author": "Gieselle A.", "review": "Among the tastiest Indian food I've had in sf! That being said, this spot is expensive. The samosas are great though, and they have gluten free naan. If price were no object, this would be my Indian spot of choice.", "rating": 4, "date": "2018-10-28"}, {"excerpts": ["Their butter chicken is some of the best I've ever had, their naan is succulent and buttery, and it's all just delicious and very high-quality, with balanced spices and terrific consistency and textures. ", "Seriously, get the butter chicken!"], "author": "Christina M.", "review": "I am truly amazed at how well-executed the food is here, even as a delivery customer. Their butter chicken is some of the best I've ever had, their naan is succulent and buttery, and it's all just delicious and very high-quality, with balanced spices and terrific consistency and textures. My sole nitpick is that their rice is on the stickier/gummier side, but I can live with that.\n\nSeriously, get the butter chicken!", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["I can't get enough of there yummy onion naan. ", "The people working there are super friendly and polite."], "author": "Fatma I.", "review": "Probably is my favorite Indian food restaurant. I have been ordering almost every day for lunch and dinner. The butter chicken is super delicious and sag paneer is just wow. I can't get enough of there yummy onion naan. The people working there are super friendly and polite.", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["We ordered the chicken tikka masala ($13.95), lamb seekh kebab ($17.95) and garlic naan ($3.95). ", "The chicken tikka masala was delicious! ", "I loved that the sauce wasn't as creamy as at other restaurants and therefore tasted more like home-cooked Indian food. ", "I just wish they gave a few more chicken pieces given the price you are paying. \n", "The lamb kebabs were the absolute WINNER though. ", "The meat was SO flavorful and perfectly cooked and came on a platter with yummy roasted onions and bell peppers. ", "It was finger lickin ", "good ", "and I'd highly recommend this dish. ", "Easily best kebab I've had. \n", "Garlic naan was also fantastic. ", "Garlic naan was also fantastic. "], "author": "Sabina S.", "review": "Lotus is a solid new Indian restaurant addition to the Mission food scene! The best part about this restaurant is their attention to the different diet restrictions that people have and attention to where they source ingredients from. Everything here is organic and everything can be made vegan or gluten-free, which I find awesome even though I myself don't have these restrictions. The decor is warm and inviting, the food is nourishing and tasty, and service is friendly and attentive!\n\nWe ordered the chicken tikka masala ($13.95), lamb seekh kebab ($17.95) and garlic naan ($3.95). The chicken tikka masala was delicious! I loved that the sauce wasn't as creamy as at other restaurants and therefore tasted more like home-cooked Indian food. I just wish they gave a few more chicken pieces given the price you are paying. \nThe lamb kebabs were the absolute WINNER though. The meat was SO flavorful and perfectly cooked and came on a platter with yummy roasted onions and bell peppers. It was finger lickin good and I'd highly recommend this dish. Easily best kebab I've had. \nGarlic naan was also fantastic. It was the right level of thickness and crispness. \n\nI really enjoyed Lotus SF and can't wait to come back and try a few more dishes :).", "rating": 4, "date": "2018-03-12"}, {"excerpts": ["Naan Bread, Vegetable Curry, Tika Masala, LambChops, Balsami Rice\n", "Total:  $68.33"], "author": "Genevieve Y.", "review": "Date & Time:  Saturday January 20, 2018 @ 7pm\nDining Companions:  Mommy & Husband\nScene:  Couples & Groups Clad in All-Black; Moto Jackets,  Sleeveless Tops w/ Skinny Leather Pants & Pumps or Off-The-Shoulder Tops w/ Skirts & Ankle Boots\nMusic:  Indian\nDecor:  Dim Lighting, Rich Hues & Fabrics Completes the Mood\nService:  Exemplary;  Welcoming, Warm, Gracious\nImbibe:  Chai\nDevour:  Naan Bread, Vegetable Curry, Tika Masala, LambChops, Balsami Rice\nTotal:  $68.33", "rating": 3, "date": "2018-01-20"}, {"excerpts": ["We decided on Lotus SF after we both agreed we were hungry for some naan and curry. ", "The interior is very pink and a little dim and kind of cute in a grandma's-living-room kind of way. ", "First off, the naan here is insanely good. ", "They have so many different flavors of naan ", "we ordered three because we couldn't decide haha. ", "We got the garlic, pesto, and onion naan ", "and they were all phenomenal. ", "Hot and crispy and a just a little bit fluffy ", "so you could soak up curry without it turning into a soggy mess. ", "If you plan on getting any curry dish here, please don't play yourself by not ordering some of their naan. \n\n"], "author": "Anna L.", "review": "I think.. this is now my favorite Indian food spot in the city...\n\nI came here with my boyfriend on a whim after browsing yelp for food (you know, the usual). We decided on Lotus SF after we both agreed we were hungry for some naan and curry. The interior is very pink and a little dim and kind of cute in a grandma's-living-room kind of way. It was kind of quiet and the decor may be a little bit confused, but the star of this review is the food. \n\nFirst off, the naan here is insanely good. They have so many different flavors of naan we ordered three because we couldn't decide haha. We got the garlic, pesto, and onion naan and they were all phenomenal. Hot and crispy and a just a little bit fluffy so you could soak up curry without it turning into a soggy mess. If you plan on getting any curry dish here, please don't play yourself by not ordering some of their naan. \n\nMy favorite dish we shared here was definitely the Chicken Tikka Masala. It is SO GOOD!! I have to admit, I don't remember the other dish we ordered because it has been shuttered out of my memory after the Chicken Tikka Masala took my mind and soul, but my boyfriend really enjoyed it haha. \n\nThis is a place I am definitely going to see myself back at in the near future! I hope their food only gets better as their business grows!", "rating": 5, "date": "2018-05-07"}, {"excerpts": ["Garlic naan and pesto naan. ", "Incredible. ", "Best Indian food in Cali."], "author": "Marissa K.", "review": "Oh my god. I live for Indian food. This place is a 10. No questions asked. Tika masala and shrimp in coconut curry sauce. Garlic naan and pesto naan. Incredible. Best Indian food in Cali.", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["Their naan was superb. ", "We ordered about 4 plates of naan, 3 bowls of rice to accompany the 6 dishes for 6 adults and 2 children. "], "author": "Angela K.", "review": "We went to another restaurant down the street but they couldn't fit a party of 8 so I quickly looked up another space that had good reviews, kid-friendly and able to accommodate vegans, vegetarians and meat-eaters. Viola!! Lotus SF popped up, I gave them a call and they said yes! Party of 8? Come on over!\n\nSo we made our way there and noticed that it was recently opened! We each ordered a dish and when it came out in little bowls.. we all looked at each other a bit concerned that we'd still be hungry. But by the end of the meal we we're raving about how great each dish was, so much flavor and best Indian food we've tasted. Their naan was superb. We ordered about 4 plates of naan, 3 bowls of rice to accompany the 6 dishes for 6 adults and 2 children. No one left hungry. \n\nI can't remember the dishes real name but we had two different chicken dishes (butter chicken and chicken masala), cauliflower, chickpeas, spinach and the  eggplant dish. Yummy!! \n\nGreat dinner and would definitely come back! :)", "rating": 5, "date": "2018-03-12"}, {"excerpts": ["Ordered:  Veggie Pakoras, Pesto Naan, Garlic Naan, Raita, Prawn Saag, Lamb Rogan Josh, and Chicken Vindaloo.\n\n"], "author": "daphne w.", "review": "Ordered:  Veggie Pakoras, Pesto Naan, Garlic Naan, Raita, Prawn Saag, Lamb Rogan Josh, and Chicken Vindaloo.\n\nIt was all amazingly delicious.  The meats were cooked perfectly, and the flavors were nicely spiced and complex, as they should be.  I look forward to coming here often -- so happy they opened in my neighborhood!", "rating": 5, "date": "2018-01-10"}, {"excerpts": ["So many options- including a gluten free naan! ", "(That is never an option and it is so good!!) ", "Our waiter noticed we didn't order any meat and asked if we were vegan, only to recommend other items as well, which I appreciate. ", "Really love the veggie coconut curry, perfect dip for the naan! ", "It is beautifully decorated and a great place to enjoy lunch or dinner. ", "Vegan/gf heaven and for meat eaters as well", ", this is a place to try for sure!"], "author": "Andrea A.", "review": "I've come here a couple times now and being gluten free and vegan I need to express how much I love it. So many options- including a gluten free naan! (That is never an option and it is so good!!) Our waiter noticed we didn't order any meat and asked if we were vegan, only to recommend other items as well, which I appreciate. Really love the veggie coconut curry, perfect dip for the naan! It is beautifully decorated and a great place to enjoy lunch or dinner. Vegan/gf heaven and for meat eaters as well, this is a place to try for sure!", "rating": 5, "date": "2018-09-03"}, {"excerpts": ["Gluten free naan ", "(pesto is the best!)\n"], "author": "Sydney E.", "review": "Amazing food that is as delicious as it is healthy! I've never had such perfectly flavorful Indian food, and yet it doesn't leave me feeling overstuffed because it's made with such high quality ingredients. \n\nThey are also very accommodating of any dietary needs. \n\nService is also fantastic!\n\nOne of my favorite restaurants (if not my favorite) in San Francisco!\n\nDishes I have tried and loved:\nAloo gobi\nChicken masala\nChicken Curry \nCoconut curry with prawns \nGluten free naan (pesto is the best!)\nChicken pakoras \nVegetable pakoras", "rating": 5, "date": "2018-07-24"}, {"excerpts": ["Ordered:\n- Gluten free garlic pesto naan (because yelp said)\n- Chicken Saab \n- Chicken coconut curry\n- Rice\n- Mango lassi \n\n", "that naan was so good I could be. "], "author": "Capers B.", "review": "This place was absolutely delicious! The decor was great, music enjoyable and staff was both friendly and helpful. \n\nFood was filling enough to take home leftovers. Ordered:\n- Gluten free garlic pesto naan (because yelp said)\n- Chicken Saab \n- Chicken coconut curry\n- Rice\n- Mango lassi \n\nI'm neither vegan nor gluten free but that naan was so good I could be. It tasted so good I'm already dreaming of my leftovers. \n\nThis was a great first time try and I'll certainly be back!", "rating": 5, "date": "2018-02-26"}, {"excerpts": ["I've literally never even see gluten free naan anywhere, and this was so fantastic!! ", "We got the pesto garlic gluten free naan ", "and I can not recommend it enough! ", "It's made with chickpea flour for reference. ", "Also had the daal soup which was good but kind of bland, but made a delicious dipping sauce for our veggie samosas (these were some of the best I've had! ", "Absolutely order these) ", "The waiter recommended the eggplant curry & it was amazing! ", "The saag was good too, and we substituted the paneer for potatoes to make it vegan. ", "Everyone should try this place because it was great ", "& I want them to stay in business!! ", "Prices were reasonable and the food was super shareable if you're looking for a great date or party spot! ", "Decor is beautiful & they have a somewhat extensive wine list for an Indian restaurants with all wines at the $9-10/glass range.", "We got the pesto garlic gluten free naan ", "and I can not recommend it enough! ", "It's made with chickpea flour for reference. ", "Also had the daal soup which was good but kind of bland, but made a delicious dipping sauce for our veggie samosas (these were some of the best I've had! ", "Absolutely order these) ", "The waiter recommended the eggplant curry & it was amazing! ", "The saag was good too, and we substituted the paneer for potatoes to make it vegan. ", "Everyone should try this place because it was great ", "& I want them to stay in business!! ", "Prices were reasonable and the food was super shareable if you're looking for a great date or party spot! ", "Decor is beautiful & they have a somewhat extensive wine list for an Indian restaurants with all wines at the $9-10/glass range."], "author": "Kylie F.", "review": "Amazing Indian food! I've literally never even see gluten free naan anywhere, and this was so fantastic!! We got the pesto garlic gluten free naan and I can not recommend it enough! It's made with chickpea flour for reference. Also had the daal soup which was good but kind of bland, but made a delicious dipping sauce for our veggie samosas (these were some of the best I've had! Absolutely order these) The waiter recommended the eggplant curry & it was amazing! The saag was good too, and we substituted the paneer for potatoes to make it vegan. Everyone should try this place because it was great & I want them to stay in business!! Prices were reasonable and the food was super shareable if you're looking for a great date or party spot! Decor is beautiful & they have a somewhat extensive wine list for an Indian restaurants with all wines at the $9-10/glass range.", "rating": 5, "date": "2018-02-17"}, {"excerpts": ["Also - they have gluten free naan, which is pretty rare.\n\n", "GLUTEN FREE NAAN? ", "Yes - that is correct. ", "And it's good!", "GLUTEN FREE NAAN? ", "Yes - that is correct. ", "And it's good!"], "author": "Tahd F.", "review": "Super tasty food, served by an exceedingly polite staff, in a wonderfully decorated environment. The only thing I couldn't figure out is why the place isn't packed (yet). \n\nEssentially, whatever you want, they'll make - says so right on the menu, provided it's Indian. Also - they have gluten free naan, which is pretty rare.\n\nGLUTEN FREE NAAN? Yes - that is correct. And it's good!", "rating": 5, "date": "2018-04-04"}, {"excerpts": ["With the pesto naan. ", "Holy shit. ", "It's the best meal me and my fiancé have had in months. \n", "You MUST COME TRY IT!"], "author": "Mckall E.", "review": "Best Indian I've had in San Francisco! \nAmazing friendly staff.\nWe got the chicken tikka masala \nAnd the prawn coconut curry. With the pesto naan. Holy shit. It's the best meal me and my fiancé have had in months. \nYou MUST COME TRY IT!", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["Both were so flavorful and went perfectly with their warm and fluffy naan. ", "I already miss this place!"], "author": "Esther K.", "review": "Our first stop last weekend in SF, and it was a great experience! Service was wonderful, and the food was delicious. We tried the Chicken Tikka Masala and Prawn Coconut Curry. Both were so flavorful and went perfectly with their warm and fluffy naan. I already miss this place!", "rating": 4, "date": "2018-03-28"}, {"excerpts": ["Ordered the garlic naan, paneer tikka masala, pesto paneer kabab, and the veggie pakora, and all of them were delicious! ", "Great service too! ", "Definitely recommend this place~"], "author": "Jodi T.", "review": "Really good Indian restaurant on Mission. The interior is stunning! Ordered the garlic naan, paneer tikka masala, pesto paneer kabab, and the veggie pakora, and all of them were delicious! Great service too! Definitely recommend this place~", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["Favorite dishes include the fish tikka masala, Saag paneer, lamb biriani and the naan. ", "Go here for lunch - they need the business then."], "author": "f f.", "review": "I love this restaurant. The food is delicious and presented beautifully. The atmosphere is lush with color and romantically lit. And the servers are warm, efficient and knowledgeable. This place used to be occupied by a flooring store so there is Variety of lovely \"sample\" floors in different areas of the restaurant.  Favorite dishes include the fish tikka masala, Saag paneer, lamb biriani and the naan. Go here for lunch - they need the business then.", "rating": 5, "date": "2018-09-10"}, {"excerpts": ["The pesto naan was interesting ", "but I still prefer garlic. ", "The naan is a bit chewier/stretchier than I'm used to / prefer, but again- not an expert on Indian food. ", "I also really like that at least so far (since they've only opened recently)", ", it's really easy to get seated right away. ", "It's a really nice getaway from the hipstery overpriced restaurants dotting Valencia street (which I love too- ", "but sometimes you need a break yenno?). ", "This is going to be a regular spot for me!"], "author": "Stephany L.", "review": "As a disclaimer, I'm by no means an expert on Indian food, but I'm super into Lotus! My favorite thing by far is just the fact that they actually cater to us spicy-intolerant noobs who can't even handle hot cheetos by asking what level of spice you want when you order. I've only had the butter chicken here so far but I think it's super tasty! The pesto naan was interesting but I still prefer garlic. The naan is a bit chewier/stretchier than I'm used to / prefer, but again- not an expert on Indian food. I also really like that at least so far (since they've only opened recently), it's really easy to get seated right away. It's a really nice getaway from the hipstery overpriced restaurants dotting Valencia street (which I love too- but sometimes you need a break yenno?). This is going to be a regular spot for me!", "rating": 4, "date": "2018-03-11"}, {"excerpts": ["We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. ", "It's clean, open and the window seats have great views of mission street (prime time people watching!). ", "Definitely going back for date night!"], "author": "Kelsey L.", "review": "This place is amazing! My partner and I discovered lotus in San Rafael, but love the mission spot even more! We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. It's clean, open and the window seats have great views of mission street (prime time people watching!). Definitely going back for date night!", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["I'm a big fan of their veggie pakoras, paneer tikka masala, naan, and mango lassi (served with a paper straw!). ", "They have a ton of vegetarian options and can also make dishes vegan if you ask. "], "author": "Emily M.", "review": "My BF and I love this place. I'm a big fan of their veggie pakoras, paneer tikka masala, naan, and mango lassi (served with a paper straw!). They have a ton of vegetarian options and can also make dishes vegan if you ask. My BF loves their butter chicken. The staff is kind and attentive. We've been back since our first visit and definitely plan to frequent this place!", "rating": 5, "date": "2018-07-19"}, {"excerpts": ["Naan is light and airy, every plate is well seasoned.\n\n"], "author": "Nanette K.", "review": "Yuuuummy! Came in for lunch and had the place almost to myself. Surprised. The service and food are impeccable. The decor is fun, super clean, really pretty background music. The food was really good! Lots of vegan options and all organic. I had the Seekh Kabab lunch special and it was easily 2 meals of deliciousness. The food is delicate and not heavy handed. Naan is light and airy, every plate is well seasoned.\n\nThe chai is UNSWEETENED! So cool. They are concerned about quality. The only negative is parking but what isn't negative about parking in the Mission anymore? I came because my periodontist was a few doors down and I am so glad I did. I will definitely brave parking and make this a destination place in the future.\n\nLunch special was $14. Entrees are about the same. They have a limited but not bad wine list, a good beer list (organic! gluten free- how can that be? they have it). Kombucha, lassis, organic and rose lemonade, Bundaberg root beer and ginger ale. Def will be back with my picky eater friends!", "rating": 5, "date": "2018-03-14"}, {"excerpts": ["Good onion naan!  ", "I can't recommend Lotus SF highly enough.  ", "I'm thrilled to finally have found a REALLY GREAT Indian restaurant.  ", "Bravo!"], "author": "tom s.", "review": "Absolutely stellar!  Even my fussy Manhattan visitors agreed.  The lamb biryani was remarkable; the salmon (Tandoori Fish) was outstanding, and the coconut shrimp was great too.  Good onion naan!  I can't recommend Lotus SF highly enough.  I'm thrilled to finally have found a REALLY GREAT Indian restaurant.  Bravo!", "rating": 5, "date": "2018-08-14"}, {"excerpts": ["The samosas are to die for,The salmon is fresh, the garlic naan is delicious ! ", "I am going to come back!!!!!!!! :-)"], "author": "Miya M.", "review": "This place is AMAZINGLY GOOD! The samosas are to die for,The salmon is fresh, the garlic naan is delicious ! I am going to come back!!!!!!!! :-)", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["Delicious lamb, delicious naan, delicious gulab jamun, ", "delicious sweet lassi... "], "author": "B C.", "review": "Sooo good! The decor is lovely, and the food is even lovelier.\n\nIt was quite quiet when I went with my family. I did feel bad because I get anxious when places like this don't get the attention they deserve.\n\nDelicious lamb, delicious naan, delicious gulab jamun, delicious sweet lassi... Everything was so good!\n\nedit: Oh! I also love that they called out their environmental and charitable work.", "rating": 5, "date": "2018-04-01"}, {"excerpts": ["We had lamb saag, chicken Teka masala and onion naan.  ", "The kids gobbled it up too!  ", "Very nice place and will definitely be coming back here!"], "author": "M. R.", "review": "Very good food and very good service.  They went out of their way to make our kids feel welcomed and the food was great!  We had lamb saag, chicken Teka masala and onion naan.  The kids gobbled it up too!  Very nice place and will definitely be coming back here!", "rating": 5, "date": "2018-03-04"}, {"excerpts": ["so I thought a quick walk to the Naan & Curry on 3rd & King would work. ", "Then, I came across Lotus SF. ", "We chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. ", "We were NOT disappointed. ", "The food came out fast and filled our noses with the most delightful smells. ", "It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. ", "Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. ", "Server was super attentive with water and checking in on us. "], "author": "Heather C.", "review": "My BF was feeling a bit under the weather and we just did a full week of going vegetarian, so I perused for the best \"Vegetarian \" near me. Indian popped up as a top cuisine so I thought a quick walk to the Naan & Curry on 3rd & King would work. Then, I came across Lotus SF. Lots of stars and rave reviews. \n\nHopped in the car and headed towards the Mission at 8:30pm on a Thursday. Normally, parking is tough to find based on the time and day of week, but was plentiful and to our surprise. \n\nThe exterior is clean with big windows showing you these beautiful upholstered chairs and tables ready for you inside. A white stone elephant greets you next to the front door, as does a smiling server upon entry. We were surprised, and for a quiet night, we chose a window seat and was equally thrilled at seeing the deliciousness inside their menu.\n\nWe chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. We were NOT disappointed. The food came out fast and filled our noses with the most delightful smells. It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. Server was super attentive with water and checking in on us. (Yay!)\n\nBut this review isn't just about the restaurant, food and service. While we waited for our food, a less fortunate man came in and was looking to dine. After listening to him talk, it was clear he was not sober; the service from the staff was heartwarming. After informing him they couldn't serve him, they sat and listened to him talk. About nothing and everything. My BF and I felt bad, so we asked the server to get him a soda and some food, and put it on our tab. The server went in the kitchen and came back with a box of chicken, rice and water. The gentleman thanked him and left. The server came over and thanked us for our generosity and said it was his duty to take care of the community they were in, but more importantly the patrons inside that supported them. Wow, human kindness DOES exist. I was touched. This made me appreciate the restaurant even more, and all happened before we got our food.\n\nI salute the server, restaurant and what it stands for. Love does conquer all, so get your ass out to Lotus SF and enjoy their savory and perfectly spiced dishes!!!!\n\nPS. You'll find a little surprise on the front of the menu re: Togo orders :) Happy eating!!!", "rating": 5, "date": "2018-02-16"}, {"excerpts": ["They have the option of gluten-free naan! ", "When's the last time you were able to find *that", "*?! ", "And they print right on their menu that they care about your health and are glad to make you any dish to order, including something that is your favorite Indian dish that you don't see on the menu! ", "I was wildly excited to get to eat the vegetable pakoras appetizer because, being gluten-free, I don't get to indulge in fried food very often. ", "But these are made with chick pea flour, so they are GF! ", "And they were completely delicious. ", "Our waiter also was careful to make all our dishes to our specifications, asking for us to tell him not just 'mild, medium or spicy' but, \"on a scale of 1-10, is 'medium' a 5 for you or is it a 7?", "\" ", "We had the coconut chicken dish and the tikka masala (Yum! ", "That was my favorite!) ", "and they even offer brown rice for those who are more health conscious. ", "Their vegetables are pesticide-free - they make a point of telling you that. ", "It was very delicious, healthy food! "], "author": "Heidi-Jane S.", "review": "OK, I am *really relieved* to see a new restaurant like *this* one come into my neighborhood! This is really a gem of a place! I loved everything about it - absolutely everything!\n\nWe'll start with the decor, because that's what strikes you first. It's just gorgeous in there, with its pinks and reds and sky-blue sky ceiling (yes, there are actual clouds painted on there!). Such a welcome relief from all the sad (in my opinion), yuppy, cookie-cutter restaurants with their drab, gray, box-y, cyber-y, minimalist decor. You won't find that here! Yes, this is a beautifully decorated place full of bright, happy colors that open your mind up and expand your mental and emotional horizons. The space used to belong to a tile company, so the whole floor is filled with colored tiles - it's so beautiful! All the art work comes from India and our waiter graciously explained all the different meanings and personalities contained in the works. It was really fascinating in itself!\n\nThen comes the food. It could not have been more perfect. First, for those who are gluten-free or have food allergies, you won't find a more welcoming menu. They have the option of gluten-free naan! When's the last time you were able to find *that*?! And they print right on their menu that they care about your health and are glad to make you any dish to order, including something that is your favorite Indian dish that you don't see on the menu! I was wildly excited to get to eat the vegetable pakoras appetizer because, being gluten-free, I don't get to indulge in fried food very often. But these are made with chick pea flour, so they are GF! And they were completely delicious. Our waiter also was careful to make all our dishes to our specifications, asking for us to tell him not just 'mild, medium or spicy' but, \"on a scale of 1-10, is 'medium' a 5 for you or is it a 7?\" We had the coconut chicken dish and the tikka masala (Yum! That was my favorite!) and they even offer brown rice for those who are more health conscious. Their vegetables are pesticide-free - they make a point of telling you that. It was very delicious, healthy food! You can't go wrong here.\n\nBut the most stellar, striking thing of all was the level of service we got. Amit was our server and he just had everything down perfectly! He had the perfect timing of knowing when to come refill our tea cups with yummy Masala chai and when to leave us alone to be engaged in deep conversation. When to bring the appetizer and when to bring the bill. He just could not have been nicer. He chatted with us and explained Indian history a little (brought about by our asking about the art on the walls). He was so knowledgeable and polite. He could not have been nicer and more welcoming.\n\nAnd so I say, \"Three cheers for this new neighborhood restaurant!\" They are open for lunch Tuesday - Sunday which is a plus since there aren't too many healthy, affordable lunch options around here. And yes, I forgot to mention that it is a restaurant that you can still eat at if you're not a millionaire. Very exciting for people like me. And, again, that decor! I'm just soooo thankful to see something new here that isn't black and gray and minimalist and boring! Reminded me of the old San Francisco, when everything had character. Yay!!", "rating": 5, "date": "2018-01-17"}, {"excerpts": ["Had the chili cheese naan and baingan bharta and both were outstanding. "], "author": "Vinay J.", "review": "Best North Indian food in SF!! Excellent mix of quality (organic and healthy ingredients), flavor and service! \n\nHad the chili cheese naan and baingan bharta and both were outstanding. Definitely one of the healthier Indian options in SF. \n\nWould come here before it starts getting super busy! \n\nThey are also environmentally super friendly. No plastic - even the straws are made of paper!\n\nAll in all fantastic spot and glad it opened up!", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["One naan for almost $4 before tax or tip. ", "I'm glad I got to try this new place out ", "but if I was strapped for cash I might go to other places for better value."], "author": "W A.", "review": "This place has an extensive menu but I do think the menu prices are pretty steep for some items. One naan for almost $4 before tax or tip. I'm glad I got to try this new place out but if I was strapped for cash I might go to other places for better value.", "rating": 4, "date": "2018-03-25"}, {"excerpts": ["We had the chicken curry, chicken biriyani and the gluten-free garlic pesto naan. ", "Yes, gluten-free naan ", "and it was awesome! ", "All the food was excellent and the presentation was nice too. ", "The restaurant itself is cute with lots of nice artwork on the walls and a fun pink color palette. ", "The staff is friendly and attentive. ", "I'm definitely going to come back!"], "author": "Alice R.", "review": "This place is fantastic!! We had the chicken curry, chicken biriyani and the gluten-free garlic pesto naan. Yes, gluten-free naan and it was awesome! All the food was excellent and the presentation was nice too. The restaurant itself is cute with lots of nice artwork on the walls and a fun pink color palette. The staff is friendly and attentive. I'm definitely going to come back!", "rating": 5, "date": "2018-08-08"}, {"excerpts": ["Garlic naan was perfect. ", "The only thing needing improvement was the raita which was very watery."], "author": "Mariam H.", "review": "Landed here unexpectedly after a  pride events nearby. The food was delicious!! The butter chicken was like my moms. Garlic naan was perfect. The only thing needing improvement was the raita which was very watery.", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. ", "All of it was amazing! ", "Pakoras light and fresh, naan wasn't dense at all. ", "The mains were all delicious! ", "Bonus, delivery through Yelp came in less than 30 minutes."], "author": "Ri R.", "review": "Damn, fav new Indian restaurant! Everything is fresh -- not greasy or heavy at all. I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. All of it was amazing! Pakoras light and fresh, naan wasn't dense at all. The mains were all delicious! Bonus, delivery through Yelp came in less than 30 minutes.", "rating": 5, "date": "2018-07-06"}, {"excerpts": ["I ordered the Tikka masala rice and naan at lunch hour. ", "Dining room was not very full and there was the right amount of staff. ", "Very clean and beautiful decor. ", "P.S. ", "if there's something traditional that's not on the menu they will make it for you! ", "Very kind and knowledgeable staff.r"], "author": "Mimi K.", "review": "Really good choice for Indian cuisine if you're in the mission. I ordered the Tikka masala rice and naan at lunch hour. Dining room was not very full and there was the right amount of staff. Very clean and beautiful decor. P.S. if there's something traditional that's not on the menu they will make it for you! Very kind and knowledgeable staff.r", "rating": 5, "date": "2018-02-23"}, {"excerpts": ["We ordered the veggie pakoras, shrimp saagwala, chicken tikka masala, aloo baingan, rice, and GLUTEN FREE NAAN. ", "Yes, you heard me right. ", "And it was actually decent! ", "I will definitely be back."], "author": "Julia P.", "review": "Start to finish such a lovely dining experience! The service was excellent - very polite and attentive. The atmosphere was great, and clearly a lot of thought went into the decor. The bathroom was bright and sparking clean. And of course...the food! SO GOOD! We ordered the veggie pakoras, shrimp saagwala, chicken tikka masala, aloo baingan, rice, and GLUTEN FREE NAAN. Yes, you heard me right. And it was actually decent! I will definitely be back.", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["We also had he chicken tandori and nav rattan with rice and garlic naan. ", "We ordered the curry medium but it wasn't really very spicy ", "so I'd probably get hot next time - but the flavor was still really good. ", "Only compliant would be ", "the curry size was pretty small compared to the large rice portion we received. ", "Definitely will go back when I'm craving great Indian."], "author": "Greta H.", "review": "Had a great dinner here! Staff was really friendly and accommodating. We had veggie pakoras to start that were some of the best I've ever had! We also had he chicken tandori and nav rattan with rice and garlic naan. We ordered the curry medium but it wasn't really very spicy so I'd probably get hot next time - but the flavor was still really good. Only compliant would be the curry size was pretty small compared to the large rice portion we received. Definitely will go back when I'm craving great Indian.", "rating": 5, "date": "2018-06-08"}, {"excerpts": ["Amazing attention to detail and garlic naan was great. ", "It's a quiet place and good vibes."], "author": "Grant M.", "review": "This place is so classy. Amazing attention to detail and garlic naan was great. It's a quiet place and good vibes.", "rating": 5, "date": "2018-03-28"}, {"excerpts": ["It took almost another 40 minutes for or main dishes to come out & they did not bring out that naan to us until about halfway through the meal. ", "I know we could have left, and honestly we should have. ", "I wish the food would have been worth wait, but it wasn't. ", "The chicken was dry, that rice was cold. ", "Completely disappointed. ", "What made this experience worst was the service. ", "I've never been completely ignored in a restaurant while others around me are being served and waited on. ", "It was as though we weren't there, but when we asked a server for the check they were very quick to get someone to grab that for us and charge. ", "Terrible service with mediocre food."], "author": "Alejandra C.", "review": "I REALLY wanted to like this place. I am aware that this restaurant is new, but they have so many kinks to workout. My boyfriend and I stumbled upon this place from all the great Yelp reviews so we decided to come here for dinner on a Friday night. Upon our arrival we put out names down because it was so busy, but no surprise to us. We patiently waited until it was it turn to be seated. This is when things took a turn for the worst. We were seated and served water and then nothing. No one approached us. We watched tables around us being brought food, orders being taken, and then there was us. My boyfriend and I are pretty understanding, especially since it's a new restaurant, we get that they are still trying to workout a good system. After a 20 minute wait at our table my boyfriend called a server over and asked if we could put in our order & was told that someone would be right over and again we waited & waited. Keep in mind, it is busy, so all around us people are being waited, we did try to flag people down but we were simply ignored as they would just walk past us. Another 20 minutes go by, and if course at this point we have been contemplating walking out, but all the food around us makes us stay. I get up this time and go over to the host and let them know that we have been sitting at out table for 40 minutes and we would like to order. He goes and tells one of the waiters and points at our table. At this point we're thinking finally, so excited to put in our order and get some of that food, but the waiter doesn't come. The host noticed and actually came over and took it order himself. We were happy that things were finally moving along. About 20 minutes later we get out appetizer, and at this point we actually start seeing people leave that we're seated when we were. Boyfriend and I are happy to be eating. Then we sit and wait some more. I understand that the food I being freshly prepared, so we expected to wait, especially with it being so busy, but we were not expecting this. It took almost another 40 minutes for or main dishes to come out & they did not bring out that naan to us until about halfway through the meal. I know we could have left, and honestly we should have. I wish the food would have been worth wait, but it wasn't. The chicken was dry, that rice was cold. Completely disappointed. What made this experience worst was the service. I've never been completely ignored in a restaurant while others around me are being served and waited on. It was as though we weren't there, but when we asked a server for the check they were very quick to get someone to grab that for us and charge. Terrible service with mediocre food.", "rating": 1, "date": "2018-02-25"}, {"excerpts": ["I was excited for the gluten free naan which was decent. ", "But other than that it's the usual fare. ", "No different than any other Indian restaurant. ", "Good ambiance. ", "But the chai sucks. ", "Too much milk."], "author": "Neeraj K.", "review": "I was excited for the gluten free naan which was decent. But other than that it's the usual fare. No different than any other Indian restaurant. Good ambiance. But the chai sucks. Too much milk.", "rating": 4, "date": "2018-03-13"}, {"excerpts": ["First time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). ", "I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. ", "I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\n", "ALL THIS for $12 (plus a generous tip, which they so richly deserve)!\n"], "author": "Patricia K.", "review": "THIS IS THE REAL DEAL.\nGreeting the customer with what looks like marble Ganeshas outside and big, brass ones inside, LOTUS SF continues with the theme of high quality and fine Indian art, from the fine paintings (including masterpieces of the Persian-influenced era) and a unique 3-D wood portrait (suggestive of the style of Yaacov Agam) of Indian Independence hero Kartar Singh Sarabha, to the fantastic floors (dramatic and sweeping marble-inlaid designs in bright blues, golds, and a variety of other colors and patterns--different for each section of the restaurant, and gorgeous faux-wood tile flooring in the bathrooms, which sparkle with cleanliness and chrome fixtures, and white-on-white, fine-geometric-patterned, fresco-like tile walls). \nAnd then there's lunch, all served on cloth tablecloths in beautiful, intricately patterned white-on-white china (made in Thailand) by charming staff from India and/or Nepal--while authentic Indian classical music plays in the background.\nFirst time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\nALL THIS for $12 (plus a generous tip, which they so richly deserve)!\nOf course, there were other vegetarian options at that price (next time, I'll try the chana masala) as well as meat dishes (chicken, lamb) and fish & seafood (for about $1 to $4 more). I did not explore desserts (but will try the gulab jamon). This is the real deal in Northern Indian cuisine and ambience. (I bet that was the owner I saw standing by.) I can hardly wait to go back for more!", "rating": 5, "date": "2018-03-11"}, {"excerpts": ["I got potato samosas aloo gobi and garlic naan! ", "Loved every bit!! ", "Interior decor and ambiance were relaxing and tasteful. ", "Will be back"], "author": "Chloe C.", "review": "The food was delicious and my servers were extremely helpful and accommodating to my vegan requests! I got potato samosas aloo gobi and garlic naan! Loved every bit!! Interior decor and ambiance were relaxing and tasteful. Will be back", "rating": 5, "date": "2018-03-02"}], "chili cheese kulcha": [{"excerpts": ["Our favorites are the butter chicken, the tandoori chicken, the baingan bharta and the chili cheese kulcha!"], "author": "Vidya N.", "review": "This place has the best butter chicken (with dark meat!) in town, and everything else is delicious too. They use mostly organic ingredients and everything is on the healthier side. Our favorites are the butter chicken, the tandoori chicken, the baingan bharta and the chili cheese kulcha!", "rating": 5, "date": "2018-05-04"}], "keema naan": [], "garlic naan": [{"excerpts": ["Had tikka masala and paneer appetizer and garlic naan. ", "All three were amazing and the service was great too. "], "author": "S C.", "review": "Had tikka masala and paneer appetizer and garlic naan. All three were amazing and the service was great too. New fav indian restaurant in SF; love it\n\nBest of it all -- there was no wait for a table on a friday night and the seats and atmosphere were amazingly comfortable", "rating": 5, "date": "2018-10-20"}, {"excerpts": [", I got the vegetarian Korma with garlic naan. ", "I asked for spicy sauce on the side and it was on point! ", "The Korma was nice and creamy and the taste was different from every other Korma I've had (in a good way!)! ", "I'll be back"], "author": "Marisol Z.", "review": "Wonderful service and ambiance, I got the vegetarian Korma with garlic naan. I asked for spicy sauce on the side and it was on point! The Korma was nice and creamy and the taste was different from every other Korma I've had (in a good way!)! I'll be back", "rating": 5, "date": "2018-10-29"}, {"excerpts": ["We ordered the chicken tikka masala ($13.95), lamb seekh kebab ($17.95) and garlic naan ($3.95). ", "The chicken tikka masala was delicious! ", "I loved that the sauce wasn't as creamy as at other restaurants and therefore tasted more like home-cooked Indian food. ", "I just wish they gave a few more chicken pieces given the price you are paying. \n", "The lamb kebabs were the absolute WINNER though. ", "The meat was SO flavorful and perfectly cooked and came on a platter with yummy roasted onions and bell peppers. ", "It was finger lickin ", "good ", "and I'd highly recommend this dish. ", "Easily best kebab I've had. \n", "Garlic naan was also fantastic. ", "Garlic naan was also fantastic. "], "author": "Sabina S.", "review": "Lotus is a solid new Indian restaurant addition to the Mission food scene! The best part about this restaurant is their attention to the different diet restrictions that people have and attention to where they source ingredients from. Everything here is organic and everything can be made vegan or gluten-free, which I find awesome even though I myself don't have these restrictions. The decor is warm and inviting, the food is nourishing and tasty, and service is friendly and attentive!\n\nWe ordered the chicken tikka masala ($13.95), lamb seekh kebab ($17.95) and garlic naan ($3.95). The chicken tikka masala was delicious! I loved that the sauce wasn't as creamy as at other restaurants and therefore tasted more like home-cooked Indian food. I just wish they gave a few more chicken pieces given the price you are paying. \nThe lamb kebabs were the absolute WINNER though. The meat was SO flavorful and perfectly cooked and came on a platter with yummy roasted onions and bell peppers. It was finger lickin good and I'd highly recommend this dish. Easily best kebab I've had. \nGarlic naan was also fantastic. It was the right level of thickness and crispness. \n\nI really enjoyed Lotus SF and can't wait to come back and try a few more dishes :).", "rating": 4, "date": "2018-03-12"}, {"excerpts": ["Garlic naan and pesto naan. ", "Incredible. ", "Best Indian food in Cali."], "author": "Marissa K.", "review": "Oh my god. I live for Indian food. This place is a 10. No questions asked. Tika masala and shrimp in coconut curry sauce. Garlic naan and pesto naan. Incredible. Best Indian food in Cali.", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["Ordered:  Veggie Pakoras, Pesto Naan, Garlic Naan, Raita, Prawn Saag, Lamb Rogan Josh, and Chicken Vindaloo.\n\n"], "author": "daphne w.", "review": "Ordered:  Veggie Pakoras, Pesto Naan, Garlic Naan, Raita, Prawn Saag, Lamb Rogan Josh, and Chicken Vindaloo.\n\nIt was all amazingly delicious.  The meats were cooked perfectly, and the flavors were nicely spiced and complex, as they should be.  I look forward to coming here often -- so happy they opened in my neighborhood!", "rating": 5, "date": "2018-01-10"}, {"excerpts": ["Ordered the garlic naan, paneer tikka masala, pesto paneer kabab, and the veggie pakora, and all of them were delicious! ", "Great service too! ", "Definitely recommend this place~"], "author": "Jodi T.", "review": "Really good Indian restaurant on Mission. The interior is stunning! Ordered the garlic naan, paneer tikka masala, pesto paneer kabab, and the veggie pakora, and all of them were delicious! Great service too! Definitely recommend this place~", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. ", "It's clean, open and the window seats have great views of mission street (prime time people watching!). ", "Definitely going back for date night!"], "author": "Kelsey L.", "review": "This place is amazing! My partner and I discovered lotus in San Rafael, but love the mission spot even more! We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. It's clean, open and the window seats have great views of mission street (prime time people watching!). Definitely going back for date night!", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["The samosas are to die for,The salmon is fresh, the garlic naan is delicious ! ", "I am going to come back!!!!!!!! :-)"], "author": "Miya M.", "review": "This place is AMAZINGLY GOOD! The samosas are to die for,The salmon is fresh, the garlic naan is delicious ! I am going to come back!!!!!!!! :-)", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["We chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. ", "We were NOT disappointed. ", "The food came out fast and filled our noses with the most delightful smells. ", "It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. ", "Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. ", "Server was super attentive with water and checking in on us. "], "author": "Heather C.", "review": "My BF was feeling a bit under the weather and we just did a full week of going vegetarian, so I perused for the best \"Vegetarian \" near me. Indian popped up as a top cuisine so I thought a quick walk to the Naan & Curry on 3rd & King would work. Then, I came across Lotus SF. Lots of stars and rave reviews. \n\nHopped in the car and headed towards the Mission at 8:30pm on a Thursday. Normally, parking is tough to find based on the time and day of week, but was plentiful and to our surprise. \n\nThe exterior is clean with big windows showing you these beautiful upholstered chairs and tables ready for you inside. A white stone elephant greets you next to the front door, as does a smiling server upon entry. We were surprised, and for a quiet night, we chose a window seat and was equally thrilled at seeing the deliciousness inside their menu.\n\nWe chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. We were NOT disappointed. The food came out fast and filled our noses with the most delightful smells. It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. Server was super attentive with water and checking in on us. (Yay!)\n\nBut this review isn't just about the restaurant, food and service. While we waited for our food, a less fortunate man came in and was looking to dine. After listening to him talk, it was clear he was not sober; the service from the staff was heartwarming. After informing him they couldn't serve him, they sat and listened to him talk. About nothing and everything. My BF and I felt bad, so we asked the server to get him a soda and some food, and put it on our tab. The server went in the kitchen and came back with a box of chicken, rice and water. The gentleman thanked him and left. The server came over and thanked us for our generosity and said it was his duty to take care of the community they were in, but more importantly the patrons inside that supported them. Wow, human kindness DOES exist. I was touched. This made me appreciate the restaurant even more, and all happened before we got our food.\n\nI salute the server, restaurant and what it stands for. Love does conquer all, so get your ass out to Lotus SF and enjoy their savory and perfectly spiced dishes!!!!\n\nPS. You'll find a little surprise on the front of the menu re: Togo orders :) Happy eating!!!", "rating": 5, "date": "2018-02-16"}, {"excerpts": ["Garlic naan was perfect. ", "The only thing needing improvement was the raita which was very watery."], "author": "Mariam H.", "review": "Landed here unexpectedly after a  pride events nearby. The food was delicious!! The butter chicken was like my moms. Garlic naan was perfect. The only thing needing improvement was the raita which was very watery.", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. ", "All of it was amazing! ", "Pakoras light and fresh, naan wasn't dense at all. ", "The mains were all delicious! ", "Bonus, delivery through Yelp came in less than 30 minutes."], "author": "Ri R.", "review": "Damn, fav new Indian restaurant! Everything is fresh -- not greasy or heavy at all. I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. All of it was amazing! Pakoras light and fresh, naan wasn't dense at all. The mains were all delicious! Bonus, delivery through Yelp came in less than 30 minutes.", "rating": 5, "date": "2018-07-06"}, {"excerpts": ["We also had he chicken tandori and nav rattan with rice and garlic naan. ", "We ordered the curry medium but it wasn't really very spicy ", "so I'd probably get hot next time - but the flavor was still really good. ", "Only compliant would be ", "the curry size was pretty small compared to the large rice portion we received. ", "Definitely will go back when I'm craving great Indian."], "author": "Greta H.", "review": "Had a great dinner here! Staff was really friendly and accommodating. We had veggie pakoras to start that were some of the best I've ever had! We also had he chicken tandori and nav rattan with rice and garlic naan. We ordered the curry medium but it wasn't really very spicy so I'd probably get hot next time - but the flavor was still really good. Only compliant would be the curry size was pretty small compared to the large rice portion we received. Definitely will go back when I'm craving great Indian.", "rating": 5, "date": "2018-06-08"}, {"excerpts": ["Amazing attention to detail and garlic naan was great. ", "It's a quiet place and good vibes."], "author": "Grant M.", "review": "This place is so classy. Amazing attention to detail and garlic naan was great. It's a quiet place and good vibes.", "rating": 5, "date": "2018-03-28"}, {"excerpts": ["I got potato samosas aloo gobi and garlic naan! ", "Loved every bit!! ", "Interior decor and ambiance were relaxing and tasteful. ", "Will be back"], "author": "Chloe C.", "review": "The food was delicious and my servers were extremely helpful and accommodating to my vegan requests! I got potato samosas aloo gobi and garlic naan! Loved every bit!! Interior decor and ambiance were relaxing and tasteful. Will be back", "rating": 5, "date": "2018-03-02"}], "holy basil pesto naan": [], "onion naan": [{"excerpts": ["I can't get enough of there yummy onion naan. ", "The people working there are super friendly and polite."], "author": "Fatma I.", "review": "Probably is my favorite Indian food restaurant. I have been ordering almost every day for lunch and dinner. The butter chicken is super delicious and sag paneer is just wow. I can't get enough of there yummy onion naan. The people working there are super friendly and polite.", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["We got the garlic, pesto, and onion naan ", "and they were all phenomenal. ", "Hot and crispy and a just a little bit fluffy ", "so you could soak up curry without it turning into a soggy mess. "], "author": "Anna L.", "review": "I think.. this is now my favorite Indian food spot in the city...\n\nI came here with my boyfriend on a whim after browsing yelp for food (you know, the usual). We decided on Lotus SF after we both agreed we were hungry for some naan and curry. The interior is very pink and a little dim and kind of cute in a grandma's-living-room kind of way. It was kind of quiet and the decor may be a little bit confused, but the star of this review is the food. \n\nFirst off, the naan here is insanely good. They have so many different flavors of naan we ordered three because we couldn't decide haha. We got the garlic, pesto, and onion naan and they were all phenomenal. Hot and crispy and a just a little bit fluffy so you could soak up curry without it turning into a soggy mess. If you plan on getting any curry dish here, please don't play yourself by not ordering some of their naan. \n\nMy favorite dish we shared here was definitely the Chicken Tikka Masala. It is SO GOOD!! I have to admit, I don't remember the other dish we ordered because it has been shuttered out of my memory after the Chicken Tikka Masala took my mind and soul, but my boyfriend really enjoyed it haha. \n\nThis is a place I am definitely going to see myself back at in the near future! I hope their food only gets better as their business grows!", "rating": 5, "date": "2018-05-07"}, {"excerpts": ["Good onion naan!  ", "I can't recommend Lotus SF highly enough.  ", "I'm thrilled to finally have found a REALLY GREAT Indian restaurant.  ", "Bravo!"], "author": "tom s.", "review": "Absolutely stellar!  Even my fussy Manhattan visitors agreed.  The lamb biryani was remarkable; the salmon (Tandoori Fish) was outstanding, and the coconut shrimp was great too.  Good onion naan!  I can't recommend Lotus SF highly enough.  I'm thrilled to finally have found a REALLY GREAT Indian restaurant.  Bravo!", "rating": 5, "date": "2018-08-14"}, {"excerpts": ["We had lamb saag, chicken Teka masala and onion naan.  ", "The kids gobbled it up too!  ", "Very nice place and will definitely be coming back here!"], "author": "M. R.", "review": "Very good food and very good service.  They went out of their way to make our kids feel welcomed and the food was great!  We had lamb saag, chicken Teka masala and onion naan.  The kids gobbled it up too!  Very nice place and will definitely be coming back here!", "rating": 5, "date": "2018-03-04"}], "chapati": [{"excerpts": ["Food: I ordered the Chapati and Bengan Bharta. ", "The Bengan bharta was not vegan ", "so I asked the server if he could make it vegan ", "and he said yes. ", "When I got my food, I was extremely excited to try it because it looked so delicious! ", "I first tried it with my chapati bread and it was so delicious. ", "I definitely loved the spices with the eggplant. ", "The flavor was so exceptional! ", "I also tried it with brown rice and again amazed because it genuinely tasted that good to me. ", "I'm definitely glad I ordered the Benga Bertha! \n"], "author": "Tanya D.", "review": "Wow just wow. This place was perfect.\n\nMy boyfriend and I arrived at this place 9ish. So the place was not busy whatsoever. When we arrived we were quickly greeted and sat down.\n\nFood: I ordered the Chapati and Bengan Bharta. The Bengan bharta was not vegan so I asked the server if he could make it vegan and he said yes. When I got my food, I was extremely excited to try it because it looked so delicious! I first tried it with my chapati bread and it was so delicious. I definitely loved the spices with the eggplant. The flavor was so exceptional! I also tried it with brown rice and again amazed because it genuinely tasted that good to me. I'm definitely glad I ordered the Benga Bertha! \nMy boyfriend ordered brown rice, fish tikka masala, and naan. He said his fish tikka masala was delicious. Overall, we really enjoyed our food. It was definitely a 5/5 for me!  \n\nService: From the beginning and end of our meal the service was spot on. Everyone was so helpful and kind. Especially when I asked for my dishes to be veganised. The servers were extremely spot on with the timing on asking us if we needed anything. It's such a small aspect but I really enjoy when they wait for all the food to be cooked and then serving it to us. Such a great experience with customer service!\n\nThe atmosphere of the place was quite relaxing! The decor and the look of the place was pleasing. Additionally, the whole restaurant is really clean!\n\nI definitely recommend this place because the food is just very delicious, the place is clean, and the customer service is spot on. It's quite difficult to impress me but this place definitely did :)", "rating": 5, "date": "2018-10-14"}], "paratha": [{"excerpts": ["The paratha was very well done with whole wheat flour - flaky and substantial. \n\n"], "author": "Chris M.", "review": "Came back here again, and I am glad to see it's still doing well. They've tightened up the menu with more fan favorites. The service is as good as ever, and folks around me were commenting on how much they liked the food. Dal Makhani was rich and buttery, but not heavy. The paratha was very well done with whole wheat flour - flaky and substantial. \n\nTrust me that if you want it spicy, they are more than happy to bring the heat. The chai is bomb, give it a shot. Also - ask for a side of pickles if you're into the Indian variety.", "rating": 5, "date": "2018-07-18"}, {"excerpts": ["Flaky paratha. ", "An oasis on Mission. ", "Any possible surge in blood pressure from the rich food is more than offset by the soothing ambiance and excellent service."], "author": "H S.", "review": "Delicious butter chicken, aloo gobi. Flaky paratha. An oasis on Mission. Any possible surge in blood pressure from the rich food is more than offset by the soothing ambiance and excellent service.", "rating": 5, "date": "2018-03-06"}], "gluten free naan": [{"excerpts": ["The samosas are great though, and they have gluten free naan. ", "If price were no object, this would be my Indian spot of choice."], "author": "Gieselle A.", "review": "Among the tastiest Indian food I've had in sf! That being said, this spot is expensive. The samosas are great though, and they have gluten free naan. If price were no object, this would be my Indian spot of choice.", "rating": 4, "date": "2018-10-28"}, {"excerpts": ["So many options- including a gluten free naan! ", "(That is never an option and it is so good!!) ", "Our waiter noticed we didn't order any meat and asked if we were vegan, only to recommend other items as well, which I appreciate. ", "Really love the veggie coconut curry, perfect dip for the naan! ", "It is beautifully decorated and a great place to enjoy lunch or dinner. ", "Vegan/gf heaven and for meat eaters as well", ", this is a place to try for sure!"], "author": "Andrea A.", "review": "I've come here a couple times now and being gluten free and vegan I need to express how much I love it. So many options- including a gluten free naan! (That is never an option and it is so good!!) Our waiter noticed we didn't order any meat and asked if we were vegan, only to recommend other items as well, which I appreciate. Really love the veggie coconut curry, perfect dip for the naan! It is beautifully decorated and a great place to enjoy lunch or dinner. Vegan/gf heaven and for meat eaters as well, this is a place to try for sure!", "rating": 5, "date": "2018-09-03"}, {"excerpts": ["Gluten free naan ", "(pesto is the best!)\n"], "author": "Sydney E.", "review": "Amazing food that is as delicious as it is healthy! I've never had such perfectly flavorful Indian food, and yet it doesn't leave me feeling overstuffed because it's made with such high quality ingredients. \n\nThey are also very accommodating of any dietary needs. \n\nService is also fantastic!\n\nOne of my favorite restaurants (if not my favorite) in San Francisco!\n\nDishes I have tried and loved:\nAloo gobi\nChicken masala\nChicken Curry \nCoconut curry with prawns \nGluten free naan (pesto is the best!)\nChicken pakoras \nVegetable pakoras", "rating": 5, "date": "2018-07-24"}, {"excerpts": ["I've literally never even see gluten free naan anywhere, and this was so fantastic!! ", "We got the pesto garlic gluten free naan ", "and I can not recommend it enough! ", "It's made with chickpea flour for reference. ", "Also had the daal soup which was good but kind of bland, but made a delicious dipping sauce for our veggie samosas (these were some of the best I've had! ", "Absolutely order these) ", "The waiter recommended the eggplant curry & it was amazing! ", "The saag was good too, and we substituted the paneer for potatoes to make it vegan. ", "Everyone should try this place because it was great ", "& I want them to stay in business!! ", "Prices were reasonable and the food was super shareable if you're looking for a great date or party spot! ", "Decor is beautiful & they have a somewhat extensive wine list for an Indian restaurants with all wines at the $9-10/glass range.", "We got the pesto garlic gluten free naan ", "and I can not recommend it enough! ", "It's made with chickpea flour for reference. ", "Also had the daal soup which was good but kind of bland, but made a delicious dipping sauce for our veggie samosas (these were some of the best I've had! ", "Absolutely order these) ", "The waiter recommended the eggplant curry & it was amazing! ", "The saag was good too, and we substituted the paneer for potatoes to make it vegan. ", "Everyone should try this place because it was great ", "& I want them to stay in business!! ", "Prices were reasonable and the food was super shareable if you're looking for a great date or party spot! ", "Decor is beautiful & they have a somewhat extensive wine list for an Indian restaurants with all wines at the $9-10/glass range."], "author": "Kylie F.", "review": "Amazing Indian food! I've literally never even see gluten free naan anywhere, and this was so fantastic!! We got the pesto garlic gluten free naan and I can not recommend it enough! It's made with chickpea flour for reference. Also had the daal soup which was good but kind of bland, but made a delicious dipping sauce for our veggie samosas (these were some of the best I've had! Absolutely order these) The waiter recommended the eggplant curry & it was amazing! The saag was good too, and we substituted the paneer for potatoes to make it vegan. Everyone should try this place because it was great & I want them to stay in business!! Prices were reasonable and the food was super shareable if you're looking for a great date or party spot! Decor is beautiful & they have a somewhat extensive wine list for an Indian restaurants with all wines at the $9-10/glass range.", "rating": 5, "date": "2018-02-17"}, {"excerpts": ["Also - they have gluten free naan, which is pretty rare.\n\n", "GLUTEN FREE NAAN? ", "Yes - that is correct. ", "And it's good!", "GLUTEN FREE NAAN? ", "Yes - that is correct. ", "And it's good!"], "author": "Tahd F.", "review": "Super tasty food, served by an exceedingly polite staff, in a wonderfully decorated environment. The only thing I couldn't figure out is why the place isn't packed (yet). \n\nEssentially, whatever you want, they'll make - says so right on the menu, provided it's Indian. Also - they have gluten free naan, which is pretty rare.\n\nGLUTEN FREE NAAN? Yes - that is correct. And it's good!", "rating": 5, "date": "2018-04-04"}, {"excerpts": ["We ordered the veggie pakoras, shrimp saagwala, chicken tikka masala, aloo baingan, rice, and GLUTEN FREE NAAN. ", "Yes, you heard me right. ", "And it was actually decent! ", "I will definitely be back."], "author": "Julia P.", "review": "Start to finish such a lovely dining experience! The service was excellent - very polite and attentive. The atmosphere was great, and clearly a lot of thought went into the decor. The bathroom was bright and sparking clean. And of course...the food! SO GOOD! We ordered the veggie pakoras, shrimp saagwala, chicken tikka masala, aloo baingan, rice, and GLUTEN FREE NAAN. Yes, you heard me right. And it was actually decent! I will definitely be back.", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["I was excited for the gluten free naan which was decent. ", "But other than that it's the usual fare. ", "No different than any other Indian restaurant. ", "Good ambiance. ", "But the chai sucks. ", "Too much milk."], "author": "Neeraj K.", "review": "I was excited for the gluten free naan which was decent. But other than that it's the usual fare. No different than any other Indian restaurant. Good ambiance. But the chai sucks. Too much milk.", "rating": 4, "date": "2018-03-13"}], "gluten free garlic naan": [], "gluten free pesto garlic naan": [], "aloo began curry": [], "paneer tikka masala": [{"excerpts": ["Ordered the garlic naan, paneer tikka masala, pesto paneer kabab, and the veggie pakora, and all of them were delicious! ", "Great service too! ", "Definitely recommend this place~"], "author": "Jodi T.", "review": "Really good Indian restaurant on Mission. The interior is stunning! Ordered the garlic naan, paneer tikka masala, pesto paneer kabab, and the veggie pakora, and all of them were delicious! Great service too! Definitely recommend this place~", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["I'm a big fan of their veggie pakoras, paneer tikka masala, naan, and mango lassi (served with a paper straw!). ", "They have a ton of vegetarian options and can also make dishes vegan if you ask. "], "author": "Emily M.", "review": "My BF and I love this place. I'm a big fan of their veggie pakoras, paneer tikka masala, naan, and mango lassi (served with a paper straw!). They have a ton of vegetarian options and can also make dishes vegan if you ask. My BF loves their butter chicken. The staff is kind and attentive. We've been back since our first visit and definitely plan to frequent this place!", "rating": 5, "date": "2018-07-19"}, {"excerpts": ["I tried veggie biryani, paneer tikka masala, chicken dishes.. everything was 10/10.\n\n"], "author": "D M.", "review": "The best place to eat in San Francisco... best service and delicious food. Everyone is so caring, helpful and friendly with the customers. The location is extremely happening and the ambience of the place is superb. I definitely recommend everyone to try this place. I tried veggie biryani, paneer tikka masala, chicken dishes.. everything was 10/10.\n\nLove love love", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["Their Butter Chicken Masala and Paneer Tikka Masala is to die for!!! ", "Their starters- "], "author": "Bridgette P.", "review": "Absolutely delicious and adorable new Indian hot spot in the heart of the Mission!!! I totally go for new and up in coming neighborhood restaurants! This is adorable, cozy, romantically and beautifully decorated. A bit chic too to be honest! Great atmosphere, but above all, amazing service and DELICIOUS FOOD!!! I definitely recommend this place! Their Butter Chicken Masala and Paneer Tikka Masala is to die for!!! Their starters- Chicken Pakoras and Vegetable Samosas are too, as well as the dessert Gulab Jamun! It's honestly like fine dining status, but a fraction of the cost and again, the service is sooooo nice and friendly. I hope they continue to serve us their amazing food for decades to come! If you're like me who supports your neighborhood mom and pop shops, this is absolutely fantastic and you'll love it-I guarantee!!! It's better than those \"hot and trendy restaurants\" that already have a tremendous amount of success. \n\n\nThank you Lotus for your humble and kind service and delicious and memorable dishes!!! We'll definitely be back and spread the word to all our friends and colleagues! By the way, Amit and Binod were our servers and they were SO kind and super attentive and professional! THANK YOU!!! :)", "rating": 5, "date": "2018-01-20"}], "navrattan korma": [{"excerpts": ["Bengan Bartha, Tikka Masala, Navrattan Korma, Coconut Shrimp, Tandoori Lamb. ", "All amazing. ", "They'll also make whatever you want that's not on the menu, so we requested Malai Kofta and they made it for us! ", "And it was spectacular. "], "author": "Bonnie H.", "review": "I am a regular here and have been coming here since they opened about a year ago. Our regular Indian place (which shall not be named... though if you look at my reviews you'd find it) betrayed us. They were amazing and then they were not, so we needed to find a new regular... and Lotus quickly became it.\n\nEverything is amazing. Saag panner for me is a staple and litmus test for a good Indian place. They do it exactly right here. The spinach is fluffy! FLUFFY! How do they do it? I don't know.\n\nOther stuff that's good: Bengan Bartha, Tikka Masala, Navrattan Korma, Coconut Shrimp, Tandoori Lamb. All amazing. They'll also make whatever you want that's not on the menu, so we requested Malai Kofta and they made it for us! And it was spectacular. Now it's one of our regular dishes we get.\n\nThe staff is very nice, and appreciative of our regular-ness. \n\nThe atmosphere is nice. It's not hole-in-the-wall, but not super fancy. Just a great place to have dinner any night of the week.\n\nOne thing I'll say is that \"Medium spicy\" is kinda spicy. We still like it this way but it catches us off guard sometimes. :)", "rating": 5, "date": "2018-10-27"}], "aloo gobi mattar": [], "saag paneer": [{"excerpts": ["Their Saag Paneer, veggie pakoras and biryanis are amazing.  ", "I especially love the fact that they will fill up your tiffins so you can don't add more plastic to this world. \n", "Great ambiance and decor, it is my go-to place for Indian food in the Mission!"], "author": "Yas E.", "review": "Lotus is superb!  It is so hard to find great Punjabi Indian food in the Mission.   Their Saag Paneer, veggie pakoras and biryanis are amazing.  I especially love the fact that they will fill up your tiffins so you can don't add more plastic to this world. \nGreat ambiance and decor, it is my go-to place for Indian food in the Mission!", "rating": 5, "date": "2018-08-10"}, {"excerpts": ["Favorite dishes include the fish tikka masala, Saag paneer, lamb biriani and the naan. ", "Go here for lunch - they need the business then."], "author": "f f.", "review": "I love this restaurant. The food is delicious and presented beautifully. The atmosphere is lush with color and romantically lit. And the servers are warm, efficient and knowledgeable. This place used to be occupied by a flooring store so there is Variety of lovely \"sample\" floors in different areas of the restaurant.  Favorite dishes include the fish tikka masala, Saag paneer, lamb biriani and the naan. Go here for lunch - they need the business then.", "rating": 5, "date": "2018-09-10"}, {"excerpts": ["I split a Saag Paneer with my partner and it was plenty for both of us! ", "Delicious and Extraordinary food here! ", "Highly recommend with confidence. ", "Keep up the great work Lotus SF :)"], "author": "Delilah W.", "review": "Wow, this is my new favorite Indian Food restaurant. FRESH and authentic tasting. They use Organic Ghee and have preferences for Gluten Free bread. I split a Saag Paneer with my partner and it was plenty for both of us! Delicious and Extraordinary food here! Highly recommend with confidence. Keep up the great work Lotus SF :)", "rating": 5, "date": "2018-04-19"}, {"excerpts": ["I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. ", "All of it was amazing! ", "Pakoras light and fresh, naan wasn't dense at all. ", "The mains were all delicious! ", "Bonus, delivery through Yelp came in less than 30 minutes."], "author": "Ri R.", "review": "Damn, fav new Indian restaurant! Everything is fresh -- not greasy or heavy at all. I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. All of it was amazing! Pakoras light and fresh, naan wasn't dense at all. The mains were all delicious! Bonus, delivery through Yelp came in less than 30 minutes.", "rating": 5, "date": "2018-07-06"}], "bengan bharta": [{"excerpts": ["Food: I ordered the Chapati and Bengan Bharta. ", "The Bengan bharta was not vegan ", "so I asked the server if he could make it vegan ", "and he said yes. ", "When I got my food, I was extremely excited to try it because it looked so delicious! ", "I first tried it with my chapati bread and it was so delicious. ", "I definitely loved the spices with the eggplant. ", "The flavor was so exceptional! ", "I also tried it with brown rice and again amazed because it genuinely tasted that good to me. ", "I'm definitely glad I ordered the Benga Bertha! \n"], "author": "Tanya D.", "review": "Wow just wow. This place was perfect.\n\nMy boyfriend and I arrived at this place 9ish. So the place was not busy whatsoever. When we arrived we were quickly greeted and sat down.\n\nFood: I ordered the Chapati and Bengan Bharta. The Bengan bharta was not vegan so I asked the server if he could make it vegan and he said yes. When I got my food, I was extremely excited to try it because it looked so delicious! I first tried it with my chapati bread and it was so delicious. I definitely loved the spices with the eggplant. The flavor was so exceptional! I also tried it with brown rice and again amazed because it genuinely tasted that good to me. I'm definitely glad I ordered the Benga Bertha! \nMy boyfriend ordered brown rice, fish tikka masala, and naan. He said his fish tikka masala was delicious. Overall, we really enjoyed our food. It was definitely a 5/5 for me!  \n\nService: From the beginning and end of our meal the service was spot on. Everyone was so helpful and kind. Especially when I asked for my dishes to be veganised. The servers were extremely spot on with the timing on asking us if we needed anything. It's such a small aspect but I really enjoy when they wait for all the food to be cooked and then serving it to us. Such a great experience with customer service!\n\nThe atmosphere of the place was quite relaxing! The decor and the look of the place was pleasing. Additionally, the whole restaurant is really clean!\n\nI definitely recommend this place because the food is just very delicious, the place is clean, and the customer service is spot on. It's quite difficult to impress me but this place definitely did :)", "rating": 5, "date": "2018-10-14"}], "chana masala": [{"excerpts": ["My friends and I got bengal bartha and Chana masala and honestly both dishes were pretty flavorless even after adding salt and side sauces. ", "I'm actually surprised this place has such a high rating on yelp. ", "It was the most underwhelming Indian food I've had in San Francisco and maybe ever. ", "I don't like to leave bad reviews but hopefully this will inspire some improvement on the kitchens behalf."], "author": "Margaret D.", "review": "The ambiance is super beautiful and the place is clean and the servers are nice but they really need a new chef and a review of their portions. For $12.95 you get a small portion of food and then you pay extra for rice. My friends and I got bengal bartha and Chana masala and honestly both dishes were pretty flavorless even after adding salt and side sauces. I'm actually surprised this place has such a high rating on yelp. It was the most underwhelming Indian food I've had in San Francisco and maybe ever. I don't like to leave bad reviews but hopefully this will inspire some improvement on the kitchens behalf.", "rating": 3, "date": "2018-04-14"}, {"excerpts": ["Of course, there were other vegetarian options at that price (next time, I'll try the chana masala) as well as meat dishes (chicken, lamb) and fish & seafood (for about $1 to $4 more). ", "I did not explore desserts (but will try the gulab jamon). ", "This is the real deal in Northern Indian cuisine and ambience. ", "(I bet that was the owner I saw standing by.) ", "I can hardly wait to go back for more!"], "author": "Patricia K.", "review": "THIS IS THE REAL DEAL.\nGreeting the customer with what looks like marble Ganeshas outside and big, brass ones inside, LOTUS SF continues with the theme of high quality and fine Indian art, from the fine paintings (including masterpieces of the Persian-influenced era) and a unique 3-D wood portrait (suggestive of the style of Yaacov Agam) of Indian Independence hero Kartar Singh Sarabha, to the fantastic floors (dramatic and sweeping marble-inlaid designs in bright blues, golds, and a variety of other colors and patterns--different for each section of the restaurant, and gorgeous faux-wood tile flooring in the bathrooms, which sparkle with cleanliness and chrome fixtures, and white-on-white, fine-geometric-patterned, fresco-like tile walls). \nAnd then there's lunch, all served on cloth tablecloths in beautiful, intricately patterned white-on-white china (made in Thailand) by charming staff from India and/or Nepal--while authentic Indian classical music plays in the background.\nFirst time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\nALL THIS for $12 (plus a generous tip, which they so richly deserve)!\nOf course, there were other vegetarian options at that price (next time, I'll try the chana masala) as well as meat dishes (chicken, lamb) and fish & seafood (for about $1 to $4 more). I did not explore desserts (but will try the gulab jamon). This is the real deal in Northern Indian cuisine and ambience. (I bet that was the owner I saw standing by.) I can hardly wait to go back for more!", "rating": 5, "date": "2018-03-11"}], "dal tarka": [], "dal makhni": [{"excerpts": ["First time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). ", "I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. ", "I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\n", "ALL THIS for $12 (plus a generous tip, which they so richly deserve)!\n"], "author": "Patricia K.", "review": "THIS IS THE REAL DEAL.\nGreeting the customer with what looks like marble Ganeshas outside and big, brass ones inside, LOTUS SF continues with the theme of high quality and fine Indian art, from the fine paintings (including masterpieces of the Persian-influenced era) and a unique 3-D wood portrait (suggestive of the style of Yaacov Agam) of Indian Independence hero Kartar Singh Sarabha, to the fantastic floors (dramatic and sweeping marble-inlaid designs in bright blues, golds, and a variety of other colors and patterns--different for each section of the restaurant, and gorgeous faux-wood tile flooring in the bathrooms, which sparkle with cleanliness and chrome fixtures, and white-on-white, fine-geometric-patterned, fresco-like tile walls). \nAnd then there's lunch, all served on cloth tablecloths in beautiful, intricately patterned white-on-white china (made in Thailand) by charming staff from India and/or Nepal--while authentic Indian classical music plays in the background.\nFirst time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\nALL THIS for $12 (plus a generous tip, which they so richly deserve)!\nOf course, there were other vegetarian options at that price (next time, I'll try the chana masala) as well as meat dishes (chicken, lamb) and fish & seafood (for about $1 to $4 more). I did not explore desserts (but will try the gulab jamon). This is the real deal in Northern Indian cuisine and ambience. (I bet that was the owner I saw standing by.) I can hardly wait to go back for more!", "rating": 5, "date": "2018-03-11"}], "chicken saag": [], "butter chicken": [{"excerpts": ["Their butter chicken is some of the best I've ever had, their naan is succulent and buttery, and it's all just delicious and very high-quality, with balanced spices and terrific consistency and textures. ", "Seriously, get the butter chicken!"], "author": "Christina M.", "review": "I am truly amazed at how well-executed the food is here, even as a delivery customer. Their butter chicken is some of the best I've ever had, their naan is succulent and buttery, and it's all just delicious and very high-quality, with balanced spices and terrific consistency and textures. My sole nitpick is that their rice is on the stickier/gummier side, but I can live with that.\n\nSeriously, get the butter chicken!", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["The butter chicken is super delicious and sag paneer is just wow. "], "author": "Fatma I.", "review": "Probably is my favorite Indian food restaurant. I have been ordering almost every day for lunch and dinner. The butter chicken is super delicious and sag paneer is just wow. I can't get enough of there yummy onion naan. The people working there are super friendly and polite.", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["but we had two different chicken dishes (butter chicken and chicken masala), cauliflower, chickpeas, spinach and the  eggplant dish. "], "author": "Angela K.", "review": "We went to another restaurant down the street but they couldn't fit a party of 8 so I quickly looked up another space that had good reviews, kid-friendly and able to accommodate vegans, vegetarians and meat-eaters. Viola!! Lotus SF popped up, I gave them a call and they said yes! Party of 8? Come on over!\n\nSo we made our way there and noticed that it was recently opened! We each ordered a dish and when it came out in little bowls.. we all looked at each other a bit concerned that we'd still be hungry. But by the end of the meal we we're raving about how great each dish was, so much flavor and best Indian food we've tasted. Their naan was superb. We ordered about 4 plates of naan, 3 bowls of rice to accompany the 6 dishes for 6 adults and 2 children. No one left hungry. \n\nI can't remember the dishes real name but we had two different chicken dishes (butter chicken and chicken masala), cauliflower, chickpeas, spinach and the  eggplant dish. Yummy!! \n\nGreat dinner and would definitely come back! :)", "rating": 5, "date": "2018-03-12"}, {"excerpts": ["and I have several favorites like the Saag, the butter chicken, the chicken Tikka masala, the tandoori lamb and the vegeterian eggplant dish (something with bartha) "], "author": "Tomer S.", "review": "This is the best Indian food in the mission and possibly in the city, at least from everything it tested so far. All the food is made at really higglh quality to the last detail. You feel as if they really thought through the full flavor of the dish. \nAt this point I tried almost every dish there and I have several favorites like the Saag, the butter chicken, the chicken Tikka masala, the tandoori lamb and the vegeterian eggplant dish (something with bartha) was so delicious.\n\nThe service is also really great, so kind, very responsive, you wait for the food up to 15 min and it is ready.\nWhen you do a takeaway the price becomes quite cheap as you save on tip but they also give you 10% discount. What a deal!!!\nAt this point I'm.doing whatwver I can to get people to try it, the place is just next to me and I want to ensure it is successful even with SF rents. I just this place to be there for me forever... I feel.like I was waiting for this restaurant ever since 2009 when I was eating amazing Indian food in Thailand.\nSo far everyone that followed my advice became a fan, you (reading the review) should be the next one.", "rating": 5, "date": "2018-06-10"}, {"excerpts": ["I've only had the butter chicken here so far ", "but I think it's super tasty! "], "author": "Stephany L.", "review": "As a disclaimer, I'm by no means an expert on Indian food, but I'm super into Lotus! My favorite thing by far is just the fact that they actually cater to us spicy-intolerant noobs who can't even handle hot cheetos by asking what level of spice you want when you order. I've only had the butter chicken here so far but I think it's super tasty! The pesto naan was interesting but I still prefer garlic. The naan is a bit chewier/stretchier than I'm used to / prefer, but again- not an expert on Indian food. I also really like that at least so far (since they've only opened recently), it's really easy to get seated right away. It's a really nice getaway from the hipstery overpriced restaurants dotting Valencia street (which I love too- but sometimes you need a break yenno?). This is going to be a regular spot for me!", "rating": 4, "date": "2018-03-11"}, {"excerpts": ["We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. ", "It's clean, open and the window seats have great views of mission street (prime time people watching!). ", "Definitely going back for date night!"], "author": "Kelsey L.", "review": "This place is amazing! My partner and I discovered lotus in San Rafael, but love the mission spot even more! We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. It's clean, open and the window seats have great views of mission street (prime time people watching!). Definitely going back for date night!", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["My BF loves their butter chicken. ", "The staff is kind and attentive. ", "We've been back since our first visit and definitely plan to frequent this place!"], "author": "Emily M.", "review": "My BF and I love this place. I'm a big fan of their veggie pakoras, paneer tikka masala, naan, and mango lassi (served with a paper straw!). They have a ton of vegetarian options and can also make dishes vegan if you ask. My BF loves their butter chicken. The staff is kind and attentive. We've been back since our first visit and definitely plan to frequent this place!", "rating": 5, "date": "2018-07-19"}, {"excerpts": ["Some of my favorites are navratan korma, butter chicken, aloo gobi, rogan josh and the lamb chops. ", "The service is great and friendly and we've never had to wait for a table! ", "Takeout is also quick and easy."], "author": "Danielle C.", "review": "I've tried half the menu and everything is amazing! Some of my favorites are navratan korma, butter chicken, aloo gobi, rogan josh and the lamb chops. The service is great and friendly and we've never had to wait for a table! Takeout is also quick and easy.", "rating": 5, "date": "2018-08-08"}, {"excerpts": ["This place has the best butter chicken (with dark meat!) in town, and everything else is delicious too. ", "They use mostly organic ingredients and ", "everything is on the healthier side. ", "Our favorites are the butter chicken, the tandoori chicken, the baingan bharta and the chili cheese kulcha!"], "author": "Vidya N.", "review": "This place has the best butter chicken (with dark meat!) in town, and everything else is delicious too. They use mostly organic ingredients and everything is on the healthier side. Our favorites are the butter chicken, the tandoori chicken, the baingan bharta and the chili cheese kulcha!", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["Delicious butter chicken, aloo gobi. "], "author": "H S.", "review": "Delicious butter chicken, aloo gobi. Flaky paratha. An oasis on Mission. Any possible surge in blood pressure from the rich food is more than offset by the soothing ambiance and excellent service.", "rating": 5, "date": "2018-03-06"}, {"excerpts": ["The butter chicken was like my moms. "], "author": "Mariam H.", "review": "Landed here unexpectedly after a  pride events nearby. The food was delicious!! The butter chicken was like my moms. Garlic naan was perfect. The only thing needing improvement was the raita which was very watery.", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["Love the butter chicken, lamb kebab, biryani, dal makhani, panner tikka! ", "Love the ambience and interior(great canvas painting ) ", "Very clean with a smooth jazz music which is a cherry on top! ", "Amazing hospitality. ", "I will definitely come over here again!! ", "Thank you Lotus SF!!"], "author": "Vishal M.", "review": "This is so far the best Indian food I have had!! Love the butter chicken, lamb kebab, biryani, dal makhani, panner tikka! Love the ambience and interior(great canvas painting ) Very clean with a smooth jazz music which is a cherry on top! Amazing hospitality. I will definitely come over here again!! Thank you Lotus SF!!", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["Their Butter Chicken Masala and Paneer Tikka Masala is to die for!!! ", "Their starters- "], "author": "Bridgette P.", "review": "Absolutely delicious and adorable new Indian hot spot in the heart of the Mission!!! I totally go for new and up in coming neighborhood restaurants! This is adorable, cozy, romantically and beautifully decorated. A bit chic too to be honest! Great atmosphere, but above all, amazing service and DELICIOUS FOOD!!! I definitely recommend this place! Their Butter Chicken Masala and Paneer Tikka Masala is to die for!!! Their starters- Chicken Pakoras and Vegetable Samosas are too, as well as the dessert Gulab Jamun! It's honestly like fine dining status, but a fraction of the cost and again, the service is sooooo nice and friendly. I hope they continue to serve us their amazing food for decades to come! If you're like me who supports your neighborhood mom and pop shops, this is absolutely fantastic and you'll love it-I guarantee!!! It's better than those \"hot and trendy restaurants\" that already have a tremendous amount of success. \n\n\nThank you Lotus for your humble and kind service and delicious and memorable dishes!!! We'll definitely be back and spread the word to all our friends and colleagues! By the way, Amit and Binod were our servers and they were SO kind and super attentive and professional! THANK YOU!!! :)", "rating": 5, "date": "2018-01-20"}], "chicken coconut curry": [{"excerpts": ["Ordered:\n- Gluten free garlic pesto naan (because yelp said)\n- Chicken Saab \n- Chicken coconut curry\n- Rice\n- Mango lassi \n\n", "that naan was so good I could be. "], "author": "Capers B.", "review": "This place was absolutely delicious! The decor was great, music enjoyable and staff was both friendly and helpful. \n\nFood was filling enough to take home leftovers. Ordered:\n- Gluten free garlic pesto naan (because yelp said)\n- Chicken Saab \n- Chicken coconut curry\n- Rice\n- Mango lassi \n\nI'm neither vegan nor gluten free but that naan was so good I could be. It tasted so good I'm already dreaming of my leftovers. \n\nThis was a great first time try and I'll certainly be back!", "rating": 5, "date": "2018-02-26"}, {"excerpts": ["We chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. ", "We were NOT disappointed. ", "The food came out fast and filled our noses with the most delightful smells. ", "It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. ", "Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. ", "Server was super attentive with water and checking in on us. "], "author": "Heather C.", "review": "My BF was feeling a bit under the weather and we just did a full week of going vegetarian, so I perused for the best \"Vegetarian \" near me. Indian popped up as a top cuisine so I thought a quick walk to the Naan & Curry on 3rd & King would work. Then, I came across Lotus SF. Lots of stars and rave reviews. \n\nHopped in the car and headed towards the Mission at 8:30pm on a Thursday. Normally, parking is tough to find based on the time and day of week, but was plentiful and to our surprise. \n\nThe exterior is clean with big windows showing you these beautiful upholstered chairs and tables ready for you inside. A white stone elephant greets you next to the front door, as does a smiling server upon entry. We were surprised, and for a quiet night, we chose a window seat and was equally thrilled at seeing the deliciousness inside their menu.\n\nWe chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. We were NOT disappointed. The food came out fast and filled our noses with the most delightful smells. It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. Server was super attentive with water and checking in on us. (Yay!)\n\nBut this review isn't just about the restaurant, food and service. While we waited for our food, a less fortunate man came in and was looking to dine. After listening to him talk, it was clear he was not sober; the service from the staff was heartwarming. After informing him they couldn't serve him, they sat and listened to him talk. About nothing and everything. My BF and I felt bad, so we asked the server to get him a soda and some food, and put it on our tab. The server went in the kitchen and came back with a box of chicken, rice and water. The gentleman thanked him and left. The server came over and thanked us for our generosity and said it was his duty to take care of the community they were in, but more importantly the patrons inside that supported them. Wow, human kindness DOES exist. I was touched. This made me appreciate the restaurant even more, and all happened before we got our food.\n\nI salute the server, restaurant and what it stands for. Love does conquer all, so get your ass out to Lotus SF and enjoy their savory and perfectly spiced dishes!!!!\n\nPS. You'll find a little surprise on the front of the menu re: Togo orders :) Happy eating!!!", "rating": 5, "date": "2018-02-16"}], "chicken tikka masala": [{"excerpts": ["We ordered the chicken tikka masala ($13.95), lamb seekh kebab ($17.95) and garlic naan ($3.95). ", "The chicken tikka masala was delicious! ", "I loved that the sauce wasn't as creamy as at other restaurants and therefore tasted more like home-cooked Indian food. ", "I just wish they gave a few more chicken pieces given the price you are paying. \n", "The lamb kebabs were the absolute WINNER though. ", "The meat was SO flavorful and perfectly cooked and came on a platter with yummy roasted onions and bell peppers. ", "It was finger lickin ", "good ", "and I'd highly recommend this dish. ", "Easily best kebab I've had. \n", "Garlic naan was also fantastic. ", "Garlic naan was also fantastic. "], "author": "Sabina S.", "review": "Lotus is a solid new Indian restaurant addition to the Mission food scene! The best part about this restaurant is their attention to the different diet restrictions that people have and attention to where they source ingredients from. Everything here is organic and everything can be made vegan or gluten-free, which I find awesome even though I myself don't have these restrictions. The decor is warm and inviting, the food is nourishing and tasty, and service is friendly and attentive!\n\nWe ordered the chicken tikka masala ($13.95), lamb seekh kebab ($17.95) and garlic naan ($3.95). The chicken tikka masala was delicious! I loved that the sauce wasn't as creamy as at other restaurants and therefore tasted more like home-cooked Indian food. I just wish they gave a few more chicken pieces given the price you are paying. \nThe lamb kebabs were the absolute WINNER though. The meat was SO flavorful and perfectly cooked and came on a platter with yummy roasted onions and bell peppers. It was finger lickin good and I'd highly recommend this dish. Easily best kebab I've had. \nGarlic naan was also fantastic. It was the right level of thickness and crispness. \n\nI really enjoyed Lotus SF and can't wait to come back and try a few more dishes :).", "rating": 4, "date": "2018-03-12"}, {"excerpts": ["My favorite dish we shared here was definitely the Chicken Tikka Masala. ", "It is SO GOOD!! ", "I have to admit, I don't remember the other dish we ordered because it has been shuttered out of my memory after the Chicken Tikka Masala took my mind and soul, but my boyfriend really enjoyed it haha. \n\n"], "author": "Anna L.", "review": "I think.. this is now my favorite Indian food spot in the city...\n\nI came here with my boyfriend on a whim after browsing yelp for food (you know, the usual). We decided on Lotus SF after we both agreed we were hungry for some naan and curry. The interior is very pink and a little dim and kind of cute in a grandma's-living-room kind of way. It was kind of quiet and the decor may be a little bit confused, but the star of this review is the food. \n\nFirst off, the naan here is insanely good. They have so many different flavors of naan we ordered three because we couldn't decide haha. We got the garlic, pesto, and onion naan and they were all phenomenal. Hot and crispy and a just a little bit fluffy so you could soak up curry without it turning into a soggy mess. If you plan on getting any curry dish here, please don't play yourself by not ordering some of their naan. \n\nMy favorite dish we shared here was definitely the Chicken Tikka Masala. It is SO GOOD!! I have to admit, I don't remember the other dish we ordered because it has been shuttered out of my memory after the Chicken Tikka Masala took my mind and soul, but my boyfriend really enjoyed it haha. \n\nThis is a place I am definitely going to see myself back at in the near future! I hope their food only gets better as their business grows!", "rating": 5, "date": "2018-05-07"}, {"excerpts": ["and I have several favorites like the Saag, the butter chicken, the chicken Tikka masala, the tandoori lamb and the vegeterian eggplant dish (something with bartha) "], "author": "Tomer S.", "review": "This is the best Indian food in the mission and possibly in the city, at least from everything it tested so far. All the food is made at really higglh quality to the last detail. You feel as if they really thought through the full flavor of the dish. \nAt this point I tried almost every dish there and I have several favorites like the Saag, the butter chicken, the chicken Tikka masala, the tandoori lamb and the vegeterian eggplant dish (something with bartha) was so delicious.\n\nThe service is also really great, so kind, very responsive, you wait for the food up to 15 min and it is ready.\nWhen you do a takeaway the price becomes quite cheap as you save on tip but they also give you 10% discount. What a deal!!!\nAt this point I'm.doing whatwver I can to get people to try it, the place is just next to me and I want to ensure it is successful even with SF rents. I just this place to be there for me forever... I feel.like I was waiting for this restaurant ever since 2009 when I was eating amazing Indian food in Thailand.\nSo far everyone that followed my advice became a fan, you (reading the review) should be the next one.", "rating": 5, "date": "2018-06-10"}, {"excerpts": ["We got the chicken tikka masala \n"], "author": "Mckall E.", "review": "Best Indian I've had in San Francisco! \nAmazing friendly staff.\nWe got the chicken tikka masala \nAnd the prawn coconut curry. With the pesto naan. Holy shit. It's the best meal me and my fiancé have had in months. \nYou MUST COME TRY IT!", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["We tried the Chicken Tikka Masala and Prawn Coconut Curry. "], "author": "Esther K.", "review": "Our first stop last weekend in SF, and it was a great experience! Service was wonderful, and the food was delicious. We tried the Chicken Tikka Masala and Prawn Coconut Curry. Both were so flavorful and went perfectly with their warm and fluffy naan. I already miss this place!", "rating": 4, "date": "2018-03-28"}, {"excerpts": ["The spicy chicken Tikka masala wasn't too spicy, great taste. ", "Very happy we came across it."], "author": "Ericca C.", "review": "Excellent chunky chutney, great ambience and service. Very tasty. The new neighborhood spot, for sure. The spicy chicken Tikka masala wasn't too spicy, great taste. Very happy we came across it.", "rating": 5, "date": "2018-05-09"}, {"excerpts": ["We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. ", "It's clean, open and the window seats have great views of mission street (prime time people watching!). ", "Definitely going back for date night!"], "author": "Kelsey L.", "review": "This place is amazing! My partner and I discovered lotus in San Rafael, but love the mission spot even more! We can't get enough of the chicken tikka masala, butter chicken, veggie samosas, and garlic naan. It's clean, open and the window seats have great views of mission street (prime time people watching!). Definitely going back for date night!", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["Took Chicken Tikka Masala, Tandoori Chicken, naans and samosas."], "author": "Elad O.", "review": "Ordered online. Dishes are very small compared to other delivery restaurants. Food is quite bland. Took Chicken Tikka Masala, Tandoori Chicken, naans and samosas.", "rating": 2, "date": "2018-06-02"}, {"excerpts": ["We ordered the veggie pakoras, shrimp saagwala, chicken tikka masala, aloo baingan, rice, and GLUTEN FREE NAAN. ", "Yes, you heard me right. ", "And it was actually decent! ", "I will definitely be back."], "author": "Julia P.", "review": "Start to finish such a lovely dining experience! The service was excellent - very polite and attentive. The atmosphere was great, and clearly a lot of thought went into the decor. The bathroom was bright and sparking clean. And of course...the food! SO GOOD! We ordered the veggie pakoras, shrimp saagwala, chicken tikka masala, aloo baingan, rice, and GLUTEN FREE NAAN. Yes, you heard me right. And it was actually decent! I will definitely be back.", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["I love the chicken tikka masala and the chicken tandoori, but everything is super good. ", "Also a great ambiance inside and very friendly staff. ", "5 stars!"], "author": "Jacob K.", "review": "The food here is absolutely incredible. I love the chicken tikka masala and the chicken tandoori, but everything is super good. Also a great ambiance inside and very friendly staff. 5 stars!", "rating": 5, "date": "2018-06-09"}, {"excerpts": ["We had the chicken tikka masala and the coconut lamb. ", "While the curries were flavourful, the chicken and the lamb were both very very dry. ", "In fact, the chicken was so dry that we did not eat it. ", "The waiter asked us if everything was ok and when I replied that the chicken was very dry he said he will report it to the kitchen. ", "That was the last we've heard about it..."], "author": "Adelle G.", "review": "We had the chicken tikka masala and the coconut lamb. While the curries were flavourful, the chicken and the lamb were both very very dry. In fact, the chicken was so dry that we did not eat it. The waiter asked us if everything was ok and when I replied that the chicken was very dry he said he will report it to the kitchen. That was the last we've heard about it...", "rating": 2, "date": "2018-02-20"}], "surender chicken curry": [], "rogan josh": [{"excerpts": ["Ordered:  Veggie Pakoras, Pesto Naan, Garlic Naan, Raita, Prawn Saag, Lamb Rogan Josh, and Chicken Vindaloo.\n\n"], "author": "daphne w.", "review": "Ordered:  Veggie Pakoras, Pesto Naan, Garlic Naan, Raita, Prawn Saag, Lamb Rogan Josh, and Chicken Vindaloo.\n\nIt was all amazingly delicious.  The meats were cooked perfectly, and the flavors were nicely spiced and complex, as they should be.  I look forward to coming here often -- so happy they opened in my neighborhood!", "rating": 5, "date": "2018-01-10"}, {"excerpts": ["Some of my favorites are navratan korma, butter chicken, aloo gobi, rogan josh and the lamb chops. ", "The service is great and friendly and we've never had to wait for a table! ", "Takeout is also quick and easy."], "author": "Danielle C.", "review": "I've tried half the menu and everything is amazing! Some of my favorites are navratan korma, butter chicken, aloo gobi, rogan josh and the lamb chops. The service is great and friendly and we've never had to wait for a table! Takeout is also quick and easy.", "rating": 5, "date": "2018-08-08"}], "lamb saag": [{"excerpts": ["We had lamb saag, chicken Teka masala and onion naan.  ", "The kids gobbled it up too!  ", "Very nice place and will definitely be coming back here!"], "author": "M. R.", "review": "Very good food and very good service.  They went out of their way to make our kids feel welcomed and the food was great!  We had lamb saag, chicken Teka masala and onion naan.  The kids gobbled it up too!  Very nice place and will definitely be coming back here!", "rating": 5, "date": "2018-03-04"}, {"excerpts": ["I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. ", "All of it was amazing! ", "Pakoras light and fresh, naan wasn't dense at all. ", "The mains were all delicious! ", "Bonus, delivery through Yelp came in less than 30 minutes."], "author": "Ri R.", "review": "Damn, fav new Indian restaurant! Everything is fresh -- not greasy or heavy at all. I hot the saag paneer, lamb saag, surender curry, garlic naan and veggie pakoras. All of it was amazing! Pakoras light and fresh, naan wasn't dense at all. The mains were all delicious! Bonus, delivery through Yelp came in less than 30 minutes.", "rating": 5, "date": "2018-07-06"}], "lamb coconut curry": [], "tandoori chicken": [{"excerpts": ["I decided to go for the reasonably priced $11.95 Tandoori Chicken Lunch Special  because it was dark meat only, definitely my preference. ", "It certainly came with a lot of extras which in heftier days would have been a plus ", "but now just seemed more like a carbalooza. ", "Then came the tandoori chicken leg and thigh, a medium-size portion though a bit over cooked as it lay sitting on a bed of sautéed white onions ", "(photo: http://bit.ly/2tBGtLT). ", "This came with a cup of dal (photo: ", "http://bit.ly/2KqiRnf). ", "But wait, there was more. "], "author": "Ed U.", "review": "You probably know already that the Mission is home to a number of appetizing Indian eateries that run the gamut from modern street cart to more traditional fare. Places like Deccan Spice (review: http://bit.ly/2IvTrj2), Ritu (formerly DUM) Indian Soul Food (review: http://bit.ly/2Mx1i1Z), and Aslam's Rasoi (review: http://bit.ly/2tAeImW) impress with their diverse executions and tasty results. I came here for a quiet lunch after perusing appliances at Cherin's nearby and honestly didn't think Lotus SF was quite in the memorable category.\n\nThey have all the expected dishes on their menu - curries, biriyani, naans, tandoori - and they offer lunch specials worthy of attention. I decided to go for the reasonably priced $11.95 Tandoori Chicken Lunch Special  because it was dark meat only, definitely my preference. It certainly came with a lot of extras which in heftier days would have been a plus but now just seemed more like a carbalooza. First came a basket of naan that was enough for a family of four, none of whom could afford to be anorexic (photo: http://bit.ly/2yMAXv9).\n\nThen came the tandoori chicken leg and thigh, a medium-size portion though a bit over cooked as it lay sitting on a bed of sautéed white onions (photo: http://bit.ly/2tBGtLT). This came with a cup of dal (photo: http://bit.ly/2KqiRnf). But wait, there was more. On another plate were a salad, a big helping of basmati rice, and a huge samosa, very crusty from its bath in the fryer (photo: http://bit.ly/2N4hw3K). It was a lot of food, and if you're looking for by-the-numbers execution, this place was as good as any. But portion didn't rule out everything else for me as I felt mixed on the results.\n\nFOOD - 3 stars...lots to eat at lunch but it was light on poultry and way heavy on carbs\nAMBIANCE - 4 stars...the decor was quite nice in a traditional way\nSERVICE - 3.5 stars...very quiet and efficient and a lot of guys on staff at once\nTOTAL - 3 stars...middle-of-the-road Indian food in a 'hood with a whole lotta strong South Asian choices", "rating": 3, "date": "2018-06-27"}, {"excerpts": ["Took Chicken Tikka Masala, Tandoori Chicken, naans and samosas."], "author": "Elad O.", "review": "Ordered online. Dishes are very small compared to other delivery restaurants. Food is quite bland. Took Chicken Tikka Masala, Tandoori Chicken, naans and samosas.", "rating": 2, "date": "2018-06-02"}, {"excerpts": ["Our favorites are the butter chicken, the tandoori chicken, the baingan bharta and the chili cheese kulcha!"], "author": "Vidya N.", "review": "This place has the best butter chicken (with dark meat!) in town, and everything else is delicious too. They use mostly organic ingredients and everything is on the healthier side. Our favorites are the butter chicken, the tandoori chicken, the baingan bharta and the chili cheese kulcha!", "rating": 5, "date": "2018-05-04"}], "chicken tikka kabob": [], "reshmi kabob": [], "seekh kabob": [], "tandoori prawns": [], "tandoori fish": [{"excerpts": ["The lamb biryani was remarkable; the salmon (Tandoori Fish) was outstanding, and the coconut shrimp was great too.  "], "author": "tom s.", "review": "Absolutely stellar!  Even my fussy Manhattan visitors agreed.  The lamb biryani was remarkable; the salmon (Tandoori Fish) was outstanding, and the coconut shrimp was great too.  Good onion naan!  I can't recommend Lotus SF highly enough.  I'm thrilled to finally have found a REALLY GREAT Indian restaurant.  Bravo!", "rating": 5, "date": "2018-08-14"}], "lamb chops": [{"excerpts": ["The Tikka Masala had wonderful nuttiness to it and the lamb chops were perfectly done. ", "My wife who is a big lamb fan and a chef herself was very pleased. ", "Overall I had half a dozen dishes ", "and I enjoyed them all. ", "Two enthusiastic thumbs up."], "author": "Rattlernxt L.", "review": "The service at Louts was exemplary. They were very nice and took special care of my 4yo son knowing it was late and a tired kid would ruin the dinner party. \n\nAside from service the food was also very good. The Tikka Masala had wonderful nuttiness to it and the lamb chops were perfectly done. My wife who is a big lamb fan and a chef herself was very pleased. Overall I had half a dozen dishes and I enjoyed them all. Two enthusiastic thumbs up.", "rating": 5, "date": "2018-01-14"}, {"excerpts": ["Some of my favorites are navratan korma, butter chicken, aloo gobi, rogan josh and the lamb chops. ", "The service is great and friendly and we've never had to wait for a table! ", "Takeout is also quick and easy."], "author": "Danielle C.", "review": "I've tried half the menu and everything is amazing! Some of my favorites are navratan korma, butter chicken, aloo gobi, rogan josh and the lamb chops. The service is great and friendly and we've never had to wait for a table! Takeout is also quick and easy.", "rating": 5, "date": "2018-08-08"}], "pesto paneer kabob": [], "vegan biryani": [], "vegetarian biryani": [], "chicken biryani": [], "lamb biryani": [{"excerpts": ["The lamb biryani was remarkable; the salmon (Tandoori Fish) was outstanding, and the coconut shrimp was great too.  "], "author": "tom s.", "review": "Absolutely stellar!  Even my fussy Manhattan visitors agreed.  The lamb biryani was remarkable; the salmon (Tandoori Fish) was outstanding, and the coconut shrimp was great too.  Good onion naan!  I can't recommend Lotus SF highly enough.  I'm thrilled to finally have found a REALLY GREAT Indian restaurant.  Bravo!", "rating": 5, "date": "2018-08-14"}, {"excerpts": ["My partner really enjoyed the lamb biryani and a chai tea. ", "The service was excellent, and the prices were great considering the high quality of the food and service. ", "We would definitely come back!"], "author": "S E.", "review": "So glad we tried this new spot! As someone who eats a mostly vegan/plant based diet, I appreciate that they were up front about wanting to appeal to different dietary needs. I had the vegetarian curry which was delicious. Lots of different veggies and they were cooked very well - not overly mushy or greasy like at some places. My partner really enjoyed the lamb biryani and a chai tea. The service was excellent, and the prices were great considering the high quality of the food and service. We would definitely come back!", "rating": 5, "date": "2018-01-21"}], "prawn biryani": [], "kheer": [], "gulab jamun": [{"excerpts": ["Delicious lamb, delicious naan, delicious gulab jamun, ", "delicious sweet lassi... "], "author": "B C.", "review": "Sooo good! The decor is lovely, and the food is even lovelier.\n\nIt was quite quiet when I went with my family. I did feel bad because I get anxious when places like this don't get the attention they deserve.\n\nDelicious lamb, delicious naan, delicious gulab jamun, delicious sweet lassi... Everything was so good!\n\nedit: Oh! I also love that they called out their environmental and charitable work.", "rating": 5, "date": "2018-04-01"}, {"excerpts": ["Chicken Pakoras and Vegetable Samosas are too, as well as the dessert Gulab Jamun! ", "It's honestly like fine dining status, but a fraction of the cost and again, the service is sooooo nice and friendly. ", "I hope they continue to serve us their amazing food for decades to come! ", "If you're like me who supports your neighborhood mom and pop shops, this is absolutely fantastic and you'll love it", "-I guarantee!!! "], "author": "Bridgette P.", "review": "Absolutely delicious and adorable new Indian hot spot in the heart of the Mission!!! I totally go for new and up in coming neighborhood restaurants! This is adorable, cozy, romantically and beautifully decorated. A bit chic too to be honest! Great atmosphere, but above all, amazing service and DELICIOUS FOOD!!! I definitely recommend this place! Their Butter Chicken Masala and Paneer Tikka Masala is to die for!!! Their starters- Chicken Pakoras and Vegetable Samosas are too, as well as the dessert Gulab Jamun! It's honestly like fine dining status, but a fraction of the cost and again, the service is sooooo nice and friendly. I hope they continue to serve us their amazing food for decades to come! If you're like me who supports your neighborhood mom and pop shops, this is absolutely fantastic and you'll love it-I guarantee!!! It's better than those \"hot and trendy restaurants\" that already have a tremendous amount of success. \n\n\nThank you Lotus for your humble and kind service and delicious and memorable dishes!!! We'll definitely be back and spread the word to all our friends and colleagues! By the way, Amit and Binod were our servers and they were SO kind and super attentive and professional! THANK YOU!!! :)", "rating": 5, "date": "2018-01-20"}], "indian ice cream": [], "kulfi": [], "basmati rice": [{"excerpts": ["On another plate were a salad, a big helping of basmati rice, and a huge samosa, very crusty from its bath in the fryer ", "(photo: http://bit.ly/2N4hw3K). ", "It was a lot of food, and if you're looking for by-the-numbers execution, this place was as good as any. "], "author": "Ed U.", "review": "You probably know already that the Mission is home to a number of appetizing Indian eateries that run the gamut from modern street cart to more traditional fare. Places like Deccan Spice (review: http://bit.ly/2IvTrj2), Ritu (formerly DUM) Indian Soul Food (review: http://bit.ly/2Mx1i1Z), and Aslam's Rasoi (review: http://bit.ly/2tAeImW) impress with their diverse executions and tasty results. I came here for a quiet lunch after perusing appliances at Cherin's nearby and honestly didn't think Lotus SF was quite in the memorable category.\n\nThey have all the expected dishes on their menu - curries, biriyani, naans, tandoori - and they offer lunch specials worthy of attention. I decided to go for the reasonably priced $11.95 Tandoori Chicken Lunch Special  because it was dark meat only, definitely my preference. It certainly came with a lot of extras which in heftier days would have been a plus but now just seemed more like a carbalooza. First came a basket of naan that was enough for a family of four, none of whom could afford to be anorexic (photo: http://bit.ly/2yMAXv9).\n\nThen came the tandoori chicken leg and thigh, a medium-size portion though a bit over cooked as it lay sitting on a bed of sautéed white onions (photo: http://bit.ly/2tBGtLT). This came with a cup of dal (photo: http://bit.ly/2KqiRnf). But wait, there was more. On another plate were a salad, a big helping of basmati rice, and a huge samosa, very crusty from its bath in the fryer (photo: http://bit.ly/2N4hw3K). It was a lot of food, and if you're looking for by-the-numbers execution, this place was as good as any. But portion didn't rule out everything else for me as I felt mixed on the results.\n\nFOOD - 3 stars...lots to eat at lunch but it was light on poultry and way heavy on carbs\nAMBIANCE - 4 stars...the decor was quite nice in a traditional way\nSERVICE - 3.5 stars...very quiet and efficient and a lot of guys on staff at once\nTOTAL - 3 stars...middle-of-the-road Indian food in a 'hood with a whole lotta strong South Asian choices", "rating": 3, "date": "2018-06-27"}, {"excerpts": ["We chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. ", "We were NOT disappointed. ", "The food came out fast and filled our noses with the most delightful smells. ", "It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. ", "Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. ", "Server was super attentive with water and checking in on us. "], "author": "Heather C.", "review": "My BF was feeling a bit under the weather and we just did a full week of going vegetarian, so I perused for the best \"Vegetarian \" near me. Indian popped up as a top cuisine so I thought a quick walk to the Naan & Curry on 3rd & King would work. Then, I came across Lotus SF. Lots of stars and rave reviews. \n\nHopped in the car and headed towards the Mission at 8:30pm on a Thursday. Normally, parking is tough to find based on the time and day of week, but was plentiful and to our surprise. \n\nThe exterior is clean with big windows showing you these beautiful upholstered chairs and tables ready for you inside. A white stone elephant greets you next to the front door, as does a smiling server upon entry. We were surprised, and for a quiet night, we chose a window seat and was equally thrilled at seeing the deliciousness inside their menu.\n\nWe chose garlic naan, basmati rice, palak paneer and a organic chicken coconut curry (extra $1.50 for organic chicken), a cup of mango lassi and Sonoma Zinfandel. We were NOT disappointed. The food came out fast and filled our noses with the most delightful smells. It was beyond what we expected and I can easily say that their food is by far the best I've tasted in SF. Granted, this is based on ordering 4 dishes, but you can be damn sure I'll be back to try everything else on their menu moving forward. Server was super attentive with water and checking in on us. (Yay!)\n\nBut this review isn't just about the restaurant, food and service. While we waited for our food, a less fortunate man came in and was looking to dine. After listening to him talk, it was clear he was not sober; the service from the staff was heartwarming. After informing him they couldn't serve him, they sat and listened to him talk. About nothing and everything. My BF and I felt bad, so we asked the server to get him a soda and some food, and put it on our tab. The server went in the kitchen and came back with a box of chicken, rice and water. The gentleman thanked him and left. The server came over and thanked us for our generosity and said it was his duty to take care of the community they were in, but more importantly the patrons inside that supported them. Wow, human kindness DOES exist. I was touched. This made me appreciate the restaurant even more, and all happened before we got our food.\n\nI salute the server, restaurant and what it stands for. Love does conquer all, so get your ass out to Lotus SF and enjoy their savory and perfectly spiced dishes!!!!\n\nPS. You'll find a little surprise on the front of the menu re: Togo orders :) Happy eating!!!", "rating": 5, "date": "2018-02-16"}, {"excerpts": ["First time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). ", "I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. ", "I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\n", "ALL THIS for $12 (plus a generous tip, which they so richly deserve)!\n"], "author": "Patricia K.", "review": "THIS IS THE REAL DEAL.\nGreeting the customer with what looks like marble Ganeshas outside and big, brass ones inside, LOTUS SF continues with the theme of high quality and fine Indian art, from the fine paintings (including masterpieces of the Persian-influenced era) and a unique 3-D wood portrait (suggestive of the style of Yaacov Agam) of Indian Independence hero Kartar Singh Sarabha, to the fantastic floors (dramatic and sweeping marble-inlaid designs in bright blues, golds, and a variety of other colors and patterns--different for each section of the restaurant, and gorgeous faux-wood tile flooring in the bathrooms, which sparkle with cleanliness and chrome fixtures, and white-on-white, fine-geometric-patterned, fresco-like tile walls). \nAnd then there's lunch, all served on cloth tablecloths in beautiful, intricately patterned white-on-white china (made in Thailand) by charming staff from India and/or Nepal--while authentic Indian classical music plays in the background.\nFirst time out, I had an extremely generous portion of the magnificent dal makhni (requesting 'medium spicy'), which came with sides of white basmati rice (every grain perfect) garnished with saffron and peas, a salad of field greens (if you want dressing, ask), a lovely, big, fat samosa (potato & peas), and a basket of exceptionally fresh, fragrant and tasty naan (they offer a variety of breads & flavors and gluten-free naan, too). I nearly broke out in Hallelujahs when I discovered that they did NOT sweeten their chai. I took home leftovers in the box they so graciously provided, as even I couldn't eat so much food in one sitting.\nALL THIS for $12 (plus a generous tip, which they so richly deserve)!\nOf course, there were other vegetarian options at that price (next time, I'll try the chana masala) as well as meat dishes (chicken, lamb) and fish & seafood (for about $1 to $4 more). I did not explore desserts (but will try the gulab jamon). This is the real deal in Northern Indian cuisine and ambience. (I bet that was the owner I saw standing by.) I can hardly wait to go back for more!", "rating": 5, "date": "2018-03-11"}], "eco friendly brown rice": [], "indian raita": [], "indian mango chutney": [], "indian pickle": [], "prawn saagwala": [], "tandoori prawn masala": [], "prawn coconut curry": [{"excerpts": ["And the prawn coconut curry. "], "author": "Mckall E.", "review": "Best Indian I've had in San Francisco! \nAmazing friendly staff.\nWe got the chicken tikka masala \nAnd the prawn coconut curry. With the pesto naan. Holy shit. It's the best meal me and my fiancé have had in months. \nYou MUST COME TRY IT!", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["We tried the Chicken Tikka Masala and Prawn Coconut Curry. "], "author": "Esther K.", "review": "Our first stop last weekend in SF, and it was a great experience! Service was wonderful, and the food was delicious. We tried the Chicken Tikka Masala and Prawn Coconut Curry. Both were so flavorful and went perfectly with their warm and fluffy naan. I already miss this place!", "rating": 4, "date": "2018-03-28"}], "fish tikka masala": [{"excerpts": ["My boyfriend ordered brown rice, fish tikka masala, and naan. ", "He said his fish tikka masala was delicious. ", "Overall, we really enjoyed our food. "], "author": "Tanya D.", "review": "Wow just wow. This place was perfect.\n\nMy boyfriend and I arrived at this place 9ish. So the place was not busy whatsoever. When we arrived we were quickly greeted and sat down.\n\nFood: I ordered the Chapati and Bengan Bharta. The Bengan bharta was not vegan so I asked the server if he could make it vegan and he said yes. When I got my food, I was extremely excited to try it because it looked so delicious! I first tried it with my chapati bread and it was so delicious. I definitely loved the spices with the eggplant. The flavor was so exceptional! I also tried it with brown rice and again amazed because it genuinely tasted that good to me. I'm definitely glad I ordered the Benga Bertha! \nMy boyfriend ordered brown rice, fish tikka masala, and naan. He said his fish tikka masala was delicious. Overall, we really enjoyed our food. It was definitely a 5/5 for me!  \n\nService: From the beginning and end of our meal the service was spot on. Everyone was so helpful and kind. Especially when I asked for my dishes to be veganised. The servers were extremely spot on with the timing on asking us if we needed anything. It's such a small aspect but I really enjoy when they wait for all the food to be cooked and then serving it to us. Such a great experience with customer service!\n\nThe atmosphere of the place was quite relaxing! The decor and the look of the place was pleasing. Additionally, the whole restaurant is really clean!\n\nI definitely recommend this place because the food is just very delicious, the place is clean, and the customer service is spot on. It's quite difficult to impress me but this place definitely did :)", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["Favorite dishes include the fish tikka masala, Saag paneer, lamb biriani and the naan. ", "Go here for lunch - they need the business then."], "author": "f f.", "review": "I love this restaurant. The food is delicious and presented beautifully. The atmosphere is lush with color and romantically lit. And the servers are warm, efficient and knowledgeable. This place used to be occupied by a flooring store so there is Variety of lovely \"sample\" floors in different areas of the restaurant.  Favorite dishes include the fish tikka masala, Saag paneer, lamb biriani and the naan. Go here for lunch - they need the business then.", "rating": 5, "date": "2018-09-10"}]}