{"coney island clam chowder red": [], "chili with beans": [], "spinach salad seasonal": [], "shrimp louis salad": [{"excerpts": ["They didn't have that, but they did have a large shrimp louis salad, with sourdough bread on the side.  ", "That and a Coke satisfied me that day.  ", "The shrimp was tender, tasty, cooked just right.  ", "The louis dressing was served on the side, but I poured the whole thing on my salad.  ", "Margaret had a house salad, which she said was delicious, deep-fried shrimp, which I verified were delicious, french fries, and mineral water.   "], "author": "David D.", "review": "It was a cold, windy Saturday, a typical summer day in San Francisco.  I wanted to feel more cheerful, and I thought of lunch at Louis'.  We walked up Ocean Beach to get there, and enjoyed looking at the rolling surf.  There's nothing more calming than an hour or two watching the ocean, no matter what state it's in.  We stepped into Louis' and found the place half empty.  This was 4:30 pm on Saturday in the summer!  We were seated in ten minutes, at a table in one of the large picture windows that wrap around the whole building.  \n\nI had been picturing a shrimp salad sandwich since I thought of Louis' earlier in the day.  They didn't have that, but they did have a large shrimp louis salad, with sourdough bread on the side.  That and a Coke satisfied me that day.  The shrimp was tender, tasty, cooked just right.  The louis dressing was served on the side, but I poured the whole thing on my salad.  Margaret had a house salad, which she said was delicious, deep-fried shrimp, which I verified were delicious, french fries, and mineral water.   We enjoyed a leisurely meal, watching people explore the ruins of the Sutro Baths below, and watching fishermen on the rocks offshore.  The surf was high, and the waves hitting the rocks splashed above the fishermen's heads.  Lots of birds flew by; it looked like the water between the baths and Seal Rocks was a regular flyway.  There was a lot to watch, and no hurry to leave.  \n\nNothing much seems to have changed here since the place opened in 1937, except maybe the price.  In constant dollars, I wonder if even that has changed.  Our meal cost us $34, plus the tip.  \n\nWhat a great way to spend the day!", "rating": 4, "date": "2006-07-02"}], "hamburger steak  oz": [], "new york steak  oz": [], "hamburger  lb": [], "cheeseburger  lb": [], "bacon cheeseburger  lb": [], "chili burger  lb": [], "lucas chiliburger": [], "french burger  lb": [], "patty melt  lb": [], "veggieburger": [{"excerpts": ["I had a veggieburger. ", "One star is for that, and even that I could make better at home."], "author": "m r.", "review": "Summary: You're paying for the view (which, by the way, you can get by stepping outside, although granted you won't be as warm and comfortable and won't have folks waiting on you.)\n\nWent here with another after walking around Sutro Baths. Looked promising enough, but looks can be deceiving. Not that we were surprised that it was terribly expensive - the location and menu set in the window both speak volumes - but it's just that we were expecting so much more. The service was below average, the food was just okay, and even the view itself made the place seem plastic. Once I sat down and looked around, that's the precise feeling I got from the place: plastic. It's a very pretty establishment offering the standard but attractive diner fare that most people love. If you set it in the middle of Geary instead of teetering on a cliffside, people would never come (but of course, the prices would be a lot cheaper, too.)\n\nI can't blame them for cashing in on what I am sure is a lucrative demographic and location. But at least try a little harder.\n\nI had a veggieburger. One star is for that, and even that I could make better at home.", "rating": 1, "date": "2012-03-31"}], "ny steak  oz": [], "grilled hot dog  lb": [], "french dip with au jus": [], "breast of turkey": [], "sutro": [{"excerpts": ["You can drive down the hill to Ocean Beach, walk across the street to Sutro Heights Park or walk down the side of the hill to walk around the ruins of Sutro Bath. ", "Have your smartphone or camera ready as there will be many great photo opportunities. "], "author": "Afshin A.", "review": "A San Francisco Original!\n\nLouis' Restaurant opened on Sunday, February 14, 1937, but there is a lot of Louis' history that pre and proceeded that Sunday, so I do encourage to read about it on their website if you have a couple of minutes.\n\nThe menu is what you might call a classic Diner menu, but the food is good. I have been there mostly for breakfast but also have tried their burgers and New Steak a couple of time and always walked out as happy as clam at high tide!  On this particular visit I had the Hamburger Patty and Eggs. Loved it! I might order it with French Fries next time. \n\nOur server was wonderful and the view is fantastic! \n\nThe location of the restaurant is perfect if you enjoy a walk after your meal. You can drive down the hill to Ocean Beach, walk across the street to Sutro Heights Park or walk down the side of the hill to walk around the ruins of Sutro Bath. Have your smartphone or camera ready as there will be many great photo opportunities. This entire area is very scenic. \n\nOh, and did I mention that the coffee is good too?!", "rating": 3, "date": "2018-09-20"}, {"excerpts": ["I suggest passing up on this place and just bringing food to eat on the top of the sutro baths."], "author": "Stephen P.", "review": "Two stars for the view!\n\nWatered down coffee. Disgruntled waiters. Questionable cleanliness.\n \nI'm pretty sure I saw some fries drop on the counter and the waitress put them back on the plate.\n\nI suggest passing up on this place and just bringing food to eat on the top of the sutro baths.", "rating": 2, "date": "2018-08-27"}, {"excerpts": ["Pros\n* very beautiful view of Sutro Baths! ", "They'll seat you in the next available window seat if you ask \n"], "author": "Angella G.", "review": "Just for reference - this place is cash only. If you need a breather or down time, grab a coffee or tea and enjoy the view. \n\nPros\n* very beautiful view of Sutro Baths! They'll seat you in the next available window seat if you ask \n* the host was very friendly and attentive to us. \n\nCons\n* I'd have to agree with other Yelpers that the service is pretty terrible. \n* I didn't get my coffee until the end of my meal\n* I ordered the clam chowder and it was bathed in tomato sauce. I feel like they serve it because if it were regular clam chowder, it wouldn't be tasty at all\n* our server looked like he didn't like his job", "rating": 2, "date": "2018-03-18"}, {"excerpts": ["The Sutro Baths and oceanfront views were pretty. ", "But we lucked out...", "we saw, off in the distance, whales spouting and breaching.  ", "Glorious to behold. ", "What a way to enjoy our meal! ", "Plus the service was great. ", "Leslie was terrific. ", "The weeknight we dined here, she was the sole waitress and host.  ", "She was doing it all and very well. "], "author": "Lillian W.", "review": "Awesome views. The Sutro Baths and oceanfront views were pretty. But we lucked out...we saw, off in the distance, whales spouting and breaching.  Glorious to behold. What a way to enjoy our meal! Plus the service was great. Leslie was terrific. The weeknight we dined here, she was the sole waitress and host.  She was doing it all and very well. So personable.\n\nThe food however is basic diner fare, nothing fancy schmazy or innovative.  Not terrible though. However if you want fresh organic farm to fork cuisine...this ain't it.  The pricing was SF diner pricing, not outrageous.   Plus it was very clean inside.  Up to date decor. \n\nI had a cup of minestrone, that came with sourdough sandwich slices n butter, and a side salad. The Mister had fish n chips.  The soup was tasty.  The fish n fries tasted store bought, like I can pullout of the freezer n heat up at home...but I'm not at home, I'm at Luis' watching whales live and not on the Nature channel. Also during my visit, the unisex bathroom went kaput...they were sending folks to the Cliffhouse restaurant. I had to make that journey and come back during my meal.  Oh well...stuff happens. \n\nFamily owned since 1937. Pretty neat!  Cash only but don't fret they have an ATM inside.", "rating": 4, "date": "2017-08-05"}, {"excerpts": ["It overlooks Ocean Beach and Sutro Baths, once a famous bathhouse in the early 1900's until it burned down from a huge fire in 1966. ", "Fun fact"], "author": "Bryan W.", "review": "I've been to Louis' twice in my few years living in the Bay Area and I have to say that dining at this restaurant is one of those experiences you should try once in your life - especially if you enjoy comfort food and views.\n\nA little background on Louis': this family owned restaurant has been here in the exact spot since 1937, when it opened on Valentine's Day. It overlooks Ocean Beach and Sutro Baths, once a famous bathhouse in the early 1900's until it burned down from a huge fire in 1966. Fun fact: there's a picture on the window at Louis' which shows what the bath house looked like back in the day!\n\nThe restaurant itself sells pure American food. From around morning til 2pm, you will have your assortment of brunch items that include popular items such as Eggs Benedict and pancakes. Afterwards you have lunch items ranging from sandwiches to burgers. \n\nThe first time I arrived at Louis', both my friend and I were spellbound by the amazing experience you get at the restaurant. Most of you have probably heard about Cliff House, that high profile, super expensive restaurant overlooking Ocean Beach. Yep, that's right next door to Louis'. As an alternative, if you just want good views with decent food, Louis' is where it's at: the restaurant is small, but it's completely surrounded by windows overlooking the beach. Even though crowds can be huge (get here before noon), definitely wait until a spot opens up right next to the windows. The experience is WORTH THE WAIT. \n\nI highly recommend you come for the brunch. My friend and I made it in time to get their Eggs Benedict with a few pancakes on the side and I thought they were great! The food wasn't too pricey and the portion sizes are enough to satisfy you. I really enjoy the service was well; generally, family owned restaurants have amazing service and Louis' is no different. \n\nIn contrast, I thought the lunch items could have been better. The second time I went to Louis', we got some clam chowder to split, my friend got the tuna melt, and I got the steak sandwich. First impressions overall was that the clam chowder was good (not too chunky and its red not white), the tuna melt was extraordinary, but the steak was pretty mediocre. The bread was a bit too hard and the steak needed more juice. That said, for the price you can't go wrong.\n\nOverall, I would come to Louis' purely for the view. The food here is great, but it's not going to be Cliff House quality or some great brunch food. You'll be satisfied, but more often than not the feeling of being next to the water without paying $$ transcends the desire for amazing lunch. \n\nEat well and prosper,", "rating": 4, "date": "2017-01-24"}, {"excerpts": ["The view of the Sutro bath ruines are amazing. ", "The food is standard diner fair so predictable."], "author": "Leung T.", "review": "Amazing views / Okay food.  We've been here 1/2 dozen times either for Sunday brunch or when we have visitors & we wanted to show a slightly different part of SF.  The view of the Sutro bath ruines are amazing. The food is standard diner fair so predictable.", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["Pacific ocean views, sutro baths and lands end.  "], "author": "Fannie S.", "review": "So I haven't been here for almost a decade, and they've renovated since then (in 2011).  It looks great. \n\nFood = good. Is it the best food ever? No. Is it good diner food? Yes, and it fills a void that most of us crave but don't realize.\n\nEggs benedict (ham, they also have one with bacon or veggies, poached eggs and hollandaise over english muffin) served with potatoes = delicious and hearty portion.  The potatoes were perfectly cooked (no one wants soggy ones!) $14.50.\n\nOmelette with bacon served with potatoes = $12.25\n\nChicken apple sausage = meh. Not sure but they tasted odd. Ended up leaving them. $5.95.  \n\nChili = meh. Says homemade but it tasted like canned chili. Served with sourdough bread and butter. The sourdough was awesome (Boudin's sour, soft and addicting.) Cup for $6.50. \n\nCoffee = $2.95 x2.\n\nPrices = Breakfast for two came out to $48.93.\n\nService = friendly. :) They don't hustle you out but this place does fill up fast. And they will come around and refill your drinks. \n\nViews = epic. Pacific ocean views, sutro baths and lands end.  The corner booth in the back has the best view, but some people like the corner booth with the double windows (we prefer to see more view and less tourists lol)\n\nIf you can hit this place up before the lunch rush...then you're in luck, especially during the weekdays. \n\nParking = street parking.  There is a lot nearby but we saw a ton of broken auto glass...so we didn't risk it. \n\nSupport your local businesses.  Established in 1937.  Yes, 80 years!", "rating": 3, "date": "2017-05-17"}, {"excerpts": ["The last few times I have been not overly impressed with the food but the view makes up for any missteps there- Overlooking the Sutro Baths and the Pacific Ocean? ", "Ya count me in-\n", "They accept cash only but have an ATM if you forget to bring some with you!"], "author": "Tiffany S.", "review": "You come to Louis for the view- hands down. I had an omelette yesterday that was quite tasty. I got onion, mushroom, feta (they threw in spinach too- thank you!) The last few times I have been not overly impressed with the food but the view makes up for any missteps there- Overlooking the Sutro Baths and the Pacific Ocean? Ya count me in-\nThey accept cash only but have an ATM if you forget to bring some with you!", "rating": 4, "date": "2018-01-18"}, {"excerpts": ["We came upon this gem during our walk by Sutro Baths. ", "We were seated right away and had a beautiful view of the ocean. ", "I got the fish and chips with clam chowder and washed it down with a strawberry milkshake. ", "Totally hit the spot with friendly service and a restaurant with an interesting history (details on the menu)."], "author": "Lena Y.", "review": "We came upon this gem during our walk by Sutro Baths. We were seated right away and had a beautiful view of the ocean. I got the fish and chips with clam chowder and washed it down with a strawberry milkshake. Totally hit the spot with friendly service and a restaurant with an interesting history (details on the menu).", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["It's pretty cool to sit next to Sutro Baths on a n early sunday morning and not feel like you have to pay the premium price for breakfast/brunch in the city. ", "They have classic breakfast here, but all of the food is very hearty and you can tell that it is made with a lot of care. ", "The staff is AMAZING and I overheard that there are three generations of women working there! ", "Wow!! ", "You don't hear that everyday in SF, which is a pretty amazing feat to say the least :)"], "author": "Micah L.", "review": "Such a cute little dive bar right on the edge of SF. It's pretty cool to sit next to Sutro Baths on a n early sunday morning and not feel like you have to pay the premium price for breakfast/brunch in the city. They have classic breakfast here, but all of the food is very hearty and you can tell that it is made with a lot of care. The staff is AMAZING and I overheard that there are three generations of women working there! Wow!! You don't hear that everyday in SF, which is a pretty amazing feat to say the least :)", "rating": 4, "date": "2017-09-25"}, {"excerpts": ["Now, back to that breathtaking view of Seal Rock, Sutro Baths and out to the vast expanses of the sea. ", "So if you don't want to splurge on the nearby Cliff House but want to get some views worth contemplating, this place will fit the bill."], "author": "Carole B.", "review": "The view is the main attraction here. For the most part, the food is mediocre at best and your safest strategy is to order standard breakfast fare like pancakes. \n\nNow, back to that breathtaking view of Seal Rock, Sutro Baths and out to the vast expanses of the sea. So if you don't want to splurge on the nearby Cliff House but want to get some views worth contemplating, this place will fit the bill.", "rating": 2, "date": "2016-12-05"}, {"excerpts": ["The view from most tables is very interesting, you can see both the ocean and the ruins of the Sutro Baths. ", "Our waiter was attentive and efficient, he even brewed a fresh pot of decaf coffee for us. ", "The guys ordered cheeseburgers, I ordered a BLT. ", "The food was crummy, bacon nearly burned and cold, the lettuce and tomato on stale toasted bread. ", "Too bad cause it has so much potential- and be warned-cash only! ", "Who does that anymore?"], "author": "Marie B.", "review": "The view from most tables is very interesting, you can see both the ocean and the ruins of the Sutro Baths. Our waiter was attentive and efficient, he even brewed a fresh pot of decaf coffee for us. The guys ordered cheeseburgers, I ordered a BLT. The food was crummy, bacon nearly burned and cold, the lettuce and tomato on stale toasted bread. Too bad cause it has so much potential- and be warned-cash only! Who does that anymore?", "rating": 2, "date": "2017-12-22"}, {"excerpts": ["He remembered looking out the window at the awesome Sutro bathes and thought that'd be cool to see our kids do the same. \n\n"], "author": "Liz N.", "review": "Service 4 stars! \nView 10 stars!!!\nBut the food was a different story. \n\nMy husband wanted to relive a childhood memory cause he had told our kids his Mom took him here when he was a child. He remembered looking out the window at the awesome Sutro bathes and thought that'd be cool to see our kids do the same. \n\nOnto the food. The food was subpar. French toast was made from plain sliced bread. Nothing special. My son ordered the fish and chips for $16.75. It looks to be from the store bought freezer not made in house(?) my hubby had the Benedict, ehhh. I didn't even bother trying it. I was eating w my eyes and it wasn't appealing. Breakfaat for 4 (w no drinks) was $59. This view doesn't come cheap.", "rating": 2, "date": "2015-06-03"}, {"excerpts": ["We also took a short walk around the former Sutro Baths area. \n\n"], "author": "Lisa K.", "review": "My mother and I went here for lunch after visiting the Legion of Honor. We also took a short walk around the former Sutro Baths area. \n\nDon't come here expecting a grand place, it is a diner. The view is marvelous though. \n\nMy mother had the minestrone soup, and while it didn't look great, she said it was delicious. It came with some bread and butter. Unfortunately I didn't get a picture of it, but other reviews show pictures, and they are accurate. \n\nI had the French dip sandwich. I have a weakness for it, so when I see it on the menu at a restaurant I haven't been to before, I order it. This one was pretty good. In fact, I absolutely loved the bread. Thick and crusty and chewy, my favorite. The only thing that would have made it better would be some Swiss cheese. I would come here again just for the sandwich. The plate came with fries, but they were okay. If it wasn't so busy, I would have sent them back to be cooked a little more. They looked good, but weren't really crispy in the outside. \n\nAll in all, I would come here again. The service was great, the food was good, and the view was marvelous.", "rating": 5, "date": "2016-09-10"}, {"excerpts": ["On our last day in San Fran we knew we wanted to go see the Sutro Baths and Lands End Lookout. ", "On our way our uber driver mentioned there was a really nice restaurant near there. ", "Well we looked over at Louis' and loved how small and quaint it was. ", "Like a little diner with an amazing view of the pacific! ", "I ordered the bacon and cheddar omelette which came with an English muffin and some potato fries. ", "So delicious! ", "Totally worth it & not too expensive at all. ", "However be sure to have cash because that's all they accept."], "author": "Carmen H.", "review": "On our last day in San Fran we knew we wanted to go see the Sutro Baths and Lands End Lookout. On our way our uber driver mentioned there was a really nice restaurant near there. Well we looked over at Louis' and loved how small and quaint it was. Like a little diner with an amazing view of the pacific! I ordered the bacon and cheddar omelette which came with an English muffin and some potato fries. So delicious! Totally worth it & not too expensive at all. However be sure to have cash because that's all they accept.", "rating": 5, "date": "2017-11-20"}, {"excerpts": ["Plus the fact that we were seated overlooking sutro baths, it was breathtaking for me. ", "Surprised that this place doesn't garner much review. ", "Would love to eat here again."], "author": "Carla C.", "review": "the view, the food, the service , 5stars. We had eggs ben & the tuna sandwich. It\nWas really good. Loved the rye bread. Plus the fact that we were seated overlooking sutro baths, it was breathtaking for me. Surprised that this place doesn't garner much review. Would love to eat here again.", "rating": 4, "date": "2015-03-09"}, {"excerpts": ["Great venue with a view of the sutro baths and the pacific! "], "author": "Tristin B.", "review": "Came here right after I finished the land's end hike.\n\nGreat venue with a view of the sutro baths and the pacific! The coffee is great and so is the pie (with ice cream) and the customer service. I totally recommend this place, especially on a cold day.", "rating": 5, "date": "2016-05-07"}, {"excerpts": ["I enjoyed Land's End And the Sutro Baths after Ocean Beach. ", "That's gotta be worth something. ", "And, if you have ever worked for tips, you know cash is king. ", "Friendly, helpful staff. ", "Great view. ", "Quick service. ", "People are friendly here this time of year"], "author": "The Adv G.", "review": "Each time I eat here everyone working is working diligently. Breakfast with a waffle that is made expertly is my usual selection. The cash requirement may catch some off guard. Considering the location, I don't mind paying a premium. Remember, parking is easy in the morning and free all day. That alone afords the price difference in San Francisco (the Financial District and Fisherman's Wharf can exceed $12 an hour). I enjoyed Land's End And the Sutro Baths after Ocean Beach. That's gotta be worth something. And, if you have ever worked for tips, you know cash is king. Friendly, helpful staff. Great view. Quick service. People are friendly here this time of year", "rating": 5, "date": "2016-09-06"}, {"excerpts": ["Everything at this place is average at best (variety on menu, food quality), except for its view of the Pacific Ocean and the Sutro Baths. ", "The service also left a lot to be desired today. ", "I came with my friend and her 3-year-old daughter, and not only was her child not offered a high seat when we saw other kids bigger than her getting them, but she also wasn't offered any coloring paper or crayons like the other kids were."], "author": "Yvonne W.", "review": "Everything at this place is average at best (variety on menu, food quality), except for its view of the Pacific Ocean and the Sutro Baths. The service also left a lot to be desired today. I came with my friend and her 3-year-old daughter, and not only was her child not offered a high seat when we saw other kids bigger than her getting them, but she also wasn't offered any coloring paper or crayons like the other kids were.", "rating": 2, "date": "2017-01-28"}, {"excerpts": ["Sadly outside of the amazing view overlooking the Pacific and the Sutro Baths this place has very little to offer.\n\n"], "author": "Steve M.", "review": "Came here after hearing great things about this place and seeing lines flowing out the door over the weekend.  Sadly outside of the amazing view overlooking the Pacific and the Sutro Baths this place has very little to offer.\n\nWe ordered fried prawns, a cup of the Coney Island clam chowder and a burger.  With the fried prawns the portion size was small with only 7 below average sized prawns.  The prawns had a good crunch on them but were not fresh. The burger was below average it tasted like the ground beef was not seasoned at all.\n\nThe best part of the meal was the Clam Chowder. It was seasoned well, not too salty and not overpowered by the acid of the tomato base which are common problems in a lot of Manhatten style clam chowders.  While the base was good, like the prawns the seafood in it was not fresh.\n\nThe place is cash only which is unacceptable for a sit down restaurant in silicon valley in 2016.  If I can buy fresh produce at a farmers market with my credit card then there is no excuse for why I shouldn't be able to do the same here.\n\nTo me this place is nothing more than a below average diner that has a great location.  They exploit the view they can offer by serving small portions of below average food at an insane markup.", "rating": 1, "date": "2016-06-15"}, {"excerpts": ["It was an overcast morning however the view of the Sutro baths was very nice. ", "Food is average diner fare, freshly made. ", "Cash only accepted however they have an ATM. ", "Service was great, we would return as the view was great and conveniently located near trails."], "author": "Damaris F.", "review": "Lovely lunch on a Friday. No crowds and seated right away. It was an overcast morning however the view of the Sutro baths was very nice. Food is average diner fare, freshly made. Cash only accepted however they have an ATM. Service was great, we would return as the view was great and conveniently located near trails.", "rating": 3, "date": "2016-04-08"}, {"excerpts": ["It always makes me a little sad because I use\nto go to Sutro Baths for swimming and also Playland.  \n", "The food is very good and this is the place I recommend to my friends\nwho want to tour San Francisco.\n", "Lots of free parking close by."], "author": "Bob J.", "review": "My favorite SF breakfast restaurant.  The servers are always friendly and efficient.\nOf course, the view is outstanding.  It always makes me a little sad because I use\nto go to Sutro Baths for swimming and also Playland.  \nThe food is very good and this is the place I recommend to my friends\nwho want to tour San Francisco.\nLots of free parking close by.", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["Walking down to Sutro Baths was a nice way to kill some of the time. \n\n"], "author": "Emily J.", "review": "Arrived around 9:45 am on a Sunday and was quoted a 20 minutes wait for four. (Reality was more like 30 minutes.) Walking down to Sutro Baths was a nice way to kill some of the time. \n\nI couldn't resist one of the benedicts. There are three to choose from: classic (ham), Louis' (bacon and tomato) or Veggie. I got the veggie and our server happily swapped out the side of potatoes for sliced tomatoes. The eggs were perfectly poached over an ample amount of grilled onions, mushrooms, tomato...all on top of an english muffin and topped with a decadent hollandaise. Yum. \n\nSure, you could be all fancy and go to the Cliff House...OR you can come here to get a similarly excellent view and delicious food at a more reasonable cost.", "rating": 4, "date": "2014-10-04"}, {"excerpts": ["6.26.66 Louis restaurant was spared by the fire that destroyed the adjacent Sutro \n\n*Grappling for power going on with the National Park over concessions. \n\n"], "author": "Jennifer C P.", "review": "Louis offers three things I love: Breakkies, sweeping views of the ocean, and a great story of how it came to be a special SF mom and pop. \n\nThe lowdown: \n\n* Louis is pronounced Louie\n\n* Louis' Restaurant opened on Sunday, February 14, 1937\n\n* 6.26.66 Louis restaurant was spared by the fire that destroyed the adjacent Sutro \n\n*Grappling for power going on with the National Park over concessions. \n\n*Every seat in the restaurant offers a stunning view. \n\n* Restaurant has been owned and run by generations of family - making this a great old school mom and pop! \n\n* Cash only (pay cash as often as you can when going to mom and pops anyway to avoid making them pay ridiculous credit card blackmail acceptance fees - err, processing fees). \n\n*Restaurant is intimate so keep your big group action to a minimum of 4-6 especially at peak times\n\n*Abundant parking on the street as well as at the lot across the street. \n\nRead more factoids and about the great history: http://www.louissf.com/\n\nI really like Louis. I had a custom white egg scramble and one of each pancake, french toast, and waffle. If you are craving starchy carbs, get the waffles! The coffee was yummy! I was very full and really happy. \n\nService was friendly and unrushed. \n\nPrices are fair. \n\nI am happy to come here again. . . on a weekday to beat the crowds!", "rating": 4, "date": "2012-09-02"}, {"excerpts": ["It's got the most amazing view of the Sutro Baths and the gorgeous Pacific Ocean, it's a historic landmark, and it's family owned.  ", "The place is small, tables are close together with a few counter spaces.  ", "The food is classic diner food (breakfasts, omelets, deli sandwiches, etc) but I've only ever eaten breakfast stuff.  ", "Eggs, omelets, pancakes are good, solid choices.  "], "author": "Heather E.", "review": "Louis' is a favorite stop every time I'm in town.  It's got the most amazing view of the Sutro Baths and the gorgeous Pacific Ocean, it's a historic landmark, and it's family owned.  The place is small, tables are close together with a few counter spaces.  The food is classic diner food (breakfasts, omelets, deli sandwiches, etc) but I've only ever eaten breakfast stuff.  Eggs, omelets, pancakes are good, solid choices.  Food comes out simply and without decoration or garnishing.   \n\nService is good; I don't think it's anything amazing.  If you need special attention or are looking for something fancy or ritzy you're in the wrong place!  The people who work here are kind and local-- if you are nice to them and gracious, they will be good to you.  If you are demanding you probably won't get that coffee refill quite as quickly as you might like.\n\nIt's definitely casual.  Cash only.  No waiting area/lobby, and oftentimes outside is REALLY windy, so be prepared.  Avoid weekends, whenever possible, as this place gets packed.  \n\nRecently, Louis' has taken steps to have higher quality food.  Their website, www.louissf.com says all their meat is antibiotic-free and hormone free.  Their eggs are organic.  Their coffee is certified organic.  Their vegetables are organic whenever possible and are local.  All their bread and desserts are local.  Additionally, they have made efforts to improve recycling (even their leftover cooking oils!) and incorporate recycled material into their renovations.  \n\nI'm headed there tomorrow for breakfast, and I can't wait to see (and taste) the changes.  My local relatives eat there often, so we're friendly with the staff. \n\nA few things they could improve on:  first, I am not a big fan of the breakfast potatoes.  I find them kind of boring.  Also, I wish the coffee cups were larger because I don't like getting all these refills and constantly adjusting the cream/sugar.", "rating": 4, "date": "2015-10-06"}, {"excerpts": ["It was an excellent beginning of my day-trip to the area to check out the Sutro Baths and The Legion of Honor, but I don't think I'd ever go out of my way to just come here. ", "Cash only is also a turn off."], "author": "Ryan H.", "review": "The chili cheese open-face burger was good. The service was fine.\n\nIt was an excellent beginning of my day-trip to the area to check out the Sutro Baths and The Legion of Honor, but I don't think I'd ever go out of my way to just come here. Cash only is also a turn off.", "rating": 3, "date": "2016-01-28"}, {"excerpts": ["Walk the trails down the site of the Sutro Baths and visit the newly constructed  Golden Gate National Recreation Area visitors center. "], "author": "Perry V.", "review": "Louis' food is pathetic. It's a poor reflection on San Francisco's outstanding food reputation. It's location is owned by the GGNRA and sadly its lease was recently renewed. I made the mistake of going to this dive years ago and will never step foot in this joint again. You can get the same Sysco distributed stuff at Denny's for much less.\n\nIf you're visiting San Francisco, go to Ocean Beach and enjoy a leisurely walk on the beach. Walk the trails down the site of the Sutro Baths and visit the newly constructed  Golden Gate National Recreation Area visitors center. Walk the Lands End trail from Fort Miley to Sea Cliff.\n\nLouis' is just a lame old restaurant hanging on to the cliff by a thread. The food here is less than appetizing and way overpriced for the quality provided.", "rating": 1, "date": "2015-01-20"}, {"excerpts": ["The food was OK, but the view of the ocean and the Sutro Ruins was breath-taking.   "], "author": "David S.", "review": "They've just re-opened after a year and a half of remodeling, and we came here for the first time for a Sunday dinner (Aug 14).   Even tho the place was pretty full, we were seated within 5 min. and orders taken right away by pleasant friendly servers.\n\nI had the Louie Salad & sparkling wine and my friend had the chili burger, fries,  and a shake.  (see pics)  The food was OK, but the view of the ocean and the Sutro Ruins was breath-taking.   And I agree with other reviewers that the food is uninspired and probably from cans and frozen products.\n\nAnd they are CASH ONLY.  I'd probably be back if they took credit cards, but \"cash only\" is a deal breaker.  I'd rather walk the 300 steps down the hill over to the Cliffhouse.", "rating": 3, "date": "2011-08-15"}, {"excerpts": ["The view is really good and you can see the Sutro Bath ruins and the ocean.  ", "It is a no frill place, more like a diner."], "author": "R P.", "review": "Shrimp salad ($16) had sweet shrimp and very crisp iceberg lettuce.  The dressing tasted home made.  The french bread was fresh and good. The coffee is great.  The view is really good and you can see the Sutro Bath ruins and the ocean.  It is a no frill place, more like a diner.", "rating": 4, "date": "2017-01-10"}, {"excerpts": ["Loved the view of Ocean Beach and Sutro Heights.  ", "Will definitely have to come back again."], "author": "Rosie M.", "review": "Great food, great service!  My husband and I ate breakfast here before our hike through Lands End to Bakers Beach.  Nice and simple, no wait, and fast easy service.  Most of the staff here were some nice college kids.  Loved the view of Ocean Beach and Sutro Heights.  Will definitely have to come back again.", "rating": 5, "date": "2016-06-13"}, {"excerpts": ["(Came for Sutro Baths). ", "Big mistake. ", "Everything is overpriced. ", "We split a cheeseburger and fries for $9.95 a relative bargain. ", "It came out looking like something I could get at Wendy's for $1.49. ", "Skimpy on the condiments. "], "author": "Rachael C.", "review": "Tourist trap. You know it when you see the menu\n\nWe were hungry., We should have had breakfast before we went to Muir Woods\n\nInstead we went here after our hike (Came for Sutro Baths). Big mistake. Everything is overpriced. We split a cheeseburger and fries for $9.95 a relative bargain. It came out looking like something I could get at Wendy's for $1.49. Skimpy on the condiments. Crinkle fries from a bag. \n\nWant a view? Look around, you don't need to eat here. My advice. Eat somewhere else first and skip this forgettable spot\n\nCASH ONLY", "rating": 2, "date": "2013-04-01"}, {"excerpts": ["Good diner by the sutro baths. ", "The food came fast and was decent. ", "We had the eggs Benedict...nothing special about it just average. ", "The waiters were a little slow...", "we asked for refills about 4 times before we actually had our drinks refilled. "], "author": "Jessica A.", "review": "Good diner by the sutro baths. The food came fast and was decent. We had the eggs Benedict...nothing special about it just average. The waiters were a little slow...we asked for refills about 4 times before we actually had our drinks refilled. The staff just seemed lost and confused.\n\nWould I be back? Sure why not if I'm in the area and don't feel like spending a fortune...the food may be average but the view is spectacular!", "rating": 3, "date": "2015-03-05"}, {"excerpts": ["After breakfast, we often go for a walk at Lands End and what used to be the Sutro Baths."], "author": "Christina M.", "review": "Louis' has simple breakfast food with a beautiful view of Ocean Beach when it's not super foggy. The food is a little overpriced for the quantity. I have been here a few times with friends and family. After breakfast, we often go for a walk at Lands End and what used to be the Sutro Baths.", "rating": 3, "date": "2017-03-01"}, {"excerpts": ["I had the Sutro Sandwich. ", "It was really good ", "I especially liked the Sourdough roll. ", "The portions are huge! ", "I should have split my meal. ", "The wait staff seems to have a workman like attitude towards there service and were not friendly at all. ", "I would come back for the food and view which really are consistent and good. ", "They only take Cash."], "author": "Jeff C.", "review": "The view is Fantastic! The food is good! It is one of the smallest restaurants I've ever been in. Great family vibe. You will probably need to wait to get a table its worth it though. Great comfort food. I had the Sutro Sandwich. It was really good I especially liked the Sourdough roll. The portions are huge! I should have split my meal. The wait staff seems to have a workman like attitude towards there service and were not friendly at all. I would come back for the food and view which really are consistent and good. They only take Cash.", "rating": 4, "date": "2015-02-16"}, {"excerpts": ["Sometimes you'll just see people doing funny and unexpected things out at the Sutro Baths.\n\n"], "author": "Michelle D.", "review": "BRING CASH\n\nCOME EARLY . . . or don't so that we can still get our table.\n\nBy itself, I would probably give Louis' 3 stars, but that's not necessarily a bad thing. The interior looks and feels like a diner -- I personally love diners, so this is a plus. The food tastes like diner food (not horrible Denny's, more real than that!). I'm talking about the kind of diner that families used to stop at when they would take road trips all across the nation, and it gives that kind of nostalgic feel, too.\n\nI've never had a dish that made me go woah. Everything's just decent and satiating. We've tried most of the egg dishes, hamburgers, fish and chips, pancakes.\n\nService is usually great 90% of the time . . . like you would expect from a traditional diner. Am I getting the gist across here?\n\nI do love their coffee. Keep the refills pouring into those small mugs! Maybe it's the mug? I don't know. I like it better than bluebottle and all the other fancy shmancy coffees in SF. Yes, it's not as strong as a lot of their blends, but it's juuuust right every time we go whether you like it black, with milk, or whatever.\n\nAnd that 4th star? The view, of course. Unless it's a blue-sky day, it's always different when we look out and I love that unpredictability. Sometimes you'll see the fog slowly disappear and reveal a gorgeous view. Other times you'll see giant birds up above riding the wind. Sometimes you'll just see people doing funny and unexpected things out at the Sutro Baths.\n\nWe love getting the booth and bringing visiting family and friends to this joint. We've always arrived before any lines early in the morning ~7/8. Pretty easy to find parking.\n\nBest part: everyone leaves happy every time.", "rating": 4, "date": "2014-03-13"}, {"excerpts": ["Diner-type food (I had fish and chips), and offers very nice views of the ocean, Sutro baths, etc. ", "Reasonable prices and friendly service. ", "Can get very crowded during peak hours, especially during tourist season."], "author": "Jethro B.", "review": "Nice and reasonably priced alternative to the Cliff House, if you are in that part of town. Diner-type food (I had fish and chips), and offers very nice views of the ocean, Sutro baths, etc. Reasonable prices and friendly service. Can get very crowded during peak hours, especially during tourist season.", "rating": 3, "date": "2014-10-16"}, {"excerpts": ["Only bad thing is it's near impossible to find parking close by (likely due to the restaurant, Cliff House, Sutro Baths and the view itself). ", "You'll either need to go up or down the hill, and walk, walk, walk. ", "It's worth it though. ", "Nice, cozy little place right on the hill looking out into the ocean. ", "Staff is very friendly and attentive despite how busy it gets. ", "Came here twice on Sundays and had to wait at least 20 minutes both times. ", "I'd recommend it if you're in that area of the city, but certainly no need to go out of your way unless you're heading for the view."], "author": "Anthony D.", "review": "Good breakfast place on the outskirts of the city with an absolutely awesome view. Only bad thing is it's near impossible to find parking close by (likely due to the restaurant, Cliff House, Sutro Baths and the view itself). You'll either need to go up or down the hill, and walk, walk, walk. It's worth it though. Nice, cozy little place right on the hill looking out into the ocean. Staff is very friendly and attentive despite how busy it gets. Came here twice on Sundays and had to wait at least 20 minutes both times. I'd recommend it if you're in that area of the city, but certainly no need to go out of your way unless you're heading for the view.", "rating": 4, "date": "2016-01-10"}, {"excerpts": ["Great view, great food, great service, and great places to hike around afterwards including Sutro Baths, Sutro Park, Land's End, and a hiking trail to Golden Gate bridge if you like."], "author": "Greg T.", "review": "Great view, great food, great service, and great places to hike around afterwards including Sutro Baths, Sutro Park, Land's End, and a hiking trail to Golden Gate bridge if you like.", "rating": 5, "date": "2016-12-29"}, {"excerpts": ["My man and I walk up and no line and a table with an awesome view of Sutro Baths. ", "It wasn't noisy or crowded like I thought it would be, "], "author": "Skye J.", "review": "Beautiful morning to go Point Lobos, but breakfast was a must. I have never been to Louis' before and was expecting it to be pricey because of the location. Surprisingly it is just a normal diner smelling of coffee and maple syrup. My man and I walk up and no line and a table with an awesome view of Sutro Baths. It wasn't noisy or crowded like I thought it would be, so right away I was happy. \n\nHe got Benedict and it came with two way to big slices of ham that were not smoked. He thought they must of ran out of the canadian bacon and used the same ham that they use for the sandwiches. Hollandaise did not taste homemade at all, probably was Knorrs,(just add water), as well as once frozen potatoes on the side. Plate did not look that pretty or at all appetizing. \n\nMy Burger, (I wanted huevos rancheros but no such luck), asked for medium and it came well done on the first few bites then medium well as I continued to eat, strange...and didn't come with onions? Just pickles, tomato, and crunchy lettuce.\nSide salad with more beans than lettuce, wishing for homemade thousand island cus' it's the best, but nope nothing really fresh or homemade here.\n\nI understand though, lowering your cost because regardless of what you do people still will eat there.\n\nService was excellent, very friendly and quick with coffee refills.\n\nIf I wouldn't have had a such an amazing view and a relaxing cozy atmosphere this would've got a 1 to 2 stars. So ya, I might go back with people to sit next to the window and have coffee, maybe try a sandwich next time.", "rating": 3, "date": "2013-12-12"}, {"excerpts": ["You're basically here because you've been grinding your heels on the ruins of old Sutro Baths. ", "You're callousing your thumbs on a Canon Rebel and taking in the marred shoreline. ", "And then you get hungry, and say, ever so enthusiastically, \"there's a place to eat up there!", "\" "], "author": "Rob P.", "review": "You're basically here because you've been grinding your heels on the ruins of old Sutro Baths. You're callousing your thumbs on a Canon Rebel and taking in the marred shoreline. And then you get hungry, and say, ever so enthusiastically, \"there's a place to eat up there!\" That's when you find yourself inside the doors of Louis', the most intriguingly ordinary diner ever. \n\nBut...\n\nThen we run into Robin Williams. You know, the wonky guy with the litany of voices Robin Williams. What bizarre, amicable timing. He's signing the guest book, bought some people lunch, and - holy toledo/expletive - he's headed right toward me. What does he want to say to me? Why is he coming over here? \n\nOh, I'm just standing in front of the cash register. So I move. \n\nMy girlfriend says, \"we should take a picture with him.\" I lament the idea, citing the fact that it would be rude. Later, I regret this. Be polite and you live a day. Be impolite and you have a Facebook picture forever. Still, he pulsed by me and his mammoth, furry arm grazed me. I emitted the most sincere words ever, \"siiiiiiiiick\". \n\nAfter the great comedian left, we asked the server what Robin Williams had ordered. Apparently it had been the tuna melt with fries. We sat in the same booth he had riveted himself into, and ate this greasy, wreck of a sandwich with excitement. The food itself was diner quality. Nay. Robin Williams quality! \n\nPretty good day, all said. The food was ordinary. The window seat was bliss. The weird, faux-interaction with Robin Williams intensely memorable. I cant NOT give this place four stars, right?", "rating": 4, "date": "2013-09-06"}, {"excerpts": ["We love to eat outside over the Sutro Baths - such a great view.  ", "I think it even makes the food taste better.  ", "My favorite is their good ol' cheeseburger!  ", "On the weekends it is VERY busy and you will likely have a wait, so don't go if you're in a hurry.  ", "The food has never disappointed!"], "author": "Debora G.", "review": "We have had breakfast and lunch at this establishment, and always try to swing by when we're at Ocean Beach.  We love to eat outside over the Sutro Baths - such a great view.  I think it even makes the food taste better.  My favorite is their good ol' cheeseburger!  On the weekends it is VERY busy and you will likely have a wait, so don't go if you're in a hurry.  The food has never disappointed!", "rating": 4, "date": "2014-02-16"}, {"excerpts": ["By The Sutro Bathes Entrance Also . ", "My Favorite Breakfast Is Greg's Cheesy Omelet With Chili ."], "author": "Gregory P.", "review": "Louis Is A Great Little Place , With Wonderful   Very Picturesque Views Of The Entrance To San Francisco Bay. Ships Large And Small Go By . The Seating Is A Bit Limited , Counter Seating Available Also. Delicious Breakfasts And Lunches Served All Day.. This Is A Cash Only Establishment , ATM Available. Parking Is Unique . Outside And Up By Lands End, Across The Street By The Sutro Bathes Entrance Also . My Favorite Breakfast Is Greg's Cheesy Omelet With Chili .", "rating": 4, "date": "2014-09-29"}, {"excerpts": ["You get quite a view of the ocean and the decrepit Sutro Baths with the wind whipping though the coastal foliage.\n\n"], "author": "Ed U.", "review": "Here's what happens all the time right below Louis'...\nhttp://www.youtube.com/watch?v=1W6AGM-LxGY\n\nCrashing waves. Hormonal rushes...\"I never knew it could be like this. Nobody ever kissed me the way YOU do.\" They should really wear wetsuits, don't you think? Gee, I forget we live next to an ocean. A big one. The Pacific. Ever heard of it?\n\nI actually had never been to Louis' before last week when I stopped by for breakfast. I just figured with the view they offer that it would be a tourist trap like the Cliff House. But it's not really. It's more like a mini-Denny's but with a lot friendlier staff. The 1970's-era roadside decor may give you a clue that this is no trendy eatery.\n\nGo on a weekday morning if you can to avoid the tourists. Only the regulars show up then, and you can have a booth all to yourself. You get quite a view of the ocean and the decrepit Sutro Baths with the wind whipping though the coastal foliage.\n\nThe menu itself is pretty standard, and it is a tad pricier than what you'd expect at a dinerish place. The price of the panorama. I had the $9.25 Sausage and Eggs Combo with hash browns and a toasted English muffin. It was all decent enough and served pretty quickly.\n\nThe place is pretty small - four booths, a few larger tables and a counter - which makes me think it fills up quickly on weekends. Between you and me, I think the food is marginally better at the Seal Rock Inn on the next corner up the winding road. But Louis' is a pleasant place to enjoy the ocean and have a cup of joe.\n\nFOOD - 3 stars...nothing special, nothing detestable...diner fare pretty much\nAMBIANCE - 4 stars...you come for the view...what else?\nSERVICE - 4 stars...very friendly and accommodating\nTOTAL - 4 stars...the unbeatable oceanside location is what pushes this one to four", "rating": 4, "date": "2008-02-24"}, {"excerpts": ["On a nice day you get a nice view of Sutro baths. "], "author": "Kathryn Y.", "review": "I used to come here all the time with my grandparents when I was young. This place is great, the food is good, service is friendly. On a nice day you get a nice view of Sutro baths. This place has a lot of SF history to it too.\n\nBrought my boyfriend here for lunch I had the french dip and he had the chili dog. Still delicious.", "rating": 4, "date": "2014-03-08"}, {"excerpts": ["Or if you are okay with crappy food, stop at Jack in the Box on the way to the beach, eat it on a bench with the same great view, and take a walk by Sutro Baths afterwards.  ", "But don't bother clogging your arteries at Louis'."], "author": "Amy L.", "review": "Let's be honest:  You go here for the view, not the food.  \n\nBecause the food is pretty crappy.  It's super-processed, came-off-a-semi-from-some-factory-in-the-Midwest diner fare that's mediocre and seriously over-priced.  The hot chocolate comes from a packet (probably Swiss Miss or something like that) and the whipped creme on top is from a cannister and is highly processed-tasting.  The burgers are too thin to be actual handmade patties, they probably arrived to the diner frozen, and no matter how you order it, it'll come to your table medium-well.\n\nAnd how about everything but the food?  The booths are crowded and cramped.  The service isn't exactly friendly.  \n\nBut you didn't come here for the food.  You came here for the view.  And it doesn't disappoint!  But honestly?  You can get a much better meal at the Beach Chalet right down the street with a similarly spectacular view for only a few bucks more.  Or if you are okay with crappy food, stop at Jack in the Box on the way to the beach, eat it on a bench with the same great view, and take a walk by Sutro Baths afterwards.  But don't bother clogging your arteries at Louis'.", "rating": 1, "date": "2010-08-28"}, {"excerpts": ["My Wife ordered a Patty Melt and I ordered a \nSutro...as Usual a Minimal time went by, Our Orders came with the Crinkled Fries an  a Pickle....", "My Sandwich was perfect as it has been many times before....", "My Wife was NOT....", "The Patty melt was SOPPING WET with grease, she took 2 bites and Said \"I can't eat this", "\" I said c'mon REALLY ?? ", "I took 2 bites....", "Whew VERY greasy---to the point of grease nearly covered my fingertip when I pressed in the center of the sandwich ..at this point I gave her the other half of my Sandwich ...", "Tommy finally  dropped by our table-(He seemed pre-occupied with visiting with his co-workers), asked how our meal was and My Wife told him \"it's VERY greasy", "\" He paused and said \"I'm sorry about that\" and without skipping a Beat, turned and walked off ", "we looked at each other in shock.....", "Hmmm no apathy there...", "Tommy once again appeared as we were almost \"finished\" to re-fill our drinks....dropped our Check and before he could \"Dash Off\" again we told him \"seriously we need this to be adjusted\"....\n", "After a Lenghy back and Forth \"going no where conversation", "\" (But you ate some of the Sandwich) ", "we left paying the Full price with a BAD TASTE in our Mouths......    ", "Sad thing is If a Little something was offered.. taking our Drinks off the Tab,charging us 1/2 price on the Patty Melt or charging us only for a side of Fries and a Pickle  ", "it would have made a HUGE difference....\n", "Customers make paydays Possible.. ", "With a heavy heart I had to write this ", "But if\nboth the Hontalas Brothers don't ever hear about it they cant Look into it...   ."], "author": "Dave A.", "review": "Action Speaks Louder than Customer Satisfaction =( \n\nIt's a Shame when One hard Headed Wait person (Tommy)  Oh wait...He's the Manager at the \"Moment\" can change the outcome of a Dining Experience....\nI'd like to consider myself a Level headed Individual when it comes to rating a food establishment as you can see in my previous reviews I'm a Foodie at Heart...\nI'm SURE if the  Owners  Tom and Bill  Hontalas were aware how THIER guests were being treated it's be a Different story....The fact that Louis has been around for seven decades speaks for itself with the Million Dollar View.... BUT Tommy's lack of service and Compassion is dumbfounding....My Wife ordered a Patty Melt and I ordered a \nSutro...as Usual a Minimal time went by, Our Orders came with the Crinkled Fries an  a Pickle....My Sandwich was perfect as it has been many times before....My Wife was NOT....The Patty melt was SOPPING WET with grease, she took 2 bites and Said \"I can't eat this\" I said c'mon REALLY ?? I took 2 bites....Whew VERY greasy---to the point of grease nearly covered my fingertip when I pressed in the center of the sandwich ..at this point I gave her the other half of my Sandwich ...Tommy finally  dropped by our table-(He seemed pre-occupied with visiting with his co-workers), asked how our meal was and My Wife told him \"it's VERY greasy\" He paused and said \"I'm sorry about that\" and without skipping a Beat, turned and walked off we looked at each other in shock.....Hmmm no apathy there...Tommy once again appeared as we were almost \"finished\" to re-fill our drinks....dropped our Check and before he could \"Dash Off\" again we told him \"seriously we need this to be adjusted\"....\nAfter a Lenghy back and Forth \"going no where conversation\" (But you ate some of the Sandwich) we left paying the Full price with a BAD TASTE in our Mouths......    Sad thing is If a Little something was offered.. taking our Drinks off the Tab,charging us 1/2 price on the Patty Melt or charging us only for a side of Fries and a Pickle  it would have made a HUGE difference....\nCustomers make paydays Possible.. With a heavy heart I had to write this But if\nboth the Hontalas Brothers don't ever hear about it they cant Look into it...   .", "rating": 1, "date": "2014-08-25"}, {"excerpts": ["Time spent by Ocean Beach, Sutro Bath House and Land's End would ultimately peak my interest with Louis' as the small restaurant along the paved path, and I knew I would eventually have to swing by and try it at least once.\n\n"], "author": "Casey L.", "review": "Time spent by Ocean Beach, Sutro Bath House and Land's End would ultimately peak my interest with Louis' as the small restaurant along the paved path, and I knew I would eventually have to swing by and try it at least once.\n\nBreakfast is the predominant item on the menu and with such a great view, who wouldn't want to start their mornings here. Tables line building giving you window access, while the bar seats you facing the friendly staff of Louis'. \n\nClassic Eggs Benedict listed $12.95 with thinly sliced ham, poached eggs on a muffin covered with hollandaise sauce was paired with potatoes and I was ready to dig in after heating up my food with some hot sauce. It was a good meal with friendly staff and a great view so another star is given.\n\nI would come back on an early morning if I find myself strolling along the beach or taking a hike on the trails.", "rating": 4, "date": "2012-10-25"}, {"excerpts": ["It is on top of The Sutro Baths..."], "author": "Danielle S.", "review": "Fast service, great food and amazing price for its ocean front location. It is on top of The Sutro Baths...", "rating": 5, "date": "2016-03-19"}, {"excerpts": ["I had been trampling around the old Sutro Bath ruins for about four hours, taking tons of various angle pics when I realized my blood sugar was low. "], "author": "Eyva Kid C.", "review": "I would definitely give the view five stars because it IS pretty wonderful.\n\nI had been trampling around the old Sutro Bath ruins for about four hours, taking tons of various angle pics when I realized my blood sugar was low. That, and it was FREEZING out, so I thought that a hearty bowl of clam chowder sounded good. \n\nI forged my way up the embankment to Louis', looked over at the Cliff House, contemplated the walk over there and then just decided to grab something at Louis since I was so close. I think I should have made the walk to Cliff House.\n\nIt was approximately 4pm on a shitty, overcast, freezing cold Friday, so there weren't many people around. I chose a booth with a good view, although it was dirty. The waitress was okay, nothing extraordinary, although she wasn't very good at her job. \n\nTo my dismay, they only had Manhattan Clam Chowder, which has a tomato base. I was hoping for a creamy New England, but oh well. It's a good sized bowl and comes with a clump of sourdough and some butter. \n\nThe soup tasted like a salty tin can. NOT IMPRESSED. I forced it down and then thought that a piece of cheesecake might get that taste out of my mouth. The waitress comes back over and I tell her these exact words: \"I think I'm gonna try a piece of cheesecake. Does that come with a topping?\"\n\nShe says yes, strawberry or chocolate syrup. I then tell her \"Strawberry sounds good, I'm thinking I'm gonna do that.\" \n\nSo I sit and wait for my cheesecake. And wait. And wait. And then wait some more. She finally comes back over and asks me if I would like anything else. I said \"yeah, the cheesecake.\" \n\nIt was good cheesecake, but their service blows ass. The wait staff act as though they don't want to be there. Perhaps it was just that day, who knows. They ARE a bit pricey for a diner and for the quality of food they serve.\n\nI honestly don't think Louis would be proud to have his name on the place these days. Go for the view, just don't get the chowder. I saw some people enjoying a French dip, perhaps that's a better choice?", "rating": 3, "date": "2011-09-21"}, {"excerpts": ["The place has a pretty sweet view of the Sutro Baths and part of the seagull shit stained rocks aka Seal Rocks.\n\n"], "author": "KD M.", "review": "One star for the view and another for the service.\n\nAnother co-worker dinner adventure! We were waiting for this place to open up again so we could finally try it. The place has a pretty sweet view of the Sutro Baths and part of the seagull shit stained rocks aka Seal Rocks.\n\nThe menu is pretty typical. You got your omelettes, salads, etc etc and my co-worker suggested we both get steaks. I was down for big slab o' meat so that's what we went with. It comes with either salad or soup. I got the soup (Manhattan clam chowder, the tomato based one!) and he got the salad. The chowder was salty as HAYYYYLLL. I practically diluted it with my water. My co-worker's salad was just...a salad with minimal dressing, overflowing on a tiny coffee saucer they used as the plate. No biggie. It was rather fun watching him poke at tomatoes as they rolled off the small plate.\n\nHere comes the worst part aka the entree/steak. Absolutely flavorless. Ok, maybe we're supposed to season it ourselves because that's how some people like to do but still! Also, we ordered it medium rare and it came out well done like REALLY well done, rougher than alligator skin, accompanied by standard frozen and cooked right of the bag crinkle cut fries. Oh well, at least they got the grill marks on the steak right. \n\nOur server was nice and also really apologetic when we told him about the steaks. He offered to have it exchanged for us but that would be a hassle anyway. Its not his fault that the cook sucks lol; \n\nI see some good reviews here so I'm willing to try it again but be warned: DON'T GET THE STEAK!!", "rating": 2, "date": "2011-08-30"}, {"excerpts": ["I remember this place as a kid when Playland at the Beach and The Sutro Baths were thriving and the whole area was hopping with food and amusement spots.  ", "It's a place you dive by more than visit and murmur, we shold try Louis' again, it's been too long, but you never do.   ", "My best friend was visiting from Chicago and my lover from Boise and we were out and about playing tourists and decided to grab lunch there on a recent, sunny, midweek October afternoon.  ", "We were seated at the counter which was fine ", "and I chose to have their 'Frenchburger' which almost universally means a half pound patty on some kind of a french roll.  ", "Louis' didn't deviate from the norm and soon enough I had a white oval platter with a toasted open face french roll crowned by a decent size patty covered in melting cheese. "], "author": "Stu S.", "review": "I remember this place as a kid when Playland at the Beach and The Sutro Baths were thriving and the whole area was hopping with food and amusement spots.  It's a place you dive by more than visit and murmur, we shold try Louis' again, it's been too long, but you never do.   My best friend was visiting from Chicago and my lover from Boise and we were out and about playing tourists and decided to grab lunch there on a recent, sunny, midweek October afternoon.  We were seated at the counter which was fine and I chose to have their 'Frenchburger' which almost universally means a half pound patty on some kind of a french roll.  Louis' didn't deviate from the norm and soon enough I had a white oval platter with a toasted open face french roll crowned by a decent size patty covered in melting cheese. a pile of crinkle cut fries and some so so lettuce, tomato, onion and pickle.  \n\nThe place has been there more than 70 years and isn't fancy or even swell, but it's not inexpensive either.  Like most San Franciscans, I don't expect much out what I call tourist trap restaurants and this is no exception for me, so no expectations translates into no great disappointments either.  From the counter where we were seated the only view is the slit peering into the kitchen or the derrieres of the many busy waitresses, not an all bad experience but not as sweet as seal rock and the wide open Pacific Ocean on a fine, sunny October day.  Most of the menu is classic diner food and gives the feel and appearance of coming from cans and frozen packages, or an uninspired kitchen, but it is fine grub for the throngs of hungry tourists who clamor for a seat in this long standing tourist trap.  It's fun and interesting.", "rating": 2, "date": "2011-10-14"}, {"excerpts": ["The only plus to this place is the view, and reading about the Sutro  history on the menu. \n\n"], "author": "GEL C.", "review": "Love the view! Service is horrible. I've been here 3 times. Twice dressed up professionally after work and once on my day off where I look like a street kid. Regardless of how I dress I should receive the same service and here I DID NOT! I will never return to this place, unless I need to sneak in to go pee after a hike or spending time at the beach. \n\nVeggie burger  and greek salad are AMAZING but the burger comes with  gross fries that come straight from the freezer and look like something that was served to me in elementary school lunch. Gross...\n\nThe only plus to this place is the view, and reading about the Sutro  history on the menu. \n\nEff this place...\n\n\nCASH Only, but they have an ATM inside\nSeating is limited. If you go at a busy time you could wait up to 30 mins", "rating": 1, "date": "2011-10-14"}, {"excerpts": ["Overall great stop while visiting Sutro Baths."], "author": "Andreanna H.", "review": "Wonderful service great views. This place is very welcoming and makes you feel at home. Great French dip sandwich and great fries. Overall great stop while visiting Sutro Baths.", "rating": 5, "date": "2014-10-20"}, {"excerpts": ["Terrific view of the ocean and sutro baths ", "but this is not a place to go if you want to set your taste buds on fire. ", "Staff were pleasant and the food was good but unremarkable. ", "I had the eggs Benedict which was ok ", "but eggs were requested ", "poached soft but arrived over done.\n"], "author": "Adam O.", "review": "A greasy spoon with a view.\nThe most interesting thing on the menu was the history of the establishment. Terrific view of the ocean and sutro baths but this is not a place to go if you want to set your taste buds on fire. Staff were pleasant and the food was good but unremarkable. I had the eggs Benedict which was ok but eggs were requested poached soft but arrived over done.\nIf you like drinking wine out of tiny screw top bottles then this is for you!\n\nNot a bad place to go if you want breakkie by the ocean before yo go walk Lincoln park ( which I recommend)", "rating": 3, "date": "2011-10-15"}, {"excerpts": ["you can even see where the sutro baths used to be. ", "You can go down to see the Sutro Baths or walk downhill and you will find the Cliffhouse and the beach. ", "Down the road is also Beach Chalet restaurant, Golden Gate Park and the SF Zoo."], "author": "Luis O.", "review": "My brother introduced me to this place when I was really young. We would always spend an afternoon in the city and started it with a good breakfast at Louis'.\nSince then I go when I can, but I order the same thing since I was little... LOL.\nI have some waffles and a hot chocolate... simple but very good.\n\nWe always got seats by the window because you get a great view of the pacific ocean, the cliffs and you can even see where the sutro baths used to be. Even though this place is really small, it gets very very busy. \n\nBRING A JACKET! You will be waiting outside. If you dont' know what it's like being oceanside in SF, it gets very cold and windy unless you get really lucky and its warm and sunny day.\n\nParking is not a problem because they have a small lot directly across the street.\nBut if it gets full, you can find parking along the street up or downhill from the restaurant.\n\nThe other great thing about this restaurant is it's location. You can go down to see the Sutro Baths or walk downhill and you will find the Cliffhouse and the beach. Down the road is also Beach Chalet restaurant, Golden Gate Park and the SF Zoo.", "rating": 4, "date": "2012-05-15"}, {"excerpts": ["I'm a local, but like other people I was in the area to wander around the Sutro Bath ruins. ", "Afterward, we walked past Louis' and noticed the place was almost completely empty. "], "author": "Nick C.", "review": "I'm a local, but like other people I was in the area to wander around the Sutro Bath ruins. Afterward, we walked past Louis' and noticed the place was almost completely empty. I've lived in the San Francisco area my whole life (59 years) and NEVER was there no waiting line to get in -- so we did.\n\nI can't remember what I had for lunch, but the milkshake was really good. As most others here agree, the view is fantastic. As some here have mentioned, the rest room IS very tiny.\n\nAt the time we were there, Louis' was facing closure because of the lease renewal. We had a very good and pleasant conversation with our waitress about it -- and it was heartbreaking, too. So, seeing the place is still open is very good news to me.", "rating": 4, "date": "2014-01-03"}, {"excerpts": ["I saw that this place had good reviews and it was right by the Sutro Baths, which was going to be our next stop.\n\n", "The bright side, I will say, is the gorgeous view of the ocean and the Sutro Baths. ", "Save yourself the money and just take pictures outside of the restaurant."], "author": "Kelli P.", "review": "Oof. I had heard of San Francisco being, in general, a pricey city to visit. For the most part, I had no problem with that. This is one of those places, though, that's unjustifiably expensive.\n\nI went there with my family--four of us in all. I saw that this place had good reviews and it was right by the Sutro Baths, which was going to be our next stop.\n\nI won't go into what each of us ate, suffice to say it was all breakfast items and it was about as mediocre as you can get. I should say that I actually really love diners. Any time there is a chance to hit a diner, I'm all over it. But this place was just blah.\n\nThe food itself is 3 stars--not horrible, not good. Just functional, I suppose.\n\nI took away a star for the prices. We wound spending over $80 (breakfast and juice/coffee per person, plus tip). It was disappointing. Whereas I was happy to pay the inflated rates at many other restaurants around the city, this one just really pissed me off.\n\nThe bright side, I will say, is the gorgeous view of the ocean and the Sutro Baths. Save yourself the money and just take pictures outside of the restaurant.", "rating": 2, "date": "2014-07-25"}, {"excerpts": ["Reyes, and the ruins of the old Sutro Bath House. ", "Get there early, or be prepared to be patient. "], "author": "Monarch B.", "review": "the best spot for a good breakfast with a spectacular view.\n\nIt's all about the view. You can see up the Marin headlands to Pt. Reyes, and the ruins of the old Sutro Bath House. Get there early, or be prepared to be patient. This is a local hangout that also attract tourists.\n\nBreakfast runs $8-10, and it's American diner fare. The burgers are generous, and aren't cooked to shoe leather. Good fries. Friendly staff.\n\nThere is free parking in a small lot across the street.\n\nTake a stroll along Land's End after you eat to enjoy the many views (and walk off a few calories).", "rating": 4, "date": "2012-04-14"}, {"excerpts": ["On a positive note...there is a magnificent view of the Sutro baths, Sutro park, Cliff house, Ocean beach and LandsEnd trail; maybe that is what justifies the high prices of food given that this is a 'touristy' place to dine. ", "But if you want quality food, pay more elsewhere! ", "One more thing: this place only accepts cash, so be prepared!"], "author": "Vanessa B.", "review": "Went on a Monday with some  friends, and there is still a waiting line for a table for 4, even though it was a weekday.  Waited for 15 mins, and since this restaurant only has one floor, you should plan on waiting awhile for a table! If you're not so picky, I suggest sitting at the counter; however, the disadvantage is not being able to have face-to-face conversation with your friends... Meanwhile, the food or lunch menu is at best mediocre. All my friends had some type of cheeseburgers, and I had the roast beef/ham/cheese sandwich on sourdough w/fries, but I asked for a \"bunless\" sandwich, and they made it my way. Although the portion size of meal was sufficient, I'm not sure if the quality of food was authentic, and what I'm referring to is their French fries- very bland and they seem like the frozen variety.  I'm happy to say that waiters were pleasant, but not as attentive as I would have liked. On a positive note...there is a magnificent view of the Sutro baths, Sutro park, Cliff house, Ocean beach and LandsEnd trail; maybe that is what justifies the high prices of food given that this is a 'touristy' place to dine. But if you want quality food, pay more elsewhere! One more thing: this place only accepts cash, so be prepared!", "rating": 3, "date": "2016-02-29"}, {"excerpts": ["Next time, we'll pack a lunch and sit outside overlooking the Sutro Baths.\n\n"], "author": "Jen L.", "review": "What someone else said about crappy seating service. I arrived with a friend and two hungry kids. Was told it would be a 20-25 minute wait, so my friend went outside with the kiddos to kill time. On the list ahead of me was a party of two, and after us (party of four) was another party of two.  A four-top and a two-top open up at the same time. What does the 16-year-old hostess with braces do? She put the party of two at the four-top, skipped over us, and seated the party of two after us, at the two-top. I asked her why she didn't put the party of two ahead of us at the two-top, so we could be seated, and she had absolutely no response.\n\nOur waiter was chill, but responsive, but good-god the food is expensive. Really? $1.25 for EACH additional omelette ingredient (but seasonal spinach is $1.75).  The place has a great view, but give me a break.  If the food was exceptional, I might be okay with the prices, but it's basic diner food.  (Wanted to, but didn't get the $5.25 side of bacon. $5.25 for a side of bacon?!?  WTH? It's not even organic.)  The potatoes were dry toasted little cubes that had absolutely no flavor.  And no kids menu? Really?  Yeah, so my five-year-old had to order a $10 hamburger.\n\nMeh, bleh.  I'm bummed, because I wanted it to be better.  Next time, we'll pack a lunch and sit outside overlooking the Sutro Baths.\n\n(Hey, if someone at Louis' is reading this, you might want to check the trends on your customer reviews--they're taking a dive like a pelican into the ocean!)", "rating": 2, "date": "2011-12-05"}, {"excerpts": ["This place was pretty packed when we went in, probably because it's the only nearby place to have lunch besides the Cliff House when you're hiking around Sutro. ", "The wait for a table was well worth it though. ", "The tuna melts we ordered were delicious, the view from the booth was picturesque, and the service was great. ", "The place had a small town feel. ", "The waitresses were really friendly, the atmosphere was casual, and the food was welcome comfort after a long day of exploring. "], "author": "Colleen D.", "review": "This place was pretty packed when we went in, probably because it's the only nearby place to have lunch besides the Cliff House when you're hiking around Sutro. The wait for a table was well worth it though. The tuna melts we ordered were delicious, the view from the booth was picturesque, and the service was great. The place had a small town feel. The waitresses were really friendly, the atmosphere was casual, and the food was welcome comfort after a long day of exploring. There were a lot of hikers coming in to use the bathroom, which was right next to our booth, but they weren't too distracting and the staff was cool with it.\n\nAn unexpected side note to our visit was the presence of Robin Williams (yes, the actor), who was paying his bill as we were waiting to be seated. He seemed really comfortable and relaxed, the staff seemed really comfortable and relaxed, and my impression of the restaurant as a friendly down-home place was confirmed. I would defininely go back here on any visit to San Francisco.", "rating": 4, "date": "2010-07-11"}, {"excerpts": ["Went here with another after walking around Sutro Baths. ", "Looked promising enough, but looks can be deceiving. ", "Not that we were surprised that it was terribly expensive - the location and menu set in the window both speak volumes - but it's just that we were expecting so much more. ", "The service was below average, the food was just okay, and even the view itself made the place seem plastic. ", "Once I sat down and looked around, that's the precise feeling I got from the place: plastic. ", "It's a very pretty establishment offering the standard but attractive diner fare that most people love. "], "author": "m r.", "review": "Summary: You're paying for the view (which, by the way, you can get by stepping outside, although granted you won't be as warm and comfortable and won't have folks waiting on you.)\n\nWent here with another after walking around Sutro Baths. Looked promising enough, but looks can be deceiving. Not that we were surprised that it was terribly expensive - the location and menu set in the window both speak volumes - but it's just that we were expecting so much more. The service was below average, the food was just okay, and even the view itself made the place seem plastic. Once I sat down and looked around, that's the precise feeling I got from the place: plastic. It's a very pretty establishment offering the standard but attractive diner fare that most people love. If you set it in the middle of Geary instead of teetering on a cliffside, people would never come (but of course, the prices would be a lot cheaper, too.)\n\nI can't blame them for cashing in on what I am sure is a lucrative demographic and location. But at least try a little harder.\n\nI had a veggieburger. One star is for that, and even that I could make better at home.", "rating": 1, "date": "2012-03-31"}, {"excerpts": ["This diner is located near the Sutro Baths. ", "It was so lovely to see the waves crashing onto the rocks. ", "The diner had many colored tiled floors, and the tables were small and close to each other. ", "Also, counter space was available to sit in. ", "This place seemed like it crowded with tourists or families giving tours to other friends. ", "I had the Louis shrimp salad. ", "The salad consisted of tomatoes, shrimp, and ranch dressing. ", "I was shocked when I got it. ", "There was so much shrimp and lettuce", ", I was unable to finish it. ", "I suppose that's why they call it the Louis shrimp salad (their signature salad), it's not a shrimp!"], "author": "Jennifer G.H. W.", "review": "This diner is located near the Sutro Baths. It was so lovely to see the waves crashing onto the rocks. The diner had many colored tiled floors, and the tables were small and close to each other. Also, counter space was available to sit in. This place seemed like it crowded with tourists or families giving tours to other friends. I had the Louis shrimp salad. The salad consisted of tomatoes, shrimp, and ranch dressing. I was shocked when I got it. There was so much shrimp and lettuce, I was unable to finish it. I suppose that's why they call it the Louis shrimp salad (their signature salad), it's not a shrimp!", "rating": 3, "date": "2010-07-27"}, {"excerpts": ["I got to sit at a booth overlooking the sutro baths, and the ocean on a clear and pretty day.\n\n"], "author": "Lauren S.", "review": "This place is fucking cute. I got to sit at a booth overlooking the sutro baths, and the ocean on a clear and pretty day.\n\nThat alone is worth coming back for.\n\nbut the food was pretty delicious here! i just got a standard breakfast for me, grilled cheese bacon and hashbrowns. yum!\n\nA tad pricey, but really yummy...and did I mention the view!?", "rating": 4, "date": "2009-12-01"}, {"excerpts": ["Cliff house, Sutro and the trail were newly renovated and looked great.  \n\n"], "author": "jason g.", "review": "A very basic run of the mill cafe from the 70's.  Their menu is from the 70's, the decor, their outfits, mugs, cups, plates............all are very ordinary.  70's menu with 2010 prices. \n\nMenu is very boring.  2 types of salads. House and Shrimp Louis.  3 types of soups. basic breakfast menu with some dinner entrees.  The only thing new about this place is their view.  Cliff house, Sutro and the trail were newly renovated and looked great.  \n\nCome here only if it's not cloudy and that you don't mind eating very average food.  Great for tourists!!!", "rating": 2, "date": "2009-09-22"}, {"excerpts": ["Overlooking the Sutro Bath ruins and the ocean makes this place a popular little tourist trap."], "author": "Mike P.", "review": "A really cute little diner with an amazing view! Overlooking the Sutro Bath ruins and the ocean makes this place a popular little tourist trap.", "rating": 3, "date": "2013-04-01"}, {"excerpts": ["it's all about being right above sutro baths and the ocean. \n\n"], "author": "Gwynnie P.", "review": "the view the view the view.....it's all about being right above sutro baths and the ocean. \n\nthe pancakes are a tad rubbery and my dining companions grated style hash browns were barely beige, but the bacon was GREAT. \n\n1 coffee, 1 order 2 eggs w/toast & hash browns, 1 short stack & a side o' delicious bacon, total damage $19 and change. That's useful, right?", "rating": 4, "date": "2009-05-31"}, {"excerpts": ["It's great for a casual outing - especially when family is in town, and the walk through the old Sutro bath house or the park is a plus. ", "It is a corner of the city worth exploring."], "author": "Martina R.", "review": "My family and I have returned to this spot my entire life. It's like a time capsule - and I'm not just talking about the 70s tile and curtains. The food OK and it closes pretty early, but nothing can beat the view. You can throw down a hundred bucks on dinner for two at the beach chalet to watch the sunset, but it is NOT necessary, because Louis is just up the hill and has them beat.  \nIt's great for a casual outing - especially when family is in town, and the walk through the old Sutro bath house or the park is a plus. It is a corner of the city worth exploring.", "rating": 4, "date": "2009-07-06"}, {"excerpts": ["After soaking in the morning sun and breathing in the cool, crisp ocean air by the Cliff House and Sutro Baths, we ate at Louis'. \n\n"], "author": "Tinna H.", "review": "We called in sick one sunny autumn day and ran around the city in our sleep-deprived state. What began the night before, we did not wish to end, and so we continued on. It was a beautiful day to be enjoyed together. After soaking in the morning sun and breathing in the cool, crisp ocean air by the Cliff House and Sutro Baths, we ate at Louis'. \n\nIt's a friendly spot. Food is mediocre. Nothing special, but if you sit back and stare out the window at the ocean, you can enjoy the view and perhaps overhear interesting conversation in the next booth over. The waitstaff are kind and will humor their patrons and listen to their crazy stories.\n\nI had always thought that Louis' was a fancy schmancy restaurant because of its prime location. Little did I know, it's just a diner. Well, a diner with a history and a view.", "rating": 3, "date": "2008-11-17"}, {"excerpts": ["We were informed by the nice hostess that we only had to wait 20 minutes for a window seat, and that's how long it took to get a nice booth next to a window overlooking the Sutro Baths. \n\n"], "author": "Rich M.", "review": "I live not too far from this place and I've always avoided it because it's location just reek's tourist trap. However, every place should get a real chance, and I was glad we tried it out. It's very small, but nearly every table has a wonderful view. There is also a counter if you're in a hurry. We were informed by the nice hostess that we only had to wait 20 minutes for a window seat, and that's how long it took to get a nice booth next to a window overlooking the Sutro Baths. \n\nYou'd think that's where the good news ends, but, I was pleasantly surprised by good service, and a decent chili size. (I'm dinging them a little for not cooking it medium rare, but medium well). My \"date\" had a fried egg sandwich that was scrumptious. And, my Anchor Steam in a bottle was ICE cold. Come to think of it, I'd give them 4.5 if I could. I think I'll return to try their breakfast, which is apparently served all day.", "rating": 4, "date": "2009-08-30"}, {"excerpts": ["The restaurant overlooks the beach, Seal Rock, the Sutro Baths and the Cliff House.  ", "There is a pathway down to the Sutro Baths behind the diner - be careful of its steep drop.  ", "3 stars for the food, 4 stars for being kid-friendly and having a great view on a sunny day!"], "author": "Janet H.", "review": "A group of 6 of us went to Louis' Restaurant on the edge of the Richmond district.  The restaurant overlooks the beach, Seal Rock, the Sutro Baths and the Cliff House.  There was a 15 minute wait mid-morning on a Sunday.\n\nOur plates were typical standard dine fare.  Notable items were the bacon which was thick and lean, the chili omelette which took an entire plate, and the hash browns which were big in portion.  If you are going to have an A-ok meal, why not top it off with a ton of hash browns?  Everything else was pretty good.  \n\nThis place can't help but be a tourist trap with its magnificent view.  There is a pathway down to the Sutro Baths behind the diner - be careful of its steep drop.  3 stars for the food, 4 stars for being kid-friendly and having a great view on a sunny day!", "rating": 4, "date": "2008-12-04"}, {"excerpts": ["It's a small diner looking over the Sutro Baths in the Outer Richmond District. ", "The views are awesome, the people are great, and the food is pretty tasty. ", "We sat by the window (most of the seats line the window so every spot has a great view), ordered a cheeseburger (for me) and a bacon omelet with hash browns (for Greg). ", "Both were very good! ", "They even serve our new favorite beer, Anchor Steam! "], "author": "Casi C.", "review": "My BF and I walked over to a local restaurant called Louis' Restaurant. It's a small diner looking over the Sutro Baths in the Outer Richmond District. The views are awesome, the people are great, and the food is pretty tasty. We sat by the window (most of the seats line the window so every spot has a great view), ordered a cheeseburger (for me) and a bacon omelet with hash browns (for Greg). Both were very good! They even serve our new favorite beer, Anchor Steam! This is a spot we will be returning to (especially on those hungover mornings!)\n\nOne Tip: Cash Only (there is an ATM there)\n\nCheck out some of our other favorite spots, pics, and reviews on our blog http://www.sanfrancisconoobs.com/", "rating": 4, "date": "2009-07-27"}, {"excerpts": ["Perfect after a day of exploring Sutro Baths or Lands End.  ", "I like to hike from the Legion of Honor, through the backwoods, along the coast, and end up back at Louis, where we have a nice meal.  ", "It's mostly downhill the entire route.  ", "Then, if we're lazy, we hop on the 18 bus and let it take us back to where we left the car at the Legion."], "author": "Sebastian S.", "review": "Great diner.  Great views.  Friendly staff.  Good food.  Bring cash.  \n\nThis place is a classic.  Perfect after a day of exploring Sutro Baths or Lands End.  I like to hike from the Legion of Honor, through the backwoods, along the coast, and end up back at Louis, where we have a nice meal.  It's mostly downhill the entire route.  Then, if we're lazy, we hop on the 18 bus and let it take us back to where we left the car at the Legion.", "rating": 5, "date": "2008-03-09"}, {"excerpts": ["We enjoyed a leisurely meal, watching people explore the ruins of the Sutro Baths below, and watching fishermen on the rocks offshore.  ", "The surf was high, and the waves hitting the rocks splashed above the fishermen's heads.  ", "Lots of birds flew by; it looked like the water between the baths and Seal Rocks was a regular flyway.  "], "author": "David D.", "review": "It was a cold, windy Saturday, a typical summer day in San Francisco.  I wanted to feel more cheerful, and I thought of lunch at Louis'.  We walked up Ocean Beach to get there, and enjoyed looking at the rolling surf.  There's nothing more calming than an hour or two watching the ocean, no matter what state it's in.  We stepped into Louis' and found the place half empty.  This was 4:30 pm on Saturday in the summer!  We were seated in ten minutes, at a table in one of the large picture windows that wrap around the whole building.  \n\nI had been picturing a shrimp salad sandwich since I thought of Louis' earlier in the day.  They didn't have that, but they did have a large shrimp louis salad, with sourdough bread on the side.  That and a Coke satisfied me that day.  The shrimp was tender, tasty, cooked just right.  The louis dressing was served on the side, but I poured the whole thing on my salad.  Margaret had a house salad, which she said was delicious, deep-fried shrimp, which I verified were delicious, french fries, and mineral water.   We enjoyed a leisurely meal, watching people explore the ruins of the Sutro Baths below, and watching fishermen on the rocks offshore.  The surf was high, and the waves hitting the rocks splashed above the fishermen's heads.  Lots of birds flew by; it looked like the water between the baths and Seal Rocks was a regular flyway.  There was a lot to watch, and no hurry to leave.  \n\nNothing much seems to have changed here since the place opened in 1937, except maybe the price.  In constant dollars, I wonder if even that has changed.  Our meal cost us $34, plus the tip.  \n\nWhat a great way to spend the day!", "rating": 4, "date": "2006-07-02"}, {"excerpts": ["This diner has a great view over the Sutro Baths and the Pacific Ocean.  "], "author": "Ryan W.", "review": "This diner has a great view over the Sutro Baths and the Pacific Ocean.  The booths near the windows in the back are the very best.\n\nThe food is good, and I have had the chili, the grilled cheese sandwich and a few other things.  They also have great pies for dessert.  The bathrooms are comical.  During busy times, there may be a short wait.", "rating": 4, "date": "2009-09-09"}, {"excerpts": ["Sutro sandwich with Swiss rather than Monterey Jack.  ", "The thing that made this sandwich better than a simple ham, turkey and cheese was that the roll was warm.  ", "What a huge difference.  ", "Fries were probably from the freezer which surprised me being the restaurant has a long write up on its menu about fresh organic locally sourced ingredients.  "], "author": "Mike H.", "review": "We went here for the first time last weekend for lunch.  It was good, not great.  As with many other reviews you'll read on this place, you pay for the view which last Saturday was amazing.  \n\nIt was busy and I'm assuming mostly with tourists.  I have nothing against tourists, they spend a lot of money in this town so keep them coming.  But tourists can tempt a place to be mediocre so I'm wary.  That is not the case here.\n\nThe staff was very friendly and prompt.  Thumbs up there.  And there are a lot of people working for such a small place.  \n\nThe food we had is good, not great but good.  \n\nSutro sandwich with Swiss rather than Monterey Jack.  The thing that made this sandwich better than a simple ham, turkey and cheese was that the roll was warm.  What a huge difference.  Fries were probably from the freezer which surprised me being the restaurant has a long write up on its menu about fresh organic locally sourced ingredients.  They are just fries but it does make me wonder what else isn't fresh.\n\nSpinach Salad was good and lightly dressed which was a plus.  Came with warm sourdough.\n\nLastly Fish'n Chips was good.  \n\nThey serve a Manhattan clam chowder which is nice to see for a change.  It was OK.  Grandma made the best so hard to compete.\n\nNothing great but all of it good.  And yes all of it more expensive than it would be if the place was in Daily City but you do pay for that view as I'm sure the restaurant pays for its location.  Don't complain about having to spend a couple extra dollars for the view and the history of this place.\n\nBased on what I've read, I'm going to have to come here for breakfast.  \n\nIf you're a local or just visiting head on over, especially if it's a sunny day.", "rating": 3, "date": "2012-03-06"}, {"excerpts": ["Unbeatable view, my eyes were stuck on the sutro bath ruins during sunset so concentrating on eating was difficult."], "author": "Carlos L.", "review": "Ok diner food, ok prices and service. Unbeatable view, my eyes were stuck on the sutro bath ruins during sunset so concentrating on eating was difficult.", "rating": 3, "date": "2011-12-29"}, {"excerpts": ["Listening to my 8-year old tell the missus all about the Sutro Baths while we looked at the ruins with the waves crashing on it? "], "author": "John H.", "review": "Hamburger and egg, right there together on the same plate with a cup of joe and a large OJ?  I've gone a lot further for a lot less.  Unbeatable view where in one amazing meal we saw whales, dolphins, and seals?  Now we're talking.  Listening to my 8-year old tell the missus all about the Sutro Baths while we looked at the ruins with the waves crashing on it? Your mileage may vary, but that's a home run.\n\nThis is my favorite breakfast in town.  Portions are solid, price is a little high for the food, but the view breaks your heart and the place is real, devoid of the meta-smugness that permeates the Bay Area.  If they were open after 6:30 I'd have a drinking problem.  Oh, wait . . .", "rating": 4, "date": "2007-10-16"}, {"excerpts": ["Sitting at the edge of a hillside, you will be blessed with a calming view if you're the lucky one that grabs a window booth, which overlooks the former place of The Sutro Baths, and also is a hop skip and jump from the recently remodeled historic Cliffhouse. ", "Located between Ocean Beach and back way to the Presidio area, this is a great addition to an evening after scarfing down some grub, because you may want to follow the roadway down for a calorie burning stroll either on the beach to watch the sun set or walk along the aging stone walk following the GREAT HIGHWAYs rolling path. ", "For you lovebirds? ", "This is definitely a romantic after thought too.\nSHINOBI 009"], "author": "SHINOBI Z.", "review": "I found this place when I went for a lunch meeting with this dude Jr (gaffling ass), but I kept it in mind as the years went by to become my getaway from the inner city hustle and bustle with its cramped eateries. Sitting at the edge of a hillside, you will be blessed with a calming view if you're the lucky one that grabs a window booth, which overlooks the former place of The Sutro Baths, and also is a hop skip and jump from the recently remodeled historic Cliffhouse. Located between Ocean Beach and back way to the Presidio area, this is a great addition to an evening after scarfing down some grub, because you may want to follow the roadway down for a calorie burning stroll either on the beach to watch the sun set or walk along the aging stone walk following the GREAT HIGHWAYs rolling path. For you lovebirds? This is definitely a romantic after thought too.\nSHINOBI 009", "rating": 5, "date": "2009-09-02"}, {"excerpts": ["The Sutro Baths plus the inevitable fog make quite the impression on the eye.  ", "If only the food at Louis' made the same impression.  ", "It's mostly traditional diner fare, but with prices jacked up so as to charge you for the view.  ", "I'd be ok with this if the food held up a little more.  ", "I decided to skip the breakfast for dinner idea and went with an open faced roast beef sandwich with potatoes.  ", "The dish would have been more successful if they had never called it a sandwich.  ", "A sad slice of Wonderbread sat under the mountain of decent roast beef, but due to the expansive lake of au jus that coated the whole plate, the bread became soggy.  ", "Au Jus soaked bread sounds good, but when it's on the verge of being limp while dry, the wet version just tastes like a bad sponge.  ", "The mashed potatoes were also of the decent variety, but more thick than creamy.  ", "My date's burger looked small and sad.  ", "As he ate it (and he did like it)", ", I counted at least fifteen places he could have gotten a better burger for the same price.  ", "So my evaluation is that this is a place to come with the folks for a milkshake (the one thing they seemed to do right), but save the appetite for Chinese food."], "author": "Jeremy G.", "review": "The view at Louis' is incredibe.  The Sutro Baths plus the inevitable fog make quite the impression on the eye.  If only the food at Louis' made the same impression.  It's mostly traditional diner fare, but with prices jacked up so as to charge you for the view.  I'd be ok with this if the food held up a little more.  I decided to skip the breakfast for dinner idea and went with an open faced roast beef sandwich with potatoes.  The dish would have been more successful if they had never called it a sandwich.  A sad slice of Wonderbread sat under the mountain of decent roast beef, but due to the expansive lake of au jus that coated the whole plate, the bread became soggy.  Au Jus soaked bread sounds good, but when it's on the verge of being limp while dry, the wet version just tastes like a bad sponge.  The mashed potatoes were also of the decent variety, but more thick than creamy.  My date's burger looked small and sad.  As he ate it (and he did like it), I counted at least fifteen places he could have gotten a better burger for the same price.  So my evaluation is that this is a place to come with the folks for a milkshake (the one thing they seemed to do right), but save the appetite for Chinese food.", "rating": 2, "date": "2013-08-24"}, {"excerpts": ["Due to its location, Louis' provides a touristy feel-good experience - I would come here again for brunch if I wanted to show off the area (Ocean Beach/Sutro Baths/Lands End) to friends visiting from out of town. ", "However, it didn't quite satisfy my \"dragged my tired ass out of bed early on a random Sunday morning for some super tasty food\" expectations."], "author": "Stephanie K.", "review": "The wait = lengthy.\nThe view = pretty.\nThe cheeseburger = tiny.\n\nAnd the pickles that came with my burger were even tinier - they looked like two green, crinkle-cut nickels.\n\nDue to its location, Louis' provides a touristy feel-good experience - I would come here again for brunch if I wanted to show off the area (Ocean Beach/Sutro Baths/Lands End) to friends visiting from out of town. However, it didn't quite satisfy my \"dragged my tired ass out of bed early on a random Sunday morning for some super tasty food\" expectations.", "rating": 3, "date": "2008-03-10"}, {"excerpts": ["This restaurant has been around for more than 6 or 7 decades I think, and is right next to the Sutro Baths ruins...", "so quite an interesting place.  ", "Definitely a fave for my brunch list."], "author": "Vivek A.", "review": "Food is pretty good, though not exceptional and a tad pricey.  The real reason to come here is for the ocean views and the amazing location.  It's a treat to drive out to Louie's and a great place to take out-of-towners.  There can often be a wait, however.   This restaurant has been around for more than 6 or 7 decades I think, and is right next to the Sutro Baths ruins...so quite an interesting place.  Definitely a fave for my brunch list.", "rating": 4, "date": "2011-11-29"}, {"excerpts": ["It also just never gets tiring to be able to stare out at the ocean and what remains of Sutro Baths while you're dining there."], "author": "Crys L.", "review": "A great little diner!  I used to come here for breakfast often when I lived in the city - I loved having their hamburger patty and eggs with fries for breakfast (yeah, fries over hash browns any day for me).  Now living elsewhere, it's been quite a while since I've been here.  \nRecently I re-visited this place during a trip up.  It's still just as good as I remembered it to be and as always, a delicious, satisfying breakfast.  It also just never gets tiring to be able to stare out at the ocean and what remains of Sutro Baths while you're dining there.", "rating": 4, "date": "2009-07-23"}, {"excerpts": ["After you eat you can walk off breakfast with a stroll down to the Sutro Baths, or up the Lands End trail.  ", "Nice."], "author": "Mark G.", "review": "The food is alright and you get a lot of it, but the prices are a bit high for coffee-shop food.  Really, you're paying for the view (which is awesome, I admit), because you can't throw a rock in this city without hitting a coffee-shop that serves better food than Louis' for cheaper.\n\nBut the service is good, and if you have guests this is a great place to take them.  Parking is easy and the wait time varies but usually isn't horrendously long.  The cheese omelet topped with chili is totally decent (price? $10.95, yikes!), so whatever.\n\nAfter you eat you can walk off breakfast with a stroll down to the Sutro Baths, or up the Lands End trail.  Nice.", "rating": 3, "date": "2007-10-31"}, {"excerpts": ["If you want the views, you can go to the Sutro baths without paying for overpriced garbage at the hands of a creepy staff..."], "author": "Casey H.", "review": "How is this so highly rated?  \n\nMy one visit will be my last.  We waited an incredibly long time.  \"Great, a sure sign of a good restaurant\" I was thinking.  Oh, how I was wrong.  The food was pricey, and awful.  I am pretty sure the chili on my eggs was out of a can.  Everyone's dish was bland and lukewarm.  \n\nNow, a restaurant's poor food fare can frequently be forgiven if the staff is charming or friendly.  Louis' couldn't even pull that off.  The service was inattentive and rude.  I had the gall to ask for a refill of water, after which our waiter took the prudent approach of ignoring us altogether.  Though I shouldn't complain too much...another staffer took time out of his busy schedule of staring off in to space to sleazily hit on the women at our table!\n\nIf you want the views, you can go to the Sutro baths without paying for overpriced garbage at the hands of a creepy staff...", "rating": 1, "date": "2008-03-14"}, {"excerpts": ["My boyfriend and I stopped in here on a really foggy day on our way to the Sutro Baths. "], "author": "Heidi G.", "review": "My boyfriend and I stopped in here on a really foggy day on our way to the Sutro Baths. We just wandered in to warm up but decided to stay for the atmosphere and some chili. \n\nI'd most definitely go back because it really set a mood for us - Louis' reminded me of an East Coast diner and I almost felt like I was on the Maine coast. It wasn't crowded at all, but that may have been due to the weather as it wasn't a great beach day, unless you like the fog. \n\nI'd recommend this little diner because it has a retro, sort of isolated, and cozy feel and good, polite service, and it's not like every other diner. A special place!", "rating": 4, "date": "2009-05-12"}, {"excerpts": ["I make a point of going here and exploring the Sutro Bath ruins every time I make it back to the city."], "author": "Jim C.", "review": "The modern California breakfast seems to require an exotic mixture of applewood, game birds, Eggbeaters, and passionflower infusions.  These breakfasts are normally delicious, but fail to satisfy when one is craving an old-school greasy spoon experience.\n\nLouis does a great job with the meat-and-potatoes diner experience.  Because it's a diner.  I've always been happy with the food I've eaten there, particularly if I can time my appearance in between waves of tourists.\n\nDiner food would normally only merit three stars (at best) from me, but the view from this place merits a star of its own.  I make a point of going here and exploring the Sutro Bath ruins every time I make it back to the city.", "rating": 4, "date": "2007-07-12"}, {"excerpts": ["When you are hanging around the Sutro Bath Ruins and you want to have not only a spectacular view, but eat at a place that is not going to make you feel like you have to put a second mortgage on your home to pay for it?\n\n"], "author": "Shaun L.", "review": "Okay.  When you are hanging around the Sutro Bath Ruins and you want to have not only a spectacular view, but eat at a place that is not going to make you feel like you have to put a second mortgage on your home to pay for it?\n\nLouis is the place to go.  The wait can be wicked monster long and getting the prime tables by the ocean overlooking that jutty rock is like winning the lottery, the waitstaff is lovely.  Please, talk to the African American Busman.  He remembers everyone and every time I go in there is a wonderful chatty fellow who has about 97 thousand \"Ladies\".  We went in there for Valentines Day last year and he remembered me from every single time I was in there.  Including the first time six years ago.\n\nThe food is simple.  Chili with cheese and onions, hamburgers.  fish and fries.  That glass case full of cakes and pies.  Wine in a glass that is not a wine glass.  :) \n\nBut who cares if they bring you wine in a water glass??  The food is good, the view is beautiful, you can afford it and the staff is friendly.\n\nIt is mom and pop good eats.  In the luckiest location in San Francisco.  :)", "rating": 4, "date": "2007-02-21"}, {"excerpts": ["This is a cozy spot (dated but in a charming way), perched on the edge of the cliff, offering sweeping vistas of the ocean rocks and Sutro Baths below.  ", "Based on the view alone this would be a 5-star rating. ", "However (yes, there is a however), the service was decent but nothing to write home (or Yelp) about.  ", "The food was okay, but overpriced for what it was and definitely not enough for leftovers.  ", "I guess I'll let them slide a little here because of the amazing location, which should come at a premium.  ", "Lastly, they don't take credit or debit cards (maybe that's part of the \"dated\" theme) but they do have an ATM on the premises.  ", "Not sure if the ATM charges an exorbitant fee and if it's another money making trap, because luckily it was one of those rare times when I carried enough cash on me, but do yourself a favor and also carry some cash when you visit.  ", "All in all, this is a one-of-a-kind gem worth your patronage.  ", "Just set your expectations high for the vistas but not too high for the food."], "author": "Hugo B.", "review": "This is a cozy spot (dated but in a charming way), perched on the edge of the cliff, offering sweeping vistas of the ocean rocks and Sutro Baths below.  Based on the view alone this would be a 5-star rating. However (yes, there is a however), the service was decent but nothing to write home (or Yelp) about.  The food was okay, but overpriced for what it was and definitely not enough for leftovers.  I guess I'll let them slide a little here because of the amazing location, which should come at a premium.  Lastly, they don't take credit or debit cards (maybe that's part of the \"dated\" theme) but they do have an ATM on the premises.  Not sure if the ATM charges an exorbitant fee and if it's another money making trap, because luckily it was one of those rare times when I carried enough cash on me, but do yourself a favor and also carry some cash when you visit.  All in all, this is a one-of-a-kind gem worth your patronage.  Just set your expectations high for the vistas but not too high for the food.", "rating": 4, "date": "2012-11-21"}, {"excerpts": ["On a nice day, I often take the opportunity to check out Fort Miley or walk down to Sutro Baths.  \n\n"], "author": "Kerry D.", "review": "Fellow SF Native Rosie S. recently included Louis' on her \"Old School SF\" List and I thought it was high time to share this gem with anyone who hasn't been here.  The food here is whatever (does that mean I'm not allowed to give 5 stars?) and I must admit I've only been here for breakfast.  The experience of Louis' is one in a million.  This is a family restaurant with excellent service.  They are also very good about serving the food quickly and turning over tables in reasonable time.  You can eat breakfast food anywhere, but you might as well do so perched on top of a cliff with expansive ocean views as far as you can see.  A cup of coffee always tastes better while experiencing some scenery.  \n\nIt can get pretty crowded on the weekends, but believe me, I've spent quite a few mornings here and still gotten a window seat without a long wait.  On a nice day, I often take the opportunity to check out Fort Miley or walk down to Sutro Baths.  \n\nYou will get the ultimate experience here on a beautiful day.", "rating": 5, "date": "2008-01-31"}, {"excerpts": ["this place has the best view of the ocean and the sutro baths.\n"], "author": "Tara T.", "review": "+:\nthis place is adorable.\nthis place has amazing service.\nthis place has the best view of the ocean and the sutro baths.\nthis place is one of the only true longstanding diners in the city.\n\n-:\nthis place is cash only. (but don't fret! they have an atm machine inside!)\nthis place is a long wait and gets busy fast.\nthis place is blah food. blah blah blah. whine whine.\nthis place is still on the spectrum of fair, but slightly overpriced for what it is.\n\ni've been here twice, once for breakfast and once for lunch. lunch was a bit better, but even still, the view is too good to miss. i know that we'll be back.", "rating": 3, "date": "2010-02-20"}, {"excerpts": ["It was okay, nothing special about the food other than its location and view of the ruins of the Sutro baths.  ", "Its a old historic place about to fall off the cliff.  ", "I hope it stays around but its fighting gravity!"], "author": "S F.", "review": "This is an affordable diner that I honestly have eaten here once in my 20 yrs of living in the Outer Richmond.  I ordered a tuna sandwich with fries.  It was okay, nothing special about the food other than its location and view of the ruins of the Sutro baths.  Its a old historic place about to fall off the cliff.  I hope it stays around but its fighting gravity!", "rating": 3, "date": "2010-04-22"}, {"excerpts": ["After our lunch, we walked down to the old Sutro bath site and explored the ruins.  ", "If you go for food, bring cash, and walk off your meal down at the baths...."], "author": "Peter R.", "review": "What can I say about this place that hasn't been said already?  Not much.  The waitresses acted like they didn't want to be there and the bathroom is a tight fit for fat people. We each had a BLT and fries.  Food was hot and crispy, but pretty standard diner fare.  The prices were a little high for a diner, but we were happy to pay extra for the view.   The view was phenomenal.   I wish that I could have been on this stretch of land 50 years ago when there were bars and other casual restaurants built on this bluff.  It must have been amazing.  After our lunch, we walked down to the old Sutro bath site and explored the ruins.  If you go for food, bring cash, and walk off your meal down at the baths....", "rating": 3, "date": "2010-10-24"}, {"excerpts": ["The high point of this restaurant is the lovely views of the ocean and Sutro Baths. ", "The food and service were about what I'd expect at a diner. ", "Tasty and pleasant but not much more."], "author": "Kevan M.", "review": "Wow! I feel like this place hasn't changed in 50 years - decor and all. It's like stepping back in time. The high point of this restaurant is the lovely views of the ocean and Sutro Baths. The food and service were about what I'd expect at a diner. Tasty and pleasant but not much more.", "rating": 3, "date": "2009-11-27"}, {"excerpts": ["It will always be the best hang out for me and my Dad, and you get a great view of the ruins of Sutro Bath and the ocean.  \n\n"], "author": "Amy P.", "review": "Best Milkshakes in the City of San Francisco.  My Dad has been taking me there since I was 3 and the place has always been fun, friendly and the food has always been tasty.  \n\nI must gush over these milkshakes, they are amazing, thick, creamy, never too chocolaty  and they always give you enough for at least two glasses.  they also never ruin them by putting whipped cream on the top.  \n\nI admit I haven't sampled too much of the menu.  I always get a grilled cheese sandwich, most of the wait-staff knows that as my usual.  \n\nIt will always be the best hang out for me and my Dad, and you get a great view of the ruins of Sutro Bath and the ocean.  \n\nA beautiful piece of San Francisco History.", "rating": 5, "date": "2008-06-04"}, {"excerpts": ["You should be able to time it just right after a nice walk around Lands End, Sutro Heights or Ocean Beach."], "author": "Wes M.", "review": "If Victorian ruins and art-deco renovations aren't doing it for ya, or the Cliff House's myriad dining areas are just too confusing, try Louis' for some good old-fashioned 70's diner action.  All the browns and reds you need (I especially dig the floor), and the same great views.  It's very basic diner fare: omelettes and griddles, burgers, grilled cheese, fish & chips (I can heartily recommend the fried prawns, by the way).  Don't think that this will be a quiet, uncrowded alternative to the Cliff House though: it's small and very popular, so I recommend stopping in after 2:30 or so to avoid the lines.  You should be able to time it just right after a nice walk around Lands End, Sutro Heights or Ocean Beach.", "rating": 4, "date": "2007-09-30"}, {"excerpts": ["Excellent spot for pre or post Sutro Bath ruins adventure."], "author": "Derek D.", "review": "A decent diner with a much more than decent view, nice service and tiny bathrooms.  Excellent spot for pre or post Sutro Bath ruins adventure.", "rating": 4, "date": "2007-06-05"}, {"excerpts": ["An old-style family diner, situated above the ruins of the old Sutro Baths.  ", "Food is traditional diner fare, satisfying as only diner food can be, and the views are exceptional.  ", "Even better, if you're lucky enough to get Hazel as a waitress, this American original will tempt you with other diners' food, tell you in no uncertain terms what you ought to order, and generally make you feel that you've stepped through a time warp to an earlier era.  ", "There's often a wait, especially if you want one of the window tables with a view of the Baths, but it's well worth it.  ", "And when you're done, wander down to the rocks and wonder why someone doesn't rebuild the darn thing!  ", "The ruins are so cool, but a working revival of the Sutro Baths would be even cooler!"], "author": "Tim O.", "review": "An old-style family diner, situated above the ruins of the old Sutro Baths.  Food is traditional diner fare, satisfying as only diner food can be, and the views are exceptional.  Even better, if you're lucky enough to get Hazel as a waitress, this American original will tempt you with other diners' food, tell you in no uncertain terms what you ought to order, and generally make you feel that you've stepped through a time warp to an earlier era.  There's often a wait, especially if you want one of the window tables with a view of the Baths, but it's well worth it.  And when you're done, wander down to the rocks and wonder why someone doesn't rebuild the darn thing!  The ruins are so cool, but a working revival of the Sutro Baths would be even cooler!", "rating": 5, "date": "2005-03-29"}, {"excerpts": ["Perched on a cliff above the Sutro Baths with a view of Seal Rock and the towering Cypresses that crown Lands End there is a no more scenic restaurant in all the world to enjoy basic, traditional and exceptional tasting American style diner food."], "author": "Polynesian m.", "review": "Louis' is without a doubt one of my favorite destinations for breakfast or brunch in this whole city.  Perched on a cliff above the Sutro Baths with a view of Seal Rock and the towering Cypresses that crown Lands End there is a no more scenic restaurant in all the world to enjoy basic, traditional and exceptional tasting American style diner food.", "rating": 5, "date": "2009-06-14"}, {"excerpts": ["The ocean view high above Sutro baths is amazing from this intimate diner. ", "The place gets crowded for breakfast, so strut in early for a typical and hearty diner meal. ", "Then proceed down to admire the gunk in the ocean eroded baths, hike around Sutro Heights, stroll through the Presidio golf course, and spend a day at the Legion of Honor. ", "A perfect leisurely urban outdoor date."], "author": "Cathy H.", "review": "The ocean view high above Sutro baths is amazing from this intimate diner. The place gets crowded for breakfast, so strut in early for a typical and hearty diner meal. Then proceed down to admire the gunk in the ocean eroded baths, hike around Sutro Heights, stroll through the Presidio golf course, and spend a day at the Legion of Honor. A perfect leisurely urban outdoor date.", "rating": 4, "date": "2008-04-15"}, {"excerpts": ["This place is a little far from home for it to be a regular haunt of mine, but I do like to eat lunch here after walking, running or biking the Battery and Lands Ends trail to Sutro Baths. "], "author": "Martin A.", "review": "This place is a little far from home for it to be a regular haunt of mine, but I do like to eat lunch here after walking, running or biking the Battery and Lands Ends trail to Sutro Baths. The bacon and eggs with hash browns really hit the spot after a morning of walking.\n\nSome of the food here can be a little generic, but the staff are always friendly and helpful and the prices aren't bad.", "rating": 4, "date": "2009-08-16"}, {"excerpts": ["cooked EXACTLY as you specify...breathtaking view of the water,  right over the ruins of the old Sutro Baths.  ", "Always worth the wait,  ", "and I hate to wait to be seated!     ", "The world (and San Francsico) needs more places like this,  and fewer \"cutting edge\" SOMA rip-off dining \"experiences.", "\""], "author": "Taylor B.", "review": "I have added this to my \"must\" visits whenever I'm in San Francsico.  I've not had lunch here so can't comment,  but breakfast at Louis' is terrific.  Eggs,  toast,  etc. cooked EXACTLY as you specify...breathtaking view of the water,  right over the ruins of the old Sutro Baths.  Always worth the wait,  and I hate to wait to be seated!     The world (and San Francsico) needs more places like this,  and fewer \"cutting edge\" SOMA rip-off dining \"experiences.\"", "rating": 4, "date": "2009-03-16"}, {"excerpts": ["Beautiful view of the cliffs and Sutro Baths!  ", "Wish they took cards but other than that it's a cute little diner by the sea!"], "author": "Sean M.", "review": "The food here is great but it's all about the location!  Beautiful view of the cliffs and Sutro Baths!  Wish they took cards but other than that it's a cute little diner by the sea!", "rating": 4, "date": "2009-03-14"}, {"excerpts": ["If your looking for a great view of the Pacific, and the old Sutro Baths then this is the place to be.  ", "I come here somewhat often as I live 10 blocks away and ", "everytime I have never been dissapointed.  ", "The service is great, the view is AMAZING, and their food is delicious.   ", "I have never really been a breakfast person, but I do love their waffles and pancakes, and that is a plus for me.  ", "I will say that the only con is that they take cash only.  ", "But after living in San Francisco for three years now, it's something that you just get used to.  ", "This is a great place to take visitors because of the stunning views."], "author": "Samantha R.", "review": "If your looking for a great view of the Pacific, and the old Sutro Baths then this is the place to be.  I come here somewhat often as I live 10 blocks away and everytime I have never been dissapointed.  The service is great, the view is AMAZING, and their food is delicious.   I have never really been a breakfast person, but I do love their waffles and pancakes, and that is a plus for me.  I will say that the only con is that they take cash only.  But after living in San Francisco for three years now, it's something that you just get used to.  This is a great place to take visitors because of the stunning views.", "rating": 4, "date": "2008-01-12"}, {"excerpts": ["it overlooks the old sutro baths and a sweet lil cove ", "that births pure and powerful blue and white crested swells that crash into the ruins of old san francisco.  ", "the old run down parking lot that sits on the ridge of the cliff and land's end trail has been paved and expanded, so there is plenty of room to park now.  \n", "the breakfast.  ", "it was good and standard.  ", "the service was great.  ", "just a great lil greasy spoon joint that has not changed since the 70's.  ", "i love the rust and red colored brick and ceramic mugs.  ", "a creepy guy sat next to me and ordered decaf and jam packets so he could take his medicine.  ", "he was creepy.  ", "the waitresses were still nice to him.  ", "i like that.  \n", "thanks for reading!"], "author": "yayoi s.", "review": "breakfast time.  2 eggs, over easy or medium, potatoes and toast.\nthe old man and i sat at the counter because window seats are too scenic not to be taken.  the view, no matter where you sit is still great.  it overlooks the old sutro baths and a sweet lil cove that births pure and powerful blue and white crested swells that crash into the ruins of old san francisco.  the old run down parking lot that sits on the ridge of the cliff and land's end trail has been paved and expanded, so there is plenty of room to park now.  \nthe breakfast.  it was good and standard.  the service was great.  just a great lil greasy spoon joint that has not changed since the 70's.  i love the rust and red colored brick and ceramic mugs.  a creepy guy sat next to me and ordered decaf and jam packets so he could take his medicine.  he was creepy.  the waitresses were still nice to him.  i like that.  \nthanks for reading!", "rating": 3, "date": "2009-10-06"}, {"excerpts": ["Inside you can still see remnants of an area that once had the Sutro Baths and Playland with its diner style seats and booths. ", "Depending on where you sit, you get a nice view of the ocean. ", "But due to the high number of tourists, expect to wait. ", "The food is somewhat reasonable, nothing out of the ordinary, but still satiating. ", "I did enjoy their breakfast omelette. ", "It's always a plus when you can find a restaurant that serves breakfast at all hours of the day."], "author": "Rob N.", "review": "I used to visit the Cliffhouse area, when the nickel arcade with the Laughing Sally and the black-and-white photo booths were still around. But after the Cliffhouse was rebuilt into something fancier, Louis' became a nice alternative to the newly rebuilt restaurant nearby. Inside you can still see remnants of an area that once had the Sutro Baths and Playland with its diner style seats and booths. Depending on where you sit, you get a nice view of the ocean. But due to the high number of tourists, expect to wait. The food is somewhat reasonable, nothing out of the ordinary, but still satiating. I did enjoy their breakfast omelette. It's always a plus when you can find a restaurant that serves breakfast at all hours of the day.", "rating": 3, "date": "2007-07-12"}, {"excerpts": ["But with a turquoise ocean and the Sutro Baths instead of (insert NJ stereotype here, ie shopping mall).  \n", "It wasn't the best grilled cheese I'd ever had, but hell, it was grilled cheese and I'd be hard pressed not to like that.  ", "The decor is very orange and brown 70's style.  ", "The wait for a table seemed like it might be long, but I was down with seats at the counter.  ", "Parking was a bit of a hoopla.\n", "Read the history on the back of the menu, if you can stop gazing out the window.  ", "It's rather touching and slightly weepsome."], "author": "Maggie H.", "review": "I became the San Francisco touring master when a foreign visitor came to stay for 18 days.  On our visit to Ocean Beach, I noticed Louie's for the first time.  I'd usually take visitors to the Cliff House to do the Pacific Ocean-isn't it lovely-glass windows thing, but decided to check this diner out.  And that's right folks, it was a real diner!  Owned by a Greek family!  It was like I'd died and gone right back to New Jersey!  But with a turquoise ocean and the Sutro Baths instead of (insert NJ stereotype here, ie shopping mall).  \nIt wasn't the best grilled cheese I'd ever had, but hell, it was grilled cheese and I'd be hard pressed not to like that.  The decor is very orange and brown 70's style.  The wait for a table seemed like it might be long, but I was down with seats at the counter.  Parking was a bit of a hoopla.\nRead the history on the back of the menu, if you can stop gazing out the window.  It's rather touching and slightly weepsome.", "rating": 4, "date": "2008-01-05"}, {"excerpts": ["270 degrees of beach, rocky coast, massive freighters sailing under the Golden Gate, birds whirling against the blue ocean, the relics of the Sutro Bath just below you. "], "author": "William M.", "review": "First thing that hits you is the view! 270 degrees of beach, rocky coast, massive freighters sailing under the Golden Gate, birds whirling against the blue ocean, the relics of the Sutro Bath just below you. Only the Carnelian Room can challenge this view IMHO.\n\nMy wife and I have had breakfast, brunch, and lunch at Louis' for almost 25 years (we live in Tres Pinos and manage our day in SF around eating here). Everything is filling, cooked just the way we requested it, very tasty. Constant drink refills, smiling waitresses, even a friendly table busser. It's a hometown diner with hometown folks.\n\nObviously avoid the noon-time rushes as there are only four booths and maybe four tables with a complete window view. I think the longest wait we have encountered has been less than five minutes. So go visit the Cal Academy of Sciences or the new De Young Museum, then pop into Louis' for a satisfying meal.", "rating": 5, "date": "2009-02-02"}, {"excerpts": ["The interior of this diner could be defined as 70's-tacky, but who cares when you're looking beyond to the Sutro Baths, the ocean and, if you are lucky, a spectacular sunset. ", "The food is reasonably priced and tasty and typical of your usual diner fare. ", "I had a cup of Manhattan clam chowder that was pretty small and left me lusting after my friend's hamburger, but next time, when I'm more set on a full meal, I'll try a burger. ", "I haven't been to Cliff House yet, but I'm sure this place beats it for a view and is much more affordable."], "author": "Caitlin H.", "review": "It's all about the view. The interior of this diner could be defined as 70's-tacky, but who cares when you're looking beyond to the Sutro Baths, the ocean and, if you are lucky, a spectacular sunset. The food is reasonably priced and tasty and typical of your usual diner fare. I had a cup of Manhattan clam chowder that was pretty small and left me lusting after my friend's hamburger, but next time, when I'm more set on a full meal, I'll try a burger. I haven't been to Cliff House yet, but I'm sure this place beats it for a view and is much more affordable.", "rating": 4, "date": "2006-05-20"}, {"excerpts": ["Clearer days are always better (duh), but you are on a cliff, overlooking the water, sutro baths, Marin", "....those are some top-notch views and they come complimentary with breakfast! ", "I've only been a few times with friends that know this place well (it's a bit out of my way), but I just always feel so at home and comfortable here. ", "It's a great place to start the day."], "author": "Aristocles P.", "review": "This is a diner indeed. Diners in my book cannot be \"fine diners\" because diner food is average, you've got the breakfast, the burgers...what else is new? I'll tell you what's new! Louis' has the friendliest service and amazing views.  Yes, the place is small, but if you are going to a diner this is the cutest one to go to.  There doesn't seem to be a high turn-around on the waitstaff, the people who work there have been doing it for years and are happy to be there. Isn't that refreshing? No? You...you don't care how long they've been working there? In that case you might care about the view. Clearer days are always better (duh), but you are on a cliff, overlooking the water, sutro baths, Marin....those are some top-notch views and they come complimentary with breakfast! I've only been a few times with friends that know this place well (it's a bit out of my way), but I just always feel so at home and comfortable here. It's a great place to start the day.", "rating": 5, "date": "2007-12-25"}, {"excerpts": ["Views of the Sutro bath ruins and the ocean thru big expanse of windows.  ", "Business is brisk, but worth the wait.  ", "Bus stop right outside, will take you down to the beach and eventually the Zoo.  ", "The burgers are good, and breakfast hearty, just right for a Midwest girl like me!  ", "I am glad the decor has not changed in decades--why does it have to?!  ", "It is part of the charm of the place."], "author": "Noran W.", "review": "It is a greasy spoon, so do not have high expectations of a gourmet dining experience.  We eat here every time when we are in SF,for breakfast and lunch.  The sandwiches are filling and the fries very good.  The view alone is worth the meal ticket.  Views of the Sutro bath ruins and the ocean thru big expanse of windows.  Business is brisk, but worth the wait.  Bus stop right outside, will take you down to the beach and eventually the Zoo.  The burgers are good, and breakfast hearty, just right for a Midwest girl like me!  I am glad the decor has not changed in decades--why does it have to?!  It is part of the charm of the place.", "rating": 5, "date": "2006-04-17"}, {"excerpts": ["although the decor of this small shack looks like you just stepped into a trailer, the price is way cheaper than the bitch (sutro's) across the street. ", "a pretty decent brunch ", "and you don't have to pay for the view."], "author": "Connie L.", "review": "although the decor of this small shack looks like you just stepped into a trailer, the price is way cheaper than the bitch (sutro's) across the street. a pretty decent brunch and you don't have to pay for the view.", "rating": 3, "date": "2005-06-27"}], "grayline": [], "bacon lettuce  tomato": [], "bacon lettuce  tomato with turkey": [], "grilled ham  cheese": [], "breast of chicken": [], "jims chili dog": [], "hot roast beef": [], "cottage cheese": [], "sliced tomatoes": [{"excerpts": ["I got the veggie and our server happily swapped out the side of potatoes for sliced tomatoes. ", "The eggs were perfectly poached over an ample amount of grilled onions, mushrooms, tomato...all on top of an english muffin and topped with a decadent hollandaise. "], "author": "Emily J.", "review": "Arrived around 9:45 am on a Sunday and was quoted a 20 minutes wait for four. (Reality was more like 30 minutes.) Walking down to Sutro Baths was a nice way to kill some of the time. \n\nI couldn't resist one of the benedicts. There are three to choose from: classic (ham), Louis' (bacon and tomato) or Veggie. I got the veggie and our server happily swapped out the side of potatoes for sliced tomatoes. The eggs were perfectly poached over an ample amount of grilled onions, mushrooms, tomato...all on top of an english muffin and topped with a decadent hollandaise. Yum. \n\nSure, you could be all fancy and go to the Cliff House...OR you can come here to get a similarly excellent view and delicious food at a more reasonable cost.", "rating": 4, "date": "2014-10-04"}, {"excerpts": ["C\nNot terrible, but expensive for some Bay shrimp on iceberg lettuce along with 2 sliced tomatoes that are cut for burgers and sandwiches (nice cost cutting strategy Louis... ", "I'm sure rents expensive, but if you really want to make a name for yourself, get your act together on food quality). ", "No Crab?  "], "author": "Mark M.", "review": "Weak Sauce.\n\n\nPoor quality diner food. (lunch)\n\nExceptional view.\n\nLunch:\nFish n Chips:    B-\n4pc. Decent but should offer more quality-quantity for being on the ocean!  Frozen bag wrinkle cut French fries.\n\nPrawns n Chips:    B\nNot bad fried prawns, but still felt like came from a package with the wrinkle cut French fries....\n\nLouie Salad:  C\nNot terrible, but expensive for some Bay shrimp on iceberg lettuce along with 2 sliced tomatoes that are cut for burgers and sandwiches (nice cost cutting strategy Louis... I'm sure rents expensive, but if you really want to make a name for yourself, get your act together on food quality). No Crab?  Don't even offer??\n\nIced coffee: F\nnormal poor quality diner coffee with ice in it..\n\nJuice: all from concentrate....\n\n\nAlthough a rich history of being owned by family, etc. this place does NOT deserve to be in this location...Quality of food is poor.  Soak in the view from outside and brown bag it baby.....\n\n\n\nBreakfast looked a bit better, but still overpriced for the location and view.", "rating": 1, "date": "2012-03-03"}], "pie": [{"excerpts": ["The coffee is great and so is the pie (with ice cream) and the customer service. ", "I totally recommend this place, especially on a cold day."], "author": "Tristin B.", "review": "Came here right after I finished the land's end hike.\n\nGreat venue with a view of the sutro baths and the pacific! The coffee is great and so is the pie (with ice cream) and the customer service. I totally recommend this place, especially on a cold day.", "rating": 5, "date": "2016-05-07"}, {"excerpts": ["We wanted to drink a cup of coffee and eat an ice cream and pie. ", "We ordered the coffee and when the waitress came back to take the order, she told us that they have a policy that if they have new guests they may ask us to move to the bar. ", "We explained that we just want to drink coffee for 15 minutes ", "and she said that's the policy. ", "We asked to leave and she asked us to pay for the coffee which we have not drinked.\n", "They also don't accept credit cards. ", "Only cash.\n", "The attitude is arrogant and this is not the way to handle a family business."], "author": "Eran P.", "review": "We wanted to drink a cup of coffee and eat an ice cream and pie. We ordered the coffee and when the waitress came back to take the order, she told us that they have a policy that if they have new guests they may ask us to move to the bar. We explained that we just want to drink coffee for 15 minutes and she said that's the policy. We asked to leave and she asked us to pay for the coffee which we have not drinked.\nThey also don't accept credit cards. Only cash.\nThe attitude is arrogant and this is not the way to handle a family business.", "rating": 1, "date": "2014-12-29"}, {"excerpts": ["Avoid the pie.  "], "author": "Peter M.", "review": "Ah, Louis'...  This is a really fun spot.  Incredible views of the Pacific, with the cozy charm of a Mom & Pop diner.  \n\nThe food, while a buck or two higher than it should be, was perfectly edible, and the slightly higher cost is more than made up for in ambiance.\n\nExpect a wait on a weekend or during the lunching hour.  Avoid the pie.  Not so good.\n\nGreat place to bring visiting friends and family for a meal with a view - especially one that spares your wallet from the terrors of the Cliff House down the street.", "rating": 3, "date": "2007-11-02"}, {"excerpts": ["Pancakes, omelettes, french toast, fried eggs, coffee, pie... ", "it's all as you'd expect at the diner of your dreams.  "], "author": "Ryan H.", "review": "I have not come to San Francisco once without making sure at least one early morning breakfast was spent looking out over the coast and cliffs  astride Ocean Beach.  This diner, family-owned and operated since 1937 puts together food that is so delicious and homemade tasting that it actually manages to distract (just a bit) from the view.\n\nPancakes, omelettes, french toast, fried eggs, coffee, pie... it's all as you'd expect at the diner of your dreams.  The service is fast and west-coast-friendly with just a little bit of east-coast-sass.  \n\nSadly, they are closing down for a couple of months (at the end of November) for some major renovations.  I'm crushed... Without a major miracle, on my next trip here, I'm going to have to find somewhere new to crunch through slabs of yummy bacon and watch the waves crash below. \n\nEven from across the country, I'll miss this place while it's closed, and look forward to seeing it reopen in the spring.  It's a delight here, and hope it keeps its old-school feeling of warmth and welcoming when it comes back.", "rating": 5, "date": "2010-11-07"}, {"excerpts": ["I had a slice of some wonderful Cherry Pie, a-la-mode, of course! ", "Coffee too....", "wow....", "what a wonderful meal...."], "author": "Tia A.", "review": "Birthday DAY took a trip out to the city for some extreme biking (unplanned) and a nice lunch of my choice. You know, played the tourist thing and all... \n\nWell, I chose Louis'!! After driving by this place a gazillion times on the weekends and being discouraged by the 10-deep line out the door I knew this would be our lunch destination....how crowded could it be on a Tuesday afternoon? \n\nIt was not bad at all! Wait was 5 minutes tops, and we got a great corner spot right next to the window (awesome!!). Being that it was my birthday and all I did not hesitate to go all out at this b****! I ordered the open face Roast Beef sandwich (complete with Mashed Potatoes and Gravy) with a side of horseradish....I also ordered a pre-lunch 'dinner' salad. Both were awesome!! Could not even come close to finishing the Roast Beef because it covered my ENTIRE plate....holy crap that thing was loaded!! Plus I had to save room for desert!! \n\nI had a slice of some wonderful Cherry Pie, a-la-mode, of course! Coffee too....wow....what a wonderful meal....and it's a friggin' diner!! \n\nI can't wait to go back on a random day off in the middle of the week.....I wouldn't dare to try it on a weekend.....leave it for the real tourists....", "rating": 5, "date": "2009-06-22"}, {"excerpts": ["pie was great, and they serve local beers too. ", "simple and satisfying, and the location is so cool."], "author": "A R.", "review": "laid back, gorgeous views, nice family atmosphere. its a solid basic diner, which is just what we wanted. pie was great, and they serve local beers too. simple and satisfying, and the location is so cool.", "rating": 5, "date": "2015-03-25"}, {"excerpts": ["its really simple.... diner food... pie, hot choc... ", "burger... fries...  ", "but my favorite is... ", "the iced-tea.... ", "yeah.. ", "I know it's out of syrup or something.. ", ".but ", "for some reason.. I always think of this place and iced-tea.  ", "The food isn't nearly as good as the views... "], "author": "Eric K.", "review": "yeah.. this place is just kinda cool!\n\nA friend took me here prolly 10-ish years ago....\n\nits really simple.... diner food... pie, hot choc... burger... fries...  but my favorite is... the iced-tea.... yeah.. I know it's out of syrup or something.. .but for some reason.. I always think of this place and iced-tea.  The food isn't nearly as good as the views... its actually not THAT bad to get to this place...and the lot is right across the street(but watch the crossing).\n\nso it might not be hard to get to this place as in \"the last mile\" but as you can see from the map, it's obviously not real convenient to get to either, which makes stops by here rare and precious.\n\nHopefully you don't get seated by the bathrooms... that is an area for improvement.  I've never actually gone into them, but I have \"experienced\" them if you know what I mean.... its a small place.  \n\nCASH ONLY!!!!!", "rating": 4, "date": "2007-06-29"}, {"excerpts": ["Does mid-afternoon pie and coffee strike your fancy?  ", "This is the place to go."], "author": "Jak K.", "review": "This is a diner - not an elegant 5-star restaurant.  As diners go, the food is about as good as most of them (average fare), but the view of the ocean is the reason to go.  And like other diners, it's rather small, so if you pick noon on a weekend, you're gonna wait - especially for a table near a window.  On the plus side, the desserts are surprisingly good.  Does mid-afternoon pie and coffee strike your fancy?  This is the place to go.", "rating": 4, "date": "2007-07-04"}, {"excerpts": ["That being said, the strawberry shake was delicious, the quality of the burger was excellent, and the apple pie with ice cream I got also great.  ", "The prices are a little high, but the view is magnificent.  ", "For a great burger and shake and a wonderful SF memory, I would recommend Louis'."], "author": "M R.", "review": "The food at Louis' is very straight forward - omelettes, burger and fries etc.  That being said, the strawberry shake was delicious, the quality of the burger was excellent, and the apple pie with ice cream I got also great.  The prices are a little high, but the view is magnificent.  For a great burger and shake and a wonderful SF memory, I would recommend Louis'.", "rating": 4, "date": "2008-04-21"}], "dish of ice cream": [], "sundaes": [], "its it": [], "chocolate cake or carrot cake": []}