{"fresh shrimp roll": [], "fresh veggie rolls": [], "potstickers": [{"excerpts": ["The potstickers were ok as well, crispy with a nice dipping sauce. ", "Glad to have finally found a place in the city to go for my pho cravings"], "author": "Peter P.", "review": "Finally a place in SF that does pho right, this place is my new favorite place for pho in the city. They serve a range of Vietnamese cuisine, but I came for the pho and happy to say I wasn't disappointed. \nOrdered the pho with rare beef, brisket, and meatballs. Came out quickly and all the sides (lime, basil, jalapeño, sprouts) were fresh. The pho broth tasted meaty and not over salted like a lot of places. What I really like about the pho was that I was really well balanced. The right amount of noodles and meat. They did not skimp on the meat like a lot of places do which made me happy. The place itself is small but the service was fast which makes up for anything lacking. Also got the Thai iced tea which was pretty standard and ok. The potstickers were ok as well, crispy with a nice dipping sauce. Glad to have finally found a place in the city to go for my pho cravings", "rating": 5, "date": "2017-09-01"}, {"excerpts": ["Potstickers. ", "Thai Iced Tea. "], "author": "Richard R.", "review": "Five Spice Chicken. Potstickers. Thai Iced Tea. Coffee Flan. All equals a happy customer!", "rating": 5, "date": "2016-04-02"}, {"excerpts": ["We ordered potstickers, nim ", "chow(called something different here, the rice paper wrapped shrimp), beef pho, shrimp plate, beef plate, and shrimp paste soup. ", "The beef pho was good, average; more than enough for two people. ", "Potstickers were gently fried (I think) had a slight crust and were excellent. ", "The nim chows were excellent, more complex than I get at home. ", "The shrimp came with greens, rice and a fried egg. ", "Looked great, I didn't get to try. ", "My mother didn't eat much of her soup, but I think she got full. ", "I ate it for a few days, the shrimp paste gave it a great depth of flavor. ", "I also reheated my brothers beef strip plate, I think that was my favorite dish. ", "If you are here and you only like traditional American Chinese food this is what you should order. ", "The food was very 'clean' as I would call it, not greasy."], "author": "C M.", "review": "5 of us met here for lunch. Everyone comments on the decor, I thought it was perfect. Quiet, not gaudy, robins egg colored chairs. We couldn't get ice for our drinks which seems to be a Cali problem, in RI you usually get too much ice! We ordered potstickers, nim chow(called something different here, the rice paper wrapped shrimp), beef pho, shrimp plate, beef plate, and shrimp paste soup. The beef pho was good, average; more than enough for two people. Potstickers were gently fried (I think) had a slight crust and were excellent. The nim chows were excellent, more complex than I get at home. The shrimp came with greens, rice and a fried egg. Looked great, I didn't get to try. My mother didn't eat much of her soup, but I think she got full. I ate it for a few days, the shrimp paste gave it a great depth of flavor. I also reheated my brothers beef strip plate, I think that was my favorite dish. If you are here and you only like traditional American Chinese food this is what you should order. The food was very 'clean' as I would call it, not greasy.", "rating": 4, "date": "2016-07-01"}], "beef pho with  item": [], "beef pho with  items": [], "beef pho combo": [{"excerpts": ["I got the beef pho combo ($10) which came with a generous serving of brisket, meatballs, and rare beef. ", "It only comes in one size but it was more than enough for a meal. ", "The brisket was perfectly tender and fatty. ", "The meatballs were delicious! "], "author": "Linda X.", "review": "5 stars for the pho here! The beef broth is AMAZING - so rich and doesn't even need any sauce to be added to it. I got the beef pho combo ($10) which came with a generous serving of brisket, meatballs, and rare beef. It only comes in one size but it was more than enough for a meal. The brisket was perfectly tender and fatty. The meatballs were delicious! Next time I'm going to get just beef pho with brisket and meatballs.\n\nThe place itself is pretty large and there was plenty of seating. The service here is ridiculously nice and attentive. The free cucumber water even tastes so refreshing! We also got the spring rolls ($7) which tasted fresh. My boyfriend ordered the grilled pork vermicelli noodle bowl with imperial rolls ($12). It was a solid dish but I would definitely recommend getting the pho instead.\n\nI'm a huge fan of this place!", "rating": 5, "date": "2015-11-26"}], "vegetable pho": [{"excerpts": ["Got rhetoric vegetable pho sith beef broth and I love all the extra veggies they add, that other restaurants don't use.  ", "Service was fast and very friendly! ", "Definitely Wil be back ", "anytime we want some delicious pho and maybe try other menu items."], "author": "Chelsea P.", "review": "Only one size of Pho available,  which I'm not used to. Got rhetoric vegetable pho sith beef broth and I love all the extra veggies they add, that other restaurants don't use.  Service was fast and very friendly! Definitely Wil be back anytime we want some delicious pho and maybe try other menu items.", "rating": 5, "date": "2015-10-17"}, {"excerpts": ["The VEGETABLE PHO broth is insanely rich with a strong, smooth mushroom flavor and not your typical MSG-broth of cancer you get at a lot of asian restaurants. ", "Did I just say a vegetable broth is RICH? ", "Yes, arguably richer than the beef pho broth. ", "Pho is really one of those hearty dishes for when you're sick or need to balance your diet. ", "I had a fever and ate this to get my body going again "], "author": "Ulla L.", "review": "***I STRONGLY RECOMMEND THIS FOR VEGETARIANS (and just health conscious people in general)!***\n\nI've only gotten delivery here via Eat so I can't comment on the service or atmosphere of the restaurant. All I can say is that for people who claim their dishes are flavorless, you obviously have been abusing your taste buds. That is a shortcut a lot of restaurants take - overdosing on sugar, salt, and spice so most likely, your taste buds have lost sensitivity.\n\nThe VEGETABLE PHO broth is insanely rich with a strong, smooth mushroom flavor and not your typical MSG-broth of cancer you get at a lot of asian restaurants. Did I just say a vegetable broth is RICH? Yes, arguably richer than the beef pho broth. Pho is really one of those hearty dishes for when you're sick or need to balance your diet. I had a fever and ate this to get my body going again and it did the job. \n\nI've also tried the BEEF PHO which was also really tasty and non-fatty/oily. Again, very flavorful and hearty - I didn't even need to throw in sriracha or hoisin sauce. I would order this regularly as it's such a great execution of a classic, if I lived nearby (or even in the same city ha). \n\nVIETNAMESE COFFEE: pretty standard, but not from mix. \n\nAll in all, I think this is a no-shortcut Vietnamese restaurant with solid food and healthy options (just avoid the fried foods which is common sense.)", "rating": 4, "date": "2015-12-13"}, {"excerpts": ["I got the vegetable pho and the bf got the vermicelli . ", "There was an above average flavor to the vegetable pho, mushroom like, which was nice but still not worth 5 stars!!\n\n"], "author": "Dede C.", "review": "Alright how does this place have 4 and half stars??\nMaybe it's because I'm a vegetarian.\n\nFirst off, atmosphere of this place is cold and uninviting, we were the only people in there and there was a woman who worked there Facetiming behind us -- but on to the actually important stuff.  The food.\n\nI got the vegetable pho and the bf got the vermicelli . There was an above average flavor to the vegetable pho, mushroom like, which was nice but still not worth 5 stars!!\n\nBut hey eat here if you want too.", "rating": 3, "date": "2015-12-14"}, {"excerpts": ["I did order the vegetable pho and that was good. ", "Recommendation would be to stick to the vegetarian dishes."], "author": "Cari S.", "review": "The five spice chicken vermicelli noodles are a huge let down. The chicken was grey and very rubbery/fatty. I took one bite and spit it out. I did order the vegetable pho and that was good. Recommendation would be to stick to the vegetarian dishes.", "rating": 2, "date": "2016-01-16"}, {"excerpts": ["Also the vegetable pho is really good and they give you plenty of veggies to make sure you aren't just having broth. ", "They deliver and are open pretty late, staff is always friendly and nice so thats always a plus as well. ", "Finally i'm not stuck driving all over town for some good pho!"], "author": "Dmitriy G.", "review": "I would give this place three thumbs up if I had a third. This has become my go to stop if you want a good quick and rather cheap meal in the marina. The garlic noodles and shaking beef are usually my choices while my girlfriend usually gets the cabbage salad. Also the vegetable pho is really good and they give you plenty of veggies to make sure you aren't just having broth. They deliver and are open pretty late, staff is always friendly and nice so thats always a plus as well. Finally i'm not stuck driving all over town for some good pho!", "rating": 5, "date": "2016-08-02"}, {"excerpts": ["I usually get the vegetable pho and it is quite a big portion. ", "The service is a bit slow and it truly sucks when you are very hungry. ", "Overall great Pho place. ", "Very Clean and everyone is very nice."], "author": "Andrea S.", "review": "The best Pho I have ever had. I usually get the vegetable pho and it is quite a big portion. The service is a bit slow and it truly sucks when you are very hungry. Overall great Pho place. Very Clean and everyone is very nice.", "rating": 5, "date": "2015-11-17"}], "crab paste noodle soup": [{"excerpts": ["I got the crab paste noodle soup and my bf got the pho. ", "His pho portion was quite small but mine was definitely pretty large. "], "author": "Annie Z.", "review": "Stopped by here for a light dinner on Friday night. Service was very fast and decently priced, however I felt like the environment/the area they're in is a bit sketch. i don't spend much time in the Marina so I'm not too familiar with this area. I use to think the Marina is very expensive and high-end but I guess not all of it! That probably explains why this restaurant is able to be priced so well. I got the crab paste noodle soup and my bf got the pho. His pho portion was quite small but mine was definitely pretty large. We probably could've shared one of the crab paste noodle bowls and been full. \n\nI would say Ly's is not a bad option if you live in the area and want something cheap and fast, but for vietnamese cuisines in the city I think I prefer Sunflower.", "rating": 3, "date": "2017-02-12"}, {"excerpts": ["My fiancé likes the crab paste noodle soup, which is more unique if you're looking for something different.\n\n"], "author": "Valerie L.", "review": "I've been to Ly's a number of times and I always order the 1) garlic noodles with chicken or 2) beef pho. Simple but amazing! My fiancé likes the crab paste noodle soup, which is more unique if you're looking for something different.\n\nBack to the five spice chicken garlic noodles -- aside from the two or three sad pieces of broccoli, this is an excellent dish. The noodles are always perfectly chewy and the chicken is juicy, packed with flavor, and crispy on the outside. It also comes with a fish sauce. The pho hits the spot too.\n\nIt's pretty amazing that there's such solid, inexpensive Vietnamese food in the Marina of all places. With that said, I've passed by a few times when there was a line out the door, but thankfully I've never had to wait.", "rating": 4, "date": "2016-09-16"}, {"excerpts": ["We ordered the crab paste noodle soup, combo beef pho, and imperial rolls. ", "I was underwhelmed. \n", "Service was great! ", "Both noodle soups arrived quickly, but not piping hot as expected. ", "Though the noodle and meat portions were ample, the broth for both seem a bit bland and under-flavored, especially the beef pho. "], "author": "Cindy T.", "review": "Hailing from the pho wonderland that is Seattle (eg Pho Thân Brothers), I had high expectations coming here.\n\nWe ordered the crab paste noodle soup, combo beef pho, and imperial rolls. I was underwhelmed. \nService was great! Both noodle soups arrived quickly, but not piping hot as expected. Though the noodle and meat portions were ample, the broth for both seem a bit bland and under-flavored, especially the beef pho. I didn't try the imperial rolls, but superficially they didn't seem to hold a candle to Cordon Bleu's on California for consistency and content. \n\nFor pho, I think Turtle Tower still has my heart in SF.", "rating": 3, "date": "2016-06-30"}, {"excerpts": ["I've had the beef pho, vegetable vermicelli plate, chicken pho, and crab paste noodle soup here so far. ", "If you come here for your first time, I would definitely recommend the chicken pho. ", "I'm usually not a fan of chicken pho because I find it to be less flavorful than beef pho, but Ly's chicken pho is so fragrant and flavorful. ", "In fact, I've literally gone here to get chicken pho three times now in the past week and a half that they recognize me now. ", "The beef pho is delicious as well and if you're looking for something heavier, the crab paste noodle soup hits the spot! ", "My least favorite so far was the vegetable vermicelli bowl. ", "It didn't come with the pineapple, lettuce, bean sprout, daikon, carrot, scallion, peanut, and fish sauce like the menu said. ", "It was just vegetables and vermicelli, which was a letdown. "], "author": "Hana K.", "review": "Ly's Vietnamese Cuisine is such a great addition to the Marina. I have an unruly addiction for pho and since there aren't that many good pho places in the Marina (and Asian food in general but that's a story for another time) Ly was my saving grace.\n\nI've had the beef pho, vegetable vermicelli plate, chicken pho, and crab paste noodle soup here so far. If you come here for your first time, I would definitely recommend the chicken pho. I'm usually not a fan of chicken pho because I find it to be less flavorful than beef pho, but Ly's chicken pho is so fragrant and flavorful. In fact, I've literally gone here to get chicken pho three times now in the past week and a half that they recognize me now. The beef pho is delicious as well and if you're looking for something heavier, the crab paste noodle soup hits the spot! My least favorite so far was the vegetable vermicelli bowl. It didn't come with the pineapple, lettuce, bean sprout, daikon, carrot, scallion, peanut, and fish sauce like the menu said. It was just vegetables and vermicelli, which was a letdown. If you're going to eat here, skip everything else and get the pho.\n\nThe food here is authentic (in terms of adapting to the Marina crowd the best it could) and delicious. And their service is fantastic. Their service been impeccable every time I've come here, both picking-up and sitting down. The girls are the front are so sweet and always have the best attitude. It's so hard to come across that in the city!", "rating": 4, "date": "2015-08-28"}, {"excerpts": ["I ordered the crab paste noodle soup, and it was delicious. ", "I never had this super for,  and I was looking for something different and authentic, something that I never had before. ", "I asked for fresh tofu instead of the typical fried tofu that comes with the dish, and the server was happy to make that change for me. ", "I also got it with the extra meatball, even though the waitress had recommended getting it with chicken. ", "But I had a lot of chicken yesterday, so a meatball was a nice change of pace. "], "author": "Andrew D.", "review": "SUMMARY: I would definitely eat here again, or order from here for delivery or pickup!  The food was tasty and well prepared, and the service and wait staff were friendly and helpful.  5 stars for the friendly wait staff and attention to service, and 4 stars for the food!  Plus, it's reasonably priced and affordable.\n\nFull review:\nFour of us came here last night for our monthly get dinner themed \"around the world\" and the letter for this month was V. It was my turn to chose the cuisine and restaurant, so I chose Vietnamese.  Since the local Vietnamese spots serving Dungeness crab are unable to serve crab currently because of the meat's high toxicity, I had to look for other options (I had originally made reservations at PPQ Dungeness). So I chose this spot, Ly's, since it got good reviews and was easy to access for everyone.\n\nLy's was a really good decision, and we all enjoyed it.\n\nWalking in, it was clear that it's a clean space. A member of the wait staff who welcomed us was very friendly and accommodating and sat us down for a 7pm reservation. I ordered the crab paste noodle soup, and it was delicious. I never had this super for,  and I was looking for something different and authentic, something that I never had before. I asked for fresh tofu instead of the typical fried tofu that comes with the dish, and the server was happy to make that change for me. I also got it with the extra meatball, even though the waitress had recommended getting it with chicken. But I had a lot of chicken yesterday, so a meatball was a nice change of pace. Next time I would definitely consider getting it with chicken - not of the meatball wasn't good, but because the friendly waitress said that was the best / most popular preparation.\n\nWe also ordered the spring rolls with pork, which were large and flavorful. Two of my friends the ordered garlic noodles with the filet mignon and with the five spice chicken, and I would definitely consider ordering those in the future. The beef was really tender and tasty, as was the chicken. The fourth member in our party ordered the shrimp, and it was okay.  The steamed broccoli that came with the garlic noodles was good, too.\n\nWe also had the sauteed string beans, which were bit salty but the flavor and texture were good.", "rating": 4, "date": "2015-11-07"}, {"excerpts": ["Today, instead of ordering my standard: the Chicken Pho, which I love, I decided to order the crab paste noodle soup. ", "It is delicious!  ", "A wonderful mix of crab and shrimp paste, ground pork, egg, fried tofu, tomato, shallot, scallion, cilantro, lime, bean sprouts and jalapeno.  ", "Yumm!!  ", "So flavorful with the right amount of texture and heat.  ", "I am definitely going to order this again."], "author": "Ellen F.", "review": "I love this place!  Today, instead of ordering my standard: the Chicken Pho, which I love, I decided to order the crab paste noodle soup. It is delicious!  A wonderful mix of crab and shrimp paste, ground pork, egg, fried tofu, tomato, shallot, scallion, cilantro, lime, bean sprouts and jalapeno.  Yumm!!  So flavorful with the right amount of texture and heat.  I am definitely going to order this again.", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["I enjoyed my crab paste noodle soup and vietnamese iced coffee. ", "Very authentic and great flavors! ", "My husband also enjoyed his rare steak Pho. ", "Will be back when we come back to SF!"], "author": "Kristy C.", "review": "I had a very nice experience here! I enjoyed my crab paste noodle soup and vietnamese iced coffee. Very authentic and great flavors! My husband also enjoyed his rare steak Pho. Will be back when we come back to SF!", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["Was here on their grand opening, ordered the Crab Paste noodle soup, it was actually pretty good. ", "It certainly pack a lot more flavor than the ones I had so far. ", "Would definitely come back and try another dish."], "author": "Dewey H.", "review": "Was here on their grand opening, ordered the Crab Paste noodle soup, it was actually pretty good. It certainly pack a lot more flavor than the ones I had so far. Would definitely come back and try another dish.", "rating": 5, "date": "2015-06-08"}, {"excerpts": ["Four of us ordered imperial roll, Crab paste noodle soup, garlic noodle with five spice chicken, rice with five spice chicken, and grilled shrimp pho.  ", "The Crab paste noodle soup was just okay and vermicilli in it was over cooked.  ", "The grilled shrimps came with the pho were puny, barely 2 inches long scattered sadly in the mostly empty plate.  ", "The portion for the five spice chicken was small and tasted bland.  ", "Then the imperial rolls!  ", "the waiter delivered to the wrong table and did not realize until we asked (the restaurant was not busy at all).  ", "We were almost done with our food when the rolls came and the outside was stale and inside was mushy.  ", "I did not know that one can mess up Vietnamese comfort food this badly.  ", "I don't understand why its rating is so high either. ", "Perhaps they had a bad day when we visited."], "author": "Wes M.", "review": "I love Pho and PPQ in Sunset is where I go to get my fix.  I wanted to give this place a try seeing the high rating on Yelp and I was so disappointed.  Four of us ordered imperial roll, Crab paste noodle soup, garlic noodle with five spice chicken, rice with five spice chicken, and grilled shrimp pho.  The Crab paste noodle soup was just okay and vermicilli in it was over cooked.  The grilled shrimps came with the pho were puny, barely 2 inches long scattered sadly in the mostly empty plate.  The portion for the five spice chicken was small and tasted bland.  Then the imperial rolls!  the waiter delivered to the wrong table and did not realize until we asked (the restaurant was not busy at all).  We were almost done with our food when the rolls came and the outside was stale and inside was mushy.  I did not know that one can mess up Vietnamese comfort food this badly.  I don't understand why its rating is so high either. Perhaps they had a bad day when we visited.", "rating": 1, "date": "2016-09-05"}], "beef satay pho": [{"excerpts": ["I was compelled to write a review because I wanted to steer others to the Beef Satay Pho.  ", "I've never come across this dish before, and it was truly an experience - it was as if some yummy, unchaste pho and a promiscuous bowl of spicy ramen had a quick tryst and the resultant offspring was this beautiful bastard of a meal."], "author": "Raman M.", "review": "Delicious, affordable pho in a modern setting with attentive customer service.\n\nI was compelled to write a review because I wanted to steer others to the Beef Satay Pho.  I've never come across this dish before, and it was truly an experience - it was as if some yummy, unchaste pho and a promiscuous bowl of spicy ramen had a quick tryst and the resultant offspring was this beautiful bastard of a meal.", "rating": 5, "date": "2018-09-04"}, {"excerpts": ["My favorite is the beef satay pho!"], "author": "Alejandro S.", "review": "Such a great hidden gem on Lombard. Super clean and authentic Vietnamese cooking. My favorite is the beef satay pho!", "rating": 5, "date": "2016-12-04"}, {"excerpts": ["Great iced coffee and the Beef Satay Pho was very spicy and very tasty (also very filling)."], "author": "Daniel J.", "review": "Great iced coffee and the Beef Satay Pho was very spicy and very tasty (also very filling).", "rating": 5, "date": "2016-10-07"}], "five spice chicken pho": [{"excerpts": ["I ordered the Five Spice Chicken Pho ($10.75) because it sounded cool ", "I am not sure why this place is called \"Five Spice Chicken Pho"], "author": "Kristina M.", "review": "I don't know if there is something wrong with me, but I felt like this pho place was very very average. I was attracted to this place because of the five star reviews. \n\nI ordered the Five Spice Chicken Pho ($10.75) because it sounded cool and I have never seen five spice chicken inside a bowl of pho before. \n\nWhen I received my food, however, I noticed the five spice chicken was placed on the side and my bowl was literally full of noodles and tons of onions. There were so many fried onions that it made the soup taste very sweet. They were also very overwhelming too. I started picking out the onions just so I can taste the noodles more. \n\nThe chicken was great and was very crunchy on the outside. However, it did not match well with the pho. I am not sure why this place is called \"Five Spice Chicken Pho\" when it should really be \"Pho with Five Spice Chicken on the Side.\"\n\nAlthough the chicken was fine, I probably don't plan to come back.", "rating": 3, "date": "2018-06-09"}, {"excerpts": ["I've only been here once and enjoyed my five spice chicken pho.\n\n"], "author": "Gita r.", "review": "I loved the pho here! I've only been here once and enjoyed my five spice chicken pho.\n\nI could honestly eat that chicken all day. The only thing I would do different is not put my chicken in the soup... I know, I know, you're thinking what's the point of getting chicken pho? However, when you add the five spice chicken to the soup, it recooks the delicious sauce and it takes away from the flavor.\n\nI also would have given this place 5 stars, but then I found hair at the bottom of my soup (once I was done). Not a huge big deal for me, but still a little grossed out when that happens.\n\nI can't wait to try the other dishes! Before I write this review I made the mistake of viewing the other photos from this place and I caught myself drooling... oops.\n\nAlso, as a side note, the staff here are really nice . I probably should have told them about the hair in my soup, I'm sure they wouldn't have been annoyed to bring me another one.", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["We had the five spice chicken pho, which was really flavorful; the tiger shrimp vermicelli, which was delicious; and imperial rolls- bomb as well! ", "Service was pretty awesome for a pho restaurant too- ", "they came about three times to fill up our water cups. ", "My boyfriend was not as impressed as I was but I truly noticed the flavors in their food. ", "Check this spot out if you're in the Marina. ", "AND they had good prices!"], "author": "Dara S.", "review": "I love discovering new tasty pho places. Honestly, it's hard to mess pho up. But I had date night here last week and was pretty blown away. We had the five spice chicken pho, which was really flavorful; the tiger shrimp vermicelli, which was delicious; and imperial rolls- bomb as well! Service was pretty awesome for a pho restaurant too- they came about three times to fill up our water cups. My boyfriend was not as impressed as I was but I truly noticed the flavors in their food. Check this spot out if you're in the Marina. AND they had good prices!", "rating": 5, "date": "2018-01-06"}, {"excerpts": ["I didn't order it, but she was very happy with her five spice chicken pho! ", "I ordered the grilled pork noodles for myself, and it was alright. ", "Pork was pretty salty but noodles were kinda bland, so they balanced each other out. "], "author": "Jenny T.", "review": "Had a friend visiting from Hong Kong and she was craving real Viet pho. I didn't order it, but she was very happy with her five spice chicken pho! I ordered the grilled pork noodles for myself, and it was alright. Pork was pretty salty but noodles were kinda bland, so they balanced each other out. Plate came with fish sauce that wasn't really necessary, but I never say no to fish sauce! \n\nThe location itself is decent too. Parking was available a couple blocks down. Inside is clean and simple - pretty much what you would expect from a Vietnamese restaurant. Probably wouldn't go out of my way to come here, but it's a place I'd feel comfortable taking my traditional Viet parents to.", "rating": 4, "date": "2016-09-22"}, {"excerpts": ["Five Spice Chicken Pho was very flavorful. ", "The chicken was crispy and was a great addition to the Pho. ", "Plenty of noodles and was super filling. "], "author": "Rania T.", "review": "I ordered delivery from Ly's tonight and was very impressed. Here's what I happily stuffed my face with:\n\n-The Five Spice Chicken Pho was very flavorful. The chicken was crispy and was a great addition to the Pho. Plenty of noodles and was super filling. Huge portion as well.\n\n-The Beef Noodles were light and somewhat garlicky. Beef is thin, tender and had a nice grilled flavor.\n\nSide Note: Quick delivery. Estimated time was 45-60 mins, was here in 30. \n\nBoth dishes were outstanding and were great bangs for your bucks. I will be ordering from here next time I'm in the mood for killer noodles and Pho.", "rating": 5, "date": "2016-09-07"}], "grilled tiger shrimp pho": [{"excerpts": ["I got the grilled tiger shrimp pho! ", "Man ", "oh man!! ", "Come here peeps!! ", "Made me feel happy inside!!! ", "Nice hole in the wall and delicious!"], "author": "Maira B.", "review": "Best pho I've ever had!!! I got the grilled tiger shrimp pho! Man oh man!! Come here peeps!! Made me feel happy inside!!! Nice hole in the wall and delicious!", "rating": 5, "date": "2017-02-04"}], "grilled pork garlic noodles": [], "grilled beef garlic noodles": [], "grilled tiger shrimp garlic noodles": [], "fillet mignon shaken beef garlic noodles": [], "shaken tiger shrimp garlic noodles": [], "imperial rolls garlic noodles": [], "seasoned veggie garlic noodles": [], "spiced chicken rice": [], "grilled pork rice": [], "grilled beef rice": [{"excerpts": ["The grilled beef rice plat was good. ", "Good flavor without being overpowered. ", "Cafe sua da ", "was okay. ", "There was a bit of bitterness from the coffee ", "the came through the mild sweetness from the condensed milk. ", "I would come back without hesitation if I'm back in the area."], "author": "Earl M.", "review": "5 spice chicken was good. Flavorful but not spicy hot. The grilled beef rice plat was good. Good flavor without being overpowered. Cafe sua da was okay. There was a bit of bitterness from the coffee the came through the mild sweetness from the condensed milk. I would come back without hesitation if I'm back in the area.", "rating": 5, "date": "2016-05-07"}], "grilled tiger shrimp rice": [], "fillet mignon shaken beef rice": [], "shaken tiger shrimp rice": [], "imperial rolls rice": [], "seasoned veggie rice": [], "spiced chicken vermicelli": [], "grilled pork vermicelli": [{"excerpts": ["I ordered the five spice chicken garlic noodle and the grilled pork vermicelli. \n\n", "The grilled pork vermicelli came with a side of salad. ", "The grilled pork was perfectly flavored and delicious. "], "author": "Andrea G.", "review": "I came here the other day to pick up food to go. I ordered the five spice chicken garlic noodle and the grilled pork vermicelli. \n\nThe five spice chicken garlic noodle cane with steamed broccoli. The chicken was flavorful, the skin was crispy. The noodles were well seasoned and you can taste the buttery flavor. \n\nThe grilled pork vermicelli came with a side of salad. The grilled pork was perfectly flavored and delicious. I actually wish that they provided a little more of the pork. \n\nOverall, I really enjoyed the food here. And I would definitely come back to try other dishes.", "rating": 4, "date": "2018-01-02"}, {"excerpts": ["My boyfriend ordered the grilled pork vermicelli noodle bowl with imperial rolls ($12). "], "author": "Linda X.", "review": "5 stars for the pho here! The beef broth is AMAZING - so rich and doesn't even need any sauce to be added to it. I got the beef pho combo ($10) which came with a generous serving of brisket, meatballs, and rare beef. It only comes in one size but it was more than enough for a meal. The brisket was perfectly tender and fatty. The meatballs were delicious! Next time I'm going to get just beef pho with brisket and meatballs.\n\nThe place itself is pretty large and there was plenty of seating. The service here is ridiculously nice and attentive. The free cucumber water even tastes so refreshing! We also got the spring rolls ($7) which tasted fresh. My boyfriend ordered the grilled pork vermicelli noodle bowl with imperial rolls ($12). It was a solid dish but I would definitely recommend getting the pho instead.\n\nI'm a huge fan of this place!", "rating": 5, "date": "2015-11-26"}], "grilled beef vermicelli": [{"excerpts": ["We ordered shrimp fresh spring rolls, cabbage salad,  grilled beef vermicelli and garlic noodles with 5 spice chicken and all were great! ", "Knocked off a star because I didn't like the thick noodles served with the chicken and the peanut sauce that accompanies the rolls was too runny, but of course it depends on your preference. ", "I highly rec this restaurant!! ", "You will not be dissapointed."], "author": "Noor S.", "review": "Wow!!! I ordered online and my order was delivered within 25 mins!! Reasonable prices, great taste and fast delivery. We ordered shrimp fresh spring rolls, cabbage salad,  grilled beef vermicelli and garlic noodles with 5 spice chicken and all were great! Knocked off a star because I didn't like the thick noodles served with the chicken and the peanut sauce that accompanies the rolls was too runny, but of course it depends on your preference. I highly rec this restaurant!! You will not be dissapointed.", "rating": 4, "date": "2016-04-09"}], "grilled tiger shrimp vermicelli": [], "fillet mignon shaken beef vermicelli": [], "shaken tiger shrimp vermicelli": [], "oz filet mignon shaken beef": [], "shaken tiger shrimp": [], "broccoli with garlic oyster sauce": [], "sauteed string bean": [], "seasoned veggie": [], "house garlic noodle": [], "color drink": [], "pandan leaf waffle": [], "coffee flan": [{"excerpts": ["super crispy!\ncoffee flan - ", "never had it before ", "but I want it again already! "], "author": "Cindy G.", "review": "BEST chicken I've ever had at a Vietnamese restaurant! like for real for real! I'm Vietnamese and I never order chicken cause when beef or pork is a choice, chicken never wins!!! however, I have a kid now and sometimes when her father doesn't order something she can eat, then I have to. with that said, I ordered the garlic noodles with the 5 spice chicken. it was so delicious! the skin was crispy and the chicken was tender and just perfectly cooked! my kid ate most of it but the pieces I did get were amazing!\n\nother things my fam ordered that I tried:\nbeef pho - pretty good! meats tasted high quality and the broth was perfect.\nshaken beef - super tender and good cut of filet mignon\ncrepe - my sister had it without shrimp and I know it would be much better with them but it was still good! super crispy!\ncoffee flan - never had it before but I want it again already! the coffee was nice and strong and the flan was perfect, not to sweet with good texture!\n\nwe ended up here by dumb luck (taking the wrong buses multiple times) and I'm couldn't be happier! would definitely come back when we visit SF again!", "rating": 5, "date": "2015-09-13"}, {"excerpts": ["I love love love the coffee flan..brings me back to my travels to Vietnam.  ", "A must try if you're in the area."], "author": "Belle P.", "review": "Pho and shrimp papaya salad are two of my favorite entrees here.  I love love love the coffee flan..brings me back to my travels to Vietnam.  A must try if you're in the area.", "rating": 4, "date": "2016-07-06"}, {"excerpts": ["Coffee Flan. ", "All equals a happy customer!"], "author": "Richard R.", "review": "Five Spice Chicken. Potstickers. Thai Iced Tea. Coffee Flan. All equals a happy customer!", "rating": 5, "date": "2016-04-02"}], "salted plum soda": [], "strawberry lemonade": [], "virgin lychee mojito": [], "berry refresher": [], "tasco young coconut juice with pulp": []}