{"hot blossoming flower tea": [], "house combination appetizer": [], "veggie spring egg roll": [], "pork and shrimp wonton": [], "veggie pot sticker": [], "napa cabbage and pork dumpling": [{"excerpts": ["Napa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\n"], "author": "Sig S.", "review": "I love this place. They're located just up the block from my apartment so my roommate and I order from them quite frequently. Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\nNapa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\nEgg Custard Buns\n\nMy only request would be that they get some better lettuce for the lettuce wraps - sometimes it is hard to actually make a wrap with it. Other than that, everything has always been great! Definitely the best Chinese delivery in the neighborhood!", "rating": 5, "date": "2015-12-09"}], "napa cabbage and chicken dumpling": [], "green chives and pork dumpling": [], "parsley and lamb dumpling": [], "veggie dumpling": [], "shanghai soup dumpling": [], "baked bbq pork bun": [], "steamed egg custard bun": [], "chicken shu mai dumpling": [], "pan fried pork bun": [], "hong kong style sweet egg tart": [], "taiwan style sweet red bean cake": [], "sizzling rice and seafood soup": [], "mashed chicken and sweet corn soup": [], "chicken with fried rice": [], "beef with fried rice": [], "bbq pork with fried rice": [], "prawn with fried rice": [], "veggie combo with fried rice": [], "house combo with fried rice": [{"excerpts": ["Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\n"], "author": "Sig S.", "review": "I love this place. They're located just up the block from my apartment so my roommate and I order from them quite frequently. Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\nNapa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\nEgg Custard Buns\n\nMy only request would be that they get some better lettuce for the lettuce wraps - sometimes it is hard to actually make a wrap with it. Other than that, everything has always been great! Definitely the best Chinese delivery in the neighborhood!", "rating": 5, "date": "2015-12-09"}], "seafood combo with fried rice": [], "beef tomato in sweet and sour sauce with fried rice": [], "prawn bbq pork singapore curry sauce with fried rice": [], "prawn calamari pineapple in bbq sauce with fried rice": [], "mixed vegetables deluxe": [], "buddhas feast": [], "broccoli and mixed mushrooms": [], "fried green beans": [{"excerpts": ["Chicken with Orange Sauce\nFried Green Beans\n\nWasn't a big fan of the red bean dessert nor the hot & sour soup, but that seems to be really popular amongst Yelp reviewers."], "author": "cassy f.", "review": "Ordered delivery for the 2nd time and I think this will become my go-to Chinese delivery place. Friendly delivery and the food is spot on. Items I liked:\nFried Radish Cake \nSeafood Combo with Fried Egg Noodle\nChicken with Orange Sauce\nFried Green Beans\n\nWasn't a big fan of the red bean dessert nor the hot & sour soup, but that seems to be really popular amongst Yelp reviewers.", "rating": 4, "date": "2016-08-15"}, {"excerpts": ["The  fried green beans were over cooked and a bit too salty for my taste. ", "We wouldn't have minded if it was a cheap hole in the wall "], "author": "Danny O.", "review": "We came here because we were looking for soup dumplings, but we left very disappointed. The soup dumplings were dry and had almost no soup in them. The Singapore noodles were also very dry with clumps of sauce and over cooked meat. The  fried green beans were over cooked and a bit too salty for my taste. We wouldn't have minded if it was a cheap hole in the wall but it was pretty expensive compared to similar restaurants.\n\nOn the plus side the server was nice and they have good blossoming flower tea. Maybe it was on off night as it currently has very good reviews but I would suggest trying somewhere else.", "rating": 2, "date": "2014-06-29"}], "egg bean curd with tender greens": [{"excerpts": ["I definitely recommend the Seafood Combo with Fried Flat Noodle and Egg Bean Curd with Tender Greens. ", "The sauce for the egg bean curd can be a bit salty though, but good with rice. ", "This is definitely my go-to spot for Chinese food."], "author": "Evelyn C.", "review": "This review is for delivery only. I have not dined in at the restaurant, yet.\n\nLet me start by saying I'm Chinese and don't particularly like Chinese food, but I do have some staples I occasionally crave. Please, no judgments. =) This place has changed my mind. Delicious, on time, cooked very well. They have also paid attention to all my picky special instructions and have made it happen. I definitely recommend the Seafood Combo with Fried Flat Noodle and Egg Bean Curd with Tender Greens. The sauce for the egg bean curd can be a bit salty though, but good with rice. This is definitely my go-to spot for Chinese food.", "rating": 5, "date": "2016-06-06"}], "chicken and tofu with salted fish sauce": [], "beef and vermicelli with bbq sauce in clay pot": [], "braised tofu in clay pot": [], "seafood combination in clay pot": [], "bok choy": [{"excerpts": ["I always order the lamb dumplings, the baby bok choy, the fried chicken wings, and the beef noodle soup. ", "I also enjoy the jasmine flower tea, which is incredibly fragrant!"], "author": "Tiffany X.", "review": "This is hands down my favorite restaurant in San Francisco. I come here regularly with my good friends to celebrate and eat delicious authentic Chinese food. The service is incredibly friendly and the owners are wonderful.\n\nI always order the lamb dumplings, the baby bok choy, the fried chicken wings, and the beef noodle soup. I also enjoy the jasmine flower tea, which is incredibly fragrant!", "rating": 5, "date": "2017-10-20"}, {"excerpts": ["Bok Choy - okay, most Americans would not see this vegetable and tell you it's Bok Choy.  ", "So I'd be careful with the labeling.  ", "And also where's the FLAVOR?  "], "author": "Morgan C.", "review": "Super disappointed after ordering $50 and 6 dishes.  was so hoping to make this my go-to Chinese restaurant but sadly another disappointment.\n\nThe good -\n$0 delivery (so I tipped well)\nsuper fast\n\nThe bad -\nThe food.  One of the worst Chinese food I've had in Sf, period.  \nSteamed Pork with chives dumplings - the only dish w decent taste decent but some of the wrappers were dark? Looks pre-cooked and reheated maybe.  \n\nThe fried spare ribs - the meat had a FOUL taste.  what the fuck.  I sniffed it after I took a bite. I plan to toss the rest out.  Don't feel safe eating it.  \n\nString beans - it was soggy and fried with preseved vegetables?  Zhai Cai for those who Speak Chinese.  It's like the spam of vegetables, loaded with preservatives.  I've never had string beans with this in China or anywhere in the U.S. I love the dried, black beans or garlic infused string beans common at Sichuan places.  This is the worst version I've seen.  \n\nBok Choy - okay, most Americans would not see this vegetable and tell you it's Bok Choy.  So I'd be careful with the labeling.  And also where's the FLAVOR?  It tastes like steamed vegetables with some garlic bits sprinkled over it.\n\nThe beef westlake soup - $11 for a not even a full cup of soup that has just egg white and some ground beef?  The broth is bland and worse than my canned Chicken broth.  You are kidding me?  This is worst than food in a food court and you charge $11 for that?  where's the vegetables in this soup?  the traditional recipe has usually watercress in it. \n\nThe fried pot stickers came for free.  I didn't order it but it was way over fried and tastes like frozen dumplings that were freezer burnt from my own freezer.  I can't believe you'd charge $8 for this.\n\nonly good was the fortune cookie b/c the message.. hopefully it's true. \n\nso sad.  will have to try yet another Chinese restaurant on yelp24.  the hunt continues", "rating": 2, "date": "2017-07-22"}, {"excerpts": ["We ordered the pan fried buns (sheng jian bao) and steam bbq buns (cha shao bao) along with the mongolian chicken chow fun with bok choy. ", "The pan fried buns were very dry and I'm pretty sure they had previously been frozen and were not heated up properly. ", "I told the waitress and she ended up cancelling this order. "], "author": "Dora T.", "review": "Was looking for a good Chinese food place in the area and was honestly pretty disappointed with Makli. We ordered the pan fried buns (sheng jian bao) and steam bbq buns (cha shao bao) along with the mongolian chicken chow fun with bok choy. The pan fried buns were very dry and I'm pretty sure they had previously been frozen and were not heated up properly. I told the waitress and she ended up cancelling this order. At least she was understanding and the service was friendly.\n\nThe noodles were pretty good, although not exactly authentic. The portions were large so that was nice and we got the free pork pot stickers from the Yelp Check-In offer. I think this place is good if you're really in a bind and want some Chinese food but I don't think I would come back if I was looking for something authentic.", "rating": 3, "date": "2017-07-24"}, {"excerpts": ["Highly recommend: lamb dumplings, bok choy, beef noodles. ", "Also the \"mei li hua tea\" is everything you need after a long day.  ", "Also service is unreal /  best people ever. ", "Seriously dont leave SF w/o dropping by Makli!!"], "author": "Ariel K.", "review": "This is my all time favorite restaurant in San Francisco. Highly recommend: lamb dumplings, bok choy, beef noodles. Also the \"mei li hua tea\" is everything you need after a long day.  Also service is unreal /  best people ever. Seriously dont leave SF w/o dropping by Makli!!", "rating": 5, "date": "2017-10-20"}, {"excerpts": ["Had other unmemorable dishes like bok choy. ", "Normally when we order Chinese takeout we have very little leftover ", "but this time people didn't eat much. ", "Won't be ordering again from here. ", "Don't know what happened given the high reviews!"], "author": "Elizabeth D.", "review": "We had guests over for Sunday dinner to watch a TV show tonight and everyone left with a terrible stomach ache after we got delivery from Makli! We had two orders of the General Tso's Chicken thinking it'd be decent and we wanted there to be enough to go around but we had over one full container left because no one liked it. It was all mostly mushy breading with lots of pieces with no chicken inside. One guest even asked if it really was chicken because she swore it was fish because the inside was mushy in texture and fishy in flavor. The honey scallops were a joke...people laughed because there were like a total of 7 tiny gum-drop sized scallops swimming in soy sauce. The dish was like $12. Mongolian beef was crazy salty with thinly sliced green peppers that were so wilted from being drenched in soy sauce. Seafood clay pot had so many broken pieces of bean curd, it looked unappetizing and was overall not tasty...just seemed not freshly made compared to other restaurants. Had other unmemorable dishes like bok choy. Normally when we order Chinese takeout we have very little leftover but this time people didn't eat much. Won't be ordering again from here. Don't know what happened given the high reviews!", "rating": 1, "date": "2017-08-13"}, {"excerpts": ["Excellent prawns with bok choy and the fried rice was superb.  ", "Nice amounts of pork, egg and scallion without being oily at all.  ", "If anything the portions could have been a little larger."], "author": "Aaron D.", "review": "Excellent prawns with bok choy and the fried rice was superb.  Nice amounts of pork, egg and scallion without being oily at all.  If anything the portions could have been a little larger.", "rating": 4, "date": "2016-05-30"}], "chicken with lettuce cup": [{"excerpts": ["Napa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\n"], "author": "Sig S.", "review": "I love this place. They're located just up the block from my apartment so my roommate and I order from them quite frequently. Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\nNapa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\nEgg Custard Buns\n\nMy only request would be that they get some better lettuce for the lettuce wraps - sometimes it is hard to actually make a wrap with it. Other than that, everything has always been great! Definitely the best Chinese delivery in the neighborhood!", "rating": 5, "date": "2015-12-09"}], "peking duck buns": [{"excerpts": ["I was starving, so I dug into the Peking Duck Buns: Peking-style roasted duck wrapped in Chinese soft bun. ", "They were room temp, but I didn't care. ", "The duck had nice flavor, though I like my buns with more green onion and hoisin sauce. ", "I later had another heated up and it helped with the hardness of the bun. ", "Made if softer and fluffier. ", "I went online to look at their menu and price wise, it looks like it's $12 for 4 buns? ", "A little pricey for my taste. ", "I'd rather just get a whole order. ", "And give me the whole duck. ", "Not just the outside part used for the buns. "], "author": "Elena N.", "review": "I was at a birthday party. Part of the spread was some chinese food. We arrived at the party on Saturday, May 12th around 5pm.\n\nI was starving, so I dug into the Peking Duck Buns: Peking-style roasted duck wrapped in Chinese soft bun. They were room temp, but I didn't care. The duck had nice flavor, though I like my buns with more green onion and hoisin sauce. I later had another heated up and it helped with the hardness of the bun. Made if softer and fluffier. I went online to look at their menu and price wise, it looks like it's $12 for 4 buns? A little pricey for my taste. I'd rather just get a whole order. And give me the whole duck. Not just the outside part used for the buns. (I know it's not the norm, but we always ask for it at family dinners.)\n\nPretty good buns. Just a little too rich for my blood.", "rating": 3, "date": "2018-05-20"}, {"excerpts": ["Have enjoyed every dish I've tried - favorites include dumplings, peking duck buns and general's chicken. ", "Best delivery option in the neighborhood."], "author": "John C.", "review": "Consistently good, fast and convenient take-out or delivery. Have enjoyed every dish I've tried - favorites include dumplings, peking duck buns and general's chicken. Best delivery option in the neighborhood.", "rating": 4, "date": "2014-07-06"}], "combination seafood with greens": [], "prawns with walnuts": [{"excerpts": ["We ordered the Clay Pot Bean Curd, Prawns with Walnuts and BBQ Pork Fried Rice.  ", "The fried rice had really good \"wok hei\" (wok fire or char from the wok), their Clay Pot Bean Curd should perhaps be better described as Sizzling Hot Plate Bean Curd ", "- it was nice and perfectly crisped on the outside and silky smooth on the inside.  ", "Prawns with Walnuts - loved the candied walnuts and the well-executed deep-fried prawns coated with mayo.  "], "author": "Nik T.", "review": "Excellent Cantonese food! Hard to find in SF in general and even harder to find in the Mission/Castro! \n\nWe ordered the Clay Pot Bean Curd, Prawns with Walnuts and BBQ Pork Fried Rice.  The fried rice had really good \"wok hei\" (wok fire or char from the wok), their Clay Pot Bean Curd should perhaps be better described as Sizzling Hot Plate Bean Curd - it was nice and perfectly crisped on the outside and silky smooth on the inside.  Prawns with Walnuts - loved the candied walnuts and the well-executed deep-fried prawns coated with mayo.  (We were ordering to entice our 3-year old toddler to eat!) \n\nEverything was made fresh and was delicious!  Clearly an accomplished and experienced chef!", "rating": 5, "date": "2013-07-14"}], "honey and pepper scallops": [], "cod fillet with black bean sauce": [{"excerpts": ["The cod fillet with black bean sauce is delicious, as is the sweet and sour chicken. \n\n"], "author": "Tadhg O.", "review": "I love coming to Makli - the best Chinese restaurants in SF! \n\nAll of the food gets top marks - comes out piping hot and full of fresh vegetables. The cod fillet with black bean sauce is delicious, as is the sweet and sour chicken. \n\nI don't know what dumplings to recommend the most because they are all so good! I'm trying more of them every time I go but a top favorite of mine is the BBQ pork buns! \n\nAlso, the service is great! Amanda is so sweet, very attentive and kind! My girlfriend and I love seeing her whenever we go there. See you very soon!", "rating": 5, "date": "2018-10-24"}], "tender spare ribs with coffee sauce": [], "kiang ton spare ribs": [], "kung bow chicken": [{"excerpts": ["The Kung Bow chicken was too slimy, too heavy on water chestnuts (maybe that's just a matter of personal preference, but we're talking 1:1 chicken/chestnut ratio), and over-salted. \n\n"], "author": "Andrew D.", "review": "I really didn't care for my delivery for Makli. \n\nThe Kung Bow chicken was too slimy, too heavy on water chestnuts (maybe that's just a matter of personal preference, but we're talking 1:1 chicken/chestnut ratio), and over-salted. \n\nThe Combination Fried rice was short on flavor, and seemed like something I could have whipped up at home. I had to fish through the bits of pork to find good ones...there were lots of fatty bits. \n\nFinally, the chive-pork dumplings were pretty slimy and the dipping sauce was over-vinegary and clashed with the dumplings.\n\nI am being generous with stars because the delivery was prompt and friendly and the price was reasonable, but I won't be returning soon.", "rating": 3, "date": "2014-07-06"}, {"excerpts": ["They have a wide variety of dumplings, their deep fried chicken wings are out of this world, their kung bow chicken is a great dish to take out, and their mushu pork is always made perfectly.\n\n"], "author": "Samantha K.", "review": "Makli is the authentic Chinese restaurant I've been looking for since I moved to San Francisco!\n\nThey have a wide variety of dumplings, their deep fried chicken wings are out of this world, their kung bow chicken is a great dish to take out, and their mushu pork is always made perfectly.\n\nThe owner Sam is simply wonderful.  He is attentive to every patron, and so helpful.\n\nThis is also a great place for takeout.  The food is ready in less than 10 minutes most of the time and it's such a nice, calm atmosphere, you wouldn't even mind if it took longer.", "rating": 5, "date": "2013-11-23"}], "chicken with cashew nuts": [], "chicken with lemon sauce": [], "chicken with orange suace": [], "chicken with curry sauce": [{"excerpts": ["Try the chicken with curry sauce or the Mongolian beef or general tsos chicken.  ", "You won't go wrong.  ", "The flowering jasmine tea is an amusement ride in its own.  ", "The jasmine flowering in your the hot water is gorgeous.  ", "If be remiss if I didn't mention the amazing sincere service.  ", "The staff is so friendly and accommodating it's refreshing.  ", "I left my coat at the table and the super sweet server chased me down the street to give it to me."], "author": "Tom F.", "review": "This place is a neighborhood gem.  The food is super savory.  Try the chicken with curry sauce or the Mongolian beef or general tsos chicken.  You won't go wrong.  The flowering jasmine tea is an amusement ride in its own.  The jasmine flowering in your the hot water is gorgeous.  If be remiss if I didn't mention the amazing sincere service.  The staff is so friendly and accommodating it's refreshing.  I left my coat at the table and the super sweet server chased me down the street to give it to me.", "rating": 5, "date": "2015-06-13"}], "prawn with bok choy": [], "cod fillet with cream corn sauce": [], "cod fish with pine nut": [], "beef with greens and dried seafood sauce": [], "deep fried seafood combo and tofu": [], "deep fried chicken wing": [], "deep fried prawn": [], "deep fried scallop": [], "deep fried cod fillet": [], "deep fried sparerib": [], "house combo": [{"excerpts": ["Everything was on point from the perfectly crispy general tso's chicken to the amazing house combo fried rice with tender chicken. ", "I will be back here!!"], "author": "Todd B.", "review": "Some of the best Chinese food I've encountered in SF. Everything was on point from the perfectly crispy general tso's chicken to the amazing house combo fried rice with tender chicken. I will be back here!!", "rating": 5, "date": "2017-06-24"}, {"excerpts": ["Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\n"], "author": "Sig S.", "review": "I love this place. They're located just up the block from my apartment so my roommate and I order from them quite frequently. Some of our go-to's include:\nChicken with Orange Sauce\nGeneral Tso's\nHouse Combo with Fried Rice\nNapa Cabbage and Pork Dumpling\nChicken with Lettuce Cup\nEgg Custard Buns\n\nMy only request would be that they get some better lettuce for the lettuce wraps - sometimes it is hard to actually make a wrap with it. Other than that, everything has always been great! Definitely the best Chinese delivery in the neighborhood!", "rating": 5, "date": "2015-12-09"}], "chicken mongolian sauce": [], "beef tomato in sweet and sour sauce": [], "prawn bbq pork singapore curry sauce": [], "prawn calamari pineapple in bbq sauce": [], "won ton": [{"excerpts": ["Continuing our dumpling theme, we shared an $8 bowl of the Wor Won Ton Soup, which turned out to be almost as good as Eric's, our favorite maker of won ton soup in the city. "], "author": "Ed U.", "review": "I'm sure there's some intriguing back story behind why this Chinese place has the same name as an ancient necropolis in Pakistan, but I didn't bother asking the server who was a cheery girl who couldn't have been more than 18. Jamie W. and I ended up here by accident after the Pride festivities in the Castro where we were celebrating the SCOTUS ruling on same-sex marriage. It appeared everyone else at the event was looking for places to eat, so we ducked into this low-key restaurant on the corner of 15th and Sanchez. I remember when this was the middling Daimaru Sushi before, but now it's a fairly standard Chinese restaurant among several in the general neighborhood like House of Chen and Red Jade.\n\nOur timing was good because only one other table was occupied, but it started to fill up quickly as our meal progressed. We noticed there was a lengthy list of dim sum options, so we ordered the $7 Green Chives and Pork Dumplings, a half-dozen of them steamed and filled with ground pork and chives (photo: http://bit.ly/1UDD82I). They were tender, piping hot and quite delicious with that burst-in-your-mouth savoriness we both liked. Continuing our dumpling theme, we shared an $8 bowl of the Wor Won Ton Soup, which turned out to be almost as good as Eric's, our favorite maker of won ton soup in the city. It contained pork and shrimp dumplings, snow peas and carrots in a light broth (photo: http://bit.ly/1IVnvx1).\n\nWe were pretty happy with our dinner so far, but our experience declined precipitously when the $11 Mu Shu Pork arrived. It had all the standard ingredients - stir-fried eggs, pork, cabbage, bamboo shoots, and shiitake mushrooms - but it was saturated in a heavy soy-hoisin sauce that made the entire mix too salty to eat with any satisfaction (photo: http://bit.ly/1NmPX2q). That was a shame since the crepes were prepared nicely with just enough give to allow easy wrapping of the mu shu mixture. We ended up eating a lot of our dollar bowls of Brown Rice to soak up the sauce (photo: http://bit.ly/1JONfwK). In hindsight, we probably would have preferred a more predictably crunchier dish like General Tso's Chicken to fill our palates. But hey, two out of three ain't bad.\n\nFOOD - 3 stars...starts out well with the dumplings and then falls down with the mu shu\nAMBIANCE - 3.5 stars...nice enough inside if rather compact\nSERVICE - 3.5 stars...our server was quite attentive and energetic\nTOTAL - 3 stars...stick with the dim sum and you will likely not be as disappointed as us", "rating": 3, "date": "2015-09-07"}, {"excerpts": ["The pork and shrimp won ton were not bad at all--the dipping sauce however was a bit bland.\n\n"], "author": "Thomas D.", "review": "The pork and shrimp won ton were not bad at all--the dipping sauce however was a bit bland.\n\nService was great and there are many items to choose from on their menu.  We opted for the House Special Combination Rice Noodle and a chicken/broccoli dish with rice on the side.\n\nPortions are generous but we felt that both dishes were lacking in flavor--especially the rice noodle dish.    I would like to return and try other dishes.\n\nSapporo and Tsing Tao were our choices of beer.", "rating": 3, "date": "2015-04-17"}, {"excerpts": ["Won Ton Soup was a bit salty and the preparation is different than options I'm used to in other places. ", "Typically I usually order Pork Wonton soup where pork is separate from beef dumplings. "], "author": "Dale M.", "review": "The positives: Ordering was smooth and delivery within 40 minutes. Easy to read computer printed receipt. Plastic lid packaging of food. Food orders were not bad. Tomato Beef Chow Mein was best dish.\n\nThe rest: Won Ton Soup was a bit salty and the preparation is different than options I'm used to in other places. Typically I usually order Pork Wonton soup where pork is separate from beef dumplings. Mongolian beef not very spicy and beef was not very good. \n\nTo summarize not a horrible experience but mediocre and for the expense of this kind of food these days I will not order twice from a place that is average at best.", "rating": 2, "date": "2016-07-04"}, {"excerpts": ["We had the won ton flat (rice) noodle soup, pot stickers, and some egg tarts. ", "All of which was tasty, but I'll definitely be craving the won ton soup again! ", "Delicious noodle goodness. ", ":) ", "Thanks!"], "author": "Ken K.", "review": "Great find hidden in the neighborhood. We had the won ton flat (rice) noodle soup, pot stickers, and some egg tarts. All of which was tasty, but I'll definitely be craving the won ton soup again! Delicious noodle goodness. :) Thanks!", "rating": 4, "date": "2015-11-07"}], "steamed white rice": [{"excerpts": ["I think the best tasting dish we had was the steamed white rice. \n", "Ordered green onion pancakes. ", "Decent but not memorable. \n", "Hot and sour soup - I think was made with ketchup! ", "Literally. ", "It's reddish orange in color and has that very familiar ketchup flavor. \n", "Mushu pork was ok. ", "Not much flavor. \n", "Beef and broccoli - disappointing. "], "author": "Ed P.", "review": "Ordered delivery based on the other 4star reviews. \n\nI think the best tasting dish we had was the steamed white rice. \nOrdered green onion pancakes. Decent but not memorable. \nHot and sour soup - I think was made with ketchup! Literally. It's reddish orange in color and has that very familiar ketchup flavor. \nMushu pork was ok. Not much flavor. \nBeef and broccoli - disappointing. Very poor quality ingredients in my opinion. \n\nHad high hopes. Wish it had been a different story.", "rating": 2, "date": "2017-02-08"}]}