{"roti wrap  rolls": [], "salmon  cheese gyozas": [], "spicy baked mussels": [], "grilled beef wrapped fungi rolls": [], "appetizer sampler": [], "fruit  nuts salad": [], "fried egg  mushroom salad": [], "thai chicken salad": [{"excerpts": ["We ordered Thai Chicken Salad, a White sauce pasta with chicken and mushrooms, and a sweet red bean desert. ", "The food here is great. ", "Very good and homie HK/JPN style Asian fusion. "], "author": "Lance C.", "review": "My girlfriend took me here last night. We ordered Thai Chicken Salad, a White sauce pasta with chicken and mushrooms, and a sweet red bean desert. The food here is great. Very good and homie HK/JPN style Asian fusion. Not American Asian fusion, which I don't like much.  \n\nThe place is small, but that must be why they can keep up with the good cooking. I will have to try more of their deserts next time.\n\nCustomer service is good, too. Based on my girlfriend, they hired more servers so maybe that's why I didn't feel the bad services other yelpers mentioned before. \n\nWill come again for sure.", "rating": 5, "date": "2009-08-29"}], "mango salad": [{"excerpts": ["They not only sell desserts but also entrees like fried rice, noodles, and mango salad with prawns! ", "Lots of MANGO stuff "], "author": "Juliane N.", "review": "After a LONG day running around to places, I met up my friend Annie to come here and grab some dessert. It was pretty packed at 1030 on a Wednesday! I wanted to sit on those comfy looking seats but it was all taken so the only seat left was near the door, which I always hate sitting near the door! \n\nIt took seriously forever for service. Actually, I had to go grab menus for myself, then I had to go grab a waitress so we can order, then one dessert came out and 10-15 minutes later, the next came out so the first one was just sitting there.\n\nWe ordered the Mango Medley, fresh mangoes, grapefruit and mango juice and puree and mango sticky rice. Pretty good but not as sweet as I  would like it. But, while it was sitting there, I could just smell the mango aroma!!! I just couldn't keep my eyes of it. I felt bad cuz my friend was talking to me while I was just staring at the dessert wanting to eat it.. =(\n\nWe also ordered the Mixed fruit panna cotta with mixed fresh fruit on top. Panna cotta was actually really good. Good smooth texture with the perfect amount of sweetness. Loved it. Although the fruit wasn't sweet at all, the mango sauce made up for it when you eat it all together.\n\nThey not only sell desserts but also entrees like fried rice, noodles, and mango salad with prawns! Lots of MANGO stuff but it IS called Mango Medley. \n\nI'll probably come again to try something else..", "rating": 3, "date": "2008-08-21"}, {"excerpts": ["1/2 star to the mango salad with prawns. ", "I mean how hard can it be to prepare. "], "author": "Marcia O.", "review": "Way overrated. my spinach noodles with shrimp and basil was absolutely horrible. I couldn't figure out if its italian or chinese or thai or even a good fusion....yucks. \n\n1/2 star to the mango salad with prawns. I mean how hard can it be to prepare. 1/2 star to the mango crepe which was decent. \n\nother dishes were mediocre and a friend's exotic mushroom rice dish was disgusting. \n\nWay to overpriced. ($8 on average for a dish) Service was slow and i swear the server was also the cook. there was no one else around! We peaked into the kitchen!!!", "rating": 1, "date": "2007-05-07"}, {"excerpts": ["i was serving my friend and myself hot tea the whole time while waiting for more than 20mins for some mango salad, then another 20 mins for pineapple fried rice and stopped counting after that for the dessert.  ", "All together a good HOUR+ for all the food to come.  "], "author": "Anna W.", "review": "i dont want to give this place a bad review but i gotta say, there's no CUSTOMER serivce here, food is just alright. i was serving my friend and myself hot tea the whole time while waiting for more than 20mins for some mango salad, then another 20 mins for pineapple fried rice and stopped counting after that for the dessert.  All together a good HOUR+ for all the food to come.  No one greets you when you walk in, NO one sits you, and after sitting there for more than 15 mins, if you don't make note to them that you're ready, No one will take your order.  \n\nBut i guess its a good place if you just wanted to sit and relax, talk to your friends and had nothing better to do and hopefully not too hungry.", "rating": 2, "date": "2008-09-23"}, {"excerpts": ["Shared a mango salad with shrimp(little raw). ", "They should simplify their menu or improve their cooking techniques.  ", "Without quality, forget the rest of the dishes."], "author": "Jer W.", "review": "Tonight had their pork chop and it sucks, because the meat did not marinate/absorb the salt,pepper,etc,just bland----my parents can cook better than them.  Shared a mango salad with shrimp(little raw). They should simplify their menu or improve their cooking techniques.  Without quality, forget the rest of the dishes.", "rating": 1, "date": "2009-05-24"}, {"excerpts": ["The only dish I can recommend is the Spicy Mango Salad with Prawns. ", "That was pretty good. "], "author": "Eleonore L.", "review": "The food is just okay. Nothing special. Somewhat boring. The only dish I can recommend is the Spicy Mango Salad with Prawns. That was pretty good. The other two dished we ordered were Thai Sauce Spaghetti with Chicken and Fresh Pineapple Baked Riced. The Pineapple was indeed fresh but besides that, the dished were kind of unimpressive.", "rating": 3, "date": "2008-12-06"}], "teriyaki chicken  vegetables": [], "tamarind chicken  vegetables": [], "caramel prawns pork chicken  broccoli": [], "dried scallop  egg white fried rice": [], "spaghetti": [{"excerpts": ["Think about it this way; if one person at the table orders baked spaghetti, another orders fried rice, another orders soup, and the other orders clay pot, how many simultaneous pots/pans will she be having to deal with at the same time? "], "author": "Brittany L.", "review": "When I first walked by this place, I couldn't believe a restaurant could fit into this space. This small, homey restaurant feels just like being in someone's living room, with eclectic decorations and mix-and-match furniture. The someone, though, is someone who makes super fresh and super delicious Asian food.\n\nPlease be kind to the owner, Eugenie. It's a wonder how one can play all the roles of a restaurant without getting frazzled. Yes, the wait will be horrendously long, but can you imagine having to handle multiple stove burners, ovens, blenders, and whatnot all by yourself? Think about it this way; if one person at the table orders baked spaghetti, another orders fried rice, another orders soup, and the other orders clay pot, how many simultaneous pots/pans will she be having to deal with at the same time? Then imagine that times 5(?) for the number of tables in the restaurant. \n\nThe wait is super worth it though. If you come ~5pm you may be one of the first groups there and will have less of a wait. The food was tasty, well-portioned, and fresh. I saw all the photos of the entrees topped with melted cheese and I knew I had to be there. It definitely did not disappoint! This isn't some food that is quickly slapped together; most of these dishes do require intensive preparation!\n\nDefinitely enjoyed coming here and recommend it, but eat a small snack beforehand if you're starving! And order dessert at the same time you order your entrees.", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["I was surprised to be eating spaghetti, LOL. ", "We ordered the spaghetti bolognese, a vegetable curry with rice, and the clam cream sauce with rice. ", "For dessert, we had mango pillows and a sesame paste + tofu bowl. ", "The spaghetti was pretty good and I finished mine quickly. ", "The rice dishes seemed\nenormous. ", "I want to go back to try the spaghetti with the meat leg everyone's posting about. ", "The pillows were good as well. ", "It was my first time trying the sesame paste and I liked it! ", "I guess I expected something more Asian ", "They didn't come back to take the order until 25 minutes later, and had said they also ran out of spaghetti (the rest of us were already eating by this time). ", "My friend had to settle for rice and ended up eating when we all had finished. ", ":/ ", "When they brought the plate out, they had the nerve to say \"You ordered late, expect it late.", "\" ?"], "author": "Michelle V.", "review": "I was so excited to try this restaurant because my friend swore on its authenticity to Hong Kong food and it was her absolute favorite place.\n\n was weary of the place at first because of all the negative reviews of the server but she was nice to us! On a Monday night at 7pm, the place was initially packed but everyone seemed to leave at once and it was very quiet. The prices were on the higher side. \n\nI was surprised to be eating spaghetti, LOL. We ordered the spaghetti bolognese, a vegetable curry with rice, and the clam cream sauce with rice. For dessert, we had mango pillows and a sesame paste + tofu bowl. The spaghetti was pretty good and I finished mine quickly. The rice dishes seemed\nenormous. I want to go back to try the spaghetti with the meat leg everyone's posting about. The pillows were good as well. It was my first time trying the sesame paste and I liked it! I guess I expected something more Asian but my friend said the influences Hong Kong had experienced had led to this. \n\nThere was only one server working and things got a bit slow. The bathroom broke after one person used it. Something negative is that a friend of ours wanted the Portuguese dish, and they ran out, so she took more time to look at the menu. They didn't come back to take the order until 25 minutes later, and had said they also ran out of spaghetti (the rest of us were already eating by this time). My friend had to settle for rice and ended up eating when we all had finished. :/ When they brought the plate out, they had the nerve to say \"You ordered late, expect it late.\" ??? imig\n\nWe ended up paying like $20 per person and honestly, I can get better food for $20 but it was nice to hang out with my friends. We stayed another 20 minutes after finishing to wait for a bus and they didn't kick us out of anything.\n\nMaybe I'll come again if I'm in the area but this place was not 4 or 5-star material.", "rating": 3, "date": "2016-12-20"}, {"excerpts": ["I got the baked chicken spaghetti and it was delicious. ", "I drank the chocolate chai and had the cream pillows for dessert and everything was fantastic. ", "The atmosphere is homey and quirky and the person who served us was super nice. ", "I will definitely be coming back!!"], "author": "sara w.", "review": "The best Thanksgiving meal I've ever had!! I got the baked chicken spaghetti and it was delicious. I drank the chocolate chai and had the cream pillows for dessert and everything was fantastic. The atmosphere is homey and quirky and the person who served us was super nice. I will definitely be coming back!!", "rating": 5, "date": "2017-11-23"}, {"excerpts": ["Kimchi fried rice- good but kind of on the sweet side \nMushroom cream clam spaghetti thing- not much flavor\n", "Baked mussels- yum! \n"], "author": "Kimmy N.", "review": "My boyfriend has been trying to eat here with me for a while now and tonight I finally gave it a chance. It's Sunday night and we came in with a friend of ours at 10:45. Got seated pretty quickly since there were only 2 other parties in the restaurant. Mind you, with that being said it was a full house in there. Super small dining area, about 4-5 tables that accommodate parties of 6 or less. I read the reviews so I knew what I was getting into. To be honest if your patient enough it's really not a terrible time. To some the policies may be outrageous, but to me they were hilarious lol. You can't expect much coming into a local dessert spot like this. \n\nKimchi fried rice- good but kind of on the sweet side \nMushroom cream clam spaghetti thing- not much flavor\nBaked mussels- yum! \nMango/strawberry pillows- yum! \n\nKey notes:\n-cash only\n-they charge you for tea (per person at your table regardless if someone doesn't drink it) \n-you will get bad service (laugh it off or take it offensively)\n-you will wait a while to get your food", "rating": 3, "date": "2016-08-28"}, {"excerpts": ["I love their baked spaghetti dishes and my husband loves their curry.\n\n"], "author": "Sheila C.", "review": "UPDATE:\nIf you're feeling particularly hungry, try their entree options!  I love their baked spaghetti dishes and my husband loves their curry.\n\nAlso wanted to add a note regarding excellent customer service - remembers my drink order AND will chase me down the street to give me my forgotten cup of always delicious milk tea.  Thank you!", "rating": 5, "date": "2014-01-07"}, {"excerpts": ["I tried their baked white sauce seafood spaghetti and it was quite delicious too!\n\n"], "author": "Johnston C.", "review": "I have come here in multiple occasions as my girlfriend is a fan of the mango dessert in this place.  Let's just say the mango here seems to be always sweet and tasty!  We always come by for late dinner or dessert around 10pm, so we never experience much of a wait in line.  We would always order the Mango Bliss with tofu base (highly recommended!).  Due to cost of the mango flavor ice cream cost they had switched to use mango sorbet, which we found a little sour for the whole dessert and we didn't enjoy it.  Rest assure that you can still ask for the mango flavor ice cream for a small addition charge (~$1)  \n\nI tried their baked white sauce seafood spaghetti and it was quite delicious too!\n\nNote that this place is operated by two people, one server and one chef.  So if you are someone who expects good service and quick response time, then you may not enjoy this place.  However if you are a pure foodie like me and care less in the other minor details, then you would definitely enjoy their food here!", "rating": 4, "date": "2015-02-21"}, {"excerpts": ["and then the three of us shared a baked eggplant & tofu dish, coconut lime spaghetti, and ", "some kind of crab fried rice.  ", "For dessert we got creme brulee.  ", "My favorite dish was probably the egg plant & tofu dish.  ", "I've tried to recreate it many times at home with my own twist ", "and I haven't been  able to beat it.  ", "It has mozerella cheese and tomato on it with an assortment of vegetables.  ", "It's almost like a pizza and rice fusion!  ", "The coconut lime spaghetti is also quite delicious.  ", "The ground meat on top is super flavorful.  ", "The biggest let down was the crab fried rice.  ", "I think it had chopped up broccoli stems with some bacon.  ", "You can't even find crab meat in it.  ", "While creme brulee is -always- a delicious option, I wish we got a mango dessert instead since it seems to be their specialty.  "], "author": "Joyce W.", "review": "I was taken to Mango Medley by a local when I came out here to meet up with my friend from New York and I left a happy happy lady!  \n\nThe restaurant itself is really cozy and cutely decorated.  While there's definitely not enough wait staff given how busy dinner is here at this place, it doesn't deter from a nice hot meal.  I started off with a lemon honey & grass jelly drink and then the three of us shared a baked eggplant & tofu dish, coconut lime spaghetti, and some kind of crab fried rice.  For dessert we got creme brulee.  My favorite dish was probably the egg plant & tofu dish.  I've tried to recreate it many times at home with my own twist and I haven't been  able to beat it.  It has mozerella cheese and tomato on it with an assortment of vegetables.  It's almost like a pizza and rice fusion!  The coconut lime spaghetti is also quite delicious.  The ground meat on top is super flavorful.  The biggest let down was the crab fried rice.  I think it had chopped up broccoli stems with some bacon.  You can't even find crab meat in it.  While creme brulee is -always- a delicious option, I wish we got a mango dessert instead since it seems to be their specialty.  Oh well!\n\nRemember to bring cash, folks.  Cash only!", "rating": 4, "date": "2014-06-25"}, {"excerpts": ["We had the pork chop with spaghetti [http://www.yelp.com/biz_photos/Ad-tBph_1318oUocDbrrTQ?select=fztsRUkWuyt011lh8z40sQ] and the crab fried rice.  ", "Too filling for two, but to go boxes were $0.50 extra, so we stuffed ourselves silly and went our merry way."], "author": "Jenny L.", "review": "03.17.10\n\nAfter going back and forth about where to fill up before we start a long night of drinking festivities, we finally decided on Mango Medley.\n\nWe had the pork chop with spaghetti [http://www.yelp.com/biz_photos/Ad-tBph_1318oUocDbrrTQ?select=fztsRUkWuyt011lh8z40sQ] and the crab fried rice.  Too filling for two, but to go boxes were $0.50 extra, so we stuffed ourselves silly and went our merry way.", "rating": 3, "date": "2010-03-25"}, {"excerpts": ["For entree's it ranges from Hong Kong Baked rice and spaghetti items, Pineapple Fried Rice, Katsu...and a section of vegetarian options. \n\n"], "author": "Cass J.", "review": "This place is by far, the most confused restaurant I have ever been into.  I doesn't know whether it wants to be a cafe, a restaurant, dessert house, or a storage room and office space.  \n\nUpon walking in, you notice a cafe-like counter serving teas, coffee, and Asian drinks.  I asked if we order at the counter or take a seat, they told us to just sit wherever.  Walking down the stairs into the dining room, you find a cute little loft setting for a dining area with picture of San Francisco, and some art piece on the walls.  \n\nThen I noticed the oddities.  There was a wooden screen semi-blocking a computer, desk, chair, boxes and a bike.  Hence, my curiocity of it being a storage area.  But oh well.  Haha.  \n\nFurthermore, Mango Medley is confused between being Chinese, Japanese, Thai, Korean, Vietnamese, and Indian.\n\nThe appetizer section had options ranging from Japanese Gyoza, to Vietnamese Spring Rolls, to Indian Roti...you get the picture.  For entree's it ranges from Hong Kong Baked rice and spaghetti items, Pineapple Fried Rice, Katsu...and a section of vegetarian options. \n\nWhile Mango Medley is diverse, and has a picture menu of options, it was a bit difficult to decide on what to order.  \n\nHowever, my little sister and I had came here after dinner with our folks at Dragon River, so we were only in the mood for dessert.   \n\nWe decided on the Mango Medley as of course the name of the place implies, as well as the Mango Ice Cream \"Pillows.\"  \n\nBoth were disappointments.  Not only were the not visually appealing for dessert, but they both really lacked any other flavor and creativity.  The Mango Medley was blended mangos, with Jello pieces of Aloe, cut up apple pieces and mango on top.  Eh...thats all I can say.  Nothing special at all.  \n\nThe Mango Ice Cream Pillows, if you are wondering what these are, is pretty much a Crepe pancake wrapper with a scoop of mango ice cream, wipe cream, and a piece of mango inside.  It was just alright, I would've preferred it to have been a little pan-fried on the top drizzled caramel and more powderd suger.  =X I'm so bad.\n\nI would definitely prefer to come back here for dinner or lunch sometimes as their regular menu seems to be pretty interesting with all of the diverse options to chose from.\n\nService here stinks!  Slow as hell, and definitely put me to sleep.  Our waitress walked around in her flip flops and oversized jeans that dragged on the floor, and literally walked as if she just woke up.  We waited 45 minutes for our dessert.  There was only one person cooking, as we noticed while walking out.  \n\nWe asked for tea to drink to our surprise, it is literally like a little \"self serve\" place, somewhat.  You get your own tea, water, forks, spoons, napkins, hot sauce, soy sauce, etc, at a little station.  Interesting.  \n\nOverall, desserts are really mediocre here.  I will skip next time.  Hopefully this place will \"Wow\" me with their huge menu of Asian dishes...hopefully.", "rating": 3, "date": "2009-07-20"}, {"excerpts": ["and I ordered the baked bacon & mushrooms spaghetti, kimchi fried rice, and an iced honey lemon tea. ", "The spaghetti was super bland and dry. ", "Eck...not good but ", "because my boyfriend was hungry, he scarfed the food down. ", "My kimchi fried rice was not bad. ", "Was it the best I ever had? ", "Eh...me think not. ", "The Spot's kimchi fried rice is way better. "], "author": "Serena F.", "review": "Despite the reviews here on yelp, I wanted to try this place with my own judgement. I can honestly say service is sooooooo slow here but then again, I don't blame our waitress. I blame the owners for not hiring help for her. She is the one who seats guests, take orders, bust tables, and cashier. \n\nNow onto the food, my boyfriend and I ordered the baked bacon & mushrooms spaghetti, kimchi fried rice, and an iced honey lemon tea. The spaghetti was super bland and dry. Eck...not good but because my boyfriend was hungry, he scarfed the food down. My kimchi fried rice was not bad. Was it the best I ever had? Eh...me think not. The Spot's kimchi fried rice is way better. Finally, the iced honey lemon tea had no lemon taste whatsoever...sad face. \n\nI will not return to try anything else...mainly because I had such a bad experience. Food was a disappointment.", "rating": 2, "date": "2011-04-30"}, {"excerpts": ["A few dishes that are worth it to try:\n+ Kim Chi Fried Rice\n+ Spaghetti Bolognese\n+ Vietnamese Braised Chicken w/ Rice\n+ Vietnamese Spring Rolls\n\n"], "author": "Milz T.", "review": "I wrote a previous review on this place with only 3 stars and have decided to bump up a star since I've become a regular!\n\nYes, their service is slow (if only they would just hire another cook back there), but the food is well worth the wait!  I love their happy hour specials because the meals come with free coffee or milk tea!  I have been satisfied with nearly all of their dishes, and the waitress pretty much knows what I want ever time I come.\n\nA few dishes that are worth it to try:\n+ Kim Chi Fried Rice\n+ Spaghetti Bolognese\n+ Vietnamese Braised Chicken w/ Rice\n+ Vietnamese Spring Rolls\n\nAnd top it off with a yummy mango ice cream dessert w/ buttermilk panna cotta! \n\nI'd give actually a 4.5 if I could just because the food is so addicting.", "rating": 4, "date": "2010-06-29"}, {"excerpts": ["I had their Cream of Chicken mushroom spaghetti, it was okay. "], "author": "Eva H.", "review": "Service: 3.5/5\nFood: 3.5/5\nWait: 1/5\nPrice: $\nPresentation of food: 3.5/5\nPresentation of restaurant: 3/5\nOverall: 3/5\n\nI finally decided to come here because a friend recommended it and I was near by already. Everyone wasn't kidding when they say the wait of the food is EXTREMELYYYYY SLOW. So the food isn't that good, but their dessert is worth coming for. I had their Cream of Chicken mushroom spaghetti, it was okay. As for dessert I had their Mango Bliss which consist of Mango Ice Cream, Mango Pieces and I chose their Almond Jelly with it. O-M-G is the Mango frrrresh to death! It's the most Freshest mango I had ever had in my life! I will definitely come back, but most likely come on a day when I'm in no rush. So I can sit and wait, then enjoy the BLiSS :)", "rating": 3, "date": "2010-09-05"}, {"excerpts": ["After spending a good amount of time going through their extensive menu (as we could not decide what to order, so many items!), I settled on the bacon and mushroom spaghetti with ground pork, and ordered an organic sesame soy milk.  ", "Hubby chose the baked seafood spaghetti with a tomato-based sauce, with Mango Medley deluxe as the dessert.\n\n", "The bacon and mushroom spaghetti had a light, onion-flavored cream sauce, a right size portion to eat in one sitting, with fresh mushrooms and topped with cheese.  ", "The organic sesame soy drink was great as well; the sesame was ground very finely, and not too much sugar, which was to my liking.  ", "Hubby's baked dish took longer to come since it was baked, but it was good as well, with right amount of seafood, light tomato sauce and al dente spaghetti, topped with cheese.\n\n"], "author": "Vicky F.", "review": "Being HK style food fans and after reading reviews of this place, hubby and I decided to give it a try.  We came on a Tuesday night around 8:30pm, and the place had about 3 tables.  We sat ourselves and picked up menus on the empty tables to decide what to order.  Since we had already read the reviews we kind of expected to do a lot of self-service, which was not a problem with us.\n\nAfter spending a good amount of time going through their extensive menu (as we could not decide what to order, so many items!), I settled on the bacon and mushroom spaghetti with ground pork, and ordered an organic sesame soy milk.  Hubby chose the baked seafood spaghetti with a tomato-based sauce, with Mango Medley deluxe as the dessert.\n\nThe food took a long time to come.  It was very delicious, however.  The bacon and mushroom spaghetti had a light, onion-flavored cream sauce, a right size portion to eat in one sitting, with fresh mushrooms and topped with cheese.  The organic sesame soy drink was great as well; the sesame was ground very finely, and not too much sugar, which was to my liking.  Hubby's baked dish took longer to come since it was baked, but it was good as well, with right amount of seafood, light tomato sauce and al dente spaghetti, topped with cheese.\n\nThe Mango Medley deluxe dessert was also pretty good, with many slices of sweet mango.  It's served with a mango slush underneath with bits of coconut jelly.  The slush was very smooth.\n\nOverall, we liked the food there a lot and definitely will go back.  But I agree with other yelpers - don't go there when you are super hungry - it's more like a place to go when you have some time so you can sit and chat while waiting for the food.", "rating": 4, "date": "2010-10-22"}, {"excerpts": ["I ordered the honey chicken garlic spaghetti (which I think is now discontinued) which I thought was pretty good. ", "The chicken had strong honey flavoring and the noodles were garlicky but not oily. ", "I usually picked out the zucchini, onion, and red pepper because they came in large chunks it felt weird chewing on those at the same time. "], "author": "Cristal G.", "review": "Large extensive menus worry me. I know places like to give variety, but it's just easier on me if I knew which were the decent options. And considering the size of both Mango Medley and the staff, I think they're trying to handle more than they can. But anyway, I visited here twice.\n\n1st time: It was around the time the place first opened, so I think that's why the staff was nice back then, I'm not sure how they are now. I ordered the honey chicken garlic spaghetti (which I think is now discontinued) which I thought was pretty good. The chicken had strong honey flavoring and the noodles were garlicky but not oily. I usually picked out the zucchini, onion, and red pepper because they came in large chunks it felt weird chewing on those at the same time. Since it was a cold night, I had their honey ginger tea which was okay, made my stomachache go away at least.\n\n2nd time: I was nauseated and I really didn't feel like eating but the bf really felt like getting dessert so I brought him here. I just ordered tea and he ordered the red bean soup. We know red bean soup is usually reddish and purple in color, but this particular one came in a faded purple color with black colored beans. WTF? Looked and tasted like it was refrigerated. And since there was like a $3 minimum/person rule and we were 25 cents short, she suggested I order a 50 cent cookie (from the Costco pack). I should have just given her 25 cents for free.\n\nOh yeah, my bf really had to use the bathroom and but couldn't use the one here. Something about the stench and the dirtiness, maybe the last guy couldn't stomach the dessert either. He's gone before in Safeway and gas station bathrooms but said no way to this one.\n\nAnyway, I think the cooked food looks alright to try, they seem to like experimenting. But pick your desserts carefully. And also, don't trust pictures.", "rating": 3, "date": "2009-08-12"}, {"excerpts": ["My faves are the baked seafood rice and baked portuguese spaghetti. ", "The chef here must really like garlic, because you can taste it in every dish. ", "To some it may be overpowering, but I love the garlic taste. ", "The baked portuguese spaghetti is cooked in a similar to curry-sauce. \n\n"], "author": "Wendy L.", "review": "I've been coming back to this place occasionally for the past year. Whenever I want to reminisce my Hong Kong trip, I come here. The place is vastly influenced by the Hong Kong cuisine. There are even Hong Kong street signs on the wall!\n\nMy faves are the baked seafood rice and baked portuguese spaghetti. The chef here must really like garlic, because you can taste it in every dish. To some it may be overpowering, but I love the garlic taste. I like the baked seafood rice in tomato sauce. They're not cheap on ingredients either. The dish is filled with shrimp, scallop, salmon, and fish. The baked portuguese spaghetti is cooked in a similar to curry-sauce. \n\nI always finish off the meal with the mango delight dessert, because it is the only dessert that includes mango ice cream. I always choose the panna cotta as the base. It's topped with mango puree and mango slices. \n\nWhen I first started coming here, it was a one woman show. But I believe they've hired some help now. Last time I came, I saw two waitresses helping out, but didn't seem to fully grasp the system. Hopefully, they're fully trained now and service will be a lot faster.", "rating": 4, "date": "2009-12-13"}, {"excerpts": ["But I'm coming back on a summer night to try out their pork chop over baked spaghetti. "], "author": "M J.", "review": "Sooo. I plan to come here again to get a better feel of this place, because the food looked good and the place was cute and all I really had here was the desserts. I had the mango pillow/mango crepe and omggg it was good! Fluffy whipped cream, sweet mango slices wrapped in a crepe-y thing. Kinda small, but whatever.\n\nThe problem?\nThey're helllllla slow.\nWe came for some dessert and waited 20 minutes for these pillow things.\nWe finished the damn things in like 5 minutes.\nForeal?\nThat ain't cool.\n\nBut I'm coming back on a summer night to try out their pork chop over baked spaghetti. (=\n\nCASH ONLY!", "rating": 3, "date": "2009-05-31"}, {"excerpts": ["I ordered baked spaghetti with 2 huge slabs of pork chop and with plenty of broccoli and cauliflower.  ", "I could only finish half my food and was full from 1 pork chop. ", "Other people ordered ramen soup noodles that came with a ton of veggies and tofu, the Bolognese backed spaghetti had a good sauce, and the Thai noodles with veggies looked like a light entree. ", "The food was cooked home-style and the portion size was decent. "], "author": "Candace F.", "review": "My friends wanted to come here for a snack/dinner on a quiet Sunday late afternoon. The place was practically empty. It's a quaint, cozy place with a limited number of tables and chairs. The menu offers a variety of entrees, salads, and desserts. I ordered baked spaghetti with 2 huge slabs of pork chop and with plenty of broccoli and cauliflower.  I could only finish half my food and was full from 1 pork chop. Other people ordered ramen soup noodles that came with a ton of veggies and tofu, the Bolognese backed spaghetti had a good sauce, and the Thai noodles with veggies looked like a light entree. The food was cooked home-style and the portion size was decent. The wait wasn't too bad as we were one of 2 tables occupied. \n\nThere was virtually no service as the waitress just took our orders and brought us our food. We had to get our own tea and set up our own utensils, which was a small amount of labor for some delicious home style cooking. I was too full to have dessert. But I was really tempted to get the special mango dessert for $6.50 that comes with mango chunks, almond jelly, and scoop of vanilla ice cream. I think there were variations as to what you wanted to be added to your mango \"sundae\". I had a small taste of my friend's sundae and it was good - sweet and satisfying. I will probably come back again to try some of their other dishes and for dessert.", "rating": 4, "date": "2008-06-24"}, {"excerpts": ["Portuguese spaghetti: almost thai yellow curry style but with strong garlic flavor again, but again, not overpowering, highlights the other flavor quite well.  \n", "-sesame "], "author": "Christina D.", "review": "UPDATE:\nCame here for dinner on a Wed night, only 1 other table was dining, so the wait/service wasn't bad at all.  When eating at a mom n pop cafe place, expectation's of course not very high, but the food we got were all very delicious!\n\nWe had:\n-roti: probably the worst of the bunch.  It's the type of pancake that comes from the frozen packaging in Asian supermarkets.  My family gets that alot and make it when we're lazy, so would not recommend getting it here.  Although the sauce that accompanies the roti is super yum, curry flavor with a spicy kick.  \n-baked seafood rice with tomato sauce: super good, pungent on the garlic flavor, but we all thought it was yummy not overpowering.  It came with shrimp, scallop, salmon, mussel, tilapia.  \n-baked Portuguese spaghetti: almost thai yellow curry style but with strong garlic flavor again, but again, not overpowering, highlights the other flavor quite well.  \n-sesame spinach noodle: very thin and soft noodles, in a basic sesame oil sauce with eggplant and tofu.  Very refreshing, solid\n\nWith the 3 entrees, every time I try one, I feel like that's the best, but as I eat another, that one suddenly reigns supreme.  That must be a good sign right?  And we got their signature dessert to finish it off, it wasn't very impressive.  Surprisingly, I would say come here for dinner if you're in the neighborhood and want something simple to go, but you can get better desserts elsewhere, esp in sunset.   \n--------------\nThey offer such a huge variety of foods, from HK style baked pasta/rice, to thai/indonesian plates like curries and fried rice, they even have Korean pancake, ramen, Vietnamese spring rolls, and roti (the thin crepe like appetizer that everyone and their mama get at Banana Island).  We seriously could not stop staring at the menu for 30 minutes, just admiring each picture, booked our next dinner date because we MUST try this place.  \n\nThe desserts were ok, I had the panna cotta with mango  and its pure.  It's actually like a soft yogurt custard, sorta weird.   The ambiance resembles the perfect cozy neighborhood spot.  One thing though, it seems like a 1 person team, the service is EXTREMELY slow.  We only ordered 4 desserts, none of which requires real cooking, but it still took her at least 30 min. to bring it out.  But for such a small place, I'll overlook that for now, and dream about the explosion of flavors in my mouth when I actually eat here.", "rating": 4, "date": "2008-06-02"}, {"excerpts": ["I had the mushroom and bacon spaghetti - YUM!!!!!! ", "it was actually REALLY good.  ", "Portion was kinda small, but I finished it instead of boxing it to take home.  ", "I'd say it was jussssssst right.  ", "Bf got curry seafood spaghetti, i didnt try it, it looked gross.  "], "author": "kim w.", "review": "YES, service is slow, thats why i brought my DS lite.\n\nThe place looks like it used to be a coffee shop, now a chinese dessert/western style food restaurant?\n\nNothing really looked good in the pictures.  I came only for the panna cotta, but was hungry and decided to get some food as well.  It was actually good that it took the waitress so long to take our order because we didnt know what we wanted.\n\nThere were 2 other tables besides us this afternoon.  \n\nI had the mushroom and bacon spaghetti - YUM!!!!!! it was actually REALLY good.  Portion was kinda small, but I finished it instead of boxing it to take home.  I'd say it was jussssssst right.  The sauce was sweet; it was just really good. \n\nBf got curry seafood spaghetti, i didnt try it, it looked gross.  Bf said mine was better.\n\nMango Panna Cotta - A BOWL OF HEAVEN!!!!!! i loved it.  Not too sweet, refreshing, delish.\n\nOne of the tables had to change their minds and got their meal to-go because it took too long.\n\nWith my DS, waiting was no biggie. :P", "rating": 3, "date": "2009-02-01"}, {"excerpts": ["Their baked spaghetti and pork chops dish is really good here.  ", "They have a lot of cool dishes on their menu that you don't normally find at other restaurants, many containing none other than: MANGO! ", "Duh. ", "They serve a wide variety of desserts, but a bit expensive for the price they charge.  ", "It's a great spot in the outer sunset to meet someone up for coffee or a drink because they have comfy seats near the window where you can just chat and lounge around. ", "It's not loud like other dessert places, which is also good if you are taking one or two friends to catch up. ", "Best of all, it's located a few blocks away from my boyfriend's house and closes fairly late!"], "author": "Helen Z.", "review": "Their baked spaghetti and pork chops dish is really good here.  They have a lot of cool dishes on their menu that you don't normally find at other restaurants, many containing none other than: MANGO! Duh. They serve a wide variety of desserts, but a bit expensive for the price they charge.  It's a great spot in the outer sunset to meet someone up for coffee or a drink because they have comfy seats near the window where you can just chat and lounge around. It's not loud like other dessert places, which is also good if you are taking one or two friends to catch up. Best of all, it's located a few blocks away from my boyfriend's house and closes fairly late!", "rating": 3, "date": "2008-12-10"}, {"excerpts": ["I ended up ordering the baked Portuguese spaghetti w/chicken.  ", "It takes a longer wait, compared to like other Chinese restaurants.  ", "The food was ok", ", it was definitely an interesting taste, not like the other baked Portuguese at Macau and Friends.  ", "It wasn't too creamy, but not like watered down spaghetti sauce.  "], "author": "Yosie G.", "review": "Mango Medley.. I'm guessing their specialty is mango.  Unfortunately I just thought of that now, even after seeing several items on the menu with mango.  Not bright, I know. \n\nJust got back from this place, reviewing while it's fresh (first review after four months, woo hoo!).  The place isn't too big, the staff doesn't really talk to you much.  At about 9pm the place wasn't packed - only two other tables filled plus us.  Initially I thought it's just a cafe place, you know with drinks and all but of course I was wrong.  The menu is decent with a variety of options.  I ended up ordering the baked Portuguese spaghetti w/chicken.  It takes a longer wait, compared to like other Chinese restaurants.  The food was ok, it was definitely an interesting taste, not like the other baked Portuguese at Macau and Friends.  It wasn't too creamy, but not like watered down spaghetti sauce.  Oh and it's also not the type of restaurant where you get service, more like get your own tea, get your own chili sauce.  So I guess next time I should come here for dessert, because apparently by the time we left there were more people, and they all ordered only drinks and dessert.  Maybe after I try those I can give it a better rating.", "rating": 2, "date": "2008-08-05"}, {"excerpts": ["The other two dished we ordered were Thai Sauce Spaghetti with Chicken and Fresh Pineapple Baked Riced. ", "The Pineapple was indeed fresh but besides that, the dished were kind of unimpressive."], "author": "Eleonore L.", "review": "The food is just okay. Nothing special. Somewhat boring. The only dish I can recommend is the Spicy Mango Salad with Prawns. That was pretty good. The other two dished we ordered were Thai Sauce Spaghetti with Chicken and Fresh Pineapple Baked Riced. The Pineapple was indeed fresh but besides that, the dished were kind of unimpressive.", "rating": 3, "date": "2008-12-06"}], "sauce": [{"excerpts": ["My friends and I ordered the ramen with brisket and beef tomato broth (divinely deep, umami flavors) the pork belly clay pot (juicy, flavorful pork with greens and tofu and an egg) and the papardelle with brandy cream sauce (so, so much lighter, more restrained, and more scrumptious than I was expecting). \n\n"], "author": "Adin V.", "review": "Really, truly delicious food prepared with love and care. If you look through the negative reviews, you'll see that most of them are taking issue with something totally unrelated to the food quality (like not having free open internet...I know this is SF, but c'mon, it's a restaurant not a WiFi router).\n\nPortions aren't huge, but I think Americans just need to get used to the idea of having a smaller amount of really high quality food.\n\nMy friends and I ordered the ramen with brisket and beef tomato broth (divinely deep, umami flavors) the pork belly clay pot (juicy, flavorful pork with greens and tofu and an egg) and the papardelle with brandy cream sauce (so, so much lighter, more restrained, and more scrumptious than I was expecting). \n\nFor dessert, we had the cha cha bowl (hot coconut milk with black sticky rice, adzuki beans and an outstanding, but solitary, piece of black sesame-filled mochi) and an ice cream pillow (ice cream wrapped up with a crepe--too much whip cream, but the ice cream and crepe combo was perfect).\n\nSuch lovely ambiance. Such good, carefully prepared food. Ignore the haters!", "rating": 5, "date": "2018-10-21"}, {"excerpts": ["Mine was the tongue in curry sauce.  ", "I like all tje vegetable with my rice.  ", "All in one meal.  ", "Good flavor. ", "We had the durian ice cream with whipped cream pillow.  ", "Good flavor of durian.  \n  ", "We had the small restaurant to ourselves.  ", "The restroom requires a key which you get from the front.  ", "There is a sign that you have to order food first or else pay 5.00 to use the toilet.  ", "Water was free.  ", "Tea would cost.  ", "This reminds me of a mom and pop shop.  ", "Everything extra will cost money, bag .10, container cost .50.  ", "Great place for dessert.   ", "Food was yummy."], "author": "Helen L.", "review": "This time is all about the baked rice dishes.  The best is the 13.95 portugese baked rice.  Mine was the tongue in curry sauce.  I like all tje vegetable with my rice.  All in one meal.  Good flavor. We had the durian ice cream with whipped cream pillow.  Good flavor of durian.  \n  We had the small restaurant to ourselves.  The restroom requires a key which you get from the front.  There is a sign that you have to order food first or else pay 5.00 to use the toilet.  Water was free.  Tea would cost.  This reminds me of a mom and pop shop.  Everything extra will cost money, bag .10, container cost .50.  Great place for dessert.   Food was yummy.", "rating": 4, "date": "2017-03-28"}, {"excerpts": ["She was right, and I ended up having the most delicious and refreshing dish ever:  mango & pomelo over a sago pudding covered with mango sauce.   ", "The owner was very nice and accommodating, despite the fact that she works alone and that every table was full.  ", "I'll be back!"], "author": "Robyn T.", "review": "My friend recommended Mango Medley as a fun, quirky, late evening cafe option and a place to have a really cool dessert.  She was right, and I ended up having the most delicious and refreshing dish ever:  mango & pomelo over a sago pudding covered with mango sauce.   The owner was very nice and accommodating, despite the fact that she works alone and that every table was full.  I'll be back!", "rating": 5, "date": "2018-07-27"}, {"excerpts": ["We ordered the spaghetti bolognese, a vegetable curry with rice, and the clam cream sauce with rice. ", "For dessert, we had mango pillows and a sesame paste + tofu bowl. "], "author": "Michelle V.", "review": "I was so excited to try this restaurant because my friend swore on its authenticity to Hong Kong food and it was her absolute favorite place.\n\n was weary of the place at first because of all the negative reviews of the server but she was nice to us! On a Monday night at 7pm, the place was initially packed but everyone seemed to leave at once and it was very quiet. The prices were on the higher side. \n\nI was surprised to be eating spaghetti, LOL. We ordered the spaghetti bolognese, a vegetable curry with rice, and the clam cream sauce with rice. For dessert, we had mango pillows and a sesame paste + tofu bowl. The spaghetti was pretty good and I finished mine quickly. The rice dishes seemed\nenormous. I want to go back to try the spaghetti with the meat leg everyone's posting about. The pillows were good as well. It was my first time trying the sesame paste and I liked it! I guess I expected something more Asian but my friend said the influences Hong Kong had experienced had led to this. \n\nThere was only one server working and things got a bit slow. The bathroom broke after one person used it. Something negative is that a friend of ours wanted the Portuguese dish, and they ran out, so she took more time to look at the menu. They didn't come back to take the order until 25 minutes later, and had said they also ran out of spaghetti (the rest of us were already eating by this time). My friend had to settle for rice and ended up eating when we all had finished. :/ When they brought the plate out, they had the nerve to say \"You ordered late, expect it late.\" ??? imig\n\nWe ended up paying like $20 per person and honestly, I can get better food for $20 but it was nice to hang out with my friends. We stayed another 20 minutes after finishing to wait for a bus and they didn't kick us out of anything.\n\nMaybe I'll come again if I'm in the area but this place was not 4 or 5-star material.", "rating": 3, "date": "2016-12-20"}, {"excerpts": ["Seafood Curry came with some shrimp, mussels, and pieces of fish in a yellow curry sauce. ", "Rice was extra, $1.50 or $2 ", "I think, but you gotta have it with your curry! "], "author": "Megan D.", "review": "It's been a while since I've entered the strangely mystifying realm of Mango Medley and decided to embark with the boyfriend into its magical, perplexing kingdom. To my surprise, this visit (probably my 4th or 5th on ever) was the best out of any of them.\n\nSome changes had been made since I last visited Mango Medley. For one, the dining room is the only place you can enter into now. Before there was another room that overlooked the kitchen, past a counter, with a huge menu over it, that made it confusing as to where to stand and wait for a table. That area is now blocked off, making the walk-in process much more straightforward, though now I'm not sure where you'd stand if all the tables are full. Probably outside.\n\nSecondly, rather than have any sort of server, the owner and chef was the one to seat us and take our order. We came in at 9:30 on a Thursday and there were only a few tables besides us. Even still, service had a bit to be desired. I was very happy that this was the first time I actually felt taken care of, though, service-wise.\n\nThirdly, the menus for Dinner and Dessert have been updated. My go-to Salmon Pineapple Bacon fried rice is now \"Pineapple bacon fried rice with choice of meat\" (no salmon option, *sadface* ). And no more avocado or taro shake, (also *sadface*). The menus are so extensive, though, that it's easy to try a new thing every time you come in. And with their track record for good food, it wouldn't be a mistake.\n\nTHE FOOD (!!!) as always, and maybe even better than what I remember, was so so good. Mango Medley always has a homemade quality with personal touches to it, everything I've ever ordered from here has been delicious. This particular evening we had:\n\nBeef Brisket Soup\nSeafood Curry w/ Rice\nSoy Ginger Drink, LG\n\nI couldn't decide between the Oxtail and Beef Brisket soup, but ended up going with the brisket as it came with noodles. Added egg for $1.50 extra. The flavor of the broth was out-of-this-world rich and gratifying. The meat was tender and flavorful and just like the most succulent pot roast out of a slow cooker. The addition of Asian greens and mushrooms added complexity and good texture. Yum.\n\nSeafood Curry came with some shrimp, mussels, and pieces of fish in a yellow curry sauce. Rice was extra, $1.50 or $2 I think, but you gotta have it with your curry! This dish was also delicious and we both were able to get one mussel and a couple shrimp each when sharing it.\n\nThe hot Ginger Soy drink we ordered to go after paying, and it was delicious. Very spicy, warm, and sweet without being overpowering. The perfect way to end a nice night out walking into the cool evening. \n\nAlthough the service is still left to be desired, this has got to be my smoothest experience at this strange but delicious little restaurant. Much more likely to come back sooner than later based on this most recent visit.", "rating": 4, "date": "2016-07-31"}, {"excerpts": ["We had 2 orders of mango delight, almond jelly with mixed fruit and mango sauce, crème brulee and green tea ice cream\n\n"], "author": "Remie M.", "review": "My sister suggested this place.  I was craving dessert.\nWe had 2 orders of mango delight, almond jelly with mixed fruit and mango sauce, crème brulee and green tea ice cream\n\nThis place is very quaint, there is only one worker.  So, if you have time and have patience, then you won't mind the slow service.  She was very nice though.\n\nThe crème brulee was good, but of course, how can u mess up crème brulee?!\n\nLuckily, this place was walking distance from my brother and sister-in-law's house.\n\nCASH ONLY", "rating": 3, "date": "2014-03-03"}, {"excerpts": ["I tried their baked white sauce seafood spaghetti and it was quite delicious too!\n\n"], "author": "Johnston C.", "review": "I have come here in multiple occasions as my girlfriend is a fan of the mango dessert in this place.  Let's just say the mango here seems to be always sweet and tasty!  We always come by for late dinner or dessert around 10pm, so we never experience much of a wait in line.  We would always order the Mango Bliss with tofu base (highly recommended!).  Due to cost of the mango flavor ice cream cost they had switched to use mango sorbet, which we found a little sour for the whole dessert and we didn't enjoy it.  Rest assure that you can still ask for the mango flavor ice cream for a small addition charge (~$1)  \n\nI tried their baked white sauce seafood spaghetti and it was quite delicious too!\n\nNote that this place is operated by two people, one server and one chef.  So if you are someone who expects good service and quick response time, then you may not enjoy this place.  However if you are a pure foodie like me and care less in the other minor details, then you would definitely enjoy their food here!", "rating": 4, "date": "2015-02-21"}, {"excerpts": ["My friends and I have been coming here for several years for the Mango Bliss desert which is Mango ice cream, mangos, coconut sauce, mango sauce, and you can pick a base like panna cotta or jelly ", "unfortunately our last visit will be the last. ", "The service was always spotty, food took an incredible amount of time, and pricing would fluctuate. ", "For example, when ordering the \"shrimp salad\" we would be told, \"shortage on shrimp so $2 extra charge\". ", "Okay, slap on the extra charge. ", "This was all tolerated because of the Mango Bliss. \n\n", "Our recent visit we all ordered the Mango Bliss. ", "After we placed our order she comes back and says, \".75 extra for mango ice cream\". ", "The menu describes the Mango Bliss with mango ice cream priced at 6.95, but now you're verbally charging extra for mango ice cream. ", "Okay, slap on the extra charge. ", "Our mango bliss come out unusually fast. ", "Mangos are sour and acidic. ", "Rotten mangos. ", "We have been solid, flexible and accommodating customers for years and this business could care less."], "author": "Marley Q.", "review": "My friends and I have been coming here for several years for the Mango Bliss desert which is Mango ice cream, mangos, coconut sauce, mango sauce, and you can pick a base like panna cotta or jelly unfortunately our last visit will be the last. The service was always spotty, food took an incredible amount of time, and pricing would fluctuate. For example, when ordering the \"shrimp salad\" we would be told, \"shortage on shrimp so $2 extra charge\". Okay, slap on the extra charge. This was all tolerated because of the Mango Bliss. \n\nOur recent visit we all ordered the Mango Bliss. After we placed our order she comes back and says, \".75 extra for mango ice cream\". The menu describes the Mango Bliss with mango ice cream priced at 6.95, but now you're verbally charging extra for mango ice cream. Okay, slap on the extra charge. Our mango bliss come out unusually fast. Mangos are sour and acidic. Rotten mangos. We have been solid, flexible and accommodating customers for years and this business could care less.", "rating": 1, "date": "2015-08-11"}, {"excerpts": ["We ordered the flat bread that comes with sauce..."], "author": "Leslie Y.", "review": "I can't believe the low reviews and the complaints of service here....\n\nThis was recommended from a friend so we headed there straight after work...took us a 40 minute ride but well worth it\n\nWe made it in time to get a table for 5...mind you this place is hella small...\n\nWe ordered the flat bread that comes with sauce...it was ok\n\nBaked mussels....very good\n\nClams n bacon with angel hair....very good \n\nSalmon baked over rice...tons of veggies. ...another very good\n\nKimchi fried rice with shrimp.....definitely good\n\nDurian ice cream dessert.....sesame dessert...tofu dessert....\n\nThis place is run by 2 people.....the lady in front is actually very funny with a great sense of humor....thanks Eugenie....it sure does take some time for the food to come...when we tried to order more for takeout...they said the vents were already off...must be the noise as it is in a residential area.....but they will offer other dishes that can be prepared without the hassle.....\n\nThey don't rush you even though the place is so quaint....decor is absolute comfortable by all means...\n\nI guess you can tell that we all had a very good time......", "rating": 5, "date": "2014-08-17"}, {"excerpts": ["Very thick in consistency almost like that of a milkshake as mentioned by the name; Very strong and deep mango flavor; A bit sweeter than I'd like - extra sweetness tasted more like it came from syrup than naturally from the mangoes themselves\n\nMANGO BLISS ($6.95): Presentation was nice - bowl supported by a stand almost like a tall wine glass; Contained mango chunks, mango puree/juice, coconut sauce, and mango ice cream; Didn't have this ", "but bro seemed to enjoy it immensely - thought combination of mango components meshed well with coconut sauce\n\n"], "author": "Jacquie H.", "review": "Located in a block near the infamous breakfast joint, Outerlands on Judah Street sits Mango Medley. The first thing that comes to mind when people hear Mango Medley would be anything related to mangoes and henceforth people would easily believe that this joint serves only desserts with mangoes. However, Mango Medley specializes in desserts specifically mango ones but caters to everybody's needs and serves entrees and non-mango items as well.\n\nMANGO FRAPPE ($4.25): Very thick in consistency almost like that of a milkshake as mentioned by the name; Very strong and deep mango flavor; A bit sweeter than I'd like - extra sweetness tasted more like it came from syrup than naturally from the mangoes themselves\n\nMANGO BLISS ($6.95): Presentation was nice - bowl supported by a stand almost like a tall wine glass; Contained mango chunks, mango puree/juice, coconut sauce, and mango ice cream; Didn't have this but bro seemed to enjoy it immensely - thought combination of mango components meshed well with coconut sauce\n\nHK-STYLE MILK TEA ($4.25): Seemed decent but folk had nothing to rave about; Nice how they took our request of taking out grass jelly and red bean into consideration; Not sweet; Probably wouldn't come here for a non-mango item\n\nORGANIC MANGO HOUSE MADE TOFU-FA ($5.50): Great rendition with a nice addition of mangoes; Not sweet in the least bit \n\nSERVICE: Service was a bit slow considering how many people were waiting for our table though only one lady was working though the place is quite small with approximately 6 tables \n\nDECOR: Pretty unique and quirky place; Very quaint and cozy; Felt like it had previously been a Japanese restaurant\n\nMango Medley exceeded my expectations since every dessert we ordered was strong. This place really knows how to do their mango items well so if you stick to that you'll have a great first experience here. They use as many organic ingredients as possible so they really distinguish themselves from other Asian dessert places.", "rating": 4, "date": "2015-01-27"}, {"excerpts": ["We got mango bliss and taro sauce with tofu. ", "Both were good, especially the natural tasting taro bits in the taro sauce. ", "The downsides are the strange service, nickel and diming on everything - e.g. $2 disposal fee for every item brought in to be thrown away (although not sure if they really enforce it), $5min/person, cash only."], "author": "Will C.", "review": "Decent dessert stop after dinner. We got mango bliss and taro sauce with tofu. Both were good, especially the natural tasting taro bits in the taro sauce. The downsides are the strange service, nickel and diming on everything - e.g. $2 disposal fee for every item brought in to be thrown away (although not sure if they really enforce it), $5min/person, cash only.", "rating": 3, "date": "2015-05-22"}, {"excerpts": ["The peanut sauce as the curry tasted a bit weird. "], "author": "Monica C.", "review": "Mango Medley is one of the few Asian dessert places opened in the Sunset. Every time I come here, the setting changes and the prices increases more and more. It's pretty ridiculous because they used to give unlimited self served tea (free-of-charge). Then, they served tea in individual cups and now, they charge for tea. That was one thing that made them different from all the other Asian dessert spots.\n\nIn terms of desserts, they have good mango cream pillow and mango delight. The strawberry cream pillows (in my opinion) does not taste as good as the mango ones and they stuff the strawberry pillows with extra whipped cream. I also ordered the Roti as an appetizer and it was okay. The peanut sauce as the curry tasted a bit weird. Maybe it's because I usually order the Roti at Banana Island so it couldn't compare. \n\nThe service is extremely slow since they usually have only one server and sometimes two workers. In the past, I waited an average of 40 minutes to get the mango pillow dessert so I would come here to have long chats to catch up with people. Luckily now, I only have to wait 15-20 minutes for my desserts. If it wasn't due to convenience, I would recommend going elsewhere for Asian desserts unless you really crave for their cream pillows.", "rating": 3, "date": "2013-10-15"}, {"excerpts": ["Memorable Mango food: \n\n- Homemade cold tofu covered with mango sauce\n- Small crêpes filled with cream and sliced banana\n- Baked medley of fish, mussels, shrimp and veggies in a house tomato sauce\n\n"], "author": "Jason B.", "review": "Here we go.\n\nMemorable Mango music: https://www.youtube.com/watch?v=zyNbo7bbyc8\n\nMemorable Mango food: \n\n- Homemade cold tofu covered with mango sauce\n- Small crêpes filled with cream and sliced banana\n- Baked medley of fish, mussels, shrimp and veggies in a house tomato sauce\n\nWhether for dessert or a proper meal (or both) you'll likely find endearing the friendly staff, small confines and quite good food.\n\nThose who live close might just go. And go again.", "rating": 4, "date": "2014-06-19"}, {"excerpts": ["We had the salty fish with chicken fried rice, the kimchee fried rice with shrimp and an egg, the baked scallop rice with creamy sauce, the beef brisket in a curry broth, and a pork shoulder with white rice and vegetables.  ", "Everything was made with care & so delicious!  ", "The desserts were out of this world!  ", "Words can't describe the desserts.  "], "author": "Tricia K.", "review": "OMG!  I died and went to mango heaven!  The food is delicious!  We had the salty fish with chicken fried rice, the kimchee fried rice with shrimp and an egg, the baked scallop rice with creamy sauce, the beef brisket in a curry broth, and a pork shoulder with white rice and vegetables.  Everything was made with care & so delicious!  The desserts were out of this world!  Words can't describe the desserts.  We had 4 mango puffs with ice cream, 2 taro puffs, a mango medley, a strawberry bliss with panacotta, and a mango bliss with panacotta and ice cream (my favorite).  The service was excellent and we were very pleased with everything.", "rating": 5, "date": "2014-07-23"}, {"excerpts": ["a crepe that doesn't taste like it was made with soy sauce and ice cream WITH whip cream for less than $4. "], "author": "Brilissa T.", "review": "Not impressed. Thoroughly disappointed actually. As a fan of mango, this place was a major letdown. How do you have mango in your name and manage to mess it up?\n\nWe ended up ordering the mango pillows and mango panna cotta. The mango pillows consisted of whip cream, A slice of mango wrapped in a thin (funky flavored) crepe. We could of probably made this at home in minutes with more mango, a crepe that doesn't taste like it was made with soy sauce and ice cream WITH whip cream for less than $4. Redonkulous. \n\nThe panna cotta was mediocre at best. Came out in a small bowl, very small portions. Barely any panna cotta, topped with sour fruit and tea way jellys. Uhh...? \n\nThe only positive was service was relatively quick, not the slow service that we initially feared after reading the many yelp reviews that complained about it.\n\n~B", "rating": 1, "date": "2012-11-29"}, {"excerpts": ["If only they serve it with hot sauce on the side, the dish would be flawless."], "author": "Annie S.", "review": "Mangoes: sweet, juicy, and healthy. Use it in desserts and you have a recipe for success.\n\nThe desserts here are yummy. Because their specialties are mango desserts, I highly recommend the mango bliss or panna cotta bowl with mangoes. (Both around $6) The panna cotta is smooth and creamy, and the mangoes on top with a little bit of mango juice is just the perfect pairing.\n\nI don't know why so many people complain of slow service because I've received quick service for the two times that I was here. (Both visits were made during the same week too.) The workers here are really friendly so try to be understanding since there is usually only one waitress taking orders and one person in the kitchen putting the desserts and foods together.\n\nAnd oh, did I mention their kimchi fried rice is to die for? If only they serve it with hot sauce on the side, the dish would be flawless.", "rating": 4, "date": "2012-01-22"}, {"excerpts": ["After 3 bites of the chalky tofu and artificial mango sauce, I found a long strand of BLACK HAIR in between the 2 slithers of tofu.  ", "Since the apathetic waitress ignored us when we were trying to get her attention, my sister went up to her and showed her the hazardous item in the dessert.  ", "The waitress merely said, \"Okay,\" and brought the dessert back in the kitchen WITHOUT APOLOGIZING!!  "], "author": "Amy K.", "review": "The service was HORRIBLE, food was DISGUSTING, and the employees were DISRESPECTFUL to customers. \n \nI ordered the tofu dessert with mango.  After 3 bites of the chalky tofu and artificial mango sauce, I found a long strand of BLACK HAIR in between the 2 slithers of tofu.  Since the apathetic waitress ignored us when we were trying to get her attention, my sister went up to her and showed her the hazardous item in the dessert.  The waitress merely said, \"Okay,\" and brought the dessert back in the kitchen WITHOUT APOLOGIZING!!  (maybe this wasn't the first time that happened to them)\n\nSince that strand of hair ruined my appetite, I just wanted to cancel the order.  BUT NO...the waitress shoved us a menu and pointed to an ant size sentence saying, \"$4 per person,\" meaning that there is a $4 minimum charge per person.  SERIOUSLY?! They served us a hazardous dessert and demanded us to either purchase another item that can potentially make people sick or pay $4 for no reason?!?!  RIDICULOUS!! \n \nOf course, we refused to pay the minimum charge, so a lady with a MESSY and BLACK ponytail (the hair's owner?) barged out from the kitchen and THREATENED to call the police on us.  UNBELIEVEABLE.  It would be their disadvantage for violating the sanitation rules if they call the police anyways.  But since we didn't want to waste any more time on them, we paid the bill and left.\n \nThey may get $4 from us, but they lost many valuable customers.  This place really has major food, sanitation, and customer service issues!  I would NEVER return to this restaurant and I can understand why this place was desolated when we were there.\n  \nThis place is not worth your time, energy, and money. People with uncaring attitudes will NEVER make delicious food nor run a successful business.", "rating": 1, "date": "2012-12-28"}, {"excerpts": ["We ordered the Strawberry/Berry Bliss, Grass Jelly+Almond Jelly with mango sauce and fruit, grass jelly with mango sauce and fruit, and mango green tea ice cream pillows.\n\n"], "author": "Robin Y.", "review": "Passed by this place many times, but finally decided to step in and try it out on a Friday evening for dessert after musing through the menus. We walked in, didn't expect a crowd, but BOY, were we surprised! There was a waiting list and we were on the top of it, but we waited for frickin half and hour. HALF AND HOUR. \n\nAnyways, we finally got seated and had to flag the waitress down to order. We ordered the Strawberry/Berry Bliss, Grass Jelly+Almond Jelly with mango sauce and fruit, grass jelly with mango sauce and fruit, and mango green tea ice cream pillows.\n\nThe food is a WHOLE different story from the service. The grass jelly/almond jelly desserts had big chunks of the jelly with fresh mango puree and really sweet fresh fruit. The strawberry/berry bliss (with the almond jelly as the base) had lots of strawberries, ice cream and almond jelly and the portion seemed bigger than the other jelly desserts. Lastly, there were the cream pillows. Consisted of a thin crepe skin with ice cream and fresh mango inside, with whipped cream.\n\nAll in all, the desserts were REALLY good, but service was unbearably slow. If you're thinking about trying it out, come on an off hour, and the food AND service will be great!", "rating": 3, "date": "2011-07-02"}, {"excerpts": ["i couldve made a whole shit loads at home and jazz it up with some chocolate sauce at home!!!\n\n"], "author": "Josie L.", "review": "I hate this place.\n\nThe service was horrible. I sat down with my bestie and waited 20 mins for someone to notice us. No one ever did so i walked up to the waitress and ordered the mango pillows. It took OVER AN HOUR for it to get on our table. Bitch probably forgot us!\n\nThe food was so disappointing. The mango pillows was a slice of mango and whip cream wrapped in a thin mix of egg, milk, and flour battered crepe. I mean yea it was good but it's just whip cream and mango.... for 6 bucks.... i couldve made a whole shit loads at home and jazz it up with some chocolate sauce at home!!!\n\nI will never go back there again, waste of my money, gas, and most of all, time.", "rating": 1, "date": "2012-03-24"}, {"excerpts": ["Roti w/ Curry Sauce\nBasil and Prawns Speghetti\nCrème Brulee\nMango Sticky Rice\n\n"], "author": "Mona C.", "review": "4.5 stars!\n\n+ Colorful Menu\n+ Decent Prices\n+ Happy Hour\n+ Good Food\n\n- Extremely slow service \n- HORRIBLE for groups\n\nI've been to Mango Medley for over 10 times now and needless to say, the service here is terribly slow. However, the food is worth the wait. \n\nI enjoy coming to Mango Medley during happy hour with my buddy Kylie L. for their Creme Brulee ($2.95) and Kimchee Fried Rice ($6.25).  For $6.25, you get the Kimchee Fried Rice and an option of Iced Coffee, Iced Lemon Tea, Buttermilk Panna Cotta or Tofu Fa. I usually go for the Iced Coffee. \n\nThey have a colorful menu detailed with photos so you know exactly how your plate will look like. I try to order something new every time but end up sticking with the same dishes over and over again. @_@ Here are some of my personal favorites:\n\nKimchee Fried Rice\nGreen Curry with side of Roti\nRoti w/ Curry Sauce\nBasil and Prawns Speghetti\nCrème Brulee\nMango Sticky Rice\n\nThis place is ALWAYS packed whenever I come; it's a mystery how they can survive with only one waitress.", "rating": 5, "date": "2009-10-20"}, {"excerpts": ["A nice scoop of mango ice cream, pana cotta on the bottom, chunks of mango, and sauce all over. ", "I will surely come back again, mostly since it's so close to my house!"], "author": "Nikita K.", "review": "Small hole-in-the-wall place with very limited seating, but the big pro is that they work very late! A nice place to come for a midnight snack. We tried the kimchi fried rice, which tasted like something I could make myself at home. I did really like the mango delight, which is their most famous dish. A nice scoop of mango ice cream, pana cotta on the bottom, chunks of mango, and sauce all over. I will surely come back again, mostly since it's so close to my house!", "rating": 3, "date": "2014-08-20"}, {"excerpts": ["You get your own tea, water, forks, spoons, napkins, hot sauce, soy sauce, etc, at a little station.  "], "author": "Cass J.", "review": "This place is by far, the most confused restaurant I have ever been into.  I doesn't know whether it wants to be a cafe, a restaurant, dessert house, or a storage room and office space.  \n\nUpon walking in, you notice a cafe-like counter serving teas, coffee, and Asian drinks.  I asked if we order at the counter or take a seat, they told us to just sit wherever.  Walking down the stairs into the dining room, you find a cute little loft setting for a dining area with picture of San Francisco, and some art piece on the walls.  \n\nThen I noticed the oddities.  There was a wooden screen semi-blocking a computer, desk, chair, boxes and a bike.  Hence, my curiocity of it being a storage area.  But oh well.  Haha.  \n\nFurthermore, Mango Medley is confused between being Chinese, Japanese, Thai, Korean, Vietnamese, and Indian.\n\nThe appetizer section had options ranging from Japanese Gyoza, to Vietnamese Spring Rolls, to Indian Roti...you get the picture.  For entree's it ranges from Hong Kong Baked rice and spaghetti items, Pineapple Fried Rice, Katsu...and a section of vegetarian options. \n\nWhile Mango Medley is diverse, and has a picture menu of options, it was a bit difficult to decide on what to order.  \n\nHowever, my little sister and I had came here after dinner with our folks at Dragon River, so we were only in the mood for dessert.   \n\nWe decided on the Mango Medley as of course the name of the place implies, as well as the Mango Ice Cream \"Pillows.\"  \n\nBoth were disappointments.  Not only were the not visually appealing for dessert, but they both really lacked any other flavor and creativity.  The Mango Medley was blended mangos, with Jello pieces of Aloe, cut up apple pieces and mango on top.  Eh...thats all I can say.  Nothing special at all.  \n\nThe Mango Ice Cream Pillows, if you are wondering what these are, is pretty much a Crepe pancake wrapper with a scoop of mango ice cream, wipe cream, and a piece of mango inside.  It was just alright, I would've preferred it to have been a little pan-fried on the top drizzled caramel and more powderd suger.  =X I'm so bad.\n\nI would definitely prefer to come back here for dinner or lunch sometimes as their regular menu seems to be pretty interesting with all of the diverse options to chose from.\n\nService here stinks!  Slow as hell, and definitely put me to sleep.  Our waitress walked around in her flip flops and oversized jeans that dragged on the floor, and literally walked as if she just woke up.  We waited 45 minutes for our dessert.  There was only one person cooking, as we noticed while walking out.  \n\nWe asked for tea to drink to our surprise, it is literally like a little \"self serve\" place, somewhat.  You get your own tea, water, forks, spoons, napkins, hot sauce, soy sauce, etc, at a little station.  Interesting.  \n\nOverall, desserts are really mediocre here.  I will skip next time.  Hopefully this place will \"Wow\" me with their huge menu of Asian dishes...hopefully.", "rating": 3, "date": "2009-07-20"}, {"excerpts": ["The sticky rice with mango was delicious and drizzled with coconut sauce. "], "author": "Allan L.", "review": "I grew up in this area and never knew this place existed. It's a small store and like other reviews say, the wait can be long for your food. Luckily, I came on a Tuesday night and our food came within a reasonable time. \n\nThe highlights were the sticky rice with mango (minus the sesame seeds) and the bacon mango fried rice. The fried rice was really good, but I guess bacon with anything is a win. The only downside of that dish was the mango pieces they used were hard and clearly the leftover mango pieces. The sticky rice with mango was delicious and drizzled with coconut sauce. We also had the curry fish balls, but they were nothing special.\n\nMy tummy gives Mango Medley...4 Stars!", "rating": 4, "date": "2012-08-29"}, {"excerpts": ["Almond jelly with mixed fruit and mango sauce. ", "Okay."], "author": "Maximillian M.", "review": "Almond jelly with mixed fruit and mango sauce. Okay.", "rating": 3, "date": "2014-03-03"}, {"excerpts": ["Although the fruit wasn't sweet at all, the mango sauce made up for it when you eat it all together.\n\n"], "author": "Juliane N.", "review": "After a LONG day running around to places, I met up my friend Annie to come here and grab some dessert. It was pretty packed at 1030 on a Wednesday! I wanted to sit on those comfy looking seats but it was all taken so the only seat left was near the door, which I always hate sitting near the door! \n\nIt took seriously forever for service. Actually, I had to go grab menus for myself, then I had to go grab a waitress so we can order, then one dessert came out and 10-15 minutes later, the next came out so the first one was just sitting there.\n\nWe ordered the Mango Medley, fresh mangoes, grapefruit and mango juice and puree and mango sticky rice. Pretty good but not as sweet as I  would like it. But, while it was sitting there, I could just smell the mango aroma!!! I just couldn't keep my eyes of it. I felt bad cuz my friend was talking to me while I was just staring at the dessert wanting to eat it.. =(\n\nWe also ordered the Mixed fruit panna cotta with mixed fresh fruit on top. Panna cotta was actually really good. Good smooth texture with the perfect amount of sweetness. Loved it. Although the fruit wasn't sweet at all, the mango sauce made up for it when you eat it all together.\n\nThey not only sell desserts but also entrees like fried rice, noodles, and mango salad with prawns! Lots of MANGO stuff but it IS called Mango Medley. \n\nI'll probably come again to try something else..", "rating": 3, "date": "2008-08-21"}, {"excerpts": ["The prawns were ok, but the rest of the salad was just a strange mix-match of fruit and vegetables that seemed completely random, and the sauce / salad dressing didn't add anything whatsoever. "], "author": "Andy B.", "review": "I was appalled at how awful my experience at Mango Medley was. \n\nI've lived in the neighborhood for a couple of years and had yet to try it out... so last night I figured what the hell. NEVER AGAIN!!!!!!\n \nRight off the bat the waitress chucked like 6 menus at us and then without saying a word walked away for about 10 minutes. When she finally returned we ordered an appetizer dish that was a combination of a few different appetizers. There were muscles, salmon toast, eggplant, and a small salad. The salmon toast was FISHY as can be, the muscles tasted like some weird combination of vinegar and ripe cheese, the eggplant had some chunks of sausage or bacon or something, and the salad didn't taste fresh at all. Every bite seemed worse than the last. \n\nI've never said \"this tastes weird\" so often in my life. After eating maybe 1/3 of the appetizer dish, the waitress brought out my girlfriend's salad. The prawns were ok, but the rest of the salad was just a strange mix-match of fruit and vegetables that seemed completely random, and the sauce / salad dressing didn't add anything whatsoever. Then 15 minutes later, the waitress finally brought out the stir fry terriyaki chicken that I ordered which wasn't terrible, but not nearly as tasty as the frozen trader joes stir fry that I make at home. \n\nMy water was gone in the first 5 minutes and the waitress never offered me any more. Then once we finished \"nibbling\" at our \"meal\" no waitress didn't ask us if we wanted desert, but simply brought out the check. \n\nThen I tried to pay with my credit card, but was told that they didn't accept credit cards. The waitress then pointed to a non-existent sign up front and said \"no credit card all over place.\"\n\nThen she pointed across the street to a market where I could supposedly get cash from, but when I walked over there, they were closed. I had to walk 3 blocks down to the 7-11 to get cash to pay for the SLOP that had been piled in front of me. \n\nMy campaign to make sure that nobody ever goes here again begins with this posting, and will not end until everyone I know here's about this dump and how horrible my experience was in it.", "rating": 1, "date": "2010-11-18"}, {"excerpts": [", Kimchi fried rice, hot milk tea and green tea cream pillows, pana-cotta with mango sauce, and mango medley delight.\n\n", "Out of All (Pana-Cotta w/ Mango Sauce)\n", "The mango sauce that accompanies the pana-cotta, similar to yogurt pudding  jello that is not to sweet makes the dessert just right. \n\n"], "author": "Sylvia C.", "review": "Came here on a Sunday with my Family and got the place for ourselves. I guess not many people go out for dessert on Sunday. \n\nOrdered Set B on the Specials Menu, Kimchi fried rice, hot milk tea and green tea cream pillows, pana-cotta with mango sauce, and mango medley delight.\n\nBest Dessert Out of All (Pana-Cotta w/ Mango Sauce)\nThe mango sauce that accompanies the pana-cotta, similar to yogurt pudding  jello that is not to sweet makes the dessert just right. \n\nGreen Tea Creme Pillows\nA dish with two thin crepes wrapped around whip Creme and green tea ice cream, making squares like pillows. \n\nMango Delight\nThis would be a great dessert for Mango lovers but too sweet for my taste. \n\nKimchi fried rice wasn't so good.", "rating": 4, "date": "2011-11-13"}, {"excerpts": ["Service is disorganized (we had to beg them to \"re-open\" the kitchen at 10:30 - even though the sign said the kitchen closes at 1115) and slow (it took ~1 hour to get 2 orders of fried rice) and the entrees are very bland (thank god for sriracha rooster sauce).  "], "author": "Rosers M.", "review": "Finding late night restaurants (ahem...by late I mean 10:30p) in the Outer Richmond/Sunset is like looking for sidewalks that don't smell like pee in San Francisco - they're rare but you just follow your nose.  \n\nSo here we were last Saturday night, excited to get our grub on - and we were throughly underwhelmed.  Service is disorganized (we had to beg them to \"re-open\" the kitchen at 10:30 - even though the sign said the kitchen closes at 1115) and slow (it took ~1 hour to get 2 orders of fried rice) and the entrees are very bland (thank god for sriracha rooster sauce).  Calling it Asian \"fusion\" is pretty big stretch for this place - it's about as fusion as IHOP is International...\n\nAll in all, one star for being open late in the Richmond and one star for serving mango sticky rice with black rice - next time you're out of late night options in the Richmond hit up Walgreens for some mint choco chip Clif Bars instead!", "rating": 2, "date": "2011-05-07"}, {"excerpts": ["They've some new menu items including the decadent mango bliss, which is a huge glass of mango ice cream with mango sauce, and topped with fresh mango.  "], "author": "Joanne G.", "review": "Service was actually slightly faster this time around!  Not horribly long, but still expect your dishes to come out one at a time at this two women operation.\n\nTheir savory dishes are actually quite good- I had a very garlicky Portuguese baked pasta with chicken, which at $9 was plenty of food to split between two\n\nThey've some new menu items including the decadent mango bliss, which is a huge glass of mango ice cream with mango sauce, and topped with fresh mango.  It looks amazing.\n\nTheir ginger milk custard is still delicious too.", "rating": 4, "date": "2008-06-28"}, {"excerpts": ["Mango custard with mango sauce with mango ice cream with mangos. "], "author": "Madeline N.", "review": "I had no idea there were even restaurants this far out in the Sunset. I thought we had wandered into a no man's land of semi-suburbia when my friends pointed out this tiny little gem of Taiwanese desserts. \n\nUnlike most dessert places - i.e. Sweet Indulgences in Millbrae - this one is not rife with cutesy furniture. Instead it feels like you walked into someone's living room and they just happen to serve delicious desserts. \n\nWe didn't waste our time on the food menu and went straight for the kill. Assessment of our choices. \n\n1. Sesame dumplings: It only looks like it's floating in a bed of tar! Honestly, awesome. Slightly sweet, turns your teeth black, but completely worth it. \n2. Mango tofu fa: Ordered it on a whim (mango + tofu fa?! wha?!) but it turned out surprisingly good. We received it cold but rumor has it that hot is an option. \n3. Grass jelly and almond jelly w/mango: Light, flavorful, good for sharing. \n4. Mango bliss: It came in a goblet! Mango custard with mango sauce with mango ice cream with mangos. Lives up to its name. \n\nIf you're out here, come visit. If you're not, think about visiting. It's kind of delicious.", "rating": 4, "date": "2011-01-09"}, {"excerpts": ["We also ordered the Roti with squash curry dipping sauce (NO MANGO ROTI EXISTS!! ", "=(  ", "I asked ), Mango Medley, Mixed fruit panna cotta, mango tofu-fa (sweet tofu), corn pancakes, chicken and rice, purple yam and red bean pillows, thai tea latte, and creme brulee.  ", "For Happy Hour (some daytime hours and after 9pm on weekdays, for #1-8 on the HH menu, you get additional choices of buttermilk panna cotta, tofu-fa, or coffee.  ", "The Roti came with 2 roti cakes, and the squash curry sauce.  ", "The sauce was a little spicy, but it went well with the Roti.  ", "It was actuallly very delicious!  ", "I would definitely get that again if I ever go back... ", "The Thai tea latte was hot, and tasted really good.  ", "It also reminded me of the thai tea latte that i have in packets at home.  ", "The pillows took the longest to come out (around 11:40pm).  ", "There were 4 pillows--red bean and purple yam bits with whipped cream wrapped in crepe-like wrapper into the form of a pillow.  ", "It was good, but would have been better if the stuff inside wasn't cold!! "], "author": "Diane L.", "review": "Believe it when everyone says that service is SLOW.  It's ridiculous!  I didn't think it could be THAT bad... so I gave it a chance.  Came here with 10 people tonight for some dessert, around 10pm.  The place really only holds 20 people max.  It's very small.  Luckily for us, there were 2 really nice people who offered to move tables for us so that we could all sit together.  (THANKS if you're reading this!!)  Don't come here with a lot of people.  \n\nThe menu is pretty extensive, and has no real identity... we couldn't tell what culture this restaurant was supposed to be...  We all ordered different things, but they all came out one by one... like 20 minutes after an other.  It was ridiculously slow. \n\nMy friend tried to order vanilla ice cream by itself (he doesn't like asian desserts) and the waitress looked at him as if it was the most absurd order EVER.  After a bit of convincing, the waitress said regular vanilla ice cream was fine (for $3.25! - I mean come on! They serve red bean paste over vanilla ice cream but we still had to convince her to serve regular ice cream?!?! LOL)\n\nWe also ordered the Roti with squash curry dipping sauce (NO MANGO ROTI EXISTS!! =(  I asked ), Mango Medley, Mixed fruit panna cotta, mango tofu-fa (sweet tofu), corn pancakes, chicken and rice, purple yam and red bean pillows, thai tea latte, and creme brulee.  For Happy Hour (some daytime hours and after 9pm on weekdays, for #1-8 on the HH menu, you get additional choices of buttermilk panna cotta, tofu-fa, or coffee.  So I got the panna cotta with the Roti.  \n\nThe food was good, but again, the service was SOOOOOO incredibly slow that we wanted to cancel half our orders... and even then, we couldn't get the waitress' attention.  I think she goes and helps the person in back cook.  We felt bad for her, but seriously... hire another person!! \n\n We also ordered Kimchi fried rice, but the waitress got the order wrong and brought out this tofu, eggplant fried rice.  When we told her it's wrong, she told us there was no more rice, so she couldn't re-do the order.  How pathetic!  My friend was so hungry that she took it anyway.  It tasted good, but seriously, get your act together!\n\nOther than that mishap, the mango puree that accompanies most desserts is absolutely delicious!!!  The mangos were ripe and sweet.  The panna cotta had too much of a cream cheese flavor, I would have done without it.  The Tofu-fa flavor was strongly masked by the mango puree.  You couldn't taste the tofu-fa at all unless you ate it by itself, and even then it wasn't as sweet as you thought.  But it's still good.  The corn pancakes were different from any kind of asian pancake I've had.  You can tell it was made from scratch.  Very tasty, but SOo hot when it comes out!  The Roti came with 2 roti cakes, and the squash curry sauce.  The sauce was a little spicy, but it went well with the Roti.  It was actuallly very delicious!  I would definitely get that again if I ever go back... The Thai tea latte was hot, and tasted really good.  It also reminded me of the thai tea latte that i have in packets at home.  The pillows took the longest to come out (around 11:40pm).  There were 4 pillows--red bean and purple yam bits with whipped cream wrapped in crepe-like wrapper into the form of a pillow.  It was good, but would have been better if the stuff inside wasn't cold!! and if it had more powdered suger on top.\n\nOverall, good food but terrible service.  It's not fancy inside, so don't expect the plates/cups/utensils to be fancy either.  Set aside a good 2hours if you want to come here.", "rating": 3, "date": "2009-08-14"}, {"excerpts": ["We ordered Thai Chicken Salad, a White sauce pasta with chicken and mushrooms, and a sweet red bean desert. ", "The food here is great. ", "Very good and homie HK/JPN style Asian fusion. "], "author": "Lance C.", "review": "My girlfriend took me here last night. We ordered Thai Chicken Salad, a White sauce pasta with chicken and mushrooms, and a sweet red bean desert. The food here is great. Very good and homie HK/JPN style Asian fusion. Not American Asian fusion, which I don't like much.  \n\nThe place is small, but that must be why they can keep up with the good cooking. I will have to try more of their deserts next time.\n\nCustomer service is good, too. Based on my girlfriend, they hired more servers so maybe that's why I didn't feel the bad services other yelpers mentioned before. \n\nWill come again for sure.", "rating": 5, "date": "2009-08-29"}, {"excerpts": ["Hubby chose the baked seafood spaghetti with a tomato-based sauce, with Mango Medley deluxe as the dessert.\n\n", "The bacon and mushroom spaghetti had a light, onion-flavored cream sauce, a right size portion to eat in one sitting, with fresh mushrooms and topped with cheese.  ", "The organic sesame soy drink was great as well; the sesame was ground very finely, and not too much sugar, which was to my liking.  ", "Hubby's baked dish took longer to come since it was baked, but it was good as well, with right amount of seafood, light tomato sauce and al dente spaghetti, topped with cheese.\n\n"], "author": "Vicky F.", "review": "Being HK style food fans and after reading reviews of this place, hubby and I decided to give it a try.  We came on a Tuesday night around 8:30pm, and the place had about 3 tables.  We sat ourselves and picked up menus on the empty tables to decide what to order.  Since we had already read the reviews we kind of expected to do a lot of self-service, which was not a problem with us.\n\nAfter spending a good amount of time going through their extensive menu (as we could not decide what to order, so many items!), I settled on the bacon and mushroom spaghetti with ground pork, and ordered an organic sesame soy milk.  Hubby chose the baked seafood spaghetti with a tomato-based sauce, with Mango Medley deluxe as the dessert.\n\nThe food took a long time to come.  It was very delicious, however.  The bacon and mushroom spaghetti had a light, onion-flavored cream sauce, a right size portion to eat in one sitting, with fresh mushrooms and topped with cheese.  The organic sesame soy drink was great as well; the sesame was ground very finely, and not too much sugar, which was to my liking.  Hubby's baked dish took longer to come since it was baked, but it was good as well, with right amount of seafood, light tomato sauce and al dente spaghetti, topped with cheese.\n\nThe Mango Medley deluxe dessert was also pretty good, with many slices of sweet mango.  It's served with a mango slush underneath with bits of coconut jelly.  The slush was very smooth.\n\nOverall, we liked the food there a lot and definitely will go back.  But I agree with other yelpers - don't go there when you are super hungry - it's more like a place to go when you have some time so you can sit and chat while waiting for the food.", "rating": 4, "date": "2010-10-22"}, {"excerpts": ["the mango sauce/puree was very good. ", "it was sweet and the mango was ripe. ", "i've had many mango desserts where the mango is still hard! ", "those mangos are not to be served as a dessert. ", "the panna cotta was more on the tart/sour side. ", "not sure why "], "author": "Kapo T.", "review": "mango medley. i am never in this neighborhood so i didn't know this was here before. my friend took me here the other night because she was craving their mango dessert. i've had lots of mango desserts before and i haven't found one as good as the Hong Kong dessert places in the bay area... until mango medley.  we ordered the mango panna cotta and mango cream pillow.  \n\nthe mango panna cotta was ok.  the mango sauce/puree was very good. it was sweet and the mango was ripe. i've had many mango desserts where the mango is still hard! those mangos are not to be served as a dessert. the panna cotta was more on the tart/sour side. not sure why but if you eat it with the mango, it tastes ok. \n\nthe mango cream pillow was good. the pancake was light and not burnt. the cream and the mango ratio was perfect. this is as good as the dessert places in Hong Kong! \n\nyes, service is very slow because there's only 1 waitress and 1 cook.  the waitress helps the cook out after she takes the orders. if you do not have patients, please don't come here. in the meantime, i'll be back to try their other desserts... or maybe dishes too! \n\nside note: parking is usually hard around this area.", "rating": 4, "date": "2010-03-20"}, {"excerpts": ["Except at Mango Medley, you can do this over a generous $7 plate of grilled zucchini, spinach rice noodles and grilled fresh prawns, with a light, lovely sauce of mirin and spicy oil. ", "From the comfort of a hideous orange/pink modern plush chair in a cafe setting that looks like Miami threw up all over itself. "], "author": "Megan W.", "review": "Much like the outer Sunset itself, this is a surreal, oddly lifeless place to ponder one's life direction through the gauzy ennui of a low-budget indie film. Except at Mango Medley, you can do this over a generous $7 plate of grilled zucchini, spinach rice noodles and grilled fresh prawns, with a light, lovely sauce of mirin and spicy oil. From the comfort of a hideous orange/pink modern plush chair in a cafe setting that looks like Miami threw up all over itself. In a cute way. \n\nThe menu is comprehensive, pan-asian, and possibly a little ambitious considering they have exactly two people working there and it takes over an hour to be served. But, you know, if you're not down with a slower pace of life, you need to get out of this neighborhood PDQ.", "rating": 4, "date": "2007-01-30"}, {"excerpts": ["Baked seafood over rice with cream sauce was delicious, nice and hot and the taste kind of tasted homey...", "you know that taste? ", "My lady had this dish with seafood i think..or chicken..", "hahah ", "i dont remember cause all I remember is my dish! "], "author": "phillip w.", "review": "hahaha thought on my old review i rated them horribly, but i guess i was more lenient before...cause i would of only gave them a 2 last time. The wait time was horrendous back then but they have changed that up and its much better now, they only have like two girls working there but they are doing a better job then i remembered. \n\nBaked seafood over rice with cream sauce was delicious, nice and hot and the taste kind of tasted homey...you know that taste? My lady had this dish with seafood i think..or chicken..hahah i dont remember cause all I remember is my dish! lol\n\nwe also had drinks...i had this green tea milk drink..which tasted healthy and my lady had...um jasmine tea? lol I keep thinking about the baked seafood~ I havent ate a baked seafood like this in a long while..give it a shot..", "rating": 4, "date": "2009-04-27"}, {"excerpts": ["So I've been here a few times now, I think the 1st time I had Roti and curry sauce, it was good not great! ", "Then yesterday I got the mango, ice cream, and cream pillows..", "mmmm.....", "they were so good! ", "Simple but good!\n", "I mean it's pretty much a crepe with mango piece, mango icecream and cream in the middle", ", how can you go wrong right? ", "I want to go back and try their savory dishes. ", "They are a bit pricey for that kind of chinese food but it looked pretty good."], "author": "Karen T.", "review": "So I've been here a few times now, I think the 1st time I had Roti and curry sauce, it was good not great! Then yesterday I got the mango, ice cream, and cream pillows..mmmm.....they were so good! Simple but good!\nI mean it's pretty much a crepe with mango piece, mango icecream and cream in the middle, how can you go wrong right? I want to go back and try their savory dishes. They are a bit pricey for that kind of chinese food but it looked pretty good.", "rating": 3, "date": "2010-02-20"}, {"excerpts": ["I like the baked seafood rice in tomato sauce. ", "They're not cheap on ingredients either. ", "The dish is filled with shrimp, scallop, salmon, and fish. ", "The baked portuguese spaghetti is cooked in a similar to curry-sauce. \n\n"], "author": "Wendy L.", "review": "I've been coming back to this place occasionally for the past year. Whenever I want to reminisce my Hong Kong trip, I come here. The place is vastly influenced by the Hong Kong cuisine. There are even Hong Kong street signs on the wall!\n\nMy faves are the baked seafood rice and baked portuguese spaghetti. The chef here must really like garlic, because you can taste it in every dish. To some it may be overpowering, but I love the garlic taste. I like the baked seafood rice in tomato sauce. They're not cheap on ingredients either. The dish is filled with shrimp, scallop, salmon, and fish. The baked portuguese spaghetti is cooked in a similar to curry-sauce. \n\nI always finish off the meal with the mango delight dessert, because it is the only dessert that includes mango ice cream. I always choose the panna cotta as the base. It's topped with mango puree and mango slices. \n\nWhen I first started coming here, it was a one woman show. But I believe they've hired some help now. Last time I came, I saw two waitresses helping out, but didn't seem to fully grasp the system. Hopefully, they're fully trained now and service will be a lot faster.", "rating": 4, "date": "2009-12-13"}, {"excerpts": ["Other people ordered ramen soup noodles that came with a ton of veggies and tofu, the Bolognese backed spaghetti had a good sauce, and the Thai noodles with veggies looked like a light entree. ", "The food was cooked home-style and the portion size was decent. "], "author": "Candace F.", "review": "My friends wanted to come here for a snack/dinner on a quiet Sunday late afternoon. The place was practically empty. It's a quaint, cozy place with a limited number of tables and chairs. The menu offers a variety of entrees, salads, and desserts. I ordered baked spaghetti with 2 huge slabs of pork chop and with plenty of broccoli and cauliflower.  I could only finish half my food and was full from 1 pork chop. Other people ordered ramen soup noodles that came with a ton of veggies and tofu, the Bolognese backed spaghetti had a good sauce, and the Thai noodles with veggies looked like a light entree. The food was cooked home-style and the portion size was decent. The wait wasn't too bad as we were one of 2 tables occupied. \n\nThere was virtually no service as the waitress just took our orders and brought us our food. We had to get our own tea and set up our own utensils, which was a small amount of labor for some delicious home style cooking. I was too full to have dessert. But I was really tempted to get the special mango dessert for $6.50 that comes with mango chunks, almond jelly, and scoop of vanilla ice cream. I think there were variations as to what you wanted to be added to your mango \"sundae\". I had a small taste of my friend's sundae and it was good - sweet and satisfying. I will probably come back again to try some of their other dishes and for dessert.", "rating": 4, "date": "2008-06-24"}, {"excerpts": ["Although the sauce that accompanies the roti is super yum, curry flavor with a spicy kick.  \n", "-baked seafood rice with tomato sauce: super good, pungent on the garlic flavor, but we all thought it was yummy not overpowering.  ", "It came with shrimp, scallop, salmon, mussel, tilapia.  \n", "-baked ", "spinach noodle: very thin and soft noodles, in a basic sesame oil sauce with eggplant and tofu.  "], "author": "Christina D.", "review": "UPDATE:\nCame here for dinner on a Wed night, only 1 other table was dining, so the wait/service wasn't bad at all.  When eating at a mom n pop cafe place, expectation's of course not very high, but the food we got were all very delicious!\n\nWe had:\n-roti: probably the worst of the bunch.  It's the type of pancake that comes from the frozen packaging in Asian supermarkets.  My family gets that alot and make it when we're lazy, so would not recommend getting it here.  Although the sauce that accompanies the roti is super yum, curry flavor with a spicy kick.  \n-baked seafood rice with tomato sauce: super good, pungent on the garlic flavor, but we all thought it was yummy not overpowering.  It came with shrimp, scallop, salmon, mussel, tilapia.  \n-baked Portuguese spaghetti: almost thai yellow curry style but with strong garlic flavor again, but again, not overpowering, highlights the other flavor quite well.  \n-sesame spinach noodle: very thin and soft noodles, in a basic sesame oil sauce with eggplant and tofu.  Very refreshing, solid\n\nWith the 3 entrees, every time I try one, I feel like that's the best, but as I eat another, that one suddenly reigns supreme.  That must be a good sign right?  And we got their signature dessert to finish it off, it wasn't very impressive.  Surprisingly, I would say come here for dinner if you're in the neighborhood and want something simple to go, but you can get better desserts elsewhere, esp in sunset.   \n--------------\nThey offer such a huge variety of foods, from HK style baked pasta/rice, to thai/indonesian plates like curries and fried rice, they even have Korean pancake, ramen, Vietnamese spring rolls, and roti (the thin crepe like appetizer that everyone and their mama get at Banana Island).  We seriously could not stop staring at the menu for 30 minutes, just admiring each picture, booked our next dinner date because we MUST try this place.  \n\nThe desserts were ok, I had the panna cotta with mango  and its pure.  It's actually like a soft yogurt custard, sorta weird.   The ambiance resembles the perfect cozy neighborhood spot.  One thing though, it seems like a 1 person team, the service is EXTREMELY slow.  We only ordered 4 desserts, none of which requires real cooking, but it still took her at least 30 min. to bring it out.  But for such a small place, I'll overlook that for now, and dream about the explosion of flavors in my mouth when I actually eat here.", "rating": 4, "date": "2008-06-02"}, {"excerpts": ["The sauce was sweet; it was just really good. \n\n"], "author": "kim w.", "review": "YES, service is slow, thats why i brought my DS lite.\n\nThe place looks like it used to be a coffee shop, now a chinese dessert/western style food restaurant?\n\nNothing really looked good in the pictures.  I came only for the panna cotta, but was hungry and decided to get some food as well.  It was actually good that it took the waitress so long to take our order because we didnt know what we wanted.\n\nThere were 2 other tables besides us this afternoon.  \n\nI had the mushroom and bacon spaghetti - YUM!!!!!! it was actually REALLY good.  Portion was kinda small, but I finished it instead of boxing it to take home.  I'd say it was jussssssst right.  The sauce was sweet; it was just really good. \n\nBf got curry seafood spaghetti, i didnt try it, it looked gross.  Bf said mine was better.\n\nMango Panna Cotta - A BOWL OF HEAVEN!!!!!! i loved it.  Not too sweet, refreshing, delish.\n\nOne of the tables had to change their minds and got their meal to-go because it took too long.\n\nWith my DS, waiting was no biggie. :P", "rating": 3, "date": "2009-02-01"}, {"excerpts": ["I usually order the mango cream pillows, mango bliss, and almond jelly with mango sauce and fresh mangos. ", "The mangos they used, at least every time I go are always ripe and sweet and have me a returning customer. ^_^"], "author": "Jonathan L.", "review": "I come here at least twice a month and I love it despite the slow service. As other reviewers have stated the service here is really slow because they only have 1 SERVER. She basically has to to do everything so if you don't have at least an hour or so to spare, this place may not be for you. \n\nI only order the mango desserts and they are really tasty. I usually order the mango cream pillows, mango bliss, and almond jelly with mango sauce and fresh mangos. The mangos they used, at least every time I go are always ripe and sweet and have me a returning customer. ^_^", "rating": 4, "date": "2011-05-01"}, {"excerpts": ["White Wine Sake Sauce - So yummy! ", "Desserts:\n1) Panne Cotta with Fruit Sauce - light, refreshing, and delish!\n2) ", "Mango Crepes ", "(I think they are called mango pillows) - yummy! ", "Pretty simple dish - ripe mangoes, whip cream, crepes - but oh so good!\n", "3) "], "author": "Kris F.", "review": "I've been coming here for the last 2 years - at one point, I was coming here about once a week because the food is so good! Sure, the wait sucks (I've waited more than an hour for my order on a couple of occasions) and Eugenie may not be the friendliest waitress (she's a busy lady - just know what you want to order so you don't keep her waiting), but just know and accept that going in - the food is totally worth it! EVERYTHING I've ordered here is tasty and amazing, and I've tried almost half the menu. Tons of vegetarian options! The only thing I didn't like was the eggplant sandwich - the bread was overtoasted and too hard. Here are my recommendations (sorry, I'm a pescetarian, so no meat suggestions):\n\nAppetizers:\n1) Vietnamese Shrimp Rolls - so fresh and delicious! Shrimp is tender and not chewy.\n2) Seaweed Salad with Tobiko - so good! Wakame, lettuce, tobiko, miso dressing, and sesame seeds - pretty standard but done right.\n2) Vietnamese Spring Rolls (Vegetarian) - yummy veggie alternative to the shrimp ones (tofu and shitake mushrooms instead of shrimp).\n\nEntrees:\n1) Ramen with Mixed Mushrooms in Soy Broth - the best I ever had! Even better than Japantown. Fresh, crisp veggies and a variety of mushrooms. Broth is tasty and noodles are perfectly done.\n2) Spinach Noodles with Tofu and Mixed Mushrooms - my old standby. Flavorful and filling.\n3) Rice Wine Tofu and Mushrooms over Rice - great light dish if you aren't that hungry. So very tasty!\n4) Tamarind Tofu and Veggies over Rice - my bf's favorite! Lots of flavor and just the right amount of spiciness.\n5) Garlic Basil Linguine with White Wine Sake Sauce - So yummy! If you need a garlic fix, this is for you!\n\nDesserts:\n1) Panne Cotta with Fruit Sauce - light, refreshing, and delish!\n2) Mango Crepes (I think they are called mango pillows) - yummy! Pretty simple dish - ripe mangoes, whip cream, crepes - but oh so good!\n3) Mango Bliss (buttermilk panna cotta and mango sorbet version) - tasty, refreshing, and fruity - a must if you love mangoes.\n\nDrinks:\n1) Hot Ginger Honey - my usual order, a definite must on a cold, foggy day/night. Fresh pressed ginger juice, water, and honey - oh so good for you!\n2) Hot Milk Green Tea with Soy Milk - my go-to drink of choice if it weren't for the calories. Yummy milky goodness!\n3) Hot Chai Latte - so tasty! Maybe not as authentic as the chai tea at Golden Gate Pizza and Indian Cuisine down the street, but still a tasty blend of spices and milk.\n\nThe parking sucks, as are the wait and service (hence the minus 1 star), but as I said before - THE FOOD IS WORTH IT!!!! Especially if you are vegetarian. Prices are reasonable and ambiance is cozy. They just expanded the seating so that should help with the late night rushes. Whenever I have family or friends visiting, I take them here and they love it too!", "rating": 4, "date": "2008-07-31"}, {"excerpts": ["the food was average\nbut the sauce was good, price was a little more than many Asian restaurants and the service  good."], "author": "Howard J.", "review": "went to this palace on New Years day , parking wasn't  a problem the restaurant is small and holds about 20-25 seat? . the food was average\nbut the sauce was good, price was a little more than many Asian restaurants and the service  good.", "rating": 3, "date": "2009-01-04"}, {"excerpts": ["they even ventured to make healthy, organic, and even vegan dishes, including pastas; i myself tried the shrimp with basil tomato sauce over spinach vermicelli, which was quite good, if i am able to say. ", "just a little bit of spiciness, perfectly cooked shrimp, and an interesting style of tomato sauce that combined arrabiata with marinara - a kind of happy medium. \n\n"], "author": "Ben T.", "review": "mango medley? the illiteration in the name should speak volumes for their creativity.\n\nthe service was a bit awkward; every time i wanted the waitress she was nowhere to be found, and evevry time i needed a minute, she was breathing down my neck. outside of the service, the food was quite interesting. fresh, healthy ingredients made for very inspiring cookery, and also a nice variation of hong kong style desserts. \n\nthey even ventured to make healthy, organic, and even vegan dishes, including pastas; i myself tried the shrimp with basil tomato sauce over spinach vermicelli, which was quite good, if i am able to say. just a little bit of spiciness, perfectly cooked shrimp, and an interesting style of tomato sauce that combined arrabiata with marinara - a kind of happy medium. \n\nthe decor seems a bit.. overthought. bright orange room, with a few actual tables with ikea-like seats on a tiny coffee table. \n\nhowever, this is definitely a nice place to eat and take your friends for a nice chat, or even an occasional snack. stop by if you're in the area.", "rating": 4, "date": "2006-08-07"}, {"excerpts": ["It wasn't too creamy, but not like watered down spaghetti sauce.  ", "Oh and it's also not the type of restaurant where you get service, more like get your own tea, get your own chili sauce.  ", "So I guess next time I should come here for dessert, because apparently by the time we left there were more people, and they all ordered only drinks and dessert.  ", "Maybe after I try those I can give it a better rating."], "author": "Yosie G.", "review": "Mango Medley.. I'm guessing their specialty is mango.  Unfortunately I just thought of that now, even after seeing several items on the menu with mango.  Not bright, I know. \n\nJust got back from this place, reviewing while it's fresh (first review after four months, woo hoo!).  The place isn't too big, the staff doesn't really talk to you much.  At about 9pm the place wasn't packed - only two other tables filled plus us.  Initially I thought it's just a cafe place, you know with drinks and all but of course I was wrong.  The menu is decent with a variety of options.  I ended up ordering the baked Portuguese spaghetti w/chicken.  It takes a longer wait, compared to like other Chinese restaurants.  The food was ok, it was definitely an interesting taste, not like the other baked Portuguese at Macau and Friends.  It wasn't too creamy, but not like watered down spaghetti sauce.  Oh and it's also not the type of restaurant where you get service, more like get your own tea, get your own chili sauce.  So I guess next time I should come here for dessert, because apparently by the time we left there were more people, and they all ordered only drinks and dessert.  Maybe after I try those I can give it a better rating.", "rating": 2, "date": "2008-08-05"}, {"excerpts": ["was sooooo good with the sake cream sauce. \n", "-kimchi fried rice- very good with good amt of kimchi and taste- trust me.. ", "I have eaten lots of kimchi ", "fried rice (I am korean! ", ":)\n-steak ", "platter- ", "my hubby loved the steak which was so tender and tasty\n-ramen with grilled chicken thigh - ", "oh it was sooooo good. ", "i thought it was way better than ramen i paid $12 in japantown. ", "Mango medley's was only $6.95 wtih a drink!!!  ", "what a steal \n-seafood with spinach linguine!!!- ", "very good tomato sauce and again lots of fresh seafood. \n"], "author": "Shy z.", "review": "This place is awesome! Came here while visiting SF --- what a cute place. \nThey have really good food and drinks. Prices are reasonable and everything we ordered was good and you can tell they use good/fresh ingredients. Just to warn you though.. it's a small place and they only have few people working there so depends on when you go you might have to wait for your food. They do have great magazines and great music playing so we didn't mind waiting and just hanging out. \nWe went 2 times while visiting SF and here are what we ordered. \n-Seafood bake dish wok fried rice--- this is the best seafood bake HK style I have ever had!!! there were good amt of fresh shrimp, scallops, fish and veggie and the fried rice was sooooo good with the sake cream sauce. \n-kimchi fried rice- very good with good amt of kimchi and taste- trust me.. I have eaten lots of kimchi fried rice (I am korean! :)\n-steak platter- my hubby loved the steak which was so tender and tasty\n-ramen with grilled chicken thigh - oh it was sooooo good. i thought it was way better than ramen i paid $12 in japantown. Mango medley's was only $6.95 wtih a drink!!!  what a steal \n-seafood with spinach linguine!!!- very good tomato sauce and again lots of fresh seafood. \n- my favorite drink was the white chocolate whipped coffee\n- green tea ice cream was delicious and mango pillow was to die for.... \n\nI wish seattle had a mango medley. Cute, comfortable place with good food and drinks... I can't wait to come back to SF and eat again at MM!!!", "rating": 5, "date": "2011-02-01"}, {"excerpts": ["the cream sauce is just right, the flavor has different layers..... worth coming if you are not in a rush!"], "author": "L L.", "review": "both food and desserts are great! I would give it a 5 star rating, but slow service, i have to take a star away. my hubby ordered the chicken fettuccine with garlic and basil.....tasted very good, it's like a party in my mouth. the cream sauce is just right, the flavor has different layers..... worth coming if you are not in a rush!", "rating": 4, "date": "2008-10-27"}, {"excerpts": ["The other two dished we ordered were Thai Sauce Spaghetti with Chicken and Fresh Pineapple Baked Riced. ", "The Pineapple was indeed fresh but besides that, the dished were kind of unimpressive."], "author": "Eleonore L.", "review": "The food is just okay. Nothing special. Somewhat boring. The only dish I can recommend is the Spicy Mango Salad with Prawns. That was pretty good. The other two dished we ordered were Thai Sauce Spaghetti with Chicken and Fresh Pineapple Baked Riced. The Pineapple was indeed fresh but besides that, the dished were kind of unimpressive.", "rating": 3, "date": "2008-12-06"}, {"excerpts": ["I had the shrimp and spinach noodles, and even though it looked like they were in plain ol' marinara sauce, it's a tomato sauce with basil and possibly fish sauce, which I suppose makes it \"Asian fusion\" to some extent. ", "They had a lot of veggie (and even some vegan) options too. ", "The one pitfall of this place is the service. ", "I don't know if we caught the waitress on a bad day or what, ", "but she didn't smile the entire time we were there. ", "We brought in a dessert to eat afterward and almost weren't allowed to eat it (even though we had ordered appetizers, drinks, and a meal!). ", "It's still worth checking out though."], "author": "Tami H.", "review": "Nice selection on the menu (though the photos are kinda blurry), and I love that they have coffee drinks with Asian snacky snacks. The decor is Ikea cozy, but the bathroom is lit by a dim purple light, which sets a great mood....if it weren't in the bathroom. The roti was pretty good, and the Korean pancakes were yummy too (but my friend thought they were too potato-ey? hah). I had the shrimp and spinach noodles, and even though it looked like they were in plain ol' marinara sauce, it's a tomato sauce with basil and possibly fish sauce, which I suppose makes it \"Asian fusion\" to some extent. They had a lot of veggie (and even some vegan) options too. The one pitfall of this place is the service. I don't know if we caught the waitress on a bad day or what, but she didn't smile the entire time we were there. We brought in a dessert to eat afterward and almost weren't allowed to eat it (even though we had ordered appetizers, drinks, and a meal!). It's still worth checking out though.", "rating": 4, "date": "2007-03-19"}], "mango pineapple tomato avocado": [], "mango bliss": [{"excerpts": ["I got the Mango Bliss with panna cotta which I really liked. ", "Mangoes were sweet and you sure do get a lot of mango flavor (mango heaven!). "], "author": "Stephanie L.", "review": "I don't know why this place has such low reviews, but I enjoyed my time here.\nI came around 9:30pm on a Sunday night for dessert.\n\nI got the Mango Bliss with panna cotta which I really liked. Mangoes were sweet and you sure do get a lot of mango flavor (mango heaven!). Panna cotta had good texture and was not too sweet.\n\nThe bf didn't eat dinner yet and got their kimchi fried rice which was pretty good.\n\nI saw there's lots of complaints about the smell. They do serve durian which could be the cause. But a plus if you love durian.\n\nThis place is real tiny. Seats only about a handful of people. And it's a mom and pop kind of shop so there's only one server when I was there. So service can be a bit slow, but they try their best. I didn't think it was that bad. Food still came out at a decent time and they refilled our tea and waters.\n\nI will definitely come back for dessert or even late night snacks/meals.", "rating": 4, "date": "2014-08-22"}, {"excerpts": ["Mango Bliss $6.50: 4.5 stars. ", "Mangos surrounded by mango juice, lifted by buttermilk panna cotta, enhanced by the mango ice cream. ", "Everything meshed so so well with each other. \n"], "author": "Chena N.", "review": "Dear Mango Medley,\n\nYou can definitely meddle with me ANYTIME you want. WAHAHAHA. \n\nMost Sincerely,\nStarstruck Fan \n\nJK. haha I have no idea what I just said... ANYWAYS.... Came here for some late night dessert with a friend after studying for endless hours at my new home, aka the School Library. Cannot vouch for their food, but their dessert is definitely a MMMM MMMM fricken MMMMMMMMMMMMMMMM. Or maybe I was just in desperate need of some sugar. \n\n~.::Atmosphere::.~\nThe place is really small. Luckily on a late school night it was pretty empty. The place was Asian-ed out with little wooden benches, plants everywhere, pictures hung randomly here and there, and just cutesy stuff all around. \n\n~.::Service::.~\nDid not expect much.... Asian places usually dont have good service. Yes, I am being harsh on my own kind. Our waitress was just whatever on service and did not sound enthusiastic at all, but I'm giving her a break since she's probably closing. \n\n~.::Dessert::.~\nSo like I said, cant really vouch for their food food, but dessert is pretty good! \n\nMango Bliss $6.50: 4.5 stars. Mangos surrounded by mango juice, lifted by buttermilk panna cotta, enhanced by the mango ice cream. Everything meshed so so well with each other. \nhttp://www.yelp.com/biz_photos/mango-medley-san-francisco?select=2aVOb7YxUqEiBrNcjkukjg#2aVOb7YxUqEiBrNcjkukjg\n\nStrawberry Pillow: 3.5 stars. Basically a crepe folded like a \"pillow case\" It was filled with strawberries and whipped cream. Nothing popped out to me. \nhttp://www.yelp.com/biz_photos/mango-medley-san-francisco?select=2aVOb7YxUqEiBrNcjkukjg#DT5eFJbT09JH8Ead91rf3A", "rating": 4, "date": "2013-10-25"}, {"excerpts": ["We would always order the Mango Bliss with tofu base (highly recommended!).  ", "Due to cost of the mango flavor ice cream cost they had switched to use mango sorbet, which we found a little sour for the whole dessert ", "and we didn't enjoy it.  "], "author": "Johnston C.", "review": "I have come here in multiple occasions as my girlfriend is a fan of the mango dessert in this place.  Let's just say the mango here seems to be always sweet and tasty!  We always come by for late dinner or dessert around 10pm, so we never experience much of a wait in line.  We would always order the Mango Bliss with tofu base (highly recommended!).  Due to cost of the mango flavor ice cream cost they had switched to use mango sorbet, which we found a little sour for the whole dessert and we didn't enjoy it.  Rest assure that you can still ask for the mango flavor ice cream for a small addition charge (~$1)  \n\nI tried their baked white sauce seafood spaghetti and it was quite delicious too!\n\nNote that this place is operated by two people, one server and one chef.  So if you are someone who expects good service and quick response time, then you may not enjoy this place.  However if you are a pure foodie like me and care less in the other minor details, then you would definitely enjoy their food here!", "rating": 4, "date": "2015-02-21"}, {"excerpts": ["My friends and I have been coming here for several years for the Mango Bliss desert which is Mango ice cream, mangos, coconut sauce, mango sauce, and you can pick a base like panna cotta or jelly ", "unfortunately our last visit will be the last. ", "The service was always spotty, food took an incredible amount of time, and pricing would fluctuate. ", "For example, when ordering the \"shrimp salad\" we would be told, \"shortage on shrimp so $2 extra charge\". ", "Okay, slap on the extra charge. ", "This was all tolerated because of the Mango Bliss. \n\n", "Our recent visit we all ordered the Mango Bliss. ", "After we placed our order she comes back and says, \".75 extra for mango ice cream\". ", "The menu describes the Mango Bliss with mango ice cream priced at 6.95, but now you're verbally charging extra for mango ice cream. ", "Okay, slap on the extra charge. ", "Our mango bliss come out unusually fast. ", "Mangos are sour and acidic. ", "Rotten mangos. ", "We have been solid, flexible and accommodating customers for years and this business could care less."], "author": "Marley Q.", "review": "My friends and I have been coming here for several years for the Mango Bliss desert which is Mango ice cream, mangos, coconut sauce, mango sauce, and you can pick a base like panna cotta or jelly unfortunately our last visit will be the last. The service was always spotty, food took an incredible amount of time, and pricing would fluctuate. For example, when ordering the \"shrimp salad\" we would be told, \"shortage on shrimp so $2 extra charge\". Okay, slap on the extra charge. This was all tolerated because of the Mango Bliss. \n\nOur recent visit we all ordered the Mango Bliss. After we placed our order she comes back and says, \".75 extra for mango ice cream\". The menu describes the Mango Bliss with mango ice cream priced at 6.95, but now you're verbally charging extra for mango ice cream. Okay, slap on the extra charge. Our mango bliss come out unusually fast. Mangos are sour and acidic. Rotten mangos. We have been solid, flexible and accommodating customers for years and this business could care less.", "rating": 1, "date": "2015-08-11"}, {"excerpts": ["We ordered a variety of things and ended up with: doufu fa, mango doufu fa, mango bliss, 6 mango ice cream pillows, and 2 azuki (red bean) mango ice cream pillows.\n\n"], "author": "Courtney Q.", "review": "OH MY GOD, THE SERVICE HERE WAS TERRRRRRIBLE. /cruisecontrolforcool\n\nFirst off, my experience here wasn't bad actually (which is why it doesnt have 1 star), but the service was whatever the polar opposite of on-point is. We came with a party of 7 people and the small venue was filled up (I would say that have about 7 tables). They really really really seemed understaffed though as there was only one waitress for the whole place. Half the time I thought I would have to go shout \"fuwuyuan\" like you have to do in china, but I figured that would be impolite.\n\nWe ordered a variety of things and ended up with: doufu fa, mango doufu fa, mango bliss, 6 mango ice cream pillows, and 2 azuki (red bean) mango ice cream pillows.\n\nIt was about 10 minutes or more before our first item came: The mango medley with no utensils. We spent a good 5 mintues waiting to see if the waitress would come by so we could ask her for a spoon to no avail, so we ended up just taking one from a cup of spoons on another table. We thought it was weird that only one thing came out and not all of them at the same time, but we figured they were kinda busy, and the others would be out shortly\n\nAbout 10-20 minutes later the next two dishes came. the doufu fa and mango tofu fa. By this time, all the surrounding tables we found were OUT OF SPOONS. We managed to scavenge one up, but one of my friends had to eat his doufu fa with chopsticks. Yes, chopsticks. You can all imagine how well that worked out for him xD. I tried some of my friend's mango doufu fa, and I thought it was a bit weird mixing the mango with the ginger, but she liked it.\n\nLast but not least came the cream pillows. They were alright, but like i mentioned in my picture, they were just crepes with some more folds in them. Now, that's not a bad thing, i love me some crepes, but I wish this was explained a bit more.\n\nThe waitress herself was nice and she joked with me a bit when she was taking our orders. However, she only came to our table to drop off food. When we asked for anything else, she said okay, give her a minute, and never came back. *poof*\n\nAnother gripe: They charge $0.50 for hot water. Really? They don't even charge for hot water in China...\n\nThe decor and ambiance here were decent. They let you sit for however long you want (the waitress never brought us our bill. we had to go up and get it when we wanted to leave.\n\nAll in all, this is a good place to hang out and talk with friends if you need to catch up (good thing that was us), but if you're trying to get in  and out and get your food, this is DEFINITELY not the place for you.\n\ntl;dr\nIt's chill for a place to hang, but don't expect the service to be anything but slow.", "rating": 2, "date": "2014-04-25"}, {"excerpts": ["The mango bliss was so delicious, the mangos here are perfect. "], "author": "Ben N.", "review": "Summary: one person running the whole joint so service is not too bad, but the food is worth it. Parking is a nightmare but the usual for SF. Not good for a first date, but definitely good for a date place.\n\nFood: We got the typical mango pillows, delicious not sweet. The mango bliss was so delicious, the mangos here are perfect. well worth the wait\n\nService: one person being cashier and waiter so it's understand that the service isn't the best but she's really nice!\n\nPlace: the place is small only a couple of tables and parking is bad. But if you come during an off hour I don't think it'd take too long to get seated.", "rating": 4, "date": "2014-07-21"}, {"excerpts": ["Very thick in consistency almost like that of a milkshake as mentioned by the name; Very strong and deep mango flavor; A bit sweeter than I'd like - extra sweetness tasted more like it came from syrup than naturally from the mangoes themselves\n\nMANGO BLISS ($6.95): Presentation was nice - bowl supported by a stand almost like a tall wine glass; Contained mango chunks, mango puree/juice, coconut sauce, and mango ice cream; Didn't have this ", "but bro seemed to enjoy it immensely - thought combination of mango components meshed well with coconut sauce\n\n"], "author": "Jacquie H.", "review": "Located in a block near the infamous breakfast joint, Outerlands on Judah Street sits Mango Medley. The first thing that comes to mind when people hear Mango Medley would be anything related to mangoes and henceforth people would easily believe that this joint serves only desserts with mangoes. However, Mango Medley specializes in desserts specifically mango ones but caters to everybody's needs and serves entrees and non-mango items as well.\n\nMANGO FRAPPE ($4.25): Very thick in consistency almost like that of a milkshake as mentioned by the name; Very strong and deep mango flavor; A bit sweeter than I'd like - extra sweetness tasted more like it came from syrup than naturally from the mangoes themselves\n\nMANGO BLISS ($6.95): Presentation was nice - bowl supported by a stand almost like a tall wine glass; Contained mango chunks, mango puree/juice, coconut sauce, and mango ice cream; Didn't have this but bro seemed to enjoy it immensely - thought combination of mango components meshed well with coconut sauce\n\nHK-STYLE MILK TEA ($4.25): Seemed decent but folk had nothing to rave about; Nice how they took our request of taking out grass jelly and red bean into consideration; Not sweet; Probably wouldn't come here for a non-mango item\n\nORGANIC MANGO HOUSE MADE TOFU-FA ($5.50): Great rendition with a nice addition of mangoes; Not sweet in the least bit \n\nSERVICE: Service was a bit slow considering how many people were waiting for our table though only one lady was working though the place is quite small with approximately 6 tables \n\nDECOR: Pretty unique and quirky place; Very quaint and cozy; Felt like it had previously been a Japanese restaurant\n\nMango Medley exceeded my expectations since every dessert we ordered was strong. This place really knows how to do their mango items well so if you stick to that you'll have a great first experience here. They use as many organic ingredients as possible so they really distinguish themselves from other Asian dessert places.", "rating": 4, "date": "2015-01-27"}, {"excerpts": ["We got mango bliss and taro sauce with tofu. ", "Both were good, especially the natural tasting taro bits in the taro sauce. ", "The downsides are the strange service, nickel and diming on everything - e.g. $2 disposal fee for every item brought in to be thrown away (although not sure if they really enforce it), $5min/person, cash only."], "author": "Will C.", "review": "Decent dessert stop after dinner. We got mango bliss and taro sauce with tofu. Both were good, especially the natural tasting taro bits in the taro sauce. The downsides are the strange service, nickel and diming on everything - e.g. $2 disposal fee for every item brought in to be thrown away (although not sure if they really enforce it), $5min/person, cash only.", "rating": 3, "date": "2015-05-22"}, {"excerpts": ["We had 4 mango puffs with ice cream, 2 taro puffs, a mango medley, a strawberry bliss with panacotta, and a mango bliss with panacotta and ice cream (my favorite).  ", "The service was excellent and we were very pleased with everything."], "author": "Tricia K.", "review": "OMG!  I died and went to mango heaven!  The food is delicious!  We had the salty fish with chicken fried rice, the kimchee fried rice with shrimp and an egg, the baked scallop rice with creamy sauce, the beef brisket in a curry broth, and a pork shoulder with white rice and vegetables.  Everything was made with care & so delicious!  The desserts were out of this world!  Words can't describe the desserts.  We had 4 mango puffs with ice cream, 2 taro puffs, a mango medley, a strawberry bliss with panacotta, and a mango bliss with panacotta and ice cream (my favorite).  The service was excellent and we were very pleased with everything.", "rating": 5, "date": "2014-07-23"}, {"excerpts": ["The Mango bliss with tofu is my favorite dessert in the whole city. ", "Fresh home made tofu that compliments the ice cream perfectly. ", "Also, the Thai sticky rice is a must try!"], "author": "Ariel S.", "review": "The Mango bliss with tofu is my favorite dessert in the whole city. Fresh home made tofu that compliments the ice cream perfectly. Also, the Thai sticky rice is a must try!", "rating": 5, "date": "2016-04-24"}, {"excerpts": ["Mixed fruit panna cotta and mango bliss were good.\n\n"], "author": "Merril V.", "review": "Place: It's like a deconstructed garage/house turned into a mini restaurant. \nInterior: \"Chopsuey\" literally mean assorted pieces, doesn't have a theme. t's very crowded they could have chosen appropriate furniture to enhance the store, ergonometric wise:\n\nService: She took 20 min to give us glass of water, it's a bit understandable, it seems like it's a one-man army service. I felt bad for the asian lady she pretty much does everything\n\nFood: It's okay. Not very exceptional. Based one the price, it's not bad after all. It's a typical asian dessert place, don't expect anything fancy. \n\nWe had the:\nMango Pillows- it's very interesting, i like the texture and choice of mango( i like my mangoes, manila mangoes). I would prefer the whipped cream fresh.\n\nMixed fruit panna cotta and mango bliss were good.\n\nThey also serve savory stuff that looks delish! I would give it a try one more time.", "rating": 3, "date": "2014-08-22"}, {"excerpts": ["Because their specialties are mango desserts, I highly recommend the mango bliss or panna cotta bowl with mangoes. ", "(Both around $6) "], "author": "Annie S.", "review": "Mangoes: sweet, juicy, and healthy. Use it in desserts and you have a recipe for success.\n\nThe desserts here are yummy. Because their specialties are mango desserts, I highly recommend the mango bliss or panna cotta bowl with mangoes. (Both around $6) The panna cotta is smooth and creamy, and the mangoes on top with a little bit of mango juice is just the perfect pairing.\n\nI don't know why so many people complain of slow service because I've received quick service for the two times that I was here. (Both visits were made during the same week too.) The workers here are really friendly so try to be understanding since there is usually only one waitress taking orders and one person in the kitchen putting the desserts and foods together.\n\nAnd oh, did I mention their kimchi fried rice is to die for? If only they serve it with hot sauce on the side, the dish would be flawless.", "rating": 4, "date": "2012-01-22"}, {"excerpts": ["The panna cotta that we got with the mango bliss was just okay. ", "I didn't love it. ", "I've had better panna cotta. "], "author": "Nina Y.", "review": "First off, the order took forever. WTF. It takes you like 20 minutes before you get our order, then another 30 to make some desserts? Are you seriously like picking the mango as we were waiting. \n\nThe dessert itself was okay. The panna cotta that we got with the mango bliss was just okay. I didn't love it. I've had better panna cotta. Trader Joes FTW. \n\nOverall, just didn't have a great experience.", "rating": 2, "date": "2011-08-16"}, {"excerpts": ["I ordered the Mango Bliss with grass Jelly and my girlfriend ordered the Taro Bliss with tofu-fa. ", "The portions were HUGE for the price however the dessert was only OKAY. "], "author": "Johnny G.", "review": "I came to this dessert place with my girlfriend after watching a movie. This place may be hard to find since it's on a pretty dead street. I ordered the Mango Bliss with grass Jelly and my girlfriend ordered the Taro Bliss with tofu-fa. The portions were HUGE for the price however the dessert was only OKAY. It's a bit too sweet for my taste.\n\nService was kind of SLOW because we literally have to snipe down the waitress to order. The dessert took a little over 15 minutes to get here when there were only 2-3 other tables in here. Overally, I probably wouldn't come back because I'm not a big fan of Asian dessert places.\n\nParking on the street only. Shouldn't be too hard to find parking at night. Daytime may be a different story.\n\nCASH ONLY!", "rating": 3, "date": "2011-08-30"}, {"excerpts": ["We ordered a Mango Bliss with Almond Jelly, a Mango Bliss with Panna Cotta, a Mango Panna Cotta Bowl, and 2 Mango and Ice Cream Pillows. \n\n", "Mango Bliss has TONS of fresh mango, ice cream, this coconut syrup thing, mango puree, and your choice of base. ", "Almond jelly was really good as a base cause the almond taste balances the sweetness of the ice cream. ", "The Mango Panna Cotta is basically the Mango Bliss without the ice cream and topped with this jelly stuff. ", "It's pretty good ", "Definitely come and order the Mango Bliss!!!"], "author": "Jenny A.", "review": "Mmmm came here for dessert of a Friday night. Not crowded at all. You walk in and just see boxes of mangoes stacked by the cash register - always a good sign. \n\nWe ordered a Mango Bliss with Almond Jelly, a Mango Bliss with Panna Cotta, a Mango Panna Cotta Bowl, and 2 Mango and Ice Cream Pillows. \n\nMango Bliss has TONS of fresh mango, ice cream, this coconut syrup thing, mango puree, and your choice of base. Almond jelly was really good as a base cause the almond taste balances the sweetness of the ice cream. The panna cotta tasted like cream cheese and was really filling (but I love cream cheese so it was okay). \n\nThe Mango Panna Cotta is basically the Mango Bliss without the ice cream and topped with this jelly stuff. It's pretty good but again the panna cotta tastes like cream cheese.\n\nThe cream pillows are really rich and you cannot eat a lot of them. Basically a really thin crepe stuffed with mango, ice cream, and whip cream. If you don't like whip cream, you won't like this dessert. \n\nDefinitely come and order the Mango Bliss!!!", "rating": 4, "date": "2011-06-11"}, {"excerpts": ["I use to come here a lot and would only order the SAME THING: Mango Bliss. ", "Was recommended by a friend, loved it, never ordered another thing. ", "One night I ordered a Mango Bliss, my usual. ", "The owner didn't ask what Base ", "I wanted, which is Panna Cotta. ", "I assumed she remembered since that's all I ever get. ", "My food comes, and I had NO IDEA what came. ", "I asked the owner if she gave me the wrong dessert. "], "author": "Iris L.", "review": "THIS IS WORTH THE READ.\n\nI use to come here ALL the time, almost every week for a time period. I recommended it to everyone. I haven't set foot in here in almost a year. All because of that \"policy\". This is worth the read, for anyone wanting to know if its good to eat here.\n\nI use to come here a lot and would only order the SAME THING: Mango Bliss. Was recommended by a friend, loved it, never ordered another thing. Came in all the time, the owner sort of remembered me, so I felt at a point that she knew my usual.\n\nI knew of the policy. The policy is that you have to know what you order, because there is no re-dos. I UNDERSTAND. It's a hassle. It can be a long wait if there's a lot of people. I haven't had a huge problem yet. I've waited over an hour for food once. I never had a problem because I UNDERSTOOD HOW THIS PLACE WAS MANAGED. So I respected it ... Until.\n\nOne night I ordered a Mango Bliss, my usual. The owner didn't ask what Base I wanted, which is Panna Cotta. I assumed she remembered since that's all I ever get. My food comes, and I had NO IDEA what came. I asked the owner if she gave me the wrong dessert. She said no, and that I ordered a MANGO MEDLEY and there were no re-do. \n\nI know, for a fact, 100%, I swear on my dead Gameboy's grave that I DID NOT ORDER A MANGO MEDLEY. I DIDN'T EVEN KNOW THAT DESSERT EXISTED. \n\nI just ate it. It wasn't bad though, but I still ate in frustration. I understand the policy. But that's only valid if I KNEW WHAT I ORDERED, not WHAT THE SERVER PUT DOWN ON THE IPAD THEY USE. Fortunately, the Mango MEDLEY was slightly cheaper. I still paid for it.\n\nI haven't come back there ever since. I love the desserts! But that one incident messed up my whole experience. I'm sadly never coming back again.", "rating": 2, "date": "2013-06-18"}, {"excerpts": ["understandable because they make everything fresh\n\nMango Bliss and Mango Medley:\n- pannacotta is creamy and tart, mangoes are so refreshing and the ice cream pulls everything together with "], "author": "Tina A.", "review": "consistently good but a consitently long wait.  understandable because they make everything fresh\n\nMango Bliss and Mango Medley:\n- pannacotta is creamy and tart, mangoes are so refreshing and the ice cream pulls everything together with it's sweetness\n\nCream Pillows \n- a crepe wrapped around whip cream, fresh mangoes and an green tea ice cream.  the green tea had a nice strong flavor and the mangoes were juicy and sweet.\n\nCreme Brulee\n- fresh out of the oven, hot and creamy, but a little on the plain side\n\nThe past 2 times I have been here was in a group of 3.  I would certainly not bring any party larger than 3 because there is not much space and only 1 server to handle the orders.  \n\nMaybe one day we'll come back for the savory food, but I know we will definitly come back for the desserts", "rating": 4, "date": "2012-04-04"}, {"excerpts": ["I decided to go with the Mango Bliss and chose dofu fa as the base.  ", "Interesting concept to be able to choose the base.  ", "The dessert was quite good and refreshing.  ", "The mango was excellent.  ", "A little confused what happened with the dofu fa.  ", "It was pulverized at the bottom.  ", "Also the price point ($6.50) seemed a bit steep.  "], "author": "Christopher W.", "review": "Came to Mango Medley after eating at Shanghai Dumpling King.  Needless to say, very stuffed!  Somehow we always end up getting Asian desserts when we're in the area.  I'm not going to complain!\n\nA friend of mine (who still hasn't made it over to Mango Medley) heard good things about this place.  The dessert menu seem slightly limited compared to places like Creations.  For example, I couldn't find the standard mango sago or glutinous rice balls!  Whaaa?  \n\nI decided to go with the Mango Bliss and chose dofu fa as the base.  Interesting concept to be able to choose the base.  The dessert was quite good and refreshing.  The mango was excellent.  A little confused what happened with the dofu fa.  It was pulverized at the bottom.  Also the price point ($6.50) seemed a bit steep.  The waitress was attentive and friendly.\n\nProbably wouldn't make a special trip back, but if I were in the area it would be a good dessert option.", "rating": 3, "date": "2011-07-16"}, {"excerpts": ["My favorites are the creme brulee, tofu-fa and the mango bliss!\n", "I've also tried their green tea frappe, and panacotta, but of course, I could only choose to eat so much when I'm there at any given time.\n", "It's a lovely place to chill, especially if you are looking for something that's open past 10pm."], "author": "Becky D.", "review": "I visit Mango Medley at least once every two weeks.\nI love their menu selections. Not only is there a lot to choose from, there are different tastes and styles you could select.\nAlthough there is limited seating and the meal or dessert preparations can become an hour long wait I feel it is the perfect scenario for friends, couples, or families to get together in a cozy corner and just spend time with each other while they wait for their orders to come.\nMy favorites are the creme brulee, tofu-fa and the mango bliss!\nI've also tried their green tea frappe, and panacotta, but of course, I could only choose to eat so much when I'm there at any given time.\nIt's a lovely place to chill, especially if you are looking for something that's open past 10pm.", "rating": 5, "date": "2010-03-12"}, {"excerpts": ["My boyfriend got baked seafood and mango bliss.\n\n", "Mango bliss was kind of like mango puree, mango ice cream, mango bits, and panna cotta. ", "I would have to recommend the mango bliss because it was mouthwatering! ", "I love it so much. ", "The panna cotta was excellent. ", "I enjoyed the cream pillows too. ", "I'm definitely going to come back here to try more desserts! ", "Bring some cash because it's cash only."], "author": "Vivian L.", "review": "I came here last weekend with my boyfriend. It was pretty empty; it was just us and another group of people, but a couple more groups came in later on. I ordered the Sunday special, which was kimchi fried rice, and you get to choose a drink and dessert, so I got milk tea and green tea cream pillows. My boyfriend got baked seafood and mango bliss.\n\nLet me tell you, service is SUPER SLOW. I think they only have one chef working. Our plates didn't come until probably 20-25 minutes after we ordered. The kimchi fried rice was actually really good, and it's coming from someone who doesn't enjoy kimchi very much. My boyfriend enjoyed his baked seafood as well. After we were done, we waited for our desserts. It took a REALLY long time for our desserts to come out, and there were probably just 4 groups dining in this restaurant. We probably waited a good 30-40 minutes for our desserts after we were done finishing our plates. The desserts were very delicious though! The green tea cream pillows were green mochi with whip cream wrapped around the crepe skin. Mango bliss was kind of like mango puree, mango ice cream, mango bits, and panna cotta. I would have to recommend the mango bliss because it was mouthwatering! I love it so much. The panna cotta was excellent. I enjoyed the cream pillows too. I'm definitely going to come back here to try more desserts! Bring some cash because it's cash only.", "rating": 4, "date": "2011-03-11"}, {"excerpts": ["They've some new menu items including the decadent mango bliss, which is a huge glass of mango ice cream with mango sauce, and topped with fresh mango.  "], "author": "Joanne G.", "review": "Service was actually slightly faster this time around!  Not horribly long, but still expect your dishes to come out one at a time at this two women operation.\n\nTheir savory dishes are actually quite good- I had a very garlicky Portuguese baked pasta with chicken, which at $9 was plenty of food to split between two\n\nThey've some new menu items including the decadent mango bliss, which is a huge glass of mango ice cream with mango sauce, and topped with fresh mango.  It looks amazing.\n\nTheir ginger milk custard is still delicious too.", "rating": 4, "date": "2008-06-28"}, {"excerpts": ["Mango bliss", ": It came in a goblet! "], "author": "Madeline N.", "review": "I had no idea there were even restaurants this far out in the Sunset. I thought we had wandered into a no man's land of semi-suburbia when my friends pointed out this tiny little gem of Taiwanese desserts. \n\nUnlike most dessert places - i.e. Sweet Indulgences in Millbrae - this one is not rife with cutesy furniture. Instead it feels like you walked into someone's living room and they just happen to serve delicious desserts. \n\nWe didn't waste our time on the food menu and went straight for the kill. Assessment of our choices. \n\n1. Sesame dumplings: It only looks like it's floating in a bed of tar! Honestly, awesome. Slightly sweet, turns your teeth black, but completely worth it. \n2. Mango tofu fa: Ordered it on a whim (mango + tofu fa?! wha?!) but it turned out surprisingly good. We received it cold but rumor has it that hot is an option. \n3. Grass jelly and almond jelly w/mango: Light, flavorful, good for sharing. \n4. Mango bliss: It came in a goblet! Mango custard with mango sauce with mango ice cream with mangos. Lives up to its name. \n\nIf you're out here, come visit. If you're not, think about visiting. It's kind of delicious.", "rating": 4, "date": "2011-01-09"}, {"excerpts": ["As for dessert I had their Mango Bliss which consist of Mango Ice Cream, Mango Pieces and I chose their Almond Jelly with it. ", "O-M-G is the Mango frrrresh to death! ", "It's the most Freshest mango I had ever had in my life! ", "I will definitely come back, but most likely come on a day when I'm in no rush. ", "So I can sit and wait, then enjoy the BLiSS ", ":)"], "author": "Eva H.", "review": "Service: 3.5/5\nFood: 3.5/5\nWait: 1/5\nPrice: $\nPresentation of food: 3.5/5\nPresentation of restaurant: 3/5\nOverall: 3/5\n\nI finally decided to come here because a friend recommended it and I was near by already. Everyone wasn't kidding when they say the wait of the food is EXTREMELYYYYY SLOW. So the food isn't that good, but their dessert is worth coming for. I had their Cream of Chicken mushroom spaghetti, it was okay. As for dessert I had their Mango Bliss which consist of Mango Ice Cream, Mango Pieces and I chose their Almond Jelly with it. O-M-G is the Mango frrrresh to death! It's the most Freshest mango I had ever had in my life! I will definitely come back, but most likely come on a day when I'm in no rush. So I can sit and wait, then enjoy the BLiSS :)", "rating": 3, "date": "2010-09-05"}, {"excerpts": ["Ive also had their mango with sticky rice, and their Mango Bliss--also very good. ", "I can't wait to go back ", "and when I do, I will try their food. ", "I've read good things about them, especially their Kimchee fried rice."], "author": "Tracy L.", "review": "I've been here a few times and each visit has been pretty pleasant. I've been fortunate enough to not have to wait long for a table or for the food. The waitresses have been nice as well. Ive only been there for dessert and highly recommend the cream pillows! I love the cream pillows with mango and mango ice cream. It's light, fluffy and my fav! By the way, they have boxes of mangos in the front so you know they'll be fresh. Ive also had their mango with sticky rice, and their Mango Bliss--also very good. I can't wait to go back and when I do, I will try their food. I've read good things about them, especially their Kimchee fried rice.", "rating": 4, "date": "2012-04-10"}, {"excerpts": ["The dessert was mediocre, mango bliss (rather go to golden island).  ", "Overall, the meal took us maybe a hour and forty five minutes, because the service was so bad (we got one dish at a time 5 minutes apart).  ", "I usually tip even if the service is bad, but it was so bad here "], "author": "Amy C.", "review": "Hm zero stars!!\n\nThis place is a hellhole.  \n\nMe: table for three please.\nWaitress: we are full.\nMe: how long is the wait.\nWaitress (looks around): they just got their food.\nMe (looking confused, what is that supposed to mean?): ok we'll wait.\n\nMe: do you guys have a restroom?\nWaitress (looks around for a bathroom): it's for customers only.\nMe: we WILL be customers, or do we have to order to use the bathroom.\nWaitress: we are really strict about the bathroom here because a lot of people use it off of the street.\nMe: do others ask for a table? (because we did, obviously we were going to stay)\nWaitress: no they don't. (blank look) ok I will let it slide this one time. (hands us the keys to the bathroom).\n\nSo besides the retarded waitress the food was terrible.  It is wannabe HK cafe food.  Who puts broccoli and squash in a baked pork chop over rice?  They have pictures of the entrees they serve printed on the menu but when you get it, it looks nothing like the picture.  My friend ordered noodle soup and when it came it didn't look anything like the picture.  The picture was a bird's eye view of the bowl, but when the bowl came, it was half the height of normal noodle bowls (cheap asses).  Me and my other friend ordered two different things and when they came it looked and tasted pretty much the same.  The dessert was mediocre, mango bliss (rather go to golden island).  Overall, the meal took us maybe a hour and forty five minutes, because the service was so bad (we got one dish at a time 5 minutes apart).  I usually tip even if the service is bad, but it was so bad here I had to tip 2 cents, IT WAS THAT BAD!!        \n\nONLY CONS! DON'T COME HERE!", "rating": 1, "date": "2009-11-13"}, {"excerpts": ["We got an assortment of desserts and the standout was mango bliss, which is their featured dessert. "], "author": "Quyen N.", "review": "I stopped by here for dessert with some friends after eating at Thanh Long and we all loved this place! We got an assortment of desserts and the standout was mango bliss, which is their featured dessert. The strawberry panna cotta and banana pillows were great but the made from scratch cheesecake was blah. \n\nThe menu was hard to read with the jumbled tiny print. \n\nWe were one of three tables there on a Tues night, but had the place to ourselves most of the time. I didn't notice slow service, but like I said we were the only customers for the most part. I would definitely come back to try some other things on their menu.", "rating": 4, "date": "2008-07-02"}, {"excerpts": ["I usually order the mango cream pillows, mango bliss, and almond jelly with mango sauce and fresh mangos. ", "The mangos they used, at least every time I go are always ripe and sweet and have me a returning customer. ^_^"], "author": "Jonathan L.", "review": "I come here at least twice a month and I love it despite the slow service. As other reviewers have stated the service here is really slow because they only have 1 SERVER. She basically has to to do everything so if you don't have at least an hour or so to spare, this place may not be for you. \n\nI only order the mango desserts and they are really tasty. I usually order the mango cream pillows, mango bliss, and almond jelly with mango sauce and fresh mangos. The mangos they used, at least every time I go are always ripe and sweet and have me a returning customer. ^_^", "rating": 4, "date": "2011-05-01"}, {"excerpts": ["Mango Bliss (buttermilk panna cotta and mango sorbet version) - tasty, refreshing, and fruity - "], "author": "Kris F.", "review": "I've been coming here for the last 2 years - at one point, I was coming here about once a week because the food is so good! Sure, the wait sucks (I've waited more than an hour for my order on a couple of occasions) and Eugenie may not be the friendliest waitress (she's a busy lady - just know what you want to order so you don't keep her waiting), but just know and accept that going in - the food is totally worth it! EVERYTHING I've ordered here is tasty and amazing, and I've tried almost half the menu. Tons of vegetarian options! The only thing I didn't like was the eggplant sandwich - the bread was overtoasted and too hard. Here are my recommendations (sorry, I'm a pescetarian, so no meat suggestions):\n\nAppetizers:\n1) Vietnamese Shrimp Rolls - so fresh and delicious! Shrimp is tender and not chewy.\n2) Seaweed Salad with Tobiko - so good! Wakame, lettuce, tobiko, miso dressing, and sesame seeds - pretty standard but done right.\n2) Vietnamese Spring Rolls (Vegetarian) - yummy veggie alternative to the shrimp ones (tofu and shitake mushrooms instead of shrimp).\n\nEntrees:\n1) Ramen with Mixed Mushrooms in Soy Broth - the best I ever had! Even better than Japantown. Fresh, crisp veggies and a variety of mushrooms. Broth is tasty and noodles are perfectly done.\n2) Spinach Noodles with Tofu and Mixed Mushrooms - my old standby. Flavorful and filling.\n3) Rice Wine Tofu and Mushrooms over Rice - great light dish if you aren't that hungry. So very tasty!\n4) Tamarind Tofu and Veggies over Rice - my bf's favorite! Lots of flavor and just the right amount of spiciness.\n5) Garlic Basil Linguine with White Wine Sake Sauce - So yummy! If you need a garlic fix, this is for you!\n\nDesserts:\n1) Panne Cotta with Fruit Sauce - light, refreshing, and delish!\n2) Mango Crepes (I think they are called mango pillows) - yummy! Pretty simple dish - ripe mangoes, whip cream, crepes - but oh so good!\n3) Mango Bliss (buttermilk panna cotta and mango sorbet version) - tasty, refreshing, and fruity - a must if you love mangoes.\n\nDrinks:\n1) Hot Ginger Honey - my usual order, a definite must on a cold, foggy day/night. Fresh pressed ginger juice, water, and honey - oh so good for you!\n2) Hot Milk Green Tea with Soy Milk - my go-to drink of choice if it weren't for the calories. Yummy milky goodness!\n3) Hot Chai Latte - so tasty! Maybe not as authentic as the chai tea at Golden Gate Pizza and Indian Cuisine down the street, but still a tasty blend of spices and milk.\n\nThe parking sucks, as are the wait and service (hence the minus 1 star), but as I said before - THE FOOD IS WORTH IT!!!! Especially if you are vegetarian. Prices are reasonable and ambiance is cozy. They just expanded the seating so that should help with the late night rushes. Whenever I have family or friends visiting, I take them here and they love it too!", "rating": 4, "date": "2008-07-31"}], "strawberryberry bliss": [], "durian bliss": [{"excerpts": ["Went here for the first time and was so impressed with their very very good durian bliss (ice bowl) and durian pillow (crepes). ", "I love durian and mango medley has a lot of durian desserts. ", "However, the second time I came to this place I was disappointed with their service ... please see my other review."], "author": "Euodia A.", "review": "Went here for the first time and was so impressed with their very very good durian bliss (ice bowl) and durian pillow (crepes). I love durian and mango medley has a lot of durian desserts. However, the second time I came to this place I was disappointed with their service ... please see my other review.", "rating": 4, "date": "2017-02-24"}], "mango medley delight": [{"excerpts": ["Ordered the Mango Medley Delight "], "author": "Steven C.", "review": "Came into the place with a dead atmosphere. It didn't feel very welcoming at all.\n\nOrdered the Mango Medley Delight and I just felt like I was drinking sugar more than eating mangoes. \n\nGo somewhere else for dessert if you're having a sweet tooth.", "rating": 1, "date": "2014-09-23"}, {"excerpts": ["I always get the Mango Medley Delight and Cream Pillows!!! ", "The mango is always sweet here no matter what season it is. ", "All the savory foods that I have tried have been really good! ", "They just take a long time, so it might not be a good idea if you're really hungry. ", "Sad to see that this place has such low stars, but I can understand why. ", "If I have to rate the food only... I would give it 5 stars, but the service can be slow and not very pleasant at times. ", "The wait for food can take a long time as well because I believe there's only one chef that does everything."], "author": "Brittany L.", "review": "I have been coming here since High School and I have always loved it. I always get the Mango Medley Delight and Cream Pillows!!! The mango is always sweet here no matter what season it is. All the savory foods that I have tried have been really good! They just take a long time, so it might not be a good idea if you're really hungry. Sad to see that this place has such low stars, but I can understand why. If I have to rate the food only... I would give it 5 stars, but the service can be slow and not very pleasant at times. The wait for food can take a long time as well because I believe there's only one chef that does everything.", "rating": 4, "date": "2016-08-03"}, {"excerpts": ["What we ordered:\n\nMango Medley Delight  $5.95\nGrass Jelly+Almond Jelly+Mango Sauce+Fresh ", "The only hiccup was that my friend's Mango Medley Delight took forever to come. ", "Literally half an hour after the other two desserts came.   "], "author": "Anna C.", "review": "After a late dinner in the Sunset on a Friday night, my friends and I decided to go grab dessert.  We were deciding on either Mango Medley or Crepe Temptations since we were on Judah.  Since we were kinda full, we decided to go with the fruit based dessert place.\n\n    The restaurant was a bit empty when we got there at around 10pm.  When we first walked in, Mango Medley looked more like a coffee shop then anything else.  It's a bit small, but it does have a cozy type of feel to it.  \n\n    They did have a regular food menu, but we didn't really look at it since we were only there for dessert. Typical rice and noodle dishes. However, I did notice that they have daily set specials and Happy Hour specials after 9pm.\n\nWhat we ordered:\n\nMango Medley Delight  $5.95\nGrass Jelly+Almond Jelly+Mango Sauce+Fresh Fruit  $4.95\nPanna Cotta Bowl w/mango $4.95\n\nThe portions were a bit small for the price, but I was quite happy with my dessert. The panna cotta was rich and creamy, and the mangoes were just the way I liked them.  Not overly ripe, but firm, sweet, and with tart undertones.  I was too full to try the desserts my friends ordered, but they claimed it was good.\n\nThe only hiccup was that my friend's Mango Medley Delight took forever to come. Literally half an hour after the other two desserts came.   This was a bit odd considering the restaurant was pretty much empty at the time.  \n\nPros:\n\nGood mango desserts\nOpens late ( until 1 am Fri. nights, 12am Sat. nights)\nFriendly service (albeit a bit slow) \n\nCons:\n\nA bit pricey for what you get\nCash only\n\n\nI would come back here to try their other desserts:)", "rating": 4, "date": "2011-02-12"}, {"excerpts": ["Looked over the menu and ordered mango+ice cream pillows, with my friends getting a Mango Medley delight and a frappe. "], "author": "Kathleen A.", "review": "Been here about 4 times. Came here last Friday with NOT so great of an experience.\n\nFirst, we get to the place and got seated right away which is kind of a first for me since we usually arrive here packed. Looked over the menu and ordered mango+ice cream pillows, with my friends getting a Mango Medley delight and a frappe. We sit there and wait.\n\nTHE ORDERS TOOK FOREVER! We waited over 30 minutes for our food..and we didn't understand why since the place was almost empty. The service was horrible.\n\nYeah the pillows are ok, but I can find something else better at some other place with better service.", "rating": 2, "date": "2011-03-14"}, {"excerpts": [", Kimchi fried rice, hot milk tea and green tea cream pillows, pana-cotta with mango sauce, and mango medley delight.\n\n", "Out of All (Pana-Cotta w/ Mango Sauce)\n", "The mango sauce that accompanies the pana-cotta, similar to yogurt pudding  jello that is not to sweet makes the dessert just right. \n\n"], "author": "Sylvia C.", "review": "Came here on a Sunday with my Family and got the place for ourselves. I guess not many people go out for dessert on Sunday. \n\nOrdered Set B on the Specials Menu, Kimchi fried rice, hot milk tea and green tea cream pillows, pana-cotta with mango sauce, and mango medley delight.\n\nBest Dessert Out of All (Pana-Cotta w/ Mango Sauce)\nThe mango sauce that accompanies the pana-cotta, similar to yogurt pudding  jello that is not to sweet makes the dessert just right. \n\nGreen Tea Creme Pillows\nA dish with two thin crepes wrapped around whip Creme and green tea ice cream, making squares like pillows. \n\nMango Delight\nThis would be a great dessert for Mango lovers but too sweet for my taste. \n\nKimchi fried rice wasn't so good.", "rating": 4, "date": "2011-11-13"}, {"excerpts": ["I had the Mango Medley Delight, which has mango, pomelo, and coconut jelly.  ", "The pomelo was broken up into big chunks; it would be more awesome if it was broken up into its individual pomelo droplets of juicy goodness . ", ". . ", "that's what the nice dessert places in China do anyways.  ", "We also had their cream pillows, which are crepes folded into a pillow-like shape.  "], "author": "Sonia L.", "review": "Disclosure: I'm a mango fanatic!!!  So, I'm bound to love a place named MANGO Medley where they serve mango desserts.   Yummmmz.\n\nMy friends and I were in the neighborhood for dinner, and instead of eating dessert at the expensive restaurant we were already at, we headed a few blocks down to Mango Medley instead.  What a great decision!  I had the Mango Medley Delight, which has mango, pomelo, and coconut jelly.  The pomelo was broken up into big chunks; it would be more awesome if it was broken up into its individual pomelo droplets of juicy goodness . . . that's what the nice dessert places in China do anyways.  We also had their cream pillows, which are crepes folded into a pillow-like shape.  The purple yam one was really good, and it's not often you find caramelized purple yams on the dessert menu.  \n\nWish I lived near this place.  I'd probably be there every day!", "rating": 4, "date": "2011-03-07"}, {"excerpts": ["Shared a mango medley delight $5.25-which was tasty.\n\n"], "author": "Ann L.", "review": "We went here after a huge lunch at Old Mandarin Islamic Restaurant.  We drove and found parking on Sun 6/3/07.\n\nThis place is Hella Slow.  Even though I was full, I still want to get my order taken & food in front of me before I turn another year older.\n\nWe got:\nHK milk tea hot, if u want condensed milk it's an extra .30.  WTF.  Small is $2.30.  Tasted ok.\n\nShared a mango medley delight $5.25-which was tasty.\n\nPeanut & sticky rice $2.5 was ok, not my favorite.  Don't like rice for dessert just weird for me.\n\nOne unisex bathroom & decent when I went.\n\nTotal was $13.40, I don't think I'll go back.", "rating": 2, "date": "2007-06-03"}, {"excerpts": ["I order the mango medley delight. ", "Then my friend orders #24, the \"waitress\" responds by saying \"What is that?\"", ".. ", "UH, how do you not know what is on the menu? ", "And even if you did not know, don't be rude and act dumb.  ", "Are you serious?? ", "Rude service yet again ", "while not knowing about your own work establishment, i.e., the MENU when youre a waiter for pete's sake, are you kidding me?! ", "MINUS ", "Then comes my mango medley delight. ", "I was really excited ", "it came because I was getting a little hungry. ", "I take one bite ", "and I actually like it! ", "Take another one, and it's pretty good! ", "Then BAM! ", "It's not even one strand of black hair, its like THREE OR FOUR TANGLED OR CRUMPLED TOGETHER LIKE A KNOT in the middle of my dessert! ", "At this point, I'm pretty annoyed.  ", "I go up to the counter because obviously if I called for service earlier ", "and she doesn't come", ", why try again for the third time?! ", "So I go up there, and there she is, in the kitchen with some other lady that I assume is the cook. ", "I wave to her and say \"hello\" she just LOOKS at me and turns her head away continuing to talk to the other lady. ", "UH HELLO?", "! ", "I shout again, she doesnt even turn her head this time. ", "But a moment later she just comes up to the counter, no response. ", "I tell her there is a piece of hair knot in my dessert and she just goes \"Uh.", "\" ", "And walks back to the kitchen. ", "I'm standing there like WTF. ", "She comes back and says \"Uh yeah", "\" and I go... ", "\"", "Do i leave it here?", "\" ", "And she goes \"Leave it\". ", "WOW.  ", "MINUS "], "author": "Stephanie L.", "review": "Three words: ARE. YOU. SERIOUS?????\n\nThe reason for the -4 stars is strictly because of the SERVICE. The chick with the ugly pixie haircut that knows only how to utter phrases such as \"Uh yeah\", \"No\", \"Leave it\", \"What is that?\" has thee worst customer service EVER. Reasons for this are as followed:\n\n#1) My friends and I walked in and the place was empty, but what do you expect it's a weekday around 11pm so I wasn't expecting anything. But  I DID expect to see a waiter or waitress or someone at the cashier --NOPE. We seat ourselves anyways even though it looked like it was closed, but we knew it was open because we had called earlier. I shout for hello a couple of times but STILL no  one is there. We get the menus ourselves and we figure out what we want, and granted that it's our first time there we aren't sure if maybe we're supposed to go up and order? So we do. Finally the short haired chick \"waitress\" comes out of god knows where since the place is so small, and we ask if we order here. She replies \"No.\" Okay this chick is getting on my nerves already for the rude and blunt customer service. MINUS ONE STAR\n\n#2) We seat ourselves yet again and she finally comes and takes our order. I order the mango medley delight. Then my friend orders #24, the \"waitress\" responds by saying \"What is that?\".. UH, how do you not know what is on the menu? And even if you did not know, don't be rude and act dumb.  Are you serious?? Rude service yet again while not knowing about your own work establishment, i.e., the MENU when youre a waiter for pete's sake, are you kidding me?! MINUS ONE STAR\n\n#3) We get our food after about fifteen minutes or so, and my friend receives her spicy tomato fried rice first. Then comes my mango medley delight. I was really excited it came because I was getting a little hungry. I take one bite and I actually like it! Take another one, and it's pretty good! Then BAM! It's not even one strand of black hair, its like THREE OR FOUR TANGLED OR CRUMPLED TOGETHER LIKE A KNOT in the middle of my dessert! At this point, I'm pretty annoyed.  I go up to the counter because obviously if I called for service earlier and she doesn't come, why try again for the third time?! So I go up there, and there she is, in the kitchen with some other lady that I assume is the cook. I wave to her and say \"hello\" she just LOOKS at me and turns her head away continuing to talk to the other lady. UH HELLO?! I shout again, she doesnt even turn her head this time. But a moment later she just comes up to the counter, no response. I tell her there is a piece of hair knot in my dessert and she just goes \"Uh.\" And walks back to the kitchen. I'm standing there like WTF. She comes back and says \"Uh yeah\" and I go... \"Do i leave it here?\" And she goes \"Leave it\". WOW.  MINUS TWO STARS\n\n#4) She comes back a few minutes later, which was obvious to me that she probably just took out the hair and dumped a bunch of mangoes on top. She doesn't even say sorry or ANYTHING to me. And apparently she was snickering while giving it to me. I'm pretty annoyed at that point and I in my normal voice just vent out the horrible customer service and how she probably just gave me the old one. I know she heard me but she doesn't even care. I eat the mangoes on the bottom and don't even finish half of my dessert. I don't even bother leaving any tip because WHAT SERVICE WAS THERE?! She doesn't even come to give us the check when its been an hour and not ONCE does she come check up on us. We just walk up there and my friend tells her we want our checks separately. She mumbles something under her breath, who knows wth she is saying. I was thinking about arguing with her but I had no valid proof that she gave me the old one, just my voice against hers. \n\nMango Medley has got to be the worse asian dessert customer service that I have EVER encountered. I know every other asian dessert place in SF is whatever on the customer service for the most part, but ARE YOU SERIOUS MANGO MEDLEY?! To be frank, where did that knot of TANGLED BLACK HAIR even COME FROM? It was all stringy and black while the waitress had obviously dyed her hair and the cook in the back had brown hair too, SO WHERE DID THE HAIR EVEN COME FROM? \n\nThe food is not bad, don't get me wrong, although the hair is questionable in it's own right. My friends and I could have easily dined & dashed because this chick was seriously ABSENT, and when she was there, she was so rude and dumb. I'm never coming back here, EVER! That little turd, she's lucky that I did NOT go Korean on her ass because I was pretty damn furious. And I'm still thinking right now as I'm writing this review, why I did not fight with her. God damn you waitress from Mango Medley, ruined my night.", "rating": 1, "date": "2010-12-29"}], "crme brulee": []}