{"porpiasod": [], "todmon": [], "satay": [{"excerpts": ["The chicken satay sauce was awesome. ", "The best they had was the little fried dumpling that tasted like samosas. ", "The service was good but they didn't really recommended anything when asked. ", "Overall good but not the best Thai food I ever had."], "author": "raimundo t.", "review": "The place looks great. Felt like I was in Thailand. The decor was awesome. The food was ok. A little on the bland side. The chicken curry was tender but not dry and the curry was a little on the very mild side. The chicken satay sauce was awesome. The best they had was the little fried dumpling that tasted like samosas. The service was good but they didn't really recommended anything when asked. Overall good but not the best Thai food I ever had.", "rating": 3, "date": "2018-08-18"}, {"excerpts": ["We ordered carry out Gang-Gari-Gai(yellow curry with chicken and potatoes, red curry salmon, and mint roll and chicken satay appetizers. ", "The appetizers were good and similar to whats usually at good thai spots the red curry was flavorful ", "i just would have paired it with a different fish both of our favorite was the yellow curry. ", "It wasnt like any yellow curry ", "id had prior minus hints of the same spices its more like a crock pot style marinated chicken and potatoes ", "but its all so tender and flavorful ", "I certainly didnt mind."], "author": "Sean G.", "review": "Good little spot up the street that my roomate introduced me to. We ordered carry out Gang-Gari-Gai(yellow curry with chicken and potatoes, red curry salmon, and mint roll and chicken satay appetizers. The appetizers were good and similar to whats usually at good thai spots the red curry was flavorful i just would have paired it with a different fish both of our favorite was the yellow curry. It wasnt like any yellow curry id had prior minus hints of the same spices its more like a crock pot style marinated chicken and potatoes but its all so tender and flavorful I certainly didnt mind.", "rating": 4, "date": "2017-05-01"}, {"excerpts": ["Chicken Satay is the best"], "author": "V V.", "review": "Good atmosphere, friendly staff\n\nThai curries a little watered down in taste and consistency but still flavorful\n\nRecommendations: Chicken Satay is the best", "rating": 3, "date": "2017-06-02"}, {"excerpts": ["Both the beef and chicken satay are okay, but a little dry. ", "Even though the soup calls to me, I like the noodle dishes. "], "author": "Jennifer W.", "review": "Come here for the lunch specials. You can choose a couple of dishes and have the house fried rice on the side. But the single best part of the lunch combo is the lemon chicken soup. Both the beef and chicken satay are okay, but a little dry. Even though the soup calls to me, I like the noodle dishes. I've tried the pad thai and pad kee mao. I've also had the chicken and fish ball noodle soup. Recently, I also tried the duck served with rice and it was simply delicious. The cuts where big and fatty. Plus, the thai iced tea hits the spot.", "rating": 4, "date": "2015-07-14"}, {"excerpts": ["So tonight was our date night...chicken satay, coconut lemongrass chicken soup, yellow curry chicken and fried bananas for dessert! ", "My 14 year old had nothing to say after that...except to say that there's a party in her mouth!!! "], "author": "Kia B.", "review": "Manora's never, I mean never, disappoints!!! The coconut lemongrass chicken soup has always been my favorite (nothing in this world like it!) When my 14 year old came home saying she had Thai food for the first time with her family...I thought \"girl, you ain't had Thai food if it ain't Manora's\"...\n\nSo tonight was our date night...chicken satay, coconut lemongrass chicken soup, yellow curry chicken and fried bananas for dessert! My 14 year old had nothing to say after that...except to say that there's a party in her mouth!!! LOL\n\nThis place definitely sets the bar for all Thai restaurants in the area...the food is authentic, the price reasonable and the customer service is on point!!!\n\nWhat can I say...whether dining in or taking out...I'm a customer for life!!!", "rating": 5, "date": "2015-07-09"}, {"excerpts": ["Their lunch combo is an amazing $8.95 deal that comes with soup and 2 items (I got the satay and curry chicken) and a giant bowl of fried rice. "], "author": "T L.", "review": "(See pics)\n\nTheir lunch combo is an amazing $8.95 deal that comes with soup and 2 items (I got the satay and curry chicken) and a giant bowl of fried rice. There are 11 items you can choose from for the dishes.\n\nThe food was quite delicious and inexpensive. However, if you go with a big group the food tends to be put together too early and not hot enough. With a smaller group (like a few people) the food was put together when ordered.\n\nThe setting is pretty and colorful. Service was good and courteous. If you get to sit by the window on a warm afternoon you can also enjoy some fresh air from the sliding windows.\n\nService was also very friendly and fast.", "rating": 4, "date": "2011-07-27"}, {"excerpts": ["Satay \nGrilled beef or chicken on skewers served with peanut sauce\n\n2. "], "author": "Stacey L.", "review": "Great lunch spot.  2 Item Combination w/fried rice & soup $ 8.95 \n\n1. Satay \nGrilled beef or chicken on skewers served with peanut sauce\n\n2. Garlic Pork\nBarbeque thin slices of pork marinated in garlic and black pepper\n\n3. Tod-Man\nFried fish cake served with sweet cucumber\n\n4. Por-Pia-Tod (choice of meat or vegetarian roll)\nFried imperial roll stuffed with shrimp, chicken and glass noodles in oriental herbs, served with sweet plum sauce\n\n5. Gai-Yang\nThai Bar B-Q chicken served with sweet garlic sauce\n\n6. Gang-Ga-Ri\nYellow chicken curry served with sweet cucumber\n\n7. Panaeng-Nur \nSpicy beef curry with sweet basil\n\n8. Gai-Graprao\nSauteed chopped chicken with spicy basil garlic sauce\n\n9. Goong-Tod\nDeep fried prawns with vegetables served with plum sauce\n\n10. Nur-Toon\nMarinated beef stew with mushroom sauce\n\n11. Nur-Pad-Pik\nSauteed slices of beef in chili, garlic and basil sauce", "rating": 4, "date": "2012-10-01"}, {"excerpts": ["I thoroughly enjoy their lemongrass chicken soup, cucumber salad, yellow chicken curry and chicken satay. ", "I've tried others on the menu and have not been disappointed, these are just my favorite dishes."], "author": "Marfel L.", "review": "You get a lot of value for your dollar on the weekday lunch menu. I thoroughly enjoy their lemongrass chicken soup, cucumber salad, yellow chicken curry and chicken satay. I've tried others on the menu and have not been disappointed, these are just my favorite dishes.", "rating": 5, "date": "2014-02-28"}, {"excerpts": ["mMm... i usually get the satay skewers and spring rolls with garlic rice instead of fried rice. ", "prices are really reasonable too! ", "i definetely prefer coming here over king of thai."], "author": "Ann T.", "review": "their lunch menu offers combos! and if you order the combo, the even start you off with the coconut chicken soup! mMm... i usually get the satay skewers and spring rolls with garlic rice instead of fried rice. prices are really reasonable too! i definetely prefer coming here over king of thai.", "rating": 4, "date": "2011-07-26"}, {"excerpts": ["I would suggest you get beef satay as one item and fried pork imperial rolls as the other item - both are very good.  ", "I especially like the sweet and sour sauce you get with the rolls ", "- I like adding a little bit of this sauce with the rice.  ", "They have some chicken offerings on the list of items for the combo, such as Gai-Yang or chicken satay, but I have found their chicken to be somewhat dry, so "], "author": "Pat S.", "review": "You can't go wrong with their lunch combination for $8.95.  This combo comes with lemon chicken soup, fried rice, and your two choices of items.  The soup contains large pieces of mushroom and chicken, and is slightly sour in taste (but is something that I like for its \"zing\").  I would suggest you get beef satay as one item and fried pork imperial rolls as the other item - both are very good.  I especially like the sweet and sour sauce you get with the rolls - I like adding a little bit of this sauce with the rice.  They have some chicken offerings on the list of items for the combo, such as Gai-Yang or chicken satay, but I have found their chicken to be somewhat dry, so I would suggest you either go with the two previous suggestions I made, or give some of their other items a shot.  \n\nTheir service is pretty good.  Even when the place is fairly busy, I don't think I've waited more than 8-10 minutes for my food to arrive.  \n\n$8.95 is reasonable for a lunch combo, especially for Thai food.  I would say their portions are larger than the other Thai place down the street (Basil Canteen).", "rating": 4, "date": "2012-01-20"}, {"excerpts": ["We ordered tom yum goong, beef satay, pad thai, and som-tum. ", "My favorite was the pad thai, which I actually don't usually order if the restaurant has pad kee mao, but I still enjoy nonetheless. ", "The highlight of the pad thai here is definitely in the flavors - savory, a little sour, not too sweet, and some spice. ", "I'm not a fan of peanuts, which is unfortunate because I love Thai and Vietnamese food, but I deal with it. ", "However, the beef satay had too strong of a peanut flavor for me, and was a little dry as well. ", "That being said, if you like peanuts, that`s probably a great dish. ", "The papaya salad was on par with the pad thai in terms of quality, so not much to say there. ", "But tom yum goong is one of my favorite soups in the world because it incorporates all my favorite flavors: salty, spicy, and sour. ", "Sadly, it was a bit of a disappointment last night because it wasn't spicy at all, and too sweet for me. "], "author": "Elizabeth H.", "review": "Came here with some friends last night before going across the street to The Willows for drinks and board games. We ordered tom yum goong, beef satay, pad thai, and som-tum. My favorite was the pad thai, which I actually don't usually order if the restaurant has pad kee mao, but I still enjoy nonetheless. The highlight of the pad thai here is definitely in the flavors - savory, a little sour, not too sweet, and some spice. I'm not a fan of peanuts, which is unfortunate because I love Thai and Vietnamese food, but I deal with it. However, the beef satay had too strong of a peanut flavor for me, and was a little dry as well. That being said, if you like peanuts, that`s probably a great dish. The papaya salad was on par with the pad thai in terms of quality, so not much to say there. But tom yum goong is one of my favorite soups in the world because it incorporates all my favorite flavors: salty, spicy, and sour. Sadly, it was a bit of a disappointment last night because it wasn't spicy at all, and too sweet for me. The meats and vegetables in the soup, on the other hand, were great! \n\nReasonable prices, and great service. In fact, we left to go play games across the street at around 8PM. At around 10:45, we were getting ready to leave The Willows when I realized that my DSLR wasn't there, so I ran across the street to check if I had left it there. Despite already being closed for the day, they let me in, and handed me my camera back - having kept it in a safe place behind the cash register. So thankful!", "rating": 4, "date": "2014-03-16"}, {"excerpts": ["The chicken satay was ok, nothing fabulous. ", "We had a large group of twenty people and I asked to have an order for each group of four people instead of one giant order and bill. ", "At first the waiter claimed he couldn't do it ", "(wth?) ", "and only when everyone at the table insisted on it that he changed his mind! ", "Jeez! ", "By the way, he automatically added an 18% tip to each group of four Not cool! ", "Not coming back. ", ":("], "author": "McKenzie L.", "review": "I was really disapppinted with the food. The yellow curry chicken was so watery like a soup and you could hardly taste the curry! I was shocked, since this is such an easy dish to make! It was more like chicken soup with potatoes and carrots! The chicken satay was ok, nothing fabulous. We had a large group of twenty people and I asked to have an order for each group of four people instead of one giant order and bill. At first the waiter claimed he couldn't do it (wth?) and only when everyone at the table insisted on it that he changed his mind! Jeez! By the way, he automatically added an 18% tip to each group of four Not cool! Not coming back. :(", "rating": 2, "date": "2015-10-03"}, {"excerpts": ["I tried satay beef and Thai BBQ chicken in sweet garlic sauce while this time I went for fish cake with fresh/sweet cucumber which compliment the fish cake very well with the sweet sauce. ", "I also ordered the saute beef in chili garlic and basil. ", "I would say the beef is a bit tough ", "but it is very beefy indeed ", "and I like it. ", "My coworker had the BBQ chicken which he likes very much, it's juicy and tender ", "he said and ", "no need for the sauce because it's very tasty already and I agree. ", "He also likes the spicy beef curry with sweet basil. ", "I like the fact that they use beef brisket ", "so it's very very tender and juicy. ", "I also forgot, the lemon chicken soup is very good too. ", "There is nothing we do not like there. ", "4 thumbs up ", "and I'll be back to continue to try the rest on the lunch combo =)"], "author": "Bella A.", "review": "I came here twice and twice I received good service and yummy dishes. \nI like the decoration here, it's very traditional and authentic. I also like fresh flowers on the table. I always touch the flower to see if they are real. This time they have Freesia and it smells so great! \n\nIt was quite busy at lunch here. We ordered the lunch combination which I think is the best value. It includes Thai fried rice and a cup of lemon chicken soup and your choice of 2 dishes out of a list of 11. I took me a while to think what I want because all of them looks good to me. \n\nI tried satay beef and Thai BBQ chicken in sweet garlic sauce while this time I went for fish cake with fresh/sweet cucumber which compliment the fish cake very well with the sweet sauce. I also ordered the saute beef in chili garlic and basil. I would say the beef is a bit tough but it is very beefy indeed and I like it. My coworker had the BBQ chicken which he likes very much, it's juicy and tender he said and no need for the sauce because it's very tasty already and I agree. He also likes the spicy beef curry with sweet basil. I like the fact that they use beef brisket so it's very very tender and juicy. I also forgot, the lemon chicken soup is very good too. There is nothing we do not like there. 4 thumbs up and I'll be back to continue to try the rest on the lunch combo =)", "rating": 4, "date": "2011-04-16"}, {"excerpts": ["Much of my visits here are a blur of blissful devouring, but I distinctly remember loving the chicken satay so much that I may have asked its hand in marriage. ", "Given that cooked chicken lacks cognizant functions such as speech, I left with that dream unfulfilled. ", "I highly recommend you try it - the consumption of Manora's chicken satay, that is, not the misguided attempt at matrimony."], "author": "Erik P.", "review": "I've never been to Thailand, so there's that.\n\nThis food, though? Makes me feel like I have. Like someone up and dropped an entire chunk of Southeast Asia into my mouth. But in a good way!\n\nMuch of my visits here are a blur of blissful devouring, but I distinctly remember loving the chicken satay so much that I may have asked its hand in marriage. Given that cooked chicken lacks cognizant functions such as speech, I left with that dream unfulfilled. I highly recommend you try it - the consumption of Manora's chicken satay, that is, not the misguided attempt at matrimony.", "rating": 5, "date": "2009-07-08"}, {"excerpts": ["Their satay is fantastic and their chicken in really tiny bits with fresh basil is also one of my favorites. \n\n"], "author": "TiMarie S.", "review": "Well, as a number of folks have pointed out, it is time to lose my \"review\" virginity, so what better place to start than one of my all time favorite restaurants. \n\npro's: A superb, filling meal at an inexpensive price, and great variety.\n\ncon's: Parking can be really tough there and the service, whilst very prompt, is not terribly friendly. Even having been there for years, it often feels like they want you in and out rapidly! The prawns and egg rolls are very very greasy, but there are at least 10 other excellent choices for the combo plate that will thrill you!\n\nThe first time Manora's was recommended to me, I wondered why the hell I wanted to cross town at lunch time for Jewish food. After a brief moment of complete embarrassment, and much laughter by my pals, the distinction was pointed out and off we went.\n\nI think that Manora's is the absolute best lunch place in San Francisco. It started me on my quest for and discovery of Thai food. \n\nThey have a fantastic lunch option where you can choose any 2 of about 12 items for your lunch which also include  Thai Rice (absolutely the best Spanish rice I have ever tasted including a good sized hunk of chicken hidden in the middle)! The meal starts off with the best Tom Kha Gai soup I have ever had. This is basically a Thai chicken soup chock full of chicken, straw mushrooms, bamboo shoots, lemon grass, cilantro, chili oil, chicken broth and coconut milk. It is the most wonderful balance of sweet, savory and spicy I have ever had! \n\nNext your meal is served with your two choices, (I recommend the red beef curry, served in a small bowl on the plate, just hot enough that you have to eat it with a spoonful of rice in order to keep the temperature manageable to me). It amazing how much food  is held in that bowl and I still have one more entree in another bowl on my plate!\nMy second choice sometimes changes but primarily I go for the peppery fried pork which I dip in a sweet and hot sauce served on the side. Their satay is fantastic and their chicken in really tiny bits with fresh basil is also one of my favorites. \n\nFriends have raved over the BBQ chicken, the Pad Thai, and everyone raves about the soup! What can I say. I have actually sent my husband on a trek for just soup to take out when I have been sick and needing some major comfort food. I have trained classes and used the Manora as a catering service and even their take out for 40 people held up fantastically!\n\nFor those who are not interested in the combo plate, there is a page of noodle, chicken and seafood dishes as I recall but why go for one entree when you can  taste a couple of items? \n\nLunch price was about 8.50 and Thai Ice Tea an extra 1.50 on top of that. I've never been able to fit dessert so I have no idea even what is offered. Since I always leave there stuffed I feel the value of the meal  is a heck of a bargain!\n\nI have been to many many Thai restaurants all over the state and up in Canada and still this is my favorite place where I celebrate all my birthdays and any anniversary of note!", "rating": 5, "date": "2006-05-20"}, {"excerpts": ["I ordered the Beef Satay and the Yellow Chicken Curry. ", "The soup was light and refreshing with a generous amount of chicken. ", "The satay was pretty good but the curry was a little light and watery.\n\n"], "author": "Sam T.", "review": "Manora's combo lunch special is a pretty nice deal. You get a cup of Lemon Chicken Soup and a choice of two items with some Thai Fried Rice.\n\nI ordered the Beef Satay and the Yellow Chicken Curry. The soup was light and refreshing with a generous amount of chicken. The satay was pretty good but the curry was a little light and watery.\n\nAlso, the Thai Ice Tea I tried wasn't that great.\n\nBut all and all a decent meal for about $9. \n\nBut I suggest you should go to Basil Thai instead for better Thai food.", "rating": 3, "date": "2008-06-08"}, {"excerpts": ["For the entrees, i've had satay chicken, gai-yang (thai bbq chicken)", ", gang-ga-ri (yellow chicken curry), panaeng-nur (spicy beef curry - it wasn't spicy for me at all ...", "this coming from somebody who can barely handle spicy food), and nur pad pik (sauteed slices of beef). ", "All entrees were very well cooked, meats were juicy and not dry, it had the right consistency and flavors were unique and well balanced. "], "author": "Veronica H.", "review": "3.5 stars, minus 1/2 star for not being as great as it use to be\n\nWhen I dine here, it's always during my lunch hour and b/c it's close to work. It tends to get very busy during normal lunch hours, between 12-1, so arriving by 11:30 gets you seated right away.\n\nI go for the $8.50 lunch combo. It comes w/a cup of lemon chicken soup, Thai fried rice, and your choice of two entrees from a list of 11 items. The items range from veggie to meat dishes. \n\nThe soup is delicious w/a light yellow curry like consistency w/huge pieces of shredded chicken, mushroom, and cilantro. The flavors blend in very well together; not spicy at all. The rice use to be very good, but has become a little bland since the last time I ate here. Nonetheless, you get a huge mound of rice and it still goes well w/the food. For the entrees, i've had satay chicken, gai-yang (thai bbq chicken), gang-ga-ri (yellow chicken curry), panaeng-nur (spicy beef curry - it wasn't spicy for me at all ...this coming from somebody who can barely handle spicy food), and nur pad pik (sauteed slices of beef). All entrees were very well cooked, meats were juicy and not dry, it had the right consistency and flavors were unique and well balanced. No complaints about any of the entrees.\n\nService is good. Friendly staff.", "rating": 4, "date": "2008-02-12"}, {"excerpts": ["Green curry chicken and satay with peanut sauce from Heaven \r\n", "Thumbs DOWN:  ", "Wierd location in SOMA ", "and they should consider moving into another space (like accoss the street where Hamburger Mary's was) cause they need more room."], "author": "Jeff C.", "review": "eh. what the big deal about this place?  I went here way back after a drinking event next door at the defunct Hamburger Mary's.  Since I didnt recall any bad memories I made our group of 5 go back recently  The food is good.  But getting to your food required that you reduce your expectations for space and accomations.  This place has too much furniture in it!   \r\n\r\nThumbs UP:  Green curry chicken and satay with peanut sauce from Heaven \r\nThumbs DOWN:  Wierd location in SOMA and they should consider moving into another space (like accoss the street where Hamburger Mary's was) cause they need more room.", "rating": 3, "date": "2005-06-10"}, {"excerpts": ["Satay ..."], "author": "June C.", "review": "I recommend:\n\n1. Pad Thai - Easy peasy right? Yes! and they get it right....See...there are a lot of Thai restaurant's that can't seem to get this right. (See my review about Keoni's by Keo) I judge restaurants by the basics and their extras. They get the basics down. Pad Thai...Thai Restaurant basic...\n\n2. Panang (chicken) Love this...favorite basic thai curry dish over rice.They do it well. If anyone finds one in the city that is any better, let me know! I'll be there..and I'll buy if you're right.\n\n3. Satay ...basic...great!\n\nI've had more dishes in this restaurant than I can recall right now, but know one thing; they do Thai food really well.\nI've been to Thailand...and no. They could never match up to what I had there...but they come pretty close.", "rating": 4, "date": "2007-08-13"}, {"excerpts": ["Food was good, had a good variety for the lunch combo including BBQ chicken satay, different types of curry and even a spicey chicken dish. \n\n"], "author": "Sean B.", "review": "I recently took a job in the area and was looking for a good, affordable lunch alternative in the old SOMA area and found a good one.\n\nI believe you choose two different entrees and it comes with rice and some other stuff and its priced right...around $7-8 bucks. Add a thai iced tea and your out the door for about $10.\n\nFood was good, had a good variety for the lunch combo including BBQ chicken satay, different types of curry and even a spicey chicken dish. \n\nAll and All probably one of the best places if your work in SOMA near Holy Cow and Butter area unless you want a $2 Costco dog.", "rating": 4, "date": "2008-11-24"}, {"excerpts": ["The Gang-Gari-Gai and Satay is also something to try.  ", "I have never had, but "], "author": "Benjamin B.", "review": "Tom-Ka-Talay - Or known as Tom-Ka-Guy (that is how it is pronounced), and it is the best coconut milk soup I have ever had.  Delicious!  I love the button mushrooms and chicken soaking away... mmm.\n\nThe crunchy bean sprouts in the pad-thai makes this dish exquisite.  The Gang-Gari-Gai and Satay is also something to try.  I have never had, but everyone who has always say that the Thai Ice Tea is the best.  Not an iced-tea drinker, but everyone has their likes and dis-likes.\n\nI also like the very large single stem flowers adorned on the table... very large.", "rating": 3, "date": "2007-06-03"}, {"excerpts": ["Satay - tastey\n"], "author": "Derk C.", "review": "I've been here for lunch many times, never dinner though\n\nThe Good:\nLemon Chicken Soup - Chicken is tender and moist, coconut milk gives it a nice sweet creaminess, one of the best things there and it comes with the lunch combo.\nPad-See Ew - Noodles have a nice texture, and a hint of sweetness.  I like to add chili sauce to it.  Meat can be dry though.\nSatay - tastey\nSeafood Thai Fried Rice\nFish Cake\n\nThe Decent:\nPad Thai - Way better than King of Thai Noodle\nBBQ Chicken - Mine was not dry like some other reviewers.  Most of the flavor comes from dipping in the sweet garlic sauce.\n\nThe Bad:\nPanaeg Nur - Spicy beef curry was dry and a lil tough, but at least it was in curry sauce.  The curry was ok, not great.\nOnline Menu - The prices on their online menu are dated.  Add about $1.50.", "rating": 4, "date": "2010-09-16"}, {"excerpts": ["Their Chicken Satay with Peanut Sauce is, well, quite decent:) ", "(I cook it at home, I have high standards since this is one of Singapore's and Malaysia's signature/national dishes). ", "Definitely come back over and over again with local and visiting friends. ", "The price is good, the service is always better than ok and the boys are hot usually:) ", "The reason I didn't give this a 5-star because of its location (I am not a fan of this area in SF) and the parking here is bad esp on weekends. ", "But I am definitely a fan."], "author": "Ambrose A.", "review": "I usually can tell if I am in a good restaurant or a great restaurant -- by the smell of the place and the cleanliness of the entire dining room, tables and the ambience (it was soft-focus, candlelit-radiance on this night) ...also by the way guests glare and stare (salivating?) at each other's starters and exotic and flavorful entrees that pass by their tables. So, I knew I was in a great neighborhood restaurant cos the warmth was immediate. The smell of the dishes was fresh and unmistakably Asian -- flavorful burst of crushed and blistered lemongrass, chopped cilantro, basil leaves, familiar curry paste and sweet sour plum sauce rule the air. This place ranks very high in my book (the kind of dishes I feature on my food blog  ( http://queergam.blogspot.com ). Manora's is as good as it gets for me. People always find ways to fault dishes esp the so-called Asian food experts. This popular restaurant, located on the corner of Folsom St and 12th St in San Francisco, is as good as it gets.  I've eaten Thai at so many places in NY and CA, but one bite of their beef curry and the green salad with hard boiled eggs and drizzled with sweet plum sauce and crushed peanuts, swept me away! Their Chicken Satay with Peanut Sauce is, well, quite decent:) (I cook it at home, I have high standards since this is one of Singapore's and Malaysia's signature/national dishes). Definitely come back over and over again with local and visiting friends. The price is good, the service is always better than ok and the boys are hot usually:) The reason I didn't give this a 5-star because of its location (I am not a fan of this area in SF) and the parking here is bad esp on weekends. But I am definitely a fan.", "rating": 4, "date": "2012-03-13"}, {"excerpts": ["ka gai soup, and the chicken satay. ", "Basically, you cannot go wrong with any entree dish you might choose to order here. ", "I return here time and again for the friendly waiters, excellent service, and tasty meals that I can count on. ", "BIG TIP - dining after 9pm on weeknights almost guarantees you a quiet dinner with a restaurant to yourself, which is fun for sure. ", "The reason why this restaurant has remained so successful in San Francisco for so many years is because it is just SO GOOD!"], "author": "Marc S.", "review": "Absolutely one of my favorite places to eat Thai food in San Francisco. I strongly recommend the soft shell crab appetizer - perfect for two split in half like butter - the tom ka gai soup, and the chicken satay. Basically, you cannot go wrong with any entree dish you might choose to order here. I return here time and again for the friendly waiters, excellent service, and tasty meals that I can count on. BIG TIP - dining after 9pm on weeknights almost guarantees you a quiet dinner with a restaurant to yourself, which is fun for sure. The reason why this restaurant has remained so successful in San Francisco for so many years is because it is just SO GOOD!", "rating": 5, "date": "2009-02-15"}, {"excerpts": ["Chicken satay was superb and their peanut sauce is just damn good! ", "I love my Thai food ", "and I can only recommend a few, this is one of the original ones to go to in the city. ", "My favorite to order here is the chicken satay (the only place that serves it the way I like it!)"], "author": "Ateh M.", "review": "I've heard of this place a decade ago. I've visited probably a dozen times only but each time it's always surprisingly good. Chicken satay was superb and their peanut sauce is just damn good! I love my Thai food and I can only recommend a few, this is one of the original ones to go to in the city. My favorite to order here is the chicken satay (the only place that serves it the way I like it!)", "rating": 4, "date": "2009-07-16"}, {"excerpts": ["My favorite order:\n- Chicken Satay\n- 34. ", "Pra-Ram-Long-Song \n", "Broiled tender sirloin of beef on bed of spinach, topped with spicy peanut sauce. \n- 45. ", "Panaeng-Sam-Ros  \n", "A combination of crisp chicken, pork and beef deep-fried, topped with spicy red curry sauce. ", "Meat was crunchy yet still tender.\n- both of us had a serving of rice\n", "We could have easily shared one dish and been content, possibly even have dessert.  \n", "I will definitely come back. "], "author": "Michelle M.", "review": "Food is delicious. Waiters are attentive but not constantly bothering you seeking approval.  2 people can enjoy a filling dinner for $40 and have left overs to take home.  My favorite order:\n- Chicken Satay\n- 34. Pra-Ram-Long-Song \nBroiled tender sirloin of beef on bed of spinach, topped with spicy peanut sauce. \n- 45. Panaeng-Sam-Ros  \nA combination of crisp chicken, pork and beef deep-fried, topped with spicy red curry sauce. Meat was crunchy yet still tender.\n- both of us had a serving of rice\nWe could have easily shared one dish and been content, possibly even have dessert.  \nI will definitely come back. If I hadn't had shrimp for lunch, I might have tried the pad thai because I heard it was good here.", "rating": 4, "date": "2010-01-14"}, {"excerpts": ["For my main dish I had the chicken satay which was real creamy tasting ", "and it seemed like it was sitting around for a while.  ", "I had some kind of chicken curry for my main dish which for very average for Thai food.   ", "The chicken here also seemed very cheap (more like chinese chicken) and it came with friend rice (also chinese style).  ", "Yes, it is cheap (like 8.00 for the lunch special), but I'd rather pay a few more bucks for something worth enjoying.  ", "The decor seemed a little old and cheezy too, and I've been to Thailand ", "so I know what good Thai food is.  ", "This place don't cut it."], "author": "Mitch A.", "review": "I went here for lunch.  The soup I had was just OK and the chicken seemed a little on the cheap side (fat and brown meat).   For my main dish I had the chicken satay which was real creamy tasting and it seemed like it was sitting around for a while.  I had some kind of chicken curry for my main dish which for very average for Thai food.   The chicken here also seemed very cheap (more like chinese chicken) and it came with friend rice (also chinese style).  Yes, it is cheap (like 8.00 for the lunch special), but I'd rather pay a few more bucks for something worth enjoying.  The decor seemed a little old and cheezy too, and I've been to Thailand so I know what good Thai food is.  This place don't cut it.", "rating": 2, "date": "2006-06-19"}, {"excerpts": ["\" We had the usual satay , steamed white rice and pickled cucumbers. ", "The coconut milk chicken soup was surprisingly sweet and creamy-- ", "i liked the bite sized pieces of chicken breast in it. "], "author": "linda l.", "review": "Tuesday my pal called me and said \" lets got for thai\" We had the usual satay , steamed white rice and pickled cucumbers. The coconut milk chicken soup was surprisingly sweet and creamy-- i liked the bite sized pieces of chicken breast in it. can't wait to try the pad thai.", "rating": 5, "date": "2009-03-05"}, {"excerpts": ["Didn't start out well with a decent chicken satay and a lamentable special of the day: oysters wallowing in a tasteless greenish goo.  ", "Great main dishes, however, especially high Thai price/quality ratio.  ", "The tender chicken in yellow curry was particularly toothsome, as well as the seafood silver noodles."], "author": "Ultiminio P.", "review": "Went for the first time about ten days ago.  Very warm ambience.  Didn't start out well with a decent chicken satay and a lamentable special of the day: oysters wallowing in a tasteless greenish goo.  Great main dishes, however, especially high Thai price/quality ratio.  The tender chicken in yellow curry was particularly toothsome, as well as the seafood silver noodles.", "rating": 4, "date": "2009-03-26"}], "namsod": [], "pooket express": [{"excerpts": ["Started with an appetizer of the  Pooket Express and main dishes of Moo-Gra-Tiam (pork) and Pad Thai noodles. ", "My wife and I enjoyed our meal...everything we had tasted good! ", "Service was not \"pampering\" but adequate. ", "Yes, an \"older\" restaurant...but has a feel like restaurants I've been to in Bangkok..."], "author": "Rich H.", "review": "I used to come here for lunch when I worked in the area...great lunch menu (esp the lunch combo plates). \n\nI happened to be in the area on a recent Saturday and decided to stop in for dinner. Arrived just as they opened for dinner, so found street parking around the corner (parking can be a challenge in this area). This is also an area that you need to aware of your surroundings (esp in the late afternoon & evening hours).\n\nStarted with an appetizer of the  Pooket Express and main dishes of Moo-Gra-Tiam (pork) and Pad Thai noodles. My wife and I enjoyed our meal...everything we had tasted good! Service was not \"pampering\" but adequate. Yes, an \"older\" restaurant...but has a feel like restaurants I've been to in Bangkok...", "rating": 4, "date": "2016-07-31"}, {"excerpts": [": Pooket Express. ", "You must love fish sauce because this appetizer, served in a shell, has tons of it.\n", "16: "], "author": "Mister X.", "review": "5 - 16 - 28 - 41 - 43 - 44\n\nThe combination that will unlock your taste buds to a whole...*slap*\n\nWTF am I writing? Sorry about that. Let me try again:\n\nI've only been here for dinner. On weeknights and Sundays the parking is not that bad, usually within a block. On Fridays and Saturdays you'll compete with the club goers down the street (way down the street).\n\n5: Pooket Express. You must love fish sauce because this appetizer, served in a shell, has tons of it.\n16: Tom Yum Goong. Spicy, Lemongrassy soup. Delicious. Good for about four people as an appetizer.\n28: Gang Gari Guy. Chicken in Yellow Curry. Everyone loves this dish, comes with potatoes that soaked up the flavor. If I could only have one dish, this would be it. Or maybe 44.\n41: MaKeur-Paad-Prik. Yummy sauted Japanese eggplant with prawn, chicken and pork.\n43: Sahai-Pad-King. Sweet combination of shrimp, pork and chicken. It reminds me a little of sweet and sour Chinese dishes.\n44: Asparagus with Lobster Sauce. When asparagus is out of season they will substitute it with another vegetable. Right now it's sweet peas. Amazing.\n\nEverything I've tried here I've really liked, except for the pad thai which was just OK.", "rating": 5, "date": "2006-09-24"}, {"excerpts": ["Everything we ordered was very good, the Som Tum (green papaya salad), Pooket Express (spicy seafood salad), Tom Yum (spicy lemongrass soup with shrimp), and chicken with green curry.  ", "I would have liked it spicier ", "but I asked for fresh chopped Thai chilies and "], "author": "Jenny S.", "review": "I just returned from a trip to Thailand, so with my new found expertise in Thai food and my new found love of Thai chilies I've been returning to my top Thai restaurants in the city.  Two down, one to go.\n\nThep Phanon disappointed.  Manora did not.  Everything we ordered was very good, the Som Tum (green papaya salad), Pooket Express (spicy seafood salad), Tom Yum (spicy lemongrass soup with shrimp), and chicken with green curry.  I would have liked it spicier but I asked for fresh chopped Thai chilies and that did the trick.  \n\nI've had better Thai food in Thailand, but not in San Francisco.", "rating": 3, "date": "2007-04-23"}], "larb chicken": [], "plas goong": [], "tongtong": [], "porpiatod": [], "pirate treasure": [{"excerpts": ["#11 Pirate Treasure $6.95: ", "Duh. ", "It starts with \"pirate\". ", "Don't read the description ", "(it doesn't really prepare you, anyway). "], "author": "Dan B.", "review": "Calling all players. It's time to analyze the game.\nHere are but a few genres of Thai server outfits.\n\nSolids & Wovens: Ploy II, Koh Samui & The Monkey Shines, Marnee, etc..\n\nAll-Black: Million Thai, Thai Place II, Gecko Gecko, etc..\n\nStreet Clothes: Tawan's, Wat Mongkolratanaram, Jarin, etc..\n\nGeneric Business Casual: Lers Ros, Bai Som, Jitlada, etc..\n\nMash-Up: Thep Phanom, which is quirky in just about every aspect anyway.\n\nThen Manora's makes its play. I hadn't completely stepped in yet when I found myself facing a man in a SUNFLOWER shirt. Not yellow like the color of a sunflower - I'm talking about sunflower drawings all around.\n\nAnother server had an all-over print of a PAINTING similar to the ones on the walls. The third server I saw broke the steelo with a solid faded WINE color. Who knows what he was thinking.\n\nEverything I ordered materialized quickly.\n\n#11 Pirate Treasure $6.95: Duh. It starts with \"pirate\". Don't read the description (it doesn't really prepare you, anyway). Just get it.\n\n#42 Answer to the Universe Omelette $8.95: Middle of the road, give or take. I appreciate its umami over Bai Som's sweet version.\n\n#00 Ice Water $0.00: Even when the crowd picked up, my glass kept getting filled. Possibly among the best water service I've had.\n\n#58 Mussel Gooey Pajeon $10.95: I didn't get it, but it could be semi-adventurous if it's like Amphawa's hoi-tod / hoy tod rendition.\n\nNOTE: The servers can seem a little ex-conish, but I think you want that. You're here for Pirrrrrate Treasurrrrre, not Double Rainbow Pot o' Gold.", "rating": 3, "date": "2012-06-14"}, {"excerpts": ["(I didn't think the Pirate Treasure is that good).  ", "The beef with basil was a bit overcooked, but the yellow curry chicken was good with rice (although the chicken pieces were cut quite large).  ", "I do like their mango sticky rice as dessert - ", "I love mango and I love sticky rice and a lot of places "], "author": "Elizabeth L.", "review": "I would probably give the food here 3 1/2 stars but their service is decent so I'll bump it up to 4 stars.  I've been here several times and their food is pretty standard Thai.  Some of their appetizers are good (I like the Larb Gai salad) but others are just okay (I didn't think the Pirate Treasure is that good).  The beef with basil was a bit overcooked, but the yellow curry chicken was good with rice (although the chicken pieces were cut quite large).  I do like their mango sticky rice as dessert - I love mango and I love sticky rice and a lot of places don't do it that well.\n\nThis place is also great for take out.  They pack the food in the nicer plastic containers versus the paper take out boxes so it's harder to spill.  The flat plastic containers also maintain a better presentation.  I think it's a nice touch.", "rating": 4, "date": "2008-12-28"}, {"excerpts": ["We had to try the Pirate Treasure that everyone on yelp raved about ", "and it was very very tasty.  ", "The mix of flavors work wonderfully.  ", "This was not bad, but it's no Pirate Treasure.  "], "author": "Kat L.", "review": "This place was close to where I was staying and it sounded good so my sister & I drove over one night.  They have a wide array of items to choose from.  There are new items with a fusion/upscale touch and some traditional items.\n\nFor full pics and review go to http://www.kats9lives.com/2008/04/pirates-treasure.html\n\nI think the appetizers were the best part of the meal.  The main courses we chose were only so-so.  We had to try the Pirate Treasure that everyone on yelp raved about and it was very very tasty.  The mix of flavors work wonderfully.  We kept the remaining sauces at the table to mix in with the rest of the food! ^_^ \n\nThe second appetizer we chose was the Katong Ton.  It's fried crispy cups stuffed with mixed curry inside.  This was not bad, but it's no Pirate Treasure.  If I come back a next time I would definitely try more appetizers and maybe skip the main course, then end with a dessert.\n\nI don't know why people rave about the Pad Thai.  It was a little bland for me, but maybe it was an off night for the chef?  If I get to go back a next time maybe I will try some of their other noodle dishes.\n\nThe Mango and Sticky Rice was great.  I didn't really care for the mango, but the sticky rice was done to perfection.  I really enjoyed the sweetness and flavor.  Yum Yum!", "rating": 4, "date": "2008-08-08"}, {"excerpts": ["This little corner establishment serves up some of the best Southeast Asian fare in SF with good seafood selections (pirate treasure!!!) and fresh daily specials. \n\n"], "author": "JR D.", "review": "This little corner establishment serves up some of the best Southeast Asian fare in SF with good seafood selections (pirate treasure!!!) and fresh daily specials. \n\nPortions are ample and is accompanied by a quant dinning room. Service is OK, but that is because most of the servers don't speak much English, mostly Thai, but that's fine by me, a good sign of authentic cuisine. \n\nReservations recommended on the weekend.", "rating": 3, "date": "2007-11-12"}], "fresh mint roll": [{"excerpts": ["Fresh Mint Roll (fresh roll with Shrimp)\n", "Beef Shish-Ka-Bob  \n", "Moo-Gra-Teiam  "], "author": "Amelia M.", "review": "One of the better Thai Restaurants I have been to in SF. \n\nI have yet to have a bad meal here. It is best when you go in a larger group (just beware of the long wait here if you go at dinner time) so you can try a lot of dishes. I am a huge fan of their Pad Thai... not greasy at all. Something that I tend to find at other Thai establishments.\n\nDishes to try:\n\nKow-Graprao (Minced Chicken)\nKow Pla Muk Pad-Ped (Sauteed Calamari)\nPad-Thai (Noodles)\nPad-See Ew (Pan fried flat noodle)\nFresh Mint Roll (fresh roll with Shrimp)\nBeef Shish-Ka-Bob  \nMoo-Gra-Teiam  (Pork)\nPla-Muk-Pad-Ped (Calamari)\n\nDrinks: \nGreat drinks from the full bar (Cosmos are good here)\nHot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\nFried Banana Balls with Ice Cream \n\nThe staff is very nice and friendly. Just make sure to have your entire party there. It takes time to get seated. Parking is not too bad as long as it is not too late and people are heading out to the clubs, which will make parking a bit harder in the area.", "rating": 4, "date": "2008-03-19"}], "yummakeur": [], "plah pamuk": [], "vegetarian delight": [{"excerpts": ["I had been looking forward to the \"Vegetarian Delight\" as I had a serious taro craving. "], "author": "Jenn W.", "review": "I had been looking forward to the \"Vegetarian Delight\" as I had a serious taro craving. I was disappointed, I had been hoping for a yummy deep fried ball of delicious taro goo & instead received really bland taro fries with some tofu triangles. \n\nI had one of the appie specials as my main - baked oysters. Probably an odd thing to order at a Thai restaurant as they were baked with cream & spinach, but served with sweet & sour peanut sauce and lime wedges. \n\nSo yeah, with my menu selections, Manora's Thai delivered epic fail.\n\nThree stars and a return trip are in order though, as my husbands fish dish was in such a perfect delicious red coconut curry sauce that I greedily sopped it up with plain rice after finishing my sad small portion of strange oysters. Obviously I just ordered wrong.", "rating": 3, "date": "2009-10-21"}, {"excerpts": ["We had the Pirate's Treasure which was a spicy mix of shrimp, chicken, and bean thread sheets and the Vegetarian Delight which was fried tofu and taro.  ", "Both were excellent.  ", "The taro was lightly fried and melted in your mouth.  "], "author": "Zoe H.", "review": "I have wanted to try Manora for a long time.  Finally, on Sunday, after a long day of couch shopping in SOMA and a craving for Thai, we stopped in Manora.  It was 5:00 and we arrived just as they turned out their lights to start seating for dinner.  The restaurant was initially freezing, probably because they had just opened.  We immediately ordered tea and some hot appetizers to warm up.  They brought out our two appetizers within minutes and they were delicious.  We had the Pirate's Treasure which was a spicy mix of shrimp, chicken, and bean thread sheets and the Vegetarian Delight which was fried tofu and taro.  Both were excellent.  The taro was lightly fried and melted in your mouth.  When we finished our appetizers, the restaurant had warmed up and had almost completely filled up.\n\nFor dinner we ordered Pad Thai, MaKeur-Paad-Prik (Japanese eggplant with prawn, chicken, and pork in a spicy basil garlic sauce), and Goong Ping (charbroiled jumbo prawns served with a spicy lemon garlic sauce).   All three dishes were delicious.  I especially loved the eggplant dish.  The sauce wasn't too heavy and was just spicy enough to give it a kick.  The prawns in the Goong Ping were charbroiled on skewers and the skewers were stuck into an orange so that the shrimp were radiating out of it.  Nice preparation.  The pad thai was one of the better pad thais I've had in the city.  We all had leftovers which is always an added bonus.  I think that sometimes Thai food tastes better the next day after the spices and sauces have been soaked into the meat and veggies.  I look forward to coming back and trying more of the menu!", "rating": 5, "date": "2008-01-24"}, {"excerpts": ["we ordered:\nVegetarian Delight - Slices of - fried - tofu and taro in batter, served with sweet and sour peanut sauce. "], "author": "Tawny A.", "review": "mmmmmmmm, the food here is really really good. i only give it four stars though because the portions are just right and the dishes are more on the pricey side. i do like it though because it's like a block from my house and it's a great place to bring the baby. staff here is nice.\n\nwe ordered:\nVegetarian Delight - Slices of - fried - tofu and taro in batter, served with sweet and sour peanut sauce. very very good!\n\nPed-Tod-Ka-Na-Grob - Crispy pieces of roast duck fried in batter with greens, served with sweet chili garlic sauce. Yum!\n\ni don't remember what else we ordered, but we like coming here.", "rating": 4, "date": "2008-01-11"}, {"excerpts": ["We also had two appetizers, their Por Pia Tad fried rice rolls (with sweet and sour sauce), which were fine but nothing exceptional, and their Vegetarian Delight - fried tofu and taro that was just that, bland served with \"sweet and sour peanut sauce\" consisting of the same sweet and sour sauce everywhere else with crushed peanuts mixed in.  \n\n"], "author": "Cheryl C.", "review": "Very disappointing.   They had very few vegetarian options on the menu, although we had heard they could make anything vegetarian.  We tried a vegetarian version of their Mee Grobb crispy noodles and it was a plate of bland noodles smothered in sticky sweet and sour sauce.  We also had two appetizers, their Por Pia Tad fried rice rolls (with sweet and sour sauce), which were fine but nothing exceptional, and their Vegetarian Delight - fried tofu and taro that was just that, bland served with \"sweet and sour peanut sauce\" consisting of the same sweet and sour sauce everywhere else with crushed peanuts mixed in.  \n\nWe went with some omnivore friends who enjoyed their meal somewhat more, although the general consensus was \"OK, but nothing special.\"  One friend found a hair in her food and was comped the dish.", "rating": 2, "date": "2008-07-27"}], "larb beef": [], "yum hed": [], "tom yum goong": [{"excerpts": ["Tom Yum Goong  : ", "4.5 stars - broth was amazing, shrimp was good", ", wished mushrooms were cooked a bit more, too many huge chunks of onions, good amount of heat/spice\n", "* ", "Beef Shish-Ka-Bob : 3.5 stars - meat was a bit dry and over cooked, 2 skewers\n", "* Moo-Gra-Tiam : 5 stars - so much flavor!  ", "so much garlic (get the beano or gas-x ready, pre + post dinner), ", "but it's sooo good and worth it!  ", "great quantity too\n", "* ", "Panaeng-Sam-Ros : ", "3.5 stars - curry was good, but the meats were a little flavorless (the pork one was the best)\n"], "author": "Tina F.", "review": "{ service : 3 stars } \n* service is a bit slow, hard to find waiters/waitresses when you want them\n\n{ atmosphere : 3.5 stars }\n* thai-ish, looks traditional (although i wouldn't necessarily know)\n* paper napkins\n* tables can be close together / cozy (share conversations with the table next to you)\n\n{ food : 4 stars }\n* Tom Yum Goong  : 4.5 stars - broth was amazing, shrimp was good, wished mushrooms were cooked a bit more, too many huge chunks of onions, good amount of heat/spice\n* Beef Shish-Ka-Bob : 3.5 stars - meat was a bit dry and over cooked, 2 skewers\n* Moo-Gra-Tiam : 5 stars - so much flavor!  so much garlic (get the beano or gas-x ready, pre + post dinner), but it's sooo good and worth it!  great quantity too\n* Panaeng-Sam-Ros : 3.5 stars - curry was good, but the meats were a little flavorless (the pork one was the best)\n* Som-tum : 4 stars - good flavors\n\nTIP: street parking isn't bad and free at night (maybe after a certain time? not sure what that time is)", "rating": 4, "date": "2014-01-20"}, {"excerpts": ["Some of the dishes I recommend: Tod-Mon, Som-Tom, Tom Yum Goong, Gang-Ped-Ped-Yang, Pra-Ram-Long-Song, Pong-Pang, & the classic Pad Thai. ", "You should try anything that looks delicious to you of course."], "author": "Pascal G.", "review": "Manora's Thai Cuisine is one of my fav's in SF! The food tastes authentic, the atmosphere is homey and relaxing, as well as parking isn't that bad in the neighborhood compared to other parts of the city. \n\nSome of the dishes I recommend: Tod-Mon, Som-Tom, Tom Yum Goong, Gang-Ped-Ped-Yang, Pra-Ram-Long-Song, Pong-Pang, & the classic Pad Thai. You should try anything that looks delicious to you of course.", "rating": 4, "date": "2013-12-12"}, {"excerpts": ["We ordered tom yum goong, beef satay, pad thai, and som-tum. ", "My favorite was the pad thai, which I actually don't usually order if the restaurant has pad kee mao, but I still enjoy nonetheless. ", "The highlight of the pad thai here is definitely in the flavors - savory, a little sour, not too sweet, and some spice. ", "I'm not a fan of peanuts, which is unfortunate because I love Thai and Vietnamese food, but I deal with it. ", "However, the beef satay had too strong of a peanut flavor for me, and was a little dry as well. ", "That being said, if you like peanuts, that`s probably a great dish. ", "The papaya salad was on par with the pad thai in terms of quality, so not much to say there. ", "But tom yum goong is one of my favorite soups in the world because it incorporates all my favorite flavors: salty, spicy, and sour. ", "Sadly, it was a bit of a disappointment last night because it wasn't spicy at all, and too sweet for me. "], "author": "Elizabeth H.", "review": "Came here with some friends last night before going across the street to The Willows for drinks and board games. We ordered tom yum goong, beef satay, pad thai, and som-tum. My favorite was the pad thai, which I actually don't usually order if the restaurant has pad kee mao, but I still enjoy nonetheless. The highlight of the pad thai here is definitely in the flavors - savory, a little sour, not too sweet, and some spice. I'm not a fan of peanuts, which is unfortunate because I love Thai and Vietnamese food, but I deal with it. However, the beef satay had too strong of a peanut flavor for me, and was a little dry as well. That being said, if you like peanuts, that`s probably a great dish. The papaya salad was on par with the pad thai in terms of quality, so not much to say there. But tom yum goong is one of my favorite soups in the world because it incorporates all my favorite flavors: salty, spicy, and sour. Sadly, it was a bit of a disappointment last night because it wasn't spicy at all, and too sweet for me. The meats and vegetables in the soup, on the other hand, were great! \n\nReasonable prices, and great service. In fact, we left to go play games across the street at around 8PM. At around 10:45, we were getting ready to leave The Willows when I realized that my DSLR wasn't there, so I ran across the street to check if I had left it there. Despite already being closed for the day, they let me in, and handed me my camera back - having kept it in a safe place behind the cash register. So thankful!", "rating": 4, "date": "2014-03-16"}, {"excerpts": ["Tom Yum Goong (spicy and sour prawns and mushroom soup with a touch of lemon grass and roasted chili) - The prawns were jumbo. "], "author": "Betty N.", "review": "3.25 stars.\n\nIt's good, but not that good. Maybe I am ordering the non-spectacular dishes, but for the most part, it was good at best, but not enough to get itself 4-5 stars.\n\nAte dinner here on a Fri. night before going to a bday party. They did not take 2 person resos, so we had to wait for approximately 10-15 minutes. We were impressed by the many accolades on the walls; from Best Thai Restaurant in SF, Zagat Rated, Best 100 Thai Restaurant in the World, etc. This place has to be good, right? Um, yeah, sure.\n\nThe place was packed and we were seated against the front window. It is super casual here. I mean, we were not that dressy, but we looked like a homecoming couple compared to the other customers. I thought I was eating in SJ for a second. Nothing wrong with that, but don't expect lipstick glam and LA glitter here.\n\nWe ordered the following with comments:\n\n1. Soft Shelled Crab - this was their special for the day and it was below average. The batter was so thick, we felt like we were eating fried batter, not the crab.\n\n2. Tom Yum Goong (spicy and sour prawns and mushroom soup with a touch of lemon grass and roasted chili) - The prawns were jumbo. Good flavor, good soup.\n\n3. Gang Ped Ped Yang (roast duck curry cooked in coconu milk and red chili sauce w/ a combo of pineapple and spinach) - This was also pretty good, but I like Osha's duck curry better. Personally, the pineapples were a bit too much and took away from the flavor of the curry and duck.\n\n4. Red Curry Snapper with greens - our favorite dish of the evening. The fish was cooked perfectly and the greens were nicely flavored with the red chili sauce, not much curry, which was pleasant.\n\nService was good. They refilled our water glasses promptly and there was not a long wait period between dishes. Add one beer and the total was $47 dinner for two. Not bad.\n\nI will return because I am sure there are other mind-blowing dishes somewhere within here. I just didn't hit the jackpot this time around.", "rating": 3, "date": "2008-10-11"}, {"excerpts": ["We started out with the Tom Yum Goong [spicy and sour prawns and mushroom soup with a touch of lemon grass in roasted chili ", "aroma]. ", "My ", "oh my, this soup is SPICY! ", "Next time I'll have to ask for one step down in the spice. ", "My sinuses, which have been bothering me for over a week, cleared up instantaneously. "], "author": "Tinna H.", "review": "The one thing I order at all Thai places upon first visit is the Thai Iced Tea. If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. We wandered in rather early for dinnertime, so I suppose the attentive service would have been expected.\n\nWe started out with the Tom Yum Goong [spicy and sour prawns and mushroom soup with a touch of lemon grass in roasted chili aroma]. My oh my, this soup is SPICY! Next time I'll have to ask for one step down in the spice. My sinuses, which have been bothering me for over a week, cleared up instantaneously. The prawns were perfect, probably thrown into the soup at the very last second so that they wouldn't be smooshy. \n\nTo share, we ordered the Gai-Kraprao [sautéed minced chicken in sweet basil and fresh chili garlic sauce] and the Nur-Toon [a combination of beef cubes and spices cooked in mushroom and garlic sauce served in a clay pot]. One dish was a little on the saltier side, perfect for eating with a generous helping of Jasmine rice, which is ~$1 per person. The clay pot was nicely flavored. All portions were generous, and we had to take some food to go.\n\nConsidering the portions [good and plenty], the price [entrees average around $8 to $10], and the service [very attentive early on], I'd eat here again. You know, especially if I happen to be in the neighborhood, shopping at Costco or perhaps for a MINI/BMW, or spending the evening at Butter or Wish nearby.", "rating": 5, "date": "2009-01-22"}, {"excerpts": ["Tom Yum Goong. ", "Spicy, Lemongrassy soup. ", "Delicious. ", "Good for about four people as an appetizer.\n", "28: Gang Gari Guy. ", "Chicken in Yellow Curry. ", "Everyone loves this dish, comes with potatoes that soaked up the flavor. ", "If I could only have one dish, this would be it. ", "Or maybe 44.\n", "41: ", "MaKeur-Paad-Prik. ", "Yummy sauted Japanese eggplant with prawn, chicken and pork.\n", "43: ", "Sahai-Pad-King. ", "Sweet combination of shrimp, pork and chicken. ", "It reminds me a little of sweet and sour Chinese dishes.\n", "44", ": Asparagus with Lobster Sauce. ", "When asparagus is out of season they will substitute it with another vegetable. ", "Right now it's sweet peas. "], "author": "Mister X.", "review": "5 - 16 - 28 - 41 - 43 - 44\n\nThe combination that will unlock your taste buds to a whole...*slap*\n\nWTF am I writing? Sorry about that. Let me try again:\n\nI've only been here for dinner. On weeknights and Sundays the parking is not that bad, usually within a block. On Fridays and Saturdays you'll compete with the club goers down the street (way down the street).\n\n5: Pooket Express. You must love fish sauce because this appetizer, served in a shell, has tons of it.\n16: Tom Yum Goong. Spicy, Lemongrassy soup. Delicious. Good for about four people as an appetizer.\n28: Gang Gari Guy. Chicken in Yellow Curry. Everyone loves this dish, comes with potatoes that soaked up the flavor. If I could only have one dish, this would be it. Or maybe 44.\n41: MaKeur-Paad-Prik. Yummy sauted Japanese eggplant with prawn, chicken and pork.\n43: Sahai-Pad-King. Sweet combination of shrimp, pork and chicken. It reminds me a little of sweet and sour Chinese dishes.\n44: Asparagus with Lobster Sauce. When asparagus is out of season they will substitute it with another vegetable. Right now it's sweet peas. Amazing.\n\nEverything I've tried here I've really liked, except for the pad thai which was just OK.", "rating": 5, "date": "2006-09-24"}, {"excerpts": ["As appetizers we shared a Tom Yum Goong soup and a Soft Shell Crab, the soup was excellent with mushrooms and some prawns, and the crab was fresh with the right amount of batter. "], "author": "jota j.", "review": "I was craving Thai food in San Francisco. I remembered this restaurant on the corner of Folsom and 12th as a good alternative for Thai fare at a fair price. I'm happy to say I was not disappointed! The restaurant looks exactly the same way, but more importantly the food was as flavorful, unpretentious and well served as I remembered it. As appetizers we shared a Tom Yum Goong soup and a Soft Shell Crab, the soup was excellent with mushrooms and some prawns, and the crab was fresh with the right amount of batter. Later, we had the Pooket Skewer, grilled prawns, scallops and veggie skewer, the seafood was perfectly cooked and the spicy sauce was just right. To finish we ordered one of the specials, Bay Oysters, they were baked in a garlicky creamy sauce. It was tasty but we could have done without them because we had enough food and wine already. The service was friendly and timely, our waiter never made us feel rushed. I'm glad to see this kind of neighborhood restaurant thrive in a city where now you see them, now you don't. Keep the good work!", "rating": 4, "date": "2011-12-30"}, {"excerpts": ["The rice plates are my favorite but the soups are great on a cold day specially the Tom Yum Goong. ", "Friendly staff too. ", "I'm gonna miss this little place when I leave the neighborhood next week."], "author": "Julian M.", "review": "Nice little place and most importantly affordable. Meat skewers are delicious as are all of the entrees I have tried. Eat here for $10-$15. The rice plates are my favorite but the soups are great on a cold day specially the Tom Yum Goong. Friendly staff too. I'm gonna miss this little place when I leave the neighborhood next week.", "rating": 4, "date": "2010-01-21"}, {"excerpts": ["my favorite dishes: por-pia-tod (fried rice rolls), tom yum goong (spicy/sour prawn soup), woon sen pad, and duck curry.\n\n"], "author": "kim n.", "review": "this has got to be one of my favorite thai restaurants - every dish is consistently flavorful and done well.\n\ni live 1 block away and get take-out from here once per week.  \n\nif i eat in, i always order the oyster appetizer.\n\nmy favorite dishes: por-pia-tod (fried rice rolls), tom yum goong (spicy/sour prawn soup), woon sen pad, and duck curry.\n\nthey also have a full bar - so great for a weekend dinner before heading out.\n\ni wish they'd dim their lights a bit though.", "rating": 4, "date": "2007-07-19"}, {"excerpts": ["spring rolls, larb and tom yum goong are my fav appetizers. ", "everything on the menu is good...check out the chef's specials and specials of the day. ", "full bar too!"], "author": "cristina s.", "review": "i love this place. spring rolls, larb and tom yum goong are my fav appetizers. everything on the menu is good...check out the chef's specials and specials of the day. full bar too!", "rating": 5, "date": "2007-11-16"}, {"excerpts": ["They make the best Tom Yum Goong anywhere"], "author": "Brian M.", "review": "Love this place. Great Thai food at very reasonable prices. Very consistent. They make the best Tom Yum Goong anywhere", "rating": 5, "date": "2010-04-10"}], "tomkatalay": [], "gaitomka": [], "tom yum talay": [{"excerpts": ["tom yum talay", ": it's a soup dish, and i had requested them to add glass noodles to the soup.   ", "It was good, but didn't blow my mind away. ", "I've had better soup elsewhere. ", "i have to say there were a lot of spices used for this soup... maybe a bit too much???  "], "author": "Tiffany H.", "review": "Our friend recommended this thai restaurant to us, so we decided to try it since we were in the neighborhood.  I was a bit skeptical but I saw all the Michelin recommended and Zagat signs on the door, then I told myself this place must be good!!! Although we weren't really hungry, we still ordered three dishes.\n\n1. papaya salad:  we have to order this to compare this thai restaurant to others we like in SF.  It was not as spicy as I had hoped, but overall pretty good... but nothing too exciting.. i guess it's hard to mess up papaya salad?\n\n2. tom yum talay: it's a soup dish, and i had requested them to add glass noodles to the soup.   It was good, but didn't blow my mind away. I've had better soup elsewhere. i have to say there were a lot of spices used for this soup... maybe a bit too much???  I was really thirsty after drinking the soup!  \n\n\n3. pad thai:  Of course we had to order pad thai to ultimately make our judgement of this thai restaurant.  I am glad we did. Pad thai was the best dish for us here. every strand of noodle was very flavorful, and the noodles were cooked and stirred fried just right.  I think they are very good at stir frying or pan frying at this restaurant.\n\n\nOverall, it was A-OK for a Michelin recommended restaurant.", "rating": 3, "date": "2013-03-06"}, {"excerpts": ["We always order the same thing:\n\nTom Yum Talay - coconut seafood soup (mild). "], "author": "Haley D.", "review": "Best Thai food in the Bay, hands down!!!!\nIt's a tiny place, bursting with flavor. \nWe always order the same thing:\n\nTom Yum Talay - coconut seafood soup (mild). A MUST!\nGai-Kra Trao - mom's favorite, not mine\nPad Thai - a little dry\n \nThe best part of the meal is always the soup. If I had to choose my favorite food, this would be it. It is excellent every time. Everything in it is always so fresh, especially the seafood. They must get their own special delivery. Scallops are cooked to perfection, not tough at all, and the squid is just the same. Perfectly tender in the soup. Shrimp is superb as well. Fresh ginger and lemongrass. The mushrooms are delish. Mmmmmm... My mouth is watering just thinking about it. You can get it spicy or mild. I'm not a big spice person, but the mild is just perfect for me :)\n\nThis soup takes all that's good in the world and makes it edible. I cannot stress how amazing it is. This soup changed my life!", "rating": 5, "date": "2014-07-24"}, {"excerpts": ["My friends and I ordered a bunch of dishes and shared them, including Tom Yum Talay (spicy seafood soup), Gang-Ped-Ped-Yang (roast duck curry), Pad Thai, Asparagus with Lobster Sauce, and Mango with Sticky Rice. ", "The Tom Yum Talay was dynamite--I just couldn't get enough of the flavors and spiciness. ", "The Gang-Ped-Ped-Yang was delicious--duck is my new favorite meat in curry (it's all about the fatty but fabulous skin). ", "The Pad Thai was pretty good ", "but I prefer the one at King of Thai Noodle House, which is more saucy. ", "The Asparagus with Lobster Sauce was all right--you'd think lobster would make everything superb ", "but you're wrong. "], "author": "Liz T.", "review": "Another week, another Thai restaurant. If you can't tell, I'm eating my way through all of them--15 bucks at a time. Manora's food is worthy of three stars, but the service is spectacular--and not just for an Asian restaurant. So four stars.\n\nMy friends and I ordered a bunch of dishes and shared them, including Tom Yum Talay (spicy seafood soup), Gang-Ped-Ped-Yang (roast duck curry), Pad Thai, Asparagus with Lobster Sauce, and Mango with Sticky Rice. It was a lot of food for three people, but we love to eat and have a little of everything. \n\nThe Tom Yum Talay was dynamite--I just couldn't get enough of the flavors and spiciness. The Gang-Ped-Ped-Yang was delicious--duck is my new favorite meat in curry (it's all about the fatty but fabulous skin). The Pad Thai was pretty good but I prefer the one at King of Thai Noodle House, which is more saucy. The Asparagus with Lobster Sauce was all right--you'd think lobster would make everything superb but you're wrong. The Mango and Sticky Rice was a good, sweet ending to our night.\n\nI'm pretty sure I went to sleep at 11PM (very early for me) because I couldn't stay awake after inhaling all that. Can't wait to try more Thai restaurants, though. Where shall I go next?", "rating": 4, "date": "2008-11-01"}], "gang jurd": [{"excerpts": ["Standbys are the gang jurd soup and the house made fish cakes. ", "Please clean things up a bit and I'll happily add more stars."], "author": "Tina Z.", "review": "I really like this place and have been going for years usually for takeout. Would be awesome if they could work on their health score. 66 out of 100 freaks me out a bit, and I only recently noticed it when I had brought my parents here for lunch. The food is generally good, and I want to be supportive of this neighborhood gem. Standbys are the gang jurd soup and the house made fish cakes. Please clean things up a bit and I'll happily add more stars.", "rating": 3, "date": "2015-10-09"}, {"excerpts": ["That last scenario led me to Manora's and their Gang Jurd, a chicken broth filled with shrimp, chicken, tofu, spinach and noodles. ", "That's right. ", "No choosing. ", "You get everything. "], "author": "Jason B.", "review": "A cold day is a good reason to have soup for dinner. So is recovering from a late night to help reverse any immune system damage. And if you are dealing with both, well, it's definitely soup time.\n\nThat last scenario led me to Manora's and their Gang Jurd, a chicken broth filled with shrimp, chicken, tofu, spinach and noodles. That's right. No choosing. You get everything. It's absolutely delicious and exceptionally priced ($8), one of the best soups I've ever had.\n\nThe people who created this bowl of brilliance are super friendly and the service very quick. A gem of a place.\n\nThis might be a new tradition after epic nights. Which means I plan to return often.", "rating": 5, "date": "2011-05-08"}], "chef salad": [], "salad kak": [{"excerpts": ["The salad kak is sinful for a salad, but soo good."], "author": "Eileen R.", "review": "Manora's Thai is yummy, not too spicy and reasonably priced.  I have a hard time going and not having some fresh mint rolls and pad thai.  I love their fresh mint rolls, they're simple and tasty every time.  The salad kak is sinful for a salad, but soo good.", "rating": 5, "date": "2007-04-07"}], "mixed green": [], "somtum": [], "garlic quail": [{"excerpts": ["My boyfriend and our friend also tried the garlic quail which was followed by what they called a necessary moment of silence. ", "The price was also extremely affordable! ", "What a nice little gem in the midst of SOMA!"], "author": "Lisa T.", "review": "This place definitely deserves all the hype it gets on yelp. Not only was it one of the best pad thai's that I tried (perfectly cooked noodles, bean sprouts on the side so it doesn't take up extra space, with the perfect sprinkling or peanuts). My boyfriend and our friend also tried the garlic quail which was followed by what they called a necessary moment of silence. The price was also extremely affordable! What a nice little gem in the midst of SOMA!", "rating": 4, "date": "2013-05-28"}], "gaiyang": [], "gaikraprao": [], "ganggarigai": [], "pedtodkanagrob": [], "gangpedpedyang": [], "gangkiewwan": [], "nurtoon": [], "nurpadprik": [], "pra ram long song": [], "panaengnur": [], "saladnursun": [], "moogratiam": [], "mooprikking": [], "pooket skewer": [{"excerpts": ["Later, we had the Pooket Skewer, grilled prawns, scallops and veggie skewer, the seafood was perfectly cooked and the spicy sauce was just right. ", "To finish we ordered one of the specials, Bay Oysters, they were baked in a garlicky creamy sauce. ", "It was tasty but we could have done without them because we had enough food and wine already. ", "The service was friendly and timely, our waiter never made us feel rushed. ", "I'm glad to see this kind of neighborhood restaurant thrive in a city ", "where now you see them, now you don't. ", "Keep the good work!"], "author": "jota j.", "review": "I was craving Thai food in San Francisco. I remembered this restaurant on the corner of Folsom and 12th as a good alternative for Thai fare at a fair price. I'm happy to say I was not disappointed! The restaurant looks exactly the same way, but more importantly the food was as flavorful, unpretentious and well served as I remembered it. As appetizers we shared a Tom Yum Goong soup and a Soft Shell Crab, the soup was excellent with mushrooms and some prawns, and the crab was fresh with the right amount of batter. Later, we had the Pooket Skewer, grilled prawns, scallops and veggie skewer, the seafood was perfectly cooked and the spicy sauce was just right. To finish we ordered one of the specials, Bay Oysters, they were baked in a garlicky creamy sauce. It was tasty but we could have done without them because we had enough food and wine already. The service was friendly and timely, our waiter never made us feel rushed. I'm glad to see this kind of neighborhood restaurant thrive in a city where now you see them, now you don't. Keep the good work!", "rating": 4, "date": "2011-12-30"}, {"excerpts": ["We then shared 2 of the \"Chef's favorites\" dishes: the Pooket Skewer and the MaKeur-Paad-Prik. ", "Now, I don't really like things too spicy, and I've never seen a server seem so disappointed and personally offended by me asking for something mild. ", "I was a little perturbed by that, but the taste of the dishes easily made up for it. ", "The skewers--with charbroiled scallop, prawn, fish, and vegetables with yummy dips--was amazing. ", "And the Japanese eggplant in the other dish was perfectly done. "], "author": "Amy B.", "review": "Wow. Who knew this little place could pack such a punch! We happened to be in the neighborhood and were starving around 9:30pm. Manora's was open, so Manora's it was! I loved the decor and the authenticity as soon as we walked in.\n\nWe started with some hot tea, which was amazing! It was a red thai tea blend and smelled and tasted fabulous. We had the Yum Hed appetizer (combination of various types of mushrooms, prawn, and chicken in Thai spices, laid on a bed of greens), which was very good. It actually started sweet then went to spicy as we kept eating. Great flavor combination. We then shared 2 of the \"Chef's favorites\" dishes: the Pooket Skewer and the MaKeur-Paad-Prik. Now, I don't really like things too spicy, and I've never seen a server seem so disappointed and personally offended by me asking for something mild. I was a little perturbed by that, but the taste of the dishes easily made up for it. The skewers--with charbroiled scallop, prawn, fish, and vegetables with yummy dips--was amazing. And the Japanese eggplant in the other dish was perfectly done. My only real complaint is that they do not have brown rice, so we went with the jasmine rice, which was also really good. \n\nOf course, you can't have Thai food without having some mango with sticky rice, so indeed we ordered that as well. \n\nThe presentation, taste, service, and ambiance all surpassed my expectations for a corner place that was going to ease my late-night starvation. I will definitely be back!", "rating": 4, "date": "2009-11-22"}], "makeurpaadprik": [], "kaiyadsai": [], "sahaipadking": [], "panaengsamros": [], "paad kinnaree": [], "padseeew": [], "pad thai": [{"excerpts": ["liked the pad thai and the curry. ", "A bit pricier ($12 for pad thai and $12.25 for curry) than my other thai spots but with good portions,  ", "I can especially recommend the Som Tom and Nam Sod salads."], "author": "Aidana M.", "review": "Good food at a good value. \nGood place for a date, as they have beautiful fresh flowers at each table. The place has its own charm too once you enter. \n\nThe Thai menu is quite extensive, and the food is close to \"genuine\" Thai cooking. liked the pad thai and the curry. A bit pricier ($12 for pad thai and $12.25 for curry) than my other thai spots but with good portions,  I can especially recommend the Som Tom and Nam Sod salads.", "rating": 4, "date": "2018-11-08"}, {"excerpts": ["You can tell a really good Thai place of off their Pad Thai! ", "The noodles are perfectly soft, with a alight chew! ", "There are so many places that have their noodles too hard, or too chewy! ", "The flavor is awesome with the hint of dried shrimp! ", "This place is a MUST have!"], "author": "Dezi S.", "review": "One of THE best Thai restaurants in the City! Everything tastes so fresh and authentic! The minced basil beef is a family favorite! So is the fried fish with garlic chili sauce! Unfortunately, they don't do the whole fish any longer, but the fillets are still tasty! The Thai iced tea is NOT to sweet, and everything else is just straight BOMB!!! You can tell a really good Thai place of off their Pad Thai! The noodles are perfectly soft, with a alight chew! There are so many places that have their noodles too hard, or too chewy! The flavor is awesome with the hint of dried shrimp! This place is a MUST have!", "rating": 5, "date": "2018-07-04"}, {"excerpts": ["I got the Pad Thai, basil beef with spicy chili sauce (#33) jasmine rice and a Thai Tea! ", "The food is very flavorful! ", "The beef was the perfect amount of spiciness for me ", "and it was so unbelievably tender! ", "Other places that I've been to have very tough beef which makes it very unenjoyable to eat. ", "As for the Pad Thai, it had a nice kick to it, served with lime and we added chicken to it which made it that much more tasty."], "author": "Gabi D.", "review": "Was in San Francisco craving Thai food and decided to try this restaurant out. When I walked in, my party and I were greeted and sat down within a second! The people that work there are very friendly and welcoming. The ambiance of the place is so beautiful with art pieces all around. It seemed like a very authentic Thai restaurant. I loved how they had candles and flowers on every table.\n\nThe food here is very good and it came out so fast! I got the Pad Thai, basil beef with spicy chili sauce (#33) jasmine rice and a Thai Tea! The food is very flavorful! The beef was the perfect amount of spiciness for me and it was so unbelievably tender! Other places that I've been to have very tough beef which makes it very unenjoyable to eat. As for the Pad Thai, it had a nice kick to it, served with lime and we added chicken to it which made it that much more tasty.", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["I was with a party of 4 and we got Pad Thai, papaya salad, ", "Penang Sam Ros, and prawn fried rice. ", "The really cool thing about this restaurant is that there is essentially a secret menu. ", "Many of your favorite Thai dishes may not appear on the menu but if you talk to the waiter they will make them for you. ", "For example Pad See Ew is available but not on the menu."], "author": "Karim I.", "review": "Solid Thai restaurant in western SOMA. I've been looking for a good Thai spot near my house and think I may just have found the one. Manora's is a no thrills family run Thai restaurant with great prices and even better food. I was with a party of 4 and we got Pad Thai, papaya salad, Penang Sam Ros, and prawn fried rice. The really cool thing about this restaurant is that there is essentially a secret menu. Many of your favorite Thai dishes may not appear on the menu but if you talk to the waiter they will make them for you. For example Pad See Ew is available but not on the menu.", "rating": 4, "date": "2018-02-16"}, {"excerpts": ["My pad Thai was tasteless.  ", "No spice, no flavor.  ", "I eat a ton of Thai food ", "and I was pretty disappointed. ", "Sorry, I hate to give bad reviews"], "author": "Lisa M.", "review": "Hmmmm.   My pad Thai was tasteless.  No spice, no flavor.  I eat a ton of Thai food and I was pretty disappointed. Sorry, I hate to give bad reviews", "rating": 2, "date": "2018-03-06"}, {"excerpts": ["*Pad Thai -- with how good the first two dishes were, we were expecting a pretty good pad thai, but this is where there was a drastic drop in quality. ", "Reason being the excessive use of fish sauce. ", "It tasted funky because they used way too much. ", "My partner doesn't eat seafood, but loved pad thai. ", "This took away the dish for him ", "and I was left to finish all of it. ", "Which I didn't do because the portion is HUGE. "], "author": "Priti K.", "review": "I was walking during my commute home mid-week and had the sudden insatiable urge for Thai. After traveling through SEA for 6 months last year, I'm only now starting to crave the delicious savory and spicy flavors again. We landed at Manora Thai Cuisine after Yelping for a little bit. Yelp did us right. \n\nThe restaurant was pretty quiet for a Thursday evening. It's really peaceful inside and decorated nicely. \n\nThree dishes to share\n*Gang Gari Gai -- yellow chicken curry cooked in coconut milk with potato. It was served with a little portion of sweet cucumber salad. This dish was fantastic. The favor of the curry rich, but not overwhelming and chicken was so soft and tender.  The added potato carb also went really well in the dish. It was completely drenched in gravy. 5/5\n\n*Nur Pad Prik -- Sauteed beef with sweet basil in spicy chilli garlic sauce. Just as good if not better than the chicken dish. More savory, beautiful color and perfect with white rice. We went for medium spice, which was pretty mild for us. I would come back for these two dishes alone. 5/5\n\n*Pad Thai -- with how good the first two dishes were, we were expecting a pretty good pad thai, but this is where there was a drastic drop in quality. Reason being the excessive use of fish sauce. It tasted funky because they used way too much. My partner doesn't eat seafood, but loved pad thai. This took away the dish for him and I was left to finish all of it. Which I didn't do because the portion is HUGE. 2/5\n\nThe service is friendly. All the male servers wore tropical shirts, but it didn't quite go with the restaurant's ambiance. Of course that should not deter you. Great choice for Thai and we will probably get take out from here again. \n\nThe prices were reasonable too. $36 for all that plus two rice bowls. Sweet deal.", "rating": 4, "date": "2015-08-28"}, {"excerpts": ["Started with an appetizer of the  Pooket Express and main dishes of Moo-Gra-Tiam (pork) and Pad Thai noodles. ", "My wife and I enjoyed our meal...everything we had tasted good! ", "Service was not \"pampering\" but adequate. ", "Yes, an \"older\" restaurant...but has a feel like restaurants I've been to in Bangkok..."], "author": "Rich H.", "review": "I used to come here for lunch when I worked in the area...great lunch menu (esp the lunch combo plates). \n\nI happened to be in the area on a recent Saturday and decided to stop in for dinner. Arrived just as they opened for dinner, so found street parking around the corner (parking can be a challenge in this area). This is also an area that you need to aware of your surroundings (esp in the late afternoon & evening hours).\n\nStarted with an appetizer of the  Pooket Express and main dishes of Moo-Gra-Tiam (pork) and Pad Thai noodles. My wife and I enjoyed our meal...everything we had tasted good! Service was not \"pampering\" but adequate. Yes, an \"older\" restaurant...but has a feel like restaurants I've been to in Bangkok...", "rating": 4, "date": "2016-07-31"}, {"excerpts": ["Pad Thai all day!!!"], "author": "Tyler A.", "review": "They don't honor the 9.50 special for lunch :( \ngood food though!! Pad Thai all day!!!", "rating": 4, "date": "2017-04-13"}, {"excerpts": ["Mu favorites are the Tom Kha Soup, Pad Thai, and the Basil chicken or eggplant dish. \n", "The service is excellent as well ", "so they deserve all five stars."], "author": "Couture A.", "review": "I am pretty picky about my Thai food. In love that this place is always consistent and the quality is great. Mu favorites are the Tom Kha Soup, Pad Thai, and the Basil chicken or eggplant dish. \nThe service is excellent as well so they deserve all five stars.", "rating": 5, "date": "2016-02-12"}, {"excerpts": ["I ordered the chicken pad thai. ", "Definitely the most generic item you could order at a thai restaurant. ", "This pad Thai here was delicious! ", "There was a big amount of portion of noodles and meat on the dish. ", "I couldn't even finish my pad thai "], "author": "Kathleen U.", "review": "I came here on a Wednesday with my co workers. Apparently, this is the go to spot for thai in this neighborhood. I've heard good things about this place from numerous people at my department. I had high expectations and I was not disappointed. \n\nA group of us 6 ordered ahead for our lunch orders. The restaurant was able to accommodate our request. Our food straight out of the kitchen was set on the table when we arrived. Wow, I never went to a restaurant that would do that for you.\n\nI ordered the chicken pad thai. Definitely the most generic item you could order at a thai restaurant. This pad Thai here was delicious! There was a big amount of portion of noodles and meat on the dish. I couldn't even finish my pad thai so I had the rest of my meal put in a box.\n\nThe customer service was excellent. Not only they were able to accommodate us. One of the waiters even gave one of my co workers a heads up to order take out immediately because it'll take 20 minutes for the food to be ready. They knew we had to go back to the office which was nice. \n\nThis will probably be one of my favorite to go lunch place on the weekdays.", "rating": 5, "date": "2014-11-02"}, {"excerpts": ["We ordered a papaya salad, a beef dish (nur pad prik), pad thai, and mango sticky rice for dessert. \n\n", "Pad thai is a dish I've gotten many times from many different restaurants and Manora's ", "was great. "], "author": "Maya B.", "review": "Came here for dinner last night. Everything we had was delicious, fresh-tasting and flavorful. We ordered a papaya salad, a beef dish (nur pad prik), pad thai, and mango sticky rice for dessert. \n\nMy partner isn't always a fan of Thai cuisine because he doesn't like spicy (as in \"hot\") dishes. I've learned to love spice over the years, and so can handle the default heat at a place like Lers Ros; however, all of the dishes at Manora's came out mild by default (per other Yelp reviews, it appears you can up the levels on request), which made for a much more enjoyable experience for him. \n\nThe papaya salad was one of the best ones I've tasted if not the best. Bright, fresh, tart, clean flavors. The dressing was so tasty that when we were done with the salad, I used my spoon to scoop up what remained of the dressing and drank it. Also drizzled it on my rice (which, BTW, you need to order separately if you want rice; I don't think it comes with any of the dinner time dishes). \n\nThe nur pad prik was a dish I've never tried before but we both enjoyed it immensely. The beef was tender and cooked nicely; the sauce was flavorful but as with the papaya salad, mild by default in terms of heat (which in no way diminished how tasty it was). \n\nPad thai is a dish I've gotten many times from many different restaurants and Manora's was great. Possibly a little bit on the sweeter side but also tangy and eggy, and as with all of the other dishes we ordered, packed with flavor. \n\nWe concluded with an order of the mango sticky rice, one of my favorite desserts of all time. The sticky rice part was perfection: the rice was served piping hot, the coconut sauce and crunchy bits added textural and flavor contrasts; however, the mango itself was the one weak spot in our meal. It was fine, but considering that mangos are in season right now, not nearly as good as other mangos I've had recently (in fact, it was the second mango of the day for me as I'd had one for breakfast and that one was much better -- tarter and more intensely mango-flavored). \n\nMango complaint aside, we would absolutely go back to Manora's again and plan to do so soon. My partner, who as I mentioned earlier, isn't always the biggest fan of Thai cuisine, said he would go back to try their lunch special if he's in the area, and that's actually saying a lot because he doesn't generally eat Thai food unless he's with me. \n\nOne final note: they have a bar area, but had no cocktails listed on the menu. I ended up ordering a glass of wine but would have been curious to learn what cocktails they offer (and probably should have inquired, I guess!).", "rating": 5, "date": "2017-04-06"}, {"excerpts": ["I definitely recommend the chicken pad thai! ", "It's one of the best pad thais I have ever eaten lately. ", "Their fish with garlic sauce and asparagus in lobster sauce is good too."], "author": "W W.", "review": "Nice servers, parking was great on a weekday evening. I definitely recommend the chicken pad thai! It's one of the best pad thais I have ever eaten lately. Their fish with garlic sauce and asparagus in lobster sauce is good too.", "rating": 5, "date": "2017-02-15"}, {"excerpts": ["The pad thai was a hefty portion with the magical level of flavor and heft to the noodle that many places get wrong. \n\n"], "author": "Kevin L.", "review": "Manora's has become my gold standard for Thai in San Francisco!\n\nThe pad thai was a hefty portion with the magical level of flavor and heft to the noodle that many places get wrong. \n\nEggplant with garlic sauce was also well done, and not just an oily mess.\n\nDecor is old-school with decorative wood paneling.\n\nConveniently by a bunch of Folsom bars if you're looking for a post or pre-dinner drink.", "rating": 5, "date": "2015-08-06"}, {"excerpts": ["My friends got the Chicken Curry and Pad Thai as per recommendations on Yelp, and they enjoyed their dishes."], "author": "Anna M.", "review": "I can't claim to know what Authentic Thai Food is, but my guess would be that this is it!\n\nThe interior of this place is very homey with cultural trinkets around. I got the Yum-Ma-Keur appetizer as my main dish, but it was filling and delicious.\n\nMy friends got the Chicken Curry and Pad Thai as per recommendations on Yelp, and they enjoyed their dishes.", "rating": 5, "date": "2016-07-16"}, {"excerpts": ["The Pad Thai was great  and service was quick and friendly.\n\n"], "author": "Aletta B.", "review": "Manora's was recommended to my by a Thai, who lamented to me about how authentic the food is. Of course,  with such recommendations I had to try it! \n\nStopped in on a Wednesday night at 8:30Pm to meet a friend and see what this place was all about. We ordered a bottle of wine, spring rolls and two dishes to share...the food was delicious! The Pad Thai was great  and service was quick and friendly.\n\nThe only downfall about this place is the atmosphere, with such hype, I figured it would be pretty cool. However, upon arrival it was empty and the decor wqs rather outdated. Perhaps it was Thai style and I just didn't get it. \n\nOverall, good food but lacking in atmosphere!", "rating": 3, "date": "2016-03-27"}, {"excerpts": ["My friend ordered the Pad Thai and the ingredients were really fresh. ", "That's really key ", "and I usually avoid Pad Thai due to old bean sprouts at other restaurants. ", "I was pleasantly surprised to find out that the portions were quite large. ", "I highly recommend getting the Pad Thai! "], "author": "Tim G.", "review": "Manora's is a hidden gem tucked away in SOMA. I would never have stumbled upon it if it weren't for the Yelp app on my phone. \n\nGetting here was a real breeze and finding parking was even easier. It wasn't hard to find a 2 hour parking spot less than a block away from the restaurant on a weekday.\n\nThe lunch specials are indeed worth it! I ordered the Kow-Gang Panaeng and it was very filling. I ordered it medium spicy and it wasn't spicy enough so I had to add some extra chili powder. I like my food really hot. My friend ordered the Pad Thai and the ingredients were really fresh. That's really key and I usually avoid Pad Thai due to old bean sprouts at other restaurants. I was pleasantly surprised to find out that the portions were quite large. I highly recommend getting the Pad Thai! We also ordered Thai Iced Tea as well.\n\nWe will be back again and Manora's might turn into our regular lunch spot.", "rating": 4, "date": "2012-06-07"}, {"excerpts": ["I've tried the pad thai and pad kee ", "mao. ", "I've also had the chicken and fish ball noodle soup. ", "Recently, I also tried the duck served with rice and it was simply delicious. ", "The cuts where big and fatty. "], "author": "Jennifer W.", "review": "Come here for the lunch specials. You can choose a couple of dishes and have the house fried rice on the side. But the single best part of the lunch combo is the lemon chicken soup. Both the beef and chicken satay are okay, but a little dry. Even though the soup calls to me, I like the noodle dishes. I've tried the pad thai and pad kee mao. I've also had the chicken and fish ball noodle soup. Recently, I also tried the duck served with rice and it was simply delicious. The cuts where big and fatty. Plus, the thai iced tea hits the spot.", "rating": 4, "date": "2015-07-14"}, {"excerpts": ["Got a couple of dishes, including Tom Yum , Pad Prik (with Chicken), Eggplant with Garlic sauce, and Pad Thai. ", "Food was good not great. \n"], "author": "Ali H.", "review": "This is definitely a strong 3.5 - 4 star but not quite a 4. \n- Service was great\n- Food was good quality. Got a couple of dishes, including Tom Yum , Pad Prik (with Chicken), Eggplant with Garlic sauce, and Pad Thai. Food was good not great. \n- Wish they had a few more noodle dishes on the menu. \n\nIn all fairness, if I lived in the area I'd probably go all the time..but would likely not make a trip out of my way to here.", "rating": 3, "date": "2015-07-10"}, {"excerpts": ["For entrees we went with the chicken Pad Thai and the spicy green curry chicken dish. ", "Wow, we were both extremely pleased. ", "The spice is the real deal. "], "author": "Allison W.", "review": "Manora's was recommended to us by the owner of Rumor who said this was the most authentic Thai in the area (he should know- he's from Thailand!). This place did not disappoint. We started with the Larb and the Tom Yung Soup. Both amazing and delicious. For entrees we went with the chicken Pad Thai and the spicy green curry chicken dish. Wow, we were both extremely pleased. The spice is the real deal. And the Thai iced tea was yummy. Really pleasant service! We will definitely recommend to our friends who visit and will make a special trip back next time we return to San Fran!", "rating": 5, "date": "2016-06-01"}, {"excerpts": ["My Pad Thai was average - not exceptional in any way. ", "My date was looking for a standard curry selection, like 2 or 3, but there was only one listed on the menu and it was hard to find. ", "In fact, as I recall it was not described as a curry. ", "Nonetheless, they made a nice thai curry dish and my date was satisfied with it. ", "I was pleased with their response to her request so that willingness to respond positively to a request is a good attribute."], "author": "Scott C.", "review": "Great little place in reasonable walking distance to the Folsom area. Very nice atmosphere and courteous table service.  Food was average to a bit better than average. My Pad Thai was average - not exceptional in any way. My date was looking for a standard curry selection, like 2 or 3, but there was only one listed on the menu and it was hard to find. In fact, as I recall it was not described as a curry. Nonetheless, they made a nice thai curry dish and my date was satisfied with it. I was pleased with their response to her request so that willingness to respond positively to a request is a good attribute.", "rating": 4, "date": "2016-10-23"}, {"excerpts": ["Not the best pad thai I've had.\n\n"], "author": "Diana K.", "review": "I ordered takeout from here yesterday - it was quick and very mediocre. Not the best pad thai I've had.\n\nMaybe their lunch offerings are better. Restaurant itself was kind of quiet and the colors of the interior were dark and bleek. I don't know if I would stop in to eat.", "rating": 2, "date": "2015-02-24"}, {"excerpts": ["First, we went predictable and ordered the $8.95 Pad Thai, which was the standard mix of pan-fried rice noodles with shrimp, tofu, egg and bean sprouts (see photo). ", "Good enough but skimpy. ", "Then, we segued into the $8.95 Ped-Tod-Ka-Na-Grob, crispy, batter-fried slices of roast duck served with fried basil and a sweet chili garlic sauce (see photo). ", "Tasty stuff but not nearly enough. ", "Last was the $7.95 Kai-Yad-Sai, a seafood-stuffed omelet with crab, shrimp and some chicken as well (see photo). "], "author": "Ed U.", "review": "Oh yeah, I've been to Manora's. Why is it I forget it's here? I don't think I've been to Manora's since I've been Yelping, and that's a long time not to go to a neighborhood Thai place, don't you think? Nothing horrible happened to me. I honestly can't remember why I never returned. But in need of a Thai fix, Jamie W. and I decided to give it a go. Heavy on traditional Thai decor or at least the Cost Plus version of it, Manora's offers pretty decent food albeit in rather skimpy servings.\n\nWe tried three dishes, so let me give you an itemized checklist. First, we went predictable and ordered the $8.95 Pad Thai, which was the standard mix of pan-fried rice noodles with shrimp, tofu, egg and bean sprouts (see photo). Good enough but skimpy. Then, we segued into the $8.95 Ped-Tod-Ka-Na-Grob, crispy, batter-fried slices of roast duck served with fried basil and a sweet chili garlic sauce (see photo). Tasty stuff but not nearly enough. Last was the $7.95 Kai-Yad-Sai, a seafood-stuffed omelet with crab, shrimp and some chicken as well (see photo). This was the right size but it wasn't helped too much by the chile sauce.\n\nNow the rice they give you plenty of, for sure. Oh now, I remember why I haven't come back. We were still kinda hungry when we were done and weren't in the mood for fried banana balls, whatever those are. Service, I have to confess, was on the perfunctory side like automatic pilot with a flickering light. I just like the quality and quantity to be found at Basil Thai further up Folsom, even if they don't have the Bangkok-style ambiance. Now wait, what was the name of the place I was talking about?\n\nFOOD - 3 stars...pretty good Thai but they should give seconds\nAMBIANCE - 3 stars...heavy on the Bangkok vibe in here\nSERVICE - 2.5 stars...they buzz by with haste\nTOTAL - 3 stars...I think I'll come back if I can only remember the name", "rating": 3, "date": "2010-10-08"}, {"excerpts": ["pad thai:  ", "Of course we had to order pad thai to ultimately make our judgement of this thai restaurant.  ", "I am glad we did. ", "Pad thai was the best dish for us here. ", "every strand of noodle was very flavorful, and the noodles were cooked and stirred fried just right.  "], "author": "Tiffany H.", "review": "Our friend recommended this thai restaurant to us, so we decided to try it since we were in the neighborhood.  I was a bit skeptical but I saw all the Michelin recommended and Zagat signs on the door, then I told myself this place must be good!!! Although we weren't really hungry, we still ordered three dishes.\n\n1. papaya salad:  we have to order this to compare this thai restaurant to others we like in SF.  It was not as spicy as I had hoped, but overall pretty good... but nothing too exciting.. i guess it's hard to mess up papaya salad?\n\n2. tom yum talay: it's a soup dish, and i had requested them to add glass noodles to the soup.   It was good, but didn't blow my mind away. I've had better soup elsewhere. i have to say there were a lot of spices used for this soup... maybe a bit too much???  I was really thirsty after drinking the soup!  \n\n\n3. pad thai:  Of course we had to order pad thai to ultimately make our judgement of this thai restaurant.  I am glad we did. Pad thai was the best dish for us here. every strand of noodle was very flavorful, and the noodles were cooked and stirred fried just right.  I think they are very good at stir frying or pan frying at this restaurant.\n\n\nOverall, it was A-OK for a Michelin recommended restaurant.", "rating": 3, "date": "2013-03-06"}, {"excerpts": ["Pad Thai - a little dry\n \n", "The best part of the meal is always the soup. ", "If I had to choose my favorite food, this would be it. ", "It is excellent every time. ", "Everything in it is always so fresh, especially the seafood. ", "They must get their own special delivery. ", "Scallops are cooked to perfection, not tough at all, and the squid is just the same. ", "Perfectly tender in the soup. ", "Shrimp is superb as well. ", "Fresh ginger and lemongrass. ", "The mushrooms are delish. ", "Mmmmmm... ", "My mouth is watering just thinking about it. ", "You can get it spicy or mild. "], "author": "Haley D.", "review": "Best Thai food in the Bay, hands down!!!!\nIt's a tiny place, bursting with flavor. \nWe always order the same thing:\n\nTom Yum Talay - coconut seafood soup (mild). A MUST!\nGai-Kra Trao - mom's favorite, not mine\nPad Thai - a little dry\n \nThe best part of the meal is always the soup. If I had to choose my favorite food, this would be it. It is excellent every time. Everything in it is always so fresh, especially the seafood. They must get their own special delivery. Scallops are cooked to perfection, not tough at all, and the squid is just the same. Perfectly tender in the soup. Shrimp is superb as well. Fresh ginger and lemongrass. The mushrooms are delish. Mmmmmm... My mouth is watering just thinking about it. You can get it spicy or mild. I'm not a big spice person, but the mild is just perfect for me :)\n\nThis soup takes all that's good in the world and makes it edible. I cannot stress how amazing it is. This soup changed my life!", "rating": 5, "date": "2014-07-24"}, {"excerpts": ["Pad Thai was alright. ", "I always love me some chili powder that made it better. "], "author": "Angela L.", "review": "Saw that this place had relatively good reviews and it was walking distance, so I thought I would give it a try. \n\nMeal started off with the Tom-Ka soup which was pretty satisfying. Broth was coconuty and flavorful aaaand a good amount of spicy. It had a lot of goodies in there - mussels, squid, calamari, shrimp, and mushrooms.\n\nPad Thai was alright. I always love me some chili powder that made it better. Nothing to rave about, but also nothing to complain about.\n\nYellow curry chicken was extremely disappointing. Only had dark chicken meat (I'm more of a bones fan and white meat fan myself) and potatoes in there. Was not what I was hoping for at all. Didn't have any coconut flavor either.. which I'm pretty sure is a staple of thai restaurants!\n\nService was whatever. The servers there definitely don't look the happiest, but they get the job done. \n\nOne last thing - their menu is kinda hard to read if you're lazy like me.. or not a fob from Thailand. It took me forever to find a curry and didn't even realize there was a green curry which I had been craving (only found out when I heard the table next to us ordered it). They should reorganize their menu into type categories as opposed to meat categories. \n\nAll in all, I probably would not recommend this place unless you're starving for thai and everything else is closed for some odd reason.", "rating": 3, "date": "2013-01-07"}, {"excerpts": ["Pad Thai:\n", "This was just blah. "], "author": "David S.", "review": "This was unfortunately pretty bad. The staff was great and the place was lovely and clean, but the food was just not good:\n\nMint Spring Rolls:\nThese were alright, if a little boring.\n\nPad Thai:\nThis was just blah. It didn't have much flavor and even looked bland.\n\nDuck Curry:\nWhen you cook duck, you really need to render the fat under the skin. If you don't, it is rubbery and gross. The meat was also somewhat chewy. What could have been a fantastic dish was kinda gross.\n\nWhite rice:\nReally, I shouldn't need to even mention ordering this, but they put too much water in their rice and instead of nice, slightly firm grains, it was more of a mush.", "rating": 2, "date": "2014-08-20"}, {"excerpts": ["The pad Thai was really good at the restaurant, but meh for leftovers.  ", "The papaya salad needed much more heat, and garlic.  ", "The BBQ chicken was dry and over cooked, but had good flavor.  ", "As I looked around I saw a lot of soups or curries being ordered, maybe we just didn't get the memo!"], "author": "Pizzle D.", "review": "We showed up on a friday around 11:30 am and we were maybe the 5th table out of maybe 30 or so seated.  By noon every seat in the restaurant was filled. It being my first time I thought this to be a good thing.  The service was very on it, they seemed to all work well and efficiently together.  The plates were taken away promptly after finishing, we always had water/drinks refilled before going empty, etc. \n\nThe food was  probably 3.5 out of five stars for me.  I cant remember what the name of the salad we had but it was my favorite!  It had prawns, mint, lemongrass, glass noodles, lettuce, and a yummy sweet Thai dressing.  The pad Thai was really good at the restaurant, but meh for leftovers.  The papaya salad needed much more heat, and garlic.  The BBQ chicken was dry and over cooked, but had good flavor.  As I looked around I saw a lot of soups or curries being ordered, maybe we just didn't get the memo!", "rating": 4, "date": "2013-08-10"}, {"excerpts": ["We especially like the green curry and pad Thai. ", "It's noir greasy or heavy ", "the good has a lot of traditional Thai flavors. ", "It's good to dine in has a pleasant ambiance."], "author": "Priya S.", "review": "This is our go-to Thai take out near our place m. It's incredibly consistent, fresh and tasty. We especially like the green curry and pad Thai. It's noir greasy or heavy the good has a lot of traditional Thai flavors. It's good to dine in has a pleasant ambiance.", "rating": 4, "date": "2013-12-07"}, {"excerpts": ["so we each got one and ordered a Pad Thai to share, and that meal stuffed the four of us good.\n\n", "Everyone at the table were very happy with their meals and we ate the Pad Thai clean. ", "I would go back any other time I'm in Soma. ", "I did regret that I couldn't eat more!"], "author": "Alex K.", "review": "What a great place for lunch. Their lunch specials are around $9 and you get two items, rice, and soup, and it's very very good. I was with some heavy eaters so we each got one and ordered a Pad Thai to share, and that meal stuffed the four of us good.\n\nI had the Imperial Rolls and the Beef Curry and loved every bit of it. Everyone at the table were very happy with their meals and we ate the Pad Thai clean. I would go back any other time I'm in Soma. I did regret that I couldn't eat more!", "rating": 4, "date": "2012-03-22"}, {"excerpts": ["For our mains we had Basil Chicken, Pad Thai, a spicy Pork with Green Beans, and a meat assortment with Panang Curry.  ", "Everything was fresh and flavorful.  ", "The prices were very reasonable.  ", "I'm sure we'll be back."], "author": "Scott L.", "review": "We were craving Thai and chose Manora based on the reviews we saw here on Yelp.  We got some food to go and were not disappointed.  We got both Tom Kha and Tom Yum Soups and both were good, but the Tom Kha was a little sweeter than I like it.  Both had very good, fresh ingredients and everyone really enjoyed it.\n\nFor our mains we had Basil Chicken, Pad Thai, a spicy Pork with Green Beans, and a meat assortment with Panang Curry.  Everything was fresh and flavorful.  The prices were very reasonable.  I'm sure we'll be back.", "rating": 4, "date": "2011-05-14"}, {"excerpts": ["Nice to take a friend there for her first visit only to have her say \"the Pad Thai was delicious!", "\"  ", "I liked my lunch combo a lot: it's what I always get.!"], "author": "Richard A.", "review": "Nice to take a friend there for her first visit only to have her say \"the Pad Thai was delicious!\"  I liked my lunch combo a lot: it's what I always get.!", "rating": 4, "date": "2015-07-17"}, {"excerpts": ["The Pad Thai is also not to be missed. ", "Pad Thai is the go-to for many, and this restaurant must put magic in their sauce, it's just too good to be true. ", "The papaya salad is really lovely. ", "I normally order it mild. ", "I love the crunchy, sour, spicy refreshing salad. "], "author": "Michelle R.", "review": "Let me start my saying that I began coming here in my mother's womb! This has been a long time favorite restaurant of hers, and I guess it's genetic because I admit it's one I frequent also.\n\nEnvironment:\nWhen you first walk in there is a large tree that looms over the entry doors. Lovely paintings adorn the walls. A large wooden partition wall breaks up the open room nicely. There are always fresh cut, health flowers on vases on each table.\n\nService:\nThe service is always prompt and polite. All of the staff wear seemingly authentic colorful Thai clothing that certain adds to their charm.\n\nCuisine (The most important part!)\nDelicious! I've had almost every item on the menu, and I have no complaints. The highlights I'd recommend would be the coconut chicken soup. It's my absolute favorite. Moist chicken swimming in a tangy lemongrass coconut milk broth with white button mushrooms and cilantro floating on the surface. The Pad Thai is also not to be missed. Pad Thai is the go-to for many, and this restaurant must put magic in their sauce, it's just too good to be true. The papaya salad is really lovely. I normally order it mild. I love the crunchy, sour, spicy refreshing salad. The menu options are very affordable and you get quite a large portion for the price.\n\nOverall\nThis place is a gem that's been around much longer than I have been (referencing the first paragraph) and I'm glad to see it's still here and thriving. If you're looking for a good Thai spot in the city, this is a great option.", "rating": 5, "date": "2014-02-28"}, {"excerpts": ["Best damn Pad Thai ever. ", "Makes you want to rush to Thailand to hug the grandmother you never had (cuz ur white)."], "author": "Bib G.", "review": "Best damn Pad Thai ever. Makes you want to rush to Thailand to hug the grandmother you never had (cuz ur white).", "rating": 4, "date": "2015-06-06"}, {"excerpts": ["The pad thai is also a consistently well executed standard. ", "The ambience is nice casual and usually not too noisy. ", "There is a bar in front to wait and the staff is quietly helpful. ", "Portions are good size so you could easily split a main course for 2 people if you aren't starving.\n", "Good value and always a pleasant experience."], "author": "Armando H.", "review": "Manora Thai is a delicious predictable and authentic local Thai experience. Some of the waiters have been there for over 20 years. \nA standard delicious appetizer that many times is gone before 8:30 PM most nights are the mint rolls. Rice paper with fresh mint, veggies make for a refreshing start to the meal.\nMy favorite is the duck in curry. The pad thai is also a consistently well executed standard. The ambience is nice casual and usually not too noisy. There is a bar in front to wait and the staff is quietly helpful. Portions are good size so you could easily split a main course for 2 people if you aren't starving.\nGood value and always a pleasant experience.", "rating": 4, "date": "2012-08-19"}, {"excerpts": ["Some of the dishes I recommend: Tod-Mon, Som-Tom, Tom Yum Goong, Gang-Ped-Ped-Yang, Pra-Ram-Long-Song, Pong-Pang, & the classic Pad Thai. ", "You should try anything that looks delicious to you of course."], "author": "Pascal G.", "review": "Manora's Thai Cuisine is one of my fav's in SF! The food tastes authentic, the atmosphere is homey and relaxing, as well as parking isn't that bad in the neighborhood compared to other parts of the city. \n\nSome of the dishes I recommend: Tod-Mon, Som-Tom, Tom Yum Goong, Gang-Ped-Ped-Yang, Pra-Ram-Long-Song, Pong-Pang, & the classic Pad Thai. You should try anything that looks delicious to you of course.", "rating": 4, "date": "2013-12-12"}, {"excerpts": ["Got dishes which you typically can't go wrong with (pad thai and yellow curry).  \n\n"], "author": "Gohar J.", "review": "Simply put, not impressed.  My friend raved about this place so I finally had a chance to check it out for a Tues night dinner.  Got dishes which you typically can't go wrong with (pad thai and yellow curry).  \n\nThe yellow curry was a weird consistency, way to spicy, and topped with this stewed chicken.  The server was friendly about suggesting an alternative given we were not touching hte Yellow curry, and brought out a Prawn dish which was quite tasty.  \n\nGet THIS! In the end they had the nerve to charge us for the curry (which we literally had a bite of) AND the replacement dish.  RUDE.  \n\nIt was an awkward restaurant overall.  Strange man who was also I server I think was literally in the corner by the kitchen staring over at us the entire meal.  Definitely will not be returning here....have had my fair share of Thai in the city, and know there's countless better options out there!", "rating": 2, "date": "2012-05-01"}, {"excerpts": ["Coworkers enjoy the pad Thai but my favorite is the basil chicken with rice. ", "I don't like the garlic pork one. ", "It sounds better than it tastes."], "author": "Tina S.", "review": "3.5 stars. Good lunch specials if you know which ones are good. \n\nCoworkers enjoy the pad Thai but my favorite is the basil chicken with rice. I don't like the garlic pork one. It sounds better than it tastes.", "rating": 3, "date": "2012-12-02"}, {"excerpts": ["My friend and I had the pork spring rolls and Pad Thai ", "and I found no fault whatsoever - delicious! ", "We also had the combination plate with red curry sauce (order #45), and it was super tasty too, but somewhat hard to share. ", "Decor and ambiance were a little stuffy and \"un-modern", "\" (for lack of a better term), but the food was more than worth the visit!"], "author": "Lana C.", "review": "Food was delicious! My friend and I had the pork spring rolls and Pad Thai and I found no fault whatsoever - delicious! We also had the combination plate with red curry sauce (order #45), and it was super tasty too, but somewhat hard to share. Decor and ambiance were a little stuffy and \"un-modern\" (for lack of a better term), but the food was more than worth the visit!", "rating": 4, "date": "2016-03-16"}, {"excerpts": ["We also got pad thai on the side, and it was standard pad thai, but I would come back to this place if I was at UCSF Mission Center again."], "author": "Nikita K.", "review": "Great lunch special they have here! I came here with with a friend who works at  UCSFMission Center, and she said she comes here often. I got the lunch special with beef and prawns. Both were good and came with rice and coconut soup. The coconut soup had large pieces of white chicken meat, which was a little strange, but i liked the broth. We also got pad thai on the side, and it was standard pad thai, but I would come back to this place if I was at UCSF Mission Center again.", "rating": 3, "date": "2014-06-29"}, {"excerpts": ["I should try something super common like pad thai."], "author": "Rosie M.", "review": "I walked in with ordering from the lunch specials in mind. Then, I couldn't decide which dish I should have the yellow curry with to compliment the flavors. So, I opted for Khew-Tew Rad-Na with chicken and Thai Iced Tea. I was craving the chow fun type noodles anyway. I liked the fact that the gravy was a little thinner than usual Rad-Na. I guess because it was a rather hot day, and I did order gravy. I was pretty happy with the fact that the portion size was decent for the price. \n\nI will visit again, and update my post. Hopefully, it was just the dish that I ordered. I should try something super common like pad thai.", "rating": 3, "date": "2012-06-13"}, {"excerpts": ["We ordered tom yum goong, beef satay, pad thai, and som-tum. ", "My favorite was the pad thai, which I actually don't usually order if the restaurant has pad kee mao, but I still enjoy nonetheless. ", "The highlight of the pad thai here is definitely in the flavors - savory, a little sour, not too sweet, and some spice. ", "I'm not a fan of peanuts, which is unfortunate because I love Thai and Vietnamese food, but I deal with it. ", "However, the beef satay had too strong of a peanut flavor for me, and was a little dry as well. ", "That being said, if you like peanuts, that`s probably a great dish. ", "The papaya salad was on par with the pad thai in terms of quality, so not much to say there. ", "But tom yum goong is one of my favorite soups in the world because it incorporates all my favorite flavors: salty, spicy, and sour. ", "Sadly, it was a bit of a disappointment last night because it wasn't spicy at all, and too sweet for me. "], "author": "Elizabeth H.", "review": "Came here with some friends last night before going across the street to The Willows for drinks and board games. We ordered tom yum goong, beef satay, pad thai, and som-tum. My favorite was the pad thai, which I actually don't usually order if the restaurant has pad kee mao, but I still enjoy nonetheless. The highlight of the pad thai here is definitely in the flavors - savory, a little sour, not too sweet, and some spice. I'm not a fan of peanuts, which is unfortunate because I love Thai and Vietnamese food, but I deal with it. However, the beef satay had too strong of a peanut flavor for me, and was a little dry as well. That being said, if you like peanuts, that`s probably a great dish. The papaya salad was on par with the pad thai in terms of quality, so not much to say there. But tom yum goong is one of my favorite soups in the world because it incorporates all my favorite flavors: salty, spicy, and sour. Sadly, it was a bit of a disappointment last night because it wasn't spicy at all, and too sweet for me. The meats and vegetables in the soup, on the other hand, were great! \n\nReasonable prices, and great service. In fact, we left to go play games across the street at around 8PM. At around 10:45, we were getting ready to leave The Willows when I realized that my DSLR wasn't there, so I ran across the street to check if I had left it there. Despite already being closed for the day, they let me in, and handed me my camera back - having kept it in a safe place behind the cash register. So thankful!", "rating": 4, "date": "2014-03-16"}, {"excerpts": ["My friends and I ordered a bunch of dishes and shared them, including Tom Yum Talay (spicy seafood soup), Gang-Ped-Ped-Yang (roast duck curry), Pad Thai, Asparagus with Lobster Sauce, and Mango with Sticky Rice. ", "The Tom Yum Talay was dynamite--I just couldn't get enough of the flavors and spiciness. ", "The Gang-Ped-Ped-Yang was delicious--duck is my new favorite meat in curry (it's all about the fatty but fabulous skin). ", "The Pad Thai was pretty good ", "but I prefer the one at King of Thai Noodle House, which is more saucy. ", "The Asparagus with Lobster Sauce was all right--you'd think lobster would make everything superb ", "but you're wrong. "], "author": "Liz T.", "review": "Another week, another Thai restaurant. If you can't tell, I'm eating my way through all of them--15 bucks at a time. Manora's food is worthy of three stars, but the service is spectacular--and not just for an Asian restaurant. So four stars.\n\nMy friends and I ordered a bunch of dishes and shared them, including Tom Yum Talay (spicy seafood soup), Gang-Ped-Ped-Yang (roast duck curry), Pad Thai, Asparagus with Lobster Sauce, and Mango with Sticky Rice. It was a lot of food for three people, but we love to eat and have a little of everything. \n\nThe Tom Yum Talay was dynamite--I just couldn't get enough of the flavors and spiciness. The Gang-Ped-Ped-Yang was delicious--duck is my new favorite meat in curry (it's all about the fatty but fabulous skin). The Pad Thai was pretty good but I prefer the one at King of Thai Noodle House, which is more saucy. The Asparagus with Lobster Sauce was all right--you'd think lobster would make everything superb but you're wrong. The Mango and Sticky Rice was a good, sweet ending to our night.\n\nI'm pretty sure I went to sleep at 11PM (very early for me) because I couldn't stay awake after inhaling all that. Can't wait to try more Thai restaurants, though. Where shall I go next?", "rating": 4, "date": "2008-11-01"}, {"excerpts": ["The curries were fine, as was the pad thai.  ", "For whatever reason, the flavors tended to fall on the sweet side, whereas I expected savory with more spices."], "author": "Di Yin L.", "review": "The curries were fine, as was the pad thai.  For whatever reason, the flavors tended to fall on the sweet side, whereas I expected savory with more spices.", "rating": 2, "date": "2013-05-13"}, {"excerpts": ["The pad thai was eh. "], "author": "Vanessa F.", "review": "Food was good, but the service BLEW.\n\nWe made reservations for a party of 8 at 7:30 pm. Turns out a party of 8 came in a few minutes before us and the restaurant gave them our table leaving us to wait about 45 minutes to be seated.\n\nApologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\nThe meat dish I had of beef and green beans in chili sauce was good. We ordered extra extra spicy... as in \"as spicy as you can make it.\" It wasn't spicy at all. Boo.\n\nThe pad thai was eh. Again, ordered extra spicy but didn't get it.\n\nFor dessert we had the coconut ice cream with fried banana balls. It wasn't cheap and you didn't get very much ice cream or banana balls. They weren't \"balls\" either.\n\nProbably wouldn't go back unless we were meeting friends. There's places closer to home that are better.", "rating": 2, "date": "2009-01-18"}, {"excerpts": ["Great Pad Thai. ", "Cheap Prices"], "author": "Max Z.", "review": "Great Service. Great Pad Thai. Cheap Prices", "rating": 5, "date": "2013-02-15"}, {"excerpts": ["Also, the tofu in the pad thai had a funny/sour taste. ", "I am surprised at all the good reviews here. \n", "And yes, Basil thai down the street is better."], "author": "Shay L.", "review": "Would not recommend. Tom Kha soup was tasty but meat in soup was unappetizing. Had imperial rolls which were just ok, beef basil curry which was horrible - tough meat, very oily sauce. The thai fried rice did not taste good. Also, the tofu in the pad thai had a funny/sour taste. I am surprised at all the good reviews here. \nAnd yes, Basil thai down the street is better.", "rating": 2, "date": "2013-02-02"}, {"excerpts": ["I ordered a plate of pad thai and the duck rice plate for lunch as we shared throughout our meal. ", "The duck rice plate is quite reminiscent of the duck dish I always get from Sanamluang Cafe in Hollywood. ", "The skin is crispy and roasted and is sliced thinly over a bed of spinach and drizzled with soy. ", "It was the perfect lunch. ", "The pad thai tasted grand with the mix of shrimp and tofu, bean sprouts and peanuts. \n\n"], "author": "Mika D.", "review": "My first time here for lunch yesterday with ace. I was craving thai food and this hit the spot! \n\nI ordered a plate of pad thai and the duck rice plate for lunch as we shared throughout our meal. The duck rice plate is quite reminiscent of the duck dish I always get from Sanamluang Cafe in Hollywood. The skin is crispy and roasted and is sliced thinly over a bed of spinach and drizzled with soy. It was the perfect lunch. The pad thai tasted grand with the mix of shrimp and tofu, bean sprouts and peanuts. \n\nI'm coming back here again!", "rating": 5, "date": "2011-02-11"}, {"excerpts": ["I had the pad thai, which was OK. ", "They didn't pan sear the tofu, they sort of mixed it all in at the last second, and they made it so spicy ", "I "], "author": "Salernitana A.", "review": "I went here with a friend for dinner, and I actually thought that the place would be awesome since it's in the middle of a not-so-great district. I wanted it to be awesome, and my friend said it was awesome, but I disagree. Overall:\n\n1. The larb is crazy good. We wolfed it down in about three seconds, like how cartoons eat corn on the cob. The basil chicken was also fragrant and yummy.\n\n2. I had the pad thai, which was OK. They didn't pan sear the tofu, they sort of mixed it all in at the last second, and they made it so spicy I well, you don't need to hear that.\n\n3. Their menu says Diet Coke, but all they had was Diet Pepsi. Thai iced tea next time!\n\nOur waiter was very kind and knowledgeable about the menu, and I have definitely had worse Thai. But I've also had way better. Maybe I just ordered the wrong thing.", "rating": 3, "date": "2011-06-06"}, {"excerpts": ["I really like the pad thai here ", "and they had this crab omelet dish that was yummy too. ", "The other stuff we got here was good too, but nothing memorable.  ", "My hubby still likes Osha better.  ", "I can't decide. ", "We get Osha all the time and I love their food, but I think it's nice to have a new change.  ", "Will definitely be getting more of Manora's for take out when I get a craving for some Thai!"], "author": "Sharon T.", "review": "Our friend from Thailand recommended this place and of course, I was gonna trust her judgment!\n\nWe've only had take out from here (we normally get Osha Thai on 3rd or 2nd st).  The restaurant is cute, not fancy, and has all of that Thailand decor that we all expect to see and the service is great.  The food here is really good and satisfying.  I really like the pad thai here and they had this crab omelet dish that was yummy too. The other stuff we got here was good too, but nothing memorable.  My hubby still likes Osha better.  I can't decide. We get Osha all the time and I love their food, but I think it's nice to have a new change.  Will definitely be getting more of Manora's for take out when I get a craving for some Thai!", "rating": 4, "date": "2011-02-11"}, {"excerpts": ["Not only was it one of the best pad thai's that I tried (perfectly cooked noodles, bean sprouts on the side so it doesn't take up extra space, with the perfect sprinkling or peanuts). "], "author": "Lisa T.", "review": "This place definitely deserves all the hype it gets on yelp. Not only was it one of the best pad thai's that I tried (perfectly cooked noodles, bean sprouts on the side so it doesn't take up extra space, with the perfect sprinkling or peanuts). My boyfriend and our friend also tried the garlic quail which was followed by what they called a necessary moment of silence. The price was also extremely affordable! What a nice little gem in the midst of SOMA!", "rating": 4, "date": "2013-05-28"}, {"excerpts": ["and pad thai made with with silver noodles.  ", "the silver noodles took forever to come out ... i think at one point they told someone they didnt have it.  ", "but it came out later anyways."], "author": "claudia y.", "review": "10 of us strolled in here at around 9pm thursday night and they had no trouble accommodating us.  they actually have a full bar too with grey goose etc.  so we could continue getting our drink on.\n\ni ordered two things.  tom yum gong.  and pad thai made with with silver noodles.  the silver noodles took forever to come out ... i think at one point they told someone they didnt have it.  but it came out later anyways.", "rating": 3, "date": "2009-11-16"}, {"excerpts": ["As for the food, the panang curry with beef was delicious, and the pad thai was a bit greasy. ", "Overall, decent thai food, and relatively inexpensive."], "author": "Laurent L.", "review": "The service was ok, though as somebody else mentioned, the servers didn't look too happy. Maybe it's because they have to wear these hideous multicolor shirts... Had dinner there --- it's well priced, and the ambiance is pretty nice. As for the food, the panang curry with beef was delicious, and the pad thai was a bit greasy. Overall, decent thai food, and relatively inexpensive.", "rating": 3, "date": "2013-02-10"}, {"excerpts": ["Now, Pad Thai and I got off on the wrong foot a long time ago, and I've rarely ordered it since, but I took another crack at it based on the Yelp-omendations.  ", "I can easily say it's the best Pad Thai I've ever had, so consider me back in the habit.  ", "Their lunch combo plates are a great deal too, and come with some lemon-chicken soup that you absolutely must try.  ", "All in all, quite the beacon in the wasteland, and you can even follow up your meal with a bite from the chocolate factory next door."], "author": "Wes M.", "review": "There are plenty of diamonds in the SOMA rough, to be sure, but they tend to be uber-divey or inconveniently wholesale-centric or some such.  So to see a large, gaudy, almost suburban Thai restaurant just chillin' at 12th & Folsom was a surprise.  You sure don't get a lot of casual passersby here, so there must be something that keeps them in business, right?\n\nAnd sure enough, Manora's food launches it into the rarefied realm of top-tier SF Thai, along with a few others like Ploy II (and to think there was a time when I doubted the existence of any good Thai in the city).  Now, Pad Thai and I got off on the wrong foot a long time ago, and I've rarely ordered it since, but I took another crack at it based on the Yelp-omendations.  I can easily say it's the best Pad Thai I've ever had, so consider me back in the habit.  Their lunch combo plates are a great deal too, and come with some lemon-chicken soup that you absolutely must try.  All in all, quite the beacon in the wasteland, and you can even follow up your meal with a bite from the chocolate factory next door.", "rating": 5, "date": "2009-08-13"}, {"excerpts": ["As usual, I recommend getting the Gang-Gari-Gai (yellow chicken curry cooked in coconut milk and potato cubes) and Pad Thai (they even give you shrimp at no additional charge). ", "The chicken comes in several larger pieces than usual, but you can easily pull pieces off ", "(it's obvious they slow-cooked it for hours). ", "What a great dish! ", "The Pad Thai is plentiful, though it could be a bit more flavorful.\n\n"], "author": "John C.", "review": "If you're debating whether to hit up Koh Samui and the Monkey or Manora's for Thai tonight, I highly recommend choosing the latter!\n\nWhile both do charge for rice (one of my only criticisms of Manora's), Koh Samui charges $2.50 for a single bowl vs. $1.50 at Manora's. And the pricing between the two places pretty much follows suit.\n\nSure, both places have delicious Thai cuisine, but do you really want to pay about 50% more at Koh Samui? I didn't think so.\n\nAs usual, I recommend getting the Gang-Gari-Gai (yellow chicken curry cooked in coconut milk and potato cubes) and Pad Thai (they even give you shrimp at no additional charge). The chicken comes in several larger pieces than usual, but you can easily pull pieces off (it's obvious they slow-cooked it for hours). What a great dish! The Pad Thai is plentiful, though it could be a bit more flavorful.\n\nI was a bit disappointed that they didn't have mango sticky rice on this occasion, but I'm sure they had a good reason. Please have it next time!\n\nThe servers are very friendly and treat you well. You'll enjoy Manora's a lot more than walking out of Koh Samui with an empty wallet.", "rating": 4, "date": "2010-09-23"}, {"excerpts": ["However, their vegetarian Pad Thai was outstanding! ", "The best I think I've ever had and the left-overs tasted just as great later. ", "Definitely reccommend it!"], "author": "Bree G.", "review": "This was my first time here and I honestly didnt think it was going to be great based on my \"judge a book by its cover\" skill. However, their vegetarian Pad Thai was outstanding! The best I think I've ever had and the left-overs tasted just as great later. Definitely reccommend it!", "rating": 4, "date": "2010-01-20"}, {"excerpts": ["For better vegan options, we'll be sticking to Pad Thai on the other side of the Mission."], "author": "Laura M.", "review": "Went there last night based on the great reviews on Yelp and some suggestions in the reviews that they were happy to accommodate vegetarians and vegans.  As it turns out, they put chicken broth, shrimp paste, or fish sauce in pretty much everything.  To his credit, the waiter was very nice and helped us figure out a couple of dishes -- pra ram tofu (tofu in peanut sauce with spinach) and pad prik khing (spicy wide rice noodle with vegetables).  I was really hoping to have a curry, but none of their curry pastes are vegan, or even vegetarian.  The two dishes we got were average.  For better vegan options, we'll be sticking to Pad Thai on the other side of the Mission.", "rating": 3, "date": "2011-10-04"}, {"excerpts": ["the pad thai had a very good consistency to the noodles. ", "if i were in the neighborhood more i might frequent it but due to it's location ", "it's not that desirable. ", "maybe that's why it doesn't get the hype", "..there's not a ton to do out there during sunny hours."], "author": "Regina C.", "review": "i wonder why this place doesn't have more hype around it. the food is really good! coconut soup was super tasty with tender pieces of chicken unlike the dry/overcooked pieces you typically find in thai restaurants. the pad thai had a very good consistency to the noodles. if i were in the neighborhood more i might frequent it but due to it's location it's not that desirable. maybe that's why it doesn't get the hype..there's not a ton to do out there during sunny hours.", "rating": 4, "date": "2013-06-11"}, {"excerpts": ["Shared the green curry with chicken and pad thai.  ", "Both were yummy with flaws.  ", "The curry was more watery and tasted watered down, the pad thai's tofu was soft tofu and not the normal fried kind (strange).  \n\n"], "author": "Skye W.", "review": "Went out for dinner within walking distance of bf's new place.  I love thai food and decided Manora's would be a decent choice.  Walked in and was promptly seated- ok there were a ton of tables open, but still... The restaurant is cute and nicely decorated.  The bathroom (well the women's) is teeny tiny and cramped.  The food is well priced when compared to similar thai places in the area.  Shared the green curry with chicken and pad thai.  Both were yummy with flaws.  The curry was more watery and tasted watered down, the pad thai's tofu was soft tofu and not the normal fried kind (strange).  \n\nAll in all decent food, decent price, decent portions...", "rating": 3, "date": "2009-12-02"}, {"excerpts": ["The pad thai, the chocolate chip cookie of baking if you will, hopefully represents all of Manora's entrees: abundant, high-quality, and most importantly - scrumdidilyumptious! \n\n"], "author": "Jane L.", "review": "Frank. Dark-horse! Generous.\n\nManora's is a foodies gem on this malnourished block in SOMA!  \n\nThe place get packed during lunch, but if you're solo, bar seating is always ample, and if you call ahead, they'll have a table waiting for you or ready in no more than 10 minutes.\n\nThe chicken noodle soup is NEVER-ENDING.  After an hour of slurping and sipping, I looked down to see that my bowl was still nearly full...and so was I!  And at 7 bucks, what a steal!\n\nThe pad thai, the chocolate chip cookie of baking if you will, hopefully represents all of Manora's entrees: abundant, high-quality, and most importantly - scrumdidilyumptious! \n\nDon't let the grungy neon sign (that I've never seen on) fool you!  This place is Michelin Star nominated, pleases your soul, and takes it easy on your wallet!\n\nKnow Before You Go:\n1. want soup to go?!  They'll separate the broth and noodles for you!\n2. lunch rush?  call in and they'll have your order ready upon arrival!", "rating": 4, "date": "2009-02-19"}, {"excerpts": ["I enjoyed the green curry and Pad Thai (even though they refused to serve it with tofu)."], "author": "Christine M.", "review": "Vegetarian UN-Friendly\n\nThe people who work here are not nice.  They seem genuinely unhappy with what they are doing and more than slightly put out by someone who orders vegetarian.  Upon asking for tofu instead of chicken in a dish, our server actually turned and walked away, apparently annoyed, then came back to finish our order.  Though food arrives quickly, I actually felt shamed by the waiter.  Wow.\n\nIf rude service doesn't bother you (and keep in mind I only had one server out of what is undoubtedly many), then you're in for a treat, because the food is quite good.  I enjoyed the green curry and Pad Thai (even though they refused to serve it with tofu).", "rating": 3, "date": "2007-05-09"}, {"excerpts": ["And I ordered Pad Thai- you have to try the Pad Thai when you come in to a Thai restaurant. ", "The Pad Thai was ok. ", "The price was decent and the portion was ok. ", "The service is excellent. ", "I would recommend the soup in this restaurant."], "author": "Bibi B.", "review": "We came in for dinner hoping to order the hoi tod- a traditional Thai omelet with mussel only to be disappointed by finding out that they don't make hoi tod anymore. The restaurant has a romantic ambience with a candle and flowers on each of the table. We ordered Tom Yam Kung which I found quite delicious and as a matter of fact, it might be one of the best soup in town. It was flavorful- with the right amount of sweet, sour,spicy- . We also ordered the duck curry which I could careless for. The duck had to much fat, but the curry flavor was good. And I ordered Pad Thai- you have to try the Pad Thai when you come in to a Thai restaurant. The Pad Thai was ok. The price was decent and the portion was ok. The service is excellent. I would recommend the soup in this restaurant.", "rating": 4, "date": "2014-07-04"}, {"excerpts": ["Aside from the combo plates, I recommend the Pad Thai noodle also.  ", "I think the best deal is still the lunch combo at $8.95 including soup and fried rice.  ", "I always come before noon to avoid the crowd.  ", "The restaurant draws a lot of regular clients from nearby businesses.  ", "Street parking is usually available if you arrive before noon.  ", "Otherwise, there is a paid garage 1/2 block around the corner.  ", "This is a clean/nice casual restaurant with attentive staff and prompt service."], "author": "Jean T.", "review": "When ever I am in the South of Market, I make it a point to come here to satisfy my Thai craving.  My review is limited to lunch service only as I have not been here for supper.  Depending on my mood, the two-item lunch combo is always my go-to meal.  There are about ten options to choose from.  It is served with the best/tastiest bowl of lemon chicken soup (Gai Tom Ka), which includes sizable chunks of chicken.  The restaurant tailors to vegetarians as well.  The portions are more than satisfying.  My favorites are yellow curry chicken, garlic pork, and spicy beef.  Aside from the combo plates, I recommend the Pad Thai noodle also.  I think the best deal is still the lunch combo at $8.95 including soup and fried rice.  I always come before noon to avoid the crowd.  The restaurant draws a lot of regular clients from nearby businesses.  Street parking is usually available if you arrive before noon.  Otherwise, there is a paid garage 1/2 block around the corner.  This is a clean/nice casual restaurant with attentive staff and prompt service.", "rating": 4, "date": "2013-09-14"}, {"excerpts": ["I've really liked, except for the pad thai which was just OK."], "author": "Mister X.", "review": "5 - 16 - 28 - 41 - 43 - 44\n\nThe combination that will unlock your taste buds to a whole...*slap*\n\nWTF am I writing? Sorry about that. Let me try again:\n\nI've only been here for dinner. On weeknights and Sundays the parking is not that bad, usually within a block. On Fridays and Saturdays you'll compete with the club goers down the street (way down the street).\n\n5: Pooket Express. You must love fish sauce because this appetizer, served in a shell, has tons of it.\n16: Tom Yum Goong. Spicy, Lemongrassy soup. Delicious. Good for about four people as an appetizer.\n28: Gang Gari Guy. Chicken in Yellow Curry. Everyone loves this dish, comes with potatoes that soaked up the flavor. If I could only have one dish, this would be it. Or maybe 44.\n41: MaKeur-Paad-Prik. Yummy sauted Japanese eggplant with prawn, chicken and pork.\n43: Sahai-Pad-King. Sweet combination of shrimp, pork and chicken. It reminds me a little of sweet and sour Chinese dishes.\n44: Asparagus with Lobster Sauce. When asparagus is out of season they will substitute it with another vegetable. Right now it's sweet peas. Amazing.\n\nEverything I've tried here I've really liked, except for the pad thai which was just OK.", "rating": 5, "date": "2006-09-24"}, {"excerpts": ["Friends have raved over the BBQ chicken, the Pad Thai, and everyone raves about the soup! ", "What can I say. ", "I have actually sent my husband on a trek for just soup to take out when I have been sick and needing some major comfort food. "], "author": "TiMarie S.", "review": "Well, as a number of folks have pointed out, it is time to lose my \"review\" virginity, so what better place to start than one of my all time favorite restaurants. \n\npro's: A superb, filling meal at an inexpensive price, and great variety.\n\ncon's: Parking can be really tough there and the service, whilst very prompt, is not terribly friendly. Even having been there for years, it often feels like they want you in and out rapidly! The prawns and egg rolls are very very greasy, but there are at least 10 other excellent choices for the combo plate that will thrill you!\n\nThe first time Manora's was recommended to me, I wondered why the hell I wanted to cross town at lunch time for Jewish food. After a brief moment of complete embarrassment, and much laughter by my pals, the distinction was pointed out and off we went.\n\nI think that Manora's is the absolute best lunch place in San Francisco. It started me on my quest for and discovery of Thai food. \n\nThey have a fantastic lunch option where you can choose any 2 of about 12 items for your lunch which also include  Thai Rice (absolutely the best Spanish rice I have ever tasted including a good sized hunk of chicken hidden in the middle)! The meal starts off with the best Tom Kha Gai soup I have ever had. This is basically a Thai chicken soup chock full of chicken, straw mushrooms, bamboo shoots, lemon grass, cilantro, chili oil, chicken broth and coconut milk. It is the most wonderful balance of sweet, savory and spicy I have ever had! \n\nNext your meal is served with your two choices, (I recommend the red beef curry, served in a small bowl on the plate, just hot enough that you have to eat it with a spoonful of rice in order to keep the temperature manageable to me). It amazing how much food  is held in that bowl and I still have one more entree in another bowl on my plate!\nMy second choice sometimes changes but primarily I go for the peppery fried pork which I dip in a sweet and hot sauce served on the side. Their satay is fantastic and their chicken in really tiny bits with fresh basil is also one of my favorites. \n\nFriends have raved over the BBQ chicken, the Pad Thai, and everyone raves about the soup! What can I say. I have actually sent my husband on a trek for just soup to take out when I have been sick and needing some major comfort food. I have trained classes and used the Manora as a catering service and even their take out for 40 people held up fantastically!\n\nFor those who are not interested in the combo plate, there is a page of noodle, chicken and seafood dishes as I recall but why go for one entree when you can  taste a couple of items? \n\nLunch price was about 8.50 and Thai Ice Tea an extra 1.50 on top of that. I've never been able to fit dessert so I have no idea even what is offered. Since I always leave there stuffed I feel the value of the meal  is a heck of a bargain!\n\nI have been to many many Thai restaurants all over the state and up in Canada and still this is my favorite place where I celebrate all my birthdays and any anniversary of note!", "rating": 5, "date": "2006-05-20"}, {"excerpts": ["Manora is a Thai place with a menu so interesting and prices so right that you lose the urge of ordering Pad Thai. \n\n"], "author": "Faffy L.", "review": "Manora is a Thai place with a menu so interesting and prices so right that you lose the urge of ordering Pad Thai. \n\nWent with 3 other people on a Thursday night, although the place was comfortably packed, we were quickly seated by the window. We ordered a pancake with mussels, lobster with snow peas (normally asparagus), quail, plus one other dish. Everything was fresh and we all just scarfed it down. \n\nThe service is quick and the atmosphere is homey. No pretentious decor, just solid good food.", "rating": 4, "date": "2006-10-07"}, {"excerpts": ["we got the pad thai, some kind of curry and other stuff. ", "SO GOOD!!", "! ", "too bad there's no good thai place like manora down here...=", "("], "author": "Priscilla P.", "review": "OMG\nso GOOD\nand the prices are pretty good\nwe got the pad thai, some kind of curry and other stuff. SO GOOD!!! too bad there's no good thai place like manora down here...=(", "rating": 5, "date": "2009-07-09"}, {"excerpts": ["All the basic staple Thai dishes are solid choices - pad thai, spring rolls, etc. "], "author": "Marie L.", "review": "I'm a HUGE fan of Thai cuisine, and Manora's is a little gem located in SOMA. I wouldn't have ever discovered this place if it weren't for my friend taking me here. It's a great local Thai place to dine in or get takeout. The fresh fried fish is really good. All the basic staple Thai dishes are solid choices - pad thai, spring rolls, etc. The BBQ pork or chicken is also very flavorful. \n\nService is friendly and very quick. This place also has a full bar in case you want a cocktail to sip on with dinner!", "rating": 4, "date": "2009-10-11"}, {"excerpts": ["I am a huge fan of their Pad Thai... not greasy at all. "], "author": "Amelia M.", "review": "One of the better Thai Restaurants I have been to in SF. \n\nI have yet to have a bad meal here. It is best when you go in a larger group (just beware of the long wait here if you go at dinner time) so you can try a lot of dishes. I am a huge fan of their Pad Thai... not greasy at all. Something that I tend to find at other Thai establishments.\n\nDishes to try:\n\nKow-Graprao (Minced Chicken)\nKow Pla Muk Pad-Ped (Sauteed Calamari)\nPad-Thai (Noodles)\nPad-See Ew (Pan fried flat noodle)\nFresh Mint Roll (fresh roll with Shrimp)\nBeef Shish-Ka-Bob  \nMoo-Gra-Teiam  (Pork)\nPla-Muk-Pad-Ped (Calamari)\n\nDrinks: \nGreat drinks from the full bar (Cosmos are good here)\nHot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\nFried Banana Balls with Ice Cream \n\nThe staff is very nice and friendly. Just make sure to have your entire party there. It takes time to get seated. Parking is not too bad as long as it is not too late and people are heading out to the clubs, which will make parking a bit harder in the area.", "rating": 4, "date": "2008-03-19"}, {"excerpts": ["I've had worse\nOrdered pad thai pickup, by bicycle\nAttractive, thin (but still curvy) hostess with a nice smile, dressed in traditional garb was friendly and spoke english\n", "I'd go back just for that"], "author": "G K.", "review": "I've had worse\nOrdered pad thai pickup, by bicycle\nAttractive, thin (but still curvy) hostess with a nice smile, dressed in traditional garb was friendly and spoke english\nI'd go back just for that", "rating": 4, "date": "2007-12-11"}, {"excerpts": ["Their soups are delicious, and so is the pad thai.  "], "author": "Jenny L.", "review": "This used to be my neighborhood go to spot for Thai food, before I moved away.  Everything is authentic (at least it feels that way), and they have a lot of variety and specials for you to choose from.\n\nTheir soups are delicious, and so is the pad thai.  And their meat entrees.\n\nBest of all, their prices are really reasonable, and the portions are large enough that you can have a meal the next day and still be satisfied.", "rating": 4, "date": "2008-12-12"}, {"excerpts": ["I don't know why people rave about the Pad Thai.  ", "It was a little bland for me, but maybe it was an off night for the chef?  ", "If I get to go back a next time "], "author": "Kat L.", "review": "This place was close to where I was staying and it sounded good so my sister & I drove over one night.  They have a wide array of items to choose from.  There are new items with a fusion/upscale touch and some traditional items.\n\nFor full pics and review go to http://www.kats9lives.com/2008/04/pirates-treasure.html\n\nI think the appetizers were the best part of the meal.  The main courses we chose were only so-so.  We had to try the Pirate Treasure that everyone on yelp raved about and it was very very tasty.  The mix of flavors work wonderfully.  We kept the remaining sauces at the table to mix in with the rest of the food! ^_^ \n\nThe second appetizer we chose was the Katong Ton.  It's fried crispy cups stuffed with mixed curry inside.  This was not bad, but it's no Pirate Treasure.  If I come back a next time I would definitely try more appetizers and maybe skip the main course, then end with a dessert.\n\nI don't know why people rave about the Pad Thai.  It was a little bland for me, but maybe it was an off night for the chef?  If I get to go back a next time maybe I will try some of their other noodle dishes.\n\nThe Mango and Sticky Rice was great.  I didn't really care for the mango, but the sticky rice was done to perfection.  I really enjoyed the sweetness and flavor.  Yum Yum!", "rating": 4, "date": "2008-08-08"}, {"excerpts": ["The Pad Thai is not dry (which is a very common problem at a lot of Thai places). ", "The Gang-Ped-Ped-Yang (duck in the curry) was absolute fantastic, as was the Gang-Gari-Gai (yellow chicken curry). ", "Their curry has lots of flavor which I greatly enjoyed. ", "The decor is nice and the staff was attentive even though the place was packed. ", "They definitely made a huge fan out of me!"], "author": "Kitty K.", "review": "Absolute LOVE LOVE LOVE this place! I can't wait for a chance to come back into the city to eat at this place again. The Thai Ice tea is so yummie. The Pad Thai is not dry (which is a very common problem at a lot of Thai places). The Gang-Ped-Ped-Yang (duck in the curry) was absolute fantastic, as was the Gang-Gari-Gai (yellow chicken curry). Their curry has lots of flavor which I greatly enjoyed. The decor is nice and the staff was attentive even though the place was packed. They definitely made a huge fan out of me!", "rating": 5, "date": "2010-05-10"}, {"excerpts": ["For dinner we ordered Pad Thai, MaKeur-Paad-Prik (Japanese eggplant with prawn, chicken, and pork in a spicy basil garlic sauce), and Goong Ping (charbroiled jumbo prawns served with a spicy lemon garlic sauce).   ", "All three dishes were delicious.  ", "I especially loved the eggplant dish.  ", "The sauce wasn't too heavy and was just spicy enough to give it a kick.  ", "The prawns in the Goong Ping were charbroiled on skewers and the skewers were stuck into an orange so that the shrimp were radiating out of it.  ", "Nice preparation.  ", "The pad thai was one of the better pad thais I've had in the city.  ", "We all had leftovers which is always an added bonus.  ", "I think that sometimes Thai food tastes better the next day after the spices and sauces have been soaked into the meat and veggies.  ", "I look forward to coming back and trying more of the menu!"], "author": "Zoe H.", "review": "I have wanted to try Manora for a long time.  Finally, on Sunday, after a long day of couch shopping in SOMA and a craving for Thai, we stopped in Manora.  It was 5:00 and we arrived just as they turned out their lights to start seating for dinner.  The restaurant was initially freezing, probably because they had just opened.  We immediately ordered tea and some hot appetizers to warm up.  They brought out our two appetizers within minutes and they were delicious.  We had the Pirate's Treasure which was a spicy mix of shrimp, chicken, and bean thread sheets and the Vegetarian Delight which was fried tofu and taro.  Both were excellent.  The taro was lightly fried and melted in your mouth.  When we finished our appetizers, the restaurant had warmed up and had almost completely filled up.\n\nFor dinner we ordered Pad Thai, MaKeur-Paad-Prik (Japanese eggplant with prawn, chicken, and pork in a spicy basil garlic sauce), and Goong Ping (charbroiled jumbo prawns served with a spicy lemon garlic sauce).   All three dishes were delicious.  I especially loved the eggplant dish.  The sauce wasn't too heavy and was just spicy enough to give it a kick.  The prawns in the Goong Ping were charbroiled on skewers and the skewers were stuck into an orange so that the shrimp were radiating out of it.  Nice preparation.  The pad thai was one of the better pad thais I've had in the city.  We all had leftovers which is always an added bonus.  I think that sometimes Thai food tastes better the next day after the spices and sauces have been soaked into the meat and veggies.  I look forward to coming back and trying more of the menu!", "rating": 5, "date": "2008-01-24"}, {"excerpts": ["Then we moved onto the Pad Thai, the Spicy green curry with  beef, mixed with slices of eggplant, and then the combination Seafood Fried Rice.  \n\n"], "author": "Regi K.", "review": "I took my friend for her birthday here for lunch last week. .    I had eaten at Manora years ago, but just haven't been back.  Well the food was delicious and I aim to come back!\n\nWe started with a spicy lemon sweet basil seafood soup.  Then we moved onto the Pad Thai, the Spicy green curry with  beef, mixed with slices of eggplant, and then the combination Seafood Fried Rice.  \n\nI had never had thai fried rice before.   Didn't feel the need especially with the yummy curry over the jasmine rice.  But the fried rice was very good.  The seafood was super fresh.  The fried rice is a little more wet than the Chinese version and filled with all the thai spices.  So very good.   \n\nLunch was excellent.  My friend and I got so comfortable we didn't want to leave!!!!", "rating": 4, "date": "2008-09-03"}, {"excerpts": ["Great pad thai, curries and seafood platters. ", "I have been coming here for more than 20 years and it's always good. ", "The only place I've had better pad thai was Thailand itself. \n\n"], "author": "H M.", "review": "Best Thai food outside of Thailand! Great pad thai, curries and seafood platters. I have been coming here for more than 20 years and it's always good. The only place I've had better pad thai was Thailand itself. \n\nI had lunch here once and it wasn't stellar but dinner is always great.", "rating": 5, "date": "2010-06-01"}, {"excerpts": ["I had a thai iced coffee and veg pad thai, both were delicious. ", "The pad thai had a good flavor, thin delicate noodles and nice amounts of egg and tofu. ", "It'd be cool if they listed more veg options rather than having to ask for them."], "author": "Cori W.", "review": "Nice place for lunch, cheaper than Basil Canteen but not as ~fancy~. The interior is very thai and cozy. I had a thai iced coffee and veg pad thai, both were delicious. The pad thai had a good flavor, thin delicate noodles and nice amounts of egg and tofu. It'd be cool if they listed more veg options rather than having to ask for them.", "rating": 4, "date": "2010-02-12"}, {"excerpts": ["Possibly my favorite thai spot in SF, and that's saying a lot since they're not even my favorite pad thai in SF.  ", "Everything I've eaten here has been great."], "author": "D D.", "review": "Possibly my favorite thai spot in SF, and that's saying a lot since they're not even my favorite pad thai in SF.  Everything I've eaten here has been great.", "rating": 4, "date": "2011-09-12"}, {"excerpts": ["The Pad Thai is perfect, (most places screw it up)  ", "There's a string bean and beef dish...  "], "author": "L. K.", "review": "Why I give this place 5 stars is because this is the best Thai place in San Francisco, and as everyone knows, San Francisco has more Thai restaurants per square foot than it has Starbucks.  Seriously.  To compare, once I was in Connecticut, and drove an hour and a half to get to a Thai restaurant.   It takes 3 hours to drive through the entire state.  The white people I was with had never had Thai.... but that's another story entirely...  \n\nThankfully, San Francisco is only 6 miles in radius, so Manora is really pain-less to get to, even for people in the Peninsula.  The location is near all sorts of freeways and parking is easy.  Rainbow grocery is right across the way.  Rainbow sells no meat, so Manora is a good stop off for non-vegetarians, especially during lunch!  Dinner would be better though, because unless you're a complete lush, the Mai-tai's aren't to be missed.  They're cheap as well.   \n\nThey make the BEST yellow curry chicken with potatoes and onions I've ever had.  I judge all Thai restaurants on this dish, and none live up to Manora's curry.  The chicken is stew like and the spices are cooked perfectly.  The chef special of eggplant, chicken, shrimp, pork and basil in an oyster type sauce is delish, even if you don't like eggplant.  The Pad Thai is perfect, (most places screw it up)  There's a string bean and beef dish...  You get the point.  \n\nHave dinner, followed by many many cocktails, and walk down the street towards downtown, and go into the little clubs littering both sides of the street... if you're into that sort of thing.  I myself prefer Mai-tai's, dinner, more Mai-tai's and the other direction towards the Mission/Potrero, but that's what's so great about Manora.  It really is the center of whatever direction you please.", "rating": 5, "date": "2009-11-08"}, {"excerpts": ["Love there pad Thai... very good food and friendly service."], "author": "Dalia C.", "review": "Love there pad Thai... very good food and friendly service.", "rating": 5, "date": "2011-03-22"}, {"excerpts": ["Pad Thai - Easy peasy right? ", "Yes! ", "and they get it ", "right....", "See...there are a lot of Thai restaurant's that can't seem to get this right. ", "(See my review about Keoni's by Keo) ", "I judge restaurants by the basics and their extras. ", "They get the basics down. ", "Pad Thai..."], "author": "June C.", "review": "I recommend:\n\n1. Pad Thai - Easy peasy right? Yes! and they get it right....See...there are a lot of Thai restaurant's that can't seem to get this right. (See my review about Keoni's by Keo) I judge restaurants by the basics and their extras. They get the basics down. Pad Thai...Thai Restaurant basic...\n\n2. Panang (chicken) Love this...favorite basic thai curry dish over rice.They do it well. If anyone finds one in the city that is any better, let me know! I'll be there..and I'll buy if you're right.\n\n3. Satay ...basic...great!\n\nI've had more dishes in this restaurant than I can recall right now, but know one thing; they do Thai food really well.\nI've been to Thailand...and no. They could never match up to what I had there...but they come pretty close.", "rating": 4, "date": "2007-08-13"}, {"excerpts": ["I drool over their pad thai, the spicy eggplant (can't recall the name), the huge fish and their skewers. \n\n"], "author": "ASIANDIVAH A.", "review": "Love this place!! \n\nIf you are looking for traditional, authentic Thai restaurant, this is the place to be. \n\nI love the decor. Very, very intricate and exotic. It took a good 5 minutes of me admiring the decor before looking at the menu.\n\nThe food is more fantastic than the menu. I drool over their pad thai, the spicy eggplant (can't recall the name), the huge fish and their skewers. \n\nI must say all the food we had that night is excellent. And the price is almost the same as all other Thai place in the city. \n\nThis place is highly recommended to everybody especially to those who haven't tried Thai food, traditional or fusion.", "rating": 4, "date": "2008-09-26"}, {"excerpts": ["I havnt had good pad thai since i lived in Tucson...and so have always been hesitant to order it anywhere now but last night at Manoras ", "i gave them the test and they passed with flying colors! ", "GREAT pad thai, great eggplant, chicken, tofu, garlic chef special, and great papaya salad. ", "Great meal in a super nice atmosphere for under 30 bucks!"], "author": "sarah c.", "review": "Huge fan. I havnt had good pad thai since i lived in Tucson...and so have always been hesitant to order it anywhere now but last night at Manoras i gave them the test and they passed with flying colors! GREAT pad thai, great eggplant, chicken, tofu, garlic chef special, and great papaya salad. Great meal in a super nice atmosphere for under 30 bucks!", "rating": 5, "date": "2011-01-13"}, {"excerpts": ["The pad thai is killer, as is the asparagus with lobster sauce! ", "I went with a big group (8) and we all shared plates-- everything I tried, I loved. ", "Prompt and friendly service. ", "Five stars well earned!"], "author": "Leah M.", "review": "Excellent food, surprisingly low prices, nice ambiance. The pad thai is killer, as is the asparagus with lobster sauce! I went with a big group (8) and we all shared plates-- everything I tried, I loved. Prompt and friendly service. Five stars well earned!", "rating": 5, "date": "2011-02-28"}, {"excerpts": ["The Decent:\nPad Thai - Way better than ", "King of Thai Noodle\nBBQ Chicken - Mine was not dry like some other reviewers.  "], "author": "Derk C.", "review": "I've been here for lunch many times, never dinner though\n\nThe Good:\nLemon Chicken Soup - Chicken is tender and moist, coconut milk gives it a nice sweet creaminess, one of the best things there and it comes with the lunch combo.\nPad-See Ew - Noodles have a nice texture, and a hint of sweetness.  I like to add chili sauce to it.  Meat can be dry though.\nSatay - tastey\nSeafood Thai Fried Rice\nFish Cake\n\nThe Decent:\nPad Thai - Way better than King of Thai Noodle\nBBQ Chicken - Mine was not dry like some other reviewers.  Most of the flavor comes from dipping in the sweet garlic sauce.\n\nThe Bad:\nPanaeg Nur - Spicy beef curry was dry and a lil tough, but at least it was in curry sauce.  The curry was ok, not great.\nOnline Menu - The prices on their online menu are dated.  Add about $1.50.", "rating": 4, "date": "2010-09-16"}, {"excerpts": ["then we ordered the Pad thai, thin sliced garlic bbq pork, crispy duck and filet fish with ginger sauce. ", "it was soo amazing and this place became one of my favorite Thai restaurant in the city. ", "if u ordered the foods that we ordered then u will get what I mean by one of the BEST Thai restaurant in the city...."], "author": "Rika K.", "review": "Last night the 3 of us had 4 entree plates and we literally scarfed them down n it was gone within 20 minutes! it was by far the fastest meal I've ever had in a restaurant. first of all let me say that I was introduced to Manora by my caucasian boss =) I was surprised that this restaurant turned out really good! all of us had the best Thai iced tea ever...it was not too sweet so its perfect. then we ordered the Pad thai, thin sliced garlic bbq pork, crispy duck and filet fish with ginger sauce. it was soo amazing and this place became one of my favorite Thai restaurant in the city. if u ordered the foods that we ordered then u will get what I mean by one of the BEST Thai restaurant in the city....", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["We also had Pad Thai, and an asparagus & something else green curry - Sah-PAY-sey!  ", "Good for not being greasy, but obviously none-too-memorable for me.\n"], "author": "CINDY K.", "review": "My clubbing days are waaaaay over, and I would've never stepped into Manora, located at random-clubs-central (Folsom & 11th), were it not for New Wave City Night (ie - the night for those whose clubbing days are waaaaay over) at DNA Lounge, and my fellow Yelpers.\nThe standout to me was their seafood lemongrass coconut milk soup - it's name starts with \"Tom...\" but they usually do. How helpful am I?  I really could've slurped up the entire quart sized clay serving bowl, but this being my first time doing sit-down dining with some of my companions...I felt I shouldn't frighten them w/my greedy, bestial ways.\nWe also had Pad Thai, and an asparagus & something else green curry - Sah-PAY-sey!  Good for not being greasy, but obviously none-too-memorable for me.\nI was disappointed with the Thai iced coffee - it wasn't strong at all, and on a night when I'm trying to pretend like I'm not hella old, I needed all the caffeine I could get!\nBut if I'm shooting for another evening in the area, I'd be down to come back. 3.5 stars", "rating": 3, "date": "2006-12-05"}, {"excerpts": ["We've had the pad thai, gang-kiew-wan (spicy red curry), pa-naeng-nur (beef curry), mixed veggies and some sort of marinated chicken dish. ", "They were all delicious! ", "All of the meat is so tender. ", "They only accept Visa or Mastercard. ", "I highly recommend this place to anyone looking for a delicious Thai alternative to its more greasy relative, Chinese food."], "author": "Christine P.", "review": "The Boyfriend and I were quite happy to find this place because it's so close to his apartment. The menu was a little different from most Thai restaurants I've been to but all the stuff you want is there. I think it took a long time for our food to come out but that may have been because we were so hungry. The food is tasty without being salty and the portions are good for the price. Take-out is fast and the service is friendly. We've had the pad thai, gang-kiew-wan (spicy red curry), pa-naeng-nur (beef curry), mixed veggies and some sort of marinated chicken dish. They were all delicious! All of the meat is so tender. They only accept Visa or Mastercard. I highly recommend this place to anyone looking for a delicious Thai alternative to its more greasy relative, Chinese food.", "rating": 4, "date": "2009-07-21"}, {"excerpts": ["They have the best pad thai and  really great service. ", "They're always friendly and have really efficient people working there, so efficient one of the waiters cleaned our table and carried 5 entree dishes, a rice pot, and a water pitcher all at once. ", "AMAZAZING!"], "author": "kim l.", "review": "If i could give this place 10 stars I would. They have the best pad thai and  really great service. They're always friendly and have really efficient people working there, so efficient one of the waiters cleaned our table and carried 5 entree dishes, a rice pot, and a water pitcher all at once. AMAZAZING!", "rating": 5, "date": "2008-03-07"}, {"excerpts": ["we ordered a beef stew-soup sorta dish, some seafood skewers, a yellow duck curry, and the thai staple pad thai.\n\n"], "author": "Ameer N.", "review": "i didn't have high hopes coming here, nobody has told me about this place so i figured it was run of the mill.\n\nthe service was great. not overzealous, yet i didn't find them leaving us with empty water glasses.\n\nwe ordered a beef stew-soup sorta dish, some seafood skewers, a yellow duck curry, and the thai staple pad thai.\n\nall 4 dishes were awesome.  a garlic sauce accompanied the skewers and that made my day.\n\noverall, i'll for sure keep this on my thai food radar. i'd like to cruise back and try some of the other dishes.", "rating": 5, "date": "2009-06-24"}, {"excerpts": ["I usually order their garlic pork, yellow curry chicken and pad thai. ", "The food is great for what you pay if you can catch them during lunch hours. ", "The service is fast and friendly."], "author": "R B.", "review": "The owner of this place holds a self proclaimed title for trying the most Thai dishes around the world, or something along those lines as I read from the entrance. I'm not sure if its necessarily a reflection of the dishes they put together, but the food is really tasty. I usually order their garlic pork, yellow curry chicken and pad thai. The food is great for what you pay if you can catch them during lunch hours. The service is fast and friendly.", "rating": 4, "date": "2008-08-19"}, {"excerpts": ["The pad Thai is the best I've had since I lived in Tokyo."], "author": "Rafa R.", "review": "This is my favorite Thai restaurant in San Francisco. The food is authentic -- if a little on the mild side -- and prepared with care. I like the service, the atmosphere and the interesting crowds Manora's attracts. The pad Thai is the best I've had since I lived in Tokyo.", "rating": 5, "date": "2009-11-15"}, {"excerpts": ["pad thai with shrimp, good.  ", "shrimpy portions, not so good.  ", "still, i'd go again if forced to against my will."], "author": "James L.", "review": "was somewhat confused, thought this was gonna be a hanukkah-themed thai kosher deli.  grievously mistaken... except for the thai part.  \n\nhave to admit, it was the best thai food i've had since, well... since the last time i had thai food.  green bean with shrimp, good.  pad thai with shrimp, good.  shrimpy portions, not so good.  still, i'd go again if forced to against my will.", "rating": 3, "date": "2007-01-30"}, {"excerpts": ["If I hadn't had shrimp for lunch, I might have tried the pad thai because I heard it was good here."], "author": "Michelle M.", "review": "Food is delicious. Waiters are attentive but not constantly bothering you seeking approval.  2 people can enjoy a filling dinner for $40 and have left overs to take home.  My favorite order:\n- Chicken Satay\n- 34. Pra-Ram-Long-Song \nBroiled tender sirloin of beef on bed of spinach, topped with spicy peanut sauce. \n- 45. Panaeng-Sam-Ros  \nA combination of crisp chicken, pork and beef deep-fried, topped with spicy red curry sauce. Meat was crunchy yet still tender.\n- both of us had a serving of rice\nWe could have easily shared one dish and been content, possibly even have dessert.  \nI will definitely come back. If I hadn't had shrimp for lunch, I might have tried the pad thai because I heard it was good here.", "rating": 4, "date": "2010-01-14"}, {"excerpts": ["can't wait to try the pad thai."], "author": "linda l.", "review": "Tuesday my pal called me and said \" lets got for thai\" We had the usual satay , steamed white rice and pickled cucumbers. The coconut milk chicken soup was surprisingly sweet and creamy-- i liked the bite sized pieces of chicken breast in it. can't wait to try the pad thai.", "rating": 5, "date": "2009-03-05"}, {"excerpts": ["Their pad thai wasn't so great, I'd go to Best of Thai Noodle House on haight for that, but the BBQ chicken is worth the trip, and it's pretty inexpensive!"], "author": "Jared F.", "review": "Mmmm.  So this place is open late, I think till 11pm during the week, which makes for a great late night dinner.  Order the BBQ Chicken, no matter what you want to eat, no no, don't argue, just order the damn chicken.  It's not like traditional BBQ, but it is FANTASTICALLY amazingly good.  Their pad thai wasn't so great, I'd go to Best of Thai Noodle House on haight for that, but the BBQ chicken is worth the trip, and it's pretty inexpensive!", "rating": 4, "date": "2005-12-16"}, {"excerpts": ["All the basic staple Thai dishes are solid choices - pad thai, spring rolls, etc. ", "Try the mushroom lover salad - this is soo yummy especially if you love mushrooms like I do. ", "Service is friendly and very quick. ", "This place also has a full bar in case you want a cocktail with dinner."], "author": "Josephine H.", "review": "Manora's is a little hidden gem in the SOMA area. I wouldn't have ever discovered this place if it weren't for someone taking me here. It's a great local Thai place to dine in or get takeout. The fresh fried fish is really good. All the basic staple Thai dishes are solid choices - pad thai, spring rolls, etc. Try the mushroom lover salad - this is soo yummy especially if you love mushrooms like I do. Service is friendly and very quick. This place also has a full bar in case you want a cocktail with dinner.", "rating": 4, "date": "2007-06-25"}, {"excerpts": ["I had the Pad Thai, Larb, and Pang Pong ", "and they were all great. ", "The Pang Pong was definitely my favorite! ", "The service wasn't anything to write home about, but the food was great!"], "author": "Sarah W.", "review": "Really inexpensive and delicious thai food.. can't get much better! I had the Pad Thai, Larb, and Pang Pong and they were all great. The Pang Pong was definitely my favorite! The service wasn't anything to write home about, but the food was great!", "rating": 5, "date": "2007-10-24"}, {"excerpts": ["and I had dinner here and had the pad thai, bbq chicken and fish w/red curry which were all pretty good.  ", "We came at a good time, right when they opened at 5:30 on a Sunday ", "but when we were leaving, the place was packed.  ", "I will definitely come here again."], "author": "Rose E.", "review": "I've passed by this place a few times and never realized all the great reviews it has received until recently.  A friend and I had dinner here and had the pad thai, bbq chicken and fish w/red curry which were all pretty good.  We came at a good time, right when they opened at 5:30 on a Sunday but when we were leaving, the place was packed.  I will definitely come here again.", "rating": 4, "date": "2008-04-28"}, {"excerpts": ["I have a hard time going and not having some fresh mint rolls and pad thai.  ", "I love their fresh mint rolls, they're simple and tasty every time.  "], "author": "Eileen R.", "review": "Manora's Thai is yummy, not too spicy and reasonably priced.  I have a hard time going and not having some fresh mint rolls and pad thai.  I love their fresh mint rolls, they're simple and tasty every time.  The salad kak is sinful for a salad, but soo good.", "rating": 5, "date": "2007-04-07"}, {"excerpts": ["Usually get the veggi pad thai and mango sticky rice.  ", "Both are always packed to go very pretty with an orchid flower in the mango sticky rice.  ", "Wish there were more veggie options.  ", "It's good priced and easy to call ahead and pick-up, and always friendly.  ", "Best, ravenous meat eating certain soon to be ex's and friends can get Nate's BBQ across the street, while you can get much better, prettier, yummier thai, and not be a pain in their wanting-to-start-drinking-and-watching-movie asses."], "author": "Today Y.", "review": "Usually lively inside when i go, and i always like everything, but always have gotten take-out because it's still just a usual thai dining room, nothing special to eat in.  Usually get the veggi pad thai and mango sticky rice.  Both are always packed to go very pretty with an orchid flower in the mango sticky rice.  Wish there were more veggie options.  It's good priced and easy to call ahead and pick-up, and always friendly.  Best, ravenous meat eating certain soon to be ex's and friends can get Nate's BBQ across the street, while you can get much better, prettier, yummier thai, and not be a pain in their wanting-to-start-drinking-and-watching-movie asses.", "rating": 3, "date": "2007-07-01"}, {"excerpts": ["But last night I drove from San Mateo to here for dinner and had the lemongrass soup (Tom Ka Gai), Baked Oysters (Special Appetizer), and Pad Thai. ", "all AMAZING and great price ($31 before tip). ", "this is a family favorite and my parents' #1 thai spot."], "author": "Candice B.", "review": "The lunch specials are awesome! But last night I drove from San Mateo to here for dinner and had the lemongrass soup (Tom Ka Gai), Baked Oysters (Special Appetizer), and Pad Thai. all AMAZING and great price ($31 before tip). this is a family favorite and my parents' #1 thai spot.", "rating": 5, "date": "2008-10-30"}, {"excerpts": ["We had the chicked larb, basil chicken, garlic eggplant with beef, pad thai and beef red curry.  ", "No one could stop eating!!!"], "author": "glen o.", "review": "Hands down, the best Thai food I've had in a long time.  Not only was the food mighty tasty, but the service was great.  Everyone was friendly and very accomodating.  One of our friends came by to eat with us \"unexpectedly\" halfway through our meal during their friday dinner service and they gladly moved a chair to our table eventhough the place was so packed.  We had the chicked larb, basil chicken, garlic eggplant with beef, pad thai and beef red curry.  No one could stop eating!!!", "rating": 5, "date": "2008-05-05"}, {"excerpts": ["Great pad thai, curry duck is awesome, I had an eggplant dish that was fantastic (can't remember the name of it now).  ", "The best thing is the bar - you can order a well drink & it actually tastes good, which is unusual at ANY bar, lol.  ", "Love it!"], "author": "Chris C.", "review": "Manora's is just about my favorite Thai place, & I love Thai food!  I've never been disappointed w/ a single item there.  Great pad thai, curry duck is awesome, I had an eggplant dish that was fantastic (can't remember the name of it now).  The best thing is the bar - you can order a well drink & it actually tastes good, which is unusual at ANY bar, lol.  Love it!", "rating": 5, "date": "2009-04-12"}, {"excerpts": ["We had chicken curry, tom ka gai, pad thai and some pork rolls. ", "All of them were packed with sugar. ", "I wasn't looking for desert, yuck!"], "author": "Gregor D.", "review": "I have a hard time with Thai food in general, since a lot of dishes are really sweet. We had chicken curry, tom ka gai, pad thai and some pork rolls. All of them were packed with sugar. I wasn't looking for desert, yuck!", "rating": 2, "date": "2007-03-24"}, {"excerpts": ["This is like the only place I would order the pad thai. ", "I never order it from anywhere else but here. ", "It's soooo goood......"], "author": "kharen s.", "review": "I love the food here. This is like the only place I would order the pad thai. I never order it from anywhere else but here. It's soooo goood......", "rating": 5, "date": "2009-08-18"}, {"excerpts": ["I'm not usually a big fan of Pad Thai, but their Pad Thai is the best I've had. ", "Almost all of their dishes have a lot of flavor and fresh ingredients. "], "author": "G H.", "review": "So tasty! I'm not usually a big fan of Pad Thai, but their Pad Thai is the best I've had. Almost all of their dishes have a lot of flavor and fresh ingredients. And the coconut ice cream from Mitchell's finishes the meal off perfectly.", "rating": 5, "date": "2009-06-12"}, {"excerpts": ["They give a Lime wedge with their Pad Thai, not a lemon wedge. ", "Their pad thai is my favorite in town, and it's not just of the lime wedge. ", "I know SF has tons of Thai restaurants, but Manoras stands out with their flavors & quality. ", "Their staff is pretty friendly and so is the bill. ", "I also like their makeur pad prik a lot!"], "author": "gary a.", "review": "They give a Lime wedge with their Pad Thai, not a lemon wedge. Their pad thai is my favorite in town, and it's not just of the lime wedge. I know SF has tons of Thai restaurants, but Manoras stands out with their flavors & quality. Their staff is pretty friendly and so is the bill. I also like their makeur pad prik a lot!", "rating": 4, "date": "2008-11-11"}, {"excerpts": ["The Pad Thai is the bomb. ", "And the price is reasonable"], "author": "Monika H.", "review": "One of the best Thai places in SF! I love the coconut lemon chicken soup! Great for lunch or dinner. The Pad Thai is the bomb. And the price is reasonable", "rating": 5, "date": "2008-04-16"}], "woonsen pad": [], "jasmine rice": [{"excerpts": ["I got the Pad Thai, basil beef with spicy chili sauce (#33) jasmine rice and a Thai Tea! ", "The food is very flavorful! ", "The beef was the perfect amount of spiciness for me ", "and it was so unbelievably tender! ", "Other places that I've been to have very tough beef which makes it very unenjoyable to eat. ", "As for the Pad Thai, it had a nice kick to it, served with lime and we added chicken to it which made it that much more tasty."], "author": "Gabi D.", "review": "Was in San Francisco craving Thai food and decided to try this restaurant out. When I walked in, my party and I were greeted and sat down within a second! The people that work there are very friendly and welcoming. The ambiance of the place is so beautiful with art pieces all around. It seemed like a very authentic Thai restaurant. I loved how they had candles and flowers on every table.\n\nThe food here is very good and it came out so fast! I got the Pad Thai, basil beef with spicy chili sauce (#33) jasmine rice and a Thai Tea! The food is very flavorful! The beef was the perfect amount of spiciness for me and it was so unbelievably tender! Other places that I've been to have very tough beef which makes it very unenjoyable to eat. As for the Pad Thai, it had a nice kick to it, served with lime and we added chicken to it which made it that much more tasty.", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["but if you ask for it, they can make it- as spicy as you like too) and the sweet chili basil beef dish with jasmine rice. ", "Incredible food and good service. ", "It was not super busy around 7:30 to 8 on Saturday night so we were seated quickly. ", "Food portions are on the smaller side, though, and my party of 2 was not incredibly full after our meal. ", "Otherwise, I would've given this place five stars!"], "author": "Anita O.", "review": "This is by far the new gold standard in Thai cuisine for me, and I've tried a lot. I had the shrimp drunken noodles (not on the menu but if you ask for it, they can make it- as spicy as you like too) and the sweet chili basil beef dish with jasmine rice. Incredible food and good service. It was not super busy around 7:30 to 8 on Saturday night so we were seated quickly. Food portions are on the smaller side, though, and my party of 2 was not incredibly full after our meal. Otherwise, I would've given this place five stars!", "rating": 4, "date": "2015-08-16"}, {"excerpts": ["One dish was a little on the saltier side, perfect for eating with a generous helping of Jasmine rice, which is ~$1 per person. ", "The clay pot was nicely flavored. "], "author": "Tinna H.", "review": "The one thing I order at all Thai places upon first visit is the Thai Iced Tea. If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. We wandered in rather early for dinnertime, so I suppose the attentive service would have been expected.\n\nWe started out with the Tom Yum Goong [spicy and sour prawns and mushroom soup with a touch of lemon grass in roasted chili aroma]. My oh my, this soup is SPICY! Next time I'll have to ask for one step down in the spice. My sinuses, which have been bothering me for over a week, cleared up instantaneously. The prawns were perfect, probably thrown into the soup at the very last second so that they wouldn't be smooshy. \n\nTo share, we ordered the Gai-Kraprao [sautéed minced chicken in sweet basil and fresh chili garlic sauce] and the Nur-Toon [a combination of beef cubes and spices cooked in mushroom and garlic sauce served in a clay pot]. One dish was a little on the saltier side, perfect for eating with a generous helping of Jasmine rice, which is ~$1 per person. The clay pot was nicely flavored. All portions were generous, and we had to take some food to go.\n\nConsidering the portions [good and plenty], the price [entrees average around $8 to $10], and the service [very attentive early on], I'd eat here again. You know, especially if I happen to be in the neighborhood, shopping at Costco or perhaps for a MINI/BMW, or spending the evening at Butter or Wish nearby.", "rating": 5, "date": "2009-01-22"}, {"excerpts": ["If you want to eat yourself into a coma with spicy minced basil chicken, yellow chicken coconut curry, and jasmine rice, this is the place.  ", "The mincing in the former allows the spicy flavor to pack a more forceful punch per bite.  "], "author": "Esther R.", "review": "If you want to eat yourself into a coma with spicy minced basil chicken, yellow chicken coconut curry, and jasmine rice, this is the place.  The mincing in the former allows the spicy flavor to pack a more forceful punch per bite.  The large, tender, boneless chunks of perfectly cooked chicken and potatoes in the latter, float in an ambrosia-like curry that has a little kick and a little cucumber salad sidekick.  \n\nThese two dishes were the first Thai ones we ever had almost exactly 17 years ago at the Manora in the Outer Mission (long gone) for our 2nd wedding anniversary when we were young, scared kids.  Back then, we thought Thai food was exotic and fancy, but then again, growing up in the 'burbs, burritos and Chinese food seemed adventurous.  I had forgotten how tasty and satisfying this inexpensive meal was.  It's because of the coma...  You know, the one that follows the greedylicious overeating and belt-loosening.  Since it gets quite crowded here, we now exclusively get it to go.", "rating": 4, "date": "2007-03-18"}, {"excerpts": ["Didn't feel the need especially with the yummy curry over the jasmine rice.  ", "But the fried rice was very good.  ", "The seafood was super fresh.  ", "The fried rice is a little more wet than the Chinese version and filled with all the thai spices.  "], "author": "Regi K.", "review": "I took my friend for her birthday here for lunch last week. .    I had eaten at Manora years ago, but just haven't been back.  Well the food was delicious and I aim to come back!\n\nWe started with a spicy lemon sweet basil seafood soup.  Then we moved onto the Pad Thai, the Spicy green curry with  beef, mixed with slices of eggplant, and then the combination Seafood Fried Rice.  \n\nI had never had thai fried rice before.   Didn't feel the need especially with the yummy curry over the jasmine rice.  But the fried rice was very good.  The seafood was super fresh.  The fried rice is a little more wet than the Chinese version and filled with all the thai spices.  So very good.   \n\nLunch was excellent.  My friend and I got so comfortable we didn't want to leave!!!!", "rating": 4, "date": "2008-09-03"}, {"excerpts": ["My only real complaint is that they do not have brown rice, so we went with the jasmine rice, which was also really good. \n\n"], "author": "Amy B.", "review": "Wow. Who knew this little place could pack such a punch! We happened to be in the neighborhood and were starving around 9:30pm. Manora's was open, so Manora's it was! I loved the decor and the authenticity as soon as we walked in.\n\nWe started with some hot tea, which was amazing! It was a red thai tea blend and smelled and tasted fabulous. We had the Yum Hed appetizer (combination of various types of mushrooms, prawn, and chicken in Thai spices, laid on a bed of greens), which was very good. It actually started sweet then went to spicy as we kept eating. Great flavor combination. We then shared 2 of the \"Chef's favorites\" dishes: the Pooket Skewer and the MaKeur-Paad-Prik. Now, I don't really like things too spicy, and I've never seen a server seem so disappointed and personally offended by me asking for something mild. I was a little perturbed by that, but the taste of the dishes easily made up for it. The skewers--with charbroiled scallop, prawn, fish, and vegetables with yummy dips--was amazing. And the Japanese eggplant in the other dish was perfectly done. My only real complaint is that they do not have brown rice, so we went with the jasmine rice, which was also really good. \n\nOf course, you can't have Thai food without having some mango with sticky rice, so indeed we ordered that as well. \n\nThe presentation, taste, service, and ambiance all surpassed my expectations for a corner place that was going to ease my late-night starvation. I will definitely be back!", "rating": 4, "date": "2009-11-22"}], "cucumber salad": [{"excerpts": ["It was served with a little portion of sweet cucumber salad. ", "This dish was fantastic. ", "The favor of the curry rich, but not overwhelming and chicken was so soft and tender.  ", "The added potato carb also went really well in the dish. ", "It was completely drenched in gravy. "], "author": "Priti K.", "review": "I was walking during my commute home mid-week and had the sudden insatiable urge for Thai. After traveling through SEA for 6 months last year, I'm only now starting to crave the delicious savory and spicy flavors again. We landed at Manora Thai Cuisine after Yelping for a little bit. Yelp did us right. \n\nThe restaurant was pretty quiet for a Thursday evening. It's really peaceful inside and decorated nicely. \n\nThree dishes to share\n*Gang Gari Gai -- yellow chicken curry cooked in coconut milk with potato. It was served with a little portion of sweet cucumber salad. This dish was fantastic. The favor of the curry rich, but not overwhelming and chicken was so soft and tender.  The added potato carb also went really well in the dish. It was completely drenched in gravy. 5/5\n\n*Nur Pad Prik -- Sauteed beef with sweet basil in spicy chilli garlic sauce. Just as good if not better than the chicken dish. More savory, beautiful color and perfect with white rice. We went for medium spice, which was pretty mild for us. I would come back for these two dishes alone. 5/5\n\n*Pad Thai -- with how good the first two dishes were, we were expecting a pretty good pad thai, but this is where there was a drastic drop in quality. Reason being the excessive use of fish sauce. It tasted funky because they used way too much. My partner doesn't eat seafood, but loved pad thai. This took away the dish for him and I was left to finish all of it. Which I didn't do because the portion is HUGE. 2/5\n\nThe service is friendly. All the male servers wore tropical shirts, but it didn't quite go with the restaurant's ambiance. Of course that should not deter you. Great choice for Thai and we will probably get take out from here again. \n\nThe prices were reasonable too. $36 for all that plus two rice bowls. Sweet deal.", "rating": 4, "date": "2015-08-28"}, {"excerpts": ["#6 Gang-Ga-Ri - yellow chicken curry with cucumber salad (I can never get enough cucumber salad)\n", "#7 Panaeng-Nur - spicy beef curry with sweet basil\n#8 Gai-Graprao - chopped chicken with spicy basil "], "author": "Anyra P.", "review": "Hands down, best Thai food I've ever had. \n\nI've been lucky to visit a few times recently, after seeing a client in the SOMA area. There's a parking garage right across the street on 12th, and lunch specials are about $9 for 2 choices plus the best Tom Ka you'll ever have. The broth is somehow hearty - not the watery thin soup of most places. And the chicken is shredded into tiny delicate strands that haven't died from being boiled too long. The soup alone is worth the visit. Enter the main dishes:\n\nAt lunch you select 2 items from the menu. I have sampled: \n\n#2 Garlic Pork - thin, grilled slices of pork marinated in garlic and black pepper, served with a crazy \"salsa\" of herbs, garlic and fish sauce (I'm guessing). \n#6 Gang-Ga-Ri - yellow chicken curry with cucumber salad (I can never get enough cucumber salad)\n#7 Panaeng-Nur - spicy beef curry with sweet basil\n#8 Gai-Graprao - chopped chicken with spicy basil garlic sauce\n\nI think the #2/#8 is my favorite combo. I have to hold myself back from eating it all, because I can't bare to leave without some leftovers for later. \n\nIf I were Jewish this would be the Manora I pray to.", "rating": 5, "date": "2016-02-10"}, {"excerpts": ["Tod Mon, Cucumber salad with peanuts...", "Delicious, I will never forget Manora's. ", "It is a nostalgic place for me. ", "Although there are endless choices for good Thai food in SF...you never forget your first."], "author": "Ronnie S.", "review": "Manora's was the first Thai restaurant I ever experienced. It was located on Mission street ,near 30th St. It was tiny and the decor was clean,humble and quaint.  It was 1988 and I had never heard of Thai food. Being born and raised in San Francisco, I was very familiar with Chinese and Japanese food. Even regional Indian food was easily accessible My best friends mom, Sabina went on a date there and came home raving about the food. Needless to say, we went for lunch the next day. The smells and taste were very fragrant exotic (then) and perfumed my senses. My first Thai Iced Tea...Gang Gari Gai, Tod Mon, Cucumber salad with peanuts...Delicious, I will never forget Manora's. It is a nostalgic place for me. Although there are endless choices for good Thai food in SF...you never forget your first.", "rating": 4, "date": "2017-04-16"}, {"excerpts": ["I thoroughly enjoy their lemongrass chicken soup, cucumber salad, yellow chicken curry and chicken satay. ", "I've tried others on the menu and have not been disappointed, these are just my favorite dishes."], "author": "Marfel L.", "review": "You get a lot of value for your dollar on the weekday lunch menu. I thoroughly enjoy their lemongrass chicken soup, cucumber salad, yellow chicken curry and chicken satay. I've tried others on the menu and have not been disappointed, these are just my favorite dishes.", "rating": 5, "date": "2014-02-28"}, {"excerpts": ["lemon chicken soup, yellow chicken curry, Thai Fried Rice, cucumber salad, and fried shrimp/vegetables on a lunch special. "], "author": "Ryan V.", "review": "This is Thai food at its best. Wait, this any food at its best! I had perhaps the most satisfying lunch in a long time here.\n\nFor about $8 I saw I could get lemon chicken soup, yellow chicken curry, Thai Fried Rice, cucumber salad, and fried shrimp/vegetables on a lunch special. I wasn't expecting everything to be good, but it was actually all delicious.\n\nThe lemon chicken soup had just the right amount of lemon to coconut milk ratio and generous, tender pieces of chicken. My chicken curry also had a spicy and savory flavor and again the chicken was extremely tender. The shrimp and vegetables were also perfectly crispy and really fresh. Really, everything was just so good.\n\nOn top of that, the service was good and the decor was quite pleasant. There's no way I'll be able to avoid this place for my Thai fix in the future.", "rating": 5, "date": "2008-10-02"}, {"excerpts": ["The large, tender, boneless chunks of perfectly cooked chicken and potatoes in the latter, float in an ambrosia-like curry that has a little kick and a little cucumber salad sidekick.  \n\n"], "author": "Esther R.", "review": "If you want to eat yourself into a coma with spicy minced basil chicken, yellow chicken coconut curry, and jasmine rice, this is the place.  The mincing in the former allows the spicy flavor to pack a more forceful punch per bite.  The large, tender, boneless chunks of perfectly cooked chicken and potatoes in the latter, float in an ambrosia-like curry that has a little kick and a little cucumber salad sidekick.  \n\nThese two dishes were the first Thai ones we ever had almost exactly 17 years ago at the Manora in the Outer Mission (long gone) for our 2nd wedding anniversary when we were young, scared kids.  Back then, we thought Thai food was exotic and fancy, but then again, growing up in the 'burbs, burritos and Chinese food seemed adventurous.  I had forgotten how tasty and satisfying this inexpensive meal was.  It's because of the coma...  You know, the one that follows the greedylicious overeating and belt-loosening.  Since it gets quite crowded here, we now exclusively get it to go.", "rating": 4, "date": "2007-03-18"}, {"excerpts": ["Served with cucumber salad) ", "7.95 \n-Paad ", "-Kin-Na-Ree  ", "7.95 \nA combination of prawn, calamari, chicken and glass noodle pan-fried sauted with baby corn and green onion in oriental sauce\n", "-Pad ", "Thai\n", "All of these are my recommended dishes. ", "The soup and curry were sweet n spicy enough!!  \n", "It lost a star because they can't add.  ", "Just make sure to check your bill before paying.  ", "Otherwise, I would go back once every 3 months or so."], "author": "Christi S.", "review": "Ate here for dinner recently.  Can't judge them on their lunch yet.\nDinner: awesome!!  Everything was perfectly mildly spicy.  Nothing too extreme.  Just enough hot sauce to enjoy the true flavors of fresh herbs.  \nOrdered: \n-Gai-Tom-Ka (Thai style lemon chicken soup in coconut milk and oriental herbs) 6.95\n-Gang-Gari-Gai (Yellow chicken curry cooked in coconut milk and potato cubes. Served with cucumber salad) 7.95 \n-Paad -Kin-Na-Ree  7.95 \nA combination of prawn, calamari, chicken and glass noodle pan-fried sauted with baby corn and green onion in oriental sauce\n-Pad Thai\nAll of these are my recommended dishes. The soup and curry were sweet n spicy enough!!  \nIt lost a star because they can't add.  Just make sure to check your bill before paying.  Otherwise, I would go back once every 3 months or so.", "rating": 4, "date": "2007-05-25"}], "fried banana with ice cream": [], "mango with sticky rice": [{"excerpts": ["My friends and I ordered a bunch of dishes and shared them, including Tom Yum Talay (spicy seafood soup), Gang-Ped-Ped-Yang (roast duck curry), Pad Thai, Asparagus with Lobster Sauce, and Mango with Sticky Rice. ", "The Tom Yum Talay was dynamite--I just couldn't get enough of the flavors and spiciness. ", "The Gang-Ped-Ped-Yang was delicious--duck is my new favorite meat in curry (it's all about the fatty but fabulous skin). ", "The Pad Thai was pretty good ", "but I prefer the one at King of Thai Noodle House, which is more saucy. ", "The Asparagus with Lobster Sauce was all right--you'd think lobster would make everything superb ", "but you're wrong. "], "author": "Liz T.", "review": "Another week, another Thai restaurant. If you can't tell, I'm eating my way through all of them--15 bucks at a time. Manora's food is worthy of three stars, but the service is spectacular--and not just for an Asian restaurant. So four stars.\n\nMy friends and I ordered a bunch of dishes and shared them, including Tom Yum Talay (spicy seafood soup), Gang-Ped-Ped-Yang (roast duck curry), Pad Thai, Asparagus with Lobster Sauce, and Mango with Sticky Rice. It was a lot of food for three people, but we love to eat and have a little of everything. \n\nThe Tom Yum Talay was dynamite--I just couldn't get enough of the flavors and spiciness. The Gang-Ped-Ped-Yang was delicious--duck is my new favorite meat in curry (it's all about the fatty but fabulous skin). The Pad Thai was pretty good but I prefer the one at King of Thai Noodle House, which is more saucy. The Asparagus with Lobster Sauce was all right--you'd think lobster would make everything superb but you're wrong. The Mango and Sticky Rice was a good, sweet ending to our night.\n\nI'm pretty sure I went to sleep at 11PM (very early for me) because I couldn't stay awake after inhaling all that. Can't wait to try more Thai restaurants, though. Where shall I go next?", "rating": 4, "date": "2008-11-01"}, {"excerpts": ["Of course, you can't have Thai food without having some mango with sticky rice, so indeed we ordered that as well. \n\n"], "author": "Amy B.", "review": "Wow. Who knew this little place could pack such a punch! We happened to be in the neighborhood and were starving around 9:30pm. Manora's was open, so Manora's it was! I loved the decor and the authenticity as soon as we walked in.\n\nWe started with some hot tea, which was amazing! It was a red thai tea blend and smelled and tasted fabulous. We had the Yum Hed appetizer (combination of various types of mushrooms, prawn, and chicken in Thai spices, laid on a bed of greens), which was very good. It actually started sweet then went to spicy as we kept eating. Great flavor combination. We then shared 2 of the \"Chef's favorites\" dishes: the Pooket Skewer and the MaKeur-Paad-Prik. Now, I don't really like things too spicy, and I've never seen a server seem so disappointed and personally offended by me asking for something mild. I was a little perturbed by that, but the taste of the dishes easily made up for it. The skewers--with charbroiled scallop, prawn, fish, and vegetables with yummy dips--was amazing. And the Japanese eggplant in the other dish was perfectly done. My only real complaint is that they do not have brown rice, so we went with the jasmine rice, which was also really good. \n\nOf course, you can't have Thai food without having some mango with sticky rice, so indeed we ordered that as well. \n\nThe presentation, taste, service, and ambiance all surpassed my expectations for a corner place that was going to ease my late-night starvation. I will definitely be back!", "rating": 4, "date": "2009-11-22"}], "ice cream": [{"excerpts": ["thai iced tea is a must and the fried banana ice cream dessert is a delight. ", "the food and especially the warm service are worth every single penny"], "author": "Thu N.", "review": "crispy fried duck and chef curry are amazing. thai iced tea is a must and the fried banana ice cream dessert is a delight. the food and especially the warm service are worth every single penny", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["For dessert we had the coconut ice cream with fried banana balls. ", "It wasn't cheap and you didn't get very much ice cream or banana balls. "], "author": "Vanessa F.", "review": "Food was good, but the service BLEW.\n\nWe made reservations for a party of 8 at 7:30 pm. Turns out a party of 8 came in a few minutes before us and the restaurant gave them our table leaving us to wait about 45 minutes to be seated.\n\nApologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\nThe meat dish I had of beef and green beans in chili sauce was good. We ordered extra extra spicy... as in \"as spicy as you can make it.\" It wasn't spicy at all. Boo.\n\nThe pad thai was eh. Again, ordered extra spicy but didn't get it.\n\nFor dessert we had the coconut ice cream with fried banana balls. It wasn't cheap and you didn't get very much ice cream or banana balls. They weren't \"balls\" either.\n\nProbably wouldn't go back unless we were meeting friends. There's places closer to home that are better.", "rating": 2, "date": "2009-01-18"}, {"excerpts": ["I suggest you end your meal with the Fried Banana w/Coconut Ice Cream. \n\n"], "author": "Kimberly L.", "review": "Manora's is my #1 Thai spot. \n \nThe staff is really attentive and the restaurant is always clean. \nThe food is well priced and the portions are just right (not leaving you hungry is always a plus!)\n\nMy top two dishes would have to be the #45 (thats right, all you have to say to order this dish is #45. Another one would have to be the Yellow Curry Chicken w/Potato cubes in coconut milk, it is to die for! \nI suggest you end your meal with the Fried Banana w/Coconut Ice Cream. \n\nOverall...I have nothing bad to bash this place about.", "rating": 5, "date": "2010-11-12"}, {"excerpts": ["Fried Banana Balls with Ice Cream \n\n"], "author": "Amelia M.", "review": "One of the better Thai Restaurants I have been to in SF. \n\nI have yet to have a bad meal here. It is best when you go in a larger group (just beware of the long wait here if you go at dinner time) so you can try a lot of dishes. I am a huge fan of their Pad Thai... not greasy at all. Something that I tend to find at other Thai establishments.\n\nDishes to try:\n\nKow-Graprao (Minced Chicken)\nKow Pla Muk Pad-Ped (Sauteed Calamari)\nPad-Thai (Noodles)\nPad-See Ew (Pan fried flat noodle)\nFresh Mint Roll (fresh roll with Shrimp)\nBeef Shish-Ka-Bob  \nMoo-Gra-Teiam  (Pork)\nPla-Muk-Pad-Ped (Calamari)\n\nDrinks: \nGreat drinks from the full bar (Cosmos are good here)\nHot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\nFried Banana Balls with Ice Cream \n\nThe staff is very nice and friendly. Just make sure to have your entire party there. It takes time to get seated. Parking is not too bad as long as it is not too late and people are heading out to the clubs, which will make parking a bit harder in the area.", "rating": 4, "date": "2008-03-19"}, {"excerpts": ["I will say, try the fried banana ball and ice cream dessert.  ", "yum!"], "author": "Dudley F.", "review": "I'm a fan.  I've been here three times now and have ordered something different each time.  Every dish I've tried is really good.  I'd try to repeat the names here, but I can barely pronounce the names let alone spell it.  So, try everything, per my recommendation.  The service is friendly, the atmosphere is cozy, and parking has been manageable the times I've been there.  \n\nI will say, try the fried banana ball and ice cream dessert.  yum!", "rating": 5, "date": "2008-09-15"}, {"excerpts": ["and I shared a coconut ice cream with mango slices...", "yum!  ", "The ice cream tasted as if it was house made, that alone makes me a fan!"], "author": "Carlos C.", "review": "My friend and I had not seen each other in a few years, so we decided to dine here. We were catching up on each others lives, so we didn't immediately look at the the menu.  Our server was very patient and gracious.  When the food came, it was flavorful with generous portions.  To top it off, my firend and I shared a coconut ice cream with mango slices...yum!  The ice cream tasted as if it was house made, that alone makes me a fan!", "rating": 5, "date": "2008-10-24"}, {"excerpts": ["And the ice cream/banana/coconut dessert is outstanding (if you still have room after all the excellent food)."], "author": "Geae D.", "review": "My favorite Thai place in the city! The seafood appetizer that comes in the giant shell is my favorite. And the ice cream/banana/coconut dessert is outstanding (if you still have room after all the excellent food).", "rating": 5, "date": "2010-01-27"}, {"excerpts": ["And the coconut ice cream from Mitchell's finishes the meal off perfectly."], "author": "G H.", "review": "So tasty! I'm not usually a big fan of Pad Thai, but their Pad Thai is the best I've had. Almost all of their dishes have a lot of flavor and fresh ingredients. And the coconut ice cream from Mitchell's finishes the meal off perfectly.", "rating": 5, "date": "2009-06-12"}], "siam gem": [], "copy of mango with sticky rice": [], "pla chu chee": [{"excerpts": ["On top of that, the Pla Chu Chee (Orange Roughy with Red Curry) is outstanding.\n", "It can get busy and service can get a little spotty during that time ", "but I'm not going to ding them for that. ", "The food makes up for it.\n", "So happy to have good friends like this in SF!"], "author": "Alan T.", "review": "We moved from the Bay Area around 5 years ago. Thankfully we're close enough to indulge in the wonderful San Francisco on a regular basis visiting friends and eating like it's our last day on earth. It's funny but we visit there equally as often as when we lived in San Carlos...\nAn old friend I haven't visited for a long time (since well before Yelp was a gleam in Jeremy's eye) is Manora's Thai. We used to fill up here prior to heading to one of the many music venues for the rest of the evening (anyone remember The Covered Wagon?). \nGoodness, what food! The Tom Ka Gai (Chicken Coconut Soup) is like nowhere else. Anything with the red chili sauce is awesome. On top of that, the Pla Chu Chee (Orange Roughy with Red Curry) is outstanding.\nIt can get busy and service can get a little spotty during that time but I'm not going to ding them for that. The food makes up for it.\nSo happy to have good friends like this in SF!", "rating": 5, "date": "2009-10-12"}], "plaradprik": [], "plajean": [], "talay hot platec": [], "plamukpadped": [], "pongpang": [], "koongchuchee": [], "goongtod": [], "plamukgrateiam": [], "goonggrobb": [], "goonggrateiam": [], "soda": [{"excerpts": ["Apologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\n"], "author": "Vanessa F.", "review": "Food was good, but the service BLEW.\n\nWe made reservations for a party of 8 at 7:30 pm. Turns out a party of 8 came in a few minutes before us and the restaurant gave them our table leaving us to wait about 45 minutes to be seated.\n\nApologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\nThe meat dish I had of beef and green beans in chili sauce was good. We ordered extra extra spicy... as in \"as spicy as you can make it.\" It wasn't spicy at all. Boo.\n\nThe pad thai was eh. Again, ordered extra spicy but didn't get it.\n\nFor dessert we had the coconut ice cream with fried banana balls. It wasn't cheap and you didn't get very much ice cream or banana balls. They weren't \"balls\" either.\n\nProbably wouldn't go back unless we were meeting friends. There's places closer to home that are better.", "rating": 2, "date": "2009-01-18"}], "thai iced tea": [{"excerpts": ["The Thai iced tea is NOT to sweet, and everything else is just straight BOMB!!! "], "author": "Dezi S.", "review": "One of THE best Thai restaurants in the City! Everything tastes so fresh and authentic! The minced basil beef is a family favorite! So is the fried fish with garlic chili sauce! Unfortunately, they don't do the whole fish any longer, but the fillets are still tasty! The Thai iced tea is NOT to sweet, and everything else is just straight BOMB!!! You can tell a really good Thai place of off their Pad Thai! The noodles are perfectly soft, with a alight chew! There are so many places that have their noodles too hard, or too chewy! The flavor is awesome with the hint of dried shrimp! This place is a MUST have!", "rating": 5, "date": "2018-07-04"}, {"excerpts": ["thai iced tea is a must and the fried banana ice cream dessert is a delight. ", "the food and especially the warm service are worth every single penny"], "author": "Thu N.", "review": "crispy fried duck and chef curry are amazing. thai iced tea is a must and the fried banana ice cream dessert is a delight. the food and especially the warm service are worth every single penny", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["We also ordered Thai Iced Tea as well.\n\n"], "author": "Tim G.", "review": "Manora's is a hidden gem tucked away in SOMA. I would never have stumbled upon it if it weren't for the Yelp app on my phone. \n\nGetting here was a real breeze and finding parking was even easier. It wasn't hard to find a 2 hour parking spot less than a block away from the restaurant on a weekday.\n\nThe lunch specials are indeed worth it! I ordered the Kow-Gang Panaeng and it was very filling. I ordered it medium spicy and it wasn't spicy enough so I had to add some extra chili powder. I like my food really hot. My friend ordered the Pad Thai and the ingredients were really fresh. That's really key and I usually avoid Pad Thai due to old bean sprouts at other restaurants. I was pleasantly surprised to find out that the portions were quite large. I highly recommend getting the Pad Thai! We also ordered Thai Iced Tea as well.\n\nWe will be back again and Manora's might turn into our regular lunch spot.", "rating": 4, "date": "2012-06-07"}, {"excerpts": ["Plus, the thai iced tea hits the spot."], "author": "Jennifer W.", "review": "Come here for the lunch specials. You can choose a couple of dishes and have the house fried rice on the side. But the single best part of the lunch combo is the lemon chicken soup. Both the beef and chicken satay are okay, but a little dry. Even though the soup calls to me, I like the noodle dishes. I've tried the pad thai and pad kee mao. I've also had the chicken and fish ball noodle soup. Recently, I also tried the duck served with rice and it was simply delicious. The cuts where big and fatty. Plus, the thai iced tea hits the spot.", "rating": 4, "date": "2015-07-14"}, {"excerpts": ["And the Thai iced tea was yummy. ", "Really pleasant service! ", "We will definitely recommend to our friends who visit and will make a special trip back next time we return to San Fran!"], "author": "Allison W.", "review": "Manora's was recommended to us by the owner of Rumor who said this was the most authentic Thai in the area (he should know- he's from Thailand!). This place did not disappoint. We started with the Larb and the Tom Yung Soup. Both amazing and delicious. For entrees we went with the chicken Pad Thai and the spicy green curry chicken dish. Wow, we were both extremely pleased. The spice is the real deal. And the Thai iced tea was yummy. Really pleasant service! We will definitely recommend to our friends who visit and will make a special trip back next time we return to San Fran!", "rating": 5, "date": "2016-06-01"}, {"excerpts": ["My first Thai Iced Tea...", "Gang Gari Gai, "], "author": "Ronnie S.", "review": "Manora's was the first Thai restaurant I ever experienced. It was located on Mission street ,near 30th St. It was tiny and the decor was clean,humble and quaint.  It was 1988 and I had never heard of Thai food. Being born and raised in San Francisco, I was very familiar with Chinese and Japanese food. Even regional Indian food was easily accessible My best friends mom, Sabina went on a date there and came home raving about the food. Needless to say, we went for lunch the next day. The smells and taste were very fragrant exotic (then) and perfumed my senses. My first Thai Iced Tea...Gang Gari Gai, Tod Mon, Cucumber salad with peanuts...Delicious, I will never forget Manora's. It is a nostalgic place for me. Although there are endless choices for good Thai food in SF...you never forget your first.", "rating": 4, "date": "2017-04-16"}, {"excerpts": ["So, I opted for Khew-Tew Rad-Na with chicken and Thai Iced Tea. ", "I was craving the chow fun type noodles anyway. ", "I liked the fact that the gravy was a little thinner than usual Rad-Na. ", "I guess because it was a rather hot day, and I did order gravy. "], "author": "Rosie M.", "review": "I walked in with ordering from the lunch specials in mind. Then, I couldn't decide which dish I should have the yellow curry with to compliment the flavors. So, I opted for Khew-Tew Rad-Na with chicken and Thai Iced Tea. I was craving the chow fun type noodles anyway. I liked the fact that the gravy was a little thinner than usual Rad-Na. I guess because it was a rather hot day, and I did order gravy. I was pretty happy with the fact that the portion size was decent for the price. \n\nI will visit again, and update my post. Hopefully, it was just the dish that I ordered. I should try something super common like pad thai.", "rating": 3, "date": "2012-06-13"}, {"excerpts": ["I had the Thai Iced Tea, Lunch Combination of Curry Chicken and Fish Cakes. ", "Happily full when I left."], "author": "Angela L.", "review": "Great Decor and Ambiance- and they have fresh flowers!\n\nI went for lunch and the portions are very generous for the price. Also very well made and fresh. \n\nI had the Thai Iced Tea, Lunch Combination of Curry Chicken and Fish Cakes. Happily full when I left.", "rating": 4, "date": "2012-06-19"}, {"excerpts": ["Apologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\n"], "author": "Vanessa F.", "review": "Food was good, but the service BLEW.\n\nWe made reservations for a party of 8 at 7:30 pm. Turns out a party of 8 came in a few minutes before us and the restaurant gave them our table leaving us to wait about 45 minutes to be seated.\n\nApologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\nThe meat dish I had of beef and green beans in chili sauce was good. We ordered extra extra spicy... as in \"as spicy as you can make it.\" It wasn't spicy at all. Boo.\n\nThe pad thai was eh. Again, ordered extra spicy but didn't get it.\n\nFor dessert we had the coconut ice cream with fried banana balls. It wasn't cheap and you didn't get very much ice cream or banana balls. They weren't \"balls\" either.\n\nProbably wouldn't go back unless we were meeting friends. There's places closer to home that are better.", "rating": 2, "date": "2009-01-18"}, {"excerpts": ["The Thai Iced Tea was pretty good, but not as strong as I'd prefer. ", "It was also served with shaved ice, while I prefer ice cubes. "], "author": "Tracy W.", "review": "I was pleasantly surprised when I went to Manora's. And that's an understatement. My boyfriend has been asking me to go for some time, but I never saw an urgency in the matter. And when I approached and entered the restaurant, I thought, hmm, how strange. A Thai restaurant that looks like an English pub?\n\nBut wow! I have to say this was the best Thai food I've ever had. It's true that I only tried 2 dishes there since only 2 of us went, and it's true that I'm not the ultimate authority on quality Thai food; I must say there are some Thai restaurants out there that I know I will not bother to return to unless I really must.\n\nThe Thai Iced Tea was pretty good, but not as strong as I'd prefer. It was also served with shaved ice, while I prefer ice cubes. But that's not really the point of a dinner.\n\nWe started with Tom Kha Gai. Best. Ever. The portion was perfect, and they didn't leave in the ingredients that you can't eat, like galangal, lemon grass, and etc. The soup had a good creamy consistency, with a decent amount of heat. The highlight was the chicken. Oh, the chicken! There were large chunks of it in the soup, cooked so tender that it was falling apart. Yum!\n\nAnd then came the yellow curry with chicken. And yes, the chicken was just as tender as what was in the soup! The portions were great too. We had enough to stuff ourselves with seconds, plus some for leftovers. Some people call that skimpy but I call it the right amount.\n\nI'd definitely return and try other dishes when I'm in the area!", "rating": 5, "date": "2010-12-04"}, {"excerpts": ["Thai iced tea is great, has a touch of chrysanthemum I think, so it's a good indicator that the rest of the menu is good."], "author": "Gregory N.", "review": "This is my go-to Thai restaurant in the city.  The fried fish used to be the best, but sometimes the filets are small and the price has risen.  Curries are still good.  Prices are reasonable for San Francisco.  All my friends love the place, especially out of towners.  Thai iced tea is great, has a touch of chrysanthemum I think, so it's a good indicator that the rest of the menu is good.", "rating": 5, "date": "2013-06-01"}, {"excerpts": ["Thai iced tea next time!\n\n"], "author": "Salernitana A.", "review": "I went here with a friend for dinner, and I actually thought that the place would be awesome since it's in the middle of a not-so-great district. I wanted it to be awesome, and my friend said it was awesome, but I disagree. Overall:\n\n1. The larb is crazy good. We wolfed it down in about three seconds, like how cartoons eat corn on the cob. The basil chicken was also fragrant and yummy.\n\n2. I had the pad thai, which was OK. They didn't pan sear the tofu, they sort of mixed it all in at the last second, and they made it so spicy I well, you don't need to hear that.\n\n3. Their menu says Diet Coke, but all they had was Diet Pepsi. Thai iced tea next time!\n\nOur waiter was very kind and knowledgeable about the menu, and I have definitely had worse Thai. But I've also had way better. Maybe I just ordered the wrong thing.", "rating": 3, "date": "2011-06-06"}, {"excerpts": ["The one thing I order at all Thai places upon first visit is the Thai Iced Tea. ", "If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. ", "If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. ", "At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. ", "At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. "], "author": "Tinna H.", "review": "The one thing I order at all Thai places upon first visit is the Thai Iced Tea. If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. We wandered in rather early for dinnertime, so I suppose the attentive service would have been expected.\n\nWe started out with the Tom Yum Goong [spicy and sour prawns and mushroom soup with a touch of lemon grass in roasted chili aroma]. My oh my, this soup is SPICY! Next time I'll have to ask for one step down in the spice. My sinuses, which have been bothering me for over a week, cleared up instantaneously. The prawns were perfect, probably thrown into the soup at the very last second so that they wouldn't be smooshy. \n\nTo share, we ordered the Gai-Kraprao [sautéed minced chicken in sweet basil and fresh chili garlic sauce] and the Nur-Toon [a combination of beef cubes and spices cooked in mushroom and garlic sauce served in a clay pot]. One dish was a little on the saltier side, perfect for eating with a generous helping of Jasmine rice, which is ~$1 per person. The clay pot was nicely flavored. All portions were generous, and we had to take some food to go.\n\nConsidering the portions [good and plenty], the price [entrees average around $8 to $10], and the service [very attentive early on], I'd eat here again. You know, especially if I happen to be in the neighborhood, shopping at Costco or perhaps for a MINI/BMW, or spending the evening at Butter or Wish nearby.", "rating": 5, "date": "2009-01-22"}, {"excerpts": ["Perfectly sweetened Thai iced tea.\n\n"], "author": "Liz C.", "review": "Appetizer:  soft shell crab with a lemony dip accompaniment.  \n\nPerfectly sweetened Thai iced tea.\n\nOh, and the other stuff is very good as well.", "rating": 4, "date": "2007-12-10"}, {"excerpts": ["Hot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\n"], "author": "Amelia M.", "review": "One of the better Thai Restaurants I have been to in SF. \n\nI have yet to have a bad meal here. It is best when you go in a larger group (just beware of the long wait here if you go at dinner time) so you can try a lot of dishes. I am a huge fan of their Pad Thai... not greasy at all. Something that I tend to find at other Thai establishments.\n\nDishes to try:\n\nKow-Graprao (Minced Chicken)\nKow Pla Muk Pad-Ped (Sauteed Calamari)\nPad-Thai (Noodles)\nPad-See Ew (Pan fried flat noodle)\nFresh Mint Roll (fresh roll with Shrimp)\nBeef Shish-Ka-Bob  \nMoo-Gra-Teiam  (Pork)\nPla-Muk-Pad-Ped (Calamari)\n\nDrinks: \nGreat drinks from the full bar (Cosmos are good here)\nHot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\nFried Banana Balls with Ice Cream \n\nThe staff is very nice and friendly. Just make sure to have your entire party there. It takes time to get seated. Parking is not too bad as long as it is not too late and people are heading out to the clubs, which will make parking a bit harder in the area.", "rating": 4, "date": "2008-03-19"}, {"excerpts": ["Add a thai iced tea and your out the door for about $10.\n\n"], "author": "Sean B.", "review": "I recently took a job in the area and was looking for a good, affordable lunch alternative in the old SOMA area and found a good one.\n\nI believe you choose two different entrees and it comes with rice and some other stuff and its priced right...around $7-8 bucks. Add a thai iced tea and your out the door for about $10.\n\nFood was good, had a good variety for the lunch combo including BBQ chicken satay, different types of curry and even a spicey chicken dish. \n\nAll and All probably one of the best places if your work in SOMA near Holy Cow and Butter area unless you want a $2 Costco dog.", "rating": 4, "date": "2008-11-24"}, {"excerpts": ["all of us had the best Thai iced tea ever...", "it was not too sweet so its perfect. "], "author": "Rika K.", "review": "Last night the 3 of us had 4 entree plates and we literally scarfed them down n it was gone within 20 minutes! it was by far the fastest meal I've ever had in a restaurant. first of all let me say that I was introduced to Manora by my caucasian boss =) I was surprised that this restaurant turned out really good! all of us had the best Thai iced tea ever...it was not too sweet so its perfect. then we ordered the Pad thai, thin sliced garlic bbq pork, crispy duck and filet fish with ginger sauce. it was soo amazing and this place became one of my favorite Thai restaurant in the city. if u ordered the foods that we ordered then u will get what I mean by one of the BEST Thai restaurant in the city....", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["I crave that on a daily basis, oh that and the thai iced tea ", ":)  ", "Parking is kind of a hassle though if you're trying to go for dinner."], "author": "Marina K.", "review": "I love how cheap this place is. MUST get the glass noodles. I crave that on a daily basis, oh that and the thai iced tea :)  Parking is kind of a hassle though if you're trying to go for dinner.", "rating": 4, "date": "2005-05-13"}, {"excerpts": ["The thai iced tea will blow your mind and the wait staff are very pleasant."], "author": "Allison K.", "review": "Good Thai food found with the help of Yelp!  Delicious appy and the meal was just what the doctor ordered since I was starved.  I wish I had room for mango/sticky ride but the portions here were surprisingly large.  The thai iced tea will blow your mind and the wait staff are very pleasant.", "rating": 4, "date": "2006-03-10"}, {"excerpts": ["The only thing bad was that their thai iced tea is always too watery. ", "So the food is great. ", "The drinks, not so much"], "author": "jess w.", "review": "The food was pretty good! I've came here multiple times for lunch and always get the lunch combination. It's a sweet deal because it comes with rice and coconut soup too! The only thing bad was that their thai iced tea is always too watery. So the food is great. The drinks, not so much", "rating": 3, "date": "2011-12-05"}], "coffee": [{"excerpts": ["I had a thai iced coffee and veg pad thai, both were delicious. ", "The pad thai had a good flavor, thin delicate noodles and nice amounts of egg and tofu. ", "It'd be cool if they listed more veg options rather than having to ask for them."], "author": "Cori W.", "review": "Nice place for lunch, cheaper than Basil Canteen but not as ~fancy~. The interior is very thai and cozy. I had a thai iced coffee and veg pad thai, both were delicious. The pad thai had a good flavor, thin delicate noodles and nice amounts of egg and tofu. It'd be cool if they listed more veg options rather than having to ask for them.", "rating": 4, "date": "2010-02-12"}, {"excerpts": ["Get a Thai Iced Coffee too. \n", "De-rated one star for a bit iffy service. ", "My water sat empty for half of my lunch, and this was in an uncrowded restaurant."], "author": "Steve F.", "review": "I've only been here once for lunch, but I know Thai food, and this place really made me commit it to memory. Their food was awesome, spicy, good portions. Get a Thai Iced Coffee too. \nDe-rated one star for a bit iffy service. My water sat empty for half of my lunch, and this was in an uncrowded restaurant.", "rating": 4, "date": "2007-08-26"}, {"excerpts": ["I was disappointed with the Thai iced coffee - it wasn't strong at all, and on a night when I'm trying to pretend like I'm not hella old, I needed all the caffeine I could get!\n", "But if I'm shooting for another evening in the area, I'd be down to come back. ", "3.5 stars"], "author": "CINDY K.", "review": "My clubbing days are waaaaay over, and I would've never stepped into Manora, located at random-clubs-central (Folsom & 11th), were it not for New Wave City Night (ie - the night for those whose clubbing days are waaaaay over) at DNA Lounge, and my fellow Yelpers.\nThe standout to me was their seafood lemongrass coconut milk soup - it's name starts with \"Tom...\" but they usually do. How helpful am I?  I really could've slurped up the entire quart sized clay serving bowl, but this being my first time doing sit-down dining with some of my companions...I felt I shouldn't frighten them w/my greedy, bestial ways.\nWe also had Pad Thai, and an asparagus & something else green curry - Sah-PAY-sey!  Good for not being greasy, but obviously none-too-memorable for me.\nI was disappointed with the Thai iced coffee - it wasn't strong at all, and on a night when I'm trying to pretend like I'm not hella old, I needed all the caffeine I could get!\nBut if I'm shooting for another evening in the area, I'd be down to come back. 3.5 stars", "rating": 3, "date": "2006-12-05"}], "tea": [{"excerpts": ["The Thai iced tea is NOT to sweet, and everything else is just straight BOMB!!! "], "author": "Dezi S.", "review": "One of THE best Thai restaurants in the City! Everything tastes so fresh and authentic! The minced basil beef is a family favorite! So is the fried fish with garlic chili sauce! Unfortunately, they don't do the whole fish any longer, but the fillets are still tasty! The Thai iced tea is NOT to sweet, and everything else is just straight BOMB!!! You can tell a really good Thai place of off their Pad Thai! The noodles are perfectly soft, with a alight chew! There are so many places that have their noodles too hard, or too chewy! The flavor is awesome with the hint of dried shrimp! This place is a MUST have!", "rating": 5, "date": "2018-07-04"}, {"excerpts": ["I got the Pad Thai, basil beef with spicy chili sauce (#33) jasmine rice and a Thai Tea! ", "The food is very flavorful! ", "The beef was the perfect amount of spiciness for me ", "and it was so unbelievably tender! ", "Other places that I've been to have very tough beef which makes it very unenjoyable to eat. ", "As for the Pad Thai, it had a nice kick to it, served with lime and we added chicken to it which made it that much more tasty."], "author": "Gabi D.", "review": "Was in San Francisco craving Thai food and decided to try this restaurant out. When I walked in, my party and I were greeted and sat down within a second! The people that work there are very friendly and welcoming. The ambiance of the place is so beautiful with art pieces all around. It seemed like a very authentic Thai restaurant. I loved how they had candles and flowers on every table.\n\nThe food here is very good and it came out so fast! I got the Pad Thai, basil beef with spicy chili sauce (#33) jasmine rice and a Thai Tea! The food is very flavorful! The beef was the perfect amount of spiciness for me and it was so unbelievably tender! Other places that I've been to have very tough beef which makes it very unenjoyable to eat. As for the Pad Thai, it had a nice kick to it, served with lime and we added chicken to it which made it that much more tasty.", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["I ordered a Thai tea and asked the server if they had wifi. ", "He said, \"no we don't.", "\" ", "Okay that's fine... "], "author": "Cynthia G.", "review": "I live right above this spot. I order to go a lot from here. I really like their Thai ice teas and the lobster sauce asparagus. Other than that there isn't many stand out items on the menu. I wish they would add some more cool additions to the appetizer section. I'm a Pescatarian so I can't speak for their non fish dishes. But from my perspective it's all pretty standard Thai fare. They should add sweet coconut rice to the menu like Burma Superstar does!\n\nUpdate: I'm downgrading this spot to three star. I was locked out of my apartment and went here to lead a quick meeting with my laptop. I ordered a Thai tea and asked the server if they had wifi. He said, \"no we don't.\" Okay that's fine... I pop open my laptop check the wifi connections near by and see a wifi literally the name of their restaurant that is secured. \n\nThat's cold, man. Hella cold.", "rating": 3, "date": "2016-10-05"}, {"excerpts": ["I also found a new item to drink besides water, Thai Tea. ", "It was really good. ", "Orange/Vanilla taste, but not over powering. ", "Nice surprise. "], "author": "Larry H.", "review": "Well, I never have had Thai food and some of my team are vegetarian's so they suggested we go to Manora's. I looked it up and it had decent reviews and I said, what the heck, let's try something new.\n\nFrom the reviews, I expected to be wowed by something. It definitely was not the atmosphere. It is rather small and you are really seated very closely to the next table. So do not go there to talk business secrets :) The one downfall about this place is the atmosphere. With so much hype, I figured it would be pretty cool. However, upon arrival, it was blah and the decor being very outdated. Perhaps it was Thai style and I just didn't get it.\n\nOur server was a total grump! If this was based on service alone, it would get a one star. Very rude and rough during the entire meal and he did not care.\n\nWe ordered our food and I had the BBQ Chicken and the Sate Chicken. The Soup that came with our meal was pretty good , however, the Chicken Sate (chicken on a skewer) was awesome! I also found a new item to drink besides water, Thai Tea. It was really good. Orange/Vanilla taste, but not over powering. Nice surprise. There is no desert which was a slight bummer as I wanted to try some Thai dessert.\n\nAs we were leaving an older bald man with a huge smile waved and said goodbye! Where the heck were you during our meal????? He would have been our rock star server!\n\nOverall, decent food but lacking in atmosphere and 100% no idea of what good service is to their customer!", "rating": 3, "date": "2016-08-15"}, {"excerpts": ["thai iced tea is a must and the fried banana ice cream dessert is a delight. ", "the food and especially the warm service are worth every single penny"], "author": "Thu N.", "review": "crispy fried duck and chef curry are amazing. thai iced tea is a must and the fried banana ice cream dessert is a delight. the food and especially the warm service are worth every single penny", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["We also ordered Thai Iced Tea as well.\n\n"], "author": "Tim G.", "review": "Manora's is a hidden gem tucked away in SOMA. I would never have stumbled upon it if it weren't for the Yelp app on my phone. \n\nGetting here was a real breeze and finding parking was even easier. It wasn't hard to find a 2 hour parking spot less than a block away from the restaurant on a weekday.\n\nThe lunch specials are indeed worth it! I ordered the Kow-Gang Panaeng and it was very filling. I ordered it medium spicy and it wasn't spicy enough so I had to add some extra chili powder. I like my food really hot. My friend ordered the Pad Thai and the ingredients were really fresh. That's really key and I usually avoid Pad Thai due to old bean sprouts at other restaurants. I was pleasantly surprised to find out that the portions were quite large. I highly recommend getting the Pad Thai! We also ordered Thai Iced Tea as well.\n\nWe will be back again and Manora's might turn into our regular lunch spot.", "rating": 4, "date": "2012-06-07"}, {"excerpts": ["Plus, the thai iced tea hits the spot."], "author": "Jennifer W.", "review": "Come here for the lunch specials. You can choose a couple of dishes and have the house fried rice on the side. But the single best part of the lunch combo is the lemon chicken soup. Both the beef and chicken satay are okay, but a little dry. Even though the soup calls to me, I like the noodle dishes. I've tried the pad thai and pad kee mao. I've also had the chicken and fish ball noodle soup. Recently, I also tried the duck served with rice and it was simply delicious. The cuts where big and fatty. Plus, the thai iced tea hits the spot.", "rating": 4, "date": "2015-07-14"}, {"excerpts": ["And the Thai iced tea was yummy. ", "Really pleasant service! ", "We will definitely recommend to our friends who visit and will make a special trip back next time we return to San Fran!"], "author": "Allison W.", "review": "Manora's was recommended to us by the owner of Rumor who said this was the most authentic Thai in the area (he should know- he's from Thailand!). This place did not disappoint. We started with the Larb and the Tom Yung Soup. Both amazing and delicious. For entrees we went with the chicken Pad Thai and the spicy green curry chicken dish. Wow, we were both extremely pleased. The spice is the real deal. And the Thai iced tea was yummy. Really pleasant service! We will definitely recommend to our friends who visit and will make a special trip back next time we return to San Fran!", "rating": 5, "date": "2016-06-01"}, {"excerpts": ["My first Thai Iced Tea...", "Gang Gari Gai, "], "author": "Ronnie S.", "review": "Manora's was the first Thai restaurant I ever experienced. It was located on Mission street ,near 30th St. It was tiny and the decor was clean,humble and quaint.  It was 1988 and I had never heard of Thai food. Being born and raised in San Francisco, I was very familiar with Chinese and Japanese food. Even regional Indian food was easily accessible My best friends mom, Sabina went on a date there and came home raving about the food. Needless to say, we went for lunch the next day. The smells and taste were very fragrant exotic (then) and perfumed my senses. My first Thai Iced Tea...Gang Gari Gai, Tod Mon, Cucumber salad with peanuts...Delicious, I will never forget Manora's. It is a nostalgic place for me. Although there are endless choices for good Thai food in SF...you never forget your first.", "rating": 4, "date": "2017-04-16"}, {"excerpts": ["Also, the server just brought us a bill without asking if we wanted dessert or tea.  ", "It is all in the details.  "], "author": "blaine s.", "review": "Lovely ambience, delicious food, handsomely dresses waitstaff, parking easier than most areas of San Francisco.  Classic Thai - not California fusion Thai that are becoming popular.   It would have been nice if the waitress had offered to change our messy plates after finishing appetizers. We had to ask.  Also, the server just brought us a bill without asking if we wanted dessert or tea.  It is all in the details.  If the restaurant is going to keep its Michelin rating, it must earn it's wings everyday! \n\nAll the food was excellent - just a few details were amiss.", "rating": 4, "date": "2014-07-22"}, {"excerpts": ["The ice tea taste pretty authentic, just watered down. ", "The plates are small in servings, and that stuff that they call fried rice is a joke. ", "The only thing good is that lemon grass soup that comes with the lunch sets."], "author": "M C.", "review": "This is a fairly decent Thai food in the area. The ice tea taste pretty authentic, just watered down. The plates are small in servings, and that stuff that they call fried rice is a joke. The only thing good is that lemon grass soup that comes with the lunch sets.", "rating": 3, "date": "2012-08-26"}, {"excerpts": ["Thai tea is very good.\n\n"], "author": "Elaine C.", "review": "If you're in the mood for Thai food (during lunch), I'd definitely recommend this place.  They've got some pretty good lunch combination specials.\n\nFor about $8.95, you can get yourself 2 items on their lunch menu which comes with a coconut chicken soup (very very yum) and rice.  Large proportions.  The Thai BBQ chicken is awesome and super juicy.  They've also got bbq skewers, angel fish cake and curry on the lunch special menu.  Thai tea is very good.\n\nService is great, decor kind of resembles a nice pub, parking is on the street.", "rating": 3, "date": "2011-01-09"}, {"excerpts": ["So, I opted for Khew-Tew Rad-Na with chicken and Thai Iced Tea. ", "I was craving the chow fun type noodles anyway. ", "I liked the fact that the gravy was a little thinner than usual Rad-Na. ", "I guess because it was a rather hot day, and I did order gravy. "], "author": "Rosie M.", "review": "I walked in with ordering from the lunch specials in mind. Then, I couldn't decide which dish I should have the yellow curry with to compliment the flavors. So, I opted for Khew-Tew Rad-Na with chicken and Thai Iced Tea. I was craving the chow fun type noodles anyway. I liked the fact that the gravy was a little thinner than usual Rad-Na. I guess because it was a rather hot day, and I did order gravy. I was pretty happy with the fact that the portion size was decent for the price. \n\nI will visit again, and update my post. Hopefully, it was just the dish that I ordered. I should try something super common like pad thai.", "rating": 3, "date": "2012-06-13"}, {"excerpts": ["I had the Thai Iced Tea, Lunch Combination of Curry Chicken and Fish Cakes. ", "Happily full when I left."], "author": "Angela L.", "review": "Great Decor and Ambiance- and they have fresh flowers!\n\nI went for lunch and the portions are very generous for the price. Also very well made and fresh. \n\nI had the Thai Iced Tea, Lunch Combination of Curry Chicken and Fish Cakes. Happily full when I left.", "rating": 4, "date": "2012-06-19"}, {"excerpts": ["Apologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\n"], "author": "Vanessa F.", "review": "Food was good, but the service BLEW.\n\nWe made reservations for a party of 8 at 7:30 pm. Turns out a party of 8 came in a few minutes before us and the restaurant gave them our table leaving us to wait about 45 minutes to be seated.\n\nApologies from the restaurant were provided through free soda or thai iced tea about 40 minutes into our wait.\n\nThe meat dish I had of beef and green beans in chili sauce was good. We ordered extra extra spicy... as in \"as spicy as you can make it.\" It wasn't spicy at all. Boo.\n\nThe pad thai was eh. Again, ordered extra spicy but didn't get it.\n\nFor dessert we had the coconut ice cream with fried banana balls. It wasn't cheap and you didn't get very much ice cream or banana balls. They weren't \"balls\" either.\n\nProbably wouldn't go back unless we were meeting friends. There's places closer to home that are better.", "rating": 2, "date": "2009-01-18"}, {"excerpts": ["The thai tea was a wonderful way to cool down the spiciness that I added to the soup with the spice tray. ", "The perfect end to the perfect meal was the mango and sticky rice. ", "Delicious!"], "author": "Madison H.", "review": "Amazing! No other words need be said! The Gai-Tom-Ka soup was the best I have ever had and I am a soup kind of girl!  I can't find another restaurant that even comes close to the awesomeness that they have so artfully mastered. The thai tea was a wonderful way to cool down the spiciness that I added to the soup with the spice tray. The perfect end to the perfect meal was the mango and sticky rice. Delicious!", "rating": 5, "date": "2013-12-24"}, {"excerpts": ["My favorite thing to order here is a long island iced tea or mai tai. ", "The bartender is always the same person and he makes the BEST long island iced tea.  ", "Don't let this drink fool you - it creeps up on you later on!  ", "When you are in the area and looking for a place to eat, check this place out!"], "author": "S L.", "review": "My favorite Thai place to go to when I am in the city!  We had a rehearsal early dinner here for a party of 10 and decided to have it here and we all really enjoyed ourselves.  Staff was very friendly. So many dishes that are delicious and so little time - really liked the beek steak over lettuce with dipping sauce, beef larb, and tom yum soup with shrimp and mushroom.  My favorite thing to order here is a long island iced tea or mai tai. The bartender is always the same person and he makes the BEST long island iced tea.  Don't let this drink fool you - it creeps up on you later on!  When you are in the area and looking for a place to eat, check this place out!", "rating": 5, "date": "2013-06-20"}, {"excerpts": ["The Thai Iced Tea was pretty good, but not as strong as I'd prefer. ", "It was also served with shaved ice, while I prefer ice cubes. "], "author": "Tracy W.", "review": "I was pleasantly surprised when I went to Manora's. And that's an understatement. My boyfriend has been asking me to go for some time, but I never saw an urgency in the matter. And when I approached and entered the restaurant, I thought, hmm, how strange. A Thai restaurant that looks like an English pub?\n\nBut wow! I have to say this was the best Thai food I've ever had. It's true that I only tried 2 dishes there since only 2 of us went, and it's true that I'm not the ultimate authority on quality Thai food; I must say there are some Thai restaurants out there that I know I will not bother to return to unless I really must.\n\nThe Thai Iced Tea was pretty good, but not as strong as I'd prefer. It was also served with shaved ice, while I prefer ice cubes. But that's not really the point of a dinner.\n\nWe started with Tom Kha Gai. Best. Ever. The portion was perfect, and they didn't leave in the ingredients that you can't eat, like galangal, lemon grass, and etc. The soup had a good creamy consistency, with a decent amount of heat. The highlight was the chicken. Oh, the chicken! There were large chunks of it in the soup, cooked so tender that it was falling apart. Yum!\n\nAnd then came the yellow curry with chicken. And yes, the chicken was just as tender as what was in the soup! The portions were great too. We had enough to stuff ourselves with seconds, plus some for leftovers. Some people call that skimpy but I call it the right amount.\n\nI'd definitely return and try other dishes when I'm in the area!", "rating": 5, "date": "2010-12-04"}, {"excerpts": ["Thai iced tea is great, has a touch of chrysanthemum I think, so it's a good indicator that the rest of the menu is good."], "author": "Gregory N.", "review": "This is my go-to Thai restaurant in the city.  The fried fish used to be the best, but sometimes the filets are small and the price has risen.  Curries are still good.  Prices are reasonable for San Francisco.  All my friends love the place, especially out of towners.  Thai iced tea is great, has a touch of chrysanthemum I think, so it's a good indicator that the rest of the menu is good.", "rating": 5, "date": "2013-06-01"}, {"excerpts": ["Thai iced tea next time!\n\n"], "author": "Salernitana A.", "review": "I went here with a friend for dinner, and I actually thought that the place would be awesome since it's in the middle of a not-so-great district. I wanted it to be awesome, and my friend said it was awesome, but I disagree. Overall:\n\n1. The larb is crazy good. We wolfed it down in about three seconds, like how cartoons eat corn on the cob. The basil chicken was also fragrant and yummy.\n\n2. I had the pad thai, which was OK. They didn't pan sear the tofu, they sort of mixed it all in at the last second, and they made it so spicy I well, you don't need to hear that.\n\n3. Their menu says Diet Coke, but all they had was Diet Pepsi. Thai iced tea next time!\n\nOur waiter was very kind and knowledgeable about the menu, and I have definitely had worse Thai. But I've also had way better. Maybe I just ordered the wrong thing.", "rating": 3, "date": "2011-06-06"}, {"excerpts": ["My Thai Ice Tea was too sweet for my taste, but the hubby enjoyed his hot tea.\n\n"], "author": "F. C.", "review": "On our last night in SF, we came for dinner since I wanted Thai Food.  Growing in a house where I get the real thing, you ask why I would pay for such food you ask?  Well, Mom was about 6 hrs away at the time.  But EVERY Thai place I have ever visited, nothing compares to Mom's cooking @ home.  Even my parent's Thai restaurant in Naples, FL doesn't taste the same as if we were eating at home.  That being said, I'll do my best not to be bias & compare it to my Mom's cooking.\n\nSo back to Manora's.  Small place, but very cozy.  Nice decoration, and very attentive wait staff, always a plus.  Our h2o glass were never empty.  My Thai Ice Tea was too sweet for my taste, but the hubby enjoyed his hot tea.\n\nWe started off w/ Por-Pia-Sod (spring rolls filled w/ veggie, pork, chicken, shrimp & it was suppose to have crab, but I didn't taste/see it, top w/ a sweet tamarind sauce).  It was different but good.  Had to use a knife & fork to eat this because it was laid out on a dish w/ the sauce covering it.  I would have prefer the sauce to be on the side so I can dip like how I'm use to eating spring rolls.\n\nI had their Gang-Gari-Gai (yellow chicken curry).  Chicken was very tender & glad they had more chicken & not cheat us w/ putting more potatoes than chicken.  The hubby had the Panaeng-Sam-Ros (combo of crisp chicken, pork & beef deep fried drench in spicy red curry sauce.  Tasted the chicken & it was pretty good, but I didn't taste the other two meats.  From the hubby's empty dish after, I take it that it was good as well.  Hubby can not handle spicy & he was able to eat it, so their spicy probably is suited for the \"white\" tongue.  Which is perfect for him.\n\nAll in all, good food & reasonable price.", "rating": 3, "date": "2011-04-17"}, {"excerpts": ["Not the best Thai food I've had, and the iced tea was pretty awful, not sweet at all.\n\n"], "author": "C L.", "review": "Not the best Thai food I've had, and the iced tea was pretty awful, not sweet at all.\n\nHowever, the waitress was very accommodating.  When my bf tried to order the duck flat noodle soup, she told him that it wasn't on the menu, but she would ask the cook if he could make it.", "rating": 1, "date": "2010-11-17"}, {"excerpts": ["Within 5 minutes of ordering we had our tea drinks, and my hubby had his yummylicious lemon chicken curry soup. ", "Within another 3-4 minutes, my prawns and spicy green curry arrives. ", "Then bam! ", "his fried prawns and yellow chicken curry plate arrives. ", "The lunch special is a steal at $8.95! ", "Portions are substantial. ", "Most of all, the food is how i would imagine it wold be in Thailand, and lilftkd2 is a happy clam. "], "author": "joyce l.", "review": "Oh Manora Thai, how I missed thee....\n\nHow did I forgot about this gem of a Thai place? I suppose when you move to suburbia you forget some of your favorite city haunts.\nThe hubby and I were at city lights and I realized I couldn't think straight because I was starvin' Marvin. So I yelp manora right fast, see it is still rating well and hop across the street.\n\nWithin 5 minutes of ordering we had our tea drinks, and my hubby had his yummylicious lemon chicken curry soup. Within another 3-4 minutes, my prawns and spicy green curry arrives. Then bam! his fried prawns and yellow chicken curry plate arrives. The lunch special is a steal at $8.95! Portions are substantial. Most of all, the food is how i would imagine it wold be in Thailand, and lilftkd2 is a happy clam. Happy wife, happy life (hence hubby is happy too haha)\n\nnot sure if the dinner wait is still long, but my lunch experience was great. \n\nManora Thai, I promise I will be a stranger no more!!", "rating": 5, "date": "2010-08-19"}, {"excerpts": ["The one thing I order at all Thai places upon first visit is the Thai Iced Tea. ", "If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. ", "If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. ", "At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. ", "At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. "], "author": "Tinna H.", "review": "The one thing I order at all Thai places upon first visit is the Thai Iced Tea. If they can make a good Thai Iced Tea, basically setting the tone of my meal, chances are I'll enjoy the experience whether the food or service is phenomenal or not. At Manora's, not only was the Thai Iced Tea spot on, the food was delicious and the service was great. We wandered in rather early for dinnertime, so I suppose the attentive service would have been expected.\n\nWe started out with the Tom Yum Goong [spicy and sour prawns and mushroom soup with a touch of lemon grass in roasted chili aroma]. My oh my, this soup is SPICY! Next time I'll have to ask for one step down in the spice. My sinuses, which have been bothering me for over a week, cleared up instantaneously. The prawns were perfect, probably thrown into the soup at the very last second so that they wouldn't be smooshy. \n\nTo share, we ordered the Gai-Kraprao [sautéed minced chicken in sweet basil and fresh chili garlic sauce] and the Nur-Toon [a combination of beef cubes and spices cooked in mushroom and garlic sauce served in a clay pot]. One dish was a little on the saltier side, perfect for eating with a generous helping of Jasmine rice, which is ~$1 per person. The clay pot was nicely flavored. All portions were generous, and we had to take some food to go.\n\nConsidering the portions [good and plenty], the price [entrees average around $8 to $10], and the service [very attentive early on], I'd eat here again. You know, especially if I happen to be in the neighborhood, shopping at Costco or perhaps for a MINI/BMW, or spending the evening at Butter or Wish nearby.", "rating": 5, "date": "2009-01-22"}, {"excerpts": ["Don't forget Tai iced tea!"], "author": "Megumi C.", "review": "I love Monora's!  Try oyster, mint roll !! Yummmmy!!  \n\nDon't forget Tai iced tea!", "rating": 5, "date": "2009-03-03"}, {"excerpts": ["I have been to many in the bay area and none compare to the thai tea they serve here.  "], "author": "Zeba E.", "review": "This place has the best thai food...I have been to many in the bay area and none compare to the thai tea they serve here.  I think I had the chicken in lobster sauce and it tasted veryyy good.  \n\nIt is not the classiest place so if you are thinking for a first date the restaurant - looks wise is not that impressive.  However, the food is great!", "rating": 5, "date": "2009-09-06"}, {"excerpts": ["Thai Ice Tea an extra 1.50 on top of that. ", "I've never been able to fit dessert ", "so I have no idea even what is offered. ", "Since I always leave there stuffed "], "author": "TiMarie S.", "review": "Well, as a number of folks have pointed out, it is time to lose my \"review\" virginity, so what better place to start than one of my all time favorite restaurants. \n\npro's: A superb, filling meal at an inexpensive price, and great variety.\n\ncon's: Parking can be really tough there and the service, whilst very prompt, is not terribly friendly. Even having been there for years, it often feels like they want you in and out rapidly! The prawns and egg rolls are very very greasy, but there are at least 10 other excellent choices for the combo plate that will thrill you!\n\nThe first time Manora's was recommended to me, I wondered why the hell I wanted to cross town at lunch time for Jewish food. After a brief moment of complete embarrassment, and much laughter by my pals, the distinction was pointed out and off we went.\n\nI think that Manora's is the absolute best lunch place in San Francisco. It started me on my quest for and discovery of Thai food. \n\nThey have a fantastic lunch option where you can choose any 2 of about 12 items for your lunch which also include  Thai Rice (absolutely the best Spanish rice I have ever tasted including a good sized hunk of chicken hidden in the middle)! The meal starts off with the best Tom Kha Gai soup I have ever had. This is basically a Thai chicken soup chock full of chicken, straw mushrooms, bamboo shoots, lemon grass, cilantro, chili oil, chicken broth and coconut milk. It is the most wonderful balance of sweet, savory and spicy I have ever had! \n\nNext your meal is served with your two choices, (I recommend the red beef curry, served in a small bowl on the plate, just hot enough that you have to eat it with a spoonful of rice in order to keep the temperature manageable to me). It amazing how much food  is held in that bowl and I still have one more entree in another bowl on my plate!\nMy second choice sometimes changes but primarily I go for the peppery fried pork which I dip in a sweet and hot sauce served on the side. Their satay is fantastic and their chicken in really tiny bits with fresh basil is also one of my favorites. \n\nFriends have raved over the BBQ chicken, the Pad Thai, and everyone raves about the soup! What can I say. I have actually sent my husband on a trek for just soup to take out when I have been sick and needing some major comfort food. I have trained classes and used the Manora as a catering service and even their take out for 40 people held up fantastically!\n\nFor those who are not interested in the combo plate, there is a page of noodle, chicken and seafood dishes as I recall but why go for one entree when you can  taste a couple of items? \n\nLunch price was about 8.50 and Thai Ice Tea an extra 1.50 on top of that. I've never been able to fit dessert so I have no idea even what is offered. Since I always leave there stuffed I feel the value of the meal  is a heck of a bargain!\n\nI have been to many many Thai restaurants all over the state and up in Canada and still this is my favorite place where I celebrate all my birthdays and any anniversary of note!", "rating": 5, "date": "2006-05-20"}, {"excerpts": ["I asked for a cup of tea not knowing that there is a charge and to come to find out it was $1.75.  ", "The Iced Thai Tea is only $2.00.  ", "How can you charge $1.75 for regular tea.  ", "This is just my beef.  ", "I should have checked the prices before asking for a cup of tea.  \n\n", "The four star goes for the food and friendly service, not the tea."], "author": "Kit K.", "review": "I like to eat at this restaurant.  I come here about once a month and mostly for their Rice noodle soup with chicken and fish ball.  It really hits the spot on a cloudy/rainy/cold day.  The quality is very consistent and the service is friendly. \n\nI will have to admit I was a little annoyed today.  I asked for a cup of tea not knowing that there is a charge and to come to find out it was $1.75.  The Iced Thai Tea is only $2.00.  How can you charge $1.75 for regular tea.  This is just my beef.  I should have checked the prices before asking for a cup of tea.  \n\nThe four star goes for the food and friendly service, not the tea.", "rating": 4, "date": "2012-05-03"}, {"excerpts": ["Perfectly sweetened Thai iced tea.\n\n"], "author": "Liz C.", "review": "Appetizer:  soft shell crab with a lemony dip accompaniment.  \n\nPerfectly sweetened Thai iced tea.\n\nOh, and the other stuff is very good as well.", "rating": 4, "date": "2007-12-10"}, {"excerpts": ["Also, the Thai Ice Tea I tried wasn't that great.\n\n"], "author": "Sam T.", "review": "Manora's combo lunch special is a pretty nice deal. You get a cup of Lemon Chicken Soup and a choice of two items with some Thai Fried Rice.\n\nI ordered the Beef Satay and the Yellow Chicken Curry. The soup was light and refreshing with a generous amount of chicken. The satay was pretty good but the curry was a little light and watery.\n\nAlso, the Thai Ice Tea I tried wasn't that great.\n\nBut all and all a decent meal for about $9. \n\nBut I suggest you should go to Basil Thai instead for better Thai food.", "rating": 3, "date": "2008-06-08"}, {"excerpts": ["Hot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\n"], "author": "Amelia M.", "review": "One of the better Thai Restaurants I have been to in SF. \n\nI have yet to have a bad meal here. It is best when you go in a larger group (just beware of the long wait here if you go at dinner time) so you can try a lot of dishes. I am a huge fan of their Pad Thai... not greasy at all. Something that I tend to find at other Thai establishments.\n\nDishes to try:\n\nKow-Graprao (Minced Chicken)\nKow Pla Muk Pad-Ped (Sauteed Calamari)\nPad-Thai (Noodles)\nPad-See Ew (Pan fried flat noodle)\nFresh Mint Roll (fresh roll with Shrimp)\nBeef Shish-Ka-Bob  \nMoo-Gra-Teiam  (Pork)\nPla-Muk-Pad-Ped (Calamari)\n\nDrinks: \nGreat drinks from the full bar (Cosmos are good here)\nHot tea\nThai Iced Tea\n\nDessert:\n(I always share because after all the food one is just too full!)\nFried Banana Balls with Ice Cream \n\nThe staff is very nice and friendly. Just make sure to have your entire party there. It takes time to get seated. Parking is not too bad as long as it is not too late and people are heading out to the clubs, which will make parking a bit harder in the area.", "rating": 4, "date": "2008-03-19"}, {"excerpts": ["The Thai Ice tea is so yummie. "], "author": "Kitty K.", "review": "Absolute LOVE LOVE LOVE this place! I can't wait for a chance to come back into the city to eat at this place again. The Thai Ice tea is so yummie. The Pad Thai is not dry (which is a very common problem at a lot of Thai places). The Gang-Ped-Ped-Yang (duck in the curry) was absolute fantastic, as was the Gang-Gari-Gai (yellow chicken curry). Their curry has lots of flavor which I greatly enjoyed. The decor is nice and the staff was attentive even though the place was packed. They definitely made a huge fan out of me!", "rating": 5, "date": "2010-05-10"}, {"excerpts": ["We immediately ordered tea and some hot appetizers to warm up.  ", "They brought out our two appetizers within minutes and they were delicious.  "], "author": "Zoe H.", "review": "I have wanted to try Manora for a long time.  Finally, on Sunday, after a long day of couch shopping in SOMA and a craving for Thai, we stopped in Manora.  It was 5:00 and we arrived just as they turned out their lights to start seating for dinner.  The restaurant was initially freezing, probably because they had just opened.  We immediately ordered tea and some hot appetizers to warm up.  They brought out our two appetizers within minutes and they were delicious.  We had the Pirate's Treasure which was a spicy mix of shrimp, chicken, and bean thread sheets and the Vegetarian Delight which was fried tofu and taro.  Both were excellent.  The taro was lightly fried and melted in your mouth.  When we finished our appetizers, the restaurant had warmed up and had almost completely filled up.\n\nFor dinner we ordered Pad Thai, MaKeur-Paad-Prik (Japanese eggplant with prawn, chicken, and pork in a spicy basil garlic sauce), and Goong Ping (charbroiled jumbo prawns served with a spicy lemon garlic sauce).   All three dishes were delicious.  I especially loved the eggplant dish.  The sauce wasn't too heavy and was just spicy enough to give it a kick.  The prawns in the Goong Ping were charbroiled on skewers and the skewers were stuck into an orange so that the shrimp were radiating out of it.  Nice preparation.  The pad thai was one of the better pad thais I've had in the city.  We all had leftovers which is always an added bonus.  I think that sometimes Thai food tastes better the next day after the spices and sauces have been soaked into the meat and veggies.  I look forward to coming back and trying more of the menu!", "rating": 5, "date": "2008-01-24"}, {"excerpts": ["Add a thai iced tea and your out the door for about $10.\n\n"], "author": "Sean B.", "review": "I recently took a job in the area and was looking for a good, affordable lunch alternative in the old SOMA area and found a good one.\n\nI believe you choose two different entrees and it comes with rice and some other stuff and its priced right...around $7-8 bucks. Add a thai iced tea and your out the door for about $10.\n\nFood was good, had a good variety for the lunch combo including BBQ chicken satay, different types of curry and even a spicey chicken dish. \n\nAll and All probably one of the best places if your work in SOMA near Holy Cow and Butter area unless you want a $2 Costco dog.", "rating": 4, "date": "2008-11-24"}, {"excerpts": ["everyone who has always say that the Thai Ice Tea is the best.  ", "Not an iced-tea drinker, but everyone has their likes and dis-likes.\n\n"], "author": "Benjamin B.", "review": "Tom-Ka-Talay - Or known as Tom-Ka-Guy (that is how it is pronounced), and it is the best coconut milk soup I have ever had.  Delicious!  I love the button mushrooms and chicken soaking away... mmm.\n\nThe crunchy bean sprouts in the pad-thai makes this dish exquisite.  The Gang-Gari-Gai and Satay is also something to try.  I have never had, but everyone who has always say that the Thai Ice Tea is the best.  Not an iced-tea drinker, but everyone has their likes and dis-likes.\n\nI also like the very large single stem flowers adorned on the table... very large.", "rating": 3, "date": "2007-06-03"}, {"excerpts": ["One, the server was rather terse overall and additionally seemed annoyed when we asked for an off menu item, and Two, the tea cups are small (but the tea is very good) and if you want a refill you have to keep asking them to come back and fill up your cup otherwise you will sit there with an empty cup in front of you.\n", "Recommended for the food, not for the service."], "author": "Gregg C.", "review": "Went for dinner with a party of five. Food taste, quality and price is a solid Four Stars. Service on the other hand was Two Stars - very prompt but lacking in two areas: One, the server was rather terse overall and additionally seemed annoyed when we asked for an off menu item, and Two, the tea cups are small (but the tea is very good) and if you want a refill you have to keep asking them to come back and fill up your cup otherwise you will sit there with an empty cup in front of you.\nRecommended for the food, not for the service.", "rating": 3, "date": "2011-03-07"}, {"excerpts": ["all of us had the best Thai iced tea ever...", "it was not too sweet so its perfect. "], "author": "Rika K.", "review": "Last night the 3 of us had 4 entree plates and we literally scarfed them down n it was gone within 20 minutes! it was by far the fastest meal I've ever had in a restaurant. first of all let me say that I was introduced to Manora by my caucasian boss =) I was surprised that this restaurant turned out really good! all of us had the best Thai iced tea ever...it was not too sweet so its perfect. then we ordered the Pad thai, thin sliced garlic bbq pork, crispy duck and filet fish with ginger sauce. it was soo amazing and this place became one of my favorite Thai restaurant in the city. if u ordered the foods that we ordered then u will get what I mean by one of the BEST Thai restaurant in the city....", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["We started with some hot tea, which was amazing! ", "It was a red thai tea blend and smelled and tasted fabulous. ", "We had the Yum ", "Hed appetizer (combination of various types of mushrooms, prawn, and chicken in Thai spices, laid on a bed of greens), which was very good. ", "It actually started sweet then went to spicy as we kept eating. ", "Great flavor combination. "], "author": "Amy B.", "review": "Wow. Who knew this little place could pack such a punch! We happened to be in the neighborhood and were starving around 9:30pm. Manora's was open, so Manora's it was! I loved the decor and the authenticity as soon as we walked in.\n\nWe started with some hot tea, which was amazing! It was a red thai tea blend and smelled and tasted fabulous. We had the Yum Hed appetizer (combination of various types of mushrooms, prawn, and chicken in Thai spices, laid on a bed of greens), which was very good. It actually started sweet then went to spicy as we kept eating. Great flavor combination. We then shared 2 of the \"Chef's favorites\" dishes: the Pooket Skewer and the MaKeur-Paad-Prik. Now, I don't really like things too spicy, and I've never seen a server seem so disappointed and personally offended by me asking for something mild. I was a little perturbed by that, but the taste of the dishes easily made up for it. The skewers--with charbroiled scallop, prawn, fish, and vegetables with yummy dips--was amazing. And the Japanese eggplant in the other dish was perfectly done. My only real complaint is that they do not have brown rice, so we went with the jasmine rice, which was also really good. \n\nOf course, you can't have Thai food without having some mango with sticky rice, so indeed we ordered that as well. \n\nThe presentation, taste, service, and ambiance all surpassed my expectations for a corner place that was going to ease my late-night starvation. I will definitely be back!", "rating": 4, "date": "2009-11-22"}, {"excerpts": ["Everything was wonderful, with the exception of the quail dish (can't bring myself to eat the State bird) and the Thai Ice Tea could have been better, I think I like those for the cream content, anyway."], "author": "Margaret R.", "review": "Great Thai food.  Food was outstanding. Everything was wonderful, with the exception of the quail dish (can't bring myself to eat the State bird) and the Thai Ice Tea could have been better, I think I like those for the cream content, anyway.", "rating": 5, "date": "2010-07-20"}, {"excerpts": ["I crave that on a daily basis, oh that and the thai iced tea ", ":)  ", "Parking is kind of a hassle though if you're trying to go for dinner."], "author": "Marina K.", "review": "I love how cheap this place is. MUST get the glass noodles. I crave that on a daily basis, oh that and the thai iced tea :)  Parking is kind of a hassle though if you're trying to go for dinner.", "rating": 4, "date": "2005-05-13"}, {"excerpts": ["The thai iced tea will blow your mind and the wait staff are very pleasant."], "author": "Allison K.", "review": "Good Thai food found with the help of Yelp!  Delicious appy and the meal was just what the doctor ordered since I was starved.  I wish I had room for mango/sticky ride but the portions here were surprisingly large.  The thai iced tea will blow your mind and the wait staff are very pleasant.", "rating": 4, "date": "2006-03-10"}, {"excerpts": ["The only thing bad was that their thai iced tea is always too watery. ", "So the food is great. ", "The drinks, not so much"], "author": "jess w.", "review": "The food was pretty good! I've came here multiple times for lunch and always get the lunch combination. It's a sweet deal because it comes with rice and coconut soup too! The only thing bad was that their thai iced tea is always too watery. So the food is great. The drinks, not so much", "rating": 3, "date": "2011-12-05"}, {"excerpts": ["so I ordered a cup of tea. ", "The best hot thai tea I've ever had in my life. ", "Then my friend and I ordered the tom yum soup, the pirate treasurer as an appetizer, the chxn w chili, and basil hot sauce and the curry beef. ", "All really good and flavorful. ", "But I must say the beef was just a bit too stewy for our taste. ", "After all we ate, and having tons of leftovers, our bill came out to only $50 for 2 people! ", "I will definitely be back again soon."], "author": "Caroliina F.", "review": "This is my 2nd time here and I was happy that it was just as good or actually even better then my 1st experience. Wasn't in the mood to drink wine so I ordered a cup of tea. The best hot thai tea I've ever had in my life. Then my friend and I ordered the tom yum soup, the pirate treasurer as an appetizer, the chxn w chili, and basil hot sauce and the curry beef. All really good and flavorful. But I must say the beef was just a bit too stewy for our taste. After all we ate, and having tons of leftovers, our bill came out to only $50 for 2 people! I will definitely be back again soon.", "rating": 4, "date": "2009-04-09"}], "juice": [], "mineral water": [], "kow naped lunch": [], "kowmon kai lunch": [], "kowgraprao lunch": [], "kow moogratieam lunch": [], "kow pla muk padped lunch": [], "kow padtalay lunch": [], "kowgangkiewwan lunch": [], "kowgang panaeng lunch": [], "kowradna lunch": [], "kow mongaiyang and somtum lunch": [], "kow padgaitod lunch": [], "padthai lunch": [], "khewtew nursub lunch": [], "khewtew radna lunch": [], "padsee ew lunch": [], "khew tew nurtoon lunch": [], "khew tewkai lunch": [], "satay lunch combination": [], "garlic pork lunch combination": [], "todman lunch combination": [], "porpiatod lunch combination": [], "gaiyang lunch combination": [], "ganggari lunch combination": [], "panaengnur lunch combination": [], "gaigraprao lunch combination": [], "goongtod lunch combination": [], "nurtoon lunch combination": [], "nurpadpik lunch combination": []}