{"oz aqua panna sparkling water": [], "oz san pellegrino sparkling water": [], "italian soda": [{"excerpts": ["Pair it with an Italian soda and finish the meal off with some Italian espresso. "], "author": "Laurel P.", "review": "Lasagna! Who doesn't love lasagna? Anything with layers of pasta, hearty fillings and cheesy toppings and I'm sold. Well lucky me, I've found this father- son, hole-in-the-wall business specializing in making lasagna. \n\nI was fortunate to try two different kinds; the mushroom lasagna and bolognese. Both def tasted different but had very good, hearty flavors. It's a reasonable portion- not too heavy but leaves you full and satisfied. Pair it with an Italian soda and finish the meal off with some Italian espresso. Mmmm!\n\nAlso it makes for a good late night munchie. \n\nLocated in the new and developing dog patch area, it's close to cal train so if you ever feel the need to get some comfort food like this here lasagna, hop off, walk a couple blocks and you'll be happy that you did.", "rating": 5, "date": "2014-06-11"}], "oz prepared soup": [], "soup of the day": [], "mediterraneo salad": [{"excerpts": ["My friends had the Marcella panini and Mediterraneo salad. ", "Both looked and smelled great ", "but I needed a little more substance come mid-afternoon during a long workday. ", "I wouldn't come here for lunch if you're starving, but if you need a luxurious lunch and don't want to spend more than $10-12, here's your spot."], "author": "Jon S.", "review": "Haven't tried the lasagna yet but the Pacifica baguette is delicious. For a smaller-sized baguette, they are generous with the serving of local salmon and the clerk told me it was slow cured in-house (whatever that means!). The staff is very nice and friendly and demonstrates great service, even to those like myself sitting outside on a beautiful weekday afternoon in the Dogpatch.\n\nMy friends had the Marcella panini and Mediterraneo salad. Both looked and smelled great but I needed a little more substance come mid-afternoon during a long workday. I wouldn't come here for lunch if you're starving, but if you need a luxurious lunch and don't want to spend more than $10-12, here's your spot.", "rating": 4, "date": "2013-04-11"}], "caprese salad": [{"excerpts": ["so I ordered the Caprese salad and the Ravioli al Tartufo. \n\n"], "author": "Celia T.", "review": "Storytime: I first came here back in January. I was on a college trip from Boston and had a very carefully planned itinerary (a group of us were in the Bay area to tour tech companies/startups and such) so we ended up in Dogpatch for one visit. I was looking for a place to get lunch and it was during an absolute downpour. Yelp seemed to like this place, so I figured I'd give it a try, and boy am I glad I did. First of all, they immediately sat me and were incredibly nice, which was very comforting being by myself and coming in from the rain. I was pretty hungry so I ordered the Caprese salad and the Ravioli al Tartufo. \n\nCaprese - The ingredients were clearly very fresh, and having the greens tossed in EVOO was great - I'm personally not a huge fan of balsamic with Caprese so it was a nice touch, along with the oregano on the mozzarella.\nRavioli - I tried so hard not to inhale it and savor it as much as I could because it was SO GOOD and extremely comforting on a cool, rainy day. The pasta itself was wonderful and the black truffle sauce was amazing with it. **Pro tip** if you get bread, use it to soak up any leftover sauce after you finish the pasta. \n\nEverything I had here was fantastic - even the bread! Also, the owners were so genuinely nice and took care of me very attentively. But the craziest part of all this? I just came back here again about a month ago and ordered the same thing, and they remembered me from my order! It had been 9 MONTHS since I first went there and they still remembered me. Amazing.\n\nTL;DR it may not be fancy, but the ingredients are fresh, the food is perfectly prepared, and the people are wonderful. A winning combination as far as I'm concerned.", "rating": 5, "date": "2017-11-01"}, {"excerpts": ["Their pasta dishes are yummy and I got the caprese salad "], "author": "Viyada S.", "review": "This place is great for homemade lasagna in a variety of flavors. You can get meat lasagna or veggie lasagna. A tomato based lasagna or indulge in the creamy bianca lasagna. There are so many delicious choices! The lasagnas are premade and cut and heated to order.\n\nTheir pasta dishes are yummy and I got the caprese salad and you get a big ball of burrata cheese!!!!\n\nMy only gripe is that it is salty for me. I'm really sensitive about salt so I can taste a dish when the salt is over used. So I don't go as often. But I'm sure I could ask no salt for the non lasagna dishes.", "rating": 4, "date": "2015-06-24"}, {"excerpts": ["My favorites are the caprese salad sans greens (just the traditional style with fresh basel and tomatoes), abruzzo and verdure lasagnas and the carbonara.  ", "Must go to this place!"], "author": "Adam S.", "review": "Best authentic Italian in town.  My favorites are the caprese salad sans greens (just the traditional style with fresh basel and tomatoes), abruzzo and verdure lasagnas and the carbonara.  Must go to this place!", "rating": 5, "date": "2017-04-05"}, {"excerpts": ["We started with a caprese salad, as an uncooked dish, ingredients are everything.  ", "I expected a healthy number of beefsteak tomatoes, basil and mozzarella.  ", "The tomatoes were overly soft and tasteless.  ", "The mozzarella was not fresh and did not have any taste.  ", "There were just 4 slices of tomatoes and 2 basil leaves served on a paper plate.  "], "author": "Na H.", "review": "After spending three weeks in Italy this year, I was excited to run into Marcella's this Friday for a late lunch.  It's casual family owned which is exciting to visit and support.  We started with a caprese salad, as an uncooked dish, ingredients are everything.  I expected a healthy number of beefsteak tomatoes, basil and mozzarella.  The tomatoes were overly soft and tasteless.  The mozzarella was not fresh and did not have any taste.  There were just 4 slices of tomatoes and 2 basil leaves served on a paper plate.  I ordered Bolognese lasagna and my dining companion ordered penne puttanesca but they were out of penne so substituted with spaghetti.  My lasagna was not edible, lacked life, reminded me with frozen section heated a few times.  On to the puttanesca, it was supposed to be a pungently delicious dish except pasta was not made that day.  It had an overpowering taste of anchovies and lacked ingredients specifically olives but we succcessfully found about 6 capers.  On a positive note, the owners son had high integrity and did not charge us.", "rating": 2, "date": "2017-06-10"}, {"excerpts": ["Really great caprese salad was perfect when every place In sf is using bad tomatoes they seem to have found the last good one! ", "What a nice ball of mozzarella!! ", "It was amazing.\n", "Lasagna mushroom was good a little cool in spots which is fine... ", "The owners are both very charming. ", "Will be back"], "author": "Emily M.", "review": "So perfect easy lasagna. Really great caprese salad was perfect when every place In sf is using bad tomatoes they seem to have found the last good one! What a nice ball of mozzarella!! It was amazing.\nLasagna mushroom was good a little cool in spots which is fine... The owners are both very charming. Will be back", "rating": 4, "date": "2014-01-22"}, {"excerpts": ["My colleague has the caprese salad which appears to have been served with freshly imported burrata."], "author": "Scott K.", "review": "Small neighborhood trattoria of sorts. Everything made fresh each day. I'm not a fan of lasagna but the owner assured me that it wasn't like any other. No ricotta which is a good thing for me. I ordered the eggplant lasagna. Several layers of the thinnest freshly made pasta sheets accompanied by bechamel and a red sauce with eggplant throughout all held together with mozzarella. It happened to be the best lasagna I've ever had!  My colleague has the caprese salad which appears to have been served with freshly imported burrata.", "rating": 5, "date": "2014-06-25"}, {"excerpts": ["Very pleased with the meal; ordered Chicken Rigatoni paired with Caprese Salad, both of which had great distinguishing flavor as well as a remarkable freshness. "], "author": "Lorena C.", "review": "Truly, an authentic Italian meal and pleasant experience overall from food to service! Very pleased with the meal; ordered Chicken Rigatoni paired with Caprese Salad, both of which had great distinguishing flavor as well as a remarkable freshness. The gentleman who assisted (our) table, John Franco, did a phenomenal job touring me and my brother through the menu, recommending the Rigatoni con Pollo which includes chardonnay sauté that he made from scratch earlier that day. It turned out a great choice as it watered in my mouth, very \"al dente\" like true Italian pasta should be and amazingly delicious! For dessert we enjoyed a scoop of gelato each which by the great flavor and smooth consistency one can spot it to be the real thing-By far, the best artesian-made gelato I've had, paired with a made-from-scratch biscotti, Y-U-M! John Franco suggested a limoncello to top off the meal which did us a great deal in our tum tums to bring the good food flowing down nicely; a satisfying after feel. Aside from a great authentic Italian meal, I absolutely grew fond of our server John Franco who made the experience from sitting to closing the meal an all around delightful experience for me and my brother. John Franco has a wonderful, witty, all-giving personality which is a complement to the great food. Rarely do me and my brother encounter service derived from the heart like Franco's. He was an outstanding server! Definitely will come back for the awesome food and to experience his service all over again.", "rating": 5, "date": "2015-11-02"}, {"excerpts": ["And the caprese salad is also on point. "], "author": "Jessica W.", "review": "I've worked in the Dogpatch for 2 years, and this is one of my all-time neighborhood favorites for lunch. Family-owned, daily specials, everything freshly made, super friendly service. \n\nMy favorites are the pesto and butternut squash lasagnas. Totally worth breaking my no-carb diet for. And the caprese salad is also on point. I've also tried a couple daily specials, which range from pastas to lasagnas to meat/fish dishes, that were very good.\n\nPro-tips: \"Like\" their Facebook page to receive DAILY UPDATES on the daily specials. They also do catering! They did our office (150+ people) a few times and it was amazing. I may or may not have brought a 3/4 eaten tray of lasagna home for further consumption....", "rating": 5, "date": "2014-09-29"}, {"excerpts": ["I also tried there caprese salad which was fabulous as well ", "it had a great ball of mozzarella inside of it along with very fresh tomatoes and a great dressing to accompany it."], "author": "Michael W.", "review": "This place has the best lasagna! Not a lot of people even know this place is around I found out about it from family bringing over leftovers and as soon as I had it I was hooked!\nThe lasagna has a great Italian sausage in it and is so fresh. I also tried there caprese salad which was fabulous as well it had a great ball of mozzarella inside of it along with very fresh tomatoes and a great dressing to accompany it.", "rating": 4, "date": "2014-05-20"}, {"excerpts": ["I had an excellent Caprese salad, and the most life-changing baked ziti.  ", "Two glasses of Chianti, and I am ready to move to Dogpatch."], "author": "Jack H.", "review": "Okay, the food alone merits a 5-star review.  Mossimo has love in his cuisine.  I had an excellent Caprese salad, and the most life-changing baked ziti.  Two glasses of Chianti, and I am ready to move to Dogpatch.", "rating": 5, "date": "2012-10-12"}, {"excerpts": ["A caprese salad and order of lasagna were plenty for two of us. \n\n"], "author": "Nancy W.", "review": "We just stumbled into Marcella's yesterday, had never heard of it before.   We were hungry and it was the closest restaurant.  What a happy surprise. \n\nA caprese salad and order of lasagna were plenty for two of us. \n\nThe salad: anybody can match the greens,they were fresh and good.  The tomatoes:  I can do better in Sacramento from my backyard plants or the farmer's market, but oh, the cheese.  It is real, fresh, buffalo mozzarella flown in from Puglia.  We don't have anything that matches that flavor. It is mild, but the flavor blooms in your mouth and is just different and lovely.  The salad dressing is mild so it doesn't overwhelm the cheese, that great big ball of cheese. Really, it's plenty for two. \n\nWe shared a huge hunk of the  Abruzzo lasagna. My husband likes heartier food and I feared the \"sausage\" would be big and greasy.  Not so. It is finely ground fresh pork gently spiced with salt and pepper and fennel. The \"sausage\" mixed with sauce and layered with the impossibly thin pasta was delicious.  It wasn't greasy or heavy, just perfect with a salad.  The flavors are subtle and so balanced.  \n\nMas and Gianfranco are friendly and happy to talk about their food.  We loved it and will be finding more excuses to go to SF for lunch. We'll  bring a cooler next time to take food home.\n\nThis family owned and run place is a gem.", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["The caprese salad was outstanding! ", "The buffalo mozzarella could not have been any more fresh! ", "Service and hospitality from the owners was a 10 out of 5 stars! ", "I highly recommend!"], "author": "Britt B.", "review": "It was our first time here so we tried a little bit of everything. The lasagna and pasta specials were unbelievable!!! The lasagna melted in your mouth! The caprese salad was outstanding! The buffalo mozzarella could not have been any more fresh! Service and hospitality from the owners was a 10 out of 5 stars! I highly recommend!", "rating": 5, "date": "2015-07-02"}, {"excerpts": ["I treat myself once a week to their AMAZING caprese salad! ", "In between my weekly lunch I crave the mozzarella! ", "This charming family owned and ran business has been around Dogpatch for years and it a hidden gem! ", "The vibe of the restaurant is really casual but perfect for lunch meeting. ", "The black truffle ravioli is to die for as well!!"], "author": "Michelle c.", "review": "I absolutely love this spot! Everything about it! I treat myself once a week to their AMAZING caprese salad! In between my weekly lunch I crave the mozzarella! This charming family owned and ran business has been around Dogpatch for years and it a hidden gem! The vibe of the restaurant is really casual but perfect for lunch meeting. The black truffle ravioli is to die for as well!!", "rating": 5, "date": "2014-08-12"}], "caesar salad with grilled chicken": [], "ceasar salad": [], "insalata fresca": [{"excerpts": ["It made me curious what the others tasted like, but I behaved and simply ordered the $4.50 Insalata Fresca as a side. ", "The salad was just a mix of organic greens with a couple of tomato slices on top and tossed in a sweet housemade balsamic dressing (photo: http://bit.ly/16lrYLC). ", "The salad was a wise contrast to the richness of the lasagna. ", "Massimo obviously knows what he's doing since he's had his business for twenty years, although the sparse cafe itself is barely a year old. "], "author": "Ed U.", "review": "This isn't your mother's lasagna or at least my mother's lasagna since I don't know your mother, even though I'm sure she's a lovely woman. Actually my mother didn't make homemade lasagna. She defrosted Stouffer's Family Style Lasagna with Meat and Sauce, and that's how my lasagna expectations were set. Ultra thick noodles with ruffled edges layered on top of each other with ground beef, mozzarella cheese and tomato sauce in between. I liked it so much I made my own version for college potlucks. I only knew how to make lasagna and key lime pie.\n\nThat was my entire cooking repertoire as a Berkeley undergrad. But I digress since chef Massimo Di Sciullo creates his own unique version quite unlike what I've experienced. First, the handmade pasta is extremely thin like tissue paper. Six layers of this pasta are piled on top of each with three cheeses in between - not only mozzarella but also Parmigiano Reggiano and bechamel - and six variations of fillings and toppings in separate trays in the display case (photo: http://bit.ly/ZTa52W). The net result looked less like traditional lasagna and more like a savory baklava with layers upon layers of filo dough.\n\nI naively asked if I could have half-orders of two different kinds thinking I was at Humphry Slocombe negotiating between scoops of Secret Breakfast and Blue Bottle Vietnamese Coffee for the price of a single cone. In a halting Sophie's Choice-like moment, I finally decided to try a sizable $9.75 piece of the Verdura Lasagna with fresh pesto, diced zucchini and sun-dried tomatoes (photo: http://bit.ly/10yhvd8). It was quite good, different and fresh-tasting even if it was a tad oily from the pesto. I liked the crunch of the zucchini mixed with what I believe were remnants of pine nuts. Delicious comfort food.\n\nIt made me curious what the others tasted like, but I behaved and simply ordered the $4.50 Insalata Fresca as a side. The salad was just a mix of organic greens with a couple of tomato slices on top and tossed in a sweet housemade balsamic dressing (photo: http://bit.ly/16lrYLC). The salad was a wise contrast to the richness of the lasagna. Massimo obviously knows what he's doing since he's had his business for twenty years, although the sparse cafe itself is barely a year old. The limited hours - closed on weekends and only only until 6:30PM otherwise - make it less convenient for anyone outside of Dogpatch, but if you do feel that cough coming on (hack-hack), maybe you can leave work a little early.\n\nFOOD - 4 stars...artisan lasagna...who knew?\nAMBIANCE - 3 stars..simple cafe set-up, no big whoop (photo: http://bit.ly/12ijq3W)\nSERVICE - 3.5 stars...pretty attentive\nTOTAL - 4 stars...quite a different pasta worth trying if you can make it before it closes", "rating": 4, "date": "2013-05-10"}], "abruzzo lasagna": [{"excerpts": [", the son of the owner recommended the Abruzzo Lasagna w/ housemade Italian sausage, spicy tomato sauce ($14.50): ", "My Abruzzo lasagna arrived bubbling hot with crisp, caramelized edges of cheese which I enjoy. ", "There was a good ratio of melty cheese, sausage crumbles, and robust tomato sauce (wasn't spicy). ", "However, because the noodles are thin, they're very soft. ", "I like my noodles with a bite. "], "author": "Cherylynn N.", "review": "On my way to work today, I was listening to another installment of Star 101's Second Date Update on. A lady called in because her date hasn't been responsive after their first lunch date. She thought they had a great date but he has only responded to her texts with emojis. \n\nThe hosts call the guy up and he said, he would never go on a date with her again. Apparently, she had one too many margaritas (he lost count after three) and she became sloppy - slurring her words and spitting on him. She even did kickboxing AND karate outside the restaurant on Burlingame Avenue!\n\nDAAAAMN GUURRRL, you sure know how to party...and it's only 1 pm! Hmmm, what happens at midnight?! \n\nWell, if they went to Marcella's Lasagneria for their lunch date, there wouldn't have been any drunken shenanigans and perhaps even a second date! \n\nMarcella's Lasagneria is a cute, old skool Italian eatery (café-sized) serving a myriad of housemade lasagnas and pastas. Both are available by the tray with a 24 hour advanced order. No hard liquor so there's no chance of getting sloppy. \n\nThey also bottle their own sauces and aiolis that are available for purchase.\n\nThe only drawback is their very limited hours. They're only open on the weekdays from 11:30 am - 4:30 pm so it's taken me 6 years to finally pay a visit. \n\n(Per their website, the full menu is available until 3:30 pm, then it's pick-up/to-go for lasagna only until 4:30 pm.) \n\nTo my surprise, it's pretty much full service expect you pay at the counter when you're done eating. \n\nEverything sounded great on the menu but I knew it would be a long time before I could return so for my first time, the son of the owner recommended the Abruzzo Lasagna w/ housemade Italian sausage, spicy tomato sauce ($14.50): https://bit.ly/2joX3Jm which comes with a side salad. \n\nThe lasagna they serve here is unique, it's six very thin layers of noodles with melty cheese, béchamel, and your choice of filling (sausage, mushrooms, eggplant, bolognese, butternut squash, etc). \n\nMy Abruzzo lasagna arrived bubbling hot with crisp, caramelized edges of cheese which I enjoy. There was a good ratio of melty cheese, sausage crumbles, and robust tomato sauce (wasn't spicy). However, because the noodles are thin, they're very soft. I like my noodles with a bite. Nonetheless, it was a very satisfying meal and I took the leftovers home to enjoy for dinner. \n\nThe father-son owners are super warm and friendly. The lasagna took over 15 minutes to warm up so do say, yes (!) to the complimentary bread accompanied with olive oil and balsamic vinegar for dipping.\n\nVery casual atmosphere with a handful of tables inside. The dog-friendly outdoor seating is quaint and is perfect for a lunch date.   \n \nI can see why Marcella's Lasagneria is a neighborhood favorite - warm service, good lasagnas, and reasonably priced. I must return to try their ravioli with black truffle sauce - I just hope it doesn't take me another 6 years.", "rating": 4, "date": "2018-05-03"}, {"excerpts": ["ABRUZZO lasagna (w/spicy Italian sausage)- ", "This lasagna was really good. ", "It wasn't too spicy and the sweetness from the carrot really balanced it out. \n", "2. ", "BOLOGNESE (w/ beef ", "sauce)- ", "This was my personal favorite! ", "The flavors were very well balanced and reminiscent of a traditional lasagna without the awful texture from Ricotta cheese. ", "I loved that there weren't too many textures going on ", "but it wasn't completely mush either. ", "I would definitely recommend this. \n", "*"], "author": "Katherine C.", "review": "Visited 5/12/17 \n(near closing time)\n\nWOW! I am not a lasagna person- I've never really liked it and would definitely not go out of my way to get it, but Marcella's Lasagneria changed my opinion on lasagna completely. \n\nI ordered the:\n1. ABRUZZO lasagna (w/spicy Italian sausage)- This lasagna was really good. It wasn't too spicy and the sweetness from the carrot really balanced it out. \n2. BOLOGNESE (w/ beef sauce)- This was my personal favorite! The flavors were very well balanced and reminiscent of a traditional lasagna without the awful texture from Ricotta cheese. I loved that there weren't too many textures going on but it wasn't completely mush either. I would definitely recommend this. \n*I took the Bolognese lasagna home to reheat the following day and it was equally as delicious! \n\nI would really like to return and try some of the other items on the menu, which all sounded really good. Their exceptional service and friendliness along with food that could draw people from miles away makes it a restaurant that I would recommend to anyone without reservation!", "rating": 5, "date": "2017-05-14"}, {"excerpts": ["The Abruzzo lasagna was cheesy and the sausage had amazing flavors of fennel. ", "Loved every bite and will definitely be back!"], "author": "Jenna J.", "review": "The lasagna and fettuccine were out of this world good. The Abruzzo lasagna was cheesy and the sausage had amazing flavors of fennel. Loved every bite and will definitely be back!", "rating": 5, "date": "2018-02-22"}, {"excerpts": ["Coming in after regular lunch hours, I ended up ordering their abruzzo lasagna, which came out piping hot about ten or fifteen minutes later. "], "author": "Johnny W.", "review": "I've been meaning to try Marcella's... pretty much ever since I moved to the neighborhood. This proved to be fairly difficult, given that they're only open during work hours, and, well, I usually work. But! Thanks to a concussion I received a few weeks back, I ended up getting to finally try their oh-so-famous lasagna during one of my rest days.\n\nComing in after regular lunch hours, I ended up ordering their abruzzo lasagna, which came out piping hot about ten or fifteen minutes later. For a little under $9, you get a pretty solid, filling slice of tasty, crispy lasagna - though they also have pastas and other dishes (along with daily specials) to try as well.\n\nChatting it up a bit with the owner's son at the end, I found out that everything they have is handmade the day of, which is largely why they limit their hours: they really need the downtime to rest! That said, they have actually been considering expanding into the weekend, but that's still a bit up in the air at the moment.\n\n***Accessibility Info***\n\nVenue - A fairly tiny space, with maybe 10 tables inside. Accessible, sort of: the tables are hard to seat at because the style of table legs prevents you from scooting in completely, and the shape of the shop means that only a percentage of the tables are actually suitable for wheelchair positioning.\n\nBathroom - Didn't check them out.", "rating": 4, "date": "2014-07-14"}, {"excerpts": ["After thinking about what lasagna to go with I decided to try the Abruzzo Lasagna.  ", "Can't go wrong with Italian sausage and spicy tomato sauce.  ", "So while we waiting they brought out some bread with some awesome dipping oil.  ", "Lasagna comes out and I start digging in ", "and I felt like I had those butterflies in my stomach....", "the kind of feeling like when your childhood crush comes up to you and says hi.  ", "I somehow managed to put down the whole thing, and I regret nothing.  ", "Only thing I wish I would have done is to order one to go so I could eat another for lunch today.  ", "This place is a must try!"], "author": "Scott T.", "review": "Luckily, the chef and his wife happened to have an appointment at my work and we found out about this place.  We quickly looked up their restaurant on Yelp and I knew I would need to try this place out.  After drooling over the pictures for a couple days I finally had a day off to give this place a go.\n\nThe place is small, might not look fancy but the food more than makes up for it.  After thinking about what lasagna to go with I decided to try the Abruzzo Lasagna.  Can't go wrong with Italian sausage and spicy tomato sauce.  So while we waiting they brought out some bread with some awesome dipping oil.  Lasagna comes out and I start digging in and I felt like I had those butterflies in my stomach....the kind of feeling like when your childhood crush comes up to you and says hi.  I somehow managed to put down the whole thing, and I regret nothing.  Only thing I wish I would have done is to order one to go so I could eat another for lunch today.  This place is a must try!", "rating": 5, "date": "2016-12-17"}, {"excerpts": ["* Abruzzo lasagna - 4 stars\npic: http://www.yelp.com/biz_photos/marcellas-lasagneria-and-cucina-san-francisco?select=schFBKL3eMqKqoW1fQ-6eA#LAiqOHszzUFt7FK-zg5oHQ\nReally great! ", "To my point above, the meat one tasted much better, and there was a lot of it! ", "The texture was very soft, the tangy tomato sauce was really flavorful, and the pasta was great."], "author": "Ziyan C.", "review": "What a super sweet staff! They are totally down to earth & pleasant, a little bumbling but in a totally cute way (the son started us off at our table. The dad came out and took our order. Then the son came out to take our order and then laughed at his mistake).\n\nI think you're supposed to order at the counter and I honestly wasn't expecting table service, but they treated us very grandly for such a local, small, family-owned spot. They have very hearty, soft pasta, and even if it is reheated for our meal, I couldn't tell - it tasted so dang good!\n\nCost: $13 for a single serving with tax/tip.\n\nWait: None on a Thursday lunch at 12:30pm. It was a gloomy day so I imagine a little less traffic than normal, but there was a constant flow of customers at the counter and the other tables.\n\n* Butternut lasagna - 3.5 stars\npic: http://www.yelp.com/biz_photos/marcellas-lasagneria-and-cucina-san-francisco?select=schFBKL3eMqKqoW1fQ-6eA#schFBKL3eMqKqoW1fQ-6eA\nI just love butternut squash and had to get this - while all the components were great and this was really unique, to be honest I think squash just doesn't go well with lasagna. After trying this (and nothing against them, I imagine this is as good as butternut lasagna is going to get!), I realize that meat just tastes better in lasagna, is more hearty, and the flavors pair better w/ the tomato sauce. Of course, the actual pasta itself in this dish was great.\n\n* Abruzzo lasagna - 4 stars\npic: http://www.yelp.com/biz_photos/marcellas-lasagneria-and-cucina-san-francisco?select=schFBKL3eMqKqoW1fQ-6eA#LAiqOHszzUFt7FK-zg5oHQ\nReally great! To my point above, the meat one tasted much better, and there was a lot of it! The texture was very soft, the tangy tomato sauce was really flavorful, and the pasta was great.", "rating": 4, "date": "2013-11-28"}, {"excerpts": ["Abruzzo lasagna and Penne Puttanesca pasta with mushrooms was amazing.  ", "The pasta was al-dente.  ", "The combination of ingredients for the sauce is a magical wonderland together.  ", "The lasagna was incredible as well.  ", "Perfect balance of sauce, cheese and pasta.  ", "I can not wait to go back and try more things from the menu.  ", "The food, service, and weather was perfect.   ", "We savored every morsel of food.  ", "Sat outside due to the amazing weather.  "], "author": "Anna C.", "review": "John was amazing.  He was inviting and helpful to the 1st timers at his establishment.  \n\nAbruzzo lasagna and Penne Puttanesca pasta with mushrooms was amazing.  The pasta was al-dente.  The combination of ingredients for the sauce is a magical wonderland together.  The lasagna was incredible as well.  Perfect balance of sauce, cheese and pasta.  I can not wait to go back and try more things from the menu.  The food, service, and weather was perfect.   We savored every morsel of food.  Sat outside due to the amazing weather.  Sipped a bottle of wine and enjoyed my best friend's company.  \n\nI found a new love with Italian food in the dogpatch.  We will definitely be back.", "rating": 5, "date": "2017-04-15"}, {"excerpts": ["For our mains I got the Abruzzo lasagna which had great flavor and kick to it "], "author": "Blake B.", "review": "What a great little spot hidden in the city.  We had dinner here tonight and we couldn't have had a better experience.  It is a family run place and the son waited on us, gave us a history of the place and recommended some things to get as well.\n\nThe place is small but the food takes deserves all the attention.  We ordered the caesar salad to start which was very good.  For our mains I got the Abruzzo lasagna which had great flavor and kick to it and my wife got the wild mushroom which she really enjoyed as well.\n\nGreat family spot with delicious food.", "rating": 5, "date": "2013-03-21"}, {"excerpts": ["Abruzzo lasagna and Carbonara pasta, soooooo delicious. ", "This place is the real deal when it comes to lasagna and pasta."], "author": "Ian V.", "review": "This place is like walking into your grandmas house knowing you are about to indulge in amazing food! The lasagna is some of the best I have ever had!, I just cant tell my Mom that! The service is awesome, they are so friendly and nice. The portions of food is tremendous. You have to try there Abruzzo lasagna and Carbonara pasta, soooooo delicious. This place is the real deal when it comes to lasagna and pasta.", "rating": 5, "date": "2015-03-25"}, {"excerpts": ["It was so good that I took home an Abruzzo lasagna with spicy Italian sausage. ", "So different from the bianca, but another amazing experience. ", "Friendly service too!"], "author": "A L.", "review": "I went for lunch with a friend for the first time yesterday. If you could experience heaven through food, you would find it in the Bianca lasagna here!  Incredible flavors. The ultimate comfort food. It was so good that I took home an Abruzzo lasagna with spicy Italian sausage. So different from the bianca, but another amazing experience. Friendly service too!", "rating": 5, "date": "2016-04-01"}, {"excerpts": ["I ordered the Abruzzo lasagna....and it was awesome."], "author": "Nishant S.", "review": "The best lasagna I ever had in my life. Hands down. My whole family loves it and my extended family loved it too. Go there and check it out for yourself and see what I am talking about. \nI ordered the Abruzzo lasagna....and it was awesome.", "rating": 5, "date": "2015-01-06"}, {"excerpts": ["I loved the Abruzzo lasagna, delizioso!  ", "Folks are speaking Italian and the host embraces many of the guests as they enter.  ", "For what it is worth, I lived in Naples, Italy for a number of years and feel this is authentic experience."], "author": "Brian G.", "review": "Che bello!  I loved the Abruzzo lasagna, delizioso!  Folks are speaking Italian and the host embraces many of the guests as they enter.  For what it is worth, I lived in Naples, Italy for a number of years and feel this is authentic experience.", "rating": 5, "date": "2015-10-09"}, {"excerpts": ["I tried the Abruzzo lasagna with spicy sausage.\n\n"], "author": "Andrew H.", "review": "I tried the Abruzzo lasagna with spicy sausage.\n\nWhat sausage? There were a few crumbles on top. The edges were hard, the center was cold... \n\nBoring. I really wanted to like this place.\n\nAnd it was way over-priced.", "rating": 2, "date": "2013-03-14"}, {"excerpts": ["Abruzzo Lasagna - Spicy Italian sausage lasagna. ", "Marinara sauce was very well done, a bit on the sweet side. ", "The sausage gave it a nice kick. \n", "Wild Mushroom - A bit lighter, mushrooms are not overcooked, nice a soft. "], "author": "Andrew B.", "review": "I liked this place once I looked at the menu. My favorite type of Italian food is Lasagna. They make six different types! My friends and I tried three kinds, the pesto, Abruzzo, and wild mushroom. All three were awesome and all three of them had their own distinct flavors:\n\nPesto Lasagna - Ummm... pesto-y. When mixed with the cheese it made the lasagna very creamy. Also, a nice strong presence of olive oil. Delicious!\nAbruzzo Lasagna - Spicy Italian sausage lasagna. Marinara sauce was very well done, a bit on the sweet side. The sausage gave it a nice kick. \nWild Mushroom - A bit lighter, mushrooms are not overcooked, nice a soft. They use a red wine sauce in addition to the marinara which adds a slight bit of tartness.\n\nThe pasta is wonderful. Most lasagna is pretty heavy but because they use such thin pasta, it maintains the lasagna texture without all the starchiness of normal lasagna.\n\nThe service was excellent. They moved tables around for us, took out their phones to show us pictures of some of the food there, and were just really friendly overall. He was definitely Italian from Italy... hilarious guy.\n\nCan't wait to go back!\n\nCheers!", "rating": 5, "date": "2012-08-30"}, {"excerpts": ["We shared a huge hunk of the  Abruzzo lasagna. ", "My husband likes heartier food and I feared the \"sausage\" would be big and greasy.  ", "Not so. ", "It is finely ground fresh pork gently spiced with salt and pepper and fennel. ", "The \"sausage\" mixed with sauce and layered with the impossibly thin pasta was delicious.  ", "It wasn't greasy or heavy, just perfect with a salad.  "], "author": "Nancy W.", "review": "We just stumbled into Marcella's yesterday, had never heard of it before.   We were hungry and it was the closest restaurant.  What a happy surprise. \n\nA caprese salad and order of lasagna were plenty for two of us. \n\nThe salad: anybody can match the greens,they were fresh and good.  The tomatoes:  I can do better in Sacramento from my backyard plants or the farmer's market, but oh, the cheese.  It is real, fresh, buffalo mozzarella flown in from Puglia.  We don't have anything that matches that flavor. It is mild, but the flavor blooms in your mouth and is just different and lovely.  The salad dressing is mild so it doesn't overwhelm the cheese, that great big ball of cheese. Really, it's plenty for two. \n\nWe shared a huge hunk of the  Abruzzo lasagna. My husband likes heartier food and I feared the \"sausage\" would be big and greasy.  Not so. It is finely ground fresh pork gently spiced with salt and pepper and fennel. The \"sausage\" mixed with sauce and layered with the impossibly thin pasta was delicious.  It wasn't greasy or heavy, just perfect with a salad.  The flavors are subtle and so balanced.  \n\nMas and Gianfranco are friendly and happy to talk about their food.  We loved it and will be finding more excuses to go to SF for lunch. We'll  bring a cooler next time to take food home.\n\nThis family owned and run place is a gem.", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["Let me start by saying the Abruzzo lasagna is a must try. ", "Filled with spicy Sicilian sausage that was freshly made covered in thick layers of pasta and might I say the cheesiest mozzarella ever also the house salad had a very good vinaigrette that complimented the lasagna very will. ", "John Franco was the gentleman that took care of us and made me feel like I was at home. ", "His service alone is what sealed the deal and from here on will be coming in regularly when I am in the area to eat some lasagna. ", "Thank you for the great service and will be seeing you soon to try out more of the menu."], "author": "Kevin K.", "review": "Created a Yelp account just to rate this place.Best Lasagna/Hospitality I have ever received. I had found this place one Friday when I was craving Italian while on a business trip in the City. Came across Marcella's so I checked out the reviews and the pictures looked so mouth watering I said to buddy of mine who was here from Ireland lets give this place a shot. Let me start by saying the Abruzzo lasagna is a must try. Filled with spicy Sicilian sausage that was freshly made covered in thick layers of pasta and might I say the cheesiest mozzarella ever also the house salad had a very good vinaigrette that complimented the lasagna very will. John Franco was the gentleman that took care of us and made me feel like I was at home. His service alone is what sealed the deal and from here on will be coming in regularly when I am in the area to eat some lasagna. Thank you for the great service and will be seeing you soon to try out more of the menu.", "rating": 5, "date": "2016-06-27"}], "sicilian eggplant lasagna": [], "bolognese lasagna": [{"excerpts": ["Had the Bolognese lasagna. ", "Delicious! ", "Comes with a nice small salad which was good. ", "The bread here is delicious. ", "Service is awesome. ", "Will def come again."], "author": "c L.", "review": "Had the Bolognese lasagna. Delicious! Comes with a nice small salad which was good. The bread here is delicious. Service is awesome. Will def come again.", "rating": 5, "date": "2018-09-28"}, {"excerpts": ["* Bolognese lasagna:  ", "I got an end portion ", "and so my piece was likely drier and had less filling than my coworkers, as this was my least favorite but a couple of them said it was their most favorite.  "], "author": "Alice C.", "review": "So sad this place is only open weekdays from 11.30am to 3.30pm as I live & work on the Peninsula!   Was able to go for lunch with co-workers and though I was skeptical as I'm not a lasagna person, this is the real deal.   Four of us shared:\n\n* Truffle ravioli:  My favorite of the bunch, but I love truffles.  Deep rich flavor, super creamy and truffle-y sauce.  5/5\n\n* Bolognese lasagna:  I got an end portion and so my piece was likely drier and had less filling than my coworkers, as this was my least favorite but a couple of them said it was their most favorite.  2/5\n\n* Mushroom lasagna:  The mushroom flavor wasn't as strong as I liked but the overall creaminess was a plus.  4/5\n\n* Bianca lasagna:  Lovely rich bechamel and cheese sauce with mild hints of pancetta.  More pancetta would make it perfect but this was still wonderful.  4.5/5\n\nService was a bit rude and slow -- our waiter (seems to be the owner) didn't tell us any specials and gave us grief for our party not all arriving at the same time, even though there were plenty of open tables.  If I'm in SF early after work, I'll try to drop by as it's open until 6pm for takeout.   Highly recommended!", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["I took the Bolognese lasagna home to reheat the following day and it was equally as delicious! \n\n"], "author": "Katherine C.", "review": "Visited 5/12/17 \n(near closing time)\n\nWOW! I am not a lasagna person- I've never really liked it and would definitely not go out of my way to get it, but Marcella's Lasagneria changed my opinion on lasagna completely. \n\nI ordered the:\n1. ABRUZZO lasagna (w/spicy Italian sausage)- This lasagna was really good. It wasn't too spicy and the sweetness from the carrot really balanced it out. \n2. BOLOGNESE (w/ beef sauce)- This was my personal favorite! The flavors were very well balanced and reminiscent of a traditional lasagna without the awful texture from Ricotta cheese. I loved that there weren't too many textures going on but it wasn't completely mush either. I would definitely recommend this. \n*I took the Bolognese lasagna home to reheat the following day and it was equally as delicious! \n\nI would really like to return and try some of the other items on the menu, which all sounded really good. Their exceptional service and friendliness along with food that could draw people from miles away makes it a restaurant that I would recommend to anyone without reservation!", "rating": 5, "date": "2017-05-14"}, {"excerpts": ["Called these guys up and they were going to close shop a little early, but waited for me to get there so I could pick up the Bolognese Lasagna for dinner.  ", "Clear instructions on tray and enjoyed an amazing dish!! ", "Thanks!!  ", "Great food and even better service!"], "author": "Sherman L.", "review": "Was trying to figure out what to get for dinner.  Called these guys up and they were going to close shop a little early, but waited for me to get there so I could pick up the Bolognese Lasagna for dinner.  Clear instructions on tray and enjoyed an amazing dish!! Thanks!!  Great food and even better service!", "rating": 5, "date": "2017-06-11"}, {"excerpts": ["The flavor of the bolognese lasagna is a bit salty for me, but the noodles make up for it. "], "author": "B. Y.", "review": "I've eaten here only once (wish they were open more than just weekdays for lunch!) and ordered a tray of lasagna and a tray of pasta here. Love that we have this adorable, family-run gem near me!! The lasagna noodles are so tender they melt in your mouth!! The flavor of the bolognese lasagna is a bit salty for me, but the noodles make up for it. The penne puttanesca is delicious as well! I'm just glad they let you order trays ahead of time - perfect for big groups. I had to resist the urge to tell people I made it myself! :)", "rating": 4, "date": "2017-07-24"}, {"excerpts": ["I ordered Bolognese lasagna and my dining companion ordered penne puttanesca but they were out of penne so substituted with spaghetti.  ", "My lasagna was not edible, lacked life, reminded me with frozen section heated a few times.  ", "On to the puttanesca, it was supposed to be a pungently delicious dish except pasta was not made that day.  ", "It had an overpowering taste of anchovies and lacked ingredients specifically olives ", "but we succcessfully found about 6 capers.  ", "On a positive note, the owners son had high integrity and did not charge us."], "author": "Na H.", "review": "After spending three weeks in Italy this year, I was excited to run into Marcella's this Friday for a late lunch.  It's casual family owned which is exciting to visit and support.  We started with a caprese salad, as an uncooked dish, ingredients are everything.  I expected a healthy number of beefsteak tomatoes, basil and mozzarella.  The tomatoes were overly soft and tasteless.  The mozzarella was not fresh and did not have any taste.  There were just 4 slices of tomatoes and 2 basil leaves served on a paper plate.  I ordered Bolognese lasagna and my dining companion ordered penne puttanesca but they were out of penne so substituted with spaghetti.  My lasagna was not edible, lacked life, reminded me with frozen section heated a few times.  On to the puttanesca, it was supposed to be a pungently delicious dish except pasta was not made that day.  It had an overpowering taste of anchovies and lacked ingredients specifically olives but we succcessfully found about 6 capers.  On a positive note, the owners son had high integrity and did not charge us.", "rating": 2, "date": "2017-06-10"}, {"excerpts": ["The Bolognese lasagna with angus beef, wild mushroom and red wine and abruzzo style with house made italian sausage were very good. \n\n"], "author": "Sunil R.", "review": "As the name suggests, this is the place to go for Lasagna or for a large carb overload. I got to try quite a few different kinds and really enjoyed all of them. The Bolognese lasagna with angus beef, wild mushroom and red wine and abruzzo style with house made italian sausage were very good. \n\nExtra credit for being a family owned restaurant. I wish them the best!", "rating": 4, "date": "2014-04-13"}, {"excerpts": ["I had the butternut squash, and tasted my colleague's bolognese lasagna. ", "Both were divine!  ", "I don't know how you can fit 6 layers of pasta and filling into a piece of lasagna that is only 1\"  to 1.5\" high, but they sure did it.  ", "The layers were very thin, delicate, and delicious.  ", "I ate the whole piece (and part of a second) plus some bread, and felt perfectly sated... not too full (as I had feared). ", "It was the perfect lunch. ", "I immediately started thinking about when I could come back to purchase a whole lasagna for a party, event, or dinner. ", "I'm sure that I will be a regular customer at Marcella's Lasagneria!"], "author": "Sherri H.", "review": "Oh. My. God.  This place is fabulous!!  My colleague and I stopped here one day for a late lunch. We wanted something light and fast, and we were in the neighborhood, so we stopped in at Marcella's Lasagneria.  We tried to order salads, but Gianfranco would not hear of it.  We must try the lasagna.  No no, we wanted something light. He assured us that their lasagna was not heavy.  We gave it a shot.  WOW!  This was probably the best lasagna I have ever eaten! It was so light and delicate and had amazing robust flavors.  I had the butternut squash, and tasted my colleague's bolognese lasagna. Both were divine!  I don't know how you can fit 6 layers of pasta and filling into a piece of lasagna that is only 1\"  to 1.5\" high, but they sure did it.  The layers were very thin, delicate, and delicious.  I ate the whole piece (and part of a second) plus some bread, and felt perfectly sated... not too full (as I had feared). It was the perfect lunch. I immediately started thinking about when I could come back to purchase a whole lasagna for a party, event, or dinner. I'm sure that I will be a regular customer at Marcella's Lasagneria!", "rating": 5, "date": "2013-11-15"}], "mushroom lasagna": [{"excerpts": ["I ordered a truffle ravioli and my boyfriend ordered the mushroom lasagna. ", "Both were so impressive. ", "I only wish there were more of it. "], "author": "Angela W.", "review": "What a gem! This is a small shop owned by a son and his father and they were so kind. When we were seated, they treated us like family and made sure we felt comfortable and introduced us to all our foods.\n\nThe food was phenomenal. I ordered a truffle ravioli and my boyfriend ordered the mushroom lasagna. Both were so impressive. I only wish there were more of it. I even took the bread and soaked up all the truffle sauce from my ravioli because it was so tasty.\n\nI wish this place were open later on weekdays and on weekends because I usually only visit SF on the weekends. But I suppose that's what makes this lasagneria so much more special :)", "rating": 5, "date": "2017-03-30"}, {"excerpts": ["Mushroom lasagna:  ", "The mushroom flavor wasn't as strong as I liked but the overall creaminess was a plus.  "], "author": "Alice C.", "review": "So sad this place is only open weekdays from 11.30am to 3.30pm as I live & work on the Peninsula!   Was able to go for lunch with co-workers and though I was skeptical as I'm not a lasagna person, this is the real deal.   Four of us shared:\n\n* Truffle ravioli:  My favorite of the bunch, but I love truffles.  Deep rich flavor, super creamy and truffle-y sauce.  5/5\n\n* Bolognese lasagna:  I got an end portion and so my piece was likely drier and had less filling than my coworkers, as this was my least favorite but a couple of them said it was their most favorite.  2/5\n\n* Mushroom lasagna:  The mushroom flavor wasn't as strong as I liked but the overall creaminess was a plus.  4/5\n\n* Bianca lasagna:  Lovely rich bechamel and cheese sauce with mild hints of pancetta.  More pancetta would make it perfect but this was still wonderful.  4.5/5\n\nService was a bit rude and slow -- our waiter (seems to be the owner) didn't tell us any specials and gave us grief for our party not all arriving at the same time, even though there were plenty of open tables.  If I'm in SF early after work, I'll try to drop by as it's open until 6pm for takeout.   Highly recommended!", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["I ordered the Mushroom Lasagna, and my friend ordered the Butternut Lasagna, which I thought sounded a little strange at first.\n\n"], "author": "Stefanie C.", "review": "My friend took me out to lunch after a session at Dogpatch Boulders but didn't tell me that we were going to eat LASAGNA. Normally, I absolutely despise lasagna, but I figured it was time to give it a try again. Omg I'm SO glad I was open to coming to Marcella's. This is what I imagined good lasagna would taste like, and now I can never go back to eating basic Italian food again.\n\nFirst of all, the service here is incredible. All of the waiters and waitresses go above and beyond to make sure you feel welcome like family in their own home. My friend and I were seated outside. I ordered the Mushroom Lasagna, and my friend ordered the Butternut Lasagna, which I thought sounded a little strange at first.\n\nI was absolutely blown away by the quality of food. Both dishes. The pasta itself was freshly made, not mushy like it tastes at other restaurants, and there is an excellent ratio of pasta to vegetables. Once you're done eating, you can take your time before going inside the restaurant to pay. I'll need to come back to try some of their other dishes, because everything that other guests were eating looked scrumptious. I'm very impressed by this place and will definitely be bringing other friends here in the future!", "rating": 5, "date": "2016-05-09"}, {"excerpts": ["I always end up ordering the mushroom lasagna, and I'm never disappointed."], "author": "Vasu S.", "review": "Probably the best place to get lasagna. Period. The food is always piping hot and I adore the family that operates this place. I always end up ordering the mushroom lasagna, and I'm never disappointed.", "rating": 5, "date": "2018-04-28"}, {"excerpts": ["I will definitely be back for the mushroom lasagna..."], "author": "M. H.", "review": "The first time I tried Marcella's lasagna I had the abruzzo and bolognese at a company lunch.  It was so impressive that a few weeks later, I just HAD to throw a lasagna party as an excuse to spend $62 per lasagna to try different flavors and traveled all the way to the City to do so...and I NEVER order lasagna when I eat out.  That's how good it was.\n\nFood: Ordered a pan of mushroom, bolognese, and verdure lasagnas.  All were amazing, but there was something extra special about the mushroom.  All had layers and layers of homemade pasta sheets and although they had all those layers, the lasagna was still light and not heavy like you just ate a brick.  I will definitely be back for the mushroom lasagna...so amaze balls.\n\nService: While I didn't pick it up myself, the first thing I was told was how nice the employees were...not just nice, but super nice.\n\nInterior: small and quaint.\n\nMiles traveled to get here were 25, and to the City? Took forever, but so worth it and would do it again in a heartbeat.  You have to make killer lasagna to have \"lasagneria\" in your restaurant's name and these guys did not disappoint.", "rating": 5, "date": "2018-04-06"}, {"excerpts": ["Got the mushroom lasagna. ", "Drinks selection was good as well. ", "Overall satisfied."], "author": "Eden T.", "review": "It's a place after which you'll be really filled. Got the mushroom lasagna. Drinks selection was good as well. Overall satisfied.", "rating": 5, "date": "2018-01-05"}, {"excerpts": ["These guys and their mushroom lasagna is unique and splendid the sauce subtle and delicious. ", "Above all their generous and kind attitude is overwhelmingly positive!"], "author": "Robert B.", "review": "These guys and their mushroom lasagna is unique and splendid the sauce subtle and delicious. Above all their generous and kind attitude is overwhelmingly positive!", "rating": 5, "date": "2017-11-13"}, {"excerpts": ["The mushroom lasagna, please.\n\n", "This mushroom lasagna was UNBELIEVABLY good.  "], "author": "Veronica M.", "review": "My man had a business lunch meeting here, & I requested he bring an order of lasagna home for me to try later.  The mushroom lasagna, please.\n\nOMG.  This mushroom lasagna was UNBELIEVABLY good.  It was divine, pillowy perfection.  \n\nIt actually MELTED IN MY MOUTH. \n\nThis is after it had been in the fridge for several hours & reheated for dinner. \n\nBlissful.\n\nThen...there's the next day.  The following morning, I thought it'd be a good idea to warm up what was left for breakfast.\n\nAgain, it actually melted in my mouth.\n\nThis lasagna is easily one of the best lasagnas I have ever had.  Flavors & texture both crush it.  The way that the pasta is so divinely soft, yet not at all over cooked, is mind blowing.  \n\nThis lasagna rivals, & is even perhaps better than, the lasagna from Italian Homemade.  What?!\n\nFurther bulletins as future taste tests warrant!\n\nI'm not sure who Marcella is, but she is a lasagna master.\n\n5 stars.", "rating": 5, "date": "2015-04-06"}, {"excerpts": ["I ordered the wild mushroom lasagna and it was unbelievably delicious.  ", "Served on a paper plate (I did say no frills), the lasagna contained several layers of an ultra thin pasta with a sweet, yet slightly tangy sauce and a generous portion of mushrooms.  "], "author": "Nicole S.", "review": "The best lasagna I've ever had!\n\nAfter being on my bookmark list for almost a year, my friend and I made it to Marcella's Tuesday afternoon.  As you walk in, Marcella's is small, no frills restaurant with only about 5 two person tables.  \n\nThough there are plenty of options on the menu (soups, salads, lasagnas, pizzas, & panini/sandwiches), I decided to go with the lasagna (they are a lasagneria after all...).  I ordered the wild mushroom lasagna and it was unbelievably delicious.  Served on a paper plate (I did say no frills), the lasagna contained several layers of an ultra thin pasta with a sweet, yet slightly tangy sauce and a generous portion of mushrooms.  For $9.75, my lasagna slice didn't look that big but ended up filling me up without giving me the overly full feeling.\n\nWHAT TO KNOW:\n*Vegetarian options\n*Closed on weekends\n*Credit cards are accepted\n*Trays are available\n*Street parking \n\nSERVICE:\nThe male working was very inviting.  He was friendly from the time we walked in to when we left.", "rating": 5, "date": "2013-03-07"}, {"excerpts": ["I got the Wild Mushroom Lasagna to go $8.75 ", "+ .74 tax = $9.49, charged it.  ", "It was the Best Lasagna I've had in Forever!  ", "They really know how to make Lasagna.  ", "Lots of cheese, smooth pasta, lots of mushrooms.  ", "If you're in the Dogpatch M-F you must get some Wild Mushroom Lasagna!!\n\n"], "author": "Ann L.", "review": "I've read good things about Marcella's Lasagneria & Cucina, but I never could get there because only open M-F.  Well, I noticed it on my way to Chocolate Lab & it's just across the street from there.  Take the T-Line & get off 23rd St, go back to 22nd & up the street.\n\nAfter my dessert at Chocolate Lab I decided to stop in.  Very Happy I did.\n\nI got the Wild Mushroom Lasagna to go $8.75 + .74 tax = $9.49, charged it.  It was the Best Lasagna I've had in Forever!  They really know how to make Lasagna.  Lots of cheese, smooth pasta, lots of mushrooms.  Just delicious!  \n\nClosed Sat & Sun, Plus New Years Eve & New Years Day.\n\nNext week Jan 2-4, 2013 they'll have Black Truffles Lasagna with White Cream Sauce!\n\nIf you're in the Dogpatch M-F you must get some Wild Mushroom Lasagna!!\n\nHrs:\nM-F 11:30am-3pm; 5-7pm\nCLOSED: Weekends", "rating": 5, "date": "2012-12-28"}, {"excerpts": ["I tried the bolognese and mushroom lasagna, both of which were flavorful with the right amounts of sauce and cheese. \n\n"], "author": "Maya S.", "review": "The lasagna here is magical! The thin layers of homemade pasta truly make the lasagna unique. Perfect lasagna portions are served and you don't feel overstuffed after eating the lasagna as you might with a pasta dish. I tried the bolognese and mushroom lasagna, both of which were flavorful with the right amounts of sauce and cheese. \n\nThe owner is very friendly and it's evident how passionate he is about what he does from chatting with him and tasting the food. Cool points for the rosemary plants outside! I wish Marcella's was open for dinner, and/or on the weekends!", "rating": 5, "date": "2012-10-19"}, {"excerpts": ["I got the mushroom lasagna which was very good - ", "not watery like my so-called lasagna and a great crispiness to the cheese.  ", "It was a good size portion with a tasty side salad.  ", "Service was good too, quite friendly.  ", "I liked my lasagna and would certainly go back to try other options too.  ", "Lasagneria.  ", "Go."], "author": "Rebecca S.", "review": "I had never been to a lasagneria before going to Marcella's, and all I can say is, go to a lasagneria.  There are other dishes on the menu, but so many lasagnas!  It was hard to choose.  I got the mushroom lasagna which was very good - not watery like my so-called lasagna and a great crispiness to the cheese.  It was a good size portion with a tasty side salad.  Service was good too, quite friendly.  I liked my lasagna and would certainly go back to try other options too.  Lasagneria.  Go.", "rating": 4, "date": "2017-08-31"}, {"excerpts": ["I also ordered a Bolognese and a Mushroom lasagna to go for my son and his wife for their dinner pasta that night. ", "We came over from Marin County as my son had found the rest. ", "on line, what a find!!!!!\n ", "As  a Midshipman, at the United States Naval Academy at Annapolis, Md., was fortunate to visit Naples and Rome in 1956. ", "Great food, but Sicilian rates numero uno!!!!! ", "I have had regular Italian lasagna, in many a great rest., but this Sicilian seasoning, texture, preparation of thin layers of pasta is a prize winner!!!!!\n", "We live now in the Paso Robles area, but a trip to San Francisco is well worth it.\n", "Clifford R. Den Otter, 805-835-9811"], "author": "Clifford D.", "review": "On Jun. 20th, my son and I had lunch. To start with, the owner is gracious and friendly. He also is the Chef. I am 81 years old and have never had Sicilian Lasagna nor has my son. My son had the egg plant and I had the Bolognese. Talk about outstanding, rate it at 6 STARS!!!!! I also ordered a Bolognese and a Mushroom lasagna to go for my son and his wife for their dinner pasta that night. We came over from Marin County as my son had found the rest. on line, what a find!!!!!\n As  a Midshipman, at the United States Naval Academy at Annapolis, Md., was fortunate to visit Naples and Rome in 1956. Great food, but Sicilian rates numero uno!!!!! I have had regular Italian lasagna, in many a great rest., but this Sicilian seasoning, texture, preparation of thin layers of pasta is a prize winner!!!!!\nWe live now in the Paso Robles area, but a trip to San Francisco is well worth it.\nClifford R. Den Otter, 805-835-9811", "rating": 5, "date": "2017-06-24"}, {"excerpts": ["I had Abruzzo and the Mushroom lasagna which were perfectly prepared.   ", "It reminded me that of Grandma's pasta!  ", "It is terrific to find an intimate family business that prepares food ", "SO Good!  ", "The Lasagna was prepared with beautiful thin layers of pasta balanced with home made sauce, creamy cheese, and executed with delicious toppings.  ", "If the portion size wasn't perfect... "], "author": "Christine R.", "review": "I finally made it to try this wonderful hand-crafted, authentic and delicious Lasagna!\nI truly enjoyed the fantastic service given from both the Father and Son.\n\nI had Abruzzo and the Mushroom lasagna which were perfectly prepared.   It reminded me that of Grandma's pasta!  It is terrific to find an intimate family business that prepares food SO Good!  The Lasagna was prepared with beautiful thin layers of pasta balanced with home made sauce, creamy cheese, and executed with delicious toppings.  If the portion size wasn't perfect... I would have ordered another square.  \n\nIt is certainly a great place to eat lunch or just drop in for a To Go order.  I love this extraordinary food find, and I can't wait to make this a regular stop!!!!\n\nPlease... don't tell anyone.  It is our secret.", "rating": 5, "date": "2014-11-03"}, {"excerpts": ["I had the mushroom lasagna...that had to be the best lasagna ever, something I thought would be pretty hard to achieve for a absolute lover of all things lasagna like me. ", "I can't wait to go back and try a different flavor!"], "author": "Nick J.", "review": "Wow, what a breath of fresh air in SF! This little establishment seems tiny...hidden away in an unassuming little alcove on the corner of Tennessee and 22nd. Then... the larger than life owner comes out to great you, excitedly rubbing his hands together in anticipation of telling you what he's prepared for his guests. And what a great guy...he's so excited and proud of his dishes! I had the mushroom lasagna...that had to be the best lasagna ever, something I thought would be pretty hard to achieve for a absolute lover of all things lasagna like me. I can't wait to go back and try a different flavor!", "rating": 5, "date": "2016-06-18"}, {"excerpts": ["I was fortunate to try two different kinds; the mushroom lasagna and bolognese. ", "Both def tasted different but had very good, hearty flavors. ", "It's a reasonable portion- not too heavy but leaves you full and satisfied. "], "author": "Laurel P.", "review": "Lasagna! Who doesn't love lasagna? Anything with layers of pasta, hearty fillings and cheesy toppings and I'm sold. Well lucky me, I've found this father- son, hole-in-the-wall business specializing in making lasagna. \n\nI was fortunate to try two different kinds; the mushroom lasagna and bolognese. Both def tasted different but had very good, hearty flavors. It's a reasonable portion- not too heavy but leaves you full and satisfied. Pair it with an Italian soda and finish the meal off with some Italian espresso. Mmmm!\n\nAlso it makes for a good late night munchie. \n\nLocated in the new and developing dog patch area, it's close to cal train so if you ever feel the need to get some comfort food like this here lasagna, hop off, walk a couple blocks and you'll be happy that you did.", "rating": 5, "date": "2014-06-11"}, {"excerpts": ["I ordered up the mushroom lasagna one hungry afternoon.  ", "I was eager to try this place since I've heard and read such great reviews!  ", "As soon as I got the lasagna, I dove right in.  ", "I am happy to say that there weren't any burnt noodle edges or any unwanted crunchy textures.  ", "Although, a branch of rosemary did find it's way into my meal.  ", "With that being said, the flavor of rosemary was overpowering and I didn't really taste the homemade marinara or the wild and meaty taste of mushroom.  ", "The pasta was cooked well, but I feel like the sheets were cranked out too thin (on a 6 or 7 gauge on the pasta roller).  ", "I definitely want to revisit this place and try a different type of lasagna.  ", "I think the day I came was just a bad day."], "author": "Josh S.", "review": "I ordered up the mushroom lasagna one hungry afternoon.  I was eager to try this place since I've heard and read such great reviews!  As soon as I got the lasagna, I dove right in.  I am happy to say that there weren't any burnt noodle edges or any unwanted crunchy textures.  Although, a branch of rosemary did find it's way into my meal.  With that being said, the flavor of rosemary was overpowering and I didn't really taste the homemade marinara or the wild and meaty taste of mushroom.  The pasta was cooked well, but I feel like the sheets were cranked out too thin (on a 6 or 7 gauge on the pasta roller).  I definitely want to revisit this place and try a different type of lasagna.  I think the day I came was just a bad day.", "rating": 3, "date": "2015-01-23"}, {"excerpts": ["The mushroom lasagna is fantastic! ", "This is truly gourmet and fine dinning type of lasagna. ", "So amazingly delicious. ", "I am excited about coming here in the future!"], "author": "Laila J.", "review": "The mushroom lasagna is fantastic! This is truly gourmet and fine dinning type of lasagna. So amazingly delicious. I am excited about coming here in the future!", "rating": 5, "date": "2015-06-11"}, {"excerpts": ["The best mushroom lasagna I've ever had, thin and flavorful and the customer service was on point. ", "The restaurant is small but the food makes up for it. ", "I will be visiting this place again on my next trip to SF."], "author": "Jeovany V.", "review": "The best mushroom lasagna I've ever had, thin and flavorful and the customer service was on point. The restaurant is small but the food makes up for it. I will be visiting this place again on my next trip to SF.", "rating": 5, "date": "2015-07-16"}, {"excerpts": ["(I've got my eye on you, mushroom lasagna!). ", "Geez I might even go back tomorrow cuz I miss it already!"], "author": "Monica T.", "review": "\"We no longer serve food. We serve emotions.\" - Owner (son). And he's right! I sought out Marcella's while craving for lasagna and I got exactly what I wanted- insanely delicious lasagna. I got to the restaurant at around 1pm on a Wednesday and it wasn't too packed; I was able to sit outside right away. John/Gian the owner (I'm guessing this is his name based on other reviews) greeted me and was so warm. It felt like I was talking to an old friend right away. He made me feel welcome and right at home and had a smile on his face the entire time as he ran around and in and out of the restaurant. Talk about service! He took the time to go through the specials of the day and the menu which I appreciated very much. I went with the sausage lasagna lunch special. It's like butter and each bite just melts in your mouth. It is truly comparable to lasagna I've had in Rome. John even hooked me up with the \"best slice\"- corner with a little bit of crunch on the bottom. Great quality meal for a great price. I had to order another one to take home! Easy to heat up, too- 400 degrees for 12 minutes. Tastes just as good as it did fresh out the oven. I'm looking forward to going back to try more dishes (I've got my eye on you, mushroom lasagna!). Geez I might even go back tomorrow cuz I miss it already!", "rating": 5, "date": "2016-05-11"}, {"excerpts": ["The mushroom lasagna is my family's favorite and the pizza was delish! ", "The father-son duo make everything by hand and treat you like family. ", "Gianfranco is especially sweet and thoughtful. ", "He found a special spot for us to sit and propped up my injured leg on a pillow!!! "], "author": "Tessa T.", "review": "This place has outstanding food, service, and character! The food is authentic with no yuppie interpretations and served in perfect proportions--just like my nona used to cook for me! The mushroom lasagna is my family's favorite and the pizza was delish! The father-son duo make everything by hand and treat you like family. Gianfranco is especially sweet and thoughtful. He found a special spot for us to sit and propped up my injured leg on a pillow!!! I swear I have been treated so badly by other servers in the city when I walk in using crutches.\n\nThis city is riddled with ridiculously pretentious restaurants. Marcella is a refreshing departure from long lines, inattentive service, and jacked up prices. Support these guys hard work and passion!!!", "rating": 5, "date": "2014-05-21"}, {"excerpts": [": pea & tomato salad!, mushroom lasagna!", ", veg pasta primavera!, caesar salad!, garlic bread! ", "The \"!\" means "], "author": "Jules B.", "review": "OMG! So delicious! I'll write a more thorough review, but.... I just have to say, they just delivered lunch to my work for a colleague's lunch meeting and I just have post... this food is sooooo delicious! I'm now eating, and getting so full, but want to keep eating the following (and everything is so good!): pea & tomato salad!, mushroom lasagna!, veg pasta primavera!, caesar salad!, garlic bread! The \"!\" means = delicious!\n\nThank You Marcella, and your beautiful Italian mother, and sweet assistant, that delivered the lunch.\n\n********************\nUpdate - Next day, today: I woke up thinking about Marcella's delicious food this morning. I'm already planning to high tail it to Marcella's tomorrow, Saturday, to pick up a variety of yummy lasagnas and a few salads and maybe some other goodies to serve at home this weekend.", "rating": 5, "date": "2013-12-19"}, {"excerpts": ["The mushroom lasagna is outrageously great! ", "John, the owner gives you a \"welcome home\" service. ", "It's worth my drive from Silicon Valley."], "author": "Noriel A.", "review": "The mushroom lasagna is outrageously great! John, the owner gives you a \"welcome home\" service. It's worth my drive from Silicon Valley.", "rating": 5, "date": "2014-10-01"}, {"excerpts": ["I ordered the mushroom lasagna togo as recommended by the owner but when I got to the office, it was different lasagna. ", "Anyway I ate it ", "and it was good. ", "I will go back to get the mushroom lasagna and make sure it's the mushroom lasagna."], "author": "George K.", "review": "I ordered the mushroom lasagna togo as recommended by the owner but when I got to the office, it was different lasagna. Anyway I ate it and it was good. I will go back to get the mushroom lasagna and make sure it's the mushroom lasagna.", "rating": 3, "date": "2016-04-15"}, {"excerpts": ["I have not dined here, but have had the mushroom lasagna from this place at a friends house. ", "My friends Vince and Jonathan know the owners of this place well and for a special dinner at their home a month or so ago, they ordered the mushroom lasagna and baked it at home. ", "They prefaced it with how unique and amazing this was going to be and it will be unlike any lasagna I have ever had. ", "I was super excited while at the same time having no clue what could make any lasagna so different from the numerous lasagna I have had throughout my existence! \n", "The first ting I noticed was the intense scent of homemade marinara. ", "It was intoxicating. ", "The next thing I noticed was how effortlessly my fork cut through the noodles. ", "It was like they were made of butter. ", "Then the taste.... OMG! ", "And I do not even like mushrooms and was not bothered one bit! ", "I had seconds! ", "I then went to their website the next day and texted two of my foodie friends about this place, which neither had heard of it. ", "I definitely will be coming here for their pest and maybe the truffle lasagna in the near future. ", "Amazing quality!"], "author": "Unicorn U.", "review": "I have not dined here, but have had the mushroom lasagna from this place at a friends house. My friends Vince and Jonathan know the owners of this place well and for a special dinner at their home a month or so ago, they ordered the mushroom lasagna and baked it at home. They prefaced it with how unique and amazing this was going to be and it will be unlike any lasagna I have ever had. I was super excited while at the same time having no clue what could make any lasagna so different from the numerous lasagna I have had throughout my existence! \nThe first ting I noticed was the intense scent of homemade marinara. It was intoxicating. The next thing I noticed was how effortlessly my fork cut through the noodles. It was like they were made of butter. Then the taste.... OMG! And I do not even like mushrooms and was not bothered one bit! I had seconds! I then went to their website the next day and texted two of my foodie friends about this place, which neither had heard of it. I definitely will be coming here for their pest and maybe the truffle lasagna in the near future. Amazing quality!", "rating": 5, "date": "2014-08-17"}, {"excerpts": ["I was fortunate enough to have an extra half hour and sat down and ordered their mushroom lasagna. ", "Man, it was REALLY good, and I'm half Italian!  ", "The thin layers of noodles, the yummy sauce filling but not heavy and just enough. ", "I will be going back. ", "I love lasagna and they have 6 other types. ", "What a nice surprise for me just because I didn't want to piss them off and block their driveway without permission. ", "My tummy is happy."], "author": "Andrea S.", "review": "I'm a realtor in SF and Tuesdays are a day of hunting for parking and double parking as I preview properties for my clients. I went to see a property in Dogpatch today and saw a sort-of space that jutted me into a buildings drive-way. I quickly ran I to the corner eatery and asked if I could please semi-block their driveway for a few minutes and I promised I'd come back in to look at their menu. I was fortunate enough to have an extra half hour and sat down and ordered their mushroom lasagna. Man, it was REALLY good, and I'm half Italian!  The thin layers of noodles, the yummy sauce filling but not heavy and just enough. I will be going back. I love lasagna and they have 6 other types. What a nice surprise for me just because I didn't want to piss them off and block their driveway without permission. My tummy is happy.", "rating": 5, "date": "2014-05-06"}, {"excerpts": ["Someone else in my party ordered the mushroom lasagna and it was also good - also multi-layered with those incredible noodles.\n\n"], "author": "MIke P.", "review": "This place was a delightful surprise. A very small place with only a few tables inside (and a few outside) and what looks like a deli counter -- but the food!  Wow! \n\nThe lasagna is as good as people say - the noodles are super thin, and in many (six?) layers, so it's not like any lasagna I'd had before.  I ordered the butternut squash lasagna, and it was amazing.  Someone else in my party ordered the mushroom lasagna and it was also good - also multi-layered with those incredible noodles.\n\nThe place was described to me as a father-and-son shop, and it really is: the son took our orders and the father made the pasta (among other things) himself and delivered the food to our table!  He was very friendly and told us all about the food, and his philosphy behind food.  Clearly they love what they do, and it shows.\n\nIt doesn't look fancy, but it certainly tasted fancy.", "rating": 4, "date": "2012-06-28"}, {"excerpts": ["Loved the mushroom lasagna and eggplant pizza."], "author": "Amelia T.", "review": "This place has great food AND amazing people making it. Loved the mushroom lasagna and eggplant pizza.", "rating": 5, "date": "2014-05-29"}, {"excerpts": ["We had their mushroom lasagna and their sausage lasagna; both were phenomenal. ", "The pasta was light and fresh (is it possible to describe pasta as such?) and the flavors were amazing. ", "Terry was so helpful and gracious. ", "We will be back ", "and I wish them much success!"], "author": "Alisha H.", "review": "We had their mushroom lasagna and their sausage lasagna; both were phenomenal. The pasta was light and fresh (is it possible to describe pasta as such?) and the flavors were amazing. Terry was so helpful and gracious. We will be back and I wish them much success!", "rating": 5, "date": "2013-05-26"}, {"excerpts": ["Recommend the Mushroom Lasagna; one of the best Italian dishes I've ever had!"], "author": "Etan W.", "review": "Best dining experience in San Fran, and the only Lasagneria in America and possibly the world.  Father-Son team of John Franco and Marcella were incredibly charming, friendly and open to talking about the Father's 50+ years as a gourmet chef all around the world!  The lasagna is made of home-made, very thin-layered pasta and it shows.  Recommend the Mushroom Lasagna; one of the best Italian dishes I've ever had!", "rating": 5, "date": "2015-06-23"}, {"excerpts": ["That wild mushroom lasagna is my favorite & a real crowd pleaser.\n", "Serving this at a dinner party sure removes all stress, we know everyone will love it....\nmmmmmmmm!!!!!!!!!!! ", "Yum"], "author": "Lisa C.", "review": "The kitchen in this place is SPARKLING!!!!! DAZZLING! I feel very good eating \nout of Marcellas, no doubts about the quality of ingredients here....\n That wild mushroom lasagna is my favorite & a real crowd pleaser.\nServing this at a dinner party sure removes all stress, we know everyone will love it....\nmmmmmmmm!!!!!!!!!!! Yum", "rating": 5, "date": "2012-07-12"}], "butternut lasagna": [{"excerpts": ["I ordered the Mushroom Lasagna, and my friend ordered the Butternut Lasagna, which I thought sounded a little strange at first.\n\n"], "author": "Stefanie C.", "review": "My friend took me out to lunch after a session at Dogpatch Boulders but didn't tell me that we were going to eat LASAGNA. Normally, I absolutely despise lasagna, but I figured it was time to give it a try again. Omg I'm SO glad I was open to coming to Marcella's. This is what I imagined good lasagna would taste like, and now I can never go back to eating basic Italian food again.\n\nFirst of all, the service here is incredible. All of the waiters and waitresses go above and beyond to make sure you feel welcome like family in their own home. My friend and I were seated outside. I ordered the Mushroom Lasagna, and my friend ordered the Butternut Lasagna, which I thought sounded a little strange at first.\n\nI was absolutely blown away by the quality of food. Both dishes. The pasta itself was freshly made, not mushy like it tastes at other restaurants, and there is an excellent ratio of pasta to vegetables. Once you're done eating, you can take your time before going inside the restaurant to pay. I'll need to come back to try some of their other dishes, because everything that other guests were eating looked scrumptious. I'm very impressed by this place and will definitely be bringing other friends here in the future!", "rating": 5, "date": "2016-05-09"}, {"excerpts": ["* Butternut lasagna - 3.5 stars\npic: http://www.yelp.com/biz_photos/marcellas-lasagneria-and-cucina-san-francisco?select=schFBKL3eMqKqoW1fQ-6eA#schFBKL3eMqKqoW1fQ-6eA\n", "I just love butternut squash and had to get this - while all the components were great and this was really unique, to be honest ", "I think squash just doesn't go well with lasagna. ", "After trying this (and nothing against them, I imagine this is as good as butternut lasagna is going to get!), I realize that meat just tastes better in lasagna, is more hearty, and the flavors pair better w/ the tomato sauce. "], "author": "Ziyan C.", "review": "What a super sweet staff! They are totally down to earth & pleasant, a little bumbling but in a totally cute way (the son started us off at our table. The dad came out and took our order. Then the son came out to take our order and then laughed at his mistake).\n\nI think you're supposed to order at the counter and I honestly wasn't expecting table service, but they treated us very grandly for such a local, small, family-owned spot. They have very hearty, soft pasta, and even if it is reheated for our meal, I couldn't tell - it tasted so dang good!\n\nCost: $13 for a single serving with tax/tip.\n\nWait: None on a Thursday lunch at 12:30pm. It was a gloomy day so I imagine a little less traffic than normal, but there was a constant flow of customers at the counter and the other tables.\n\n* Butternut lasagna - 3.5 stars\npic: http://www.yelp.com/biz_photos/marcellas-lasagneria-and-cucina-san-francisco?select=schFBKL3eMqKqoW1fQ-6eA#schFBKL3eMqKqoW1fQ-6eA\nI just love butternut squash and had to get this - while all the components were great and this was really unique, to be honest I think squash just doesn't go well with lasagna. After trying this (and nothing against them, I imagine this is as good as butternut lasagna is going to get!), I realize that meat just tastes better in lasagna, is more hearty, and the flavors pair better w/ the tomato sauce. Of course, the actual pasta itself in this dish was great.\n\n* Abruzzo lasagna - 4 stars\npic: http://www.yelp.com/biz_photos/marcellas-lasagneria-and-cucina-san-francisco?select=schFBKL3eMqKqoW1fQ-6eA#LAiqOHszzUFt7FK-zg5oHQ\nReally great! To my point above, the meat one tasted much better, and there was a lot of it! The texture was very soft, the tangy tomato sauce was really flavorful, and the pasta was great.", "rating": 4, "date": "2013-11-28"}], "verdura lasagna": [{"excerpts": ["In a halting Sophie's Choice-like moment, I finally decided to try a sizable $9.75 piece of the Verdura Lasagna with fresh pesto, diced zucchini and sun-dried tomatoes ", "(photo: http://bit.ly/10yhvd8). ", "It was quite good, different and fresh-tasting even if it was a tad oily from the pesto. ", "I liked the crunch of the zucchini mixed with what I believe were remnants of pine nuts. "], "author": "Ed U.", "review": "This isn't your mother's lasagna or at least my mother's lasagna since I don't know your mother, even though I'm sure she's a lovely woman. Actually my mother didn't make homemade lasagna. She defrosted Stouffer's Family Style Lasagna with Meat and Sauce, and that's how my lasagna expectations were set. Ultra thick noodles with ruffled edges layered on top of each other with ground beef, mozzarella cheese and tomato sauce in between. I liked it so much I made my own version for college potlucks. I only knew how to make lasagna and key lime pie.\n\nThat was my entire cooking repertoire as a Berkeley undergrad. But I digress since chef Massimo Di Sciullo creates his own unique version quite unlike what I've experienced. First, the handmade pasta is extremely thin like tissue paper. Six layers of this pasta are piled on top of each with three cheeses in between - not only mozzarella but also Parmigiano Reggiano and bechamel - and six variations of fillings and toppings in separate trays in the display case (photo: http://bit.ly/ZTa52W). The net result looked less like traditional lasagna and more like a savory baklava with layers upon layers of filo dough.\n\nI naively asked if I could have half-orders of two different kinds thinking I was at Humphry Slocombe negotiating between scoops of Secret Breakfast and Blue Bottle Vietnamese Coffee for the price of a single cone. In a halting Sophie's Choice-like moment, I finally decided to try a sizable $9.75 piece of the Verdura Lasagna with fresh pesto, diced zucchini and sun-dried tomatoes (photo: http://bit.ly/10yhvd8). It was quite good, different and fresh-tasting even if it was a tad oily from the pesto. I liked the crunch of the zucchini mixed with what I believe were remnants of pine nuts. Delicious comfort food.\n\nIt made me curious what the others tasted like, but I behaved and simply ordered the $4.50 Insalata Fresca as a side. The salad was just a mix of organic greens with a couple of tomato slices on top and tossed in a sweet housemade balsamic dressing (photo: http://bit.ly/16lrYLC). The salad was a wise contrast to the richness of the lasagna. Massimo obviously knows what he's doing since he's had his business for twenty years, although the sparse cafe itself is barely a year old. The limited hours - closed on weekends and only only until 6:30PM otherwise - make it less convenient for anyone outside of Dogpatch, but if you do feel that cough coming on (hack-hack), maybe you can leave work a little early.\n\nFOOD - 4 stars...artisan lasagna...who knew?\nAMBIANCE - 3 stars..simple cafe set-up, no big whoop (photo: http://bit.ly/12ijq3W)\nSERVICE - 3.5 stars...pretty attentive\nTOTAL - 4 stars...quite a different pasta worth trying if you can make it before it closes", "rating": 4, "date": "2013-05-10"}, {"excerpts": ["Try the verdura lasagna!"], "author": "Armando H.", "review": "Honestly the best lasagna I've had in my life. Try the verdura lasagna!", "rating": 5, "date": "2014-09-04"}, {"excerpts": ["We had the mushroom and verdura lasagna. ", "Both were excellent. ", "More than that, though, Gian, who clearly enjoys working in the family business, made us feel right at home. ", "I've been back several times since with similarly positive experiences."], "author": "Preston T.", "review": "A friend and I stopped in for lunch last Fall after reading the reviews on Yelp and we were glad we did.  We had the mushroom and verdura lasagna. Both were excellent. More than that, though, Gian, who clearly enjoys working in the family business, made us feel right at home. I've been back several times since with similarly positive experiences.", "rating": 5, "date": "2015-06-08"}], "bianca lasagna": [{"excerpts": ["Bianca lasagna:  ", "Lovely rich bechamel and cheese sauce with mild hints of pancetta.  ", "More pancetta would make it perfect but this was still wonderful.  "], "author": "Alice C.", "review": "So sad this place is only open weekdays from 11.30am to 3.30pm as I live & work on the Peninsula!   Was able to go for lunch with co-workers and though I was skeptical as I'm not a lasagna person, this is the real deal.   Four of us shared:\n\n* Truffle ravioli:  My favorite of the bunch, but I love truffles.  Deep rich flavor, super creamy and truffle-y sauce.  5/5\n\n* Bolognese lasagna:  I got an end portion and so my piece was likely drier and had less filling than my coworkers, as this was my least favorite but a couple of them said it was their most favorite.  2/5\n\n* Mushroom lasagna:  The mushroom flavor wasn't as strong as I liked but the overall creaminess was a plus.  4/5\n\n* Bianca lasagna:  Lovely rich bechamel and cheese sauce with mild hints of pancetta.  More pancetta would make it perfect but this was still wonderful.  4.5/5\n\nService was a bit rude and slow -- our waiter (seems to be the owner) didn't tell us any specials and gave us grief for our party not all arriving at the same time, even though there were plenty of open tables.  If I'm in SF early after work, I'll try to drop by as it's open until 6pm for takeout.   Highly recommended!", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["The Bianca Lasagna\n\nLet's begin with the thinly prepared sheets of hand-crafted semolina pasta. "], "author": "Evan R.", "review": "Admittedly, this lasagna is the main reason I created this Yelp account. This is the best lasagna I have ever eaten. Period. \n\nI have been here countless times. Each experience is equal to the last (I hate when people say better than the last, it detracts from all the other times they have gone). \n\nThat is the first question I asked myself as I entered this modest Father/Son Italian eatery was a simple one: What is a \"Lasagneria\"? \n\nKnowing the answer to this question is completely irrelevant. \n\nThere is no point in trying to find another \"Lasagneria\". This is the one. The only one. Marcella's wins. If you've eaten here you no longer need to search for any other lasagna anywhere ever. You want to google Lasagneria? \n\nI will save you some time. Your search will return Marcella's. And it isn't because other Lasagnerias don't exist. I am sure they do. It is because no other Lasagnerias in the area are relevant. \n\nA day may come when you think to yourself, \"What about that fun family Italian joint down the road?\"\n\nForget it. \n\nOr maybe you will think, \"How about that fancy Italian restaurant with a bunch of Michelin stars?\" \n\nNope. Wrong. The correct answer was go straight to Marcella's Lasagneria. This lasagna will blow you away. \n\nOkay. Breathe. Now to pair that with some evidence. \n\nService: Every time I come into Marcella's, I feel at home. G and Massimo treat every customer with care and respect. G often works the front end of the restaurant with other excellent servers like Rory. All of them are speedy, thoughtful, polite, and have a sense of humor. If you'd like to sit quietly in the back and shovel food into your mouth - you can. But I'd recommend striking up some conversation. \n\nAmbience: It's a Father/Son Italian eatery in the Dogpatch. It isn't Saison, but it has a uniquely charming atmosphere. You feel like you've been transported out of the normal SF hustle and bustle straight to an Italian eatery in Florence. Or maybe not. I haven't been to Italy so I wouldn't actually know. \n\nFood: \n\nI will review my personal favorite: The Bianca Lasagna\n\nLet's begin with the thinly prepared sheets of hand-crafted semolina pasta. Each pasta sheet is delicate, and about as thick as cardstock. The pasta is layered among creamy Bechamel sauce, pancetta, and a variety of herbs and possibly spices. The bottom sheet of pasta coalesces and crisps up with the cheese and pancetta creating a chewy and delicious foundation to the perfect slice of lasagna. \n\nAs you work you way through the block of fresh pasta, melted cheese, pancetta, and love, you may begin to question your morals. Should you take out the person next to you so you can eat whatever they ordered? Don't do it. That is murder and is extremely wrong and illegal. Instead, you should call over the waiter or waitress and order a tray to go. I have shamefully done that before. Except when I called, I pretended there was a party that night so G and Massimo wouldn't know the entire thing wasn't only me and pass silent, but visible judgement. \n\nAnyway, all their ingredients are incredibly fresh and delicious. This is arguably the best food I have eaten at this price point. Roughly $15-18 for the meal of dreams.\n\nMy only qualm is that they are not open on weekends. But that won't stop me and it shouldn't stop you. Just go there between 11:30am and 3:30pm on a weekday. Take a long lunch. Skip work and go here. Whatever. Just figure your life out and go eat at Marcella's. You will not regret it.", "rating": 5, "date": "2017-08-01"}, {"excerpts": ["A tomato based lasagna or indulge in the creamy bianca lasagna. ", "There are so many delicious choices! "], "author": "Viyada S.", "review": "This place is great for homemade lasagna in a variety of flavors. You can get meat lasagna or veggie lasagna. A tomato based lasagna or indulge in the creamy bianca lasagna. There are so many delicious choices! The lasagnas are premade and cut and heated to order.\n\nTheir pasta dishes are yummy and I got the caprese salad and you get a big ball of burrata cheese!!!!\n\nMy only gripe is that it is salty for me. I'm really sensitive about salt so I can taste a dish when the salt is over used. So I don't go as often. But I'm sure I could ask no salt for the non lasagna dishes.", "rating": 4, "date": "2015-06-24"}, {"excerpts": ["I had the Bianca lasagna.  ", "Holy shit.  ", "So perfect! ! ", "The hints of bacon & onion all the way through.  ", "Prefect amount of sauce to filing to noodle ratio. ", "The owner was very friendly & prompt.  ", "Very great service,  great prices.. ", "I would love to see some dessert"], "author": "Kathie C.", "review": "You can definitely tell they make everything from scratch!  the Cappellini my daughter had was good,  not great but good.  Seemed to have more noodles than sauce.  \nI had the Bianca lasagna.  Holy shit.  So perfect! ! The hints of bacon & onion all the way through.  Prefect amount of sauce to filing to noodle ratio. The owner was very friendly & prompt.  Very great service,  great prices.. I would love to see some dessert", "rating": 4, "date": "2015-02-04"}, {"excerpts": ["The Bianca lasagna was perfect. ", "I've never been a fan of restaurant lasagna, but theirs is truly delicious. ", "I can't wait to try the other ones they have. ", "Service was exceptional as well. ", "The man who rung me up was very nice. ", "I will definitely be returning."], "author": "Jennifer W.", "review": "Amazing food and very friendly service! The Bianca lasagna was perfect. I've never been a fan of restaurant lasagna, but theirs is truly delicious. I can't wait to try the other ones they have. Service was exceptional as well. The man who rung me up was very nice. I will definitely be returning.", "rating": 5, "date": "2016-11-10"}, {"excerpts": ["I had the Bianca lasagna which was AMAZING! ", "I plan on coming back to try the others. ", "We had come in after they were no longer seating people and they pulled out chairs for us and served us. ", "The staff is very friendly and go above and beyond which makes you want to come back."], "author": "Amber K.", "review": "The food and service are 5 star! I had the Bianca lasagna which was AMAZING! I plan on coming back to try the others. We had come in after they were no longer seating people and they pulled out chairs for us and served us. The staff is very friendly and go above and beyond which makes you want to come back.", "rating": 5, "date": "2016-04-14"}, {"excerpts": ["If you could experience heaven through food, you would find it in the Bianca lasagna here!  ", "Incredible flavors. ", "The ultimate comfort food. "], "author": "A L.", "review": "I went for lunch with a friend for the first time yesterday. If you could experience heaven through food, you would find it in the Bianca lasagna here!  Incredible flavors. The ultimate comfort food. It was so good that I took home an Abruzzo lasagna with spicy Italian sausage. So different from the bianca, but another amazing experience. Friendly service too!", "rating": 5, "date": "2016-04-01"}], "lasagna special": [{"excerpts": ["The lasagna special is a great deal."], "author": "Diane W.", "review": "Amazing ravioli and lasagna. Everything is clearly made fresh. Best service. Great for takeout. The lasagna special is a great deal.", "rating": 4, "date": "2016-10-12"}, {"excerpts": ["I ordered the chicken caesar with no croutons, and my coworker got the Bolognaise Lasagna special. ", "Amazing food delivered right on time, and pleasant service when I had called to ask questions before placing the order, despite it being lunchtime and hectic. ", "We will definitely order from here again, and I'm glad to see that at least on Yelp they are getting the attention they deserve!"], "author": "Alyce K.", "review": "I am on a restricted diet and can't eat a lot of types of food, so when the boss treated us to a Friday lunch--our choice--I went online to find where I could get Italian food delivered. I checked UberEats and Eat24 but there was nothing enticing, then I googled Italian Delivery and came up with DoorDash. Lots of selections, and I was thrilled to see Marcella's on their list. I used to work in the Dogpatch so I know Gian Franco and Mossimo, and know their food is top-quality. I ordered the chicken caesar with no croutons, and my coworker got the Bolognaise Lasagna special. Amazing food delivered right on time, and pleasant service when I had called to ask questions before placing the order, despite it being lunchtime and hectic. We will definitely order from here again, and I'm glad to see that at least on Yelp they are getting the attention they deserve!", "rating": 5, "date": "2016-08-12"}], "the massimo panini": [], "the tuscan panini": [], "fettuccine con ragu": [], "penne puttanesca": [{"excerpts": ["The penne puttanesca is delicious as well! ", "I'm just glad they let you order trays ahead of time - perfect for big groups. ", "I had to resist the urge to tell people I made it myself! ", ":)"], "author": "B. Y.", "review": "I've eaten here only once (wish they were open more than just weekdays for lunch!) and ordered a tray of lasagna and a tray of pasta here. Love that we have this adorable, family-run gem near me!! The lasagna noodles are so tender they melt in your mouth!! The flavor of the bolognese lasagna is a bit salty for me, but the noodles make up for it. The penne puttanesca is delicious as well! I'm just glad they let you order trays ahead of time - perfect for big groups. I had to resist the urge to tell people I made it myself! :)", "rating": 4, "date": "2017-07-24"}, {"excerpts": ["Abruzzo lasagna and Penne Puttanesca pasta with mushrooms was amazing.  ", "The pasta was al-dente.  ", "The combination of ingredients for the sauce is a magical wonderland together.  ", "The lasagna was incredible as well.  ", "Perfect balance of sauce, cheese and pasta.  ", "I can not wait to go back and try more things from the menu.  ", "The food, service, and weather was perfect.   ", "We savored every morsel of food.  ", "Sat outside due to the amazing weather.  "], "author": "Anna C.", "review": "John was amazing.  He was inviting and helpful to the 1st timers at his establishment.  \n\nAbruzzo lasagna and Penne Puttanesca pasta with mushrooms was amazing.  The pasta was al-dente.  The combination of ingredients for the sauce is a magical wonderland together.  The lasagna was incredible as well.  Perfect balance of sauce, cheese and pasta.  I can not wait to go back and try more things from the menu.  The food, service, and weather was perfect.   We savored every morsel of food.  Sat outside due to the amazing weather.  Sipped a bottle of wine and enjoyed my best friend's company.  \n\nI found a new love with Italian food in the dogpatch.  We will definitely be back.", "rating": 5, "date": "2017-04-15"}, {"excerpts": ["I ordered Bolognese lasagna and my dining companion ordered penne puttanesca but they were out of penne so substituted with spaghetti.  ", "My lasagna was not edible, lacked life, reminded me with frozen section heated a few times.  ", "On to the puttanesca, it was supposed to be a pungently delicious dish except pasta was not made that day.  ", "It had an overpowering taste of anchovies and lacked ingredients specifically olives ", "but we succcessfully found about 6 capers.  ", "On a positive note, the owners son had high integrity and did not charge us."], "author": "Na H.", "review": "After spending three weeks in Italy this year, I was excited to run into Marcella's this Friday for a late lunch.  It's casual family owned which is exciting to visit and support.  We started with a caprese salad, as an uncooked dish, ingredients are everything.  I expected a healthy number of beefsteak tomatoes, basil and mozzarella.  The tomatoes were overly soft and tasteless.  The mozzarella was not fresh and did not have any taste.  There were just 4 slices of tomatoes and 2 basil leaves served on a paper plate.  I ordered Bolognese lasagna and my dining companion ordered penne puttanesca but they were out of penne so substituted with spaghetti.  My lasagna was not edible, lacked life, reminded me with frozen section heated a few times.  On to the puttanesca, it was supposed to be a pungently delicious dish except pasta was not made that day.  It had an overpowering taste of anchovies and lacked ingredients specifically olives but we succcessfully found about 6 capers.  On a positive note, the owners son had high integrity and did not charge us.", "rating": 2, "date": "2017-06-10"}], "pasta pomodoro": [], "antipasto autentico": [], "spaghetti carbonara": [{"excerpts": ["I got a lasagna for my boyfriend and a spaghetti carbonara for myself. ", "I had my spaghetti less than 10 min after walking out their doors and saved the lasagna for my boyfriend for dinner. ", "Wow. ", "I was totally blown away. ", "The noodles had a great texture and the sauce was rich and flavorful, without being too greasy. "], "author": "Ada C.", "review": "I passed by Marcella's when I first moved to the Dogpatch a few months ago, but saw that they had limited hours during lunch. After doing some Yelp searches and investigating, I determined that I would swing by for lunch the next time I was able to work from home or come home early. \n\nA month ago, I was able to make the times work and swung by for some take out. I got a lasagna for my boyfriend and a spaghetti carbonara for myself. I had my spaghetti less than 10 min after walking out their doors and saved the lasagna for my boyfriend for dinner. Wow. I was totally blown away. The noodles had a great texture and the sauce was rich and flavorful, without being too greasy. Boyfriend had the lasagna later that night and agreed that it was great. \n\nI'll definitely be back the next time I'm home during the day - great atmosphere, friendly people and amazing food!", "rating": 5, "date": "2018-07-28"}, {"excerpts": ["this time we had the spaghetti carbonara and the special of the day with Branzino.  ", "Excellent!"], "author": "Geri S.", "review": "I have always loved the mushroom lasagne...this time we had the spaghetti carbonara and the special of the day with Branzino.  Excellent!", "rating": 4, "date": "2018-10-02"}, {"excerpts": ["I prefer their spaghetti carbonara, but their lasagna is also excellent.\n\n"], "author": "Luis W.", "review": "Wonderful authentic family owned Italian restaurant. Owners are gregarious, a highlight of every visit.\nI prefer their spaghetti carbonara, but their lasagna is also excellent.\n\nA neighborhood lunchtime favorite!", "rating": 4, "date": "2017-06-20"}], "spaghetti alle vongole": [], "ravioli alla romana": [{"excerpts": ["I also tried the Ravioli alla Romana ($12.50) which is handmade and filled with mild cheese and spinach in a light tomato basil sauce and a bit of cream. ", "It was excellent! ", "Sometimes when I've mentioned the Dogpatch to people, they have immediately said \"Marcellas!"], "author": "Sara M.", "review": "They have really good lasagna, about five types of it and it seems really authentic, like homemade pasta and the right ingredients. Only open on weekdays Monday-Friday 11:30 am to 4:30 and ***3:30 to 5:00  Pick up/To Go only*** so basically you can't go there at all if you live in the Dogpatch and work during the week. You can call ahead for pickup.\n\nYou can also get a combo with bread, salad, and a soda drink, but it's like $14.50 and not necessarily worth it, and once they forgot the soda so that was disappointing. The atmosphere indoors and outdoors (umbrella table seating) seems pretty Italian (looks and feels like it).  Wish it was open on the weekend, but right now the best thing to do is get take out of the Abruzzio (I've also tried the eggplant and the Bolognese) and take it up to some rooftop with a bottle of red wine. I once bought a container of their homemade red sauce for $5 to sauce up my lasagna. I saw on their website http://www.marcellaslasagneria.com/menu.html that they also cater.\n\nI also tried the Ravioli alla Romana ($12.50) which is handmade and filled with mild cheese and spinach in a light tomato basil sauce and a bit of cream. It was excellent! Sometimes when I've mentioned the Dogpatch to people, they have immediately said \"Marcellas!\"\n\nUpdate: I returned to Marcellas around 2:30pm on a  Thursday afternoon and has a pleasant meal outside. I was in the shade but there was also some sun. I had a single table to myself as did a few other people. It was very relaxed and the person at the table across from me was casually reading a book. Another guy was completely finished but continued sitting there enjoying the sun. Very much Italy paced. Seating outside is limited so it's probably best to come after the lunch hour is over. I had a glass of Rose wine to accompany my ravioli and I think it was a good decision.", "rating": 5, "date": "2016-07-28"}], "ravioli al tartufo": [{"excerpts": ["so I ordered the Caprese salad and the Ravioli al Tartufo. \n\n"], "author": "Celia T.", "review": "Storytime: I first came here back in January. I was on a college trip from Boston and had a very carefully planned itinerary (a group of us were in the Bay area to tour tech companies/startups and such) so we ended up in Dogpatch for one visit. I was looking for a place to get lunch and it was during an absolute downpour. Yelp seemed to like this place, so I figured I'd give it a try, and boy am I glad I did. First of all, they immediately sat me and were incredibly nice, which was very comforting being by myself and coming in from the rain. I was pretty hungry so I ordered the Caprese salad and the Ravioli al Tartufo. \n\nCaprese - The ingredients were clearly very fresh, and having the greens tossed in EVOO was great - I'm personally not a huge fan of balsamic with Caprese so it was a nice touch, along with the oregano on the mozzarella.\nRavioli - I tried so hard not to inhale it and savor it as much as I could because it was SO GOOD and extremely comforting on a cool, rainy day. The pasta itself was wonderful and the black truffle sauce was amazing with it. **Pro tip** if you get bread, use it to soak up any leftover sauce after you finish the pasta. \n\nEverything I had here was fantastic - even the bread! Also, the owners were so genuinely nice and took care of me very attentively. But the craziest part of all this? I just came back here again about a month ago and ordered the same thing, and they remembered me from my order! It had been 9 MONTHS since I first went there and they still remembered me. Amazing.\n\nTL;DR it may not be fancy, but the ingredients are fresh, the food is perfectly prepared, and the people are wonderful. A winning combination as far as I'm concerned.", "rating": 5, "date": "2017-11-01"}, {"excerpts": ["My personal favorite is the Ravioli al Tartufo, although you might want to proceed with caution as it might ruin Trader Joe's truffle porcine raviolis forever for you.  "], "author": "Daniella S.", "review": "This is one of our top 3 restaurants to get lunch from at work.  Everything is SO good.  My personal favorite is the Ravioli al Tartufo, although you might want to proceed with caution as it might ruin Trader Joe's truffle porcine raviolis forever for you.  The specials of the day are always delicious; we've had most of the lasagnas on the menu and they are fantastic.\n\nAlso: John Franco is a beam of lasagna-bearing positivity on foggy sf days.", "rating": 5, "date": "2017-01-27"}], "rigatoni con pollo": [{"excerpts": ["The gentleman who assisted (our) table, John Franco, did a phenomenal job touring me and my brother through the menu, recommending the Rigatoni con Pollo which includes chardonnay sauté that he made from scratch earlier that day. ", "It turned out a great choice as it watered in my mouth, very \"al dente\" like true Italian pasta should be and amazingly delicious! ", "For dessert we enjoyed a scoop of gelato each which by the great flavor and smooth consistency one can spot it to be the real thing-", "By far, the best artesian-made gelato I've had, paired with a made-from-scratch biscotti, Y-U-M! ", "John Franco suggested a limoncello to top off the meal which did us a great deal in our tum tums to bring the good food flowing down nicely; a satisfying after feel. ", "Aside from a great authentic Italian meal, I absolutely grew fond of our server John Franco who made the experience from sitting to closing the meal an all around delightful experience for me and my brother. ", "John Franco has a wonderful, witty, all-giving personality which is a complement to the great food. ", "Rarely do me and my brother encounter service derived from the heart like Franco's. ", "He was an outstanding server! ", "Definitely will come back for the awesome food and to experience his service all over again."], "author": "Lorena C.", "review": "Truly, an authentic Italian meal and pleasant experience overall from food to service! Very pleased with the meal; ordered Chicken Rigatoni paired with Caprese Salad, both of which had great distinguishing flavor as well as a remarkable freshness. The gentleman who assisted (our) table, John Franco, did a phenomenal job touring me and my brother through the menu, recommending the Rigatoni con Pollo which includes chardonnay sauté that he made from scratch earlier that day. It turned out a great choice as it watered in my mouth, very \"al dente\" like true Italian pasta should be and amazingly delicious! For dessert we enjoyed a scoop of gelato each which by the great flavor and smooth consistency one can spot it to be the real thing-By far, the best artesian-made gelato I've had, paired with a made-from-scratch biscotti, Y-U-M! John Franco suggested a limoncello to top off the meal which did us a great deal in our tum tums to bring the good food flowing down nicely; a satisfying after feel. Aside from a great authentic Italian meal, I absolutely grew fond of our server John Franco who made the experience from sitting to closing the meal an all around delightful experience for me and my brother. John Franco has a wonderful, witty, all-giving personality which is a complement to the great food. Rarely do me and my brother encounter service derived from the heart like Franco's. He was an outstanding server! Definitely will come back for the awesome food and to experience his service all over again.", "rating": 5, "date": "2015-11-02"}], "tortelloni giganti con ripieno di costine di manzo": [], "gelato italiano": [], "fresh biscotti": [], "espresso fatto al tavola": [], "latte": [], "housemade pizzelle": []}