{"ginger ale": [], "juice": [], "bottle water": [], "ice tea": [], "tuna poki salad": [], "unagi salad": [{"excerpts": ["I would suggest the unagi salad and their ankimo. "], "author": "mark h.", "review": "I'm a first timer. Great comfortable small clean sushi rest. Very friendly workers n love the ambiance. I would suggest the unagi salad and their ankimo. I also had a chicken katsu and a couple of rolls which was pretty good. Oooo....and I loved their organic cheesecake. The sweetness of it was perfect and it was very creamy and crusty!", "rating": 4, "date": "2010-11-12"}], "three piece fried oyster": [], "six piece takoyaki": [], "chicken katsu": [{"excerpts": ["I also had a chicken katsu and a couple of rolls which was pretty good. ", "Oooo....", "and I loved their organic cheesecake. ", "The sweetness of it was perfect and it was very creamy and crusty!"], "author": "mark h.", "review": "I'm a first timer. Great comfortable small clean sushi rest. Very friendly workers n love the ambiance. I would suggest the unagi salad and their ankimo. I also had a chicken katsu and a couple of rolls which was pretty good. Oooo....and I loved their organic cheesecake. The sweetness of it was perfect and it was very creamy and crusty!", "rating": 4, "date": "2010-11-12"}], "ton katsu": [], "age dashi tofu": [], "two piece asparagus and bacon": [], "won ton soup": [], "seafood noodle": [], "beef noodle": [], "chicken noodle": [], "shrimp tempura noodle": [], "mixed vegetable noodle": [], "vegetarian temaki": [], "salmon skin temaki": [], "bacon temaki": [], "cooper temaki": [], "sake temaki": [], "maguro temaki": [], "albacore temaki": [], "hamachi temaki": [], "tai temaki": [], "hirame temaki": [], "walu temaki": [], "hotate temaki": [], "saba temaki": [], "ebi temaki": [], "unagi temaki": [], "chicken donburi": [], "beef donburi": [], "tempura donburi": [], "unagi donburi": [], "chicken katsu donburi": [], "ton katsu donburi": [], "combo": [{"excerpts": ["They also have great combo boxes that come with the selection of 3 different dishes per box. \n", "Overall great place to come with a group of friends!"], "author": "Annie C.", "review": "Came here to celebrate a friend's birthday, the atmosphere was very lively and fun! Lots of people in their 20's come to sake bomb. Happy hour is 5-7pm, the happy hour menu has a wide selection of basic rolls, appetizers, and drinks. They also have great combo boxes that come with the selection of 3 different dishes per box. \nOverall great place to come with a group of friends!", "rating": 5, "date": "2018-04-07"}, {"excerpts": ["Food here is pretty cheap, I ordered the nigiri combo and my boyfriend got the combo box. ", "Both individually under $25 so pretty cheap! ", "Quality is ok, not too fresh and the katsu chicken was soggy, but for the price it's decent. ", "I think its a great place for big gatherings and get your drink on!"], "author": "Natalie L.", "review": "Looking for a good place for a birthday party? This place can be it! For $20 all you can drink sake and beer, you sure will get your money worth and have a good time!\n\nFood here is pretty cheap, I ordered the nigiri combo and my boyfriend got the combo box. Both individually under $25 so pretty cheap! Quality is ok, not too fresh and the katsu chicken was soggy, but for the price it's decent. I think its a great place for big gatherings and get your drink on!", "rating": 3, "date": "2016-11-22"}, {"excerpts": ["I ordered the combo meal with salmon sashimi that comes with salad, soup and rice. ", "Unfortunately, the waiter forgot to bring out my soup. ", "It seemed like a great deal for $15 for 12 pieces of salmon sashimi, especially for me since I love salmon sushi. ", "However, the cuts were thin and the salad was drenched in thousand island. ", "Boyfriend ordered the chirashi which had 9 pieces of sashimi placed on top of a small scoop of rice with vegetables and roe on the side. ", "Presentation was lacking and it was the smallest chirashi I've ever seen. ", "My friend had the nigiri combo and a roll. "], "author": "Helen C.", "review": "Wasn't so impressed by this place. I was hoping that they would step up their game considering that they have competitors nearby (Zushi Puzzle, Atami & Yuzu). The one good thing is that they have happy hour drink specials on the weekends. All beer and sake are 50% off.\n\nI ordered the combo meal with salmon sashimi that comes with salad, soup and rice. Unfortunately, the waiter forgot to bring out my soup. It seemed like a great deal for $15 for 12 pieces of salmon sashimi, especially for me since I love salmon sushi. However, the cuts were thin and the salad was drenched in thousand island. Boyfriend ordered the chirashi which had 9 pieces of sashimi placed on top of a small scoop of rice with vegetables and roe on the side. Presentation was lacking and it was the smallest chirashi I've ever seen. My friend had the nigiri combo and a roll. I'd say his dishes were better.\n\nThe service was okay. Our dishes came out at separate times. It seems as though the restaurant is run by a bunch of young guys. The décor was lacking and the music was loud. Large parties started to trickle in throughout the night, making the restaurant even louder.", "rating": 3, "date": "2015-04-22"}, {"excerpts": ["The bento box combo and happy hour sake/beer deal is fantastic!  ", "It's not fancy or anything, but a comfortable and quiet place to get warm Japanese food (they have donburi and standard bento box fare) and a few rolls!"], "author": "Kari L.", "review": "This place is great for casual Japanese food.  It's low key, reasonably priced (one of those rare Marina places that isn't overpriced and has been around for a while) and the service is nice. The bento box combo and happy hour sake/beer deal is fantastic!  It's not fancy or anything, but a comfortable and quiet place to get warm Japanese food (they have donburi and standard bento box fare) and a few rolls!", "rating": 5, "date": "2016-12-09"}, {"excerpts": ["We (family of 4) ordered the following: edamame, seaweed salad, chaotic roll, beef udon soup, and a sushi combo (salmon, tuna, etc.) ", "It was all delicious. ", "The udon soup was a huge portion and easily fed our kid (they shared), with some to spare. ", "The chaotic roll was unbelievably fresh and delicious. ", "The combo was a fantastic deal at $15---tons of tasty food. \n\n"], "author": "Erin S.", "review": "We are in town for a few nights, staying at a hotel across the street. After a busy evening of sightseeing, we wanted to get as far away from Fisherman's Wharf as possible for dinner. We were craving sushi, and saw this restaurant across the street from our hotel. On a whim, we went in and WOW! Was it delicious!\n\nFirst off, it's Sunday night and they offer a 15% discount (quieter than a Fri or Sat night). We (family of 4) ordered the following: edamame, seaweed salad, chaotic roll, beef udon soup, and a sushi combo (salmon, tuna, etc.) It was all delicious. The udon soup was a huge portion and easily fed our kid (they shared), with some to spare. The chaotic roll was unbelievably fresh and delicious. The combo was a fantastic deal at $15---tons of tasty food. \n\nDefinitely flee the tourist spots for this quaint neighborhood sushi restaurant. You will be glad you did!", "rating": 4, "date": "2015-07-05"}], "moriawase combo": [], "assorted sashimi combo": [], "sushi combination": [], "piece nigiri combo": [], "chirashi combo": [], "sake": [{"excerpts": ["It was a little rowdy inside and quite a few sake bombs were taken loudly by large tables.\n", "Came with a group of four, we had some sashimi, several rolls of different variety and some Sapporo and sake.\n\n", "They don't have mixed drinks just wine,\nBeer and sake. ", "Wine list is not impressive stick to\nBeer and sake. \n", "The waitstaff definitely could be more attentive but overall it was a good time."], "author": "Jessica W.", "review": "This place is kind of a divvy sushi bar. The sushi itself is good quality, thank goodness or there may have been some issues! But it's definitely an inexpensive place with a younger crowd. \nIt was a little rowdy inside and quite a few sake bombs were taken loudly by large tables.\nCame with a group of four, we had some sashimi, several rolls of different variety and some Sapporo and sake.\n\nThey don't have mixed drinks just wine,\nBeer and sake. Wine list is not impressive stick to\nBeer and sake. \nThe waitstaff definitely could be more attentive but overall it was a good time.", "rating": 4, "date": "2017-10-15"}, {"excerpts": ["A big fan of their marina sushi roll specialty,our picture is on the wall and a lot of good looking people enjoying the sake bomb shots!! ", "All in all it's the bomb"], "author": "Izah S.", "review": "A big fan of their marina sushi roll specialty,our picture is on the wall and a lot of good looking people enjoying the sake bomb shots!! All in all it's the bomb", "rating": 5, "date": "2018-09-04"}, {"excerpts": ["Lots of people in their 20's come to sake bomb. ", "Happy hour is 5-7pm, the happy hour menu has a wide selection of basic rolls, appetizers, and drinks. "], "author": "Annie C.", "review": "Came here to celebrate a friend's birthday, the atmosphere was very lively and fun! Lots of people in their 20's come to sake bomb. Happy hour is 5-7pm, the happy hour menu has a wide selection of basic rolls, appetizers, and drinks. They also have great combo boxes that come with the selection of 3 different dishes per box. \nOverall great place to come with a group of friends!", "rating": 5, "date": "2018-04-07"}, {"excerpts": ["For $20 all you can drink sake and beer, you sure will get your money worth and have a good time!\n\n"], "author": "Natalie L.", "review": "Looking for a good place for a birthday party? This place can be it! For $20 all you can drink sake and beer, you sure will get your money worth and have a good time!\n\nFood here is pretty cheap, I ordered the nigiri combo and my boyfriend got the combo box. Both individually under $25 so pretty cheap! Quality is ok, not too fresh and the katsu chicken was soggy, but for the price it's decent. I think its a great place for big gatherings and get your drink on!", "rating": 3, "date": "2016-11-22"}, {"excerpts": ["We made a reservation for a Friday evening to try out the all you can drink sake bombs. ", "For $20 and for someone who does not love sake bombs, I was pleasantly surprised. ", "Sake was tasty, beer was cold, and the service was stellar. ", "We had about 25 people in our party but some of the other tables in the restaurant were battling us with sake bombs too! ", "A great pregame environment and well worth the $20. ", "Only complaint was it was about 80 degrees inside the restaurant...", "lots and lots of flushed cheeks even before the sake began. ", "p.s. ", "We didn't eat anything there ", "so can't give any recommendation on food."], "author": "Kara N.", "review": "We made a reservation for a Friday evening to try out the all you can drink sake bombs. For $20 and for someone who does not love sake bombs, I was pleasantly surprised. Sake was tasty, beer was cold, and the service was stellar. We had about 25 people in our party but some of the other tables in the restaurant were battling us with sake bombs too! A great pregame environment and well worth the $20. Only complaint was it was about 80 degrees inside the restaurant...lots and lots of flushed cheeks even before the sake began. p.s. We didn't eat anything there so can't give any recommendation on food.", "rating": 4, "date": "2018-02-04"}, {"excerpts": ["The #1 spot in town for 16 year olds to show their patently bogus IDs and be served sake bombs by an owner who doesn't care. ", "Must be a great profit driver. ", "I guess the tourists don't mind so "], "author": "John M.", "review": "The #1 spot in town for 16 year olds to show their patently bogus IDs and be served sake bombs by an owner who doesn't care. Must be a great profit driver. I guess the tourists don't mind so on we go. \n\nHow do these people keep their license?", "rating": 1, "date": "2018-06-06"}, {"excerpts": ["At least the bottomless sake bombs help take the edge off. \n\n"], "author": "Paola M.", "review": "SO infuriated by this place. \n\nI made reservations for 5 for my birthday. I called and they said they couldn't accommodate my group until 9:30 p.m. Okay, I accept. \n\nI show up at 9 p.m. and decipher from the small amount of English spoken that they lost my reservation because the lady who picked up the phone for me didn't write it down. I'm told we can sit at the bar and wait for the next table to open up.\n\n1,2,3,6 tables open up and over and over they refuse to seat us at one of them. People with 9:45-10p.m reservations are prioritized over us, and we are told that only 1 table in the restaurant would be okay for us... ridiculous. \n\nService was painfully slow and they lacked in every way- food came out at random times leaving some people waiting 1 hour to start eating, waiting for others to get their food. At least the bottomless sake bombs help take the edge off. \n\nCheck comes, surprise surprise: they added a 25% surcharge for having a party of 6 or more--we were a party of 5! Fraudulent too. \n\nShady, bad service, nonexistent customer service----I will NEVER be back and will warn everyone about this place.", "rating": 1, "date": "2018-02-07"}, {"excerpts": ["Happy hour is 5-10pm, so pretty much any time you'd be going to dinner, and gets you 50% off beer and sake. ", "They also have an unlimited sake and beer special which I believe is $20.\n\n"], "author": "Sara M.", "review": "Underrated. Great prices for fresh sushi and good service.\n\nLet's start with the amazing drink specials. Happy hour is 5-10pm, so pretty much any time you'd be going to dinner, and gets you 50% off beer and sake. They also have an unlimited sake and beer special which I believe is $20.\n\nSushi is yummy. We got a few sashimi orders to share and they were very generous portions. My friends love the specialty maki rolls.", "rating": 5, "date": "2017-01-16"}, {"excerpts": ["but you are going for the atmosphere and unlimited Sake Bombs ", ":) Would not go here on a date, Friday or Saturday night as you will not be able to talk with each other (Gets loud). ", "Go with a group and put your party pants on!"], "author": "Ian E.", "review": "You are going to come here for a birthday or some type of festivity. The food is okay but you are going for the atmosphere and unlimited Sake Bombs :) Would not go here on a date, Friday or Saturday night as you will not be able to talk with each other (Gets loud). Go with a group and put your party pants on!", "rating": 5, "date": "2017-11-21"}, {"excerpts": ["After weighing out the cost efficiency of AYCD and the happy hour drink menu (50% off beer and house/hot sake), we decided to go with the 50% off, as we did not think we would be spending 80 bucks on alcohol between 4 people. \n\n"], "author": "Genevieve M.", "review": "Started here for a GNO with the coworkers. Happy hour for food ends at 7pm and happy hour for drinks ends at 10pm. We were seated at about 6:50pm on a Saturday night, so we ordered as much happy hour nigiri as we could before 7. After weighing out the cost efficiency of AYCD and the happy hour drink menu (50% off beer and house/hot sake), we decided to go with the 50% off, as we did not think we would be spending 80 bucks on alcohol between 4 people. \n\nThe food:\n\n- standard for nigiri, however the rice was kind of hard..\n- ordered the Lion King roll (I am a cream cheese fanatic) and it was overall meh and the amount of cream cheese in it was insulting, if there was even any there at all\n- ordered the beef teriyaki dinner and it was super dry and overcooked\n- overall taste for everything else we ordered was satisfactory\n\nThe atmosphere:\n\n- standard sushi bar\n- Small venue, but a good amount of tables and there's a sushi bar to sit at as well\n- gets loud, as the AYCD and happy hour prices can attest to\n- service was an issue, the servers forgot multiple times things that we ordered.. so had to remind them and wait even longer.. and that's if we could even flag down a server to begin with\n\nAt a glance: only good for drinks.", "rating": 2, "date": "2016-09-05"}, {"excerpts": ["Recommend for birthdays because the Sake Bombs are BOMBBBB"], "author": "Lena M.", "review": "Honestly their service is amazing and I always have a good time when I go. Recommend for birthdays because the Sake Bombs are BOMBBBB", "rating": 5, "date": "2017-09-29"}, {"excerpts": ["This is the place to go with a big group of friends for unlimited sake bombing (2 hours for $20pp). ", "Sushi is pretty delicious as well, but with the price of sushi and sake, it can get up there for a big group.\n\n"], "author": "Kerry G.", "review": "Marina Sushi is WAY FUN on a weekend night. This is the place to go with a big group of friends for unlimited sake bombing (2 hours for $20pp). Sushi is pretty delicious as well, but with the price of sushi and sake, it can get up there for a big group.\n\nMake sure to ask if you can play your own music, they usually let you and it makes for a really fun experience!", "rating": 4, "date": "2016-02-11"}, {"excerpts": ["All beer and sake are 50% off.\n\n"], "author": "Helen C.", "review": "Wasn't so impressed by this place. I was hoping that they would step up their game considering that they have competitors nearby (Zushi Puzzle, Atami & Yuzu). The one good thing is that they have happy hour drink specials on the weekends. All beer and sake are 50% off.\n\nI ordered the combo meal with salmon sashimi that comes with salad, soup and rice. Unfortunately, the waiter forgot to bring out my soup. It seemed like a great deal for $15 for 12 pieces of salmon sashimi, especially for me since I love salmon sushi. However, the cuts were thin and the salad was drenched in thousand island. Boyfriend ordered the chirashi which had 9 pieces of sashimi placed on top of a small scoop of rice with vegetables and roe on the side. Presentation was lacking and it was the smallest chirashi I've ever seen. My friend had the nigiri combo and a roll. I'd say his dishes were better.\n\nThe service was okay. Our dishes came out at separate times. It seems as though the restaurant is run by a bunch of young guys. The décor was lacking and the music was loud. Large parties started to trickle in throughout the night, making the restaurant even louder.", "rating": 3, "date": "2015-04-22"}, {"excerpts": [", we left happy about cheap happy hour sake and beers, woke up with upset stomachs, vomiting and diarrhea. \n\n"], "author": "Liz A.", "review": "four words: upset stomachs for everyone \n\ncame here for a bday dinner, we left happy about cheap happy hour sake and beers, woke up with upset stomachs, vomiting and diarrhea. \n\nnot to mention, the food took awhile (it was busy), so i wonder if they rushed and unfortunately didn't properly serve food that was ready. unfortunate, but it is what it is.\n\notherwise, a chill place to have fun dinners for those in their early 20s who like to party.", "rating": 1, "date": "2017-05-27"}, {"excerpts": ["The one I used to go to (Sake Zone) closed down. ", "So I've been on the search ever since but have missed the mark every time till now. ", "Every dish was delicious and amazingly fresh. ", "We where so excited we forgot to take photos, LOL! ", "I am so coming back with more friends."], "author": "Crystal P.", "review": "OMG! This is now my all time favorite sushi house! The one I used to go to (Sake Zone) closed down. So I've been on the search ever since but have missed the mark every time till now. Every dish was delicious and amazingly fresh. We where so excited we forgot to take photos, LOL! I am so coming back with more friends.", "rating": 4, "date": "2017-01-28"}, {"excerpts": ["They also didn't mind at all that most tables in the restaurant were doing multiple rounds of sake bombs!\n\n", "Overall, fun and solid sushi/sake bomb experience!"], "author": "Emmy Q.", "review": "Really fun place to come with big groups. On a Thursday, my friends and I decided to organize a big group dinner for the following day. We thought it would be impossible to get a reservation anywhere for 13 people, but Marina Sushi helped us out! Once we arrived, we were seated right away and had multiple servers helping us out at all times. \n\nThe House Special roll is amazing. Deep fried rolls usually make me feel sick, but this felt fresh with that deep fried, delicious taste! If you're looking for something non-deep fried, the Fairytale Yellowtail is really great and fresh.\n\nThe nice thing about Marina Sushi is that the environment encourages you to have fun. They offered to play music from the playlists on our phones. They also didn't mind at all that most tables in the restaurant were doing multiple rounds of sake bombs!\n\nOverall, fun and solid sushi/sake bomb experience!", "rating": 4, "date": "2016-02-03"}, {"excerpts": ["Great place for a group of friends who want to sake bomb and party! ", "The wait staff is extremely attentive to groups that are sake bombing... ", "Basically they keep the sake and beer flowing if you ask them to. ", "The rolls are great and nicely priced too. ", "Get the House special for sure!"], "author": "Julia M.", "review": "Great place for a group of friends who want to sake bomb and party! The wait staff is extremely attentive to groups that are sake bombing... Basically they keep the sake and beer flowing if you ask them to. The rolls are great and nicely priced too. Get the House special for sure!", "rating": 4, "date": "2016-04-12"}, {"excerpts": ["House sake is also 50% off, but I'm not a big sake drinker, passed this time. ", "Might be a good place to sake bomb.\n\n"], "author": "Kaje Y.", "review": "Came here on a Friday evening during happy hour. \n\nAsahi, Sapporo, Kirin, all 50% off; even the large bottles. Large bottles are 6.75ish and the regular bottles are 4.xx; so it's a good deal to go drinking. House sake is also 50% off, but I'm not a big sake drinker, passed this time. Might be a good place to sake bomb.\n\nNext on the happy hour, is sushi. They have 3 hand rolls, and the rest are sashimi on rice. Each sashimi on rice comes with 2 pieces, and the hand rolls are well, hand rolls, OR 4 piece sushi. Each order is $2. A friend said the fish wasn't super fresh, but for $2 dollars, it's worth it. \n\nIt was fairly empty on friday night at 6-7pm. Service picked up just a little bit as we left around 8pm. \n\nThe music was kind of nice for me. Kick back with some emo music. They had some 98 degrees - I do, kelly clarkson - break away, lonestare - amazed, whitney houston - I will always love you, backstreet boys - drowning. \n\nYes, I recognize it all. Some one else at our table doesn't really like this kinda music, but its nice for me once in a while. Lighter music. There's a parking garage across the street... after 6pm, its 1 dollar per hour parking! Good for if you can't find street parking.", "rating": 4, "date": "2013-03-16"}, {"excerpts": ["The bento box combo and happy hour sake/beer deal is fantastic!  ", "It's not fancy or anything, but a comfortable and quiet place to get warm Japanese food (they have donburi and standard bento box fare) and a few rolls!"], "author": "Kari L.", "review": "This place is great for casual Japanese food.  It's low key, reasonably priced (one of those rare Marina places that isn't overpriced and has been around for a while) and the service is nice. The bento box combo and happy hour sake/beer deal is fantastic!  It's not fancy or anything, but a comfortable and quiet place to get warm Japanese food (they have donburi and standard bento box fare) and a few rolls!", "rating": 5, "date": "2016-12-09"}, {"excerpts": ["Especially on the sake ", ":)"], "author": "Faith B.", "review": "Love this place!  Me and my friends have been going here for 5+ years now- same owners, same great/reasonably priced sushi & great happy hour deals!  Especially on the sake :)", "rating": 5, "date": "2016-05-27"}, {"excerpts": ["Try the Ikura and their Sake/Salmon and you will see (taste;-)  ", "The staff is so friendly and the place itself has its charm- nothing fancy- pop music and TV- and Polaroid pictures!- ", "it is a family sort of place.  ", "And the price point is excellent."], "author": "Elizabeth M.", "review": "This is hands down the best quality sushi in the city.  Whenever I go to another sushi restaurant I end up disappointed because the fish quality of MSB is superior.  Try the Ikura and their Sake/Salmon and you will see (taste;-)  The staff is so friendly and the place itself has its charm- nothing fancy- pop music and TV- and Polaroid pictures!- it is a family sort of place.  And the price point is excellent.", "rating": 5, "date": "2016-01-24"}, {"excerpts": ["Second, they have a Happy Hour from 5-7 with $1.99 for some types of nigiri and rolls, half off beer/sake/sodas, and what more do you need?! ", "The service is a little below par, but who cares, I don't! ", "Go eat at Marina Sushi Bar...you will get addicted, like me! "], "author": "Casey S.", "review": "Marina Sushi Bar is LEGIT! First, the quality of their fish is amazing and it really doesn't get much better any where I have been in the city. Second, they have a Happy Hour from 5-7 with $1.99 for some types of nigiri and rolls, half off beer/sake/sodas, and what more do you need?! The service is a little below par, but who cares, I don't! Go eat at Marina Sushi Bar...you will get addicted, like me! I can't believe it took me 4 years of living in the city to try this place!\n\nAnd, the potstickers are tasty!", "rating": 5, "date": "2014-08-08"}, {"excerpts": ["The sake is amazing. ", "The super white Tuna is mouthwatering, and can we just say- ", "they won't stop you when it comes to sake bombs. ", "Came here a few months ago, and look forward to coming back, as we were the last ones to leave, PAST CLOSING ( they didn't force or push us out). ", "Super friendly waitstaff. ", "The sashimi was just melt in your mouth perfection. ", "Look forward to our next encounter here!!!"], "author": "Jen M.", "review": "Soooooo....\nPhenomenal Sashimi. The sake is amazing. The super white Tuna is mouthwatering, and can we just say- they won't stop you when it comes to sake bombs. Came here a few months ago, and look forward to coming back, as we were the last ones to leave, PAST CLOSING ( they didn't force or push us out). Super friendly waitstaff. The sashimi was just melt in your mouth perfection. Look forward to our next encounter here!!!", "rating": 5, "date": "2014-09-20"}, {"excerpts": ["Very loud crowd doing Sake bombs.  ", "Mainly a young crowd. ", "I don't know if it's like that all the time though.  ", "It was kind of annoying at times, but hey, they were having fun.  \n", "We sat at the bar. ", "The sushi chef was fast, but not talkative or engaging AT ALL.  ", "Oh well. "], "author": "L R.", "review": "Came here at about 9:45 on a Saturday night (because we got back from sight seeing so late and were starving) and the place was pumping!  Very loud crowd doing Sake bombs.  Mainly a young crowd. I don't know if it's like that all the time though.  It was kind of annoying at times, but hey, they were having fun.  \nWe sat at the bar. The sushi chef was fast, but not talkative or engaging AT ALL.  Oh well. The service was prompt, but lacked friendliness. \n\nThat being said....... We could actually taste how fresh the fish was!  It practically dissolved in our mouths. We tried sushi puzzle the night before, and although it was quieter and played more authentic music, the fish at Marina Sushi Bar surpassed sushi puzzle. \n\nI will make it a point to come here again when vacationing in San Fran.  This place is THAT good!!", "rating": 5, "date": "2014-08-18"}, {"excerpts": ["I kindly asked the manager what the hold up was while patiently waiting and she explained the problem and brought us each a glass of wonderful unfiltered sake. ", "What a nice gesture. ", "Arrigato..."], "author": "Meredith R.", "review": "Marina Bar is a great example of why second best is sometimes good enough. Think Avis \"We Try Harder.\"\n\nCase in point. This place is always my second place if I forget to call Zushi for a resv and they can't take me. I've been many, many times and while it's not the best sushi in town or in the neighborhood, it's always been a pleasant and yummy experience (though skip their miso, it's very sweet). The sushi is fresh, they have a good selection of rolls, sashimi, nigiri and other traditional dishes and the service is lovely but at times slow. All good though. \n\nLast night there was a \"rice issue\" and one of my rolls arrived quite late while my dinner partner was chowing down. I kindly asked the manager what the hold up was while patiently waiting and she explained the problem and brought us each a glass of wonderful unfiltered sake. What a nice gesture. Arrigato...", "rating": 4, "date": "2011-09-14"}, {"excerpts": ["Drink: Sake. ", "Beer if necessary. ", "Pound your fists and mix that shiz together."], "author": "Tyler H.", "review": "I absolutely love MSB. Joyce is the biggest sweetheart, and the sushi is great. Also, they allow me to rage like I'm in college again, and it's socially accepted here--big plus. Needless to say, if you're not drinking or with a large group, you're probably not going to have a great time.\n\nFood: House Special roll (spicy tuna, shrimp tempura, cream cheese and deep fried) or the Kits roll (shrimp tempura, eel, all wrapped with avocado).\n\nDrink: Sake. Beer if necessary. Pound your fists and mix that shiz together.", "rating": 5, "date": "2013-06-09"}, {"excerpts": ["This place \" Marina Sushi Bar \" is THEEEE BEST Japnese restaurant that I ever had , one of my favorite place to go for Fresh sashimi, sushi and sake place . ", "the owners are so friendly and welcoming when it comes to servicing their customers.  \n", "I love the volcano roll \" spicy \" !! ", "especially pairing with Ice COLD SAKE. ", "soo good that I always bring friends there for happy hour and dinner . ", "Oh and also they use really fresh fatty salmon ", "that I just LUV ", "so much.  ", "that the cheap kind that you get it at else where .  ", "last time I also try their UNI ~~~ ", "so delicious that I cannot resists ! \n", "anyways , if U want fresh sashimi and special rolls and good service , this is the place you need to try  ^______^"], "author": "Heather Y.", "review": "This place \" Marina Sushi Bar \" is THEEEE BEST Japnese restaurant that I ever had , one of my favorite place to go for Fresh sashimi, sushi and sake place . the owners are so friendly and welcoming when it comes to servicing their customers.  \nI love the volcano roll \" spicy \" !! especially pairing with Ice COLD SAKE. soo good that I always bring friends there for happy hour and dinner . Oh and also they use really fresh fatty salmon that I just LUV so much.  that the cheap kind that you get it at else where .  last time I also try their UNI ~~~ so delicious that I cannot resists ! \nanyways , if U want fresh sashimi and special rolls and good service , this is the place you need to try  ^______^", "rating": 5, "date": "2012-05-05"}, {"excerpts": ["We all opted for the all you can drink special and we proceeded to order several rounds of beer and sake.  ", "About 20 minutes after sitting down, we were told we could no longer sit at that table and were forced to move to the sushi bar", ", this was strange because the restaurant was not even half full at this point.  ", "We were having fun, so we didnt think too much of it.  ", "About 10 minutes after our food came, we were told by the staff to move again.  ", "We protested, but staff was literally grabbing cups and plates and moving them for us - mid meal. ", "Annoyed, we moved to our 3rd table.  ", "The rest of the night was fine as we stayed until they were closing up.  ", "When they brought the bill, it seemed outrageously high and when we investigated, we were charged the $20/person fee for all you can drink, and also charged for 20+ individual drinks amongst our group of 5.  ", "Upon protest, the staff said the all you can drink ended at 10pm which was  never made clear to us at the beginning of the night, nor when they started charging for drinks at 10pm.  ", "We refused to pay the extra charge for the drinks and two of the staff started screaming at us to pay now.  ", "As the reader, your first guess may be that we were drunk and obnoxious which is not the case.  ", "We were polite throughout the whole ordeal, including being moved twice for no reason and had our bill doubled for unjust alcohol charges.  ", "I wouldnt recommend visiting this restaurant."], "author": "Tony S.", "review": "This used to be a great place.  On our most recent visit, 5 of us walked in late on a Saturday night when there were zero customers dining.  We were told they were getting ready for a large late party and to be patient.  Fair enough, we waited a few minutes and we were seated. We all opted for the all you can drink special and we proceeded to order several rounds of beer and sake.  About 20 minutes after sitting down, we were told we could no longer sit at that table and were forced to move to the sushi bar, this was strange because the restaurant was not even half full at this point.  We were having fun, so we didnt think too much of it.  About 10 minutes after our food came, we were told by the staff to move again.  We protested, but staff was literally grabbing cups and plates and moving them for us - mid meal. Annoyed, we moved to our 3rd table.  The rest of the night was fine as we stayed until they were closing up.  When they brought the bill, it seemed outrageously high and when we investigated, we were charged the $20/person fee for all you can drink, and also charged for 20+ individual drinks amongst our group of 5.  Upon protest, the staff said the all you can drink ended at 10pm which was  never made clear to us at the beginning of the night, nor when they started charging for drinks at 10pm.  We refused to pay the extra charge for the drinks and two of the staff started screaming at us to pay now.  As the reader, your first guess may be that we were drunk and obnoxious which is not the case.  We were polite throughout the whole ordeal, including being moved twice for no reason and had our bill doubled for unjust alcohol charges.  I wouldnt recommend visiting this restaurant.", "rating": 1, "date": "2017-02-20"}, {"excerpts": ["Favorites: house special, royal king, 49er roll and of course the sake ", ":)"], "author": "Kat J.", "review": "Absolute favorite sushi bar around! They have the best service and the best prices.. Happy hour is a steal and you will leave beyond full. This is my friends go to spot for a quick dinner or a group party. They're even kind enough to deliver just down the block (sometimes walking is just too much of a task)\n\nFavorites: house special, royal king, 49er roll and of course the sake :)", "rating": 5, "date": "2012-11-21"}, {"excerpts": ["It seems like their main source of customers are the spillover from zushi puzzle and mas sake, the two more popular sushi bars on either side of the place.  ", "The people who were going to Mas Sake might not notice a difference in quality (I mean, they were going to Mas Sake) but if Zushi Puzzle has too long a wait for then Marina Sushi Bar will be a large let down.\n\n"], "author": "Jeff L.", "review": "It seems like their main source of customers are the spillover from zushi puzzle and mas sake, the two more popular sushi bars on either side of the place.  The people who were going to Mas Sake might not notice a difference in quality (I mean, they were going to Mas Sake) but if Zushi Puzzle has too long a wait for then Marina Sushi Bar will be a large let down.\n\nThe miso soup was a bit watered down. The salmon sashimi appetizer came out really cold in quite small slices. It wasn't that bad, but it compared badly to the sashimi you can get from nijaya supermarket.\n\nThe marina sushi bar roll was actually quite good. It was baked salmon on top of a crab and avocado roll. I don't think they told us the salmon was cooked on the menu, but considering the quality of their sashimi it was a good choice.\n\nAt this point the gf was refilling her soy sauce and a fly came out of the tea cup. They were very apologetic, and they explained  \"Oh, that happens because we leave the soy sauce holders next to these plants.\"  It's probably a sign that they should get fake plants. \n\nAnother roll involved tuna, shrimp and crab. That's basically what it said on the menu, they failed to add that they doused in garlic sauce.  That's fine if I'm feeling like garlic, but garlic isn't something I'm interested in when I'm getting sushi. It is possible that there was something wrong with the tuna which caused them to do this because my gf couldn't even bring herself to finish the spicy tuna handroll she ordered. My spicy scallop handroll tasted okay, but it was made so the bottom was a little soggy which was weird.\n\nI actually liked the other roll which had unagi and crab inside with some type of roe and a dash of hot sauce on top.\n\nThe service was quite decent, but without consistent quality food backing it up it is hard for that to add up to much. It would also be nice if the menu added more descriptions of what actually went into the rolls beyond the fish inside. If they want to give the customers the option of taking a flier on their chef's creativity they should add the option for omakase rolls.", "rating": 2, "date": "2011-08-06"}, {"excerpts": ["maybe if they have a sake bomb special I would try it."], "author": "Ryan E.", "review": "I just ordered from Marina Sushi Bar from the first time. Being new to the neighborhood I wanted to explore some take out sushi. The menu is huge with a lot of items, but I'm a simple guy and just wanted a Chicken Teriyaki Dinner with a California Roll. I had to wait 45 minutes to pick up my order because they were \"busy\". When I arrived there were 2 tables full. The atmosphere is not the best for a date night. It's more for a cheap place to get sushi. The entire place smells pretty fishy. \n\nThe Chicken was ok. The rice was rice. The salad dressing was alright. The California Roll was not that great. I'm not a big sushi guy and actually like the taste of imitation crab, but this crab was a bit different. It says \"special crab\" on the menu so who knows what it was. \n\nWould I go back...? Probably not. I did see a sign for $1.99 sushi...maybe if they have a sake bomb special I would try it.", "rating": 2, "date": "2013-09-30"}, {"excerpts": ["The hostess was very kind and warm and gave us free sake...awesome!\n\n"], "author": "Angie L.", "review": "On a cold and wet SF night, my friend and I found this place. The sushi was very, very good, but the service was outstanding! The hostess was very kind and warm and gave us free sake...awesome!\n\nI would definitely go back.", "rating": 5, "date": "2011-03-18"}, {"excerpts": ["The atmosphere was fun, lots of people in their 20s doing sake bombs, but that's about all this place had going for itself. ", "Then I also ordered a mix of maguro/sake sashimi. ", "The owner is really nice and brought us over a free bottle of sake to thank us for coming to the restaurant for the first time.\n\n"], "author": "Emily K.", "review": "So I bought a discount from some deal site and went for a date night. The atmosphere was fun, lots of people in their 20s doing sake bombs, but that's about all this place had going for itself. I first ordered the rainbow roll. The first time they brought the roll out it wasn't as described on the menu, so I had to send it back. The second time they brought it out, it was correct, but the flavors and textures weren't there. Then I also ordered a mix of maguro/sake sashimi. It was decent.\n\nMy biggest problem, which brought this place down from a three star to a two star was that while sitting at the bar, I noticed the sushi maker cutting from frozen fish. That just doesn't do it for me and is a big turn off. The reason I gave this place a three star still was the service. The owner is really nice and brought us over a free bottle of sake to thank us for coming to the restaurant for the first time.\n\nI'd go back with a big group of friends if I was looking for reasonably priced food and a party, but not for a date or amazing sushi.", "rating": 3, "date": "2011-03-29"}, {"excerpts": ["We had the veggie tempura, hamachi sashimi, dragon roll, and a few other things with sake too. ", "I'm super picky about sushi ", "so I wasn't amazed, but it's a good spot and they are priced well."], "author": "Sheeva G.", "review": "Pretty solid sushi and a good location. We had the veggie tempura, hamachi sashimi, dragon roll, and a few other things with sake too. I'm super picky about sushi so I wasn't amazed, but it's a good spot and they are priced well.", "rating": 3, "date": "2013-03-07"}, {"excerpts": ["1/2 price sake and beer 5 - 10pm on weekdays. ", "sushi is solid, fresh, and good. \nnot overpriced. ", "not overcrowded. ", "all in all a great place."], "author": "Danielle R.", "review": "yum!\n1/2 price sake and beer 5 - 10pm on weekdays. sushi is solid, fresh, and good. \nnot overpriced. not overcrowded. all in all a great place.", "rating": 5, "date": "2012-03-12"}, {"excerpts": ["Hot sake\n\n"], "author": "Jessica S.", "review": "I came to Marina Sushi Bar on a Saturday night and was a little skeptical at first because the place was practically empty when we walked in. There was only one other party in the back. But the good thing about this was that the service was excellent. Our server was really attentive and sweet. She came to our table many times to make sure that everything was good. The place felt really cozy and they were playing really good music, top 40, hip hop, etc. Here is what we ordered:\n\n*Salmon Sashimi\n*Spider Roll\n*Dragon Roll\n*a roll with unagi in it, can't remember which one, I know they had a couple\n*Hot sake\n\nI was pleasantly surprised at how fresh the salmon was! It was not too fishy or chewy and it felt like it just melts in your mouth. The rolls were really good, but none of them were exceptional. My favorite one was the Dragon Roll. \n\nI will absolutely be stopping in again!", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["We got a salad, Lg sashimi, sake, roll, and chef special.. ", "The sushi menu should be more creative. "], "author": "Kissy F.", "review": "I came here tonight with my mom and it was dead. My mom didn't want to come in but I dragged her in since Zushi Puzzle and Nara's was packed. \n\nThe ambiance is nice and clean, but the people who work here weren't very attentive after awhile. \n\nFood was alright. We got a salad, Lg sashimi, sake, roll, and chef special.. The sushi menu should be more creative. I think the food was overpriced for the service we received. \n\nI rather go to Nara's or ozumo's, then come back here again. \n\nI know this is harsh but, I was not happy with my service... We had to get the waitress' attention across the room several times, and that should never happen.", "rating": 2, "date": "2010-05-13"}, {"excerpts": ["Marina Sushi Bar(MSN) on the other hand is great \nsushi at a low price, and they have the best sake I have ever had!"], "author": "Michael D.", "review": "This Sushi bar is not only amazing quality, but at such a low price it's insane! I lived next door to the place for six months and I always assumed that the sushi wasn't that great just because it was never busy. Now I am a huge sushi critic and if the fish isn't fresh and good quality I refuse to go back. So I thought I would try the place just because there is a $1.99 sushi special from 5-7 every night, so why not give it a shot for some inexpensive sushi? I was surprised that the sushi was such good quality!!! Now don't get me wrong, they can't afford to have huge slices of sushi at that price, but still, it is such good quality that you are getting more than your money's worth. Also the service is great! The sushi chefs and waitresses are the best!!! Now I live close to sushi puzzle, an amazing restaurant, but I have to say the service is sub-par, and for the price it's not all that. Marina Sushi Bar(MSN) on the other hand is great \nsushi at a low price, and they have the best sake I have ever had!", "rating": 5, "date": "2011-06-03"}, {"excerpts": ["Order some sushi, grab some beers and sake and take a group. ", "The staff was very friendly and accommodating, allowing us to drag extra tables together and ignoring our obnoxious sake bomb chants. ", "You should be able to find what you are looking for on the menu as well ", "(it's pretty big). ", "Don't expect anything outside of a very standard sushi evening, but it can satisfy the cravings on those nights when it's just gotta be raw fish (and probably sake)"], "author": "Taylor C.", "review": "Not bad. The sushi is not going to blow anyone away but you can definitely make an enjoyable night here. Order some sushi, grab some beers and sake and take a group. The staff was very friendly and accommodating, allowing us to drag extra tables together and ignoring our obnoxious sake bomb chants. You should be able to find what you are looking for on the menu as well (it's pretty big). Don't expect anything outside of a very standard sushi evening, but it can satisfy the cravings on those nights when it's just gotta be raw fish (and probably sake)", "rating": 3, "date": "2012-01-29"}, {"excerpts": ["Beers and sake are hella cheap too. ", "I think I would just come here to pregame and then head out to some place better. ", "I've gone here for HH on the weekdays and every time I'm here ", "there's barely anyone else in the restaurant....."], "author": "Diane L.", "review": "If I wanted cheap sushi for HH I'll come here. The prices are hella worth it, but the quality of the fish is okay. Beers and sake are hella cheap too. I think I would just come here to pregame and then head out to some place better. I've gone here for HH on the weekdays and every time I'm here there's barely anyone else in the restaurant.....", "rating": 3, "date": "2012-03-07"}, {"excerpts": ["We stubled upon it when Mas Sake was too full to seat us, and I will never go to Mas Sake again now that I've found this little GEM!\n\n", "last time we went, they gave us a free bottle of Sake! \n\n", "I know this sounds too good to be true, but next time you're thinking about going to Mas Sake, stop, take 11 steps to the right and go to Marina Sushi Bar! ", "I promise you wont be disappointed!"], "author": "Erin H.", "review": "This place is amazing! We stubled upon it when Mas Sake was too full to seat us, and I will never go to Mas Sake again now that I've found this little GEM!\n\nThe food is amazing, the service is prompt, the prices are great, the staff is SO friendly (I've only been twice, but Joyce remembered our faces the next time we came in!) and they offer 90's kareoke... does it get any better? YES IT DOES- last time we went, they gave us a free bottle of Sake! \n\nI know this sounds too good to be true, but next time you're thinking about going to Mas Sake, stop, take 11 steps to the right and go to Marina Sushi Bar! I promise you wont be disappointed!", "rating": 5, "date": "2011-02-28"}, {"excerpts": ["If you catch Joyce on a good night, she'll join in on a sake bomb or two!  ", "Seriously, one of the best sushi restaurants in the Marina. ", "I went here when the old owners were in charge and didn't love it nearly as much!  ", "Go visit Joyce and Tom NOW!!!!"], "author": "Shannon W.", "review": "I love Marina Sushi!!! Joyce, the owner, is amazing and just became the owner two months ago. Her and her husband, Tom, own the show! The fish is fresh and delicious, and the drinks are constantly flowing. If you catch Joyce on a good night, she'll join in on a sake bomb or two!  Seriously, one of the best sushi restaurants in the Marina. I went here when the old owners were in charge and didn't love it nearly as much!  Go visit Joyce and Tom NOW!!!!", "rating": 5, "date": "2010-12-16"}, {"excerpts": ["Top 40 music was playing loud but no where as loud as Mas Sake. ", "It took a long time for us to choose anything becasue nothing caught our eye.  ", "And we noticed that most of the sushi rolls read like this, \"__, __, cucumber and avocado.\"  ", "The rolls were all the same. ", "We settled on  spicy tuna, muni, and the one with mango. ", "Meh, nothing excited me and even though i was hungry ", "I didn't want to eat my food.  ", "What annoyed me the most was that the rice on the roll was warm.  ", "I even saw steam come off the rolls when the sushi chef was preparing them.  ", "The service was all over the place ", "and they didn't seem very organized although they were freindly.  ", "They asked us if we wanted a polaroid picture to put up on the wall, which we said yes to. "], "author": "danielle l.", "review": "This is the worse sushi I have had in years.  Went here last Saturday with my boyfriend becasue the wait at Zushi Puzzle was too long.  We entered Marina Sushi and saw that most of the patrons were in their early 20's.  Top 40 music was playing loud but no where as loud as Mas Sake. It took a long time for us to choose anything becasue nothing caught our eye.  And we noticed that most of the sushi rolls read like this, \"__, __, cucumber and avocado.\"  The rolls were all the same. We settled on  spicy tuna, muni, and the one with mango. Meh, nothing excited me and even though i was hungry I didn't want to eat my food.  What annoyed me the most was that the rice on the roll was warm.  I even saw steam come off the rolls when the sushi chef was preparing them.  The service was all over the place and they didn't seem very organized although they were freindly.  They asked us if we wanted a polaroid picture to put up on the wall, which we said yes to. Cute idea.\n\nIf you want good sushi, or even okay sushi, and are in the marina, I would not come here. Sorry.", "rating": 2, "date": "2011-03-28"}, {"excerpts": ["Since I'd rather swallow a vat of lard then set foot in Mas Sake, we decided to try out Marina Sushi Bar.\n\n", "As the night progressed I predict our waitress, along with the other waitresses, snuck out the back alley connecting them with Mas Sake (this alley is fictional) to do some lines off some hooker's boot, because seriously, we sat and waited for a good 30 minutes before we even spotted someone other "], "author": "Sammy S.", "review": "I've got to say, I'm totally mystified by this stretch of Lombard. It seems to be the hot spot for skeezy bachelor parties and under-aged girls who drink 10 kamikaze shots at Silver Cloud before getting on stage to sing \"Slim Shady\" and puking mid-song, then collapsing on the sidewalk outside.\n\nIt's also the stretch that breeds \"uber-hip\" sushi bars that play techno music during your meal and feel that lighting in restaurants is so passe.\n\nAfter I spent a relaxing day in the sun, reading, laughing, and consuming liquid cheese (queso dip kids! You won't regret it) like it was going out of style, with few girlfriends, and we decided  that a late-night sushi dinner was the perfect way to rekindle our relaxation after spending 2 1/2 hours in bumper-to-bumper Marin traffic.\n\nAs we approached Zushi Puzzle with our stomachs grumbling like a thousand tiny earthquakes, we stopped dead in our tracks as we noticed the line out the door! But it's 10:30 pm! WHAAAA? Why is this place is still jumping? Do these sexy foreign men standing on the corner not know that this isn't Europe? We eat at 4:30 in America fella; I hate to break it to you.\n\nSince I'd rather swallow a vat of lard then set foot in Mas Sake, we decided to try out Marina Sushi Bar.\n\nWe were immediately seated behind a rowdy table of douchetastic men and their pregnant girlfriends (which didn't stop them from ogling my friends and making lame attempts at pick-up lines) who were celebrating a birthday, or perhaps a promotion at Google.  \nOur waitress looked about 18 years old, and it was either her first day on the job, or learning the menu items wasn't a criteria for securing the position (but looking good in hot pants was).\n\nShe was nice enough, but didn't know what inari was, forgot to bring us plates and seemed confused that we each wanted our own tray of wasabi and ginger. \n\nThe sushi was actually really tasty, but I found that the dark lighting made the fish look a little less attractive.\n\n\"Is this tuna? It looks black. Do you think I should eat it? Maybe it's gone bad. Nah, that's just the blacklight making it look inedible.\"\n\nThe prices were what you'd expect from a wannabe-Manhattan sushi bar and the service was definitely shady. As the night progressed I predict our waitress, along with the other waitresses, snuck out the back alley connecting them with Mas Sake (this alley is fictional) to do some lines off some hooker's boot, because seriously, we sat and waited for a good 30 minutes before we even spotted someone other then the sushi chef who seemed to work there.\n\nMSB is nothing spectacular and I will only be back if my friends decide to blindfold me and play mean tricks on me, or if Zushi Puzzle is too crowded (and even then, I think I'd chose the Taco Bell/KFC over this place).", "rating": 3, "date": "2007-07-31"}, {"excerpts": ["But it takes 20 minutes to get a bottle of sake?  ", "And our glasses of water went empty many minutes at a time.  ", "We asked for the check so we could make it before the close of  guest list to the next place we were going, but the \"waitress\" insisted that she try to get the bday girl as drunk as she was first.  ", "Maybe, if the waitress spent less time fraternizing at the bar, we could have been placated despite the long wait for food. ", "Maybe.  ", "It's sad when you're hella hungry and the food isn't that great "], "author": "Robert G.", "review": "\"The service here is ok, but the food is really good, so it's worth the wait,\" said our waitress. (wth?)  I don't think so.  \n\nIt took almost two hours to get our food.  We were a large group, so although that is bad, I'll cut the ever so slightest slack.  But it takes 20 minutes to get a bottle of sake?  And our glasses of water went empty many minutes at a time.  We asked for the check so we could make it before the close of  guest list to the next place we were going, but the \"waitress\" insisted that she try to get the bday girl as drunk as she was first.  Maybe, if the waitress spent less time fraternizing at the bar, we could have been placated despite the long wait for food. Maybe.  It's sad when you're hella hungry and the food isn't that great or maybe it was just too late for saving at that point.\n\nI don't like giving bad reviews, but I can't give this place any thing close to a good one.  Maybe one day I'll return and I'll have different service and I'll find out that this place isn't that bad.  But from a first time impression, I find it hard to see myself returning or recommending it to anybody even if they were standing right outside and hella craving for sushi.\n\nOh, Taco Bell is fast, cheap and nearby, if you get way too hella hungry waiting for your food to come.", "rating": 1, "date": "2008-06-30"}, {"excerpts": ["At this point I caught on that she had a little more sake than a waitress should have...", "yes, that's right", ", she had more than none.  ", "As we were trying to leave, she even got a bottle of sake for the birthday girl and started pouring it out.  ", "She kept asking where the birthday girl was.  ", "A little annoyed, I sarcastically asked 'Is it your birthday too?'  ", "Response: "], "author": "Abby A.", "review": "If I could respell BAD differently it'd be: 'Marina Sushi Bar' and I'm not talking about BAD meaning Good.  \n\nStepping into this place, you get hoaxed into thinking you'll be getting your money's worth (both in food and in service) due to the dimmmed lighting and intimite cozy restaurant feel...but we snapped out of that quickly!\n\nIt's rumored that this place handles large parties well...hmm guess I shouldn't have given into my highschool ways and trusted the hype.  My order: 1 Seaweed Salad.  1 49er roll.  I kept my order simple in lieu of the big group we had, but that didn't help much.  By the time\nI got my roll, I had already managed to order 3 regular tacos, 1 empanada, 1 beefy cheesy burrito, 1 crunch wrap, and 1 parfait for one side of the table at Taco Bell down the street (which, after this review, I will be finding and giving them 5 stars; they truly stuck to their 3 minute serving time! Pure awesomeness).  After finishing up a taco outside with a few friends, I felt it was time to go back in and give my roll a chance.  Unfortunately, I was \"welcomed back\" with a lifeless tasteless roll which I tried getting others to eat. ::sigh::  \n\nDon't get me started on the service...\n\nWithin the 2 hour wait period, our waitress managed to make herself comfortable at one end of the table.  She started chopping it up with us, like she wasn't working.  At this point I caught on that she had a little more sake than a waitress should have...yes, that's right, she had more than none.  She honestly was not reading our dismayed and hungry faces right because she went into how customer service is typically ok...\n\nAs we were trying to leave, she even got a bottle of sake for the birthday girl and started pouring it out.  She kept asking where the birthday girl was.  A little annoyed, I sarcastically asked 'Is it your birthday too?'  Response: \"Everyday's my birthday\"  which leads me to believe I won't be coming here again.\n\nRestaurant Tip: Have a non fruity option for plain water enthusiasts.  Thx!\n\nFYI:  I'm typically passive if my service and food are not so great...but this went wayyyy past my comfort zone.  Cheers Marina!", "rating": 1, "date": "2008-07-03"}, {"excerpts": ["The food here is delicious, fish is fresh and how can you go wrong with some sake??? \n\n"], "author": "KT C.", "review": "I came here with a party of 30+ people and surprisingly it was a wonderful experience.  We did a set price with the owners of the restaurant for a all you can eat/drink.  The food here is delicious, fish is fresh and how can you go wrong with some sake??? \n\nThe restaurant has two flat screen TVs and they actually play good music that helps pull in a younger crowd.  We had a wonderful time and our server was very helpful.  Parking is hard but what do you expect when your in the city?  Motel right next to it will let you park there for a small fee. Great place. Definitely recommended :)", "rating": 4, "date": "2009-01-04"}, {"excerpts": ["They have a pretty extensive sake menu and Tom has had us try everything from mid-range to top-shelf. ", "GIve it a try, and don't forget to have your Polaroid posted on the wall!"], "author": "Jaja H.", "review": "Another \"go-to\" when I'm craving sushi. When my bf and I first moved to SF, we were told to go to Zushi Puzzle. We tried but the line was way too long for our starving bellies. So we stumbled upon Marina Sushi Bar just a few doors down... and we haven't looked back since. Tom, the head sushi chef speaks Mandarin so we love sitting at the bar and chatting it up with him. He trained for years in Japan and, IMHO, his skills are legit. We find ourselves going back every time we have friends/family in town. Tom and his crew treat us like family, so why wouldn't we go back? Not only does the sushi come out presented artfully, but the cuts are generous w/ just the right ratio of rice and they always hook us up there! They have a pretty extensive sake menu and Tom has had us try everything from mid-range to top-shelf. GIve it a try, and don't forget to have your Polaroid posted on the wall!", "rating": 5, "date": "2012-06-14"}, {"excerpts": ["Nigiri was very soft, I had the Maki, Sake, and Hamachi. ", "Rolls were very nice as well. ", "A solid neighborhood sushi joint, though I wouldn't put it in the destination category."], "author": "Jeremy S.", "review": "Not a trendy establishment, more towards the Mom and Pop genre. Nigiri was very soft, I had the Maki, Sake, and Hamachi. Rolls were very nice as well. A solid neighborhood sushi joint, though I wouldn't put it in the destination category.", "rating": 3, "date": "2005-03-22"}, {"excerpts": ["I had 3 sake bombs at Ace Wasbi earlier. ", ". . . "], "author": "Heather A.", "review": "DB #1: \"Dude, I got so wasted Saturday night. . . . I had, like, 4 vodka red bulls at City Tavern. . . . . \"\n\nDB #2: \"Sweet, me and JC were at Balboa, you should have come over. . . . tons of drunk honeys\"\n\nDB #1: \"Yeah, I was a little F____ed up by then. I had 3 sake bombs at Ace Wasbi earlier. . . . . \"\n\nDB #2: \"No worries, I was pretty F_____ed up by then too. . . gotta drink wine at Balboa to get in with the cougars. . . . F____in' Kristy showed up with her skank patrol and put me on lock down tho.  Total waste of my striped shirt, dude.\"\n\nAhhhhh, who can resist listening to the standard Marina convo at the other table??\n\nSlick atmosphere, yummy sushi, service is a little ding-batty. We asked about the size of the hand rolls and she described them as a \"sushi ice cream cone\". . . .not exactly appetizing.", "rating": 4, "date": "2008-07-24"}, {"excerpts": ["REALLY came in handy after all the beer and sake "], "author": "Nenette Y.", "review": "So I'm usually not into the Marina scene, but I must say that MSB surprised me... I had a great time here last nite!\n\nWent here randomly with a group of 7 and we managed to get a nice table in the back.\n\nIt's a smaller, easy going restaurant that turns out some delicious rolls.\n\nService was friendly/efficient, rolls were yummy(especially those fried ones... REALLY came in handy after all the beer and sake we were chugging down...)\n\nAND they had house music playing (sounded like Naked Music or Thievery Corp...LOVED IT) which was the perfect pre-party for the Salted Party afterward.\n\nRecommended and I'm looking forward to returning!", "rating": 4, "date": "2007-03-31"}, {"excerpts": ["The food is great (try the volcano roll) and the beer and sake are very reasonably priced. ", "This is my VERY FAVORITE sushi restaurant in San Francisco. ", "It is perfect for large groups who want to sake bomb (upon request Joyce also pulls out 90's karaoke around 10:30 p.m.) or a quick bite. ", "Love this restaurant!!!!!!!!"], "author": "Alexis L.", "review": "I cannot say enough AMAZING things about Marina Sushi Bar. The entire staff, especially the owner, Joyce, is so friendly and attentive. The food is great (try the volcano roll) and the beer and sake are very reasonably priced. This is my VERY FAVORITE sushi restaurant in San Francisco. It is perfect for large groups who want to sake bomb (upon request Joyce also pulls out 90's karaoke around 10:30 p.m.) or a quick bite. Love this restaurant!!!!!!!!", "rating": 5, "date": "2011-11-21"}, {"excerpts": ["About 10 times better than its neighbor Mas Sake."], "author": "Bill L.", "review": "Sunnnaaaayyy!!!!\n\n\"911! get me a 49er roll and some buttahhhh!!!\"  If you can decipher what Sunny is saying, you deserve the fresh sashimi (fresh salmon is amazing) and creative rolls.  About 10 times better than its neighbor Mas Sake.", "rating": 4, "date": "2006-01-02"}, {"excerpts": ["Also, a glass of unfiltered sake comes in a martini glass, which I think is a cool twist.  ", "I recommend this place highly for those who like \"Americanized\" sushi, because the prices are lower than most places, the quality is good and the staff is friendly."], "author": "Natalie K.", "review": "I just got back from France where they don't understand the concept of creative sushi rolls, so one of my first stops was at Marina Sushi Bar.  Their rolls are excellent (although probably not the most traditional), my favorites being the Rocken' Roll and the Lombard Roll.  Also, a glass of unfiltered sake comes in a martini glass, which I think is a cool twist.  I recommend this place highly for those who like \"Americanized\" sushi, because the prices are lower than most places, the quality is good and the staff is friendly.", "rating": 3, "date": "2007-06-27"}, {"excerpts": ["She kept forgetting the sake we ordered.\n\n", "She kept trying to persuade us to have sake bombs ", "so she can drink with us.  ", "When that didn't work, she said we can't leave until she gets the birthday girl as drunk as her.  ", "She opened up another sake bottle.  ", "Then, rudely interrupted the birthday girl's boyfriend's speech because she thought it was boring ", "and she felt she could make a better one.  "], "author": "Genevieve N.", "review": "This restaurant was so bad, it compelled me to join yelp to write a review!\n\nI went with a group of my friends for a birthday dinner.  We knew since it was a big group that we were going to have to wait longer for our food.  However, waiting for over two hours is totally unacceptable!  One of my friends was so hungry, she had to go to across the street to Taco Bell just so she won't pass out.  \n\nThen we got our food and were utterly disappointed.  The sushi was worse than buffet sushi that's been sitting out there.  Another of my friends asked our waitress for wasabi.  She told him to share with the person next to him.  She was so drunk.  I can't believe she is even able to stand.  She kept forgetting the sake we ordered.\n\nAfter we finished, we were in a huge rush to go to the club because the guest list we were on was about to close.  (We got there at 730 thinking that it was enough time to make the 11pm cutoff at the club)  Our waitress would not let us leave and would not give us our check.  She kept trying to persuade us to have sake bombs so she can drink with us.  When that didn't work, she said we can't leave until she gets the birthday girl as drunk as her.  She opened up another sake bottle.  Then, rudely interrupted the birthday girl's boyfriend's speech because she thought it was boring and she felt she could make a better one.  WTF!!!!  \n\nSo, we left hungry, irritated, $40 poorer, and still had to pay the cover for the club we were going over.  Thank you Marina Sushi for a lousy night.", "rating": 1, "date": "2008-07-02"}, {"excerpts": ["So if you are going for a drunken, party scene like the one at Mas Sake - this is probably not your place.  ", "Ace Wasabis, Red Fish and Mas Sake can definitely learn from the head chef and owner Eric.  ", "Eric is always in a great mood, remembers regular guests and keeps the sake flowing!  ", "enjoy sake bombs....and then go to a spot that is \"trendy", "\" - dont waste it on your meal though!!"], "author": "Katharine H.", "review": "The problem with living in the Marina is that everyone dines at places they think are \"trendy\" instead of good.  So if you are going for a drunken, party scene like the one at Mas Sake - this is probably not your place.  But if you actually care about what you are eating - then make the trip!!\n\nMSB is amazing - I have sampled some amazing sushi and MSB is right up there.  It by far out weighs any of the \"so-called\" competition in the Marina.  Ace Wasabis, Red Fish and Mas Sake can definitely learn from the head chef and owner Eric.  Eric is always in a great mood, remembers regular guests and keeps the sake flowing!  The weight staff is chill, always friendly and on point.  \n\nAnd for the food - the fish is great quality and large cuts.  Some of my personal favorites....the spicy scallop is out of this world!!!! It is different from the run of the mill spicy scallop with excess mayo - but has an amazing flavor with just the right amount of spice!  Follow that up with a Cooper handroll, which includes crab salad, tempura shrimp, avocado, lettuce, spicy special sauce..all wrapped up in a soy wrapper....AWESOME!  After having several pieces of Nigri, plus these little treats - finish up with an Eric's special!!  This is something that is unique - and might not be a first pick on the menu....but pay attention long enough and you will see how many of these rolls Eric turns out....simple roll with tempura shrimp, crab salad, cilantro wrapped in a soy wrapper and then.....drum role please......deep fried!!!  Eric tops it off with his special sauce and it seriously blows your mind!!!!\n\nGo to MSB - enjoy the Food....enjoy sake bombs....and then go to a spot that is \"trendy\" - dont waste it on your meal though!!", "rating": 5, "date": "2009-07-01"}, {"excerpts": ["they would obviously over-charge us, trying to take advantage of our earlier sake-bombs ", ":)   ", "Nowadays I go here with 4 or less and really enjoy the great quality and the smart roll choices"], "author": "Angela T.", "review": "would be 5 stars for quality, but have had some bad experiences here.  It's been a few years, but awhile back we would go here in big groups and they would obviously over-charge us, trying to take advantage of our earlier sake-bombs :)   Nowadays I go here with 4 or less and really enjoy the great quality and the smart roll choices", "rating": 4, "date": "2007-07-06"}, {"excerpts": ["If you are in the area you have to check this place out and skip the over priced and crowded Mas Sake.   ", "You won't be disappointed."], "author": "Shelley B.", "review": "Love this place!!  I have been going here for years!!!  They always have Super fresh fish.  Eric the sushi chef sure knows how to make some good sushi.   Erics special and Kits roll are my favorite!!  If you are in the area you have to check this place out and skip the over priced and crowded Mas Sake.   You won't be disappointed.", "rating": 5, "date": "2008-11-24"}, {"excerpts": ["Very chill and soothing atmosphere, perfect if you are escaping the crazines at Mas Sake next door."], "author": "Miss Lili F.", "review": "Another one on my sushi fav lists: super fresh fish, tasty and inventive rolls, never a wait, never crowded, always good service, decent prices. This is a great place with a date or with some friends. Very chill and soothing atmosphere, perfect if you are escaping the crazines at Mas Sake next door.", "rating": 4, "date": "2006-10-20"}, {"excerpts": ["No, I love to make eating sushi a grand experience, complete with the tea, the sake, tempura veggies, edamame, pot stickers, rolls upon rolls that foreshadow what my belly will look like, and nigiri, oh bring it on! ", "So yes, I like my sushi to be an event. "], "author": "Kimberly C.", "review": "To be honest, I was a bit skeptical upon first entering this restaurant for the sole reason that it wasn't crowded enough. After researching sushi restaurants in the area before leaving, then finding the places we had as Plan A and B were closed, Marina Sushi was our third choice for sushi on a Sunday night. Apparently, lots of sushi places are closed on Sundays!\n\nTo be honest, yet again, and a good thing for a restaurant review, too, I haven't had sushi since....oh I can't even remember. When was it? Last October? September? Back when I decided to go vegan... and then three months or so later, I missed cheese too much and went to just being vegetarian. Well, Sunday night I ate fish. Does that mean I'm a pescetarian now? No, I don't think so. Because sushi is a rare occasion for me because I'm not the kind of sushi lover to pick it up as a quick lunch from some questionable shop. No, I love to make eating sushi a grand experience, complete with the tea, the sake, tempura veggies, edamame, pot stickers, rolls upon rolls that foreshadow what my belly will look like, and nigiri, oh bring it on! So yes, I like my sushi to be an event. I like it to waltz into the room and dance on my table, do a pirouette into my wasabi soy sauce and dive into my mouth in one great mouthful. \n\nThis night was a little bit more laid back. No outlandish dancing slices of fish, but rather dipping of toes into a black pond of saltiness and re-experiencing the delicacy that  good sushi can be. I was slightly nervous at the quality of the fish when I first entered the restaurant. There wasn't even a chef behind the bar. Curious. There were two other tables occupied. Quiet and somber. Foreboding, even. And yet, the tuna and salmon practically melted in my mouth. The California roll was...it was the first time I noticed the cucumber crunching in my teeth! \n\nThe highlights of my night involved the buttery white tuna, the interesting flavor of the fried banana and sweet potato roll, miso soup at the end, and basically the entire enlightening re-encounter with raw fish. Not to mention a really fantastic dinner partner. Would try this again, but I'm always hesitant to say that since there are so many other places to try!", "rating": 3, "date": "2008-06-05"}, {"excerpts": ["It's a good alternative to Mas Sake. ", "A hop, skip, jump away without the wait, congestion, and drunks."], "author": "Deanna T.", "review": "It's a good alternative to Mas Sake. A hop, skip, jump away without the wait, congestion, and drunks.", "rating": 3, "date": "2008-07-08"}, {"excerpts": ["The rolls are very fresh, the staff is always friendly and if you don't like the environment of mas sake like me, this is a great place to go.  ", "On a date or out with a group of friends this place will not disappoint you."], "author": "Eli Z.", "review": "I really wish there was a 4.5 star review since this place is great, not the very best sushi in the world but def. in the top ten in the city.  The rolls are very fresh, the staff is always friendly and if you don't like the environment of mas sake like me, this is a great place to go.  On a date or out with a group of friends this place will not disappoint you.", "rating": 4, "date": "2007-09-26"}, {"excerpts": ["I would recommend for large parties call in advance they will set up the table and have your sake and beer ready for the sake bombs while you wait for the best sushi!"], "author": "ZM S.", "review": "This is sushi at it's best!  It's fresh, and prepared with skill.  The atmosphere is elegant yet trendy!  The staff offers personal and elegant service as well.  The Spicy Tuna roll is to die for.  For those who are new to sushi try the Eric's' Special roll, Yummy!  I would recommend this restaurant to friends, family and strangers!  This is a must have!  The water offers a light yet refreshing tropical taste which is very enjoyable.  I would recommend for large parties call in advance they will set up the table and have your sake and beer ready for the sake bombs while you wait for the best sushi!", "rating": 5, "date": "2008-11-03"}, {"excerpts": ["We were skeptical when we walked in because the restaurant was almost empty, we initially wanted to eat at Mas Sake ", "but it was packed ", "so we settled on MSB. ", "It took about 20 minutes for each individual roll to come out, most of which were different then what was specified on the menu. ", "Spicy rolls were not spicy, cooked scallop rolls were raw.. it was gross.  ", "As the rolls slowly came out we asked what each one was and several times the waitress has no clue what she was serving. "], "author": "Britt N.", "review": "Don't waste your time, that is unless you plan on having a 4 hour sushi dinner.. I went to Marina Sushi Bar last night and was officially traumatized. We were skeptical when we walked in because the restaurant was almost empty, we initially wanted to eat at Mas Sake but it was packed so we settled on MSB. It took about 20 minutes for each individual roll to come out, most of which were different then what was specified on the menu. Spicy rolls were not spicy, cooked scallop rolls were raw.. it was gross.  As the rolls slowly came out we asked what each one was and several times the waitress has no clue what she was serving. One of the rolls being the MSB roll which apparently is the their own signature roll. On top of the food being less then amazing the service was also terrible.. I would never go to Marina Sushi again.", "rating": 1, "date": "2010-09-18"}, {"excerpts": ["sake bombs are good here too. ", "mike rowe, host of discovery channels dirty jobs was here when i first went and eric says he comes in like every week. ", "a nice, small, intimate, dim lit place that isnt too loud like other marina places where you have to yell out your conversation. ", "I'd come definitely back again."], "author": "Linda L.", "review": "i have been here twice and enjoyed it  both times. i usually let eric the head chef choose and make my rolls. but the eric delight is really good. sake bombs are good here too. mike rowe, host of discovery channels dirty jobs was here when i first went and eric says he comes in like every week. a nice, small, intimate, dim lit place that isnt too loud like other marina places where you have to yell out your conversation. I'd come definitely back again.", "rating": 4, "date": "2008-08-07"}], "albacore": [{"excerpts": ["I usually sit at the bar and hammer the maguro, spicey hotate, albacore, tobiko, etc. "], "author": "Benjamin F.", "review": "If you're looking for great casual sushi happy in town, then stop here. I've been a regular at Marina Sushi Bar for the past 5 years and it's a wonderful place to get your weekly sushi fix. Of the 50+ times I've eaten here, the fish is always consistent and the owners are always super friendly. It's mostly known to get a bit rowdy at night but, I'm a huge believer in their happy hour. \n\nThe happy hour menu just expanded so, much to my surprise on Monday I was able to order more things than I used to. Nigiri is $1.50 a piece (which is a steal in SF), basic rolls (kappa/tekka maki) are $3, and beer/saki are %50 off. It goes from 5-7 on weekdays so you have plenty of time to make it in after work. I usually sit at the bar and hammer the maguro, spicey hotate, albacore, tobiko, etc. Like I mentioned before, the fish is great and they are generous with their portions. \n\nIf you happen to find yourself on the north side of town and don't have happy hour plans, then come check this place out. It's dimly lit, generally pretty quiet and a great option on your way home from work. I'll surely be back next week for my \"fix\" and if you wanna join me...well, you're welcome!", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["I got the combination sashimi plate on which I they substituted the albacore for the butterfish at no additional cost which I appreciated. ", "Unfortunatley, that ended up being a bad decision on my part. ", "The butterfish, usually my favorite, was the one fish I was dissapointed by. ", "It was chewy and flavorless. "], "author": "Taylor E.", "review": "The atmosphere is a little lacking, especially the gahstly open space behind the bar. The sushi, however, I was pleasantly surprised by. I got the combination sashimi plate on which I they substituted the albacore for the butterfish at no additional cost which I appreciated. Unfortunatley, that ended up being a bad decision on my part. The butterfish, usually my favorite, was the one fish I was dissapointed by. It was chewy and flavorless. Overall the food was good but you could get a better selection of higher quality fish for a cheaper price just down the street at Zushi Puzzle. \n\nOh also they didn't have coctails. Just beer and wine, total bummer.", "rating": 3, "date": "2007-02-02"}], "albacore tataki": [], "hamachi": [{"excerpts": ["I had the uni and hamachi nigiri, the diablo roll (I liked the chop of the fish, but I usually never order rolls so this was just a  decision); my girlfriend got the dragon roll, a salmon|avocado and we both split the mixed tempura (which was beautifully prepared, compliments to the chef for his knife work). ", "As stated before, quality ingredients and definitely delicious. ", "We'll be visiting again (but maybe only for take-out as they play Pop Country music)."], "author": "Sargon O.", "review": "Absolutely amazing quality fish. The rice was just a touch warm and perfect little pearls of sweetness. I had the uni and hamachi nigiri, the diablo roll (I liked the chop of the fish, but I usually never order rolls so this was just a  decision); my girlfriend got the dragon roll, a salmon|avocado and we both split the mixed tempura (which was beautifully prepared, compliments to the chef for his knife work). As stated before, quality ingredients and definitely delicious. We'll be visiting again (but maybe only for take-out as they play Pop Country music).", "rating": 5, "date": "2018-07-15"}, {"excerpts": ["The hamachi nigiri melted in my mouth and the fish was fresh and spot on! \n\n"], "author": "Evan H.", "review": "Just tried marina sushi for the first time for dinner. The service was a bit slow but I didn't mind and overall had a great experience. \n\nThe best roll I had was the muni roll- yellowtail with shrimp tempura! The spicy tuna roll with seaweed was fantastic. The hamachi nigiri melted in my mouth and the fish was fresh and spot on! \n\nDefinitely going back", "rating": 5, "date": "2014-11-16"}, {"excerpts": ["They had options such as spicy tuna sashimi, spice tuna rolls, hamachi.  "], "author": "Sutton A.", "review": "We walked in not knowing what to expect and what a gem!! Happy hour on food and drinks on a Saturday night!!\n\nWe started ordering sashimi as soon as we sat down to ensure we took advantage of the full happy hour.  The sushi was very basic but fresh and flavorful.  They had options such as spicy tuna sashimi, spice tuna rolls, hamachi.  At first the service was slow but picked up as we continued to order.\n\nFor drinks they had large saki's, Sappora, and Kirin at 50%.\n\nWe walked out satisfied, slightly tipsy and still with money in our wallets.", "rating": 4, "date": "2013-05-08"}, {"excerpts": ["sashimi was fresh and delicious, hamachi kama was well seasoned and cooked perfectly, salads were great.  ", "The price was reasonable, vibe was friendly and comfortable, and the sole waiter taking care of a full restaurant single handed did a great job being as attentive as possible and making us feel welcomed. ", "I would easily come back here."], "author": "Nilu r.", "review": "Lots of delicious and healthy choices for a sushi lover who doesn't eat rice...sashimi was fresh and delicious, hamachi kama was well seasoned and cooked perfectly, salads were great.  The price was reasonable, vibe was friendly and comfortable, and the sole waiter taking care of a full restaurant single handed did a great job being as attentive as possible and making us feel welcomed. I would easily come back here.", "rating": 4, "date": "2013-08-13"}, {"excerpts": ["We had the veggie tempura, hamachi sashimi, dragon roll, and a few other things with sake too. ", "I'm super picky about sushi ", "so I wasn't amazed, but it's a good spot and they are priced well."], "author": "Sheeva G.", "review": "Pretty solid sushi and a good location. We had the veggie tempura, hamachi sashimi, dragon roll, and a few other things with sake too. I'm super picky about sushi so I wasn't amazed, but it's a good spot and they are priced well.", "rating": 3, "date": "2013-03-07"}, {"excerpts": ["We had the hamachi maki, tuna maki, rock and roll and dragon roll. ", "Everything tasted great, but then we ordered the spider roll. ", "Eeek. ", "the rice was hot and kinda mushy, it's nice that the crab in the roll was freshly deepfried, but then the oils get mixed in with the rice and its not just a great flavor. ", "Every other roll we tried was great tho!"], "author": "Sara D.", "review": "We had been here a few years ago and it was good but we also found a better place in the neighborhood. But there was a trubates deal going on so I figured why not try it again. Surprise apparently it had been so long that the ownership changed as did the menu. The menu is alot more appetizing in terms of the maki rolls were our favorite. \n\nWe had the hamachi maki, tuna maki, rock and roll and dragon roll. Everything tasted great, but then we ordered the spider roll. Eeek. the rice was hot and kinda mushy, it's nice that the crab in the roll was freshly deepfried, but then the oils get mixed in with the rice and its not just a great flavor. Every other roll we tried was great tho!", "rating": 4, "date": "2011-04-24"}, {"excerpts": ["Nigiri was very soft, I had the Maki, Sake, and Hamachi. ", "Rolls were very nice as well. ", "A solid neighborhood sushi joint, though I wouldn't put it in the destination category."], "author": "Jeremy S.", "review": "Not a trendy establishment, more towards the Mom and Pop genre. Nigiri was very soft, I had the Maki, Sake, and Hamachi. Rolls were very nice as well. A solid neighborhood sushi joint, though I wouldn't put it in the destination category.", "rating": 3, "date": "2005-03-22"}, {"excerpts": ["When dining at MSB, one must have the hamachi kama, grilled salmon head, and don't dare forget the oh so sliced right sashimi...", "you must include butterfish in the assortment!!!  ", "I really appreciate the fact that the soy sauce is the owner's original recipe.  ", "It is very pleasantly fragrant and not overly salty like store bought soy.  ", "Also, the miso soup is made with real benito flakes...", "how authentic is that?!  ", "The owner Joyce is always gracious, accommodating, and hospitable.  ", "The wait staff is attentive and friendly as well.  ", "Great place to eat and ", "you will leave feeling satisfied!"], "author": "Evelyn C.", "review": "When dining at MSB, one must have the hamachi kama, grilled salmon head, and don't dare forget the oh so sliced right sashimi...you must include butterfish in the assortment!!!  I really appreciate the fact that the soy sauce is the owner's original recipe.  It is very pleasantly fragrant and not overly salty like store bought soy.  Also, the miso soup is made with real benito flakes...how authentic is that?!  The owner Joyce is always gracious, accommodating, and hospitable.  The wait staff is attentive and friendly as well.  Great place to eat and you will leave feeling satisfied!", "rating": 5, "date": "2011-09-27"}, {"excerpts": ["Hamachi, Calamari, yellowtail, etc", "....  ", "i think it's overpriced because it's in yuppyville."], "author": "mark s.", "review": "For the price you pay, I can TOTALLY get better tasting and better sized sushi roll portions.  Although the fish seemed pretty fresh, the rolls tasted pretty bland.  More so, the rolls were kinda meager in filling...meaning, the seafood pieces and such- even the rice!  were so sparse and tiny. Hamachi, Calamari, yellowtail, etc....  i think it's overpriced because it's in yuppyville.", "rating": 2, "date": "2008-08-19"}], "striped bass": [], "hirame": [], "walu": [{"excerpts": ["Love the Walu and the Volcano Roll.  ", "No complaints about service at all.  ", "I'll definitely be back."], "author": "David P.", "review": "Super delicious sushi.  Love the Walu and the Volcano Roll.  No complaints about service at all.  I'll definitely be back.", "rating": 4, "date": "2012-12-03"}], "saba": [{"excerpts": ["You cqn choose from teriaki, saba, tempura nad sashimi!"], "author": "Lizzz K.", "review": "Love their dinner combos! You cqn choose from teriaki, saba, tempura nad sashimi!", "rating": 5, "date": "2017-07-11"}], "unagi": [{"excerpts": ["Their unagi is to die for! ", "I ordered the yellowtail fairy tail roll, it's moderately spicy, well priced, and you could taste how fresh the fish was! ", "So good! ", "And they keep their fish cooled at the perfect temperature, when you eat it ", "it's so refreshing. \n", "We were here around 6pm and it was very quiet, very relaxed atmosphere. ", "The wait staff was very friendly, but forgot my husband's soda until we were cashing out. \n", "I will definitely come here again."], "author": "Cassandra M.", "review": "Love the sushi happy hour! Their unagi is to die for! I ordered the yellowtail fairy tail roll, it's moderately spicy, well priced, and you could taste how fresh the fish was! So good! And they keep their fish cooled at the perfect temperature, when you eat it it's so refreshing. \nWe were here around 6pm and it was very quiet, very relaxed atmosphere. The wait staff was very friendly, but forgot my husband's soda until we were cashing out. \nI will definitely come here again.", "rating": 4, "date": "2014-12-27"}, {"excerpts": ["I actually liked the other roll which had unagi and crab inside with some type of roe and a dash of hot sauce on top.\n\n"], "author": "Jeff L.", "review": "It seems like their main source of customers are the spillover from zushi puzzle and mas sake, the two more popular sushi bars on either side of the place.  The people who were going to Mas Sake might not notice a difference in quality (I mean, they were going to Mas Sake) but if Zushi Puzzle has too long a wait for then Marina Sushi Bar will be a large let down.\n\nThe miso soup was a bit watered down. The salmon sashimi appetizer came out really cold in quite small slices. It wasn't that bad, but it compared badly to the sashimi you can get from nijaya supermarket.\n\nThe marina sushi bar roll was actually quite good. It was baked salmon on top of a crab and avocado roll. I don't think they told us the salmon was cooked on the menu, but considering the quality of their sashimi it was a good choice.\n\nAt this point the gf was refilling her soy sauce and a fly came out of the tea cup. They were very apologetic, and they explained  \"Oh, that happens because we leave the soy sauce holders next to these plants.\"  It's probably a sign that they should get fake plants. \n\nAnother roll involved tuna, shrimp and crab. That's basically what it said on the menu, they failed to add that they doused in garlic sauce.  That's fine if I'm feeling like garlic, but garlic isn't something I'm interested in when I'm getting sushi. It is possible that there was something wrong with the tuna which caused them to do this because my gf couldn't even bring herself to finish the spicy tuna handroll she ordered. My spicy scallop handroll tasted okay, but it was made so the bottom was a little soggy which was weird.\n\nI actually liked the other roll which had unagi and crab inside with some type of roe and a dash of hot sauce on top.\n\nThe service was quite decent, but without consistent quality food backing it up it is hard for that to add up to much. It would also be nice if the menu added more descriptions of what actually went into the rolls beyond the fish inside. If they want to give the customers the option of taking a flier on their chef's creativity they should add the option for omakase rolls.", "rating": 2, "date": "2011-08-06"}, {"excerpts": ["*Dragon Roll\n*a roll with unagi in it, can't remember which one", ", I know they had a couple\n", "*", "My favorite one was the Dragon Roll. \n\n"], "author": "Jessica S.", "review": "I came to Marina Sushi Bar on a Saturday night and was a little skeptical at first because the place was practically empty when we walked in. There was only one other party in the back. But the good thing about this was that the service was excellent. Our server was really attentive and sweet. She came to our table many times to make sure that everything was good. The place felt really cozy and they were playing really good music, top 40, hip hop, etc. Here is what we ordered:\n\n*Salmon Sashimi\n*Spider Roll\n*Dragon Roll\n*a roll with unagi in it, can't remember which one, I know they had a couple\n*Hot sake\n\nI was pleasantly surprised at how fresh the salmon was! It was not too fishy or chewy and it felt like it just melts in your mouth. The rolls were really good, but none of them were exceptional. My favorite one was the Dragon Roll. \n\nI will absolutely be stopping in again!", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["I would suggest the unagi salad and their ankimo. "], "author": "mark h.", "review": "I'm a first timer. Great comfortable small clean sushi rest. Very friendly workers n love the ambiance. I would suggest the unagi salad and their ankimo. I also had a chicken katsu and a couple of rolls which was pretty good. Oooo....and I loved their organic cheesecake. The sweetness of it was perfect and it was very creamy and crusty!", "rating": 4, "date": "2010-11-12"}], "tobiko": [{"excerpts": ["I usually sit at the bar and hammer the maguro, spicey hotate, albacore, tobiko, etc. "], "author": "Benjamin F.", "review": "If you're looking for great casual sushi happy in town, then stop here. I've been a regular at Marina Sushi Bar for the past 5 years and it's a wonderful place to get your weekly sushi fix. Of the 50+ times I've eaten here, the fish is always consistent and the owners are always super friendly. It's mostly known to get a bit rowdy at night but, I'm a huge believer in their happy hour. \n\nThe happy hour menu just expanded so, much to my surprise on Monday I was able to order more things than I used to. Nigiri is $1.50 a piece (which is a steal in SF), basic rolls (kappa/tekka maki) are $3, and beer/saki are %50 off. It goes from 5-7 on weekdays so you have plenty of time to make it in after work. I usually sit at the bar and hammer the maguro, spicey hotate, albacore, tobiko, etc. Like I mentioned before, the fish is great and they are generous with their portions. \n\nIf you happen to find yourself on the north side of town and don't have happy hour plans, then come check this place out. It's dimly lit, generally pretty quiet and a great option on your way home from work. I'll surely be back next week for my \"fix\" and if you wanna join me...well, you're welcome!", "rating": 4, "date": "2016-04-28"}], "butterfish roll": [], "diablo roll": [{"excerpts": ["I had the uni and hamachi nigiri, the diablo roll (I liked the chop of the fish, but I usually never order rolls so this was just a  decision); my girlfriend got the dragon roll, a salmon|avocado and we both split the mixed tempura (which was beautifully prepared, compliments to the chef for his knife work). ", "As stated before, quality ingredients and definitely delicious. ", "We'll be visiting again (but maybe only for take-out as they play Pop Country music)."], "author": "Sargon O.", "review": "Absolutely amazing quality fish. The rice was just a touch warm and perfect little pearls of sweetness. I had the uni and hamachi nigiri, the diablo roll (I liked the chop of the fish, but I usually never order rolls so this was just a  decision); my girlfriend got the dragon roll, a salmon|avocado and we both split the mixed tempura (which was beautifully prepared, compliments to the chef for his knife work). As stated before, quality ingredients and definitely delicious. We'll be visiting again (but maybe only for take-out as they play Pop Country music).", "rating": 5, "date": "2018-07-15"}], "kits roll": [{"excerpts": ["House Special roll (spicy tuna, shrimp tempura, cream cheese and deep fried) or the Kits roll (shrimp tempura, eel, all wrapped with avocado).\n\n"], "author": "Tyler H.", "review": "I absolutely love MSB. Joyce is the biggest sweetheart, and the sushi is great. Also, they allow me to rage like I'm in college again, and it's socially accepted here--big plus. Needless to say, if you're not drinking or with a large group, you're probably not going to have a great time.\n\nFood: House Special roll (spicy tuna, shrimp tempura, cream cheese and deep fried) or the Kits roll (shrimp tempura, eel, all wrapped with avocado).\n\nDrink: Sake. Beer if necessary. Pound your fists and mix that shiz together.", "rating": 5, "date": "2013-06-09"}, {"excerpts": ["Look for the Kits Roll and the Eriks Special. \n", "Thanks for climbing up our stairs."], "author": "Mike H.", "review": "MSB is the grand funk winkle! Their sushi is the best. They make you feel like family. If you feel like getting naz and have an itching to shred, this is a great spot to start. Look for the Kits Roll and the Eriks Special. \nThanks for climbing up our stairs.", "rating": 5, "date": "2009-12-05"}, {"excerpts": ["Erics special and Kits roll are my favorite!!  "], "author": "Shelley B.", "review": "Love this place!!  I have been going here for years!!!  They always have Super fresh fish.  Eric the sushi chef sure knows how to make some good sushi.   Erics special and Kits roll are my favorite!!  If you are in the area you have to check this place out and skip the over priced and crowded Mas Sake.   You won't be disappointed.", "rating": 5, "date": "2008-11-24"}, {"excerpts": ["WHAT are the Kits Roll and Eric/Mark Special. ", "The BEST! ", "I've tried a lot of the rolls and they're all so good. ", "The service is fast and friendly. ", "The environment is wonderful as well, just a really nice place to have a delicious meal at! ", "TRUST!"], "author": "Carolyn N.", "review": "I absolutely LOVE this place! I love all kinds of food so I enjoy many different types of restaurants BUT when anyone mentions Marina Sushi...I'M THERE!!! The 2 rolls that are ordered NO MATTER WHAT are the Kits Roll and Eric/Mark Special. The BEST! I've tried a lot of the rolls and they're all so good. The service is fast and friendly. The environment is wonderful as well, just a really nice place to have a delicious meal at! TRUST!", "rating": 5, "date": "2008-08-19"}], "house special roll": [{"excerpts": ["The House Special roll is amazing. ", "Deep fried rolls usually make me feel sick, but this felt fresh with that deep fried, delicious taste! "], "author": "Emmy Q.", "review": "Really fun place to come with big groups. On a Thursday, my friends and I decided to organize a big group dinner for the following day. We thought it would be impossible to get a reservation anywhere for 13 people, but Marina Sushi helped us out! Once we arrived, we were seated right away and had multiple servers helping us out at all times. \n\nThe House Special roll is amazing. Deep fried rolls usually make me feel sick, but this felt fresh with that deep fried, delicious taste! If you're looking for something non-deep fried, the Fairytale Yellowtail is really great and fresh.\n\nThe nice thing about Marina Sushi is that the environment encourages you to have fun. They offered to play music from the playlists on our phones. They also didn't mind at all that most tables in the restaurant were doing multiple rounds of sake bombs!\n\nOverall, fun and solid sushi/sake bomb experience!", "rating": 4, "date": "2016-02-03"}, {"excerpts": ["House Special roll (spicy tuna, shrimp tempura, cream cheese and deep fried) or the Kits roll (shrimp tempura, eel, all wrapped with avocado).\n\n"], "author": "Tyler H.", "review": "I absolutely love MSB. Joyce is the biggest sweetheart, and the sushi is great. Also, they allow me to rage like I'm in college again, and it's socially accepted here--big plus. Needless to say, if you're not drinking or with a large group, you're probably not going to have a great time.\n\nFood: House Special roll (spicy tuna, shrimp tempura, cream cheese and deep fried) or the Kits roll (shrimp tempura, eel, all wrapped with avocado).\n\nDrink: Sake. Beer if necessary. Pound your fists and mix that shiz together.", "rating": 5, "date": "2013-06-09"}, {"excerpts": ["The House Special Roll was SO GREAT!  ", "I wish this restaurant was in my city!  ", "Absolutely great!"], "author": "Staci S.", "review": "Happened upon this place while on vacation in SF (we used to live here).  It was great!  SUCH nice people who worked there!  Great food!  The House Special Roll was SO GREAT!  I wish this restaurant was in my city!  Absolutely great!", "rating": 5, "date": "2011-11-16"}, {"excerpts": ["I got the house special roll, and it was delicious! ", "She recommended some other items not on the menu which was nice and even gave us free saki shots on the house! ", "It was my first time here ", "and I was definitely please and will be coming back."], "author": "Jules N.", "review": "Excellent sushi with a fun atmosphere! I stumbled onto this place after getting a pedicure next door at Sassi Beauty Salon. The owner Joyce is so friendly and inviting! I got the house special roll, and it was delicious! She recommended some other items not on the menu which was nice and even gave us free saki shots on the house! It was my first time here and I was definitely please and will be coming back.", "rating": 5, "date": "2011-09-14"}], "royal king roll": [], "marina roll": [], "spicy fiesta roll": [{"excerpts": ["Try Spicy Fiesta Roll"], "author": "M P.", "review": "Delicious and very affordable. Try Spicy Fiesta Roll", "rating": 5, "date": "2014-08-25"}], "ers roll": [], "msb roll": [{"excerpts": ["Try the MSB roll, I don't walk out of there without ordering at least 1.  ", "Great casual Sushi joint!"], "author": "Prabal D.", "review": "I've been coming to Marina Sushi for years now, and it's one of my favorite sushi places in the city.  It's not the fancy posh kind of sushi spot that everyone runs to, but if quality of fish and customer service are important to you, you should definitely take an evening and go here.  Happy hour is great on sushi and drinks (5-7 every day).  Tom and Joyce (the owners) are there most days are are just fantastic people.  Salmon is ALWAYS good here among many other fish.  Try the MSB roll, I don't walk out of there without ordering at least 1.  Great casual Sushi joint!", "rating": 5, "date": "2015-09-13"}, {"excerpts": ["One of the rolls being the MSB roll which apparently is the their own signature roll. ", "On top of the food being less then amazing the service was also terrible.. ", "I would never go to Marina Sushi again."], "author": "Britt N.", "review": "Don't waste your time, that is unless you plan on having a 4 hour sushi dinner.. I went to Marina Sushi Bar last night and was officially traumatized. We were skeptical when we walked in because the restaurant was almost empty, we initially wanted to eat at Mas Sake but it was packed so we settled on MSB. It took about 20 minutes for each individual roll to come out, most of which were different then what was specified on the menu. Spicy rolls were not spicy, cooked scallop rolls were raw.. it was gross.  As the rolls slowly came out we asked what each one was and several times the waitress has no clue what she was serving. One of the rolls being the MSB roll which apparently is the their own signature roll. On top of the food being less then amazing the service was also terrible.. I would never go to Marina Sushi again.", "rating": 1, "date": "2010-09-18"}, {"excerpts": ["the msb roll is insane - they torch the top of the roll ", "and it's amazing. ", "a great spot for sushi..."], "author": "daphne n.", "review": "we love this place! my fiance and i moved to the area a year ago and have been regulars at this spot since day one. the service is always beyond friendly - whether you're eating in or snagging delivery. the msb roll is insane - they torch the top of the roll and it's amazing. a great spot for sushi...", "rating": 5, "date": "2011-08-31"}], "sunflower roll": [], "m and m roll": [], "sweet potato roll": [{"excerpts": ["And we always get a sweet potato roll. "], "author": "Suzanna G.", "review": "I went here with a friend about a week ago because Marina Sushi has always been good enough. \nI noticed the menus were different. We found out the ownership had changed about a month ago and they are making it their own. The owner was so friendly as was the waiter and sushi chef. I will say that more wait staff would be vital on a busy night but since it was when the Giants and Phillies played, the space was empty. \n\nI liked the food before but I have to say it's even better now. I loved it! So fresh, even the avocado tasted alive. The chef was even willing to try a veggie roll off the old menu to experiment (my friend is a vegetarian). I had this spicy tuna type roll that was fantastic. And we always get a sweet potato roll. This may have been one of my favorite. \n\nThey couldn't have been kinder and I was so impressed with the food, and I'm picky. I have my favorite and rarely deviate. \n\nThey also have this sour apple Saki they had us try that was awesome, and I don't like girlie drinks. \n\nOverall, new owners, better food, friendly staff. I can't wait to go back. If you haven't been in a long time, I suggest you go back to see what's new.", "rating": 4, "date": "2010-10-27"}, {"excerpts": ["The highlights of my night involved the buttery white tuna, the interesting flavor of the fried banana and sweet potato roll, miso soup at the end, and basically the entire enlightening re-encounter with raw fish. ", "Not to mention a really fantastic dinner partner. ", "Would try this again, but I'm always hesitant to say that since there are so many other places to try!"], "author": "Kimberly C.", "review": "To be honest, I was a bit skeptical upon first entering this restaurant for the sole reason that it wasn't crowded enough. After researching sushi restaurants in the area before leaving, then finding the places we had as Plan A and B were closed, Marina Sushi was our third choice for sushi on a Sunday night. Apparently, lots of sushi places are closed on Sundays!\n\nTo be honest, yet again, and a good thing for a restaurant review, too, I haven't had sushi since....oh I can't even remember. When was it? Last October? September? Back when I decided to go vegan... and then three months or so later, I missed cheese too much and went to just being vegetarian. Well, Sunday night I ate fish. Does that mean I'm a pescetarian now? No, I don't think so. Because sushi is a rare occasion for me because I'm not the kind of sushi lover to pick it up as a quick lunch from some questionable shop. No, I love to make eating sushi a grand experience, complete with the tea, the sake, tempura veggies, edamame, pot stickers, rolls upon rolls that foreshadow what my belly will look like, and nigiri, oh bring it on! So yes, I like my sushi to be an event. I like it to waltz into the room and dance on my table, do a pirouette into my wasabi soy sauce and dive into my mouth in one great mouthful. \n\nThis night was a little bit more laid back. No outlandish dancing slices of fish, but rather dipping of toes into a black pond of saltiness and re-experiencing the delicacy that  good sushi can be. I was slightly nervous at the quality of the fish when I first entered the restaurant. There wasn't even a chef behind the bar. Curious. There were two other tables occupied. Quiet and somber. Foreboding, even. And yet, the tuna and salmon practically melted in my mouth. The California roll was...it was the first time I noticed the cucumber crunching in my teeth! \n\nThe highlights of my night involved the buttery white tuna, the interesting flavor of the fried banana and sweet potato roll, miso soup at the end, and basically the entire enlightening re-encounter with raw fish. Not to mention a really fantastic dinner partner. Would try this again, but I'm always hesitant to say that since there are so many other places to try!", "rating": 3, "date": "2008-06-05"}], "vegetable tempura roll": [], "chicken teriyaki roll": [], "sexy lizzy roll": [], "chaotic roll": [{"excerpts": ["We (family of 4) ordered the following: edamame, seaweed salad, chaotic roll, beef udon soup, and a sushi combo (salmon, tuna, etc.) ", "It was all delicious. ", "The udon soup was a huge portion and easily fed our kid (they shared), with some to spare. ", "The chaotic roll was unbelievably fresh and delicious. ", "The combo was a fantastic deal at $15---tons of tasty food. \n\n"], "author": "Erin S.", "review": "We are in town for a few nights, staying at a hotel across the street. After a busy evening of sightseeing, we wanted to get as far away from Fisherman's Wharf as possible for dinner. We were craving sushi, and saw this restaurant across the street from our hotel. On a whim, we went in and WOW! Was it delicious!\n\nFirst off, it's Sunday night and they offer a 15% discount (quieter than a Fri or Sat night). We (family of 4) ordered the following: edamame, seaweed salad, chaotic roll, beef udon soup, and a sushi combo (salmon, tuna, etc.) It was all delicious. The udon soup was a huge portion and easily fed our kid (they shared), with some to spare. The chaotic roll was unbelievably fresh and delicious. The combo was a fantastic deal at $15---tons of tasty food. \n\nDefinitely flee the tourist spots for this quaint neighborhood sushi restaurant. You will be glad you did!", "rating": 4, "date": "2015-07-05"}], "maui roll": [{"excerpts": ["Maui Roll rocks my world.  ", "My best friend talks about it every single time we get on the damn phone.  ", "When you don't want to scene next door, pop over here."], "author": "Jenny S.", "review": "5 stars alone for being gracious in the face of a truly embarassing experience.  Stopped in for a quick bite while my laundry was washing around the corner.  Enjoyed my dinner... went to pay... heart drops to the floor.  No Wallet.  All alone.  NEVER happens.  But it did that night.  Darling Sonny says, no problem!  You pay next time!  I said no way- I'll be back in 10 minutes.  I'm amazed I didn't kill a pedestrian with the speed I drove to my apartment and back to MSB.  Sonny laughed at me.\n\nBut down to brass tacks.  Maui Roll rocks my world.  My best friend talks about it every single time we get on the damn phone.  When you don't want to scene next door, pop over here.", "rating": 5, "date": "2006-06-01"}, {"excerpts": ["We got the maui roll (mango and tuna) and I decided just to eat the tuna out of the roll and it wasn't that fresh.  ", "We also got the soft shell crab roll - and ", "I thought the soft shell crab was pretty good but the roll itself also had teriyaki sauce in it too.  ", "Truth be told, the night started off poorly with our endamame order - it was way overcooked - and not warm", ", it was like it had been sitting out for an hour or so.\n", "The service was a little dismal - it was like we were constantly looking for our waitress and never managed to track her down when we needed her.\n", "The things I really liked about this place was it is a nice atmosphere - not crazy loud like Ace Wasabi's -- and the prices are really good, this place is not pretentious and it feels like a neighborhood mom and pop kind of establishment which is also a nice change from the other restaurants in the marina."], "author": "Katie P.", "review": "Not a solid 2, more like a 2.5\nI thought the Sonny's delight was a really great roll (shrimp tempura roll with lots of fresh crab on top) - the other rolls we got, I was not too impressed with.  I felt like there was a lot of teriyaki sauce or something on the roll which masked the taste of the fish.  We got the maui roll (mango and tuna) and I decided just to eat the tuna out of the roll and it wasn't that fresh.  We also got the soft shell crab roll - and I thought the soft shell crab was pretty good but the roll itself also had teriyaki sauce in it too.  Truth be told, the night started off poorly with our endamame order - it was way overcooked - and not warm, it was like it had been sitting out for an hour or so.\nThe service was a little dismal - it was like we were constantly looking for our waitress and never managed to track her down when we needed her.\nThe things I really liked about this place was it is a nice atmosphere - not crazy loud like Ace Wasabi's -- and the prices are really good, this place is not pretentious and it feels like a neighborhood mom and pop kind of establishment which is also a nice change from the other restaurants in the marina.", "rating": 2, "date": "2007-01-18"}, {"excerpts": ["The Maui roll is to die for.  ", "I usually hate overdone American-style rolls, but it's damn good."], "author": "Jordan B.", "review": "What can I say, I love MSB.  One of my favs.  There is better quality sushi in town (esp. Zushi Puzzle), but Sonny and co. do a great job and you will not be disappointed.  If possible, I would recommend sitting at the bar to ensure faster service.  Good prices given the area.   This is a good date spot too--quiet but sufficiently classy atmosphere.  The Maui roll is to die for.  I usually hate overdone American-style rolls, but it's damn good.", "rating": 5, "date": "2008-04-12"}], "fairytale yellowtail roll": [], "giants roll": [], "golden california roll": [], "dragon roll": [{"excerpts": ["I had the uni and hamachi nigiri, the diablo roll (I liked the chop of the fish, but I usually never order rolls so this was just a  decision); my girlfriend got the dragon roll, a salmon|avocado and we both split the mixed tempura (which was beautifully prepared, compliments to the chef for his knife work). ", "As stated before, quality ingredients and definitely delicious. ", "We'll be visiting again (but maybe only for take-out as they play Pop Country music)."], "author": "Sargon O.", "review": "Absolutely amazing quality fish. The rice was just a touch warm and perfect little pearls of sweetness. I had the uni and hamachi nigiri, the diablo roll (I liked the chop of the fish, but I usually never order rolls so this was just a  decision); my girlfriend got the dragon roll, a salmon|avocado and we both split the mixed tempura (which was beautifully prepared, compliments to the chef for his knife work). As stated before, quality ingredients and definitely delicious. We'll be visiting again (but maybe only for take-out as they play Pop Country music).", "rating": 5, "date": "2018-07-15"}, {"excerpts": ["We had the veggie tempura, hamachi sashimi, dragon roll, and a few other things with sake too. ", "I'm super picky about sushi ", "so I wasn't amazed, but it's a good spot and they are priced well."], "author": "Sheeva G.", "review": "Pretty solid sushi and a good location. We had the veggie tempura, hamachi sashimi, dragon roll, and a few other things with sake too. I'm super picky about sushi so I wasn't amazed, but it's a good spot and they are priced well.", "rating": 3, "date": "2013-03-07"}, {"excerpts": ["We had the hamachi maki, tuna maki, rock and roll and dragon roll. ", "Everything tasted great, but then we ordered the spider roll. ", "Eeek. ", "the rice was hot and kinda mushy, it's nice that the crab in the roll was freshly deepfried, but then the oils get mixed in with the rice and its not just a great flavor. ", "Every other roll we tried was great tho!"], "author": "Sara D.", "review": "We had been here a few years ago and it was good but we also found a better place in the neighborhood. But there was a trubates deal going on so I figured why not try it again. Surprise apparently it had been so long that the ownership changed as did the menu. The menu is alot more appetizing in terms of the maki rolls were our favorite. \n\nWe had the hamachi maki, tuna maki, rock and roll and dragon roll. Everything tasted great, but then we ordered the spider roll. Eeek. the rice was hot and kinda mushy, it's nice that the crab in the roll was freshly deepfried, but then the oils get mixed in with the rice and its not just a great flavor. Every other roll we tried was great tho!", "rating": 4, "date": "2011-04-24"}, {"excerpts": ["*Dragon Roll\n*a roll with unagi in it, can't remember which one", ", I know they had a couple\n", "*", "My favorite one was the Dragon Roll. \n\n"], "author": "Jessica S.", "review": "I came to Marina Sushi Bar on a Saturday night and was a little skeptical at first because the place was practically empty when we walked in. There was only one other party in the back. But the good thing about this was that the service was excellent. Our server was really attentive and sweet. She came to our table many times to make sure that everything was good. The place felt really cozy and they were playing really good music, top 40, hip hop, etc. Here is what we ordered:\n\n*Salmon Sashimi\n*Spider Roll\n*Dragon Roll\n*a roll with unagi in it, can't remember which one, I know they had a couple\n*Hot sake\n\nI was pleasantly surprised at how fresh the salmon was! It was not too fishy or chewy and it felt like it just melts in your mouth. The rolls were really good, but none of them were exceptional. My favorite one was the Dragon Roll. \n\nI will absolutely be stopping in again!", "rating": 4, "date": "2010-05-09"}], "black imagine woman roll": [], "shrimp tempura roll": [{"excerpts": ["Not a solid 2, more like a 2.5\nI thought the Sonny's delight was a really great roll (shrimp tempura roll with lots of fresh crab on top) - the other rolls we got, I was not too impressed with.  ", "I felt like there was a lot of teriyaki sauce or something on the roll which masked the taste of the fish.  "], "author": "Katie P.", "review": "Not a solid 2, more like a 2.5\nI thought the Sonny's delight was a really great roll (shrimp tempura roll with lots of fresh crab on top) - the other rolls we got, I was not too impressed with.  I felt like there was a lot of teriyaki sauce or something on the roll which masked the taste of the fish.  We got the maui roll (mango and tuna) and I decided just to eat the tuna out of the roll and it wasn't that fresh.  We also got the soft shell crab roll - and I thought the soft shell crab was pretty good but the roll itself also had teriyaki sauce in it too.  Truth be told, the night started off poorly with our endamame order - it was way overcooked - and not warm, it was like it had been sitting out for an hour or so.\nThe service was a little dismal - it was like we were constantly looking for our waitress and never managed to track her down when we needed her.\nThe things I really liked about this place was it is a nice atmosphere - not crazy loud like Ace Wasabi's -- and the prices are really good, this place is not pretentious and it feels like a neighborhood mom and pop kind of establishment which is also a nice change from the other restaurants in the marina.", "rating": 2, "date": "2007-01-18"}], "philly roll": [], "alaska roll": [], "spring breeze roll": [], "crispy roll": [], "rainbow roll": [{"excerpts": ["I first ordered the rainbow roll. ", "The first time they brought the roll out it wasn't as described on the menu, so I had to send it back. ", "The second time they brought it out, it was correct, but the flavors and textures weren't there. "], "author": "Emily K.", "review": "So I bought a discount from some deal site and went for a date night. The atmosphere was fun, lots of people in their 20s doing sake bombs, but that's about all this place had going for itself. I first ordered the rainbow roll. The first time they brought the roll out it wasn't as described on the menu, so I had to send it back. The second time they brought it out, it was correct, but the flavors and textures weren't there. Then I also ordered a mix of maguro/sake sashimi. It was decent.\n\nMy biggest problem, which brought this place down from a three star to a two star was that while sitting at the bar, I noticed the sushi maker cutting from frozen fish. That just doesn't do it for me and is a big turn off. The reason I gave this place a three star still was the service. The owner is really nice and brought us over a free bottle of sake to thank us for coming to the restaurant for the first time.\n\nI'd go back with a big group of friends if I was looking for reasonably priced food and a party, but not for a date or amazing sushi.", "rating": 3, "date": "2011-03-29"}], "salmon head": [{"excerpts": ["When dining at MSB, one must have the hamachi kama, grilled salmon head, and don't dare forget the oh so sliced right sashimi...", "you must include butterfish in the assortment!!!  ", "I really appreciate the fact that the soy sauce is the owner's original recipe.  ", "It is very pleasantly fragrant and not overly salty like store bought soy.  ", "Also, the miso soup is made with real benito flakes...", "how authentic is that?!  ", "The owner Joyce is always gracious, accommodating, and hospitable.  ", "The wait staff is attentive and friendly as well.  ", "Great place to eat and ", "you will leave feeling satisfied!"], "author": "Evelyn C.", "review": "When dining at MSB, one must have the hamachi kama, grilled salmon head, and don't dare forget the oh so sliced right sashimi...you must include butterfish in the assortment!!!  I really appreciate the fact that the soy sauce is the owner's original recipe.  It is very pleasantly fragrant and not overly salty like store bought soy.  Also, the miso soup is made with real benito flakes...how authentic is that?!  The owner Joyce is always gracious, accommodating, and hospitable.  The wait staff is attentive and friendly as well.  Great place to eat and you will leave feeling satisfied!", "rating": 5, "date": "2011-09-27"}], "plum wine float": [], "tempura ice cream with banana": []}