{"marios house salad": [], "grilled chicken": [{"excerpts": ["Let me just start by saying I still have dreams of the Grilled Chicken 2 sandwich. ", "Dreams! ", "It was that good. ", "I'm lactose intolerant but said eff it, I want the whole thing, which was not a disappointing decision. ", "The chicken was cooked perfectly and paired just right. "], "author": "Stephen P.", "review": "Let me just start by saying I still have dreams of the Grilled Chicken 2 sandwich. Dreams! It was that good. I'm lactose intolerant but said eff it, I want the whole thing, which was not a disappointing decision. The chicken was cooked perfectly and paired just right. I could write this entire review about that sandwich. \n\nBut I won't because the shop itself is great too! The interior is decorated quite kitschy with lots of signs and posters but it works. I think it brings the whole shop feel together and makes the environment feel very unique. Definitely a great hangout spot or a place to bring a date.\n\nOur servers were really friendly too and were attentive to my party by keeping the wine coming as well. My only regret is not getting the delicious desserts that the people around us were having because they looked so good. Looks like I'll have to come back.", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["Got the grilled chicken #2 oven backed focaccia sandwich and an Italian soda- great! ", "Honestly one of the best sandwiches I've had. ", "Super tasty. ", "Neat little cafe, cool atmosphere. ", "Server at the bar wasn't super friendly ", "but I can look past that for some great food. ", "Good lunch stop in North Beach/Little Italy!"], "author": "Kalena H.", "review": "Got the grilled chicken #2 oven backed focaccia sandwich and an Italian soda- great! Honestly one of the best sandwiches I've had. Super tasty. Neat little cafe, cool atmosphere. Server at the bar wasn't super friendly but I can look past that for some great food. Good lunch stop in North Beach/Little Italy!", "rating": 5, "date": "2018-07-02"}, {"excerpts": ["We also had the grilled chicken #1 sammy- dijon mustard, pepper jack cheese, and onions on the amazing focaccia bread. ", "This one was good too. "], "author": "Elizabeth C.", "review": "Not all of us ordered food, but those that did were really satisfied. We had lasagna, which had a bit of a sweet flavor to it. My fave dish of the night, the oven baked meatball sammy with swiss cheese, onions, and marinara on onion focaccia bread. The focaccia, which came highly recommended lived up to the hype. The crunch of the bread combined with melted cheese and warm sauce was a great combination. We also had the grilled chicken #1 sammy- dijon mustard, pepper jack cheese, and onions on the amazing focaccia bread. This one was good too. I had the caprese salad- fresh mozzarella, sliced tomatoes, and fresh basil pesto. This was tasty, the pesto was awesome. Mario's is priced right, the service is excellent, and the food is terrific.\nFor a more detailed review visit:\n\nhttp://consumingcolumbus.blogspot.com/2013/03/marios-bohemian-cigar-store-cafe-is.html", "rating": 4, "date": "2013-03-22"}, {"excerpts": ["Reading the newspaper while eating the #2 grilled chicken sandwich (request it open faced!) was the best way to spend this relaxing, sunny Saturday. \n\n", "and grilled chicken sandwich open faced. ", "The caprese salad would be more delightful sans the pesto sauce but other than that", ", I've heard good things about their other sandwich and panini options."], "author": "Lan H.", "review": "Love this place!! I woke up this Saturday with no real plans for the morning/early afternoon and wandered to Marios for a cup of coffee and a foccacia sandwich. Reading the newspaper while eating the #2 grilled chicken sandwich (request it open faced!) was the best way to spend this relaxing, sunny Saturday. \n\nMario has a very attentive staff and great food, although I found myself walking past it for several months before walking in and trying it out. It isn't ideal for large groups, but a great place for intimate coffee or brunch/lunch time w/ friends. The ideal seating would be the front table away from the draft that comes from opening and closing the door. \n\nAgain, I recommend the coffee, espresso (strong!) and grilled chicken sandwich open faced. The caprese salad would be more delightful sans the pesto sauce but other than that, I've heard good things about their other sandwich and panini options.", "rating": 4, "date": "2009-06-06"}, {"excerpts": ["We tried the meatball sandwich and it's one of the best I've had (and I have tried maaaany meatball subs) and the grilled chicken salad. "], "author": "Asli T.", "review": "Ok so I had one day in San Fransisco and decided to try out this place and I'm so glad I did. \n\nIt's a small place. 10 people can sit at the bar and there are about 10 tables. \n\nThere is no back kitchen. If you're sitting at the bar, you can watch them make your food. Right behind the counter is where they prep everything in a big fire oven. \n\nWhen you ask for a sub, that's when they throw in the dough in their oven and the break bakes right then and there. \n\nWe tried the meatball sandwich and it's one of the best I've had (and I have tried maaaany meatball subs) and the grilled chicken salad. Both greaaaaat. \n\nThe cakes sitting at the counter were hard to resist but i somehow did.\n\nHaving said that... I'm taking a star off because the staff can be a bit moody (not rude..just kinda cranky) and slow at times. I waited 10 minutes to see if they will ever refill my coffee (i was sitting right across from 2 workers at the bar) and then gave up and asked for it. I didn't mind their personalities it as much as someone else might.", "rating": 4, "date": "2009-11-30"}, {"excerpts": ["- I had the grilled chicken #1 - the foccacia was perfect and good enough to eat by itself. ", "I was dissapointed it didn't come with any sides ", "- fries would've been nice or even a bag of chips. ", "It did come with pepperoncinis which I absolutely love. "], "author": "O'Shea J.", "review": "Decent sandwich - I had the grilled chicken #1 - the foccacia was perfect and good enough to eat by itself. I was dissapointed it didn't come with any sides - fries would've been nice or even a bag of chips. It did come with pepperoncinis which I absolutely love. They got gobbled up before I even started on the sandwich. \n\nThe establishment is quite small so if it's just you and a friend you'll be fine but anymore than that and space will become a premium.\n\nI hear the meatball sandwich is crazy good.", "rating": 3, "date": "2010-03-03"}, {"excerpts": ["My favorites are the salami panini, and grilled chicken #1 and #2 focaccia sandwiches.  ", "They do a great home made tiramisu too!"], "author": "SunnyandNolan E.", "review": "Sunny: I had their salami panini on a baguette. Absolutely fantastic: hot, crispy and flavorful. Simple ingredients, but the combination, with the panini press and voila! I would love to visit this place again. The atmosphere and friendly staff are great. \n\nNolan: Mario's is one of my favorite hang outs in north beach, it is a great place to be a regular at.  Their panini's are and focaccia sandwiches are delicious, great to enjoy on a nice day in the park or on a colder day in the restaurant with a pint.  My favorites are the salami panini, and grilled chicken #1 and #2 focaccia sandwiches.  They do a great home made tiramisu too!", "rating": 5, "date": "2009-10-11"}, {"excerpts": ["Order the grilled chicken #1 (especially if you like dijon mustard), grab the Onion paper off the counter, and enjoy one of those rare sunny San Francisco days."], "author": "Yasmine G.", "review": "I have a weakness for focaccia sandwiches and funky cafe names, and Mario's does not disappoint.  Order the grilled chicken #1 (especially if you like dijon mustard), grab the Onion paper off the counter, and enjoy one of those rare sunny San Francisco days.", "rating": 4, "date": "2006-04-21"}, {"excerpts": ["So, I had the grilled chicken ", "#2.  ", "It was good, ", "but, I've had just as good at other places for less money.  ", "It's a great location, right across the street from the park, for people and dog watching, of which I enjoy.    ", "However, I feel my friends hyped this place up too much.  ", "So much so that my expectations were probably impossible to meet."], "author": "Magdalena ..", "review": "Met friends for lunch here yesterday and though I enjoyed the food and the company, I didn't get what the big deal was about these sandwiches.  Maybe if I'd had their signature sandwiches, Meatball, or Sausage, I would have had a better idea.  But, they were out of both.  So, I had the grilled chicken #2.  It was good, but, I've had just as good at other places for less money.  It's a great location, right across the street from the park, for people and dog watching, of which I enjoy.    However, I feel my friends hyped this place up too much.  So much so that my expectations were probably impossible to meet.", "rating": 3, "date": "2007-09-04"}, {"excerpts": ["Get a focaccia sandwich - grilled chicken #2, meatball, veggie are all truly notable - and an italian soda.  ", "Give yourself a while though - the customer service is friendly but lackadaisical."], "author": "Wendy M.", "review": "I've spent way too much time in this little shop looking out onto washington square park!  My favorite table is the one in the very corner, looking out on both Columbus and Union Streets.  Get a focaccia sandwich - grilled chicken #2, meatball, veggie are all truly notable - and an italian soda.  Give yourself a while though - the customer service is friendly but lackadaisical.", "rating": 5, "date": "2006-08-11"}, {"excerpts": ["The first time I came here, I had the grilled chicken focaccia sandwich, and it was great, if not overpriced. ", "I liked the jalapenos they threw in. ", "However, the second time I ordered that sandwich, the chicken was super dry, and I had to throw away half of it. ", "A few weeks later, I gave them another chance thinking it was a fluke. ", "But again, the chicken in the third sandwich was gross and dry, and I couldn't even finish it.\n", "If they start taking care of the food they prepare, I'd be back, but I'm not willing to risk another $10 to find out."], "author": "Mountbatten M.", "review": "The first time I came here, I had the grilled chicken focaccia sandwich, and it was great, if not overpriced. I liked the jalapenos they threw in. However, the second time I ordered that sandwich, the chicken was super dry, and I had to throw away half of it. A few weeks later, I gave them another chance thinking it was a fluke. But again, the chicken in the third sandwich was gross and dry, and I couldn't even finish it.\nIf they start taking care of the food they prepare, I'd be back, but I'm not willing to risk another $10 to find out.", "rating": 1, "date": "2009-10-20"}, {"excerpts": ["the grilled chicken #1 and #2 are excellent as well as the turkey and the combo. ", "great location for north beach people watching, especially if you get a seat looking toward washington square."], "author": "Dean E.", "review": "great focaccia bread sanwiches. the grilled chicken #1 and #2 are excellent as well as the turkey and the combo. great location for north beach people watching, especially if you get a seat looking toward washington square.", "rating": 4, "date": "2005-04-13"}, {"excerpts": ["Especially the grilled chicken #1. ", "I take everyone who comes into town here. ", "I tell them its not chic, not fancy but a cool typical north beach hang out.  ", "They're never disappointed. ", "Its not very touristy ", "and I think every time im there i see someone whom ive seen eaten there before. ", "The service is a weee slow ", "but i dont mind it since its a kick back place ", "and why would you want to rush to get out of there! ", "The music they play is usually very cool.  ", "Highly recommend it!"], "author": "Jesse O.", "review": "I love this place! it really reminds me of a cafe in Madrid i went to years ago. It has a cool european feel and if you're lucky to get a window seat, looking out at the park is really something! The paninis are very good. Especially the grilled chicken #1. I take everyone who comes into town here. I tell them its not chic, not fancy but a cool typical north beach hang out.  They're never disappointed. Its not very touristy and I think every time im there i see someone whom ive seen eaten there before. The service is a weee slow but i dont mind it since its a kick back place and why would you want to rush to get out of there! The music they play is usually very cool.  Highly recommend it!", "rating": 5, "date": "2008-10-19"}], "breaded eggplant": [{"excerpts": ["I love the breaded eggplant and the chicken cutlet sandwiches .\n", "Simply the best !\n", "Great to share and have 1/2 of each .\n", "Comes w the best marinara sauce & the grilled focaccia , forget about it !!\n", "Wonderful service , fantastic coffee .\n"], "author": "Ellie O.", "review": "This place is a classic !!!\nSo San Francisco , so old school North Beach \nAnd w a flavor of Europe .\nSmall , quaint , chill , warm & so darn delicious !\nI love the breaded eggplant and the chicken cutlet sandwiches .\nSimply the best !\nGreat to share and have 1/2 of each .\nComes w the best marinara sauce & the grilled focaccia , forget about it !!\nWonderful service , fantastic coffee .\nIt's the only place I order my Cappuccino con Vov .\nOne of the few places stocked w Vov .\nYum\nParking a challenge, \nWorth it !!\nGo now & Thank me later !", "rating": 5, "date": "2018-08-01"}, {"excerpts": ["Back in the day, Food & Wine magazine put the breaded eggplant sandwich @ ", "Mario's on their list of \"the 10 things you MUST eat when you're in SF.", "\"  ", "This was way, WAY before 7x7 magazine came out w their first list, since 7x7 magazine didn't even exist then.  ", "I had to mention this because there are so many newbie \"foodies\" out there ", "that actually don't know that there were lists like this & that there was a thriving food scene in SF long before \"the 7x7 list\" ever appeared.  ", "Even worse, there are droves of people that use the 7x7 list as the deciding factor on where & what to eat in this town.  ", "And that's just sad.  ", "The breaded eggplant is just as awesome now as it was way back when.  ", "Only now many peeps seem to love the grilled eggplant just as much.  "], "author": "Veronica M.", "review": "A North Beach institution.  Back in the day, Food & Wine magazine put the breaded eggplant sandwich @ Mario's on their list of \"the 10 things you MUST eat when you're in SF.\"  This was way, WAY before 7x7 magazine came out w their first list, since 7x7 magazine didn't even exist then.  I had to mention this because there are so many newbie \"foodies\" out there that actually don't know that there were lists like this & that there was a thriving food scene in SF long before \"the 7x7 list\" ever appeared.  Even worse, there are droves of people that use the 7x7 list as the deciding factor on where & what to eat in this town.  And that's just sad.  SF has been cranking out exceptionally noteworthy food forever, & Mario's has been doing it from day one.\n\nThe skinny...\n\nYes, they used to sell cigars.  Heck, the place used to be filled w smoke when you walked in, when smoking inside was still legal.  When the non-smoking law started, they still sold cigars, just no more smoking.\n\nAn espresso here is iconic.\n\nThey make a mean cappuccino.  It's written up in guide books everywhere.  We're talking internationally.  \n\nThe breaded eggplant is just as awesome now as it was way back when.  Only now many peeps seem to love the grilled eggplant just as much.  I say yes to both; let your mood decide or order a 1/2 of each.\n\nStandouts...\nThe meatball.  The sausage.  The chicken.  The combo (ham & salami).  The turkey.  The tuna.  The veggie.  Yes, they're actually all great.  No joke.  Basically, if you haven't had a focaccia sandwich from Mario's, preferably right out of the oven & piping hot w the requisite pepperoncinis...then you just haven't lived.  And that's their focaccia sandwich out of the OVEN; NOT a panini w regular baguette bread from the panini press.  There's just no comparison.  Trust.\n\nThe house made tiramisu is THE BEST in NB.  No contest.\n\nSometimes the service is great, sometimes it's not great.  But the tunes playing are always great.  Always.  So, just tune the service out if need be & enjoy everything else.  \n\nAn institution.  Mangia.", "rating": 4, "date": "2014-07-07"}, {"excerpts": ["Walk in for a late weekday dinner, grab a table and order the breaded eggplant sandwich.  "], "author": "Sameer I.", "review": "I'm pretty sure that none of the words in the name of this restaurant are accurate.  I'm not holding it against them though.\n\nMario's is awesome because it consistently has the optimal number of people inside of it.  Typically SF restaurants crowd toward the either end of the spectrum of occupancy.  They're either so empty that you start to question the authenticity of their health inspection certificate or so popular that you start to contemplate ways for \"Jennifer party of 3\" to mysteriously disappear just to get a seat.  Mario's fits neatly in the middle of that spectrum.\n\nWalk in for a late weekday dinner, grab a table and order the breaded eggplant sandwich.  Solid rotating beer selection as well.  \n\nThere's only one person making food so it's not a great place to go if you're in a rush.  It took me forever to realize that they make it all right at the counter behind the bar (I once wandered around the back looking for the kitchen and came back very confused).", "rating": 4, "date": "2015-10-12"}, {"excerpts": ["and I had a solid but not amazing breaded eggplant sandwich. ", "I saw them serve up a meatball sandwich that looked very tasty. ", "I'll be back to try that for sure."], "author": "Nick L.", "review": "First time here and I had a solid but not amazing breaded eggplant sandwich. I saw them serve up a meatball sandwich that looked very tasty. I'll be back to try that for sure.", "rating": 4, "date": "2016-08-12"}, {"excerpts": ["The breaded eggplant Parmesan focaccia sandwich was burnt, dry, bland, lukewarm, and took forever to be served.\n", "The music was good, perhaps I'll return and order the meatball sandwich."], "author": "Z C.", "review": "The server took 20 minutes prior to providing menus or acknowledging our presence. The breaded eggplant Parmesan focaccia sandwich was burnt, dry, bland, lukewarm, and took forever to be served.\nThe music was good, perhaps I'll return and order the meatball sandwich.", "rating": 2, "date": "2016-06-20"}, {"excerpts": ["Thus, it will be more visits to this cafe in the future to taste the meatball, breaded eggplant sandwiches and the tiramisu listed under Italian sodas.\n\n"], "author": "Carol C.", "review": "I never knew about this place until my younger sister suggested meeting here for lunch before we headed to Pier 39.  The cafe is pretty casual and cozy.  Even though the service is a tad slow, still it's a nice place to relax, enjoy the scenery (if one is sitting by the window) and carry on a conversation without a lot of noise around.   \n\nSince my sister has been here before, she mentioned that the sausage and meatball with marinara sauce on onion foccacia bread were the \"bomb\".  Instead I opted for the smoked turkey & pepperjack sandwich with my usual...an Arnold Palmer.  Reading over the menu,  I have to say everything sounded delish.  Thus, it will be more visits to this cafe in the future to taste the meatball, breaded eggplant sandwiches and the tiramisu listed under Italian sodas.\n\nMy smoked turkey sandwich (piping hot and fresh) with the pepperjack cheese oozing from the side and the hint of dijon mustard was yummy.  It was a nice balance without any flavors overpowing each other.  However, my expectation for an Arnold Palmer was a tall glass filled partly with iced tea and then topped off with lemonade.  Yes, the beverage came in a tall glass, but I was caught off guard and slightly disappointed that it was a bottle of Snapple Arnold Palmer (3 star).  I guess that's why the Arnie Palmer was listed at a price of $2.25.", "rating": 4, "date": "2011-12-19"}, {"excerpts": ["I ordered the breaded eggplant sandwich while my coworkers ordered lasagna, chicken salad, and polenta & sausage. ", "After taking a few bites of my eggplant sandwich, I ended up opening it up ", "so I can add in some salt & pepper. ", "It was a little too bland for my taste, in which one of my coworkers agreed also. ", "As for the breaded eggplant, it was thinner than I thought it would be! ", "If I do come back, maybe I will try a pizza instead next time!"], "author": "Mary C.", "review": "Came here for lunch today with some co-workers since we work really close by! It's a cute little cafe with a catchy name and I've been wanting to try this place! I ordered the breaded eggplant sandwich while my coworkers ordered lasagna, chicken salad, and polenta & sausage. After taking a few bites of my eggplant sandwich, I ended up opening it up so I can add in some salt & pepper. It was a little too bland for my taste, in which one of my coworkers agreed also. As for the breaded eggplant, it was thinner than I thought it would be! If I do come back, maybe I will try a pizza instead next time!", "rating": 3, "date": "2014-10-08"}, {"excerpts": ["I always get the breaded eggplant focaccia sandwich.  ", "We have been going to this place since before they had a menu.  ", "the sandwiches are just as good as they have always been hot, toasted perfectly.  ", "My husbaND likes the eggplant pizza.  ", "Together with a glass of wine or a beer on tap it makes for a very easy dinner on the nights we are too lazy to cook.  ", "thank you, Mario's! ", "Don't ever change."], "author": "Emily M.", "review": "My husband and i love this place.  it is very relaxed and has the feel of a place that has been around forever, which it has been.  In a good way.  I always get the breaded eggplant focaccia sandwich.  We have been going to this place since before they had a menu.  the sandwiches are just as good as they have always been hot, toasted perfectly.  My husbaND likes the eggplant pizza.  Together with a glass of wine or a beer on tap it makes for a very easy dinner on the nights we are too lazy to cook.  thank you, Mario's! Don't ever change.", "rating": 5, "date": "2014-03-05"}, {"excerpts": ["Breaded Eggplant sandwich, and an IPA draft. "], "author": "Bobby L.", "review": "Unpretentious perfection. Amazing staff! Excellent food! Perfect location!\n\nI suggest- Breaded Eggplant sandwich, and an IPA draft. Chill, and tip your servers well!\n\nCheers!", "rating": 5, "date": "2011-08-13"}, {"excerpts": ["My favorite is the breaded eggplant.  ", "One tiny drawback is that I think prices went up slightly and the sizes also look a bit smaller.  "], "author": "Jean O.", "review": "Don't be fooled by the name of this place --- the focaccia sandwiches here are so yummy!!!  My favorite is the breaded eggplant.  One tiny drawback is that I think prices went up slightly and the sizes also look a bit smaller.  But I'll still come here to eat!\n\nA great place for take-out to eat at Washington Square Park across the street on a sunny day.", "rating": 4, "date": "2010-02-24"}, {"excerpts": ["Good lunch spot for panini, focaccia sandwiches (breaded eggplant!), cannelloni and lasagna. ", "Go at off-times (like 2pm for lunch) since table seating is sparse and this place tends to fill up."], "author": "Mindy S.", "review": "Cheaper and more reliable than the string of overpriced tourist-centered Italian cafes down the block. This place is cozy without the overly-friendly waiters that I find to be overbearing in most of North Beach. \n\nGood lunch spot for panini, focaccia sandwiches (breaded eggplant!), cannelloni and lasagna. Go at off-times (like 2pm for lunch) since table seating is sparse and this place tends to fill up.", "rating": 4, "date": "2007-10-05"}, {"excerpts": ["I've had veggie and breaded eggplant. ", "I get one or the other and have been for the last twelve years. ", "Sometimes I think of trying something else, but I am worried the eggplant will miss me. ", "On my last visit, I sat at the counter for the first time (usually I'm at the small table in back) and enjoyed watching the food being made. ", "Kudos to the sandwich makers!"], "author": "Eva UnTiger S.", "review": "I am not into cigars or bars, but someone introduced me to Mario's long, long ago, and I have been a fan ever since. Consider this great comfort food. I am a fan of the hot foccacia sandwiches. I've had veggie and breaded eggplant. I get one or the other and have been for the last twelve years. Sometimes I think of trying something else, but I am worried the eggplant will miss me. On my last visit, I sat at the counter for the first time (usually I'm at the small table in back) and enjoyed watching the food being made. Kudos to the sandwich makers!", "rating": 3, "date": "2009-12-02"}, {"excerpts": ["My favorite is the breaded eggplant sandwich with a glass of house red. ", "Great place to meet up wtih friends for a quick bite before hitting the town. ", "Cappucinos are tasty, too. ", "Hits the spot on a sunny day, if you can get a window seat. ", "The service used to be better a few years ago. ", "Not sure the deal there. ", "Could just be cluelessness or a decision by the staff to treat locals like passing tourists."], "author": "Trinity M.", "review": "Solid. My favorite is the breaded eggplant sandwich with a glass of house red. Great place to meet up wtih friends for a quick bite before hitting the town. Cappucinos are tasty, too. Hits the spot on a sunny day, if you can get a window seat. The service used to be better a few years ago. Not sure the deal there. Could just be cluelessness or a decision by the staff to treat locals like passing tourists.", "rating": 3, "date": "2009-03-31"}, {"excerpts": ["I had a bite of both the grilled eggplant and breaded eggplant sandwiches and they were awesome. ", "A+"], "author": "O K.", "review": "This place is very nice. I love North Beach and all its cafes. After passing by this cafe many times, I never went in even though it looked alluring, but after hearing that they have the \"best foccacia sandwiches\" on Bay Area Backroads I decided to give it a go. I ordered the turkey foccacia with pepper jack cheese and onions, and I replaced the dijon mustard with red bell peppers. We sat outside and it was very comfortable, and the sandwiches came right away. Sadly, they don't carry \"exotic\" Torani flavors like coconut or mango, so I had to settle for a peach Italian soda. It was still yummy. The sandwich was very very tasty, nice crispy bread and great cheese.. kinda spicy too, which I liked. I had a bite of both the grilled eggplant and breaded eggplant sandwiches and they were awesome. A+", "rating": 5, "date": "2005-08-21"}, {"excerpts": ["Sausage and the breaded eggplant sandwiches are the two best.  "], "author": "Mickey D.", "review": "So this is truly a San Francisco classic, the sandwiches are great on Focaccia from Liguria.  Sausage and the breaded eggplant sandwiches are the two best.  Try a house campari, they rock.  The pizza's aren't bad either.  It is a world class cafe.  Prices are reasonable, look to spend about $15 a person.", "rating": 4, "date": "2007-03-14"}, {"excerpts": ["You will never go wrong with a meatball sandwich--or with the breaded eggplant sandwich--accompanied by a glass of chianti at Marios.  ", "Its the atmosphere that puts it over the top, right on the corner off Washington Square, watching all the local color and enjoying a bit of old time North Beach ambiance."], "author": "David T.", "review": "You will never go wrong with a meatball sandwich--or with the breaded eggplant sandwich--accompanied by a glass of chianti at Marios.  Its the atmosphere that puts it over the top, right on the corner off Washington Square, watching all the local color and enjoying a bit of old time North Beach ambiance.", "rating": 4, "date": "2009-06-25"}], "veggle": [], " sandwich": [{"excerpts": ["A little on the small side though for the cost and definitely in comparison to Kelly D's tuna melt which was made open face style, and I pretty much had  sandwich envy with that  one ", "ha ha ", "Kat got one of their sausage pizzas "], "author": "Sarah G.", "review": "I want more places like this  in Boston. It is a tiny little cafe/bar/sandwich shop and supposedly a cigar store too? All of  that packed into one tiny corner shop?? \n\nYou walk in here and see the big oven to cook their pizzas and paninis and to melt all of the cheese that Kelly D. got on her tuna melt. That oven is tucked into  the bar itself  and when we were there, they had two awesome people working, the guy who worked the bar and made all of our food made sure we were all completely happy with our sandwiches and pizza. Frances S. and I both got panini's, mine with chicken and pesto and sundried tomatoes and cheese all melted and toasted together and Frances S. got their mozzarella panini and we were both pretty happy with them. A little on the small side though for the cost and definitely in comparison to Kelly D's tuna melt which was made open face style, and I pretty much had  sandwich envy with that  one ha ha Kat got one of their sausage pizzas and she also seemed pretty darn content. \n\nA nice quaint little bar and lunch spot that if you happen to be walking around this area, I know the people here will treat you like they are your friends.", "rating": 4, "date": "2012-01-09"}, {"excerpts": ["I usually order the toasted meatball or sausage  sandwich...", "the portions are are large and the price is reasonable for the City.  ", "Today, I switched it up a little and ordered the hot pastrami which was absolutely fabulous!  ", "If you are tired of having a boring sandwich, come here for the focaccia sandwiches.  ", "You will love it!"], "author": "Deborah N.", "review": "A native San Franciscan took me here years ago, and I have been coming ever since.\nI usually order the toasted meatball or sausage  sandwich...the portions are are large and the price is reasonable for the City.  Today, I switched it up a little and ordered the hot pastrami which was absolutely fabulous!  If you are tired of having a boring sandwich, come here for the focaccia sandwiches.  You will love it!", "rating": 4, "date": "2014-10-21"}], "bacon lettuce tomato": [], "fresh mozzarella": [{"excerpts": ["I had the caprese salad- fresh mozzarella, sliced tomatoes, and fresh basil pesto. ", "This was tasty, the pesto was awesome. ", "Mario's is priced right, the service is excellent, and the food is terrific.\n"], "author": "Elizabeth C.", "review": "Not all of us ordered food, but those that did were really satisfied. We had lasagna, which had a bit of a sweet flavor to it. My fave dish of the night, the oven baked meatball sammy with swiss cheese, onions, and marinara on onion focaccia bread. The focaccia, which came highly recommended lived up to the hype. The crunch of the bread combined with melted cheese and warm sauce was a great combination. We also had the grilled chicken #1 sammy- dijon mustard, pepper jack cheese, and onions on the amazing focaccia bread. This one was good too. I had the caprese salad- fresh mozzarella, sliced tomatoes, and fresh basil pesto. This was tasty, the pesto was awesome. Mario's is priced right, the service is excellent, and the food is terrific.\nFor a more detailed review visit:\n\nhttp://consumingcolumbus.blogspot.com/2013/03/marios-bohemian-cigar-store-cafe-is.html", "rating": 4, "date": "2013-03-22"}], "panini special": [], "mozzarella cheese": [{"excerpts": ["the meatball sandwich comes with flavorful tender meatballs in a rich mild tomato sauce and mozzarella cheese enclosed within two fresh slices of foccacia bread. "], "author": "Charlene C.", "review": "OOOOH MY GOOOOOD\nYeah baby....\nMMMMMM MMMMM\n\nThis is the place to go for a huge meatball sandwich and a slice of tiramisu\n\nthe meatball sandwich comes with flavorful tender meatballs in a rich mild tomato sauce and mozzarella cheese enclosed within two fresh slices of foccacia bread. This sandwich was huge and definitely you will have leftovers.\n\nHave a slice of their tiramisu. Creamy, fresh, lightly sweet and delicious.", "rating": 5, "date": "2008-01-13"}], "eggplant parmegiana": [{"excerpts": ["Eggplant Parmegiana as an addition \n3. "], "author": "Kenneth L.", "review": "Came here twice after work.\n\nRight off the bat:\n1. MEATBALL sandwich (Focaccia bread + meatball) is a definite order.\n2. Eggplant Parmegiana as an addition \n3. Cider, Beer or Wine of your choice...\n\nIt's a nice cozy setting, low-key with good food.\nIt's a good spot for a date since the area is prime for post dinner spots like gelato, coffee and nearby bars. I haven't gone here during the day so I'm not sure if it's crowded and bustling.", "rating": 5, "date": "2015-02-05"}], "polenta and sausage": [], "house tiramisu": [], "lilianas ricotta cheese cake": [], "salted caramel fudge cake": [], "lemon pound cake": [], "hungarian coffee cake": [], "chocolate dipped biscotti": [], "peroni": [{"excerpts": ["This is a great place for a bite and a peroni on tap - must stop in north beach"], "author": "Claus F.", "review": "Love this place - I used to live a block away on Stockton street, and always loved their oven baked sandos .  This is a great place for a bite and a peroni on tap - must stop in north beach", "rating": 5, "date": "2017-08-06"}, {"excerpts": ["Peroni on tap  $5, Nice Icy 1 ", "pint great Italian beer.\n", "Espresso $1.75", ", I was a bit drunk by the great Peroni, so have a cup of Americano was a good idea. "], "author": "Nobu K.", "review": "if it's a nice lazy weekend, strolled around the North Beach is my favorite thing.\nI just love it.\nI don't mind so much for tourists because I still feel and remember the feeling, when I was here for my first time in SF.\n\nI like almost every where in NB, but MBCC is one of my favorite joint.  \nThe place isn't fancy, very easy going and relaxing.\nThis is a great place for beer and little food.\nWe had:\nCannelloni  $10.50, great hot out of the oven. \nMario's Salad  $6.50, this is pretty big for 6.50. like the dressing.\nPeroni on tap  $5, Nice Icy 1 pint great Italian beer.\nEspresso $1.75, I was a bit drunk by the great Peroni, so have a cup of Americano was a good idea. it was great strong a cup of Americano that kept my rest of the day going.\n\nOMG, What a boring review!\nI'm sorry but the review is true.\nWe were loving it.\nMario's Bohemian Cigar Store Cafe.\nWhat a Great place!", "rating": 5, "date": "2012-06-04"}, {"excerpts": ["(About $8.00)\nLove the pepperoncini on the side for that extra kick and goes down nicely with a peroni.\n\n"], "author": "D A.", "review": "Great cafe on the corner, North beach classic. \n\nGrab a seat outside or at the counter, try a meatball, sausage, or eggplant  focaccia sandwich.  (About $8.00)\nLove the pepperoncini on the side for that extra kick and goes down nicely with a peroni.\n\nGreat spot for lunch or a great spot to film your music video like R&B singer Monica did back in the day.\n\nhttp://www.youtube.com/watch?v=Gx9cl-QChyU", "rating": 4, "date": "2007-10-08"}, {"excerpts": ["Get your panini, a bottle of peroni, and watch through the window all the people walking by washington square."], "author": "Matthew M.", "review": "This is the spot in North Beach where my friends from Napoli like to go, bypassing all the touristy pretend-Italian joints that predominate on Columbus ave.  \r\n\r\nFor the love of god, try the meatball panini (of if you don't eat meat, the fried eggplant panini is a close second choice).  The foccacia is baked fresh daily right around the corner and it's fantastic.  Get your panini, a bottle of peroni, and watch through the window all the people walking by washington square.", "rating": 5, "date": "2006-04-24"}, {"excerpts": ["They have Peroni to go along with your italian meal ", "but if you are not into that sort of thing your only real other option is anchor steam. "], "author": "Eric G.", "review": "I ordered a combo sandwich and an anchor steam. The guy taking my order immediately said \"some guys have been coming in here and ordering that or 20 years\". Good to know, I was a little concerned that I would not make it out of here alive after eating it. I am not saying this because it was bad, because it was not, it was delicious. I mean really delicious!! ...but it was all meat, cheese, and mayo on a very oily (but also delicious) focaccia roll. \n\nThe people here were a mix of regulars and tourists. I had a good time listening to some visitors and the staff talking about the appropriate maximum amount of time to keep ground coffee beans.\n\nThey have Peroni to go along with your italian meal but if you are not into that sort of thing your only real other option is anchor steam. The rest of the beers are mostly the boring blue moon type stuff. \n\nFinally, Thanks for the great service. I sat at the bar and was always being taken care of. The staff obviously is intent on keeping this place the classic that it is.\n\nI am going to try the Cannelloni next time...", "rating": 4, "date": "2010-01-18"}, {"excerpts": ["Peroni on draft.  ", "Panini's looked great, i'll be coming back for lunch on a regular basis.\n", "Bathroom sucked, whats new, its north beach."], "author": "Christian W.", "review": "cozy, functional, unpretentious, well-priced, good service.  We went during the north beach fest, and these guys were even keeled about it, when they could have been up-itty and annoyed.  Peroni on draft.  Panini's looked great, i'll be coming back for lunch on a regular basis.\nBathroom sucked, whats new, its north beach.", "rating": 4, "date": "2008-06-16"}, {"excerpts": ["This is a great spot to grab a pannini for supper and a nice Peroni or Moretti to wash it down.  ", "Their coffee isn't bad either."], "author": "David H.", "review": "This is a great spot to grab a pannini for supper and a nice Peroni or Moretti to wash it down.  Their coffee isn't bad either.", "rating": 4, "date": "2010-07-13"}, {"excerpts": ["peroni beer very good, expect some old scratchie glasses doe."], "author": "dash s.", "review": "we happened upon this place by tring to get some food off mason, we ran into a sports bar that had no food but the bouncer told us about marios and how they had the best meatball sandwich in town.  i am not a fan of meatball sandwiches but it was a good enough recommendation and we decided to give it a shot.  \n\nwe were impressed, very good paninni sandwiches and the staff was very nice, a little gruff looking especially the cat with the dirty dreads and the french accent, but it was worth overlooking.  \n\nonly complaint is they didnt have any chips or fries and i like me some  crunchy with my sandwich but besides that it was very nice.\n\nperoni beer very good, expect some old scratchie glasses doe.", "rating": 4, "date": "2008-04-23"}, {"excerpts": ["Stop by have a Peroni on me."], "author": "Joe J.", "review": "intimate feel, fast service, the menu is simple an straight to the point, all components to a good spot. I had the tuna sandwich here today, definitely worth it. Stop by have a Peroni on me.", "rating": 4, "date": "2008-02-22"}, {"excerpts": ["I love the chicken sandwich #1 with a Peroni, Anchor or a glass of Montepulciano!  ", "Buona Sera!"], "author": "Adam P.", "review": "Ciao! I love the chicken sandwich #1 with a Peroni, Anchor or a glass of Montepulciano!  Buona Sera!", "rating": 4, "date": "2005-06-28"}], "dogfish head ipa": [], "white rascal": [], "old rasputin": [], "st florian": [], "affligem": [], "anchor porter": [], "cider": [{"excerpts": ["Cider, Beer or Wine of your choice...\n\n"], "author": "Kenneth L.", "review": "Came here twice after work.\n\nRight off the bat:\n1. MEATBALL sandwich (Focaccia bread + meatball) is a definite order.\n2. Eggplant Parmegiana as an addition \n3. Cider, Beer or Wine of your choice...\n\nIt's a nice cozy setting, low-key with good food.\nIt's a good spot for a date since the area is prime for post dinner spots like gelato, coffee and nearby bars. I haven't gone here during the day so I'm not sure if it's crowded and bustling.", "rating": 5, "date": "2015-02-05"}], "clausthaler nonalcoholic": [], "moretti": [{"excerpts": ["Just a tiny bar at the corner of Columbus and Union that happens to serve kickass sandwiches and Moretti in a bottle. ", "Ended up stranded here last week when it started pouring rain and i was without umbrella. "], "author": "Sean O.", "review": "I love this place. Just a tiny bar at the corner of Columbus and Union that happens to serve kickass sandwiches and Moretti in a bottle. Ended up stranded here last week when it started pouring rain and i was without umbrella. Mario's is not a bad place to be stuck inside. \n\nI must note that i have never purchased a cigar here, nor ever even seen a cigar here. I'm sure they are somewhere. I guess i have have a reason to go back.", "rating": 4, "date": "2009-10-28"}, {"excerpts": ["This is a great spot to grab a pannini for supper and a nice Peroni or Moretti to wash it down.  ", "Their coffee isn't bad either."], "author": "David H.", "review": "This is a great spot to grab a pannini for supper and a nice Peroni or Moretti to wash it down.  Their coffee isn't bad either.", "rating": 4, "date": "2010-07-13"}, {"excerpts": ["There's a lot of other reasons they get 4 stars: the name, the view of Washington Square, Moretti Rosso in a bottle, the old North Beach bar. ", "You can't go wrong at Mario's."], "author": "Dan B.", "review": "The panini here are fantastic. It's the perfect spot for a quick lunch or dinner. But let's be honest. There's a lot of other reasons they get 4 stars: the name, the view of Washington Square, Moretti Rosso in a bottle, the old North Beach bar. You can't go wrong at Mario's.", "rating": 4, "date": "2008-10-10"}], "beer special": [], "house red": [{"excerpts": ["My favorite is the breaded eggplant sandwich with a glass of house red. ", "Great place to meet up wtih friends for a quick bite before hitting the town. ", "Cappucinos are tasty, too. ", "Hits the spot on a sunny day, if you can get a window seat. ", "The service used to be better a few years ago. ", "Not sure the deal there. ", "Could just be cluelessness or a decision by the staff to treat locals like passing tourists."], "author": "Trinity M.", "review": "Solid. My favorite is the breaded eggplant sandwich with a glass of house red. Great place to meet up wtih friends for a quick bite before hitting the town. Cappucinos are tasty, too. Hits the spot on a sunny day, if you can get a window seat. The service used to be better a few years ago. Not sure the deal there. Could just be cluelessness or a decision by the staff to treat locals like passing tourists.", "rating": 3, "date": "2009-03-31"}, {"excerpts": ["Munch on the smoked turkey foccacia sandwich while downing the smooth house red wine and plan the revolution. ", "If you need further fortification, try their tiramisu and cappuccinos."], "author": "Megan W.", "review": "Cozy, Euro and very friendly. Munch on the smoked turkey foccacia sandwich while downing the smooth house red wine and plan the revolution. If you need further fortification, try their tiramisu and cappuccinos.", "rating": 4, "date": "2007-04-25"}], "montepulciano": [{"excerpts": ["I order a half carafe of the montepulciano, an Italian red and the eggplant marinara sandwich on focaccia.  ", "They layer the sandwich with thin slices of breadcrumb coated fried eggplant, roasted red peppers and then a layer of provolone.  ", "Then bake it open-faced in the oven on the wall.  ", "After ten or fifteen minutes, they slap the two sides together and slice it diagonally and garnish with those green pepperocinis, which I bite the end off, pour the tangy vinegar into the sandwich and then munch down as I eat the sandwich and sip the red wine in smallish hexagonal tumbler glasses.  \n", "One memorable time was when my brother Rufus visited and we went there on a Monday for dinner.  ", "It was raining out.  ", "We ate and had the wine.  ", "It continued to rain, they had cool music playing.  ", "Coltrane or Sonny Rollins or Thelonious Monk...  ", "Anyway, we didn't leave that place for 3 hours just laughing about dumb things we used to do as kids and can now talk about.  ", "No reason to go out in the rain when you've already found a cool place to hang.\n", "I do have to admit that in the past few years, the charm has changed a bit for the worse.  ", "The lighting is now much brighter and too bright in my opinion. ", "I like it dim when work on getting a good wine buzz.  ", "And the jazz music has been replaced by either dancey world music or reggae or just contemporary Alice-type music.  ", "Maybe it's the workers who just play their iPods or whatever they want.  \n", "The great foccacia they use for the sandwich is from Liguria Bakery on the corner of Stockton and Filbert, but the Italian French Bakery up the street on Grant @ ", "Union makes a decent substitute, but it's not the soft wonderful foccacia from Liguria.  ", "There's a difference.  ", "They ran out of the Liguria foccacia bread for the sandwiches a couple of times too ", "and I asked about when they changed to the Italian French Bakery foccacia, our waitress was convinced it's always been the same.  ", "They also installed a few taps of draft beer, which is nice, but I suggest the red wine with the sandwiches.  "], "author": "Kev M.", "review": "No smoking of cigars, but the oven baking the focaccia sandwiches can fill up the place with that burnt bread smell that's actually kind of nice, but makes your clothes stink for days.  I've enjoyed every visit to Mario's.  It's the kind of place that I would love to own.  Or what I'd use as a template for the perfect comfortable cafe with food and wine.  I order a half carafe of the montepulciano, an Italian red and the eggplant marinara sandwich on focaccia.  They layer the sandwich with thin slices of breadcrumb coated fried eggplant, roasted red peppers and then a layer of provolone.  Then bake it open-faced in the oven on the wall.  After ten or fifteen minutes, they slap the two sides together and slice it diagonally and garnish with those green pepperocinis, which I bite the end off, pour the tangy vinegar into the sandwich and then munch down as I eat the sandwich and sip the red wine in smallish hexagonal tumbler glasses.  \nOne memorable time was when my brother Rufus visited and we went there on a Monday for dinner.  It was raining out.  We ate and had the wine.  It continued to rain, they had cool music playing.  Coltrane or Sonny Rollins or Thelonious Monk...  Anyway, we didn't leave that place for 3 hours just laughing about dumb things we used to do as kids and can now talk about.  No reason to go out in the rain when you've already found a cool place to hang.\nI do have to admit that in the past few years, the charm has changed a bit for the worse.  The lighting is now much brighter and too bright in my opinion. I like it dim when work on getting a good wine buzz.  And the jazz music has been replaced by either dancey world music or reggae or just contemporary Alice-type music.  Maybe it's the workers who just play their iPods or whatever they want.  \nThe great foccacia they use for the sandwich is from Liguria Bakery on the corner of Stockton and Filbert, but the Italian French Bakery up the street on Grant @ Union makes a decent substitute, but it's not the soft wonderful foccacia from Liguria.  There's a difference.  They ran out of the Liguria foccacia bread for the sandwiches a couple of times too and I asked about when they changed to the Italian French Bakery foccacia, our waitress was convinced it's always been the same.  They also installed a few taps of draft beer, which is nice, but I suggest the red wine with the sandwiches.  2006, the old school is changing.\n\nUpdate:\nThey had a sign on the window saying they're using Liguria focaccia.  Hmm.  Maybe they read the yelp reviews...cool.", "rating": 4, "date": "2006-01-16"}, {"excerpts": ["I love the chicken sandwich #1 with a Peroni, Anchor or a glass of Montepulciano!  ", "Buona Sera!"], "author": "Adam P.", "review": "Ciao! I love the chicken sandwich #1 with a Peroni, Anchor or a glass of Montepulciano!  Buona Sera!", "rating": 4, "date": "2005-06-28"}], "chianti": [{"excerpts": ["I told him that I didn't need a menu and just wanted a glass of Chianti.  ", "He poured the wine, and I gave him a $20 bill.  ", "I grabbed a menu which clearly indicated that a glass of Chianti was $8.  ", "The kitchen guy kept himself busy in the kitchen and ignoring me, so I told the waiter that i only got $1.25 in change when i gave a $20 bill for a glass of wine. ", "The kitchen guy was listening in by this point. ", "The waiter looked at the kitchen guy with a frustrated and angry look, and just grabbed a $10 bill out of the register and gave it to me.  ", "The kitchen guy looked meekly at the waiter "], "author": "Lee H.", "review": "I'd like to start by saying that I've been going here for years and love it.  I want it to survive and do well since it's such a great space in North Beach, but I was shocked by the behavior of one of the staffers on my recent visit. \n\nI'm writing this review in the hope that the owner monitors these Yelp reviews, so that he will be aware of what this employee is doing and be able to fix the problem.\n\nWith the recent nice weather, I went to Mario's to get a glass of wine and enjoy it while people watching at one of the outdoor tables. When I walked into the Cafe, the guy that primarily prepares the food asked me what I'd like and if I'd like to see a menu. I told him that I didn't need a menu and just wanted a glass of Chianti.  He poured the wine, and I gave him a $20 bill.  i thought it was weird that he didn't tell me how much the wine was, but I figured that he would be honest about what he charged me and that he would give me a receipt. \n\nI took a sip of my wine while waiting for my change, and when he handed me the change (without a receipt by the way), it was only $1.25 in change. He then walked into the kitchen to work on food. That's $18.75 for a basic glass of wine. Only the most super overpriced upscale restaurants have the audacity to charge those prices.  \n\nI grabbed a menu which clearly indicated that a glass of Chianti was $8.  The kitchen guy kept himself busy in the kitchen and ignoring me, so I told the waiter that i only got $1.25 in change when i gave a $20 bill for a glass of wine. The kitchen guy was listening in by this point. The waiter looked at the kitchen guy with a frustrated and angry look, and just grabbed a $10 bill out of the register and gave it to me.  The kitchen guy looked meekly at the waiter and then me and pretended that it was an accident.  \n\nSure it's hard to prove exactly the intent, but all I can say is that he had the guilty look of someone who had been caught. Frankly, I believe this guy thought he could get away with it since i hadn't looked at the menu for the prices, he didn't bother giving me a receipt (receipts are a normal practice for this place), and he probably thought that I was a tech guy that didn't care about money.  It's probably not the first time that he's done it.\n\nI hope the owner sees this review and works to fix this and keep it from happening again.  If this guy is willing to rip off a customer, he's probably stealing from you too.", "rating": 1, "date": "2017-09-25"}, {"excerpts": ["Lots of Italian-style atmosphere - bottles of Chianti against the wall, a picture of a boccie ball player, those old artful advertising posters you see at Z Gallerie. ", "Yet again sparked by a complete stranger's adoration of this place on \"Check Please! ", "Bay Area\", Jamie W. and I went to see what the fuss was about. ", "The menu is small but focused - focaccia sandwiches, paninis, three salads, a few pizzas, some lasagna, some eggplant parmigiana, and a few desserts. "], "author": "Ed U.", "review": "We're talking about casual eats in a classic setting (see my photos). This place probably represents the third corner of the North Beach triad that includes Caffe Trieste and Victoria's Pastry Company. OK, maybe you have to add Caffe Sport and Steps of Rome. OK, maybe not Steps of Rome because they lick your neck there. Well, not mine, but Rachael Ray's, I think, on that $40-a-Day-Cause-I'm-Too-Rich-to-Tip show. Oh my gravy.\n\nBut back to Mario's. Big bar, little tables inside, a few more outside. Lots of Italian-style atmosphere - bottles of Chianti against the wall, a picture of a boccie ball player, those old artful advertising posters you see at Z Gallerie. Yet again sparked by a complete stranger's adoration of this place on \"Check Please! Bay Area\", Jamie W. and I went to see what the fuss was about. The menu is small but focused - focaccia sandwiches, paninis, three salads, a few pizzas, some lasagna, some eggplant parmigiana, and a few desserts. That's it.\n\nWe went for splitting two paninis, both in the $7.50-$8.50 range (see my photos). The verdict is that the salami was really good, and the chicken one a little too dry. But the bread was nice and crunchy. It comes with no extras except for a couple of pepperoncinis - which was a bit disappointing since I never turn down fries. We decided to order the $6 Caprese, which consisted of four thick, somewhat unripened tomato slices with a slab of mozzarella and a dollop of fresh basil pesto (see my photo). All in all, it's a good snack place but nothing much more than that except for a great spot overlooking Washington Square.\n\nFOOD - 3 stars...good, toasty paninis but nothing extraordinary here\nAMBIANCE - 4 stars...feels like a good paisan's hangout\nSERVICE - 3.5 stars...friendly enough, not as indifferent as I was expecting\nTOTAL - 3 stars...the small servings bring this one down a little...also the easy-to-screw-up name with three nouns in a row...make up your mind!", "rating": 3, "date": "2008-08-28"}, {"excerpts": ["You will never go wrong with a meatball sandwich--or with the breaded eggplant sandwich--accompanied by a glass of chianti at Marios.  ", "Its the atmosphere that puts it over the top, right on the corner off Washington Square, watching all the local color and enjoying a bit of old time North Beach ambiance."], "author": "David T.", "review": "You will never go wrong with a meatball sandwich--or with the breaded eggplant sandwich--accompanied by a glass of chianti at Marios.  Its the atmosphere that puts it over the top, right on the corner off Washington Square, watching all the local color and enjoying a bit of old time North Beach ambiance.", "rating": 4, "date": "2009-06-25"}], "barbera": [], "pinot noir": [{"excerpts": ["I had their pinot noir "], "author": "LC B.", "review": "The name sounds almost like a liquor/cigarette shop with a deli..but it's quite a cute, cozy bar cafe across the street from Washington Square.  \n\nFriend and I ended up here to people watch over glasses of wine from one of the outdoor tables.  I wish they had names of the wines they serve on their menu though.  I had their pinot noir and it was delightful.  \n\nNice weather, enjoyable company, an attentive waitress, yummy wine, and outdoor seating equals perfect SF afternoon/evening.", "rating": 4, "date": "2013-10-01"}], "wine specials": [], "house white": [], "prosecco": [], "pinot grigio": [{"excerpts": ["My friend and I went family-style and ordered the mozzarella panini, eggplant parmesan,  a basket of focaccia bread, and pinot grigio. ", "I have no complaints. ", "The food was impeccable. ", "Overall, if you are looking to have a quick bite (not fast food) in an unpretentious environment, check of this North Beach classic."], "author": "Joan S.", "review": "I instantly loved the neighborhood vibe I got from this place. A small joint, nothing fancy but not grimy either. My friend and I went family-style and ordered the mozzarella panini, eggplant parmesan,  a basket of focaccia bread, and pinot grigio. I have no complaints. The food was impeccable. Overall, if you are looking to have a quick bite (not fast food) in an unpretentious environment, check of this North Beach classic.", "rating": 5, "date": "2008-03-12"}], "house campari": [{"excerpts": ["Grab a house Campari and enjoy their fantastic focaccia sandwiches. ", "The meatball and the combo are both must haves"], "author": "Garrett A.", "review": "If you're in North Beach this is a must. Grab a house Campari and enjoy their fantastic focaccia sandwiches. The meatball and the combo are both must haves", "rating": 5, "date": "2017-07-31"}, {"excerpts": ["Try a house campari, they rock.  ", "The pizza's aren't bad either.  ", "It is a world class cafe.  ", "Prices are reasonable, look to spend about $15 a person."], "author": "Mickey D.", "review": "So this is truly a San Francisco classic, the sandwiches are great on Focaccia from Liguria.  Sausage and the breaded eggplant sandwiches are the two best.  Try a house campari, they rock.  The pizza's aren't bad either.  It is a world class cafe.  Prices are reasonable, look to spend about $15 a person.", "rating": 4, "date": "2007-03-14"}, {"excerpts": ["House Campari.  ", "Four bucks.  ", "Best cocktail deal in North Beach."], "author": "Counter C.", "review": "House Campari.  Four bucks.  Best cocktail deal in North Beach.", "rating": 4, "date": "2009-10-23"}], "ruby port": [], "tawny port": [], "punt e mes": [], "cherry": [], "lime": [], "tangerine": [], "strawberry": [], "raspberry": [], "blackberry": [], "watermelon": [{"excerpts": ["Hubby had a pint of Sierra $5 and I had the Italian watermelon soda $2.  \n\n"], "author": "Gloria H.", "review": "After trying to get in a few other places without success, we settled here.  The side door was locked so they can accommodate another table of 2 inside., where we were sat.\n\nWe shared the pizza special - prosciutto with arugula - $10?  The pizza fits on a dinner plate.  It was a nice thin crust pizza with a very generous portion of chopped up arugula on top.  The end crust was crispy.  \n\nHubby had a pint of Sierra $5 and I had the Italian watermelon soda $2.  \n\nService is a bit slow so be prepared to chill and enjoy the quaint ambiance - not the ideal place if you are in a hurry or with someone you can't carry a conversation with...", "rating": 4, "date": "2010-12-04"}], "ruby red grapefruit": [], "hazelnut": [], "orgeat": [], "caramel": [], "cola": [], "diet cola": [], "rootbeer": [], "san pellegrino limonatta  aranciata": [], "double espresso": [{"excerpts": ["We followed that with a double espresso each and called it a day. "], "author": "Justin G.", "review": "Talk about a great meatball sandwich! I come in here every few months and I always get the same thing: The meatball sandwich!\n\nDon't let the sign fool you,they don't sell cigars. Sorry.\n\nBut that I mention they have the best meatball sandwich. Yes I sure did because it's awesome!\n\nI brought my dad in there a few months ago and he is a food critic because he's a chef, and he love the meatball sandwich also. We followed that with a double espresso each and called it a day. Very happy customers. \n\nIt's not the best place for groups that a lot of tables for two.\n\nThey also have outdoor seating that Overlooks Washington Sq., Park and that's a great place to people watch.", "rating": 5, "date": "2015-05-02"}], "steamed milk": [], "extra shot espresso": [], "torani syrup": [], "vov": [{"excerpts": ["It's the only place I order my Cappuccino con Vov .\n", "One of the few places stocked w Vov .\n", "Yum\nParking a challenge, \n", "Worth it !!\n", "Go now & Thank me later !"], "author": "Ellie O.", "review": "This place is a classic !!!\nSo San Francisco , so old school North Beach \nAnd w a flavor of Europe .\nSmall , quaint , chill , warm & so darn delicious !\nI love the breaded eggplant and the chicken cutlet sandwiches .\nSimply the best !\nGreat to share and have 1/2 of each .\nComes w the best marinara sauce & the grilled focaccia , forget about it !!\nWonderful service , fantastic coffee .\nIt's the only place I order my Cappuccino con Vov .\nOne of the few places stocked w Vov .\nYum\nParking a challenge, \nWorth it !!\nGo now & Thank me later !", "rating": 5, "date": "2018-08-01"}, {"excerpts": ["Have been sipping Coffee with Vov and an early morning newspaper at Mario's since the late 60'.  ", "You have to try a cup with Vov... it is remarkable.  ", "Thank you Mario for introducing me to it.  ", "Last thing.  ", "The Cigar Store needs to post some photos of Mario.  ", "San Francisco is not the same without him.  ", "I find it totally disrespectful and unacceptable that the the current owners do not honor him."], "author": "Mike K.", "review": "Have been sipping Coffee with Vov and an early morning newspaper at Mario's since the late 60'.  You have to try a cup with Vov... it is remarkable.  Thank you Mario for introducing me to it.  Last thing.  The Cigar Store needs to post some photos of Mario.  San Francisco is not the same without him.  I find it totally disrespectful and unacceptable that the the current owners do not honor him.", "rating": 5, "date": "2017-11-14"}, {"excerpts": ["Came back later for coffee w/ vov and Tiramisu.  ", "Both were excellent.  ", "I strongly recommend this place."], "author": "Sonia R.", "review": "This was our 3rd Italian food stop.  My husband and I shared the Salami Panini and a full Caesar salad.  It was all very good and fresh.  Even though it was just the waitress/bartender and cook/waiter working the place it was amazing!  Never felt like we were waiting on assistance.  Came back later for coffee w/ vov and Tiramisu.  Both were excellent.  I strongly recommend this place.", "rating": 4, "date": "2017-10-06"}, {"excerpts": ["We had a cappuccino con \"Vov\", their special house made \"campari\", and the tiramisu and our night was blissfully perfect.\n\n", "\"Vov\" is a frothy cup of vanilla/eggnoggy goodness.  "], "author": "Victoria S.", "review": "Oh my!  I was temporarily transported to Florence last night when I scooped a spoonful of their housemade tiramisu into my mouth!  Heaven pure Italian heaven on a plate.  \n\nI've been going to Mario's Bohemian Cigar Store Cafe since the late 1970s and have so many fantastic memories of this place.  Every time I go I acquire a new and immensely pleasant experience.  Last night was no exception.\n\nWe had a cappuccino con \"Vov\", their special house made \"campari\", and the tiramisu and our night was blissfully perfect.\n\nThe cappuccino con \"Vov\" is a frothy cup of vanilla/eggnoggy goodness.  I'm hooked on their house made \"campari\" which is a blend of sweet and dry vermouth, bitters, a splash of soda and a perfect twist of lemon.\n\nOur server suggested the tiramisu and outside of Alberto's in Florence this was hands down the best.  A gushy, creamy, wet mass of cake, cream, and liquor just as it should be.\n\nThank you Mario's for yet another memorable experience!", "rating": 5, "date": "2013-12-19"}, {"excerpts": ["My sausage sandwich was delicious as was a cappuccino with Vov."], "author": "Bumble B.", "review": "Mario's Bohemian is a North Beach institution.  The tables out side face Washington Square park and are perfect for people watching but I like to sit at the bar.\n\nThe service was quick and friendly. My sausage sandwich was delicious as was a cappuccino with Vov.", "rating": 4, "date": "2013-11-14"}], "aged earl grey": [], "morrocan mint": [], "chamomile lemon": [], "orange spice white tea": [], "berry darjeeling": [], "gun powder green": [], "english tea time": []}