{"soup bowl": [], "soup wbaguette  butter": [], "blt": [{"excerpts": ["The baked goods are yummy, but the sandwiches, especially the BLT, wins the blue ribbon. ", "Absolutely delicious. ", "Crispy bacon, crunchy lettuce, and delicious tomatoes. ", "Perfect amount of mayo.\n", "Thank you Maxfields!!!!!"], "author": "Jane L.", "review": "I love this neighborhood cafe. Good coffee, wonderful freshly squeezed OJ, beer and wine. Smoothies. All good. Nice, efficient, and friendly service in a clean and welcoming atmosphere.\nThe baked goods are yummy, but the sandwiches, especially the BLT, wins the blue ribbon. Absolutely delicious. Crispy bacon, crunchy lettuce, and delicious tomatoes. Perfect amount of mayo.\nThank you Maxfields!!!!!", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["Best BLT ever. ", "Fresh, clean and the staff is laid back and nice. ", "Easy parking and wifi too."], "author": "Dominique R.", "review": "Best BLT ever. Fresh, clean and the staff is laid back and nice. Easy parking and wifi too.", "rating": 5, "date": "2016-03-09"}, {"excerpts": ["The BLT and club are what I usually get ", "and I'm always full and happy afterwards (for lunch). ", "Prices are good and the service is quick and nice. ", "I like how there's ample seating. "], "author": "Angela H.", "review": "This is more like a 3.5-3.8 star place, but I'm in a happy mood so I'm just giving it a full 4 stars.\n\nI am currently obsessed with Maxfields' sandwiches. No idea why. I think it's the bacon they use. The BLT and club are what I usually get and I'm always full and happy afterwards (for lunch). Prices are good and the service is quick and nice. I like how there's ample seating. We usually come here to chill while we wait for our laundry next door.\n\nBasically, when I feel like a simple, well-priced sandwich, I come to Maxfields.", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["All this in addition to friendly service and the possibility of a BLT make Maxfield's top notch."], "author": "Tory S.", "review": "When Dolores Park sun starts to give me a few too many freckles, Maxfield's becomes the office. Free wi-fi, deliciously spicy soy chai lattes, the best vegan cookies ever and they never kicked me out for falling asleep on the couch. All this in addition to friendly service and the possibility of a BLT make Maxfield's top notch.", "rating": 4, "date": "2007-03-01"}], "tuna ham turkey": [], "avocado": [], "club": [{"excerpts": ["I ordered the club sandwich, turkey sandwich, hot chocolate, soy chai latte, and a couple cookies. ", "My grandma and I enjoyed our meal and we are impressed by how fresh the ingredients are in the sandwiches! ", "Good job! ", "The drinks and cookies were also delicious. ", "Thank you!"], "author": "Jennifer C.", "review": "I ordered the club sandwich, turkey sandwich, hot chocolate, soy chai latte, and a couple cookies. My grandma and I enjoyed our meal and we are impressed by how fresh the ingredients are in the sandwiches! Good job! The drinks and cookies were also delicious. Thank you!", "rating": 5, "date": "2016-11-15"}, {"excerpts": ["Also the sandwich I had the turkey club was not very good very low cost ingredients and the turkey seemed off."], "author": "Meghan A.", "review": "Prices listed on menu are different than what is charged by the restaurant. They got mad that I asked for a bag to put my sandwich in and tried to charge 10 cents for a tiny bag. I don't mind the SF bag charge for grocery bags but they were just trying to be rude and cause undue hassle. Also the sandwich I had the turkey club was not very good very low cost ingredients and the turkey seemed off.", "rating": 2, "date": "2016-08-14"}, {"excerpts": ["The BLT and club are what I usually get ", "and I'm always full and happy afterwards (for lunch). ", "Prices are good and the service is quick and nice. ", "I like how there's ample seating. "], "author": "Angela H.", "review": "This is more like a 3.5-3.8 star place, but I'm in a happy mood so I'm just giving it a full 4 stars.\n\nI am currently obsessed with Maxfields' sandwiches. No idea why. I think it's the bacon they use. The BLT and club are what I usually get and I'm always full and happy afterwards (for lunch). Prices are good and the service is quick and nice. I like how there's ample seating. We usually come here to chill while we wait for our laundry next door.\n\nBasically, when I feel like a simple, well-priced sandwich, I come to Maxfields.", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["The turkey club is really, really good. "], "author": "Rebecca H.", "review": "I used to love this place and go here a lot to work, and then one day, I just stopped. Not sure why. The turkey club is really, really good. I miss it. \n\nBut, I think the drawbacks are twofold, if you want to go someplace to get work done:\n\na) the music is totally unpredictable depending on who is behind the counter, and can sometimes be very loud and annoying.\n\nb) the staff sometimes have a negative energy and don't seem to get along with each other that well, which can be distracting to someone (like me) who is sensitive to that kind of thing.", "rating": 3, "date": "2007-04-01"}, {"excerpts": ["The Indian wraps and club sandwich aren't too bad either. ", "But hearing Dolly Parton on the cd player is what sold me."], "author": "Sara L.", "review": "This is my favorite coffee house in San Francisco because it is a REAL coffee house. People drink coffee and just hang out in a big open space at Maxfields. The Indian wraps and club sandwich aren't too bad either. But hearing Dolly Parton on the cd player is what sold me.", "rating": 5, "date": "2007-03-24"}], "vegetable": [], "pestospinach": [], "two mushroom": [], "spanakopita": [], "spinach  cheese": [], "potato  fried onion": [], "beef  cheese": [], "refills": [{"excerpts": ["Seriously, this place knows how to make a cup of coffee, and the refills are c-h-e-a-p!\n\n"], "author": "Hannah N.", "review": "Seriously, this place knows how to make a cup of coffee, and the refills are c-h-e-a-p!\n\nBy far my favorite place to get a cup of coffee in the mission.  The ambiance, a la \"big open warehouse with paintings\" is great.  The seating is comfortable and plentiful.  And, best of all, the coffee here is really good.  Plus, they have bagels with lox- all the time!  \n\nAnd, no kidding, I've had attentive, polite and fast service every time I've gone there.\n\nThe only drawback that I've had with this place is that they make said bagels with lox like a sandwich, instead of just arranging it all on a plate so that you can fix it how you want it.  And for some reason, they add sprouts.  But that's small potatoes.", "rating": 5, "date": "2006-03-25"}], "add expresso per shot": [], "torani syrup": [], "flavored croissant": [], "scones": [], "danish": [], "house coffee": [{"excerpts": ["Getting off one stop ahead of my destination, I walked past by Maxfield's -- merely a block from my house, I've seen this place multiple times but never went in, and since there were only 3 people in there, I snuck in and ordered a house coffee and a hummus sandwhich, grabbed a table and started to read my media analysis report.\n\n"], "author": "Lynn T.", "review": "I first came here last Tuesday, following a 3 hour stunt at the DMV, and a 1 hour muni bus trip with a transfer, during rush hour.  The agoraphobic in me needed a sanctuary to seek some peace and quiet, and most of all, a healthy dose of personal space.  Getting off one stop ahead of my destination, I walked past by Maxfield's -- merely a block from my house, I've seen this place multiple times but never went in, and since there were only 3 people in there, I snuck in and ordered a house coffee and a hummus sandwhich, grabbed a table and started to read my media analysis report.\n\na sense of calm soon came over. the coffee house has a high ceiling and plenty of sunshine (unlike cafe petra down the street which to me resembles a speakeasy that serves coffee, a different type of vibe, and to be sure, not necessary bad.) the Sunlight addict in me is satiated, much like a plant in a greenhouse.\n\nThe coffee was strong and resilient. the hummus sandwich satisfying. I stayed for a bit and made sure to come back. as I was leaving, the coffee dude thanked me for visiting. He's not my boyfriend, but i felt like i just got a hug. \n\nToday, I came back to this coffee house, somewhat broken and curled at the edge, and again, my coffee house (yes, i have a feeling that this will be my house from this point on) takes me in for a much needed retreat into urban anonymity.  My iced soy latte was made quickly, and I found a table next to a lanky & cute boy who is no-doubt also searching for his own oasis of privacy. We're stealing glances at each other right now, or at least i'm flattering myself and thinking he is, while I am. :) \n\nThank you Maxfield's for your deliberately small tables that allows the socially awkward laptop addicted dorks like me to escape the constant pressure to engage proactively with fellow life-escapees.  and thanks for the not so serious coffee, the just slightly ugly clientele, and artworks that doesn't pretend to be more than what it is -- why that mickey mouse shaped skull and bones pretty much matches how i feel on the inside today. \n\nYou Not-cool-enough-for-Coffee-Bar Customer,\nMe", "rating": 4, "date": "2009-09-07"}], "cafe con leche": [], "chai": [{"excerpts": ["The chai latter served in a giant mug is what did it for me. ", "Also great prices and comfortable atmosphere."], "author": "Peter B.", "review": "The chai latter served in a giant mug is what did it for me. Also great prices and comfortable atmosphere.", "rating": 5, "date": "2017-12-25"}, {"excerpts": ["My husband also really enjoyed his vanilla chai latte. ", "Very low key easy vibe. ", "No frills but good for a hot drink or mid day snack!!"], "author": "Aliyah B.", "review": "My husband and I were on vacation in San Francisco and bumped into this place while exploring and checking out the mission District. I ordered a Matcha green tea that was amazing. My husband also really enjoyed his vanilla chai latte. Very low key easy vibe. No frills but good for a hot drink or mid day snack!!", "rating": 5, "date": "2017-12-09"}, {"excerpts": ["I ordered the club sandwich, turkey sandwich, hot chocolate, soy chai latte, and a couple cookies. ", "My grandma and I enjoyed our meal and we are impressed by how fresh the ingredients are in the sandwiches! ", "Good job! ", "The drinks and cookies were also delicious. ", "Thank you!"], "author": "Jennifer C.", "review": "I ordered the club sandwich, turkey sandwich, hot chocolate, soy chai latte, and a couple cookies. My grandma and I enjoyed our meal and we are impressed by how fresh the ingredients are in the sandwiches! Good job! The drinks and cookies were also delicious. Thank you!", "rating": 5, "date": "2016-11-15"}, {"excerpts": ["$3.25 for a decent sweet chai, nothing special, and sweeter than I would go fore."], "author": "Linus W.", "review": "Not a bad cafe to get some work done. Wifi is on the slower side (3.26d/1.65u), and there are few outlets, but there's a lot of seating. Actually pretty crowded on a Sunday afternoon, but plenty of seat options closer to 5pm. $3.25 for a decent sweet chai, nothing special, and sweeter than I would go fore.", "rating": 3, "date": "2015-08-23"}, {"excerpts": ["Hit\nChai Latte:  ", "Miss\nCream Cheese Muffin:  ", "Miss"], "author": "Jeff B.", "review": "They have a wide selection of drinks and snacks, but the items I've bought have been hit or miss...\n\nSoy Latte:  Hit\nChai Latte:  Miss\nCream Cheese Muffin:  Miss", "rating": 3, "date": "2012-08-21"}, {"excerpts": ["Chai latte tastes super weird, bagel sandwich fell apart when I tried to eat it and the lady yelled at me when she got my order wrong. ", "Too bad, this place looked promising."], "author": "Maddie R.", "review": "Chai latte tastes super weird, bagel sandwich fell apart when I tried to eat it and the lady yelled at me when she got my order wrong. Too bad, this place looked promising.", "rating": 2, "date": "2014-01-26"}, {"excerpts": ["All I had to do was buy one measly, inexpensive large chai and the staff, who were friendly when I ordered, didn't bother me at all.\n\n"], "author": "Denise B.", "review": "Getting a job in order to relocate to San Francisco is the easy part. The tough part... finding housing. My weekend of sublet hunting, while looking for a temp place, finishing up my old job, and trying to pack and move, brought me here on a recommendation from someone whose place I'd just viewed.\n\nI owe them a lot of gratitude for them letting me sit here for hours, obnoxiously on my phone and laptop, taking up valuable space as I scoured craigslist and made phone calls in the search for my perfect place. Did I mention free wifi and outlets!? All I had to do was buy one measly, inexpensive large chai and the staff, who were friendly when I ordered, didn't bother me at all.\n\nCash only, but since the beverages are inexpensive this wasn't a bit deal. I ended up not taking that sublet but think fondly on that visit due to the introduction to an internet freak's coffee house dream.", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["Their chai tea is a perfect blend of sweet and spicy unlike other cafes in San Francisco where the chai is too much of either flavor.\n\n"], "author": "Chris G.", "review": "If you order a medium latte to drink inside Maxfield's, the size of the mug they give you is no different than that of their large. As one of the baristas told me, the size is a secret discount for the regulars who come in here all the time. Their chai tea is a perfect blend of sweet and spicy unlike other cafes in San Francisco where the chai is too much of either flavor.\n\nMaxfield's is located in one of the best neighborhoods of San Francisco. The area is peaceful but the cafe is a perfect midpoint to where you have to get going. Valencia Street, Dolores Park and Church Street Muni are all a couple of blocks away. I also want to stress the word 'quiet.' It is extremely nice to sit outside and have the trees on Dolores Street be my focal point instead of the hoards of passersby on other streets.", "rating": 4, "date": "2007-10-08"}, {"excerpts": ["I had a soy chai latte which was actually really good.  ", "I hate it when places make it super sweet and syrupy.  ", "This one was had a little spiciness to it that was just awesome goodness in my mouth.  ", "I was definitely pleased with it.  ", "It looked like other people were eating sandwiches here, but I knew I had to save my appetite for Ike's which is a few blocks from here."], "author": "MissJennifer L.", "review": "One of the best things about Maxfield's is their location.  It has a beautiful tree in the front and has plenty of indoor seating and a few tables outside.  They also have free wi-fi.  \n\nI had a soy chai latte which was actually really good.  I hate it when places make it super sweet and syrupy.  This one was had a little spiciness to it that was just awesome goodness in my mouth.  I was definitely pleased with it.  It looked like other people were eating sandwiches here, but I knew I had to save my appetite for Ike's which is a few blocks from here.", "rating": 4, "date": "2008-12-25"}, {"excerpts": ["Also, the iced soy chai latter I ordered was pretty bad, not the worst I ever had, but definitely no where near anything I would order again. ", "The paintings on the walls are terrrrrrrible, incredibly bad amateur art. ", "The rest of the decor was fine and enjoyable. ", "Nice furniture. ", "Lastly the music the barista put on was God awful! ", "Top 40 radio bull crap from four years ago. "], "author": "Maciej M.", "review": "I went here because it closed later than other coffee shops in the area. They have free wi-fi and a lot of electrical outlets. Also not a lot of people so it's quiet and easy to work. The prices are very reasonable. \n\nCons: First off, it smelled really bad inside. I dunno if it was a customer or it came from outside, but it smelled like feces. Also, the iced soy chai latter I ordered was pretty bad, not the worst I ever had, but definitely no where near anything I would order again. The paintings on the walls are terrrrrrrible, incredibly bad amateur art. The rest of the decor was fine and enjoyable. Nice furniture. Lastly the music the barista put on was God awful! Top 40 radio bull crap from four years ago. Just unbearable, I had to use head phones with my own music.\n\nI might come back again, but it won't be my favorite hang out.", "rating": 3, "date": "2009-08-16"}, {"excerpts": ["I sat down with my friend (who bought a chai latte) and they kept reminding me that I have to purchase something to use WIFI. ", "A lot of hustin for a cafe. ", "It was Friday when there are a lot of seats open! ", "Not cool."], "author": "Charles D.", "review": "I sat down with my friend (who bought a chai latte) and they kept reminding me that I have to purchase something to use WIFI. A lot of hustin for a cafe. It was Friday when there are a lot of seats open! Not cool.", "rating": 2, "date": "2010-01-15"}, {"excerpts": ["Free wi-fi, deliciously spicy soy chai lattes, the best vegan cookies ever and ", "they never kicked me out for falling asleep on the couch. "], "author": "Tory S.", "review": "When Dolores Park sun starts to give me a few too many freckles, Maxfield's becomes the office. Free wi-fi, deliciously spicy soy chai lattes, the best vegan cookies ever and they never kicked me out for falling asleep on the couch. All this in addition to friendly service and the possibility of a BLT make Maxfield's top notch.", "rating": 4, "date": "2007-03-01"}, {"excerpts": ["but this place manages to hold my title for best chai latte in the city. ", "Also, they have phenomenal little breads next to the counter (strawberry, zucchini, pumpkin, etc).  ", "Yup, this place is tasty."], "author": "Melissa Y.", "review": "I have no idea why but this place manages to hold my title for best chai latte in the city. Also, they have phenomenal little breads next to the counter (strawberry, zucchini, pumpkin, etc).  Yup, this place is tasty.", "rating": 4, "date": "2008-02-24"}, {"excerpts": ["my friend's chai latte was good. ", "i felt at ease. ", "the furniture was an ok comfort. ", "i enjoyed the 90's alternative music..and classics like \"closing time\". ", "it was nostalgic. ", "i was inspired to com ehere and do work on my laptop. ", "i would go back. ", "close to dolores park which is good too ", "and it is good when dolores park cafe is already closed."], "author": "Steph W.", "review": "very friendly staff. the guy who made our drinks was great, he was singing along to music and was quite pleasant. the mocha was good for a mocha...i am not a huge coffee drinker so it  was ok, i wish it was more chocalatey but maybe I should just get hot chocolate. I got an italian soda after, it was good. lots of flavor. my friend's chai latte was good. i felt at ease. the furniture was an ok comfort. i enjoyed the 90's alternative music..and classics like \"closing time\". it was nostalgic. i was inspired to com ehere and do work on my laptop. i would go back. close to dolores park which is good too and it is good when dolores park cafe is already closed.", "rating": 4, "date": "2008-07-09"}], "depth charge": [], "french soda": [], "odwalla juice": [{"excerpts": ["Second time, was asked to put my Odwalla juice bottle away. "], "author": "Susie Y.", "review": "Agree with the other reviewers on here in terms of poor service with belligerent baristas. \n\nPositives: never crowded, plenty of outlets, relatively quiet.\n\nNegative: Came here on first day and couldn't eat my snack and had to take it outside. Second time, was asked to put my Odwalla juice bottle away. Third time, she came with a scary smile and said \"Here's my policy, you have to order something immediately when you come in, you can't wait to order it\" even though I told her I was going to buy a sandwich after I settled down. \n\nScary scary owners, will probably never come back.", "rating": 2, "date": "2012-10-05"}, {"excerpts": ["Great coffee (go for a hot soy latte), every Odwalla juice on the planet and BEER.  \n\n"], "author": "Dina G.", "review": "PLUSES:  *BEER!!!!!!!!!!*; Great Coffee; Good soups & great hummus; varied food selection; Fun ambiance; upbeat music; friendly barristas; lots of regulars\n\nMINUSES: Not enough outlets; wireless drops too frequently; can be fairly hot; sometimes fruit-flies launch a full-on attack\n\n~~~~~~~~~~~~~~~~\nOK. I *LOVE* this cafe.  Great coffee (go for a hot soy latte), every Odwalla juice on the planet and BEER.  \n\nI'm a big fan of the soup -- always tasty, with nice soft buttered rolls. \n\nThe hummus is a good choice, as well.  \n\nAnd oh did I mention BEER???  On tap, and in bottles.  Rock!\n\nBut, the REAL reason to come here (aside from the wifi, outdoor seating, great coffee and the 5-year-old regular) is the afternoon/evening barrista.  \n\nI'm telling you, the music is teh bomb.  Fun, upbeat '90s stuff is on the current playlist.  Plus he's super-friendly and willing to jump around to New Order if you force the subject.  It makes working late a lot more pleasant.\n\nSadly, the wireless invariably drops at least once, if not more frequently, every time I'm there.  This is a royal pain in the ass if someone's trying to get work done. :/  \n\nIt seems hot when you first walk in, but it doesn't take long for the body to adjust and it's actually pretty comfortable, but it does seem hot at first.\n\nI also suggest they change the soup offerings more often & deal with the fruit-fly problem:\n\n1. pour bleach down all their drains\n2. cover the bananas\n3. leave out little dishes of vinegar mixed with dish soap to lure them to a watery grave", "rating": 5, "date": "2007-07-20"}], "odwalla smoothies": []}