{"fried wonton chips": [], "deepfried pawns": [], "crispy onion pancake": [], "honey bbq pork slices": [], "fried garlic calamari": [], "honey bbq spareribs": [], "fried chicken nuggets": [], "veggies tempura": [], "hot and sour soup with chicken": [], "veggie hot and sour soup": [], "assorted veggies with tofu soup": [], "egg blossom soup": [], "seafood with tofu soup": [], "large miso soup": [], "small hot and sour soup": [], "spicy combo noodle soup": [], "pork moo shu": [], "chicken moo shu": [], "beef moo shu": [], "shrimp moo shu": [], "vegetable moo shu": [], "a walnut prawns": [], "b triple crowns with scallions": [], "c phoenix and dragon": [], "d generals chicken": [], "e szechuan duck": [], "f beef and scallops": [], "g crispy chicken with sesame": [], "i happy family seafood combo": [], "k salmon with ginger garlic and veggies": [], "l may lees vegetables": [], "m basil chicken": [], "m basil beef": [], "n salt and pepper pork chop": [], "n salt and pepper chicken": [], "h orange chicken": [], "seafood and tofu with veggie": [], "p jalapeno beef": [], "p jalapeno chicken": [], "j jalapeno fish": [], "j jalapeno prawns": [], "o spicy honey dry fried chicken wings": [], "beef with snowpeas": [], "ginger beef": [], "beef with assorted vegetables": [], "beef with oyster sauce": [], "jalapeno beef with chefs sauce": [], "spicy shredded pork": [], "pork chop with salt and pepper": [], "peking pork ribs": [], "black bean sauce with bbq spareribs": [], "ginger lamb": [{"excerpts": ["We got Ginger Lamb, a California Roll, a Dragon Roll, and Crab Rangoon.\n\n"], "author": "Mike M.", "review": "Ordered online, mid-evening on a monday. \n\nWe got Ginger Lamb, a California Roll, a Dragon Roll, and Crab Rangoon.\n\nFood was decent, nothing to write home about but not bad. I had expected the sushi to be sub-par, as most hybrid chinese-sushi places tend to be mediocre at best. The Dragon Roll was actually pretty decent. Not the best I've had, but certainly not the worst. Healthy sized, too. The California Roll was not as good, but better than expected (and free, as we had an order over $28). The Lamb Ginger was standard-fare. Lots of crab rangoon with the order. \n\nWe also ordered a $2 mango pudding to push us over the $28 limit for the free CA roll. Major let down, it was just a small little pudding-cup sized prepackaged thing. Not worth 25c, let alone $2. \n\nI think my review leans around the lower end of 3.5, but I'm rounding them up to 4 because delivery was quick, and the deliveryman met me with a smile. \n\nI will be ordering from them again.", "rating": 4, "date": "2011-08-09"}], "salmon with broccoli": [], "prawns with assorted vegetables": [], "hunan prawns": [], "prawns in garlic sauce": [], "curry sauce prawns": [], "prawns and scallops": [], "fish with black bean sauce": [], "chinese green with fish fillet": [], "salmon with black pepper sauce": [], "salmon with two kinds of mushroom": [], "salmon with tofu and mushrooms": [], "jalapeno salmon with black beans sauce": [], "jalapeno fish": [], "jalapeno prawns": [], "tofu with black mushrooms": [], "kung pao tofu with peanuts": [], "bok choy and black mushrooms": [], "szechuan eggplant with tofu": [], "salt and pepper tofu with tofu": [], "tofu with black bean sauce": [], "spicy string bean with tofu": [], "vegetarian egg foo young": [], "may lees veggie": [], "garlic chinese green": [{"excerpts": ["I also ordered the garlic Chinese green, which was bok choi with garlic and very tasty. ", "I would order that again, but not the tofu."], "author": "Danielle C.", "review": "Eh, this place was okay. I like my Szechuan food to be spicy. I ordered the mapo tofu, and it was just okay. The tofu was extra extra firm, so it didn't quite soak up the flavor; the sauce was just on the outside. It was not spicy at all, even though I asked for the spiciest level they offer.\nI also ordered the garlic Chinese green, which was bok choi with garlic and very tasty. I would order that again, but not the tofu.", "rating": 3, "date": "2016-09-05"}], "small veggie fried rice": [], "small chicken fried rice": [], "assorted veggie fried rice": [], "spicy garlic fried rice": [{"excerpts": ["Highly recommend the General's Chicken, Basil Chicken, Phoenix and Dragon, Hot and Sour Soup, Beef Chow Fun, Triple Crowns with Scallions, and the Spicy Garlic Fried Rice...", "but really I don't think I've ever had a bad dish here."], "author": "Joey K.", "review": "This place is right across the street from my apartment, and I'm fat as a result.\n\nThe food isn't quite as good as San Tung up the street, but it's definitely damned tasty at the price point.\n\nEveryone that works there is super friendly every time I come in.\n\nHighly recommend the General's Chicken, Basil Chicken, Phoenix and Dragon, Hot and Sour Soup, Beef Chow Fun, Triple Crowns with Scallions, and the Spicy Garlic Fried Rice...but really I don't think I've ever had a bad dish here.", "rating": 5, "date": "2018-10-22"}], "spicy mongolian beef fried rice": [], "spicy basil chicken fried rice": [], "spicy beef fried rice": [], "vegetarian chow mein noodle": [], "soft chow mein noodle": [], "combo chow mein": [{"excerpts": ["Combo chow mein - beef shrimp chicken wish it had veggies in it, maybe I'll ask to add that in next time, but otherwise everything tasted good standard soft greasy  chow mein nom nom\n\nSERVICE\nordered delivery, it starts at 1130 which is a lil late for lunch bc "], "author": "Angela L.", "review": "Food\n1.) Hot n sour soup - mmm nice and hot even tho we got it delivered, hit the spot on a chilly Sunday lunchtime, had especially lotta stuff in it like chunks of chicken which was kinda unusual \n2.) Combo chow mein - beef shrimp chicken wish it had veggies in it, maybe I'll ask to add that in next time, but otherwise everything tasted good standard soft greasy  chow mein nom nom\n\nSERVICE\nordered delivery, it starts at 1130 which is a lil late for lunch bc it takes like 40 to 50 min to deliver and I can get hungry at like 11. But still, for being lazy, delivery was a good idea and it's nice they even provide it\n\n12.15.13", "rating": 4, "date": "2014-12-13"}, {"excerpts": ["Combo Chow Mein: ", "My only beef is that there were not enough shrimp, but that doesn't mean it wasn't delicous! :-)\n~ Sesame Chicken: ", "This was different from most of the sesame chicken I've had, but it worked.  ", "I liked that it had ", "it's own style and brought the heat.\n~ Sweet & Sour Chicken: ", "It's sweet & sour chicken, not much to say. ", "It was very good though. ", "I have had some sweet and sour chicken dishes that tasted like ass!\n~ ", "Hot & Sour Soup: ", "This was one of the best Hot and Sour soups I've ever had. "], "author": "Nick R.", "review": "We looked in the phone book...made the call....and within less than 30 minutes we had delicious Chinese food for a good price. We didn't even have to leave home, yay!\n\nYes, May Lee's has calmed our craving for Chinese food. We ordered a few items that stood up to the challenge.\n~ Combo Chow Mein: My only beef is that there were not enough shrimp, but that doesn't mean it wasn't delicous! :-)\n~ Sesame Chicken: This was different from most of the sesame chicken I've had, but it worked.  I liked that it had it's own style and brought the heat.\n~ Sweet & Sour Chicken: It's sweet & sour chicken, not much to say. It was very good though. I have had some sweet and sour chicken dishes that tasted like ass!\n~ Hot & Sour Soup: This was one of the best Hot and Sour soups I've ever had. There was a lot of stuff in the soup, including large pieces of mushroom, tofu, and delicious egg.\n\nThis wasn't the best Chinese food we've had, but it still was good. My girlfriend and I will definitely be ordering again from May Lee's.  their fast, friendly delivery made it even easier.\n\nA hardy thanks!", "rating": 3, "date": "2007-06-28"}, {"excerpts": ["It was spicy enough but not memorable; combo chow mein ($6.50) which was soggy and had beef, chicken and fried shrimp in it (didn't like this one) and broccoli beef over rice ($5.95) which was OK.   \n", "I'm not sure what type of restaurant it is, as they serve sushi/Japanese food too (nigiri, sashimi, maki roll, vegan & combo sushi/sashimi)  ", "Everyone in the kitchen was speaking Cantonese.  \n", "Didn't need to use the bathroom ", "but I did hear a dad ask for soap for his daughters to wash their hands.  ", "That was enough to make me not wanna use the bathroom."], "author": "Ry T.", "review": "I used to live just 3 buildings away from this place.  But, this place did not exist when I lived in the neighborhood, otherwise, I'd surely would've tried it by now.  \nOn a whim, we stopped for take-out and I recognized a dude going back into the house next door to my old apt building.  I couldn't believe he still lived there after all these years....\nBack to May Lee's.  A hole in the wall smack in the middle of 7th Avenue with nothing but residential buildings.  Like a pineapple in the middle of a ski slope.  There are 2 tables for 4 and one more in the back which the staff was using to make eggrolls and won ton (the ingredients were laid out on the table).  \nEvidently, they do most of their business in take-out.  The driver came back in his down jacket, washed his hands and proceeded to help out in the kitchen (still with his down jacket on, probably ready for a quick get away when he has to hit the road to deliver).  It's a mom-pop business with delivery all over the city she told me, even Treasure Island for an extra $4.00 fee and minimum $10 purchase.  No checks accepted, credit cards OK.\nWe took home the lunch specials (M-Sa before 4PM) of Mongolian beef ($6.25) over rice which was more yellow and green onions than beef.  It was spicy enough but not memorable; combo chow mein ($6.50) which was soggy and had beef, chicken and fried shrimp in it (didn't like this one) and broccoli beef over rice ($5.95) which was OK.   \nI'm not sure what type of restaurant it is, as they serve sushi/Japanese food too (nigiri, sashimi, maki roll, vegan & combo sushi/sashimi)  Everyone in the kitchen was speaking Cantonese.  \nDidn't need to use the bathroom but I did hear a dad ask for soap for his daughters to wash their hands.  That was enough to make me not wanna use the bathroom.", "rating": 2, "date": "2009-01-24"}], "soft noodle with tomato and chicken": [], "chow fun rice noodle": [{"excerpts": ["Chow fun rice noodle with beef (dry style) $6.95 http://www.yelp.com/biz_photos/may-lees-san-francisco#W0PNfjU8RDMDH4uCVBnGlQ\n", "*Happy family (no carrots) $10.95 http://www.yelp.com/biz_photos/may-lees-san-francisco#K6pj_HD_kjOptv52u0a2hw\n"], "author": "Elena N.", "review": "I typically have the week between Christmas and New Year's off. That means on super lazy days, the roommate and I order delivery. A lot! In December 2012, I decided to revisit May Lee's. We ordered via GrubHub.\n\n*Assorted appetizers ($9.95) http://www.yelp.com/biz_photos/may-lees-san-francisco#YTiu9cE3ChW2IURtMRoZyw\n*Wor wonton soup (no carrots) $6.95 http://www.yelp.com/biz_photos/may-lees-san-francisco#VRI-QHLHtDF5hzyjgjmidw\n*Salt & pepper pork rib ($8.50) http://www.yelp.com/biz_photos/may-lees-san-francisco#tBxcf8l-ufCbVBWEcmtKEg\n*Chow fun rice noodle with beef (dry style) $6.95 http://www.yelp.com/biz_photos/may-lees-san-francisco#W0PNfjU8RDMDH4uCVBnGlQ\n*Happy family (no carrots) $10.95 http://www.yelp.com/biz_photos/may-lees-san-francisco#K6pj_HD_kjOptv52u0a2hw\n*Free chicken fried rice with any order of $35 or more http://www.yelp.com/biz_photos/may-lees-san-francisco#BIzwJ18FOV2dy80FTW24aw\n\nI remember looking forward to the variety in May Lee's assorted apps. You get bbq pork ribs, egg rolls, potstickers, crab rangoon and fried shrimp. A nice selection. But the taste was lacking. The ribs were tough and the fried items were soggy by the time they got to our place. It was nice ordering through Grubhub though as we got free fried rice! Score!\n\nOverall, pretty average Chinese food. I'd say everything was A-OK!", "rating": 3, "date": "2014-12-27"}], "small veggie chow mein": [], "small chicken chow mein": [], "garlic chow mein noodle": [], "spicy mongolian beef chow mein noodle": [], "mongolian beef over rice lunch special": [{"excerpts": ["I ordered the Mongolian beef over rice lunch special. ", "It came with some really hot and really spice soup and an egg roll. ", "I liked everything about my meal. ", "The hot and sour soup was well done and the mongolian beef was strong and meaty with plenty of onions."], "author": "Milki M.", "review": "This is the chinese restaurant that I have always been missing in a college town. I've been to CMU, UCB, UCLA and chinese food was never really a great presence. But May Lee's just blew me out of the water. The lunch specials are cheap. Reviews love the delivery service. The food reminds me of chinatown restaurants.\n\nI wish all college towns had a good chinese restaurant like May Lee's.\n\nI ordered the Mongolian beef over rice lunch special. It came with some really hot and really spice soup and an egg roll. I liked everything about my meal. The hot and sour soup was well done and the mongolian beef was strong and meaty with plenty of onions.", "rating": 4, "date": "2014-01-26"}], "mongolian chicken over rice lunch special": [], "sesame beef over rice lunch special": [], "sesame chicken over rice lunch special": [], "string bean beef over rice lunch special": [], "string bean chicken over rice lunch special": [], "broccoli beef over rice lunch special": [], "broccoli chicken over rice lunch special": [], "chinese greens with beef over rice lunch special": [], "kung pao beef over rice lunch special": [], "kung pao chicken over rice lunch special": [], "generals chicken over rice lunch special": [], "chicken and shrimp with vegetable over rice lunch special": [], "spicy mongolian beef chow mein lunch special": [], "combination chow mein lunch special": [], "combination fried rice lunch special": [], "veggie chow mein lunch special": [], "veggie fried rice lunch special": [], "beef chow fun rice noodle lunch special": [], "sweet and sour chicken over rice lunch special": [], "eggplant and tofu over rice lunch special": [], "chinese green with fish filet over rice lunch special": [], "salt and pepper pork chop lunch special": [], "salt and pepper chicken lunch special": [{"excerpts": ["Teriyaki sauce wasn't enough, ask for some more. \nSalt and Pepper Chicken Lunch Special : 5/5 . "], "author": "Rachit A.", "review": "Ordered :\nMongolian Chicken Lunch Special : 3/5. Chicken was too rubbery, order something else.\nChicken Teriyaki Lunch with Rice and Salad : 4/5 . Teriyaki sauce wasn't enough, ask for some more. \nSalt and Pepper Chicken Lunch Special : 5/5 . Loved this\n\nWill order again : 4/5 . YES", "rating": 4, "date": "2014-11-08"}], "basil chicken over rice lunch special": [], "basil beef over rice lunch special": [], "seafood with tofu over rice lunch special": [], "string bean with spareribs over rice lunch special": [], "walnut prawn over rice lunch special": [], "salmon with tofu over rice lunch special": [], "sweet and sour pork over rice lunch special": [], "tofu salmon over rice lunch special": [], "scrambled egg with beef over rice lunch special": [], "scrambled egg with chicken over rice lunch special": [], "butter molen beef over rice": [], "butter molen chicken over rice": [], "shrimp teriyaki": [], "tuna and salmon sashimi": [], "salmon sashimi": [{"excerpts": ["I ordered a rainbow roll ($9.95), edamame ($3.25), salmon sashimi (8 pc. for $10.95) and a spicy tuna roll ($5.75).  ", "The salmon sashimi was a good size, and everything was still chilled (probably helped that it was cold outside).  "], "author": "Tori S.", "review": "This review is for their delivery, so I can't really say much about their in-restaurant experience.\n\nI work in what is possibly the most inconvenient, drab neighborhood in San Francisco: Treasure Island.  Restaurants HATE delivering to the Island, and when I am stuck in the office alone, I can't go anywhere to get food.\n\nLo and behold, my coworker once ordered from May Lee's and left their to-go/delivery menu on my desk.  After realizing that a cup-o-noodles just wasn't going to do it for me, I dialed their # and decided to place an order.\n\nDepending on where you are, the minimum ranges from $10-30.  For me, since I'm located in the middle of the bay, I had to ring up a total of $30, plus they had to throw in an extra $4 because it's, well, in the middle of the bay.  So really the total had to only be $26.  Knowing that Japanese food is more expensive than Chinese food, I decided to go with that, rather than order like 18 things of Chinese food.\n\nI ordered a rainbow roll ($9.95), edamame ($3.25), salmon sashimi (8 pc. for $10.95) and a spicy tuna roll ($5.75).  Tax and tip and everything came out to a little over $40, which is pretty decent for the amount of food I got, plus the convenience of not having to leave my office.\n\nWhen they delivered the bag, I found 3 pairs of chopsticks.  Way to go for making me feel like a fatty.\n\nSurprisingly their sushi was very good and fresh.  The salmon sashimi was a good size, and everything was still chilled (probably helped that it was cold outside).  The rainbow roll and spicy tuna roll were both decent as well, and my only complaint was with the edamame, which was generally flavorless.\n\nAll in all, plus points for being friendly, fast and relatively cheap.  More bonus points for delivering to Treasure Island and taking credit cards.  The whole process was super simple, and I'll definitely be ordering from them again when I feel hunger pangs at work!", "rating": 4, "date": "2009-12-21"}], "tuna maki": [], "salmon maki": [], "salmon tuna roll": [], "tuna avocado roll": [], "avocado cucumber oshinko roll": [], "chefs vegetarian roll": [], "regular sushi combination": [], "sushi and sashimi combo": [], "orange soda": [], "shrimp and veggie tempura": [], "family dinner": [], "combo king mongolian beef special dinner": [], "combo king salt and pepper pork chop special dinner": [], "combo king string bean chicken special dinner": [], "combo king walnut prawn special dinner": [], "combo king orange chicken special dinner": [], "combo king broccoli with beef special dinner": [], "choose any  dishes": [], "deep fried shrimp ball": [], "bbq pork bun dim sum": [], "siu mai": [], "sesame balls": [], "wonton with chili sauce": [], "salt and pepper tofu dim sum": [], "vegetable and pork dumplings": [], "shanghai steamed dumplings": [], "meatless chicken with broccoli": [], "meatless kung pao chicken": [], "meatless cashew chicken with veggie": [], "meatless string bean chicken": [], "meatless general chicken": [], "meatless orange chicken": [], "meatless sweet and sour chicken": [], "meatless mongolian chicken": [], "meatless mongolian beef": [], "meatless prawn": [], "meatless beef with broccoli": [], "meatless prawn with broccoli": [], "meatless kung pao beef": [], "meatless kung pao prawn": [], "meatless beef with string bean": [], "meatless prawn with string bean": [], "hunan meatless beef": [], "hunan meatless prawn": [], "basil meatless beef": [], "basil meatless prawn": [], "string beans and chicken breast": [], "jalapeno chicken with chefs sauce": [], "chicken with cashew": [], "kung pao chicken with peanuts": [], "chicken breast with broccoli": [], "mongolian chicken breast": [], "chicken breast with snow pea": [], "curry chicken breast": [], "chicken breast with assorted vegetables": [], "chicken wings with spicy honey sauce": [], "hunan chicken breast": [], "crispy chicken with sesame": [], "chicken breast with tofu": [], "chicken with eggplant": [], "mongolian beef over rice dinner special": [], "mongolian chicken over rice dinner special": [], "sesame beef over rice dinner special": [], "sesame chicken over rice dinner special": [], "string bean beef over rice dinner special": [], "string bean chicken over rice dinner special": [], "broccoli beef over rice dinner special": [], "broccoli chicken over rice dinner special": [], "chinese greens with beef over rice dinner special": [], "kung pao beef over rice dinner special": [], "kung pao chicken over rice dinner special": [], "generals chicken over rice dinner special": [], "chicken and shrimp with vegetable over rice dinner special": [], "combination chow mein dinner special": [], "combination fried rice dinner special": [], "veggie chow mein dinner special": [], "veggie fried rice dinner special": [], "beef chow fun rice noodle dinner special": []}