{"chiuchow spice veg  pig bowel soup": [], "seafood bean cake soup": [], "mustard green pork  egg soup": [], "menkee house porridge": [], "fish ball  beef ball porridge": [], "mince beef potridge": [], "sampan porridge chiuchow style": [], "pork  preserved egg porridge": [], "egg beef porridge": [], "chicken  fish ball porridge": [], "prawn porridge": [], "live clam porridge": [], "pig blood porridge": [], "salted fish  peanut porridge": [], "chiuchow style oyster  pork porridge": [], "chiuchow style porridge": [], "plain porridge": [{"excerpts": ["For $19.95, it comes with plain porridge, spiced salted silver fish, onion stir fry chicken, pickled turnip with egg and deep fried tofu.  "], "author": "LeeLee C.", "review": "Hubby loves this place for the cheap price and good quality of beef shank with stir fry noodle in old times.  \n\nWe came to revisit last weekend.  Their chiuchow style dinner set has good value and is actually available all day long. For $19.95, it comes with plain porridge, spiced salted silver fish, onion stir fry chicken, pickled turnip with egg and deep fried tofu.  The silver fish and the pickled turnip with egg are good, the chicken is a disappointment as it seems like Panda Express stirfry.  \n\nThe restaurant has been around for quite some time, but the maintenance isn't up to date, so everything is pretty old and dirty.  We also ordered some chiuchow style food to go, the satay beef stir fry noodle, taro sausage fried rice and garlic eggplant.  They are so so, not impressive.", "rating": 3, "date": "2011-11-06"}, {"excerpts": ["We usually order some small dishes such as the salt-n-pepper, small, white fish and the stuffed combo (egglplant, tofu, bell pepper) and have that with plain porridge. ", "I personally, prefer the regular, Cantonese style porridge. "], "author": "Cuisine N.", "review": "This place specializes in chiu-chow style cooking. We usually order some small dishes such as the salt-n-pepper, small, white fish and the stuffed combo (egglplant, tofu, bell pepper) and have that with plain porridge. I personally, prefer the regular, Cantonese style porridge. The chiu-chow style porridge is just cooked rice served in hot water.\n\nOverall, the prices are rock bottom for tasty chinese food so try to overlook the whole-in-the-wall decor.", "rating": 4, "date": "2006-08-01"}], "wonton  noodle soup or wonton soup": [], "noodle soup not meat": [], "beef noodle or wonton soup": [], "beef stewed noodle or wonton soup": [], "chicken noodle or wonton soup": [], "bbq pork noodle or wonton soup": [], "combo seafood noodle or wonton soup": [], "wor noodle or wonton soup": [], "beef stewed or beef loo noodle": [], "yee fu wonton soup": [], "house fried wonton sweet  sour": [], "fish ball stick rice noodle or flat noodle soup": [], "minced beef stick rice noodle or flat noodle soup": [], "pork  spice veg stick rice noodle or flat noodle soup": [], "chicken stick rice noodle or flat noodle soup": [], "combo seafood stick rice noodle or flat noodle soup": [], "beef rice noodle soup": [], "chicken rice noodle soup": [], "combo seafood rice noodle soup": [], "bean sprout rice noodle soup no meat": [], "chiuchow style peanut": [], "chiuchow style spice veg": [], "stuffed egg plant bean cake  pepper": [], "deep fried stuffed bean cake": [], "spice salted bean cake": [], "house bean cake sweet  sour": [], "dried pig skin  pig blood": [], "jelly fish with preserved egg": [], "curry squid  fish ball hot": [], "beef tripe w superior soy": [], "spice veg with pig bowel": [], "egg rolls chiuchow style": [], "chiuchow oyster cake": [], "spice salted silver fish": [], "pan fried egg with silver fish": [], "clam meat with chive": [], "spice turnip with egg": [], "clam in soup": [], "chiuchow chicken hot": [], "chiuchow style beef hot": [], "fish ball  beef ball w spice salted": [], "duck tongue w superior soy": [], "spice salted squid": [], "chiuchow duck": [], "spice salted duck tongue": [], "spice salted soft shell crab": [], "deep fried pig bowel": [{"excerpts": ["Love the deep fried pig bowel. ", "If you get over the fact that it is pig bowel ", "it tastes delicious. ", "Love their Hong Kong style noodles. ", "These people work hard on their quick service Chinese food. ", "Way better than panda (barf). ", "Pretty grimy in here but food is on point."], "author": "Yumi C.", "review": "Nostalgia.  I grew up eating here and never wrote a review. Every time I come back it brings memories.  Love the deep fried pig bowel. If you get over the fact that it is pig bowel it tastes delicious. Love their Hong Kong style noodles. These people work hard on their quick service Chinese food. Way better than panda (barf). Pretty grimy in here but food is on point.", "rating": 5, "date": "2016-09-19"}], "mongolian chicken hot": [], "beef bean cake": [], "kung po prawn hot": [], "combo seafood broccoli": [], "chicken black bean sauce": [], "kung po chicken": [], "spiced salted or sweet  sour rib": [], "spice salted shrimp": [{"excerpts": ["they have an $18 dinner special w/the following (no substitutions & it's on the green menu but only in chinese): spice salted shrimp (w/the shells & head on), half a salted steamed chicken w/ginger & scallions, garlic mustard greens"], "author": "Yolanda L.", "review": "Family & I have been coming here forever..since they've opened which is 20 years. Chef has great wok skills & consistent EVERY TIME. There have been some mishaps as in getting the wrong order but I blame the mom who takes the phone orders (she usually is the kitchen helper but sometimes she has to answer the phones & she probably heard it wrong).\n\nthe BEST spice salted calamari EVER! Same goes for spice salted little fishes to go w/your chiu chow jook (which is really watery rice rather than a porridge).\n\nour staples: salty fish pan fried minced meat 'cake' (haam yu jeen yook baeng), beef chow fun (extra bean sprouts), any of their stir fried greens (depends what restaurant has on hand & either w/plain garlic or fermented soy bean cubes \"fu yue\" or salty shrimp paste \"haam ha\"), asparagus beef/shrimp/chicken (seasonal), any of their fried rices, scrambled eggs w/prawns flat rice noodle (it has a more 'wet/gravy' base), eggs w/corn fried fish filet (over rice or by itself), FRIED wontons w/sweet & sour dipping sauce. They also have good eggplant dishes (i like 'em all). \n\nthey have an $18 dinner special w/the following (no substitutions & it's on the green menu but only in chinese): spice salted shrimp (w/the shells & head on), half a salted steamed chicken w/ginger & scallions, garlic mustard greens, pan fried 3 treasures (fried tofu, eggplant, green peppers very minimally stuffed w/fish paste)..those 4 items for $18, perfect for 3 ppl to eat.\n\nwhen crabs/lobsters are in season, we usually buy 1 or 2 live at a asian market..take it over to Menkee, pay couple bucks (for labor & their ingredients) to have it spice salted fried or stir fried w/ginger & green onion... droool......I always tip them well (like $10-15 extra) when I pick up the cooked crab b/c they're doing all the work for you.\n\nNote: VERY HOLE IN THE WALL so if you don't like grimey tables & floors, get it to go! (though their calamari or anything fried is best eaten there piping hot! I've done those for takeout, it's so different..unless u have a toaster oven to reheat it...still not quite the same). \n\nAnd don't mind the young girl waitress, it's a family business & she's stuck w/her life working there b/c she has to help her family 365 days/year (this place NEVER closes, not even for chinese new year or major holidays) so can you blame her? This entire family never gets a day off (unless Chef is sick which I've NEVER seen).\n\nCASH ONLY", "rating": 5, "date": "2015-09-04"}], "sss fillet fish": [], "spice veg w belt fish": [], "mongolian beef hot": [], "egg plant beef": [], "prawn  vegetable": [], "scallop  vegetable": [], "clam with black bean sauce": [], "chicken w green bean": [], "house chicken sweet  sour": [], "szechuan egg plan hot": [], "spice veg squid  beef tripe": [], "vegetable fillet fish": [], "corn wfillet fish": [], "fillet fish w bean cake": [], "broccoli with garlic": [], "hot garlic egg plant": [], "egg plant with bean cake": [], "bean cake with mix vegetable": [], "chinese broccoli with oyster sauce": [], "tender green with garlic": [], "mustard green with garlic": [], "curry mix vegetable": [], "green bean with onion": [], "fried bean cake w vegetable": [], "pan fried egg wspice turnip": [], "kung po vegetable hot": [], "egg fu yung w bean spours": [], "dry fried beef flat noodle": [], "fried flat noodle or chow mein w superior soy no meat": [], "beef veg fried flat noodle or chow mein": [], "meat  egg plant fried flat noodle or chow mein": [], "combo seafood fried flat noodle or chow mein": [], "chicken veg fried flat noodle or chow mein": [], "menkee house fried flat noodle or chow mein": [], "dry fried flat noodle or chow mein w spice veg no meat": [], "beef stewed veg fried flat noodle or chow mein": [], "tomato beef fried flat noodle or chow mein": [], "curry beef fried flat noodle or chow mein hot": [], "prawn scramble egg fried flat noodle": [], "beef scramble egg fried flat noodle": [], "mixed veg fried flat noodle or chow mein no meat": [], "beef black bean sauce fried flat noodle or chow mein": [], "broccoli chicken fried flat noodle or chow mein": [], "mongolian chicken fried flat noodle or chow mein hot": [], "clam meat fried flat noodle or chow mein": [], "shredded meat fried stick rice noodle": [], "hamon fried stick rice noodle": [], "chicken veg fried stick rice noodle": [], "combo seafood fried stick rice noodle": [], "singapore style fried stick rice noodle hot": [], "shredded pork fried stick rice noodle": [], "chicken  spiced veg fried rice noodle": [], "broccoli chicken fried rice noodle": [], "beef veg fried rice noodle": [], "combo seafood veg fried rice noodle": [], "tomato beef fried rice noodle": [], "chiuchow beef fried rice noodle hot": [], "beef scramble egg fried rice noodle": [], "pig blood skin bowel  bean cake hot pot": [], "chiuchow chicken bean cake hot pot hot": [], "combo seafood bean cake hot pot": [], "meat salted fish  egg plant hot pot": [], "fishcake hot pot": [], "beef stew hot pot": [], "sweet  sour pork over rice": [], "spiced salted or sweet  sour pork ribs over rice": [], "menkee house rice": [], "beef stewed veg over rice": [], "beef veg over rice": [], "minced beef over rice": [{"excerpts": ["My favorites:\nSingapore Rice Noodles\nMinced Beef Over Rice\nSalted Fish with Chicken Fried Rice\nTomato Chicken Chow Mein\nCurry Chicken Crispy Noodles\n", "Thousand Year Egg w/ Pork Porridge\nDried or Wet Fried Beef Chow Fun\nBBQ Pork Wonton Noodles w/ Vegetable"], "author": "Food N.", "review": "Woohoo!  Cheap and authentic Chinese food to go.\nCome on, where else are you going to get a satisfying made to order meal for under $5.\nMy favorites:\nSingapore Rice Noodles\nMinced Beef Over Rice\nSalted Fish with Chicken Fried Rice\nTomato Chicken Chow Mein\nCurry Chicken Crispy Noodles\nThousand Year Egg w/ Pork Porridge\nDried or Wet Fried Beef Chow Fun\nBBQ Pork Wonton Noodles w/ Vegetable", "rating": 5, "date": "2010-04-27"}, {"excerpts": ["Minced Beef Over Rice\n"], "author": "Ann O.", "review": "Menkee is very inexpensive.  The food is tasty and the salt content is low. \n\nI usually order take out food and soup to go.  The daily soup reminds me of my childhood.  Heart-warming broth.  The daily soup is made fresh with meat, vegetables, and dried bok choy.    Yummy.  I grew up on soup.   \n\n\nMy list of favorites:\n\nMixed Vegetables w/ Beef or Chicken Over Rice\nMinced Beef Over Rice\nBBQ Pork Wonton Noodles w/ vegetables\nDried Beef Chow Fun\nTomato Chicken Chow Mein\nSingapore Rice Noodles\n\nI recommend Menkee for an inexpensive lunch and/or dinner.", "rating": 5, "date": "2010-08-09"}], "chiuchow style beef over rice hot": [], "beef green bean over rice": [], "beef broccoli over rice": [], "tomato beef over rice": [], "beef bean cake over rice": [], "mongolian beef over rice hot": [], "beef tripe black bean sauce over rice": [], "curry chicken over rice hot": [], "chiuchow chicken over rice hot": [], "house chicken sweet  sour over rice": [], "chicken black bean sauce over rice": [], "kung po chicken over rice hot": [], "egg plant chicken over rice": [], "chicken bean cake over rice": [], "chicken broccoli over rice": [], "szechuan egg plant over rice hot": [], "curry squid over rice hot": [], "prawn  veg over rice": [], "combo seafood over rice": [], "meat salted fish  egg plant over rice": [], "mixed veg over rice not meat": [], "broccoli bean cake over rice not meat": [], "green bean  onion over rice no meat": [], "egg  green pea fried rice not meat": [], "young chow fried rice": [], "chicken  salted fish fried rice": [], "mixed veg fried rice no meat": [], "chiuchow sausage fried rice": [], "prawn  chicken over fried rice": [], "fukien style combo fried rice": [], "steam rice per person": [], "turtle pudding": [], "up coke": [], "watermelon juice": [], "beer": [{"excerpts": ["By the way, they don't serve beer."], "author": "Sammy G.", "review": "This place has the best priced salt and pepper squid and quality, second to Yuet Lee. Salt and pepper prawns ain't bad either. But this is for the price conscious foodie. They have all the basic soups, stews, over rice dishes, and noddles of above average quality. Their vegetable dishes are exceptional. You can't really complain about the ambiance because the price, and consistency. The owner is the cook and this guy knows how to do it right. He even puts other restaurants to shame with his sweet and sour pork. This place does a lot of catering and large orders. The wait staff, except for David, who is now an engineer, have lack luster personalities. So if we're tight in the pocket and have an inkling for provincial Chinese cooking, this is our go-to place in the outer sunset. By the way, they don't serve beer.", "rating": 4, "date": "2015-04-10"}, {"excerpts": ["\"Da Lang\" is basically Chiu Chow slang for eating a combination of Chiu Chow snack food (to be consumed with liquor or beer), sometimes room temperature to cold food (including cold crabs and yes...cold fish like mullet head or \"big eye chicken\" which is a small red fish with a large eye, like kinmedai). ", "But on the same menu you can also order stuff like marinated cubed pork blood jelly, peanut with pig tail, pepper pork stomach pickled veg soup, and "], "author": "Ken K.", "review": "1977 famous movie quote from Princess Leia: \"Help me Obi Wan Kanobi you're my only hope\"\n\nLike Leia, I was hoping Obi Wan MenKee could be the Chiu Chow cuisine savior it claims to be. Literally this is the only Chiu Chow Cantonese place I know of, Vietnamese Chinese people running Chiu Chow esque noodle shops aside (which is a completely different approach). \n\nInstead I got Obi Half, or maybe Obi Zero. Not Coke Zero.\n\nWhere do I begin? Chiu Chow cuisine in Hong Kong has basically 3 styles and approaches. The first is when Chiu Chow/Teochew used to be heavily influenced by Min cuisine (Fujian), thus oyster noodles, pork intestine soups and dishes, and mee sua/noodles, thus some of that influence rubbed off on the cuisine. This is why you see oyster pancakes/oyster omlettes (pan fried) in Taiwanese street food, and also in Chiu Chow restaurants all over Hong Kong (and also you can find it in Fujian too). A good oyster pancake is a sign of having steady access to insanely fresh local seafood (or an oyster farm). But this is San Francisco....we have to forgive this shortcoming.\n\nThe other \"soul\" of Chiu Chow cuisine is what is deemed \"lo shui\" or a complex soy sauce based marinade that contains a lot of proprietary ingredients, spices, and herbs. Bird, meat, fowl, tofu, and fowl innards/wings/feet/tongue....it goes in that marinade, then gets cooked, and served as appetizers or entrees, really top notch stuff. For fowl, goose is the leader, but duck can be common. The marinade is like a family sauce, never discarded and always added to it. The longer the history of a restaurant, the better the sauce. It's the same principle for the anago (sea eel) sushi nikiri brush sauce at the very traditional restaurants (e.g. Sushi Bun by Tsukiji Fish Market Uogashi, 120 year old 5th generation owner, using the original sauce simmered down from eel bones, and a separate brush sauce for abalone and clams, the sauce is continuously cooking and added to, you know dat chit is going to be awesome). \n\n\"Da Lang\" is basically Chiu Chow slang for eating a combination of Chiu Chow snack food (to be consumed with liquor or beer), sometimes room temperature to cold food (including cold crabs and yes...cold fish like mullet head or \"big eye chicken\" which is a small red fish with a large eye, like kinmedai). But on the same menu you can also order stuff like marinated cubed pork blood jelly, peanut with pig tail, pepper pork stomach pickled veg soup, and goose intestines is some of the best stuff in the world.\n\nSo let's just say that 3 stars is overtly generous for MenKee that claims to offer Chiu Chow style \"Da Lang\". If you set your expectations to negative, it might be ok. But let's just say that their offerings do not reflect Chiu Chow cuisine in Hong Kong and it will not remind you of anything, not even close.\n\nThe selections are mostly relegated to stir fry or deep fry. Thus there is nothing that involves cold dishes or cold seafood from a menu glance. There is definitely nothing that is lo shui marinated, except quite possible a \"Chiu Chow Duck\" dish...and even that was sold out last night, and I wasn't feeling $8.50 for a plate of soy sauce marinated duck tongues. So the lack of lo shui marinade eats (and perhaps the low turnover of items from this menu), is a major red flag.\n\nWith that said, alarm bells were going off. Dirty floors, which while may be fine in Hong Kong, seemed out of place in SF. The food is overall affordable (wouldn't say cheap) and if you are looking to fill your stomach without expectations, is perfectly fine.\n\nChiu Chow style chicken with Jinchiew sauce - I really don't know how else to describe this dish, but photos tell a story. What it should really look like:\n\nhttp://media1.ak.yelpcdn.com/photo/xi55wdsIjbFYkxUuys_j9Q/l\n\nBut instead I got black pepper sauce chicken with celery and bell pepper stir fry.\n\nIf they labeled it black pepper sauce chicken in Chinese I would have been fine with it. But sorry, this is not Chinjiew sauce chicken....\n\nChiu Chow Congee - this is excellent in Hong Kong. It does not taste like congee that you and I know it...textural heaven and something about the way the rice and the liquid in the congee interact. But here it is a slop job. $hit.... undercooked congee/overcooked rice drowning in water. I could have made this bad job at home myself. The only saving grace was that they provided a portion of \"hahm suan choy\" (salted pickled veg), very salty...but made it more palatable. Though I have no idea if they made it themselves (doubtful), so likely store bought with who knows what chemicals inside.\n\nOyster pancake - dubbed Chiu Chow style. This was the best dish of the night, and a saving grace. But overall still average. Let's forget for a moment that getting fresh baby oysters is a challenge in this part of town, so the freshness of the oysters is of course in doubt...but it was at least tasty. Putting more oysters in would have been nice.\n\nCheap eat for the area. 2.70 stars", "rating": 3, "date": "2013-01-23"}, {"excerpts": ["Adults will enjoy as well... with a beer or three."], "author": "Sam T.", "review": "I swear this place has been here forever!\n\nI remember Menkee for being a staple at many b-day parties at home. My parents would order party trays of fried chicken, chow mein, fried rice, etc...\n\nThis place is cheap. And the food is good enough for the price. I would equate this as a higher Chinese food version of Chuck E Cheese. Kids will enjoy it. Adults will enjoy as well... with a beer or three.", "rating": 3, "date": "2010-10-13"}]}