{"inhouse drip coffee seasonal blend or french roast": [], "oz drip togo seasonal blend or french roast": [], "coldbrew coffee": [], "oz french press": [], "coffee beans": [{"excerpts": ["De La Paz coffee beans. ", "I love the airy open space and huge window walls that open up to let abundance of sun and vibe of the Octavia street in. ", "A lively, positive place!"], "author": "David K.", "review": "Nice! Drip coffee made to order includes beans from Ethiopia and Rwanda! De La Paz coffee beans. I love the airy open space and huge window walls that open up to let abundance of sun and vibe of the Octavia street in. A lively, positive place!", "rating": 4, "date": "2013-08-05"}, {"excerpts": ["They use locally roasted coffee beans and local artisanal chocolate as well."], "author": "Roberta B.", "review": "Friendly barrista, lovely coffee. I had a wonderful cappuccino and my bf had a great mocha. They use locally roasted coffee beans and local artisanal chocolate as well.", "rating": 4, "date": "2011-06-09"}], "steamers": [], "housemade lemonade": [], "freshsqueezed oj": [], "house kombucha": [{"excerpts": ["This place not only has delicious, individually prepared de la Paz coffee, but they have House kombucha, and fresh squeezed OJ.  ", "They also will refill your cofee for only $1!!  ", "I really love their Rwanda coopac coffee, which is so smooth I don't even add milk even though I normally take milk.  "], "author": "Jaime R.", "review": "Vibe:  Relaxed.  Good music, and patrons are extremely friendly.  GIGANTIC windows that let in light and warmth, and when open -- air. \n\nDrink:  This place not only has delicious, individually prepared de la Paz coffee, but they have House kombucha, and fresh squeezed OJ.  They also will refill your cofee for only $1!!  I really love their Rwanda coopac coffee, which is so smooth I don't even add milk even though I normally take milk.  Did I mention they have $2 PBR bottles and they have several beers on tap that are only $3 during happy hour?  \n\nFood: The fact that they're not serving avocado right now is awesome.  Why is that good?  It's out of season, and these guys do local and organic.  Their sandwhiches and salads are filling and delicious on Acme bread for $7-8.  For a cheaper option, build a bagel sandwhich ($2-3).", "rating": 5, "date": "2011-02-03"}], "martinellis apple juice": [], "draft beer": [{"excerpts": ["Mercury is a great spot to stop for a drink (draft beer or one of many soft drinks) on a Summer's day while window shopping on Hayes Street. ", "It's a block away from the busier cafe", "'s ", "so it's like you can get a spot to sit "], "author": "Spencer H.", "review": "I have been to Mercury 3 times -  twice in the Summer and once last night for a friend's art show opening.\n\nMercury is a great spot to stop for a drink (draft beer or one of many soft drinks) on a Summer's day while window shopping on Hayes Street. It's a block away from the busier cafe's so it's like you can get a spot to sit and if you're lucky you can be by the giant windows which are amazing when they are opened on a warm day.\n\nReally nice, quiet-but-not-too-quiet atmosphere and friendly staff.", "rating": 4, "date": "2011-12-11"}], "vita water": [], "bottled beer": [], "avocado seasonal": [], "chipotle avocado": [], "roasted red pepper": [{"excerpts": ["I ordered a roasted red pepper sandwich and it was so flavorful and fresh. ", "I could taste all the veggies and the hummus was excellent. "], "author": "Juanita H.", "review": "I recently moved to the neighborhood and I am very excited about this cafe. I've been working in Hayes valley for a while but never been here. I have to say, AMAZING FRESH FOOD.  I ordered a roasted red pepper sandwich and it was so flavorful and fresh. I could taste all the veggies and the hummus was excellent. I got the combo with the awesome veggie chili . The chili was also really good with a hint of spice.  I am excited to go back.  The ambiance is nice. I sat outside in the sun and read a book.  The service is also very good. I will be back. This is a really good spot for a decent lunch.", "rating": 5, "date": "2018-08-02"}, {"excerpts": ["Stacked with turkey slices\n\nRoasted Red Pepper Sandwich: 4 stars\nHummus arugula feta. "], "author": "Letitia L.", "review": "Today, after 4th of July, it's pretty empty and thus the wifi is fast. We came here for a light lunch after a 7-course barbecue last night with 2 heapings of desserts.\n\n\n---- FOOD ----\n\nHoliday sandwich: 3.5 stars\nTurkey cranberry a little dry, sauce is unevenly spread. Stacked with turkey slices\n\nRoasted Red Pepper Sandwich: 4 stars\nHummus arugula feta. A solid, fresh sandwich served with side salad, of which the dressing was a delicious vinaigrette with mustard seeds.\n\n\nAccording to my partner, they make delicious lattes too.  Unfortunately, at some point in the afternoon the staff turned on more pumping-thumping music that made it more difficult to concentrate on reading, so we had to leave.  It's still a great location for me, and I'd come back with noise-cancelling headphones I guess?", "rating": 4, "date": "2014-10-15"}, {"excerpts": ["Food review:\n\nRoasted red pepper:  "], "author": "Evelyn N.", "review": "Very solid little neighborhood cafe a few blocks from my home  Beautiful location with 20 ft ceiling, huge windows and white walls make the space open bright and inviting.  Has an old world charm that gives the feel that this place has been here forever (in one reincarnation or another). \n\nNo vegan pastries today, the only pastries I saw were some regular scones.  Food review:\n\nRoasted red pepper:  this was meant to be a sandwich, but you can turn any of their sandwiches into a salad, which is what I did.  I ordered it with extra cucumbers instead of feta and voila! Vegan. It came with hummus and the peppers and cucumbers were marinated. It was tasty.  I'm glad I got the salad dressing on the side because between the marinade and the hummus the salad had plenty of flavor already. It was very filling. \n\nEgg mcmercury. My husband had this.  He said it was tasty, the biscuit was good quality. \n\nCoffee and au lait.  Both good quality.  \n\nI'd like to come back for lunch and try the chili or vegan lentil soup.  They also had about 6 brews on tap, which looked interesting.  The was plenty of room for a stroller, so this would a great place for me to come with my bro and his family. \n\nI'm stuck between giving this place 3 or 4 stars. I really like the vegan options, the atmosphere, the commitment to organic, but I'm just not sure if I'd come back on a regular basis.  Will try lunch and update my review.", "rating": 3, "date": "2012-05-27"}, {"excerpts": ["I have had the roasted red pepper (basically a bunch of humus some roasted red peppers and some greens). ", "It was quite good. ", "Their scones are pretty good as well. "], "author": "Greg G.", "review": "Ok I am a fan. I actually enjoy this place a lot. I moved to the neighborhood recently and this little spot just struck me as ... well home. A few big tables and a bunch of little tables, free wifi, good selection of coffee. It's a little slow but I come here to chill out after work and work on stuff. You can also grab a beer and a sandwich. Sandwiches are a bit pricey but tasty. I have had the roasted red pepper (basically a bunch of humus some roasted red peppers and some greens). It was quite good. Their scones are pretty good as well. Overall a great place.\n\nThey take creditcards but prefer cash, as their sign says. I think this is the nicest sign that says, \"Hey we get charged a fee everytime you make a credit/debit purchase, so please don't take 3% of our coffee sale\" I got to give them props for being polite about it :)", "rating": 5, "date": "2011-05-02"}, {"excerpts": ["Next time I think I'll try the red lentil soup or maybe the roasted red pepper sandwich. ", "They both sound delicious."], "author": "Robert M.", "review": "I stopped into Mercury after finding it in the listings on Yelp for being vegan friendly.\n\nIt's a great little place with a decent amount of seating. One huge bonus is the abundance of power outlets for laptops and the free Wifi with no password. So, it had that going for it before I ever ordered.\n\nI ordered the vegan chili with chips and guacamole. It was 7.50 and very filling and tasty. They warned me that the guac was spicy and the guy who was making it talked about how he burned his hands on the jalapenos. So, bonus points for the warning and for the super fresh and spicy guac. I'll definitely be stopping in there more often.\n\nNext time I think I'll try the red lentil soup or maybe the roasted red pepper sandwich. They both sound delicious.", "rating": 5, "date": "2011-08-03"}], "salame": [], "chipotle turkey": [], "holiday": [{"excerpts": ["Holiday sandwich: ", "3.5 stars\nTurkey cranberry ", "a little dry, sauce is unevenly spread. "], "author": "Letitia L.", "review": "Today, after 4th of July, it's pretty empty and thus the wifi is fast. We came here for a light lunch after a 7-course barbecue last night with 2 heapings of desserts.\n\n\n---- FOOD ----\n\nHoliday sandwich: 3.5 stars\nTurkey cranberry a little dry, sauce is unevenly spread. Stacked with turkey slices\n\nRoasted Red Pepper Sandwich: 4 stars\nHummus arugula feta. A solid, fresh sandwich served with side salad, of which the dressing was a delicious vinaigrette with mustard seeds.\n\n\nAccording to my partner, they make delicious lattes too.  Unfortunately, at some point in the afternoon the staff turned on more pumping-thumping music that made it more difficult to concentrate on reading, so we had to leave.  It's still a great location for me, and I'd come back with noise-cancelling headphones I guess?", "rating": 4, "date": "2014-10-15"}, {"excerpts": ["The holiday. ", "It was ok nothing special, but that stood out", ", it's a cafe and they don't specialize in it.  ", "The coffee was tasty strong but not super bitter. "], "author": "Juan C.", "review": "I'm a local and I tend to spend a lot of time on cafes, those that are good I make regulars. This place gave me mixed feelings.\n\nThe food: Ok so far I tried a sandwich that came with mixed greens. The holiday. It was ok nothing special, but that stood out, it's a cafe and they don't specialize in it.  The coffee was tasty strong but not super bitter. 3stars\n\nThe staff/service: The service is avarage, they're nice, they great, but are not very attentive. The music like was mentioned in another review is a mixed bag of genres depending on the barista, which is fine cause I like different types of music. But it was blasting!!! It felt like a club rather than a cafe, I could barely hear my own thoughts. I'm here trying to work, read or even talk to someone next to me I shouldn't have to be yelling.  The owner/manager should let the barristas know what the maximum music blasting level should be. When I asked him to turn it down, he seemed annoyed, and turned it down a bit. I sat down and had to politely ask him to turn it down again, which he did, it's still a bit loud. I shouldn't feel like it's unpolite to ask him to turn it to a reasonable level like they have it at most cafes.  I could hear it through my headphones. He wasn't rude but wasn't happy about my suggestions, the guy with the long brown hair could learn to be more aware that it's not a club/bar. He did turn it down more when he noticed I was on yelp haha. There was a girl barrista last time I came that was playing different music but didn't blast it as much. 2star \n\nThe ambiance: The seating is average, lots of little tables packed in together. The art and arrangement is ok. It looks a bit old and worn down, it could use a good cleaning and a paint job. Overall it's a good spot to sit at and work on but again without blasting music, and a bass that makes my chair vibrate. I liked the music but not the loudness. The place looks meh. It has outside seating which is nice a bit addition so they get, 3stars\n\nI'll give them another try and see if they improve. This is all things that they could use to improve their business and bring more customers. I'm sure people get turned off when things like this happen.", "rating": 3, "date": "2014-09-12"}], "roast beef and horseradish": [], "pb and j": [], "red lentil soup": [{"excerpts": ["Next time I think I'll try the red lentil soup or maybe the roasted red pepper sandwich. ", "They both sound delicious."], "author": "Robert M.", "review": "I stopped into Mercury after finding it in the listings on Yelp for being vegan friendly.\n\nIt's a great little place with a decent amount of seating. One huge bonus is the abundance of power outlets for laptops and the free Wifi with no password. So, it had that going for it before I ever ordered.\n\nI ordered the vegan chili with chips and guacamole. It was 7.50 and very filling and tasty. They warned me that the guac was spicy and the guy who was making it talked about how he burned his hands on the jalapenos. So, bonus points for the warning and for the super fresh and spicy guac. I'll definitely be stopping in there more often.\n\nNext time I think I'll try the red lentil soup or maybe the roasted red pepper sandwich. They both sound delicious.", "rating": 5, "date": "2011-08-03"}], "veggie chili": [{"excerpts": ["I got the combo with the awesome veggie chili . ", "The chili was also really good with a hint of spice.  ", "I am excited to go back.  ", "The ambiance is nice. ", "I sat outside in the sun and read a book.  ", "The service is also very good. ", "I will be back. ", "This is a really good spot for a decent lunch."], "author": "Juanita H.", "review": "I recently moved to the neighborhood and I am very excited about this cafe. I've been working in Hayes valley for a while but never been here. I have to say, AMAZING FRESH FOOD.  I ordered a roasted red pepper sandwich and it was so flavorful and fresh. I could taste all the veggies and the hummus was excellent. I got the combo with the awesome veggie chili . The chili was also really good with a hint of spice.  I am excited to go back.  The ambiance is nice. I sat outside in the sun and read a book.  The service is also very good. I will be back. This is a really good spot for a decent lunch.", "rating": 5, "date": "2018-08-02"}, {"excerpts": ["First wanted to try the veggie chili but they were out....", "so the helpful server offered to let me try the lentil soup....and gave me a small ramekin full to taste! ", "Could have made that my meal, but decided to go for the Caprese salad. ", "Bread - warm and perfect. ", "Tomatoes-unbelievably perfectly red and ripe...but not in a gross ewww supermarket kind of a way. ", "Flavorful mozzerella. ", "And the balsamic was a delightful addition..."], "author": "Laurie H.", "review": "Wow....no kidding the sandwiches are good. \n\nI needed to waste a couple of hours waiting for daughter's camp bus to arrive and snatch a parking spot before the rest of the parents, so parked myself here. First wanted to try the veggie chili but they were out....so the helpful server offered to let me try the lentil soup....and gave me a small ramekin full to taste! Could have made that my meal, but decided to go for the Caprese salad. Bread - warm and perfect. Tomatoes-unbelievably perfectly red and ripe...but not in a gross ewww supermarket kind of a way. Flavorful mozzerella. And the balsamic was a delightful addition...one I use at home but don't often get out at restaurants, let alone coffee cafe's.  \n\nEven ran into a dude whose parents live literally 5 min from me in Oakland (I think he still lives there too) so Mercury gets even higher marks for bringin' on the small world vibe. \n\nI'll be spending much time here come fall when chorus starts back up and my chauffeuring duties resume.\n\nWiFi slow: 6 1/2 min video upload = 166 min", "rating": 5, "date": "2010-08-07"}, {"excerpts": ["I really like the veggie chili", ", it's actually quite spicy. "], "author": "Stephanie M.", "review": "People don't wear earbuds in this cafe because the music played is top notch hip shit. Love it! I really like the veggie chili, it's actually quite spicy. I find a lot of spicy food in this city is rather bland, so it makes me happy to find a healthy bowl of chili with a real kick. \n\nYeah, other than that, everything everyone else who gave five stars said, I'll likely agree with.\n\nThey accept credit cards, but support them by paying in cash.", "rating": 5, "date": "2011-02-26"}, {"excerpts": ["Also, their veggie chili is yummy and VERY spicy - great for a chilly day. ", "Have always had a great experience at Mercury Cafe and you surely will too."], "author": "Tanya K.", "review": "The caprese sandwich is possibly the best and freshest I've ever had. Their coffee is made by the cup and will get you GOING in the morning. Also, their veggie chili is yummy and VERY spicy - great for a chilly day. Have always had a great experience at Mercury Cafe and you surely will too.", "rating": 4, "date": "2011-01-17"}], "white bean and sausage stew seasonal": [], "sandwich and soup": [], "egg mcmercury": [{"excerpts": ["This alone is good enough for a 5 star cafe near me, but to top it all off they have a most delicious breakfast sando - called the egg mcmercury - which is made on a home made biscuit (not a bagel) with poached eggs (not microwaved).  ", "This is my new weekend favorite breakfast.  ", "My only challenge will be not wearing it out..."], "author": "Travis B.", "review": "I just moved to the neighborhood and I'm just a block away, so of course I'm going to love it.  However, just to make sure that they got that last star from me, the Mercury Cafe hit me with the perfect package for a neighborhood coffee shop:\n\n* wi-fi that doesn't suck\n* coffee that is very drinkable\n* a laid back laptop/chilling vibe\n* power outlets\n* a campaign to put a parklet out on Octavia\n* open late\n* $2 PBR (yes they serve beer)\n* tasty caprese sandwiches\n\nThis alone is good enough for a 5 star cafe near me, but to top it all off they have a most delicious breakfast sando - called the egg mcmercury - which is made on a home made biscuit (not a bagel) with poached eggs (not microwaved).  This is my new weekend favorite breakfast.  My only challenge will be not wearing it out...", "rating": 5, "date": "2012-07-23"}, {"excerpts": ["Egg mcmercury. ", "My husband had this.  "], "author": "Evelyn N.", "review": "Very solid little neighborhood cafe a few blocks from my home  Beautiful location with 20 ft ceiling, huge windows and white walls make the space open bright and inviting.  Has an old world charm that gives the feel that this place has been here forever (in one reincarnation or another). \n\nNo vegan pastries today, the only pastries I saw were some regular scones.  Food review:\n\nRoasted red pepper:  this was meant to be a sandwich, but you can turn any of their sandwiches into a salad, which is what I did.  I ordered it with extra cucumbers instead of feta and voila! Vegan. It came with hummus and the peppers and cucumbers were marinated. It was tasty.  I'm glad I got the salad dressing on the side because between the marinade and the hummus the salad had plenty of flavor already. It was very filling. \n\nEgg mcmercury. My husband had this.  He said it was tasty, the biscuit was good quality. \n\nCoffee and au lait.  Both good quality.  \n\nI'd like to come back for lunch and try the chili or vegan lentil soup.  They also had about 6 brews on tap, which looked interesting.  The was plenty of room for a stroller, so this would a great place for me to come with my bro and his family. \n\nI'm stuck between giving this place 3 or 4 stars. I really like the vegan options, the atmosphere, the commitment to organic, but I'm just not sure if I'd come back on a regular basis.  Will try lunch and update my review.", "rating": 3, "date": "2012-05-27"}, {"excerpts": ["I had a pastrami or something sandwich one day, which was perfect, with a perfectly dressed salad, and the double egg mcmercury the other two days which are delicious. ", "Great meals."], "author": "Mork M.", "review": "From Chicago, went to SF for a week, ended up eating breakfast here three times in that week. Its great!\n\nSeems like a locals place, unassuming, but really great coffee compared to the other places around hayes we had breakfast at. Quiet as all hell, but not library quiet, just relaxed. I had a pastrami or something sandwich one day, which was perfect, with a perfectly dressed salad, and the double egg mcmercury the other two days which are delicious. Great meals.", "rating": 5, "date": "2012-08-16"}], "mcmercury brunch": [], "housemade pies": [], "jam": []}