{"chicharron al ajo": [{"excerpts": ["Chicharron Al Ajo: ", "These was AMAZING!  ", "Every bit of chicken had a super crispy exterior.  ", "The cuts were a little odd with a bunch of bones, but maybe that kinda small piece big surface area technique is what enables it to be so crispy.  ", "There was an enormous amount of fried garlic on topic, which made it delicious.  "], "author": "Adam B.", "review": "A bit of a hike from the BART station, but totally worth the trek.  So many good things on the menu that you can diversify beyond the standard lomo saltado.  Seriously, everything was just bursting with flavor!\n\nBread, Butter & Salsa: This was different.  Soft bread, soft butter and salsa.  But the salsa was heavy on the onions and cumin, so more like chutney.  Anyway, it was surprisingly delicious.  Had to pace myself to save room for the food I was actually paying for.\n\nChicharron Al Ajo: These was AMAZING!  Every bit of chicken had a super crispy exterior.  The cuts were a little odd with a bunch of bones, but maybe that kinda small piece big surface area technique is what enables it to be so crispy.  There was an enormous amount of fried garlic on topic, which made it delicious.  A nice dip of lemon juice and oil to add a counterbalancing tang.\n\nLomo Saltado: This is typically my favorite Peruvian dish, so I've tried a ton of variations over the years.  They don't get fancy with big chunks of filet mignon.  Just respectable strips of nondescript beef that one would see in a stir fry dish.  I liked that they cut the tomatoes into a similarly manageable shape.  Swimming in its soy based marinade, so lots to flavor the rice with.  The french fries were nice and crispy, but not overly so.\n\nMaracuya: I love passionfruit so I was all about this drink.  Very refreshing paired against all the rich deep fried stuff.", "rating": 4, "date": "2018-04-10"}, {"excerpts": ["I was expecting the Chicharron Al Ajo (chicken smothered in garlic) to be bite worthy ", "but there was no bite to the garlic. ", "I wanted to be punched by all the flavor of the spices and garlic "], "author": "Lakeen W.", "review": "This place was aiiight. I was expecting the Chicharron Al Ajo (chicken smothered in garlic) to be bite worthy but there was no bite to the garlic. I wanted to be punched by all the flavor of the spices and garlic but all I got was a semi dry chicken wings with weak garlic over it. \n\nAs for my main dish I had the Bisteck steak dish. Again it looked like the flavor of the steak was going to attack my taste buds but it fell short and flat. My taste buds were disappointed. :(\n\nAs for the service of this place. I'll give it an \"A\". The servers were fast to seat us even though it was packed at the time we arrived. \n\nOverall- if you're looking for a place to eat in the mission and is tired of eating burritos and tacos. I'd recommend this place.", "rating": 3, "date": "2013-12-03"}, {"excerpts": ["I've had several dishes here, from Pescado al Ajo, Lomo Saltado, Chicharron al Ajo, Garlic Soup, ... ", "you seeing a theme?  ", "Garlic!  ", "I've had another steak dish, but can't recall the name, but it was almost like the Saltado, but without the fries.  ", "I am always happy with the Lomo Saltado, with strips of steak, fries, onions and tomato.  ", "Served with rice, it is carb overload, but it's worth it.  "], "author": "Michael M.", "review": "I first tried this restaurant some time ago on a UYE.  Living nearby, it was perfect.  That night we tried just about everything.\n\nSince then, I've been back several times and tried a few more dishes.  The one thing I can eat all day is the bread, butter and salsa they serve on every table.  Spread some butter on the bread, maybe the fat in the butter acts like a shield for the salsa.  Spoon on the spicy salsa, with plenty of onion, and I'm happy.\n\nI've had several dishes here, from Pescado al Ajo, Lomo Saltado, Chicharron al Ajo, Garlic Soup, ... you seeing a theme?  Garlic!  I've had another steak dish, but can't recall the name, but it was almost like the Saltado, but without the fries.  I am always happy with the Lomo Saltado, with strips of steak, fries, onions and tomato.  Served with rice, it is carb overload, but it's worth it.  People say this is where Peruvians eat.\n\nService is friendly, and they are always willing to make a suggestion for those not sure what they want.  Parking may be hard, but Bank of America has a lot available after banking hours, and you can always circle Mission Street.", "rating": 4, "date": "2012-11-06"}, {"excerpts": ["I was excited and we got the Chicharron De Calamares, Ceviche De Pescado, Empanadas, Chicharron Al Ajo, Lomo Saltado, Chupe De Camarones and Aji de Gallina. \n\n", "O Man Chicharron Al Ajo. ", "My favorite appetizer of the night. ", "The chicken was so tender and juicy. "], "author": "Reginald W.", "review": "If Limon Rotisserie is modern, then Mi Lindo Peru is as traditional as it gets. Run by mom and pops. I was excited and we got the Chicharron De Calamares, Ceviche De Pescado, Empanadas, Chicharron Al Ajo, Lomo Saltado, Chupe De Camarones and Aji de Gallina. \n\nThe Calamares was done right. The right amount of crispiness and not too overcooked. It was easy to eat and the sauce was a great compliment.\n\nThe Ceviche Pescado was overdone, perhaps it was let to sit in the marinade a bit too long as it was \"overcooked\" and it was a bit on the sour side.\n\nThe Empanadas were very large, but the flavor was lacking. It was a bit bland, but still good as the crust was light and flaky.\n\nO Man Chicharron Al Ajo. My favorite appetizer of the night. The chicken was so tender and juicy. The chicken fried just right and the garlic, O the garlic....so delicious that after the chicken was done I was scooping it up to eat with the garnish on the sides.\n\nThe Chupe de camarones was  delicious. It's hard to describe it but here goes. It was thick but leaned on the watery side of thick, the flavor was somewhat familiar but could not put a finger on it and the soup, i believe the soup also had rice in it as well as small and big shrimps and bits of meat.\n\nMy another two of my favorites from the night was the Lomo Saltado and Aji de Gallina. The Lomo saltado had so much flavor, the sauce was so delicious and went well with the fries and rice. My only complaint was that the beef was a little tough but its lean steak so its understandable. Still loved it. \n\nThe Aji de Gallina was very delicious as well and definitely reminded me of curry. But this was so much better than curry, the super hot sauce went so well with the yellow sauce.\n\nAnd everything we had went well with their Chicha Morada, their Chicha Morada is as good as it gets, homemade, what else could you ask for? I would suggest taking out the ice as it dilutes it quite a bit.\n\nIf I did not have their empanadas and their ceviche not as overdone, it would have gotten 4.5 stars.", "rating": 4, "date": "2012-11-18"}, {"excerpts": ["Our purpose for the visit was the fried chicken (chicharron al ajo) which was on the greasy side but the fried garlic contributed to that.  ", "It obviously wasn't fried in a southern US style to which my gf "], "author": "Mike H.", "review": "Mi Lindo Peru has very reasonable prices and very good quality - better than expected. Very friendly service too. Put aside any hangups about modest surroundings.\n\nPro Move: Think twice before bringing a car unless you definitely need it. Parking in the Bank of America lot costs an annoying $12 flat fee, regardless of time, and street parking in the surrounding blocks isn't too tough to find.\n\nOur purpose for the visit was the fried chicken (chicharron al ajo) which was on the greasy side but the fried garlic contributed to that.  It obviously wasn't fried in a southern US style to which my gf and I were accustomed, but the Peruvian style allows for a lot of fried garlic and heavy amount of lemon sauce, as desired. \n\nThe cilantro rice with seafood was good but not great. The rice was cooked well but the seafood was not tender enough. However the arroz con pollo was quite tender and was our favorite dish.", "rating": 4, "date": "2013-05-29"}, {"excerpts": ["Dinner consisted of Chicharron Al Ajo, Yucca Frita, Platano Frito, and two orders of Lomo Saltado. ", "Empanadas were no longer available ", "so we gnawed on the complimentary bread. ", "Yes we got butter ", "but we also got spicy salsa. ", "Salsa on bread? ", "The Chicharron Al Ajo came out shortly. ", "They were the chicken nuggets ", "Brother was bragging about. ", "Small pieces of fried chicken with the crispiest skin you could ever imagine. ", "They were covered (covered was an understatement) in minced garlic and when you dipped the chicken in the lemon sauce ", "oh my god. ", "Barbecue sauce and honey mustard have nothing on it. ", "And if you love garlic, chicharron, and anything fried, this was IT. ", "The yucca fries were denser than potatoes and very filling. ", "The fried plantains balanced out the salt on the table. ", "They were so sweet I could eat them for dessert. "], "author": "Rachel A.", "review": "The pops was not happy when we told him that we were going to have chicken nuggets for dinner.\n\n\"You want fries with that?\"\n\nWe were one order short of McDonalds. The pops was pist. He had made reservations at Limon and we stood Limon up in favor of adding another kiddie to the dinner table.\n\nMi Lindo Peru turned out to be an even better choice than Limon. Mi Lindo Peru combines Peruvian and Spanish cuisine. Brother and I wanted Peruvian and the pops and I have a slight obsession with Spanish food. What can I say? We love our tapas, meat and potatoes.\n\nDinner consisted of Chicharron Al Ajo, Yucca Frita, Platano Frito, and two orders of Lomo Saltado. Empanadas were no longer available so we gnawed on the complimentary bread. Yes we got butter but we also got spicy salsa. Salsa on bread? HELL YEA! \n\nThe Chicharron Al Ajo came out shortly. They were the chicken nuggets Brother was bragging about. Small pieces of fried chicken with the crispiest skin you could ever imagine. They were covered (covered was an understatement) in minced garlic and when you dipped the chicken in the lemon sauce oh my god. Barbecue sauce and honey mustard have nothing on it. And if you love garlic, chicharron, and anything fried, this was IT. The yucca fries were denser than potatoes and very filling. The fried plantains balanced out the salt on the table. They were so sweet I could eat them for dessert. Plantains are always mandatory.\n\nThe Lomo Saltado plate was huge. I wondered why we ordered two and Brother explained the pops said he wanted his own. We all shared anyway and we were able to pack away all those lean and tender strips of beef. The slivers of lightly cooked onions and tomatoes were like fresh salsa for the dish. The beef also came with a pile of papas fritas and tasty white rice. It had everything from A-Z.\n\nMi Lindo Peru is not trendy nor packed. It's at the top of Mission far enough that there was plenty of parking available. Mi Lindo Peru is like eating at home. It's comfort food in epic proportions. And you can kick back and relax. \n\nThe pops was even ready to say, \"Oh sh*t son, this was hella good!\" Because it was.   \n\nThe pops left happy and even let the kiddies go to Mitchell's for dessert afterwards. \n\nThe end.", "rating": 4, "date": "2009-11-21"}, {"excerpts": ["chicharron al ajo/del pollo - $10.95/$9.95 - fried chicken topped with chopped garlic with a side of fresh lemon juice w/ spices.   ", "we were able to almost customize this - with bone in dark meat.  "], "author": "Gloria H.", "review": "Craving tapas and after a not so stella experience at Alegria, I was determined to find the right place.  Almost didn't make it thinking we will never find a parking space or be able to squeeze in on a Friday BUT we were lucky on all fronts!  Got there around 6ish and there was a space almost right outside, we had our pick of the table and the time and attention of our waiter.  \n\nWe picked the corner booth near the window.  Everything on the menu was tempting so we had to seek some recommendations.  The dinner traffic picked up right before 7pm and the place was packed when we left. \n\nThe bread was ok but the salsa was DELICIOUS!  I tried to eat it with everything and finally had a few spoonful by itself.  The pieces of jalapeno pepper added a nice kick to it.\n\nWhat we had:\n\nhalf liter of sangria - $12 - it was pretty good, a bit on the sweet side so the ice helped.  i actually liked the diced apple.\n\nAnticuchos - beef heart - $8.95 - you get two skewer of 3-4 pieces per skewer and two thick slices of grilled potato.  there was this yellow spicy sauce served on a piece of leave.  the beef heart was very flavorful and tender.\n\nchicharron al ajo/del pollo - $10.95/$9.95 - fried chicken topped with chopped garlic with a side of fresh lemon juice w/ spices.   we were able to almost customize this - with bone in dark meat.  tasty.\n\nceviche mixto - $15.95 - fish, calamari, mussel, shrimp served with potato, yam and fried corn.  It's a bit tart. The fried corn was fresh and still hot - yummy.  \n\narroz con mariscos - $15.95 - rice simmered in cilantro sauce mixed with clams, squid, mussels and prawns.  this was delicious!  full of flavor, again hubby enjoyed it even though he's not a fan of cilantro.  it has the nice hint of fragrance but not overpowering on your taste bud.  generous portion.\n\nlook forward to returning and trying other items.", "rating": 4, "date": "2010-09-13"}, {"excerpts": ["For starters, we ordered the Empanada de Carne, which was really good, but the Chicharron Al Ajo was great. ", "Chicken wings are marinated in garlic and then fried and tossed with more garlic and served with a garlicky dipping sauce. ", "Yeah, it's a lot of garlic, but it's not as strong as you might expect and ", "it was an absolutely delicious appetizer. "], "author": "Arnold G.", "review": "Peruvian food has never really been on my radar, but when my friend told me that her brother in law owned Mi Lindo Peru, I was definitely interested in giving it a try. I really had no idea that Mi Lindo Peru was  getting rave reviews here on Yelp. \n\nFor starters, we ordered the Empanada de Carne, which was really good, but the Chicharron Al Ajo was great. Chicken wings are marinated in garlic and then fried and tossed with more garlic and served with a garlicky dipping sauce. Yeah, it's a lot of garlic, but it's not as strong as you might expect and it was an absolutely delicious appetizer. We also ordered some fried plantains that were beautiful and brown and caramelized all over.\n\nMy entree was the Bistek a la Pobre, a top sirloin steak that's sauteed w/ onions and tomatoes and then topped with a fried plantain and a perfect fried egg on a bed of fragrant rice. My wife ordered the Pollo Oregano, a half chicken roasted in oregano and served with the same delicious rice. It was really good and we ended up using the leftovers in some fried rice we made the next day. Sooj ordered a bistek dish similar to mine sans plantain and fried egg, which she loved. This is comfort food at its finest. Their sangria is also excellent.\n\nMi Lindo Peru is a great place to eat and the prices are reasonable. It's a small neighborhood restaurant with a laidback vibe, and if I lived in San Francisco, i'd definitely go there more often. It's only about a 5 minute walk from the 24th Street BART station, so if I ever need a fix, at least I won't have to worry about parking.", "rating": 5, "date": "2007-10-08"}], "chicharron de pollo": [{"excerpts": ["We love the chicharron de pollo, chiccarron de calamares, lomo or de pollo saltado, mar y Tierra, pescado al ajo, en salada mixta and sopa a la criolla.  ", "All dishes are tasty and exploding with flavor.  ", "My girls are super picky eaters, but not here!  ", "My oldest daughter says this is her favorite restaurant.  ", "The owner, Carlos and his staff are a class act!   ", "They treat you like family!"], "author": "Nate C.", "review": "This review is long overdue.  I've been going to this restaurant for over 20 years.  This is my family's favorite Peruvian restaurant.  We love the chicharron de pollo, chiccarron de calamares, lomo or de pollo saltado, mar y Tierra, pescado al ajo, en salada mixta and sopa a la criolla.  All dishes are tasty and exploding with flavor.  My girls are super picky eaters, but not here!  My oldest daughter says this is her favorite restaurant.  The owner, Carlos and his staff are a class act!   They treat you like family!", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["CHICHARRON DE POLLO ($9.95):\nhttp://bit.ly/1CsN8nX\n", "Menu said \"breaded pieces of deep fried chicken served with fresh lemon juice and spices.", "\"\n", "- We got drummettes (I counted 6 or 7) that were unseasoned and rather small for $10. ", "I was expecting something more like the entire fried chicken from Limon. \n", "- The dipping sauce was basically lemon juice dusted w/salt and pepper. "], "author": "Cin T.", "review": "My friend considers this place his favorite for Peruvian cuisine. Limon is a favorite of mine, but I decided to give this place a shot since he spoke so highly of it.\n\nWe didn't get the usual complimentary bread with butter and salsa de rocoto (hot pepper sauce) like everyone else. Maybe they ran out?\n\nInstead we got their spicy salsa and a handful of CANCHA http://bit.ly/16I8yDf.\nThese toasted corn kernals are usually served alongside ceviche, but it's also great for snacking by itself. \n- It's hollow so they shatter in your mouth, rather then crunching. I can see why these tasty corn nuts are popular in Peru. They're quite addictive.\n\nCEVICHE DE MARISCOS ($16.95): \nhttp://bit.ly/1AOpUrq\nSoft red snapper, mussels, calamari, and prawns are marinated with fresh lime juice. \n- The fork-tender pieces of sweet daikon and carrots were a nice balance to the acidic citrus juice. There was even a nice sprinkling of that cancha, yum! \nI would definitely order this again.\n\nLOMO SALTADO ($14.95): \nhttp://bit.ly/1JH2f1S\nLean strips of beef sauteed w/onions, french fries and tomatoes. It was okay. Not as flavorful and sauced up like the one I had at Limon's.\n\nBISTECK A LO POBRE ($16.95):\nhttp://bit.ly/13TQZz2\nA traditional dish consisting of a grilled steak accompanied by fried potatoes, sauteed onions, topped with a fried egg.\n- Instead of the fries, Mi Lindo Peru serves theirs with 2 small pieces of plantains. \n- Also the steak resembled a hamburger patty more than an actual steak, but it was nicely cooked and juicy. \n- The egg yolk and extra sauce from the pan jus makes this dish even more wonderful.\n\nCHICHARRON DE POLLO ($9.95):\nhttp://bit.ly/1CsN8nX\nMenu said \"breaded pieces of deep fried chicken served with fresh lemon juice and spices.\"\n- We got drummettes (I counted 6 or 7) that were unseasoned and rather small for $10. I was expecting something more like the entire fried chicken from Limon. \n- The dipping sauce was basically lemon juice dusted w/salt and pepper. Meh. \n\nOverall, a nice meal with friendly service. I'll probably revisit here when I'm back in town again.", "rating": 3, "date": "2014-12-22"}, {"excerpts": ["Chicharron de Pollo (http://www.yelp.com/biz_photos/1DDbE3XJF6lFL_KpU6Pmww?select=mkPnVGGbcIRUy1M7--rTtQ): ", "Breaded chicken served with lemon juice. ", "The chicken was so crunchy and juicy by itself. "], "author": "Marti L.", "review": "The only other Peruvian restaurant I've dined in was Fresca. But I consider Fresca to be more Californian than Peruvian, so technically Mi Lindo Peru was my first Peruvian experience.\n\nOn a random Tuesday night, a bunch of us decided to invade this small but vibrant restaurant. From the moment I set foot in this place, I knew it was going to be a good night. 30 minutes before our reservation, our table was already set to go. \n\nThank goodness we selected our dishes ahead of time. The menu was quite overwhelming given the number of choices. Each dish contained many ingredients so it was difficult to imagine the taste. But just know that you cannot go wrong with any dishes! The ingredients may seem simple, but every dish had such extraordinary flavors!\n\nCeviche Mixto (http://www.yelp.com/biz_photos/1DDbE3XJF6lFL_KpU6Pmww?select=k5tM7gWUOcTEywcOD6xzpg): If you love ceviche, then this one is a winner. Huge recognizable pieces of seafood soaked in a bath of fresh lime juice. The first bite definitely made me puckered, but oh so addicting!\n\nChicharron de Pollo (http://www.yelp.com/biz_photos/1DDbE3XJF6lFL_KpU6Pmww?select=mkPnVGGbcIRUy1M7--rTtQ): Breaded chicken served with lemon juice. The chicken was so crunchy and juicy by itself. Then with the lemon juice mixture, wow what a kick!\n\nPescado Sudado (http://www.yelp.com/biz_photos/1DDbE3XJF6lFL_KpU6Pmww?select=uUxLRSL6Ox3oM3z5P05pew): Steamed snapper fillet. Unfortunately I only saw this dish in passing, and didn't get to try it. But judging by how fast the snapper disappeared, I would say this was another successful dish!\n\nPescado Al Ajo (http://www.yelp.com/biz_photos/1DDbE3XJF6lFL_KpU6Pmww?select=V861Q92lwDwnC551aURxmQ): Fried butter and garlic snapper. This was the favorite of the night. And I believe it was because the flavorful thick crunchy crust was holding the most steamy and moist snapper inside. Oh la la!\n\nThe Saltado de Pollo (chicken strips) and Lomo Saltado (beef strips) were so good! Both sautéed with onions, tomatoes and french fries. Very hearty. Weird to have sautéed fries? Think of them as fried potatoes!\n\nArroz Con Pollo is a rice dish sautéed in cilantro sauces. Although the dish was green in color, it was not dominated by cilantro flavor. The sauce made the rice very fluffy! Yum!\n\nService was impeccable. I don't think the restaurant was used to handling a party of our size. But throughout the whole night, Carlos (owner manager) did not miss a step. We asked, he gave. We didn't ask, he still gave!\n\nCheers to a wonderful night of great food, great service and of course great company! =D", "rating": 5, "date": "2010-04-02"}, {"excerpts": ["**Appetizers:\nChicharron De Pollo - breaded piecesof chicken with lemon juice\nCeviche Mixto - assorted seafood in fresh lime juice\n\n", "The only dish that didn't win people over was chicharron de pollo which people said was dry. "], "author": "Daniel L.", "review": "From now on this place should be called Nuestro Muy Lindo Peru. Standing from the outside looking in, this small cozy restaurant embodies the spirit of \"fiesta familiar\" via its red and mango colored coordination from the inside out to which projects a vibrant atmosphere suitable for both intimate and festive occasions. This place has been sitting on my radar for the past year after having the privilege of dining at other great restaurants in the area. Finally I had the chance to co-sponsor a private UYE with prolific Yelper Marti L. that brought 30 Yelpers to break bread here, including a much appreciated appearance by Yelp co-founder, Russ S. and good friend and East Bay CM Ligaya T. \n\nI had the pleasure to reconnect with many Yelpers and met several Bay Area notables for the first time. This included Darryl P, Danny L, David B, Simone W, Jason G, Jonathan W, Karen Y, Michael M, Phillip W, Peter L, Hannah C, May C, Dorothy C and husband Peter, Rinky N and husband Mike, Stephanie J and her guest Linh, Tom R, Manabu M, Tammy C, Earl G and wife Joyce, Hen A, Marti L and boyfriend Sam, Russ S and Ligaya T.\n\nWe ordered a total of 22 dishes for a family style feast and had a lot of fun passing them around. To mention a few, we shared:\n\n***Appetizers:\nChicharron De Pollo - breaded piecesof chicken with lemon juice\nCeviche Mixto - assorted seafood in fresh lime juice\n\n***Main Entrees:\nSaltado De Pollo - lean strips of chicken sauteed w / onions, tomatoes & french fries\nLomo Saltado - lean strips of beef sauteed w/ onions, tomatoes & french fries\nPaella Marinera - saffron flavored spanish rice with seafood\nPescado Sudado - steamed snapper fillet topped w/ onions, tomatoes and potatoes\nArroz Con Pollo- chicken cooked with rice and green peas in cilantro sauce\nTamal De Pollo- steamed corn dough stuffed with chicken\nPescado Al Ajo- fried fillet topped with a butter-garlic sauce and a touch of white wine served with seasoned rice and sliced potato\nPlantains- fried bananas\n\n***Vegan Dishes (Special request):\nEnsalada Mixta--mixed greens with avocado, potatoes & tomatoes with a vinaigrette dressing\nSaltado De Vegetables - sauteed onions, celery, carrots, mushrooms, tomatoes & french fries served w/ seasoned rice\nPaella De Verduras - saffron flavored spanish rice with vegetables \n\nThroughout the dinner people were talking about how much they enjoyed the ceviche, pescado al ajo, and paella. Playing host, I didn't get to try all the dishes but thought the Arroz Con Pollo, Saltado De Pollo, Lomo Saltado, and Pescado Al Ajo were very good. The paella unfortunately didn't have the crispy texture but the flavor was still robust and a major highlight of the evening. The only dish that didn't win people over was chicharron de pollo which people said was dry. I also thought the tamal de pollo was decent. Portions were very generous.\n\nThe owner, Carlos, was the most pleasant and easy person to work with. I had the opportunity to work closely with him for a month to plan this event. The U-shaped table arrangement wasn't the easiest for everyone to intermingle, but it also gave us a nice open area for people to eventually get out of their seats and reach out to those they haven't seen in a while. Carlos was our server and was the most attentive, caring, and knowledgeable on which dishes were good for sharing; and was very effective in serving to the needs of our vegan friends. For a group of this size, he gave us the best service I've ever experienced to date. \n\nMy co-sponsor, Marti L, was instrumental in the success of this event and I can't thank her enough for the work she's done. Just to be clear to my readers, the restaurant did not have advanced knowledge that this was a Yelp event so the scores of affiliated reviews were reflective of how the restaurant normally operates. In the end everyone paid $12.10 per person, including tax and 20% tip. Weighing in on the price and value, this is by far the best tasting and most affordable private UYE I've organized to date.\n\nSince the event, people are still telling me that they are expecting to revisit Mi Lindo Peru on their own in the near future, which says a lot about their first rate culinary acumen, décor, price, portions, and service. I too, expect to return to this beautiful restaurant which I call Nuestro Muy Lindo Peru.\n\nI invite everyone to check out Philip W's review for the wonderful photos taken at the event.", "rating": 5, "date": "2010-03-26"}, {"excerpts": ["Must try:\n\nChicharron de pollo - fried chicken wings\n"], "author": "HY L.", "review": "Everything was delicious!  I love sharing family style with good friends.  Since we were celebrating a special get together, we brought a nice bottle of wine, surprisingly only $10 corkage fee.  I really love the quaint decor and friendly, attractive service.  I don't know if they are siblings, but they all have a unique international flavor.  If the mission street parking overwhelms you, you can pay $12 to park in the BOA lot, which is literally next door.   \n\nMust try:\n\nChicharron de pollo - fried chicken wings\nCeviche Mariscos (Mixte)\nAyacucho - beef skewer\nArroz con Pollo - chicken paella\nLomo Saltado - saute beef w fries\nPlantains with ice cream\n\nOne of my current crushes, and will definitely be back every chance I get.", "rating": 4, "date": "2010-08-01"}, {"excerpts": ["The Chicharron de pollo is always cooked perfectly and the sauce it comes with is sooo yummy.  "], "author": "MARJORIE S.", "review": "Love this place! Been coming here for years and I don't even live in SF.  The staff is very friendly and has great customer service.  The Chicharron de pollo is always cooked perfectly and the sauce it comes with is sooo yummy.  Other dishes you can't go wrong with are the Lomo Saltado, Papa a la Huancaina, and Ceviche de Mariscos.  Their bread is good too.  The restaurant itself isn't huge and it's popular so you may need to wait.  It's a nice place to have a casual gathering with a small group of friends.  I've been here also for a family celebration with kids and even though we were a larger group, the staff was just as nice.  Sometimes parking can be a challenge so be prepared to walk a few blocks.", "rating": 4, "date": "2014-09-18"}, {"excerpts": ["start w/ chicharron de pollo", ", lomo saltado a must or try the pescado al ajo..  order a side order of the plantains too..  ", "YUMMY..."], "author": "E. G.", "review": "Go early or you will have to wait... but its worth it!  start w/ chicharron de pollo, lomo saltado a must or try the pescado al ajo..  order a side order of the plantains too..  YUMMY...", "rating": 4, "date": "2008-05-14"}], "chicharron de calamares": [{"excerpts": ["CHICHARRON De CALAMARES ($8.95) - Fried squid serves with their house sauce. ", "the sauce is light pink and has that perfect dipping sauce thats not too powerful and not too light. ", "Also on the side is a pinch of vegetables that tasted like ceviche. ", "Thus far the best place I know in the bay area that knows how to serve up Calamari. "], "author": "Jane A.", "review": "ABSOLUTE HEAVEN - MY MOUTH IS SALIVATING!!!\n(5 stars and a meteor shower)\n\n**HIDDEN GEM ALERT**\n\nONE OF THE BEST PERUVIAN RESTAURANTS I've ever had... okay... maybe THE BEST. Great service, better then any fancy Peruvian Restaurants around the city. And the Chef comes out and serves the plates, definitely appreciate that.\n\n- FOOD, amazingly good\n- PRICES, affordable \n- SERVICE, impeccable\n- AMBIANCE, small mom and pop kind of spot\n\nPeruvian food is one of my favorite kinds of food. I've been to several Peruvian restaurants (upscale places) around the city and even gone to the Peruvian food festival that happens yearly. Surprised with myself that I have not discovered this HIDDEN GEM earlier!!! I've driven by this place a million times and have read reviews on yelp, finally had the chance to eat here. \n\nHEFFER-STYLE STATUS.\n\nBREAD (free) -  bread while you wait for your meal. Good fresh bread with a spread of butter but don't waste your appetite eating all the bread, your meal portions are big.\n\nPERUVIAN CORN (~$2) - If you never seen Peruvian corn, they are huge. Looks like their pulled each kernel off, fried them, and served it as a side. LOVE IT, always refer to these as \"Peruvian corn nuts\".\n\nCHICHARRON De CALAMARES ($8.95) - Fried squid serves with their house sauce. the sauce is light pink and has that perfect dipping sauce thats not too powerful and not too light. Also on the side is a pinch of vegetables that tasted like ceviche. Thus far the best place I know in the bay area that knows how to serve up Calamari. Damn good calamari.\n\nSALTADO De POLLO ($12.95) - Lean strips of  chicken sauteed with onions, tomato, and french fries also served with a side of their rice. their rice is NOT typical rice it has a really different taste to it. SO GOOD. And the description sound so simple but the flavors are amazing. If you had Lomo Saltado, you know exactly what i mean. This is the first place to have a chicken version of lomo saltado. absolute heaven!!! Well worth your money, get left overs, and the portions of the serving is ALOT.\n\nGAMBAS AL AJO ($15.95) - prawns sauteed in wine, butter, and garlic sauce served with rice. Same kind of rice as their serve with all their other dishes. The sauce on the prawns was droolicious and they give you good amount of prawns. Well worth your money.\n\nLUCUMA ICE CREAM (~$4) - topped the meal with some ice cream. OMG I love lucuma ice cream. Had it several times in the past at other restaurants and will order it again and again. It's orange and you'd think it tastes very fruity but its not like that. It's a subtle creamy light taste. My mouth is salivating.\n\nWill I be back? You don't have to ask me twice!!!!\n\nUntil the next review....", "rating": 5, "date": "2012-05-08"}, {"excerpts": ["Started with Chicharron De Calamares, which was a tad salty but dipping sauce was good.  ", "Our table had lomo saltado and gambas al ajo which was very tasty.  ", "But pescado frito was very fishy tasting and did not seem too fresh. ", "Won't order this next time.  ", "Friendly and efficient service."], "author": "Sashimi W.", "review": "Started with Chicharron De Calamares, which was a tad salty but dipping sauce was good.  Our table had lomo saltado and gambas al ajo which was very tasty.  But pescado frito was very fishy tasting and did not seem too fresh. Won't order this next time.  Friendly and efficient service.", "rating": 4, "date": "2017-01-21"}, {"excerpts": ["I was excited and we got the Chicharron De Calamares, Ceviche De Pescado, Empanadas, Chicharron Al Ajo, Lomo Saltado, Chupe De Camarones and Aji de Gallina. \n\n", "O Man Chicharron Al Ajo. ", "My favorite appetizer of the night. ", "The chicken was so tender and juicy. "], "author": "Reginald W.", "review": "If Limon Rotisserie is modern, then Mi Lindo Peru is as traditional as it gets. Run by mom and pops. I was excited and we got the Chicharron De Calamares, Ceviche De Pescado, Empanadas, Chicharron Al Ajo, Lomo Saltado, Chupe De Camarones and Aji de Gallina. \n\nThe Calamares was done right. The right amount of crispiness and not too overcooked. It was easy to eat and the sauce was a great compliment.\n\nThe Ceviche Pescado was overdone, perhaps it was let to sit in the marinade a bit too long as it was \"overcooked\" and it was a bit on the sour side.\n\nThe Empanadas were very large, but the flavor was lacking. It was a bit bland, but still good as the crust was light and flaky.\n\nO Man Chicharron Al Ajo. My favorite appetizer of the night. The chicken was so tender and juicy. The chicken fried just right and the garlic, O the garlic....so delicious that after the chicken was done I was scooping it up to eat with the garnish on the sides.\n\nThe Chupe de camarones was  delicious. It's hard to describe it but here goes. It was thick but leaned on the watery side of thick, the flavor was somewhat familiar but could not put a finger on it and the soup, i believe the soup also had rice in it as well as small and big shrimps and bits of meat.\n\nMy another two of my favorites from the night was the Lomo Saltado and Aji de Gallina. The Lomo saltado had so much flavor, the sauce was so delicious and went well with the fries and rice. My only complaint was that the beef was a little tough but its lean steak so its understandable. Still loved it. \n\nThe Aji de Gallina was very delicious as well and definitely reminded me of curry. But this was so much better than curry, the super hot sauce went so well with the yellow sauce.\n\nAnd everything we had went well with their Chicha Morada, their Chicha Morada is as good as it gets, homemade, what else could you ask for? I would suggest taking out the ice as it dilutes it quite a bit.\n\nIf I did not have their empanadas and their ceviche not as overdone, it would have gotten 4.5 stars.", "rating": 4, "date": "2012-11-18"}], "tamal de pollo": [{"excerpts": ["I also thought the tamal de pollo was decent. "], "author": "Daniel L.", "review": "From now on this place should be called Nuestro Muy Lindo Peru. Standing from the outside looking in, this small cozy restaurant embodies the spirit of \"fiesta familiar\" via its red and mango colored coordination from the inside out to which projects a vibrant atmosphere suitable for both intimate and festive occasions. This place has been sitting on my radar for the past year after having the privilege of dining at other great restaurants in the area. Finally I had the chance to co-sponsor a private UYE with prolific Yelper Marti L. that brought 30 Yelpers to break bread here, including a much appreciated appearance by Yelp co-founder, Russ S. and good friend and East Bay CM Ligaya T. \n\nI had the pleasure to reconnect with many Yelpers and met several Bay Area notables for the first time. This included Darryl P, Danny L, David B, Simone W, Jason G, Jonathan W, Karen Y, Michael M, Phillip W, Peter L, Hannah C, May C, Dorothy C and husband Peter, Rinky N and husband Mike, Stephanie J and her guest Linh, Tom R, Manabu M, Tammy C, Earl G and wife Joyce, Hen A, Marti L and boyfriend Sam, Russ S and Ligaya T.\n\nWe ordered a total of 22 dishes for a family style feast and had a lot of fun passing them around. To mention a few, we shared:\n\n***Appetizers:\nChicharron De Pollo - breaded piecesof chicken with lemon juice\nCeviche Mixto - assorted seafood in fresh lime juice\n\n***Main Entrees:\nSaltado De Pollo - lean strips of chicken sauteed w / onions, tomatoes & french fries\nLomo Saltado - lean strips of beef sauteed w/ onions, tomatoes & french fries\nPaella Marinera - saffron flavored spanish rice with seafood\nPescado Sudado - steamed snapper fillet topped w/ onions, tomatoes and potatoes\nArroz Con Pollo- chicken cooked with rice and green peas in cilantro sauce\nTamal De Pollo- steamed corn dough stuffed with chicken\nPescado Al Ajo- fried fillet topped with a butter-garlic sauce and a touch of white wine served with seasoned rice and sliced potato\nPlantains- fried bananas\n\n***Vegan Dishes (Special request):\nEnsalada Mixta--mixed greens with avocado, potatoes & tomatoes with a vinaigrette dressing\nSaltado De Vegetables - sauteed onions, celery, carrots, mushrooms, tomatoes & french fries served w/ seasoned rice\nPaella De Verduras - saffron flavored spanish rice with vegetables \n\nThroughout the dinner people were talking about how much they enjoyed the ceviche, pescado al ajo, and paella. Playing host, I didn't get to try all the dishes but thought the Arroz Con Pollo, Saltado De Pollo, Lomo Saltado, and Pescado Al Ajo were very good. The paella unfortunately didn't have the crispy texture but the flavor was still robust and a major highlight of the evening. The only dish that didn't win people over was chicharron de pollo which people said was dry. I also thought the tamal de pollo was decent. Portions were very generous.\n\nThe owner, Carlos, was the most pleasant and easy person to work with. I had the opportunity to work closely with him for a month to plan this event. The U-shaped table arrangement wasn't the easiest for everyone to intermingle, but it also gave us a nice open area for people to eventually get out of their seats and reach out to those they haven't seen in a while. Carlos was our server and was the most attentive, caring, and knowledgeable on which dishes were good for sharing; and was very effective in serving to the needs of our vegan friends. For a group of this size, he gave us the best service I've ever experienced to date. \n\nMy co-sponsor, Marti L, was instrumental in the success of this event and I can't thank her enough for the work she's done. Just to be clear to my readers, the restaurant did not have advanced knowledge that this was a Yelp event so the scores of affiliated reviews were reflective of how the restaurant normally operates. In the end everyone paid $12.10 per person, including tax and 20% tip. Weighing in on the price and value, this is by far the best tasting and most affordable private UYE I've organized to date.\n\nSince the event, people are still telling me that they are expecting to revisit Mi Lindo Peru on their own in the near future, which says a lot about their first rate culinary acumen, décor, price, portions, and service. I too, expect to return to this beautiful restaurant which I call Nuestro Muy Lindo Peru.\n\nI invite everyone to check out Philip W's review for the wonderful photos taken at the event.", "rating": 5, "date": "2010-03-26"}, {"excerpts": ["We also had the empenada, which was filed with meat, raisins, and olives, and the tamal de pollo, which was a lot of masa to a very meager amount of chicken. ", "However, it was thoroughly tasty. "], "author": "neil c.", "review": "A packed house around 7pm on a Friday night is usually a good sign - and it didn't fail me here! I have it on authority that this place is fairly authentic, and while I can't judge that, I can say that it is very delicious.\n\nWe had the ceviche de mariscos, a lovely mixture of seafood and acid, as our starter. We also had the empenada, which was filed with meat, raisins, and olives, and the tamal de pollo, which was a lot of masa to a very meager amount of chicken. However, it was thoroughly tasty. We also had the lomo saltado, which was quite delicious.\n\nWe also had the Sangria, which was quite delightful. The half liter seemed like an ample amount,  but it went down pretty quickly with the amount of food we had. The spiciness of it was just right, as well.\n\nThe staff is friendly, and helpful. I highly recommend coming here, but the caveat - be careful in at the two top nearest the door, If you are sitting faceing the winow, as I was, and there is a crowd of people waiting to be seated, like there was, you are liable to get butts on your shoulder, like I did.", "rating": 5, "date": "2008-05-09"}, {"excerpts": ["We shared the carne empanada, tamal de pollo, fried yucca with cheese sauce, plantains, and steak shish kabob. ", "We enjoyed everything, and the sangria was refreshing, but it wasn't great. ", "I left pretty satisfied, but Limon and Cha Cha Cha's were both better."], "author": "Krista M.", "review": "I really wanted to love this restaurant. There were immediate pluses: easy parking, pleasing decor, friendly staff, kid-friendliness (my daughter was given a cow-face shaped and decorated plate), and tasty looking menu with lots of choices. However, I wasn't blown away with the food. Nothing was bad. Everything tasted good. We shared the carne empanada, tamal de pollo, fried yucca with cheese sauce, plantains, and steak shish kabob. We enjoyed everything, and the sangria was refreshing, but it wasn't great. I left pretty satisfied, but Limon and Cha Cha Cha's were both better.", "rating": 3, "date": "2010-09-26"}], "champinones al ajillo": [{"excerpts": ["We ordered 3 items to share family style - Champinones Al Ajillo, Lomo Saltado and the Arroz con ", "Pollo (http://www.menupix.com/menudirectory/menu.php?id=100727).  ", "The mushrooms were tender and super garlicky, which I loved.  ", "The two main dishes were super yummy too, and we took leftovers home to enjoy once more after.  ", "I also loved their bread with the salsa.  ", "Not too spicy (cus ", "I'm a wuss, I admit it), the two were so good together, even more so once I added the mushrooms on top.  "], "author": "Lorrayne L.", "review": "Swing dancing to KMFDM and Sisters of Mercy, with a dollop of Morrisey thrown in.  Such pleasures in life are rare and few, but last night shone like a beacon in my small, super busy existence.  However, that's a story for another time.\n\nA girl's gotta eat substantially prior to a dizzying night of rock steps, twirls and tosses.  As such, C_ and I ventured to this establishment for some good Peruvian foods to sustain our pending boisterous activities.  This was my very first venture into this cuisine, and we couldn't have picked a better place for me to start.  It was heaven on the tongue.  Here's the 411 -\n\nDecor, I give 5 stars:  The restaurant is small and cozy; I would say there's seating for perhaps 30'ish peeps should the place be packed.  Last night was half-filled, a good sign on a chilly Tuesday night.  The lights were muted, which is something I adore, and the walls painted in happy ambience.  The ceiling sconces were delightful to look at, resembling clam shells or tortillas, however you wish to view them.  The only downside I would say is that the door was one of those double-swing doors that, if not closed properly, allowed the freezing outside in.\n\nFood, I give 5 stars:  We ordered 3 items to share family style - Champinones Al Ajillo, Lomo Saltado and the Arroz con Pollo (http://www.menupix.com/menudirectory/menu.php?id=100727).  The mushrooms were tender and super garlicky, which I loved.  The two main dishes were super yummy too, and we took leftovers home to enjoy once more after.  I also loved their bread with the salsa.  Not too spicy (cus I'm a wuss, I admit it), the two were so good together, even more so once I added the mushrooms on top.  I'm drooling thinking about it as I type.\n\nService, I give 5 stars:  Attentive, yet not obtrusive.  We didn't need to wait long for anything, and we were in and out right on schedule.\n\nPatronage:  Like I stated earlier, the place was half-full by the time we left, and of people of various ethnicities.  You'll feel right at home here.\n\nOverall, I truly enjoyed my first visit down the Peruvian lane.  This place is definitely a place I'd come back to.  Perhaps we'll see you there next time.", "rating": 5, "date": "2010-12-01"}, {"excerpts": ["We started off with the Champinones Al Ajillo (mushrooms sauteed in a garlic sauce) and the Ceviche (red snapper  marinated in fresh lime juice).  ", "Both were pretty substantial and both were delicious.  ", "I loved the mushrooms - the garlic sauce was authoritative without being overwhelming.  ", "The ceviche was just fantastic - so tangy and fresh... ", "the fried corn was a great touch and added some awesome crunch to the raw fresh fish.  ", "Very well executed dish!  "], "author": "Badri N.", "review": "A great evening and a fantastic dining experience.  Mi Lindo definitely lived up the the reviews I read here before venturing out to try it.\n\nIncidentally, I will actually be in Peru in exactly two weeks after eating here so this might be an awesome rehearsal for what's in store there :D\n\n[soapbox] OK... so it's in the Mission, ON Mission.  So be prepared for parking woes (we lucked out with two incredible spots) - and PLEASE, don't ding the restaurant because you couldn't find parking.  I hate when people do this - how is this even remotely in the restaurant's control??? [/soapbox]\n\nCharming little restaurant, full of food smells - so awesome and welcoming!  I think this place can accommodate about 40 people tops but it's still very spacious and you get a lot of privacy even with all the coziness.  I never felt encroached upon by fellow diners.\n\nNice ambiance and decor (check out the light fixtures that look like seashells).  And the most amazing staff - so friendly, patient and ever so attentive to detail...  I had mentioned earlier on that I was allergic to shellfish and the waiter (I think he was also the owner perhaps) remembered (more later)\n\nWe ordered a small carafe of the sangria which was really good and sweet, with apples primarily.  It's nothing to write home about but it was a good smooth drink to accompany the meal.  They also brought out some fresh bread with butter and some hot salsa which was really tasty.\n\nWe started off with the Champinones Al Ajillo (mushrooms sauteed in a garlic sauce) and the Ceviche (red snapper  marinated in fresh lime juice).  Both were pretty substantial and both were delicious.  I loved the mushrooms - the garlic sauce was authoritative without being overwhelming.  The ceviche was just fantastic - so tangy and fresh... the fried corn was a great touch and added some awesome crunch to the raw fresh fish.  Very well executed dish!  A definite repeat.\n\nFor the main course, we just ordered one thing - the highly recommended Pescado Al Ajo - we got it steamed - red snapper topped with butter garlic sauce & a touch of white wine.  A pretty substantial portion, easily enough for two, comes with rice, potatoes and a small piece of lettuce and some tomatoes.  It was also delicious, the fish flaking easily and chock full of flavor.  Large pods of garlic complemented the flavor of the garlic butter sauce - again, a dish I'd readily repeat.\n\nNever felt rushed during the almost two hours we were there.  Again, extremely helpful and friendly staff - such a delightful little place - I love places like these that seem \"family-run\" and that take such pride in their food and their service.  End result was a most enjoyable evening and a guaranteed repeat customer.\n\n~ 5 stars overall - now, I have to compare this with real Peruvian food - look for a possible review update if one is called for :)\n\n# 232", "rating": 5, "date": "2011-03-10"}], "gambas al la plancha": [], "yucca a la huancaina": [{"excerpts": ["Love the Yucca a la Huancaina appetizer! ", "mmm it was worth breaking out my lactaid for this dish.  "], "author": "Nicole P.", "review": "Maybe I'm just biased by my love for Peruvian food, but this place is  home-cooked goodness! Love the Yucca a la Huancaina appetizer! mmm it was worth breaking out my lactaid for this dish.  They also make a solid Lomo Saltado and ceviche de pescado.  The flan with the notes of orange and cloves is a perfect way to finish up a dinner here :)", "rating": 4, "date": "2011-04-28"}], "gambas al ajillo": [{"excerpts": ["The Gambas al Ajillo same!! ", "My daughter had the ají al Aji de Gallina which she enjoyed. ", "Our friend had the Lomo Saltado, also great!!!"], "author": "Adi A.", "review": "Undecided what to have for dinner, we found parking and walked out way here! Well we didn't regret it. Very, very nice and friendly service. Some of the best sangria I've had in a long time. The champiñones en ají were so good! The Gambas al Ajillo same!! My daughter had the ají al Aji de Gallina which she enjoyed. Our friend had the Lomo Saltado, also great!!!", "rating": 5, "date": "2018-09-16"}, {"excerpts": ["Gambas Al Ajillo (prawns sauteed in a garlic sauce) AND Saltado De Pollo (chicken sauteed w / onions, tomatoes & french fries) or Pescado Saltado(red "], "author": "nicole b.", "review": "My favorite restaurant in San Francisco.....\n\nI've been here numerous times.  I always order the same thing.  Gambas Al Ajillo (prawns sauteed in a garlic sauce) AND Saltado De Pollo (chicken sauteed w / onions, tomatoes & french fries) or Pescado Saltado(red snapper sauteed w/ onions, tomatoes,french fries).\n\nAND the sangria is sooooo Good. Two glasses & I'm feeling great :)\n\nThe service is superb.  Carlos is super duper extra cute & very pleasant and polite.  He always greets me when i come in & always sits me at my favorite table.\n\nIf you've never been here, what are you waiting on??.. GO!!!", "rating": 5, "date": "2011-06-09"}, {"excerpts": ["Gambas al ajillo - Garlic butter grilled shrimp\n3) Sopa Criolla - Creamy beef and light tomatoey soup\n4) "], "author": "Charlene C.", "review": "THe hubby had to work on Satuday from 8am-5pm, so when he got home, I fixed him a small dish of avocado and fresh chips. My baby was so tired. I wanted to give him a special dinner. So we sat in our home in san jose where I rubbed his feet and gave him a fresh iced tea. \n\nThen I thought of a great plan. I told the hubby to get in my car, and I made the 1 hour trek to San Francisco to the unknown.\n\nAs we arrived, I thought of my husband love for latin and spanish cuisine, and naturally i thought of Mi Lindo Peru.\n\nMy hubby has parking karma so I parked very carefully in a spot in front of a cafe in Bernal Heights and we made our way to Mi Lindo.\n\nThere was alot of people there, but we found a spot by the door. My hubby wanted me to order, so we both started off with the Inka Kola - Closely resembling a bottled strawberry soda. And he had the iced tea.\n\nFresh bread, their fabulous chunky red salsa and butter were served upon seating. \n\nI knew my hubby was famished since I fixed him a light lunch when he came home for lunch.\n\nSo I ordered \n1)  fried chicken appetizer with lemon juice\n2) Gambas al ajillo - Garlic butter grilled shrimp\n3) Sopa Criolla - Creamy beef and light tomatoey soup\n4) Arroz Con pollo for me\n5) Zarzuela - Seafood stew for him with rice\n\nThe fried chicken is lightly dusted with bread crumbs and lightly fried. The chicken was on the bone but was tender and delicious.\n\nThe Shrimp was for my husband and was fabulous. He inhaled the small dish provided it was soo good.\n\nThe soup has a wonderful creamy flavor with subtle spanish flavors and tid bits of beef floating in the soup. \n\nThe Zarzuela stew contained shrimp, mussels, calamir, clams, minced onions in a lovely saffron flavored and scented red broth. The flavors were mellow and well blended. It was served with white rice and corn.\n\nThe piece de resistance was my arroz on pollo. There were huge chunks of boneless dark and white meat chicken in a cilantro flavored rice frenzy with peas. It was well seasoned and so delicious. Slivers of red tender bell peppers melded deliciously with the rice. They gave such a huge portion that I had leftovers. \n\nThe service was very attentive. My hubby's iced tea and our waters were constantly refilled. The service was efficient, friendly and the food was magnificent. We will be back. Trust me.", "rating": 5, "date": "2010-04-19"}], "platanos frito": [], "beef anticuchos": [{"excerpts": ["To start, I ordered the Ceviche Mariscos (Mixte), Papas a la Huancaina, and the beef anticuchos.\n\n"], "author": "Adam C.", "review": "This past weekend, I took my girlfriend and a friend to Mi Lindo for their first Peruvian food experience.  Now, I am half Peruvian, so of course I believe I am an expert in this matter.\n\nWe were all really excited, Mi Lindo was to be my first Peruvian tasting on the west coast as well, and it seemed to be more authentic than the other restaurants that matched similar search queries.\n\nMy friends let me do all the ordering, and I knew exactly what we wanted.\n\nTwo Cusquenas (I prefer it over Cristal) and an Inka Cola.  (My girlfriend does not drink)  Inka Cola however, is my favorite soda, and I would like to mention that they have the real one, not the Ecuadorian version that has less flavor.\n\nTo start, I ordered the Ceviche Mariscos (Mixte), Papas a la Huancaina, and the beef anticuchos.\n\nThe Ceviche was top notch, great flavor, the best I've had in the US.\n\nThe Anticuchos, which are basically beef hearts on a stick, also had the exact flavor that I remembered from Peru.  Very tasty, very tender.\n\nThe Papas a la Huancaina were ok, My father makes the sauce much better.\n\nAt this point we order three Lomo Saltados, as it IS a dish descended from above, and decided we better order some more ceviche as well, it was just that good.\n\nOut came the Lomo Saltado, my dining mates ooh'd and awed, it was a perfect moment.\n\nOf course they loved it.  I however, was a little disappointed.  It didn't explode with flavor like I expected it too.  It seemed to be specifically missing a bit of lime and the aji amarillo.  Still very good, and we left the place barely able to walk.\n\nHighly Recommended.", "rating": 4, "date": "2008-11-16"}], "salchipapa": [], "papa rellena": [{"excerpts": ["The papa rellena is wonderful and crispy! "], "author": "Anna G.", "review": "Came here for the first time yesterday and was slightly let down because of the lack of seasoning in my aji de gallina. After some salt and pepper, the dish tasted great! Unfortunately I cannot say it is the best aji de gallina I've ever had- but definitely still yummy. Fluffy bread and tasty butter is given to you while you wait for your meal. The restaurant is fairly small so definitely call ahead to see if you can get a spot! For some reason there are not too many peruvian sit down options here in SF compared to Chicago... So when I found out about this place I definitely knew I had to try it! The papa rellena is wonderful and crispy! Also, their chicha morada is very delicious and I recommend to go ahead and order the 1 L jug when you sit down!\n\nOverall, a great experience. Very reasonable prices. Next time, I'll definitely try something else on their menu... Hopefully it will be properly seasoned!!", "rating": 4, "date": "2013-11-18"}, {"excerpts": ["I do like their papa rellena. ", "They also use instant chicha morada which is a lot like drinking instant iced tea.  ", "Blea.  ", "The service is middle of the road and the bathrooms are pretty nasty.  ", "Cleanliness in general could be better.  ", "Like everything in SF it's parking jihad.  ", "Be prepared to walk 2-3 blocks and feed the parking meters."], "author": "Bobby K.", "review": "I have been here a few times with my wife and her sisters because it's close to their house and usually has seating available for walk ins.  It's got all of the makings of a good hole in the wall place but without the awesome tasting food.  It's an old and small storefront building in SF.  It's also reasonably priced.\n\nWe usually find their food somewhat bland and overly greasy.  I do like their papa rellena. They also use instant chicha morada which is a lot like drinking instant iced tea.  Blea.  The service is middle of the road and the bathrooms are pretty nasty.  Cleanliness in general could be better.  Like everything in SF it's parking jihad.  Be prepared to walk 2-3 blocks and feed the parking meters.", "rating": 2, "date": "2008-12-14"}], "ceviche de pescado": [{"excerpts": ["I was excited and we got the Chicharron De Calamares, Ceviche De Pescado, Empanadas, Chicharron Al Ajo, Lomo Saltado, Chupe De Camarones and Aji de Gallina. \n\n", "O Man Chicharron Al Ajo. ", "My favorite appetizer of the night. ", "The chicken was so tender and juicy. "], "author": "Reginald W.", "review": "If Limon Rotisserie is modern, then Mi Lindo Peru is as traditional as it gets. Run by mom and pops. I was excited and we got the Chicharron De Calamares, Ceviche De Pescado, Empanadas, Chicharron Al Ajo, Lomo Saltado, Chupe De Camarones and Aji de Gallina. \n\nThe Calamares was done right. The right amount of crispiness and not too overcooked. It was easy to eat and the sauce was a great compliment.\n\nThe Ceviche Pescado was overdone, perhaps it was let to sit in the marinade a bit too long as it was \"overcooked\" and it was a bit on the sour side.\n\nThe Empanadas were very large, but the flavor was lacking. It was a bit bland, but still good as the crust was light and flaky.\n\nO Man Chicharron Al Ajo. My favorite appetizer of the night. The chicken was so tender and juicy. The chicken fried just right and the garlic, O the garlic....so delicious that after the chicken was done I was scooping it up to eat with the garnish on the sides.\n\nThe Chupe de camarones was  delicious. It's hard to describe it but here goes. It was thick but leaned on the watery side of thick, the flavor was somewhat familiar but could not put a finger on it and the soup, i believe the soup also had rice in it as well as small and big shrimps and bits of meat.\n\nMy another two of my favorites from the night was the Lomo Saltado and Aji de Gallina. The Lomo saltado had so much flavor, the sauce was so delicious and went well with the fries and rice. My only complaint was that the beef was a little tough but its lean steak so its understandable. Still loved it. \n\nThe Aji de Gallina was very delicious as well and definitely reminded me of curry. But this was so much better than curry, the super hot sauce went so well with the yellow sauce.\n\nAnd everything we had went well with their Chicha Morada, their Chicha Morada is as good as it gets, homemade, what else could you ask for? I would suggest taking out the ice as it dilutes it quite a bit.\n\nIf I did not have their empanadas and their ceviche not as overdone, it would have gotten 4.5 stars.", "rating": 4, "date": "2012-11-18"}, {"excerpts": ["We ordered the ceviche de pescado (red snapper with lime juice) and the cangrejo con alcachofas (baked artichoke hearts, crab, and cheese served with crackers). "], "author": "Stephanie C.", "review": "It had been awhile since I had eaten at Mi Lindo Peru, so I suggested it to my boyfriend, and we had an amazing dinner. It really reminded me of why I missed eating here so much!\n\nI normally just order a main dish from here, but tonight we decided to get some appetizers. We ordered the ceviche de pescado (red snapper with lime juice) and the cangrejo con alcachofas (baked artichoke hearts, crab, and cheese served with crackers). Both were amazing, but the ceviche definitely stood out for us. \n\nFor main dishes I ordered the lomo saltado, which was as amazing and delicious as I remembered it, and my boyfriend ordered the arroz con pollo, which he loved and COMPLETELY devoured. I, of course, had to take home the leftovers ;) lomo is so good the next day!\n\nThere was just enough room for dessert, so we had the platanos fritos con helado (fried plantain with ice cream). SO yummy and just a perfect end to an amazingly delicious meal.", "rating": 5, "date": "2011-03-10"}, {"excerpts": ["They also make a solid Lomo Saltado and ceviche de pescado.  ", "The flan with the notes of orange and cloves is a perfect way to finish up a dinner here :)"], "author": "Nicole P.", "review": "Maybe I'm just biased by my love for Peruvian food, but this place is  home-cooked goodness! Love the Yucca a la Huancaina appetizer! mmm it was worth breaking out my lactaid for this dish.  They also make a solid Lomo Saltado and ceviche de pescado.  The flan with the notes of orange and cloves is a perfect way to finish up a dinner here :)", "rating": 4, "date": "2011-04-28"}, {"excerpts": ["Now let's hear to what my reviewers, \"The Ambiguously Garcia Duo\" have to say:\n\nMLP's 'ceviche de pescado' is simply drenched in splendor and the fish is so delicious, we wanted to get naked and rub it all over us, but that is just to get you going. "], "author": "Jesus G.", "review": "Hello and Welcome to the Francisco Pizarro show,\n\nTonight, my amigos y cristianos, I proudly announce that after many expeditions to find \"El Dorado's Lomo Saltado\" it has been found by me, \"el gran conquistador\". I always knew that Ponce de Leon and Hernan Cortez had nothing on me and Mi Lindo Peru is my crowning achievement in discoveries!\n\nI have gone up and down, Destino, Fresca at Fillmore, and an arrogant Essencia. Mi Lindo Peru takes them all and shows them how Peruvian is done. Now let's hear to what my reviewers, \"The Ambiguously Garcia Duo\" have to say:\n\nMLP's 'ceviche de pescado' is simply drenched in splendor and the fish is so delicious, we wanted to get naked and rub it all over us, but that is just to get you going. We must also squirm in such delightful maritime wetness with a nice sangria and why not, an Inca Kola. However, just when you think you had the best girl / guy in the ceremonial Machu Picchu orgy, the stunning Lomo shows up and things get interesting. The way they make their food is REAL, is how it is done. If you are a 'health nut' or a hippie vegan or a 'had sex with a spanish girl/guy so i know all about spanish culture now' person...walk away, go to Destino, while very good, it is safe for 'your kind'... *wink*. It feels very folkloric in here, which is a good thing. You hear real spanish people, NOT any of the:\n\n\"Well, Jen, during my last trip to Peru and feel the real people, I perceived a sense of impoverishment that inspired me, their struggle permeated my thoughts  so much, that on my first-class trip back I was looking at some pictures I took with my iPhone of some real indigenous people. I have them on my new hi-def display at home...you should come over\"\n\n\"Oh sure Bob, you are sooo cultured, I want to have sex with you over the llama skin your purchased\"\n\nNo, no pretentious pompous people here! This is heaven for us!!!! Also, make room for the flan. It's probably one of the best in the city. We have to admit, we need a couple of more rounds to Fresca and Destino (hit or miss place sometimes).\n\nThis is authentic, very very good sizable portions, great service! Absolutely love it and the price is just simply excellent. It is very very cheap, not like Essencia's faux  and overpriced peruvian", "rating": 4, "date": "2008-09-01"}, {"excerpts": ["Try the ceviche de pescado or the crab dip. ", "Also, my favorite is their home-made sangria (which you'll like if you're a fan of a sweeter version than usual). "], "author": "Tai M.", "review": "This hole in the wall is a little gem in the rough. Not ever having tried Peruvian food before, my friend took me to Mi Lindo Peru a couple years ago and it's now one of my favorite restaurants in the city. \n\nThe food is sooo good. Try the ceviche de pescado or the crab dip. Also, my favorite is their home-made sangria (which you'll like if you're a fan of a sweeter version than usual). Every friend I've eaten with there has agreed that they were satisfied with the food. \n\nThe service is not bad for a family owned and operated restaurant, they're pretty fast and the waiter even speaks to you in a little Spanish then translates to English. I like it so I can also practice. \n\nThe atmosphere is cozy and both families and hipsters seem to feel at home!", "rating": 5, "date": "2009-03-18"}, {"excerpts": ["Our mates had already ordered some Ceviche de Pescado, which was very tasty, with a tad of lemony sour kick to it.  ", "The bread on the table sated any hunger pains that might be due to eating as late as 8.  ", "The fried plantains were nice.  ", "I ordered the Lomo Saltado (salted strips of steak cooked with tomatoes, onions, french fries and served with rice).  ", "I have to say, I didn't know this was what Peruvian food was about.  ", "It was sorta like Chinese or Vietnamese rice plates, but cooked differently.  ", "The Lomo was delicious - I finished every single bite.  ", "There happened to be a serendipitously appropriate ratio of rice to entree in every bite.  ", "The slices of meat were chosen selectly and cooked to a juicy tenderness.  ", "Only $12.  ", "Len had the Lomo a lo pobre - ", "that looked like an excellent choice as well, topped with an egg cooked overeasy.  "], "author": "Gerald C.", "review": "\"Hey, we're going to some peruvian place.  But if you wanna go, we're leaving now.\"  I hopped out of bed and put on some clothes I wore yesterday (glad no one noticed), and dashed to the car.  It was raining outside, so I had to grab my jacket.  Found that Wong would be driving us in his Jetta.  I offered to drive, but he really wanted to drive.  And he needed to get gas.  So, we conceded.  Along the way, my brother realizes we have to pick up Mike as well.  Hmm, we'll have to pack some of this stuff in the back seat in the car, but, no problem.  Then, we miss the Avalon Dr. exit, which is the one to take to get  cheap gas on Westborough.  Oh well, guess we'll just fill up at the Hickey exit.  We get gas, then drive over to Mike's.  By now, Len, Lars, and Yian have already gotten a table at Mi Lindo's.  Doh!  So we're already 20 minutes late.  Then at Mike's, Fran enters the car... err, where's Mike?  He pops in a minute later.  Crap... 5 people in a Jetta.  Not comfortable, to say the least.  Oh well... note to self: don't let Wong drive next time.  \n\nFortunately, we get there in pretty good time, not too much traffic up to the Cesar Chavez exit, and lucked out on some street parking just 2 blocks away.\n\nFirst thing I thought as I entered the place was: wow, this place is tinier than I thought.  Fortunately, it wasn't very crowded at 8pm on that rainy Saturday night.  Our mates had already ordered some Ceviche de Pescado, which was very tasty, with a tad of lemony sour kick to it.  The bread on the table sated any hunger pains that might be due to eating as late as 8.  The fried plantains were nice.  I ordered the Lomo Saltado (salted strips of steak cooked with tomatoes, onions, french fries and served with rice).  I have to say, I didn't know this was what Peruvian food was about.  It was sorta like Chinese or Vietnamese rice plates, but cooked differently.  The Lomo was delicious - I finished every single bite.  There happened to be a serendipitously appropriate ratio of rice to entree in every bite.  The slices of meat were chosen selectly and cooked to a juicy tenderness.  Only $12.  Len had the Lomo a lo pobre - that looked like an excellent choice as well, topped with an egg cooked overeasy.  Yian ordered the green fried rice - green from a barely detectable silantro sauce, but oh-so-gobbleable.\n\nAlso had the flan, but I found it a bit thick for my taste.  I might try their special ice cream next time (yes, I will be back!).  In fact, I really hope to return, I found the food very unpretentious and satisfying - ie, most excellent grub!  4 stars ****\n\nPS, luckily for the group, Larry's car could take another, so we could split up our full selves 4 to a car (instead of 5), and so the ride back was much less cramped.  What a relief.", "rating": 4, "date": "2007-02-11"}, {"excerpts": ["The ceviche de pescado was tart and spicy. ", "The meat was perfect in the lomo saltado. ", "The service was friendly. ", "My only complaint is that they were out of the empanadas and don't appear to have aji de gallina on the menu at all."], "author": "Trick S.", "review": "The food was great and the beer was ice cold. The ceviche de pescado was tart and spicy. The meat was perfect in the lomo saltado. The service was friendly. My only complaint is that they were out of the empanadas and don't appear to have aji de gallina on the menu at all.", "rating": 4, "date": "2009-07-28"}], "ceviche de mariscos": [{"excerpts": ["we're both amazing as well as the ceviche de mariscos. ", "Service was great and felt really at home here. ", "Will 100% Be returning and soon."], "author": "Matthew C.", "review": "Wow. Finally went to Mi Lindo Peru after being recommended this restaurant sometime ago. Definitely lived up to expectations. The lomo saltado and camarones saltado we're both amazing as well as the ceviche de mariscos. Service was great and felt really at home here. Will 100% Be returning and soon.", "rating": 5, "date": "2018-06-10"}, {"excerpts": ["CEVICHE DE MARISCOS ($16.95): \n", "http://bit.ly/1AOpUrq\n", "Soft red snapper, mussels, calamari, and prawns are marinated with fresh lime juice. \n", "- The fork-tender pieces of sweet daikon and carrots were a nice balance to the acidic citrus juice. ", "There was even a nice sprinkling of that cancha, yum! \n"], "author": "Cin T.", "review": "My friend considers this place his favorite for Peruvian cuisine. Limon is a favorite of mine, but I decided to give this place a shot since he spoke so highly of it.\n\nWe didn't get the usual complimentary bread with butter and salsa de rocoto (hot pepper sauce) like everyone else. Maybe they ran out?\n\nInstead we got their spicy salsa and a handful of CANCHA http://bit.ly/16I8yDf.\nThese toasted corn kernals are usually served alongside ceviche, but it's also great for snacking by itself. \n- It's hollow so they shatter in your mouth, rather then crunching. I can see why these tasty corn nuts are popular in Peru. They're quite addictive.\n\nCEVICHE DE MARISCOS ($16.95): \nhttp://bit.ly/1AOpUrq\nSoft red snapper, mussels, calamari, and prawns are marinated with fresh lime juice. \n- The fork-tender pieces of sweet daikon and carrots were a nice balance to the acidic citrus juice. There was even a nice sprinkling of that cancha, yum! \nI would definitely order this again.\n\nLOMO SALTADO ($14.95): \nhttp://bit.ly/1JH2f1S\nLean strips of beef sauteed w/onions, french fries and tomatoes. It was okay. Not as flavorful and sauced up like the one I had at Limon's.\n\nBISTECK A LO POBRE ($16.95):\nhttp://bit.ly/13TQZz2\nA traditional dish consisting of a grilled steak accompanied by fried potatoes, sauteed onions, topped with a fried egg.\n- Instead of the fries, Mi Lindo Peru serves theirs with 2 small pieces of plantains. \n- Also the steak resembled a hamburger patty more than an actual steak, but it was nicely cooked and juicy. \n- The egg yolk and extra sauce from the pan jus makes this dish even more wonderful.\n\nCHICHARRON DE POLLO ($9.95):\nhttp://bit.ly/1CsN8nX\nMenu said \"breaded pieces of deep fried chicken served with fresh lemon juice and spices.\"\n- We got drummettes (I counted 6 or 7) that were unseasoned and rather small for $10. I was expecting something more like the entire fried chicken from Limon. \n- The dipping sauce was basically lemon juice dusted w/salt and pepper. Meh. \n\nOverall, a nice meal with friendly service. I'll probably revisit here when I'm back in town again.", "rating": 3, "date": "2014-12-22"}, {"excerpts": ["We ordered ceviche de mariscos, lomo saltado, and gambas al ajo. ", "All of our dishes were rather tasty but did have some things to nitpick about. \n", "First off, they served us bread with butter and salsa. ", "We were expecting tortilla chips and it totally did not happen. ", "But we love carbs "], "author": "Christine G.", "review": "Came here recently with a friend around 7pm and was able to find street parking near the restaurant. Our waiter was very polite and patient with us while we browsed the menu while casually sipping on a liter of sangria, LOL. Which by the way, is probably the best sangria I've ever had. A liter is totally OK for two people to share if you're wondering. We ordered ceviche de mariscos, lomo saltado, and gambas al ajo. All of our dishes were rather tasty but did have some things to nitpick about. \nFirst off, they served us bread with butter and salsa. We were expecting tortilla chips and it totally did not happen. But we love carbs so we ate the bread anyways haha. \n\nCeviche de Mariscos- Very generous portions of red snapper, squid, shrimp, red onion, and mussels. The only thing we did not enjoy was the mussels. I don't think the lemon/lime meshes well with cooking the mussel, it was very rough and not very appetizing. \n\nLomo Saltado- Just delicious. The sliced beef, onions, peppers, and french fries paired well together. The flavor of the meat was on point. Just wish they didn't cook the meat for so long, as it was rather tough.\n\nGambas al ajo- Anytime you put excessive amounts of garlic on anything, it is bound to be delicious. Lots of garlic on shrimp?! exxtra delicious! Shrimp was not overcooked at all and they give you a generous amount of shrimp too, which is always a plus. \n\nWill most definitely be back sometime in the near future to try more foodz and drink more liters of Sangria!", "rating": 4, "date": "2014-06-29"}, {"excerpts": ["I couldn't get seafood off my mind, so we ordered the Ceviche de Mariscos to start. ", "http://goo.gl/BSahk "], "author": "Rebekah T.", "review": "There are two things that I am totally addicted to, Latin food and Seafood. I am a huge fan of peruvian food and will often go out of my way to get it. Lucky me, that it was suggested that we go to Mi Lindo Peru to celebrate a night out for my friend Mariela. \n\nWe got there early and secured a table. It's harder than you realize, so don't just try and show up at dinner time with your party of six and expect it to be empty. You take your chances and luckily we scored.\n\nWe ordered the Sangria, which in itself is dangerous if you are sipping while waiting for friends. Before we knew it, we polished off a carafe and wanted another. http://goo.gl/Rs7cc\n\nI was all about the MARISCOS and we were all set to have a seafood extravaganza dinner. \n\nI couldn't get seafood off my mind, so we ordered the Ceviche de Mariscos to start. http://goo.gl/BSahk It was a great portion for two and really flavorful. \n\nNext up, I ordered the Picante de Mariscos, because if there is anything I love more with my latin seafood dishes - it's spicy food. http://goo.gl/oobdZ Mariela ordered the Parihuela, a seafood soup in a rich flavored base. Makes my mouth water just thinking about it. http://goo.gl/FxL7B We both shared the dishes so we could try everything. \n\nEverything was amazing and the service was great. I really enjoyed the seafood dishes and will come back for more, because this place has great flavor.", "rating": 4, "date": "2012-08-29"}, {"excerpts": ["ceviche de mariscos: red snapper, calimari, mussel, and prawns in fresh lime juice, soft yam, with kernels for a crunch.\n\n"], "author": "Ty T.", "review": "Pros:\n-Que me hablaran en español porque miro Peruano (chifa). My ethnic identity has been questioned a few times while dining here, and Spanish has been spoken to me more times than I feel comfortable to try to respond with my Spanglish. But even though after a few seconds later they realize I am only Asian-American, and not Latino the tone and service is still generally positive and friendly.\n\n1. all the house-made sauces are delicious, I particularly enjoy the habanera spread for the bread.. it offers just the right amount of spice for all the cooling seafood dishes I crave so much while dining here.\n2. fresh paella marinea, simmered with rice in a saffron sauce with sherry wine is nice and comforting.\n3. ceviche de mariscos: red snapper, calimari, mussel, and prawns in fresh lime juice, soft yam, with kernels for a crunch.\n\nCons:\nSometimes this place feels a bit slow when it is really busy and packed, I can't fathom why there are couples taking up 4 seats all throughout the restaurant sometimes, when the tables could easily be pulled apart to accommodate everyone else waiting out the door. It can get unbearably loud sometimes, because the room reverberates noise in all directions. And the silverware looks thrifted and wouldn't hurt to get a fresh polish.", "rating": 4, "date": "2012-10-23"}, {"excerpts": ["We ordered the Ceviche de Mariscos, Saltado de Pollo and the Pescado al Ajo and each dish was delicious and so flavorful!!!  ", "I came here once before, about 7yrs ago and haven't been back since until just recently ", "and I was happy that it was still as good as I had remembered.  ", "The servers were pleasant during our time there and the portions for all of the dishes that we had ordered were more than sufficient to share between the three of us."], "author": "Kahanalei M.", "review": "We ordered the Ceviche de Mariscos, Saltado de Pollo and the Pescado al Ajo and each dish was delicious and so flavorful!!!  I came here once before, about 7yrs ago and haven't been back since until just recently and I was happy that it was still as good as I had remembered.  The servers were pleasant during our time there and the portions for all of the dishes that we had ordered were more than sufficient to share between the three of us.", "rating": 5, "date": "2011-08-20"}, {"excerpts": ["We ended up ordering three dishes: Ceviche de Mariscos, Saltado de Pollo, and the Pescado al Ajo.\n\n", "Ceviche de Mariscos: "], "author": "K. E.", "review": "I had been wanting to eat Peruvian food for a while especially since I made a new friend whose from Peru. With my luck, Kahanalei M'. wanted to come here to celebrate her birthday. We ended up ordering three dishes: Ceviche de Mariscos, Saltado de Pollo, and the Pescado al Ajo.\n\nCeviche de Mariscos: Cold Snapper fish with prawns, calamari, and onion in a lime sauce.\n\nSaltado de Pollo: Stir-fry chicken with vegetables and rice.\n\nPescado al Ajo: Steamed or fried snapper fish with garlic, butter, and white wine sauce with rice. \n\nI'm glad I tried all three dishes but my ultimate favorite was the pescado al ajo because it was extremely flavorful and garlicky, which I love. I also liked the saltado de pollo because it reminded me of a dish my grandma would've made. It had that very hearty homemade taste, but what do I know? \n\nThe waiters were very attentive when it came to refilling our water glasses - my glass never went dry. They were also very pleasant and didn't mind our extended stay. \n\nI will definitely come back for the pescado al ajo!", "rating": 5, "date": "2011-08-25"}, {"excerpts": ["For food, we tried the ceviche de mariscos and the garlic fried fish with fries! ", "They served complimentary french bread with whipped butter and spicy salsa! ", "I'm definitely coming back here again and try something different!"], "author": "Mika D.", "review": "This place is good; came here with a friend and we started off with a half liter of sangrias. \n\nFor food, we tried the ceviche de mariscos and the garlic fried fish with fries! They served complimentary french bread with whipped butter and spicy salsa! I'm definitely coming back here again and try something different!", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["Other dishes you can't go wrong with are the Lomo Saltado, Papa a la Huancaina, and Ceviche de Mariscos.  ", "Their bread is good too.  ", "The restaurant itself isn't huge and it's popular ", "so you may need to wait.  ", "It's a nice place to have a casual gathering with a small group of friends.  ", "I've been here also for a family celebration with kids and even though we were a larger group, the staff was just as nice.  ", "Sometimes parking can be a challenge so be prepared to walk a few blocks."], "author": "MARJORIE S.", "review": "Love this place! Been coming here for years and I don't even live in SF.  The staff is very friendly and has great customer service.  The Chicharron de pollo is always cooked perfectly and the sauce it comes with is sooo yummy.  Other dishes you can't go wrong with are the Lomo Saltado, Papa a la Huancaina, and Ceviche de Mariscos.  Their bread is good too.  The restaurant itself isn't huge and it's popular so you may need to wait.  It's a nice place to have a casual gathering with a small group of friends.  I've been here also for a family celebration with kids and even though we were a larger group, the staff was just as nice.  Sometimes parking can be a challenge so be prepared to walk a few blocks.", "rating": 4, "date": "2014-09-18"}, {"excerpts": ["My table also started with the ceviche de mariscos, yucca, and empanada appetizers.  ", "Make sure you order the yucca and empanada.  ", "They are only about $6, but well worth every cent.  ", "The yucca comes with a cheese sauce that we ended up dipping the free bread into.  ", "Delicious.  "], "author": "JP T.", "review": "Mi Lindo Peru is legit.  Came here last Saturday for my birthday dinner with about $7 friends and all of us left satisfied with what we ordered.  I went with the lomo saltado and it was extremely well prepared.  I've had better flavored lomo saltado before, but the crispiness of the fries and searing of the beef was much better here.  \n\nMy table also started with the ceviche de mariscos, yucca, and empanada appetizers.  Make sure you order the yucca and empanada.  They are only about $6, but well worth every cent.  The yucca comes with a cheese sauce that we ended up dipping the free bread into.  Delicious.  Empanadas sell out, so if you end up doing a late dinner, you may be SOL.  \n\nParking is a MF'ing pain here!  We drove around for about 20 minutes without much luck before finally giving in to the $12 lot next to the restaurant.  SMH.  Ridiculous.  Carpool if you can, I know that I will on my next visit here.", "rating": 4, "date": "2010-09-14"}, {"excerpts": ["We had the ceviche de mariscos, a lovely mixture of seafood and acid, as our starter. "], "author": "neil c.", "review": "A packed house around 7pm on a Friday night is usually a good sign - and it didn't fail me here! I have it on authority that this place is fairly authentic, and while I can't judge that, I can say that it is very delicious.\n\nWe had the ceviche de mariscos, a lovely mixture of seafood and acid, as our starter. We also had the empenada, which was filed with meat, raisins, and olives, and the tamal de pollo, which was a lot of masa to a very meager amount of chicken. However, it was thoroughly tasty. We also had the lomo saltado, which was quite delicious.\n\nWe also had the Sangria, which was quite delightful. The half liter seemed like an ample amount,  but it went down pretty quickly with the amount of food we had. The spiciness of it was just right, as well.\n\nThe staff is friendly, and helpful. I highly recommend coming here, but the caveat - be careful in at the two top nearest the door, If you are sitting faceing the winow, as I was, and there is a crowd of people waiting to be seated, like there was, you are liable to get butts on your shoulder, like I did.", "rating": 5, "date": "2008-05-09"}, {"excerpts": ["The ceviche de mariscos was delicious.\n\n"], "author": "B S.", "review": "I went there after reading some good reviews on Yelp -thanks everyone! My friends and I had a great meal. We started with the yummy sangria (some of the best I've had). The ceviche de mariscos was delicious.\n\nThe lomo saltado was fantastic. The only less than stellar dish was the arroz con pollo. It was surprisingly bland and I'm not one for salt.\n\nOverall, a great meal that I would definitely recommend.", "rating": 4, "date": "2008-12-02"}], "papa ala huancaina": [], "choros a la criolla": [], "causa de pollo": [{"excerpts": ["Great taste, more like home style food, good service, but they can improve a little bit, first causa de pollo, the chicken with a touch of celery and ", "the home Mayo was really tasty, but the mashed potato wasn't bad but the texture is no the proper, the lomo saltado was really tasty ", "but like a said is more like home style, ", "no like restaurant with the little smoky flavor, third the jalea was ok but the golf sauce made this dish great, the chicha morada was ok."], "author": "Mauricio A.", "review": "Great taste, more like home style food, good service, but they can improve a little bit, first causa de pollo, the chicken with a touch of celery and the home Mayo was really tasty, but the mashed potato wasn't bad but the texture is no the proper, the lomo saltado was really tasty but like a said is more like home style, no like restaurant with the little smoky flavor, third the jalea was ok but the golf sauce made this dish great, the chicha morada was ok.", "rating": 3, "date": "2017-10-19"}, {"excerpts": ["Causa de Pollo for an appetizer is a must try. \n\n"], "author": "Gerardo M.", "review": "Great Peruvian restaurant!\n\nService was great.\n\nThe food was awesome!\n\nCausa de Pollo for an appetizer is a must try. \n\nI ordered the Tallarin Saltado de Pollo with green salsa.. Tasted delicious.", "rating": 4, "date": "2015-11-12"}, {"excerpts": ["We, again, got the Gambos al Ajillo, tried the Causa de Pollo (mashed potato stuffed chicken salad) which was quite yummy & of course, got 2 orders of Aji de Gallina (1 to eat & 1 to take home). "], "author": "John M.", "review": "After my first ever, albeit limited, foray into Peruvian food & drink, the girlfriend thought it would be a good time to expand this horizon some more. She proposed dinner at one of her favorite Peruvian (or any other cuisine, for that matter) places & exalted the flavors to be found there. Intrigued by the praises, I was game. So we were off & away from the tourist-y Piers to Bernal Heights . Mi Lindo Peru is itself as much a contrast to the loud, modern Peruvian bar we were just at as its neighborhood is to the Pier 1 1/2 location of that previous stop. Walking through the narrow door on the left of a bright, bold red-painted exterior, the inside, also painted red, offers a warm, homey feeling.\n \nArriving ahead of the dinner rush, we were seated immediately. Service was friendly & attentive. I began to survey the menu, but the girlfriend already had something specific in mind. She ordered & I awaited the food of her high acclaim. The wait was not long.\n \nOut came appetizers of Gambos al Ajillo (shrimp in butter/garlic sauce) & Papa aia Huancaina (potato in a spicy cheese sauce) along with bread, butter & salsa. The shrimp was simply awesome. With the aid of some of the bread, the plate was completely cleaned of all traces of the butter/garlic sauce.\n\nThis was not the only time the bread would be drenched & slathered in awesomeness, however. The salsa was crazy delicious with distinct, unique flavors I had never tasted before. Spreading butter & then salsa on top of that onto bread might sound odd, but just do it - awesome, really.\n\nThe cold-pressed potato in cheese sauce appetizer was good too, though the sauce didn't have the delicacy or complexity of a similar sauce at our previous Peruvian eatery. The version at Mi Lindo Peru was more home-style.\n\nTo wash down our food, the girlfriend had a glass of sangria. I thought I'd give Peruvian beer a try so I had a Cristal. The beer wasn't anything special, but I tried the girlfriend's sangria & that was definitely the way to go.\n\nNext came our entrees: Aji de Gallina (chicken in a creamy yellow sauce) & Lomo Saltado (beef strips on french fries). The beef strips & fries were good. In most other meals this dish would have been very well liked (& yeah, sure I still liked it enough), but this time it was completely overshadowed by the chicken in a yellow sauce of incredible flavors that I, yet again, had never tasted before. The sauce was reminiscent of a creamy Thai curry, but definitely with a Peruvian twist that was unlike anything I had ever tried before. Only a few bites were necessary to elevate this dish from unknown to one of my absolute favorites.\n\nI love this dish so much that I already went back with the girlfriend a 2nd time shortly after this 1st visit for more. We, again, got the Gambos al Ajillo, tried the Causa de Pollo (mashed potato stuffed chicken salad) which was quite yummy & of course, got 2 orders of Aji de Gallina (1 to eat & 1 to take home). We also took home a cup of the salsa.\n\nMi Lindo Peru has quickly become one of my favorite places to eat. It is indeed a rarity that a single restaurant would introduce me to this many previously not experienced, exquisite & superlative flavors. The feel is warm & homey. Service is excellent. Mi Lindo Peru really is as good as it gets.", "rating": 5, "date": "2010-08-24"}, {"excerpts": ["Both the Papa La Huancaina and the Causa de Pollo have lost the rocotto spice they distinguishably had a couple years ago. ", "Don't think I'll be coming here again."], "author": "Dessi C.", "review": "You know gentrification is real when Latino restaurants have to take it easy on the spice to be more palatable for the White people moving in. I remember Mi Lindo Peru being one of the only places you can get an authentic Peruvian meal. Both the Papa La Huancaina and the Causa de Pollo have lost the rocotto spice they distinguishably had a couple years ago. Don't think I'll be coming here again.", "rating": 2, "date": "2014-05-27"}, {"excerpts": ["The food's amazing...the lomo saltado is the best (ask for a fried egg on top), the causa de pollo is delicious, the ensalada de pollo is a great light regular lunch thing, the hotdogs + french fries are deeelightful. "], "author": "Liz C.", "review": "Since I started working 2 blocks away, I've probably averaged 3 lunches here a month for 2 years, usually with a few of the same coworkers. The food's amazing...the lomo saltado is the best (ask for a fried egg on top), the causa de pollo is delicious, the ensalada de pollo is a great light regular lunch thing, the hotdogs + french fries are deeelightful. Definitely put butter and salsa on the bread. \n\nAnd the service - I love them. Awesome people... My first Peruvian spot and still my favorite.", "rating": 5, "date": "2010-12-20"}], "causa de camarones": []}