{"cozze e vongole": [], "calamari fritti": [], "carpaccio bovino": [], "prosciutto e melone": [], "antipasto allitaliana": [], "calamari vinaigrette": [], "spaghetti con polpette": [], "ravioli di formaggio": [], "pappardelle alla boscaiola": [{"excerpts": ["All the food we had was really good from the Bruschetta, warm bread, Chicken Marsala and Pappardelle Alla Boscaiola (ground sausage black olives peas and portobello mushroom in tomato sauce). ", "The sauce on the pasta was delicious. ", "It wasn't too tomatoey nor salty ", "and there were lots of mushromms. ", "The marsala sauce can be a bit too sweet at other places ", "but it was not here. ", "When dessert came, we were a little full but they let us take it home. ", "They were little almond flavored cookies and gummy bears. ", "The cookies were really good. ", "The service was friendly and attentive. ", "We'd go back for the warm bread and fresh pasta sauces. ", "Funny that we've been eating in North Beach for over 20 years but never thought to stop in here."], "author": "Jen L.", "review": "We were walking by and Tony talked us into trying them out. He offered us Bruschetta and Dessert. He got us with the Gummy Bears and fresh homemade daily pasta sauces. It was a well decorated restaurant but not cozy in any way. The TV airing the Warriors game was not HD but it was nice to be able to at least watch the game over dinner. All the food we had was really good from the Bruschetta, warm bread, Chicken Marsala and Pappardelle Alla Boscaiola (ground sausage black olives peas and portobello mushroom in tomato sauce). The sauce on the pasta was delicious. It wasn't too tomatoey nor salty and there were lots of mushromms. The marsala sauce can be a bit too sweet at other places but it was not here. When dessert came, we were a little full but they let us take it home. They were little almond flavored cookies and gummy bears. The cookies were really good. The service was friendly and attentive. We'd go back for the warm bread and fresh pasta sauces. Funny that we've been eating in North Beach for over 20 years but never thought to stop in here.", "rating": 4, "date": "2016-12-15"}, {"excerpts": ["Pappardelle Alla Boscaiola was hot and fresh. ", "Cioppino was HUGE"], "author": "A A.", "review": "Pappardelle Alla Boscaiola was hot and fresh. Cioppino was HUGE", "rating": 4, "date": "2015-04-08"}], "penne riviera": [], "tortellini michaelangelo": [], "penne allarrabbiata": [], "fettuccini mare e monti": [], "ravioli di gamberi e aragosta": [], "spaghetti alle vongole": [], "pollo alla milanese": [{"excerpts": ["Had the Pollo Alla Milanese... ", "So freakin good, yummy, excellent!!! \n", "Atmosphere is quaint... ", "Owner was the guy in the back cooking all dishes... \n", "Would've gave them 5 stars, but for some reason we (my 3 year old daughter & wifey) did not recieve the same type of service as everyone else... ", "Dont Know? ", "But the food was truly excellent!!! ", "Give it a try..."], "author": "John D.", "review": "OMG!!! Had the Pollo Alla Milanese... So freakin good, yummy, excellent!!! \nAtmosphere is quaint... Owner was the guy in the back cooking all dishes... \nWould've gave them 5 stars, but for some reason we (my 3 year old daughter & wifey) did not recieve the same type of service as everyone else... Dont Know? But the food was truly excellent!!! Give it a try...", "rating": 4, "date": "2015-06-28"}, {"excerpts": ["I ordered the Pollo alla Milanese that has received rave reviews here. ", "Apparently, the kitchen was asleep at the wheel tonight, too. ", "There was absolutely no white wine, lemon sauce on my chicken. ", "Some had sunk into the chicken, but not enough to keep it from tasting dried out. ", "The mixed vegetables consisted of two flavorless pieces of broccoli and one half white potato sliced. ", "My husband's lasagne didn't even fill three-quarters of the dish and was drowning in sauce. "], "author": "Ann P.", "review": "When Capp's Corner closed, we walked the neighborhood trying to find a new authentic Italian restaurant to replace it. The host here was standing outside and tempted us in with his promise that if we didn't love the food, he would pay for our meal. Too bad he didn't make the same offer for the service. We returned two months later for one of our worst dining experiences.\n\nI don't know if it's always this bad, but the service we received was the WORST I've ever experienced. We were seated right away (at a table awkwardly situated against a step-up near the corner), but that was all that went well. A basket of bread and bowl of olives were literally dumped on our table 15 minutes after we sat down, but it took 35 minutes before anyone came to take our order -- even for just drinks. My husband literally had to flag someone down. Three tables seated after us were served first. And the initial server who took our order then repeated it to our actual server.\n\nWe got our salads in about 15 minutes but those came 10 minutes before our drinks. In one of his fly-by passes of our table, the server said, \"Oh yeah, you wanted drinks\" and asked us to remind him what we ordered. Dinner took another half hour to arrive and the server failed to put the right plate in front of the right person. On another fly-by, he unceremoniously dumped a huge bowl of Parmesan cheese on our table and virtually ignored us the rest of the night.\n\nMaybe the service wouldn't have been so troublesome if the food at least had been good. It wasn't. I ordered the Pollo alla Milanese that has received rave reviews here. Apparently, the kitchen was asleep at the wheel tonight, too. There was absolutely no white wine, lemon sauce on my chicken. Some had sunk into the chicken, but not enough to keep it from tasting dried out. The mixed vegetables consisted of two flavorless pieces of broccoli and one half white potato sliced. My husband's lasagne didn't even fill three-quarters of the dish and was drowning in sauce. My daughter's spaghetti and meatballs were cold.\n\nOur server never asked once if we needed anything. I had to ask a second server to refill by daughter's water glass (her only drink) and bring us ketchup for my other daughter's fries. At one point, I tried to stop our server to ask for an additional glass of wine. \"OK, OK, OK,\" he said over his shoulder. We never got the wine. This dinner took 90 minutes start to finish -- with only salads and the entrees, no desserts or even second drinks. After waiting 15 minutes for the check, I finally walked up to our server and asked him to bring it to us so I could get my 4 year old home to bed. \"OK, OK, OK,\" he told me, again. Then he spent the next 5 minutes waiting on everyone else. I finally asked the hostess to please get it for us. Never once did the server even bother with a \"sorry it's so busy\" apology.\n\nI've never left a penny tip. Tonight, I did. This restaurant sends its host or hostess out to recruit diners -- even when it can't handle the customers it already has. I suggest they train their host or hostess to backup as a server. Clearly, that's needed. Because I can guarantee that even if the owner paid for my meal next time, I still wouldn't come back here.", "rating": 1, "date": "2015-08-10"}], "veal saltimbocca": [{"excerpts": ["The veal saltimbocca was small and had a funny flavor and the Veal Marsala tasted off too.  ", "Expected more since we are in North Beach.  ", "The service was good and they were good to our kids and split their gnocchi.  "], "author": "Keith L.", "review": "Came in with a groupon and we were not impressed.  The veal saltimbocca was small and had a funny flavor and the Veal Marsala tasted off too.  Expected more since we are in North Beach.  The service was good and they were good to our kids and split their gnocchi.  The creme brûlée was great and highlight of the meal.\n\nUnfortunately due to the food, we won't be coming back", "rating": 3, "date": "2014-07-03"}], "pollo con salsiccia e funghi": [], "veal alla parmigiana": [{"excerpts": ["veal alla parmigiana tasted  like a banana and ravioli just six pieces and a lot sauce. ", "the waiter didn't tell me the kitchen was closed."], "author": "Celia A.", "review": "the serving was really bad but the food it's ok but so small portion. veal alla parmigiana tasted  like a banana and ravioli just six pieces and a lot sauce. the waiter didn't tell me the kitchen was closed.", "rating": 1, "date": "2016-12-30"}], "gamberi al vino bianco": [], "veal portobello": [{"excerpts": ["i started with veal portobello and then ordered a full size portion of spaghetti.  "], "author": "Hammer Time H.", "review": "the food here is decent.  i came hungry and actually ordered two entrees which made me look like a pig, but oh well.  i started with veal portobello and then ordered a full size portion of spaghetti.  After that, I finished my date's lobster ravioli.  \n\nthe places makes you feel like you're an old rich italian mafia guy (at least that was my alter ego for the night).  or as pauly d would say - an OG - original guido\n\nmarcos, if you're reading this before 8 am you should know this is the same night i got that hicky.", "rating": 4, "date": "2011-01-20"}, {"excerpts": ["We shared a fettuccine with shrimp in a tomato cream sauce, which was perfectly cooked and so delicious, as was the veal portobello with an elegant marsala sauce. ", "The tiramisu was light and beautiful. ", "I was surprised there wasn't a crowd of people. ", "I loved the Italian opera playing, a romantic dinner for me and my boyfriend."], "author": "Laurie U.", "review": "I love this place and can't believe I haven't eaten here before. The owner is charming and lovely. It had an old-world feel, olives, bread and bruschetta served at each table. The prosciutto and melon appetizer was delicious; the proscuito was high quality, not too salty, the  melon was sweet. We shared a fettuccine with shrimp in a tomato cream sauce, which was perfectly cooked and so delicious, as was the veal portobello with an elegant marsala sauce. The tiramisu was light and beautiful. I was surprised there wasn't a crowd of people. I loved the Italian opera playing, a romantic dinner for me and my boyfriend.", "rating": 5, "date": "2013-12-21"}], "pollo alla valdostana": [], "eggplant alla parmigiana": [], "tagliata di manzo": [], "veal piccata al limone": [{"excerpts": ["A Lasaga that was amazing and hubby had\nVeal Piccata Al Limone ", "I think. ", "He ate every bite and used the good bread with the rest of the suace.  ", "The art and Decor is really fun as well, wait staf friendly and ", "accomodating - Manager checked on us as well. ", "Cannot ask for much more."], "author": "Jean D.", "review": "WE were headed toward a differnt place, nice man from restaurant was standing in front \nand offered us a look at the menue- told us he would take very good care of us. Bring us some Bruchetta from him.  It was only 6:30 and place was not very busy, but wer wre hungry so we gave it a try.  Great windown seat with view of tower and Church. Bruchetta was very good and Wine very nice. We really enjoyed both dinners- A Lasaga that was amazing and hubby had\nVeal Piccata Al Limone I think. He ate every bite and used the good bread with the rest of the suace.  The art and Decor is really fun as well, wait staf friendly and accomodating - Manager checked on us as well. Cannot ask for much more.", "rating": 5, "date": "2017-01-19"}], "side spinach": [], "caffe latte": []}