{"beer brined sichuan pickles": [], "smashed cucumbers in garlic sauce": [], "beijing vinegar peanuts": [], "tiger salad": [], "fresh rice noodles": [], "teasmoked eel": [], "tiki pork belly": [], "chongqing chicken wings": [], "mongolian long beans": [], "braised pea leaves": [], "market greens": [], "westlake rice porridge": [], "salt cod fried rice": [], "breakfast fried rice": [], "schmaltz rice": [], "spicy beef chow mein": [], "tingly lamb face noodle soup": [], "combination caesar salad": [], "california crab burger": [], "cod fish sandwich": [], "corvina sea bass": [], "dungeness crab meat salad": [], "frutti di mari": [], "grilled hawaiian ahi tuna and prawns": [], "grilled prawns skewer": [], "hawaiian ahi tuna": [], "hawaiian mahi mahi": [], "local petrole sole": [{"excerpts": ["Local Petrole Sole ($23.95)\nStuffed with crabcake and baby shrimp, the Petrole Sole was a little small in quantity but great on taste. ", "It comes garnished with mashed potatoes and veggies. "], "author": "Calvin L.", "review": "I was actually in town for a basketball tournament, and we found Mission Street Oyster Bar on Yelp and just had to give it a try. We had a party of 13 people, and they sat us fairly quickly given that we just walked in with no reservations.\n\nThere was only 1 server the entire night and a few busboys refilling your water. The lone server was AMAZING though. Even though you could see the stress on her face, she was helpful with recommendations, always checking up on us, and just accommodating us as much as she could.\n\nLocal Petrole Sole ($23.95)\nStuffed with crabcake and baby shrimp, the Petrole Sole was a little small in quantity but great on taste. It comes garnished with mashed potatoes and veggies. You may not see it on the menu because it was one of the specials.\n\nCioppino ($29.95)\nI saw this dish posted ALL over Yelp, so we had to order it. There is SO much seafood! A little pricey but so worth is (especially if you're a huge seafood fan like myself).\n\nGarlic Crab ($32.96)\nI have NEVER been to a place that gives you THIS much crab. There is a TON of crab. You can get full of just this dish alone eating only the crab legs. Huge portion with HUGE flavors. Awesome.\n\nClam Chowder (Bowl) ($5.50)\nHighly recommended. Nice and creamy, but the best part is that it's CHUNKY. Lots of clams and potatoes (just the way I like it).\n\nGarlic Bread ($5.50)\nTHIS IS A MUST! They use ACTUAL garlic on top of the bread. It's amazing. It's a huge hit on Yelp, and now I can see why.\n\nOverall, I'm in love with this place (especially the Garlic Bread, Clam Chowder, and Garlic Crab). My one knock is that we waited an hour (literally) for our food once we ordered. Given it was a busy Saturday evening, an hour is still a little too long no matter where anyone goes. Nonetheless, the seafood was fresh and it was our best meal in SF when we were up there.", "rating": 4, "date": "2014-06-02"}], "maine lobster tail": [], "pasta alfredo": [{"excerpts": ["There's no kids menu, so I ordered a pasta alfredo which my kids split.  ", "The kids also split fried calamari.  ", "Oysters were really good, rest of the menu items were decent, but the customer service was the best part."], "author": "Maria B.", "review": "The Blue Point oysters were better than the Tomale Bay ones IMHO .  My husband had the cioppino, I didn't try it but he said it could've used more acid.  I liked my sole stuffed but it could've used more acid too.\n\nThere's no kids menu, so I ordered a pasta alfredo which my kids split.  The kids also split fried calamari.  Oysters were really good, rest of the menu items were decent, but the customer service was the best part.", "rating": 3, "date": "2017-07-22"}, {"excerpts": ["Tried the Pasta Alfredo. ", "Disgusting!!! ", "Made me puke.  ", "The smell the flavor was just horrible! ", "Not worth your $$"], "author": "Giselle P.", "review": "Tried the Pasta Alfredo. Disgusting!!! Made me puke.  The smell the flavor was just horrible! Not worth your $$", "rating": 1, "date": "2013-09-23"}], "pasta with prawns in marinara sauce": [], "pasta with prawns": [{"excerpts": ["We ordered the two items most reviews recommended- the cioppino and pasta with prawns. \n\n"], "author": "Sarina A.", "review": "I work in the Mission and had no idea about this amazing place! We walked in at 6pm on a friday night and were seated right away. The service was great. I actually only wanted oysters, but ended up being really impressed with the food. We ordered the two items most reviews recommended- the cioppino and pasta with prawns. \n\nThe cioppino was the best cioppino Ive ever had and Im not over exaggerating either. The amount of seafood was more than generous. The portion was perfect for 2 people- maybe even 3 because we had left overs. But it would definitely be way too much for 1 person. It comes with 2 pieces of delicious garlic bread, but I guarantee youll have to order more to dip in that cioppino. A half order of garlic bread is 2 pieces and a full is 4. Do yourself a favor and just get a full order. \n\nThe daily pasta w/praws with the roasted garlic, white wine sauce was also delicious! I never usually finish pasta entrees but this one I did. The size of the praws were huge and there were maybe 8 pieces. This pasta really exceeded my expectations.\n\nWe ordered Fanny Bay Oysters and I have to admit that of all the places Ive ordered these, this place had the biggest fanny bays Ive ever had. They were very meaty!\n\nIt was our first time at this restaurant and was even going to order a Calamari but our server was kind enough to warn us that we had plenty of food already with the cioppino and should hold of. Im glad she did that because we didnt even finish the cioppino. \n\nMy server told us this place has been open about 2.5 years but had just went through a renovation. The sign outside was changed and its been attracting a lot more business. Well it worked for me because I always saw their sign on my way to Boba Guys. When we stepped out of the restaurant, we literally heard 3 different couples walking by saying \"Oh cool, whats this Oyster Bar?\". Obviously, the new sign and renovation was just what this place needs. \n\nI really didnt expect much from this place because I havent heard much about this place, but my experience totally exceeded my expectations. I have to admit, as I first sat down I decided that if I was still hungry and not satisfied with the food here I would head over to Hog & Rocks after. Well, I sure didnt need to do that! I will definitely be back for more!\n\nCioppino\nPasta with praws\nFull order garlic bread\nFish & Chips ( I cant review this because this wasnt for me and I ordered this for take out)\n2 diet cokes (Btw no refills, they are cans)\n\nTotal $138", "rating": 5, "date": "2015-09-19"}, {"excerpts": ["Husband had Shellfish combination and I had Pasta with prawns in light tomato cream sauce. ", "Sheer awesomeness!!! ", "Clean atmosphere and Mel was super friendly. ", "She recited the day's special with such enthusiasm ,warmth and good memorization... "], "author": "Stefanie C.", "review": "Most fantastic seafood we've had in a long time! Date night was way more fun with great food.\n\nThe Mission Street special had everything lightly breaded and perfect in a million ways. 5-star appetizer.\n\nHusband had Shellfish combination and I had Pasta with prawns in light tomato cream sauce. Sheer awesomeness!!! Clean atmosphere and Mel was super friendly. She recited the day's special with such enthusiasm ,warmth and good memorization... she was legit! \n\nDefinitely coming back with friends:)", "rating": 5, "date": "2015-03-28"}, {"excerpts": ["Ordered the daily pasta with prawns, spicy prawn scampi and fresh oysters during happy hour. ", "Everything was amazing!"], "author": "Cherri Y.", "review": "Best seafood meal ever! Great service. \n\nOrdered the daily pasta with prawns, spicy prawn scampi and fresh oysters during happy hour. Everything was amazing!", "rating": 5, "date": "2015-12-16"}, {"excerpts": ["Instead, we also ordered the pasta with prawns in a white wine, tomato, and basil sauce and the cod special.  ", "The cod was flaky and tender with excellent flavor and a nice breading, which was crispy without being crunchy.  "], "author": "Pearl L.", "review": "This place is awesome!  The seafood is super high quality and wonderfully fresh.  I love Anchor Oyster Bar in the Castro, but there's always a massive wait.  I'd read that the chef at Mission Street Oyster worked at Anchor for years, so I decided to check it out.\n\nMy party of three arrived at 7pm on a Sunday, and there was no wait.  We started with oysters, which are $2 per oyster all weekend long!  The selection included six varied oysters, including Kumamotos, my personal favorite.  The oysters were expertly shucked - no shell or mangling at all - which is sadly pretty rare, even among places that profess to be oyster specialists. \n\nWe ordered the frutti di mare - clams, mussels, green mussels, fish, prawns, and crab in a white wine garlic sauce.  Each piece of seafood was amazingly fresh, tender, and well-flavored.  The dish was packed with seafood goodness, and our table of three probably could have shared it and gone home happy.  Instead, we also ordered the pasta with prawns in a white wine, tomato, and basil sauce and the cod special.  The cod was flaky and tender with excellent flavor and a nice breading, which was crispy without being crunchy.  The pasta was quite delicious and came with five or six big prawns. \n\nThe ambiance is a little lacking - the restaurant has a cavernous, sterile feel, but you'll be so impressed by the food, you probably won't notice.", "rating": 5, "date": "2013-06-16"}, {"excerpts": ["I had the clam chowder and the pasta with prawns, both of which were quite good and very filling. ", "Our waitress was very nice and seemed quite knowledge about types of oysters. ", "And the place was able to accommodate a large group just fine. ", "All in all, I would come back again. ", "Maybe I'll try an oyster or two too."], "author": "Daylen Y.", "review": "The place has \"oyster\" right in its name. I don't really like oysters, but that's OK--they've got pastas, soups, salads, and plenty of other dishes. I had the clam chowder and the pasta with prawns, both of which were quite good and very filling. Our waitress was very nice and seemed quite knowledge about types of oysters. And the place was able to accommodate a large group just fine. All in all, I would come back again. Maybe I'll try an oyster or two too.", "rating": 4, "date": "2014-08-02"}, {"excerpts": ["Highly recommend the spicy marinara pasta with prawns. ", "The pasta is cooked perfectly and the prawns were succulent."], "author": "Emilio M.", "review": "This place is amazing! I recommend this place to any seafood lover (especially shrimp and oysters lovers) They really know how to prepare shrimp. For an appetizer my girlfriend and I got the fried calamari and it was really fresh. For dinner we had the spicy marinara with prawns... DELICIOUS! Highly recommend the spicy marinara pasta with prawns. The pasta is cooked perfectly and the prawns were succulent.", "rating": 5, "date": "2013-10-28"}], "poor boy sandwich": [], "red meat idaho trout": [], "sauteed local petrole sole": [], "scampi prawns": [], "shrimp salad": [{"excerpts": ["The food is absolutely amazing.....raw oysters, the garlic bread....but the crab and shrimp salad buckled my knees.....so good.  ", "Nothing could top this......"], "author": "Tom P.", "review": "Ok....I have made two visits here....and need to head back.\n\n1.  Location is on Mission St, and walking distance from the 16th St Bart station, and around the corner from the bar scene on Valencia.\n\n2.  The venue is cool and airy.....and I love this.\n\n3.  The food is absolutely amazing.....raw oysters, the garlic bread....but the crab and shrimp salad buckled my knees.....so good.  Nothing could top this......but then my daughter ordered the cioppino, and it was over the top amazing.\n\n4. Service was solid every visit....(my wine glass never went empty).\n\nI love this place!!!", "rating": 5, "date": "2016-01-12"}], "spicy garlic prawns": [{"excerpts": ["The claim cowder(just needed alittle pepper) to the spicy garlic prawns to the amazing ciopino. ", "The garlic bread   was crazy insanely hands down best I've ever had. ", "The happy hour $2 oysters were really good. ", "Very fresh...even after all the lemon and garlic and hot sauce I had to pile on. "], "author": "Kimbre K.", "review": "Everything we had was delicious. The claim cowder(just needed alittle pepper) to the spicy garlic prawns to the amazing ciopino. The garlic bread   was crazy insanely hands down best I've ever had. The happy hour $2 oysters were really good. Very fresh...even after all the lemon and garlic and hot sauce I had to pile on. ( Im new to this oyster eating)\n\nThe service was nice. I've been told this place can get crowded fast. Well on a Friday evening is was perfect. So our waiter was very attentive. Even after I had to send back what I ordered.(not what i expected) the manager came over and helped me to better understand the menu, substitutions, favorites. \nOverall great experience. Definitely will be back. \n\nCons:\nA little expensive.\nIn the mission area. I don't mind the mission its just not pretty area to look at.", "rating": 4, "date": "2017-07-26"}, {"excerpts": ["Then get the spicy garlic prawns, in my opinion the best item on the menu. ", "We didn't have drinks there ", "but the bar layout looked awesome. ", "Nice place and will probably come back again."], "author": "Joe D.", "review": "Who knew you could find such great seafood in the heart of the mission! Here's what you gotta do: walk in on a Saturday afternoon and order 8 oysters, all styles, for $2 each. Then get the spicy garlic prawns, in my opinion the best item on the menu. We didn't have drinks there but the bar layout looked awesome. Nice place and will probably come back again.", "rating": 4, "date": "2018-02-25"}, {"excerpts": ["Spicy Garlic Prawns: ", "Large shrimpy garlicky goodness. ", "Pretty straightforward. \n", "4. ", "Calamari: nothing special - but solid.\n", "5. "], "author": "Calily B.", "review": "Great choice for seafood that is reasonably priced and great selection! I was staying in the Mission area and needed a place that was close and fast since we had a plane to catch in a few hours.\n\nWhen our group of six walked in around 2 p.m. on a Sunday, it was pretty quiet and there were only a few tables. My sister was worried, but I wasn't! \n\nWe ordered 2 dozen oysters (combo) to start. They had one Bay Area one, one from Vancouver and 3 from the east coast. All were fresh and briny. \n\nWhat else we ordered:\n\n1. Seafood gazpacho: On a hot day, this dish is refreshing and bright. Enough chunks of seafood but good bites of cucumber and other veggies! \n2. Cioppino: the best dish on our table! It can easily feed 2 people. Big chunks of fish, crab and other yummy seafood. The broth is best soaked up with their delicious garlic bread.\n3. Spicy Garlic Prawns: Large shrimpy garlicky goodness. Pretty straightforward. \n4. Calamari: nothing special - but solid.\n5. Steamed Clams: Clams in a white wine sauce.\n\nIf you're looking for an overall seafood restaurant without breaking the bank, this place is fantastic!", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["My favorite entrees are the spicy garlic prawns and the cioppino. "], "author": "Ian T.", "review": "The hidden gem of the Mission. Oysters are always fresh, the wine and beer selection rotates and is always quality and the garlic bread is divine. \n\nMy favorite entrees are the spicy garlic prawns and the cioppino. Both are serious business.\n\nThe best part about this place is that I've never had trouble getting a seat upon walking in.", "rating": 5, "date": "2016-08-27"}, {"excerpts": ["*Spicy garlic prawns | $20 \nNice flavor but not worth the $$$ given the amount of shrimp. \n\n"], "author": "Earl G.", "review": "$1 Oysters and $2.50 beers at the new seafood resto few doors down from Mission Chinese!  Next time I gotta try and make it before 6pm! \n\nStumbled in for dinner as a group of 10, the new paint and overall newness made it stand out in this part of the Mission. Out waitress was great. (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=Po7vvqgV9KBOVNFwpO2tUA#Po7vvqgV9KBOVNFwpO2tUA)\n\nI liked how they cooked all the seafood to order without overcooking anything.      \n\nHere's some of the dishes we shared family style. \n\n*Steamed shell fish combo | $21 \nClams with both black and green mussels in this roasted garlic white wine type broth. They have a special right now in how they're giving FREE garlic french bread. Went so good with that broth! Probably this along with the frutti were the best dishes of the night. The broth was good BUT I've had more addictive ones from some of the nearby Tapas restos. (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=7OR8rillLZl5Wp43S6ma7w#7OR8rillLZl5Wp43S6ma7w)\n\n*Frutti di Mare | $29\nBasically everything in the steamed shellfish combo along with chunks of fish and prawns. (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=kM5z9o9K1B899inbT9nQDQ#kM5z9o9K1B899inbT9nQDQ)\n\n*Fried Mission Special | $17\nBreaded and fried oysters, calamari, and prawns. Nice crunch but nothing special.  (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=m3g4o5zBeJS21C9ZmPjEXQ#m3g4o5zBeJS21C9ZmPjEXQ)\n\n*Calamari | $13 \n(http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=TWjC2M8vizZD9Gd_3bQ4Mg#TWjC2M8vizZD9Gd_3bQ4Mg)\n\n*Fish and chips | $16 \n\n*Spicy garlic prawns | $20 \nNice flavor but not worth the $$$ given the amount of shrimp. \n\n*Daily pasta with your choice of sauce (marinara, alfredo, etc) \n\n*Their clam chowder was more potatoes than clams and surprisingly the only dish on a table full of guys that went unfinished. Something was off. \n\nSolid flavors but it's not anything fancy with developed flavors. Prices are fair, but for this part of the Mission, was looking a little more bang. For this price point, I like Woodhouse Fish a little bit better.", "rating": 3, "date": "2013-01-13"}, {"excerpts": ["We also ordered the spicy garlic prawns and this was also a very large dish and tasty. "], "author": "Jennifer S.", "review": "A solid oyster restaurant. \n\nA group of friends and I went here because I was craving oysters & seafood and that craving was definitely fulfilled. We ordered two dozen oysters for the table and they were all super fresh! There was tiny bit of shell in a few but other than that very nicely shucked! \n\nTheir entrees were also very tasty and large! The cioppino was definitely a size for two. Seems like a standard dish offered at seafood restaurants in the bay area and although I'm not as familiar with it - it was very good and the garlic bread that came with it was amazing to dip the sauce in! We also ordered the spicy garlic prawns and this was also a very large dish and tasty. The prawns were cooked perfectly and the seasoning was right on. \n\nThey seem to have pretty good happy hour deals so if I have the chance, I'd want to return for that.", "rating": 4, "date": "2016-01-28"}, {"excerpts": ["Definitely recommend the spicy garlic prawns! ", "Service was really great as well. ", "We went in on Halloween, and thought it was great that they were giving out candy to trick or treaters while still tending to all the guests dining."], "author": "Joe G.", "review": "Awesome food. Great deals on oysters. $2 oysters on the weekends. Definitely recommend the spicy garlic prawns! Service was really great as well. We went in on Halloween, and thought it was great that they were giving out candy to trick or treaters while still tending to all the guests dining.", "rating": 5, "date": "2015-10-31"}, {"excerpts": ["Spicy Garlic Prawns -  ", "They were good.  ", "A little salty but very garlicky and flavorful.  ", "My kind of spicy garlic prawns minus the overdose of salt.\n\n"], "author": "Chau D.", "review": "First off...what is that rancid smell when you walk in? I'm hoping it's the cheese they use for their garlic bread or something but man does this place have a nasty funk to it.\n\nAnyway, we got seated and we started off with a dozen oysters.  I honestly can't remember what we got but i think we said 2 of each on the list they had up.  Since I'm from Seattle and some of the oysters came from Washington I didn't think much of them.  They were good don't get me wrong but they didn't stand out.  \n\nSince there were 4 of us we did it family style.\n\nOrdered:\n\nGarlic bread - THIS IS A MUST! Probably my favorite item that we ordered here.  Very good!\n\nSpicy Garlic Prawns -  They were good.  A little salty but very garlicky and flavorful.  My kind of spicy garlic prawns minus the overdose of salt.\n\nSteamed Clams - I don't remember these. Must've not been that eventful if I can't remember\n\nCup of Clam Chowder - You want to pass on this unless you like watery chowder.  Not my thing.\n\nSide of Garlic Mash - Delish!\n\nService was mediocre.  Our server forgot we had other items coming out after our oysters and she came over to check on us like she was ready to give us our check.  Um sorry homegirl but we got more food coming.  You can't go home just yet.  The busser came by to clear up some dishes and ended up spilling water on our table and onto some of our shoes, pants etc.  No harm done since it was just water.\n\nWould I come back? Probably not.  I'll check out Swan Oyster Depot since it's a few blocks from my sisters place.", "rating": 3, "date": "2014-03-14"}, {"excerpts": ["Highly recommend the spicy garlic prawns and the garlic crab (the white wine sauce is delicious).\n\n"], "author": "Sophie C.", "review": "Sorry Woodhouse, I've found a new place for aphrodisiacs. \n\nI read about Mission Street Oyster Bar's daily happy hour from 3-6 pm ($1 oysters and $2.50 draft beer.) SOLD! \n\nY'know how some deals are TOO good to be true? Well, MSOB is the real deal. Oyster selections change daily and on our first dining experience, we chatted with the chef/owner, Freddy. Freddy's an affable and knowledgeable guy. After mentioning my penchant for Kumamoto oysters, he surprised us with two on the house. Creamy sweet delight! \n\nWe tried three varieties of  fresh oysters (eastpoint, miyaki, and pacific inlet). Each type of oyster had its own distinct characteristics and the best part was that everyone in our group liked different ones (which only shows that taste is indeed subjective). \n\nWe stopped for happy hour and stayed for dinner.  Service is excellent and the food is delicious. Highly recommend the spicy garlic prawns and the garlic crab (the white wine sauce is delicious).\n\nNote: During our visit, MSOB was opened for a week so Freddy's working out the kinks typical of any new business. For example, the menu had misspellings which gave us a few laughs.", "rating": 4, "date": "2013-01-17"}], "steamed clams": [{"excerpts": ["I normally get the combo which is amazing comes with 12 oysters, Steamed clams and 4 prawns.  ", "This makes the perfect mid afternoon bite!"], "author": "Natalie K.", "review": "Great Happy hour.  Their oysters are so fresh and the staff is great.  Perfect for a mid-week treat or go on the weekend and have a lazy brunch.  I normally get the combo which is amazing comes with 12 oysters, Steamed clams and 4 prawns.  This makes the perfect mid afternoon bite!", "rating": 5, "date": "2018-01-30"}, {"excerpts": ["Steamed Clams: Clams in a white wine sauce.\n\n"], "author": "Calily B.", "review": "Great choice for seafood that is reasonably priced and great selection! I was staying in the Mission area and needed a place that was close and fast since we had a plane to catch in a few hours.\n\nWhen our group of six walked in around 2 p.m. on a Sunday, it was pretty quiet and there were only a few tables. My sister was worried, but I wasn't! \n\nWe ordered 2 dozen oysters (combo) to start. They had one Bay Area one, one from Vancouver and 3 from the east coast. All were fresh and briny. \n\nWhat else we ordered:\n\n1. Seafood gazpacho: On a hot day, this dish is refreshing and bright. Enough chunks of seafood but good bites of cucumber and other veggies! \n2. Cioppino: the best dish on our table! It can easily feed 2 people. Big chunks of fish, crab and other yummy seafood. The broth is best soaked up with their delicious garlic bread.\n3. Spicy Garlic Prawns: Large shrimpy garlicky goodness. Pretty straightforward. \n4. Calamari: nothing special - but solid.\n5. Steamed Clams: Clams in a white wine sauce.\n\nIf you're looking for an overall seafood restaurant without breaking the bank, this place is fantastic!", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["The steamed clams and prawns were large and juicy. \n\n"], "author": "Mimi T.", "review": "We took a chance bringing my dad here for his birthday because we hadn't been here. Hog Island is temporarily closed for renovation, and Anchor Oyster isn't open for lunch on Sundays. \n\nWhen we arrived I was skeptical--we were first patrons in the restaurant. To be fair - It was Noon on Superbowl Sunday. \n\nWe ordered the Mission Special, the Cioppino, and the Garlic Crab. \n\nThe Mission Special consist of 12 mixed oysters, steam prawns and clams. \nThe oysters were very fresh, served with cocktail sauce and horseradish. The steamed clams and prawns were large and juicy. \n\nThe Cioppino was filled with tender fish, crab and mixed shellfish. The sauce was delicious and rich. The Garlic Crab was just as sinful and delicious. EVERYTHING tasted really fresh!\n\nThe owners were extremely kind and friendly. I highly recommend this place to get your seafood fix!", "rating": 5, "date": "2014-02-02"}, {"excerpts": ["it's own, but dip it in the broth with steamed clams and prawns, heaven. ", "The clams were OK, but the prawns were big and juicy. ", "Satisfied and I hope to be back."], "author": "Nani V.", "review": "Everything about this place was so good! I shared the Mission platter with two other girlfriends and two house salads with the garlic dressing. Knocking off 1 star for no happy hour on New year's day. The oysters tasted fresh, the salad was also fresh with that amazing dressing, and oh man, the garlic bread was delicious on it's own, but dip it in the broth with steamed clams and prawns, heaven. The clams were OK, but the prawns were big and juicy. Satisfied and I hope to be back.", "rating": 4, "date": "2016-01-04"}, {"excerpts": ["The steamed clams and shrimp were in a delicious garlicky wine broth.  \n\n"], "author": "William V.", "review": "Solid. Came here around 3pm on a Sat afternoon. The brunch rush left and there were no other guests. Odd, but it was beautiful outside so people were probably at Dolores park.  This place is pricy. Thankfully my sister was treating. Holler!\n\nSpicy Shrimp - spicy, garlicky goodness. Veg were nicely done as well. \n\nFish and Chips - The fries were cajun spiced fries. A great change up. However, the fish batter was GREASY. This happens when the oil is not hot enough to fry.  So that was a bummer. Only two pieces for $17. \n\nCrab cakes - delicious, expensive.\n\nThe mission deal - We got the full order. Oysters looked good from what my sister and her husband told me. I did not eat them for personally reasons. The steamed clams and shrimp were in a delicious garlicky wine broth.  \n\nOverall: Very nice, relaxed interior. It's just located in a kind of hectic, \"mission-y\" (I hope you know what that means) spot between retail stores and Taqueria Cancun. Service was decent. Like I said, expensive but it's seafood and it's the mission.", "rating": 4, "date": "2014-11-08"}, {"excerpts": ["Ordered the Mission half special (6 oysters, 2 prawns, and some steamed clams), as well as a bowl of clam chowder. ", "While the seafood was good quality (I especially enjoyed the clams!) ", "and the price was decent, I was really let down by the service. "], "author": "Lauren C.", "review": "Went here yesterday for some oysters with my boyfriend. We were the only ones in the restaurant at the time (3:30pm). Ordered the Mission half special (6 oysters, 2 prawns, and some steamed clams), as well as a bowl of clam chowder. While the seafood was good quality (I especially enjoyed the clams!) and the price was decent, I was really let down by the service. We received our food, and since we were splitting the meal we finished in a pretty reasonable amount of time, and decided we wanted to order some more oysters.\n\nWe waited for 20 minutes with empty plates in front of us waiting for someone to come by our table so we could order the oysters. Nobody came to check up on us, refill our water, or bus our table. We tried to make eye contact with a member of the staff, but they were all in the back of the room talking amongst each other and not paying attention to the only customers in the restaurant. I would totally have understood the slow service if the restaurant was busy, but there were at least 4 people working and nobody came by or acknowledged us, which I thought was odd. My boyfriend and I decided that if it was going to take this long for us to get our table bussed, there was no use trying to order more food. So after another 10 minutes of waiting, our check comes, we paid and we left.\n\nI would love to come back to this establishment, as I thought the quality of food was good. But if the service is going to be like this again, I don't think I'll be coming back.", "rating": 2, "date": "2015-07-05"}, {"excerpts": ["Steamed Clams - I don't remember these. "], "author": "Chau D.", "review": "First off...what is that rancid smell when you walk in? I'm hoping it's the cheese they use for their garlic bread or something but man does this place have a nasty funk to it.\n\nAnyway, we got seated and we started off with a dozen oysters.  I honestly can't remember what we got but i think we said 2 of each on the list they had up.  Since I'm from Seattle and some of the oysters came from Washington I didn't think much of them.  They were good don't get me wrong but they didn't stand out.  \n\nSince there were 4 of us we did it family style.\n\nOrdered:\n\nGarlic bread - THIS IS A MUST! Probably my favorite item that we ordered here.  Very good!\n\nSpicy Garlic Prawns -  They were good.  A little salty but very garlicky and flavorful.  My kind of spicy garlic prawns minus the overdose of salt.\n\nSteamed Clams - I don't remember these. Must've not been that eventful if I can't remember\n\nCup of Clam Chowder - You want to pass on this unless you like watery chowder.  Not my thing.\n\nSide of Garlic Mash - Delish!\n\nService was mediocre.  Our server forgot we had other items coming out after our oysters and she came over to check on us like she was ready to give us our check.  Um sorry homegirl but we got more food coming.  You can't go home just yet.  The busser came by to clear up some dishes and ended up spilling water on our table and onto some of our shoes, pants etc.  No harm done since it was just water.\n\nWould I come back? Probably not.  I'll check out Swan Oyster Depot since it's a few blocks from my sisters place.", "rating": 3, "date": "2014-03-14"}, {"excerpts": ["and I ordered the full order of 12 raw oysters, four prawns and steamed clams for $32.95.  ", "We ended up with yummy, fresh Chesapeake and Miyagi oysters which satiated our raw oyster craving.  ", "The steamed clams came with four prawns and were a real buttery delight!  ", "-perfectly cooked shrimp and nuances of flavors in the broth!  ", "A pleasant woman with short hair who tended to us the whole time sold us on the garlic bread.  ", "Great suggestion!  ", "That was probably the best garlic bread we had ever indulged in!  ", "It was regular French bread with butter, paprika, parsley, garlic and some cheese on top.  ", "I think it was Monterey Jack.  ", "It was the perfect addition to the steamed clams and frankly would be to anything brothy here.  ", "Sorry no hard liquor here, but there is a decent selection of beers, IPA and wine.  "], "author": "Elizabeth S.", "review": "Mission Street Oyster Bar is a nice casual break from the hustle and bustle of the Mission.  The restaurant itself is very minimalistic and not overpacked with seating leaving the ambiance with a spacious, yet calming feel with slate blue walls adorned with ocean themed accessories.  I love the colorful marlin on the wall!\n\nMy bf and I ordered the full order of 12 raw oysters, four prawns and steamed clams for $32.95.  We ended up with yummy, fresh Chesapeake and Miyagi oysters which satiated our raw oyster craving.  The steamed clams came with four prawns and were a real buttery delight!  -perfectly cooked shrimp and nuances of flavors in the broth!  A pleasant woman with short hair who tended to us the whole time sold us on the garlic bread.  Great suggestion!  That was probably the best garlic bread we had ever indulged in!  It was regular French bread with butter, paprika, parsley, garlic and some cheese on top.  I think it was Monterey Jack.  It was the perfect addition to the steamed clams and frankly would be to anything brothy here.  Sorry no hard liquor here, but there is a decent selection of beers, IPA and wine.  They even have soju here.\n\nI really can't say what could be better despite the casual atmosphere which is comfortable.  The prices are right.  The food is excellent, and the service is on point!  What a great find for raw oysters close to home.  We shall be back!", "rating": 5, "date": "2013-08-17"}, {"excerpts": ["Amazing FRESH OYSTERS and STEAMED CLAMS.  "], "author": "Mark S.", "review": "I pass by Mission Street Oyster everyday.  I finally went in with my partner.  Amazing FRESH OYSTERS and STEAMED CLAMS.  And the garlic bread AMAZING.   \n\nThe staff were very pleasant.  Its not trendy.  Its the real Mish.", "rating": 5, "date": "2013-07-01"}, {"excerpts": ["- Steamed clams and mussels\n- Garlic Bread", "... ", "wow. \n", "- Shrimp Cesar Salad (with croutons so freshly made they were still warm)\n- Trout (I NEVER eat trout. ", "I scarfed this down!) \n"], "author": "Robynne W.", "review": "Hands down the freshest, best scallops I have ever had. Puts the scallops at Epic to shame. \n\nWow. We just had one of those \"run home to write a Yelp review\" experiences. We were lucky enough to be made privy to the \"soft opening\" here and I am so, so grateful! This restaurant was just opened by the former chef (of 18 years) of Anchor Oyster Bar in the Castro. This man knows his seafood.  Keep in mind this restaurant is just opening, so all of the decor is not complete, BUT THE SEAFOOD IS SO FRESH! \n\nHere is what we ate. I recommend ALL of it: \n- Oysters (duh)\n - Steamed clams and mussels\n- Garlic Bread... wow. \n- Shrimp Cesar Salad (with croutons so freshly made they were still warm)\n- Trout (I NEVER eat trout. I scarfed this down!) \n- Scallops.... to kill for. \n\nEverything here is so fresh that there was no \"fishy\" smell or taste to anything we ate. Nice beer selection, too. I love the Deschutes Chainbreaker.", "rating": 5, "date": "2012-12-31"}, {"excerpts": ["Oysters & steamed clams & prawns special - Got this on the recommendation of our server ", "and I'm so glad we did. ", "Besides your dozen fresh oysters, you get a sizeable bowl of steamed clams and 4 large prawns in a wonderful savory broth, perfect for dipping your scrumptious GARLIC BREAD! ", "Another excellent entree to share!"], "author": "Lisa M.", "review": "I have now been here many times since the last review, and while I'm an oyster devotee, I've tried other things on the menu. If I good 6 stars I would, the food is that good! Very flavorful , large portions, and always fresh. I have only had excellent meals here.\n\nCioppino - Amazing! Chock full of fresh seafood, fresh herbs, and the most delish cioppino broth I've ever had. Easily an entree for two.\n\nFish & Chips - Fantastic, and I'm not a fish & chips lover. Perfectly crispy batter, not greasy at all, fresh fish and awesome  fries.\n\nOysters & steamed clams & prawns special - Got this on the recommendation of our server and I'm so glad we did. Besides your dozen fresh oysters, you get a sizeable bowl of steamed clams and 4 large prawns in a wonderful savory broth, perfect for dipping your scrumptious GARLIC BREAD! Another excellent entree to share!", "rating": 5, "date": "2014-01-16"}, {"excerpts": ["Get the steamed clams and dip your bread in the broth all night long. ", "Everything was delicious!"], "author": "Heidi K.", "review": "Fantastic food. Pretty similar menu (if not the same) as Anchor Oyster Bar (my original go-to in SF), and same great taste. But this place is much roomier and takes reservations, which definitely gives it a leg up. Get the steamed clams and dip your bread in the broth all night long. Everything was delicious!", "rating": 5, "date": "2013-12-10"}], "steamed shell fish combination": [{"excerpts": ["We decided to share the Steamed Shell Fish Combination which was around $20. ", "This was ridiculously good! ", "It left the two of us satisfied and very stuffed. ", "This dish included shrimp, clams, and mussels in a wonderful sauce. ", "The sauce definitely made the dish. ", "It was savory with a hint of sweetness. "], "author": "Tiffany C.", "review": "After spending the morning hiking at Lands End, my friend and I were on the hunt for oysters! We stumbled across this restaurant on Yelp and made the ~30 minute drive from Sea Cliff to the Mission District. Luckily, there was ample metered street parking and we snagged a spot directly in front of the restaurant. \n\nThe staff was very friendly and welcoming. The restaurant was clean and neat but slightly chilly with the door left open.\n\nMy friend and I tried their fresh oysters at a price of $2 each. Unfortunately, their $1.50 happy hour deal does not apply to Friday. Nevertheless, the oysters were very delicious, though the horseradish was not very potent. \n\nWe decided to share the Steamed Shell Fish Combination which was around $20. This was ridiculously good! It left the two of us satisfied and very stuffed. This dish included shrimp, clams, and mussels in a wonderful sauce. The sauce definitely made the dish. It was savory with a hint of sweetness. I'm not sure what ingredients were used in concocting this wonderful broth but there were tomatoes and a variety of fragrant spices. \n\nThe total bill including tip for two people was around $40. As my friend and I were so full we could barely walk, it was very much worth the money!", "rating": 4, "date": "2014-06-04"}], "washington sea scallops": [], "whole dungeness crab": [{"excerpts": ["But the star of the show was the Fresh Whole Dungeness Crab served in a delicious herbed broth.  ", "The crab was so plumped and fresh and  the meat came easily off the shell. ", "You can tell un-fresh crab because the meat will shrivel inside the shell and when you crack a claw, there is a bit of air space between the meat and shell. ", "This meat was plump and moist. "], "author": "Toan D.", "review": "A gem for oyster and seafood lovers. \n\nLocated in the Mission district this family operated restaurant works hard at putting out fresh delicious foods, with friendly efficient service in a comfortable clean setting. \n\nWe went there at 7:30 on a Monday evening.  Immediately we were greeted with a smile from the owner's son as he seated us and helped us with our drinks before the waiter arrived. \n\nThe daily oyster menu had 5 varieties of fresh oysters and we got 3 of each. My favorite was the Chesapeake Bay oysters. A bit creamy and briny. Yeeum. Fyi, any month with an \"R\" in it is good for oysters. Usually the colder months. \n\nNext we got the Dungeness Crab Cocktail with avocado. Wow the crab meat was sooo fresh and moist.  Super clean and refreshing if you're watching your calories. It was so good we got another order. Obviously we're not counting OUR calories \n\nThe Spicy Shrimp Scampi did not disappoint. Five large shrimp cooked to perfection served with sautéed broccolini, carrots and potatoes. \n\nBut the star of the show was the Fresh Whole Dungeness Crab served in a delicious herbed broth.  The crab was so plumped and fresh and  the meat came easily off the shell. You can tell un-fresh crab because the meat will shrivel inside the shell and when you crack a claw, there is a bit of air space between the meat and shell. This meat was plump and moist. I could've drank the herbed sauce with a straw. \n\nThey have a good wine list and a nice selection of beers. It was a slow Monday night but nevertheless the service was grea\n\nWe will definitely be back. \n\n\nHappy Eating!!", "rating": 5, "date": "2017-12-19"}], "wild alaskan true cod": [], "oyster shooter": [{"excerpts": ["Their menu is pretty extensive and I want to come back to try the cioppino and the soju oyster shooter."], "author": "Alfred L.", "review": "This place opened recently and you can tell because it seems to be missing some decoration and they could fit a few more tables in the space they had. This place could benefit from a wine/beverage list as well.\nWe came by for happy hour which was pretty amazing- dollar oysters and $2.50 drafts.  They had 3 kinds of oysters to choose from that day- they rotate from day to day. Chesapeakes (Maryland), Miyagis (local), and Pacific Inlets (washington). The miyagis stood out in terms sweetness and flavor. The chesapeake had a buttery texture that reminded me of live scallop but was bland in flavor. We also ordered bread and chowder, which were both made very well.\nWe ate at the bar, and it seemed like the bartender was also the waitress for the sit-down tables. The service was quick and friendly- no complaints there.\nTheir menu is pretty extensive and I want to come back to try the cioppino and the soju oyster shooter.", "rating": 4, "date": "2013-01-24"}], "prawn cocktail": [{"excerpts": ["I enjoy the Garlic Crab-(very TASTY), Prawn Cocktail, Rockefeller Oysters-(Off the CHAIN) ", "Loved em'...  ", "I had a Crab Cocktail, some garlic bread and steamed veggies.  ", "Everything was worth the drive and the servers were friendly.  "], "author": "Pretty B.", "review": "Yes BUDDY!!!!  Another AWESOME Seafood spot in the greater Bay Area and I'm a fan!  I hot this spot up as I LOVE seafood and wasn't sure if I was going to enjoy the food, even after looking at other pics on Yelp.  Glad I took it upon myself to get my taste buds wet in a FLAVORABLE way :-))))  This spot is not that big, but big enough to get your stomach on FULL.\n\nThe prices were reasonable and food was DELLISH!!!  I enjoy the Garlic Crab-(very TASTY), Prawn Cocktail, Rockefeller Oysters-(Off the CHAIN) Loved em'...  I had a Crab Cocktail, some garlic bread and steamed veggies.  Everything was worth the drive and the servers were friendly.  The serve was good and I would definitely recommend this restaurant to others :-) \n\nAgain, I spent close to $100, but all the food I got was worth it :-)", "rating": 4, "date": "2016-07-28"}, {"excerpts": ["wait, it was a prawn cocktail. ", "That was actually pretty good. "], "author": "Bruce C.", "review": "An oyster bar that doesn't know how to properly shuck oysters... *sigh*\n\nSandy and I were craving oysters after brunch this past Sunday. We wanted to hit up Anchor Oyster Bar but it was closed so we settled on MSOB since it was the only option within walking distance. \n\nThe place is really chill - high ceilings and mellow ambiance. When we walked in, we were excited to try their oysters.\n\nWe ordered two of each - Kumomotos, Miyagi and Kusshi oysters. All six half-shells came on a typical platter filled with ice, two lemon wedges, cocktail sauce, horseradish and vinegar. It looked great at first glance. http://www.yelp.com/user_local_photos?userid=CZ36wJqV-Xit758UaOr81A Everything was going well until we took down our first oysters, the Kumomotos. Man, they were so gritty and I knew immediately it's because they didn't shuck them correctly. Sandy said the same thing so I started becoming weary of the other ones. Well, the Miyagis and Kusshis were the same story. *sigh again*\n\nWe also ordered a shrimp cocktail... wait, it was a prawn cocktail. That was actually pretty good. The prawns were nice and plump. \n\nWe came for the oysters. We left in disappointment.", "rating": 2, "date": "2014-04-23"}, {"excerpts": ["The waitress was obviously newly trained, but she didn't have answers to questions like how many prawns are in the prawn cocktail? ", "We went on a Tuesday night and it was pretty much nobody but us. ", "Not sure why. ", "Maybe because there was a Giants game on which by the way they lost that night, but thank goodness they are in the NLDS! \n", "Anyway, I also thought they were quite overpriced. \n", "I might give them another try, we'll see."], "author": "Erin L.", "review": "The food was decent but the service was lacking. The waitress was obviously newly trained, but she didn't have answers to questions like how many prawns are in the prawn cocktail? We went on a Tuesday night and it was pretty much nobody but us. Not sure why. Maybe because there was a Giants game on which by the way they lost that night, but thank goodness they are in the NLDS! \nAnyway, I also thought they were quite overpriced. \nI might give them another try, we'll see.", "rating": 3, "date": "2014-10-07"}], "fresh dungeness crab meat cocktail": [], "fried oysters": [{"excerpts": ["Breaded and fried oysters, calamari, and prawns. ", "Nice crunch but nothing special.  "], "author": "Earl G.", "review": "$1 Oysters and $2.50 beers at the new seafood resto few doors down from Mission Chinese!  Next time I gotta try and make it before 6pm! \n\nStumbled in for dinner as a group of 10, the new paint and overall newness made it stand out in this part of the Mission. Out waitress was great. (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=Po7vvqgV9KBOVNFwpO2tUA#Po7vvqgV9KBOVNFwpO2tUA)\n\nI liked how they cooked all the seafood to order without overcooking anything.      \n\nHere's some of the dishes we shared family style. \n\n*Steamed shell fish combo | $21 \nClams with both black and green mussels in this roasted garlic white wine type broth. They have a special right now in how they're giving FREE garlic french bread. Went so good with that broth! Probably this along with the frutti were the best dishes of the night. The broth was good BUT I've had more addictive ones from some of the nearby Tapas restos. (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=7OR8rillLZl5Wp43S6ma7w#7OR8rillLZl5Wp43S6ma7w)\n\n*Frutti di Mare | $29\nBasically everything in the steamed shellfish combo along with chunks of fish and prawns. (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=kM5z9o9K1B899inbT9nQDQ#kM5z9o9K1B899inbT9nQDQ)\n\n*Fried Mission Special | $17\nBreaded and fried oysters, calamari, and prawns. Nice crunch but nothing special.  (http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=m3g4o5zBeJS21C9ZmPjEXQ#m3g4o5zBeJS21C9ZmPjEXQ)\n\n*Calamari | $13 \n(http://www.yelp.com/biz_photos/mission-street-oyster-bar-san-francisco?select=TWjC2M8vizZD9Gd_3bQ4Mg#TWjC2M8vizZD9Gd_3bQ4Mg)\n\n*Fish and chips | $16 \n\n*Spicy garlic prawns | $20 \nNice flavor but not worth the $$$ given the amount of shrimp. \n\n*Daily pasta with your choice of sauce (marinara, alfredo, etc) \n\n*Their clam chowder was more potatoes than clams and surprisingly the only dish on a table full of guys that went unfinished. Something was off. \n\nSolid flavors but it's not anything fancy with developed flavors. Prices are fair, but for this part of the Mission, was looking a little more bang. For this price point, I like Woodhouse Fish a little bit better.", "rating": 3, "date": "2013-01-13"}, {"excerpts": ["and so were the deep fried oysters. ", "Like not even a hit of salt or anything. ", "Didn't even want to order any of the entrees after that, very disappointed. ", "Had a Rockefeller Oyster for the first time which was pretty good tho."], "author": "Justine L.", "review": "I wanted to really like this place. The calamari had NO type of flavor to it. It was so bland and so were the deep fried oysters. Like not even a hit of salt or anything. Didn't even want to order any of the entrees after that, very disappointed. Had a Rockefeller Oyster for the first time which was pretty good tho.", "rating": 2, "date": "2017-03-31"}, {"excerpts": ["and we shared the Mission Special (fried calamari, fried shrimp and fried oysters) ", "and it was so good! ", "The seasoning they used on the food was really yummy. ", "My boyfriend got the crab burger (thick crabmeat on a bun with avo and the works) and clam chowder. ", "My brother's girlfriend got shrimp Alfredo with penne and garlic bread. ", "I got the crab cake appetizer. ", "They gave you a generous amount of seafood and it was super fresh. ", "Our bill was $103. "], "author": "Melissa S.", "review": "Wow. What a great find!\n\nI went into the Mission to check out an art gallery and ended up really hungry after. We wanted a drink, but also did not want pub food. We looked across the street and saw this place. I saw that the reviews were good, so we decided to try it. \n\nOn Saturday and Sundays, they have a $2 oyster special. I ended up not having oysters because all of their cooked food looked delicious.\n\nThere were four of us and we shared the Mission Special (fried calamari, fried shrimp and fried oysters) and it was so good! The seasoning they used on the food was really yummy. My boyfriend got the crab burger (thick crabmeat on a bun with avo and the works) and clam chowder. My brother's girlfriend got shrimp Alfredo with penne and garlic bread. I got the crab cake appetizer. They gave you a generous amount of seafood and it was super fresh. Our bill was $103. Not bad! \n\nI will definitely be back to try the oysters.", "rating": 5, "date": "2015-08-16"}, {"excerpts": ["Had the fried oysters, which were a bit overdone, and crabcakes, which were good but nothing special.  "], "author": "Ross L.", "review": "A decent meal, but I expect you can get better quality at the same price elsewhere nearby.  Had the fried oysters, which were a bit overdone, and crabcakes, which were good but nothing special.  The decor leaves a lot to be desired, and the space seems big and empty.\n\n A solid option on Mission St, but not a place I would go out of my way for.", "rating": 3, "date": "2013-02-09"}, {"excerpts": ["Found this on yelp as the best fried oysters in San Francisco. ", "Went on a Sunday night- ", "we were the only people in the place. ", "The fried oysters were small, with a very dark batter that tasted burned. ", "The tartar sauce was good. ", "Had battered scallops for dinner- scallops were nice. ", "The vegetables that came with it were impossible to cut with the knife provided- basically raw. ", "So many wonderful restaurants in San Francisco- please don't waste your time here!"], "author": "Mary A.", "review": "Found this on yelp as the best fried oysters in San Francisco. Went on a Sunday night- we were the only people in the place. The fried oysters were small, with a very dark batter that tasted burned. The tartar sauce was good. Had battered scallops for dinner- scallops were nice. The vegetables that came with it were impossible to cut with the knife provided- basically raw. So many wonderful restaurants in San Francisco- please don't waste your time here!", "rating": 1, "date": "2015-03-22"}, {"excerpts": ["We also had the mission fry that had fried oysters, calamari and prawns served with fries all fried perfectly. ", "And the best for last, the few oysters. ", "They had a nice selection ", "so we just picked a few to try at the happy hour price that I think 2.00 each. ", "It came with your simple red cocktail sauce and horseradish ", "but, there was a small light vinigar/wine drizzle which ended up being the only thing we used. ", "The oysters were so perfect they didn't need the sauce or even the lemon."], "author": "Carl C.", "review": "Loved it...period. Very fresh seafood and the best oysters in the city period. A d our server Maria was charming and very helpful. We had never been so we mixed it up a bit. I got the Sol stuffed with crab and prawns. It was light for a stuffed dish and the flavors were so balanced that I could distinguish each ingredient. We also had the mission fry that had fried oysters, calamari and prawns served with fries all fried perfectly. And the best for last, the few oysters. They had a nice selection so we just picked a few to try at the happy hour price that I think 2.00 each. It came with your simple red cocktail sauce and horseradish but, there was a small light vinigar/wine drizzle which ended up being the only thing we used. The oysters were so perfect they didn't need the sauce or even the lemon.", "rating": 5, "date": "2013-09-15"}, {"excerpts": ["Crab cakes, fried oysters, lightly breaded scallops & prawns and the ciopino!"], "author": "Craig S.", "review": "Great fresh seafood options! Crab cakes, fried oysters, lightly breaded scallops & prawns and the ciopino!", "rating": 4, "date": "2015-02-13"}, {"excerpts": ["Fried oysters $10.95 were very tasty; yet skimpy as there was only 9 oysters on the plate. ", "This could be filled in with a coleslaw or some greens.\n"], "author": "Pam R.", "review": "This is such a wonderful addition, improvement on Mission St. \nThe chef/owner Fredy Gamez had been chef for 18 years at Anchor Seafood in the Castro so he definitely knows his stuff.  \n1 dozen oysters $2.95/each; the platter consisted 3 each very fresh, plump kinds of oysters.  \nFried oysters $10.95 were very tasty; yet skimpy as there was only 9 oysters on the plate. This could be filled in with a coleslaw or some greens.\nSeafood gazpacho $16.95 was excellent; it consisted of large chunks of crab along with prawns, white fish, calamari, & bay shrimps topped with very fresh avocado slices, sour cream, & celery stalk.  \nWe also had the pasta special which consisted of linquine topped with prawms & sausage in a very delicious marinara sauce.  \nThe wine list needs improvements, but what we had was good.\nService was very good, friendly. The waitress was accomodating, made very nice suggestions, as well as explained what we had ordered.  \nThere is no dessert at this point.  \nThe space is good with shades of blue on the wall, large bar, lots of good-sized tables.  It still is pretty new so once there is artwork up, & the large empty front space filled in maybe with a host table & some trees, it will look much more organized & well-established.\nThe only drawback is the location - Mission between 18th & 19th - which is a very sketchy block to say the least.\nWe will go again, mostly likely at Happy Hour when there is $1 oysters.", "rating": 4, "date": "2013-01-29"}, {"excerpts": ["My partner got the fried oysters and there were only about 6-7 pieces for $13. ", "We also ordered the steamed black mussles and for $19.99 the mussels were tiny (though there were many) and salad, bread, and even fries did not come with it! ", "So expensive!  ", "The wait staff never asked us how we were doing either. ", "The 2 dollar symbol needs to be changed to 3 if you ask me..."], "author": "A P.", "review": "This place is alright but for the price, you really aren't getting a good deal. My partner got the fried oysters and there were only about 6-7 pieces for $13. We also ordered the steamed black mussles and for $19.99 the mussels were tiny (though there were many) and salad, bread, and even fries did not come with it! So expensive!  The wait staff never asked us how we were doing either. The 2 dollar symbol needs to be changed to 3 if you ask me...", "rating": 3, "date": "2015-03-15"}], "house garlic bread": [], "shrimp cocktail": [{"excerpts": ["For appetizers the cheapest was a $13 shrimp cocktail and goes up from there for basic appetizers SMH. ", "It's about $25 and up for seafood salad again SMH. ", "and dinner Entrees are about $26 and up. ", "I get it your trying to attract the hippsters in the area ", "and it's working because they are the only ones dumb enough to pay these prices", "...meanwhile you can go down the street into any burrito spot and get a shrimp cocktail for $8 and it will be the most Delicious thing you've eaten. ", "This place is a thumbs down for me."], "author": "Jem E.", "review": "PRICEY!!! It's not all that. I liked that they had a variety of oysters to choose from but that's about it. We tried the rock-a-feller oyster, which usually is my favorite at any restaurant. But I found these ones to be greasy and not good tasting at all. For appetizers the cheapest was a $13 shrimp cocktail and goes up from there for basic appetizers SMH. It's about $25 and up for seafood salad again SMH. and dinner Entrees are about $26 and up. I get it your trying to attract the hippsters in the area and it's working because they are the only ones dumb enough to pay these prices...meanwhile you can go down the street into any burrito spot and get a shrimp cocktail for $8 and it will be the most Delicious thing you've eaten. This place is a thumbs down for me.", "rating": 2, "date": "2018-10-08"}, {"excerpts": ["And what's a classic seafood menu without a shrimp cocktail? ", "Oh there it is. ", "So of course, I asked the waitress what she recommended. ", "Without hesitation, she said the Cioppino. ", "I must get the Cioppino. ", "Of course, it's the most expensive item on the menu. ", "What does she take me for?... ", "so I ordered the $32.95 Cioppino. ", "But before I get into that, let me tell you about the $4.25 cup of Boston Clam Chowder I ordered. ", "Thick and creamy enough to cut with a knife. ", "Believe it or not, I prefer it a little watery since it tastes closer to the sea that way, but I wasn't complaining except they charge extra for bread and butter. "], "author": "Ed U.", "review": "When I saw a for-reals seafood restaurant on Mission, I scratched my head. Now it could have been the bugs that may have infiltrated my scalp taking the 14 next to a sanitation-challenged passenger or maybe I was getting his dandruff by osmosis. But I just knew it was time for me to get off the bus and give it a try. I have to admit I got a little nervous since there was only one customer in the whole place at 7PM. Did people know something I didn't about the fish served here? Maybe even the guy with the dandruff and the gnat battalion knew. Nevertheless, I threw caution to the wind and stayed. Lots of shellfish on the menu and appetizers (photo: http://bit.ly/1ywM8Nm)\n\nAnd what's a classic seafood menu without a shrimp cocktail? Oh there it is. So of course, I asked the waitress what she recommended. Without hesitation, she said the Cioppino. I must get the Cioppino. Of course, it's the most expensive item on the menu. What does she take me for?... so I ordered the $32.95 Cioppino. But before I get into that, let me tell you about the $4.25 cup of Boston Clam Chowder I ordered. Thick and creamy enough to cut with a knife. Believe it or not, I prefer it a little watery since it tastes closer to the sea that way, but I wasn't complaining except they charge extra for bread and butter. Good thing it came with two baggies of oyster crackers which I used as a crunchy topping (photo: http://bit.ly/1xUgv0U).\n\nSo finally the Cioppino. A big flat bowl arrived with a pair of crusty garlic toast wedges on top. The rich red broth was slopping over the edge as there was an aquarium of shellfish: little neck clams, manila clams, mussels, huge prawns, crab legs, squid rings. All of it festooned with lemon slices and pepper (photo: http://bit.ly/11kTiJE). Pretty darn delicious though quite a chore to get through all the shells without getting the requisite bib. I'm the type that needs a bib for egg drop soup. I'm a splasher. For the plethora of bivalves and such, it was still no Swan Oyster Depot when it came to freshness, and I have to admit even the big bowl of fresh-off-the-ice sea life in the cioppino at Phil's Fish Market at Moss Landing still lingers in the memory. But hey, I'm coming back 'cause it's close.\n\nFOOD - 4 stars...plentiful cioppino, quite a variety of shellfish\nAMBIANCE - 3 stars...didn't scream fish house to me\nSERVICE - 3 stars...attentive at first but wavered as my meal went on and on\nTOTAL - 4 stars...come here for the cioppino if you don't want to hang in North Beach", "rating": 4, "date": "2014-11-20"}, {"excerpts": ["My ultimate favorites: fish and chips, scallops, shrimp cocktail, oysters and clam chowder (soo thick, creamy and yummy). ", "Oh and I can't forget to mention the cioppino... spicy and flavorful! ", "I've dragged all my family here several times and they have loved it."], "author": "Donald S.", "review": "One word is more than enough to describe this place: DELICIOUS! Do you love shrimp? If the answer is yes then this is the place to go! I do love seafood and I think that Mission Street Oyster Bar is the perfect place for me to satisfy my seafood cravings -- sometimes I even come here when I want to enjoy pasta along with the nice weather. My ultimate favorites: fish and chips, scallops, shrimp cocktail, oysters and clam chowder (soo thick, creamy and yummy). Oh and I can't forget to mention the cioppino... spicy and flavorful! I've dragged all my family here several times and they have loved it.", "rating": 4, "date": "2016-12-18"}, {"excerpts": ["I strongly suggest the crab cakes, shrimp cocktail and the caesar salad (which has actual toasted garlic bread as croutons, ", "how great?). "], "author": "Skye F.", "review": "First time visiting San Fran and couldn't wait to try some good seafood. The night before we went to an upscale seafood spot and it wasn't nearly as good as Mission Street Oyster Bar. The food here was awesome and definitely worth 5 stars. I'm a bit skeptical about fish but I loved everything we ordered. I strongly suggest the crab cakes, shrimp cocktail and the caesar salad (which has actual toasted garlic bread as croutons, how great?). The Rockefeller oysters were good too just a little too salty for my taste.\n\nI would have given this place stars but the service was super slow and pretty forgetful. We waited about 15 minutes at the bar before getting drinks. Granted, it was a busy Saturday night but from other reviews it seems like this is a bit of a trend here. \n\nOverall, a great restaurant and would love to come back on our next trip to SF!", "rating": 4, "date": "2016-06-21"}, {"excerpts": ["We also ordered a shrimp cocktail... "], "author": "Bruce C.", "review": "An oyster bar that doesn't know how to properly shuck oysters... *sigh*\n\nSandy and I were craving oysters after brunch this past Sunday. We wanted to hit up Anchor Oyster Bar but it was closed so we settled on MSOB since it was the only option within walking distance. \n\nThe place is really chill - high ceilings and mellow ambiance. When we walked in, we were excited to try their oysters.\n\nWe ordered two of each - Kumomotos, Miyagi and Kusshi oysters. All six half-shells came on a typical platter filled with ice, two lemon wedges, cocktail sauce, horseradish and vinegar. It looked great at first glance. http://www.yelp.com/user_local_photos?userid=CZ36wJqV-Xit758UaOr81A Everything was going well until we took down our first oysters, the Kumomotos. Man, they were so gritty and I knew immediately it's because they didn't shuck them correctly. Sandy said the same thing so I started becoming weary of the other ones. Well, the Miyagis and Kusshis were the same story. *sigh again*\n\nWe also ordered a shrimp cocktail... wait, it was a prawn cocktail. That was actually pretty good. The prawns were nice and plump. \n\nWe came for the oysters. We left in disappointment.", "rating": 2, "date": "2014-04-23"}, {"excerpts": ["Amazing and fresh shrimp cocktail and crab cocktail (like, an entire glass cup of amazing claw-meat), and the best spicy shrimp marinara pasta I've had in years.  "], "author": "Lita F.", "review": "I keep going back to this simple, non-pretentious and delicious place!  Love it.  Great oysters & garlic bread.  Amazing and fresh shrimp cocktail and crab cocktail (like, an entire glass cup of amazing claw-meat), and the best spicy shrimp marinara pasta I've had in years.  Also, the garlic crab is delish.\n\nIt's awesome that the place isn't crowded, but they do need to work on service issues.  Pretty good wine and beer selection at decent prices.\n\nLove this place!", "rating": 4, "date": "2013-06-23"}, {"excerpts": ["This was very good, a nice change from a traditional shrimp cocktail. ", "The crab meat was sweet and fresh. "], "author": "Bianca E.", "review": "I've been into this restaurant twice and thoroughly, THOROUGHLY enjoyed myself BOTH times. It was so good the first time that I had to go back again before we left SF. Their oysters were super fresh and absolutely delicious. I'd say, being a big fan of oysters, this was just like the more popular joints like Hog Island or Anchor Oyster Bar which was so refreshing that we didnt have to wait long for our food. \n\nWe ordered the crab with cocktail sauce for appetizer as well. This was very good, a nice change from a traditional shrimp cocktail. The crab meat was sweet and fresh. We really liked this a lot. \n\nFor our main course we ordered the seafood stew called the Frutti di Mare. This was AWESOME!! BY FAR, one of the best seafood stews I've ever had. That plus their garlic bread was a winning combination. Think vongole, minus the pasta, plus a whole lot of flavors and seafood. This isn't your plain butter/ white wine sauce....it was loaded with other ingredients that gave the dish a lot more complex flavors and added deliciousness. I really love it and would go back for more in a heartbeat. \n\nYou can't leave without having the Bomba for dessert as well. Its a mix of two sorbets (I believe a passionfruit and raspberry??) in a white chocolate shell. It truly is the BOMB! Had it both times :-)\n\nService was also really good. Our server Mel was very friendly and helpful and never screwed up. I'm not sure why people would complain about the service. This place isn't claiming to be a five star joint, relax about your expectations. Still, I think over all the service was perfect, I had no complaints for both occassions and there were a few other tables besides us as well. \n\nI will definitely be back the next time i'm in the city!", "rating": 5, "date": "2013-08-02"}], "side of vegetables": [], "steamed artichoke": [], "half avocado": [], "mission fried special": [{"excerpts": ["We ordered clam chowder, mission fried special, and the mission special. ", "When we asked our waitress which oysters were the fattest, she just listed all of the available oysters which wasn't very helpful. ", "Everything was pretty tasty, however, all of the oysters had some bits of the shell mixed in it which kinda ruined the experience. "], "author": "Renee Y.", "review": "Came here on a Thursday around 6pm and there was only a big group seated right in front of the door. I must say, this restaurant is located in a pretty ghetto run down area. My bf and I got off the 16th St Bart exit and while walking there, we witnessed multiple arguments in the middle of the sidewalk and the same happened as we were walking back to Bart. \n\nWe ordered clam chowder, mission fried special, and the mission special. When we asked our waitress which oysters were the fattest, she just listed all of the available oysters which wasn't very helpful. Everything was pretty tasty, however, all of the oysters had some bits of the shell mixed in it which kinda ruined the experience. I would definitely recommend the steam clams though cause they were finger licking tasty good!\n\nOverall, I much rather go to Hogs Island for my oyster fix.", "rating": 3, "date": "2014-06-13"}, {"excerpts": ["For the Mission Fried Special, the calamine is not bad, moist enough and crisp at the same time. ", "For the shrimp, they are a bit over done. ", "And last but not least, the fried oyster, it is average. ", "But overall this dish is a bit under season, add  a small amount of salt will help the favor of the plate."], "author": "V L.", "review": "I made a reservation through opentable yesterday since i have the opentable pay first-time user deal (promo code: pumpkin), so I have choose the Mission Street Oyster Bar and Seafood restaurant. When I first arrived the restaurant, I asked about the opentable pay detail. The person who served me told me that they didn't accept opentable pay and/or the promo since they didn't have any computer or wifi at all. But I believed that this info is not all true since the yelp and their menu both mention that they have wifi in the house. And if you are not having any internet service, how can you receive my online reservation order. I am totally not happy with my first time experience with MSOB or opentable. And now thanks to MSOB, my $20 promo is expired. \n\nBy the way, the food is ok... Oyster is fresh... we ordered 4 for each oyster, totally 16 of them, but they all tasted pretty much the same to me. I was expecting a little bit of change from different type of oyster. Totally no surprise. For the Mission Fried Special, the calamine is not bad, moist enough and crisp at the same time. For the shrimp, they are a bit over done. And last but not least, the fried oyster, it is average. But overall this dish is a bit under season, add  a small amount of salt will help the favor of the plate.", "rating": 2, "date": "2015-10-05"}, {"excerpts": ["The Mission Fried Special has shrimp, oysters, and calamari.  ", "The oysters were lightly breaded and delicious.  ", "I really liked them.  ", "I would go back just for the oysters!!"], "author": "C L.", "review": "Yummy seafood.  The Mission Fried Special has shrimp, oysters, and calamari.  The oysters were lightly breaded and delicious.  I really liked them.  I would go back just for the oysters!!", "rating": 4, "date": "2015-04-11"}, {"excerpts": ["We ordered the Mission Fried Special, garlic bread, Spicy Marinara Pasta, clam chowder, and ofcourse OYSTERS (lotsss of em).  ", "Everything was amazeballs!!  ", "The clam chowder was better than that one \"famous\" brand at Fisherman's Wharf but the oysters!!! ", "were just mouth watering-ly fresh and good!  ", "I don't remember all the names of them because we had about 10 different types that were mostly recommended by the owner or that he would just surprise us with.  ", "The best part of it was the quality didn't match the price.  ", "We had about 6.5 dozen oysters (all different price points) and ", "all that other food but our bill was no more than $200 (including a pretty decent tip).  ", "Definitely looking forward to eating here again on my next visit!"], "author": "Ann P.", "review": "I'm from OC and I come up to SF every couple months or so and everytime, I make sure to fill my tummy with some yummy fresh oysters before I head back home.  I wanted to go to my usual oyster bar but it was closed at the time so I found this place and decided to give it a  try.  Must've been good timing because they had just opened for lunch so we were the only customers.  The owner (I believe) was very friendly and nice and took his time answering our questions about the different oysters and gave some amazing recommendations.  We ordered the Mission Fried Special, garlic bread, Spicy Marinara Pasta, clam chowder, and ofcourse OYSTERS (lotsss of em).  Everything was amazeballs!!  The clam chowder was better than that one \"famous\" brand at Fisherman's Wharf but the oysters!!! were just mouth watering-ly fresh and good!  I don't remember all the names of them because we had about 10 different types that were mostly recommended by the owner or that he would just surprise us with.  The best part of it was the quality didn't match the price.  We had about 6.5 dozen oysters (all different price points) and all that other food but our bill was no more than $200 (including a pretty decent tip).  Definitely looking forward to eating here again on my next visit!", "rating": 5, "date": "2014-08-05"}], "seafood gazpacho": [{"excerpts": ["Seafood gazpacho and prawns cocktail were our appetizers and it was ", "oh so good. ", "We had oysters with sake and beer. ", "I forget the oysters we ordered but I loved it. ", "AMAZING! ", "The Cioppino was the best I ever tried. ", "Must try when you come here! ", "If you live around here, must try for oysters and seafood."], "author": "Janice P.", "review": "Def hidden gem in the Mission district. So much yumminess! Everything we ordered was perfectly delicious. Seafood gazpacho and prawns cocktail were our appetizers and it was oh so good. We had oysters with sake and beer. I forget the oysters we ordered but I loved it. AMAZING! The Cioppino was the best I ever tried. Must try when you come here! If you live around here, must try for oysters and seafood.", "rating": 5, "date": "2017-09-05"}, {"excerpts": ["Seafood gazpacho", ": On a hot day, this dish is refreshing and bright. ", "Enough chunks of seafood but good bites of cucumber and other veggies! \n", "2. ", "Cioppino: the best dish on our table! ", "It can easily feed 2 people. ", "Big chunks of fish, crab and other yummy seafood. ", "The broth is best soaked up with their delicious garlic bread.\n", "3. "], "author": "Calily B.", "review": "Great choice for seafood that is reasonably priced and great selection! I was staying in the Mission area and needed a place that was close and fast since we had a plane to catch in a few hours.\n\nWhen our group of six walked in around 2 p.m. on a Sunday, it was pretty quiet and there were only a few tables. My sister was worried, but I wasn't! \n\nWe ordered 2 dozen oysters (combo) to start. They had one Bay Area one, one from Vancouver and 3 from the east coast. All were fresh and briny. \n\nWhat else we ordered:\n\n1. Seafood gazpacho: On a hot day, this dish is refreshing and bright. Enough chunks of seafood but good bites of cucumber and other veggies! \n2. Cioppino: the best dish on our table! It can easily feed 2 people. Big chunks of fish, crab and other yummy seafood. The broth is best soaked up with their delicious garlic bread.\n3. Spicy Garlic Prawns: Large shrimpy garlicky goodness. Pretty straightforward. \n4. Calamari: nothing special - but solid.\n5. Steamed Clams: Clams in a white wine sauce.\n\nIf you're looking for an overall seafood restaurant without breaking the bank, this place is fantastic!", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["seafood gazpacho", ": my mother ordered it, I am not a fan ", "but I don't like cold seafood soups.  "], "author": "Chelsea W.", "review": "Being from the South Bay whenever I come to the city I want a great seafood spot that isn't a tourist trap and that isn't ridiculous in price.  I think this place was perfect.\n\nAlthough the neighborhood might put you off at first the food is well worth it.\n\nFrutti di Mare: I absolutely love love loved! this dish! $30 which seems pricey but you can definitely split it with two people and it is LOADED full of seafood.  comes with two big pieces of delicious garlic bread to soak up the juice\n\nclam chowder: it was good. nothing special or amazing but it was good.\n\nseafood gazpacho: my mother ordered it, I am not a fan but I don't like cold seafood soups.  However my mother really enjoyed it.\n\ngreat staff, very friendly and an added bonus, our waitress had an ipad full of pictures of all their dishes.  being a visual person I loved that and she had no problem standing there showing us as many dishes as we wanted until we made up our minds", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["Also tried the Seafood Gazpacho which I highly recommend. ", "The husband would stop by as he was dropping off food to other tables and show us each dish. ", "Everything looked delish!  ", "He gave us a free order of garlic bread which went well with the Gazpacho. ", "Def coming back for happy hour $1 oysters and the soup looks great on a foggy day!"], "author": "Stephanie T.", "review": "This place is a gem serving very fresh seafood. Went in for lunch today for an Oyster craving. Actually wanted Swans but forgot they are on summer break for a week. But very glad I got to try this place. Sat at the counter as the place was not very busy and wanted the feel of Swans. This place is run by a sweet Hispanic couple, husband runs the kitchen the wife waits tables. Had a dozen oysters: Kumamoto, Chesapeake Bay and another from Washington state. Also tried the Seafood Gazpacho which I highly recommend. The husband would stop by as he was dropping off food to other tables and show us each dish. Everything looked delish!  He gave us a free order of garlic bread which went well with the Gazpacho. Def coming back for happy hour $1 oysters and the soup looks great on a foggy day!", "rating": 5, "date": "2013-07-03"}, {"excerpts": ["The seafood gazpacho is great; TONS of shrimp, prawns, and crab jammed into a bowl of gazpacho. ", "We also got a seafood combo salad that also had tons of seafood and really fresh greens.\n", "Really relaxed atmosphere. ", "NO crowds lunchtime. ", "Incredibly fresh seafood."], "author": "Margie L.", "review": "This has quickly become a favorite place to grab oysters for Saturday lunch. Sure, we may miss out on happy hour prices, but we also miss out on the crowds.\nService has been great the 3 times we've gone, and the selection of oyster -- usually 5 or 6 -- has been really good. The oysters are consistently good, fresh and tasty. The seafood gazpacho is great; TONS of shrimp, prawns, and crab jammed into a bowl of gazpacho. We also got a seafood combo salad that also had tons of seafood and really fresh greens.\nReally relaxed atmosphere. NO crowds lunchtime. Incredibly fresh seafood.", "rating": 4, "date": "2013-04-06"}, {"excerpts": ["I highly recommend the Seafood Gazpacho: deeply filled with crab and deliciousness. ", "The house wine is fine, but i might suggest diversifying the wine selection overall, to match the special food."], "author": "Rachel S.", "review": "So totally non-pretentious, it has the airs of a sit down taco joint, which is kind of a sigh of relief in new Mission restaurants these days. But the food was fabulous. I highly recommend the Seafood Gazpacho: deeply filled with crab and deliciousness. The house wine is fine, but i might suggest diversifying the wine selection overall, to match the special food.", "rating": 4, "date": "2013-07-28"}, {"excerpts": ["The food was excellent -- we had oysters (a large variety), steamed mussels (delicious!), seafood gazpacho (I may go back specifically for that on a warm day) and an assortment of other dishes, all really fresh and yummy. ", "The service was friendly and timed well. ", "Overall, a wonderful place -- we'll definitely be back."], "author": "Joaquin S.", "review": "Went last night with some friends who had already visited. The food was excellent -- we had oysters (a large variety), steamed mussels (delicious!), seafood gazpacho (I may go back specifically for that on a warm day) and an assortment of other dishes, all really fresh and yummy. The service was friendly and timed well. Overall, a wonderful place -- we'll definitely be back.", "rating": 5, "date": "2015-03-27"}, {"excerpts": ["Seafood gazpacho $16.95 was excellent; it consisted of large chunks of crab along with prawns, white fish, calamari, & bay shrimps topped with very fresh avocado slices, sour cream, & celery stalk.  \n", "We also had the pasta special which consisted of linquine topped with prawms & sausage in a very delicious marinara sauce.  \n", "The wine list needs improvements, but what we had was good.\n", "Service was very good, friendly. ", "The waitress was accomodating, made very nice suggestions, as well as explained what we had ordered.  \n", "There is no dessert at this point.  \n", "The space is good with shades of blue on the wall, large bar, lots of good-sized tables.  ", "It still is pretty new so once there is artwork up, & the large empty front space filled in maybe with a host table & some trees, it will look much more organized & well-established.\n", "The only drawback is the location - Mission between 18th & 19th - which is a very sketchy block to say the least.\n", "We will go again, mostly likely at Happy Hour when there is $1 oysters."], "author": "Pam R.", "review": "This is such a wonderful addition, improvement on Mission St. \nThe chef/owner Fredy Gamez had been chef for 18 years at Anchor Seafood in the Castro so he definitely knows his stuff.  \n1 dozen oysters $2.95/each; the platter consisted 3 each very fresh, plump kinds of oysters.  \nFried oysters $10.95 were very tasty; yet skimpy as there was only 9 oysters on the plate. This could be filled in with a coleslaw or some greens.\nSeafood gazpacho $16.95 was excellent; it consisted of large chunks of crab along with prawns, white fish, calamari, & bay shrimps topped with very fresh avocado slices, sour cream, & celery stalk.  \nWe also had the pasta special which consisted of linquine topped with prawms & sausage in a very delicious marinara sauce.  \nThe wine list needs improvements, but what we had was good.\nService was very good, friendly. The waitress was accomodating, made very nice suggestions, as well as explained what we had ordered.  \nThere is no dessert at this point.  \nThe space is good with shades of blue on the wall, large bar, lots of good-sized tables.  It still is pretty new so once there is artwork up, & the large empty front space filled in maybe with a host table & some trees, it will look much more organized & well-established.\nThe only drawback is the location - Mission between 18th & 19th - which is a very sketchy block to say the least.\nWe will go again, mostly likely at Happy Hour when there is $1 oysters.", "rating": 4, "date": "2013-01-29"}], "fresh oysters": [{"excerpts": ["I can always count on Mission Oyster Bar for fresh oysters all year round. ", "I love how they have such a large selection of oysters. ", "Prices are great too, their regular oysters are $2 each and $3 for the premium selection. ", "I think I've tried all of their oysters but my favorite has to be the Blue Point. ", "So creamy and fresh. ", "They have a nice wine selection for pairing as well."], "author": "Lushi Z.", "review": "I can always count on Mission Oyster Bar for fresh oysters all year round. I love how they have such a large selection of oysters. Prices are great too, their regular oysters are $2 each and $3 for the premium selection. I think I've tried all of their oysters but my favorite has to be the Blue Point. So creamy and fresh. They have a nice wine selection for pairing as well.", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["The daily oyster menu had 5 varieties of fresh oysters and we got 3 of each. ", "My favorite was the Chesapeake Bay oysters. ", "A bit creamy and briny. ", "Yeeum. ", "Fyi, any month with an \"R\" in it is good for oysters. "], "author": "Toan D.", "review": "A gem for oyster and seafood lovers. \n\nLocated in the Mission district this family operated restaurant works hard at putting out fresh delicious foods, with friendly efficient service in a comfortable clean setting. \n\nWe went there at 7:30 on a Monday evening.  Immediately we were greeted with a smile from the owner's son as he seated us and helped us with our drinks before the waiter arrived. \n\nThe daily oyster menu had 5 varieties of fresh oysters and we got 3 of each. My favorite was the Chesapeake Bay oysters. A bit creamy and briny. Yeeum. Fyi, any month with an \"R\" in it is good for oysters. Usually the colder months. \n\nNext we got the Dungeness Crab Cocktail with avocado. Wow the crab meat was sooo fresh and moist.  Super clean and refreshing if you're watching your calories. It was so good we got another order. Obviously we're not counting OUR calories \n\nThe Spicy Shrimp Scampi did not disappoint. Five large shrimp cooked to perfection served with sautéed broccolini, carrots and potatoes. \n\nBut the star of the show was the Fresh Whole Dungeness Crab served in a delicious herbed broth.  The crab was so plumped and fresh and  the meat came easily off the shell. You can tell un-fresh crab because the meat will shrivel inside the shell and when you crack a claw, there is a bit of air space between the meat and shell. This meat was plump and moist. I could've drank the herbed sauce with a straw. \n\nThey have a good wine list and a nice selection of beers. It was a slow Monday night but nevertheless the service was grea\n\nWe will definitely be back. \n\n\nHappy Eating!!", "rating": 5, "date": "2017-12-19"}, {"excerpts": ["We started with oysters and it's awesome they have options for for fresh oysters! ", "Appetizer was fresh and so delicious! ", "Garlic bread and cioppino is what I order and they were in point. ", "Beer was cold, good music and vibe so overall it's a place I'd return to! ", "P.s. ", "in the mission make it feel relatable!"], "author": "Amanda M.", "review": "Just left the restaurant and had to review. I like restaurants that are open a little later which we walked in at 9pm. No problem seated, water right away. We started with oysters and it's awesome they have options for for fresh oysters! Appetizer was fresh and so delicious! Garlic bread and cioppino is what I order and they were in point. Beer was cold, good music and vibe so overall it's a place I'd return to! P.s. in the mission make it feel relatable!", "rating": 5, "date": "2018-07-08"}, {"excerpts": ["But I would recommend this place for their fresh oysters and the varieties of oysters they have."], "author": "Mey S.", "review": "Went here because I was craving fish, but sadly there wasn't a fish dish. However I did get the crab cakes which I thought was mediocre. My boyfriend and I got some raw oysters, let me just say I'm not a fan of raw oysters but I was feeling adventurous. So we ordered some I believe it was called bay point oysters and it was the first oyster that actually went down and it was actually well tasting enough that I had two! My boyfriend had the shrimp skewers not sure how good they were but he ate it all so I'm assuming it's good. But I would recommend this place for their fresh oysters and the varieties of oysters they have.", "rating": 4, "date": "2018-02-20"}, {"excerpts": ["Service was fast and food was delicious as expected with fresh oysters. ", "We would've stayed longer to try out more items but we still had our poor oysters & clams in bags sitting next to us from Sun Fat Seafood Company......fearfully awaiting their fate when they got home. ", "Poor little guys had to hear us gushing and savoring their bivalve cousins the entire time. ", "We're terrible. ", "I'm probably going to hell."], "author": "Cin T.", "review": "We don't mess around around. We love oysters and were determined to get oyster-wasted on my last night in town. \n\nRemember my fun oyster shopping experience at Sun Fat Seafood Company (http://www.yelp.com/biz/sun-fat-seafood-company-san-francisco?hrid=xupN2YDs8PNGFuC-0xVi-w&utm_campaign=www_review_share_popup&utm_medium=copy_link&utm_source=(direct))? \nMission Street Oyster Bar happened just 30 mins after that. \nWith our fresh live oysters bagged & tagged, we walked down a few blocks to the MSOB for happy hour oysters & wine. Oyster pre-gaming at its best. \n\n* Open Monday thru Sunday 12:00 P.M. to 10:00 P.M.\n\n* Happy Hour:\n- M-F $1.50 oysters from 12:00 P.M. to 6:00 P.M.\n- Sat-Sun $2.00 oysters ALL DAY!\n\nThey have 5 varieties of oysters daily. These were the specials just for that day:\n\nFANNY BAY: Meaty larger oysters with a nice milky smooth finish. It's a bit firmer than your kumies or miyagi oysters, but still fresh tasting with a light crisp finish.\n\nCHESAPEAKE BAY: Sweet and creamy. Not very briny but still tasty.\n\nKUMAMOTO: These small but plump kumies are one of my favs to eat. Buttery succulent fruity flavor that resembles a mix of cucumbers and honeydew melon. Just lovely!\n\nBLUE ROCK POINT: Medium-sized oysters that is great for oyster noobs. I just like that it's nice and salty.\n\nMIYAGI: Up there as my other favorite with the kumamoto oyster. Mildly briny and just perfect with a squirt of lemon. \n\nWe chose to start off with the 10 mix ($15, $1.50 each). We just wanted to sample 1 each before deciding which ones to order more of for the next round.\nhttp://bit.ly/1MXku2u\n\nEnjoyed every one of them so we repeatedly the same order for our 2nd platter, but added 2 additional Miyagi Oysters to make it a full dozen ($18). \nhttp://bit.ly/1LFVzyw\n\nCALAMARI ($13.95): \nThere was a good amount of calamari rings but only a couple pieces of tentacles (the best part!). The crispy thing batter had a terrific crunch, while the calamari still retained its tenderness on the inside. \nhttp://bit.ly/1PjPE9Y\n- Served with a rich tangy tartar sauce and house cocktail sauce. My friend and I both preferred the tartar sauce, since the cocktail sauce was blah without the much needed horseradish.\n\nWe each had a couple rounds of their happy hour wines to go along with our oysters. \n\n Tempranillo ($6): My friend Kiko loves her reds so our server suggested she try a more diverse food-pairing wine to go along with our meal since we're having oysters and fried calamari. It's mildly acidic with hints of cherries and plum. She loved it so much that she asked for another one.\n\nHouse white ($7): I just got a chardonnay. Just a clean, crisp white wine to go with my freshly-shucked oysters. Yep, I'm boring like that. Step.\n\nService was fast and food was delicious as expected with fresh oysters. We would've stayed longer to try out more items but we still had our poor oysters & clams in bags sitting next to us from Sun Fat Seafood Company......fearfully awaiting their fate when they got home. Poor little guys had to hear us gushing and savoring their bivalve cousins the entire time. We're terrible. I'm probably going to hell.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["We ordered a dozen fresh oysters on ice which were great.\n", "For entrees, I had the pasta with shrimp in a light tomato cream sauce. ", "The sauce was delicious and there were lots of large shrimp.  ", "We all liked the garlic toast!\n", "My companions both had the frutti de mare which was filled with clams, mussels, crab, white fish and large shrimp.\n", "I also had a lemonade while they had white wines.\n", "This restaurant is great and we will return many more times!"], "author": "Philip C.", "review": "Three of us went here for dinner on Saturday night. It was not crowded so we were seated immediately. We had been here once before so we knew what we wanted.\nWe ordered a dozen fresh oysters on ice which were great.\nFor entrees, I had the pasta with shrimp in a light tomato cream sauce. The sauce was delicious and there were lots of large shrimp.  We all liked the garlic toast!\nMy companions both had the frutti de mare which was filled with clams, mussels, crab, white fish and large shrimp.\nI also had a lemonade while they had white wines.\nThis restaurant is great and we will return many more times!", "rating": 5, "date": "2017-01-01"}, {"excerpts": ["If you're looking for fresh oysters, bomb pasta & friendly/quick service, this is THE SPOT!"], "author": "Brenda E.", "review": "I live in the Mission and just happened to stumble upon this place and OMG I am so glad I did! If you're looking for fresh oysters, bomb pasta & friendly/quick service, this is THE SPOT!", "rating": 5, "date": "2017-12-29"}, {"excerpts": ["Great variety and prices for fresh oysters. ", "Also had the world famous garlic crab. ", "Don't know much it will be until we see the bill. ", "Definitely worth the trek here. ", "The garlic bread was yummy too. ", "We made reservations but didn't need for opening time on a Saturday."], "author": "Linda Y.", "review": "Found this place on Yelp. Great variety and prices for fresh oysters. Also had the world famous garlic crab. Don't know much it will be until we see the bill. Definitely worth the trek here. The garlic bread was yummy too. We made reservations but didn't need for opening time on a Saturday.", "rating": 5, "date": "2017-07-01"}, {"excerpts": ["Different choices for fresh oysters. ", "Clean and nice services. ", "Not too crowded like other busy restaurant at Valencia. ", "Good choice for family and friends."], "author": "L C.", "review": "Different choices for fresh oysters. Clean and nice services. Not too crowded like other busy restaurant at Valencia. Good choice for family and friends.", "rating": 4, "date": "2018-04-27"}, {"excerpts": ["My friend brought me to this seafood spot in the mission one labor-free day because I wanted to explore the mission area of San Francisco and I suppose what better way than to grab fresh oysters on a sunny day as well!\n\n"], "author": "Tiffany D.", "review": "My friend brought me to this seafood spot in the mission one labor-free day because I wanted to explore the mission area of San Francisco and I suppose what better way than to grab fresh oysters on a sunny day as well!\n\nI do love their raw oysters and I would recommend to just order that.  They offer 3 varieties on oysters.  When I was there, they were: Chesapeake, French Kiss and Miyagi.  My most favorite one was the Chesapeake!  It had a distinct, seawater flare that I liked about it very much.  The French Kiss and Miyagi does so as well, but it wasn't as strong as the Chesapeake.\n\nIt was $2 per oyster when we went there during non-happy hours.  Happy hours are everyday and even weekends, between 3pm-6pm.  When you get there for happy hour, it is a buck per oyster.  I would totally go on a weekend between those hours!  \n\nThey offer other seafood entrees as well, but nothing really captivated my attention besides the raw oysters.  On top of that, their seafood plates are on the pricey side.  You're talking about catering to the mission area as well.  \n\nOther than the raw oysters here, I am passing through Mission!", "rating": 4, "date": "2013-09-05"}, {"excerpts": ["Four solid stars for the fresh oysters and offering three varieties: Fannie Mae, Chesapeake Bay and Miyagi (my fav) ", "http://bit.ly/XiwjZk. ", "DO COME FOR THE OYSTERS! ", "They were super silky and sweet but a mignonette would have been better than the accompanying cocktail sauce. ", "Kudos to Mission Oyster Bar's awesome oyster supplier. "], "author": "Cherylynn N.", "review": "2.5 STARS\n\nIt surprises me how many people hate hipsters. A quick Google search and I found hundreds of websites and blogs with people professing their hatred for them. Geez, harsh much? Admittedly, I'm not a fan of hipsters yet I regularly find myself in \"the\" hipster mecca of San Francisco: The Mission. \n\nI'm such a hypocrite. So does that make me a hipster too? \n\nIf only I could shoe horn my way into skinny jeans without looking like I have a camel toe. Anyhow...\n\nHipster mecca aside, The Mission is the breeding ground for the newest and hottest restaurants in San Francisco. Instead of going to Hog Island at the Ferry Building, my friends and I decided to check out the new oyster bar in The Mission for happy hour. \n\nWe were disappointed. My friends suggested 2 stars but I'll be nice and round up. \n\nI absolutely adore Anchor Oyster Bar (my review: http://www.yelp.com/biz/anchor-oyster-bar-san-francisco#hrid:p84AaAmuoJL-9jFCU8Esfg) and after reading that Mission Street Oyster Bar's owner worked there for 18+ years, I expected the same caliber in terms of food quality especially with their Fisherman Wharf prices. Not only was the food lackluster, the service was unorganized and snail paced, and the tacky teal ambiance left little to be desired.   \n\nIt seems the owner bought a taqueria and just added two flat screen TVs. Viola! A hipster \"oyster bar\" is born. Mission Oyster Bar is not an \"oyster bar\" per say as there's no seafood display and all the shucking is done in the kitchen in the back. It's very bare boned and all the empty space makes it uninviting. \n\nThe Happy Hour menu (everyday 3 pm - 6 pm) consists of $1 oysters (3 varieties), $2.50 draft beers, and one house wine for $7.  \n\nFour solid stars for the fresh oysters and offering three varieties: Fannie Mae, Chesapeake Bay and Miyagi (my fav) http://bit.ly/XiwjZk. DO COME FOR THE OYSTERS! They were super silky and sweet but a mignonette would have been better than the accompanying cocktail sauce. Kudos to Mission Oyster Bar's awesome oyster supplier. Unfortunately, all the praising stops there. \n\nWe decided to order a small sampling of the menu in the event we wanted to come back for dinner. The Clam Chowder ($5.50) tasted generic http://bit.ly/Y3999u. It was watery, bland, and there was barely any clams in it. Not only did it take 45 minutes to arrive, it arrived lukewarm. The much raved about Garlic Bread ($4.95) wasn't garlicky and was over toasted to a hard crouton http://bit.ly/YzSDwQ. The mediocre Dungeness Crab Cakes ($11.95) were made with minced crab meat not lump crab and similar to what I've bought at Trader Joe's http://bit.ly/15iWUZB. \n\nAnd then there's the service. The restaurant is understaffed and the staff lacks training. One waitress for 10 tables and the bar is not enough. We were never given basic things like plates, forks or spoons nor were any of the oysters described; they were just plopped onto our table. Our additional rounds of oysters were wrong (we wanted miyagis only) and came without lemon and oyster forks. Again, there was the 45 minute wait for lukewarm clam chowder which is inexcusable after two reminders to our waitress and one of the chefs.\n\nAfter being opened for 2 months, I would have expected for Mission Street Oyster Bar to have ironed out major kinks. Seems like they haven't. \n\nI will leave Mission Street Oyster Bar for the hipsters to have at it....", "rating": 3, "date": "2013-02-27"}, {"excerpts": ["Fresh oysters, helpful waitress. ", "We came when they just opened for the day and it was quiet. ", "But when we left the place is full of people.. would be coming back for sure"], "author": "I P.", "review": "So happy to found this place around my neighborhood. Fresh oysters, helpful waitress. We came when they just opened for the day and it was quiet. But when we left the place is full of people.. would be coming back for sure", "rating": 5, "date": "2017-01-10"}, {"excerpts": ["Ordered the daily pasta with prawns, spicy prawn scampi and fresh oysters during happy hour. ", "Everything was amazing!"], "author": "Cherri Y.", "review": "Best seafood meal ever! Great service. \n\nOrdered the daily pasta with prawns, spicy prawn scampi and fresh oysters during happy hour. Everything was amazing!", "rating": 5, "date": "2015-12-16"}, {"excerpts": ["My friend and I tried their fresh oysters at a price of $2 each. ", "Unfortunately, their $1.50 happy hour deal does not apply to Friday. "], "author": "Tiffany C.", "review": "After spending the morning hiking at Lands End, my friend and I were on the hunt for oysters! We stumbled across this restaurant on Yelp and made the ~30 minute drive from Sea Cliff to the Mission District. Luckily, there was ample metered street parking and we snagged a spot directly in front of the restaurant. \n\nThe staff was very friendly and welcoming. The restaurant was clean and neat but slightly chilly with the door left open.\n\nMy friend and I tried their fresh oysters at a price of $2 each. Unfortunately, their $1.50 happy hour deal does not apply to Friday. Nevertheless, the oysters were very delicious, though the horseradish was not very potent. \n\nWe decided to share the Steamed Shell Fish Combination which was around $20. This was ridiculously good! It left the two of us satisfied and very stuffed. This dish included shrimp, clams, and mussels in a wonderful sauce. The sauce definitely made the dish. It was savory with a hint of sweetness. I'm not sure what ingredients were used in concocting this wonderful broth but there were tomatoes and a variety of fragrant spices. \n\nThe total bill including tip for two people was around $40. As my friend and I were so full we could barely walk, it was very much worth the money!", "rating": 4, "date": "2014-06-04"}, {"excerpts": ["Great variety of fresh oysters reasonably priced. ", "Clam chowder was of the right consistency - not watery and not too thick. ", "Service was even on a quiet night. ", "Would recommend eating there during off-peak period and not be rushed."], "author": "Smjoe F.", "review": "Took our young adult daughter there to celebrate her B-Day shortly before X-mas. She had been there several times with her friends. Great variety of fresh oysters reasonably priced. Clam chowder was of the right consistency - not watery and not too thick. Service was even on a quiet night. Would recommend eating there during off-peak period and not be rushed.", "rating": 4, "date": "2017-01-18"}, {"excerpts": ["The green lips are excellent\nGreat selection of fresh oysters \n", "Garlic bread tasty\nClam chowder thin base, any clams?\n", "I'll keep coming back, I love this place!!!"], "author": "Travis B.", "review": "The green lips are excellent\nGreat selection of fresh oysters \nGarlic bread tasty\nClam chowder thin base, any clams?\nI'll keep coming back, I love this place!!!", "rating": 5, "date": "2014-02-08"}, {"excerpts": ["Super fresh oysters and delicious spicy shrimp.  ", "Hubby loved the garlic dungeoness crab...."], "author": "Jillian S.", "review": "Well worth the walk from the hotel...I would suggest using Market and looping around as Mission is a sketchy walk.  Super fresh oysters and delicious spicy shrimp.  Hubby loved the garlic dungeoness crab....", "rating": 5, "date": "2015-06-07"}, {"excerpts": ["We tried three varieties of  fresh oysters (eastpoint, miyaki, and pacific inlet). "], "author": "Sophie C.", "review": "Sorry Woodhouse, I've found a new place for aphrodisiacs. \n\nI read about Mission Street Oyster Bar's daily happy hour from 3-6 pm ($1 oysters and $2.50 draft beer.) SOLD! \n\nY'know how some deals are TOO good to be true? Well, MSOB is the real deal. Oyster selections change daily and on our first dining experience, we chatted with the chef/owner, Freddy. Freddy's an affable and knowledgeable guy. After mentioning my penchant for Kumamoto oysters, he surprised us with two on the house. Creamy sweet delight! \n\nWe tried three varieties of  fresh oysters (eastpoint, miyaki, and pacific inlet). Each type of oyster had its own distinct characteristics and the best part was that everyone in our group liked different ones (which only shows that taste is indeed subjective). \n\nWe stopped for happy hour and stayed for dinner.  Service is excellent and the food is delicious. Highly recommend the spicy garlic prawns and the garlic crab (the white wine sauce is delicious).\n\nNote: During our visit, MSOB was opened for a week so Freddy's working out the kinks typical of any new business. For example, the menu had misspellings which gave us a few laughs.", "rating": 4, "date": "2013-01-17"}, {"excerpts": ["Get your cioppino, fresh oysters, shrimp, beer and wine at cafe tables. ", "OH, and yum, the cheesy garlic bread  dipped in their sautéed muscles. "], "author": "Betsy F.", "review": "We stopped in while waiting for a table across the street and realized we'd stumbled upon a gem. \n\nFinally a quality, casual spot to grab food in the mission --and without a line out the door. Not to mention, they're serving something different. You wont find \"New American\" food in a reclaimed wood and iron atmosphere here. This is what you hope every west coast tourist seafood spot will be like. Mission Oyster Bar is comparable to a classic east coast seafood joint. Nothing fancy folks, It's got the casual walk-in atmosphere that encourages a quick oyster and a beer, or a large group looking to eat a full meal and get their seafood fix without trekking over to North Beach or needing reservations in the FiDi. Get your cioppino, fresh oysters, shrimp, beer and wine at cafe tables. OH, and yum, the cheesy garlic bread  dipped in their sautéed muscles. 4 stars instead of 5 only because the service could have been a bit better.\n\nWelcome, Mission Oyster Bar, I will be back very soon.", "rating": 4, "date": "2015-02-26"}, {"excerpts": ["The 3 of us shared the Mission Special full order, cioppino, and a few fresh oysters. ", "We all loved it. ", "My super-particular Asian mama said the food quality & freshness was A-1!! ", ":)\nService & oldies music were also awesome. ", "This place was a gem in a kinda Blah neighborhood, so have patience finding a parking spot & come here!"], "author": "Audrey G.", "review": "Visiting SF from Socal with the parents for the wknd. Came here for lunch. The 3 of us shared the Mission Special full order, cioppino, and a few fresh oysters. We all loved it. My super-particular Asian mama said the food quality & freshness was A-1!! :)\nService & oldies music were also awesome. This place was a gem in a kinda Blah neighborhood, so have patience finding a parking spot & come here!", "rating": 5, "date": "2015-02-07"}, {"excerpts": ["They offered 5 kinds of fresh oysters to choose from, which is a better deal than Water Bar that only offered a small miyagi one. ", "Potato Wedges were paprika-ish and crispy. ", "Very Nice.\n", "This place will be a keeper for $1 oysters for me!"], "author": "Joelle K.", "review": "This Oyster Bar had been on my list for, like, ever but its location kept pushing me away. Not that I don't like Mission, I love Mission. Food in Mission is fab but parking in Mission is a biatch.\nBut since it was raining this morning, my bf and I figured that everyone would rather stay in and order for a delivery and parking shouldn't be a problem, so we came here. \nThe ambience is pretty contemporary; not as fancy as Water Bar, not as touristy as Swan Oyster Depot, but it looks just fine. The staffs were super nice.\nWe ordered 24 $1 oysters which were very fresh and briny. They offered 5 kinds of fresh oysters to choose from, which is a better deal than Water Bar that only offered a small miyagi one. Potato Wedges were paprika-ish and crispy. Very Nice.\nThis place will be a keeper for $1 oysters for me!", "rating": 5, "date": "2014-02-06"}, {"excerpts": ["A new spot to get fresh oysters on a half shell. ", "Plenty of seating and very friendly staff!"], "author": "Carlos G.", "review": "A new spot to get fresh oysters on a half shell. Plenty of seating and very friendly staff!", "rating": 4, "date": "2013-08-25"}, {"excerpts": ["Amazing FRESH OYSTERS and STEAMED CLAMS.  "], "author": "Mark S.", "review": "I pass by Mission Street Oyster everyday.  I finally went in with my partner.  Amazing FRESH OYSTERS and STEAMED CLAMS.  And the garlic bread AMAZING.   \n\nThe staff were very pleasant.  Its not trendy.  Its the real Mish.", "rating": 5, "date": "2013-07-01"}, {"excerpts": ["We started with their $2.50 fresh Oysters!  ", "Swear, we could of ate those all night! ", "We also got the Oyster shooters, they were in a bloody mix! ", "For a main I got a ceasar salad and the special fish dinner that night (totally blanking what fish) but it came with roasted potatoes and veggies. ", "The l boyfriend got the  Seafood Cioppino which was awesome, i was a little bit jealous. ", "LoL! ", "Definately a new date spot!"], "author": "Chelsey M.", "review": "Had a date night with the boyfriend the other night. We absolutely love this place!! Everything was great!! I love seafood with a passion!!! We had quiet a bit of food to eat. We started with their $2.50 fresh Oysters!  Swear, we could of ate those all night! We also got the Oyster shooters, they were in a bloody mix! For a main I got a ceasar salad and the special fish dinner that night (totally blanking what fish) but it came with roasted potatoes and veggies. The l boyfriend got the  Seafood Cioppino which was awesome, i was a little bit jealous. LoL! Definately a new date spot!", "rating": 5, "date": "2015-02-26"}, {"excerpts": ["Excellent seafood and fresh oysters to boot.  ", "The clam chowder was filled with hand cut clams and was the perfect consistency.  ", "I ordered the stuffed sole and the chef hit it out of the park.  ", "I wish I lived close to this place so I could dine there more often, sigh."], "author": "David S.", "review": "This is a gem in a neighborhood filled with coal.  Excellent seafood and fresh oysters to boot.  The clam chowder was filled with hand cut clams and was the perfect consistency.  I ordered the stuffed sole and the chef hit it out of the park.  I wish I lived close to this place so I could dine there more often, sigh.", "rating": 4, "date": "2014-05-19"}, {"excerpts": ["Fresh oysters, great draft beer--and the world's best cioppino, big enough for two people. ", "It doesn't get better than this. ", "The mystery is why the place is nearly empty during the week, when there should be lines out the door."], "author": "David K.", "review": "Fresh oysters, great draft beer--and the world's best cioppino, big enough for two people. It doesn't get better than this. The mystery is why the place is nearly empty during the week, when there should be lines out the door.", "rating": 5, "date": "2015-10-27"}, {"excerpts": ["Get the whole garlic crab and go during happy hour for cheap fresh oysters. ", "This place is an undiscovered gem - forget the lines at Swan - go here!"], "author": "Joel B.", "review": "Get the whole garlic crab and go during happy hour for cheap fresh oysters. This place is an undiscovered gem - forget the lines at Swan - go here!", "rating": 4, "date": "2013-11-17"}, {"excerpts": ["Besides your dozen fresh oysters, you get a sizeable bowl of steamed clams and 4 large prawns in a wonderful savory broth, perfect for dipping your scrumptious GARLIC BREAD! ", "Another excellent entree to share!"], "author": "Lisa M.", "review": "I have now been here many times since the last review, and while I'm an oyster devotee, I've tried other things on the menu. If I good 6 stars I would, the food is that good! Very flavorful , large portions, and always fresh. I have only had excellent meals here.\n\nCioppino - Amazing! Chock full of fresh seafood, fresh herbs, and the most delish cioppino broth I've ever had. Easily an entree for two.\n\nFish & Chips - Fantastic, and I'm not a fish & chips lover. Perfectly crispy batter, not greasy at all, fresh fish and awesome  fries.\n\nOysters & steamed clams & prawns special - Got this on the recommendation of our server and I'm so glad we did. Besides your dozen fresh oysters, you get a sizeable bowl of steamed clams and 4 large prawns in a wonderful savory broth, perfect for dipping your scrumptious GARLIC BREAD! Another excellent entree to share!", "rating": 5, "date": "2014-01-16"}, {"excerpts": ["Yummy and fresh oysters and crab."], "author": "Matthew B.", "review": "Great value, big servings, and friendly service. I recommend this spot for happy hour every day of the week. Yummy and fresh oysters and crab.", "rating": 5, "date": "2013-05-07"}, {"excerpts": ["Good, fresh oysters and a healthy serving of seafood. ", "Give it shot."], "author": "Ben E.", "review": "I was pleasantly surprised. Good, fresh oysters and a healthy serving of seafood. Give it shot.", "rating": 4, "date": "2014-08-06"}, {"excerpts": ["every couple months or so and everytime, I make sure to fill my tummy with some yummy fresh oysters before I head back home.  ", "I wanted to go to my usual oyster bar ", "but it was closed at the time ", "so I found this place and decided to give it a  try.  ", "Must've been good timing because they had just opened for lunch ", "so we were the only customers.  ", "The owner (I believe) was very friendly and nice and took his time answering our questions about the different oysters and gave some amazing recommendations.  "], "author": "Ann P.", "review": "I'm from OC and I come up to SF every couple months or so and everytime, I make sure to fill my tummy with some yummy fresh oysters before I head back home.  I wanted to go to my usual oyster bar but it was closed at the time so I found this place and decided to give it a  try.  Must've been good timing because they had just opened for lunch so we were the only customers.  The owner (I believe) was very friendly and nice and took his time answering our questions about the different oysters and gave some amazing recommendations.  We ordered the Mission Fried Special, garlic bread, Spicy Marinara Pasta, clam chowder, and ofcourse OYSTERS (lotsss of em).  Everything was amazeballs!!  The clam chowder was better than that one \"famous\" brand at Fisherman's Wharf but the oysters!!! were just mouth watering-ly fresh and good!  I don't remember all the names of them because we had about 10 different types that were mostly recommended by the owner or that he would just surprise us with.  The best part of it was the quality didn't match the price.  We had about 6.5 dozen oysters (all different price points) and all that other food but our bill was no more than $200 (including a pretty decent tip).  Definitely looking forward to eating here again on my next visit!", "rating": 5, "date": "2014-08-05"}], "boston clam chowder soup": []}