{"picnic club": [{"excerpts": ["Today I tried the Picnic Club and it was really great as well. ", "Truly an awesome place to grab a quick bite. ", "You won't be sorry. ", "They have limited seating so be prepared to have to grab and go if there are not any seats available. ", "I hope to try a salad next time ", "but man it's hard to pass up a sandwich."], "author": "Autumn C.", "review": "ABT is awesome and what I typically order. The Focaccia bread is divine. Today I tried the Picnic Club and it was really great as well. Truly an awesome place to grab a quick bite. You won't be sorry. They have limited seating so be prepared to have to grab and go if there are not any seats available. I hope to try a salad next time but man it's hard to pass up a sandwich.", "rating": 5, "date": "2017-12-15"}, {"excerpts": ["I got a picnic club with added avocado ", "and it was one of the most delicious treats I've ever had. \n", "People came spilling in with orders right after us and they were taking phone orders too, so the wait was a little ridiculous for 3 sandwiches. ", "There's not a lot of space inside but they do have a bathroom and water, ", "so there's a plus. \n", "Would definitely come back!!"], "author": "Amy R.", "review": "Came here on a whim while hungry in the mission and it was so awesome. I do not typically pay for sandwiches or seek them out when I'm out, but damn, I'd come back here in a second. \nI got a picnic club with added avocado and it was one of the most delicious treats I've ever had. \nPeople came spilling in with orders right after us and they were taking phone orders too, so the wait was a little ridiculous for 3 sandwiches. There's not a lot of space inside but they do have a bathroom and water, so there's a plus. \nWould definitely come back!!", "rating": 4, "date": "2016-01-10"}, {"excerpts": ["*Picnic Club (Rotisserie chicken salad w/ bacon & cheddar)\n", "*", "Hainan Chicken (Garlic rotisserie chicken w/ cucumber & picnic spread)\n"], "author": "Cherylynn N.", "review": "One of my favorite FOBanese dishes is Hainan Chicken Rice. Something about the simply boiled chicken, deliciously oily rice and aromatic ménage a trios of sauces (chili, ginger and dark soy) makes me...uhh, makes me happy. Sorry, going to keep it PG-rated for once.\n\nSo naturally seeing the Hainan Chicken Sandwich on Mission Picnic's FB page almost made me keel over. A FOBanese American Sandwich? I'm all over it! I hoped into my imaginary rice rocket and vroomed vroomed my way to Mission Picnic yesterday while bumping to Stevie B.\n\nMission Picnic is a new sandwich shop serving seasonal sandwiches; some with an Asian twist. They're currently in their soft opening stage and have an awesome deal of 50% off your purchase (till today). Their Grand Opening is tomorrow.\n\nFormerly the Corazon Juice Bar, Mission Picnic is a tiny shop with just four two-top tables so this is more of a to-go place.\n\nFor their soft opening, they had 6 sandwiches available (~$8-9):\n*Picnic Club (Rotisserie chicken salad w/ bacon & cheddar)\n*Hainan Chicken (Garlic rotisserie chicken w/ cucumber & picnic spread)\n*San Franciscan (Hot pastrami, turkey & provolone)\n*Devil's Egg (Market boiled egg, bacon & provolone)\n*MozzaPesto (Mozzarella, basil, tomato & pesto aioli)\n*The King (Peanut butter, bananas, honey chocolate & frosted flakes).\n\nThey'll also have soups and salads in the future. \n\nMake sure to try one of their refreshing fruit shakes (pineapple, watermelon or strawberry - $2.75). I had the watermelon which was more like a fresh watermelon juice slushy but it was really good (no sugar added).\n\nCASH ONLY.\n\nThe Hainan Chicken Sandwich was nicely packed with tenderly moist garlic rotisserie chicken, sliced cucumbers, tomato, lettuce & picnic spread on dutch crunch: http://bit.ly/171yYMd. The picnic spread of garlic and parsley was slathered onto the bread before toasting so all that garlicky goodness soaked into every nook and cranny. So yummy!\n\nWhile the sandwich was solid and made with top-notch ingredients, it was more like a garlic pesto-ish chicken sandwich to me. I was hoping it would be more FOBanese. There was no ginger in the spread and ginger is what makes hainan chicken \"hainan\" imo. And, although the dutch crunch had a deliciously crunchy mottled crust, I think a less carb heavy bread like a baguette would let the ingredients shine for this particular sandwich. Just my two cents.\n\nOne of owners, Sterling was super nice and encouraged customer feedback which is always a sign to build customer loyalty and remain competitive in this marketplace. I hope he does see this and offers several FOBanese sandwich options in the future including vegan options for my Yelpie friend John B.  who's always in the hood and for all the surrounding PBR drinking and camel toe inducing skinny jean lovers of course.\n\nMission Picnic has a lot of potential and this was just their soft opening so I can't wait to see what other specialty sandwich ideas they have up their sleeve...\n\nPerhaps a pulled pork with apple wasabi slaw sandwich, a Tonton sesame marinated tofu w/ portobello mushroom sandwich, a longanisa banh mi or a loco moco sloppy joe? I can go on and on.\n\nNow only if I can come up with ideas like that in my field of work instead of looking like a deer caught in headlights all the time...", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["My favorite sandwich is the Picnic Club. ", "Layers of tasty goodness: chicken, bacon, lettuce, cheese, pickles, mustard, and mayo. ", "And the bread! ", "No sandwich is complete without a freshly toasted bun. ", "Mission Picnic offers a large selection of speciality sandwiches, unique to the store, of which you just have to try one of each. ", "It also features other picnic items, such as salads, chips, blended juices, and cookies. ", "Sandwich prices are a bit steep (about $9-$10 including tax), but Mission Picnic sandwiches make it up in deliciousness. ", "Per usual, I ordered the Picnic Club and it was as delicious as I remembered. ", "The counter server was Kathleen--one of the sweetest girls you'll ever meet. ", "My sandwich was prepared by Sterling, the owner, a sandwich connoisseur, and, I must say, a little bit of a flirt. "], "author": "Joanna S.", "review": "Mission (Picnic) Accomplished\n\nThis past summer, I interned at a landscape architecture firm smack dab in the middle of the Mission. Known for its eclectic food--from taquerias to dosa places--the Mission is a mecca for unique flavors. However, working at an architecture firm, I often needed quick and easy meals on the go without compromising taste or nutrition. A co-worker suggested that I try Mission Picnic, and oh boy, I was not disappointed. \n\nMy favorite sandwich is the Picnic Club. Layers of tasty goodness: chicken, bacon, lettuce, cheese, pickles, mustard, and mayo. And the bread! No sandwich is complete without a freshly toasted bun. Mission Picnic offers a large selection of speciality sandwiches, unique to the store, of which you just have to try one of each. It also features other picnic items, such as salads, chips, blended juices, and cookies. Sandwich prices are a bit steep (about $9-$10 including tax), but Mission Picnic sandwiches make it up in deliciousness. You definitely aren't going to get a $5 footlong here (and why would you want to?)\n\nThe storefront is small with a few tables and chairs, but its presence is very strong. With its hand written menu and funky decor, it's represents the Mission very well.\n\nI was in the Mission today and wanted to visit all the food places I missed while I was away. One of the first to come to mind was Mission Picnic. Per usual, I ordered the Picnic Club and it was as delicious as I remembered. The counter server was Kathleen--one of the sweetest girls you'll ever meet. My sandwich was prepared by Sterling, the owner, a sandwich connoisseur, and, I must say, a little bit of a flirt. Also, shout out to Brian who was counting the till as I was complimenting the staff.\n\nBeing back at Mission Picnic reminded me of how small businesses can have a strong impact on a community. A sandwich is just a sandwich until it represents something more. Food is much more than about sustenance; it's about an experience. \n\nSo if you're hankering for a really, really good sandwich in the Mission District, scoot your butt to 22nd Street between Valencia and Mission, grab yourself a sandwich, have a picnic in Dolores Park, and enjoy!", "rating": 5, "date": "2013-10-12"}, {"excerpts": ["on brioche, Picnic Club (chicken with chipotle) on ciabatta and Hainan Chicken on dutch crunch.\n\n", "So instead I ordered his recommendation (his most confident dish like The Taste show) and had the Picnic Club.\n\n"], "author": "T L.", "review": "(See pics) Review #1351.Sandwich is more 3.5 stars. The 4 stars is because of the dessert.\n\nWhat was once popular Corazon Juicebar (there were people coming in looking for the old place) now is a sandwich shop. No sign until Friday (3/28) as they are really trying to test out their menus WITHOUT too much publicity.\n\nI really think the owner has a kick in making DESSERTS more than the sandwiches and that is why reviewing the dessert first as it's the real highlight!\n\nSterling has recently lived in France so this looks like a dream extension. Every dessert is made by him and as he mentioned (yeah sorry I was skeptical), it's the lighter sweet kind! They looked so very pretty and meticulously elegant, from tiramisu to chocolate, to fruit tarts. All were lovely and I had the strawberry cake and must say the aroma bursts out through the creamy silkness! If they would only add the coffee drink or tea, it will be a perfect afternoon spot or after dinner place to relax.\n\nOnto the sandwiches, they have a handful selection including Devil's Eggs on deli white (suggested it would be a real nice appetizer), Mozzapesto on focaccia, San Franciscon (west coast style pastrami with provolone) on rustic French, The King (only sweet sandwich with peanut butter, banana, honey, chocolate, frosted flakes!) on brioche, Picnic Club (chicken with chipotle) on ciabatta and Hainan Chicken on dutch crunch.\n\nWas totally eying the Hainan chicken but that was the one not recommended. The owner, Sterling, said if you are Chinese and had the Hainan chicken back home, you would find it to be not like that. Asked if maybe there was a twist to his recipe and it was said to still be perfected. So instead I ordered his recommendation (his most confident dish like The Taste show) and had the Picnic Club.\n\nThe chicken was decently 3.35 stars but the good substantial size made it up to 3.5 stars. It's $8.5 but paid half price as everything is (drinks and food) until Friday night during their soft opening. The little bacon bites were with a tingle of sweetness and a nice touch of crunchiness. It was also packed with mustard, lettuce and tomato, the standard. Did sincerely suggested that every sandwich has to be good and not just 1 or 2 signatures in the long run and look forward to the future visits.\n\nThey also made quiches in house. So many choices in such a small place!\n\nAnother major high point is they are currently open until 8pm and midnight on the weekends. This is bound to change to also open until midnight during the week. Considering Revolution is just around the corner and the shop is in between 2 major, major streets of late night establishments, or if you just live in the hood, having a bite here is a refreshing new option comparing with the bacon wrapped hot dogs and pizza, as one patron excitedly pointed out about the choice of switching out pizzas.\n\nThe peeps here were super friendly, like Mission genuine friendly, and the business partner who came in a bit later was also a nice chap checking and preparing more decorations and chit chatted with customers.\n\nDo want to see when this tiny shop expands to include next door office space, as well as other choices of sandwiches such as anchovy with capers (would be a definite to try.)\n\nGrand opening is this Saturday and if you are into vodka they are planning on having a party serving that with other refreshments and food.", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["The Picnic Club -  There rendition of the club sandwich. ", "Good portions of chicken, bacon and cheese. "], "author": "Andrew S.", "review": "Stopped by here on the way to Dolores Park for a 4th of July picnic. Great sando shop with a several good varieties. \n\nThe Picnic Club -  There rendition of the club sandwich. Good portions of chicken, bacon and cheese. Fairly large overall and excellent taste. \n\nHainan Chicken - Not bad at all. Flavors were there and again, it was a large sando. Careful on the pepper if you try it. It'll make you cry if you're spicy/pepper sensitive. Thankfully it's on the side and you can choose to add it or not. \n\nSalumi - Their take on an italian sando. I have to say, it's pretty darn good. The meats were flavorful and has a nice kick to it. The only small drawback is that it's a little oily. Other than that, it's a great sandwich! \n\nOverall Mission Picnic is a great addition to the area. It provides another spot of foodies to try and who doesn't like a good sandwich spot!?", "rating": 4, "date": "2013-07-05"}, {"excerpts": ["I got the Picnic Club. ", "The chicken. ", "The bacon! "], "author": "KM R.", "review": "I'm impressed. Great food! Excellent service! \n\n I ordered sandwiches to be delivered to my office. I sent the order in around 9:30. 11 AM was available so I selected it as a delivery time. They open at 11 so I figured that they would call to confirm the order and tell me when the sandwiches would be delivered. No biggie. I had time. \n\nI get back to my office just after 11. I have a message. The delivery guy is in the lobby with the sandwiches! Wow! \n\nEven more shocking all 7 of my (let's be nice and call them persnickety) co-workers loved the food. I got the Picnic Club. The chicken. The bacon! Great sandwich! \n\nThanks guys! We will be back!", "rating": 5, "date": "2013-12-11"}, {"excerpts": ["Next time, I would choose the picnic club salad, but what can you do. ", "I guess you'll have to back. "], "author": "Amanda B.", "review": "I _liked_ Mission Picnic, but I wasn't blown away. \n\nI had a caesar salad, which was fine. It wasn't anything to write home about, however.\n\nThe place is pretty small, so be forewarned. You place your order and hang out for about 15 minutes while PostMates cyclists push past you to grab their orders or small dogs nip at your ankles. All very Mission-y. \n\nNext time, I would choose the picnic club salad, but what can you do. I guess you'll have to back. :)\n\nThe good: sweet space. Really modern, I dig it.\nThe bad: a long wait for take out. \nProtip: take your food to Dolores. Soak in some sweet, sweet sun.", "rating": 3, "date": "2014-08-01"}, {"excerpts": ["The Picnic Club is also fantastic with the chicken salad and bacon and lettuce, tomatoes, pickles and cheddar.  ", "It's so big too!! ", "I can usually stretch it into two meals! :-)  "], "author": "Jennifer N.", "review": "I absolutely LOVE the sandwiches here.  My personal favorite is the San Franciscan- pastrami and oven baked turkey with lovely melted provolone on a great french bun with peperocinis which gives it a perfect zing!  The Picnic Club is also fantastic with the chicken salad and bacon and lettuce, tomatoes, pickles and cheddar.  It's so big too!! I can usually stretch it into two meals! :-)  Also the Albacurry is delicious, it's got a Thai style curry flavour that is in almost a sloppy joe style sandwich that has some really great pickled cabbage and cucumbers. \n\nThe salads that they come up with are so yummy as well, they currently have a chicken Caesar that is out of this world amazing!! And the portion is perfect, too!!  They have a lovely soup that changes daily.  OH! And sometimes they have banana bread pudding and if you can get your hands on that- sooooooo delicious!! :-) \n\nSo hurry up and go try out the grub here!! nom nom nom!", "rating": 5, "date": "2013-06-29"}, {"excerpts": ["Their picnic club was hands down the most succulent chicken sandwich amazing creation ", "I've ever tasted - how do they make that chicken so tender?  ", "Probably because they know what their doing.  "], "author": "Jana S.", "review": "AHHH-MAZINGGGGG sandwiches at this new place - Mission Picnic has GOT_it_GOING_On.\n\nTheir picnic club was hands down the most succulent chicken sandwich amazing creation I've ever tasted - how do they make that chicken so tender?  Probably because they know what their doing.  Facts.  \n\nThe worker bees and owners is cool as all hell (and most likely working) - straight cuties.  The music is awesome - thanks MP for playing the good beats.\n\nTry them for a catering event!  They will accommodate.  Check out their website, its friendly.\n\nGo to Mission Picnic, right NOW HOMIE :)", "rating": 5, "date": "2013-09-24"}, {"excerpts": ["One sandwich that definitely stood out was their Hainan Chicken sandwich (we also tried their Picnic club, Devil's egg, and San Franciscan).  ", "What made the Hainan different was that it had an Asian flair to it, but made modern into a sandwich.  "], "author": "Jessica L.", "review": "Me and my friends went here for their grand opening last week.  Their sandwiches are creative and suited the whimiscal names given to each.   One sandwich that definitely stood out was their Hainan Chicken sandwich (we also tried their Picnic club, Devil's egg, and San Franciscan).  What made the Hainan different was that it had an Asian flair to it, but made modern into a sandwich.  The dutch crunch was toasted lightly and the chicken wasn't too dry; but was juicy and savory when paired with the secret sauce that came with it.   \n\nAside from the sandwiches, their watermelon juice was delicious =D\n\nWhat made this place even more enjoyable, are the staff themselves.  The owners are very approachable and easy-going.  They make sure that every sandwich you order is made to perfection!  \n\nDefinitely worth the trip out to the Mission.", "rating": 5, "date": "2013-04-08"}, {"excerpts": ["It was a lot to chose from but I settled in on the picnic club sandwich with rotisserie chicken salad.  ", "The ciabatta was soft but crunchy exactly how it should be. ", "It was delicious!! ", "Everything was fresh & flavorful and I knew  I was being serve the best quality of food and services. "], "author": "Angela W.", "review": "This place opened not long ago & I've decided to give it a try.  So glad I did because this place is amazing!! I really like their setup and their menu was simple & appealing. \n\nIt was a lot to chose from but I settled in on the picnic club sandwich with rotisserie chicken salad.  The ciabatta was soft but crunchy exactly how it should be. It was delicious!! Everything was fresh & flavorful and I knew  I was being serve the best quality of food and services. Everything was excellent and everyone there was upbeat and friendly. \n\nOne of the best sandwich places in SF.  This place was beyond my expectations. What awesome find in the mission neighborhood...seriously, everyone need to give this neat place a try!", "rating": 5, "date": "2013-04-26"}, {"excerpts": ["To be honest, I've only ever had the Picnic Club, and I am so satisfied with it that I have no desire to branch out.  ", "The chicken salad defines what a chicken salad should be, and the tomatoes are fresh.  ", "It's best to call in ahead of time or order online ", "so you don't have to wait, and since there are only a few tables ", "it's often better to get take out.  ", "The sandwiches are so large they will probably last you through almost 2 meals.  "], "author": "Rachel A.", "review": "Mission Picnic has amazing sandwiches.  To be honest, I've only ever had the Picnic Club, and I am so satisfied with it that I have no desire to branch out.  The chicken salad defines what a chicken salad should be, and the tomatoes are fresh.  It's best to call in ahead of time or order online so you don't have to wait, and since there are only a few tables it's often better to get take out.  The sandwiches are so large they will probably last you through almost 2 meals.  My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well.", "rating": 4, "date": "2014-07-13"}, {"excerpts": ["I had a winter wedge salad and the Picnic club sandwich.  ", "So fresh and tasty!  ", "My co-workers all loved their salads and sandwiches.  ", "We will for sure be ordering from them again soon!!   ", "Thank you Mission Picnic!!"], "author": "Rudy L.", "review": "We had Mission Picnic today for the first time!  It was fantastic!  I work at a medical office in the Castro and they delivered to us.  The owner delivered our lunch himself.  Very impressive!  He was extremely nice!   He also handed me a coupon for their event on March 29th.  The menu isn't that big but I like that, so one doesn't get overwhelmed with what to order.  I had a winter wedge salad and the Picnic club sandwich.  So fresh and tasty!  My co-workers all loved their salads and sandwiches.  We will for sure be ordering from them again soon!!   Thank you Mission Picnic!!", "rating": 5, "date": "2014-03-25"}, {"excerpts": ["Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. ", "I heard many good things about Mission Picnic since it first opened"], "author": "Sebastian H.", "review": "I love this place! Mission Picnic got me to eat a Vegan Sandwich. I LIKED IT. I highly recommend Mission Picnic for catering your event! Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. I heard many good things about Mission Picnic since it first opened", "rating": 4, "date": "2014-07-03"}, {"excerpts": ["Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. ", "We love the sandwiches because the ingredients are fresh, generous, and put together with care. ", "Breads are perfectly toasted, bacon is always crispy, and deli meats are top quality. ", "Though we love the sandwiches, the incredibly kind and friendly staff are what keep us coming back. ", "We are always welcomed with a smile (we love Jennifer!) ", "and the place has a happy, upbeat vibe. ", "Highly recommend Mission Picnic!"], "author": "Suzanne G.", "review": "Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. We love the sandwiches because the ingredients are fresh, generous, and put together with care. Breads are perfectly toasted, bacon is always crispy, and deli meats are top quality. Though we love the sandwiches, the incredibly kind and friendly staff are what keep us coming back. We are always welcomed with a smile (we love Jennifer!) and the place has a happy, upbeat vibe. Highly recommend Mission Picnic!", "rating": 5, "date": "2014-05-23"}, {"excerpts": ["The Picnic Club is quite good, and I also had the soup of the day which was a vegan cream of broccoli."], "author": "Maximillian M.", "review": "The Picnic Club is quite good, and I also had the soup of the day which was a vegan cream of broccoli.", "rating": 4, "date": "2013-06-16"}, {"excerpts": ["Bread was hard as a rock, and no flavor anywhere in my Picnic Club."], "author": "Mehul T.", "review": "$9 for a bland sandwich that took 30+ minutes to make? Bread was hard as a rock, and no flavor anywhere in my Picnic Club.", "rating": 2, "date": "2013-12-08"}, {"excerpts": ["I got the Picnic Club and it was the perfect balance of moist yet crunchy bread, chicken salad, and all the rest of the fixings. "], "author": "W. T.", "review": "I happened upon this place while wandering through the Mission - I'm always on the lookout for a good sandwich. All I can say I WOW if you're a sandwich person you must try this place!! I got the Picnic Club and it was the perfect balance of moist yet crunchy bread, chicken salad, and all the rest of the fixings. The sandwiches are huge, so if you don't have a large appetite you could easily share one. \n\nIf I'm back in San Francisco I'm going to make it a point to come back and try The King - banana, honey, chocolate, peanut butter, and frosted flakes - oh my!", "rating": 5, "date": "2013-08-09"}], "san franciscan": [{"excerpts": ["* San Franciscan ($9.50) - 4 stars\nMuch more savory sandwich, perfect for my bf!"], "author": "Ziyan C.", "review": "We were about 10 minutes away from Mission Picnic when I realized I could save time by ordering ahead. I created a Caviar account, made an order, and it was ready for pick up by the time we got there! (~12:30pm on a Saturday.) This was an easy, quick, and seamless experience.\n\nOh and of course, their sandwiches are always amazing. \n\n* Pollo Pesto ($9.95) - 4.5 stars\nSoft, moist chicken chunks. Flavorful pesto. Crunchy bread. And still warm by the time we walked to Dolores. Can't ask for much more!\n\n* San Franciscan ($9.50) - 4 stars\nMuch more savory sandwich, perfect for my bf!", "rating": 5, "date": "2017-12-20"}, {"excerpts": ["*San Franciscan (Hot pastrami, turkey & provolone)\n", "*", "Devil's Egg (Market boiled egg, bacon & provolone)\n"], "author": "Cherylynn N.", "review": "One of my favorite FOBanese dishes is Hainan Chicken Rice. Something about the simply boiled chicken, deliciously oily rice and aromatic ménage a trios of sauces (chili, ginger and dark soy) makes me...uhh, makes me happy. Sorry, going to keep it PG-rated for once.\n\nSo naturally seeing the Hainan Chicken Sandwich on Mission Picnic's FB page almost made me keel over. A FOBanese American Sandwich? I'm all over it! I hoped into my imaginary rice rocket and vroomed vroomed my way to Mission Picnic yesterday while bumping to Stevie B.\n\nMission Picnic is a new sandwich shop serving seasonal sandwiches; some with an Asian twist. They're currently in their soft opening stage and have an awesome deal of 50% off your purchase (till today). Their Grand Opening is tomorrow.\n\nFormerly the Corazon Juice Bar, Mission Picnic is a tiny shop with just four two-top tables so this is more of a to-go place.\n\nFor their soft opening, they had 6 sandwiches available (~$8-9):\n*Picnic Club (Rotisserie chicken salad w/ bacon & cheddar)\n*Hainan Chicken (Garlic rotisserie chicken w/ cucumber & picnic spread)\n*San Franciscan (Hot pastrami, turkey & provolone)\n*Devil's Egg (Market boiled egg, bacon & provolone)\n*MozzaPesto (Mozzarella, basil, tomato & pesto aioli)\n*The King (Peanut butter, bananas, honey chocolate & frosted flakes).\n\nThey'll also have soups and salads in the future. \n\nMake sure to try one of their refreshing fruit shakes (pineapple, watermelon or strawberry - $2.75). I had the watermelon which was more like a fresh watermelon juice slushy but it was really good (no sugar added).\n\nCASH ONLY.\n\nThe Hainan Chicken Sandwich was nicely packed with tenderly moist garlic rotisserie chicken, sliced cucumbers, tomato, lettuce & picnic spread on dutch crunch: http://bit.ly/171yYMd. The picnic spread of garlic and parsley was slathered onto the bread before toasting so all that garlicky goodness soaked into every nook and cranny. So yummy!\n\nWhile the sandwich was solid and made with top-notch ingredients, it was more like a garlic pesto-ish chicken sandwich to me. I was hoping it would be more FOBanese. There was no ginger in the spread and ginger is what makes hainan chicken \"hainan\" imo. And, although the dutch crunch had a deliciously crunchy mottled crust, I think a less carb heavy bread like a baguette would let the ingredients shine for this particular sandwich. Just my two cents.\n\nOne of owners, Sterling was super nice and encouraged customer feedback which is always a sign to build customer loyalty and remain competitive in this marketplace. I hope he does see this and offers several FOBanese sandwich options in the future including vegan options for my Yelpie friend John B.  who's always in the hood and for all the surrounding PBR drinking and camel toe inducing skinny jean lovers of course.\n\nMission Picnic has a lot of potential and this was just their soft opening so I can't wait to see what other specialty sandwich ideas they have up their sleeve...\n\nPerhaps a pulled pork with apple wasabi slaw sandwich, a Tonton sesame marinated tofu w/ portobello mushroom sandwich, a longanisa banh mi or a loco moco sloppy joe? I can go on and on.\n\nNow only if I can come up with ideas like that in my field of work instead of looking like a deer caught in headlights all the time...", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["Upon entering this tiny little shop we were whetted by the menu on the wall: Nuuevo Cubano, Hainan Chicken, ABT, San Franciscan (pastrami and oven-baked turkey)... ", "all sounded good and yummy. ", "A guy came in toward the end of our meal and asked for ABT without the B---that is, bacon! ", "So here you go. ", "Give this place a try. "], "author": "Matt Y.", "review": "5/17/13 Lunch\n\nA new sandwich shop serving sammies with a twist. Upon entering this tiny little shop we were whetted by the menu on the wall: Nuuevo Cubano, Hainan Chicken, ABT, San Franciscan (pastrami and oven-baked turkey)... all sounded good and yummy. After a few minutes of deliberation, my friend and I decided on two to share:\n\n*Nuevo Cubano: roasted pork and black forest ham with red pickled onion, a slice of pineapple on a crispy ciabatta. The avocado/jalapeno aioli and dijon all folded into a yummy flavor. I didn't taste the roasted pork but the ham was good. Pineapple dominated the flavor so maybe they could put more meat?\n\n*Hainan Chicken: this one, served on a rustic French roll, is almost twice the side of the Cubano. \"Hainan\" is really \"Ayam\" from Malay, meaning chicken. Ayam became Hainan when the boiled chicken dish came to China. Anyway, the Hainan chicken sandwich here doesn't come with the usual ginger, but a garlicky butter and scallion oil. Maybe they should consider a crushed ginger dip like that you get from a Chinese deli? The chicken is simply boiled but very tender and moist, unlike the usual leathery, rubbery texture of deli chicken. The assembly, complete with cilantro, sliced tomato and cucumber, looked a bit like a bunh mi. \n\nWe were also tempted by their special creation of the day: a French Toast sandwich with lumps of strawberries powdered sugar. But we were too full to have a go at dessert. They also have a PBJ sandwich, as well as a Salami plate. Guilty of having too much carbs? Get the Peach and Avocado salad.\n\nSo many possibilities here at Mission Picnic even though they don't offer katsu, the staple of Rhea down the street. They also allowed substitution. A guy came in toward the end of our meal and asked for ABT without the B---that is, bacon! So here you go. Give this place a try. Sammies are not piping toasty.\n\nMinimum $10 for credit card.", "rating": 4, "date": "2013-05-17"}, {"excerpts": ["The San Franciscan (~$9.50) was screaming my name, with ingredients like Pastrami, Turkey, Pepperocini's.... ", "and it was delicious! ", "The combination of quality ingredients sandwiched between some amazing Semifreddo's French Bread made this an amazing sandwich. "], "author": "Jess C.", "review": "Mission Picnic, previously Corazon, opened about 1 week ago serving up sandwiches, salads, and fresh juices. The sandwiches are mostly traditional, with a bit of an interesting flair - the most popular and talked about is the Hainan Chicken sandwich. I wanted to try something different. \n\nThe San Franciscan (~$9.50) was screaming my name, with ingredients like Pastrami, Turkey, Pepperocini's.... and it was delicious! The combination of quality ingredients sandwiched between some amazing Semifreddo's French Bread made this an amazing sandwich. I just wish there was more meat (in general) on all of these sandwiches. \n\nMission Picnic is better than most of it's popular neighborhood competitors, like Rhea's, Pal's Takeaway, and Ike's (whoa, I said it). Nothing in the area is quite like it, but in terms of delivering an amazing pastrami, I think I still like the Sandwich Place and Marina Subs. In terms of top notch quality ingredient sandwich, my heart is still with Salumeria and Roli Roti. For something really different, I enjoy options at Bite Me. \n\nI'm a sandwich snob, and yet with so many options in the neighborhood, I would recommend stopping at Mission Picnic for your Dolores Park supplies. No place has served up sandwiches quite like this - so glad to have Mission Picnic in the hood!", "rating": 4, "date": "2013-04-08"}, {"excerpts": ["The San Franciscan is amazing. ", "You simply cannot go wrong with this one. ", "You got your Pastrami, turkey, provolone, tomatoes, red onion, peperoncinis, lettuce, mayo & mustard on a crunchy ciabatta bread. "], "author": "Anh T.", "review": "The menu is unique and caters to the pallets of many foodies here in San Francisco. \n\nMost ridiculous one here? Try 'The King' - Peanut butter, Chocolate, honey, bananas and...wait for it....Frosted Flakes?! Oh my - talk about awesome in a form of a heart attack. \n\nThe San Franciscan is amazing. You simply cannot go wrong with this one. You got your Pastrami, turkey, provolone, tomatoes, red onion, peperoncinis, lettuce, mayo & mustard on a crunchy ciabatta bread. They were out of the French, but no complaints here! \n\nI Never got to try the Hainan Chicken everyone's been raving about :( Bring it back, please?! \n\nNote: Prepare to wait about 10-15 mins for your order and with only 3 small tables in the establishment, it's best to order to go or for pickup :) In short, I had a wonderful first experience here and would gladly pay $10 a sandwich any day for this place! TAKE ALL MY MONEY!!! *throws money*", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["We each ordered the San Franciscan sandwich and since the place is so small, we took them to go & walked to Dolores Park to enjoy them.  ", "The sandwiches were perfectly flavored & had just the right amount of \"crunch\" when you bit into them.  ", "Plus, they were filling!  ", "We'll definitely be back to try more from the menu!"], "author": "Karey B.", "review": "This place was delicious!  Based upon the other reviews, my husband & I headed over for lunch today - & it didn't disappoint!  We each ordered the San Franciscan sandwich and since the place is so small, we took them to go & walked to Dolores Park to enjoy them.  The sandwiches were perfectly flavored & had just the right amount of \"crunch\" when you bit into them.  Plus, they were filling!  We'll definitely be back to try more from the menu!", "rating": 5, "date": "2016-09-18"}, {"excerpts": ["The San Franciscan sando is so good, instead of a cup of water next to my bed at night, I put this sandwich on my night stand and eat that throughout the night. ", "San Franciscan 9.50\nhot romanian pastrami, roasted turkey breast, melted provolone, crunchy lettuce, tomato, red onion, pepperoncini, oil and vinegar, mayo, deli mustard on french"], "author": "John R.", "review": "The San Franciscan sando is so good, instead of a cup of water next to my bed at night, I put this sandwich on my night stand and eat that throughout the night. Not a true story, but the sandwich is incredibly amazing!\n\nSan Franciscan 9.50\nhot romanian pastrami, roasted turkey breast, melted provolone, crunchy lettuce, tomato, red onion, pepperoncini, oil and vinegar, mayo, deli mustard on french", "rating": 5, "date": "2014-12-05"}, {"excerpts": ["Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. ", "I'd definitely come back again!"], "author": "Holly P.", "review": "Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. I'd definitely come back again!", "rating": 5, "date": "2014-08-31"}, {"excerpts": ["I've tried to San Franciscan and the Club sandwich, both were great. ", "The sandwiches are also pretty darn big, pick up a bag of chips "], "author": "David C.", "review": "Om nom nom, price for the sandwiches may be a bit high $9-11 but they are hella' delicious. I've tried to San Franciscan and the Club sandwich, both were great. The sandwiches are also pretty darn big, pick up a bag of chips and you've got yourself a meal. \n\nThere's not much indoor seating so it's definitely better to grab your sammy to go, and enjoy it elsewhere. If you're looking for something quick and sandwhichy, then give this spot a try!", "rating": 4, "date": "2015-02-22"}, {"excerpts": ["I ordered the San Franciscan and it was amazing! ", "Everything tastes very fresh and the bread was perfect. ", "I will be sure to come back here! ", ":)"], "author": "Steven T.", "review": "Came here for the first time with a friend and I loved it!! Didn't like how little seating there was, but at least it wasn't crowded.\n\nI ordered the San Franciscan and it was amazing! Everything tastes very fresh and the bread was perfect. I will be sure to come back here! :)", "rating": 5, "date": "2014-07-03"}, {"excerpts": [", I had the San Franciscan which was recommended by the pleasant lady behind the counter.  ", "What I liked best is that the ingredients stayed together upon biting into the sandwich.  ", "Some places, they make it so the ingredients squeeze out ", "but these didn't. ", "Here is a description of the Sandwich I ordered and note that I usually would not spend over $9 for a sandwich, but then again maybe you are not a cheapskate like me.\n", "San Franciscan\n9.50\n\nhot romanian pastrami, roasted turkey breast, melted provolone, crunchy lettuce, tomato, red onion, pepperoncini, oil and vinegar, mayo, deli mustard on french"], "author": "Jerome W.", "review": "I work nearby and pass every day so its amazing it took me so long to try it out.  So just gotta let you know that it was a great sandwich, I had the San Franciscan which was recommended by the pleasant lady behind the counter.  What I liked best is that the ingredients stayed together upon biting into the sandwich.  Some places, they make it so the ingredients squeeze out but these didn't. Here is a description of the Sandwich I ordered and note that I usually would not spend over $9 for a sandwich, but then again maybe you are not a cheapskate like me.\nSan Franciscan\n9.50\n\nhot romanian pastrami, roasted turkey breast, melted provolone, crunchy lettuce, tomato, red onion, pepperoncini, oil and vinegar, mayo, deli mustard on french", "rating": 5, "date": "2014-06-12"}, {"excerpts": ["i do however have a list of favourites; the San Franciscan being the staple with which you will never be disappointed. ", "When you're feeling a bit more daring ", "the Nuevo Cubano is so different and so delicious. ", "The Hainan is also a great one which I suggest you all try before it leaves the menu. "], "author": "Ali B.", "review": "Not your average sandwich shop. With something so straightforward you would imagine that creativity is a challenge. Mission picnic is leading the pack in terms of diverging away from your standard sandwich and giving you a true experience. With a great selection, nothing here is boring and every single sandwich (I've tried all but the king) is as exciting as the next.\n\ni do however have a list of favourites; the San Franciscan being the staple with which you will never be disappointed. When you're feeling a bit more daring the Nuevo Cubano is so different and so delicious. The Hainan is also a great one which I suggest you all try before it leaves the menu. My favourite salad is the beets and greens and the side of potato salad is a must with any order. \n\nThere is so many good things to say about this place but I think what really stood out for me is the quality of the ingredients. I tried the new beef sandwich before I left and it literally melts in your mouth; thankfully they gave me a very generous portion of it. The staff are great, the atmosphere is nice and they deliver! It really is, for me, the best of its kind.", "rating": 5, "date": "2013-09-18"}, {"excerpts": ["San Franciscan sandwich was a nice blend of two meats and good toasted bread.  "], "author": "PJ T.", "review": "small place with three tables.  rude clerk who just nods head to acknowledge guests.  really?  is that how ppl in the mission communicate? \n\nSan Franciscan sandwich was a nice blend of two meats and good toasted bread.  Club you could skip.  \n\nClean bathrooms, but dusty lamp hovering over the aforementioned clerk.", "rating": 3, "date": "2015-10-06"}, {"excerpts": ["so we came here and had the Hainan Chicken as well as their San Franciscan. \n\n", "As far as the sandwiches themselves were concerned: there are plenty of better Banh Mi options compared to the Hainan chicken and the San Franciscan wasn't nearly as good as Deliboard (which IMO, still isn't as good as their sister shop "], "author": "Gunn S.", "review": "My wife and I wanted to try a different sandwich place so we came here and had the Hainan Chicken as well as their San Franciscan. \n\nThe Wait: Considering it was 2PM on a Monday, I was surprised at how long it took for them to make two sandwiches. It always amazes me to see the differences efficiency of various sandwich shops -- even those with diverse menus. This wasn't as bad as Ike's but the wait for the sandwich was still positively glacial compared to Roxy's or 1058 Hoagie\n\nAs far as the sandwiches themselves were concerned: there are plenty of better Banh Mi options compared to the Hainan chicken and the San Franciscan wasn't nearly as good as Deliboard (which IMO, still isn't as good as their sister shop 1058 Hoagie).\n\nAt this price point, I think Roxy's, Rhea's, 1058 Hoagie, or two Banh Mi sandwiches would be a better meal. I don't anticipate going back.\n\n-g", "rating": 2, "date": "2013-09-12"}, {"excerpts": ["We ordered a Kale Caesar salad and a San Franciscan sub. ", "The salad was super disappointing; a single anchovy, barely any Kale or tomatoes and mostly lettuce."], "author": "Jaco L.", "review": "We ordered a Kale Caesar salad and a San Franciscan sub. The salad was super disappointing; a single anchovy, barely any Kale or tomatoes and mostly lettuce.", "rating": 2, "date": "2016-06-12"}, {"excerpts": ["We ordered the San Franciscan, Hainan Chicken, and their version of the desert sandwich (bananas, chocolate, peanut butter, and frosted flakes) for our little girl.  ", "The sandwiches were delicious!  ", "They were still nice and warm and the bread was crunchy on the outside and soft inside when we got the park.  ", "The San Franciscan was well made while the chicken in the Hainan was very tender and moist.  ", "I actually really like the desert sandwich when I snuck a bite from my little girl.  "], "author": "Mac S.", "review": "Hubby and I came by to pick up a few sandwiches before heading to Dolores Park for a nice afternoon in the sun.  \n\nWe ordered the San Franciscan, Hainan Chicken, and their version of the desert sandwich (bananas, chocolate, peanut butter, and frosted flakes) for our little girl.  The sandwiches were delicious!  They were still nice and warm and the bread was crunchy on the outside and soft inside when we got the park.  The San Franciscan was well made while the chicken in the Hainan was very tender and moist.  I actually really like the desert sandwich when I snuck a bite from my little girl.  The fresh juices also paired well.\n\nThis is definitely our new go to place before heading to Dolores Park.", "rating": 5, "date": "2013-04-16"}, {"excerpts": ["One sandwich that definitely stood out was their Hainan Chicken sandwich (we also tried their Picnic club, Devil's egg, and San Franciscan).  ", "What made the Hainan different was that it had an Asian flair to it, but made modern into a sandwich.  "], "author": "Jessica L.", "review": "Me and my friends went here for their grand opening last week.  Their sandwiches are creative and suited the whimiscal names given to each.   One sandwich that definitely stood out was their Hainan Chicken sandwich (we also tried their Picnic club, Devil's egg, and San Franciscan).  What made the Hainan different was that it had an Asian flair to it, but made modern into a sandwich.  The dutch crunch was toasted lightly and the chicken wasn't too dry; but was juicy and savory when paired with the secret sauce that came with it.   \n\nAside from the sandwiches, their watermelon juice was delicious =D\n\nWhat made this place even more enjoyable, are the staff themselves.  The owners are very approachable and easy-going.  They make sure that every sandwich you order is made to perfection!  \n\nDefinitely worth the trip out to the Mission.", "rating": 5, "date": "2013-04-08"}, {"excerpts": ["With some consulting,I selected the San Franciscan, which was amazing. ", "A nice mix of meats and great blended flavors. ", "It was so good, I decided to grab another sandwich for the road! "], "author": "Elvis N.", "review": "Ever since I moved to the Bay Area, I have made it my mission to try a few new dining establishments per week. I have heard nothing but amazing things about a quaint sandwich shop called Mission Picnic. So this passed Friday I saddled up and headed down to the Mission to check it out. The neighborhood was very eclectic and had an interesting mix of shops. The staff at Mission Picnic was very polite, patient and thoughtful in recommending a sandwich to fit my tastes. With some consulting,I selected the San Franciscan, which was amazing. A nice mix of meats and great blended flavors. It was so good, I decided to grab another sandwich for the road! This time I chose the CranTurkey. Equally as delicious, light and very fresh. I have recommended MP to all of my friends and our next corporate lunch will definitely be Mission Picnic catered!", "rating": 5, "date": "2015-02-02"}, {"excerpts": ["I ordered the San Franciscan sandwich and the Beets and Greens salad. ", "Both were delicious! ", "The meat was sliced so thin on the sandwich and the crust of the bread was so crunchy with the inside was soft and tasty. ", "Both of us were thoroughly impressed and super full! ", "Will definitely be ordering from here again!"], "author": "Ariel B.", "review": "I had been wanting to try food from here since they opened. I finally got my chance when I decided to order lunch in for my boyfriend and I on our day off. I ordered the San Franciscan sandwich and the Beets and Greens salad. Both were delicious! The meat was sliced so thin on the sandwich and the crust of the bread was so crunchy with the inside was soft and tasty. Both of us were thoroughly impressed and super full! Will definitely be ordering from here again!", "rating": 4, "date": "2015-01-31"}, {"excerpts": ["Whenever I'm in the area craving a sammie, the San Franciscan is my go to sandwich ", ":D ", "It has the perfect balance of meat/veggie/bread ratio and with the melted cheese and toasty bread ", "it's just an amazing marriage of flavors in my mouth... "], "author": "Laura L.", "review": "Whenever I'm in the area craving a sammie, the San Franciscan is my go to sandwich :D It has the perfect balance of meat/veggie/bread ratio and with the melted cheese and toasty bread it's just an amazing marriage of flavors in my mouth... I love washing it down with their watermelon juice and for a nice sweet treat after, the chocolate chip cookie, YUMMMM. What more can I possibly ask for? Nada :D", "rating": 5, "date": "2014-09-15"}, {"excerpts": ["My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well."], "author": "Rachel A.", "review": "Mission Picnic has amazing sandwiches.  To be honest, I've only ever had the Picnic Club, and I am so satisfied with it that I have no desire to branch out.  The chicken salad defines what a chicken salad should be, and the tomatoes are fresh.  It's best to call in ahead of time or order online so you don't have to wait, and since there are only a few tables it's often better to get take out.  The sandwiches are so large they will probably last you through almost 2 meals.  My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well.", "rating": 4, "date": "2014-07-13"}, {"excerpts": ["The first time I got the San Franciscan, which was good - nice size, great bread, plenty of meat inside. ", "The second time I got the Devil's Egg, which was fantastic. ", "I love egg salad, and this egg salad is particularly nice. ", "It is certainly not a generic egg salad sandwich."], "author": "Ryan C.", "review": "Great sandwiches, I love this place. I've only been twice, but both times have been good. The first time I got the San Franciscan, which was good - nice size, great bread, plenty of meat inside. The second time I got the Devil's Egg, which was fantastic. I love egg salad, and this egg salad is particularly nice. It is certainly not a generic egg salad sandwich.", "rating": 4, "date": "2014-05-05"}, {"excerpts": ["San Franciscan was pretty tasty but a bit expensive. ", "Only three tables ", "so it's best for carry out."], "author": "Xteethx B.", "review": "San Franciscan was pretty tasty but a bit expensive. Only three tables so it's best for carry out.", "rating": 4, "date": "2014-02-26"}, {"excerpts": ["Despite the fact that I got to try something new, the taste of the sandwich (The San Franciscan) here really hit the spot. ", "Must try!"], "author": "Sinath N.", "review": "Blue cheese....!!!! Omg I would never try this cheese ever but I accidentally tried it from the peach salad that my friend had order. It wasn't bad at all. Despite the fact that I got to try something new, the taste of the sandwich (The San Franciscan) here really hit the spot. Must try!", "rating": 5, "date": "2013-07-12"}, {"excerpts": ["My fav thus far is probably The San Franciscan although the Sergeant Slawter is a very close second. ", "Only downside is if you go late in the day they can be out of certain ingredients, but they usually find a very tasty substitute for you."], "author": "Sarah O.", "review": "Every sandwich I've had from here is mmmmm delicious. I took my grandmother who lives in Nebraska here and she even said it's \"the best bread I've ever tasted,\" which is saying a lot since she's had her fair share of homemade delicious bread. My fav thus far is probably The San Franciscan although the Sergeant Slawter is a very close second. Only downside is if you go late in the day they can be out of certain ingredients, but they usually find a very tasty substitute for you.", "rating": 5, "date": "2013-09-30"}, {"excerpts": ["Had the Hainan Chicken Sandwich and San Franciscan.  ", "Both were fantastic!  ", "The Hainan got perfectly baked dutch crunch, you know with the thin and crunchy outside, and the warm soft inside.  ", "The San Franciscan is on a French roll, also with a good crust and warm soft inside the bread.  ", "The pastrami is juicy.  ", "You already think it's amazing, and then the provolone and turkey run through and straight wrestle your taste buds into submission.  ", "Another excellent sandwich.  ", "I've got several more to try like the Cubano and the King."], "author": "Yoway B.", "review": "Had the Hainan Chicken Sandwich and San Franciscan.  Both were fantastic!  The Hainan got perfectly baked dutch crunch, you know with the thin and crunchy outside, and the warm soft inside.  Once your teeth get through the bread, then you get some excellently seasoned chicken the rest of the way through.\n\nThe San Franciscan is on a French roll, also with a good crust and warm soft inside the bread.  The pastrami is juicy.  You already think it's amazing, and then the provolone and turkey run through and straight wrestle your taste buds into submission.  Another excellent sandwich.  I've got several more to try like the Cubano and the King.", "rating": 5, "date": "2013-04-08"}, {"excerpts": ["the san franciscan is too good. ", "Staff is super friendly and owner is very attentive and friendly. ", "Great service - thank you MP!"], "author": "Misao T.", "review": "I eat a sandwich here at least 3x per week...the san franciscan is too good. Staff is super friendly and owner is very attentive and friendly. Great service - thank you MP!", "rating": 5, "date": "2014-08-07"}, {"excerpts": ["and I'm stuck on the  San Franciscan (Hot pastrami, turkey & provolone) ", "but one of these days I'm going to branch out and try the cultish Hainan Chicken (Garlic rotisserie chicken, cukes and picnic spread).  \n", "My partner tried the King, a PB, bananas, honey, dark chocolate & frosted flakes sandwich that's like having dessert first.  \n", "Good quality and tasty creations. \n", "I'LL BE BACK!!!"], "author": "Ann P.", "review": "Fantastic sandwiches from this new hole-in-the wall sandwich purveyor. I've been there three times since they opened and I'm stuck on the  San Franciscan (Hot pastrami, turkey & provolone) but one of these days I'm going to branch out and try the cultish Hainan Chicken (Garlic rotisserie chicken, cukes and picnic spread).  \nMy partner tried the King, a PB, bananas, honey, dark chocolate & frosted flakes sandwich that's like having dessert first.  \nGood quality and tasty creations. \nI'LL BE BACK!!!", "rating": 5, "date": "2013-04-08"}, {"excerpts": ["I like the San Franciscan ", "it was so juicy!!!!! ", "I usually order from this place since I just live 30 steps away! ", "one thing I recommend is call ahead of time because they do take 15 min to make your sandwich. ", "I remember i called in one day and came in 15min ", "and it was not ready since they had a huge catering order, so I waited another 10 patiently and then another 10min frustrated!! ", "Everyone in that store was also with a straight face because they been waiting for a long time. ", "Overall it took 35 min to get my sandwich, and I was late for my final and that is why I am giving them a 3 star. ", "Every single time I think of this place I think twice because of that one experience I had. ", "It does suck to not have an accurate estimation!!! ", "Because i recently got San Francisco Jun16th and my sandwich was cold because I decided to go in 15min instead of 10 min.  ", "But overall if you have time to wait ", "and you want a good sandwich come here!"], "author": "THe real TrUth D.", "review": "Good sandwiches! I like the San Franciscan it was so juicy!!!!! I usually order from this place since I just live 30 steps away! one thing I recommend is call ahead of time because they do take 15 min to make your sandwich. I remember i called in one day and came in 15min and it was not ready since they had a huge catering order, so I waited another 10 patiently and then another 10min frustrated!! Everyone in that store was also with a straight face because they been waiting for a long time. Overall it took 35 min to get my sandwich, and I was late for my final and that is why I am giving them a 3 star. Every single time I think of this place I think twice because of that one experience I had. It does suck to not have an accurate estimation!!! Because i recently got San Francisco Jun16th and my sandwich was cold because I decided to go in 15min instead of 10 min.  But overall if you have time to wait and you want a good sandwich come here!", "rating": 3, "date": "2014-06-18"}, {"excerpts": ["San Franciscan was amazing!! ", "They cut up the meat so the each bite is neat. ", "The flavor reminds me of my days back with Jimmy Johns ", "but I love this place. ", "It's so unassuming but so worth the time. ", "it's a small place with three or four tables. ", "Its really a pick up and go hence the word picnic."], "author": "Kalifornia S.", "review": "San Franciscan was amazing!! They cut up the meat so the each bite is neat. The flavor reminds me of my days back with Jimmy Johns but I love this place. It's so unassuming but so worth the time. it's a small place with three or four tables. Its really a pick up and go hence the word picnic.", "rating": 5, "date": "2013-08-11"}], "cranturkey": [{"excerpts": ["Sandwiches:\nCRANTURKEY - YESSS! ", "Cranberry sauce in a sandwich was something I never tried before and it is amazing! ", "Turkey is nice and moist and NOT DRY! ", "Cause dry turkey is the worst. "], "author": "Diana C.", "review": "Sandwiches:\nCRANTURKEY - YESSS! Cranberry sauce in a sandwich was something I never tried before and it is amazing! Turkey is nice and moist and NOT DRY! Cause dry turkey is the worst. The sprouts gave it nice little crunch and was a good pairing with the rest of the sandwich as it complemented well.\n\nPOLLOPESTO- Also amazing! I love pesto on just about anything so I had to get this sandwich. It was absolutely amazing and I love the satisfying crunch sound I get when I bite into it. \n\nSMOKED SALMON- Got it once and it's great too. I love smoked salmon and cream cheese so this was my kind of sandwich. But since it's more expensive, I only got it once. \n\nSalads:\nI think I tried almost all of the salads except for the Winter Wedge.\n\nDELUXE COBB - As good as a Cobb can get. Sometimes I am fond of the bleu cheese, sometimes I am not. Chicken is really fresh and big pieces. They don't skimp on that! \n\nBEETS AND GREENS - I got this once by accident and I was pleasantly surprised by how good beets were. I don't think I ever had beets prior to this salad. I also enjoyed the candied pecans since it was a nice flavor to go along with the salad. I wish they had pecans in the other salads!\n\nCHOPPED ITALIAN - It was good but not my favorite since I like avocados and eggs in my salads usually. I'm much of a Cobb kind of girl.\n\nKALE CAESAR - There is this one single anchovy piece that stares back at me when I open my box. The smell always hits me but I am not an anchovy-hater although sometimes I don't know if having it adds to the salad. Get this with chicken because I do not know how people can eat just kale by itself. I just wish the kale was more chopped up instead of in a giant leaf form.\n\nAll the vinaigrettes are good. Red wine vinaigrette is my favorite. I do not like the caesar dressing as much since I prefer a creamier dressing and their caesar is bit thicker and mayo-like. But all their salads are great portions and super filling. They give you good size everything so a whole egg, nice cherry tomatoes and avocado, fresh lettuce, fresh chicken cut up in nice pieces and all. \n\nAwesome place! They deliver to anywhere in SF for $5 flat. They're always quite timely with my order deliveries. I did have two times when I was missing an order or got the wrong item but it was quick to reach them by phone to get that fixed. I can't even be mad since their food is so good and they're also really nice on the phone and even gave me an apology cookie+chips once. I gave the cookie to my co-worker but it smelled really good. SO GOOD. \n\nOh, and sometimes you get the person with the really beautiful handwriting who draws smiley faces on your boxes. Like who doesn't want to unravel a sandwich that has your name and a smiley face written on it?", "rating": 5, "date": "2015-09-28"}, {"excerpts": ["I got the CranTurkey Sandwich and it was YUMMY! ", "At first I was a little put off by the thickness of the bread, it looked huge, but then I tasted the bread. ", "So worth the calories! ", "It tasted like a little butter in every bite, which complemented the CranTurkey goodness. "], "author": "Julie H.", "review": "Great recommendation from the folks down at Chocolatier Blue. Looks like a hole in the wall but loved the relaxed, friendly vibe. Was also in need of a place to charge my phone and appreciated all of the outlets.\n\nI got the CranTurkey Sandwich and it was YUMMY! At first I was a little put off by the thickness of the bread, it looked huge, but then I tasted the bread. So worth the calories! It tasted like a little butter in every bite, which complemented the CranTurkey goodness. Ate the whole thing and had to have a late dinner because of it but was worth it!\n\nAlso enjoyed the watermelon juice, which has no sugar or junk added to it. Just sweet, delicious watermelon.   \n\nWould definitely come here again!", "rating": 4, "date": "2014-03-29"}, {"excerpts": ["We shared 4 different sandwiches: the ABT, Pollo Pesto, Nuevo Cubano, and Cranturkey. ", "The Cranturkey was my absolute favorite-- a lightly crisped french roll and just the right amount of cranberry sauce so as to not overpower the rest of the ingredients. ", "The Nuevo Cubano was an unexpected runner up; normally I avoid pineapple in savory dishes because I think the combination is barfworthy, but again, the NC had just enough to add an unexpected kick. ", "I thought the Pollo Pesto tasted a bit bland in comparison to the other sandwiches we picked up, but it actually came out as the favorite for 2 out of 4 people in our sandwich-tasting crew."], "author": "Kristina C.", "review": "I picked up a few sandwiches from here last week to lug to a friend's house for an indoor picnic of sorts. About half an hour later when we finally sat down to eat, I expected the sandwiches to be at least a little soggy and drippy, but that wasn't the case at all-- somehow, after being manhandled for a solid 20 minutes during the walk from Mission Picnic to my friend's place, the sandwiches still managed to stay perfectly intact. The bread was surprisingly still crispy, as if it'd just come out of the oven, and the ingredients were all in their rightful places and tasted totally fresh. The sandwiches weren't dry either, so I have no idea how they maintained their crispiness, but it was gooood. Sandwich magic, I guess.\n\nWe shared 4 different sandwiches: the ABT, Pollo Pesto, Nuevo Cubano, and Cranturkey. The Cranturkey was my absolute favorite-- a lightly crisped french roll and just the right amount of cranberry sauce so as to not overpower the rest of the ingredients. The Nuevo Cubano was an unexpected runner up; normally I avoid pineapple in savory dishes because I think the combination is barfworthy, but again, the NC had just enough to add an unexpected kick. I thought the Pollo Pesto tasted a bit bland in comparison to the other sandwiches we picked up, but it actually came out as the favorite for 2 out of 4 people in our sandwich-tasting crew.", "rating": 5, "date": "2015-01-06"}, {"excerpts": ["This time I chose the CranTurkey. ", "Equally as delicious, light and very fresh. ", "I have recommended MP to all of my friends and our next corporate lunch will definitely be Mission Picnic catered!"], "author": "Elvis N.", "review": "Ever since I moved to the Bay Area, I have made it my mission to try a few new dining establishments per week. I have heard nothing but amazing things about a quaint sandwich shop called Mission Picnic. So this passed Friday I saddled up and headed down to the Mission to check it out. The neighborhood was very eclectic and had an interesting mix of shops. The staff at Mission Picnic was very polite, patient and thoughtful in recommending a sandwich to fit my tastes. With some consulting,I selected the San Franciscan, which was amazing. A nice mix of meats and great blended flavors. It was so good, I decided to grab another sandwich for the road! This time I chose the CranTurkey. Equally as delicious, light and very fresh. I have recommended MP to all of my friends and our next corporate lunch will definitely be Mission Picnic catered!", "rating": 5, "date": "2015-02-02"}, {"excerpts": ["A great twist on some classics (we ordered the Cobb, Caesar, Cranturkey, and Mozzapesto). ", "Loved it."], "author": "Kat H.", "review": "Delicious! Ordered delivery for a meeting at the office and we all agreed, super yummy. The food was fresh and arrived when we requested, the dude even came up to our floor! We will forsure be ordering again from here. A great twist on some classics (we ordered the Cobb, Caesar, Cranturkey, and Mozzapesto). Loved it.", "rating": 5, "date": "2014-10-07"}, {"excerpts": ["We ordered a Cranturkey sandwich, it was delicious, the sourdough bread was amazing. ", "..", "it's so hard to find good hard sourdough rolls!!!"], "author": "Courtney V.", "review": "We ordered our food through eat24 and had it delivered,  the food was still hot. We ordered a Cranturkey sandwich, it was delicious, the sourdough bread was amazing. ..it's so hard to find good hard sourdough rolls!!!", "rating": 5, "date": "2015-01-19"}, {"excerpts": ["Ordered the Cranturkey (premium slow roasted turkey, aged Swiss, organic sprouts, light onion, double green leaf, mayo, cranberry sauce on rustic French) - was super delish! ", "Just the right amount of turkey, the sauce was sweet and tasty, and the bread had that perfect amount of crunch! ", "Also recommend their cookies that are freshly baked daily. ", "They have a whole wall of different sandwich selections that all sound delicious, need to come back and try more! ", "Kinda curious about The King (peanut butter, banana, honey, chocolate, frosted flakes, on a crispy brioche)."], "author": "Audrey E.", "review": "Cute cozy sandwich and salad spot in the Mission. Ordered the Cranturkey (premium slow roasted turkey, aged Swiss, organic sprouts, light onion, double green leaf, mayo, cranberry sauce on rustic French) - was super delish! Just the right amount of turkey, the sauce was sweet and tasty, and the bread had that perfect amount of crunch! Also recommend their cookies that are freshly baked daily. They have a whole wall of different sandwich selections that all sound delicious, need to come back and try more! Kinda curious about The King (peanut butter, banana, honey, chocolate, frosted flakes, on a crispy brioche).", "rating": 5, "date": "2013-12-16"}, {"excerpts": ["but i especially like the Cranturkey (Turkey & Cranberry) sandwich. ", "their bread is always fresh. ", "good spot to get sandwiches from before heading to Dolores Park."], "author": "Farbod F.", "review": "real good spot for sandwiches. all the ones i have tried have been great but i especially like the Cranturkey (Turkey & Cranberry) sandwich. their bread is always fresh. good spot to get sandwiches from before heading to Dolores Park.", "rating": 5, "date": "2014-10-22"}], "devils egg": [{"excerpts": ["I was drawn to mission picnic by the pictures on yelp and the devils egg sandwich did not disappoint. ", "Can wait to try their other sandwiches"], "author": "John H.", "review": "I was drawn to mission picnic by the pictures on yelp and the devils egg sandwich did not disappoint. Can wait to try their other sandwiches", "rating": 5, "date": "2018-01-23"}], "mozzapesto": [{"excerpts": ["Here's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, "], "author": "Chantel Y.", "review": "MMM. I'm not a big fan of sandos but I do enjoy a fresh one made with lots of love from time to time ;). And when I do order sandwiches for the office, I choose Mission Picnic! The veggies are SOOO FRESHHHHHH. Crunchy arugula.. crunchy romaine.. fresh errthang.\n\nOrdering is  easy - I always order via ChowNow. Love how the sandos arrive- in a box, all cut in half. Perfect for offices and on the go events (like picnics!). Also the perfect half sandwich size so you can eat another half (of a different sando!).  I REALLY enjoyed the deviled egg sando. The brioche bread was delicious. Everyone at the office enjoyed their sando + salad!\n\nSterling, the owner of Mission Picnic kindly delivered our order this morning. Delivery was flawless and on time (in fact a few minutes early) which fit perfectly with my schedule. \n\nHere's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, baby arugula tossed with lemon chive oil on focaccia\n\nABT\ndouble bacon, avocado, thick tomato, green leaf lettuce, mayo on focaccia\n\n(not pictured): Deluxe Cobb Salad: chopped romaine, mixed greens, grilled chicken, market egg, crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette\n\nThanks, Mission Picnic!", "rating": 5, "date": "2018-05-23"}, {"excerpts": ["I ordered the MozzaPesto Sandwich & Watermelon Juice. ", "I enjoyed the Watermelon Juice more than the sandwich! ", "I think the roasted red pepper in the MozzaPesto threw me off. ", "The Watermelon Juice reminded me of the Watermelon Juice I drank when I was in Krabbi, Thailand, sooo good!!!!!!!\n\n"], "author": "Geraldine R.", "review": "Stopped by for lunch! Cute little sandwich shop with nice service! \n\nI ordered the MozzaPesto Sandwich & Watermelon Juice. I enjoyed the Watermelon Juice more than the sandwich! I think the roasted red pepper in the MozzaPesto threw me off. The Watermelon Juice reminded me of the Watermelon Juice I drank when I was in Krabbi, Thailand, sooo good!!!!!!!\n\nI will come back to try the Cesar Salad & a few other sandwiches, then update my review!", "rating": 3, "date": "2015-04-14"}, {"excerpts": ["*MozzaPesto (Mozzarella, basil, tomato & pesto aioli)\n", "*"], "author": "Cherylynn N.", "review": "One of my favorite FOBanese dishes is Hainan Chicken Rice. Something about the simply boiled chicken, deliciously oily rice and aromatic ménage a trios of sauces (chili, ginger and dark soy) makes me...uhh, makes me happy. Sorry, going to keep it PG-rated for once.\n\nSo naturally seeing the Hainan Chicken Sandwich on Mission Picnic's FB page almost made me keel over. A FOBanese American Sandwich? I'm all over it! I hoped into my imaginary rice rocket and vroomed vroomed my way to Mission Picnic yesterday while bumping to Stevie B.\n\nMission Picnic is a new sandwich shop serving seasonal sandwiches; some with an Asian twist. They're currently in their soft opening stage and have an awesome deal of 50% off your purchase (till today). Their Grand Opening is tomorrow.\n\nFormerly the Corazon Juice Bar, Mission Picnic is a tiny shop with just four two-top tables so this is more of a to-go place.\n\nFor their soft opening, they had 6 sandwiches available (~$8-9):\n*Picnic Club (Rotisserie chicken salad w/ bacon & cheddar)\n*Hainan Chicken (Garlic rotisserie chicken w/ cucumber & picnic spread)\n*San Franciscan (Hot pastrami, turkey & provolone)\n*Devil's Egg (Market boiled egg, bacon & provolone)\n*MozzaPesto (Mozzarella, basil, tomato & pesto aioli)\n*The King (Peanut butter, bananas, honey chocolate & frosted flakes).\n\nThey'll also have soups and salads in the future. \n\nMake sure to try one of their refreshing fruit shakes (pineapple, watermelon or strawberry - $2.75). I had the watermelon which was more like a fresh watermelon juice slushy but it was really good (no sugar added).\n\nCASH ONLY.\n\nThe Hainan Chicken Sandwich was nicely packed with tenderly moist garlic rotisserie chicken, sliced cucumbers, tomato, lettuce & picnic spread on dutch crunch: http://bit.ly/171yYMd. The picnic spread of garlic and parsley was slathered onto the bread before toasting so all that garlicky goodness soaked into every nook and cranny. So yummy!\n\nWhile the sandwich was solid and made with top-notch ingredients, it was more like a garlic pesto-ish chicken sandwich to me. I was hoping it would be more FOBanese. There was no ginger in the spread and ginger is what makes hainan chicken \"hainan\" imo. And, although the dutch crunch had a deliciously crunchy mottled crust, I think a less carb heavy bread like a baguette would let the ingredients shine for this particular sandwich. Just my two cents.\n\nOne of owners, Sterling was super nice and encouraged customer feedback which is always a sign to build customer loyalty and remain competitive in this marketplace. I hope he does see this and offers several FOBanese sandwich options in the future including vegan options for my Yelpie friend John B.  who's always in the hood and for all the surrounding PBR drinking and camel toe inducing skinny jean lovers of course.\n\nMission Picnic has a lot of potential and this was just their soft opening so I can't wait to see what other specialty sandwich ideas they have up their sleeve...\n\nPerhaps a pulled pork with apple wasabi slaw sandwich, a Tonton sesame marinated tofu w/ portobello mushroom sandwich, a longanisa banh mi or a loco moco sloppy joe? I can go on and on.\n\nNow only if I can come up with ideas like that in my field of work instead of looking like a deer caught in headlights all the time...", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["My wife got the Mozzapesto, which she said was fantastic."], "author": "Benjamin T.", "review": "Very tasty sandwiches and friendly waitstaff. I have tried the pollopesto and really liked it. I have tried the San Francisco, which was nice. My wife got the Mozzapesto, which she said was fantastic.", "rating": 5, "date": "2016-11-22"}, {"excerpts": ["Mozzapesto on focaccia, San Franciscon (west coast style pastrami with provolone) on rustic French, The King (only sweet sandwich with peanut butter, banana, honey, chocolate, frosted flakes!) "], "author": "T L.", "review": "(See pics) Review #1351.Sandwich is more 3.5 stars. The 4 stars is because of the dessert.\n\nWhat was once popular Corazon Juicebar (there were people coming in looking for the old place) now is a sandwich shop. No sign until Friday (3/28) as they are really trying to test out their menus WITHOUT too much publicity.\n\nI really think the owner has a kick in making DESSERTS more than the sandwiches and that is why reviewing the dessert first as it's the real highlight!\n\nSterling has recently lived in France so this looks like a dream extension. Every dessert is made by him and as he mentioned (yeah sorry I was skeptical), it's the lighter sweet kind! They looked so very pretty and meticulously elegant, from tiramisu to chocolate, to fruit tarts. All were lovely and I had the strawberry cake and must say the aroma bursts out through the creamy silkness! If they would only add the coffee drink or tea, it will be a perfect afternoon spot or after dinner place to relax.\n\nOnto the sandwiches, they have a handful selection including Devil's Eggs on deli white (suggested it would be a real nice appetizer), Mozzapesto on focaccia, San Franciscon (west coast style pastrami with provolone) on rustic French, The King (only sweet sandwich with peanut butter, banana, honey, chocolate, frosted flakes!) on brioche, Picnic Club (chicken with chipotle) on ciabatta and Hainan Chicken on dutch crunch.\n\nWas totally eying the Hainan chicken but that was the one not recommended. The owner, Sterling, said if you are Chinese and had the Hainan chicken back home, you would find it to be not like that. Asked if maybe there was a twist to his recipe and it was said to still be perfected. So instead I ordered his recommendation (his most confident dish like The Taste show) and had the Picnic Club.\n\nThe chicken was decently 3.35 stars but the good substantial size made it up to 3.5 stars. It's $8.5 but paid half price as everything is (drinks and food) until Friday night during their soft opening. The little bacon bites were with a tingle of sweetness and a nice touch of crunchiness. It was also packed with mustard, lettuce and tomato, the standard. Did sincerely suggested that every sandwich has to be good and not just 1 or 2 signatures in the long run and look forward to the future visits.\n\nThey also made quiches in house. So many choices in such a small place!\n\nAnother major high point is they are currently open until 8pm and midnight on the weekends. This is bound to change to also open until midnight during the week. Considering Revolution is just around the corner and the shop is in between 2 major, major streets of late night establishments, or if you just live in the hood, having a bite here is a refreshing new option comparing with the bacon wrapped hot dogs and pizza, as one patron excitedly pointed out about the choice of switching out pizzas.\n\nThe peeps here were super friendly, like Mission genuine friendly, and the business partner who came in a bit later was also a nice chap checking and preparing more decorations and chit chatted with customers.\n\nDo want to see when this tiny shop expands to include next door office space, as well as other choices of sandwiches such as anchovy with capers (would be a definite to try.)\n\nGrand opening is this Saturday and if you are into vodka they are planning on having a party serving that with other refreshments and food.", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["Got the mozzapesto, it was good. ", "I wasn't terribly impressed with the bread ", "and I thought the slices of mozzarella could have been a little more substantial. ", "I would definitely go back but probably wouldn't order the mozzapesto again."], "author": "Cole G.", "review": "Got the mozzapesto, it was good. I wasn't terribly impressed with the bread and I thought the slices of mozzarella could have been a little more substantial. Pesto was excellent and roasted peppers a nice touch.\n\nI would definitely go back but probably wouldn't order the mozzapesto again.", "rating": 3, "date": "2015-06-29"}, {"excerpts": ["A great twist on some classics (we ordered the Cobb, Caesar, Cranturkey, and Mozzapesto). ", "Loved it."], "author": "Kat H.", "review": "Delicious! Ordered delivery for a meeting at the office and we all agreed, super yummy. The food was fresh and arrived when we requested, the dude even came up to our floor! We will forsure be ordering again from here. A great twist on some classics (we ordered the Cobb, Caesar, Cranturkey, and Mozzapesto). Loved it.", "rating": 5, "date": "2014-10-07"}], "london broil": [{"excerpts": ["And the london broil and premium vegan are both tied at a close second (really depends if I'm craving more red meat or something lighter and filled with veggies but still filling).\n\n"], "author": "Aiko H.", "review": "This little gem is incredible! My fiancé and myself have tried this place a couple times, and each time has been amazing. They deliver really fast, too! (with our orders being correct, naturally) \n\nI personally am not normally one for sandwiches, but Mission Picnic has made me a believer! If all places made sandwiches as delicious as theirs, I wouldn't mind having sandwiches more regularly. They've set the bar really high with a brand new standard for sandwiches!! \n\nMy favorite sandwich from here is the smoked salmon, and they are pretty darn generous with the salmon which is always a big plus with me :) And the london broil and premium vegan are both tied at a close second (really depends if I'm craving more red meat or something lighter and filled with veggies but still filling).\n\nTheir salads are really good as well. I'm particularly fond of their beets and greens entree salad, but their side baby arugula salad was quite filling, too. \n\nSo overall, this place is amazing. They've found new regulars.", "rating": 5, "date": "2017-08-13"}, {"excerpts": ["Ordered to London Broil during peak lunch time madness, only a 10 min wait for the sandwich.  ", "The beef was pretty good quality but the standout was the bread.  ", "It was a crusty but soft french roll and everytime ", "I took a bite it just took me back to Paris on the river.  ", "Def. "], "author": "Kevin H.", "review": "First time visitor, have heard about this place for awhile but was never able to see it until walking past one day.  The storefront is small, so small that if you blink you might miss it.  \n\nOrdered to London Broil during peak lunch time madness, only a 10 min wait for the sandwich.  The beef was pretty good quality but the standout was the bread.  It was a crusty but soft french roll and everytime I took a bite it just took me back to Paris on the river.  Def. a small seating area and in an area that will be a bit of a hike to get to the closest neighborhood park.  \n\nI'll be back, for the bread.", "rating": 4, "date": "2015-07-08"}, {"excerpts": ["Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. ", "I'd definitely come back again!"], "author": "Holly P.", "review": "Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. I'd definitely come back again!", "rating": 5, "date": "2014-08-31"}, {"excerpts": ["I ordered the Chicken Caesar Salad and London Broil Sandwich to go on April 27. ", "And upon arriving at this place, the cashier did not even say a word and just blindly stare at me. ", "I understand it was Sunday afternoon ", "and he probably is hung-over from last night party or something. ", "But you don't have to be so cold and ", "no emotion on his face whatsoever. ", "For some reason, I thought he included utensil in the salad box. ", "Nope, not a single fork or napkin. "], "author": "Kenny O.", "review": "Service Review:\n\nFirst time order at this place and what a disappointment! I ordered the Chicken Caesar Salad and London Broil Sandwich to go on April 27. And upon arriving at this place, the cashier did not even say a word and just blindly stare at me. I understand it was Sunday afternoon and he probably is hung-over from last night party or something. But you don't have to be so cold and no emotion on his face whatsoever. For some reason, I thought he included utensil in the salad box. Nope, not a single fork or napkin. It's such a joke to found out you can't enjoy your food at picnic because you got no fork.\n\nFood Review:\n\nI would give Mission Picnic 0 star if I could, but the food here are decent. To be fair, the chicken salad at this place is exceptionally good. The parmesan and crouton pair perfectly that gives you crunchiness and chewiness at the same time. The sandwich was OK, just like any other industrialized sandwich you got from Safeway.", "rating": 1, "date": "2014-05-02"}, {"excerpts": ["I got the London Broil (the roast beef sandwich) and ", "the meat was tender, good portioned, and a great match with the aioli!"], "author": "Christina H.", "review": "Despite the spot being a hole in the wall, it is clean and all the ingredients are fresh and of high quality - from the tomato, arugula, bread to....you name it! Bread is done crispy but not dry. I got the London Broil (the roast beef sandwich) and the meat was tender, good portioned, and a great match with the aioli!", "rating": 5, "date": "2015-05-28"}, {"excerpts": ["My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well."], "author": "Rachel A.", "review": "Mission Picnic has amazing sandwiches.  To be honest, I've only ever had the Picnic Club, and I am so satisfied with it that I have no desire to branch out.  The chicken salad defines what a chicken salad should be, and the tomatoes are fresh.  It's best to call in ahead of time or order online so you don't have to wait, and since there are only a few tables it's often better to get take out.  The sandwiches are so large they will probably last you through almost 2 meals.  My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well.", "rating": 4, "date": "2014-07-13"}, {"excerpts": ["My husband had the london broil which he absolutely loved. "], "author": "michelle b.", "review": "Today was my first visit to Mission Picnic. Prices ranged about 9-10 dollars for a sandwich. There are only three tables so you best to expect to take it out. \n\nI had the Southerner which was just okay. My husband had the london broil which he absolutely loved. That is saying something for him, very picky.\n\nThe people working there were extremely friendly and helpful. I made a few changes on my sandwich, (maybe that was why it was just okay), and they had no problem with that.\n\nWith any restaurant, you are never going to get everyone to agree and love it. I would say go try it and see for yourself. It was good with fresh ingredients and very filling.\n\nI will be back.", "rating": 4, "date": "2014-04-06"}, {"excerpts": ["Love the London Broil and Mozzopesto sandwiches. "], "author": "Amin S.", "review": "Love the London Broil and Mozzopesto sandwiches. I tried the Pollopesto sandwich, but it's a bit on the dry side.", "rating": 5, "date": "2014-03-09"}], "pollopesto": [{"excerpts": ["Here's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, "], "author": "Chantel Y.", "review": "MMM. I'm not a big fan of sandos but I do enjoy a fresh one made with lots of love from time to time ;). And when I do order sandwiches for the office, I choose Mission Picnic! The veggies are SOOO FRESHHHHHH. Crunchy arugula.. crunchy romaine.. fresh errthang.\n\nOrdering is  easy - I always order via ChowNow. Love how the sandos arrive- in a box, all cut in half. Perfect for offices and on the go events (like picnics!). Also the perfect half sandwich size so you can eat another half (of a different sando!).  I REALLY enjoyed the deviled egg sando. The brioche bread was delicious. Everyone at the office enjoyed their sando + salad!\n\nSterling, the owner of Mission Picnic kindly delivered our order this morning. Delivery was flawless and on time (in fact a few minutes early) which fit perfectly with my schedule. \n\nHere's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, baby arugula tossed with lemon chive oil on focaccia\n\nABT\ndouble bacon, avocado, thick tomato, green leaf lettuce, mayo on focaccia\n\n(not pictured): Deluxe Cobb Salad: chopped romaine, mixed greens, grilled chicken, market egg, crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette\n\nThanks, Mission Picnic!", "rating": 5, "date": "2018-05-23"}, {"excerpts": ["aka the Pollopesto. ", "Ooooommmg. ", "I never had a sandwich where i enjoyed every single bite. "], "author": "Jen Y.", "review": "THE. BEST. SANDWICH. IN. THE. WORLD. aka the Pollopesto. Ooooommmg. I never had a sandwich where i enjoyed every single bite. 5/5 seriously.\n\nPremium vegan- felt like a health god eating this sandwich. Taste was a 3/5 but for a healthier choice- worth it. To help the slight blandness- i got the mamazuma revenge chips which were bomb if you enjoy spicy food! \n\nThe bread is insanely good. Its crispy on the outside, but soft and chewy in the inside. The chicken was super moist- and the pesto was perfect in seasoning. This place was so good that i woke up the next day and walked 10 blocks to have it again. Need i say more?????", "rating": 5, "date": "2018-02-02"}, {"excerpts": ["I had the pollopesto and it was awesome."], "author": "Vincent A.", "review": "Simple, but delicious. Basically everything a sandwich shop should be.  \n\nI had the pollopesto and it was awesome.", "rating": 5, "date": "2017-11-10"}, {"excerpts": ["Pollopesto - 5/5. ", "Pesto very flavorful, lemon chive oil does come through to combine the ingredients."], "author": "Ojus P.", "review": "Incredible bread, fresh delicious flavors, unbelievable watermelon juice. This sounds crazy but there's a \"swagger\" to this sandwich place. I'm very eager to go back.\n\nPollopesto - 5/5. Pesto very flavorful, lemon chive oil does come through to combine the ingredients.", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["I have tried the pollopesto and really liked it. ", "I have tried the San Francisco, which was nice. "], "author": "Benjamin T.", "review": "Very tasty sandwiches and friendly waitstaff. I have tried the pollopesto and really liked it. I have tried the San Francisco, which was nice. My wife got the Mozzapesto, which she said was fantastic.", "rating": 5, "date": "2016-11-22"}, {"excerpts": ["Would've paid $20 for that pollopesto sandwich ", "it was ", "so dang good. ", "Bread was perfectly crisp and you can tell only fresh ingredients are used. ", "Huge portion, too! ", "This place is a cute hole in the wall, but we warned it only seats about 6 people! ", "I walked over to nearby mission park to eat."], "author": "Carolyn K.", "review": "At first I was a little upset I paid $10 for a sandwich ($14 with watermelon juice) but then I started eating it... Would've paid $20 for that pollopesto sandwich it was so dang good. Bread was perfectly crisp and you can tell only fresh ingredients are used. Huge portion, too! This place is a cute hole in the wall, but we warned it only seats about 6 people! I walked over to nearby mission park to eat.", "rating": 5, "date": "2016-06-15"}, {"excerpts": ["I had the Pollopesto sandwich, which aside from its namesake(s) is also stuffed with goat cheese, baby arugula, tomato, and lemon-chive oil (omg)--it was fresh, well-balanced, and delicious, and washed down perfectly with their cold watermelon juice. ", "My friend had the vegan sandwich, which was also tasty but not quite as delightful as the Pollopesto (sorry, friend).\n\n"], "author": "Angela L.", "review": "I would've walked right past Mission Picnic if not for Yelp, so ... thanks, Yelp!\n\nThe vibe is super relaxed and friendly. Be warned that it's *tiny*, with maybe three or four tables for two at the most, so plan on taking your order to go. (Dolo is just a few blocks away!)\n\nI had the Pollopesto sandwich, which aside from its namesake(s) is also stuffed with goat cheese, baby arugula, tomato, and lemon-chive oil (omg)--it was fresh, well-balanced, and delicious, and washed down perfectly with their cold watermelon juice. My friend had the vegan sandwich, which was also tasty but not quite as delightful as the Pollopesto (sorry, friend).\n\nThe next time I'm looking for something quick, portable, and tasty in the Mission and don't want a giant burrito (read: am sober), I'll be sure to stop by!", "rating": 5, "date": "2015-01-19"}, {"excerpts": ["The pollopesto was amazing -- flavorful pesto, goat cheese, chicken, and tomato on crispy focaccia.  ", "My friend enjoyed the vegan sandwich.  ", "My only complaint is that the menu didn't specify that there'd be cheese in the side salad, so my vegan friend couldn't eat it."], "author": "Kellie O.", "review": "I stopped by here to pick up sandwiches for a picnic.  The pollopesto was amazing -- flavorful pesto, goat cheese, chicken, and tomato on crispy focaccia.  My friend enjoyed the vegan sandwich.  My only complaint is that the menu didn't specify that there'd be cheese in the side salad, so my vegan friend couldn't eat it.", "rating": 4, "date": "2016-08-17"}, {"excerpts": ["My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well."], "author": "Rachel A.", "review": "Mission Picnic has amazing sandwiches.  To be honest, I've only ever had the Picnic Club, and I am so satisfied with it that I have no desire to branch out.  The chicken salad defines what a chicken salad should be, and the tomatoes are fresh.  It's best to call in ahead of time or order online so you don't have to wait, and since there are only a few tables it's often better to get take out.  The sandwiches are so large they will probably last you through almost 2 meals.  My roommates say the San Franciscan, London Broil, and Pollopesto are excellent choices as well.", "rating": 4, "date": "2014-07-13"}, {"excerpts": ["I tried the Pollopesto sandwich, but it's a bit on the dry side."], "author": "Amin S.", "review": "Love the London Broil and Mozzopesto sandwiches. I tried the Pollopesto sandwich, but it's a bit on the dry side.", "rating": 5, "date": "2014-03-09"}], "abt": [{"excerpts": ["baby arugula tossed with lemon chive oil on focaccia\n\nABT\ndouble bacon, avocado, thick tomato, green leaf lettuce, mayo on focaccia\n\n(not pictured): "], "author": "Chantel Y.", "review": "MMM. I'm not a big fan of sandos but I do enjoy a fresh one made with lots of love from time to time ;). And when I do order sandwiches for the office, I choose Mission Picnic! The veggies are SOOO FRESHHHHHH. Crunchy arugula.. crunchy romaine.. fresh errthang.\n\nOrdering is  easy - I always order via ChowNow. Love how the sandos arrive- in a box, all cut in half. Perfect for offices and on the go events (like picnics!). Also the perfect half sandwich size so you can eat another half (of a different sando!).  I REALLY enjoyed the deviled egg sando. The brioche bread was delicious. Everyone at the office enjoyed their sando + salad!\n\nSterling, the owner of Mission Picnic kindly delivered our order this morning. Delivery was flawless and on time (in fact a few minutes early) which fit perfectly with my schedule. \n\nHere's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, baby arugula tossed with lemon chive oil on focaccia\n\nABT\ndouble bacon, avocado, thick tomato, green leaf lettuce, mayo on focaccia\n\n(not pictured): Deluxe Cobb Salad: chopped romaine, mixed greens, grilled chicken, market egg, crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette\n\nThanks, Mission Picnic!", "rating": 5, "date": "2018-05-23"}, {"excerpts": ["ABT is awesome and what I typically order. ", "The Focaccia bread is divine. "], "author": "Autumn C.", "review": "ABT is awesome and what I typically order. The Focaccia bread is divine. Today I tried the Picnic Club and it was really great as well. Truly an awesome place to grab a quick bite. You won't be sorry. They have limited seating so be prepared to have to grab and go if there are not any seats available. I hope to try a salad next time but man it's hard to pass up a sandwich.", "rating": 5, "date": "2017-12-15"}, {"excerpts": ["so naturally, I went with the ABT which has, yes, DOUBLE BACON. ", "Before I started eating, I had to admire my ABT first. ", "Mission Picnic did NOT hold back on the bacon. ", "The proportion of all the ingredients was beautiful. ", "Then I had to eat it... ", "The ABT was DEFINITELY the best BLT-type sandwich I have ever had in my life thus far. "], "author": "Sara C.", "review": "Even though we came to Mission Picnic for their Hainan Chicken sandwich (which they did not have), my experience here turned out to be positive.\n\nYes, the place is pretty small, but the line (which can grow to be quite long) does go by quickly. They have a number of great selections here, so know what you're getting because it's easy to change your mind!\n\nSince I smelled the bacon wafting in from the kitchen, I knew I had to get a sandwich with bacon... so naturally, I went with the ABT which has, yes, DOUBLE BACON. I also decided to get a side of potato salad since I love potato salad (and I was wanted to eat a little something while waiting for my bacon-licious sandwich).\n\nWe decided to eat at Dolores Park, so after a pleasant walk from the sandwich shop to the park, I FINALLY got to unwrap my sandwich.\n\nBefore I started eating, I had to admire my ABT first. Mission Picnic did NOT hold back on the bacon. The proportion of all the ingredients was beautiful. Then I had to eat it... and oh my goodness was it such an out of body experience. \n\nThat bacon... THAT BACON. WAS INCREDIBLE. SO CRISPY AND DELICIOUS AND SO MUCH OF IT. Not to mention, the mayo was KILLER and the avocado was SO FRESH. The ABT was DEFINITELY the best BLT-type sandwich I have ever had in my life thus far. I can't forget about the bread either... so amazing.\n\nWhy four stars? The sandwich was DEFINITELY five stars. Unfortunately, the potato salad was a little too rich for my liking. A little too much cheese... though the first few bites were pretty good.\n\nIf you're ever looking for a place to get your picnic fixings, definitely stop by Mission Picnic!", "rating": 4, "date": "2014-06-22"}, {"excerpts": ["I shared an ABT sando and a massive beet and green salad. ", "No complaints that day. "], "author": "Tori M.", "review": "I've had this place twice now and the first time was great. I shared an ABT sando and a massive beet and green salad. No complaints that day. Didn't even mind the kind of inflated price.\n\nSecond time I go in, I order the kale caesar and the nuevo cubano. NO KALE. I kid you not, this was the worst kale caesar salad I've ever had for $8 +3 with chicken!) in that it didn't have kale in it. Just romaine, those fake, crappy, flavorless croutons, maybe like 4 tiny tomatoes and 3 pieces of tiny anchovies and the dressing was pretty gross. I almost called them because it was such a huge disappointment. When you call something a \"kale caesar\" it should have more kale and less romaine. Why emphasize the kale part in the title? After the beet and greens salad, I was expecting something higher quality. The cubano was 9.50 and turned to mush. Maybe the other sandos are okay, but that's not one of the better ones. I'm very hesitant to go in again.", "rating": 2, "date": "2015-04-29"}, {"excerpts": ["Upon entering this tiny little shop we were whetted by the menu on the wall: Nuuevo Cubano, Hainan Chicken, ABT, San Franciscan (pastrami and oven-baked turkey)... ", "all sounded good and yummy. ", "A guy came in toward the end of our meal and asked for ABT without the B---that is, bacon! ", "So here you go. ", "Give this place a try. "], "author": "Matt Y.", "review": "5/17/13 Lunch\n\nA new sandwich shop serving sammies with a twist. Upon entering this tiny little shop we were whetted by the menu on the wall: Nuuevo Cubano, Hainan Chicken, ABT, San Franciscan (pastrami and oven-baked turkey)... all sounded good and yummy. After a few minutes of deliberation, my friend and I decided on two to share:\n\n*Nuevo Cubano: roasted pork and black forest ham with red pickled onion, a slice of pineapple on a crispy ciabatta. The avocado/jalapeno aioli and dijon all folded into a yummy flavor. I didn't taste the roasted pork but the ham was good. Pineapple dominated the flavor so maybe they could put more meat?\n\n*Hainan Chicken: this one, served on a rustic French roll, is almost twice the side of the Cubano. \"Hainan\" is really \"Ayam\" from Malay, meaning chicken. Ayam became Hainan when the boiled chicken dish came to China. Anyway, the Hainan chicken sandwich here doesn't come with the usual ginger, but a garlicky butter and scallion oil. Maybe they should consider a crushed ginger dip like that you get from a Chinese deli? The chicken is simply boiled but very tender and moist, unlike the usual leathery, rubbery texture of deli chicken. The assembly, complete with cilantro, sliced tomato and cucumber, looked a bit like a bunh mi. \n\nWe were also tempted by their special creation of the day: a French Toast sandwich with lumps of strawberries powdered sugar. But we were too full to have a go at dessert. They also have a PBJ sandwich, as well as a Salami plate. Guilty of having too much carbs? Get the Peach and Avocado salad.\n\nSo many possibilities here at Mission Picnic even though they don't offer katsu, the staple of Rhea down the street. They also allowed substitution. A guy came in toward the end of our meal and asked for ABT without the B---that is, bacon! So here you go. Give this place a try. Sammies are not piping toasty.\n\nMinimum $10 for credit card.", "rating": 4, "date": "2013-05-17"}, {"excerpts": ["We shared 4 different sandwiches: the ABT, Pollo Pesto, Nuevo Cubano, and Cranturkey. ", "The Cranturkey was my absolute favorite-- a lightly crisped french roll and just the right amount of cranberry sauce so as to not overpower the rest of the ingredients. ", "The Nuevo Cubano was an unexpected runner up; normally I avoid pineapple in savory dishes because I think the combination is barfworthy, but again, the NC had just enough to add an unexpected kick. ", "I thought the Pollo Pesto tasted a bit bland in comparison to the other sandwiches we picked up, but it actually came out as the favorite for 2 out of 4 people in our sandwich-tasting crew."], "author": "Kristina C.", "review": "I picked up a few sandwiches from here last week to lug to a friend's house for an indoor picnic of sorts. About half an hour later when we finally sat down to eat, I expected the sandwiches to be at least a little soggy and drippy, but that wasn't the case at all-- somehow, after being manhandled for a solid 20 minutes during the walk from Mission Picnic to my friend's place, the sandwiches still managed to stay perfectly intact. The bread was surprisingly still crispy, as if it'd just come out of the oven, and the ingredients were all in their rightful places and tasted totally fresh. The sandwiches weren't dry either, so I have no idea how they maintained their crispiness, but it was gooood. Sandwich magic, I guess.\n\nWe shared 4 different sandwiches: the ABT, Pollo Pesto, Nuevo Cubano, and Cranturkey. The Cranturkey was my absolute favorite-- a lightly crisped french roll and just the right amount of cranberry sauce so as to not overpower the rest of the ingredients. The Nuevo Cubano was an unexpected runner up; normally I avoid pineapple in savory dishes because I think the combination is barfworthy, but again, the NC had just enough to add an unexpected kick. I thought the Pollo Pesto tasted a bit bland in comparison to the other sandwiches we picked up, but it actually came out as the favorite for 2 out of 4 people in our sandwich-tasting crew.", "rating": 5, "date": "2015-01-06"}, {"excerpts": ["Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. ", "I'd definitely come back again!"], "author": "Holly P.", "review": "Tried the San Franciscan, ABT, and London Broil, and all of them were super delicious. I'd definitely come back again!", "rating": 5, "date": "2014-08-31"}, {"excerpts": ["I've had the ABT and ", "while it definitely satisfied my bacon craving (hello double bacon!), the toasted rosemary foccacia was a little rough on my mouth. "], "author": "Eilene G.", "review": "I love this place!\n\nThe sandwiches are so so delicious and filling. I usually get the turkey cran and it does not disappoint. It's a perfect blend of turkey, cranberry sauce, and sprouts & other veggies that create the perfect texture and flavor combinations. \n\nI've had the ABT and while it definitely satisfied my bacon craving (hello double bacon!), the toasted rosemary foccacia was a little rough on my mouth. Personally, this sandwich is better eaten in halves like an open-face. \n\nI've only ordered to-go because the place is quite small and can easily get crowded. Luckily they work through the line quickly.", "rating": 5, "date": "2014-06-27"}, {"excerpts": ["I changed to the ABT. ", "Again, a minute later, another call saying they're out of focaccia bread and ", "they only have French loaves left. ", "WTF? ", "Fine, I'll deal. "], "author": "Kim N.", "review": "Ordered the Devil's Egg and Premium Vegan sandwiches for delivery through Eat 24. Around two minutes after order placement, I get a call from the Mission Picnic saying they're out of the Devil's Egg. Okay, that's fine. I changed to the ABT. Again, a minute later, another call saying they're out of focaccia bread and they only have French loaves left. WTF? Fine, I'll deal. However, I specified for the Premium Vegan to have NO ONIONS! What does the sandwich come with when delivered? A field of HORRID RED ONIONS! At this point, I'm livid and pick off each piece of onion. I vow never to order for delivery again.\n\nThe sandwiches merit the prices and flavor is good, not great. I ate half of the Vegan, onionless sandwich and my breath reeks of ONIONS!  Delivery service was quick because I received my order with 20 minutes. Delivery guy was very nice. Service reps at the store are another story! READ ORDER SPECIFICATIONS THOROUGHLY POR FAVOR!", "rating": 2, "date": "2013-08-21"}, {"excerpts": ["Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. ", "I heard many good things about Mission Picnic since it first opened"], "author": "Sebastian H.", "review": "I love this place! Mission Picnic got me to eat a Vegan Sandwich. I LIKED IT. I highly recommend Mission Picnic for catering your event! Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. I heard many good things about Mission Picnic since it first opened", "rating": 4, "date": "2014-07-03"}, {"excerpts": ["Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. ", "We love the sandwiches because the ingredients are fresh, generous, and put together with care. ", "Breads are perfectly toasted, bacon is always crispy, and deli meats are top quality. ", "Though we love the sandwiches, the incredibly kind and friendly staff are what keep us coming back. ", "We are always welcomed with a smile (we love Jennifer!) ", "and the place has a happy, upbeat vibe. ", "Highly recommend Mission Picnic!"], "author": "Suzanne G.", "review": "Mission Picnic has an outstanding staff and super tasty sandwiches--our favorites are the ABT and the Picnic Club. We love the sandwiches because the ingredients are fresh, generous, and put together with care. Breads are perfectly toasted, bacon is always crispy, and deli meats are top quality. Though we love the sandwiches, the incredibly kind and friendly staff are what keep us coming back. We are always welcomed with a smile (we love Jennifer!) and the place has a happy, upbeat vibe. Highly recommend Mission Picnic!", "rating": 5, "date": "2014-05-23"}, {"excerpts": ["The ABT Sandwich has the most bacon I've ever seen on a sandwich, great sandwich!  ", "Stopped by on the way home twice this week, I'm addicted!"], "author": "Ken B.", "review": "What a great find!  Fast service and a great menu!  The Nuevo Cubana is fantastic,  super tasting sandwich.  The ABT Sandwich has the most bacon I've ever seen on a sandwich, great sandwich!  Stopped by on the way home twice this week, I'm addicted!", "rating": 5, "date": "2014-07-15"}], "premium vegan": [{"excerpts": ["And the london broil and premium vegan are both tied at a close second (really depends if I'm craving more red meat or something lighter and filled with veggies but still filling).\n\n"], "author": "Aiko H.", "review": "This little gem is incredible! My fiancé and myself have tried this place a couple times, and each time has been amazing. They deliver really fast, too! (with our orders being correct, naturally) \n\nI personally am not normally one for sandwiches, but Mission Picnic has made me a believer! If all places made sandwiches as delicious as theirs, I wouldn't mind having sandwiches more regularly. They've set the bar really high with a brand new standard for sandwiches!! \n\nMy favorite sandwich from here is the smoked salmon, and they are pretty darn generous with the salmon which is always a big plus with me :) And the london broil and premium vegan are both tied at a close second (really depends if I'm craving more red meat or something lighter and filled with veggies but still filling).\n\nTheir salads are really good as well. I'm particularly fond of their beets and greens entree salad, but their side baby arugula salad was quite filling, too. \n\nSo overall, this place is amazing. They've found new regulars.", "rating": 5, "date": "2017-08-13"}, {"excerpts": ["This is definitely my favorite place to get a vegan sandwich from, the premium vegan sandwich is sooooo good like omg you have to try it!!! ", "Love it lots. ", "Customer service is great too, they're really fast and nice. ", "10/10 would recommend"], "author": "Alisha A.", "review": "This is definitely my favorite place to get a vegan sandwich from, the premium vegan sandwich is sooooo good like omg you have to try it!!! Love it lots. Customer service is great too, they're really fast and nice. 10/10 would recommend", "rating": 5, "date": "2017-10-15"}, {"excerpts": ["Ordered the Devil's Egg and Premium Vegan sandwiches for delivery through Eat 24. ", "Around two minutes after order placement, I get a call from the Mission Picnic saying they're out of the Devil's Egg. ", "Okay, that's fine. ", "However, I specified for the Premium Vegan to have NO ONIONS! ", "What does the sandwich come with when delivered? ", "A field of HORRID RED ONIONS! ", "At this point, I'm livid and pick off each piece of onion. "], "author": "Kim N.", "review": "Ordered the Devil's Egg and Premium Vegan sandwiches for delivery through Eat 24. Around two minutes after order placement, I get a call from the Mission Picnic saying they're out of the Devil's Egg. Okay, that's fine. I changed to the ABT. Again, a minute later, another call saying they're out of focaccia bread and they only have French loaves left. WTF? Fine, I'll deal. However, I specified for the Premium Vegan to have NO ONIONS! What does the sandwich come with when delivered? A field of HORRID RED ONIONS! At this point, I'm livid and pick off each piece of onion. I vow never to order for delivery again.\n\nThe sandwiches merit the prices and flavor is good, not great. I ate half of the Vegan, onionless sandwich and my breath reeks of ONIONS!  Delivery service was quick because I received my order with 20 minutes. Delivery guy was very nice. Service reps at the store are another story! READ ORDER SPECIFICATIONS THOROUGHLY POR FAVOR!", "rating": 2, "date": "2013-08-21"}, {"excerpts": ["I had the premium vegan sandwich and the side baby arugula salad. ", "Fresh, tasty and healthy! ", "The people behind the counter were very friendly too!"], "author": "Abhi V.", "review": "Great place for a quick sandwich in the mission. I had the premium vegan sandwich and the side baby arugula salad. Fresh, tasty and healthy! The people behind the counter were very friendly too!", "rating": 4, "date": "2015-04-03"}, {"excerpts": ["We stopped by and had the Pesto-Mozzarella sandwich and the Premium Vegan. ", "The latter was such a bummer. ", "The sandwich was incredibly dry -- just a little hummus -- and there was no salt, no pepper, no seasoning whatsoever. ", "The Pesto-Mozzarella at least had some flavor, but zero points for innovation. ", "These are sandwiches you can find on any menu, and that can be prepared far better at home for a fraction of the price. ", "Major disappointment -- nothing distinctive, and no reason to return."], "author": "Scott B.", "review": "From the reviews, I assume the meat options are far better than the vegetarian options. We stopped by and had the Pesto-Mozzarella sandwich and the Premium Vegan. The latter was such a bummer. The sandwich was incredibly dry -- just a little hummus -- and there was no salt, no pepper, no seasoning whatsoever. The Pesto-Mozzarella at least had some flavor, but zero points for innovation. These are sandwiches you can find on any menu, and that can be prepared far better at home for a fraction of the price. Major disappointment -- nothing distinctive, and no reason to return.", "rating": 2, "date": "2014-12-26"}, {"excerpts": ["My premium vegan sandwich was so good, I got the chills!  ", "Everything super fresh and the focaccia was perfectly toasted."], "author": "John V.", "review": "Wow!  My premium vegan sandwich was so good, I got the chills!  Everything super fresh and the focaccia was perfectly toasted.", "rating": 5, "date": "2013-08-21"}], "salumi special": [{"excerpts": ["My favorite us the Salumi special.  \n", "It's located in the heart of mission with lots of walk in traffic.  ", "Long lines during the lunch rush!"], "author": "Sheila P.", "review": "My favorite to go place for sandwiches and salads.  Everyone is extremely nice.  They also cater to companies throughout San Francisco.  My favorite us the Salumi special.  \nIt's located in the heart of mission with lots of walk in traffic.  Long lines during the lunch rush!", "rating": 5, "date": "2016-03-15"}, {"excerpts": ["The Salumi Special sammy is like an upscale muffaletta, which I have been craving. ", "I Can't believe it took me so long to discover this place."], "author": "Brooke B.", "review": "I'm in love. These are truly great sandwiches and a steal at the price. Every one I have tried has been exceptional. The salads are bountiful, simple, and flavorful. The $3 delivery fee - delivery via TCB - is worth every penny. My food usually arrives in half the time the confirmation email promises (and no hipster lines to wait in!). The Salumi Special sammy is like an upscale muffaletta, which I have been craving. I Can't believe it took me so long to discover this place.", "rating": 5, "date": "2013-12-18"}], "flatiron": [{"excerpts": ["*Flatiron: ", "Hot romanian pastrami layered high with melted muenster cheese, kosher pickles, deli mustard on french ($11.95)\n", "*"], "author": "Elena N.", "review": "For our weekly office lunch, I picked Mission Picnic. Our delivery order arrived via Caviar on Friday, June 23rd around 12 noon.\n\n*Flatiron: Hot romanian pastrami layered high with melted muenster cheese, kosher pickles, deli mustard on french ($11.95)\n*Baby Arugula Side Salad: Baby arugula salad dressed with lemon chive dressing ($3.75)\n*Potato Chips: Artisan chips from Route 11, Mama Zuma's Revenge ($1.95)\n\nWe have $20 to play with, so yes, I got a sandwich, salad, AND chips! The sandwich melded into one great bite. The pastrami salty, the cheese melty, the pickles sour. I'm not a huge bread person, but it was nice and chewy and soft. I had one bite with the bread and then just ate the insides. The cheese melted onto the bread, so I ended up having a little more bread with the filling which I didn't mind. (You can also request a lettuce wrap if you'd rather avoid the bread that way.) The salad was huge! Very densely packed in the takeout container. It ate some with my sandwich and ended up making a makeshift pastrami arugula salad. The only critique I had of the salad is that it needed more dressing. There was a tiny container about two thirds full for all that salad. It wasn't enough. I adored the chips. Great spice. If you can't handle heat, I suggest you pass on these as they may be the spiciest chips I've ever had.\n\nGreat place for sandwiches. All this food actually fed me three times that day. If Mission Picnic comes back into the rotation, I would definitely order from them again.", "rating": 4, "date": "2017-07-03"}], "southerner": [{"excerpts": ["I had the Southerner, which comes with bacon, marinated pork, and pimento cheese.  ", "Delicious!  ", "The fresh-baked chocolate chip cookie was a perfect finish.  ", "Friendly service, reasonable prices.  ", "Can't wait to try every sandwich on the menu!"], "author": "Dave N.", "review": "Great selection of artisanal sandwiches with super fresh ingredients and homemade bread (try the focaccia...damn!).  I had the Southerner, which comes with bacon, marinated pork, and pimento cheese.  Delicious!  The fresh-baked chocolate chip cookie was a perfect finish.  Friendly service, reasonable prices.  Can't wait to try every sandwich on the menu!", "rating": 5, "date": "2018-07-22"}, {"excerpts": ["Husband ordered the Southerner and Loved it - he is Fan of pimento cheese and a southerner. ", "I ordered the smoked salmon sandwich - delicious and perfect. ", "Saved the other half for lunch next day. ", "We shared the beet salad and it was fantastic! ", "Tried the hot jalapeño chips and they are HOT!"], "author": "June R.", "review": "LOVE this place near our church! New favorites- but pricey but worth every dollar. Fresh, huge portions and unique! Husband ordered the Southerner and Loved it - he is Fan of pimento cheese and a southerner. I ordered the smoked salmon sandwich - delicious and perfect. Saved the other half for lunch next day. We shared the beet salad and it was fantastic! Tried the hot jalapeño chips and they are HOT!", "rating": 5, "date": "2017-05-12"}, {"excerpts": ["Split the Southerner and Flat Iron with my boyfriend and didn't stop talking about how delicious the sandwiches were for like an hour after eating."], "author": "Jessica K.", "review": "New favorite sandwich spot in the city. Split the Southerner and Flat Iron with my boyfriend and didn't stop talking about how delicious the sandwiches were for like an hour after eating.", "rating": 5, "date": "2017-07-16"}, {"excerpts": ["I got the Southerner sandwich, which was okay but a bit misleading entirely overpriced for what you get: on the menu is was described as \"southern pork\", and in the south that would mean something along the lines of pulled pork. ", "Essentially it's just a ham and cheese sandwich, and not a very big one, for ten bucks. ", "I also opted for a side of potato salad, and it was the worst potato salad I've ever tasted... ", "it had the subtle taste of apples and processed cheese. ", "Yuck. ", "You can get a much better sandwich for the same price from other places nearby."], "author": "P U.", "review": "Service was very friendly and fast. I got the Southerner sandwich, which was okay but a bit misleading entirely overpriced for what you get: on the menu is was described as \"southern pork\", and in the south that would mean something along the lines of pulled pork. Essentially it's just a ham and cheese sandwich, and not a very big one, for ten bucks. I also opted for a side of potato salad, and it was the worst potato salad I've ever tasted... it had the subtle taste of apples and processed cheese. Yuck. You can get a much better sandwich for the same price from other places nearby.", "rating": 2, "date": "2015-06-11"}, {"excerpts": ["I had the Southerner which was just okay. "], "author": "michelle b.", "review": "Today was my first visit to Mission Picnic. Prices ranged about 9-10 dollars for a sandwich. There are only three tables so you best to expect to take it out. \n\nI had the Southerner which was just okay. My husband had the london broil which he absolutely loved. That is saying something for him, very picky.\n\nThe people working there were extremely friendly and helpful. I made a few changes on my sandwich, (maybe that was why it was just okay), and they had no problem with that.\n\nWith any restaurant, you are never going to get everyone to agree and love it. I would say go try it and see for yourself. It was good with fresh ingredients and very filling.\n\nI will be back.", "rating": 4, "date": "2014-04-06"}], "deluxe cobb": [{"excerpts": ["Deluxe Cobb Salad: chopped romaine, mixed greens, grilled chicken, market egg, crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette\n\nThanks, Mission Picnic!"], "author": "Chantel Y.", "review": "MMM. I'm not a big fan of sandos but I do enjoy a fresh one made with lots of love from time to time ;). And when I do order sandwiches for the office, I choose Mission Picnic! The veggies are SOOO FRESHHHHHH. Crunchy arugula.. crunchy romaine.. fresh errthang.\n\nOrdering is  easy - I always order via ChowNow. Love how the sandos arrive- in a box, all cut in half. Perfect for offices and on the go events (like picnics!). Also the perfect half sandwich size so you can eat another half (of a different sando!).  I REALLY enjoyed the deviled egg sando. The brioche bread was delicious. Everyone at the office enjoyed their sando + salad!\n\nSterling, the owner of Mission Picnic kindly delivered our order this morning. Delivery was flawless and on time (in fact a few minutes early) which fit perfectly with my schedule. \n\nHere's what I ordered (delivered today 5/23)\n\nDevil's Egg\nmarket egg salad, bacon crumbles, melted provolone, kosher pickles, green leaf lettuce, chives on brioche\n\nMozzapesto\nwhole mozzarella, thick tomato, roasted red pepper, baby arugula, balsamic reduction, house made pesto aioli on focaccia\n\nPollopesto\nhouse made chicken pesto, crumbled goat cheese, thick tomato, baby arugula tossed with lemon chive oil on focaccia\n\nABT\ndouble bacon, avocado, thick tomato, green leaf lettuce, mayo on focaccia\n\n(not pictured): Deluxe Cobb Salad: chopped romaine, mixed greens, grilled chicken, market egg, crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette\n\nThanks, Mission Picnic!", "rating": 5, "date": "2018-05-23"}, {"excerpts": ["Mission Picnic serves up a mean/tasty \"Deluxe Cobb\". \n", "Deluxe Cobb $12.50- Chopped romaine, mixed greens, grilled chicken, market egg , crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette. \n\n"], "author": "Rod M.", "review": "Of all the \"standard\" type Salads the Cobb salad is typically my favorite. \n\nMission Picnic serves up a mean/tasty \"Deluxe Cobb\". \nDeluxe Cobb $12.50- Chopped romaine, mixed greens, grilled chicken, market egg , crispy bacon, avocado, blue cheese, cherry tomatoes with picnic vinaigrette. \n\nVery hearty and you can order online ahead of time for pickup. I enjoy my salad and would return for a hearty/healthy meal. \n\nI like Healthy Foods...occasionally ...lol. For the past year or so I workout multiple times everyday so I typically try to eat at least one Salad a day. Often times I bring my own salad for lunch but sometimes I venture out in the city for some healthy greens.  \nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the Chicken and Waffle Establishment in the SF Bay Area. They are all pretty good this is just my take. \n\nRod's San Francisco Salad Rankings (and what they're known for or what I like). I have rankings various foods like Boba, Ramen, Steakhouse, Chicken and Wafffles(random right?) Follow my profile to see my most recent reviews. I hope I can be helpful since so many Yelpers have helped me discover new places \nRanked from Fave to least fave (Business owners don't hate me, all these places are good) \n\n1 Café du Soleil-Nicoise Salad\n2 SweetGreen-Pesto Chicken\n3 Darwin Café-Baby Spinach \n4 La Fromagerie-La Mancha Salad\n5 Mission Picnic -Deluxe Cobb\n6 Mixt-Mixt Cobb\n7 Plutos-Custom salad\n8 La Capra-The Cobb\n9 Tender Greens-Chinese Chicken\n10 Soma Eats-Spinach, Date and Goat Cheese Salad\n11 Blue Barn Gourmet-Cobber (Cobb Salad)\n12 Split Pea Seduction-The Squash salad\n13 Boxed Foods-Boxed Chicken Salad\n14 Kitava-Pesto Chicken Cobb\n15 Native Co-Native Salad\n16 Soma Chicken-Caesar Salad\n17 Proper Food-Lemon Quinoa Salad with Chicken\n18 Eatsa-Various Salads/bowls \n19 The New Spot on Polk-Asian Chicken\n20 Organic Coup-Kale/Caesar Combo \n21 Uno Dos Tacos-Fish Salad Bowl", "rating": 4, "date": "2018-04-07"}, {"excerpts": ["I've been here several times and have always ordered the deluxe cobb salad because it's just that good. ", "It's your typical cobb salad and includes the fixings such as grilled chicken breast, hard boiled eggs, avocado, bacon, tomatoes, romaine lettuce and blue cheese. "], "author": "Steve H.", "review": "I love this place. It's a popular and well known spot but is small and has a hole in the wall type feeling to it. They specialize in sandwiches and salads that are uh-maze-ing. I've been here several times and have always ordered the deluxe cobb salad because it's just that good. It's your typical cobb salad and includes the fixings such as grilled chicken breast, hard boiled eggs, avocado, bacon, tomatoes, romaine lettuce and blue cheese. It's so simple yet so good!\n\nI love that the ingredients they use are always fresh! The romaine lettuce have a nice crisp to them and the tomatoes have a little snap to them and they're sweet. The rest of the ingredients look just as fresh and taste like they were straight from the farm or bought that morning. On top of the freshness, you get a big serving for a great price! A bang for your buck spot is hard to find, especially a place that uses fresh and high quality ingredients. You'll spend anywhere between 9-13$ for a meal. Mission Picnic is definitely worth checking out if you're in the area.\n\nThe only thing I would like for them to change is to add a little more vinaigrette.", "rating": 4, "date": "2017-12-12"}, {"excerpts": ["Hubs and I split a Devil's Eggs sandwich and a Deluxe Cobb salad. ", "Initially thought the price for the sandwich was steep "], "author": "Esther A.", "review": "Hubs and I split a Devil's Eggs sandwich and a Deluxe Cobb salad. Initially thought the price for the sandwich was steep but it was pretty large and was the perfect size for splitting. \n\nThe salad was also largely portioned. I was pleased to see we got our money's worth of avocado, bacon or chicken as they certainly did not skimp on these ingredients.", "rating": 4, "date": "2015-03-15"}, {"excerpts": ["They barely filled up my box with salad and it's supposed to be a deluxe cobb salad. ", "I always get the same order ", "so I know how much it's filled up ", "and I felt they ripped me off today. ", "$33 on salads - I should be full."], "author": "Lucky N.", "review": "Irritated about today's delivery! I got 2 salads and paid over $30! They barely filled up my box with salad and it's supposed to be a deluxe cobb salad. I always get the same order so I know how much it's filled up and I felt they ripped me off today. $33 on salads - I should be full.", "rating": 4, "date": "2015-10-23"}], "beets and greens": [{"excerpts": ["I went for the $10.95 Beets and Greens which came in a box anyway, but it was a big box chock full of goodness - roasted beets, pear slices, berries, fennel, quinoa, goat cheese, toasted pecans, all of it on a bed of mixed greens and drizzled with a balsamic vinaigrette. ", "It was all so neatly organized that it looked like a bento box (photo: http://bit.ly/2HxPrTD). "], "author": "Ed U.", "review": "If you are in need of eating a salad in a closet, here's the next best option as this is a tiny space on 22nd near Valencia with just three little tables. Luckily I was here after the lunch rush though frankly it wouldn't take much to produce a rush, like two people who want a salad at the same time. There are plenty to choose from, five entree-size ones and two sides. Sandwiches as well, over a dozen listed on the chalkboard. Presumably most people must order to-go...\n\nBut hell, I came to eat there. Waitress? Waitress?? Oh, OK, I have to order at their tiny counter. I went for the $10.95 Beets and Greens which came in a box anyway, but it was a big box chock full of goodness - roasted beets, pear slices, berries, fennel, quinoa, goat cheese, toasted pecans, all of it on a bed of mixed greens and drizzled with a balsamic vinaigrette. It was all so neatly organized that it looked like a bento box (photo: http://bit.ly/2HxPrTD). Delicious and plenty left for later.\n\nFOOD - 4 stars...really robust salad enough for another meal\nAMBIANCE - 3.5 stars...did I mention it's a tiny space?\nSERVICE - 3.5 stars...cordial\nTOTAL - 4 stars...when you know you should have a salad", "rating": 4, "date": "2018-04-27"}, {"excerpts": ["I'm particularly fond of their beets and greens entree salad, but their side baby "], "author": "Aiko H.", "review": "This little gem is incredible! My fiancé and myself have tried this place a couple times, and each time has been amazing. They deliver really fast, too! (with our orders being correct, naturally) \n\nI personally am not normally one for sandwiches, but Mission Picnic has made me a believer! If all places made sandwiches as delicious as theirs, I wouldn't mind having sandwiches more regularly. They've set the bar really high with a brand new standard for sandwiches!! \n\nMy favorite sandwich from here is the smoked salmon, and they are pretty darn generous with the salmon which is always a big plus with me :) And the london broil and premium vegan are both tied at a close second (really depends if I'm craving more red meat or something lighter and filled with veggies but still filling).\n\nTheir salads are really good as well. I'm particularly fond of their beets and greens entree salad, but their side baby arugula salad was quite filling, too. \n\nSo overall, this place is amazing. They've found new regulars.", "rating": 5, "date": "2017-08-13"}, {"excerpts": ["BEETS AND GREENS ", "- I got this once by accident ", "and I was pleasantly surprised by how good beets were. ", "I don't think I ever had beets prior to this salad. ", "I also enjoyed the candied pecans since it was a nice flavor to go along with the salad. "], "author": "Diana C.", "review": "Sandwiches:\nCRANTURKEY - YESSS! Cranberry sauce in a sandwich was something I never tried before and it is amazing! Turkey is nice and moist and NOT DRY! Cause dry turkey is the worst. The sprouts gave it nice little crunch and was a good pairing with the rest of the sandwich as it complemented well.\n\nPOLLOPESTO- Also amazing! I love pesto on just about anything so I had to get this sandwich. It was absolutely amazing and I love the satisfying crunch sound I get when I bite into it. \n\nSMOKED SALMON- Got it once and it's great too. I love smoked salmon and cream cheese so this was my kind of sandwich. But since it's more expensive, I only got it once. \n\nSalads:\nI think I tried almost all of the salads except for the Winter Wedge.\n\nDELUXE COBB - As good as a Cobb can get. Sometimes I am fond of the bleu cheese, sometimes I am not. Chicken is really fresh and big pieces. They don't skimp on that! \n\nBEETS AND GREENS - I got this once by accident and I was pleasantly surprised by how good beets were. I don't think I ever had beets prior to this salad. I also enjoyed the candied pecans since it was a nice flavor to go along with the salad. I wish they had pecans in the other salads!\n\nCHOPPED ITALIAN - It was good but not my favorite since I like avocados and eggs in my salads usually. I'm much of a Cobb kind of girl.\n\nKALE CAESAR - There is this one single anchovy piece that stares back at me when I open my box. The smell always hits me but I am not an anchovy-hater although sometimes I don't know if having it adds to the salad. Get this with chicken because I do not know how people can eat just kale by itself. I just wish the kale was more chopped up instead of in a giant leaf form.\n\nAll the vinaigrettes are good. Red wine vinaigrette is my favorite. I do not like the caesar dressing as much since I prefer a creamier dressing and their caesar is bit thicker and mayo-like. But all their salads are great portions and super filling. They give you good size everything so a whole egg, nice cherry tomatoes and avocado, fresh lettuce, fresh chicken cut up in nice pieces and all. \n\nAwesome place! They deliver to anywhere in SF for $5 flat. They're always quite timely with my order deliveries. I did have two times when I was missing an order or got the wrong item but it was quick to reach them by phone to get that fixed. I can't even be mad since their food is so good and they're also really nice on the phone and even gave me an apology cookie+chips once. I gave the cookie to my co-worker but it smelled really good. SO GOOD. \n\nOh, and sometimes you get the person with the really beautiful handwriting who draws smiley faces on your boxes. Like who doesn't want to unravel a sandwich that has your name and a smiley face written on it?", "rating": 5, "date": "2015-09-28"}, {"excerpts": ["I ordered the beets and greens salad after hearing rave reviews. ", "Although the concept of flavors were nice, I was surprised with the lack of ingredients for the price. ", "The salad composed of mainly mixed greens, exactly 4 pieces of red beet, about a tablespoon of undercooked quinoa, a small sprinkle of goat cheese, and a few tidbits of apples/pears and pecans. ", "For over $11, I was very disappointed."], "author": "Lindsay B.", "review": "I ordered the beets and greens salad after hearing rave reviews. Although the concept of flavors were nice, I was surprised with the lack of ingredients for the price. The salad composed of mainly mixed greens, exactly 4 pieces of red beet, about a tablespoon of undercooked quinoa, a small sprinkle of goat cheese, and a few tidbits of apples/pears and pecans. For over $11, I was very disappointed.", "rating": 2, "date": "2016-10-09"}, {"excerpts": ["My favourite salad is the beets and greens and the side of potato salad is a must with any order. \n\n"], "author": "Ali B.", "review": "Not your average sandwich shop. With something so straightforward you would imagine that creativity is a challenge. Mission picnic is leading the pack in terms of diverging away from your standard sandwich and giving you a true experience. With a great selection, nothing here is boring and every single sandwich (I've tried all but the king) is as exciting as the next.\n\ni do however have a list of favourites; the San Franciscan being the staple with which you will never be disappointed. When you're feeling a bit more daring the Nuevo Cubano is so different and so delicious. The Hainan is also a great one which I suggest you all try before it leaves the menu. My favourite salad is the beets and greens and the side of potato salad is a must with any order. \n\nThere is so many good things to say about this place but I think what really stood out for me is the quality of the ingredients. I tried the new beef sandwich before I left and it literally melts in your mouth; thankfully they gave me a very generous portion of it. The staff are great, the atmosphere is nice and they deliver! It really is, for me, the best of its kind.", "rating": 5, "date": "2013-09-18"}, {"excerpts": ["I ordered the San Franciscan sandwich and the Beets and Greens salad. ", "Both were delicious! ", "The meat was sliced so thin on the sandwich and the crust of the bread was so crunchy with the inside was soft and tasty. ", "Both of us were thoroughly impressed and super full! ", "Will definitely be ordering from here again!"], "author": "Ariel B.", "review": "I had been wanting to try food from here since they opened. I finally got my chance when I decided to order lunch in for my boyfriend and I on our day off. I ordered the San Franciscan sandwich and the Beets and Greens salad. Both were delicious! The meat was sliced so thin on the sandwich and the crust of the bread was so crunchy with the inside was soft and tasty. Both of us were thoroughly impressed and super full! Will definitely be ordering from here again!", "rating": 4, "date": "2015-01-31"}], "chopped italian": [{"excerpts": ["CHOPPED ITALIAN - ", "It was good but not my favorite since I like avocados and eggs in my salads usually. "], "author": "Diana C.", "review": "Sandwiches:\nCRANTURKEY - YESSS! Cranberry sauce in a sandwich was something I never tried before and it is amazing! Turkey is nice and moist and NOT DRY! Cause dry turkey is the worst. The sprouts gave it nice little crunch and was a good pairing with the rest of the sandwich as it complemented well.\n\nPOLLOPESTO- Also amazing! I love pesto on just about anything so I had to get this sandwich. It was absolutely amazing and I love the satisfying crunch sound I get when I bite into it. \n\nSMOKED SALMON- Got it once and it's great too. I love smoked salmon and cream cheese so this was my kind of sandwich. But since it's more expensive, I only got it once. \n\nSalads:\nI think I tried almost all of the salads except for the Winter Wedge.\n\nDELUXE COBB - As good as a Cobb can get. Sometimes I am fond of the bleu cheese, sometimes I am not. Chicken is really fresh and big pieces. They don't skimp on that! \n\nBEETS AND GREENS - I got this once by accident and I was pleasantly surprised by how good beets were. I don't think I ever had beets prior to this salad. I also enjoyed the candied pecans since it was a nice flavor to go along with the salad. I wish they had pecans in the other salads!\n\nCHOPPED ITALIAN - It was good but not my favorite since I like avocados and eggs in my salads usually. I'm much of a Cobb kind of girl.\n\nKALE CAESAR - There is this one single anchovy piece that stares back at me when I open my box. The smell always hits me but I am not an anchovy-hater although sometimes I don't know if having it adds to the salad. Get this with chicken because I do not know how people can eat just kale by itself. I just wish the kale was more chopped up instead of in a giant leaf form.\n\nAll the vinaigrettes are good. Red wine vinaigrette is my favorite. I do not like the caesar dressing as much since I prefer a creamier dressing and their caesar is bit thicker and mayo-like. But all their salads are great portions and super filling. They give you good size everything so a whole egg, nice cherry tomatoes and avocado, fresh lettuce, fresh chicken cut up in nice pieces and all. \n\nAwesome place! They deliver to anywhere in SF for $5 flat. They're always quite timely with my order deliveries. I did have two times when I was missing an order or got the wrong item but it was quick to reach them by phone to get that fixed. I can't even be mad since their food is so good and they're also really nice on the phone and even gave me an apology cookie+chips once. I gave the cookie to my co-worker but it smelled really good. SO GOOD. \n\nOh, and sometimes you get the person with the really beautiful handwriting who draws smiley faces on your boxes. Like who doesn't want to unravel a sandwich that has your name and a smiley face written on it?", "rating": 5, "date": "2015-09-28"}], "rodeo": [{"excerpts": ["I ordered a Rodeo salad. ", "It took about ten minutes for our order to be ready. ", "This salad was similar to most southwestern style salads with a Tex Mex type flair. ", "It had chopped romaine, roast beef, cotija cheese, avocado, corn, black beans, jalapeno, red pepper, red onion, tomato, cilantro, blue corn tortilla chips with chipotle ranch dressing. ", "I got it mainly for the chipotle ranch and avocado. "], "author": "Hannah G.", "review": "This is a small sandwich/salad shop tucked in between two larger shops. And when I say small I mean narrow. There was only room for about three two top tables, pushed up against the right wall. Really a to-go place only. \n\nI ordered a Rodeo salad. It took about ten minutes for our order to be ready. This salad was similar to most southwestern style salads with a Tex Mex type flair. It had chopped romaine, roast beef, cotija cheese, avocado, corn, black beans, jalapeno, red pepper, red onion, tomato, cilantro, blue corn tortilla chips with chipotle ranch dressing. I got it mainly for the chipotle ranch and avocado. I loved the taste!\n\nIt cost $12 and could probably feed at least three people. I'm telling you, this salad weighed five pounds. I took some lettuce out of the salad and saved it before I ate it. Just because it was so gigantic. But, if too much food is my only problem, then I'm ok with that!", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["I'd go here every lunch time just to get a taste of their Rodeo Salad.\n\n"], "author": "Ladonna A.", "review": "It saddens me that this little shop is not somewhere in the East Bay. I'd go here every lunch time just to get a taste of their Rodeo Salad.\n\nHave you ever ordered a salad and thought it was going to be the best meal of the day? Well, I didn't, I thought, ehh I'm here for work and I'm hungry and I saw this little corner store and was like ok sure why not...boy did it blow my mind. I loved how they added chips to it. The meat oh damn the meat it was heavenly. I always toss my salad but the presentation was so well put I almost felt I was being rude mixing it all up. But that's the best part and that's when it tastes so damn good. \n\nThe place inside is cramped and is basically an order and go type of place. Luckily, since I had no place to really go, there was a seat available for me to enjoy this heavenly meal.", "rating": 4, "date": "2016-12-22"}, {"excerpts": ["Rodeo salad was delicious!"], "author": "Shalin M.", "review": "Ordered delivery for office lunch and it came fifteen minutes early. Rodeo salad was delicious!", "rating": 5, "date": "2016-01-12"}], "mixed green side": [], "baby arugula side": [{"excerpts": ["Baby Arugula Side Salad: ", "Baby arugula salad dressed with lemon chive dressing ($3.75)\n", "*", "Potato Chips: "], "author": "Elena N.", "review": "For our weekly office lunch, I picked Mission Picnic. Our delivery order arrived via Caviar on Friday, June 23rd around 12 noon.\n\n*Flatiron: Hot romanian pastrami layered high with melted muenster cheese, kosher pickles, deli mustard on french ($11.95)\n*Baby Arugula Side Salad: Baby arugula salad dressed with lemon chive dressing ($3.75)\n*Potato Chips: Artisan chips from Route 11, Mama Zuma's Revenge ($1.95)\n\nWe have $20 to play with, so yes, I got a sandwich, salad, AND chips! The sandwich melded into one great bite. The pastrami salty, the cheese melty, the pickles sour. I'm not a huge bread person, but it was nice and chewy and soft. I had one bite with the bread and then just ate the insides. The cheese melted onto the bread, so I ended up having a little more bread with the filling which I didn't mind. (You can also request a lettuce wrap if you'd rather avoid the bread that way.) The salad was huge! Very densely packed in the takeout container. It ate some with my sandwich and ended up making a makeshift pastrami arugula salad. The only critique I had of the salad is that it needed more dressing. There was a tiny container about two thirds full for all that salad. It wasn't enough. I adored the chips. Great spice. If you can't handle heat, I suggest you pass on these as they may be the spiciest chips I've ever had.\n\nGreat place for sandwiches. All this food actually fed me three times that day. If Mission Picnic comes back into the rotation, I would definitely order from them again.", "rating": 4, "date": "2017-07-03"}], "pasta salad": [], "artisan chips": [{"excerpts": ["Artisan chips from Route 11, Mama Zuma's Revenge ($1.95)\n\n"], "author": "Elena N.", "review": "For our weekly office lunch, I picked Mission Picnic. Our delivery order arrived via Caviar on Friday, June 23rd around 12 noon.\n\n*Flatiron: Hot romanian pastrami layered high with melted muenster cheese, kosher pickles, deli mustard on french ($11.95)\n*Baby Arugula Side Salad: Baby arugula salad dressed with lemon chive dressing ($3.75)\n*Potato Chips: Artisan chips from Route 11, Mama Zuma's Revenge ($1.95)\n\nWe have $20 to play with, so yes, I got a sandwich, salad, AND chips! The sandwich melded into one great bite. The pastrami salty, the cheese melty, the pickles sour. I'm not a huge bread person, but it was nice and chewy and soft. I had one bite with the bread and then just ate the insides. The cheese melted onto the bread, so I ended up having a little more bread with the filling which I didn't mind. (You can also request a lettuce wrap if you'd rather avoid the bread that way.) The salad was huge! Very densely packed in the takeout container. It ate some with my sandwich and ended up making a makeshift pastrami arugula salad. The only critique I had of the salad is that it needed more dressing. There was a tiny container about two thirds full for all that salad. It wasn't enough. I adored the chips. Great spice. If you can't handle heat, I suggest you pass on these as they may be the spiciest chips I've ever had.\n\nGreat place for sandwiches. All this food actually fed me three times that day. If Mission Picnic comes back into the rotation, I would definitely order from them again.", "rating": 4, "date": "2017-07-03"}], "can soda  water": [], "premium drinks": [], "watermelon juice": [{"excerpts": ["You will adore the sandwiches here, and the salads, and the watermelon juice. ", "Small place with only a couple tables for two, and no wifi"], "author": "Kate B.", "review": "You will adore the sandwiches here, and the salads, and the watermelon juice. Small place with only a couple tables for two, and no wifi, so it's mostly a takeout adventure. \n\nMy sandwich was so great I had a dream that night about eating it again. It's that kind of sandwich. High quality ingredients, and if you are a vegan like I am, you will go bananas for the flavor. \n\nTotal hole in the wall, totally worth it in every way.", "rating": 5, "date": "2016-11-18"}, {"excerpts": ["The watermelon juice is super tasty and refreshing. \n\n"], "author": "Sara M.", "review": "SOOO many delicious sandwiches and salads created with high quality ingredients. Choosing will be hard, but you'll find solace in the fact that you can return next time and try another delicious sandwich or salad (but let's be real - probably a sandwich). The watermelon juice is super tasty and refreshing. \n\nI can't wait to try the entire menu!", "rating": 5, "date": "2016-06-13"}, {"excerpts": ["I ordered the MozzaPesto Sandwich & Watermelon Juice. ", "I enjoyed the Watermelon Juice more than the sandwich! ", "I think the roasted red pepper in the MozzaPesto threw me off. ", "The Watermelon Juice reminded me of the Watermelon Juice I drank when I was in Krabbi, Thailand, sooo good!!!!!!!\n\n"], "author": "Geraldine R.", "review": "Stopped by for lunch! Cute little sandwich shop with nice service! \n\nI ordered the MozzaPesto Sandwich & Watermelon Juice. I enjoyed the Watermelon Juice more than the sandwich! I think the roasted red pepper in the MozzaPesto threw me off. The Watermelon Juice reminded me of the Watermelon Juice I drank when I was in Krabbi, Thailand, sooo good!!!!!!!\n\nI will come back to try the Cesar Salad & a few other sandwiches, then update my review!", "rating": 3, "date": "2015-04-14"}, {"excerpts": ["Watermelon juice is good too!"], "author": "Thatcher H.", "review": "Simple menu Good sandwiches. This place doesn't try to be too much. I like to call in my orders because it can get busy during lunch time and the place is super small. Best for take away there are only three tables in the place. Watermelon juice is good too!", "rating": 5, "date": "2017-05-04"}, {"excerpts": ["I also got the watermelon juice which was quite refreshing.\n\n"], "author": "Blake B.", "review": "Blink and you'll miss this tiny spot on 22nd but I hope that you don't as it's excellent.  I ordered the Nuevo Cubano and it was delicious.  The pineapple and avocado jalapeno aioli really made the sandwich.  I also got the watermelon juice which was quite refreshing.\n\nIf you're a sandwich fan (and how could you not), check out Mission Picnic and you won't be disappointed.", "rating": 4, "date": "2015-04-06"}, {"excerpts": ["I had the watermelon which was more like a fresh watermelon juice slushy "], "author": "Cherylynn N.", "review": "One of my favorite FOBanese dishes is Hainan Chicken Rice. Something about the simply boiled chicken, deliciously oily rice and aromatic ménage a trios of sauces (chili, ginger and dark soy) makes me...uhh, makes me happy. Sorry, going to keep it PG-rated for once.\n\nSo naturally seeing the Hainan Chicken Sandwich on Mission Picnic's FB page almost made me keel over. A FOBanese American Sandwich? I'm all over it! I hoped into my imaginary rice rocket and vroomed vroomed my way to Mission Picnic yesterday while bumping to Stevie B.\n\nMission Picnic is a new sandwich shop serving seasonal sandwiches; some with an Asian twist. They're currently in their soft opening stage and have an awesome deal of 50% off your purchase (till today). Their Grand Opening is tomorrow.\n\nFormerly the Corazon Juice Bar, Mission Picnic is a tiny shop with just four two-top tables so this is more of a to-go place.\n\nFor their soft opening, they had 6 sandwiches available (~$8-9):\n*Picnic Club (Rotisserie chicken salad w/ bacon & cheddar)\n*Hainan Chicken (Garlic rotisserie chicken w/ cucumber & picnic spread)\n*San Franciscan (Hot pastrami, turkey & provolone)\n*Devil's Egg (Market boiled egg, bacon & provolone)\n*MozzaPesto (Mozzarella, basil, tomato & pesto aioli)\n*The King (Peanut butter, bananas, honey chocolate & frosted flakes).\n\nThey'll also have soups and salads in the future. \n\nMake sure to try one of their refreshing fruit shakes (pineapple, watermelon or strawberry - $2.75). I had the watermelon which was more like a fresh watermelon juice slushy but it was really good (no sugar added).\n\nCASH ONLY.\n\nThe Hainan Chicken Sandwich was nicely packed with tenderly moist garlic rotisserie chicken, sliced cucumbers, tomato, lettuce & picnic spread on dutch crunch: http://bit.ly/171yYMd. The picnic spread of garlic and parsley was slathered onto the bread before toasting so all that garlicky goodness soaked into every nook and cranny. So yummy!\n\nWhile the sandwich was solid and made with top-notch ingredients, it was more like a garlic pesto-ish chicken sandwich to me. I was hoping it would be more FOBanese. There was no ginger in the spread and ginger is what makes hainan chicken \"hainan\" imo. And, although the dutch crunch had a deliciously crunchy mottled crust, I think a less carb heavy bread like a baguette would let the ingredients shine for this particular sandwich. Just my two cents.\n\nOne of owners, Sterling was super nice and encouraged customer feedback which is always a sign to build customer loyalty and remain competitive in this marketplace. I hope he does see this and offers several FOBanese sandwich options in the future including vegan options for my Yelpie friend John B.  who's always in the hood and for all the surrounding PBR drinking and camel toe inducing skinny jean lovers of course.\n\nMission Picnic has a lot of potential and this was just their soft opening so I can't wait to see what other specialty sandwich ideas they have up their sleeve...\n\nPerhaps a pulled pork with apple wasabi slaw sandwich, a Tonton sesame marinated tofu w/ portobello mushroom sandwich, a longanisa banh mi or a loco moco sloppy joe? I can go on and on.\n\nNow only if I can come up with ideas like that in my field of work instead of looking like a deer caught in headlights all the time...", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["I ordered the smoked salmon sandwich light on the cream cheese w a side of jalapeño chips and fresh watermelon juice. ", "Delicious!!! ", "The bread tasted like a dutch crunch and only towards the end did I realize the sandwich contained pickles which I normally hate but enjoyed unknowingly. ", "Bit on the pricey side but good sized portions and  healthy ingredients. ", "Will be back to try other things on the menu!"], "author": "Yin H.", "review": "Great little lunch spot! The place is long and skinny with 3 tiny tables crammed against the wall. I ordered the smoked salmon sandwich light on the cream cheese w a side of jalapeño chips and fresh watermelon juice. Delicious!!! The bread tasted like a dutch crunch and only towards the end did I realize the sandwich contained pickles which I normally hate but enjoyed unknowingly. Bit on the pricey side but good sized portions and  healthy ingredients. Will be back to try other things on the menu!", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["Incredible bread, fresh delicious flavors, unbelievable watermelon juice. ", "This sounds crazy but there's a \"swagger\" to this sandwich place. "], "author": "Ojus P.", "review": "Incredible bread, fresh delicious flavors, unbelievable watermelon juice. This sounds crazy but there's a \"swagger\" to this sandwich place. I'm very eager to go back.\n\nPollopesto - 5/5. Pesto very flavorful, lemon chive oil does come through to combine the ingredients.", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["I paid $10 for a sandwich ($14 with watermelon juice) ", "but then I started eating it... "], "author": "Carolyn K.", "review": "At first I was a little upset I paid $10 for a sandwich ($14 with watermelon juice) but then I started eating it... Would've paid $20 for that pollopesto sandwich it was so dang good. Bread was perfectly crisp and you can tell only fresh ingredients are used. Huge portion, too! This place is a cute hole in the wall, but we warned it only seats about 6 people! I walked over to nearby mission park to eat.", "rating": 5, "date": "2016-06-15"}, {"excerpts": ["Also enjoyed the watermelon juice, which has no sugar or junk added to it. "], "author": "Julie H.", "review": "Great recommendation from the folks down at Chocolatier Blue. Looks like a hole in the wall but loved the relaxed, friendly vibe. Was also in need of a place to charge my phone and appreciated all of the outlets.\n\nI got the CranTurkey Sandwich and it was YUMMY! At first I was a little put off by the thickness of the bread, it looked huge, but then I tasted the bread. So worth the calories! It tasted like a little butter in every bite, which complemented the CranTurkey goodness. Ate the whole thing and had to have a late dinner because of it but was worth it!\n\nAlso enjoyed the watermelon juice, which has no sugar or junk added to it. Just sweet, delicious watermelon.   \n\nWould definitely come here again!", "rating": 4, "date": "2014-03-29"}, {"excerpts": ["Love their watermelon juice, Cobb salad ,and their smoked salmon sandwich."], "author": "Maria R.", "review": "Have tried several different salads and a few sandwiches. Everything is tasty but a bit overpriced, specially for lunch. What happened to a lunch menu or half salad/half sandwich combo?? Love their watermelon juice, Cobb salad ,and their smoked salmon sandwich.", "rating": 4, "date": "2016-11-27"}, {"excerpts": ["I had the Pollopesto sandwich, which aside from its namesake(s) is also stuffed with goat cheese, baby arugula, tomato, and lemon-chive oil (omg)--it was fresh, well-balanced, and delicious, and washed down perfectly with their cold watermelon juice. ", "My friend had the vegan sandwich, which was also tasty but not quite as delightful as the Pollopesto (sorry, friend).\n\n"], "author": "Angela L.", "review": "I would've walked right past Mission Picnic if not for Yelp, so ... thanks, Yelp!\n\nThe vibe is super relaxed and friendly. Be warned that it's *tiny*, with maybe three or four tables for two at the most, so plan on taking your order to go. (Dolo is just a few blocks away!)\n\nI had the Pollopesto sandwich, which aside from its namesake(s) is also stuffed with goat cheese, baby arugula, tomato, and lemon-chive oil (omg)--it was fresh, well-balanced, and delicious, and washed down perfectly with their cold watermelon juice. My friend had the vegan sandwich, which was also tasty but not quite as delightful as the Pollopesto (sorry, friend).\n\nThe next time I'm looking for something quick, portable, and tasty in the Mission and don't want a giant burrito (read: am sober), I'll be sure to stop by!", "rating": 5, "date": "2015-01-19"}, {"excerpts": ["The watermelon juice was also excellent. ", "Great spot to grab sammies!"], "author": "Tasha D.", "review": "Awesome sandwiches - I never would have ordered the Cuban sandwich, but my boyfriend did, and the addition of grilled pineapple sort of blew my mind. Delicious! The watermelon juice was also excellent. Great spot to grab sammies!", "rating": 4, "date": "2014-07-14"}, {"excerpts": ["The watermelon juice is so good. ", "A must have"], "author": "Courtney F.", "review": "Customer service was excellent and the sandwiches are delicious. The watermelon juice is so good. A must have", "rating": 5, "date": "2015-11-22"}, {"excerpts": ["And a watermelon juice if you're in the rare situation of not knowing to do with all of your extra money."], "author": "Amanda L.", "review": "San Francisco's hottest sandwich shop is Mission Picnic.  It has everything.  Creative yet intuitive flavors, friendly staff, chutes, ladders, the outdoor concert from a Zoloft commercial...\n\nSorry, I couldn't resist.  Anyway, I went today and ordered the Sgt. Slawter, and it was definitely in my top 20 sandwiches of all time (which is really saying something for me!).  It was the perfect combination of textures and flavors, juicy but not enough to make the bread soggy.  The teriyaki slaw with roast beef is brilliant, particularly when paired with dutch crunch and a garlic/herb spread.  The meat was exceptional: very thin and juicy with some real flavor.  This is some high-quality stuff, not your typical grocery-store cold cuts.\n\nPreviously, I've ordered the Hainan Chicken, which was good but didn't blow my mind like the Slawter did.\n\nMy only hang-up is the price.  It's just hard for me to justify spending $8.50 on a sandwich, even when it is amazing.  This is the only reason I won't be eating at Mission Picnic on a daily basis.  I'm not saying it's overpriced, just that it's too expensive for me to eat here as regularly as I'd like.  \n\nYou can really tell that the food here is made with care and quality ingredients.  I haven't seen such inventive and new flavor pairings in a sandwich shop, and I've eaten a lot of sandwiches.  The bottom line: go, and get the Sgt. Slawter.  And a watermelon juice if you're in the rare situation of not knowing to do with all of your extra money.", "rating": 5, "date": "2013-05-20"}, {"excerpts": ["Also the watermelon juice is unique, delicious, and refreshing..."], "author": "Tiffany S.", "review": "Best sandwiches in the city! I could live on the pollo pesto.\nAlso the watermelon juice is unique, delicious, and refreshing...", "rating": 5, "date": "2015-12-02"}, {"excerpts": ["Aside from the sandwiches, their watermelon juice was delicious =D\n\nWhat made this place even more enjoyable, are the staff themselves.  "], "author": "Jessica L.", "review": "Me and my friends went here for their grand opening last week.  Their sandwiches are creative and suited the whimiscal names given to each.   One sandwich that definitely stood out was their Hainan Chicken sandwich (we also tried their Picnic club, Devil's egg, and San Franciscan).  What made the Hainan different was that it had an Asian flair to it, but made modern into a sandwich.  The dutch crunch was toasted lightly and the chicken wasn't too dry; but was juicy and savory when paired with the secret sauce that came with it.   \n\nAside from the sandwiches, their watermelon juice was delicious =D\n\nWhat made this place even more enjoyable, are the staff themselves.  The owners are very approachable and easy-going.  They make sure that every sandwich you order is made to perfection!  \n\nDefinitely worth the trip out to the Mission.", "rating": 5, "date": "2013-04-08"}, {"excerpts": ["I love washing it down with their watermelon juice and for a nice sweet treat after, the chocolate chip cookie, YUMMMM. ", "What more can I possibly ask for? ", "Nada ", ":D"], "author": "Laura L.", "review": "Whenever I'm in the area craving a sammie, the San Franciscan is my go to sandwich :D It has the perfect balance of meat/veggie/bread ratio and with the melted cheese and toasty bread it's just an amazing marriage of flavors in my mouth... I love washing it down with their watermelon juice and for a nice sweet treat after, the chocolate chip cookie, YUMMMM. What more can I possibly ask for? Nada :D", "rating": 5, "date": "2014-09-15"}, {"excerpts": ["Because we checked in, we also scored a watermelon juice.  ", "Service was great.  ", "Prices are reasonable (less than $9 for said 'wich and most everything was along the same price point). ", "I can't fault this place one bit!"], "author": "Amber E.", "review": "Yummy!!!!  Hubs and I happened on this place while searching for a sandwich joint near Dolores park.  On our way there, we literally walked in to the Sunday Streets festival, so that was also kind of exciting.  Anyway, it's a small place - seats 8 inside.  The menu offers something for everyone, but we decided to share the Hainan Chicken sandwich.  It was so DELICIOUS!  Definitely enough for two as a light lunch.   Because we checked in, we also scored a watermelon juice.  Service was great.  Prices are reasonable (less than $9 for said 'wich and most everything was along the same price point). I can't fault this place one bit!", "rating": 4, "date": "2013-04-15"}, {"excerpts": ["As a bonus, I was given a watermelon juice with my sandwich.  ", "I've never been a juice fan before, but this watermelon concoction was awesome!  ", "It was not too sweet, which is why I normally don't like juice.  ", "I would definitely order both again."], "author": "Elisa H.", "review": "Overall I really enjoyed my experience here.  I ordered the Hainan Chicken sandwich which was garlic-y and flavorful.  The bread was the perfect consistency and the ingredients were all harmonious.  As a bonus, I was given a watermelon juice with my sandwich.  I've never been a juice fan before, but this watermelon concoction was awesome!  It was not too sweet, which is why I normally don't like juice.  I would definitely order both again.", "rating": 5, "date": "2013-04-07"}, {"excerpts": ["really loved the perfectly sweetened watermelon juice."], "author": "Dee R.", "review": "solid bread quality (my sandwich barometer), quick and friendly service, not too busy at noon. really loved the perfectly sweetened watermelon juice.", "rating": 5, "date": "2015-04-06"}], "fresh lemonade": [{"excerpts": ["About $12 for a big sandwich and fresh lemonade."], "author": "Jennifer W.", "review": "Amazing customer service, fresh, flavorful and delicious sandwiches. I had the vegan sandwich and it was loaded with avocado, tomatoes, hummus, sprouts and other goodies. They were out of focaccia so I had it on ciabatta instead and I added some jalapeños for a little more of a kick which was perfect! About $12 for a big sandwich and fresh lemonade.", "rating": 5, "date": "2014-06-18"}]}