{"molinari special italian combo sandwich": [], "salame sandwich": [{"excerpts": ["I ordered the Molinari Special ($6.75) which is basically a hefty salame sandwich with peppers, onions, cheese, mustard, and mayo.  "], "author": "Tori S.", "review": "I understand there is somewhat of a cult following here at Molinari, more recently thanks to Anthony Bourdain.  However, I was less than impressed.. or at least my stomach and digestive system were.\n\nWhen my coworker and I walked in here after seeing Prez O's motorcade pass through Chinatown, we were super excited because we'd heard so many great things.  We grabbed a number and were helped almost immediately because we beat out much of the lunch crowd (we arrived around 1:30 and there was a crowd around 1:45).\n\nWhat you're supposed to do is choose a type of bread from this bread bin in the corner.  My first reaction was, \"GERM BIN.\"  Sure, there were a pair of tongs in there, but who knows how people have been reaching in?  And to top it all off, a girl tried to walk in there with her dog (luckily the store employees told her to leave him outside).  Which means that.. you get the picture.\n\nI ordered the Molinari Special ($6.75) which is basically a hefty salame sandwich with peppers, onions, cheese, mustard, and mayo.  Not knowing what was included, I just took everything but would've rather opted out of the mayo and gone light on the mustard.\n\nIt's one of those sandwiches that, with the hard bread (untoasted), was impossible to eat whole because the innards kept squishing out and pissing me off.  Nonetheless, I finished it, and a few hours later, threw up my guts.\n\nI'm not sure if it was the germy bread bin that caused food poisoning (that sandwich was pretty much one of the only things I ate yesterday) or something in their meats, but it sure as hell didn't bode well for my Thursday night.  \n\nIn the future, I'll only be back for their fresh pastas, because at least I'll have to prepare and cook them myself.", "rating": 2, "date": "2012-02-17"}, {"excerpts": ["Best salame sandwich ever.  ", "I'm a purist sandwich lover-- give me some meat, bread, and mustard, and I'm a happy girl.  ", "At Molinari's, they pile on the meat, you choose your own bread, and the mustard is spicy-but-not-too-spicy.  ", "Bravo!  ", "Sandwich bliss."], "author": "Sheila W.", "review": "Thank goodness I moved to NB, man.  Gastronomical delights abound, but few satisfy me more than Molinari's.  Best salame sandwich ever.  I'm a purist sandwich lover-- give me some meat, bread, and mustard, and I'm a happy girl.  At Molinari's, they pile on the meat, you choose your own bread, and the mustard is spicy-but-not-too-spicy.  Bravo!  Sandwich bliss.", "rating": 5, "date": "2007-05-07"}], "mortadella sandwich": [{"excerpts": ["My mom ordered the mortadella sandwich and we sat outside with great blood orange sodas. ", "They have a giant bin with fresh bread that you choose with tongs so they can make your sandwich for you. ", "My mom and I kept it simple, with just provolone, mustard and mayo, and a tiny bit of olive oil. ", "The mort was very tasty. ", "My salami was to die for. ", "The flavor was ridiculous! ", "So ridiculous that we bought 3 pounds of it after eating lunch. ", "I think the bread was pretty solid, but It would have been better if it was warmer. ", "Provolone was superb. ", "I love this place. ", "5 stars for the salami alone ", ":)."], "author": "Sheeva G.", "review": "Wow. What a great place! The biggest reason why I respect this place is because of the amazing family history associated with Molinari. It has been around since 1896, and the business has been passed down throughout the family since then. You walk in and they have every Italian food brand you could think of, from candy to cookies to soda, they have it! They are very well-known for their salami, so I had to get a salami sandwich. My mom ordered the mortadella sandwich and we sat outside with great blood orange sodas. They have a giant bin with fresh bread that you choose with tongs so they can make your sandwich for you. My mom and I kept it simple, with just provolone, mustard and mayo, and a tiny bit of olive oil. The mort was very tasty. My salami was to die for. The flavor was ridiculous! So ridiculous that we bought 3 pounds of it after eating lunch. I think the bread was pretty solid, but It would have been better if it was warmer. Provolone was superb. I love this place. 5 stars for the salami alone :).", "rating": 5, "date": "2012-02-22"}], "mixed cheese sandwich": [], "prosciutto domestic sandwich": [], "prosciutto di parma sandwich": [], "hot salame sandwich": [], "coppa sandwich": [{"excerpts": ["I had the hot coppa sandwich, and it was exceptional.  ", "The best deli sandwich I've had in a very long time."], "author": "Eric V.", "review": "Want an excellent italian deli sandwich? Go here.  I had the hot coppa sandwich, and it was exceptional.  The best deli sandwich I've had in a very long time.", "rating": 5, "date": "2010-10-23"}], "sopressata salame sandwich": [], "toscano sandwich": [], "genova salame sandwich": [], "oven roasted turkey breast sandwich": [], "black pepper turkey breast sandwich": [], "garlic and rosemary turkey breast sandwich": [], "black forest smoke ham sandwich": [], "danish boiled ham sandwich": [], "prosciutto cotto with rosemary sandwich": [], "italian herb roast beef sandwich": [], "imported bresaloa air dried beef sandwich": [], "italian salame sandwich": [], "smoked turkey breast sandwich": [], "imported bresaloa aired dried beef sandwich": [], "chicken cutlet sandwich": [{"excerpts": ["Chicken cutlet sandwich .... mushrooms .... fresh mozarrella, mmmmm... ", "Everything at Molinari's is fresh -- makes me so happy!  ", "I dream about eating at Molinari's every day.  "], "author": "Elaine Z.", "review": "Chicken cutlet sandwich .... mushrooms .... fresh mozarrella, mmmmm... Everything at Molinari's is fresh -- makes me so happy!  I dream about eating at Molinari's every day.  Except that I'm usually too lazy to want to walk up that hill on Broadway to obtain some sandwiches -- exercise, meh.\n\nThe best thing to do on a nice Saturday afternoon is to grab some Molinari's sandwiches and salads and go sit in Washington Square park and people watch.", "rating": 5, "date": "2011-02-20"}], "chicken parmesan sandwich": [{"excerpts": ["Nervously, I ordered the chicken parmesan sandwich.  \n", "I turned around and saw the woman leaving.\n", "So I joked w/the guy at the counter, and said I'm having second thoughts.  ", "What did Jesus order? ", "har, har\n", "He said, a meatball sub.  ", "And winked.\n", "A meatball sub it is, then.\n", "And it was good. ", "Really good. \n"], "author": "Rho T.", "review": "So I walked into Molinari's, took a number (#17) and stood beside a woman.\nShe said you know who's been here? \nI said who\nShe said Jay-Z\nI said nuh uh\nShe said yuh huh\nI said nuh uh\nShe said yuh huh\nI said wow thats cool and threw up \"the roc\" (formed my hands into a triangle)\nShe just smiled and looked confused\nI lowered my hands and kindly smiled back......................never mind\nThen she said you know who else has been here \nI said who\nShe said Jesus, our Savior\nI laughed and said wait you mean Anthony Bourdain?\nShe said who?\nI said oh.\n\na\nw\nk\nw\na\nr\nd\n\n\nThen a voice from behind the counter yelled 17!  And I mumbled thankthelord \nThen she said see, he's here again.\n\n\n\n\no_O\nhelp. .. \n\n\n\n\n\nNervously, I ordered the chicken parmesan sandwich.  \nI turned around and saw the woman leaving.\nSo I joked w/the guy at the counter, and said I'm having second thoughts.  What did Jesus order? har, har\nHe said, a meatball sub.  And winked.\nA meatball sub it is, then.\nAnd it was good. Really good. \nDang.\n\nTrust Jesus.\n\n\n\n\n\n*pardon my blasphemous mouth\n**you can trust whoever you want\n***i don't know shit\n****i'm just here for savasana", "rating": 4, "date": "2012-06-21"}, {"excerpts": ["and although I ordered a chicken parmesan sandwich, I regret not trying one of their many cold sandwiches. ", "The reason I say this is because like most chicken parmesan sandwiches from a quit serve deli, they basically just nuke this sandwich to heat it up. ", "It was still a tasty meal, but after I saw the sandwiches my friends ordered, I did have some regret on getting something like them. ", "Regardless, the chicken parmesan was pretty good. ", "My only complaint was how quickly the bread got soggy. ", "Perhaps I shouldn't have picked out such a soft roll. "], "author": "Jason B.", "review": "Pure Italian goodness! \n\nMolinari's is decked out in all things Italian. They have an awesome selection of meats, cheeses, breads like fresh foccacia, wines, etc. But their bread and butter (no pun intended) are their sandwiches. They have a vast selection of extraordinary sandwiches and from what I have heard, they are all spectacular!\n\nToday was my first time there and although I ordered a chicken parmesan sandwich, I regret not trying one of their many cold sandwiches. The reason I say this is because like most chicken parmesan sandwiches from a quit serve deli, they basically just nuke this sandwich to heat it up. It was still a tasty meal, but after I saw the sandwiches my friends ordered, I did have some regret on getting something like them. Regardless, the chicken parmesan was pretty good. My only complaint was how quickly the bread got soggy. Perhaps I shouldn't have picked out such a soft roll. Oh, well, next time...\n\nI will definitely try one of the cold sandwiches the next time I go because each of my friends who ate there today said their sandwiches were fantastic!\n\nI have a feeling the next time I eat here, I will update my review with a 5/5.", "rating": 4, "date": "2009-01-28"}], "grilled eggplant sandwich": [], "homemade meat lasagna": [], "homemade veggie lasagna": [], "cannelloni": [], "eggplant parmesan we make you bake": [], "manicotti": [], "penne al forno": [], "north beach special sandwich": [{"excerpts": ["Figure out what you want - there's a North Beach Special Sandwich there which is wonderful. ", "Go to the bread bin opposite the meat case and select your bread. "], "author": "Van D.", "review": "I got a haircut at Chong's (cheap and good at $10) up the street on Kearney between Vallejo and Green and decided to celebrate with lunch! I anxiously strolled into Molinari's Delicatessen and read the big board and figured out the system.  \n\nAs tourists stand by dumbstruck trying to decide, here's how the whole thing works. It is simple. Grab a number. Do it no matter what. Figure out what you want - there's a North Beach Special Sandwich there which is wonderful. Go to the bread bin opposite the meat case and select your bread. Use the tongs - what are you, an animal?\n\nWhen Mister Man calls your number and asks you 'whaddaya want' Soprano-style, you counter with your memorized answer and give him the bread you've selected. Hopefully, the sandwich will include their outrageously tasty sun-dried tomatoes and peppers. Just typing that made me weak in the knees.\n\nWhile your sandwich is being created, go to the refrigerated case and get your drink. I got a Vitamin Water. Order something else to go with your sandwich. I got 1/4 pint of mozzarella/tomato salad which is my favorite. Oops I think I just drooled.\n\nThey take credit cards, debit cards and cash. It is at this point that you can marvel at the fact that all this will cost you around $12 or $13 - and if weather permits, you can eat outside and watch trippy North Beach go by. Cheap food of exceptional quality - PLUS cheap entertainment. \n\nHow can you go wrong? You can't.  Cheaper and just as authentic as lotsa places in New York's Little Italy. Actually, there's no comparison because we're saving ourselves airfare and other transportation costs. Plus, we're not dealing with the airport's righteous TSA idiots. Here, you can eat well AND you can keep your shoes on.", "rating": 5, "date": "2008-06-03"}], "renzo special sandwich": [{"excerpts": ["They could have survived since 1896 on business from the Renzo Special sandwich alone: prosciutto, coppa (I get the sweet), their fresh mozzarella, and sun-dried tomatoes. ", "And although they are packed for sandwiches, don't sleep on getting some groceries, olive oil, wine, and their famous sausages there as well. "], "author": "Arthur S.", "review": "Molinari's is a North Beach institution, it was established in 1896 (wow) and is said to be the oldest deli west of the Rockies. And if you are looking for an authentic San Francisco Italian deli experience here's all you need to know: Joe DiMaggio specified in his will to have them cater his funeral...\n\nThey could have survived since 1896 on business from the Renzo Special sandwich alone: prosciutto, coppa (I get the sweet), their fresh mozzarella, and sun-dried tomatoes. And although they are packed for sandwiches, don't sleep on getting some groceries, olive oil, wine, and their famous sausages there as well. A real treat is their homemade ravioli and tortellini, so good all you really need is a little melted butter with some of their Parmigiano-Reggiano freshly grated to finish it...\n\nA great selection of classic cold cuts and antipasto as well with none of the big city deli 'attitude' - you may end up waiting for a few minutes but you'll smile with the guys making the sandwiches while in line. A legendary local business, for good reason...", "rating": 5, "date": "2015-08-02"}, {"excerpts": ["I got the Renzo Special sandwich and it was amazing. ", "You choose your own piece of bread, which I love. ", "The cheese was fresh and in huge chunks, the sun dried tomatoes were tangy and perfect. ", "The prices were reasonable, everyone takes a number so orders aren't chaos. ", "Will definitely be back, I was scoping out the cheeses and the prices were great."], "author": "Beth D.", "review": "Great Italian deli / market. I got the Renzo Special sandwich and it was amazing. You choose your own piece of bread, which I love. The cheese was fresh and in huge chunks, the sun dried tomatoes were tangy and perfect. The prices were reasonable, everyone takes a number so orders aren't chaos. Will definitely be back, I was scoping out the cheeses and the prices were great.", "rating": 4, "date": "2010-05-13"}], "joe special sandwich": [], "basil turkey special sandwich": [], "south beach special sandwich": [{"excerpts": ["Been going here since i was 8 and they never failed to bring me the perfect South Beach Special sandwich.  ", "Very friendly service, easy to find parking around the corner just gotta look, great sandwiches, and a beautifull sceancery now "], "author": "Hanna A.", "review": "The best sandwich in the world!  Been going here since i was 8 and they never failed to bring me the perfect South Beach Special sandwich.  Very friendly service, easy to find parking around the corner just gotta look, great sandwiches, and a beautifull sceancery now what more can you ask for?\n\nDO NOT I REPEAT DO NOT GO TO THE Philpino or asian guy he will make the best Italian deli in the west coast look like a sandwich from a cornerstore. Trust me its that serious.  This will not affect my rating of the place because any other person who makes it will turn into perfection.", "rating": 5, "date": "2008-03-12"}], "lucca special sandwich": [], "veggie special sandwich": [], "grilled focaccia special sandwich": [], "luciano special sandwich": []}