{"momos clam chowder": [], "brussels sprouts": [{"excerpts": ["I also ordered some Brussels sprouts roasted with shallots, lemon, and olive oil instead of garlic butter since I am allergic to cow's milk. \n\n"], "author": "Kristine H.", "review": "We were meeting a friend for lunch during his work day and he suggested MoMo's. We were lucky and found a parking spot right beside this place so our lunch date started off nicely! The day was nice so we sat outside on their patio that was decorated with fat little succulents in footed pots. Some of the plants were beautifully red ones that matched the huge olive heart sculpture in front of the restaurant. \n\nI ordered a Cobb salad that was beautifully built with ample avocado, bacon, and chicken over mixed green along with cherry tomatoes and a sliced boiled egg. The red wine vinaigrette was served on the side. I also ordered some Brussels sprouts roasted with shallots, lemon, and olive oil instead of garlic butter since I am allergic to cow's milk. \n\nWe ordered two of the wood-fired pizzas and both pizzas were beautifully made. The vegetarian pizza had grilled squash, peppers, olives, mozzarella, ricotta salata, and pesto. The other pizza had Prosciutto Di Parma, smoked gouda, Calabrian chiles, and arugula.\n\nThe complimentary bread and butter kept coming and by the time we were done, we were stuffed! I don't know what this place is like during games (busy, I imagine) or at night, but for a lunchtime destination, we were pleased with the prices and food quality.", "rating": 4, "date": "2017-06-06"}, {"excerpts": ["Along with the house wine, I tried their Fried Brussels Sprouts and French Onion Soup. ", "My friend and I agreed that the Brussels Sprouts were too vinegary, while I found the soup just acceptable. \n\n"], "author": "Sheri W.", "review": "I've heard MoMo's is packed on game nights, but on a regular weeknight, my best recommendation for this restaurant is that it's not crowded and has super cheap happy hour prices.  Neither food nor atmosphere is anything special, but if it were, the place would be packed more often.  When I planned to come, I didn't know it was part of a chain, but it definitely had that vibe. Sure enough, it is...\n\nAlong with the house wine, I tried their Fried Brussels Sprouts and French Onion Soup. My friend and I agreed that the Brussels Sprouts were too vinegary, while I found the soup just acceptable. \n\nI would come back for happy hour drinks, but not likely for anything else.", "rating": 3, "date": "2018-02-04"}, {"excerpts": ["The Brussels sprouts where done to perfection.   ", "We also got in without reservations on valentines day."], "author": "MIchael H.", "review": "The mahi mahi was great. They took great care with our food allergies and made the fish and sides with no butter. The Brussels sprouts where done to perfection.   We also got in without reservations on valentines day.", "rating": 5, "date": "2013-03-14"}], "onion strings": [{"excerpts": ["The onion strings weren't what I expected, I think I misread the menu, thinking I was ordering onion rings. ", "They were thin strings breaded and fried. ", "Added to the burger, they were quite tasty, just too much of them!\n", "Servers were good and attentive, and helped us move to a heated table as it was freezing out. ", "Loved sitting outdoors and people watching until the game started. ", "I'd return for the pizza and entertainment!"], "author": "Cali M.", "review": "Love the excitement near the Giants stadium, this place is right on the strip, across from the park, you can sit on the street side patio, under heat lamps, have a cocktail and enjoy the whole experience! This is pretty much what you are paying for. I felt that it was way overpriced because it's at AT&T park and because they can. \nWe ordered the burger, which came with an over easy egg and bacon on it, for $2 more, making it $21. It was good but not a $21 burger. We also ordered a pepperoni pizza and the onion rings (or strings) .. The pizza was very good! The onion strings weren't what I expected, I think I misread the menu, thinking I was ordering onion rings. They were thin strings breaded and fried. Added to the burger, they were quite tasty, just too much of them!\nServers were good and attentive, and helped us move to a heated table as it was freezing out. Loved sitting outdoors and people watching until the game started. I'd return for the pizza and entertainment!", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["We ordered our Bloody Marys (a soda for the kid) and the fried onion strings and pulled pork sliders. "], "author": "Rebekah T.", "review": "Momo's is pretty good. We came here yesterday after visiting the Giants County Fair with my friend Jenn and her daughter Olivia. We wanted some real food and a Bloody Mary to enjoy in the sun. (It was so beautiful yesterday)\n\nWe ordered our Bloody Marys (a soda for the kid) and the fried onion strings and pulled pork sliders. It was a perfect small meal for 3, each getting a slider and the onion string appetizer was pretty big. \n\nThe best part was sitting in the sun watching all the Giants fans walk by, enjoying a great drink with good friends.", "rating": 4, "date": "2009-07-13"}, {"excerpts": ["If however, you come here a savvy consumer, you can order wisely, share food, and make sure to try the onion strings because they're fricken unbelievably good!\n\n"], "author": "David O.", "review": "MMMMMmmmmomo's.   Yummy! It's utterly psychotically overpriced and a meal for two will easily set you back a bill or two with a bottle of wine, so it's totally not worth the price.\n\nIf however, you come here a savvy consumer, you can order wisely, share food, and make sure to try the onion strings because they're fricken unbelievably good!\n\nObviously, way more fun if you can do all this on Game Day, since you're right across from Pac Bell..errr... SBC...sorry... AT&T Park.", "rating": 4, "date": "2007-01-04"}, {"excerpts": ["Onion strings were awesome.  ", "And the chicken pear salad with some crumbled blue cheese added as an extra was so good", ", i would eat that every week if I could.  ", "On a non-game day, seating was plentiful and with the nice weather, sitting outside was an extra treat.  ", "This helped get the 4-star rating.  ", "There were many good sounding items to try on future visits.  ", "We''ll see if they can hold up to the rating."], "author": "Lewis C.", "review": "Had a really good lunch here recently.  Onion strings were awesome.  And the chicken pear salad with some crumbled blue cheese added as an extra was so good, i would eat that every week if I could.  On a non-game day, seating was plentiful and with the nice weather, sitting outside was an extra treat.  This helped get the 4-star rating.  There were many good sounding items to try on future visits.  We''ll see if they can hold up to the rating.", "rating": 4, "date": "2012-05-14"}, {"excerpts": ["The other appetizer we got was the onion strings. ", "I love fried onions, but these were so fine", ", it was like there was no onion ", "and it was all fried batter. ", "Next time, I will just stick to the caeser and flatbread like usual."], "author": "Alycia N.", "review": "We love this place and go frequently for the happy hour drinks and appetizers. We went after a game this time so the bar was packed, instead we ate in the dining room for the first time.\n\nWe just the caesar salad (which is one of our favorites in the area because they use real anchovies on them) and a margherita flatbread, which is plenty for two people. \n\nHowever, this time we also tried an appetizer that we hadn't had before: the 'grilled and chilled artichoke'. Unfortunately, it was a bust. We couldn't figure out how to eat it and after the server told us, we realized there was actually very little food, if you were able to actually dig it out. (The sauce to dip the artichoke in was fantastic though.) The server said that she actually had a lot of patrons have the same complaint about the dish and got us a different appetizer and comped the artichoke: no questions asked. The other appetizer we got was the onion strings. I love fried onions, but these were so fine, it was like there was no onion and it was all fried batter. Next time, I will just stick to the caeser and flatbread like usual.", "rating": 4, "date": "2012-07-05"}, {"excerpts": ["We ordered crispy onion strings, and first we got calamari, which was immediately replaced by soggy onion strings.  ", "Tasty, but definitely lacking the advertised crispiness.  ", "He straightened it out, comped the onion strings and a drink, and apologized.  ", "Maybe he was new.  "], "author": "Ramon V.", "review": "Momo's has slipped a notch.\n\nBoom Boom has retired, the game-day menu has been streamlined, and the sevice was not up to par on our most recent visit.\n\nLosing a great maitre'd like Boom Boom certainly hurts, even if they have plenty of friendly, pretty young women working there.  Boom Boom knew everyone's name, and really made you feel welcome.\n\nThe streamlined menu idea is a mistake.  The waiter said it was so that they could offer quality food with no delays, but we had never had problems with the quality of the food or timeliness of the service.\nNow, many of our favorite dishes are not available prior to baseball games, and that is pretty much the only time we eat at Momo's.\n\nWe ordered crispy onion strings, and first we got calamari, which was immediately replaced by soggy onion strings.  Tasty, but definitely lacking the advertised crispiness.  To their credit, they did comp these when we complained.\n\nDrinks were slow in coming from the bar.  The bar was busy, but it was a Sunday morning/afternoon, and wasn't THAT busy.  \n\nThe waiter seemed to have a problem with the computer they enter the orders in, because he would be on it for quite some time after each order, and when he brought the bill, it included things we had not ordered.  He straightened it out, comped the onion strings and a drink, and apologized.  Maybe he was new.  There seemed to be several new faces, and new art on the walls, if that matters to anyone.\n\nMy burger was cooked perfectly, and very tasty, with a generous helping of bacon.  The wife loved her salad and enjoyed the shrimp.", "rating": 4, "date": "2009-04-21"}, {"excerpts": ["And the onion strings are really good too. "], "author": "Vickie D.", "review": "This review is mainly for the Martini Happy hour. I did go to Momo's for dinner a couple of years ago and liked it.\n\nMartini Happy hour (4-7pm)! All martini's are $4 and there are also $3 appetizers. The appetizers are HUGE. If you order a pizza, it is pretty much enough for a meal. And the onion strings are really good too. I think my favorite martini was the Sparkling Grape (they put champagne in it). \n\nKeep in mind though, that Happy Hour doesn't happen on game days (or during March madness). So make sure no big games are happening before you go.", "rating": 4, "date": "2009-04-16"}, {"excerpts": ["The shoestring onions were a nice complement to the sliders, but it was just a huge pile of fried onion strings so nothing to really rave about. \n\n"], "author": "Roy C.", "review": "I came to MoMo's with a buddy on a Saturday night around 6:30pm and this place was absolutely EMPTY. The only reason why we went in to try this place out was because you could see the hostess from outside and if boredom could have a face, it would be that of the hostess at MoMo's. So we felt bad for her and so we decided to give her some customers to host. \n\nWe ate at the bar and we ordered the (1) sliders, (2) pepperoni pizza, & (3) shoestring onions. The sliders were decent, but honestly, I don't think they're worth $13.00. Each of three sliders were tiny (about 3 bites) and they were all lacking in taste. I didn't have the pepperoni pizza, but it looked pretty plain. The shoestring onions were a nice complement to the sliders, but it was just a huge pile of fried onion strings so nothing to really rave about. \n\nOur bill for two came out to a little over $60.00, which I felt was WAY too pricey for bar food and two drinks. I could've gotten better food for cheaper at Gordon Biersch or any pub around the corner. If I were to ever come back in the future, it would have to be during Happy Hour or something when the prices are a lot more reasonable.", "rating": 2, "date": "2008-11-10"}, {"excerpts": ["My boyfriend found a hair in our onion strings we ordered.  ", "We tell the bartender, but instead of replacing our dish he questions if it was our hair instead.  "], "author": "Michelle A.", "review": "My boyfriend found a hair in our onion strings we ordered.  We tell the bartender, but instead of replacing our dish he questions if it was our hair instead.  Then he says, Well... what do you want me to do about it? \n\nDon't even waste your time there.", "rating": 1, "date": "2008-04-08"}, {"excerpts": ["so i ordered the philly cheese steak sandwich with crispy onion strings.  ", "it was disgustingly gooey, greasy, and fattening.  "], "author": "Anh V.", "review": "casual digs for comfort food.\n\nit's not gonna be pretty.  it's not going to be cheap since it's on the embarcadero near the ball park.  and who are we kidding?... it's not going to be fine dining.\n\nbut if you are in the neighborhood and want something fried, swing on by.\n\na group of work folk lost a bet and took the winners out for lunch here.  it was sunny and so we basked in the sun and glory of the win out on the patio.\n\nhalf of the table ordered the buffalo chicken sandwich.  it looked delicious but i can't eat chicken so i ordered the philly cheese steak sandwich with crispy onion strings.  it was disgustingly gooey, greasy, and fattening.  in other words, yummy.\n\nwash it down with some iced diet coke and i was feeling that boy, victory sure is sweet.", "rating": 3, "date": "2009-02-15"}, {"excerpts": ["Last weekend when the Giant's were playing I started my day with Brunch at Momo's munching on onion strings and Amazing Mac & Cheese. ", "Sipping  $5 dollar mimosa's ", "I watched the craziness outside while enjoying the speed ans efficiency of the restaurant inside. ", "I am always happy with this place wish it was closer so I could go there more often!"], "author": "Kris M.", "review": "Every time I go to the ball park I make a reservation at MOMO's . Last weekend when the Giant's were playing I started my day with Brunch at Momo's munching on onion strings and Amazing Mac & Cheese. Sipping  $5 dollar mimosa's I watched the craziness outside while enjoying the speed ans efficiency of the restaurant inside. I am always happy with this place wish it was closer so I could go there more often!", "rating": 4, "date": "2010-05-04"}, {"excerpts": ["what is the meaning of the SAN FRANCISCO HEALTH CARE SECURITY ORDINANCE surcharge and what does it have to do with my fried onion strings?\n\n", "crab salad and onion strings."], "author": "Josie M.", "review": "what is the meaning of the SAN FRANCISCO HEALTH CARE SECURITY ORDINANCE surcharge and what does it have to do with my fried onion strings?\n\n3 stars less 1 due to poor value and mysterious surcharge.  \n\nrecommended:  crab salad and onion strings.", "rating": 2, "date": "2008-02-21"}, {"excerpts": ["The onion strings are very good (though not in the same league as Rigolo's) and I really like the eggs & smoked salmon flatbread.  ", "But the service is atrocious.  ", "We saw our onion strings sitting on a counter for about ten minutes before they were brought to us.  ", "And we were left waiting to order and any time we need to talk to the server for ages.  ", "Our kids liked the food, but are not nearly patient enough for the service."], "author": "Paul H.", "review": "The food here is actually pretty good, probably deserving of 3.5 stars.  The onion strings are very good (though not in the same league as Rigolo's) and I really like the eggs & smoked salmon flatbread.  But the service is atrocious.  We saw our onion strings sitting on a counter for about ten minutes before they were brought to us.  And we were left waiting to order and any time we need to talk to the server for ages.  Our kids liked the food, but are not nearly patient enough for the service.", "rating": 2, "date": "2008-12-26"}, {"excerpts": ["addictive onion strings.  ", "had smallest bottle of champagne ", "i've ever seen in my life (187 ml), and it was worth it."], "author": "Catherine H.", "review": "classy.  bar.  wonderful atmosphere, decent food but high prices for what you get.  addictive onion strings.  had smallest bottle of champagne i've ever seen in my life (187 ml), and it was worth it.", "rating": 3, "date": "2006-04-06"}], "roasted beets": [], "artichoke dip": [{"excerpts": ["We also had the artichoke dip, which was good but a small serving for the four of us at the table. \n\n"], "author": "Dana S.", "review": "Momo's has always felt like a part of the day at AT&T Park. I don't go often, but I love walking by and seeing the fun going on inside before a game. The few times I've gone in, sat down, and eaten before a game I haven't been disappointed! I love being surrounded by Giants fans and a fun vibe, so the culture is great. The food is good, but not my favorite part of the experience. Last time I went I had the fish plate - sole with garlic mashed potatoes and spinach. The spinach was well cooked and the sole and potatoes were tasty, but nothing out of this world. I stole some French fries from my dad and best friends plate and was much more satisfied with that potato preparation than my own. We also had the artichoke dip, which was good but a small serving for the four of us at the table. \n\nOverall good! More of a place to go if you want a fun vibe rather than knock it out of the park food.", "rating": 3, "date": "2018-07-29"}], "mussels  fries": [], "butternut squash": [], "crispy calamari misto": [], "thai chili glazed chicken wings": [], "pepperoni  sausage": [], "artichoke  pesto": [], "barbeque chicken": [], "wedge": [{"excerpts": ["We had margarita pizza, beet salad, wedge salad, Caesar salad, and shrimp cocktail. ", "All was exceptional. ", "The service was as good as the food!"], "author": "Sarah W.", "review": "What a treat before going to the Giants game! The location is perfect, and the food was exceptional. We had margarita pizza, beet salad, wedge salad, Caesar salad, and shrimp cocktail. All was exceptional. The service was as good as the food!", "rating": 5, "date": "2018-04-20"}, {"excerpts": ["It starts with an Iceberg Wedge Salad covered with a major ladle of blue cheese dressing (see photo). ", "Jamie paid the extra $2 for a crock of French Onion Soup that came with a huge layer of dairy gluttony accurately referred to as \"Three-Cheese Decadence\" (see photo). ", "The medium-rare steak itself was huge with a peppery marinade freckled with capers. ", "It came atop a mound of horseradish mashed potatoes and sauteed green beans (see photo). "], "author": "Ed U.", "review": "MoMo's is still not a place for gays who stutter. It's just a place for a steak dinner that's finally a bargain. I actually tried the $29 NY Steak dinner before about a year or so ago and thought it was decent enough but not enough to motivate me to update my review of this place. Jamie W. and I tried it again last week, and I'm happy to report that things have improved since our last visit. Now the NY Steak dinner is a good deal if you are particularly carnivorous.\n\nIt starts with an Iceberg Wedge Salad covered with a major ladle of blue cheese dressing (see photo). Jamie paid the extra $2 for a crock of French Onion Soup that came with a huge layer of dairy gluttony accurately referred to as \"Three-Cheese Decadence\" (see photo). The medium-rare steak itself was huge with a peppery marinade freckled with capers. It came atop a mound of horseradish mashed potatoes and sauteed green beans (see photo). Good, artery-clogging eatin'.\n\nIn a case of too little, too late, I tried to make up for the evening's crimes with a martini glass of mango sorbet. Jamie said the hell with it and ordered the Vanilla Ice Cream Sundae with Chocolate Sauce (see photo). My, that was a lot of food. but it looked like a lot of tables were following the same route toward a coronary. A deal is a deal, and on a non-game night, it's quite bearable in that cavernous place. I'm not much of a fan of Pete's or Pedro's, but I kinda like MoMo's. No, I'm not stuttering.\n\nFOOD - 4 stars...a whole lotta meat and fixings for $29\nAMBIANCE - 3.5 stars...a big space that strangely feels crowded\nSERVICE - 3.5 stars...serviceable, no more\nTOTAL - 4 stars...stop stuttering!", "rating": 4, "date": "2011-01-26"}, {"excerpts": ["The wedge salad was \"ok\" it was not cold and therefore somewhat soggy. ", "Had to flag down our server for silverware! ", "Menu prices are very high.  ", "Here was the kicker...stated on Momo's menu is \"A 4% Surcharge On All Guest Checks.", "\"  HUH?", "?? Come to find out this \"surcharge\" is to help the restaurant provide optional health insurance to their employees. ", "Okay fine, offer your employees health insurance, but advertising a mandatory surcharge on their menu sounds like restaurant politics to me. ", "As a diner that is a huge turn off! ", "Chef doesn't want his dishes priced higher, management wants healthcare. ", "...", "WHATEVER. ", "So, IF I ever dine there again (very unlikely) I plan to tip @ 14% ", "I'll keep the remaining 4% to cover MY health insurance.  ", "Figure it out - and don't involve your patrons!! ", "Oh ya...and squeezing my way past 1000 celebrating Dodgers fans really didn't help either!"], "author": "Michelle M.", "review": "Giants lost to the Dodgers, came here to get a quick bite and go home and pout. We had Bbq pork sliders which was a bit dry, but nice tangy sauce. The wedge salad was \"ok\" it was not cold and therefore somewhat soggy. Had to flag down our server for silverware! Menu prices are very high.  Here was the kicker...stated on Momo's menu is \"A 4% Surcharge On All Guest Checks.\"  HUH??? Come to find out this \"surcharge\" is to help the restaurant provide optional health insurance to their employees. Okay fine, offer your employees health insurance, but advertising a mandatory surcharge on their menu sounds like restaurant politics to me. As a diner that is a huge turn off! Chef doesn't want his dishes priced higher, management wants healthcare. ...WHATEVER. So, IF I ever dine there again (very unlikely) I plan to tip @ 14% I'll keep the remaining 4% to cover MY health insurance.  Figure it out - and don't involve your patrons!! Oh ya...and squeezing my way past 1000 celebrating Dodgers fans really didn't help either!", "rating": 2, "date": "2013-07-11"}, {"excerpts": ["Across from AT&T Giants ball park\nFast Service\nStaff is very nice\nFrench Onion Soup\nWedge Salad - although a bit skimpy on the bacon and tomatoes.\n\n"], "author": "W. C.", "review": "Pro:\nAcross from AT&T Giants ball park\nFast Service\nStaff is very nice\nFrench Onion Soup\nWedge Salad - although a bit skimpy on the bacon and tomatoes.\n\nCon:\nCeasar Salad sucked. Its the kind of salad where they give you the heart of the lettuce that has no color what so ever. So unappealing, they need to stop that trend. It is uncut, sorry, I don't find uncut lettuce ooolala. It is just lazy. Leaves on a plate some cheese sprinkled. I asked for the dressing on the side, which they did, but its not the best dressing I had. I also asked if they could add chicken. It was obviously chicken that had been processed and bagged somewhere else. It certainly wasn't grilled chicken. And they charged me an extra $3 for this crappy grey chicken. It tasted fine, but so unappealing to the eyes.\n\nMy friend had the burger, which he said had no seasoning what so ever and was pretty bland.\n\nSince my salad was so lack luster we also ordered the toasted bread with tomato, mozzarella cheese, tomatoes. They were kind of sparse on the balsamic vinegar and it was a bit watery. Very little basil.\n\nThe best part was (sarcasm here) was that for two soups, two salads, a burger and some bread and cheese....it was $88! I could have had a better meal going to Safeway two blocks down the street and getting a sandwich for $6-7 and been more satisfied. \n\nIt wouldn't take much to elevate this restaurant into a good eating establishment if they broadened the menu a bit and used a bit higher quality of ingredients. Trust me they are rolling in dough at the bar, so they could afford to make better food it they so desired. \n\nCaution about outdoor seating. Smokers like to linger on the sidewalk and people with cigars like to walk by...Blech.\n\nI will not be eating here again. Ball park food seemed more interesting then this place.", "rating": 2, "date": "2013-07-09"}, {"excerpts": ["We both had a wedge salad, which was pretty good. ", "It was served to us by yet another person -- a blonde, female waitress. ", "After that, our steak dinners came, and were served by the manager guy. ", "I'd have to say that the steaks were 1/3 fat, 2/3 meat, so that was kinda disappointing. ", "The meaty parts of the steak were really good, and cooked exactly as I requested -- medium rare! "], "author": "Natahley B.", "review": "It's possible that I was here on an \"off\" day, or at an awkward time... because I sure felt awkward. \n\nFirst, there was no hostess when we walked in. We stood around like uninvited guests at a party for people that were too cool to acknowledge us -- the bartender clearly saw us standing there, and was well within earshot, but just ignored us. I finally had to walk directly up to the bar to ask if there was a hostess. A minute later, the hostess finally showed up. We asked to be seated outside, and we were seated on the patio to the left of the entrance (from streetview). \n\nOur waiter came out, saw us, and a storm cloud crossed his expression. He looked PISSED that he had yet another table to wait on. He came over, brusquely asked what we wanted to drink, then huffed off to get it. We also observed him talking to the hostess in what appeared to be a mean way, admonishing her for seating us in his section. I think that his shift was about to end, and she'd seated us there anyways. Judging by the extreme shortness of her skirt, and sheerness of her top, she seemed more worried about how much skin she could get away with exposing, rather than paying attention to trivial things like \"work.\" I thought this was a family establishment outside the ballpark? Whatever.\n\nMoving on. Someone other than our waiter brought our drinks out. He appeared to be a manager or something, because he was in something more like a suit. He told us the specials, because our waiter sure hadn't. At that point, my boyfriend and I had settled upon the \"app + steak dinner + dessert\" deal. We both had a wedge salad, which was pretty good. It was served to us by yet another person -- a blonde, female waitress. After that, our steak dinners came, and were served by the manager guy. I'd have to say that the steaks were 1/3 fat, 2/3 meat, so that was kinda disappointing. The meaty parts of the steak were really good, and cooked exactly as I requested -- medium rare! And the sides were awesome -- snap peas and cheese potatoes. \n\nOnce we were done, we had to wait a while for someone to come clear out plates. Then, we had to ask to see the dessert menus. The blonde waitress was back at this point. We ordered the molten chocolate cake and banana bread pudding (I think?). They were both phenomenal. Best parts of the meal! I don't even remember who cleared those plates or brought the check. Drink refills were hard to come by, as well, due to the fact that we had so many people trading off the responsibility of waiting on us.\n\nWe were clearly just a burden on the establishment at that point, and as we watched various waiters starting/ending shifts and flirting with the hostess,and we observed the fact that no one else was seated in our section, it became clear that we probably would have had a much better experience if the hostess had been paying attention and we had been seated in the proper area.\n\nOverall, I think I'd give Momo's another chance because the food really was pretty decent, and the prices were not at all bad. Hopefully, though, we'll just have one server!", "rating": 3, "date": "2010-10-03"}, {"excerpts": ["3-COURSE NY STEAK DINNER\" which comes with Soup de Jour or Iceberg Wedge Salad, New York Prime Steak w/side, and a dessert for $29.  "], "author": "Kimiko Q.", "review": "I like coming to MoMo's.  Well, correction, I like being treated out to MoMo's.  I'd never be able to afford it on my own :P\n\nNearly everyone in my party (myself included) get \"THE CITY'S JUICIEST 3-COURSE NY STEAK DINNER\" which comes with Soup de Jour or Iceberg Wedge Salad, New York Prime Steak w/side, and a dessert for $29.  The waitress was nice enough to switch out the salad for a Caesar though I must admit it was uneventful.\n\nThe steak was good AND juicy.. I ordered medium and it came very medium rare.  I didn't complain though because it was perfect when I reheated it the next day.\n\nAll in all a bit pricey for casual dining but I love going when I'm not paying (:", "rating": 3, "date": "2011-01-04"}, {"excerpts": ["If you love blue cheese, the way that I do, get the iceburg wedge with blue cheese and bacon bits.  ", "A large salad!  ", "I also had the crab cake that was delicious.  ", "My sons had hamburgers and they thought they were perfect.  "], "author": "Rose J.", "review": "The whole family (8 of us) went to see the Giants win against the Padres 8-1!!!  Yeah!!\nI made reservations at MoMo's and we had a table ready for us and received ice water, bread, butter right away.  Our server, Rachel, couldn't have been more helpful.  We all had very good wine, beer, and other drinks.  If you love blue cheese, the way that I do, get the iceburg wedge with blue cheese and bacon bits.  A large salad!  I also had the crab cake that was delicious.  My sons had hamburgers and they thought they were perfect.  The sisters really liked the onion soup.\n\nYes, MoMo's is best known for their bar.  It is a great place for Giants fans before and after the game, but do try the restaurant, too.  I saw a number of  people enjoying the pizza.\n\nLet's Go Giants!!", "rating": 4, "date": "2011-09-14"}, {"excerpts": ["Our first course was the iceberg wedge salad with blue cheese.  ", "The dressing wasn't great, but the salad was pretty decent.  ", "The second course was \"the juiciest steak in town.\"  ", "About 12-14 oz of low-grade sirloin was indeed juicy; however, it didn't make up for the fact that it was chewy, stingy and fiber-y.  ", "It was served with slightly undercooked green beans and slightly burned potatoes au gratin.  ", "The dessert, however was great.  ", "The ice cream sunday, served in a tall aluminum martini glass, was mmm mmm good!  ", "A scoop of vanilla ice cream, topped with caramel and walnut, with just a slight hint of dulce de leche.  "], "author": "Yan G.", "review": "This place is crowded (even in the waiting area).  At this place, they will make you show your driver's license at the entrance.  I go to this place once a year, only when I absolutely have to.  You may think I am talking about your local DMV office, but I am talking about MoMo's.\n\nDue to its location and shameless self promotion, MoMo's has quickly become a San Francisco institution.  Located directly across from AT&T Park, MoMo's has become THE place to grab a pre-game drink or even dinner.  Be prepared for long lines at the bar, and forget about sitting on the patio if the weather is nice.  Don't think you're the only one who figured out that a quick stop at MoMo's might be fun.\n\nThis place is yet another example of commercialization of baseball.  MoMo's patrons, by en large, could really care less about the game.  They are more interested in getting a nice buzz before heading off to their Field Club seats in the bottom of the fourth inning.  There is nothing wrong with this, but it is that kind of a crowd.  It's not baseball fans going to a bar, it's the bar crowd catching a baseball game.\n\nI've been to MoMo's a number of times, and I always left the place thinking: \"MoMo's?  Meh.\"  The food is not exciting, and talk about overpriced!  Yikes.  You are definitely paying for the location and for people watching.  I would add ambiance to this list, but MoMo's lacks any kind of feel, really.  It's just blah.\n\nI came here a couple of weeks ago with a friend from out of town before the Giants/Dodgers game.  We wanted to eat elsewhere, but the place was too crowded.  He wanted to try MoMo's, and, despite my many warnings, we decided to go in.  After a 14-minute wait, we were seated in a spacious back room with mirrors on the walls and tables very far apart from one another.  The restaurant was busy and noisy.  \n\nWe opted for something new: their $29 prix fixe steak dinner menu.  It looked too good to be true: a salad, an entree and a dessert for $29?  Most entrees were in the $22-$25 range.  \n\nOur first course was the iceberg wedge salad with blue cheese.  The dressing wasn't great, but the salad was pretty decent.  The second course was \"the juiciest steak in town.\"  About 12-14 oz of low-grade sirloin was indeed juicy; however, it didn't make up for the fact that it was chewy, stingy and fiber-y.  It was served with slightly undercooked green beans and slightly burned potatoes au gratin.  The dessert, however was great.  The ice cream sunday, served in a tall aluminum martini glass, was mmm mmm good!  A scoop of vanilla ice cream, topped with caramel and walnut, with just a slight hint of dulce de leche.  In a word - scrumptious.  \n\nI will probably come back to MoMo's again, even if it is to take advantage of their $29 prix fixe.  Let's face it, $29 won't buy you a lot at the ballpark.  And why settle for a crappy hotdog or a mediocre hamburger when for the same price, you can have a below average steak brought to you by almost always friendly waiters?", "rating": 2, "date": "2009-09-23"}, {"excerpts": ["Loved the wedge salad.  ", "Fair pricing.  "], "author": "Gen d.", "review": "The food and service were surprisingly good.  The ambiance presented as a touristy, generic place.  However, the food was delicious.  Loved the wedge salad.  Fair pricing.  Lovely waiter.\n\nProblem:  We dined early and had to endure the sounds of an old-school, punitive-rather-than-inspiring line-up in the next room.  Ridiculous.  The MOD was breathing down necks.  Our waiter was smart and skilled.  The bussers were excellent.  They didn't need the manager hissing \"who has table _#_?__\" the minute we placed the credit card into the book.  The credit card had only been down 5 seconds.  We would have rather waited the full one minute for the waiter than to have had to imagine what it is like to work for this guy!  Hopefully I've jumped to wrong conclusions and everyone has a blast working at MoMo's.  They do a good job.", "rating": 3, "date": "2010-07-04"}, {"excerpts": ["We started with a lettuce wedge and the crab cakes, both of which were tasty, but I felt they were a bit overpriced. ", "Especially the crab cakes as there were only 2 on the plate, presented very beautifully, and tasty, nonetheless we paid $17 for 2 crab cakes. ", "I ordered the meatloaf, my wife the roasted chicken and my daughter of course a pepperoni pizza. ", "My meatloaf was very good and tasty as was the chicken, i am not a pizza fan and therefore did not try the pizza, but my daughter seemed to enjoy it. ", "We ended with some coffee and the apple pie which was very good as well. ", "Service was great and the fact that they had valet service out front to help with the always difficult task of finding parking in the city was a very big plus. ", "It is a bit pricy as we spent around $160 for the dinner for 3 of us, but overall we will definitely return."], "author": "Jeremy R.", "review": "Stopped by here on the way out of town for some dinner with my wife and daughter. We are avid Giant's fans and have always been curious about this restaurant across from the ballpark, and I must say we were pleased with the service and food. We started with a lettuce wedge and the crab cakes, both of which were tasty, but I felt they were a bit overpriced. Especially the crab cakes as there were only 2 on the plate, presented very beautifully, and tasty, nonetheless we paid $17 for 2 crab cakes. I ordered the meatloaf, my wife the roasted chicken and my daughter of course a pepperoni pizza. My meatloaf was very good and tasty as was the chicken, i am not a pizza fan and therefore did not try the pizza, but my daughter seemed to enjoy it. We ended with some coffee and the apple pie which was very good as well. Service was great and the fact that they had valet service out front to help with the always difficult task of finding parking in the city was a very big plus. It is a bit pricy as we spent around $160 for the dinner for 3 of us, but overall we will definitely return.", "rating": 4, "date": "2012-12-29"}], "chicken  danjou pear": [], "cobb": [{"excerpts": ["We have been there twice when we had time to kill before the park opens (park entrances open 2 hours before the game), and grabbed a drink (they have full bar and some interesting cocktails) and salad (cobb and anjou pear/chicken).  \n\n"], "author": "Bill H.", "review": "This place is a 'fixture' right across from AT&T park.  Both indoor and outdoor seating (but outdoor has umbrella shades, fans all around you, and easy viewing of the stadium, trolley and crowds.)\n\nWe have been there twice when we had time to kill before the park opens (park entrances open 2 hours before the game), and grabbed a drink (they have full bar and some interesting cocktails) and salad (cobb and anjou pear/chicken).  \n\nIt always looks crowded on game day, but folks get seated within a few minutes.   There are plenty of great places to eat  amazing food inside the park, but you should experience the vibe here for at least 1 game.  \n\nThis place is pricey, food is ok, but the Giants baseball vibe is 5-stars!", "rating": 3, "date": "2018-08-05"}, {"excerpts": ["I ordered a Cobb salad that was beautifully built with ample avocado, bacon, and chicken over mixed green along with cherry tomatoes and a sliced boiled egg. ", "The red wine vinaigrette was served on the side. "], "author": "Kristine H.", "review": "We were meeting a friend for lunch during his work day and he suggested MoMo's. We were lucky and found a parking spot right beside this place so our lunch date started off nicely! The day was nice so we sat outside on their patio that was decorated with fat little succulents in footed pots. Some of the plants were beautifully red ones that matched the huge olive heart sculpture in front of the restaurant. \n\nI ordered a Cobb salad that was beautifully built with ample avocado, bacon, and chicken over mixed green along with cherry tomatoes and a sliced boiled egg. The red wine vinaigrette was served on the side. I also ordered some Brussels sprouts roasted with shallots, lemon, and olive oil instead of garlic butter since I am allergic to cow's milk. \n\nWe ordered two of the wood-fired pizzas and both pizzas were beautifully made. The vegetarian pizza had grilled squash, peppers, olives, mozzarella, ricotta salata, and pesto. The other pizza had Prosciutto Di Parma, smoked gouda, Calabrian chiles, and arugula.\n\nThe complimentary bread and butter kept coming and by the time we were done, we were stuffed! I don't know what this place is like during games (busy, I imagine) or at night, but for a lunchtime destination, we were pleased with the prices and food quality.", "rating": 4, "date": "2017-06-06"}, {"excerpts": ["I ordered at pulled pork sandwich with sweet potato fries and my friend ordered a cobb salad with a beer; a hefeweizen to be exact.\n", "The beer came out promptly followed by two waters. ", "Her words were, \"this beer is incredibly flat and room temperature\". ", "Not wanting to be a bother as they were busy and the bartender was pleasant, she drank it anyway. ", "*insert bitter-beer-face here", "After about 10 minutes, her cobb salad came and the bartender follows by saying \"your pulled pork will be right out, the kitchen is backed up\". ", "Game day, understandable. \n", "Then 20 minutes pass. ", "30 minutes. ", "Almost an hour... ", "and here my friend is, done with her salad and working on her third beer while I'm patiently drinking my coffee trying to hide my frustration due to hunger. ", "Our bartender emphasized with us, continuously went to the kitchen to check on the status and updated me. ", "Come to find out, \"the sandwich came out a while ago\".... ", "Must have gone to the wrong patron. ", "=( ", "so he comped us a beer.  ", "At that point, we were almost late to the game "], "author": "Ryan L.", "review": "I have been to MoMo's a handful of time;  most memorably, the 2012 giants world series game. The crowd was fun, it was a packed house and the bartenders were on top of their game.\n\nThat being said, this past Sunday was the first time I have actually come to eat. It was before a giants game so we grabbed a seat at the bar. I ordered at pulled pork sandwich with sweet potato fries and my friend ordered a cobb salad with a beer; a hefeweizen to be exact.\nThe beer came out promptly followed by two waters. Her words were, \"this beer is incredibly flat and room temperature\". Not wanting to be a bother as they were busy and the bartender was pleasant, she drank it anyway. *insert bitter-beer-face here*\n\nAfter about 10 minutes, her cobb salad came and the bartender follows by saying \"your pulled pork will be right out, the kitchen is backed up\". Game day, understandable. \nThen 20 minutes pass. 30 minutes. Almost an hour... and here my friend is, done with her salad and working on her third beer while I'm patiently drinking my coffee trying to hide my frustration due to hunger. Our bartender emphasized with us, continuously went to the kitchen to check on the status and updated me. Come to find out, \"the sandwich came out a while ago\".... Must have gone to the wrong patron. =( so he comped us a beer.  At that point, we were almost late to the game and I wasn't too hungry anymore.\n\nAnd, low and behold, the sandwich arrives in all its glory. It was small, but the pulled pork itself was remarkable. The sweet potato fries, on the other  hand, were cold but we were so crunched with time it didn't matter.\n\nAll in all, would I pay $15 for a small pulled pork sandwich again? Absolutely not. There is far less expensive, far better food in the area. $50 later, I left and got garlic fries and chicken tenders at the game because I was still hungry.\n\nWhat saved MoMo's for me was the incredible bar staff who was not only personal but also empathetic/understanding of our situation instead of brushing us off because I wasn't drinking. (didn't catch his name, but he was the buffer white guy who I talked about marathons with).\n\nDefinitely come in for a drink or a sit down dining experience, but I'd personally pass eating at the bar again.\n\nGo giants!", "rating": 3, "date": "2013-05-14"}, {"excerpts": ["Had the cobb salad for lunch, with balsamic vinaigrette. ", "Not enough dressing in one ramekin. ", "Mixed greens which I don't care for and left somewhat hungry. ", "All for nearly $20 after tip and tax. ", "Certainly not my last time to MoMo's, just won't be ordering that again, or might just stick to pre/post Giants games drinking."], "author": "Anthony T.", "review": "Beautiful and rare hot day on the patio. Had the cobb salad for lunch, with balsamic vinaigrette. Not enough dressing in one ramekin. Mixed greens which I don't care for and left somewhat hungry. All for nearly $20 after tip and tax. Certainly not my last time to MoMo's, just won't be ordering that again, or might just stick to pre/post Giants games drinking.", "rating": 2, "date": "2013-05-03"}, {"excerpts": ["I would venture to say that momo's has the best Cobb salad in town.  ", "I go there for business lunches ", "and I try and try other items on the menu ", "but I can't get away from the Cobb.  ", "Everything I have had has been excellent but if you are a salad fan, they are pretty dang good here.  ", "My sister had the Chicken Pot Pie and I must say it was off the chain as well."], "author": "Kirsten M.", "review": "I would venture to say that momo's has the best Cobb salad in town.  I go there for business lunches and I try and try other items on the menu but I can't get away from the Cobb.  Everything I have had has been excellent but if you are a salad fan, they are pretty dang good here.  My sister had the Chicken Pot Pie and I must say it was off the chain as well.", "rating": 5, "date": "2011-02-14"}, {"excerpts": ["They have a good Cobb Salad, Meatloaf, and really good chocolate chip cookies. ", "Dont go on a game night it is packed."], "author": "Steven C.", "review": "I love the location, right across from AT&T Park. The food is pretty good. They have a good Cobb Salad, Meatloaf, and really good chocolate chip cookies. Dont go on a game night it is packed.", "rating": 4, "date": "2008-05-05"}, {"excerpts": ["The other three peeps in my party had the crab salad, Cobb salad, and chicken salad. ", "All were very fresh, with lots of crispy greens and generous portion of the appropriate proteins. ", "The crab in particular was very fresh, and large in quantity.\n", "I will definitely go back to Momo's."], "author": "Johnny O.", "review": "I'm not sure why the reviews for Momo's are so bad. I have visited 3 times and was satisfied every time. The first time was at an awards banquet honoring the great Pat Kuleto and Charles Phan of Slanted Door fame. The appetizers were tasty and being offered to us what seemed like every 30 seconds throughout the hour or so we hung out by the front. When dinner was served, I had the pot roast, which was the most tender and juicy pot roast I ever had. I would definitely recommend Momo's to anyone looking to book a private party. \nMy second visit was dinner with my wife. I had the Pot Roast again, and my wife ordered the BBQ platter, which was not particularly distinguished, but I remember the sausage standing out. I remember the dessert was good too. \nThird time, today, I had brunch with three family members. We started with the Bruscetta. Strong olive flavor on the bread, with prosciutto on top, and roasted vegetables on the side. Sooo good. I ordered the Flat bread with smoked salmon and cheesy chive scrambled eggs. Deliciously creamy eggs. The other three peeps in my party had the crab salad, Cobb salad, and chicken salad. All were very fresh, with lots of crispy greens and generous portion of the appropriate proteins. The crab in particular was very fresh, and large in quantity.\nI will definitely go back to Momo's.", "rating": 4, "date": "2006-10-28"}], "momos combo louie": [], "bay shrimp louie": [], "turkey club wrap": [], "the momos house burger": [], "breakfast burrito": [], "the american breakfast": [], "eggs florentine": [], "steak  eggs": [], "king st margarita": [], "the hendricks g  t": [], "moscow mule": [{"excerpts": ["I once ordered a moscow mule and it came in a highball rather than a copper mug. ", "The jalapeno margarita isn't that spicy. "], "author": "Jonathan B.", "review": "Summary: Location, location, location. Food is inconsistent. So is the service.\n\nDetails: MoMo's is across the street from AT&T Park (home of SF Giants) so it's a popular destination if you're catching a game. Despite it's flaws, it's likely the best of the neighborhood restaurants/bars. And it's definitely better than the food in the ballpark (unless you're in club seats).\n\nBrunch is only served on the weekend. If you want to get your drink on, the unlimited Mimosas are $20 - they aren't strong so you'll probably drink more than you expect. The huevos rancheros are pretty good but I'm underwhelmed by the eggs benedict. \n\nThe spiced lamb burger is surprisingly tasty; it's spiced well and flavorful. I can't say the same buffalo chicken sandwich. The burger is just a burger but I've gotten it several times and enjoy it. If you're trying to eat healthy, the go-to salad is MoMo's crab & shrimp louie - it's generously portioned. You could also get a Caesar with salmon or chicken but I find it boring.\n\nThe dinner menu only has a few extra items from the lunch and brunch menu. On a recent visit, a friend enjoyed the grilled Ahi tuna. The same friend swears by the margarita pizza but I've had it several times and think it's uninspiring. \n\nThere's a full bar with a decent selection of both wine and beer. Some of the cocktails are a bit surprising. I once ordered a moscow mule and it came in a highball rather than a copper mug. The jalapeno margarita isn't that spicy. But all of the alcohol is better priced than in the ball park so you might not be picky.\n\nAs you might expect from a place like this, it gets slammed on game day. Many of the servers handle the load well but some get overwhelmed. In general the staff is friendly, even when they are behind.", "rating": 3, "date": "2017-08-09"}, {"excerpts": ["I had a blueberry Moscow mule that came in a clear baller glass. ", "I was expecting a copper mule mug. ", "It was a little weird to call it that and bring it in a clear baller I thought. ", "Overall, it was good, but not fantastic by any means."], "author": "Heather R.", "review": "We ate on a Saturday night and it wasn't crowded at all. There was no game going on though either. We had a wide variety of foods. The garlic sausage pizza is delicious. The tuna tar-tar was very good. I also had the rock shrimp and was very disappointed. It was so chewy and overcooked. It really was like eating rubber and I couldn't finish it. My husband had the gumbo and enjoyed it. \n\nThe drinks were very overpriced and weren't very good. I had a blueberry Moscow mule that came in a clear baller glass. I was expecting a copper mule mug. It was a little weird to call it that and bring it in a clear baller I thought. Overall, it was good, but not fantastic by any means.", "rating": 3, "date": "2015-05-25"}, {"excerpts": ["A Moscow Mule and a glass of Pinot. ", "The check came to $65. ", "Pretty steeped for bar food. ", "There's better food for less in the neighborhood. "], "author": "Matt Y.", "review": "7/19/14  Dinner\n\nIn the neighborhood so we stopped by for dinner. I can tell this is sports bar/restaurant that would be packed to the gunwales on game nights since it's right across the street from AT&T Park. On the evening of 7/19 it was very slow and the menu is limited compared to what they post on their website. Menu offers mostly small plates and pizzas, with a few entrees.\n\n*Shrimp Po'Boy ($12): three mini po'boys served in gargantuanHawaiian rolls (in comparison to the portion of shrimps). Tasty deep-fried shrimps with spicy crema sauce. It's the best item of the evening. \n\n*Margherita Pizza ($14): is soggy despite generous portions of tomato and basil. I like my pizza thin-crusted. Momo's is thin enough except it is only crusty on the crust.\n\nFrench fries was a  little side order for $7. A Moscow Mule and a glass of Pinot. The check came to $65. Pretty steeped for bar food. There's better food for less in the neighborhood. All in all, the menu was obviously designed to provide the least amount of value for the most price.\n\nService is good and friendly.", "rating": 2, "date": "2014-07-23"}], "make bitter choices": [], "rye buzz": [], "cucumber cutter": [], "san franciscan": [], "la paloma": [], "strawberry basil smash": [], "mumm brut rose napa valley ca nv": [], "jcb brut rose burgundy france nv": [], "gloria ferrer brut sonoma ca": [], "zonin prosecco napa nv": [], "nicholas feuillatte brut france nv": [], "veuve clicquot yellow label france nv": [], "dom perignon brut france nv": [], "bex riesling germany": [], "angeline rose napa california": [], "belleruche cotes du rhone rose france": [], "urban provence cotes de provence france": [], "santa margherita pinot grigio napa": [], "napa cellars sauvignon blanc napa ca": [], "emmolo sauvignon blanc napa ca": [], "kim crawford sauvignon blanc new zealand": [], "kenwood chardonnay sonoma ca": [], "simi reserve chardonnay russian river ca": [], "patz  hall chardonnay sonoma ca": [], "davis bynum sauvignon blanc sonoma ca": [], "joseph phelps sauvignon blanc sonoma ca": [], "st superi virtu sauvignon blanc  semillon napa ca": [], "gary farrell chardonnay napa ca": [], "frank family chardonnay carneros ca": [], "hanzel chardonnay sonoma ca": [], "dumol chardonnay russian river ca": [], "estancia pinot noir monterey ca": [], "austerity pinot noir santa lucia highlands": [], "meiomi pinot noir monterey county ca": [], "oakwild ranch pinot noir russian river valley ca": [], "patz  hall pinot noir sonoma coast ca": [], "benzinger merlot sonoma ca": [], "artevino zinfandel yorkville county ca": [], "graffigna malbec argentina": [], "kenwood cabernet sauvignon sonoma": [], "hess shirtail cabernet sauvignon monterey": [], "franciscan cabernet sauvignon napa valley": [], "rodney strong cabernet sauvignon knights valley": [], "conundrum red blend napa ca": [], "barbed oak vineyard pinot noir sonoma ca": [], "joseph phelps freestone pinot noir sonoma": [], "flowers pinot noir sonoma ca": [], "frank family cabernet sauvignon napa ca": [], "mt veeder cabernet sauvignon napa valley": [], "jordan cabernet sauvignon sonoma ca": [], "joseph phelps insignia cabernet sauvignon napa": [], "bud light": [{"excerpts": ["The beers were 6 bucks each, for any kind of beer; so obviously I was going for the Anchor Steams and Stellas rather than a Bud Light. ", "We didn't get a chance to try the food but judging from the pictures I'm sure it is good. ", "I highly recommend MoMo's if you're not going to the game, but still want that exciting, intense experience of being at one."], "author": "Anthony L.", "review": "I was finally able to come here for the first time after hearing lots about it. My group of friends and I hung out at the bar/patio area on the 4th during the game, and we had a total blast. Such an awesome location being literally across the street from AT&T, and also within walking distance of many other restaurants/bars, BART, and Muni. The vibe was very loud with lots of yelling, which was definitely acceptable since it was during a game on July 4th. The beers were 6 bucks each, for any kind of beer; so obviously I was going for the Anchor Steams and Stellas rather than a Bud Light. We didn't get a chance to try the food but judging from the pictures I'm sure it is good. I highly recommend MoMo's if you're not going to the game, but still want that exciting, intense experience of being at one.", "rating": 4, "date": "2011-07-06"}], "anchor brewing christmas ale": [], "elysian space dust ipa": [], "firestone  blonde ale": [], "sierra nevada hazy ipa": [], "guinness": [], "lagunitas ipa": [{"excerpts": ["A lot of us ended up with Lagunitas IPA, which was fine... "], "author": "Em C.", "review": "This is mostly for drink before the game... Their draft system was down or something (wasn't quite sure with the noise) so we were left with what ever bottles they had on hand. A lot of us ended up with Lagunitas IPA, which was fine... But I really wanted a Blue Moon (I like orange when I drink, it's my thing). \n\nThat said their shots were ginormous and overflowing. And to top it off Their staff was very friendly and accommodating\nReally couldn't have asked for a nicer staff, you all were awesome. Part of the reason for the high rating.", "rating": 4, "date": "2015-08-30"}], "franziskaner hefeweisse": [], "shock top": [], "sierra nevada pale ale": [], "deschutes fresh squeezed": [], "fort point westfalia red ale": [], "stella artois": [], "trumer pils": [], "budweiser": [{"excerpts": ["they were your typical light beers and Budweiser.  ", "I don't know if I will be back to Momo's, maybe for a game sometime, but beware of the prices!"], "author": "Kate F.", "review": "Went here for drinks during/after a Giants game.  I was surprised the place wasn't too busy and we found some seats outside in the bar area.  The restaurant is kind of divided into two parts- there is a sit down restaurant side that's much quieter and then a bar and outdoor area.  The place is in a great location right across the street from the Giants stadium.  The only reason I am giving this place 3 stars is because the lackluster overpriced drinks.  3 doubles were costing us 60$ and it was not high end liquor.  I don't know if they raise their prices when its game day, but at 20$ a drink I couldn't afford to stay there for very long.  Another problem is that most of their beer had run out.  THey have a great bar with lots of draft handles but most of them had cups over them indicating they were out.  I don't know if they just didn't want to switch the keg or if they were really out, but out of maybe 12 taps I would say 5 were open and they were your typical light beers and Budweiser.  I don't know if I will be back to Momo's, maybe for a game sometime, but beware of the prices!", "rating": 3, "date": "2015-09-17"}], "golden state cider": [], "miller high life": [], "miller lite": [], "sierra torpedo ale": [], "sierra hop hunter": [], "ginger pineapple limeade": [], "strawberry basil lemonade": [{"excerpts": ["The strawberry basil lemonade was amazing!"], "author": "Jack W.", "review": "Our waiter was super friendly, and was not pushy at all, he even offered valuable insight into food options. The strawberry basil lemonade was amazing!", "rating": 5, "date": "2017-04-08"}, {"excerpts": ["I did also get the strawberry basil lemonade, which was great. ", "Overall pretty good, but I wouldn't say I would go out of my way to go here from across town. ", "Definitely a good place eating if you are going to a Giants game though."], "author": "Emma W.", "review": "This place was pretty good. I came here to meet my parents for lunch before a Giants game, which I think might have resulted in the slower service. It took a long time for our order to be taken, but once it was the food came out very quickly. I ordered the pulled pork sandwich with sweet potato fries and cole slaw. The sandwich was good, the fries yummy, but the cole slaw was nothing special. I did also get the strawberry basil lemonade, which was great. Overall pretty good, but I wouldn't say I would go out of my way to go here from across town. Definitely a good place eating if you are going to a Giants game though.", "rating": 3, "date": "2014-07-26"}], "aqua panna still": [], "s pellegrino sparkling": []}