{"degustazione formaggi": [], "carpaccio di manzo con parmigiano arugula olio e limone": [], "saute di cozze e vongole": [], "antipasto misto vegetariano": [], "carpaccio di salmone": [], "prosciutto di parma e melone": [], "aglio siciliano caramellato": [], "burrata fresca": [], "panzerotti": [{"excerpts": ["Moreover, I was disappointed by the appetizer, panzerotti, that were nothing special very badly fried. ", "One star for the environment and for the service."], "author": "Caterina R.", "review": "Truly the Worst pizza I have ever had: I ordered a basic Margherita pizza, the dough was fine but the sauce was simply terrible, left me a bad taste in my mouth for all the evening; also the cheese was stale. Enjoyed the atmosphere and the service, but the food was very disappointing. Would not suggest to anybody to go especially to native Italians. Moreover, I was disappointed by the appetizer, panzerotti, that were nothing special very badly fried. One star for the environment and for the service.", "rating": 1, "date": "2018-02-22"}, {"excerpts": ["They were every time late and confused with my orders: they brought another pizza, they forgot about beer, when I asked about 2 dishes they brought 1, and portion of panzerotti was smallest than usual - 3 instead of 4. ", "Also when I asked to call manager server Roberto said he just left, also this Roberto was absolutely not friendly, rude and said he would call police cause we didn't want to pay for beer we didn't order. ", "And at the end he even allowed himself to swear!! ", "Is it what you called \"great\" service?! \n", "Will never come back here! ", "And don't recommend."], "author": "Max F.", "review": "This is not bad Italian cousin restaurant but today when I went here with my wife I got the most terrible service ever from servers in my life. This guys were like a stupid asshole. They were every time late and confused with my orders: they brought another pizza, they forgot about beer, when I asked about 2 dishes they brought 1, and portion of panzerotti was smallest than usual - 3 instead of 4. Also when I asked to call manager server Roberto said he just left, also this Roberto was absolutely not friendly, rude and said he would call police cause we didn't want to pay for beer we didn't order. And at the end he even allowed himself to swear!! Is it what you called \"great\" service?! \nWill never come back here! And don't recommend.", "rating": 1, "date": "2016-09-18"}], "suppli alla romana": [], "family style antipasti": [], "insalata della casa": [], "insalata dellimperatore": [], "insalata del re": [], "insalata regina": [], "insalata pummaro": [], "insalata di spinaci": [{"excerpts": ["Insalata di Spinaci was great, big portion and yummy but a bit too lemony. \n\n"], "author": "Alex B.", "review": "Prons: very cozy restaurant with cool interior. \nCons: However food did not meet my and my wife's expectation. \n\nInsalata di Spinaci was great, big portion and yummy but a bit too lemony. \n\nChicken Marsala was a bit too bitter. Chicken itself was good but could be a bit softer. \n\nRisotto was ok but rice slightly undercooked. \nSeems like both dishes lacked salt (maybe good, because salt can always be added) but there was no twist or kick or something exciting about them. \n\nThe red Cabernet Sauvignon ordered by glass was not enjoyable, tasted cheap. \n\nMy wife liked Tiramisu, I thought it was OK.\n\nVerdict: maybe we ordered wrong dishes at the place. It was ok but certainly not the experience that would want me to come back and have more.", "rating": 3, "date": "2018-08-15"}], "tortellini in brodo tricolore soup": [], "salsiccia": [{"excerpts": ["Ordered the Spaghetti Salsiccia. ", "Sausage was perfectly seasoned and served with plenty of sauce. ", "Stayed warm the entire meal. ", "Wonderful atmosphere and quick service. ", "Molto bene!"], "author": "Mary N.", "review": "Antipasti plate was unbelievable! Ordered the Spaghetti Salsiccia. Sausage was perfectly seasoned and served with plenty of sauce. Stayed warm the entire meal. Wonderful atmosphere and quick service. Molto bene!", "rating": 5, "date": "2016-03-14"}, {"excerpts": ["For dinner we shared the Rigatoni con Salsiccia Carciofi (14.95) -in garlic olive oil with sausage and artichokes. ", "It was really, really good. ", "We loved the Italian wait staff, the decor of the restaurant was fun, and it was our first dinner in North Beach. ", "I love that whole area. ", "San Francisco is an awesome city!"], "author": "tracy d.", "review": "We loved this place. We liked the cheezy decor. We got Ciante in the straw basket even - $28 - good wine though. For an appetizer, we got the Italian Sampler  (14.95)- with Brushcetta, tomatoes caprese, roasted garlic. It was very good. For dinner we shared the Rigatoni con Salsiccia Carciofi (14.95) -in garlic olive oil with sausage and artichokes. It was really, really good. We loved the Italian wait staff, the decor of the restaurant was fun, and it was our first dinner in North Beach. I love that whole area. San Francisco is an awesome city!", "rating": 5, "date": "2007-10-18"}], "polpette": [{"excerpts": ["My \"Spaghetti Polpette \" lacked sauce. ", "The spaghetti itself was not cooked al dente as requested. "], "author": "Jim G.", "review": "Very rarely will I give anything lower than 3 stars unless I was completely dissatisfied with the whole experience. Aside from the lovely hostess with curly hair and glasses ( didn't catch your name, but keep up the wonderful job) my experience here may be my last. \n\n- It's a disgusting feeling when you do not feel welcomed to a restaurant or anywhere for that matter. I ate here with my younger brother and felt that our waiter prioritized certain tables over ours. Haven been a waiter, I understand different signs customers give me in order to accommodate their wants and needs. That being said, we closed our menus since we already decided on what to get. Our waiter passed us several times and clearly saw that we were ready, but still insisted on not acknowledging us. Finally, he took our orders. Losing my appetite already, but hey, hopefully the food compensates for his lack of friendly service.\n\n- Food comes out and it looks semi-pleasing. My \"Spaghetti Polpette \" lacked sauce. The spaghetti itself was not cooked al dente as requested. My brother's pasta, \"Spaghetti allo Scoglio\" was appetizing, I give them that. \n\n- I took a couple bites and was not pleased, so I was waiting for my waiter to check up on us. He went to our table and asked us how the food was (kind gesture) but as I was speaking, he walks away to attend to another table, that did not even flag him down. Such a rude move. He comes back after attending to the table next to mine, and says, \" you wanted more sauce?\" \"Yes, please\".\n\n- I was presented with more sauce in a timely manner. Sauce wasn't flavorful, but I really didn't want to be that \"one guy\" so decided to let it go. Did not end up packing our leftovers (which I usually do). \n\nIt could have been an off day for them. Our waiter could have been having a bad day. But regardless of the fact, servitude, friendliness, and tastiness is always key, and Mona Lisa did not reach my expectations. Would I give this place another try? Yeah, I would, but would definitely try something else and request another server.", "rating": 2, "date": "2014-08-03"}, {"excerpts": ["The menu is HUGE, tough to choose, but my favs are: the spagetti polpette (and it is theonly spagetti and meatballs worth eating in the area); chicken piccata - out of this world; the ravioli are all made each day - cannot be beat; the risotta is creamy and delicious. \n\n"], "author": "Laura G.", "review": "this is the best restaurant in San Francisco's little Italy neighborhood. I am a local to the city and have eaten at every restaurant in North Beach. The menu is HUGE, tough to choose, but my favs are: the spagetti polpette (and it is theonly spagetti and meatballs worth eating in the area); chicken piccata - out of this world; the ravioli are all made each day - cannot be beat; the risotta is creamy and delicious. \n\nThe wine list is great and as a tradional 'mom&pop' restaurant, it doesn't serve liqour which to some is a downside, but then, wine is traditional for Italy! \n\nMauricio, the owner, makes sure you are happy. As a frequent guest to his restaurant, I get a compliementary appetizer or glass of wine each time I eat there or bring a guest with me. I have only had one bad meal in the seven years I have been going to this restaurant and the waiter warned me it wasn't that great and I ordered it anyway. The menu has grown and changed over the years and the prices have gone up, but in comparision to other restaurants in North Beach, you get the best meal for your money! I could eat there every night!", "rating": 5, "date": "2010-05-13"}, {"excerpts": ["The \"side\" of meatballs was actually from the Spaghetti Polpette (without the spaghetti)- ", "so I was charged for a half order of spaghetti polpette... not a huge deal.  ", "The meatballs had good flavor, and  the marinara they came with was nondescript, but good nonetheless.   ", "All in all, an enjoyable meal.  ", "The bread was forgettable, but that seems to be a common theme for all places along Columbus Street.   ", "Service was good as well.  ", "No complaints.  ", "Good Italian, but didn't send me over the moon.  ", "Decently priced.  ", "Quaint, tho slightly kitchy decor.  ", "I decided to forgo dessert, as I've had far too much BAD tiramsu at several places along Columbus St. to go down that road again.  ", "Good, consistant Italian food.  ", "Will return again.", "so I was charged for a half order of spaghetti polpette... not a huge deal.  ", "The meatballs had good flavor, and  the marinara they came with was nondescript, but good nonetheless.   ", "All in all, an enjoyable meal.  ", "The bread was forgettable, but that seems to be a common theme for all places along Columbus Street.   ", "Service was good as well.  ", "No complaints.  ", "Good Italian, but didn't send me over the moon.  ", "Decently priced.  ", "Quaint, tho slightly kitchy decor.  ", "I decided to forgo dessert, as I've had far too much BAD tiramsu at several places along Columbus St. to go down that road again.  ", "Good, consistant Italian food.  ", "Will return again."], "author": "R S.", "review": "supped at Mona Lisa this past Sunday.  No wait, got right in.  Was dining alone, so was seated at a small table shoved up against the counter.  A little crowded, but no big deal.  Have dined at Mona Lisa usually once each time I'm in San Francisco (about once a year).\n\nOrdered the tortellini in 4-cheese cream sauce, which was VERY,  VERY rich and, as another reviewer put it, \"quite pungent\".  I couldn't finish it.  Luckily, I had ordered a side of meatballs, which helped cut the richness somewhat.  The \"side\" of meatballs was actually from the Spaghetti Polpette (without the spaghetti)- so I was charged for a half order of spaghetti polpette... not a huge deal.  The meatballs had good flavor, and  the marinara they came with was nondescript, but good nonetheless.   All in all, an enjoyable meal.  The bread was forgettable, but that seems to be a common theme for all places along Columbus Street.   Service was good as well.  No complaints.  Good Italian, but didn't send me over the moon.  Decently priced.  Quaint, tho slightly kitchy decor.  I decided to forgo dessert, as I've had far too much BAD tiramsu at several places along Columbus St. to go down that road again.  Good, consistant Italian food.  Will return again.", "rating": 3, "date": "2008-10-08"}], "linguini al nero di seppie": [], "penne san francisco": [{"excerpts": ["Across the entire menu the food is excellent - Cacai de Pepe, meatballs, arancini, manicotti, fettuccini Pescatore, and penne San Francisco are our favorites - but honestly everything we try becomes a favorite.  ", "Service is great - they'll always find you a table and treat you like a VIP.  ", "The Italian wine list is fairly priced as restaurants go, but the House wines are fine."], "author": "Lance A.", "review": "First - we live here is SF, and originally from NJ - we know and love Italian. Mona Lisa is our favorite in North Beach - it's our weekly Sunday dinner spot. Across the entire menu the food is excellent - Cacai de Pepe, meatballs, arancini, manicotti, fettuccini Pescatore, and penne San Francisco are our favorites - but honestly everything we try becomes a favorite.  Service is great - they'll always find you a table and treat you like a VIP.  The Italian wine list is fairly priced as restaurants go, but the House wines are fine.", "rating": 5, "date": "2018-07-15"}, {"excerpts": ["I had the Penne San Francisco (crab, penne, asparagus in tomato cream sauce) and ", "it was quite tasty! ", "The steak with porcini mushrooms was great. ", "My wife loved her pasta dish. ", "The deserts were amazing. ", "We had cannoli which had dark chocolate, and some orange peel in it with the whip cream and the cheese filling. ", "Sooo good. ", "The peach sorbet was unbelievable and I don't even care for peach (my cuz said the same). ", "The tiramisu was great, too. ", "Our server was very friendly and accommodating. ", "We had a very good experience overall and would go back. ", "We had 1 salad, 1 appetizer, 4 entrees, 3 desserts, and 3 coffees. ", "Bill was around $160 for all this for 4 people so...less than 200 for 4 people having a quality meal. "], "author": "McKay G.", "review": "We took our cousins here who were visiting from out of town. Mona Lisa has a large menu of dishes which can be a worry at some places, meaning that you may get more options than quality. No worries there for our experience. The dishes were exceptional. I had the Penne San Francisco (crab, penne, asparagus in tomato cream sauce) and it was quite tasty! The steak with porcini mushrooms was great. My wife loved her pasta dish. The deserts were amazing. We had cannoli which had dark chocolate, and some orange peel in it with the whip cream and the cheese filling. Sooo good. The peach sorbet was unbelievable and I don't even care for peach (my cuz said the same). The tiramisu was great, too. Our server was very friendly and accommodating. We had a very good experience overall and would go back. We had 1 salad, 1 appetizer, 4 entrees, 3 desserts, and 3 coffees. Bill was around $160 for all this for 4 people so...less than 200 for 4 people having a quality meal. Nice.\n\nUpdate: Went back a second time and two of three dishes were craaaaazy salty. Maybe it was just bad night or a sign of hit and miss. Hopefully just a farce because the first visit was excellent.", "rating": 4, "date": "2010-04-02"}, {"excerpts": ["I ordered the penne san francisco (tomoato cream sauce with asparagus and crab) "], "author": "toni b.", "review": "Mona Lisa is FANTASTIC!!! I took my parents here when they came into town for the day, and I made reservations for 6. When we got there we were the first ones, the chef presented us a complimentary platter overflowing of delicious prosciutto, salame, cheeses, tomatoes caprese! We ordered the calamari as an appetizer and it was as fresh as it gets. good dipping sauce too. I ordered the penne san francisco (tomoato cream sauce with asparagus and crab) and my boyfriend ordered the risotto allo scoglio (white wine sauce with clams, calamari, prawns and  mussles). we were so full! my parents had spaghetti al salmone and the chicken san francisco. great wine selection, attentive service (not too pushy, but know when you need a refill or the dessert menu!). I HIGHLY RECOMMEND THIS PLACE! GREAT SERVICE, GREAT FOOD, GREAT AMBIANCE, and parking is less than a block away in the structure by the police department. I'll definitely be going again :)", "rating": 5, "date": "2011-07-01"}], "spaghetti allo scoglio": [{"excerpts": ["My brother's pasta, \"Spaghetti allo Scoglio\" was appetizing, I give them that. \n\n"], "author": "Jim G.", "review": "Very rarely will I give anything lower than 3 stars unless I was completely dissatisfied with the whole experience. Aside from the lovely hostess with curly hair and glasses ( didn't catch your name, but keep up the wonderful job) my experience here may be my last. \n\n- It's a disgusting feeling when you do not feel welcomed to a restaurant or anywhere for that matter. I ate here with my younger brother and felt that our waiter prioritized certain tables over ours. Haven been a waiter, I understand different signs customers give me in order to accommodate their wants and needs. That being said, we closed our menus since we already decided on what to get. Our waiter passed us several times and clearly saw that we were ready, but still insisted on not acknowledging us. Finally, he took our orders. Losing my appetite already, but hey, hopefully the food compensates for his lack of friendly service.\n\n- Food comes out and it looks semi-pleasing. My \"Spaghetti Polpette \" lacked sauce. The spaghetti itself was not cooked al dente as requested. My brother's pasta, \"Spaghetti allo Scoglio\" was appetizing, I give them that. \n\n- I took a couple bites and was not pleased, so I was waiting for my waiter to check up on us. He went to our table and asked us how the food was (kind gesture) but as I was speaking, he walks away to attend to another table, that did not even flag him down. Such a rude move. He comes back after attending to the table next to mine, and says, \" you wanted more sauce?\" \"Yes, please\".\n\n- I was presented with more sauce in a timely manner. Sauce wasn't flavorful, but I really didn't want to be that \"one guy\" so decided to let it go. Did not end up packing our leftovers (which I usually do). \n\nIt could have been an off day for them. Our waiter could have been having a bad day. But regardless of the fact, servitude, friendliness, and tastiness is always key, and Mona Lisa did not reach my expectations. Would I give this place another try? Yeah, I would, but would definitely try something else and request another server.", "rating": 2, "date": "2014-08-03"}, {"excerpts": ["I had the Spaghetti allo Scoglio - 19.95 with white wine sauce with shrimps, clams, mussels and calamari and he had the Fettuccine alla ", "Pescatore - 19.95 with\ntomato sauce, prawns, calamari, mussels, clams calamari tentacles and garlic.  "], "author": "Lisa G.", "review": "Such a beautiful restaurant for our anniversary dinner!  My boyfriend got lots of points for bringing me here as a surprise.  \n\nWe were seated in the back of the restaurant where it was quieter and more intimate.  Our server was extremely knowledgeable as he had worked there many years.  He knew exactly what to recommend for the perfect wine pairing with our meal and when the first glass didn't suit, he promptly and gladly made a second recommendation which suited us more.  \n\nI had the Spaghetti allo Scoglio - 19.95 with white wine sauce with shrimps, clams, mussels and calamari and he had the Fettuccine alla Pescatore - 19.95 with\ntomato sauce, prawns, calamari, mussels, clams calamari tentacles and garlic.  Both of us were very pleased with our meal, the service, the romantic atmosphere and the entire experience.  \n\nI look forward to coming back to this restaurant for another lovely and memorable evening.", "rating": 5, "date": "2014-02-11"}, {"excerpts": ["The photo with the Spaghetti allo Scoglio and ", "also sometimes I have pasta only with Calamari with double the tentacles and I usually joke that there is more seafood than pasta. ", "These dishes are better than many times I have had in Italia. ", "Mauricio is  very generous as he sometimes ", "and we are only 2 people, gives us on the house a of tower of antipasti, salmon(lox), fried calamari, mortadella, capicola, prosciutto, formaggi, olive, bruschetta etc. ", "I tell him joking that we are so full to \" take home the entrees\" !!! ", "So now I tell him he does not need give us anything ", "but as he is a \"Capa Tosta\"---I can get away with saying this as I am half Calabrese/half Pugliese--instead of the Torre Calabrese ", "Spaghetti allo Scoglio e anche a volte ho pasta solo con ", "Calamari con doppia ", "i tentacoli e ho solito scherzo che ", "c'è più pesce che pasta. ", "Questi piatti sono meglio di ", "molte ", "volte quanto ho avuto in Italia.   ", "Mauricio è molto generoso come lui a volte e siamo solo 2 persone, ci dà sulla casa una torre di antipasti, salmon(lox), calamari fritti, mortadella, capicola, prosciutto, formaggi, olive, bruschette ecc. ", "Li dico scherzando che siamo così pieni di \" dar portare a casa l'entrées\"!!! ", "Così ora io ", "gli dico che ", "non ha bisogno darci nulla, ma come lui è una ", "\"Capa Tosta\"----posso farla franca con ", "questo dicendo come io ", "sono metà ", "Calabrese/mezza Pugliese ", "-- anziché il Torre Calabrese solo una Barchetta come la ", "piccola barca nella "], "author": "Mando R.", "review": "We live across the Golden Gate so do not come into San Francisco often as with traffic it is 1 1/2 hours or so but when we do and we want authentic southern Italian Food as the paternal side of my family is from Calabria, we come to this ristorante. Mauricio treats us, and all customers, as family.  The photo with the Spaghetti allo Scoglio and also sometimes I have pasta only with Calamari with double the tentacles and I usually joke that there is more seafood than pasta. These dishes are better than many times I have had in Italia. Mauricio is  very generous as he sometimes and we are only 2 people, gives us on the house a of tower of antipasti, salmon(lox), fried calamari, mortadella, capicola, prosciutto, formaggi, olive, bruschetta etc. I tell him joking that we are so full to \" take home the entrees\" !!! So now I tell him he does not need give us anything but as he is a \"Capa Tosta\"---I can get away with saying this as I am half Calabrese/half Pugliese--instead of the Torre Calabrese only una Barchetta like the small boat in the Neapolitan song 'Santa Lucia\".\n\nWhen I am here I can close my eyes, Italian music in the background, Italian being spoken by waiters & the beautiful different plates of delicious Italian food being taken to the tables of customers make me feel like I am in Italia. The smiles on their faces indicates they love the food.\n\n=============================================================\nPer i turisti italiani nostalgici per l'Italia, all'interno con Mauricio, camerieri italiani, il cibo e l'ambiente, vi sentirete come se foste in Italia\n\nViviamo attraverso il Golden Gate, così non veniamo in San Francisco spesso come con traffico è 1 1/2 ore o giù di lì, ma quando lo facciamo e vogliamo autentico cibo italiano del sud come il lato paterno della mia famiglia dalla Calabria, arriviamo a questo ristorante. Mauricio tratta noi e tutti i clienti, come famiglia. La foto con Spaghetti allo Scoglio e anche a volte ho pasta solo con Calamari con doppia i tentacoli e ho solito scherzo che c'è più pesce che pasta. Questi piatti sono meglio di molte volte quanto ho avuto in Italia.   Mauricio è molto generoso come lui a volte e siamo solo 2 persone, ci dà sulla casa una torre di antipasti, salmon(lox), calamari fritti, mortadella, capicola, prosciutto, formaggi, olive, bruschette ecc. Li dico scherzando che siamo così pieni di \" dar portare a casa l'entrées\"!!! Così ora io gli dico che non ha bisogno darci nulla, ma come lui è una \"Capa Tosta\"----posso farla franca con questo dicendo come io sono metà Calabrese/mezza Pugliese -- anziché il Torre Calabrese solo una Barchetta come la piccola barca nella canzone napoletana ' Santa Lucia \".\n\nQuando sono qui posso chiudere mio occhi, sottofondo musicale italiana, italiano, essendo parlata da camerieri & belle diverse tavole di delizioso cibo italiano prese ai tavoli di clienti mi fanno sentire come se fossi in Italia. Il sorriso sui loro volti indica che amano il cibo.", "rating": 5, "date": "2014-10-30"}, {"excerpts": ["Spaghetti allo Scoglio--White wine sauce with shrimp, clams, mussels, and calamari were delicately tossed with perfectly cooked pasta.  "], "author": "Rob L.", "review": "TOURISTY ITALIAN EATERY WITH SURPRISINGLY GOOD FOOD\n\nThere was a long line outside the door so we were hesitant to ask how long the wait would be.  The host told us it would be just a few minutes so we decided to wait.  In no time, we were led into a stuffy, crowded dining room to a cozy table.  The menu had so many choices that it was hard to decide.  I thought the prices were a little steep but we were in North Beach.  We decided on the following:\n\nSicilian Candy--We started with a big bowl of roasted garlic that tasted delicious on the bread.\n\nAntipasto Misto--A platter of prosciutto, salami, soppresata, olives, and assorted cheeses arrived at the table.\n\nSpaghetti allo Scoglio--White wine sauce with shrimp, clams, mussels, and calamari were delicately tossed with perfectly cooked pasta.  I love it when the pasta is cooked al dente.\n\nLinguini allo Squalo--L ordered the linguini with a rich tomato sauce of swordfish, salmon, shrimp, mussels, and clams.  He said the seafood tasted fresh and I totally agree.\n\nThe waiter was very entertaining and was always right there if we need more water or wine.  We were hesitant about trying this place because it seemed so touristy but we were pleasantly surprised by the friendly service and the quality of the food.", "rating": 3, "date": "2010-12-26"}, {"excerpts": ["Food was yummy (fettucine pescatore and spaghetti allo scoglio) and my friend said she'd come back for it, but I wasn't too impressed. ", "Regular day-old french bread basket. ", "I kept having that crunchy feeling when I ate my fettucine with mussels and clams. \n", "Service was rushed and not too attentive, bunch of Italian waiters running back and forth. ", "Restaurant is crowded and waiter knocked over my water glass, wetting the table as he scurried by. ", "\"", "Just testing your reflexes!", "\" ", "Um... ok. ", "He left before I could ask for at least another napkin to wipe this water off. ", "A plus: dirty plates were promptly removed from our small table. ", "Waiter brought the check and barely asked if we needed anything else. \n", "I don't like eating places where I don't feel like a valued customer. ", "I can take my business elsewhere =", "P."], "author": "Christine Y.", "review": "I know 2 stars seems harsh, but it was a \"Meh. I've experienced better\" sort of dining experience. \nWalked in about 7:30 on Thursday night and waited about 10 minutes to be seated. We ordered and didn't eat until almost an hour later. It was a busy time and there was a birthday party so it's understandable but... we were hungry! \nFood was yummy (fettucine pescatore and spaghetti allo scoglio) and my friend said she'd come back for it, but I wasn't too impressed. Regular day-old french bread basket. I kept having that crunchy feeling when I ate my fettucine with mussels and clams. \nService was rushed and not too attentive, bunch of Italian waiters running back and forth. Restaurant is crowded and waiter knocked over my water glass, wetting the table as he scurried by. \"Just testing your reflexes!\" Um... ok. He left before I could ask for at least another napkin to wipe this water off. A plus: dirty plates were promptly removed from our small table. Waiter brought the check and barely asked if we needed anything else. \nI don't like eating places where I don't feel like a valued customer. I can take my business elsewhere =P.", "rating": 2, "date": "2010-07-29"}, {"excerpts": ["I had the Spaghetti allo Scoglio. ", "I liked the mussels in it, but that was pretty much it. ", "My boyfriend had the Lobster Ravioli that was pretty tasty. ", "Dessert was the Chocolate Truffle. ", "It was yummy but nothing that went ", "\"Damn, I gotta get more of that!\" not even a ", "\"I gotta come back next time for it\" . ", "Total for our bill was about $63. ", "The decorations was nice. ", "Service wasn't bad. ", "I probably wouldn't come back here again."], "author": "Audrey M.", "review": "A mediocre place. A little bit too cramped for my taste. Had hardly any room for walking. The menu is very extensive, good or bad? you decide. Lets see....me and my boyfriend started off with the Fritti Misto (fried Calamari and prawns with marinara sauce) which was tasty. I had the Spaghetti allo Scoglio. I liked the mussels in it, but that was pretty much it. My boyfriend had the Lobster Ravioli that was pretty tasty. Dessert was the Chocolate Truffle. It was yummy but nothing that went \"Damn, I gotta get more of that!\" not even a \"I gotta come back next time for it\" . Total for our bill was about $63. The decorations was nice. Service wasn't bad. I probably wouldn't come back here again.", "rating": 3, "date": "2008-12-20"}], "spaghetti alle vongole": [{"excerpts": ["I had the Ravioli Granchio (crab ravioli), and she had the Spaghetti alle Vongole (spaghetti with clams). ", "Both were excellent. ", "The prices were pretty standard, and the service was good."], "author": "Carl R.", "review": "I'd give 4.5 stars if I could, because the food was very good, but not mind-blowing, so I'll have to round down. I'd definitely go back here again, though. It was a hot day over the weekend, and my gf and I were wandering around looking for some Italian food for lunch with outdoor seating. We saw an empty table on the sidewalk at the Mona Lisa and grabbed it. \n\nI had the Ravioli Granchio (crab ravioli), and she had the Spaghetti alle Vongole (spaghetti with clams). Both were excellent. The prices were pretty standard, and the service was good.", "rating": 4, "date": "2010-09-29"}, {"excerpts": ["He ordered Spaghetti alle Vongole (white wine sauce, clams and garlic) as I had the  Rigatoni Osilio (chicken basil in pesto sauce). ", "The Spaghetti alle Vongole was a bland white wine sauce, lacked garlic and any sort of flavor with clams thrown in. ", "As my Rigatoni Osilio, was an extremely small portion, where they used large rigatoni pasta that was dry, topped with clumps of pesto. ", "People are usually put in a situation where they want less olive oil, but in this case, I wanted more. ", "The bread provided tasted stale and we wondered, what more could go wrong from this place. ", "As we already started eating our dishes, the server then comes back asking if we wanted parmesan cheese. ", "We both agreed that it would probably add a little something to our dishes. ", "He spooned a large amount and started to put it on my dish. ", "When I told him that, that was enough, he plopped the entire spoonful in my plate, no longer being able to see my rigatoni noodles because there was that little of it. "], "author": "Ada T.", "review": "You know how Mona Lisa's smile is very half-assed? Well, that's the best portrayal I have for Mona Lisa Restaurant. We (boyfriend and I) decided to go here based off of yelp reviews to see why some people rated it poorly and some outstandingly. Unfortunately, I am going to side with those who give it 1 star or 0, if possible.\n\nWe  walked in on a Wednesday night, made reservations, as very few people were there at about 6:30pm. We weren't greeted by our server and felt a bit rushed as he stood there waiting for us to order, after requesting a few minutes. The extra time was necessary, considering their menu was so long. We ordered the Calamari Fritti, to start us off, which is basically calamari with marinara. It was okay, only the top parts of the squid cut in ring-like shapes, no tentacles. From the impression of our appetizer, we thought it would've been an okay dinner.\n\nWe finally ordered and got our food with not too long of a wait. He ordered Spaghetti alle Vongole (white wine sauce, clams and garlic) as I had the  Rigatoni Osilio (chicken basil in pesto sauce). The Spaghetti alle Vongole was a bland white wine sauce, lacked garlic and any sort of flavor with clams thrown in. As my Rigatoni Osilio, was an extremely small portion, where they used large rigatoni pasta that was dry, topped with clumps of pesto. People are usually put in a situation where they want less olive oil, but in this case, I wanted more. The bread provided tasted stale and we wondered, what more could go wrong from this place. As we already started eating our dishes, the server then comes back asking if we wanted parmesan cheese. We both agreed that it would probably add a little something to our dishes. He spooned a large amount and started to put it on my dish. When I told him that, that was enough, he plopped the entire spoonful in my plate, no longer being able to see my rigatoni noodles because there was that little of it. The boyfriend's clams ate all the cheese, as the server plopped it off to the side.\n\nHe was also very rude, was never attentive of what we wanted and was into chatting it up with his fellow servers. If you're a tourist and you want a true North Beach experience, don't come here to be disappointed and be given the wrong impression. Also, if you don't like searching for parking for a good amount of time, valet your car.\n\nWill not be revisiting this place. Extremely disappointed.", "rating": 1, "date": "2009-12-31"}], "fettuccine ai gamberoni": [], "fettuccine ai frutti di mare": [], "rigatoni salmone affumicato e monti": [], "ravioli aragosta": [{"excerpts": ["Ravioli Aragosta - 16.95 - Lobster in tomato cream sauce. ", "Two in my party ordered this and I had a couple bites. "], "author": "Cara S.", "review": "After spending lots of time Yelping for the perfect Italian restaurant to take friends the night before our wedding, I decided to wait until I made the trip from Houston. \n\nOur hotel turned out to be walking distance, a mile or so away from Mona Lisa, so on many walks about town we passed the place. I was worried because it looked small and we were going to have seven people. When a gentleman from the restaurant approached me outside one day, I asked if that was OK and if we could make a reservation. He said it would not be a problem, and gave me his business card. The next day I called and made the reservation. I ended up having to change it to eight people, and they were still able to accommodate us. \n\nThe pace of the meal was great; the service was adequate but not above and beyond; but the food? Absolutely amazing! I have been home for a few days and I'm still thinking about it! I will definitely go back next time I visit San Francisco. \n\nHere's a list of some things my party ordered, and I will also post pics:\n\nAppetizers:\nCalamari Fritti - 13.95\nTomatoes Caprese - 12.95\n\nDinners:\nTortellini al Gongorzola - 13.95 - My vegetarian friend ordered this, although there are lots of vegetarian options. I went with the gnocchi but this one tasted great too! Everyone wanted to taste everything so there was a lot of sharing taking place. \nGnocchi Ruggero - 16.95 - I had this. It was gnocchi with gorgonzola cheese sauce, walnuts and spinach -- HEAVEN! \nGnocchi Fondenti - 14.95 - Baked four cheese-cream sauce with nutmeg. For some reason the baked dish seemed to come in a smaller portion. My friend had asked about sharing this with her husband, and the waiter rightly recommended against it. However, my portion for the Ruggero was definitely enough to have been shared. \nRavioli Aragosta - 16.95 - Lobster in tomato cream sauce. Two in my party ordered this and I had a couple bites. It was also fantastic. \n\nWe skipped dessert because we were off to Ghirardelli for ice cream, which I'll probably Yelp next. Definitely try the gnocchi or ravioli if you go -- Mona Lisa does it right!\n\nWhy not five stars? The place only has beer and wine, and for beer Peroni hardly counts. Sorry. I did have an Anchor Steam, though. Can't go wrong with that. I did wish they had some fancy pre-dinner mixed drinks or martinis, though. Also, the waiter said it would be a $3 refill for sodas. I don't know if we were not charged after all because my party really wasn't happy with that and they might've overheard, but yeah, that's just kind of ridiculous if that rule is actually enforced.  Lucky for us, it wasn't. \n\nTo address some other minor complaints from fellow Yelpers, I found the decor cheesy yet entertaining. It made the place fun. As for the space issue it's San Francisco. Every restaurant I've been to there has tables close together you just sort of have to deal; at least they took our reservation and hooked us up with a nice long table in the back.\n\nThe Verdict: Just thinking about that gnocchi makes my mouth water. I can't wait to go back.", "rating": 4, "date": "2010-04-28"}, {"excerpts": ["I personally love the Insata de Mare, seafood salad and the Ravioli Aragosta (lobster ravioli):)"], "author": "Heidi D.", "review": "Mona Lisa is to me what Alioto's was to my mom.  Whenever I'm back home, I come here, I take friends there and I recommend it to everyone that loves authentic Italian food. The servers are so nice and Italian and the decor is also authentic.  As for the food, everything is good.  I personally love the Insata de Mare, seafood salad and the Ravioli Aragosta (lobster ravioli):)", "rating": 5, "date": "2012-12-30"}], "gnocchi mare e monti": [], "rigatoni al pesce spada": [], "spaghetti al salmone": [{"excerpts": ["my parents had spaghetti al salmone and the chicken san francisco. ", "great wine selection, attentive service (not too pushy, but know when you need a refill or the dessert menu!). ", "I HIGHLY RECOMMEND ", "THIS PLACE! ", "GREAT SERVICE, GREAT FOOD, GREAT AMBIANCE, and parking is less than a block away in the structure by the police department. ", "I'll definitely be going again :)"], "author": "toni b.", "review": "Mona Lisa is FANTASTIC!!! I took my parents here when they came into town for the day, and I made reservations for 6. When we got there we were the first ones, the chef presented us a complimentary platter overflowing of delicious prosciutto, salame, cheeses, tomatoes caprese! We ordered the calamari as an appetizer and it was as fresh as it gets. good dipping sauce too. I ordered the penne san francisco (tomoato cream sauce with asparagus and crab) and my boyfriend ordered the risotto allo scoglio (white wine sauce with clams, calamari, prawns and  mussles). we were so full! my parents had spaghetti al salmone and the chicken san francisco. great wine selection, attentive service (not too pushy, but know when you need a refill or the dessert menu!). I HIGHLY RECOMMEND THIS PLACE! GREAT SERVICE, GREAT FOOD, GREAT AMBIANCE, and parking is less than a block away in the structure by the police department. I'll definitely be going again :)", "rating": 5, "date": "2011-07-01"}], "fettucine al salmone con pomodoro": [], "fettuccine pescatore": [{"excerpts": ["My dinner companions had the chicken saltimbocca, risotto allo scoglio,  gnocchi in pink sauce, fettuccine pescatore, and the chicken S. Marino. ", "If there was an award for second best dish at the table it would go to the S. Marino. ", "It is rolled chicken breast with mozzarella and ham in a tomato-cream sauce, incredible flavors & texture. ", "Even though no one at the table needed another bite of food, it wouldn't have been complete without dessert ", "so we shared a platter of tiramisu & bomba. ", "The tiny bite I managed to eat of the bomba was really good. ", "Our waiter was friendly, attentive, patient, and spot on when helping choose menu items. "], "author": "Elizabeth C.", "review": "We started with a couple of sampler platters. From the calamari to the bruschetta, to the prosciutto with melon, everything was scrumptious. There was a great seasoning on the calamari and they don't skimp on the prosciutto. I had the risotto alfredo & prawns. It was so rich it was ridiculous- in a good way. Truly the best risotto I've ever had. My dinner companions had the chicken saltimbocca, risotto allo scoglio,  gnocchi in pink sauce, fettuccine pescatore, and the chicken S. Marino. If there was an award for second best dish at the table it would go to the S. Marino. It is rolled chicken breast with mozzarella and ham in a tomato-cream sauce, incredible flavors & texture. Even though no one at the table needed another bite of food, it wouldn't have been complete without dessert so we shared a platter of tiramisu & bomba. The tiny bite I managed to eat of the bomba was really good. Our waiter was friendly, attentive, patient, and spot on when helping choose menu items. Another thing to mention about Mona Lisa is they have an adorable little car that is parked out front and a party of two can actually enjoy their meal from inside it if they choose. \n\nClick here for the full story & pictures:\nhttp://consumingcolumbus.blogspot.com/2012/12/mona-lisa-will-make-you-moan_29.html", "rating": 5, "date": "2013-01-03"}], "rigatoni salmone affumicato e piselli": [], "penne alla vodka": [{"excerpts": ["Penne alla vodka and their calamari are outstanding. ", "Homemade pasta there too!!! ", "Great service."], "author": "Sarah W.", "review": "My go to place. Penne alla vodka and their calamari are outstanding. Homemade pasta there too!!! Great service.", "rating": 5, "date": "2017-01-16"}], "spaghetti all amatriciana": [], "spaghetti carbonara": [{"excerpts": ["The spaghetti Carbonara was so-so.  ", "It was not a good as other places we had been too.  "], "author": "Gene D.", "review": "I had to take off a star due to the service received the evening we dined there.  More on that later.\n\nThe decor is your classic North Beach fare.  It was stuffed full of decorations, etc.  Some would call it gaudy while others would call it classic/typical of the area.  i would agree with the later.\n\nThe food had its share of hits and misses.  My Chicken Saltimbocca was surprisingly good.  It was simply prepared with roasted potatoes and sauteed spinach.  The chicken was moist while the prosciutto and sage offered delicious contrasts to one another.  The sauce/juice that was present had a good flavor profile to it.  The spaghetti Carbonara was so-so.  It was not a good as other places we had been too.  We couldn't pick out the reason but only knew so by the taste.\n\nRoberto (?) was rude and not very attentive to us.  When he first came over to take our drink orders, everything seemed fine.  After that, things changed for some reason.  The wait to take our orders was extremely long.  In fact, several tables around us, where people arrived after us, had already ordered.  We tried to get his attention several times to no avail.  The menus were closed so that should have been a clue to him to come over.  It took several requests to just get the balsamic vinegar for our bread.  Then, after only having it for a few minutes, he came by and took the vinegar and olive oil, only to give it to a couple at an adjacent table.  Needless to say, both parties were shocked at that move.  The couple was kind enough to give them back to us after they had poured some for themselves.  \n\nWe might come back some time, as long as we do not have him again...", "rating": 2, "date": "2017-07-04"}, {"excerpts": ["My husband ordered Spaghetti Carbonara and while good it just can't top the decadence of the one we had years ago in Rome.\n\n"], "author": "Juanita I.", "review": "After being lured in by the friendly owner while we were perusing the menu on the sidewalk late one Friday night our experience quickly went downhill. \n\nWe were seated at the teeniest table next to the kitchen, right where the servers rounded the corner. They kept bumping my husbands chair and apologizing.\n\nI don't know if not ordering drinks or appetizers affected our service in any way but it was subpar at best. We had had a very late lunch and weren't ravenously hungry. \n\nWe got some crusty bread to munch on as we preceded to wait forever on our food. Our table was also missing the balsamic vinegar that was on other tables and our server never came around so we could ask for it.\n\nAfter waiting a good hour plus on our food it finally arrived. \n\nMy husband ordered Spaghetti Carbonara and while good it just can't top the decadence of the one we had years ago in Rome.\n\nI had been craving a Margarita Pizza so that was what I had ordered and it was delicious!\n\nDuring our time waiting we had plenty of chances to observe those around us and it was quite interesting! The table next to us got the five star treatment as the gentleman knew the owner. Their complimentary three tiered hor dourve tray looked heavenly! The strangest part was when the lady disappeared into the bathroom and a couple of minutes later the gentleman slipped in too. Oh dear! Only for both of them to emerge minutes later. \n\nSo, to recap. The food was good but the service lackluster. I'd skip the Mona Lisa.", "rating": 2, "date": "2018-01-16"}, {"excerpts": ["We also tried the tortellini formaggio (very cheesy) and spaghetti carbonara (pancetta could have been crisper), which both had good flavor."], "author": "Roger N.", "review": "Convenient after Beach Blanket Babylon, the food was solid, if unspectacular.  They sat us near the front door, which never closed, and we were chilly the entire meal.  Might have ranked it 4-star but for that.  Service was so-so, friendly, but we had to ask twice for olive oil. Very Italian atmosphere, which would have been more enjoyable if we weren't cold.\n\nI had chicken parmigiana, which was good, just not as good as what my wife makes.  Roasted potato and spinach sides were excellent.  My son's pepperoni pizza had a really good crust and was cooked well, but it had a bit too much sauce for his preference.  We also tried the tortellini formaggio (very cheesy) and spaghetti carbonara (pancetta could have been crisper), which both had good flavor.", "rating": 3, "date": "2017-06-26"}, {"excerpts": ["Spaghetti carbonara had no flavor except for the burnt pan taste. ", "My fettuccine alfredo tasted like noodles in warmed up watered down non fat milk....seriously!  ", "Calzone appetizers were simply lunch meat ham with a small shaving of cheese wrapped up in a blanket, very bland.  ", "I blame myself for not adhering to its poor yelp ratings. \n", "Go to another Italian restaurant with a better rating."], "author": "Angie R.", "review": "I'm not going to down them for the service, it's busy, crowded, and you feel like cattle being herded in, i could live with that. My complaint is the food! Spaghetti carbonara had no flavor except for the burnt pan taste. My fettuccine alfredo tasted like noodles in warmed up watered down non fat milk....seriously!  Calzone appetizers were simply lunch meat ham with a small shaving of cheese wrapped up in a blanket, very bland.  I blame myself for not adhering to its poor yelp ratings. \nGo to another Italian restaurant with a better rating.", "rating": 1, "date": "2016-10-02"}, {"excerpts": ["Since that first trip, we've ordered more or less the same thing, however I've ventures into some of the pizzas which I've been slightly less impressed with and my wife has ordered the spaghetti carbonara which she likes usually but here was a little less than impressed as it was a little sauce heavy. \n\n"], "author": "Jarred D.", "review": "Our first experience here was phenomenal. It quickly became a family favorite. My wife ordered a pasta with truffles, daughter; fettuccini Alfredo, son; pasta w/ olive oil and I ordered some type of risotto if memory serves correctly. \n\nSince that first trip, we've ordered more or less the same thing, however I've ventures into some of the pizzas which I've been slightly less impressed with and my wife has ordered the spaghetti carbonara which she likes usually but here was a little less than impressed as it was a little sauce heavy. \n\nHaving said all that, service is consistently great. Greeters and servers are friendly, warm and helpful. We will likely be back again, but we will most likely stick with offerings we've already enjoyed there.", "rating": 3, "date": "2016-02-25"}, {"excerpts": ["Had the spaghetti carbonara - pancetta, eggs and cheese for $13.95.  ", "The portion size was acceptable; not large, not small either...", "but this dish was just unappetizing.  ", "The pancetta bits tasted so salty and the pasta itself lacked any flavor.  ", "My whole plate of pasta was sauceless and yet was really greasy.  "], "author": "Veronica C.", "review": "Came to Mona Lisa on Saturday to meet up with my friends.  Unlike other Italian restaurants in and around the block, this place had very little wait.  The decor was really nice but the seating was very cramped.\n\nHad the spaghetti carbonara - pancetta, eggs and cheese for $13.95.  The portion size was acceptable; not large, not small either...but this dish was just unappetizing.  The pancetta bits tasted so salty and the pasta itself lacked any flavor.  My whole plate of pasta was sauceless and yet was really greasy.  I felt gross eating it after a few bites :(\n\nExtremely slow service and not the most friendly either.  Our food came out 1.5 hrs after ordering, so we filled ourselves up with complimentary bread as we waited.  If you are in a hurry, this might not be the best place to go (we spent over 3 hours total for dinner!).", "rating": 2, "date": "2014-08-06"}, {"excerpts": ["The Spaghetti Carbonara (pancetta, eggs and cheese) was awesome. "], "author": "Dom L.", "review": "After reading some many yelp reviews, felt confident that this was going to be a pleasant experience. And it was. Overall the evening was a hit with my party of 7, with just a few minor negative points. After I polled my party, their grades ranged from B to B+, which totally agreed with.\n\nReservations at 8pm, got there a few minutes before and was immediately seated. Bread and water was quickly brought. Dinner napkins were placed in our laps. \n\nStarted with their Italian sampler. It had bruschetta, tomatoes caprese and roasted garlic. Everything was done fine, with fresh ingredients. We also had the fried calamari which was ok. Nicely fried although not much flavor, but it was ok. Soon afterward the manager/host decided to send a complimentary appetizer tray our way. Whatever the reasons - whether just being nice or it was a kitchen mistake that he wanted to give to us, I really appreciated the gesture, and it earned some major brownie points with me. The appetizer plate had some more bruschetta, some olives, some parm-reg cheese, and some prosciutto. I enjoyed the prosciutto and the rest, although the extra food really filled me up and left less room for the main courses!\n\nI ordered 5 entrees to share so we could all get a taste of more items.\n\nThe Spaghetti Carbonara (pancetta, eggs and cheese) was awesome. Perfectly cooked, creamy with a nutty/salty from the pancetta.\n\nThe Gnocchi Pomodoro (tomato sauce and basil) was my (and everyone else's) least favorite dish. Granted, I'm not a big gnocchi fan, but the times I've had very good gnocchi it was light and puffy. Here is was a bit doughy. But I'm the first to admit that gnocchi is not my favorite, so you might try it yourself and like it.\n    \nThe risotto porcini (mushroom) was creamy and delicious. Just the right amount of flavor from the broth. It was good, very good.\n\nThe chicken piccata was also pretty good. The chicken was moist and tender, and the potatoes and spinach on the side had very good flavor. My wife finished all the spinach and loved it. \n\nThe pizza Napoletana (basic with cheese/tomato/oregano/garlic) was done very well. Good crust and good flavor.\n \nService was friendly and efficient, especially the host. Waiter helped exchange plates, refilled water and was generally very effective. Only a few missteps:\nThe appetizers came in a quick manner, but the rest of the meal took a bit longer. Not 'look at watch several times and frown' long, but 'look at my watch and wondering' long. Also it took a long time to get my bill. I think they use an old, old credit card machine. Bread was served cold. A bit pricey. Yes a few minor gripes, but overall their ambiance, service and food will make me visit again.", "rating": 4, "date": "2010-07-23"}, {"excerpts": ["The spaghetti carbonara was just ok, mainly because the sauce didn't have the  rich cream base that the salty ham is supposed to balance out. \n\n"], "author": "Tom L.", "review": "Cheesy Italian decor instantly makes me uneasy. Thankfully the food was decent, not the disaster I expected after looking up at the faux Sistine Chapel ceiling. \n\nThe white wine seafood risotto lacked the bold flavors I've grown to love and expect. The spaghetti carbonara was just ok, mainly because the sauce didn't have the  rich cream base that the salty ham is supposed to balance out. \n\nOverall a decent Italian restaurant in North Beach, but not the type of place that gives me flashbacks of living in Rome. If you are looking for a good North Beach date spot, look elsewhere.", "rating": 3, "date": "2011-12-06"}, {"excerpts": ["We ordered - garlic bread with cheese, Chicken Saltimbocca and Spaghetti Carbonara - really standard, generally very easy to prepare Italian fare. \n\n", "Then the Spaghetti Carbonara. ", "Salty. ", "So salty. ", "And then I found a giant piece of egg shell in my food (unfortunately too late, I was crunching on shell for the rest of the night). ", "The Saltimbocca was watery, raw looking and had a smell to it. "], "author": "Mindy S.", "review": "This was certainly the worst Italian food I've ever had. If you can call it food. And this dining experience certainly is in the running for worst paid meal I've had in some time. \n\nWe wanted to go to Franchino's. We walked over there after consuming some delicious Dead Guys at the Rogue Public House. Unfortunately, it was closed. In our inebriated, famished state we looked around for the first place that looked decent. And there, before us was Mona Lisa. It looked clean, inviting and pleasant inside, so after checking Yelp to see that it had a decent 3.5 rating, we decided to give it a go. \n\nWe realized upon entering that there weren't that many people in the restaurant and all of the patrons were crammed in the front of the house to give the illusion of a very busy cafe. Oh well, we had a nice spot by the window. We ordered - garlic bread with cheese, Chicken Saltimbocca and Spaghetti Carbonara - really standard, generally very easy to prepare Italian fare. \n\nUgh. I'm still trying to shake the garlic bread. So unbelievably garlicky. So unbelievably bad. My pores are oozing garlic. My breath is so incredibly smelly and this, over 24 hours later. I don't know if the garlic was bad or if there was simply too much of it but it's a powerful stench. And I love garlic. \n\nThen the Spaghetti Carbonara. Salty. So salty. And then I found a giant piece of egg shell in my food (unfortunately too late, I was crunching on shell for the rest of the night). The Saltimbocca was watery, raw looking and had a smell to it. Not a pleasant saltimboccay smell. \n\nAnyway, we alerted the waiter to the shell in my carbonara. He apologized but that was it. No adjustment to the bill. 50 dollars later, I spent the plane ride home to DC gripping my stomach and hoping that my row partners couldn't smell the stench of garlic upon me. If this is what passes for Italian food in San Francisco you can count me out. I don't know a single Italian from Rhode Island (the Italian capitol of the country) that would serve nor prepare what I ate. \n\nCurse you Franchino's for being closed!", "rating": 1, "date": "2010-09-07"}, {"excerpts": ["I recommend the anti pasto misto, the penne al forno alla Calabrese, spaghetti carbonara, chicken Marsala , ", "And for wine the Crusher, a petite syrah"], "author": "Salvatore A.", "review": "Mona Lisa is by far the best Italian food in San Francisco. Being an Italian American I truly enjoyed the resteraunts decor as well as the service. My date and I were amazed the hosts hospitality when we first arrived. After her first bite she let out a moan as if she creamed herself... Fella's if you're trying to get it in take your date to Mona Lisa . I recommend the anti pasto misto, the penne al forno alla Calabrese, spaghetti carbonara, chicken Marsala , And for wine the Crusher, a petite syrah", "rating": 5, "date": "2012-06-15"}, {"excerpts": ["I had the spaghetti carbonara and it still missed a little something in it...", "I bet there are other Italian restaurants around north beach that has better tasting food."], "author": "Billy A.", "review": "The place is cluttered!...but the food was pretty decent for the price. I had the spaghetti carbonara and it still missed a little something in it...I bet there are other Italian restaurants around north beach that has better tasting food.", "rating": 2, "date": "2012-03-17"}, {"excerpts": ["I had spaghetti carbonara and it was amazing. ", "I was sitting outside and they had their cute little car parked up in-front of the restaurant and the owner insisted I sit in the car and have dessert on the house ", ":)"], "author": "Sarah J.", "review": "Stopped by here for a quick dinner when I was traveling by myself. Staff were super friendly and lovely! I had spaghetti carbonara and it was amazing. I was sitting outside and they had their cute little car parked up in-front of the restaurant and the owner insisted I sit in the car and have dessert on the house :)", "rating": 5, "date": "2013-04-29"}, {"excerpts": ["I ordered a simple spaghetti carbonara and was immediately impressed. "], "author": "Jan D.", "review": "The selection was EXTENSIVE! You will definitely need to take your time going through the menu--you will not be disappointed!\n\nI ordered a simple spaghetti carbonara and was immediately impressed. The flavor was on point, not overly creamy (why other \"Italian\" restaurants think it's supposed to be is beyond me).\n\nI will agree with almost all the posts that the customer service totally exceeds any restaurant I've ever been to--period! I went there on a Friday night with a bunch of friends for a birthday.First of all: the seating host was just too frikkin cute with an adorable Italian accent to boot, I'm definitely NOT complaining about that; I don't remember your name but if you're reading this you are H-O-T! Come to think of it, almost their entire staff was comprised of men, yes ladies, cute men! And the owner was just so welcoming and completely speaking to me in Italian like we were old pals (I'm an American born Asian mind you, which means I can barely speak my own language =P).\n\nOverall: food was great, energy was awesome and eye candy was abundant--enjoy!", "rating": 4, "date": "2012-02-25"}, {"excerpts": ["Next, we had spaghetti carbonara which was made with almost an alfredo sauce, which is not the classic way. ", "The pieces of pancetta were also pretty large too. ", "Not the best we've had. ", "We also had the rigatoni (forgot the name, but with chicken and in a pesto sauce). ", "The chicken was a little overcooked, but otherwise ok. ", "The food is just mediocre. ", "There are plenty of better places to get good, authentic Italian food."], "author": "Amanda D.", "review": "Eh.\n\nI went here on a date night with my bf. We got a little table in the very corner by the window. The place is defiantly cramped - lots of tables, too many people in such a little space, but it kinda gives it its appeal. We started with the calamari, which was cooked well, but the marinara sauce had far too much raw garlic. I love garlic, but it was a little offensive. \n\nNext, we had spaghetti carbonara which was made with almost an alfredo sauce, which is not the classic way. The pieces of pancetta were also pretty large too. Not the best we've had. We also had the rigatoni (forgot the name, but with chicken and in a pesto sauce). The chicken was a little overcooked, but otherwise ok. The food is just mediocre. There are plenty of better places to get good, authentic Italian food.", "rating": 3, "date": "2009-01-18"}, {"excerpts": ["My spaghetti carbonara was salty and overcooked. ", "Prices are too high for this quality. ", "A t-bone steak for $30 is much higher than the most steakhouses. ", "The service is OK. ", "The ambient is nice. ", "The tiramisu was not so good as I expect from an Italian restaurant. ", "I make it much more better by myself."], "author": "Rokgoo R.", "review": "Food Quality is very average. My spaghetti carbonara was salty and overcooked. Prices are too high for this quality. A t-bone steak for $30 is much higher than the most steakhouses. The service is OK. The ambient is nice. The tiramisu was not so good as I expect from an Italian restaurant. I make it much more better by myself.", "rating": 2, "date": "2010-02-15"}, {"excerpts": ["Very good Spaghetti Carbonara. ", "We will come back for the Carbonara. ", "Smoky chunky pieces of bacon ham. ", "The prosciutto and melon dish was average. ", "I had the Chicken Marsala and it was just average.  ", "Service was good. ", "Three stars for the service and the Carbonara."], "author": "Seymour S.", "review": "We sat outside. The tanned Italian host got down to his knees when a pretty brunette asked for a table. Huge line of tourists waited outside the narrow sidewalk to get a table. Good people watch on a strangely warm night. Corkage fee is $15 dollars. Not bad these days. Very good Spaghetti Carbonara. We will come back for the Carbonara. Smoky chunky pieces of bacon ham. The prosciutto and melon dish was average. I had the Chicken Marsala and it was just average.  Service was good. Three stars for the service and the Carbonara.", "rating": 3, "date": "2008-07-29"}], "spaghetti polpette": [{"excerpts": ["My \"Spaghetti Polpette \" lacked sauce. ", "The spaghetti itself was not cooked al dente as requested. "], "author": "Jim G.", "review": "Very rarely will I give anything lower than 3 stars unless I was completely dissatisfied with the whole experience. Aside from the lovely hostess with curly hair and glasses ( didn't catch your name, but keep up the wonderful job) my experience here may be my last. \n\n- It's a disgusting feeling when you do not feel welcomed to a restaurant or anywhere for that matter. I ate here with my younger brother and felt that our waiter prioritized certain tables over ours. Haven been a waiter, I understand different signs customers give me in order to accommodate their wants and needs. That being said, we closed our menus since we already decided on what to get. Our waiter passed us several times and clearly saw that we were ready, but still insisted on not acknowledging us. Finally, he took our orders. Losing my appetite already, but hey, hopefully the food compensates for his lack of friendly service.\n\n- Food comes out and it looks semi-pleasing. My \"Spaghetti Polpette \" lacked sauce. The spaghetti itself was not cooked al dente as requested. My brother's pasta, \"Spaghetti allo Scoglio\" was appetizing, I give them that. \n\n- I took a couple bites and was not pleased, so I was waiting for my waiter to check up on us. He went to our table and asked us how the food was (kind gesture) but as I was speaking, he walks away to attend to another table, that did not even flag him down. Such a rude move. He comes back after attending to the table next to mine, and says, \" you wanted more sauce?\" \"Yes, please\".\n\n- I was presented with more sauce in a timely manner. Sauce wasn't flavorful, but I really didn't want to be that \"one guy\" so decided to let it go. Did not end up packing our leftovers (which I usually do). \n\nIt could have been an off day for them. Our waiter could have been having a bad day. But regardless of the fact, servitude, friendliness, and tastiness is always key, and Mona Lisa did not reach my expectations. Would I give this place another try? Yeah, I would, but would definitely try something else and request another server.", "rating": 2, "date": "2014-08-03"}, {"excerpts": ["The \"side\" of meatballs was actually from the Spaghetti Polpette (without the spaghetti)- ", "so I was charged for a half order of spaghetti polpette... not a huge deal.  ", "The meatballs had good flavor, and  the marinara they came with was nondescript, but good nonetheless.   ", "All in all, an enjoyable meal.  ", "The bread was forgettable, but that seems to be a common theme for all places along Columbus Street.   ", "Service was good as well.  ", "No complaints.  ", "Good Italian, but didn't send me over the moon.  ", "Decently priced.  ", "Quaint, tho slightly kitchy decor.  ", "I decided to forgo dessert, as I've had far too much BAD tiramsu at several places along Columbus St. to go down that road again.  ", "Good, consistant Italian food.  ", "Will return again.", "so I was charged for a half order of spaghetti polpette... not a huge deal.  ", "The meatballs had good flavor, and  the marinara they came with was nondescript, but good nonetheless.   ", "All in all, an enjoyable meal.  ", "The bread was forgettable, but that seems to be a common theme for all places along Columbus Street.   ", "Service was good as well.  ", "No complaints.  ", "Good Italian, but didn't send me over the moon.  ", "Decently priced.  ", "Quaint, tho slightly kitchy decor.  ", "I decided to forgo dessert, as I've had far too much BAD tiramsu at several places along Columbus St. to go down that road again.  ", "Good, consistant Italian food.  ", "Will return again."], "author": "R S.", "review": "supped at Mona Lisa this past Sunday.  No wait, got right in.  Was dining alone, so was seated at a small table shoved up against the counter.  A little crowded, but no big deal.  Have dined at Mona Lisa usually once each time I'm in San Francisco (about once a year).\n\nOrdered the tortellini in 4-cheese cream sauce, which was VERY,  VERY rich and, as another reviewer put it, \"quite pungent\".  I couldn't finish it.  Luckily, I had ordered a side of meatballs, which helped cut the richness somewhat.  The \"side\" of meatballs was actually from the Spaghetti Polpette (without the spaghetti)- so I was charged for a half order of spaghetti polpette... not a huge deal.  The meatballs had good flavor, and  the marinara they came with was nondescript, but good nonetheless.   All in all, an enjoyable meal.  The bread was forgettable, but that seems to be a common theme for all places along Columbus Street.   Service was good as well.  No complaints.  Good Italian, but didn't send me over the moon.  Decently priced.  Quaint, tho slightly kitchy decor.  I decided to forgo dessert, as I've had far too much BAD tiramsu at several places along Columbus St. to go down that road again.  Good, consistant Italian food.  Will return again.", "rating": 3, "date": "2008-10-08"}], "spaghetti salsiccia": [{"excerpts": ["Ordered the Spaghetti Salsiccia. ", "Sausage was perfectly seasoned and served with plenty of sauce. ", "Stayed warm the entire meal. ", "Wonderful atmosphere and quick service. ", "Molto bene!"], "author": "Mary N.", "review": "Antipasti plate was unbelievable! Ordered the Spaghetti Salsiccia. Sausage was perfectly seasoned and served with plenty of sauce. Stayed warm the entire meal. Wonderful atmosphere and quick service. Molto bene!", "rating": 5, "date": "2016-03-14"}], "fettuccine mona lisa": [{"excerpts": ["It was either Fettuccine Mona Lisa or a risotto dish. ", "I asked the waiter his recommendation about the risotto. ", "He asked if I liked meat or seafood. ", "I was thinking about the seafood. ", "He went down the list to pick certain items. ", "In the end I decided to order the Fettuccine Mona Lisa for one reason. ", "In the past if a certain restaurant names a dish after its own restaurant name ", "I'm assuming the dish is its specialty. ", "That's why I ordered the Fettuccine Mona Lisa. \n\n", "There are several items named after the restaurant (Fettuccine Mona Lisa, Chicken Mona Lisa, Pizza Mona Lisa, and Veal Mona Lisa). ", "Now back to my only dish, which is the Fettuccine Mona Lisa. ", "Two great things about this pasta is that the pasta is cooked al denta and the sauce is creamy but not heavy. ", "One thing I didn't like about this pasta is it was quite salty due to the olives. ", "Since the olives are cured having the olives with the ham makes dish quite salty. ", "I would recommend either having the olives or ham alone in the pasta but not both. ", "With abundance of items on the menu I feared that this dish would not maintain its quality. ", "Even though I only had the Fettuccine Mona Lisa today, I've eaten here before. ", "The last time I ate here was about 10 years ago. ", "I don't think the menu has remained the same but what I remembered was that the menu was very extensive that made it intimidating. ", "What I ordered last time was the salmon, but there were so many different dishes of salmon ", "I couldn't remember what I ordered. ", "However I do remember the salmon was dry and overcooked. ", "The fear of having too many items is some of the dishes won't be as good. ", "Even though I've only eaten here twice in the last ten years my rating is based upon two items - a tasty Fettuccine Mona Lisa and a dry salmon. ", "In a sense my rating is based on one word - consistency. ", "With too many dishes consistency is hard to achieve. ", "I feel if the restaurant cuts more than half of the dishes in the current menu I believe the quality of the food will be much better and consistency will be better achieved."], "author": "Gerald R.", "review": "NORTH BEACH EATING PART VIII: SOUTHERN CUISINE - COLUMBUS DAY\n\nI ate here at lunch today on Columbus Day. As my title stated I generalized the cuisine as southern cuisine. When I have been starting my North Beach adventure I would go to Italian restaurants trying to find specialized, regional cuisines. One of the major problems of trying to categorize the regional cuisine of the restaurant is the extensive menu. There are so many items on the list I was worried about the quality of each dish. In addition I couldn't what in the menu what the regional cuisine of this restaurant; the only reason I stated southern cuisine of this restaurant was because it stated on the Yelp information. Having quick lunch I needed to just one item, but I wasn't sure what item to ordered. It was either Fettuccine Mona Lisa or a risotto dish. I asked the waiter his recommendation about the risotto. He asked if I liked meat or seafood. I was thinking about the seafood. He went down the list to pick certain items. In the end I decided to order the Fettuccine Mona Lisa for one reason. In the past if a certain restaurant names a dish after its own restaurant name I'm assuming the dish is its specialty. That's why I ordered the Fettuccine Mona Lisa. \n\nAs mentioned before one of the reasons why this menu was confusing was because I couldn't tell what is their specialty. There are several items named after the restaurant (Fettuccine Mona Lisa, Chicken Mona Lisa, Pizza Mona Lisa, and Veal Mona Lisa). There are also dishes named after the City (Spaghetti San Francisco, Chicken San Francisco, and Risotto San Francisco). Since this restaurant is on North Beach why doesn't the restaurant name some of the dishes after North Beach? Lol.\n\nNow back to my only dish, which is the Fettuccine Mona Lisa. Two great things about this pasta is that the pasta is cooked al denta and the sauce is creamy but not heavy. One thing I didn't like about this pasta is it was quite salty due to the olives. Since the olives are cured having the olives with the ham makes dish quite salty. I would recommend either having the olives or ham alone in the pasta but not both. With abundance of items on the menu I feared that this dish would not maintain its quality. Other than the olives the pasta was quite tasty. \n\nEven though I only had the Fettuccine Mona Lisa today, I've eaten here before. The last time I ate here was about 10 years ago. I don't think the menu has remained the same but what I remembered was that the menu was very extensive that made it intimidating. What I ordered last time was the salmon, but there were so many different dishes of salmon I couldn't remember what I ordered. However I do remember the salmon was dry and overcooked. The fear of having too many items is some of the dishes won't be as good. Even though I've only eaten here twice in the last ten years my rating is based upon two items - a tasty Fettuccine Mona Lisa and a dry salmon. In a sense my rating is based on one word - consistency. With too many dishes consistency is hard to achieve. I feel if the restaurant cuts more than half of the dishes in the current menu I believe the quality of the food will be much better and consistency will be better achieved.", "rating": 2, "date": "2014-10-13"}, {"excerpts": ["I had the Gamberoni Piccata, and my mom had the Fettuccine Mona Lisa. ", "In spite of enormous portions, we cleaned our plates. ", "The house bread is wonderful too. "], "author": "Rae D.", "review": "I was frightened that it was a tourist trap, but my Mom wanted to stop and since it was the first place she was even slighted interested in I agreed. I am so very glad I did!\n\nWe sat outside for lunch and had a wonderful view of the church across the street, so Nice ambiance, check.\n\nThe maitre'd (owner?) was cheeky Italian, insistent that his place is the best, and we obviously deserved the best. Treated well, check.\n\nThere was an entire bus-load of Italian tourists eating inside, and they all seemed very pleased with their experience. Must be a good sign!\n\nThanks to the full house, our waiter was incredibly busy. He was still polite and made sure we knew we mattered also. Another treated well, check.\n\nNow for the food...WOW! I had the Gamberoni Piccata, and my mom had the Fettuccine Mona Lisa. In spite of enormous portions, we cleaned our plates. The house bread is wonderful too. Terrific food, check.\n\nI feel it may help to mention that I live in Houston, and it's not bragging to say we have our fair share of fantastic restaurants. I am truly picky, and can say that Mona Lisa is top-notch.", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["What we ordered:\n\nPenne al Forno alla Calabrese \nbaked penne with meat sauce, ham and mozzarella\n\nFettuccine Mona Lisa \ncream sauce, ham, olives and mushrooms \n\nPortions were huge!  "], "author": "Michelle N.", "review": "It was my mom's last night on her visit to SF.  We decided to head to  North Beach for dinner.  There are so many restaurants there...how do you choose.  Do we go somewhere I've eaten before or go somewhere that friends have suggested.  Decisions, decisions, decisions.\n\nUpon our walk on the search of where to dine, every place was offering either a free appetizer or glass of wine with our meal.   we ended up at Mona Lisa where I had dined before maybe five years ago and couldn't remember how great it was.  \n\nWhat we ordered:\n\nPenne al Forno alla Calabrese \nbaked penne with meat sauce, ham and mozzarella\n\nFettuccine Mona Lisa \ncream sauce, ham, olives and mushrooms \n\nPortions were huge!  Mom and I should have ordered just one entree.  My leftover was enough to fill me for lunch today.  I'd return, but will opt out of getting anything that included ham because the dishes were on the salty side.  If you're big on ham, these dishes will not disappoint.", "rating": 4, "date": "2009-04-21"}], "fettuccine leonardo": [{"excerpts": ["The fettuccine Leonardo is to die for. \n\n"], "author": "Alysha M.", "review": "This place is no joke!\n\nWow. The fettuccine Leonardo is to die for. \n\nExtremely authentic Italian- as in, everyone who works here speaks fluent Italian. It's awesome.", "rating": 5, "date": "2017-04-03"}, {"excerpts": ["My friends ordered a calzone and I ordered the Fettuccine Leonardo. ", "It is basically chicken and Alfredo sauce with baby tomatoes. ", "Extremely good and has lots of flavor. ", "So, if you're ever in walking home from Pier 39, you might find this place. ", "It's fantastic!"], "author": "Elizabeth C.", "review": "Found this place wandering today. Tbh, the place is a little pricey but most definitely worth it. The waiter was very nice and very attentive to our needs. You truly get an authentic Italian experience here. The place has a very lowkey vibe to it and I found myself admiring all of the art and statues throughout the entire restaurant. My friends ordered a calzone and I ordered the Fettuccine Leonardo. It is basically chicken and Alfredo sauce with baby tomatoes. Extremely good and has lots of flavor. So, if you're ever in walking home from Pier 39, you might find this place. It's fantastic!", "rating": 5, "date": "2018-04-03"}, {"excerpts": ["Ordered the Fettuccine Leonardo & it was deeelish! \n\n"], "author": "Pam V.", "review": "Stumbled upon this quaint Italian restaurant.\n\nThe freshest Crostini I've ever had on the house! \n\nOrdered the Fettuccine Leonardo & it was deeelish! \n\nDefinitely fresh ingredients & great customer service! \n\nThis place needs more stars", "rating": 5, "date": "2015-01-10"}, {"excerpts": ["The TORTELLINI AI QUATTRO FORMAGGIO and FETTUCCINE LEONARDO were amazing. ", "Both creamy and full of flavor. ", "In a sea of Italian restaurants this place really stands out! ", "Molto Buono!"], "author": "Sarah D.", "review": "This place was the total package! May come off as touristy, but don't let that discourage you from enjoying some of the best pasta your taste buds will ever experience. Great staff, friendly and very welcoming. Owner walks around taking Italian, it's a fun experience. Good for both family and romantic nights out. The TORTELLINI AI QUATTRO FORMAGGIO and FETTUCCINE LEONARDO were amazing. Both creamy and full of flavor. In a sea of Italian restaurants this place really stands out! Molto Buono!", "rating": 4, "date": "2014-07-06"}, {"excerpts": ["I had the chicken Mona Lisa and my date had the fettuccine Leonardo. ", "Both dishes were great. ", "I loved that the chicken was thin and the prosciutto on top was so good. ", "For an appetizer we had the prosciutto de melon. ", "Such a simple dish and the ingredients melded so well with each other. ", "A perfect balance of salty and sweet."], "author": "Linda N.", "review": "Charming spot in north beach. I love the old school ambiance. Service was great. Food was great. I had the chicken Mona Lisa and my date had the fettuccine Leonardo. Both dishes were great. I loved that the chicken was thin and the prosciutto on top was so good. For an appetizer we had the prosciutto de melon. Such a simple dish and the ingredients melded so well with each other. A perfect balance of salty and sweet.", "rating": 4, "date": "2012-12-07"}], "penne al forno alla calabrese": [{"excerpts": ["The food is really good quality (please give a try to Penne al Forno alla Calabrese), fresh and it always comes in huge portions. ", "The pinsa is amazing, very light and delicious. "], "author": "Giulia D.", "review": "This is my favorite Italian restaurant of all time.\n\nMaurizio is fantastic, he makes you feel always welcome and he is always ready to make you smile with his jokes.\n\nThe food is really good quality (please give a try to Penne al Forno alla Calabrese), fresh and it always comes in huge portions. The pinsa is amazing, very light and delicious. The Tiramisu is spectacular at the end of the meal, really creamy but not heavy.\n\nThe wine is always abundant, as the Italian tradition wants and good quality for the price.\n\nThe ambiance is really cozy and warm and the staff is amazingly kind and available to accommodate any request.\n\nThat's the perfect Italian spot in San Francisco to me.", "rating": 5, "date": "2018-10-04"}, {"excerpts": ["Penne al Forno alla calabrese is my favorite!\n\n"], "author": "Jason S.", "review": "We've been here at least 20 times over 15 years. It is always a pleasant experience. Food is fantastic and the service is usually on point.  I always bring out of town guest here.\n\nPenne al Forno alla calabrese is my favorite!\n\nHow ironic that I write the review, only to have a not so great experience just 10 minutes later. They changed their recipe and when we brought it up to the owner he seemed bothered that we commented on it.   He said \"well bye and walked away\" Keep in mind we were literally the only people there. \n\nI hope this was a one off experience. We will try again next time we are in the city.", "rating": 3, "date": "2016-06-04"}, {"excerpts": ["We recommend the Penne al Forno alla Calabrese for the main course and the Bruschettas for appetizer. ", "The owner makes everyone feel like family and all the waiters are attentive and welcoming. ", "Totally deserves a 5 star review and your visit!"], "author": "Annette O.", "review": "Just perfect! Mona Lisa was the first Italian restaurant I visited back in September 2015 when I was just arriving to SF. It was also the place I had my first date with my boyfriend and our first choice for spontaneous week day dinner dates. Since day one, the service has been amazing each and every time. The food is to die for! We recommend the Penne al Forno alla Calabrese for the main course and the Bruschettas for appetizer. The owner makes everyone feel like family and all the waiters are attentive and welcoming. Totally deserves a 5 star review and your visit!", "rating": 5, "date": "2016-08-12"}, {"excerpts": ["I ordered the Penne al Forno alla Calabrese, a baked penne with meat sauce, ham and mozzarella. ", "It was piping hot when it arrived at the table, much to my pleasure. "], "author": "Greg S.", "review": "North Beach...with a throng of Italian restaurants to choose from, how do you know what's good?\n\nOn this particular evening, I let my eyes do the walking. I passed Mona Lisa Restaurant and looked through the open windows to see beautiful chandeliers and ornately painted ceilings. That was enough to pique my interest!\n\nThe menu looked to have the standard fare and the wait was only 10 min, so it was decided. When we were seated, the positioning of the table was not ideal; I was sitting in a high traffic area for the wait staff. But I pulled close to the table and made the best of it.\n\nThe wait staff were courteous and as attentive as they could be on a busy Saturday night. The kitchen really seemed slow and it took a while for us to get our food. I'm not sure if they were unorganized or if they were just slammed, but for a pasta dish the wait was longer than expected.\n\nI ordered the Penne al Forno alla Calabrese, a baked penne with meat sauce, ham and mozzarella. It was piping hot when it arrived at the table, much to my pleasure. It was overall enjoyable, but nothing spectacular.\n\nOverall, I think Mona Lisa is pretty standard Italian food. It was good, but didn't knock my socks off.\n\nPerhaps next time I'll follow my nose!", "rating": 3, "date": "2011-11-01"}, {"excerpts": ["I recommend the anti pasto misto, the penne al forno alla Calabrese, spaghetti carbonara, chicken Marsala , ", "And for wine the Crusher, a petite syrah"], "author": "Salvatore A.", "review": "Mona Lisa is by far the best Italian food in San Francisco. Being an Italian American I truly enjoyed the resteraunts decor as well as the service. My date and I were amazed the hosts hospitality when we first arrived. After her first bite she let out a moan as if she creamed herself... Fella's if you're trying to get it in take your date to Mona Lisa . I recommend the anti pasto misto, the penne al forno alla Calabrese, spaghetti carbonara, chicken Marsala , And for wine the Crusher, a petite syrah", "rating": 5, "date": "2012-06-15"}, {"excerpts": ["What we ordered:\n\nPenne al Forno alla Calabrese \nbaked penne with meat sauce, ham and mozzarella\n\nFettuccine Mona Lisa \ncream sauce, ham, olives and mushrooms \n\nPortions were huge!  "], "author": "Michelle N.", "review": "It was my mom's last night on her visit to SF.  We decided to head to  North Beach for dinner.  There are so many restaurants there...how do you choose.  Do we go somewhere I've eaten before or go somewhere that friends have suggested.  Decisions, decisions, decisions.\n\nUpon our walk on the search of where to dine, every place was offering either a free appetizer or glass of wine with our meal.   we ended up at Mona Lisa where I had dined before maybe five years ago and couldn't remember how great it was.  \n\nWhat we ordered:\n\nPenne al Forno alla Calabrese \nbaked penne with meat sauce, ham and mozzarella\n\nFettuccine Mona Lisa \ncream sauce, ham, olives and mushrooms \n\nPortions were huge!  Mom and I should have ordered just one entree.  My leftover was enough to fill me for lunch today.  I'd return, but will opt out of getting anything that included ham because the dishes were on the salty side.  If you're big on ham, these dishes will not disappoint.", "rating": 4, "date": "2009-04-21"}, {"excerpts": ["Penne Al Forno Alla Calabrese baked penne with meat sauce, ham and ,mozzarella $13.95\n\nambiance = dark and tight\nparking = depend on your parking fairy...street\nstaff = strong italian accent and some don't even speak english.  "], "author": "Elisa O.", "review": "Penne Al Forno Alla Calabrese baked penne with meat sauce, ham and ,mozzarella $13.95\n\nambiance = dark and tight\nparking = depend on your parking fairy...street\nstaff = strong italian accent and some don't even speak english.  busy that night so it was hard to flag someone down\nwait time = long for food, short to be seated\nflavor = i liked my dish and that is the only reason why it gets 3 stars\n\nnothing more to say, I think I will try another place.", "rating": 3, "date": "2007-07-01"}, {"excerpts": ["I ended up with the Penne al Forno alla Calabrese.  ", "A baked penne dish with ham. ", "It was tasty and the portion was quite large, a good value for the price.  ", "I also tried the crab ravioli which were good ", "but I was happier with my dish.  ", "A little slow on the service ", "but they make everything fresh when you order it ", "and hey, you're suppose to enjoy the experience.  ", "Definitely a restaurant to keep in the back pocket in case ", "I'm not sure where else to eat in North Beach on another visit."], "author": "Laura T.", "review": "I ate here with some friends before a Giants game.  Located right on Columbus Ave I thought this restaurant had a lot of charm, with some interesting decor, like the st. patty's day hat on a statue...go figure.  It has a few tables outside and a nice dining space indoors.  We sat on the inside but right by the open windows so we got a nice breeze.  We had the Prosciutto e Melone, recommended by one of our party and I really enjoyed it, quite good melon for the city.  The menu was HUGE with so many different choices.  I ended up with the Penne al Forno alla Calabrese.  A baked penne dish with ham. It was tasty and the portion was quite large, a good value for the price.  I also tried the crab ravioli which were good but I was happier with my dish.  A little slow on the service but they make everything fresh when you order it and hey, you're suppose to enjoy the experience.  Definitely a restaurant to keep in the back pocket in case I'm not sure where else to eat in North Beach on another visit.", "rating": 3, "date": "2009-09-14"}], "tortellini tricolore alla panna": [], "lasagna di casa": [{"excerpts": ["I had the Lasagna di casa, It was supposed to be lasagna in a meat sauce. ", "The dish was mainly sauce and melted cheese, Not a trace of ricotta, nor italian sausage. "], "author": "Wayne P.", "review": "Mona Lisa is hardly a masterpiece.  This place ranks near the bottom of good italian restaurants in North Beach.\n\nI had the Lasagna di casa, It was supposed to be lasagna in a meat sauce. The dish was mainly sauce and melted cheese, Not a trace of ricotta, nor italian sausage. I would call this dish Lasagna soup.\n\nMy wife had Ravioli al Quattro Fromaggi, It was very rich, she could only eat about half of her serving. The cheese was also pungent. Almost as strong as blue cheese.\n\nMy daughter had risotto, It was okay, undoubtably the best dish on the table.\n\nI seriously doubt I will ever come back to Mona Lisa. There are too many better options in North Beach. One more note, The food was very salty, We were all dying of thirst about 30 minutes after our meal.", "rating": 3, "date": "2008-08-08"}, {"excerpts": ["their lasagna di casa was yummy if you enjoy extreme cheesiness!"], "author": "Jill k.", "review": "this place gets extra points for getting us in quickly without our full party...\n\nfood-wise, it was good, tasty and filling.  their lasagna di casa was yummy if you enjoy extreme cheesiness!", "rating": 4, "date": "2005-11-13"}], "rigatoni all salvatore": [], "rigatoni all borrelli": [], "rigatoni aldon smith": [{"excerpts": ["We had margarita pizza, spaghetti with meatballs, lasagna,  rigatoni aldon smith. ", "We can't say one was better than the other, they were all uniquely delish!"], "author": "Beth S.", "review": "Everything we ate was amazing! We had margarita pizza, spaghetti with meatballs, lasagna,  rigatoni aldon smith. We can't say one was better than the other, they were all uniquely delish!", "rating": 5, "date": "2018-08-19"}, {"excerpts": ["We weren't all that hungry, so we ordered 3 dishes to share: Chicken Piccata, Rigatoni Aldon Smith, and Risotto. "], "author": "Sonia D.", "review": "My parents / brother were visiting me in the city, which happens rarely, and I wanted to take them to a nice restaurant in North Beach. However, I am so extremely disappointed with staff, service, and food that it ruined the whole night. Let me address each piece...\n\n1. Service- we were seated quickly, but once seated we waited for forever before someone even came to our table.  It took so long that we almost left, but finally our server came after more than 20 minutes and brought us water. Which brings me to point 2....\n\n2. Staff- HORRIBLE. We were greeted by Luca, and by the time were ready to order since they took so long to arrive in the first place. Let me start off by saying he was not at all pleasant. We weren't all that hungry, so we ordered 3 dishes to share: Chicken Piccata, Rigatoni Aldon Smith, and Risotto. Luca immediately arrogantly stated that since there are four of us dining, we would have to order four dishes.\n\nWhat?! This was nowhere stated on the menu, and I saw other diners at the restaurant clearly sharing dishes. I thought he was joking at first and tried to laugh it off, but he retorted that he was being serious and demanded us to order another dish. I asked for some time to think about what we wanted to order. I was shocked that there was an obligation to order one dish per person for our table, when clearly it wasn't a requirement for others. I realized a few minutes later that he was probably taking advantage of us, thinking that we are tourists, since we were there as a family? I flagged him down and asked him to cancel our order and we will take our business elsewhere, and suddenly he seemed okay with serving us. This was absolutely not the ambiance I wanted to bring my family to, and was so upset at the upfront rude behavior of Luca that it ruined the rest of my night. \n\n3. The food itself was hit or miss. Rigatoni was excellent, Risotto was average, and the Chicken tasted like it was just boiled and doused in sauce. \n\nThe food and service could have been pardoned, but I am so turned off by the arrogant behavior of the staff that I am never returning here again.", "rating": 1, "date": "2018-08-26"}, {"excerpts": ["The rigatoni Aldon Smith is great."], "author": "Aaron B.", "review": "I have been going here for a long time. Great food and service.\nThe rigatoni Aldon Smith is great.", "rating": 5, "date": "2018-03-06"}], "rigatoni osilio": [{"excerpts": ["He ordered Spaghetti alle Vongole (white wine sauce, clams and garlic) as I had the  Rigatoni Osilio (chicken basil in pesto sauce). ", "The Spaghetti alle Vongole was a bland white wine sauce, lacked garlic and any sort of flavor with clams thrown in. ", "As my Rigatoni Osilio, was an extremely small portion, where they used large rigatoni pasta that was dry, topped with clumps of pesto. ", "People are usually put in a situation where they want less olive oil, but in this case, I wanted more. ", "The bread provided tasted stale and we wondered, what more could go wrong from this place. ", "As we already started eating our dishes, the server then comes back asking if we wanted parmesan cheese. ", "We both agreed that it would probably add a little something to our dishes. ", "He spooned a large amount and started to put it on my dish. ", "When I told him that, that was enough, he plopped the entire spoonful in my plate, no longer being able to see my rigatoni noodles because there was that little of it. "], "author": "Ada T.", "review": "You know how Mona Lisa's smile is very half-assed? Well, that's the best portrayal I have for Mona Lisa Restaurant. We (boyfriend and I) decided to go here based off of yelp reviews to see why some people rated it poorly and some outstandingly. Unfortunately, I am going to side with those who give it 1 star or 0, if possible.\n\nWe  walked in on a Wednesday night, made reservations, as very few people were there at about 6:30pm. We weren't greeted by our server and felt a bit rushed as he stood there waiting for us to order, after requesting a few minutes. The extra time was necessary, considering their menu was so long. We ordered the Calamari Fritti, to start us off, which is basically calamari with marinara. It was okay, only the top parts of the squid cut in ring-like shapes, no tentacles. From the impression of our appetizer, we thought it would've been an okay dinner.\n\nWe finally ordered and got our food with not too long of a wait. He ordered Spaghetti alle Vongole (white wine sauce, clams and garlic) as I had the  Rigatoni Osilio (chicken basil in pesto sauce). The Spaghetti alle Vongole was a bland white wine sauce, lacked garlic and any sort of flavor with clams thrown in. As my Rigatoni Osilio, was an extremely small portion, where they used large rigatoni pasta that was dry, topped with clumps of pesto. People are usually put in a situation where they want less olive oil, but in this case, I wanted more. The bread provided tasted stale and we wondered, what more could go wrong from this place. As we already started eating our dishes, the server then comes back asking if we wanted parmesan cheese. We both agreed that it would probably add a little something to our dishes. He spooned a large amount and started to put it on my dish. When I told him that, that was enough, he plopped the entire spoonful in my plate, no longer being able to see my rigatoni noodles because there was that little of it. The boyfriend's clams ate all the cheese, as the server plopped it off to the side.\n\nHe was also very rude, was never attentive of what we wanted and was into chatting it up with his fellow servers. If you're a tourist and you want a true North Beach experience, don't come here to be disappointed and be given the wrong impression. Also, if you don't like searching for parking for a good amount of time, valet your car.\n\nWill not be revisiting this place. Extremely disappointed.", "rating": 1, "date": "2009-12-31"}], "ravioli di carne al pomodoro": [], "penne alla zafferano": [], "rigatoni zio ercolino": [], "chicken asparagi": [], "chicken cacciatora": [], "chicken saltimbocca": [{"excerpts": ["My Chicken Saltimbocca was surprisingly good.  ", "It was simply prepared with roasted potatoes and sauteed spinach.  ", "The chicken was moist while the prosciutto and sage offered delicious contrasts to one another.  ", "The sauce/juice that was present had a good flavor profile to it.  "], "author": "Gene D.", "review": "I had to take off a star due to the service received the evening we dined there.  More on that later.\n\nThe decor is your classic North Beach fare.  It was stuffed full of decorations, etc.  Some would call it gaudy while others would call it classic/typical of the area.  i would agree with the later.\n\nThe food had its share of hits and misses.  My Chicken Saltimbocca was surprisingly good.  It was simply prepared with roasted potatoes and sauteed spinach.  The chicken was moist while the prosciutto and sage offered delicious contrasts to one another.  The sauce/juice that was present had a good flavor profile to it.  The spaghetti Carbonara was so-so.  It was not a good as other places we had been too.  We couldn't pick out the reason but only knew so by the taste.\n\nRoberto (?) was rude and not very attentive to us.  When he first came over to take our drink orders, everything seemed fine.  After that, things changed for some reason.  The wait to take our orders was extremely long.  In fact, several tables around us, where people arrived after us, had already ordered.  We tried to get his attention several times to no avail.  The menus were closed so that should have been a clue to him to come over.  It took several requests to just get the balsamic vinegar for our bread.  Then, after only having it for a few minutes, he came by and took the vinegar and olive oil, only to give it to a couple at an adjacent table.  Needless to say, both parties were shocked at that move.  The couple was kind enough to give them back to us after they had poured some for themselves.  \n\nWe might come back some time, as long as we do not have him again...", "rating": 2, "date": "2017-07-04"}, {"excerpts": ["Had chicken saltimbocca  and spaghetti bolgnese ! ", "Friendly servers and good atmosphere!"], "author": "Teri A.", "review": "Loved this place. Had chicken saltimbocca  and spaghetti bolgnese ! Friendly servers and good atmosphere!", "rating": 5, "date": "2014-07-11"}, {"excerpts": ["We ordered - garlic bread with cheese, Chicken Saltimbocca and Spaghetti Carbonara - really standard, generally very easy to prepare Italian fare. \n\n", "Then the Spaghetti Carbonara. ", "Salty. ", "So salty. ", "And then I found a giant piece of egg shell in my food (unfortunately too late, I was crunching on shell for the rest of the night). ", "The Saltimbocca was watery, raw looking and had a smell to it. "], "author": "Mindy S.", "review": "This was certainly the worst Italian food I've ever had. If you can call it food. And this dining experience certainly is in the running for worst paid meal I've had in some time. \n\nWe wanted to go to Franchino's. We walked over there after consuming some delicious Dead Guys at the Rogue Public House. Unfortunately, it was closed. In our inebriated, famished state we looked around for the first place that looked decent. And there, before us was Mona Lisa. It looked clean, inviting and pleasant inside, so after checking Yelp to see that it had a decent 3.5 rating, we decided to give it a go. \n\nWe realized upon entering that there weren't that many people in the restaurant and all of the patrons were crammed in the front of the house to give the illusion of a very busy cafe. Oh well, we had a nice spot by the window. We ordered - garlic bread with cheese, Chicken Saltimbocca and Spaghetti Carbonara - really standard, generally very easy to prepare Italian fare. \n\nUgh. I'm still trying to shake the garlic bread. So unbelievably garlicky. So unbelievably bad. My pores are oozing garlic. My breath is so incredibly smelly and this, over 24 hours later. I don't know if the garlic was bad or if there was simply too much of it but it's a powerful stench. And I love garlic. \n\nThen the Spaghetti Carbonara. Salty. So salty. And then I found a giant piece of egg shell in my food (unfortunately too late, I was crunching on shell for the rest of the night). The Saltimbocca was watery, raw looking and had a smell to it. Not a pleasant saltimboccay smell. \n\nAnyway, we alerted the waiter to the shell in my carbonara. He apologized but that was it. No adjustment to the bill. 50 dollars later, I spent the plane ride home to DC gripping my stomach and hoping that my row partners couldn't smell the stench of garlic upon me. If this is what passes for Italian food in San Francisco you can count me out. I don't know a single Italian from Rhode Island (the Italian capitol of the country) that would serve nor prepare what I ate. \n\nCurse you Franchino's for being closed!", "rating": 1, "date": "2010-09-07"}, {"excerpts": ["My dinner companions had the chicken saltimbocca, risotto allo scoglio,  gnocchi in pink sauce, fettuccine pescatore, and the chicken S. Marino. ", "If there was an award for second best dish at the table it would go to the S. Marino. ", "It is rolled chicken breast with mozzarella and ham in a tomato-cream sauce, incredible flavors & texture. ", "Even though no one at the table needed another bite of food, it wouldn't have been complete without dessert ", "so we shared a platter of tiramisu & bomba. ", "The tiny bite I managed to eat of the bomba was really good. ", "Our waiter was friendly, attentive, patient, and spot on when helping choose menu items. "], "author": "Elizabeth C.", "review": "We started with a couple of sampler platters. From the calamari to the bruschetta, to the prosciutto with melon, everything was scrumptious. There was a great seasoning on the calamari and they don't skimp on the prosciutto. I had the risotto alfredo & prawns. It was so rich it was ridiculous- in a good way. Truly the best risotto I've ever had. My dinner companions had the chicken saltimbocca, risotto allo scoglio,  gnocchi in pink sauce, fettuccine pescatore, and the chicken S. Marino. If there was an award for second best dish at the table it would go to the S. Marino. It is rolled chicken breast with mozzarella and ham in a tomato-cream sauce, incredible flavors & texture. Even though no one at the table needed another bite of food, it wouldn't have been complete without dessert so we shared a platter of tiramisu & bomba. The tiny bite I managed to eat of the bomba was really good. Our waiter was friendly, attentive, patient, and spot on when helping choose menu items. Another thing to mention about Mona Lisa is they have an adorable little car that is parked out front and a party of two can actually enjoy their meal from inside it if they choose. \n\nClick here for the full story & pictures:\nhttp://consumingcolumbus.blogspot.com/2012/12/mona-lisa-will-make-you-moan_29.html", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["The Chicken Saltimbocca ", "I ordered was delivered lukewarm and was not very good. ", "I don't think the chefs are tasting anything they are making. ", "The pasta was incredibly overcooked! ", "You'd have to leave it in 30 minutes to accomplish what I got. ", "The food (if delivered hot) is what I would expect from an Italian take-out place that charges $10. "], "author": "David G.", "review": "I came here Sunday night for dinner with a friend after a day of exploring the city. I didn't really have any expectations of the restaurant as I'd not heard of it before or read anything before I set foot inside.\n\nThe first thing you notice is the absolute overwhelming decor which covers every wall and space of the ceiling with a Sistine Chapel motif.\n\nSitting down I found the waiter to be attentive, although I noticed throughout the evening that none of the staff or anyone we had interaction with ever smiled or seemed very happy. You sort of got the feeling people weren't too happy to be working, but were treating you well regardless if that makes sense. I'll emphasize though we had no trouble with the service and it does not impact my rating here.\n\nThe food itself was a bit of a disappointment. I suppose I should have been suspect given the menu is absolutely enormous, which is always a warning that quality is going to suffer (Haven't restaurants figured out giant menus are a mistake yet? It's 2009)\n\nWe opted for Fried Calamari to start off with. While the portions were excellent the friend coating was so thick it was like something from a carnival. They were tasteless as well and needed the dipping sauce to cover it up. Someone on staff needs to learn how to make proper fried calamari-it's not hard. Lightly coated-lightly fried.\n\nThe Chicken Saltimbocca I ordered was delivered lukewarm and was not very good. I don't think the chefs are tasting anything they are making. The pasta was incredibly overcooked! You'd have to leave it in 30 minutes to accomplish what I got. The food (if delivered hot) is what I would expect from an Italian take-out place that charges $10. Not bad-just not worthy of a quality restaurant.\n\nPerhaps I got them on a bad night, so I'm still going to award them 3 stars for a fun atmosphere and solid service.  But the food was disappointing.They're charging some solid prices for food that is very mediocre. I don't mind spending money on quality, but I feel foolish rewarding mediocre food with my money. Style over substance for me.", "rating": 3, "date": "2009-04-18"}, {"excerpts": ["I ordered Chicken Saltimbocca and my wife had the Tortellini alla Bollognese.  ", "The Chicken Saltimbocca comes with a small serving of marinara pasta and spinach.  ", "Now I'm a fan of olive oil but when I received my entree, the spinach, the pasta, and the chicken were bathing in a nice pool of olive oil laying at the bottom of the plate.  ", "I can understand a little oil, ", "yes it is perhaps an Italian restaurant.  ", "But to take a bath and have the chicken nearly submerged made me believe either the chef was drunk or we had "], "author": "Bill P.", "review": "Sigmund Freud once interpreted Mona Lisa's smile to signify Leonardo DaVinci's attraction to his mother.  As perverse as incest is, the debate over Mona Lisa's smile is the only good thing to come out of Mona Lisa Restaurant.  I am absolutely shocked at the great reviews for this place.\n\nMy wife and were seated in the back of the restaurant and admired the very busy decor of the place.  The carpet looked like a casino floor without the smell of cigarettes surrounded by unique wall paintings.  We both ordered glasses of wine and came back with a very generous pour.  \n\nI ordered Chicken Saltimbocca and my wife had the Tortellini alla Bollognese.  The Chicken Saltimbocca comes with a small serving of marinara pasta and spinach.  Now I'm a fan of olive oil but when I received my entree, the spinach, the pasta, and the chicken were bathing in a nice pool of olive oil laying at the bottom of the plate.  I can understand a little oil, yes it is perhaps an Italian restaurant.  But to take a bath and have the chicken nearly submerged made me believe either the chef was drunk or we had Exxon Valdez part 2 happen in the back of the kitchen.\n\nThe chicken itself was only moist because of the oil.  The spinach was drenched in oil.  You get the picture.  I can't make an accurate assessment on the food because I think I ordered chicken with my oil based upon what was served.  The chicken was indeed tasty, but considering it was topped with prosciutto, a layer of cheese and a load of oil, any misgivings about the flavor of the chicken went out the door.  \n\nThe wife's tortellini was average.  I think they used Prego sauce.  Even I could've done a better job.  Needless to say she did not finish her entree.\n\nThe worst part of the whole experience was the service.  These guys were running around the entire restaurant like chickens with their heads cut off.  They clearly did not have  a handle on nearly anything going on; barking orders at the busboy, water boy, all the while not keeping tabs on their tables.  After we finished the entree the waiter did come by to pick up our plates.  Then for 20 minutes he disappears and is running around taking care of something else.  \n\n\"Check please!!\"  Been waiting here long enough to have that olive oil grease my colon for Christ's sake!  \n\nBad food, terrible service.  I don't see how Mona Lisa smiles on this place.", "rating": 2, "date": "2007-11-09"}, {"excerpts": ["The chicken saltimbocca (and veal saltimbocca) was great.  ", "Good portions and flavored well.  "], "author": "Andrew D.", "review": "Reservations for eight - arrived early, and sat down on time. \n\nThe friendly wait staff was knowledgeable about the menu.  Recommendations came swiftly, and service was excellent given that the place was packed and partially occupied by a few needy parties.  \n\nDesign - definitely a conversation starter.  Pictures of celebrities, renditions of famous Italian paintings and murals...it definitely kept us busy while we waited for our food.  \n\nThe atmosphere - louder in some parts than others, but that's fine.  Definitely a fun atmosphere in the back. \n\nFood: We all sampled each other's dishes, and they were great. \n\nThe meat dish appetizer was delicious.  \n\nThe chicken saltimbocca (and veal saltimbocca) was great.  Good portions and flavored well.  The chicken was done perfectly, the cheese was on par, the sauteed spinach was so good, and the sauce was delicious.  \n\nMy friend's four cheese sauce gnocchi was good, and I'm not a cheese sauce fan at all.  \n\nLet's face it, Italian cuisine isn't exactly known for its dessert.  In fact, most other Italian restaurants have a pretty bland list of desserts.  \n\nBut Mona Lisa prepares desserts that made me realize why dinner out should always be three courses.  They were aesthetically pleasing, and tasty.  Just check out their menu.  Honestly.", "rating": 4, "date": "2009-03-01"}], "chicken san marino": [{"excerpts": ["There's so many tasty options, I ordered the Chicken San Marino, YUMMY!  ", "We don't usually order appetizers, but we got the bruschetta - amazing and the best I've ever had.  ", "FYI - I don't like tomatoes, lol.  ", "As for the dessert, we ordered one of each and my favorite was the Panna Cotta"], "author": "D H.", "review": "This place is delicious and has a warm friendly atmosphere.  A definite favorite SF restaurant of ours.  Can't wait to go back.  Maurizio, the chef / owner, is a pleasure to talk with.   There's so many tasty options, I ordered the Chicken San Marino, YUMMY!  We don't usually order appetizers, but we got the bruschetta - amazing and the best I've ever had.  FYI - I don't like tomatoes, lol.  As for the dessert, we ordered one of each and my favorite was the Panna Cotta", "rating": 5, "date": "2016-04-15"}, {"excerpts": ["i got the chicken san marino.  ", "it was chicken stuffed with mozzarella and covered in tomato cream sauce.  ", "also totally fantastic.  "], "author": "Scott S.", "review": "i spent a week for my first time in san francisco and ended up eating here twice.  i know, not very creative, but i was with two different groups of people.  the first time i was brought here by a friend who used to live in north beach.  the food was good, but not extra memorable.  i ate the bruschetta and the gnocchi with gorgonzola sauce.  the buschetta was average.  the gnocchi was actually great, but not quite the best i've had.  but the gnocchi dumplings themselves were definitely on the right side of fluffy and the gorgonzola sauce had a ton of flavor.  at this stage i would rate this place 4 stars.\n\ni went back a few days later with my wife.  she got some sort of cheese tortellini with peas and ham.  it was freaking fantastic.  i was picking off of her plate the entire time.  the ham was retardedly salty, which made it a little difficult to eat a lot of at once.  but the flavor of the dish was amazing.  i got the chicken san marino.  it was chicken stuffed with mozzarella and covered in tomato cream sauce.  also totally fantastic.  one of the best italian chicken dishes i've had.\n\nthe second night was probably the best italian meal i've eaten since i was in italy 3 years ago.  and i've eaten at a lot of great italian restaurants in the last 3 years.  so i have to give this place 5 stars.", "rating": 5, "date": "2008-11-16"}], "chicken san francisco": [{"excerpts": ["There are also dishes named after the City (Spaghetti San Francisco, Chicken San Francisco, and Risotto San Francisco). ", "Since this restaurant is on North Beach why ", "doesn't the restaurant name some of the dishes after North Beach? "], "author": "Gerald R.", "review": "NORTH BEACH EATING PART VIII: SOUTHERN CUISINE - COLUMBUS DAY\n\nI ate here at lunch today on Columbus Day. As my title stated I generalized the cuisine as southern cuisine. When I have been starting my North Beach adventure I would go to Italian restaurants trying to find specialized, regional cuisines. One of the major problems of trying to categorize the regional cuisine of the restaurant is the extensive menu. There are so many items on the list I was worried about the quality of each dish. In addition I couldn't what in the menu what the regional cuisine of this restaurant; the only reason I stated southern cuisine of this restaurant was because it stated on the Yelp information. Having quick lunch I needed to just one item, but I wasn't sure what item to ordered. It was either Fettuccine Mona Lisa or a risotto dish. I asked the waiter his recommendation about the risotto. He asked if I liked meat or seafood. I was thinking about the seafood. He went down the list to pick certain items. In the end I decided to order the Fettuccine Mona Lisa for one reason. In the past if a certain restaurant names a dish after its own restaurant name I'm assuming the dish is its specialty. That's why I ordered the Fettuccine Mona Lisa. \n\nAs mentioned before one of the reasons why this menu was confusing was because I couldn't tell what is their specialty. There are several items named after the restaurant (Fettuccine Mona Lisa, Chicken Mona Lisa, Pizza Mona Lisa, and Veal Mona Lisa). There are also dishes named after the City (Spaghetti San Francisco, Chicken San Francisco, and Risotto San Francisco). Since this restaurant is on North Beach why doesn't the restaurant name some of the dishes after North Beach? Lol.\n\nNow back to my only dish, which is the Fettuccine Mona Lisa. Two great things about this pasta is that the pasta is cooked al denta and the sauce is creamy but not heavy. One thing I didn't like about this pasta is it was quite salty due to the olives. Since the olives are cured having the olives with the ham makes dish quite salty. I would recommend either having the olives or ham alone in the pasta but not both. With abundance of items on the menu I feared that this dish would not maintain its quality. Other than the olives the pasta was quite tasty. \n\nEven though I only had the Fettuccine Mona Lisa today, I've eaten here before. The last time I ate here was about 10 years ago. I don't think the menu has remained the same but what I remembered was that the menu was very extensive that made it intimidating. What I ordered last time was the salmon, but there were so many different dishes of salmon I couldn't remember what I ordered. However I do remember the salmon was dry and overcooked. The fear of having too many items is some of the dishes won't be as good. Even though I've only eaten here twice in the last ten years my rating is based upon two items - a tasty Fettuccine Mona Lisa and a dry salmon. In a sense my rating is based on one word - consistency. With too many dishes consistency is hard to achieve. I feel if the restaurant cuts more than half of the dishes in the current menu I believe the quality of the food will be much better and consistency will be better achieved.", "rating": 2, "date": "2014-10-13"}, {"excerpts": ["Chicken San Francisco: ", "Chicken drenched in salt topped with canned artichoke hearts. ", "Gnocchi Fondenti: ", "Think mashed potatoes and cheese. "], "author": "Fred M.", "review": "Scary bad! I have to rate it one star because zero is not an option! Caesar salad: Made with mayonnaise as a base, or a REALLY cheap store bought dressing. Chicken San Francisco: Chicken drenched in salt topped with canned artichoke hearts. Gnocchi Fondenti: Think mashed potatoes and cheese. Also they are so proud of the wine by the glass that they don't list the brand and the won't let you taste it, is it still 1965?\n\nUnfortunately we wasted a dinner in a wonderful food town like San Francisco. Please learn from our experience.", "rating": 1, "date": "2016-01-21"}, {"excerpts": ["I had the Chicken San Francisco, which I originally thought it had some pasta, but it was chicken, potatoes, spinach, and other veggies. ", "I thought it was pretty good. "], "author": "Mandy D.", "review": "3.5 Stars\n\nWhen you step into this place, it looks quite dark. No worries though, your eyes will adjust to it. The decor is quite nice, but it can get a bit crowded. I had the Chicken San Francisco, which I originally thought it had some pasta, but it was chicken, potatoes, spinach, and other veggies. I thought it was pretty good. However, the potatoes were quite salty.  \n\nThe waiter seemed like he was in a rush. He came and took our dishes without really gesturing whether we were ALL finished with our dishes. My friend still had food on her plate, but she was pretty much done.\n\nWhen it came time for the bill, the waiter jotted down the wrong prices on both of my friends orders. Their dishes were a few dollars less than what he initially wrote. When we asked him about it and showed him the menu price, he told us that it was busy and they calculated them by hand. Fine, but he only corrected one of the dishes and not the other. He was so in a rush that he did not correct the entire bill to what it was suppose to be. So we took the time to calculate it ourselves. \n\nDespite of the ending, I would maybe consider coming back because there is such a huge selection of dishes here and the dish I had was good.", "rating": 3, "date": "2010-08-07"}, {"excerpts": ["my parents had spaghetti al salmone and the chicken san francisco. ", "great wine selection, attentive service (not too pushy, but know when you need a refill or the dessert menu!). ", "I HIGHLY RECOMMEND ", "THIS PLACE! ", "GREAT SERVICE, GREAT FOOD, GREAT AMBIANCE, and parking is less than a block away in the structure by the police department. ", "I'll definitely be going again :)"], "author": "toni b.", "review": "Mona Lisa is FANTASTIC!!! I took my parents here when they came into town for the day, and I made reservations for 6. When we got there we were the first ones, the chef presented us a complimentary platter overflowing of delicious prosciutto, salame, cheeses, tomatoes caprese! We ordered the calamari as an appetizer and it was as fresh as it gets. good dipping sauce too. I ordered the penne san francisco (tomoato cream sauce with asparagus and crab) and my boyfriend ordered the risotto allo scoglio (white wine sauce with clams, calamari, prawns and  mussles). we were so full! my parents had spaghetti al salmone and the chicken san francisco. great wine selection, attentive service (not too pushy, but know when you need a refill or the dessert menu!). I HIGHLY RECOMMEND THIS PLACE! GREAT SERVICE, GREAT FOOD, GREAT AMBIANCE, and parking is less than a block away in the structure by the police department. I'll definitely be going again :)", "rating": 5, "date": "2011-07-01"}], "chicken ai funghi porcini": [], "involtini mona lisa": [{"excerpts": ["From the menu we ordered the Carprese Salad, Chicken Marsala, Involtini Mona Lisa, with a bottle of Donna Laura Chianti and split the Raspberry Panna Cota for dessert! "], "author": "Joe R.", "review": "As the saying goes third times the charm, well in Mona Lisa's case we'd say the second time it the charm! \n\nAfter our last visit (Winter 2017) and my previous review, I will say service has gotten better. Our server Roberto was friendly and attentive and this was a big difference from the last time (which we all still vividly remember)​ to be very different and not for the better; good job Roberto!\n\nThe food still extraordinary and flavorful. From the menu we ordered the Carprese Salad, Chicken Marsala, Involtini Mona Lisa, with a bottle of Donna Laura Chianti and split the Raspberry Panna Cota for dessert! The meal totaled $123.53 and while some would consider steep, just remember​ you are in San Francisco, and to eat well, you're gonna pay.\n\nIf your looking for for an Italian restaurant​ in Little Italy/ San Francisco that has great atmosphere, good food and good service, give Mona Lisa a try, but we do recommend making a reservation and doing that on Yelp made that a snap!", "rating": 4, "date": "2017-10-11"}], "tagliata di manzo": [{"excerpts": ["My friend Carl had the Tagliata di Manzo, steak with rosemary. ", "Before he gobbled it down ", "I had a couple bites. ", "Simple, succulent, everything a steak should be. "], "author": "Matt G.", "review": "I have been reading some of these negative reviews and must say my party and I did not experience anything close to what they have to say.\n\nI attended with my friend Carl, and Chewbacca made an appearance (you'll have to see for yourself).\n\nWe were greeted by the very friendly manager (owner?) with a glass of wine. This made us feel at home and we don't even speak Italian :). It was a Monday night, but the place was still pretty packed. After a brief conversation with the manager over our complimentary glass of wine, we were promptly seated.\n\nThe manager recommended bruschetta and calamari. When he saw that we only ordered the calamari, he brought us a plate of bruschetta to try. These unexpected treats where management goes out of their way to surprise and make you feel welcome are part of Mona Lisa's charm and uniqueness. This is true Italian hospitality. The Calamari Fritti was superb as well, and I'm picky with my calamari.\n\nBefore our main dish, we ordered a bottle of Merlot per the server's suggestion. We relied on the server because the wine list was so long. His recommendation was great; we went through 3 bottles of it over the course of our meal.\n\nFor my main dish I had the Lasagna al Pesto, which is cheese lasagna with pesto sauce. To die for. My friend Carl had the Tagliata di Manzo, steak with rosemary. Before he gobbled it down I had a couple bites. Simple, succulent, everything a steak should be. Just enough garnish to bring the taste out without distorting it; a fine balance.\n\nIt might have been because we ordered 3 bottles of wine :), but the manager insisted that he also treat us to dessert. He brought out homemade Tiramisu and Coppa Caffe, along with a cappuccino for each. I've bounced around North Beach for awhile and have yet to find better Tiramisu.\n\nAmbiance and mood were nice. The Mona Lisa painting on the wall demanded most of my attention. High ceilings are important to me (repressed claustrophobia perhaps?) and Mona Lisa provides enough breathing space for me to feel comfortable. The open kitchen is also a plus.\n\nMona Lisa is a place I'd bring a date or a few buddies. It's romantic and quiet in parts, but expansive enough that a larger table can raise the volume a bit.", "rating": 5, "date": "2011-04-12"}], "bistecca ai ferri": [], "bistecca ai porcini": [], "bistecca maria sista": [], "bistecca matilde": [], "grigliata mista di carne": [], "osso buco del brigante": [], "costolette di agnello ercolino": [], "vitello alla parmigiana": [], "vitello alla saltimbocca": [], "vitello alla milanese": [], "vitello ai porcini": [], "vitello mona lisa": [{"excerpts": ["My Cousin had the Bistecca with fresh porcini mushrooms cooked medium rare, and I had the Vitello Mona Lisa (Veal Mona Lisa), and they were both absolutely wonderful. ", "We finished off the meal with wonderful Lemonciello for desert.  ", "We had to get home unfortunately, but had we not, we would have been happy to stay there and close it down:)  ", "The owner Maurizio took several photographs with us in front of his beautiful Fiat that sits in front of his restaurant that has a picture of the Mona Lisa air-brushed on the hood of his car.  ", "What an amazing ending to a wonderful day.  ", "We HIGHLY RECOMMEND TO ALL,  ", "when in North Beach in San Francisco, or in San Francisco at all, you just have to stop at the Mona Lisa Restaurant for a drink, a meal, or of course both for a truly UNFORGETTABLE EXPERIENCE!!!!!Questo è ", "un meraviglioso di un ristorante di gentile ", "e sempre otterrà ", "un punteggio ", "di cinque stelle da noi sempre!!! ", "Grazie a tutti e saluti a tutti."], "author": "John A.", "review": "Wow, this place is amazing!!!  My Cousin and I came here for dinner after a long day of shopping in Chinatown because she had been here before with my Aunt.  The traditional Italian dinner we had (3 hours) was something amazing!   The owner treated us like his closest friends or even family, and mad us feel very at home.  He spoke to my Aunt on the phone and they had a very nice conversation in Italian, after which we were served a wonderful 3 tiered tray of antipasto, complete with calamari, brochetta, prosciutto with melon, fresh wonderful parmigiano regiano, fresh basil and arugula, and a marvelous dipping sauce for the calamari....and that was just for starters. The owner brought us a wonderful bottle of Chianti Classico,which was delicious, and then the main courses.  My Cousin had the Bistecca with fresh porcini mushrooms cooked medium rare, and I had the Vitello Mona Lisa (Veal Mona Lisa), and they were both absolutely wonderful. We finished off the meal with wonderful Lemonciello for desert.  We had to get home unfortunately, but had we not, we would have been happy to stay there and close it down:)  The owner Maurizio took several photographs with us in front of his beautiful Fiat that sits in front of his restaurant that has a picture of the Mona Lisa air-brushed on the hood of his car.  What an amazing ending to a wonderful day.  We HIGHLY RECOMMEND TO ALL,  when in North Beach in San Francisco, or in San Francisco at all, you just have to stop at the Mona Lisa Restaurant for a drink, a meal, or of course both for a truly UNFORGETTABLE EXPERIENCE!!!!!Questo è un meraviglioso di un ristorante di gentile e sempre otterrà un punteggio di cinque stelle da noi sempre!!! Grazie a tutti e saluti a tutti.", "rating": 5, "date": "2013-09-26"}], "vitello palermo": [], "vitello pistacchio": [], "la voce del mare": [{"excerpts": ["If you eat seafood we definitely recommend La Voce del Mare - we cleaned the plate and made sure every ounce of the sauce was gone by using the bread to soak it up!"], "author": "Brittany G.", "review": "What a great evening! We went to Mona Lisa for the first time and had the best evening.\n\nTurns out my husband and the owner are from the same town in Calabria, and we ended up having so much fun talking with everyone at the restaurant the entire evening. \n\nIf you appreciate/love the experience of dining in Italy -- this place makes you feel like you're there! The music, the atmosphere, the people -- so fun!\n\nIf you eat seafood we definitely recommend La Voce del Mare - we cleaned the plate and made sure every ounce of the sauce was gone by using the bread to soak it up!", "rating": 5, "date": "2014-11-06"}], "crab cioppino alla rumano": [], "mixed seafood grill": [{"excerpts": ["I had the mixed seafood grill (the swordfish could have been a tad thicker as it was too dry once I got to it from the hot plate) and my friend had the penne with gorgonzola sauce and chicken. ", "Passed on the wine and desserts as I am not a huge fan of alcohol or mid day sweets but aside from it having very small tables (for two) it was an amazing 1st experience. ", "I would happily return."], "author": "Bella B.", "review": "I was brought here by a friend who is a regular at this spot and I can totally see why! The service is good, food is great and lots of options. I had the mixed seafood grill (the swordfish could have been a tad thicker as it was too dry once I got to it from the hot plate) and my friend had the penne with gorgonzola sauce and chicken. Passed on the wine and desserts as I am not a huge fan of alcohol or mid day sweets but aside from it having very small tables (for two) it was an amazing 1st experience. I would happily return.", "rating": 4, "date": "2013-05-06"}], "gamberoni e cozze alla san marino": [], "gamberoni al guazzetto": [], "salmone al salmoniglio": [], "salmone con gamberoni alla crema": [], "salmone al cartoccio": [], "pesce spada": [], "branzino alla puttanesca": [], "branzino impanato": [], "salmone con asparagi": [], "calamari alla siciliana": [], "sogliola": [], "parmigiana di melanzane": [{"excerpts": ["After pouring over the menu (because it has multiple pages all in phrases like \"Eggplant -insert italian word here that Blair doesn't know-\") I finally decided on the Parmigiana di Melanzane. ", "I was BLOWN AWAY by how insanely delicious this dish was! "], "author": "Blair A.", "review": "Let me start off this review by saying that I am from Texas. Austin, Texas to be exact. When I walk into any restaurant I expect to be greeted warmly, chatted up by the waiter (usually), and then left the hell alone to enjoy my meal. It is the Austin way. \n\nI was in town for some training and a colleague and I, on recommendation of another colleague, stumbled to Mona Lisa for dinner. I'm a creature of habit when it comes to masticating my food, and whenever I'm in an italian restaurant I'll scarf down on Eggplant ANYTHING.\n\nAfter pouring over the menu (because it has multiple pages all in phrases like \"Eggplant -insert italian word here that Blair doesn't know-\") I finally decided on the Parmigiana di Melanzane. I was BLOWN AWAY by how insanely delicious this dish was! All it was seemed to be thinly sliced eggplant delicately layered across each other to form a bit of a dome, then a divine marinara sauce was covered with Parmesean and Mozzerella strewn throughout. \n\nI say, \"All it seemed to be\", but let me tell you, dear yelpers, that it was enough! My face about exploded in happiness. The tanginess of the sauce combined with the tenderness of the eggplant and creaminess of the cheese seriously transported me to Italy. Our waiter was incredibly sincere and nice, and the doorman had quite the crush on my colleague and gave her his personal \"calling card\" with his crazy italian accent at the end of the night. Dinner AND a show? I'll take it!\n\nLike I said, I live in Texas and I've legitimately thought about hopping on a plane back to SF to have a taste of this dish again. Weird? You betcha. But I'm from Austin and that's kind of our slogan!", "rating": 5, "date": "2011-09-02"}], "involtini di melanzane con ricotta": [], "spaghetti cacio e pepe": [], "spaghetti aglio e olio": [{"excerpts": ["The waiter was prompt with our order and we decided to get the Spaghetti Aglio e olio and the Penne Salsa Rosa. ", "They served us some bread and butter while we waited for our food, and we got to people watch until our food arrived. ", "My Penne Salsa Rosa was amazing", ", it tasted just how I had imagined it. ", "My friend liked his as well ", "but he said it was a little too oily for him. ", "I could only finish 3/4 of it because I had eaten a few hours prior. ", "I wish I had more room "], "author": "Saralee C.", "review": "Mmmmmmmmona Lisa, I miss thee.\nWalked around all the Italian places nearby before finally deciding on this one. It was a Thursday night and this place was super busy. Asked the dude in the front how long the wait was and he said he had some tables for two. We decided to sit outside although I kinda wish we would have sat inside to check out the decor. \n\nThe waiter was prompt with our order and we decided to get the Spaghetti Aglio e olio and the Penne Salsa Rosa. They served us some bread and butter while we waited for our food, and we got to people watch until our food arrived. My Penne Salsa Rosa was amazing, it tasted just how I had imagined it. My friend liked his as well but he said it was a little too oily for him. I could only finish 3/4 of it because I had eaten a few hours prior. I wish I had more room so I could have tried some dessert or at least finish my pasta :( . \n\nThe italian guy in the front kept talking to us in italian and according to my friend he kept saying to eat up, since we were both pretty stuffed with food still on our plates. The owners are really nice and warm with customers and the waiters are pretty attentive, or water was being filled up every 5 minutes. It took a while to get our check, but it was pretty busy and I didn't mind.\n\nLoved this place, want me some Sala Rosa.", "rating": 5, "date": "2009-08-15"}], "spaghetti al pesto": [], "spaghetti al pomodoro": [{"excerpts": ["My friends got the Spaghetti al Pomodoro (it was just regular spaghetti with marinara sauce..nothing special) and a gnochhi dish (a bit heavy if you ask me). ", "It seems like the small portions aren't enough but it is because they also give you bread dipped in olive oil/balsamic vinegar."], "author": "Kayla K.", "review": "I like this place a lot! The service was superb! I came here with a 2 of my girlfriends after a long day in the city. The neighborhood is in Little Italy..not exactly too appealing at night. It's very crowded, and busy so be aware. The man who sat outside (I believe he was the manager) was sitting us, and he was very friendly. He gave us a free appetizer on the house; he was sweet and welcomed us in right away.\n\nWhen you enter the restaurant, it's heavy and very decorative. I felt like I was literally in Italy. You can see many pictures of celebrities and their autographs along the walls. I guess this place is pretty famous? The tables are all super squished together so if you stand up, you're probably standing in the way of the waiters. By the way, the employees treated us so nicely..double tip for them!\n\nThe menu contains around 300 different dishes so you can't really pick a \"favorite.\" We actually asked the waiter for help, and he answered that there's too many to name. it really depends on your taste buds. I got the Penne Salsa Rosa and the sauce was very savory. It contained bits of tomato inside, and it's even better with the cheese that the waiter puts on top. My friends got the Spaghetti al Pomodoro (it was just regular spaghetti with marinara sauce..nothing special) and a gnochhi dish (a bit heavy if you ask me). It seems like the small portions aren't enough but it is because they also give you bread dipped in olive oil/balsamic vinegar.", "rating": 4, "date": "2011-09-10"}], "penne salsa rosa": [{"excerpts": ["We decided to try the penne salsa rosa and lasagna vegetale. ", "Overall the food was just okay. ", "The penne pasta barely had any sauce and lacked taste. ", "The lasagna lacked taste as well except for the spinach taste. ", "I just wish it had more of a ricotta flavor I was looking for.\n", "Other than that, the service was amazing as the server was attentive and very nice. "], "author": "Jasmine H.", "review": "I was walking down the street with my friends trying to find an Italian Restaurant with a lot of options and this place did not disappoint. \nThe owner quickly came up to us and was super sweet so we decided to give this place a try! The decor was homey and very inviting with picture frames and busts everywhere. We decided to try the penne salsa rosa and lasagna vegetale. Overall the food was just okay. The penne pasta barely had any sauce and lacked taste. The lasagna lacked taste as well except for the spinach taste. I just wish it had more of a ricotta flavor I was looking for.\nOther than that, the service was amazing as the server was attentive and very nice. The owner gave us a free appetizer of bruschetta which wasn't bad at all. \n\nI don't know if I would come back but the only reason I would come back would be for the decor and the amazing people who run the place!", "rating": 3, "date": "2017-08-31"}, {"excerpts": ["I got the Penne Salsa Rosa and the sauce was very savory. ", "It contained bits of tomato inside, and it's even better with the cheese that the waiter puts on top. "], "author": "Kayla K.", "review": "I like this place a lot! The service was superb! I came here with a 2 of my girlfriends after a long day in the city. The neighborhood is in Little Italy..not exactly too appealing at night. It's very crowded, and busy so be aware. The man who sat outside (I believe he was the manager) was sitting us, and he was very friendly. He gave us a free appetizer on the house; he was sweet and welcomed us in right away.\n\nWhen you enter the restaurant, it's heavy and very decorative. I felt like I was literally in Italy. You can see many pictures of celebrities and their autographs along the walls. I guess this place is pretty famous? The tables are all super squished together so if you stand up, you're probably standing in the way of the waiters. By the way, the employees treated us so nicely..double tip for them!\n\nThe menu contains around 300 different dishes so you can't really pick a \"favorite.\" We actually asked the waiter for help, and he answered that there's too many to name. it really depends on your taste buds. I got the Penne Salsa Rosa and the sauce was very savory. It contained bits of tomato inside, and it's even better with the cheese that the waiter puts on top. My friends got the Spaghetti al Pomodoro (it was just regular spaghetti with marinara sauce..nothing special) and a gnochhi dish (a bit heavy if you ask me). It seems like the small portions aren't enough but it is because they also give you bread dipped in olive oil/balsamic vinegar.", "rating": 4, "date": "2011-09-10"}, {"excerpts": ["The waiter was prompt with our order and we decided to get the Spaghetti Aglio e olio and the Penne Salsa Rosa. ", "They served us some bread and butter while we waited for our food, and we got to people watch until our food arrived. ", "My Penne Salsa Rosa was amazing", ", it tasted just how I had imagined it. ", "My friend liked his as well ", "but he said it was a little too oily for him. ", "I could only finish 3/4 of it because I had eaten a few hours prior. ", "I wish I had more room "], "author": "Saralee C.", "review": "Mmmmmmmmona Lisa, I miss thee.\nWalked around all the Italian places nearby before finally deciding on this one. It was a Thursday night and this place was super busy. Asked the dude in the front how long the wait was and he said he had some tables for two. We decided to sit outside although I kinda wish we would have sat inside to check out the decor. \n\nThe waiter was prompt with our order and we decided to get the Spaghetti Aglio e olio and the Penne Salsa Rosa. They served us some bread and butter while we waited for our food, and we got to people watch until our food arrived. My Penne Salsa Rosa was amazing, it tasted just how I had imagined it. My friend liked his as well but he said it was a little too oily for him. I could only finish 3/4 of it because I had eaten a few hours prior. I wish I had more room so I could have tried some dessert or at least finish my pasta :( . \n\nThe italian guy in the front kept talking to us in italian and according to my friend he kept saying to eat up, since we were both pretty stuffed with food still on our plates. The owners are really nice and warm with customers and the waiters are pretty attentive, or water was being filled up every 5 minutes. It took a while to get our check, but it was pretty busy and I didn't mind.\n\nLoved this place, want me some Sala Rosa.", "rating": 5, "date": "2009-08-15"}], "penne ai quattro formaggi": [], "ravioli ai quattro formaggi": [{"excerpts": ["The sauces were tasty and I especially liked my \"Ravioli ai Quattro Formaggi\": creamy and rich. "], "author": "Lindsay H.", "review": "The plan was to walk through North Beach and find a neat little Italian restaurant for dinner. With a mini wooden Italian car parked outside and every inch of wall space inside covered in Italian paraphernalia, this place is definitely quirky and what we were looking for.\n\nDespite the cramped seating, the service was great. The temp inside was insanely hot; halfway through the meal they finally turned the AC on. \n\nAlthough the bread came out cold and bland, the rest of the food was delicious. And the portions were just perfect, so four out of five cleaned their plates. Three types of ravioli were ordered; I thought it was cool that they were all different shapes. My chef friend was disappointed that the ravioli was not fresh made and was instead from the freezer (detectable by a tough freezer-burned piece). Interestingly, the menu only listed \"homemade\" next to a couple of the ravioli dishes (including mine). The sauces were tasty and I especially liked my \"Ravioli ai Quattro Formaggi\": creamy and rich. I added Italian sausage, which probably would have worked better in a red sauce, but I needed my meat.\n\nPrices were pretty high, especially if some of the dishes are actually defrosted and served. Pasta is cheap and easy to make, so I don't really think the high prices are warranted.", "rating": 3, "date": "2012-08-15"}, {"excerpts": ["For lunch I ordered the Ravioli ai Quattro Formaggi. ", "The four cheese sauce was so good, but very rich. "], "author": "Liz M.", "review": "My friend was craving pasta so we decided to try Mona Lisa. We were quickly greeted and seated outside. It was a little cramped for parties larger than 2 on the front patio, but a nice atmosphere and view of the neighborhood. \n\nThe menu is large, so there is something for everyone here. To drink I ordered the house wine, which wasn't bad, but a bit pricey at $7.50 a glass. \n\nFor lunch I ordered the Ravioli ai Quattro Formaggi. The four cheese sauce was so good, but very rich. I ate half the dish and most of the four cheese sauce to dip the bread they bring the table (which was dry).\n\nOverall good food, but a little pricey for a casual lunch.", "rating": 3, "date": "2012-11-08"}], "ravioli crema di noci": [{"excerpts": ["He also had the Ravioli Crema di noci and appeared to have enjoyed every bite, although he was beginning to get full at this point.  ", "He did not finish his serving.\n", "I had the Gnocchi al Pomodoro w/Shrimp; the sauce and the gnocchi were cooked perfectly.  ", "Albeit, I would've enjoyed a couple more shrimps.  "], "author": "Rico M.", "review": "Last night was the 2nd time my husband and I came to Mona Lisa; we're glad we came.  Upon getting seated, we mentioned to our waiter, who was very attentive, we had a Restaurant.Com certificate.  Likewise, we told him we had very little time for dinner due to an event we had to be within 45 minutes.  He ensured we got served immediately and was very considerate.\n\nFor starters we had some wine and Calamari Fritti for appetizer -- very good and cooked perfectly and the marinara sauce was wonderful!\nMy husband had the Minnestrone and he said it was amazingly good.  \nHe also had the Ravioli Crema di noci and appeared to have enjoyed every bite, although he was beginning to get full at this point.  He did not finish his serving.\nI had the Gnocchi al Pomodoro w/Shrimp; the sauce and the gnocchi were cooked perfectly.  Albeit, I would've enjoyed a couple more shrimps.  I didn't finish my plate, neither and requested to take our leftovers home.\n\nWe couldn't leave without trying their Tiramisu and we were not disappointed.  My husband had a latte and he said is absolutely made perfectly.\n\nWe had a positive experience at Mona Lisa and will definitely return for more.", "rating": 4, "date": "2010-06-13"}], "ravioli al pomodoro": [], "ravioli agli asparagi": [], "ravioli alla zucca": [{"excerpts": ["The Spaghetti all' Amatriciana is not to be missed ( Pancetta, Onions, Parmesan and an incredible simple tomato base) nor is the Ravioli alla Zucca (Pumpkin stuffed ravioli with a brown butter sage sauce) \n\nIt;s hard to NOT like this place. "], "author": "ken s.", "review": "Old School, Old School, Old School. Great Old Restaurant with a cool ambiance. I make it there every trip to the Bay Area. There is a great table up in front. The place is shaped like a slice of pie with the point facing the street, there is a table in the tip of the point that offers good street views, and some relief from the crush of customers. (they are generally slammed) The Menu is quite large, with an incredible assortment. The wine menu is similarly large. The Spaghetti all' Amatriciana is not to be missed ( Pancetta, Onions, Parmesan and an incredible simple tomato base) nor is the Ravioli alla Zucca (Pumpkin stuffed ravioli with a brown butter sage sauce) \n\nIt;s hard to NOT like this place. Actual Italians making Italian food, just imagine it.", "rating": 4, "date": "2010-02-01"}, {"excerpts": ["I usually go with the ravioli alla zucca (pumpkin ravioli in butter sauce) or the four cheese gnocchi.  ", "These are serious meals and sometimes I feel like I need to be rolled out of the place on a handtruck.  ", "Their wine selection is nice--", "I like the chiantis the best.  ", "Last time we were there, the glorious server brought us a huge plate of appetizers--", "we're talking bruschetta, olives, salame and margherita salad--on the house.  ", "ON THE HOUSE.  ", "The service is incredible (even if you aren't a pretty girl) and even though there are a lot of tourists, it's totally bearable."], "author": "Sarah H.", "review": "My old roommate and I go here for date nights.  The servers are so sweet and recognize us when we walk in the door. (\"Bella regatza!\")  We love the little two-person table in the corner looking out onto Columbus.  \nMy roommate always gets the chicken piccata, which is f-ing incredible.  I usually go with the ravioli alla zucca (pumpkin ravioli in butter sauce) or the four cheese gnocchi.  These are serious meals and sometimes I feel like I need to be rolled out of the place on a handtruck.  Their wine selection is nice--I like the chiantis the best.  Last time we were there, the glorious server brought us a huge plate of appetizers--we're talking bruschetta, olives, salame and margherita salad--on the house.  ON THE HOUSE.  The service is incredible (even if you aren't a pretty girl) and even though there are a lot of tourists, it's totally bearable.", "rating": 4, "date": "2007-03-19"}, {"excerpts": ["Ravioli alla Zucca is pretty much AMAZING! ", "Stick with pasta -- steak and chicken dishes have been good but not as wonderful as the pasta. ", "Gorgonzola cream sauce- lovely! ", "Gnocchi al pomodoro also a classic fave. ", "Service is slow, wait sometimes long, but always worth it. ", "I always check to see how clean my dishes are."], "author": "Angela H.", "review": "My favorite North Beach restaurant. Ravioli alla Zucca is pretty much AMAZING! Stick with pasta -- steak and chicken dishes have been good but not as wonderful as the pasta. Gorgonzola cream sauce- lovely! Gnocchi al pomodoro also a classic fave. Service is slow, wait sometimes long, but always worth it. I always check to see how clean my dishes are.", "rating": 5, "date": "2008-12-28"}], "ravioli spinaci e ricotta": [], "ravioli di porcini": [{"excerpts": ["I had the Ravioli Di Porcini, finger licking. ", "My husband and son in law had risotto. ", "One had Risotto Di Porcini and the other chicken Risotto. ", "I am looking forward to my next visit to the"], "author": "Judith B.", "review": "We visited this place with our daughter and her husband on our last day in San Francisco. I felt in love with the food! I had the Ravioli Di Porcini, finger licking. My husband and son in law had risotto. One had Risotto Di Porcini and the other chicken Risotto. I am looking forward to my next visit to the", "rating": 5, "date": "2018-06-02"}], "tortellini ai quattro formaggi": [], "gnocchi ai pomodoro": [], "gnocchi sorrentina": [{"excerpts": ["The Pesto, the gorgonzola, and even the Gnocchi Sorrentina (the tomato sauce based gnocchi) is great! ", "The staff are friendly and the atmosphere is fun. \n", "Thank you Ristorante Mona Lisa!"], "author": "Rachel M.", "review": "This review is for the most amazing Gnocchi I have had in a very long time! My husband and I live in Fremont and drive in to the city, just to have this Gnocchi. We have even ordered it on take-out and reheated it a few hours later. It was still AMAZING! Light, melt in your mouth, gnocchi! We've tried all the different sauces they have to offer and they are all yummy! The Pesto, the gorgonzola, and even the Gnocchi Sorrentina (the tomato sauce based gnocchi) is great! The staff are friendly and the atmosphere is fun. \nThank you Ristorante Mona Lisa!", "rating": 5, "date": "2016-11-20"}, {"excerpts": ["Gnocchi Sorrentina with fresh mozzarella was excellent. ", "Gnocchi was perfect and the sauce was delicious. ", "The Macara (cheese ravioli, meat and veggie cannelloni were good too."], "author": "A A.", "review": "Gnocchi Sorrentina with fresh mozzarella was excellent. Gnocchi was perfect and the sauce was delicious. The Macara (cheese ravioli, meat and veggie cannelloni were good too.", "rating": 4, "date": "2014-07-09"}, {"excerpts": ["i had lunch on friday with my work husband and inhaled my gnocchi sorrentina. ", "husband had something chickeny, which looked mighty tasty, but i didn't dare snag a bite. ", "the service was great and we were in and out in no time flat! ", "it's a good thing i'm still on the no-booze thing", ", otherwise i'm fairly certain i would have ordered a couple bottles of wine and would have been a total mess walking back tot ", "he office! ", ":o"], "author": "Kristin Y.", "review": "DANG this place still pleases me after all these years!! it could be the semi-cute staff that flirts with me in italian, or that their food is de-lish. ;) i'm thinking it's the man ass. \n\ni had lunch on friday with my work husband and inhaled my gnocchi sorrentina. husband had something chickeny, which looked mighty tasty, but i didn't dare snag a bite. the service was great and we were in and out in no time flat! it's a good thing i'm still on the no-booze thing, otherwise i'm fairly certain i would have ordered a couple bottles of wine and would have been a total mess walking back tot he office! :o", "rating": 4, "date": "2008-08-04"}], "penne silana alla cosentina": [], "gnocchi ruggero": [{"excerpts": ["Gnocchi Ruggero - 16.95 - I had this. ", "It was gnocchi with gorgonzola cheese sauce, walnuts and spinach -- HEAVEN! \n", "Gnocchi Fondenti - 14.95 ", "- Baked four cheese-cream sauce with nutmeg. ", "For some reason the baked dish seemed to come in a smaller portion. ", "My friend had asked about sharing this with her husband, and the waiter rightly recommended against it. ", "However, my portion for the Ruggero was definitely enough to have been shared. \n"], "author": "Cara S.", "review": "After spending lots of time Yelping for the perfect Italian restaurant to take friends the night before our wedding, I decided to wait until I made the trip from Houston. \n\nOur hotel turned out to be walking distance, a mile or so away from Mona Lisa, so on many walks about town we passed the place. I was worried because it looked small and we were going to have seven people. When a gentleman from the restaurant approached me outside one day, I asked if that was OK and if we could make a reservation. He said it would not be a problem, and gave me his business card. The next day I called and made the reservation. I ended up having to change it to eight people, and they were still able to accommodate us. \n\nThe pace of the meal was great; the service was adequate but not above and beyond; but the food? Absolutely amazing! I have been home for a few days and I'm still thinking about it! I will definitely go back next time I visit San Francisco. \n\nHere's a list of some things my party ordered, and I will also post pics:\n\nAppetizers:\nCalamari Fritti - 13.95\nTomatoes Caprese - 12.95\n\nDinners:\nTortellini al Gongorzola - 13.95 - My vegetarian friend ordered this, although there are lots of vegetarian options. I went with the gnocchi but this one tasted great too! Everyone wanted to taste everything so there was a lot of sharing taking place. \nGnocchi Ruggero - 16.95 - I had this. It was gnocchi with gorgonzola cheese sauce, walnuts and spinach -- HEAVEN! \nGnocchi Fondenti - 14.95 - Baked four cheese-cream sauce with nutmeg. For some reason the baked dish seemed to come in a smaller portion. My friend had asked about sharing this with her husband, and the waiter rightly recommended against it. However, my portion for the Ruggero was definitely enough to have been shared. \nRavioli Aragosta - 16.95 - Lobster in tomato cream sauce. Two in my party ordered this and I had a couple bites. It was also fantastic. \n\nWe skipped dessert because we were off to Ghirardelli for ice cream, which I'll probably Yelp next. Definitely try the gnocchi or ravioli if you go -- Mona Lisa does it right!\n\nWhy not five stars? The place only has beer and wine, and for beer Peroni hardly counts. Sorry. I did have an Anchor Steam, though. Can't go wrong with that. I did wish they had some fancy pre-dinner mixed drinks or martinis, though. Also, the waiter said it would be a $3 refill for sodas. I don't know if we were not charged after all because my party really wasn't happy with that and they might've overheard, but yeah, that's just kind of ridiculous if that rule is actually enforced.  Lucky for us, it wasn't. \n\nTo address some other minor complaints from fellow Yelpers, I found the decor cheesy yet entertaining. It made the place fun. As for the space issue it's San Francisco. Every restaurant I've been to there has tables close together you just sort of have to deal; at least they took our reservation and hooked us up with a nice long table in the back.\n\nThe Verdict: Just thinking about that gnocchi makes my mouth water. I can't wait to go back.", "rating": 4, "date": "2010-04-28"}, {"excerpts": ["I ordered the Gnocchi Ruggero (Gorgonzola sauce with spinach and walnuts) ", "w/ sausage and loved it. ", "My BF ordered the Ravioli Bolognese (cheese ravioli w/ tomato meat sauce), which was also very tasty. ", "The waiter was really friendly and helpful. ", "Overall a very good experience.  ", "I would go back."], "author": "Nicole W.", "review": "My BF and I went to the Mona Lisa for a late lunch on President's day and was pleasantly surprised. The food was pretty good. We ordered the Sautee di Cozze e Vongole (clams and mussels in garlic and tomato sauce), which was really good. I ordered the Gnocchi Ruggero (Gorgonzola sauce with spinach and walnuts) w/ sausage and loved it. My BF ordered the Ravioli Bolognese (cheese ravioli w/ tomato meat sauce), which was also very tasty. The waiter was really friendly and helpful. Overall a very good experience.  I would go back.", "rating": 4, "date": "2009-02-17"}], "lasagna vegetale": [{"excerpts": ["We decided to try the penne salsa rosa and lasagna vegetale. ", "Overall the food was just okay. ", "The penne pasta barely had any sauce and lacked taste. ", "The lasagna lacked taste as well except for the spinach taste. ", "I just wish it had more of a ricotta flavor I was looking for.\n", "Other than that, the service was amazing as the server was attentive and very nice. "], "author": "Jasmine H.", "review": "I was walking down the street with my friends trying to find an Italian Restaurant with a lot of options and this place did not disappoint. \nThe owner quickly came up to us and was super sweet so we decided to give this place a try! The decor was homey and very inviting with picture frames and busts everywhere. We decided to try the penne salsa rosa and lasagna vegetale. Overall the food was just okay. The penne pasta barely had any sauce and lacked taste. The lasagna lacked taste as well except for the spinach taste. I just wish it had more of a ricotta flavor I was looking for.\nOther than that, the service was amazing as the server was attentive and very nice. The owner gave us a free appetizer of bruschetta which wasn't bad at all. \n\nI don't know if I would come back but the only reason I would come back would be for the decor and the amazing people who run the place!", "rating": 3, "date": "2017-08-31"}], "manicotti homemade": [], "gnocchi ai quattro formaggi": [{"excerpts": ["Dining companions enjoyed the Gnocchi ai Quattro Formaggi - 14.95\n(four cheese-cream sauce) and the pizza Calabrese - 13.95\n(Garlic, tomatoes, oregano, sausage, cheese)"], "author": "Thomas D.", "review": "I finally had a chance to visit Mona Lisa Restaurant for lunch.  I enjoyed the service and the ambiance very much.\n\n  The food was so-so.  There was nothing that really stood out as an original inspiration--I had the  Rigatoni Alla Borrelli - 15.95\n(baked rigatoni with sausage and eggplant in tomato meat sauce)\nThis was a bit tasteless even though it included sausage.  It was also oily.  The rigatoni did not taste homemade.  It was overcooked and looked like it could have been leftover from the day before.\n\nThe beef carpaccio that we started things off with was good--very true to its Italian roots with arugula, capers, lemon wedges and pecorino cheese.\n\nDining companions enjoyed the Gnocchi ai Quattro Formaggi - 14.95\n(four cheese-cream sauce) and the pizza Calabrese - 13.95\n(Garlic, tomatoes, oregano, sausage, cheese)", "rating": 3, "date": "2011-11-05"}], "risotto al nero di seppia e capesante": [], "risotto allo scoglio": [{"excerpts": ["My favorite dish is the risotto allo scoglio, a beautiful looking dish, perfectly cooked with amazing seafood. ", "Maurizio will likely surprise you with complimentary appetizers and those are just amazing! ", "Portions are abundant and you'll feel full but ", "you have to try the tiramisu as well, ", "probably the best I've ever had!"], "author": "Massimo C.", "review": "I go to Mona Lisa every time I want to have the best possible Italian experience in SF. It all starts with Maurizio greeting you at the door with some of his jokes, then if you sit outside you have a beautiful view on the heart of North Beach and if you're inside you're surrounded by all sorts of colorful decorations and pictures of the many international celebrities who have been there. The menu is great, you'll always find what you're craving for in there, and the food is fresh, tasty and authentic. My favorite dish is the risotto allo scoglio, a beautiful looking dish, perfectly cooked with amazing seafood. Maurizio will likely surprise you with complimentary appetizers and those are just amazing! Portions are abundant and you'll feel full but you have to try the tiramisu as well, probably the best I've ever had!", "rating": 5, "date": "2015-09-08"}, {"excerpts": ["Nuff said...\n\nRisotto allo Scoglio (Seafood risotto made with a white sauce):  Very bland flavor.  "], "author": "Suzi K.", "review": "Where's that 1/2 star when you need it?  2.5 stars for this Italian joint.  I would've rounded up but I paid good money for a meal and I didn't get anything in return.\n\nMe and the GF decided to have an adventurous Friday night.  Get totally wasted and walk around North Beach aka Lil Italy looking for some squid ink pasta for her.  We walked on and off the beaten path and ended up here, Mona Lisa Restaurant.\n\nFirst off, if you let someone sit outside on a fairly cold night, you should give them a discount.  I felt like I was an hour advertisement for this place since there was a lot of foot traffic and everyone and their mama was looking at our food.  \n\nOn to the food...\nGarlic bread:  It was basically the free bread that they gave but with butter and garlic.  It wasn't even soft and fresh.\n\nAntipasto Misto (meat n cheese appetizer):  The prosciutto was good.  Unfortunately, the meats were a bit cold.  Not so fresh cold cuts from the fridge? Probably.\n\nLingiuni al Nero di Seppie (squid ink pasta):  The GF was so disappointed.  The squid ink did not taste fresh at all.  She something along the lines of \"I didn't know you can get squid ink in a can.\" Nuff said...\n\nRisotto allo Scoglio (Seafood risotto made with a white sauce):  Very bland flavor.  The prawns were overcooked, had itsy bitsy clams, and I don't think I saw the mussels.\n\nNormally, being drunk lowers the bar for flavor in my food.  This place just did not satisfy that drunk hunger we had and everything was less than okay.  The best part of the meal:  It was Friday night and I was drunk. :)", "rating": 2, "date": "2011-10-08"}, {"excerpts": ["My dinner companions had the chicken saltimbocca, risotto allo scoglio,  gnocchi in pink sauce, fettuccine pescatore, and the chicken S. Marino. ", "If there was an award for second best dish at the table it would go to the S. Marino. ", "It is rolled chicken breast with mozzarella and ham in a tomato-cream sauce, incredible flavors & texture. ", "Even though no one at the table needed another bite of food, it wouldn't have been complete without dessert ", "so we shared a platter of tiramisu & bomba. ", "The tiny bite I managed to eat of the bomba was really good. ", "Our waiter was friendly, attentive, patient, and spot on when helping choose menu items. "], "author": "Elizabeth C.", "review": "We started with a couple of sampler platters. From the calamari to the bruschetta, to the prosciutto with melon, everything was scrumptious. There was a great seasoning on the calamari and they don't skimp on the prosciutto. I had the risotto alfredo & prawns. It was so rich it was ridiculous- in a good way. Truly the best risotto I've ever had. My dinner companions had the chicken saltimbocca, risotto allo scoglio,  gnocchi in pink sauce, fettuccine pescatore, and the chicken S. Marino. If there was an award for second best dish at the table it would go to the S. Marino. It is rolled chicken breast with mozzarella and ham in a tomato-cream sauce, incredible flavors & texture. Even though no one at the table needed another bite of food, it wouldn't have been complete without dessert so we shared a platter of tiramisu & bomba. The tiny bite I managed to eat of the bomba was really good. Our waiter was friendly, attentive, patient, and spot on when helping choose menu items. Another thing to mention about Mona Lisa is they have an adorable little car that is parked out front and a party of two can actually enjoy their meal from inside it if they choose. \n\nClick here for the full story & pictures:\nhttp://consumingcolumbus.blogspot.com/2012/12/mona-lisa-will-make-you-moan_29.html", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["and my boyfriend ordered the risotto allo scoglio (white wine sauce with clams, calamari, prawns and  mussles). ", "we were so full! "], "author": "toni b.", "review": "Mona Lisa is FANTASTIC!!! I took my parents here when they came into town for the day, and I made reservations for 6. When we got there we were the first ones, the chef presented us a complimentary platter overflowing of delicious prosciutto, salame, cheeses, tomatoes caprese! We ordered the calamari as an appetizer and it was as fresh as it gets. good dipping sauce too. I ordered the penne san francisco (tomoato cream sauce with asparagus and crab) and my boyfriend ordered the risotto allo scoglio (white wine sauce with clams, calamari, prawns and  mussles). we were so full! my parents had spaghetti al salmone and the chicken san francisco. great wine selection, attentive service (not too pushy, but know when you need a refill or the dessert menu!). I HIGHLY RECOMMEND THIS PLACE! GREAT SERVICE, GREAT FOOD, GREAT AMBIANCE, and parking is less than a block away in the structure by the police department. I'll definitely be going again :)", "rating": 5, "date": "2011-07-01"}], "risotto frutti di mare": [], "risotto forestiero": [], "risotto allo zafferano": [], "risotto san francisco": [{"excerpts": ["There are also dishes named after the City (Spaghetti San Francisco, Chicken San Francisco, and Risotto San Francisco). ", "Since this restaurant is on North Beach why ", "doesn't the restaurant name some of the dishes after North Beach? "], "author": "Gerald R.", "review": "NORTH BEACH EATING PART VIII: SOUTHERN CUISINE - COLUMBUS DAY\n\nI ate here at lunch today on Columbus Day. As my title stated I generalized the cuisine as southern cuisine. When I have been starting my North Beach adventure I would go to Italian restaurants trying to find specialized, regional cuisines. One of the major problems of trying to categorize the regional cuisine of the restaurant is the extensive menu. There are so many items on the list I was worried about the quality of each dish. In addition I couldn't what in the menu what the regional cuisine of this restaurant; the only reason I stated southern cuisine of this restaurant was because it stated on the Yelp information. Having quick lunch I needed to just one item, but I wasn't sure what item to ordered. It was either Fettuccine Mona Lisa or a risotto dish. I asked the waiter his recommendation about the risotto. He asked if I liked meat or seafood. I was thinking about the seafood. He went down the list to pick certain items. In the end I decided to order the Fettuccine Mona Lisa for one reason. In the past if a certain restaurant names a dish after its own restaurant name I'm assuming the dish is its specialty. That's why I ordered the Fettuccine Mona Lisa. \n\nAs mentioned before one of the reasons why this menu was confusing was because I couldn't tell what is their specialty. There are several items named after the restaurant (Fettuccine Mona Lisa, Chicken Mona Lisa, Pizza Mona Lisa, and Veal Mona Lisa). There are also dishes named after the City (Spaghetti San Francisco, Chicken San Francisco, and Risotto San Francisco). Since this restaurant is on North Beach why doesn't the restaurant name some of the dishes after North Beach? Lol.\n\nNow back to my only dish, which is the Fettuccine Mona Lisa. Two great things about this pasta is that the pasta is cooked al denta and the sauce is creamy but not heavy. One thing I didn't like about this pasta is it was quite salty due to the olives. Since the olives are cured having the olives with the ham makes dish quite salty. I would recommend either having the olives or ham alone in the pasta but not both. With abundance of items on the menu I feared that this dish would not maintain its quality. Other than the olives the pasta was quite tasty. \n\nEven though I only had the Fettuccine Mona Lisa today, I've eaten here before. The last time I ate here was about 10 years ago. I don't think the menu has remained the same but what I remembered was that the menu was very extensive that made it intimidating. What I ordered last time was the salmon, but there were so many different dishes of salmon I couldn't remember what I ordered. However I do remember the salmon was dry and overcooked. The fear of having too many items is some of the dishes won't be as good. Even though I've only eaten here twice in the last ten years my rating is based upon two items - a tasty Fettuccine Mona Lisa and a dry salmon. In a sense my rating is based on one word - consistency. With too many dishes consistency is hard to achieve. I feel if the restaurant cuts more than half of the dishes in the current menu I believe the quality of the food will be much better and consistency will be better achieved.", "rating": 2, "date": "2014-10-13"}, {"excerpts": ["I had the risotto San Francisco. ", "Amazing!! ", "My wife had the chicken piccata. ", "Amazing!! ", "Service, amazing!! ", "We will be back!"], "author": "Jeffrey S.", "review": "I had the risotto San Francisco. Amazing!! My wife had the chicken piccata. Amazing!! Service, amazing!! We will be back!", "rating": 5, "date": "2015-08-01"}], "risotto pescatore": [{"excerpts": ["Food (Caesar salad, risotto pescatore) was good.  ", "House Chianti was served almost warm.  ", "Open kitchen ", "so it was fun watching the staff."], "author": "Dwight A.", "review": "Very nice family run venue in SF's Italian district.  Extremely enthusiastic hostess & waitstaff.  Food (Caesar salad, risotto pescatore) was good.  House Chianti was served almost warm.  Open kitchen so it was fun watching the staff.", "rating": 4, "date": "2014-07-18"}, {"excerpts": ["I took their \"Risotto Pescatore\" with seafood... ", "it was tasty but apparently not French. "], "author": "caroline s.", "review": "I went to Mona Lisa restaurant yesterday. I was planning to give a 3 stars... but as soon as I got home I got sick. My stomach went upside down.\n\nI took their \"Risotto Pescatore\" with seafood... it was tasty but apparently not French. My stomach got crazy.\n\nMy boyfriend got the \"scampis del golfo\" and was really happy with it. The atmosphere is nice but I will not go back!", "rating": 1, "date": "2011-03-27"}, {"excerpts": ["So far i've only been able to try two of them:\n\nRisotto Sciolligo - seafood risotto in white wine sauce\n\nAND\n\nRisotto Pescatore - seafood risotto in tomato sauce\n\nAdventurous aren't I? "], "author": "Linh T.", "review": "This place has so many different risotto dishes, that there's an entire section for it on the menu! LOVE THE RISOTTO! So far i've only been able to try two of them:\n\nRisotto Sciolligo - seafood risotto in white wine sauce\n\nAND\n\nRisotto Pescatore - seafood risotto in tomato sauce\n\nAdventurous aren't I? Either way, both dishes are great, and i'm definitely planning on coming back and trying more of them, i haven't even looked at the pizza or pasta on the menu yet.\n\nAlso, this place truly truly has an italian feel to it, everyone from the host outside (who i swear was named, vinny, or tony) to our waiter (who i also swear was named vinny, or tony) was honest-to-goodness certified italian.  This is the kinda place, i would expect to see tony soprano hanging out in the back! MONA LISA'S ROCKS!", "rating": 4, "date": "2008-09-02"}], "risotto cacciatore": [], "risotto porcini": [{"excerpts": ["Risotto porcini wad excellent and highly recommended. ", "The choice of lambrusco they suggest was at the right temperature and refreshing for hot afternoon."], "author": "Benjamin P.", "review": "Best Italian cousine I had so far in San Francisco. I was actually walking for an early dinner in another restaurant, but saw the beautiful vintage car the restraint had set as additional table on the street and decided to stay. Risotto porcini wad excellent and highly recommended. The choice of lambrusco they suggest was at the right temperature and refreshing for hot afternoon.", "rating": 5, "date": "2016-09-25"}, {"excerpts": ["The risotto porcini (mushroom) was creamy and delicious. ", "Just the right amount of flavor from the broth. "], "author": "Dom L.", "review": "After reading some many yelp reviews, felt confident that this was going to be a pleasant experience. And it was. Overall the evening was a hit with my party of 7, with just a few minor negative points. After I polled my party, their grades ranged from B to B+, which totally agreed with.\n\nReservations at 8pm, got there a few minutes before and was immediately seated. Bread and water was quickly brought. Dinner napkins were placed in our laps. \n\nStarted with their Italian sampler. It had bruschetta, tomatoes caprese and roasted garlic. Everything was done fine, with fresh ingredients. We also had the fried calamari which was ok. Nicely fried although not much flavor, but it was ok. Soon afterward the manager/host decided to send a complimentary appetizer tray our way. Whatever the reasons - whether just being nice or it was a kitchen mistake that he wanted to give to us, I really appreciated the gesture, and it earned some major brownie points with me. The appetizer plate had some more bruschetta, some olives, some parm-reg cheese, and some prosciutto. I enjoyed the prosciutto and the rest, although the extra food really filled me up and left less room for the main courses!\n\nI ordered 5 entrees to share so we could all get a taste of more items.\n\nThe Spaghetti Carbonara (pancetta, eggs and cheese) was awesome. Perfectly cooked, creamy with a nutty/salty from the pancetta.\n\nThe Gnocchi Pomodoro (tomato sauce and basil) was my (and everyone else's) least favorite dish. Granted, I'm not a big gnocchi fan, but the times I've had very good gnocchi it was light and puffy. Here is was a bit doughy. But I'm the first to admit that gnocchi is not my favorite, so you might try it yourself and like it.\n    \nThe risotto porcini (mushroom) was creamy and delicious. Just the right amount of flavor from the broth. It was good, very good.\n\nThe chicken piccata was also pretty good. The chicken was moist and tender, and the potatoes and spinach on the side had very good flavor. My wife finished all the spinach and loved it. \n\nThe pizza Napoletana (basic with cheese/tomato/oregano/garlic) was done very well. Good crust and good flavor.\n \nService was friendly and efficient, especially the host. Waiter helped exchange plates, refilled water and was generally very effective. Only a few missteps:\nThe appetizers came in a quick manner, but the rest of the meal took a bit longer. Not 'look at watch several times and frown' long, but 'look at my watch and wondering' long. Also it took a long time to get my bill. I think they use an old, old credit card machine. Bread was served cold. A bit pricey. Yes a few minor gripes, but overall their ambiance, service and food will make me visit again.", "rating": 4, "date": "2010-07-23"}], "napoletana pizza": [{"excerpts": ["My husband had the Napoletana pizza and it was one of the best pizzas we've ever had. ", "The crust was buttery and flaky. \n", "We enjoyed it so much that we went back another night before we left San Francisco and the owner actually recognized us as we walked up! ", "He had an appetizer sent over to thank us for coming back again. ", "The experience was even better the second time, if that was even possible! ", "This restaurant feels like you're eating dinner with your family in Italy!"], "author": "Alison F.", "review": "I am a total foodie and I absolutely loved Mona Lisa! The service is impeccable from the moment you walk up and you're greeted by the owner, whom attempted to speak to us in Italian (which I absolutely loved) to the server that was extremely prompt and courteous. I also enjoyed the intimate atmosphere with eccentric decor and open kitchen to be able to watch the cooks prepare your food. They don't have food warmers, which is a refreshing change so your food will come as soon as it's prepared, hot and fresh!\nI ordered the lobster ravioli and you could tell by the texture that the pasta is homemade and the lobster is fresh! The sauce was creamy and just the right amount of herbs. My husband had the Napoletana pizza and it was one of the best pizzas we've ever had. The crust was buttery and flaky. \nWe enjoyed it so much that we went back another night before we left San Francisco and the owner actually recognized us as we walked up! He had an appetizer sent over to thank us for coming back again. The experience was even better the second time, if that was even possible! This restaurant feels like you're eating dinner with your family in Italy!", "rating": 5, "date": "2015-09-29"}], "don mario pizza": [{"excerpts": ["We ordered a Don Mario pizza, which notes sauce as the first ingredient in its description, and it literally arrived as in the photo - no sauce, entirely tossed, cold and hard. ", "We also ordered ravioli, which was undercooked. "], "author": "Niyati D.", "review": "This place is awful. As someone else noted below, their deliveries take way longer than estimated, and the food is not even worth the wait. We ordered a Don Mario pizza, which notes sauce as the first ingredient in its description, and it literally arrived as in the photo - no sauce, entirely tossed, cold and hard. We also ordered ravioli, which was undercooked. All of it was inedible.\n\nWhen we called the restaurant, they hung up on us. When GrubHub tried contacting them about our order, they didn't even pick up.\n\nGrubHub delivery guy said they only started preparing our order after I called about it being 30 mins late.\n\nEverything about my experience with this restaurant was totally awful.\n\nUpdate -- 2 weeks after not receiving an update about my refund request, I followed up with the restaurant and the man on the other end basically yelled at me and hung up on me. Customer service does not seem to be valued at this restaurant.", "rating": 1, "date": "2018-08-17"}, {"excerpts": ["P\n\nAlso had a bite of their meat spaghetti, lobster ravioli and Don Mario pizza. "], "author": "Annie D.", "review": "Decided to stop in here to have some dinner with friends. \n\nWe got seated pretty quickly on a Saturday night, place felt dark and a little clustered. \n\nWe wanted to start off with calamari, but they ran out...\nSo we got garlic bread and Antipasto Misto - mix of prosciutto crudo, salame, cheeses, olives and soppressata. Garlic bread was really garlicy, I had that taste in my mouth until the next day...it was still pretty tasty. The antipasto was pretty good, not that much meat of each, maybe 2 or 3 thin slices, but good to wet your pallet before dinner. \n\nLingiuni al Nero di Seppie - black squid linguini with calamari in white wine sauce- I've had this dish at other places, this one was ok, it was pretty blame and needed some more flavor, maybe more salt. I guess they had some squid left?! =P\n\nAlso had a bite of their meat spaghetti, lobster ravioli and Don Mario pizza. Those were all pretty tasty and everyone seemed to really enjoy their dishes. \n\nServices was pretty good, seemed too busy to come back and check on us.. we would have to wait or waive them down when we needed something. The food is decent for having so many choices up and down the street, I can't say it's the best, but maybe because my dish wasn't the best.", "rating": 3, "date": "2011-12-20"}], "calabrese pizza": [], "mona lisa pizza": [{"excerpts": ["Split the lobster ravioli and the signature Mona Lisa pizza. ", "I wasn't blown away with the pizza ", "but it was still delicious. ", "Loved the lobster ravioli though! "], "author": "Christina Y.", "review": "I give this place a solid 4 stars. My friend and I were exploring North Beach and decided to dine at one of the many Italian restaurants we passed by. Mona Lisa gave us a vibe we didn't get from the other restaurants. Plus, they had a car outside which you could dine in.\n\nSince it was such a beautiful day, we were seated outside so we could enjoy the weather and people watch. Split the lobster ravioli and the signature Mona Lisa pizza. I wasn't blown away with the pizza but it was still delicious. Loved the lobster ravioli though! I would have finished the entire dish if I hadn't had to share.\n\nExtra brownie points:\n-The server was extremely attentive, making sure we had clean plates, utensils, and our water was always full\n-The table next to us had ordered a salad which came out twice, and our server decided to let us have it rather than having it go to waste. The dressing was yum!\n\nI always question restaurants that are located on the big streets but Mona Lisa was delicious!", "rating": 4, "date": "2015-02-17"}, {"excerpts": ["I had a hard time deciding what I wanted but settled on the Ravioli al Quattro Formaggio (homemade ravioli in four cheese sauce) , Mona Lisa Pizza (Pepperoni, mushrooms, onions, peppers, cheese), and the Spaghetti and Meatballs (spaghetti and meatballs "], "author": "Tony R.", "review": "Of all the Italian restaurants in North Beach I chose to come to Mona lisa on an early friday evening, prior to going to the Giants game. The restaurant itself is kinda small and very intimate, the main kitchen is in the front of the restaurant, so you can see and hear as the chefs make your food.\n\nThe menu is a little intense, there is a very large selection of pastas, pizza, seafood, chicken, and beef, I felt like I was reading an Almanac. I had a hard time deciding what I wanted but settled on the Ravioli al Quattro Formaggio (homemade ravioli in four cheese sauce) , Mona Lisa Pizza (Pepperoni, mushrooms, onions, peppers, cheese), and the Spaghetti and Meatballs (spaghetti and meatballs lol). \n\nThe food didn't take too long to arrive, when it did at first my eyes were definitely bigger than my stomach, my plate had only 6 raviolis and was sure it was not gonna fill me up. The raviolis were really delicious, the However as I continued to eat them I became both full and unable to handle the taste. As delicious as they are, they are very rich and cheesy, It'd be good to get this if you were sharing with someone. The pizza was thin crust, crispy, tasty sauce and full of flavor from the veggies and meat, One of the pizzas is a good portion size, good for 2 people. The spaghetti and meatballs were okay, I mean the dish itself is pretty standard, a good spaghetti isn't gonna wow me that much. Overall I was very pleased with the food here, definitely will be a place I come back to again.", "rating": 4, "date": "2011-06-13"}, {"excerpts": ["We had the Mona Lisa Pizza,   Asparagus Ravioli,  Salmon White Sauce and the Lasagna ", "and it was fabulous.   ", "We will be back again and again.  ", "So worth it!!!! ", "Loved it!!!"], "author": "Camille F.", "review": "AWESOME! !!!  GREAT food.  We had the Mona Lisa Pizza,   Asparagus Ravioli,  Salmon White Sauce and the Lasagna and it was fabulous.   We will be back again and again.  So worth it!!!! Loved it!!!", "rating": 5, "date": "2014-11-29"}], "de luxe pizza": [{"excerpts": ["We had the De Luxe pizza and the arugula salad. ", "How can someone screw up pizza this bad (especially in SF). ", "The crust/dough was pathetic... ", "As for the salad it was just old.\n", "The so-so: ", "The service. ", "I withhold judgement since it was late on Thanksgiving."], "author": "Paul R.", "review": "The good: open late on Thanksgiving\nThe bad: the food. We had the De Luxe pizza and the arugula salad. How can someone screw up pizza this bad (especially in SF). The crust/dough was pathetic... As for the salad it was just old.\nThe so-so: The service. I withhold judgement since it was late on Thanksgiving.", "rating": 2, "date": "2014-11-28"}, {"excerpts": ["The pasta was under cooked and our De Luxe pizza was less than average."], "author": "Sumeet S.", "review": "I NEVER write reviews on Yelp, but for Mona Lisa, I had to. \n\nMy friend and I just ate here tonight, and if you know how to cook a box of pasta and throw any red sauce on, dont come here. \n\nI am no chef and can cook better food than here. \n\nWe got the Caprese salad. The tomatoes were flavorless, colorless beefsteak tomatoes and barely any basil. \n\nThe pasta was under cooked and our De Luxe pizza was less than average.", "rating": 1, "date": "2013-12-07"}], "stagioni pizza": [], "brigante pizza": [{"excerpts": ["My son had the Brigante Pizza and he liked it.   ", "Hubby got  a Antipasto Misto and a side of sausage.  ", "He said it was just okay.   \n", "The service wasn't anything special and it took a loooonnng time to get our check.   ", "It took so long that my husband just glanced at the check and paid it.  ", "Hopefully we didn't get any extra $$'s added to our bill like some of the other reviewers.   ", "Look for a better restaurant in ", "No. ", "Beach and skip this one."], "author": "Marla G.", "review": "While vacationing in S.F. we asked our taxi driver for a recommendation for Italian in No. Beach.  This is what he came up with.   Was busy on a Sunday night of a 3 day weekend.   But we were seated right away.   Big Menu/Big Selection.   I wasn't too hungry so I ordered Pesto Spagetti.  It was a good serving and it was just okay.   My son had the Brigante Pizza and he liked it.   Hubby got  a Antipasto Misto and a side of sausage.  He said it was just okay.   \nThe service wasn't anything special and it took a loooonnng time to get our check.   It took so long that my husband just glanced at the check and paid it.  Hopefully we didn't get any extra $$'s added to our bill like some of the other reviewers.   Look for a better restaurant in No. Beach and skip this one.", "rating": 2, "date": "2010-01-29"}], "pescatore pizza": [], "tonno  cipolla pizza": [], "calzone napoletana": [], "calzone al forno": [{"excerpts": ["we shared a Calzone al Forno; it was the best calzone I had in my whole life.. definitely different from the American calzone, as it was softer like a pastry crust filled w/ fresh Italian tomato sauce that teamed up w/ fresh mozzarella 2 soak in2 the stuffed prosciutto that gave the eater something that will eject them out of their seat n out of this world because it was so good.. "], "author": "Johnny L.", "review": "Thee Best Italian I have ever had!  Little Italy in San Fran is a must when ur roaming around CT (Chinatown)\n\nso the 1st time we came here, we heard thru a recommendation from a spice place nearby, as we were trying 2 find the best Italian restaurant 2 go 2 n thanks 2 him.. we found this place!  thank u thank u!\n\nthat 1st time we went, I had the salmon risotto in cream sauce; it was like HEAVEN!  man, y don't we have this in Seattle?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! yeah, it was that serious.. my wife had a gnocchi dish n she fell absolutely in love!!!\n\nthe day after our 1st visit, we went back n shared a pizza, I believe it was Calabrese which had oregano, sausage w/ full flavors of tomato n garlic, we may have added prosciutto.. it was really good!\n\neverything is good\n\nso many items 4 each form of pasta, just countless good stuff! on their menu\n\nthis 3rd time we went, we went 4 lunch n we shared a Calzone al Forno; it was the best calzone I had in my whole life.. definitely different from the American calzone, as it was softer like a pastry crust filled w/ fresh Italian tomato sauce that teamed up w/ fresh mozzarella 2 soak in2 the stuffed prosciutto that gave the eater something that will eject them out of their seat n out of this world because it was so good.. the only complaint will b if the inside was hot, since it was sitting @ the chef's counter 4 a little bit n cooled off\n\nthe service is consistently good\n\nthis place has a lot of photos of famous ppl who came here such as any1 from Derek Jeter 2 Martin Yan.. it is just that good since 1979! n the decor I bet has looked the same since then\n\njust the Best Italian, @ least on the West Coast.. that I can say", "rating": 5, "date": "2015-03-11"}], "calzone buonvicino": [], "childrens penne al pomodoro": [], "childrens penne alla bolognese": [], "childrens fettucine alfredo": [], "childrens spaghetti con polpette": [], "childrens rigatoni al pesto": [], "childrens pizza margherita": [], "childrens pizza pepperoni salame": [], "childrens penne salsa rosa": [], "ravioli nonna mia": [], "pinsa romana": []}