{"bundaberg": [{"excerpts": ["We ordered a vegetarian platter family style, to be split between the hubs and I. Along with a bottle of Bundaberg (who can say no to Bundaberg when it's right there!?). ", "And let me tell you, the only thing I thoroughly enjoyed during my meal, was the Bundaberg (and that came at a price too, $6 for a bottle. "], "author": "Ranjani S.", "review": "I don't know if it's my exceptionally high standards when it comes to Ethiopian food, or whether it's my multiple awesome experiences at Zeni in SJ that killed every other Ethiopian's restaurants experience, that makes me feel Moya leaves a lot to be desired.\n\nYeah, it isn't all that fancy, ergo, none of the Ethiopian decor flaff or a pianist belting out loud music while you dine (think Sheba). Moya is just your quintessential cafe that serves Ethiopian food on the side (or that's how I felt about the establishment)\n\nWe ordered a vegetarian platter family style, to be split between the hubs and I. Along with a bottle of Bundaberg (who can say no to Bundaberg when it's right there!?). And let me tell you, the only thing I thoroughly enjoyed during my meal, was the Bundaberg (and that came at a price too, $6 for a bottle. As you can see, I am still trying to come to terms with paying 2x for everything in the city) \n\nThe food was cold. The yellow peas, the red lentil stew were cold (and lacking flavor), the collard greens tasted a bit bitter than what I am used to. The cabbage/carrot/potato curry was phenomenal and the injera was sour to perfection. Saving grace was the injera. \n\nPrice wise, it was reasonable by SF standards. I just don't think I'll come back since it truly wasn't a memorable meal.", "rating": 2, "date": "2014-11-10"}], "fanta": [], "ayb": [{"excerpts": ["If it all wasn't savory enough, a side of ayb (Ethiopian cheese made from buttermilk) made it all quite a filling meal shareable between two. \n\n"], "author": "Vincent L.", "review": "The menu here is a bit more compact than many other Ethiopian places in the Bay Area, but maybe there's something to be said about keeping things simple. \n\nThe doro tibs (chicken breast marinated in white wine sauce and stir fried with onion, tomato, garlic, and berbere) were super tasty and well-portioned given the $11.50 price. They came with a good heap of decent injera. If it all wasn't savory enough, a side of ayb (Ethiopian cheese made from buttermilk) made it all quite a filling meal shareable between two. \n\nThe venue is compact but reasonably clean and bright, and grabbing a to-go order here was a breeze. The folks behind the counter were super sweet. Worth a shot if you're already in the area.", "rating": 4, "date": "2017-12-02"}, {"excerpts": ["We had the shuro, ye doro wat, kik alitcha, gomen, ayb (cheese), and ye bere tibs. ", "I liked the vegetarian dishes a lot - as usual, Ethiopian is the only way I like collard greens. ", "The ye doro wat was also phenomenal - their bere bere sauce is my personal favorite. ", "I think I would skip the beef next time, and I didn't find the shuro to be as amazing as everyone else does - it reminded me of the sauce from chicken tikka masala - not bad, just not interesting. "], "author": "Lisa K.", "review": "We started with the azifa appetizer (lentil w/ red onions, jalapeño, garlic, lemon, olive oil, and served w/ kita (homemade Ethiopian bread) or injera). Now that I think about it, I don't think we were offered a choice between kita and injera, but I think we got kita since it was different from the injera we had later in the meal. This appetizer was wonderful, although I didn't really think there was a large enough portion to split among five people.\n\nWe had the shuro, ye doro wat, kik alitcha, gomen, ayb (cheese), and ye bere tibs. I liked the vegetarian dishes a lot - as usual, Ethiopian is the only way I like collard greens. The ye doro wat was also phenomenal - their bere bere sauce is my personal favorite. I think I would skip the beef next time, and I didn't find the shuro to be as amazing as everyone else does - it reminded me of the sauce from chicken tikka masala - not bad, just not interesting. It seemed like there was a lot of salad around too, which was just ok.\n\nService was quite good, and a fair amount of that consisted of continual injera refills (greatly appreciated). I found the atmosphere to be rather sterile (is that why people keep calling it \"clean\"?), although it was filling up by 8:00 or so on a Tuesday evening.", "rating": 4, "date": "2010-11-29"}, {"excerpts": ["It was fairly spicy, but adding a little ayb (the cottage cheese served on the side) cut the spice nicely.  "], "author": "Dave H.", "review": "Moya had their soft opening tonight; grand opening is scheduled for next Monday.  I've been waiting for them to open for a while, as I live nearby.  I've been a fan of Ethiopian for a long time and was hoping they'd be at least a solid neighborhood option.\n\nTonight was my first visit and I'll be going back - and not just because it is convenient.  We had two dishes - the Ye Doro Wot (#25) - which is a chicken dish consisting of two drumsticks braised in a rich, dark sauce and the Kifto (#18), a fairly standard Ethiopian classic you can find most places.\n\nBoth were good and at different ends of the spice spectrum.  The ye do wot was our favorite of the two.  The meat was falling off the bone (in the best possible way) and came with a mild, gravy-like sauce and a hard-boiled egg. It reminded us of a mole - with complex, deep rich flavors.\n\nWe ordered the classic kifto the way they like to serve it - rare.  It was fairly spicy, but adding a little ayb (the cottage cheese served on the side) cut the spice nicely.  This was a solid dish, but I'll try the two other versions of kifto on the menu on future visits to figure out which is my favorite.\n\nThey topped of the meal with a few of the delicious Italian cookies from the nearby Dolce Italia cookie company (wholesale only at the moment, it appears.)  These were excellent!\n\nI really liked Moya and have hopes of it being a lasting addition to the neighborhood.  They stated they are hoping to set up a traditional Ethiopian coffee station in the near future, which should be awesome.  \n\nService was great - the owner's daughter waited on us and spent time telling us about the plans for the restaurant (all of which sound exciting.)  We met the owner as well - she was hard at work in the kitchen, but took time to say goodbye to us, which was nice!  \n\nThey lack a wine/beer permit at the moment, so there isn't much to cut the spiciness of the food (I'd love a beer!)  Its just starting, but it is off to a promising start in a neighborhood that has seen a plethora of great new places open.  If you're in this part of SOMA, it is worth a shot (and a great  value - entrees are about $15 each and are quite generous - well worth it!)", "rating": 4, "date": "2010-07-10"}, {"excerpts": ["The ye doro wot was also delicious, and even better when mixed with a little of the ayb (home made cottage cheese) as suggested by our server.\n\n"], "author": "Kelly M.", "review": "Everything about my experience at Moya was great.  This was the first Ethiopian I have had in the Bay area, but it is better than my other experiences, even when I was living in the DC area.  \n\nThe staff was very personable and spent time explaining how to eat Ethiopian as well as suggesting dishes to the people in my party who had not had Ethiopian before.  Our sever even explained some of the cultural significance of different dishes.  \n\nThe flavors were rich and not overpowered by heat.  The sauces had a great mixture of savory and spicy, and were not overly greasy.  The injera was fresh and of perfect consistency.  We started with the ye timatim fit fit, which was a fresh and lite salad, perfect for introducing those new to Ethiopian food to the injera.  The vegetarian combination was very good.  The gomen, collard greens, was a stand-out as far as the vegetarian dishes.  The Moya Special Kitfo was full of a great herbal flavor that I couldn't quite figure out.  The ye doro wot was also delicious, and even better when mixed with a little of the ayb (home made cottage cheese) as suggested by our server.\n\nThe interior is new and clean, with ample seating available when we arrived for an early dinner at 6:30pm.  The surrounding area is not very residential, so there was ample parking on the same block when we arrived.\n\nI am definitely excited to go back and sample more of their menu.  By interacting with the servers, cooks and owner, you can tell that they work hard to make delicious \"home-style\" Ethiopian food and very proud of the product.", "rating": 5, "date": "2010-08-30"}], "doro tibs": [{"excerpts": ["I got the doro tibs and it wasn't anything special. ", "I was expecting some sauce with the chicken but it was pretty bare. ", "Not spicy at all even though I asked for spicy. ", "I need to find a better Ethiopian place."], "author": "Lulu K.", "review": "Meh. I got the doro tibs and it wasn't anything special. I was expecting some sauce with the chicken but it was pretty bare. Not spicy at all even though I asked for spicy. I need to find a better Ethiopian place.", "rating": 3, "date": "2018-10-18"}, {"excerpts": ["The doro tibs (chicken breast marinated in white wine sauce and stir fried with onion, tomato, garlic, and berbere) were super tasty and well-portioned given the $11.50 price. "], "author": "Vincent L.", "review": "The menu here is a bit more compact than many other Ethiopian places in the Bay Area, but maybe there's something to be said about keeping things simple. \n\nThe doro tibs (chicken breast marinated in white wine sauce and stir fried with onion, tomato, garlic, and berbere) were super tasty and well-portioned given the $11.50 price. They came with a good heap of decent injera. If it all wasn't savory enough, a side of ayb (Ethiopian cheese made from buttermilk) made it all quite a filling meal shareable between two. \n\nThe venue is compact but reasonably clean and bright, and grabbing a to-go order here was a breeze. The folks behind the counter were super sweet. Worth a shot if you're already in the area.", "rating": 4, "date": "2017-12-02"}, {"excerpts": ["For the food itself, I had the doro tibs with brown rice, while my brother had the siga tibs with bread and mushrooms. ", "I tried both of them ", "and I couldn't decide which was better! ", "The service is fast and the food is good. ", "Will come back again!"], "author": "Michael Z.", "review": "Came in randomly and we were pleasantly impressed. The staff was friendly and it was easy to order. For the food itself, I had the doro tibs with brown rice, while my brother had the siga tibs with bread and mushrooms. I tried both of them and I couldn't decide which was better! The service is fast and the food is good. Will come back again!", "rating": 5, "date": "2018-05-07"}, {"excerpts": ["The Doro Tibs (chicken) was flavorful, with a small kick to the tastebuds. "], "author": "Nicole P.", "review": "This place is delicious! I ordered for lunch on a whim and it did not disappoint. The Doro Tibs (chicken) was flavorful, with a small kick to the tastebuds. The injera was perfect, light and spongy. My coworker loved the Siga Tibs (beef). I would definitely recommend and order again!", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["I ordered the doro tibs which was the marinated chicken breast. ", "The food tasted really good! ", "I'm not sure what some of the stuff even was ", "but I enjoyed it quite well. ", "I ordered mine mild but it was not that spicy, so I might try it spicier next time. "], "author": "Tiffany C.", "review": "I've never had ethiopian food before so this was an interesting experience. I ordered the doro tibs which was the marinated chicken breast. The food tasted really good! I'm not sure what some of the stuff even was but I enjoyed it quite well. I ordered mine mild but it was not that spicy, so I might try it spicier next time. They have a lot of vegetarian/vegan options too! \n\nThe lady taking our order seemed really bored, as if she didn't want to be there (or us to be there) so that made my experience not so great. It didn't help that I didn't know what to order since it was my first time there and she was not very helpful either. It's also a bit pricey, but I guess that's SF.", "rating": 3, "date": "2015-05-15"}, {"excerpts": ["We ordered the vegetarian sampler, doro tibs (chicken), and siga tibs (beef). ", "The food arrived promptly, and it was delicious. ", "The staff was friendly and helpful. ", "I will be eating here a lot."], "author": "Bradley H.", "review": "I love, love, love Ethiopian food. I was really excited to find this place just a couple of blocks from my new apartment. We ordered the vegetarian sampler, doro tibs (chicken), and siga tibs (beef). The food arrived promptly, and it was delicious. The staff was friendly and helpful. I will be eating here a lot.", "rating": 5, "date": "2017-08-05"}, {"excerpts": ["I ordered my usual, the Doro Tibs, and a side of Injera - and out of curiosity (but also because I knew I would be sharing) ", "The Doro Tibs was out of this world, and while the Tofu Tibs was flavorful, it just reminded me of sauteed tofu - don't know why I thought it would be fried or something. \n\n"], "author": "Aivy C.", "review": "Really good find in SOMA! \n\nOne of my girlfriends picked me up from work and we were en route to a theater rehearsal when I mentioned we probably ought to pick up some food and this was her suggestion. I love, love love Ethiopian food and at that point I hadn't had it in quite some time so we stopped off here. \n\nI ordered my usual, the Doro Tibs, and a side of Injera - and out of curiosity (but also because I knew I would be sharing) I also ordered Tofu Tibs. The Doro Tibs was out of this world, and while the Tofu Tibs was flavorful, it just reminded me of sauteed tofu - don't know why I thought it would be fried or something. \n\nI will definitely come back and order more food. Maybe eat in though - the bag they gave me for take-out got a little greasy.", "rating": 4, "date": "2013-10-04"}, {"excerpts": ["We ordered the vegetarian sampler and the doro tibs. ", "The vegetarian sampler is enough for two people, but the doro tibs were worth the feeling of overwhelming full-ness. ", "In addition to the doro tibs, the yellow pea stew was another standout. "], "author": "Wendy L.", "review": "Yum - so good!\n\nMy friend went later in the evening on a Friday night (they close at 9, though I think that's when they stop taking orders). We ordered the vegetarian sampler and the doro tibs. The vegetarian sampler is enough for two people, but the doro tibs were worth the feeling of overwhelming full-ness. In addition to the doro tibs, the yellow pea stew was another standout. You get a ton of injera with your entree so no need to order it separately.\n\nThe restaurant has a cafe feel - bright lights, order at the counter - and only  6-8 tables.\n\nMoya is really reasonably-priced - only ~$25-30 for dinner for the two of us!", "rating": 4, "date": "2014-02-08"}, {"excerpts": ["Nothing warms you up on a cold day like the Doro Tibs, and the house made cheese is a great accent to any dish."], "author": "Jeremy M.", "review": "I absolutely love this spot. Great small family owned business in SoMa with very friend staff and great food. Nothing warms you up on a cold day like the Doro Tibs, and the house made cheese is a great accent to any dish.", "rating": 5, "date": "2016-07-20"}, {"excerpts": ["Between two of us, we ordered the Veggie sampler and Doro Tibs, which was just the right amount of food.  "], "author": "Audrey C.", "review": "So this was my first experience with Ethiopian food and it was great!  The menu was easy to navigate and the owner was uber friendly!\n\nWe decided to grab dinner at Moya on our way to the Orpheum, since it was a) nearby and b) a quick meal.  We ended up finding street parking out front, and was able to park there all night (during the show), which made everything a perfect fit.\n\nIt's a small cafe that can seat just under 50 people.  You order at the counter first, then they bring your food out to you.  Between two of us, we ordered the Veggie sampler and Doro Tibs, which was just the right amount of food.  Our meal was served on one large plate, over Injera, with a separate plate of Injera served to us, as well.  We both had hearty appetites, and still somehow managed to have a few bites left over.\n\nOverall, I had a good experience and food was good.  Will I go back? Maybe if I'm in the area... It was definitely a quick option, for a meal before going to the Orpheum.\n\nAll in all, I'd say 3.5 stars.", "rating": 3, "date": "2013-05-29"}, {"excerpts": ["The vegetarian sampler was entirely delicious and interesting, the Doro Tibs were fantastic, well-seasoned and not greasy at all. "], "author": "Holly F.", "review": "So good! I am a big fan of Ethiopian food and usually eat out in Oakland. But we wanted injera and good flavors in San Francisco so we tried Moya. What a treat! The vegetarian sampler was entirely delicious and interesting, the Doro Tibs were fantastic, well-seasoned and not greasy at all. The smells from the kitchen were mouth-watering - I'm looking forward to trying more.\n\nThe atmosphere was more coffee shop than slow dining but courtesy of Yelp we knew that going in. The staff was warm and welcoming and the extra large Mexican sodas in glass bottles was the perfect touch.", "rating": 5, "date": "2014-05-07"}, {"excerpts": ["I'm not as big of a fan of the veggie combo or doro tibs."], "author": "Jackie B.", "review": "Before I discovered Moya I was sure that Oakland and San Jose had the only good Ethiopian restaurants in the Bay Area, but now I've found a place that can satisfy my cravings in San Francisco.\n\nThe two best things about Moya are the kitfo and the injera.  The injera is all teff, so it's gluten free and a gorgeous color.  It's very flavorful and sour. The kitfo is only served raw and is incredible. I'm not as big of a fan of the veggie combo or doro tibs.", "rating": 5, "date": "2014-07-13"}, {"excerpts": ["We generally get the Veggie Sampler and add Siga Tibs (the Doro Tibs is also out of this world). ", "Between the delicious food and friendly staff, Moya has become one of our favorite spots in SF."], "author": "Russ M.", "review": "I love this place! We generally get the Veggie Sampler and add Siga Tibs (the Doro Tibs is also out of this world). Between the delicious food and friendly staff, Moya has become one of our favorite spots in SF.", "rating": 5, "date": "2014-02-16"}, {"excerpts": ["Doro tibs, Siga tibs, and Kitfo are all very good.  ", "Just a simple place to grab a good bite."], "author": "Spencer Q.", "review": "A good place for home cooking!  This was my first experience with Ethopian so I guess this is now the bench mark.  Doro tibs, Siga tibs, and Kitfo are all very good.  Just a simple place to grab a good bite.", "rating": 4, "date": "2014-07-18"}, {"excerpts": ["I got the doro tibs (chicken stew), ordered spicy, with an added side of the kik alicha (yellow split pea stew) ", "(or was it shiro?). "], "author": "Chris Z.", "review": "One visit so far. Takeout, called in by phone. Takeout service was quick and efficient.\n\nI got the doro tibs (chicken stew), ordered spicy, with an added side of the kik alicha (yellow split pea stew) (or was it shiro?). Small salad and injera were included.\n\nVerdict: Some of the better Ethiopian I've had. (Note, this is based on sampling only two dishes, so far.) I typically eat from places in Oakland that are solid (and there are many). \n\nThe chicken wasn't overcooked, and it had a flavorful, well-spiced clarified butter sauce. The split peas were firm (al dente?), not mushy, and thankfully not bland, either--the most common issues I find with this dish at other places.\n\nThe injera portion could have been larger, but on the bright side, it prevented me from overeating and having to teff out the afternoon in an uncomfortable state. (Yeah, that's an Ethiopian food pun.)\n\nPrices aren't cheap, but I'll still be returning because I'm willing to pay for the quality, and I don't have other nearby Ethiopian lunch options, anyway.", "rating": 4, "date": "2014-07-23"}, {"excerpts": ["I had the Doro Tibs and it was fantastic - flavorful, non-greasy, generous portion."], "author": "Eeva I.", "review": "Food was great, service not so much. The restaurant was supposed to open at 5pm on a Monday afternoon but the doors were still closed at 5:20pm and calls went to their voicemail. When I returned at 5:50pm, the place was finally open. I had the Doro Tibs and it was fantastic - flavorful, non-greasy, generous portion.", "rating": 4, "date": "2015-10-01"}, {"excerpts": ["the Doro Wot, my friend had the Doro Tibs. ", "Both delicious, spicy and bold but not overpowering. ", "I'll definitely come back soon to try out the other items on the menu. ", "Especially the vegetarian sampler... saying that, I wish there was a meat dish sampler, because everything sounds yummy and I had a hard time making a decision."], "author": "Tobias G.", "review": "What an awesome addition to my lunch routine. A friend came up with the idea of having Ethiopean food for lunch and suggested Moya. I am so glad he did. I enjoy the spicy full flavored food from Ethiopia and what they serve at Moya is super authentic and delicious at the same time. \n\nI had the Doro Wot, my friend had the Doro Tibs. Both delicious, spicy and bold but not overpowering. I'll definitely come back soon to try out the other items on the menu. Especially the vegetarian sampler... saying that, I wish there was a meat dish sampler, because everything sounds yummy and I had a hard time making a decision.", "rating": 4, "date": "2014-03-07"}, {"excerpts": ["I ate it all, plus almost all of the ye doro tibs. ", "For more on the ye dora tibs, see this SF Weekly article:\n"], "author": "Michael C.", "review": "Since finding this place a month ago, I've been four times. It's insanely good, and is a perfect business.\n\nWhat's your angle? Do you like small, local businesses? Well, the waitress is the daughter and granddaughter of the mother and grandmother who are cooking in the kitchen. It doesn't get much more \"real people\" than that.\n\nPlus, there's an ongoing Soma War. Keeping business doors open is essential to preventing the druggies and criminals from overrunning SOMA again. In 2003, SOMA was a lot like the Tenderloin. In 2010, it's civilized....As long as you stay in after 10:30 p.m. or so. Supporting local businesses is essential for the neighborhood.\n\nSocial critique aside, the food is awesome. It's also affordable. Four of us ate there - tons of food (depicted in a picture I uploaded), as it was a table of big eaters. With tip, we got out of there for $80.\n\nThere are gluten-free options. I prefer the taste of the teff. This Wikipedia entry is helpful: http://en.wikipedia.org/wiki/Eragrostis_tef\n\nI've had the lamb, chicken, kitfo (you can get it cooked if you don't ' want to eat raw ground beef), and kitfo special (cheese and collard greens are mixed in with the kitfo), and lentils. Everything has been fantastic.\n\nI've ordered carry out, too. (Picture uploaded.) Huge servings. I ate it all, plus almost all of the ye doro tibs. For more on the ye dora tibs, see this SF Weekly article:\nhttp://blogs.sfweekly.com/foodie/2010/07/spicy_ethiopian_chicken_at_moy.php\n\nMoya is a new favorite that I'll be taking all of my friends to.", "rating": 5, "date": "2010-12-01"}, {"excerpts": [": I met my cousin for lunch at Moya and we shared the spicy red lentils and the spicy chicken (doro tibs).  ", "Each came with a small salad and two small relishes.  "], "author": "Eddie L.", "review": "Fresh and tasty with a spicy kick in the pants!\n\nFood = 4.0: I met my cousin for lunch at Moya and we shared the spicy red lentils and the spicy chicken (doro tibs).  Each came with a small salad and two small relishes.  We also got rice and injera bread.  The lentils and chicken were super flavorful and they had nice heat.  Portions were pretty fair.  Next time, I will order the vegetarian sampler, which looked enormous!\n\nService = 3.5:  You order at the counter and they bring the plates to you.  The ladies working the place were very nice.  A half star bump for being able to pay with Square.\n\nAtmosphere = 4.0:  This space is way better than their previous space at 6th and Folsom.  Their first location was consumed by fire but as they say, \"Everything happens for a reason.\"  Thus, this new, clean and better location on 9th in the SoMa!", "rating": 4, "date": "2013-03-20"}, {"excerpts": ["I had the Ingudai Doro Tibs platter extra spicy and it was amazing. "], "author": "Kirita S.", "review": "I wanted to check this place out because their reviews were good so I went with my boyfriend during my lunch break. My first time trying Ethiopian food and I am in love now. The ambience fits perfectly with its location (downtown S.F. industrial). The staff is very friendly and the place is surprisingly very spacious. We came in just before the lunch rush hour so we got our food in a timely manner. \n\nI had the Ingudai Doro Tibs platter extra spicy and it was amazing. The injera (ethiopian bread) has a very interesting texture almost spongy but I quite enjoyed it. I do regret not ordering the veggie sampler that everyone talks about. \n\nTheir lunch menu is one page which is very fitting because I hate restaurants with menus the size of a short novel. I will definitely be coming back to this place so I can try some more of their items.\n\n*like any where else in the city parking is hard to find; however, we got lucky and snagged a parking spot a few feet away from the restaurant.", "rating": 4, "date": "2013-05-23"}, {"excerpts": ["The doro tibs and siga tibs is out of this world good here!  ", "They deserve each of those stars for so many reason outside of their delicious food!  ", "The service and awesome location are two of those reasons.  ", "Mix it with perfect service, kind staff, and my wife also loves it as the other three."], "author": "Rachelle G.", "review": "The doro tibs and siga tibs is out of this world good here!  They deserve each of those stars for so many reason outside of their delicious food!  The service and awesome location are two of those reasons.  Mix it with perfect service, kind staff, and my wife also loves it as the other three.", "rating": 5, "date": "2014-03-25"}, {"excerpts": ["Loved the vegetarian injera, Doro tibs and misir wot!"], "author": "Madhuri S.", "review": "A small place with a seating seating capacity of 20 may be.. Not so elegant and fancy.. Mostly quiet.. But the food is to die for.. They are best at what they are expected to do.. That's serving great food.. Good option for vegetarians.. Spicy and great portions.. Have an option to order food family style, which works out great.. Loved the vegetarian injera, Doro tibs and misir wot!", "rating": 5, "date": "2014-04-10"}, {"excerpts": ["We ordered a variety of items consisting of the tofu tibs, ye doro tibs (chicken), vegetarian combo, and one of the beef items (sorry, the name escapes me).\n\n"], "author": "Tim B.", "review": "Went here for lunch with 3 others. They hadn't had Ethiopian food before. I had eaten it a few times and wasn't taken seriously when I said you eat it with your hands.\n\nWell, um: ya do. You tear off a piece of injera (a bread with a very sponge-like consistency), wrap it around some food, and chow away.\n\nWe ordered a variety of items consisting of the tofu tibs, ye doro tibs (chicken), vegetarian combo, and one of the beef items (sorry, the name escapes me).\n\nEven though the place was almost empty when we were there, it took about 15 minutes to get the food prepared. When it arrived, it was served on a single, giant platter. It took up almost the entire table. In addition to what we had ordered, they threw on a couple of samples other menu items. The place was clearly very new, so the staff probably hasn't had time to work out the kinks of running the place yet.\n\nPortion size: excellent. The four of us left feeling stuffed. And this is a fairly active group of people, accustomed to burning a lot of calories.\n\nService: It took it awhile, but the waitress was very friendly and quite knowledgeable about the details of menu items and of Ethiopian cuisine in general. So, \"very good.\"\n\nValue: Considering the quantity of food, it's very good.\n\nDrawbacks: \n\n1) the prices were a bit high for lunch (average entree was about $13). Since they seem to want to attract a noontime crowd, they need to have prices that are appealing. Note: their website indicates that they have \"lunch specials\" now, so perhaps that's since been remedied.\n\n2) Because you eat this food with your hands, they need to provide tableside hand-cleaning both BEFORE and AFTER you eat. Perhaps some warm, wet towels or something. And yes, I know: there is a restroom in the back, but if the place gets busy, there's going to be a crowd waiting for it. Also, public restrooms can get really icky.\n\n3.4 stars.", "rating": 3, "date": "2011-03-12"}, {"excerpts": ["We ordered the Kitfo (spicy rare beef with cottage cheese) and Ye Doro Tibs (lamb with clarified butter in spices).  "], "author": "Yun W.", "review": "First time experiencing Ethiopian cuisine.  Waitress was really friendly and made some good suggestions in terms of what us first timers should try.  Also, she gave us a couple samplings of the vegetarian dishes since we ordered only meats which prompted us to order the red lentils next time we come back.\n\nWe ordered the Kitfo (spicy rare beef with cottage cheese) and Ye Doro Tibs (lamb with clarified butter in spices).  Both dishes had lots of delicious flavor, especially combined with the injera bread served.  We loved the lamb dish the most, so much complex spices and flavor and the lamb was cooked so tender that it broke apart once we try to scoop it up with the injera bread.\n\nWe will be back for sure.", "rating": 5, "date": "2011-02-26"}, {"excerpts": ["We have been here twice, and both times we ordered a vegetarian combo and Ye Doro Tibs with chicken - shared, of course. ", "Both were very good. "], "author": "Adam B.", "review": "The most striking thing about Moya compared to other Ethiopian restaurants is that it was very clean. Most other Ethiopian places that I've been to are very delicious but not exactly a neat freak's paradise. Moya is both clean and delicious.\n\nWe have been here twice, and both times we ordered a vegetarian combo and Ye Doro Tibs with chicken - shared, of course. Both were very good. I highly recommend getting an order of the vegetarian combo because it gives you a chance to sample many different dishes.\n\nAnother positive differentiator of Moya over other Ethiopian places is their attentive service, especially when bringing over fresh injera, which we always seem to run out of several times. \n\nI will definitely be back!", "rating": 5, "date": "2010-10-28"}, {"excerpts": ["We ordered a chicken dish (Ye Doro Tibs) and the vegetarian sampler.  ", "It was all really, really delicious and different.  ", "The price was great, too!  ", "3 of us ate for less than $40.  ", "After the meal - I asked if they had anything not posted on the menu that was on the dessert tip.  ", "She brought us a few pieces of this breakfast-y flatbread-y stuff with honey  ", "(sorry I don't remember the name of the dish).  ", "It wasn't on the menu, so I don't know that they would offer it to everyone.  "], "author": "MacKenzie P.", "review": "This is the cuuuuutest place.  \n\nA couple of friends and I were going back and forth about where to eat.  We've been to most of the places in the neighborhood and we just decided to start walking.  Luckily, we passed by this restaurant and saw it had opened!  \n\nWe were greeted by a very friendly group of people working there.  It turns out (after talking with the owner and her daughter), it's owned by a single mother who clearly kicks butt and takes names.  \n\nWe ordered a chicken dish (Ye Doro Tibs) and the vegetarian sampler.  It was all really, really delicious and different.  The price was great, too!  3 of us ate for less than $40.  After the meal - I asked if they had anything not posted on the menu that was on the dessert tip.  She brought us a few pieces of this breakfast-y flatbread-y stuff with honey  (sorry I don't remember the name of the dish).  It wasn't on the menu, so I don't know that they would offer it to everyone.  Regardless, I was super impressed with her willingness to go out of her way to find us something sweet.\n\nAll in all - AWESOME experience.  I hope this place does well.  Will definitely be back very soon.", "rating": 5, "date": "2010-07-11"}, {"excerpts": ["I've only had the doro tibs here, but a number of friends have sampled the entire menu and they've all had great experiences. ", "The food is spicy, flavorful and the ladies behind the counter are the nicest gals around!"], "author": "Aakash D.", "review": "My favorite Ethiopian place in San Francisco. I've only had the doro tibs here, but a number of friends have sampled the entire menu and they've all had great experiences. The food is spicy, flavorful and the ladies behind the counter are the nicest gals around!", "rating": 5, "date": "2012-09-15"}, {"excerpts": ["We ordered an Azifa for an appetizer and Kitfo, Ye Doro Tibs, and Ye Beg Wot.  ", "All three of the main dishes were great.  ", "The chicken (Ye Doro Tibs) was probably my favorite of the three, which is saying a lot because I'm normally not big on chicken dishes.  ", "Everything had a great amount of spice and was wholly filling.  "], "author": "Yuri Y.", "review": "My girlfriend and I recently moved into the neighborhood and decided to check this place out last night with another friend.  We ordered an Azifa for an appetizer and Kitfo, Ye Doro Tibs, and Ye Beg Wot.  All three of the main dishes were great.  The chicken (Ye Doro Tibs) was probably my favorite of the three, which is saying a lot because I'm normally not big on chicken dishes.  Everything had a great amount of spice and was wholly filling.  For $20 a person we were beyond stuffed when we left the restaurant.  \n\nThe staff was very friendly and would constantly bring us more injera as we devoured the ones in front of us.  The only negative surprise was that they didnt serve beer or wine, but that's something that I should have looked up before we went.  Overall we had a great experience and will definitely be coming back.", "rating": 4, "date": "2010-08-19"}, {"excerpts": ["We ordered Doro Tibs and Ye Bere Tibs to go.  ", "The Ye Bere Tibs were tough, and both dishes lacked flavor, seasoning, and depth.  "], "author": "Leann C.", "review": "I love Ethiopian food and was really looking forward to Moya after all the great reviews.  We ordered Doro Tibs and Ye Bere Tibs to go.  The Ye Bere Tibs were tough, and both dishes lacked flavor, seasoning, and depth.  The injera was good, and the service was prompt and friendly, so 1 star for each of those... I'd order take out injera from here but the food was disappointing enough that I wouldn't give the rest another chance.", "rating": 2, "date": "2010-08-01"}], "kitfo": [{"excerpts": ["So the kitfo is good but man", ", I can't handle that much raw beef personally so I steer clear of this "], "author": "Arezou A.", "review": "Been here 3 times and I've been very happy each time I've ate here.\n\nVeggie Sampler-\n           spicy red lentil: probably the dish doing the least for me out of the veggie options \n           gomen: you can't really screw up collard greens\n           atkilt wot: this is the borderline addicting veggie item\nDoro Tibs- This is personally my favorite dish to order! I normally get this and one of the veggie items, depending on whose with me and what they're in the mood for.\nKitfo- So the kitfo is good but man, I can't handle that much raw beef personally so I steer clear of this but my friends are a huge fan.\n\nOverall I just absolutely LOVE injera and can eat it all day. Moya isn't my go-to Ethiopian place in the city but it's definitely very convenient because it's fast casual as opposed to a formal sit down like most of the other spaces in the city.", "rating": 4, "date": "2017-11-14"}, {"excerpts": ["I decided on the kitfo, which is essentially raw meat with the standard injera and house salad to complement the flavor. ", "The plate is a decent amount of food. ", "Actually, it was much more than I could finish, but it was pretty good! ", "After awhile, I couldn't stomach any more raw meat, so I gave up and called it a day. "], "author": "Stefanie C.", "review": "This place is no Tadu, but I'd been wanting to try it for awhile. It's more of a café where you can get work done, but I stopped by for a quick me-time dinner before socializing with friends on a Friday night. The process for ordering is straightforward. There's a simple menu posted above the counter, and you order at the cashier before getting your number and finding a seat.\n\nI decided on the kitfo, which is essentially raw meat with the standard injera and house salad to complement the flavor. The plate is a decent amount of food. Actually, it was much more than I could finish, but it was pretty good! After awhile, I couldn't stomach any more raw meat, so I gave up and called it a day. Initially I wanted tibs, but they only had chicken.\n\nIt's a dimly lit café and has a very low-key vibe. I saw people come here on a chill date and to catch up with friends. Very versatile location. It doesn't compel me enough to come here again, but there's decent food and doubles as a café, which is awesome!", "rating": 4, "date": "2017-02-22"}, {"excerpts": ["I cannot recommend enough the Kitfo Special!\n\n"], "author": "Robby F.", "review": "I came back to Moya for the first time in a very long time (I no longer work around the corner). The food is still amazing as it has ever been! I cannot recommend enough the Kitfo Special!\n\nOn top of everything, the owners still remember me and spoke with me even though it's easily been two years since I came by.\n\nThank you for still providing amazing food! I hope to be back sooner than later!", "rating": 5, "date": "2017-08-17"}, {"excerpts": ["He had the Kitfo, an Ethiopian steak tartare. ", "Too bad they don't serve alcohol here. "], "author": "Ted R.", "review": "I was brought to this place by my friend who's an Ethiopian food expert. He was a journalist who served as a war correspondent there and married an Ethiopian woman. So yeah, he's an expert.\n\nThis is an order-at-the-counter restaurant that serves relative few dishes and they make them very well. I have the steak tips and the flavors were on point. Succulent steak and a salad with bright green dressing and tomato. I added collard greens and they were delicious. All the better to eat up with the Injera bread. He had the Kitfo, an Ethiopian steak tartare. Too bad they don't serve alcohol here. But a ginger beer washes things down just fine. \n\nI didn't really count but they're probably eight or nine tables, 4- and 2-tops. While the restaurant is clean, the atmosphere is good, not great. A basic look dressed up with some Ethiopian art. Never got crowded but it stayed busy until almost closing time when I was there on a Wednesday night. The woman at the counter was extremely friendly. Nothing to complain about and the price was right at just $14. \n\nDon't get faked out by the out-of-order sign on the bathroom door. I'm pretty sure that's to discourage the vagrants. Just ask for the bathroom key and everything is clean and in working order.", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["I've yet to try the kitfo ", "but you can bet I'll be back for it!"], "author": "Mark C.", "review": "It's definitely a benefit to come here in a group and eat family style on a big platter because you get to try almost everything on the menu. I definitely recommend the vegetable sampler, siga (beef) tibs, doro wat (chicken chili stew), and shuro (ground chickpea stew). I've yet to try the kitfo but you can bet I'll be back for it!", "rating": 5, "date": "2018-07-01"}, {"excerpts": ["My friend recommended the Kitfo and he was right to do so!"], "author": "Tyler H.", "review": "The food is just as good as it smells! My friend recommended the Kitfo and he was right to do so!", "rating": 5, "date": "2017-07-08"}, {"excerpts": ["We got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. ", "Everything was exceptionally tasty and well-cooked. ", "The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. ", "Out of all the veggie entrees, I think the gomen was the best. "], "author": "Josephine L.", "review": "My friend and I stumbled upon this place by accident while looking for a warm place to duck in for a bit around Market St. She had never had Ethiopian food and it's one of my favorite cuisines so I figured we'd both enjoy Moya.\n\nThe restaurant can be a bit confusing in terms of how you order and are seated. Despite all the people who might be sitting at tables around you, you do have to order your food up front and pay first before seating yourself. The staff will bring out the food to you, but they don't exactly wait on you like in traditional restaurants. It's very cafeteria-style.\n\nWe got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. Everything was exceptionally tasty and well-cooked. The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. Out of all the veggie entrees, I think the gomen was the best. The injera was one of the least \"soggy\"-feeling ones I've ever had but had all of that delicious sourness you expect. I was initially worried that they wouldn't provide enough injera for the two of us, but it turned out to be plenty. In fact, we had more than enough to take home for leftovers. Injera heats up so well in the microwave, because it already has a naturally soggy texture so the moisture from the heat doesn't really affect it.\n\nThe space is very new and sleek 'n' chic, as I like to describe modern aesthetics. And I have to rave about the staff. Some of the nicest people I have ever encountered. They were so warm, welcoming and accommodating to us. They seemed genuinely concerned that we enjoyed the food and went out of their way to make sure everything was to our liking. Very sweet.", "rating": 4, "date": "2012-09-02"}, {"excerpts": ["Veggie sampler and Kitfo with collard greens is the way to go. ", "Make sure you ask for medium spicy if you like your tastebuds."], "author": "Jeremie H.", "review": "One of my favorite, healthy dining options in SF. Veggie sampler and Kitfo with collard greens is the way to go. Make sure you ask for medium spicy if you like your tastebuds.", "rating": 5, "date": "2015-12-29"}, {"excerpts": ["I ordered the kitfo, a beef tartare with clarified butter. ", "You heard me correctly. ", "This was accompanied by salad, KIK ALI-CHA (yellow pea stew) and the ingira bread. ", "The first bites of the tartare were amazing but be warned, this is heavy stuff. ", "They give you a lot of it ", "and I wasn't able to finish it. ", "It's really rich. ", "The salad does help to cut that richness but in itself, was unremarkable. ", "My friend had a grilled chicken with ethiopian spices and enjoyed it a lot. ", "He too felt we got a lot of food for our buck. ", "The menu does cater to american tastes, and is not as broad as I've found at other ethiopian restaurants. ", "It is quick though, and perfect for a well executed, nontypical lunch."], "author": "Mark N.", "review": "Moya, aother \"find\" within walking distance of my office, ethiopian is a fun alternative for lunch. Today I was joined by a fellow artist (painter), paralegal-by-day. He's also got some wild stories. WOW. Always fun.\n\nI ordered the kitfo, a beef tartare with clarified butter. You heard me correctly. This was accompanied by salad, KIK ALI-CHA (yellow pea stew) and the ingira bread. The first bites of the tartare were amazing but be warned, this is heavy stuff. They give you a lot of it and I wasn't able to finish it. It's really rich. The salad does help to cut that richness but in itself, was unremarkable. My friend had a grilled chicken with ethiopian spices and enjoyed it a lot. He too felt we got a lot of food for our buck. The menu does cater to american tastes, and is not as broad as I've found at other ethiopian restaurants. It is quick though, and perfect for a well executed, nontypical lunch.", "rating": 4, "date": "2012-08-25"}, {"excerpts": ["The two best things about Moya are the kitfo and the injera.  ", "The injera is all teff, so it's gluten free and a gorgeous color.  ", "It's very flavorful and sour. ", "The kitfo is only served raw and is incredible. "], "author": "Jackie B.", "review": "Before I discovered Moya I was sure that Oakland and San Jose had the only good Ethiopian restaurants in the Bay Area, but now I've found a place that can satisfy my cravings in San Francisco.\n\nThe two best things about Moya are the kitfo and the injera.  The injera is all teff, so it's gluten free and a gorgeous color.  It's very flavorful and sour. The kitfo is only served raw and is incredible. I'm not as big of a fan of the veggie combo or doro tibs.", "rating": 5, "date": "2014-07-13"}, {"excerpts": ["Doro tibs, Siga tibs, and Kitfo are all very good.  ", "Just a simple place to grab a good bite."], "author": "Spencer Q.", "review": "A good place for home cooking!  This was my first experience with Ethopian so I guess this is now the bench mark.  Doro tibs, Siga tibs, and Kitfo are all very good.  Just a simple place to grab a good bite.", "rating": 4, "date": "2014-07-18"}, {"excerpts": ["I didn't know what Kitfo was until I went here, now I can't wait to try it again.\n\n"], "author": "Charles L.", "review": "I didn't know what Kitfo was until I went here, now I can't wait to try it again.\n\nAfrican eateries often get overlooked here in The City, but this is one that shouldn't be dismissed. It's really a simple coffee bar-style place with windows to look out on the world. But whether you're there for three minutes or 30, your time will be well-spent.", "rating": 4, "date": "2014-02-19"}, {"excerpts": ["This Wikipedia entry is helpful: http://en.wikipedia.org/wiki/Eragrostis_tef\n\nI've had the lamb, chicken, kitfo (you can get it cooked if you don't ' want to eat raw ground beef), and kitfo special (cheese and collard greens are mixed in with the kitfo), and lentils. "], "author": "Michael C.", "review": "Since finding this place a month ago, I've been four times. It's insanely good, and is a perfect business.\n\nWhat's your angle? Do you like small, local businesses? Well, the waitress is the daughter and granddaughter of the mother and grandmother who are cooking in the kitchen. It doesn't get much more \"real people\" than that.\n\nPlus, there's an ongoing Soma War. Keeping business doors open is essential to preventing the druggies and criminals from overrunning SOMA again. In 2003, SOMA was a lot like the Tenderloin. In 2010, it's civilized....As long as you stay in after 10:30 p.m. or so. Supporting local businesses is essential for the neighborhood.\n\nSocial critique aside, the food is awesome. It's also affordable. Four of us ate there - tons of food (depicted in a picture I uploaded), as it was a table of big eaters. With tip, we got out of there for $80.\n\nThere are gluten-free options. I prefer the taste of the teff. This Wikipedia entry is helpful: http://en.wikipedia.org/wiki/Eragrostis_tef\n\nI've had the lamb, chicken, kitfo (you can get it cooked if you don't ' want to eat raw ground beef), and kitfo special (cheese and collard greens are mixed in with the kitfo), and lentils. Everything has been fantastic.\n\nI've ordered carry out, too. (Picture uploaded.) Huge servings. I ate it all, plus almost all of the ye doro tibs. For more on the ye dora tibs, see this SF Weekly article:\nhttp://blogs.sfweekly.com/foodie/2010/07/spicy_ethiopian_chicken_at_moy.php\n\nMoya is a new favorite that I'll be taking all of my friends to.", "rating": 5, "date": "2010-12-01"}, {"excerpts": ["We ordered the garbanzo curry and the house special kitfo. \n\n", "The kitfo was tender and tasted okay, but lacked some of the nuances of spiced butter that make this dish one I usually crave. ", "Similarly, the garbanzo curry was spicy ", "(in itself good - we like it hot), but besides the chili burn there was some layers of flavor missing from this dish. "], "author": "Monica S.", "review": "We stumbled into Moya on accident, hungry and drawn to the relatively high reviews compared to other eateries in the area. \n\nWe ordered the garbanzo curry and the house special kitfo. \n\nOur injera (all teff) was pleasantly tart and springy. The kitfo was tender and tasted okay, but lacked some of the nuances of spiced butter that make this dish one I usually crave. Similarly, the garbanzo curry was spicy (in itself good - we like it hot), but besides the chili burn there was some layers of flavor missing from this dish. The dressing on the salad tasted way too vinegary for my taste. \n\nThe injera was my favorite element of the meal, and while the other items seemed fresh, well presented, and good enough, they were also somewhat unsatisfying compared to the Ethiopian food I've had elsewhere.", "rating": 3, "date": "2013-02-17"}, {"excerpts": ["Dont be afraid to try the Kitfo, which should be ordered spicy and as they intend...rare.  ", "One you get over the rawness, your taste buds will go wild. ", "I always order a side of their housemade cottage cheese to tame the spices a bit.  "], "author": "Mike H.", "review": "Oh Moya, how I love thee.  When life feels bland and cold, theres nothing more satisfying than Moya's deliciously authentic, uber-flavorful dishes.  Ive had almost every type of dish so far (working my way through the different meats of each type), and all have been a tasty delight!  The best way to do Moya is to go with 4 people.   That was you can get the Veggie Platter, which is more than enough to feed 2 hungry boys, and then you can order another dish or two. Dont be afraid to try the Kitfo, which should be ordered spicy and as they intend...rare.  One you get over the rawness, your taste buds will go wild. I always order a side of their housemade cottage cheese to tame the spices a bit.  I must also add that I love to eat with my hands.\n\nI cant wait until they open again, after recovering from a fire set off at the hotel next door by some jagoff that cooked with his bbq inside!  Once theyre ready, Ill be charging the doors!", "rating": 5, "date": "2011-05-09"}, {"excerpts": ["The kitfo was amazing, and they have mushrooms here, which have been a little hard for me to find. "], "author": "J W.", "review": "I've only been to a handful of Ethiopian restaurants (about 8 restaurants in 4 different cities) but Moya was easily the best. The kitfo was amazing, and they have mushrooms here, which have been a little hard for me to find. The portions were ridiculous -- we spent about $20 per person and didn't even come close to finishing what we ordered.\n\nMy only complaints are that they don't serve beer or honey wine, and that the mushrooms which we ordered medium were not even the least bit spicy. Considering that there was a person at my table who seemed hesitant about the spiciness, that may have been our server acting a little too cautious.\n\nAnd speaking of our server, she was fantastic. I've learned not to judge an Ethiopian restaurant by the attentiveness of their waitstaff, but our server kept our water refilled and brought us extra napkins and injera without us having to ask. It was perfect.\n\nIf they start serving alcohol I will not hesitate to bump my review up to 5 stars. Regardless, I will be back as soon as possible.\n\nPlease go here and keep it hopping! This is exactly the kind of restaurant that deserves to thrive in San Francisco.", "rating": 4, "date": "2011-04-27"}, {"excerpts": ["All I have to say is their Kitfo, raw(beef), is the best I've ever had! ", "Their fresh cheese had a really good taste to it, came with some salad and light dressing. ", "All was plated very nicely and tasted delicious! ", "I've had Kitfo at many different restaurants and for the price and quality, you can't go wrong at Moya!"], "author": "Matthew R.", "review": "All I have to say is their Kitfo, raw(beef), is the best I've ever had! Their fresh cheese had a really good taste to it, came with some salad and light dressing. All was plated very nicely and tasted delicious! I've had Kitfo at many different restaurants and for the price and quality, you can't go wrong at Moya!", "rating": 4, "date": "2013-07-04"}, {"excerpts": ["The Kitfo was pretty good. "], "author": "Jenna P.", "review": "Get the vegetable combination plus a choice of meat, easy to share between two and leave satisfied!\n\nThe Kitfo was pretty good. But my favorite is the vegetable combination.\n\nUnfortunately no beer or wine served here.", "rating": 5, "date": "2011-03-14"}, {"excerpts": ["We ordered the Kitfo (spicy rare beef with cottage cheese) and Ye Doro Tibs (lamb with clarified butter in spices).  "], "author": "Yun W.", "review": "First time experiencing Ethiopian cuisine.  Waitress was really friendly and made some good suggestions in terms of what us first timers should try.  Also, she gave us a couple samplings of the vegetarian dishes since we ordered only meats which prompted us to order the red lentils next time we come back.\n\nWe ordered the Kitfo (spicy rare beef with cottage cheese) and Ye Doro Tibs (lamb with clarified butter in spices).  Both dishes had lots of delicious flavor, especially combined with the injera bread served.  We loved the lamb dish the most, so much complex spices and flavor and the lamb was cooked so tender that it broke apart once we try to scoop it up with the injera bread.\n\nWe will be back for sure.", "rating": 5, "date": "2011-02-26"}, {"excerpts": ["I ordered it, while my date braved the ultra-rare kitfo. ", "His kitfo came out soon after, along with a plate with a couple of extra rolls of injera. ", "My date liked his kitfo even more than my lamb. \n\n"], "author": "Beth W.", "review": "I am still getting my Ethiopian-food legs, so to speak, and I learned a lot from my dinner at Moya. \n\nAs much as I loved it, after we ate at New Eritrea, I was going to give myself a long break from Ethiopean food. It just didn't seem right to eat it without having the full experience -- by which I mean the injera -- and nobody in San Francisco was making injera with 100% teff. But then Moya came along. \n\nTimes are hard in Africa, especially hard right now, and there is a severe teff shortage. Teff is an impressively tiny grain grown in Africa that is dark brown in color, sour-flavored, a bit gummy when cooked, and is the basis for traditional injera. You can still buy teff in America -- at a price. Most restaurants are keeping their costs down by cutting their teff with wheat, which is great for the budget but frustrating for folks with gluten allergies. Moya, instead, makes two kinds of injera -- one with wheat, and one without. They charge a little more for the teff-only version, which is brilliant. I wish other Ethiopean places would do this. \n\nSo, I decided to reverse my moratorium on Ethiopean food and give Moya a try. My date and I visited on a Friday evening; the restaurant had a few diners but wasn't packed. The decor is more cafe than African, though it is clean and feels friendly. We were encouraged to sit anywhere, and urged to try the ye beg wot, a tender lamb dish that had just come out of the pot and was getting rave reviews from other diners. I ordered it, while my date braved the ultra-rare kitfo. I also explained that I am allergic to gluten, and ordered the teff-only injera for my meal. \n\nMy date ordered the azifa, and I had a taste of the zesty lentils before he began spooning them onto pieces of flatbread (wheat-based, so I couldn't have it). His kitfo came out soon after, along with a plate with a couple of extra rolls of injera. The woman who brought the food set the injera down next to me, so I assumed it was mine. Excited to try it, I took a bite. \n\nA few minutes later, my food came out -- and I noticed the injera on my plate was much darker than the stuff I'd just eaten. It tasted different, too; more like pure teff. Uh oh. I talked with the woman who'd served our food, and she confirmed that the injera I'd tried earlier had wheat in it. She claimed she told us that it was my date's, not mine, but admitted it was confusing that she had set it in front of me. They agreed to knock the cost of my injera off the order, and I wondered if that would make up for the allergic reaction I might have later. \n\nNevertheless, the lamb was amazing. The meat was tender and rich, complemented by the light sourness of the injera. The sauce was buttery and spicy, also a perfect foil for the bread. I would have loved more salad, and was surprised by how quickly I was filled by the meal. I had enough to take home and enjoy for lunch the next day. My date liked his kitfo even more than my lamb. \n\nI didn't wind up having a truly bad reaction to the bite of wheat I got, though I did feel crummy for a couple of days after. Plus, I learned how to tell the difference between the wheat-laced injera and the stuff that's safe for me to eat, so I would feel comfortable going back. \n\nI'm docking one star for the allergy-related confusion, and reluctantly docking one more because I wish they had a wine selection to go with the food -- Ethiopean honey wine, at the very least.", "rating": 3, "date": "2010-07-31"}, {"excerpts": ["Mouth-watering kitfo ( I love kitfo!!) mixed with collard greens, Ethiopian home made cottage cheese, and wonderfully spicy!\n"], "author": "Akasha A.", "review": "I'm so happy there's an Ethiopian restaurant in SOMA!!!\n\nWhat we had:\n\nAzifa- Delicious cold appetizer of lentils, tomatoes, onions & spices served with Ethiopian flatbread;\nMoya Special Kitfo- Mouth-watering kitfo ( I love kitfo!!) mixed with collard greens, Ethiopian home made cottage cheese, and wonderfully spicy!\nAtkilti Wot- Seasonal vegetables simmered in spices.\n\nEverything was fresh and delicious served family style on a huge plate. The service was attentive and we also got to meet the owner, who is fabulous. In fact, all her staff is top notch! The decor is also elegant; Moya is a real gem in the neighborhood.  \n\nWe were happily stuffed and can't wait to try everything else on the menu, including coffee!", "rating": 5, "date": "2010-07-12"}, {"excerpts": ["For those of you who are into meat, though, the doro wot is phenomenal, as is the kitfo (its raw meat ", "but just keep an open mind!). ", "As an Ethiopian myself I have often been disappointed with the food at Ethiopian restaurants because they are never authentic, but this restaurant is the REAL DEAL!! ", "Give it a try and you will be thankful :)"], "author": "Mo M.", "review": "Awesome food with awesome service to go with it! Many people think only the meat-eaters have fun at Ethiopian restaurants like this one, but as an almost- vegetarian myself, I can say whole-heartedly that you will not regret eating here If you are a vegetarian!! The veggie combo gives you a good amount of each of the typical Ethiopian vegetable dishes which I believe are the most delicious of this culture's food. For those of you who are into meat, though, the doro wot is phenomenal, as is the kitfo (its raw meat but just keep an open mind!). As an Ethiopian myself I have often been disappointed with the food at Ethiopian restaurants because they are never authentic, but this restaurant is the REAL DEAL!! Give it a try and you will be thankful :)", "rating": 5, "date": "2010-08-08"}, {"excerpts": ["The Moya Special Kitfo was full of a great herbal flavor that I couldn't quite figure out.  "], "author": "Kelly M.", "review": "Everything about my experience at Moya was great.  This was the first Ethiopian I have had in the Bay area, but it is better than my other experiences, even when I was living in the DC area.  \n\nThe staff was very personable and spent time explaining how to eat Ethiopian as well as suggesting dishes to the people in my party who had not had Ethiopian before.  Our sever even explained some of the cultural significance of different dishes.  \n\nThe flavors were rich and not overpowered by heat.  The sauces had a great mixture of savory and spicy, and were not overly greasy.  The injera was fresh and of perfect consistency.  We started with the ye timatim fit fit, which was a fresh and lite salad, perfect for introducing those new to Ethiopian food to the injera.  The vegetarian combination was very good.  The gomen, collard greens, was a stand-out as far as the vegetarian dishes.  The Moya Special Kitfo was full of a great herbal flavor that I couldn't quite figure out.  The ye doro wot was also delicious, and even better when mixed with a little of the ayb (home made cottage cheese) as suggested by our server.\n\nThe interior is new and clean, with ample seating available when we arrived for an early dinner at 6:30pm.  The surrounding area is not very residential, so there was ample parking on the same block when we arrived.\n\nI am definitely excited to go back and sample more of their menu.  By interacting with the servers, cooks and owner, you can tell that they work hard to make delicious \"home-style\" Ethiopian food and very proud of the product.", "rating": 5, "date": "2010-08-30"}, {"excerpts": ["It will get much love from the gluten-free folks for having gluten-free injera and it will get love from the hardcore carnivores for having three different kinds of kitfo, a sirloin beef dish usually served rare. \n\n"], "author": "DeathandFood H.", "review": "For some odd reason while it seems as if you can find really good Ethiopian food on every corner of Oakland and Berkeley, there has always been a shortage of really good places in San Francisco. That shortage continues even with this new addition.\n\nMoya is a decent but not great Ethiopian food. It will get much love from the gluten-free folks for having gluten-free injera and it will get love from the hardcore carnivores for having three different kinds of kitfo, a sirloin beef dish usually served rare. \n\nThe portion are decent but the prices are 5 dollars more than at most Ethiopian places in the bay area for the same quality of food. \n\nI'll may go back but for really good Ethiopian, I'll still head to a couple of places in the East Bay.", "rating": 3, "date": "2010-08-13"}, {"excerpts": ["The kitfo, tibs, and veggies were all fantastic."], "author": "Andy G.", "review": "Well spiced with excellent injera and generous portions. My new favorite ethiopian spot. They do a good job packing up takeout. The kitfo, tibs, and veggies were all fantastic.", "rating": 5, "date": "2012-12-31"}, {"excerpts": ["We ordered an Azifa for an appetizer and Kitfo, Ye Doro Tibs, and Ye Beg Wot.  ", "All three of the main dishes were great.  ", "The chicken (Ye Doro Tibs) was probably my favorite of the three, which is saying a lot because I'm normally not big on chicken dishes.  ", "Everything had a great amount of spice and was wholly filling.  "], "author": "Yuri Y.", "review": "My girlfriend and I recently moved into the neighborhood and decided to check this place out last night with another friend.  We ordered an Azifa for an appetizer and Kitfo, Ye Doro Tibs, and Ye Beg Wot.  All three of the main dishes were great.  The chicken (Ye Doro Tibs) was probably my favorite of the three, which is saying a lot because I'm normally not big on chicken dishes.  Everything had a great amount of spice and was wholly filling.  For $20 a person we were beyond stuffed when we left the restaurant.  \n\nThe staff was very friendly and would constantly bring us more injera as we devoured the ones in front of us.  The only negative surprise was that they didnt serve beer or wine, but that's something that I should have looked up before we went.  Overall we had a great experience and will definitely be coming back.", "rating": 4, "date": "2010-08-19"}, {"excerpts": ["Came here for dinner and tried the Kitfo, an ethiopian steak tartare medium rare. ", "It was really delicious, and a good sized portion. ", "The owners are nice and the place is very simple and clean."], "author": "Darnell L.", "review": "Came here for dinner and tried the Kitfo, an ethiopian steak tartare medium rare. It was really delicious, and a good sized portion. The owners are nice and the place is very simple and clean.", "rating": 3, "date": "2012-04-26"}, {"excerpts": ["We usually get the kitfo (ground beef) raw, extra spicy, and it never disappoints. ", "The veggie combo is also very good, and it seems to be improving every time we go. "], "author": "Peter D.", "review": "We're regulars here, and we love it.\n\nWe've been Ethiopian food fanatics for more than 3 years, and we eat at Ethiopian restaurants more frequently than we do any other type of restaurant. We've been to at least 6 different restaurants in the south bay and San Francisco, and Moya is hands down the best Ethiopian place in SF. Our other favorite places are Zeni and Rehoboth (both in San Jose). \n\nThe other Ethiopian places in San Francisco are a little off. Sheba Piano Lounge has decent flavors, but it's loud, the portions are small, and it doesn't feel authentic. Assab Eritrean is a good introduction to Ethiopian food, but the food lacks the depth of flavors and spices.\n\nMoya is great. We usually get the kitfo (ground beef) raw, extra spicy, and it never disappoints. The veggie combo is also very good, and it seems to be improving every time we go. I'm guessing as they've become more popular, the veggie dishes (especially the bean-based ones) are fresher and less dry. \n\nEverything else we've tried is also very good -- ye beg tibs (lamb stew), shuro (finely-pureed chickpea), ye timatim selata (shreded bread in dressing), ye beg wot (another lamb stew) -- although I wish the ye timatim selata were a little more lemon-y.\n\nHope more people find this place, but not too many more people; I don't want to wait for a table.", "rating": 5, "date": "2011-01-29"}, {"excerpts": ["the kitfo was GREAT and there was a HUGE portion.  ", "the two of us stuffed ourselves to capacity and still could only finish half of it.  ", "we had enough kitfo for leftovers and made delicious enchiladas with said leftovers.\n\n", "kitfo + veggie sampler - scoutmob discount=$15"], "author": "Christy C.", "review": "the kitfo was GREAT and there was a HUGE portion.  the two of us stuffed ourselves to capacity and still could only finish half of it.  we also shared a veggie combo platter that was awesome.\n\nim also a big fan of leftovers.  we had enough kitfo for leftovers and made delicious enchiladas with said leftovers.\n\nkitfo + veggie sampler - scoutmob discount=$15", "rating": 4, "date": "2011-05-10"}, {"excerpts": ["Amanda generally gets the raw kitfo wherever she goes, and apparently they have a very good one here.  ", "Friendly staff, easy to find parking, and the $8 lunch combo is a great deal.  ", "Will definitely be coming back."], "author": "Phil J.", "review": "Easily the best ethiopean food i've had in San Francisco.  The yellow and red lentil dishes were very very good, and the collard green dish was tasty.  Each dish comes with a salad that has a very nice dressing on it.  Amanda generally gets the raw kitfo wherever she goes, and apparently they have a very good one here.  Friendly staff, easy to find parking, and the $8 lunch combo is a great deal.  Will definitely be coming back.", "rating": 4, "date": "2010-09-08"}, {"excerpts": ["i had the shuro and my boyfriend refuses to order anything but the raw kitfo. ", "we will gladly be back!"], "author": "ashley d.", "review": "my boyfriend and i are HUGE fans of addis in oakland and make it a point to grab ethiopian food before seeing a show at the fox. sigur ros was playing at bill graham on wednesday, so we were happy to have such delicious ethiopian food within walking distance. the food seems somewhat healthier than other ethiopian places i've tried but without a loss of flavor. i had the shuro and my boyfriend refuses to order anything but the raw kitfo. we will gladly be back!", "rating": 4, "date": "2013-04-19"}, {"excerpts": ["The Kitfo is not to be missed, esp. "], "author": "Steve S.", "review": "For a good, inexpensive Ethiopian meal, this is the place. I keep going back and the owners and servers are uniformly warm and friendly - and I love the food.  The Kitfo is not to be missed, esp. the spicy version, and they make the best injera (bread) I've had in SF - including a gluten-free version, also delicious.", "rating": 5, "date": "2011-04-08"}, {"excerpts": ["We ordered Kitfo (raw), Doro wat, Gomen, Shuro and, of course, Injera... the wonderful pancake like bread.  ", "The service is properly attentive and friendly.  ", "The place is clean, the kitchen staff are all Ethiopian, the food is spectacular... ", "what more could you ask.  ", "Go and see...."], "author": "EDWARD S.", "review": "This is, by far, the most authentic Ethiopian Restaurant in San Francisco.  I spent a bit over a year studying in Addis Abba and ate Ethiopian every day.  Eating at MOYA was like going back to the kitchen of the family in Addis Abba who served as my sponsors.  They don't have a Liquor License, so I missed the traditional Tej, but the food... was spectacular.  We ordered Kitfo (raw), Doro wat, Gomen, Shuro and, of course, Injera... the wonderful pancake like bread.  The service is properly attentive and friendly.  The place is clean, the kitchen staff are all Ethiopian, the food is spectacular... what more could you ask.  Go and see....", "rating": 5, "date": "2010-09-23"}], "veggie sampler": [{"excerpts": ["We ordered the Veggie Sampler which was flavorful and enough for two people. ", "Also, the food came out after only 15 minutes of waiting. "], "author": "Aliyah B.", "review": "Tasty Ethiopian spot! We ordered the Veggie Sampler which was flavorful and enough for two people. Also, the food came out after only 15 minutes of waiting. The second plate of food we ordered was somewhat lukewarm, which was probably just because we went an hour before closing.\n\nHighly recommend if you're ever in the area!", "rating": 4, "date": "2018-09-10"}, {"excerpts": ["Boyfriend and I split the veggie sampler, which was the perfect amount of food given neither of us was very hungry. ", "When we are hungrier, we'll order a shuro or the beef tibs."], "author": "Julia C.", "review": "Delicious as always. Boyfriend and I split the veggie sampler, which was the perfect amount of food given neither of us was very hungry. When we are hungrier, we'll order a shuro or the beef tibs.", "rating": 5, "date": "2018-07-11"}, {"excerpts": ["I wish they offered an option to add on a small portion of meat dish to the veggie sampler for $2-$4. ", "Would be well worth it. ", "I asked but they wouldn't allow it."], "author": "Ben D.", "review": "Very tasty vegetable sampler. Satisfied my craving for Ethiopian cuisine.\n\nThe only problem is they don't offer any samplers for the meat dishes. I wish they offered an option to add on a small portion of meat dish to the veggie sampler for $2-$4. Would be well worth it. I asked but they wouldn't allow it.", "rating": 3, "date": "2017-09-10"}, {"excerpts": ["the  veggie sampler and literally everything on the plate had my drooling. ", "I didn't even realize how much I liked collard greens until I ate here. ", "Everything was seasoned perfectly, so glad we stopped by! ", "My mom also really enjoyed her chicken plate. ", "Definitely recommend for veg folks and meat eaters alike!"], "author": "Melanie L.", "review": "This was the first time me or my mom had tried Ethiopian food and it was SO GOOD. I got the  veggie sampler and literally everything on the plate had my drooling. I didn't even realize how much I liked collard greens until I ate here. Everything was seasoned perfectly, so glad we stopped by! My mom also really enjoyed her chicken plate. Definitely recommend for veg folks and meat eaters alike!", "rating": 5, "date": "2017-09-13"}, {"excerpts": ["This place was so delicious stopped by for a quick to go lunch and ordered the veggie sampler. ", "Sooo much flavor the service was on point. ", "No complaints from me."], "author": "Bryan P.", "review": "This place was so delicious stopped by for a quick to go lunch and ordered the veggie sampler. Sooo much flavor the service was on point. No complaints from me.", "rating": 5, "date": "2017-08-11"}, {"excerpts": ["I figured we could not go wrong with the veggie sampler but that was utterly disappointing. ", "It felt like we were eating flavorless pasty mush. ", "The medium spicy chicken with mushrooms (not sure what the actual name is) was not \"medium spicy.", "\" ", "It was more like mild and that item was nothing to rave about. "], "author": "Liana F.", "review": "One word: Bland\nBland bland bland bland bland\nI'm used to Ethiopian food that bursts with flavors that leave my palate happy, my stomach probably with a hole, and my toilet -- actually let's not go there.\n\nI figured we could not go wrong with the veggie sampler but that was utterly disappointing. It felt like we were eating flavorless pasty mush. The medium spicy chicken with mushrooms (not sure what the actual name is) was not \"medium spicy.\" It was more like mild and that item was nothing to rave about. The injera was also a disappointment. It was not really sour so I guess the taste could be compared to faintly sour wheat bread. This place seriously holds back on the spices to cater to Americanized stomachs. WHYYYYYY!\n\nOther cons:\n- They charge for injera\n- Staff is slow at clearing tables for incoming customers to sit\n- What's up with the bathroom...", "rating": 1, "date": "2014-06-29"}, {"excerpts": ["More expensive than some Ethiopian restaurants but the veggie sampler was plenty of food for two of us, so it came out less than $17 total. ", "Right around the corner from ACT which is why we tried it. ", "I'd definitely go back!"], "author": "Shanna L.", "review": "Tiny place with nice staff and excellent food! Got the gluten free injera which is a deal-breaker for me. More expensive than some Ethiopian restaurants but the veggie sampler was plenty of food for two of us, so it came out less than $17 total. Right around the corner from ACT which is why we tried it. I'd definitely go back!", "rating": 5, "date": "2017-10-04"}, {"excerpts": ["The veggie sampler was absolutely delicious and reminded me of what Asmara in the East Bay used to taste like a few years ago. \n\n\n"], "author": "Rakesh L.", "review": "Ate good Ethiopian food after a long time. The veggie sampler was absolutely delicious and reminded me of what Asmara in the East Bay used to taste like a few years ago. \n\n\nThe spicy red lentil stew was just the right level of spice and the yellow lentil was just the right level of bland without losing its flavor. Not a huge fan of the green beans and cabbage stew, but fine! The collard green could have been chopped a wee bit finer but didn't lack in the taste department. \n\nThis is certainly going to be my go-to for Ethiopian food in the future!", "rating": 4, "date": "2015-06-13"}, {"excerpts": ["I got the veggie sampler for a lunch special and it was soooo much food for such a good deal! ", "About $9 for my plate of salad, red lentils, yellow lentils, collard greens, and this potato/carrot/green bean/cabbage thing. ", "Very tasty! ", "The injerah was also super soft and didn't brittle up like it normally does! ", "I'll be back to try the meat dishes!"], "author": "Diane H.", "review": "One of the best Ethiopian I've had yet!! It's a cafe style so it's kind of informal. You order in the front and then they bring out your food. I got the veggie sampler for a lunch special and it was soooo much food for such a good deal! About $9 for my plate of salad, red lentils, yellow lentils, collard greens, and this potato/carrot/green bean/cabbage thing. Very tasty! The injerah was also super soft and didn't brittle up like it normally does! I'll be back to try the meat dishes!", "rating": 5, "date": "2014-05-07"}, {"excerpts": ["Ordered the veggie sampler +  "], "author": "An Y.", "review": "I hadn't liked Ethiopian food the first time I tried it, but liked it here.\n\nOrdered the veggie sampler +  sigga tibs (sauteed beef) on injera served traditional style. Enough for two people, with leftovers.\n\nClean, modern looking decor. Not a whole lot of seating. Good place for small groups, 1:1 conversations/catch-ups.\n\nFriendly service!", "rating": 4, "date": "2014-02-09"}, {"excerpts": ["We got the veggie sampler and the tofu tibs, and while we can usually agree on one menu item in situations like these that doesn't match up to the rest-- but not here.  ", "It was all standout-delicious in its own way and totally conducive to mixing.  "], "author": "Allison M.", "review": "I just want MOYA!\n\nWe came here on the way out of the city, having not eaten since our gluttonous but unregrettable breakfast of homemade cinnamon roll pancakes (that's right, be jealous)... I was starving and couldn't wait until we got home to eat.  So we ended up here, having talked about getting Ethiopian food for the past few weeks.\n\nIt's owned by a friendly family.  The prices are more than reasonable, the ambience is that industrial San Francisco feel that totally works in SoMA... But more than anything, we need to talk about the food.\n\nThe food, habibi.  It's the business.  We got the veggie sampler and the tofu tibs, and while we can usually agree on one menu item in situations like these that doesn't match up to the rest-- but not here.  It was all standout-delicious in its own way and totally conducive to mixing.  The injera was fresh and perfect, with that characteristic sour bite.  And apparently I've learned to eat Ethiopian food in a way that it doesn't expand so uncomfortably in my stomach.  Such a pro!", "rating": 5, "date": "2013-03-04"}, {"excerpts": ["We got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. ", "Everything was exceptionally tasty and well-cooked. ", "The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. ", "Out of all the veggie entrees, I think the gomen was the best. "], "author": "Josephine L.", "review": "My friend and I stumbled upon this place by accident while looking for a warm place to duck in for a bit around Market St. She had never had Ethiopian food and it's one of my favorite cuisines so I figured we'd both enjoy Moya.\n\nThe restaurant can be a bit confusing in terms of how you order and are seated. Despite all the people who might be sitting at tables around you, you do have to order your food up front and pay first before seating yourself. The staff will bring out the food to you, but they don't exactly wait on you like in traditional restaurants. It's very cafeteria-style.\n\nWe got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. Everything was exceptionally tasty and well-cooked. The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. Out of all the veggie entrees, I think the gomen was the best. The injera was one of the least \"soggy\"-feeling ones I've ever had but had all of that delicious sourness you expect. I was initially worried that they wouldn't provide enough injera for the two of us, but it turned out to be plenty. In fact, we had more than enough to take home for leftovers. Injera heats up so well in the microwave, because it already has a naturally soggy texture so the moisture from the heat doesn't really affect it.\n\nThe space is very new and sleek 'n' chic, as I like to describe modern aesthetics. And I have to rave about the staff. Some of the nicest people I have ever encountered. They were so warm, welcoming and accommodating to us. They seemed genuinely concerned that we enjoyed the food and went out of their way to make sure everything was to our liking. Very sweet.", "rating": 4, "date": "2012-09-02"}, {"excerpts": ["We were led to believe on the menu stuck to the window that each veggie sampler was $9.95. "], "author": "Alice T.", "review": "I came here for dinner with my husband and we ordered two veggie samplers. We were led to believe on the menu stuck to the window that each veggie sampler was $9.95. However, when we went in to the cash register, it ended up costing $12.95. \n\nAs a matter of principle, I queried this as it is deceptive and misleading advertising. I was not disputing the price, as the server was arguing with me, but I was asking why they had advertised the incorrect price for the meal. All other restaurants can advertise the correct price on their menu!!\n\nThe server responded that they had just put the wrong menu out, however like I explained, that is not my error. Moya (like all restuarants, cafes, bars, pubs etc) should have the CORRECT price advertised on their menu's, otherwise it is deceptive and misleading to the customer.\n\nMoya, just so you are all aware in the United States, there are state and federal false advertising laws that prohibit various types of deceptive advertising, misleading labeling, and related practices. False advertising laws provide important rights for consumers and competitors, arming them with the ability to seek redress when they've been overcharged unlawfully.\n\nAn advertisement is a message that promotes a product or a service or gives information to the public. Advertisements may take many forms; such as press advertisements in newspapers or magazines, television and radio advertisements or SIGNS and MENUS in SHOPS.\n\nMisleading advertising means advertising that deceives or is likely to deceive anyone that sees it. Misleading advertising may affect consumers' choices regarding what they buy, such as advertising a meal for $9.95 when the amount charged is $12.95. It's worth bearing in mind, that it may be an offence for a trader to advertise good or services if it is likely to mislead and therefore cause loss (financial or otherwise) to the public.\n\nThe server then began arguing that the price was $12.95 so I used an example... would you go to a store and buy a coke advertised for $1.00 then when you go to pay for it, you are charged $2.00? Would you be happy that the incorrect price was advertised? Or would you pay the $2.00 and be happy with the fact you were misled by a false price? When I mentioned this to the server, she became more irate and asked us to leave.......... and  short changing us, we had paid $30 for our two meals and the server refunded $21\n\nClearly being dishonest and unethical is more important than good customer service.\n\nIn summary, Moya;\n\n1. Deceptive and misleading advertising on their menus - prices are incorrect, you need to correct the prices. If a meal is $12.95 it should be $12.95 on the menu and NOT $9.95\n2. Short change people - a refund is the FULL amount. I paid $30 not $21\n3. Unethical business practice and dishonest\n4. No apology was offered, staff were rude\n\nPlease read:\nCalifornia's False Advertising Law and California's Consumers Legal Remedies Act\n\n\nDishonest conduct - shame on you, Moya.", "rating": 1, "date": "2014-08-01"}, {"excerpts": ["Veggie sampler and Kitfo with collard greens is the way to go. ", "Make sure you ask for medium spicy if you like your tastebuds."], "author": "Jeremie H.", "review": "One of my favorite, healthy dining options in SF. Veggie sampler and Kitfo with collard greens is the way to go. Make sure you ask for medium spicy if you like your tastebuds.", "rating": 5, "date": "2015-12-29"}, {"excerpts": ["Here is the review:\n\nVeggie Sampler:  "], "author": "Evelyn N.", "review": "I was looking for a great Ethiopian restaurant when I found Moya.  When I googled mapped it, I realized it's only 5 blocks from my house, PERFECT!   So this place gets 4 stars for the 100% teff injera alone!  Mmmmm, it was so good.  So nutty and flavorful compared to regular injera, totally worth the extra $2.  The food tasted very healthy, not oily at all compared with other Ethiopian restaurants I've been to.  \n\nMy husband and I ordered everything vegan!  Here is the review:\n\nVeggie Sampler:  This did not exactly match the online menu.  It came with MISIR WOT (red lentil) which was sooooooooo good, just the right spiciness level for me. And not oily at all! Hooray!  It also had KIK ALI-CHA (yellow pea).  I didn't like this one, it was completely bland, not even a touch of flavor.  My husband liked it .  But i think This one really could have used some extra kick.  GOMEN (collard greens), again, not a ton of flavor.  There was also a potato/carrot dish.  This one is a common dish in all ethiopian restaurants.  It tasted to me like it always does.  There was also a nice little salad with this plate.  Refreshing.  \n\nSuro:  This was a chickpea stew with 15 spices.  It had a great flavor (right in between the lentil and pea dishes in terms of spiciness).  It had a very creamy consistency though. \n\nINGUDAI TIBS:  Mushrooms. The kind waitress brought this dish out for free when she saw how much we were enjoying the food.  This had an excellent flavor!  A good kick to it with the jalapeño.  It was really good. \n\nI think they could do a bit better job on the decor.  They are in a brand new building, and the whole place just felt a little too sterile and new.  \n\nI wish they had an Ocra dish on the menu, but they're a small shop, so I understand that they have to draw the line somewhere.\n\nI'll be back for sure!!!  I have a feeling I'm going to be a regular for the red lentil dish and 100% teff injera.", "rating": 4, "date": "2012-07-08"}, {"excerpts": ["Between two of us, we ordered the Veggie sampler and Doro Tibs, which was just the right amount of food.  "], "author": "Audrey C.", "review": "So this was my first experience with Ethiopian food and it was great!  The menu was easy to navigate and the owner was uber friendly!\n\nWe decided to grab dinner at Moya on our way to the Orpheum, since it was a) nearby and b) a quick meal.  We ended up finding street parking out front, and was able to park there all night (during the show), which made everything a perfect fit.\n\nIt's a small cafe that can seat just under 50 people.  You order at the counter first, then they bring your food out to you.  Between two of us, we ordered the Veggie sampler and Doro Tibs, which was just the right amount of food.  Our meal was served on one large plate, over Injera, with a separate plate of Injera served to us, as well.  We both had hearty appetites, and still somehow managed to have a few bites left over.\n\nOverall, I had a good experience and food was good.  Will I go back? Maybe if I'm in the area... It was definitely a quick option, for a meal before going to the Orpheum.\n\nAll in all, I'd say 3.5 stars.", "rating": 3, "date": "2013-05-29"}, {"excerpts": ["Gluten free injera, veggie sampler (of course) spiced so deliciously. ", "And super friendly staff.\n", "The restaurant itself is a bit cold feeling with the warehousy vibe, but the food is too good to care."], "author": "Krista H.", "review": "I don't give out 5 stars unless i mean it and I do. Gluten free injera, veggie sampler (of course) spiced so deliciously. And super friendly staff.\nThe restaurant itself is a bit cold feeling with the warehousy vibe, but the food is too good to care.", "rating": 5, "date": "2014-03-07"}, {"excerpts": ["We generally get the Veggie Sampler and add Siga Tibs (the Doro Tibs is also out of this world). ", "Between the delicious food and friendly staff, Moya has become one of our favorite spots in SF."], "author": "Russ M.", "review": "I love this place! We generally get the Veggie Sampler and add Siga Tibs (the Doro Tibs is also out of this world). Between the delicious food and friendly staff, Moya has become one of our favorite spots in SF.", "rating": 5, "date": "2014-02-16"}, {"excerpts": ["My meal for the veggie sampler was $8.50 two years ago ", "(I still have the receipt), "], "author": "Brandon J.", "review": "I recently came here after being here 2 years ago\n\nMy meal for the veggie sampler was $8.50 two years ago (I still have the receipt), this time my bill was $15.00\n\nThat's ridiculous. That's almost a 200% increase in 2 years\n\nThis is not worth a 200% increase", "rating": 1, "date": "2015-09-30"}, {"excerpts": ["I had the chicken with mushrooms, veggie sampler and mushrooms. "], "author": "Natalie S.", "review": "Great find on 9th. It's a clean small restaurant that serves up delicious Ethiopian food. All of the dishes are to be shared and come with injera and salad. I had the chicken with mushrooms, veggie sampler and mushrooms. If you want spicy, they can make it very spicy!!!\n\nService was great considering you order at the counter and seat yourselves. They also have a highchair if you need it. \n\nDefinitely on our list of SF staples.", "rating": 5, "date": "2013-09-18"}, {"excerpts": ["A social dining place to share ordered the veggie sampler with siga tibs. ", "It was really delicious, the beef was done just right. ", "A causal dinning place with fantastic food. ", "Recommended."], "author": "Kelly Y.", "review": "A social dining place to share ordered the veggie sampler with siga tibs. It was really delicious, the beef was done just right. A causal dinning place with fantastic food. Recommended.", "rating": 5, "date": "2014-06-12"}, {"excerpts": ["Try the veggie sampler and you can't go wrong."], "author": "Fallon M.", "review": "Huge fan - this place is a gem in a somewhat cutty part of town. Food comes out quickly, they offer online ordering, I can't stop eating there. Try the veggie sampler and you can't go wrong.", "rating": 4, "date": "2015-04-14"}, {"excerpts": ["She brought me a veggie sampler and chicken drumsticks with rice. ", "I really underestimated this food because I didn't really expect it to taste as good as it did. ", "I will definitely be returning to this restaurant in the near future. ", "Great food along with great service!"], "author": "Branden S.", "review": "I've always been curious about Ethiopian food, but never had the opportunity until now. Glad to say my introduction was a great one. The waitress (I think her name was Mellay) was very polite, and helpful, very pretty as well. She really made the experience worth while. I wasn't sure about what to order, so I let her know that I didn't really fancy spicy food, and asked her for her recommendation and she said she would take care of me, and she did. She brought me a veggie sampler and chicken drumsticks with rice. I really underestimated this food because I didn't really expect it to taste as good as it did. I will definitely be returning to this restaurant in the near future. Great food along with great service!", "rating": 5, "date": "2014-11-15"}, {"excerpts": ["The veggie sampler is my favorite from the menu and the sandwiches are also a great choice. ", "This is a great lunch for sharing."], "author": "Dana O.", "review": "Quite possibly some of the nicest people in the neighborhood, I love the people of Moya. The veggie sampler is my favorite from the menu and the sandwiches are also a great choice. This is a great lunch for sharing.", "rating": 4, "date": "2014-04-24"}, {"excerpts": ["You can't go wrong with the veggie sampler, but when I'm on a budget "], "author": "Angelica D.", "review": "I love coming here. The restaurant is literally right next door to my office, which is quite dangerous considering you only need to be within a 500 ft. radius of the place in order to get a tantalizing whiff of the delicious spices at play in all their dishes. Plus the staff is super friendly and helpful when an indecisive girl like me leaves the decision-making up to them ;)\n\nYou can't go wrong with the veggie sampler, but when I'm on a budget I really like getting the red lentil rolled into the injera bread, and cut into cocktail roll pieces. $5+tax. Not too shabby, especially for something so tasty! I can only ever get through 3/4 of it, anyway. Mmmm...I think I'll get some tomorrow..", "rating": 5, "date": "2012-10-17"}, {"excerpts": ["I do regret not ordering the veggie sampler that everyone talks about. \n\n"], "author": "Kirita S.", "review": "I wanted to check this place out because their reviews were good so I went with my boyfriend during my lunch break. My first time trying Ethiopian food and I am in love now. The ambience fits perfectly with its location (downtown S.F. industrial). The staff is very friendly and the place is surprisingly very spacious. We came in just before the lunch rush hour so we got our food in a timely manner. \n\nI had the Ingudai Doro Tibs platter extra spicy and it was amazing. The injera (ethiopian bread) has a very interesting texture almost spongy but I quite enjoyed it. I do regret not ordering the veggie sampler that everyone talks about. \n\nTheir lunch menu is one page which is very fitting because I hate restaurants with menus the size of a short novel. I will definitely be coming back to this place so I can try some more of their items.\n\n*like any where else in the city parking is hard to find; however, we got lucky and snagged a parking spot a few feet away from the restaurant.", "rating": 4, "date": "2013-05-23"}, {"excerpts": ["The veggie sampler, an order of the Dora Tibs, and an extra order of Injera bread was the ample for 2 adults and 2 kids.\n\n"], "author": "Rudy R.", "review": "Our family tried Moya for the first time this weekend and the kids loved the DORA TIBS and eating with their hands.  The staff was family friendly and immediately pushed two tables together to accommodate us.  The food was good and served QUICKLY.  The veggie sampler, an order of the Dora Tibs, and an extra order of Injera bread was the ample for 2 adults and 2 kids.\n\nReally, an Ethiopian restaurant should have a sink outside of the bathroom area so patrons can quickly and easily wash their hands before the meal.  Dealing with the bathroom key (understood as it is SOMA) and only one bathroom is not very efficient.", "rating": 4, "date": "2012-06-24"}, {"excerpts": ["Veggie sampler\n\nReally love this place and couldn't be happier that they are on 9th!!"], "author": "liz c.", "review": "Hooooray! Great new place to eat at in SOMA. \n\nWonderful place to eat lunch at during the week. The staff is warm and friendly. The service is quick. The place is clean unlike the sidewalk directly outside the door.\n\nMy recs: \nGursha - injera with red lentils ($6 for a box of rolls; great for a small lunch kind of day), the veggie \n\nMushroom- Chicken Tibs - a very savory stew with mushroom and chicken. It's delicious and very filling.\n\nVeggie sampler\n\nReally love this place and couldn't be happier that they are on 9th!!", "rating": 4, "date": "2012-06-19"}, {"excerpts": ["The veggie sampler and injera were great;  Can't wait to try more items.  ", "Hopefully you'll be able to serve honey wine again."], "author": "Tony D.", "review": "Welcome to the neighborhood!  I was quite excited to find out you were reopening so close by, it was well worth the wait.\n\nThe veggie sampler and injera were great;  Can't wait to try more items.  Hopefully you'll be able to serve honey wine again.", "rating": 4, "date": "2012-05-02"}, {"excerpts": ["The veggie sampler was delicious."], "author": "Valerie D.", "review": "Went to dinner here the other night on a recommendation from a Lyft driver. The veggie sampler was delicious.", "rating": 4, "date": "2015-07-29"}, {"excerpts": ["I ordered the veggie sampler lunch and the portion of lentils, potatoes and salad was really huge. ", "The salad has more of a 'california' twist to it than I would have preferred and they had a side dish that resembled more of a Mexican salsa fresca than anything Ethiopian ", "so I have to ding them a bit for true authenticity. \n", "I had to round up to four stars ", "but I would've really given this place a 3.5. ", "Having just returned from a trip to Ethiopia, I was excited when a friend asked me to do lunch at a local Ethiopian cafe. ", "I saw on their website that they offer macchiato, which got me really excited. \n", "Unfortunately, their machine was broken and the only alternative was just a drip coffee they had made. ", "Bummer. \n"], "author": "Drea C.", "review": "Overall, it was a good experience. I ordered the veggie sampler lunch and the portion of lentils, potatoes and salad was really huge. The salad has more of a 'california' twist to it than I would have preferred and they had a side dish that resembled more of a Mexican salsa fresca than anything Ethiopian so I have to ding them a bit for true authenticity. \nI had to round up to four stars but I would've really given this place a 3.5. Having just returned from a trip to Ethiopia, I was excited when a friend asked me to do lunch at a local Ethiopian cafe. I saw on their website that they offer macchiato, which got me really excited. \nUnfortunately, their machine was broken and the only alternative was just a drip coffee they had made. Bummer. \nAlso, the portion of injera that goes along with lunch was a little too small and an extra order costs $2 bucks. As a redeeming factor, however, the staff was extremely friendly (I expect no less from Ethiopians!) and she ended up giving it to us for free.\nAmasegenalu!! \n\nPS: if anyone out there who is a big fan of Ethiopian food has managed to find fruit \"spreece\" or salad \"atakelt\", please let me know!! I miss them so much!!", "rating": 4, "date": "2013-09-21"}, {"excerpts": ["Go for the veggie sampler.  ", "My boyfriend loves this ethnic urban adventure of flavor.  ", "For me it is a little heavy, but its good for what it is!"], "author": "Rebecca F.", "review": "Go for the veggie sampler.  My boyfriend loves this ethnic urban adventure of flavor.  For me it is a little heavy, but its good for what it is!", "rating": 4, "date": "2013-05-06"}, {"excerpts": ["The veggie sampler was amazing.  ", "Everything we ate was amazing.  ", "The restaurant itself is small and not particularly special, but the food.... RECOMMEND!!!  ", "Also, who doesn't like to eat with their hands"], "author": "Jenn M.", "review": "My friend, Sarah, recommended this place as a place to eat before attending a lecture at CIIS.  I realized when I walked in that I hadn't had Ethiopian food since I left Fort Collins.  Now that I have found this place, I will be having Ethiopian food much more frequently.  I will go out of my way to eat here and I'm noting that it is close to Slim's and will be a good pre-show place to meet up for food.  If they only served alcohol, this place would be perfect.  The veggie sampler was amazing.  Everything we ate was amazing.  The restaurant itself is small and not particularly special, but the food.... RECOMMEND!!!  Also, who doesn't like to eat with their hands", "rating": 5, "date": "2012-08-04"}, {"excerpts": ["My friend and I split the veggie sampler. ", "The red lentil stew was my favorite. ", "The house salad had a delightfully tangy dressing. "], "author": "Sonia S.", "review": "I live around the corner from this place and have been wanting to try it for so long as its spicy aromas waft throughout the neighborhood. I finally got to last night and was not let down at all.\n\nMy friend and I split the veggie sampler. The red lentil stew was my favorite. The house salad had a delightfully tangy dressing. There was plenty of injera and we finished it off with a baklava-style desert I didnt catch the name of. We were both sufficiently stuffed.\n\nThe service was fast the the cashier/waitress was friendly. I learned they do take-out so I will definitely be taking advantage of that!", "rating": 5, "date": "2013-03-29"}, {"excerpts": ["Go with the veggie sampler and you can't go wrong."], "author": "Alex G.", "review": "I happened upon this place and I highly recommend me. The food is good and staff is friendly. Go with the veggie sampler and you can't go wrong.", "rating": 4, "date": "2012-12-08"}, {"excerpts": ["kitfo + veggie sampler - scoutmob discount=$15"], "author": "Christy C.", "review": "the kitfo was GREAT and there was a HUGE portion.  the two of us stuffed ourselves to capacity and still could only finish half of it.  we also shared a veggie combo platter that was awesome.\n\nim also a big fan of leftovers.  we had enough kitfo for leftovers and made delicious enchiladas with said leftovers.\n\nkitfo + veggie sampler - scoutmob discount=$15", "rating": 4, "date": "2011-05-10"}, {"excerpts": ["We usually get the veggie sampler and the chicken stir fry dish. ", "Very feeling and makes for great left overs. ", "This is a clean, family owned business. ", "I LOVE Moya."], "author": "Ronnie M.", "review": "I love this place. Great food, quick service nice SOMA vibe. The injera is great! We usually get the veggie sampler and the chicken stir fry dish. Very feeling and makes for great left overs. This is a clean, family owned business. I LOVE Moya.", "rating": 5, "date": "2012-09-29"}], "misir wot": [{"excerpts": ["We ordered a siga tibs (beef) and misir wot (spicy lentils) and it was served in a nice big plate with plenty of injera to share and a fresh green salad in the center. ", "Everything was flavorful and delicious. ", "The food arrived quickly and tasted so good! ", "There's water on the side but they have a few drinks you can buy too. \n", "This is real injera bread that is totally gluten-free. "], "author": "Kim L.", "review": "Want a simple, quick, home-cooked, authentic Ethiopian meal? Then Moya is your place. We decided to go here after having some beers two blocks away at Cellarmaker and this fit the bill. \n\nI won't lie, I was skeptical when I walked in because I've been to a few Ethiopian restaurants and they usually try to make it a more classy, restaurant feel but this one felt like counter service cooked by a family. Sure, the lady behind the counter isn't the most welcoming but she cooks a mean meal. We ordered a siga tibs (beef) and misir wot (spicy lentils) and it was served in a nice big plate with plenty of injera to share and a fresh green salad in the center. Everything was flavorful and delicious. The food arrived quickly and tasted so good! There's water on the side but they have a few drinks you can buy too. \nOverall, this meal was just under $30 and made us both full and happy. \n\nGluten intolerant folks rejoice! This is real injera bread that is totally gluten-free. Not to mention, delicious and served generously. \n\nNext time I swing by SoMa and eat at Cellarmaker, I'll definitely come back for more.", "rating": 4, "date": "2018-02-07"}, {"excerpts": ["eats: Misir Wot) spicy red lentils stew, 10.95)\n-choose injera bread, great for dipping\n-small, tasty. ", "fresh spring mix salad\n-misor ", "wot had some heat, filled me up quickly\nhungry an hour later, too busy to grab something else to eat.\n"], "author": "Victor G.", "review": "Moya is a coffee stop that offers Ethiopian vegeterian and meat dishfes, no sammies.\n\neats: Misir Wot) spicy red lentils stew, 10.95)\n-choose injera bread, great for dipping\n-small, tasty. fresh spring mix salad\n-misor wot had some heat, filled me up quickly\nhungry an hour later, too busy to grab something else to eat.\n3 stars quantity, 4 stars quality.\n\ntake outs:\n-found park, but ate on the run. (spot lights)\n-food $4 higher than food truck for equivalent eats.\n.s.f. rates not cheap either.\n-quick service, smiple menu. next time trying another veggie stew. no meats yet.\n-parking found in alley....no meters.", "rating": 4, "date": "2016-09-22"}, {"excerpts": ["We got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. ", "Everything was exceptionally tasty and well-cooked. ", "The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. ", "Out of all the veggie entrees, I think the gomen was the best. "], "author": "Josephine L.", "review": "My friend and I stumbled upon this place by accident while looking for a warm place to duck in for a bit around Market St. She had never had Ethiopian food and it's one of my favorite cuisines so I figured we'd both enjoy Moya.\n\nThe restaurant can be a bit confusing in terms of how you order and are seated. Despite all the people who might be sitting at tables around you, you do have to order your food up front and pay first before seating yourself. The staff will bring out the food to you, but they don't exactly wait on you like in traditional restaurants. It's very cafeteria-style.\n\nWe got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. Everything was exceptionally tasty and well-cooked. The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. Out of all the veggie entrees, I think the gomen was the best. The injera was one of the least \"soggy\"-feeling ones I've ever had but had all of that delicious sourness you expect. I was initially worried that they wouldn't provide enough injera for the two of us, but it turned out to be plenty. In fact, we had more than enough to take home for leftovers. Injera heats up so well in the microwave, because it already has a naturally soggy texture so the moisture from the heat doesn't really affect it.\n\nThe space is very new and sleek 'n' chic, as I like to describe modern aesthetics. And I have to rave about the staff. Some of the nicest people I have ever encountered. They were so warm, welcoming and accommodating to us. They seemed genuinely concerned that we enjoyed the food and went out of their way to make sure everything was to our liking. Very sweet.", "rating": 4, "date": "2012-09-02"}, {"excerpts": ["It came with MISIR WOT (red lentil) which was sooooooooo good, just the right spiciness level for me. ", "And not oily at all! ", "Hooray!  ", "It also had KIK ALI-CHA (yellow pea).  ", "I didn't like this one, it was completely bland, not even a touch of flavor.  ", "My husband liked it .  ", "But i think This one really could have used some extra kick.  "], "author": "Evelyn N.", "review": "I was looking for a great Ethiopian restaurant when I found Moya.  When I googled mapped it, I realized it's only 5 blocks from my house, PERFECT!   So this place gets 4 stars for the 100% teff injera alone!  Mmmmm, it was so good.  So nutty and flavorful compared to regular injera, totally worth the extra $2.  The food tasted very healthy, not oily at all compared with other Ethiopian restaurants I've been to.  \n\nMy husband and I ordered everything vegan!  Here is the review:\n\nVeggie Sampler:  This did not exactly match the online menu.  It came with MISIR WOT (red lentil) which was sooooooooo good, just the right spiciness level for me. And not oily at all! Hooray!  It also had KIK ALI-CHA (yellow pea).  I didn't like this one, it was completely bland, not even a touch of flavor.  My husband liked it .  But i think This one really could have used some extra kick.  GOMEN (collard greens), again, not a ton of flavor.  There was also a potato/carrot dish.  This one is a common dish in all ethiopian restaurants.  It tasted to me like it always does.  There was also a nice little salad with this plate.  Refreshing.  \n\nSuro:  This was a chickpea stew with 15 spices.  It had a great flavor (right in between the lentil and pea dishes in terms of spiciness).  It had a very creamy consistency though. \n\nINGUDAI TIBS:  Mushrooms. The kind waitress brought this dish out for free when she saw how much we were enjoying the food.  This had an excellent flavor!  A good kick to it with the jalapeño.  It was really good. \n\nI think they could do a bit better job on the decor.  They are in a brand new building, and the whole place just felt a little too sterile and new.  \n\nI wish they had an Ocra dish on the menu, but they're a small shop, so I understand that they have to draw the line somewhere.\n\nI'll be back for sure!!!  I have a feeling I'm going to be a regular for the red lentil dish and 100% teff injera.", "rating": 4, "date": "2012-07-08"}, {"excerpts": ["Loved the vegetarian injera, Doro tibs and misir wot!"], "author": "Madhuri S.", "review": "A small place with a seating seating capacity of 20 may be.. Not so elegant and fancy.. Mostly quiet.. But the food is to die for.. They are best at what they are expected to do.. That's serving great food.. Good option for vegetarians.. Spicy and great portions.. Have an option to order food family style, which works out great.. Loved the vegetarian injera, Doro tibs and misir wot!", "rating": 5, "date": "2014-04-10"}, {"excerpts": ["We also ordered Kifto and Misir Wot.\n\n"], "author": "Angelika R.", "review": "I never had Ethiopian Food before, but I would go back in a heartbeat.\nMoya is a lovely little Restaurant with a good atmosphere and very friendly service.\nMy friend and I were skipping through the menu whilst waiting on our other friends and I mentioned I did not know what to expect. The waitress overheard us, came over and started explaining Ethopian Food. she also recommended 2 of the dishes - one meat and one veggie.\nShe sounded very convincing so we decided to order the recommended Shuro and the Ye Doro Wot. We also ordered Kifto and Misir Wot.\n\nAll dishes were served with salad on a huge pice of Ethiopian bread. It smelled delicious (spicy and rich in flavors, texture similar to Indian food, but slightly less layers of spiciness/richness) and looked wonderful. Once the bread was brought we started digging in.\nMy fav was the chicken marinated in lemon juice. I simple could not stop eating it. The meat was cooked to perfection - falling of the bone the minute you touched it.\nThe raw beef was delicious too, very filling though. \nMy friends loved the Shuro - fairly spicy but irresistible.\nWe got to try three different versions of food, and I recommend the real deal - it tastes like dark bread - mhhhhh.\n\nAll in all it was a successful evening - very social - eating family style from one big plate with your fingers, great & friendly service and extremely reasonable priced.", "rating": 4, "date": "2010-08-16"}, {"excerpts": ["Service was super friendly, food tasty (misir wot was my favorite) and  prices very reasonable! "], "author": "Dana S.", "review": "Ethiopian restaurants are popular for their veggie fare and in this regard Moya did not disappoint. Their menu boasts plenty of veggie options, the staples of any good Ethiopian place -- a veggie combo and shuro, and even a tofu dish! I ordered the veggie combo (vegan) with my date, and we both left full. I look forward to coming back again and trying the shuro and appetizers!\n\nService was super friendly, food tasty (misir wot was my favorite) and  prices very reasonable! Good injera and being open for lunch earns them bonus points. A few new-restaurant kinks but I have no doubt they will be worked out. \n\nHaving an Ethiopian place downtown is going to be very satisfying for my taste buds but very dangerous for my pocketbook. :)", "rating": 5, "date": "2010-07-17"}, {"excerpts": ["The misir wot was more al dente than others we've tried, but the flavor was still spot on. "], "author": "Stephanie L.", "review": "A group of us came by here for dinner and were really pleased with our experience. The service was really fast compared to other Ethiopian restaurants we've eaten at in the Bay Area, and it was nice to be able to specify how spicy we wanted our food. We really enjoyed the mushroom tibs and the shuro. The misir wot was more al dente than others we've tried, but the flavor was still spot on. Also the injera was thinner and doughier than I'm used to, but again, it was still delicious. I will definitely come back here again when I'm in the area!", "rating": 5, "date": "2015-01-17"}, {"excerpts": ["the MIsir Wot, which they kindly put on a separate plate so that my veggie dish wouldn't be \"contaminated\" with everyone else's meat.  ", "Thankfully I shared because everyone else loved my dish.  "], "author": "Olivia T.", "review": "Great Ethiopian restaurant owned/operated by a nice woman and her daughters.  It's so nice to support small local businesses, but Moya makes it easy with their awesome food.  I had the MIsir Wot, which they kindly put on a separate plate so that my veggie dish wouldn't be \"contaminated\" with everyone else's meat.  Thankfully I shared because everyone else loved my dish.  It was so good and the injera was delicious.  \n\nWish I could stop by for their lunch special, but it's too far away.  Sad :(  But honestly their normal prices aren't expensive and it's totally worth the price.  They also seem to have an $8 corkage fee?  So that's super cheap too.", "rating": 4, "date": "2011-04-29"}], "mushroom tibs": [{"excerpts": ["I just had the mushroom tibs, spicy for lunch. ", "It was sooooooo good! ", "I forget that I have this gem in my neighborhood, I should order more often! ", "Thank you Moya."], "author": "M G.", "review": "So flavorful! I just had the mushroom tibs, spicy for lunch. It was sooooooo good! I forget that I have this gem in my neighborhood, I should order more often! Thank you Moya.", "rating": 5, "date": "2017-03-23"}, {"excerpts": ["I like the mushroom tibs and the yellow lentils. ", "Get it spicy. ", "It is tasty indeed. "], "author": "Margaret S.", "review": "Great place for vegetarians. I like the mushroom tibs and the yellow lentils. Get it spicy. It is tasty indeed. You can have it with brown rice or the sour bread. \n\nDon't mind the weirdos outside. The place inside is good, clean and delicious.", "rating": 4, "date": "2014-07-19"}, {"excerpts": ["the first time I've seen tofu or mushroom tibs on a menu ", "and I'll be craving both until I return to SF. ", "super friendly and accommodating staff. ", "when I ate there they had just returned from Eithiopia with spices - which they blend themselves - for truly original flavours. ", "both of the above tibs were cooked to order and I was given the choice of spice level. "], "author": "Lentil C.", "review": "Best vegan Ethiopian dishes in North America (out of the 20+ places I've eaten - including DC!) amazing flavours and variety. the first time I've seen tofu or mushroom tibs on a menu and I'll be craving both until I return to SF. super friendly and accommodating staff. when I ate there they had just returned from Eithiopia with spices - which they blend themselves - for truly original flavours. both of the above tibs were cooked to order and I was given the choice of spice level. gluten free injera available. dead animal options also available.", "rating": 5, "date": "2015-01-31"}, {"excerpts": ["We ordered the vegetarian platter and the mushroom tibs. ", "The vegetarian platter was pretty bland and tasteless - I think my favorite entree on that was the spicy red lentils. ", "The mushroom tibs were wayy too spicy; it practically tasted like they accidentally dumped a bunch of chili powder on it. ", "Wasn't the best and wasn't the worst, but I'm not sure if I'd go back."], "author": "Malika R.", "review": "I had heard some great things about this place but I was disappointed. I lived around Berkeley a lot and got to try lots of good Ethiopian food and this did not live up to those standards. We ordered the vegetarian platter and the mushroom tibs. The vegetarian platter was pretty bland and tasteless - I think my favorite entree on that was the spicy red lentils. The mushroom tibs were wayy too spicy; it practically tasted like they accidentally dumped a bunch of chili powder on it. Wasn't the best and wasn't the worst, but I'm not sure if I'd go back.", "rating": 3, "date": "2014-08-11"}, {"excerpts": ["We really enjoyed the mushroom tibs and the shuro. "], "author": "Stephanie L.", "review": "A group of us came by here for dinner and were really pleased with our experience. The service was really fast compared to other Ethiopian restaurants we've eaten at in the Bay Area, and it was nice to be able to specify how spicy we wanted our food. We really enjoyed the mushroom tibs and the shuro. The misir wot was more al dente than others we've tried, but the flavor was still spot on. Also the injera was thinner and doughier than I'm used to, but again, it was still delicious. I will definitely come back here again when I'm in the area!", "rating": 5, "date": "2015-01-17"}], "tofu tibs": [{"excerpts": ["I also ordered Tofu Tibs. ", "The Doro Tibs was out of this world, and while the Tofu Tibs was flavorful, it just reminded me of sauteed tofu - don't know why I thought it would be fried or something. \n\n"], "author": "Aivy C.", "review": "Really good find in SOMA! \n\nOne of my girlfriends picked me up from work and we were en route to a theater rehearsal when I mentioned we probably ought to pick up some food and this was her suggestion. I love, love love Ethiopian food and at that point I hadn't had it in quite some time so we stopped off here. \n\nI ordered my usual, the Doro Tibs, and a side of Injera - and out of curiosity (but also because I knew I would be sharing) I also ordered Tofu Tibs. The Doro Tibs was out of this world, and while the Tofu Tibs was flavorful, it just reminded me of sauteed tofu - don't know why I thought it would be fried or something. \n\nI will definitely come back and order more food. Maybe eat in though - the bag they gave me for take-out got a little greasy.", "rating": 4, "date": "2013-10-04"}, {"excerpts": ["We got the veggie sampler and the tofu tibs, and while we can usually agree on one menu item in situations like these that doesn't match up to the rest-- but not here.  ", "It was all standout-delicious in its own way and totally conducive to mixing.  "], "author": "Allison M.", "review": "I just want MOYA!\n\nWe came here on the way out of the city, having not eaten since our gluttonous but unregrettable breakfast of homemade cinnamon roll pancakes (that's right, be jealous)... I was starving and couldn't wait until we got home to eat.  So we ended up here, having talked about getting Ethiopian food for the past few weeks.\n\nIt's owned by a friendly family.  The prices are more than reasonable, the ambience is that industrial San Francisco feel that totally works in SoMA... But more than anything, we need to talk about the food.\n\nThe food, habibi.  It's the business.  We got the veggie sampler and the tofu tibs, and while we can usually agree on one menu item in situations like these that doesn't match up to the rest-- but not here.  It was all standout-delicious in its own way and totally conducive to mixing.  The injera was fresh and perfect, with that characteristic sour bite.  And apparently I've learned to eat Ethiopian food in a way that it doesn't expand so uncomfortably in my stomach.  Such a pro!", "rating": 5, "date": "2013-03-04"}, {"excerpts": ["We ordered a variety of items consisting of the tofu tibs, ye doro tibs (chicken), vegetarian combo, and one of the beef items (sorry, the name escapes me).\n\n"], "author": "Tim B.", "review": "Went here for lunch with 3 others. They hadn't had Ethiopian food before. I had eaten it a few times and wasn't taken seriously when I said you eat it with your hands.\n\nWell, um: ya do. You tear off a piece of injera (a bread with a very sponge-like consistency), wrap it around some food, and chow away.\n\nWe ordered a variety of items consisting of the tofu tibs, ye doro tibs (chicken), vegetarian combo, and one of the beef items (sorry, the name escapes me).\n\nEven though the place was almost empty when we were there, it took about 15 minutes to get the food prepared. When it arrived, it was served on a single, giant platter. It took up almost the entire table. In addition to what we had ordered, they threw on a couple of samples other menu items. The place was clearly very new, so the staff probably hasn't had time to work out the kinks of running the place yet.\n\nPortion size: excellent. The four of us left feeling stuffed. And this is a fairly active group of people, accustomed to burning a lot of calories.\n\nService: It took it awhile, but the waitress was very friendly and quite knowledgeable about the details of menu items and of Ethiopian cuisine in general. So, \"very good.\"\n\nValue: Considering the quantity of food, it's very good.\n\nDrawbacks: \n\n1) the prices were a bit high for lunch (average entree was about $13). Since they seem to want to attract a noontime crowd, they need to have prices that are appealing. Note: their website indicates that they have \"lunch specials\" now, so perhaps that's since been remedied.\n\n2) Because you eat this food with your hands, they need to provide tableside hand-cleaning both BEFORE and AFTER you eat. Perhaps some warm, wet towels or something. And yes, I know: there is a restroom in the back, but if the place gets busy, there's going to be a crowd waiting for it. Also, public restrooms can get really icky.\n\n3.4 stars.", "rating": 3, "date": "2011-03-12"}, {"excerpts": ["of course i had the vegetarian combo, and also the tofu tibs (you can get a side order portion of any of the vegetarian dishes) ", "and they were both excellent.  ", "the veggie combo had all the usual suspects but they were fresh and perfectly spiced.  ", "tofu tibs is a novelty and one that i can't imagine not ordering on every visit.\n\n"], "author": "kate s.", "review": "i love ethiopian.  it is my favorite type of cuisine.  and moya serves some of the best ethiopian food i've tried in this country.\n\nof course i had the vegetarian combo, and also the tofu tibs (you can get a side order portion of any of the vegetarian dishes) and they were both excellent.  the veggie combo had all the usual suspects but they were fresh and perfectly spiced.  tofu tibs is a novelty and one that i can't imagine not ordering on every visit.\n\nbut the absolute star of the restaurant is the shuro:  finely ground chickpeas spiced with 12 different spices and cooked in a covered clay pot.  i know this because our server was the chef's daughter and explained it to us.  and when we were halfway through frantically shoveling it down our throats, her mother, the owner/chef, came out and personally made sure we were in love with it.  we told her we were.\n\nthe place is small but cute and clean and the service was delightful!  i've never said delightful before but i can't think of anything else that describes the experience better.  it's pretty cool that you can get all-teff injera too!", "rating": 5, "date": "2010-08-26"}, {"excerpts": ["Yesterday I had the vegetable combo which allows you to try three dishes at once and my friend got the tofu tibs which I got to taste, so today I got the inguday tibs.  ", "I definitely like the taste of the two tibs dishes best.  "], "author": "Q E.", "review": "I went there yesterday for lunch for the first time.  Today I went back for lunch again.  I never do that(!!!)...\n\n...but I desperately wanted to try more of the vegetarian options.  Yesterday I had the vegetable combo which allows you to try three dishes at once and my friend got the tofu tibs which I got to taste, so today I got the inguday tibs.  I definitely like the taste of the two tibs dishes best.  Today I decided not to order the lunch portion, but rather the full portion, and I ate it all!\n\nYesterday I got the teff-only injera and wasn't a big fan, ended up using most of my normal injera that was under my food.  Today she offered my friend a taste of the teff-only which I thought was nice.  But then she offered me a piece too saying that it turned out better than the one I had had yesterday.  I think she's right, it was fluffier, but I didn't really like knowing that I had paid for less than excellent quality yesterday.  I'd say I prefer the normal injera better because it's thinner and less tangy so you get to fully enjoy the flavors of the actual dishes you ordered.  You also end up filling up less on \"carbs.\"  \n\nBut I like this place, the staff are very friendly, and I like that there are no lines during peak lunch hour.  Definitely give it a try!  I'm going back again soon to try the shuro - would've today but for the 30min notice required.  =)", "rating": 4, "date": "2010-08-27"}], "atkilt wot": [{"excerpts": ["gomen: you can't really screw up collard greens\n           atkilt wot: this is the borderline addicting veggie item\n", "Doro Tibs- ", "This is personally my favorite dish to order! ", "I normally get this and one of the veggie items, depending on whose with me and what they're in the mood for.\n", "Kitfo- "], "author": "Arezou A.", "review": "Been here 3 times and I've been very happy each time I've ate here.\n\nVeggie Sampler-\n           spicy red lentil: probably the dish doing the least for me out of the veggie options \n           gomen: you can't really screw up collard greens\n           atkilt wot: this is the borderline addicting veggie item\nDoro Tibs- This is personally my favorite dish to order! I normally get this and one of the veggie items, depending on whose with me and what they're in the mood for.\nKitfo- So the kitfo is good but man, I can't handle that much raw beef personally so I steer clear of this but my friends are a huge fan.\n\nOverall I just absolutely LOVE injera and can eat it all day. Moya isn't my go-to Ethiopian place in the city but it's definitely very convenient because it's fast casual as opposed to a formal sit down like most of the other spaces in the city.", "rating": 4, "date": "2017-11-14"}], "gomen": [{"excerpts": ["gomen: you can't really screw up collard greens\n           atkilt wot: this is the borderline addicting veggie item\n", "Doro Tibs- ", "This is personally my favorite dish to order! ", "I normally get this and one of the veggie items, depending on whose with me and what they're in the mood for.\n", "Kitfo- "], "author": "Arezou A.", "review": "Been here 3 times and I've been very happy each time I've ate here.\n\nVeggie Sampler-\n           spicy red lentil: probably the dish doing the least for me out of the veggie options \n           gomen: you can't really screw up collard greens\n           atkilt wot: this is the borderline addicting veggie item\nDoro Tibs- This is personally my favorite dish to order! I normally get this and one of the veggie items, depending on whose with me and what they're in the mood for.\nKitfo- So the kitfo is good but man, I can't handle that much raw beef personally so I steer clear of this but my friends are a huge fan.\n\nOverall I just absolutely LOVE injera and can eat it all day. Moya isn't my go-to Ethiopian place in the city but it's definitely very convenient because it's fast casual as opposed to a formal sit down like most of the other spaces in the city.", "rating": 4, "date": "2017-11-14"}, {"excerpts": ["We got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. ", "Everything was exceptionally tasty and well-cooked. ", "The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. ", "Out of all the veggie entrees, I think the gomen was the best. "], "author": "Josephine L.", "review": "My friend and I stumbled upon this place by accident while looking for a warm place to duck in for a bit around Market St. She had never had Ethiopian food and it's one of my favorite cuisines so I figured we'd both enjoy Moya.\n\nThe restaurant can be a bit confusing in terms of how you order and are seated. Despite all the people who might be sitting at tables around you, you do have to order your food up front and pay first before seating yourself. The staff will bring out the food to you, but they don't exactly wait on you like in traditional restaurants. It's very cafeteria-style.\n\nWe got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. Everything was exceptionally tasty and well-cooked. The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. Out of all the veggie entrees, I think the gomen was the best. The injera was one of the least \"soggy\"-feeling ones I've ever had but had all of that delicious sourness you expect. I was initially worried that they wouldn't provide enough injera for the two of us, but it turned out to be plenty. In fact, we had more than enough to take home for leftovers. Injera heats up so well in the microwave, because it already has a naturally soggy texture so the moisture from the heat doesn't really affect it.\n\nThe space is very new and sleek 'n' chic, as I like to describe modern aesthetics. And I have to rave about the staff. Some of the nicest people I have ever encountered. They were so warm, welcoming and accommodating to us. They seemed genuinely concerned that we enjoyed the food and went out of their way to make sure everything was to our liking. Very sweet.", "rating": 4, "date": "2012-09-02"}, {"excerpts": ["GOMEN (collard greens), again, not a ton of flavor.  ", "There was also a potato/carrot dish.  ", "This one is a common dish in all ethiopian restaurants.  ", "It tasted to me like it always does.  ", "There was also a nice little salad with this plate.  "], "author": "Evelyn N.", "review": "I was looking for a great Ethiopian restaurant when I found Moya.  When I googled mapped it, I realized it's only 5 blocks from my house, PERFECT!   So this place gets 4 stars for the 100% teff injera alone!  Mmmmm, it was so good.  So nutty and flavorful compared to regular injera, totally worth the extra $2.  The food tasted very healthy, not oily at all compared with other Ethiopian restaurants I've been to.  \n\nMy husband and I ordered everything vegan!  Here is the review:\n\nVeggie Sampler:  This did not exactly match the online menu.  It came with MISIR WOT (red lentil) which was sooooooooo good, just the right spiciness level for me. And not oily at all! Hooray!  It also had KIK ALI-CHA (yellow pea).  I didn't like this one, it was completely bland, not even a touch of flavor.  My husband liked it .  But i think This one really could have used some extra kick.  GOMEN (collard greens), again, not a ton of flavor.  There was also a potato/carrot dish.  This one is a common dish in all ethiopian restaurants.  It tasted to me like it always does.  There was also a nice little salad with this plate.  Refreshing.  \n\nSuro:  This was a chickpea stew with 15 spices.  It had a great flavor (right in between the lentil and pea dishes in terms of spiciness).  It had a very creamy consistency though. \n\nINGUDAI TIBS:  Mushrooms. The kind waitress brought this dish out for free when she saw how much we were enjoying the food.  This had an excellent flavor!  A good kick to it with the jalapeño.  It was really good. \n\nI think they could do a bit better job on the decor.  They are in a brand new building, and the whole place just felt a little too sterile and new.  \n\nI wish they had an Ocra dish on the menu, but they're a small shop, so I understand that they have to draw the line somewhere.\n\nI'll be back for sure!!!  I have a feeling I'm going to be a regular for the red lentil dish and 100% teff injera.", "rating": 4, "date": "2012-07-08"}, {"excerpts": ["We had the shuro, ye doro wat, kik alitcha, gomen, ayb (cheese), and ye bere tibs. ", "I liked the vegetarian dishes a lot - as usual, Ethiopian is the only way I like collard greens. ", "The ye doro wat was also phenomenal - their bere bere sauce is my personal favorite. ", "I think I would skip the beef next time, and I didn't find the shuro to be as amazing as everyone else does - it reminded me of the sauce from chicken tikka masala - not bad, just not interesting. "], "author": "Lisa K.", "review": "We started with the azifa appetizer (lentil w/ red onions, jalapeño, garlic, lemon, olive oil, and served w/ kita (homemade Ethiopian bread) or injera). Now that I think about it, I don't think we were offered a choice between kita and injera, but I think we got kita since it was different from the injera we had later in the meal. This appetizer was wonderful, although I didn't really think there was a large enough portion to split among five people.\n\nWe had the shuro, ye doro wat, kik alitcha, gomen, ayb (cheese), and ye bere tibs. I liked the vegetarian dishes a lot - as usual, Ethiopian is the only way I like collard greens. The ye doro wat was also phenomenal - their bere bere sauce is my personal favorite. I think I would skip the beef next time, and I didn't find the shuro to be as amazing as everyone else does - it reminded me of the sauce from chicken tikka masala - not bad, just not interesting. It seemed like there was a lot of salad around too, which was just ok.\n\nService was quite good, and a fair amount of that consisted of continual injera refills (greatly appreciated). I found the atmosphere to be rather sterile (is that why people keep calling it \"clean\"?), although it was filling up by 8:00 or so on a Tuesday evening.", "rating": 4, "date": "2010-11-29"}, {"excerpts": ["The gomen, collard greens, was a stand-out as far as the vegetarian dishes.  "], "author": "Kelly M.", "review": "Everything about my experience at Moya was great.  This was the first Ethiopian I have had in the Bay area, but it is better than my other experiences, even when I was living in the DC area.  \n\nThe staff was very personable and spent time explaining how to eat Ethiopian as well as suggesting dishes to the people in my party who had not had Ethiopian before.  Our sever even explained some of the cultural significance of different dishes.  \n\nThe flavors were rich and not overpowered by heat.  The sauces had a great mixture of savory and spicy, and were not overly greasy.  The injera was fresh and of perfect consistency.  We started with the ye timatim fit fit, which was a fresh and lite salad, perfect for introducing those new to Ethiopian food to the injera.  The vegetarian combination was very good.  The gomen, collard greens, was a stand-out as far as the vegetarian dishes.  The Moya Special Kitfo was full of a great herbal flavor that I couldn't quite figure out.  The ye doro wot was also delicious, and even better when mixed with a little of the ayb (home made cottage cheese) as suggested by our server.\n\nThe interior is new and clean, with ample seating available when we arrived for an early dinner at 6:30pm.  The surrounding area is not very residential, so there was ample parking on the same block when we arrived.\n\nI am definitely excited to go back and sample more of their menu.  By interacting with the servers, cooks and owner, you can tell that they work hard to make delicious \"home-style\" Ethiopian food and very proud of the product.", "rating": 5, "date": "2010-08-30"}, {"excerpts": ["We ordered Kitfo (raw), Doro wat, Gomen, Shuro and, of course, Injera... the wonderful pancake like bread.  ", "The service is properly attentive and friendly.  ", "The place is clean, the kitchen staff are all Ethiopian, the food is spectacular... ", "what more could you ask.  ", "Go and see...."], "author": "EDWARD S.", "review": "This is, by far, the most authentic Ethiopian Restaurant in San Francisco.  I spent a bit over a year studying in Addis Abba and ate Ethiopian every day.  Eating at MOYA was like going back to the kitchen of the family in Addis Abba who served as my sponsors.  They don't have a Liquor License, so I missed the traditional Tej, but the food... was spectacular.  We ordered Kitfo (raw), Doro wat, Gomen, Shuro and, of course, Injera... the wonderful pancake like bread.  The service is properly attentive and friendly.  The place is clean, the kitchen staff are all Ethiopian, the food is spectacular... what more could you ask.  Go and see....", "rating": 5, "date": "2010-09-23"}], "injera": [{"excerpts": ["And when I started eating I made the mistake of thinking it wasn't going to be enough food--thankfully stuffed all that injera in my face "], "author": "Hungry W.", "review": "I'm pretty sure I saw the owner *smiling* while bussing tables...And when I started eating I made the mistake of thinking it wasn't going to be enough food--thankfully stuffed all that injera in my face but I had to leave some beautiful bites behind.\n\n Eat here! Such love!", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["I ordered the veggie combo with injera (to go). ", "It was hotter than Hades in the restaurant. ", "Other than that and the fact that the cabbage was a bit undercooked, everything was great. ", "Nice selection of beverages, included ginger beer."], "author": "J R.", "review": "Excellent food, nice decor, friendly, efficient service, diverse clientele. Where I live, Ethiopian food is non-existent, so I jumped at the chance to eat Moya's cooking when I found out they were right next door to our motel.\n\nI ordered the veggie combo with injera (to go). It was hotter than Hades in the restaurant. Other than that and the fact that the cabbage was a bit undercooked, everything was great. Nice selection of beverages, included ginger beer.", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["Love the injera (teff flour flat bread) ", "- I don't know what magic they do to make it, but it's amazing! ", "I you want to buy a side of injera, its about $2.00! \n\n", "Love the food and the injera is so addicting!"], "author": "Emily T.", "review": "I am so happy that I found this gem of a restaurant! Casual vibe, delicious food and friendly service! \n\nWhy I was here // I was craving Ethiopian food and we found this place! I feel like there aren't too many Ethiopian places in the city, so I was super excited to come and eat at this place! \n\nService // You order at the counter and then grab a seat, where they will bring the food to you. They were all super friendly and welcoming! \n\nFood // Love the injera (teff flour flat bread) - I don't know what magic they do to make it, but it's amazing! I you want to buy a side of injera, its about $2.00! \n\n- We got the vegetarian sampler platter, which was a great choice because it comes with good variety. \n- We also ordered the chicken tibs, which had great flavor! \n\nOverall // Will definitely be coming back! Love the food and the injera is so addicting!", "rating": 5, "date": "2018-04-21"}, {"excerpts": ["It comes with yellow lentils, a side salad, chopped tomatoes, and brown rice or injera. ", "Opted for the brown rice with a side of injera (+$2): http://bit.ly/2xqwewt. ", "I received injera instead of the brown rice ", "so I had a huge portion of injera. ", "The injera, the spongy, sour flatbread was fine. "], "author": "Cherylynn N.", "review": "I love payday - who doesn't?! It means I get to indulge on a nice, table for one lunch. There was a new yipster \"all-day\" restaurant that I wanted to check out but they only open for lunch on the weekends. \n\nUmm ok, so plan b? \n\nMy Yelp bookmarks. \n\nI've had Moya bookmarked for years (before they had relocated due to a fire) so it was time to finally knock this bad boy off my list.\n\nSadly, Yelp led me astray on this one and I'm really surprised by all the 5 star reviews for Moya. The food is mediocre at best and the service is cold. It isn't exactly cheap either ($20 lunch w/ no beverage) so it's hard to overlook both missteps. Maybe it's raters' bias because there's so few Ethiopian restaurants in SF?\n\nMoya is a cafe with counter service only and you order at the register from the chalkboard menu which has no listed prices. What's up with NOT listing prices?! But, since I paid with a credit card, Square emailed me an itemized receipt. \n\nI ordered the Doro Wot ($13.50), an Ethiopian Chicken stew that's the national dish of Ethiopia. It comes with yellow lentils, a side salad, chopped tomatoes, and brown rice or injera. Opted for the brown rice with a side of injera (+$2): http://bit.ly/2xqwewt. I received injera instead of the brown rice so I had a huge portion of injera. Not a big problem. \n\nWhile Ethiopian cuisine doesn't have a strong presence in San Francisco, I've tried a handful of Ethiopian places and the food here is weak in comparison. The chicken drumsticks were dry and the spices seemed to be toned down for the American palate. Per their menu, it's suppose to be \"SPICY!\" but it wasn't. It was a scotch over mild. Usually, I'm sweating and my snot runs from the robust Ethiopian spices. Not here.\n\nThe accompanying lentils were undercooked, hard, and flavorless, while the salad dressing was too sour.\n\nThe injera, the spongy, sour flatbread was fine. It had the proper texture and just the right amount of sourness. \n\nI can see why so many people complain about the service at Moya. Granted, it's not some fancy, Michelin starred place but there's a certain amount of courtesy paying customers should receive. \n\nThe staff is not friendly and seem like they don't want to be there. I had called earlier in the day to check if they were serving a particular item that day and the lady I spoke with seemed annoyed that I even called. \n\nThen, while I was waiting for my order, two customers were waiting in line to order and the person cooking who is also the cashier passed by them several times with no sense of urgency and ignoring their presence. Pretty rude IMO...a simple, \"I'll be right with you\" would have been the proper thing to do.\n\nIt's counter service so these things can be overlooked but NOT when customers can only denote a 20%, 25%, or 30% tip when paying with a card (didn't see an option for \"custom tip\") . I always tip but I didn't appreciate being forced to tip a minimum of 20% for a counter service especially since they weren't nice. IMO, more appropriate tip options for counter service is 10%, 15%, and 18%. \n\nCan't say I would recommend Moya to anyone, even for convenience. For legit Ethiopian food that will make your snot run, served by an earnest owner, go to Massawa in North Beach: https://www.yelp.com/biz/massawa-restaurant-san-francisco-2.", "rating": 3, "date": "2017-09-21"}, {"excerpts": ["We ordered a siga tibs (beef) and misir wot (spicy lentils) and it was served in a nice big plate with plenty of injera to share and a fresh green salad in the center. ", "Everything was flavorful and delicious. ", "The food arrived quickly and tasted so good! ", "There's water on the side but they have a few drinks you can buy too. \n", "This is real injera bread that is totally gluten-free. "], "author": "Kim L.", "review": "Want a simple, quick, home-cooked, authentic Ethiopian meal? Then Moya is your place. We decided to go here after having some beers two blocks away at Cellarmaker and this fit the bill. \n\nI won't lie, I was skeptical when I walked in because I've been to a few Ethiopian restaurants and they usually try to make it a more classy, restaurant feel but this one felt like counter service cooked by a family. Sure, the lady behind the counter isn't the most welcoming but she cooks a mean meal. We ordered a siga tibs (beef) and misir wot (spicy lentils) and it was served in a nice big plate with plenty of injera to share and a fresh green salad in the center. Everything was flavorful and delicious. The food arrived quickly and tasted so good! There's water on the side but they have a few drinks you can buy too. \nOverall, this meal was just under $30 and made us both full and happy. \n\nGluten intolerant folks rejoice! This is real injera bread that is totally gluten-free. Not to mention, delicious and served generously. \n\nNext time I swing by SoMa and eat at Cellarmaker, I'll definitely come back for more.", "rating": 4, "date": "2018-02-07"}, {"excerpts": ["They came with a good heap of decent injera. "], "author": "Vincent L.", "review": "The menu here is a bit more compact than many other Ethiopian places in the Bay Area, but maybe there's something to be said about keeping things simple. \n\nThe doro tibs (chicken breast marinated in white wine sauce and stir fried with onion, tomato, garlic, and berbere) were super tasty and well-portioned given the $11.50 price. They came with a good heap of decent injera. If it all wasn't savory enough, a side of ayb (Ethiopian cheese made from buttermilk) made it all quite a filling meal shareable between two. \n\nThe venue is compact but reasonably clean and bright, and grabbing a to-go order here was a breeze. The folks behind the counter were super sweet. Worth a shot if you're already in the area.", "rating": 4, "date": "2017-12-02"}, {"excerpts": ["I just absolutely LOVE injera and can eat it all day. ", "Moya isn't my go-to Ethiopian place in the city ", "but it's definitely very convenient because it's fast casual as opposed to a formal sit down like most of the other spaces in the city."], "author": "Arezou A.", "review": "Been here 3 times and I've been very happy each time I've ate here.\n\nVeggie Sampler-\n           spicy red lentil: probably the dish doing the least for me out of the veggie options \n           gomen: you can't really screw up collard greens\n           atkilt wot: this is the borderline addicting veggie item\nDoro Tibs- This is personally my favorite dish to order! I normally get this and one of the veggie items, depending on whose with me and what they're in the mood for.\nKitfo- So the kitfo is good but man, I can't handle that much raw beef personally so I steer clear of this but my friends are a huge fan.\n\nOverall I just absolutely LOVE injera and can eat it all day. Moya isn't my go-to Ethiopian place in the city but it's definitely very convenient because it's fast casual as opposed to a formal sit down like most of the other spaces in the city.", "rating": 4, "date": "2017-11-14"}, {"excerpts": ["I decided on the kitfo, which is essentially raw meat with the standard injera and house salad to complement the flavor. ", "The plate is a decent amount of food. ", "Actually, it was much more than I could finish, but it was pretty good! ", "After awhile, I couldn't stomach any more raw meat, so I gave up and called it a day. "], "author": "Stefanie C.", "review": "This place is no Tadu, but I'd been wanting to try it for awhile. It's more of a café where you can get work done, but I stopped by for a quick me-time dinner before socializing with friends on a Friday night. The process for ordering is straightforward. There's a simple menu posted above the counter, and you order at the cashier before getting your number and finding a seat.\n\nI decided on the kitfo, which is essentially raw meat with the standard injera and house salad to complement the flavor. The plate is a decent amount of food. Actually, it was much more than I could finish, but it was pretty good! After awhile, I couldn't stomach any more raw meat, so I gave up and called it a day. Initially I wanted tibs, but they only had chicken.\n\nIt's a dimly lit café and has a very low-key vibe. I saw people come here on a chill date and to catch up with friends. Very versatile location. It doesn't compel me enough to come here again, but there's decent food and doubles as a café, which is awesome!", "rating": 4, "date": "2017-02-22"}, {"excerpts": ["All the better to eat up with the Injera bread. "], "author": "Ted R.", "review": "I was brought to this place by my friend who's an Ethiopian food expert. He was a journalist who served as a war correspondent there and married an Ethiopian woman. So yeah, he's an expert.\n\nThis is an order-at-the-counter restaurant that serves relative few dishes and they make them very well. I have the steak tips and the flavors were on point. Succulent steak and a salad with bright green dressing and tomato. I added collard greens and they were delicious. All the better to eat up with the Injera bread. He had the Kitfo, an Ethiopian steak tartare. Too bad they don't serve alcohol here. But a ginger beer washes things down just fine. \n\nI didn't really count but they're probably eight or nine tables, 4- and 2-tops. While the restaurant is clean, the atmosphere is good, not great. A basic look dressed up with some Ethiopian art. Never got crowded but it stayed busy until almost closing time when I was there on a Wednesday night. The woman at the counter was extremely friendly. Nothing to complain about and the price was right at just $14. \n\nDon't get faked out by the out-of-order sign on the bathroom door. I'm pretty sure that's to discourage the vagrants. Just ask for the bathroom key and everything is clean and in working order.", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["Friendly service and a delicious, soft, perfectly sour injera. ", "However, the food can be inconsistent. ", "One time the veggie platter was great, and the next time it was wayyyy over salted (everything was salty)."], "author": "J. A.", "review": "I looooove Ethiopian food and was glad to find this place. Friendly service and a delicious, soft, perfectly sour injera. However, the food can be inconsistent. One time the veggie platter was great, and the next time it was wayyyy over salted (everything was salty).", "rating": 3, "date": "2018-09-05"}, {"excerpts": ["I got for tibs and injera bread. ", "The portion was large and the bread soaked up the sauce well. ", "It was a delicious meal and bread is so soft and spongey. ", "Would come back to try their other dishes."], "author": "Jacqueline C.", "review": "My first time having Ethiopian food. I got for tibs and injera bread. The portion was large and the bread soaked up the sauce well. It was a delicious meal and bread is so soft and spongey. Would come back to try their other dishes.", "rating": 4, "date": "2018-04-08"}, {"excerpts": ["Doro wot = chicken drumsticks in a spicy chili stew, comes with a green salad and choice of brown rice or injera. ", "Delicious and plenty for one person. "], "author": "Fannie S.", "review": "Food = delicious, fresh and worth the wait.\n\nDoro wot = chicken drumsticks in a spicy chili stew, comes with a green salad and choice of brown rice or injera. Delicious and plenty for one person. $13.50\n\nService = friendly. A bit slow, but totally worth the wait!\n\nSeating = 4-tops and 2-tops. Rearranging needed for larger groups.\n\nPrices = moderate. Worth it.", "rating": 4, "date": "2017-02-26"}, {"excerpts": ["We had to pay $2 more for some more injera bread even though what we got with our orders wasn't much. "], "author": "Anne O.", "review": "I went there for lunch with some friends. The food was delicious but . . . I paid $1 extra for mushrooms to go with my siga tibs and the cook barely gave me any mushrooms. I think there were three small slices of mushroom (less than one whole mushroom) on the whole plate. On the whole, the restaurant seems to be stingy with sides despite being, in my opinion, a little overpriced. We had to pay $2 more for some more injera bread even though what we got with our orders wasn't much. The size of the main dish/entree was average, what you'd expect (basically, enough for one meal). \n\nThe service is okay. I find it a little annoying that they suggest a 20% and above tip, though you can change this to what you think is reasonable.  \n\nOn the whole, I'd give Moya 3.5 stars, but am erring on the side of generous since the food (minus the bland, yellow lentils) was tasty.", "rating": 4, "date": "2018-05-23"}, {"excerpts": ["Injera was perfect and my vegetarian plate was so satisfying and yummy. ", "I definitely try to get here when I'm in town, and when friends from SF visit me in hawaii, they have to bring Moya food in ziplocks to me. ", "And actually, they know my mom now and tell her just to bring Tupperwares and they put everything in containers so she can bring it to me when she visits. ", "They also gave us a tip- that you can freeze Ethiopian food (not the injeera duh) overnight then put it in your checked luggage. ", "By the time it gets to hawaii it's barely defrosted. ", "So if you're reading this and coming to Maui, hmu:)"], "author": "Aliantha L.", "review": "My fav Ethiopian in the city. Much more flavorful and friendly than Axum. The location is kinda nice cos it's at 9th/Howard in soma, so it's close to civic center muni and downtown. Parking sucks in soma, take a bus or lyft. Injera was perfect and my vegetarian plate was so satisfying and yummy. I definitely try to get here when I'm in town, and when friends from SF visit me in hawaii, they have to bring Moya food in ziplocks to me. And actually, they know my mom now and tell her just to bring Tupperwares and they put everything in containers so she can bring it to me when she visits. They also gave us a tip- that you can freeze Ethiopian food (not the injeera duh) overnight then put it in your checked luggage. By the time it gets to hawaii it's barely defrosted. So if you're reading this and coming to Maui, hmu:)", "rating": 5, "date": "2018-03-09"}, {"excerpts": ["eats: Misir Wot) spicy red lentils stew, 10.95)\n-choose injera bread, great for dipping\n-small, tasty. ", "fresh spring mix salad\n-misor ", "wot had some heat, filled me up quickly\nhungry an hour later, too busy to grab something else to eat.\n"], "author": "Victor G.", "review": "Moya is a coffee stop that offers Ethiopian vegeterian and meat dishfes, no sammies.\n\neats: Misir Wot) spicy red lentils stew, 10.95)\n-choose injera bread, great for dipping\n-small, tasty. fresh spring mix salad\n-misor wot had some heat, filled me up quickly\nhungry an hour later, too busy to grab something else to eat.\n3 stars quantity, 4 stars quality.\n\ntake outs:\n-found park, but ate on the run. (spot lights)\n-food $4 higher than food truck for equivalent eats.\n.s.f. rates not cheap either.\n-quick service, smiple menu. next time trying another veggie stew. no meats yet.\n-parking found in alley....no meters.", "rating": 4, "date": "2016-09-22"}, {"excerpts": ["The food was great, plenty of injera and great portions. ", "The service was friendly and the food was served up super quickly. ", "To move this review to a 5 star here is what the restaurant would need to improve upon: play some cool Ethiopian music (no music was on while we were there), make sure the bathroom is not out of order, and perhaps add the carrot-green bean dish (unfortunately I don't know the name - and ", "I'm just bias because this is my favorite Ethiopian dish - ", "but all the other Ethiopian restaurants have it ", "and I LOVE it so much! ", "Ok end of my little rant.."], "author": "Madeline F.", "review": "We were super excited to find an Ethiopian restaurant only a couple blocks away from our apartment so we had to give it a try. You order at the counter and then take a seat. The walls are covered with beautiful murals and some look to tell the life story of the owner which I thought was really cool! The food was great, plenty of injera and great portions. The service was friendly and the food was served up super quickly. To move this review to a 5 star here is what the restaurant would need to improve upon: play some cool Ethiopian music (no music was on while we were there), make sure the bathroom is not out of order, and perhaps add the carrot-green bean dish (unfortunately I don't know the name - and I'm just bias because this is my favorite Ethiopian dish - but all the other Ethiopian restaurants have it and I LOVE it so much! Ok end of my little rant..) \n\nKeep up the good work, Moya!", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["Not to mention the injera was perfect...sour and spongy. ", "This is the best flavored Ethiopian food I've ever had (I've eaten Ethiopian in Chicago, Southern California and new to SF). ", "Moya has a new customer for life. ", "Love it!"], "author": "Lindsey P.", "review": "So SOOO GOOD!!! I got the veggie platter and the steak tibs. The steak is great but the veggies shine! I had an audible reaction to every bite. Not to mention the injera was perfect...sour and spongy. This is the best flavored Ethiopian food I've ever had (I've eaten Ethiopian in Chicago, Southern California and new to SF). Moya has a new customer for life. Love it!", "rating": 5, "date": "2017-08-17"}, {"excerpts": ["I got the veggie platter and injera.  ", "Next time I would just get the spicy red lentils and yellow pea stew, and not the whole platter.  ", "Everything else was just okay.  ", "I am not a fan of collard greens though, so I won't ever be impressed by those."], "author": "Amanda B.", "review": "It was good - although I wouldn't get it delivered by door dash again.  It was really cold by the time I got it.  I got the veggie platter and injera.  Next time I would just get the spicy red lentils and yellow pea stew, and not the whole platter.  Everything else was just okay.  I am not a fan of collard greens though, so I won't ever be impressed by those.", "rating": 3, "date": "2018-01-23"}, {"excerpts": ["The injera was the best I ever had. ", "Very tangy and also very light. ", "I was surprised at the small portion size and expected more on my plate (we ordered 2 vegan entrees for sharing - mushroom and chickpeas). ", "The chickpea entree was really good but the mushroom was bland. "], "author": "Meghna G.", "review": "Had dinner with a friend over here. The cafe was decent although really warm inside. The lady(owner?) said we could open a window, so wasn't a big deal. \nYou have to order at the counter. The food took about 20 minutes to arrive. The injera was the best I ever had. Very tangy and also very light. I was surprised at the small portion size and expected more on my plate (we ordered 2 vegan entrees for sharing - mushroom and chickpeas). The chickpea entree was really good but the mushroom was bland. 3.5 stars overall. \n\nNot a big fan of the location though, as I was walking up here the lady in front of me was robbed of her water bottle. I ended up running the last hundred feet to the restaurant. Obviously not the restaurants fault and did not affect my rating score, just wanted to point it out for safety reasons.", "rating": 3, "date": "2016-06-11"}, {"excerpts": ["I normally order the doro tibs(chicken) with the injera! ", "Do not forget the injera! ", "I repeat eating your portion with injera makes it 100x better!"], "author": "Jessica M.", "review": "At first, the only reason why I wanted to check this spot out was because the name of this restaurant happens to be my last name! Now, I've had Ethiopian food but nothing like this one. It's a pretty small location but the food is great. Servings are pretty big and the lady always has a huge smile on her face. They serve both meat and vegan! I normally order the doro tibs(chicken) with the injera! Do not forget the injera! I repeat eating your portion with injera makes it 100x better!", "rating": 5, "date": "2017-08-27"}, {"excerpts": ["I found the injera to not be sour or fluffy enough. ", "The lady behind the counter kept refilling our injera for us and was very nice. \n\n"], "author": "Shereen A.", "review": "Moya is a great spot for a large group. There's nothing better than good food with good company in a setting where everyone can share, not feel cramped, and eat to your heart's content. This is exactly what we did.\n\nThe space looks quite new. It's very clean with large open windows. The cleanest place on the block, you can't miss it!\n\nThe food itself is ok, a good go to if it's on your way. I found the injera to not be sour or fluffy enough. The veggies all had similar flavors, salad lacked the tangy kick that compliments the spice, and the beef was ok.\n\nService was great. The lady behind the counter kept refilling our injera for us and was very nice. \n\nThere's a ton of vegan and vegetarian options!", "rating": 3, "date": "2016-04-02"}, {"excerpts": ["The injera was perfect, light and spongy. ", "My coworker loved the Siga Tibs (beef). ", "I would definitely recommend and order again!"], "author": "Nicole P.", "review": "This place is delicious! I ordered for lunch on a whim and it did not disappoint. The Doro Tibs (chicken) was flavorful, with a small kick to the tastebuds. The injera was perfect, light and spongy. My coworker loved the Siga Tibs (beef). I would definitely recommend and order again!", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["Their vegan plate is delicious - the flavors are fresh and the injera is nice and spongey (not thin). ", "I would highly recommend it if you've never tried ethiopian before or you're looking for a new spot. ", "Get the veggie combo!"], "author": "Lexi C.", "review": "Moya is hands down my favorite ethiopian restaurant - I only wish I worked closer to it! Their vegan plate is delicious - the flavors are fresh and the injera is nice and spongey (not thin). I would highly recommend it if you've never tried ethiopian before or you're looking for a new spot. Get the veggie combo!", "rating": 5, "date": "2017-09-16"}, {"excerpts": ["I got mine via Caviar and ordered the  doro wot with traditional injera. ", "Doro wot was spicy and when I was reading the description, apparently it take hours for this dish to be prepared. ", "I opened up the injera and ate it with the doro wot "], "author": "Aj C.", "review": "I was really excited to try Ethiopian food for the first time! I got mine via Caviar and ordered the  doro wot with traditional injera. Doro wot was spicy and when I was reading the description, apparently it take hours for this dish to be prepared. I opened up the injera and ate it with the doro wot and it tasted amazing!\n\nEvery bite was flavorful and it wasn't as spicy as I thought it would be but it had that zing.\n\nI definitely would love to sit down here and eat some time in the future!", "rating": 4, "date": "2016-08-05"}, {"excerpts": ["The injera was also a disappointment. ", "It was not really sour ", "so I guess the taste could be compared to faintly sour wheat bread. ", "This place seriously holds back on the spices to cater to Americanized stomachs. ", "Other cons:\n- They charge for injera\n- Staff is slow at clearing tables for incoming customers to sit\n- ", "What's up with the bathroom..."], "author": "Liana F.", "review": "One word: Bland\nBland bland bland bland bland\nI'm used to Ethiopian food that bursts with flavors that leave my palate happy, my stomach probably with a hole, and my toilet -- actually let's not go there.\n\nI figured we could not go wrong with the veggie sampler but that was utterly disappointing. It felt like we were eating flavorless pasty mush. The medium spicy chicken with mushrooms (not sure what the actual name is) was not \"medium spicy.\" It was more like mild and that item was nothing to rave about. The injera was also a disappointment. It was not really sour so I guess the taste could be compared to faintly sour wheat bread. This place seriously holds back on the spices to cater to Americanized stomachs. WHYYYYYY!\n\nOther cons:\n- They charge for injera\n- Staff is slow at clearing tables for incoming customers to sit\n- What's up with the bathroom...", "rating": 1, "date": "2014-06-29"}, {"excerpts": ["The traidtional Ethiopian  injera is awesome. ", "I love its texture and it's pretty light.  ", "We ordered a customized veggie samplers (red lentil stew, yellow pea stew, sauteed collard greens, green salad, Shuro). ", "Everything was tasty! ", "Their veggie dishes are the heaven for vegan. ", "Shuro is my favourite."], "author": "Shell J.", "review": "This is my first time to try Ethiopian food. The place is tidy and cozy.  Food was yummy. \n\nThe traidtional Ethiopian  injera is awesome. I love its texture and it's pretty light.  We ordered a customized veggie samplers (red lentil stew, yellow pea stew, sauteed collard greens, green salad, Shuro). Everything was tasty! Their veggie dishes are the heaven for vegan. Shuro is my favourite.", "rating": 4, "date": "2014-08-13"}, {"excerpts": ["They were very generous with the injera sourdough flatbreads, which were served in cute little rolls for the table to share.\n\n"], "author": "Audrey L.", "review": "Nice gem in a sketchier part of town. Everything on the menu was delicious. I especially liked the vegetable sampler and the chicken drumsticks. They were very generous with the injera sourdough flatbreads, which were served in cute little rolls for the table to share.\n\nThe ordering process was quick and easy -- order at the counter and they bring the food to the table. The dishes were affordable at $10-13. Great for mid-size groups so you don't have to bother with splitting the bill later. Most of the tables are for 2-4, but they don't mind you combining tables together. Service was quick, and we were able to be in and out in less than an hour.\n\nThe decor was clean, modern, and fresh. The restrooms (for customers only) were actually clean!! I was pleasantly surprised. Large windows that allow lots of fresh air and light. It can get chilly at times, but feel free to close the windows.\n\nYou'd think this would be more of a lunch place, but it was decently crowded for dinner on a Saturday night around 7pm. I'd say the place was at about 75% capacity. This is great for a quick dinner since many of the other restuarants in the area probably have long waits or are fully reserved.\n\nAll-in-all, a fan of this restaurant for a clean, delicious, no-fuss bite to eat.", "rating": 4, "date": "2015-04-12"}, {"excerpts": ["Got the gluten free injera which is a deal-breaker for me. "], "author": "Shanna L.", "review": "Tiny place with nice staff and excellent food! Got the gluten free injera which is a deal-breaker for me. More expensive than some Ethiopian restaurants but the veggie sampler was plenty of food for two of us, so it came out less than $17 total. Right around the corner from ACT which is why we tried it. I'd definitely go back!", "rating": 5, "date": "2017-10-04"}, {"excerpts": ["They have a decent veggie platter and offer gluten free injera, when it is available. \n\n", "Since they only offer gluten free injera when it is available, this means you need to call ahead if you have to have GF.", "Since they only offer gluten free injera when it is available, this means you need to call ahead if you have to have GF."], "author": "Shannon Z.", "review": "The some of best Ethiopian in San Francisco, however that doesn't mean much since San Francisco lacks Ethiopian restaurants. They have a decent veggie platter and offer gluten free injera, when it is available. \n\nThe delivery through Eat24 is inconsistent (sometimes my salad is wilted and uneatable) and it is definitely not as good as ordering from there. I wish they offered Azifa (cold Ethiopian green lentil salad).\n\nGluten free notes: No issues for me here in terms cross contamination or errors. Since they only offer gluten free injera when it is available, this means you need to call ahead if you have to have GF.", "rating": 3, "date": "2015-12-18"}, {"excerpts": ["The takeout menu with the tiny font lists the same appetizing dishes I remembered from their first place with plenty of their gluten-free injera to go around (see photo). ", "Injera is the spongy flatbread that may look like remnants of a yoga mat but is actually handmade from teff with an unusually vinegary flavor. ", "I like it. ", "But I got over it since it was tasty nicely complemented by a side house salad and the injera (see photo). ", "One interesting twist is that you have to say you want it \"family-style", "\" if you want the food served more traditionally on the injera fully rolled out on a platter. ", "Otherwise, you get it Western style on a regular plate. "], "author": "Ed U.", "review": "Moya is back after its incendiary experience on Folsom over a year ago when it suffered the unlucky fate of an out-of-control, four-alarm fire. Jamie W. and I were lucky enough to try the place in its early days, and we really enjoyed the fresh ingredients and cordial service of this Ethiopian eatery (see review below), so we were sad that chef and owner Fana Alemayehu and her three daughters had to close their business and move. Luckily, one year later, they have been able to start over again in a location not that far away - 9th Street near Mission - where they are more likely to get more foot traffic and hopefully Twitter lunch-hour overflow.\n\nI came by alone after work last week. The new space feels a bit smaller and more generic, but they've warmed it up with their native artwork. The takeout menu with the tiny font lists the same appetizing dishes I remembered from their first place with plenty of their gluten-free injera to go around (see photo). Injera is the spongy flatbread that may look like remnants of a yoga mat but is actually handmade from teff with an unusually vinegary flavor. I like it. Since I'm eating less red meat these days, I honed in on the $11.95 Doro Wot, which is a dish consisting of a couple of chicken drumsticks and a hard-boiled egg all slathered in an Ethiopian chili stew.\n\nI usually stay away from chicken-and-egg combos simply because of the implied mother-and-child allusion. Seriously. I just think it's weird to combine poultry at different stages of its life on one plate. But I got over it since it was tasty nicely complemented by a side house salad and the injera (see photo). One interesting twist is that you have to say you want it \"family-style\" if you want the food served more traditionally on the injera fully rolled out on a platter. Otherwise, you get it Western style on a regular plate. On the side, I also went for a $3.95 bowl of Kin-Che, a couscous-like rice with a buttery taste that probably didn't help with my personal curbing of the carbs (see photo).\n\nFana serves sandwiches and stews to go in addition to the mid-priced entrees. The lamb of the Ye Beg Wot appears to be gone from their menu, but they now have chicken breast, steak tartare and tofu options. Listen, she and her family are very nice and obviously close-knit. Friends of theirs came by while I was eating, and you can just tell. You should definitely give Moya a try in their new digs. They obviously went through a lot this past year, and I think it's great they were committed to staying in SoMa instead of moving to the 'burbs where rents are likely cheaper. If you haven't tried Fana's homestyle Ethiopian food, you need to give it a go.\n\nFOOD - 4 stars...still the same flavorful, homestyle Ethiopian fare served up before their relocation\nAMBIANCE - 3.5 stars...a bit more fast-foody than before but warmed by their artwork\nSERVICE - 4.5 stars...very nice people\nTOTAL - 4 stars...Moya is back and here to stay, I hope", "rating": 4, "date": "2012-06-23"}, {"excerpts": ["not so great neighborhood but a fantastic lunch spot - their berbere sauce is not too spicy and the injera is spot on. ", "They give you huge portions so you are really buying for two meals. ", "I would recommend doing a take out as this place gets insanely hot inside! ", "I am happy I found a nice Ethiopian place for when my craving hits"], "author": "Sree S.", "review": "not so great neighborhood but a fantastic lunch spot - their berbere sauce is not too spicy and the injera is spot on. They give you huge portions so you are really buying for two meals. I would recommend doing a take out as this place gets insanely hot inside! I am happy I found a nice Ethiopian place for when my craving hits", "rating": 5, "date": "2016-12-06"}, {"excerpts": ["Veggie Sample with Injera ($12.95): \n", "I ordered it to go and it came with a side salad. ", "The injera was wrapped in foil and the vegetables were stuffed in a microwave safe box. ", "I found myself eating the injera with the side salad instead of the actual entree (it's surprisingly super yummy). ", "The stews and potatoes were meh. ", "I've had better."], "author": "Anna H.", "review": "I came here today 15 minutes before they were closing. I quickly ordered and was in and out in under 5 minutes. \n\nVeggie Sample with Injera ($12.95): \nI ordered it to go and it came with a side salad. The injera was wrapped in foil and the vegetables were stuffed in a microwave safe box. Let's just say that presentation was not the best. \n\nThe food itself was quite bland and drowning in oil. Probably the most oily thing I have ever eaten in my life. The collared greens are what I disliked the most. They were really bitter and sour at the same time. I found myself eating the injera with the side salad instead of the actual entree (it's surprisingly super yummy). The stews and potatoes were meh. I've had better.", "rating": 2, "date": "2015-06-22"}, {"excerpts": ["Lots of the injera (bread). ", "So much I couldn't finish. ", "I stopped by right around 11:30 to beat the rush. ", "Sweet service. ", "Price was $14 plus $2 tip. ", "But that's about what you'd pay at any of the food trucks in \"Soma Street Food Park\" with way better quantity and quality."], "author": "Megan D.", "review": "I got the vegetarian sampler and I'm so full right now.Good serving size. Lots of the injera (bread). So much I couldn't finish. I stopped by right around 11:30 to beat the rush. Sweet service. Price was $14 plus $2 tip. But that's about what you'd pay at any of the food trucks in \"Soma Street Food Park\" with way better quantity and quality.", "rating": 5, "date": "2017-06-07"}, {"excerpts": ["I ordered my usual, the Doro Tibs, and a side of Injera - and out of curiosity (but also because I knew I would be sharing) ", "The Doro Tibs was out of this world, and while the Tofu Tibs was flavorful, it just reminded me of sauteed tofu - don't know why I thought it would be fried or something. \n\n"], "author": "Aivy C.", "review": "Really good find in SOMA! \n\nOne of my girlfriends picked me up from work and we were en route to a theater rehearsal when I mentioned we probably ought to pick up some food and this was her suggestion. I love, love love Ethiopian food and at that point I hadn't had it in quite some time so we stopped off here. \n\nI ordered my usual, the Doro Tibs, and a side of Injera - and out of curiosity (but also because I knew I would be sharing) I also ordered Tofu Tibs. The Doro Tibs was out of this world, and while the Tofu Tibs was flavorful, it just reminded me of sauteed tofu - don't know why I thought it would be fried or something. \n\nI will definitely come back and order more food. Maybe eat in though - the bag they gave me for take-out got a little greasy.", "rating": 4, "date": "2013-10-04"}, {"excerpts": ["You get a ton of injera with your entree so "], "author": "Wendy L.", "review": "Yum - so good!\n\nMy friend went later in the evening on a Friday night (they close at 9, though I think that's when they stop taking orders). We ordered the vegetarian sampler and the doro tibs. The vegetarian sampler is enough for two people, but the doro tibs were worth the feeling of overwhelming full-ness. In addition to the doro tibs, the yellow pea stew was another standout. You get a ton of injera with your entree so no need to order it separately.\n\nThe restaurant has a cafe feel - bright lights, order at the counter - and only  6-8 tables.\n\nMoya is really reasonably-priced - only ~$25-30 for dinner for the two of us!", "rating": 4, "date": "2014-02-08"}, {"excerpts": ["These days, their Veg Platter consists of \nInjera Bread- ", "traditional Ethiopian bread (kind of sour) or Rice or Gluten-free bread\nwith \n~Misir ", "Wot- red lentil stew\n~Kik Ali-Cha - yellow pea stew\n~Gomen - sauteed collard greens\n~curried potatoes, carrots and seasonal vegetables  "], "author": "Cassandra E.", "review": "So glad I stumbled upon this place! Trying Ethiopian has been on the list of things to do (amongst everything else on the planet...) and I finally got to tackle that notion today... \n\nFrom the outside, Moya is easy to miss. It's got no official sign outside (that I am aware of anyway...), but has a menu posted outside of it's doors. The only thing that stood out to me the most was the very shiny, silver exterior of their space and the address # 121 posted across the windows. \n\nIf you have never been, ordering is done at the counter pre-dining. You walk through the small spaced, yet immaculate dining area, up to the sleek and chic counter to order and pay in advance. They then will bring your order out to your table after. \n\nI got the Lunch Vegetarian Platter which took only a few minutes to make. I would definitely do this if you've never had this style of food before... and aren't sure what to get. \n\nThese days, their Veg Platter consists of \nInjera Bread- traditional Ethiopian bread (kind of sour) or Rice or Gluten-free bread\nwith \n~Misir Wot- red lentil stew\n~Kik Ali-Cha - yellow pea stew\n~Gomen - sauteed collard greens\n~curried potatoes, carrots and seasonal vegetables  (forget the Ethiopian name for this one)\nand a bite sized house salad\n\nIt was a plate full of food, but all very small proportions, making it just the right amount for one person with a good appetite. \n\nI think I'm in love with Ethiopian food after my experience here. It's similar to South Indian food, the way it is served and the level of spiciness. It's an ideal spot for vegetarians (surprised it took me so long to get here!)", "rating": 5, "date": "2013-01-31"}, {"excerpts": ["sigga tibs (sauteed beef) on injera served traditional style. "], "author": "An Y.", "review": "I hadn't liked Ethiopian food the first time I tried it, but liked it here.\n\nOrdered the veggie sampler +  sigga tibs (sauteed beef) on injera served traditional style. Enough for two people, with leftovers.\n\nClean, modern looking decor. Not a whole lot of seating. Good place for small groups, 1:1 conversations/catch-ups.\n\nFriendly service!", "rating": 4, "date": "2014-02-09"}, {"excerpts": ["Super fresh, delicious vegetarian combo & great injera-also they offer gluten free injera & brown rice options."], "author": "Rude A.", "review": "I really like this place for lunch. Super fresh, delicious vegetarian combo & great injera-also they offer gluten free injera & brown rice options.", "rating": 5, "date": "2016-01-14"}, {"excerpts": ["They did have gluten-free injera, great for the hubby, and the vegetarian combo platter is what we ordered. \n\n"], "author": "Kate B.", "review": "Cute little place- we stopped in before catching Newsies at the Orpheum Theatre. I love ethiopian food- eat it all time. I hadn't been here before- and I was a little disappointed to see that they don't have a liquor license... no honey wine! They did have gluten-free injera, great for the hubby, and the vegetarian combo platter is what we ordered. \n\nIt was good, but not as flavorful as I would have wanted.", "rating": 3, "date": "2015-03-13"}, {"excerpts": ["The injera was fresh and perfect, with that characteristic sour bite.  ", "And apparently I've learned to eat Ethiopian food in a way that it doesn't expand so uncomfortably in my stomach.  ", "Such a pro!"], "author": "Allison M.", "review": "I just want MOYA!\n\nWe came here on the way out of the city, having not eaten since our gluttonous but unregrettable breakfast of homemade cinnamon roll pancakes (that's right, be jealous)... I was starving and couldn't wait until we got home to eat.  So we ended up here, having talked about getting Ethiopian food for the past few weeks.\n\nIt's owned by a friendly family.  The prices are more than reasonable, the ambience is that industrial San Francisco feel that totally works in SoMA... But more than anything, we need to talk about the food.\n\nThe food, habibi.  It's the business.  We got the veggie sampler and the tofu tibs, and while we can usually agree on one menu item in situations like these that doesn't match up to the rest-- but not here.  It was all standout-delicious in its own way and totally conducive to mixing.  The injera was fresh and perfect, with that characteristic sour bite.  And apparently I've learned to eat Ethiopian food in a way that it doesn't expand so uncomfortably in my stomach.  Such a pro!", "rating": 5, "date": "2013-03-04"}, {"excerpts": ["The cabbage/carrot/potato curry was phenomenal and the injera was sour to perfection. ", "Saving grace was the injera. \n\n"], "author": "Ranjani S.", "review": "I don't know if it's my exceptionally high standards when it comes to Ethiopian food, or whether it's my multiple awesome experiences at Zeni in SJ that killed every other Ethiopian's restaurants experience, that makes me feel Moya leaves a lot to be desired.\n\nYeah, it isn't all that fancy, ergo, none of the Ethiopian decor flaff or a pianist belting out loud music while you dine (think Sheba). Moya is just your quintessential cafe that serves Ethiopian food on the side (or that's how I felt about the establishment)\n\nWe ordered a vegetarian platter family style, to be split between the hubs and I. Along with a bottle of Bundaberg (who can say no to Bundaberg when it's right there!?). And let me tell you, the only thing I thoroughly enjoyed during my meal, was the Bundaberg (and that came at a price too, $6 for a bottle. As you can see, I am still trying to come to terms with paying 2x for everything in the city) \n\nThe food was cold. The yellow peas, the red lentil stew were cold (and lacking flavor), the collard greens tasted a bit bitter than what I am used to. The cabbage/carrot/potato curry was phenomenal and the injera was sour to perfection. Saving grace was the injera. \n\nPrice wise, it was reasonable by SF standards. I just don't think I'll come back since it truly wasn't a memorable meal.", "rating": 2, "date": "2014-11-10"}, {"excerpts": ["I got the ingudai ribs, medium hot, to go with some injera. ", "What wasn't so great was the crazy homeless person outside who asked me for food then blocked the doorway the entire time - not letting me leave. ", "The owner had to call the police to come clear the way. ", "The injera is a nicely rolled up round. ", "Perfect for scooping up the ingudai ribs. ", "I don't know how they do this ", "but they give you the perfect amount of injera for eating up the food."], "author": "Jean K.", "review": "So I'm starting on a new quest to be more adventurous in my lunch outings and use my bike to get to places around town I wouldn't normally go to. Moya was on the list and I was able to hit it up on my way into work. At opening time the place was super quiet - I was the only one there. The two ladies were super nice and though I felt bad about making them cook for me when no one else was there they seemed unperturbed. I got the ingudai ribs, medium hot, to go with some injera. What wasn't so great was the crazy homeless person outside who asked me for food then blocked the doorway the entire time - not letting me leave. The owner had to call the police to come clear the way. Luckily the guy left on his own and I hustled out. \n\nBy the time I got to work the sauce had spilled out of the the container and made a mess even though it was double-bagged. NOTE: bring your own leak proof container or don't walk very far. Despite all this the ingudai ribs were pretty awesome. There's no other way to describe them. Sautéed mushrooms, nicely spicy, pretty spicy in fact. Nom nom nom. The injera is a nicely rolled up round. Perfect for scooping up the ingudai ribs. I don't know how they do this but they give you the perfect amount of injera for eating up the food.", "rating": 4, "date": "2013-09-17"}, {"excerpts": ["The injera was one of the least \"soggy\"-feeling ones I've ever had but had all of that delicious sourness you expect. ", "I was initially worried that they wouldn't provide enough injera for the two of us, but it turned out to be plenty. ", "In fact, we had more than enough to take home for leftovers. ", "Injera heats up so well in the microwave, because it already has a naturally soggy texture so the moisture from the heat doesn't really affect it.\n\n"], "author": "Josephine L.", "review": "My friend and I stumbled upon this place by accident while looking for a warm place to duck in for a bit around Market St. She had never had Ethiopian food and it's one of my favorite cuisines so I figured we'd both enjoy Moya.\n\nThe restaurant can be a bit confusing in terms of how you order and are seated. Despite all the people who might be sitting at tables around you, you do have to order your food up front and pay first before seating yourself. The staff will bring out the food to you, but they don't exactly wait on you like in traditional restaurants. It's very cafeteria-style.\n\nWe got the Veggie Sampler (misir wot, kik alicha, gomen, atkiliti wot) and the kitfo. Everything was exceptionally tasty and well-cooked. The kitfo has a definite kick to it that builds as time goes on, so don't order this if you are sensitive to spiciness. Out of all the veggie entrees, I think the gomen was the best. The injera was one of the least \"soggy\"-feeling ones I've ever had but had all of that delicious sourness you expect. I was initially worried that they wouldn't provide enough injera for the two of us, but it turned out to be plenty. In fact, we had more than enough to take home for leftovers. Injera heats up so well in the microwave, because it already has a naturally soggy texture so the moisture from the heat doesn't really affect it.\n\nThe space is very new and sleek 'n' chic, as I like to describe modern aesthetics. And I have to rave about the staff. Some of the nicest people I have ever encountered. They were so warm, welcoming and accommodating to us. They seemed genuinely concerned that we enjoyed the food and went out of their way to make sure everything was to our liking. Very sweet.", "rating": 4, "date": "2012-09-02"}, {"excerpts": ["The waitress, daughter of the owner, came over and brought us some samples of Injera without gluten and that it's more authentic.  "], "author": "Randy G.", "review": "I'm in downtown SF looking for a good place to eat and Yelp comes up and tells me there's an Ethiopian restaurant not far from the hotel I'm stay at. I'm ready to go.\n\nLets start with the walk there.  Not knowing the city, I walked down 6th street, bad idea. That was the only street that was \"questionable\" all throughout the city. Saw some interesting \"business\" deals and some colorful characters, but once I got to Folsom, it was fine.  So, I would avoid Market and 6th to 6th and Folsom.\n\nHowever, the food makes up for everything. The food was fantastic, very authentic as well.  No surprise, the chef is the owner and it shows with how much love and dedication is placed into getting it right. The waitress, daughter of the owner, came over and brought us some samples of Injera without gluten and that it's more authentic.  You should definitely try it if you haven't had it before.\n\nWe had the vegetarian combination and everyone was delicious, full of flavor and FRESH.\n\nI highly recommend Moya, but recommend taking a different route there.  Enjoy!", "rating": 4, "date": "2010-12-19"}, {"excerpts": ["So this place gets 4 stars for the 100% teff injera alone!  ", "Mmmmm, it was so good.  ", "So nutty and flavorful compared to regular injera, totally worth the extra $2.  ", "I have a feeling I'm going to be a regular for the red lentil dish and 100% teff injera."], "author": "Evelyn N.", "review": "I was looking for a great Ethiopian restaurant when I found Moya.  When I googled mapped it, I realized it's only 5 blocks from my house, PERFECT!   So this place gets 4 stars for the 100% teff injera alone!  Mmmmm, it was so good.  So nutty and flavorful compared to regular injera, totally worth the extra $2.  The food tasted very healthy, not oily at all compared with other Ethiopian restaurants I've been to.  \n\nMy husband and I ordered everything vegan!  Here is the review:\n\nVeggie Sampler:  This did not exactly match the online menu.  It came with MISIR WOT (red lentil) which was sooooooooo good, just the right spiciness level for me. And not oily at all! Hooray!  It also had KIK ALI-CHA (yellow pea).  I didn't like this one, it was completely bland, not even a touch of flavor.  My husband liked it .  But i think This one really could have used some extra kick.  GOMEN (collard greens), again, not a ton of flavor.  There was also a potato/carrot dish.  This one is a common dish in all ethiopian restaurants.  It tasted to me like it always does.  There was also a nice little salad with this plate.  Refreshing.  \n\nSuro:  This was a chickpea stew with 15 spices.  It had a great flavor (right in between the lentil and pea dishes in terms of spiciness).  It had a very creamy consistency though. \n\nINGUDAI TIBS:  Mushrooms. The kind waitress brought this dish out for free when she saw how much we were enjoying the food.  This had an excellent flavor!  A good kick to it with the jalapeño.  It was really good. \n\nI think they could do a bit better job on the decor.  They are in a brand new building, and the whole place just felt a little too sterile and new.  \n\nI wish they had an Ocra dish on the menu, but they're a small shop, so I understand that they have to draw the line somewhere.\n\nI'll be back for sure!!!  I have a feeling I'm going to be a regular for the red lentil dish and 100% teff injera.", "rating": 4, "date": "2012-07-08"}, {"excerpts": ["Our meal was served on one large plate, over Injera, with a separate plate of Injera served to us, as well.  "], "author": "Audrey C.", "review": "So this was my first experience with Ethiopian food and it was great!  The menu was easy to navigate and the owner was uber friendly!\n\nWe decided to grab dinner at Moya on our way to the Orpheum, since it was a) nearby and b) a quick meal.  We ended up finding street parking out front, and was able to park there all night (during the show), which made everything a perfect fit.\n\nIt's a small cafe that can seat just under 50 people.  You order at the counter first, then they bring your food out to you.  Between two of us, we ordered the Veggie sampler and Doro Tibs, which was just the right amount of food.  Our meal was served on one large plate, over Injera, with a separate plate of Injera served to us, as well.  We both had hearty appetites, and still somehow managed to have a few bites left over.\n\nOverall, I had a good experience and food was good.  Will I go back? Maybe if I'm in the area... It was definitely a quick option, for a meal before going to the Orpheum.\n\nAll in all, I'd say 3.5 stars.", "rating": 3, "date": "2013-05-29"}, {"excerpts": ["I tried out Moya because of the reviews here for gluten-free injera, and ended up losing my entire dinner in the toilet later that night. \n\n", "Last month I ordered takeout for 4 via their mobile app, and the nice lady who handed me the food reassured me in person that the injera was gluten-free. ", "There must have been a mix-up in the kitchen, though, because I have never had that strong a reaction to food that had less than A LOT of gluten in it. "], "author": "Hilary C.", "review": "Celiacs, beware. I tried out Moya because of the reviews here for gluten-free injera, and ended up losing my entire dinner in the toilet later that night. \n\nLast month I ordered takeout for 4 via their mobile app, and the nice lady who handed me the food reassured me in person that the injera was gluten-free. There must have been a mix-up in the kitchen, though, because I have never had that strong a reaction to food that had less than A LOT of gluten in it. None of my non-celiac companions had digestive trouble.\n\nAdditionally, Moya omitted one of the veggie dishes I had ordered and pre-paid for, which underlines the theory of communication trouble in the kitchen.\n\nThat said, the food was delicious. We had the special version of the beef dish and the chicken with mushrooms. I might give it another shot, only I'll stick with the rice and maybe eat-in instead of take-out.", "rating": 2, "date": "2014-07-29"}, {"excerpts": ["They don't even put Injera, Sponge bread Underneath the food. ", "It didn't look right ", "it didn't taste right ", "and it wasn't served right. ", "I know how it should taste ", "and I know how it should be served. ", "And it's not right.. ", "That's all.."], "author": "Isaac Y.", "review": "It was not a good experience for me, I  been to multiple Ethiopian and Eritean  restaurants. They don't even put Injera, Sponge bread Underneath the food. It didn't look right it didn't taste right and it wasn't served right. I know how it should taste and I know how it should be served. And it's not right.. That's all..", "rating": 1, "date": "2014-05-02"}, {"excerpts": ["But we wanted injera and good flavors in San Francisco ", "so we tried Moya. ", "What a treat! "], "author": "Holly F.", "review": "So good! I am a big fan of Ethiopian food and usually eat out in Oakland. But we wanted injera and good flavors in San Francisco so we tried Moya. What a treat! The vegetarian sampler was entirely delicious and interesting, the Doro Tibs were fantastic, well-seasoned and not greasy at all. The smells from the kitchen were mouth-watering - I'm looking forward to trying more.\n\nThe atmosphere was more coffee shop than slow dining but courtesy of Yelp we knew that going in. The staff was warm and welcoming and the extra large Mexican sodas in glass bottles was the perfect touch.", "rating": 5, "date": "2014-05-07"}, {"excerpts": ["The two best things about Moya are the kitfo and the injera.  ", "The injera is all teff, so it's gluten free and a gorgeous color.  ", "It's very flavorful and sour. ", "The kitfo is only served raw and is incredible. "], "author": "Jackie B.", "review": "Before I discovered Moya I was sure that Oakland and San Jose had the only good Ethiopian restaurants in the Bay Area, but now I've found a place that can satisfy my cravings in San Francisco.\n\nThe two best things about Moya are the kitfo and the injera.  The injera is all teff, so it's gluten free and a gorgeous color.  It's very flavorful and sour. The kitfo is only served raw and is incredible. I'm not as big of a fan of the veggie combo or doro tibs.", "rating": 5, "date": "2014-07-13"}, {"excerpts": ["I left a review for this restaurant before that addressed the practice of them charging for injera. ", "They must follow their Yelp reviews and considered my points valid, and they began providing injera with the meals. ", "Charging for the injeras was my only real complaint as it was tantamount to charging for chopsticks in a Chinese restaurant or a fork at any other restaurant. ", "I'm happy to say that their business model for charging for the injera seems to have improved to a more reasonable model. \n\n", "Thank you again for adjusting the charging for injera to complimentary with a meal."], "author": "dAvid s.", "review": "I left a review for this restaurant before that addressed the practice of them charging for injera. They must follow their Yelp reviews and considered my points valid, and they began providing injera with the meals. Charging for the injeras was my only real complaint as it was tantamount to charging for chopsticks in a Chinese restaurant or a fork at any other restaurant. I'm happy to say that their business model for charging for the injera seems to have improved to a more reasonable model. \n\nI will say that they are great on customer service here. My boyfriend's iPhone was dying, and they allowed us to use their iPad charger from their iPad/Square/register setup. This is going above and beyond. \n\nThank you again for adjusting the charging for injera to complimentary with a meal.", "rating": 4, "date": "2014-07-10"}, {"excerpts": ["Gluten free injera, veggie sampler (of course) spiced so deliciously. ", "And super friendly staff.\n", "The restaurant itself is a bit cold feeling with the warehousy vibe, but the food is too good to care."], "author": "Krista H.", "review": "I don't give out 5 stars unless i mean it and I do. Gluten free injera, veggie sampler (of course) spiced so deliciously. And super friendly staff.\nThe restaurant itself is a bit cold feeling with the warehousy vibe, but the food is too good to care.", "rating": 5, "date": "2014-03-07"}, {"excerpts": ["Small salad and injera were included.\n\n", "The injera portion could have been larger, but on the bright side, it prevented me from overeating and having to teff out the afternoon in an uncomfortable state. "], "author": "Chris Z.", "review": "One visit so far. Takeout, called in by phone. Takeout service was quick and efficient.\n\nI got the doro tibs (chicken stew), ordered spicy, with an added side of the kik alicha (yellow split pea stew) (or was it shiro?). Small salad and injera were included.\n\nVerdict: Some of the better Ethiopian I've had. (Note, this is based on sampling only two dishes, so far.) I typically eat from places in Oakland that are solid (and there are many). \n\nThe chicken wasn't overcooked, and it had a flavorful, well-spiced clarified butter sauce. The split peas were firm (al dente?), not mushy, and thankfully not bland, either--the most common issues I find with this dish at other places.\n\nThe injera portion could have been larger, but on the bright side, it prevented me from overeating and having to teff out the afternoon in an uncomfortable state. (Yeah, that's an Ethiopian food pun.)\n\nPrices aren't cheap, but I'll still be returning because I'm willing to pay for the quality, and I don't have other nearby Ethiopian lunch options, anyway.", "rating": 4, "date": "2014-07-23"}, {"excerpts": ["Order one order of injera and ask for forks. ", "Eat the remainder of the food with the injera on the bottom of the platter. "], "author": "Ami K.", "review": "I adore Moya. The food is excellent and the people who run it are kind. I order different dishes every time I go based on the company, sometimes with vegetarians, sometimes with meat eaters. The menu is flexible this way. Order one order of injera and ask for forks. Eat the remainder of the food with the injera on the bottom of the platter. Personal fav is the vegetarian platter and the doro wot. \n\nMy favorite place in the city to get Ethiopian food. It's centrally located, takes square and it's worth it.", "rating": 5, "date": "2013-11-16"}, {"excerpts": ["Both dishes, as well as their accompanying side salads, arrived on a large, injera-lined platter. ", "The mushrooms were very juicy and tasted fresh. ", "The chicken drumsticks were tender, and the spice had permeated the meat to give it a delicious flavor. ", "We switched between using the injera and our forks to transport bite after bite into our hungry mouths. ", "When the main dishes were done, we couldn't help but pick at the injera on the platter that had soaked up all the yummy juices from the mushrooms and chicken.\n\n"], "author": "A.L. H.", "review": "TIP #1: Order at the counter, sit down, and enjoy the calm atmosphere before digging in!\n\nTIP #2: You can choose the spiciness level of each dish, but if you order multiple dishes, they'll come out on the same platter. So beware.\n\nNever write a review while hungry. Here I am, stomach grumbling, drooling on the keyboard--\n\nMy boyfriend and I ordered two dishes for dinner on a Wednesday evening: one with sauteed mushrooms, and one with chicken drumsticks and an egg. Both dishes, as well as their accompanying side salads, arrived on a large, injera-lined platter. The mushrooms were very juicy and tasted fresh. The chicken drumsticks were tender, and the spice had permeated the meat to give it a delicious flavor. We switched between using the injera and our forks to transport bite after bite into our hungry mouths. When the main dishes were done, we couldn't help but pick at the injera on the platter that had soaked up all the yummy juices from the mushrooms and chicken.\n\nYou can read and imagine, but it's nothing like going to Moya and experiencing it for yourself. Likewise, I can try to relive that dinner through this review... I will likely return when I crave Ethiopian food in the city again.", "rating": 4, "date": "2013-07-14"}, {"excerpts": ["gluten free injera available. ", "dead animal options also available."], "author": "Lentil C.", "review": "Best vegan Ethiopian dishes in North America (out of the 20+ places I've eaten - including DC!) amazing flavours and variety. the first time I've seen tofu or mushroom tibs on a menu and I'll be craving both until I return to SF. super friendly and accommodating staff. when I ate there they had just returned from Eithiopia with spices - which they blend themselves - for truly original flavours. both of the above tibs were cooked to order and I was given the choice of spice level. gluten free injera available. dead animal options also available.", "rating": 5, "date": "2015-01-31"}, {"excerpts": ["For my injera cravings I now head here where they boast both fabulous injera and gursha, the kik alitcha being my favrouite.\n\n"], "author": "Meg T.", "review": "Wait? There's an Ethiopian place near here?\n\nThat's where we're going then!\n\nThe restaurant Moya is well lit, but still slightly dusky giving them fantastic ambiance. They also have plenty of seating in their well laid out restaurant and the service is quick and personable. For my injera cravings I now head here where they boast both fabulous injera and gursha, the kik alitcha being my favrouite.\n\nThe only negatives in my book, which are probably positives to some, it that their door is wheelchair accessible, thus it stays open for several minutes after automatically opening. This simply means if you sit next to the door, it'll be chilly. They also don't take cash.\n\nTo me, this just means I now sit in the back and bring a billfold... or coin purse. I mean, I gotta spend those Caltrain coins somewhere's now don't I?", "rating": 5, "date": "2011-03-20"}, {"excerpts": ["All of the dishes are to be shared and come with injera and salad. "], "author": "Natalie S.", "review": "Great find on 9th. It's a clean small restaurant that serves up delicious Ethiopian food. All of the dishes are to be shared and come with injera and salad. I had the chicken with mushrooms, veggie sampler and mushrooms. If you want spicy, they can make it very spicy!!!\n\nService was great considering you order at the counter and seat yourselves. They also have a highchair if you need it. \n\nDefinitely on our list of SF staples.", "rating": 5, "date": "2013-09-18"}, {"excerpts": ["Our injera (all teff) was pleasantly tart and springy. ", "The injera was my favorite element of the meal, and while the other items seemed fresh, well presented, and good enough, they were also somewhat unsatisfying compared to the Ethiopian food I've had elsewhere."], "author": "Monica S.", "review": "We stumbled into Moya on accident, hungry and drawn to the relatively high reviews compared to other eateries in the area. \n\nWe ordered the garbanzo curry and the house special kitfo. \n\nOur injera (all teff) was pleasantly tart and springy. The kitfo was tender and tasted okay, but lacked some of the nuances of spiced butter that make this dish one I usually crave. Similarly, the garbanzo curry was spicy (in itself good - we like it hot), but besides the chili burn there was some layers of flavor missing from this dish. The dressing on the salad tasted way too vinegary for my taste. \n\nThe injera was my favorite element of the meal, and while the other items seemed fresh, well presented, and good enough, they were also somewhat unsatisfying compared to the Ethiopian food I've had elsewhere.", "rating": 3, "date": "2013-02-17"}, {"excerpts": ["All that said, the injera was fantastic and the place was quite clean (except for the wooden germ-laden bathroom key).  ", "I hope I just got the disinterested servers on a bad day ", "but I won't be running back anytime soon."], "author": "Carmella L.", "review": "I was pretty excited about going to the place but walked out less than impressed. Nothing was really wrong, per say, but the service was quite sub par and the food was underwhelming. I have eaten my fair share of Ethiopian in my day and it used to be my favorite cuisine. However, somehow this felt more like fast food than the authentic spices I am accustomed to. Infact, the veggie platter that was so well reviewed tasted like microwaved refried beans from a can and daal from a packet. All that said, the injera was fantastic and the place was quite clean (except for the wooden germ-laden bathroom key).  I hope I just got the disinterested servers on a bad day but I won't be running back anytime soon.", "rating": 2, "date": "2012-12-01"}, {"excerpts": ["We also got rice and injera bread.  ", "The lentils and chicken were super flavorful and they had nice heat.  ", "Portions were pretty fair.  "], "author": "Eddie L.", "review": "Fresh and tasty with a spicy kick in the pants!\n\nFood = 4.0: I met my cousin for lunch at Moya and we shared the spicy red lentils and the spicy chicken (doro tibs).  Each came with a small salad and two small relishes.  We also got rice and injera bread.  The lentils and chicken were super flavorful and they had nice heat.  Portions were pretty fair.  Next time, I will order the vegetarian sampler, which looked enormous!\n\nService = 3.5:  You order at the counter and they bring the plates to you.  The ladies working the place were very nice.  A half star bump for being able to pay with Square.\n\nAtmosphere = 4.0:  This space is way better than their previous space at 6th and Folsom.  Their first location was consumed by fire but as they say, \"Everything happens for a reason.\"  Thus, this new, clean and better location on 9th in the SoMa!", "rating": 4, "date": "2013-03-20"}, {"excerpts": ["Moya wins for flavor, 100% teff injera, and portion size. "], "author": "Todd I.", "review": "Best Ethiopian I've found in SF. Moya wins for flavor, 100% teff injera, and portion size. Only Sheba has marginally better texture.\n\nVeggie combo is always awesome, and the shuro is phenomenal. Friendly family runs the place -- mother cooking and daughters serving. Street parking has always been easy to find too.\n\nAbsolute pleasure to eat here, which I do 2-3 times a week.", "rating": 5, "date": "2010-09-20"}, {"excerpts": ["Swap the injera house baked sandwich bread.\n\n"], "author": "Jason B.", "review": "More Moya.\n\nTake a traditional Ethiopian platter.\n\nSwap the injera house baked sandwich bread.\n\nInside put a generous portion of chicken with just the right amount of kick.\n\nPrepare smooth house drip coffee for those of us who need a kick.\n\nTogether they gave me delicious reason to come back for a second visit.", "rating": 4, "date": "2013-02-23"}, {"excerpts": ["Pleased they offer a vegan lunch sampler with four dishes, with side salad, and a brown rice option instead of traditional injera bread, so gluten-avoiders can be very happy here."], "author": "Scott S.", "review": "Came for a quick lunch. Love Ethiopian food. Pleased they offer a vegan lunch sampler with four dishes, with side salad, and a brown rice option instead of traditional injera bread, so gluten-avoiders can be very happy here.", "rating": 4, "date": "2015-05-08"}, {"excerpts": ["They charge for the injera. ", "They give you a tiny basket and then you have to go buy more when you use up your first basket.\n", "2. ", "The injera was cold, kind of hard and definitely not fresh\n3. ", "The food was just meh - normally Ethiopian is one of my favorites\n4. ", "The lady handed me the bathroom key chain and then proceeded to give people their food and take orders without washing her hands! ", "After returning the key, I lost my appetite for eating food with my hands which had held the bathroom key."], "author": "Mickie D.", "review": "I love Ethiopian food and was sorely disappointed by this place. There are so many great Ethiopian places in the bay area.\n1. They charge for the injera. They give you a tiny basket and then you have to go buy more when you use up your first basket.\n2. The injera was cold, kind of hard and definitely not fresh\n3. The food was just meh - normally Ethiopian is one of my favorites\n4. The lady handed me the bathroom key chain and then proceeded to give people their food and take orders without washing her hands! After returning the key, I lost my appetite for eating food with my hands which had held the bathroom key.", "rating": 1, "date": "2014-06-16"}, {"excerpts": ["We started with the azifa appetizer (lentil w/ red onions, jalapeño, garlic, lemon, olive oil, and served w/ kita (homemade Ethiopian bread) or injera). ", "Now that I think about it, I don't think we were offered a choice between kita and injera, but I think we got kita since it was different from the injera we had later in the meal. ", "Service was quite good, and a fair amount of that consisted of continual injera refills (greatly appreciated). ", "I found the atmosphere to be rather sterile (is that why people keep calling it \"clean\"?), although it was filling up by 8:00 or so on a Tuesday evening."], "author": "Lisa K.", "review": "We started with the azifa appetizer (lentil w/ red onions, jalapeño, garlic, lemon, olive oil, and served w/ kita (homemade Ethiopian bread) or injera). Now that I think about it, I don't think we were offered a choice between kita and injera, but I think we got kita since it was different from the injera we had later in the meal. This appetizer was wonderful, although I didn't really think there was a large enough portion to split among five people.\n\nWe had the shuro, ye doro wat, kik alitcha, gomen, ayb (cheese), and ye bere tibs. I liked the vegetarian dishes a lot - as usual, Ethiopian is the only way I like collard greens. The ye doro wat was also phenomenal - their bere bere sauce is my personal favorite. I think I would skip the beef next time, and I didn't find the shuro to be as amazing as everyone else does - it reminded me of the sauce from chicken tikka masala - not bad, just not interesting. It seemed like there was a lot of salad around too, which was just ok.\n\nService was quite good, and a fair amount of that consisted of continual injera refills (greatly appreciated). I found the atmosphere to be rather sterile (is that why people keep calling it \"clean\"?), although it was filling up by 8:00 or so on a Tuesday evening.", "rating": 4, "date": "2010-11-29"}, {"excerpts": ["I really like getting the red lentil rolled into the injera bread, and cut into cocktail roll pieces. ", "$5+tax. ", "Not too shabby, especially for something so tasty! ", "I can only ever get through 3/4 of it, anyway. ", "Mmmm...", "I think I'll get some tomorrow.."], "author": "Angelica D.", "review": "I love coming here. The restaurant is literally right next door to my office, which is quite dangerous considering you only need to be within a 500 ft. radius of the place in order to get a tantalizing whiff of the delicious spices at play in all their dishes. Plus the staff is super friendly and helpful when an indecisive girl like me leaves the decision-making up to them ;)\n\nYou can't go wrong with the veggie sampler, but when I'm on a budget I really like getting the red lentil rolled into the injera bread, and cut into cocktail roll pieces. $5+tax. Not too shabby, especially for something so tasty! I can only ever get through 3/4 of it, anyway. Mmmm...I think I'll get some tomorrow..", "rating": 5, "date": "2012-10-17"}, {"excerpts": ["Great chicken dol wat, Vegetarian sampler (especially the red lentils and collard greens), and Teff-only Injera!\n", "Super friendly staff of Ethiopian women in a sparsely decorated but cozy and clean restaurant.  ", "Would definitely come here again and hope it makes it for the long term.  ", "Really enjoyed the berbere spice and balance of flavors."], "author": "Ya-Bing C.", "review": "Great chicken dol wat, Vegetarian sampler (especially the red lentils and collard greens), and Teff-only Injera!\nSuper friendly staff of Ethiopian women in a sparsely decorated but cozy and clean restaurant.  Would definitely come here again and hope it makes it for the long term.  Really enjoyed the berbere spice and balance of flavors.", "rating": 4, "date": "2010-08-15"}, {"excerpts": ["The injera (ethiopian bread) has a very interesting texture almost spongy ", "but I quite enjoyed it. "], "author": "Kirita S.", "review": "I wanted to check this place out because their reviews were good so I went with my boyfriend during my lunch break. My first time trying Ethiopian food and I am in love now. The ambience fits perfectly with its location (downtown S.F. industrial). The staff is very friendly and the place is surprisingly very spacious. We came in just before the lunch rush hour so we got our food in a timely manner. \n\nI had the Ingudai Doro Tibs platter extra spicy and it was amazing. The injera (ethiopian bread) has a very interesting texture almost spongy but I quite enjoyed it. I do regret not ordering the veggie sampler that everyone talks about. \n\nTheir lunch menu is one page which is very fitting because I hate restaurants with menus the size of a short novel. I will definitely be coming back to this place so I can try some more of their items.\n\n*like any where else in the city parking is hard to find; however, we got lucky and snagged a parking spot a few feet away from the restaurant.", "rating": 4, "date": "2013-05-23"}, {"excerpts": ["The veggie sampler, an order of the Dora Tibs, and an extra order of Injera bread was the ample for 2 adults and 2 kids.\n\n"], "author": "Rudy R.", "review": "Our family tried Moya for the first time this weekend and the kids loved the DORA TIBS and eating with their hands.  The staff was family friendly and immediately pushed two tables together to accommodate us.  The food was good and served QUICKLY.  The veggie sampler, an order of the Dora Tibs, and an extra order of Injera bread was the ample for 2 adults and 2 kids.\n\nReally, an Ethiopian restaurant should have a sink outside of the bathroom area so patrons can quickly and easily wash their hands before the meal.  Dealing with the bathroom key (understood as it is SOMA) and only one bathroom is not very efficient.", "rating": 4, "date": "2012-06-24"}, {"excerpts": ["For the first time in my LIFE I had real all-teff injera.  ", "I couldn't even get this stuff in the middle east an hours flight from Addis Abba.  ", "This is an acquired taste ", "so I don't recommend it unless you are really into injera, but everything here is tasty and flavorful.  \n\n"], "author": "M S.", "review": "THE BEST ETHIOPIAN PLACE IN THE CITY!!!!\n\nNO QUESTION, THE PLACE TO GO.\n\nFor the first time in my LIFE I had real all-teff injera.  I couldn't even get this stuff in the middle east an hours flight from Addis Abba.  This is an acquired taste so I don't recommend it unless you are really into injera, but everything here is tasty and flavorful.  \n\nFinally an Ethiopian place that has a cool modern interior and fast service.  They are also generous with the proportions.\n\nIS", "rating": 5, "date": "2013-01-29"}, {"excerpts": ["My recs: \nGursha - injera with red lentils ($6 for a box of rolls; great for a small lunch kind of day), the veggie \n\nMushroom- "], "author": "liz c.", "review": "Hooooray! Great new place to eat at in SOMA. \n\nWonderful place to eat lunch at during the week. The staff is warm and friendly. The service is quick. The place is clean unlike the sidewalk directly outside the door.\n\nMy recs: \nGursha - injera with red lentils ($6 for a box of rolls; great for a small lunch kind of day), the veggie \n\nMushroom- Chicken Tibs - a very savory stew with mushroom and chicken. It's delicious and very filling.\n\nVeggie sampler\n\nReally love this place and couldn't be happier that they are on 9th!!", "rating": 4, "date": "2012-06-19"}, {"excerpts": ["We went through an additional serving of injera to scrap up the last goops of deliciousness before we admitted defeat. "], "author": "Tinna H.", "review": "Between two, we ordered the Vegetarian Combo, which is clearly marked to serve two. Since it was our first time at Moya, we decided to order an additional meat dish [Bozena Shuro] to share. It was a good thing that the two of us hadn't eaten much since brunch and were actually quite hungry because that was a lot of food! We went through an additional serving of injera to scrap up the last goops of deliciousness before we admitted defeat. Next time [and there will definitely be a next time], we'll just order the combo for two. \n\nEating with your hands can be a lot of fun, but be sure to wash them before you begin! I've been to a handful of Ethiopian/Eritrean places, and Moya has to be one of my favorites. \n\nThe only downside of the place is their automatic door. It takes a few seconds to shut, and if you're at one of the tables by the door, you have to put on your jacket to stay warm.", "rating": 4, "date": "2011-03-05"}, {"excerpts": ["I am enamored with your Injera! ", "I am mystified by your Misir ", "Wot! ", "I am grateful for your greens! "], "author": "Carnley P.", "review": "4th week of Lent, and I've just about exhausted my catalog of vegan dishes to cook at home. I am a sad, sad kitten. Tired of cooking, and restaurants are uninspiring. \n\nBut, Praise Moya!!\nI am enamored with your Injera! I am mystified by your Misir Wot! I am grateful for your greens! Your Kik Alitcha kicks ass!\n\nI found you today, and may you never leave me! Meat or no meat, you are a godsend!\n\nLent certified, Carnley approved. VEGAN FRIENDLY!", "rating": 5, "date": "2011-03-31"}, {"excerpts": ["Loved the vegetarian injera, Doro tibs and misir wot!"], "author": "Madhuri S.", "review": "A small place with a seating seating capacity of 20 may be.. Not so elegant and fancy.. Mostly quiet.. But the food is to die for.. They are best at what they are expected to do.. That's serving great food.. Good option for vegetarians.. Spicy and great portions.. Have an option to order food family style, which works out great.. Loved the vegetarian injera, Doro tibs and misir wot!", "rating": 5, "date": "2014-04-10"}, {"excerpts": ["I've learned not to judge an Ethiopian restaurant by the attentiveness of their waitstaff, but our server kept our water refilled and brought us extra napkins and injera without us having to ask. "], "author": "J W.", "review": "I've only been to a handful of Ethiopian restaurants (about 8 restaurants in 4 different cities) but Moya was easily the best. The kitfo was amazing, and they have mushrooms here, which have been a little hard for me to find. The portions were ridiculous -- we spent about $20 per person and didn't even come close to finishing what we ordered.\n\nMy only complaints are that they don't serve beer or honey wine, and that the mushrooms which we ordered medium were not even the least bit spicy. Considering that there was a person at my table who seemed hesitant about the spiciness, that may have been our server acting a little too cautious.\n\nAnd speaking of our server, she was fantastic. I've learned not to judge an Ethiopian restaurant by the attentiveness of their waitstaff, but our server kept our water refilled and brought us extra napkins and injera without us having to ask. It was perfect.\n\nIf they start serving alcohol I will not hesitate to bump my review up to 5 stars. Regardless, I will be back as soon as possible.\n\nPlease go here and keep it hopping! This is exactly the kind of restaurant that deserves to thrive in San Francisco.", "rating": 4, "date": "2011-04-27"}, {"excerpts": ["The veggie sampler and injera were great;  Can't wait to try more items.  ", "Hopefully you'll be able to serve honey wine again."], "author": "Tony D.", "review": "Welcome to the neighborhood!  I was quite excited to find out you were reopening so close by, it was well worth the wait.\n\nThe veggie sampler and injera were great;  Can't wait to try more items.  Hopefully you'll be able to serve honey wine again.", "rating": 4, "date": "2012-05-02"}, {"excerpts": ["You tear off a piece of injera (a bread with a very sponge-like consistency), wrap it around some food, and chow away.\n\n"], "author": "Tim B.", "review": "Went here for lunch with 3 others. They hadn't had Ethiopian food before. I had eaten it a few times and wasn't taken seriously when I said you eat it with your hands.\n\nWell, um: ya do. You tear off a piece of injera (a bread with a very sponge-like consistency), wrap it around some food, and chow away.\n\nWe ordered a variety of items consisting of the tofu tibs, ye doro tibs (chicken), vegetarian combo, and one of the beef items (sorry, the name escapes me).\n\nEven though the place was almost empty when we were there, it took about 15 minutes to get the food prepared. When it arrived, it was served on a single, giant platter. It took up almost the entire table. In addition to what we had ordered, they threw on a couple of samples other menu items. The place was clearly very new, so the staff probably hasn't had time to work out the kinks of running the place yet.\n\nPortion size: excellent. The four of us left feeling stuffed. And this is a fairly active group of people, accustomed to burning a lot of calories.\n\nService: It took it awhile, but the waitress was very friendly and quite knowledgeable about the details of menu items and of Ethiopian cuisine in general. So, \"very good.\"\n\nValue: Considering the quantity of food, it's very good.\n\nDrawbacks: \n\n1) the prices were a bit high for lunch (average entree was about $13). Since they seem to want to attract a noontime crowd, they need to have prices that are appealing. Note: their website indicates that they have \"lunch specials\" now, so perhaps that's since been remedied.\n\n2) Because you eat this food with your hands, they need to provide tableside hand-cleaning both BEFORE and AFTER you eat. Perhaps some warm, wet towels or something. And yes, I know: there is a restroom in the back, but if the place gets busy, there's going to be a crowd waiting for it. Also, public restrooms can get really icky.\n\n3.4 stars.", "rating": 3, "date": "2011-03-12"}, {"excerpts": ["Food is disappointing - used to be good, I loved the veggie platter which used to be served on a bed of injera, along with injera served on the side to dip the food in and the price was 9.95. ", "Fast forward to now, 2018, price is now $12.95, and they no longer serve the injera underneath the plate of food- which is the tradition. ", "And, i requested injera gluten free but they served it with gluten and told me they were out of the gluten free that day, but neglected to tell me prior to ordering. ", "Employees seem disengaged and the place has gotten more pricey but gone down hill. ", "They  are obsessed apparently with cutting corners and at the same time still raising the price. ", "Would not recommend, too many really good Ethiopian places in this town."], "author": "Kay C.", "review": "Food is disappointing - used to be good, I loved the veggie platter which used to be served on a bed of injera, along with injera served on the side to dip the food in and the price was 9.95. Fast forward to now, 2018, price is now $12.95, and they no longer serve the injera underneath the plate of food- which is the tradition. And, i requested injera gluten free but they served it with gluten and told me they were out of the gluten free that day, but neglected to tell me prior to ordering. Employees seem disengaged and the place has gotten more pricey but gone down hill. They  are obsessed apparently with cutting corners and at the same time still raising the price. Would not recommend, too many really good Ethiopian places in this town.", "rating": 2, "date": "2015-09-30"}, {"excerpts": ["Both dishes had lots of delicious flavor, especially combined with the injera bread served.  ", "We loved the lamb dish the most, so much complex spices and flavor and the lamb was cooked so tender that it broke apart once we try to scoop it up with the injera bread.\n\n"], "author": "Yun W.", "review": "First time experiencing Ethiopian cuisine.  Waitress was really friendly and made some good suggestions in terms of what us first timers should try.  Also, she gave us a couple samplings of the vegetarian dishes since we ordered only meats which prompted us to order the red lentils next time we come back.\n\nWe ordered the Kitfo (spicy rare beef with cottage cheese) and Ye Doro Tibs (lamb with clarified butter in spices).  Both dishes had lots of delicious flavor, especially combined with the injera bread served.  We loved the lamb dish the most, so much complex spices and flavor and the lamb was cooked so tender that it broke apart once we try to scoop it up with the injera bread.\n\nWe will be back for sure.", "rating": 5, "date": "2011-02-26"}, {"excerpts": ["The injera is 100% teff, so great for wheat-free eating.   ", "Moya is owner operated, the women are fantastic and the food is lovingly prepard and served with pride.  ", "Best kept left-overs secret:  fry up that injera  ", "is a spec of olive oil and eat it with eggs for breakfast.  ", "Puts soughdough bread to shame!"], "author": "Beth B.", "review": "Some of the best food in the city!  The cafe is casual and food is tasty and healthfully balanced.  BONUS:  The injera is 100% teff, so great for wheat-free eating.   Moya is owner operated, the women are fantastic and the food is lovingly prepard and served with pride.  This restaurant is one of our GO TO spots for a casual dinner out or take-out.  \n\nBest kept left-overs secret:  fry up that injera  is a spec of olive oil and eat it with eggs for breakfast.  Puts soughdough bread to shame!", "rating": 5, "date": "2014-06-04"}, {"excerpts": ["If you are value conscious the portions are huge and on top of that the injera which is given with every order is very filling. \n\n"], "author": "Roger H.", "review": "This was my first time eating Ethiopian and Moya popped my cherry gently. \n\nLike a true virgin I wasn't really adventurous and started with the gursha, which was my favorite dish.  We picked 2 entrees and the ye doro wot was tender and the ye beg tibs was sweet. I asked for spicy ye beg tibs but I didn't find it spicy at all. Maybe I should have asked for super spicy.\n \nIf you are value conscious the portions are huge and on top of that the injera which is given with every order is very filling. \n\nService was friendly and efficient.  Our server sensed we were inexperienced and had plenty of patience with us.\n\nThe one drawback is the lack of alcohol and dessert. I really could have used a nice red for my lamb.", "rating": 4, "date": "2011-02-26"}, {"excerpts": ["The injera was too thick for me. ", "Was more like a pancake & the food didn't have much flavor. ", "But it beats Burger King or any other fast food."], "author": "Brooke B.", "review": "I tried this place for the first time last night and ordered the veggie combo. Their food was ok. The injera was too thick for me. Was more like a pancake & the food didn't have much flavor. But it beats Burger King or any other fast food.", "rating": 3, "date": "2013-03-05"}, {"excerpts": ["Half way through the meal both the mom and aunt came to check on us and talk about the real deal injera made only with Teff, the staple grain of Ethiopia (and also gluten free for those who care).\n\n"], "author": "megan k.", "review": "So glad to finally have an authentic, mom and pop type Ethiopian place in the work hood.\n\nThe food is amazing, and yes the rapport with customers is great too- the waitress told us that every dish is cooked by her mom and aunt with love. Half way through the meal both the mom and aunt came to check on us and talk about the real deal injera made only with Teff, the staple grain of Ethiopia (and also gluten free for those who care).\n\nI had the Ye Doro Wot, chicken marinated in lemon juice, then sautéed in a rich sauce made with garlic, onion, fresh ginger, and Berbere (special house blend of red chili peppers and other traditional spices) sauce, and kibe (clarified butter with spices) and cooked slowly until tender. Served with a hard boiled egg.\n\nTheir menu doesn't lie, the meat was fall off the bone tender, and sooooo good.", "rating": 5, "date": "2010-07-21"}, {"excerpts": ["It just didn't seem right to eat it without having the full experience -- by which I mean the injera -- and nobody in San Francisco was making injera with 100% teff. ", "Teff is an impressively tiny grain grown in Africa that is dark brown in color, sour-flavored, a bit gummy when cooked, and is the basis for traditional injera. ", "You can still buy teff in America -- at a price. ", "Most restaurants are keeping their costs down by cutting their teff with wheat, which is great for the budget but frustrating for folks with gluten allergies. ", "Moya, instead, makes two kinds of injera -- one with wheat, and one without. ", "They charge a little more for the teff-only version, which is brilliant. ", "I also explained that I am allergic to gluten, and ordered the teff-only injera for my meal. \n\n", "His kitfo came out soon after, along with a plate with a couple of extra rolls of injera. ", "The woman who brought the food set the injera down next to me, so I assumed it was mine. ", "A few minutes later, my food came out -- and I noticed the injera on my plate was much darker than the stuff I'd just eaten. ", "It tasted different, too; more like pure teff. ", "Uh oh. ", "I talked with the woman who'd served our food, and she confirmed that the injera I'd tried earlier had wheat in it. ", "She claimed she told us that it was my date's, not mine, but admitted it was confusing that she had set it in front of me. ", "They agreed to knock the cost of my injera off the order, and I wondered if that would make up for the allergic reaction I might have later. \n\n", "The meat was tender and rich, complemented by the light sourness of the injera. ", "The sauce was buttery and spicy, also a perfect foil for the bread. ", "I would have loved more salad, and was surprised by how quickly I was filled by the meal. ", "I had enough to take home and enjoy for lunch the next day. ", "Plus, I learned how to tell the difference between the wheat-laced injera and the stuff that's safe for me to eat, so I would feel comfortable going back. \n\n"], "author": "Beth W.", "review": "I am still getting my Ethiopian-food legs, so to speak, and I learned a lot from my dinner at Moya. \n\nAs much as I loved it, after we ate at New Eritrea, I was going to give myself a long break from Ethiopean food. It just didn't seem right to eat it without having the full experience -- by which I mean the injera -- and nobody in San Francisco was making injera with 100% teff. But then Moya came along. \n\nTimes are hard in Africa, especially hard right now, and there is a severe teff shortage. Teff is an impressively tiny grain grown in Africa that is dark brown in color, sour-flavored, a bit gummy when cooked, and is the basis for traditional injera. You can still buy teff in America -- at a price. Most restaurants are keeping their costs down by cutting their teff with wheat, which is great for the budget but frustrating for folks with gluten allergies. Moya, instead, makes two kinds of injera -- one with wheat, and one without. They charge a little more for the teff-only version, which is brilliant. I wish other Ethiopean places would do this. \n\nSo, I decided to reverse my moratorium on Ethiopean food and give Moya a try. My date and I visited on a Friday evening; the restaurant had a few diners but wasn't packed. The decor is more cafe than African, though it is clean and feels friendly. We were encouraged to sit anywhere, and urged to try the ye beg wot, a tender lamb dish that had just come out of the pot and was getting rave reviews from other diners. I ordered it, while my date braved the ultra-rare kitfo. I also explained that I am allergic to gluten, and ordered the teff-only injera for my meal. \n\nMy date ordered the azifa, and I had a taste of the zesty lentils before he began spooning them onto pieces of flatbread (wheat-based, so I couldn't have it). His kitfo came out soon after, along with a plate with a couple of extra rolls of injera. The woman who brought the food set the injera down next to me, so I assumed it was mine. Excited to try it, I took a bite. \n\nA few minutes later, my food came out -- and I noticed the injera on my plate was much darker than the stuff I'd just eaten. It tasted different, too; more like pure teff. Uh oh. I talked with the woman who'd served our food, and she confirmed that the injera I'd tried earlier had wheat in it. She claimed she told us that it was my date's, not mine, but admitted it was confusing that she had set it in front of me. They agreed to knock the cost of my injera off the order, and I wondered if that would make up for the allergic reaction I might have later. \n\nNevertheless, the lamb was amazing. The meat was tender and rich, complemented by the light sourness of the injera. The sauce was buttery and spicy, also a perfect foil for the bread. I would have loved more salad, and was surprised by how quickly I was filled by the meal. I had enough to take home and enjoy for lunch the next day. My date liked his kitfo even more than my lamb. \n\nI didn't wind up having a truly bad reaction to the bite of wheat I got, though I did feel crummy for a couple of days after. Plus, I learned how to tell the difference between the wheat-laced injera and the stuff that's safe for me to eat, so I would feel comfortable going back. \n\nI'm docking one star for the allergy-related confusion, and reluctantly docking one more because I wish they had a wine selection to go with the food -- Ethiopean honey wine, at the very least.", "rating": 3, "date": "2010-07-31"}, {"excerpts": ["The sight of stony grey, spongy, aerated, injera bread rolled on a plate is motivation to plot a course on GOOGLE maps and head outside.  ", "If it's a few blocks away, I'll just do a YELPY and see what the vibe is....", "I know, not exactly road less traveled, throw caution to the wind, stuff that adventures are made of ", "but..when I am salivating over menus on the web and my tummy needs filling...", "I don't like to take too many risks.  ", "gluten-free, injera bread.  ", "The salad was simply chopped toms and lettuce but dusted with white pepper - usually pet hate of mine, but..it worked, I was converted; a stew of carrots kale; slow cooked collard greens; yellow split peas in garlic & spices and split red lentils in Berbere sauce.  ", "I also called ahead (obsessive planning!..but they ask for 30mins notice) to get them whipping up some Shuro (ground garbanzos cooked in garlic & Berbere sauce).  ", "The injera was good..perfect in fact.  ", "A texture like nothing else.  ", "The palate of dishes in the veggie combo?  ", "I enjoyed the salad..", "actually I enjoyed EVERYTHING.  ", "The red split lentils were worthy of a trumpeted fanfare and mini indoor sparklers..yey!  ", "The other dishes were good but my socks were not blown off, tic-a-tape did not rain from the sky ", "and I did not  take to the floor to perform three somersaults, air straddle splits and a triple salto in celebration.  ", "Hmm, I'd go again.. ", "but I'd gorge (and you do gorge..", "they are GENEROUS portions) on the spicy misir and an injera or two.  ", "I'd save my dosh for spending on a sweet vegan goodie from Rainbow Grocery on the way home and give the Shuro a miss too ..", "it didn't rock my boat..", "more of a gentle nudge from the wake of a passing ship."], "author": "Leigh With A Veganobsession X.", "review": "The sight of stony grey, spongy, aerated, injera bread rolled on a plate is motivation to plot a course on GOOGLE maps and head outside.  If it's a few blocks away, I'll just do a YELPY and see what the vibe is....I know, not exactly road less traveled, throw caution to the wind, stuff that adventures are made of but..when I am salivating over menus on the web and my tummy needs filling...I don't like to take too many risks.  I know, got to live on the 'food' edge more.\n\nVEGANSAURUS rated MOYA as ^swear word^ delicious, 'Moya rules' .  Enough said.  My coat was flying behind me as I attempted to get dressed and walk down the street at the same time.  Skill.\n\nI walked down Folsom to 7th, past some rather 'interesting' bars.  I'd railroaded my foodie pal into eating an early dinner (for Glen it was a late lunch/early dinner...a linner?  Well..we accepted the word brunch didn't we?!)  The restaurant only had one couple tucking in when we arrived.  More arrived whilst we scoffed.\n\nWe ordered the vegetarian combo (yes, 'tis vegan), a buffet/taster plate.  Five dishes  spooned on Teff - a nutritious Ethiopian grain..Wiki tells it. gluten-free, injera bread.  The salad was simply chopped toms and lettuce but dusted with white pepper - usually pet hate of mine, but..it worked, I was converted; a stew of carrots kale; slow cooked collard greens; yellow split peas in garlic & spices and split red lentils in Berbere sauce.  I also called ahead (obsessive planning!..but they ask for 30mins notice) to get them whipping up some Shuro (ground garbanzos cooked in garlic & Berbere sauce).  Vegansaurus said to order it and slather it on everything as it was like liquid butter... \n\nThe injera was good..perfect in fact.  A texture like nothing else.  The palate of dishes in the veggie combo?  I enjoyed the salad..actually I enjoyed EVERYTHING.  The red split lentils were worthy of a trumpeted fanfare and mini indoor sparklers..yey!  The other dishes were good but my socks were not blown off, tic-a-tape did not rain from the sky and I did not  take to the floor to perform three somersaults, air straddle splits and a triple salto in celebration.  Hmm, I'd go again.. but I'd gorge (and you do gorge..they are GENEROUS portions) on the spicy misir and an injera or two.  I'd save my dosh for spending on a sweet vegan goodie from Rainbow Grocery on the way home and give the Shuro a miss too ..it didn't rock my boat..more of a gentle nudge from the wake of a passing ship., ok, ok, you knew what I meant.\n\n\nPlus points; the food was brought out in minutes, the cooks/server seemed (quietly) proud of their food.\nMinus; they currently only take cash BUT they do have an ATM", "rating": 3, "date": "2011-04-19"}, {"excerpts": ["Also, the portion of injera that goes along with lunch was a little too small and an extra order costs $2 bucks. ", "As a redeeming factor, however, the staff was extremely friendly (I expect no less from Ethiopians!) ", "and she ended up giving it to us for free.\n"], "author": "Drea C.", "review": "Overall, it was a good experience. I ordered the veggie sampler lunch and the portion of lentils, potatoes and salad was really huge. The salad has more of a 'california' twist to it than I would have preferred and they had a side dish that resembled more of a Mexican salsa fresca than anything Ethiopian so I have to ding them a bit for true authenticity. \nI had to round up to four stars but I would've really given this place a 3.5. Having just returned from a trip to Ethiopia, I was excited when a friend asked me to do lunch at a local Ethiopian cafe. I saw on their website that they offer macchiato, which got me really excited. \nUnfortunately, their machine was broken and the only alternative was just a drip coffee they had made. Bummer. \nAlso, the portion of injera that goes along with lunch was a little too small and an extra order costs $2 bucks. As a redeeming factor, however, the staff was extremely friendly (I expect no less from Ethiopians!) and she ended up giving it to us for free.\nAmasegenalu!! \n\nPS: if anyone out there who is a big fan of Ethiopian food has managed to find fruit \"spreece\" or salad \"atakelt\", please let me know!! I miss them so much!!", "rating": 4, "date": "2013-09-21"}, {"excerpts": ["If you go there, make sure not to eat the injera bread first it will expand in your stomach and you will barely be able to finish your first plate. ", "They also include the mushroom and berbere sauce entree in the buffet which is usually left out of veggie combos at other ethiopian restaurants."], "author": "Onika C.", "review": "Good ethiopian, but the portions for the price is a bit pricey but what I would expect from ethiopian food in the city. Though tasty, I will still be going to the all you can eat ethiopian buffet on ashby and telegraph in berkeley. If you go there, make sure not to eat the injera bread first it will expand in your stomach and you will barely be able to finish your first plate. They also include the mushroom and berbere sauce entree in the buffet which is usually left out of veggie combos at other ethiopian restaurants.", "rating": 3, "date": "2013-07-07"}, {"excerpts": ["I have to up the rating.. unlimited injera!\n", "Get the Shuro, the menu says it will take 30 minutes ", "but I don't think it felt that long, and it was worth the wait."], "author": "Kaushal P.", "review": "I have to up the rating.. unlimited injera!\nGet the Shuro, the menu says it will take 30 minutes but I don't think it felt that long, and it was worth the wait.", "rating": 5, "date": "2010-08-18"}, {"excerpts": ["Another positive differentiator of Moya over other Ethiopian places is their attentive service, especially when bringing over fresh injera, which we always seem to run out of several times. \n\n"], "author": "Adam B.", "review": "The most striking thing about Moya compared to other Ethiopian restaurants is that it was very clean. Most other Ethiopian places that I've been to are very delicious but not exactly a neat freak's paradise. Moya is both clean and delicious.\n\nWe have been here twice, and both times we ordered a vegetarian combo and Ye Doro Tibs with chicken - shared, of course. Both were very good. I highly recommend getting an order of the vegetarian combo because it gives you a chance to sample many different dishes.\n\nAnother positive differentiator of Moya over other Ethiopian places is their attentive service, especially when bringing over fresh injera, which we always seem to run out of several times. \n\nI will definitely be back!", "rating": 5, "date": "2010-10-28"}, {"excerpts": ["The shuro is the best I've ever had, and if you ask for it, they will serve you injera made with 100% teff, which is what is used in Ethiopia. ", "Besides being much healthier than regular injera, the teff injera tastes a lot better, too."], "author": "Tynan S.", "review": "Moya is easily the best Ethiopian restaurant in the city, possibly the best in the whole bay area. The shuro is the best I've ever had, and if you ask for it, they will serve you injera made with 100% teff, which is what is used in Ethiopia. Besides being much healthier than regular injera, the teff injera tastes a lot better, too.", "rating": 5, "date": "2012-07-13"}, {"excerpts": ["First off, gluten-free injera. ", "NO where else has this. ", "As a person who is sensitive to gluten, this is really great since I can actually enjoy Ethiopian food again. ", "It's been so long! ", "The food is great. ", "We ordered a vegetarian combo, buzena tibs, and ye beg tibs. ", "All were excellent, fresh, and perfectly salted and not overly spiced. ", "Just a perfect balance of flavors. "], "author": "Stewart L.", "review": "This place was the best Ethiopian restaurant I've ever been to, and I've been to a lot of them. First off, gluten-free injera. NO where else has this. As a person who is sensitive to gluten, this is really great since I can actually enjoy Ethiopian food again. It's been so long! The food is great. We ordered a vegetarian combo, buzena tibs, and ye beg tibs. All were excellent, fresh, and perfectly salted and not overly spiced. Just a perfect balance of flavors. They also served a good variety of beverages including Numi Organic Teas. \n\nService was excellent and attentive and the staff were all very nice and kind. The bathrooms were clean. We'll definitely be back!", "rating": 5, "date": "2010-08-01"}, {"excerpts": ["Had us try some of the injera bread other reviewers have raved about.\n\n"], "author": "Carolyn J.", "review": "Came here after dinner for some coffee. Didn't realize it was a full on Ethiopian spot. Yelp had this under \"Coffee & Tea\" in their app. Yummy lattes (no flavored). Service was nice and friendly. Had us try some of the injera bread other reviewers have raved about.\n\nBookmarked for a future visit!", "rating": 3, "date": "2011-02-22"}, {"excerpts": ["Tasty injera too, and a gluten free option is available.\n\n"], "author": "Ann V.", "review": "It's been ages since I had Ethiopian food--probably 15+ years ago.  Clearly, it's been too long.\n\nClean, cozy, and yummy smells are a winning trifecta in my book!  The food was delicious...I shared the veggie combo and it was PLENTY of food.  Tasty injera too, and a gluten free option is available.\n\nAlso loved the friendly service and strong coffee.  A definite winner!", "rating": 4, "date": "2010-08-30"}, {"excerpts": ["Ordered a spicy chicken dish with injera bread and salad. ", "Hit the spot."], "author": "Kevin A.", "review": "Delicious. Ordered a spicy chicken dish with injera bread and salad. Hit the spot.", "rating": 4, "date": "2013-01-02"}, {"excerpts": ["The injera was fresh and of perfect consistency.  ", "We started with the ye timatim fit fit, which was a fresh and lite salad, perfect for introducing those new to Ethiopian food to the injera.  ", "The vegetarian combination was very good.  "], "author": "Kelly M.", "review": "Everything about my experience at Moya was great.  This was the first Ethiopian I have had in the Bay area, but it is better than my other experiences, even when I was living in the DC area.  \n\nThe staff was very personable and spent time explaining how to eat Ethiopian as well as suggesting dishes to the people in my party who had not had Ethiopian before.  Our sever even explained some of the cultural significance of different dishes.  \n\nThe flavors were rich and not overpowered by heat.  The sauces had a great mixture of savory and spicy, and were not overly greasy.  The injera was fresh and of perfect consistency.  We started with the ye timatim fit fit, which was a fresh and lite salad, perfect for introducing those new to Ethiopian food to the injera.  The vegetarian combination was very good.  The gomen, collard greens, was a stand-out as far as the vegetarian dishes.  The Moya Special Kitfo was full of a great herbal flavor that I couldn't quite figure out.  The ye doro wot was also delicious, and even better when mixed with a little of the ayb (home made cottage cheese) as suggested by our server.\n\nThe interior is new and clean, with ample seating available when we arrived for an early dinner at 6:30pm.  The surrounding area is not very residential, so there was ample parking on the same block when we arrived.\n\nI am definitely excited to go back and sample more of their menu.  By interacting with the servers, cooks and owner, you can tell that they work hard to make delicious \"home-style\" Ethiopian food and very proud of the product.", "rating": 5, "date": "2010-08-30"}, {"excerpts": ["For two of us, getting the teff injera (which is actually what injera is supposed to be made with; many places cut the teff with flour; teff is also gluten free!) "], "author": "Nicki F.", "review": "This place was amazing; clean, welcoming and run and owned by two women.  I loved that it was a family run place.  For two of us, getting the teff injera (which is actually what injera is supposed to be made with; many places cut the teff with flour; teff is also gluten free!) and the all veggie platter, it was a grand total of $23. \n\nWe didn't even finish it all and we were stuffed......\n\nThe food was colorful, flavorful and just amazing....can't wait to hit it up again!", "rating": 5, "date": "2010-09-02"}, {"excerpts": ["Good injera and being open for lunch earns them bonus points. ", "A few new-restaurant kinks "], "author": "Dana S.", "review": "Ethiopian restaurants are popular for their veggie fare and in this regard Moya did not disappoint. Their menu boasts plenty of veggie options, the staples of any good Ethiopian place -- a veggie combo and shuro, and even a tofu dish! I ordered the veggie combo (vegan) with my date, and we both left full. I look forward to coming back again and trying the shuro and appetizers!\n\nService was super friendly, food tasty (misir wot was my favorite) and  prices very reasonable! Good injera and being open for lunch earns them bonus points. A few new-restaurant kinks but I have no doubt they will be worked out. \n\nHaving an Ethiopian place downtown is going to be very satisfying for my taste buds but very dangerous for my pocketbook. :)", "rating": 5, "date": "2010-07-17"}, {"excerpts": ["The injera was awesome...like a perfect pancake, used to grab all of the goodness on the plate.\n", "All in all...I would give the food 3 and a half stars, but the service bumps it up to 4.\n", "Oh yeah...", "the waitress DID ask if it was ok to dump the meat dish on the big plate of vegetables. ", "If I was a vegetarian, I would've REALLY appreciated it! ", "But i'm not... ", "so DUMP AWAY!"], "author": "Siao W.", "review": "I'm not an expert in Ethiopian cuisine, but this place is pretty good. The place is clean and well decorated. Everyone is greeted with a smile. The server was attentive. \nThe best thing was the split yellow peas (Kik Alitcha). It was soft, mushy, and had the right amount of tumeric. \nThe bere tibs were good, but just a bit dry and bland. I wonder if it was my fault, since I told the waitress that I didn't want to be hit over the head with spice. (I'm glad she asked though!)\nThe injera was awesome...like a perfect pancake, used to grab all of the goodness on the plate.\nAll in all...I would give the food 3 and a half stars, but the service bumps it up to 4.\nOh yeah...the waitress DID ask if it was ok to dump the meat dish on the big plate of vegetables. If I was a vegetarian, I would've REALLY appreciated it! But i'm not... so DUMP AWAY!", "rating": 4, "date": "2010-08-05"}, {"excerpts": ["Both were served with ample amounts of fresh injera (flat bread).  ", "The servings are generous, I'm sure that we could have shared them with two more people. "], "author": "Sam H.", "review": "Good Ethiopian food is hard to find in San Francisco. With that said, I welcome this new addition to my neighborhood!\n\nFirst off, the staff was very friendly and attentive. The restaurant was very clean and inviting, nothing fancy, but you can tell that the owners put some good thought into their investment.\n\nI ordered #21, yere bere tibs and Eric ordered the #15, vegetarian combo per the suggestion of our server. The vegetarian combination plate was tasty, aromatic and very fresh - enough for two people. The yere bere tibs (beef) was tender, juicy, and flavourful. Both were served with ample amounts of fresh injera (flat bread).  The servings are generous, I'm sure that we could have shared them with two more people. We left the restaurant very satisfied and stuffed to the gills.\n\nOverall, I enjoyed everything on my first visit and I will definitely come back with reinforcements!\n\nWelcome to the neighborhood Moya!!", "rating": 5, "date": "2010-08-26"}, {"excerpts": ["It will get much love from the gluten-free folks for having gluten-free injera and it will get love from the hardcore carnivores for having three different kinds of kitfo, a sirloin beef dish usually served rare. \n\n"], "author": "DeathandFood H.", "review": "For some odd reason while it seems as if you can find really good Ethiopian food on every corner of Oakland and Berkeley, there has always been a shortage of really good places in San Francisco. That shortage continues even with this new addition.\n\nMoya is a decent but not great Ethiopian food. It will get much love from the gluten-free folks for having gluten-free injera and it will get love from the hardcore carnivores for having three different kinds of kitfo, a sirloin beef dish usually served rare. \n\nThe portion are decent but the prices are 5 dollars more than at most Ethiopian places in the bay area for the same quality of food. \n\nI'll may go back but for really good Ethiopian, I'll still head to a couple of places in the East Bay.", "rating": 3, "date": "2010-08-13"}, {"excerpts": ["The mixed vegetable combo is a good deal, and they give you a decent amount of injera. ", "I LOVE Ethiopian food and have eaten my fair share in East Africa "], "author": "Melissa T.", "review": "Moya has awesome Shiro (shuro), although it's a bit expensive. The menu says $12 but it was actually $15. It's so good though so definitely worth it. The mixed vegetable combo is a good deal, and they give you a decent amount of injera. I LOVE Ethiopian food and have eaten my fair share in East Africa so I'm a bit of a snob about it, but this place is definitely worth checking out.\n\nThey're cash only so come prepared for that.", "rating": 4, "date": "2010-11-23"}, {"excerpts": ["Well spiced with excellent injera and generous portions. ", "My new favorite ethiopian spot. ", "They do a good job packing up takeout. "], "author": "Andy G.", "review": "Well spiced with excellent injera and generous portions. My new favorite ethiopian spot. They do a good job packing up takeout. The kitfo, tibs, and veggies were all fantastic.", "rating": 5, "date": "2012-12-31"}, {"excerpts": ["Also the injera was thinner and doughier than I'm used to, but again, it was still delicious. ", "I will definitely come back here again when I'm in the area!"], "author": "Stephanie L.", "review": "A group of us came by here for dinner and were really pleased with our experience. The service was really fast compared to other Ethiopian restaurants we've eaten at in the Bay Area, and it was nice to be able to specify how spicy we wanted our food. We really enjoyed the mushroom tibs and the shuro. The misir wot was more al dente than others we've tried, but the flavor was still spot on. Also the injera was thinner and doughier than I'm used to, but again, it was still delicious. I will definitely come back here again when I'm in the area!", "rating": 5, "date": "2015-01-17"}, {"excerpts": ["There was plenty of injera and we finished it off with a baklava-style desert ", "I didnt catch the name of. "], "author": "Sonia S.", "review": "I live around the corner from this place and have been wanting to try it for so long as its spicy aromas waft throughout the neighborhood. I finally got to last night and was not let down at all.\n\nMy friend and I split the veggie sampler. The red lentil stew was my favorite. The house salad had a delightfully tangy dressing. There was plenty of injera and we finished it off with a baklava-style desert I didnt catch the name of. We were both sufficiently stuffed.\n\nThe service was fast the the cashier/waitress was friendly. I learned they do take-out so I will definitely be taking advantage of that!", "rating": 5, "date": "2013-03-29"}, {"excerpts": ["They brought out more Injera. ", "The spices used reminded me of Indian food, but simpler... really enjoyed it . ", "I work in the neighborhood and would love for this restaurant to be a success."], "author": "nisha c.", "review": "I had never tried Ethiopian Food. Our server was pleasant, friendly and very helpful. \n\nWe ordered the Chicken and Mixed Vegetables. It was more then enough for the 2 of us. They brought out more Injera. The spices used reminded me of Indian food, but simpler... really enjoyed it . I work in the neighborhood and would love for this restaurant to be a success.", "rating": 4, "date": "2010-08-18"}, {"excerpts": ["The staff was very friendly and would constantly bring us more injera as we devoured the ones in front of us.  ", "The only negative surprise was that they didnt serve beer or wine, but that's something that I should have looked up before we went.  ", "Overall we had a great experience and will definitely be coming back."], "author": "Yuri Y.", "review": "My girlfriend and I recently moved into the neighborhood and decided to check this place out last night with another friend.  We ordered an Azifa for an appetizer and Kitfo, Ye Doro Tibs, and Ye Beg Wot.  All three of the main dishes were great.  The chicken (Ye Doro Tibs) was probably my favorite of the three, which is saying a lot because I'm normally not big on chicken dishes.  Everything had a great amount of spice and was wholly filling.  For $20 a person we were beyond stuffed when we left the restaurant.  \n\nThe staff was very friendly and would constantly bring us more injera as we devoured the ones in front of us.  The only negative surprise was that they didnt serve beer or wine, but that's something that I should have looked up before we went.  Overall we had a great experience and will definitely be coming back.", "rating": 4, "date": "2010-08-19"}, {"excerpts": ["It was so good and the injera was delicious.  \n\n"], "author": "Olivia T.", "review": "Great Ethiopian restaurant owned/operated by a nice woman and her daughters.  It's so nice to support small local businesses, but Moya makes it easy with their awesome food.  I had the MIsir Wot, which they kindly put on a separate plate so that my veggie dish wouldn't be \"contaminated\" with everyone else's meat.  Thankfully I shared because everyone else loved my dish.  It was so good and the injera was delicious.  \n\nWish I could stop by for their lunch special, but it's too far away.  Sad :(  But honestly their normal prices aren't expensive and it's totally worth the price.  They also seem to have an $8 corkage fee?  So that's super cheap too.", "rating": 4, "date": "2011-04-29"}, {"excerpts": ["It was super expensive, the food was bland, even the injera bread was bland. ", "I can't believe so many people enjoy this place, they must not have had authentic Ethiopian food before. ", "I will not be returning to this restaurant."], "author": "Felecia M.", "review": "As someone who came from Washington, DC where the Ethiopian restaurants and population are plentiful, this place was a disappointment. It was super expensive, the food was bland, even the injera bread was bland. I can't believe so many people enjoy this place, they must not have had authentic Ethiopian food before. I will not be returning to this restaurant.", "rating": 1, "date": "2013-01-06"}, {"excerpts": ["For her presentation, she actually brought in some injera for us to try ", "but it was too sour for my liking. ", "However, she did say that it tastes a lot better dipped in sauces. ", "Well, she was right! ", "My friend and I got the vegetarian platter and also the chicken drumsticks. ", "The injera tasted so much better eaten with the vegetables and chicken. ", "Out of the vegetables, my favorite would have to be the yellow pea stew. ", "The chicken was really tender and basically fell off the bone. ", "The chicken came with more sauce to dip the injera in whereas the vegetables were dryer. ", "Overall, a great first experience and ", "I can't wait to try more of their other dishes!"], "author": "Monica W.", "review": "For a school project, we each had to present on a culture including holidays, customs, foods, etc. One of my classmates did a presentation on the culture of Ethiopia and ever since, I've been wanting to try ethiopian food. Fast forward 1 year, I finally got around to it! For her presentation, she actually brought in some injera for us to try but it was too sour for my liking. However, she did say that it tastes a lot better dipped in sauces. Well, she was right! My friend and I got the vegetarian platter and also the chicken drumsticks. The injera tasted so much better eaten with the vegetables and chicken. Out of the vegetables, my favorite would have to be the yellow pea stew. The chicken was really tender and basically fell off the bone. The chicken came with more sauce to dip the injera in whereas the vegetables were dryer. Overall, a great first experience and I can't wait to try more of their other dishes!", "rating": 4, "date": "2013-11-12"}, {"excerpts": ["The two dishes were more than enough for 2 people, and I even had left over veggies and injera to bring home.  ", "About $30 before tax and tip.  ", "Not too bad.  ", "I wish there was an 1/2 order sized veggie platter for one person."], "author": "Skye W.", "review": "Moya is so delicious. Got the veggie platter and the rare beef dish that is their signature.  I didn't eat any of the beef, but my BF said it was delicious.  Service was better than last time and no more floaties in the water.  The two dishes were more than enough for 2 people, and I even had left over veggies and injera to bring home.  About $30 before tax and tip.  Not too bad.  I wish there was an 1/2 order sized veggie platter for one person.", "rating": 4, "date": "2011-01-13"}, {"excerpts": ["This is the only Ethiopian place in the city that consistently has gluten-free injera! ", "The red lentils or marinated beef are our favorites, but you pretty much can't go wrong. ", "Minus a star for being pricey - can run two people $50."], "author": "Raina M.", "review": "This is the only Ethiopian place in the city that consistently has gluten-free injera! The red lentils or marinated beef are our favorites, but you pretty much can't go wrong. Minus a star for being pricey - can run two people $50.", "rating": 4, "date": "2013-10-08"}, {"excerpts": ["The injera was perfectly made. ", "Sadly, they don't have a liquor license yet, so they didn't have honey wine. ", "The food was really good, though!"], "author": "Joy C.", "review": "Totally nontraditional Ethiopian place. Felt like a hipster cafe, with a touch of tribal decor. Very attentive staff, and the food came out quite fast. We ordered a bunch of meats and veggies, and also had the raw beef dish. All was really fresh tasting, especially the lamb. It was the first time I've had the raw beef, and that was addictive! The injera was perfectly made. Sadly, they don't have a liquor license yet, so they didn't have honey wine. The food was really good, though!", "rating": 4, "date": "2010-11-18"}, {"excerpts": ["The injera was great.  ", "The staff was friendly.  ", "They seem to be getting steady business for dinner.  ", "I think it is a perfect spot for lunch.  ", "This is sure to become a neighborhood favorite for us."], "author": "Jessica M.", "review": "Great Ethiopian place.  We had lunch and did a shared plate.  The vegetarian split red lentil MISIR WOT was amazing.  The lamb (which I did not eat) was enjoyed and flavorful.  The injera was great.  The staff was friendly.  They seem to be getting steady business for dinner.  I think it is a perfect spot for lunch.  This is sure to become a neighborhood favorite for us.", "rating": 4, "date": "2011-01-12"}, {"excerpts": ["it's pretty cool that you can get all-teff injera too!"], "author": "kate s.", "review": "i love ethiopian.  it is my favorite type of cuisine.  and moya serves some of the best ethiopian food i've tried in this country.\n\nof course i had the vegetarian combo, and also the tofu tibs (you can get a side order portion of any of the vegetarian dishes) and they were both excellent.  the veggie combo had all the usual suspects but they were fresh and perfectly spiced.  tofu tibs is a novelty and one that i can't imagine not ordering on every visit.\n\nbut the absolute star of the restaurant is the shuro:  finely ground chickpeas spiced with 12 different spices and cooked in a covered clay pot.  i know this because our server was the chef's daughter and explained it to us.  and when we were halfway through frantically shoveling it down our throats, her mother, the owner/chef, came out and personally made sure we were in love with it.  we told her we were.\n\nthe place is small but cute and clean and the service was delightful!  i've never said delightful before but i can't think of anything else that describes the experience better.  it's pretty cool that you can get all-teff injera too!", "rating": 5, "date": "2010-08-26"}, {"excerpts": ["The injera (which they charge extra for if you want it served like a normal Ethiopian meal) was stale. ", "Great that it's made out of 100% teff, shame it isn't any good. ", "The lentil salad was just awful. "], "author": "YUP K.", "review": "Pretty bad. \n\nSmall portions - not a problem though because the food is so heavy and bland you won't want to eat much. Probably the worst Ethiopian I've had. Generally I end up eating too much when I go out for Ethiopian, but at this place nobody really touched the slimy and lukewarm gommen (collared greens), the kik alicha (yellow lentil stew) was dry and mealy, probably from sitting on the stove since the previous day, (we were there on the early side). The ata kilt (cabbage, potato, carrot dish) had poorly washed and sandy vegetables in it, used baby carrots, and did not taste fresh. Messer wot (red lentils) was incredibly bland, with undercooked lentils, and had no discernible spice to it. Also, maybe I'm mistaken, but it seemed like they didn't use any nitir kibe (spiced clarified butter) in the veggie dishes. The injera (which they charge extra for if you want it served like a normal Ethiopian meal) was stale. Great that it's made out of 100% teff, shame it isn't any good. The lentil salad was just awful. Undercooked dry lentils, hardly any flavor, served on stale sliced bread.\n\nService is barely existent, you order at the counter, get your own water and napkins. I don't mind this approach, but when a veggie combo that was clearly cooked way earlier in the day and slopped out onto a plate is $17, the place is in a shitty neighborhood, and the decor looks like your average nobody-cares-independent-coffeeshop, it's outrageous.\n\nOh, and no honey wine or Ethiopian beers, although I would assume they're working on that.\n\nIf you rated this place well you really should check out Enssaro, Cafe Eritrea de Afrique, or any of the other well reviewed Ethiopian/Eritrean spots in Oakland. Unless this was the off-est of off-nights, you won't want to eat at Moya anymore.", "rating": 2, "date": "2012-04-24"}, {"excerpts": ["The injera was kind of cold "], "author": "Rachael S.", "review": "Pretty good food, cheap, reasonably close to the Fidi, and open for lunch!  It's surprisingly hard to find Ethiopian food near the Fidi, and even harder to find places that aren't dinner-only.  They offer a lunch special for about $9 (can't remember the exact price, maybe $8.45, but don't quote me on that) where you pick 3 of the 4 items in the vegetarian combo.  It's not on the menu, but just ask them about the special.  3 of us shared that and the first of the two lamb dishes on the menu, (although I didn't have any of that since I'm a vegetarian, but they said it was good) and we were full and still had a tiny bit left over.  Everything tasted great!\n\nThe negatives:  almost every place has it's down-side, and here it is.  The injera was kind of cold (I saw the chef making it, so I know it's home-made, but she was making it in very large quantities, and they just grabbed our pieces off of a huge stack), and they don't have honey wine.\n\nOtherwise, great in every other way!", "rating": 4, "date": "2010-08-10"}, {"excerpts": ["The dishes were all tasty and the injera, served in 1/3  rollups, kept coming. ", "We ate all the food. ", "First time we weren't served enough to satiate our collective appetites! ", "Friendly but inept service, portions not generous at the prices. ", "Would not eat here again."], "author": "weedy t.", "review": "we got parking RIGHT IN FRONT! Wow already! Went in, only one table occupies, so we had our choice. Got menus and water quickly, pleasant server. Ordered coffees all around and our meals fairly quickly. Waited until 2 reminders to get coffee, another 5 minutes for cream (which turned the watery brew to NOT MUCH). The food served family style, so we requested separate plates to divide since all were not beef-eaters. The dishes were all tasty and the injera, served in 1/3  rollups, kept coming. We ate all the food. First time we weren't served enough to satiate our collective appetites! Friendly but inept service, portions not generous at the prices. Would not eat here again.", "rating": 3, "date": "2010-07-27"}, {"excerpts": ["Yesterday I got the teff-only injera and wasn't a big fan, ended up using most of my normal injera that was under my food.  ", "Today she offered my friend a taste of the teff-only which I thought was nice.  ", "But then she offered me a piece too saying that it turned out better than the one I had had yesterday.  ", "I think she's right", ", it was fluffier, but I didn't really like knowing that I had paid for less than excellent quality yesterday.  ", "I'd say I prefer the normal injera better because it's thinner and less tangy ", "so you get to fully enjoy the flavors of the actual dishes you ordered.  "], "author": "Q E.", "review": "I went there yesterday for lunch for the first time.  Today I went back for lunch again.  I never do that(!!!)...\n\n...but I desperately wanted to try more of the vegetarian options.  Yesterday I had the vegetable combo which allows you to try three dishes at once and my friend got the tofu tibs which I got to taste, so today I got the inguday tibs.  I definitely like the taste of the two tibs dishes best.  Today I decided not to order the lunch portion, but rather the full portion, and I ate it all!\n\nYesterday I got the teff-only injera and wasn't a big fan, ended up using most of my normal injera that was under my food.  Today she offered my friend a taste of the teff-only which I thought was nice.  But then she offered me a piece too saying that it turned out better than the one I had had yesterday.  I think she's right, it was fluffier, but I didn't really like knowing that I had paid for less than excellent quality yesterday.  I'd say I prefer the normal injera better because it's thinner and less tangy so you get to fully enjoy the flavors of the actual dishes you ordered.  You also end up filling up less on \"carbs.\"  \n\nBut I like this place, the staff are very friendly, and I like that there are no lines during peak lunch hour.  Definitely give it a try!  I'm going back again soon to try the shuro - would've today but for the 30min notice required.  =)", "rating": 4, "date": "2010-08-27"}, {"excerpts": ["I was near tears when I found out about the 100%-teff injera. \n\n", "I even like the salad with the injera, but I can understand why some diners would prefer a fork for that part of the meal. \n\n"], "author": "Alicia D.", "review": "I signed up for a yelp account just so I could add my 5 stars in support of Moya. Like many who have discovered this treasure, I have gluten-intolerance which makes eating out more difficult than it used to be. I was near tears when I found out about the 100%-teff injera. \n\nI have enjoyed each dish I've tried here. I even like the salad with the injera, but I can understand why some diners would prefer a fork for that part of the meal. \n\nTonight I'm taking two friends there for the first time in celebration of their recent wedding. Everyone I have turned on to Moya has loved it. Yes, I agree, the atmosphere is not the main attraction. However, I find that the fun of eating with our hands from a colorful shared platter more than compensates for a lack of decor. \n\nI always end an evening of dining at Moya full and content and feeling good about how healthy and clean the food is. I hope to inspire others to support this restaurant.", "rating": 5, "date": "2010-10-02"}, {"excerpts": ["The injera is great! "], "author": "Ronnie M.", "review": "I love this place. Great food, quick service nice SOMA vibe. The injera is great! We usually get the veggie sampler and the chicken stir fry dish. Very feeling and makes for great left overs. This is a clean, family owned business. I LOVE Moya.", "rating": 5, "date": "2012-09-29"}, {"excerpts": ["We ordered the regular ol' injera, but the ladies brought us complimentary teff injera just so we could sample it. "], "author": "Madhu G.", "review": "Just had a fantastic dinner at Moya - the food is delicious, the prices are great, and the women that run it are extremely sweet. \n\nWe ordered the veggie combo, the chicken tibs, and the lamb wot. All of the food was incredibly tasty! We ordered the regular ol' injera, but the ladies brought us complimentary teff injera just so we could sample it. It was yummy!\n\nI'm thrilled to see this new addition to my neighborhood!", "rating": 5, "date": "2010-09-03"}, {"excerpts": ["Awesome vegan combination with all teff injera.  ", "More spice and flavor than many other Ethiopian restaurants.  ", "Great prices. ", "Friendly staff."], "author": "Jill B.", "review": "Awesome vegan combination with all teff injera.  More spice and flavor than many other Ethiopian restaurants.  Great prices. Friendly staff.", "rating": 5, "date": "2010-09-03"}, {"excerpts": ["We had the Lentils and one of the chicken entrees, along with a generous helping of the injera bread.  "], "author": "Sig L.", "review": "This is our neighborhood, and we're so glad to see businesses like this one and others opening down here.  We locals are starving for fun, eclectic and high-quality food establishments that don't require a drive or a muni-ride, and Moya delivers!\n\nWe ate there for the first time this evening, and the food was excellent.  We had the Lentils and one of the chicken entrees, along with a generous helping of the injera bread.  Great new and interesting ethnic flavors.\n\nThe only thing holding back a five-star rating is the ambiance/decor.  As an Ethiopian restaurant, I would expect a lot more African-inspired vibrant color and music.  Right now, it's a newly renovated, perfectly clean, pleasant but somewhat \"beige\" environment.  I don't want to judge too harshly - they're new and probably want to get into a groove before they start livening up the place.\n\nThe staff is very friendly (we met the owner's daughter), and we're happy to have this establishment in our community.  Please come check them out, enjoy a great meal with friendly service, and support this new business.", "rating": 4, "date": "2010-07-15"}, {"excerpts": ["the spicy version, and they make the best injera (bread) I've had in SF - including a gluten-free version, also delicious."], "author": "Steve S.", "review": "For a good, inexpensive Ethiopian meal, this is the place. I keep going back and the owners and servers are uniformly warm and friendly - and I love the food.  The Kitfo is not to be missed, esp. the spicy version, and they make the best injera (bread) I've had in SF - including a gluten-free version, also delicious.", "rating": 5, "date": "2011-04-08"}, {"excerpts": ["We ordered Kitfo (raw), Doro wat, Gomen, Shuro and, of course, Injera... the wonderful pancake like bread.  ", "The service is properly attentive and friendly.  ", "The place is clean, the kitchen staff are all Ethiopian, the food is spectacular... ", "what more could you ask.  ", "Go and see...."], "author": "EDWARD S.", "review": "This is, by far, the most authentic Ethiopian Restaurant in San Francisco.  I spent a bit over a year studying in Addis Abba and ate Ethiopian every day.  Eating at MOYA was like going back to the kitchen of the family in Addis Abba who served as my sponsors.  They don't have a Liquor License, so I missed the traditional Tej, but the food... was spectacular.  We ordered Kitfo (raw), Doro wat, Gomen, Shuro and, of course, Injera... the wonderful pancake like bread.  The service is properly attentive and friendly.  The place is clean, the kitchen staff are all Ethiopian, the food is spectacular... what more could you ask.  Go and see....", "rating": 5, "date": "2010-09-23"}, {"excerpts": ["Injera is made fresh in front of your eyes you get the seat at the right angle. ", "No alcohol and cash only at this point, but there's a scoutmob deal for 50% off up to $12 which makes good eating for 2 at a great price."], "author": "mc b.", "review": "Definitely get Spicy if ordering meat dishes. Injera is made fresh in front of your eyes you get the seat at the right angle. No alcohol and cash only at this point, but there's a scoutmob deal for 50% off up to $12 which makes good eating for 2 at a great price.", "rating": 4, "date": "2011-04-21"}, {"excerpts": ["The injera was tangy and fresh. ", "In fact, \"fresh\" is the word I kept thinking while I was eating the tasty, perfectly spiced chicken dish and greens. ", "Service was attentive without being overbearing. ", "The chef-owner came out and chatted briefly with us, and told us her menu reflects Ethiopian home cooking. ", "We can't wait to go back."], "author": "April K.", "review": "So happy we had lunch at Moya today! The injera was tangy and fresh. In fact, \"fresh\" is the word I kept thinking while I was eating the tasty, perfectly spiced chicken dish and greens. Service was attentive without being overbearing. The chef-owner came out and chatted briefly with us, and told us her menu reflects Ethiopian home cooking. We can't wait to go back.", "rating": 5, "date": "2010-08-21"}, {"excerpts": ["The injera was good, and the service was prompt and friendly, so 1 star for each of those... ", "I'd order take out injera from here but the food was disappointing enough that I wouldn't give the rest another chance."], "author": "Leann C.", "review": "I love Ethiopian food and was really looking forward to Moya after all the great reviews.  We ordered Doro Tibs and Ye Bere Tibs to go.  The Ye Bere Tibs were tough, and both dishes lacked flavor, seasoning, and depth.  The injera was good, and the service was prompt and friendly, so 1 star for each of those... I'd order take out injera from here but the food was disappointing enough that I wouldn't give the rest another chance.", "rating": 2, "date": "2010-08-01"}], "gluten free injera": [{"excerpts": ["Got the gluten free injera which is a deal-breaker for me. "], "author": "Shanna L.", "review": "Tiny place with nice staff and excellent food! Got the gluten free injera which is a deal-breaker for me. More expensive than some Ethiopian restaurants but the veggie sampler was plenty of food for two of us, so it came out less than $17 total. Right around the corner from ACT which is why we tried it. I'd definitely go back!", "rating": 5, "date": "2017-10-04"}, {"excerpts": ["They have a decent veggie platter and offer gluten free injera, when it is available. \n\n", "Since they only offer gluten free injera when it is available, this means you need to call ahead if you have to have GF.", "Since they only offer gluten free injera when it is available, this means you need to call ahead if you have to have GF."], "author": "Shannon Z.", "review": "The some of best Ethiopian in San Francisco, however that doesn't mean much since San Francisco lacks Ethiopian restaurants. They have a decent veggie platter and offer gluten free injera, when it is available. \n\nThe delivery through Eat24 is inconsistent (sometimes my salad is wilted and uneatable) and it is definitely not as good as ordering from there. I wish they offered Azifa (cold Ethiopian green lentil salad).\n\nGluten free notes: No issues for me here in terms cross contamination or errors. Since they only offer gluten free injera when it is available, this means you need to call ahead if you have to have GF.", "rating": 3, "date": "2015-12-18"}, {"excerpts": ["Super fresh, delicious vegetarian combo & great injera-also they offer gluten free injera & brown rice options."], "author": "Rude A.", "review": "I really like this place for lunch. Super fresh, delicious vegetarian combo & great injera-also they offer gluten free injera & brown rice options.", "rating": 5, "date": "2016-01-14"}, {"excerpts": ["Gluten free injera, veggie sampler (of course) spiced so deliciously. ", "And super friendly staff.\n", "The restaurant itself is a bit cold feeling with the warehousy vibe, but the food is too good to care."], "author": "Krista H.", "review": "I don't give out 5 stars unless i mean it and I do. Gluten free injera, veggie sampler (of course) spiced so deliciously. And super friendly staff.\nThe restaurant itself is a bit cold feeling with the warehousy vibe, but the food is too good to care.", "rating": 5, "date": "2014-03-07"}, {"excerpts": ["gluten free injera available. ", "dead animal options also available."], "author": "Lentil C.", "review": "Best vegan Ethiopian dishes in North America (out of the 20+ places I've eaten - including DC!) amazing flavours and variety. the first time I've seen tofu or mushroom tibs on a menu and I'll be craving both until I return to SF. super friendly and accommodating staff. when I ate there they had just returned from Eithiopia with spices - which they blend themselves - for truly original flavours. both of the above tibs were cooked to order and I was given the choice of spice level. gluten free injera available. dead animal options also available.", "rating": 5, "date": "2015-01-31"}]}