{"hawaiian salad": [{"excerpts": ["I tried the slice of cheese pizza and hawaiian salad. ", "The cheese pizza was alright but nothing to write home about. ", "The slice is rather big though so that's good. ", "The hawaiian salad was very gross however and I had to throw it out. ", "The lettuce seemed old and overall it tasted nasty. ", "I guess that's what you get for a 4.40 salad."], "author": "John B.", "review": "I tried the slice of cheese pizza and hawaiian salad. The cheese pizza was alright but nothing to write home about. The slice is rather big though so that's good. The hawaiian salad was very gross however and I had to throw it out. The lettuce seemed old and overall it tasted nasty. I guess that's what you get for a 4.40 salad.", "rating": 2, "date": "2017-09-18"}, {"excerpts": ["I ordered a small pepperoni and pineapple pizza and a Hawaiian salad.  ", "Portions are huge!  ", "The salad alone could have been a meal, and I'll be eating that pizza for days to come.  ", "The food itself was just ok.  ", "I personally did not like the crust at all.  ", "It was really chewy in the center and kind of burned along the edges.  ", "The toppings were alright, the pepperoni was somewhat burned as well.  ", "It still tasted pretty good, but I've had much better.  ", "They were attentive to my special request or extra pineapple and several ranches on the side, however.  ", "So overall, quick and inexpensive food that is pretty good, but nothing special, but comes in generous portions.  ", "This place would be great if it was 2 am ", "and I was stumbling around looking for a quick bite to soak the Tequila up in my stomach!  ", "ha...."], "author": "Bryan P.", "review": "I chose to eat here because it was close and it delivered.  I ordered my food through delivery.com and it arrived in around 30 minutes.  Woohoo.  As for the food, it was pretty tasty for the most part.  I ordered a small pepperoni and pineapple pizza and a Hawaiian salad.  Portions are huge!  The salad alone could have been a meal, and I'll be eating that pizza for days to come.  The food itself was just ok.  I personally did not like the crust at all.  It was really chewy in the center and kind of burned along the edges.  The toppings were alright, the pepperoni was somewhat burned as well.  It still tasted pretty good, but I've had much better.  They were attentive to my special request or extra pineapple and several ranches on the side, however.  So overall, quick and inexpensive food that is pretty good, but nothing special, but comes in generous portions.  This place would be great if it was 2 am and I was stumbling around looking for a quick bite to soak the Tequila up in my stomach!  ha....", "rating": 3, "date": "2008-06-25"}], "spaghetti meat sauce": [], "spaghetti clams": [], "ravioli meatballs": [], "rigatoni meatballs": [], " spaghetti and  ravioli meatballs": [], "spaghetti meatballs": [], "rigatoni meat sauce": [], " spaghetti and  ravioli meat sauce": [], "baked lasagna": [], "ham and cheese sandwich": [], "canadian bacon sandwich": [], "hamburger with french fries": [], "salami and cheese sandwich": [], "cheeseburger with french fries": [], "napoli special": [], "tijuana": [{"excerpts": ["The Tijuana would be next ", "and then the San Francisco. ", "I used to go here about three times a week when I worked up the block. ", "Not once was I unhappy with what I had. ", "The slices are perfectly sized. ", "One slice if you  still wanna ", "get shit done and two when you want to feel like your pants are gonna bust. ", "And the best part is that this pizza is the cheapest in the area. ", "Bout half the price of village ", "and you don't have to deal with the owners evil bitch wife. ", "And the guys at Napoli are super chill. ", "Perfect fit for Polk street."], "author": "Jacob N.", "review": "Get me to the Greek!!! I love this place. The Greek is the shit. The Tijuana would be next and then the San Francisco. I used to go here about three times a week when I worked up the block. Not once was I unhappy with what I had. The slices are perfectly sized. One slice if you  still wanna get shit done and two when you want to feel like your pants are gonna bust. And the best part is that this pizza is the cheapest in the area. Bout half the price of village and you don't have to deal with the owners evil bitch wife. And the guys at Napoli are super chill. Perfect fit for Polk street.", "rating": 5, "date": "2018-07-06"}, {"excerpts": ["The Tijuana slice has done me very well on multiple occasions.  ", "This last time though, while staying at Club Quarters and ordering a pizza to the room, I was not impressed.  ", "Won't order a greek salad again when getting delivery pizza; probably my fault for expecting much.  ", "The pizza we ordered was lacking in the cheese department and could have used more pepperoni.  ", "Props to being open so late and actually delivering."], "author": "Cole M.", "review": "I have eaten at this place numerous times being drunk in the Tenderloin and have enjoyed that is open late.  The Tijuana slice has done me very well on multiple occasions.  This last time though, while staying at Club Quarters and ordering a pizza to the room, I was not impressed.  Won't order a greek salad again when getting delivery pizza; probably my fault for expecting much.  The pizza we ordered was lacking in the cheese department and could have used more pepperoni.  Props to being open so late and actually delivering.", "rating": 3, "date": "2012-04-11"}, {"excerpts": ["I like the Tijuana - sausage, bell pepps, onion, tomato, jalapeno.  ", "Damn good if you like it spicy.  ", "don't be afraid, they are only pickled jalapenos - spicy for white people."], "author": "J P.", "review": "Solid pizza and even better delivery service.  They have an average delivery time of about 25 minutes from call to delivered and I'm appr. 1.9 miles.  Hey!  That's about a 1/3 the width of SF.  Now, with pizza it seems everyone takes a firm stance on thick vs. thin crust.  Me, I like thin.  Napoli however serves up some tasty pie that's a pretty good balance between the two.  Not thin but not thick - kinda like Scarlett Johansson.  I like the Tijuana - sausage, bell pepps, onion, tomato, jalapeno.  Damn good if you like it spicy.  don't be afraid, they are only pickled jalapenos - spicy for white people.", "rating": 3, "date": "2006-05-28"}], "chicken special": [], "greek special": [], "pesto special": [{"excerpts": ["the  14' Pesto Special with sausage n pepperoni..(love the garlic)\n ", "FRESH n Hot..  ", "The crust ", "Crisp yet soft.. ", "I wish they would have put more veggies on ...", "that's why I rated it a 3 1/2 ..", "GOOD PIZZA"], "author": "Leah W.", "review": "DELICIOUS...  CHEESY I got the  14' Pesto Special with sausage n pepperoni..(love the garlic)\n FRESH n Hot..  The crust Crisp yet soft.. I wish they would have put more veggies on ...that's why I rated it a 3 1/2 ..GOOD PIZZA", "rating": 3, "date": "2015-08-27"}], "napoli calzone": [], "meat calzone": [{"excerpts": ["Medium Meat Calzone ", "- This is the main reason I order from Napoli. ", "I really enjoy their meat calzone. ", "The crust is very bready and, for me, it has just the right mix of ingredients (cheese, Italian sausage,pepperoni,salami and Canadian bacon. ). ", "Some may think there is too much cheese. ", "But for me, there is no such thing. ", "The only thing I can complain about is that the smallest is a medium and their medium is actually very large. "], "author": "Mark D.", "review": "This is a review of delivery from Napoli Pizza. I've had food delivered from them a number of times.\n\nMedium Meat Calzone - This is the main reason I order from Napoli. I really enjoy their meat calzone. The crust is very bready and, for me, it has just the right mix of ingredients (cheese, Italian sausage,pepperoni,salami and Canadian bacon. ). Some may think there is too much cheese. But for me, there is no such thing. The only thing I can complain about is that the smallest is a medium and their medium is actually very large. I can never eat more half and it doesn't hold up well for leftovers.\n\nhttp://tinyurl.com/3ubf9a8\n\nhttp://tinyurl.com/3mnmqac\n\nCheeseburger and fries - This is a very basic burger. It is almost assuredly from a frozen patty. I would not order from them for just a burger. There are plenty of other places with much much better burgers. But if you are hungry for a great calzone and a burger. I've had worse.\n\nChicken wings - Their wings are very average. They are dry. They are not made in a traditional way where they are flipped in a sauce. The spice is a little bland. They could use more kick.\n\nhttp://tinyurl.com/3n8jlko\n\nGarlic bread - This is actually not very good. It is basically just a soggy roll with some basic ingredients. It doesn't seem that any though went into it.\n\nDelivery is always polite, professional, and prompt.", "rating": 4, "date": "2011-01-24"}], "vegetarian calzone": [], "pesto calzone": [], "half and half cheese pizza": [], "topping pizza": [{"excerpts": ["We went for the 2 large 2 topping pizza for 28 (tax + delivery included) but we just wanted a pepperoni w/extra cheese and a mushroom (double the mushrooms). ", "Pepperoni was fine but there were barely any mushrooms on the one I wanted to devour. ", "The only other complaint was that their crust is a bit weak. ", "Too fluffy and not much flavor. ", "It's cool ", "we aren't big fan of crust in general ", "so no big loss but just a lot of waste... ", "they should spread the sauce and cheese up higher to the edges I think. ", "I loved my first three bites ", "then it (crust) got to be too much especially when ", "or if you fold it halfway which I do in hopes to keep the mess factor down. "], "author": "Shiho F.", "review": "Not bad and they deliver late night which is ideal. We were given a menu with deals in it at the front desk at the Hyatt on Embarcadero so we gave them a whirl after being asked nicely to leave Lush Lounge on Polk... no we were on our best behavior surprisingly (me, the hot gay and 6 fun and very wild ladies from Ohio) it was just closing time.\n\nAnywho, the pizza was pretty solid and kind of hit the spot, ranch and crushed red peppers would have been nice. We went for the 2 large 2 topping pizza for 28 (tax + delivery included) but we just wanted a pepperoni w/extra cheese and a mushroom (double the mushrooms). Pepperoni was fine but there were barely any mushrooms on the one I wanted to devour. The only other complaint was that their crust is a bit weak. Too fluffy and not much flavor. It's cool we aren't big fan of crust in general so no big loss but just a lot of waste... they should spread the sauce and cheese up higher to the edges I think. I loved my first three bites then it (crust) got to be too much especially when or if you fold it halfway which I do in hopes to keep the mess factor down. Pizza sauce was lovely and the topping themselves pretty good. \n\nOverall grateful for their late night delivery service and thanks, no hangover this morning!", "rating": 3, "date": "2011-04-13"}], "toppings pizza": [], "garlic bread with melted cheese": []}