{"omakase": [{"excerpts": ["We came here for my husband's birthday dinner, excited to try the happy hour and the omakase. ", "Happy hour wasn't spectacular. ", "$1 off sake, $1.50 per oyster. ", "$5 hand roll. ", "My husband had the omakase but was not Impressed. ", "It was just standard. ", "He said the rice was hard on the edges of each nigiri piece. ", "The fish did NOT melt in his mouth like other omakase we have tried. ", "Was it because we went there on a Monday? ", "I don't know! ", "But the rice was obviously not cooked perfectly. ", "The 10 piece nigiri omakase for $40 is not a bad deal but you get what you pay for. \n\n", "There are way too many other restos with omakase that satisfy me in the Bay Area."], "author": "Regina B.", "review": "I had high expectations for this spot since it has a 4 star rating. I have to say I was unimpressed. I guess maybe my standards are too high?\n\nWe came here for my husband's birthday dinner, excited to try the happy hour and the omakase. Happy hour wasn't spectacular. $1 off sake, $1.50 per oyster. $5 hand roll. My husband had the omakase but was not Impressed. It was just standard. He said the rice was hard on the edges of each nigiri piece. The fish did NOT melt in his mouth like other omakase we have tried. Was it because we went there on a Monday? I don't know! But the rice was obviously not cooked perfectly. Maybe it wasn't fresh?\n\nMy chirashi bowl was standard. Nothing extraordinary. Baby girl had chicken karaage because what else do babies eat a Japanese resto? No kids menu. Boo. Yelp says the resto is kids friendly. That means I expect a kids menu. Given, our server did mention that we could order a cucumber roll that wasn't on the menu for baby girl, but my baby only has one tiny tooth, so that wouldn't work. The truffle fish appetizer on the spoon was pretty tasty, though.\n\nFor what we paid, I expected more. The 10 piece nigiri omakase for $40 is not a bad deal but you get what you pay for. \n\nI will not be returning to this restaurant. There are way too many other restos with omakase that satisfy me in the Bay Area.", "rating": 3, "date": "2018-09-17"}, {"excerpts": ["They have happy hour every day, and a pretty affordable omakase too. ", "We decided to split the 10 piece omakase, the handroll sampler, and miso soup. ", "The omakase was good, although each piece is pretty heavy on wasabi, so be careful if you don't like it haha. ", "The presentation is cool, on a long wooden board. ", "The handroll sampler had good portions of fish to rice ratio and fresh fish! "], "author": "Tara A.", "review": "Nara is a pretty hip sushi spot! They have happy hour every day, and a pretty affordable omakase too. I came with my bf for dinner on a Friday, and we split a few dishes beacuse we weren't that hungry.\n\nWe decided to split the 10 piece omakase, the handroll sampler, and miso soup. The omakase was good, although each piece is pretty heavy on wasabi, so be careful if you don't like it haha. The presentation is cool, on a long wooden board. The handroll sampler had good portions of fish to rice ratio and fresh fish! I liked the salmon handroll the best.\n\nService was very friendly. I want to come back to try some of their more creative dishes, like the hamachi truffle or sushi/fish tacos!", "rating": 4, "date": "2018-05-20"}, {"excerpts": ["My friend and I split the 10 piece omakase (35 dollars), Special K sushi roll (18 dollars), and the handroll tasting (15 dollars). ", "Yes, I know that's a lot of food ", "but hey we're both swimmers", ", that competitive swimmer diet never goes away. ", "The 10 piece omakase was good. ", "It was my first omakase experience ", "so I didn't know what to expect. "], "author": "Cynthia T.", "review": "Growing up in SF, good sushi is hard to come by. Good sushi with great quality and with affordable prices are even harder to come by! If you're looking for the latter, you definitely want to give this place a shot. I came here to celebrate my friend's birthday and we had a table for 13 reserved during prime time dinner time, on a Saturday night. I arrived a lot earlier than my party and gave the hostess the name that the reservation was under. She said that she couldn't seat me until more people in my party arrived. What's the point of the reservation then if you're going to make me wait for a table that is already reserved. Oh well, minor set back into the evening.\n\nFast forward to dinner time. My friend and I split the 10 piece omakase (35 dollars), Special K sushi roll (18 dollars), and the handroll tasting (15 dollars). Yes, I know that's a lot of food but hey we're both swimmers, that competitive swimmer diet never goes away. The 10 piece omakase was good. It was my first omakase experience so I didn't know what to expect. The only thing I wish that they did was label what type of fish we were being served. \n\nI know that it was salmon and tuna. What type of tuna? I have no idea. The special K roll was also tasty. I liked it because they didn't have a lot of rice as most places do. This place was quite the opposite, little rice to lots of \"stuffing\" lol. The handroll was by far my favorite, again not much rice and a lot of fish. If you're new to sushi, this is what you strive for sushi places to have. There are three handrolls to the order (1 tuna, 1 yellowtail, 1 salmon).  They definitely make you feel like you're getting your money's worth. \n\nThe ambiance was also attentive. They came to fill our waters without us asking and constantly checked in with us to see if we needed anything. The food came out very fast as well. I would definitely come back here for sure. Oh! And minus one star because that waitress that took our picture for our friend's birthday said \"okay, now open your eyes!\" Bitch, what?!", "rating": 4, "date": "2018-04-12"}, {"excerpts": ["- Omakase $40 for 10 peace(allll of the fish were fresh and tasted amazing. ", "I don't think there was one where I did not enjoy. ", "The sardine (saba) was my favorite. ", "I actually wished I ordered the 14 piece after having this. \n"], "author": "Micaela I.", "review": "I came here for dinner and right before happy hour (ends at 7 btw) on a Friday and had no trouble getting a table for 2. I really enjoyed this place and the food and atmosphere. \n\nThe BF and I ordered\n- spicy salmon hand roll (loved it, very fresh, only $5 during HH)\n- sake bomb roll (also enjoyed this)\n-  Hamachi truffle (very flavorful and the jalapeno adds a great crunch)\n- Omakase $40 for 10 peace(allll of the fish were fresh and tasted amazing. I don't think there was one where I did not enjoy. The sardine (saba) was my favorite. I actually wished I ordered the 14 piece after having this. \n- Tako (octopus) - Very very tender and not chewy at all \n\nAll the food was amazing and came out quick! If you are ordering a lot, I recommend ordering some, then ordering the rest later so you have time finishing and savoring the food without being in a rush to eat. I also had this peach sake which was yummy (high recommend) \n\nThe service was great and never had to ask for anything because they were always on point. I would definitely come again.", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["10pc Sushi Omakase ($35)- I don't share so this was all for me.  ", "I asked for no tuna and they were nice enough to make sure it was replaced with something else.  ", "The Omakase experience was amazing.  ", "The beautiful presentation came out on a long wooden slate of wood.  ", "I got 10 different pieces of nigiri.  ", "All of my sushi pieces were super fresh in quality and all huge pieces of fish.  ", "I recommend this if you are new to this place.  "], "author": "Cat N.", "review": "Sushi magic right here.\n\nAfter being recommended to come here, I came with two other people for an early dinner.  We came in on a Sunday night and there was no wait at 6pm.  Once seated, we were given their happy hour menu (5pm-7pm) and regular menu.  Their happy hour menu was very limited.  However I did order $1.50 oysters off of it, but probably not worth it.  They tasted whatevers and were teeny tiny.  Everything off their regular menu though was amazing.  We got the following:\n\nSpecial \"K\" ($18)- This delicious and amazing roll included yellowtail, avocado, picked jalapeños, topped with amazing seared butterfish and truffle ponzu sauce.  OMG this is a must get for rolls.  The seared butterfish was generous on top and melted in your mouth.  It is so worth it and beautifully presented.  \n\nLoco Spiderman Roll ($15)- This roll included spicy tuna, mango, deep fried soft shell crab, scallions, and topped with spicy mayo and eel sauce.  The roll had the deep fried crab inside of it but also two soft shell crabs that were deep fried also sat on top of the roll.  The presentation was really nice.  It was also well worth the money and definitely delicious. \n\n10pc Sushi Omakase ($35)- I don't share so this was all for me.  I asked for no tuna and they were nice enough to make sure it was replaced with something else.  The Omakase experience was amazing.  The beautiful presentation came out on a long wooden slate of wood.  I got 10 different pieces of nigiri.  All of my sushi pieces were super fresh in quality and all huge pieces of fish.  I recommend this if you are new to this place.  I was really glad I got it.  \n\nHandroll tasting ($15)- This tasting included tuna belly, albacore belly, and salmon belly.  If you want handrolls then this is great for the value.  They were generous with the fish and all packed.  They were fantastic. \n\nScallop Nigiri ($8/2 pieces)-  These were so good we ended up ordering a whole bunch.  Each scallop piece was huge, sweet, fresh and delicious. \n\nLive Sweet Shrimp Nigiri (MP)- These were also oh so yummy.  It was served with the head fried.  For two shrimps it was quite the presentation.  \n\nWe were all very happy with our orders and left totally satisfied and full.  I thought pricing was cheap for what you get.  All the fish quality was A+.  The customer service was excellent.  They were awesome about substitution or any alterations.  The inside is kinda small but a very cute intimate vibe.  There is also bar seating.  Reservations is recommended.  There was a huge wait when we were leaving.", "rating": 5, "date": "2018-01-15"}, {"excerpts": ["Sushi connoisseurs will have lots to choose from, whether nigiri or sashimi tastings, or an all-out omakase. "], "author": "Vincent L.", "review": "This venue has seen several restaurants come and go over the years, so it's good to see Nara still going strong after 3 years in operation. The offerings here might not be 110% authentic, but the preparation and presentation aren't off the mark, the overall taste is pretty good, the atmosphere lively, and the service friendly. In short: a good place for groups, especially ones with lots of gringos.\n\nSushi connoisseurs will have lots to choose from, whether nigiri or sashimi tastings, or an all-out omakase. For those with more gringo tastes, there are hand rolls and goopy sushi rolls galore, as well as plenty of items which are marked as appetizers but could pass for small entrees, like the butterfish addiction, which was one of my favorites. To add to what's already a good selection of shareable items, they have a nice array of sake and shochu, plus a modest beer and wine assortment.\n\nService is one of their strong points - super friendly, fast, and helpful. Overall, a nice neighborhood go-to for groups large and small.", "rating": 4, "date": "2018-06-11"}, {"excerpts": ["1 star for fresh fish\n1 star for presentation\n1.5 stars for the Uni\n\nOmakase 10 pieces for $35. - great deal! "], "author": "Song C.", "review": "I'll make this short and sweet. 3.5 stars from me!\n\n1 star for fresh fish\n1 star for presentation\n1.5 stars for the Uni\n\nOmakase 10 pieces for $35. - great deal! The fish was fresh and really good but where they missed the mark was the rice. As I was making my way from left to right, I was hoping that it was going to get better but alas, got to the very last piece and discovered more hard pieces of rice.\n\nThe only saving Grace was the uni order. Uni from Baja was incredible and the sushi rice was on point. \n\nOverall, had a good meal. May come back if I'm in the neighborhood.", "rating": 3, "date": "2018-01-14"}, {"excerpts": ["We got ordered omakase and enjoyed ever bite of our meal!\n\n"], "author": "Michelle C.", "review": "Fresh fish, beautiful plating and presentation, and really sweet and attentive staff. We got ordered omakase and enjoyed ever bite of our meal!\n\nHighlights were the salmon and hotate for me. And the ikura! \n\nDefinitely going back for more!", "rating": 5, "date": "2018-02-19"}, {"excerpts": ["They have a 10-pièce omakase for $40 and a great selection of sales with happy hour deals. ", "We ordered the hamachi truffle, omakase, salmon hand roll, and a sake bomb roll. ", "The omakase was amazing and had such a great variety of flavors of fish! ", "Yum! "], "author": "Phillip V.", "review": "I came in here for happy hour after work on a Friday and it is a great value!! They have a 10-pièce omakase for $40 and a great selection of sales with happy hour deals. We ordered the hamachi truffle, omakase, salmon hand roll, and a sake bomb roll. The hamachi truffle was delicious and flavorful! The omakase was amazing and had such a great variety of flavors of fish! Yum! The salmon handroll was solid, nothing special but still pretty yummy and the sake bomb roll was loaded with delicious ingredients. It was a party in my mouth!!\n\nAll the food was good, but I really enjoyed washing it down with some high-quality sake and I thought it had excellent customers service and a peaceful, yet hip, ambience!\n\nHighly recommend to anyone looking for good Japanese in the Haight and especially if you can make their happy hour!", "rating": 5, "date": "2018-06-22"}, {"excerpts": ["Omakase - 10 piece was incredible. "], "author": "Vee B.", "review": "Jalapeño poppers with tuna - must have for an appetizer!\n\nService was attentive, friendly, and on point.\n\nOmakase - 10 piece was incredible. Do yourself a favor and save the blue fin tuna for last. \n\n10/10 would come back again :)", "rating": 5, "date": "2018-04-14"}, {"excerpts": ["I did not like their omakase offerings. ", "The selections did not seem especially unique or thoughtful. ", "The hotate sashimi dish $11 was probably one of the cuter ways I've seen scallop displayed lately. ", "The oink belly dish $11 was too salty and basic. ", "The uni nigiri was alright. "], "author": "Thien H.", "review": "Nara is probably my least favorite sushi place in SF so far. I did not like their omakase offerings. The selections did not seem especially unique or thoughtful. The hotate sashimi dish $11 was probably one of the cuter ways I've seen scallop displayed lately. The oink belly dish $11 was too salty and basic. The uni nigiri was alright. I can't remember much about the rolls, they were okay, but not something we'd order again.\n\nMy brother ordered the spicy chicken karage $8.00 and some rice $2.00. The chicken karage was definitely OFF-tasting. I know. I know. Why chicken at a sushi place? But he eats what he eats. After I noticed he only tried a bite or two and left it alone, I tried it myself. It wasn't like normal karage or normal spicy karage - it had a weird dried pepper flavor. It was almost bitter. The off-tasting chicken (like it was old and not fresh) was overly deep fried or wok fried (which made it extremely dry and hard). The dish was a hot mess.\n\nI was curious to see if the server and/or management would notice that we hated the dish and do something about it. \n\nThe server noticed after a while and asked us what was wrong with the dish and asked if we wanted it taken away. I explained what was up with the chicken in detail. She apologized and took the plate way. She did NOT take it off the bill. We were still charged for it although it was inedible. \n\nThe $8.00 chicken karage was a drop in the bucket, so I didn't want to demand it be taken off our bill, but it clearly should have been. \n\nThe inedible spicy chicken karage combined with the so so sushi offerings made me want to venture out to the other (unlimited) sushi places in the city. BYE Nara!\n\nOur table of four was seated close to another pair. We heard every bit of their conversation. A bit awkward.", "rating": 2, "date": "2017-09-25"}, {"excerpts": ["Go with a friend and split the sashimi and sushi omakase, which are both reasonably priced ($35-45) and include fish I'd never tried (like butter fish)."], "author": "Naomi S.", "review": "First sushi experience in SF, and it did not disappoint! \nScored a table immediately at 6:30, in time for happy hour specials that ended at 7. \nThe presentation was beautiful. Upon tasting the fish, I was pleased to learn that the fish was not just pretty, but also delicious. Go with a friend and split the sashimi and sushi omakase, which are both reasonably priced ($35-45) and include fish I'd never tried (like butter fish).", "rating": 5, "date": "2018-01-13"}, {"excerpts": ["The Omakase -- a ten-piece Nigiri sampler -- was on the weaker side of things; certainly weaker than comparable samplers at Ozumo or Otoro. ", "It featured mostly the lower-quality and less interesting fish, with only one piece of tuna. ", "I inquired as to the variety of the tuna, but didn't get a straight answer. "], "author": "John L.", "review": "Despite its exceptionally tasteless name, the \"Jessica Alba Roll\" is actually very tasty, possibly among my favorites in SF thus far. That roll, in and of itself, is a four-and-a-half star item. My friend had a veggie roll, which he remarked was certainly among the best he's ever had.\n\nThe Omakase -- a ten-piece Nigiri sampler -- was on the weaker side of things; certainly weaker than comparable samplers at Ozumo or Otoro. It featured mostly the lower-quality and less interesting fish, with only one piece of tuna. I inquired as to the variety of the tuna, but didn't get a straight answer. There was, of course, no Toro on that platter.\n\nI'm a little disappointed to have to give them three stars. I expect that I may give them four on the next visit if I stick to rolls, which seemed stronger in quality. I do note that they do mostly more modern/American-style rolls, with fewer traditional-style rolls on the menu. (For example, I didn't see a Kappa or a Tekka Maki anywhere.)", "rating": 3, "date": "2018-05-06"}, {"excerpts": ["Particularly enjoyed the omakase nigiri, kimchi taco, clam soup, ribs, and jalapeño poppers."], "author": "Vivien S.", "review": "Great neighborhood restaurant with decent nigiri, warm dishes and services. Particularly enjoyed the omakase nigiri, kimchi taco, clam soup, ribs, and jalapeño poppers.", "rating": 4, "date": "2018-09-16"}, {"excerpts": ["Everyone at the table got the 10 piece omakase. ", "As the chefs were making the nigiri we watched in amazement as they prepared seven individual planks of wood holding each person's meal. "], "author": "Justin P.", "review": "I went here with a group of friends on a Sunday night for dinner before catching a show. We started off the night with the both hot and cold sake and the two dozen of the Miyagi oysters. The oysters tasted fresh and were accompanied by lemon, ponzu, and hot sauce. The whole tabled liked them so much, we had to get another round of two dozen.\n\nThe other appetizers we got were the mushroom tempura (enoki mushrooms), Mr. Tako Balls (panko-fried sous vide octopus in white truffle mashed potato balls), Agedashi Tofu, and a couple hand rolls (spicy tuna and salmon skin). The pace the kitchen prepared the food was fast and we had a steady stream of dishes to pass around before we got to our main courses.\n\nEveryone at the table got the 10 piece omakase. As the chefs were making the nigiri we watched in amazement as they prepared seven individual planks of wood holding each person's meal. To be honest, I can't recall exactly what each piece was because I was too busy staring at the beauty in front of me while our server was explaining them all. \n\nEach piece of sushi was very fresh and the rice they used complemented the fish well with vinegar notes and had good texture to it. Everyone had smiles all around as we savored our planks piece by piece - some people eating as slow as humanly possible to make the experience last longer. I distinctly remember \"In The Air Tonight\" by Phil Collins playing in the restaurant while one of my buddies was having an out-of-body experience eating the Hokkaido scallop nigiri (LMAO). The iconic drum break hit right when he took the bite. It was hilarious. We weren't ready for our omakases to come to an end so we also ordered a plank of Main Uni to cap off the night. Usually they come in twos, but they accommodated us by allowing us to get seven - one per person.\n\nOverall, our party's experience at Nara was amazing. Our server Yumi was super attentive, a pleasure to talk to, and made sure we were all taken care of. Everything we ate and drank hit the spot, and we were having such a good time they even gave us another bottle of cold sake on the house! I'm not claiming this is the best sushi I've ever had, but the combination of the quality of the food with the service and atmosphere made for a 5/5 dining experience. I would highly recommend this place to anyone trying to get their sushi fix in the city.", "rating": 5, "date": "2018-03-05"}, {"excerpts": ["The order omakase and let the chef chose for you"], "author": "Ina D.", "review": "This is my favorite sushi bar in San Francisco . And I have eaten sushi all my life and in Japan and Hawaii . Chef Kevin is a creative and gifted sushi chef . He smokes his own unagi and fish and creates art pieces . Come for the happy hour between five and seven and have $1.50 oysters!!! The order omakase and let the chef chose for you", "rating": 5, "date": "2018-06-18"}, {"excerpts": ["10 piece Sushi Omakase ", "- Wow it was delicious!!"], "author": "Sandy B.", "review": "Found a new sushi place I love especially coming back from Japan with sushi withdraw. This place satisfied my cravings. Not your Michelin fancy pant experience but high quality, fresh and delicious sushi. And price is very reasonable. Service was amazing! Exceeded my expectations and made my friend felt super special for her birthday. \n\nHappy Hour is from 5-7pm. $1.50 oysters, and yummy spicy salmon and tuna handroll for $5. Also discounted sake and beer.\n\nHighly Recommended: \n*Hamachi Truffle, yummy and great presentation. \n*10 piece Sushi Omakase - Wow it was delicious!!", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["Since their 10-piece omakase is in the super cheap sushi range ($35), it deserves to be compared to similar shops. ", "I'd say the average seafood freshness here is below that of $45 omakase places like Eiji Sushi, Kazu Sushi, and Daigo Sushi, but it is much fresher than another $35 omakase place (Wild Sushi in Inner Sunset). \n\n", "The rock shrimp taco was superb, as were the scallop, escolar, butterfish, hirame, and salmon in my omakase. ", "The other bites varied between strangely chewy or oddly and clumsily cut -- and 2 pieces of sushi were just plain fishy. "], "author": "Ken H.", "review": "The lowdown: 70-80% of the sushi pieces give you amazing freshness-for-value, while 20-30% other pieces leave you slightly gagging. Their fish supply manager needs to learn better quality control, but otherwise most of their stuff is great.\n\nSince their 10-piece omakase is in the super cheap sushi range ($35), it deserves to be compared to similar shops. I'd say the average seafood freshness here is below that of $45 omakase places like Eiji Sushi, Kazu Sushi, and Daigo Sushi, but it is much fresher than another $35 omakase place (Wild Sushi in Inner Sunset). \n\nI really enjoyed the seared hamachi on a spoon with ponzu truffle, while another dish of yellowtail poke left me sort of queasy. The rock shrimp taco was superb, as were the scallop, escolar, butterfish, hirame, and salmon in my omakase. The other bites varied between strangely chewy or oddly and clumsily cut -- and 2 pieces of sushi were just plain fishy. This is such a pity because 2 bad pieces can really drag down a 5-star experience into a 3-star.\n\nIf Nara can do better quality control so that they eliminate the 20% of the less fresh fish, they would be a super stellar budget sushi bar. I'd say it's even worth raising the price a little to make sure quality control is better.", "rating": 3, "date": "2017-04-30"}, {"excerpts": ["I had it at Omakase ", "and that's very hard to beat. ", "The ankimo was a little cold ", "and I prefer it warm. "], "author": "Jackie N.", "review": "Found the place through Yelp. Love the vibe : good music, modern feel, great service. I came around 6:30 on a weekday and it's definitely not crowded at that time. The restaurant had the daily specials written on the wall which is great. I would highly recommend the bar if your can. You really do see the chefs perfect every dish they make, even Togo boxes dishes. Here is what I got :\n\nMr Tako Balls is a lot more carbs than a typical takoyaki, but then I realize it has truffle mash potato in it. It's not bad, but the carbiness that comes with potatoes can be tasted. \n\nHamachi truffle is the bomb dot com. Have it to start your night with the miyagi oysters and you won't be disappointed. I really like the ponzu they dress over the fish. \n\nThe miyagi oysters are $1 between 5-7 for happy hour  served with lemon and a soy sauce like sauce. Definitely indulge during he happy hours. Surprisingly they are super clean, didn't taste muddy at all. I'm really happy with what they gave me. I will say that the soy sauce does not mix well with the lemon and hot sauce. I would choose one when mixing. \n\nNigiri tasting has 7 fish that the chefs get to choose  I got: hamachi, salmon, golden eye snapper, ocean trout, striped mackerel, yellowtail belly, escolar. Not bad! I can't say that the salmon was super buttery, but you can tell you are getting fresh clean fish. It cost $25 for 7 pieces. Not bad to try if you do not know what fish is good here. \n\nDaily special: live scallop special. Comes with 2 sashimi, 2 nigiri, and 2 tempura pieces. Presentation is on point. It was okay though taste wise, I've had better scallops at other places.\n\nAnkimo nigiri - I had it at Omakase and that's very hard to beat. The ankimo was a little cold and I prefer it warm. Would I pay $8, probably not.\n\nLoco Spider-Man roll was the only roll I got. I see that ppl also get the blazing glory. I would say loco Spider-Man is their take on spider roll. It's different because there is no eel. Rate is a 7/10.  Probably wouldn't get this again. Nothing was special about it. \n\nI give it a 5 for great experience, great food, great pricing, and  happy hour menu. The food is fresh and   I left a happy women. Great for groups. Clean. You must try hamachi truffle and oysters (during hh of course ). Would definitely come back. They definitely catered to me and made me feel special..", "rating": 5, "date": "2016-05-25"}, {"excerpts": ["but I think their sushi omakase and nigiri sets are decently priced. ", "I would definitely take a date here as the ambiance is really trendy and hip!"], "author": "Anh Thu P.", "review": "I've been here before and enjoy their happy hour menu. It's from 5-7 on weekdays and includes $5 salmon or tuna handroll and $1.50 miyagi oysters. I'm pleasantly surprised with their $2 kimchi guac shrimp taco. I like that they have a variety of things to order that includes cold appetizers, kitchen dishes and sushi. The sushi items range in prices but I think their sushi omakase and nigiri sets are decently priced. I would definitely take a date here as the ambiance is really trendy and hip!", "rating": 4, "date": "2017-11-03"}, {"excerpts": ["I'd come again to try their omakase and non-fusion dishes when I don't want to pay the $$$$ for the real omakase experience. ", "Fun place for large groups to eat and drink "], "author": "Anna M.", "review": "I'd say this place is a solid 4 stars. Came here for happy hour as a pre-dinner snack. We arrived at 6:50pm and the happy hour was ending it 10 mins so we told the waiter/host and he seated us immediately with almost a full house. SO HAPPY!\n\nOrdered the oysters, truffle hamachi, kim chee shrimp tacos, miso soup, handrolls, and a couple piece of nigiri. We were told the truffle hamachi was one of the most popular things on the menu, but it was just bland and whatever to me. I could barely taste the truffle oil. The handrolls and nigiri were pretty decent. For that price point, it's actually really good :) \n\nI'd come again to try their omakase and non-fusion dishes when I don't want to pay the $$$$ for the real omakase experience. Fun place for large groups to eat and drink :)\n\nSolid sushi joint.", "rating": 4, "date": "2017-02-14"}, {"excerpts": ["Omakase deal ($35 for 10 pieces of nigiri) was well worth it--the fish used was very fresh. ", "The spicy hand rolls were also really good! ", "Would definitely revisit Nara if I find myself in SF again."], "author": "Astrid G.", "review": "Omakase deal ($35 for 10 pieces of nigiri) was well worth it--the fish used was very fresh. The spicy hand rolls were also really good! Would definitely revisit Nara if I find myself in SF again.", "rating": 4, "date": "2017-06-11"}, {"excerpts": ["I would highly recommend you try their two omakase options.\n\n"], "author": "Edmund A.", "review": "I was super impressed by Nara. After having tried multiple high-end sushi restaurants in SF such as Kusakabe, ju-ni, Akiko, and more, I think Nara is almost as good as it gets in the city, barring my gold standard: Kusakabe.\n\nI would highly recommend you try their two omakase options.\n\nThe space is beautiful, woodsy, and fairly well decorated so reservations are highly recommended.", "rating": 5, "date": "2017-04-23"}, {"excerpts": ["The nigiri combo was a bit disappointing in terms of quality but for $25, it was almost a cheap basic omakase since it included less run-of-the-mill fish. ", "I got: horse mackerel, Hawaiian amberjack, regular amberjack, salmon, yellowfin tuna, and ocean trout. ", "The quality wasn't the best ", "but for the price I didn't expect much. ", "The taste wasn't clean and the texture was closer to mush. "], "author": "Vivian C.", "review": "As much as I love traditional sushi, modern fusion places like Nara can also be a good time. It's especially nice because it offers some \"higher end\" options while also having some good filler menu choices that won't break the bank. The fish quality here doesn't quite match up to the modern accessible-but-high-end vibe this place gives off but the rolls are creative, the service is excellent, and I just can't be too mad about $1 miyagi oysters.\n\nFor food my friend and I got oysters and a roll I can't remember the name of (it had escolar, pickled jalapenos, and a ponzu truffle sauce.) I got the nigiri combo and my friend got the It's Like Butter Baby w/ white rice versus the bacon fried rice.\n\nOyster quality is honestly pretty good for just a buck. Miyagi oysters are about as standard as an oyster can taste and my wallet is ok with that. The nigiri combo was a bit disappointing in terms of quality but for $25, it was almost a cheap basic omakase since it included less run-of-the-mill fish. I got: horse mackerel, Hawaiian amberjack, regular amberjack, salmon, yellowfin tuna, and ocean trout. The quality wasn't the best but for the price I didn't expect much. The taste wasn't clean and the texture was closer to mush. Not sure if I'd get it again.\n\nThe roll on the other hand was delicious. Escolar goes great with pickled items and I would definitely eat this again (if I could remember the name). My friend's Like Butter Baby dish was also good for the most part. The veggies really were drowned in butter laced with something else that's super addictive. The fish was cooked well but not all that fatty and honestly underseasoned. However, I know it's meant to be eaten with bacon fried rice. The white rice just makes the dish a bit too plain.\n\nOverall, I really do love this place. While the traditional stuff may not be great, their more modern items are definitely delicious!", "rating": 4, "date": "2016-07-21"}, {"excerpts": ["Good omakase at a good price! ", "My fave is the California roll - ", "I believe they use real crab!!"], "author": "Nina T.", "review": "We've been here 5+ times and it never disappoints! Love this place!! Good omakase at a good price! My fave is the California roll - I believe they use real crab!!", "rating": 5, "date": "2018-01-12"}, {"excerpts": ["Delicious omakase at a very reasonable price! ", "Although I personally thought the sashimi/nigiri quality was not quite at the same level as Kusakabe, Omakase, etc.", ", I would still highly recommend Nara's omakase for its great value!"], "author": "Kristina W.", "review": "Delicious omakase at a very reasonable price! ($50/$70) \n\nI opted for the $50 set, which came with a set of 3 raw appetizers (including the delicious hamachi truffle - one of their most popular dishes), cooked amberjack collar, nigiri/sashimi set (8 total), 6 raw oysters, and choice of dessert (green tea ice cream, creme brulee, or mochi ice cream). Everything was delicious & I was so full by the end that it was even a struggle to finish the oysters/dessert. Although I personally thought the sashimi/nigiri quality was not quite at the same level as Kusakabe, Omakase, etc., I would still highly recommend Nara's omakase for its great value!", "rating": 4, "date": "2016-04-26"}, {"excerpts": ["John definitely puts his energy and creativity to his omakase."], "author": "Kimberly H.", "review": "Korean owned and operated. Very friendly staff. Mid-tier sushi and sashimi but prices are also not as high as the fancier establishments in the FD. John definitely puts his energy and creativity to his omakase.", "rating": 4, "date": "2015-12-18"}, {"excerpts": ["We ordered the miyagi oysters, jalapeño poppers and the Omakase. ", "Everything was fresh and absolutely delicious. ", "Chef and waitress were friendly and attentive. ", "Will be going back. ", "5/5!"], "author": "Henry W.", "review": "We ordered the miyagi oysters, jalapeño poppers and the Omakase. Everything was fresh and absolutely delicious. Chef and waitress were friendly and attentive. Will be going back. 5/5!", "rating": 5, "date": "2017-02-19"}, {"excerpts": ["We ordered 2 appetizers, rolls and the 10 piece omakase. ", "Everything was presented perfectly and the fish tasted extremely fresh and good! ", "I'll be coming back for more! ", "Well done!"], "author": "Roba Z.", "review": "Wow wow wow! I wish I can give this restaurant 10 starts instead of 5. First of all their staff is super friendly! They welcomed us to our table and helped us a lot with the menu. We ordered 2 appetizers, rolls and the 10 piece omakase. Everything was presented perfectly and the fish tasted extremely fresh and good! I'll be coming back for more! Well done!", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["Delish omakase. ", "5/5 will come back again soon! ", "Great food and staff. ", "All of the fish was very fresh. ", "The beer was crisp and the sake kept on flowing! ", "Yum!!"], "author": "Matheus K.", "review": "Delish omakase. 5/5 will come back again soon! Great food and staff. All of the fish was very fresh. The beer was crisp and the sake kept on flowing! Yum!!", "rating": 5, "date": "2018-01-13"}, {"excerpts": ["so I ordered the omakase which they asked for 50USD. ", "Fishy was the only word in my mind when I was eating. ", "Avoid!"], "author": "Mandy W.", "review": "Bad, bad, this is so bad. The 1.5 star out of 4.5 should have been using money bought from Yelp. I dont eat Americanized rolls so I ordered the omakase which they asked for 50USD. Fishy was the only word in my mind when I was eating. Avoid!", "rating": 1, "date": "2016-04-18"}, {"excerpts": ["We did the $70 omakase (supposed to be better quality fish than the $50 option), and I was really disappointed. ", "The fish itself was poor quality, and I would have preferred a pricier omakase and/or fewer pieces over a ton of not so great fish. ", "The starter and cooked foods were the saving grace. ", "This place has such great reviews, my guess is you're much better off sticking to the hamachi starter, some cooked food, and a few rolls to share. ", "Skip the sashimi and nigiri!!"], "author": "Shirley L.", "review": "We did the $70 omakase (supposed to be better quality fish than the $50 option), and I was really disappointed. The fish itself was poor quality, and I would have preferred a pricier omakase and/or fewer pieces over a ton of not so great fish. The starter and cooked foods were the saving grace. This place has such great reviews, my guess is you're much better off sticking to the hamachi starter, some cooked food, and a few rolls to share. Skip the sashimi and nigiri!!", "rating": 3, "date": "2016-04-08"}, {"excerpts": ["One of my favorite places, to take an Omakase flight of amazing sushi tasting menu. ", "The cooked menu items are also very interesting and tasty."], "author": "Jason G.", "review": "One of my favorite places, to take an Omakase flight of amazing sushi tasting menu. The cooked menu items are also very interesting and tasty.", "rating": 5, "date": "2017-02-28"}, {"excerpts": ["loved the appetizer the hamachi truffle (like most people) and shared the omakase and big boss roll with my girlfriend which was the perfect amount of food! ", "they also have an amazing sake selection, i would definitely recommend this place for date night!!"], "author": "Will M.", "review": "this may be the best salmon belly i've ever had...wow super great experience and really fun chefs! recommend sitting at the bar so you can watch the skilled chefs prepare amazing dishes! loved the appetizer the hamachi truffle (like most people) and shared the omakase and big boss roll with my girlfriend which was the perfect amount of food! they also have an amazing sake selection, i would definitely recommend this place for date night!!", "rating": 5, "date": "2017-02-10"}, {"excerpts": ["Best Omakase I've ever had for $50! ", "It's so cheap yet soo good! ", "Very melt in your mouth pieces of sashimi and nigiri. ", "LOVED their toro and all the other pieces of sashimi. ", "It is definitely more than one person can eat. ", "We had to help our friend eat her Omakase. ", "The quail egg uni was also amazing as well as all of the other dishes we ordered. ", "Pictures are included."], "author": "Grace L.", "review": "Best Omakase I've ever had for $50! It's so cheap yet soo good! Very melt in your mouth pieces of sashimi and nigiri. LOVED their toro and all the other pieces of sashimi. It is definitely more than one person can eat. We had to help our friend eat her Omakase. The quail egg uni was also amazing as well as all of the other dishes we ordered. Pictures are included.", "rating": 5, "date": "2015-10-17"}, {"excerpts": ["Best omakase for the price!  ", "They have a $50 one and a $70 one.  ", "I went for the smaller ", "and it was still plenty of food.  ", "10 pieces of sashimi, 4 pieces of nigiri, hamachi collar and dessert.  ", "Great neighborhood spot and will definitely be coming here often!"], "author": "Sandra P.", "review": "Best omakase for the price!  They have a $50 one and a $70 one.  I went for the smaller and it was still plenty of food.  10 pieces of sashimi, 4 pieces of nigiri, hamachi collar and dessert.  Great neighborhood spot and will definitely be coming here often!", "rating": 5, "date": "2015-10-17"}, {"excerpts": ["I had the seven-course omakase, which was an insane amount of food. ", "There were lots of rolls, the kind that come with sauces or are deep fried or have fusion-y ingredients like cream cheese. ", "They were delicious, but I was hoping for some really good simple fresh fish. ", "Just when I thought that wasn't coming, a plate of I think seven types of sashimi was served, followed by seven types of nigiri. ", "There was also salad, a course of cooked fish, miso soup with veggies and seafood, and creme brulee for dessert. "], "author": "Joseph N.", "review": "This is hands down my favorite spot in the neighborhood and one of my favorite restaurants in the city. The food is excellent and the owner/staff kick so much ass, Nara is always a fun place to be. It's a great place for a meal or a few rounds with good food for accompaniment, and the happy hour is great. \n\nMore detailed review:\n\nFirst things first, the food is excellent. Whether you're in the mood for sushi or something heavier / cooked, Nara's got you covered. The fish is very fresh so it's great as sashimi/nigiri or in their rolls, some of which are incredible. They always have daily specials listed on the board behind the sushi bar that oftentimes sell out.\n\nLast time I was here I had the seven-course omakase, which was an insane amount of food. There were lots of rolls, the kind that come with sauces or are deep fried or have fusion-y ingredients like cream cheese. They were delicious, but I was hoping for some really good simple fresh fish. Just when I thought that wasn't coming, a plate of I think seven types of sashimi was served, followed by seven types of nigiri. There was also salad, a course of cooked fish, miso soup with veggies and seafood, and creme brulee for dessert. I may have missed something else, but my point is it was all top-notch and a lot of food.\n\nFrom the regular menu some favorites include hamachi truffle, garlic butter edamame, chicken karaage (I prefer spicy), \"it's like butter\" (incredible fish dish), hamachi kama, big boss roll, and the ramen. Aside from the soups everything is easy to share, which makes coming here with friends even more fun.\n\nThe atmosphere is awesome here, from the tasteful decor to the friendly and welcoming staff. I've gotten to know some of them, including chefs Kevin and Danny, both a lot of fun and great at what they do. George, one of the servers, is always attentive and friendly. And the owner Sonny, who you'll sometimes see wandering table to table, is an awesome guy who is doing things right with this restaurant.\n\nThere's an izakaya / gastropub vibe here, so even though the food is legit it's also a great place to grab drinks (though no liquor, so don't expect that). They have a few beers on tap and some imported bottles as well as an extensive sake menu. It can be a bit loud but never rowdy, which for me is perfect. They have good playlists to keep the atmosphere upbeat.\n\nIf you live nearby or are looking for a new sushi spot, definitely check this place out!", "rating": 5, "date": "2015-07-21"}, {"excerpts": ["We ordered the Omakase on a Saturday night, but we were not impressed...food wasn't that good.  ", "This was my first time here, so I am willing to go back and try the other stuff before I cross this restaurant completely off my list."], "author": "Craig L.", "review": "We ordered the Omakase on a Saturday night, but we were not impressed...food wasn't that good.  This was my first time here, so I am willing to go back and try the other stuff before I cross this restaurant completely off my list.", "rating": 3, "date": "2016-03-19"}], "nigiri tasting": [{"excerpts": ["There is no need for me to get into the details of each dish, as I've tried almost every roll, hot dishes, small/cold dishes, nigiri tasting, and chirashi, and think quality is throughout. "], "author": "Vickie Z.", "review": "Long overdue post. And every time I come, my love grows deeper. There is no need for me to get into the details of each dish, as I've tried almost every roll, hot dishes, small/cold dishes, nigiri tasting, and chirashi, and think quality is throughout. Think of Nara as trendy social spot - not really like an izakaya, but somewhere in the middle between that & strictly sushi place because their non-sushi dishes are for sharing & it has a bumpin' and fun atmosphere. \n\nWhen I am craving sushi (but not JUST sushi), I default to this place. When a friend is in town, I take them here. When someone is looking for a rec, I tell them here. \n\nSome of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n- Ocean foie gras \n- Mr Tako balls \n\nFor the quality and taste, you are getting your money's worth. VERY affordable. One of my favorite restaurants in the city.", "rating": 5, "date": "2017-10-16"}, {"excerpts": ["Nigiri tasting has 7 fish that the chefs get to choose  ", "I got: ", "hamachi, salmon, golden eye snapper, ocean trout, striped mackerel, yellowtail belly, escolar. ", "Not bad! ", "I can't say that the salmon was super buttery, but you can tell you are getting fresh clean fish. ", "It cost $25 for 7 pieces. "], "author": "Jackie N.", "review": "Found the place through Yelp. Love the vibe : good music, modern feel, great service. I came around 6:30 on a weekday and it's definitely not crowded at that time. The restaurant had the daily specials written on the wall which is great. I would highly recommend the bar if your can. You really do see the chefs perfect every dish they make, even Togo boxes dishes. Here is what I got :\n\nMr Tako Balls is a lot more carbs than a typical takoyaki, but then I realize it has truffle mash potato in it. It's not bad, but the carbiness that comes with potatoes can be tasted. \n\nHamachi truffle is the bomb dot com. Have it to start your night with the miyagi oysters and you won't be disappointed. I really like the ponzu they dress over the fish. \n\nThe miyagi oysters are $1 between 5-7 for happy hour  served with lemon and a soy sauce like sauce. Definitely indulge during he happy hours. Surprisingly they are super clean, didn't taste muddy at all. I'm really happy with what they gave me. I will say that the soy sauce does not mix well with the lemon and hot sauce. I would choose one when mixing. \n\nNigiri tasting has 7 fish that the chefs get to choose  I got: hamachi, salmon, golden eye snapper, ocean trout, striped mackerel, yellowtail belly, escolar. Not bad! I can't say that the salmon was super buttery, but you can tell you are getting fresh clean fish. It cost $25 for 7 pieces. Not bad to try if you do not know what fish is good here. \n\nDaily special: live scallop special. Comes with 2 sashimi, 2 nigiri, and 2 tempura pieces. Presentation is on point. It was okay though taste wise, I've had better scallops at other places.\n\nAnkimo nigiri - I had it at Omakase and that's very hard to beat. The ankimo was a little cold and I prefer it warm. Would I pay $8, probably not.\n\nLoco Spider-Man roll was the only roll I got. I see that ppl also get the blazing glory. I would say loco Spider-Man is their take on spider roll. It's different because there is no eel. Rate is a 7/10.  Probably wouldn't get this again. Nothing was special about it. \n\nI give it a 5 for great experience, great food, great pricing, and  happy hour menu. The food is fresh and   I left a happy women. Great for groups. Clean. You must try hamachi truffle and oysters (during hh of course ). Would definitely come back. They definitely catered to me and made me feel special..", "rating": 5, "date": "2016-05-25"}, {"excerpts": ["Nigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\n"], "author": "Mark O.", "review": "Dinner review. \n\nHamachi truffle - 4/5\nSpicy Karaage - 2/5\nRice poppers - 4/5\nNigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\nLoco spiderman - 4/5\nHeart attack - 3/5\nTreasure Island - 4/5\n\nOverall,  \"I'm a fan.\"", "rating": 4, "date": "2015-10-14"}, {"excerpts": ["Nigiri Tasting: A.\n", "This was a total surprise. ", "I wouldn't have expected such fresh fish in a sake bar restaurant! ", "There were 7pcs, and although the waitress did present what each of those fish was it was too loud that I could hardly hear. ", "All I know is that it was really fresh. ", "This made me believe that the place was actually created with a traditional + hipster fusion Japanese restaurant theme. ", "Order this. "], "author": "Simon C.", "review": "Nice addition to the Lower Haight neighborhood! By its name \"Sake Bar\" it should be expected that this is not any traditional izakaya joint - and once you step inside you would totally feel it. Very loud, very hip, vibrant atmosphere; in fact I think the music could have been turned down a bit because I could barely listen to my friend's chatting during the dinner. But anyway, I was very impressed by the food.\n\nMarinated Fried Eggplant: B+.\nNot bad. The eggplant was marinated very well, it has a deep flavor within it. It was only slightly fried which added a sense of crispiness outside of the eggplant.\n\nHamachi Truffle: A-.\nVery nicely presented. Strong truffle taste. Even though this is kind of a carpaccio dish but I could still taste the hamachi freshness. \n\nNigiri Tasting: A.\nThis was a total surprise. I wouldn't have expected such fresh fish in a sake bar restaurant! There were 7pcs, and although the waitress did present what each of those fish was it was too loud that I could hardly hear. All I know is that it was really fresh. This made me believe that the place was actually created with a traditional + hipster fusion Japanese restaurant theme. Order this. You won't be disappointed.\n\nHeart Attack Roll: A-.\nThe main fish was spicy tuna, with some cucumber and topped with toro and some type of chips. Both kinds of fish tasted very nice, the chips were interesting, overall a very good choice in my opinion.\n\nSo yea, good food, great service. Ordered 4 glasses of beer for my friend and myself, turned out to be ~$57+tips per person. Considered the great quality of food I think this was not a bad price at all. Definitely a place to come back especially with a bigger group of friends. If the music can be turned down a little bit when I go next time I will doubtlessly give it a 5-star!", "rating": 4, "date": "2015-04-14"}, {"excerpts": ["We ordered hamachi truffle ( a must ) \nChef nigiri tasting ( each piece seasoned perfectly ) \nRay ray's tako ( a must too)\n\n"], "author": "Jeong Hwan O.", "review": "Hands down for this place !!\nI was in the neighborhood with friends and wanted to try this place ! \n\nGreat atmosphere as I walked in and friendly greeting ! \n\nWe ordered hamachi truffle ( a must ) \nChef nigiri tasting ( each piece seasoned perfectly ) \nRay ray's tako ( a must too)\n\nAnd our server was very nice and attentive !!\n\nMy friends and I had a great experience here\nWe will definitely come back for more !!", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["Recommend : hamachi truffle , nigiri tasting , sake kama, Saba ! ", "Omg their Saba ! ", "Torched and freshly grounded ginger and a yuzu drop ? "], "author": "Amy H.", "review": "There are no words to describe this sushi\nSo fresh and so rich ! Just perfect !\n\nAll of the fish melts in your mouth like butter \nPerfect temperature \nSEAT AT THE BAR!!!!!!!!!!!!!!\n\nWe came for dinner at 7 on Monday and were immediately seated \n\n\nRecommend : hamachi truffle , nigiri tasting , sake kama, Saba ! Omg their Saba ! Torched and freshly grounded ginger and a yuzu drop ? Can eat everyday !!\n\nPeople !! What are you waiting for ?", "rating": 5, "date": "2016-04-21"}, {"excerpts": ["Their sashimi and Nigiri tasting are a must (it's not cheap "], "author": "Seungho L.", "review": "I have been coming here ever since they opened\nAnd I am writing this for future customers\n\nThey have happy hour for a dollar oyster (fresh ) , draft beers , and hot sake everyday !\nDuring week they don't get too crazy till 7 pm\n\nTheir sashimi and Nigiri tasting are a must (it's not cheap but it's worthy if you know sushi )\n\nPlease don't come here if you are trying to get a lot of stuff but you don't understand why they are a little expensive \nThere are plenty of places that you could get less expensive sushi !\n\nWe love it here and we will bring friends and family :)", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["The nigiri tasting was good but didn't blow me away. ", "A couple of the pieces had a bit too much wasabi for my liking. "], "author": "Christina G.", "review": "Good happy hour vibe. Came here for dinner on a Thursday night and there was no wait in line, but the place was almost filled up. There is bar seating and tables, and it's dimly lit. A tv showing the Giants game was airing in the background. \n\nFriend and I ordered two nigiri tastings, a handroll tasting, and the Jessica Alba roll (shrimp tempura topped with albacore.) The handroll tasting was delicious! I loved the toro one. Fish felt fresh and flavorful. The nigiri tasting was good but didn't blow me away. A couple of the pieces had a bit too much wasabi for my liking. It did not look as fancy as some of the pics I saw on yelp. \n\nOverall I enjoyed my experience here. Quality sushi, lively atmosphere, and good service. Too bad I came too late for the happy hour deals, but $1 oyster sure sounds good.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["We shared a large rice beer, maguro carpaccio, the nigiri tasting and the special roll from the board topped with uni.  ", "Everything else he was making looked divine and it was heart breaking to see it go to the other people in the restaurant! "], "author": "Cory N.", "review": "From the chorus line singing IRASSHAIMASE!! to the K-Pop style birthday chant, this place is a blast!\n\nI grabbed a seat at the bar with my dear friend and had Kevin as my sushi chef.  His presentation skills are stellar!  I loved everything he gave me, including some fish from Japan as well as otoro - Holy moley delicious!  We shared a large rice beer, maguro carpaccio, the nigiri tasting and the special roll from the board topped with uni.  Everything else he was making looked divine and it was heart breaking to see it go to the other people in the restaurant! I'll be back for more!\n\nP.s. don't miss the chocolate-avocado mousse for dessert ;)", "rating": 5, "date": "2015-03-21"}], "sashimi tasting": [{"excerpts": ["I had the sashimi tasting menu and liked it. ", "The fish tasted really clean and simple, very fresh! ", "Mostly I liked the staff who were so attentive--it was a lovely experience thanks to them."], "author": "Joni W.", "review": "Nice place! The staff were super friendly, and the atmosphere was nice. Prices seemed fair. The quality of the food was good. I had the sashimi tasting menu and liked it. The fish tasted really clean and simple, very fresh! Mostly I liked the staff who were so attentive--it was a lovely experience thanks to them.", "rating": 4, "date": "2016-11-07"}], "handroll tasting": [{"excerpts": ["My friend and I split the 10 piece omakase (35 dollars), Special K sushi roll (18 dollars), and the handroll tasting (15 dollars). ", "Yes, I know that's a lot of food ", "but hey we're both swimmers", ", that competitive swimmer diet never goes away. ", "The 10 piece omakase was good. ", "It was my first omakase experience ", "so I didn't know what to expect. "], "author": "Cynthia T.", "review": "Growing up in SF, good sushi is hard to come by. Good sushi with great quality and with affordable prices are even harder to come by! If you're looking for the latter, you definitely want to give this place a shot. I came here to celebrate my friend's birthday and we had a table for 13 reserved during prime time dinner time, on a Saturday night. I arrived a lot earlier than my party and gave the hostess the name that the reservation was under. She said that she couldn't seat me until more people in my party arrived. What's the point of the reservation then if you're going to make me wait for a table that is already reserved. Oh well, minor set back into the evening.\n\nFast forward to dinner time. My friend and I split the 10 piece omakase (35 dollars), Special K sushi roll (18 dollars), and the handroll tasting (15 dollars). Yes, I know that's a lot of food but hey we're both swimmers, that competitive swimmer diet never goes away. The 10 piece omakase was good. It was my first omakase experience so I didn't know what to expect. The only thing I wish that they did was label what type of fish we were being served. \n\nI know that it was salmon and tuna. What type of tuna? I have no idea. The special K roll was also tasty. I liked it because they didn't have a lot of rice as most places do. This place was quite the opposite, little rice to lots of \"stuffing\" lol. The handroll was by far my favorite, again not much rice and a lot of fish. If you're new to sushi, this is what you strive for sushi places to have. There are three handrolls to the order (1 tuna, 1 yellowtail, 1 salmon).  They definitely make you feel like you're getting your money's worth. \n\nThe ambiance was also attentive. They came to fill our waters without us asking and constantly checked in with us to see if we needed anything. The food came out very fast as well. I would definitely come back here for sure. Oh! And minus one star because that waitress that took our picture for our friend's birthday said \"okay, now open your eyes!\" Bitch, what?!", "rating": 4, "date": "2018-04-12"}, {"excerpts": ["Handroll tasting ($15)- ", "This tasting included tuna belly, albacore belly, and salmon belly.  ", "If you want handrolls then this is great for the value.  ", "They were generous with the fish and all packed.  "], "author": "Cat N.", "review": "Sushi magic right here.\n\nAfter being recommended to come here, I came with two other people for an early dinner.  We came in on a Sunday night and there was no wait at 6pm.  Once seated, we were given their happy hour menu (5pm-7pm) and regular menu.  Their happy hour menu was very limited.  However I did order $1.50 oysters off of it, but probably not worth it.  They tasted whatevers and were teeny tiny.  Everything off their regular menu though was amazing.  We got the following:\n\nSpecial \"K\" ($18)- This delicious and amazing roll included yellowtail, avocado, picked jalapeños, topped with amazing seared butterfish and truffle ponzu sauce.  OMG this is a must get for rolls.  The seared butterfish was generous on top and melted in your mouth.  It is so worth it and beautifully presented.  \n\nLoco Spiderman Roll ($15)- This roll included spicy tuna, mango, deep fried soft shell crab, scallions, and topped with spicy mayo and eel sauce.  The roll had the deep fried crab inside of it but also two soft shell crabs that were deep fried also sat on top of the roll.  The presentation was really nice.  It was also well worth the money and definitely delicious. \n\n10pc Sushi Omakase ($35)- I don't share so this was all for me.  I asked for no tuna and they were nice enough to make sure it was replaced with something else.  The Omakase experience was amazing.  The beautiful presentation came out on a long wooden slate of wood.  I got 10 different pieces of nigiri.  All of my sushi pieces were super fresh in quality and all huge pieces of fish.  I recommend this if you are new to this place.  I was really glad I got it.  \n\nHandroll tasting ($15)- This tasting included tuna belly, albacore belly, and salmon belly.  If you want handrolls then this is great for the value.  They were generous with the fish and all packed.  They were fantastic. \n\nScallop Nigiri ($8/2 pieces)-  These were so good we ended up ordering a whole bunch.  Each scallop piece was huge, sweet, fresh and delicious. \n\nLive Sweet Shrimp Nigiri (MP)- These were also oh so yummy.  It was served with the head fried.  For two shrimps it was quite the presentation.  \n\nWe were all very happy with our orders and left totally satisfied and full.  I thought pricing was cheap for what you get.  All the fish quality was A+.  The customer service was excellent.  They were awesome about substitution or any alterations.  The inside is kinda small but a very cute intimate vibe.  There is also bar seating.  Reservations is recommended.  There was a huge wait when we were leaving.", "rating": 5, "date": "2018-01-15"}, {"excerpts": ["We ordered several dishes: the spicy handroll tasting, sake bomb, chicken karaage, oink belly, and shorty glaze. \n\n", "The sake bomb was mediocre. ", "Can never go wrong with salmon and avocado. ", "I will say the presentation was too much. ", "The pink flakes scattered on top of the sushi in a pile was overwhelming. ", "There wasn't a wow factor to the sushi. ", "The chicken karaage was extremely moist. "], "author": "Teresa C.", "review": "Delicious food paired with an excellent atmosphere. \n\nOn a Saturday night, I came around 7PM and seated at the booth (for better photo lighting). Within the next 15 minutes, the place filled up. The walls are filled with large sake bottles, and the wooden planks on the walls gives the environment a very modern feel. \n\nService: Right when we were seated, the server brought a glass jug of water and cups. The cups are absolutely adorable. Allowed us several moments to settle down. Check-in with us to see if we have any questions.\n\nWe ordered several dishes: the spicy handroll tasting, sake bomb, chicken karaage, oink belly, and shorty glaze. \n\nMUST TRY THE OINK BELLY. This piece of pork melts in your mouth. I sat with amazement when the pork disappeared. It's kind of like a thick chunk of bacon, BUT BETTER. And the presentation was beautiful. ALSO MUST TRY THE SHORTY GLAZE! The large chunk of meat falls right off the bone. The outside is seared and glazed. If just eating in inside of the meat, there is a bite to it, and not quite hitting the \"melt in your mouth\" standard. The piece that's stuck to the bone, was the most flavorful. \n\nThe spicy handroll had three types of fish (tuna, hamachi, sake). I would recommend trying the regular handrolls. We couldn't taste the freshness of the fish because all we could taste was the spiciness. The sake bomb was mediocre. Can never go wrong with salmon and avocado. I will say the presentation was too much. The pink flakes scattered on top of the sushi in a pile was overwhelming. There wasn't a wow factor to the sushi. The chicken karaage was extremely moist. It wasn't as crispy as I thought it would be, but none the less with a squeeze of lemon and the dipping sauce, it was solid. \n\nWould definitely come back again. This would also be a super cute place for a date night!", "rating": 4, "date": "2017-07-30"}, {"excerpts": ["Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n"], "author": "Kassie E.", "review": "COME TO NARA!\n\nFirst time we went the first thing we experienced was the entire staff shouting and getting us. We also noticed the great music that was playing in the background. The ambiance here is fun!\n\nThe food is so good! Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n- Sake Bomb\n- Treasure Island\n\nI have tried a lot more but this is usually what I come in for. They usually have specials written up as well and every time I've tried one it's been pretty good! If you want a casual, yummy, not too expensive, fun, sushi spot, come here!!!!", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["Friend and I ordered two nigiri tastings, a handroll tasting, and the Jessica Alba roll (shrimp tempura topped with albacore.) ", "The handroll tasting was delicious! ", "I loved the toro one. ", "Fish felt fresh and flavorful. "], "author": "Christina G.", "review": "Good happy hour vibe. Came here for dinner on a Thursday night and there was no wait in line, but the place was almost filled up. There is bar seating and tables, and it's dimly lit. A tv showing the Giants game was airing in the background. \n\nFriend and I ordered two nigiri tastings, a handroll tasting, and the Jessica Alba roll (shrimp tempura topped with albacore.) The handroll tasting was delicious! I loved the toro one. Fish felt fresh and flavorful. The nigiri tasting was good but didn't blow me away. A couple of the pieces had a bit too much wasabi for my liking. It did not look as fancy as some of the pics I saw on yelp. \n\nOverall I enjoyed my experience here. Quality sushi, lively atmosphere, and good service. Too bad I came too late for the happy hour deals, but $1 oyster sure sounds good.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["6) Spicy handroll tasting: you get one of each spicy tuna, hamachi and sake. "], "author": "Inga C.", "review": "Overall 3 stars for the great service, fun vibe, and a few tasty dishes (it's tapas style). Just make sure to get the right dishes. I would come back with a big group of friends and get all the plates and drinks that sound good. A sampling below. \n\nRanked in order of deliciousness:\n1) Hamachi truffle: seared yellowtail with jalapeño cilantro and crunch in truffle oil ponzu. It comes in 5 delectable spoons with all the seasonings. You can taste the truffle without it being overpowering. Would get again. \n\n2) (Special on wall) Ray-Ray's Tako - sous vide Spanish octopus with red wine and apple reduction. Cooked just right for chewy texture and a nice sweet-savory glaze. \n\n3) Rice poppers: 4 deep fried sushi rice topped with spicy tuna and white tuna and ranch dressing. It's like a bite-sized Japanese rice ball. Yum. \n\n4) Garlic butter edamame: you just can't go wrong with garlic and butter. Get it. \n\n4) Big boss: yellowtail, tuna, salmon, ikura, avocado, cucumber, radish sprouts. I like it that it's just fish and rice, no fancy toppings needed. The ikura makes this roll.\n\nBelow this - would not get again: \n\n5) Spicy tonkotsu ramen: it's not entirely fair to compare this to ramen-only shops, but this was a real miss. The spiciness overpowered the broth so you couldn't taste the pork flavor. Noodles were stuck together, e.g. what happens when you cook pasta and leave it out to dry w/ no oil. The yolk in the egg seemed al dente but somewhere along the way it fell out of the egg white and was never found again...so can't really comment on that one. \n\n6) Spicy handroll tasting: you get one of each spicy tuna, hamachi and sake. Nothing special. \n\nIf I'm in the area again I'll come back to try  the other dishes.\n\nAtmosphere: it's a fun izakaya / gastropub vibe and it's open late (til 1130p), which is awesome and so rare in SF! \n\nService: super super fast - we were here at 1030p on a Saturday night and the place was about 1/3 full.", "rating": 3, "date": "2015-12-12"}, {"excerpts": ["The handroll tasting was good but not the best. "], "author": "Shireen J.", "review": "I wish I could give this place 5 stars but the service wasn't so great so had to deduct a star. \n\nThe sushi is amazing. So creative, fresh, and beautifully presented. The vibe of this place is great as well. \n\nThe nigiri and sashimi tastings were excellent. The butterfish tasting was mind blowing. The handroll tasting was good but not the best. The heart attack and treasure island rolls were delicious. \n\nEverything is so well presented and I was pleasantly surprised by how fresh the fish was. \n\nMy new favorite place. If only the servers start paying more attention and not leave us waiting next time.", "rating": 4, "date": "2015-12-01"}, {"excerpts": ["Handroll tasting and Heart Attack are not to be missed."], "author": "Makela C.", "review": "I can't say enough good things about Nara. We received great service, the food was delicious, and the owner sent us dessert. I'll be back often. Recommendations: Handroll tasting and Heart Attack are not to be missed.", "rating": 5, "date": "2015-03-01"}], "spicy handroll tasting": [{"excerpts": ["We ordered several dishes: the spicy handroll tasting, sake bomb, chicken karaage, oink belly, and shorty glaze. \n\n", "The sake bomb was mediocre. ", "Can never go wrong with salmon and avocado. ", "I will say the presentation was too much. ", "The pink flakes scattered on top of the sushi in a pile was overwhelming. ", "There wasn't a wow factor to the sushi. ", "The chicken karaage was extremely moist. "], "author": "Teresa C.", "review": "Delicious food paired with an excellent atmosphere. \n\nOn a Saturday night, I came around 7PM and seated at the booth (for better photo lighting). Within the next 15 minutes, the place filled up. The walls are filled with large sake bottles, and the wooden planks on the walls gives the environment a very modern feel. \n\nService: Right when we were seated, the server brought a glass jug of water and cups. The cups are absolutely adorable. Allowed us several moments to settle down. Check-in with us to see if we have any questions.\n\nWe ordered several dishes: the spicy handroll tasting, sake bomb, chicken karaage, oink belly, and shorty glaze. \n\nMUST TRY THE OINK BELLY. This piece of pork melts in your mouth. I sat with amazement when the pork disappeared. It's kind of like a thick chunk of bacon, BUT BETTER. And the presentation was beautiful. ALSO MUST TRY THE SHORTY GLAZE! The large chunk of meat falls right off the bone. The outside is seared and glazed. If just eating in inside of the meat, there is a bite to it, and not quite hitting the \"melt in your mouth\" standard. The piece that's stuck to the bone, was the most flavorful. \n\nThe spicy handroll had three types of fish (tuna, hamachi, sake). I would recommend trying the regular handrolls. We couldn't taste the freshness of the fish because all we could taste was the spiciness. The sake bomb was mediocre. Can never go wrong with salmon and avocado. I will say the presentation was too much. The pink flakes scattered on top of the sushi in a pile was overwhelming. There wasn't a wow factor to the sushi. The chicken karaage was extremely moist. It wasn't as crispy as I thought it would be, but none the less with a squeeze of lemon and the dipping sauce, it was solid. \n\nWould definitely come back again. This would also be a super cute place for a date night!", "rating": 4, "date": "2017-07-30"}, {"excerpts": ["Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n"], "author": "Kassie E.", "review": "COME TO NARA!\n\nFirst time we went the first thing we experienced was the entire staff shouting and getting us. We also noticed the great music that was playing in the background. The ambiance here is fun!\n\nThe food is so good! Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n- Sake Bomb\n- Treasure Island\n\nI have tried a lot more but this is usually what I come in for. They usually have specials written up as well and every time I've tried one it's been pretty good! If you want a casual, yummy, not too expensive, fun, sushi spot, come here!!!!", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["6) Spicy handroll tasting: you get one of each spicy tuna, hamachi and sake. "], "author": "Inga C.", "review": "Overall 3 stars for the great service, fun vibe, and a few tasty dishes (it's tapas style). Just make sure to get the right dishes. I would come back with a big group of friends and get all the plates and drinks that sound good. A sampling below. \n\nRanked in order of deliciousness:\n1) Hamachi truffle: seared yellowtail with jalapeño cilantro and crunch in truffle oil ponzu. It comes in 5 delectable spoons with all the seasonings. You can taste the truffle without it being overpowering. Would get again. \n\n2) (Special on wall) Ray-Ray's Tako - sous vide Spanish octopus with red wine and apple reduction. Cooked just right for chewy texture and a nice sweet-savory glaze. \n\n3) Rice poppers: 4 deep fried sushi rice topped with spicy tuna and white tuna and ranch dressing. It's like a bite-sized Japanese rice ball. Yum. \n\n4) Garlic butter edamame: you just can't go wrong with garlic and butter. Get it. \n\n4) Big boss: yellowtail, tuna, salmon, ikura, avocado, cucumber, radish sprouts. I like it that it's just fish and rice, no fancy toppings needed. The ikura makes this roll.\n\nBelow this - would not get again: \n\n5) Spicy tonkotsu ramen: it's not entirely fair to compare this to ramen-only shops, but this was a real miss. The spiciness overpowered the broth so you couldn't taste the pork flavor. Noodles were stuck together, e.g. what happens when you cook pasta and leave it out to dry w/ no oil. The yolk in the egg seemed al dente but somewhere along the way it fell out of the egg white and was never found again...so can't really comment on that one. \n\n6) Spicy handroll tasting: you get one of each spicy tuna, hamachi and sake. Nothing special. \n\nIf I'm in the area again I'll come back to try  the other dishes.\n\nAtmosphere: it's a fun izakaya / gastropub vibe and it's open late (til 1130p), which is awesome and so rare in SF! \n\nService: super super fast - we were here at 1030p on a Saturday night and the place was about 1/3 full.", "rating": 3, "date": "2015-12-12"}], "maguro tar tar": [{"excerpts": ["Maguro tar tar - another favorite. "], "author": "Samira H.", "review": "This is the best sushi in San Francisco. Me and my boyfriend love everything on the menu (seriously) but there are a few things we can never get enough of. \n\nHamachi truffle - our favorite thing on the menu. We usually get two orders \nMaguro tar tar - another favorite. Kinda like a more delicious poke with pears \nButterfish addiction - sooooo yummy. The Yuzu citrus sorbet is the best one \n\nWe usually also get a couple rolls (the Jessica alba is always delicious) and some hot sake and we're happy!", "rating": 5, "date": "2018-08-09"}, {"excerpts": ["Of the appetizers, hamachi truffle was good, but maguro tar tar was forgettable. "], "author": "Kavita S.", "review": "Came for sushi and sake, and really enjoyed the experience. Not too crowded, even on a Friday. Snagged a table for a large group. \n\nWe had a big group and shared everything, so got to try a lot. We tried the Haight Me (topped with uni, yum!) and a few other rolls, which were all excellent. Rolls were creative, fresh, and moderately priced. Though it was a bit small to share, the black cod was great, and the crispy rice it came with possibly better than the cod itself. Of the appetizers, hamachi truffle was good, but maguro tar tar was forgettable. Oysters were fresh and delicious.\n\nOverall, good, affordably priced meal. We ordered a few house sake carafes and large beers to share, and total including food and drink came out to about $40 per person including tax and tip. Ambience is casual, but nice. Would definitely return!", "rating": 4, "date": "2016-05-27"}, {"excerpts": ["We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\n", "The Heart attack was also really good. ", "I think this one was the one that had fried lotus roots on top. ", "Twas delicious. ", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n"], "author": "Juliana P.", "review": "Nice little Japanese place that recently opened. We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\nThe appetizer was by far the best. 6 pieces, solid 5 stars. The display was simple and beautiful, and the fatty tuna went really well with the asian pear, radish, and avocado.\n\nThe Heart attack was also really good. I think this one was the one that had fried lotus roots on top. Twas delicious. Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\nI would not recommend the Garden Nara. It was not what I expectedly. Probably pretty healthy since it has no rice around it, but tasted like a mini veggie wrap and the taste/ texture did not go well with anything else. \n\nWe were still a bit hungry after 5 rolls because we are fatsos, so we ordered the seafood pancake which was pretty good. Not amazing though and the portion was kinda small.\n\nOverall, my experience was great and I would totally go here again. One thing that was a bit odd was the music. Just a tad strange to be chewing on some raw fish with Beyonce's 7/11 on - but no complaints. Great pop dance music sushi shop. I'd recommend turning it into a dance club after 10p.", "rating": 4, "date": "2015-03-17"}, {"excerpts": ["Walu tataki salad, maguro tar tar, and Shrek for appetizers ! ", "It was just amazing . ", "And shrek is definitely something you have to get !", ":)\n", "Love it here."], "author": "Sol-a M.", "review": "What a lovely restaurant ! I went to nara for my birthday and they perfectly made my day. We (me and 3 girls lol) had hamachi truffle , Walu tataki salad, maguro tar tar, and Shrek for appetizers ! It was just amazing . Especially I liked their hamachi truffle a lot. It served on spoon and the decoration of food was so cute. And shrek is definitely something you have to get !:)\nLove it here.", "rating": 5, "date": "2016-04-18"}], "hamachi truffle": [{"excerpts": ["I've been here before and loved the Hamachi truffle. "], "author": "Angela W.", "review": "This is a very trendy, contemporary sushi restaurant where you can catch up with your girlfriends while drinking sake and eating sushi. They have happy hour here from 5-7 everyday. $2 off draft beers and $5 spicy tuna/salmon handroll. \n\nI've been here before and loved the Hamachi truffle. Pretty average price considering you're in the city. \n\nWould definitely  recommend swinging by if you're in the neighborhood.", "rating": 4, "date": "2018-09-28"}, {"excerpts": ["I want to come back to try some of their more creative dishes, like the hamachi truffle or sushi/fish tacos!"], "author": "Tara A.", "review": "Nara is a pretty hip sushi spot! They have happy hour every day, and a pretty affordable omakase too. I came with my bf for dinner on a Friday, and we split a few dishes beacuse we weren't that hungry.\n\nWe decided to split the 10 piece omakase, the handroll sampler, and miso soup. The omakase was good, although each piece is pretty heavy on wasabi, so be careful if you don't like it haha. The presentation is cool, on a long wooden board. The handroll sampler had good portions of fish to rice ratio and fresh fish! I liked the salmon handroll the best.\n\nService was very friendly. I want to come back to try some of their more creative dishes, like the hamachi truffle or sushi/fish tacos!", "rating": 4, "date": "2018-05-20"}, {"excerpts": ["(loved it, very fresh, only $5 during HH)\n- sake bomb roll (also enjoyed this)\n-  Hamachi truffle (very flavorful and the jalapeno adds a great crunch)\n"], "author": "Micaela I.", "review": "I came here for dinner and right before happy hour (ends at 7 btw) on a Friday and had no trouble getting a table for 2. I really enjoyed this place and the food and atmosphere. \n\nThe BF and I ordered\n- spicy salmon hand roll (loved it, very fresh, only $5 during HH)\n- sake bomb roll (also enjoyed this)\n-  Hamachi truffle (very flavorful and the jalapeno adds a great crunch)\n- Omakase $40 for 10 peace(allll of the fish were fresh and tasted amazing. I don't think there was one where I did not enjoy. The sardine (saba) was my favorite. I actually wished I ordered the 14 piece after having this. \n- Tako (octopus) - Very very tender and not chewy at all \n\nAll the food was amazing and came out quick! If you are ordering a lot, I recommend ordering some, then ordering the rest later so you have time finishing and savoring the food without being in a rush to eat. I also had this peach sake which was yummy (high recommend) \n\nThe service was great and never had to ask for anything because they were always on point. I would definitely come again.", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["We ordered the hamachi truffle, omakase, salmon hand roll, and a sake bomb roll. ", "The hamachi truffle was delicious and flavorful! ", "The salmon handroll was solid, nothing special but still pretty yummy and the sake bomb roll was loaded with delicious ingredients. "], "author": "Phillip V.", "review": "I came in here for happy hour after work on a Friday and it is a great value!! They have a 10-pièce omakase for $40 and a great selection of sales with happy hour deals. We ordered the hamachi truffle, omakase, salmon hand roll, and a sake bomb roll. The hamachi truffle was delicious and flavorful! The omakase was amazing and had such a great variety of flavors of fish! Yum! The salmon handroll was solid, nothing special but still pretty yummy and the sake bomb roll was loaded with delicious ingredients. It was a party in my mouth!!\n\nAll the food was good, but I really enjoyed washing it down with some high-quality sake and I thought it had excellent customers service and a peaceful, yet hip, ambience!\n\nHighly recommend to anyone looking for good Japanese in the Haight and especially if you can make their happy hour!", "rating": 5, "date": "2018-06-22"}, {"excerpts": ["Everything looks super tasty and brought out to us in record time, however lacking in flavor for something as flavorful as the hamachi truffle and ankimo. ", "Which was a shame because As a Chef myself I really want this place to be good and it could be so much better."], "author": "Francis V.", "review": "Everything looks super tasty and brought out to us in record time, however lacking in flavor for something as flavorful as the hamachi truffle and ankimo. Which was a shame because As a Chef myself I really want this place to be good and it could be so much better.", "rating": 3, "date": "2018-10-17"}, {"excerpts": ["Some of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n"], "author": "Vickie Z.", "review": "Long overdue post. And every time I come, my love grows deeper. There is no need for me to get into the details of each dish, as I've tried almost every roll, hot dishes, small/cold dishes, nigiri tasting, and chirashi, and think quality is throughout. Think of Nara as trendy social spot - not really like an izakaya, but somewhere in the middle between that & strictly sushi place because their non-sushi dishes are for sharing & it has a bumpin' and fun atmosphere. \n\nWhen I am craving sushi (but not JUST sushi), I default to this place. When a friend is in town, I take them here. When someone is looking for a rec, I tell them here. \n\nSome of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n- Ocean foie gras \n- Mr Tako balls \n\nFor the quality and taste, you are getting your money's worth. VERY affordable. One of my favorite restaurants in the city.", "rating": 5, "date": "2017-10-16"}, {"excerpts": ["We ordered the hamachi truffle appetizer, Kikumasa Taru sake (super fragrant and sweet cold sake), big boss roll (yums), sake bomb roll, and got a hand roll tasting (toro, bin toro, and sake).\n\n", "The hamachi truffle did not disappoint and was delicious and fresh! ", "They came in 5 spoonfuls of secret sauce (ie. ", "truffle oil ponzu), yellowtail, and jalapeno. ", "The kikumasa taru sake was on the sweeter side which I loved, and had just enough for 3 shots per person (I believe it was around $17 so not bad at all). ", "The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that ", "The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that ", "but the big boss takes the cake IMHO. ", "My favorite of all the dishes, however, were the hand rolls!!! ", "They serve three different types of fish and omgaaaaaahd the fish was so effing fresh and just melts in your mouth. "], "author": "Joy K.", "review": "I loved this place!! From the ambience to the service to, most importantly, THE FOOD, this place hit the nail on the head.\n\nMy friend and I came here on a Saturday night around 7 pm and there was ~a 15-20 minute wait. The server had us put down our name and phone number, and after walking around the neighborhood we got a text letting us know our table was ready. The inside was intimate and dim (great for a date!) but also a bit noisy/lively (also good for people watching!); it was clean, both casual and hip, and they had two bathrooms inside (score). We ordered the hamachi truffle appetizer, Kikumasa Taru sake (super fragrant and sweet cold sake), big boss roll (yums), sake bomb roll, and got a hand roll tasting (toro, bin toro, and sake).\n\nThe hamachi truffle did not disappoint and was delicious and fresh! They came in 5 spoonfuls of secret sauce (ie. truffle oil ponzu), yellowtail, and jalapeno. The kikumasa taru sake was on the sweeter side which I loved, and had just enough for 3 shots per person (I believe it was around $17 so not bad at all). The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that but the big boss takes the cake IMHO. My favorite of all the dishes, however, were the hand rolls!!! They serve three different types of fish and omgaaaaaahd the fish was so effing fresh and just melts in your mouth. If you come here you have to try the hand rolls: the unsung heroes of Nara.\n\nI'd recommend this place for a ladies night out or a second/third date with a special someone (it's a bit loud for a first date you might feel like you're yelling the whole time if there are a bunch of large groups haha). This place had a cool vibe, the servers were super nice and gave us helpful suggestions on what to order, and I believe our total for an appetizer, drinks, roll and one hand roll (there were 3 hand rolls but my friend had 2 while I had 1 because I am a model citizen and superb friend thankyouverymuch) came out to be around $40/per person. Not bad for all the food you get! \n\nI will definitely be coming back to Nara again :)", "rating": 5, "date": "2017-09-30"}, {"excerpts": ["Hamachi truffle is indeed excellent. ", "Grilled yellowtail is overly done. ", "Unagi rolls and other rolls ok. ", "Chef's choice is average. "], "author": "S N.", "review": "Second visit did not feel as fantastic as before. Was turned off by whatever detergent they used to wipe table or clean the floor--odor was strong\n\n\nFoods:3.8, service 3.5, rounded up to 4 stars.\n\nHamachi truffle is indeed excellent. Grilled yellowtail is overly done. Unagi rolls and other rolls ok. Chef's choice is average. Ramen is not recommended--they have two: one spicy and one non spicy.\n\nService: over all not terrible. The server/buzzer lady brought out our orders super quick. Another nice smiling girl is very friendly and helpful. If the waiter would be more attentive and introduce/recommend their items a little more, that would be appreciated. \n\nEnvironment: clean and spacious, good for small party. But they might have used bleach or clorox to clean the kitchen or tables, the chemical odor still lingers. \n\nThis sushi restaurant is a little similar to Pabu but with better sushis and more affordable. Would repeat!", "rating": 3, "date": "2018-06-04"}, {"excerpts": ["Their hamachi truffle shooter things were TO DIE FOR. ", "Like seriously I could die happy now"], "author": "Nina P.", "review": "Amazing service!! The waitress made this such a pleasant experience and the food made it even better. The Jessica Alba roll was mouth watering plus a side of fresh jalapeños made it my new favorite roll. There are so many sushi spots in the city but their selection and service make them at the top of the list. \n\nPs. Their hamachi truffle shooter things were TO DIE FOR. Like seriously I could die happy now", "rating": 5, "date": "2018-05-22"}, {"excerpts": ["The Shrek and Hamachi truffle were spectacular. ", "Prompt service, relaxed atmosphere and great food. ", "Perfect date night spot!"], "author": "Taran S.", "review": "The Shrek and Hamachi truffle were spectacular. Prompt service, relaxed atmosphere and great food. Perfect date night spot!", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["The hamachi truffle is amazing, and the ambience is on point. ", "Friendly service as well. ", "Love this place!"], "author": "Sarah J.", "review": "The hamachi truffle is amazing, and the ambience is on point. Friendly service as well. Love this place!", "rating": 5, "date": "2018-10-17"}, {"excerpts": ["This place has amazing menu, especially the hamachi truffle. ", "After 10pm is extremely good."], "author": "Trang P.", "review": "This place has amazing menu, especially the hamachi truffle. After 10pm is extremely good.", "rating": 5, "date": "2018-08-19"}, {"excerpts": ["Hamachi truffle - our favorite thing on the menu. ", "We usually get two orders \n"], "author": "Samira H.", "review": "This is the best sushi in San Francisco. Me and my boyfriend love everything on the menu (seriously) but there are a few things we can never get enough of. \n\nHamachi truffle - our favorite thing on the menu. We usually get two orders \nMaguro tar tar - another favorite. Kinda like a more delicious poke with pears \nButterfish addiction - sooooo yummy. The Yuzu citrus sorbet is the best one \n\nWe usually also get a couple rolls (the Jessica alba is always delicious) and some hot sake and we're happy!", "rating": 5, "date": "2018-08-09"}, {"excerpts": ["Definitely ordered the hamachi truffle! ", "Everything else is pretty standard for a sushi place. ", "I'm definitely trying to find a time to come back and bring some more friends!"], "author": "Estelle C.", "review": "My friends and I were looking for a spot to continue our Thirsty Thursday shenanigans one night and someone suggested Nara. The ambiance is perfect to get you in the mood to go out and drink! It's dimly lit with a lively crowd, so you don't have to worry about getting a bit rowdy.\n\nEverything we tried was good and we topped it off with beers and a bottle of sake. Definitely ordered the hamachi truffle! Everything else is pretty standard for a sushi place. I'm definitely trying to find a time to come back and bring some more friends!", "rating": 4, "date": "2016-12-14"}, {"excerpts": ["*Hamachi Truffle, yummy and great presentation. \n", "*"], "author": "Sandy B.", "review": "Found a new sushi place I love especially coming back from Japan with sushi withdraw. This place satisfied my cravings. Not your Michelin fancy pant experience but high quality, fresh and delicious sushi. And price is very reasonable. Service was amazing! Exceeded my expectations and made my friend felt super special for her birthday. \n\nHappy Hour is from 5-7pm. $1.50 oysters, and yummy spicy salmon and tuna handroll for $5. Also discounted sake and beer.\n\nHighly Recommended: \n*Hamachi Truffle, yummy and great presentation. \n*10 piece Sushi Omakase - Wow it was delicious!!", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["Hamachi truffle : ", "A MUST TRY! ", "5 pieces of hamachi served in fantastic presentation. ", "Hint of truffle, cilantro, and jalopenos. ", "Loved it. "], "author": "Christy D.", "review": "3.5 stars, love the ambience of this place, and good service. It's nice to be greeted by the chefs when you enter and leave the restaurant :)\n\nShould definitely take advantage of happy hour! 5-7pm. $4 draft beers, $5 Large sakes, $1 raw oysters (not to be mistaken with the other miyagi oysters on the menu Bc the happy hour ones don't come with tamago and scallions). Loved the oysters though! My first time having just lemon juice, tobasco, and ponzu on my oysters. They tasted super clean, and not gritty or dirty. \n\nOther cold and hot plates we tried:\n\n1) Spicy pork buns : good, but was expecting more in taste, pork was a little dry. \n\n2) Hamachi truffle : A MUST TRY! 5 pieces of hamachi served in fantastic presentation. Hint of truffle, cilantro, and jalopenos. Loved it. Probably the best thing I had at Nara's. \n\n3) Hand roll sampler: good choice if you want to try otoro, sake toro, and toro hand rolls for a fairly decent price. Although they were good - I was not impressed in taste or anything. I probably have had too many hand rolls before to think these were amazing or anything. IMO it was lacking the extras like cucumber, scallions or cilantro, and even sauce. A little ponzu wouldn't have hurt. \n\n4) Ray Ray Tako's: meh. It was my least favorite. Basically just cooked octopus with some sweet sauce, some baby tomatoes and radish. Nothing spectacular.\n\n5) also had the edamame which I ordered with spicy butter and garlic butter. It was awesomeeee, wished it was more spicer, but I am a huge lover of garlic, probably the second best thing I had there. \n\nDef a nice sushi restaurant though, I'm glad I dined here! Nara's was definitely one of the better meals I've had in San Fran.", "rating": 3, "date": "2016-06-01"}, {"excerpts": ["We had the hamachi truffle appetizer, the blazing glory, the special K, and the big boss.  ", "They were all delicious!!!  ", "Service was great too.  ", "Ambience is chill but trendy at the same time.  ", "I definitely plan on returning."], "author": "Julia W.", "review": "The food here was excellent.  We had the hamachi truffle appetizer, the blazing glory, the special K, and the big boss.  They were all delicious!!!  Service was great too.  Ambience is chill but trendy at the same time.  I definitely plan on returning.", "rating": 5, "date": "2018-05-22"}, {"excerpts": ["Hamachi truffle is the bomb dot com. ", "Have it to start your night with the miyagi oysters and you won't be disappointed. ", "You must try hamachi truffle and oysters (during hh of course ). ", "Would definitely come back. ", "They definitely catered to me and made me feel special.."], "author": "Jackie N.", "review": "Found the place through Yelp. Love the vibe : good music, modern feel, great service. I came around 6:30 on a weekday and it's definitely not crowded at that time. The restaurant had the daily specials written on the wall which is great. I would highly recommend the bar if your can. You really do see the chefs perfect every dish they make, even Togo boxes dishes. Here is what I got :\n\nMr Tako Balls is a lot more carbs than a typical takoyaki, but then I realize it has truffle mash potato in it. It's not bad, but the carbiness that comes with potatoes can be tasted. \n\nHamachi truffle is the bomb dot com. Have it to start your night with the miyagi oysters and you won't be disappointed. I really like the ponzu they dress over the fish. \n\nThe miyagi oysters are $1 between 5-7 for happy hour  served with lemon and a soy sauce like sauce. Definitely indulge during he happy hours. Surprisingly they are super clean, didn't taste muddy at all. I'm really happy with what they gave me. I will say that the soy sauce does not mix well with the lemon and hot sauce. I would choose one when mixing. \n\nNigiri tasting has 7 fish that the chefs get to choose  I got: hamachi, salmon, golden eye snapper, ocean trout, striped mackerel, yellowtail belly, escolar. Not bad! I can't say that the salmon was super buttery, but you can tell you are getting fresh clean fish. It cost $25 for 7 pieces. Not bad to try if you do not know what fish is good here. \n\nDaily special: live scallop special. Comes with 2 sashimi, 2 nigiri, and 2 tempura pieces. Presentation is on point. It was okay though taste wise, I've had better scallops at other places.\n\nAnkimo nigiri - I had it at Omakase and that's very hard to beat. The ankimo was a little cold and I prefer it warm. Would I pay $8, probably not.\n\nLoco Spider-Man roll was the only roll I got. I see that ppl also get the blazing glory. I would say loco Spider-Man is their take on spider roll. It's different because there is no eel. Rate is a 7/10.  Probably wouldn't get this again. Nothing was special about it. \n\nI give it a 5 for great experience, great food, great pricing, and  happy hour menu. The food is fresh and   I left a happy women. Great for groups. Clean. You must try hamachi truffle and oysters (during hh of course ). Would definitely come back. They definitely catered to me and made me feel special..", "rating": 5, "date": "2016-05-25"}, {"excerpts": ["We had ordered the Hamachi Truffle because I had read the reviews on yelp that it was very popular. ", "I enjoyed the fact that they were on serving spoons. "], "author": "Yen L.", "review": "The food here was delicious! However it was very upscale and bit pricey. \n\nWe missed the happy hour ): but hopefully we can come back to it.\n\nWe had ordered the Hamachi Truffle because I had read the reviews on yelp that it was very popular. I enjoyed the fact that they were on serving spoons. The Hamachi was very fresh by the taste.\n\nI ordered the jalapeño poppers, they had a kick in it because they had put spicy tuna in them! \n\nThe Uni shooters were very good! Inside the shooter was Sake, Uni, quail egg, green onions, and tobiko. \n\nWe had also ordered a bottle of Sake there, which the waitress was kind enough to let us know which ones were good. The bottles were abbot pricey.\n\nThe service there was good because the waitress kept checking in with us and was able to serve our food on time. \n\nParking wasn't too hard to find though it's in a very busy location. We came here on a Wednesday night around 7pm so it wasn't too busy.\n\nDefinitely worth coming back again to try their specials that they have on the wall.", "rating": 5, "date": "2017-03-23"}, {"excerpts": ["Hamachi truffle - 4/5\n", "Spicy Karaage - 2/5\nRice poppers - 4/5\n"], "author": "Mark O.", "review": "Dinner review. \n\nHamachi truffle - 4/5\nSpicy Karaage - 2/5\nRice poppers - 4/5\nNigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\nLoco spiderman - 4/5\nHeart attack - 3/5\nTreasure Island - 4/5\n\nOverall,  \"I'm a fan.\"", "rating": 4, "date": "2015-10-14"}, {"excerpts": ["($50/$70) \n\nI opted for the $50 set, which came with a set of 3 raw appetizers (including the delicious hamachi truffle - one of their most popular dishes), cooked amberjack collar, nigiri/sashimi set (8 total), 6 raw oysters, and choice of dessert (green tea ice cream, creme brulee, or mochi ice cream). "], "author": "Kristina W.", "review": "Delicious omakase at a very reasonable price! ($50/$70) \n\nI opted for the $50 set, which came with a set of 3 raw appetizers (including the delicious hamachi truffle - one of their most popular dishes), cooked amberjack collar, nigiri/sashimi set (8 total), 6 raw oysters, and choice of dessert (green tea ice cream, creme brulee, or mochi ice cream). Everything was delicious & I was so full by the end that it was even a struggle to finish the oysters/dessert. Although I personally thought the sashimi/nigiri quality was not quite at the same level as Kusakabe, Omakase, etc., I would still highly recommend Nara's omakase for its great value!", "rating": 4, "date": "2016-04-26"}, {"excerpts": ["Of the appetizers, hamachi truffle was good, but maguro tar tar was forgettable. "], "author": "Kavita S.", "review": "Came for sushi and sake, and really enjoyed the experience. Not too crowded, even on a Friday. Snagged a table for a large group. \n\nWe had a big group and shared everything, so got to try a lot. We tried the Haight Me (topped with uni, yum!) and a few other rolls, which were all excellent. Rolls were creative, fresh, and moderately priced. Though it was a bit small to share, the black cod was great, and the crispy rice it came with possibly better than the cod itself. Of the appetizers, hamachi truffle was good, but maguro tar tar was forgettable. Oysters were fresh and delicious.\n\nOverall, good, affordably priced meal. We ordered a few house sake carafes and large beers to share, and total including food and drink came out to about $40 per person including tax and tip. Ambience is casual, but nice. Would definitely return!", "rating": 4, "date": "2016-05-27"}, {"excerpts": ["Hamachi Truffle: A-.\n", "Very nicely presented. ", "Strong truffle taste. "], "author": "Simon C.", "review": "Nice addition to the Lower Haight neighborhood! By its name \"Sake Bar\" it should be expected that this is not any traditional izakaya joint - and once you step inside you would totally feel it. Very loud, very hip, vibrant atmosphere; in fact I think the music could have been turned down a bit because I could barely listen to my friend's chatting during the dinner. But anyway, I was very impressed by the food.\n\nMarinated Fried Eggplant: B+.\nNot bad. The eggplant was marinated very well, it has a deep flavor within it. It was only slightly fried which added a sense of crispiness outside of the eggplant.\n\nHamachi Truffle: A-.\nVery nicely presented. Strong truffle taste. Even though this is kind of a carpaccio dish but I could still taste the hamachi freshness. \n\nNigiri Tasting: A.\nThis was a total surprise. I wouldn't have expected such fresh fish in a sake bar restaurant! There were 7pcs, and although the waitress did present what each of those fish was it was too loud that I could hardly hear. All I know is that it was really fresh. This made me believe that the place was actually created with a traditional + hipster fusion Japanese restaurant theme. Order this. You won't be disappointed.\n\nHeart Attack Roll: A-.\nThe main fish was spicy tuna, with some cucumber and topped with toro and some type of chips. Both kinds of fish tasted very nice, the chips were interesting, overall a very good choice in my opinion.\n\nSo yea, good food, great service. Ordered 4 glasses of beer for my friend and myself, turned out to be ~$57+tips per person. Considered the great quality of food I think this was not a bad price at all. Definitely a place to come back especially with a bigger group of friends. If the music can be turned down a little bit when I go next time I will doubtlessly give it a 5-star!", "rating": 4, "date": "2015-04-14"}, {"excerpts": ["The Ramen wasn't fantastic, but their signature Hamachi Truffle crudo with jalapeño is out of this world. "], "author": "Marta V.", "review": "I was a bit skeptical about this place due to the mix reviews I had read, but decided to try it with a group of friends for dinner on a Saturday.\n\nWithout reservations, you usually have to wait specially if you're coming with a big group, but we ended up waiting only 30 minutes. The bright side of this is that Nara is located in a street full of bars and restaurants and is super easy to find a spot to get a drink in the meantime.\n\nWe ordered different rolls, all very good. The Ramen wasn't fantastic, but their signature Hamachi Truffle crudo with jalapeño is out of this world. A must try.\n\nThe bill wasn't expensive for what we are getting used to in the city, and the service pretty good. I definitely recommend this place, good for either a date night or group dinner.", "rating": 4, "date": "2017-01-10"}, {"excerpts": ["We ordered hamachi truffle ( a must ) \nChef nigiri tasting ( each piece seasoned perfectly ) \nRay ray's tako ( a must too)\n\n"], "author": "Jeong Hwan O.", "review": "Hands down for this place !!\nI was in the neighborhood with friends and wanted to try this place ! \n\nGreat atmosphere as I walked in and friendly greeting ! \n\nWe ordered hamachi truffle ( a must ) \nChef nigiri tasting ( each piece seasoned perfectly ) \nRay ray's tako ( a must too)\n\nAnd our server was very nice and attentive !!\n\nMy friends and I had a great experience here\nWe will definitely come back for more !!", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["Recommend : hamachi truffle , nigiri tasting , sake kama, Saba ! ", "Omg their Saba ! ", "Torched and freshly grounded ginger and a yuzu drop ? "], "author": "Amy H.", "review": "There are no words to describe this sushi\nSo fresh and so rich ! Just perfect !\n\nAll of the fish melts in your mouth like butter \nPerfect temperature \nSEAT AT THE BAR!!!!!!!!!!!!!!\n\nWe came for dinner at 7 on Monday and were immediately seated \n\n\nRecommend : hamachi truffle , nigiri tasting , sake kama, Saba ! Omg their Saba ! Torched and freshly grounded ginger and a yuzu drop ? Can eat everyday !!\n\nPeople !! What are you waiting for ?", "rating": 5, "date": "2016-04-21"}, {"excerpts": ["The hamachi truffle is to die for with yellowtail with jalapeno and to top it off with some truffle oil.\n\n"], "author": "Kunal T.", "review": "Solid place with a hipster touch! You have to go here just for the sushi with the pop rocks...a little shock doesn't hurt anyone. It has a darker ambiance with a party vibe to it a lot of people are sake bombing and great staff. The staff are very friendly they scream something every time enters and leaves the restaurant. The Big Boss is everyone's favorite it has : Yellowtail, tuna, salmon, salmon roe, avocado, cucumber and radish sprouts and a very clean and delicious taste to it. The hamachi truffle is to die for with yellowtail with jalapeno and to top it off with some truffle oil.\n\nThe Haight is a great neighborhood with a lot of SF culture and this is a great spot to check out in the area.", "rating": 4, "date": "2015-12-12"}, {"excerpts": ["Hamachi truffle: seared yellowtail with jalapeño cilantro and crunch in truffle oil ponzu. ", "It comes in 5 delectable spoons with all the seasonings. ", "You can taste the truffle without it being overpowering. "], "author": "Inga C.", "review": "Overall 3 stars for the great service, fun vibe, and a few tasty dishes (it's tapas style). Just make sure to get the right dishes. I would come back with a big group of friends and get all the plates and drinks that sound good. A sampling below. \n\nRanked in order of deliciousness:\n1) Hamachi truffle: seared yellowtail with jalapeño cilantro and crunch in truffle oil ponzu. It comes in 5 delectable spoons with all the seasonings. You can taste the truffle without it being overpowering. Would get again. \n\n2) (Special on wall) Ray-Ray's Tako - sous vide Spanish octopus with red wine and apple reduction. Cooked just right for chewy texture and a nice sweet-savory glaze. \n\n3) Rice poppers: 4 deep fried sushi rice topped with spicy tuna and white tuna and ranch dressing. It's like a bite-sized Japanese rice ball. Yum. \n\n4) Garlic butter edamame: you just can't go wrong with garlic and butter. Get it. \n\n4) Big boss: yellowtail, tuna, salmon, ikura, avocado, cucumber, radish sprouts. I like it that it's just fish and rice, no fancy toppings needed. The ikura makes this roll.\n\nBelow this - would not get again: \n\n5) Spicy tonkotsu ramen: it's not entirely fair to compare this to ramen-only shops, but this was a real miss. The spiciness overpowered the broth so you couldn't taste the pork flavor. Noodles were stuck together, e.g. what happens when you cook pasta and leave it out to dry w/ no oil. The yolk in the egg seemed al dente but somewhere along the way it fell out of the egg white and was never found again...so can't really comment on that one. \n\n6) Spicy handroll tasting: you get one of each spicy tuna, hamachi and sake. Nothing special. \n\nIf I'm in the area again I'll come back to try  the other dishes.\n\nAtmosphere: it's a fun izakaya / gastropub vibe and it's open late (til 1130p), which is awesome and so rare in SF! \n\nService: super super fast - we were here at 1030p on a Saturday night and the place was about 1/3 full.", "rating": 3, "date": "2015-12-12"}, {"excerpts": ["Don't miss out on the Hamachi truffle and butterfish! ", "So good my mouth is drooling."], "author": "Ofer G.", "review": "Time and time again this place delivers!\nGreat selection of yummy dishes.\nDon't miss out on the Hamachi truffle and butterfish! So good my mouth is drooling.", "rating": 5, "date": "2016-02-06"}, {"excerpts": ["The happy hour shrimp guac tacos and the hamachi truffle were bomb!!! ", "I think we ordered 12 shrimp guac tacos and a dozen of the oysters! ", "The oysters were as fresh as I expected!!! ", "Better hit this spot for happy hour! ", "We had maybe 5 bottles. ", "The Kikusui and Sawa Sawa were amazing together with the hot sake and Sapporo Black. ", "We've never had hot sake as good as this one! ", "I'm pretty sure they don't microwave it in here!    ", "This is the best restaurant to go to after work because they make you feel so relaxed and taken care of. ", "Thank you for making our experience enjoyable! ", "We will be definitely be back again!"], "author": "Ellise F.", "review": "Service was awesome! Our server, Yumi, was very attentive and helpful. She made sure our table was clean and cleared at all times. The food was to die for! The happy hour shrimp guac tacos and the hamachi truffle were bomb!!! I think we ordered 12 shrimp guac tacos and a dozen of the oysters! The oysters were as fresh as I expected!!! Better hit this spot for happy hour! We had maybe 5 bottles. The Kikusui and Sawa Sawa were amazing together with the hot sake and Sapporo Black. We've never had hot sake as good as this one! I'm pretty sure they don't microwave it in here!    This is the best restaurant to go to after work because they make you feel so relaxed and taken care of. Thank you for making our experience enjoyable! We will be definitely be back again!", "rating": 5, "date": "2017-03-01"}, {"excerpts": ["the boyfriend hamachi truffle appetizer - the ginger creme brulee. ", "What I would get next time - the grilled miso butterfish . ", "I plan to edit this review later--"], "author": "stacie s.", "review": "What a menu with many of my favorite things. When we arrived early in the evening there was no wait that was a great start. Being it's a holiday weekend most of the restaurants  were very crowded and this is worth it for the taxi ride to the Haight.\n The menu was put varied ranging in Specialities for hard core sushi enthusiast as well as those dabbling in Japanese cuisine.  What I ordered bacon skewers with inoiki mushrooms- butterfish addiction appetizer- oysters- lychee saki.  What I loved- the boyfriend hamachi truffle appetizer - the ginger creme brulee. What I would get next time - the grilled miso butterfish . I plan to edit this review later--", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["When it comes to the food we really enjoyed the guacamole shrimp tacos which was part of the happy and the hamachi truffle. ", "The latter wasn't part of the happy hour was definitely worth a try. ", "You will definitely won't be disappointed with this spot!"], "author": "Maurice C.", "review": "So I came I in with my wife for the happy hour from 5pm-7pm. Parking is a bit tricky to find but it shouldn't take more than 10mins. If you end up parking in the surrounding neighborhoods you have a two hour limit which ends at 9pm. Now to the restaurant. Our server Yumi was amazing! Her and her staff were very attentive. The vibe is definitely a fusion-y, hipster spot in the Haight, but we felt right at home. We tried a few drinks and food while we were here. They had a good selection of sake so have fun and try new drinks. When it comes to the food we really enjoyed the guacamole shrimp tacos which was part of the happy and the hamachi truffle. The latter wasn't part of the happy hour was definitely worth a try. You will definitely won't be disappointed with this spot!", "rating": 5, "date": "2017-03-01"}, {"excerpts": ["We (me and 3 girls lol) had hamachi truffle , ", "Especially I liked their hamachi truffle a lot. ", "It served on spoon and the decoration of food was so cute. "], "author": "Sol-a M.", "review": "What a lovely restaurant ! I went to nara for my birthday and they perfectly made my day. We (me and 3 girls lol) had hamachi truffle , Walu tataki salad, maguro tar tar, and Shrek for appetizers ! It was just amazing . Especially I liked their hamachi truffle a lot. It served on spoon and the decoration of food was so cute. And shrek is definitely something you have to get !:)\nLove it here.", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["The Hamachi Truffle is an absolute must. ", "On of the best appetizers I have had yet. ", "It comes in little spoons so perfect to share with the table. "], "author": "Ellinor M.", "review": "New place in the lower haight that has been so desperately needed. Nara is such a great addition and amazing Japanese restaurant. My husband and I stumbled by this place and noticed it for the first time today. They have been open for only 3 weeks and are already bumping on a Saturday night. You are greeted at the door with a \"hi\" in unison by the sushi cooks!\n\nFood was awesome. The Hamachi Truffle is an absolute must. On of the best appetizers I have had yet. It comes in little spoons so perfect to share with the table. In regards to rolls we had the Sake Bomb and the Heart Attack. We also had the chicken karage. All were great!\n\nSo you are so welcome to the neighborhood Nara, we will definitely return!", "rating": 5, "date": "2015-03-07"}, {"excerpts": ["Favorites:\n\nHamachi truffle ponzu special"], "author": "Tianna J.", "review": "Amazing food, and best sushi in the neighborhood. Hands Down.  Service is great, seafood quality is amazing and their sake selection is fantastic.\n\nFavorites:\n\nHamachi truffle ponzu special****\nUnagi roll***\nOysters", "rating": 5, "date": "2015-02-22"}, {"excerpts": ["The hamachi truffle and asari miso soup are legit."], "author": "Steve I.", "review": "Nice to find a delicious sushi spot. I would give it five stars but I like to reserve that for sushi nakazawa type places. The hamachi truffle and asari miso soup are legit.", "rating": 4, "date": "2017-01-10"}, {"excerpts": ["The fish tacos were delicious and Nara took it to a higher level with the Hamachi Truffle and the Special K rolls with butterfish, I hear butterfish is acquired taste with a strange texture to some, I really enjoyed it though. ", "We rounded off the dinner with hot sake and mochi ice cream. ", "A fun experience testing many new things!"], "author": "Jian K.", "review": "Fun sushi experience with various fish and meat to try. I started off with some happy hour oysters and spicy tuna sushi rolls which I found were no more than OK. The fish tacos were delicious and Nara took it to a higher level with the Hamachi Truffle and the Special K rolls with butterfish, I hear butterfish is acquired taste with a strange texture to some, I really enjoyed it though. We rounded off the dinner with hot sake and mochi ice cream. A fun experience testing many new things!", "rating": 5, "date": "2017-02-20"}, {"excerpts": ["loved the appetizer the hamachi truffle (like most people) and shared the omakase and big boss roll with my girlfriend which was the perfect amount of food! ", "they also have an amazing sake selection, i would definitely recommend this place for date night!!"], "author": "Will M.", "review": "this may be the best salmon belly i've ever had...wow super great experience and really fun chefs! recommend sitting at the bar so you can watch the skilled chefs prepare amazing dishes! loved the appetizer the hamachi truffle (like most people) and shared the omakase and big boss roll with my girlfriend which was the perfect amount of food! they also have an amazing sake selection, i would definitely recommend this place for date night!!", "rating": 5, "date": "2017-02-10"}, {"excerpts": ["From the regular menu some favorites include hamachi truffle, garlic butter edamame, chicken karaage (I prefer spicy), \"it's like butter\" (incredible fish dish), hamachi kama, big boss roll, and the ramen. "], "author": "Joseph N.", "review": "This is hands down my favorite spot in the neighborhood and one of my favorite restaurants in the city. The food is excellent and the owner/staff kick so much ass, Nara is always a fun place to be. It's a great place for a meal or a few rounds with good food for accompaniment, and the happy hour is great. \n\nMore detailed review:\n\nFirst things first, the food is excellent. Whether you're in the mood for sushi or something heavier / cooked, Nara's got you covered. The fish is very fresh so it's great as sashimi/nigiri or in their rolls, some of which are incredible. They always have daily specials listed on the board behind the sushi bar that oftentimes sell out.\n\nLast time I was here I had the seven-course omakase, which was an insane amount of food. There were lots of rolls, the kind that come with sauces or are deep fried or have fusion-y ingredients like cream cheese. They were delicious, but I was hoping for some really good simple fresh fish. Just when I thought that wasn't coming, a plate of I think seven types of sashimi was served, followed by seven types of nigiri. There was also salad, a course of cooked fish, miso soup with veggies and seafood, and creme brulee for dessert. I may have missed something else, but my point is it was all top-notch and a lot of food.\n\nFrom the regular menu some favorites include hamachi truffle, garlic butter edamame, chicken karaage (I prefer spicy), \"it's like butter\" (incredible fish dish), hamachi kama, big boss roll, and the ramen. Aside from the soups everything is easy to share, which makes coming here with friends even more fun.\n\nThe atmosphere is awesome here, from the tasteful decor to the friendly and welcoming staff. I've gotten to know some of them, including chefs Kevin and Danny, both a lot of fun and great at what they do. George, one of the servers, is always attentive and friendly. And the owner Sonny, who you'll sometimes see wandering table to table, is an awesome guy who is doing things right with this restaurant.\n\nThere's an izakaya / gastropub vibe here, so even though the food is legit it's also a great place to grab drinks (though no liquor, so don't expect that). They have a few beers on tap and some imported bottles as well as an extensive sake menu. It can be a bit loud but never rowdy, which for me is perfect. They have good playlists to keep the atmosphere upbeat.\n\nIf you live nearby or are looking for a new sushi spot, definitely check this place out!", "rating": 5, "date": "2015-07-21"}, {"excerpts": ["And Hamachi truffle. ", "Must try."], "author": "May Y.", "review": "They have a happy hour everyday $1.50 Miyagi Oyster and $1 off Draft 5-7pm-! And Hamachi truffle. Must try.", "rating": 5, "date": "2015-05-16"}, {"excerpts": ["The hamachi truffle was not bad, though the jalapeno was way too spicy for me. ", "I didn't really care for any of the specialty rolls we tried. ", "Not sure I'd come here again. ", "Maybe if it was late night ", "and I really had a sushi craving as this place is open later than most sushi spots."], "author": "Aleyna S.", "review": "Okay place for late night sushi... Food was hit or miss depending on what you order. The hamachi truffle was not bad, though the jalapeno was way too spicy for me. I didn't really care for any of the specialty rolls we tried. Not sure I'd come here again. Maybe if it was late night and I really had a sushi craving as this place is open later than most sushi spots.", "rating": 2, "date": "2016-01-15"}, {"excerpts": ["First off the Hamachi Truffle appetizer was OUT OF THIS WORLD!! ", "So freaking delicious. ", "Then we had 2 specialty sushi rolls that were good, nothing spectacular that particularly stood out as a must try, but they were certainly yummy. ", "We also had the spicy hand roll sampler and that was good. ", "I really liked the vibe of this place and I would definitely check it out again if I was in the area."], "author": "Amber M.", "review": "I really liked this restaurant! Was visiting San Francisco and I wanted sushi so I looked on Yelp and found this place close to where we were staying. I tried calling for over an hour to make a reservation, but the line was constantly busy, I'm guessing off the hook, so we just hoped for the best and showed up. We came in around 9pm on a Saturday night and there were plenty of people in the restaurant but we didn't have to wait for a table. Our server was a lot of fun, when we first sat down I wanna say he was doing Sake bombs with the table next to us lol. They have beer and wine (no liquor) which is great although they didn't have a single light beer on the menu, I would suggest adding Kirin Light or even something like Bud Light to the drink menu. Anyway the server was very helpful with deciding what to order, although he sort of guided us to order less than we probably would have because he said it was a lot of food, which it wasn't really, but it ended up being just about enough since we were going out drinking anyway and I was glad to not feel super full all night. First off the Hamachi Truffle appetizer was OUT OF THIS WORLD!! So freaking delicious. Then we had 2 specialty sushi rolls that were good, nothing spectacular that particularly stood out as a must try, but they were certainly yummy. We also had the spicy hand roll sampler and that was good. I really liked the vibe of this place and I would definitely check it out again if I was in the area.", "rating": 4, "date": "2015-12-15"}, {"excerpts": ["I particularly enjoyed the hamachi Truffle and the Spider-Man roll! ", "A very great and unique experience for sushi lovers!"], "author": "Parastoo M.", "review": "Very very delicious! I particularly enjoyed the hamachi Truffle and the Spider-Man roll! A very great and unique experience for sushi lovers!", "rating": 5, "date": "2016-01-01"}, {"excerpts": ["The Hamachi truffle dish: AHAMAZING!"], "author": "Dorie S.", "review": "The Hamachi truffle dish: AHAMAZING!", "rating": 4, "date": "2015-08-17"}], "hotate slider": [], "shiro maguro carpaccio": [], "escolar salsa": [{"excerpts": ["Also got the Escolar Salsa (seared butter fish, pico de gallo salsa, lotus chip) - 4 stars.  "], "author": "Raquel Y.", "review": "Pretty good sushi and sake spot on Heights. Came on a Friday night with no wait.  Good selection of nigiri, sashimi, rolls, specials, and izakaya dishes.  There was a bacon wrapped enoki mushroom that caught my eye, but it was $8 for 2 sticks.  So we opted for the $16 hand roll sampler (toro, bin toro, and sake). Good, but nothing impressive. Just wanted good food in our bellies before we pregammed ;) \n\nAlso got the Escolar Salsa (seared butter fish, pico de gallo salsa, lotus chip) - 4 stars.  Had great taste but needed a bigger kick to be 5 stars. \n\nHot sake was $6 for about 6-7 shots. \n\nAtmosphere - fun, hipster, played r&b oldies that you can sing along to.  Not crowded, so I really liked it. \n\nOVERALL - Sure, I would come back and try their other dishes.", "rating": 4, "date": "2015-06-14"}], "butterfish addiction": [{"excerpts": ["For those with more gringo tastes, there are hand rolls and goopy sushi rolls galore, as well as plenty of items which are marked as appetizers but could pass for small entrees, like the butterfish addiction, which was one of my favorites. "], "author": "Vincent L.", "review": "This venue has seen several restaurants come and go over the years, so it's good to see Nara still going strong after 3 years in operation. The offerings here might not be 110% authentic, but the preparation and presentation aren't off the mark, the overall taste is pretty good, the atmosphere lively, and the service friendly. In short: a good place for groups, especially ones with lots of gringos.\n\nSushi connoisseurs will have lots to choose from, whether nigiri or sashimi tastings, or an all-out omakase. For those with more gringo tastes, there are hand rolls and goopy sushi rolls galore, as well as plenty of items which are marked as appetizers but could pass for small entrees, like the butterfish addiction, which was one of my favorites. To add to what's already a good selection of shareable items, they have a nice array of sake and shochu, plus a modest beer and wine assortment.\n\nService is one of their strong points - super friendly, fast, and helpful. Overall, a nice neighborhood go-to for groups large and small.", "rating": 4, "date": "2018-06-11"}, {"excerpts": ["Kinda like a more delicious poke with pears \nButterfish addiction - sooooo yummy. "], "author": "Samira H.", "review": "This is the best sushi in San Francisco. Me and my boyfriend love everything on the menu (seriously) but there are a few things we can never get enough of. \n\nHamachi truffle - our favorite thing on the menu. We usually get two orders \nMaguro tar tar - another favorite. Kinda like a more delicious poke with pears \nButterfish addiction - sooooo yummy. The Yuzu citrus sorbet is the best one \n\nWe usually also get a couple rolls (the Jessica alba is always delicious) and some hot sake and we're happy!", "rating": 5, "date": "2018-08-09"}, {"excerpts": ["What I ordered bacon skewers with inoiki mushrooms- butterfish addiction appetizer- oysters- lychee saki.  ", "What I loved- "], "author": "stacie s.", "review": "What a menu with many of my favorite things. When we arrived early in the evening there was no wait that was a great start. Being it's a holiday weekend most of the restaurants  were very crowded and this is worth it for the taxi ride to the Haight.\n The menu was put varied ranging in Specialities for hard core sushi enthusiast as well as those dabbling in Japanese cuisine.  What I ordered bacon skewers with inoiki mushrooms- butterfish addiction appetizer- oysters- lychee saki.  What I loved- the boyfriend hamachi truffle appetizer - the ginger creme brulee. What I would get next time - the grilled miso butterfish . I plan to edit this review later--", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["The shrek is a joy to uncover and the butterfish addiction is, well, addicting. ", "Definitely worth a trip."], "author": "Guy S.", "review": "Nara is our go-to sushi joint in SF. The food is consistently spectacular, the fish wonderfully fresh and the asahi endlessly cold. I can't recommend the chicken karaage enough, but make sure it is spicy. The shrek is a joy to uncover and the butterfish addiction is, well, addicting. Definitely worth a trip.", "rating": 5, "date": "2017-09-27"}], "walu tataki salad": [{"excerpts": ["Walu tataki salad, maguro tar tar, and Shrek for appetizers ! ", "It was just amazing . ", "And shrek is definitely something you have to get !", ":)\n", "Love it here."], "author": "Sol-a M.", "review": "What a lovely restaurant ! I went to nara for my birthday and they perfectly made my day. We (me and 3 girls lol) had hamachi truffle , Walu tataki salad, maguro tar tar, and Shrek for appetizers ! It was just amazing . Especially I liked their hamachi truffle a lot. It served on spoon and the decoration of food was so cute. And shrek is definitely something you have to get !:)\nLove it here.", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["I highly recommend the Truffle Hamachi and Walu Tataki salad. ", "Nara has some of the freshest sashimi I have had in San Francisco. ", "Chef Kevin cares about the quality of his work, and you can see this from the attention to detail that goes into his Sashimi dishes. ", "The atmosphere at Nara is also great for groups, I have been for a birthday and they definitely know how to help you celebrate. ", "The sushi rolls are great too!"], "author": "Patrick U.", "review": "You can't beat great Sashimi and great Sake, and Nara delivers on both fronts! I highly recommend the Truffle Hamachi and Walu Tataki salad. Nara has some of the freshest sashimi I have had in San Francisco. Chef Kevin cares about the quality of his work, and you can see this from the attention to detail that goes into his Sashimi dishes. The atmosphere at Nara is also great for groups, I have been for a birthday and they definitely know how to help you celebrate. The sushi rolls are great too!", "rating": 5, "date": "2016-07-11"}], "shrek": [{"excerpts": ["Some of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n"], "author": "Vickie Z.", "review": "Long overdue post. And every time I come, my love grows deeper. There is no need for me to get into the details of each dish, as I've tried almost every roll, hot dishes, small/cold dishes, nigiri tasting, and chirashi, and think quality is throughout. Think of Nara as trendy social spot - not really like an izakaya, but somewhere in the middle between that & strictly sushi place because their non-sushi dishes are for sharing & it has a bumpin' and fun atmosphere. \n\nWhen I am craving sushi (but not JUST sushi), I default to this place. When a friend is in town, I take them here. When someone is looking for a rec, I tell them here. \n\nSome of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n- Ocean foie gras \n- Mr Tako balls \n\nFor the quality and taste, you are getting your money's worth. VERY affordable. One of my favorite restaurants in the city.", "rating": 5, "date": "2017-10-16"}, {"excerpts": ["The Shrek and Hamachi truffle were spectacular. ", "Prompt service, relaxed atmosphere and great food. ", "Perfect date night spot!"], "author": "Taran S.", "review": "The Shrek and Hamachi truffle were spectacular. Prompt service, relaxed atmosphere and great food. Perfect date night spot!", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["And the \"Shrek\" which was an avocado with cold shrimp Tempura and funky tasting unfresh crab.\n\n"], "author": "Jack R.", "review": "If you've ever had supermarket sushi and absolutely love it than this place is for you.\n\nWe literally couldn't finish our \"heart attack roll\" which has spicy tuna and o-toro because there was watery and gummy.\n\nWe left if on our plate and it was an absolute waste of $15.\n\nOvercooked spicy tuna rice popper. So I guess the rice is either overcooked or raw LOL.\n\nWe tried two types of toro the salmon and the tuna. Both tasted like a sushi boat.\n\nAnd the \"Shrek\" which was an avocado with cold shrimp Tempura and funky tasting unfresh crab.\n\nService was slow, but the hype is big for this place, thought we're unsure why.\n\nI had to even return the ankimo because it tasted moldy.", "rating": 2, "date": "2017-02-14"}, {"excerpts": ["Shrek is my favorite ! ", "This place does not disappoint. ", "Highly recommended!"], "author": "Chrishel D.", "review": "Probably my favorite sushi spot in SF! Came here a year ago for my first date and it's the perfect dinner spot/ date spot/ place to meet up with friends. Great hip music plays, great service w/ the most nice servers. I have no complaints. Shrek is my favorite ! This place does not disappoint. Highly recommended!", "rating": 5, "date": "2017-10-23"}, {"excerpts": ["We got the Shrek special, which was quite interesting, it was a ball of avocado thinly sliced and filled with shrimp, crab, and fish inside. ", "The shrek ball...", "You better LOVE avocado for this to be fabulous. "], "author": "Amy Y.", "review": "Came to Nara with my bf the other night. The vibe was great, the people are excellent in service. \n\nWe got the Shrek special, which was quite interesting, it was a ball of avocado thinly sliced and filled with shrimp, crab, and fish inside. We also got the big boss roll, and blaze of glory and chicken karage. \n\nLet's break down each dish and see what I've got to say! \n\nBig boss- OH SO PERFECT. The amount of fish inside, the ingredients, the material and the wasabi mixed with soy sauce to top it off. Oh so fabulous. The size was perfect, good amount, quality was good. Perfect. \n\nThe shrek ball...You better LOVE avocado for this to be fabulous. Theres a bit TOO MUCH avocado for this, and I think towards the end we were pretty full, so I didn't enjoy this so much. \n\nWe also got the blaze of glory. It's a beautiful, cool, amazing sushi. The light the side of it with some holes in the foil to let the heat seap in. The fish is great, slight, very rarely cooked. \n\nGreat vibe, great service. Love this place. They charge for tea, which I don't appreciate.", "rating": 4, "date": "2015-12-10"}, {"excerpts": ["Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n"], "author": "Kassie E.", "review": "COME TO NARA!\n\nFirst time we went the first thing we experienced was the entire staff shouting and getting us. We also noticed the great music that was playing in the background. The ambiance here is fun!\n\nThe food is so good! Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n- Sake Bomb\n- Treasure Island\n\nI have tried a lot more but this is usually what I come in for. They usually have specials written up as well and every time I've tried one it's been pretty good! If you want a casual, yummy, not too expensive, fun, sushi spot, come here!!!!", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["I loved the shrek appetizer.  ", "Everything we got was delicious.  ", "It is a bit pricey, but worth it, and worth the experience."], "author": "Nyla K.", "review": "Wow this place is amaze balls.  We were greeted with \"Hashemite!\".  Got sat towards the front and was given this huge saki menu.  Was a bit overwhelming really, so I just asked for the house hot sake.  This place is very trendy and loud and busy and is a really a good atmosphere for dinner before actually going out.  The sushi was great... I loved the shrek appetizer.  Everything we got was delicious.  It is a bit pricey, but worth it, and worth the experience.", "rating": 4, "date": "2017-05-02"}, {"excerpts": ["The Shrek is to die for. ", "The truffle hamachi is a must. ", "The atmosphere is great - sat right down on a Friday. ", "Food comes out quick and they don't rush you out the door. ", "I'll def be back!"], "author": "Darcy C.", "review": "The food is amazing. The Shrek is to die for. The truffle hamachi is a must. The atmosphere is great - sat right down on a Friday. Food comes out quick and they don't rush you out the door. I'll def be back!", "rating": 5, "date": "2018-01-12"}, {"excerpts": ["The edamame and jalapeño poppers were terrific appetizers, and the Shrek was to die for. ", "As far as the Sushi , terrific as well.  ", "Great customer service and atmosphere!"], "author": "Ryan K.", "review": "Nara was phenomenal. We came in from out of town hearing great things, it did not disappoint. The edamame and jalapeño poppers were terrific appetizers, and the Shrek was to die for. As far as the Sushi , terrific as well.  Great customer service and atmosphere!", "rating": 5, "date": "2017-07-22"}, {"excerpts": ["Had the Shrek as appetizer to share with my friend, very tasty!! "], "author": "Rachida I.", "review": "Amazing sushi place! Had the Shrek as appetizer to share with my friend, very tasty!! We also took the loco roll and Treasure Island", "rating": 5, "date": "2015-09-07"}, {"excerpts": ["Walu tataki salad, maguro tar tar, and Shrek for appetizers ! ", "It was just amazing . ", "And shrek is definitely something you have to get !", ":)\n", "Love it here."], "author": "Sol-a M.", "review": "What a lovely restaurant ! I went to nara for my birthday and they perfectly made my day. We (me and 3 girls lol) had hamachi truffle , Walu tataki salad, maguro tar tar, and Shrek for appetizers ! It was just amazing . Especially I liked their hamachi truffle a lot. It served on spoon and the decoration of food was so cute. And shrek is definitely something you have to get !:)\nLove it here.", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["The shrek is a joy to uncover and the butterfish addiction is, well, addicting. ", "Definitely worth a trip."], "author": "Guy S.", "review": "Nara is our go-to sushi joint in SF. The food is consistently spectacular, the fish wonderfully fresh and the asahi endlessly cold. I can't recommend the chicken karaage enough, but make sure it is spicy. The shrek is a joy to uncover and the butterfish addiction is, well, addicting. Definitely worth a trip.", "rating": 5, "date": "2017-09-27"}, {"excerpts": ["Our appetizer the Shrek was fantastic and I would recommend if you love avocado. "], "author": "Elizabeth B.", "review": "Excellent service! The sake recommendation was awesome. Our appetizer the Shrek was fantastic and I would recommend if you love avocado. Loved loved loved the heart attack roll!", "rating": 5, "date": "2016-05-22"}], "blazing glory": [{"excerpts": ["I highly recommend the blazing glory roll. ", "I would come back again."], "author": "Michael T.", "review": "This is a great sushi and sake joint in the Haight. I highly recommend the blazing glory roll. I would come back again.", "rating": 5, "date": "2018-10-25"}, {"excerpts": ["But every single roll we had, even when I was skeptical (i.e. Blazing glory), was so good. ", "I can't remember everything we got ", "but I'll do my best to recall:\n", "Oysters (drool, soo good)\nUni, Sake and scallop nigiri\nSpicy ", "Tuna Taco\n", "Wild mushroom tempura (beyond yummy)\n", "Pork Belly\nRice Poppers\nMiso soup\nJessica Alba Roll\nBlazing Glory\n"], "author": "Sarah H.", "review": "Yum, yum, yum-yum, YUUMMMM!!!\nBest....sushi....ever! We came here with a friend who lives close by and between the four of us got a TON of food which was the right way to go. The thing that puts this place over the top is they a few specialty rolls, and I often find that the specialty rolls are usually filled with tempura, eel sauce, spicy mayo, other sauces, and an excessive amount of roe. But every single roll we had, even when I was skeptical (i.e. Blazing glory), was so good. I can't remember everything we got but I'll do my best to recall:\nOysters (drool, soo good)\nUni, Sake and scallop nigiri\nSpicy Tuna Taco\nWild mushroom tempura (beyond yummy)\nPork Belly\nRice Poppers\nMiso soup\nJessica Alba Roll\nBlazing Glory\nSake Bomb\nVeggie roll\nAvocado roll\n\nDas it", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["They have a roll here named the blazing glory and it sure is blazing and is glorious. ", "4. ", "They reward you for being a good a customer (hot sakeee!)"], "author": "Andie G.", "review": "This place is the bomb dot com. 1. There have celebrity sightings. (Zaza Pachulia, see photo) 2. They are friendly 3. They have a roll here named the blazing glory and it sure is blazing and is glorious. 4. They reward you for being a good a customer (hot sakeee!)", "rating": 5, "date": "2018-01-15"}, {"excerpts": ["We had the hamachi truffle appetizer, the blazing glory, the special K, and the big boss.  ", "They were all delicious!!!  ", "Service was great too.  ", "Ambience is chill but trendy at the same time.  ", "I definitely plan on returning."], "author": "Julia W.", "review": "The food here was excellent.  We had the hamachi truffle appetizer, the blazing glory, the special K, and the big boss.  They were all delicious!!!  Service was great too.  Ambience is chill but trendy at the same time.  I definitely plan on returning.", "rating": 5, "date": "2018-05-22"}, {"excerpts": ["I see that ppl also get the blazing glory. ", "I would say loco Spider-Man is their take on spider roll. ", "It's different because there is no eel. ", "Rate is a 7/10.  ", "Probably wouldn't get this again. "], "author": "Jackie N.", "review": "Found the place through Yelp. Love the vibe : good music, modern feel, great service. I came around 6:30 on a weekday and it's definitely not crowded at that time. The restaurant had the daily specials written on the wall which is great. I would highly recommend the bar if your can. You really do see the chefs perfect every dish they make, even Togo boxes dishes. Here is what I got :\n\nMr Tako Balls is a lot more carbs than a typical takoyaki, but then I realize it has truffle mash potato in it. It's not bad, but the carbiness that comes with potatoes can be tasted. \n\nHamachi truffle is the bomb dot com. Have it to start your night with the miyagi oysters and you won't be disappointed. I really like the ponzu they dress over the fish. \n\nThe miyagi oysters are $1 between 5-7 for happy hour  served with lemon and a soy sauce like sauce. Definitely indulge during he happy hours. Surprisingly they are super clean, didn't taste muddy at all. I'm really happy with what they gave me. I will say that the soy sauce does not mix well with the lemon and hot sauce. I would choose one when mixing. \n\nNigiri tasting has 7 fish that the chefs get to choose  I got: hamachi, salmon, golden eye snapper, ocean trout, striped mackerel, yellowtail belly, escolar. Not bad! I can't say that the salmon was super buttery, but you can tell you are getting fresh clean fish. It cost $25 for 7 pieces. Not bad to try if you do not know what fish is good here. \n\nDaily special: live scallop special. Comes with 2 sashimi, 2 nigiri, and 2 tempura pieces. Presentation is on point. It was okay though taste wise, I've had better scallops at other places.\n\nAnkimo nigiri - I had it at Omakase and that's very hard to beat. The ankimo was a little cold and I prefer it warm. Would I pay $8, probably not.\n\nLoco Spider-Man roll was the only roll I got. I see that ppl also get the blazing glory. I would say loco Spider-Man is their take on spider roll. It's different because there is no eel. Rate is a 7/10.  Probably wouldn't get this again. Nothing was special about it. \n\nI give it a 5 for great experience, great food, great pricing, and  happy hour menu. The food is fresh and   I left a happy women. Great for groups. Clean. You must try hamachi truffle and oysters (during hh of course ). Would definitely come back. They definitely catered to me and made me feel special..", "rating": 5, "date": "2016-05-25"}, {"excerpts": ["We ordered blazing glory rolls and sake bombs. ", "I personally like sake bombs more but my friends like both."], "author": "Elena Z.", "review": "Nice place with fancy food. Happy hour oyster is a must order. We ordered blazing glory rolls and sake bombs. I personally like sake bombs more but my friends like both.", "rating": 4, "date": "2018-05-13"}, {"excerpts": ["Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n"], "author": "Kassie E.", "review": "COME TO NARA!\n\nFirst time we went the first thing we experienced was the entire staff shouting and getting us. We also noticed the great music that was playing in the background. The ambiance here is fun!\n\nThe food is so good! Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n- Sake Bomb\n- Treasure Island\n\nI have tried a lot more but this is usually what I come in for. They usually have specials written up as well and every time I've tried one it's been pretty good! If you want a casual, yummy, not too expensive, fun, sushi spot, come here!!!!", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["I ordered the blazing glory roll. ", "Yum yum!"], "author": "Erica O.", "review": "This restaurant has a cool hip vibe right in the Haight. Fresh fresh fish and well-wrapped rolls. Great happy hour specials too! I ordered the blazing glory roll. Yum yum!", "rating": 5, "date": "2018-06-15"}, {"excerpts": ["Nigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\n"], "author": "Mark O.", "review": "Dinner review. \n\nHamachi truffle - 4/5\nSpicy Karaage - 2/5\nRice poppers - 4/5\nNigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\nLoco spiderman - 4/5\nHeart attack - 3/5\nTreasure Island - 4/5\n\nOverall,  \"I'm a fan.\"", "rating": 4, "date": "2015-10-14"}, {"excerpts": ["Blazing Glory Roll ", "+"], "author": "Brian V.", "review": "Spicy Tuna  +++\n\nBlazing Glory Roll +++\n\nSpicy Chicken Karaage +++\n\n\nGlad we went here.", "rating": 5, "date": "2017-01-10"}, {"excerpts": ["I love the \"Blazing Glory\" role, it comes wrapped in aluminum foil, with a thin line of fire on the side! ", "It burns down by itself and then someone comes back to unwrap it. ", "Love the presentation and the roll itself was delicious."], "author": "Amber L.", "review": "Love the ambiance - modern feel with wooden decor and sake bottles to complete the look, location is great and service is always super friendly! We came on a Friday night and got seated quickly, it's almost Christmas time so everyone was wearing fun Santa hats and reindeer ears, and the Christmas music was great! It was someone's birthday in the restaurant, and how they celebrate is turning the lights down, and putting this fun rap music on and bringing out dessert! It's super fun and everyone in the restaurant got into it. \n\nI love the \"Blazing Glory\" role, it comes wrapped in aluminum foil, with a thin line of fire on the side! It burns down by itself and then someone comes back to unwrap it. Love the presentation and the roll itself was delicious.", "rating": 5, "date": "2016-12-04"}], "haight me": [{"excerpts": ["We tried the Haight Me (topped with uni, yum!) ", "and a few other rolls, which were all excellent. ", "Rolls were creative, fresh, and moderately priced. ", "Though it was a bit small to share, the black cod was great, and the crispy rice it came with possibly better than the cod itself. "], "author": "Kavita S.", "review": "Came for sushi and sake, and really enjoyed the experience. Not too crowded, even on a Friday. Snagged a table for a large group. \n\nWe had a big group and shared everything, so got to try a lot. We tried the Haight Me (topped with uni, yum!) and a few other rolls, which were all excellent. Rolls were creative, fresh, and moderately priced. Though it was a bit small to share, the black cod was great, and the crispy rice it came with possibly better than the cod itself. Of the appetizers, hamachi truffle was good, but maguro tar tar was forgettable. Oysters were fresh and delicious.\n\nOverall, good, affordably priced meal. We ordered a few house sake carafes and large beers to share, and total including food and drink came out to about $40 per person including tax and tip. Ambience is casual, but nice. Would definitely return!", "rating": 4, "date": "2016-05-27"}, {"excerpts": ["We ordered some a la carte nigiri (sake, hon maguro, unagi, amaebi, hotate, uni, and ika) and two rolls, Haight Me and Sake Bomb.\n\n"], "author": "Annie L.", "review": "Food: 1/5\nService: 3/5\nAtmosphere: 4/5\n\nI really don't understand how a restaurant like this can have an overall 4.5 stars rating. We ordered some a la carte nigiri (sake, hon maguro, unagi, amaebi, hotate, uni, and ika) and two rolls, Haight Me and Sake Bomb.\n\nLet me just tell you, I've NEVER had sushi this SALTY in my life. I don't understand how the seasoning can be this off. I think it could be that they marinate their fish such as sake and ika in salt, but the over-saltiness wasn't just in the fish. The main problem was the seasoning in their rice. It almost tasted like someone accidentally poured a bucket of salt in the rice or something.\n\nThe second problem was that all the ingredients were NOT FRESH. Their uni was probably the worst uni I've put in my mouth, it had such weird flavor and bitter taste. It takes a lot for an uni fanatic like me to leave a piece of uni nigiri on the table. It was that bad! Not to mention all of their other fish were meh. They really didn't taste fresh at all.\n\nThe third problem was that the flavors were quite off in the rolls. It could be the over-seasoning of the rice, stale ingredients, their sauces, or the combination of everything, but I just couldn't eat all of them even though I was at the restaurant with a huge craving of sushi and appetite.\n\nI really wanted to like this place, the Korean staff are nice and the atmosphere is quite nice, too. I think the quality of food is the most important factor in a restaurant, though, and for that reason, this restaurant gets the lowest possible rating I could give and I will never be back here.", "rating": 1, "date": "2016-01-08"}], "the fillmore": [{"excerpts": ["My favorite roll was the Fillmore.  "], "author": "Kimberly L.", "review": "Yum!  We came here for a quick bite on a Sunday.   We started with pork buns, salad and the Special K and Fillmore rolls. \n\nWe sat at the bar which was nice because we got to witness Chef Kevin creating each roll by hand.  The service was actually pretty fast.  It was a fun experience because when our orders were done, we were simply handed the serving dishes.\n\nMy favorite roll was the Fillmore.  The sauce that was poured on top was special.  \n\nI think most Japanese restaurants serve sushi pretty fast and don't really put much effort into creating each dish but that's what I really liked about this spot... So much attention to detail. \n\nWould totally recommend it!", "rating": 4, "date": "2017-01-07"}], "loco spider roll": [{"excerpts": ["I don't think you can go wrong with any of their rolls, but I'd highly recommend the Special K, Loco Spider Roll, and Sake Bomb. ", "Looking forward to trying more!"], "author": "Kelly R.", "review": "Nara is an exceptionally good neighborhood sushi spot.\n\nWhile sashimi and nigiri here are both pretty good, Nara's specialty rolls make this spot really stand out. They're unique and creative, and all the ones I've tried have nailed it on flavor, texture, freshness, and presentation.\n\nI don't think you can go wrong with any of their rolls, but I'd highly recommend the Special K, Loco Spider Roll, and Sake Bomb. Looking forward to trying more!", "rating": 5, "date": "2017-12-15"}, {"excerpts": ["three rolls (Loco Spider Roll, Heart Attack, and Big Boss) and the tea. ", "All were excellent. ", "Love the Loco Spider roll especially (such crispy battered crab). ", "Prices were very fair. ", "Hope to be back!!"], "author": "Mikey J.", "review": "My favorite sushi place in San Francisco so far! Wow, what a great experience and value. The ambiance is modern yet relaxed, with wood tones throughout. Service is peppy and welcoming, love it. We had edamame, three rolls (Loco Spider Roll, Heart Attack, and Big Boss) and the tea. All were excellent. Love the Loco Spider roll especially (such crispy battered crab). Prices were very fair. Hope to be back!!", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["*Loco Spider Roll - Huge", ", I'm always a fan of multiple fish assortments in a roll. "], "author": "Arron E.", "review": "I had a unique yet very refreshing experience here. Came in on a rainy day and as soon as we walk in the staff greets us in unison. Now I didn't understand what they said... But I'm sure it was some form of saying \"Welcome\" but of course in Japanese. We get seated, the ambience is nice. I thought the interior was nice even from the outside. Inside its dark, wooden tables which create a rustic vibe, but the rest of the restaurant looks modern, Very neat and spaced out. Another thing I noticed was the music that was playing. For me, it really set the scene for a great dinner. The playlist was creative and entertaining. Now I'm a fan of hip hop, rnb, edm... And it was a mixture of all, and appropriate of course. It's something different and the choice of music was great because it doesn't always work when you have an employee picking the playlist. \n\nAnyways as for the food, we had a couple rolls and appetizers. The wait wasn't long at all and the waitress was helpful. The rolls we tried were...\n\n*Heart Attack - a lot of finesse on this dish. The tuna looked fresh, no doubting the quality. The garnish was impressive, and the roll was delicious. \n\n*Loco Spider Roll - Huge, I'm always a fan of multiple fish assortments in a roll. Soft shell crab was crispy, almost like getting a appetizer on top of the roll. \n\n*Treasure Roll - Deep fried and cream cheese is always a killer combo. They used real crab meat on which I appreciate instead of imitation. And the fresh tuna packed inside for the perfect size roll. \n\nFood now isn't just all about taste, it's also about presentation. People say you eat with your eyes, and eating here, I wasn't sure if it was my eyes or my stomach that was more satisfied. I feel like the chefs here understand how complex the elements of food. It's an Art, it's takes finesse, but it's also a science and understanding what works well together. It's very hard to paint a picture on a plate and even harder to make it taste good at the same time. It's very easy to mess that up. Complements to the chefs here because they got it done. I was also able to speak to the one  managers and he was very genuine and he appreciated our feedback. As for the whole dinning experience as a whole, it was a perfect night. I still can't get over the music selection. The food was phenomenal, service exceptional, and the prices are fair. The combination of all of the things above put this restaurant as one of my top sushi favorites!", "rating": 5, "date": "2015-09-21"}, {"excerpts": ["We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. ", "The winner was the sake bomb roll all around. ", "The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. ", "It was extremely busy during that time though. ", "Nevertheless, I would recommend coming back here! ", "Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. ", "Try them if you get a chance!"], "author": "Kathleen T.", "review": "I've been here a couple of times and I have had good experiences during all occasions. Most recently, I made a reservation for 8pm with a large group without any issue. We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. The winner was the sake bomb roll all around. The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. It was extremely busy during that time though. Nevertheless, I would recommend coming back here! Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. Try them if you get a chance!", "rating": 4, "date": "2017-02-09"}, {"excerpts": ["We had calamari, Jessica Alba roll and the Loco Spider roll, all of which were worth the price."], "author": "Dylan L.", "review": "Great sushi, nice staff, decor and vibe. A bit pricey but not too surprising for SF. We had calamari, Jessica Alba roll and the Loco Spider roll, all of which were worth the price.", "rating": 4, "date": "2015-09-07"}], "jessica alba roll": [{"excerpts": ["Pork Belly\nRice Poppers\nMiso soup\nJessica Alba Roll\nBlazing Glory\n"], "author": "Sarah H.", "review": "Yum, yum, yum-yum, YUUMMMM!!!\nBest....sushi....ever! We came here with a friend who lives close by and between the four of us got a TON of food which was the right way to go. The thing that puts this place over the top is they a few specialty rolls, and I often find that the specialty rolls are usually filled with tempura, eel sauce, spicy mayo, other sauces, and an excessive amount of roe. But every single roll we had, even when I was skeptical (i.e. Blazing glory), was so good. I can't remember everything we got but I'll do my best to recall:\nOysters (drool, soo good)\nUni, Sake and scallop nigiri\nSpicy Tuna Taco\nWild mushroom tempura (beyond yummy)\nPork Belly\nRice Poppers\nMiso soup\nJessica Alba Roll\nBlazing Glory\nSake Bomb\nVeggie roll\nAvocado roll\n\nDas it", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["Despite its exceptionally tasteless name, the \"Jessica Alba Roll\" is actually very tasty, possibly among my favorites in SF thus far. ", "That roll, in and of itself, is a four-and-a-half star item. "], "author": "John L.", "review": "Despite its exceptionally tasteless name, the \"Jessica Alba Roll\" is actually very tasty, possibly among my favorites in SF thus far. That roll, in and of itself, is a four-and-a-half star item. My friend had a veggie roll, which he remarked was certainly among the best he's ever had.\n\nThe Omakase -- a ten-piece Nigiri sampler -- was on the weaker side of things; certainly weaker than comparable samplers at Ozumo or Otoro. It featured mostly the lower-quality and less interesting fish, with only one piece of tuna. I inquired as to the variety of the tuna, but didn't get a straight answer. There was, of course, no Toro on that platter.\n\nI'm a little disappointed to have to give them three stars. I expect that I may give them four on the next visit if I stick to rolls, which seemed stronger in quality. I do note that they do mostly more modern/American-style rolls, with fewer traditional-style rolls on the menu. (For example, I didn't see a Kappa or a Tekka Maki anywhere.)", "rating": 3, "date": "2018-05-06"}, {"excerpts": ["The Jessica Alba roll was mouth watering plus a side of fresh jalapeños made it my new favorite roll. "], "author": "Nina P.", "review": "Amazing service!! The waitress made this such a pleasant experience and the food made it even better. The Jessica Alba roll was mouth watering plus a side of fresh jalapeños made it my new favorite roll. There are so many sushi spots in the city but their selection and service make them at the top of the list. \n\nPs. Their hamachi truffle shooter things were TO DIE FOR. Like seriously I could die happy now", "rating": 5, "date": "2018-05-22"}, {"excerpts": ["The Jessica Alba roll blew my mind. ", "The Loco Spider-Man roll goes great with the killer crock sauce."], "author": "Melissa G.", "review": "This place is dopppppe. The Jessica Alba roll blew my mind. The Loco Spider-Man roll goes great with the killer crock sauce.", "rating": 5, "date": "2018-07-13"}, {"excerpts": ["Friend and I ordered two nigiri tastings, a handroll tasting, and the Jessica Alba roll (shrimp tempura topped with albacore.) ", "The handroll tasting was delicious! ", "I loved the toro one. ", "Fish felt fresh and flavorful. "], "author": "Christina G.", "review": "Good happy hour vibe. Came here for dinner on a Thursday night and there was no wait in line, but the place was almost filled up. There is bar seating and tables, and it's dimly lit. A tv showing the Giants game was airing in the background. \n\nFriend and I ordered two nigiri tastings, a handroll tasting, and the Jessica Alba roll (shrimp tempura topped with albacore.) The handroll tasting was delicious! I loved the toro one. Fish felt fresh and flavorful. The nigiri tasting was good but didn't blow me away. A couple of the pieces had a bit too much wasabi for my liking. It did not look as fancy as some of the pics I saw on yelp. \n\nOverall I enjoyed my experience here. Quality sushi, lively atmosphere, and good service. Too bad I came too late for the happy hour deals, but $1 oyster sure sounds good.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["My favorite being the oysters and the Jessica Alba roll. \n", "Ambience is modern with wooden tables and bench chairs along the wall. ", "Seems to be a good place to catch up with friends over their sake and beer menu."], "author": "Patricia S.", "review": "Walked in on Saturday night and a table for two was ready in about 5 minutes. We ordered warm sake, oysters, and a few rolls. Their menu is not that extensive but they have specials on the board above the sushi bar. Everything was really delicious. My favorite being the oysters and the Jessica Alba roll. \nAmbience is modern with wooden tables and bench chairs along the wall. Seems to be a good place to catch up with friends over their sake and beer menu.", "rating": 5, "date": "2016-05-08"}, {"excerpts": ["We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. ", "The winner was the sake bomb roll all around. ", "The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. ", "It was extremely busy during that time though. ", "Nevertheless, I would recommend coming back here! ", "Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. ", "Try them if you get a chance!"], "author": "Kathleen T.", "review": "I've been here a couple of times and I have had good experiences during all occasions. Most recently, I made a reservation for 8pm with a large group without any issue. We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. The winner was the sake bomb roll all around. The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. It was extremely busy during that time though. Nevertheless, I would recommend coming back here! Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. Try them if you get a chance!", "rating": 4, "date": "2017-02-09"}, {"excerpts": ["I had the Jessica alba roll and it was the best and most fresh sushi I've had in a while. ", "Can't wait to come back!"], "author": "Kristina S.", "review": "Loved the atmosphere and the food was even better. I had the Jessica alba roll and it was the best and most fresh sushi I've had in a while. Can't wait to come back!", "rating": 5, "date": "2017-02-24"}, {"excerpts": ["Tako balls - Perfection\nJessica Alba roll - very good; recommended\nLoco Spiderman Roll - a little heavy on the creamy sauce but still very good\nSpicy tuna hand roll - ate this to kill time while waiting for other stuff; decent\nBlack cod - impossibly small portion but served with a tasty mushroom medley\nJalapeno poppers - Very good\nChicken karage - "], "author": "Jay S.", "review": "This place comes up when you search \"izakaya\" but I wouldn't consider it a true izakaya; the menu is too limited and the presentation style and portion size is too small.  Some dishes are too small for even the best of friends to share--maybe two bites.  \n\nThis is a beef of mine about SF in general: there are all these restaurants that mimic the portion size and presentation of fine dining but aren't preparing food at that level-they're serving the same ingredients with the same preparation as everyone else, you just get less of it.  I'm not fooled!  I would much rather have the unpretentious presentation style and portion size of my local izakaya if you're just going to serve me the exact same quality of food. \n\nWe had very little sushi since we came there in an \"izakaya mood\" but the food we had was mostly good.  Service isn't very good.  Our waitress was friendly and reasonably attentive but they just seemed a little overworked. \n\nAnyway, the small menu still had some great picks and there was enough there to keep us happy:\n\nBacon wrapped skewers - seemed like a winner, particularly the cherry tomato ones.\nAgedashi tofu - hard to mess this up; it was decent\nHouse salad - passable\nCalamari - totally bland, tiny portion; top 3 worst calamari dishes i've ever had.\nTako balls - Perfection\nJessica Alba roll - very good; recommended\nLoco Spiderman Roll - a little heavy on the creamy sauce but still very good\nSpicy tuna hand roll - ate this to kill time while waiting for other stuff; decent\nBlack cod - impossibly small portion but served with a tasty mushroom medley\nJalapeno poppers - Very good\nChicken karage - I didnt eat this but others seems to enjoy it\nSake kama - only ordered this because they were out of the hamachi kama; enjoyed it\n\nAbove complaints aside, everything was reasonable and I would eat here again.", "rating": 4, "date": "2015-11-23"}, {"excerpts": ["We had calamari, Jessica Alba roll and the Loco Spider roll, all of which were worth the price."], "author": "Dylan L.", "review": "Great sushi, nice staff, decor and vibe. A bit pricey but not too surprising for SF. We had calamari, Jessica Alba roll and the Loco Spider roll, all of which were worth the price.", "rating": 4, "date": "2015-09-07"}, {"excerpts": ["Sat at the bar and ordered the jessica alba roll and a rainbow roll- ", "they were delicious and so FRESH! ", "The ambiance is nice and getting there is fairly easy, although it took me a little to figure out where it was (in the dark.) ", "it had good reviews on Yelp!", ", so I decided to try it out ", "and I was not disappointed. ", "I am definitely coming back. ", "Thanks to the chefs. ", "The food tasted great!"], "author": "Reyna V.", "review": "My first time here and it was so good! Sat at the bar and ordered the jessica alba roll and a rainbow roll- they were delicious and so FRESH! The ambiance is nice and getting there is fairly easy, although it took me a little to figure out where it was (in the dark.) it had good reviews on Yelp!, so I decided to try it out and I was not disappointed. I am definitely coming back. Thanks to the chefs. The food tasted great!", "rating": 5, "date": "2015-09-17"}], "sake bomb": [{"excerpts": ["(loved it, very fresh, only $5 during HH)\n- sake bomb roll (also enjoyed this)\n-  Hamachi truffle (very flavorful and the jalapeno adds a great crunch)\n"], "author": "Micaela I.", "review": "I came here for dinner and right before happy hour (ends at 7 btw) on a Friday and had no trouble getting a table for 2. I really enjoyed this place and the food and atmosphere. \n\nThe BF and I ordered\n- spicy salmon hand roll (loved it, very fresh, only $5 during HH)\n- sake bomb roll (also enjoyed this)\n-  Hamachi truffle (very flavorful and the jalapeno adds a great crunch)\n- Omakase $40 for 10 peace(allll of the fish were fresh and tasted amazing. I don't think there was one where I did not enjoy. The sardine (saba) was my favorite. I actually wished I ordered the 14 piece after having this. \n- Tako (octopus) - Very very tender and not chewy at all \n\nAll the food was amazing and came out quick! If you are ordering a lot, I recommend ordering some, then ordering the rest later so you have time finishing and savoring the food without being in a rush to eat. I also had this peach sake which was yummy (high recommend) \n\nThe service was great and never had to ask for anything because they were always on point. I would definitely come again.", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["Server was super helpful & kind (suggested a sake bomb roll, it was amazing!! ", "Fish was fresh & delicious.) ", "We're definitely coming back."], "author": "Jade N.", "review": "Feels really cozy with the dark wood & warm light! Server was super helpful & kind (suggested a sake bomb roll, it was amazing!! Fish was fresh & delicious.) We're definitely coming back.", "rating": 5, "date": "2018-10-21"}, {"excerpts": ["Sake Bomb\nVeggie roll\n"], "author": "Sarah H.", "review": "Yum, yum, yum-yum, YUUMMMM!!!\nBest....sushi....ever! We came here with a friend who lives close by and between the four of us got a TON of food which was the right way to go. The thing that puts this place over the top is they a few specialty rolls, and I often find that the specialty rolls are usually filled with tempura, eel sauce, spicy mayo, other sauces, and an excessive amount of roe. But every single roll we had, even when I was skeptical (i.e. Blazing glory), was so good. I can't remember everything we got but I'll do my best to recall:\nOysters (drool, soo good)\nUni, Sake and scallop nigiri\nSpicy Tuna Taco\nWild mushroom tempura (beyond yummy)\nPork Belly\nRice Poppers\nMiso soup\nJessica Alba Roll\nBlazing Glory\nSake Bomb\nVeggie roll\nAvocado roll\n\nDas it", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["We ordered the hamachi truffle, omakase, salmon hand roll, and a sake bomb roll. ", "The hamachi truffle was delicious and flavorful! ", "The salmon handroll was solid, nothing special but still pretty yummy and the sake bomb roll was loaded with delicious ingredients. "], "author": "Phillip V.", "review": "I came in here for happy hour after work on a Friday and it is a great value!! They have a 10-pièce omakase for $40 and a great selection of sales with happy hour deals. We ordered the hamachi truffle, omakase, salmon hand roll, and a sake bomb roll. The hamachi truffle was delicious and flavorful! The omakase was amazing and had such a great variety of flavors of fish! Yum! The salmon handroll was solid, nothing special but still pretty yummy and the sake bomb roll was loaded with delicious ingredients. It was a party in my mouth!!\n\nAll the food was good, but I really enjoyed washing it down with some high-quality sake and I thought it had excellent customers service and a peaceful, yet hip, ambience!\n\nHighly recommend to anyone looking for good Japanese in the Haight and especially if you can make their happy hour!", "rating": 5, "date": "2018-06-22"}, {"excerpts": ["I don't think you can go wrong with any of their rolls, but I'd highly recommend the Special K, Loco Spider Roll, and Sake Bomb. ", "Looking forward to trying more!"], "author": "Kelly R.", "review": "Nara is an exceptionally good neighborhood sushi spot.\n\nWhile sashimi and nigiri here are both pretty good, Nara's specialty rolls make this spot really stand out. They're unique and creative, and all the ones I've tried have nailed it on flavor, texture, freshness, and presentation.\n\nI don't think you can go wrong with any of their rolls, but I'd highly recommend the Special K, Loco Spider Roll, and Sake Bomb. Looking forward to trying more!", "rating": 5, "date": "2017-12-15"}, {"excerpts": ["Some of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n"], "author": "Vickie Z.", "review": "Long overdue post. And every time I come, my love grows deeper. There is no need for me to get into the details of each dish, as I've tried almost every roll, hot dishes, small/cold dishes, nigiri tasting, and chirashi, and think quality is throughout. Think of Nara as trendy social spot - not really like an izakaya, but somewhere in the middle between that & strictly sushi place because their non-sushi dishes are for sharing & it has a bumpin' and fun atmosphere. \n\nWhen I am craving sushi (but not JUST sushi), I default to this place. When a friend is in town, I take them here. When someone is looking for a rec, I tell them here. \n\nSome of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n- Ocean foie gras \n- Mr Tako balls \n\nFor the quality and taste, you are getting your money's worth. VERY affordable. One of my favorite restaurants in the city.", "rating": 5, "date": "2017-10-16"}, {"excerpts": ["We ordered the hamachi truffle appetizer, Kikumasa Taru sake (super fragrant and sweet cold sake), big boss roll (yums), sake bomb roll, and got a hand roll tasting (toro, bin toro, and sake).\n\n", "The hamachi truffle did not disappoint and was delicious and fresh! ", "They came in 5 spoonfuls of secret sauce (ie. ", "truffle oil ponzu), yellowtail, and jalapeno. ", "The kikumasa taru sake was on the sweeter side which I loved, and had just enough for 3 shots per person (I believe it was around $17 so not bad at all). ", "The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that ", "The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that ", "but the big boss takes the cake IMHO. ", "My favorite of all the dishes, however, were the hand rolls!!! ", "They serve three different types of fish and omgaaaaaahd the fish was so effing fresh and just melts in your mouth. "], "author": "Joy K.", "review": "I loved this place!! From the ambience to the service to, most importantly, THE FOOD, this place hit the nail on the head.\n\nMy friend and I came here on a Saturday night around 7 pm and there was ~a 15-20 minute wait. The server had us put down our name and phone number, and after walking around the neighborhood we got a text letting us know our table was ready. The inside was intimate and dim (great for a date!) but also a bit noisy/lively (also good for people watching!); it was clean, both casual and hip, and they had two bathrooms inside (score). We ordered the hamachi truffle appetizer, Kikumasa Taru sake (super fragrant and sweet cold sake), big boss roll (yums), sake bomb roll, and got a hand roll tasting (toro, bin toro, and sake).\n\nThe hamachi truffle did not disappoint and was delicious and fresh! They came in 5 spoonfuls of secret sauce (ie. truffle oil ponzu), yellowtail, and jalapeno. The kikumasa taru sake was on the sweeter side which I loved, and had just enough for 3 shots per person (I believe it was around $17 so not bad at all). The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that but the big boss takes the cake IMHO. My favorite of all the dishes, however, were the hand rolls!!! They serve three different types of fish and omgaaaaaahd the fish was so effing fresh and just melts in your mouth. If you come here you have to try the hand rolls: the unsung heroes of Nara.\n\nI'd recommend this place for a ladies night out or a second/third date with a special someone (it's a bit loud for a first date you might feel like you're yelling the whole time if there are a bunch of large groups haha). This place had a cool vibe, the servers were super nice and gave us helpful suggestions on what to order, and I believe our total for an appetizer, drinks, roll and one hand roll (there were 3 hand rolls but my friend had 2 while I had 1 because I am a model citizen and superb friend thankyouverymuch) came out to be around $40/per person. Not bad for all the food you get! \n\nI will definitely be coming back to Nara again :)", "rating": 5, "date": "2017-09-30"}, {"excerpts": ["We ordered several dishes: the spicy handroll tasting, sake bomb, chicken karaage, oink belly, and shorty glaze. \n\n", "The sake bomb was mediocre. ", "Can never go wrong with salmon and avocado. ", "I will say the presentation was too much. ", "The pink flakes scattered on top of the sushi in a pile was overwhelming. ", "There wasn't a wow factor to the sushi. ", "The chicken karaage was extremely moist. "], "author": "Teresa C.", "review": "Delicious food paired with an excellent atmosphere. \n\nOn a Saturday night, I came around 7PM and seated at the booth (for better photo lighting). Within the next 15 minutes, the place filled up. The walls are filled with large sake bottles, and the wooden planks on the walls gives the environment a very modern feel. \n\nService: Right when we were seated, the server brought a glass jug of water and cups. The cups are absolutely adorable. Allowed us several moments to settle down. Check-in with us to see if we have any questions.\n\nWe ordered several dishes: the spicy handroll tasting, sake bomb, chicken karaage, oink belly, and shorty glaze. \n\nMUST TRY THE OINK BELLY. This piece of pork melts in your mouth. I sat with amazement when the pork disappeared. It's kind of like a thick chunk of bacon, BUT BETTER. And the presentation was beautiful. ALSO MUST TRY THE SHORTY GLAZE! The large chunk of meat falls right off the bone. The outside is seared and glazed. If just eating in inside of the meat, there is a bite to it, and not quite hitting the \"melt in your mouth\" standard. The piece that's stuck to the bone, was the most flavorful. \n\nThe spicy handroll had three types of fish (tuna, hamachi, sake). I would recommend trying the regular handrolls. We couldn't taste the freshness of the fish because all we could taste was the spiciness. The sake bomb was mediocre. Can never go wrong with salmon and avocado. I will say the presentation was too much. The pink flakes scattered on top of the sushi in a pile was overwhelming. There wasn't a wow factor to the sushi. The chicken karaage was extremely moist. It wasn't as crispy as I thought it would be, but none the less with a squeeze of lemon and the dipping sauce, it was solid. \n\nWould definitely come back again. This would also be a super cute place for a date night!", "rating": 4, "date": "2017-07-30"}, {"excerpts": [", I'd order again\nSake bomb roll & Jessica Alba Roll- "], "author": "Arezou A.", "review": "I think I just found my new go-to sushi spot in the Haight. Affordable sushi, fast service, and delicious food!\n\nChef's choice sashimi- always a gamble getting sashimi at a new sushi place. Will it be good? Are you about to have really poor quality fish? But my friend and I both agreed, holy shit all the fish we had was amazing. The quality reminded me of Daigo in the avenues. The rolls were good\n\n\nRice poppers- good, not very healthy of us but fried yumminess.\nHamachi truffle- bomb, I'd order again\nSake bomb roll & Jessica Alba Roll- both were good, but man, I think I'd just order more sashimi tbh.\n\nThe appetizers and sashimi are definitely the highlights of Nara. The interior is sleek, the ambiance is trendy and very group friendly. Also definitely drop by for HH if you're in the area!", "rating": 4, "date": "2017-11-15"}, {"excerpts": ["Loco Spider-Man Roll and Sake Bomb Roll are must-haves. ", "The Spicy Pork Buns as an appetizer are great too! ", "Check this place out right by Fillmore Street."], "author": "Chris K.", "review": "Phenomenal sushi. Loco Spider-Man Roll and Sake Bomb Roll are must-haves. The Spicy Pork Buns as an appetizer are great too! Check this place out right by Fillmore Street.", "rating": 5, "date": "2018-07-12"}, {"excerpts": ["Sake bomb roll  ", "the host noticed us right away when we entered, very nice waiters when we were indecisive"], "author": "Victor R.", "review": "The butter for truffle is to die for  highly recommended. Sake bomb roll  the host noticed us right away when we entered, very nice waiters when we were indecisive", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["And sake bomb roll was also tasty. ", "Will be back :)"], "author": "Samantha B.", "review": "Got the omaksase--10 pieces for $35. Most were great, some were aight. Friend got karaage chicken. Quite tasty. Great service!! And sake bomb roll was also tasty. Will be back :)", "rating": 4, "date": "2018-05-11"}, {"excerpts": ["- Sake Bomb\n- Treasure Island\n\n"], "author": "Kassie E.", "review": "COME TO NARA!\n\nFirst time we went the first thing we experienced was the entire staff shouting and getting us. We also noticed the great music that was playing in the background. The ambiance here is fun!\n\nThe food is so good! Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n- Sake Bomb\n- Treasure Island\n\nI have tried a lot more but this is usually what I come in for. They usually have specials written up as well and every time I've tried one it's been pretty good! If you want a casual, yummy, not too expensive, fun, sushi spot, come here!!!!", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["We ordered the tempora appetizer, sake bomb roll, big boss roll, and some nigiris. ", "I was very happy with the quality of food and how delicious everything is. ", "Pricing is very fair, especially for this neighborhood "], "author": "Elizabeth T.", "review": "Stumbled across this place while exploring the Lower Haight and on my way over to check out Ricky Bobby. I'm so glad the decor here caught my eye because I loved everything I put in my mouth here!\n\nWe ordered the tempora appetizer, sake bomb roll, big boss roll, and some nigiris. I was very happy with the quality of food and how delicious everything is. Pricing is very fair, especially for this neighborhood and I was happy with the portions we received.\n\nI happen to be cutting out alcohol at the moment but I loved their ample selection of sake and very affordable sampler options. This place would be perfect for a small group of friends to split a huge sake bottle for a chill night.\n\nI love how this place is right across from an awesome bar, Noc Noc, which makes this the perfect dinner and pregame stop for the night.\n\nThis is definitely my new go-to stop and default sushi restaurant in San Francisco.", "rating": 5, "date": "2015-03-21"}, {"excerpts": ["We ordered the sake bomb, loco spiderman roll,  3 pieces of sake, tonkotsu ramen, miyabi oysters, and spicy salmon roll. ", "My favorite was the Miyabi oysters. ", "They're definitely a good deal during happy hour for only $1.50 each! ", "Super fresh and tasty. ", "I expected more from the sushi rolls but was disappointed :("], "author": "Sophie L.", "review": "Friendly service, hipster atmosphere, creative sushi rolls. We ordered the sake bomb, loco spiderman roll,  3 pieces of sake, tonkotsu ramen, miyabi oysters, and spicy salmon roll. My favorite was the Miyabi oysters. They're definitely a good deal during happy hour for only $1.50 each! Super fresh and tasty. I expected more from the sushi rolls but was disappointed :(", "rating": 4, "date": "2017-10-27"}, {"excerpts": ["We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\n", "The Heart attack was also really good. ", "I think this one was the one that had fried lotus roots on top. ", "Twas delicious. ", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n"], "author": "Juliana P.", "review": "Nice little Japanese place that recently opened. We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\nThe appetizer was by far the best. 6 pieces, solid 5 stars. The display was simple and beautiful, and the fatty tuna went really well with the asian pear, radish, and avocado.\n\nThe Heart attack was also really good. I think this one was the one that had fried lotus roots on top. Twas delicious. Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\nI would not recommend the Garden Nara. It was not what I expectedly. Probably pretty healthy since it has no rice around it, but tasted like a mini veggie wrap and the taste/ texture did not go well with anything else. \n\nWe were still a bit hungry after 5 rolls because we are fatsos, so we ordered the seafood pancake which was pretty good. Not amazing though and the portion was kinda small.\n\nOverall, my experience was great and I would totally go here again. One thing that was a bit odd was the music. Just a tad strange to be chewing on some raw fish with Beyonce's 7/11 on - but no complaints. Great pop dance music sushi shop. I'd recommend turning it into a dance club after 10p.", "rating": 4, "date": "2015-03-17"}, {"excerpts": ["I got the spicy tuna handroll for the happy hour and the sake bomb roll. ", "Both were good! ", "The oysters were fresh as well. ", "Also make sure to ask about special menu items as they have new ones daily and you don't want to miss out on those"], "author": "Eugene O.", "review": "Great swanky sushi spot in the Haight. Nice interior. We got here around 6pm and there was no wait so we immediately got to ordering and eating! The happy hour items are pretty good, $1.50 oysters or $5 hand rolls any time from 5-7 pm. I got the spicy tuna handroll for the happy hour and the sake bomb roll. Both were good! The oysters were fresh as well. Also make sure to ask about special menu items as they have new ones daily and you don't want to miss out on those", "rating": 5, "date": "2017-11-03"}, {"excerpts": ["We ordered some a la carte nigiri (sake, hon maguro, unagi, amaebi, hotate, uni, and ika) and two rolls, Haight Me and Sake Bomb.\n\n"], "author": "Annie L.", "review": "Food: 1/5\nService: 3/5\nAtmosphere: 4/5\n\nI really don't understand how a restaurant like this can have an overall 4.5 stars rating. We ordered some a la carte nigiri (sake, hon maguro, unagi, amaebi, hotate, uni, and ika) and two rolls, Haight Me and Sake Bomb.\n\nLet me just tell you, I've NEVER had sushi this SALTY in my life. I don't understand how the seasoning can be this off. I think it could be that they marinate their fish such as sake and ika in salt, but the over-saltiness wasn't just in the fish. The main problem was the seasoning in their rice. It almost tasted like someone accidentally poured a bucket of salt in the rice or something.\n\nThe second problem was that all the ingredients were NOT FRESH. Their uni was probably the worst uni I've put in my mouth, it had such weird flavor and bitter taste. It takes a lot for an uni fanatic like me to leave a piece of uni nigiri on the table. It was that bad! Not to mention all of their other fish were meh. They really didn't taste fresh at all.\n\nThe third problem was that the flavors were quite off in the rolls. It could be the over-seasoning of the rice, stale ingredients, their sauces, or the combination of everything, but I just couldn't eat all of them even though I was at the restaurant with a huge craving of sushi and appetite.\n\nI really wanted to like this place, the Korean staff are nice and the atmosphere is quite nice, too. I think the quality of food is the most important factor in a restaurant, though, and for that reason, this restaurant gets the lowest possible rating I could give and I will never be back here.", "rating": 1, "date": "2016-01-08"}, {"excerpts": ["I got the sake bomb roll ", "and it was yummy!"], "author": "Magola A.", "review": "Really nice place with a cool vibe! Food is great I got the sake bomb roll and it was yummy!", "rating": 5, "date": "2017-10-25"}, {"excerpts": ["We got Special K and Sake Bomb rolls and found them to be tasty, serendipitous, and flavorful. ", "The cuisine had a non-lackadaisical energy that enthralled my taste buds. ", "My girlfriend found the experience both exemplary, ephemeral, and a night to savor."], "author": "Shana C.", "review": "Great decor and excellent sushi. I went with my girlfriend at 6:30pm and had no problem. We got Special K and Sake Bomb rolls and found them to be tasty, serendipitous, and flavorful. The cuisine had a non-lackadaisical energy that enthralled my taste buds. My girlfriend found the experience both exemplary, ephemeral, and a night to savor.", "rating": 5, "date": "2017-09-14"}, {"excerpts": ["Sake Bomb: ", "Very good, no jalapeno as noted, must remember to request without the tobiko. ", "(little fish eggs)\n"], "author": "Marcela M.", "review": "Sake Bomb: Very good, no jalapeno as noted, must remember to request without the tobiko. (little fish eggs)\nTreasure Island: Good, except it was supposed to have jalapeno and either they forgot or didn't have them because there was no spice whatsoever on these.\nGarlic Butter Edamame: IMO, best part of the meal.\nMiso: sub-par. It was tepid and seemed to be separating, which means it was old and almost ruined the meal for me. If the miso isn't good, the rest is questionable. \nOverall I did go late in the evening right before close so everyone must have been eager to leave and they skimped on quality. The waitress was not very friendly and bordered on rude.", "rating": 3, "date": "2015-12-03"}, {"excerpts": ["Nara is the place to go for fun vibes, creative food, and maybe a sake bomb or two!"], "author": "Ashley T.", "review": "Nara is a great place to come with big groups, whether it's for happy hour or just a meal. They have a great variety of food, from traditional sushi rolls to more Korean fusion steam buns. I was pleasantly surprised by the quality of fish - one of my favorites is the Big Boss Roll which mixes yellowtail, tuna, and salmon that is then paired with sprouts, avocado and cucumber. If you want something heartier, their ramen is decent and they also offer an array of specials, from wagyu steak to hamachi kama. Nara is the place to go for fun vibes, creative food, and maybe a sake bomb or two!", "rating": 4, "date": "2016-05-05"}, {"excerpts": ["In regards to rolls we had the Sake Bomb and the Heart Attack. ", "We also had the chicken karage. "], "author": "Ellinor M.", "review": "New place in the lower haight that has been so desperately needed. Nara is such a great addition and amazing Japanese restaurant. My husband and I stumbled by this place and noticed it for the first time today. They have been open for only 3 weeks and are already bumping on a Saturday night. You are greeted at the door with a \"hi\" in unison by the sushi cooks!\n\nFood was awesome. The Hamachi Truffle is an absolute must. On of the best appetizers I have had yet. It comes in little spoons so perfect to share with the table. In regards to rolls we had the Sake Bomb and the Heart Attack. We also had the chicken karage. All were great!\n\nSo you are so welcome to the neighborhood Nara, we will definitely return!", "rating": 5, "date": "2015-03-07"}, {"excerpts": ["The Sake Bomb roll was amazing (super spicy but yummy) and the pork buns & unagi were on HIT!! ", "The presentation was also pretty. ", "My boyfriend and I were watching him make sushi the whole time ", "and Woah does this dude have amazing cutting and rolling precision. ", "The vibes in the restaurant are super chill, fresh and hip. ", "The staff is really friendly and accomadating as well. ", "The prices are not bad either. ", "They do play top 40 while you eat your food ", "but it's so tasty that you don't pay attention to anything else. ", "We are definitely making this our new go to sushi spot!"], "author": "Nicole D.", "review": "This place is HELLA good! Chef Kevin hooked it up with some of the best Sushi we have had in a while. (we are def going to try and sit in front of his station again when we come back) The Sake Bomb roll was amazing (super spicy but yummy) and the pork buns & unagi were on HIT!! The presentation was also pretty. My boyfriend and I were watching him make sushi the whole time and Woah does this dude have amazing cutting and rolling precision. The vibes in the restaurant are super chill, fresh and hip. The staff is really friendly and accomadating as well. The prices are not bad either. They do play top 40 while you eat your food but it's so tasty that you don't pay attention to anything else. We are definitely making this our new go to sushi spot!", "rating": 5, "date": "2015-11-21"}, {"excerpts": ["Sake Bomb - my favorite!!!!\n\n"], "author": "Candace D.", "review": "HOLY COW! Sweet baby Jesus! This place is amazing. This has become our favorite sushi spot! \n\n$1/oyster! The miyagi oysters and the soy dressing is insane...yup...ate 24 of them! \n\nHimachi truffle is the bomb! Must order this!\n\nKatsu salad- I want to bathe in that house made dressing goodness.\n\nBig Boss - big boss...\n\nSake Bomb - my favorite!!!!\n\nMiso soup - Soooooo goooood\n\nNigiri sushi in general - superb!!\n\nService - A+\n\nI love you Nara. See you next week (or tomorrow)", "rating": 5, "date": "2016-02-26"}, {"excerpts": ["I ordered what was called the Sake Bomb roll and an order of their Spicy Edamame to have with my roll, not as an appetizer. ", "Right after ordering a waitress brought me a glass and bottle of water. ", "She left the bottle of water to refill it at my own pleasure with me. ", "I drink a lot of water when I go out to restaurants ", "so I was already enjoying my service at this point. ", "My roll was riveting, tasted like that feeling of getting exactly what you want after working more than you needed to in a day. ", "I ate the potato chips on top of it before actually eating the roll so that the salt from the chips wouldn't mask the flavor of the sushi. ", "I was happy about that decision because the roll was flavorful to say the least. ", "The dash of jalapeno in it went really well with the eel sauce drizzled on the plate. ", "If you like a bit of spicy in your sushi, definitely get the Sake Bomb. ", "The Spicy Edamame was a nice addition too: generously portioned, well cooked, buttery, and enough kick in them that you want to grab another after each bite. ", "I should also note that all the chef's at the bar were super personable, willing to strike a conversation at any time, one was even singing along to the music playing my entire time there. "], "author": "Shayan S.", "review": "After just moving to the city recently, I've been on a constant prowl for the best sushi at an affordable price here. Wow did Nara set the bar high, absolutely loved my food and experience here.\n\nI came in for a late dinner after doing some extra reading at a coffee shop nearby after work. Immediately I was taken aback because all the workers there shouted something at me in unison. At first I thought it was closed and they were telling me to leave because I couldn't understand any of it, but I later found out it's their way of welcoming all their customers. I loved the tradition. Pretty dark in the seating foray, very well lit at the bar (which is where I sat). The music playlist was on point, it's like they know exactly what you want to listen to when you're eating sushi. They also had a TV, although it's a tad of an awkward angle to see from the bar.\n\nI ordered what was called the Sake Bomb roll and an order of their Spicy Edamame to have with my roll, not as an appetizer. Right after ordering a waitress brought me a glass and bottle of water. She left the bottle of water to refill it at my own pleasure with me. I drink a lot of water when I go out to restaurants so I was already enjoying my service at this point. My roll was riveting, tasted like that feeling of getting exactly what you want after working more than you needed to in a day. I ate the potato chips on top of it before actually eating the roll so that the salt from the chips wouldn't mask the flavor of the sushi. I was happy about that decision because the roll was flavorful to say the least. The dash of jalapeno in it went really well with the eel sauce drizzled on the plate. If you like a bit of spicy in your sushi, definitely get the Sake Bomb. The Spicy Edamame was a nice addition too: generously portioned, well cooked, buttery, and enough kick in them that you want to grab another after each bite. I should also note that all the chef's at the bar were super personable, willing to strike a conversation at any time, one was even singing along to the music playing my entire time there. Huge appreciation for Kevin who gave me free persimmons after my meal, really nice guy. \n\nThe same way they greet you in unison, they thank you in unison as you're leaving too. I'm happy to live only a few blocks away, will definitely be coming back whenever I work more than I need to again.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["-we ordered three rolls: Sake bomb, heart attack, and big boss. ", "If you're a fish lover, the big boss is for you. "], "author": "Katy C.", "review": "Haven't really been around this area but I loved the decor inside the restaurant. Immediately walked in and got a huge welcome from all the staff. Came in with a group of 3 with reservations at 8. Not many people around this time on a Friday night but got pretty packed around 9. Prices not too bad. \n\nThings we got:\n-Hamachi truffle appetizer was amazing. Was extremely happy with every spoonful.\n-Desperaso with butter fish was not worth it. 4 pieces and lots of decorative additions but took away from the fish.\n-Half dozen oysters for $11. Extremely refreshing. \n-Chicken karage was pretty great. Comes in spicy version and not spicy. We got the non-spicy which comes with a ranch like sauce and a spicy mayo. Saw the spicy version at the table next to us and it looked pretty good.\n-Vegetable tempura was light but literally one piece of each vegetable listed from the menu.\n-we ordered three rolls: Sake bomb, heart attack, and big boss. If you're a fish lover, the big boss is for you. Rolls were pretty tiny and not that impressive. \n\nOverall: rolls weren't really worth it. Will try the Nigri instead. Awesome music but it was really loud and I had to yell over the music and other customers to have a conversation.  I'm giving it a 4 for great customer service and decor.", "rating": 4, "date": "2015-05-29"}, {"excerpts": ["We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. ", "The winner was the sake bomb roll all around. ", "The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. ", "It was extremely busy during that time though. ", "Nevertheless, I would recommend coming back here! ", "Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. ", "Try them if you get a chance!"], "author": "Kathleen T.", "review": "I've been here a couple of times and I have had good experiences during all occasions. Most recently, I made a reservation for 8pm with a large group without any issue. We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. The winner was the sake bomb roll all around. The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. It was extremely busy during that time though. Nevertheless, I would recommend coming back here! Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. Try them if you get a chance!", "rating": 4, "date": "2017-02-09"}, {"excerpts": ["i usually don't order those large sushi rolls that have a lot of stuff going on, but I ordered the sake bomb here ", "and it was really good ", "- it had seared salmon, fresh salmon, spicy sauce, and crunchy crumbs.  "], "author": "Yin L.", "review": "I thought the sushi was very good.  Both the hirame and salmon nigiri were fantastic.  Fish was very fresh, rice had the right amount of flavor, wasn't clumpy, and was at the right temperature. i usually don't order those large sushi rolls that have a lot of stuff going on, but I ordered the sake bomb here and it was really good - it had seared salmon, fresh salmon, spicy sauce, and crunchy crumbs.  the seared salmon just added an extra flavor that was delicious.\n\nThe tonkatsu ramen was meh.  Not a lot of depth to the flavor, especially compared to dedicated ramen places.\n\nsound level was super loud, and they kept switching songs every 10 seconds or so while I was there, so that wasn't great.  I would probably come here regularly if it wasn't for the noise, because the sushi is good.", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["The food is delicious (e.g, sliders, pork buns, spider roll, sake bomb roll, oysters) and the service is fantastic. ", "The sake samplers are perfect for those who aren't aficionados."], "author": "Sebastian C.", "review": "I've been twice (so far) and both experiences were great. The food is delicious (e.g, sliders, pork buns, spider roll, sake bomb roll, oysters) and the service is fantastic. The sake samplers are perfect for those who aren't aficionados.", "rating": 5, "date": "2015-05-24"}], "heart attack": [{"excerpts": ["We literally couldn't finish our \"heart attack roll\" which has spicy tuna and o-toro because there was watery and gummy.\n\n"], "author": "Jack R.", "review": "If you've ever had supermarket sushi and absolutely love it than this place is for you.\n\nWe literally couldn't finish our \"heart attack roll\" which has spicy tuna and o-toro because there was watery and gummy.\n\nWe left if on our plate and it was an absolute waste of $15.\n\nOvercooked spicy tuna rice popper. So I guess the rice is either overcooked or raw LOL.\n\nWe tried two types of toro the salmon and the tuna. Both tasted like a sushi boat.\n\nAnd the \"Shrek\" which was an avocado with cold shrimp Tempura and funky tasting unfresh crab.\n\nService was slow, but the hype is big for this place, thought we're unsure why.\n\nI had to even return the ankimo because it tasted moldy.", "rating": 2, "date": "2017-02-14"}, {"excerpts": ["Loco spiderman - 4/5\nHeart attack - 3/5\n"], "author": "Mark O.", "review": "Dinner review. \n\nHamachi truffle - 4/5\nSpicy Karaage - 2/5\nRice poppers - 4/5\nNigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\nLoco spiderman - 4/5\nHeart attack - 3/5\nTreasure Island - 4/5\n\nOverall,  \"I'm a fan.\"", "rating": 4, "date": "2015-10-14"}, {"excerpts": ["Heart Attack Roll: ", "A-.\n", "The main fish was spicy tuna, with some cucumber and topped with toro and some type of chips. "], "author": "Simon C.", "review": "Nice addition to the Lower Haight neighborhood! By its name \"Sake Bar\" it should be expected that this is not any traditional izakaya joint - and once you step inside you would totally feel it. Very loud, very hip, vibrant atmosphere; in fact I think the music could have been turned down a bit because I could barely listen to my friend's chatting during the dinner. But anyway, I was very impressed by the food.\n\nMarinated Fried Eggplant: B+.\nNot bad. The eggplant was marinated very well, it has a deep flavor within it. It was only slightly fried which added a sense of crispiness outside of the eggplant.\n\nHamachi Truffle: A-.\nVery nicely presented. Strong truffle taste. Even though this is kind of a carpaccio dish but I could still taste the hamachi freshness. \n\nNigiri Tasting: A.\nThis was a total surprise. I wouldn't have expected such fresh fish in a sake bar restaurant! There were 7pcs, and although the waitress did present what each of those fish was it was too loud that I could hardly hear. All I know is that it was really fresh. This made me believe that the place was actually created with a traditional + hipster fusion Japanese restaurant theme. Order this. You won't be disappointed.\n\nHeart Attack Roll: A-.\nThe main fish was spicy tuna, with some cucumber and topped with toro and some type of chips. Both kinds of fish tasted very nice, the chips were interesting, overall a very good choice in my opinion.\n\nSo yea, good food, great service. Ordered 4 glasses of beer for my friend and myself, turned out to be ~$57+tips per person. Considered the great quality of food I think this was not a bad price at all. Definitely a place to come back especially with a bigger group of friends. If the music can be turned down a little bit when I go next time I will doubtlessly give it a 5-star!", "rating": 4, "date": "2015-04-14"}, {"excerpts": ["three rolls (Loco Spider Roll, Heart Attack, and Big Boss) and the tea. ", "All were excellent. ", "Love the Loco Spider roll especially (such crispy battered crab). ", "Prices were very fair. ", "Hope to be back!!"], "author": "Mikey J.", "review": "My favorite sushi place in San Francisco so far! Wow, what a great experience and value. The ambiance is modern yet relaxed, with wood tones throughout. Service is peppy and welcoming, love it. We had edamame, three rolls (Loco Spider Roll, Heart Attack, and Big Boss) and the tea. All were excellent. Love the Loco Spider roll especially (such crispy battered crab). Prices were very fair. Hope to be back!!", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\n", "The Heart attack was also really good. ", "I think this one was the one that had fried lotus roots on top. ", "Twas delicious. ", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n"], "author": "Juliana P.", "review": "Nice little Japanese place that recently opened. We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\nThe appetizer was by far the best. 6 pieces, solid 5 stars. The display was simple and beautiful, and the fatty tuna went really well with the asian pear, radish, and avocado.\n\nThe Heart attack was also really good. I think this one was the one that had fried lotus roots on top. Twas delicious. Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\nI would not recommend the Garden Nara. It was not what I expectedly. Probably pretty healthy since it has no rice around it, but tasted like a mini veggie wrap and the taste/ texture did not go well with anything else. \n\nWe were still a bit hungry after 5 rolls because we are fatsos, so we ordered the seafood pancake which was pretty good. Not amazing though and the portion was kinda small.\n\nOverall, my experience was great and I would totally go here again. One thing that was a bit odd was the music. Just a tad strange to be chewing on some raw fish with Beyonce's 7/11 on - but no complaints. Great pop dance music sushi shop. I'd recommend turning it into a dance club after 10p.", "rating": 4, "date": "2015-03-17"}, {"excerpts": ["*Heart Attack - a lot of finesse on this dish. ", "The tuna looked fresh, no doubting the quality. "], "author": "Arron E.", "review": "I had a unique yet very refreshing experience here. Came in on a rainy day and as soon as we walk in the staff greets us in unison. Now I didn't understand what they said... But I'm sure it was some form of saying \"Welcome\" but of course in Japanese. We get seated, the ambience is nice. I thought the interior was nice even from the outside. Inside its dark, wooden tables which create a rustic vibe, but the rest of the restaurant looks modern, Very neat and spaced out. Another thing I noticed was the music that was playing. For me, it really set the scene for a great dinner. The playlist was creative and entertaining. Now I'm a fan of hip hop, rnb, edm... And it was a mixture of all, and appropriate of course. It's something different and the choice of music was great because it doesn't always work when you have an employee picking the playlist. \n\nAnyways as for the food, we had a couple rolls and appetizers. The wait wasn't long at all and the waitress was helpful. The rolls we tried were...\n\n*Heart Attack - a lot of finesse on this dish. The tuna looked fresh, no doubting the quality. The garnish was impressive, and the roll was delicious. \n\n*Loco Spider Roll - Huge, I'm always a fan of multiple fish assortments in a roll. Soft shell crab was crispy, almost like getting a appetizer on top of the roll. \n\n*Treasure Roll - Deep fried and cream cheese is always a killer combo. They used real crab meat on which I appreciate instead of imitation. And the fresh tuna packed inside for the perfect size roll. \n\nFood now isn't just all about taste, it's also about presentation. People say you eat with your eyes, and eating here, I wasn't sure if it was my eyes or my stomach that was more satisfied. I feel like the chefs here understand how complex the elements of food. It's an Art, it's takes finesse, but it's also a science and understanding what works well together. It's very hard to paint a picture on a plate and even harder to make it taste good at the same time. It's very easy to mess that up. Complements to the chefs here because they got it done. I was also able to speak to the one  managers and he was very genuine and he appreciated our feedback. As for the whole dinning experience as a whole, it was a perfect night. I still can't get over the music selection. The food was phenomenal, service exceptional, and the prices are fair. The combination of all of the things above put this restaurant as one of my top sushi favorites!", "rating": 5, "date": "2015-09-21"}, {"excerpts": ["We ordered the House warm sake (highly recommend), Heart Attack Roll, It's Like Butter Baby Cod, 2 pieces of sake (raw salmon), tempura, and ginger creme brulee / avocado chocolate mousse. ", "The Heart Attack was pretty spicy and was just okay. ", "The cod was my absolute favorite dish of the night, it was perfectly cooked and oh-so-flakey. ", "Just the way cod should be. ", "The raw salmon was pretty fresh but not the best I've had. ", "The tempura was great - highly recommend as an appetizer to share. ", "The desserts were 3 stars, nothing very complex to make and not a must have. "], "author": "Claudia C.", "review": "The decor is very modern and comfortable, and the service is even better. Nara is one of my favorite Japanese-style joints in SF because of its well-roundedness :)\n\nWe sat at the bar and all of the sushi chefs genuinely looked happy to be there. I enjoyed everything we ordered and thought the prices were perfect. We ordered the House warm sake (highly recommend), Heart Attack Roll, It's Like Butter Baby Cod, 2 pieces of sake (raw salmon), tempura, and ginger creme brulee / avocado chocolate mousse. The Heart Attack was pretty spicy and was just okay. The cod was my absolute favorite dish of the night, it was perfectly cooked and oh-so-flakey. Just the way cod should be. The raw salmon was pretty fresh but not the best I've had. The tempura was great - highly recommend as an appetizer to share. The desserts were 3 stars, nothing very complex to make and not a must have. The ginger creme brulee barely had any ginger taste, and the avocado chocolate mousse was a bit hard - should be much creamier especially when using avocado.\n\nAll in all, I would recommend Nara in a heartbeat to anyone looking for good Japanese food! I will definitely be a regular here.", "rating": 5, "date": "2015-09-18"}, {"excerpts": ["The heart attack and treasure island rolls were delicious. \n\n"], "author": "Shireen J.", "review": "I wish I could give this place 5 stars but the service wasn't so great so had to deduct a star. \n\nThe sushi is amazing. So creative, fresh, and beautifully presented. The vibe of this place is great as well. \n\nThe nigiri and sashimi tastings were excellent. The butterfish tasting was mind blowing. The handroll tasting was good but not the best. The heart attack and treasure island rolls were delicious. \n\nEverything is so well presented and I was pleasantly surprised by how fresh the fish was. \n\nMy new favorite place. If only the servers start paying more attention and not leave us waiting next time.", "rating": 4, "date": "2015-12-01"}, {"excerpts": ["We had the chirashi, pork belly and \"heart attack\" roll. \n\n"], "author": "Marek B.", "review": "Meh. The food was over-dressed and not amazingly cooked. We had the chirashi, pork belly and \"heart attack\" roll. \n\nPork belly declared that it was 24 hour slow cooked, and I expected it to be soft as butter but it was actually tough. It seems like the easiest thing to get right, oh well. \n\nEverything looked fancy enough but it all tasted pretty boring andoverly salted. \n\nAlso, don't come here looking for Japanese style sushi, it's definitely very californianized.", "rating": 2, "date": "2016-03-31"}, {"excerpts": ["In regards to rolls we had the Sake Bomb and the Heart Attack. ", "We also had the chicken karage. "], "author": "Ellinor M.", "review": "New place in the lower haight that has been so desperately needed. Nara is such a great addition and amazing Japanese restaurant. My husband and I stumbled by this place and noticed it for the first time today. They have been open for only 3 weeks and are already bumping on a Saturday night. You are greeted at the door with a \"hi\" in unison by the sushi cooks!\n\nFood was awesome. The Hamachi Truffle is an absolute must. On of the best appetizers I have had yet. It comes in little spoons so perfect to share with the table. In regards to rolls we had the Sake Bomb and the Heart Attack. We also had the chicken karage. All were great!\n\nSo you are so welcome to the neighborhood Nara, we will definitely return!", "rating": 5, "date": "2015-03-07"}, {"excerpts": ["MAINS\n- Heart Attack - good tuna ", "but could have been spicier.\n"], "author": "Ryan R.", "review": "This place is a good first date spot. Even though I feel it's technically in The Haight but it says Hayes Valley. We had the following dishes:\n\nDRINK\n- Alradin / Unfiltered Sake - Not too sweet or bitter, Very good.\n\nSTARTERS\n- Wakame Salad - Very fresh & good\n- Edamame - love the rock salt (could have been hotter)\n- Korean Pork Buns - Very spicy (and I like spice) but very good.\n\nMAINS\n- Heart Attack - good tuna but could have been spicier.\n- Treasure Island - My favorite - Crispy outside and the cream cheese filling... sooo good!\n\nAll together, the bill was $60 which is VERY reasonable.\n\nI would highly recommend this place!", "rating": 5, "date": "2015-11-03"}, {"excerpts": ["Get the heart attack - you won't regret it!"], "author": "Tim H.", "review": "Solid! Get the heart attack - you won't regret it!", "rating": 4, "date": "2016-03-21"}, {"excerpts": ["Loved loved loved the heart attack roll!"], "author": "Elizabeth B.", "review": "Excellent service! The sake recommendation was awesome. Our appetizer the Shrek was fantastic and I would recommend if you love avocado. Loved loved loved the heart attack roll!", "rating": 5, "date": "2016-05-22"}, {"excerpts": ["-we ordered three rolls: Sake bomb, heart attack, and big boss. ", "If you're a fish lover, the big boss is for you. "], "author": "Katy C.", "review": "Haven't really been around this area but I loved the decor inside the restaurant. Immediately walked in and got a huge welcome from all the staff. Came in with a group of 3 with reservations at 8. Not many people around this time on a Friday night but got pretty packed around 9. Prices not too bad. \n\nThings we got:\n-Hamachi truffle appetizer was amazing. Was extremely happy with every spoonful.\n-Desperaso with butter fish was not worth it. 4 pieces and lots of decorative additions but took away from the fish.\n-Half dozen oysters for $11. Extremely refreshing. \n-Chicken karage was pretty great. Comes in spicy version and not spicy. We got the non-spicy which comes with a ranch like sauce and a spicy mayo. Saw the spicy version at the table next to us and it looked pretty good.\n-Vegetable tempura was light but literally one piece of each vegetable listed from the menu.\n-we ordered three rolls: Sake bomb, heart attack, and big boss. If you're a fish lover, the big boss is for you. Rolls were pretty tiny and not that impressive. \n\nOverall: rolls weren't really worth it. Will try the Nigri instead. Awesome music but it was really loud and I had to yell over the music and other customers to have a conversation.  I'm giving it a 4 for great customer service and decor.", "rating": 4, "date": "2015-05-29"}, {"excerpts": ["Handroll tasting and Heart Attack are not to be missed."], "author": "Makela C.", "review": "I can't say enough good things about Nara. We received great service, the food was delicious, and the owner sent us dessert. I'll be back often. Recommendations: Handroll tasting and Heart Attack are not to be missed.", "rating": 5, "date": "2015-03-01"}], "the veggie roll": [{"excerpts": ["I tried the Veggie Roll, which was far superior to a typical restaurant vegetarian roll. ", "The large portion was packed with fresh vegetables, including asparagus, carrot, and avocado, topped with sweet mango and crispy zucchini tempura. ", "The smooth kabocha puree and small pieces of yucca chips on top brought it to the next level. ", "Another highlight of the meal was the Mushroom Tempura, a wonderful variety of lightly fried mushrooms-enoki, maitake, and other seasonal choices. ", "The Wakame salad and miso soup were also excellent. ", "Our bill was $80 for two people (just dinner, no drinks). ", "I would not hesitate to recommend Nara."], "author": "Alyssa F.", "review": "Fantastic sushi and interesting selection of Japanese small plates. Conveniently located in SF's Lower Haight neighborhood, steps from many of the best bars in the city. Ambiance is modern and romantic, with high ceilings, candle lighting, and dark wood. Top 40 music on surround sound, but not too loud to have a conversation. Great selection of beer and sake. The young lady waiting our table was very cheerful and attentive.\n\nI tried the Veggie Roll, which was far superior to a typical restaurant vegetarian roll. The large portion was packed with fresh vegetables, including asparagus, carrot, and avocado, topped with sweet mango and crispy zucchini tempura. The smooth kabocha puree and small pieces of yucca chips on top brought it to the next level. Another highlight of the meal was the Mushroom Tempura, a wonderful variety of lightly fried mushrooms-enoki, maitake, and other seasonal choices. The Wakame salad and miso soup were also excellent. Our bill was $80 for two people (just dinner, no drinks). I would not hesitate to recommend Nara.", "rating": 5, "date": "2017-06-28"}, {"excerpts": ["Then we ordered 5 rolls: effectively the first five on the menu, minus the veggie roll. \n\n"], "author": "Krista L.", "review": "We called ahead to make sure a table would be free for a party of 5, and I'm glad we did. \n\nWhen we arrived at Nara, our table was ready amid a crowd of people who hadn't planned ahead. While visibly jealous, the crowd was quickly placated by (presumably) complimentary glasses of sake while they waited. Only bummer was, our table was near the drafty open door. \n\nOur main server told us \"all the servers are your server- just flag someone down if you need anything\" and that was absolutely true, though occasionally confusing. \n\nWe ordered several appetizers and a cold and hot sake to start-- the karaage was the best price:portion ratio ($6 for 15 small pieces) but we were also happy with the agedashi tofu, tuna tar tar, and hotate sliders. Then we ordered 5 rolls: effectively the first five on the menu, minus the veggie roll. \n\nI don't remember which roll was which, but I found all of them tasty. At one point we received a third roll that looked a lot like the first, and by the fourth realized we accidentally got a couple of the next table's rolls... Whoops! This happened 3 times, but it took us eating 2 extra rolls to figure it out. I think if the servers dropping off food were more consistent about announcing what was being delivered, we might've caught it sooner (not that we minded-- we got a lot of free extra food out if it). \n\nTotal came to $35pp with tip for a generous amount of food and sake. The price for a group dinner was very reasonable compared to the beautiful plating, though the flavors and quality of the fish didn't knock my socks off (but to be fair, we didn't try the nigiri). \n\nAll in all, a great new spot. The staff were all casual, funny, and very amicable-- they all seemed so genuinely happy to be there! The chefs and servers waved as we left. \n\nNice enough place for a date, but casual enough for a weeknight out in the neighborhood.", "rating": 4, "date": "2015-04-09"}], "big boss": [{"excerpts": ["Some of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n"], "author": "Vickie Z.", "review": "Long overdue post. And every time I come, my love grows deeper. There is no need for me to get into the details of each dish, as I've tried almost every roll, hot dishes, small/cold dishes, nigiri tasting, and chirashi, and think quality is throughout. Think of Nara as trendy social spot - not really like an izakaya, but somewhere in the middle between that & strictly sushi place because their non-sushi dishes are for sharing & it has a bumpin' and fun atmosphere. \n\nWhen I am craving sushi (but not JUST sushi), I default to this place. When a friend is in town, I take them here. When someone is looking for a rec, I tell them here. \n\nSome of my faves:\n- Hamachi truffle \n- Shrek\n- Sake bomb roll\n- Big boss roll\n- Rice poppers \n- Hamachi kama\n- Ocean foie gras \n- Mr Tako balls \n\nFor the quality and taste, you are getting your money's worth. VERY affordable. One of my favorite restaurants in the city.", "rating": 5, "date": "2017-10-16"}, {"excerpts": ["We ordered the hamachi truffle appetizer, Kikumasa Taru sake (super fragrant and sweet cold sake), big boss roll (yums), sake bomb roll, and got a hand roll tasting (toro, bin toro, and sake).\n\n", "The hamachi truffle did not disappoint and was delicious and fresh! ", "They came in 5 spoonfuls of secret sauce (ie. ", "truffle oil ponzu), yellowtail, and jalapeno. ", "The kikumasa taru sake was on the sweeter side which I loved, and had just enough for 3 shots per person (I believe it was around $17 so not bad at all). ", "The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that ", "The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that ", "but the big boss takes the cake IMHO. ", "My favorite of all the dishes, however, were the hand rolls!!! ", "They serve three different types of fish and omgaaaaaahd the fish was so effing fresh and just melts in your mouth. "], "author": "Joy K.", "review": "I loved this place!! From the ambience to the service to, most importantly, THE FOOD, this place hit the nail on the head.\n\nMy friend and I came here on a Saturday night around 7 pm and there was ~a 15-20 minute wait. The server had us put down our name and phone number, and after walking around the neighborhood we got a text letting us know our table was ready. The inside was intimate and dim (great for a date!) but also a bit noisy/lively (also good for people watching!); it was clean, both casual and hip, and they had two bathrooms inside (score). We ordered the hamachi truffle appetizer, Kikumasa Taru sake (super fragrant and sweet cold sake), big boss roll (yums), sake bomb roll, and got a hand roll tasting (toro, bin toro, and sake).\n\nThe hamachi truffle did not disappoint and was delicious and fresh! They came in 5 spoonfuls of secret sauce (ie. truffle oil ponzu), yellowtail, and jalapeno. The kikumasa taru sake was on the sweeter side which I loved, and had just enough for 3 shots per person (I believe it was around $17 so not bad at all). The big boss roll was my favorite because the fish tasted super fresh and tender and had pretty huge meaty pieces; the sake bomb roll was also delicious because of all the sauces and all that but the big boss takes the cake IMHO. My favorite of all the dishes, however, were the hand rolls!!! They serve three different types of fish and omgaaaaaahd the fish was so effing fresh and just melts in your mouth. If you come here you have to try the hand rolls: the unsung heroes of Nara.\n\nI'd recommend this place for a ladies night out or a second/third date with a special someone (it's a bit loud for a first date you might feel like you're yelling the whole time if there are a bunch of large groups haha). This place had a cool vibe, the servers were super nice and gave us helpful suggestions on what to order, and I believe our total for an appetizer, drinks, roll and one hand roll (there were 3 hand rolls but my friend had 2 while I had 1 because I am a model citizen and superb friend thankyouverymuch) came out to be around $40/per person. Not bad for all the food you get! \n\nI will definitely be coming back to Nara again :)", "rating": 5, "date": "2017-09-30"}, {"excerpts": ["We had the hamachi truffle appetizer, the blazing glory, the special K, and the big boss.  ", "They were all delicious!!!  ", "Service was great too.  ", "Ambience is chill but trendy at the same time.  ", "I definitely plan on returning."], "author": "Julia W.", "review": "The food here was excellent.  We had the hamachi truffle appetizer, the blazing glory, the special K, and the big boss.  They were all delicious!!!  Service was great too.  Ambience is chill but trendy at the same time.  I definitely plan on returning.", "rating": 5, "date": "2018-05-22"}, {"excerpts": ["We also got the big boss roll, and blaze of glory and chicken karage. \n\n"], "author": "Amy Y.", "review": "Came to Nara with my bf the other night. The vibe was great, the people are excellent in service. \n\nWe got the Shrek special, which was quite interesting, it was a ball of avocado thinly sliced and filled with shrimp, crab, and fish inside. We also got the big boss roll, and blaze of glory and chicken karage. \n\nLet's break down each dish and see what I've got to say! \n\nBig boss- OH SO PERFECT. The amount of fish inside, the ingredients, the material and the wasabi mixed with soy sauce to top it off. Oh so fabulous. The size was perfect, good amount, quality was good. Perfect. \n\nThe shrek ball...You better LOVE avocado for this to be fabulous. Theres a bit TOO MUCH avocado for this, and I think towards the end we were pretty full, so I didn't enjoy this so much. \n\nWe also got the blaze of glory. It's a beautiful, cool, amazing sushi. The light the side of it with some holes in the foil to let the heat seap in. The fish is great, slight, very rarely cooked. \n\nGreat vibe, great service. Love this place. They charge for tea, which I don't appreciate.", "rating": 4, "date": "2015-12-10"}, {"excerpts": ["Also had the Big boss roll - yellowtail, tuna, salmon, salmon roe, avocado, cucumber and radish sprouts. "], "author": "Helen C.", "review": "I would describe Nara as a modern Japanese/sushi restaurant for social gatherings. NOTE: they don't serve liquor - only beer, wine and sake. We were able to make a reservation for a group of 5 on a Friday night. The restaurant was fairly empty upon arrival, but started to fill up as the night went on. We started out with the oysters which came with soy sauce as opposed to horse radish. Very refreshing! I then had the \"It's like butter baby\" grilled cod. Presentation was great and the cod was cooked perfectly. Given that it's on the \"heavier side,\" I'd say that it's more like a small plate rather than an appetizer.  Also had the Big boss roll - yellowtail, tuna, salmon, salmon roe, avocado, cucumber and radish sprouts. Great execution with less, but thick pieces. \n\nI was a little disappointed that the sushi options were limited to tastings, specialty rolls, and a la cart nigiri/sashimi. IMO sushi restaurants should offer maki/traditional rolls. They also serve their sushi in unique plates. The chirashi came in a rectangular plate with the rice and fish separated. It was basically a sashimi platter with rice on the side. Makes sense as to why it was priced the same as the sashimi and nigiri tastings. Service was good. They were kind enough to let us stick around and chat after dinner.", "rating": 4, "date": "2015-07-29"}, {"excerpts": ["We ordered the tempora appetizer, sake bomb roll, big boss roll, and some nigiris. ", "I was very happy with the quality of food and how delicious everything is. ", "Pricing is very fair, especially for this neighborhood "], "author": "Elizabeth T.", "review": "Stumbled across this place while exploring the Lower Haight and on my way over to check out Ricky Bobby. I'm so glad the decor here caught my eye because I loved everything I put in my mouth here!\n\nWe ordered the tempora appetizer, sake bomb roll, big boss roll, and some nigiris. I was very happy with the quality of food and how delicious everything is. Pricing is very fair, especially for this neighborhood and I was happy with the portions we received.\n\nI happen to be cutting out alcohol at the moment but I loved their ample selection of sake and very affordable sampler options. This place would be perfect for a small group of friends to split a huge sake bottle for a chill night.\n\nI love how this place is right across from an awesome bar, Noc Noc, which makes this the perfect dinner and pregame stop for the night.\n\nThis is definitely my new go-to stop and default sushi restaurant in San Francisco.", "rating": 5, "date": "2015-03-21"}, {"excerpts": ["We loved the rice poppers and the big boss roll. ", "The chicken karaage, salmon kama, special k roll, and happy hour tacos were also delicious!"], "author": "Britta J.", "review": "Great sushi spot! We loved the rice poppers and the big boss roll. The chicken karaage, salmon kama, special k roll, and happy hour tacos were also delicious!", "rating": 5, "date": "2018-05-18"}, {"excerpts": ["we're sushi fanatics, so we ordered way too much food - 1 each of the nigiri sampler (7 pieces), 1 each of the handroll sampler (3 rolls), 1 of the sashimi sampler (7 pieces), the big boss roll (5 pieces) and an order of pork belly. ", "ALL FOR TWO PEOPLE, it was a ridiculous amount of food, but we obvs ate it all... ", "i would definitely skip the pork belly (texture like karaage, not like cooked for hours yummy pork belly at all) and maki roll next time - not impressed at all.  ", "the fish was pretty good", "..a few pieces were even melt in your mouth (escolar! ", "yum!)", ". ", "bill came out to be $144 with tax for the two of us - a steal for sf.  ", "plus now we know what to skip next time!"], "author": "Christina L.", "review": "this place was much larger than expected for being a neighborhood spot - lots of 2- and 4- tops plus communal high tops, and a bar area.  i've been wanting to explore the haight more, so was happy to find this spot on yelp with such great reviews!  came in with a gf at 6:30 on a wednesday and were seated immediately. the servers are very efficient with bringing menus and water. they have happy hour til 7 which is fantastic so i got 2 large carafes of hot sake for $5 each. a steal! \n\nwe're sushi fanatics, so we ordered way too much food - 1 each of the nigiri sampler (7 pieces), 1 each of the handroll sampler (3 rolls), 1 of the sashimi sampler (7 pieces), the big boss roll (5 pieces) and an order of pork belly. ALL FOR TWO PEOPLE, it was a ridiculous amount of food, but we obvs ate it all... i would definitely skip the pork belly (texture like karaage, not like cooked for hours yummy pork belly at all) and maki roll next time - not impressed at all.  the fish was pretty good..a few pieces were even melt in your mouth (escolar! yum!). bill came out to be $144 with tax for the two of us - a steal for sf.  plus now we know what to skip next time!", "rating": 3, "date": "2016-02-04"}, {"excerpts": ["three rolls (Loco Spider Roll, Heart Attack, and Big Boss) and the tea. ", "All were excellent. ", "Love the Loco Spider roll especially (such crispy battered crab). ", "Prices were very fair. ", "Hope to be back!!"], "author": "Mikey J.", "review": "My favorite sushi place in San Francisco so far! Wow, what a great experience and value. The ambiance is modern yet relaxed, with wood tones throughout. Service is peppy and welcoming, love it. We had edamame, three rolls (Loco Spider Roll, Heart Attack, and Big Boss) and the tea. All were excellent. Love the Loco Spider roll especially (such crispy battered crab). Prices were very fair. Hope to be back!!", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\n", "The Heart attack was also really good. ", "I think this one was the one that had fried lotus roots on top. ", "Twas delicious. ", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n", "Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\n"], "author": "Juliana P.", "review": "Nice little Japanese place that recently opened. We ordered the maguro tar tar appetizer, Big Boss, Sake Bomb, Heart Attack and Garden Nara.\n\nThe appetizer was by far the best. 6 pieces, solid 5 stars. The display was simple and beautiful, and the fatty tuna went really well with the asian pear, radish, and avocado.\n\nThe Heart attack was also really good. I think this one was the one that had fried lotus roots on top. Twas delicious. Big Boss and Sake bomb was pretty good, too - but didn't stand out as much. \n\nI would not recommend the Garden Nara. It was not what I expectedly. Probably pretty healthy since it has no rice around it, but tasted like a mini veggie wrap and the taste/ texture did not go well with anything else. \n\nWe were still a bit hungry after 5 rolls because we are fatsos, so we ordered the seafood pancake which was pretty good. Not amazing though and the portion was kinda small.\n\nOverall, my experience was great and I would totally go here again. One thing that was a bit odd was the music. Just a tad strange to be chewing on some raw fish with Beyonce's 7/11 on - but no complaints. Great pop dance music sushi shop. I'd recommend turning it into a dance club after 10p.", "rating": 4, "date": "2015-03-17"}, {"excerpts": ["The Big Boss is everyone's favorite it has : ", "Yellowtail, tuna, salmon, salmon roe, avocado, cucumber and radish sprouts and a very clean and delicious taste to it. "], "author": "Kunal T.", "review": "Solid place with a hipster touch! You have to go here just for the sushi with the pop rocks...a little shock doesn't hurt anyone. It has a darker ambiance with a party vibe to it a lot of people are sake bombing and great staff. The staff are very friendly they scream something every time enters and leaves the restaurant. The Big Boss is everyone's favorite it has : Yellowtail, tuna, salmon, salmon roe, avocado, cucumber and radish sprouts and a very clean and delicious taste to it. The hamachi truffle is to die for with yellowtail with jalapeno and to top it off with some truffle oil.\n\nThe Haight is a great neighborhood with a lot of SF culture and this is a great spot to check out in the area.", "rating": 4, "date": "2015-12-12"}, {"excerpts": ["4) Big boss: yellowtail, tuna, salmon, ikura, avocado, cucumber, radish sprouts. ", "I like it that it's just fish and rice, no fancy toppings needed. "], "author": "Inga C.", "review": "Overall 3 stars for the great service, fun vibe, and a few tasty dishes (it's tapas style). Just make sure to get the right dishes. I would come back with a big group of friends and get all the plates and drinks that sound good. A sampling below. \n\nRanked in order of deliciousness:\n1) Hamachi truffle: seared yellowtail with jalapeño cilantro and crunch in truffle oil ponzu. It comes in 5 delectable spoons with all the seasonings. You can taste the truffle without it being overpowering. Would get again. \n\n2) (Special on wall) Ray-Ray's Tako - sous vide Spanish octopus with red wine and apple reduction. Cooked just right for chewy texture and a nice sweet-savory glaze. \n\n3) Rice poppers: 4 deep fried sushi rice topped with spicy tuna and white tuna and ranch dressing. It's like a bite-sized Japanese rice ball. Yum. \n\n4) Garlic butter edamame: you just can't go wrong with garlic and butter. Get it. \n\n4) Big boss: yellowtail, tuna, salmon, ikura, avocado, cucumber, radish sprouts. I like it that it's just fish and rice, no fancy toppings needed. The ikura makes this roll.\n\nBelow this - would not get again: \n\n5) Spicy tonkotsu ramen: it's not entirely fair to compare this to ramen-only shops, but this was a real miss. The spiciness overpowered the broth so you couldn't taste the pork flavor. Noodles were stuck together, e.g. what happens when you cook pasta and leave it out to dry w/ no oil. The yolk in the egg seemed al dente but somewhere along the way it fell out of the egg white and was never found again...so can't really comment on that one. \n\n6) Spicy handroll tasting: you get one of each spicy tuna, hamachi and sake. Nothing special. \n\nIf I'm in the area again I'll come back to try  the other dishes.\n\nAtmosphere: it's a fun izakaya / gastropub vibe and it's open late (til 1130p), which is awesome and so rare in SF! \n\nService: super super fast - we were here at 1030p on a Saturday night and the place was about 1/3 full.", "rating": 3, "date": "2015-12-12"}, {"excerpts": ["I got the big boss roll (~$12) and it came out almost right away.\n", "I love this place! ", "Very affordable, great service, and quality of food"], "author": "Norah C.", "review": "Love the clean and sleek look of Nara. \nCame here on a Saturday night around 7 without reservations and was seated immediately at the sushi bar.\nThe staff is very attentive and the service is very good. \nI got the big boss roll (~$12) and it came out almost right away.\nI love this place! Very affordable, great service, and quality of food", "rating": 5, "date": "2016-09-12"}, {"excerpts": ["I was pleasantly surprised by the quality of fish - one of my favorites is the Big Boss Roll which mixes yellowtail, tuna, and salmon that is then paired with sprouts, avocado and cucumber. ", "If you want something heartier, their ramen is decent and they also offer an array of specials, from wagyu steak to hamachi kama. "], "author": "Ashley T.", "review": "Nara is a great place to come with big groups, whether it's for happy hour or just a meal. They have a great variety of food, from traditional sushi rolls to more Korean fusion steam buns. I was pleasantly surprised by the quality of fish - one of my favorites is the Big Boss Roll which mixes yellowtail, tuna, and salmon that is then paired with sprouts, avocado and cucumber. If you want something heartier, their ramen is decent and they also offer an array of specials, from wagyu steak to hamachi kama. Nara is the place to go for fun vibes, creative food, and maybe a sake bomb or two!", "rating": 4, "date": "2016-05-05"}, {"excerpts": ["Ramen and big boss roll were on point. ", "A lot of the dishes feature a spicy ingredient. ", "I don't handle spice very well, ", "but maybe I'll muster up the courage to try the spicy dishes one day ", "cuz they look"], "author": "Mikaela S.", "review": "Was kind of iffy at first because I don't usually like fusion Japanese restaurants, but this place is bomb. Ramen and big boss roll were on point. A lot of the dishes feature a spicy ingredient. I don't handle spice very well, but maybe I'll muster up the courage to try the spicy dishes one day cuz they look/sound delicious.\n\nWhat gives Nara 5 stars instead of a 4 is the amazing service. Makes me so happy when a new restaurant opens and they have their shit together from day 1 instead of trying to wing it and work out all the kinks as they go. Will definitely return to try out the impeccable sake selection that I keep reading about.", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Some of my favorites are Big boss, heartattack, and special K. \n\nDaily specials. "], "author": "Sunjoo K.", "review": "One of my favorite sushi places in town!\nI am picky when it comes to sushi. I am not one of those who gets a bento box when going to a Japanese place although I have nothing against bento boxes. I grew up in Aisa where Japanese food is everywhere, easily better than places in the U.S, and are a lot more affordable so it takes a lot for me to give five stars. \n\nLet's talk about customer service. Every single staff at Nara including the servers and chefs were friendly and welcoming. Also they were very knowledgable about their specials and the menu. I mean what more can I ask?\n\nExcellent food. The quality of the fish Nara serves is not something you find in any Japanese restaurants. They are super fresh and delicious. I really enjoyed their uni, striped horse mackerel, premium Japanese snapper, golden eye snapper, and Hawaiian amberjack. Also these are not typical fish you find anywhere. I highly recommend Nara if you want to try something unique and different. Also I'm not a huge fan of rolls because rolls tend to overshadow the taste of the fish with sauce and other ingredients. However Nara's rolls are amazing and super tasty and don't overshadow the fish. Some of my favorites are Big boss, heartattack, and special K. \n\nDaily specials. Every day from 5-7 they have a happy hour deal where draft beer and hot Sake are $1 off and they have one dollar oysters. If you are an oyster lover like myself, you def should check this place out. \n\nOverall I have amazing time every time i visit Nara.    I highly recommend this place to any sushi lovers like myself", "rating": 5, "date": "2016-01-31"}, {"excerpts": ["loved the appetizer the hamachi truffle (like most people) and shared the omakase and big boss roll with my girlfriend which was the perfect amount of food! ", "they also have an amazing sake selection, i would definitely recommend this place for date night!!"], "author": "Will M.", "review": "this may be the best salmon belly i've ever had...wow super great experience and really fun chefs! recommend sitting at the bar so you can watch the skilled chefs prepare amazing dishes! loved the appetizer the hamachi truffle (like most people) and shared the omakase and big boss roll with my girlfriend which was the perfect amount of food! they also have an amazing sake selection, i would definitely recommend this place for date night!!", "rating": 5, "date": "2017-02-10"}, {"excerpts": ["From the regular menu some favorites include hamachi truffle, garlic butter edamame, chicken karaage (I prefer spicy), \"it's like butter\" (incredible fish dish), hamachi kama, big boss roll, and the ramen. "], "author": "Joseph N.", "review": "This is hands down my favorite spot in the neighborhood and one of my favorite restaurants in the city. The food is excellent and the owner/staff kick so much ass, Nara is always a fun place to be. It's a great place for a meal or a few rounds with good food for accompaniment, and the happy hour is great. \n\nMore detailed review:\n\nFirst things first, the food is excellent. Whether you're in the mood for sushi or something heavier / cooked, Nara's got you covered. The fish is very fresh so it's great as sashimi/nigiri or in their rolls, some of which are incredible. They always have daily specials listed on the board behind the sushi bar that oftentimes sell out.\n\nLast time I was here I had the seven-course omakase, which was an insane amount of food. There were lots of rolls, the kind that come with sauces or are deep fried or have fusion-y ingredients like cream cheese. They were delicious, but I was hoping for some really good simple fresh fish. Just when I thought that wasn't coming, a plate of I think seven types of sashimi was served, followed by seven types of nigiri. There was also salad, a course of cooked fish, miso soup with veggies and seafood, and creme brulee for dessert. I may have missed something else, but my point is it was all top-notch and a lot of food.\n\nFrom the regular menu some favorites include hamachi truffle, garlic butter edamame, chicken karaage (I prefer spicy), \"it's like butter\" (incredible fish dish), hamachi kama, big boss roll, and the ramen. Aside from the soups everything is easy to share, which makes coming here with friends even more fun.\n\nThe atmosphere is awesome here, from the tasteful decor to the friendly and welcoming staff. I've gotten to know some of them, including chefs Kevin and Danny, both a lot of fun and great at what they do. George, one of the servers, is always attentive and friendly. And the owner Sonny, who you'll sometimes see wandering table to table, is an awesome guy who is doing things right with this restaurant.\n\nThere's an izakaya / gastropub vibe here, so even though the food is legit it's also a great place to grab drinks (though no liquor, so don't expect that). They have a few beers on tap and some imported bottles as well as an extensive sake menu. It can be a bit loud but never rowdy, which for me is perfect. They have good playlists to keep the atmosphere upbeat.\n\nIf you live nearby or are looking for a new sushi spot, definitely check this place out!", "rating": 5, "date": "2015-07-21"}, {"excerpts": ["Big Boss - big boss...\n\n"], "author": "Candace D.", "review": "HOLY COW! Sweet baby Jesus! This place is amazing. This has become our favorite sushi spot! \n\n$1/oyster! The miyagi oysters and the soy dressing is insane...yup...ate 24 of them! \n\nHimachi truffle is the bomb! Must order this!\n\nKatsu salad- I want to bathe in that house made dressing goodness.\n\nBig Boss - big boss...\n\nSake Bomb - my favorite!!!!\n\nMiso soup - Soooooo goooood\n\nNigiri sushi in general - superb!!\n\nService - A+\n\nI love you Nara. See you next week (or tomorrow)", "rating": 5, "date": "2016-02-26"}, {"excerpts": ["-we ordered three rolls: Sake bomb, heart attack, and big boss. ", "If you're a fish lover, the big boss is for you. "], "author": "Katy C.", "review": "Haven't really been around this area but I loved the decor inside the restaurant. Immediately walked in and got a huge welcome from all the staff. Came in with a group of 3 with reservations at 8. Not many people around this time on a Friday night but got pretty packed around 9. Prices not too bad. \n\nThings we got:\n-Hamachi truffle appetizer was amazing. Was extremely happy with every spoonful.\n-Desperaso with butter fish was not worth it. 4 pieces and lots of decorative additions but took away from the fish.\n-Half dozen oysters for $11. Extremely refreshing. \n-Chicken karage was pretty great. Comes in spicy version and not spicy. We got the non-spicy which comes with a ranch like sauce and a spicy mayo. Saw the spicy version at the table next to us and it looked pretty good.\n-Vegetable tempura was light but literally one piece of each vegetable listed from the menu.\n-we ordered three rolls: Sake bomb, heart attack, and big boss. If you're a fish lover, the big boss is for you. Rolls were pretty tiny and not that impressive. \n\nOverall: rolls weren't really worth it. Will try the Nigri instead. Awesome music but it was really loud and I had to yell over the music and other customers to have a conversation.  I'm giving it a 4 for great customer service and decor.", "rating": 4, "date": "2015-05-29"}, {"excerpts": ["We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. ", "The winner was the sake bomb roll all around. ", "The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. ", "It was extremely busy during that time though. ", "Nevertheless, I would recommend coming back here! ", "Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. ", "Try them if you get a chance!"], "author": "Kathleen T.", "review": "I've been here a couple of times and I have had good experiences during all occasions. Most recently, I made a reservation for 8pm with a large group without any issue. We ordered the oysters, the big boss roll, jessica alba roll, loco spider roll and sake bomb roll. The winner was the sake bomb roll all around. The only downside was that we constantly had to ask a waiter for napkins, more orders and whatnot since we barely saw ours. It was extremely busy during that time though. Nevertheless, I would recommend coming back here! Their kimchi tacos were a hit whenever I came here but unfortunately were not on the menu this time. Try them if you get a chance!", "rating": 4, "date": "2017-02-09"}, {"excerpts": ["The two rolls we ordered were the 'Big Boss' and the Jessica Alba.  ", "Yay for alba, nay for big boss. "], "author": "Christopher M.", "review": "Looking for a new place to eat sushi, I stumbled across this place on Haight, not too far from Ricky Bobby. \n\nThe decor of the place indicates an intimate new trendy restaurant, but as soon as you enter the door, the entire staff will scream at you, to welcome you to the place. It's actually quite funny and welcoming.  But you do immediately notice the noise level of the place is quite high.\n\nThe music is an issue by itself.  For one, it's blasted continuously.  Very difficult to have a conversation imo.  Plus, the music choices at times make it seem like you are sitting in a bad karaoke bar. Not to mention, when it's time to celebrate someone's birthday, regular music will stop, and music taken from what seems to be from a japanese game show/variety show/ Kpop is taken up a few decibels and floods the entire place for a good 1-2 minutes, until the staff is done wishing the patron a happy birthday. It's quite jarring.\n\nThe staff is quite nice, welcoming, and attentive for the most part. Definitely a plus.\n\nThey have a nice selection of sake. Their drink menu is nicely done and even has an informative page at the end, describing each type of sake and the tastes you should expect to help make your choice. I'm not one to usually order sake, since I never know what to get, but I found myself ordering a small bottle due to the information they give you.  Nice touch.\n\nThe sushi itself is not very good imo.  I ordered both their nigiri and their sashimi tastings while my girlfriend ordered two of their rolls. The selection of novelty rolls themselves is very small compared to a typical sushi restaurant/bar.  That is perfectly fine, but the sushi you offer should be really good, unfortunately I don't believe it is. The two rolls we ordered were the 'Big Boss' and the Jessica Alba.  Yay for alba, nay for big boss. Shame, I love me some Metal Gear Solid.\n\nThe nigiri wasn't bad, just not great.  None of them seemed to be exceptionally fresh.   The sashimi also suffers from this and the portion size also seemed off.  The cuts were rather large and thick, which may seem like a good thing, but having a larger piece of fish with lower quality taste isn't really that appetizing. I also felt that some of the pieces of both sashimi/nigiri were over seasoned as well.\n\nIt's a decent place.  If you live in a different neighborhood, I don't think its worth the effort to come out, better going off to Ricky Bobby a few blocks down.  As a neighborhood sushi place, that you can easily stroll on in, sure why not.", "rating": 2, "date": "2015-04-08"}, {"excerpts": ["I chose the Big Boss roll and it was right on the mark. ", "He hand rolls were amazing. ", "The maguro tartare was to die for and will keep me coming back. ", "Excellent, excellent tuna!! ", "And cherry in top, they are open late."], "author": "D F.", "review": "High quality food and good service bi was worried about the choices because there are a lot of signature rolls with unusual things and I like pretty simple. I chose the Big Boss roll and it was right on the mark. He hand rolls were amazing. The maguro tartare was to die for and will keep me coming back. Excellent, excellent tuna!! And cherry in top, they are open late.", "rating": 5, "date": "2016-01-18"}], "treasure island": [{"excerpts": ["- Sake Bomb\n- Treasure Island\n\n"], "author": "Kassie E.", "review": "COME TO NARA!\n\nFirst time we went the first thing we experienced was the entire staff shouting and getting us. We also noticed the great music that was playing in the background. The ambiance here is fun!\n\nThe food is so good! Here's a few things I would recommend:\nAppetizer:\n- Spicy Handroll Tasting\n- Shrek\n\nRolls:\n- Blazing Glory !!!!!!\n- Sake Bomb\n- Treasure Island\n\nI have tried a lot more but this is usually what I come in for. They usually have specials written up as well and every time I've tried one it's been pretty good! If you want a casual, yummy, not too expensive, fun, sushi spot, come here!!!!", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["Treasure Island - 4/5\n\n"], "author": "Mark O.", "review": "Dinner review. \n\nHamachi truffle - 4/5\nSpicy Karaage - 2/5\nRice poppers - 4/5\nNigiri tasting - 3/5\nFillmore - 3/5\nBlazing glory - 3/5\nLoco spiderman - 4/5\nHeart attack - 3/5\nTreasure Island - 4/5\n\nOverall,  \"I'm a fan.\"", "rating": 4, "date": "2015-10-14"}, {"excerpts": ["The heart attack and treasure island rolls were delicious. \n\n"], "author": "Shireen J.", "review": "I wish I could give this place 5 stars but the service wasn't so great so had to deduct a star. \n\nThe sushi is amazing. So creative, fresh, and beautifully presented. The vibe of this place is great as well. \n\nThe nigiri and sashimi tastings were excellent. The butterfish tasting was mind blowing. The handroll tasting was good but not the best. The heart attack and treasure island rolls were delicious. \n\nEverything is so well presented and I was pleasantly surprised by how fresh the fish was. \n\nMy new favorite place. If only the servers start paying more attention and not leave us waiting next time.", "rating": 4, "date": "2015-12-01"}, {"excerpts": ["Treasure Island: ", "Good, except it was supposed to have jalapeno and either they forgot or didn't have them because there was no spice whatsoever on these.\n", "Garlic Butter Edamame: IMO, best part of the meal.\n", "Miso: sub-par. ", "It was tepid and seemed to be separating, which means it was old and almost ruined the meal for me. ", "If the miso isn't good, the rest is questionable. \n", "Overall I did go late in the evening right before close so everyone must have been eager to leave and they skimped on quality. ", "The waitress was not very friendly and bordered on rude."], "author": "Marcela M.", "review": "Sake Bomb: Very good, no jalapeno as noted, must remember to request without the tobiko. (little fish eggs)\nTreasure Island: Good, except it was supposed to have jalapeno and either they forgot or didn't have them because there was no spice whatsoever on these.\nGarlic Butter Edamame: IMO, best part of the meal.\nMiso: sub-par. It was tepid and seemed to be separating, which means it was old and almost ruined the meal for me. If the miso isn't good, the rest is questionable. \nOverall I did go late in the evening right before close so everyone must have been eager to leave and they skimped on quality. The waitress was not very friendly and bordered on rude.", "rating": 3, "date": "2015-12-03"}, {"excerpts": ["We also took the loco roll and Treasure Island"], "author": "Rachida I.", "review": "Amazing sushi place! Had the Shrek as appetizer to share with my friend, very tasty!! We also took the loco roll and Treasure Island", "rating": 5, "date": "2015-09-07"}, {"excerpts": ["- Treasure Island - My favorite - Crispy outside and the cream cheese filling... sooo good!\n\n"], "author": "Ryan R.", "review": "This place is a good first date spot. Even though I feel it's technically in The Haight but it says Hayes Valley. We had the following dishes:\n\nDRINK\n- Alradin / Unfiltered Sake - Not too sweet or bitter, Very good.\n\nSTARTERS\n- Wakame Salad - Very fresh & good\n- Edamame - love the rock salt (could have been hotter)\n- Korean Pork Buns - Very spicy (and I like spice) but very good.\n\nMAINS\n- Heart Attack - good tuna but could have been spicier.\n- Treasure Island - My favorite - Crispy outside and the cream cheese filling... sooo good!\n\nAll together, the bill was $60 which is VERY reasonable.\n\nI would highly recommend this place!", "rating": 5, "date": "2015-11-03"}], "homango": []}