{"black truffle popcorn": [{"excerpts": ["For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. ", "Oh my gods... the popcorn. ", "I had to have it, even though I was about to head to dinner. ", "Best popcorn ", "I've ever eaten, you guys. ", "Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. ", "$7 for a large enough portion to share? "], "author": "Kendall S.", "review": "This is the only place I visited twice in one trip last time I went to SF, and I wish I could go back right now. Adam and I were a bit early for our dinner reservation at Isa's next door, so we moseyed around a bit, just taking in the environment and beautiful weather. From the moment I saw the words \"wine lounge\" on Nectar's door and peered through the windows into its cozy, romantic atmosphere, I knew we had to stop in for a glass of wine. What better way to spend 30 minutes before dinner?\n\nWe took a seat at the bar and were immediately greeted, but not bombarded, which is always appreciated. It's gorgeous inside; dim lighting, dark furniture, beautiful shelves full of beautiful wine, candlelight... The bartenders are knowledgeable and personable, and most importantly, they seem to genuinely enjoy their job. It's such a relaxing and artful atmosphere that lures you in and makes you want to stay all night. We left for dinner and then came back right afterwards!\n\nEven if Nectar had sub-par food and a boring wine menu, I'd still love this place. That's how much I enjoyed the ambiance and the service. But, of course, their menus are just incredible! This is my kind of food, y'all. I didn't eat a meal here, unfortunately, but I drooled over their menu for far too long. French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. Oh my gods... the popcorn. I had to have it, even though I was about to head to dinner. Best popcorn I've ever eaten, you guys. Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. $7 for a large enough portion to share? Amazing!\n\nI apologize for getting this far into a wine lounge review without mentioning the wine, which was fantastic. I went with a prosecco, of course. They have fabulous wine flights and descriptions with a sense of humor. \"Crisp & Unpretentious Whites\" as well as \"Rich and Extroverted Whites.\" For the reds, \"Playful yet Thoughtful,\" \"Sensualist,\" and \"Hedonist.\" I love it! I really do love everything about Nectar. They were even playing Valkyrie on the wall with a projectior, and you know I'm a Tom Cruise fan!", "rating": 5, "date": "2014-04-02"}, {"excerpts": ["Had two different wine flights, the black truffle popcorn and banana bread desert. ", "Really enjoyed the spot and flights. ", "Great staff."], "author": "Malissa M.", "review": "Had two different wine flights, the black truffle popcorn and banana bread desert. Really enjoyed the spot and flights. Great staff.", "rating": 5, "date": "2016-02-20"}, {"excerpts": ["Try the black truffle popcorn and your favorite wine flight.  ", "I promise, it will be an experience to remember."], "author": "Tiffany T.", "review": "If you're looking for something a little different than the traditional Marina scene, then Nectar should be at the top of your list!\n\nWhether you're looking for a relaxing, yet vibrant place to grab a great glass of wine with a girlfriend, or you want to be engulfed in a sexy setting with your beau...it's truly the best of both!\n\nNectar has really toned in on creating the optimal ambiance for guests to feel relaxed yet invigorated.  The energy flows seamlessly and while they have a projector playing muted movies, they also have a fun mix of music that picks up the energy level.  To finish it off, the candle lighting throughout, gives a sexy overtone to create the perfect setting. \n\nIf you're looking for something a little fun, they have wine flights, where you get to taste an array of select wines from all over the world!  Tasting each of the wines was so much fun and a great way to spike conversation if you find yourself looking for a good \"first date\" stop with a new friend.\n\nBeyond the quality of the product, the service was truly impressive.  Every member of the staff was well educated on the products and served up a wealth of knowledge in regards to the amazing wines we were tasting.  Additionally, everyone was highly personable.  It was so refreshing to see the owner and every member on hand chatting and laughing with tables, making sure each guest was having a fabulous time.\n\nIf you haven't tried Nectar yet, do yourself a favor and make the time to stop by!  \n\nMy personal recommendation...Try the black truffle popcorn and your favorite wine flight.  I promise, it will be an experience to remember.", "rating": 5, "date": "2011-11-13"}, {"excerpts": ["We also tried the Black Truffle Popcorn...and omg was it delish! ", "I soo need to come back and try more of their wines and snacks. \n", "Definitely one of my new favorite spots in the city!"], "author": "Sonya D.", "review": "Nectar Wine Lounge is a super creative, cute, and fun little spot in the Marina. We decided to try two different wine flights so that we could overwhelm our palates with variation. We decided to go with the Badass Reds and the Anything But Whites. Wow, so many good flavors! The best part about their wines are the descriptions. We spoke with the guy that wrote the descriptions, and he explained that he wanted to go above and beyond...or simply mock normal wine bars. (Along the lines of- roll down a hill into a bush of violets while rain glistens off your fingertips. Love it.) Well, if anything it helped our experience because I could tell that he really thought about it while writing them. If not, then geez...because they helped us identify new tastes and have fun while consuming them. We even decided to write descriptions of our own, which is always fun. We also tried the Black Truffle Popcorn...and omg was it delish! I soo need to come back and try more of their wines and snacks. \nDefinitely one of my new favorite spots in the city!", "rating": 4, "date": "2011-11-15"}, {"excerpts": ["Our snack of choice-- combo of 3 cheese & salami platter, black truffle popcorn, buratta salad, pizzetta.\n\n"], "author": "Gerard B.", "review": "Generous FLIGHT portions! \n\nWine and cheese.. Yes, please. Last minute, spur of the moment with some great friends. Luckily we had no wait. \n\nMy drink of choice-- Flights! I had the Santa Barbara Flight; a taste of 3 of Santa Barbara's best. A \"taste\" may be an understatement since they were quite generous on the portions, but who's complaining?!\n\nMy suggestion-- Anything But Chard Flight.\n\nOur snack of choice-- combo of 3 cheese & salami platter, black truffle popcorn, buratta salad, pizzetta.\n\nAll in all, a fantastic night! And I'm thirsty for more. Between 3- flights, that's 9 glasses in all and the food above, we each paid $40 (3 person). I say that's a steal especially for the amount of wine they gave us.", "rating": 4, "date": "2010-03-24"}, {"excerpts": ["Appetizers olives cheese and the menu changes often .Try their black truffle popcorn which is delicate and yummy."], "author": "Susie C.", "review": "Love it!\nArrive early for the best seats and give yourself  time to sample their champagne flights. Tuesday are the best night  Happy hour 5-7pm 50% off all wines by the glass.Appetizers olives cheese and the menu changes often .Try their black truffle popcorn which is delicate and yummy.", "rating": 5, "date": "2010-08-12"}, {"excerpts": ["I cannot leave the premises without sampling their black truffle popcorn which is simply to die for.  \n\n"], "author": "Bridget W.", "review": "This is my go to Happy Hour spot.  Very modern and very hip with probably the best cocktail hour deal in San Francisco.  \n\nTypically, I order the flight of champagne.  Clean, crisp bubbly in beautiful, tall glasses. After a long day, there is nothing better than being served three glasses of bubbles and having that first sip.  Their HH menu is just as grand.  I cannot leave the premises without sampling their black truffle popcorn which is simply to die for.  \n\nArrive early for the best seats and give yourself ample time to try one, two or even three flights of champagne before starting your evening.", "rating": 5, "date": "2010-06-21"}, {"excerpts": ["The other was their black truffle popcorn. ", "It's super salty and oily ", "and you can taste the delicate black truffle flavor. ", "(Appetizer prices will run up quickly, so if you're hungry and budget-conscious, just get the black truffle popcorn to nibble while you have a drink and then stagger right next door to Barney's for a burger and fries.)\n\n "], "author": "Dani Y.", "review": "Nectar has some nice little wine tasting deals; we chose a flight of sparkling wine, and got generous-sized tastes of three pre-determined sparking wines. (There were two champagnes and a Prosecco, and all were delicious.)\nHaving had a mishap with a muddy box of kale earlier in the day, I wasn't looking my best, and was somewhat reluctant to go, but seeing as my co-worker was looking very good, I figured I would go and just kind of hide behind her. At 5:00 pm when we arrived, it was very quiet, with just one other group of people there. Soon afterward, many, many gals came flocking to Nectar... the ratio of women to men was similar to that of a nail salon... or a convent. My friend and I were the only people of color in the place, except for our server, who was also a person of color, and who seemed to hate our guts. She gave good information about the wines when we asked questions, but she did so in an utterly bored, rote recitation sort of way. \n\nAt Nectar, it's fun to read the extremely poetic and fanciful descriptions of the wines in the wine book (something about toasted almonds kissing a tear stained cheek in autumn and a caress of spearmint... no kidding), the selection is vast, and the bar, excuse me, lounge, is pretty inside. It's apparently a place where you can bring a baby, get drunk, and no one looks askance: a Marina MILF- type teetered over to us on her narrow heels, smiling expansively, and told me her son had a huge crush on me and couldn't take his eyes off me. The son in question was an infant so young I don't think his eyes were even focused.\n\n*edit* \n\nOn my second visit to Nectar, I tried two appetizers-- one was a phyllo dough-wrapped mushroom puff with two dabs of aoli... yummy but teeny-tiny. I guess that's to be expected. The other was their black truffle popcorn. It's super salty and oily and you can taste the delicate black truffle flavor. A big yum when you're getting slightly drunk! \n\n(Appetizer prices will run up quickly, so if you're hungry and budget-conscious, just get the black truffle popcorn to nibble while you have a drink and then stagger right next door to Barney's for a burger and fries.)\n\n The service was nice this time around so I changed my stars from 3 to 4.", "rating": 4, "date": "2007-08-13"}], "roasted olives": [{"excerpts": ["For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. ", "Oh my gods... the popcorn. ", "I had to have it, even though I was about to head to dinner. ", "Best popcorn ", "I've ever eaten, you guys. ", "Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. ", "$7 for a large enough portion to share? "], "author": "Kendall S.", "review": "This is the only place I visited twice in one trip last time I went to SF, and I wish I could go back right now. Adam and I were a bit early for our dinner reservation at Isa's next door, so we moseyed around a bit, just taking in the environment and beautiful weather. From the moment I saw the words \"wine lounge\" on Nectar's door and peered through the windows into its cozy, romantic atmosphere, I knew we had to stop in for a glass of wine. What better way to spend 30 minutes before dinner?\n\nWe took a seat at the bar and were immediately greeted, but not bombarded, which is always appreciated. It's gorgeous inside; dim lighting, dark furniture, beautiful shelves full of beautiful wine, candlelight... The bartenders are knowledgeable and personable, and most importantly, they seem to genuinely enjoy their job. It's such a relaxing and artful atmosphere that lures you in and makes you want to stay all night. We left for dinner and then came back right afterwards!\n\nEven if Nectar had sub-par food and a boring wine menu, I'd still love this place. That's how much I enjoyed the ambiance and the service. But, of course, their menus are just incredible! This is my kind of food, y'all. I didn't eat a meal here, unfortunately, but I drooled over their menu for far too long. French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. Oh my gods... the popcorn. I had to have it, even though I was about to head to dinner. Best popcorn I've ever eaten, you guys. Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. $7 for a large enough portion to share? Amazing!\n\nI apologize for getting this far into a wine lounge review without mentioning the wine, which was fantastic. I went with a prosecco, of course. They have fabulous wine flights and descriptions with a sense of humor. \"Crisp & Unpretentious Whites\" as well as \"Rich and Extroverted Whites.\" For the reds, \"Playful yet Thoughtful,\" \"Sensualist,\" and \"Hedonist.\" I love it! I really do love everything about Nectar. They were even playing Valkyrie on the wall with a projectior, and you know I'm a Tom Cruise fan!", "rating": 5, "date": "2014-04-02"}], "bacon wrapped dates": [{"excerpts": ["For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. ", "Oh my gods... the popcorn. ", "I had to have it, even though I was about to head to dinner. ", "Best popcorn ", "I've ever eaten, you guys. ", "Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. ", "$7 for a large enough portion to share? "], "author": "Kendall S.", "review": "This is the only place I visited twice in one trip last time I went to SF, and I wish I could go back right now. Adam and I were a bit early for our dinner reservation at Isa's next door, so we moseyed around a bit, just taking in the environment and beautiful weather. From the moment I saw the words \"wine lounge\" on Nectar's door and peered through the windows into its cozy, romantic atmosphere, I knew we had to stop in for a glass of wine. What better way to spend 30 minutes before dinner?\n\nWe took a seat at the bar and were immediately greeted, but not bombarded, which is always appreciated. It's gorgeous inside; dim lighting, dark furniture, beautiful shelves full of beautiful wine, candlelight... The bartenders are knowledgeable and personable, and most importantly, they seem to genuinely enjoy their job. It's such a relaxing and artful atmosphere that lures you in and makes you want to stay all night. We left for dinner and then came back right afterwards!\n\nEven if Nectar had sub-par food and a boring wine menu, I'd still love this place. That's how much I enjoyed the ambiance and the service. But, of course, their menus are just incredible! This is my kind of food, y'all. I didn't eat a meal here, unfortunately, but I drooled over their menu for far too long. French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. Oh my gods... the popcorn. I had to have it, even though I was about to head to dinner. Best popcorn I've ever eaten, you guys. Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. $7 for a large enough portion to share? Amazing!\n\nI apologize for getting this far into a wine lounge review without mentioning the wine, which was fantastic. I went with a prosecco, of course. They have fabulous wine flights and descriptions with a sense of humor. \"Crisp & Unpretentious Whites\" as well as \"Rich and Extroverted Whites.\" For the reds, \"Playful yet Thoughtful,\" \"Sensualist,\" and \"Hedonist.\" I love it! I really do love everything about Nectar. They were even playing Valkyrie on the wall with a projectior, and you know I'm a Tom Cruise fan!", "rating": 5, "date": "2014-04-02"}, {"excerpts": ["A couple of our favorite small plates that we order all the time are: truffled popcorn, bacon wrapped dates, ahi tar tare, and burrata and prosciutto.  ", "Each time we order food, it tastes consistently delicious and exactly as we expect!  "], "author": "Tabitha B.", "review": "This is my favorite wine bar in San Francisco and continues to be a go to place whenever I get together with my friends!  It is my husband and I's favorite gem to visit in the Marina.  I stumbled upon this wonderful place several years ago when I visited the Marina and have been going back regularly since.  It has a elegant, warm atmosphere and the owners are fantastic and make you feel like home.  Though the place can get busy at night, it's always classy and doesn't have the overly crowded, drunken people atmosphere that many bars in the Marina usually have.  It is a great place to go and relax with friends or on a date.  \n\nService is consistently fantastic.  Love the candlelit atmosphere.  Wine list is superb to try some new wines you've never had before - Monday 1/2 off wine flights is another great excuse to go!  Food is also great as well - you can't go wrong ordering anything of off the menu and it changes with the seasons.  A couple of our favorite small plates that we order all the time are: truffled popcorn, bacon wrapped dates, ahi tar tare, and burrata and prosciutto.  Each time we order food, it tastes consistently delicious and exactly as we expect!  Signs of a well run kitchen!  \n\nBottom line - consistency across all facets is key when I give a 5 star review to a bar/restaurant.  Despite having gone there over 50 times, Nectar has been consistent with great service, great food, great atmosphere, and great wine list.  Highly recommend coming here!", "rating": 5, "date": "2015-09-20"}, {"excerpts": ["Delicious small plates- ordered bacon wrapped dates twice, the mac n cheese and the tuna. "], "author": "Kathryn M.", "review": "Delicious small plates- ordered bacon wrapped dates twice, the mac n cheese and the tuna. Would recommend all of them.\n\nThe wine was terrific as well- tried 3 different wines, which according to our waiter were \"all over the place\" as far as taste goes- but they were all really good. \n\nThe dim lighting was perfect for a date night. Wasn't crowded at all on a Tuesday night, but it didn't feel empty or quiet, which was nice. \n\nToward the end of the night, they kicked it up with some good 90s hip-hopanonymous (probably to get us up and moving) but it just made me want to stay longer! \n\nI'm a fan and will definitely be going back.", "rating": 5, "date": "2013-06-12"}, {"excerpts": ["We ordered the bacon wrapped dates, Tuscan pizzetta, and mac 'n cheese. ", "Each items was great!! ", "The bacon wrapped dates offered a perfect balance of sweet and salty. ", "The Tuscan pizzetta was not a flat bread - it was a thin wheat crust loaded with tons of yummy, fresh veggies. ", "The mac 'n cheese was rich and creamy. ", "I especially loved the dates and pizzetta. "], "author": "Hollie T.", "review": "I came here with my Mom 2 months ago - sorry for reviewing so late, but I remember our experience like it was yesterday, I promise!\n\nService: My Mom had never been to a place like this before, and we both don't know much about wine so we were happy to have an awesome server who guided us through choosing 2 great wine flights. Once he served the flights, he described what flavors to expect from each wine we'd be drinking in great detail. We then ordered 3 menu items and he brought each one out with perfect timing as we worked our way through each wine glass.\n\nFood: We ordered the bacon wrapped dates, Tuscan pizzetta, and mac 'n cheese. Each items was great!! The bacon wrapped dates offered a perfect balance of sweet and salty. The Tuscan pizzetta was not a flat bread - it was a thin wheat crust loaded with tons of yummy, fresh veggies. The mac 'n cheese was rich and creamy. I especially loved the dates and pizzetta. The mac 'n cheese was definitely good, but if I went again I would consider trying one of the salads or other items instead.\n\nThe overall experience was fantastic, and I would love to come here again next time I visit San Francisco!", "rating": 5, "date": "2011-09-25"}, {"excerpts": ["In particular I don't think I've ever heard more raving about the bacon wrapped dates.  ", "The tuna tartare was super as well.  ", "They both passed plates and had stuff set out.  ", "Music was set to my brother's favorite music, and the place was lit with candles, and looked great.  ", "We had 50 people there, but you easily could have fit more or less and it would have been equally nice, the way the room is organized.  ", "We had beer options, but most people drank wine, of which we had a sparkling, white, rose, and 2 red options!  ", "The bartenders seemed to remember everything everyone was drinking!  ", "Very impressive!  ", "The overall bill was totally reasonable and under what we had budgeted for.  ", "Finally, she let us bring in cupcakes at no extra charge!  ", "I would highly recommend Nectar Wine Lounge for any event (birthday, work, Christmas party) of 30-80 people (can't remember the exact limit).  ", "It's in a great location and we were more than pleased with absolutely everything!"], "author": "Lindy I.", "review": "I planned my brother's 40th birthday party here.  I can't explain how easy they were to work with.  First of all, to rent out the entire place, there was only a food and drink minimum, and a $100 deposit, both of which I felt were more than reasonable.  Leah was really responsive, had great ideas and was extremely nice.  The food was amazing.  In particular I don't think I've ever heard more raving about the bacon wrapped dates.  The tuna tartare was super as well.  They both passed plates and had stuff set out.  Music was set to my brother's favorite music, and the place was lit with candles, and looked great.  We had 50 people there, but you easily could have fit more or less and it would have been equally nice, the way the room is organized.  We had beer options, but most people drank wine, of which we had a sparkling, white, rose, and 2 red options!  The bartenders seemed to remember everything everyone was drinking!  Very impressive!  The overall bill was totally reasonable and under what we had budgeted for.  Finally, she let us bring in cupcakes at no extra charge!  I would highly recommend Nectar Wine Lounge for any event (birthday, work, Christmas party) of 30-80 people (can't remember the exact limit).  It's in a great location and we were more than pleased with absolutely everything!", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["He ordered the bacon wrapped dates and a velvety Cabernet Sauvignon. ", "I had the bubbles flight and a carmel fudge dessert. ", "The dates received a raving review, and the dessert was a beautiful finish. ", "The red wine was a little heavy for me, strong in tannins. ", "The flight was good too, I enjoyed 2/3. ", "One has a burnt honey and old wood flavor, the others were subtle, enjoyable, but not memorable. ", "For a bubbles enthusiast, visit Mumm winery in Napa."], "author": "Katie K.", "review": "This is a cute date night spot, a little loud. My boyfriend and I came here last week for drinks. He ordered the bacon wrapped dates and a velvety Cabernet Sauvignon. I had the bubbles flight and a carmel fudge dessert. The dates received a raving review, and the dessert was a beautiful finish. The red wine was a little heavy for me, strong in tannins. The flight was good too, I enjoyed 2/3. One has a burnt honey and old wood flavor, the others were subtle, enjoyable, but not memorable. For a bubbles enthusiast, visit Mumm winery in Napa.", "rating": 4, "date": "2013-02-21"}], "farro salad": [], "mixed lettuce salad": [], "ahi tartare": [{"excerpts": ["If you're looking for a bite to eat, the ahi tartare here is superb. ", "So is the truffle mac n cheese."], "author": "Riz W.", "review": "I love this place for a casual night out.\n\nIf you like medium-to-full bodied/big flavor reds, try the Twenty Rows cab or the Turley \"juvenile\" zin.\n\nIf you're looking for a bite to eat, the ahi tartare here is superb. So is the truffle mac n cheese.", "rating": 4, "date": "2015-08-02"}, {"excerpts": ["The arugula salad, ahi tartare, and truffled mac and cheese are all really good. ", "Good wine selection. ", "The place is a little small ", "but I've never had a problem getting a table. ", "I've never seen it packed to capacity, which is a nice change for the Marina."], "author": "Christy M.", "review": "Cozy little wine spot. The arugula salad, ahi tartare, and truffled mac and cheese are all really good. Good wine selection. The place is a little small but I've never had a problem getting a table. I've never seen it packed to capacity, which is a nice change for the Marina.", "rating": 4, "date": "2014-01-04"}, {"excerpts": ["We also snacked on the warm olives, butter squash gnocci and the ahi tartare. ", "The Ahi and the Olives were amazing! ", "great flavor. ", "The gnocci was a little too sweet for my liking. "], "author": "Whitney S.", "review": "Such a fun wine bar! I haven't been yet for their happy hour but I will definitely be going back.\n\nA friend and I went to Nectar on a rainy Thursday night and this place was packed! It was just a little bit after 7pm, we walked in and it the place was buzzing with people. Besides hot top chair at the bar, they have small small table with comfy,  plush  chairs and a few high top tables. In the back, there are larger tables for partied of 4 or more,\n\nWe sat at the bar and ordered two flights of their \"bubbles\". Their flights consist of 3/4 to 1/2 glasses of red, white or prosseco/champagne going from lightest to heaviest for $14. Great deal!\n\nWe also snacked on the warm olives, butter squash gnocci and the ahi tartare. The Ahi and the Olives were amazing! great flavor. The gnocci was a little too sweet for my liking. They almost tasted like a snickerdoodle.\n\nThe wine can be a little on the pricey side but like i said, they have great deals during their happy hour and the flights were a great price. \n\nNectar is located next to other local bars and food places and right in the heart of the Marina. Fun place to start or end your night.", "rating": 4, "date": "2011-11-12"}, {"excerpts": ["Then came out a ahi tartare and a mac n cheese. ", "The food paring probably not what most of you foodies would consider ideal, but I was really wanting to try the mac. ", "I like it, but did not love it. ", "maybe I'm used to the Bell Towers truffle mac which is one of my all times favorites. "], "author": "V B.", "review": "Yesterday afternoon I took my odd looking crooked face into a wine shop and purchased a case of wine that had a bunch of weird names. I was going for a theme. What kind of theme I don't know, but now I am stuck with case of weird sounding wines resting at my feet.\n\nSince I was killing time and my friend lives around the corner and she was being a slacker and working from home I figured I would drop by and let her buy me dinner. \n\nShe wanted Chinese and I wanted something \"cheesy\". We decided to compromise and stoped in at Nectar. \n\nThey too have many wines with weird sounding names and also some normal stuff too. Two things I love about Nectar 1. They use the proper glass with the proper varietal and 2. The servers usually have some pretty good insight into what they are pouring. \n\nThe food is also pretty darn good. The menu is not extensive and limited, but there is enough to keep most people interested. We shared a few things and took bites off each other's plates. We started off with a crab and artichoke gratin thing that I loved. The gratin was a little flaky but not too heavy (just like me). \n\nThen came out a ahi tartare and a mac n cheese. The food paring probably not what most of you foodies would consider ideal, but I was really wanting to try the mac. I like it, but did not love it. maybe I'm used to the Bell Towers truffle mac which is one of my all times favorites. But the ahi I thought was excellent and nice and raw and I could feel the fish flopping in my mouth after each bite. \n\nFor dessert we shared the butterscotch pot de creme. Now I am a big fan of the pot de creme at Town Hall and almost second guessed myself and did not order it. But in the end, we were both glad we did. Excellent dish!\n\nAdd one star for the rockstar parking I scored\n\nMinus one star for getting interrupted by my friend and her constant texts from her bf.\n\nDude! she was my date for the night!", "rating": 3, "date": "2010-03-11"}, {"excerpts": ["Food-we just tried the ahi tartare and salmon flatbread. ", "Salmon flatbread was a tasty light treat that complements the wine pretty well. ", "Can't say I'm a fan of the ahi tartare. ", "I personally love ahi tartare ", "but it didn't taste very fresh, too chewy, and not very flavorful. ", "I heard the mac'n'cheese is great "], "author": "stephanie c.", "review": "First time at Nectar...came on a Saturday night with a girlfriend and we had a great time. Couple of great pro's\n\n1) Good wine list! I noticed there was a retail price next to each wine and puzzled I asked about it. Who writes the retail price next to the restaurant bottled price so people know how much more they're paying to drink in house??!?...The bartender informed me that they actually sell wines there as well so if you taste a wine you enjoy, they'll sell it to you for the much lower retail price...never experienced that before...can you say AWESOME?!? (also love how they present the bottle in front of you and leave it there while you wine taste so you can inspect and read the labeling to become more familiar with the particular wine)\n\n2) Service-speedy, personal, and fun. Our bartender Alex was awesome, incredibly knowledgeable and helpful with the wine list. It was our first time there but we felt like regulars. He was funny, engaging, and personable. Later when these guys tried to talk to me and my gf...he and the other staff made sure we were okay. Everyone there was great, protective yet not intrusive, and made the experience a really enjoyable one. \n\n3) Food-we just tried the ahi tartare and salmon flatbread. Salmon flatbread was a tasty light treat that complements the wine pretty well. Can't say I'm a fan of the ahi tartare. I personally love ahi tartare but it didn't taste very fresh, too chewy, and not very flavorful. I heard the mac'n'cheese is great but we were going light that night.\n\n4) Ambiance-great. Good music, good bar seating, plenty of cozy tables and couches for more privacy. Good place to sip wine at a bar, go on a date, or bring a group of friends to socialize.\n\nOverall-loved it. The service, the wine, the ambiance....all excellent and would definitely come back again.", "rating": 5, "date": "2010-03-07"}], "smoked salmon flatbread": [{"excerpts": ["I would definitely have the smoked salmon flatbread. "], "author": "Jonathan L.", "review": "This place is money. First time we went here was on a Friday night. I expected it to be extremely crowded and that we'd have to wait a while but when we got there, there were plenty of seats available at the bar. Unlike some other lounges I've been to, it was very laid back with some mellow music in the background and dim lighting filling the room. The bartender was very helpful and recommend excellent selections of wine. The food is great. I would definitely have the smoked salmon flatbread. The bartender was also kind enough to let us keep a menu so we wouldn't have to remember the names of the wines. \n\nThis is a great place to go if you just want a place to chill and relax for a while.", "rating": 4, "date": "2009-06-04"}, {"excerpts": ["We followed that up with the smoked salmon flatbread. ", "It was tasty, and the crust was crisp and light. ", "I would have liked to see a little more lemon zest in the creme fresh topping, I felt it needed a little more zing ", "and I was unable to detect any lemon at all. ", "Mr. F had a flight of bubbles and I had the Anything but Chardonnay flight. ", "I enjoyed the minerally, crisp Riesling that presented itself first and the Verdejo. ", "Mr. F enjoyed his bubbles and we finished up by sharing a glass of Uncle Dick, the sparkling Shiraz, which, I lamented I hadn't ordered earlier because it would have been lovely with the charcuterie."], "author": "Joyce H.", "review": "Last night was my 4th or 5th visit. I consistently enjoy this tucked away wine bar. The food is tasty, the service is very good and friendly in an unpretentious way, and the wine selection is wonderful. It's worth it just to go and read the descriptions in the wine list, an evenings worth of entertainment can be had reading them to one another at the table. \nLast night the ubiquitous Mr. F and I nipped in after a  lovely beer and cheese tasting at the SF cheese school. We were in need of some protein and carbohydrate back up after foundering ourselves on cheese. We ordered the Charcuterie platter with the house-made pate, the lomo, and the braseola. They were all very good, a testament to the beauty of porcine and bovine fabulousness two small ramekins of mustard, a dijon and a seedy brown along with olives, some thinly sliced onion, capers and bread made there way to the table with the meats and we're rapidly consumed. We followed that up with the smoked salmon flatbread. It was tasty, and the crust was crisp and light. I would have liked to see a little more lemon zest in the creme fresh topping, I felt it needed a little more zing and I was unable to detect any lemon at all. Mr. F had a flight of bubbles and I had the Anything but Chardonnay flight. I enjoyed the minerally, crisp Riesling that presented itself first and the Verdejo. Mr. F enjoyed his bubbles and we finished up by sharing a glass of Uncle Dick, the sparkling Shiraz, which, I lamented I hadn't ordered earlier because it would have been lovely with the charcuterie.", "rating": 4, "date": "2009-12-08"}, {"excerpts": ["The four of us also shared a cheese plate, the smoked salmon flatbread,  roasted red pepper and zucchini pizzetta with pepperoni, braised short rib, and beef carpaccio.  ", "All were very tasty and perfectly prepared and certainly more than enough food for us."], "author": "Veronica C.", "review": "Nectar SF is a great place to sit around with friends and share small plates and a couple bottles of wine.  The wait staff is friendly and well-versed in wines and cheese.  The last time we were here, we had a tart riesling and a really oak-y cab.  Both were great wines and suggested by our server!  The four of us also shared a cheese plate, the smoked salmon flatbread,  roasted red pepper and zucchini pizzetta with pepperoni, braised short rib, and beef carpaccio.  All were very tasty and perfectly prepared and certainly more than enough food for us.", "rating": 4, "date": "2008-09-03"}], "garden flatbread": [{"excerpts": ["My favorites were the burrata, garden flatbread, and the truffle mac n cheese."], "author": "Cindy K.", "review": "I called around to several wine bars in the city and it was surprising that nobody cared to help me out with a reservation. Finding Nectar Wine Lounge was amazing for me. Leia promptly called me back and gave me the details. I got my reservation no fuss no muss! She even called the day before to confirm with me. \n\nThey were able to pull together a few tables to fit our party (16+ girls). Great place and low key for some wine and bites! Also, I chose this place because they have a huge variety of wine flights and wine in general. Leia knows a lot about their wines and gave good recommendations. \n\nThe food here is phenomenal too! My favorites were the burrata, garden flatbread, and the truffle mac n cheese.", "rating": 5, "date": "2016-03-16"}, {"excerpts": ["French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... ", "it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. "], "author": "Kendall S.", "review": "This is the only place I visited twice in one trip last time I went to SF, and I wish I could go back right now. Adam and I were a bit early for our dinner reservation at Isa's next door, so we moseyed around a bit, just taking in the environment and beautiful weather. From the moment I saw the words \"wine lounge\" on Nectar's door and peered through the windows into its cozy, romantic atmosphere, I knew we had to stop in for a glass of wine. What better way to spend 30 minutes before dinner?\n\nWe took a seat at the bar and were immediately greeted, but not bombarded, which is always appreciated. It's gorgeous inside; dim lighting, dark furniture, beautiful shelves full of beautiful wine, candlelight... The bartenders are knowledgeable and personable, and most importantly, they seem to genuinely enjoy their job. It's such a relaxing and artful atmosphere that lures you in and makes you want to stay all night. We left for dinner and then came back right afterwards!\n\nEven if Nectar had sub-par food and a boring wine menu, I'd still love this place. That's how much I enjoyed the ambiance and the service. But, of course, their menus are just incredible! This is my kind of food, y'all. I didn't eat a meal here, unfortunately, but I drooled over their menu for far too long. French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. Oh my gods... the popcorn. I had to have it, even though I was about to head to dinner. Best popcorn I've ever eaten, you guys. Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. $7 for a large enough portion to share? Amazing!\n\nI apologize for getting this far into a wine lounge review without mentioning the wine, which was fantastic. I went with a prosecco, of course. They have fabulous wine flights and descriptions with a sense of humor. \"Crisp & Unpretentious Whites\" as well as \"Rich and Extroverted Whites.\" For the reds, \"Playful yet Thoughtful,\" \"Sensualist,\" and \"Hedonist.\" I love it! I really do love everything about Nectar. They were even playing Valkyrie on the wall with a projectior, and you know I'm a Tom Cruise fan!", "rating": 5, "date": "2014-04-02"}, {"excerpts": ["+They change them out seasonally, but right now the Garden Flatbread pizza is rocking my world with the peppers and corn. \n", "+Prosciutto Flatbread- was not a fan of this one. ", "The prosciutto was hard, chewy and way too salty. ", "The flatbread also had a strong olive tapenade that was thrown on there in chunks. ", "I'd rather have that smeared on the bread as a base.\n", "+I'd get a couple of flights of wine to share because they have a great selection. ", "Feel free to tell the manager what you're looking for so he can bring out some samples before you choose.\n"], "author": "Sangita A.", "review": "Come here for the happy hours from 3-7PM M-F! I've been here a handful of times now and it never disappoints.\n*They currently have a $10 for $20 yelp deal so make sure to take advantage of that during non-happy hour times.\n\nFood:\nMy favorites are the flatbreads. \n+They change them out seasonally, but right now the Garden Flatbread pizza is rocking my world with the peppers and corn. \n+Prosciutto Flatbread- was not a fan of this one. The prosciutto was hard, chewy and way too salty. The flatbread also had a strong olive tapenade that was thrown on there in chunks. I'd rather have that smeared on the bread as a base.\n+I'd get a couple of flights of wine to share because they have a great selection. Feel free to tell the manager what you're looking for so he can bring out some samples before you choose.\n+They used to carry this non-alcoholic orange type drink that my husband loves, but they're working on bringing it back!\n\nService\nA+ for service. Robin, the manager, is such a pleasure to talk to whenever my husband and I go in and ask for recommendations. He's very friendly and makes his customers feel very welcome! One time, I came in after my half marathon with a injured ankle and he brought me cloth napkins filled with ice to help. Very thoughtful of him. Katy served us last time and messed up our order and bill once or twice but she was apologetic and sweet, so we didn't mind.\n\nAmbience:\nLove the feel of this lounge. Plenty of sofas and lounge space in the front of the restaurant, a long bar and then proper tables for dining in the back. The mood, lighting, ambience and feel is great all around.\n\nWe've brought several friends here from out of town after dinner and it's always a good time!\n\n-Hungry Hungry Pongy", "rating": 5, "date": "2013-06-09"}], "veggierama": [], "luscious lentils": [], "baked polenta": [{"excerpts": ["French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... ", "it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. "], "author": "Kendall S.", "review": "This is the only place I visited twice in one trip last time I went to SF, and I wish I could go back right now. Adam and I were a bit early for our dinner reservation at Isa's next door, so we moseyed around a bit, just taking in the environment and beautiful weather. From the moment I saw the words \"wine lounge\" on Nectar's door and peered through the windows into its cozy, romantic atmosphere, I knew we had to stop in for a glass of wine. What better way to spend 30 minutes before dinner?\n\nWe took a seat at the bar and were immediately greeted, but not bombarded, which is always appreciated. It's gorgeous inside; dim lighting, dark furniture, beautiful shelves full of beautiful wine, candlelight... The bartenders are knowledgeable and personable, and most importantly, they seem to genuinely enjoy their job. It's such a relaxing and artful atmosphere that lures you in and makes you want to stay all night. We left for dinner and then came back right afterwards!\n\nEven if Nectar had sub-par food and a boring wine menu, I'd still love this place. That's how much I enjoyed the ambiance and the service. But, of course, their menus are just incredible! This is my kind of food, y'all. I didn't eat a meal here, unfortunately, but I drooled over their menu for far too long. French, Spanish, local, and Irish cheese, butternut squash pizzetta, burrata with prosciutto, garden flatbread, baked polenta... it's a seasonal menu full of fresh and local ingredients, and each dish has a recommended wine listed beside it. For starters, they have roasted olives, bacon wrapped dates, and black truffle popcorn. Oh my gods... the popcorn. I had to have it, even though I was about to head to dinner. Best popcorn I've ever eaten, you guys. Perfectly popped, beautifully light, and perfectly, delicately enhanced with truffle. $7 for a large enough portion to share? Amazing!\n\nI apologize for getting this far into a wine lounge review without mentioning the wine, which was fantastic. I went with a prosecco, of course. They have fabulous wine flights and descriptions with a sense of humor. \"Crisp & Unpretentious Whites\" as well as \"Rich and Extroverted Whites.\" For the reds, \"Playful yet Thoughtful,\" \"Sensualist,\" and \"Hedonist.\" I love it! I really do love everything about Nectar. They were even playing Valkyrie on the wall with a projectior, and you know I'm a Tom Cruise fan!", "rating": 5, "date": "2014-04-02"}], "truffled mac n cheese": [{"excerpts": ["I ordered the truffled Mac n cheese and will not be ordering it again!  Tasted more oily than cheesy.  ", "Next time I'll be sure to try the truffle popcorn everyone raves about and their meat and cheese platter."], "author": "Brittany W.", "review": "Friday night well spent!  Very pleased with the ambiance.  Romantic lighting but still a place to bring a group of friends.\n\nI love the background music!  Very different from any usual bar.  They'd play a Hiphop song like Jay-Z's Big Pimpin', but the sound of their audio made it so you don't necessarily here the rapping but just the beat.\n\nI like how you can choose if you want a 3oz or 6oz glass of wine.  Since I'm not a big drinker, I'll get the 3oz next time (also cheaper).  Took me forever to finish the 6oz.\n\nI ordered the truffled Mac n cheese and will not be ordering it again!  Tasted more oily than cheesy.  Next time I'll be sure to try the truffle popcorn everyone raves about and their meat and cheese platter.", "rating": 5, "date": "2015-09-26"}], "butterscotch pot de crème": [], "lisbon lemon cheesecake": [], "a selection of": [], "each additional selection": [], "saint nectaire fournols france": [], "brillat savarin triple cream normandy france": [], "cashel blue tipperary ireland": [], "manchego la mancha spain": [], "ptit basque basque france": [], "castelbelbo piedmont italy": [], "humboldt fog arcata california": [], "midnight moon arcata california": []}