{"valrhona chocolate chocolate claw": [{"excerpts": ["+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n", "+"], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}], "pistachio blackberry twice baked croissant": [{"excerpts": ["The GINGER PULL APART and the PISTACHIO BLACKBERRY TWICE BAKED CROISSANT changed my life forever!!! ", "We also had a savory Croque that was amazing. ", "I also wanted to get the kouign amman ", "but they didn't have it that day. ", "Ginger Pull ", "Apart was gingerly and sticky with the perfect texture and consistency. ", "The twice baked croissant tasted twice as good for a regular croissant. ", "Definitely want to come back and try everything else next time. ", "I might need to move back to the bay area just for this!!!! ", "The line may look intimidating when you see it ", "but it moves pretty quick and service is friendly!"], "author": "Sylvia L.", "review": "This place is HEAVEN!! Woke up early one Saturday morning and drove over to see a line about 20 deep. They have tables and benches right outside and saw some folks enjoying the scrumptious goodies. At that point I decided I needed ONE OF EVERYTHING! The GINGER PULL APART and the PISTACHIO BLACKBERRY TWICE BAKED CROISSANT changed my life forever!!! We also had a savory Croque that was amazing. I also wanted to get the kouign amman but they didn't have it that day. Ginger Pull Apart was gingerly and sticky with the perfect texture and consistency. The twice baked croissant tasted twice as good for a regular croissant. Definitely want to come back and try everything else next time. I might need to move back to the bay area just for this!!!! The line may look intimidating when you see it but it moves pretty quick and service is friendly!", "rating": 5, "date": "2017-09-25"}, {"excerpts": ["Pistachio blackberry twice baked croissant and ginger ", "pull apart were my favorites. ", "Came around 30 minutes before closing and there was still a line of people trying to get whatever baked goods they had left. ", "Definitely coming back."], "author": "Jeana Y.", "review": "This place is so good! Pistachio blackberry twice baked croissant and ginger pull apart were my favorites. Came around 30 minutes before closing and there was still a line of people trying to get whatever baked goods they had left. Definitely coming back.", "rating": 5, "date": "2018-02-26"}, {"excerpts": ["Pistachio Blackberry Twice Baked Croissant ($4.25), Butter Croissant ($3), Lemon Lime ", "Doughp Bun ($4) "], "author": "Amy D.", "review": "Butter Croissant #39 on the 2016 7x7 100 Things to Eat Before You Die list.\n\nI finally made it to Neighbor Bakehouse during a Thursday afternoon since I was off of work. They were already sold out of a bunch of items, such as a financier, doughp flavor, and others, but there was still a good selection to choose from. There was only a short wait, and I ended up trying:\n\nFrom L to R: Pistachio Blackberry Twice Baked Croissant ($4.25), Butter Croissant ($3), Lemon Lime Doughp Bun ($4) [http://www.yelp.com/user_local_photos?select=X32__i_R71WSgRXlEEmMkg&userid=76vIFZcC7owykCBjMfGVXg]\n\n-Butter Croissant ($3): Yum- super buttery and flaky, this is one of the best versions I've had in a while- a must order! I can see why this is on the 7x7 list.\n-Lemon Lime Doughp Bun ($4): Just ok, but I thought the lemon lime filling was too tart. I would try this again if it had another filling (like their chocolate pudding one) since the consistency of the doughp bun was interesting.\n-Pistachio Blackberry Twice Baked Croissant ($4.25): Also delicious, and another must order! They do not skimp on the filling, and although the filling is plentiful, it isn't too sweet.\n\nI will definitely be back to get more croissants, and also to try their other items and breads. Parking is the most difficult part about coming here since there are only a few spots in the tiny lot in front of the store, and there wasn't much available street parking to be found.", "rating": 4, "date": "2016-11-09"}, {"excerpts": ["Order the pistachio blackberry twice baked croissant and thank me later "], "author": "Leana L.", "review": "I've LOVE this place.\n\nOrder the pistachio blackberry twice baked croissant and thank me later :)\n\nI've also had the ginger pull apart (the ginger flavor is strong, so you really have to like ginger to like this) and the butter croissant (a solid croissant).\n\nThe line can get long, but it moves along. It's a good thing this place is almost a mile and a half away because it forces me to either walk or run there and burn some calories before inhaling them all in again.", "rating": 5, "date": "2017-07-01"}, {"excerpts": ["2 Pistachio Blackberry Twice Baked Croissant - My second favorite as it was not overly sweet "], "author": "Joyce Z.", "review": "As soon as I saw SF CM Ben's picture of the passion fruit croissant from Neighbor, bookmark!!  Since I wanted to hit up his other reco Plow for breakfast/brunch, I knew I needed to be committed and get myself up NLT 6:30AM on a Sunday so I can get the best of both worlds while minimizing my wait time.  We arrived at Neighbor around 7:30 when most of SF is still sleeping and therefore super quiet as we walked up which immediately reminded me of my early morning arrival in Portland Maine not too long ago before it started bustling.  Just like Two Fat Cats in Portland, most of their freshly baked pastries are still on racks upon walking in enticing me to get more than I really needed.  \n\nPassion Fruit DoughP Bun - This was my favorite one that I wished my husband didn't forget the cooler so I could take one to go since the cream of the DoughP requires refrigeration if you don't eat it soon after purchase.  \n\n2 Pistachio Blackberry Twice Baked Croissant - My second favorite as it was not overly sweet and I love the nuttiness of the whole pistachios giving it a good balance.  \n\nTwo Morning Buns with Ham and Gruyere - It was good but I kind of wish there was a little more gruyere in it to fill in the hole in the middle.  \n\nHazelnut Candy Orange Financier - This was on the dense side kind of like a pound cake\n\nGinger Pull Apart - Upon first bite, I wasn't a fan but as I continued, I liked it more.  Good for sharing but probably a bit too much for one person especially if you want to try other pastries.  \n\nOverall, Neighbor Bakehouse is a great friendly neighborhood bakery that I just wish was in my neighborhood but then again, it is probably better for our waistline that it is a 45+ min drive away, making it more of a treat than an addiction!!", "rating": 5, "date": "2016-06-09"}, {"excerpts": ["I'm in love with the pistachio blackberry twice baked croissant! ", "Well, I love croissants in general ", "but I think of this place when I'm craving croissant. ", "Another favorite is the ginger pull-apart. "], "author": "Diana C.", "review": "I'm in love with the pistachio blackberry twice baked croissant! Well, I love croissants in general but I think of this place when I'm craving croissant. Another favorite is the ginger pull-apart. When I'm feeling something savory, I'd get the smoked salmon croissant.\n\nThere's usually a line rain or shine, but the line moves quickly. Not a lot of parking around the area and they'll only have a few tables out when it's sunny, so I usually get stuff to go rather than eat there.", "rating": 5, "date": "2016-11-27"}, {"excerpts": ["Pistachio Blackberry Twice Baked Croissant - 5/5\n", "Bostock w/ Almond Frangipani - 4/5\n", "Ginger Pull ", "Apart - 4/5\n", "Coffee Spice Cake - 2/5\n", "Hazelnut Financier - 3/5\n"], "author": "Mark O.", "review": "It took me a long time to remember to go to Neighbor Bakehouse on one of the two half days that is is actually open. Today was that day. On my way back from dogpatch I got off at the 20th street stop and picked up a box with one of of almost every type of pastry they had. \n\nThe shop itself has almost no room for customers so the line very quickly wraps around out the door. It does move quickly though and they are smart in having the coffee service on an exterior window.\n\nFor my tastes the pastries varied in quality. I'll just go down the list with ratings but I will say that I was blown away by the pistachio blackberry croissant and underwhelmed by the mushroom tart that everyone mentions in their reviews.\n\nChocolate claw - 2/5\nPistachio Blackberry Twice Baked Croissant - 5/5\nBostock w/ Almond Frangipani - 4/5\nGinger Pull Apart - 4/5\nCoffee Spice Cake - 2/5\nHazelnut Financier - 3/5\nMushroom Tart - 3/5\n\nOverall, this is a great bakery with some really unique items. The hours suck but it is definitely worth a stop if you're randomly in the area on a wednesday or saturday morning. \"I'm a fan.\"", "rating": 4, "date": "2015-02-25"}, {"excerpts": ["As for sweet, my favorite was the pistachio blackberry twice baked croissant, but the bostock and pastelito and macaroon were all amazing too. "], "author": "David B.", "review": "Greg Mindel is a master of laminated doughs and pastries, and it shows in every single product produced at Neighbor. The savory pastries were delicious - including the OG regular croissant, filled with buttery goodness and flaky, shattering layers. The everything croissant and ham and cheese morning bun were flavorful and hard to stop eating too. \n\nAs for sweet, my favorite was the pistachio blackberry twice baked croissant, but the bostock and pastelito and macaroon were all amazing too. The chocolate pudding inside the little dough ball thing was killer as well. \n\nThanks Greg for a great experience and very full bellies!", "rating": 5, "date": "2016-01-26"}, {"excerpts": ["Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+", "Ginger Pull-apart", ": ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+", "*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning ", "Bun\nGuava Cheese Pastelito\n"], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["the ham and cheese morning bun and the pistachio blackberry twice baked croissant. "], "author": "Elizabeth B.", "review": "This is the best bakery I have ever been to!\n\nEverything I have tried here has been awesome, but so far my favorites have been the ham and cheese morning bun and the pistachio blackberry twice baked croissant. With both of these options, the fillings are delicious and spread nicely throughout the middles, and the dough is perfectly flaky and flavorful.\n\nIt's better to get here in the earlier part of the morning because they start to sell out of certain options early and by noon you may only have a fraction of the menu left from which to choose.", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar"], "author": "Rob C.", "review": "place is like Mr Holmes.  but I think the pastries would taste even better heated. ginger pull apart, nice sugar and subtle ginger, caramelized brown sugar on the bottom.  the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar", "rating": 5, "date": "2016-02-21"}, {"excerpts": ["Also got everything croissant, butter croissant, chocolate chocolate claw, pistachio blackberry twice baked croissant and a cookie. ", "All were excellent. ", "I wished it was closer to where I live so that I can go everyday for my pastry fix."], "author": "Mary L.", "review": "Definitely did not disappoint me!  The line was long but I have been wanting to try their pastries for so long so I stayed in line. They are so efficient that it only took about 10-15 mins. total. I was expecting way longer like B Patisserie. The ginger pull apart was amazing and a must get. Also got everything croissant, butter croissant, chocolate chocolate claw, pistachio blackberry twice baked croissant and a cookie. All were excellent. I wished it was closer to where I live so that I can go everyday for my pastry fix.", "rating": 5, "date": "2016-04-09"}], "ginger pullapart": [{"excerpts": ["Ham and Cheese morning bun - savory with sweet \n\nRaspberry hazelnut twice-bake -  smallest and sweetest of the bunch, very moist with the fresh fruit\n\nGinger pullapart - my son's favorite, largest pastry we got, "], "author": "Connie W.", "review": "Street parking was easy for 9:30 on Sun morning.\nLined up outside and ate outside at communal picnic tables.  The vibe is relaxed and laid back. \nThe weather in Jun was typical morning overcast, not too cold, not too hot.  It was perfect weather to eat outside.  But I can imagine the short raining season when it might not work for alfresco dining.\nSeems like all the pastries  we ate was a croissant derivative, real buttery and flaky, 5 starts for each item.\n\nEverything Croissant - seeds and nuts on the outside, soft cream cheese on the inside, I can imagine being in France.\n\nHam and Cheese morning bun - savory with sweet \n\nRaspberry hazelnut twice-bake -  smallest and sweetest of the bunch, very moist with the fresh fruit\n\nGinger pullapart - my son's favorite, largest pastry we got, very little hint of ginger taste, reminds me of monkey bread but better\n\nCinnamon Almond Bostock - This is almond fantasy, cake like toast with almond taste, my personal favorite", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["Ginger pullapart was light on the ginger, in that there was more of a subtle spiciness as opposed to a full blown ginger flavor (which I enjoyed, but also disappointed someone else in my party who wanted more ginger).\n\n"], "author": "Anna C.", "review": "Can't believe I didn't hear about this place earlier!!! We actually stumbled upon this bakery while we were waiting for a spot at aina.\n\nThe croissant alone earns this place its 5 stars - buttery, flakey, perfectly laminated, chewy inside...as good as it gets outside of France. Love the first bite, which is slightly crunchy. Get a napkin and eat carefully, as the flakes are sure to get all over your shirt!  \n\nOther yummy things we got: the twice baked croissants (raspberry version and pistachio version) - both lovely, but definitely on the sweeter side, approaching cloying for this future diabetic. Ginger pullapart was light on the ginger, in that there was more of a subtle spiciness as opposed to a full blown ginger flavor (which I enjoyed, but also disappointed someone else in my party who wanted more ginger).\n\nI'm definitely coming back for more...*loosens belt*\n\nTip: Don't be frightened away by the line, it moves pretty fast!", "rating": 5, "date": "2017-12-12"}, {"excerpts": ["Ginger Pullapart - Also very good but a clear # 5 for me \n6) ", "Passion Fruit Doughp ", "Bun  -  ", "My wife liked this dish a lot ", "but I'm not a big fan of fruits in baked items in general ", "but it was pretty good as well.\n"], "author": "Rod M.", "review": "I've been to almost all of the \"name\" bakeries in the past couple months in the city and I must admit this place is up there. \n\nLocated in the dogpatch , it provides great variety of dishes and good bang for your buck compared to some of the other spots. \n\nIt took me awhile to decide what to get but I encourage you to try several of the items since two of the items that were essentially my \"last picks\" ended up being my faves. \n\nThis is what I picked up (don't judge, LOL..I'm in the gym everday sucka!!) \n\nFrom fave to least fave:  Everything was good. \n1)Cinnamon Almond Bostock - This was delicious and I almost didn't snag it. Savory,moist \n2) Ham Cheese Morning Bun -  This also was suprisingly good. First couple bites I was going to toss it but it got better the closer you got to the center\n3) chocolate chip cookie  - As the employee noted, this tastes the best fresh.  Super delicious choco cookie \n4) Pistachio Blackberry Twice Baked Croissant - The wifey really like this and it was good just 4th for my list \n5) Ginger Pullapart - Also very good but a clear # 5 for me \n6) Passion Fruit Doughp Bun  -  My wife liked this dish a lot but I'm not a big fan of fruits in baked items in general but it was pretty good as well.\nI like lists what can I say? \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the SF Bakeries I've visited and I indicated what they're known for or a dish I recommend:\n\nRod's SF Bakery rankings (and what they're known for or what I like). ?) Follow my profile to see my most recent reviews I hope I can be helpful since so many Yelpers have helped me discover new places. \n1 Neighbor Bakehouse=cinammon almond bostock\n2 B Patisserie=Choco Bannana croissant\n3 Zanze's Cheesecake=Regular cheesecake\n4 Ariscault =Croissant\n5 Yasukochis=Coffee Crunch Cake\n6 Chili Pies Baking Co=Pies\n7 Dynamo Donuts=donuts\n8 Golden Gate Bakery=Egg tart\n9 Mr Holmes Bakehouse=Green tea croissant ,Cruffin, \n10 La Luna Cupcakes=cupcakes\n11 Three Babes Bakeshop=pies\n12 Anthony's Cookies=Cookies\n13 New Hollywood Bakery=Egg tart\n14 Dianda's Italian American Pastry=Napoleon , Cannoli\n15 Mission Pies=Banana Cream Pie\n16 Schubert=Swedish Princess cake\n17 Yummy Bakery=egg tarts\n18 Stella Pastry & Café=Cannoli , Tiramisu\n19 Craftsman & Wolves=Rebel within\n20 Bob's Donut & Pastry Shop=any donut \n21 Noe Valley Bakery=dipped cupcake\n22 Café Greco=Cannoli \n23 Kings Bakery=Tres leches cake\n24 Benkyodo Co=mochi\n25 Cupcake cove=cupcakes\n26 Cups and Cakes Bakery=cupcakes\n27 Good Mong Kok Bakery=dim sum\n28 Karas cupcake=cupcakes\n29 Mission Minis=cupcakes\n30 Sift Dessert=cupcakes\n31 Tartine Bakery=lemon tart\n32 Jane The Bakery=matcha twist , cardamom Lattice Bun\n33 Café Madeline=various goods\n34 Panaderia La Mexicana=mexican sweet bread\n35 Hot cookie=Cookies\n36 Les Gourmands Bakery=Croissant\n37 Mee Mee Bakery=Cow ears", "rating": 5, "date": "2018-02-24"}, {"excerpts": ["We treated ourselves to a spread of yummies: \n\nPistachio blackberry twice-baked croissant - SUPER flaky and caramelized on the outside\nGinger pullapart - Typically ginger is very overpowering but it was subtle enough to be very enjoyable\nCinnamon almond bostock - My favorite of the bunch, my favorite flavors in a hefty bite\nChocolate pudding doughnut bun - Underwhelming but the amount of pudding does not disappoint!\nPassionfruit fruit coconut macaron - tropical colorful flavors together, delish !\n"], "author": "Crystal N.", "review": "Best bakery I've yet to visit - we stayed at our friend's place this last weekend and were delighted to see that this bakery was just a couple blocks away ! We treated ourselves to a spread of yummies: \n\nPistachio blackberry twice-baked croissant - SUPER flaky and caramelized on the outside\nGinger pullapart - Typically ginger is very overpowering but it was subtle enough to be very enjoyable\nCinnamon almond bostock - My favorite of the bunch, my favorite flavors in a hefty bite\nChocolate pudding doughnut bun - Underwhelming but the amount of pudding does not disappoint!\nPassionfruit fruit coconut macaron - tropical colorful flavors together, delish !\nPassionfruit doughnut bun - my husband's favorite, the passionfruit was so strong !\nSmoked trout and cream cheese croissant - Yummmmmm \nGuava and cream cheese pastelito - Guava was not as strong as I hoped it'd be but still delish !", "rating": 5, "date": "2017-03-01"}, {"excerpts": ["Favorites include:\nPassionfruit doughnut bun\nPistachio blackberry twice-baked croissant \nGinger pullapart \nCinnamon almond bostock"], "author": "I Fan L.", "review": "Some of the best pastries I've had. Favorites include:\nPassionfruit doughnut bun\nPistachio blackberry twice-baked croissant \nGinger pullapart \nCinnamon almond bostock", "rating": 5, "date": "2017-12-01"}, {"excerpts": ["High marks go to the:\n- blueberry pistachio croissant -- a revelation, frankly\n- ginger pullapart -- made perfectly to tear&share\n- mushroom tart -- if you like pastry, mushroom, cheese, then this is your jam\n\n"], "author": "Romeo L.", "review": "Do yourself a favor -- on any Weekend morning, find your way to this magical purveyor of scrumptiously baked goods, wait in line, and start your day with an indulgently sweet and/or savory treat. \n\nTheir staff are a delight. Pastries are quite well portioned. 1-2 per person is perfect. High marks go to the:\n- blueberry pistachio croissant -- a revelation, frankly\n- ginger pullapart -- made perfectly to tear&share\n- mushroom tart -- if you like pastry, mushroom, cheese, then this is your jam\n\nWe'll be back tomorrow.", "rating": 5, "date": "2016-07-09"}, {"excerpts": ["Of all the bakeries in SF, neighbors shines with their unique pastries like ginger pullapart bread for that nice tang to balance the sweetness, or their pistachio blackberry croissant. ", "I've come here multiple times (or more like I've made detours to come here multiple times) as well as to my favorite ice cream shop nearby. ", "Other delicious expertly created pastries I can recall are their mushroom and cheese pastry or passion fruit doughp nut. ", "Try them all. ", "You will not be disappointed."], "author": "joda l.", "review": "Can you drool enough over neighbors bakery? Best bakery.. ever?? Depends on what you like. Of all the bakeries in SF, neighbors shines with their unique pastries like ginger pullapart bread for that nice tang to balance the sweetness, or their pistachio blackberry croissant. I've come here multiple times (or more like I've made detours to come here multiple times) as well as to my favorite ice cream shop nearby. Other delicious expertly created pastries I can recall are their mushroom and cheese pastry or passion fruit doughp nut. Try them all. You will not be disappointed.", "rating": 5, "date": "2016-10-16"}, {"excerpts": ["For sweet pastries, my favorite would be the ginger pullapart (real gingery for you ginger lovers!!) ", "and the blackberry pistachio croissant. ", "BEST. ", "CROISSANT. ", "EVER. ", "There are a ton of good bakeries around the city but Neighbor Bakehouse is truly a gem. "], "author": "Maryann S.", "review": "Easily one of my favorite bakeries! All the savory tarts are amazing I can't even pick a favorite. You should just try all three and decide for yourself! The ingredients and flavors are all so delicate and delicious, you will not e disappointed. For sweet pastries, my favorite would be the ginger pullapart (real gingery for you ginger lovers!!) and the blackberry pistachio croissant. BEST. CROISSANT. EVER. There are a ton of good bakeries around the city but Neighbor Bakehouse is truly a gem. They also serve de la paz coffee so even more incentive to check em out! \n\nIf for whatever reason you're unable to make it out to the dogpatch before noon, you can always try to score a pastry at a local coffee shop. They have a listing of where you can find their pastries so now you have no excuses!", "rating": 5, "date": "2015-10-22"}], "german coffee cake with seasonal fruit": [], "cinnamonalmond bostock": [], "walnut chocolate crumb cake": [{"excerpts": ["Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n", "+", "Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+", "Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n", "+Raspberry Lime Coconut Macron: ($2) ", "No Gluten. "], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}], "brown butter hazelnut financier": [], "guavacream cheese pastelito": [], "raspberrylime coconut macaroon": [], "mushroom green onion manchego tart": [{"excerpts": ["Mushroom Green Onion Manchego Tart: ($3.50) "], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar"], "author": "Rob C.", "review": "place is like Mr Holmes.  but I think the pastries would taste even better heated. ginger pull apart, nice sugar and subtle ginger, caramelized brown sugar on the bottom.  the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar", "rating": 5, "date": "2016-02-21"}], "seasonal veggie tart": [{"excerpts": ["Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+"], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}], "sauerkraut smoked cheddar peppadew tart": [{"excerpts": ["We ordered a Mushroom Tart ($4.50), a Sauerkraut Smoked Cheddar Peppadew Tart ($4.50), a slice of Chocolate Pudding Pie ($7.00), a small baguette, and 2 Drip Coffees. \n\n"], "author": "Alice L.", "review": "We were here on a Sunday at around 10:45am and the line was already out the door. It only got longer as time went by!\n\nWe ordered a Mushroom Tart ($4.50), a Sauerkraut Smoked Cheddar Peppadew Tart ($4.50), a slice of Chocolate Pudding Pie ($7.00), a small baguette, and 2 Drip Coffees. \n\nMushroom Tart had a nice layers of pastry crust. The Sauerkraut Tart was a tad spicy and had a nice smoky flavor. I loved he Chocolate Pudding Pie! It was decadent and creamy. I was not a fan of the crust as it was a bit hard and I couldn't cut it with a fork. I also wish it was served colder. The baguette was pretty good with a nice shell and chewy inside. \n\nOutside seating was nice and my dog also enjoyed this place! I'm looking forward to coming back here to try their Fruit Tart! We were not early enough this time!", "rating": 4, "date": "2018-04-01"}, {"excerpts": ["We ordered:\n\nPistachio blackberry croissants\nCinnamon almond bostock \nChocolate claw \nGinger pull aparts\nSauerkraut smoked cheddar peppadew tart\n\nPersonally, I only tried the pistachio croissant and the cinnamon almond bostock. "], "author": "Ashley W.", "review": "I was pretty skeptical about trying this place out. We wanted to pick up some baked goods for a party we were going to and it was either here or Mr. Holmes. Mr. Holmes was sold out of a lot of items so we headed to Neighbor Bakehouse and man are we glad we did. There was a big line outside on Sunday morning around 11am. It took us about 20-25 minutes to get to the counter. We ordered:\n\nPistachio blackberry croissants\nCinnamon almond bostock \nChocolate claw \nGinger pull aparts\nSauerkraut smoked cheddar peppadew tart\n\nPersonally, I only tried the pistachio croissant and the cinnamon almond bostock. But they were SO good. The croissant was flaky and moist with the perfect amount of pistachio flavoring and the bostock was flavorful with a delicious crust. I didn't try the other items but man, the pastries were the hit of the party and they went quick! Their pastries range from $3-$7ish, which sounds ridiculous but it is worth it once you take that first bite. \n\nParking in this area alright, better than most other parts of SF. We also loved how there were plenty of seats outside that are dog friendly. Lastly, 5 stars for their hipster vibe. \n\nWe will definitely be back!", "rating": 5, "date": "2018-02-06"}, {"excerpts": ["We often get the mushroom tart and sauerkraut smoked cheddar peppadew tart which are both delicious. "], "author": "Richa B.", "review": "We are fans. What else can I say! We live outside the city, but make it a point to stop here every time we pass through San Francisco in the day time. Our favorites are the ginger pull apart (flaky, not too sweet, with a subtle ginger flavor), and my husband always gets the veggie tartine which is loaded with cheese and vegetables. He loves the latte there (I'm not a coffee drinker). We often get the mushroom tart and sauerkraut smoked cheddar peppadew tart which are both delicious. This last weekend I tried the guava and cream cheese pastelito for the first time. I don't know if it beats Porto's in southern California, but it is a lovely norcal alternative. We have passed on our recommendation to this place to lots of San Francisco visitors as we truly believe it is a gem. \n\nNote parking is not easy in this area and expect to circle around for a bit before you find a spot. Also the queue area and seating are both outside (inside is just the actual baking and cash counter), so be prepared for this if it's raining!", "rating": 5, "date": "2017-12-01"}, {"excerpts": ["Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning ", "Bun: ($4.25) ", "Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+", "Chorizo Tart: ($4) "], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar"], "author": "Rob C.", "review": "place is like Mr Holmes.  but I think the pastries would taste even better heated. ginger pull apart, nice sugar and subtle ginger, caramelized brown sugar on the bottom.  the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar", "rating": 5, "date": "2016-02-21"}], "smoked ham and gruyere morning bun": [{"excerpts": ["**Smoked ham and gruyere morning bun. ", "So good. ", "Very flaky. ", "The layers of croissant texture and the look of a morning bun. ", "Its topped with sunflower and poppy seeds. "], "author": "Sandy B.", "review": "Finally here!! And actually got inside shortly before they close. Everything looked great and I wanted everything. I came after brunch therefore I was stuffed already but since I'm in the Dogpatch I had to get some neighbor bakehouse. I had their pastries before because many coffee shops sell them, a few in the fidi. Already knew how delicious their baked goods are. Selections at coffee shops are small. Only had their pistachio blueberry croissant and raspberry lime coconut macaroon. They were both so good, therefore i was super excited for the visit. Pastry heaven.\n\nEveryone was super nice. BEST SERVICE compared to all the bakeries in the city! Staff was super sweet and friendly. \n\nI got 2 of **Smoked ham and gruyere morning bun. So good. Very flaky. The layers of croissant texture and the look of a morning bun. Its topped with sunflower and poppy seeds. Presentation look great and extremely delicious! \n\n**GINGER PULL APART - Have you had the b. patisserie's kouign amann? It's similar but I think this is better, much better. It's made with caramelized with grated ginger, cane sugar and brown sugar. OMGoodness. So crispy and flaky on the outside and soft and moist on the inside. It's not over powering sweet. And the pull apart is huge and it pulls away easily. ha! Can be breakfast for two days or for your lunch. Amazingly delicious! \n\nCan't wait to come back and try everything else!", "rating": 5, "date": "2016-05-02"}, {"excerpts": ["Thanks to her, we've sampled their blackberry croissant, smoked ham and gruyere morning bun, ginger pull aparts and chocolate croissant. "], "author": "Janice C.", "review": "Bossman: \"You know, my intermittent fasting isn't working because of you guys\" \n\nMe: \"True, but you only eat morning buns from Neighbor Bakehouse intermittently (ha). Plus it's so flaky and airy, so you basically save 50% calories versus a croissant.\" \n\nBossman: \"You're so smart. I'll put you in for a promotion ...\"\n\nKidding. That's not how it went down. \n\nThere might not be any promotion in sight, but my future work days have become more promising since I have a co worker who lives near Neighbor Bakehouse. Thanks to her, we've sampled their blackberry croissant, smoked ham and gruyere morning bun, ginger pull aparts and chocolate croissant. Everything is so fresh, made with high quality ingredients (thank you BUTTER!) and just bursting with flavor. \n\nOH. MY. GAH. \n\nI thought the holiday gluttony was over, I detoxed for like 2 days and here we are back again at square one. \n\nFML.", "rating": 5, "date": "2016-01-09"}, {"excerpts": ["The smoked ham and gruyere morning bun is also great ", "should you need something a little more substantial.  ", "The only downside is that they don't offer any indoor seating, though they do have a moderate amount of outdoor seating.  ", "You should also note that they do have odd hours, Wednesday - Sunday ", "and they're only open until 2pm "], "author": "Tom G.", "review": "A spin-off (former employee) of Tartine, this place is a hidden gem.  Having lived down the street for a year (they were indeed our neighbor), I would see these guys toiling away at 11pm at night.\n\nIn a city where most 'foodies' know about every little spot, Neighbor Bakehouse is one of the few places that my friend's have yet to discover, and it's their loss.  Ironically, many people order Neighbor bakehouse products throughout the city at various coffee shops, without realizing the true source (Sightglass, Fourbarrell, The Mill, and Contraband to name a few).\n\nBoth the chocolate and 'everything' croissants are exceptional and the ginger pull-apart will blow your mind.  The smoked ham and gruyere morning bun is also great should you need something a little more substantial.  The only downside is that they don't offer any indoor seating, though they do have a moderate amount of outdoor seating.  You should also note that they do have odd hours, Wednesday - Sunday and they're only open until 2pm (closed Monday and Tuesday).\n\nIf you've never stopped by, do yourself a favor, skip the line at Tartine and get over to the the Dogpatch.", "rating": 5, "date": "2016-07-21"}, {"excerpts": ["the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar"], "author": "Rob C.", "review": "place is like Mr Holmes.  but I think the pastries would taste even better heated. ginger pull apart, nice sugar and subtle ginger, caramelized brown sugar on the bottom.  the savory pastries great\nsauerkraut smoked cheddar peppadew tart, light, mild sauerkraut\nsmoked ham and gruyere morning bun, swirled within, covered with sunflower and poppy seeds\nmushroom green onion manchego tart\nbutter croissant -- light and flaky with a well ­developed honeycomb crumb\npistachio blackberry twice baked croissant -- nod to almond croissant, more powdered sugar", "rating": 5, "date": "2016-02-21"}], "everything croissant": [{"excerpts": ["Everything I've had has been great but my favorites as of right now are the Everything Croissant and the Guava and Cheese Pastelito! ", "If you are a fan of bagels and cream cheese in the morning, the Everything Croissant has cream cheese on the inside. ", "Yum! "], "author": "Michael L.", "review": "I've been to Neighbor Bakehouse multiple times and they have yet to disappoint!\n\nI usually go early in the morning and see what they have available. Everything I've had has been great but my favorites as of right now are the Everything Croissant and the Guava and Cheese Pastelito! If you are a fan of bagels and cream cheese in the morning, the Everything Croissant has cream cheese on the inside. Yum! The Guava and Cheese Pastelito also remind me of Porto's. \n\nI like to come here when I get the chance. Definitely one of the best bakeries in SF!", "rating": 5, "date": "2018-09-25"}, {"excerpts": ["Everything Croissant - seeds and nuts on the outside, soft cream cheese on the inside, I can imagine being in France.\n\n"], "author": "Connie W.", "review": "Street parking was easy for 9:30 on Sun morning.\nLined up outside and ate outside at communal picnic tables.  The vibe is relaxed and laid back. \nThe weather in Jun was typical morning overcast, not too cold, not too hot.  It was perfect weather to eat outside.  But I can imagine the short raining season when it might not work for alfresco dining.\nSeems like all the pastries  we ate was a croissant derivative, real buttery and flaky, 5 starts for each item.\n\nEverything Croissant - seeds and nuts on the outside, soft cream cheese on the inside, I can imagine being in France.\n\nHam and Cheese morning bun - savory with sweet \n\nRaspberry hazelnut twice-bake -  smallest and sweetest of the bunch, very moist with the fresh fruit\n\nGinger pullapart - my son's favorite, largest pastry we got, very little hint of ginger taste, reminds me of monkey bread but better\n\nCinnamon Almond Bostock - This is almond fantasy, cake like toast with almond taste, my personal favorite", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["Plenty of high-quality pastries (my Everything Croissant has really raised the bar for Everything Bagels), and it just seems that there's no going wrong with any of their choices.\n\n", "And returning to my Everything Croissant - it was just so flaky and delicious. ", "I know some people really enjoy their Costco croissants, and I do heart Costco too - but these croissants just taste much more fresh and don't have that \"weird butter aftertaste\". "], "author": "Greg G.", "review": "Neighbor Bakehouse really is a neighborhood gem! Plenty of high-quality pastries (my Everything Croissant has really raised the bar for Everything Bagels), and it just seems that there's no going wrong with any of their choices.\n\nMy friend went with the Kim-Chi Bake. We were both a little surprised that there's cheese on it, but I enjoyed it anyhow haha. And returning to my Everything Croissant - it was just so flaky and delicious. I know some people really enjoy their Costco croissants, and I do heart Costco too - but these croissants just taste much more fresh and don't have that \"weird butter aftertaste\". Gosh, I really should have gotten 2...\n\nAs for the venue itself, Neighbor Bakehouse is situated in a small shop on a busy street (with a climbing gym nearby). Parking isn't that easy, but if you drive to the back of the complex, there should be better luck there. The shop itself has outdoor seating only, so be prepared to eat on the go or to dress for the weather. Lines seemed to average between 5-15min, depending if you catch a lucky break.\n\nOverall, I'll definitely be bringing more friends here, especially post-climbs :) Really solid bakery!", "rating": 5, "date": "2018-05-28"}, {"excerpts": ["I ordered an assortment of pastries, including croissants, ginger pull-parts, and the everything croissant, and the size of the pastries was definitely worth the price. \n\n"], "author": "Sandra S.", "review": "I came early in the morning on a Sunday, and I really loved the quaint neighborhood where the bakery is located. Parking was very easy, and free on Sundays, which was a plus. The store is very small, but there's a line that's not too long for their pastries. \n\nAt around 9am, the line wasn't too bad, and I was able to get in and out in about 10 minutes. I ordered an assortment of pastries, including croissants, ginger pull-parts, and the everything croissant, and the size of the pastries was definitely worth the price. \n\nMy favorite of the pastries was definitely the ginger-pull apart! It reminded me of a kougin Aman, but it was a lot bigger (which is never a complaint). The ginger flavor didn't shine through too much, but I loved the caramel texture and crispy parts of the pastry. Also, it's a fun pastry to eat, since it somewhat resembles baked monkey bread with croissant dough. \n\nThese pastries also last a few days without getting soggy! I had them for about three days, and a few minutes in the oven brought them back to life. \n\nI would highly recommend this bakery if you're in the area. It is more of a small, quaint bakery, but their pastries and flavor combinations are worth the try.", "rating": 5, "date": "2018-01-20"}, {"excerpts": ["I got one of each - the everything croissant and the pistachio raspberry croissant twice baked. \n\n", "As a person that prefers savory foods, I LOVED the everything croissant. ", "Before I tried it, I was quite confused as to what an everything croissant entailed; I mean, I knew what an everything bagel was, but still very confused. ", "And yes, it had everything (duh), including the cream cheese inside. ", "raspberry croissant only because I just had a whole everything croissant "], "author": "Nicole D.", "review": "My friend took me here this morning. Carbs? Hell yeah, I'm in! There was a bit of a line out the door, but it was moving quick. The storefront was tiny - what do you expect out of San Francisco. \n\nMost of the pastries were on a rack. An employee grabs your pastries and bags 'em for you as well. They have a mixture of savory and sweet pastries. I got one of each - the everything croissant and the pistachio raspberry croissant twice baked. \n\nAs a person that prefers savory foods, I LOVED the everything croissant. Before I tried it, I was quite confused as to what an everything croissant entailed; I mean, I knew what an everything bagel was, but still very confused. And yes, it had everything (duh), including the cream cheese inside. I was in love with this one. \n\nI didn't finish the pistachio raspberry croissant only because I just had a whole everything croissant and I'm lowkey watching my weight, ha!\n\nI came back at 12 noon and bought two more to bring home for the fam (I would have bought more, but San Francisco inflated prices do apply here, lol). I brought home another sweet twice-baked croissant and a dessert bar. As much as I forgot the names, I'm sure the taste will not be forgetful!\n\nMy friend got two as well - sauerkraut + cheddar croissant and the other sweet, twice-baked croissant. She didn't care much for the sauerkraut one - so, not recommended if you don't like sauerkraut.\n\nQuick Notes:\n- Everything ranges from $3-$8\n- Street only parking, but it shouldn't be too hard to find parking\n- Cash and credit card taken\n- Seating is limited", "rating": 5, "date": "2017-09-23"}, {"excerpts": ["Medium\n\nEverything Croissant - Flaky, buttery, but chewy on the inside is how a croissant should be. ", "The Everything Croissant is the epitome of those characteristics plus the addition the everything seasoning on top. \n\n"], "author": "Julian L.", "review": "Wait - 5-10 minutes\n\nValue - $5 / dish.\n\nDish Size: Medium\n\nEverything Croissant - Flaky, buttery, but chewy on the inside is how a croissant should be. The Everything Croissant is the epitome of those characteristics plus the addition the everything seasoning on top. \n\nPistachio Blackberry Twice-Baked - After having this, I'm set on believing that all pastries should be twice-baked. The outer layer is a nice crunchy mixture of pistachios and mashed blackberries. The inside, much like the croissant, is flaky, butter, but chewy inside. \n\n\nIf you plan on heading to Neighbor Bakehouse, be on the lookout for the line snaking out onto the sidewalk. The line length is a bit misleading, as there is only a small ordering area for customers. Also, the line does move quickly as the Neighbor Bakehouse staff is efficient with the orders. Majority of the space is dedicated to their baking operations, therefore Neighbor Bakehouse does not offer any interior seating but has a handful of tables on their patio. \n\nNeighbor Bakehouse is one of those types of places where you leave questioning, \"If pastries are supposed to taste like this, what have I been having my whole life?\"", "rating": 5, "date": "2017-09-23"}, {"excerpts": ["Ginger pull-apart\nCinnamon almond bostock\nBuckwheat orange financier\nVege pizza\nCoffee cake\nEverything croissant"], "author": "Sean W.", "review": "Neighbor bakehouse is my personal favorite Western bakery in SF, especially in the Eastern part. IMO it's highly underrated. Neighbor consistently serves high quality \"artisanal\" bread without as much hype as places such as Tartine. I always come through here on the weekend to get my bread fix. They serve loaves, savory pastries and sweet pastries.  Breads are priced pretty high, but inline with other high-tier bakeries (or just SF). The menu changes from time to time and they run out of breads by the end of the shift. \n\nLocated in dogpatch, it's a lowkey bakery with some seating outside. Lines vary between no line to 20m lines.\n\nI've ordered (* is a favorite)\n* Smoked fish cream cheese croissant \n* Raspberry violet twice-baked\n* Pistachio blackberry twice-baked\n* Potato curry with chorizo turnover\nGinger pull-apart\nCinnamon almond bostock\nBuckwheat orange financier\nVege pizza\nCoffee cake\nEverything croissant", "rating": 5, "date": "2017-12-25"}, {"excerpts": ["Everything croissant - exactly what you'd expect, executed perfectly. ", "The flaky croissant topped with the everything seasoning. "], "author": "Lisa N.", "review": "This place is so good. My friend lives in Dogpatch and recommended we grab some pastries for our flight home.....so I did. I went in there and pointed at random items that sounded good. I ended up with:\n\nSmoked salmon cream cheese croissant - something like that, don't remember exactly --- all I remember was that it was flaky exterior, tasty, creamy interior. Could've used a touch more smoked salmon, but meh.\n\nHam and cheese morning bun - ratio of ham and cheese not so great, most of the croissant was hollow...but can't argue with how perfect the croissant was; flaky and buttery, the perfect complement to the salty ham and cheese\n\nEverything croissant - exactly what you'd expect, executed perfectly. The flaky croissant topped with the everything seasoning. Love my savory pastries. \n\nCinnamon almond bostock - I would never order this based on the name (just doesn't sound appealing to me), but thanks to Yelp highlights, I went for it and it was easily my favorite item on the list. Sweet, slightly crispy exterior. \n\nI ate 1 pastry per day for the next week! Popped it in the toaster oven at work...and they were all still good......comparable to when I had it freshly baked. \n\nEveryone was friendly and I didn't feel rushed when I was deciding. A little on the pricey side for a baked good, but well worth the quality and freshness.", "rating": 5, "date": "2017-09-07"}, {"excerpts": ["Graciously enjoyed my salmon croissant, and everything croissant. ", "They were both extremely crispy, fresh, and flaky. ", "Amazing filling inside. ", "Prices were more than fair. ", "Why can't San Diego have croissants this amazing?? ", "Also ordered a latte, which was quite delicious as well. ", "Outside seating area was nice. ", "I wanted to come back here to take some croissants home, but I was too late the day I left :("], "author": "Sam V.", "review": "930AM, line out the door, but moved really quick. \nGraciously enjoyed my salmon croissant, and everything croissant. They were both extremely crispy, fresh, and flaky. Amazing filling inside. Prices were more than fair. Why can't San Diego have croissants this amazing?? Also ordered a latte, which was quite delicious as well. Outside seating area was nice. I wanted to come back here to take some croissants home, but I was too late the day I left :(", "rating": 5, "date": "2017-11-02"}, {"excerpts": ["My favorites were the everything croissant, mushroom pastry, and the ginger pull-apart. "], "author": "Nini N.", "review": "Ugh, how I wish I lived in San Francisco... I'd move there just to eat here every morning.\n\nThis place is a dream come true. Every single pastry I tried here was absolutely delicious -- flaky, buttery, rich, salty, sweet, etc. My favorites were the everything croissant, mushroom pastry, and the ginger pull-apart. However, I would whole-heartedly recommend anything on the menu.\n\nYou shouldn't be too taken aback by the line in front of Neighbor Bakehouse. First of all, the long line means the food is AMAZING. Second of all, the line moves very quickly! At the same time, once you start ordering, the workers don't rush you; they are really patient and willing to help you pick out items. \n\nDefinitely visit this place if you have the chance. Order a box of pastries, and sit outside. Enjoy!", "rating": 5, "date": "2018-03-05"}, {"excerpts": ["would recommend if you're a chocolate lover\neverything croissant (5/5) ", "- this is like the everything bagel, but croissant. "], "author": "Sylvia H.", "review": "i was in search for a new bakery shop so i decided to check this place out since it was recommended by someone. i came here on a saturday around10:45AM. i waited in line for about 20 minutes before i could place my order. i ended up ordering:\n\npistachio blackberry twice-baked (5/5) - would recommend this if you like berries\nviolet raspberry twice-baked (5/5) - also would recommend this if you like berries\nguava and cream cheese pastelito (5/5) - have you ever had those guava & cream cheese strudels at Porto's Bakery? if so, then it's almost the same. would also recommend this\nchocolate claw (4/5) - this is pretty chocolatey, very similar to the chocolate croissants at Starbucks. would recommend if you're a chocolate lover\neverything croissant (5/5) - this is like the everything bagel, but croissant. there's cream cheese inside the croissant\n\ni liked the pastries i ordered, but i'm sad that they ran out of the ham & cheese morning bun and the mushroom tart. i'll have to come back here at an early time!\n\nthere's an open seating area outside the shop for you to enjoy your pastries since it's a small bakery shop.", "rating": 5, "date": "2017-09-02"}, {"excerpts": ["My favorites are everything croissant, passion fruit doughbuns, curried potato turnover and then everything else is pretty awesome as well.  ", "Coffee is pretty insane too. ", "Lines move pretty fast, so don't get deterred! ", "Lots of outside seating. ", "Also, they usually have stuff outside of their menu as well - be prepared to make some last minutes decisions!"], "author": "Namrata J.", "review": "This is probably my 7th time here! Keep coming back for the amazing pastries. My favorites are everything croissant, passion fruit doughbuns, curried potato turnover and then everything else is pretty awesome as well.  Coffee is pretty insane too. Lines move pretty fast, so don't get deterred! Lots of outside seating. Also, they usually have stuff outside of their menu as well - be prepared to make some last minutes decisions!", "rating": 5, "date": "2018-02-04"}, {"excerpts": ["I wanted to get the everything croissant, ham and cheese, passion fruit, guava, pizza pastries, etc. ", "Oh my!! ", "I was drooling for all of them. ", "Staff were friendly. ", "Definitely coming back."], "author": "Amy H.", "review": "Wow! I'm in love with this bakery. First time here. We were an hour early for our lunch reservation at Aina. We wanted to walk around and check out the area. It was a beautiful, sunny, warm day. I'm so glad the hostess at Aina recommended Neighbor Bakehouse. \n\nRight when we walked in, the sweetness of bread and sugar aroma filled up the entire bakery. Small bakery. There was a line but it wasn't that bad. Everything looks so delicious and good. Due to the prices, I got two pastries only: raspberry croissant and ginger pull apart. Total was about $8. \n\nWe sat on the bench outside and saw what other people had. Whatever they ordered, looks good too. I took my first bite out of the raspberry and ginger pull apart, and my taste buds were dancing! It was delicious. Flaky, buttery, sweet and fresh. Reminds me of a Paris. My husband ate all of the raspberry croissant and I got jealous. I wanted one for myself so had to get another to go. We spent $12 total for 3 pastries. Pricey. \n\nI wanted to get the everything croissant, ham and cheese, passion fruit, guava, pizza pastries, etc. Oh my!! I was drooling for all of them. Staff were friendly. Definitely coming back.", "rating": 5, "date": "2017-04-29"}, {"excerpts": ["They have different types from traditional butter, chocolate, and even an everything croissant a play on the everything bagel. ", "So far everything I've tried here has been good and did not disappoint. \n", "What I love about their croissants is that they are so flaky and buttery and are perfectly baked. ", "Every bite has that initial crispness when you bite in followed by the buttery chewiness inside. \n", "This place is a little out of the way ", "but it's well worth the trip or a stop if you are in the area. ", "Definitely plan on coming back and trying their other delicious looking goodies."], "author": "Peter P.", "review": "One of the best bakeries in San Francisco located in the dogpatch. This place is a simple bakery with just a counter to order your baked goods and coffee. There is some outdoor seating which can get tight if they are busy. It's a neat set up as you can see the entire bakery/kitchen. Ordering is simple as they have their menu items and daily specials on display on racks out of the oven. The pastries are delicious and their bread is also very good. They have coffee/expresso but it's a simple set up as they put their focus on the baked goods. Service is friendly and efficient. It's a small space so there may be a line but they staff does a great job moving people through. \nTo me their highlight is their croissants. They have different types from traditional butter, chocolate, and even an everything croissant a play on the everything bagel. So far everything I've tried here has been good and did not disappoint. \nWhat I love about their croissants is that they are so flaky and buttery and are perfectly baked. Every bite has that initial crispness when you bite in followed by the buttery chewiness inside. \nThis place is a little out of the way but it's well worth the trip or a stop if you are in the area. Definitely plan on coming back and trying their other delicious looking goodies.", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["We had the ginger pull apart, everything croissant, pistachio blackberry twice baked, passion fruit doughp bun, smoked fish croissant and chocolate claw. ", "Yes, I went a little bananas.  ", "Pastries range about $3-4.50 each.  ", "I'm more a savory person so definitely recommend the everything and smoked fish croissant. ", "All the pastries had a nice, flaky texture. ", "Minus one star because I still think it's a little pricey for pastries, but everything tasted pretty amazing. ", "Parking can be a challenge in the area."], "author": "Selina T.", "review": "Wow, so refreshing to wait in a relatively short line (15 mins) for an awesome bakery in the city! We had the ginger pull apart, everything croissant, pistachio blackberry twice baked, passion fruit doughp bun, smoked fish croissant and chocolate claw. Yes, I went a little bananas.  Pastries range about $3-4.50 each.  I'm more a savory person so definitely recommend the everything and smoked fish croissant. All the pastries had a nice, flaky texture. Minus one star because I still think it's a little pricey for pastries, but everything tasted pretty amazing. Parking can be a challenge in the area.", "rating": 4, "date": "2017-06-06"}, {"excerpts": ["Ok HELLO EVERYTHING CROISSANT so nice to meet you", ", let's be friends forever. ", "Cream cheese... inside a croissant?! ", "Not as buttery as Arsicault ", "but I love it just the same. ", "Love the everything croissant so much but dread the drive to the dog patch? ", "They sell them at sightglass coffee in soma. ", "You're welcome."], "author": "Steph D.", "review": "Ok HELLO EVERYTHING CROISSANT so nice to meet you, let's be friends forever. Cream cheese... inside a croissant?! Not as buttery as Arsicault but I love it just the same. Definitely one of the top pastry spots in San Francisco. \n\nCome with low expectations and get one of everything. Lots of savory and sweet options, my other favs were the morning bun and chocolate croissant. \n\nOnly cons are for seating. There are a few picnic tables outside but this is a more of a grab it and go spot. Average price of $3-$4 so pretty SF standard. Coffee is pretty good as well. \n\nLove the everything croissant so much but dread the drive to the dog patch? They sell them at sightglass coffee in soma. You're welcome.", "rating": 5, "date": "2017-04-10"}, {"excerpts": ["Everything croissant - I was intrigued...because everything bagels and the everything but the bagel seasoning from trader joes are two of my favorite things. ", "So I went all in and was mildly disappointed...there was cream cheese in the croissant...like a bagel. ", "I dunno...", "I guess I wasn't expecting it and didn't really care for it. \n", "Plain Croissant - they ran out when we first got in, but right before we left, a fresh batch just came out! ", "It was good, but a little too much butter and not enough flaky. ", "It was delicious...", "but I think it was partially because it was still hot ", "(there is nothing better than hot, fresh bread...even if its gross bread but fresh from the oven) so I feel like it got an unfair advantage because it was still warm. "], "author": "Kathy L.", "review": "Important to note, this place closes at 2, so plan accordingly. \n\nThis place offers a lot of interesting takes on croissants in addition to their plain croissant. I feel like...I might be unfair to this place as I am pretty traditional when it comes to croissants...I just like them plain most of the time...and you can sway me with the occasional almond or ham and cheese...but overall I prefer traditional plain croissants. Now that we got that out of the way...I wasn't a huge fan of the takes because I think they were out of my croissant comfort zone. \n\nPistachio blackberry twice-baked croissant - It was a little too sweet and by double baking it...lots of the flakiness that I love about a croissant goes away. \nEverything croissant - I was intrigued...because everything bagels and the everything but the bagel seasoning from trader joes are two of my favorite things. So I went all in and was mildly disappointed...there was cream cheese in the croissant...like a bagel. I dunno...I guess I wasn't expecting it and didn't really care for it. \nPlain Croissant - they ran out when we first got in, but right before we left, a fresh batch just came out! It was good, but a little too much butter and not enough flaky. It was delicious...but I think it was partially because it was still hot (there is nothing better than hot, fresh bread...even if its gross bread but fresh from the oven) so I feel like it got an unfair advantage because it was still warm. As I was biting into it, I felt that I was eating a warm, fresh from the oven, costco croissant, and I mean no disrespect - costco croissants when fresh are good. \n\nI probably would not make the drive out again, but I'm glad I tried.", "rating": 3, "date": "2017-12-22"}, {"excerpts": ["I thought the everything croissant and "], "author": "Tim X.", "review": "As far as bakeries go in San Francisco, this is one of the most innovative and reliable. Any bakery that opens at 6:30am is one well-oiled operation, as the employees must start working sometime around 5am.\n\nThe selection of pastries and breads is incredibly diverse. My favorites were the ginger pull-apart bread and blackberry pistachio croissant. I thought the everything croissant and ham and cheese croissant were just okay, so I'd recommend the sweet over the savory.\n\nAlso a coffee bar with plenty of different drinks, although I'm not a big coffee person. Came here on a weekday morning and waited about 15 minutes in line, must be much longer on the weekends.", "rating": 5, "date": "2017-05-10"}, {"excerpts": ["I got a box of 6 pastries and in my box I had:\n\nEVERYTHING CROISSANT ", "This is my sister's all time favorite (still like the everything croissant better). ", "I didn't know pistachio can be incorporated like this in a croissant! ", "The pistachio was creamy and it mixed so well with the flaky soft texture of the croissant. "], "author": "Grace Z.", "review": "Wow this place is so far my favorite bakery in San Francisco!! Can they teach me how to bake like that???\nI still have yet to try Mr. Holmes (not down for the early wait in line), but so far this place is hard to beat!\nI first had their Everything Crossiant at another cafe and it blew me away. I had to come to the OG location, so I drove to this place at 10am on a Saturday. There was a line out the door, but it went by quickly with 10 people ahead of me. I hate waiting in line in the cold, but the croissants were calling me and I couldn't say no.\nI got a box of 6 pastries and in my box I had:\n\nEVERYTHING CROISSANT (5/5)\nHands.down.best.sh*t.ever.just.get.it.dont.question.me.\nThis croissant was flak y and crunchy (from the poppy seeds), yet soft and fluffy on the inside. Love love love the cream cheese filling inside. Sounds so simple yet it blew my mind everytime I take a bite. My sister was sneaking bites and practically devoured 1/3 of it when I wasn't looking. It's that seriously that good.\n\nSAUERKRAUT TART (4.5/5)\nThis was recommended by one of the worker and it's one of of my top favorite now too. It's crunchy and buttery. I love pastries with multi flavors and this hits the spot with sourness from the filling and the savorness from the baked cheese. Reminds me of those savory bread from a Chinese bakery, but with an updated bread base.\n\nPISTACHIO BLACKBERRY TWICE BAKED (4.5/5)\nThis is my sister's all time favorite (still like the everything croissant better). I didn't know pistachio can be incorporated like this in a croissant! The pistachio was creamy and it mixed so well with the flaky soft texture of the croissant. Sadly my sister devoured it before I get a piece of it with the blackberry.\n\nHAM AND CHEESE MORNING BUN (3/5)\nHonestly I got this one because it was pretty. Maybe because I ate it hours after I got it so it wasn't super fresh, but it was medicore. Don't get me wrong it was good, but compared to the other amazing pastries they had it just didn't stand out.\n\nPASSION FRUIT DOUGHP BUN (4/5)\nYum yum yum. The passion fruit filling was refreshing after eating all of the savory carbs. It wasn't too overwhelming like I expected and compliments the breading around the cream.\n\nGERMAN COFFEE CAKE (4/5)\nAnother refreshing treat after eating the savory pastries. Don't remember exactly the taste of it, but it wasn't disappointing either.\n\nOverall everything was bomb.com and everyone needs to come here. The end.", "rating": 5, "date": "2016-09-15"}, {"excerpts": ["Indeed, Neighbor's homemade style features unique creations such as the ginger pull-apart and everything croissant. "], "author": "Edna C.", "review": "Perhaps Totoro would be sad that Neighbor now has a closer connotation with a bakery than the OG, My Neighbor Totoro. Anyways, I digress.\n\nWhile the juggernauts Tartine and B. patesserie remain packed, there is increasing popularity for pop-up-type bakeries. Indeed, Neighbor's homemade style features unique creations such as the ginger pull-apart and everything croissant. The baking skillz are superb, with pastry layers crisped to flakey perfection and a crunchy, caramelized exterior very similar to Arsicault. \n\nI got some type of croissant and something custardy--the exact name/descriptions are beside the point, as the pastries were phenomenal without the need for cognitive bias surrounding the excitement of eating a \"pistachio blackberry twice-baked croissant\". Although it's a tad bit too sweet, overall the flavors and textures are on point. Bonus points for the cute packaging with twine around the paper box.\n\nThe itself place is very small business-like, cozy and not particularly gentrified (though one could beg to differ for any foodie-oriented bakery that turns basic baked goodies into bouge luxuries, with very-above-average price tags).", "rating": 4, "date": "2016-05-11"}, {"excerpts": ["Everything croissant is ridiculous. \n\n"], "author": "Alexandria W.", "review": "The best bakery in San Francisco, hands down. You will have a religious experience with their twice baked croissants. Much more supple and not dry at all like many other double baked croissants here in sf. \n\nEverything croissant is ridiculous. \n\nChocolate pudding bun is insane. \n\nNeighbor Bakehouse, I love you.", "rating": 5, "date": "2017-12-03"}, {"excerpts": ["Everything croissant 4/5 - good, but too much going on\n\nPistachio & Blackberry croissant - 5/5 my personal favorite, nothing overwhelming and a great combo\n\nHam & Cheese "], "author": "Lucy Z.", "review": "I'd like to jump on the train and agree with all the five-star reviews for Neighbor. I have literally nothing to add, except that it was freakin' delicious, totally worth the cost, and the lines go faster than any other overhyped bakery - which I attribute to the fact that the inside isn't completely photogenic, so you're literally craning your neck to see the pastry carts, placing your order, and paying. Nothing worthy of your Instagram. Yay for quick lines.\n\nWe ordered four pastries (after I already ate half of an avocado toast earlier at Provender...) around 11 AM on Saturday. A good 10-15 people in line with all the tables pretty full. You could tell that this place attracts both locals and tourists.\n\nPlain croissant 5/5 - the best that the boyfriend has ever had and he would eat croissants every day if he could...and he used to do just that...\n\nEverything croissant 4/5 - good, but too much going on\n\nPistachio & Blackberry croissant - 5/5 my personal favorite, nothing overwhelming and a great combo\n\nHam & Cheese bun 3.5/5 - nothing too impressive, needs more cheese!\n\nTotal for four was $14! Super satisfying. We're obviously croissant lovers and Neighbor Bakehouse lovers...", "rating": 5, "date": "2016-07-14"}, {"excerpts": ["so I ordered an Everything Croissant, the ham and cheese morning bun, the guava and cream cheese pastelito and small country loaf.  \n\n", "The Everything Croissant was good but was my least favorite of the items ", "purchased that day.  ", "I'm just not a fan of cream cheese in my croissant.  ", "Perhaps this was due to me not expecting it to be there.  ", "The guava and cream cheese pastelito was good ", "but I wish there had been a bit more of the guava.  ", "The pastry itself was really good "], "author": "Melissa L.", "review": "4.5 stars\n\nIs it worth the hype?  I would have to say that yes, it is.  I had been able to visit Arsicault the week prior to allow for a comparison as well.  It's a tough life in SF!  \n\nI ordered a sample of items to share and try.  They were out of plain croissants (WHAT!) so I ordered an Everything Croissant, the ham and cheese morning bun, the guava and cream cheese pastelito and small country loaf.  \n\nThe Everything Croissant was good but was my least favorite of the items purchased that day.  I'm just not a fan of cream cheese in my croissant.  Perhaps this was due to me not expecting it to be there.  The croissant itself was light and airy on the outside with a bit of chew on the inside.  \n\nThe savory morning bun was delicious.  For me it beats the the Rebel Within at Craftsman & Wolves.  Perhaps that is not a good comparison as they are not exactly alike (pastry vs. muffin) but in terms of a savory breakfast treat, this morning bun is it.  I even prefer this over the ham and cheese croissant at Arsicault.\n\nThe guava and cream cheese pastelito was good but I wish there had been a bit more of the guava.  The pastry itself was really good but we were looking for a higher ratio of filling to dough.\n\nThe country loaf was really good.  The crust was not to thick and had a bit of chew.  The interior was dense, moist, tender and hole-y.  I didn't find the loaf that sour at all.  We tried the bread with butter, cheese, pate and even avocado.  It was a great base when paired with other items or fine on its own. \n\nMy visit was on a Friday at 9:30 am.  On this day, parking looked to be a difficult as others have mentioned.  For the normally quiet period during the holiday week, I was hoping this area would be fairly deserted.  No chance.  I was luckily enough to find a spot at the end of the block, around the corner, without much difficulty.  On a weekday I would recommend coming with someone that can drop you off or look for parking while you hop out to pick up the pastries.  The lined moved fairly quickly and I don't think I waited more than 5 minutes, which allowed me ample time to peruse the menu and look to see what was available on the racks.  There is no place to sit inside as the space is allocated to the baking operations.  There are a few tables outside.\n\nI hear parking is much easier on the weekends but the lines are much longer.  Hopefully it won't take me another year to make a return trip!", "rating": 4, "date": "2017-01-07"}, {"excerpts": ["I phantom smell the everything croissant. "], "author": "Kathryn C.", "review": "I phantom smell the everything croissant. The poppyseed, garlic, cream cheese combo sounded unintuitive to me, but was like I'd died and gone to heaven when it made it into my mouth!\n\nI also loved the bostock, which is a vanilla-y, eggy croissant. Lighter than French toast and denser than croissant. Super yum!\n\nCame on a rainy weekend = abundant parking and no lines. Yay!!!", "rating": 5, "date": "2017-01-08"}, {"excerpts": ["The Everything Croissant was amazing! ", "The everything topping on top was flavorful and the stuffed cream cheese inside the croissant was like a party in your mouth! ", "The layers of croissant were light and fluffy, the outside had a slight crisp. "], "author": "Vickie C.", "review": "I wish I lived right next to this place! I would go everyday to eat all their amazing pastries!! My friend suggested this place on my recent trip to SF. You know it has got to be great when there's a long line out the door and you see everyone walking away with boxes of the stuff! \n\nThe croissants are a must order! Try all of them! The Everything Croissant was amazing! The everything topping on top was flavorful and the stuffed cream cheese inside the croissant was like a party in your mouth! The layers of croissant were light and fluffy, the outside had a slight crisp. We ate that one right then and there, and wished we had ordered another one. \n\nI ended up taking a huge box of pastries home to share with my family in LA. Even though it was the next day, everything still tasted great! The Ham and Cheese morning bun was delicious with ooey cheese after warming it up in the toaster oven. The twice baked croissant with pistachios and blackberries was delicious as well! The doughpy bun is a donut with filling. I got the passionfruit one which I found a bit on the tart side, but the bun itself was really tasty! I also bought the ginger pastry, guava roll, and some other items that I didn't actually get to taste for myself. \n\nDefinitely a must go the next time in SF. I feel a bit bad for cheating on Tartine, but this place is really really good! My only complaint is that they don't have a large paper bag if you order the big box. I ended up having to carry the box with both hands all the way to the airport and onto the plane!", "rating": 5, "date": "2017-02-16"}, {"excerpts": ["Kind of regret not trying the everything croissant ", "but we went for a savory tart (good) and a twice-baked croissant (amazing!). ", "It was a weekday morning, no lined but really hard time finding parking."], "author": "Katerina T.", "review": "Met my sister here for brunch on a visit to SF and tried a couple of pastries which ranged from good to amazing. Kind of regret not trying the everything croissant but we went for a savory tart (good) and a twice-baked croissant (amazing!). It was a weekday morning, no lined but really hard time finding parking.", "rating": 4, "date": "2018-02-17"}, {"excerpts": ["Everything Croissant:\nI don't even like croissants, but I loved this thing.  ", "Super flavorful with both the toppings, fillings, and croissant itself.  "], "author": "Bryson L.", "review": "Stumbled across this place while exploring the Dogpatch.  This place is hands down the bakery to visit in San Francisco!  Everything they touch turns to golden flaky pastries or fantastically baked breads.  What's even better too is that this place isn't plagued with ridiculously long lines or immediately selling out of everything they have.  That being said, some of their items do sell out quickly but they'll usually have something interesting in stock for you if you're not particular about a specific thing.  I'll have to make more trips back here to pick up more of their amazing delights, but here's what I've had so far.\n\nEverything Croissant:\nI don't even like croissants, but I loved this thing.  Super flavorful with both the toppings, fillings, and croissant itself.  Really nice savory pastry.\n\nGuava and Cream Cheese Pastelito:\nReally good, I loved the guava filling, it really reminded me a lot of Portos.  The pastry itself is flaky and perfect in every way.  \n\nPassionfruit Dough Bun:\nAmazing donut that's been perfectly baked and goes really well with their passionfruit filling.  It tastes a lot like Hawaiian Passionfruit (lilikoi) butter so it's definitely richer than your standard jelly.  \n\nPistachio Blackberry Twice Baked:\nOnce again, don't like croissants, but this one haunts me with it's amazing flavor.  It's astounding that the croissant stays so flaky despite the jam on the inside.  The pistachios go really well with the blackberry too.  No blackberry seeds either which is a nice plus!", "rating": 5, "date": "2016-10-27"}, {"excerpts": ["I did enjoy the Ginger Pull-over and Everything Croissant. ", "The only sad thing is the seating - yes ", "it's outdoor ", "but it's not under the sunlight and the seatings are limited. ", "Basically there is one communal table (could sit 8 people?) where you share space with strangers (and being forced to listen to their conversation). ", "Better grab your pastry and coffee to go somewhere else. ", "If you fancy a relaxing sit-down environment to enjoy your breakfast, head to Vive La Tarte on Howard/7th St!"], "author": "Shaz L.", "review": "Many pastry options - I did enjoy the Ginger Pull-over and Everything Croissant. The only sad thing is the seating - yes it's outdoor but it's not under the sunlight and the seatings are limited. Basically there is one communal table (could sit 8 people?) where you share space with strangers (and being forced to listen to their conversation). Better grab your pastry and coffee to go somewhere else. If you fancy a relaxing sit-down environment to enjoy your breakfast, head to Vive La Tarte on Howard/7th St!", "rating": 4, "date": "2016-09-27"}, {"excerpts": ["I heard a lot of compliments about this place, I decide to come back and try 6 different things\n- 2 ham& cheese morning bun\n- everything croissant \n- cinnamon almond bostock\n- passion fruit bun\n- butter croissant\n- kimchee toast\n", "Everything is super good!! ", "No wonder!"], "author": "Thancha N.", "review": "I have been to this place last year. I tried the ginger pull apart( I normally hate ginger and alway skip them) , they was ok.\n\nI heard a lot of compliments about this place, I decide to come back and try 6 different things\n- 2 ham& cheese morning bun\n- everything croissant \n- cinnamon almond bostock\n- passion fruit bun\n- butter croissant\n- kimchee toast\nEverything is super good!! No wonder!", "rating": 5, "date": "2016-11-09"}, {"excerpts": ["Standouts include the everything croissant and the twice baked (berry+nut) croissants.\n\n"], "author": "Chris M.", "review": "Best croissant dough I've ever tasted. Standouts include the everything croissant and the twice baked (berry+nut) croissants.\n\nBut basically anything based on their croissant dough is amazing.", "rating": 5, "date": "2018-01-07"}, {"excerpts": ["Took home a savory tart with ham and cheese, everything croissant, chocolate croissant, and some sort of brown butter muffin. "], "author": "Abby S.", "review": "Yes. Yes. Yes.\n\nThough I live less than a mile away, a trip to Neighbor Bakehouse is best reserved for weekends. Which means getting up early on a Sunday and walking over in the cold and fog.\n\nBut the baked goods are more than worth the effort.\n\nNot much fancy San Francisco \"stuff\" on the inside. It's an industrial bakery with a storefront. In addition to baked goods, they also sell coffee. Clean, efficient, not really meant for brunching in the traditional sense. But if you must bite into your treat before hopping back in the car/on the T-line, there are some small tables/chairs outside.\n\nThe menu changes somewhat regularly and there are several options to choose from. When in doubt, order two treats per person and you can go halfsies. Took home a savory tart with ham and cheese, everything croissant, chocolate croissant, and some sort of brown butter muffin. All of which were thoroughly enjoyed.\n\nI want one right now.", "rating": 5, "date": "2015-06-01"}, {"excerpts": ["My everything croissant was tasty, but nothing I'm desperately craving in the future. ", "Blackberry and pistachio make for an interesting combo in a croissant, but not my fav. ", "I'm afraid that maybe my expectations were set too high before going! ", "Neighbor Bakehouse is still a good option if you're in the area!"], "author": "Laura B.", "review": "I was very excited to try this place after I got two rave reviews from friends I trust. Their baked goods are delightful, but I'm not ready to replace Tartine as my go-to fancy baked goods spot. My everything croissant was tasty, but nothing I'm desperately craving in the future. Blackberry and pistachio make for an interesting combo in a croissant, but not my fav. I'm afraid that maybe my expectations were set too high before going! Neighbor Bakehouse is still a good option if you're in the area!", "rating": 4, "date": "2017-11-08"}, {"excerpts": ["In the past two days, I have tried the pistachio-blackberry croissant, ham & cheese bun, ginger pull apart, and the everything croissant. "], "author": "Junaedy L.", "review": "Phenomenal. In the past two days, I have tried the pistachio-blackberry croissant, ham & cheese bun, ginger pull apart, and the everything croissant. The pastries are flaky and soft on the inside, and very fresh!\n\nThe sandwiches are on the pricier side at $10 each. I guess that should not be a surprise given we are in San Francisco!", "rating": 5, "date": "2017-05-26"}, {"excerpts": ["My favorite: the everything croissant for the savory pastry and the pistachio twice bake for the sweet pastry. ", "Don't get me wrong all their pastries are good the two mentioned are just my personal favorites. ", "In case you are wondering, this place is better than Bounchon Bakery in Napa. ", "Line can be long on the weekend ", "but it usually move fast."], "author": "Y K.", "review": "My favorite bake store. I have been going to this place since it was opened. My favorite: the everything croissant for the savory pastry and the pistachio twice bake for the sweet pastry. Don't get me wrong all their pastries are good the two mentioned are just my personal favorites. In case you are wondering, this place is better than Bounchon Bakery in Napa. Line can be long on the weekend but it usually move fast.", "rating": 5, "date": "2017-10-28"}, {"excerpts": ["Didn't like the Everything Croissant - the onion was over-powering.\n", "Short wait on a weekday, 10:30am.  ", "Parking was difficult.  ", "Few seats, outside only, so best to get order to-go.\n", "Too bad they had run out of the mushroom tart and ginger-pull apart."], "author": "Lynn M.", "review": "Got 6 items and my favorites were the butter croissant and chocolate claw.  Tender, buttery, flaky pastries, yum. \nThe ham and cheese morning bun was good.\nThe middle of the pistachio blackberry croissant, where the pistachios are, was tasty - the edges not as flavorful and a little drier.\nThe veggie tart was OK.  A bit more salt would have improved. \nDidn't like the Everything Croissant - the onion was over-powering.\nShort wait on a weekday, 10:30am.  Parking was difficult.  Few seats, outside only, so best to get order to-go.\nToo bad they had run out of the mushroom tart and ginger-pull apart.", "rating": 3, "date": "2016-11-01"}, {"excerpts": ["The everything croissant and ham and cheese morning bun were flavorful and hard to stop eating too. \n\n"], "author": "David B.", "review": "Greg Mindel is a master of laminated doughs and pastries, and it shows in every single product produced at Neighbor. The savory pastries were delicious - including the OG regular croissant, filled with buttery goodness and flaky, shattering layers. The everything croissant and ham and cheese morning bun were flavorful and hard to stop eating too. \n\nAs for sweet, my favorite was the pistachio blackberry twice baked croissant, but the bostock and pastelito and macaroon were all amazing too. The chocolate pudding inside the little dough ball thing was killer as well. \n\nThanks Greg for a great experience and very full bellies!", "rating": 5, "date": "2016-01-26"}, {"excerpts": ["They gave me the Everything Croissant (savory) which had cream cheese inside and the Pistachio and Almond Pastry (sweet). ", "OMG. ", "I've never had flavors like them. ", "They were amazing. ", "The croissant was light, flaky with a type of oniony cream cheese filling. "], "author": "Viyada S.", "review": "I work in this area so this is such a wonderful addition. Surprised to discover a new pastry shop during my lunchtime walk. I was looking through the window and the employees insisted that I enter. Inquired on when they opened and everyone was very warm and friendly. They offered for me to pick a pastry but I told them that I hadn't brought my wallet but they insisted that I take a couple of things but promise to come back. It was so nice.\n\nThey gave me the Everything Croissant (savory) which had cream cheese inside and the Pistachio and Almond Pastry (sweet). OMG. I've never had flavors like them. They were amazing. The croissant was light, flaky with a type of oniony cream cheese filling. It was refreshing to find a savory croissant for a change because I prefer more savory flavored pastries (such as gougeres).\n\nIt's a blessing and a curse (for my waistline) to have such a delicious pastry shop close to work!", "rating": 5, "date": "2015-02-05"}, {"excerpts": ["other amazeball items include their everything croissant (f-ing genius!), the mushroom MANCHEGO tart, the sauerkraut peppadew tart, and their absolutely flawless nitro cold brew. ", "seriously the coffee is incredible, i am a cream and sugar girl but with this magical drink, its somehow not necessary. ", "so smooth, so creamy, "], "author": "Archana P.", "review": "it's been over a year (maybe two) since i had my first taste of the decadent deliciousness that is neighbor bakehouse and i'm actually quite surprised to realize i never reviewed it in all this time. but having just finished a ginormous slice of their toothsome kimchi toast and somehow also consumed their perfect guava and cream cheese pastelito, i am glad i never reviewed them. because now i can happily report that neighbor bakehouse is one of those remarkable eating establishments that has only become better since i first tried it. \n\nother amazeball items include their everything croissant (f-ing genius!), the mushroom MANCHEGO tart, the sauerkraut peppadew tart, and their absolutely flawless nitro cold brew. seriously the coffee is incredible, i am a cream and sugar girl but with this magical drink, its somehow not necessary. so smooth, so creamy, so wow.\n\ni cannot recommend this place enough. and i don't have to. five stars in SF? come on now!", "rating": 5, "date": "2017-02-12"}, {"excerpts": ["Besides the best baked item mankind has ever invented, the Pistachio/Jam Croissant, I was also fortunate enough to try a warm Everything Croissant with its filling of cream cheese and onion. ", "Upon digesting just half of one, I envisioned myself eating dozens and going out Leaving Las Vegas style. ", "I also bought a Ginger pull apart because - ginger that's why. ", "They also serve Lattes. "], "author": "Darin E.", "review": "Now I can understand what Muslims must feel when they go on the Hajj to Mecca. I've been eating pastries made from here sold at Sight Glass for years, but this was my first time stepping foot within the mothership. Besides the best baked item mankind has ever invented, the Pistachio/Jam Croissant, I was also fortunate enough to try a warm Everything Croissant with its filling of cream cheese and onion. Upon digesting just half of one, I envisioned myself eating dozens and going out Leaving Las Vegas style. I also bought a Ginger pull apart because - ginger that's why. They also serve Lattes. Yah.\n\nI love you NB.", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["The everything croissant was perfect, the ginger pull apart was just the perfect mix of ginger & sweet, & the pistachio thing was just plain delicious. ", "Thank you neighborhood bakery!"], "author": "Mary W.", "review": "This place is amazing in every way! The baked good are to die for. I was visiting a family member @ the hospital down the street and was able to walk up to this place in the AM. They were friendly and had great suggestions for the box of goodies I brought back to the nursing staff.\n    The everything croissant was perfect, the ginger pull apart was just the perfect mix of ginger & sweet, & the pistachio thing was just plain delicious. Thank you neighborhood bakery!", "rating": 5, "date": "2017-03-26"}, {"excerpts": ["I had the \"everything croissant\" to go &  "], "author": "ASIANDIVAH A.", "review": "I discovered this gem this weekend while dog sitting!! \n\nI had the croquet madame, ginger - almond pull apart and cafe americano. It was heaven! \n\nI had the \"everything croissant\" to go &  it's super delish!! \n\nThe staff are friendly to me  &  the dog. \n\nFYI, they are only open Wed-Sunday.", "rating": 4, "date": "2015-11-23"}, {"excerpts": ["Ordered a double baked croissant with raspberries, everything croissant and the croque madame. ", "They know what the hell they're doing out here man. ", "Give it a try ", "and I don't think you'll be disappointed."], "author": "Alex L.", "review": "Originally, I was skeptical/excited about this place because it had 5 stars and didn't want to completely hype myself up for this spot, but after eating 3 of their pastries I can confidently say that this spot is legit af. No lie, I think I could order anything here and be content with what I got because they're that good. Ordered a double baked croissant with raspberries, everything croissant and the croque madame. They know what the hell they're doing out here man. Give it a try and I don't think you'll be disappointed.", "rating": 5, "date": "2018-01-25"}, {"excerpts": ["Everyone goes crazy for the Everything Croissant or the Ginger pastry.  ", "Those are good.  ", "But I love the bostock (so intriguing that this far exceeds it's historical origination as a way to get rid of stale brioche bread).  ", "And before Neighbor opened up, I have long been in love with the pistachio croissant, obtained at places like Sophie's Cafe.  ", "When you bite into the pistachio croissant--warm--it's like those old peppermint patties commercials:  ", "I am transported to Istanbul, to a quiet side street of the Grand Bazaar, with a petite cup of turkish coffee and . . . "], "author": "Philip L.", "review": "Worth a return?  I've already gained a waist size from the moment they opened.\nWorth a 30 minute drive? YES.  Maybe better to walk so you don't gain a waist size.\nWorth a flight?  Let me put it this way.  If you are closer to Ble Sucre in Paris, fly there.  Otherwise, go here.\n\nEach bakery has a niche.  I feel Holmes Bake Shop and Craftsman are experimental and cutting edge.  But with Neighbor, he's been supplying local eateries with his legendary pastries for so long, everything is proven.  His creations not only sound interesting, but they are at the most basic level consistently delicious.  \n\nEveryone goes crazy for the Everything Croissant or the Ginger pastry.  Those are good.  But I love the bostock (so intriguing that this far exceeds it's historical origination as a way to get rid of stale brioche bread).  And before Neighbor opened up, I have long been in love with the pistachio croissant, obtained at places like Sophie's Cafe.  When you bite into the pistachio croissant--warm--it's like those old peppermint patties commercials:  I am transported to Istanbul, to a quiet side street of the Grand Bazaar, with a petite cup of turkish coffee and . . . this perfect, exotic pastry.  \n\nLet me give you some advice.  Don't go with too rigid an idea of what you should get.  This is the type of place you can go omakase.  Most important question for this type of place:  ask what just came out of the oven.  Be willing to wait around outside until something does come out of the oven.  Warm, newborn pastry = food orgasm.  Not the fake kind you see from the tired hosts on the Food Network.  This is the real thing. \n\nPS: They still satisfy greatly when they're not warm too.\n\nAppreciate that it's pretty much a miracle to be able to get Neighbor Bake goods finally fresh from the oven.  Bravo, Neighbor Bakehouse team.  Bravo for not being snobby and elitist like some other bakeries.  Does Michelin give out stars to bakeries?  Because if they do, this place will absolutely get em.", "rating": 5, "date": "2015-06-09"}, {"excerpts": ["Favorites are the Sauerkraut Tart (yes, you heard right), Everything Croissant, Mushroom Tart, Ham and Cheese Bun, and Bostock. ", "Their Bostock is something else. ", "Probably the best one I've had in the Bay Area, or anywhere else.  ", "Sometimes, you may find something not on the menu, such as the scrumptious, savory bread pudding "], "author": "CE Y.", "review": "The Neighbor Bakehouse offers some excellent and delicious pastries. Mainly open in the mornings, you'll find croissants and tarts for breakfast. Plus other goodies to satisfy for later in the day.  The flavor combinations are unique and frankly, addictive. Yes, a person can be addicted to baked goods. I will find myself calculating when my next trip there will be. The sweeter baked items are just as delicious. Favorites are the Sauerkraut Tart (yes, you heard right), Everything Croissant, Mushroom Tart, Ham and Cheese Bun, and Bostock. Their Bostock is something else. Probably the best one I've had in the Bay Area, or anywhere else.  Sometimes, you may find something not on the menu, such as the scrumptious, savory bread pudding I had one Wednesday. \n\nI remember first trying one of their sauerkraut concoctions maybe 5 years ago, during an event in Dogpatch. There was no storefront, just a table setup. I think it was Greg Mindel, the founder, who was there listing off what each item was for us.  When it comes to baked goods, sauerkraut doesn't top my list of favored ingredients. But after tasting it, it just worked. Fast forward to this year, I recalled that experience and remembered the name Neighbor. Thanks to a quick internet search, I happily discovered they opened a retail shop. Which, is also their wholesale bakery, I believe. \n\nThey aren't open everyday, usually only from\nWednesday through Sunday.  The hours are early morning through noonish.  Sometimes they may close unexpectedly, so check their website or FB page, before heading there if possible. Don't become as distraught as I was when I arrived to find them closed one day, when I forgot to check their hours. There are some picnic tables set up outside, but no seating inside. \n\nThis bakery is definitely out of my neighborhood, but when I get a chance to detour here, I pick up some of their various offerings. Just enough to share and last a few days. Heated up the next day, they beat most of the pastries I find around the city.  Looking forward to seeing what will be in store next...", "rating": 5, "date": "2015-06-05"}, {"excerpts": ["The everything croissant makes me want to start practicing my \"It's not you Bagels ", "it's me\" speech."], "author": "Yoni Z.", "review": "Believe the damn hype. These are some of the best flavor combinations I have tried in recent memory. Modern takes on all your favorite classics. The twice baked Black Berry Pistachio croissant is an absolute game changer. The everything croissant makes me want to start practicing my \"It's not you Bagels it's me\" speech.", "rating": 5, "date": "2017-12-05"}, {"excerpts": ["The Everything Croissant is to die for!"], "author": "Andrew V.", "review": "Gosh, I love this place. My wife and I moved to the north side of Potrero Hill several years ago and we've been waiting for a \"destination\" bakery to finally land nearby. Neighbor Bakehouse is our wish granted, though NB is even better than the other, big name bakeries in San Francisco in that it's still a bit of an up-and-comer and it's location in the sleepy Dogpatch makes it a bit less of a madhouse on Saturday mornings. :-)\n\nMy wife's baby shower was this past weekend and I wanted to surprise the party with a bunch of delicious baked goods. I procrastinated on placing the order but NB was able to come through for me anyway, and on extremely short notice! Everything was delicious, as expected. The Everything Croissant is to die for!", "rating": 5, "date": "2016-09-18"}, {"excerpts": ["My colleague shared this place and brought me an everything croissant.  ", "I am absolutely in love with this tasty savory treat.  ", "A true GEM!"], "author": "Kim Y.", "review": "My colleague shared this place and brought me an everything croissant.  I am absolutely in love with this tasty savory treat.  A true GEM!", "rating": 5, "date": "2017-04-13"}, {"excerpts": ["Was also very impressed with the Everything Croissant, which is coated with perfectly-toasted seeds and filled with some kind of cream cheese. ", "I wish they had late-day pastries ", "so I didn't have to wake up at 7 to get the good stuff!"], "author": "Alexei B.", "review": "Everything here is amazing. Lots of oddball croissant-inspired pastries -- some savory, some sweet, all delicious. The Ginger Pull-Apart lives up to the hype and tastes like a perfectly-baked kouign-amann (like, Dominique Ansel perfect) with perky ginger notes. Was also very impressed with the Everything Croissant, which is coated with perfectly-toasted seeds and filled with some kind of cream cheese. I wish they had late-day pastries so I didn't have to wake up at 7 to get the good stuff!", "rating": 5, "date": "2017-04-29"}, {"excerpts": ["We got several items including the smoked fish croissant, everything croissant, passionfruit macaroon, passionfruit doughnut thing, and the raspberry hazelnut pastry too! ", "Everything was lovely and we would definitely go again. ", ":)"], "author": "Joweina H.", "review": "Went this past weekend for the first time because my mom and I were in the area. We love Tartine and wanted to try out another bakery in SF, so we tried this out. We got several items including the smoked fish croissant, everything croissant, passionfruit macaroon, passionfruit doughnut thing, and the raspberry hazelnut pastry too! Everything was lovely and we would definitely go again. :)", "rating": 5, "date": "2017-06-06"}, {"excerpts": ["Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant ", "filled w/ cream cheese & green onion topped w/ ", "everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... "], "author": "Kitty K.", "review": "Tiny little bakery with 3 parking spots in front, and a few small tables outside (no indoor seating). Parking tends to be difficult to find in this area though.\n\n*~Menu on 1/2/2015~*\n--Sweet--\n+Butter Croissant: $3\n+Valrhona Chocolate Chocolate Claw: ($3.75) croissant made with Valrhona chocolate\n+Pistachio Blackberry Twice Baked Croissant: ($4) twice-baked croissant soaked in vanilla syrup, filled w/ blackberry jam & pistachio cream, topped w/ pistachio and powdered sugar\n+Ginger Pull-apart: ($3.75) flaky croissant caramelized w/ fresh ginger, cane sugar, dark brown sugar\n+German Coffee Cake w/ Seasonal Fruit: ($4) seasonal fruit, vanilla custard, and streusel atop a sweet brioche (currently: apple & cherry)\n+Cinnamon Bostock with Almond Frangipani: ($4) Slice of cinnamon croissant dough loaf, soaked in vanilla syrup, baked again w/ almond frangipane\n+Walnut Chocolate Crumb Cake: ($3.50) house-made creme fraiche, studded with toasted walnuts, Valrhona chocolate, and swirled with a crumb mixture of cocoa nib, cane sugar, toasted walnuts, and maldon salt, topped w/ a cocoa nib streusel\n+Brown Butter Hazelnut Frinancier w/ Candied Orange Peel: ($3.50)\n+Guava Cheese Pastelito: ($2) guava and cream cheese in puff pastry\n+Chocolate Pecan Coconut Oat Cookie: ($2.75)\n+Raspberry Lime Coconut Macron: ($2) No Gluten. Coconut macaroon made w/ raspberry & lime\n\n--Savory--\n+Smoked Salmon Croissant: ($4)\n+Mushroom Green Onion Manchego Tart: ($3.50) Mushrroms, béchamel, manchego cheese, and green onion baked atop a croissant\n+Seasonal Veggie Tart: ($4) seasonal produce, goat & manchega cheese, béchamel sauce, seeds (currently: delicata squash & kale)\n+Sauerkraut Smoked Cheddar Peppadew Tart: ($3.50) flaky croissant dough latticed over house-made sauerkraut, smoked cheddar, and sweet & spicy peppadew peppers\n+Ham and Cheese Morning Bun: ($4.25) Fra'mani smoked little ham baked with gruyere cheese and mustard wrapped in croissant dough with sunflower and poppy seeds\n+Chorizo Tart: ($4) Chorizo, caramelized onions, green onions and manchego cheese\n+Everything Croissant: ($3.50) croissant filled w/ cream cheese & green onion topped w/ everything bagel toppings (poppy, sesame, garlic, onion and sea salt)\n+Madame... croque: ($5.98)\n\n*~My Order~*\nChocolate Chocolate Claw\nPistachio Blackberry Twice Baked Croissant\nBostock with Almond Frangipani\nChorizo Tart\nSmoked Salmon Croissant\nMadame... croque\nHam and Cheese Morning Bun\nGuava Cheese Pastelito\nGinger Pull-apart\n\nHad a friend visiting and I had to wake up early to run some errands in the city. Wanted to grab some pastries for everyone and stopped by since I've had this place bookmarked since their soft-opening. I'm a huge pastry person and was told that they make some great croissant pastries, so I was sold! I told the gentleman there that it was my 1st time there and to recommend some popular items. I got a dozen pastries and a line quickly started to form behind me. The gentleman assisting me never rushed me and still placed all the goodies very nicely in the box instead of just throwing them inside. Very greatly appreciated! Pastries were very light, airy, and didn't have the insane buttery-feel left on your lips after eating. My BF and my sister's BF who usually don't care for pastries as much as we do thought the goodies were really good. Highly recommended!\n\nCredit cards accepted", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["Amazing savory and sweet pastries including an everything croissant with poppy seeds, garlic, green onion and cream cheese, along with a delicious smoked cheddar and sauerkraut pastry, but here you can't go wrong with any selection.   ", "I should also mention that the best blueberry muffin I have ever had was made by him as well."], "author": "Adam B.", "review": "No ordinary bakery here, \n\nGreg puts his signature into everything he bakes.  Amazing savory and sweet pastries including an everything croissant with poppy seeds, garlic, green onion and cream cheese, along with a delicious smoked cheddar and sauerkraut pastry, but here you can't go wrong with any selection.   I should also mention that the best blueberry muffin I have ever had was made by him as well.", "rating": 5, "date": "2015-01-24"}, {"excerpts": ["Amazing:\nEverything croissant (get an extra one, you won't regret it)\n"], "author": "Ann L.", "review": "This place doesn't need more reviews, but here we go...\n\nAmazing:\nEverything croissant (get an extra one, you won't regret it)\nMushroom tart (big enough to share) \n\nThey do preorders too! You email them your order, desired time you want the order ready by, they send you an invoice and you pay online. Then you just skip the line and go up to the front to pick up your order.  So easy!\n\nParking was easy to find on weekends, but you can take Muni there too. Line moves quick.", "rating": 5, "date": "2016-06-11"}, {"excerpts": ["My favorite is their everything croissant which is similar to an everything bagel. ", "It's flaky with cream cheese and chives in the center. ", "Carb heaven."], "author": "Cindy A.", "review": "This is what a bakery should be. Open early and only for a few hours selling their freshest baked goods. You walk in order your pastry and walk out; none of this fancy-stuffy-standing-in-line-San Francisco bullshit. I've tried almost everything and it's always been solid. My favorite is their everything croissant which is similar to an everything bagel. It's flaky with cream cheese and chives in the center. Carb heaven.", "rating": 5, "date": "2015-12-17"}, {"excerpts": ["I crave the Everything Croissant ($3.50)! ", "It's seeded on the outside and inside has a small amount of onion cream cheese. ", "Devine and genius. ", "I don't know if it's because I love it so much, or "], "author": "Rachelle T.", "review": "Neighbor Bakehouse is seriously my favorite croissant place right now! \n\nI crave the Everything Croissant ($3.50)! It's seeded on the outside and inside has a small amount of onion cream cheese. Devine and genius. I don't know if it's because I love it so much, or because it's on the smaller size, but this croissant is eaten in no time! \n\nFor a sweet tooth, try the Ginger Pull-apart ($3.50). It is made up of croissant scraps and is sweet is caramelized and awesome.", "rating": 5, "date": "2015-05-19"}, {"excerpts": ["I got the ginger pull-apart, the everything croissant, pistachio blackberry croissant, and a cafe au lait. ", "My favorite was the everything croissant! ", "It was so savory and delicious", ", I think I could eat it every day. ", "The ginger pull-apart was good too, but I wish there was more of a ginger taste? ", "Haven't tried the pistachio yet because it'll be my breakfast for tomorrow. ", ":) Would gladly go back! ", "Glad to see a very good bakery with reasonable lines and wait time."], "author": "Mai H.", "review": "My friends have been raving about Neighbor Bakehouse so I decided to give it a try! I got there around 9am on Saturday and there was a line, but it moved fast -- I got my food in about 10 minutes. I got the ginger pull-apart, the everything croissant, pistachio blackberry croissant, and a cafe au lait. My favorite was the everything croissant! It was so savory and delicious, I think I could eat it every day. The ginger pull-apart was good too, but I wish there was more of a ginger taste? Haven't tried the pistachio yet because it'll be my breakfast for tomorrow. :) Would gladly go back! Glad to see a very good bakery with reasonable lines and wait time.", "rating": 5, "date": "2016-08-27"}, {"excerpts": ["My absolute favorites were the everything croissant and the ginger pull apart. \n\n"], "author": "Kristen C.", "review": "This place is pastry HEAVEN.\n\nWe tried pretty much everything they had to offer and all their pastries were exceptional. My absolute favorites were the everything croissant and the ginger pull apart. \n\nThank goodness these guys aren't actually in my neighborhood and I can only make it here on weekends. Otherwise I'm pretty sure I'd be here 24/7 and turn into one giant pastry!\n\nI've got to hand it to them though, they are baking geniuses!", "rating": 5, "date": "2015-03-24"}, {"excerpts": ["Although I wanted to get one of everything, I narrowed it down to the Everything Croissant, the Kimchi Bun, and the Chocolate Claw. ", "All three were sooooooo good!  ", "I don't think I can pick a favorite since they were all quite different but equally tasty. ", "I definitely want to go back to taste the other items."], "author": "Jennifer E.", "review": "Amazing baked goods!  I had been running by here in the mornings, and there is always a line of people out front so I decided to check it out today.  Although I wanted to get one of everything, I narrowed it down to the Everything Croissant, the Kimchi Bun, and the Chocolate Claw. All three were sooooooo good!  I don't think I can pick a favorite since they were all quite different but equally tasty. I definitely want to go back to taste the other items.", "rating": 5, "date": "2015-09-12"}, {"excerpts": ["These pastries are pretty pricey but on the times when I feel like spending a little bit more money for breakfast I would definitely come to Neighbor Bakehouse and pick me up an EVERYTHING CROISSANT & GINGER PULL-APART. ", "These two pastries will make any morning just 10x better."], "author": "Wyatt T.", "review": "These pastries are pretty pricey but on the times when I feel like spending a little bit more money for breakfast I would definitely come to Neighbor Bakehouse and pick me up an EVERYTHING CROISSANT & GINGER PULL-APART. These two pastries will make any morning just 10x better.", "rating": 4, "date": "2016-11-22"}, {"excerpts": ["Definitely try the Everything Croissant and the plain croissant. ", "It is worth the drive down here. ", "Eat it immediately and don't try and savor it 5 hours later. ", "I mean, it'll still be great, but not amazing! ", "The first time I went, I bought a box to sample everything they made. ", "Since I couldn't eat all of it, I decided to eat them later on. ", "Bad idea. ", "Baked goodies are meant to be eaten fresh. ", "Period. ", "Be warned, if you eat the Everything Croissant, be sure there are no seeds stuck between your teeth, because you'll sure be smiling after you consume one!"], "author": "Ny H.", "review": "Hands down, the number one place to get the BEST croissant in the city. Definitely try the Everything Croissant and the plain croissant. It is worth the drive down here. Eat it immediately and don't try and savor it 5 hours later. I mean, it'll still be great, but not amazing! The first time I went, I bought a box to sample everything they made. Since I couldn't eat all of it, I decided to eat them later on. Bad idea. Baked goodies are meant to be eaten fresh. Period. Be warned, if you eat the Everything Croissant, be sure there are no seeds stuck between your teeth, because you'll sure be smiling after you consume one!", "rating": 5, "date": "2015-05-29"}, {"excerpts": ["We had:\n- The Everything Croissant - really nice, seedy, little swirl of cream cheese inside. ", "for tartness \n- Cheddar/Sauerkraut pastry - good, nice flakey, was hoping the inside would be tastier.\n", "- Bostock Almond thang - THIS was awesome. ", "Highly recommend. ", "It had this delicious soft but moist bread and was unreal. \n"], "author": "Subie C.", "review": "Don't throw your croissant at me. I thought it was delicious, just not crazy amazing-must-consume-everything-and-bring-more-home. \nWe went on a Saturday morning around 10:45 and I was fully expecting a wait, but there was none. So yay for that. \n\nWe had:\n- The Everything Croissant - really nice, seedy, little swirl of cream cheese inside. for tartness \n- Cheddar/Sauerkraut pastry - good, nice flakey, was hoping the inside would be tastier.\n- Bostock Almond thang - THIS was awesome. Highly recommend. It had this delicious soft but moist bread and was unreal. \n- Ham and cheese morning bun -- this was supposed to be the same dough as the croissant.. but it was drier and not as buttery. \n\nCoffee was decent - a little small, as most hipster places go.\nNice little outdoor area with seating to hang out in on the sidewalk. So glad that this was added to DogPatch scene, love that neighborhood.", "rating": 4, "date": "2015-05-03"}, {"excerpts": ["The ginger pull apart...the coco claw..the everything croissant..the scone...you name it! ", "Do yourself a favor and get some of this in your belly! ", "NOW!"], "author": "Kevin G.", "review": "Anytime I go. Everything I get. 5 stars flat. It is absolutely delicious. The ginger pull apart...the coco claw..the everything croissant..the scone...you name it! Do yourself a favor and get some of this in your belly! NOW!", "rating": 5, "date": "2016-05-08"}, {"excerpts": ["There was still a tray of butter croissants ($3/each), a tray of everything croissant ($3.50/each) and a few of something else that i didn't pay attention to.\n\n"], "author": "Jan H.", "review": "Came here because my sister wanted croissants from this place.\n\nThey close at 12 PM and I got here at 11:50 AM.\n\nThere was still a tray of butter croissants ($3/each), a tray of everything croissant ($3.50/each) and a few of something else that i didn't pay attention to.\n\nSome staff members were heading out as i walked in and some were making dough (probably for the next day).\n\nThe staff are all very friendly and provide great customer service.\n\nThere is outdoor seating on the outside which is nice if you want to sit down and chat with a friend over a Cup of Joe and a croissant.\n\nTheir croissants are puffy and flaky. I liked it a lot but i think i need to try the croissant when it was fresh out the oven to give it another star.\n\nUntil next time....", "rating": 4, "date": "2015-03-24"}, {"excerpts": ["and I was delighted with the Everything Croissant.  ", "Cheese and onion inside!  ", "oh my...", "I wish i could have one everyday.  ", "I think they are open for the perfect hours. ", "Just the morning, until they run out of stuff.  ", "Go early get your stuff and be happy."], "author": "Christian H.", "review": "what a great place.  All of their pastries are top notch and I was delighted with the Everything Croissant.  Cheese and onion inside!  oh my...I wish i could have one everyday.  I think they are open for the perfect hours. Just the morning, until they run out of stuff.  Go early get your stuff and be happy.", "rating": 5, "date": "2015-08-20"}, {"excerpts": ["The everything croissant is my favorite."], "author": "Amin S.", "review": "The best croissant-dough based pastries in SF. The everything croissant is my favorite.", "rating": 5, "date": "2015-06-12"}, {"excerpts": ["The ginger pull-apart, the everything croissant", ", the assorted muffins -- all of it is thrilling. ", "I actually find myself having little heart palpitations as I walk down Third Street from the Muni stop. ", "Fair warning, this is the stuff you dream about. ", "They are still in the soft opening stage with limited hours and limited offerings - but whatever you're able to get will be amazing!"], "author": "Robert M.", "review": "I'm not sure how they manage to get enough crack to put into all the pastries, but these things are addictive! The ginger pull-apart, the everything croissant, the assorted muffins -- all of it is thrilling. I actually find myself having little heart palpitations as I walk down Third Street from the Muni stop. Fair warning, this is the stuff you dream about. They are still in the soft opening stage with limited hours and limited offerings - but whatever you're able to get will be amazing!", "rating": 5, "date": "2015-04-13"}, {"excerpts": ["It sounded like a weird combination for a croissant but probably ended up being my favorite sweet thing\n- Everything croissant: a savory croissant with a topping that's like an \"everything bagel.", "\" ", "It added lots of textures and flavors and was an interesting take on the croissant - ", "I think I liked this more than the regular one\n- Mushroom tart: another wonderful savory pastry. ", "There was a lot of mushroom, and the slightly sweet tart base was a nice contrast to the cheese and woody mushrooms. ", "This was probably my favorite savory item\n- Ham and cheese morning bun: kind of like a ham and cheese croissant but better. ", "The bun itself had the right amount of doughy sweetness without being actually sweet, and the nuts and seeds on top (similar to the everything croissant) added more texture. "], "author": "Marilyn T.", "review": "I wish they had longer hours, but it is nice that they only sell things when they're fresh out of the oven!  You order things as they're still sitting on the cooling racks.  \n\nLuckily, the line was only a few people deep at 8am on a Wednesday, and they do have coffee and tea.\n\nMost things are viennoiserie based. I clearly had a hard time choosing, so I got almost one of everything...\n\n- Butter croissant: it was a little less flaky than I was hoping for, but it looked beautiful, and I was eating it over 12 hours after it came out of the oven. It had just the right amount of sweetness and saltiness\n- Chocolate claw: kind of like a chocolate croissant\n- Pistachio twice baked croissant: I did not expect for a hint of marzipan (maybe honey pistachio paste?), but I loved itt. The crust on top reminds me of Chinese \"pineapple buns\", and the filling has blueberry to add some fruitiness without making it too sweet or tart. It sounded like a weird combination for a croissant but probably ended up being my favorite sweet thing\n- Everything croissant: a savory croissant with a topping that's like an \"everything bagel.\" It added lots of textures and flavors and was an interesting take on the croissant - I think I liked this more than the regular one\n- Mushroom tart: another wonderful savory pastry. There was a lot of mushroom, and the slightly sweet tart base was a nice contrast to the cheese and woody mushrooms. This was probably my favorite savory item\n- Ham and cheese morning bun: kind of like a ham and cheese croissant but better. The bun itself had the right amount of doughy sweetness without being actually sweet, and the nuts and seeds on top (similar to the everything croissant) added more texture. The ham and cheese were really good, and I wish there were more inside\n- Sauerkraut tart: I like sauerkraut, and I like cheese, but maybe not the two together? The tart base held up well and had good flavor, but the red peppers and sauerkraut were a little too tart and sort of abrasive?  Otherwise, the baked cheese topping was nice\n\nOK so maybe I went a little overboard with the ordering, but everything just looked so beautiful!  Each pasty is $3-4ish, but they're quite large, so it's nice to get a bunch and share with people. If you don't consume it immediately, everything is good if you re-heat it a bit in the oven.\n\nThere are parking spots out front, but those are reserved for the company next door, so you'll have to find street parking.  Previously, it was cash only, but they take credit card now!  This is definitely going to be a go to/destination bakery for me.", "rating": 5, "date": "2015-04-23"}, {"excerpts": ["That everything croissant was EVERYTHING to me!! ", "AMAZING!   ", "I have also tried the ham and cheese bun, the ginger pull-apart, the brown butter cake, the pistachio-blackberry croissant ....  ", "I think you get the point, I can't stop! ", "Everything I have tasted from Neighbor Bakehouse is simply divine."], "author": "Allison V.", "review": "That everything croissant was EVERYTHING to me!! AMAZING!   I have also tried the ham and cheese bun, the ginger pull-apart, the brown butter cake, the pistachio-blackberry croissant ....  I think you get the point, I can't stop! Everything I have tasted from Neighbor Bakehouse is simply divine.", "rating": 5, "date": "2016-01-19"}, {"excerpts": ["My personal favorites are the Croque Madame, the mushroom tart, the sauerkraut croissant and the everything croissant. ", "I've tried just about everything on their menu and everything has been spectacular. ", "Best pastries in SF!"], "author": "Ryan C.", "review": "I would give Neighborhood Bakehouse six stars if I could. Everything on the menu is amazing. My personal favorites are the Croque Madame, the mushroom tart, the sauerkraut croissant and the everything croissant. I've tried just about everything on their menu and everything has been spectacular. Best pastries in SF!", "rating": 5, "date": "2016-02-22"}, {"excerpts": ["Also, the everything croissant...brilliant. ", "Friendly folks, sunny outdoor seating.  ", "This place is the best."], "author": "Gale F.", "review": "I've tried most things on the menu here now, and everything is amazing. The chocolate pudding bun has changed my life--and I mean that literally--every weekend I get this insatiable urge to have one and I must go there. Also, the everything croissant...brilliant. Friendly folks, sunny outdoor seating.  This place is the best.", "rating": 5, "date": "2016-12-18"}, {"excerpts": ["There were virtually no layers in the everything croissant. ", "They were all smushed into a compact, buttery yuckiness. ", "Why didn't the layers rise? ", "Didn't fold enough? ", "Tried to bake with cream cheese inside? ", "If you can't figure out how to get the layers with the cream cheese baked in, maybe you're better off baking sans cream cheese to get the layers, and then cutting open and stuffing with cream cheese. ", "Speaking of cream cheese, it was scarce as well. ", "Barely saw or tasted any. ", "It needed about 3-4 times as much as was in there. ", "Try again please."], "author": "Monty B.", "review": "Mixed feelings about their pastries. The sweets were good, the savories were disappointing. The ginger pull apart was probably our favorite. Loved the crystallized ginger. The pistachio blackberry croissant was a close second. Unfortunately, that's where the compliments end. The ham & gruyere morning bun was scarce in both ham and cheese. There were virtually no layers in the everything croissant. They were all smushed into a compact, buttery yuckiness. Why didn't the layers rise? Didn't fold enough? Tried to bake with cream cheese inside? If you can't figure out how to get the layers with the cream cheese baked in, maybe you're better off baking sans cream cheese to get the layers, and then cutting open and stuffing with cream cheese. Speaking of cream cheese, it was scarce as well. Barely saw or tasted any. It needed about 3-4 times as much as was in there. Try again please.", "rating": 3, "date": "2016-08-22"}, {"excerpts": ["I try some new weird item whenever I can, but mainly get the everything croissant, with chive and cream cheese, and morning buns. ", "OMG the ginger pull-apart, beautiful. ", "Yum yum yummy"], "author": "SL B.", "review": "So good it hurts. Hours are highly irregular. You can find their stuff in coffee houses in city, but it costs more than buying directly from them. Would not go here if you're in a hurry. Parking in area sucks but worth circling. Usually a long line, but sometimes I get lucky.  Croissants are perfect, flakey and buttery. Do not eat in your car! ha. Love their savory and sweet inventions. I try some new weird item whenever I can, but mainly get the everything croissant, with chive and cream cheese, and morning buns. OMG the ginger pull-apart, beautiful. Yum yum yummy", "rating": 5, "date": "2016-11-02"}, {"excerpts": ["The goods (we got a chocolate croissant, the Manchego and Mushroom, and the Everything Croissant) were much better than good. ", "Real neighborly vibe to the whole thing, and excellent coffee. ", "It's a little bit out of my neighborhood, but I can make the trek at least once a week...", "Go now before they get famous and the line is still pretty short."], "author": "James P.", "review": "Best baked goods I ever ate. I read all the rave reviews on Yelp, and decided to give it a shot. Good choice, James (patting self on back...). The goods (we got a chocolate croissant, the Manchego and Mushroom, and the Everything Croissant) were much better than good. Real neighborly vibe to the whole thing, and excellent coffee. It's a little bit out of my neighborhood, but I can make the trek at least once a week...Go now before they get famous and the line is still pretty short.", "rating": 5, "date": "2015-01-20"}, {"excerpts": ["Also got everything croissant, butter croissant, chocolate chocolate claw, pistachio blackberry twice baked croissant and a cookie. ", "All were excellent. ", "I wished it was closer to where I live so that I can go everyday for my pastry fix."], "author": "Mary L.", "review": "Definitely did not disappoint me!  The line was long but I have been wanting to try their pastries for so long so I stayed in line. They are so efficient that it only took about 10-15 mins. total. I was expecting way longer like B Patisserie. The ginger pull apart was amazing and a must get. Also got everything croissant, butter croissant, chocolate chocolate claw, pistachio blackberry twice baked croissant and a cookie. All were excellent. I wished it was closer to where I live so that I can go everyday for my pastry fix.", "rating": 5, "date": "2016-04-09"}, {"excerpts": ["I tried the Everything Croissant with cream cheese this week at Sightglass and now I can't resist getting it every day!!! ", "Their pastries and treats are unique and delicious, I'm a big fan!"], "author": "Marissa G.", "review": "I tried the Everything Croissant with cream cheese this week at Sightglass and now I can't resist getting it every day!!! Their pastries and treats are unique and delicious, I'm a big fan!", "rating": 5, "date": "2015-07-25"}, {"excerpts": ["My favorites were the everything croissant filled with cream cheese and the ginger pull apart bread."], "author": "Brian R.", "review": "I tried 1 of everything and they were all delicious! My favorites were the everything croissant filled with cream cheese and the ginger pull apart bread.", "rating": 5, "date": "2015-07-19"}, {"excerpts": ["Ordered Bostock and Everything Croissant. ", "Both were very tasty and at a much better price range than others with similar quality. ", "Would definitely recommend to anyone who love pastry."], "author": "J Y.", "review": "Arrived in the morning on Saturday, with no line what so ever. Ordered Bostock and Everything Croissant. Both were very tasty and at a much better price range than others with similar quality. Would definitely recommend to anyone who love pastry.", "rating": 5, "date": "2015-08-03"}, {"excerpts": ["Next time I would love to try the everything croissant. ", "Wish it were open longer."], "author": "Chloe W.", "review": "Excellent chocolate croissant, very light and flaky and didn't feel greasy. I only wish it had still been warm so the chocolate would stay melted! Next time I would love to try the everything croissant. Wish it were open longer.", "rating": 5, "date": "2015-02-11"}], "chocolatechocolate claw": [], "pistachio blackberry twicebaked croissant": [], "cinnamon almond bostock": [{"excerpts": ["My favorite picks are:\n\n(1) The Cinnamon Almond Bostock - I love this pastry because it is a cross between a French toast and a croissant - the child that got the best genes from both parents. "], "author": "Vivienne K.", "review": "Neighbor Bakehouse, you never bor me away. \n\nThis is my all time favorite bakery in San Francisco. \nSituated right off 3rd street with an expansive outdoor seating area by San Francisco standards, this bakery is hard to miss on weekends as the wait is usually in the range of 20-45 minutes, depending on the time of day. \n\nWith fresh baked batches of assorted pastries made on site every hour or so, the aromas of the varying depths of flavors - berries; chocolate; pear; ginger; roasted nuts - burst through the air and grab your soul. \n\nMy favorite picks are:\n\n(1) The Cinnamon Almond Bostock - I love this pastry because it is a cross between a French toast and a croissant - the child that got the best genes from both parents. Crisp and buttery on the outside, soft layered and airy on the inside, with the flavor of the roasted almonds and cinnamon throughout.  The perfect start to any day. \n\n(2) The ginger pull apart - The way this bread is twisted not only makes this bread a fun pull apart to share with friends, but it is also positioned as to maximize the surface area and optimize the crunch effect - and add to that the flavor of the fiery ginger. This is another classic. \n\n(3) The Twice Baked Croissants - I really enjoy the various flavors of the twice makes. The way that the berries complement the herbs, all baked inside a twice baked croissant for that added crunchy texture makes for a complex flavor combination with varying debts of texture. \n\n(4) The Kimchee Toast - On top the buttery, fresh thick milk toast are the tart kimchee, scallions, and cheese.  Though I have a sweet tooth, I quite enjoy the savory bread on occasion.  The one thing that makes this one more enjoyable is reheating it - else the kimchee-cheese-scallion is easy to separate from the toast and the situation gets messy. \n\nThe tea and coffee are also carefully made cup by cup - a good wake up call. \n\nNeighbor Bakehouse, I'm so happy we are neighbors.", "rating": 5, "date": "2018-10-21"}, {"excerpts": ["very little hint of ginger taste, reminds me of monkey bread but better\n\nCinnamon Almond Bostock - "], "author": "Connie W.", "review": "Street parking was easy for 9:30 on Sun morning.\nLined up outside and ate outside at communal picnic tables.  The vibe is relaxed and laid back. \nThe weather in Jun was typical morning overcast, not too cold, not too hot.  It was perfect weather to eat outside.  But I can imagine the short raining season when it might not work for alfresco dining.\nSeems like all the pastries  we ate was a croissant derivative, real buttery and flaky, 5 starts for each item.\n\nEverything Croissant - seeds and nuts on the outside, soft cream cheese on the inside, I can imagine being in France.\n\nHam and Cheese morning bun - savory with sweet \n\nRaspberry hazelnut twice-bake -  smallest and sweetest of the bunch, very moist with the fresh fruit\n\nGinger pullapart - my son's favorite, largest pastry we got, very little hint of ginger taste, reminds me of monkey bread but better\n\nCinnamon Almond Bostock - This is almond fantasy, cake like toast with almond taste, my personal favorite", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["* Cinnamon Almond Bostock ($4.50) - 4 stars\n", "This was soft & delicious! "], "author": "Ziyan C.", "review": "Finally got to go here! At 1pm on a Saturday, there was a short line and seats available outside, but they were out of a few baked goods. \n\n* Cinnamon Almond Bostock ($4.50) - 4 stars\nThis was soft & delicious! Especially for a french toast lover like me.\n\nAfter they closed at 2pm, they left a tray of free goodies and bags outside! I got some ciabatta bread, a croissant, and a muffin.", "rating": 4, "date": "2018-02-19"}, {"excerpts": ["After hearing rave reviews about the cinnamon almond bostock, I ordered one and I am so glad I did. ", "What a decadent pastry bursting with almond flavor! "], "author": "Elyse W.", "review": "This just might be my new favorite bakery in SF!  \n\nI came here on a Saturday morning and easily spotted the bakery based on the line snaking down the block. The cashiers here work efficiently, so it felt like no time before I made it to the beginning of the line. Once I was inside the bakery, I was confronted with an onslaught of delicious-looking pastries. I wanted to order EVERYTHING. After hearing rave reviews about the cinnamon almond bostock, I ordered one and I am so glad I did. What a decadent pastry bursting with almond flavor! My friend ordered the ham and cheese morning bun which was also heavenly -- the croissant dough is light, buttery perfection. \n\nDespite being crowded on a Saturday morning, my friends and I were able to snag a spot at the outdoor tables. There's nothing better than enjoying a beautiful San Francisco day with a delicious pastry and coffee in hand. My only complaint is that I have to travel all the way to the Dogpatch to get my pastry fix. \n\nPistachio blackberry twice-baked croissant, I'm coming back for you!", "rating": 5, "date": "2017-09-18"}, {"excerpts": ["My top two favorites were the cinnamon almond bostock and the pistachio blackberry twice-baked. ", "I was most excited to try the bostock- which comes in a pretty fair size, very thick and dense. ", "For the price, it exceeded my expectations and didn't disappoint. ", "I'm not a huge fan of croissants unless they are stuffed or there's just something special about it. ", "But, this one has got to be the best ", "I've had/ in a long time. "], "author": "Audrey K.", "review": "My top two favorites were the cinnamon almond bostock and the pistachio blackberry twice-baked. I was most excited to try the bostock- which comes in a pretty fair size, very thick and dense. For the price, it exceeded my expectations and didn't disappoint. I'm not a huge fan of croissants unless they are stuffed or there's just something special about it. But, this one has got to be the best I've had/ in a long time. The pistachio and blackberry compliment one another and it's a pretty heavy pastry, but the flavors are unique combination which make it really good. \n\nThe runner- up is the passionfruit doughp bun, which we ate last because I knew the passionfruit flavor would be on the stronger side and take away our taste buds from everything else. The filling ratio was the perfect amount, right amount of tartness and something more on the tropical side (different from the other pastries they offer). \n\nTried the guava & cream cheese pastelito, which didn't really amaze me too much. There wasn't enough filling and I would probably prefer the one offered at Porto's in LA.\n\nThe only savory item we tried was the curry potato turnover, the flavor was bland. even when the worker recommended this one over the mushroom tart, but I was disappointed in this one. Probably my least favorite.", "rating": 5, "date": "2017-11-16"}, {"excerpts": ["- cinnamon almond bostock ($4.50)- ", "it looks like a slice of thick toast, but pulls apart like a cinnamon bun. ", "Topped with crunchy almonds and just sweet enough. "], "author": "Ryen B.", "review": "I'm not a pastry-for-breakfast person. I usually find them too sweet and not worth the calories, so didn't have high hopes when my brother recommended this place. Boy, was I wrong. Everything we tried was delish. \n- Sauerkraut, smoked cheddar, and peppadew tart ($3.75)- this was the unanimous favorite. Gone so quick I didn't even have time for a pic. It sounds like a crazy combo, but was delish.\n- Kimchee toast ($6)- thick slice of bread with some sort of creamy cheese, mild kimchee, and melted cheese on top. Genius! I want to try to make this at home with a spicier kimchee.\n- Smoked fish and cream cheese croissant ($4.50)- not my fave filling, but the croissant pastry itself was as light as air, so good!\n- cinnamon almond bostock ($4.50)- it looks like a slice of thick toast, but pulls apart like a cinnamon bun. Topped with crunchy almonds and just sweet enough. This was great!\n\nThere is a line, but it moves quick. Only seating is at the outdoor tables, so dress for the weather or get it to go. Bring a friend (or 2) so you can order a bunch of things to share. Def recommend.", "rating": 4, "date": "2017-07-15"}, {"excerpts": ["Ginger pull-apart\nCinnamon almond bostock\nBuckwheat orange financier\nVege pizza\nCoffee cake\nEverything croissant"], "author": "Sean W.", "review": "Neighbor bakehouse is my personal favorite Western bakery in SF, especially in the Eastern part. IMO it's highly underrated. Neighbor consistently serves high quality \"artisanal\" bread without as much hype as places such as Tartine. I always come through here on the weekend to get my bread fix. They serve loaves, savory pastries and sweet pastries.  Breads are priced pretty high, but inline with other high-tier bakeries (or just SF). The menu changes from time to time and they run out of breads by the end of the shift. \n\nLocated in dogpatch, it's a lowkey bakery with some seating outside. Lines vary between no line to 20m lines.\n\nI've ordered (* is a favorite)\n* Smoked fish cream cheese croissant \n* Raspberry violet twice-baked\n* Pistachio blackberry twice-baked\n* Potato curry with chorizo turnover\nGinger pull-apart\nCinnamon almond bostock\nBuckwheat orange financier\nVege pizza\nCoffee cake\nEverything croissant", "rating": 5, "date": "2017-12-25"}, {"excerpts": ["Come for the cinnamon almond Bostock (5/5)! ", "You won't regret it. ", "Ordered other goodies including the butter croissant, twice baked blueberry pistachio croissant, and ham & gruyere bun."], "author": "Amy H.", "review": "Nice neighborhood bakery with friendly staff. One person ahead of us on a Saturday morning (8am) but a line quickly developed. Come for the cinnamon almond Bostock (5/5)! You won't regret it. Ordered other goodies including the butter croissant, twice baked blueberry pistachio croissant, and ham & gruyere bun.", "rating": 4, "date": "2018-09-01"}, {"excerpts": ["Cinnamon almond bostock - I would never order this based on the name (just doesn't sound appealing to me), but thanks to Yelp highlights, I went for it ", "and it was easily my favorite item on the list. "], "author": "Lisa N.", "review": "This place is so good. My friend lives in Dogpatch and recommended we grab some pastries for our flight home.....so I did. I went in there and pointed at random items that sounded good. I ended up with:\n\nSmoked salmon cream cheese croissant - something like that, don't remember exactly --- all I remember was that it was flaky exterior, tasty, creamy interior. Could've used a touch more smoked salmon, but meh.\n\nHam and cheese morning bun - ratio of ham and cheese not so great, most of the croissant was hollow...but can't argue with how perfect the croissant was; flaky and buttery, the perfect complement to the salty ham and cheese\n\nEverything croissant - exactly what you'd expect, executed perfectly. The flaky croissant topped with the everything seasoning. Love my savory pastries. \n\nCinnamon almond bostock - I would never order this based on the name (just doesn't sound appealing to me), but thanks to Yelp highlights, I went for it and it was easily my favorite item on the list. Sweet, slightly crispy exterior. \n\nI ate 1 pastry per day for the next week! Popped it in the toaster oven at work...and they were all still good......comparable to when I had it freshly baked. \n\nEveryone was friendly and I didn't feel rushed when I was deciding. A little on the pricey side for a baked good, but well worth the quality and freshness.", "rating": 5, "date": "2017-09-07"}, {"excerpts": ["I wish I'd gotten the cinnamon almond bostock instead. "], "author": "Karen S.", "review": "Neighbor Bakehouse has some fantastic baked goods, but it's not without imperfections. My favorite of the pastries I tried was the pistachio blackberry twice baked. It was pretty decadent for a croissant- buttery, flaky, and definitely satisfies my sweet tooth. The ginger pull-apart was similar to a Kouign Amann, enjoyable but B. Patisserie's version is so good, everything else pales in comparison. I am forever ruined. \n\nThe passion fruit doughp bun was really disappointing. It's only now that I type this out that I realize the intent behind the spelling. Dough + p = dope! Major points for the name, but the taste was not dope. The brioche bun was dry, and it took 5 bites of dough before I got to any filling. The passion fruit curd was a tad too sour, and I generally love tart desserts. I wish I'd gotten the cinnamon almond bostock instead. This was a complete waste of calories and money.\n\nI think I'd still rather wait in the long line at Tartine.", "rating": 4, "date": "2017-06-20"}, {"excerpts": [":\n- Guava and cream cheese pastelito \n- Cinnamon Almond Bostock\n\n"], "author": "Benson M.", "review": "Great bakers aren't born, they're bread. And Neighbor Bakehouse is no different especially when it comes to their fantastic team of bakers and pastry chefs. Needless to say, if you're ever in the Dogpatch area this is a MUST visit for all carb-lovers! They're great at turning your average stale day into a butter day! \n\nMy to go favorites:\n- Guava and cream cheese pastelito \n- Cinnamon Almond Bostock\n\nNote: Always remember to ask the staff about their favorites.", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["We ordered:\n\nPistachio blackberry croissants\nCinnamon almond bostock \nChocolate claw \nGinger pull aparts\nSauerkraut smoked cheddar peppadew tart\n\nPersonally, I only tried the pistachio croissant and the cinnamon almond bostock. "], "author": "Ashley W.", "review": "I was pretty skeptical about trying this place out. We wanted to pick up some baked goods for a party we were going to and it was either here or Mr. Holmes. Mr. Holmes was sold out of a lot of items so we headed to Neighbor Bakehouse and man are we glad we did. There was a big line outside on Sunday morning around 11am. It took us about 20-25 minutes to get to the counter. We ordered:\n\nPistachio blackberry croissants\nCinnamon almond bostock \nChocolate claw \nGinger pull aparts\nSauerkraut smoked cheddar peppadew tart\n\nPersonally, I only tried the pistachio croissant and the cinnamon almond bostock. But they were SO good. The croissant was flaky and moist with the perfect amount of pistachio flavoring and the bostock was flavorful with a delicious crust. I didn't try the other items but man, the pastries were the hit of the party and they went quick! Their pastries range from $3-$7ish, which sounds ridiculous but it is worth it once you take that first bite. \n\nParking in this area alright, better than most other parts of SF. We also loved how there were plenty of seats outside that are dog friendly. Lastly, 5 stars for their hipster vibe. \n\nWe will definitely be back!", "rating": 5, "date": "2018-02-06"}, {"excerpts": ["The Passionfruit dough bun, ginger pull apart, pistachio blackberry roll and the cinnamon almond bostock."], "author": "Julia N.", "review": "Probably the best baked goods I've ever had because of the unusual flavors and the perfect crispiness!  I haven't tried the savory items, simply because the sweets are so amazing and I don't get there enough.  My favorites:  The Passionfruit dough bun, ginger pull apart, pistachio blackberry roll and the cinnamon almond bostock.", "rating": 5, "date": "2018-07-07"}, {"excerpts": ["Cinnamon Almond Bostock ($4) - basically a buttery slice of cinnamon bread slathered with almond frangipane.  ", "Really good with flaky ends and melt-in-your-mouth soft buttery center.  ", "Almond frangipane is sweet but no too sweet, with a relatively generous portion of soft sweet almonds.  "], "author": "Vanessa O.", "review": "Yum!  Solid 4.5 stars.  Everything we had here was pretty good.  In terms of visual appeal, most of their pastries are relatively dark in color (so they look dry and not sweet), but don't let looks deceive you.  This was good for me so I didn't order everything--some other bakeries make me want everything, but this one visually limited my lust.  Neighbor's flaky buttery pastries rival b. Patisserie's (but nothing comes close to b's Kouign Amann), though their menus differ completely with the exception of the plain croissant.\n\nCinnamon Almond Bostock ($4) - basically a buttery slice of cinnamon bread slathered with almond frangipane.  Really good with flaky ends and melt-in-your-mouth soft buttery center.  Almond frangipane is sweet but no too sweet, with a relatively generous portion of soft sweet almonds.  Think of this as a less greasy, slightly more firm almond croissant.\n\nPistachio Blackberry Twice-Baked ($4) - basically a sliced croissant with blackberry jam and pistachio creamy crumble inside.  The pistachio innards are fantastic, and the croissant is flaky outside, buttery, and moist inside.\n\nHam and Cheese Morning Bun ($4.25) - interior is rolled in sesame seeds and poppy seeds which really distinguishes this from your typical ham and cheese pastry.  Really soft and tasty, but cheese formed a hard disc on the bottom which I didn't particularly care for, however this is a good savory option.\n\nGinger Pull-Apart Bread ($3.75) - hubby liked it.  I liked the buttery pieces (personally not a fan of ginger), however the pastry was not consistent throughout--some pieces super buttery, some super gingery, some slightly dry.  Hubby would get again, but I'd pass, as if prefer for it to be more consistent and moist throughout.  Overhyped in my opinion.\n\nChocolate Pudding Dough Bread ($4) - good pudding interior and nice salty crunchy chocolatey bits on top.  However, the bread itself was slightly dry--I understand how another Yelper mentioned it tasted stale...I don't think it's really stale (they're constantly turning pastries with the constant line at this place!)--I think it's just that the bread has to be relatively harder to hold its shape with the liquidy pudding inside.  I warmed it up in the microwave for 12 seconds--but that was probably 10 seconds too long, because the pudding became chocolate milk.  Tasty but messy pudding!  I would only get again if I were craving chocolate and happened to be here--otherwise id prefer a b. Patisserie nutella Kouign Amann or even a La Boulangerie chocolate pot de creme danish.\n\nEat outside at the multiple picnic benches or take out.  Free parking on side streets and Illinois.  They accept credit cards via iPad Square (not sure why another Yelper said cash only).", "rating": 5, "date": "2016-07-09"}, {"excerpts": ["We treated ourselves to a spread of yummies: \n\nPistachio blackberry twice-baked croissant - SUPER flaky and caramelized on the outside\nGinger pullapart - Typically ginger is very overpowering but it was subtle enough to be very enjoyable\nCinnamon almond bostock - My favorite of the bunch, my favorite flavors in a hefty bite\nChocolate pudding doughnut bun - Underwhelming but the amount of pudding does not disappoint!\nPassionfruit fruit coconut macaron - tropical colorful flavors together, delish !\n"], "author": "Crystal N.", "review": "Best bakery I've yet to visit - we stayed at our friend's place this last weekend and were delighted to see that this bakery was just a couple blocks away ! We treated ourselves to a spread of yummies: \n\nPistachio blackberry twice-baked croissant - SUPER flaky and caramelized on the outside\nGinger pullapart - Typically ginger is very overpowering but it was subtle enough to be very enjoyable\nCinnamon almond bostock - My favorite of the bunch, my favorite flavors in a hefty bite\nChocolate pudding doughnut bun - Underwhelming but the amount of pudding does not disappoint!\nPassionfruit fruit coconut macaron - tropical colorful flavors together, delish !\nPassionfruit doughnut bun - my husband's favorite, the passionfruit was so strong !\nSmoked trout and cream cheese croissant - Yummmmmm \nGuava and cream cheese pastelito - Guava was not as strong as I hoped it'd be but still delish !", "rating": 5, "date": "2017-03-01"}, {"excerpts": ["Personal standouts for me would be their croissants(any of them really, but you can't go wrong with their signature pistachio-blackberry), the guava & cream cheese pastelito, and the cinnamon almond bostock. "], "author": "Edward R.", "review": "THIS. Forget Tartine, Holmes, B. Patisserie, or any of the other big names - this is the secret treasure you're looking for. I've come here several times, and this is the only bakery that has never let me down. Everything is good, and many things are great. One of the few 5 stars I would give, because it's one of the few places I would actually outright recommend to a visiting friend. I actively seek this place out, and I'm still looking to explore more of their menu, particularly on the savory side since I haven't explored that as much yet. Personal standouts for me would be their croissants(any of them really, but you can't go wrong with their signature pistachio-blackberry), the guava & cream cheese pastelito, and the cinnamon almond bostock. Their pastry layers are superb!\n\nI also like the open kitchen aspect of it - it gives off a homey vibe, with reasonable pricing to match. If you're in the area, I'd definitely say to give it a whirl! You won't regret it.", "rating": 5, "date": "2017-08-16"}, {"excerpts": ["I heard a lot of compliments about this place, I decide to come back and try 6 different things\n- 2 ham& cheese morning bun\n- everything croissant \n- cinnamon almond bostock\n- passion fruit bun\n- butter croissant\n- kimchee toast\n", "Everything is super good!! ", "No wonder!"], "author": "Thancha N.", "review": "I have been to this place last year. I tried the ginger pull apart( I normally hate ginger and alway skip them) , they was ok.\n\nI heard a lot of compliments about this place, I decide to come back and try 6 different things\n- 2 ham& cheese morning bun\n- everything croissant \n- cinnamon almond bostock\n- passion fruit bun\n- butter croissant\n- kimchee toast\nEverything is super good!! No wonder!", "rating": 5, "date": "2016-11-09"}, {"excerpts": ["I tried other things such as the chocolate claw, cinnamon almond bostock, etc but these were the highlights. ", "I will for sure be back!"], "author": "Guilliana J.", "review": "I traveled far and wide just to be able to try this bakery... Well... Not that far... But still a good 45 min ride from across the city just so I could try the ham and cheese morning bun and see if this place was worth the hype. \n\nWe came here at 9am on a Thursday with only a few people in line. They don't have tartine lines, but make sure to get here before 10am so you could get the good stuff.\n\nHighlights: \n\nCroque Madame- I honestly have no words for this... This was absolutely amazing. It's basically a piece of sourdough with ham, cheese, caramelized onions and a soft poached egg on top. Eat this while it's hot: I would gladly travel from my humble abode in the Richmond district all the way to dogpatch if it meant I could get this again\n\nHam and Cheese morning bun- Smoked ham was too salty for me but the bun itself was flaky and buttery. \n\nPistachio blackberry twice baked croissant- Is that pistachio creme inside? Very good balance of flavors. Luckily it is sweet but not too sweet!\n\nGinger pull apart- Tastes like a butter croissant and has that burnt caramel taste (if that makes sense). Reminds me of monkey bread by the way you pull it apart.\n\nI tried other things such as the chocolate claw, cinnamon almond bostock, etc but these were the highlights. I will for sure be back!", "rating": 5, "date": "2016-08-18"}, {"excerpts": ["Favorites include:\nPassionfruit doughnut bun\nPistachio blackberry twice-baked croissant \nGinger pullapart \nCinnamon almond bostock"], "author": "I Fan L.", "review": "Some of the best pastries I've had. Favorites include:\nPassionfruit doughnut bun\nPistachio blackberry twice-baked croissant \nGinger pullapart \nCinnamon almond bostock", "rating": 5, "date": "2017-12-01"}, {"excerpts": ["The cinnamon almond bostock and twice baked pistachio ", "blackberry croissants are tied for 2nd place in my heart. ", "The only things I wished were different about Neighbor would be 1) bigger cups for lattes and 2) being open on Mondays and Tuesdays. ", "Nothing would make a Monday morning better than a giant latte and a pudding doughp bun."], "author": "Jenny L.", "review": "I work around here, so I'm glad that I can pop in during the latter half of the week when I'm needing a sweet morning fix without the line being as long as some other of the more celebrated bakeries in the city. I'm hesitant to write a review in fear of the line becoming longer, but I also love this place too much NOT to tell the world how good it is and the service is so speedy the line always goes quickly.\n\nTHE CHOCOLATE PUDDING DOUGHP BUN has enticed my taste buds time and time again. The outside layer is a perfect combination of chewy, crunchy, and sweet, while the inside is fluffy and light. All of a sudden, BAM. You get to the middle, to the main attraction.. The chocolate pudding. Tears of joy flow down your face and suddenly you feel like you truly can conquer the day's mundane yet exhausting tasks. Really. It's so amazing. If I were rich (and had a better workout regimen) I would eat one every morning.\n\nI'm also set out to try all of their other pastries, but of the ones I've had I prefer sweet to savory. The savory pastries are all delicious (shoutout to my fave, the ham and gruyere morning bun) but the sweet ones always come out on top for me. The cinnamon almond bostock and twice baked pistachio blackberry croissants are tied for 2nd place in my heart. The only things I wished were different about Neighbor would be 1) bigger cups for lattes and 2) being open on Mondays and Tuesdays. Nothing would make a Monday morning better than a giant latte and a pudding doughp bun.", "rating": 5, "date": "2016-08-30"}, {"excerpts": ["We ordered chocolate pudding bun, cinnamon almond bostock, ginger pull apart, butter croissant, chocolate chunk cookie, chocolate claw, chocolate pudding pie & chocolate croissant. ", "My family & I loved every single item we had ordered. ", "After we were done with breakfast, We went back in & got a few cinnamon almond bostock, ginger pull apart & cookies to go."], "author": "Halina N.", "review": "I have had this bakery bookmarked for over a year & I finally got a chance to go here for breakfast and I was NOT disappointed. We ordered chocolate pudding bun, cinnamon almond bostock, ginger pull apart, butter croissant, chocolate chunk cookie, chocolate claw, chocolate pudding pie & chocolate croissant. My family & I loved every single item we had ordered. After we were done with breakfast, We went back in & got a few cinnamon almond bostock, ginger pull apart & cookies to go.", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["The cinnamon almond bostock was light, melt-in-your-mouth, hint of cinnamon, perfection. "], "author": "Katie V.", "review": "Yes. Everything about this place is YES!!!! Before today I had never heard about a bostock.... but now my life has begun. The cinnamon almond bostock was light, melt-in-your-mouth, hint of cinnamon, perfection. I think it's the only time I've ever eaten a pastry slowly because I wanted it to last FOR-EV-ER (cue Sandlot clip). \n\nHonorable mentions go to the veggie tart & ginger pull-apart, which were fabulous. \n\nSure, there was a line all the way outside to order, but it was a 10 minute commitment that is 100% worth it. \n\nThe staff here are friendly, quirky, hard-working people. And they are great coffee baristas, too!!\n\nThe outdoor seating was kiddo and puppy friendly, and easy for groups of 4-6. Most groups shared tables easily with other groups. They have picnic tables that seat plenty and have a pretty quick turnover rate. \n\nPro Tip: Sit in the middle of the benches... as you'll get the teeter totter effect if you sit on the end of a bench without someone on the other end!!!", "rating": 5, "date": "2016-11-07"}], "brown butter hazelnut financier with candied orange peel": [], "guava and cream cheese pastelito": [{"excerpts": ["pistachio blackberry twice-baked (5/5) - would recommend this if you like berries\nviolet raspberry twice-baked (5/5) - also would recommend this if you like berries\nguava and cream cheese pastelito (5/5) ", "- have you ever had those guava & cream cheese strudels at Porto's Bakery? ", "if so, then it's almost the same. ", "would also recommend this\nchocolate claw (4/5) - this is pretty chocolatey, very similar to the chocolate croissants at Starbucks. "], "author": "Sylvia H.", "review": "i was in search for a new bakery shop so i decided to check this place out since it was recommended by someone. i came here on a saturday around10:45AM. i waited in line for about 20 minutes before i could place my order. i ended up ordering:\n\npistachio blackberry twice-baked (5/5) - would recommend this if you like berries\nviolet raspberry twice-baked (5/5) - also would recommend this if you like berries\nguava and cream cheese pastelito (5/5) - have you ever had those guava & cream cheese strudels at Porto's Bakery? if so, then it's almost the same. would also recommend this\nchocolate claw (4/5) - this is pretty chocolatey, very similar to the chocolate croissants at Starbucks. would recommend if you're a chocolate lover\neverything croissant (5/5) - this is like the everything bagel, but croissant. there's cream cheese inside the croissant\n\ni liked the pastries i ordered, but i'm sad that they ran out of the ham & cheese morning bun and the mushroom tart. i'll have to come back here at an early time!\n\nthere's an open seating area outside the shop for you to enjoy your pastries since it's a small bakery shop.", "rating": 5, "date": "2017-09-02"}, {"excerpts": [":\n- Guava and cream cheese pastelito \n- Cinnamon Almond Bostock\n\n"], "author": "Benson M.", "review": "Great bakers aren't born, they're bread. And Neighbor Bakehouse is no different especially when it comes to their fantastic team of bakers and pastry chefs. Needless to say, if you're ever in the Dogpatch area this is a MUST visit for all carb-lovers! They're great at turning your average stale day into a butter day! \n\nMy to go favorites:\n- Guava and cream cheese pastelito \n- Cinnamon Almond Bostock\n\nNote: Always remember to ask the staff about their favorites.", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["This last weekend I tried the guava and cream cheese pastelito for the first time. ", "I don't know if it beats Porto's in southern California, but it is a lovely norcal alternative. "], "author": "Richa B.", "review": "We are fans. What else can I say! We live outside the city, but make it a point to stop here every time we pass through San Francisco in the day time. Our favorites are the ginger pull apart (flaky, not too sweet, with a subtle ginger flavor), and my husband always gets the veggie tartine which is loaded with cheese and vegetables. He loves the latte there (I'm not a coffee drinker). We often get the mushroom tart and sauerkraut smoked cheddar peppadew tart which are both delicious. This last weekend I tried the guava and cream cheese pastelito for the first time. I don't know if it beats Porto's in southern California, but it is a lovely norcal alternative. We have passed on our recommendation to this place to lots of San Francisco visitors as we truly believe it is a gem. \n\nNote parking is not easy in this area and expect to circle around for a bit before you find a spot. Also the queue area and seating are both outside (inside is just the actual baking and cash counter), so be prepared for this if it's raining!", "rating": 5, "date": "2017-12-01"}, {"excerpts": ["so I ordered an Everything Croissant, the ham and cheese morning bun, the guava and cream cheese pastelito and small country loaf.  \n\n", "The Everything Croissant was good but was my least favorite of the items ", "purchased that day.  ", "I'm just not a fan of cream cheese in my croissant.  ", "Perhaps this was due to me not expecting it to be there.  ", "The guava and cream cheese pastelito was good ", "but I wish there had been a bit more of the guava.  ", "The pastry itself was really good "], "author": "Melissa L.", "review": "4.5 stars\n\nIs it worth the hype?  I would have to say that yes, it is.  I had been able to visit Arsicault the week prior to allow for a comparison as well.  It's a tough life in SF!  \n\nI ordered a sample of items to share and try.  They were out of plain croissants (WHAT!) so I ordered an Everything Croissant, the ham and cheese morning bun, the guava and cream cheese pastelito and small country loaf.  \n\nThe Everything Croissant was good but was my least favorite of the items purchased that day.  I'm just not a fan of cream cheese in my croissant.  Perhaps this was due to me not expecting it to be there.  The croissant itself was light and airy on the outside with a bit of chew on the inside.  \n\nThe savory morning bun was delicious.  For me it beats the the Rebel Within at Craftsman & Wolves.  Perhaps that is not a good comparison as they are not exactly alike (pastry vs. muffin) but in terms of a savory breakfast treat, this morning bun is it.  I even prefer this over the ham and cheese croissant at Arsicault.\n\nThe guava and cream cheese pastelito was good but I wish there had been a bit more of the guava.  The pastry itself was really good but we were looking for a higher ratio of filling to dough.\n\nThe country loaf was really good.  The crust was not to thick and had a bit of chew.  The interior was dense, moist, tender and hole-y.  I didn't find the loaf that sour at all.  We tried the bread with butter, cheese, pate and even avocado.  It was a great base when paired with other items or fine on its own. \n\nMy visit was on a Friday at 9:30 am.  On this day, parking looked to be a difficult as others have mentioned.  For the normally quiet period during the holiday week, I was hoping this area would be fairly deserted.  No chance.  I was luckily enough to find a spot at the end of the block, around the corner, without much difficulty.  On a weekday I would recommend coming with someone that can drop you off or look for parking while you hop out to pick up the pastries.  The lined moved fairly quickly and I don't think I waited more than 5 minutes, which allowed me ample time to peruse the menu and look to see what was available on the racks.  There is no place to sit inside as the space is allocated to the baking operations.  There are a few tables outside.\n\nI hear parking is much easier on the weekends but the lines are much longer.  Hopefully it won't take me another year to make a return trip!", "rating": 4, "date": "2017-01-07"}, {"excerpts": ["trout and cream cheese croissant - Yummmmmm \nGuava and cream cheese pastelito - Guava was not as strong as I hoped it'd be but still delish !"], "author": "Crystal N.", "review": "Best bakery I've yet to visit - we stayed at our friend's place this last weekend and were delighted to see that this bakery was just a couple blocks away ! We treated ourselves to a spread of yummies: \n\nPistachio blackberry twice-baked croissant - SUPER flaky and caramelized on the outside\nGinger pullapart - Typically ginger is very overpowering but it was subtle enough to be very enjoyable\nCinnamon almond bostock - My favorite of the bunch, my favorite flavors in a hefty bite\nChocolate pudding doughnut bun - Underwhelming but the amount of pudding does not disappoint!\nPassionfruit fruit coconut macaron - tropical colorful flavors together, delish !\nPassionfruit doughnut bun - my husband's favorite, the passionfruit was so strong !\nSmoked trout and cream cheese croissant - Yummmmmm \nGuava and cream cheese pastelito - Guava was not as strong as I hoped it'd be but still delish !", "rating": 5, "date": "2017-03-01"}, {"excerpts": ["Guava and Cream Cheese Pastelito:\n", "Really good, I loved the guava filling, it really reminded me a lot of Portos.  "], "author": "Bryson L.", "review": "Stumbled across this place while exploring the Dogpatch.  This place is hands down the bakery to visit in San Francisco!  Everything they touch turns to golden flaky pastries or fantastically baked breads.  What's even better too is that this place isn't plagued with ridiculously long lines or immediately selling out of everything they have.  That being said, some of their items do sell out quickly but they'll usually have something interesting in stock for you if you're not particular about a specific thing.  I'll have to make more trips back here to pick up more of their amazing delights, but here's what I've had so far.\n\nEverything Croissant:\nI don't even like croissants, but I loved this thing.  Super flavorful with both the toppings, fillings, and croissant itself.  Really nice savory pastry.\n\nGuava and Cream Cheese Pastelito:\nReally good, I loved the guava filling, it really reminded me a lot of Portos.  The pastry itself is flaky and perfect in every way.  \n\nPassionfruit Dough Bun:\nAmazing donut that's been perfectly baked and goes really well with their passionfruit filling.  It tastes a lot like Hawaiian Passionfruit (lilikoi) butter so it's definitely richer than your standard jelly.  \n\nPistachio Blackberry Twice Baked:\nOnce again, don't like croissants, but this one haunts me with it's amazing flavor.  It's astounding that the croissant stays so flaky despite the jam on the inside.  The pistachios go really well with the blackberry too.  No blackberry seeds either which is a nice plus!", "rating": 5, "date": "2016-10-27"}, {"excerpts": ["but having just finished a ginormous slice of their toothsome kimchi toast and somehow also consumed their perfect guava and cream cheese pastelito, i am glad i never reviewed them. "], "author": "Archana P.", "review": "it's been over a year (maybe two) since i had my first taste of the decadent deliciousness that is neighbor bakehouse and i'm actually quite surprised to realize i never reviewed it in all this time. but having just finished a ginormous slice of their toothsome kimchi toast and somehow also consumed their perfect guava and cream cheese pastelito, i am glad i never reviewed them. because now i can happily report that neighbor bakehouse is one of those remarkable eating establishments that has only become better since i first tried it. \n\nother amazeball items include their everything croissant (f-ing genius!), the mushroom MANCHEGO tart, the sauerkraut peppadew tart, and their absolutely flawless nitro cold brew. seriously the coffee is incredible, i am a cream and sugar girl but with this magical drink, its somehow not necessary. so smooth, so creamy, so wow.\n\ni cannot recommend this place enough. and i don't have to. five stars in SF? come on now!", "rating": 5, "date": "2017-02-12"}], "mushroom green onion tart": [{"excerpts": ["+ smoked fish cream cheese croissant - $4.25\n+ mushroom green onion tart - $4.00\n", "+ ", "pistachio blackberry "], "author": "Laverne N.", "review": "I love unexpectedly discovering amazing places! \n\nSarah K. and I stumbled upon Neighbor Bakehouse while we were looking for a place to kill some time before our brunch reservation. We've always talked about checking out some SF bakeries one day like Tartine so it was such a coincidence that Neighbor Bakehouse is ex-Tartine's Greg Mindel's (which I found out just now thanks to Yelpers). \n\nI couldn't help but get a lot of stuff to sample, aka take a few bites and 'gift' the rest to my housemates, heh. \n\n+ smoked fish cream cheese croissant - $4.25\n+ mushroom green onion tart - $4.00\n+ pistachio blackberry twice baked croissant - $4.25\n+ apple cinnamon hand pie - $3.75\n\nMy favorite was the pistachio croissant which was perfectly flakey with just the right hint of flavors. Mmm, delicious. \n\nSo so so many goodies here - I want to try them all!", "rating": 5, "date": "2017-02-17"}], "seasonal vegetable tart": [], "sauerkraut tart": [{"excerpts": ["The Sauerkraut Tart was a tad spicy and had a nice smoky flavor. ", "I loved he Chocolate Pudding Pie! ", "It was decadent and creamy. ", "I was not a fan of the crust as it was a bit hard ", "and I couldn't cut it with a fork. ", "I also wish it was served colder. "], "author": "Alice L.", "review": "We were here on a Sunday at around 10:45am and the line was already out the door. It only got longer as time went by!\n\nWe ordered a Mushroom Tart ($4.50), a Sauerkraut Smoked Cheddar Peppadew Tart ($4.50), a slice of Chocolate Pudding Pie ($7.00), a small baguette, and 2 Drip Coffees. \n\nMushroom Tart had a nice layers of pastry crust. The Sauerkraut Tart was a tad spicy and had a nice smoky flavor. I loved he Chocolate Pudding Pie! It was decadent and creamy. I was not a fan of the crust as it was a bit hard and I couldn't cut it with a fork. I also wish it was served colder. The baguette was pretty good with a nice shell and chewy inside. \n\nOutside seating was nice and my dog also enjoyed this place! I'm looking forward to coming back here to try their Fruit Tart! We were not early enough this time!", "rating": 4, "date": "2018-04-01"}, {"excerpts": ["Ham and cheese morning bun is great, the curried potato is great, even the sauerkraut tart was an absolute delight. \n\n"], "author": "Valentin G.", "review": "This place needs to stop. Just stop; at the rate I'm going to be broke by the end of the month. I just moved to the dog patch ~2 months ago and we were fortunate enough to discover this place early on. What an absolute treat. Their baked goods are incredible; that includes the the sweet, savory and take home size loads. \n\nSweet - The Ginger Pull Apart is my hands down favorite. Sweet, slightly crunchy on the outside, incredibly moist on the inside. Can't go wrong.\n\nSavory - I've had a lot of their savory recipes, all good. Ham and cheese morning bun is great, the curried potato is great, even the sauerkraut tart was an absolute delight. \n\nLoafs- we get a loaf of ciabatta a week. It usually doesn't last more than 2 days. It's that good. \n\nThey sell out daily by early afternoon. Also - though they open at at 6:30, they don't always have everything baked and ready for purchase right when they open - something to keep in mind (small space not a lot of ovens etc).\n\nEnjoy!", "rating": 5, "date": "2018-04-04"}, {"excerpts": ["We got the sauerkraut tart, smoked fish croissant, pistachio blackberry twice baked, and BF really wanted to bring the potato and chorizo tart with him to work. ", "Sauerkraut tart: really good! ", "I was apprehensive that this would have an overwhelming sauerkraut taste, which I don't mind, but it didn't at all. ", "It's also very substantial so "], "author": "Noelle H.", "review": "FIVE STARS!!!\n\nI've had Neighbor Bakehouse bookmarked for FOREVER, but I knew I would never make it to this area in the mornings since it's so out of the way from where I live. \n\nBut then the stars aligned and it happened. I had to drop the BF off for work at 7am, so we got up earlier so we could swing by and grab a few items for breakfast....AT 6:30AM. \n\nI honestly thought it wouldn't be busy since it was so early, WRONG. After we ordered, there was a line out the door! \n\nEverything sounded delicious, but I decided to narrow our items to 4 pastries. Unfortunately, some of the items weren't ready yet (really wanted to try the mushroom tart!) \n\nWe got the sauerkraut tart, smoked fish croissant, pistachio blackberry twice baked, and BF really wanted to bring the potato and chorizo tart with him to work. He also got a cold brew coffee. \n\nThe good thing about coming right when they open is that everything is warm and fresh!! \n\nSauerkraut tart: really good! I was apprehensive that this would have an overwhelming sauerkraut taste, which I don't mind, but it didn't at all. It's also very substantial so 1 would be perfect for a quick breakfast! \n\nSmoked fish croissant: the croissant comes covered with sesame seeds which I enjoyed. Its very flaky and light, and the smoked fish with cream cheese wasn't overpowering for the morning. However, I think this was my least favorite (not that it wasn't good, I just thought this one didn't shine like the rest) \n\nPistachio blackberry twice baked: THIS IS WHAT DREAMS ARE MADE OF. SOOOOO GOOOOOOOOD. We didn't eat this till a lot later in the day, and it was amazing, so I can imagine eating it fresh out of the oven would be an out of body experience. MUST GET. \n\nPotato chorizo tart: I had a small bite. It was good! Hefty. But BF ate the rest of it for a late breakfast and said it was just as good cold. He really enjoyed it. \n\nThe cold brew was actually nitro coffee, which was good. \n\nService was friendly and quick! \n\nIf you're in the area and can get here early, this is a must visit to get your carb fix!!!", "rating": 5, "date": "2017-05-12"}, {"excerpts": ["Kimchi Sauerkraut Tart (4/5) - ", "Bread was buttery and amazing", ", kimchi could be spicier, cheese wasn't really necessary. "], "author": "Truc N.", "review": "Came for brunch, we grabbed 4 pastries (2 savory, 2 sweet) and 2 coffees ended up being only $22! Not bad for SF brunch, considering a meal for one consisting of mediocre eggs could be the same. On the pastry quality alone it's between a 4 and 5 but rounding up. I don't like overly sweet desserts so, the pastries are the perfect level of slight sugariness, layers of flour and butter - clearly fresh and made with high quality ingredients.\n\nWas it among the best pastries I've had? No, not mindblowingly good, but still pretty damn good. I'd say top tier for SF and very reasonable for the price. Neighbor Bakehouse is way better than Tartine, but the craftsmanship level is not as high as b. patisserie, nor are the pastries as delicate. The best part is it's not crowded, but that'll probably change. Outdoor seating, bus your own tables, lemon and lime water at the station.\n\nWe sampled a few of these\nOrange Hazelnut Financier (3/5) - Soft crumb cake like and fairly uniform texture throughout. Interesting flavor, with bits of candied orange.\nGinger Pull Apart Bread (4/5) - Subtle cinnamon sugar and ginger, some pieces are drier and flaky, some pieces are layers of softer, buttery dough, but one of my favorite parts is how the bottom gets slightly chewy and hardened caramelized crust piece.\nHam and Cheese Morning Bun (3.5/5) - The cheese congealed into a big chunk around the center, sliced ham also lay in a swirl in between the outer part and inner. Sunflower and poppy seeds line the outside.\nKimchi Sauerkraut Tart (4/5) - Bread was buttery and amazing, kimchi could be spicier, cheese wasn't really necessary. I found that much more filling than the morning bun.\n\nI've also had the\nTwice Baked Pistachio Blueberry Croissant (4.5/5) - Really good and where the technique shows. The almond paste is filled inside and caked on the outside forming a gooey layer on top of a flaky croissant. A little one the dry side due to the twice-baked ness. Dusted with powdered sugar.", "rating": 5, "date": "2016-07-30"}, {"excerpts": ["SAUERKRAUT TART (4.5/5)\n", "This was recommended by one of the worker ", "and it's one of of my top favorite now too. ", "It's crunchy and buttery. ", "I love pastries with multi flavors and this hits the spot with sourness from the filling and the savorness from the baked cheese. "], "author": "Grace Z.", "review": "Wow this place is so far my favorite bakery in San Francisco!! Can they teach me how to bake like that???\nI still have yet to try Mr. Holmes (not down for the early wait in line), but so far this place is hard to beat!\nI first had their Everything Crossiant at another cafe and it blew me away. I had to come to the OG location, so I drove to this place at 10am on a Saturday. There was a line out the door, but it went by quickly with 10 people ahead of me. I hate waiting in line in the cold, but the croissants were calling me and I couldn't say no.\nI got a box of 6 pastries and in my box I had:\n\nEVERYTHING CROISSANT (5/5)\nHands.down.best.sh*t.ever.just.get.it.dont.question.me.\nThis croissant was flak y and crunchy (from the poppy seeds), yet soft and fluffy on the inside. Love love love the cream cheese filling inside. Sounds so simple yet it blew my mind everytime I take a bite. My sister was sneaking bites and practically devoured 1/3 of it when I wasn't looking. It's that seriously that good.\n\nSAUERKRAUT TART (4.5/5)\nThis was recommended by one of the worker and it's one of of my top favorite now too. It's crunchy and buttery. I love pastries with multi flavors and this hits the spot with sourness from the filling and the savorness from the baked cheese. Reminds me of those savory bread from a Chinese bakery, but with an updated bread base.\n\nPISTACHIO BLACKBERRY TWICE BAKED (4.5/5)\nThis is my sister's all time favorite (still like the everything croissant better). I didn't know pistachio can be incorporated like this in a croissant! The pistachio was creamy and it mixed so well with the flaky soft texture of the croissant. Sadly my sister devoured it before I get a piece of it with the blackberry.\n\nHAM AND CHEESE MORNING BUN (3/5)\nHonestly I got this one because it was pretty. Maybe because I ate it hours after I got it so it wasn't super fresh, but it was medicore. Don't get me wrong it was good, but compared to the other amazing pastries they had it just didn't stand out.\n\nPASSION FRUIT DOUGHP BUN (4/5)\nYum yum yum. The passion fruit filling was refreshing after eating all of the savory carbs. It wasn't too overwhelming like I expected and compliments the breading around the cream.\n\nGERMAN COFFEE CAKE (4/5)\nAnother refreshing treat after eating the savory pastries. Don't remember exactly the taste of it, but it wasn't disappointing either.\n\nOverall everything was bomb.com and everyone needs to come here. The end.", "rating": 5, "date": "2016-09-15"}, {"excerpts": ["They also have a wonderful sauerkraut tart and rotating veggie tarts that perfectly balance savory ingredients with a sweet dough. "], "author": "Sean S.", "review": "Where do I begin with this place? I know - stop whatever you're doing, get in a car, über, or the T line muni, arrive at Neighbor and buy the ginger pull apart. This is my favorite pastry of all time. Why? It's a myriad of textures and flavors that evoke all the best aspects of perfect baked goods. The pastry is composed of croissant dough scraps pieced together and layered with sugar and crystallized ginger. Its got a bit of that super on trend kouign Amman swagger with twice the size and twice the textural variance. The top is light and airy like those awesome bubbles that form on the crust of a pizza. Inside it's doughy and soft, like the inner layers of a cinnamon roll or raised donut. The bottom gets a crazy crystalized sugar caramelization that sticks to your teeth like ginger taffy. The aroma is buttery with dancing ginger spice and is never too sweet or too spicy. It is perfection. \n\nAnd that's just one pastry!!\n\nNeighbor doesn't get the shine of some of the hipper spots in the city but it deserves all the glory. Their croissants are perfect, and I've tried them all from plain to chocolate (claw) to everything (bagel) to salmon to blackberry pistachio. Flawless layers of fluffy flour and butter. They also have a wonderful sauerkraut tart and rotating veggie tarts that perfectly balance savory ingredients with a sweet dough. I have literally tried almost every thing this shop has to offer and have never been disappointed. \n\nThey also offer whole loaves of bread, and recently I picked up a fresh sourdough sandwich loaf ($6) and made the best French toast of my life with it. Go to neighbor. You won't regret it. \n\nNote: normally a spot that offers little-to-no seating would get a slight dock in my book but I'm in the \"pick up pastries in my PJ's and bring them home\" camp rather than try to deal with the early morning dog patch fog camp.", "rating": 5, "date": "2016-07-31"}, {"excerpts": ["Favorites are the Sauerkraut Tart (yes, you heard right), Everything Croissant, Mushroom Tart, Ham and Cheese Bun, and Bostock. ", "Their Bostock is something else. ", "Probably the best one I've had in the Bay Area, or anywhere else.  ", "Sometimes, you may find something not on the menu, such as the scrumptious, savory bread pudding "], "author": "CE Y.", "review": "The Neighbor Bakehouse offers some excellent and delicious pastries. Mainly open in the mornings, you'll find croissants and tarts for breakfast. Plus other goodies to satisfy for later in the day.  The flavor combinations are unique and frankly, addictive. Yes, a person can be addicted to baked goods. I will find myself calculating when my next trip there will be. The sweeter baked items are just as delicious. Favorites are the Sauerkraut Tart (yes, you heard right), Everything Croissant, Mushroom Tart, Ham and Cheese Bun, and Bostock. Their Bostock is something else. Probably the best one I've had in the Bay Area, or anywhere else.  Sometimes, you may find something not on the menu, such as the scrumptious, savory bread pudding I had one Wednesday. \n\nI remember first trying one of their sauerkraut concoctions maybe 5 years ago, during an event in Dogpatch. There was no storefront, just a table setup. I think it was Greg Mindel, the founder, who was there listing off what each item was for us.  When it comes to baked goods, sauerkraut doesn't top my list of favored ingredients. But after tasting it, it just worked. Fast forward to this year, I recalled that experience and remembered the name Neighbor. Thanks to a quick internet search, I happily discovered they opened a retail shop. Which, is also their wholesale bakery, I believe. \n\nThey aren't open everyday, usually only from\nWednesday through Sunday.  The hours are early morning through noonish.  Sometimes they may close unexpectedly, so check their website or FB page, before heading there if possible. Don't become as distraught as I was when I arrived to find them closed one day, when I forgot to check their hours. There are some picnic tables set up outside, but no seating inside. \n\nThis bakery is definitely out of my neighborhood, but when I get a chance to detour here, I pick up some of their various offerings. Just enough to share and last a few days. Heated up the next day, they beat most of the pastries I find around the city.  Looking forward to seeing what will be in store next...", "rating": 5, "date": "2015-06-05"}, {"excerpts": ["The ham and cheese were really good, and I wish there were more inside\n- Sauerkraut tart: I like sauerkraut, and I like cheese, but maybe not the two together? ", "The tart base held up well and had good flavor, but the red peppers and sauerkraut were a little too tart and sort of abrasive?  "], "author": "Marilyn T.", "review": "I wish they had longer hours, but it is nice that they only sell things when they're fresh out of the oven!  You order things as they're still sitting on the cooling racks.  \n\nLuckily, the line was only a few people deep at 8am on a Wednesday, and they do have coffee and tea.\n\nMost things are viennoiserie based. I clearly had a hard time choosing, so I got almost one of everything...\n\n- Butter croissant: it was a little less flaky than I was hoping for, but it looked beautiful, and I was eating it over 12 hours after it came out of the oven. It had just the right amount of sweetness and saltiness\n- Chocolate claw: kind of like a chocolate croissant\n- Pistachio twice baked croissant: I did not expect for a hint of marzipan (maybe honey pistachio paste?), but I loved itt. The crust on top reminds me of Chinese \"pineapple buns\", and the filling has blueberry to add some fruitiness without making it too sweet or tart. It sounded like a weird combination for a croissant but probably ended up being my favorite sweet thing\n- Everything croissant: a savory croissant with a topping that's like an \"everything bagel.\" It added lots of textures and flavors and was an interesting take on the croissant - I think I liked this more than the regular one\n- Mushroom tart: another wonderful savory pastry. There was a lot of mushroom, and the slightly sweet tart base was a nice contrast to the cheese and woody mushrooms. This was probably my favorite savory item\n- Ham and cheese morning bun: kind of like a ham and cheese croissant but better. The bun itself had the right amount of doughy sweetness without being actually sweet, and the nuts and seeds on top (similar to the everything croissant) added more texture. The ham and cheese were really good, and I wish there were more inside\n- Sauerkraut tart: I like sauerkraut, and I like cheese, but maybe not the two together? The tart base held up well and had good flavor, but the red peppers and sauerkraut were a little too tart and sort of abrasive?  Otherwise, the baked cheese topping was nice\n\nOK so maybe I went a little overboard with the ordering, but everything just looked so beautiful!  Each pasty is $3-4ish, but they're quite large, so it's nice to get a bunch and share with people. If you don't consume it immediately, everything is good if you re-heat it a bit in the oven.\n\nThere are parking spots out front, but those are reserved for the company next door, so you'll have to find street parking.  Previously, it was cash only, but they take credit card now!  This is definitely going to be a go to/destination bakery for me.", "rating": 5, "date": "2015-04-23"}, {"excerpts": ["My husband had the sauerkraut tart (sour cabbage + cheese) and he said it was very good. ", "I was going to get another chocolate claw but rather got chocolate bun which was good too ", "but nothing compared to chocolate claw. ", "It had nutella type of thing in it. ", "Will definitely come back! ", "Yikilanziii"], "author": "Merve A.", "review": "Chocolate claw (croissant) soo goooodd! My husband had the sauerkraut tart (sour cabbage + cheese) and he said it was very good. I was going to get another chocolate claw but rather got chocolate bun which was good too but nothing compared to chocolate claw. It had nutella type of thing in it. Will definitely come back! Yikilanziii", "rating": 5, "date": "2015-08-01"}, {"excerpts": ["Sauerkraut tart, with its hint of smoky flavor, was universally loved by our party of 6.  ", "Ginger pull-apart was decadent.  ", "Excellent selection of savory pastries.  ", "Croque Madame was extraordinarily satisfactory in texture."], "author": "Carolyn S.", "review": "Sauerkraut tart, with its hint of smoky flavor, was universally loved by our party of 6.  Ginger pull-apart was decadent.  Excellent selection of savory pastries.  Croque Madame was extraordinarily satisfactory in texture.", "rating": 5, "date": "2015-09-06"}], "smoked ham and cheese morning bun": []}