{"house pan fried noodle": [], "pan fried noodle": [{"excerpts": ["My boyfriend ordered a pan fried noodle and that was delicious! ", "But after our meal, we had to flag someone down for a check again. ", "And we get charged three tea's and only two of my friends ordered that. ", "I explained that to the server ", "and he tried to convince me that they charge that per person when I didn't even have a cup of tea. ", "It took them 5 minutes to finally just take off a tea that was $1.75 and overall the service was just horrible. ", "That was the worst experience I had in all of San Fransisco. ", "My friend didn't want to tip because he didn't feel like his or any of our experience were good in any way. ", "I work at a restaurant myself ", "and I've always understood the importance of not just tip, but the importance of service. ", "People tip because they feel like they were served well", ", they don't need to feel forced to. ", "My friend signed the bill and she stopped him and said tip!!! ", "You forgot tip! ", "And he personally didn't want to. ", "She goes ahead and says \"you have to tip $5\" forcing my friend to leave a tip! ", "What kind of disaster!!! ", "I said \"he actually can tip what he wants\" and he tipped upon force! ", "I do not recommend this place at all."], "author": "Maria H.", "review": "Some friends and I (total of three of us) are visiting from Los Angeles and strolled through China Town and came across this restaurant. The restaurant setting seems like a banquet hall, and a place that looks like events are held there. The table had a pot of tea, and you assume it's complimentary. We were seated, and we waited over ten minutes and no one came to greet us or start us off. We had to flag people down, we basically did throughout our entire time there. We had to stop someone to take an order, and no one cared to come to the table. I ordered a chicken fried rice & it was decent. My boyfriend ordered a pan fried noodle and that was delicious! But after our meal, we had to flag someone down for a check again. And we get charged three tea's and only two of my friends ordered that. I explained that to the server and he tried to convince me that they charge that per person when I didn't even have a cup of tea. It took them 5 minutes to finally just take off a tea that was $1.75 and overall the service was just horrible. That was the worst experience I had in all of San Fransisco. My friend didn't want to tip because he didn't feel like his or any of our experience were good in any way. I work at a restaurant myself and I've always understood the importance of not just tip, but the importance of service. People tip because they feel like they were served well, they don't need to feel forced to. My friend signed the bill and she stopped him and said tip!!! You forgot tip! And he personally didn't want to. She goes ahead and says \"you have to tip $5\" forcing my friend to leave a tip! What kind of disaster!!! I said \"he actually can tip what he wants\" and he tipped upon force! I do not recommend this place at all.", "rating": 1, "date": "2016-09-06"}], "pa fried boodle": [], "dried scallop": [], "black mushroom  green yee mein": [], "braised yee mein in xo sauce": [], "combination over rice": [], "minced beef over fried rice": [], "ying yang fried rice": [], "minced chicken  salted fish fried rice": [], "thai style rice vermicelli": [], "chow kwai du malaysian style": [], "braised vermicelli": [], "golden egg": [], "yang chow fried rice": [], "fook ken style fried rice": [], "dry scallop  seafood fried rice": []}