{"bottled water": [{"excerpts": ["Slice of mushroom and a bottled water please!", "\" ", "Order is up in less than 30 seconds, and I'm in post drinking meal heaven. ", "However, I tasted more crust than sauce in their pizza, which means 1 star short of 4."], "author": "Rhia R.", "review": "For some reason, I always get the munchies after drinking. The trek back and forth from Buckshot built up my appetite. So at about 1:30, I tell my girls we should bounce because I wanted a slice from Nizario's next door (they close at 2am). So we flee Buckshot with the quickness and I go in to place my order. \"Slice of mushroom and a bottled water please!\" Order is up in less than 30 seconds, and I'm in post drinking meal heaven. However, I tasted more crust than sauce in their pizza, which means 1 star short of 4.", "rating": 3, "date": "2008-08-30"}, {"excerpts": ["Anytime you can get full from $6 worth of food and drink (the cost of my two pepperoni slices and a bottled water) you can't really complain."], "author": "Alex C.", "review": "I have friends that rave about this place, so I knew I had to try it eventually. It was not quite as good as I had expected, but the price makes up for a lot. Anytime you can get full from $6 worth of food and drink (the cost of my two pepperoni slices and a bottled water) you can't really complain.", "rating": 3, "date": "2006-05-23"}], "cheesy garlic bread": [{"excerpts": ["Their cheesy garlic bread is also delicious. ", "Their menu is pretty straightforward: pizzas, garlic bread, wings, and salad. "], "author": "Liz G.", "review": "This is my favorite pizza to order-in when we're deciding to relax at home. \n\nNizario's does a regular crust on their pizzas (not too thin or too thick, my favorite) and I find that their toppings are good for a regular pizza joint. I usually order a plain cheese or pesto pizza. Their pesto pizza is awesome and is highly recommended by me. You wouldn't be reading my review if you didn't trust me, so take my word for it! Their cheesy garlic bread is also delicious. Their menu is pretty straightforward: pizzas, garlic bread, wings, and salad. They don't dabble in sub sandwiches or pasta, so you know the focus is going to be on their other dishes.\n\nWe order in from here 90% of the time, and orders are quick and delivery folks are nice, especially when they have to walk up three flights of stairs to get to us (thanks guys!). You can also pickup your pizza or stop by for slices (especially recommended if you're next door at Buckshot and need a munchie).", "rating": 4, "date": "2015-07-28"}], "buffalo wings": [{"excerpts": ["I also had a huge craving for buffalo wings ", "so I asked the dude how many is in an order. ", "Guy informs me 6, 12 and whatever else he said after 12. ", "I didn't really pay attention cause my fat-ass shouldn't even be considering eating more that 12 wings before a Medium Pizza. ", "Dude then tells me that a 6 piece was like $8 and a 12 piece was something like $14 or $15. ", "That's when I almost choked from my own saliva. ", "I said $15 for 12 wings. ", "Who in there right mind would pay $25 for a small pizza and 12 buffalo wings? ", "Duh...", "Me...the Sucka!!! ", "Maybe I'm use to going to Ceasar' or Domino's where they have 2 large pizza for like $10? ", "The pizza at Nizario's sucked bad. "], "author": "Larry B.", "review": "Two words to describe my feelings about Nizario's Pizza.....HEEEEELLLLLL NOOOOOOO!!! Actually let me make it three words for the full affect.....AAAAWEEEEE HEEEEELLLLLL NOOOOOO! \n\nListen, I'm from the east coast and know about pizza. This place is ridiculous overpriced for the quality of food that they're serving. \n\nLet me break it down to ya Flava Flav...\"Yeaaaa Boooooyyyyy!!! I began to order a Medium 1/2 Hawaiian & 1/2 Nizarios Special, which is basically Pepperoni, Sausage, Red Onion, Mushrooms & Bell Peppers. \n\nI also had a huge craving for buffalo wings so I asked the dude how many is in an order. Guy informs me 6, 12 and whatever else he said after 12. I didn't really pay attention cause my fat-ass shouldn't even be considering eating more that 12 wings before a Medium Pizza. Dude then tells me that a 6 piece was like $8 and a 12 piece was something like $14 or $15. That's when I almost choked from my own saliva. I said $15 for 12 wings. Holy Sh$#!!! \n\nSo, my lack of a brain tried to calculate which would be cheaper...Ordering the 12 wings for $15 and getting a Small pizza OOOORRRR....ordering 6 wings and getting the medium pizza. My Mozaltof Ass wanted the wings more that the pizza so I decided to go for the 12 wings and a small pizza thinking that that would at least save me some big cash. How wrong was I! \n\nVinnie rings it up and say...$25.68. Holy Sh$#!!!! If my old fashion Asian Grandfather was still alive and he saw me order this overpriced pizza and actually paid for it, he would have taken a couple of fortune cookies from his restaurant and cracked it over my head. \n\nWTF!!! Who in there right mind would pay $25 for a small pizza and 12 buffalo wings? Duh...Me...the Sucka!!! Maybe I'm use to going to Ceasar' or Domino's where they have 2 large pizza for like $10? The pizza at Nizario's sucked bad. Crust was not crunchy and the pizza was just okay. \n\nListen my fellow Yelpers...Pizza should never cost a lot and you shouldn't pay that much either.... Unless....you're at a high end Italian restaurant where the ingredients are top notch and your date is either a super model with fake boobies or a Dude that has a big penis and drives a Ferrari oh....AND... will let you take it for a spin by yourself every now and then. \n\nI will never pay this much...Never Again!! Not from a damn pizza joint, using questionable ingredients, that sits right next to some dumb ass bar that has all the drunk idiots coming over to eat the crap cause they couldn't tell the difference between there ass and a good slice. \n\nWhoever gave this place 4 stars or higher is either Rich or Drunk! Or...maybe Drunkenly Rich! In either case, people who gave this place a good rating (you know who you are) should def have not taken all those shots of Tequila. Sober up, get into your BMW or hop onto your Vespa and go to New York or Boston for some cheaper...Kick-Ass Pizza! \n\nSorry for the ranging rants about this place yelpers. I had to do what I had to do cause I think my Grandfather was giving me the evil eyeball from heaven.", "rating": 1, "date": "2010-08-09"}], "side of ranch sauce": [], "greek salad": [], "garlic chicken special pizza": [{"excerpts": ["*Garlic chicken special pizza ($14.48 small): garlic, chicken, pesto\nMy pick. ", "The garlic could have been roasted a little more as it was a little harsh. ", "But I liked the thinner crust on this pizza. "], "author": "Elena N.", "review": "3.5 STARS\n\nI've had Nizario's many times throughout the years. After drinking at the former Alpha, I'd stop by for a slice to soak up all the booze.\n\nLast Friday, July 3rd, I got home a little late. Around 10pm. The roommate and I were lazy so we ordered pizza for delivery through Eat24. Nothing like pizza as a late night dinner option.\n\n*Chicken wings ($6.50): 6 baked wings with ranch\nWe got 2 orders as 6 wings is never enough for 2 people to share. Tasted like standard chicken wings. Reminded me of the frozen kind from Costco (which I like). It fulfilled my wing craving.\n\n*Cheese garlic bread ($4.50): 8\" loaf cut in half with garlic-spread and cheese on both sides\nSome subtle garlic flavor. Nice amount of cheese.\n\n*Nizario's special pizza ($20 medium): pepperoni, sausage, mushrooms, red onions, bell peppers\nThis was the roommate's pick. I liked the toppings, but I found the crust to be way too thick and bready.\n\n*Garlic chicken special pizza ($14.48 small): garlic, chicken, pesto\nMy pick. The garlic could have been roasted a little more as it was a little harsh. But I liked the thinner crust on this pizza. The chicken and pesto had great flavor.\n\nGood late night pizza delivery option. I remember loving their pesto and pepperoni slices back in the day. 3.5 stars rounded up to 4.", "rating": 4, "date": "2015-07-06"}], "pepperoni pizza": [{"excerpts": ["I asked for a large 16\" pepperoni pizza, which is 10 slices.  ", "Medium 14\" is 8 slices.  ", "He had one in a box ready to go ", "so I asked if it were fresh since I didn't have to wait.  ", "I specifically asked if this was a large pizza and he said yes.  ", "I found out he gave me a medium.  ", "I think he just wanted to get rid of his medium pepperoni pizza in the box.  ", "When the customer asks for a large, just do the right thing and make a large pizza, even if it takes longer.  ", "Don't sell a medium and say it's a large.  ", "That makes your store look shady."], "author": "K M.", "review": "Shady store.  I asked for a large 16\" pepperoni pizza, which is 10 slices.  Medium 14\" is 8 slices.  He had one in a box ready to go so I asked if it were fresh since I didn't have to wait.  I specifically asked if this was a large pizza and he said yes.  I found out he gave me a medium.  I think he just wanted to get rid of his medium pepperoni pizza in the box.  When the customer asks for a large, just do the right thing and make a large pizza, even if it takes longer.  Don't sell a medium and say it's a large.  That makes your store look shady.", "rating": 1, "date": "2018-10-28"}, {"excerpts": ["The mushroom, pepperoni pizza is the best with ranch! ", "Go here when you're turnt and hungry ", "but also if you're not I promise you won't be let down!"], "author": "Shaanel B.", "review": "I love Nizarios! It's by far the best pizza in sf! The mushroom, pepperoni pizza is the best with ranch! Go here when you're turnt and hungry but also if you're not I promise you won't be let down!", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["Plus the fact that FINALLY they have an option to straight up buy a Pepperoni Pizza! ", "Yasss!!! ", "Quality sucks tho so just expect a basic a*", "** pizza. ", "It gets the job done though! ", "Have been in-person once and there was a line ", "but it was during USF's senior bar hop ", "so it was all good. ", "Crap quality but convenience and proximity to the bar were perfect."], "author": "Rose E.", "review": "Only reason why i'm giving 5 stars is due to price and speed and their hours which are all amazing. The quality is meh but I love that my late night cravings over the years plus their low cost has fulfilled my pizza cravings. Plus the fact that FINALLY they have an option to straight up buy a Pepperoni Pizza! Yasss!!! Quality sucks tho so just expect a basic a*** pizza. It gets the job done though! Have been in-person once and there was a line but it was during USF's senior bar hop so it was all good. Crap quality but convenience and proximity to the bar were perfect.", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["Came out in just a few minutes and it tasted like pepperoni pizza. ", "Not much else to say about it. ", "Seemed like a reliable joint and it was cheap too. ", "Gonna definitely keep it in mind if I'm in the area."], "author": "Sean H.", "review": "Just a quick A-OK slice of pizza. Came out in just a few minutes and it tasted like pepperoni pizza. Not much else to say about it. Seemed like a reliable joint and it was cheap too. Gonna definitely keep it in mind if I'm in the area.", "rating": 3, "date": "2015-07-08"}, {"excerpts": ["My boyfriend and I shared a slice of pepperoni pizza and it was one of the best slices I've had in the city. ", "I'm no pizza snob, but I do, however, know when a slice of pizza is great and Nizario's has some really great pizza!"], "author": "Joyce E.", "review": "After having an underwhelming experience at the North Beach location, I told myself that I probably wouldn't step foot into another Nizario's location again. a couple of years later, my boyfriend was craving pizza while I was at Little Sweet next door, so Nizario's it was. The employees at Nizario's are really friendly and absolutely great as they make you feel like you're a longtime friend immediately as you step in. Nizario's space is very modest, but they have enough seats if you want to grab something quick. My boyfriend and I shared a slice of pepperoni pizza and it was one of the best slices I've had in the city. I'm no pizza snob, but I do, however, know when a slice of pizza is great and Nizario's has some really great pizza!", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["The ingredients are good and the pepperoni pizza was baked just right in my opinion. ", "Gooey cheese and a nice crunchy crust! ", "The staff was also very friendly which always makes the experience more enjoyable. ", "Overall a decent place at a decent price. ", "I will be back soon."], "author": "Idean M.", "review": "I just moved in to the area and thought I might go check out one of the pizza places nearby.\n\nThis place did not disappoint. The ingredients are good and the pepperoni pizza was baked just right in my opinion. Gooey cheese and a nice crunchy crust! The staff was also very friendly which always makes the experience more enjoyable. Overall a decent place at a decent price. I will be back soon.", "rating": 4, "date": "2015-02-26"}, {"excerpts": ["Got the pepperoni pizza. ", "Pretty decent price, the cheese and sauce was good. ", "Didn't like the pizza dough too much, it was thick and doughie. ", "I prefer NY style, aka escape from NY."], "author": "Vanessa K.", "review": "Got the pepperoni pizza. Pretty decent price, the cheese and sauce was good. Didn't like the pizza dough too much, it was thick and doughie. I prefer NY style, aka escape from NY.", "rating": 3, "date": "2011-11-25"}, {"excerpts": ["Big slice of pepperoni pizza with a cola, and in the company of friends.  ", "Life is good."], "author": "Nathalie V.", "review": "This place is a sure thing.   Cheap, quick, and good - the best way to transition from a night at a bar/lounge/club to making the drive home to the South Bay.  This was a regular stop during my college days.  A recent late night trip reminded me of those good times and nudged me to finally Yelp it.\n\nBig slice of pepperoni pizza with a cola, and in the company of friends.  Life is good.", "rating": 4, "date": "2011-01-03"}, {"excerpts": ["I had the perfect slice of pepperoni pizza from these guys yesterday. ", "Seriously, guys. "], "author": "Lady V.", "review": "I had the perfect slice of pepperoni pizza from these guys yesterday. Seriously, guys. It looked PERFECT and tasted just as good. \n\nThese guys have a really good crust. Crunchy on the outside, but soft inside, not too much dough. My mom and I actually came here once and ordered just the crust from them. No sauce, no cheese, just crust.", "rating": 5, "date": "2011-10-16"}, {"excerpts": ["and my boyfriend loves your pepperoni pizza, too. ", "Bonus points for being easy to locate, and still open when I'm drunk, hungry, and unable to process any kind of information. ", "Extra bonus points for being RIGHT in front of a 38 Geary stop, especially on the night when I went drinking with co-workers for the first time, stopped in for a slice before getting on the WRONG 38 bus, and then drunk-dialled my boyfriend (well, now he's my ex... ", "but he was my boyfriend at the time) to profess, \"I love you! ... ", "I think."], "author": "Elle Q.", "review": "Nizario's, I love you so! Whether mid-day, or middle-of-the-night, you never fail to satisfy my pizza needs. You've got veggie options for me (more than one, even!!) and my boyfriend loves your pepperoni pizza, too. Bonus points for being easy to locate, and still open when I'm drunk, hungry, and unable to process any kind of information. Extra bonus points for being RIGHT in front of a 38 Geary stop, especially on the night when I went drinking with co-workers for the first time, stopped in for a slice before getting on the WRONG 38 bus, and then drunk-dialled my boyfriend (well, now he's my ex... but he was my boyfriend at the time) to profess, \"I love you! ... I think.\"\n\n... yep. Great night.", "rating": 5, "date": "2007-04-16"}, {"excerpts": ["I had low to no hopes, but that was a fine fine slice of pepperoni pizza. ", "Do not expect a NY style slice - and that's fine by me, I don't get the attraction of a foldable cheese delivery mechanism - "], "author": "r g.", "review": "We were hungry after a day of heat and booze at the Polk St. Blues Festival and ended up here. I had low to no hopes, but that was a fine fine slice of pepperoni pizza. Do not expect a NY style slice - and that's fine by me, I don't get the attraction of a foldable cheese delivery mechanism - but if you like a great pan style crust (which seems to be the least \"raved about\" crust style), Nizario's delivers. \n\nI'll be back.", "rating": 4, "date": "2010-09-30"}, {"excerpts": ["I don't usually like pepperoni pizza, but this was so good, so cheesy, the sauce was perfect, and the crust was delicious!!!!  ", "Wow.   ", "I really have to make a trip down there and pick up a pizza.  ", "just thinking about it now makes my mouth water.  ", "yum!!!"], "author": "Marley E.", "review": "I have to say, i did not actually enter the restaurant, nor did i have delivery service.  What i had was left over from my bf's dinner the night before, and it was DELICIOUS!! Hands down some of the best pizza i have ever had in the city.  I don't usually like pepperoni pizza, but this was so good, so cheesy, the sauce was perfect, and the crust was delicious!!!!  Wow.   I really have to make a trip down there and pick up a pizza.  just thinking about it now makes my mouth water.  yum!!!", "rating": 5, "date": "2008-06-04"}, {"excerpts": ["It's a great late night place to get a couple slices of some greasy pepperoni pizza. ", "From what I remember about the pizza here, it no way compares to other places in the city but unfortunately those places close early, Nizzies is one of the great late night options to soak up that alcohol before passing out."], "author": "D J.", "review": "Let me start off by saying that I've never been here sober. It's a great late night place to get a couple slices of some greasy pepperoni pizza. From what I remember about the pizza here, it no way compares to other places in the city but unfortunately those places close early, Nizzies is one of the great late night options to soak up that alcohol before passing out.", "rating": 3, "date": "2008-02-14"}], "meat lovers pizza": []}