{"classic bagels": [], "signature bagels": [], "gourmet topped bagels": [], "bagel thin singles": [], "bagel poppers": [], "bulk bagels": [], "cream cheese shmear": [], "egg mit sandwiches": [], "egg paninis": [], "bagel thin eggwhite sandwiches": [], "santa fe egg wraps": [], "signature sandwiches": [], "deli sandwiches": [], "bagel thin sandwiches": [{"excerpts": ["I like their bagel thin sandwiches, but a little pricey for the amount of food you get. ", "Overall decent, but like I said, if their were more options around, I probably wouldn't come as often. ", "Also, the manager(?) is kinda creepy...", "Also, I bought a half gallon of \"fresh squeezed\" oj the other day. ", "Definitely not fresh squeezed, worse than minute maid. ", "What a waste."], "author": "Lisa R.", "review": "Noah's is ok. Not great, but not horrible either. Being that it's one of the only quick service places in the neighborhood, I find myself popping in for a quick bagel or a sandwich. I recently tried one of their salads and it was horrible. Not sure how you can mess up a salad, but they did. I like their bagel thin sandwiches, but a little pricey for the amount of food you get. Overall decent, but like I said, if their were more options around, I probably wouldn't come as often. Also, the manager(?) is kinda creepy...Also, I bought a half gallon of \"fresh squeezed\" oj the other day. Definitely not fresh squeezed, worse than minute maid. What a waste.", "rating": 2, "date": "2012-08-07"}], "open face melts": [], "grilled sandwiches": [], "lunch paninis": [], "bagel dogs": [{"excerpts": ["I like their bagel dogs...", "three styles now days.\n", "Let's see how long before the wipe the begals out this time."], "author": "Matt J.", "review": "Came here and got a dozen of goodness on saturday.\nFamous demolished it so here I am back to stock back up.\nThe twists were yummy. My 3 year old demolished two before I could even finish mine. \nI like their bagel dogs...three styles now days.\nLet's see how long before the wipe the begals out this time.", "rating": 5, "date": "2014-06-22"}, {"excerpts": ["I like their bagel dogs here and their blueberry torte or cobbler not sure the exact name for it, it has tons of blueberries in it. ", "it is about the size of a little pizza . ", "the bagels are good especially the onion one. ", "but got to get that cream cheese to go with it !"], "author": "Nellie J.", "review": "I like their bagel dogs here and their blueberry torte or cobbler not sure the exact name for it, it has tons of blueberries in it. it is about the size of a little pizza . the bagels are good especially the onion one. but got to get that cream cheese to go with it !", "rating": 4, "date": "2014-06-11"}, {"excerpts": ["Their bagel dogs are good (from what I remember) and their sandwhiches are decent. ", "Lunch time gets crowded and busy."], "author": "Katie Anne N.", "review": "I like the idea of Noah's but when I actually get my food, I'm pretty bummed out. Their bagels are pretty tasty at times, but as the day goes by, they progressively get worse. I just got a salt bagel with shmear (1:55pm). I opened it up, the cream cheese was runny like milk and the bagel was a \"sad\" toasted. It was half way between looking toasted but felt like it was still soft= half ass job. \n\nI just took my bagel out of the toaster oven. So basically I paid $3 to redo the job myself. \n\nTheir bagel dogs are good (from what I remember) and their sandwhiches are decent. Lunch time gets crowded and busy.", "rating": 3, "date": "2008-04-25"}, {"excerpts": ["I luv the bagel dogs!!"], "author": "Sue U.", "review": "I give this location 5 stars because the guy with the ponytail, whom I am assuming is the owner/manager always gives everyone service with a smile while he is seriously multi-tasking!   I like how efficient it is in here compared with other establishments of this class.  I luv the bagel dogs!!", "rating": 5, "date": "2007-01-06"}], "pizza bagels": [{"excerpts": ["I've also picked out chips here that come with pizza bagels and the chip bags ", "have had mice bites out of them, which I thankfully noticed and was able to tell an employee before bringing them home. ", "Lastly, get something that directs the people in line and tell them where to stand. ", "The line is always a freak show here and no one ever knows where it begins/ends as the position literally changes daily."], "author": "Alexis T.", "review": "I come here at least once a week. I mean - who doesn't fancy a Noah's constantly when living in the Bay Area?! Although fresh bagels, they are quite small and a New Yorker may be PO'ed if they got one of these as breakfast. \n\nSo-so service, depending on the day. But today was the day that made me want to review this place. The cashier had gloves on, going back and forth from preparing bagels to the register and while at the register kept constantly rubbing and inching her nose WITH HER GLOVES ON. So so gross. I've also picked out chips here that come with pizza bagels and the chip bags have had mice bites out of them, which I thankfully noticed and was able to tell an employee before bringing them home. Lastly, get something that directs the people in line and tell them where to stand. The line is always a freak show here and no one ever knows where it begins/ends as the position literally changes daily.", "rating": 2, "date": "2015-10-02"}], "gourmet salads": [], "soups": [], "fruit": [{"excerpts": ["Also pictured is the pretty pathetic fruit bowl. ", "Without doubt, we will not be returning."], "author": "Christine J.", "review": "Seriously terrible service and a terribly run place. Out of two of the 3 things I ordered (potato salad and chai tea) and the lox bagel I got had disgusting tomatoes on it (pictured) and maybe 3 capers? Also pictured is the pretty pathetic fruit bowl. Without doubt, we will not be returning.", "rating": 2, "date": "2018-05-03"}, {"excerpts": ["While waiting for my order of a pepperoni pizza bagel to come out, I asked a question about a fruit cup, and the employee preparing orders completely ignored me. ", "She actually made eye contact with me and just chose not to respond in ANY way. ", "The only reason I came here and would come again is because every other place to get food on the block is obscenely overpriced."], "author": "Josephine L.", "review": "Came during Monday lunch hour, and the line moved slowly. It's small inside, and there were two employees. The service is TERRIBLE. While waiting for my order of a pepperoni pizza bagel to come out, I asked a question about a fruit cup, and the employee preparing orders completely ignored me. She actually made eye contact with me and just chose not to respond in ANY way. The only reason I came here and would come again is because every other place to get food on the block is obscenely overpriced.", "rating": 1, "date": "2015-07-28"}, {"excerpts": ["I said ok put the slaw on the sandwich and give me a side of fruit salad. ", "Another ten minutes later it was ready. ", "The sandwich was so soggy it was inedible, and the \"fruit salad\" consisted of three grapes and two brown pineapple chunks. ", "(Yes, brown.) ", "I picked at the pastrami and drank my water, vowing never to try to order a meal at Noah's again. ", "Not worth the $10!"], "author": "Concha G.", "review": "Spent $10 on a pastrami Ruben with a side of cole slaw and a bottle of water. Of course I wasn't expecting anything fancy, but I was looking forward the sauerkraut. After paying and waiting for about 15 minutes, someone called my name and I went up to the counter to pick up my sandwich and slaw. They said they were out of sauerkraut! Did I want cole slaw instead? No, I didn't, because I only order it for the sauerkraut, but what choice did I have? I said ok put the slaw on the sandwich and give me a side of fruit salad. Another ten minutes later it was ready. The sandwich was so soggy it was inedible, and the \"fruit salad\" consisted of three grapes and two brown pineapple chunks. (Yes, brown.) I picked at the pastrami and drank my water, vowing never to try to order a meal at Noah's again. Not worth the $10!", "rating": 2, "date": "2016-04-05"}, {"excerpts": ["I now get their fruit or juices or lemonades, and find them fresh and so good!  ", "GREAT staff, all of them.  ", "I know particularly Teresa, Rita, German, James and Arjun, and find them hard-working, great with people, practical and good people!!!  ", "GREAT job!!! :-) :-) :-) :-)"], "author": "Janet C.", "review": "Since I am allergic to wheat, chicken and eggs, I can only get a few items while enjoying the smells.  I used to love their turkey sandwiches, so good!!!   I now get their fruit or juices or lemonades, and find them fresh and so good!  GREAT staff, all of them.  I know particularly Teresa, Rita, German, James and Arjun, and find them hard-working, great with people, practical and good people!!!  GREAT job!!! :-) :-) :-) :-)", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["It also came with a choice from a variety of sides such as chips, potato salad, fruit salad, and slaw. ", "I chose the fruit salad. ", "There were a few too many pineapples for my personal taste, but it was still better than the other options ", "so I didn't complain. ", "Also, it comes with a pickle on the side which was a great bonus. ", "The lox was great on one of the bagel thins. "], "author": "Cara O.", "review": "Was in the area and wanted a quick lunch and was actually pleasantly surprised by the results. \n\n[THE FOOD] 3/5\nFor my lunch, I bought a Lox sandwich because i just love lox. The sandwich was available on any choice of bagel or bread, a feature I really liked. It also came with a choice from a variety of sides such as chips, potato salad, fruit salad, and slaw. I chose the fruit salad. There were a few too many pineapples for my personal taste, but it was still better than the other options so I didn't complain. Also, it comes with a pickle on the side which was a great bonus. The lox was great on one of the bagel thins. It made the sandwich a little smaller and less filling, but i didn't want too much bagel anyway.\n\n[THE VALUE] 4/4\nMy sandwich was about..$7.75? I know it started with a 7. Anyway, that is a lot cheaper than I'm used to seeing lox go for (sometimes i see them at $10-11) but they gave me plenty of salmon, plus my sides all for about $8.00 after tax, so i think that was a pretty great value.\n\n[THE SERVICE] 4/5\nGreat service. Friendly, easy to work with. Although it's not like there was a lot to work with, but everything went smoothly!\n\nOverall, this place was pretty good for me. Usually, i give chains like this a 3/5 just because they're rarely ones to stand out for me, but I will definitely be back if I'm around for lunch, because I'm always in the mood for lox and bagels!", "rating": 3, "date": "2013-11-24"}, {"excerpts": ["The fruit salad I got with my sandwich was even pretty decent for pre-cut and packaged fruit salad that you get at most sandwich places (it has pineapple). \n\n"], "author": "George A.", "review": "I don't know good bagels. I DO know that the bagels at Noah's are better than those at the supermarket (either the pre-packaged or the ones in the bins with the donuts and muffins), most independent coffee shops that I've tried, and the Noah's-type bagel place I used to frequent when I lived in AZ (Einstein's). \n\nEvery now and the I go to the Noah's by my work in Fremont for lunch, and this past weekend I came to this location on a Saturday afternoon. I got there lox sandwich on a peppercorn bagel with capers, onion, tomato, and plain cream cheese schmear. It was delish! The bagel it was served on tasted fresh and chewy. The fruit salad I got with my sandwich was even pretty decent for pre-cut and packaged fruit salad that you get at most sandwich places (it has pineapple). \n\nMy roommate comes to this location every Saturday and I decided to join him this last time because he was car-less since he had just been in a car accident the night before (I felt bad, and didn't want him to go without his usual Saturday bagel). The manager is funny and nice, and I think this location does a good job of getting orders out in a timely fashion. \n\nWhy no fifth star you ask? Well, I never come to Laurel Hts, and I've always wondered where all the children in SF live. I learned this past Saturday its this neighborhood. Seriously, they infiltrate the entire neighborhood! I've never seen anything like it since moving to SF! Plus, i could have done with a few more capers on my sandwich...", "rating": 4, "date": "2009-12-20"}, {"excerpts": ["There was a fruit salad in there instead of the potato ", "salad that I originally ordered.  ", "So I thought I had the wrong order or took someone elses since they don't call by your order number, just the name of the items.  ", "I let her know", ", I think I have the wrong order.  ", "She looks at me with the rudest stare, \"You ordered a lox sandwich right?!\"  ", "I told her, \"My order had a potato salad in there.  ", "This is a fruit salad.", "\" ", "She grabs the potato salad and throws in my bag.  ", "I'm still standing there waiting for my coffee.  ", "A minute later, she screams at me, ", "\"WHAT DID YOU ORDER? ", "WHY ARE YOU STILL ", "STANDING THERE?!", "\" ", "I told her I'm still waiting for my coffee!  ", "She rudely points to another counter and yells to the back asking someone to help her make drinks.  "], "author": "Steven H.", "review": "I usually don't write reviews, but this has been the worst customer service experience I have encountered.  \n\nI ordered a Lox sandwich with potato salad and a hazelnut mocha.  A lady working there calls out my order, Lox sandwich.  There was a fruit salad in there instead of the potato salad that I originally ordered.  So I thought I had the wrong order or took someone elses since they don't call by your order number, just the name of the items.  I let her know, I think I have the wrong order.  She looks at me with the rudest stare, \"You ordered a lox sandwich right?!\"  I told her, \"My order had a potato salad in there.  This is a fruit salad.\" She grabs the potato salad and throws in my bag.  I'm still standing there waiting for my coffee.  A minute later, she screams at me, \"WHAT DID YOU ORDER? WHY ARE YOU STILL STANDING THERE?!\" I told her I'm still waiting for my coffee!  She rudely points to another counter and yells to the back asking someone to help her make drinks.  The rest of the employees there were stressed out with the yelling of this lady.\n\nThis is absolutely the worst experience ever.  The lady working there should be fired.  Noah's Bagel has lost me as a customer for good!", "rating": 1, "date": "2015-02-11"}, {"excerpts": ["came with tomatoe, some pastrimi that may have been tasteless, maybe some lettuce and cheese..\n-slice of dill pickle (individually wrapped)\nnice and crunchy, fresh and a little sour\n-red potato salad (choice of fruit, potato or macaroni)\nactually not so bad. ", "tasted  homemade but wasn't cuz of the potatoe mushiness. ", "should have added a little black pepper\n", "*texture of bagel didn't hinder the eating of the sandwich which was surprising to me. ", "sometimes bagels are chewy....not this one. ", "(not saying whether it's authentic or not, just makes a good sandwich.)\ngood value. "], "author": "Victor G.", "review": "noah's has sandwiches (7ish), open faced sandwiches on bagel,  bagels, coffees, salads and much much more!\n\nsampling:\n-pastrimi and cheese on open faced sandwich (hot 6.99)\nanything with cheese is bound to taste good and this was no exception. came with tomatoe, some pastrimi that may have been tasteless, maybe some lettuce and cheese..\n-slice of dill pickle (individually wrapped)\nnice and crunchy, fresh and a little sour\n-red potato salad (choice of fruit, potato or macaroni)\nactually not so bad. tasted  homemade but wasn't cuz of the potatoe mushiness. should have added a little black pepper\n*texture of bagel didn't hinder the eating of the sandwich which was surprising to me. sometimes bagels are chewy....not this one. (not saying whether it's authentic or not, just makes a good sandwich.)\ngood value. should note bagel wiches are smaller than regular 'wiches.\n\ncrumbs:\n-very friendly service by this chinese woman (smiling all the time).\n-sandwich a possibility next time , will the 4 stars hold up?\n-noah's blend coffee also a possibility.\n-this shop small but fast execution.\n-little seating, free parking in park.", "rating": 4, "date": "2010-04-02"}, {"excerpts": ["You, who puts blemished fruit in white tea and calls it \"Limited Edition Infusion\".  ", "I know rotten fruit when I see it, and I know you need to get rid of it.  "], "author": "Lea N.", "review": "Who are you anyways, Noah?\n\n   You, who has just taken away your employee's rights to tips without increasing their hourly wage, cowering at the recent Starbucks class-action ruling, and retaliating with a most unnecessary blow to your entire workforce.  \n\n   You, who turns out some funkdafied hummus.  If I wanted whole garbanzo beans on my bagel, I'd make it at home, not pay you four dollars for it.\n\n   You, who is located in the epicenter of the DPT Militia warzone, a landscape so scarred by the stomping of feet and echoes of expletives, even the most seasoned veterans cringe at it's mention.\n\n   You, who puts blemished fruit in white tea and calls it \"Limited Edition Infusion\".  I know rotten fruit when I see it, and I know you need to get rid of it.  But I'm not buying it. \n\n  None of these things are the fault of your staff, who are fabulous.  Four glowing stars for them, and all my worldly shame just for you, Noah.  You jerk.", "rating": 4, "date": "2008-07-24"}], "low fait smoothies": [], "coffee cake": [], "other sweets": []}