{"aged asiago cheese loaf  roll": [], "sweet baguette": [{"excerpts": ["We tried a sweet baguette..... and several pastries... "], "author": "Joe B.", "review": "yes yes yes... very good... \n\nWe were in SF this weekend and stopped by twice...\n\nWe tried a sweet baguette..... and several pastries... A little pricey but very good to go....\n\nYummy.. We will be back again....", "rating": 4, "date": "2013-07-28"}, {"excerpts": ["fluer de sel\nChocolate Chip Cookies\nPumpkin Bread\nSweet Baguette\n\n"], "author": "Joel C.", "review": "I typically don't eat bread but if I do, I head to Noe Valley Bakery.  Is it by far my favorite bakery in San Francisco!\n\nRecommend:\nCupcakes - Most-ess and Chocolate Caramel fluer de sel\nChocolate Chip Cookies\nPumpkin Bread\nSweet Baguette\n\nI'm sure the other baked goods are great, but I have a hard time pulling away from my favorites.  Definitely head there in the mornings to get the best items...they sell out pretty quickly.", "rating": 5, "date": "2012-01-24"}, {"excerpts": ["I'd recommend their butter croissant, sweet baguette and challah.\n", "And their delicious crusted white bread."], "author": "Prague G.", "review": "I'd recommend their butter croissant, sweet baguette and challah.\nAnd their delicious crusted white bread.", "rating": 4, "date": "2011-12-12"}, {"excerpts": ["The baguettes are excellent -- I prefer the sweet baguette, but the sour is also very good. "], "author": "Katie M.", "review": "Since I subsist almost entirely on carbs, I knew when I moved to Noe Valley that I was in trouble -- and that this bakery and I would be good acquaintances. The baguettes are excellent -- I prefer the sweet baguette, but the sour is also very good. The double raisin bread is practically a dessert -- it's literally stuffed with raisins. I love the cinnamon oat scones, which are hearty and have just the right amount of glaze. The cupcakes are delicious -- I prefer a more sugary frosting, myself, but I do love the lemon drop cupcake (but what happened to the little bee that used to adorn them?? I haven't seen them lately!). I also love the holiday cupcake varieties with the rubber finger puppet toppers (I swear I'm not five -- I would never buy a $2.75 cupcake for the cute little ghost, turkey or snowman toy...no...not me, I..I...). Other standouts are the whoopie pies (both chocolate and lemon), the apricot hamentashen cookies (which are both buttery and tart), the Noe-Os and the iced circus cookies. Basically, you can't go wrong here! \n\nThe staff has always been friendly and helpful, too, no matter how busy it is.", "rating": 5, "date": "2011-10-05"}, {"excerpts": ["I usually get the sweet baguette, sour baguette, or walnut bread.  ", "The pastries are also really good, except don't go in there on an empty stomach - that means a severely shrunken wallet."], "author": "B Y.", "review": "As you walk down 24th street to catch Muni or BART or one of the commuter caravans, you are suddenly hit by a wave of freshly baked bread emanating from a little place called Noe Valley Bakery... The breads are made every morning.  I usually get the sweet baguette, sour baguette, or walnut bread.  The pastries are also really good, except don't go in there on an empty stomach - that means a severely shrunken wallet.", "rating": 5, "date": "2013-05-21"}], "caramelized onion sesame baguette": [], "walnut multigrain": [], "sourdough batard": [], "crusty white": [{"excerpts": ["When you're here, though, don't miss the:\n\n- Coffeecake (best in the world)\n- Crusty white bread (buy it, slice it, toast it, butter it, love it.  "], "author": "Scott W.", "review": "The Candyman makes\neverything he bakes\nSatisfying and delicious.\nTalk about your childhood wishes...\nYou can even eat the dishes!\n\nOkay, okay.  There are no dishes to eat, but if there were... well, you would.\n\nThis place rivals Tartine; which is another slice of heaven.  When you're here, though, don't miss the:\n\n- Coffeecake (best in the world)\n- Crusty white bread (buy it, slice it, toast it, butter it, love it.  I was a wheat bread eater for YEARS 'till i had this--amazing)\n- Morning buns (orangey, cinnamonny goodness)\n- Ham & cheese quiche (every weekend)\n- Chocolate croissants\n\nSometimes the counter staff makes you feel like you're lucky to be buying their stuff (they're kinda right).  Except a brown-haired woman named Megan who always has a big smile on her face and is a service SupaStah.  She keeps the place at 5 stars.", "rating": 5, "date": "2007-10-29"}], "sour rye": [], "black mission fig": [], "apricotginger": [], "double raisin": [{"excerpts": ["My son loves their double raisin bread, other than that nothing at this place really jiggles my wires. ", "I also find it on the expensive side."], "author": "Michael S.", "review": "My son loves their double raisin bread, other than that nothing at this place really jiggles my wires. I also find it on the expensive side.", "rating": 3, "date": "2014-07-30"}, {"excerpts": ["The double raisin bread is practically a dessert -- it's literally stuffed with raisins. ", "I love the cinnamon oat scones, which are hearty and have just the right amount of glaze. ", "The cupcakes are delicious -- I prefer a more sugary frosting, myself, but I do love the lemon drop cupcake (but what happened to the little bee that used to adorn them?? ", "I haven't seen them lately!). ", "I also love the holiday cupcake varieties with the rubber finger puppet toppers (I swear I'm not five -- I would never buy a $2.75 cupcake for the cute little ghost, turkey or snowman toy...", "no...not me, ", "I..", "I...). ", "Other standouts are the whoopie pies (both chocolate and lemon), the apricot hamentashen cookies (which are both buttery and tart), the Noe-Os and the iced circus cookies. "], "author": "Katie M.", "review": "Since I subsist almost entirely on carbs, I knew when I moved to Noe Valley that I was in trouble -- and that this bakery and I would be good acquaintances. The baguettes are excellent -- I prefer the sweet baguette, but the sour is also very good. The double raisin bread is practically a dessert -- it's literally stuffed with raisins. I love the cinnamon oat scones, which are hearty and have just the right amount of glaze. The cupcakes are delicious -- I prefer a more sugary frosting, myself, but I do love the lemon drop cupcake (but what happened to the little bee that used to adorn them?? I haven't seen them lately!). I also love the holiday cupcake varieties with the rubber finger puppet toppers (I swear I'm not five -- I would never buy a $2.75 cupcake for the cute little ghost, turkey or snowman toy...no...not me, I..I...). Other standouts are the whoopie pies (both chocolate and lemon), the apricot hamentashen cookies (which are both buttery and tart), the Noe-Os and the iced circus cookies. Basically, you can't go wrong here! \n\nThe staff has always been friendly and helpful, too, no matter how busy it is.", "rating": 5, "date": "2011-10-05"}, {"excerpts": ["The chocolate cherry bread is heavenly, and the double raisin bread is to die for.  ", "They tend to run out of the raisin bread ", "so I recommend that you call a day ahead and have them reserve a loaf for you.  ", "You will need to give them a credit card to hold the loafs.  ", "This place is so great ", "I almost don't want to post because I don't want longer lines!"], "author": "Michelle T.", "review": "I LOVE noe valley bakery.  The chocolate cherry bread is heavenly, and the double raisin bread is to die for.  They tend to run out of the raisin bread so I recommend that you call a day ahead and have them reserve a loaf for you.  You will need to give them a credit card to hold the loafs.  This place is so great I almost don't want to post because I don't want longer lines!", "rating": 5, "date": "2011-11-13"}, {"excerpts": ["But....I also got a loaf of their double raisin bread, thinking I would eat some tomorrow.  ", "Well, of course I wanted to try just a bite, just a tiny little taste.  ", "I haven't been able to stop eating it since that first bite.  ", "I think there's a whole box of raisins in the loaf.  ", "And I am not even a huge fan of raisins...", "but it's really good in this loaf.  ", "It's divine... and the bread is...moist?  ", "Oh, wait, the double raisin loaf.\n", "Guy: That will be all?\n", "Me: ", "Oh, and a small coffee as well.\n"], "author": "Sooj O.", "review": "Today is the first day I haven't eaten fried food since Wednesday, so I thought I could get a cupcake.  Unfortunately, Ritual didn't have the chocolate cupcake with salty fudgy frosting, so I yelped cupcakes and decided on Noe Valley Bakery and Bread Company as the closest high ranking cupcakery near me.\n\nI got the vanilla cupcake.  Butter frosting.  I am not a fan of butter frosting...I like sour cream frosting and cream cheese frosting, and cream frosting...but not butter frosting.  I think it's too hard and doesn't go well with the soft crumbly goodness of cake. \n\nBut....I also got a loaf of their double raisin bread, thinking I would eat some tomorrow.  Well, of course I wanted to try just a bite, just a tiny little taste.  I haven't been able to stop eating it since that first bite.  I think there's a whole box of raisins in the loaf.  And I am not even a huge fan of raisins...but it's really good in this loaf.  It's divine... and the bread is...moist?  I don't know how else to describe it.\n\nSo, not the cupcake I wanted, but an unexpected raisin pleasure. \nOh, and the guy at the cash register was so nice.  \nGuy: What would you like?\nMe: Hmmm...Vanilla cupcake\nGuy: Will that be it?\nMe: Oh, wait, the double raisin loaf.\nGuy: That will be all?\nMe: Oh, and a small coffee as well.\n(all this while the line behind me gets longer and longer).\n\nMe...afflicted with inability to make up my mind before I get to the cash register....\n\nOh, oh, and they sell challah bread!  I am so going back to get some!\n________\n\nUpdate:\n\nSince Steph P. is a cupcake fanatic, I decided to join her for an evening of chatting and cupcaking.  I will let her review her eats.  However, I will mention the Hostessy chocolate cupcake with a cream filling as being moist and obliterating the memory of the vanilla cupcake with the butter frosting. \n\nBut, I am still more enthralled by their breads.  They had the most delicious Asiago Cheese Bread...crusty cheese exterior...and a core of Asiago Cheese enlivening the delicious bread.  While we walked over to Ritual to partake of coffee and cupcakes, we managed to devour most of the Asiago Cheese Bread.  \n\nSteph was saying that she wished she could toast the bread.  Over the next couple of mornings, I toasted the little bit of bread leftover.  Very delicious toasted.  For those who don't plan to devour a large loaf of cheese bread quickly, they also sell Asiago Cheese rolls.", "rating": 5, "date": "2007-03-31"}, {"excerpts": ["I went to NVB on 24th Street...... for the damned delicious asiago cheese bread, the apricot ginger bread, the double raisin bread, the brioche (if you get there early enough) and the scones.  ", "All yummers.  ", "The cookies!  ", "yes, yesy, yes, the cookies!  "], "author": "Donna H.", "review": "My downfall was the Asiago Cheese Bread.  One sniff, one taste of the nutty cheesy goodness, I knew my life would never be the same.  Hopeless, addicted, I could furtively eat an entire loaf over the course of an evening.  Who the hell needed popcorn as a snack?  Thank God NVB does not come to the Tuesday Farmer's Market at the Ferry Bldg. any longer, I've lost 20 pounds!  Then, I made the fatal error in judgement,  I went to NVB on 24th Street...... for the damned delicious asiago cheese bread, the apricot ginger bread, the double raisin bread, the brioche (if you get there early enough) and the scones.  All yummers.  The cookies!  yes, yesy, yes, the cookies!  Baguettes, very tasty and the breadsticks, like popcorn!\n\nI think I am in a minority, however, their cupcakes did nothing for me.  I like frosting, but the thick coating on top was heavy and ordinary in flavor.  The cupcakes were dry and the one's I tried with fillings, the fillings were sort of gummy and tasteless.  Dissapointing.  That said, I will not subtract a star for the cupcakes, they are not what NVB is known for.\n\nService is hit and miss.  Sometimes you get wonderful service, other times, your server is doing you a huge favor to bag the bread and take your money.  Be warned, surly behavior is not smiled upon, but the bread here is worth it.", "rating": 5, "date": "2008-05-19"}, {"excerpts": ["The double raisin, cherry chocolate and caramelized onion sesame breads are three of my all time favorites. ", "The cakes are magical and anything with fruit is amazing."], "author": "Stephen G.", "review": "Best baked goods in the city, hands down! The double raisin, cherry chocolate and caramelized onion sesame breads are three of my all time favorites. The cakes are magical and anything with fruit is amazing.", "rating": 5, "date": "2010-04-08"}], "sandwich bread": [{"excerpts": ["We have been really into the wheat sandwich bread lately. ", "Also had a seasonally available pumpkin muffin recently that was wonderful. ", "Love this place."], "author": "Rachel R.", "review": "The cranberry lemon scone is INSANE. Best breakfast pastry of my life. I visit at least once or twice a month for scones and to pick up a loaf of bread. We have been really into the wheat sandwich bread lately. Also had a seasonally available pumpkin muffin recently that was wonderful. Love this place.", "rating": 5, "date": "2015-10-12"}, {"excerpts": ["I would imagine this would be quite delicious served warm as a sandwich bread or as is. "], "author": "Steph P.", "review": "Background:\nPast research by the principal investigator has demonstrated that consumption of cupcakes is significantly linked with feelings of euphoria and mild insanity (but the good kind). Additionally, field research in NYC has compared various cupcake purveyors (http://www.yelp.com/list_details?userid=DAf3UOAONCpgETWlNTERKg&list_id=SzFCtFQ2YOJxI54pxaUr3Q) and found Magnolia Bakery's cupcakes to be the frontrunner, described as \"HOT and MOIST and HEAVENLY\" (http://www.yelp.com/biz/85x3dZCMBj4rJ2LAdW-wFg?hrid=4nvPmoOAzAzW7hJjlMIjWw)  However, there is currently a dearth of research addressing the Great Cupcake Debate in the Bay Area (by the present PI). Therefore, the present review represents one study in a multi-site, ongoing research project to determine the Bay Area's BEST CUPCAKE EVAR.\n\n\nMethod:\nThe site for Study #1 - Noe Valley Bakery & Bread Company. Samples included:\n1) Most-est Cake - popular among Yelp reviews, fashioned after the Hostess cupcakes;\n2) Z'nger cupcake -fashioned after Dolly Madison raspberry flavored, creme filled cakes;\n3) Carrot Cake cupcake - fashioned after...well, carrot cake;\n4) Asiago cheese loaf (ok, so it's not a cupcake, but my co-investigator was kind enough to give me some of her loaf so it's fair for review)\n\nResults:\nOMG!!! (and I mean that in the most scientific way possible). Eating these cupcakes is like discovering a completely new, moister, more delicious level of existence. Let's break it down by each independent variable with the dependent variable (DV) operationalized as Steph's level of euphoria (where 1 = I would rather eat dirt, and 10 = I  could die right now and not give a crap):\n\n1) Most-est - Biting into the chocolate ganache top gives way to moist, chocolate cake heaven. A second bite into the cupcake and negative memories of the nasty white pseudocream in Hostess Suzy-Q's and Twinkies dissipate as perfect portion of the fluffy, vanilla creme center melds together with the surrounding chocolate cake. A wonderful cupcake, but personal tastes favor frosting over ganache. DV = 8.5 \n\n2) Z'nger - If angels came in the form of cupcakes, they would probably taste something like this. Moist angel food cake, filled and topped with a delicate whipped creamlike frosting that is speckled with raspberry preserves and dusted with pink and white coconut flakes. DV =  10\n\n3) Carrot Cake - Perfectly constructed in sweetness, density, and incorporation of shredded carrot, raisins, and walnuts. The frosting is a traditional cream cheese frosting, but excecuted perfectly to achieve the ultimate balance of sweetness, lightness, and creaminess. Eating this evoked images of swimming in carrot cake. (I dunno?) Even my co-investigator, who doesn't like carrot cake, had to concede that this was a delight.  DV = 10\n\n4) Asiago Cheese Loaf - A sturdy bread with large chunks of savory asiago goodness running throughout. I would imagine this would be quite delicious served warm as a sandwich bread or as is. DV = 7\n\nDiscussion:\nWhile the present research did not incorporate the tasting of the plain chocolate or vanilla cupcakes(thus serving as a control in comparing against other bakeries), the intensity of the reactions formed suggest that Noe Valley Bakery is in the running for the best cupcakes in SF. It should also be mentioned that the next morning, these cupcakes were STILL moist and heavenly. The Asiago loaf also suggests that the bakery does a good job with savory items, though further research is needed for more confident results. Other observations worthy to note:  there is no seating in the bakery and few cafes nearby; plan ahead where you will be conducting your own research. At only $1.95 per cupcake, this is a great deal compared to some other places that offer gourmet cupcakes. This is located in Noe Valley, which is a pain in the ass for someone who lives in the Inner Richmond. But it is TOTALLY worth it. I will try to make more friends with cars just to have more of these cupcakes.\n\nConclusion:\nNoe Valley Bakery has some DAMN GOOD, affordable cupcakes! Dare I say...better than Magnolia?!?! The PI's conception of cupcakes has been turned upside down and requires further investigation. Future research is highly recommended to assure reliability and validity of findings...and to induce states of euphoria!", "rating": 5, "date": "2007-04-27"}, {"excerpts": ["Their whole wheat sandwich bread is a staple for me. ", "They have an orgasmic asiago cheese bread, that I always bring to potlucks, and everyone loves!\n"], "author": "Shipra K.", "review": "Their whole wheat sandwich bread is a staple for me. They have an orgasmic asiago cheese bread, that I always bring to potlucks, and everyone loves!\nTheir deserts are nice, I vote for the fruit tart, although the cupcakes are pretty good.\n\np.s - they sell frozen cookie dough - much ncier than the stuff you get in the stores, not as nice as the stuff you would make at home -", "rating": 4, "date": "2007-06-09"}], "breadsticks": [{"excerpts": ["Beautiful loaves of bread lined the shelves and the breadsticks nearly convinced me to buy them on looks alone.\n\n"], "author": "Semuteh F.", "review": "Had my eye on NVB for a while and so glad to finally get to try it today!\n\nI'm not typically in Noe Valley because let's face it #noevalleysowhite BUT every now and then I'll venture into the whole foods or some little boutique to spend a lot of $$$ on something for a party or nearby gathering.\n\nI was happy to see diverse staff here and literally everything in the case looked delicious! Cheddar chive biscuit could use more cheddar but it was a minor miss and still wonderfully soft on the inside with a buttery crusty exterior. Cupcake and cookies were perfection. Beautiful loaves of bread lined the shelves and the breadsticks nearly convinced me to buy them on looks alone.\n\nDefinitely will make this a pit stop on future excursions into the valley.", "rating": 5, "date": "2016-07-08"}, {"excerpts": ["Great:\nBaguettes\nCheese breadsticks\nMaple scones\nAlways friendly\nMolasses cookies\n\nBad:\n"], "author": "Alex L.", "review": "Great:\nBaguettes\nCheese breadsticks\nMaple scones\nAlways friendly\nMolasses cookies\n\nBad:\nPrices for pre-made dough. Looks great, but overpriced. \nSells out early. Get there before noon!", "rating": 4, "date": "2011-12-12"}, {"excerpts": ["The rosemary dinner rolls topped with a touch of grey sea salt could put a smile on my face every day and the crunchy, cheesy asiago breadsticks are the perfect savory snack - though I usually get them to entertain myself as I walk home with whatever other yeasted-wheaty goods ", "I've picked up. "], "author": "Alissa A.", "review": "I'm torn, like a still-warm crusty loaf of happiness.\nStill getting over Noe sticker shock perhaps. I just can't get over charging nearly five bucks for a loaf of bread. Am I totally behind the times?\n\nGranted, this is no Wonder Bread, just Wonderful! The rosemary dinner rolls topped with a touch of grey sea salt could put a smile on my face every day and the crunchy, cheesy asiago breadsticks are the perfect savory snack - though I usually get them to entertain myself as I walk home with whatever other yeasted-wheaty goods I've picked up. The seeded caramelized onion baguette is nom-a-licous - definitely could work for dessert with a mild soft cheese or fruit spread.\n\nIt's likely I just need to shell out more and then maybe I'll be addicted. At that price point, I'm not sure I want to be though. Regardless, I'll be back.\n\n***\nUpdate. So a good hunka hunka yeast goes for five bucks. Forgive me for thinking it was a tad much for just the right crunch and chew with my flour and water.\nSugar craving: the Lady Kisses looked like macaroons (of the French, not coconut variety) so I asked what they were. They guy hesitated and then told me almond. Amazing. I want. Perfect. Out the door I go, first nibble... \"this is not almond... *frown*...\" It was hazelnut and while if I was craving the signature Ferrero-Rocher confection, this would have been perfect. But I expected, and only purchased it because it was almond. Note to staff: if you're not sure, ask someone else. Please.", "rating": 3, "date": "2010-02-05"}, {"excerpts": ["Baguettes, very tasty and the breadsticks, like popcorn!\n\n"], "author": "Donna H.", "review": "My downfall was the Asiago Cheese Bread.  One sniff, one taste of the nutty cheesy goodness, I knew my life would never be the same.  Hopeless, addicted, I could furtively eat an entire loaf over the course of an evening.  Who the hell needed popcorn as a snack?  Thank God NVB does not come to the Tuesday Farmer's Market at the Ferry Bldg. any longer, I've lost 20 pounds!  Then, I made the fatal error in judgement,  I went to NVB on 24th Street...... for the damned delicious asiago cheese bread, the apricot ginger bread, the double raisin bread, the brioche (if you get there early enough) and the scones.  All yummers.  The cookies!  yes, yesy, yes, the cookies!  Baguettes, very tasty and the breadsticks, like popcorn!\n\nI think I am in a minority, however, their cupcakes did nothing for me.  I like frosting, but the thick coating on top was heavy and ordinary in flavor.  The cupcakes were dry and the one's I tried with fillings, the fillings were sort of gummy and tasteless.  Dissapointing.  That said, I will not subtract a star for the cupcakes, they are not what NVB is known for.\n\nService is hit and miss.  Sometimes you get wonderful service, other times, your server is doing you a huge favor to bag the bread and take your money.  Be warned, surly behavior is not smiled upon, but the bread here is worth it.", "rating": 5, "date": "2008-05-19"}, {"excerpts": ["Delicious baked goods, especially those Asiago Breadsticks. ", "BUT I DESPERATELY MISS the Linzer Torte", ", PLEASE bring it back!!!!!"], "author": "Richard B.", "review": "Delicious baked goods, especially those Asiago Breadsticks. BUT I DESPERATELY MISS the Linzer Torte, PLEASE bring it back!!!!!", "rating": 4, "date": "2010-12-08"}, {"excerpts": ["*Breadsticks (SOOOOOO ADDICTING)\n", "*Sandwiches (chicken sandwich is nice and basic)\n"], "author": "Angela T.", "review": "This place is close to where I work.\n\nSuch a staple in my diet. Some things a bit on the pricey end (i.e. cookies)\n\nLoves:\n*Scones (any and all)\n*Cakes (ditto - my faves include Cloud 9 & Carrot Cake; I personally find the Red Velvet a bit dry; these and others can be ordered in advance - advised around holiday/weekends)\n*Breads\n*Breadsticks (SOOOOOO ADDICTING)\n*Sandwiches (chicken sandwich is nice and basic)\n*Quiches (that can be toasted on site)\n\nAm I a carb person much?", "rating": 5, "date": "2010-01-22"}, {"excerpts": ["I love getting their buttery croissants, cinnamon twists, crisp breadsticks, scones, and soft-centered, crusty Italian style white bread. ", "Every time I come here, I have to cut out my carbs for the rest of the week. ", "Well worth it. ", "YUM!!"], "author": "Juliane N.", "review": "Great little bakery. Love it here. I love getting their buttery croissants, cinnamon twists, crisp breadsticks, scones, and soft-centered, crusty Italian style white bread. Every time I come here, I have to cut out my carbs for the rest of the week. Well worth it. YUM!!", "rating": 5, "date": "2007-11-28"}, {"excerpts": ["I love their crostini breadsticks, could eat them all day long, but they only bake them on sundays and thursdays ", "so they run out quickly, especially the asiago cheese ones. ", "Their bread is decent, the fig and apricot and interesting and the raisin is great because it's more raisin than loaf, which I like. ", "The 7x7 grain bread was disappointing though, the flavor was just not good and the texture was both crumbly and dry. ", "Onion/sesame baguettes, delish. ", "I go back for the breadsticks and the raisin loaf/onion baguette."], "author": "Allie D.", "review": "I love their crostini breadsticks, could eat them all day long, but they only bake them on sundays and thursdays so they run out quickly, especially the asiago cheese ones. Their bread is decent, the fig and apricot and interesting and the raisin is great because it's more raisin than loaf, which I like. The 7x7 grain bread was disappointing though, the flavor was just not good and the texture was both crumbly and dry. Onion/sesame baguettes, delish. Their oatmeal raisin cookies are great if you like them very dense and not soft, snickerdoodles and gingersnaps are just ok. Their rugeleh is to die for however, the pastry is denser than I'm used to but good and the fillings are not skimped on. The scones are good and they sell the dough for that and their oatmeal cookies if you want to make it at home, which is nice. The service is pretty shockingly distant, I've never seen people surrounded by that much yummy stuff be so unexcited to be there. I was really excited at first when I found the place but now that the newness has worn off I have to say, the products (esp. pastries) are very expensive for what they are. I go back for the breadsticks and the raisin loaf/onion baguette.", "rating": 3, "date": "2009-04-14"}], "challah": [{"excerpts": ["Their challah egg bread (plain or sesame) is a winner.  ", "Big and bite sized cupcakes, big layer cakes, cookies galore and more.  ", "They just opened their second store in West Portal.  ", "Go and treat yourself!"], "author": "Kristina H.", "review": "I've been a customer here for well over 15 years.  Their morning buns are the best I know of-rich, buttery, full of cinnamon sugar, with crispy edges on the outside and succulent moistness inside. Their challah egg bread (plain or sesame) is a winner.  Big and bite sized cupcakes, big layer cakes, cookies galore and more.  They just opened their second store in West Portal.  Go and treat yourself!", "rating": 5, "date": "2017-08-23"}, {"excerpts": ["They make amazing challah bread.  \n", "They do amazing cakes.  \n", "Muffins.  ", "Cupcakes.  ", "Morning buns.  ", "Sticky Buns.  ", "Hot Cross Buns for Lent.\n", "The challah bread is exceptional.  ", "It is especially great to make french toast with.  "], "author": "Veronica M.", "review": "One of the best bakeries in San Francisco.  \n\nThey make their own version of Hostess cakes...called \"Most-est\" cupcakes.\nThey make their own version of Oreo's...called \"Noe-os.\"\nThey have a \"daily bread.\"\nThey make an amazing chocolate cherry bread.\nThey make amazing challah bread.  \nThey do amazing cakes.  \nMuffins.  Cupcakes.  Morning buns.  Sticky Buns.  Hot Cross Buns for Lent.\nI love the pignolis & rugelach.\n\nI've had them all & they never disappoint.\n\nI called in an order for 2 dozen hot cross buns for Good Friday.  I wasn't sure they'd be able to fulfill it the same day, but they did!\n\nThe challah bread is exceptional.  It is especially great to make french toast with.  And days later as regular toast, it's still soft & chewy.\n\nThey're now doing cookie & scone dough for you to take & bake at home.\n\nA gem of Noe Valley.\n\n5 stars.", "rating": 5, "date": "2015-04-12"}, {"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}, {"excerpts": ["We purchased: whole wheat sourdough, and challah. \n", "Sadly, the whole wheat sourdough wasn't anything special. ", "I actually was pretty disappointed with it. \n", "So why the 4 stars you might ask... \n", "The challah was AMAZING!!!! ", "The best I've had in ", "I don't know how long, and definitely the best I've had on this coast. \n"], "author": "Amanda G.", "review": "My mother-in-law requested we bring \"some kind of artisan, sourdough type bread\" to her most recent family get together. \nSo, since we were going to be in this neighborhood the day before, we decided to buy a couple loaves from here. \n\nWe purchased: whole wheat sourdough, and challah. \nSadly, the whole wheat sourdough wasn't anything special. I actually was pretty disappointed with it. \nSo why the 4 stars you might ask... \nThe challah was AMAZING!!!! The best I've had in I don't know how long, and definitely the best I've had on this coast. \nIt was perfection in every way:) \n\nWe also split one chocolate cherry rugelach. While it wasn't the same as NY rugelach, it was still very tasty! \n\nThere were numerous tempting items in the case, but I held back. \n\nNext time I'm\"m in the neighborhood, I'll definitely be stopping here.", "rating": 4, "date": "2009-10-20"}, {"excerpts": ["They are my go to bakery for round raisin challah for the holidays. ", "But what I can't understand is their lack of comprehending good service. ", "You order in advance and PAY, yet you must wait on line with all the other bakery patrons to pick up your order. ", "And then when you leave (after asking if there is a separate line) you get the snarky comment on exit, \"see that was quick\". ", "Not! ", "Too bad. ", "Will return to Wise Sons or Marla bakery for holiday challahs."], "author": "Ilene L.", "review": "They are my go to bakery for round raisin challah for the holidays. But what I can't understand is their lack of comprehending good service. You order in advance and PAY, yet you must wait on line with all the other bakery patrons to pick up your order. And then when you leave (after asking if there is a separate line) you get the snarky comment on exit, \"see that was quick\". Not! Too bad. Will return to Wise Sons or Marla bakery for holiday challahs.", "rating": 1, "date": "2015-09-13"}, {"excerpts": ["After months of avoiding this bakery due to a handful of unfortunate incidents involving cupcakes and an assortment of cookies (see previous review), some guests brought me a loaf of challah from Noe Valley Bakery.  "], "author": "Kristin M.", "review": "After months of avoiding this bakery due to a handful of unfortunate incidents involving cupcakes and an assortment of cookies (see previous review), some guests brought me a loaf of challah from Noe Valley Bakery.  Heaven - perfectly dense, barely sweet.\n\nSo when I went in on my own to get another loaf, I was introduced to the amazing, gooey, goodness that is NVB's sticky bun.  I'm hooked.  I can easily say this sticky bun is one of the best I've ever had - and I've shared it with anyone who crosses my path on a Saturday or Sunday morning.\n\nI was also pleased to discover that NVB makes a mean hot chocolate.\n\nMuch to my \"I walk past here every day\" dismay, I now join the ranks of Noe Valley residents who adore this local bakery.", "rating": 4, "date": "2011-07-30"}, {"excerpts": ["I'd recommend their butter croissant, sweet baguette and challah.\n", "And their delicious crusted white bread."], "author": "Prague G.", "review": "I'd recommend their butter croissant, sweet baguette and challah.\nAnd their delicious crusted white bread.", "rating": 4, "date": "2011-12-12"}, {"excerpts": ["I've read that their challah is too ", "but I haven't been able to bring it home.  ", "Why?  ", "Noe Valley Bakery, here's a tip: Jews eat challah with brisket, pastrami etc.  ", "So no dairy in the challah please.  ", "There is no such thing as challah with butter, it is called brioche.  \n\n"], "author": "Rebecca L.", "review": "You know from other reviewers that their baked goods are great.  I've read that their challah is too but I haven't been able to bring it home.  Why?  Noe Valley Bakery, here's a tip: Jews eat challah with brisket, pastrami etc.  So no dairy in the challah please.  There is no such thing as challah with butter, it is called brioche.  \n\nNow, please pass the cupcakes.", "rating": 4, "date": "2009-11-13"}, {"excerpts": ["Great challah and the soda (seasonal) bread are fantastic. ", "Hiii-lariously poor customer service. ", "WTF? "], "author": "Mitsi M.", "review": "Delicious, wonderful, beautiful cupcakes. Great challah and the soda (seasonal) bread are fantastic. Hiii-lariously poor customer service. WTF? How can someone be so miserable around delicious desserts? \n\np.s. I p/u'd an ass-load of assorted cupcakes in January (for a party, geez) and the counter guy was nice to me. I don't remember his name but I haven't seem him since. Cupcake guy, where ever you are now, I wish you a happy, contented and peaceful life.", "rating": 3, "date": "2008-04-08"}, {"excerpts": ["Nice little bakery, with a combination of Jewish yummies (hamantashens, rugelach, and challah) and cupcakes. ", "Everything was very fresh, tasty, and cute. "], "author": "Andrew K.", "review": "Nice little bakery, with a combination of Jewish yummies (hamantashens, rugelach, and challah) and cupcakes. Everything was very fresh, tasty, and cute. My morning bun tasted like a buttery and moist pastry version of cinnamon toast crunch. Methinks the owner went to my little, funky, undergrad alma mater.", "rating": 4, "date": "2008-11-30"}, {"excerpts": ["Everything I've had from here is soooo good -- from the challah (they come in dinner roll format, too!) ", "to the cakes to the scrumptious morning pastries... it's a good thing that I am too lazy to go that far most mornings, or I'd be in trouble!\r\n\r\n", "UPDATE:  ", "I recently had an occasion to sample one of their cupcakes... ", "DAMN, that's some good cake.  ", "And frosting.  ", "Excellent frosting.  ", "A little pricey but an excellent size (read: too large and therefore highly caloric)."], "author": "Nat K.", "review": "Everything I've had from here is soooo good -- from the challah (they come in dinner roll format, too!) to the cakes to the scrumptious morning pastries... it's a good thing that I am too lazy to go that far most mornings, or I'd be in trouble!\r\n\r\nUPDATE:  I recently had an occasion to sample one of their cupcakes... DAMN, that's some good cake.  And frosting.  Excellent frosting.  A little pricey but an excellent size (read: too large and therefore highly caloric).", "rating": 4, "date": "2006-01-29"}, {"excerpts": ["Oh, oh, and they sell challah bread!  ", "I am so going back to get some!\n", "_", "_", "_"], "author": "Sooj O.", "review": "Today is the first day I haven't eaten fried food since Wednesday, so I thought I could get a cupcake.  Unfortunately, Ritual didn't have the chocolate cupcake with salty fudgy frosting, so I yelped cupcakes and decided on Noe Valley Bakery and Bread Company as the closest high ranking cupcakery near me.\n\nI got the vanilla cupcake.  Butter frosting.  I am not a fan of butter frosting...I like sour cream frosting and cream cheese frosting, and cream frosting...but not butter frosting.  I think it's too hard and doesn't go well with the soft crumbly goodness of cake. \n\nBut....I also got a loaf of their double raisin bread, thinking I would eat some tomorrow.  Well, of course I wanted to try just a bite, just a tiny little taste.  I haven't been able to stop eating it since that first bite.  I think there's a whole box of raisins in the loaf.  And I am not even a huge fan of raisins...but it's really good in this loaf.  It's divine... and the bread is...moist?  I don't know how else to describe it.\n\nSo, not the cupcake I wanted, but an unexpected raisin pleasure. \nOh, and the guy at the cash register was so nice.  \nGuy: What would you like?\nMe: Hmmm...Vanilla cupcake\nGuy: Will that be it?\nMe: Oh, wait, the double raisin loaf.\nGuy: That will be all?\nMe: Oh, and a small coffee as well.\n(all this while the line behind me gets longer and longer).\n\nMe...afflicted with inability to make up my mind before I get to the cash register....\n\nOh, oh, and they sell challah bread!  I am so going back to get some!\n________\n\nUpdate:\n\nSince Steph P. is a cupcake fanatic, I decided to join her for an evening of chatting and cupcaking.  I will let her review her eats.  However, I will mention the Hostessy chocolate cupcake with a cream filling as being moist and obliterating the memory of the vanilla cupcake with the butter frosting. \n\nBut, I am still more enthralled by their breads.  They had the most delicious Asiago Cheese Bread...crusty cheese exterior...and a core of Asiago Cheese enlivening the delicious bread.  While we walked over to Ritual to partake of coffee and cupcakes, we managed to devour most of the Asiago Cheese Bread.  \n\nSteph was saying that she wished she could toast the bread.  Over the next couple of mornings, I toasted the little bit of bread leftover.  Very delicious toasted.  For those who don't plan to devour a large loaf of cheese bread quickly, they also sell Asiago Cheese rolls.", "rating": 5, "date": "2007-03-31"}, {"excerpts": ["I love the baked goods, from the cupcakes to the challah, at Noe Valley Bakery ", "but I just wish the service could be friendlier.  ", "I appreciate the quality of the food and I guess the price goes with the territory but a smile from the staff would be nice. ", "It seems the counter people get grumpier and grumpier each time. ", "I guess they think this fat girl doesn't need to eat anymore cupcakes. ", ":P"], "author": "just d.", "review": "The chocolate mousse cake is my favorite. The chocolate ganache exterior is smooth, chocolatey, with just the right amount of chocolate richness. The chocolate sponge is moist and the chocolate mousse is just perfect; a little bite of heaven each time.\n\nThe Lemon Drop Cupcake (w/the Bumble Bee) has the most delicious lemon custard and yummy frosting.  Don't pass up the Chocolate-Caramel-Fleur del Sel, it has a perfect balance of flavors (yes, salt).  At $2.75 and up, these cupcakes are less expensive then some other Bay Area bakeries but why do all these darn cupcakes have to look so cute and cost so much?  But to save $$$ I'll pass on the Red Velvet cupcake, Noe Valley Bakery needs to work on the flavor and texture of it.  \n\nI love the baked goods, from the cupcakes to the challah, at Noe Valley Bakery but I just wish the service could be friendlier.  I appreciate the quality of the food and I guess the price goes with the territory but a smile from the staff would be nice. It seems the counter people get grumpier and grumpier each time. I guess they think this fat girl doesn't need to eat anymore cupcakes. :P", "rating": 4, "date": "2009-11-20"}, {"excerpts": ["I've been obsessed with their challah for years.  ", "I've gone to Noe Valley Bakery, on 24th Street or at the Ferry Plaza, since they opened.  ", "I love, love, love their breads, especially their challah and the chocolate cherry bread.\n\n", "But the challah, I think it's the best I've ever had.  ", "I've been on a quest to make challah ", "that's even a smidge close to theirs, but I haven't been successful yet.  ", "I dream of their challah.  ", "It's a good excuse to drive into the city.  ", "Really."], "author": "Melinna G.", "review": "I've been obsessed with their challah for years.  I've gone to Noe Valley Bakery, on 24th Street or at the Ferry Plaza, since they opened.  I love, love, love their breads, especially their challah and the chocolate cherry bread.\n\nBut the challah, I think it's the best I've ever had.  I've been on a quest to make challah that's even a smidge close to theirs, but I haven't been successful yet.  I doubt I ever will, I'm not a good baker. \n\nI dream of their challah.  It's a good excuse to drive into the city.  Really.", "rating": 5, "date": "2009-03-11"}, {"excerpts": ["I like to get their Apricot Ginger and Cinammon Challah breads, not to mention the Brioche which is almost impossible to find in most bakeries. ", "They also have these tiny litle fruit tarts that you can simply pop whole into your mouth....buy several. ", "The scones are nice and moist, not dry like some that I've had. ", "Can you tell that I have not had a disappointing thing here?\n", "update: scored the last Red Velvet and tried the Fleur de Sel lemon cupcake, that at first taste seemed like a simple white cake with frosting, but took a whole other turn when I got to the lemony surprise in the center. ", "The guy behind the counter seemed really annoyed if you didn't know what you wanted before you even got to the counter.  ", "Yes, you read right. ", "Minus one star."], "author": "Arlene C.", "review": "I am so glad this place is far enough away that I only indulge once in awhile. I like to get their Apricot Ginger and Cinammon Challah breads, not to mention the Brioche which is almost impossible to find in most bakeries. They also have these tiny litle fruit tarts that you can simply pop whole into your mouth....buy several. The scones are nice and moist, not dry like some that I've had. Can you tell that I have not had a disappointing thing here?\nupdate: scored the last Red Velvet and tried the Fleur de Sel lemon cupcake, that at first taste seemed like a simple white cake with frosting, but took a whole other turn when I got to the lemony surprise in the center. The guy behind the counter seemed really annoyed if you didn't know what you wanted before you even got to the counter.  Yes, you read right. Minus one star.", "rating": 3, "date": "2007-05-14"}, {"excerpts": ["But even better than that is their challah. ", "The cinnamon one is delicious to make french toast out of. ", "Yum. ", "Also the frozen cookie dough is good. ", "For some reason the few times I got a cookie there ", "it had a strange taste to it. ", "I was a little hesitant to try the dough, but what the hell. ", "The ones I baked at home tasted just fine, so hooray! ", "Also, the dough seems to last a few weeks just in the fridge, so this also made me happy."], "author": "gabby m.", "review": "Yep, yep, gimme some of those cupcakes. But even better than that is their challah. The cinnamon one is delicious to make french toast out of. Yum. Also the frozen cookie dough is good. For some reason the few times I got a cookie there it had a strange taste to it. I was a little hesitant to try the dough, but what the hell. The ones I baked at home tasted just fine, so hooray! Also, the dough seems to last a few weeks just in the fridge, so this also made me happy.", "rating": 5, "date": "2007-06-18"}, {"excerpts": ["Aside from cakes and pies, they have yummy breads (try the challah) and pastries like ruggelach.\n\n"], "author": "Gary B.", "review": "I feel SO lucky to be living within walking distance of Noe Valley Bakery.  Anything I have bought there is beyond delicious.  Our entire family would happily live all summer on their outstanding strawberry rhubarb pie.  What I especially love about NVB is how it is not focused on sugar.  Aside from cakes and pies, they have yummy breads (try the challah) and pastries like ruggelach.\n\nI agree that they can, on occasion, hire someone whose doesn't completely get customer service.  But, those people usually don't last.  And when you need something special, if the counter person can't come up with a solution, one of the owners will.  I needed a flourless birthday cake for my wife and wanted one of the delicious chocolate cakes they make for Passover.  The counter people told me no go.  But, when I asked Mary, she told me why that was tough.  But, she could and did make a delicious flourless fruit torte.  It was great.  My wife was happy.", "rating": 5, "date": "2009-06-12"}, {"excerpts": ["They have the best challah in SF (even if no one who works there can pronounce it - say it with me people CHallah; not holla, not chola. ", "CHA-lah!)"], "author": "Melissa Y.", "review": "They have the best challah in SF (even if no one who works there can pronounce it - say it with me people CHallah; not holla, not chola. CHA-lah!)", "rating": 5, "date": "2008-03-25"}, {"excerpts": ["Great challah and breads.  ", "And their chocolate chip cookies are to die for."], "author": "B B.", "review": "Everything is delicious.  They have perfect pasteries.  Great challah and breads.  And their chocolate chip cookies are to die for.", "rating": 5, "date": "2006-01-03"}, {"excerpts": ["Everything is fresh and delicious, and they make challah for shabbat and flourless for passover baked goods that work for my family events, and will pipe a cross and write Dios Bendiga on a cake for my husband's, perfect. ", "Noe Valley Bakery has never let me down.  ", "ok, once they let me down, they mixed up my cupcake order for my nieces ", "double first communion ", "and I was all the way in the East Bay before I figured it out ", "and it was too late to fix it.  ", "But that was the only time ", "and I have been using them for years.  ", "They were totally sweet, totally credited me for the wrong cupcakes and I have not had a problem since.  ", "These things happen (I shoulda checked all of the boxes, but we were running behind) and it says a lot how they handled it, so I'm hearting them more than ever."], "author": "Shona M.", "review": "Great for when you need a high quality sheet cake or cupcakes for an event, and like me, you just don't believe in crisco frosting, but can't afford Kara's cupcakes for your husband's 100 plus cousins.   Everything is fresh and delicious, and they make challah for shabbat and flourless for passover baked goods that work for my family events, and will pipe a cross and write Dios Bendiga on a cake for my husband's, perfect. Noe Valley Bakery has never let me down.  ok, once they let me down, they mixed up my cupcake order for my nieces double first communion and I was all the way in the East Bay before I figured it out and it was too late to fix it.  But that was the only time and I have been using them for years.  They were totally sweet, totally credited me for the wrong cupcakes and I have not had a problem since.  These things happen (I shoulda checked all of the boxes, but we were running behind) and it says a lot how they handled it, so I'm hearting them more than ever.", "rating": 4, "date": "2008-11-22"}, {"excerpts": ["I love all of their baked goods, especially their cupcakes and challah rolls. ", "I'm so lucky to live in a neighborhood where I can stroll down the street and pick up a fresh baguette every morning from a bakery this good, and owned by a local couple too!"], "author": "T W.", "review": "Delicious! I love all of their baked goods, especially their cupcakes and challah rolls. I'm so lucky to live in a neighborhood where I can stroll down the street and pick up a fresh baguette every morning from a bakery this good, and owned by a local couple too!", "rating": 4, "date": "2007-10-29"}], "chocolate cherry": [{"excerpts": ["They make an amazing chocolate cherry bread.\n"], "author": "Veronica M.", "review": "One of the best bakeries in San Francisco.  \n\nThey make their own version of Hostess cakes...called \"Most-est\" cupcakes.\nThey make their own version of Oreo's...called \"Noe-os.\"\nThey have a \"daily bread.\"\nThey make an amazing chocolate cherry bread.\nThey make amazing challah bread.  \nThey do amazing cakes.  \nMuffins.  Cupcakes.  Morning buns.  Sticky Buns.  Hot Cross Buns for Lent.\nI love the pignolis & rugelach.\n\nI've had them all & they never disappoint.\n\nI called in an order for 2 dozen hot cross buns for Good Friday.  I wasn't sure they'd be able to fulfill it the same day, but they did!\n\nThe challah bread is exceptional.  It is especially great to make french toast with.  And days later as regular toast, it's still soft & chewy.\n\nThey're now doing cookie & scone dough for you to take & bake at home.\n\nA gem of Noe Valley.\n\n5 stars.", "rating": 5, "date": "2015-04-12"}, {"excerpts": ["The chocolate cherry Sunday only loaf ($5.95) was OVER THE TOP and toasted with butter and nutella, well it should be a crime.\n "], "author": "Adria D.", "review": "Good god this place is pure heaven! I was almost late to my flight because I HAD to bring back baguettes from here. I had them a few days prior and had not stopped dreaming of them, they were THAT GOOD. The seeded baguettes are the best I have ever had. I would not lie to you. The caramelized onion baked right into them surprised yet delighted me it was like a little bonus treasure inside! ($2.85)\n\nI am so glad I don't live close to here because the baguettes were not the only thing to die for...the cheddar chive scones will make you stab someone if they  tried to sneak a bite. I can only imagine how good they would be for a breakfast sammy or with gravy! *drool*\nThe croissant ham and cheese ($4) and heirloom tomato pizza thingy's were flaky buttery slabs of croissant pizza heaven!! The chocolate cherry Sunday only loaf ($5.95) was OVER THE TOP and toasted with butter and nutella, well it should be a crime.\n I still have a blueberry pecan scone and oatmeal cookie to eat at home in the freezer. OH they have the dough's to take home in the freezer too!!\n\nI ALSO had the pumpkin cream cheese loaf i took it to a friends house. It was OK but it didn't really amaze me like everything else did. (womp womp, win some loose some).\n\nThe smell of my hot baguettes on the bart and airplane tortured everyone in a 10 foot radius. I had to guard them with my life, but we made it home. I have since devoured one with a hunk of brie from venissimo. OK diet starts tomorrow...or after that cookie and scone...", "rating": 5, "date": "2014-10-13"}, {"excerpts": ["We also split one chocolate cherry rugelach. "], "author": "Amanda G.", "review": "My mother-in-law requested we bring \"some kind of artisan, sourdough type bread\" to her most recent family get together. \nSo, since we were going to be in this neighborhood the day before, we decided to buy a couple loaves from here. \n\nWe purchased: whole wheat sourdough, and challah. \nSadly, the whole wheat sourdough wasn't anything special. I actually was pretty disappointed with it. \nSo why the 4 stars you might ask... \nThe challah was AMAZING!!!! The best I've had in I don't know how long, and definitely the best I've had on this coast. \nIt was perfection in every way:) \n\nWe also split one chocolate cherry rugelach. While it wasn't the same as NY rugelach, it was still very tasty! \n\nThere were numerous tempting items in the case, but I held back. \n\nNext time I'm\"m in the neighborhood, I'll definitely be stopping here.", "rating": 4, "date": "2009-10-20"}, {"excerpts": ["The chocolate cherry bread is wonderful also.\n\n"], "author": "Marco M.", "review": "This place is fantastic. Why is it when I'm not supposed to eat gluten I find all these fantastic bakeries? Why?\n\nTheir apricot bread is sublime - more apricots than bread. The chocolate cherry bread is wonderful also.\n\nMy wife loves their rugalach.\n\nNever had anything I didn't like from them - my only complaint is that they stopped distributing in the East Bay - but it makes me find them at the Farmer's Market - they are worth the trek.", "rating": 5, "date": "2008-05-30"}, {"excerpts": ["I really like the chocolate cherry rugelach. ", "Tried their chocolate cherry bread too - even better, if you have a sweet tooth. ", "I think I've tried a cupcake here before, and that was pretty decadent. ", "Overall, cute, dependable, high quality neighborhood bakery!"], "author": "Carol L.", "review": "I really like the chocolate cherry rugelach. Lots of chocolate and cherries piled in the pastry, and for a decent price too!\n\nI tried their fig bread - really good. Tried their chocolate cherry bread too - even better, if you have a sweet tooth. I think I've tried a cupcake here before, and that was pretty decadent. Overall, cute, dependable, high quality neighborhood bakery!", "rating": 4, "date": "2010-12-21"}, {"excerpts": ["My girlfriend and I raced back home from Union Square one Sunday night not too long ago to indulge our chocolate cherry rugalech addiction.  ", "To our horror we arrived too late and the bakery had already closed for the night.  ", "We staggered home and recoiled on the couch in despair.  ", "Moments later he returned with an enormous smile and a large paper bag containing five loaves of chocolate cherry bread.  ", "We hadn't realized such a miraculous thing existed.  ", "We felt that five loaves would be indulgent and after a bit of haggling with the generous baker we were able to negotiate that three loaves would be sufficient.  ", "But the chocolate cherry rugalech are truly extraordinary."], "author": "ariel b.", "review": "My girlfriend and I raced back home from Union Square one Sunday night not too long ago to indulge our chocolate cherry rugalech addiction.  To our horror we arrived too late and the bakery had already closed for the night.  We staggered home and recoiled on the couch in despair.  Hours later, after we had recovered from our grief we decided to take a walk down 24th st back to the bakery to at least feel the aura of the chocolate, the cherries and the dough.\n\nWhen we arrived at the bakery we noticed a light on in back and a baker preparing dough.  Despite a moment of hesitation we decided to knock on the window to see if we could somehow still salvage the evening with our cherished rugalech.  The baker came to the door, and we explained to him our plight.  After listening attentively to our story, he told us to wait and disappeared in back.  Moments later he returned with an enormous smile and a large paper bag containing five loaves of chocolate cherry bread.  We hadn't realized such a miraculous thing existed.  We felt that five loaves would be indulgent and after a bit of haggling with the generous baker we were able to negotiate that three loaves would be sufficient.  We thanked the baker, returned home, rejoiced, and devoured the bread.\n\nI believe noe valley bakery bakes items that do not contain chocolate and cherries.  They're probably terrific.  But the chocolate cherry rugalech are truly extraordinary.", "rating": 5, "date": "2006-02-28"}, {"excerpts": ["The chocolate cherry bread is heavenly, and the double raisin bread is to die for.  ", "They tend to run out of the raisin bread ", "so I recommend that you call a day ahead and have them reserve a loaf for you.  ", "You will need to give them a credit card to hold the loafs.  ", "This place is so great ", "I almost don't want to post because I don't want longer lines!"], "author": "Michelle T.", "review": "I LOVE noe valley bakery.  The chocolate cherry bread is heavenly, and the double raisin bread is to die for.  They tend to run out of the raisin bread so I recommend that you call a day ahead and have them reserve a loaf for you.  You will need to give them a credit card to hold the loafs.  This place is so great I almost don't want to post because I don't want longer lines!", "rating": 5, "date": "2011-11-13"}, {"excerpts": ["I love their chocolate cherry rugelach and am oh so intrigued by their frosted pumpkin bread. ", "Their Almond Croissant was very disappointing but overall they are a decent bakery. "], "author": "Natalie G.", "review": "Not bad..not bad at all. I love their chocolate cherry rugelach and am oh so intrigued by their frosted pumpkin bread. Their Almond Croissant was very disappointing but overall they are a decent bakery. I hear their cupcakes and tarts are the thing to try so next time I will come in for one of each and some of their CC rugelach.\n\nNote* - don't expect it to be your typical jewish rugelach..cos it really isn't.. but whatever it is..it's awesome", "rating": 4, "date": "2007-08-30"}, {"excerpts": ["I love, love, love their breads, especially their challah and the chocolate cherry bread.\n\n"], "author": "Melinna G.", "review": "I've been obsessed with their challah for years.  I've gone to Noe Valley Bakery, on 24th Street or at the Ferry Plaza, since they opened.  I love, love, love their breads, especially their challah and the chocolate cherry bread.\n\nBut the challah, I think it's the best I've ever had.  I've been on a quest to make challah that's even a smidge close to theirs, but I haven't been successful yet.  I doubt I ever will, I'm not a good baker. \n\nI dream of their challah.  It's a good excuse to drive into the city.  Really.", "rating": 5, "date": "2009-03-11"}, {"excerpts": ["I have friends, who will fight people over the chocolate cherry rugala"], "author": "Niki M.", "review": "I have friends, who will fight people over the chocolate cherry rugala", "rating": 4, "date": "2006-06-15"}, {"excerpts": ["chocolate cherry bread is heaven.  ", "and it's vegan!  ", "it is like bread and delicious ", "had a baby and named her dessert.  ", "not much else for vegans (except the yum baguettes and yum fig bread) but seriously.  ", "what else do you need?"], "author": "Laura B.", "review": "chocolate cherry bread is heaven.  and it's vegan!  it is like bread and delicious had a baby and named her dessert.  not much else for vegans (except the yum baguettes and yum fig bread) but seriously.  what else do you need?", "rating": 5, "date": "2006-03-07"}], "seeded levain  th anniversary bread": [], "sour wheat levain": [], "loaded baked potato": [], "twice baked almond croissant": [{"excerpts": ["I have got the twice baked almond croissant. ", "Flaky on the outside with almond sprinkled on top ", "and I could taste the almond-y pasta in the middle!Flavourful and delicious! ", "Will def go back!"], "author": "Ava A.", "review": "I have got the twice baked almond croissant. Flaky on the outside with almond sprinkled on top and I could taste the almond-y pasta in the middle!Flavourful and delicious! Will def go back!", "rating": 5, "date": "2018-06-22"}, {"excerpts": ["Must try pastries:\n- Kouign Amann\n- Twice Baked Almond Croissant \n- Any of the ham/apple/feta tarts\n\n"], "author": "Margaret K.", "review": "Everything that comes out of this place is amazing. I definitely recommend this over Tartine to be honest, the line there is not worth it! \nSometimes there can be a small line at Noe Valley Bakery, but trust me it's always worth it.\n\nMust try pastries:\n- Kouign Amann\n- Twice Baked Almond Croissant \n- Any of the ham/apple/feta tarts\n\nMust try cupcakes:\n- Moistest\n- Bavarian cream filled cupcake \n\n*Their pound cake is also really good and not too sweet/heavy. \n\nEnjoy!!!", "rating": 5, "date": "2017-03-03"}], "ham tart": [], "fruit slab": [{"excerpts": ["I had a fruit slab which was made with flaky, fresh pastry with tart strawberry, rhubarb, and sweet cream in the center. "], "author": "Maya S.", "review": "All kinds of baked goods here including breads, cookies, cupcakes, macarons, pastries, and cakes which sure looked mighty fine. I may have to order one for an event in the future. I had a fruit slab which was made with flaky, fresh pastry with tart strawberry, rhubarb, and sweet cream in the center. I also had the milky way bombe which was decadent but not overly sweet and rich as I was expecting. It definitely tasted like the milky way chocolate bar and had some crunchies at the bottom of the bombe for texture. The cream inside was just lovely. I stopped by on a weekend morning and the line was non-stop but it moved quickly.", "rating": 5, "date": "2014-03-21"}], "savory slab": [{"excerpts": ["My favorite things from this bakery:\n\nTcho chocolate bun\nBrown butter blueberry muffin \nSavory slab of mushroom, creme fraiche, shallots\nFresh fruit tart \nSea salt caramel cupcake\nBrown butter salty cookie \nBrownies (super rich!)\n"], "author": "Laura T.", "review": "Cute little bakery shop in Noe Valley. Since I'm in the neighborhood frequently, once in awhile I like to make a stop. My favorite things from this bakery:\n\nTcho chocolate bun\nBrown butter blueberry muffin \nSavory slab of mushroom, creme fraiche, shallots\nFresh fruit tart \nSea salt caramel cupcake\nBrown butter salty cookie \nBrownies (super rich!)\nSalted caramel macarons (by Tous)\nCheesecake topped with raspberries \nStrawberry cake \nAsiago bread \n\nThey also have a honey milk tea that's really comforting. And they serve sight glass coffee. One star off because they keep adding a price increase. As if the stuff isn't already pricey!", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["I'm currently obsessed with their savory slab (with the heirloom tomatoes) and their blueberry muffins. "], "author": "Eliza C.", "review": "I love this bakery! The staff is always very helpful, and they get to their customers as quickly as they can when the line is long. \n\nI'm currently obsessed with their savory slab (with the heirloom tomatoes) and their blueberry muffins. Their new line of teas are also very light and refreshing. \n\nNeedless to say, I will definitely be back there soon!", "rating": 5, "date": "2014-07-30"}], "morning bun": [{"excerpts": ["It is the most addictive thing ever, along with the morning bun. ", "In the morning the line can be long, but after 11 seem to be ok. ", "The girls and boy behind the counter are very friendly. "], "author": "Cory T.", "review": "I repeat don't, what ever you do buy the M&M cookie! It is the most addictive thing ever, along with the morning bun. In the morning the line can be long, but after 11 seem to be ok. The girls and boy behind the counter are very friendly. I also recommend the red velvet cupcake!", "rating": 5, "date": "2017-10-05"}, {"excerpts": ["And then there's the morning bun - light and just a little sweet and cinnamon. "], "author": "Wendy L.", "review": "I've always known and thought of Noe Valley Bakery for its fruit tarts which are a family favorite. The fruit tart is delicious - flaky crust, light custard topped with tons of berries. \n\nI'm not sure why I never stopped for the pastries but they have become an unfortunate dependence for me. It first started with the ham and cheese tart which is really like a ham and cheese croissant - flaky, buttery and just the right mix of cheesy and ham-y. And then there's the morning bun - light and just a little sweet and cinnamon. I can never decide - sweet or savory - so I will sometimes get both because I just can't decide. \n\nBeyond the tart, pastries, beautiful cakes, they have all sorts of cute cupcakes and adorable petit fours. The people who work at the bakery are incredibly friendly and the line moves quickly.", "rating": 4, "date": "2016-01-04"}, {"excerpts": ["I ended up getting an eclair and one of those morning bun thingy. ", "The eclair was good but nothing really that special. ", "I had no idea what a morning bun is other than it looking like a sugar-coated hipster cinnamon bun, which made me feel totally underground when I took that first bite."], "author": "Ian L.", "review": "I had walked by this place multiple times during the week I was in the area and each time I was either not in the mood for baked goods or when I was the place was closed already. After some extensive research, I found out that if I go there during their hours of operation, I could get something that I could eat later. These are the kind of hard hitting analytical skills I learned in grad school.\n\nI ended up getting an eclair and one of those morning bun thingy. The eclair was good but nothing really that special. I had no idea what a morning bun is other than it looking like a sugar-coated hipster cinnamon bun, which made me feel totally underground when I took that first bite.", "rating": 4, "date": "2014-05-31"}, {"excerpts": ["My current personal favorites: almond croissant, the morning bun, and for lunches, the multi-grain sliced bread.  ", "Wow."], "author": "Eric S.", "review": "When I lived in my last apartment in Nob Hill, I remember once waking up and thinking, \"this day calls for a danish.\"  Getting out of bed and Yelping, I also recall settling for a bowl of Kix after my call for danish in Nob Hill went unanswered.\n\nNow in Noe Valley, oh man, did I ever hit the danish jackpot.  Just a few blocks from my house stands the Noe Valley Bakery where one will find not only danish (cheese, blueberry and more), but morning buns, muffins, scones, cookies, cupcakes, pies, cakes, croissants, tarts, baguettes, sliced bread, take-and-bake cookie dough and I'm sure dozens of other treats I'm missing.  After sampling a large percentage of their inventory, I can personally vouch for everything being delicious. \n\nMy current personal favorites: almond croissant, the morning bun, and for lunches, the multi-grain sliced bread.  Wow.", "rating": 5, "date": "2010-12-15"}, {"excerpts": ["Then got the morning bun because it looked a lot less heavy and just more gentle than the typical morning buns I see. ", "(La Farine and Starbucks I'm looking at you) ", "Really, morning buns are amazing. ", "It's like the beautiful lovechild of a croissant and a cinnamon bun. ", "Speaking of love, they also have love buns which sound like morning buns with cream in them. ", "They're a little uglier though ", "so I refrained. ", "Anyway NVB's morning bun is arguably the best I've ever had.  \n\n"], "author": "Lydia W.", "review": "I came into this bakery with a guarded heart as I am forbidden to eat chocolate for the next few weeks and for me, any bakery visit is incomplete without leaving with some chocolate-goody in hand. On the bright side, I am now free to explore all the baked goods that I was once so closed off to in the past! \n\nThe fruit tart caught my eye so I got a mini-one. Getting a regular sized one is just dumb because it totally limits you from sampling more pastries. It was fantastic. A little tart packed with berries! So good. Beware of the falling blueberry though. \n\nThen got the morning bun because it looked a lot less heavy and just more gentle than the typical morning buns I see. (La Farine and Starbucks I'm looking at you) Really, morning buns are amazing. It's like the beautiful lovechild of a croissant and a cinnamon bun. Speaking of love, they also have love buns which sound like morning buns with cream in them. They're a little uglier though so I refrained. Anyway NVB's morning bun is arguably the best I've ever had.  \n\nWe also got a hot cross bun because we'd never tried it before. It was my favorite thing even though I hate raisins. The nuts and raisins bring contrasting textures to the hot cross bun eating process. Whether or not this is pleasing is questionable.\n\nWish I tried their cupcakes! Next time. \n\nOh and they only serve sandwiches on the weekdays.", "rating": 4, "date": "2011-03-14"}, {"excerpts": ["Also grabbed a morning bun, which was perfectly flaky with a soft center and the most exquisite dusting of sugar & cinnamon to easily make it the best I've had.  ", "Final purchase was a loaf of pumpkin bread, so dense, and topped with the proper cream cheese ratio.  ", "(Yeah, that was my dairy-free item because I figured she could scrub the cheese off.  "], "author": "Charla W.", "review": "Went in at about 9 AM on a Tuesday to pick up some goodies for my boss' birthday brunch.  The young lady working the counter was gracious in dealing with my questions about what items were dairy-free, referencing the ingredients list for the few queries I had.  (Although I do have to admit that I think if you work in an establishment that carries baked goods, you should have some idea of what is wheat or dairy free.)  \n\nJust moments later walked out with a cherry coconut ginger scone -- outstanding and they even sell the frozen dough there so you could bake at home.  Also grabbed a morning bun, which was perfectly flaky with a soft center and the most exquisite dusting of sugar & cinnamon to easily make it the best I've had.  Final purchase was a loaf of pumpkin bread, so dense, and topped with the proper cream cheese ratio.  (Yeah, that was my dairy-free item because I figured she could scrub the cheese off.  Nice of me, no?)\n\nAll the items were way above average and the young lady threw in a free rainbow candle for the birthday boss.  I must go back soon!  Sorry Arizmendi but Noe Valley Bakery is on the way to work.", "rating": 5, "date": "2010-03-23"}, {"excerpts": ["UPDATE 9/1/07: After years of resistance, I finally grabbed a 'Morning Bun' AFTER heading for work. ", "Now the wifey and I are addicted. ", "It's absolutely perfect - light as a doughnut even though it is baked, with cinnamon and sugar sprinkled throughout its soft flakey layers. "], "author": "Andy R.", "review": "UPDATE 9/1/07: After years of resistance, I finally grabbed a 'Morning Bun' AFTER heading for work. Now the wifey and I are addicted. It's absolutely perfect - light as a doughnut even though it is baked, with cinnamon and sugar sprinkled throughout its soft flakey layers. The 'Honey Bun' is similar, but with a super rich cream filling inside. \n\nThis is why I resisted for so long, because I'd be hocking all YOUR stuff to get my morning fix. Laura B. is gonna cry her eyes out when she comes home to an empty curio cabinet...porcelain puppies = the new Google IPO! You heard it here first!\n\nYou get what you pay for in this neighborhood shop. I plunked down my 2 bills for their 'Most-est Cupcake' to go with my Peet's (they serve that, too). It had the curly-loopy squiggle like the one in my 'Hong-Kong Phooey' lunchbox. That's where the similarity ends.\n\nThe moist chocolate cake has a genuine chocolate 'burn' to it. Inside, real, fresh Bavarian cream (not that yellow donut shop goo) coats everything in your mouth! If really nostalgic, you can even peel off the frosting cap and let it melt in your mouth separately. More flavor with none of the parafin!\n\nIt's so good you could punch me in the mouth and I'd just smile at you like Snoopy after a hockey game.\n\nAny concerns about spending a few extra quarters here are quelled by their VANLOADS of baked goods to homeless shelters and soup kitchens around the holidays.", "rating": 5, "date": "2006-04-09"}, {"excerpts": ["The sumptuous morning bun can be eaten even when it's NOT morning time!  "], "author": "Kristina R.", "review": "FIVE STARS!  And here's why...\n\n1. They are a small, independent local neighborhood store.\n\n2.  They are generous during the holiday season and donate tons of pies and goodies to shelters in S.F. (so nice!)\n\n3.  The chocolate cupcake filled with Bavarian creme...arrrgh...it's sooo tasty.  \n\n4.  The (vegan) cherry chocolate bread is just about the best thing ever invented by man.  I ate a whole loaf in one sitting...and I'm TOTALLY OK with that.\n\n5.  The sumptuous morning bun can be eaten even when it's NOT morning time!  WOO!\n\nThey have luscious pastries, cakes, tarts and breads, and the delicious scent of freshly baked goods floats onto 24th street every morning...I love bakeries, though...so I'm a little biased.", "rating": 5, "date": "2006-03-31"}, {"excerpts": ["My morning bun tasted like a buttery and moist pastry version of cinnamon toast crunch. ", "Methinks the owner went to my little, funky, undergrad alma mater."], "author": "Andrew K.", "review": "Nice little bakery, with a combination of Jewish yummies (hamantashens, rugelach, and challah) and cupcakes. Everything was very fresh, tasty, and cute. My morning bun tasted like a buttery and moist pastry version of cinnamon toast crunch. Methinks the owner went to my little, funky, undergrad alma mater.", "rating": 4, "date": "2008-11-30"}, {"excerpts": ["I really like the morning bun, and the carrot cake cupcake ", "it fingerlickin' good. ", "They do have red velvet ones, but I don't understand what all the fuss is about because all it is is white cake DYED red! ", "Anyone could make them, but they make some of the best cream cheese frosting around."], "author": "Stephanie P.", "review": "In one word: consistent.\n\nThe cheddar cheese and chive scone is rockin. The cheese croissant also kicks ass. I really like the morning bun, and the carrot cake cupcake it fingerlickin' good. They do have red velvet ones, but I don't understand what all the fuss is about because all it is is white cake DYED red! Anyone could make them, but they make some of the best cream cheese frosting around.", "rating": 4, "date": "2009-04-28"}, {"excerpts": ["Their morning buns and love buns (imagine a hollow morning bun with some pastry cream filling).  ", "If you're in the area and are hesitant on committing to an order of a half dozen of their cupcakes (which I find yummy, but nothing I couldn't get better elsewhere), I would recommend getting a couple of Noe-os to munch on.   ", "The real gems here are their non-cupcake pastries!!!  ", "I'll be definitely coming back for more Noe-os tomorrow..."], "author": "Ben T.", "review": "Omg...I woke up dreaming about their lemon tarts and Noe-os and may have gone here three times in one week.  Their morning buns and love buns (imagine a hollow morning bun with some pastry cream filling).  If you're in the area and are hesitant on committing to an order of a half dozen of their cupcakes (which I find yummy, but nothing I couldn't get better elsewhere), I would recommend getting a couple of Noe-os to munch on.   The real gems here are their non-cupcake pastries!!!  I'll be definitely coming back for more Noe-os tomorrow...", "rating": 5, "date": "2010-11-16"}, {"excerpts": ["Minus one star for the other stuff I've tried such as morning bun, quiche and Mexican wedding cookie.  ", "They were all right but nothing to write home about.  ", "And yes...like the other reviewers have stated the service can be quite rude so if you go, be prepared."], "author": "Remus L.", "review": "Best sticky bun that I've had in the city.  Gooey, caramely, buttery goodness...yum!  Cookies, scones, and cupcakes are pretty good as well.  \n\nMinus one star for the other stuff I've tried such as morning bun, quiche and Mexican wedding cookie.  They were all right but nothing to write home about.  And yes...like the other reviewers have stated the service can be quite rude so if you go, be prepared.", "rating": 4, "date": "2008-03-03"}, {"excerpts": ["However, I didnt feel like eating cupcakes for breakfast for that day and I got a morning bun instead. ", "Prices are reasonable and they have a large selection of pastries. ", "I think I went on a Sunday morning around 8 or 9 am and there was no crowd whatsoever."], "author": "Retired B.", "review": "I have heard good things about this bakery, especially that their lemon cupcake is fantastic. However, I didnt feel like eating cupcakes for breakfast for that day and I got a morning bun instead. Prices are reasonable and they have a large selection of pastries. I think I went on a Sunday morning around 8 or 9 am and there was no crowd whatsoever.", "rating": 4, "date": "2009-10-03"}], "bearclaw": [], "babka bun": [], "pound cake": [{"excerpts": ["Their pound cake is also really good and not too sweet/heavy. \n\n"], "author": "Margaret K.", "review": "Everything that comes out of this place is amazing. I definitely recommend this over Tartine to be honest, the line there is not worth it! \nSometimes there can be a small line at Noe Valley Bakery, but trust me it's always worth it.\n\nMust try pastries:\n- Kouign Amann\n- Twice Baked Almond Croissant \n- Any of the ham/apple/feta tarts\n\nMust try cupcakes:\n- Moistest\n- Bavarian cream filled cupcake \n\n*Their pound cake is also really good and not too sweet/heavy. \n\nEnjoy!!!", "rating": 5, "date": "2017-03-03"}, {"excerpts": ["Every week our house hold gets a loaf of their pound cake and it is gone in three days.  \n\n"], "author": "Ryan B.", "review": "All local bakeries rock and the Noe Valley Bakery is following suite. Everyone in there is helpful and super friendly.  The cup cakes are delicious!  Every week our house hold gets a loaf of their pound cake and it is gone in three days.  \n\nI love the shirts that they wear in the store.  \"Shut your Pie Hole\"  Love it.... I ask them all the time if they are for sale and the answer is no!  They will break at some point.  :)", "rating": 5, "date": "2009-03-31"}], "pumpkin bread with cream cheese icing": [], "got milk": [{"excerpts": ["I ordered the Got Milk? ", "cake for my friends birthday a few weeks ago. ", "The online ordering system required at least 48 hours in advance to place the order. ", "I needed a cake the next day "], "author": "Joycelin L.", "review": "Cake was so rich but so so good! \n\nI ordered the Got Milk? cake for my friends birthday a few weeks ago. The online ordering system required at least 48 hours in advance to place the order. I needed a cake the next day so I called the bakery and placed my order over the phone.\n\nPick up was a breeze and my friends and I all enjoyed the cake the next day! Highly recommend!", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["I got the got milk cake for a birthday ", "and it was really good! ", "Super chocolaty, moist, but not super sweet. ", "But that awesome cake came at a $40 price tag. ", "You got about 8 good slices from it, but damn, when did cake get so expensive. ", "I also wanted to try a ton more, but at about 5:30PM, they had run out of most stuff. "], "author": "Eva C.", "review": "This bakery is pretty good! I just wish it wasn't so darn pricey!!\n\nI got the got milk cake for a birthday and it was really good! Super chocolaty, moist, but not super sweet. But that awesome cake came at a $40 price tag. You got about 8 good slices from it, but damn, when did cake get so expensive. I also wanted to try a ton more, but at about 5:30PM, they had run out of most stuff. I ended up getting the blueberry pecan scones to bake at home, about $14/15 dollars for 6 biscuit-sized scones to bake at home. I tried those and they were pretty good, sort of cakey, reminded me of a biscuit. Not the best scone I've ever had, but alright.\n\nI'll be back to try their other goods!", "rating": 4, "date": "2018-02-28"}, {"excerpts": ["It was a \"got milk\" cake, which translates into chocolate on chocolate with chocolate frosting.  ", "THIS WAS AMAZING!!!  "], "author": "Arthur Y.", "review": "Came by here to get a cake for my wife's birthday.  I'm not remotely close to this place, but was by here with another company event.  Small little bakery on a small shopping street in Noe Valley.  \n\nWOW, soooo glad I got the cake!!  It was a \"got milk\" cake, which translates into chocolate on chocolate with chocolate frosting.  THIS WAS AMAZING!!!  One of the better cakes I've had period.\n\nAlso got a \"most-ess\" cupcake which is a clone of the classic hostess chocolate with white swirl across the top and filling inside.  One of the best cupcakes I've had in my life.  The perfect mix of moist cake and marshmellowy cream filling.\n\nThis place is f#%#ing awesome!!", "rating": 5, "date": "2014-12-23"}, {"excerpts": ["'Got Milk' is the best chocolate cake I have ever tasted.  ", "Cookies and scones a delicious as well.  ", "Friendly, helpful staff."], "author": "Tonja D.", "review": "'Got Milk' is the best chocolate cake I have ever tasted.  Cookies and scones a delicious as well.  Friendly, helpful staff.", "rating": 5, "date": "2017-01-30"}, {"excerpts": ["Chocolate mousse cake and 'got milk' chocolate cake are both so good!  ", "8\" $33 and 6\" $28 - was perfect for a friend's baby shower and son's birthday.  ", "It's our 'go to' for cakes now!"], "author": "Jane Y.", "review": "Chocolate mousse cake and 'got milk' chocolate cake are both so good!  8\" $33 and 6\" $28 - was perfect for a friend's baby shower and son's birthday.  It's our 'go to' for cakes now!", "rating": 5, "date": "2014-04-07"}], "strawberry cake": [{"excerpts": ["I was contemplating between the strawberry cake and salted caramel, and I ended up going with salted caramel. ", "The cake design wasn't the prettiest "], "author": "Elle T.", "review": "Walked in yesterday to get cake and cupcakes for two different birthdays! \n\nTheir cake selection wasn't big but simple enough to help you make a decision. I was contemplating between the strawberry cake and salted caramel, and I ended up going with salted caramel. The cake design wasn't the prettiest but oh man it tasted so heavenly. \n\nA small 6\" cake was only $38. Initially I was gonna get a cake from 85C bakery but their cake is average and probably cost about $30, so I thought I'd spend a little bit more for something with more quality in it, and I wasn't disappointed. Everyone loved it and for the first time I saw an entire cake gone within minutes. Oh I also requested the store to write a happy birthday message on the cake and their handwriting was so pretty!\n\nTheir cupcakes were $3.75 each, many of them were chocolate based.\n\nAt the end of the night everyone asked where I got the cake from and they loved it! I'm really happy with my decision to go with a random bakery I saw while walking around Noe Valley.", "rating": 5, "date": "2018-09-30"}, {"excerpts": ["It was a strawberry cake with bavarian cream. "], "author": "Sam M.", "review": "Noe Valley Bakery never disappoints! I had ordered two celebratory cakes from Noe Valley Bakery so far, and both times I was very pleased with the cakes.\n\nThe buche de noel cake looked very well made. The only criticism is that it's a bit too sweet for my taste, but maybe this type of cake is just generally sweeter?\n\nThe baby shower cake was sooooo cute! It was a strawberry cake with bavarian cream. The cake was perfectly moist and not too sweet.\n\nBoth cakes were reasonably priced too, and the lines are not as bad as some other popular bakery in the city.", "rating": 4, "date": "2017-03-29"}, {"excerpts": ["The Strawberry Cake should be outlawed for being a danger to diets EVERYWHERE.  ", "The cake itself melts in your mouth like cotton candy ", "then you're adding this delicious fluffy frosting, cream and fresh strawberries?! ", "Ahh-maz-ing!"], "author": "Kerr T.", "review": "The Strawberry Cake should be outlawed for being a danger to diets EVERYWHERE.  The cake itself melts in your mouth like cotton candy then you're adding this delicious fluffy frosting, cream and fresh strawberries?! Ahh-maz-ing!", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["Called ahead to order the strawberry cake for my auntie's birthday. ", "I would suggest to do so since I swung by one time and they were sold out of everything and there was only 1 cake left available. "], "author": "Julie L.", "review": "Called ahead to order the strawberry cake for my auntie's birthday. I would suggest to do so since I swung by one time and they were sold out of everything and there was only 1 cake left available. The small round and 2 cookies came out to be $45. \n\nThe cookies were for the hubs and they're decently sized. He didn't particularly care for the cookies. The Oatmeal one crumbled and broke as he was taking it out of the bag. The chocolate chip pecan was just ok. I prefer a denser cake so I didn't enjoy the cake as much although everyone else did. They incorporated strawberry cream in between the layers along w/ fresh cut strawberry pieces. Overall, the cake wasn't overly sweet which we appreciated but I can't say it was worth the price. Penmanship on the birthday message was nice.", "rating": 3, "date": "2016-02-17"}, {"excerpts": ["The strawberry cake is not great either, it doesn't know what it wants to be. ", "The cake was flavor-less and the strawberries were a bit old and mushy which ruined the whole experience. ", "I am really bummed that his place is not better. ", "They charge a lot ", "and so I expect a little more than what they are putting out right now.\n  \n ", "Yeah cakes still awful", ", in a pinch had to get a cake and NVB was only choice and $47 for a small cake ", "( four people size)  plus candles is outrageous, and yeah, cake SUCKS !! ", "Overly iced, literally all icing and no cake, sickly sweet and what cake there was was dry cake and just awful. ", "So embarrassed that I served this as a birthday cake ... ", "Never again"], "author": "sasha g.", "review": "Cakes..red velvet is good, carrot is way way over iced which makes it overly sweet and sickly, the cake it's self is nice and moist but I ended up eating around the icing and leaving it all in my plate. The strawberry cake is not great either, it doesn't know what it wants to be. The cake was flavor-less and the strawberries were a bit old and mushy which ruined the whole experience. I am really bummed that his place is not better. They charge a lot and so I expect a little more than what they are putting out right now.\n  \n Yeah cakes still awful, in a pinch had to get a cake and NVB was only choice and $47 for a small cake ( four people size)  plus candles is outrageous, and yeah, cake SUCKS !! Overly iced, literally all icing and no cake, sickly sweet and what cake there was was dry cake and just awful. So embarrassed that I served this as a birthday cake ... Never again", "rating": 1, "date": "2016-04-30"}, {"excerpts": ["Salted caramel macarons (by Tous)\nCheesecake topped with raspberries \nStrawberry cake \nAsiago bread \n\n"], "author": "Laura T.", "review": "Cute little bakery shop in Noe Valley. Since I'm in the neighborhood frequently, once in awhile I like to make a stop. My favorite things from this bakery:\n\nTcho chocolate bun\nBrown butter blueberry muffin \nSavory slab of mushroom, creme fraiche, shallots\nFresh fruit tart \nSea salt caramel cupcake\nBrown butter salty cookie \nBrownies (super rich!)\nSalted caramel macarons (by Tous)\nCheesecake topped with raspberries \nStrawberry cake \nAsiago bread \n\nThey also have a honey milk tea that's really comforting. And they serve sight glass coffee. One star off because they keep adding a price increase. As if the stuff isn't already pricey!", "rating": 4, "date": "2015-07-13"}], "the birthday cake": [{"excerpts": ["I ordered the Birthday Cake for my baby, and a red velvet cupcake and most-est cupcake for myself to taste. ", "Sooo good!"], "author": "Cyreene Loise B.", "review": "Best cake I've ever tasted so far here in SF! Not too sweet. Super moist and doesn't taste commercialized at all! Even the cupcakes are awesome. Can't wait to try the other flavors. I ordered the Birthday Cake for my baby, and a red velvet cupcake and most-est cupcake for myself to taste. Sooo good!", "rating": 5, "date": "2018-05-25"}, {"excerpts": ["The birthday cake they made for me was fabulous: three tiers of white chiffon cake, chocolate whipped cream between the layers, and chocolate ganache icing. ", "Delicious!"], "author": "David K.", "review": "The birthday cake they made for me was fabulous: three tiers of white chiffon cake, chocolate whipped cream between the layers, and chocolate ganache icing. Delicious!", "rating": 5, "date": "2011-02-06"}, {"excerpts": ["When I picked up the cake, only the name was on the BIRTHDAY cake, but no 'Happy Birthday.' ", "The clerk looked at me as though I was asking for the moon, and VERY reluctantly sent it back to have the problem fixed. ", "When they slapped a piece of fondant over the cake with 'Happy Birthday' written on it, they shoved the cake in front of me, and rather meanly said 'Is this OK?", "\" ", "I was ordering a birthday cake. ", "They make plenty of personalized birthday cakes. ", "I think they should know that 'Happy Birthday' usually appears on these cakes. ", "Anyway, even if they didn't (doubt it, though), they seemed to have forgotten that 'the customer is always right.' ", "I will not order cakes from them again, no matter how tasty. ", "They need an attitude adjustment."], "author": "和子", "review": "The strengths: They make great baked goods. The weaknesses: The staff always seem like they have better things to do (at best) and even treat you like they don't want you in their store. I ordered a birthday cake. The person who took my order seemed to be in a hurry and asked the name of the birthday person. I gave the name and that seemed to be it. When I picked up the cake, only the name was on the BIRTHDAY cake, but no 'Happy Birthday.' The clerk looked at me as though I was asking for the moon, and VERY reluctantly sent it back to have the problem fixed. When they slapped a piece of fondant over the cake with 'Happy Birthday' written on it, they shoved the cake in front of me, and rather meanly said 'Is this OK?\" I was ordering a birthday cake. They make plenty of personalized birthday cakes. I think they should know that 'Happy Birthday' usually appears on these cakes. Anyway, even if they didn't (doubt it, though), they seemed to have forgotten that 'the customer is always right.' I will not order cakes from them again, no matter how tasty. They need an attitude adjustment.", "rating": 2, "date": "2010-07-23"}], "flourless chocolate cookie": [], "chocolate chippecan": [], "oatmeal raisin": [{"excerpts": ["The oatmeal raisin cookies are where it's at (after the cheese bread)."], "author": "Rob T.", "review": "Asiago cheese bread is a tasty loaf of bread, with real cheese baked into it. Not little tiny flakes of cheese sprinkled on top, but real chunks of cheese baked into the insides. It's like ravioli, except without the tomato sauce, and with more carbs.\n\nI'm not a fan of the \"Noe-O's\" (but I'm not a fan of Oreo's either).\n\nThe oatmeal raisin cookies are where it's at (after the cheese bread).", "rating": 4, "date": "2009-07-12"}, {"excerpts": ["Their oatmeal raisin cookies are great if you like them very dense and not soft, snickerdoodles and gingersnaps are just ok. ", "Their rugeleh is to die for however, the pastry is denser than I'm used to but good and the fillings are not skimped on. ", "The scones are good and they sell the dough for that and their oatmeal cookies if you want to make it at home, which is nice. ", "The service is pretty shockingly distant, I've never seen people surrounded by that much yummy stuff be so unexcited to be there. ", "I was really excited at first when I found the place ", "but now that the newness has worn off ", "I have to say, ", "the products (esp. pastries) are very expensive for what they are. "], "author": "Allie D.", "review": "I love their crostini breadsticks, could eat them all day long, but they only bake them on sundays and thursdays so they run out quickly, especially the asiago cheese ones. Their bread is decent, the fig and apricot and interesting and the raisin is great because it's more raisin than loaf, which I like. The 7x7 grain bread was disappointing though, the flavor was just not good and the texture was both crumbly and dry. Onion/sesame baguettes, delish. Their oatmeal raisin cookies are great if you like them very dense and not soft, snickerdoodles and gingersnaps are just ok. Their rugeleh is to die for however, the pastry is denser than I'm used to but good and the fillings are not skimped on. The scones are good and they sell the dough for that and their oatmeal cookies if you want to make it at home, which is nice. The service is pretty shockingly distant, I've never seen people surrounded by that much yummy stuff be so unexcited to be there. I was really excited at first when I found the place but now that the newness has worn off I have to say, the products (esp. pastries) are very expensive for what they are. I go back for the breadsticks and the raisin loaf/onion baguette.", "rating": 3, "date": "2009-04-14"}], "milk chocolate chip": [], "cherrychocolate rugalach": [], "raisinpecan rugalach": [], "mookie": [], "brown buttersalty sugar cookie": [], "betty jos peanut butter cookie": [], "pumpkin spice cookie": [{"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}], "pecan tartlet": [{"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}, {"excerpts": ["I tried their Chocolate Chip Pecan Cookies and Pecan Tartlet and it was all very good - the cookies were moist and had the perfect amount of sweetness.  ", "The tartlet was a fantastic way to have a pecan pie as a single serving.\n\n"], "author": "Ken G.", "review": "I tried their Chocolate Chip Pecan Cookies and Pecan Tartlet and it was all very good - the cookies were moist and had the perfect amount of sweetness.  The tartlet was a fantastic way to have a pecan pie as a single serving.\n\nThe variety at Noe Valley Baking Co. is pretty awesome and there's definitely something for everyone.", "rating": 4, "date": "2011-01-24"}], "apple pie": [{"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}, {"excerpts": ["Try to call last Friday to reserved an apple pie which should be a easy thing but a first got put on hold for good 5 mins this guy call Beau answer said he cannot reserved without a payment which is totally not true since ", "a few weeks ago I call to see whether they have an apple pie or not the other guy either Bill or Michael was happy to hold the last one for me without payment and even until half an hour before they close. ", "I was on the road and told Beau that is not convenient but happy to leave my phone # and this is not even a special order just an apple pie ", "and I said since I m on the outside in the public area that is not  convenient to pull out my credit card ", "but all he said he won't hold it without payment and when I ask for a store manager he said manager is not there, if he wouldn't hold then just said no ", "but what's the point to keep me on the phone telling me he can't hold without payment ", "so I hang up. ", "No way I would go back with this kind of rude services."], "author": "K W.", "review": "Try to call last Friday to reserved an apple pie which should be a easy thing but a first got put on hold for good 5 mins this guy call Beau answer said he cannot reserved without a payment which is totally not true since a few weeks ago I call to see whether they have an apple pie or not the other guy either Bill or Michael was happy to hold the last one for me without payment and even until half an hour before they close. I was on the road and told Beau that is not convenient but happy to leave my phone # and this is not even a special order just an apple pie and I said since I m on the outside in the public area that is not  convenient to pull out my credit card but all he said he won't hold it without payment and when I ask for a store manager he said manager is not there, if he wouldn't hold then just said no but what's the point to keep me on the phone telling me he can't hold without payment so I hang up. No way I would go back with this kind of rude services.", "rating": 1, "date": "2016-08-08"}, {"excerpts": ["I remember one time I was picking up a delicious apple pie and ", "the person behind the counter asked if it was for a special occasion.  ", "I laughed and said \"Yes!  "], "author": "Lisa W.", "review": "OMG! I love this place!\n\nI have to say, that, for the most part, I've only really had the pie here... That is because I love pie, and GOOD GOD THESE PEOPLE MAKE THE BEST PIE EVER!!!\n\nI remember one time I was picking up a delicious apple pie and the person behind the counter asked if it was for a special occasion.  I laughed and said \"Yes!  Because I NEED PIE!\"\n\nOkay, after seeing the rest of the reviews I'm going to start trying everything they've got in those cases (swimsuit be damned!)  But, really, it will be hard to walk into this place and not come out with a delicious-flaky-crusted-mouthwatering-sweet-fruit-filled-straight-from-heaven-goodness that is their pie.", "rating": 5, "date": "2008-10-14"}, {"excerpts": ["got the bf's birthday apple pie here and it was PHENOMENAL!!!!  ", "amazing and delicious.  ", "the right amount of sweet and crusty.  ", "yum yum yum.  ", "i can't wait to see what other treats they have."], "author": "Natalie H.", "review": "got the bf's birthday apple pie here and it was PHENOMENAL!!!!  amazing and delicious.  the right amount of sweet and crusty.  yum yum yum.  i can't wait to see what other treats they have.", "rating": 5, "date": "2008-02-01"}], "mixed berry pie": [{"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}], "pear cranberry": [{"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}], "pecan": [{"excerpts": ["I ended up getting the blueberry pecan scones to bake at home, about $14/15 dollars for 6 biscuit-sized scones to bake at home. ", "I tried those and they were pretty good, sort of cakey, reminded me of a biscuit. "], "author": "Eva C.", "review": "This bakery is pretty good! I just wish it wasn't so darn pricey!!\n\nI got the got milk cake for a birthday and it was really good! Super chocolaty, moist, but not super sweet. But that awesome cake came at a $40 price tag. You got about 8 good slices from it, but damn, when did cake get so expensive. I also wanted to try a ton more, but at about 5:30PM, they had run out of most stuff. I ended up getting the blueberry pecan scones to bake at home, about $14/15 dollars for 6 biscuit-sized scones to bake at home. I tried those and they were pretty good, sort of cakey, reminded me of a biscuit. Not the best scone I've ever had, but alright.\n\nI'll be back to try their other goods!", "rating": 4, "date": "2018-02-28"}, {"excerpts": ["The chocolate chip pecan was just ok. ", "I prefer a denser cake ", "so I didn't enjoy the cake as much although everyone else did. ", "They incorporated strawberry cream in between the layers along w/ fresh cut strawberry pieces. ", "Overall, the cake wasn't overly sweet which we appreciated ", "but I can't say it was worth the price. ", "Penmanship on the birthday message was nice."], "author": "Julie L.", "review": "Called ahead to order the strawberry cake for my auntie's birthday. I would suggest to do so since I swung by one time and they were sold out of everything and there was only 1 cake left available. The small round and 2 cookies came out to be $45. \n\nThe cookies were for the hubs and they're decently sized. He didn't particularly care for the cookies. The Oatmeal one crumbled and broke as he was taking it out of the bag. The chocolate chip pecan was just ok. I prefer a denser cake so I didn't enjoy the cake as much although everyone else did. They incorporated strawberry cream in between the layers along w/ fresh cut strawberry pieces. Overall, the cake wasn't overly sweet which we appreciated but I can't say it was worth the price. Penmanship on the birthday message was nice.", "rating": 3, "date": "2016-02-17"}, {"excerpts": ["A hockey puck-sized scone, with absolutely no blueberries and a half piece of pecan.  ", "$3.60 for this? ", "False advertising!"], "author": "Paul S.", "review": "I really want to like this bakery that's right in my neighborhood but I have to say the prices are stretching what's reasonable for what you get.  This morning I thought I'd buy one of those scones in the display case that looked chock full of blueberries and pecans.  What did I get when I opened the bag to eat it? A hockey puck-sized scone, with absolutely no blueberries and a half piece of pecan.  $3.60 for this? False advertising!", "rating": 2, "date": "2016-06-27"}, {"excerpts": ["Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's ", "Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}, {"excerpts": ["I still have a blueberry pecan scone and oatmeal cookie to eat at home in the freezer. ", "OH "], "author": "Adria D.", "review": "Good god this place is pure heaven! I was almost late to my flight because I HAD to bring back baguettes from here. I had them a few days prior and had not stopped dreaming of them, they were THAT GOOD. The seeded baguettes are the best I have ever had. I would not lie to you. The caramelized onion baked right into them surprised yet delighted me it was like a little bonus treasure inside! ($2.85)\n\nI am so glad I don't live close to here because the baguettes were not the only thing to die for...the cheddar chive scones will make you stab someone if they  tried to sneak a bite. I can only imagine how good they would be for a breakfast sammy or with gravy! *drool*\nThe croissant ham and cheese ($4) and heirloom tomato pizza thingy's were flaky buttery slabs of croissant pizza heaven!! The chocolate cherry Sunday only loaf ($5.95) was OVER THE TOP and toasted with butter and nutella, well it should be a crime.\n I still have a blueberry pecan scone and oatmeal cookie to eat at home in the freezer. OH they have the dough's to take home in the freezer too!!\n\nI ALSO had the pumpkin cream cheese loaf i took it to a friends house. It was OK but it didn't really amaze me like everything else did. (womp womp, win some loose some).\n\nThe smell of my hot baguettes on the bart and airplane tortured everyone in a 10 foot radius. I had to guard them with my life, but we made it home. I have since devoured one with a hunk of brie from venissimo. OK diet starts tomorrow...or after that cookie and scone...", "rating": 5, "date": "2014-10-13"}, {"excerpts": ["The Blueberry Pecan Scone (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=XOowzsywUMuBGaANo9N-WQ) is amazing.  ", "It's as buttery as Yelp friend Jennifer L. describes in her review ", "and it's full of plump blueberries and crunchy pecans.  ", "Recently I tried their Chocolate Chip Pecan and Pinwheel Shortbread cookies (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=6ueeFeF-7CuDMwv9_BthKg).  ", "I liked the Chocolate Chip Pecan more because it had lots of crunchy pecans in it, but do you know the real reason why I haven't tried a cupcake from here?  "], "author": "Wilhelm Y.", "review": "Besides reading some great reviews from my Yelp friends I think the first thing that attracted me was the display case filled with delicious cupcakes.  That was many months ago, and I still haven't tried a cupcake yet.  Something else always seems to catch my eye at the Noe Valley Bakery.\n\nI love their scones.  The Blueberry Pecan Scone (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=XOowzsywUMuBGaANo9N-WQ) is amazing.  It's as buttery as Yelp friend Jennifer L. describes in her review and it's full of plump blueberries and crunchy pecans.  I haven't tried reheating it as she does because it never lasts until the next day.\n\nI love their pastries.  One of my favorites is the Apple Wrap (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=pEWeJUwO-6dvNdeT0Ktm4A).  It's an entire apple half, peeled and cored, wrapped in a thin, flaky pastry shell.  These are excellent fresh or warmed in the oven for just a bit.\n\nI love their fresh baked breads.  One of my absolute favorites at any bakery in San Francisco is Noe Valley's Apricot-Ginger Bread (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=JTsUTpi9i0To6rmRT3aMGQ).  The apricots are plump, soft, flavorful and plentiful and even though you can't see the ginger its flavor is definitely highlighted in the dense, moist bread.  I've been known to eat an entire loaf of this bread in one sitting.\n\nI often tell people that I like my cookies hard and crispy, but that doesn't mean I won't eat a cookie if it's soft and chewy.  Noe Valley Bakery's cookies are neither hard and crispy nor soft and chewy but more of something in between.  I've tried many of their cookie varieties so far, and they've all been good.  Recently I tried their Chocolate Chip Pecan and Pinwheel Shortbread cookies (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=6ueeFeF-7CuDMwv9_BthKg).  I liked the Chocolate Chip Pecan more because it had lots of crunchy pecans in it, but do you know the real reason why I haven't tried a cupcake from here?  These look so much more tasty (http://www.yelp.com/biz_photos/oHuPyoGY7nhCQeprHCv21g?select=Y2r2dKmUT6oUzkyUcFZufw)!!\n\nThanks Noe Valley Bakery!", "rating": 5, "date": "2011-01-18"}, {"excerpts": ["Their chocolate chip pecan cookies are huge and made with Guittard chocolate.  ", "They also sell refrigerated cookie dough, which I haven't tried making yet, but were delicious when a friend made some for a party."], "author": "Donna L.", "review": "Love the cookies and the friendly customer service at this bakery!  Second visit here and both times have been great. Their chocolate chip pecan cookies are huge and made with Guittard chocolate.  They also sell refrigerated cookie dough, which I haven't tried making yet, but were delicious when a friend made some for a party.", "rating": 5, "date": "2015-08-23"}, {"excerpts": [", they just threw my cookies, pecan pie and a brownie all together in a small brown bag... ", "I would have expected a more gentle treatment of the food I was buying!!"], "author": "Elisa B.", "review": "I would say amazing bakeries but the service there is not very good, they just threw my cookies, pecan pie and a brownie all together in a small brown bag... I would have expected a more gentle treatment of the food I was buying!!", "rating": 3, "date": "2015-11-15"}, {"excerpts": ["Thankfully the promotion coincided with my great-uncle's 90th birthday, so I placed an order for three dozen raisin-pecan rugelach for the dessert table. \n\n"], "author": "Joanne G.", "review": "While I've been in before for their delicious cupcakes (The Most-est is incredible), it wasn't until Yelp's Sugar High promotion that I discovered Noe Valley Bakery also sells rugelach- a Jewish cookie staple! \n\nThankfully the promotion coincided with my great-uncle's 90th birthday, so I placed an order for three dozen raisin-pecan rugelach for the dessert table. \n\nTo say these went over well was an understatement. One octogenarian raved that they were just like homemade, then she corrected herself...actually, better than homemade!  My aunt raved about their delicousness, and my great-uncle took a bite and recalled his favorite memories of his great aunt Bertha painstakingly making these same cookies for him as a child, nearly weekly. Total Ratatouille moment. \n\nThe rugelach went quickly and everyone took note of the name of the bakery for future reference. Thanks Noe Valley Bakery and Yelp Sugar High!\n\n* Check out their website to see their Passover dessert offerings, Rosh Hashanah, and Hanukkah treats too!", "rating": 5, "date": "2011-04-15"}, {"excerpts": ["I tried their Chocolate Chip Pecan Cookies and Pecan Tartlet and it was all very good - the cookies were moist and had the perfect amount of sweetness.  ", "The tartlet was a fantastic way to have a pecan pie as a single serving.\n\n"], "author": "Ken G.", "review": "I tried their Chocolate Chip Pecan Cookies and Pecan Tartlet and it was all very good - the cookies were moist and had the perfect amount of sweetness.  The tartlet was a fantastic way to have a pecan pie as a single serving.\n\nThe variety at Noe Valley Baking Co. is pretty awesome and there's definitely something for everyone.", "rating": 4, "date": "2011-01-24"}, {"excerpts": ["Delicious apricot hamantasch and pecan-raisin rugelach. ", "Will visit again very soon. ", "To try out tarts and other delicacies you need to visit early in the day. ", "Most of the things get sold out by early evening."], "author": "Sudeep G.", "review": "Delicious apricot hamantasch and pecan-raisin rugelach. Will visit again very soon. To try out tarts and other delicacies you need to visit early in the day. Most of the things get sold out by early evening.", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["2 blueberry pecan scones\none loaf of organic sourdough wheat bread\n\nthe cupcakes were the best i've had in a long time- ", "my brother and cousin said they liked the blueberry pecan scones. ", "the organic sourdough wheat bread was a crowd favorite. ", "its a cozy bakery. ", "prices are decent. "], "author": "Noelle J.", "review": "The World According to Noelle\nAllergic Girl's Guide to Life\n\n\"noe valley bakery \n& bread company-\nthe sweetest spot \nin san francisco.\"\n\n- noelle w.\n\ni've been wanting to try out this bakery for some time. we finally made a trip up there this weekend!\n\nitems we purchased:\n2 boston cream cupcakes w/ fleur de sel\n4 chocolate-caramel-fleur de sel cupcakes\n2 savory cheese croissants \n2 apricot hamentashen\n2 blueberry pecan scones\none loaf of organic sourdough wheat bread\n\nthe cupcakes were the best i've had in a long time- they had the perfect frosting to cupcake ratio. the savory cheese croissants we flaky, buttery and just delish. the apricot hamentashen were the best i've ever had in my entire life! too bad they don't make poppy hamentashen. my brother and cousin said they liked the blueberry pecan scones. the organic sourdough wheat bread was a crowd favorite. its a cozy bakery. prices are decent. everything was sweet, fresh and simply delicious!\n\nnoelle's notes\nlove this place!", "rating": 5, "date": "2010-02-19"}, {"excerpts": ["I went in at around 6:00pm, so many of goodies had already been sold, but luckily, they still had a few Fruit Tarts and Pecan Tartlettes left, a few of my favorites.  \n\n", "The Pecan Tartlette was great--the crust was chewy and buttery.  ", "It was sweet, but not overly sweet from the glaze inside.  ", "The crust was the same as the pecan tarts.  ", "Fruits were fresh, and glazed well with sugar syrup.  ", "But the whip cream was definitely a turn off for me.  ", "The Fruit Tart was $4.95 and Pecan Tartlett was about $2.95.  "], "author": "Cass J.", "review": "Once I get started on sweets, I can't have enough.  During lunch today I was bad and ordered a Pear Tart at the cafe.  \n\nThat did it for me, and I had to make my way over Noe Valley Bakery while I was in the neighborhood.  I went in at around 6:00pm, so many of goodies had already been sold, but luckily, they still had a few Fruit Tarts and Pecan Tartlettes left, a few of my favorites.  \n\nThe Pecan Tartlette was great--the crust was chewy and buttery.  It was sweet, but not overly sweet from the glaze inside.  One of the best little tarlettes that I've had before. \n\nFruit Tarts are my weakness!  Those fruit tarts from Noe Valley Baker were so pretty in the window display and I had to order three.  Upon getting home, I couldn't help myself and devoured one.  To my slight disappointment, the tart was filled in the center with whip cream instead of a creamy sweet custard. The crust was the same as the pecan tarts.  Fruits were fresh, and glazed well with sugar syrup.  But the whip cream was definitely a turn off for me.  Almost made it a bit amateurish.\n\nI'm so happy to have found a bakery that still had some whole wheat sourdough left.  So I had to order a loaf.  Tasted great, and although it was 6:00pm, the the texture seemed to be hard, as if it was day old.  But you can never tell. \n\nThe Fruit Tart was $4.95 and Pecan Tartlett was about $2.95.  Whole Wheat Sourdough was a couple bucks, can't really remember.  \n\nPrices were a bit pricey for the Fruit Tart.  Overall, presentation of tarts was beautiful, but the whip cream didn't really do it for me.  Might be back for other treats, just not the Fruit Tart.", "rating": 4, "date": "2009-07-22"}, {"excerpts": ["I come for the coffee, the blueberry scones, and the chocolate chip pecan cookies.  ", "This bakery is a real gem on 24th Street, I am always happy they are here."], "author": "Oliver B.", "review": "I've been here so many times over the past 10 years I feel kind of bad I haven't given the Noe Valley Bakery a review until now.  I come for the coffee, the blueberry scones, and the chocolate chip pecan cookies.  This bakery is a real gem on 24th Street, I am always happy they are here.", "rating": 5, "date": "2014-02-04"}, {"excerpts": ["I also had their Red Velvet (which is staring at me right now saying \"eat me!\") and lastly their pecan sticky bun which was sugary!\n\n"], "author": "Eric A.", "review": "I concur with many of the yelpers on here about Noe Valley Bakery.\n\nI ordered a couple of their cupcakes, specifically their chocolate cupcake (I think it had caramel as well) I can't remember the name specifically because I was so focused on eating it. I also had their Red Velvet (which is staring at me right now saying \"eat me!\") and lastly their pecan sticky bun which was sugary!\n\nAnyways, nice little bakery in the heart of Noe", "rating": 4, "date": "2011-06-17"}, {"excerpts": ["I LOVE THEIR PECAN PIE!!!  \n   ", "So I was told I had to try Noe Valley's pecan pie as my friend ", "and I are always on the lookout for the best pecan pie.  ", "Perfect crust, AMAZING filling, and fresh.  ", "There was a huge line when we arrived and I always take that as a good sign.  ", "The gentleman that helped us", ", (I think his name was Ted?) had a great personality and really knew his product.  ", "He made a few other recommendations while we were there ", "and I ended up walking out with more than I thought I would.  ", "And the pretty young red-headed girl who rang us up was very sweet.  ", "Great food, great people, and good location.  \n", "Recommend:\n", "Pecan Pie (special order)\nAsiago bread \nFruit tart\nand premade cookie dough."], "author": "Matthew G.", "review": "I LOVE THEIR PECAN PIE!!!  \n   So I was told I had to try Noe Valley's pecan pie as my friend and I are always on the lookout for the best pecan pie.  Perfect crust, AMAZING filling, and fresh.  There was a huge line when we arrived and I always take that as a good sign.  The gentleman that helped us, (I think his name was Ted?) had a great personality and really knew his product.  He made a few other recommendations while we were there and I ended up walking out with more than I thought I would.  And the pretty young red-headed girl who rang us up was very sweet.  Great food, great people, and good location.  \nRecommend:\nPecan Pie (special order)\nAsiago bread \nFruit tart\nand premade cookie dough.", "rating": 5, "date": "2012-02-11"}, {"excerpts": ["The morning buns and pecan rolls are all I need for a perfect Sunday.\n\n"], "author": "evan m.", "review": "The morning buns and pecan rolls are all I need for a perfect Sunday.\n\nI always walk out buying twice what I expected to.  And I have never once regretted it.\n\nNoe Valley Bakery should be designated a Noe Valley landmark.  God bless those bakers.", "rating": 5, "date": "2010-04-25"}, {"excerpts": ["I tried the love bun today (thanks Panthea) and the Blueberry Pecan Scone (thanks Liz) - both were delicious!\n\n"], "author": "Sally M.", "review": "Becoming slightly more favorable to Noe Valley Bakery... I tried the love bun today (thanks Panthea) and the Blueberry Pecan Scone (thanks Liz) - both were delicious!\n\nBut they're still no La Boulange (Union street). Sadly. I miss all my pals and friendly barristas over there - it was totally my neighborhood coffee shop & bakery, where they knew me, had fantastic coffee, amazing croissants, good ham & cheese croissants, chocolate fondants, salads, everything... tear :(", "rating": 4, "date": "2009-10-21"}, {"excerpts": ["Their blueberry pecan scones (the kind you buy frozen and bake at home) are excellent.  ", "They are so buttery that we actually pour the excess melted butter off the pan after pulling them out of the oven.  "], "author": "Jennifer L.", "review": "Their blueberry pecan scones (the kind you buy frozen and bake at home) are excellent.  They are so buttery that we actually pour the excess melted butter off the pan after pulling them out of the oven.  Yup, no lie.\n\nThey make good cupcakes (good, but not the best - my favorite is the Chocolate-Caramel-fleur De Sel Cupcake), breads, and sandwiches.\n\nTheir coffee is really top-notch in my book.\n\nI just tried their new \"Stud Muffin.\"  I liked the name (though the guy behind the counter was cringing with embarrassment!), but it wasn't the studliest muffin.  It was a chocolate muffin, with cream cheese and sparse chocolate chips - it had a slight coffe taste (I don't like coffee in my chocolate - I'm a chocolate purist!), and I've had better at other places.", "rating": 4, "date": "2008-05-30"}, {"excerpts": ["3 words: Pecan Sticky Buns!  ", "Pure heaven in your mouth.  ", "No joke. ", "After moving into the neighborhood, our landlady of all people recommended this local favorite to us, claiming it to be the \"best bakery ever.\"  ", "And to be honest I would have to mostly agree. ", "As stated, the pecan sticky bun is by far my most favorite treat, a delectable sticky bun oozing with caramel, cinnamon, and candied pecans, and something I cannot resist anytime "], "author": "Ryan H.", "review": "3 words: Pecan Sticky Buns!  Pure heaven in your mouth.  No joke. After moving into the neighborhood, our landlady of all people recommended this local favorite to us, claiming it to be the \"best bakery ever.\"  And to be honest I would have to mostly agree. Although not everything I have tasted from the bakery lives up to its' excellence (the cupcakes for example ALL look utterly amazing, but taste just average imo...the Red Velvet Cupcake is the best out of the choices),  the overall \"cuteness\" of the buzzing shop makes it a true gem.  \n\nAs stated, the pecan sticky bun is by far my most favorite treat, a delectable sticky bun oozing with caramel, cinnamon, and candied pecans, and something I cannot resist anytime I walk by the packed joint.  \n\nIt's a very good sign that I don't mind waiting in the ever present line, as my taste buds are willing to wait for their perfect treat. Other baked goods prove to be just as delectable, so don't fear!  Give some things a try until you find a favorite. \n\nHey even if you don't buy anything it is worth going in just to smell the scent of freshly baked bread at all hours of the day!", "rating": 4, "date": "2008-10-13"}, {"excerpts": ["I also bought the asiago cheese bread loaf, Mexican wedding cookies, and Pecan tarts. ", "All were delicious too.  ", "NVB is a complete bakery  -- will be back again soon."], "author": "Janet H.", "review": "Noe Valley Bakery serves great bread, cookies & cupcakes.  My photo includes a special occasion cake from NVB.   It was a 1/2 sheet vanilla chiffon cake with strawberry bavarian filling and vanilla buttercream.  The cake was adorable and very delicious!\n\nThe cupcakes are delicious.  For those of you that suffer from \"dry cake syndrome\", your search for a remedy has ended!   Some of the NVB cupcakes have filling within them. My cupcake faves include:\n1.  Chocolate-Caramel-fleur De Sel Cupcake: Caramel ganache frosting, caramel bavarian filling\n2.  Mocha Cupcake: Chocolate-coffee frosting, mocha buttecream filling\n3.  Most-Est Cupcake: Looks like a Ding-Dong, Chocolate ganache, bavarian cream filling\n4.  Red Velvet Cupcake: chocolate cupcake w/ red dye, topped with cream cheese frosting\n5.  Zinger'd Cupcake:  Looks like a Zinger, Raspberry buttercream frosting w/ pink coconut shavings, raspberry bavarian filling\n6.  Fudge Cupcake/Vanilla Cupcake: favorite classics\n\nI bought these cupcakes for a party.  Everyone loved the cupcakes and was asking directions to NVB.  A definite crowd favorite!\n\nI also bought the asiago cheese bread loaf, Mexican wedding cookies, and Pecan tarts. All were delicious too.  NVB is a complete bakery  -- will be back again soon.", "rating": 5, "date": "2008-05-26"}, {"excerpts": ["The Pecan Sticky Bun is everything I want from a sticky bun. ", "It is cinnimony, gooey with lots of pecans. ", "The gooey sauce is my favorite part. ", "I've tried their cupcakes before but ", "they've never been my cup of tea. ", "I like a softer frosting but theirs seems really hard and sugary. \n", "The staff that works here is great too. ", "I'm a neighborhood person ", "and I love to get to know people who work in the neighborhood ", "and they've always been super nice and ", "if they aren't busy we can chat it up about whatever. ", "I could make coffee at home ", "but I really like getting my coffee from there. ", "They're a part of my ritual."], "author": "Jennifer B.", "review": "I love this bakery. They are a block away from my house and have so many delicious baked goods. I stick to the front case with the sticky buns and the croissants which are always amazing. The Pecan Sticky Bun is everything I want from a sticky bun. It is cinnimony, gooey with lots of pecans. The gooey sauce is my favorite part. I've tried their cupcakes before but they've never been my cup of tea. I like a softer frosting but theirs seems really hard and sugary. \nThe staff that works here is great too. I'm a neighborhood person and I love to get to know people who work in the neighborhood and they've always been super nice and if they aren't busy we can chat it up about whatever. I could make coffee at home but I really like getting my coffee from there. They're a part of my ritual.", "rating": 4, "date": "2011-07-24"}, {"excerpts": ["My wife got their blueberry pecan scone. "], "author": "Tom M.", "review": "My wife and I bought a couple of things from them at their stand at a Ferry Building on Saturday morning.\n\nMy wife got their blueberry pecan scone. Pretty good, not as sconey (think dry) but because of the pecans was richer. \n\nI got the stud muffin (chocolate with cream cheese). We saved it for that night. \n\nWOW. I want to set the record straight on the stud muffin. The thing is fantastic. The chocolate flavor is so rich, just a wonderful taste. The chocolate chips are sparse and they compliment the overall effect just perfectly. \n\nI saw the other review that said there was a coffee taste in their stud muffin. Not even a hint of coffee in mine. I look forward to enjoying it again at the Ferry Building!", "rating": 5, "date": "2008-08-17"}, {"excerpts": ["I opted for 2 blueberry pecan scones and 1 currant orange scone. ", "I started to walk out and I spotted the Most-est cupcakes "], "author": "Dina V.", "review": "I came on Yelp last night looking for scones and after all the reviews, it seemed that NVB&BC seemed the best. As actually no one really reviewed scones on any of the restaurants that popped up in the reviews.\n\nSo today is my friend's birthday and I wanted to get her scones for breakfast. Drove into the city and found NVB&BC empty. As I was looking through the cases though, people came in ordered and left. I opted for 2 blueberry pecan scones and 1 currant orange scone. I started to walk out and I spotted the Most-est cupcakes and I couldn't leave without getting 2, one for me and one for the mister.\n\nBrought the scones to my friend and she shared them with me. YUM. I loved them both. moist and very falvorful.\n\nOf course when I got home I had to sample the cupcake. The chocolate ganache frosting and cream in the middle were delish. The cupcake was dry but the frosting and filling totally made up for it. The mister didn't eat his, and he might not be able to as I think I might have to steal it.\n\nI'll definitely go back and try something else... like the carrot muffin.", "rating": 4, "date": "2006-05-16"}, {"excerpts": ["I wasn't a big fan until recently as I used go to Boulangerie and stock up some of their pastries on a weekly basis, but it changed after I tried their blueberry pecan scone.  ", "Four items I love at this bakery:\nBlueberry Pecan Scone\nBrioche\nCurrent Orange Scone\nBanana Nut Chocolate Chip Muffin\n\n"], "author": "Yoko S.", "review": "My daily breakfast bakery.\nI wasn't a big fan until recently as I used go to Boulangerie and stock up some of their pastries on a weekly basis, but it changed after I tried their blueberry pecan scone.  It's not sconey - not as dry yet crunchy, and the edges taste fantastic.\n\nFour items I love at this bakery:\nBlueberry Pecan Scone\nBrioche\nCurrent Orange Scone\nBanana Nut Chocolate Chip Muffin\n\nMy friends order their cakes for their b-days and weddings, and those were pretty fantastic as well.\n\nRecommended.", "rating": 4, "date": "2008-08-26"}, {"excerpts": ["En route to work, I ate a pecan sticky bun that almost made me turn around for more (  no will power, as you can see ).  \n\n"], "author": "Carmen H.", "review": "Why did I chance upon this place, just as my Cal Poly decathlete son is about to graduate and return home to nag me about diet and exercise!  I had never heard about Noe Valley Bakery - I was, in fact, on my way home from an appointment, driving slowly down 24th Street, when I simultaneously spotted their sign and the empty parking space in front of the store.  It was fate and I am not one to circumvent fate.\n\nForty dollars and thirty minutes later, I walked out of Noe Valley Bakery, armed with numerous bags, vowing that I must return for several items I just couldn't justify purchasing in the same visit.\n\nThat afternoon, I shared my treasures at a staff meeting.  What ecstasy!  Everything was wonderful from the Mexican wedding cookies to the apricot hammentashen, to my personal favorite, the chocolate and cherry rugelach.  En route to work, I ate a pecan sticky bun that almost made me turn around for more (  no will power, as you can see ).  \n\nThere were so many incredible choices, I had difficulty making a decision - the fruit tarts looked fabulous but I figured they would be a total mess by the time I arrived at my destination but I won't rule them out for a future visits...then there are the scones...oh, and wonderful cakes...good grief, I'm 63, how much more can I eat, especially with Jeremy coming home from college to nag me about my weight!!!", "rating": 5, "date": "2008-06-08"}, {"excerpts": ["The subtle hint of pecan is very appealing as is the combination between an appropriately moist inside and perfectly crunched outside. ", "I can't believe I'm addicted to a scone.  ", "They are usually dry and well... boring.  ", "This scone is anything ", "but and when I did a \"taste-off\" compared to the Tartine scone, hands down the NVB&BC one rocks!"], "author": "Elizabeth M.", "review": "So I'm totally addicted to the Bluberry Scones at NVB&BC.  They are amazing.  The fact that they sell the bake at home dough should be a clue for all shoppers.\n\nThe subtle hint of pecan is very appealing as is the combination between an appropriately moist inside and perfectly crunched outside. I can't believe I'm addicted to a scone.  They are usually dry and well... boring.  This scone is anything but and when I did a \"taste-off\" compared to the Tartine scone, hands down the NVB&BC one rocks!", "rating": 5, "date": "2008-07-11"}, {"excerpts": ["I drive across town to pick up their blueberry pecan scones.  ", "And you can get them in frozen dough form and bake them at home.  ", "I have tried thier other pastries as well and have never been disappointed."], "author": "Kim M.", "review": "I drive across town to pick up their blueberry pecan scones.  And you can get them in frozen dough form and bake them at home.  I have tried thier other pastries as well and have never been disappointed.", "rating": 4, "date": "2011-02-26"}, {"excerpts": ["I also really enjoy their hamateschen cookies and their raisin & pecan rugelach. ", "As for my highly discriminating teenage daughter, she tells me that their mostest cupcakes and love buns are simply the best!"], "author": "Belinda J.", "review": "I have never been disappointed in the treats offered at this delightful neighborhood bakery. Their chocolate croissants and butter croissants are as good as the ones you find at good bakeries in France. I also really enjoy their hamateschen cookies and their raisin & pecan rugelach. As for my highly discriminating teenage daughter, she tells me that their mostest cupcakes and love buns are simply the best!", "rating": 5, "date": "2013-03-28"}, {"excerpts": ["The BLUEBERRY PECAN scones, the FIG BREAD (get it unsliced), and the the Hamenlisch ", "(sp?) "], "author": "hugh c.", "review": "OK... where do I begin???\n\nThe BLUEBERRY PECAN scones, the FIG BREAD (get it unsliced), and the the Hamenlisch (sp?) PASTRY COOKIES....\n\nOh, and don't even get me started on their divine QUICHES!  I find myself making calorie choices when I'm at NVB - I can't eat it all, and be able to return for a repeat visit.....  Ah, the decisions!", "rating": 4, "date": "2008-09-29"}, {"excerpts": ["I love the Blueberry Pecan Scones, Blueberry Muffins, Cheddar Chive Scones and Chocolate Chip Banana Muffins.   ", "And the Chocolate Croissants have a generous slab of dark chocolate buried in the middle - my favorite.  "], "author": "Paddy W.", "review": "I go here every Saturday morning.  I walk here from the Castro, tie my dog up outside at the \"puppy parking\" and buy whatever looks good.  I'm not so into cupcakes, so the scones and fresh breads are what I buy.  I love the Blueberry Pecan Scones, Blueberry Muffins, Cheddar Chive Scones and Chocolate Chip Banana Muffins.   And the Chocolate Croissants have a generous slab of dark chocolate buried in the middle - my favorite.  The bread is standard fare -- nothing really stands out -- but tasty and fresh.  \n\nThe staff is friendly, the store is clean although crowded and the window display is always cheerful.  This is just a nice and pleasant place.", "rating": 4, "date": "2007-09-17"}, {"excerpts": ["Also love the bake-at-home blueberry pecan scones, the mini quiches, tartlets, croissants, and just about everything they make!  ", "So good, you'll be addicted!"], "author": "Ana C.", "review": "I dream about the \"mostess\" cupcakes from Noe Bakery.   Also love the bake-at-home blueberry pecan scones, the mini quiches, tartlets, croissants, and just about everything they make!  So good, you'll be addicted!", "rating": 4, "date": "2008-04-08"}, {"excerpts": ["My favorites are the cherry chocolate bread and the blueberry pecan scones. ", "I don't go here often because I feel they have become too pricey for what they're offering."], "author": "Sabrina L.", "review": "I remember when \"Plate's Bakery\" occupied this location many moons ago and glad that NVB is now in this space. I've enjoyed many of their pastries and breads over the years. My favorites are the cherry chocolate bread and the blueberry pecan scones. I don't go here often because I feel they have become too pricey for what they're offering.", "rating": 3, "date": "2008-10-02"}, {"excerpts": ["And the blueberry-pecan scone, with a cup of coffee while wandering the market smelling lemon basil and lavender is just a moment of heaven in my week.\n\n"], "author": "Laura K.", "review": "Whenever I go to the Ferry Building Farmer's Market on Saturday mornings, I *always* stop by the Noe Valley Bakery tent and get a little pastry for breakfast.\n\nScones are my thing, I looove them above all other breakfast pastries. And the blueberry-pecan scone, with a cup of coffee while wandering the market smelling lemon basil and lavender is just a moment of heaven in my week.\n\nThank you Noe Valley Bakery!", "rating": 4, "date": "2009-05-30"}, {"excerpts": ["The pecan and blackberry scones are incredible, and the carrot muffin is the best lowfat muffin on the planet -- remarkably, it tastes nothing like cardboard! ", "Grab a scone to share while you're waiting for your eggs in those long Noe brunch lines."], "author": "Laurel N.", "review": "Sometimes I really miss living in Noe Valley, home of the delicious breakfast items. The pecan and blackberry scones are incredible, and the carrot muffin is the best lowfat muffin on the planet -- remarkably, it tastes nothing like cardboard! Grab a scone to share while you're waiting for your eggs in those long Noe brunch lines.", "rating": 5, "date": "2005-05-02"}, {"excerpts": ["But how is it that nobody has mentioned the heart-rendingly delicious blueberry pecan scones? ", "Yes, the cupcakes, pies and cakes are excellent too, but the blueberry scones are what drive me out of bed and up the hill to the bakery. "], "author": "kelly r.", "review": "Lots of reviews here. But how is it that nobody has mentioned the heart-rendingly delicious blueberry pecan scones? Yes, the cupcakes, pies and cakes are excellent too, but the blueberry scones are what drive me out of bed and up the hill to the bakery. They look innocent, but are actually quite filling, and are most delicious if you warm them up a bit at home.\n\nAlso, when you're walking down 24th Street and have a small hunger pang, which happens to me surprisingly often, stop into NVB and treat yourself to a breadstick (or two or three). They're cheap, delicious, and crunchy, and you can eat them while leaving one hand free to find your MUNI transfer in your purse...under the bag of scones for tomorrow's breakfast.", "rating": 5, "date": "2007-04-01"}, {"excerpts": ["Love the blueberry-pecan scone."], "author": "cheryl f.", "review": "Smells great walking by.  Love the blueberry-pecan scone.", "rating": 4, "date": "2005-12-22"}, {"excerpts": ["I also love their frozen bake-at-home blueberry pecan scones. ", "Friendly service."], "author": "Matt B.", "review": "The \"most-est\" and red velvet cupcakes are excellent. I also love their frozen bake-at-home blueberry pecan scones. Friendly service.", "rating": 4, "date": "2010-10-17"}, {"excerpts": ["The blueberry pecan scones are incredible. ", "I'd eat them every day if I could.  ", "My girlfriend is more excited about the muffins. ", "I stop in pretty regularly for a cup of coffee on my way to work. ", "It's nice with a little cinnamon and a scone to go. ", "The fig bread is also awesome and has huge figs all through it."], "author": "Damon K.", "review": "The blueberry pecan scones are incredible. I'd eat them every day if I could.  My girlfriend is more excited about the muffins. I stop in pretty regularly for a cup of coffee on my way to work. It's nice with a little cinnamon and a scone to go. The fig bread is also awesome and has huge figs all through it.", "rating": 5, "date": "2008-01-20"}, {"excerpts": ["Pecan rolls are definitely the way to go.  ", "My family was in town from the East coast and fell in love. ", "Great choice!"], "author": "Emily J.", "review": "MMMMM, bread.  Really, I love all products with bread, but Noe Valley Bakery does everything with carbs right.  Pecan rolls are definitely the way to go.  My family was in town from the East coast and fell in love. Great choice!", "rating": 5, "date": "2010-06-02"}], "cheesecake with fresh berries": [], "fresh berry tart": [], "fresh fruit tartlette": [], "citrus curd tart": [], "citrus curd tartlette": [], "chocolate éclair": [], "milky way bombe": [{"excerpts": ["I also had the milky way bombe which was decadent but not overly sweet and rich as I was expecting. ", "It definitely tasted like the milky way chocolate bar and had some crunchies at the bottom of the bombe for texture. ", "The cream inside was just lovely. ", "I stopped by on a weekend morning and the line was non-stop but it moved quickly."], "author": "Maya S.", "review": "All kinds of baked goods here including breads, cookies, cupcakes, macarons, pastries, and cakes which sure looked mighty fine. I may have to order one for an event in the future. I had a fruit slab which was made with flaky, fresh pastry with tart strawberry, rhubarb, and sweet cream in the center. I also had the milky way bombe which was decadent but not overly sweet and rich as I was expecting. It definitely tasted like the milky way chocolate bar and had some crunchies at the bottom of the bombe for texture. The cream inside was just lovely. I stopped by on a weekend morning and the line was non-stop but it moved quickly.", "rating": 5, "date": "2014-03-21"}, {"excerpts": ["LOVE their flourless chocolate cake and the MILKY WAY BOMBE.. ", "that ish is the BOMB! ", "sooo good =)"], "author": "A L.", "review": "LOVE their flourless chocolate cake and the MILKY WAY BOMBE.. that ish is the BOMB! sooo good =)", "rating": 5, "date": "2013-06-18"}], "vanilla cupcake": [{"excerpts": ["The vanilla cupcake was a little drier than the other two but it worked out perfectly fine for my baby boy. ", "Cupcakes here??? ", "YES!!!!\n", "by the way, the young lady who helped me was very kind. : )"], "author": "Luna R.", "review": "Needed just a few cupcakes to celebrate my baby boy's birthday. Got the chocolate caramel, the most-est and the vanilla cupcakes. Thank GOD they were moist and delicious! The frosting is quite thick but I LOVE that it is not so sweet.  The vanilla cupcake was a little drier than the other two but it worked out perfectly fine for my baby boy. Cupcakes here??? YES!!!!\nby the way, the young lady who helped me was very kind. : )", "rating": 5, "date": "2014-10-01"}, {"excerpts": ["Case in point: a vanilla cupcake. ", "There was no discernible taste of vanilla, and the lack of vanilla odor is curious. ", "Then there was the chocolate cupcake. ", "It had been over baked and the top was hard as a rock, covered with frosting it looked fine. ", "Not."], "author": "William M.", "review": "The staff are nice enough, but they don't make up for the lack of flavor many products have. Case in point: a vanilla cupcake. There was no discernible taste of vanilla, and the lack of vanilla odor is curious. Then there was the chocolate cupcake. It had been over baked and the top was hard as a rock, covered with frosting it looked fine. Not.", "rating": 3, "date": "2014-08-05"}, {"excerpts": ["My favorite cupcake of theirs is the Zinger'd (vanilla cupcake filled with raspberry Bavarian cream, topped with raspberry buttercream and pink coconut flakes)--so girly!  "], "author": "Diane L.", "review": "4.5 stars\n\nThis place is so cute!  I'm a sucker for cuteness, so this place definitely got me with its non-pretentious and cute storefront.  But so did their efficient online cake ordering system.  As did the raspberry Bavarian cream they put in between layers of chocolate cake.  Oh, and those adorable cupcakes they make too, especially the lemon drop cupcake with bees made of frosting and almond slices.\n\nTheir cupcakes are much more affordable and much larger than fancy cupcakeries like Kara's.  However, I still give it to Kara's for a perfectly executed cupcake.  On the other hand, the cupcakes at Noe Valley Bakery have the looks, but their cake is on the dry side.  My favorite cupcake of theirs is the Zinger'd (vanilla cupcake filled with raspberry Bavarian cream, topped with raspberry buttercream and pink coconut flakes)--so girly!  I have yet to try more of their pastries, but I also love their blueberry muffins--moist with plump and juicy blueberries.\n\nThe service is top-notch too.  Everyone is so smiley here, especially in the morning.  I arrived on time one morning to pick up an order of cupcakes, but my cupcakes weren't packaged yet.  The girl kept apologizing, even though I was in no rush.  While I was waiting, I was wooed by the pastry cases, so I asked for a blueberry muffin and fruit tart to go.  And whaddya know, the girl let me have them on the house because I had to wait a whole 10 minutes.  It was quite unnecessary, but hey, I'm not gonna argue with free stuff!", "rating": 4, "date": "2008-09-02"}, {"excerpts": ["Tried the 1) red velvet cupcake, 2) vanilla w/white frosting cupcake, and 3) the one with pink coconut slivers on top of a vanilla cupcake filled with raspberry frosting (forgot the name) - see picture. ", "The cake in the cupcakes were so moist and light and the cream on top was so deliciously smooth but not too sweet. ", "The pink coconut cupcake was THE BEST ", "- it had this awesome raspberry cream that made me savor ever bite and made me sad when it was all gone. "], "author": "Jim C.", "review": "Fantastic cupcakes from this Noe Valley neighborhood bakery where you want to eat everything you see - from the yummy cupcakes displayed in the window and in the case, to the pies, cakes, pastries, breads... everything!\n\nTried the 1) red velvet cupcake, 2) vanilla w/white frosting cupcake, and 3) the one with pink coconut slivers on top of a vanilla cupcake filled with raspberry frosting (forgot the name) - see picture. The cake in the cupcakes were so moist and light and the cream on top was so deliciously smooth but not too sweet. The pink coconut cupcake was THE BEST - it had this awesome raspberry cream that made me savor ever bite and made me sad when it was all gone. And the fresh coconut slivers at the top complemented the rest of the cupcake perfectly.\n\nPretty busy place on a Friday afternoon but service was efficient. Downside is that there's only metered street parking so good luck!\n\nBottom line: Probably best cupcakes I've had in SF area, even better than some of these other fancy cupcake-only places. Can't wait to go back and try the other 5+ kinds of cupcakes and all their other stuff!", "rating": 5, "date": "2007-05-30"}, {"excerpts": ["Vanilla Cupcake: sweet, moist, didn't like the whip cream-like frosting with sprinkles, it just tasted like cream & butter and wasn't dense enough\n- Apple Wrap: basically a cinnamon glazed half apple wrapped in phyllo dough, not bad\n- Coffee Cake Muffin: moist cake, very light on the nuts, but overall good\n\nAll their cakes seem to be moist, which I like. "], "author": "Linda C.", "review": "Walking through Noe Valley, we stumbled upon this bakery and decided to try it out. Took us the longest time to decide what to get.\n\n- Red Velvet Cupcake: moist, nice not too sweet cream cheese frosting\n- Vanilla Cupcake: sweet, moist, didn't like the whip cream-like frosting with sprinkles, it just tasted like cream & butter and wasn't dense enough\n- Apple Wrap: basically a cinnamon glazed half apple wrapped in phyllo dough, not bad\n- Coffee Cake Muffin: moist cake, very light on the nuts, but overall good\n\nAll their cakes seem to be moist, which I like. The worst is when the cake is dry and they try to compensate by over-frosting. The frosting on the cupcakes were lighter than other places, but I kind of like my frosting dense like the way Sprinkles makes it, although they pile on a little too much on their cupcakes. But the cupcakes are only $2.50 here.\n\nService was friendly and patient as we kept trying to decide on what to get. Cute bakery in Noe Valley with good moist cakes!", "rating": 3, "date": "2009-06-28"}, {"excerpts": ["I think I've tried every one.... from the Fudge cupcake, to the vanilla cupcake, to their Zinger'd (an adult strawberry coconut Zinger), their Rocky Road (a little too much going on for me), their \"Most-est", "\" (like the chocolate fave Hostess cupcake complete with squigglies).....  ", "My friends laugh at my cupcake obsession.\r\n\r\n", "But Dear Noe Valley Bakery, I'm on a campaign for a vanilla cupcake with your fudge frosting.  ", "It's my absolute favorite type, and *sigh", "* I have yet to see it in your presence.   ", "I'll change this review to five stars if I see my fave cupcake in your glorious glass cases."], "author": "Jane A.", "review": "Best cupcakes in the City!  I think I've tried every one.... from the Fudge cupcake, to the vanilla cupcake, to their Zinger'd (an adult strawberry coconut Zinger), their Rocky Road (a little too much going on for me), their \"Most-est\" (like the chocolate fave Hostess cupcake complete with squigglies).....  My friends laugh at my cupcake obsession.\r\n\r\nBut Dear Noe Valley Bakery, I'm on a campaign for a vanilla cupcake with your fudge frosting.  It's my absolute favorite type, and *sigh* I have yet to see it in your presence.   I'll change this review to five stars if I see my fave cupcake in your glorious glass cases.", "rating": 4, "date": "2006-09-11"}, {"excerpts": ["I got the vanilla cupcake.  ", "Butter frosting.  ", "I am not a fan of butter frosting...", "I like sour cream frosting and cream cheese frosting, and cream frosting...but not butter frosting.  ", "Vanilla cupcake\nGuy: ", "Will that be it?\n", "Me: ", "However, I will mention the Hostessy chocolate cupcake with a cream filling as being moist and obliterating the memory of the vanilla cupcake with the butter frosting. \n\n"], "author": "Sooj O.", "review": "Today is the first day I haven't eaten fried food since Wednesday, so I thought I could get a cupcake.  Unfortunately, Ritual didn't have the chocolate cupcake with salty fudgy frosting, so I yelped cupcakes and decided on Noe Valley Bakery and Bread Company as the closest high ranking cupcakery near me.\n\nI got the vanilla cupcake.  Butter frosting.  I am not a fan of butter frosting...I like sour cream frosting and cream cheese frosting, and cream frosting...but not butter frosting.  I think it's too hard and doesn't go well with the soft crumbly goodness of cake. \n\nBut....I also got a loaf of their double raisin bread, thinking I would eat some tomorrow.  Well, of course I wanted to try just a bite, just a tiny little taste.  I haven't been able to stop eating it since that first bite.  I think there's a whole box of raisins in the loaf.  And I am not even a huge fan of raisins...but it's really good in this loaf.  It's divine... and the bread is...moist?  I don't know how else to describe it.\n\nSo, not the cupcake I wanted, but an unexpected raisin pleasure. \nOh, and the guy at the cash register was so nice.  \nGuy: What would you like?\nMe: Hmmm...Vanilla cupcake\nGuy: Will that be it?\nMe: Oh, wait, the double raisin loaf.\nGuy: That will be all?\nMe: Oh, and a small coffee as well.\n(all this while the line behind me gets longer and longer).\n\nMe...afflicted with inability to make up my mind before I get to the cash register....\n\nOh, oh, and they sell challah bread!  I am so going back to get some!\n________\n\nUpdate:\n\nSince Steph P. is a cupcake fanatic, I decided to join her for an evening of chatting and cupcaking.  I will let her review her eats.  However, I will mention the Hostessy chocolate cupcake with a cream filling as being moist and obliterating the memory of the vanilla cupcake with the butter frosting. \n\nBut, I am still more enthralled by their breads.  They had the most delicious Asiago Cheese Bread...crusty cheese exterior...and a core of Asiago Cheese enlivening the delicious bread.  While we walked over to Ritual to partake of coffee and cupcakes, we managed to devour most of the Asiago Cheese Bread.  \n\nSteph was saying that she wished she could toast the bread.  Over the next couple of mornings, I toasted the little bit of bread leftover.  Very delicious toasted.  For those who don't plan to devour a large loaf of cheese bread quickly, they also sell Asiago Cheese rolls.", "rating": 5, "date": "2007-03-31"}, {"excerpts": ["Fudge Cupcake/Vanilla Cupcake: favorite classics\n\n"], "author": "Janet H.", "review": "Noe Valley Bakery serves great bread, cookies & cupcakes.  My photo includes a special occasion cake from NVB.   It was a 1/2 sheet vanilla chiffon cake with strawberry bavarian filling and vanilla buttercream.  The cake was adorable and very delicious!\n\nThe cupcakes are delicious.  For those of you that suffer from \"dry cake syndrome\", your search for a remedy has ended!   Some of the NVB cupcakes have filling within them. My cupcake faves include:\n1.  Chocolate-Caramel-fleur De Sel Cupcake: Caramel ganache frosting, caramel bavarian filling\n2.  Mocha Cupcake: Chocolate-coffee frosting, mocha buttecream filling\n3.  Most-Est Cupcake: Looks like a Ding-Dong, Chocolate ganache, bavarian cream filling\n4.  Red Velvet Cupcake: chocolate cupcake w/ red dye, topped with cream cheese frosting\n5.  Zinger'd Cupcake:  Looks like a Zinger, Raspberry buttercream frosting w/ pink coconut shavings, raspberry bavarian filling\n6.  Fudge Cupcake/Vanilla Cupcake: favorite classics\n\nI bought these cupcakes for a party.  Everyone loved the cupcakes and was asking directions to NVB.  A definite crowd favorite!\n\nI also bought the asiago cheese bread loaf, Mexican wedding cookies, and Pecan tarts. All were delicious too.  NVB is a complete bakery  -- will be back again soon.", "rating": 5, "date": "2008-05-26"}], "chocolate fudge cupcake": [{"excerpts": ["the:\n\nLemon Drop cupcake\nChocolate Fudge cupcake\n"], "author": "Rebekah T.", "review": "This is more of a shout out to my favorite cupcakes and the Noe Valley Bakery, as this place is slowly becoming my favorite cupcake place. Cupcakes are so wildly popular these days, but kids it's not a new concept. I love cupcakes and wish I could eat one everyday of my life, but that's just not going to happen.\n\nAfter walking around 24th Street, we decide to stop for cupcakes. Then she says \"maybe we should get some food first\", but all that's on my mind is \"I wonder what the cupcakes taste like\". The whole time we are eating, I'm thinking about the cupcakes. Are they getting squished in the box, maybe I should peek.\n\nSo far I've had the:\n\nLemon Drop cupcake\nChocolate Fudge cupcake\nRed Velvet cupcake\nChocolate Cream Filled Hostess Cupcake Look-alike\n\nAfter reading some other reviews, I can't wait to try the rest....", "rating": 5, "date": "2010-03-02"}], "carrot cupcake": [{"excerpts": ["The carrot cupcake that had carrot-shaped icing is now replaced with shredded carrots on top. \n\n"], "author": "Joy W.", "review": "Years ago, someone brought a bunch of Noe Valley cupcakes to the office. Back then, I thought I didn't like cupcakes, because one too many stale grocery store baked goods turned me off from cupcakes. Plus I thought cupcakes were more of a children's snack, maybe because of memories of school bake sales, or because they're individually wrapped in paper so kids don't have to use any forks or plates, or maybe because the decorations often look juvenile. Noe Valley Bakery & Bread Co. made me realize delicious cupcakes do exist, and I do like them! After I tried one, I paid the store a visit and became a repeat customer.\nThe bakery itself is on the small side. There are two display cases with cakes, cupcakes, cookies, pastries. Loaves of fresh bread are lined up on the shelves. There are also candles, cards, and dough to take home and bake yourself.\n\nAll the cupcakes are very rich, heavy, and moist. The icing is so creamy, smooth, and beautifully applied. They're pretty pricey, around $3.50-$4ish per cupcake, but they seem larger than most cupcakes. Some of them come in mini size. The filled ones cost a little more. To me, the taste is superior to most cupcakes. The cupcakes are very thick too. Cutting into one doesn't smush or deflate them.\n\nRed Velvet - deep, dark red cake. Perhaps they use less red food coloring than most. The cream cheese icing is thick and creamy, almost like cheesecake filling, but so much smoother than actually eating cheesecake.\n\nMost-est - their rendition of the Hostess with Bavarian cream & silky ganache\n\nChocolate Caramel Fleur de Sel - filled with caramel Bavarian cream, sprinkled with chunky sea salt. Sea salt is the best part, because it adds a savory component, and enhances the flavor. Otherwise, I wouldn't really like this one, as I'm not a fan of caramel. \n\nBoston Cream - vanilla cake filled with a pastry cream that resembles custard, topped with stiff fudge icing\n\nPeanut Butter Cup - a tiny peanut butter cup sits atop the cake covered in chocolate ganache, filled with more rich, creamy peanut butter. It's so rich, sweet, and savory.\n\nI'm not sure if they still have the Boston Cream or the PB cup, and that makes me sad, because I'm pretty sure they were my favorites. A few other things have changed, mostly in appearance. The lemon cupcake is no longer decorated with a bee on top. The carrot cupcake that had carrot-shaped icing is now replaced with shredded carrots on top. \n\nTheir cakes are great - simple in design, but big on taste. They are a little expensive at ~$40 for a small cake. The writing on the cake is done very well, almost font-like. Clearly, penmanship is important here. They do some pretty amazing-looking custom cakes too.\n\nI've tried some of the cookies, but they didn't stand out to me. They also carry Tout Sweet macarons now, which is news to me.\n\nI'm looking forward to the next time I can grab one of these cupcakes and some flaky pastries.", "rating": 5, "date": "2016-02-29"}, {"excerpts": ["Carrot Cupcake for the win!!!"], "author": "Nadia A.", "review": "I love this place! Customer service is awesome. The retail staff was extremely knowledgable about their products. Went in for a cookie and came out with half a dozen cupcakes. \n& the cupcakes were sooooo delish! \nHighly recommend! In fact if it was not for the friendly and helpful staff this would have just been a so so experience, I have to thank Xavier and Bud for an excellent hands on experience, definitely going back! Carrot Cupcake for the win!!!", "rating": 5, "date": "2014-02-11"}, {"excerpts": ["My next best is the carrot cupcake, and let's not forget the Lemon Drop cupcake and Most-ess Cupcake, which is an adult spin on the Hostess Cup Cakes.  \n\n"], "author": "ERICA G.", "review": "What  can I say, I'm in love!  I stopped in just to check it out and walked out with 6 cupcakes.  This is one of the best red velvet cupcakes I've had, the frosting isn't too sweet or thick, just right.  My next best is the carrot cupcake, and let's not forget the Lemon Drop cupcake and Most-ess Cupcake, which is an adult spin on the Hostess Cup Cakes.  \n\nI'm a true fan of supporting local businesses and that's exactly why I decided to order cupcakes and a cake from Noe Valley Bakery for my graduation party.  They were willing to accomodate my request of 50 cupcakes the day before my celecration. I'm glad I went with Noe Valley Bakery, all of the guest raved about how delicious the cupcakes were.  My custom graduation cake, with each of my favorite bay area teams decorating the sides of a hazelnut sponge and chocolate filled cake. Yummy, I can still taste the flavors of my cake!", "rating": 5, "date": "2011-06-19"}, {"excerpts": ["A random sampling of Noe Valley Bakery's carrot cupcake on Wednesday, April 22nd at 6:47 pm yields the moistest cupcake ever!\n\n"], "author": "Peg S.", "review": "Peg's Very Important & Prestigious Cupcake Study* \n\nA random sampling of Noe Valley Bakery's carrot cupcake on Wednesday, April 22nd at 6:47 pm yields the moistest cupcake ever!\n\n*note:  my study is neither comprehensive nor scientifically accurate.", "rating": 4, "date": "2009-04-23"}, {"excerpts": ["carrot cupcake: ", "oh my. ", "the carrot cake was of perfect density and moistness, amazing flavor in every bite. ", "beautiful to look at too, as the cake had a generous amount of grated carrot, bits of walnut for great texture, and whatever else is supposed to be in a terrific carrot cake. ", "the cream cheese icing? ", "good universal energy almighty. "], "author": "Eliza D.", "review": "devoured three whole cupcakes yesterday evening, with no regrets whatsoever. wanted the cupcake-eating experience to last for a wee bit longer, but once i started munching, there was no way to pace myself. one bite and i got transported to my fat kid happy place.\n\nall the cupcakes i had were not at all dry, nor were they unpleasantly sticky-moist. in short, beautiful.\n\nchocolate caramel fleur de sel: the icing of chocolate ganache was just the right degree of stickiness and richness. the sprinkling of salt on top - yeeeeee! no trace of caramel in the ganache though, which was a bummer for all of a half-second. the chocolate cake was chocolatey without being overwhelming, terrific texture. it's filled with what's supposed to be caramel bavarian cream, but again, no trace of caramel flavor here. the cream filling was wonderfully light, flavorsome, and refreshing with bites of cake and ganache. no disappointment if i just took out the word 'caramel' from the cupcake name.\n\ncarrot cupcake: oh my. the carrot cake was of perfect density and moistness, amazing flavor in every bite. beautiful to look at too, as the cake had a generous amount of grated carrot, bits of walnut for great texture, and whatever else is supposed to be in a terrific carrot cake. the cream cheese icing? good universal energy almighty. just gotta keep on eating.\n\nred velvet cupcake: the chocolatey earthiness of the red velvet cake was divine. i can't remember the last time i had such a full-bodied-tasting red velvet cake before. the flavor and texture was on point, and i felt like i was inhaling the earthy taste in my nose with every mouthful that i chew. and the cream cheese icing? GOOD UNIVERSAL ENERGY ALMIGHTY. gorgeous.\n\ncrave crave crave crave crave crave crave crave", "rating": 5, "date": "2012-01-21"}, {"excerpts": ["(2)\nCarrot Cupcake  "], "author": "Lauren C.", "review": "Chocolate - Caramel-fleur De Sel Cupcake (4)\nRed Velvet Cupcake (2)\nBoston Cream Pie Cupcake  (2)\nZinger'd Cupcake  (1)\nMocha Cupcake  (2)\nCarrot Cupcake  (1)\n\nThis is how I filled my dozen. \nAte one sitting in the car because I couldn't wait!\nI guarantee they'll be gone by tomorrow!!\n\nEver since a co-worker brought in Noe Valley Bakery Cupcakes, I have been craving them.  I make up reasons to go to Noe Valley just so I can have one.  Today, I couldn't resist and bought the whole dozen.  I'm so excited - it just made my week!!!!! :)", "rating": 5, "date": "2008-04-08"}, {"excerpts": ["That's when I ate the carrot cupcake. \n"], "author": "Tiffinie T.", "review": "It was midnight and officially my birthday. No champagne? Hmmm.\n\nThat's when I ate the carrot cupcake. \nThe one reserved for breakfast. \n\nI don't usually choose carrot cake for myself, but it was a gift. (the givers  husband got the chocolate one, damn it!!)  Not that I don't like carrot cake, mind you.\n\nIt was delicious. Moist. Cream cheese frosting uber creamy!\nMy cat also enjoyed the super-creamy cream cheese frosting. \nShe fancies herself as a connoisseur of all things related to frosting and yogurt and cheese.\nIt was so good I almost didn't share it with her. \nHer eyes pleaded. Pupils fully dilated. Head tilted.\nI broke.\nI shared.\nThat's just how I roll.\n\nThanks, Noe Valley Bakery for the sweet start to my b-day!!", "rating": 4, "date": "2007-04-16"}, {"excerpts": ["I was pretty specific with how I wanted the cupcakes designed, 10 red velvet cupcakes with a chocolate cursive  initial F, with white pearls/sugar crystals, and 10 carrot cupcake with a chocolate cursive initial J, again with white pearls/sugar crystals.   ", "Making the order and communication via email was no problem, it was a very smooth process.  ", "Although when I went to pick them up, I noticed that some of the initial F's were on the carrot cupcakes.. which is not what I requested.  ", "It's bad because we'd be eating them in a dimly light lounge, where the only way I would be able to tell people what type of cupcake they were was of the different initials.  ", "Also, the Initials weren't the prettiest of initials.  ", "The J looked horrible actually lol.  ", "It looked more like an I.  ", "Oh well, the girls loved the way they tasted.  ", "Everyone was buzzed enough to not grade the looks of the cursive initials, and I was able to switch over the J & F's on the correct ", "cupcake flavor.  "], "author": "Alice E.", "review": "I've been here on 2 separate occasions.  First I happen to walk by and decided to pick up a carrot cake for a friends dinner.  It was DAMN good.  Best carrot cake that I've ever had.\n\n2nd occasion, I remembered how great the carrot cake was and wanted to order some birthday cupcakes for my girlfriends birthday powwow.  I was pretty specific with how I wanted the cupcakes designed, 10 red velvet cupcakes with a chocolate cursive  initial F, with white pearls/sugar crystals, and 10 carrot cupcake with a chocolate cursive initial J, again with white pearls/sugar crystals.   Making the order and communication via email was no problem, it was a very smooth process.  Although when I went to pick them up, I noticed that some of the initial F's were on the carrot cupcakes.. which is not what I requested.  It's bad because we'd be eating them in a dimly light lounge, where the only way I would be able to tell people what type of cupcake they were was of the different initials.  Also, the Initials weren't the prettiest of initials.  The J looked horrible actually lol.  It looked more like an I.  Oh well, the girls loved the way they tasted.  Everyone was buzzed enough to not grade the looks of the cursive initials, and I was able to switch over the J & F's on the correct cupcake flavor.  Negative star for the mix up of initials.. \n\nI also have tried their blueberry scones in the AM, which tasted a bit over done.  It was a bit more brown then I had anticipated as well.  Their chocolate croissants are NOT worth the calories, please skip at all costs.", "rating": 4, "date": "2011-12-22"}, {"excerpts": ["Try the carrot cupcake or one of the many varieties of ruggalah.  \r\n\r\n", "While I can only speak for the sweet (not savory) options here, I've heard their croissants and breads are insanely fresh and yummy.  ", "They've always got something tasty waiting to be devoured by hungry shoppers.  ", "While I am tempted to give them 5 stars, that would mean putting their baked goods on the same level as Delessio.  ", "Just can't do it!"], "author": "Abby W.", "review": "A must stop for those compulsive shopping excursions on 24th Street.  Need a pick-me-up?  Try the carrot cupcake or one of the many varieties of ruggalah.  \r\n\r\nWhile I can only speak for the sweet (not savory) options here, I've heard their croissants and breads are insanely fresh and yummy.  They've always got something tasty waiting to be devoured by hungry shoppers.  While I am tempted to give them 5 stars, that would mean putting their baked goods on the same level as Delessio.  Just can't do it!", "rating": 4, "date": "2006-09-21"}, {"excerpts": ["And the carrot cupcake is perfect, just like the red velvet cupcake! ", "delish! "], "author": "Christiana R.", "review": "My sister and I have been searching the city for red velvet cupcakes and luckily, we stumbled upon this place. Their cupcakes are amazing and this is now our go-to place for cupcakes and other pastries. First off, the red velvet cupcakes here are sooooo good. They are super moist and just the right amount of sweetness. The frosting is also perfect, not too sweet and not too plain. The other cupcakes they offer are also really good! The hostess-looking cupcake is really delicious, especially with the cream-filling. The lemon-drop cupcake has a nice zing to it. And the carrot cupcake is perfect, just like the red velvet cupcake! delish! Also my sister gets the personal-size cheesecakes from here and it looked and tasted amazing!\n\nI really like the location of this bakery. A lot of restaurants and clothing stores in the neighborhood. There is also a lot of metered parking so it shouldn't be too tough to find parking.", "rating": 4, "date": "2008-06-28"}, {"excerpts": ["I'd have to say the carrot cupcake was the best one out of all. ", "I also went their to order a cake. ", "Didn't want to order the 2 tier cake for $160 but I loved the little butterflies and flowers designed on it ", "so I asked the lady there if I can order an 8 inch round cake with the same designs as the 2 tier cake. ", "She tried asking the owner of the store but he was much too in a rush to leave and told me to fill out a special request cake order form. ", "I did that and was told I would receive an email from the owner today. ", "I waited and waited still no email until 2 pm. ", "I already found a different bakery (Sweet Art by Jennifer). ", "She's willing to take my order over the phone immediately ", "and I ended up ordering a 2 tier cake for $65.....", "wayyyyyy cheaper than Noe Valley Bakery"], "author": "Dora P.", "review": "Gave them 3 stars because their cupcakes were delicious. I bought the carrot, mostest chocolate, chocolate-caramel, and red velvet. I'd have to say the carrot cupcake was the best one out of all. I also went their to order a cake. Didn't want to order the 2 tier cake for $160 but I loved the little butterflies and flowers designed on it so I asked the lady there if I can order an 8 inch round cake with the same designs as the 2 tier cake. She tried asking the owner of the store but he was much too in a rush to leave and told me to fill out a special request cake order form. I did that and was told I would receive an email from the owner today. I waited and waited still no email until 2 pm. I already found a different bakery (Sweet Art by Jennifer). She's willing to take my order over the phone immediately and I ended up ordering a 2 tier cake for $65.....wayyyyyy cheaper than Noe Valley Bakery", "rating": 3, "date": "2012-12-05"}, {"excerpts": ["The Carrot cupcake was DANG good but the Chocolate-Caramel-Fleur de Sel Cupcake was too much and put me in a sugar shock coma."], "author": "Pelle Y.", "review": "The Carrot cupcake was DANG good but the Chocolate-Caramel-Fleur de Sel Cupcake was too much and put me in a sugar shock coma.", "rating": 4, "date": "2008-12-28"}, {"excerpts": ["And their carrot cupcake?  ", "Carrots?  ", "They're vegetables.  ", "Again.  ", "It's a health food.  ", "Your body will thank you.  ", "Your butt might not, but, hell, who cares?"], "author": "Idala T.", "review": "Heck, when you compare their Most-est cupcake with a Hostess' cupcake, it's practically health food.  And their carrot cupcake?  Carrots?  They're vegetables.  Again.  It's a health food.  Your body will thank you.  Your butt might not, but, hell, who cares?", "rating": 4, "date": "2007-05-04"}], "red velvet cupcake": [{"excerpts": ["I ordered the Birthday Cake for my baby, and a red velvet cupcake and most-est cupcake for myself to taste. ", "Sooo good!"], "author": "Cyreene Loise B.", "review": "Best cake I've ever tasted so far here in SF! Not too sweet. Super moist and doesn't taste commercialized at all! Even the cupcakes are awesome. Can't wait to try the other flavors. I ordered the Birthday Cake for my baby, and a red velvet cupcake and most-est cupcake for myself to taste. Sooo good!", "rating": 5, "date": "2018-05-25"}, {"excerpts": ["I also recommend the red velvet cupcake!"], "author": "Cory T.", "review": "I repeat don't, what ever you do buy the M&M cookie! It is the most addictive thing ever, along with the morning bun. In the morning the line can be long, but after 11 seem to be ok. The girls and boy behind the counter are very friendly. I also recommend the red velvet cupcake!", "rating": 5, "date": "2017-10-05"}, {"excerpts": ["We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  ", "My son and I shared the red velvet cupcake.  ", "By sharing, he ate the  cheese cream icing ", "and I had the rest of the cupcake.  "], "author": "Christine P.", "review": "Love this place.  My husband, son and I spent a weekday afternoon in Noe Valley to have lunch, pick up groceries and indulge in some dessert.  We walked all over 24th street and finally settled Noe Valley Bakery.  We ordered a red velvet cupcake and some frozen chocolate chip cookies to take home and bake.  All of their desserts look amazingly good and the service is top notch.  \n\nI checked out the cakes, cookies and cupcakes and wanted to try every single one.  My son and I shared the red velvet cupcake.  By sharing, he ate the  cheese cream icing and I had the rest of the cupcake.  My son won't have anything to do with any part of the cupcake that has no icing, which cracks me up but also makes me a 'little' pissed off because I can't indulge in the moist cream cheese icing. \n\nI also saw their most-es cupcake which I will definitely try because it looks amazing.  I found a brief description of their most-ex cupcake (below) and can't wait to return to check it out. \n\nMost-es Cupcake:\nA childhood favorite. Rich chocolate cupcake filled with Bavarian cream, topped with chocolate ganache and white curly Q's\n\nOh and since the holidays are fast approaching, you may want to check out their site for all of their goods. Here's the stuff they have for Thanksgiving and Christmas according to their website (11/2014): \n\nThanksgiving treats: Pecan Tartlet, Pumpkin Spice Cookie, Pumpkin Cutout Cookie, Acorn Cookie, Leaf Cookie, Apple Pie, Mixed Berry Pie, Pear Cranberry Pie, Dutch Apple Pie (limited availability), Pecan Pie, Pumpkin Pie, Poached Quince & Frangipane Tart, Eggnog Cheesecake Tart with Cranberry Jam, Spiced Cupcake with Tangerine Cream Frosting, Individual Pumpkin Cheesecake, Turkey Stuffing Mix, Whole Wheat Dinner Rolls, Challah Dinner Rolls and Michael's Famous Christmas Stollen\n\nChristmas treats: Pumpkin Spice Cookie, Small Gingerbread Boy Cookie, Snowman Cookie, Santa Hat Cookie, All New Cookies!, Big Gingerbread Girl Cookie, Gingerbread Cookie Kit, Gingerbread House Kit, Christmas Cookie Box, Christmas Cookie Tin, Deluxe Gold Christmas Cookie Box, Christmas Stump, Flourless Chocolate Pomegranate Cake, Hazelnut-Raspberry Roll, Grand Marnier Truffle Cake, Large Milky Way Bomb, Christmas Stollen, Christmas Petit Fours, Candy Cane Mini Cupcake, Gingerbread Boy Mini Cupcake, Present Cupcake, Snowman Cupcake\n\nCan I have one of everything please?  \n\nAnyway, the frozen chocolate chip cookies I purchased are waiting to be baked and are happily sitting in my freezer as I type.  We may be having those for dessert tonight along with the three twins ice cream.  YUM!  Highly recommend if you want to indulge your sweet tooth.", "rating": 5, "date": "2014-11-19"}, {"excerpts": ["My only regret is the red velvet cupcake doesn't have as much frosting as it should. ", "There's just not enough to go with all of the yummy cake. ", "Be a little more generous with that stuff", ", okay?"], "author": "Leslie K.", "review": "I did a search for best cupcakes in SF and this place had their \"Most-est\" listed as #2 so I had to check it out. But then I saw it had a health score of 100%..and...well...how convincing is that?!\n\nI tried 3 cupcakes, a cookie, a quiche, and a scone and I wish Noe Valley were closer to me than it is. Even though the chocolate cake of the cupcakes was extra memorable I think the cheddar chive scone just blew me away.\n\nMy only regret is the red velvet cupcake doesn't have as much frosting as it should. There's just not enough to go with all of the yummy cake. Be a little more generous with that stuff, okay?", "rating": 4, "date": "2013-11-20"}, {"excerpts": ["Red Velvet cupcake\n"], "author": "Rebekah T.", "review": "This is more of a shout out to my favorite cupcakes and the Noe Valley Bakery, as this place is slowly becoming my favorite cupcake place. Cupcakes are so wildly popular these days, but kids it's not a new concept. I love cupcakes and wish I could eat one everyday of my life, but that's just not going to happen.\n\nAfter walking around 24th Street, we decide to stop for cupcakes. Then she says \"maybe we should get some food first\", but all that's on my mind is \"I wonder what the cupcakes taste like\". The whole time we are eating, I'm thinking about the cupcakes. Are they getting squished in the box, maybe I should peek.\n\nSo far I've had the:\n\nLemon Drop cupcake\nChocolate Fudge cupcake\nRed Velvet cupcake\nChocolate Cream Filled Hostess Cupcake Look-alike\n\nAfter reading some other reviews, I can't wait to try the rest....", "rating": 5, "date": "2010-03-02"}, {"excerpts": ["Red velvet cupcake (3 of 5) ", "- Overflowing cupcake top. ", "The top was a little hard and tasted like a brownie. ", "But very moist in the middle ", "and I really liked their cream cheese frosting. ", "It wasn't too sweet like Sprinkes, and had a rich cream cheese taste. ", "Like a cheese cake. ", "I like the frosting on this cupcake a lot.\n", "*Moistest (4 of 5) - Chocolate with cream filling and ganache topping. ", "Looks like a big hostess cupcake and tastes like one. ", "Super fresh and super moist. "], "author": "Janice T.", "review": "Cute bakery in Noe Valley. \n\nTried: \n*Red velvet cupcake (3 of 5) - Overflowing cupcake top. The top was a little hard and tasted like a brownie. But very moist in the middle and I really liked their cream cheese frosting. It wasn't too sweet like Sprinkes, and had a rich cream cheese taste. Like a cheese cake. I like the frosting on this cupcake a lot.\n*Moistest (4 of 5) - Chocolate with cream filling and ganache topping. Looks like a big hostess cupcake and tastes like one. Super fresh and super moist. It is very good. \n\nIn the window display, I saw lots of cute decorative cartoon cupcakes. Not sure what is the price, but their creative cupcakes are very appealing. I think you need 24-30 days to pre-order. Definitely worth checking out for moms looking to surprise their kids with an awesome birthday cupcake surprise party.", "rating": 3, "date": "2012-06-04"}, {"excerpts": ["I got there pretty late in the day so most of the cupcakes were probably gone, but I got the Red Velvet cupcake, and the Boston Cream Pie cupcake. ", "The red velvet with its cream cheese frosting was much too sweet for me. ", "The cake good, but also still too sweet. ", "Same went for the boston cream pie cupcake. "], "author": "Jaime H.", "review": "Cupcake review:\n\nSo I asked my friend to recommend a place with best cupcake. Not being a big fan of cupcakes, if she had to give me ONE cupcake to change my mind, what would it be. She said Noe Valley Bakery. I was not sold.\n\nI got there pretty late in the day so most of the cupcakes were probably gone, but I got the Red Velvet cupcake, and the Boston Cream Pie cupcake. The red velvet with its cream cheese frosting was much too sweet for me. The cake good, but also still too sweet. Same went for the boston cream pie cupcake. The cake with the custard filling was delicious, but the frosting was so sweet I scraped half of it off. \n\nThe other pastries and cakes looked good.. I might be back to try the other items, because I guess cupcakes just aren't my thing.", "rating": 3, "date": "2013-05-30"}, {"excerpts": ["My favorite is the red velvet cupcake.  ", "Mmmmm."], "author": "Animal K.", "review": "Holy crap!\n\nI've always rolled my eyeballs over the whole cupcake craze, pooh-poohing it, but they have the most delicious cupcakes (cakes) I've ever eaten.  Someone brought a few in to the place I volunteer and after finding out where she bought them, I've since had to go pick up some cukecakes myself, for myself.\n\nMy favorite is the red velvet cupcake.  Mmmmm.", "rating": 5, "date": "2012-05-27"}, {"excerpts": ["Red velvet cupcake:  ", "Dry cake and the frosting was way too sweet, but then I hate sweet cream cheese frosting.  \n", "* Most-est cupcake: ", "Their best cupcake.  ", "The rich chocolate ganache is a sophisticated touch (and it's delicious) as is the elegant white squiggle.  ", "This is a classy Hostess cupcake.  ", "The chocolate cake is a bit dry but the Bavarian cream filling is delicious.  \n", "* Lemon drop cupcake:  ", "The handmade frosting bee with almond wings is adorable. ", "The vanilla cake was on the bland side (and dry).  ", "Doesn't taste like they use Madagascar Bourbon vanilla.  "], "author": "Lolia S.", "review": "I love their strawberry hazelnut cake.  It's pretty to look at (fresh strawberry slices) and light tasting (hazelnut sponge cake - I love sponge cake and I love hazelnuts).  I get it with whipped cream.  Mmm.  I was extremely excited to hear that they had greatly expanded their cupcake line recently (still hoping for a hazelnut cupcake).  \n\nThey have fancy grown-up cupcakes and they're cheaper than ones at cupcake shops ($2 to $2.50 each).  The cake is on the dry side  and the frosting is softer than average.\n\n* Red velvet cupcake:  Dry cake and the frosting was way too sweet, but then I hate sweet cream cheese frosting.  \n* Most-est cupcake: Their best cupcake.  The rich chocolate ganache is a sophisticated touch (and it's delicious) as is the elegant white squiggle.  This is a classy Hostess cupcake.  The chocolate cake is a bit dry but the Bavarian cream filling is delicious.  \n* Lemon drop cupcake:  The handmade frosting bee with almond wings is adorable. The vanilla cake was on the bland side (and dry).  Doesn't taste like they use Madagascar Bourbon vanilla.  The lemon buttercream frosting was soft and subtle whereas the filling of lemon Bavarian was much more lemony.  \n\nOkay, so I didn't fall in love with each cupcake but on the strength of their morning buns (melt in your mouth tender but still crispy in parts), hazelnut sponge cake and Most-est cupcakes, I am in love with Noe Valley Bakery.  I'm also more lenient/have lower cupcake expectations for bakeries vs. places that specialize in cupcakes.  For a bakery, NV does a fine job with cupcakes.  \n\nThis place has it all: sandwiches, quiche, breads, pies, tarts, scones, frozen scone and pie dough, tote bags, croissants, and the most amazing morning buns.  Everything in the case looked delicious (passed my \"eye\" test).  There is no seating and they accept credit cards.", "rating": 4, "date": "2007-09-14"}, {"excerpts": ["The ultimate best bakery to get your red velvet cupcake fix!  ", "They're soft, moist, great flavor, and the cream cheese icing is a perfect sweetness.  ", "You get a good size cupcake for the price too.  ", "This bakery is on my top list of places to go to satisfy my sweet tooth.  "], "author": "Mary Ann M.", "review": "The ultimate best bakery to get your red velvet cupcake fix!  They're soft, moist, great flavor, and the cream cheese icing is a perfect sweetness.  You get a good size cupcake for the price too.  This bakery is on my top list of places to go to satisfy my sweet tooth.  I have yet to try the hostess-looking cupcake.  \n\nIf I lived or worked near this bakery, I would gain an extra two inches of muffin top!", "rating": 4, "date": "2011-11-28"}, {"excerpts": ["we settled on the Red Velvet Cupcake, Salted Chocolate & Caramel Cupcake and the Milky Way Chocolate Mound of Mousse and Awesomeness.\n\n"], "author": "Carmel U.", "review": "Such a cute bakery!  I always love their window displays!\n\nWe stopped in there today to get some desserts after lunch.  we settled on the Red Velvet Cupcake, Salted Chocolate & Caramel Cupcake and the Milky Way Chocolate Mound of Mousse and Awesomeness.\n\nThe desserts were so good!  The frosting on the cupcakes were a little thick for me, but the actual cakes and mousse were so yummy!  They also sell their own sauces and ice cream, which is a nice touch.\n\nI have tried their breakfast scones before and really liked the savory choices.  A great place to stop into on your way to work - the staff is very friendly, as well.", "rating": 4, "date": "2011-07-26"}, {"excerpts": ["Dislikes: Red Velvet Cupcake and Carrot Cake Cupcake ", "(they were good, just had better). ", "The fact that I only have one stomach and could not fit anymore sweets or other baked goods in my belly.  ", "Size of bday cake for my co-worker.  "], "author": "Maybelline C.", "review": "Likes: Boston Creme Cupcake and chocolate Caramel Fleur de Sel Cupcake.  Size of cupcakes. Very moist cupcakes.  Perfect frosting. Pimp parking I got that day.  Quick service.\n\nDislikes: Red Velvet Cupcake and Carrot Cake Cupcake (they were good, just had better). The fact that I only have one stomach and could not fit anymore sweets or other baked goods in my belly.  Size of bday cake for my co-worker.  I wanted more. \n\nNoe Valley Bakery, you are a danger to my health.  I will probably need to rethink my diet plan after learning about you, but I plan on making a return.", "rating": 4, "date": "2009-11-03"}, {"excerpts": ["Tried the 1) red velvet cupcake, 2) vanilla w/white frosting cupcake, and 3) the one with pink coconut slivers on top of a vanilla cupcake filled with raspberry frosting (forgot the name) - see picture. ", "The cake in the cupcakes were so moist and light and the cream on top was so deliciously smooth but not too sweet. ", "The pink coconut cupcake was THE BEST ", "- it had this awesome raspberry cream that made me savor ever bite and made me sad when it was all gone. "], "author": "Jim C.", "review": "Fantastic cupcakes from this Noe Valley neighborhood bakery where you want to eat everything you see - from the yummy cupcakes displayed in the window and in the case, to the pies, cakes, pastries, breads... everything!\n\nTried the 1) red velvet cupcake, 2) vanilla w/white frosting cupcake, and 3) the one with pink coconut slivers on top of a vanilla cupcake filled with raspberry frosting (forgot the name) - see picture. The cake in the cupcakes were so moist and light and the cream on top was so deliciously smooth but not too sweet. The pink coconut cupcake was THE BEST - it had this awesome raspberry cream that made me savor ever bite and made me sad when it was all gone. And the fresh coconut slivers at the top complemented the rest of the cupcake perfectly.\n\nPretty busy place on a Friday afternoon but service was efficient. Downside is that there's only metered street parking so good luck!\n\nBottom line: Probably best cupcakes I've had in SF area, even better than some of these other fancy cupcake-only places. Can't wait to go back and try the other 5+ kinds of cupcakes and all their other stuff!", "rating": 5, "date": "2007-05-30"}, {"excerpts": ["Trying to avoid sweet gluttony we opted for one red velvet cupcake.  ", "Would I agree with the name, best ever red velvet cupcake ? ", "Fantastic yes, best ever, nyet.  ", "A little more cake per bite than cream cheese frosting.  ", "Walking down the street with red velvet smiles, priceless.  ", "A bakery with few warm beverage options, no seating available but freshly baked smells are free."], "author": "Jacob J.", "review": "The doorstep offers an inviting look inside.  The assorted danish and cupcakes were all too alluring, cupcakes almost the size of your palm for under three dollars.  Trying to avoid sweet gluttony we opted for one red velvet cupcake.  Would I agree with the name, best ever red velvet cupcake ? Fantastic yes, best ever, nyet.  A little more cake per bite than cream cheese frosting.  Walking down the street with red velvet smiles, priceless.  A bakery with few warm beverage options, no seating available but freshly baked smells are free.", "rating": 4, "date": "2009-12-21"}, {"excerpts": ["red velvet cupcake: the chocolatey earthiness of the red velvet cake was divine. ", "i can't remember the last time i had such a full-bodied-tasting red velvet cake before. ", "the flavor and texture was on point, and i felt like i was inhaling the earthy taste in my nose with every mouthful that i chew. ", "and the cream cheese icing? ", "GOOD UNIVERSAL ENERGY ALMIGHTY. "], "author": "Eliza D.", "review": "devoured three whole cupcakes yesterday evening, with no regrets whatsoever. wanted the cupcake-eating experience to last for a wee bit longer, but once i started munching, there was no way to pace myself. one bite and i got transported to my fat kid happy place.\n\nall the cupcakes i had were not at all dry, nor were they unpleasantly sticky-moist. in short, beautiful.\n\nchocolate caramel fleur de sel: the icing of chocolate ganache was just the right degree of stickiness and richness. the sprinkling of salt on top - yeeeeee! no trace of caramel in the ganache though, which was a bummer for all of a half-second. the chocolate cake was chocolatey without being overwhelming, terrific texture. it's filled with what's supposed to be caramel bavarian cream, but again, no trace of caramel flavor here. the cream filling was wonderfully light, flavorsome, and refreshing with bites of cake and ganache. no disappointment if i just took out the word 'caramel' from the cupcake name.\n\ncarrot cupcake: oh my. the carrot cake was of perfect density and moistness, amazing flavor in every bite. beautiful to look at too, as the cake had a generous amount of grated carrot, bits of walnut for great texture, and whatever else is supposed to be in a terrific carrot cake. the cream cheese icing? good universal energy almighty. just gotta keep on eating.\n\nred velvet cupcake: the chocolatey earthiness of the red velvet cake was divine. i can't remember the last time i had such a full-bodied-tasting red velvet cake before. the flavor and texture was on point, and i felt like i was inhaling the earthy taste in my nose with every mouthful that i chew. and the cream cheese icing? GOOD UNIVERSAL ENERGY ALMIGHTY. gorgeous.\n\ncrave crave crave crave crave crave crave crave", "rating": 5, "date": "2012-01-21"}, {"excerpts": ["- Red Velvet Cupcake: moist, nice not too sweet cream cheese frosting\n- "], "author": "Linda C.", "review": "Walking through Noe Valley, we stumbled upon this bakery and decided to try it out. Took us the longest time to decide what to get.\n\n- Red Velvet Cupcake: moist, nice not too sweet cream cheese frosting\n- Vanilla Cupcake: sweet, moist, didn't like the whip cream-like frosting with sprinkles, it just tasted like cream & butter and wasn't dense enough\n- Apple Wrap: basically a cinnamon glazed half apple wrapped in phyllo dough, not bad\n- Coffee Cake Muffin: moist cake, very light on the nuts, but overall good\n\nAll their cakes seem to be moist, which I like. The worst is when the cake is dry and they try to compensate by over-frosting. The frosting on the cupcakes were lighter than other places, but I kind of like my frosting dense like the way Sprinkles makes it, although they pile on a little too much on their cupcakes. But the cupcakes are only $2.50 here.\n\nService was friendly and patient as we kept trying to decide on what to get. Cute bakery in Noe Valley with good moist cakes!", "rating": 3, "date": "2009-06-28"}, {"excerpts": ["Red Velvet cupcake!\n", "A luscious chocolate cupcake tinged with a lot of red food coloring and topped with delish cream cheese.  ", "I really had to control myself ", "or I'll eat up all they have in the display case."], "author": "Ry T.", "review": "My favorite place to get Red Velvet Cupcakes. They make about 5 types of cupcakes for $2.50 each. My friend's son had the chocolate caramel.  They sell bread, cakes, pastries, coffee.  The cheese scone is really good too.  Staff's pretty nice here.  I left my friends shopping at a store nearby as I made a beeline into this bakery to line up for,... Red Velvet cupcake!\nA luscious chocolate cupcake tinged with a lot of red food coloring and topped with delish cream cheese.  I really had to control myself or I'll eat up all they have in the display case.", "rating": 4, "date": "2009-01-05"}, {"excerpts": ["Nina got her strawberries and I bought a red velvet cupcake for myself. "], "author": "Max D.", "review": "I promised Nina that I would get her some chocolate dipped strawberries, so rather than take her to the typical Godiva or Rocky Chocolate Mountain shops - I thought that this place would be a better alternative. It was the day after Valentine's Day and it was raining cats and dogs in San Francisco. \n\nWhen we walked in you would have to be blind not to notice all the wonderful delights that line their display, never mind the long line of people fighting for cupcakes....for a business that has been there since 1995, they definitely have a following. Nina got her strawberries and I bought a red velvet cupcake for myself. Yums. \n\nThis place is a definite must go when you are in Noe Valley.", "rating": 4, "date": "2009-02-16"}, {"excerpts": ["Chocolate - Caramel-fleur De Sel Cupcake (4)\nRed Velvet Cupcake (2)\nBoston Cream Pie Cupcake  (2)\n", "Zinger'd ", "Cupcake  ", "(1)\nMocha Cupcake  "], "author": "Lauren C.", "review": "Chocolate - Caramel-fleur De Sel Cupcake (4)\nRed Velvet Cupcake (2)\nBoston Cream Pie Cupcake  (2)\nZinger'd Cupcake  (1)\nMocha Cupcake  (2)\nCarrot Cupcake  (1)\n\nThis is how I filled my dozen. \nAte one sitting in the car because I couldn't wait!\nI guarantee they'll be gone by tomorrow!!\n\nEver since a co-worker brought in Noe Valley Bakery Cupcakes, I have been craving them.  I make up reasons to go to Noe Valley just so I can have one.  Today, I couldn't resist and bought the whole dozen.  I'm so excited - it just made my week!!!!! :)", "rating": 5, "date": "2008-04-08"}, {"excerpts": ["Although not everything I have tasted from the bakery lives up to its' excellence (the cupcakes for example ALL look utterly amazing, but taste just average imo...the Red Velvet Cupcake is the best out of the choices),  the overall \"cuteness\" of the buzzing shop makes it a true gem.  \n\n"], "author": "Ryan H.", "review": "3 words: Pecan Sticky Buns!  Pure heaven in your mouth.  No joke. After moving into the neighborhood, our landlady of all people recommended this local favorite to us, claiming it to be the \"best bakery ever.\"  And to be honest I would have to mostly agree. Although not everything I have tasted from the bakery lives up to its' excellence (the cupcakes for example ALL look utterly amazing, but taste just average imo...the Red Velvet Cupcake is the best out of the choices),  the overall \"cuteness\" of the buzzing shop makes it a true gem.  \n\nAs stated, the pecan sticky bun is by far my most favorite treat, a delectable sticky bun oozing with caramel, cinnamon, and candied pecans, and something I cannot resist anytime I walk by the packed joint.  \n\nIt's a very good sign that I don't mind waiting in the ever present line, as my taste buds are willing to wait for their perfect treat. Other baked goods prove to be just as delectable, so don't fear!  Give some things a try until you find a favorite. \n\nHey even if you don't buy anything it is worth going in just to smell the scent of freshly baked bread at all hours of the day!", "rating": 4, "date": "2008-10-13"}, {"excerpts": ["In my desire to try every single red velvet cupcake in the bay area, here's my opinion on NVB. ", "I thought the red velvet cupcakes were excellent. ", "The cream cheese buttercream topping was great, full of flavor and not too sweet, with just the right amount of tartness. ", "The cupcake itself was good, although I thought it could use a little more cocoa taste. ", "I think the ones at Sweet Things are also a little more moist. ", "That being said, overall very nice. ", "Now the red velvet journey continues....."], "author": "Dom L.", "review": "In my desire to try every single red velvet cupcake in the bay area, here's my opinion on NVB. I thought the red velvet cupcakes were excellent. The cream cheese buttercream topping was great, full of flavor and not too sweet, with just the right amount of tartness. The cupcake itself was good, although I thought it could use a little more cocoa taste. I think the ones at Sweet Things are also a little more moist. That being said, overall very nice. Now the red velvet journey continues.....", "rating": 4, "date": "2009-06-23"}, {"excerpts": ["Red Velvet Cupcake: ", "chocolate cupcake w/ red dye, topped with cream cheese frosting\n5.  ", "Zinger'd ", "Cupcake:  ", "Looks like a Zinger, Raspberry buttercream frosting w/ pink coconut shavings, raspberry bavarian filling\n6.  "], "author": "Janet H.", "review": "Noe Valley Bakery serves great bread, cookies & cupcakes.  My photo includes a special occasion cake from NVB.   It was a 1/2 sheet vanilla chiffon cake with strawberry bavarian filling and vanilla buttercream.  The cake was adorable and very delicious!\n\nThe cupcakes are delicious.  For those of you that suffer from \"dry cake syndrome\", your search for a remedy has ended!   Some of the NVB cupcakes have filling within them. My cupcake faves include:\n1.  Chocolate-Caramel-fleur De Sel Cupcake: Caramel ganache frosting, caramel bavarian filling\n2.  Mocha Cupcake: Chocolate-coffee frosting, mocha buttecream filling\n3.  Most-Est Cupcake: Looks like a Ding-Dong, Chocolate ganache, bavarian cream filling\n4.  Red Velvet Cupcake: chocolate cupcake w/ red dye, topped with cream cheese frosting\n5.  Zinger'd Cupcake:  Looks like a Zinger, Raspberry buttercream frosting w/ pink coconut shavings, raspberry bavarian filling\n6.  Fudge Cupcake/Vanilla Cupcake: favorite classics\n\nI bought these cupcakes for a party.  Everyone loved the cupcakes and was asking directions to NVB.  A definite crowd favorite!\n\nI also bought the asiago cheese bread loaf, Mexican wedding cookies, and Pecan tarts. All were delicious too.  NVB is a complete bakery  -- will be back again soon.", "rating": 5, "date": "2008-05-26"}, {"excerpts": ["However when you're craving for their famous red velvet cupcake, the things that are so wrong can taste ohhhh so right. ", "Their hazelnut strawberry ready made cake is also a great pick-up for any celebration/occasion that you forgot to pre-order for. ", "Red Velvet Cupcake (These go fast. ", "Today, they were out by 11:30am. ", "Come early!)\n", "Carrot Cake Cupcake \nSweet Cheese Croissant"], "author": "Lisa T.", "review": "What I love about Noe Valley Bakery is the proximity of my house to this yummy yummy place. Considering my quest to eat healthier, I guess this can be perceived as a bad thing. However when you're craving for their famous red velvet cupcake, the things that are so wrong can taste ohhhh so right. Their hazelnut strawberry ready made cake is also a great pick-up for any celebration/occasion that you forgot to pre-order for. All I can say...tasty, tasty, & tasty! \n\nRecommendations: \nRed Velvet Cupcake (These go fast. Today, they were out by 11:30am. Come early!)\nCarrot Cake Cupcake \nSweet Cheese Croissant", "rating": 5, "date": "2008-06-01"}, {"excerpts": ["My anger quickly diminished as I gobbled down the delicious red velvet cupcake. ", "After my sugar-high, I am no longer cussing at him, rather praising now. ", "He should win the award for \"Best Boss Ever!"], "author": "Nancie T.", "review": "The way to an employee's heart is her stomach. Employers should take note of that! Thats why Google was ranked #1 employer of the year in 2008 - thats because they fed their employees, kept 'em stuffed and happy. \n\nBeing the overworked and underpaid staff that I am, I was secretly cussing at the boss for the past few weeks. Then today, he walks over to our department with a box of cupcakes. The cute oodles of sugar were screaming at me, \"You fool! How could you be mad at him? Look at what he's treating you guys to!\". My anger quickly diminished as I gobbled down the delicious red velvet cupcake. After my sugar-high, I am no longer cussing at him, rather praising now. He should win the award for \"Best Boss Ever!\" \n\nMore cupcakes please.", "rating": 5, "date": "2009-04-07"}, {"excerpts": ["But to save $$$ I'll pass on the Red Velvet cupcake, Noe Valley Bakery needs to work on the flavor and texture of it.  \n\n"], "author": "just d.", "review": "The chocolate mousse cake is my favorite. The chocolate ganache exterior is smooth, chocolatey, with just the right amount of chocolate richness. The chocolate sponge is moist and the chocolate mousse is just perfect; a little bite of heaven each time.\n\nThe Lemon Drop Cupcake (w/the Bumble Bee) has the most delicious lemon custard and yummy frosting.  Don't pass up the Chocolate-Caramel-Fleur del Sel, it has a perfect balance of flavors (yes, salt).  At $2.75 and up, these cupcakes are less expensive then some other Bay Area bakeries but why do all these darn cupcakes have to look so cute and cost so much?  But to save $$$ I'll pass on the Red Velvet cupcake, Noe Valley Bakery needs to work on the flavor and texture of it.  \n\nI love the baked goods, from the cupcakes to the challah, at Noe Valley Bakery but I just wish the service could be friendlier.  I appreciate the quality of the food and I guess the price goes with the territory but a smile from the staff would be nice. It seems the counter people get grumpier and grumpier each time. I guess they think this fat girl doesn't need to eat anymore cupcakes. :P", "rating": 4, "date": "2009-11-20"}, {"excerpts": ["Red Velvet Cupcake - dry and tasted like it came from a box.  ", "The frosting wasn't even good either ", "and that's supposed to be the best part.  "], "author": "Neety P.", "review": "I want my 5 bucks back.\n\nRed Velvet Cupcake - dry and tasted like it came from a box.  The frosting wasn't even good either and that's supposed to be the best part.  Definitely does not compare to Sprinkles Red Velvet....too bad because I would love to find a non-chain alternative .\n\nEclair - tasted old and the cream was kinda grainy.\n\nWe didn't finish either item...and it's a sin to not finish dessert.\n\nOverall, this place is not worth the calories....sorry.", "rating": 1, "date": "2008-08-09"}, {"excerpts": ["I only had the Red Velvet cupcake and Lady's Kisses, and both disappointed.  ", "The frosting on the red velvet tasted like I was downing cheesecake, and the entire cupcake was cold, which I have never experienced in all my cupcaking adventures.  "], "author": "Melinda C.", "review": "I only had the Red Velvet cupcake and Lady's Kisses, and both disappointed.  The frosting on the red velvet tasted like I was downing cheesecake, and the entire cupcake was cold, which I have never experienced in all my cupcaking adventures.  The cake was moist, but there was something a little off with the flavor too.  \n\nThe lady's kisses - it looks like a macaron so I thought it was be like a macaron, but it's not at all.  It's not soft and chewy ... it's crispy and crumbles.  Tasty, but not what I was expecting.", "rating": 2, "date": "2009-02-02"}, {"excerpts": ["And the carrot cupcake is perfect, just like the red velvet cupcake! ", "delish! "], "author": "Christiana R.", "review": "My sister and I have been searching the city for red velvet cupcakes and luckily, we stumbled upon this place. Their cupcakes are amazing and this is now our go-to place for cupcakes and other pastries. First off, the red velvet cupcakes here are sooooo good. They are super moist and just the right amount of sweetness. The frosting is also perfect, not too sweet and not too plain. The other cupcakes they offer are also really good! The hostess-looking cupcake is really delicious, especially with the cream-filling. The lemon-drop cupcake has a nice zing to it. And the carrot cupcake is perfect, just like the red velvet cupcake! delish! Also my sister gets the personal-size cheesecakes from here and it looked and tasted amazing!\n\nI really like the location of this bakery. A lot of restaurants and clothing stores in the neighborhood. There is also a lot of metered parking so it shouldn't be too tough to find parking.", "rating": 4, "date": "2008-06-28"}, {"excerpts": ["I especially liked the red velvet cupcake I had.  ", "Nothing is dry or too moist.  "], "author": "Benita E.", "review": "Everything I've ever had here has been so delicious.  I especially liked the red velvet cupcake I had.  Nothing is dry or too moist.  Their counter people are very nice, attentive and helpful.  \n\nMy one gripe came just recently, when I ordered a birthday cake.  First of all I tried to email them, asking if I could provide my order via email.  This was a few days before my desired date.  No response.  So I figured to go in to make sure I can order and get it by that Saturday.  I went over my choices w/ my sales lady, and requested the \"Parisian\" trim, which costs an extra $4.  The day comes to pick it up; a Saturday, and mid-day Saturday on 24th Street is not always easy so I had my niece pick up the cake while I went around the block.  She said it looked good and we went on our merry way.   \n\nI get the cake home and only later to find the my Parisian trim wasn't done!  The cake, filling & frosting were fine.   I was pretty disappointed because the trim that was on there was (1) something that even I could've done and (2) wasn't even offered!  What happened?  Did the decorator do mine last and got lazy?  I later wrote an email about this to the email address provided on their website.  Only today, three and a half weeks later, did I even get any kind of response.\n\nI'd advise not to get the chocolate fudge frosting w/ the chiffon cake.  It was a bit too heavy to be on top of the cake.  It would be better off as a filling instead.  It was really good, like mouth-smacking because it was nice and thick!\n\nDon't ever try to email them about anything that has a time constraint. If they can't even respond to an email on time then they shouldn't provide it!  Also as a baker, details matter.  As minor a detail as what I wanted was, it still wasn't done and that is disappointing.\n\nSo despite the snafu, everything is a hit, from bread to cookies to cakes and tarts.", "rating": 4, "date": "2008-10-28"}, {"excerpts": ["While I myself am not prone to infidelity, I feel that the red velvet cupcake here was my sloppy one night stand. ", "It kinda took care of my craving, but I simply didn't feel good about myself afterwards. ", "And I'm certain I've had better.\n", "Anywho, I get the impression they're definitely better at their breads than their desserts."], "author": "Alona N.", "review": "It's the beginning of the year and I've been trying to curb my sweet tooth desires. I successfully gave up coffee last year, so I've really been trying to stick true to my resolution of cutting down on sweets.\nYou know how they say if you're gonna cheat, it should be with someone hot? While I myself am not prone to infidelity, I feel that the red velvet cupcake here was my sloppy one night stand. It kinda took care of my craving, but I simply didn't feel good about myself afterwards. And I'm certain I've had better.\nAnywho, I get the impression they're definitely better at their breads than their desserts.", "rating": 3, "date": "2010-01-19"}, {"excerpts": ["Best Red Velvet cupcake I've ever had.  ", "Cake was super moist and not too sweet, and the cream cheese frosting... ", "Holy Moly.... ", "Again, not too sweet, super smooth and cream cheeeeeeeeeesy!"], "author": "Cassie C.", "review": "Best Red Velvet cupcake I've ever had.  Cake was super moist and not too sweet, and the cream cheese frosting... Holy Moly.... Again, not too sweet, super smooth and cream cheeeeeeeeeesy!", "rating": 5, "date": "2012-03-14"}, {"excerpts": ["I got a red velvet cupcake to go. ", "The only reason why I did not give all five stars was because unless you buy a little box to take the cupcake in, they put it in a white bag which doesn't work too well because ", "then you have the delicious frosting all over the inside, but I guess that's not soo bad. ", "Anyway, I will definitely come back to Noe Valley Bakery...YUM!"], "author": "Maya B.", "review": "I don't live in San Francisco, but I have family here and since I'm just down in Monterey, I come to SF all the time. This morning I was starving but since we were waiting on some other people, I just wanted to grab some pastries or something good but quick. I found this place on my GPS (VZW Navigator actually) and oh my, I'm glad I did. After checking out all these other reviews on YELP, it was for sure that I had to sample some of this place. Especially the cupcakes! I HEART CUPCAKES! Anyway, there were three other people with me, so we each got a little something, my cousin got the fruit tartlet, which looked too pretty to eat, but she did anyway and it was delish! I got the Ham and Cheese Croissant, which thoroughly satisfied my appetite and my other cousin got a brownie which was incredibly rich and decadent. My husband got a sweet cheese danish and oh my, so nice and flaky as well. I got a red velvet cupcake to go. The only reason why I did not give all five stars was because unless you buy a little box to take the cupcake in, they put it in a white bag which doesn't work too well because then you have the delicious frosting all over the inside, but I guess that's not soo bad. Anyway, I will definitely come back to Noe Valley Bakery...YUM!", "rating": 4, "date": "2011-07-03"}, {"excerpts": ["Every time I come here, I've the hopes of getting a sticky bun or red velvet cupcake. ", "And every time I come, they're sold out. ", "They're absolutely delish and a staple for every Ferry Building Farmer's Market trip. ", "Head up to Noe Valley early - the treats get snatched up quick."], "author": "Erika C.", "review": "Every time I come here, I've the hopes of getting a sticky bun or red velvet cupcake. And every time I come, they're sold out. They're absolutely delish and a staple for every Ferry Building Farmer's Market trip. Head up to Noe Valley early - the treats get snatched up quick.", "rating": 4, "date": "2009-01-15"}], "mostess cupcake": [{"excerpts": ["Now that Hostess is on their way out (or so it's been reported) there's even more of a reason to come by and grab one of their Mostess cupcake. \n\n"], "author": "Esther A.", "review": "Now that Hostess is on their way out (or so it's been reported) there's even more of a reason to come by and grab one of their Mostess cupcake. \n\nNever had anything bad here. Everytime we walk by we make it a point to drop in. The window displays do a great job of enticing you to do so.\n\nFriendly employees.", "rating": 4, "date": "2012-11-18"}, {"excerpts": ["The mostess cupcake is a crowd pleaser from kids to the most refined foodie friends.\n", "So thanks to Noe Valley Bakery I never need to bake again- ", "but please order ahead because they are rightfully popular!"], "author": "Melissa B.", "review": "Noe Valley Bakery has relieved me of baking things from scratch. Their red velvet cake is the most authentic that I have ever tasted and it is comparable to my family recipe that has been handed down. The mostess cupcake is a crowd pleaser from kids to the most refined foodie friends.\nSo thanks to Noe Valley Bakery I never need to bake again- but please order ahead because they are rightfully popular!", "rating": 5, "date": "2012-11-05"}, {"excerpts": ["Mostess cupcake...to die for. ", "I ordered my dad's birthday cake here a few weeks ago. ", "Vanilla chiffon with lemon filling and everyone loved it."], "author": "Joanie M.", "review": "Mostess cupcake...to die for. I ordered my dad's birthday cake here a few weeks ago. Vanilla chiffon with lemon filling and everyone loved it.", "rating": 5, "date": "2013-01-09"}], "chocolate caramel fleur de sel": [{"excerpts": ["Cute bakery serving my favorite chocolate caramel fleur de sel cupcake and cheddar & chive scone.  \n\n"], "author": "Michelle N.", "review": "Cute bakery serving my favorite chocolate caramel fleur de sel cupcake and cheddar & chive scone.  \n\nI love the icing on this cupcake as it's not  your typical icing...it is more fudge-like.  It's rich in flavor and texture, yet not very sweet as traditional cupcake icing.   Cupcake is very moist and not so sweet as well.  Has a nice balance of salty-sweetness.", "rating": 4, "date": "2011-12-12"}, {"excerpts": ["love all the sweet baked goods ... the red velvet, boston cream pie and chocolate caramel fleur de sel cupcakes are my favs. "], "author": "cynthia q.", "review": "love all the sweet baked goods ... the red velvet, boston cream pie and chocolate caramel fleur de sel cupcakes are my favs. love the bear claws, and lately i've been trying their various muffins which are delish. \n\nit's between the post office and my bank ... which is way too convenient for me. and not so great for my waistline.", "rating": 5, "date": "2011-10-07"}, {"excerpts": ["Boston Creme Cupcake and chocolate Caramel Fleur de Sel Cupcake.  ", "Size of cupcakes. ", "Very moist cupcakes.  ", "Perfect frosting. ", "Pimp parking ", "I got that day.  "], "author": "Maybelline C.", "review": "Likes: Boston Creme Cupcake and chocolate Caramel Fleur de Sel Cupcake.  Size of cupcakes. Very moist cupcakes.  Perfect frosting. Pimp parking I got that day.  Quick service.\n\nDislikes: Red Velvet Cupcake and Carrot Cake Cupcake (they were good, just had better). The fact that I only have one stomach and could not fit anymore sweets or other baked goods in my belly.  Size of bday cake for my co-worker.  I wanted more. \n\nNoe Valley Bakery, you are a danger to my health.  I will probably need to rethink my diet plan after learning about you, but I plan on making a return.", "rating": 4, "date": "2009-11-03"}, {"excerpts": ["chocolate caramel fleur de sel: the icing of chocolate ganache was just the right degree of stickiness and richness. ", "the sprinkling of salt on top - yeeeeee! ", "no trace of caramel in the ganache though, which was a bummer for all of a half-second. ", "the chocolate cake was chocolatey without being overwhelming, terrific texture. ", "it's filled with what's supposed to be caramel bavarian cream, but again, no trace of caramel flavor here. ", "the cream filling was wonderfully light, flavorsome, and refreshing with bites of cake and ganache. "], "author": "Eliza D.", "review": "devoured three whole cupcakes yesterday evening, with no regrets whatsoever. wanted the cupcake-eating experience to last for a wee bit longer, but once i started munching, there was no way to pace myself. one bite and i got transported to my fat kid happy place.\n\nall the cupcakes i had were not at all dry, nor were they unpleasantly sticky-moist. in short, beautiful.\n\nchocolate caramel fleur de sel: the icing of chocolate ganache was just the right degree of stickiness and richness. the sprinkling of salt on top - yeeeeee! no trace of caramel in the ganache though, which was a bummer for all of a half-second. the chocolate cake was chocolatey without being overwhelming, terrific texture. it's filled with what's supposed to be caramel bavarian cream, but again, no trace of caramel flavor here. the cream filling was wonderfully light, flavorsome, and refreshing with bites of cake and ganache. no disappointment if i just took out the word 'caramel' from the cupcake name.\n\ncarrot cupcake: oh my. the carrot cake was of perfect density and moistness, amazing flavor in every bite. beautiful to look at too, as the cake had a generous amount of grated carrot, bits of walnut for great texture, and whatever else is supposed to be in a terrific carrot cake. the cream cheese icing? good universal energy almighty. just gotta keep on eating.\n\nred velvet cupcake: the chocolatey earthiness of the red velvet cake was divine. i can't remember the last time i had such a full-bodied-tasting red velvet cake before. the flavor and texture was on point, and i felt like i was inhaling the earthy taste in my nose with every mouthful that i chew. and the cream cheese icing? GOOD UNIVERSAL ENERGY ALMIGHTY. gorgeous.\n\ncrave crave crave crave crave crave crave crave", "rating": 5, "date": "2012-01-21"}], "the republic": [{"excerpts": ["I recently tried \"The Republic\" cupcake to my dismay. ", "After a few bites of trying to convince myself that it wasn't that bad, I had to toss it.  ", "Their Brown Butter Cookie is fabulous, and their quiche is pretty good.  ", "What's good is great, and what isn't --really isn't."], "author": "Whitney P.", "review": "Almond croissant was definitely on the sweeter side, but still delicious.  I highly reccomend it.  I recently tried \"The Republic\" cupcake to my dismay. After a few bites of trying to convince myself that it wasn't that bad, I had to toss it.  Their Brown Butter Cookie is fabulous, and their quiche is pretty good.  What's good is great, and what isn't --really isn't.", "rating": 3, "date": "2015-10-25"}], "dippd mini cupcake": [], "mostess mini cupcake": [], "red velvet mini cupcake": [], "vanillavanilla mini cupcake": [], "banner dark blend sightglass coffee coffee": [], "doppio": [], "au lait  americano": [], "valhrona mocha": [], "honey milk tea": [{"excerpts": ["They also have a honey milk tea that's really comforting. ", "And they serve sight glass coffee. ", "One star off because they keep adding a price increase. ", "As if the stuff isn't already pricey!"], "author": "Laura T.", "review": "Cute little bakery shop in Noe Valley. Since I'm in the neighborhood frequently, once in awhile I like to make a stop. My favorite things from this bakery:\n\nTcho chocolate bun\nBrown butter blueberry muffin \nSavory slab of mushroom, creme fraiche, shallots\nFresh fruit tart \nSea salt caramel cupcake\nBrown butter salty cookie \nBrownies (super rich!)\nSalted caramel macarons (by Tous)\nCheesecake topped with raspberries \nStrawberry cake \nAsiago bread \n\nThey also have a honey milk tea that's really comforting. And they serve sight glass coffee. One star off because they keep adding a price increase. As if the stuff isn't already pricey!", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["The honey milk tea is really good! ", "Also enjoyed their scones, kind of crispy on the outside but fluffy on the inside."], "author": "Andrew S.", "review": "The honey milk tea is really good! Also enjoyed their scones, kind of crispy on the outside but fluffy on the inside.", "rating": 4, "date": "2016-11-20"}, {"excerpts": ["Tried the honey milk tea which was super good! ", "My friend got the vanilla tea and it tasted like hot water even when it was brown. ", "Think he might have put too much half and half in himself. ", "So as a warning do not go trigger happy with the milk/halfnhalf with your tea. ", "Whatever is prepared by your barista is good as is."], "author": "Liz N.", "review": "Got a few items here while waiting to be seated at Griddle Fresh. Was pleasantly surprised at the selection and tea. \n\nBought the chocolate croissant, cranberry meyer lemon scone, and a couple other pretty pastries. The chocolate croissant could not be warmed up because the store just opened/renovated but it was decent. The scone was crunchy on the outside and cakey on the insides. \n\nTried the honey milk tea which was super good! My friend got the vanilla tea and it tasted like hot water even when it was brown. Think he might have put too much half and half in himself. So as a warning do not go trigger happy with the milk/halfnhalf with your tea. Whatever is prepared by your barista is good as is.", "rating": 4, "date": "2014-08-09"}], "chocolate chai": [], "valhrona hot chocolate": [], "steamed vanilla milk": []}