{"assorted sashimi": [{"excerpts": ["The assorted sashimi... ", "they shoud call it the assorted sashyummy. ", "The assortment comes with three diff types of sashimi (three piece of each type = 9 pieces total, math wizards), and three fresh oysters! ", "Plus a bowl of rice! ", "Get ready for this... $14.99! ", "Can you believe it? ", "And the sashimi is fresh, firm and sweet. "], "author": "Darlene S.", "review": "If forgot about this place for a while, so this yelp is a kind of \"I'm sorry I forgot about you, Noriega Teriyaki House.\"\n\nA co-worker into'ed me to this place. His wife is from Japan, and he visits Japan very often, so I trust their opinions of this place as far as authenticity goes. Also, my co-worker is big guy who likes food, so he has a lot of experience in eating. \n\nAnyway...I always get the same thing here. The assorted sashimi... they shoud call it the assorted sashyummy. The assortment comes with three diff types of sashimi (three piece of each type = 9 pieces total, math wizards), and three fresh oysters! Plus a bowl of rice! Get ready for this... $14.99! Can you believe it? And the sashimi is fresh, firm and sweet. I've tasted bad preservative-doused-sashimi before, and this sashimi is oceans away from that. \n\nThe sushi rolls are the big, hunky type, not delicate, so it's good if that's what you're into. I recommend the chicken karage salad as well. The salad dressing here is different from the typical miso dressing, which I also like. \n\nI've never had the teriyaki, because I can never resist the sushi and sashimi, of course. But I really recommend this place. Oh gosh, my tummy's grumbling... gotta go!", "rating": 4, "date": "2009-09-01"}], "tuna poki": [{"excerpts": ["We didn't try the sushi, but did have the tuna poki ", "(sp?) and a roll. ", "Both were also delicious."], "author": "Christopher B.", "review": "My wife and I were looking at apartments in the area and decided to check out the local flavor for lunch. We came here only because we were passing by and decided to 'give it a try.'\n\nThis is maybe one of the best seafood soups I've had in this city. REAL FISH, not a bunch of fish balls and fake crab meat like most. This is the real deal.\n\nWe didn't try the sushi, but did have the tuna poki (sp?) and a roll. Both were also delicious.", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["The Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\n"], "author": "Jason K.", "review": "Great place to go for groups.  The best way to experience the food here is to have everything.  Well, I guess just a little of everything.\n\nThe Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\nTheir teriyaki is all pretty good.  I usually avoid salmon teriyaki 'cause the fish always seems burnt, but here that's not a problem.  The beef is also much more tender than other place I've had beef teriyaki.  I'd go for the Teriyaki Special just so you get all that teriyaki goodness with some tempura.\n\nTheir sushi is also pretty good.  The fish is fresh and reasonably priced.  It's not the highest quality, but I'm also not paying a premium.  I did have uni once and it was great.  I did have it it the day after they stocked it though, so hopefully you can get lucky by going in on stocking day.\n\nThey have some more interesting rolls on their specials, but I like to stick with the double hamachi and double sake rolls 'cause that's just lots of fish.  The spider rainbow roll is good if you're feeling like having a roll that you might have to knife and fork!\n\nParty trays are also a great way to cater.  They're all reasonably priced and they have a lot of variety, including a vegetarian platter.  So by all means, take it to go.\n\nService is decent, although a stack of empty plates/bowls can accumulate a bit much before being taken away, but I haven't had any other problems.", "rating": 4, "date": "2011-01-16"}, {"excerpts": ["i went again last friday with my friend, i ordered the everything udon...and tuna poki,\n\nI liked the tuna poki, nice flavor. "], "author": "Christine M.", "review": "i came here before with my japanese class a longgg time ago in hs, can't remember how everything was but a distinct memory of my food tasting burnt.\n\ni went again last friday with my friend, i ordered the everything udon...and tuna poki,\n\nI liked the tuna poki, nice flavor. the udon wasn't regular udon noodles, but it was good, a lot of fish in it and stuff. could kind of taste that the soup was mostly soy sauce.\n\ncame back again and their rolls were pretty good. i like unagi, so most of the rolls were saucy.  raw fishes were good too.\n\nhamachi kama was good, large pieces of the fish.\n\nservice...depends...some are great some are so emotionless...ur like...uhh...\n\ngreat place for large gatherings but not somewhere u would be craving to go to.", "rating": 3, "date": "2011-12-04"}, {"excerpts": ["We shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. ", "The dinner special was California roll, tempura and chicken teriyaki. ", "The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. ", "The teriyaki was very good as was the tempura. ", "I wasn't impressed with the California roll at all. "], "author": "Gigi F.", "review": "That's more like 2.5 stars than 3. Tonight we ate at the NTH after having not been here for awhile. I wanted to go to Sushi Zen or Fujiyama-ya. But, the BF wanted to go to this place. \n\nWe shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. The dinner special was California roll, tempura and chicken teriyaki. The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. The teriyaki was very good as was the tempura. I wasn't impressed with the California roll at all. : ( \n\nThe food was decent enough. The thing that I hated about tonight was our server seemed SO BOTHERED that we dared to ask him for anything: a fork and water refills. I only tipped 12% when I usually tip 20% or higher when service is excellent. I am sure the restaurant is family-owned and run. Look, kid...it's not my fault your parent's/extended family own this joint. You are here to serve me. I already had a long day at work, so suck it up. I always provide service with a smile. You really need to *learn* to do the same.", "rating": 3, "date": "2011-06-30"}, {"excerpts": ["The tuna poki was a tad on the frozen side. ", "The tempura that I had order with my udon tasted like it was cooked in old oil that's been sitting there for to long. ", "The tomago was on the frozen side and it was no longer fresh.", "The staff there is nice and friendly when it comes to their services."], "author": "Maile W.", "review": "I would usually give this place a 4/5 star but I'm going to give it a 3 instead. I used to love coming here when I went to go do laundry or when I was craving for some Japanese food. I had some ups and downs with this place and sadly the food quality is not how it used to be. The tuna poki was a tad on the frozen side. The tempura that I had order with my udon tasted like it was cooked in old oil that's been sitting there for to long. The tomago was on the frozen side and it was no longer fresh.The staff there is nice and friendly when it comes to their services.", "rating": 3, "date": "2011-11-13"}], "albacore tataki": [{"excerpts": ["The Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\n"], "author": "Jason K.", "review": "Great place to go for groups.  The best way to experience the food here is to have everything.  Well, I guess just a little of everything.\n\nThe Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\nTheir teriyaki is all pretty good.  I usually avoid salmon teriyaki 'cause the fish always seems burnt, but here that's not a problem.  The beef is also much more tender than other place I've had beef teriyaki.  I'd go for the Teriyaki Special just so you get all that teriyaki goodness with some tempura.\n\nTheir sushi is also pretty good.  The fish is fresh and reasonably priced.  It's not the highest quality, but I'm also not paying a premium.  I did have uni once and it was great.  I did have it it the day after they stocked it though, so hopefully you can get lucky by going in on stocking day.\n\nThey have some more interesting rolls on their specials, but I like to stick with the double hamachi and double sake rolls 'cause that's just lots of fish.  The spider rainbow roll is good if you're feeling like having a roll that you might have to knife and fork!\n\nParty trays are also a great way to cater.  They're all reasonably priced and they have a lot of variety, including a vegetarian platter.  So by all means, take it to go.\n\nService is decent, although a stack of empty plates/bowls can accumulate a bit much before being taken away, but I haven't had any other problems.", "rating": 4, "date": "2011-01-16"}], "seafood combo salad": [], "seaweed salad": [{"excerpts": ["We kept it simple with  seaweed salad to start off with(which ", "I loved) and just 2 rolls. ", "A spicy tuna roll, and the Alaska roll. ", "My friend isn't big on sushi ", "so she had the tuna roll. ", "The Alaska roll was heavy and delicious. ", "It was huge and I couldn't finish it!! "], "author": "Benjamin B.", "review": "Finally took the plunge and walked one block to this place. \n\nWas in the mood for some sushi with a friend, and I always drive and walk past here. \nThe greater/host was a very friendly kid who was quick to do all things, clean, bring tea, and was very respectful. \n\nThe place itself is kind of cool inside with a large sushi bar. We kept it simple with  seaweed salad to start off with(which I loved) and just 2 rolls. A spicy tuna roll, and the Alaska roll. My friend isn't big on sushi so she had the tuna roll. The Alaska roll was heavy and delicious. It was huge and I couldn't finish it!! Maybe not the best sushi spot, but very good, and very reasonable prices. \n\nAll washed down with a beer, wish they had draft though :(", "rating": 4, "date": "2015-01-29"}, {"excerpts": ["My sever apologized twice for the delays and brought me a free seaweed salad. ", "It's good for great food an friendly staff but don't expect to get a quick lunch here. ", "I'll try it again if its convenient."], "author": "Kayleen R.", "review": "Very very slow service but they made up for it with the delish food and friendly staff.(ramen was delish, sushi was not) My sever apologized twice for the delays and brought me a free seaweed salad. It's good for great food an friendly staff but don't expect to get a quick lunch here. I'll try it again if its convenient.", "rating": 3, "date": "2013-08-13"}, {"excerpts": ["Their wakame (seaweed salad) is my favorite of all I've tried so far. \n", "Big plus for the friendly service. ", "Their decor could use a little spice, but the fake singing bird hanging on the trees in the center of the restaurant is classic."], "author": "Sarah C.", "review": "My fiance and I used to go to to \"Noriyaki\" pretty much every day. The lovely woman who waited on us knew our order by heart. Needless to say, we like it. A lot.\nTheir wakame (seaweed salad) is my favorite of all I've tried so far. \nBig plus for the friendly service. Their decor could use a little spice, but the fake singing bird hanging on the trees in the center of the restaurant is classic.", "rating": 4, "date": "2006-06-12"}, {"excerpts": ["We shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. ", "The dinner special was California roll, tempura and chicken teriyaki. ", "The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. ", "The teriyaki was very good as was the tempura. ", "I wasn't impressed with the California roll at all. "], "author": "Gigi F.", "review": "That's more like 2.5 stars than 3. Tonight we ate at the NTH after having not been here for awhile. I wanted to go to Sushi Zen or Fujiyama-ya. But, the BF wanted to go to this place. \n\nWe shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. The dinner special was California roll, tempura and chicken teriyaki. The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. The teriyaki was very good as was the tempura. I wasn't impressed with the California roll at all. : ( \n\nThe food was decent enough. The thing that I hated about tonight was our server seemed SO BOTHERED that we dared to ask him for anything: a fork and water refills. I only tipped 12% when I usually tip 20% or higher when service is excellent. I am sure the restaurant is family-owned and run. Look, kid...it's not my fault your parent's/extended family own this joint. You are here to serve me. I already had a long day at work, so suck it up. I always provide service with a smile. You really need to *learn* to do the same.", "rating": 3, "date": "2011-06-30"}, {"excerpts": ["The seaweed salad was tasty but again, nothing special.  ", "Even though there is absolutely nothing wrong with this restaurant, there are other places in the area I would like to try out before coming back here."], "author": "Heather L.", "review": "Vegetarian sushi is such a tricky thing.  I am positive that it is not representative of the rest of the menu.  That being said, on with the review.  The veggie tempura roll and avocado maki were the best things we ordered.  The veggie variety in the tempura was particularly nice.  Tamago and futomaki were only decent but not great.  The rice was ever so slightly mushy in everything.  The seaweed salad was tasty but again, nothing special.  Even though there is absolutely nothing wrong with this restaurant, there are other places in the area I would like to try out before coming back here.", "rating": 3, "date": "2011-06-05"}, {"excerpts": ["good vegetarian sushi\ngreat miso soup and seaweed salad\nfriendly staff\n\nand its right next to my house "], "author": "Alicia V.", "review": "good vegetarian sushi\ngreat miso soup and seaweed salad\nfriendly staff\n\nand its right next to my house :)", "rating": 4, "date": "2007-05-01"}], "chicken wings": [], "harumaki": [{"excerpts": ["Harumaki to die for. ", "Teriyaki sauce is finger-licking. ", "Everything tempura is fried well, not oily or hardened. "], "author": "Elizabeth J.", "review": "This restaurant is literally my 4th home. \n\nI have been coming to this place since before I was born, in my Mama's belly, at its previous location. While enjoying dinner last night, my sister and dad estimated that we have frequented this establishment over 400 times since we were born. No joke. That is how devoted we are to Noriega TH. And for good reason. \n\nI could drink a barrel of their green tea. Their miso soup is ridiculously good. Harumaki to die for. Teriyaki sauce is finger-licking. Everything tempura is fried well, not oily or hardened. Fresh food, served with aesthetics in mind, by people who know you and care whether you have a happy meal. \n\nThis is a great place for family, dates, friends, or a quiet night in a sleepy neighborhood. \n\nCome check it out! I'll probably be around :)", "rating": 5, "date": "2013-02-19"}, {"excerpts": ["I ordered Sea Bass with Tempura and Harumaki ", "( Japanese Egg Rolls ). ", "My total was \"$23.90", "\" When I got home ", "I noticed they didn't give me a Salad or Soup. ", "I called the restaurant and asked the Lady, \"Am I supposed to get a Soup and Salad with my Dinner?", ", I think You guys FORGOT.", "\" ", "Then she said,\" You're not supposed to get a Salad ", "but definitely I'm Supposed to get a Soup with my Dinner\" . ", "Then , that's it!  ", "NO SORRY! ", "The Harumaki was so greasy that when i bit into it some of the Grease or Oil, however you want to call it, pour out all over my lips and mouth.", "Not much Stuffing in the Harumaki. ", "I can't tell if there's vegetables, glass noodles, shrimp or beef inside. "], "author": "myra a.", "review": "I went here today after work for my dinner ( To Go ). I ordered Sea Bass with Tempura and Harumaki ( Japanese Egg Rolls ). My total was \"$23.90\" When I got home I noticed they didn't give me a Salad or Soup. I called the restaurant and asked the Lady, \"Am I supposed to get a Soup and Salad with my Dinner?, I think You guys FORGOT.\" Then she said,\" You're not supposed to get a Salad but definitely I'm Supposed to get a Soup with my Dinner\" . Then , that's it!  NO SORRY! About that and then  there's a few seconds of silence, and I said, \"OH OK, Thank-You!\" \n\nWhen I opened the Box not much Sea Bass on top of  LOT AND LOTS OF RICE ( The Sea Bass is so tiny and definitely NOT FRESH  - The part that's DISGUSTING and WEIRD is that it Taste BITTER! ) The Tempura consist of 1 small carrot the size of my pinkie, one zucchini ( and again the size of my pinkie ), One Broccoli and Two Pieces of Shrimp. All of This was Fried to Death That I can't even Tell if it's really a Shrimp that I am Eating or is it one of the Vegetables. \n\nThe Harumaki was so greasy that when i bit into it some of the Grease or Oil, however you want to call it, pour out all over my lips and mouth.Not much Stuffing in the Harumaki. I can't tell if there's vegetables, glass noodles, shrimp or beef inside. Again the Egg Rolls was DOWNSIZED to a MIDGET size PINKIE!\n\nSadly,Today I got ROBBED!!! Even though I got Robbed TODAY!  I will NEVER! NEVER! , EVER COMING BACK!! So Basically, You guys just ROBBED me ONCE! It Won't Happen Again! Noriega Teriyaki House Lost a Customer For Life!! \n\nP.S. ****  Kindly Train Your employees on the Proper Etiquette of Customer Service and Apologizing when you guys made a MISTAKE and not be so  MIGHTY HIGH and PROUD!!  A simple \" I'm Sorry we FORGOT to give you Soup with your Dinner Will Do\". Just Act like you guys Give a Damned! about your Job or the Customer ( Even if you don't - just PRETEND!  ROLE PLAY ! ). Because I am a Paying Customer Right???? This is NOT  FREE FOOD RIGHT????\n\nIn the end of a Quick Phone Conversation, I am the One who Said \n\"Thank-You!\" I should have said how I was feeling that Time which is \"THANK-YOU! FOR ROBBING ME TODAY!! and THANK-YOU for YOUR  GREAT CUSTOMER SERVICE! cause it REALLY SHOWS YOU GIVE A DAMNED ABOUT YOUR WORK OR THE PAYING CUSTOMER!\" Girl! You're very Sympathetic or is it \"PATHETIC\" !!! Hehe", "rating": 1, "date": "2011-11-07"}, {"excerpts": ["The combo comes with harumaki (imperial rolls), which also contain shrimp. ", "I asked for some small way to offset the lack of harumaki, maybe a piece or two of gyoza, which is the same price on the menu. ", "It seemed like a reasonable request to me. ", "The lady on the phone flat out refused to make any sort of accommodation for me. ", "Sure she agreed to keep the tempura veggie only, but she refused to offset the loss of harumaki and shrimp with anything else. ", "This restaurant would be saving money by not including those things in the meal, and they think it's okay to just shrug their shoulders and say \"hey, you have an allergy", "...sucks for you.", "\" ", "NOT OKAY. ", "They were convenient, but I'm not giving them anymore business."], "author": "Daren P.", "review": "I've been coming here for years because it's in my neighborhood. Food has always been passable; I have to be in a mood to settle. But I recently tried to place an order for a friend who has a shellfish allergy. All I wanted was to get the beef teriyaki + tempura combo, with no shrimp. The combo comes with harumaki (imperial rolls), which also contain shrimp. I asked for some small way to offset the lack of harumaki, maybe a piece or two of gyoza, which is the same price on the menu. It seemed like a reasonable request to me. The lady on the phone flat out refused to make any sort of accommodation for me. Sure she agreed to keep the tempura veggie only, but she refused to offset the loss of harumaki and shrimp with anything else. This restaurant would be saving money by not including those things in the meal, and they think it's okay to just shrug their shoulders and say \"hey, you have an allergy...sucks for you.\" NOT OKAY. They were convenient, but I'm not giving them anymore business.", "rating": 1, "date": "2014-05-20"}, {"excerpts": ["The harumaki (the imperial rolls) that come with dinner also have shrimp in them, and I cannot eat them. ", "I called for take-out, made my usual order, but this time I asked if I could replace my harumkai for something without shrimp in it. "], "author": "Hannah P.", "review": "I'm giving this place 1 star because even though the food is ok, the service is BEYOND terrible. I'm allergic to shellfish but I enjoy the beef teriyaki and tempura combo dinner (sans prawns of course). The harumaki (the imperial rolls) that come with dinner also have shrimp in them, and I cannot eat them. I called for take-out, made my usual order, but this time I asked if I could replace my harumkai for something without shrimp in it. The woman I spoke to told me no, even though the gyoza is the EXACT same price as the rolls for the exact same amount (according to their online menu). I said that was ok, but if should replace the rolls with something else that would be great! Her suggestion? Would you like more salad? Seriously? SALAD? Was she going to include a leaf or two more? Or maybe actually provide a decent amount of greens to dressing? Who knows. I said that wasn't really a comparable and if she could maybe include another ice cream or perhaps some extra tempura veggie pieces... She then tried to tell me to \"order something else.\" Really?!  What else was I going to order?! I don't understand why this place, and this woman on the phone, are so unaccommodating. So even though the food is actually pretty alright, I don't think I'll be going back anytime soon. Terrible service!", "rating": 1, "date": "2014-05-20"}, {"excerpts": ["In addition you get the basic soup, sunomono, appetizer (harumaki), steamed rice, and ice cream. ", "Most of the time I can't finish the meal, it's so much food. "], "author": "Candace F.", "review": "This is a great neighborhood Japanese restaurant. It's cozy and the service staff is a swift and friendly. I usually order the Teriyaki dinner special at $13.95 per person if I'm really hungry. This meal includes: tempura, beef teriyaki, salmon Isobe-age, and chicken karage. In addition you get the basic soup, sunomono, appetizer (harumaki), steamed rice, and ice cream. Most of the time I can't finish the meal, it's so much food. The sushi rolls are good too! \n\nUsually this place gets packed during dinner time on weekends so show up early (before 6PM). There's a back room if you want to have a private party. Thumbs up for the convenient location and portion size.", "rating": 4, "date": "2007-11-01"}], "gyoza": [{"excerpts": ["What saved my experience was the gyoza. ", "I enjoyed it ", "but like I said it wasn't something amazing. ", "Considering the pricing.... \n", "Since this place is named a \"teriyaki house\" the teriyaki was actually sad it didn't have that \"wow this is amazing"], "author": "John A.", "review": "Reason why doe the two star it's over priced for the quality of Japanese food. I haven't had a bad spider roll in a long time but this one kinda takes the cake... who puts lettuce in this roll?! A cheap filler I guess.  \n\nWhat saved my experience was the gyoza. I enjoyed it but like I said it wasn't something amazing. Considering the pricing.... \nSince this place is named a \"teriyaki house\" the teriyaki was actually sad it didn't have that \"wow this is amazing\" factor\n\nService was fast and responsive but the decor seems to be dated/ cheesy. \n\nIt got me full but i won't be coming back too soon. \nHey at least your waitress is pretty and polite", "rating": 1, "date": "2018-02-22"}, {"excerpts": ["I tried the sashimi platter last week, gyoza for appetizer, and had some sake. ", "I'd come back."], "author": "Corinna T.", "review": "This is a good place to satisfy your casual sushi cravings. \n\nGood service, lots of seating, and you get a good amount for what you pay for. \n\nI tried the sashimi platter last week, gyoza for appetizer, and had some sake. I'd come back.", "rating": 3, "date": "2016-09-26"}, {"excerpts": ["Then I tried the gyoza, a traditional Japanese appetizer. ", "Isn't it interesting how pot stickers and gyoza can be confused?? ", "Exactly, they're pot stickers, not gyoza.\n\n"], "author": "Perry V.", "review": "Seriously, don't bother.\n\nIt's always painful to see this kind of business taking a very proud and respectful culture's cuisine and doing such disrespect to it.\n\nLet's begin with the old gray cucumber served with some glowing viscous yellow slurp. I was scared, I lifted up the top slice and had to taste just one slice. And as I thought, it was horrible.\n\nThen I tried the gyoza, a traditional Japanese appetizer. Isn't it interesting how pot stickers and gyoza can be confused?? Exactly, they're pot stickers, not gyoza.\n\nTwo strikes..\n\nThen I was possessed to try the Chasu Ramen. As expected, dish water broth, pork boiled in something water based. Overcooked tasteless egg. Black woodear mushrooms.\n\nOk, I'm offended that you've made a mockery of Japanese food. If you're going to have a Japanese restaurant, then do the honor of making the very best possible. San Francisco has some of the very best food in the US. Did you really feel like you were offering food worthy of peoples hard earned money?\n\nDo your very best and be proud, or go work for someone else.", "rating": 1, "date": "2016-01-30"}, {"excerpts": ["Ordered: chicken udon, Gyoza, panda roll, fire and ice roll, dragon roll, fortune roll\n\nChicken udon was delicious, came with a lot of meat and the broth wasn't some run down, reused soup. ", "Gyoza is like any other place's.\n\n"], "author": "Rose L.", "review": "FINALLY a place that has ginormous sushi pieces!\n--------\nChristmas Evening; 5:30 pm; party of 20.\n\nCame with the bf and his relatives for a holiday get together.\n\n80% capacity; we got the only separated party room\n\nLow music; AC kept the room cool; plenty of waiters\n\nService: great, our server was young, quick, funny and when he needed backup he didn't hesitate to grab another person to help him grab food to us. Being able to take the orders of 20 people and remember where the orders go once they arrive is quite a feat!\n\nOrdered: chicken udon, Gyoza, panda roll, fire and ice roll, dragon roll, fortune roll\n\nChicken udon was delicious, came with a lot of meat and the broth wasn't some run down, reused soup. Gyoza is like any other place's.\n\nRolls of recommendation:\nPanda Roll: if you like sashimi, unagi, and SPICYY rolls. \nFire and Ice Roll: if you like squid. It's chewy.\nFortune Roll: another one for the sashimi-lovers.\n\nAlso, it helps that they have very nice menus. Pictures always help with the ordering process! This place isn't in my neighborhood but I definitely would come again. Great place for a big party.", "rating": 5, "date": "2014-12-28"}, {"excerpts": ["Seriously, why do they list gyoza as an appetizer if it always takes the longest to come out? ", "We had to keep flagging people down to ask about our food, and they'd explain that they were really backed up. ", "The restaurant is like a quarter full and it's 2:30pm. ", "What's going on here? "], "author": "Rachel A.", "review": "I came here around 2pm with my boyfriend, and the entire experience was a drag.\n\nFirst, they brought us an overfilled teapot (the spout was even full to the top), so when we picked it up to pour, half-brewed tea went all over the table. The server tried to explain that we were pouring wrong - homebody please, I bleed tea - and not-so-discreetly swapped our pot out for one with a working spout (turns out the other one was broken and we weren't just incompetent tea novices). \n\nThen, we waited like half an hour for our food. Seriously, why do they list gyoza as an appetizer if it always takes the longest to come out? We had to keep flagging people down to ask about our food, and they'd explain that they were really backed up. The restaurant is like a quarter full and it's 2:30pm. What's going on here? I also didn't appreciate that they didn't tell us sooner that there would be a longer-than-normal wait. \n\nWhen our food finally came, it was just OK. I think I was so miffed from the tea insult and the waiting, I'd lost my appetite. Although I usually have better experiences here, I think I'm going to take some time to cool off and try other places.", "rating": 2, "date": "2013-10-02"}, {"excerpts": ["I asked for some small way to offset the lack of harumaki, maybe a piece or two of gyoza, which is the same price on the menu. ", "It seemed like a reasonable request to me. ", "The lady on the phone flat out refused to make any sort of accommodation for me. "], "author": "Daren P.", "review": "I've been coming here for years because it's in my neighborhood. Food has always been passable; I have to be in a mood to settle. But I recently tried to place an order for a friend who has a shellfish allergy. All I wanted was to get the beef teriyaki + tempura combo, with no shrimp. The combo comes with harumaki (imperial rolls), which also contain shrimp. I asked for some small way to offset the lack of harumaki, maybe a piece or two of gyoza, which is the same price on the menu. It seemed like a reasonable request to me. The lady on the phone flat out refused to make any sort of accommodation for me. Sure she agreed to keep the tempura veggie only, but she refused to offset the loss of harumaki and shrimp with anything else. This restaurant would be saving money by not including those things in the meal, and they think it's okay to just shrug their shoulders and say \"hey, you have an allergy...sucks for you.\" NOT OKAY. They were convenient, but I'm not giving them anymore business.", "rating": 1, "date": "2014-05-20"}, {"excerpts": ["The woman I spoke to told me no, even though the gyoza is the EXACT same price as the rolls for the exact same amount (according to their online menu). ", "I said that was ok, but if should replace the rolls with something else that would be great! ", "Her suggestion? ", "Would you like more salad? ", "Seriously? ", "SALAD? ", "Was she going to include a leaf or two more? ", "Or maybe actually provide a decent amount of greens to dressing? ", "Who knows. ", "I said that wasn't really a comparable and if she could maybe include another ice cream or perhaps some extra tempura veggie pieces... ", "She then tried to tell me to \"order something else.", "\" ", "Really?!  ", "What else was I going to order?! ", "I don't understand why this place, and this woman on the phone, are so unaccommodating. ", "So even though the food is actually pretty alright, I don't think I'll be going back anytime soon. ", "Terrible service!"], "author": "Hannah P.", "review": "I'm giving this place 1 star because even though the food is ok, the service is BEYOND terrible. I'm allergic to shellfish but I enjoy the beef teriyaki and tempura combo dinner (sans prawns of course). The harumaki (the imperial rolls) that come with dinner also have shrimp in them, and I cannot eat them. I called for take-out, made my usual order, but this time I asked if I could replace my harumkai for something without shrimp in it. The woman I spoke to told me no, even though the gyoza is the EXACT same price as the rolls for the exact same amount (according to their online menu). I said that was ok, but if should replace the rolls with something else that would be great! Her suggestion? Would you like more salad? Seriously? SALAD? Was she going to include a leaf or two more? Or maybe actually provide a decent amount of greens to dressing? Who knows. I said that wasn't really a comparable and if she could maybe include another ice cream or perhaps some extra tempura veggie pieces... She then tried to tell me to \"order something else.\" Really?!  What else was I going to order?! I don't understand why this place, and this woman on the phone, are so unaccommodating. So even though the food is actually pretty alright, I don't think I'll be going back anytime soon. Terrible service!", "rating": 1, "date": "2014-05-20"}, {"excerpts": ["We shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. ", "The dinner special was California roll, tempura and chicken teriyaki. ", "The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. ", "The teriyaki was very good as was the tempura. ", "I wasn't impressed with the California roll at all. "], "author": "Gigi F.", "review": "That's more like 2.5 stars than 3. Tonight we ate at the NTH after having not been here for awhile. I wanted to go to Sushi Zen or Fujiyama-ya. But, the BF wanted to go to this place. \n\nWe shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. The dinner special was California roll, tempura and chicken teriyaki. The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. The teriyaki was very good as was the tempura. I wasn't impressed with the California roll at all. : ( \n\nThe food was decent enough. The thing that I hated about tonight was our server seemed SO BOTHERED that we dared to ask him for anything: a fork and water refills. I only tipped 12% when I usually tip 20% or higher when service is excellent. I am sure the restaurant is family-owned and run. Look, kid...it's not my fault your parent's/extended family own this joint. You are here to serve me. I already had a long day at work, so suck it up. I always provide service with a smile. You really need to *learn* to do the same.", "rating": 3, "date": "2011-06-30"}, {"excerpts": ["Gyoza were a little big, which made them seem less japanese and less crunchy good. ", "More like standard potstickers. ", "It's true the green tea ice cream was tasty, and indeed small. ", "But the kona coffee ice cream was even better. ", "Overall pretty darn good."], "author": "Sean S.", "review": "Exclnt service here! \nGood fresh fish. The fire and ice roll is a bit odd. It's a fried calamari roll with chili sauce and mayo. Strange indeed. We were told to try the beef teriyaki and it didn't disappoint. Salad and dressing were awesome. Gyoza were a little big, which made them seem less japanese and less crunchy good. More like standard potstickers. It's true the green tea ice cream was tasty, and indeed small. But the kona coffee ice cream was even better. Overall pretty darn good.", "rating": 5, "date": "2009-08-20"}, {"excerpts": ["We love the gyoza--very light for an item from the fryer.\n\n"], "author": "Rusty M.", "review": "I love this place!  The fish is always fresh, and the restaurant is clearly family owned and run.  Not the place for a \"trendy\" sushi experience, but a great place for lunch or dinner.\n\nHave been coming here for years, as have many others in the neighborhood.  We love the gyoza--very light for an item from the fryer.\n\nGive it a try.\n\nP.S.  some other review of NTH seem especially harsh.  Maybe a competitor is messing with their yelp reviews?  Decide for yourself.", "rating": 5, "date": "2007-05-30"}], "pan fried prawns": [{"excerpts": ["The Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\n"], "author": "Jason K.", "review": "Great place to go for groups.  The best way to experience the food here is to have everything.  Well, I guess just a little of everything.\n\nThe Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\nTheir teriyaki is all pretty good.  I usually avoid salmon teriyaki 'cause the fish always seems burnt, but here that's not a problem.  The beef is also much more tender than other place I've had beef teriyaki.  I'd go for the Teriyaki Special just so you get all that teriyaki goodness with some tempura.\n\nTheir sushi is also pretty good.  The fish is fresh and reasonably priced.  It's not the highest quality, but I'm also not paying a premium.  I did have uni once and it was great.  I did have it it the day after they stocked it though, so hopefully you can get lucky by going in on stocking day.\n\nThey have some more interesting rolls on their specials, but I like to stick with the double hamachi and double sake rolls 'cause that's just lots of fish.  The spider rainbow roll is good if you're feeling like having a roll that you might have to knife and fork!\n\nParty trays are also a great way to cater.  They're all reasonably priced and they have a lot of variety, including a vegetarian platter.  So by all means, take it to go.\n\nService is decent, although a stack of empty plates/bowls can accumulate a bit much before being taken away, but I haven't had any other problems.", "rating": 4, "date": "2011-01-16"}], "bbq shrimp": [{"excerpts": ["My bbq shrimp came out COLD and even after reheating, it lacked it's usual smoky flavor. ", "Everything else was just mediocre. ", "I'm not sure if this place has always been mediocre or if there was a serious decline in quality. ", "Or perhaps, I've been exposed to tastier sushi since then and now, this no longer measures up. ", "Whatever the case may be, I was pretty disappointed in this place."], "author": "Mallory L.", "review": "This used to be my go-to sushi place. However, the last time I was there, I started to question my loyalty to this place. My bbq shrimp came out COLD and even after reheating, it lacked it's usual smoky flavor. Everything else was just mediocre. I'm not sure if this place has always been mediocre or if there was a serious decline in quality. Or perhaps, I've been exposed to tastier sushi since then and now, this no longer measures up. Whatever the case may be, I was pretty disappointed in this place.", "rating": 3, "date": "2017-11-19"}, {"excerpts": ["Her BBQ shrimp was one of her favorite dishes but this time around they were cold and I had to ask the waiter to reheat it and ", "even when it was warmed up she said it lacked flavor. ", "I had the shitake maki ", "and it was good ", "but then again it's nothing special. "], "author": "Yvonne L.", "review": "My sister use to love this place and when she came home for the holidays she really wanted to eat here. Sadly she asked if it's always been mediocre or did they have a serious decline in quality. Her BBQ shrimp was one of her favorite dishes but this time around they were cold and I had to ask the waiter to reheat it and even when it was warmed up she said it lacked flavor. I had the shitake maki and it was good but then again it's nothing special. I also had the fish cake udon and it's actually just fish cake and udon noodles. They don't even have green onions or any kind of extra garnish. Kinda lame since I've never had any udon or Ramen that just came so bare minimum. Anyways my sister was disappointed at the teriyaki house and she said it didn't meet her expectations and I've never been a huge fan so it's no biggie to me.", "rating": 3, "date": "2017-01-12"}], "wonton soup": [{"excerpts": ["If I have a sudden craving for some rolls, or a veggie wonton soup, I will hit this place up.\n", "Doesn't ever really disappoint, but I wouldn't travel across town to come here."], "author": "Jane K.", "review": "This is my neighborhood joint.  If I have a sudden craving for some rolls, or a veggie wonton soup, I will hit this place up.\nDoesn't ever really disappoint, but I wouldn't travel across town to come here.", "rating": 3, "date": "2011-08-11"}, {"excerpts": ["Wonton soup (yes, nonsequitur, but it's so good!).  ", "Wait staff is kind and attentive.  ", "Decor is tacky, but I couldn't care less, my kids love it.  ", "Just don't go when I go."], "author": "Ike K.", "review": "Against my own self-interest, I'm being honest.  If you have kids, love Japanese food, this is the place.  Best Yosenabe anywhere and Wonton soup (yes, nonsequitur, but it's so good!).  Wait staff is kind and attentive.  Decor is tacky, but I couldn't care less, my kids love it.  Just don't go when I go.", "rating": 4, "date": "2009-09-15"}], "salmon kama": [], "hamachi kama": [{"excerpts": ["Their appetizers are also delicious such as, Hamachi kama, baked mussels, baked scallops, and tuna tartar.\n\n"], "author": "Emily G.", "review": "The food here is really good, so if you don't care about the service too much ...I would recommend coming here. \n\nSome of my favorite dishes here are the sashimi combinations, seared tuna, poke tuna, and various sushi rolls, such as the double sake roll,  rainbow roll, dragon roll, double tuna roll, spicy tuna roll, and many more rolls. Their appetizers are also delicious such as, Hamachi kama, baked mussels, baked scallops, and tuna tartar.\n\nThe service is either a hit or miss depending on who is serving you. There are times when the service here is great, yet other times where it is cold, and the staff seems nonchalant.", "rating": 3, "date": "2017-07-07"}, {"excerpts": ["- Hamachi Kama...fish oils to help the internal ticker..will take time to eat as you look for meaty morsels hidden behind bone, cartilage, and skin.   ", "Brings out the maggot in you.\n", "- Quails Nest....spoon of raw shrimp and other tasty sea type stuff.\n- Double Sake Roll....", "salmon lover's delight.  "], "author": "Scott L.", "review": "I am going to help you.  Yes, you.  Get the following:\n\n- Tuna Tartar...maybe get two orders, a little spicy..but life needs some spice at times.\n- Hamachi Kama...fish oils to help the internal ticker..will take time to eat as you look for meaty morsels hidden behind bone, cartilage, and skin.   Brings out the maggot in you.\n- Quails Nest....spoon of raw shrimp and other tasty sea type stuff.\n- Double Sake Roll....salmon lover's delight.  A Sake Sake Roll.\n\n Good service, clean restaurant, and plenty of street parking.", "rating": 4, "date": "2015-10-02"}, {"excerpts": ["hamachi kama was good, large pieces of the fish.\n\n"], "author": "Christine M.", "review": "i came here before with my japanese class a longgg time ago in hs, can't remember how everything was but a distinct memory of my food tasting burnt.\n\ni went again last friday with my friend, i ordered the everything udon...and tuna poki,\n\nI liked the tuna poki, nice flavor. the udon wasn't regular udon noodles, but it was good, a lot of fish in it and stuff. could kind of taste that the soup was mostly soy sauce.\n\ncame back again and their rolls were pretty good. i like unagi, so most of the rolls were saucy.  raw fishes were good too.\n\nhamachi kama was good, large pieces of the fish.\n\nservice...depends...some are great some are so emotionless...ur like...uhh...\n\ngreat place for large gatherings but not somewhere u would be craving to go to.", "rating": 3, "date": "2011-12-04"}, {"excerpts": ["when they brough over the hamachi kama, they did not bring us any apetizer plates. ", "my daughter ordered the kids combo: wonton udon & chicken katsu. ", "udon was nasty! ", "the packaged udon taste even better than this crap. ", "i would not come here again."], "author": "Alyce l.", "review": "came here yesterday for dinner with a friend and 2 kids. place was a bit dirty. service: ehh, they forgot the most common thing in a jap restuarant- plates for mixing your soy sauce and wasabi. we did order the 43 piece sashimi & sushi combo, soooo.....?  when they brough over the hamachi kama, they did not bring us any apetizer plates. my daughter ordered the kids combo: wonton udon & chicken katsu. udon was nasty! the packaged udon taste even better than this crap. i would not come here again.", "rating": 2, "date": "2011-07-05"}], "oysters on half shell": [{"excerpts": ["My bf had the Sashimi Combo Deluxe that consists of 3 Hamachi, 3 Oysters on Half Shell, 3 Maguro, 3 Sake and he liked only the Oysters and Sake (salmon).  "], "author": "Stella C.", "review": "We came here at around noon on a Sunday and I was pleasantly surprised.  They were not busy so the service was good.  I felt the food was good.  I had some salmon sashimi, california rolls, and I also tried the ramen.  My bf had the Sashimi Combo Deluxe that consists of 3 Hamachi, 3 Oysters on Half Shell, 3 Maguro, 3 Sake and he liked only the Oysters and Sake (salmon).  He said the Hamachi and Maguro was mushy.  \n\nI was impressed with the cleanliness of the restaurant as well, especially the restrooms.  I am a bit of a restroom freak and the difference between a clean and not so clean restroom could easily be the deciding factor of whether I will be back to a restaurant or not.  \n\nSo, for sure, I will back and hopefully this time around, the sashimi will make a better impression on us.", "rating": 3, "date": "2008-04-28"}], "bbq oysters": [], "deep fried calamari": [], "spicy grilled calamari": [], "steamed clams": [], "baked scallop": [], "stuffed mushroom": [], "tuna tarta": [], "agedashi tofu": [{"excerpts": ["I ordered the agedashi tofu, salmon plate, and sushi.\n", "ALL GREAT!\n", "The fried banana dessert is fantastic too!\n", "Definitely come back for more!"], "author": "Candice L.", "review": "The place is a little bit busy.\nI was wondering when my dad asked me to eat here, is the place has good food?\nYEA! Of course!\nThe place is clean.\nQuick service while there was a lot of people too!\nFriendly server.\nReasonable price.\nGOOD FOOD.\nI ordered the agedashi tofu, salmon plate, and sushi.\nALL GREAT!\nThe fried banana dessert is fantastic too!\nDefinitely come back for more!", "rating": 5, "date": "2017-01-18"}, {"excerpts": ["Agedashi tofu $5.95\n"], "author": "Sandy K.", "review": "Noriega Teriyaki House is open everyday, and this is a big plus for me; I am notorious for always going to places on their one day closed during the week.  Why can I never learn?  NTH takes the guess work out of it by being open 7 days a week.  \n\nAnyway, the space is big with plenty of tables and booths, as well as a sushi bar.  The service is good.  For example, I almost choked on a piece of lettuce, but a server was there immediately offering me water.  The food is okay; not great, but not bad either.  The menu offers many selections, and the prices are pretty cheap.  I'd go back for the convenience and cheap prices, but so far I haven't ordered anything I can't get better elsewhere.\n\nAgedashi tofu $5.95\nThey sneak in some shaved ginger on top of the tofu, so beware if you're not a fan of raw ginger.  \n\nCa roll $3.95\nI think this place uses real crab mixed with imitation crab?  \n\nSunset roll $6.95\nThe spicy tuna with shrimp tempura is tasty, but a but more sweet than spicy due to the sauce drizzled on top.", "rating": 2, "date": "2010-06-22"}], "chicken salad": [{"excerpts": ["Had the fried chicken salad, with about half the chicken on the salad as the prior visit just a week earlier.  ", "They substituted a bunch of the greasy fried dough bits in lieu of decent pieces of chicken   Dining companion received her entree more than 5 minutes later.  ", "Salmon pieces have shrunk in size, the steak has been 'thinned' to economize.  "], "author": "N C.", "review": "Have patronized this restaurant dozens and dozens of times.  Used to enjoy this neighborhood restaurant, with their friendly wait staff, easy parking and pretty decent food for the money.  Then came the price increase, and the very uneven and smaller portions.  Had the fried chicken salad, with about half the chicken on the salad as the prior visit just a week earlier.  They substituted a bunch of the greasy fried dough bits in lieu of decent pieces of chicken   Dining companion received her entree more than 5 minutes later.  Salmon pieces have shrunk in size, the steak has been 'thinned' to economize.  Sukiyaki was never quite right, weak, and off flavored.  Teacups came reeking of chlorine numerous times, though not this  last time.  I'll have to be pretty desperate to ever dine here again.", "rating": 1, "date": "2014-08-18"}, {"excerpts": ["kinda like a AZN version of Houston's Fried Chicken Salad.  ", "portions are generous. ", "the best values are the party trays - everything from sushi to tempura starting at $25. "], "author": "Jeff W.", "review": "better than a lot but not in the top tier of sushi and tempura spots in SF. chicken karaage (fried chicken) is heavy of batter and a bit dry but still tasty. it's not the traditional karaage which is considered a snack food in Japan. the karaage here is more like crunchy fried chicken fillets. they even put it in a salad here! kinda like a AZN version of Houston's Fried Chicken Salad.  portions are generous. the best values are the party trays - everything from sushi to tempura starting at $25. another winner is the Combination Lunch which includes Tempura, Beef teriyaki, and chicken karaage. this is served with cucumber salad, miso soup, and rice. only caveat is minimum order is for two. but for only $8.95 per person, you should come with someone seriously hungry to order this.", "rating": 3, "date": "2006-05-29"}, {"excerpts": ["my friend and i shared two rolls and i had a chicken salad. ", "the chicken was fried but wasn't dry and it was REALLY good, hence the REALLY. ", "I had the fried california roll and it had a little too much mayo ", "but it was still good. "], "author": "Kenny L.", "review": "this place is GREAT. their selection is real good and their rolls are GOOD period. my friend and i shared two rolls and i had a chicken salad. the chicken was fried but wasn't dry and it was REALLY good, hence the REALLY. I had the fried california roll and it had a little too much mayo but it was still good. the other roll, dont remember what it was, but it was still good too. \n\nthe last time i came here with my girlfriend, i had the udon here and it was a decent udon, but now i know that they're good for their rolls. \n\nas for the prices, they're not expensive nor cheap, just right. so if you're wanting some good sushi, i'd go here.", "rating": 4, "date": "2009-08-17"}], "chicken karaage salad": [{"excerpts": ["Today, I ordered the chicken karaage salad because my friend recommended it and why not be sort of healthy hahahhaa. ", "The sauce on it was bomb though and my friend got the chicken karaage dinner, which is similar but the sauce is different and of course the portion is bigger ", "I think. ", "I couldn't finish the entire salad, but it was close enough. ", "Ended the night with green tea ice cream because it came with the dinner ", "and it's bomb as always. ", "I've never had a bad experience here yet, so it'll remain four stars. ", "I usually come here and get a good amount of rolls and some of them satisfy my cravings"], "author": "Maggie W.", "review": "Didn't have to wait tonight and usually don't have to. Super friendly service, which is always a plus. Today, I ordered the chicken karaage salad because my friend recommended it and why not be sort of healthy hahahhaa. The sauce on it was bomb though and my friend got the chicken karaage dinner, which is similar but the sauce is different and of course the portion is bigger I think. I couldn't finish the entire salad, but it was close enough. Ended the night with green tea ice cream because it came with the dinner and it's bomb as always. I've never had a bad experience here yet, so it'll remain four stars. I usually come here and get a good amount of rolls and some of them satisfy my cravings", "rating": 4, "date": "2016-04-17"}, {"excerpts": ["We started with a chicken karaage salad which was a HUGE salad.  ", "Basically your standard with the miso dressing but with the chicken and strawberries mixed in. "], "author": "Diana R.", "review": "I went on a FABBBBBBBBBBBBBBBBULOUS DATE HERE [ok not really, it was lunchtime with my friend Miss Zombie Heart (read her reviews!)]\nfor a nice, sit down sushi place.\n\nI really loved it! Pretty quiet but cute inside, really clean and nice waitstaff. It's a pretty big restaurant but feels really cozy!\n\nWe started with a chicken karaage salad which was a HUGE salad.  Basically your standard with the miso dressing but with the chicken and strawberries mixed in. My friend suggested we split it cuz its huge and then get some rolls.\n\nFirst, the panda roll and then the q (? i think!) roll. Both were cooked rolls, no raw fishies today! Eel and tobiko (although they were green ones so maybe theres a diff name for those) and cooked salmon and spicy sauce! and both were hot, baked rolls and were delicious! The Panda roll i believe had avocado and teriyaki sauce with the eel too and it was my fave one. yummm. The second roll had the big pink fish eggs that (as Melanie described it) were salty balls that popped in your mouth aka best description ever.\n\nAdd all that food and 2 cups of tea and we were stuffed. SO stuffed we had to skip the trip to Polly Anns for ice cream and Quickly for tapioca drinks. =(  \n\nI think between the huge salad and 2 rolls we spent maybe 30 bucks? not bad considering we didn't finish our food  and were SO FULL afterwards. \n\nI'll definitely come back!! Not a fan of traveling out so far to the Sunset but it's a nice change from pricey Japantown and the now-semi boring Kitaro! =D", "rating": 4, "date": "2010-06-03"}], "baked mussels": [{"excerpts": ["I ordered the tiger roll, golden ox, and baked mussels. "], "author": "Becca W.", "review": "The worst quality unagi I have ever had the horror of eating. It's so rubbery and I hope I don't get food poisoning from this.\n\nI ordered the tiger roll, golden ox, and baked mussels. Everything is drenched in sauce which is fine because I ordered knowing that. \n\nDon't get anything unagi. Other fish is questionable. But their cooked entrees like teriyaki is fine. \n\nThey are also quite pricey for this subpar quality. I feel bad for people who come here and think it's \"good\". I'm making the trip out to Ariake on Geary street the next time I want sushi.", "rating": 1, "date": "2018-03-15"}, {"excerpts": ["Their appetizers are also delicious such as, Hamachi kama, baked mussels, baked scallops, and tuna tartar.\n\n"], "author": "Emily G.", "review": "The food here is really good, so if you don't care about the service too much ...I would recommend coming here. \n\nSome of my favorite dishes here are the sashimi combinations, seared tuna, poke tuna, and various sushi rolls, such as the double sake roll,  rainbow roll, dragon roll, double tuna roll, spicy tuna roll, and many more rolls. Their appetizers are also delicious such as, Hamachi kama, baked mussels, baked scallops, and tuna tartar.\n\nThe service is either a hit or miss depending on who is serving you. There are times when the service here is great, yet other times where it is cold, and the staff seems nonchalant.", "rating": 3, "date": "2017-07-07"}, {"excerpts": ["We shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. ", "The dinner special was California roll, tempura and chicken teriyaki. ", "The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. ", "The teriyaki was very good as was the tempura. ", "I wasn't impressed with the California roll at all. "], "author": "Gigi F.", "review": "That's more like 2.5 stars than 3. Tonight we ate at the NTH after having not been here for awhile. I wanted to go to Sushi Zen or Fujiyama-ya. But, the BF wanted to go to this place. \n\nWe shared tuna poki (Sushi Zen's is better), gyoza (decent), seaweed salad (good), baked mussels (yum) and a dinner special. The dinner special was California roll, tempura and chicken teriyaki. The dinner special comes with miso soup (tasty), rice, salad (good dressing), an orange rind and ice cream for dessert. The teriyaki was very good as was the tempura. I wasn't impressed with the California roll at all. : ( \n\nThe food was decent enough. The thing that I hated about tonight was our server seemed SO BOTHERED that we dared to ask him for anything: a fork and water refills. I only tipped 12% when I usually tip 20% or higher when service is excellent. I am sure the restaurant is family-owned and run. Look, kid...it's not my fault your parent's/extended family own this joint. You are here to serve me. I already had a long day at work, so suck it up. I always provide service with a smile. You really need to *learn* to do the same.", "rating": 3, "date": "2011-06-30"}, {"excerpts": ["I had some of my friend's baked mussels(?), which were pretty good too! ", "The rainbow sorbet, which was HELLA good, very cool and refreshing and perfect for such a warm evening. "], "author": "Audrey T.", "review": "Mmm, I've had better Japanese food. I had the chicken katsu dinner, which came with soup, salad, and dessert. The katsu was somewhat dry and lacked flavor. I tried dipping it into the katsu sauce to make it taste better, but that didn't really work. The salad was okay, but I've had better (at Sushi House in Alameda!)...and the miso soup was okay too.  I had some of my friend's baked mussels(?), which were pretty good too! The rainbow sorbet, which was HELLA good, very cool and refreshing and perfect for such a warm evening. The bill was not too damaging, and not too pricey since we ordered a lot. \n\n-1 star for the fly in my friend's glass of water (but the waiter was really nice and apologized)\n-1 star for the hair that was in the wasabi", "rating": 3, "date": "2008-05-20"}, {"excerpts": ["We also had the baked mussels.  ", "They were a bit too cheesy but not terrible.  ", "For what it was, it was too expensive.  ", "$77 dollars for two people is a bit pricey.  ", "I'm down to pay that much for something delicious, but it was pretty average.  ", "We did have a large beer and 2 small bottles of sake.  ", "I'm still hungover ", "and it's almost 1:30pm.  ", "I will probably go back and try another roll.  ", "It seems like everyone else eating there really enjoyed everything ", "(I heard a twelve year old say that his food was \"exquisite\" 8 times).  ", "Maybe I just ordered the wrong thing."], "author": "Jennifer B.", "review": "I ate here for the first time last night.  It was good but not amazing.  We ordered one roll, 2 miso soups, wakame salad, 2 orders of nigiri, and the vegetable tempura.  The pickled cucumbers that everyone raves about were weird.  We also had the baked mussels.  They were a bit too cheesy but not terrible.  For what it was, it was too expensive.  $77 dollars for two people is a bit pricey.  I'm down to pay that much for something delicious, but it was pretty average.  We did have a large beer and 2 small bottles of sake.  I'm still hungover and it's almost 1:30pm.  I will probably go back and try another roll.  It seems like everyone else eating there really enjoyed everything (I heard a twelve year old say that his food was \"exquisite\" 8 times).  Maybe I just ordered the wrong thing.", "rating": 3, "date": "2009-11-06"}, {"excerpts": ["We had the baked mussels, something tuna, and 3 other rolls. ", "I couldn't find the scallop roll that I once praised. ", "The pricing isn't bad though. ", "And I do like the complimentary pickled cucumbers they offer before your meal, but maybe cut back on the yellow sauce."], "author": "Elaine H.", "review": "I like the the designs at this place, its more Japanesy compared to some other restaurants. My first experience here was better than my second, but that's probably because we only ordered the specialty rolls that time. I really like the one with the scallops on it. Service - soso.\n\nedit for visit 5/23/08- (4 star to 3 star) the four of us came here for dinner last night at around 8 on a Friday (with the place being somewhat busy). I notice that now they have a lot of younger girls working here (highschool/college), which is nice.. but the customer service lacked. One of the girls just kept chatting with a friend or co-worker and took forever to come over (and that was only after her friend told her that we were waiting). So although a couple of them may be cute, they need to practice on their servicing skills. None of the rolls or appetizers were all that great. We had the baked mussels, something tuna, and 3 other rolls. I couldn't find the scallop roll that I once praised. The pricing isn't bad though. And I do like the complimentary pickled cucumbers they offer before your meal, but maybe cut back on the yellow sauce.", "rating": 3, "date": "2008-04-28"}], "chawanmushi": [], "chicken karaage": [{"excerpts": ["CHICKEN KARAAGE LUNCH PLATE - Boneless Chicken Deep Fried and Topped with House Special Teriyaki Sauce...", "$8.95\n", "(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=YHpaPXQ_3MHQHR7-vqeIfQ)\n", "It's different from most other chicken karaage dishes, but I liked it!  ", "It's akin to chicken katsu, but with much better breading, a much juicier texture, and much more flavorful (compared to my friend's chicken katsu that I tried).  ", "-- TERIYAKI DINNER SPECIAL - Tempura, Beef Teriyaki, Salmon Isobe-age, Chicken Karaage with Soup, Harukami (Imperial Rolls), Rice, and Ice Cream...", "$14.95 Per Person ", "(Min. ", "two orders)\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=dBqiHkGDH2AqbVE_dgZa_g)\n", "The menu says it's \"for two\", but this was more than enough for our entire table to share.  ", "I didn't try the Salmon Isobe-age, nor the \"Harukami\" (seriously...imperial rolls?), but everything else was pretty decent.  ", "The chicken karaage was tasty, the beef teriyaki was surprisingly tender, and I liked the variety and crispiness of the tempura.  "], "author": "Mike L.", "review": "After my relatives and I tried Noriega Teriyaki years and years ago, we never had a reason to go back.  The food may not have been awful, but it certainly wasn't very remarkable, let alone good.  So, imagine my surprise with how Noriega Teriyaki has suddenly become one of the go-to spots for my relatives whenever we have our impromptu get-togethers.  I mean, the only thing more surprising is how the food seems (slightly) better than I remember!\n\nFor the most part, nothing about Noriega Teriyaki stands out very much, save for the mildly random water fountain that's right in front of you when you walk in.  Both the decor and the menu are pretty typical of other teriyaki/bento box types of Japanese restaurants out there (and Chinese owned at that), but the latter does offer a wealth of choices to choose from, even if the ingredients aren't entirely authentic.\n\n-- SPICY GRILLED SQUID...$7.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=XmcR1haqkn-nBTwnc3tYvA)\nNot quite what I had expected, but not bad.  The squid itself was pretty sizable and I thought it was cooked nicely (just the right chew to it).  That said, I thought it was a little heavy on the (unagi?) sauce, which was pretty sweet.  At least they put the sriracha on the side though (which is the only thing that made this dish \"spicy\").\n\n-- CHICKEN KARAAGE LUNCH PLATE - Boneless Chicken Deep Fried and Topped with House Special Teriyaki Sauce...$8.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=YHpaPXQ_3MHQHR7-vqeIfQ)\nIt's different from most other chicken karaage dishes, but I liked it!  It's akin to chicken katsu, but with much better breading, a much juicier texture, and much more flavorful (compared to my friend's chicken katsu that I tried).  What's more, the portion was fairly generous.\n\n-- TERIYAKI DINNER SPECIAL - Tempura, Beef Teriyaki, Salmon Isobe-age, Chicken Karaage with Soup, Harukami (Imperial Rolls), Rice, and Ice Cream...$14.95 Per Person (Min. two orders)\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=dBqiHkGDH2AqbVE_dgZa_g)\nThe menu says it's \"for two\", but this was more than enough for our entire table to share.  I didn't try the Salmon Isobe-age, nor the \"Harukami\" (seriously...imperial rolls?), but everything else was pretty decent.  The chicken karaage was tasty, the beef teriyaki was surprisingly tender, and I liked the variety and crispiness of the tempura.  Solid value for the money.\n\n-- THE BOAT - 3 Slices each of Salmon, Tuna, and Yellowtail Sashimi, Tekka Maki, and Unagi,  Maguro, Hamachi, Ebi, Sake, Tako, Tai, and Saba Nigiri (23 Pieces Total)...$25.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=TTnDm0Y0oQG2_bnwUtWnIA)\nOverall, this was pretty mixed.  On the one hand, you get a good amount for what you pay and most of the fish was relatively fresh.  However, while the fish themselves looked fine (though the salmon sashimi wasn't the prettiest cut), a few weren't very tasty.  In particular, I wasn't high on the Tai Nigiri, Saba Nigiri, and Tuna Sashimi.\n\n-- BLIZZARD ROLL - Fresh Salmon, Avocado, and Tamago topped with Scallop, Ikura, Wasabi Tobiko, and Mayo...$12.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=Yi4lSzIyx8Fnnk_COyP5zw)\nEhh...this was okay.  It was cool how big the pieces of tamago were, but they overpowered the salmon inside the roll.  The scallops were nice though and I liked how the wasabi sauce added some potency too, which might have been a bit bland/delicate otherwise.\n\n-- SPIDER RAINBOW ROLL - Soft Shelled Crab topped with Tuna, Red Snapper, Mackerel, and Masago...$9.45\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=edzmm-SCSqYhcCjX_teTOQ)\nGiven how it combines two classic rolls, I can see why this is one of their more popular rolls.  Still, I thought it was just okay.  The crab was decently meaty and was fried up to a nice crispness, but I didn't care much for their choice of fish to top the fish.  \n\nAlthough the food many not have impressed, the service here is great, as it's been both fast and friendly every time I've been here.  That said, it's still all about the food.  While there are definitely better places out there to satisfy your bento box/teriyaki urges, you could definitely do worse (like with Balboa Teriyaki...).  Just stick with the hot/cooked foods, as the sushi/sashimi feels a little hit or miss to me.", "rating": 3, "date": "2016-11-27"}, {"excerpts": ["Three of us in the group ordered this ginormous lunch special including vegetable and shrimp tempura, chicken karaage, and beef teriyaki. ", "The tempura batter was on a bit too thick, so it took away from my enjoyment of the tempura. ", "However, the portions were quite generous. ", "The chicken karaage was overly battered as well, and was less like chicken karaage and rather more like a katsu. ", "The beef teriyaki had overcooked beef that was thinly sliced. ", "Overall, portions were great, but the food was mediocre. "], "author": "Michael L.", "review": "I was at a clinic nearby and a few of us decided to get Japanese for lunch. We stumbled upon this place and chose to give it a try - it's a rather spacious restaurant with Japanese decor. The staff was pretty welcoming and we were quickly seated as the restaurant was not even half full.\n\nThe food:\nSalmon teriyaki: I prefer my salmon cooked to more of a broil - with a slightly crispy outside and tender inside. The salmon here was rather overcooked, and rather uniform in texture, lacking the crispy exterior.\nTeriyaki lunch special: Three of us in the group ordered this ginormous lunch special including vegetable and shrimp tempura, chicken karaage, and beef teriyaki. The tempura batter was on a bit too thick, so it took away from my enjoyment of the tempura. However, the portions were quite generous. The chicken karaage was overly battered as well, and was less like chicken karaage and rather more like a katsu. The beef teriyaki had overcooked beef that was thinly sliced. Overall, portions were great, but the food was mediocre. Display was entertaining and it was fun to snapchat to your friends the ginormous stack of fried food.\n\nOverall, the food was average, perhaps a bit below average, but service and decor was nice. The restaurant was comfortable to enjoy lunch at and not too noisy or overcrowded. I will probably be back if I am working at the nearby clinic again, but likely to try something other than the fried food as the group of us got a bit sick from all the grease of tempura + \"karaage\" at the end of our meal.", "rating": 3, "date": "2017-02-07"}, {"excerpts": ["Today, I ordered the chicken karaage salad because my friend recommended it and why not be sort of healthy hahahhaa. ", "The sauce on it was bomb though and my friend got the chicken karaage dinner, which is similar but the sauce is different and of course the portion is bigger ", "I think. ", "I couldn't finish the entire salad, but it was close enough. ", "Ended the night with green tea ice cream because it came with the dinner ", "and it's bomb as always. ", "I've never had a bad experience here yet, so it'll remain four stars. ", "I usually come here and get a good amount of rolls and some of them satisfy my cravings"], "author": "Maggie W.", "review": "Didn't have to wait tonight and usually don't have to. Super friendly service, which is always a plus. Today, I ordered the chicken karaage salad because my friend recommended it and why not be sort of healthy hahahhaa. The sauce on it was bomb though and my friend got the chicken karaage dinner, which is similar but the sauce is different and of course the portion is bigger I think. I couldn't finish the entire salad, but it was close enough. Ended the night with green tea ice cream because it came with the dinner and it's bomb as always. I've never had a bad experience here yet, so it'll remain four stars. I usually come here and get a good amount of rolls and some of them satisfy my cravings", "rating": 4, "date": "2016-04-17"}, {"excerpts": ["This place isn't the first on my list when it comes to having sushi, but they do have some bomb ass chicken karaage. ", "If you're craving for some chicken karaage and don't feel like waiting in line, here's your spot.\n\n", "Let's talk about the chicken karaage. ", "It's a piece of thigh meat deep fried with the perfect batter. ", "Its flavorful, it's crispy, and doesn't feel greasy. ", "The batter is light and still tastes great even the next day. ", "A sweet and salty sauce is drizzled over the pieces of chicken and is served with a salad and rice. "], "author": "Cheryl Q.", "review": "Noriega Teriyaki used to get really crowded by 7pm whether it was a weeknight or weekend. This place isn't the first on my list when it comes to having sushi, but they do have some bomb ass chicken karaage. If you're craving for some chicken karaage and don't feel like waiting in line, here's your spot.\n\nLet's talk about the chicken karaage. It's a piece of thigh meat deep fried with the perfect batter. Its flavorful, it's crispy, and doesn't feel greasy. The batter is light and still tastes great even the next day. A sweet and salty sauce is drizzled over the pieces of chicken and is served with a salad and rice. This dish has tasted the same ever since I started coming to this establishment years ago. \n\nThe reason why I can't give Noriega Teriyaki 5 stars is because their sushi isn't always the best. Some days tastes better than others. I will say that their rolls are pretty large.\n\nService is hit or miss. The waiters and waitresses are always friendly, but that's if they ever come by your table.", "rating": 3, "date": "2016-08-12"}, {"excerpts": ["eats: tempera and chicken karaage lunch combo(10.95)\n-cucumber ", "salad, ", "3 refrigerated pieces, bland dressing\n-miso soup, obviously made from packaged mix, couldn't finished, strange taste\n", "-tempera, ", "ok, too much breading\n-\"chicken karaage\" actually chicken katsu, sliced like it , dry, bland meat\nasked waitress if the chicken katsu was chicken karaage\nonly dipping sauce for tempera, none for katsu, i.e. katsu served as karaage.\n2.5 stars\n\ntemaki:\n-good value "], "author": "Victor G.", "review": "Noreiga Terikayi House is definitely chinese owned so i skipped the chirashi (16.95). went for cooked japanese food. \nlarge seating location. large menu with rolls, ramen, udon, appetizers, nigiri, combs et. al. \n\neats: tempera and chicken karaage lunch combo(10.95)\n-cucumber salad, 3 refrigerated pieces, bland dressing\n-miso soup, obviously made from packaged mix, couldn't finished, strange taste\n-tempera, ok, too much breading\n-\"chicken karaage\" actually chicken katsu, sliced like it , dry, bland meat\nasked waitress if the chicken katsu was chicken karaage\nonly dipping sauce for tempera, none for katsu, i.e. katsu served as karaage.\n2.5 stars\n\ntemaki:\n-good value BUT\n-wait staff doesn't know they are serving\nkitchen also, or maybe it's deliberate\n-took pics but no time to figure how to upload/download...\n-music in background, not sure if it was japanese or not.", "rating": 2, "date": "2015-03-05"}, {"excerpts": ["Chicken karaage or tonkatsu when we eat here!  ", "Rolls aren't bad either, but not the freshest sashimi."], "author": "Michelle K.", "review": "mmm it's okay!  Not bad, but not the best.  Chicken karaage or tonkatsu when we eat here!  Rolls aren't bad either, but not the freshest sashimi.", "rating": 3, "date": "2015-08-21"}, {"excerpts": ["I ordered the unaju (eel over rice) while bf ordered chicken karaage. ", "Our orders came out suspiciously quick.. ", "Our meal came with pickled cucumbers and miso soup. ", "The unaju was filling with a huge piece of eel ", "but I probably should have opted for something else b/c ", "I learned that I can't handle too much eel. ", "Bf's chicken karaage looked ok ", "but he liked it. ", "Next time I'll probably try their sushi rolls. ", "They looked pretty good."], "author": "Emily M.", "review": "It was not bad. Our server was nice and the menu had many options. So much so that it was a little overwhelming. I ordered the unaju (eel over rice) while bf ordered chicken karaage. Our orders came out suspiciously quick.. Our meal came with pickled cucumbers and miso soup. The unaju was filling with a huge piece of eel but I probably should have opted for something else b/c I learned that I can't handle too much eel. Bf's chicken karaage looked ok but he liked it. Next time I'll probably try their sushi rolls. They looked pretty good.", "rating": 3, "date": "2015-01-25"}, {"excerpts": ["But...it's all about the CHICKEN KARAAGE", "....mmm *rubs tummy!", "*  ", "It's perfectly fried with this amazing sauce drizzled on top (teriyaki sauce?).  ", "Prices for dinner are decent considering that they give you a ginormous amount of food along with soup, salad, cucumber slices drizzled with honey mustard dressing, rice & a scoop of ice cream.  ", "Last time I got the sherbet since I don't like green tea, it was very sweet & super cold (hurted my teeth a little) "], "author": "Cat C.", "review": "My man has been coming here since he was in high school, so of course whenever I want Japanese food in the city this is where he suggests we go.  So far, I've been here twice.  But...it's all about the CHICKEN KARAAGE....mmm *rubs tummy!*  It's perfectly fried with this amazing sauce drizzled on top (teriyaki sauce?).  Prices for dinner are decent considering that they give you a ginormous amount of food along with soup, salad, cucumber slices drizzled with honey mustard dressing, rice & a scoop of ice cream.  Last time I got the sherbet since I don't like green tea, it was very sweet & super cold (hurted my teeth a little) so eat it cautiously.  \n\nI've had the chicken udon, which didn't look so appealing because of how the meat looked.  I was disappointed because it lacked flavor.  Maybe I should've asked for the chili powder?  He and I shared the Super Burrito Roll, which was shrimp tempura roll with Sriracha; it doesn't compare to a similar Crunch Roll from Joy Sushi in San Mateo, but it was still tasty.  Next time I will definitely ask for more Sriracha on the side.  \n\nService has been great both trips and parking has never been difficult.  I look forward to other visits here to try out more of their menu.  Side note: I love their adorable Chinese knocking kitty statue! hehe", "rating": 3, "date": "2009-04-30"}, {"excerpts": ["We started with a chicken karaage salad which was a HUGE salad.  ", "Basically your standard with the miso dressing but with the chicken and strawberries mixed in. "], "author": "Diana R.", "review": "I went on a FABBBBBBBBBBBBBBBBULOUS DATE HERE [ok not really, it was lunchtime with my friend Miss Zombie Heart (read her reviews!)]\nfor a nice, sit down sushi place.\n\nI really loved it! Pretty quiet but cute inside, really clean and nice waitstaff. It's a pretty big restaurant but feels really cozy!\n\nWe started with a chicken karaage salad which was a HUGE salad.  Basically your standard with the miso dressing but with the chicken and strawberries mixed in. My friend suggested we split it cuz its huge and then get some rolls.\n\nFirst, the panda roll and then the q (? i think!) roll. Both were cooked rolls, no raw fishies today! Eel and tobiko (although they were green ones so maybe theres a diff name for those) and cooked salmon and spicy sauce! and both were hot, baked rolls and were delicious! The Panda roll i believe had avocado and teriyaki sauce with the eel too and it was my fave one. yummm. The second roll had the big pink fish eggs that (as Melanie described it) were salty balls that popped in your mouth aka best description ever.\n\nAdd all that food and 2 cups of tea and we were stuffed. SO stuffed we had to skip the trip to Polly Anns for ice cream and Quickly for tapioca drinks. =(  \n\nI think between the huge salad and 2 rolls we spent maybe 30 bucks? not bad considering we didn't finish our food  and were SO FULL afterwards. \n\nI'll definitely come back!! Not a fan of traveling out so far to the Sunset but it's a nice change from pricey Japantown and the now-semi boring Kitaro! =D", "rating": 4, "date": "2010-06-03"}, {"excerpts": ["the chicken teriyaki is alright, the chicken karaage moreish. ", "the donburi is filling and comforting - great for when it's all grey and foggy outside, or when you haz a sad, seasoning it with your tears makes it extra derishuz. "], "author": "Eliza D.", "review": "ok ok so 3.5 stars.\n\ni come here because it's a short ride away on the 71. the rolls and bento boxes/chef's recommendation combos are of hearty american portions, the sukiyaki brimming with seafoodiness. the chicken teriyaki is alright, the chicken karaage moreish. the donburi is filling and comforting - great for when it's all grey and foggy outside, or when you haz a sad, seasoning it with your tears makes it extra derishuz. the tempura isn't of the delicate kind, but tasty enough and hits the spot. \n\nwhen i feel like more of a glutton than i usually am, i appreciate the bigass rolls, but there's no denying that the freshness and flavor of the seafood are lacking. quite a number of deep fried items in their rolls/deep fried rolls on the menu, as well as rolls with hella sauce in/on them, and those monster rolls with 5000 ingredients as pictured on their special rolls menu. that's basically what you're getting into when you come here, the rolls seem to overshadow the simpler makis, not in the best of ways, unless you're into the gluttonous extravagance.\n\nthe sashimi is not very choice, don't come here expecting the best of that. come here for fastfood-y type japanese food. i think the price is great for the portions given. yeah, come here to strictly nomz, not exactly to savor.", "rating": 3, "date": "2011-11-23"}, {"excerpts": ["Then I tried the Chicken Karaage, which was pretty decent.  ", "Although it tasted just like panko breaded chicken, so it was like chicken katsu to me.  "], "author": "Anna T.", "review": "Two stars only because they have gigantic portions.  But honestly, I'd rather have tiny portions of DELICIOUS food than huge portions of the saltiest food I've ever had at a Japanese restaurant. \n\nI ordered Salmon wrapped in seaweed and deep fried, which in theory should be pretty decent, but they poured this thick ass cornstarch sauce all over it and made it soggy and too salty.  Their Salmon was very fishy, too, meaning it was not fresh at all.  I hate that more than anything.  When Salmon has that fishy taste, it really means you should THROW THAT STUFF OUT!  I only ate one piece of my order.  Their fried potato was good though.... Relative to everything else.\n\nI also tried some grilled Salmon which was also too salty, but I just wiped off all the sauce on the plate so it was bearable.  Then I tried the Chicken Karaage, which was pretty decent.  Although it tasted just like panko breaded chicken, so it was like chicken katsu to me.  Also had their spider roll, which was decent, but nothing exceptional.  \n\nSure, they give you miso, and salad, and ice cream, but the green tea ice cream was too creamy and did not taste enough like tea.  I think my favorite part about this meal was their ice water flavored with lemon.  But I don't go to restaurants for that... so I'm never going here again.", "rating": 2, "date": "2009-05-25"}, {"excerpts": ["Things turned sour one night when I ordered the Chicken Karaage.  ", "There were just six of us, the food was extremely slow to arrive.  ", "(30+ minutes) ", "Eventually everyone got their orders but me;  some time passes and ", "I inquire about it's whereabouts.  ", "A few minutes later, they bring out Chicken Katsu, not what I ordered ", "but I tell them that it's fine ", "and I'll take it anyway.  ", "The waiter gets upset and snaps back (with lots of attitude) that it's the right order and that I was the one that is mistaken.  "], "author": "Justin O.", "review": "I don't get why this place is still around.  It's not as though there is a shortage of Japanese restaurants in The City.\n\nI had gone a few times because friends have wanted to go because it's in the neighborhood and we're too lazy to look for parking elsewhere.  I've sampled several of their dishes and was never really impressed.\n\nThings turned sour one night when I ordered the Chicken Karaage.  There were just six of us, the food was extremely slow to arrive.  (30+ minutes) Eventually everyone got their orders but me;  some time passes and I inquire about it's whereabouts.  A few minutes later, they bring out Chicken Katsu, not what I ordered but I tell them that it's fine and I'll take it anyway.  The waiter gets upset and snaps back (with lots of attitude) that it's the right order and that I was the one that is mistaken.  Not one to dwell on things, I finish my meal and we get our check.. \n\nInterestingly, there isn't a chicken katsu on there.  It's printed in plain english, k-a-r-a-a-g-e.  I point this out to our server and he just shrugs and throws the bill back on our table.  \n\nNot knowing what was going on, I paid for the additional cost of the karaage over the katsu and an additional cent for their trouble.\n\nNeedless to say, this place has landed on my boycott list.  Mediocre food, I can deal with sometimes, attitude too?  Pass.", "rating": 1, "date": "2008-02-26"}, {"excerpts": ["chicken karaage (fried chicken) is heavy of batter and a bit dry but still tasty. ", "it's not the traditional karaage which is considered a snack food in Japan. ", "the karaage here is more like crunchy fried chicken fillets. ", "they even put it in a salad here! ", "another winner is the Combination Lunch which includes Tempura, Beef teriyaki, and chicken karaage. ", "this is served with cucumber salad, miso soup, and rice. ", "only caveat is minimum order is for two. ", "but for only $8.95 per person, you should come with someone seriously hungry to order this."], "author": "Jeff W.", "review": "better than a lot but not in the top tier of sushi and tempura spots in SF. chicken karaage (fried chicken) is heavy of batter and a bit dry but still tasty. it's not the traditional karaage which is considered a snack food in Japan. the karaage here is more like crunchy fried chicken fillets. they even put it in a salad here! kinda like a AZN version of Houston's Fried Chicken Salad.  portions are generous. the best values are the party trays - everything from sushi to tempura starting at $25. another winner is the Combination Lunch which includes Tempura, Beef teriyaki, and chicken karaage. this is served with cucumber salad, miso soup, and rice. only caveat is minimum order is for two. but for only $8.95 per person, you should come with someone seriously hungry to order this.", "rating": 3, "date": "2006-05-29"}], "saba teriyaki or shio yaki": [], "salmon isobeage": [], "salmon teriyaki or shio yaki": [], "seafood kushi yaki": [{"excerpts": ["seafood kushi yaki."], "author": "Sachi T.", "review": "I had the seafood kushi yaki and it was AWESOME. A good amount of food for the price. Included a bunch of fish, shrimp, mussels, oysters, and squid on a plate with salad and skewers with vegetables and teriyaki sauce. For $10!!!\n\nAlso came with sunomono (if you can even call 3 pieces of cucumber sunomono), rice, miso soup (whose quantity of seaweed and tofu cancel out the scarcity of sunomono), and ice cream!!!\n\nseafood kushi yaki.", "rating": 4, "date": "2011-08-27"}], "sukiyaki": [{"excerpts": ["It was also strange how my friend ordered sukiyaki and they completely forgot to add the clear noodles that come with the sukiyaki.  "], "author": "Christina L.", "review": "Mehhhhhhhhhhhhhhhhhhhhhhhhhh\n\nI ordered the vegetable soba, expecting a cold soba with some veggies.  It arrived piping hot to my surprise, and normally I wouldn't mind but it was like 90 degrees today and I just wanted to COOL DOWN but this dish was definitely opening all the pores on mah face giving me a steaming facial it was so hot not what I was anticipating.  Also, not sure if soba noodles are traditionally ever served hot, they were quite soggy in the hot broth. Usually I always see them served as zaru soba....on a bamboo mat over ice with a cold sweet dipping sauce. Or as ten zaru with some type of tempura, but this was wayyyy weird having hot soba lol NEVER AGAIN. \n\nIt was also strange how my friend ordered sukiyaki and they completely forgot to add the clear noodles that come with the sukiyaki.  They promptly brought over a side of clear noodles when we notified them of the missing noodles, and all was well.  \n\nAlso, what kid of Japanese restaurant serves deep fried salmon wrapped in seaweed as an entree??? So. Weird.  My friend ordered it and said it was decent but w.t.f. I guess the chef is trying to be innovative but the Japanese half of me was slightly offended. \n\nI was with 7 other people and for some reason my dinner didn't come with soup, rice, or ice cream like everyone else....so weird, but they pittied my lack of sides and gave me ice cream at the end because they felt sorry for me hahahah so nice.\n\nOverall, I have to say the service was great, my low rating is because the food is not good.  Everyone complained how it was too fatty, or lacked flavor, or didn't taste right.  Not impressed by the food, but I do have to say props to awesome wait staff!", "rating": 2, "date": "2015-07-20"}, {"excerpts": ["kind of on the lukewarm side\nSukiyaki & tempura- big portions.  ", "loved all the cabbage and bean sprouts.  ", "the meat was a little over cooked.  ", "good soup base\n", "Salmon Poki- right amount of spice\n", "Caterpillar Roll- HUGE.  ", "if you can put this all in your mouth in one move, kudos to you! "], "author": "Linda N.", "review": "3.5\n\nMediocre, fast-food type of place.  The food isn't bad but it wasn't great either.\n\nSalmon Sashimi- large pieces.  kind of on the lukewarm side\nSukiyaki & tempura- big portions.  loved all the cabbage and bean sprouts.  the meat was a little over cooked.  good soup base\nSalmon Poki- right amount of spice\nCaterpillar Roll- HUGE.  if you can put this all in your mouth in one move, kudos to you! size doesn't really matter, it's all about the taste\nDragon Roll- good size\n\nThis is a great option for a Japanese restaurant in the neighborhood.  Like the kind when you can't think of anything to eat and settle for something mediocre kind of place.\n\nStaff is very attentive.", "rating": 3, "date": "2013-08-01"}, {"excerpts": ["Went with the sukiyaki and tempura combo. ", "Definitely underestimated the amount of food I would receive!! ", "Got some egg rolls, miso soup, side of rice, side of cucumbers, the actual bowl of sukiyaki and the tempura. ", "And ice cream. ", "I'm small ", "and I constantly order with my eyes instead of my stomach. ", "Sadly the sukiyaki wasn't my complete favorite. ", "Really salty, and the texture of the meat was really off. ", "Typically I enjoy this dish. "], "author": "Kristine T.", "review": "Went here for dinner on a Tuesday evening. Was craving some Asian food, with noodles and soup. Happened to be in the area doing some laundry, so I found this place out of convenience down Noriega. \n\nThe decor is very nice, definitely reflects a typical Japanese restaurant. Was seated quickly and given some lovely tea to start. \nWent with the sukiyaki and tempura combo. Definitely underestimated the amount of food I would receive!! Got some egg rolls, miso soup, side of rice, side of cucumbers, the actual bowl of sukiyaki and the tempura. And ice cream. I'm small and I constantly order with my eyes instead of my stomach. This is a perfect example of that. \n\nMy favorites were the tempura, miso soup, and eggrolls. All of it was crisp and freshly cooked. Burned my tongue. I get excited to eat sometimes.\n\nSadly the sukiyaki wasn't my complete favorite. Really salty, and the texture of the meat was really off. Typically I enjoy this dish. Also served in a hot pot, which was nice but may have overcooked the food.\n\nDespite that, the service was very attentive, the rest of the food was good and what I got was reasonably priced. I'm down to try this place again!", "rating": 4, "date": "2013-11-03"}, {"excerpts": ["What made me fall in love with this place was the fact that they have sukiyaki for cheap! ", "Only $8! ", "Oh mah gawddddd! ", "Sukiyaki is hard to find in Japanese restaurants and even so if you order one they`re verrrrry expensive!\n\n"], "author": "Johanah I.", "review": "It seems like the first time you go to a restaurant it`s always AMAZING! That`s what I thought of at first but the 2nd time I came here it did not beat the first time.\n\nReason why I say that is because whoever made my sushi for my first visit was unforgivable. The rolls were decently shaped, they were generous on the fish meat, and it was very delicious. But on my 2nd visit here.. whoever made my sushi was the opposite! They loaded on the rice and the slices of fish meat were thin and tearing apart.. Not cool at all.\n\nWhat made me fall in love with this place was the fact that they have sukiyaki for cheap! Only $8! Oh mah gawddddd! Sukiyaki is hard to find in Japanese restaurants and even so if you order one they`re verrrrry expensive!\n\nPlease... on my 3rd visit I hope you improve the sushi like my first visit then maybe I`ll edit this review and make it better!", "rating": 4, "date": "2013-06-19"}, {"excerpts": ["I got the sukiyaki and tempura combo. ", "It comes with soup, egg rolls and ice cream.", "The sukiyaki was bland and noodles hard. ", "No veggies included. "], "author": "Adrienne C.", "review": "Went here for dinner. I got the sukiyaki and tempura combo. It comes with soup, egg rolls and ice cream.Friend got the tonkatsu and chicken combo. Service is pretty standard. \n\nPro: Eggrolls Tea.\n\nCon: The sukiyaki was bland and noodles hard. No veggies included. Tonkatsu and chicken thin and dry.\n\nLocation is too out of the way for me to come again.", "rating": 2, "date": "2013-01-01"}, {"excerpts": ["if i had known i woulda ordered the sukiyaki!  ", "I was a tad disappointed to see this happen at one of my fav japanese restaurants.. "], "author": "Kristen T.", "review": "Was it just me or did everyone else think that the tempura udon would be garnished with the regular fish cake, seaweed, and all the other japanese foodsies?  Well i went the other day and obviously ordered the tempura udon.  WHen i got it..there was a plentiful amount of tempura, but the udon was just plain noodles and soup!  I was pretty sad when i saw it and if i had known i woulda ordered the sukiyaki!  I was a tad disappointed to see this happen at one of my fav japanese restaurants.. =(\n\non a brighter note, the sushi was tasty as usual with a lovely presentation on rectangular dishes.  Big points for them because we thought we ordered something else and when it came out it was a sushi roll completely different than what we expected.  At first we thought that the waitress had it wrong, but after looking at the menu we realized we ordered the wrong thing.  After telling our server, they replaced it for us free of charge and didn't give us any attitude whatsover! =)", "rating": 4, "date": "2010-01-01"}, {"excerpts": ["Sukiyaki was never quite right, weak, and off flavored.  ", "Teacups came reeking of chlorine numerous times, though not this  last time.  ", "I'll have to be pretty desperate to ever dine here again."], "author": "N C.", "review": "Have patronized this restaurant dozens and dozens of times.  Used to enjoy this neighborhood restaurant, with their friendly wait staff, easy parking and pretty decent food for the money.  Then came the price increase, and the very uneven and smaller portions.  Had the fried chicken salad, with about half the chicken on the salad as the prior visit just a week earlier.  They substituted a bunch of the greasy fried dough bits in lieu of decent pieces of chicken   Dining companion received her entree more than 5 minutes later.  Salmon pieces have shrunk in size, the steak has been 'thinned' to economize.  Sukiyaki was never quite right, weak, and off flavored.  Teacups came reeking of chlorine numerous times, though not this  last time.  I'll have to be pretty desperate to ever dine here again.", "rating": 1, "date": "2014-08-18"}, {"excerpts": ["the rolls and bento boxes/chef's recommendation combos are of hearty american portions, the sukiyaki brimming with seafoodiness. "], "author": "Eliza D.", "review": "ok ok so 3.5 stars.\n\ni come here because it's a short ride away on the 71. the rolls and bento boxes/chef's recommendation combos are of hearty american portions, the sukiyaki brimming with seafoodiness. the chicken teriyaki is alright, the chicken karaage moreish. the donburi is filling and comforting - great for when it's all grey and foggy outside, or when you haz a sad, seasoning it with your tears makes it extra derishuz. the tempura isn't of the delicate kind, but tasty enough and hits the spot. \n\nwhen i feel like more of a glutton than i usually am, i appreciate the bigass rolls, but there's no denying that the freshness and flavor of the seafood are lacking. quite a number of deep fried items in their rolls/deep fried rolls on the menu, as well as rolls with hella sauce in/on them, and those monster rolls with 5000 ingredients as pictured on their special rolls menu. that's basically what you're getting into when you come here, the rolls seem to overshadow the simpler makis, not in the best of ways, unless you're into the gluttonous extravagance.\n\nthe sashimi is not very choice, don't come here expecting the best of that. come here for fastfood-y type japanese food. i think the price is great for the portions given. yeah, come here to strictly nomz, not exactly to savor.", "rating": 3, "date": "2011-11-23"}, {"excerpts": ["their menu looked promising, but their sukiyaki was horrible!\n\n", "but how can you mess up sukiyaki...??"], "author": "Diana T.", "review": "their menu looked promising, but their sukiyaki was horrible!\n\nthree slices of overcooked/really DRY beef, and it was all BEAN SPROUTS and three pieces of tofu. it was tasteless, i could've made better at home.\n\ni felt like i was just eating a big cowl of bean sprouts... \n\ni might give it another shot one day since i live down the block.\n\nbut how can you mess up sukiyaki...??", "rating": 2, "date": "2008-07-25"}, {"excerpts": ["The sukiyaki was half way decent ", "and I never did get my ice cream. ", "Their cooked salmon roll was awful, the salmon was over cooked and made the avocado turn a shade too dark for my taste. ", "Not going back unless I have to. ", "At one time i remember it being good. ", "New chef?"], "author": "Christopher C.", "review": "Either the food has gotten worse or my palate has improved the last time i went to this place. The sukiyaki was half way decent and I never did get my ice cream. Their cooked salmon roll was awful, the salmon was over cooked and made the avocado turn a shade too dark for my taste. Not going back unless I have to. At one time i remember it being good. New chef?", "rating": 2, "date": "2008-10-13"}], "vegetable sukiyaki": [], "vegetable tempura": [{"excerpts": ["My partner & I just felt the vegetable tempura lacked a little seasoning & the plates we had could've used some sweetness for balance. ", "We enjoyed what sushi we had & would visit again to explore the menu a little further."], "author": "Fi M.", "review": "Lovely service & great portions. My partner & I just felt the vegetable tempura lacked a little seasoning & the plates we had could've used some sweetness for balance. We enjoyed what sushi we had & would visit again to explore the menu a little further.", "rating": 4, "date": "2016-10-28"}, {"excerpts": ["I like it when you order vegetable tempura, because they give you a variety of vegetables such as pumpkin, string beans, onion, broccoli, carrot, potato, and eggplant. ", "Once I found a fly in my Spider Roll - bleck! ", "It was delivery, so I couldn't really complain. ", "Not to mention, I've had better", ", fresher Spider Rolls elsewhere. ", "AND I prefer it with cucumber or avocado rather than lettuce. ", "Lettuce is more for salads, not sushi... with the exception of decoration. "], "author": "Priscilla W.", "review": "I've dined-in once or twice, and the entrance and overall decor is pretty nice. But my family usually orders for delivery and it arrives within 30 to 45 minutes. Most of the time, upon arrival, the food is at a hot/warm temperature. Also, they sometimes give various \"on the house\" items such as mochi covered strawberries.\n\nI usually order Salmon Teriyaki and the size of the two salmon fillets have changed from large to small to large again. I think it may have to do with the varying size of their to-go containers. However, I love how they give you two fillets whereas other restaurants usually give you one. The Chicken Teriyaki consists of half dark meat and half white meat. Sometimes there's too many burnt edges for me to fully enjoy. The Chicken Kara-Age and Salmon Isobe-Age are pretty good as well. And I think their shrimp tempura have gotten smaller and smaller. I wouldn't recommend the udon here. You can get better tasting noodles and broth elsewhere for more or less, the same price. I like it when you order vegetable tempura, because they give you a variety of vegetables such as pumpkin, string beans, onion, broccoli, carrot, potato, and eggplant. Once I found a fly in my Spider Roll - bleck! It was delivery, so I couldn't really complain. Not to mention, I've had better, fresher Spider Rolls elsewhere. AND I prefer it with cucumber or avocado rather than lettuce. Lettuce is more for salads, not sushi... with the exception of decoration. I think ordering from here so often has gotten me pretty used to the food.\n\nOverall, Noriega has a huge variety of special rolls, maki sushi, nigiri sushi, appetizers, and combination dinners to choose from, at really reasonable prices! Huge portions too! I always have leftovers.", "rating": 4, "date": "2008-08-04"}, {"excerpts": ["We ordered one roll, 2 miso soups, wakame salad, 2 orders of nigiri, and the vegetable tempura.  ", "The pickled cucumbers that everyone raves about were weird.  "], "author": "Jennifer B.", "review": "I ate here for the first time last night.  It was good but not amazing.  We ordered one roll, 2 miso soups, wakame salad, 2 orders of nigiri, and the vegetable tempura.  The pickled cucumbers that everyone raves about were weird.  We also had the baked mussels.  They were a bit too cheesy but not terrible.  For what it was, it was too expensive.  $77 dollars for two people is a bit pricey.  I'm down to pay that much for something delicious, but it was pretty average.  We did have a large beer and 2 small bottles of sake.  I'm still hungover and it's almost 1:30pm.  I will probably go back and try another roll.  It seems like everyone else eating there really enjoyed everything (I heard a twelve year old say that his food was \"exquisite\" 8 times).  Maybe I just ordered the wrong thing.", "rating": 3, "date": "2009-11-06"}], "tonkatsu": [{"excerpts": ["Tonkatsu and beef teriyaki were also good."], "author": "Wesley K.", "review": "Decent quality, great quantity. Eating it tastes like very well made Japanese food with Chinese style. California roll in dinner combo wasn't good. Tempura and chicken teriyaki were good. Tonkatsu and beef teriyaki were also good.", "rating": 3, "date": "2017-08-07"}, {"excerpts": ["I had the tonkatsu dinner and shrimp tempera roll but got really bad food poisoning. ", "It is the last time I eat at this restaurant."], "author": "Paul P.", "review": "I had the tonkatsu dinner and shrimp tempera roll but got really bad food poisoning. It is the last time I eat at this restaurant.", "rating": 1, "date": "2017-03-02"}, {"excerpts": ["We had a variety of sushi, tempura, teriyaki and tonkatsu. ", "Food was done right.  "], "author": "Wendy H.", "review": "I must have walked by here and never noticed it.  We came here for a school dinner.  They put us in this narrow rectangular room in the back.  A lot of us had our backs against the wall because it was that narrow in the room.\n\nWe had a variety of sushi, tempura, teriyaki and tonkatsu. Food was done right.  plentiful and good.\n\nService was good.  They didn't forget us even though we were tucked inside a room.\n\nParking is bad in the area..", "rating": 4, "date": "2015-02-25"}, {"excerpts": ["Our go to dishes are the Chicken Karage, Tonkatsu, or Grilled Salmon combos.  ", "My kids LOVE the udon, and the kids menu has lots of choices between won ton soup ", "(it's a dominantly Chinese neighborhood, just accept it) udon, chicken teriyaki, plain rice, and tempura ", "(OK, it's the BEST kids menu I've ever seen, in my opinion).  ", "We all get ice cream or sherbet at the end, and everyone is happy.  ", "Love this place!"], "author": "Kimberly J.", "review": "Noriega Teriyaki is one of my parents favorite places, so we come here for dinner just about every time we visit.  They are VERY kid friendly, the service is great -- our tea is always filled, cucumber sunumono and miso soups arrive right away (they really don't care if the kids don't order a meal, they get cucumbers and soup too!).  Our go to dishes are the Chicken Karage, Tonkatsu, or Grilled Salmon combos.  My kids LOVE the udon, and the kids menu has lots of choices between won ton soup (it's a dominantly Chinese neighborhood, just accept it) udon, chicken teriyaki, plain rice, and tempura (OK, it's the BEST kids menu I've ever seen, in my opinion).  We all get ice cream or sherbet at the end, and everyone is happy.  Love this place!", "rating": 4, "date": "2013-12-06"}, {"excerpts": ["I've had the tonkatsu dinner, the chef special for 2 and brought home the leftovers,\nLet's just say, I don't come here for sushi, ", "but I've also had their sushi, and it's not bad. "], "author": "Carol L.", "review": "I've been here for dinner only.\n\nFood has never been a let-down. I admit, the first time I didn't come with high expectations, but was very pleasantly surprised.\n\nThe quality of food (delish), portions (whoa, didn't expect so much), the presentation, general amount of time it takes to be seated (usually no line, but goes quick if there is), and overall experience has been good every time I've gone.\n\nI've had the tonkatsu dinner, the chef special for 2 and brought home the leftovers,\nLet's just say, I don't come here for sushi, but I've also had their sushi, and it's not bad. :)\n\nI was really impressed with how quickly they can bust a table, seriously not every place has that together! I was here Mother's Day, and while I did here kids complaining, \"can we just go somewhere else?\" The wait was quite decent. I waited 30-40 mins, there were at least 7 parties ahead, but I'm used to waiting for things and thought they did really well. Ninja-stealth!", "rating": 4, "date": "2014-06-08"}, {"excerpts": ["I like to order tonkatsu when I go to JP restaurant but ", "the tonkatsu here is way too fat, I wish they could use better pork to make the katsu.  ", "Been here on Christmas eve, and the restaurant gave us a present ( in fact, each table received one ).  ", "I recommend the Dancing lion roll"], "author": "Kukumalu M.", "review": "the rice is too sticky, i guess they put too much water when they cook the rice.  the tempura sauce is good LOL.  I like to order tonkatsu when I go to JP restaurant but the tonkatsu here is way too fat, I wish they could use better pork to make the katsu.  Been here on Christmas eve, and the restaurant gave us a present ( in fact, each table received one ).  I recommend the Dancing lion roll", "rating": 3, "date": "2014-02-21"}, {"excerpts": ["Chicken karaage or tonkatsu when we eat here!  ", "Rolls aren't bad either, but not the freshest sashimi."], "author": "Michelle K.", "review": "mmm it's okay!  Not bad, but not the best.  Chicken karaage or tonkatsu when we eat here!  Rolls aren't bad either, but not the freshest sashimi.", "rating": 3, "date": "2015-08-21"}, {"excerpts": ["We also got the pan fried shrimp appetizer, and tonkatsu, all very good.  ", "Quality is consistent, and portions are very generous.  ", "I wish they included a paper menu with the delivery for my future orders.  ", "My favoirite delivery restaurant in Outer Sunset!"], "author": "Marvella W.", "review": "My cousin turned me on to this place.  The first thing I tried here was the favorite sushi tray.  I love that they deliver!  Food is very fresh and delicious.  I've even ordered Bento boxes with tempura for delivery, and everything was hot, fresh, and the tempura was still crispy.  I ordered delivery more than once.  We also got the pan fried shrimp appetizer, and tonkatsu, all very good.  Quality is consistent, and portions are very generous.  I wish they included a paper menu with the delivery for my future orders.  My favoirite delivery restaurant in Outer Sunset!", "rating": 5, "date": "2015-04-05"}, {"excerpts": ["Their tonkatsu, chicken kara-age, tempura and teriyaki are cooked perfectly every time I've eaten here. ", "Also note, the portions when compared to other Japanese food restaurants in San Francisco are HUGE!!! "], "author": "Nick C.", "review": "So this family owned restaurant is probably one of the best Japanese food restaurants in San Francisco. As you walk in, you immediately notice that the restaurant is large and roomy and the staff is super friendly. I've ordered their dinner combination/entrees and I have to say that their food is DELICIOUS! \n\nTheir tonkatsu, chicken kara-age, tempura and teriyaki are cooked perfectly every time I've eaten here. Also note, the portions when compared to other Japanese food restaurants in San Francisco are HUGE!!! (Think Costco proportions of your entree in comparison to your common small-shop Japanese food restaurant.) \n\nDon't forget that ice-cream dessert is included with dinner too!!! \n\nDefinitely would recommend to anyone looking for great food, huge portions, and super friendly staff!!!", "rating": 5, "date": "2011-09-07"}, {"excerpts": ["Friend got the tonkatsu and chicken combo. ", "Tonkatsu and chicken thin and dry.\n\n"], "author": "Adrienne C.", "review": "Went here for dinner. I got the sukiyaki and tempura combo. It comes with soup, egg rolls and ice cream.Friend got the tonkatsu and chicken combo. Service is pretty standard. \n\nPro: Eggrolls Tea.\n\nCon: The sukiyaki was bland and noodles hard. No veggies included. Tonkatsu and chicken thin and dry.\n\nLocation is too out of the way for me to come again.", "rating": 2, "date": "2013-01-01"}, {"excerpts": ["The meat is dry and the only reason there is a taste to it is because of the flavorful tonkatsu sauce that comes with it. ", "They use a store bought vinaigrette type salad dressing with the salad. "], "author": "Ellen C.", "review": "Price: pretty darn good for the amount you get. I ordered the Chicken Katsu for $8.95 which included miso soup, salad, entree, rice, and ice cream after. \n\nQuality wise: so-so. The chicken katsu was not as tasty or seasoned as well as other Japanese restaurants. The meat is dry and the only reason there is a taste to it is because of the flavorful tonkatsu sauce that comes with it. They use a store bought vinaigrette type salad dressing with the salad. The ice cream is frothy and injected with air it seems. \n\nParking: not so great. It may take upwards of 10-15 minutes to find parking in a pretty busy area since there are so many restaurants and stores nearby.\n\nLarge parties: good. We had a large party of about 20 people and they have a room in the back open for reservations and bigger parties. Only downside to that room? It's directly attached to the hallway for the bathroom, so it has a little bit of a smell. And on hot days it gets pretty stuffy in there.", "rating": 3, "date": "2007-07-16"}, {"excerpts": ["I had the tonkatsu, which was WAY too salty for me (and anybody who knows me knows that's crazy"], "author": "Tara O.", "review": "I've definitely had better. But I've also had a lot worse.\n\nThis place was pretty middle of the road for me. While I really loved the tea they served (genmaicha! my favorite!) and the sushi was really pretty good, the dinners that my family and I ordered were just so-so. The portions were HUGE (a plus) but they were a bit on the blah side. I had the tonkatsu, which was WAY too salty for me (and anybody who knows me knows that's crazy, i love my salt) \n\nOur service was prompt and friendly, so I won't deduct any stars for that, but i did hear the table next to us request a fork and then ask for it about 4 more times. The poor guy started eating his salad with his hands! Sad!\n\nFor how much food you got though the prices were really good, so all in all I can't complain too much. I would probably just stick to the sushi.", "rating": 3, "date": "2008-07-09"}, {"excerpts": ["i always get tonkatsu and the spider roll ", "(the spider roll is better at sushi zen though). ", "The service is really good and pretty fast too! ", "Parking has always been easy for me too!"], "author": "Heather C.", "review": "I like coming here because they have a lot of tables so there is almost always no waiting! The food is pretty good too i always get tonkatsu and the spider roll (the spider roll is better at sushi zen though). The service is really good and pretty fast too! Parking has always been easy for me too!", "rating": 3, "date": "2009-02-07"}], "yakitori": [{"excerpts": ["Tried the chicken yakitori. ", "You get 3 skewers of small chicken breast pieces, onion and red bell pepper with some teriyaki sauce on the bottom. ", "It's served with salad, steamed rice and miso soup which was a bit watery. ", "Just ok. ", "Attentive service."], "author": "Review L.", "review": "Tried the chicken yakitori. You get 3 skewers of small chicken breast pieces, onion and red bell pepper with some teriyaki sauce on the bottom. It's served with salad, steamed rice and miso soup which was a bit watery. Just ok. Attentive service.", "rating": 2, "date": "2017-09-16"}, {"excerpts": ["I got something new the yakitori. ", "Which was absolutely delicious. ", "I got some old fashion coffee ice scream ", "like I did when I was young. ", "This place brings back so much memories. ", "From birthdays to family gathering to graduations. ", "This place is part of my childhood. ", "I love this Japanese Restaraunt."], "author": "Yasuko R.", "review": "Since I was young I would always come to this Japanese spot. I would come when it barely opened. I still come now that I'm older. I came here today and it was soooo bomb. I got something new the yakitori. Which was absolutely delicious. I got some old fashion coffee ice scream like I did when I was young. This place brings back so much memories. From birthdays to family gathering to graduations. This place is part of my childhood. I love this Japanese Restaraunt.", "rating": 5, "date": "2014-09-26"}], "yosenabe": [{"excerpts": ["One of my favorite things here is the Yosenabe, a mixture of fresh seafood, tofu, and glass noodles in a mild broth. ", "Tastes very healthy and comes with a good portion of seafood. "], "author": "Samantha C.", "review": "Service here is RIDICULOUSLY FAST. Our orders generally come out in less than 7 minutes. And best of all, the food is decently GOOD. I didn't know such speed was even possible.\n\nOne of my favorite things here is the Yosenabe, a mixture of fresh seafood, tofu, and glass noodles in a mild broth. Tastes very healthy and comes with a good portion of seafood. Also comes with rice and ice cream (at dinner).\n\nI would honestly stick with the hot items. The sashimi and sushi rolls are mediocre at best. The pricing for the sashimi is fair, but not the highest quality. The rolls were also kinda disappointing. The Spider Roll had waayyy too much rice - and not even sushi rice! Just plain old white rice. The crunchy tempura was also not very crunchy. Not worth $8. \n\nThat being said, you get what you paid for. If you don't come here expecting a gourmet Japanese meal, you'll leave with a full stomach and pretty full wallet :)", "rating": 4, "date": "2014-03-09"}, {"excerpts": ["Best Yosenabe anywhere and "], "author": "Ike K.", "review": "Against my own self-interest, I'm being honest.  If you have kids, love Japanese food, this is the place.  Best Yosenabe anywhere and Wonton soup (yes, nonsequitur, but it's so good!).  Wait staff is kind and attentive.  Decor is tacky, but I couldn't care less, my kids love it.  Just don't go when I go.", "rating": 4, "date": "2009-09-15"}], "unaju": [{"excerpts": ["I decided on getting that as well as the Unaju dinner. \n\n"], "author": "Jei C.", "review": "If there's one thing that this cat enjoys, it's having the family together, and what better way to celebrate the occasion than to try a new restaurant! \n\nNoriega teriyaki house is a larger size restaurant and we were lucky to come in when it was not too busy. We were seated and sever tea and menus promptly. The menu here is pretty diverse in comparison to some other Japanese restaurants, but there wasn't too much that I would consider very different or unique. \n\nI suddenly spotted a roll that was basically named after me? \"Fighting cheetah roll!\" This sounded very interesting and obviously was a roll after my heart. I decided on getting that as well as the Unaju dinner. \n\nI would note that it did take a while for a server to come by and take our order, which was surprising as it was not very busy, but it was a small issue. \n\nFood arrived quite quickly and the rolls came about after. All in all everything was pretty good. The Eel was well cooked although I wish there had been not so much rice. The fighting cheetah roll was very good! Although it was a bit heavy on the sauce. All in all, the food was quite decent and serving sizes were good. Also, presentation was quite nice as well. \n\nI would say that this place made this cat happy, although it was a bit pricy in the end. I'll likely stop by again in the future for a visit. ^ ^\n\n*chirp!*", "rating": 4, "date": "2016-02-05"}, {"excerpts": ["I got the Unaju. ", "Don't get it. ", "I felt that though there was a somewhat good amount of eel on my plate, it failed to compare to my sister's chicken teriyaki portion let alone my parents' lunch combo amount. ", "My parents chose the combo special where you have to at least order two to get the combo special. ", "It is basically a plate of tempura and beef teriyaki. ", "My other sister chose to just eat sushi rolls. ", "She got the super burrito, the San Francisco roll, and the spicy tuna roll? ", "I actually can't remember the last. "], "author": "Alex T.", "review": "Food was alright, service was crap. Only one of the three waitresses that interacted with us was deserving of kind remarks. The hostess sucked. \n\nMenu ranges in the $-$$ area depending on what you get. There are some lunch specials that come with rice and miso soup. I got the Unaju. Don't get it. I felt that though there was a somewhat good amount of eel on my plate, it failed to compare to my sister's chicken teriyaki portion let alone my parents' lunch combo amount. My parents chose the combo special where you have to at least order two to get the combo special. It is basically a plate of tempura and beef teriyaki. My other sister chose to just eat sushi rolls. She got the super burrito, the San Francisco roll, and the spicy tuna roll? I actually can't remember the last. I would say that the sushi was pretty good, given that they are all $8+.\n\nOn to the service.....out of the three ladies working the dining room, the hostess was the least friendly in my opinion. She had the sourest attitude compared to the to other ladies. Then there's waitress number 2, the one in the red shirt. We did not interact much with her, as she always managed to look the other way since she was sooo busy. And then there's waitress number 3. The best one out of the bunch. She had the blue shirt with the big flowers on it. So friendly and so courteous. I'd only want her to be my server next time if I could help it.\n\nI might come back, but might is the keyword. The food wasn't something I'd rave about, and the service definitely isn't something that I'd reward them on doing an excellent job.\n\nC+/B-", "rating": 3, "date": "2013-09-18"}, {"excerpts": ["I ordered the unaju (eel over rice) while bf ordered chicken karaage. ", "Our orders came out suspiciously quick.. ", "Our meal came with pickled cucumbers and miso soup. ", "The unaju was filling with a huge piece of eel ", "but I probably should have opted for something else b/c ", "I learned that I can't handle too much eel. ", "Bf's chicken karaage looked ok ", "but he liked it. ", "Next time I'll probably try their sushi rolls. ", "They looked pretty good."], "author": "Emily M.", "review": "It was not bad. Our server was nice and the menu had many options. So much so that it was a little overwhelming. I ordered the unaju (eel over rice) while bf ordered chicken karaage. Our orders came out suspiciously quick.. Our meal came with pickled cucumbers and miso soup. The unaju was filling with a huge piece of eel but I probably should have opted for something else b/c I learned that I can't handle too much eel. Bf's chicken karaage looked ok but he liked it. Next time I'll probably try their sushi rolls. They looked pretty good.", "rating": 3, "date": "2015-01-25"}, {"excerpts": ["3.5 for their cheap unaju $9.95. ", "almost 4 if they didn't burnt my eel, ", "but it was still good. ", "Because their unaju was cheap and good, i thought Noriega deserved some recognition! ", "(go see my pix)"], "author": "Viola C.", "review": "3.5 for their cheap unaju $9.95. almost 4 if they didn't burnt my eel, but it was still good. and i was hungry.\n\nunagi is pretty much what i get every time i eat sushi. i wish they had more selections but i guess i'm in a wrong place? my friends got the \"sushi for two\" which looks really good. its a great choice if you want varieties. \n\nthis is a convenient place for when my friends are craving sushi. parking is not that hard to find either. prices are average. i asked my friends who lives in the area why they come here and said that this is their default. Because their unaju was cheap and good, i thought Noriega deserved some recognition! (go see my pix)", "rating": 3, "date": "2010-09-26"}], "ebi": [{"excerpts": ["-- THE BOAT - 3 Slices each of Salmon, Tuna, and Yellowtail Sashimi, Tekka Maki, and Unagi,  Maguro, Hamachi, Ebi, Sake, Tako, Tai, and Saba Nigiri (23 Pieces Total)...", "$25.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=TTnDm0Y0oQG2_bnwUtWnIA)\n", "Overall, this was pretty mixed.  ", "On the one hand, you get a good amount for what you pay and most of the fish was relatively fresh.  ", "However, while the fish themselves looked fine (though the salmon sashimi wasn't the prettiest cut), a few weren't very tasty.  "], "author": "Mike L.", "review": "After my relatives and I tried Noriega Teriyaki years and years ago, we never had a reason to go back.  The food may not have been awful, but it certainly wasn't very remarkable, let alone good.  So, imagine my surprise with how Noriega Teriyaki has suddenly become one of the go-to spots for my relatives whenever we have our impromptu get-togethers.  I mean, the only thing more surprising is how the food seems (slightly) better than I remember!\n\nFor the most part, nothing about Noriega Teriyaki stands out very much, save for the mildly random water fountain that's right in front of you when you walk in.  Both the decor and the menu are pretty typical of other teriyaki/bento box types of Japanese restaurants out there (and Chinese owned at that), but the latter does offer a wealth of choices to choose from, even if the ingredients aren't entirely authentic.\n\n-- SPICY GRILLED SQUID...$7.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=XmcR1haqkn-nBTwnc3tYvA)\nNot quite what I had expected, but not bad.  The squid itself was pretty sizable and I thought it was cooked nicely (just the right chew to it).  That said, I thought it was a little heavy on the (unagi?) sauce, which was pretty sweet.  At least they put the sriracha on the side though (which is the only thing that made this dish \"spicy\").\n\n-- CHICKEN KARAAGE LUNCH PLATE - Boneless Chicken Deep Fried and Topped with House Special Teriyaki Sauce...$8.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=YHpaPXQ_3MHQHR7-vqeIfQ)\nIt's different from most other chicken karaage dishes, but I liked it!  It's akin to chicken katsu, but with much better breading, a much juicier texture, and much more flavorful (compared to my friend's chicken katsu that I tried).  What's more, the portion was fairly generous.\n\n-- TERIYAKI DINNER SPECIAL - Tempura, Beef Teriyaki, Salmon Isobe-age, Chicken Karaage with Soup, Harukami (Imperial Rolls), Rice, and Ice Cream...$14.95 Per Person (Min. two orders)\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=dBqiHkGDH2AqbVE_dgZa_g)\nThe menu says it's \"for two\", but this was more than enough for our entire table to share.  I didn't try the Salmon Isobe-age, nor the \"Harukami\" (seriously...imperial rolls?), but everything else was pretty decent.  The chicken karaage was tasty, the beef teriyaki was surprisingly tender, and I liked the variety and crispiness of the tempura.  Solid value for the money.\n\n-- THE BOAT - 3 Slices each of Salmon, Tuna, and Yellowtail Sashimi, Tekka Maki, and Unagi,  Maguro, Hamachi, Ebi, Sake, Tako, Tai, and Saba Nigiri (23 Pieces Total)...$25.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=TTnDm0Y0oQG2_bnwUtWnIA)\nOverall, this was pretty mixed.  On the one hand, you get a good amount for what you pay and most of the fish was relatively fresh.  However, while the fish themselves looked fine (though the salmon sashimi wasn't the prettiest cut), a few weren't very tasty.  In particular, I wasn't high on the Tai Nigiri, Saba Nigiri, and Tuna Sashimi.\n\n-- BLIZZARD ROLL - Fresh Salmon, Avocado, and Tamago topped with Scallop, Ikura, Wasabi Tobiko, and Mayo...$12.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=Yi4lSzIyx8Fnnk_COyP5zw)\nEhh...this was okay.  It was cool how big the pieces of tamago were, but they overpowered the salmon inside the roll.  The scallops were nice though and I liked how the wasabi sauce added some potency too, which might have been a bit bland/delicate otherwise.\n\n-- SPIDER RAINBOW ROLL - Soft Shelled Crab topped with Tuna, Red Snapper, Mackerel, and Masago...$9.45\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=edzmm-SCSqYhcCjX_teTOQ)\nGiven how it combines two classic rolls, I can see why this is one of their more popular rolls.  Still, I thought it was just okay.  The crab was decently meaty and was fried up to a nice crispness, but I didn't care much for their choice of fish to top the fish.  \n\nAlthough the food many not have impressed, the service here is great, as it's been both fast and friendly every time I've been here.  That said, it's still all about the food.  While there are definitely better places out there to satisfy your bento box/teriyaki urges, you could definitely do worse (like with Balboa Teriyaki...).  Just stick with the hot/cooked foods, as the sushi/sashimi feels a little hit or miss to me.", "rating": 3, "date": "2016-11-27"}, {"excerpts": ["Our Order\nSushi for Two: ($28) 28pcs that include 2 Ikura, 2 Hamachi, 2 Maguro, 2 Ebi, 2 Sake, 2 Tai, 2 Tako, 2 Unagi, Kappa Maki, Tekka Maki, Hamachi Maki, California Roll and a scoop of ice cream for dessert\n", "Quail's Nest: "], "author": "Kitty K.", "review": "Friend suggested going here for sushi. It's located further down Noriega where street parking is slightly easier to find. If you want to sit at the sushi bar, it's located on the right but there's lots of seating available.\n\nOur Order\nSushi for Two: ($28) 28pcs that include 2 Ikura, 2 Hamachi, 2 Maguro, 2 Ebi, 2 Sake, 2 Tai, 2 Tako, 2 Unagi, Kappa Maki, Tekka Maki, Hamachi Maki, California Roll and a scoop of ice cream for dessert\nQuail's Nest: Raw Quail Egg, Amaebi (Sweet Shrimp), Ikura (Salmon Roe), Wasabi Tobiko\n\nBefore our food came out we had miso soup brought out and a \"cucumber salad.\" Fairly fresh sushi. The Quail's Nest was interesting. Wasn't super amazing that I'd have to order again though. Service provided by our server, Aaron, was fantastic. Super friendly and was available when needed. Would come back to try all their other specials (they have a lot).", "rating": 4, "date": "2014-02-06"}, {"excerpts": ["(Hamachi Maki, Maguro, Unagi, Tako, Ebi). ", "My favorite from that selection was the Maguro. ", "I didn't particularly like the Hamachi Maki but everything else ", "was okay."], "author": "Ivy L.", "review": "It's alright here, definitely not one of my favorite Japanese or sushi places, but then again, I didn't buy the special rolls. Not great, but not bad either.\n\nWhen we arrived, we were instantly seated and they brought us waters and a pot of tea, which is really nice. It happened to be one of my favorites- Barley Tea. :) The service overall was good, they didn't leave us waiting and were good about checking up on us. The setting of the place was pretty nice! There's a fake garden-like area when you first walk in. They seated us at a rather large table, so it was a bit awkward trying to figure out how to sit. But they were relatively busy. There was no line, but they were filled up.\n\nMy friend and I shared some dishes, so we went for the basic rolls and Soba Noodles. The basic rolls I got was Sushi Combo #3 (Hamachi Maki, Maguro, Unagi, Tako, Ebi). My favorite from that selection was the Maguro. I didn't particularly like the Hamachi Maki but everything else was okay.Then, we also got the Chicken Soba which I didn't think was very good, actually. It was plain and didn't have that much flavor.\n\nTo be fair, I did enjoy my friend's roll. I think it was the Cherry Blossom Roll, but whatever it was, it was delicious!\n\nThis place just wasn't outstanding enough with all of the Japanese restaurants around, but the prices are pretty decent and maybe I just need to give it another try with the Special Rolls!", "rating": 3, "date": "2013-01-27"}], "inari": [], "ika": [{"excerpts": ["The ika and amaebi are very fresh though."], "author": "Mary L.", "review": "Good for the money.  The quality is not bad but i wouldn't say it's one of the best sushi in town.  The ika and amaebi are very fresh though.", "rating": 3, "date": "2010-10-02"}], "masago": [{"excerpts": ["topped with Tuna, Red Snapper, Mackerel, and Masago...", "$9.45\n", "(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=edzmm-SCSqYhcCjX_teTOQ)\n", "Given how it combines two classic rolls, I can see why this is one of their more popular rolls.  ", "Still, I thought it was just okay.  "], "author": "Mike L.", "review": "After my relatives and I tried Noriega Teriyaki years and years ago, we never had a reason to go back.  The food may not have been awful, but it certainly wasn't very remarkable, let alone good.  So, imagine my surprise with how Noriega Teriyaki has suddenly become one of the go-to spots for my relatives whenever we have our impromptu get-togethers.  I mean, the only thing more surprising is how the food seems (slightly) better than I remember!\n\nFor the most part, nothing about Noriega Teriyaki stands out very much, save for the mildly random water fountain that's right in front of you when you walk in.  Both the decor and the menu are pretty typical of other teriyaki/bento box types of Japanese restaurants out there (and Chinese owned at that), but the latter does offer a wealth of choices to choose from, even if the ingredients aren't entirely authentic.\n\n-- SPICY GRILLED SQUID...$7.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=XmcR1haqkn-nBTwnc3tYvA)\nNot quite what I had expected, but not bad.  The squid itself was pretty sizable and I thought it was cooked nicely (just the right chew to it).  That said, I thought it was a little heavy on the (unagi?) sauce, which was pretty sweet.  At least they put the sriracha on the side though (which is the only thing that made this dish \"spicy\").\n\n-- CHICKEN KARAAGE LUNCH PLATE - Boneless Chicken Deep Fried and Topped with House Special Teriyaki Sauce...$8.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=YHpaPXQ_3MHQHR7-vqeIfQ)\nIt's different from most other chicken karaage dishes, but I liked it!  It's akin to chicken katsu, but with much better breading, a much juicier texture, and much more flavorful (compared to my friend's chicken katsu that I tried).  What's more, the portion was fairly generous.\n\n-- TERIYAKI DINNER SPECIAL - Tempura, Beef Teriyaki, Salmon Isobe-age, Chicken Karaage with Soup, Harukami (Imperial Rolls), Rice, and Ice Cream...$14.95 Per Person (Min. two orders)\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=dBqiHkGDH2AqbVE_dgZa_g)\nThe menu says it's \"for two\", but this was more than enough for our entire table to share.  I didn't try the Salmon Isobe-age, nor the \"Harukami\" (seriously...imperial rolls?), but everything else was pretty decent.  The chicken karaage was tasty, the beef teriyaki was surprisingly tender, and I liked the variety and crispiness of the tempura.  Solid value for the money.\n\n-- THE BOAT - 3 Slices each of Salmon, Tuna, and Yellowtail Sashimi, Tekka Maki, and Unagi,  Maguro, Hamachi, Ebi, Sake, Tako, Tai, and Saba Nigiri (23 Pieces Total)...$25.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=TTnDm0Y0oQG2_bnwUtWnIA)\nOverall, this was pretty mixed.  On the one hand, you get a good amount for what you pay and most of the fish was relatively fresh.  However, while the fish themselves looked fine (though the salmon sashimi wasn't the prettiest cut), a few weren't very tasty.  In particular, I wasn't high on the Tai Nigiri, Saba Nigiri, and Tuna Sashimi.\n\n-- BLIZZARD ROLL - Fresh Salmon, Avocado, and Tamago topped with Scallop, Ikura, Wasabi Tobiko, and Mayo...$12.95\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=Yi4lSzIyx8Fnnk_COyP5zw)\nEhh...this was okay.  It was cool how big the pieces of tamago were, but they overpowered the salmon inside the roll.  The scallops were nice though and I liked how the wasabi sauce added some potency too, which might have been a bit bland/delicate otherwise.\n\n-- SPIDER RAINBOW ROLL - Soft Shelled Crab topped with Tuna, Red Snapper, Mackerel, and Masago...$9.45\n(https://www.yelp.com/biz_photos/noriega-teriyaki-house-san-francisco?select=edzmm-SCSqYhcCjX_teTOQ)\nGiven how it combines two classic rolls, I can see why this is one of their more popular rolls.  Still, I thought it was just okay.  The crab was decently meaty and was fried up to a nice crispness, but I didn't care much for their choice of fish to top the fish.  \n\nAlthough the food many not have impressed, the service here is great, as it's been both fast and friendly every time I've been here.  That said, it's still all about the food.  While there are definitely better places out there to satisfy your bento box/teriyaki urges, you could definitely do worse (like with Balboa Teriyaki...).  Just stick with the hot/cooked foods, as the sushi/sashimi feels a little hit or miss to me.", "rating": 3, "date": "2016-11-27"}], "hokkigai": [], "uni": [{"excerpts": ["The spicy tuna looked like expired old uni.  ", "I'm pretty good with textural foods, but this was out of the park.  "], "author": "Cat A.", "review": "Came here for New Years Dinner.  While not many places are open on NYD, Norega is bangin'.  Asians could care less if it's a holiday.  They Open!!\n\nBut...Why are there so many good reviews?  Why were there so many people eating at this establishment?  We went here after we realized that we were tired of our other eating hole.  Lots of people means good food, right?\n\nNot.\n\nThe wait was bearable, the service sufficed, but the food was just.not.that.great.\n\nI ordered the San Francisco Roll, and my mom ordered the beef teriyaki and tempura combo platter.  \n\nThe San Francisco roll was supposed to have spicy tuna in it, topped with eel and avocado.  The spicy tuna looked like expired old uni.  I'm pretty good with textural foods, but this was out of the park.  Effing disgusting as I chewed and swallowed it down.  \n\nThe Beef Teri and tempura combo platter came with an appetizer, soup, and a small scoop of ice cream or sorbet for desert.  (That's where the two stars came from).  The beef teriyaki looked almost boiled with fake char marks on it, with a measly splash of teriyaki sauce.  Broccoli tempura is my favorite, so I grabbed that out of the tempura.  it was raw in side!  Ew... uncooked tempura batter.  Damn it, this dinner is getting worse!!\n\nSaving grace was the sorbet ice cream at the end.  And if that's your saving grace, your restaurant needs help.  Sorry.  No bueno in my book.  Never again.", "rating": 2, "date": "2012-01-03"}, {"excerpts": ["DO NOT get the UNI + Sake (salmon) roll. ", "There is like 2 pieces and it cost $9. ", "Thats not the worst of it..", "the worst of it is they decide to cut ONE piece of UNI, split it and put on top of the Salmon. ", "WHO DOES THAT? ", "For the price we pay, I expect at least one FULL piece of uni on each of the 2 pieces. ", "The UNI were size of a dime.", "They hella try to jipp you. ", "Oh and on top of that, the salmon they wrap around the sushi with had some of the bad parts of the salmon on it. ", "Like the skin. ", "Salmon,when cutting off some parts you don' eat, should be all ORANGe. ", "But they decide to use the nasty part which is brown and white. ", "COME ON? ", "And u want customers to come back? ", "I use to come here alot and the sushi chefs that make the sushi doesn't skim as much. ", "It seems like they had changed their sushi chefs also. "], "author": "Tammy F.", "review": "They used to be pretty decent...now its just not good at all.\n\nCame here last week on a weekday. Service was horrible even though there were only 4 other tables there and like 4 servers. They all choose to hang out near the cashier and chat instead of helping customers. I literally had to go to the other room, walk up to the 4 of them behind the cashier and ask for service to ORDER my food with my fam. I also saw another table eager to order but no one paid attention. Female server acted dumb. We asked her to switch our plates bc we had oysters shell and crap on it. She only changed 2 plates out of the 5 people we had. Slow to fill tea, slow to fill water, slow to take our plates away. AND IT WASNT BUSY! However, I am thankful for the waiter who looks a little bit older and he was a lil chubby. He was very nice. Service was bad with all other waiters. PLEASE HIRE NEW PEOPLE! When I use to come here all the time, there was an older lady in pony tails..the short one with the vietnamese accent...that always smile and serve so well. I hope she still works there! Or move her to dinner shifts and teach the servers hows its done!\n\nThe sushi rolls were decent. However, the sashimi and oyster combination was bad. The oysters were the size of a dime. Literally, it was so small. Why do they even sell it? I kno the smaller oysters are suppose to be sweet. But those just look nasty and unedible.\n\nDO NOT get the UNI + Sake (salmon) roll. There is like 2 pieces and it cost $9. Thats not the worst of it..the worst of it is they decide to cut ONE piece of UNI, split it and put on top of the Salmon. WHO DOES THAT? For the price we pay, I expect at least one FULL piece of uni on each of the 2 pieces. The UNI were size of a dime.They hella try to jipp you. Oh and on top of that, the salmon they wrap around the sushi with had some of the bad parts of the salmon on it. Like the skin. Salmon,when cutting off some parts you don' eat, should be all ORANGe. But they decide to use the nasty part which is brown and white. COME ON? And u want customers to come back? I use to come here alot and the sushi chefs that make the sushi doesn't skim as much. It seems like they had changed their sushi chefs also. What a dissapointment!\n\nI don't know why its gotten so bad. I dont think my family or I will ever come back again. There are plenty of better japanese restaurants that won't jipp you and have better service. If you like fresh sushi, do not come here!!", "rating": 1, "date": "2012-12-11"}, {"excerpts": ["I did have uni once ", "and it was great.  "], "author": "Jason K.", "review": "Great place to go for groups.  The best way to experience the food here is to have everything.  Well, I guess just a little of everything.\n\nThe Pan Fried Prawns and Tuna Poki are good appetizers, but I prefer the Albacore Tataki.\n\nTheir teriyaki is all pretty good.  I usually avoid salmon teriyaki 'cause the fish always seems burnt, but here that's not a problem.  The beef is also much more tender than other place I've had beef teriyaki.  I'd go for the Teriyaki Special just so you get all that teriyaki goodness with some tempura.\n\nTheir sushi is also pretty good.  The fish is fresh and reasonably priced.  It's not the highest quality, but I'm also not paying a premium.  I did have uni once and it was great.  I did have it it the day after they stocked it though, so hopefully you can get lucky by going in on stocking day.\n\nThey have some more interesting rolls on their specials, but I like to stick with the double hamachi and double sake rolls 'cause that's just lots of fish.  The spider rainbow roll is good if you're feeling like having a roll that you might have to knife and fork!\n\nParty trays are also a great way to cater.  They're all reasonably priced and they have a lot of variety, including a vegetarian platter.  So by all means, take it to go.\n\nService is decent, although a stack of empty plates/bowls can accumulate a bit much before being taken away, but I haven't had any other problems.", "rating": 4, "date": "2011-01-16"}, {"excerpts": ["get their uni nigiri. ", "they pile it on high.\r\n\r\n", "update: don't get the amaebi heads! ", "i've ordered it several times and it's never fried hard enough ", "so i end up cutting my mouth. ", ":("], "author": "Tin-Tin E.", "review": "surprise surprise! don't get the teriyaki! my chicken teriyaki was burned. but everything else is great, especially their sushi and sashimi (always fresh) and they have the best green tea ice cream i've ever had. their special rolls are awesome too, but too expensie. i'd opt for one their dinner combos just to get the miso soup and ice cream on the side. get their uni nigiri. they pile it on high.\r\n\r\nupdate: don't get the amaebi heads! i've ordered it several times and it's never fried hard enough so i end up cutting my mouth. :(", "rating": 4, "date": "2005-07-26"}], "mirugai": [], "amaebi sashimi": [{"excerpts": ["I LOVE the tuna tartar and the amaebi sashimi with heads.  ", "The quality is good.  ", "The portions are big.  ", "It is on the pricier side ", "but I am happy to pay more for it."], "author": "Derek W.", "review": "This is certainly my favorite sushi restaurants in San Francisco.  I mostly eat sushi and sashimi from this restaurant and I can't speak for the rest of the dishes. \n\nThe place:\nIt's decent.  Clean.\n\nThe Staff:\nAlways friendly and very helpful.\n\nThe food:\nAlways had great experience eating sushi and sashimi here.  Only had one unfavorable experience and I spoke with the waiter and he was happy to comp the dish that I was not happy with.  I LOVE the tuna tartar and the amaebi sashimi with heads.  The quality is good.  The portions are big.  It is on the pricier side but I am happy to pay more for it.", "rating": 5, "date": "2012-06-19"}], "tuna sashimi  pcs": [], "albacore sashimi  pcs": [], "spicy super white tuna sashimi": [], "salmon sashimi  pcs": [], "hamachi sashimi  pcs": [], "spicy albacore sashimi": [{"excerpts": ["I ordered the Spicy Albacore Sashimi, and a San Francisco Roll (spicy tuna, salmon wrapped with avocado and eel). ", "I can honestly say I've had better since the San Francisco Roll seemed as if it were a little above Super Market quality, and the sashimi was kinda mushy (although it was pretty tasty). ", "My cousin ordered the Chicken Teriyaki and also said he had better, and my nephew had the Beef/Salmon Teriyaki which he said was pretty good. ", "The prices are pretty good for the amount of food they give you and the service was above average (it also didn't hurt that they had some cuties working there). ", "It's a hit or miss kinda place if you ask me MY HONEST OPINION."], "author": "Rommel N.", "review": "This is a pretty decent Japanese restaurant. I ordered the Spicy Albacore Sashimi, and a San Francisco Roll (spicy tuna, salmon wrapped with avocado and eel). I can honestly say I've had better since the San Francisco Roll seemed as if it were a little above Super Market quality, and the sashimi was kinda mushy (although it was pretty tasty). My cousin ordered the Chicken Teriyaki and also said he had better, and my nephew had the Beef/Salmon Teriyaki which he said was pretty good. The prices are pretty good for the amount of food they give you and the service was above average (it also didn't hurt that they had some cuties working there). It's a hit or miss kinda place if you ask me MY HONEST OPINION.", "rating": 3, "date": "2008-06-01"}], "uni sashimi": [], "mirugai sashimi": [], "nabeyaki udon": [{"excerpts": ["I've also tried the nabeyaki udon that comes with seafood which is perfect on a cold day.\n\n"], "author": "Tara A.", "review": "I usually come here with my parents and brother, and we share a salad and a few rolls, family style! The chicken karage salad is really good here. The lettuce is fresh, the dressing is awesome and they actually give you a good amount of it, and the chicken is always perfectly crispy and hot! They also give you a pretty large portion of chicken (check the picture!) and I think this salad is pretty cheap, around $8. Anyway, the rolls here are pretty good and they have a wide selection. My parents and I really like the blizzard roll, which is a special one they have with salmon, avocado, tamago, and topped with scallop and tobiko. Definitely get this one! We've also tried the emperor's new roll which is great as well! I've also tried the nabeyaki udon that comes with seafood which is perfect on a cold day.\n\nGood japanese food and close to my house, so will definitely be back here again.", "rating": 4, "date": "2014-06-07"}, {"excerpts": ["When I feel sick or cold, I go for their nabeyaki udon. ", "Hot steamy pot of heartwarming goodness. "], "author": "Marti L.", "review": "Noriega Teriyaki is my to-go place for some consistent hearty Japanese cuisine.\n\nWhen I feel sick or cold, I go for their nabeyaki udon. Hot steamy pot of heartwarming goodness. Slurping those yummy noodles always make me feel better.\n\nWhen I'm starving, I go for their chicken teriyaki dinner. Generous slices of grilled meat and a simple green salad. Miso soup and ice cream too? Who can say no?\n\nWhen I'm in healthy mode, I go for their sushi/rolls. Fresh good quality fish. Their sushi & sashimi tray is worth mentioning. $47.95 for 43 pieces of sushi sashimi nigiri madness!! Wowzer!", "rating": 4, "date": "2009-02-25"}, {"excerpts": ["I had the nabeyaki udon. ", "I'm not quite used to having cooked salmon and catfish(?) in my udon soup.. ", "it was good, but after a while the taste got tiring. ", "Wish there was more of a variety of seafood, like clams, shrimp, etc. "], "author": "Munnie T.", "review": "Randomly stopped by to have dinner here today. The prices are a little off to me - some things seem overpriced, and some things seem cheap.\n\nI had the nabeyaki udon. I'm not quite used to having cooked salmon and catfish(?) in my udon soup.. it was good, but after a while the taste got tiring. Wish there was more of a variety of seafood, like clams, shrimp, etc. Also, the udon noodles they use are thinner than I'm used to as well, causing the texture to be more on the al dente side.\n\nI had the Garden Perfection(?) Roll, and the Pink Salmon Roll. Both were decent, nothing amazing.\n\nFood took a little while to come out, but it was pretty packed so it's understandable. Service was nice enough. Solid 3 stars.", "rating": 3, "date": "2011-08-09"}, {"excerpts": ["Wife had nabeyaki udon. ", "Had huge chunks of a white fish and salmon as well as loaded with other stuff. ", "Strong flavor with the soup base. "], "author": "Bruce B.", "review": "For some reason I didn't try the Teriyaki here. I have been avoiding this place based on the name actually. I wondered if they have anything else. It's like going to a place called the Tuna house and asking for halibut. \n\nNo worries. They have a big menu full of things other than Teriyaki. I had the Chicken Karage. It was ok. Tasted like they just dip chicken in their tempura batter. The miso was just okay too. I still think Tanuki does a better miso and fried chicken. Wife had nabeyaki udon. Had huge chunks of a white fish and salmon as well as loaded with other stuff. Strong flavor with the soup base. Maybe a little too much. \n\nService was quick and nice.", "rating": 3, "date": "2009-01-09"}, {"excerpts": ["However, was so disappointed in the Nabeyaki Udon.  ", "Their noodles were small and when you think Udon, you think Udon noodles.  ", "There were also large chunks of fish and it made the broth taste funny.  ", "Don't think I'll be back."], "author": "Stephanie Y.", "review": "Service was terrific and prices were reasonable.  However, was so disappointed in the Nabeyaki Udon.  Their noodles were small and when you think Udon, you think Udon noodles.  There were also large chunks of fish and it made the broth taste funny.  Don't think I'll be back.", "rating": 1, "date": "2010-09-21"}], "beef or chicken udon": [], "vegetable udon": [], "fish cake udon": [{"excerpts": ["I also had the fish cake udon and it's actually just fish cake and udon noodles. ", "They don't even have green onions or any kind of extra garnish. ", "Kinda lame since I've never had any udon or Ramen that just came so bare minimum. ", "Anyways my sister was disappointed at the teriyaki house and she said it didn't meet her expectations ", "and I've never been a huge fan ", "so it's no biggie to me."], "author": "Yvonne L.", "review": "My sister use to love this place and when she came home for the holidays she really wanted to eat here. Sadly she asked if it's always been mediocre or did they have a serious decline in quality. Her BBQ shrimp was one of her favorite dishes but this time around they were cold and I had to ask the waiter to reheat it and even when it was warmed up she said it lacked flavor. I had the shitake maki and it was good but then again it's nothing special. I also had the fish cake udon and it's actually just fish cake and udon noodles. They don't even have green onions or any kind of extra garnish. Kinda lame since I've never had any udon or Ramen that just came so bare minimum. Anyways my sister was disappointed at the teriyaki house and she said it didn't meet her expectations and I've never been a huge fan so it's no biggie to me.", "rating": 3, "date": "2017-01-12"}], "plain udon": [{"excerpts": ["Plain Udon - not sure what noodles they used, but it sure wasn't Udon.  \n\n"], "author": "Candice H.", "review": "Ordered takeout from here tonight and sadly was disappointed.  Although service was friendly, it wasn't enough to suffice.  \n\nThe following items were ordered:\n\nChicken Teriyaki - included with the meal is miso soup, salad, & ice cream (even for takeout).  The portion was good.  Too bad the chicken wasn't cooked.  I had to nuke it in the microwave in order for it to be edible.  \n\nPlain Udon - not sure what noodles they used, but it sure wasn't Udon.  \n\nShiitake Roll - Roll was good, but it's pretty impossible to mess up.  \n\nPopeye Roll - spinach & shiitake. I would pass on this as it tasted off.  \n\nSpicy Tuna Roll - Fish was way too pink.  It looked like it was dipped in food coloring.  \n\nSpider Roll - Tasted like mud.\n\nAside from potentially getting food poisoning, the food was just mediocre.  It's a bummer since I finally found a place that has shiitake rolls on their menu.", "rating": 2, "date": "2018-04-17"}], "chasu ramen": [{"excerpts": ["Then I was possessed to try the Chasu Ramen. ", "As expected, dish water broth, pork boiled in something water based. ", "Overcooked tasteless egg. "], "author": "Perry V.", "review": "Seriously, don't bother.\n\nIt's always painful to see this kind of business taking a very proud and respectful culture's cuisine and doing such disrespect to it.\n\nLet's begin with the old gray cucumber served with some glowing viscous yellow slurp. I was scared, I lifted up the top slice and had to taste just one slice. And as I thought, it was horrible.\n\nThen I tried the gyoza, a traditional Japanese appetizer. Isn't it interesting how pot stickers and gyoza can be confused?? Exactly, they're pot stickers, not gyoza.\n\nTwo strikes..\n\nThen I was possessed to try the Chasu Ramen. As expected, dish water broth, pork boiled in something water based. Overcooked tasteless egg. Black woodear mushrooms.\n\nOk, I'm offended that you've made a mockery of Japanese food. If you're going to have a Japanese restaurant, then do the honor of making the very best possible. San Francisco has some of the very best food in the US. Did you really feel like you were offering food worthy of peoples hard earned money?\n\nDo your very best and be proud, or go work for someone else.", "rating": 1, "date": "2016-01-30"}, {"excerpts": ["I had a craving for ramen last night and ordered the chasu ramen. ", "After experiencing very good ramen elsewhere before, ramen here is definitely not comparable. \n", "Complimentary dessert is a plus!"], "author": "Karen L.", "review": "I only come here cause it's conveniently near my place and a better alternative to the sushi places around here. Also, prices here are fairly decent. \nSushi rolls here are not bad. However, sometimes they are doused with too much sauce. Salmon teriyaki is pretty good, it's something I always order all the time. \nI had a craving for ramen last night and ordered the chasu ramen. After experiencing very good ramen elsewhere before, ramen here is definitely not comparable. \nComplimentary dessert is a plus!", "rating": 3, "date": "2010-07-12"}, {"excerpts": ["Here's what we ordered:\n- Chasu Ramen ($7.95)", ": The broth wasn't as thick as I prefer, but it was still yummy. ", "Flavors reminded me of \"saimin\" back home. ", "Lots of vegetables, which was a plus; but only two pieces of pork. ", "Otherwise, the bowl is HUGE, so expect leftovers. \n", "- Dancing Lion Roll ($9.75): Awesome! ", "Unagi over a shrimp tempura roll (can't remember what else was in it). ", "It had a perfect crunch and was especially tasty. ", "Hands down, my favorite part of the meal. ", "Hella pieces to boot!\n"], "author": "Nicole I.", "review": "I went to Noriega Teriyaki House with my boyfriend on a co-worker's recommendation. Love that they have an expansive menu - lots of options for both sushi, grilled items, and even noodles. We arrived at 5:45 and were seated immediately. However, a few minutes after us, the place quickly got packed. Be sure to get here early or expect a wait. \n\nHere's what we ordered:\n- Chasu Ramen ($7.95): The broth wasn't as thick as I prefer, but it was still yummy. Flavors reminded me of \"saimin\" back home. Lots of vegetables, which was a plus; but only two pieces of pork. Otherwise, the bowl is HUGE, so expect leftovers. \n- Dancing Lion Roll ($9.75): Awesome! Unagi over a shrimp tempura roll (can't remember what else was in it). It had a perfect crunch and was especially tasty. Hands down, my favorite part of the meal. Hella pieces to boot!\n- Tekka Maki ($3.45)\n- California Roll ($3.95)\n\nOverall, we had a positive experience here and are likely to come back for more! FYI - street and meter parking only, and it's right across a Walgreens, therefore the area's pretty busy. Budget extra time to find a spot especially during peak times ;)", "rating": 3, "date": "2013-01-05"}, {"excerpts": ["I had the chasu ramen...", "yummy stuff, good flavors, and perfect for a rainy weekend.  ", "Plenty of vegetables, fresh ramen, and clear broth.  ", "The pork was very flavorful...and not disgustingly greasy!  ", "Slurping required. "], "author": "Fannie S.", "review": "Contrary to their name....I ate anything but teriyaki. \n\nI had the chasu ramen...yummy stuff, good flavors, and perfect for a rainy weekend.  Plenty of vegetables, fresh ramen, and clear broth.  The pork was very flavorful...and not disgustingly greasy!  Slurping required. :)\n\nI tried bits from my friend's sushi boat...very nice fresh slices of quality sashimi and nigiri, all fish was under $25.00.  I also ordered the rainbow spider roll, which had very good fish but I was a bit surprised by the heaviness of the softshell crab.  I'm a fan of daikon, and they had very nice strips of daikon with the sushi.  \n\nMy friend's miso soup was a bit on the bland side, but that may have been the type of miso.  *shrugs*  \n\nService = friendly.  They're not super attentive but they're easily flagged down (we had a hot tea spill).  Tea = self-serve, they drop a huge pot onto the table.  lol  They are fast with the food though.  \n\nDecor = dimly lit, typical japanese place.  Clean place.  And they had good ventilation too.  Plenty of space and definitely could be a good place for large gatherings.  \n\nNot sure if it's Chinese-owned and operated but.............could very well be.   It's not the best Japanese in this city but it is fairly good for a predominantly Chinese neighborhood.", "rating": 4, "date": "2008-12-22"}, {"excerpts": ["We ordered hamachi sashimi, 6 pcs oysters on the half shell, chasu ramen, and a tempura/salmon teriyaki dinner, 1 side order rice and 1 green tea ice cream.\n\n"], "author": "Rhodora M.", "review": "Every bleeping time I order from this place, I get close to botchulism.  Like a schmuck, my husband and I decided to give them another chance the other night.  We ordered hamachi sashimi, 6 pcs oysters on the half shell, chasu ramen, and a tempura/salmon teriyaki dinner, 1 side order rice and 1 green tea ice cream.\n\nWouldn't you know the exact same thing again?  gosh, I never learn!  Even the soup made me sick.  Soup, cooked no less!  They must have some serious bacteria culture thing going on there!!!", "rating": 1, "date": "2009-08-26"}], "veggie soba": [{"excerpts": ["I always look forward to an order of veggie soba that comes in a iron bowl that keeps the soup piping hot for a long time. ", "It includes a generous serving of about 8 types of vegetable, all under $8. ", "I love their deep fried California roll--9 pieces for $7. ", "Outstanding services today even though they were filled w/ patrons (despite the economic slow down, if I may add)."], "author": "Kim T.", "review": "I always look forward to an order of veggie soba that comes in a iron bowl that keeps the soup piping hot for a long time. It includes a generous serving of about 8 types of vegetable, all under $8. I love their deep fried California roll--9 pieces for $7. Outstanding services today even though they were filled w/ patrons (despite the economic slow down, if I may add).", "rating": 5, "date": "2008-12-05"}], "chicken soba": [{"excerpts": ["Then, we also got the Chicken Soba which I didn't think was very good, actually. "], "author": "Ivy L.", "review": "It's alright here, definitely not one of my favorite Japanese or sushi places, but then again, I didn't buy the special rolls. Not great, but not bad either.\n\nWhen we arrived, we were instantly seated and they brought us waters and a pot of tea, which is really nice. It happened to be one of my favorites- Barley Tea. :) The service overall was good, they didn't leave us waiting and were good about checking up on us. The setting of the place was pretty nice! There's a fake garden-like area when you first walk in. They seated us at a rather large table, so it was a bit awkward trying to figure out how to sit. But they were relatively busy. There was no line, but they were filled up.\n\nMy friend and I shared some dishes, so we went for the basic rolls and Soba Noodles. The basic rolls I got was Sushi Combo #3 (Hamachi Maki, Maguro, Unagi, Tako, Ebi). My favorite from that selection was the Maguro. I didn't particularly like the Hamachi Maki but everything else was okay.Then, we also got the Chicken Soba which I didn't think was very good, actually. It was plain and didn't have that much flavor.\n\nTo be fair, I did enjoy my friend's roll. I think it was the Cherry Blossom Roll, but whatever it was, it was delicious!\n\nThis place just wasn't outstanding enough with all of the Japanese restaurants around, but the prices are pretty decent and maybe I just need to give it another try with the Special Rolls!", "rating": 3, "date": "2013-01-27"}, {"excerpts": ["I had a chicken soba and it was delicious.  ", "(Also made me realized i like soba a.k.a. black noodles more than udon a.k.a. white noodles.)  ", "The atmosphere was warm and nice.  ", "They had decors that make you not surprise you're in a Japanese restaurant.  ", "The waiters were nice, young, and dress in traditional clothes, or maybe just the tops.  ", "The price was reasonable.  ", "(My soba cost about $8.95.)"], "author": "Karen C.", "review": "Not the best Japanese restaurant I've been to, but still not bad at all.  I had a chicken soba and it was delicious.  (Also made me realized i like soba a.k.a. black noodles more than udon a.k.a. white noodles.)  The atmosphere was warm and nice.  They had decors that make you not surprise you're in a Japanese restaurant.  The waiters were nice, young, and dress in traditional clothes, or maybe just the tops.  The price was reasonable.  (My soba cost about $8.95.)", "rating": 5, "date": "2008-01-23"}], "tempura or chicken teriyaki and grilled seabass": [], "tuna or salmon sashimi and unaju": [], "tuna or salmon sashimi and tempura": [], "chicken teriyaki and beef teriyaki": [{"excerpts": ["I ordered Chicken Teriyaki and Beef Teriyaki over rice which was definitely a nice portion size. ", "It came with a salad and miso soup as well. ", "The price ended being like $15 so it's okay not bad but maybe a little bit high too. "], "author": "M. L.", "review": "Went here for a dinner with about 5 or 6 friends a couple of weeks ago and it had it's ups and downs while I was there. We had a reservation at 6 and was seated promptly.\n\nI ordered Chicken Teriyaki and Beef Teriyaki over rice which was definitely a nice portion size. It came with a salad and miso soup as well. The price ended being like $15 so it's okay not bad but maybe a little bit high too. Overall the food tasted pretty good as well.\n\nBiggest turn off was when we were eating dessert, the waiter asked us to move because there was a party waiting for our table. I've never heard someone ask another person to move when they aren't finished eating. Rushed us out afterwards. VERY VERY RUDE! Probably wouldn't come back", "rating": 2, "date": "2012-07-07"}], "beef teriyaki and salmon teriyaki": [], "tonkatsu and chicken teriyaki": [], "california roll tempura and chicken teriyaki": [], "tuna or salmon sashimi and beef teriyaki": [], "fried banana  ice cream": [], "new york cheesecake": [{"excerpts": ["For dessert, I had the New York cheesecake, and it was ok. "], "author": "Rachel H.", "review": "I came here because the other restaurant I wanted to eat at had a very long wait time. However, after walking in here and standing at the front for a long time (at least 5 minutes), nobody greeted me or put my name down. There were plenty of workers walking around, so I was baffled. I was just about to leave when somebody finally helped me. \n\nI ordered the chasu wonton ramen, and it was delicious! The portion was huge, too!! For dessert, I had the New York cheesecake, and it was ok. It was too dense for me, but the price was pretty good. \n\nI liked the food here, but the service was a turn-off. My waitress didn't listen very well, either.", "rating": 3, "date": "2015-03-30"}]}