{"italian chopped salad": [{"excerpts": ["The italian chopped salad was missing ingredients that were listed on the menu and nothing was chopped. ", "It was a weird salad.\n", "The pizza was mediocre and took a really long time to be served.  \n", "Sorry, I don't think I'll be back. ", "Disappointing."], "author": "Jamie Y.", "review": "I have had pizza here several times over the last 25 years. This trip was disappointing. The italian chopped salad was missing ingredients that were listed on the menu and nothing was chopped. It was a weird salad.\nThe pizza was mediocre and took a really long time to be served.  \nSorry, I don't think I'll be back. Disappointing.", "rating": 2, "date": "2018-02-08"}], "caesar salad tray": [], "greek salad tray": [], "italian chopped salad tray": [], "mixed green salad tray": [], "butter lettuce salad": [], "chicken marsala entree": [], "chicken parmesano entree": [], "parmigiana di melanzane entree": [], "portobello  crimini mushroom ravioli": [], "penne con formaggi": [{"excerpts": ["(The picture is of the penne con formaggi)"], "author": "Maile W.", "review": "Easy to get a table. Food took some time to arrive, but tasted great when it arrived. My food burnt me because it was so hot when it arrived. VERY REASONABLY PRICED. I went for dinner with my family of 4. Service was good.\n(The picture is of the penne con formaggi)", "rating": 4, "date": "2017-11-24"}], "spaghetti and clams": [{"excerpts": ["I got the spaghetti and clams and it looked and tasted like they put 2 cans of baby clams in it. ", "There wasn't much flavor. ", "The most disappointing thing is the service. ", "It was just really annoying to have to be the person to wave the waiter down."], "author": "Jelina A.", "review": "The service here really sucked. I had to keep getting my waiter's attention because he was texting the whole time. My wife and I ordered pasta, which comes with bread, and I ordered an extra garden salad. The salad was literally iceberg lettuce that was still wet and sliced carrots and cabbage on top. It just looked like they threw it on a plate. I had to remind the waiter about our bread. I got the spaghetti and clams and it looked and tasted like they put 2 cans of baby clams in it. There wasn't much flavor. The most disappointing thing is the service. It was just really annoying to have to be the person to wave the waiter down.", "rating": 2, "date": "2014-10-19"}, {"excerpts": ["We ordered a large pepperoni and sausage thin crust, the spaghetti and clams with olive oil and garlic (we were offered red and white sauce too), and the minestrone soup.  ", "Let me start with the better items:  the soup was good and not too salty.  ", "The pizza crust was burnt at the edges and the middle was soggy like a wet sponge.  ", "I can understand if the pizza crust gets soggy in a cardboard box after taking 20 minutes to be delivered but this was the first slice after the pie arrived at our table...gross!  ", "The worse part was the spaghetti and clams.  ", "It came in a heavy alfredo sauce and not oil and garlic.  ", "When we informed the waitress, she went to the kitchen and did not come back until 20 minutes latter.  ", "She kept insisting it was oil and garlic with a little cream...", "WTF!!!  ", "She said sorry but made no effort to adjust the bill.  ", "I guess NB no longer cares about repeat business."], "author": "Edmund W.", "review": "This place has gone downhill fast.  My kid likes this place so whenever we are in the area and she wants pizza, we come here.  But last Sunday will be the last.  We ordered a large pepperoni and sausage thin crust, the spaghetti and clams with olive oil and garlic (we were offered red and white sauce too), and the minestrone soup.  Let me start with the better items:  the soup was good and not too salty.  The pizza crust was burnt at the edges and the middle was soggy like a wet sponge.  I can understand if the pizza crust gets soggy in a cardboard box after taking 20 minutes to be delivered but this was the first slice after the pie arrived at our table...gross!  The worse part was the spaghetti and clams.  It came in a heavy alfredo sauce and not oil and garlic.  When we informed the waitress, she went to the kitchen and did not come back until 20 minutes latter.  She kept insisting it was oil and garlic with a little cream...WTF!!!  She said sorry but made no effort to adjust the bill.  I guess NB no longer cares about repeat business.", "rating": 2, "date": "2011-02-23"}], "spaghetti marinara": [{"excerpts": ["My favorite part of the meal was the plain spaghetti marinara side and the steamed vegetables. "], "author": "David T.", "review": "I don't know if I just caught them on a bad night or just ordered the wrong things, but almost everything I ordered had too much garlic to enjoy. I love garlic, but my meal had enough to stop vampires and humans dead in their tracks. I was exuding garlic thru my skin for the next 2 days.\n\nMy favorite part of the meal was the plain spaghetti marinara side and the steamed vegetables. It was the only garlic reprieve in the whole meal.\n\nI will try this place one more time, just in case I happened to unknowingly catch a freak event like national garlic day without knowing it.", "rating": 2, "date": "2016-12-28"}, {"excerpts": ["Really, really good spaghetti marinara!  ", "I'm not a fan of the cheesy garlic bread though.  "], "author": "Paige W.", "review": "Really, really good spaghetti marinara!  I'm not a fan of the cheesy garlic bread though.  I wish they had capers.\n\nThe bolognese sauce is pretty on-point too.  My new fave is the cheese tortellini with bolognese.  I always order to-go.", "rating": 3, "date": "2014-02-27"}, {"excerpts": ["I have had the spaghetti marinara and my husband has had the chicken parm, and both are delicious.\n\n"], "author": "Jules P.", "review": "We always walk to this North Beach from the FiDi. We did so last Saturday and almost freaked when we looked up the street and saw no familiar \"North Beach Pizza\" sign. I thought they had become another casualty in today's ecomony. Then my husband said, \"Hey, look. I think they moved across the street!\" BIG relief!!! \n\nWow is the place different, but in a good way.  It's much more open and bright, but not too much, if you know what I mean. I am just comparing it to what it used to be.\n\nWhen we asked our waiter how long they had been at their \"new\" location, he got a big grin and said, \"Just about a month, don't you just love it?\" And I have to say, I really do love it. \n\nWe actually hadn't been here since last December since I have been on a pretty strict eating plan. I told myself, \"no North Beach until I lose at least 35 pounds.\" Well I did it, and we went.\n\nLet me just say that the beer is ice cold and the pizza is delicious and well worth the one day of blowing off my diet. Soooooo good. If you order a soda, it still comes in a can however. But no complaints at all on my part.\n\nAnother BIG improvement is that they now have a separate bathroom for gents and ladies. Unlike their other location where they only had one bathroom for both men and women. Kinda gross. But now they are clean and separate.\n\nAlso, don't be afraid to order an entree. They are really good as well. I have had the spaghetti marinara and my husband has had the chicken parm, and both are delicious.\n\nWhat can I say? North Beach is my reward for being good and staying on my diet and I have to say, I chose wisely.", "rating": 4, "date": "2009-05-24"}], "fettucini alfredo with chicken": [], "fettucini carbonara": [], "cheese ravioli with alfredo": [], "cheese ravioli with meat sauce": [], "lasagna vegetarian": [], "gnocchi nepolitana": [], "parmigiana del pollo sandwich": [], "meatball parmigiana sandwich": [], "chicken caesar wrap": [], "angus beef burger": [], "side of meatballs": [{"excerpts": ["I was starving so started off with a side of meatballs. ", "Yum Yum Yum! ", "They were delicious big meatballs in a very pure tomato sauce. ", "Being from the Northeast and traveling to NYC often during my childhood, I know how to spot genuine Italian Food and tomato sauce. ", "The pizza was divine. ", "It had that scrumptious cheese that you get off the streets in NYC...", "I can't even describe it, but not every pizza has that particular flavor. ", "Maybe it's the particular distributor they get the cheese from...", "we designed our own thin crust pizza with a regular cheese pizza base...", "half with artichokes, fresh basil and feta cheese, half with pesto. ", "We ate way too much ", "but it was worth it. ", "We found out they would deliver to our place and ended up trying it for delivery last week. ", "I loved the online ordering feature they have on their yelp listing. ", "I didn't even have to pick up the phone. ", "They were right though - the waitress had warned us it would take an hour ", "and it sure did. ", "It was still hot though and just as good as the first time we had it. ", "We forgot to ask for thin crust, but still thoroughly enjoyed the thicker crust version."], "author": "Kelsey K.", "review": "Were wondering the streets of North Beach and decided to give North Beach Pizza a \"go\" without analyzing it or reading reviews first. Boy are we glad we did! I was starving so started off with a side of meatballs. Yum Yum Yum! They were delicious big meatballs in a very pure tomato sauce. Being from the Northeast and traveling to NYC often during my childhood, I know how to spot genuine Italian Food and tomato sauce. The pizza was divine. It had that scrumptious cheese that you get off the streets in NYC...I can't even describe it, but not every pizza has that particular flavor. Maybe it's the particular distributor they get the cheese from...we designed our own thin crust pizza with a regular cheese pizza base...half with artichokes, fresh basil and feta cheese, half with pesto. We ate way too much but it was worth it. We found out they would deliver to our place and ended up trying it for delivery last week. I loved the online ordering feature they have on their yelp listing. I didn't even have to pick up the phone. They were right though - the waitress had warned us it would take an hour and it sure did. It was still hot though and just as good as the first time we had it. We forgot to ask for thin crust, but still thoroughly enjoyed the thicker crust version.", "rating": 5, "date": "2014-01-21"}], "side of ranch dressing": [], "minestrone soup bowl": [], "honey mustard chicken wings": [], "sriracha  teriyaki chicken wings": [], "coit tower special pizza": [], "verdi special pizza": [], "cable car special pizza": [], "quattro formaggi special pizza": [], "di carne di maiale special pizza": [], "margarita special pizza": [{"excerpts": ["Margarita Special Pizza  - ", "The pizza tasted very good,  ", "I like the fresh dough taste of the crust.  ", "This is a relatively thin crust pizza.  ", "The outer crust was rather hard.  ", "Some might think it is slightly too salty but for my personal taste, it wasn't.  ", "The sauce was tangy. ", "The tomatoes were fresh.  ", "I thought it came together as a nice pizza.  ", "Negative note.  "], "author": "Mark D.", "review": "1.  Delivery order from North Beach Pizza on Grant.\n2.  Easy to order on Grubhub.com\n3.  Margarita Special Pizza  - The pizza tasted very good,  I like the fresh dough taste of the crust.  This is a relatively thin crust pizza.  The outer crust was rather hard.  Some might think it is slightly too salty but for my personal taste, it wasn't.  The sauce was tangy. The tomatoes were fresh.  I thought it came together as a nice pizza.  Negative note.  For some reason, some of the sliced of pizza were very soggy and limp on the bottom,\n\nhttp://tinyurl.com/48fl77u\n\n4.  They did not include any red pepper flakes or Parmesan cheese.\n5.  Relatively low order minimum - $15\n6.  Delivery was prompt, professional, and polite.\n7.  I would order pizza from them again.", "rating": 3, "date": "2011-03-24"}], "barbary coast pizza": [], "cesare salad tray": []}