{"cheese pizza with one topping": [], "cheese pizza with two toppings": [], "cheese pizza with three toppings": [], "cheese pizza with four toppings": [], "aloha special pizza": [], "golden gate special pizza": [], "coit special pizza": [], "amigo special pizza": [], "north beach special pizza": [], "verdis special pizza": [], "cable car pizza": [{"excerpts": ["The only pizza that was a little much for me was the Cable Car Pizza. ", "It was delicious, but after the first slice the garlic cream sauce was a little too intense. ", "If they lightened up on that, it would be ", "just is delicious as the rest of their pizzas I have tried."], "author": "Katie S.", "review": "Damn good delivery pizza. Not cheap, but not necessarily expensive either. You get what you pay for. Quality pizza with lots of toppings.\n\nThe only pizza that was a little much for me was the Cable Car Pizza. It was delicious, but after the first slice the garlic cream sauce was a little too intense. If they lightened up on that, it would be just is delicious as the rest of their pizzas I have tried.", "rating": 4, "date": "2011-07-24"}, {"excerpts": ["We ordered the Cable Car pizza and it arrived hot and delicious in a little less than 40 mins.  ", "Yay!  ", "We've tried a number of pizza delivery place over the years and all have been pretty lackluster."], "author": "Julienne G.", "review": "This is our new pizza delivery place of choice.  After reading Jan Z.'s  review (she knows her stuff!)  MCM and I gave this place a shot on a cold rainy afternoon.  We ordered the Cable Car pizza and it arrived hot and delicious in a little less than 40 mins.  Yay!  We've tried a number of pizza delivery place over the years and all have been pretty lackluster.", "rating": 4, "date": "2009-02-18"}], "new mission special pizza": [{"excerpts": ["Don't forget to try the New Mission Special pizza!  ", "Barbecue sauce, chicken, bacon, mmm..."], "author": "Ryan T.", "review": "Northbeach Pizza is actually filling, which is more than you can say for a lot of pizza places in San Francisco.  I can get pretty full off of 2-3 slices, so it's pretty good value-wise.\n\nThe crust is not too thick, not too thin -- a fine line to walk, and they get it just right.  Most importantly, the crust is not too chewy!  You don't get a sore jaw after eating here.  Sauce and toppings are generous, which is awesome.\n\nThere's no place to sit down inside, but I highly recommend this place for take-out or delivery.  Don't forget to try the New Mission Special pizza!  Barbecue sauce, chicken, bacon, mmm...", "rating": 4, "date": "2009-11-01"}], "white sauce chicken pizza": [], "all meat special pizza": [], "tortellini": [], "tortellini romana": [], "a linguine with sauce": [], "baked lasagna meat": [], "eggplant entrees parmigiana": [], "linguine and clams with marinara sauce": [], "spaghetti garlic": [], "spaghetti bolognese with meatballs": [], "ravioli with marinara cream sauce": [], "cheese ravioli": [], "penne with mushrooms marinada": [], "pasta primavera alfredo sauce": [], "pasta with marinara chicken": [], "gnocchi": [{"excerpts": ["Mushroom penne is great, and they seriously have some of the best gnocchi I've ever tasted.  ", "My bf also looooves their chicken ceasar salad.  "], "author": "Chelsea C.", "review": "Oh North Beach, you are so close to being perfect pizza in my eyes.\n\nI'm a fan of North Beach Pizza for many reasons.  1)  They naturally go a little heavier on the sauce (and BONUS STAR the sauce is pretty damn delectable) 2) they naturally go a little lighter on the cheese (this is how I like it) 3) Since I live on Taraval myself their delivery times is always impecable,  Simple amazing really.\n\nI've also had a few pasta dishes of theirs.  Mushroom penne is great, and they seriously have some of the best gnocchi I've ever tasted.  My bf also looooves their chicken ceasar salad.  Great dressing.\n\nIwould give them 5 stars, I order from them all the time.  But the last time I ordred i asked for mozzarella sticks (thinking this would obviously be something they would carry and unfortunately I was driving and didn't have a menu in front of me) and instead of getting fried ooozing cheese filled goodness like i had been looking forward too, I got breadsticks with cheese on them.  Fail.  Although the sticks were still damn good, they weren't what I had been fantasizing about for 35 minutes.  But when I went and checked the menu I was less upset when i saw that they infact DO NOT have mozzarella sticks like I thought.  I just wish they would have told me that when I had ordered, or asked me if i meant bread sticks?  It's all good though, I'll def be back.  Just a little hiccup in my and North Beach Pizza's blossoming relationship.", "rating": 4, "date": "2009-08-05"}], "vegetarian lasagna": [], "mineral bottled water": [], "bottled soda": [], "a two liter soda": [], "chicken breast parmigiana": [], "chicken cacciatore": [], "baked chicken": [], "fried chicken": [], "barbecued pork spareribs": [], "barbecued chicken": [], "bbq pork spareribs": [], "bbq chicken": [], "hamburger sandwich with cheese": [], "meatball parmigiana sandwich with cheese": [], "italian sausage sandwich with cheese": [], "chicken breast parmigiana sandwich with cheese": [], "pizza sub": [], "eggplant sandwich": [], "ham and cheese sandwich": [], "tossed green salad": [], "half caesar salad": [], "big salad": [], "choose big salad": [], "garlic bread with cheese": [], "sauteed vegetables": [], "bread sticks": [{"excerpts": ["I just wish they would have told me that when I had ordered, or asked me if i meant bread sticks?  ", "It's all good though, I'll def be back.  ", "Just a little hiccup in my and North Beach Pizza's blossoming relationship."], "author": "Chelsea C.", "review": "Oh North Beach, you are so close to being perfect pizza in my eyes.\n\nI'm a fan of North Beach Pizza for many reasons.  1)  They naturally go a little heavier on the sauce (and BONUS STAR the sauce is pretty damn delectable) 2) they naturally go a little lighter on the cheese (this is how I like it) 3) Since I live on Taraval myself their delivery times is always impecable,  Simple amazing really.\n\nI've also had a few pasta dishes of theirs.  Mushroom penne is great, and they seriously have some of the best gnocchi I've ever tasted.  My bf also looooves their chicken ceasar salad.  Great dressing.\n\nIwould give them 5 stars, I order from them all the time.  But the last time I ordred i asked for mozzarella sticks (thinking this would obviously be something they would carry and unfortunately I was driving and didn't have a menu in front of me) and instead of getting fried ooozing cheese filled goodness like i had been looking forward too, I got breadsticks with cheese on them.  Fail.  Although the sticks were still damn good, they weren't what I had been fantasizing about for 35 minutes.  But when I went and checked the menu I was less upset when i saw that they infact DO NOT have mozzarella sticks like I thought.  I just wish they would have told me that when I had ordered, or asked me if i meant bread sticks?  It's all good though, I'll def be back.  Just a little hiccup in my and North Beach Pizza's blossoming relationship.", "rating": 4, "date": "2009-08-05"}], "meatballs": [{"excerpts": ["Delicious slices, the spaghetti and meatballs is done well but not always consistent, sometimes the sauce is thick and other times it is really thin with a lot of tomatoes. ", "That would be my only complaint. ", "But it is very tasty. ", "4 stars."], "author": "Bella B.", "review": "Delicious slices, the spaghetti and meatballs is done well but not always consistent, sometimes the sauce is thick and other times it is really thin with a lot of tomatoes. That would be my only complaint. But it is very tasty. 4 stars.", "rating": 4, "date": "2013-08-08"}, {"excerpts": ["There were barely any meatballs on it, the ones that we're were undercooked and cut in half. "], "author": "Mandi K.", "review": "Ordered from here via grubhub. Almost threw up the food was so disgusting.\n\nWe ordered two meatball subs which seems impossible to mess up.\n\nThere were barely any meatballs on it, the ones that we're were undercooked and cut in half. Oh and there was no sauce.\n\nDon't order from this place unless you want disappointment.", "rating": 1, "date": "2014-03-10"}], "side of ranch": [], "minestrone soup": [], "margherita special thin crust pizza": [], "lombard special thin crust pizza": [], "presidio veggie thin crust pizza": [], "union square special thin crust pizza": [], "market street special thin crust pizza": [], "medium topping pizzas special": [], "large topping pizza  wings and a liter bottle of soda special": [], " cheese pizza special": [], "large pepperoni pizza special": [], "large sausage pizza special": [], "family combo": []}