{"toasted angel food cake": [{"excerpts": ["we had a toasted angel food cake with sweet corn ice cream which was simply marvelous!  ", "What a fine finish to a lovely meal.  ", "Highly recommend this place.  ", "You might have to be persistent to get reservations, but it's worth whatever you have to do to dine there."], "author": "Peter S.", "review": "Fabulous!\nWhat a find!  The burrata salad was delightful, with a fine pepperonata under the cheese; delicious!  A great beginning.\nThen, my wife had a pasta/shrimp dish which was very good, and I had what was listed on the menu as a petit filet.  What arrived was anything but petit!  A huge portion (yes, I understand that petit filet is from higher up on the loin).  And delicious - much more flavor that filet mignon, and accompanied by a corn preparation which was superb!\nDessert:  we had a toasted angel food cake with sweet corn ice cream which was simply marvelous!  What a fine finish to a lovely meal.  Highly recommend this place.  You might have to be persistent to get reservations, but it's worth whatever you have to do to dine there.", "rating": 5, "date": "2018-09-17"}, {"excerpts": ["A++ best float would float again\n\nToasted Angel Food Cake: the rose ice cream was lovely. "], "author": "Nikki I.", "review": "What a truly fantastic experience. \n\nThere is a chef's tasting menu for $70 but everyone at the table has to participate so I didn't get to do that. I would definitely come back for this, however. I can't imagine not liking anything served here after everything I tried on my first visit. It'd be worth it. \n\nWhat we ordered:\n\nOysters: the pickled green strawberry topping was interesting. not sure it was my favorite but it was still worth trying.  very meaty oysters too!\n\nDeviled Egg: still having dreams about this egg... never knew I could love an egg so much. easily my favorite dish on the menu. I want to learn to make it!\n\nSquid Ink Noodles: the lemon agrumato!! the flavors! also want to learn this recipe.\n\nRed Gems: one of the most refreshing salads. that green goddess sauce...\n\nCaramelle: one of the more rich and heavy dishes, but incredibly flavorful. the combination of ricotta, pistachio and brown butter felt almost sinful...\n\nAlaskan Halibut: best cooked halibut ever. the turnip was perfect and the smoky saffron broth was something else. I could probably take a vat of this to go.\n\nGrilled Lamb: I felt like I just ordered a massive turkey leg at a renaissance faire. It was kind of too meaty of a plate for me personally, but it was still fantastic. I even ate the meat off the bone because it was the best part (no shame). would probably order something different next time though...\n\nChandler Strawberry Float: the lime soda. A++ best float would float again\n\nToasted Angel Food Cake: the rose ice cream was lovely. the angel cake was crispy on the outside and fluffy inside, as it should be. very fruity, like a cobbler, but better.\n\nI would actually come back here just to order all the desserts; I caught glimpses from the neighboring tables and everything looked incredible. I would also come back during the day just to take better photos of the dishes (but that's just me). \n\nVibes were very hospitable. Felt spoiled. Making late-night reservations was a good way to go because it was quieter and we got seated immediately, served quickly, and pampered. Overall, it was very comfortable, homey, but still luxurious.\n\nThanks, Octavia.", "rating": 5, "date": "2017-05-30"}, {"excerpts": ["For dessert we had the toasted angel food cake with elderflower ice cream. ", "AMAZING. "], "author": "Noelle H.", "review": "We ordered 2 oysters, chilled squid ink noodles, smoked bodega bay black cod, saffron tonnarelli, the duck and the petit filet. \n\nThere's a huge wine list! BF chose a pinot and we just shared it between the 2 of us since I only wanted a few sips. The pours here are quite generous!  \n\nWe started off with Octavia's complementary bread and butter which is delicious. It came out nice and warm. \n\nThe oysters were good, but nothing exceptional. \n\nWe both enjoyed the chilled squid ink noodles! The portion is tiny but packs a lot of flavor! \n\nThe smoked black cod was our least favorite. It was our first time having smoked black cod and it was good, but out of all the dishes, this one lacked depth and flavors and the portion was small for the price. \n\nThe saffron tonnarelli with dungeness crab, fennel bouillabaisse, and espelette aioli was rich with an amazing seafood flavor!! \n\nIf there's one thing you have to get from Octavia, it's the DUCK. IT'S AN ABSOLUTE MUST. I ordered it medium (medium rare always tends to be a bit too under for me) and this was perfect. Loved the butter beans and salsa verde that came with the dish as well. Best dish by far!! \n\nBF said the filet was ok, but not amazing. One thing that was annoying was that our steak knives weren't that sharp, so it was difficult for him to cut his steak. \n\nFor dessert we had the toasted angel food cake with elderflower ice cream. AMAZING. The perfect ending for a terrific dinner!\n\nService was on point as well. \n\nReservations were easy to make on OpenTable. Great restaurant for a date night!", "rating": 4, "date": "2016-05-11"}, {"excerpts": ["cassoulet was not my favorite but my fiance loved it, profiteroles were forgettable, toasted angel food cake was fantastic! ", "Great ambiance, good service, great food!"], "author": "Christina G.", "review": "Our friends were running late and the staff kindly seated us on time. They just told us they needed the table by a certain time, which gave us about 3 hours, which was plenty of time. The ambiance is beautiful. The bread, which can be purchased by the loaf to take home ($8/loaf) was served a slice at a time. It was exceptionally moist in the middle and crispy on the outside. The \"leaves of grass\" tea was good. Oysters were fantastic, deviled egg was good - slightly spicy, burrata was excellent, squash and persimmon salad was great, pappardelle was tasty but the noodles were thicker than expected, pork was perfectly cooked,  cassoulet was not my favorite but my fiance loved it, profiteroles were forgettable, toasted angel food cake was fantastic! Great ambiance, good service, great food!", "rating": 4, "date": "2016-11-28"}, {"excerpts": ["- Nah (1/5)\nToasted Angel Food Cake - Light cake with rich ice cream -V. Good (4.5/5)\nWarm Chocolate Souffle tart  - Rich and not overly sweet tart with delicious salted caramel ice cream  - V. Good (4.5/5)\n\n", "For dessert, we got the Toasted Angel Food Cake and Souffle tart. ", "The Toasted Angel Food Cake is served with blueberry, mascarpone, lavender ice cream and goes complimented it very well. ", "Cake was light, juicy and not too sweet, the ice cream was delicious too. "], "author": "Kritika K.", "review": "TLDR\nI'd do a 3.5/5 if I could.\nDecor - Simple and pleasant - (5/5)\nService - Polite, approachable and well timed - (5/5)\nFood:\nBaked Levain - Crunchy crust, dense, fresh and flavorful - Excellent (5/5)\nChilled Squid Ink Noodles - Good texture, al dente and delightful - Excellent (5/5)\nSmoked Mushroom Pozole - Unorthodox and delicious - Good (4/5)\nPetit Fillet- Good quality meat, nothing you can't do at home - Okay (3/5)\nPeruvian Purple Polenta - Too many Peas! - Nah (1/5)\nToasted Angel Food Cake - Light cake with rich ice cream -V. Good (4.5/5)\nWarm Chocolate Souffle tart  - Rich and not overly sweet tart with delicious salted caramel ice cream  - V. Good (4.5/5)\n\nAfter reading about Frances losing it's michelin star, we decided to get dinner at Octavia to taste Melissa Perello's instead. Although does an executive chef cook at the restaurant?Nevertheless, we made it there on Thursday night. We found street parking a block away. The decor of the place is simple and contemporary, not overbearing like some other places and still very pleasant. They don't have a liquor license but their wine list is expansive. Sommelier was helpful and not snobbish (we've all dealt with that person!) and service was friendly.\nWe started with Sarah's house baked Levain, Chilled Squid Ink Noodles and Smoked Mushroom Pozole.  Sarah's house baked Levain with the cultured butter  was wonderful, we ate it all up before any other thing came. It was crunchy on the outside but the crust wasn't too big with soft, fresh and dense on the inside. Chilled Squid Ink Noodles were delicious and went well with the lemon and fennel flavor. Their take on Pozole was interesting and flavorful. However, I don't know how I feel about the popcorn in it. For the main course we got the Petit Fillet and Peruvian Purple Polenta. We got Petit fillet as medium rare, the meat was good quality and went well with accompaniments. It was nothing special that you could not do at your grill. Peruvian Purple Polenta was my least favorite. It is hard to make polenta bad in my opinion but the high ratio of peas to polenta in it didn't work for me. For dessert, we got the Toasted Angel Food Cake and Souffle tart. The Toasted Angel Food Cake is served with blueberry, mascarpone, lavender ice cream and goes complimented it very well. Cake was light, juicy and not too sweet, the ice cream was delicious too. Warm Chocolate Soufflé tart is accompanied by cocoa nib brittle, salted caramel ice cream, which is quite obviously a good combination. Tart was hot and perfect texture. Ice cream was good too but not as good as Bi-Rite Salted caramel. Overall, I'd go here and get several small dishes and dessert and skip the main course.", "rating": 4, "date": "2017-05-13"}, {"excerpts": ["But we had the toasted Angel food cake and pistachio profiteroles.  ", "A slight nod to the toasted Angel food cake with rose geranium-out of this world!\n\n"], "author": "Maria F.", "review": "This is my new favorite restaurant.  \n\nI love the space itself.  Warm, inviting, very Northern CA.\n\nWe had:\ngrilled CALAMARI - delicious\nMIZUNA salad - fantastic flavors\nI had the wild salmon, which I loved and my friend had the spring lamb (which I got to sample).   Really delicious combination of flavors and perfectly cooked.\n\nThe bread was out of this world - there was some kind of anise or fennel in it.  We had to pry ourselves away from it.  All of the desserts sounded amazing--I want to go back and try more.  But we had the toasted Angel food cake and pistachio profiteroles.  A slight nod to the toasted Angel food cake with rose geranium-out of this world!\n\nService was impeccable.  Everyone is warm and welcoming.  Highly recommend.  I can't wait to go back!", "rating": 5, "date": "2017-06-17"}, {"excerpts": ["We received a lovely round brown-toasted angel food cake, surrounded by chunks of pink lady apple and smooth brown butter (evoking caramel) ice cream.  "], "author": "Derek W.", "review": "My expectations and enthusiasm were through the roof when we became the first-in-the-door dinner guests on a recent Friday night.  Melissa Perello has dazzled crowds for years at Frances but I've always thought it was too packed and too loud to really engage in the kind of artistic appreciation the food deserves.  Here, Perello has a lot more space, as do her patrons, and the results are impeccable in every way.\n\nIn lieu of entrees, my wife and I took the tasting route, fitting in five different smaller plates and a dessert for maximum menu coverage.  This plan proved to be a stroke of genius by the end, when we were stumped at the thought of trying to pick favorites.   The first two arrivals were a beautiful (ok, all the dishes were works of art) roasted cauliflower salad with Meyer Lemon and Medjool dates and toasted almonds.  The cauliflower was crisp outside and soft inside, and the date puree (along with a few whole dates) added a fun and sweet complement to the tart lemon.  Along with this salad, we received sauteed prawns on a flavorful, deep green bed of broccoli and cavolo nero.  The prawns were done just right, and the bowl (each piece here is handmade for the restaurant) was encircled with a stream of earthy, fabulous pumpkin seed pesto.  \n\nNext came heartier, more robust courses.  The soup started with a mound of roasted kuri squash, poured over with a creamy broth of red lentils in a fragrant Madras curry and then doused with a drizzle of whipped yogurt.  This is my kind of comfort food.  This was balanced by sharp, tangy bites of spinach tossed in rapini pesto with provolone and taggiasche olives, all topped off with crunchy garlic toasts.  Finally, another deep green delight unfolded itself with the tagliatelle constructed of stinging nettles nicely finished with grana padano, lemon, and a superb flurry of toasted bread crumbs (pangrattato) that added unique taste and texture.  \n\nSometimes a meal is so good you have to push yourself to have dessert because you know they'll just kill it, and we were right.  We received a lovely round brown-toasted angel food cake, surrounded by chunks of pink lady apple and smooth brown butter (evoking caramel) ice cream.  All about the plate were delicate traces apple sauce that helped bring everything together decadently.\n\nThere is gorgeous, rustic, natural decor abounding here, and a full open kitchen is always a treat.   The spacious area in front of the kitchen is a great stage for watching food emerge, wine (or cocktails - the house special is a real find) being delivered, and hot bread being wrapped and carried to tables.  And every server was delightful.  I'm already recommending this experience to others.", "rating": 5, "date": "2016-01-18"}, {"excerpts": ["For dessert-- the toasted angel food cake and the warm chocolate souffle tart. ", "Exceptional food and service. ", "I highly recommend it if you're in the area."], "author": "Andy G.", "review": "Great environment. Great experience. Great food. We ordered a little bit of each part of the menu-- the deviled egg, the beef tartare, the little gem lettuce, smoky corn chowder, and the channel islands yellowtail. For dessert-- the toasted angel food cake and the warm chocolate souffle tart. Exceptional food and service. I highly recommend it if you're in the area.", "rating": 5, "date": "2016-07-22"}], "wildflower honey crumb pudding": [{"excerpts": ["We went with the Wildflower Honey crumb pudding and Winter spice profiteroles. "], "author": "Shereen A.", "review": "On this chilly Wednesday night, it was a toss up between Octavia and Frances. Both I've heard are delicious and special in their own little ways. After combing through the menu online, many \"ooh's\" and \"aah's\" later (mostly from me), and taking into consideration location of post dinner plans, we decided to dine at Octavia. I also knew which three desserts I wanted prior to getting to dinner. \n\nWe started off with bread (so good you have to get this! Get two!), the chilled squid ink noodles and much raved about \"deviled egg\". The quotes imply it's not really deviled (because deviled eggs have a hard yolk). The egg is actually beautifully yolky and was delicious nonetheless. If you order the bread, this is a good time to eat it, slathering butter all over it and sopping up the sunshine on your plate. \n\nMoving on to dinner, we ordered the Day boat scallops, and Sonoma duck breast & sausage. I loved everything about the scallop dish. Absolutely everything was perfect. The flavors were well balanced, it had enough texture variance, and of course it was delicious.   \n\nSince I don't eat pork, I had a small bite of duck which was a tad gamey but still really good. \n\nNow on to dessert. I knew which three I wanted and when I asked the waiter for which his favorite was he mentioned they were all good (of course) which made it even harder to choose. He seemed a little judgey that I was going to order three desserts (eh, ain't no thang) so I went with two and decided to get a third if I still wanted it (of course I still want it but decided against the third later, lol). \n\nWe went with the Wildflower Honey crumb pudding and Winter spice profiteroles. Of the two, we enjoyed the honey crumb pudding much more than the profiteroles. \n\nI probably would skip the profiteroles next time. I found the ice cream to profiterole ratio to be quite aggressive and didn't think there was enough miso caramel to balance the dessert. \n\nFood coma ensues. \n\nPost dinner plans you ask? Yeah about that...\n\nAnyways, wonderful experience overall, delicious food, and cozy little restaurant totally deserving of a Michelin Star. \n\nIt's very unassuming from the outside, don't pass it up!", "rating": 4, "date": "2017-12-22"}, {"excerpts": ["Wildflower Honey Crumb Pudding: ", "Warm & comforting mmm! ", "\"", "Mixed berries\" were only blackberries, but there were also delicious figs. ", "When this dish comes to the table, the waiter pours the creme fraiche around the whole thing and it is quite the sight to see *heart eyes*\n", "* Warm Chocolate Souffle Tart: Souffle + Tart?! ", "I haven't had anything like this before and this nearly blew my mind. ", "If you even slightly like chocolate - get this."], "author": "Maayan C.", "review": "Had an amazing meal at Octavia. My family was seated at 5pm with a reservation and we ordered drinks first.\n\nDrinks were fantastic!\nMy favorite was the one I ordered: Carpano Antica Italy. Perfectly sweet (but not too sweet).\n\nFood came up next. I really would have eaten anything off the menu - everything sounded delicious!\n* indicates a favorite dish\n\nSTARTERS\n\"Deviled Egg\" - This is in quotes on the menu because it is not a typical deviled egg. It's actually a soft boiled egg served on a chile relish (tasted like harissa).\nChilled Squid Ink Noodles: This was the only dish of the night that disappointed a bit. I only picked up on a lemony taste when I expected more flavor.\nCornmeal-Crusted Eggplant: Yum! Crispy, flavorful and light.\n* Halibut Crudo: Quite a different dish from the rest of the ones we chose. This one was very refreshing, halibut was delicate and delightful!\n\nMAINS\nPasta Alla Benedetta: Perfectly cooked pasta, with a creamy but light sauce.\n* Coulotte of Wagyu Beef: Best dish of the night! Meat was AMAZING. I don't even know what else to say other than this was possibly the tastiest beef I've ever had! \n* Semolina Dumplings: Second best dish of the night. The dumplings are crispy on the outside and creamy in the middle. Sauce is wonderful, we basically licked the bowl clean... The sauce had a bit of a balsamic flavor which was just amazing.\nKing Salmon: Delicious salmon! This dish was not as memorable as the beef and dumplings, but that's really only relative because those were hands down amazing.\n\nDESSERT\nWildflower Honey Crumb Pudding: Warm & comforting mmm! \"Mixed berries\" were only blackberries, but there were also delicious figs. When this dish comes to the table, the waiter pours the creme fraiche around the whole thing and it is quite the sight to see *heart eyes*\n* Warm Chocolate Souffle Tart: Souffle + Tart?! I haven't had anything like this before and this nearly blew my mind. If you even slightly like chocolate - get this.", "rating": 5, "date": "2018-08-29"}, {"excerpts": ["Got the Wildflower Honey CRUMB PUDDING. ", "Goes great with the                          crème fraīche, brooks cherry, honey toffee. ", "Not too sweet which was perfect for us. ", "Also, we were celebrating my birthday along with another friend. ", "Complementary mini cupcakes from Octavia."], "author": "Sandy B.", "review": "Honestly I can say every dish ordered was amazing. I went with a group of 4 and we ordered most of the items on the menu. We asked about a tasting menu but its not available all the time, which was okay because everything was delicious. If they do have one later, I'm first in line to come back. \n\nTotally forgot the name of our waiter but he was great. All my friends and I love to food and we also love to capture the best photo of our food too. He was super nice and understanding. Thank you! We got the table by the windows, perfect lighting. The interior is very warm and comforting. Love the wide open kitchen.\n\nWe started with the house made bread with cultured butterorligurian olive oil. Yum! The bread was warm and soft with a crust on the outside. The butter was really good. We also got a bottle of red wine. \n\nDeviled Egg - We had two orders. Cooked perfectly. It's rich, I think ordering one myself would have been too much. \nSmoked mushroom 'POZOLE,' hominy, maitake, lime crème fraîche, popcorn - This is a soup. My friends said the popcorn and wanted to order but not knowing it was soup. They were so nice to split the soup for us in 2 settings. Great service again. \nGrilled CALAMARI - Was my favorite small/appertizer dish. Flavors on full blast. I can eat that everyday. Made with green farro, pancetta, sugar snap pea, kimchi, cilantro & mint. Wow!! Might have been my favorite dish all around too. \nKale Salad - Toasted in hazelnut, aged parmesan, pickled fennel, strawberry. - I'm the biggest fan of kale but the dressing and strawberries was a great touch. Refreshing. \nHouse Ricotta TORTELLINI. A lot of flavor. The cheese was sound but I think the top part of the tortellini was a little hard.\n\nPetit Filet - YUM! The beef was cook perfectly. Very tender and not over seasoned.\nSeared Alaskan Halibut. Cooked with artichoke, fava beans and greens. The smokey saffron broth was yummy. Great add to the halibut but this might have been my least favorite entree. \nGrilled Pork Chop might have been the WINNER of the entrees. I am not the biggest pork chip girl but the brooks cherry, caraway sauerkraut, cipollini, mustard seed mixed together, gives it the best pork chop. It was amazing.\n\nWe shared dessert. Got the Wildflower Honey CRUMB PUDDING. Goes great with the                          crème fraīche, brooks cherry, honey toffee. Not too sweet which was perfect for us. Also, we were celebrating my birthday along with another friend. Complementary mini cupcakes from Octavia.", "rating": 5, "date": "2017-05-18"}, {"excerpts": ["Not too mention\n\nFor dessert, we picked the rocky road and the wildflower honey crumb pudding. ", "The wildflower honey crumb pudding was nothing short but an afterthought. "], "author": "Mika D.", "review": "Booked a table for 5:15 pm reservations and a friend and I had dinner here on Sunday evening. Scott welcomed us to come in as soon as they opened. We sat by the corner window. For starters, I ordered a glass of sauvignon blanc. We perused through the menu and wanted to eat mostly vegetables and seafood. The room filled with customers quickly. \n\nWe ordered a quad of sweetwater oysters for starters. You could definitely taste the brininess. However, I wished there was a bit of heat and acidity to the oysters. We also shared the roasted beets and fig salad with arugula and watercress. We ordered the albacore tuna confit and that was a winner. It was so good that we both agreed to order a second one! They came in cubes marinated in a yummy asian dressing with sesame oil, soy and heat. I'd like to say that they used japanese togarashi but I could be mistaken. We also shared the crispy skin salmon entree which came with white beans and squash. The servings were just right. The baked fresh slices of bread arrived to our table piping hot and it was crusty goodness! Not too mention\n\nFor dessert, we picked the rocky road and the wildflower honey crumb pudding. The deconstructed rocky road was perfect. The wildflower honey crumb pudding was nothing short but an afterthought. I also ordered a hot green tea with creamer and sugar. \n\nThe spread of food was exceptionally delicious and memorable. Service was impeccable and outstanding. I was very impressed from the service to the farm to table concept of their food. You can definitely taste the quality and freshness. There was an ebb and flow to the restaurant and it worked so seamlessly. \n\nI would return if I'm back in the City again. Thank you to Scott and the front of house staff for the warm hospitality as this was my last dinner in San Francisco before my flight home back to SoCal.", "rating": 4, "date": "2016-09-28"}, {"excerpts": ["Wildflower Honey Crumb Pudding - I was expecting more of a bread pudding but the texture was more of a nice wheat bread, and the creme fraiche and toffee added the perfect balance of sweetness and texture. ", "Loved this dish for sharing. \n \n"], "author": "Linda X.", "review": "You meet an old friend for dinner at the corner of Octavia and Bush. Over glasses of sauvignon blanc and thoughtfully plated dishes, you catch up on the last two years that has somehow flown up. \n\nMaybe the Lychee Citrus Crush from happy hour had something to do with it, but my friend and I were a bit infatuated with the place as soon as we gazed into the restaurant. The cool and modern ambiance, the low but warm lighting, open kitchen, and rustic decor all wrapped together very nicely - kind of like the living space of my dreams.\n\nI am a huge fan of a simple menu. It tells me: here's what my chef was inspired to create today. Here are the highlights for me:\n\nLocal Halibut Crudo - delightfully refreshing pieces of halibut paired with avocado and fresh tomatoes. The toasted pistachios were unexpected but more than welcome.\n\nBodge Bay Black Cod - aside from the tender and flaky cod, I have to say the charred tomatoes really stole the show here. A must order.\n\nWildflower Honey Crumb Pudding - I was expecting more of a bread pudding but the texture was more of a nice wheat bread, and the creme fraiche and toffee added the perfect balance of sweetness and texture. Loved this dish for sharing. \n \nTopped with the endearing service, reasonable price points, curated drink selection, on and on, I was sold.\n\nIf you're looking for a modern, chic spot to catch up with girlfriends, a place to step up your date nights, or a treat to pamper your family, this is it.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["Wildflower honey crumb pudding: kind of like a spiced loaf with quince and creme fraiche"], "author": "Marilyn T.", "review": "Second time around, and most of the menu has changed.  We were seated pretty promptly with our reservation.\n\nA few things I liked from last time were still on the menu (but I was sad they no longer had the beef tongue):\n1. Deviled eggs\n2. Squid ink noodles (chilled): it's a small portion, but it's perfect for 2 people to share since it can be pretty intense \n\nAs always, I love their warm bread and salted butter.  My boyfriend actually enjoyed this more than the Animal Farm butter we had at Per se last week.\n\nOther dishes:\n1. Delicata squash: lightly breaded and fried (unexpected), but the burrata and pipian verde (almost tasted like guacamole) made the dish \n2. Little gems: if you like fuyu persimmons, it's good. I liked the sunchoke for the fall \n3. Iacopi butter bean and parmesan soup: very wonderfully cheesy. It was rich and had leaves of baby kale, and the grilled levain croutons had a great char on them. \n4. Tagliatelle: with pesto, winter geens, fennel, and meyer lemon. The lemon was a nice touch.  \n5. Petite Filet: a very generous portion for $35, but I wasn't blown away by the beef. The trumpet mushrooms and toasted barley were actually the highlights for me. \n6. Gulf snapper: perfectly cooked, but the best parts of the dish were the roasted Japanese eggplant and charred early girl tomatoes, which had so much intense flavor\n\nDesserts: \n1. Chocolate souffle tart: I got this last time, and again, I love the outer crust of the souffle and the generous portion of salted caramel ice cream \n2. Wildflower honey crumb pudding: kind of like a spiced loaf with quince and creme fraiche; our friends who got this didn't love it\n\nAt times, we felt rushed on service when they kept trying to clear our plates before we were done, and one of the servers seemed distracted and a bit annoyed when we asked for pepper, but overall, service was ok. \n\nI do appreciate that they change their menu a bit more than Frances, but I like that they keep some favorites on the menu.", "rating": 4, "date": "2015-11-10"}, {"excerpts": ["Wildflower Honey CRUMB PUDDING quince, honey toffee, crème fraîche\n", "The desserts were the best dishes of the night. "], "author": "Daniel S.", "review": "FOOD //\n1. \"DEVILED EGG,\" Fresno Chile Relish, Marash Pepper & Spice\nSolid deviled egg with great consistency. Spice and pepper was a bit heavy-handed but not so much to take away from the dish.\n\n2. Castelfranco RADICCHIO, Roasted Persimmon, Sunchoke, Pistachio, Pecorino\nThis was a great appetizer salad. The persimmon, sunchoke, and pistachio worked really well together.\n\n3. Chilled Squid Ink NOODLEs, Cortez Bottarga, Fennel, Lemon Oil\nIn an ironic twist, the dish I was looking forward to trying the most actually ended up being the most disappointing dish. Although the texture was fairly on point, it was extremely tasteless. I was excited because reviews ranted about the perfect mixture of salt, tang, and heat. It might have been an off day but those flavors were mysteriously absent.\n\n4. Grilled Brandt Farms Beef RIB-EYE, Trumpet Mushrooms and Persillade\nRibeye was well cooked but nothing too amazing. The mushrooms were the highlight of the dish and I enjoyed eating them more than the ribeye itself.\n\n5. Wildflower Honey CRUMB PUDDING quince, honey toffee, crème fraîche\nThe desserts were the best dishes of the night. This was my favorite dish by far.\n\n6. Warm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream\nSecond best dish. The salted caramel ice cream was awesome and perfectly complemented the tart.\n\nSERVICE //\nThe restaurant is intimate and the tables are far enough apart from each other to provide enough privacy for conversation. The waitstaff moved effortlessly, from filling our water quickly to bussing the empty dishes and refreshing our plates efficiently. Our waitress was helpful in describing the dishes and providing context on the right number to order.\n\nTL;DR //\nThe casual feel of the space works well for an easy dinner, but be prepared to shell out a generous portion of your wallet for smaller portions of food. If you're disappointed by dinner, focus on the dessert menu as the savior for your meal. Without any real standout items that had a wow factor, I would pencil Octavia into the \"good to try once but wouldn't go out of my way to come back again\" category.", "rating": 4, "date": "2015-10-29"}, {"excerpts": ["The wildflower honey crumb pudding came with apple slices, honey toffee, and crème fraîche, adding a tad of sour and sweetness to it."], "author": "Aldo H.", "review": "I remember having enjoyed the meal at Frances, but was not impressed by Octavia. I did not understand the hype with the deviled egg, and chilled squid ink noodles, which is #9 on Big Eat 2016. The spring greens with burrata, kale, and grilled asparagus needed something bright to balance off the green taste. Malfatti, the ricotta dumplings, were good but nothing to write home about. The petit filet, though perfectly cooked medium rare, was oversalted. Dessert sort of saved the disappointing meal. The wildflower honey crumb pudding came with apple slices, honey toffee, and crème fraîche, adding a tad of sour and sweetness to it.", "rating": 3, "date": "2016-03-13"}, {"excerpts": ["And the wildflower honey crumb pudding, perfect way to end a delicious dinner. ", "Service was very attentive and on top of every detail."], "author": "Mario T.", "review": "It was definitely a five star dinner for me!! Starting from the bread, which was amazing !!! My friends and I Shared the chilled squid ink noodles, it was a great way to start our meal, followed by the beef tongue in a bone marrow broth which just melted in our mouths, we also tried the corn soup, simple and delicious, you could really taste the sweetness of the corn,  from the entree section we had the rib eye, perfectly cooked, perfectly seasoned just the way a steak should be. And to finish we had the nectarine  float  which was definitely one of the best floats I've had! The lavender added an amazing touch! And the wildflower honey crumb pudding, perfect way to end a delicious dinner. Service was very attentive and on top of every detail.", "rating": 5, "date": "2015-07-29"}], "warm chocolate soufflé tart": [{"excerpts": ["And as if all this wasn't enough, we chose two desserts: the warm chocolate soufflé tart with salted caramel ice cream (ZOMG!!!) and some profiteroles. \n\n"], "author": "Vincent L.", "review": "I mark every 100th review of mine here on Yelp with someplace special like a Michelin-starred restaurant. For my 3800th review, one-starred Octavia is well worth the honors.\n\nI had the pleasure of dining with a fun group of folks, all of whom opted for the $70 tasting menu. This is an amazing deal given how much you're getting; the entrees alone, on an a la carte basis, are priced in the mid-$30s. It's all the more amazing given that it's not uncommon to spend twice as much on food alone at one-star Michelin establishments here in the Bay Area these days.\n\nWe started with Octavia's take on a deviled egg. Absolutely savory and delicious, and what a way to begin a meal on an already-filling note. We were also served helpings of their house-baked levain bread, complete with warm butter. Soooo fresh and sooo good. On a normal day when I'm not pigging out, this could be a meal in and of itself. Of course, we kept asking for more, please!\n\nIf this wasn't enough carbs already, we were also presented with a dish of gougeres (fancy cheese puffs for the uninitiated) to share. Cue up foodgasmic squeals of delight all around, Meg Ryan-style in \"When Harry Met Sally.\"\n\nNext came a series of dishes ranging from sashimi to salad to salmon to steak. Even if these were tasting-sized, as opposed to full entree-sized, we'd have already passed the $70 mark in value halfway through. So much substance and so much enjoyment throughout. And as if all this wasn't enough, we chose two desserts: the warm chocolate soufflé tart with salted caramel ice cream (ZOMG!!!) and some profiteroles. \n\nWe were beyond floored with the value and variety we got by choosing the tasting menu. It was truly a Michelin-worthy dining experience and I'm all WTF at some of the middling reviews here. The service managed to be professional and casual at the same time, and the entire experience was an approachable family-style affair over quality dishes. So, folks, leave your sour grapes at the door and just enjoy an evening's worth of conversation with a good group of folks. A job well done, Octavia!", "rating": 5, "date": "2018-07-26"}, {"excerpts": ["I had the warm chocolate soufflé tart. ", "TO DIE FOR! "], "author": "Alice Z.", "review": "One of the best Michelin Stars for the price that you pay! I came here for Mother's Day with my parents. The portion sizes are reasonable larger than what you receive from most Michelin star restaurants and the décor is warm and cozy. The service here is also extremely friendly and make you feel very welcomed, not at all uppity like at some other fine dining places. Highly, HIGHLY recommend coming to Octavia before it gets even more popular!\n\n[Dinner]\nI ate so much and enjoyed every bite, where do I even begin! The menu is split into small bites, smaller plates for sharing, and then larger entrees. Our server recommended about 2 large entrees, three small plates, and three small bites for our group of three. I can't remember a few of the dishes given my stomach moves faster than my brain, but here are the ones that left an impression: \n\nDeviled Egg - Highly recommend - I don't normally like deviled eggs but this one had a very unique flavor. \nChilled Squid Ink Noodles - My favorite small plate, great al dente noodles. Highly recommend!  \nAvocado Salad - I really enjoyed this dish, the vegetables and flavor combination left my mouth feeling very fresh.\nGrilled Calamari - This was ok. I didn't really like the texture of grilled calamari but wanted to give it a try. Would recommend picking a different dish. \nTortellini Dish - Can't remember the exact name of this dish, but this one was my favorite of the group! Great flavors and extremely well made pasta. \nAlaskan Halibut - The fish was extremely well cooked but I didn't find anything super special with the dish. However, great alternative to the more meat heavy entrée options. \n\n[Desert]\nI had the warm chocolate soufflé tart. TO DIE FOR! Definitely recommend ordering this amazing desert. \n\n[Wine]\nI had a great pinot noir pairing that my server recommended.\n\n[Service]\nI'm so embarrassed that I probably had too much wine that night since my parents don't really drink so I had the whole carafe to myself and the next morning when I read my receipt I realized my mental math was wayyyyy off. However, I emailed the restaurant to try to retroactively fix my tip bill because my server was super awesome, but unfortunately they never called me to let me fix the bill. If anyone from Octavia sees this please respond to my email and give me a call! \n\nGreat place to bring parents, dates, friends etc. Come support a restaurant also run by an awesome female head chef!", "rating": 5, "date": "2017-05-26"}, {"excerpts": ["For dessert, I polished off the warm chocolate soufflé tart even though I was already so full. ", "Everything was yummy but maaaan that bread and butter was to die for!! ", "They bake their own bread, and the butter tastes European (churned by Larsen Creamery in Portland, they said). ", "I would go back just for the bread alone!!"], "author": "Amy Y.", "review": "We had the halibut crudo, duck liver mousse, and chicory salad to start and shared the duck breast for the larger entree. For dessert, I polished off the warm chocolate soufflé tart even though I was already so full. Everything was yummy but maaaan that bread and butter was to die for!! They bake their own bread, and the butter tastes European (churned by Larsen Creamery in Portland, they said). I would go back just for the bread alone!!", "rating": 5, "date": "2018-03-22"}, {"excerpts": ["Warm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream ($9) - ", "Octavia customized our dessert. ", "It was delicious! ", "Loved the chocolate soufflé with salted caramel ice cream. ", "Few of my favorite sweets in one plate! "], "author": "Jennifer B.", "review": "My boyfriend and I celebrated our 2nd anniversary at Octavia.  Awesome dining experience! \n\nMorro Bay, Grassy Bar OYSTER, \"Gazpacho\" Mignonette ($3.50) - We ordered 2 oysters. This was very fresh! Ingredients was on point with the oysters. \n\nDEVILED EGG,\" Fresno Chile Relish, Marash Pepper & Spice ($5.00) Ordered just one for my boyfriend because he can take the spice. He liked it and definitely recommends it to people who appreciates spicy dishes. \n\nChilled Squid Ink NOODLES, Cortez Bottarga, Fennel, Lemon Oil ($7.00) - My second time having squid ink noodles. This was definitely an appetizer dish because it was so little. It was good and wished it was more.\n\nGrilled BEEF TONGUE \"Picadillo,\" Crispy Potato, Sultana Raisin, Spiced Jus ($8.00) - MY FAVORITE! !! I loved this dish! I'm starting to like beef tongue, thanks to Liholiho Yacht Club. This was so tender and flavorful. All of the ingredients just blends together. I will order this item again!\n\nBrandt Farms Beef RIB-EYE, Roasted Cauliflower, Pickled Chile, Gremolata ($38)- My boyfriend ordered this dish. This was just okay for him. He actually preferred my entree lol When I tried it, it was decent. I mean it wasn't overcooked so that's always good. \n\nGrilled Long & Baily PORK CHOP, Braised Escarole and Chanterelle Mushrooms ($32)- I ordered this dish. My boyfriend loved the pork chop. By this time, I was getting a bit full and they give you plenty of meat. I was surprised when our server came to our table with our entrées. I was like, \"OMG, that is a lot of meat!\" At that time, I wasn't digging it. I mean I was super full. I ate 25% of it and ordered it to go. I ate my leftover pork chop the following day and  that was the time when I appreciated the flavor. It was really good! Loved the vegetables, especially the grilled mushrooms!\n\nWarm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream ($9) - Octavia customized our dessert. It was delicious! Loved the chocolate soufflé with salted caramel ice cream. Few of my favorite sweets in one plate! I will definitely order this dessert again.\n\nOverall, I had an amazing time at Octavia. I would like to thank the entire staff for making it a great experience for my boyfriend and me.\n\nI recently had a shitty service at House of Prime Rib. I informed them that it was a surprise birthday celebration and the lady who does reservation guaranteed that they will give him a cake with a candle, sing to him, and take a souvenir photo. None of that happened. No one greeted the birthday boy, no cake with a candle, and no souvenir photo. I was sooo disappointed with my experience with them so I was soooooooOo pleased that Octavia takes care of thier customers especially with their personal requests.\n\nFood was delicious and customer service was outstanding! From the reservation, Samantha, the host, our server, and many servers that assisted us, thank you so much!\n\nI will come here again and I will definitely recommend Octavia to others!", "rating": 5, "date": "2015-10-08"}, {"excerpts": ["The desserts were incredible : Warm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream AND Pistachio "], "author": "Kelly C.", "review": "Written by my husband, Matthew:\n\nWe found Octavia on a ten best list somewhere and they did not disappoint.\n\nThe chef is really putting out some great flavor combinations in an artful manner. We had the tasting menu - not noted on the printed or online menu so it was a nice, welcome surprise. \n\nThere were some very unusual flavor combinations that worked out really well. The surprising umami flavors for me were in the spicy deviled egg, the Pickled Anchovies with chickpea poppyseed sable, and I loved the Duck Gizzard with citrus dish. There were a couple artful veggie dishes, a Black Cod, a Filet, delicious Polenta Bread, Shrimp with Plum.\n\nWe enjoyed everything and were served more food than we could eat. The desserts were incredible : Warm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream AND Pistachio PROFITEROLES summer berries, fennel pollen, meyer lemon ice cream.\n\nThis was a great experience and we recommend it to adventurous eaters.", "rating": 5, "date": "2017-06-04"}, {"excerpts": ["Warm Chocolate Soufflé tart is accompanied by cocoa nib brittle, salted caramel ice cream, which is quite obviously a good combination. ", "Tart was hot and perfect texture. ", "Ice cream was good too but not as good as Bi-Rite Salted caramel. ", "Overall, I'd go here and get several small dishes and dessert and skip the main course."], "author": "Kritika K.", "review": "TLDR\nI'd do a 3.5/5 if I could.\nDecor - Simple and pleasant - (5/5)\nService - Polite, approachable and well timed - (5/5)\nFood:\nBaked Levain - Crunchy crust, dense, fresh and flavorful - Excellent (5/5)\nChilled Squid Ink Noodles - Good texture, al dente and delightful - Excellent (5/5)\nSmoked Mushroom Pozole - Unorthodox and delicious - Good (4/5)\nPetit Fillet- Good quality meat, nothing you can't do at home - Okay (3/5)\nPeruvian Purple Polenta - Too many Peas! - Nah (1/5)\nToasted Angel Food Cake - Light cake with rich ice cream -V. Good (4.5/5)\nWarm Chocolate Souffle tart  - Rich and not overly sweet tart with delicious salted caramel ice cream  - V. Good (4.5/5)\n\nAfter reading about Frances losing it's michelin star, we decided to get dinner at Octavia to taste Melissa Perello's instead. Although does an executive chef cook at the restaurant?Nevertheless, we made it there on Thursday night. We found street parking a block away. The decor of the place is simple and contemporary, not overbearing like some other places and still very pleasant. They don't have a liquor license but their wine list is expansive. Sommelier was helpful and not snobbish (we've all dealt with that person!) and service was friendly.\nWe started with Sarah's house baked Levain, Chilled Squid Ink Noodles and Smoked Mushroom Pozole.  Sarah's house baked Levain with the cultured butter  was wonderful, we ate it all up before any other thing came. It was crunchy on the outside but the crust wasn't too big with soft, fresh and dense on the inside. Chilled Squid Ink Noodles were delicious and went well with the lemon and fennel flavor. Their take on Pozole was interesting and flavorful. However, I don't know how I feel about the popcorn in it. For the main course we got the Petit Fillet and Peruvian Purple Polenta. We got Petit fillet as medium rare, the meat was good quality and went well with accompaniments. It was nothing special that you could not do at your grill. Peruvian Purple Polenta was my least favorite. It is hard to make polenta bad in my opinion but the high ratio of peas to polenta in it didn't work for me. For dessert, we got the Toasted Angel Food Cake and Souffle tart. The Toasted Angel Food Cake is served with blueberry, mascarpone, lavender ice cream and goes complimented it very well. Cake was light, juicy and not too sweet, the ice cream was delicious too. Warm Chocolate Soufflé tart is accompanied by cocoa nib brittle, salted caramel ice cream, which is quite obviously a good combination. Tart was hot and perfect texture. Ice cream was good too but not as good as Bi-Rite Salted caramel. Overall, I'd go here and get several small dishes and dessert and skip the main course.", "rating": 4, "date": "2017-05-13"}, {"excerpts": ["Warm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream\nSecond best dish. "], "author": "Daniel S.", "review": "FOOD //\n1. \"DEVILED EGG,\" Fresno Chile Relish, Marash Pepper & Spice\nSolid deviled egg with great consistency. Spice and pepper was a bit heavy-handed but not so much to take away from the dish.\n\n2. Castelfranco RADICCHIO, Roasted Persimmon, Sunchoke, Pistachio, Pecorino\nThis was a great appetizer salad. The persimmon, sunchoke, and pistachio worked really well together.\n\n3. Chilled Squid Ink NOODLEs, Cortez Bottarga, Fennel, Lemon Oil\nIn an ironic twist, the dish I was looking forward to trying the most actually ended up being the most disappointing dish. Although the texture was fairly on point, it was extremely tasteless. I was excited because reviews ranted about the perfect mixture of salt, tang, and heat. It might have been an off day but those flavors were mysteriously absent.\n\n4. Grilled Brandt Farms Beef RIB-EYE, Trumpet Mushrooms and Persillade\nRibeye was well cooked but nothing too amazing. The mushrooms were the highlight of the dish and I enjoyed eating them more than the ribeye itself.\n\n5. Wildflower Honey CRUMB PUDDING quince, honey toffee, crème fraîche\nThe desserts were the best dishes of the night. This was my favorite dish by far.\n\n6. Warm Chocolate Soufflé TART cocoa nib brittle, salted caramel ice cream\nSecond best dish. The salted caramel ice cream was awesome and perfectly complemented the tart.\n\nSERVICE //\nThe restaurant is intimate and the tables are far enough apart from each other to provide enough privacy for conversation. The waitstaff moved effortlessly, from filling our water quickly to bussing the empty dishes and refreshing our plates efficiently. Our waitress was helpful in describing the dishes and providing context on the right number to order.\n\nTL;DR //\nThe casual feel of the space works well for an easy dinner, but be prepared to shell out a generous portion of your wallet for smaller portions of food. If you're disappointed by dinner, focus on the dessert menu as the savior for your meal. Without any real standout items that had a wow factor, I would pencil Octavia into the \"good to try once but wouldn't go out of my way to come back again\" category.", "rating": 4, "date": "2015-10-29"}, {"excerpts": ["Roasted CAULIFLOWER Salad, Gremolata, Medjool Date, Toasted Almond\n\"DEVILED EGG,\" Fresno Chile Relish, Marash Pepper & Spice\nWarm Chocolate Soufflé TART - tasty, but a little overdone "], "author": "K. D.", "review": "I wish I could give this more than 3 stars...but honestly, our dinner last night was pretty lackluster. \n\nMy favorite (and the only dish I would order again):\nLITTLE GEMS, Fuyu Persimmon, Sunchoke, Toasted Walnut Soubise, Pecorino\n\nJust okay...\nRoasted CAULIFLOWER Salad, Gremolata, Medjool Date, Toasted Almond\n\"DEVILED EGG,\" Fresno Chile Relish, Marash Pepper & Spice\nWarm Chocolate Soufflé TART - tasty, but a little overdone I thought\n\nDid not like:\nYellowfin TUNA Conserva, Rapini Pesto, Potatoes & Crispy Shallots\nSonoma DUCK BREAST, Roasted Turnips, Pickled Raisin, Kale & Toasted Farro\n\nThe service wasn't anything special either. BUT - the space was beautiful, and I'm really hoping it was just an off-menu for us. I would just much rather go to Frances at this point.", "rating": 3, "date": "2015-10-31"}, {"excerpts": ["- For dessert, we ordered their \"specialty,\"  the warm Chocolate Soufflé TART.  ", "I'm sure it's good when it isn't burnt-- ", "it was so dry and hard ", "it was difficult to cut with a fork.  ", "We told our server and he removed it from our bill.  ", "He seemed surprised. \n", "- After we paid, we were not given our to-go bag with duck and had to seek out someone near the kitchen to find it for us.  "], "author": "Andrew E.", "review": "For a Michelin-rated restaurant at this price point, Octavia was very disappointing.  Here's a quick summary:\n\n- The roasted cauliflower salad was delicious and things were off to a great start\n- The turnip greens salad was interesting.  It's not something we would order again but I could see it being an acquired taste.\n- The gulf snapper was very good; however, as a $30+ entree I was expecting something more memorable.  The filet was relatively small, and it's not a dish I would go back for, especially not at this price. \n- The duck breast is where things took a turn for the worst.  Our server told us the chef recommended medium rare.  The meat was so chewy, it was almost inedible.  My guest barely touched it, and I swallowed a piece after chewing for 2 minutes.  We asked for a to-go bag (more on this below).  Our waiter should have asked if everything was ok, but he didn't.\n- For dessert, we ordered their \"specialty,\"  the warm Chocolate Soufflé TART.  I'm sure it's good when it isn't burnt-- it was so dry and hard it was difficult to cut with a fork.  We told our server and he removed it from our bill.  He seemed surprised. \n- After we paid, we were not given our to-go bag with duck and had to seek out someone near the kitchen to find it for us.  The next night, I cooked the duck on a cast-iron skillet and it was much better and actually chewable.\n\nOverall, a very disappointing experience.  A restaurant like this needs to be amazing every night.  They shouldn't make mistakes like serving a burnt dessert.  And whoever is recommending the duck at medium rare must have really sharp teeth.", "rating": 2, "date": "2015-12-23"}], "rocky road eton mess": [{"excerpts": ["The Rocky road Eton Mess was a mess of yummy with great texture.\n\n"], "author": "Heather D.", "review": "Octavia had some very nice highs a couple little lows.  Our group did not arrive at the same time, but they were nice enough to seat the first two in our party.  Unfortunately,  after we were able to join we were given menus and water but no one came back to take our drink orders, and I really needed a drink after fighting BART delays and all the Gay Pride folks in tutus (they were super cute just not in a hurry).  We finally had to flag someone down to get a glass of wine (but this was the only time we experienced a lack of service). \n\nThe server will ask casually if you would like bread, do not skip the bread, it is some of the best bread I have ever tasted, and it would be tragedy to miss this warm morsel with its side of salted butter.  \n\nAll of the apps were tasty, although I thought $3 for each oyster was little on the high side.  The hard boiled egg was nice with it's spicy sauce, the calamari was beautiful and complex, the squid ink noodles were okay although I may have preferred them more saucy since I found them a little dry all on their own.\n\nFrom the apps we went right to the mains.  I am not normally a red meat gal, but the petit fillet with its roasted cabbage and faro lured me in.  It was a beautiful plate, the steak was butter tender, and every bite was succulent and roasty. The duck, although cooked to a nice temperature, suffered from not fully rendering the fat, which is always a drag.\n\nSimilar to my comment about the bread do not skip dessert, it is a can't miss course even if you don't normally order sweets.  The Honey crumb pudding with honey toffee was perfect and not too sweet.  The Rocky road Eton Mess was a mess of yummy with great texture.\n\nWe steered away from the very specific cocktails and it is pretty easy to select a wine to pair, but the wine menu did not blow me away, which is no big deal.", "rating": 3, "date": "2016-06-26"}, {"excerpts": ["That didn't stop us from getting dessert though, thank god, because the rocky road eton mess was so alarmingly delicious I seriously regretted choosing to share it. ", "There wasn't a single misstep throughout the meal, except for maybe when a waiter asked if I would like more bread, and having not finished my first piece I declined, and then she cleared our bread plates and swept away with my last piece of bread, and I shed a small tear, but lbr I probably didn't need it anyway. ", "Oh, and the price of everything, even with a bottle of wine was totally reasonable. ", "I'm gonna try to go back asap. ", "A+!"], "author": "Claire T.", "review": "Having had a mediocre dining experience at a much lauded restaurant the night before, I was hoping Octavia would live up to its hype, and holy crap, did it. Every course was such an enjoyable experience and the natural style Pinot noir we tried was a perfect complement (not too smack-you-in-the-face barnyardy). The squid ink noodles with bottarga was unbelievably delicious and savory. Just a heads up, the appetizers are on the smaller side, but that just means you can try more things. We had the deviled egg (one each), the squid noodles, the greens, and the malfatti ricotta dumplings (malfatti means misshapen, not \"badly made\" as I had translated it, these dumplings are the OPPOSITE of badly made. They are extremely well made. I don't speak Italian SHUSH.) and that was plenty for two people. That didn't stop us from getting dessert though, thank god, because the rocky road eton mess was so alarmingly delicious I seriously regretted choosing to share it. There wasn't a single misstep throughout the meal, except for maybe when a waiter asked if I would like more bread, and having not finished my first piece I declined, and then she cleared our bread plates and swept away with my last piece of bread, and I shed a small tear, but lbr I probably didn't need it anyway. Oh, and the price of everything, even with a bottle of wine was totally reasonable. I'm gonna try to go back asap. A+!", "rating": 5, "date": "2016-03-26"}], "pistachio profiteroles": [{"excerpts": ["But we had the toasted Angel food cake and pistachio profiteroles.  ", "A slight nod to the toasted Angel food cake with rose geranium-out of this world!\n\n"], "author": "Maria F.", "review": "This is my new favorite restaurant.  \n\nI love the space itself.  Warm, inviting, very Northern CA.\n\nWe had:\ngrilled CALAMARI - delicious\nMIZUNA salad - fantastic flavors\nI had the wild salmon, which I loved and my friend had the spring lamb (which I got to sample).   Really delicious combination of flavors and perfectly cooked.\n\nThe bread was out of this world - there was some kind of anise or fennel in it.  We had to pry ourselves away from it.  All of the desserts sounded amazing--I want to go back and try more.  But we had the toasted Angel food cake and pistachio profiteroles.  A slight nod to the toasted Angel food cake with rose geranium-out of this world!\n\nService was impeccable.  Everyone is warm and welcoming.  Highly recommend.  I can't wait to go back!", "rating": 5, "date": "2017-06-17"}], "strawberries  cream float": []}