{"soda bottle": [], "tofu with shanghai green soup": [{"excerpts": ["We ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\n", "The tofu with shanghai green soup was filled with MSG. ", "The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless", "; I took a bowl too, and it was extremely salty. ", "This dish overall didn't have flavor - ", "it was just salty and bland. ", "The vegetable dishes we ordered also lacked flavor and were not very good. ", "In addition, portions were very small here. "], "author": "Christine L.", "review": "I wanted to bring my family (who live in East Bay) to a yummy Chinese restaurant in San Francisco. Old Shanghai seemed like a good choice from the Yelp reviews, but after the meal, my parents were disappointed by the quality and portion of food and the service. \n\nWe ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\nI think out of everything, the only decent dishes were the xiao long bao and the whole fish...The tofu with shanghai green soup was filled with MSG. The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless; I took a bowl too, and it was extremely salty. This dish overall didn't have flavor - it was just salty and bland. The vegetable dishes we ordered also lacked flavor and were not very good. In addition, portions were very small here. We ordered 6 dishes for 4 people and were barely full (and we definitely as a family don't eat a lot.) \n\nThe final strike was when my parents asked if there was dessert. Usually Chinese restaurants serve complimentary dessert (like red bean soup or fruit.) This restaurant didn't. Only after my parents persisted about the dessert, that the waiter brought out some red bean filled pastries.\n\nI'm not sure if my family didn't like this restaurant because we are from Guangdong region and this is Shanghai food. But we've been to northern China and Shanghai frequently over the years and had no complaints about the food there...", "rating": 3, "date": "2017-04-13"}], "winter melon with ham and bamboo shoots soup": [], "seafood hot and sour soup": [], "xihu minced beef soup": [], "smoked ham salted pork": [], "noodle with stirfried minced pork": [], "noodle with spicy mandarin sauce": [], "noodle with fried green onion": [], "tan tan noodle soup with meat": [], "noodle with shredded pork and preserved vegetable": [], "noodle with smoked fish": [], "noodle with braised beef stew": [], "noodle soup with stirfried eel": [], "noodle soup with curry beef stew": [], "shanghai chow mein with pork spinach and cabbage": [], "shanghai chicken chow mein": [], "beef chow mein": [], "chow mein with vegetables": [], "special chow mein with shrimp beef and chicken": [], "shanghai stirfried rice cake with pork spinach and cabbage": [], "shanghai stirfried rice cake with pork and preserved vegetable": [], "shanghai stirfried rice cake with bamboo shoot and vegetable": [], "seafood crispy noodle": [], "pieces shanghai steamed dumplings": [], "pieces pot stickers with pork": [], "pieces pot stickers with vegetable": [], "pieces pan fried pork buns": [], "pieces shanghai wonton soup": [], "pieces shanghai pan fried wonton": [], "pieces spicy wonton": [], "pieces shanghai egg roll": [], "pieces green onion pan cake": [], "pieces pan fried chives turnover": [], "pieces taro pastry": [], "pieces red bean pastry": [], "piece red bean puff": [], "pieces sesame pastry": [], "pieces pumpkin pastry": [], "pieces black sesame bun": [], "pieces steamed bun": [], "pieces fried bun": [], "pieces steamed threaded bun": [], "pieces fried threaded bun": [], "pieces sweet rice shao bun": [], "boiled sweet rice ball in wine and cassia blossom soup": [{"excerpts": ["Boiled Sweet Rice Ball in Wine and Cassia Blossom Soup:  ", "\"", "I liked this one very much. ", "The soup has right amount of sweetness and I can also taste the rice wine as well as the dry cassia blossom. ", "The wine flavor is subtle , not overpowering. ", "The filling is sweetened black sesame, which was very tasty."], "author": "Dean C.", "review": "12/17/17\n\nSo, get this...\n\nWe were here to take out my gf's cousin and his mom for dinner.  He's from China, finished undergrad here, and just landed a job at Facebook (and he bragged that the sign-on bonus alone was enough for him to live on for years.)  His mom came here from China for a vacation, to celebrate with him, and so since she's only here for a short while we figured we'd take them out...\n\nAt one point we were talking about my gf's amazing cooking (she's in chef school) so I whipped out my phone to show them pics of her yummy stuff...\n\nHe looks at me working my phone and asks, \"What's that!?!?\"\n\n\"Facebook.\"\n\n....\n............. Yeah.\n\nSo I stared at him, then looked down at his shirt, black with the Facebook logo.  .......and gulped my food down...\n\n..\n\n....alright, so this was like 4 months ago and I didn't take notes.  I don't remember the food much except it was mostly average, but the owner and other server were VERY nice to us.  They were very gracious and humble, and quite social, making many suggestions to us as we contemplated our choices.  As the night wore on they continued to impress us with their service, being extremely attentive and friendly.  This was VERY remarkable given the vast majority of the best Chinese restaurants have terrible service.  In fact, having good service almost is a bad sign for getting authentic Chinese!--well, I guess good for us the food was good enough.\n\nMy gf luckily has a semi-photographic memory for food, so I'm just going to print her notes here:\n\n1. Drunken Chicken $9.00:  \"I think this tasted standard, do not remember anything special about this one.\"\n\n2. Shreaded Bean Curd with Fried Green Onion $7.00:  \"Did not get the eat this, because it was far from me. It looked fresh though.\"\n\n3. Shanghai Steamed Dumpling with Pork $9.75:  \"The flavor of filling and soup was pretty good, but the skin was not good, soggy and leaking.\"\n\n4. Pressed Duck (Half):  \"Before we ordered my bf confirmed with owner that the duck is fried. It looked like fried, but it was definitely not freshly fried. It was little cold and hard. But I think the duck is dry brined or something like that, so it had the special salty taste. I liked the flavor, but texture was not good.\"\n\n5. Braised Meatball with Vegetable in Clay Pot $10.95:  \"This is a very traditional dish in Shanghai. The meatball is supposed to be huge and super juicy/ tender. It's also called lion king ball in Chinese. This was ok, tasted like a dish my mom could cook at home. The meatball tasted average, do not have that super tender texture it's supposed to have.\"\n\n6. Smoked Ham, Salted Pork with Bamboo Shoots and Soy Bean Sheet Knots:  \"This is another very traditional soup dish from Shanghai. The key to this dish is that the bamboo needs to be super fresh and broth needs to be rich and little salty. I think this one tasted standard, nothing special.\"\n\n7. Stir Fry Special (not on menu, written in Chinese on the wall):  \"This stir fry has the special vegetable JiaoBai (do not know the English name). It's like a root vegetable and I think it's only available in spring. The slice it and cook with thinly sliced pork with soy sauce. This one tasted good, especially if you eat with bowl of white rice. The pork was tender and vegetables tasted fresh with right amount of sauce.\"\n\n8. Boiled Sweet Rice Ball in Wine and Cassia Blossom Soup:  \"I liked this one very much. The soup has right amount of sweetness and I can also taste the rice wine as well as the dry cassia blossom. The wine flavor is subtle , not overpowering. The filling is sweetened black sesame, which was very tasty.\"\n\nSo, really, the food was just a 3/5, but since the prices were pretty good, and the service was so extraordinary for an authentic Chinese restaurant, I'd give them...\n\n4/5\n\n\n#chinese #sanfrancisco #star", "rating": 4, "date": "2018-04-10"}], "pieces boiled sesame ball": [], "pieces dumplings with pork and chives": [], "pieces dumplings with shrimp pork and chives": [], "pieces vegetable steamed dumplings": [], " drunken chicken in clay pot": [], "spicy chicken feet": [], "deep fried baby kingfish": [], "shredded bean curd with fried green onion": [], "shanghai style layered bean curd sheets": [], "shanghai style bean curd puff": [], "fried green onion sesame oil jellyfish": [], "beef tendon": [], "spicy shredded beef stomach": [], "shredded bean curd": [{"excerpts": ["We ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\n", "The tofu with shanghai green soup was filled with MSG. ", "The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless", "; I took a bowl too, and it was extremely salty. ", "This dish overall didn't have flavor - ", "it was just salty and bland. ", "The vegetable dishes we ordered also lacked flavor and were not very good. ", "In addition, portions were very small here. "], "author": "Christine L.", "review": "I wanted to bring my family (who live in East Bay) to a yummy Chinese restaurant in San Francisco. Old Shanghai seemed like a good choice from the Yelp reviews, but after the meal, my parents were disappointed by the quality and portion of food and the service. \n\nWe ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\nI think out of everything, the only decent dishes were the xiao long bao and the whole fish...The tofu with shanghai green soup was filled with MSG. The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless; I took a bowl too, and it was extremely salty. This dish overall didn't have flavor - it was just salty and bland. The vegetable dishes we ordered also lacked flavor and were not very good. In addition, portions were very small here. We ordered 6 dishes for 4 people and were barely full (and we definitely as a family don't eat a lot.) \n\nThe final strike was when my parents asked if there was dessert. Usually Chinese restaurants serve complimentary dessert (like red bean soup or fruit.) This restaurant didn't. Only after my parents persisted about the dessert, that the waiter brought out some red bean filled pastries.\n\nI'm not sure if my family didn't like this restaurant because we are from Guangdong region and this is Shanghai food. But we've been to northern China and Shanghai frequently over the years and had no complaints about the food there...", "rating": 3, "date": "2017-04-13"}], "shanghai five spice smoked fish": [], "salted duck": [], "braised pork shank": [{"excerpts": ["Braised Pork Shank was impressive looking if you look at the photo a previous Yelper posted. ", "The waiter help get a spoon to break apart the meat off the bone so it would be easier for us to eat. "], "author": "Priscilla L.", "review": "Restaurant was very accommodating on Saturday for late lunch at 2pm. my group of 18 people arrived when they were closing the kitchen for lunch at 2:30pm. We decided to come here last minute after we went on a hike that went a little longer than planned. I cannot remember what 8 dishes we ordered for my table, but the ones I recalled are:\n\nShredded Turnip Pastry was quite excellent and stood out to all of us. It was crispy, hot, good texture with meat, turnip and was quite tasty. I would order this again.\n\nXiaolongbao or  Shanghai Steamed Dumplings w/ Pork was okay to me. It didn't have enough liquid with the dumpling that I would have liked, but that is my personal preference. I wanted more flavor from it and skin was a little thicker than I am used to as well. Served hot, got to wait till it cooled down first. It is always a first love when I lay my eyes on a lovely Shanghai dumpling. Such a pretty presentation all self contained and wrapped in a ball of goodness...sorry getting off topic.\n\nBraised Pork Shank was impressive looking if you look at the photo a previous Yelper posted. The waiter help get a spoon to break apart the meat off the bone so it would be easier for us to eat. It was good and well cooked with a nice dark brown soy sauce over it. \n\nThe Mongolian beef, I believe this dish was spicy, but meat was tender. So if you want some heat to your food, you will enjoy this dish. I had to grab water!\n\nDried Mushrooms with shanghai green vegetables was what I order and I enjoyed it, cooked to perfection and great combo ingredients. Yummy in my tummy! \n\nI don't recall the exact name, but we also had a boneless chicken with ginger oil. It was a small dish where everyone got a bite. It was ok and dish didn't really stand out with flavor. Just normal.\n\nWe had a spare rib dish, which I was not used to seeing in this presentation called Wu Xi Sparerib with red fermented soy bean sauce. I was not used to seeing the ribs in red sauce. But it is soy bean sauce on it which had good flavor. Interesting dish. \n\nI think I pretty much covered most of the dishes our table had that I could recall. The other half of my group ordered a cool looking deep fried fish dish. Presentation was really cool as you can see from the other Yelper's photos. \n\nThank you for reading if you got this far. Feel free to click it if you feel this was useful, cool or funny for you. I realize now that Taking photos will save me so much time from writing!", "rating": 4, "date": "2015-02-15"}, {"excerpts": ["last, The Braised pork Shank. ", "How is that possible ", "the Braised pork Shank brought to my table before the cold dish(drunken chicken)? ", "I can't use any word to describe how awful that Shank taste. ", "Is frozen inside again. ", "A Shanghai restaurant name them ", "self Old Shanghai can't even make that 3 signature Shanghai food right there is a problem. ", "Maybe I went there in a wrong time."], "author": "Yan C.", "review": "The worst Shanghai food I ever had. Their Shanghai steamed dumpling(xiao long Bao) the skin is too thick, the meat is dry, no juice at all. The Drunken Chicken is the worst of the worst ,no chicken favor, the wine is bitter, and the chicken meat is dry and frozen inside. last, The Braised pork Shank. How is that possible the Braised pork Shank brought to my table before the cold dish(drunken chicken)? I can't use any word to describe how awful that Shank taste. Is frozen inside again. A Shanghai restaurant name them self Old Shanghai can't even make that 3 signature Shanghai food right there is a problem. Maybe I went there in a wrong time.", "rating": 1, "date": "2016-02-08"}, {"excerpts": ["Winter melon soup: tasty\n\nBraised pork shank: super tender and delicious. "], "author": "Melinda C.", "review": "Enjoyed dinner here tonight. Fast and friendly service. \n\nXlb: Delicious. Skin could've been a bit thinner but still good. Good flavor and just enough juiciness. \n\nSpicy wonton: Good wonton but this wasn't spicy. Not enough chili oil and served with peanut sauce, which isn't what I am used to with this dish. \n\nWinter melon soup: tasty\n\nBraised pork shank: super tender and delicious. Yum. \n\nWe will be back!", "rating": 4, "date": "2015-03-14"}], "braised meatballs": [], "dried shrimp eggs and sea cucumber": [], "braised meatballs with vegetables in clay pot": [], "shredded pork in garlic and ginger sauce": [], "shredded pork with napa cabbage": [], "spicy deep fried tofu": [], "szechuan style tofu with minced pork": [], "scallion beef": [], "shanghai style beef": [], "beef with green onion": [], "beef with dried mushrooms": [], "beef with chinese greens": [], "beef with black bean sauce": [], "stirfried shrimp": [], "fish filet in wine sauce": [], "crab meat with chinese squash": [], "crab meat with tofu": [], "gongbao shrimp": [], "tofu shrimp": [], "sauteed eel": [], "sauteed eel with yellow chives": [], "sea cucumber with green onion": [], "boneless chicken with cashew nuts": [], "boneless chicken with mushrooms": [], "boneless chicken with mushrooms and chinese greens": [], "boneless chicken with black bean sauce": [], "gongbao chicken": [], "princess chicken with spicy sauce": [], "boneless chicken with plum sauce": [], "pressed duck": [{"excerpts": ["Pressed Duck (Half):  ", "\"", "Before we ordered my bf confirmed with owner that the duck is fried. ", "It looked like fried, but it was definitely not freshly fried. ", "It was little cold and hard. ", "But I think the duck is dry brined or something like that, so it had the special salty taste. ", "I liked the flavor, but texture was not good."], "author": "Dean C.", "review": "12/17/17\n\nSo, get this...\n\nWe were here to take out my gf's cousin and his mom for dinner.  He's from China, finished undergrad here, and just landed a job at Facebook (and he bragged that the sign-on bonus alone was enough for him to live on for years.)  His mom came here from China for a vacation, to celebrate with him, and so since she's only here for a short while we figured we'd take them out...\n\nAt one point we were talking about my gf's amazing cooking (she's in chef school) so I whipped out my phone to show them pics of her yummy stuff...\n\nHe looks at me working my phone and asks, \"What's that!?!?\"\n\n\"Facebook.\"\n\n....\n............. Yeah.\n\nSo I stared at him, then looked down at his shirt, black with the Facebook logo.  .......and gulped my food down...\n\n..\n\n....alright, so this was like 4 months ago and I didn't take notes.  I don't remember the food much except it was mostly average, but the owner and other server were VERY nice to us.  They were very gracious and humble, and quite social, making many suggestions to us as we contemplated our choices.  As the night wore on they continued to impress us with their service, being extremely attentive and friendly.  This was VERY remarkable given the vast majority of the best Chinese restaurants have terrible service.  In fact, having good service almost is a bad sign for getting authentic Chinese!--well, I guess good for us the food was good enough.\n\nMy gf luckily has a semi-photographic memory for food, so I'm just going to print her notes here:\n\n1. Drunken Chicken $9.00:  \"I think this tasted standard, do not remember anything special about this one.\"\n\n2. Shreaded Bean Curd with Fried Green Onion $7.00:  \"Did not get the eat this, because it was far from me. It looked fresh though.\"\n\n3. Shanghai Steamed Dumpling with Pork $9.75:  \"The flavor of filling and soup was pretty good, but the skin was not good, soggy and leaking.\"\n\n4. Pressed Duck (Half):  \"Before we ordered my bf confirmed with owner that the duck is fried. It looked like fried, but it was definitely not freshly fried. It was little cold and hard. But I think the duck is dry brined or something like that, so it had the special salty taste. I liked the flavor, but texture was not good.\"\n\n5. Braised Meatball with Vegetable in Clay Pot $10.95:  \"This is a very traditional dish in Shanghai. The meatball is supposed to be huge and super juicy/ tender. It's also called lion king ball in Chinese. This was ok, tasted like a dish my mom could cook at home. The meatball tasted average, do not have that super tender texture it's supposed to have.\"\n\n6. Smoked Ham, Salted Pork with Bamboo Shoots and Soy Bean Sheet Knots:  \"This is another very traditional soup dish from Shanghai. The key to this dish is that the bamboo needs to be super fresh and broth needs to be rich and little salty. I think this one tasted standard, nothing special.\"\n\n7. Stir Fry Special (not on menu, written in Chinese on the wall):  \"This stir fry has the special vegetable JiaoBai (do not know the English name). It's like a root vegetable and I think it's only available in spring. The slice it and cook with thinly sliced pork with soy sauce. This one tasted good, especially if you eat with bowl of white rice. The pork was tender and vegetables tasted fresh with right amount of sauce.\"\n\n8. Boiled Sweet Rice Ball in Wine and Cassia Blossom Soup:  \"I liked this one very much. The soup has right amount of sweetness and I can also taste the rice wine as well as the dry cassia blossom. The wine flavor is subtle , not overpowering. The filling is sweetened black sesame, which was very tasty.\"\n\nSo, really, the food was just a 3/5, but since the prices were pretty good, and the service was so extraordinary for an authentic Chinese restaurant, I'd give them...\n\n4/5\n\n\n#chinese #sanfrancisco #star", "rating": 4, "date": "2018-04-10"}, {"excerpts": ["i love the spicy eggplant, pressed duck, xiao long baos, and tofu with Edamame. "], "author": "Lauren L.", "review": "first, i loved our waiter because he was super friendly, nice, and....wearing pajama bottoms. awesome.  \n\nnext, if you're trying to find a good chinese restaurant, Old Shanghai is one of my \"go to\" places in San Francisco. it's authentic, flavorful and delicious -- but the portions are small. that's the only setback! i love the spicy eggplant, pressed duck, xiao long baos, and tofu with Edamame. the winter melon soup was mediocre, so i'd skip that next time. \n\nfinally, i still think LA has better chinese food than SF, but this place isn't bad. i think it's one of the better places in SF that you'll find for chinese food. it's semi-expensive for the portion sizes, so just keep that in mind!", "rating": 4, "date": "2013-01-01"}], "sauteed preserved vegetable": [], "dried mushrooms vegetables and flour puff in clay pot": [], "chinese squash with flour puff": [], "house tofu in clay pot": [], "sauteed preserved vegetable with fava chives": [], "sauteed snow pea sprouts": [], "shredded bean curd with yellow chives": [{"excerpts": ["We ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\n", "The tofu with shanghai green soup was filled with MSG. ", "The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless", "; I took a bowl too, and it was extremely salty. ", "This dish overall didn't have flavor - ", "it was just salty and bland. ", "The vegetable dishes we ordered also lacked flavor and were not very good. ", "In addition, portions were very small here. "], "author": "Christine L.", "review": "I wanted to bring my family (who live in East Bay) to a yummy Chinese restaurant in San Francisco. Old Shanghai seemed like a good choice from the Yelp reviews, but after the meal, my parents were disappointed by the quality and portion of food and the service. \n\nWe ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\nI think out of everything, the only decent dishes were the xiao long bao and the whole fish...The tofu with shanghai green soup was filled with MSG. The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless; I took a bowl too, and it was extremely salty. This dish overall didn't have flavor - it was just salty and bland. The vegetable dishes we ordered also lacked flavor and were not very good. In addition, portions were very small here. We ordered 6 dishes for 4 people and were barely full (and we definitely as a family don't eat a lot.) \n\nThe final strike was when my parents asked if there was dessert. Usually Chinese restaurants serve complimentary dessert (like red bean soup or fruit.) This restaurant didn't. Only after my parents persisted about the dessert, that the waiter brought out some red bean filled pastries.\n\nI'm not sure if my family didn't like this restaurant because we are from Guangdong region and this is Shanghai food. But we've been to northern China and Shanghai frequently over the years and had no complaints about the food there...", "rating": 3, "date": "2017-04-13"}], "dried mushrooms with shanghai green vegetables": [{"excerpts": ["Dried Mushrooms with shanghai green vegetables was what I order and I enjoyed it, cooked to perfection and great combo ingredients. "], "author": "Priscilla L.", "review": "Restaurant was very accommodating on Saturday for late lunch at 2pm. my group of 18 people arrived when they were closing the kitchen for lunch at 2:30pm. We decided to come here last minute after we went on a hike that went a little longer than planned. I cannot remember what 8 dishes we ordered for my table, but the ones I recalled are:\n\nShredded Turnip Pastry was quite excellent and stood out to all of us. It was crispy, hot, good texture with meat, turnip and was quite tasty. I would order this again.\n\nXiaolongbao or  Shanghai Steamed Dumplings w/ Pork was okay to me. It didn't have enough liquid with the dumpling that I would have liked, but that is my personal preference. I wanted more flavor from it and skin was a little thicker than I am used to as well. Served hot, got to wait till it cooled down first. It is always a first love when I lay my eyes on a lovely Shanghai dumpling. Such a pretty presentation all self contained and wrapped in a ball of goodness...sorry getting off topic.\n\nBraised Pork Shank was impressive looking if you look at the photo a previous Yelper posted. The waiter help get a spoon to break apart the meat off the bone so it would be easier for us to eat. It was good and well cooked with a nice dark brown soy sauce over it. \n\nThe Mongolian beef, I believe this dish was spicy, but meat was tender. So if you want some heat to your food, you will enjoy this dish. I had to grab water!\n\nDried Mushrooms with shanghai green vegetables was what I order and I enjoyed it, cooked to perfection and great combo ingredients. Yummy in my tummy! \n\nI don't recall the exact name, but we also had a boneless chicken with ginger oil. It was a small dish where everyone got a bite. It was ok and dish didn't really stand out with flavor. Just normal.\n\nWe had a spare rib dish, which I was not used to seeing in this presentation called Wu Xi Sparerib with red fermented soy bean sauce. I was not used to seeing the ribs in red sauce. But it is soy bean sauce on it which had good flavor. Interesting dish. \n\nI think I pretty much covered most of the dishes our table had that I could recall. The other half of my group ordered a cool looking deep fried fish dish. Presentation was really cool as you can see from the other Yelper's photos. \n\nThank you for reading if you got this far. Feel free to click it if you feel this was useful, cool or funny for you. I realize now that Taking photos will save me so much time from writing!", "rating": 4, "date": "2015-02-15"}], "shredded bean curd with ham and dried mushrooms": [], "preserved vegetable with soy beans and bean curd sheets": [], "egg plants with ginger and garlic sauce": [], "yang zhou fried rice": [{"excerpts": ["the Yang Zhou fried rice, which was pretty good. ", "The xiao long baos, I wish were more soupy. ", "I've had better in SoCal. ", "The dumplings were plump and delicious. ", "I really didn't like the green onion pancake. ", "It was a little thicker, so it was more breadlike. ", "I prefer ones that are more crispy. ", "The green onion pancake was about a 3, and the rest of  food was about a 4, so 3.5 stars."], "author": "Arnold W.", "review": "Pretty good standard Chinese food. I had the Yang Zhou fried rice, which was pretty good. The xiao long baos, I wish were more soupy. I've had better in SoCal. The dumplings were plump and delicious. I really didn't like the green onion pancake. It was a little thicker, so it was more breadlike. I prefer ones that are more crispy. The green onion pancake was about a 3, and the rest of  food was about a 4, so 3.5 stars.", "rating": 4, "date": "2013-01-16"}, {"excerpts": ["We got the Yang Zhou fried rice, xiao long baos, chow mein, and noodle soup. ", "The prices for the dishes range from $10-12 each plate. ", "The dumplings were $7.50 for 8 of them. ", "The fried rice was a little bland but not bad. ", "The Xiao Long Baos were nice and hot. ", "The chow mein was a little bit dry, but maybe that's just how it is. ", "The food came out pretty quickly and there were only two people running the whole restaurant. ", "I would say the reason it is only 3 1/2 is that the food is pricey. ", "There are some alternative restaurants with the same food but much cheaper nearby. ", "It was also pretty chilly in there."], "author": "Jordan W.", "review": "I would give this restaurant a 3 1/2 star. I came here with my mom and grandparents for lunch. We got the Yang Zhou fried rice, xiao long baos, chow mein, and noodle soup. The prices for the dishes range from $10-12 each plate. The dumplings were $7.50 for 8 of them. The fried rice was a little bland but not bad. The Xiao Long Baos were nice and hot. The chow mein was a little bit dry, but maybe that's just how it is. The food came out pretty quickly and there were only two people running the whole restaurant. I would say the reason it is only 3 1/2 is that the food is pricey. There are some alternative restaurants with the same food but much cheaper nearby. It was also pretty chilly in there.", "rating": 3, "date": "2013-01-01"}], "rice with salted pork and vegetables in clay pot": [{"excerpts": ["We ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\n", "The tofu with shanghai green soup was filled with MSG. ", "The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless", "; I took a bowl too, and it was extremely salty. ", "This dish overall didn't have flavor - ", "it was just salty and bland. ", "The vegetable dishes we ordered also lacked flavor and were not very good. ", "In addition, portions were very small here. "], "author": "Christine L.", "review": "I wanted to bring my family (who live in East Bay) to a yummy Chinese restaurant in San Francisco. Old Shanghai seemed like a good choice from the Yelp reviews, but after the meal, my parents were disappointed by the quality and portion of food and the service. \n\nWe ordered:\n- Tofu with shanghai green soup\n- Xiao long bao\n- Whole fish in sweet and sour sauce\n- Rice with salted pork and vegetables in clay pot\n- Shredded bean curd with yellow chives\n- Another vegetable dish (not on menu, but on the specials board) with wood ear, lotus, and mushrooms. \n\nI think out of everything, the only decent dishes were the xiao long bao and the whole fish...The tofu with shanghai green soup was filled with MSG. The rice with salted pork and vegetables was inconsistently flavored - my sister took a bowl, and it was tasteless; I took a bowl too, and it was extremely salty. This dish overall didn't have flavor - it was just salty and bland. The vegetable dishes we ordered also lacked flavor and were not very good. In addition, portions were very small here. We ordered 6 dishes for 4 people and were barely full (and we definitely as a family don't eat a lot.) \n\nThe final strike was when my parents asked if there was dessert. Usually Chinese restaurants serve complimentary dessert (like red bean soup or fruit.) This restaurant didn't. Only after my parents persisted about the dessert, that the waiter brought out some red bean filled pastries.\n\nI'm not sure if my family didn't like this restaurant because we are from Guangdong region and this is Shanghai food. But we've been to northern China and Shanghai frequently over the years and had no complaints about the food there...", "rating": 3, "date": "2017-04-13"}], "vegetables fried rice": []}