{"olea s challah custard toast korintji cinnamon sugar strawberries": [], "cazuela baked eggs pork bacon garbanzo beans spinach parmesan cheese tomato sauce": [], "omelet roasted kabocha squash chard broccoli rabe onions mozzarella chesse": [], "migas con huevo soft scrambled eggs chicken mango sausage kale  onions tortilla chips ancho pepper sauce": [], "scrambled eggs on an acme bread rustic roll tomato slices bacon cheddar cheese": [], "pork shoulder sandwich with apple cider slaw": [], "straus family farms yogurt granola blueberries strawberries organic agave honey": [], "single egg": [], "french press": [{"excerpts": ["The only option for coffee is a $7.00 (French press). "], "author": "Adam L.", "review": "Small Portions.....lacking flavor....friendly staff though.....but overall we wish we would just waited longer in line at MyMy. We paid twice as much and left hungry. I'm sure they use great ingredients, but it was not made evident in the menu wording. Another place with a San Francisco pricing scale that leave you underwhelmed. Btw we live half a block away, and we are willing to spend for good food, but a prefectly diced vegetable doesn't always equal a great dish.\n\nThe only option for coffee is a $7.00 (French press). $15.95 Small Omelet with tiny salad (no toast).\n\nIn response to the owner. \nIt is still not clear to me what the points of \"quality\" are in your in your ingredients...Are there particular farms you work with in certain seasons, maybe a olive oil with unique qualities or maybe a local or imported cheeses you like to use? Your answer was caddy, unhelpful and shows your lack concern for your guests. Why is your Asparagus Omelet 16.00, why? Because it's not even Asparagus season maybe, lame. Confetti diced tomatoes, dumb? Hand picked baby greens, I doubt it. Quality is defined in a number of ways...you're still leave me underwhelmed and unimpressed. What a shame!", "rating": 1, "date": "2018-08-26"}, {"excerpts": ["Love the large French press coffee - a coffee-brewing method beloved by me but rather passé in this age of pour-over nonsense. ", "I ordered the chilaquiles, the husband the huevos rancheros. ", "I have never seen him inhale a meal so quickly.  ", "Both of us loved the black beans (order a side if your entrees don't come with!) ", "The chilaquiles were still crisp though adequately sauced - my only complaint is that I wished the pork had been served on its own rather than scrambled into my eggs. "], "author": "Archana P.", "review": "Neat trick: THEY TAKE BRUNCH RESERVATIONS. Color me impressed (with myself) as the husband I were seated outside promptly with a view of the line - which moved quickly for a brunch line in SF- but still!\n\nLove the large French press coffee - a coffee-brewing method beloved by me but rather passé in this age of pour-over nonsense. I ordered the chilaquiles, the husband the huevos rancheros. I have never seen him inhale a meal so quickly.  Both of us loved the black beans (order a side if your entrees don't come with!) The chilaquiles were still crisp though adequately sauced - my only complaint is that I wished the pork had been served on its own rather than scrambled into my eggs. A request I might have made if I had known.\n\nWe'll be back. I want to try those corn cakes! Stellar brunch in SF that takes reservations. Wowee.", "rating": 5, "date": "2018-07-24"}, {"excerpts": ["Started off with a French press coffee, which was marred by the coffee being too finely ground, resulting in heavy silt at the bottom of my mug. \n\n"], "author": "Lily W.", "review": "Food: 3 stars\nService: 1 star\n\nThe food is decent. Started off with a French press coffee, which was marred by the coffee being too finely ground, resulting in heavy silt at the bottom of my mug. \n\nThe host was unnecessarilly curt as I informed him of my reservation.The one star is shared between the curt host and absent-minded server, who was polite but messed up our order twice. \n\nAlso, the passive aggressive sign by the door reads in all CAPS is a red herring for unhappy and overwhelmed staff.\n\nOverall, the service was awful.", "rating": 2, "date": "2018-08-12"}, {"excerpts": ["And don't forget to get the French Press coffee "], "author": "Chris S.", "review": "I haven't had brunch in San Francisco in almost, well forever really. I couldn't afford it back then. Now having broken my piggy bank after years of savings, I could venture out into Nob Hill for some breakfast places!\n\nOlea was actually a random find - we were waiting around the area and found ourselves in a predicament - breakfast hunger. Lo and behold, the outdoor seating of Olea beckoned us and we found ourselves in the lovely seating of the outdoors. \n\nFantastic service. They were incredibly diligent in making sure we had a blast eating at their place, and they made sure we had enough for my friend (who drank literally a gallon of water). Attention to detail was everything, and they were there for that. \n\nThe French Toast, as you may know, is one of their highlights. I was amazed as such delectable item that found its way into my mouth, and with the combination of custard coated in cinnamon sugar, it was simply a 5/5 off the bat. We almost fought each other to finish the last bite, which I am happy to say I won. Get this for sure if you're by yourself or don't have a stomach like a cow (or me...)\n\nThe Breakfast sandwich along with the omelette also made for a great combination - it's hard to venture away from a place that simply makes great breakfast food. And don't forget to get the French Press coffee - you'll want it to keep awake after a food coma inducing meal! \n\nWhile we didn't have to wait in line for brunch, I'm definitely heading back here to engage in another series of breakfast and brunch in San Francisco. Friendly, amiable and outdoor seating makes Olea a great choice to jumpstart your weekend adventures!", "rating": 4, "date": "2017-07-21"}, {"excerpts": ["We ordered the french press coffee, but the coffee had no flavor, which was surprising given that coffee in SF is generally really tasty.  ", "For our entrees, we ordered the omelette and the huevos rancheros.  ", "The huevos rancheros had very little flavor ", "and I had to add a ton of salt to my food, which is something I rarely have to do.  ", "My friend said the omelette was also lacking in flavor.  "], "author": "Arthi N.", "review": "Stopped by this place after a workout and was surprised that there was no line, since it was a beautiful day at prime brunch time.  We got a table outside and service was fine.  The food and coffee left a lot to be desired though.  We ordered the french press coffee, but the coffee had no flavor, which was surprising given that coffee in SF is generally really tasty.  For our entrees, we ordered the omelette and the huevos rancheros.  The huevos rancheros had very little flavor and I had to add a ton of salt to my food, which is something I rarely have to do.  My friend said the omelette was also lacking in flavor.  The bacon was the one standout item (thick-cut and flavorful). \n\nI'd say the food is good enough to eat if you're really hungry and want to stay in the area, but I personally wouldn't return given the plethora of solid brunch options in the city.", "rating": 2, "date": "2018-02-03"}, {"excerpts": ["I really enjoyed the offering of a French press and freshly squeezed juice. ", "Friendly service, but our waiter was obviously very busy as we were only able to order one thing at a time; a few minutes apart. ", "I had the omelette which was full of fresh veggies, but I do wish I had the chance to ask for some hot sauce. ", "Great outdoor seating area for watching all the tourists leaning out of the cable car with their selfie sticks. ", "Stay safe out there!"], "author": "Caitlin S.", "review": "My boyfriend and I were seated almost instantly for brunch (on a Saturday!) which really impressed me considering how crowded it already was. I really enjoyed the offering of a French press and freshly squeezed juice. Friendly service, but our waiter was obviously very busy as we were only able to order one thing at a time; a few minutes apart. I had the omelette which was full of fresh veggies, but I do wish I had the chance to ask for some hot sauce. Great outdoor seating area for watching all the tourists leaning out of the cable car with their selfie sticks. Stay safe out there!", "rating": 4, "date": "2018-07-22"}, {"excerpts": ["For drinks, you can't go wrong with the fresh squeezed orange juice or french press coffee.\n\n"], "author": "Grace C.", "review": "Olea is one of my favorite brunch spots in the neighborhood. The food is consistently delicious, and the owner is always excited to see us. My boyfriend ate breakfast by himself here once, so maybe it's exciting to see that he doesn't always eat alone :)\n\nIf you can only order one thing here, get the challah french toast, which consists of challah bread dipped in custard and topped with cinnamon sugar and strawberries. I typically only eat savory breakfast foods, but I'll make an exception for Olea's challah french toast, which is, dare I say, the best I've had in the city.\n\nThe kitchen uses fresh, seasonal ingredients, so the menu does change sometimes, but they typically have my favorites:\n\n- Cazuela (baked eggs, meat & sauces change but I've had both ground beef and chicken, as well as red and green sauces)\n- Migas Con Huevos (scrambled eggs with squash, I love a couple of variations of this more than others)\n- Sweet Corn Cakes with Eggs & Plantains (so many delicious things packed on one plate)\n\nIf you're feeling extra hungry, get a side of crispy bacon or french fries. For drinks, you can't go wrong with the fresh squeezed orange juice or french press coffee.\n\nOlea also offers outdoor seating, perfect for sunny days, or if you have a dog.\n\nYes, you will have to literally stand in a line instead of putting your name down on a list. It looks like they take reservations for brunch now, so the line could be avoided. You can also just arrive early to beat the crowd.", "rating": 5, "date": "2017-03-28"}, {"excerpts": ["Excellent French press coffee and a great lively vibe here.\n\n"], "author": "Susan C.", "review": "Excellent.  Waits in line for about 10 min. Max.\n\nOrdered Huevos Rancheros which came to the table hot and saucy.  Delicious and perfectly cooked.  A side of chicken sausage is a must.\n\nSpeaking of must my hubby absolutely fell in LOVE with his dish.  Cazuela!  2 eggs baked w/spicy tomato sauce, ground pork, bacon, tortilla chips and parm.  He said it was absolutely the best thing on the menu.  Take that to heart as he is really picky.\n\nExcellent French press coffee and a great lively vibe here.\n\nWill come again when visiting the Nob Hill neighborhood", "rating": 5, "date": "2016-07-23"}, {"excerpts": ["If you just want drip black coffee, good luck because you'll be forced to order expensive french press coffee. \n\n"], "author": "Yin H.", "review": "Very meh experience. Came on a Sun around noon, only 1 group waiting by the fire hydrant in front of us. We had wanted to go to mymy across the street but the line was ridiculously long so we decided to give Olea a try. We were quickly seated inside. Unfortunately, the service leaves a lot to be desired. 1) My friend wanted to sub out her salad for toast (or fruit which they don't have) but was told that wasn't an option and she could just pay for a slice of toast on the side. 2) We were seated directly in line of the front door which they decided to leave open on a pretty windy day to accommodate the servers needing access to customers seated at the tables outside (which I understand). We asked whether they could close the door a bit as we were freezing and we were flat out told no. After we pushed a bit, he finally conceded and closed the door a few inches. 3) If you just want drip black coffee, good luck because you'll be forced to order expensive french press coffee. \n\nOur food came quickly. I had ordered the veg omelette - it was ok but nothing spectacular. The service and attitude really killed it for me.", "rating": 2, "date": "2017-05-14"}, {"excerpts": ["French press coffee and perfectly cooked bacon side made the whole meal perfect."], "author": "Steven K.", "review": "Had brunch here today!  Challah french toast was amazing!  French press coffee and perfectly cooked bacon side made the whole meal perfect.", "rating": 5, "date": "2018-04-07"}, {"excerpts": ["We had a french press coffee for 2, Cazuela and Huevos. ", "The food itself was awesome. ", "I loved the Cazuela with baked eggs. ", "It was definitely a heavier brunch, but I loved all of it. ", "I had a chance to try the Huevos too with the beans. ", "YUM! ", "Service was attentive and friendly. ", "They were quite busy, but the crowd died down, a little after we left."], "author": "Jennifer G.H. W.", "review": "Brunch in SF is always so crazy...it's normal for waiting for 45 minutes to an hour...so it seems.  You always see lots of people out especially when the sun is out. It's a great feeling to see that. We waited for about 45 minutes before having a seat. We had a french press coffee for 2, Cazuela and Huevos. The food itself was awesome. I loved the Cazuela with baked eggs. It was definitely a heavier brunch, but I loved all of it. I had a chance to try the Huevos too with the beans. YUM! Service was attentive and friendly. They were quite busy, but the crowd died down, a little after we left.", "rating": 4, "date": "2016-09-06"}, {"excerpts": ["We ordered the French Press coffee first and studied the menu. ", "The Challah Custard Toast was calling my name, but I was trying to be 'good' and chose the bacon omelet while the Mr. ordered Huevos Rancheros. ", "He enjoyed his and mine was 'okay' ", "but truthfully I couldn't stop thinking about that toast. ", "I think we shocked our waiter by adding it to our order mid meal. ", "The Mr. likes to eat, so we decided to split the large order. ", "Yes. ", "We were being piggy. ", "I have absolutely NO regrets. ", "The Challah Custard Toast was everything I hoped it would be. "], "author": "Kym T.", "review": "The Mr. and I were in San Francisco for a long weekend over the Easter holiday. We enjoy Sunday brunch on a regular basis, so I looked at several San Francisco options for this meal. I chose Olea because of it close proximity to our hotel, its price point, and its menu. \n\nThis particular morning was rainy and cold, so we arrived wet, hungry, and a tad late for our reservation. Luckily they saved our table for us, because the restaurant was packed. Olea is a small, but cute place. Our waiter was attentive and took good care of us. \n\n\nWe ordered the French Press coffee first and studied the menu. The Challah Custard Toast was calling my name, but I was trying to be 'good' and chose the bacon omelet while the Mr. ordered Huevos Rancheros. He enjoyed his and mine was 'okay' but truthfully I couldn't stop thinking about that toast. I think we shocked our waiter by adding it to our order mid meal. The Mr. likes to eat, so we decided to split the large order. Yes. We were being piggy. I have absolutely NO regrets. The Challah Custard Toast was everything I hoped it would be. Served with strawberries and a little pitcher of warm syrup it really hit the spot. \n\nThree breakfasts later, we left full, happy, and ready to hit the rainy streets of San Francisco!", "rating": 4, "date": "2017-05-05"}, {"excerpts": ["Coffee comes  as either a form of an espresso drink or via French press.  \n\n"], "author": "Andrea H.", "review": "Popped in for a Saturday brunch with 2 pals a little after 10:15 am. The wait was very mild and the host was more than accommodating. Like most busy brunch places, Olea will not seat your table until the entire party has arrived.\n\nWe ordered a Bloody Mary, OJ, and a cappuccino. Regular drip coffee is not available. Coffee comes  as either a form of an espresso drink or via French press.  \n\nOur table ordered the famous French toast as a starter. Wow!! It was excellent. The brioche base had an inner creamy inside that I've never experienced with French toast before. The sliced strawberries that covered the dish were a nice finishing touch.\n\nFor my main meal I feasted on the corn cakes with eggs and squash. This dish was excellent except the  blackened squash was slightly burnt. \n\nI will certainly be back to enjoy another brunch and perhaps lunch or dinner here!", "rating": 5, "date": "2015-05-02"}, {"excerpts": ["French press small $6 serves 2\n2. ", "Huevo rancheros \n3. I forgot the name but it had eggs and lamb sausage\n4. "], "author": "Joy M.", "review": "I find the owners response to his Yelp reviews hilarious.\n\nMoved close by and always saw the cute outdoor seating so obv had to stop by.\n\nWhat we ordered\n1. French press small $6 serves 2\n2. Huevo rancheros \n3. I forgot the name but it had eggs and lamb sausage\n4. Fresh squeezed OJ\n\nThe brunch food isn't your classic American brunch menu of eggs Benedict etc so if that's what you're expecting then I would probably go elsewhere. \n\nOverall food is okay. The OJ and coffee was pretty great. I thought the prices were a bit high. The host was a bit sassy. Had fomo that I didn't order the avocado toast.", "rating": 3, "date": "2017-03-04"}, {"excerpts": ["French press coffee is meh. ", "Get fancy coffee at Contraband across the street instead."], "author": "Martina M.", "review": "Brunch review -- always order the Cazuela! So delicious during foggy San Francisco mornings. \n\nAvocado toast is also yummy but way overpriced at $15. You could buy some avocados at trader joes down the street and make it yourself. \n\nBoyfriend's pulled pork tacos were good too. Someone knows how to cook meat! However they were a little soggy because the serving of pork wasn't drained well. \n\nFrench press coffee is meh. Get fancy coffee at Contraband across the street instead.", "rating": 5, "date": "2016-07-09"}, {"excerpts": ["Or french press coffee. "], "author": "Jennifer R.", "review": "Hands down my favorite brunch place in SF--and this is saying a lot given that my runners up are trendy Foreign Cinema, roof deck purveying El Techo, and line down the block even on weekdays Zazie. \n\nSo what makes Olea so special? It's simple: the food. It's delicious. Period. I've been coming here for the past 6.5 years. I've been eating french toast for, oh, probably 31 of the past 33 years. And I've never had a ore delicious french toast ever. Then we can talk about the egg sandwich made with acme bread and the perfect combo of vine-ripened tomatoes, cheddar cheese, and perfectly cooked bacon. Or the seasonal and constantly changing omelette options. Or french press coffee. You get the idea. \n\nAnd, ok, this is going to sound so cheesy, but the place is so obviously cared for with love by the owner who is there every single day and is the first to enthusiastically describe any number of today's specials. MyMy Coffee across the street has a bigger following and I just don't get it. \n\nOlea is also incredible for dinner. The same great quality. The same great service. Not so standard SF pricing. It's one of the few places left in the city where you can get an amazing meal without spending a fortune and without waiting in an ungodly line. \n\nIn sum: run, don't walk.", "rating": 5, "date": "2017-06-14"}, {"excerpts": ["I sat outside on the street watching the cable car go by along with the rest of the world and had a couple of beers along with one of the French press coffees (I needed a little caffeine boost). \n\n"], "author": "Mike T.", "review": "I had a great lunch time at this cozy place. I sat outside on the street watching the cable car go by along with the rest of the world and had a couple of beers along with one of the French press coffees (I needed a little caffeine boost). \n\nThe service was very friendly and overall a pleasant experience. I didn't have food because I was still full from breakfast but the menu looked great for brunch and the other people seemed to be enjoying their food! \n\nIt was a nice spot. I would definitely go back to try out their menu.", "rating": 5, "date": "2016-03-25"}, {"excerpts": ["I had some of the best French press coffee I've ever had and some delicious huevos rancheros."], "author": "Carl E.", "review": "Decided to eat here when the place across the street was too busy. Great decision. I had some of the best French press coffee I've ever had and some delicious huevos rancheros.", "rating": 5, "date": "2017-07-22"}, {"excerpts": ["I didn't order the French press of Blue Bottle because it looked like too much coffee. \n\n"], "author": "Lauren G.", "review": "Great spot for brunch! We came here with a group of 6 and waited about 45 minutes in line. They do let you know that they might split bigger parties into 2 tables. \n\nThe juice at Olea is super fresh, but the michelada and Bloody Mary were okay and a bit too spicy. The coffee was good not great. I didn't order the French press of Blue Bottle because it looked like too much coffee. \n\nI ordered the huevos rancheros, which were really good! The plate had a lot of food, with homemade tortillas and great chicken sausage on the side. The plate was a little too drippy for me, there wasn't enough tortilla or something to pick everything up. I did love the flavor overall. \n\nI would come here again but definitely have some better places to go. We waited a long time for our food but the service was great.", "rating": 4, "date": "2015-05-30"}, {"excerpts": ["We also ordered a large french press coffee for the four of us, only was enough for three full cups. ", "If I remember correctly the french toast was around $14.75 and the large french press was $8.75. ", "In my opinion, that's pretty steep for breakfast. "], "author": "Steven P.", "review": "Came here for breakfast this morning and ordered the full size french toast, all i can say is wow. It was Challah with custard filling and covered in cinnamon sugar, topped with strawberries. The food was absolutely delicious, was the perfect amount of sweet. The full size was two of these bad boys, but with the extreme fluffiness from the custard, it was very filling. We also ordered a large french press coffee for the four of us, only was enough for three full cups. The coffee was pretty regular, nothing special, but can't say it was bad.\n\nWhen me and my three friends arrived, we walked right in without a line. Service was pretty good and quick. However, towards the end, It started to get a little packed and people were waiting for tables and the waiters/waitresses seemed to be eyeing us and getting a bit pushy so we would leave and give up the table. We were basically still finishing up our meal when we noticed this attitude.\n\nHave to say that the pricing was a little high as well. If I remember correctly the french toast was around $14.75 and the large french press was $8.75. In my opinion, that's pretty steep for breakfast. On the bright side, they were giving 3% off of the check if you pay with cash, so this was pretty nice to have.\n\nIn conclusion, enjoyed the food, service was great until the very end, prices were a bit high, but would recommend.", "rating": 4, "date": "2016-05-08"}, {"excerpts": ["He recommend the French press, delicious bold coffee! ", "All of the staff is super friendly, we chatted with the owner quite a bit. ", "Great guy! ", "I ordered the avocado toast and my BF got the huevos rancheros added bacon. ", "BF pro tip take some of the avo from the girlfriends toast and use as a nice topper. ", "If I lived in SF this would be my go-to spot. ", "Still dreaming about that avo toast..."], "author": "Kaitlin B.", "review": "This cute restaurant is the perfect weekend breakfast spot in Nob Hill. The owner himself  greeted us and got us seated right away. He recommend the French press, delicious bold coffee! All of the staff is super friendly, we chatted with the owner quite a bit. Great guy! I ordered the avocado toast and my BF got the huevos rancheros added bacon. BF pro tip take some of the avo from the girlfriends toast and use as a nice topper. If I lived in SF this would be my go-to spot. Still dreaming about that avo toast...", "rating": 5, "date": "2016-02-15"}, {"excerpts": ["A french press coffee was good and strong, and I loved my cappuccino on the 2nd visit. ", "Service was extremely friendly and they recognized us as well. ", "I will miss you beautiful cazuela until I can return again."], "author": "Stephen K.", "review": "Lovely cazuela: you are so delicious. Hot, tangy, filling but not too heavy. The perfect breakfast for a chilly SF morning. Mine had shredded chicken and a tomatillo sauce, with egg and some sliced mushrooms (?), but yes it all worked. It was wonderful. We also tried the challah french toast which was a good addition for some sweetness. Hell, not some sweetness a LOT of sweetness but it was soft, fluffy and worth getting. The avocado toast needed a sprinkle of salt to really shine. And it had to be eaten all together to taste good: egg, perfectly ripe and delicious tomato, and the salad. At first it seemed bland but as you ate everything the flavors melded together and it is a light addition to a meal. On our second visit (yeah they earned two out of our five SF breakfasts!) we had the huevos rancheros, and the corn cakes with vegetable hash. Both were done nicely. My sweetie loved the vegetable hash. I felt the corn cakes would have been better if warmer. I liked the sauce with my huevos, but huevos always leaves me a little hungry...I should have added something more filling. Still, their mexican sauces are seasoned well, and everything was fantastic overall. A french press coffee was good and strong, and I loved my cappuccino on the 2nd visit. Service was extremely friendly and they recognized us as well. I will miss you beautiful cazuela until I can return again.", "rating": 5, "date": "2015-10-31"}, {"excerpts": ["They serve blue bottle coffee here (recommendation: get it french press). ", "Best french toast  in city. ", "Cazuela is served in a hot skillet and is absolutely a must try if you've never had this dish before. ", "The Migas Con Huevo is a little heartier than the Cazuela and also fantastic. "], "author": "Victor W.", "review": "Olea is arguably the best restaurant in Nob Hill, which says a lot given the vibrancy of the neighborhood. Absolutely amazing for brunch and quite solid for dinner -- it's rare to find any restaurant that can do both so skillfully.\n\nBrunch: Expect a line (typically 15-30 minute wait). Definitely worth it. They serve blue bottle coffee here (recommendation: get it french press). Best french toast  in city. Cazuela is served in a hot skillet and is absolutely a must try if you've never had this dish before. The Migas Con Huevo is a little heartier than the Cazuela and also fantastic. The Scrambled Egg Sandwich is arguably the most substantial savory item as it's fairly large and comes with a large salad too. \n\nService is nice and friendly. I only wish they cleared tables faster and kept the line moving faster.\n\nDinner: It's definitely an intimate setting as people haven't figured out this place is great for dinner. Service is very attentive and friendly. I was recommended the pork chop which I tried and it was surprisingly moist and well cooked. It was very substantial in portion and the accompanying root veggies were delicious. They were great at suggesting accompanying wines by the glass. The scallops were great too as an entree if you're looking for something lighter.", "rating": 5, "date": "2014-08-13"}, {"excerpts": ["Also interestingly, if you plan on ordering coffee they serve it in a french press and it tasted good although im no coffee connoisseur. ", "One last note, it may have been that we went on mothers day, but the price seemed alittle high, also they charge 3% less if you pay cash."], "author": "Matthew H.", "review": "I recently had brunch at Olea. I ordered the Huevos Rancheros and thought it was good, not great. It seemed as if they were trying to make up the lack of flavor by drenching it in spicy sauces. I would like to mention that if i ever do go back i plan on ordering the french toast, as many previous yelpers stated, it is great (i tried a piece from my friend). Also interestingly, if you plan on ordering coffee they serve it in a french press and it tasted good although im no coffee connoisseur. One last note, it may have been that we went on mothers day, but the price seemed alittle high, also they charge 3% less if you pay cash.", "rating": 4, "date": "2016-05-08"}, {"excerpts": ["Ended up having the Challah custard French toast with a large French press of blue bottle.\n\n"], "author": "Aram J.", "review": "I've had a 3.5-4 year relationship with Olea. \n\nIt started long distance; I came in for business one week and a friend invited me to come try it out. Ended up having the Challah custard French toast with a large French press of blue bottle.\n\nAll that time and maybe three dozen visits since (I live much closer now, in the bay), I've only ever ordered the toast. It's the best French toast I've ever had.\n\nLike all relationships, there's been growth. Management changed, a mini-Cooper drove into the side of the building, closing it for a few months... You know, typical relationship stuff.\n\nI enjoy the current owner, Phillip. He's straight forward and takes the business seriously. He reminds me a bit of Tim Gunn. Despite ownership changing hands, the quality of the food and service remains high. It's still a fabulous location (and the building is probably more structurally reinforced now following the compact German car's uninvited half-entrance).\n\nFew rules: you line up outside and will only be seated when you're all there. It's a small place, and even though they have outdoor seating now, the wait for 4+ during peak brunch hours can easily run over 30 min. No outside food or drinks.\n\nLook, I can't tell you how the eggs are here, or whether the dinner menu is good. I see other people ordering not-French Toast and I get brain hurt. I'm sure that food is all terrific, because their ingredients and the overall menu are all excellent. Still, Olea is a challah custard French toast factory as far as I'm concerned. The only needed improvements are an automated ramp that brings endless toast out, and a chair and table positioned right in front of it so I can sit there with my mouth open and gorge.\n\nIf a sweet breakfast sounds good to you, and if you're a fan of French toast, I personally think this is the tastiest option in the city. Certainly the best toast I've ever had.\n\nDolla' make you challah, folks.", "rating": 5, "date": "2015-08-22"}, {"excerpts": ["I also like the french press coffee (but beware they don't have decaf). \n\n"], "author": "Joshua B.", "review": "One of my favorite brunch places in San Francisco - nestled in a residential part of Nob Hill. \n\nI've had the casuela, the migas and also the challah custard french toast - uniformly delicious and served quickly. I also like the french press coffee (but beware they don't have decaf). \n\nSeating is tight because this place is small (some say \"charming\") - but I've only come with 1-2 other people so it's never been an issue for me.\n\nEasy to get to by cable car or bus, parking's not so easy, but that's SF for you. Definitely try and get here before they open on the weekends, because they don't take reservations and the line builds up fast.\n\nHighly recommended - go here!", "rating": 5, "date": "2013-12-02"}, {"excerpts": ["French press coffee was a nice compliment, and it was fun to share this pot with another."], "author": "Kristen C.", "review": "Nice service & Sunday brunch. Quaint, cozy brunch corner in the city. Not a ton of seating but its charm is in its small size and cozy feel. We got sat at a communal table which is a charming idea. Corn cakes with veggie hash and fried eggs are a great veggie option. It's sweet and filling. Came with tasty avocado slices. French press coffee was a nice compliment, and it was fun to share this pot with another.", "rating": 4, "date": "2015-12-20"}, {"excerpts": ["Olea's brunch is delicious (especially the french press coffee and the french toast), but the atmosphere is close and busy, and you don't get the full experience like you do in the evenings.\n\n"], "author": "Amy J.", "review": "I'll start by emphasizing that dinnertime is when these 5 stars really shine.\n\nOne evening, I was stopped by two kindly Welsh women asking for directions to a seafood spot on Hyde that their hotel had recommended. In the midst of explaining where to go, we mentioned that we were going to Olea, so they decided to check out the menu and wound up trying it out. As they left, they approached our table, and one woman said to us \"I'm sorry to bother you, but I just wanted to let you know that that was by far the best meal I've had since we've been on holiday, thank you so much for pointing it out.\" \n\nIf that's not enough to sell you, I'll elaborate.\n\nOlea is my favorite restaurant in San Francisco. \nHow can I make such a bold claim, you ask? There are a number of reasons.\n- Genuine and welcoming owner\n- Attentive but not overly-pushy staff\n- Gorgeous, fresh, high-quality food; literally everything on the menu is delicious\n- Warm, inviting atmosphere\n- Excellent wine selection and a skillful recommendation from the owner himself\n \nOlea's brunch is delicious (especially the french press coffee and the french toast), but the atmosphere is close and busy, and you don't get the full experience like you do in the evenings.\n\nIn the evenings, you'll be greeted by the owner or one of the equally kind and generous staff. As you sit, sipping a tastefully recommended glass of wine, you'll notice passersby drawn into the warm glow, peeking over the candlelit windowsills. You'll look over the menu and feel equally impressed and overwhelmed, as everything sounds so good - and I'll tell you, everything really is so good. Allergies aside, you really can't go wrong with a single dish on the menu. It varies with the season, as they only use fresh, high-quality ingredients, so if you're eyeing something but afraid to branch out, just do it; it might not be available next time you're in. \n\nThe pork tenderloin is incredible, and seems to be more of a staple among the rotating, ever-delightful assortment of fresh fish, lamb meatballs, risotto, short rib, white wine mussels, the list goes on. \n\nThe staff are hospitable and attentive, but observant and respectful of the guests' space;\nyou won't feel like you're being rushed to free up your table. The owner is one of the most genuine people I've met in the service industry. My boyfriend and I were lucky enough to become regulars at this wonderful spot, and he always greeted us like old friends. He seems simply delighted to be doing what he's doing, and it shows through his calm, charismatic demeanor, and the wonderful atmosphere of his restaurant.\n\nTL;DR - Nothing but good things to say about an evening at Olea.", "rating": 5, "date": "2015-08-04"}, {"excerpts": ["+ Blue Bottle French Press Coffee - umm, ", "yeah ", "it's something like $5.25 I think to have someone else crush the beans and put it in Bodum. "], "author": "Yiven C.", "review": "Olea's Custard Challah French Toast with Korintiji Cinnamon Sugar and Strawberries--get it.\n\nReason to Get Up (+'s):\n\n+ FRENCH TOAST - full order please. You know others will want a bite. I'll put on my Sunday best to down the custard confection that doesn't weigh me down like a loaded sponge.\n\n+ Blue Bottle French Press Coffee - umm, yeah it's something like $5.25 I think to have someone else crush the beans and put it in Bodum. For some reason it tastes freaking good though when someone else gets it ready for you.\n\n+ CAZUELA is another signature dish. It's like a soupy mix of eggs, garbanzo beans, spice, spinach and tomato sauce. Great I think if it's a cold foggy day but not when the sun is actually shining in SF.\n\n+ SETTING is cozy. Perhaps seating for 25-30. Tables set far enough where I can have a private conversation.\n\n+ SERVICE was great. Water refilled regularly and seated promptly.\n\n+ MIMOSAS with OJ or grapefruit juice. Joy.\n\n\nReason to stay in my PJs(-'s):\n- When Challah French Toast gets pulled from the menu.\n\nTIP: French Toast and BB Coffee. Echo.", "rating": 4, "date": "2013-12-29"}, {"excerpts": ["Grapefruit mimosa was nice and the french press blue bottle coffee was a nice touch too."], "author": "Nina N.", "review": "Simply wonderful. Everything was great. \n\nFood and service gets 5 stars.\nMy only issue was with how cramped the place is. Next time I'll probably sit outside and avoid the somewhat claustrophobic inside tables. \n\nParents came to visit and we went here on Saturday. The wait was better than average (about 10mins), and the speed of service was really exceptional for a busy Saturday. Our server was very attentive and I liked the fact that the 'host/manager' was also supporting table service, which made everything run a lot smoother. \n\nI highly recommend the challah french toast (whoa!) and all of their egg dishes are really thoughtfully prepared. Grapefruit mimosa was nice and the french press blue bottle coffee was a nice touch too.", "rating": 4, "date": "2015-12-10"}, {"excerpts": ["First, we started off with a large french press coffee to share. ", "By the way, they serve the oh-so-delicious Blue Bottle Coffee. ", "They have a few espresso drinks as well "], "author": "Daisy T.", "review": "Best french toast EVEEEEEER!!\n\nThis place is so cute and cozy. And I love that they get their ingredients from local farmers as often as possible. \n\nAnd did I mention they have the most bomb french toast I've ever had??\n\nCame here for a late brunch on Sunday. The hubby and I got there around 1PM, but there was still a wait! We waited about half an hour, but it really didn't seem that long. The owner/manager was super nice and kept acknowledging us and letting us know where we were on the list. \n\nFirst, we started off with a large french press coffee to share. By the way, they serve the oh-so-delicious Blue Bottle Coffee. They have a few espresso drinks as well if you're not into black coffee. \n\nThe hubby ordered the migas huevos - scramble with beef, pork and tortilla chips topped off with a delicious sauce with great aroma and spices. I love the extra crunch from the tortilla chips, but it also came with some crostini on the side. Yum! And definitely ask for some hot sauce. They make it themselves with whatever ingredients are in season!\n\nThe winning dish of the day was their amaaaaazing french toast! They call it custard toast on their menu and that's exactly what feels and tastes like. Because they use challah bread, it just soaks up whatever cream sauce they dip it in. The bread looks dry, but it's so creamy and soft on the inside. There's no overpowering egg taste like traditional french toast and it's just the right sweetness! It's so good that you don't even need to eat it with syrup! The sprinkle of cinnamon sugar around it is enough! But definitely try it with a little syrup, too!\n\nBy the way, get the side of bacon with it. Just do it. You won't regret it.\n\nLove this place! This is how brunch should be! Simple, locally sourced and delicious!", "rating": 5, "date": "2013-04-16"}, {"excerpts": ["Coffee was expensive, but they serve it in French press pots, my bf said the coffee was very good (and he normally doesn't comment, Starbucks is his gold standard)"], "author": "Amy W.", "review": "I wanted to LOVE LOVE this place for brunch. I thought it was good, but not as amazing as I expected. We ordered the Eggs in tomato sauce and the pulled pork sandwich.\n\nThe portions were not large (not tiny, but for $13 I expected more). The french fries were perfect I will grant them that, and they make their own hot sauce which I also thought was a special touch.  I can think of other places I would rather go for a great brunch. \n\nWe got there 15 minutes before it opened and there were already about 8 people in line in front of us. I had never even noticed My My Coffee Shop across the street while we were waiitng and I am looking forward to trying that, so I'll report back -- maybe the universe was just sending me to the incorrect corner of California & Larkin or brunch perfection. \n\nCoffee was expensive, but they serve it in French press pots, my bf said the coffee was very good (and he normally doesn't comment, Starbucks is his gold standard)", "rating": 3, "date": "2013-03-31"}, {"excerpts": ["That and some french press coffee, we were well satisfied with our meal. ", "The service was a little slow ", "but we were happy soaking up the sun and cool breeze today."], "author": "Irv N.", "review": "Good place for brunch today, arrived around 11am and no wait for a table outside, but a long line by noon. The corn cakes were delicious on a bed of guacamole, full of flavor. My wife had the blt and thought it was good but a little too much bread, unless you like really thick bread on your sandwich, otherwise very good. That and some french press coffee, we were well satisfied with our meal. The service was a little slow but we were happy soaking up the sun and cool breeze today.", "rating": 4, "date": "2016-04-23"}, {"excerpts": ["We got the blue bottle French press coffee, fresh squeezed orange huice, the tortilla soup dish and the sweet bread. ", "It was a very filling and delicious meal. ", "The place is small and you're packed a little close to the next table so they can definitely listen in on your convo if they wanted to but food was good and the wait was not nearly as insane as the place across the street"], "author": "Ruby C.", "review": "Wait for this place was nottt bad. We got the blue bottle French press coffee, fresh squeezed orange huice, the tortilla soup dish and the sweet bread. It was a very filling and delicious meal. The place is small and you're packed a little close to the next table so they can definitely listen in on your convo if they wanted to but food was good and the wait was not nearly as insane as the place across the street", "rating": 4, "date": "2014-11-24"}, {"excerpts": [", I wasn't wow-ed by their French Press Coffee. ", "It was just okay."], "author": "Emily C.", "review": "After seeing the crazy long line at Mama's, we ended up at Olea around 10:30am. 5 minute wait for a party of 2 on a Saturday! woohoo! (We all know how rare a no-wait brunch place that is highly rated is in SF)\n\nTip: Come early to skip the line! It's a small quaint joint, so come early!\n\nI tried their challah french toast... easily the best french toast I've had anywhere in SF (or anywhere period!) The bread is fluffy and custard-y on the inside. Each bite is like a fluffy bite of heaven :)\n\nSorry, I wasn't wow-ed by their French Press Coffee. It was just okay.", "rating": 4, "date": "2012-08-02"}, {"excerpts": ["an entree plus the french press coffee was $4.90 instead of just getting coffee and free refills).  ", "The wait time was not bad as we opted to sit at a community table.  ", "They had a sign up sheet inside so the wait process was orderly."], "author": "Roya B.", "review": "The ingredients really make a difference here!\n\nLoved the combination of flavors used in the dishes we ordered.  My boyfriend and I shared the french toast (because every Yelper recommended it) and an omelette with ham, bell peppers, potatoes and some type of cheese.  Both dishes were fantastic.  The server helped us select the omelette dish.  \n\nI am not giving this place 5 stars because of the price (more like $12 an entree plus the french press coffee was $4.90 instead of just getting coffee and free refills).  The wait time was not bad as we opted to sit at a community table.  They had a sign up sheet inside so the wait process was orderly.", "rating": 4, "date": "2012-07-23"}, {"excerpts": ["They serve Blue Bottle coffee in a French Press. \n\n"], "author": "Winny F.", "review": "Another excellent yelp find. My typical brunch places include Universal Cafe, Brenda's, and Butler's & Chef. Olea got a similar rating and was in a location that I could actually find parking on the street. YAY! \n\nThe wait isn't as bad if you get there before 11. There were still a few tables left when I got there (Saturday Morning). \n\nThey serve Blue Bottle coffee in a French Press. \n\nI ordered the custard french toast , which was super light. Half  portion is more than enough. It was probably the best french toast I've had in the city. \n\nCan't wait to go back with my husband.", "rating": 4, "date": "2014-02-05"}, {"excerpts": ["The French press was okay ", "but the waiter we had was great. ", "It you can handle the heat, you've got to try their hot sauce. ", "My mouth is still watering at the thought."], "author": "Nutan C.", "review": "I was standing in line waiting for it to open. But now I know why! The cazuela was delicious  and my fiancé had the huevos rancheros. He said he never had HR that was so flavorful. The French press was okay but the waiter we had was great. It you can handle the heat, you've got to try their hot sauce. My mouth is still watering at the thought.", "rating": 4, "date": "2015-06-22"}, {"excerpts": ["We enjoyed a small blue bottle french press that's perfect for two while we waited for our mains. ", "The lady got the french toast, and I must admit that it's the best that I've had in the Bay Area. ", "Challah must be the best kind of bread to use for french toast because it gives it a crispy crust and a thick, airy filling with a light custard. ", "Topped with cinnamon sugar and strawberries and you have one amazing french toast. ", "If their blue bottle french press doesn't suit you, head over to Contraband across the street for all your coffee needs. ", "I'll be coming back just for the french toast!"], "author": "David O.", "review": "The lady and I drove out to Nob Hill just to try out Olea for brunch. It's a quaint little shop that only has about eight or nine tables including one large table that can sit about eight people. Our waitress and server was a very sweet lady. We enjoyed a small blue bottle french press that's perfect for two while we waited for our mains. The lady got the french toast, and I must admit that it's the best that I've had in the Bay Area. Challah must be the best kind of bread to use for french toast because it gives it a crispy crust and a thick, airy filling with a light custard. Topped with cinnamon sugar and strawberries and you have one amazing french toast. I had their omelette of the day that had very complementary flavors and a kick of heat setting it apart from most other omelettes.  \n\nI wished I lived in an area with little neighborhood restaurants just like Olea. If their blue bottle french press doesn't suit you, head over to Contraband across the street for all your coffee needs. I'll be coming back just for the french toast!", "rating": 4, "date": "2013-10-04"}, {"excerpts": ["The coffee arrived in a posh-looking French press. ", "The place has the organic raw sugar cubes, also adding a classy touch. ", "The coffee was mild (or some would call it \"smooth\"?) compared to the Starbucks stuff that I'm used to. ", "I am not a coffee connoisseur ", "so whatever makes Blue Bottle so popular and expensive is lost on me. "], "author": "Alice W.", "review": "The O and I came here for Sunday brunch. We walk or drive by the place so much and finally decided to give it a try. We arrived around 10:30 and there was already a line. Since there's only two of us, we were seated within 10 minutes at the communal table. We read that Olea is known for the French toast, so we decided to split that and this chilaquiles like dish. They also serve Blue Bottle coffee so I got to experience that for the first time here too.\n\nThe coffee arrived in a posh-looking French press. The place has the organic raw sugar cubes, also adding a classy touch. The coffee was mild (or some would call it \"smooth\"?) compared to the Starbucks stuff that I'm used to. I am not a coffee connoisseur so whatever makes Blue Bottle so popular and expensive is lost on me. Definitely happy to try it, though.\n\nThe chilaquiles-like omelette was fantastic! I've tried the one from the Ferry Building farmer's market, which is suppose to be a very good version of the dish, and wasn't impressed. Granted, Olea didn't call it a chilaquiles, but the dish had all the elements -- the scrambled eggs, the sauce (green, in this case) and the fried tortillas. The tortillas were in strips instead of chips and they stayed crunchy until the last bite. The sauce wasn't as sour as the green sauce on the chilaquiles from the Alemany farmer's market and it had small speckles of pork. The eggs were wonderfully soft and runny, just as I ordered. I would definitely get it again.\n\nThe star of the meal, without a doubt, was the French toast. They probably soaked the challah in the custard batter for a while for it to soak up all the goodness. The French toast was so soft and airy, with a mild sweetness, but not soggy. I can still feel the texture of the egg bread. The dusting of cinnamon and sugar mixture is a little crunchy and makes the treat extra special. There was so much reluctance in Orin's eyes when it was time to switch plates, it took everything he had not to run off with the plate to a deep cave somewhere to enjoy it all by his lonesome. Mmmmyyyyyy preeeeeecious...\n\nAfter our brunch experience, I'm quite excited to go back for dinner. The portion size here is on the small side, but that allows you to walk out of the place without the fear that the button on your pants will pop off the minute you stand up and take out someone's eye. The service is friendly and the menu is simple and seasonal. Definitely a neighborhood gem.", "rating": 5, "date": "2011-07-25"}, {"excerpts": ["Pairs perfectly with some French press coffee! \n\n"], "author": "McKenna G.", "review": "Cha-llah-llah-llah! Boy, oh boy, is the French toast decadent yet seemingly light. Pairs perfectly with some French press coffee! \n\nLove the exterior and the inside is so comfy! I ate here about 4 years ago and am so happy to see it's still around and thriving! Can't wait to come again.", "rating": 4, "date": "2014-01-10"}, {"excerpts": ["Loved the asparagus soup, French press coffee and tiramisu."], "author": "Larry M.", "review": "Great service. The host and server were super friendly.  Loved the asparagus soup, French press coffee and tiramisu.", "rating": 5, "date": "2014-03-06"}, {"excerpts": ["Blue Bottle french press is huge but amazing. ", "I had the french toast - it's one of the most delicious things I've ever eaten, no joke. "], "author": "Jennifer M.", "review": "Came here for brunch on a Sunday with 3 people. Arrived at around 10 and waited in a not so long line. I forget exactly when we were seated, but at the latest it was 10:30, so for brunch in SF on a Saturday, not a bad wait at all. Also, the staff was very accommodating as we were waiting on a friend who was walking up the hill from BART and they seated us even though he wasn't there yet so we could order coffee and tea while we waited for him. \n\nBlue Bottle french press is huge but amazing. I had the french toast - it's one of the most delicious things I've ever eaten, no joke. Order it!\n\nFriendly service, great food - definitely will be back here!", "rating": 5, "date": "2013-11-17"}, {"excerpts": ["best french press coffee . ", "really good mimosas, and ok the BEST Avacado Toast! ", "i recommend that and getting the Cauzuela which is so unbeleivebly good ", "oh my gosh the eggs and sauces and cheese ugh ", "so yummy!!!!"], "author": "Sophia H.", "review": "best french press coffee . really good mimosas, and ok the BEST Avacado Toast! i recommend that and getting the Cauzuela which is so unbeleivebly good oh my gosh the eggs and sauces and cheese ugh so yummy!!!!", "rating": 5, "date": "2016-07-24"}, {"excerpts": ["I love the fact that they give you a French press", ", it's genius and the best way to drink coffee next to a pour over. ", "I had a squash and spicy greens omelette without cheese and it was lovely! ", "The only part that was dissatisfying was in fact the side of bacon. ", "If they cooked it any longer it would not have been edible. ", "Anyone who understands bacon knows that it tastes best somewhere in between juicy and crispy.  ", "Ya gotta find a balance and unfortunately, I was disappointed."], "author": "Bree G.", "review": "I finally made it in! This place is quaint and very popular. I love the fact that they give you a French press, it's genius and the best way to drink coffee next to a pour over. I had a squash and spicy greens omelette without cheese and it was lovely! The only part that was dissatisfying was in fact the side of bacon. If they cooked it any longer it would not have been edible. Anyone who understands bacon knows that it tastes best somewhere in between juicy and crispy.  Ya gotta find a balance and unfortunately, I was disappointed.", "rating": 4, "date": "2012-12-03"}, {"excerpts": ["The Fresh squeezed orange juice was delicious, coffee by french press was amazing - easily the best coffee that I have ever had.  \n\n"], "author": "Lukas Y.", "review": "In town from Chicago for a wedding, decided to check out some yelp recommendations for brunch spots.  As a note, my wife and I have developed very discriminating taste from our brunch experiences in the Chicago culinary scene.  That being said, we were supremely impressed with the brunch here at Olea.  The Challah French Toast, as you might well have read about in some of the previous posts, was absolutely fantastic. Simply outstanding.   The Fresh squeezed orange juice was delicious, coffee by french press was amazing - easily the best coffee that I have ever had.  \n\nSummation, Olea stands up out as a great brunch option but be sure to get there early as it fills up pretty quick here.", "rating": 5, "date": "2012-10-08"}, {"excerpts": ["My man loved the fresh blue bottle coffee served in a french press on our table.  ", "The OJ was freshly squeezed and tasty.  ", "I liked their popular cazuela with eggs.  ", "I don't think it was mind boggling ah-mazing ", "like I think some people were expecting and were disappointed with, but it was good ", "and I ate the whole thing.  ", "My man loved his french toast, said it was one of the best he's had.  ", "If you're in the Nob Hill area, I def. ", "recommend for brekkie or brunch."], "author": "Bernadette M.", "review": "Quaint little place for brekkie or brunch....\n\nOlea is known for its breakfast and lunch, though it is open for dinner tue-fri 6-9:30pm.  Came on a friday morning around 10:30am and there was 30 minute wait for the two of us.  When you walk in the door, there is no foyer or space to the side to wait, you're pretty much standing their awkwardly in front of everyone.  So you're better off signing your name on the waitlist to the side and then waiting outside where they'll call your name. \n\nFYI: you can choose to have your own table or to sit at a communal table.  They do take reservations.\n\nService was attentive.  Olea was simply decorated and clean.  My man loved the fresh blue bottle coffee served in a french press on our table.  The OJ was freshly squeezed and tasty.  I liked their popular cazuela with eggs.  I don't think it was mind boggling ah-mazing like I think some people were expecting and were disappointed with, but it was good and I ate the whole thing.  My man loved his french toast, said it was one of the best he's had.  If you're in the Nob Hill area, I def. recommend for brekkie or brunch.", "rating": 4, "date": "2012-03-14"}, {"excerpts": ["Coffee is served in a french press, also very good. ", "The most impressive food is the toast: so soft, yummy, and just right hint of cinnamon sweetness. ", "It is perfect! "], "author": "Emmy P.", "review": "Olea is named one of best brunch places by a number of magazines. So it has been on my list for a while. I came here on a Saturday morning. The Mymy across the street was lined up, but this place was half empty. I was wondering if I made the right choice? \n\nWe ordered OJ mimosa, coffee, half order of Challah custard toast and strata. Mimosa tastes fresh. Coffee is served in a french press, also very good. The most impressive food is the toast: so soft, yummy, and just right hint of cinnamon sweetness. It is perfect! However we ended with strata, not my favorite. \n\nStaff is extremely friendly here, a family feel.", "rating": 4, "date": "2014-12-27"}, {"excerpts": ["Stand outs are the French Press coffee and the French Toast.  ", "Its more savory than sweet in my opinion and absolutely wonderful.  ", "Its a tight squeeze ", "and you may be asked to share one of several communal tables "], "author": "Mark C.", "review": "My \"new\" go to brunch spot.  I am ashamed to say that I have been in the City now for 4 years and I havent been until just recently!  The restaurant is small and this leads to a wait, so prep for that.  The menu is also relatively small but all of the offerings that I have tried have been wonderful.  Stand outs are the French Press coffee and the French Toast.  Its more savory than sweet in my opinion and absolutely wonderful.  Its a tight squeeze and you may be asked to share one of several communal tables but the vibe is fun and friendly.  \n\nI will definitely recommend and bring all out of towners here.  Its worth it.\n\nI haven't tried dinner here yet, but it's on the to-do list!", "rating": 5, "date": "2013-01-10"}, {"excerpts": ["Blue Bottle coffee from a French press is a great touch while you wait for your food, and the fresh-squeezed O.J. was perfect.\n\n"], "author": "Erich N.", "review": "On a random Sunday, we decided we wanted to try someplace new and chose Olea based on previous reviews. They did not mislead us.\n\nThe menu has a fine selection of breakfast/brunch items, most notable being the Challah French Toast and the omlette, the latter of which changes weekly depending on what vegetables are in season.\n\nBlue Bottle coffee from a French press is a great touch while you wait for your food, and the fresh-squeezed O.J. was perfect.\n\nIt should be noted that if you want a private (versus communal) table, the wait-time looks like it could be rather long...but if you don't mind sharing a big table with other friendly patrons, you might just slip right in as we did.\n\nService was friendly and snappy and the bill was less than I'd have expected for the quality of the fare.\n\nWe'll be back, and we'll bring friends!", "rating": 5, "date": "2012-01-16"}, {"excerpts": ["I also ordered a french press, which was perfect. ", "My server was very helpful - he event discreetly informed me that there was a better way to eat the dish - mix ", "it all up and let the egg yolk cook, instead of the awkward way I was trying to eat it. ", "He made some small talk with me which was nice, since I was the only person in there dining on my own. "], "author": "Naomi H.", "review": "Awesome. I got in a fight with my husband the night before so I snuck out of the hotel room before he woke up to have some \"me\" time. My favorite thing to do on vacation is have solo breakfasts at fantastic places, so it worked out. I ended up finding this little place, and I'm so happy I did! \n\nThe menu is pretty limited, but what they do have looked amazing. In the spirit of trying new things, I had this tomato-based poached eggs thing with mushrooms in it. I also ordered a french press, which was perfect. My server was very helpful - he event discreetly informed me that there was a better way to eat the dish - mix it all up and let the egg yolk cook, instead of the awkward way I was trying to eat it. He made some small talk with me which was nice, since I was the only person in there dining on my own. Friendly service can really go a long way.\n\nMy husband apologized shortly thereafter and we had a fantastic day. :)", "rating": 5, "date": "2012-09-26"}, {"excerpts": ["After some tasty french press coffee I was staring two delicous slices of candy-like custard filled goodness in the face.  "], "author": "Josh B.", "review": "We arrived on a Sunday around 9:45 and were immeadiately able to sit at a family style table with a couple of parties.  When we left around 10:45 there was a pretty good crowd waiting outside so I'd suggest getting here early if you want to get right in.\n\nA lot of farm fresh choices on the menu but the Custard French Toast seemed pretty killer.  After some tasty french press coffee I was staring two delicous slices of candy-like custard filled goodness in the face.  I can confidently say this was the BEST French Toast I have ever had in my life.\n\nService was friendly and prompt, and the setting was intimate.  A great overall brunch experience that I would highly reccomend to anyone.", "rating": 5, "date": "2012-09-02"}, {"excerpts": ["Coffee comes as a French press ($6.50) so that was my only complaint - ", "couldn't get a $2.50 cup of coffee had to buy the whole thing... ", "Kinda pricy. ", "But I would definitely go back. ", "Servers were friendly."], "author": "Amanda M.", "review": "Very good food. I ordered the French toast, side order eggs, and side order bacon and shared it with my 3.5 year old. All three were delicious! Coffee comes as a French press ($6.50) so that was my only complaint - couldn't get a $2.50 cup of coffee had to buy the whole thing... Kinda pricy. But I would definitely go back. Servers were friendly.", "rating": 5, "date": "2015-11-24"}, {"excerpts": ["Blue Bottle coffee \"French press\".  "], "author": "David C M.", "review": "We arrived at Olea Sun AM about 10:30. There were several people waiting out front when we got there. After signing in on the clip board we waited about 15 minutes before being seated.\n\nMenu's arrived quickly as did water. We started with the Med size (about  three cups) Blue Bottle coffee \"French press\".  As other yelpers have indicated, the coffee is smooth, not too bitter ala Starbucks.\n\nFood arrived fairly quickly. We had the popular French Toast, fluffy and very tasty \"the best I've ever had in a restaurant\" according to my wife. I had the \"Eggs Cazualas\"? (two eggs poached in a tomato based sauce), also very good. \n\nThe total bill came to $37 including coffee and \"extra bacon\" (my bad...waiter asked if we wanted extra bacon...I said sure without asking how much...really guys...$5 for 4 strips of bacon???).  Wait staff was friendly and efficient, and everyone including the manager, thanked us for coming in. We will definitely be returning to Olea next time were in the city...I'll skip the extra bacon next time.", "rating": 4, "date": "2011-09-05"}, {"excerpts": ["We split a french press coffee and pot de creme that was cool and thick and decadent.\n\n"], "author": "Littlefish B.", "review": "Very impressed! Recommended. \n\nThough it was our intended destination, it looked closed as we approached and we even stopped at the door to read the hours.  Then we tried the door and discovered it open. The exterior is decorated nicely but maybe some lighting indicating 'open' would help Olea remain in the neighbourhood. \n\nA comfortable, welcoming feel to this place. It reminded me of a family dining room. Maybe Sunday dinner with Aunt Molly? Table manners, good people, familiar conversation, hardwood floor, dark wood table and vase of fresh cut flowers. Some tables for two and a larger one for 8 or 10 in case the neighbors show.  \n\nSemi-open kitchen that told you the chef knew who he was serving (a warm smile and dark eyes above chef whites had greeted us from above the glass as we arrived), but the functionality of the kitchen didn't intrude on my desire to be served & not in the kitchen tonight.  I liked it. \n\nThe glass of Argentinian Melbac was to satisfy a craving tonight, not pair with my yet-unknown order.  So satisfying. Lush, smooth, big without tannins. \n\nPerfectly done flatbread.  Very different presentation with the goat cheese, grilled peaches and greens with oil on the side.  A fun share plate.  Refined flavors.\n\nQuinoa with mushrooms.  My friend ordered.  I'm not sure I even looked at the menu.  Without discernable oil or sauce it could have been dry....and wasn't.  It was a perfect backdrop for the flavorful mushrooms and a slightly bitter green to contrast.  Simple, straight forward, nicely done.\n\nWe split a french press coffee and pot de creme that was cool and thick and decadent.\n\nWe were there for a light meal and between the flatbread, quinoa and dessert we were satisfied.  Now it's up to my friend to keep them going (and introduce as many as she can to it!!) until my next visit to San Francisco.", "rating": 4, "date": "2009-09-11"}, {"excerpts": ["Blue Bottle Coffee in a French Press was a great treat. \n\n"], "author": "Max L.", "review": "Olé, Olé! (cue silly conga music)\n\nNice selections. If I go back I'll try their baked eggs concoction-- it looked wonderful and I saw about three come out of the kitchen and everyone looked happy.\n\nBlue Bottle Coffee in a French Press was a great treat. \n\nI ordered a flat omlet which was, by my def, burned on the bottom.... you know, that brown color that changes the flavour of the eggs. The feta(?) cheese and the potatoes(?) on top were cut into the tiniest cubes I've ever seen in my life. Like even smaller than the cheese samples at Rainbow Grocery. So I wasn't sure what I was eating.\n\nBut the ambiance and conviviality was nice-- especially since it was low drama, low posturing, and there was a pleasant hipster vibe that did not smell and was even semi-welcoming- you know, in a simultaneously purely distancing way.", "rating": 4, "date": "2012-01-21"}, {"excerpts": ["For 2 people:\n1 french press of Blue Bottle\n1 eggs cazuela dish (when we went, it was in a tomato sauce with peas)\n1 french toast\n\nBoom. "], "author": "Sarah Z.", "review": "Came here for brunch while I was visiting a friend in SF. This tiny little restaurant does a pretty good job of serving up a tasty brunch. We got there about 10 minutes before they opened to get in line for one of their 8 (9?) tables. Since we were so early, there were only about 5 groups in line, but it got full within 10 minutes and we saw people who had to wait.\n\nAs far as what to get here, I think it's pretty simple. Recipe as follows:\n\nFor 2 people:\n1 french press of Blue Bottle\n1 eggs cazuela dish (when we went, it was in a tomato sauce with peas)\n1 french toast\n\nBoom. Done. Seriously, the cazuela was really savory and wonderful and the french toast was HEAVENLY little pillows of goodness. Not overly sweet at all. I just wish there had been a few more strawberries.\n\nPortions were quite generous for brunch, but I don't know about dinner. I wouldn't mind coming back to find out.", "rating": 4, "date": "2011-08-27"}, {"excerpts": ["We topped off the meal with the Petite Fours and Blue Bottle coffee (french press).  ", "The entrees are under $20.  ", "This was a top-notch dining experience."], "author": "Ted R.", "review": "Fabulous meal:  shared the pasta w/ veal meatballs and braised beef with a friend, then we had to try the scallops.  OMG!  We've eaten at many wonderful restaurants in SF, from the Embarcadero to Sea Cliff, North Beach to Hayes Valley, the Mission and Potrero Hill, but the food, service and music at Olea was perfect.  Who knew?!\n\nWalk through the hobbit door at the corner of Larkin and California into a small casual-elegant place fit for a date or special treat for a visiting friend or relative.  We topped off the meal with the Petite Fours and Blue Bottle coffee (french press).  The entrees are under $20.  This was a top-notch dining experience.", "rating": 5, "date": "2013-07-26"}, {"excerpts": ["i ordered fresh oj, french press coffee, ", "half order of french toast, and a side of bacon. ", "all of it was really good. ", "it was just enough food for me ", "and i like the sweet / savory combo. ", "the bacon looked burnt when it came out ", "but it was actually really tasty ", "so was fine by me. ", "the french toast was soooo good. "], "author": "Christina H.", "review": "i had such a nice brunch experience at olea- everything from food to service to atmosphere. i got there just before opening and got one of the last tables in the place before the end of the line had to wait until we all finished for the next round. \n\ni ordered fresh oj, french press coffee, half order of french toast, and a side of bacon. all of it was really good. it was just enough food for me and i like the sweet / savory combo. the bacon looked burnt when it came out but it was actually really tasty so was fine by me. the french toast was soooo good. really sweet but hit the spot. \n\nthe place has some regulars which i always appreciate and the manager and server both checked in during the meal. lovely neighborhood spot which i would want to be a regular at if i lived anywhere in the vicinity.", "rating": 4, "date": "2013-09-05"}, {"excerpts": ["French press Blue bottle coffee\n\n", "A huge French press of Blue Bottle coffee is served with your meal which is nice b/c you don't have to keep asking for refills. \n\n"], "author": "Avant R.", "review": "I came here for brunch this past Sunday and ordered the following:\n1. Eggs cazuela\n2. Omelette with potatoes, cauliflower and side of bacon\n3. French press Blue bottle coffee\n\nThe eggs cazuela were delicious!  It reminds me of eggs in purgatory.  Poached like eggs were immersed in a delicious tomato sauce.  Sliced and toasted baguettes were served on the side.  \n\nThe omelette was also very tasty and fresh tasting.  The bacon (I believe it's Niman Ranch bacon) was cooked perfectly (I don't like the fat uncooked and not crispy.)  \n\nA huge French press of Blue Bottle coffee is served with your meal which is nice b/c you don't have to keep asking for refills. \n\nIn addition to great food, I love the fact that they use organic, sustainable products.\n\nOne star minus for okay service but they were pretty slammed.  Be prepared to write your name in and wait for a bit.  On a beautiful day in SF, it's not so bad unless you are starving!", "rating": 4, "date": "2012-06-11"}, {"excerpts": ["We got the French press - they serve blue bottle coffee!!! ", "And I got sherry steamed clams. ", "Minus the heat of sitting by the kitchen which magnified my ordeal, the meal was perfect. ", "Really recommend -such a lovely neighborhood brunch spot!"], "author": "becca w.", "review": "Awesome new random ass find!!!!! We followed an apt listing to this block and was lucky to find parking right outside this restaurant. After looking at the apt my husband and I decided to check out the neighborhood to get a feel for what life here would b like. It was a gorgeous balmy 78 degree day in sf, great for a stroll right? Nope - cuz I was retarded and wore a big thick heavy wooly sweater instead of layering.  After 2 blocks I melted and could go no further and turned bak. Desperate for food and water, ice cold water we stopped in olea for food.\n\nSmall cramped seating but sooo charming. Great food and really wonderful staff. We got the French press - they serve blue bottle coffee!!! And I got sherry steamed clams. Minus the heat of sitting by the kitchen which magnified my ordeal, the meal was perfect. Really recommend -such a lovely neighborhood brunch spot!", "rating": 4, "date": "2010-11-27"}, {"excerpts": ["My friend raved about her french press coffee and garlic fries.  ", "We were very tempted to make a return visit there just for the coffee.  ", "They change their menu weekly and have a daily fresh bread picked up from a local bakery.  "], "author": "Melissa F.", "review": "Olea was a great  find on my first trip to San Francisco.  Approaching the restaurant on foot the area seemed a bit sketchy, but I was immediately relieved of any apprehensions upon walking in . It was nice to visit a restaurant that was not overrun with tourists and had a great local neighborhood vibe.\n\nThe interior was cozy and  very inviting.  Service was friendly and attentive.  I had a light breakfast consisting of yogurt, granola, agave honey, and a mimosa.  My friend raved about her french press coffee and garlic fries.  We were very tempted to make a return visit there just for the coffee.  They change their menu weekly and have a daily fresh bread picked up from a local bakery.  We arrived early, so we were able to be seated immediately. \n\nI felt like it provided a glimpse into the life of a local and I hope to re-visit my next trip.", "rating": 4, "date": "2011-04-02"}, {"excerpts": ["Blue Bottle Coffee was nicely served in a french press, your choice of 2 or 4 cups. ", "One downside is that one cannot order coffee while you wait for a table. "], "author": "Cindy W.", "review": "Came for brunch with some out of town visitors and luckily Olea did not disappoint. Small corner restaurant in Nob Hill, we were drooling from the wafting aromas emitting as we waited for our party to arrive. And yes, EVERYONE must be present in order to get seated. With only 1 large table, groups larger than 4 or 5 really can be a challenge in this small space. \n\nthe FOOD - yes, agree with yelpers that Challah Custard Toast ($10.75) was delicious. Two thick slices of challah bread are immersed in a vanilla egg milk mixture and then fried or baked to a nice golden brown. Cinnamon and sugar sprinkled across the top, finished with strawberries, made for a very fluffy light french toast. \n\nI complimented my sweet carbs with a side of bacon ($4.75), where I had 5 crisp bacon strips that was plenty to share with the table.\n\nI also had a bite of the Baked Eggs Cazuela ($11.75). Cazuela is a S. American soup which Olea gave its own interpretations to. It was tangy warm and a nice change from the usual brunch items.\n\nBlue Bottle Coffee was nicely served in a french press, your choice of 2 or 4 cups. One downside is that one cannot order coffee while you wait for a table. You must actually be seated to get some morning wake up fuel.\n\nOverall, great food and atmosphere though they are a stickler for rules. Oh, and they don't take AmEx.", "rating": 4, "date": "2010-08-29"}, {"excerpts": ["After hearing good things, my bf and I popped in and shared the challah custard french toast, a pulled pork sandwich with fries, and a french press of Blue Bottle Coffee. \n\n"], "author": "Ashley S.", "review": "What a great little brunch place. \n\nAfter hearing good things, my bf and I popped in and shared the challah custard french toast, a pulled pork sandwich with fries, and a french press of Blue Bottle Coffee. \n\nThe portions were moderate, but everything was tasty and incredibly filling! The menu changes frequently and focuses on sustainable, local, and seasonal produce. \n\nThere are only about 7 small tables and one larger communal table so I would not recommend this place for large groups. If you are however in the lower nob hill area with one or two people, and would like a delicious low-key brunch definitely check it out!!", "rating": 4, "date": "2010-11-28"}, {"excerpts": ["Their blue bottle coffee in a french press and you can ask for Stevia.  ", "The baked eggs were amazing as well (this time it was served with chorizo, kale, and yukon potatoes).  ", "Olea is still one of my favorite brunch places in the city!"], "author": "Carli F.", "review": "It's been awhile since I've paid a visit to Olea, but I was definitely pleased.  We only had to wait for a little bit on a Saturday morning.  The french toast was still amazing (must order).  Their blue bottle coffee in a french press and you can ask for Stevia.  The baked eggs were amazing as well (this time it was served with chorizo, kale, and yukon potatoes).  Olea is still one of my favorite brunch places in the city!", "rating": 4, "date": "2012-04-24"}, {"excerpts": ["And as everyone else has said, amazing French press coffee. \n"], "author": "Danish H.", "review": "Great brunch spot. Limited seating, usually a wait, but not too bad. Party of 4 seated in under 30 mins late Sunday. \nChallah custard toast w strawberries was delicious. Friends had the  scrabled egg on acme bread roll, and eggs baked in cazuela (which is a mexican clay dish). All fantastic. \nAnd as everyone else has said, amazing French press coffee. \nGood service and reasonably priced. \n\nThey don't take Amex however.", "rating": 4, "date": "2011-03-28"}, {"excerpts": ["My friends all got Blue Blottle coffee in a French Press and said it was great.\n\n"], "author": "Jackie C.", "review": "Great for brunch. The challah custard toast (French toast) was the best I've ever had -- not too sweet, which is my usual complaint about French toast; very fluffy and light; and served with pear slices (a nice contrast to the sweetness of the cinnamon sprinkled all over it and the side of maple syrup). My friends all got Blue Blottle coffee in a French Press and said it was great.\n\nThe atmosphere is also really cute. It's very friendly and homey feeling, and classy without being stuffy or uncomfortable.\n\nOnly downside is the long wait (I usually go early -- around 11am -- or late -- around 1pm -- to avoid the line) and priciness.", "rating": 4, "date": "2010-12-14"}, {"excerpts": ["Do have the French press coffee, always a treat when done right."], "author": "Thomas C.", "review": "Expect a line on Sunday morning. We ended up waiting about a half hour for a two top. They'll try to accommodate groups but due to the size and table limitations, this is not a good place with a large party. \n\nThe menu was creative but a lot of the dishes seemed very similar so veto factor might be an issue for some. I had the flat omelet with Italian sausage, ricotta and farro. Somewhat bland in terms of flavor but not unappealing and it was a healthy sized portion. The dish could have used some vegetables of sorts to add more flavor and color. \n\nThe wait staff was friendly and quick. Do have the French press coffee, always a treat when done right.", "rating": 3, "date": "2011-06-12"}, {"excerpts": ["Blue bottle french press and great service are also a plus!"], "author": "Jenna W.", "review": "Best french toast I've ever had in my life. Hands. down. \n\nBlue bottle french press and great service are also a plus!", "rating": 5, "date": "2011-03-25"}, {"excerpts": ["Add a french press of Blue Bottle to the mix, along with the perfect companion and a sunny Sunday morning with a modest wait, and you have yerself the start to a right-fine day. \n\n"], "author": "Jon L.", "review": "It's true, their french toast is some of the most fantastic in all the land. Add a french press of Blue Bottle to the mix, along with the perfect companion and a sunny Sunday morning with a modest wait, and you have yerself the start to a right-fine day. \n\nHaving done this twice now, I can confirm its positive effects.\n\nMight I suggest you continue it as we did by hopping the California St. Streetcar down to the ferry building, where you can equip yourself with wine, cheese, chocolate, bread and fruit and make your way up to golden gate park for an amazing picnic, then down to Sutro's for a cocktail with a view.\n\nGood day.", "rating": 5, "date": "2009-06-29"}, {"excerpts": ["Hubby went ga-ga over the blue bottle coffee (3 Africans' variety) that they serve via french press, and he had to have the \"life changing\" french toast. "], "author": "Victoria S.", "review": "A small place, with really only a couple of seating options for our party of 4, we ended up sharing the large \"community table\" they have just by the windows and front door.\n\nHubby went ga-ga over the blue bottle coffee (3 Africans' variety) that they serve via french press, and he had to have the \"life changing\" french toast. (Which, I have to admit, were amazingly light - for french toast - and deliciously custardy.)\n\nI had the eggs baked in a little crockery (some name I couldn't remember) with a tomato sauce and a little sausage for added flavor... The crockery actually keeps them cooking while they're waiting to be eaten - so you can decide how firm you like your eggs.  YUM!\n\nWorth a visit - and I guess worth getting there a little early on a Sunday. While we didn't have to wait more than a few mins - when we left the wait was camped out on the sidewalk outside a block up the street.", "rating": 4, "date": "2010-02-06"}, {"excerpts": ["Blue bottle coffee was served in a 2 cup French press.  ", "Something about the French Press makes it taste that much better.  ", "Highly recommended for Sunday brunch.  ", "No wait."], "author": "Lee B.", "review": "Excellent French Toast here at Olea!   The service was fast and friendly.   Blue bottle coffee was served in a 2 cup French press.  Something about the French Press makes it taste that much better.  Highly recommended for Sunday brunch.  No wait.", "rating": 5, "date": "2010-09-14"}, {"excerpts": ["The french press coffee hit the spot and was the perfect size for two people. "], "author": "Zeke A.", "review": "One of the best brunches I've had so far in San Francisco. This place is quaint and cozy. It's really small, so there's not a lot of seating and there was a wait. We sat at a communal table which was fine. We were just excited to try a new place for brunch.\n\nI ordered a delicious omelette with yummy veggies and cheese. The side salad had a bit too much dressing, but was still good. The french press coffee hit the spot and was the perfect size for two people. My friend had an egg sandwich that she devoured so quickly and happily. \n\nThe staff was funny and friendly - a bit quirky, but hey you're close to Polk St so it is what it is!\n\nThe only problem was that the creamer for the coffee had little bits of dust and crap in it. I don't understand why so many places leave their creamer sitting around uncovered...that's just plain nasty. They gave us some fresh creamer right away so it was fine.\n\nPerfect place for brunch - totally check it out!", "rating": 4, "date": "2009-09-06"}, {"excerpts": ["While we did not have wine, we did have a fresh squeezed orange juice and a french press of Blue Bottle coffee.  ", "Nob Hillers, come here for your Blue Bottle coffee fix.  ", "Also, the fresh squeezed oj is among the best I have had in San Francisco.  "], "author": "apple r.", "review": "What a cute place, a bit hidden in Nob Hill.  I came here with a friend for Sunday brunch and it was a delightful experience.  My friend is a regular here and knows everyone.  When he comes in, they plop a fresh squeezed orange juice in front of him and make him a special meal.  Not to be excluded, I also ordered the same meal.\n\nThe atmosphere here is cute and pleasant.  It has good lighting, a nice open kitchen, small tables, a few plants, and a large shared table.  I don't know if they have wifi here, but if they do I would like to come here to do work and hang out.\n\nI noticed a wall of lovely wine and champagne glassware on the side wall, which is a nice addition.  While I didn't have wine, next time I will.  I did not notice a wine list on the menu, so I recommend presenting one to extend the bottom line for this restaurant.\n\nWhile we did not have wine, we did have a fresh squeezed orange juice and a french press of Blue Bottle coffee.  Nob Hillers, come here for your Blue Bottle coffee fix.  Also, the fresh squeezed oj is among the best I have had in San Francisco.  Olea, what kind of oranges are you squeezing?\n\nOur meal was a flat omelette with shreds of pepper, a wheat grain, avocado, and cheese.  The food was very light and incorporated a combination of subtle flavors.  If I had to describe the food here in one word, I would describe it as subtle.  \n\nThe menu here changes a bit every week, although I believe there are a few standard items.  I noticed a neighbor eating an egg dish with tortilla chips in it which I will have to try next time.  We also had crispy fries, which are like the fries they have in France.  Thin and slightly crispy.  Olea, will you consider making mussels so I can have Moules Frites with you?\n\nA great experience.  Everyone here is so friendly.  I want to be a regular here.  Perhaps next time I am here, they will plop an apple juice in front of me.", "rating": 4, "date": "2009-03-02"}, {"excerpts": ["We also got sides of toast and bacon, french press coffee, and bf got the fresh orange juice.\n\n"], "author": "Amanda C.", "review": "The moment you see Olea -or even see the menu online- you realize this place is unique. The restaurant space is pretty tiny, the door resembles the portal from Being John Malkovich, and the selection of food is meticulously local and seasonal. It looks like a neighborhood spot featuring a menu with city-wide appeal. \n\nWe went for brunch this morning, but I'm sure we'll be back for dinner since we just moved to Nob Hill. Boyfriend got the french toast (per my recommendation, per Yelpers' recommendations) and I got a flat omelet with fingerling potatoes, dandelion greens, onions, and pecorino cheese. We also got sides of toast and bacon, french press coffee, and bf got the fresh orange juice.\n\nCan I just say... the french toast was phenomenal. I'm tempted to use expletives to convey my zealous lust for this \"custard toast,\" but I think you'll get the drift with g-rated language. It was sinful, perfect, and absolutely incomparable with most french toast on earth. It is by no means good for you (I think -I KNOW- I've had healthier desserts), which is why I let my boyfriend order it, but HOLY crap is it worth the calories. I'm not sure I'd ever get it for myself because I'd likely polish off an entire order, but if someone is willing to split I say \"do it!\" Do it.\n\nFlat omelet was good... it reminded me of something a chef would make himself for breakfast. In comparison to the french toast, it was just alright, but that's not really a fair comparison. Especially because it's so much better for you and not covered in cinnamon-sugar. \n\nAlso, the side of toast is really cute... as opposed to most breakfast places that give you 2 pieces of toasted bread, it's sort of like a bread basket at dinner. There were 2 types of bread (challah and something else like sourdough) lightly toasted served with butter and jam on the plate.", "rating": 4, "date": "2009-05-31"}, {"excerpts": ["The French press coffee is a must as well. \n\n"], "author": "Daryl E.", "review": "Yup, brunch at Olea is all it's cracked up to be. \n\nThe French Toast is indeed some of the best you'll have, the inner depths that perfect warm, chewy texture that only moms seem to know how to achieve. \n\nThe egg, bacon, and tomato sandwich was delicious--eggs cooked to just-this-side-of-runny perfection, thick, lean bacon, fresh tomato slices, all packed between nice chewy bread with a crisp outer crust.  How they manage to keep this from turning into a greasy heap is beyond me.\n\nThe French press coffee is a must as well. \n\nService was fast and friendly.  Fresh food enjoyed with a fresh breeze from outside--this is a good way to wake up.", "rating": 4, "date": "2009-02-07"}, {"excerpts": ["Coffee is french press and you should get the large pot for 2 people.  ", "Service was good.  ", "There's no table list, so you have to wait in line which is a bit annoying.  ", "But we did get a table for 2 in about 20 min on a Saturday morning.  ", "A good find."], "author": "Jordan W.", "review": "On our server's recommendation we had the cazuela (Baked Eggs, pork, bacon, spinach, tomatilla Sauce, Tortilla Chips, Parmesan Cheese), the migas con huevos (Soft Scrambled Eggs w/ house made turkey sausage, sauteed kale, roast eggplant, Tortilla Chips, Ancho Pepper Sauce, Sesame Seeds).  We finished with the challah custard toast.  The migas was great, but the ancho sauce was a bit over powering.  The cazuela was outstanding.  Flavorful and nicely balanced.  The challah toast was a great way to finish the meal, really rich.  Coffee is french press and you should get the large pot for 2 people.  Service was good.  There's no table list, so you have to wait in line which is a bit annoying.  But we did get a table for 2 in about 20 min on a Saturday morning.  A good find.", "rating": 4, "date": "2014-07-20"}, {"excerpts": ["French press Blue Bottle is a nice touch."], "author": "Vandana M.", "review": "Yummy spot. It's tiny, so be prepared to wait, especially for brunch.\n\nI ordered the omelet with tomato, spinach, and feta. Mmm. I also liked that the \"side of toast\" I ordered came with three different varieties of bread.\n\nFrench press Blue Bottle is a nice touch.", "rating": 4, "date": "2009-08-30"}, {"excerpts": ["I loved that it boasts fresh produce, Blue Bottle Coffee (in a french press!!), and a small menu (I hate when small restaurants try to do EVERYTHING.. "], "author": "Tammy S.", "review": "Yelp really needs to implement a half star system. I'd give this place a 3.5, but not quite a 4. \n\nSuper cute and cozy little eatery.. I loved that it boasts fresh produce, Blue Bottle Coffee (in a french press!!), and a small menu (I hate when small restaurants try to do EVERYTHING.. I love that the menu is selective but good).\n\nWe started with mimosas (made with fresh squeezed oj -- even a little plup!).. then I danced between ordering the sweet French Toast & Flat Omelet, but last minute, chose the latter.. I knew I should have gone with my first instinct!! I had food envy the entire time!\n\nThe flat omelet had pesto, potatoes, chicken and asiago cheese. It was a bit uneventful and needed doses of crushed pepper and sea salt.. \n\nI'll give this cute place another shot to satisfy my taste buds, since everything else seemed so good & service was friendly.. upon seeing all the other reviews, I think the french toast might give me what I'm looking for.", "rating": 4, "date": "2009-11-02"}, {"excerpts": ["And the coffee, served in a french press, was the perfect compliment to this meal.  ", "For some, this might not be ideal, as not everyone likes the the french press.  "], "author": "Joseph N.", "review": "One of my favorite breakfast combinations anywhere is is french toast, a side of bacon, and coffee.  Olea happens to do this combo insanely well.\n\nThe challah french toast is amazing.  I prefer it to the french toast at Mama's, which is saying a lot.  It's a big portion, it's cooked and garnished appropriately, and it's oh-so-good.\n\nMy side of bacon wasn't crazy good, but it was certainly a cut above your run-of-the-mill bacon, and they gave a sizable amount.  It was cooked right, firm but not burnt to a crisp.\n\nAnd the coffee, served in a french press, was the perfect compliment to this meal.  For some, this might not be ideal, as not everyone likes the the french press.  But good coffee is good coffee, whether it's press or drip, and they serve good coffee here.\n\nPrices were reasonable, service was good, and the decor/atmosphere was pleasant.  I met a friend here for brunch on a Saturday around 11:00 or 11:30.  We didn't have to wait, which was nice although that might have been a rarity.  I'll definitely be back.", "rating": 5, "date": "2009-05-06"}, {"excerpts": ["The coffee came in a french press for either 2 cups or 4 cups. ", "The meal was very pleasant the the staff is extremeley attentive and friendly. ", "I recommend this place if you are looking for a brunch place with some more creative options than the typical breakfast fare."], "author": "Debbie C.", "review": "What a cut little neighborhood brunch spot! I have to admit our waiter may be right when he said they had the best french toast in San Francisco. Perfectly moist with just the right amount of sweetness. There was no wait for brunch on a Saturday afternoon and the prices are reasonable (brunch items averaging about $11-12). I was also excited to see that they serve coffee from the Blue Bottle Coffee Company. Blue Bottle is known as the \"Microroasters of organic and shade grown coffee\". The coffee came in a french press for either 2 cups or 4 cups. The meal was very pleasant the the staff is extremeley attentive and friendly. I recommend this place if you are looking for a brunch place with some more creative options than the typical breakfast fare.", "rating": 4, "date": "2009-03-14"}, {"excerpts": ["The coffee is served in a French press for two or four people, and this is always a reliable way to make very good coffee. ", "Juices are fresh squeezed. "], "author": "Shawn S.", "review": "It's always sad when one of your regular joints closes its doors for good, but that's life in the city. When it happens, you can only hope that the next business to open in the same spot is a deserving successor. Maybe this is why some seemingly prime locations seem to be cursed - a favorite business shuts down, and then the locals eye each successive venture with suspicion, giving the owners the stink-eye at every opportunity and generally spreading ill will about the place.\n\nIn this case, I'm talking about the Red Door Cafe. It was a humble and charming place, with mismatching furniture and chipped pottery, but it was one of my favorite breakfast spots in the city because the food was good, parking spaces were generally plentiful, and I never had to contend with a line stretching around the block (rare in this city when you're talking about good breakfast on a Saturday or Sunday morning).\n\nAnyway, this is a long way of introducing Olea, the successor to the Red Door. What it lacks in the Red Door's humility and charm, it more than makes up for with an obvious dedication to the fine details of breakfastry.\n\nThe menu is small and changes weekly - a thing I always love. The coffee is served in a French press for two or four people, and this is always a reliable way to make very good coffee. Juices are fresh squeezed. The bread and other baked items are fantastic, and the main courses are carefully crafted and perfectly prepared.\n\nAs a bonus, parking is still pretty easy, and there's not usually any line at all.", "rating": 5, "date": "2008-06-03"}, {"excerpts": ["Personal french press for every table with steaming hot fresh everything. \n\n"], "author": "Roxmarie M.", "review": "If you like coffee this is the place to have brunch. Personal french press for every table with steaming hot fresh everything. \n\nThe service is extremely nice and the place never feels hectic since it has so few tables. The french toast is slabalicious, the egg and bacon sandwich sublime, and I am not a breakfast person but I'd go back there any time. Excited to try lunch and dinner now. Shhhhh!", "rating": 5, "date": "2008-01-31"}, {"excerpts": ["I'm a big fan of Blue Bottle coffee and loved the French press option here! ", "Cozy ambience, service could be a bit faster. ", "Only peeve is that the menu is limited, especially a bit of a dampener if you don't eat meat but want to eat scrambled eggs, there's not too much they can offer."], "author": "Shweta V.", "review": "Another great find thanks to Yelp! Loved the food here - I tried the scrambled eggs on roll with tomato and my husband tried the migas con huevos - food tasted fresh and eggs were delicious. I'm a big fan of Blue Bottle coffee and loved the French press option here! Cozy ambience, service could be a bit faster. Only peeve is that the menu is limited, especially a bit of a dampener if you don't eat meat but want to eat scrambled eggs, there's not too much they can offer.", "rating": 4, "date": "2011-04-05"}, {"excerpts": ["My absolute favorite touch was the french press coffee pot at table.  ", "Nothing as perfect as a cup of french pressed in the morning with the full pure flavor and aroma of great coffee with the glisten of the bean oil floating faintly on the surface.  ", "mmm mmm mmm - heavenly.  ", "I am just a breath away on this side of the thin veil of imagination of being able to really smell it.  "], "author": "Kathleen K.", "review": "I think they bill their fare as California/Mediterranean.  I had this wonderful baked egg dish (you'll see it on the menu) and since we have both chickens and eggs in Calfornia, as well as in the Mediterranean countries, I guess they bill themselves correctly.  :)  The bread was fresh and homemade and simply perfect.  I don't typically eat much breads, but oh oh oh, don't pass it by.  My dish also came with a little salad that tasted of the fresh organic of the backyard garden-grown variety.  You could just taste the freshness.\n\nMy absolute favorite touch was the french press coffee pot at table.  Nothing as perfect as a cup of french pressed in the morning with the full pure flavor and aroma of great coffee with the glisten of the bean oil floating faintly on the surface.  mmm mmm mmm - heavenly.  I am just a breath away on this side of the thin veil of imagination of being able to really smell it.  It's lingering in my mind no doubt.  \n\nThe space is on the (super) small side but if you are patient or can get right in, jump on it.  This is truly a cute little gem of a joint with a super simple menu and very fresh fresh fresh ingredients.  Not to be passed by.  I spyed the dinner menu and really want to swing by one evening to give it a sampling.  I am suspecting there won't be any disappointment. \n\nThe menu (both brunch and dinner) was nice and simple and straight up.  Nice friendly service and considering the space, they were very mindful of not being too in your face every second.", "rating": 4, "date": "2008-05-25"}, {"excerpts": ["They get one extra star for serving me tasty coffee in my own mini (but not tiny) French press.\n\n"], "author": "Dan S.", "review": "Olea approaches breakfast the way many places approach dinner -- small portions of expensive, extremely tasty food. This is such a badly thought out and misguided approach to breakfast that I have difficulty putting it into words. EPIC FAIL, I guess.\n\n$10.95 for two pieces of French toast with a tiny ramekin of strawberries? Give me a break.\n\nThey get one extra star for serving me tasty coffee in my own mini (but not tiny) French press.\n\nNever going back.", "rating": 2, "date": "2008-10-19"}, {"excerpts": ["But what was good about this place is the french press coffee which was just great! "], "author": "Kaushick N.", "review": "Food was ok. I had the Pork pulled sandwich and wife had the French toast. My sandwich was 6/10 and the french toast felt like it was a little undercooked. But what was good about this place is the french press coffee which was just great! Service was pretty good as well. \n\nThe place is very small so we had to wait for about 30 mins for a table on a Sunday. When we finally got a table we were not too happy about sharing our table with another person. They made a lady site right next to us and it was like we were having brunch with her. They only have a few tables so expect to share.", "rating": 3, "date": "2009-03-23"}, {"excerpts": ["Big on coffee and french toast: french press and brioche french....", "hmmmmmmmm....", "I want it now!\n", "In addition, the kitchen is wide open and the chef is present, how convenient to thank him! ", "And the server was nothing but the best as well!\n", "Think i'll make it a point to go to Olea every time I hit the city!"], "author": "Monique C.", "review": "Yes, that's right! \"As good as it gets!\"\nNot quite sure if it was the intimate, petite atmosphere that we embellished or the exquisite yet, select menu we encountered. By \"select\" I mean, the chef changes the menu weekly, if not daily. He creates his menu around the fresh veggies, herbs and delicacies he finds at the farmers market. I couldn't tell you what to order  because it changes everyday! And I must say, everything is lovely.\nDinner was so enchanting, we decided to come back for breakfast!\nBig on coffee and french toast: french press and brioche french....hmmmmmmmm....I want it now!\nIn addition, the kitchen is wide open and the chef is present, how convenient to thank him! And the server was nothing but the best as well!\nThink i'll make it a point to go to Olea every time I hit the city!", "rating": 5, "date": "2010-04-25"}, {"excerpts": ["Blue Bottle french press is always a plus.\n\n"], "author": "Josh G.", "review": "Dinner serves a great burger, epic quinoa and everything in-between. The pork shoulder leaves no room for improvement, save more bites. Atmosphere makes for the perfect 'hey nice but low-key' date spot.\n\nBrunch is unbeatable - try the Umbrian Faro Salad if you're a foodie. Blue Bottle french press is always a plus.\n\nWater snobs will stoked that they serve Lauratana. It's the best!", "rating": 5, "date": "2012-01-30"}, {"excerpts": ["All you need to know is: order the french toast (everyone around us was getting it too) and coffee drinkers get blue bottle in a french press (2 or 4 cup).   ", "SO GOOD.  ", "The room is simple, full of light (for being a few steps down), and welcoming, with friendly service used to the descending brunching crowds.  ", "If I lived in SF I'd be here every weekend."], "author": "Monica M.", "review": "It was a lucky morning when my SF travel companion and I walked past Olea and saw the crowds waiting outside.  \"This is a place we should probably try,\" one of us decided, and so we went back the next day, bright and early. Yes, Olea is tiny and if you don't go first thing there will be a wait.  But what do you expect?  It's cozy and delicious!  \n\nAll you need to know is: order the french toast (everyone around us was getting it too) and coffee drinkers get blue bottle in a french press (2 or 4 cup).   SO GOOD.  The room is simple, full of light (for being a few steps down), and welcoming, with friendly service used to the descending brunching crowds.  If I lived in SF I'd be here every weekend.", "rating": 5, "date": "2009-10-30"}, {"excerpts": ["Also, no drip coffee, only french press for two, but it is delicous!"], "author": "Netty L.", "review": "I had what I call a \"fancy mcmuffin\" here. Scrambled eggs with bacon on artisanal bread with tomatoes. Oh my god, it was perfect. Great with salt and pepper (although I wish I didn't have to ask for pepper from the server). \n\nAlso, no drip coffee, only french press for two, but it is delicous!", "rating": 4, "date": "2008-05-09"}, {"excerpts": ["Fallowed by a French press of blue bottle coffee and an amazing French shortcake with figs and strawberries. ", "The wine list was something to be desired but right on point with the daily menu. ", "We chose this place over fluer de lys and are thrilled we did so. ", "Make sure to visit this place whenever you're in the bay area!!!!"], "author": "Erin D.", "review": "What a gem!! My husband and I found this place via yelp reviews and it happened to be 6 blocks from our hotel. The place holds 24 people tops. The chef/owner prepares everything that hits the table so you know it'll be good! We opted for the clams and osso bucco to share. Both dishes were delicious but the blood sweat and tears that went into the osso were well worth it!!! Creamy polenta and bone marrow make my heart skip a beat. Fallowed by a French press of blue bottle coffee and an amazing French shortcake with figs and strawberries. The wine list was something to be desired but right on point with the daily menu. We chose this place over fluer de lys and are thrilled we did so. Make sure to visit this place whenever you're in the bay area!!!!", "rating": 5, "date": "2011-06-23"}, {"excerpts": ["Get some house made hot sauce to put on your omelet and enjoy your French press coffee.  ", "This is the real deal!"], "author": "Mark J.", "review": "Staying at Mark Hopkins hotel.  We walked 5 nice blocks down street and waited 10 minutes for a table.  We would have been willing to wait an hour had we known how good the food is.  Eat here, period.  The food is outstanding.  Get some house made hot sauce to put on your omelet and enjoy your French press coffee.  This is the real deal!", "rating": 5, "date": "2010-12-11"}, {"excerpts": ["And, did I here Blue Bottle coffee is served there as well in a French press brought to your table?!  "], "author": "Ben T.", "review": "Brunch is definitely my favorite meal of the week, and Olea delivers.  Why else would I wait 20min in the rain for a table on a hung-over Saturday morning?!  I had the cazuela (hispanic ramekin)-baked eggs covered in warm and spicy tomato sauce, with steamed farro, applewood smoked ham and basil almond pesto.  It definitely hit the spot and continues to be my favorite dish there.  And, did I here Blue Bottle coffee is served there as well in a French press brought to your table?!  Yeah, that's right, this meal was definitely my manna. \n\nI also came back for dinner on a Saturday night and was pleasantly surprised to find that there wasn't a wait, given how small the place is.  I tried the pan-seared duck breast, which was cooked too perfection.  The meat was tender without being raw; the seasoning was flavorful and contrasted nicely with the duck and japonica rice.  They must have ran out of the asparagus, because my plate came out with oven-roasted brussel sprouts instead, which were a little on the bitter side (unless you properly core brussel sprouts, parboil and then bake with salt and pepper, you're gonna get bitter brussels sprouts....just saying).  My partner had the pollock, which wasn't anything spectacular in my opinion, but tasted fresh and tender.  The orange cornmeal cake we shared for dessert was also good, but nothing that was too out of the ordinary--cornmeal is not quite my cup of tea, but the orange flavor provided a nice contrast and so what you end up noticing is that the cake has a different consistency than if made with purely flour....meh\n\nAs for the service, the waitress and the host are incredibly sweet and will chat you up about anything.  The place is smaller, so be prepared to wait, though they do take reservations (for dinner at least).  Definitely come here first for brunch (5 stars) and then if you're in the area and can't find any place else, check out Olea for dinner (4 stars).", "rating": 5, "date": "2010-12-07"}, {"excerpts": ["They have Blue Bottle Coffee, which they bring to your table in a french press.  ", "The server cracked us up (unintentionally) telling us to wait 180 seconds before pressing and pouring the coffee...why not just say a few minutes?!  "], "author": "Mara L.", "review": "I wouldn't say I am a HUGE fan of Olea, but I am certainly a fan.  It's original, like no other brunch spot I have been to in the city.\n\nI love walking down the steps into this cozy little restaurant.  I would say that it feels like home, but it's so much better decorated than any home I have ever known.  Almost looks like Martha Stewart had a hand in it.  Jack Johnson tunes fill the air (both times I have been there).  This might normally be kind of irritating, but it fits the mood of the place...kinda swanky, but not stuffy.  \n\nAdmittedly, I have only been there for brunch.  They have a very limited menu, but everything that I have eaten is tasty and unique.  Flat omelets, AMAZING french toast, egg bakes...different each time, but always yum.  Get different things and share, so that you don't have to commit.  They have Blue Bottle Coffee, which they bring to your table in a french press.  The server cracked us up (unintentionally) telling us to wait 180 seconds before pressing and pouring the coffee...why not just say a few minutes?!  Anyhow, this is good stuff, apparently $20 a pound, and the difference is noticeable.      \n\nWhat I don't particularly like about Olea is that you get what they give you.  I tried to order wheat toast, and they only had a toast plate (for sharing) with whatever they thought looked good that morning...a composite of challah, sourdough and a darker toast with nuts in it.  Don't get me wrong, it was good, but not exactly what I was hoping for.  And, this is not stated anywhere on the memo, so the first time you go, you inevitably feel like you didn't get the memo.  You have to ask for skim milk, which they will bring you, but not without making you feel like it's a bit of an odd request.  Don't even think about asking for sugar substitute...it's raw sugar cubes or nothing.  I have to remember to bring my own next time.\n\nAs far as value, I have never left feeling ripped off, but the place isn't cheap.  The serving sizes are modest, but they do the trick...this last time I left very satisfied (the french toast is filling).  Brunch menu items are about $12 or $13 bucks, and then add in coffee, toast, french fries (the closest you can get to homefries or hashbrowns) and/or bacon, and it can easily get you up to or above $20 per person.  Typically, this much would buy a decent breakfast, toast and potatoes included, plus coffee AND a mimosa, but you're paying for quality and ambiance.  I suppose I am okay with that.  \n\nThis certainly isn't your every weekend brunch spot, but it's great for a special occasion or for a treat when friends are in town.  OH, and it's a small place, not a lot of tables, SO GET THERE EARLY OR CALL FOR A RESERVATION (only available for groups of 6 or more).  And, keep in mind that they won't seat you without your entire group.  Be prepared to spend some time hanging out on the steps just inside the door drooling over everyone's food or standing on the corner of California and Larkin.  Perhaps because the food comes quickly, tables turn over reasonably fast.  Though, my friend and I did almost have words with a girl who stood up, put on her jacket and purse and then sat back down to slow play the paying of the check.  We were hungry.\n\nThe host said they are very happy with their brunch service, but are struggling a bit more with dinner.  I would imagine the food is just as good, though probably a bit more expensive.  If you're looking for a nice dinner without the huge wait that comes with upscale SF restaurants, check it out!", "rating": 4, "date": "2009-03-16"}, {"excerpts": ["We also had a glass of very pulpy, freshly squeezed orange juice, and the french press coffee for two.  ", "Both were quite tasty and fairly priced.  "], "author": "Dave N.", "review": "We FINALLY tried Olea after hearing good things about it on yelp and walking by it many times.  Got to the point of peeking in and looking at the menu in the window, but never quite pulled the trigger.\n\nThis neighborhood definitely needs more decent eateries, especially since Ti Piacera down the street is really not that great.  I'd say that the closest competition is literally right down the street-- Nob Hill Grill.  \n\nThough it's open for dinner, it seems that Olea has established itself as a brunch hotspot.  On a Saturday around noon, it was crowded enough that they have a sign up sheet and there is often a wait.  The place itself is quite small with limited seating, though they have smartly put in a community table that seats ten.  We didn't mind eating at this table at all.\n\nThe brunch menu is not very large either, but at least the selections are well selected with a decent variety.  I had the pulled pork sandwich, and my brunch companion had the scrambled eggs and bacon on a roll.  The pulled pork came with some delicious, perfectly done fries and the egg sandwich came with a tasty, fresh side salad.\n\nThe egg sandwich was pretty good, and the eggs were fluffy and tasted fresh.  The sandwich itself was a bit on the petite side, but tasty.\n\nThe pulled pork sandwich was not anywhere near as good as I've had, however.  It tasty vinegary.  We determined that it was some sort of sauce that they put on the bun and not the pulled pork filling itself.\n\nWe also had a glass of very pulpy, freshly squeezed orange juice, and the french press coffee for two.  Both were quite tasty and fairly priced.  Service was good, and we didn't have to wait long for our food, either.\n\nOverall, I'd say that this place is pretty decent, but it doesn't knock your socks off.  Compared to places like Brenda's, Zazie, and Ella's, the brunch food doesn't quite match up... but the location is good and the wait isn't long like those other places.", "rating": 3, "date": "2010-03-28"}, {"excerpts": ["Great blue bottle french press coffee and OJ. ", "Great meals ", "both times I've been here - I've had the challah french toast, which is magical, and probably the best french toast I've ever ordered, as well as one of their egg cazuela dishes that was quite tasty, and interesting. ", "The menu isn't too large (which is probably the only reason its a 4 star instead of a 5 star for me), so to keep it fresh ", "I'd probably only brunch here every other month, but I plan to keep on returning."], "author": "Kelly B.", "review": "A very enjoyable place for a weekend brunch. I've been here twice. The first time, we arrived mid morning and had to wait about 30 min for a table, and the second time we arrived shortly before the restaurant opened and got a table immediately. However, our party of 3 was sat at the same table both times, which results in us being squished and truly not having enough room for our entrees and our coffee at the table... next time i'd opt for the family table and share with another group. Great blue bottle french press coffee and OJ. Great meals both times I've been here - I've had the challah french toast, which is magical, and probably the best french toast I've ever ordered, as well as one of their egg cazuela dishes that was quite tasty, and interesting. The menu isn't too large (which is probably the only reason its a 4 star instead of a 5 star for me), so to keep it fresh I'd probably only brunch here every other month, but I plan to keep on returning.", "rating": 4, "date": "2012-02-27"}, {"excerpts": ["For dessert, we had the homemade 3 layer cheesecake which went well with our French Press coffee. "], "author": "Berna P.", "review": "DH and I tried this restaurant as a suggestion from a friend. I liked the intimate atmosphere, and it proved to be a pleasant surprise. \n\nWe were the 1st ones there and service was better than fair. Our server explained a good bunch of the menu as well as wine selections. When it got a little bit busy, we waited a little bit for our check. I thought it was pretty reasonable considering there were only 2 servers plus one of the owners doing the seating and helping with the service.\n\nNot too many choices as far as entrees are concerned, but the choices proved to show a good variety with steak, fish, chicken, and vegan dishes. DH had the hanger steak. My 1st taste of the steak was a bit rough for a medium cook, but another taste proved otherwise. I guess I just got the end part of the steak. I had the halibut with brown rice. I enjoyed the relish sauce it was paired with, but I think the fish was a bit overcooked. OK, but not buttah; I wanted a bit more relish to cover the taste of the fish that was left over. We had the squash with flatbread appetizer which was a good starter for us. For dessert, we had the homemade 3 layer cheesecake which went well with our French Press coffee. I also liked our wine selection, but you're probably better off getting a bottle if you and your company plan to drink. \n\nFor us, it's a restaurant we definitely want to revisit, but not the type yet where we'd go back the next week. We'd probably try other dishes and maybe their brunch to get a better feel. For now, it's a 4 stars.", "rating": 4, "date": "2007-11-30"}, {"excerpts": ["Especially pairing it with the french press blue bottle coffee that they serve. ", "The pork shoulder sandwich was ok, a little too tangy. ", "Overall I am a fan and when I'm craving for some french toast I will definitely come here!"], "author": "A L.", "review": "Like most reviewers, the challah custard toast is a must try! I love it! Especially pairing it with the french press blue bottle coffee that they serve. The pork shoulder sandwich was ok, a little too tangy. Overall I am a fan and when I'm craving for some french toast I will definitely come here!", "rating": 4, "date": "2010-08-07"}, {"excerpts": ["great french press coffee and even better vibe.  ", "i like!"], "author": "Dee C.", "review": "as time goes by, i get lazier (er, i mean busier) with my yelping. in short:\n\nYou should eat here. \n\nsmall, cozy, with one waitress that held the place together and 2 calm, collected chefs that made cooking look like a breeze. \n\nwe shared challah strawberry french toast and \"eggs baked in a cazuela with basque style tomato sauce\". translation: 2 pouched eggs baked in tomato sauce, this week with pesto and pork.\n\ngreat french press coffee and even better vibe.  i like!", "rating": 4, "date": "2009-05-30"}, {"excerpts": ["French press blue bottle cofee.  "], "author": "Allen K.", "review": "French press blue bottle cofee.  Tasty food and a good atmosphere.\n\nAll in all a very pleasant brunch. I'll be back for sure!", "rating": 5, "date": "2010-09-26"}, {"excerpts": ["I gotta say though, the Blue Bottle coffee served in your very own french press ", "was the highlight for me!  ", "That is some goooood coffee! ", "The space itself was small and cozy....yet not small to where you felt clausterphobic....being 6'4 that was refreshing!"], "author": "Brian S.", "review": "Usually by the time we head out to brunch this place is busy with a line outside, last weekend we got there just before the crowds.  I really enjoyed their food, very down to earth feeling, I guess rustic is the word?  I gotta say though, the Blue Bottle coffee served in your very own french press was the highlight for me!  That is some goooood coffee! The space itself was small and cozy....yet not small to where you felt clausterphobic....being 6'4 that was refreshing!", "rating": 3, "date": "2010-07-31"}, {"excerpts": ["So - in conclusion - you should certainly go here and have fantastic breakfast and amazing french press coffee.  ", "But you should not do so after drinking too much wine the night before.  ", "After those nights, you should go to the Pork Store."], "author": "Lauren L.", "review": "While my brunch was delicious, delectable, and amazing, I wish I hadn't been slightly hungover and in need of gigantic diner brunch instead of tiny high class brunch.  Regardless, that's not really Olea's fault so I won't hold it against them that we drank 3 bottles of wine at the Hidden Vine the night before.  Unfortunately, my amazing open face omelette with chicken and tomatoes didn't fill me to the brim.  However, it was delicious, delectable and amazing.  So - in conclusion - you should certainly go here and have fantastic breakfast and amazing french press coffee.  But you should not do so after drinking too much wine the night before.  After those nights, you should go to the Pork Store.", "rating": 4, "date": "2009-02-27"}, {"excerpts": ["I got a giant french press coffee here which is pretty good (blue bottle coffee beans). ", "I tried one of the omelets, this egg with pork dish, challah custard toast, and umbrian farro salad. ", "I think they make these dishes with a few slight variations in ingredients based on what they have and what was available. ", "I liked the omelet the best out of the four. ", "The custard toast was my second favorite since I was impressed by the consistency, fluffiness of the toast. ", "The egg and pork dish was my third favorite. ", "The farro salad didn't taste bad ", "but I expected a warm dish, not a cold dish. ", "It was a bit of a disappointment since I wanted something warm for the soul. ", "Everything tasted wonderful. ", "Portions are slightly smaller than some other brunch places I've been to already."], "author": "Liwei Y.", "review": "I tried to make another trip to Red Door Cafe and ended up getting turned down from there since we had a party of 3 and they don't allow parties of 3 :'(. Ended up coming here for brunch instead. I got a giant french press coffee here which is pretty good (blue bottle coffee beans). I tried one of the omelets, this egg with pork dish, challah custard toast, and umbrian farro salad. I think they make these dishes with a few slight variations in ingredients based on what they have and what was available. I liked the omelet the best out of the four. The custard toast was my second favorite since I was impressed by the consistency, fluffiness of the toast. The egg and pork dish was my third favorite. The farro salad didn't taste bad but I expected a warm dish, not a cold dish. It was a bit of a disappointment since I wanted something warm for the soul. Everything tasted wonderful. Portions are slightly smaller than some other brunch places I've been to already.", "rating": 4, "date": "2012-02-12"}, {"excerpts": ["I really love their french press coffee concept.  ", "We waited over half an hour for a table on a Sunday Morning and  I wouldn't mind waiting again.  ", "It is a fairly small restaurant with one communal table and probably 9 tables.   ", "I had their omelet with butternut squash, cheese, and pumpkin seeds and am a BIG FAN.The ", "other half had their steams clams which was good as well.  ", "Their toast is nice and soft and sweet ", "which goes especially well with their strawberry jam. ", "I would love to come back!"], "author": "Sarah T.", "review": "This place had absolutely delicious brunch. I really love their french press coffee concept.  We waited over half an hour for a table on a Sunday Morning and  I wouldn't mind waiting again.  It is a fairly small restaurant with one communal table and probably 9 tables.   I had their omelet with butternut squash, cheese, and pumpkin seeds and am a BIG FAN.The other half had their steams clams which was good as well.  Their toast is nice and soft and sweet which goes especially well with their strawberry jam. I would love to come back!", "rating": 4, "date": "2009-11-23"}, {"excerpts": ["I am drawn to this place for brunch because the menu is creative while being contrite (10 items) and they serve blue bottle coffee in a french press.  ", "Like other brunch places in the city, menu items are made from organic ingredients that of local farms. ", "However, Olea has been somewhat more creative with their menu options. ", "The challah custard toast with korintji cinnamon sugar and strawberries (berries vary by season) was heavenly and perhaps the best I've ever had. ", "The flat omelet option stays on the menu but the ingredients change on a weekly basis. ", "The omelet was the perfect portion for me, it's focus on the ingredients- peppercorns, homemade fromage blanc, purslane greens and tomato was a nice departure from my usual mushroom, cheese, canadian ham trapped within an insanely amount of egg type of omelet. ", "The eggs baked in a cazuela served with crostini was also very good and something that I've never had before. "], "author": "Annie Y.", "review": "Located on corner of Larkin and California in Nob Hill. You open the door, descend on several steps and begin to feel like you've entered familiar territory in the form of someone's simple and charming home. On my first visit, I immediately noticed the fresh flowers and plants that tastefully adorn each table and window sill. Next, I noticed the chef (the guy in the yelp picture, HA!) appear in the rustic little kitchen at the left side of the restaurant. I've been here twice for brunch and I especially enjoyed my second visit when my group was seated at the communal table. \n\nI am drawn to this place for brunch because the menu is creative while being contrite (10 items) and they serve blue bottle coffee in a french press.  Like other brunch places in the city, menu items are made from organic ingredients that of local farms. However, Olea has been somewhat more creative with their menu options. The challah custard toast with korintji cinnamon sugar and strawberries (berries vary by season) was heavenly and perhaps the best I've ever had. The flat omelet option stays on the menu but the ingredients change on a weekly basis. The omelet was the perfect portion for me, it's focus on the ingredients- peppercorns, homemade fromage blanc, purslane greens and tomato was a nice departure from my usual mushroom, cheese, canadian ham trapped within an insanely amount of egg type of omelet. The eggs baked in a cazuela served with crostini was also very good and something that I've never had before. Our table ordered french fries which were the 'good' kind of fries - skinny, just the right amount of salt and sprinkled with parsley...yum!\n\nMimosa's are made with fresh squeezed orange juice and the coffee is good. I am going to try dinner here on my next visit.", "rating": 4, "date": "2009-03-30"}, {"excerpts": ["and she comes back over with a great big French press carafe ", "and then it all made sense.  ", "\"Let it sit for about a minute before you press down on the handle\", she said.  ", "I obeyed.  ", "Then I poured...  ", "I think this must be the first time that I've ever had French pressed coffee because it was fantastic - ", "I think I'd remember this flavor.  ", "Anyway, I went back to my book and kept trying not to laugh while sitting there alone at my table, but I really couldn't help it.  ", "Sedaris is funny.  "], "author": "Benjamin G.", "review": "It isn't everyday that you wake up, go about your daily routine and walk outside to have something great happen.  That is just not the way of things.  On occasion though, serendipitous winds come down from the that cloud that you didn't even see and collide with your intentions to walk through a city with completely aimless intent.  It is encounters like this, coupled with the brush of unexpected fortuity against your shoulder that lead you to places like Olea.\n\nThere I was, watching a confrontation between a cab driver on a cell phone sitting right there on the track refusing to turn left left and a cable car driver (the front man) screaming at him to get the hell out of the way.  I was really enjoying the energy of the skirmish.  It was a showdown in the sun and I had a front row seat.  Then I dropped my book.  I barely had a hold of it to begin with; just pinched between my index finger and thumb.  I turned to pick it up and noticed that the Red Door was no longer the Red Door.  It was new.  It was revamped.  It was, a brand new addition to the corner of California and Larkin.  Forgetting about the cab driver who needs to invest in a blue tooth headset, I walked in.  The layout was new to me - very simple, yet welcoming and clean.  It reminded me of Carmel.  I chose a seat facing the window and ordered a coffee and an omelet with cheese and spinach.  My waitress brought me an empty cup, which I initially thought was strange (that there wasn't any coffee inside the cup) but I opened up to \"you can't kill the rooster\" in \"Me Talk Pretty One Day\".  A few minutes pass and she comes back over with a great big French press carafe and then it all made sense.  \"Let it sit for about a minute before you press down on the handle\", she said.  I obeyed.  Then I poured...  I think this must be the first time that I've ever had French pressed coffee because it was fantastic - I think I'd remember this flavor.  Anyway, I went back to my book and kept trying not to laugh while sitting there alone at my table, but I really couldn't help it.  Sedaris is funny.  A man with a white coat came over and sat himself in a chair at the table next to me.\n\n\"I'm being committed\", I said to myself.\n\n\"We're all out of spinach, my friend.  How about green beans instead?\", he said.\n\n(realizing this was the chef, not a member of the SF mental ward staff) I said, \"hell man, you can use green beans or broccoli - I'm indifferent.  Whatever works best for you.\"  He smiled and tucked away behind the counter to the kitchen.\n\nThe food came out.  Superb!  I've never had green beans in an omelet, but I assure you this will not be the last occasion.\n\nThe sun shone in through the window and the music played on - Flamenco style.  I stayed until a couple came in and sat next to me and ask the blinds be pulled shut...  Entitlement-centric bastards.\n\nI'll be back here for sure.", "rating": 5, "date": "2007-10-27"}, {"excerpts": ["Had a nice time with my friend and really enjoyed my french press blue bottle coffee.  ", "I would recommend it for a nice low key breakfast."], "author": "andrea g.", "review": "Came here for breakfast and it was delicious. I have been here for dinner and liked the dinner a little bit more.  Had a nice time with my friend and really enjoyed my french press blue bottle coffee.  I would recommend it for a nice low key breakfast.", "rating": 3, "date": "2010-02-21"}, {"excerpts": ["Gotta love French press."], "author": "Carol S.", "review": "Solid but a bit pricey for what it is.  I just don't know if I'd go back again.  But, the one part that was fun and tasted great was the coffee!  Gotta love French press.", "rating": 3, "date": "2009-11-20"}, {"excerpts": ["the french press coffee (blue bottle) was tasty and warming.  ", "the ambiance was cozy and the staff was extremely friendly and attentive.  "], "author": "Grant T.", "review": "what a great place to start off a sunday!  got there pretty early as there were only two large parties seated.  very quaint corner entry that challenges you as soon as you approach it - must stoop down a bit as the door and the handle are a bit shorter than usual.  not a very kid friendly place as i almost swept one little boy away while opening the door to walk inside.....there just isn't that much room for a kid or kids to \"roam\" around and explore.  the french press coffee (blue bottle) was tasty and warming.  the ambiance was cozy and the staff was extremely friendly and attentive.  my omelet with neiman ranch ham was delicious as was my date's french toast - very hearty and creamy.  \n\nas always, yelp came through again!  thanks all!", "rating": 4, "date": "2009-10-14"}, {"excerpts": ["The coffee comes in a french press (you can order 2 or 4 cups) so you know it's fresh. ", "I ordered the flat omlette and my friend ordered the pork sandwich with fries. ", "We both really liked our dishes! ", "The food comes out fairly quickly and the servers are nice. ", "I live one block away ", "so I'll def be coming here more often!"], "author": "Jane M.", "review": "This is a cute little brunch place that is reasonably priced. The coffee comes in a french press (you can order 2 or 4 cups) so you know it's fresh. I ordered the flat omlette and my friend ordered the pork sandwich with fries. We both really liked our dishes! The food comes out fairly quickly and the servers are nice. I live one block away so I'll def be coming here more often!", "rating": 5, "date": "2009-06-06"}, {"excerpts": ["The coffee is Blue Bottle, served in a french press, and was superb.  ", "Not a cheap brunch (the entrees are priced in the $10-13 range), but well worth it.  ", "We can't wait to check this place out for dinner.   ", "Due to the small number of tables, reservations are highly recommended."], "author": "Alan S.", "review": "We were looking for a new place for brunch and found this little gem near the Lumiere Cinema in Russian Hill.  The restaurant is small but homey and well lighted, and our server was very attentive without being obtrusive.  While the menu is a bit limited, it is carefully thought out and is based on availability of the freshest ingredients.  I ordered the scrambled eggs on bread, with bacon and tomato.  It turns out this was served as a sandwich, on a wonderfully fresh slice of Acme bread.  The combination of flavors and textures made the dish absolutely sublime.   My partner had the omelette with asparagus, pork tenderloin and a reddish pepper sauce . . . out of this world.  The coffee is Blue Bottle, served in a french press, and was superb.  Not a cheap brunch (the entrees are priced in the $10-13 range), but well worth it.  We can't wait to check this place out for dinner.   Due to the small number of tables, reservations are highly recommended.", "rating": 4, "date": "2011-05-23"}, {"excerpts": ["The combination of the french toast and french press Blue Bottle coffee is pretty amazing, but $50 before tip for brunch for 2 is a little high for a regular place."], "author": "Chris B.", "review": "Probably my favorite brunch in San Francisco if it wasn't for the high price. The combination of the french toast and french press Blue Bottle coffee is pretty amazing, but $50 before tip for brunch for 2 is a little high for a regular place.", "rating": 4, "date": "2008-10-01"}, {"excerpts": ["Definitely order the challah custard toast and a french press blue bottle coffee.  ", "You can't go wrong with that.  "], "author": "Matthew A.", "review": "Been here twice (in 1 week) so far and it is AMAZING!  So many lovely little touches here.  They have done a great job with such a small space; the minimal decor, soothing green color palette, and below-street-level feel make it a little getaway on a busy SF street (complete with cable cars, so you still know SF is nearby)!  The ambience is romantic but also very sophisticated, and the waitstaff couldn't be friendlier.\n\nDefinitely order the challah custard toast and a french press blue bottle coffee.  You can't go wrong with that.  The pulled pork sandwich is a perfect lunch, and the prices are completely reasonable.\n\nPlease support this emerging restaurant in these hard economic times.  I know I'm going back next weekend!", "rating": 4, "date": "2009-03-06"}, {"excerpts": ["French press was delicious. ", "My boyfriend's burger was amazing, and the price tag was reasonable for the quality."], "author": "Katherine D.", "review": "The 5 stars are for the custard toast, Olea's version of french toast but with challah. Service was great. French press was delicious. My boyfriend's burger was amazing, and the price tag was reasonable for the quality.", "rating": 5, "date": "2008-06-12"}, {"excerpts": ["My friends and I shared the french press coffee and each had a mimosa.  ", "The coffee was superb, and you could tell they use fresh squeezed oranges in the mimosa, very pulpy!  ", "We split a side of fries which were great.  ", "I tried a bit of the french toast (challah custard toast with korintji cinnamon sugar and fresh yerena farms berries) that my sister ordered... ", "YUM! ", "Fantastic! ", "I am not usually a fan of french toast, but Olea's got some GOOD french toast - I highly recommend it! ", "This is a great spot, I'd go back again for sure."], "author": "Christine Y.", "review": "I visited Olea for Saturday brunch - very cute setting and beautiful flowers which make it a cozy spot. The service and food are great.  I had the eggs baked in a cazuela with moroccan tomato - really enjoyed it! It comes in a shallow dish, has two eggs baked in a light tomato base, and I think it's got bread crumbs or something baked in there with it.  It comes with few slices of crostini - excellent together.  My friends and I shared the french press coffee and each had a mimosa.  The coffee was superb, and you could tell they use fresh squeezed oranges in the mimosa, very pulpy!  We split a side of fries which were great.  I tried a bit of the french toast (challah custard toast with korintji cinnamon sugar and fresh yerena farms berries) that my sister ordered... YUM! Fantastic! I am not usually a fan of french toast, but Olea's got some GOOD french toast - I highly recommend it! This is a great spot, I'd go back again for sure.", "rating": 4, "date": "2009-03-29"}, {"excerpts": ["BUT the good news is they have Blue Bottle coffee in a french press", "--it was great, even without the splenda--diabetics and weight watchers bring your own little fake sugar packets, they just have cubes of the real stuff. ", "The menu is pretty limited and the one dish that really grabbed my attention-some baked egg dish with spicey tomato sauce and black beans, they said too a while--", "did I mention i was a hungry girl?  ", "So my boyfriend ", "and I both ordered the egg sandwich. ", "It was good, but needed ketchup--since I was told there was no fake sugar I figured they wouldn't stoop so low as to have processed tomatoes, so I didn't ask. ", "Overall the food was decent, it was nice to leave not feeling so full I couldn't move, but I wasn't totally impressed either."], "author": "Aly S.", "review": "After a big walk up 37 flights Climbing for a Cure for Cystic Fibrosis (sorry for the shameless plug) my boyfriend and I worked up quite an appetite--the line at Dotties was too long, so we headed back to our hood but were in the mood for something new. Frankly, it feels like cheating to go to brunch a block away from Nob Hill Grille, seriously, cheating on someone. But the place looked cute and we'd been curious to try, and variety is the spice of life, right? We ordered mimosas which came in small flutes and took at really long time. BUT the good news is they have Blue Bottle coffee in a french press--it was great, even without the splenda--diabetics and weight watchers bring your own little fake sugar packets, they just have cubes of the real stuff. The menu is pretty limited and the one dish that really grabbed my attention-some baked egg dish with spicey tomato sauce and black beans, they said too a while--did I mention i was a hungry girl?  So my boyfriend and I both ordered the egg sandwich. It was good, but needed ketchup--since I was told there was no fake sugar I figured they wouldn't stoop so low as to have processed tomatoes, so I didn't ask. Overall the food was decent, it was nice to leave not feeling so full I couldn't move, but I wasn't totally impressed either.", "rating": 2, "date": "2008-09-21"}], "coke  diet coke": [], "aranciata rossa": [], "harney  sons tea": [], "fresh squeezed grapefruit juice": [], "spicy bloody mary with sake": [{"excerpts": ["The Spicy Bloody Mary with Sake hit the spot perfectly. ", "Omelet with sweet potato, kale & peanuts sounded a little strange but was truly a flavorful, great creation. ", "And, the Cazuela was the topic of conversation on the drive home...", "good seems to be an understatement. ", "I will highly recommend Olea as a standout in the city that has so many choices."], "author": "Kalena M.", "review": "My friends & I were visiting the City from Monterey...so we wanted a fun, hip, yummy, local brunch spot with creative, fresh food & great service...Olea is it! We waited about 30 minutes in line in the rain & it was so worth it. Philip the owner was warm & wonderful The Spicy Bloody Mary with Sake hit the spot perfectly. Omelet with sweet potato, kale & peanuts sounded a little strange but was truly a flavorful, great creation. And, the Cazuela was the topic of conversation on the drive home...good seems to be an understatement. I will highly recommend Olea as a standout in the city that has so many choices.", "rating": 5, "date": "2014-02-09"}], "spicy virgin mary": []}