{"carne asada fries": [{"excerpts": ["I ordered the carne asada fries and two pupusas. ", "The food came out in less than 5 mins and was made fresh to order. ", "The carne asada fries were topped with tons of beef and cheese. ", "The potatoes were a little less crisp than I prefer, but they were hot and fresh!  ", "I give this place a solid 4. ", "Not life changing, but very good with nice serving sizes."], "author": "Phillip A.", "review": "This is a simple salvadoranian restaurant, CASH ONLY! Upon seeing the menu, the prices were maybe a dollar more than I expected. The food portions were BIG and the quality of the pupusas was ! I ordered the carne asada fries and two pupusas. The food came out in less than 5 mins and was made fresh to order. The carne asada fries were topped with tons of beef and cheese. The potatoes were a little less crisp than I prefer, but they were hot and fresh!  I give this place a solid 4. Not life changing, but very good with nice serving sizes.", "rating": 4, "date": "2018-09-24"}, {"excerpts": ["Split the carne asada fries and was not disappointed. ", "Came with ample amount of cheese, guacamole (heaps of the good stuff), steak, jalapeños, cilantro. ", "We devoured it. ", "With just that, I thought I would give it 4 stars. ", "But then my main entree came, the \"arroz con mariscos\" which was rice with seafood (shrimp, calamari, sole filet) and four small fried plantains. ", "This blew me away. ", "Flavor was spot on; seafood was generous (seriously, heaps of shrimp, fish, and calamari); rice was cooked to perfection (not too wet, not dry); great balance of salty and sweet (the plantains). ", "Ever been on the search for the perfect seafood paella? ", "I have...even in Spain...but can say that I have usually been disappointed; there's usually not enough seafood, or the rice is dry, or something. ", "The arroz con mariscos was like that...", "only it did not disappoint at all...", "and it's not paella...."], "author": "Will H.", "review": "This place is definitely a hole-in-the-wall (which I like) in the outskirts of the TL (maybe not as nice). I went to the restroom first when I got here to wash my hands and it is for sure a hole-in-the-wall bathroom. Dirty, out of soap, and out of paper towels. Wasn't a good start to the meal.\n\nBut then my food came and everything changed. Split the carne asada fries and was not disappointed. Came with ample amount of cheese, guacamole (heaps of the good stuff), steak, jalapeños, cilantro. We devoured it. With just that, I thought I would give it 4 stars. But then my main entree came, the \"arroz con mariscos\" which was rice with seafood (shrimp, calamari, sole filet) and four small fried plantains. This blew me away. Flavor was spot on; seafood was generous (seriously, heaps of shrimp, fish, and calamari); rice was cooked to perfection (not too wet, not dry); great balance of salty and sweet (the plantains). Ever been on the search for the perfect seafood paella? I have...even in Spain...but can say that I have usually been disappointed; there's usually not enough seafood, or the rice is dry, or something. The arroz con mariscos was like that...only it did not disappoint at all...and it's not paella....but it was the perfect combination of rice and seafood. \n\nTable also came with free chips and salsa, and pickled cabbage, which was a perfect crispiness for my dish. I'm coming back. But I'll wash my hands before I get there. \n\nFive stars. And a request soap and paper towels in the bathroom =)", "rating": 5, "date": "2016-01-07"}, {"excerpts": ["Went here for the pupusas and carne asada fries.  \n\n", "The carne asada fries were decent.  "], "author": "Lisa G.", "review": "CASH ONLY.  Went here for the pupusas and carne asada fries.  \n\nThe carne asada fries were decent.  They give you a pretty big portion, but I wish they put a little more meat on them.  \n\nThe pupusas were good, but definitely not the best I've had.  They don't give you any sauce, just curtido.  The curtido didn't have too much flavor, but it still left me satisfied.  You can get 2 pupusas for about $5.  \n\nStreet, metered parking.  During the day, parking should be easy to find.  At night, you might have trouble finding parking.", "rating": 3, "date": "2013-10-29"}, {"excerpts": ["I probably should've tried their popular carne asada fries. ", "Instead, I had their two item combo (approx. ", "$8 - a great value for the amount of food you get) and chose their chicken tostada and chicken enchilada - comes with rice and choice of beans. ", "It was nice that the server got our order in before the large group next to us, so our food came out relatively quick. "], "author": "Cathy K.", "review": "I probably should've tried their popular carne asada fries. Instead, I had their two item combo (approx. $8 - a great value for the amount of food you get) and chose their chicken tostada and chicken enchilada - comes with rice and choice of beans. It was nice that the server got our order in before the large group next to us, so our food came out relatively quick. Even though the food looked enticing, the flavors were a bit bland to me. \n\nI was a disheartened that they charge 99 cents extra for more tortilla chips - perhaps they do this so folks don't camp out here to fill their bellies for near free.\n\nAs for ambiance, the lighting in the sparce dining room is a bit harsh - flourescent...they do have a TV to keep you entertained.", "rating": 2, "date": "2013-01-24"}, {"excerpts": ["Came here because the pictures of the carne asada fries looked amazing.  "], "author": "Tu T.", "review": "Came here because the pictures of the carne asada fries looked amazing.  I was not disappoint.  \n\nThick fat fries that were hot and fresh out the fryer and super crispy, covered in real cheese and steak and goodness. \n\nPupusas are pretty decent too, and I was quite happy that they provided chips and salsa.  \n\nservice ain't great but come on, this isn't some fancy pancy restaurant.  Same level of service you'd expect from an Asian restaurant which I'm perfectly fine with.", "rating": 4, "date": "2012-08-21"}, {"excerpts": ["The carne asada fries are great hangover food (not that I would know anything about hangovers). ", "Burritos are great, I've tried 'em all. ", "Love the pupusas.  "], "author": "Hayesvalleygirl ..", "review": "I'm not always in the mood to trek to the Mission and Olivos is a solid option. So far everything I've had has been great, or at least very tasty. \n\nThe carne asada fries are great hangover food (not that I would know anything about hangovers). Burritos are great, I've tried 'em all. Love the pupusas.  Generous portions, good prices.\n\nAs for the service - I give five stars. Friendly and smiles all around! This is one of the few places that I go to regularly where they actually recognize me, even if I haven't been around in a long time.", "rating": 4, "date": "2013-11-03"}, {"excerpts": ["Carne Asada Fries were stellar! ", "Really great salsa made fresh daily. ", "Truly never had any burrito quite like it. ", "Awesome!"], "author": "Jerry E.", "review": "Great little secret in San Francisco! Super Burrito was fantastic! Carne Asada Fries were stellar! Really great salsa made fresh daily. Truly never had any burrito quite like it. Awesome!", "rating": 5, "date": "2015-09-04"}, {"excerpts": ["My friend really wanted carne asada fries. ", "After some Yelping, she found Olivo's. ", "The only other place where I've had carne asada fries was Rigoberto's in San Diego. ", "We ordered the carne asada fries and soft shell fish tacos. ", "The portion of fries was huge! ", "They were topped with guacamole, ooey gooey cheese, jalapenos, onions, sour cream, and of course, carne asada! ", "Only downside: the fries were pretty greasy. ", "I'm guessing they are freshly made on site. ", "The fish tacos weren't bad. ", "I believe they used tilapia and sauteed it with onions and red bell peppers. "], "author": "Audrey T.", "review": "My friend really wanted carne asada fries. After some Yelping, she found Olivo's. The only other place where I've had carne asada fries was Rigoberto's in San Diego. Olivo's fries were alright, but I prefer Rigoberto's. \n\nWhen we walked in, the waitress was pretty rude to us. She didn't even acknowledge us. After we seated ourselves, she walked over and her attitude completely changed. She was now smiling and being very polite. I can understand why she was rude in the beginning since she was the only waitress working and the restaurant was packed. We ordered the carne asada fries and soft shell fish tacos. The portion of fries was huge! They were topped with guacamole, ooey gooey cheese, jalapenos, onions, sour cream, and of course, carne asada! Only downside: the fries were pretty greasy. I'm guessing they are freshly made on site. The fish tacos weren't bad. I believe they used tilapia and sauteed it with onions and red bell peppers. They each come with huge slices of avocado, too! \n\nOverall, the food was decent and the employees are really nice. The waitress was really bogged down so the chef ended up bringing my tacos out and he was really nice too. We waited a pretty long time for our orders to be taken and again for our food to come out, but it was lunch time so it was understandable. The waitress apologized multiple times for the wait, which I really appreciated. 3.5 stars! If I do come back in the future, I'd love to try the pupusas since Yelpers have raved about them.\n\nBtw, cash only. We only noticed after we sat down, and by then it would have been rude to leave. Luckily, I had some cash on me!!", "rating": 3, "date": "2010-11-08"}, {"excerpts": ["They also offer the famous Carne Asada fries here too. ", "French Fries and Mexican food together just FIT. "], "author": "Ashley D.", "review": "I just got back from San Diego last weekend, and ever since experiencing my first California Burrito, I had to have it again. Apparently it's only a San Diego thing though. Until now. I did a little Yelp research on California Burritos in the Bay area. I came across this little gem, and to my surprise it was just 5 blocks from me. How did I not know about this?!\n\nThe burrito was absolutely spot on comparable with the ones they have in San Diego. They also offer the famous Carne Asada fries here too. French Fries and Mexican food together just FIT. It's miraculous.\n\nI plan to get my San Diego friend to visit me here soon and see for himself. No more trips to the sketchy, dirty Mission for me (sorry if that offends you)! I have all I need in a Mexican restaurant RIGHT HERE! Yum.", "rating": 5, "date": "2011-02-12"}, {"excerpts": ["I was on the lookout for some deliciously stacked, gooey carne asada fries here in norcal and wasn't able to find any.  ", "Lo' an behold, my friends told me they had gotten some of these forsaken fries in the City so the first thing on my checklist was to try them out.  ", "You call that carne asada fries?  ", "It's an insult to one of CA's best Mex-American foods!  ", "It's like the super small, classier (andy by classier I mean, less portions ", "cuz you know how those fancy restaurants do it), won't fill you up version that you possibly might want to eat with a date (no date I'm gonna go on mind you).  ", "I was craving those HUGE, heavy, eat til you drop until all that's left are mushed up ingredients that probably look very similar to what's already in your stomach.  ", "All in all, I say save your money and go somewhere else for your carne asada fries and pupusas."], "author": "Tori Q.", "review": "Totally whatevers.  \n\nI was on the lookout for some deliciously stacked, gooey carne asada fries here in norcal and wasn't able to find any.  Lo' an behold, my friends told me they had gotten some of these forsaken fries in the City so the first thing on my checklist was to try them out.  Verdict?  WHATEVERS.\n\nMaybe I'm used to socal's pound of fries slathered in thick guacamole, cheddar cheese, spicy salsa, cut-up onions, refried beans, creamy sour cream... but seriously? Seriously?  You call that carne asada fries?  It's an insult to one of CA's best Mex-American foods!  It's like the super small, classier (andy by classier I mean, less portions cuz you know how those fancy restaurants do it), won't fill you up version that you possibly might want to eat with a date (no date I'm gonna go on mind you).  I was craving those HUGE, heavy, eat til you drop until all that's left are mushed up ingredients that probably look very similar to what's already in your stomach.  For $6.99, I could very well get quadruple of what I got down there down in socal.  \n\nMy friend and I got the pupusas as well because they were a completely different color (light blue) from the rest of the Christmas color coded menu.  If there's something on the menu that is a different color from the rest, obviously it's highlighted for a reason, amirite?  Don't be fooled.  I ordered the cheese and pork pupusa and the bean and cheese pupusa.  My friend ordered the loroco (vegetable) and cheese.  If you've never had pupusas, they come with a little salad/radish mixture to top off the pupusas.  The pupusas were good on their own but they were nothing like the ones in the hood of eastbay where the owner didn't speak a lick of English, which means you know it's good.  The salad was missing that vinegary kick so we ended up dousing our pupusas in tapatio to get it down our throats.  \n\nAll in all, I say save your money and go somewhere else for your carne asada fries and pupusas.", "rating": 2, "date": "2012-04-27"}, {"excerpts": ["Came here just for the Carne Asada fries and it feels much like SoCal.\n\n"], "author": "Jason K.", "review": "Came here just for the Carne Asada fries and it feels much like SoCal.\n\nI'll have to go back for the California Burrito, another SoCal favorite.\n\nI'm not quite sure if I went at a slow time, but they literally sliced the potato when I ordered.  The guacamole was also made right when I ordered so I know I didn't have food that was just lying around.\n\nTheir menu looks quite extensive so I know I'll be coming back for more!", "rating": 5, "date": "2010-05-13"}, {"excerpts": ["I have to admit I haven't had the nerve/appetite to order the carne asada fries yet "], "author": "Kathleen M.", "review": "I've fallen a little in love with this place, and only wish I had discovered it sooner!!  The food is fresh and honest and SCRUMPTIOUS, the portions are HUMONGOUS, the prices VERY reasonable, and the family running it is very hard-working and nice.  \n\nThe pupusas are addictingly good (and wonderful left-over the next day) and the plantain is super-yummy, but my favorite dish (so far) has to be the fish tacos with their many pieces of flaky, buttery sole, fresh avocado, onion and grilled peppers.  Even the rice and beans are tasty (and I'm not a rice and beans type of person).  I have to admit I haven't had the nerve/appetite to order the carne asada fries yet but they look fabulous, and judging from the near-orgasmic sounds coming from the next table where two friends were sharing them, they taste even better!\n\nNow a word for those mean people complaining about the \"service\":  this place is open 12 hours a day, six days a week, and I have a suspicion that some of the family members work the entire time.  The older woman behind the counter both times I went has a \"Grumpy Cat\" type of face, probably from a hard, tiring life and having to deal with the riff-raff in the neighborhood stumbling in and giving her a hard time (she has to put the tip jar behind the counter as there have been so many \"grab and go\" thefts from it).  But if you talk to her and are friendly, she is quite wonderful and helpful.  I'm not even sure they offer table service, because the regulars seem to know to order at the counter, sit down, eat your scrumptious meal, and then get up and go over to the counter and pay.  This is NOT the Ritz, \"lack of service\" complainers, it is a small and very good family-run restaurant in the Tenderloin, so please take your privileged and entitled butts somewhere else!!", "rating": 5, "date": "2013-06-05"}, {"excerpts": ["Carne asada fries and the fish tacos were amazing. ", "I definitely recommend! ", "Employees were very sweet."], "author": "Darby B.", "review": "Carne asada fries and the fish tacos were amazing. I definitely recommend! Employees were very sweet.", "rating": 4, "date": "2014-09-08"}, {"excerpts": ["Carne asada fries and california burrito! ", "What?! ", "In NorCal? ", "Pretty awesome stuff. ", "I try not to get this every time I go here, but I do! ", "I just love French fries everything. ", "I would say I've had better in SD, but this place isn't bad! "], "author": "Phuc N.", "review": "Carne asada fries and california burrito! What?! In NorCal? Pretty awesome stuff. I try not to get this every time I go here, but I do! I just love French fries everything. I would say I've had better in SD, but this place isn't bad! Prob best in the city.\n\n-1 star for the slow service.", "rating": 4, "date": "2013-12-23"}, {"excerpts": ["OMG the carne asada fries! ", "Mmmmm sooo good! ", "Also tried the carne asada burrito and 2 pupusas: cheese and beans/ cheese and pork. ", "Everything was good!"], "author": "Maria G.", "review": "OMG the carne asada fries! Mmmmm sooo good! Also tried the carne asada burrito and 2 pupusas: cheese and beans/ cheese and pork. Everything was good!", "rating": 4, "date": "2014-04-16"}, {"excerpts": ["Because of OLIVO's CARNE ASADA FRIES! ", "My friends and I came after our first law school exam to celebrate, and the food was so good ", "I didn't even think about my prospects for failing. ", "The fries were fresh, the carne asada was deliciously seasoned, and the layers of cheese, guacamole, and jalapenos melted in my too happy mouth. ", "I dare say these fries are even better than the bacon cheese fries at Outback Steakhouse, which are now a distant second in my book. "], "author": "Liz T.", "review": "I'm in love again. With french fries.\n\nFor the past couple of years, I've had a predominantly hate relationship with them. They added pimples to my face and inches to my waist. But I think I've finally forgiven and forgotten--or at least have reason to.\n\nBecause of OLIVO's CARNE ASADA FRIES! My friends and I came after our first law school exam to celebrate, and the food was so good I didn't even think about my prospects for failing. The fries were fresh, the carne asada was deliciously seasoned, and the layers of cheese, guacamole, and jalapenos melted in my too happy mouth. I dare say these fries are even better than the bacon cheese fries at Outback Steakhouse, which are now a distant second in my book. GASP.\n\nWe also had the grilled chicken and fried plantains as well as the green chili pork, both of which came with your choice of beans and hot tortillas. The grilled chicken was nicely browned, tender, flavorful and just perfect with the fried plantains. The green chili pork was super moist (think Hawaiian Kalua Pig) and had a small kick. I really enjoyed lunch here--the sluggish service did not hamper my orgasmic experience with the fries.\n\nI can't wait to come again. Fries4life.", "rating": 5, "date": "2008-12-05"}, {"excerpts": ["from San Diego and have such a difficult time finding amazing carne asada fries. ", "Once I found this place, I knew I could survive in SF. ", "Amazing and the family who owns the place is super chill. ", "Love their carne asada fries and Cali burrito!!"], "author": "Erin M.", "review": "I'm org. from San Diego and have such a difficult time finding amazing carne asada fries. Once I found this place, I knew I could survive in SF. Amazing and the family who owns the place is super chill. Love their carne asada fries and Cali burrito!!", "rating": 5, "date": "2014-09-03"}, {"excerpts": ["Carne asada fries.. oily, greasy, delicious carne asada fries.  ", "It's been a little over 10 years since I've had some so cal taco shop style carne asada fries, far too long.  ", "Unlike so cal carne asada fries, Olivio's offers a more reasonably sized portion (see my uploaded picture).  ", "They also use a lot more cheese and less guacamole ", "then what I remember from so cal.  ", "What I really like is that their fries are not the frozen pre-made fries, Olivio's serves hand-cut potatoes fried with no batter.  "], "author": "Eric L.", "review": "Like many from yelp, I made a trip to Olivio's for one goal.  Carne asada fries.. oily, greasy, delicious carne asada fries.  It's been a little over 10 years since I've had some so cal taco shop style carne asada fries, far too long.  Although the fries are not on the menu, Olivio's will make them for you if you ask.\n\nUpon entering this fine establishment, guests will marvel at the wood paneling, and decorative Salvadorean items.  There is a bottle of Tapatio at each table and a variety of hanging plants.\n\nBack to the food.  Unlike so cal carne asada fries, Olivio's offers a more reasonably sized portion (see my uploaded picture).  They also use a lot more cheese and less guacamole then what I remember from so cal.  What I really like is that their fries are not the frozen pre-made fries, Olivio's serves hand-cut potatoes fried with no batter.  Fantastic.\n\nIf the intense flavors of the cheese and the oil of the fries is too much, just grab the salsa they serve with the free chips and give your fries a good drizzle of salsa.  Perfect!  \n\nIt goes without saying I'll be back, it just depends on when.", "rating": 4, "date": "2008-04-23"}, {"excerpts": ["The carne asada fries are considered appetizers, but it's a meal in itself.  "], "author": "Naomi N.", "review": "This is my favorite Mexican/Salvadorean restaurant in the neighborhood.  It's a casual, family-owned restaurant that serves excellent home-cooked meals.  The portions are HUGE, so you'll never go hungry. \n\nThe meal starts off with complimentary salsa and chips.  Let me say, they serve THE BEST homemade salsa in the CITY!\n\nThe carne asada fries are considered appetizers, but it's a meal in itself.  You get a heap of fries with diced beef, cheese, guacamole, sour cream, cilantro, and jalapenos.   \n\nFor a lighter fare, the pork pupusas are perfect, and they come with vinegar coleslaw.  \n\nSome of my favorite dinner plates: carne asada with fries; carne asada with cheese enchilada(warning, this comes with a lot of food); salvadoreno steak with bell peppers, tomatoes and onions;  pork chops with casamiento and plantains.  Casamiento (fried rice with black beans and onions) is considered a breakfast item in El Salvador, but I could eat this all day!  The plaintains are freaking awesome.  If I only had a pint of vanilla ice cream with it, it would be perfect!\n  \nApparently, they tried various locations in the city and finally settled in our neighborhood.  Lucky us!  I hope they never, ever move!!!", "rating": 5, "date": "2011-02-17"}, {"excerpts": ["If you're into fries with your mexican food, I highly recommend the california burrito or carne asada fries. ", "SO GOOD."], "author": "Jenny Z.", "review": "It's so inexpensive and delicious, I'd eat here everyday if I could. If you're into fries with your mexican food, I highly recommend the california burrito or carne asada fries. SO GOOD.", "rating": 5, "date": "2013-05-01"}, {"excerpts": ["Let's just say that you shouldn't consider the carne asada fries an appetizer."], "author": "Hester B.", "review": "Ok I was afraid when I first saw it.  I even walked by and wondered if I really wanted to try this place.  However I did take a chance (well not really a chance since I'd already seen the 4-star Yelp rating), and the food was sooooo good!\n\nThis is like eating at somebody's mom's house.  Just be careful not to over-order.  I ate so much that I almost made myself sick.  Let's just say that you shouldn't consider the carne asada fries an appetizer.", "rating": 4, "date": "2011-05-13"}, {"excerpts": ["Read reviews before I went, so went in and order the carne asada fries ", "n California burrito~ took a while for the order to be ready ", "but I can see why.. ", "Small place but quite busy! ", "After waiting for close to 15 mins it was ready n ", "I picked up a Mexican cola along with the order.. ", "Got home n boy is the order BIG! ", "Definitely enough for 2 ppl.. ", "N  ", "both were items delicious!! "], "author": "may k.", "review": "First timer but I think they got a repeater in making!\n\nRead reviews before I went, so went in and order the carne asada fries n California burrito~ took a while for the order to be ready but I can see why.. Small place but quite busy! After waiting for close to 15 mins it was ready n I picked up a Mexican cola along with the order.. Got home n boy is the order BIG! Definitely enough for 2 ppl.. N  both were items delicious!! Will definitely go back when I'm craving for Mexican food!\n\nMind that they only take cash (they do have an ATM machine inside)", "rating": 5, "date": "2014-02-10"}, {"excerpts": ["Banging, smothered, carne asada fries are truly fattening but like I said, banging.  ", "Pupusa meal is a great deal and could keep you satisfied for your whole day and they are delicious.  \n", "This place is only about the food and it is so affordable.  ", "Check it out!"], "author": "D B.", "review": "Banging, smothered, carne asada fries are truly fattening but like I said, banging.  Pupusa meal is a great deal and could keep you satisfied for your whole day and they are delicious.  \nThis place is only about the food and it is so affordable.  Check it out!", "rating": 4, "date": "2011-09-11"}, {"excerpts": ["I was pretty excited to check out this place when I heard that they had carne asada fries. "], "author": "Kim J.", "review": "I was pretty excited to check out this place when I heard that they had carne asada fries. Being the deprived former San Diegan that I am, I jump at any opportunity to get my hands on this deliciousness. \n\nThis place was severely disappointing. Though they did not microwave the fries like other NorCal places I've been to, the fries weren't all that crispy, they used the white cheese again, and the guac was just ok. The only thing that saved the dish was the meat. The carne asada was really good. Nicely grilled and super flavorful. \n\nWon't be going here again personally though I'm sure there are other things that are good here.", "rating": 3, "date": "2011-03-07"}, {"excerpts": ["Been here several times, only had the carne asada fries or the california burrito. ", "Never been let down."], "author": "Chris G.", "review": "Been here several times, only had the carne asada fries or the california burrito. Never been let down.", "rating": 3, "date": "2011-03-27"}, {"excerpts": ["Will definitely be coming back to try their carne asada fries as well! "], "author": "Stefi C.", "review": "I've finally found a place in norcal that serves good california burritos!! Coming from spending four years in San Diego, my standards are pretty high, but Olivio's is definitely top notch in my book when compared to other mexican food I've tried in the bay area.\n\n- California burritos- made with fries that are more steak fry than skinny, but still delicious! A hearty amount of avocado, cheese, and rice. I wish they were open later!!\n- Pupusas- heard all about them from the reviews so we had to get some. They were warm and slightly crispy on the outside, but filled with warm and soft pork and cheese on the inside. Mmmm took some home and def ate one for breakfast. Oops.\n- Plantains- a little dry and overcooked. Skip.\n\nWill definitely be coming back to try their carne asada fries as well! Service isn't great, but I honestly wouldn't mind since their food is so good.\n\nPS. Cash only!", "rating": 4, "date": "2012-02-01"}, {"excerpts": ["their famous Carne Asada Fries and the PORK PUPUSAS (AWESOME!). ", "That was good for lunch AND dinner. \n", "I ordered to go but the place itself didn't look \"dirty\" as describe in previous reviews.\n", "I wish the food came faster since I was in a rush... but it's cool... the taste makes it up!"], "author": "Christian P.", "review": "Really good Salvadorian joint... I had their famous Carne Asada Fries and the PORK PUPUSAS (AWESOME!). That was good for lunch AND dinner. \nI ordered to go but the place itself didn't look \"dirty\" as describe in previous reviews.\nI wish the food came faster since I was in a rush... but it's cool... the taste makes it up!", "rating": 4, "date": "2010-06-18"}, {"excerpts": ["Carne Asada fries. ", "Huge portion, lots of cheese, guacamole and all the fixings. ", "It's like super nachos, but instead of chips it's fries. ", "Its of course very greasy and can be shared amongst friends. ", "Definitely for people having the munchies."], "author": "Ellie J.", "review": "Carne Asada fries. Huge portion, lots of cheese, guacamole and all the fixings. It's like super nachos, but instead of chips it's fries. Its of course very greasy and can be shared amongst friends. Definitely for people having the munchies.", "rating": 3, "date": "2012-09-24"}, {"excerpts": ["Carne asada fries in SF?! ", "Bf and I were so hyped up to finally get our hands on carne asada fries in the city that it ended up in a big disappointment. ", "- Carne asada fries: piping hot soggy fries with an OD of cheese, fresh onions (yuck), jalapenos, sour cream, guac, and pieces of steak. ", "I was only able to handle a few bites before I felt a little queasy from the overly cheesy mess (Artery clogging, fo sho!). ", "After my carne asada fries experience here, next vacation food stop...", "SD!"], "author": "Tracy T.", "review": "Carne asada fries in SF?! Bf and I were so hyped up to finally get our hands on carne asada fries in the city that it ended up in a big disappointment. I've never had a chance to experience it down south (SD), but from how my friend's have raved about how good it is there, I hope it's nothing like this. \n\n- Carne asada fries: piping hot soggy fries with an OD of cheese, fresh onions (yuck), jalapenos, sour cream, guac, and pieces of steak. I was only able to handle a few bites before I felt a little queasy from the overly cheesy mess (Artery clogging, fo sho!). Luckily, a can of Pepsi came to my rescue and washed it all down nicely. \n\n- Chicken Super Burrito: nothing to rave about. It came out really simple, but it was flavored mediocre at most. Rice, chicken, fresh onions (ugh!), guac, sour cream. I needed to use the spicy salsa that came with our chips to accompany it to make it more flavorful. \n\nThis restaurant looks like it only consists of a small hallway upon walking in, but they have additional seating in a room to the left. Service was pretty quick and efficient. After my carne asada fries experience here, next vacation food stop...SD!", "rating": 2, "date": "2009-03-12"}, {"excerpts": ["Carne asada fries.\n\n", "I figured I'd go check out what all the hype was with these carne asada fries.\n\n", "I got the carne asada fries con queso, sin guacamole, onions, jalapenos, etc., ", "etc., etc. ", "It just seemed like too much! ", "So just meat, fries, and cheese. ", "Along with the salsa that I got with my free chips. ", "The serving was huge!!! ", "It was a whole plate of carne asada fries! ", "No wonder I got weird looks from the employees! ", "(Don't forget, I'm a 4'11\", very petite Asian girl...", "and I came by myself.) ", "It was pretty yummy, although my body can probably only handle it once or twice a year. ", "Can you say \"heart attack on a plate\"? ", "I finished almost half of it. ", "The lady at the front asked me if I didn't like it. ", "I told her I loved it, but it was just too big. ", "Try the carne asada fries! ", "Bring someone with you too!"], "author": "Maureen B.", "review": "After wanting Mexican food for the past few days, I figured I'd check Yelp for a decent Mexi place close to the hood (not the Mission) to get some carne asada. What did I find? Carne asada fries.\n\nI figured I'd go check out what all the hype was with these carne asada fries.\n\nFirst, cash only at this place. No cards. No checks. Just cash. A couple of girls who were in here when I arrived had to scrounge up some change in their car to pay for their bill. Come prepared with cash!\n\nAlso, don't wear anything nice (or anything that needs to be dry cleaned). I was hit with the greasy smell as soon as I stepped through the door. Nonetheless, I (along with my Gap t-shirt and my North Face fleece) left smelling greasy too.\n\nNow for the food. Not the cheapest of all Mexican food places, but definitely not going to cause major damage to your wallet. I got the carne asada fries con queso, sin guacamole, onions, jalapenos, etc., etc., etc. It just seemed like too much! So just meat, fries, and cheese. Along with the salsa that I got with my free chips. The serving was huge!!! It was a whole plate of carne asada fries! No wonder I got weird looks from the employees! (Don't forget, I'm a 4'11\", very petite Asian girl...and I came by myself.) It was pretty yummy, although my body can probably only handle it once or twice a year. Can you say \"heart attack on a plate\"? I finished almost half of it. The lady at the front asked me if I didn't like it. I told her I loved it, but it was just too big. (Also, the cook in me wishes they used cheddar instead of whatever cheese they used--mozzarella?)\n\nI say, come here whenever you feel like it. I've lived in the neighborhood for about two years...have passed by this place almost on a weekly basis and it's not too crazy busy. Try the carne asada fries! Bring someone with you too!", "rating": 4, "date": "2009-01-07"}, {"excerpts": ["Their son Frank asked me if I've ever had Carne Asada Fries (which were on my plate), ", "and of course I said I've never even heard of them, but they were off the hook. ", "I was taking about 1/3 home ", "and he said they are fresh cut and cooked and may not reheat very well. ", "I gave it a shot with a touch of canola oil and they fried up med-brown and incredible). ", "We had a split of 2 papusas, side of black beans and those Carne Asada Fries, and these pounds will not shed without a good, long session of something. \n\n"], "author": "Adam X.", "review": "I was basically brought up by an El Salvadorian nanny named Lydia (Hottie, too bad i was like 3). By the time I was 4 or 5 she was making me papusa's. When I went to college, I was taking classes at USC and basically living on Vermont and 30th at a friends place around the corner from Campus. His family was El Salvadorian and I ate there almost every night. Over the past couple years I've heard about Olivo's from friends, found it on Yelp, and finally thought I'd give it a try. \n\nQuickNote: Olivo's was on Market x 1st for 15 years and in their new location for 2 years. Its just on the N. Edge of the Tenderloin, and the S. Edge of Nob Hill. Great Location. \n\nWhat I love about Olivo's is its family owned and operated. So love goes into every dish. Jose the chef and his wife Antonia (who takes care of the front of house) were wonderful, they laughed with me even though I'm just a white kid from the west side who purports to know what El Salvadorian food is actually about. The least I can say is I have a good idea. Their son Frank asked me if I've ever had Carne Asada Fries (which were on my plate), and of course I said I've never even heard of them, but they were off the hook. I was taking about 1/3 home and he said they are fresh cut and cooked and may not reheat very well. I gave it a shot with a touch of canola oil and they fried up med-brown and incredible). We had a split of 2 papusas, side of black beans and those Carne Asada Fries, and these pounds will not shed without a good, long session of something. \n\nBeverages are well priced (Sodas $1, 12oz Beers $2-3, 32oz beer $5). Meals are all around $10. Breakfast $6, Burrito's $6.\n\nA guy came in and ordered a burrito (obvioulsy a student) and he asked $5 (even though they are $5.95+)? And jose says... um yes $5. Nice. \n\nSo... I will be back.... and I will be back for the Carnitas!\n\nBy the way... I hate to say it but... Jose and Antonia's Papusas were better than anything i had in my youth. Thats why they are getting a solid 5 stars. \n\nCASH ONLY", "rating": 5, "date": "2009-01-13"}, {"excerpts": ["I was sooo excited that there was a place in SF with carne asada fries.  "], "author": "Danny P.", "review": "I was sooo excited that there was a place in SF with carne asada fries.  However, it was nothing like from what I remembered when I had it in San Diego.  \n\nThe fat fries came out hot and soaked in oil and it seemed like there were at least 5 layers of cheese on top of the fries.  After a couple bites I felt like a I was shaving a couple of years of my life expectancy.", "rating": 2, "date": "2009-03-07"}, {"excerpts": ["Aside from the famous carne asada fries and signature pupusas, the nachos are solid alternative, with the same tempting components piled high on chips that actually have some body - so that you can taste more than a hint of corn -  instead of simply being a wafer-thin vehicle for condiments.\n\n"], "author": "Alex B.", "review": "A burrito with discrete ingredients is a rarity this far north of the border, and it's always nice to find one of the places where such a treat can be acquired. Wrapped inside a tortilla is actually one of the few places I prefer meat to vegetables, and the carnitas at Olivo's makes my taste buds happy every time. It manages to have crispy edges while maintaining a deliciously tender, chewable texture, and partnering excellently with the smooth flour, flavorful rice, better-than-usual-quality cheese, fresh salsa, and delectable beans that make up the remainder of said burrito. Aside from the famous carne asada fries and signature pupusas, the nachos are solid alternative, with the same tempting components piled high on chips that actually have some body - so that you can taste more than a hint of corn -  instead of simply being a wafer-thin vehicle for condiments.\n\nThe staff are all incredibly friendly people, more than willing to accommodate a special request or recommend something to fill your stomach. The very first time I came here it was near closing time, and having failed to notice the prominent \"Cash Only\" signs, was only packing plastic. The lovely woman working the counter was nice enough to let me take my dinner away sans payment, and with only the promise of returning tomorrow with the eight bucks I owed. As a last note, while the transvestites that flock to the corner of Post and Larkin can be rather intimidating, I find that carrying an extra cigarette or two to hand out will turn them friendly in a hurry, although that has a tendency to make them think I want to proposition them - do I really look all that much like someone who would engage their services?", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["You treat carne asada fries like it was the biggest crack rock in Modesto because when I went to Olivo's today, the chef came out of his kitchen and asked why so many people came in and asked for carne asada fries. ", "Yes, it's not embarrassing ", "*at all* having to tell the sweet oompa loompa like short order cook senior that you are part of a fatty fat fat social network group on the *coughcoughinternetcoughcough", "The carne asada fries were pretty good. ", "The cheese was a little too melty and a bit too many onions on the guac for my taste... but even mediocre carne asada fries trump chump ass nachos any day. ", "mmmm. ", "I also got un typo of each pupusa: queso, queso con frijole ", "y queso con pork", "..... "], "author": "Mary F.", "review": "Yelpers are fucking rabid. You treat carne asada fries like it was the biggest crack rock in Modesto because when I went to Olivo's today, the chef came out of his kitchen and asked why so many people came in and asked for carne asada fries. Yes, it's not embarrassing *at all* having to tell the sweet oompa loompa like short order cook senior that you are part of a fatty fat fat social network group on the *coughcoughinternetcoughcough*\n\nThe carne asada fries were pretty good. The cheese was a little too melty and a bit too many onions on the guac for my taste... but even mediocre carne asada fries trump chump ass nachos any day. mmmm. I also got un typo of each pupusa: queso, queso con frijole y queso con pork..... i don't remember the word for pork.\n\nDamn you Mr. Vernalde and 3 years of High School Spanish!?! Donde es la biblioteca? Es proximo aqui? Gracias! Hasta semana! The only other Spanish I know fluently is Spanish mass. Padre nuestro que estas en los cielos, santificado sea tu nombre, venga tu reyno. *screw you, mom... get out of my head Jesus!*\n\nWhile I was waiting, the lady at the counter even gave me an impromptu Spanish lesson. (Which I give her mad props for. It takes a lot to reach out to a sad sad Asian girl and teach her how to say \"More sour creme please\"... \"Mas nata agria, por favor!\". You really don't know how handy that is to me (Answer: Immensely!) But I'll stick to English. Still, gracias para la comida.", "rating": 4, "date": "2007-11-02"}, {"excerpts": ["We came here because of the carne asada fries we read about on Yelp and the picture really made us drool... ", "We also wanted to try the pork and cheese pupusa and asked the lady what else she would recommend and she asked if we would like to try her taco.  ", "Finally the infamous carne asada fries ($6.50) came - ", "it was just like the photo.  ", "We were not disappointed at all.  ", "The fries were not crispy ", "but it was real potato ", "so it was almost like eating a mashed baked potato with all the goodies on top.  ", "The carne asada was SO good...", "every morsel was tasty, add that to pulling cheese, fresh guacamole "], "author": "Gloria H.", "review": "Never have I felt the need to protect my husband...but my instinct kicked in when this tranny (and a very terrible looking one with really smeared lipstick) tried to grab a passerby's crotch!  At that point, I was on guard and ready to beat this person to the pulp IF he dares get close to my hubby.  \n\nWe got into Olivo's safely.  Walking in, you feel like you walked into a family's kitchen.  It's nothing fancy and truth be told, we would have never noticed this place if we weren't looking for it.  \n\nWe took a seat at the lower level.  We came here because of the carne asada fries we read about on Yelp and the picture really made us drool... We also wanted to try the pork and cheese pupusa and asked the lady what else she would recommend and she asked if we would like to try her taco.  Sure, let's do carnitas soft taco with everything.\n\nWe munched on the chips and salsa while waiting.  The salsa was very good and we had to get refill.\n\nThe pupusa ($4) came first - they split them onto 2 plates for us and came with a bowl of marinated slaw.  The pupusa was pretty big and it looked grilled and not fried, which is good.  We were hooked after the first bite - it was soft and chewy with tender pork and cheese pulling - it's like a soft quesadilla but better.  \n\nNext came the carnitas taco ($4) - it looked so good...I had to dig in before it got cold and was very happy with it.  It was so flavorful and there were so much meat.  This turns out to be my favorite dish of the night.\n\nFinally the infamous carne asada fries ($6.50) came - it was just like the photo.  We were not disappointed at all.  The fries were not crispy but it was real potato so it was almost like eating a mashed baked potato with all the goodies on top.  The carne asada was SO good...every morsel was tasty, add that to pulling cheese, fresh guacamole and I see why so many raved about it.\n\nThe Regia at 32 oz. was a good deal for $5.95.  It was icy cold and they give you too icy cold mugs with it - icy cold beer is happiness!\n\nThe ladies there were very nice and checked in often.  \n\nWe were fulfilled and happy...all at a price of $21!  We will return even if I have to watch out for my husband.", "rating": 4, "date": "2008-08-15"}, {"excerpts": ["Blame it on the Carne Asada Fries.\n\n", "After having some Carne Asada Fries at the San Jose Flea Market, my roommate was dying to try the version from this place, another great find from Yelp.  ", "In case you've been under a rock, these an \"Irish\" version of nachos.  ", "Instead of chips, fresh French Fries are covered with steak, cheese, guacamole, sour cream, jalapeno, and onion and cilantro upon request.  ", "I like them so much better than regular nachos, as I'm not crazy about beans.   ", "I think I may have found a new staple!  ", "The Carne Asada Fries are not on the menu, but they knew I was Yelper because that seems to be the only way people find out about them.  "], "author": "Michael M.", "review": "My arteries are clogging as I write this, so if I keel over and die before I finish, you'll know why!  My Last Will and Testament is in my Safe Deposit box.  Blame it on the Carne Asada Fries.\n\nONLY in San Francisco can you find a Mexican / Salvadorean restaurant in a sea of Vietnamese restaurants.  \n\nAfter having some Carne Asada Fries at the San Jose Flea Market, my roommate was dying to try the version from this place, another great find from Yelp.  In case you've been under a rock, these an \"Irish\" version of nachos.  Instead of chips, fresh French Fries are covered with steak, cheese, guacamole, sour cream, jalapeno, and onion and cilantro upon request.  I like them so much better than regular nachos, as I'm not crazy about beans.   I think I may have found a new staple!  But, I am trying to lose weight, so this would be a treat.\n\nI also bought some pupusas.  They were great, but only because of the hot sauce that comes with the meals.  I don't think that pupusas is traditionally served with hot sauce, but it works here!  Not the best in San Francisco, as I wanted more filing, but still a good deal at $3.75 for two.\n\nThe Carne Asada Fries are not on the menu, but they knew I was Yelper because that seems to be the only way people find out about them.  It's nice to think that this can possibly only exist to us Yelpers.\n\nNote that Olivo's is CASH ONLY!", "rating": 4, "date": "2008-03-10"}, {"excerpts": ["Carne Asada Fries - ", "They have them and its reason enough to come here ", "and they're better than at other places.  ", "Just step over the crackheads on the sidewalk, run past the tranny hookers and come to Olivo's. "], "author": "Dmitry S.", "review": "Carne Asada Fries - They have them and its reason enough to come here and they're better than at other places.  Just step over the crackheads on the sidewalk, run past the tranny hookers and come to Olivo's. I'd recommend the Chicken Quesadilla or anything with Steak. \n\nThe menu is extensive and the prices are reasonable (easily under $12 per person with appetizers) The proprietors seem pretty nice and the service isn't bad. But you will have to go up and pay yourself, just fyi.  Also remember to bring cash, since that's all the take.  The place has a nice vibe too, some other review mentioned NY feel and I agree.  \nTheir Salvadorean food is delicious and you should try it if you want to stray from the regular taco or burrito you always get.  \n\nBottom Line: Just give Olivo's one try. You could pretend you're going to Central America and a beautiful seniorita (Olivia?) comes up to you and winks and asks you to follow.  Intrigued, you go along and discover that not only is she gorgeous but also extremely competent... at cooking.", "rating": 4, "date": "2008-05-12"}, {"excerpts": ["Being a part of the fantastically helpful online community that is Yelp, I knew what to expect......and to also order the carne asada fries.  ", "One of my friends took a look and just simply said, \"I can't eat those.  ", "I'm afraid I'll shit my pants later.", "\"  "], "author": "Norm U.", "review": "I hit this place up last weekend for a friend's birthday.  Being a part of the fantastically helpful online community that is Yelp, I knew what to expect......and to also order the carne asada fries.  One of my friends took a look and just simply said, \"I can't eat those.  I'm afraid I'll shit my pants later.\"  A valid excuse to be sure, but the mere threat of self defecation isn't enough to stop me from indulging in this bit of artery clogging heaven.  \n\nThe rest of the grub was great as well.  Having never been to an El Salvodoran restaurant before, I hit up the pupusas and were not disappointed.  Someone else had the flank steak and it was cooked and spiced to perfection.  The massive Regia beers washed all of this culinary goodness down perfectly.  And the best part?  The total bill was $81 for 7 of us.  Yes, you read that correctly.\n\nThe only knock on this place is that the service was a little slow, but that's to be forgiven as I only spied 3 people working in the entire restaurant - and that includes the cook.  But you can bet your ass that I'll be back.", "rating": 4, "date": "2008-08-25"}, {"excerpts": ["A couple of months ago, I went kind of SoCal nostalgic and wanted carne asada fries, so ", "That annoyed the heck out of me, so one day, as soon as I got off work - my buttocks drove out to Olivo's just so that i can sample the NorCal version of carne asada fries.\n\n", "It will definitely satisfy my cravings for carne asada fries if ever i have a moment of weakness, and want it.\n\n", "i'm a fan of Olivo's carne asada fries!", "\" "], "author": "J D.", "review": "A couple of months ago, I went kind of SoCal nostalgic and wanted carne asada fries, so a friend and I searched Yelp and lo and behold - a restaurant IN the city that carries one of my favorite (and missed) meals.\n\nThe first couple of times I've gone, the restaurant was closed or was just closing. That annoyed the heck out of me, so one day, as soon as I got off work - my buttocks drove out to Olivo's just so that i can sample the NorCal version of carne asada fries.\n\nIt's not on the menu - it's like one of those secret orders kinda things - so you have to ask for it. It took awhile to make it, and i have to say that i'm impressed. It will definitely satisfy my cravings for carne asada fries if ever i have a moment of weakness, and want it.\n\nThe only thing that was different was the amount of condiments on it. Guacomole could be more, and the fries could be a little bit bigger. But hey, you can't be picky about something that isn't as readily available as it is in SoCal, so I say, \"yay! i'm a fan of Olivo's carne asada fries!\" =)\n\nanyone wanna go?", "rating": 4, "date": "2008-06-24"}, {"excerpts": ["this place was cheap, but it was okay\n\ni had carne asada fries "], "author": "Stella J.", "review": "this place was cheap, but it was okay\n\ni had carne asada fries i was kinda disappointed in them, it had no comparison to the real deal in san diego. their good for what you can find in san francisco, but not as good as san diego. my friend had the puposas, she said they were okay and her carne asada was kind of hard to cut. service was friendly though.", "rating": 3, "date": "2008-11-21"}, {"excerpts": ["What's all this talk about carne asada fries?  ", "Hrmm."], "author": "Manny P.", "review": "Pupusas.\n\nThey're almost as much fun to say as they are to eat.  Gosh, the corn meal is just so freaking good. It reminds me of my jefita's freshly made tortillas de maiz.\n\nWhy is it that we don't have many places that serve those amazing little things in Phoenix?  You've got more Mexican food joints on every street corner than Starbucks there, and that's saying a lot.  Very few Central American restaurants, for shame.\n\nI introduced my little bro to pupusas through this joint, and I've got him hooked.  \n\nAffordable, quick, delicious. Or, as Dora has taught little blonde-haired, blue-eyed kids all across the US to say, \"Delicioso!\"\n\nSo what if they screwed up the kind of beans I ordered (I said black, not pinto). They were still so good, I almost wanted to give them a call to thank them.\n\nWhat's all this talk about carne asada fries?  Hrmm.", "rating": 4, "date": "2008-07-17"}, {"excerpts": ["Didn't expect much from the carne asada fries and I was correct. ", "It definitely nothing like San Diego's ", "but it's better than nothing. ", "The fries are softer and there aren't as many toppings. ", "What helps make carne asada great is the marinade which wasn't that impressive here. ", "Meat was a bit more lean to my liking. ", "This was my first time having pupusas ", "so I didn't know what to expect. ", "They weren't bad but they were not great either. ", "I have to say my favorite dish was the California burrito. ", "These were actually pretty flavorful and tasted great (though still not close to SD). "], "author": "Jonathan L.", "review": "Didn't expect much from the carne asada fries and I was correct. It definitely nothing like San Diego's but it's better than nothing. The fries are softer and there aren't as many toppings. What helps make carne asada great is the marinade which wasn't that impressive here. Meat was a bit more lean to my liking. This was my first time having pupusas so I didn't know what to expect. They weren't bad but they were not great either. I have to say my favorite dish was the California burrito. These were actually pretty flavorful and tasted great (though still not close to SD). One big plus is that Olivo's offers Mexican cola, which comes with real sugarcanes rather than syrup!\n\nOverall, this place is okay. No real complaints but it's kind of your typical store.", "rating": 3, "date": "2009-08-10"}, {"excerpts": ["The Carne Asada fries were very good. ", "We ordered papusas and the steak and plantains. ", "The plantains were fried perfectly and were delicious when paired with the steak it came with. ", "What a good combination of savory and sweet! ", "Papusas were crisp, not soggy ", "and I could barely sop up the beans and cheese that came with both dishes. "], "author": "Emily H.", "review": "Very good. I think here it is more El Salvadoran (?) so ordering those types of items on the menu will result in a better experience. The Carne Asada fries were very good. We ordered papusas and the steak and plantains. The plantains were fried perfectly and were delicious when paired with the steak it came with. What a good combination of savory and sweet! Papusas were crisp, not soggy and I could barely sop up the beans and cheese that came with both dishes. The beer we had (don't remember what its called) was very good, light enough to match with the heavier food we were eating, but not so light that it was lacking flavor. \n\nWould definitely come again. Great service as well.", "rating": 4, "date": "2009-03-23"}, {"excerpts": [", I'm looking forward to going back - maybe someday I'll even have a good enough workout to try the carne asada fries."], "author": "Lisa K.", "review": "Nice combo plates and you get a good amount of food (enough for 2-3 meals) in them. Everything was tasty. It took a while to get food to go - I'd love to get a menu and be able to call ahead. Good prices, not-overly-friendly service, I'm looking forward to going back - maybe someday I'll even have a good enough workout to try the carne asada fries.", "rating": 4, "date": "2008-12-13"}, {"excerpts": ["\" i mean the fact that they not only serve CARNE ASADA FRIES (good luck finding them outside of SD; i heard baldo's is closed in the east bay), but they also serve my favorite - CARNITAS FRIES!  \n\n"], "author": "dan a.", "review": "i can't believe i haven't yelped OLIVO'S yet.\n\nwell, it's probably because i don't want you to know about it.\n\nand by \"it\" i mean the fact that they not only serve CARNE ASADA FRIES (good luck finding them outside of SD; i heard baldo's is closed in the east bay), but they also serve my favorite - CARNITAS FRIES!  \n\nthe staff are always nice and they usually know me (and my order!) when i come in.\n\nnow that you've read this, don't tell anybody!  this review will self-destruct in 10 seconds...", "rating": 4, "date": "2010-11-12"}, {"excerpts": ["i did not believe i would ever find some carne asada fries  or Cali Burritos in SF, but alas i found one of the two!!\n\n", "Granted that I have not tried the rest of their food, these 4 stars are for the Carne Asada fries that fix my craving.  ", "Although they are not like Lolita's Carne Asada fries back in my hometown, when you're in the mood for some So Cali style carne asada fries this is a great place.  \n\n"], "author": "Cindy M.", "review": "Thanks Yelpers! i did not believe i would ever find some carne asada fries  or Cali Burritos in SF, but alas i found one of the two!!\n\nGranted that I have not tried the rest of their food, these 4 stars are for the Carne Asada fries that fix my craving.  Although they are not like Lolita's Carne Asada fries back in my hometown, when you're in the mood for some So Cali style carne asada fries this is a great place.  \n\nOh and the tranny bit everyone writes about is really true...", "rating": 4, "date": "2008-03-30"}, {"excerpts": ["carne asada Fries!!!!! ", "Best post drinking food:)"], "author": "Julie R.", "review": "carne asada Fries!!!!! Best post drinking food:)", "rating": 5, "date": "2013-08-21"}, {"excerpts": ["Carne Asada Fries, say it with me folks, Carne Asada Fries, Carne", "... well you get the picture. ", "These are the absolute best, most fattening, most fantastic fries ever, and I am a french fry fanatic! ", "I also, love Carne Asada, these babies are perfectly marinated, with mouthwatering steak, cheese, guacamole, atop perfectly cooked french fries. ", "A friend of mine introduced me to this place, and now I am a fan. ", "I will admit that I have yet to try anything else on the menu, but I will get around to it. ", "I just can't get past the Carne Asada Fries!"], "author": "Anthony K.", "review": "Carne Asada Fries, say it with me folks, Carne Asada Fries, Carne... well you get the picture. These are the absolute best, most fattening, most fantastic fries ever, and I am a french fry fanatic! I also, love Carne Asada, these babies are perfectly marinated, with mouthwatering steak, cheese, guacamole, atop perfectly cooked french fries. A friend of mine introduced me to this place, and now I am a fan. I will admit that I have yet to try anything else on the menu, but I will get around to it. I just can't get past the Carne Asada Fries!", "rating": 4, "date": "2009-11-15"}, {"excerpts": ["Who knew that all I had to do was walk a few blocks away for a delicious california burrito and carne asada fries.  ", "I don't recommend ordering both unless you're going to split it with another person or two. ", "But, I haven't had carne asada fries or a california burrito in a long time, so ", "I ordered both in the hopes that I could finish some for lunch and the rest for dinner.  ", "Big mistake.  ", "I finished about 1/3 of each for lunch and was still full for dinner, even after going to the gym. ", "The fries aren't what I was used to from the ones they have in San Diego, so be prepared for that.  ", "They're cut a little wider and seemed to be cooked a different way, it's not bad, but it's different."], "author": "Joe N.", "review": "This place is awesome!  I haven't found many, or any, places that have california burritos in SF, but I was lucky to find Olivo's.  After searching a bunch of taquerias in the Mission, I pretty much gave up hope.  Who knew that all I had to do was walk a few blocks away for a delicious california burrito and carne asada fries.  I don't recommend ordering both unless you're going to split it with another person or two. But, I haven't had carne asada fries or a california burrito in a long time, so I ordered both in the hopes that I could finish some for lunch and the rest for dinner.  Big mistake.  I finished about 1/3 of each for lunch and was still full for dinner, even after going to the gym. The fries aren't what I was used to from the ones they have in San Diego, so be prepared for that.  They're cut a little wider and seemed to be cooked a different way, it's not bad, but it's different.", "rating": 4, "date": "2012-02-16"}, {"excerpts": ["Everything we've had here has been great, the plantains, pupusas, carne asada fries, and all the breakfast menu items are good bets.  ", "It's just a good neighborhood spot to grab some spanish food without having to go to the mission."], "author": "courtney l.", "review": "I have never been disappointed here.  Although I was boycotting Olivo's for a couple months because the older lady that runs the place was kinda unsmiley one day, but that's whatevs.  Everything we've had here has been great, the plantains, pupusas, carne asada fries, and all the breakfast menu items are good bets.  It's just a good neighborhood spot to grab some spanish food without having to go to the mission.", "rating": 4, "date": "2010-11-13"}, {"excerpts": ["may have to go back some time to try the Pork Chops and Carne Asada fries."], "author": "Stu C.", "review": "Not bad at all. Used to live around the corner from this place, but finally went a year after moving out. Had the Carne Asada burrito. pretty massive. The joint was a little divey (the ceiling was leaking right onto the table behind ours), but it wasn't crowded at all and I was in serious need of a burrito so I got it quick. may have to go back some time to try the Pork Chops and Carne Asada fries.", "rating": 3, "date": "2010-07-25"}, {"excerpts": ["Don't expect San Diego carne asada fries here. ", "The papusas were good though."], "author": "sunny c.", "review": "Don't expect San Diego carne asada fries here. The papusas were good though.", "rating": 3, "date": "2010-03-03"}, {"excerpts": ["I go for the California Burritos and Carne Asada Fries alone."], "author": "Mike B.", "review": "Ate here last night. Pretty bomb. I go for the California Burritos and Carne Asada Fries alone.", "rating": 4, "date": "2010-06-17"}, {"excerpts": ["Carne Asada Fries are HERE! ", "Everything else at this place is good (i.e. pupusas), but this is the holy grail of mexican food in the city... ", "they have Carne Asada Fries! ", "And it's damn good too."], "author": "Tuan N.", "review": "Carne Asada Fries are HERE! Everything else at this place is good (i.e. pupusas), but this is the holy grail of mexican food in the city... they have Carne Asada Fries! And it's damn good too.", "rating": 5, "date": "2007-10-31"}, {"excerpts": ["carne asada fries and bean and cheese pupusas.\n\n"], "author": "Dot K.", "review": "carne asada fries and bean and cheese pupusas.\n\nthat is all i am going to say about it.", "rating": 5, "date": "2008-10-23"}, {"excerpts": ["my fave were the carne asada fries!!!!! ", "service is great, always welcoming and very friendly!!! ", "=)"], "author": "Damien H.", "review": "awesome, awesome, awesome!!!!!! thank you olivo's for a delicious lunch....my fave were the carne asada fries!!!!! service is great, always welcoming and very friendly!!! =)", "rating": 5, "date": "2011-09-20"}, {"excerpts": ["carne asada fries in SF.\n\n", "Olivo's carne asada fries are not SD carne asada fries. ", "its ", "like they heard someone report what the ingredients were, and guessed that they all just piled together and miraculously became carne asada fries. ", "it was gloopy, a pile, just a plop of ingredients without any sense of being carne asada fries.\n\n", "ps\nbecause of the yelpers, carne asada fries are now on the menu, under the specials"], "author": "Darrell L.", "review": "i read the thread and cried a little. pee'd myself a little. and then, finally, smiled.\n\ncarne asada fries in SF.\n\nhopes and dreams were fulfilled, like those of adolescent males on prom night, who asked Julie Blith to go with them because they knew she was easy. Julie had a heavenly rack - but, the fries, yes, back to the fries...\n\nyou know how high expectations tend to lead to failure and a sense of despair? yes, well, Olivo's got me.\n\nOlivo's carne asada fries are not SD carne asada fries. its like they heard someone report what the ingredients were, and guessed that they all just piled together and miraculously became carne asada fries. but this is not true, sadly.\n\nwrong kind of cheese (too oily and prone to meltiness), carne asada was not the best, fries were the mushy frozen type, and it was all, just, well, a gloop. too technical? it was gloopy, a pile, just a plop of ingredients without any sense of being carne asada fries.\n\nprops to Olivo's for listening to the Yelp community and giving it a try, but it just doesnt work. ill head back, try one of their plates, and see if another star can slide in on the scale.\n\nps\nbecause of the yelpers, carne asada fries are now on the menu, under the specials", "rating": 3, "date": "2007-11-19"}, {"excerpts": ["Had the chili verde burrito, pupusas, carne asada fries. ", "Wonderful value, friendly owner/server. ", "A new favorite for me. ", "Dinner for two with leftovers at $22."], "author": "David Y.", "review": "Solid, homestyle flavors that don't lie. Had the chili verde burrito, pupusas, carne asada fries. Wonderful value, friendly owner/server. A new favorite for me. Dinner for two with leftovers at $22.", "rating": 4, "date": "2009-01-17"}, {"excerpts": ["I only wish I had read the Yelp reviews before going--I would have ordered the carne asada fries."], "author": "QuodE D.", "review": "Friendly staff and good burritos.  I only wish I had read the Yelp reviews before going--I would have ordered the carne asada fries.", "rating": 4, "date": "2007-11-26"}, {"excerpts": ["Carne Asada Fries. "], "author": "Angela T.", "review": "Carne Asada Fries. Enough said.\n\nPupusas - leftovers still good even after being reheated. In fact, they may taste better the next day.\n\nI'm hungry now.", "rating": 4, "date": "2009-08-16"}, {"excerpts": ["get the carne asada fries. ", "just get it. ", "it's good. ", "how is it good? ", "my heart doesnt slow down when i share it with a friend, and it doesnt feel like you have a huge grease ball in your stomach thanks to the portion size."], "author": "Anthony C.", "review": "get the carne asada fries. just get it. it's good. how is it good? my heart doesnt slow down when i share it with a friend, and it doesnt feel like you have a huge grease ball in your stomach thanks to the portion size.", "rating": 5, "date": "2011-06-07"}, {"excerpts": ["the carne asada fries are still bomb and the cali burritos are what dreams are made of. \n\n"], "author": "Jason B.", "review": "this place never fails to provide amazing grub,\n\nfinally got around to trying the pupusas. wow. amaaaazingggg\n\nthe carne asada fries are still bomb and the cali burritos are what dreams are made of. \n\nyea. im saying i dream of carne asada, french fries and guac. \n\njeliz?", "rating": 5, "date": "2011-02-03"}, {"excerpts": ["Otherwise, they're also known for being one of the only places in SF that offers carne asada fries - or in my case, carnitas fries - which, while not exactly up to San Diego standards, are a delicious endeavor into the SoCal mexican style.  ", "This is definitely one of my favorite spots in SF, and being a local ", "I'm always down to support.  ", "Go try it!  ", "Just don't go on Sunday's since they're closed."], "author": "Ryan L.", "review": "The cooking times are sometimes a little long, but Olivo's is one quality establishment.  Liz (daughter of the owners I believe) is awesome and friendly, and the food is always amazing.  Try the tilapia in green sauce and you won't be disappointed.  Otherwise, they're also known for being one of the only places in SF that offers carne asada fries - or in my case, carnitas fries - which, while not exactly up to San Diego standards, are a delicious endeavor into the SoCal mexican style.  This is definitely one of my favorite spots in SF, and being a local I'm always down to support.  Go try it!  Just don't go on Sunday's since they're closed.", "rating": 4, "date": "2009-03-18"}, {"excerpts": ["I'm a SoCal transplant who came here for the carne asada fries, so I'm going to weigh in with my opinion on them for those looking to get their fix of SoCal styled mexican food in San Francisco.\n\n"], "author": "Ben T.", "review": "I'm a SoCal transplant who came here for the carne asada fries, so I'm going to weigh in with my opinion on them for those looking to get their fix of SoCal styled mexican food in San Francisco.\n\nThe portion was a bit smaller than what I'm used to in SD, but I finished them feeling pretty full. Carne Asada tasted great. The plate was very oily, which I consider a good thing. The fries had guacamole, cheese, and sour cream. Onions and Jalapenos on the side.\n\nI loved them, won't be missing SoCal mexican food as much anymore.", "rating": 4, "date": "2009-04-26"}, {"excerpts": ["i ordered pupusas and the carne asada while my friend ordered their carne asada fries. ", "first of all i've had many carne asada before from different restaurants but this one was eh. ", "the meat had no flavor and was lukewarm. ", "i think that is my first and last time going to this place. ", "we heard about the raving reviews about their carne asada fries here and wasn't satisfied.  ", "the fries they gave us was not fully cooked and truthfully it did not compare to the ones we had in SD."], "author": "Lynn P.", "review": "i'm sorry but this place was a real disappointment. i ordered pupusas and the carne asada while my friend ordered their carne asada fries. first of all i've had many carne asada before from different restaurants but this one was eh. the meat had no flavor and was lukewarm. i think that is my first and last time going to this place. we heard about the raving reviews about their carne asada fries here and wasn't satisfied.  the fries they gave us was not fully cooked and truthfully it did not compare to the ones we had in SD.", "rating": 1, "date": "2008-12-01"}], "polo chicken": [], "marudo": []}