{"masala chai": [{"excerpts": ["We got refills for the Masala Chai. ", "Definitely will visit again the next time we are around."], "author": "Sabrina J.", "review": "Awesome food and service. The portions are large for such a fair price. We got refills for the Masala Chai. Definitely will visit again the next time we are around.", "rating": 5, "date": "2017-12-19"}, {"excerpts": ["A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. ", "A great restaurant that I find myself in weekly. ", "Give it a try...,"], "author": "Michael T.", "review": "This has become my favorite Indian Restaurant! After a resent neighborhood move, I was thrilled to discover this gem of a place in the Haight. The food is fresh, served hot ( no buffet ) by a charming and thorough wait staff. I personally like spicy hot, but the heat of the dishes is negotiable and the servers are especially helpful in recommending heat as well as menu items. Papadum, a wafer thin cracker is brought to the table right after you order with 3 sauces, a spicy, a sweet and a mint chutney. Their Daal soup is some of the best I have had. Thick and temperature hot with bits of lentils and goodness. I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. Potatoes and cauliflower cooked perfectly. Tender but with a tooth... not mushy. A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. A great restaurant that I find myself in weekly. Give it a try...,", "rating": 5, "date": "2017-08-18"}], "indian iced tea": [], "indian spiced chai": [], "tandoori chicken wings": [{"excerpts": ["$4.95 \n\nTandoori Chicken Wings = awesome. ", "Moist and flavorful chicken wings. ", "And I loved the onions and peppers that come with them! ", "$10.95\n\nChicken Tikka Masala = excellent. "], "author": "Fannie S.", "review": "We tried delivery from this place recently.  \n\nVegetable Pakora = full of flavor and crisp. Even for delivery. $4.95 \n\nTandoori Chicken Wings = awesome. Moist and flavorful chicken wings. And I loved the onions and peppers that come with them! $9.95 \n\nBaigan Bharta = smoky eggplant. Delicious. $10.95 \n\nSaag Paneer  = good. On the mild side. $10.95\n\nChicken Tikka Masala = excellent. Slightly sweet, smoky and hit the spot. He loved it. $12.95 \n\nRaita  = typical. $2.95 \n\nMixed Pickle  = Tart and spicy. Exactly what he wanted. $1.95 \n\nBasmati Rice = good. $2.95 \n\nGarlic Naan = good. (Better after sticking it in the oven though.) $2.95 \n\nKheer  = a most peculiar version. It was tart/sour. I ended up composting because I couldn't eat more than 3 spoonfuls. $3.95 \n\nPrices = moderate. $64.50 before taxes and discount code. We had leftovers for two more meals.", "rating": 4, "date": "2016-11-16"}, {"excerpts": ["- Tandoori Chicken Wings, $9.95 these were good.\n", "- Tandoori Assorted, $10.95 - fine. ", "No grizzly meats, ", "so that's good. ", "But they were missing a nice little tangy kick.\n", "- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. ", "Very low on flavor. ", "Highly overpriced.\n", "Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. ", "Also missing that nice tikka tangy kick.\n", "- Butter Chicken Masala, $12.95 - fine.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "tandori assorted": [], "chicken": [{"excerpts": ["We ate a chicken bharta ( boneless breast chicken with eggplant ) and a chicken vindaloo(chicken with ginger onion and tomato sauce). ", "Price was also ok for 2, the bill was $59 including 2 bears Stella on the tap, 1 San pellegrino, 2 naans and the tip.\n", "So I highly recommend this place."], "author": "Jacques H.", "review": "What a wonderful surprise !!!!\nI have been traveling to India for 30 years and the taste of the food served today at Om Indian cuisine was as good as any food I ever ate in India. Waiters were very friendly and service was very fast too.\nWe ate a chicken bharta ( boneless breast chicken with eggplant ) and a chicken vindaloo(chicken with ginger onion and tomato sauce). Price was also ok for 2, the bill was $59 including 2 bears Stella on the tap, 1 San pellegrino, 2 naans and the tip.\nSo I highly recommend this place.", "rating": 5, "date": "2018-09-16"}, {"excerpts": ["My order's always include at least one chicken tikka masala, as that's one of my favorite things that they make. ", "It's bursting with flavor, and the sauce is a little bit different than some other places - maybe heavier on the vegetable content actually - ", "I'm really fond of it. ", "I also love their chicken chili, and their coconut chicken. "], "author": "Chris S.", "review": "I've ordered delivery from this place a few times, I have been really impressed. \n\nMy order's always include at least one chicken tikka masala, as that's one of my favorite things that they make. It's bursting with flavor, and the sauce is a little bit different than some other places - maybe heavier on the vegetable content actually - I'm really fond of it. They're also nice and include plenty of sauce for your rice or even to save and cook some yourself. \n\n I also love their chicken chili, and their coconut chicken. Both are also a little different than other places but still delicious. \n\nMy biggest complaint is the price/size. Compared to some other Indian places, the price is a little larger and the size is a little smaller. Still, I'll definitely be back! Well, figuratively - I guess they'll be back at my place! Delivery is just way convenient, and I have no complaints about the flavor etc.", "rating": 4, "date": "2018-06-07"}, {"excerpts": ["I ordered Bhindi Masala and chicken tikka masala with garlic naan. ", "Everything was awful. ", "Bhindi masala so over cooked it was inedible. ", "Tasted burnt and bitter and just was terrible. ", "Usually Bhindi masala is herbaceous and flavorful, this was definitely not that. ", "The chicken tikka masala was so salty. ", "At other Indian restaurants the chicken falls apart because it is so tender in the sauces. ", "This was hard chicken with zero flavor, I've had been chicken tikka masala from Trader Joe's. ", "The naan was also burnt and flavorless. ", "Did I get a bad night for the chef? ", "I don't know ", "but I won't be trying this place again, super disappointing."], "author": "Meghan G.", "review": "I got takeout from here after great reviews on here. I ordered Bhindi Masala and chicken tikka masala with garlic naan. Everything was awful. Bhindi masala so over cooked it was inedible. Tasted burnt and bitter and just was terrible. Usually Bhindi masala is herbaceous and flavorful, this was definitely not that. The chicken tikka masala was so salty. At other Indian restaurants the chicken falls apart because it is so tender in the sauces. This was hard chicken with zero flavor, I've had been chicken tikka masala from Trader Joe's. The naan was also burnt and flavorless. Did I get a bad night for the chef? I don't know but I won't be trying this place again, super disappointing.", "rating": 1, "date": "2018-10-12"}, {"excerpts": ["Call me basic, but I can't resist ordering chicken tikka masala.\n\n", "The nice twist this time is we ordered salmon instead of chicken and it was delicious!  ", "The salmon was grilled perfectly before going into the sauce, and was nice and tender.  ", "The garlic naan is great by itself, and sublime with the tikka masala.  "], "author": "Jessica L.", "review": "Call me basic, but I can't resist ordering chicken tikka masala.\n\nThe nice twist this time is we ordered salmon instead of chicken and it was delicious!  The salmon was grilled perfectly before going into the sauce, and was nice and tender.  The garlic naan is great by itself, and sublime with the tikka masala.  We also ordered the veggie momos, aloo gobi, and rice.  Everything was done well, and the food came out at a reasonable pace.\n\nService was nice and attentive, they change your plates in between apps and mains and water glasses are never empty.  At the end of the meal, I had expected the bill to be around $60, but it was only $45.  A steal considering SF prices!\n\nTips and Tricks\n-They serve papadums as a free appetizer, so yummy!\n-One app, a curry, a veggie dish, naan, and a side of rice was just the right amount of food for 2 hungry girls", "rating": 5, "date": "2018-03-12"}, {"excerpts": ["I ordered the tandoori chicken after seeing it previously suggested and it was absolutely delicious -perfectly spiced and crunchy, and provided with me enough leftovers to bring to work the next day. ", "My boyfriend also got the coconut curry, which was delicious as well. ", "Add in a side of rice, and our total was just under thirty bucks. ", "Peeerrrffectttt on a cloudy SF day."], "author": "Maria M.", "review": "If you live in the area, this should for sure be your staple hole in the wall Indian spot. They give you some crispy breads with a variety of sauces complimentary (Indian cuisine snobs pardon my lack of proper terminology.) I ordered the tandoori chicken after seeing it previously suggested and it was absolutely delicious -perfectly spiced and crunchy, and provided with me enough leftovers to bring to work the next day. My boyfriend also got the coconut curry, which was delicious as well. Add in a side of rice, and our total was just under thirty bucks. Peeerrrffectttt on a cloudy SF day.", "rating": 4, "date": "2018-07-16"}, {"excerpts": ["I ordered two sides of basmati rice because I never have enough when I order one entree, but today I received about 4 times the amount of rice and my chicken tikka masala was all sauce and barely any chicken.  \n\n"], "author": "Jessica F.", "review": "Great food, but I wish there was some sort of consistency with their serving sizes for delivery.  I ordered two sides of basmati rice because I never have enough when I order one entree, but today I received about 4 times the amount of rice and my chicken tikka masala was all sauce and barely any chicken.  \n\nThe dine-in experience is alright.  The servers are attentive but not very friendly.  There always seems to be friends of the owners.. or maybe it is the owners... that just hang out at the counter near the entrance.  But they always seat me in the hallway-like area that leads into the larger dining room.  So I feel like I'm always being watched by the people at the front counter.  Not once have I ever been seated in the large dining area.", "rating": 4, "date": "2018-03-11"}, {"excerpts": ["I always order butter chicken masala , tandoori chiken wings as appetizer ", "nd ", "garlic nan ", "its always comes as same taste nd sam spicy level ", "..i love it.."], "author": "Dpes R.", "review": "This restuarant is one of my favorite indian resturant  in san Francisco California.  I always order butter chicken masala , tandoori chiken wings as appetizer nd garlic nan its always comes as same taste nd sam spicy level ..i love it..", "rating": 5, "date": "2018-10-05"}, {"excerpts": ["I ordered the Chicken Tikka Masala and Lamb Saag. ", "Both were very good with lots of chicken and lamb. "], "author": "Wesley S.", "review": "Ordered delivery for a few items, and they arrived pretty quickly. I ordered the Chicken Tikka Masala and Lamb Saag. Both were very good with lots of chicken and lamb. The butter naan was big and long! I thought naans were usually a round circle, but this was like a very long ellipse. Nevertheless, it was soft and good bread. The food portion was pretty big. My girlfriend and I were not able to finish the 2 orders with 2 naans. I would order from this restaurant again!", "rating": 5, "date": "2018-02-07"}, {"excerpts": ["Chicken tandoori: ", "the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. ", "You simply have to try.\n", "2. ", "Chicken tikka masala: average", ", I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. ", "Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. "], "author": "Tata X.", "review": "My go to spot for Indian take out. They pay attention to details and are very heavy handed on spices, which if you are going for Indian food, that's what you should expect.\n\nWe love \n1. Chicken tandoori: the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. You simply have to try.\n2. Lamb shank: meat is falling off the bones\n3. Chicken tikka masala: average, I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. Aloo gobi and baigan bharta: great vegetarian dishes.\n6. Garlic naan: fluffy, chewy, and moist. Right on guys.\nWe do not like the pudina paratha, which is a wheat bread. It is hard and taste like cardboard\n\nTip:\nTheir spice level is not consistent. When in doubt, round down. I order their spiciest level a couple times. Once, it was so spicy that even after adding 200% more bland vegetable and rice in it, it was still too spicy, and I usually eat at the spiciest level at asian cuisines.", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["Chicken momo, Garlic Naan, Tikka masala are blowing. ", "I will visit this place again v.soon....."], "author": "Maniteja C.", "review": "I have been to these place multiple times every visit I enjoy the ambience and comes out very satisfied. Chicken momo, Garlic Naan, Tikka masala are blowing. I will visit this place again v.soon.....", "rating": 5, "date": "2018-09-15"}, {"excerpts": ["I had to head to a grocery store to get an apple after my dinner  because I needed the goopy chicken tikka masala taste out of my mouth. ", "Just don't go. ", "There are much better places to go to in the Haight and in San Francisco."], "author": "Naomi F.", "review": "I do not understand how this place has received such a high rating. I witnessed many people come into the place with a look of disgust as they sat down and then after a minute heading out. The place smells like pee and gross man soap. Not to mention the place is outdated and creeeepppy. The curry looked like vomit, the samosas were clearly frozen, and I felt so gross after eating there. I had to head to a grocery store to get an apple after my dinner  because I needed the goopy chicken tikka masala taste out of my mouth. Just don't go. There are much better places to go to in the Haight and in San Francisco.", "rating": 1, "date": "2018-10-20"}, {"excerpts": ["Chicken Tikka masala is flavorful and garlic naan is long and big. ", "I had assumed garlic naan supposed to be round. ", "They few choices on 3 dollars draft beer. ", "Overall we had great experience in om and we will come back whenever we are in neighborhood."], "author": "Surya B.", "review": "First time writing review on yelp. I  m not a yelper but this restaurant compelled to write some about its best dishes i haver had and customer service. We are just the party of 3. As soon as we entered we were greeted promptly and seated. Welcomes with their complementary papadum with green , hot and tamarind. Tried their momos which was juicy and flavorful. Chicken Tikka masala is flavorful and garlic naan is long and big. I had assumed garlic naan supposed to be round. They few choices on 3 dollars draft beer. Overall we had great experience in om and we will come back whenever we are in neighborhood.", "rating": 5, "date": "2018-05-15"}, {"excerpts": ["The butter chicken is good. ", "The pakora is great when you reheat it in your toaster oven because it comes to your door very soggy. ", "The korma was okay. ", "Rice is average. ", "One day I ordered it and there was a huge box of it. ", "Another day it was tiny. ", "but it's sad because I did like their spicy sauce for the butter chicken. "], "author": "Bella B.", "review": "The butter chicken is good. The pakora is great when you reheat it in your toaster oven because it comes to your door very soggy. The korma was okay. Rice is average. One day I ordered it and there was a huge box of it. Another day it was tiny. Very inconsistent. \n\nService is below average in my opinion and for $45 for a 2 person delivery order you would assume you'd have more to enjoy overall. I couldn't even get a container of extra sauce for my pakora lol. \n\nI won't be ordering from them again but it's sad because I did like their spicy sauce for the butter chicken. I just didn't like the price tag of the full order and their service/delivery drivers attitude. \n\nSometimes service can really be everything. In this case it wasn't but it didn't add to my positive marks on the place.", "rating": 2, "date": "2017-12-16"}, {"excerpts": ["If you like spicy food, I highly recommend the Chili Chicken. ", "It's Indo-Chinese food from the Himalayan region and this place does it better than any other place in the Bay Area."], "author": "Mike M.", "review": "I've had the pleasure of eating here many times, both delivery and sit-down. And I can say without a doubt that this is one of San Francisco's best Indian restaurants.\nYou're getting top-dollar food for a very reasonable price.\n\nIf you like spicy food, I highly recommend the Chili Chicken. It's Indo-Chinese food from the Himalayan region and this place does it better than any other place in the Bay Area.", "rating": 5, "date": "2018-08-09"}, {"excerpts": ["The chicken korma was tasty and nutty, but I wouldn't order it again. ", "The chicken tikka masala is a-ok, but I wouldn't order again--not very flavorful.\n\n"], "author": "Aristocles P.", "review": "We ordered delivery and were disappointed.\n\nThe naan, though very large and impressive to look at, was still pretty raw in the thick parts.\n\nThe chicken korma was tasty and nutty, but I wouldn't order it again. It wasn't bad, but not that flavorful or memorable.\n\nThe baigan bhartha was sweet and this was the nail in the coffin for me. I requested spicy and they got that right--it was quite spicy but still enjoyable (if you like heat, not very bearable for the faint of heart). But the sweetness: whyyy? I usually love this dish, but was not very happy with their version.\n\nThe chicken tikka masala is a-ok, but I wouldn't order again--not very flavorful.\n\nThis place has such good reviews, I had high hopes, but it just shows you that it's a matter of taste, and this place is just not for me.", "rating": 2, "date": "2018-03-27"}, {"excerpts": ["*Chicken Momo: ", "Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n", "*", "Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n", "*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n"], "author": "Elena N.", "review": "I was craving Indian food, but the roommate wanted something else. We decided to order delivery from two different places for lunch. (Yes, we are fat a$$es!) I placed an order through UberEATS on Monday, January 16th at 1:01pm. It arrived at 1:53pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour, and tamarind chutney ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\nI love my Indian food spicy, so I was happy they served serrano naan. It added a great kick to the curries. I adore thick curries, but the tikka masala was actually a little too thick for me. I did love the spice level and flavors though. We ended up adding the vindaloo sauce to the tikka masala to thin it out a bit. The samosas were great! Soft on the inside and crispy on the outside. I didn't really like the mint chutney though. It wasn't creamy and minty enough. I love dumplings so I decided to get the momos. I think they come with a dipping sauce as I got something I thought was the hot and sour sauce for the samosas. It tasted more like a chutney I've had in the past with momos. The roommate enjoyed the dishes he ordered, the vindaloo and the assorted naans.\n\nIndian is one of my comfort foods, so I'm glad I discovered another great option for delivery.", "rating": 4, "date": "2017-01-29"}, {"excerpts": ["I highly recommend the Tandoori Chicken and the Coconut Vegetables Curry!"], "author": "Alisa A.", "review": "Om is my go-to when I'm craving a flavorful meal! It is great that they have open for home delivery as well. \n\nI highly recommend the Tandoori Chicken and the Coconut Vegetables Curry!", "rating": 4, "date": "2018-07-24"}, {"excerpts": ["Delicious butter chicken and tikka masala and very friendly staff. ", "Prices are also good for San Francisco. ", "We always have a great time when we come here."], "author": "Lea S.", "review": "This is our go-to date night spot in SF. Delicious butter chicken and tikka masala and very friendly staff. Prices are also good for San Francisco. We always have a great time when we come here.", "rating": 5, "date": "2018-09-12"}, {"excerpts": ["Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\n", "The chicken naan was quite moist. ", "It had been wrapped in foil, to keep it warm ", "I'm sure, but what ended up happening was it was just soggy by the time it arrived. ", "The chicken naan was quite moist. ", "It had been wrapped in foil, to keep it warm ", "I'm sure, but what ended up happening was it was just soggy by the time it arrived. ", "Also could not pick up any trace of chicken in there. ", "The one redeeming dish was the chicken saag. ", "It was fantastic. ", "Good enough to turn a 1 star review into a 3 star. ", "The one redeeming dish was the chicken saag. ", "It was fantastic. ", "Good enough to turn a 1 star review into a 3 star. ", "The chicken was tender and juicy and the saag was perfectly flavored. ", "Just the right amount of spice. "], "author": "Nick D.", "review": "I ordered takeout on Eat 24 from this restaurant last week. Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\nThe chicken naan was quite moist. It had been wrapped in foil, to keep it warm I'm sure, but what ended up happening was it was just soggy by the time it arrived. Also could not pick up any trace of chicken in there. It was rather bland naan, which says a lot considering naan is bland to begin with. \n\nThe vegetable pakora was also disappointing. There was absolutely no crunch to it. The flavor was also bland on these. There were 2 dipping sauces, neither of which did the trick as far as adding good flavor goes. \n\nThe one redeeming dish was the chicken saag. It was fantastic. Good enough to turn a 1 star review into a 3 star. The chicken was tender and juicy and the saag was perfectly flavored. Just the right amount of spice. While not the most visually appealing dish, I would certainly order this again. \n\nThe delivery itself showed up about 35 minutes late. Luckily I wasn't too hungry when I ordered but it was very disappointing that it took so long.", "rating": 3, "date": "2017-04-04"}, {"excerpts": ["chicken Tikka masala ", "nd ", "Serrano chilii naan it assum ", "nd fresh. ", "Mo:mo r great grt service ..."], "author": "Dolly P.", "review": "One of the best indian resturant in sf..I order chicken Tikka masala nd Serrano chilii naan it assum nd fresh. Mo:mo r great grt service ...", "rating": 5, "date": "2018-07-06"}, {"excerpts": ["The chicken tikka masala was spectacular.  ", "I loved the feel of the restaurant and the service was exceptional.  ", "You have to go out of your way to find this gem amongst the \"stoner\" stores on Haight ", "but it's totally worth your time to do so.  ", "A hidden gem.  ", "Oh and don't forget to try the sweet naan."], "author": "Debbie W.", "review": "Excellent.  The chicken tikka masala was spectacular.  I loved the feel of the restaurant and the service was exceptional.  You have to go out of your way to find this gem amongst the \"stoner\" stores on Haight but it's totally worth your time to do so.  A hidden gem.  Oh and don't forget to try the sweet naan.", "rating": 5, "date": "2018-07-05"}, {"excerpts": ["I ordered chicken tikka masala to go, and it had 0 chicken, they replaced it with Tofu. ", "My husband had the lamb tikka masala and he said it tasted like lightly spiced boiled water. ", "Their nan was so stiff. ", "Everything about our order was an absolute disaster and isn't worth a penny of your money. ", "Save your bucks and go to another Indian restaurant, this isn't authentic indian food."], "author": "Sarah A.", "review": "I ordered chicken tikka masala to go, and it had 0 chicken, they replaced it with Tofu. My husband had the lamb tikka masala and he said it tasted like lightly spiced boiled water. Their nan was so stiff. Everything about our order was an absolute disaster and isn't worth a penny of your money. Save your bucks and go to another Indian restaurant, this isn't authentic indian food.", "rating": 1, "date": "2018-07-01"}, {"excerpts": ["Keema Naan - 4/5\nChicken Chilly - 4.5/5\n", "Chicken Tikka - 5/5 (I love it)"], "author": "Manjari R.", "review": "Best Indian restaurant in San Francisco.\nIf you are looking for the Indian spicy level - make sure you mention 'SPICY' when placing the order.\nMango Lassi - 5/5\nSerrano Chilli Naan - 5/5\nKeema Naan - 4/5\nChicken Chilly - 4.5/5\nChicken Tikka - 5/5 (I love it)", "rating": 5, "date": "2017-12-07"}, {"excerpts": ["It was a to go order that was very pricy, $13 for a small portion of chicken tikka masala with no rice? ", "Really?!  ", "Lots of room for a few more pieces of chicken and sauce. \n\n"], "author": "B K.", "review": "OK, I gave this place another shot because it's got a great Health Score rating of 96, and has new owners again. \n\nIt was a to go order that was very pricy, $13 for a small portion of chicken tikka masala with no rice? Really?!  Not all of us are RICH in the neighborhood. \n\nIt was yummy but not even a close to filling up the \"to go\" container. Lots of room for a few more pieces of chicken and sauce. \n\nHence the loss of one star. Way too pricy for small portion and no rice. But sooooo tasty. \n\nWhen I got home and unwrapped everything one of the appetizers was wrong. I called, explained, and asked kindly if they would send a guy out since I'm so close by. Plus, I waited a solid 10 minutes for the order that they got wrong. \n\nThey sent over the correct appetizer and a free kheer dessert. Now that's customer service! \n\nEverything was very good, but tamarind sauce is way watered down. \n\nKeep up the great health score and please consider serving rice for those prices. Plus, the carpet in the front smells like urine, pee. Gross, steam clean and bleach that To Go area, please.", "rating": 4, "date": "2017-04-15"}, {"excerpts": ["Just ordered chicken tikka masala, garlic naan and the samosas. ", "Not only was the flavor on point but the service was great. ", "So happy I found a new Indian place!"], "author": "Hailee K.", "review": "Just ordered chicken tikka masala, garlic naan and the samosas. Not only was the flavor on point but the service was great. So happy I found a new Indian place!", "rating": 5, "date": "2018-04-28"}, {"excerpts": ["Ordered a Butter Chicken and Tikka Masala for delivery. ", "Both curries were watered down and had no kick to them at all. ", "There are ", "much better Indian restaurants in SF, perhaps dining in would've been better but delivery was a let down."], "author": "Charles W.", "review": "Very disappointed. We expected more from a 4.5 star. Ordered a Butter Chicken and Tikka Masala for delivery. Both curries were watered down and had no kick to them at all. There are much better Indian restaurants in SF, perhaps dining in would've been better but delivery was a let down.", "rating": 2, "date": "2018-05-21"}, {"excerpts": ["I had chicken momo and tandori with garlic naan. \n"], "author": "Akash S.", "review": "One of My favourite Indian restaunt in this San Francisco. \nI had chicken momo and tandori with garlic naan. \nAwesome !!\n\nWait staff were really friendly and prmpt. \n\nI was impressed with the quality of food and service .", "rating": 5, "date": "2017-09-10"}, {"excerpts": ["Love the butter chicken and saag paneer. ", "Great for dine-in or delivery."], "author": "Dwayne J.", "review": "Delicious. Love the butter chicken and saag paneer. Great for dine-in or delivery.", "rating": 5, "date": "2018-08-17"}, {"excerpts": ["Their chicken tikka masala is now my favorite in the city - it's one of the few that is sweet and spicy without tasting smoky at all."], "author": "Melissa H.", "review": "Fast delivery, food is consistently good and super fresh. Their chicken tikka masala is now my favorite in the city - it's one of the few that is sweet and spicy without tasting smoky at all.", "rating": 5, "date": "2018-04-20"}, {"excerpts": ["I'm a big fan of the chicken tikka masala, raita, and kheer."], "author": "Jackie O.", "review": "Delicious, affordable Indian delivery. I'm a big fan of the chicken tikka masala, raita, and kheer.", "rating": 4, "date": "2018-04-01"}, {"excerpts": ["Chicken korma is their best dish (even if you're an avid CTM eater). ", "The staff is friendly and tries really hard to make their customers happy ", "but they almost always mess up to-go orders. ", "Their food is so good- ", "it doesn't even matter if it take 1 hour sometimes for delivery. ", "My only recommendation is for them to create consistency with their food as sometimes it can be watery. ", "Otherwise, they need to make a cookbook!"], "author": "NewtoIthaca N.", "review": "Chicken korma is their best dish (even if you're an avid CTM eater). The staff is friendly and tries really hard to make their customers happy but they almost always mess up to-go orders. Their food is so good- it doesn't even matter if it take 1 hour sometimes for delivery. My only recommendation is for them to create consistency with their food as sometimes it can be watery. Otherwise, they need to make a cookbook!", "rating": 5, "date": "2018-03-14"}, {"excerpts": ["I highly recommend the tandoori chicken, as well as the garlic naan. ", "I love the vegan eggplant dish too. ", "Actually I love this food so much that I always get the same thing. ", "Hoping to branch out soon. ", "Love Om!"], "author": "Lolly B.", "review": "I have ordered from here many times. It's always delicious! I highly recommend the tandoori chicken, as well as the garlic naan. I love the vegan eggplant dish too. Actually I love this food so much that I always get the same thing. Hoping to branch out soon. Love Om!", "rating": 5, "date": "2018-01-14"}, {"excerpts": ["Chicken tikka masala was too good. ", "No complaints about biryani, chicken biryani is simply superb."], "author": "Nikhil V.", "review": "Awsome food, very taste. Chicken tikka masala was too good. No complaints about biryani, chicken biryani is simply superb.", "rating": 5, "date": "2017-12-13"}, {"excerpts": ["$4.95 \n\nTandoori Chicken Wings = awesome. ", "Moist and flavorful chicken wings. ", "And I loved the onions and peppers that come with them! ", "$10.95\n\nChicken Tikka Masala = excellent. "], "author": "Fannie S.", "review": "We tried delivery from this place recently.  \n\nVegetable Pakora = full of flavor and crisp. Even for delivery. $4.95 \n\nTandoori Chicken Wings = awesome. Moist and flavorful chicken wings. And I loved the onions and peppers that come with them! $9.95 \n\nBaigan Bharta = smoky eggplant. Delicious. $10.95 \n\nSaag Paneer  = good. On the mild side. $10.95\n\nChicken Tikka Masala = excellent. Slightly sweet, smoky and hit the spot. He loved it. $12.95 \n\nRaita  = typical. $2.95 \n\nMixed Pickle  = Tart and spicy. Exactly what he wanted. $1.95 \n\nBasmati Rice = good. $2.95 \n\nGarlic Naan = good. (Better after sticking it in the oven though.) $2.95 \n\nKheer  = a most peculiar version. It was tart/sour. I ended up composting because I couldn't eat more than 3 spoonfuls. $3.95 \n\nPrices = moderate. $64.50 before taxes and discount code. We had leftovers for two more meals.", "rating": 4, "date": "2016-11-16"}, {"excerpts": ["Recommend the coconut chicken and lamb curries. ", "Lots of flavor, not too spicy."], "author": "Krista J.", "review": "Had a great dinner from Om and good service. We waited for our takeout and while it seemed dead in the restaurant at 6:30 on a Thursday, takeout seems to be hot there! Lots of pickups and deliveries were in front of us. Had some really good garlic naan while we waited. Recommend the coconut chicken and lamb curries. Lots of flavor, not too spicy.", "rating": 4, "date": "2018-07-06"}, {"excerpts": ["Butter chicken masala and aloo golbi are my always to go. ", "Wherever I go that has Indian food, these are my must eats. "], "author": "Julie B C.", "review": "Came here once a week for the past two weeks.\n\nPrior to finding this place, I was a huge fan of another location on Irving. I don't want to put them down as I have gone there for the past 3 years. What I'm saying is I would be there once a week every week. Yes! I am obsess over Indian food. I can never have enough. I even tried cooking it myself but it never comes out the same and plus, it makes my house smell for days =(\n\nAnyways, I came here with a few of my friends and I was amaze. I fell in love instantly. Their sauce to their food is on point. \n\nButter chicken masala and aloo golbi are my always to go. Wherever I go that has Indian food, these are my must eats. Don't forget Garlic naan! \n\nOverall, I would highly recommend this place. Parking isn't too bad. Just keep your eyes on the road and even on the side. There will be some folks that love to spring themselves out onto the road when it is not a crosswalk. You'll see what I mean when you go. \n\nWill be back again since I can never have enough. \n\n*Warning - it gets pretty chilly in this restaurant so be prepared. Nice thing is they do have personal heaters so feel free to ask and they will turn it on for you =)", "rating": 5, "date": "2016-12-07"}, {"excerpts": ["Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. ", "INCREDIBLE. ", "Best Indian we have ever had."], "author": "Chelsey T.", "review": "Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. INCREDIBLE. Best Indian we have ever had.", "rating": 5, "date": "2017-07-30"}, {"excerpts": ["Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. ", "Spend some time.\n", "Helpful and friendly service, average pricing, worth it.\n      ", "Overall I recommend this place for new eaters to give a try. ", "Thanks Om."], "author": "Feroz C.", "review": "Walked here with friend for dinner on weekend. Interior decoration of dining hall was so attractive and cozy. Beer and wine bar next to entrance. Welcoming staffs. Felt good. We had:-\n       Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. Spend some time.\nHelpful and friendly service, average pricing, worth it.\n      Overall I recommend this place for new eaters to give a try. Thanks Om.", "rating": 5, "date": "2017-05-22"}, {"excerpts": ["The chicken tikka masala is creamy and flavorful, as is the chicken coconut curry. ", "My favorite was the chicken momo, which we got as an appetizer. "], "author": "Kelly G.", "review": "I rarely give 5 stars, but all things considered, I had a very good experience at Om. The food was delicious, the service was kind and prompt, and better than anything, there is plenty of seating, quiet atmosphere, and not overly priced (based on SF standards)\n\nThe chicken tikka masala is creamy and flavorful, as is the chicken coconut curry. The garlic naan is delicious and warm and comes in a basket draping over the sides. \n\nMy favorite was the chicken momo, which we got as an appetizer. I've never had dumplings/pot stickers with these kind of flavors and they were SO good. \n\nThere was one miscommunication, which was that we requested a bottle of wine and they brought 2 glasses of wine instead. But, in all fairness, we probably didn't need a bottle of wine for two people. I mean, we would've finished it, but whether we needed that much wine is debatable :P", "rating": 5, "date": "2016-10-24"}, {"excerpts": ["I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. ", "Beware asking for the dishes spicy, it'll test your tolerance (in a good way). ", "The naan was also excellent... "], "author": "Cynthia S.", "review": "Best Indian food I've had in San Francisco! It was so flavorful and tasted high quality. I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. Beware asking for the dishes spicy, it'll test your tolerance (in a good way). The naan was also excellent... I love me some naan. \n\nThe only thing that I believe has room for improvement is the restaurant decor and ambiance. It is a little dim and lacks personality/charm. That being said, the food is way important and I'll be back many times.", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["Chicken tikka masala - ", "Too creamy and a bit sweet. ", "Hardly had any flavor. ", "I have had the mild version at chaat cafe in Fremont, with hardly any cream. ", "Chicken curry (home style?) ", "- This was perfect. ", "Had a nice flavor, but not spicy. "], "author": "Raghu B.", "review": "Two and a half stars. Ordered all dishes mild, not bland. Some lacked flavor and enough salt.\n\nOkra - Had some impossible to chew pieces and a few stems. Too oily. Less salt.\n\nChicken tikka masala - Too creamy and a bit sweet. Hardly had any flavor. I have had the mild version at chaat cafe in Fremont, with hardly any cream. Ok salt.\n\nSaag paneer - Was not very green and had some white creamy stuff. Had a LOT of SAND at the bottom. Looks like they did not wash the veggies properly. Less salt.\n\nDaal Makahni - This was nice. Had almost no salt though which is easy to fix.\n\nChicken curry (home style?) - This was perfect. Had a nice flavor, but not spicy. Had a little extra oil, but not too much.\n\nRoti - Soft and nice.\n\nThe quantity is good for the price and home delivery is quick after lunch time on a weekday.", "rating": 2, "date": "2017-07-31"}, {"excerpts": ["Recently I had the chicken tikka masala, behgan bharta, and saag paneer.  ", "The first of these was creamy, with a delicate flavor.  ", "The behgan bharta had a smoky flavor, with onions delicately cooked, and was actually somewhat spicy.  ", "(I prefer my food quite spicy, but didn't make any special requests this time.) "], "author": "Kai M.", "review": "Om Restaurant is where the trajectory of my favorite Indian chef has landed.  Arun Kumar Dangi was at Clay Oven when my wife and I first met him.  He is an amazing, energetic, and very positive human being, which you see reflected in the esprit de corps of the restaurants he has run.  More recently he was at Tara Indian on Market Street, and vastly improved that location.\n\nSo now I go to see him at Om.  To me it's a combination of really friendly people, super delicious Nepali-influenced Indian cuisine, and a comfortable, charming eating environment.\n\nI have probably tried most of the items on the menu, but I'll just comment on a few.  Recently I had the chicken tikka masala, behgan bharta, and saag paneer.  The first of these was creamy, with a delicate flavor.  The behgan bharta had a smoky flavor, with onions delicately cooked, and was actually somewhat spicy.  (I prefer my food quite spicy, but didn't make any special requests this time.) The saag paneer was lemony, and I really liked the chunks of cheese.\n\nEven more recently, I went with my family; Arun made a special soup for my mother-in-law who likes mild food, and one of the standout dishes was the tandoori salmon.\n\nAnd I have to comment on the pakoras.  I don't think I've had them as good at any Indian restaurant I've ever been too.  Some kind of combination of spices that I can't possibly guess at.\n\nThe place is cute and rustic inside, with a beautiful hand-embroidered piece in the back room showing deities of the Bhagavad Gita.  \n\nI really like Om.  It's a place with a lot of heart and great food, I highly recommend it.", "rating": 5, "date": "2016-09-22"}, {"excerpts": ["Chicken Tikka Masala: ", "sauce is super flavorful; it's on the lighter side of flavor and color.  ", "Chicken was super tough and dry. ", "That was a bummer because the flavor is good.  ", "Maybe it was a fluke and this batch just had chicken that was overcooked, I hope.\n\n"], "author": "Traci H.", "review": "I ordered Delivery from here in the middle of the day.  The delivery beat the estimated time by about 20 minutes and the food was still incredibly temperature hot when it arrived.\n\nAloo Saag: Creamy spinach but not too fake tasting. Great flavored potatoes.  Overall nice dish.\n\nChicken Tikka Masala: sauce is super flavorful; it's on the lighter side of flavor and color.  Chicken was super tough and dry. That was a bummer because the flavor is good.  Maybe it was a fluke and this batch just had chicken that was overcooked, I hope.\n\nOkra: It's pretty mainstream.  Good but nothing out of this world. I could have done without it.  It wasn't bad, but it just wasn't special.  Lots of onions and tomatoes go along with the okra.\n\nDal Makhani: This was my favorite dish.  Creamy but yet still tasted like lentils. Super flavorful.  Who knew this veggie dish could be so amazing.  I would order this again in a heartbeat.\n\nVeggie Biryani: Interesting.  Didn't taste like the normal aromatic biryanis I've had before and it was even a little bit like sticky rice instead of the drier long grain rice dish.  It was more like fried rice I think.  Not bad but nothing special.\n\nRice: the rice servings are a little small so I ran out of rice so maybe order a little extra rice or naan if you need it to soak up the curries!\n\nThey threw in some raita and the brown and green sauce too!\n\nOverall great flavors and it survived delivery so well! \n\nSuper friendly and fast delivery.  I'm looking forward to trying out the restaurant sometime soon!", "rating": 4, "date": "2016-09-29"}, {"excerpts": ["I ordered chicken tikka masala today via Postmates ", "and I have to say that it's probably the worst deal I've had in regards to Indian food...like ever. ", "I paid over $15 (not counting delivery charges) for a single order of chicken tikka masala--which came spilled and in one of the smallest food containers. ", "Mind you, there were no napkins or utensils--or even rice to come with my order! ", "Perhaps they expected me to drink the liquid? ", "Well perhaps that would actually be apt because it was the most watered-down version of chicken tikka masala I've ever had; in the whole order, there was maybe 4 chicken pieces total. ", "All in all, save your money--go for Trader Joe's chicken tikka masala if you must...much better deal and time saved."], "author": "Nancy W.", "review": "I ordered chicken tikka masala today via Postmates and I have to say that it's probably the worst deal I've had in regards to Indian food...like ever. I paid over $15 (not counting delivery charges) for a single order of chicken tikka masala--which came spilled and in one of the smallest food containers. Mind you, there were no napkins or utensils--or even rice to come with my order! Perhaps they expected me to drink the liquid? Well perhaps that would actually be apt because it was the most watered-down version of chicken tikka masala I've ever had; in the whole order, there was maybe 4 chicken pieces total. All in all, save your money--go for Trader Joe's chicken tikka masala if you must...much better deal and time saved.", "rating": 1, "date": "2017-06-29"}, {"excerpts": ["Chicken biryani was awful. ", "Naans were doughy and undercooked."], "author": "John B.", "review": "Vastly overrated, for delivery at least.\n\nChicken biryani was awful. Naans were doughy and undercooked.", "rating": 2, "date": "2017-06-19"}, {"excerpts": ["Really here the food is delicious and coming to the delivery on time they do and i like here naan chicken curry ", "what not every i tasted all ", "are good thanks for your unbelievable on time delivery when i am starving  ", "i really prefer if you want indian food"], "author": "Charan Y.", "review": "Really here the food is delicious and coming to the delivery on time they do and i like here naan chicken curry what not every i tasted all are good thanks for your unbelievable on time delivery when i am starving  i really prefer if you want indian food", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["I had the tandoori chicken and vege biryani and both were good. \n", "I just wished if there was a window in the dining. ", "Decor is good but less cluster would make it better.."], "author": "joe w.", "review": "Wow. This was a jem to find in the haight area.. very impressed by the food which was suprisingly tasty and filling considering the area. I had the tandoori chicken and vege biryani and both were good. \nI just wished if there was a window in the dining. Decor is good but less cluster would make it better..", "rating": 5, "date": "2017-11-02"}, {"excerpts": ["We got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. ", "The chicken korma and the lamb rogan josh were also really tasty. ", "The chicken korma and the lamb rogan josh were also really tasty. ", "Rice was good, the only thing that wasn't great was the butter naan. ", "About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. "], "author": "Ely L.", "review": "Ordered delivery from here via the Yelp Eat24 app on a Tuesday night. Super fast delivery, arrived early and piping hot.\n\nWe got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. More than enough food for two people.\n\nSamosas were delicious. The chicken korma and the lamb rogan josh were also really tasty. Rice was good, the only thing that wasn't great was the butter naan. About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. Next time maybe I'll try the paratha or roti or a different naan.\n\nOverall a delicious, fast, and convenient delivery diner!", "rating": 4, "date": "2017-02-28"}, {"excerpts": ["Food is very good and flavorful..service is awesome..highly recommend this place chicken momo ", "so yummy best ", "I've had in years.............................................."], "author": "RaZan L.", "review": "Food is very good and flavorful..service is awesome..highly recommend this place chicken momo so yummy best I've had in years..............................................", "rating": 5, "date": "2017-11-02"}, {"excerpts": ["I ordered Chilli Chicken, it was basically chicken drenched in cornflour and put it into a tomato purée instead of legit curry.\n\n"], "author": "Aditi G.", "review": "Maybe my review is biased because I'm Indian. The level of spice is good and true to selection.\n\nI ordered Chilli Chicken, it was basically chicken drenched in cornflour and put it into a tomato purée instead of legit curry.\n\nService was fast and the Navratna Korma was pretty good.", "rating": 3, "date": "2017-05-06"}, {"excerpts": ["I loved the lamb saag and chicken tandoori. ", "The naan was so-so ", "but maybe cuz I had it delivered...", "I'll have to dine in and give it another try."], "author": "Christine H.", "review": "As a Fremont native I know a thing or two about good Indian food. Om might be my new go-to Indian food in SF. First off their \"hot\" is actually spicy. The food was really flavorful and not overly greasy and there was a lot of meat in eat portion. I loved the lamb saag and chicken tandoori. The naan was so-so but maybe cuz I had it delivered...I'll have to dine in and give it another try.", "rating": 4, "date": "2017-11-06"}, {"excerpts": ["The chicken wings had good flavor, but were slimy, greasy and needed microwave. ", "After significant nuking, they were good. ", "Definitely want to check it out in person."], "author": "Andrew K.", "review": "Ordered through Uber eats. The saag daal was perfection. I love al dente yellow lentils. Seriously good. The chicken wings had good flavor, but were slimy, greasy and needed microwave. After significant nuking, they were good. Definitely want to check it out in person.", "rating": 4, "date": "2017-01-15"}, {"excerpts": ["Already ate the frozen chicken nuggets and burritos I had in the very back of the freezer which will probably give me food poisoning. ", "I will never order or eat from here ever again!!!"], "author": "Jimmy C.", "review": "Don't order pickup from this place. From the time I placed a phone order to when the food was ready was probably 2 hours. Already ate the frozen chicken nuggets and burritos I had in the very back of the freezer which will probably give me food poisoning. I will never order or eat from here ever again!!!", "rating": 1, "date": "2018-01-15"}, {"excerpts": ["I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. ", "One of the few places I know that does Malai Kofta so deliciously.  ", "They filled up every container. ", "Really enjoyed the meal. ", "Will definitely order again."], "author": "minnie l.", "review": "Flavorful and they mean it when they say Spicy!  I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. One of the few places I know that does Malai Kofta so deliciously.  They filled up every container. Really enjoyed the meal. Will definitely order again.", "rating": 5, "date": "2017-09-26"}, {"excerpts": ["the curry was good (how can you get chicken tikka masala wrong?) ", "the rice was good ", "but i've had better. ", "i might have given this place 4 stars if the price wasn't ridiculous i don't think that paying $18 for rice and curry is worth it especially when the place is cold as hell on a cold as day and the incense was a little much. ", "don't eat here ", "just get it to go !! ", "if you're looking for attentive service this doesn't seem like the place to find that."], "author": "Reese A.", "review": "ok so i've been to so many indian restaurants and tried so many curries and this one doesn't stand out to me. the curry was good (how can you get chicken tikka masala wrong?) the rice was good but i've had better. i might have given this place 4 stars if the price wasn't ridiculous i don't think that paying $18 for rice and curry is worth it especially when the place is cold as hell on a cold as day and the incense was a little much. don't eat here just get it to go !! if you're looking for attentive service this doesn't seem like the place to find that.", "rating": 3, "date": "2018-03-10"}, {"excerpts": ["My first delivery-- sag paneer, chicken korma, lamb vindaloo-- was exceptional. ", "I ordered each dish with varying degrees of spice and they were prepared as requested. ", "I was especially impressed with the quality and flavor of the paneer and the tenderness of the lamb. ", "The korma was rich and flavorful without being greasy. ", "I'm thankful that they have extended hours from 10-10 and deliver! ", "After my first meal, I started thinking about what I would try next."], "author": "Pamela B.", "review": "My new go-to Indian delivery! I'm looking forward to working my way through their menu. It arrived within an hour and the delivery man was very polite. My first delivery-- sag paneer, chicken korma, lamb vindaloo-- was exceptional. I ordered each dish with varying degrees of spice and they were prepared as requested. I was especially impressed with the quality and flavor of the paneer and the tenderness of the lamb. The korma was rich and flavorful without being greasy. I'm thankful that they have extended hours from 10-10 and deliver! After my first meal, I started thinking about what I would try next.", "rating": 5, "date": "2017-08-24"}, {"excerpts": ["Saag aloo, chicken tikka masala, and a couple of different naans.  ", "The staff was attentive, helpful, and the food was ready fast.  ", "Everything was delicious!!  ", "We've added it to our take-out go-to list.  ", "Can't wait to eat there again."], "author": "Jen H.", "review": "We ordered dinner to-go from Om last week.  Saag aloo, chicken tikka masala, and a couple of different naans.  The staff was attentive, helpful, and the food was ready fast.  Everything was delicious!!  We've added it to our take-out go-to list.  Can't wait to eat there again.", "rating": 4, "date": "2017-08-07"}, {"excerpts": ["I had Chicken momo, Samosa, some Indian sweets and lassi, reminded me of home. ", "Now my fav place to order food. ", "Try this place"], "author": "Ramesh A.", "review": "Best food ever. I had Chicken momo, Samosa, some Indian sweets and lassi, reminded me of home. Now my fav place to order food. Try this place", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. ", "We order everything extra spicy, but be warned, they take you very seriously on that. ", "Incredible flavor! \n", "Highly recommend sitting in the back room which has great murals of Indian scenery ", "and there's always both modern and classic Bollywood videos playing. ", "Can't wait for our next night out at Om:-)"], "author": "Mariel H.", "review": "My fiancée and I absolutely love this place! AJ is a great host and makes you feel at home. Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. We order everything extra spicy, but be warned, they take you very seriously on that. Incredible flavor! \nHighly recommend sitting in the back room which has great murals of Indian scenery and there's always both modern and classic Bollywood videos playing. Can't wait for our next night out at Om:-)", "rating": 5, "date": "2017-01-27"}, {"excerpts": ["We tried the chicken tikka masala and the lamb korma for entrees, with rice. "], "author": "Kate T.", "review": "Om Indian Cuisine has excellent food, and great service. Bookmark this place for the next time you're craving Indian food. \n\nLocation/Atmosphere: 3/5. The restaurant certainly isn't upscale, but divey isn't quite right, either. There isn't much ambiance to speak of. I think they may be undergoing some sort of renovation, or redecoration. I have no idea, actually. It was confusing. \n\nService: 5/5. We had great servers here, and our waiter made sure to get our order correct by reading it back to us before putting it in. Food did not come out too slowly or quickly.\n\nFood: 4/5. I hadn't had Indian food in a while, so I was pretty basic and didn't order anything too exciting here. Most everything we ordered was delicious. The samosas were on point--very hot, crispy on the outside, and the filling was delicious. The chutneys that came with were also really good--some of the best chutneys I've had! The naan breads we tried were both delicious. I recommend the garlic naan especially. We tried the chicken tikka masala and the lamb korma for entrees, with rice. The korma was very good, and the tikka masala was just okay. \n\nOverall: I'd definitely come here again!", "rating": 4, "date": "2016-09-12"}, {"excerpts": ["We ordered our meal: Chicken Momo as an appetizer, Salmon with spinach, rice, coconut naan and a single Kingfisher beer. ", "Ten minutes later, the restaurant started to fill up, and we saw the folks at the table next to us get seated. ", "The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. ", "I was confused ", "The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. ", "I was confused ", "so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. ", "45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. ", "so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. ", "45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. ", "Yet still, no Chicken Momo. \n\n", "Yet still, no Chicken Momo. \n\n", "Once again, we said we never received the Chicken Momo appetizer. ", "He assured us that it was coming. ", "Once again, we said we never received the Chicken Momo appetizer. ", "He assured us that it was coming. ", "Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. ", "My spouse noticed the same thing. ", "I told the waiter, who looked astounded when I said it was completely inedible. ", "Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. ", "My spouse noticed the same thing. ", "I told the waiter, who looked astounded when I said it was completely inedible. ", "The waiter finally relented when I asked, \"Who wants to eat raw chicken?"], "author": "Susan L.", "review": "I am so heartbroken to leave a bad review. I really wanted our dinner to be as sumptuous as I'd heard this place was but our meal was really disappointing.\n\nMy spouse and I arrived for dinner on a Wednesday evening at 730,  when there were just a few other folks in the restaurant. We ordered our meal: Chicken Momo as an appetizer, Salmon with spinach, rice, coconut naan and a single Kingfisher beer. Ten minutes later, the restaurant started to fill up, and we saw the folks at the table next to us get seated. The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. I was confused so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. 45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. Yet still, no Chicken Momo. \n\nAs our dinner plates were being cleared, the waiter asked how everything was. Once again, we said we never received the Chicken Momo appetizer. He assured us that it was coming. Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. My spouse noticed the same thing. I told the waiter, who looked astounded when I said it was completely inedible. The waiter finally relented when I asked, \"Who wants to eat raw chicken?\"\n\nNo, the restaurant didn't charge us for inedible food that we couldn't eat. And yes, I appreciate the 10% discount off our bill. But when the waiter said he was bringing us out a comped dessert of rice pudding -- which neither of us can eat because we cannot eat dairy -- we protested and asked him not to do so. Nonetheless, the rice pudding was placed on our table and sat untouched. So that was a terrible waste of food, which really unnerved me. It would have been better customer service to at least comp us our Kingfisher beer, which we did drink.\n\nSo I'm sad to say, no thanks.", "rating": 1, "date": "2016-10-05"}, {"excerpts": ["Highlights are the butter chicken and chili naan. ", "Super fast delivery, too."], "author": "Andrew C.", "review": "Easily the best Indian in the city. Actually spicy as well. Highlights are the butter chicken and chili naan. Super fast delivery, too.", "rating": 5, "date": "2017-05-12"}, {"excerpts": ["The butter chicken masala was terrific. ", "So was the saag paneer. ", "I ordered from Eat24 and the food arrived fresh and with a smile."], "author": "Morris R.", "review": "It is surprisingly hard to find great Indian food. The butter chicken masala was terrific. So was the saag paneer. I ordered from Eat24 and the food arrived fresh and with a smile.", "rating": 5, "date": "2016-10-10"}, {"excerpts": ["I ended up keeping it simple and ordering butter chicken (spicy), samosas, and 2 servings of tandoori roti. \n\n", "The butter chicken was definitely pretty spicy for me. ", "Wish there was a little more chicken in the serving, but perhaps that was because it was delivery? ", "It looked almost as though there were red pepper flakes in it. ", "BUT it lasted me about 3 days! ", "The tandoori roti was 1 roti, but cut into 2 pieces. ", "It had butter on it, and I almost wish it didn't. "], "author": "Meha M.", "review": "I ordered delivery here on a Friday night. The delivery took just as long as was estimated by the app I was using.\n\nI ended up keeping it simple and ordering butter chicken (spicy), samosas, and 2 servings of tandoori roti. \n\nThe butter chicken was definitely pretty spicy for me. Wish there was a little more chicken in the serving, but perhaps that was because it was delivery? It looked almost as though there were red pepper flakes in it. BUT it lasted me about 3 days! So that was great.\n\n1 serving of samosas comes with 2, so luckily I had leftovers and got to warm one up the next day. They were really good, the sauces it came with were also delicious.\n\nThe tandoori roti was 1 roti, but cut into 2 pieces. It had butter on it, and I almost wish it didn't. That's definitely just a personal preference, and it was delicious regardless.\n\nOverall, really really enjoyed the food, especially considering I got it for delivery! Definitely would go back to try other items on the menu.", "rating": 4, "date": "2016-10-15"}, {"excerpts": ["I had chicken tikka masala (medium) and it was delicious and not noticeably spicy. "], "author": "Chris S.", "review": "I went a bit overboard and ordered more than I needed for one via Eat24.  It was ready in only 15 mins and I was soon back at home enjoying all of this delicious Indian food. It was hot and fresh.\n\nThe overall appearance was great and I loved that the meat dishes weren't swimming in oil. I had chicken tikka masala (medium) and it was delicious and not noticeably spicy. The lamb vindaloo (mild, and truly mild) was great and the meat was excellent! I can be squeamish when it comes to subpar meat and nothing about either dish was anything but great. No toughness or pieces you have to chew on for 5 minutes. I've taken back dishes, not ordered again, or not gone back to other Indian places due to their lamb.  Everything else was good as well. (samosas, rice, naan)\n\nIt's not cheap but the food quality doesn't disappoint.\n\nThe only non-positive observation is that when you walk into the restaurant, you immediately notice 2 large \"watch your step\" construction looking signs slapped onto the back of the front 2 bar stools. Maybe they are temporary but I didn't get that impression because the floor there is raised.  I'd suggest putting more discreet yellow caution tape along the ridge of the raised step or perhaps another solution. Otherwise it just looks a bit too tacky.\n\nThanks for opening this in the neighborhood and good luck to you guys!", "rating": 4, "date": "2016-08-20"}, {"excerpts": ["I had the chicken tikka masala (decision prompted from another Yelp review), the dal and some garlic naan. "], "author": "Alison Y.", "review": "The food was really tasty and the portions were pretty large. \n\nI had the chicken tikka masala (decision prompted from another Yelp review), the dal and some garlic naan. The tikka masala could use a little more spice, but I didn't specify that I wanted it spicy so that's on me.\n\nIt's a little pricier than my usual go-to Indian food spot, but not completely unreasonable.", "rating": 4, "date": "2016-07-28"}, {"excerpts": ["Try chicken tikka masala & chicken momo ", "expected one hour but got delivered in twenty minutes . ", "The menu was also very innovative and the prices were also not so high I would recommend this restaurant to any one who is new to the Bay Area or is a tourist."], "author": "Asif R.", "review": "Try chicken tikka masala & chicken momo expected one hour but got delivered in twenty minutes . The menu was also very innovative and the prices were also not so high I would recommend this restaurant to any one who is new to the Bay Area or is a tourist.", "rating": 5, "date": "2017-04-19"}, {"excerpts": ["One of my usuals, chicken tikka masala, was creamy but very bland. ", "You'll have to ask for spicy if you want it."], "author": "Crabcakes C.", "review": "So happy there's finally a good restaurant in this location! Food is quite good. Thali can easily feed 3 people. \n\nOne of my usuals, chicken tikka masala, was creamy but very bland. You'll have to ask for spicy if you want it.", "rating": 4, "date": "2017-05-27"}, {"excerpts": ["We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. ", "Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. ", "I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. ", "Naan was big and very freshly made.\n", "To make our experience even better we were offered complimentary desserts.\n", "I would definitely go there again and this has become my new favorite place to go."], "author": "Sub N.", "review": "This new neighborhood gem is fabulous.\nWe were party of five for dinner and we were greeted as soon as we entered by the owner himself. It has a very impressive ambiance with beautiful hand painting at the dinning hall walls and i must say the whole place is clean.The service was fast and very friendly. \nThe owner answered any question we had about the food. We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. Naan was big and very freshly made.\nTo make our experience even better we were offered complimentary desserts.\nI would definitely go there again and this has become my new favorite place to go.", "rating": 5, "date": "2016-08-22"}, {"excerpts": ["I will say the chicken tikka masala and saag paneer are really good, but not worth the sleepless night spent praying to the porcelain god."], "author": "Veronica F.", "review": "We used to love Om, until our most recent delivery order. It took 2 hours to get our food and both my husband and I got food poisoning. I will say the chicken tikka masala and saag paneer are really good, but not worth the sleepless night spent praying to the porcelain god.", "rating": 1, "date": "2017-10-27"}, {"excerpts": ["The chicken tikka masala is the best I've had in SF. ", "Om is my go to."], "author": "Leah N.", "review": "Amazing place to dine, deliver or take out food. Their food is outstanding and I will definitely come back. The chicken tikka masala is the best I've had in SF. Om is my go to.", "rating": 5, "date": "2017-04-30"}, {"excerpts": ["Standard dishes 1x chicken tikka and 1x butter chicken. ", "Both insanely creamy ended up having almost no flavor at all besides cream and heaviness. ", "The tikka had tough chicken filet/breast pieces. ", "The butter chicken had literally garbage meat in it. ", "Never saw that much cartilage bone and fat in a single dish!!! ", "Won't be ordering again. ", "City has much better to offer for the same money. ", "At least good meat should be a given."], "author": "Ilias S.", "review": "I got food delivered from this place. Standard dishes 1x chicken tikka and 1x butter chicken. Both insanely creamy ended up having almost no flavor at all besides cream and heaviness. The tikka had tough chicken filet/breast pieces. The butter chicken had literally garbage meat in it. Never saw that much cartilage bone and fat in a single dish!!! Won't be ordering again. City has much better to offer for the same money. At least good meat should be a given.", "rating": 2, "date": "2017-04-13"}, {"excerpts": ["This is the best restaurant in the Bay Area and also the momos were perfectly cooked the tandoori chicken also very nice..."], "author": "Kunal G.", "review": "This is the best restaurant in the Bay Area and also the momos were perfectly cooked the tandoori chicken also very nice...", "rating": 5, "date": "2017-04-28"}, {"excerpts": ["Ordered your most basic chicken tikka Masala. ", "It was watery, the chicken was overcooked and no flavor. ", "Any Indian restaurant that can't serve a decent Masala dish doesn't deserve to be open. ", "Awful... Never ordering here again."], "author": "Milind S.", "review": "Just ordered uber eats. Ordered your most basic chicken tikka Masala. It was watery, the chicken was overcooked and no flavor. Any Indian restaurant that can't serve a decent Masala dish doesn't deserve to be open. Awful... Never ordering here again.", "rating": 1, "date": "2017-02-07"}, {"excerpts": ["My top list of the favorites was Kashmiri Chicken and Lamb Shank."], "author": "Prudhvi Chowdary N.", "review": "This is probably the best Indian Cuisine in the San Francisco area. Everything I had in this restaurant was awesome. I couldn't specify the particular item to be the best . Can try anything. My top list of the favorites was Kashmiri Chicken and Lamb Shank.", "rating": 5, "date": "2017-04-01"}, {"excerpts": ["We ordered chicken tikka, spinach paneer, butter naan, rice, and raita. ", "So delish. ", "Our new go to spot for pickup!"], "author": "Jillian P.", "review": "We ordered chicken tikka, spinach paneer, butter naan, rice, and raita. So delish. Our new go to spot for pickup!", "rating": 5, "date": "2017-01-25"}, {"excerpts": ["The Tikka Masala (chicken or paneer), the Alu Vindaloo, the Aloo Matar, and the variety of Naan (especially the garlic basil) are TEXTBOOK classic here!\n\n"], "author": "Ford T.", "review": "Easy 5 stars for my favorite  OM  Indian restaurant in san francisco .  I have driven way out of my way just to dine here and carry-out.  Brought my picky and hard-to-impress a friend  here last night with his wifey, and they loved it.\n\nBig props to the owner & management who run this place like a well-oiled machine with stellar service each time.  Our water cups were never even half empty!  The complimentary rice pudding after each dinner is always a nice touch as well!\n\n\n\nAs for the food recommendations;\n\nLamb samosas mixed with the sweet plum chutney and slightly-spicy green chutney with a touch of the pickled vegetables is a must! (Note: If you aren't using the trifecta of \"sauces\" then you aren't doing it right!)\n\nNavratan Korma is my favorite veggie dish! Sweet, creamy and compliments anything spicy on the table.\n\nBengan Bhartha also has a sweet after-taste, but the best part about this eggplant based curry is that you can hardly taste the eggplant, which is great for someone like me who isn't a big fan of eggplant!\n\nThe Tikka Masala (chicken or paneer), the Alu Vindaloo, the Aloo Matar, and the variety of Naan (especially the garlic basil) are TEXTBOOK classic here!\n\nTired the Lamb Biryani last night for the first time, and it truly was \"highly aromatic\" with a nice spicy kick.  Also the lamb pieces were generous!\n\nEverything is reasonably priced and you can customize the spicy level of each dish from mild-to-medium-to-spicy.\n\nAll I can say is thank you Om indian cuisine  !!!\n\nwill be back soon", "rating": 5, "date": "2016-09-03"}, {"excerpts": ["I got the chicken vindaloo on Sunday evening, and on Wednesday, I'm still nauseated and having serious stomach issues. ", "Don't trust the meat dishes here."], "author": "Nick S.", "review": "The food is delicious, but it gave me food poisoning. I got the chicken vindaloo on Sunday evening, and on Wednesday, I'm still nauseated and having serious stomach issues. Don't trust the meat dishes here.", "rating": 1, "date": "2017-01-25"}, {"excerpts": ["I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. ", "Potatoes and cauliflower cooked perfectly. ", "Tender but with a tooth... not mushy. "], "author": "Michael T.", "review": "This has become my favorite Indian Restaurant! After a resent neighborhood move, I was thrilled to discover this gem of a place in the Haight. The food is fresh, served hot ( no buffet ) by a charming and thorough wait staff. I personally like spicy hot, but the heat of the dishes is negotiable and the servers are especially helpful in recommending heat as well as menu items. Papadum, a wafer thin cracker is brought to the table right after you order with 3 sauces, a spicy, a sweet and a mint chutney. Their Daal soup is some of the best I have had. Thick and temperature hot with bits of lentils and goodness. I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. Potatoes and cauliflower cooked perfectly. Tender but with a tooth... not mushy. A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. A great restaurant that I find myself in weekly. Give it a try...,", "rating": 5, "date": "2017-08-18"}, {"excerpts": ["The chicken curry had no flavor and the cream broke so it looked curdy and gross. ", "The eggplant curry was ok? ", "We didn't eat that much of anything we ordered  (because this was the worst Indian food we've come across in a long time) and it still messed with us. ", "Never getting food from this restaurant again."], "author": "Ella M.", "review": "I'm fairly convinced that the positive reviews on this place are from family and friends. We ordered takeout from here and both got food poisoning. The chicken curry had no flavor and the cream broke so it looked curdy and gross. The eggplant curry was ok? We didn't eat that much of anything we ordered  (because this was the worst Indian food we've come across in a long time) and it still messed with us. Never getting food from this restaurant again.", "rating": 1, "date": "2016-10-17"}, {"excerpts": ["Upon the owner's suggestion, I ordered Chicken Tikka Masala, which he insisted was different/better than what is served elsewhere. ", "It didn't disappoint. ", "Sauce was a creamy coconut curry, and perfectly seasoned. ", "Chicken was moist and tender(so simple, but so important!). "], "author": "Jeff K.", "review": "Stopped in here on a Saturday while out and about, and was pleasantly surprised to find a great Indian restaurant on Haight Street! We were greeted immediately by the owner and promptly seated. The dining room was cozy and tastefully decorated, despite the fact they had only been open for a couple days. There's also a larger dining/banquet room in the back. \n\nFirst we had some Papadum wafer appetizers, served with 3 dipping sauces.\n\nUpon the owner's suggestion, I ordered Chicken Tikka Masala, which he insisted was different/better than what is served elsewhere. It didn't disappoint. Sauce was a creamy coconut curry, and perfectly seasoned. Chicken was moist and tender(so simple, but so important!). We also tried the Lamb Rogan Josh. Not sure about the story behind the name of this dish, but it certainly satisfied my craving for lamb, along with a little heat(medium spicy). Loved the spice combination and garlic in the sauce and the lamb was, yet again, very tender.\n\nWe ordered basmati rice and fresh naan with the meal which, in my opinion, is a must.\n\nAfter speaking with the owner, I learned he was actually from Nepal and legit, explaining the presence of some of the Himalayan dishes on the menu.\n\nHonestly, my only regret is that I didn't try more stuff here. I'll need to go back and delve deeper in to the menu, which I'm looking forward to!", "rating": 5, "date": "2016-07-24"}, {"excerpts": ["Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before", ",food was on door in 45 minutes, I couldn't stop licking my plate ! ", "Their food is awesome ! ", "Highly recommended to you people ! ", "Thank you Om Indian !"], "author": "Bhuwan A.", "review": "OM Indian is one of my best restaurant in San Francisco ! Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before,food was on door in 45 minutes, I couldn't stop licking my plate ! Their food is awesome ! Highly recommended to you people ! Thank you Om Indian !", "rating": 5, "date": "2017-02-09"}, {"excerpts": ["Chicken tikka masala between mild/med heat. ", "Absolutely the most perfect flavor, nicely tender. ", "Creamy and lightly, productively spiced but not too much heat. ", "Ordered basmati rice - good. ", "Then garlic naan & veg samosas (bc of delivery minimum). ", "Best samosas I have had yet. ", "Can't pinpoint how except the filling might be the most accurate texture/flavor combo. ", "Garlic naan was missing upon delivery - but I promptly called and they refunded my money. ", "The quality, the flavor, the variety all equal an A+ meal. ", "I loved WP Clay Oven before ", "but somehow this surpasses ", "that as delivery! ", "Happily surprised."], "author": "Shannon C.", "review": "So great. Fast delivery on a Sunday evening (a bit less than 1 hr at 5:30 pm). Chicken tikka masala between mild/med heat. Absolutely the most perfect flavor, nicely tender. Creamy and lightly, productively spiced but not too much heat. Ordered basmati rice - good. Then garlic naan & veg samosas (bc of delivery minimum). Best samosas I have had yet. Can't pinpoint how except the filling might be the most accurate texture/flavor combo. Garlic naan was missing upon delivery - but I promptly called and they refunded my money. The quality, the flavor, the variety all equal an A+ meal. I loved WP Clay Oven before but somehow this surpasses that as delivery! Happily surprised.", "rating": 5, "date": "2016-12-04"}, {"excerpts": ["However I do want to say that we ordered \"spicy\" for butter chicken and it looked like a lot of chili sauce had just been added to it... ", "and it hurt going down. ", "So, in the future we will stick with medium."], "author": "J L.", "review": "Yummy! Have ordered takeout from here several times and always been pleased. The flavors are good and unique - you can actually taste the differences between the different curries. Delivery is generally timely and no glitches. However I do want to say that we ordered \"spicy\" for butter chicken and it looked like a lot of chili sauce had just been added to it... and it hurt going down. So, in the future we will stick with medium.", "rating": 5, "date": "2017-06-13"}, {"excerpts": ["I've tried the Chicken Tikka Masala and it is unique but delicious. ", "The Paneer kadai was amazing as well. ", "So glad to have a great Indian place around the corner"], "author": "Noms U.", "review": "I've tried the Chicken Tikka Masala and it is unique but delicious. The Paneer kadai was amazing as well. So glad to have a great Indian place around the corner", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["The chicken momos are awesome and delicious."], "author": "Venu Gopal V.", "review": "Quality food with reasonable price and very nice customer service. The chicken momos are awesome and delicious.", "rating": 5, "date": "2016-12-26"}, {"excerpts": ["And butter chicken (my all time favorite) was tasty! ", "Maybe i should actually pay them a visit next time. ", "Thank you for the good delivery experience!"], "author": "Jenn Z.", "review": "I ordered delivery from these guys and it was estimated at a 50-60 min delivery time. So i was really surprised when they showed up at my doorstep 30 minutes after i placed my order. The samosas were piping hot and crunchy on the outside. The garlic naan was buttery and LARGE! And butter chicken (my all time favorite) was tasty! Maybe i should actually pay them a visit next time. Thank you for the good delivery experience!", "rating": 5, "date": "2016-08-29"}, {"excerpts": ["- Tandoori Chicken Wings, $9.95 these were good.\n", "- Tandoori Assorted, $10.95 - fine. ", "No grizzly meats, ", "so that's good. ", "But they were missing a nice little tangy kick.\n", "- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. ", "Very low on flavor. ", "Highly overpriced.\n", "Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. ", "Also missing that nice tikka tangy kick.\n", "- Butter Chicken Masala, $12.95 - fine.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}, {"excerpts": ["I have ordered several times, and like another reviewer has mentioned, the chicken (in several different dishes) has always been overcooked and tough.  ", "The sauces are good.  ", "The highlight of the meal is always the samosas--the pastry is not too thick or brittle, and the insides are flavorful."], "author": "King R.", "review": "Definitely a significant improvement over what was there previously (under several different names), but that wouldn't have been hard.  There's finally acceptable Indian food at this location.  Solid, but not wonderful.  I have ordered several times, and like another reviewer has mentioned, the chicken (in several different dishes) has always been overcooked and tough.  The sauces are good.  The highlight of the meal is always the samosas--the pastry is not too thick or brittle, and the insides are flavorful.", "rating": 3, "date": "2016-12-19"}, {"excerpts": ["Chicken Tikka Masala ", "I usually always order. ", "It is so creamy ", "and I love getting it spicy. ", "It's very spicy, but I'm into that. ", "Definitely, terrible for you with how creamy it is. "], "author": "Gabrielle C.", "review": "I love Indian food so much. I think there was a stint where I would order delivery from Om, once a week. Oops. Somosas are delicious and huge. Saag Paneer is okay. It had an interesting aftertaste and I have only ordered it once. Chicken Tikka Masala I usually always order. It is so creamy and I love getting it spicy. It's very spicy, but I'm into that. Definitely, terrible for you with how creamy it is. Lamb Curry is delicious. I love the curry itself. The lamb is tender, but a little gamy tasting. Garlic Naan is a must. They have the best naan. I also like the Serrano chili naan, but just prefer garlic. Rice is cooked perfectly.", "rating": 5, "date": "2017-03-22"}, {"excerpts": ["I tried their tandoori chicken, it was perfect. ", "Chicken was well cooked and right amount of onions. ", "I tried their Gallic naan which was the best naan ever had. ", "Server and waiters are  very friendly. ", "I only regret is I didn't try their other food. ", "Restaurant was super clean and nice aroma as soon as I entered. ", "I recommend this new restaurant to my friends and family"], "author": "Sugam K.", "review": "I was trolling around height street, when I saw this new place I first hesitate to give a try because I had a bad experience with previous name. I tried their tandoori chicken, it was perfect. Chicken was well cooked and right amount of onions. I tried their Gallic naan which was the best naan ever had. Server and waiters are  very friendly. I only regret is I didn't try their other food. Restaurant was super clean and nice aroma as soon as I entered. I recommend this new restaurant to my friends and family", "rating": 5, "date": "2016-08-27"}, {"excerpts": ["Excellent garlic naan, saag paneer, butter chicken masala, lamb chops. ", "Came hot and we specified one dish medium hot and one mild ", "and that's exactly how they came!"], "author": "Jane M.", "review": "Just one experience, but terrific delivered food. Oh I hope they stay this good! Excellent garlic naan, saag paneer, butter chicken masala, lamb chops. Came hot and we specified one dish medium hot and one mild and that's exactly how they came!", "rating": 5, "date": "2016-08-05"}, {"excerpts": ["I've tried a few of the things here, such as the Biryani, Tikka Masala, and the Chicken Korma.  "], "author": "Max B.", "review": "This has been the best addition to the neighborhood in a long time!  We haven't had a great Indian spot in Upper Haight and now with Om Indian Cuisine we really do.  I used to have to go to Lower Haight for my Indian fix but I now prefer this to the further options I used to visit.  This is now a once a week place for me and I hope they have success in this location.  The staff is also really nice.\n\nI've tried a few of the things here, such as the Biryani, Tikka Masala, and the Chicken Korma.  For me, the Korma really stands out - this is my new go to.\n\nI haven't eaten inside yet but the place looks really good - they clearly did a lot of work after taking over from the previous establishment.  One area that I think could be improved are the expected pick up times - there's a huge variance when you order online and it's hard to tell when I should come in to get my pickup.  However, this is a new restaurant and I'm sure this will improve with time.  \n\nGreat addition to the area, I'll certainly be back in often!", "rating": 5, "date": "2016-09-20"}, {"excerpts": ["Loved the food we ordered, the tandoori mixed grill and the chicken Tikka masala was our favorite!! ", "The art work in the back room was amazing too:)"], "author": "Maryam K.", "review": "Loved the food we ordered, the tandoori mixed grill and the chicken Tikka masala was our favorite!! The art work in the back room was amazing too:)", "rating": 5, "date": "2016-08-07"}, {"excerpts": ["I ordered  tikka masala, garlic naan and chicken tikka kebab ", "it was so fast and very yummy...  ", "Naan was like a foot long, tikka kebab was ", "well cooked and chicken tikka masala is the best so far. ", "I would definitely recommend and visit again to this fancy restaurant in upper haight"], "author": "Anil P.", "review": "Today I visited this restaurant and I got a great response from the restaurant people.... The interior was nicely decorated. I was welcomed with free papadum. The sauce came with papadum had amazing flavor. I ordered  tikka masala, garlic naan and chicken tikka kebab it was so fast and very yummy...  Naan was like a foot long, tikka kebab was well cooked and chicken tikka masala is the best so far. I would definitely recommend and visit again to this fancy restaurant in upper haight", "rating": 5, "date": "2016-08-15"}, {"excerpts": ["Had dinner in om Indian restaurant the menu was exquisite and the service was excellent the most tasty chicken tikka masala I had in the Bay Area and lastly I ordered mango lassi the taste was out of this world.the best part is that everything is served a la carte from the menu. ", "I also asked them about home deliveries and they have told me that they do free home delivery service to their customers.one of the best Indian restaurants in the Bay Area"], "author": "Bhargav Tej Kumar Reddy S.", "review": "Had dinner in om Indian restaurant the menu was exquisite and the service was excellent the most tasty chicken tikka masala I had in the Bay Area and lastly I ordered mango lassi the taste was out of this world.the best part is that everything is served a la carte from the menu. I also asked them about home deliveries and they have told me that they do free home delivery service to their customers.one of the best Indian restaurants in the Bay Area", "rating": 5, "date": "2016-10-10"}, {"excerpts": ["I ordered the chicken tikka masala and it definitely surpassed my expectations. ", "The chicken was so juicy and tender and the sauce was creamy and coconutty. ", "I'm proud to say that, that was the best chicken tikka masala I have ever had! ", "Even though this place is still under some construction, it has a pretty chill vibe the service was adequate. ", "I will for sure come back and try their other selections of food."], "author": "Ashley O.", "review": "I came by yesterday while strolling around height and ashbury. I was so impressed by the quality of their food, considering that I went there on the second day of opening. I ordered the chicken tikka masala and it definitely surpassed my expectations. The chicken was so juicy and tender and the sauce was creamy and coconutty. I'm proud to say that, that was the best chicken tikka masala I have ever had! Even though this place is still under some construction, it has a pretty chill vibe the service was adequate. I will for sure come back and try their other selections of food.", "rating": 5, "date": "2016-07-24"}, {"excerpts": ["Fabulous food and friendly environment.specifically chicken tikka malasa was very tasty"], "author": "Madadi R.", "review": "Fabulous food and friendly environment.specifically chicken tikka malasa was very tasty", "rating": 4, "date": "2016-08-04"}, {"excerpts": ["The chicken was tender and fresh.  ", "I took 1/2 my order home to save for dinner. ", "It was even better reheated.  ", "I can't give it 4 stars cause it's so new and will have growing pains."], "author": "Alston L.", "review": "I've never been to India so I don't know how authentic the food is but I really liked it. It's a big step up from its two predecessors. The owner Ajay (sp?) is young, ambitious, and wants to provide good food and service.I had both.  The chai spices are subtle and not overwhelming.  The creamy tikka masala has a hint of spiciness which I like.  Had a choice of little to heavy heat.  The mango chutney and raita are a nice accompaniment .  The chicken was tender and fresh.  I took 1/2 my order home to save for dinner. It was even better reheated.  I can't give it 4 stars cause it's so new and will have growing pains.", "rating": 4, "date": "2016-08-03"}, {"excerpts": ["The butter chicken and daal makhani were the best we have had for a long time. ", "The lamb was amazingly tender in the kebabs. ", "It's a pity we are visiting from NJ ", "otherwise we would be here again next week !"], "author": "Kiera H.", "review": "We stopped by yesterday with our family of six and were initially a little wary as the decor was still being finished. However we were VERY impressed with the food. The butter chicken and daal makhani were the best we have had for a long time. The lamb was amazingly tender in the kebabs. It's a pity we are visiting from NJ otherwise we would be here again next week !", "rating": 5, "date": "2016-08-04"}, {"excerpts": ["Ordered the chicken tikka masala, garlic naan, and rice pudding. ", "Everything was delicious and the fresh basil they provided was such a nice topping. ", "Free delivery was nice. ", "I couldn't finish all of the food ", "but I will definitely have some of my leftovers later. ", "So good!"], "author": "Sean S.", "review": "Ordered the chicken tikka masala, garlic naan, and rice pudding. Everything was delicious and the fresh basil they provided was such a nice topping. Free delivery was nice. I couldn't finish all of the food but I will definitely have some of my leftovers later. So good!", "rating": 5, "date": "2017-01-04"}, {"excerpts": ["We came in with a group of friends on a busy day,We ordered chicken tikka masala, garlic naan, and tandoori chicken.", "We liked all these dishes and chicken tikka masala yummy and the best i have tried in the bay area.", "Overall this place is really nice,delicious food."], "author": "Soma A.", "review": "If your looking for an authentic indian restaurant look no more, this place is really good.We came in with a group of friends on a busy day,We ordered chicken tikka masala, garlic naan, and tandoori chicken.We liked all these dishes and chicken tikka masala yummy and the best i have tried in the bay area.Overall this place is really nice,delicious food.", "rating": 5, "date": "2016-10-10"}, {"excerpts": ["I ordered chicken 65 , saag paneer,chicken tikka masala and chicken achari. ", "Everything so delicious. ", "I never had that flavor of tikka masala anywhere in Bay Area and samosa was cooked perfectly and crispy.l'll come back again."], "author": "Krishna K.", "review": "Om Indian cusian has best flavor of Indian food.  They have good collections of local draft beers too. I ordered chicken 65 , saag paneer,chicken tikka masala and chicken achari. Everything so delicious. I never had that flavor of tikka masala anywhere in Bay Area and samosa was cooked perfectly and crispy.l'll come back again.", "rating": 5, "date": "2016-07-27"}, {"excerpts": ["Can't say one particular dish is delicious I tried some pakoras tandoori chkn wings and the chicken tikka masala with garlic naan and some basmati rice which are really mouth watering", ", it's better to try this kind of place which is run by an individual who treats each and every customer in a well mannered way which makes people feel comfortable who came to dine out with some hunger,celebrate their memorable spl movements obviously expect some hospitality which these guys had plenty some ova here with some delicious mouth watering tasty food started  loving this place hope to see you guys soon... ", "You guys gonna rock for sure,I wish you guys a very good luck."], "author": "Phani C.", "review": "Don't know exactly from where I could start... I wasn't aware of this place until i step in... I was greeted as soon as I entered later I came to realise that he's the owner of that place Mr.aj Not too clumsy good scape between the tables which gives some privacy which has been lacked now a days beyond that we were given enough time and complimentary papad mean while we had a good glance at the menu.... Here's the real part which proves the class of the restaurant in which this place has excelled.... Can't say one particular dish is delicious I tried some pakoras tandoori chkn wings and the chicken tikka masala with garlic naan and some basmati rice which are really mouth watering, it's better to try this kind of place which is run by an individual who treats each and every customer in a well mannered way which makes people feel comfortable who came to dine out with some hunger,celebrate their memorable spl movements obviously expect some hospitality which these guys had plenty some ova here with some delicious mouth watering tasty food started  loving this place hope to see you guys soon... You guys gonna rock for sure,I wish you guys a very good luck.", "rating": 5, "date": "2016-08-25"}, {"excerpts": ["We had the tandoori chicken, mono, okra, and shrimp curry ", "and it was delicious"], "author": "Amit P.", "review": "Great food and service.  We had the tandoori chicken, mono, okra, and shrimp curry and it was delicious", "rating": 5, "date": "2016-08-06"}], "vegetable samosa": [], "baingan pakora": [], "palak pakora": [], "chicken pakora": [], "fish pakora": [], "calamari pakora": [], "appetizer platter": [], "papri chaat": [], "spinach bhajia": [], "tikka naan": [], "keema naan": [{"excerpts": ["Keema Naan - 4/5\nChicken Chilly - 4.5/5\n", "Chicken Tikka - 5/5 (I love it)"], "author": "Manjari R.", "review": "Best Indian restaurant in San Francisco.\nIf you are looking for the Indian spicy level - make sure you mention 'SPICY' when placing the order.\nMango Lassi - 5/5\nSerrano Chilli Naan - 5/5\nKeema Naan - 4/5\nChicken Chilly - 4.5/5\nChicken Tikka - 5/5 (I love it)", "rating": 5, "date": "2017-12-07"}], "spicy mixed vegetables soup": [{"excerpts": ["- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. ", "And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. ", "Very low on flavor. ", "Certainly no kick from anything lemony. ", "Highly overpriced.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "daal soup": [{"excerpts": ["Their Daal soup is some of the best I have had. ", "Thick and temperature hot with bits of lentils and goodness. "], "author": "Michael T.", "review": "This has become my favorite Indian Restaurant! After a resent neighborhood move, I was thrilled to discover this gem of a place in the Haight. The food is fresh, served hot ( no buffet ) by a charming and thorough wait staff. I personally like spicy hot, but the heat of the dishes is negotiable and the servers are especially helpful in recommending heat as well as menu items. Papadum, a wafer thin cracker is brought to the table right after you order with 3 sauces, a spicy, a sweet and a mint chutney. Their Daal soup is some of the best I have had. Thick and temperature hot with bits of lentils and goodness. I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. Potatoes and cauliflower cooked perfectly. Tender but with a tooth... not mushy. A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. A great restaurant that I find myself in weekly. Give it a try...,", "rating": 5, "date": "2017-08-18"}], "chicken mulligatwany soup": [], "tomato bisque": [], "chicken momo": [{"excerpts": ["Chicken momo, Garlic Naan, Tikka masala are blowing. ", "I will visit this place again v.soon....."], "author": "Maniteja C.", "review": "I have been to these place multiple times every visit I enjoy the ambience and comes out very satisfied. Chicken momo, Garlic Naan, Tikka masala are blowing. I will visit this place again v.soon.....", "rating": 5, "date": "2018-09-15"}, {"excerpts": ["*Chicken Momo: ", "Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n", "*", "Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n", "*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n"], "author": "Elena N.", "review": "I was craving Indian food, but the roommate wanted something else. We decided to order delivery from two different places for lunch. (Yes, we are fat a$$es!) I placed an order through UberEATS on Monday, January 16th at 1:01pm. It arrived at 1:53pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour, and tamarind chutney ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\nI love my Indian food spicy, so I was happy they served serrano naan. It added a great kick to the curries. I adore thick curries, but the tikka masala was actually a little too thick for me. I did love the spice level and flavors though. We ended up adding the vindaloo sauce to the tikka masala to thin it out a bit. The samosas were great! Soft on the inside and crispy on the outside. I didn't really like the mint chutney though. It wasn't creamy and minty enough. I love dumplings so I decided to get the momos. I think they come with a dipping sauce as I got something I thought was the hot and sour sauce for the samosas. It tasted more like a chutney I've had in the past with momos. The roommate enjoyed the dishes he ordered, the vindaloo and the assorted naans.\n\nIndian is one of my comfort foods, so I'm glad I discovered another great option for delivery.", "rating": 4, "date": "2017-01-29"}, {"excerpts": ["I had chicken momo and tandori with garlic naan. \n"], "author": "Akash S.", "review": "One of My favourite Indian restaunt in this San Francisco. \nI had chicken momo and tandori with garlic naan. \nAwesome !!\n\nWait staff were really friendly and prmpt. \n\nI was impressed with the quality of food and service .", "rating": 5, "date": "2017-09-10"}, {"excerpts": ["My favorite was the chicken momo, which we got as an appetizer. "], "author": "Kelly G.", "review": "I rarely give 5 stars, but all things considered, I had a very good experience at Om. The food was delicious, the service was kind and prompt, and better than anything, there is plenty of seating, quiet atmosphere, and not overly priced (based on SF standards)\n\nThe chicken tikka masala is creamy and flavorful, as is the chicken coconut curry. The garlic naan is delicious and warm and comes in a basket draping over the sides. \n\nMy favorite was the chicken momo, which we got as an appetizer. I've never had dumplings/pot stickers with these kind of flavors and they were SO good. \n\nThere was one miscommunication, which was that we requested a bottle of wine and they brought 2 glasses of wine instead. But, in all fairness, we probably didn't need a bottle of wine for two people. I mean, we would've finished it, but whether we needed that much wine is debatable :P", "rating": 5, "date": "2016-10-24"}, {"excerpts": ["Food is very good and flavorful..service is awesome..highly recommend this place chicken momo ", "so yummy best ", "I've had in years.............................................."], "author": "RaZan L.", "review": "Food is very good and flavorful..service is awesome..highly recommend this place chicken momo so yummy best I've had in years..............................................", "rating": 5, "date": "2017-11-02"}, {"excerpts": ["I had Chicken momo, Samosa, some Indian sweets and lassi, reminded me of home. ", "Now my fav place to order food. ", "Try this place"], "author": "Ramesh A.", "review": "Best food ever. I had Chicken momo, Samosa, some Indian sweets and lassi, reminded me of home. Now my fav place to order food. Try this place", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["We ordered our meal: Chicken Momo as an appetizer, Salmon with spinach, rice, coconut naan and a single Kingfisher beer. ", "Ten minutes later, the restaurant started to fill up, and we saw the folks at the table next to us get seated. ", "The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. ", "I was confused ", "The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. ", "I was confused ", "so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. ", "45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. ", "so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. ", "45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. ", "Yet still, no Chicken Momo. \n\n", "Yet still, no Chicken Momo. \n\n", "Once again, we said we never received the Chicken Momo appetizer. ", "He assured us that it was coming. ", "Once again, we said we never received the Chicken Momo appetizer. ", "He assured us that it was coming. ", "Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. ", "My spouse noticed the same thing. ", "I told the waiter, who looked astounded when I said it was completely inedible. ", "Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. ", "My spouse noticed the same thing. ", "I told the waiter, who looked astounded when I said it was completely inedible. ", "The waiter finally relented when I asked, \"Who wants to eat raw chicken?"], "author": "Susan L.", "review": "I am so heartbroken to leave a bad review. I really wanted our dinner to be as sumptuous as I'd heard this place was but our meal was really disappointing.\n\nMy spouse and I arrived for dinner on a Wednesday evening at 730,  when there were just a few other folks in the restaurant. We ordered our meal: Chicken Momo as an appetizer, Salmon with spinach, rice, coconut naan and a single Kingfisher beer. Ten minutes later, the restaurant started to fill up, and we saw the folks at the table next to us get seated. The folks at that table next to us ordered after us, but got the Chicken Momo fried dumping appetizer very shortly after they ordered it. I was confused so I said to the waiter, \"I think that may be our order of Chicken Momo,\" but the waiter assured me it was not. 45 minutes after we ordered, our main dish arrived - and to their credit, the salmon was fresh, the spinach was tasty and it was wonderful - along with the basmati rice and delicious coconut naan. Yet still, no Chicken Momo. \n\nAs our dinner plates were being cleared, the waiter asked how everything was. Once again, we said we never received the Chicken Momo appetizer. He assured us that it was coming. Almost an hour after we ordered, the Chicken Momo came out - and with my first bite, I immediately realized the insides were ice cold. My spouse noticed the same thing. I told the waiter, who looked astounded when I said it was completely inedible. The waiter finally relented when I asked, \"Who wants to eat raw chicken?\"\n\nNo, the restaurant didn't charge us for inedible food that we couldn't eat. And yes, I appreciate the 10% discount off our bill. But when the waiter said he was bringing us out a comped dessert of rice pudding -- which neither of us can eat because we cannot eat dairy -- we protested and asked him not to do so. Nonetheless, the rice pudding was placed on our table and sat untouched. So that was a terrible waste of food, which really unnerved me. It would have been better customer service to at least comp us our Kingfisher beer, which we did drink.\n\nSo I'm sad to say, no thanks.", "rating": 1, "date": "2016-10-05"}, {"excerpts": ["Try chicken tikka masala & chicken momo ", "expected one hour but got delivered in twenty minutes . ", "The menu was also very innovative and the prices were also not so high I would recommend this restaurant to any one who is new to the Bay Area or is a tourist."], "author": "Asif R.", "review": "Try chicken tikka masala & chicken momo expected one hour but got delivered in twenty minutes . The menu was also very innovative and the prices were also not so high I would recommend this restaurant to any one who is new to the Bay Area or is a tourist.", "rating": 5, "date": "2017-04-19"}, {"excerpts": ["Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before", ",food was on door in 45 minutes, I couldn't stop licking my plate ! ", "Their food is awesome ! ", "Highly recommended to you people ! ", "Thank you Om Indian !"], "author": "Bhuwan A.", "review": "OM Indian is one of my best restaurant in San Francisco ! Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before,food was on door in 45 minutes, I couldn't stop licking my plate ! Their food is awesome ! Highly recommended to you people ! Thank you Om Indian !", "rating": 5, "date": "2017-02-09"}], "vegetable momo": [], "mixed vegetable": [], "navaratna korma": [], "baigan bharta": [{"excerpts": ["Aloo gobi and baigan bharta: great vegetarian dishes.\n", "6. ", "Garlic naan: ", "fluffy, chewy, and moist. ", "Right on guys.\n"], "author": "Tata X.", "review": "My go to spot for Indian take out. They pay attention to details and are very heavy handed on spices, which if you are going for Indian food, that's what you should expect.\n\nWe love \n1. Chicken tandoori: the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. You simply have to try.\n2. Lamb shank: meat is falling off the bones\n3. Chicken tikka masala: average, I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. Aloo gobi and baigan bharta: great vegetarian dishes.\n6. Garlic naan: fluffy, chewy, and moist. Right on guys.\nWe do not like the pudina paratha, which is a wheat bread. It is hard and taste like cardboard\n\nTip:\nTheir spice level is not consistent. When in doubt, round down. I order their spiciest level a couple times. Once, it was so spicy that even after adding 200% more bland vegetable and rice in it, it was still too spicy, and I usually eat at the spiciest level at asian cuisines.", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["$9.95 \n\nBaigan Bharta "], "author": "Fannie S.", "review": "We tried delivery from this place recently.  \n\nVegetable Pakora = full of flavor and crisp. Even for delivery. $4.95 \n\nTandoori Chicken Wings = awesome. Moist and flavorful chicken wings. And I loved the onions and peppers that come with them! $9.95 \n\nBaigan Bharta = smoky eggplant. Delicious. $10.95 \n\nSaag Paneer  = good. On the mild side. $10.95\n\nChicken Tikka Masala = excellent. Slightly sweet, smoky and hit the spot. He loved it. $12.95 \n\nRaita  = typical. $2.95 \n\nMixed Pickle  = Tart and spicy. Exactly what he wanted. $1.95 \n\nBasmati Rice = good. $2.95 \n\nGarlic Naan = good. (Better after sticking it in the oven though.) $2.95 \n\nKheer  = a most peculiar version. It was tart/sour. I ended up composting because I couldn't eat more than 3 spoonfuls. $3.95 \n\nPrices = moderate. $64.50 before taxes and discount code. We had leftovers for two more meals.", "rating": 4, "date": "2016-11-16"}, {"excerpts": ["I had ordered both the baigan bharta and saag paneer as \"spicy\", which is normally perfect for me. ", "They make their dishes a little spicer than average, and the food upset my stomach. ", "The next morning I spent quite a long time in the bathroom."], "author": "Patricia D.", "review": "While the food was tasty, it did not sit well with me. I had ordered both the baigan bharta and saag paneer as \"spicy\", which is normally perfect for me. They make their dishes a little spicer than average, and the food upset my stomach. The next morning I spent quite a long time in the bathroom.", "rating": 3, "date": "2017-02-27"}, {"excerpts": ["- Baigan Bharta (Vegan), $10.95 - fine. "], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "jeera aloo": [{"excerpts": ["Chiken tika masala, jeera aloo and  lamb curry ", "a has amazing flavors  and well cooked.\n", "The cheese Naan is well done warm and nice flavor.\n", "Come again. ", "I recommend 100%"], "author": "Victor O.", "review": "The food is great and tasting very good well done.\nService is great, friendly.\nChiken tika masala, jeera aloo and  lamb curry a has amazing flavors  and well cooked.\nThe cheese Naan is well done warm and nice flavor.\nCome again. I recommend 100%", "rating": 5, "date": "2016-08-16"}, {"excerpts": ["I highly recommend the jeera aloo and spinach naan. ", "I'm vegan, and they had plenty of options for me. ", "The reason why I docked them a star is because I waited about 20-25 minutes for my food. ", "However, it was well worth the wait!"], "author": "Julia A.", "review": "This is the best Indian food I've ever had. I highly recommend the jeera aloo and spinach naan. I'm vegan, and they had plenty of options for me. The reason why I docked them a star is because I waited about 20-25 minutes for my food. However, it was well worth the wait!", "rating": 4, "date": "2017-10-28"}], "saag aloo": [{"excerpts": ["Saag aloo, chicken tikka masala, and a couple of different naans.  ", "The staff was attentive, helpful, and the food was ready fast.  ", "Everything was delicious!!  ", "We've added it to our take-out go-to list.  ", "Can't wait to eat there again."], "author": "Jen H.", "review": "We ordered dinner to-go from Om last week.  Saag aloo, chicken tikka masala, and a couple of different naans.  The staff was attentive, helpful, and the food was ready fast.  Everything was delicious!!  We've added it to our take-out go-to list.  Can't wait to eat there again.", "rating": 4, "date": "2017-08-07"}], "matar paneer": [{"excerpts": ["We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. ", "Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. ", "I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. ", "Naan was big and very freshly made.\n", "To make our experience even better we were offered complimentary desserts.\n", "I would definitely go there again and this has become my new favorite place to go."], "author": "Sub N.", "review": "This new neighborhood gem is fabulous.\nWe were party of five for dinner and we were greeted as soon as we entered by the owner himself. It has a very impressive ambiance with beautiful hand painting at the dinning hall walls and i must say the whole place is clean.The service was fast and very friendly. \nThe owner answered any question we had about the food. We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. Naan was big and very freshly made.\nTo make our experience even better we were offered complimentary desserts.\nI would definitely go there again and this has become my new favorite place to go.", "rating": 5, "date": "2016-08-22"}], "aloo gobi": [{"excerpts": ["We also ordered the veggie momos, aloo gobi, and rice.  "], "author": "Jessica L.", "review": "Call me basic, but I can't resist ordering chicken tikka masala.\n\nThe nice twist this time is we ordered salmon instead of chicken and it was delicious!  The salmon was grilled perfectly before going into the sauce, and was nice and tender.  The garlic naan is great by itself, and sublime with the tikka masala.  We also ordered the veggie momos, aloo gobi, and rice.  Everything was done well, and the food came out at a reasonable pace.\n\nService was nice and attentive, they change your plates in between apps and mains and water glasses are never empty.  At the end of the meal, I had expected the bill to be around $60, but it was only $45.  A steal considering SF prices!\n\nTips and Tricks\n-They serve papadums as a free appetizer, so yummy!\n-One app, a curry, a veggie dish, naan, and a side of rice was just the right amount of food for 2 hungry girls", "rating": 5, "date": "2018-03-12"}, {"excerpts": ["Aloo gobi and baigan bharta: great vegetarian dishes.\n", "6. ", "Garlic naan: ", "fluffy, chewy, and moist. ", "Right on guys.\n"], "author": "Tata X.", "review": "My go to spot for Indian take out. They pay attention to details and are very heavy handed on spices, which if you are going for Indian food, that's what you should expect.\n\nWe love \n1. Chicken tandoori: the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. You simply have to try.\n2. Lamb shank: meat is falling off the bones\n3. Chicken tikka masala: average, I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. Aloo gobi and baigan bharta: great vegetarian dishes.\n6. Garlic naan: fluffy, chewy, and moist. Right on guys.\nWe do not like the pudina paratha, which is a wheat bread. It is hard and taste like cardboard\n\nTip:\nTheir spice level is not consistent. When in doubt, round down. I order their spiciest level a couple times. Once, it was so spicy that even after adding 200% more bland vegetable and rice in it, it was still too spicy, and I usually eat at the spiciest level at asian cuisines.", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["We ordered the Shrimp Tikka Masala, Aloo Gobi and Serrano pepper naan. ", "All delicious. ", "I have to also shout out their surprisingly good chai. "], "author": "Cynthia G.", "review": "I went here this past Sunday to have dinner with a friend. We ordered the Shrimp Tikka Masala, Aloo Gobi and Serrano pepper naan. All delicious. I have to also shout out their surprisingly good chai. Normally when I order chai from Indian restaurants it's okay, nothing to brag about, just a brown compulsion of mine to always have chai at the table.\n\nI tried the Serrano pepper naan. It definitely adds a little kick to the naan. \n\nI want to come back and try their Indian pizza, if it's as good as the spots I have been to in Berkeley I am sold on this being my new Indian spot in the city. \n\nThe prices are super reasonable too. \n\nHighly recommend.", "rating": 4, "date": "2017-11-14"}, {"excerpts": ["The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! ", "Don't miss out on this divine experience."], "author": "Maria B.", "review": "Delicious EVERY time we visit! The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! Don't miss out on this divine experience.", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. ", "One of the few places I know that does Malai Kofta so deliciously.  ", "They filled up every container. ", "Really enjoyed the meal. ", "Will definitely order again."], "author": "minnie l.", "review": "Flavorful and they mean it when they say Spicy!  I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. One of the few places I know that does Malai Kofta so deliciously.  They filled up every container. Really enjoyed the meal. Will definitely order again.", "rating": 5, "date": "2017-09-26"}, {"excerpts": ["I've enjoyed the vegetarian saag paneer, chana masala, aloo gobi & paneer korma. ", "Naan is also nice & thin and has the right amount of char on it. ", "Best Indian delivery I've had in SF!"], "author": "Marybeth S.", "review": "Excellent delivery option in the Haight & Cole Valley! The food is always fresh and delivery from Eat24 is fast. Seems like they really care about their food. I've enjoyed the vegetarian saag paneer, chana masala, aloo gobi & paneer korma. Naan is also nice & thin and has the right amount of char on it. Best Indian delivery I've had in SF!", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["We had Aloo Gobi, coconut braised shank and bullet naan. ", "It ran too fast. \n", "We will go back again n again."], "author": "Laxman A.", "review": "Again, chef Arun rocked in this facility big time. Amazing food, amicable ambiance and fantastic service. We had Aloo Gobi, coconut braised shank and bullet naan. It ran too fast. \nWe will go back again n again.", "rating": 5, "date": "2017-01-13"}, {"excerpts": ["I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. ", "Potatoes and cauliflower cooked perfectly. ", "Tender but with a tooth... not mushy. "], "author": "Michael T.", "review": "This has become my favorite Indian Restaurant! After a resent neighborhood move, I was thrilled to discover this gem of a place in the Haight. The food is fresh, served hot ( no buffet ) by a charming and thorough wait staff. I personally like spicy hot, but the heat of the dishes is negotiable and the servers are especially helpful in recommending heat as well as menu items. Papadum, a wafer thin cracker is brought to the table right after you order with 3 sauces, a spicy, a sweet and a mint chutney. Their Daal soup is some of the best I have had. Thick and temperature hot with bits of lentils and goodness. I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. Potatoes and cauliflower cooked perfectly. Tender but with a tooth... not mushy. A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. A great restaurant that I find myself in weekly. Give it a try...,", "rating": 5, "date": "2017-08-18"}, {"excerpts": ["We ordered aloo gobi, coconut curry, nann, lamb saag that was a lamb shank. ", "Great place for vegetarians."], "author": "Robert T.", "review": "We found parking on Haight Street and started trolling for a restaurant. We walked past a newer looking Indian restaurant and after reviewing the few Yelp comments we decided to try it. Good move! This place is only 8 days old and has excellent service, fresh food and beautiful interiors with painted murals depicting Indian life and landscapes.\n\nWe ordered aloo gobi, coconut curry, nann, lamb saag that was a lamb shank. Great place for vegetarians.", "rating": 5, "date": "2016-08-12"}], "aloo matar": [{"excerpts": ["The Tikka Masala (chicken or paneer), the Alu Vindaloo, the Aloo Matar, and the variety of Naan (especially the garlic basil) are TEXTBOOK classic here!\n\n"], "author": "Ford T.", "review": "Easy 5 stars for my favorite  OM  Indian restaurant in san francisco .  I have driven way out of my way just to dine here and carry-out.  Brought my picky and hard-to-impress a friend  here last night with his wifey, and they loved it.\n\nBig props to the owner & management who run this place like a well-oiled machine with stellar service each time.  Our water cups were never even half empty!  The complimentary rice pudding after each dinner is always a nice touch as well!\n\n\n\nAs for the food recommendations;\n\nLamb samosas mixed with the sweet plum chutney and slightly-spicy green chutney with a touch of the pickled vegetables is a must! (Note: If you aren't using the trifecta of \"sauces\" then you aren't doing it right!)\n\nNavratan Korma is my favorite veggie dish! Sweet, creamy and compliments anything spicy on the table.\n\nBengan Bhartha also has a sweet after-taste, but the best part about this eggplant based curry is that you can hardly taste the eggplant, which is great for someone like me who isn't a big fan of eggplant!\n\nThe Tikka Masala (chicken or paneer), the Alu Vindaloo, the Aloo Matar, and the variety of Naan (especially the garlic basil) are TEXTBOOK classic here!\n\nTired the Lamb Biryani last night for the first time, and it truly was \"highly aromatic\" with a nice spicy kick.  Also the lamb pieces were generous!\n\nEverything is reasonably priced and you can customize the spicy level of each dish from mild-to-medium-to-spicy.\n\nAll I can say is thank you Om indian cuisine  !!!\n\nwill be back soon", "rating": 5, "date": "2016-09-03"}], "daal makhani": [{"excerpts": ["so just had Daal Makhani and Vegetable Pakora alongside Roti and Raita. "], "author": "Waqas A.", "review": "Authentic Indian food with great ambiance and service on Haights Street. We were not too hungry so just had Daal Makhani and Vegetable Pakora alongside Roti and Raita. The quality of the food couldn't be better, chef really took his time!\n\nAlso liked their Chai. I'll be returning here quite often hoping they stay as good.", "rating": 5, "date": "2016-08-05"}, {"excerpts": ["The butter chicken and daal makhani were the best we have had for a long time. ", "The lamb was amazingly tender in the kebabs. ", "It's a pity we are visiting from NJ ", "otherwise we would be here again next week !"], "author": "Kiera H.", "review": "We stopped by yesterday with our family of six and were initially a little wary as the decor was still being finished. However we were VERY impressed with the food. The butter chicken and daal makhani were the best we have had for a long time. The lamb was amazingly tender in the kebabs. It's a pity we are visiting from NJ otherwise we would be here again next week !", "rating": 5, "date": "2016-08-04"}], "coconut vegetables curry": [{"excerpts": ["I highly recommend the Tandoori Chicken and the Coconut Vegetables Curry!"], "author": "Alisa A.", "review": "Om is my go-to when I'm craving a flavorful meal! It is great that they have open for home delivery as well. \n\nI highly recommend the Tandoori Chicken and the Coconut Vegetables Curry!", "rating": 4, "date": "2018-07-24"}], "bhindi masala": [{"excerpts": ["I ordered Bhindi Masala and chicken tikka masala with garlic naan. ", "Everything was awful. ", "Bhindi masala so over cooked it was inedible. ", "Tasted burnt and bitter and just was terrible. ", "Usually Bhindi masala is herbaceous and flavorful, this was definitely not that. ", "The chicken tikka masala was so salty. ", "At other Indian restaurants the chicken falls apart because it is so tender in the sauces. ", "This was hard chicken with zero flavor, I've had been chicken tikka masala from Trader Joe's. ", "The naan was also burnt and flavorless. ", "Did I get a bad night for the chef? ", "I don't know ", "but I won't be trying this place again, super disappointing."], "author": "Meghan G.", "review": "I got takeout from here after great reviews on here. I ordered Bhindi Masala and chicken tikka masala with garlic naan. Everything was awful. Bhindi masala so over cooked it was inedible. Tasted burnt and bitter and just was terrible. Usually Bhindi masala is herbaceous and flavorful, this was definitely not that. The chicken tikka masala was so salty. At other Indian restaurants the chicken falls apart because it is so tender in the sauces. This was hard chicken with zero flavor, I've had been chicken tikka masala from Trader Joe's. The naan was also burnt and flavorless. Did I get a bad night for the chef? I don't know but I won't be trying this place again, super disappointing.", "rating": 1, "date": "2018-10-12"}, {"excerpts": ["The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! ", "Don't miss out on this divine experience."], "author": "Maria B.", "review": "Delicious EVERY time we visit! The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! Don't miss out on this divine experience.", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["Bhindi masala is delicious. "], "author": "Kyle T.", "review": "Bhindi masala is delicious. I ordered Om a few times simply for their okra.\n\nMeat dishes are a little small. Medium vindaloo is good n spicy. Medium Tikka masala is a creamy pale orange color and not spicy. I prefer a little deeper orange color and more spice.", "rating": 4, "date": "2017-04-24"}, {"excerpts": ["Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. ", "We order everything extra spicy, but be warned, they take you very seriously on that. ", "Incredible flavor! \n", "Highly recommend sitting in the back room which has great murals of Indian scenery ", "and there's always both modern and classic Bollywood videos playing. ", "Can't wait for our next night out at Om:-)"], "author": "Mariel H.", "review": "My fiancée and I absolutely love this place! AJ is a great host and makes you feel at home. Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. We order everything extra spicy, but be warned, they take you very seriously on that. Incredible flavor! \nHighly recommend sitting in the back room which has great murals of Indian scenery and there's always both modern and classic Bollywood videos playing. Can't wait for our next night out at Om:-)", "rating": 5, "date": "2017-01-27"}, {"excerpts": ["Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. ", "Also missing that nice tikka tangy kick.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "chana palak": [], "paneer korma": [{"excerpts": ["I've enjoyed the vegetarian saag paneer, chana masala, aloo gobi & paneer korma. ", "Naan is also nice & thin and has the right amount of char on it. ", "Best Indian delivery I've had in SF!"], "author": "Marybeth S.", "review": "Excellent delivery option in the Haight & Cole Valley! The food is always fresh and delivery from Eat24 is fast. Seems like they really care about their food. I've enjoyed the vegetarian saag paneer, chana masala, aloo gobi & paneer korma. Naan is also nice & thin and has the right amount of char on it. Best Indian delivery I've had in SF!", "rating": 5, "date": "2017-05-29"}], "mushroom matar": [{"excerpts": ["Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. ", "Also missing that nice tikka tangy kick.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "aloo baingan": [], "daal tadka": [], "paneer tika masala": [], "daal saag": [], "shahi paneer": [], "kadai panner": [], "spinach kofta": [], "karahi paneer": [], "vegetable makhani": [], "palak alu methi": [], "chicken achari": [{"excerpts": ["I ordered chicken 65 , saag paneer,chicken tikka masala and chicken achari. ", "Everything so delicious. ", "I never had that flavor of tikka masala anywhere in Bay Area and samosa was cooked perfectly and crispy.l'll come back again."], "author": "Krishna K.", "review": "Om Indian cusian has best flavor of Indian food.  They have good collections of local draft beers too. I ordered chicken 65 , saag paneer,chicken tikka masala and chicken achari. Everything so delicious. I never had that flavor of tikka masala anywhere in Bay Area and samosa was cooked perfectly and crispy.l'll come back again.", "rating": 5, "date": "2016-07-27"}], "chicken tikka kebab": [{"excerpts": ["Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. ", "Also missing that nice tikka tangy kick.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}, {"excerpts": ["I ordered  tikka masala, garlic naan and chicken tikka kebab ", "it was so fast and very yummy...  ", "Naan was like a foot long, tikka kebab was ", "well cooked and chicken tikka masala is the best so far. ", "I would definitely recommend and visit again to this fancy restaurant in upper haight"], "author": "Anil P.", "review": "Today I visited this restaurant and I got a great response from the restaurant people.... The interior was nicely decorated. I was welcomed with free papadum. The sauce came with papadum had amazing flavor. I ordered  tikka masala, garlic naan and chicken tikka kebab it was so fast and very yummy...  Naan was like a foot long, tikka kebab was well cooked and chicken tikka masala is the best so far. I would definitely recommend and visit again to this fancy restaurant in upper haight", "rating": 5, "date": "2016-08-15"}], "boti kebab": [], "tandoori salmon": [{"excerpts": ["Even more recently, I went with my family; Arun made a special soup for my mother-in-law who likes mild food, and one of the standout dishes was the tandoori salmon.\n\n"], "author": "Kai M.", "review": "Om Restaurant is where the trajectory of my favorite Indian chef has landed.  Arun Kumar Dangi was at Clay Oven when my wife and I first met him.  He is an amazing, energetic, and very positive human being, which you see reflected in the esprit de corps of the restaurants he has run.  More recently he was at Tara Indian on Market Street, and vastly improved that location.\n\nSo now I go to see him at Om.  To me it's a combination of really friendly people, super delicious Nepali-influenced Indian cuisine, and a comfortable, charming eating environment.\n\nI have probably tried most of the items on the menu, but I'll just comment on a few.  Recently I had the chicken tikka masala, behgan bharta, and saag paneer.  The first of these was creamy, with a delicate flavor.  The behgan bharta had a smoky flavor, with onions delicately cooked, and was actually somewhat spicy.  (I prefer my food quite spicy, but didn't make any special requests this time.) The saag paneer was lemony, and I really liked the chunks of cheese.\n\nEven more recently, I went with my family; Arun made a special soup for my mother-in-law who likes mild food, and one of the standout dishes was the tandoori salmon.\n\nAnd I have to comment on the pakoras.  I don't think I've had them as good at any Indian restaurant I've ever been too.  Some kind of combination of spices that I can't possibly guess at.\n\nThe place is cute and rustic inside, with a beautiful hand-embroidered piece in the back room showing deities of the Bhagavad Gita.  \n\nI really like Om.  It's a place with a lot of heart and great food, I highly recommend it.", "rating": 5, "date": "2016-09-22"}], "tandoori shrimp": [], "paneer tikka kebab": [], "tandoori platter": [], "lamb kabob": [], "chicken malai kabob": [], "tandoori vegetables": [], "tandoori mixed grilled": [{"excerpts": ["Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before", ",food was on door in 45 minutes, I couldn't stop licking my plate ! ", "Their food is awesome ! ", "Highly recommended to you people ! ", "Thank you Om Indian !"], "author": "Bhuwan A.", "review": "OM Indian is one of my best restaurant in San Francisco ! Ordered Chicken MoMo, Tandoori Mixed Grilled,Garlic Naan the night before,food was on door in 45 minutes, I couldn't stop licking my plate ! Their food is awesome ! Highly recommended to you people ! Thank you Om Indian !", "rating": 5, "date": "2017-02-09"}], "butter chicken masala": [{"excerpts": ["I always order butter chicken masala , tandoori chiken wings as appetizer ", "nd ", "garlic nan ", "its always comes as same taste nd sam spicy level ", "..i love it.."], "author": "Dpes R.", "review": "This restuarant is one of my favorite indian resturant  in san Francisco California.  I always order butter chicken masala , tandoori chiken wings as appetizer nd garlic nan its always comes as same taste nd sam spicy level ..i love it..", "rating": 5, "date": "2018-10-05"}, {"excerpts": ["Butter chicken masala and aloo golbi are my always to go. ", "Wherever I go that has Indian food, these are my must eats. "], "author": "Julie B C.", "review": "Came here once a week for the past two weeks.\n\nPrior to finding this place, I was a huge fan of another location on Irving. I don't want to put them down as I have gone there for the past 3 years. What I'm saying is I would be there once a week every week. Yes! I am obsess over Indian food. I can never have enough. I even tried cooking it myself but it never comes out the same and plus, it makes my house smell for days =(\n\nAnyways, I came here with a few of my friends and I was amaze. I fell in love instantly. Their sauce to their food is on point. \n\nButter chicken masala and aloo golbi are my always to go. Wherever I go that has Indian food, these are my must eats. Don't forget Garlic naan! \n\nOverall, I would highly recommend this place. Parking isn't too bad. Just keep your eyes on the road and even on the side. There will be some folks that love to spring themselves out onto the road when it is not a crosswalk. You'll see what I mean when you go. \n\nWill be back again since I can never have enough. \n\n*Warning - it gets pretty chilly in this restaurant so be prepared. Nice thing is they do have personal heaters so feel free to ask and they will turn it on for you =)", "rating": 5, "date": "2016-12-07"}, {"excerpts": ["The butter chicken masala was terrific. ", "So was the saag paneer. ", "I ordered from Eat24 and the food arrived fresh and with a smile."], "author": "Morris R.", "review": "It is surprisingly hard to find great Indian food. The butter chicken masala was terrific. So was the saag paneer. I ordered from Eat24 and the food arrived fresh and with a smile.", "rating": 5, "date": "2016-10-10"}, {"excerpts": ["- Butter Chicken Masala, $12.95 - fine.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}, {"excerpts": ["Excellent garlic naan, saag paneer, butter chicken masala, lamb chops. ", "Came hot and we specified one dish medium hot and one mild ", "and that's exactly how they came!"], "author": "Jane M.", "review": "Just one experience, but terrific delivered food. Oh I hope they stay this good! Excellent garlic naan, saag paneer, butter chicken masala, lamb chops. Came hot and we specified one dish medium hot and one mild and that's exactly how they came!", "rating": 5, "date": "2016-08-05"}], "chicken saag": [{"excerpts": ["Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\n", "The chicken naan was quite moist. ", "It had been wrapped in foil, to keep it warm ", "I'm sure, but what ended up happening was it was just soggy by the time it arrived. ", "The chicken naan was quite moist. ", "It had been wrapped in foil, to keep it warm ", "I'm sure, but what ended up happening was it was just soggy by the time it arrived. ", "Also could not pick up any trace of chicken in there. ", "The one redeeming dish was the chicken saag. ", "It was fantastic. ", "Good enough to turn a 1 star review into a 3 star. ", "The one redeeming dish was the chicken saag. ", "It was fantastic. ", "Good enough to turn a 1 star review into a 3 star. ", "The chicken was tender and juicy and the saag was perfectly flavored. ", "Just the right amount of spice. "], "author": "Nick D.", "review": "I ordered takeout on Eat 24 from this restaurant last week. Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\nThe chicken naan was quite moist. It had been wrapped in foil, to keep it warm I'm sure, but what ended up happening was it was just soggy by the time it arrived. Also could not pick up any trace of chicken in there. It was rather bland naan, which says a lot considering naan is bland to begin with. \n\nThe vegetable pakora was also disappointing. There was absolutely no crunch to it. The flavor was also bland on these. There were 2 dipping sauces, neither of which did the trick as far as adding good flavor goes. \n\nThe one redeeming dish was the chicken saag. It was fantastic. Good enough to turn a 1 star review into a 3 star. The chicken was tender and juicy and the saag was perfectly flavored. Just the right amount of spice. While not the most visually appealing dish, I would certainly order this again. \n\nThe delivery itself showed up about 35 minutes late. Luckily I wasn't too hungry when I ordered but it was very disappointing that it took so long.", "rating": 3, "date": "2017-04-04"}], "chicken mushroom": [], "coconut chicken curry": [], "daal chicken": [], "chicken chili": [{"excerpts": ["I also love their chicken chili, and their coconut chicken. "], "author": "Chris S.", "review": "I've ordered delivery from this place a few times, I have been really impressed. \n\nMy order's always include at least one chicken tikka masala, as that's one of my favorite things that they make. It's bursting with flavor, and the sauce is a little bit different than some other places - maybe heavier on the vegetable content actually - I'm really fond of it. They're also nice and include plenty of sauce for your rice or even to save and cook some yourself. \n\n I also love their chicken chili, and their coconut chicken. Both are also a little different than other places but still delicious. \n\nMy biggest complaint is the price/size. Compared to some other Indian places, the price is a little larger and the size is a little smaller. Still, I'll definitely be back! Well, figuratively - I guess they'll be back at my place! Delivery is just way convenient, and I have no complaints about the flavor etc.", "rating": 4, "date": "2018-06-07"}], "kashmiri chicken": [{"excerpts": ["My top list of the favorites was Kashmiri Chicken and Lamb Shank."], "author": "Prudhvi Chowdary N.", "review": "This is probably the best Indian Cuisine in the San Francisco area. Everything I had in this restaurant was awesome. I couldn't specify the particular item to be the best . Can try anything. My top list of the favorites was Kashmiri Chicken and Lamb Shank.", "rating": 5, "date": "2017-04-01"}], "chicken bharta": [{"excerpts": ["We ate a chicken bharta ( boneless breast chicken with eggplant ) and a chicken vindaloo(chicken with ginger onion and tomato sauce). ", "Price was also ok for 2, the bill was $59 including 2 bears Stella on the tap, 1 San pellegrino, 2 naans and the tip.\n", "So I highly recommend this place."], "author": "Jacques H.", "review": "What a wonderful surprise !!!!\nI have been traveling to India for 30 years and the taste of the food served today at Om Indian cuisine was as good as any food I ever ate in India. Waiters were very friendly and service was very fast too.\nWe ate a chicken bharta ( boneless breast chicken with eggplant ) and a chicken vindaloo(chicken with ginger onion and tomato sauce). Price was also ok for 2, the bill was $59 including 2 bears Stella on the tap, 1 San pellegrino, 2 naans and the tip.\nSo I highly recommend this place.", "rating": 5, "date": "2018-09-16"}, {"excerpts": ["I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. ", "One of the few places I know that does Malai Kofta so deliciously.  ", "They filled up every container. ", "Really enjoyed the meal. ", "Will definitely order again."], "author": "minnie l.", "review": "Flavorful and they mean it when they say Spicy!  I ordered for delivery Aloo Gobi, Malai Kofta, Chicken Bharta and Roti. One of the few places I know that does Malai Kofta so deliciously.  They filled up every container. Really enjoyed the meal. Will definitely order again.", "rating": 5, "date": "2017-09-26"}], "kadai chicken": [], "chicken palak": [], "chicken do piaza": [], "lamb curry": [{"excerpts": ["Lamb curry is so good. ", "Delivery is fast and correct.  ", "Highly recommend to folks libing in Lone Mountian, NOPA, or Outer Richmond."], "author": "Rayannah S.", "review": "My new favorite indian takeout/ delivery spot.  Lamb curry is so good. Delivery is fast and correct.  Highly recommend to folks libing in Lone Mountian, NOPA, or Outer Richmond.", "rating": 5, "date": "2018-08-13"}, {"excerpts": ["Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. ", "Spend some time.\n", "Helpful and friendly service, average pricing, worth it.\n      ", "Overall I recommend this place for new eaters to give a try. ", "Thanks Om."], "author": "Feroz C.", "review": "Walked here with friend for dinner on weekend. Interior decoration of dining hall was so attractive and cozy. Beer and wine bar next to entrance. Welcoming staffs. Felt good. We had:-\n       Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. Spend some time.\nHelpful and friendly service, average pricing, worth it.\n      Overall I recommend this place for new eaters to give a try. Thanks Om.", "rating": 5, "date": "2017-05-22"}, {"excerpts": ["I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. ", "Beware asking for the dishes spicy, it'll test your tolerance (in a good way). ", "The naan was also excellent... "], "author": "Cynthia S.", "review": "Best Indian food I've had in San Francisco! It was so flavorful and tasted high quality. I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. Beware asking for the dishes spicy, it'll test your tolerance (in a good way). The naan was also excellent... I love me some naan. \n\nThe only thing that I believe has room for improvement is the restaurant decor and ambiance. It is a little dim and lacks personality/charm. That being said, the food is way important and I'll be back many times.", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["Chiken tika masala, jeera aloo and  lamb curry ", "a has amazing flavors  and well cooked.\n", "The cheese Naan is well done warm and nice flavor.\n", "Come again. ", "I recommend 100%"], "author": "Victor O.", "review": "The food is great and tasting very good well done.\nService is great, friendly.\nChiken tika masala, jeera aloo and  lamb curry a has amazing flavors  and well cooked.\nThe cheese Naan is well done warm and nice flavor.\nCome again. I recommend 100%", "rating": 5, "date": "2016-08-16"}, {"excerpts": ["We had a few of the old standbys - lamb curry, saag paneer, papadam. ", "All of it fresh and tasty! ", "Spicy but not too salty. "], "author": "Japji K.", "review": "Longtime Haight resident... And for 35 years I've wanted a good Indian food restaurant nearby. So many failed attempts later, we've finally got good (great!) Indian food.\n\nWe had a few of the old standbys - lamb curry, saag paneer, papadam. All of it fresh and tasty! Spicy but not too salty. Service was friendly and attentive.\n\nThe back seating area (in previous failed restaurants) had been dark, dank, and uninviting. The owners have done a nice job of making this area much more pleasant with custom murals and nice decor.", "rating": 5, "date": "2016-09-17"}, {"excerpts": ["We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. ", "Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. ", "I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. ", "Naan was big and very freshly made.\n", "To make our experience even better we were offered complimentary desserts.\n", "I would definitely go there again and this has become my new favorite place to go."], "author": "Sub N.", "review": "This new neighborhood gem is fabulous.\nWe were party of five for dinner and we were greeted as soon as we entered by the owner himself. It has a very impressive ambiance with beautiful hand painting at the dinning hall walls and i must say the whole place is clean.The service was fast and very friendly. \nThe owner answered any question we had about the food. We order chicken tikka masala, lamb curry, thali (for 2), tandoori chicken and matar paneer with garlic naans and rice. Everything was delicious and good size in terms of portion, tandoori chicken was juicy and well marinated. I ordered my Chicken tikka mild and it came out mild without sacrificing the taste. Naan was big and very freshly made.\nTo make our experience even better we were offered complimentary desserts.\nI would definitely go there again and this has become my new favorite place to go.", "rating": 5, "date": "2016-08-22"}, {"excerpts": ["Lamb Curry is delicious. ", "I love the curry itself. ", "The lamb is tender, but a little gamy tasting. ", "Garlic Naan is a must. ", "They have the best naan. "], "author": "Gabrielle C.", "review": "I love Indian food so much. I think there was a stint where I would order delivery from Om, once a week. Oops. Somosas are delicious and huge. Saag Paneer is okay. It had an interesting aftertaste and I have only ordered it once. Chicken Tikka Masala I usually always order. It is so creamy and I love getting it spicy. It's very spicy, but I'm into that. Definitely, terrible for you with how creamy it is. Lamb Curry is delicious. I love the curry itself. The lamb is tender, but a little gamy tasting. Garlic Naan is a must. They have the best naan. I also like the Serrano chili naan, but just prefer garlic. Rice is cooked perfectly.", "rating": 5, "date": "2017-03-22"}], "lamb rogan josh": [{"excerpts": ["We got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. ", "The chicken korma and the lamb rogan josh were also really tasty. ", "The chicken korma and the lamb rogan josh were also really tasty. ", "Rice was good, the only thing that wasn't great was the butter naan. ", "About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. "], "author": "Ely L.", "review": "Ordered delivery from here via the Yelp Eat24 app on a Tuesday night. Super fast delivery, arrived early and piping hot.\n\nWe got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. More than enough food for two people.\n\nSamosas were delicious. The chicken korma and the lamb rogan josh were also really tasty. Rice was good, the only thing that wasn't great was the butter naan. About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. Next time maybe I'll try the paratha or roti or a different naan.\n\nOverall a delicious, fast, and convenient delivery diner!", "rating": 4, "date": "2017-02-28"}, {"excerpts": ["We also tried the Lamb Rogan Josh. ", "Not sure about the story behind the name of this dish, but it certainly satisfied my craving for lamb, along with a little heat(medium spicy). "], "author": "Jeff K.", "review": "Stopped in here on a Saturday while out and about, and was pleasantly surprised to find a great Indian restaurant on Haight Street! We were greeted immediately by the owner and promptly seated. The dining room was cozy and tastefully decorated, despite the fact they had only been open for a couple days. There's also a larger dining/banquet room in the back. \n\nFirst we had some Papadum wafer appetizers, served with 3 dipping sauces.\n\nUpon the owner's suggestion, I ordered Chicken Tikka Masala, which he insisted was different/better than what is served elsewhere. It didn't disappoint. Sauce was a creamy coconut curry, and perfectly seasoned. Chicken was moist and tender(so simple, but so important!). We also tried the Lamb Rogan Josh. Not sure about the story behind the name of this dish, but it certainly satisfied my craving for lamb, along with a little heat(medium spicy). Loved the spice combination and garlic in the sauce and the lamb was, yet again, very tender.\n\nWe ordered basmati rice and fresh naan with the meal which, in my opinion, is a must.\n\nAfter speaking with the owner, I learned he was actually from Nepal and legit, explaining the presence of some of the Himalayan dishes on the menu.\n\nHonestly, my only regret is that I didn't try more stuff here. I'll need to go back and delve deeper in to the menu, which I'm looking forward to!", "rating": 5, "date": "2016-07-24"}], "kadai ghost": [], "daal ghost": [], "lamb vindaloo": [{"excerpts": ["Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. ", "We order everything extra spicy, but be warned, they take you very seriously on that. ", "Incredible flavor! \n", "Highly recommend sitting in the back room which has great murals of Indian scenery ", "and there's always both modern and classic Bollywood videos playing. ", "Can't wait for our next night out at Om:-)"], "author": "Mariel H.", "review": "My fiancée and I absolutely love this place! AJ is a great host and makes you feel at home. Our favorite dishes are the bhindi masala (okra), tandori chicken, lamb vindaloo and garlic naan. We order everything extra spicy, but be warned, they take you very seriously on that. Incredible flavor! \nHighly recommend sitting in the back room which has great murals of Indian scenery and there's always both modern and classic Bollywood videos playing. Can't wait for our next night out at Om:-)", "rating": 5, "date": "2017-01-27"}, {"excerpts": ["lamb Vindaloo: biryani."], "author": "Brian C.", "review": "Three delivery orders and we've tried at least twelve dishes. Everything has been good. We plan to order again when the craving strikes. Especially recommended are the Momos: lamb Vindaloo: biryani.", "rating": 4, "date": "2017-07-15"}, {"excerpts": ["The lamb vindaloo (mild, and truly mild) was great and the meat was excellent! ", "I can be squeamish when it comes to subpar meat and nothing about either dish was anything but great. ", "No toughness or pieces you have to chew on for 5 minutes. ", "I've taken back dishes, not ordered again, or not gone back to other Indian places due to their lamb.  ", "Everything else was good as well. "], "author": "Chris S.", "review": "I went a bit overboard and ordered more than I needed for one via Eat24.  It was ready in only 15 mins and I was soon back at home enjoying all of this delicious Indian food. It was hot and fresh.\n\nThe overall appearance was great and I loved that the meat dishes weren't swimming in oil. I had chicken tikka masala (medium) and it was delicious and not noticeably spicy. The lamb vindaloo (mild, and truly mild) was great and the meat was excellent! I can be squeamish when it comes to subpar meat and nothing about either dish was anything but great. No toughness or pieces you have to chew on for 5 minutes. I've taken back dishes, not ordered again, or not gone back to other Indian places due to their lamb.  Everything else was good as well. (samosas, rice, naan)\n\nIt's not cheap but the food quality doesn't disappoint.\n\nThe only non-positive observation is that when you walk into the restaurant, you immediately notice 2 large \"watch your step\" construction looking signs slapped onto the back of the front 2 bar stools. Maybe they are temporary but I didn't get that impression because the floor there is raised.  I'd suggest putting more discreet yellow caution tape along the ridge of the raised step or perhaps another solution. Otherwise it just looks a bit too tacky.\n\nThanks for opening this in the neighborhood and good luck to you guys!", "rating": 4, "date": "2016-08-20"}, {"excerpts": ["I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. ", "Potatoes and cauliflower cooked perfectly. ", "Tender but with a tooth... not mushy. "], "author": "Michael T.", "review": "This has become my favorite Indian Restaurant! After a resent neighborhood move, I was thrilled to discover this gem of a place in the Haight. The food is fresh, served hot ( no buffet ) by a charming and thorough wait staff. I personally like spicy hot, but the heat of the dishes is negotiable and the servers are especially helpful in recommending heat as well as menu items. Papadum, a wafer thin cracker is brought to the table right after you order with 3 sauces, a spicy, a sweet and a mint chutney. Their Daal soup is some of the best I have had. Thick and temperature hot with bits of lentils and goodness. I love the Chicken and Lamb Vindaloo and my vegetable favorite is the Aloo Gobi. Potatoes and cauliflower cooked perfectly. Tender but with a tooth... not mushy. A lovely cup of Masala Chai is a great finish especially on a cool foggy San Francisco afternoon. A great restaurant that I find myself in weekly. Give it a try...,", "rating": 5, "date": "2017-08-18"}], "coconut lamb curry": [], "lamb shank": [{"excerpts": ["Lamb shank: ", "meat is falling off the bones\n3. "], "author": "Tata X.", "review": "My go to spot for Indian take out. They pay attention to details and are very heavy handed on spices, which if you are going for Indian food, that's what you should expect.\n\nWe love \n1. Chicken tandoori: the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. You simply have to try.\n2. Lamb shank: meat is falling off the bones\n3. Chicken tikka masala: average, I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. Aloo gobi and baigan bharta: great vegetarian dishes.\n6. Garlic naan: fluffy, chewy, and moist. Right on guys.\nWe do not like the pudina paratha, which is a wheat bread. It is hard and taste like cardboard\n\nTip:\nTheir spice level is not consistent. When in doubt, round down. I order their spiciest level a couple times. Once, it was so spicy that even after adding 200% more bland vegetable and rice in it, it was still too spicy, and I usually eat at the spiciest level at asian cuisines.", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["The lamb shank was tasty but a bit tough and their version of kabuli naan ", "ONLY had pink coconut in it, which was falsely advertised as having raisins, cherries, cashews, and coconut."], "author": "Anna D.", "review": "The lamb shank was tasty but a bit tough and their version of kabuli naan ONLY had pink coconut in it, which was falsely advertised as having raisins, cherries, cashews, and coconut.", "rating": 3, "date": "2017-07-15"}, {"excerpts": ["My top list of the favorites was Kashmiri Chicken and Lamb Shank."], "author": "Prudhvi Chowdary N.", "review": "This is probably the best Indian Cuisine in the San Francisco area. Everything I had in this restaurant was awesome. I couldn't specify the particular item to be the best . Can try anything. My top list of the favorites was Kashmiri Chicken and Lamb Shank.", "rating": 5, "date": "2017-04-01"}, {"excerpts": ["We ordered aloo gobi, coconut curry, nann, lamb saag that was a lamb shank. ", "Great place for vegetarians."], "author": "Robert T.", "review": "We found parking on Haight Street and started trolling for a restaurant. We walked past a newer looking Indian restaurant and after reviewing the few Yelp comments we decided to try it. Good move! This place is only 8 days old and has excellent service, fresh food and beautiful interiors with painted murals depicting Indian life and landscapes.\n\nWe ordered aloo gobi, coconut curry, nann, lamb saag that was a lamb shank. Great place for vegetarians.", "rating": 5, "date": "2016-08-12"}], "lamb do piaza": [], "lamb palak": [], "salmon tikka masala": [{"excerpts": ["Ordered delivery tonight for first time- samosas, salmon tikka masala, plain basmati, butter naan and 3 chais. ", "The STM was delicious! ", "It was the star of the delivery. ", "The moist salmon just came out fresh from their tandoori oven and the sauce had a great balance of cream and tomato sauce. ", "The samosas had good flavor but the consistency of the filling was too mushy for me when I'm used to having them with a more chunky one. ", "Naan was okay", ", more doughy than I wanted ", "(I like it crusty). ", "The chais were very good and sealed carefully. ", "Friendly delivery came before promised time. ", "I would order from them again. ", "I'm definitely looking forward to dining in when I'm in the neighborhood!"], "author": "Mona C.", "review": "Ordered delivery tonight for first time- samosas, salmon tikka masala, plain basmati, butter naan and 3 chais. The STM was delicious! It was the star of the delivery. The moist salmon just came out fresh from their tandoori oven and the sauce had a great balance of cream and tomato sauce. The samosas had good flavor but the consistency of the filling was too mushy for me when I'm used to having them with a more chunky one. Naan was okay, more doughy than I wanted (I like it crusty). The chais were very good and sealed carefully. Friendly delivery came before promised time. I would order from them again. I'm definitely looking forward to dining in when I'm in the neighborhood!", "rating": 4, "date": "2018-05-04"}], "salmon vindaloo": [], "salmon saag curry": [], "shrimp tikka masala": [{"excerpts": ["We ordered the Shrimp Tikka Masala, Aloo Gobi and Serrano pepper naan. ", "All delicious. ", "I have to also shout out their surprisingly good chai. "], "author": "Cynthia G.", "review": "I went here this past Sunday to have dinner with a friend. We ordered the Shrimp Tikka Masala, Aloo Gobi and Serrano pepper naan. All delicious. I have to also shout out their surprisingly good chai. Normally when I order chai from Indian restaurants it's okay, nothing to brag about, just a brown compulsion of mine to always have chai at the table.\n\nI tried the Serrano pepper naan. It definitely adds a little kick to the naan. \n\nI want to come back and try their Indian pizza, if it's as good as the spots I have been to in Berkeley I am sold on this being my new Indian spot in the city. \n\nThe prices are super reasonable too. \n\nHighly recommend.", "rating": 4, "date": "2017-11-14"}], "shrimp vindaloo": [], "shrimp saag curry": [], "shrimp korma": [], "mixed seafood curry": [], "goan fish curry": [], "shrimp palak": [], "shrimp masala": [], "tandoori roti": [{"excerpts": ["We ate paneer curry and a mix vegetable curry along with Garlic Naan and Tandoori Roti. \n\n"], "author": "Sanjay R.", "review": "We ate paneer curry and a mix vegetable curry along with Garlic Naan and Tandoori Roti. \n\n1)The curry portions were less and the 2 naan and 2 roti were pretty big.\n\n2) I don't know how it was cooked but I think we have a bad stomach because of it.", "rating": 1, "date": "2018-03-10"}, {"excerpts": ["I ended up keeping it simple and ordering butter chicken (spicy), samosas, and 2 servings of tandoori roti. \n\n", "The butter chicken was definitely pretty spicy for me. ", "Wish there was a little more chicken in the serving, but perhaps that was because it was delivery? ", "It looked almost as though there were red pepper flakes in it. ", "BUT it lasted me about 3 days! ", "The tandoori roti was 1 roti, but cut into 2 pieces. ", "It had butter on it, and I almost wish it didn't. "], "author": "Meha M.", "review": "I ordered delivery here on a Friday night. The delivery took just as long as was estimated by the app I was using.\n\nI ended up keeping it simple and ordering butter chicken (spicy), samosas, and 2 servings of tandoori roti. \n\nThe butter chicken was definitely pretty spicy for me. Wish there was a little more chicken in the serving, but perhaps that was because it was delivery? It looked almost as though there were red pepper flakes in it. BUT it lasted me about 3 days! So that was great.\n\n1 serving of samosas comes with 2, so luckily I had leftovers and got to warm one up the next day. They were really good, the sauces it came with were also delicious.\n\nThe tandoori roti was 1 roti, but cut into 2 pieces. It had butter on it, and I almost wish it didn't. That's definitely just a personal preference, and it was delicious regardless.\n\nOverall, really really enjoyed the food, especially considering I got it for delivery! Definitely would go back to try other items on the menu.", "rating": 4, "date": "2016-10-15"}, {"excerpts": ["- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "laccha paratha": [{"excerpts": ["- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n"], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "butter naan": [{"excerpts": ["The butter naan was big and long! ", "I thought naans were usually a round circle, but this was like a very long ellipse. ", "Nevertheless, it was soft and good bread. ", "The food portion was pretty big. ", "My girlfriend and I were not able to finish the 2 orders with 2 naans. ", "I would order from this restaurant again!"], "author": "Wesley S.", "review": "Ordered delivery for a few items, and they arrived pretty quickly. I ordered the Chicken Tikka Masala and Lamb Saag. Both were very good with lots of chicken and lamb. The butter naan was big and long! I thought naans were usually a round circle, but this was like a very long ellipse. Nevertheless, it was soft and good bread. The food portion was pretty big. My girlfriend and I were not able to finish the 2 orders with 2 naans. I would order from this restaurant again!", "rating": 5, "date": "2018-02-07"}, {"excerpts": ["*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\n"], "author": "Elena N.", "review": "I was craving Indian food, but the roommate wanted something else. We decided to order delivery from two different places for lunch. (Yes, we are fat a$$es!) I placed an order through UberEATS on Monday, January 16th at 1:01pm. It arrived at 1:53pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour, and tamarind chutney ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\nI love my Indian food spicy, so I was happy they served serrano naan. It added a great kick to the curries. I adore thick curries, but the tikka masala was actually a little too thick for me. I did love the spice level and flavors though. We ended up adding the vindaloo sauce to the tikka masala to thin it out a bit. The samosas were great! Soft on the inside and crispy on the outside. I didn't really like the mint chutney though. It wasn't creamy and minty enough. I love dumplings so I decided to get the momos. I think they come with a dipping sauce as I got something I thought was the hot and sour sauce for the samosas. It tasted more like a chutney I've had in the past with momos. The roommate enjoyed the dishes he ordered, the vindaloo and the assorted naans.\n\nIndian is one of my comfort foods, so I'm glad I discovered another great option for delivery.", "rating": 4, "date": "2017-01-29"}, {"excerpts": ["Ordered delivery tonight for first time- samosas, salmon tikka masala, plain basmati, butter naan and 3 chais. ", "The STM was delicious! ", "It was the star of the delivery. ", "The moist salmon just came out fresh from their tandoori oven and the sauce had a great balance of cream and tomato sauce. ", "The samosas had good flavor but the consistency of the filling was too mushy for me when I'm used to having them with a more chunky one. ", "Naan was okay", ", more doughy than I wanted ", "(I like it crusty). ", "The chais were very good and sealed carefully. ", "Friendly delivery came before promised time. ", "I would order from them again. ", "I'm definitely looking forward to dining in when I'm in the neighborhood!"], "author": "Mona C.", "review": "Ordered delivery tonight for first time- samosas, salmon tikka masala, plain basmati, butter naan and 3 chais. The STM was delicious! It was the star of the delivery. The moist salmon just came out fresh from their tandoori oven and the sauce had a great balance of cream and tomato sauce. The samosas had good flavor but the consistency of the filling was too mushy for me when I'm used to having them with a more chunky one. Naan was okay, more doughy than I wanted (I like it crusty). The chais were very good and sealed carefully. Friendly delivery came before promised time. I would order from them again. I'm definitely looking forward to dining in when I'm in the neighborhood!", "rating": 4, "date": "2018-05-04"}, {"excerpts": ["I get the Aloo Palak, butter naan, and add a new appetizer. ", "It's so great to find a place you can trust to provide great service and delicious food! \n", "Thank y'all!!!"], "author": "Melorra G.", "review": "The food is ABSOLUTELY AMAZING! I order delivery and the comes fresh, hot, and delicious every TIME! \nI get the Aloo Palak, butter naan, and add a new appetizer. It's so great to find a place you can trust to provide great service and delicious food! \nThank y'all!!!", "rating": 5, "date": "2017-03-31"}, {"excerpts": ["We got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. ", "The chicken korma and the lamb rogan josh were also really tasty. ", "The chicken korma and the lamb rogan josh were also really tasty. ", "Rice was good, the only thing that wasn't great was the butter naan. ", "About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. "], "author": "Ely L.", "review": "Ordered delivery from here via the Yelp Eat24 app on a Tuesday night. Super fast delivery, arrived early and piping hot.\n\nWe got an order of samosas (comes with two samosas), chicken korma, lamb rogan josh, basmati rice, and butter naan. More than enough food for two people.\n\nSamosas were delicious. The chicken korma and the lamb rogan josh were also really tasty. Rice was good, the only thing that wasn't great was the butter naan. About half of each large piece was somewhat soft and fluffy but the other half was too dry and chewy for my taste. Next time maybe I'll try the paratha or roti or a different naan.\n\nOverall a delicious, fast, and convenient delivery diner!", "rating": 4, "date": "2017-02-28"}, {"excerpts": ["We ordered chicken tikka, spinach paneer, butter naan, rice, and raita. ", "So delish. ", "Our new go to spot for pickup!"], "author": "Jillian P.", "review": "We ordered chicken tikka, spinach paneer, butter naan, rice, and raita. So delish. Our new go to spot for pickup!", "rating": 5, "date": "2017-01-25"}], "serrano chili naan": [{"excerpts": ["*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n"], "author": "Elena N.", "review": "I was craving Indian food, but the roommate wanted something else. We decided to order delivery from two different places for lunch. (Yes, we are fat a$$es!) I placed an order through UberEATS on Monday, January 16th at 1:01pm. It arrived at 1:53pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour, and tamarind chutney ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\nI love my Indian food spicy, so I was happy they served serrano naan. It added a great kick to the curries. I adore thick curries, but the tikka masala was actually a little too thick for me. I did love the spice level and flavors though. We ended up adding the vindaloo sauce to the tikka masala to thin it out a bit. The samosas were great! Soft on the inside and crispy on the outside. I didn't really like the mint chutney though. It wasn't creamy and minty enough. I love dumplings so I decided to get the momos. I think they come with a dipping sauce as I got something I thought was the hot and sour sauce for the samosas. It tasted more like a chutney I've had in the past with momos. The roommate enjoyed the dishes he ordered, the vindaloo and the assorted naans.\n\nIndian is one of my comfort foods, so I'm glad I discovered another great option for delivery.", "rating": 4, "date": "2017-01-29"}, {"excerpts": ["I also like the Serrano chili naan, but just prefer garlic. ", "Rice is cooked perfectly."], "author": "Gabrielle C.", "review": "I love Indian food so much. I think there was a stint where I would order delivery from Om, once a week. Oops. Somosas are delicious and huge. Saag Paneer is okay. It had an interesting aftertaste and I have only ordered it once. Chicken Tikka Masala I usually always order. It is so creamy and I love getting it spicy. It's very spicy, but I'm into that. Definitely, terrible for you with how creamy it is. Lamb Curry is delicious. I love the curry itself. The lamb is tender, but a little gamy tasting. Garlic Naan is a must. They have the best naan. I also like the Serrano chili naan, but just prefer garlic. Rice is cooked perfectly.", "rating": 5, "date": "2017-03-22"}], "paneer naan": [{"excerpts": ["Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. ", "INCREDIBLE. ", "Best Indian we have ever had."], "author": "Chelsey T.", "review": "Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. INCREDIBLE. Best Indian we have ever had.", "rating": 5, "date": "2017-07-30"}], "spinach naan": [{"excerpts": ["I highly recommend the jeera aloo and spinach naan. ", "I'm vegan, and they had plenty of options for me. ", "The reason why I docked them a star is because I waited about 20-25 minutes for my food. ", "However, it was well worth the wait!"], "author": "Julia A.", "review": "This is the best Indian food I've ever had. I highly recommend the jeera aloo and spinach naan. I'm vegan, and they had plenty of options for me. The reason why I docked them a star is because I waited about 20-25 minutes for my food. However, it was well worth the wait!", "rating": 4, "date": "2017-10-28"}], "chicken naan": [{"excerpts": ["Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\n", "The chicken naan was quite moist. ", "It had been wrapped in foil, to keep it warm ", "I'm sure, but what ended up happening was it was just soggy by the time it arrived. ", "The chicken naan was quite moist. ", "It had been wrapped in foil, to keep it warm ", "I'm sure, but what ended up happening was it was just soggy by the time it arrived. ", "Also could not pick up any trace of chicken in there. ", "The one redeeming dish was the chicken saag. ", "It was fantastic. ", "Good enough to turn a 1 star review into a 3 star. ", "The one redeeming dish was the chicken saag. ", "It was fantastic. ", "Good enough to turn a 1 star review into a 3 star. ", "The chicken was tender and juicy and the saag was perfectly flavored. ", "Just the right amount of spice. "], "author": "Nick D.", "review": "I ordered takeout on Eat 24 from this restaurant last week. Ordered 3 things: chicken naan, vegetable pakora, and chicken saag. \n\nThe chicken naan was quite moist. It had been wrapped in foil, to keep it warm I'm sure, but what ended up happening was it was just soggy by the time it arrived. Also could not pick up any trace of chicken in there. It was rather bland naan, which says a lot considering naan is bland to begin with. \n\nThe vegetable pakora was also disappointing. There was absolutely no crunch to it. The flavor was also bland on these. There were 2 dipping sauces, neither of which did the trick as far as adding good flavor goes. \n\nThe one redeeming dish was the chicken saag. It was fantastic. Good enough to turn a 1 star review into a 3 star. The chicken was tender and juicy and the saag was perfectly flavored. Just the right amount of spice. While not the most visually appealing dish, I would certainly order this again. \n\nThe delivery itself showed up about 35 minutes late. Luckily I wasn't too hungry when I ordered but it was very disappointing that it took so long.", "rating": 3, "date": "2017-04-04"}], "kabuli naan": [{"excerpts": ["The lamb shank was tasty but a bit tough and their version of kabuli naan ", "ONLY had pink coconut in it, which was falsely advertised as having raisins, cherries, cashews, and coconut."], "author": "Anna D.", "review": "The lamb shank was tasty but a bit tough and their version of kabuli naan ONLY had pink coconut in it, which was falsely advertised as having raisins, cherries, cashews, and coconut.", "rating": 3, "date": "2017-07-15"}], "punjabi paratha": [], "pieces puri": [], "missi roti": [], "onion kulcha": [], "bread basket": [], "chapatti": [], "pudina paratha": [{"excerpts": ["We do not like the pudina paratha, which is a wheat bread. "], "author": "Tata X.", "review": "My go to spot for Indian take out. They pay attention to details and are very heavy handed on spices, which if you are going for Indian food, that's what you should expect.\n\nWe love \n1. Chicken tandoori: the sauce (sweet, sour, spicy, and savory) is so bright and mouthwatering. You simply have to try.\n2. Lamb shank: meat is falling off the bones\n3. Chicken tikka masala: average, I prefer my tikka masala sauce to be chunkier, not as watery, but the flavor is still very good\n4. Saag paneer: they brown the cheese cubes, which brings out the flavor \n5. Aloo gobi and baigan bharta: great vegetarian dishes.\n6. Garlic naan: fluffy, chewy, and moist. Right on guys.\nWe do not like the pudina paratha, which is a wheat bread. It is hard and taste like cardboard\n\nTip:\nTheir spice level is not consistent. When in doubt, round down. I order their spiciest level a couple times. Once, it was so spicy that even after adding 200% more bland vegetable and rice in it, it was still too spicy, and I usually eat at the spiciest level at asian cuisines.", "rating": 5, "date": "2017-07-27"}], "assorted bread": [{"excerpts": ["*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\n"], "author": "Elena N.", "review": "I was craving Indian food, but the roommate wanted something else. We decided to order delivery from two different places for lunch. (Yes, we are fat a$$es!) I placed an order through UberEATS on Monday, January 16th at 1:01pm. It arrived at 1:53pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour, and tamarind chutney ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce ($12.95)\n*Chicken Vindaloo: Boneless cubes of chicken cooked with potatoes, onion, ginger, garlic, and ground spices in a hot and tangy sauce ($11.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n*Assorted Bread: Combination of garlic, onion, and butter naan ($7.95)\n\nI love my Indian food spicy, so I was happy they served serrano naan. It added a great kick to the curries. I adore thick curries, but the tikka masala was actually a little too thick for me. I did love the spice level and flavors though. We ended up adding the vindaloo sauce to the tikka masala to thin it out a bit. The samosas were great! Soft on the inside and crispy on the outside. I didn't really like the mint chutney though. It wasn't creamy and minty enough. I love dumplings so I decided to get the momos. I think they come with a dipping sauce as I got something I thought was the hot and sour sauce for the samosas. It tasted more like a chutney I've had in the past with momos. The roommate enjoyed the dishes he ordered, the vindaloo and the assorted naans.\n\nIndian is one of my comfort foods, so I'm glad I discovered another great option for delivery.", "rating": 4, "date": "2017-01-29"}], "vegetarian thali": [], "om thali special": [{"excerpts": ["I got the \"Om Thali Special,\" and every dish was fantastic! ", "For $45 it offers a lot of food, and the leftovers will last throughout the weekend. ", "Out of all the Indian places I've tried, this is now my new favorite- thank you!"], "author": "Merina S.", "review": "I only order Indian delivery food because they offer dishes that I cannot cook myself! I got the \"Om Thali Special,\" and every dish was fantastic! For $45 it offers a lot of food, and the leftovers will last throughout the weekend. Out of all the Indian places I've tried, this is now my new favorite- thank you!", "rating": 5, "date": "2017-07-08"}], "jeera rice": [{"excerpts": ["Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. ", "Spend some time.\n", "Helpful and friendly service, average pricing, worth it.\n      ", "Overall I recommend this place for new eaters to give a try. ", "Thanks Om."], "author": "Feroz C.", "review": "Walked here with friend for dinner on weekend. Interior decoration of dining hall was so attractive and cozy. Beer and wine bar next to entrance. Welcoming staffs. Felt good. We had:-\n       Chicken tikka masala, garlic naan, lamb curry , jeera rice, and an Indian brand beer. Spend some time.\nHelpful and friendly service, average pricing, worth it.\n      Overall I recommend this place for new eaters to give a try. Thanks Om.", "rating": 5, "date": "2017-05-22"}, {"excerpts": ["I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. ", "Beware asking for the dishes spicy, it'll test your tolerance (in a good way). ", "The naan was also excellent... "], "author": "Cynthia S.", "review": "Best Indian food I've had in San Francisco! It was so flavorful and tasted high quality. I had super yummy chicken tikki masala and lamb curry, also the jeera rice which I loved. Beware asking for the dishes spicy, it'll test your tolerance (in a good way). The naan was also excellent... I love me some naan. \n\nThe only thing that I believe has room for improvement is the restaurant decor and ambiance. It is a little dim and lacks personality/charm. That being said, the food is way important and I'll be back many times.", "rating": 5, "date": "2016-09-28"}, {"excerpts": ["Oh my goodness, I will never forget the lamb tikka masala with the side of jeera rice (flavor of cumin and turmeric)and Serano chili naan. ", "I am also surprise by the service they give to me.i will be back there to have the dine in there .."], "author": "San T.", "review": "Oh my goodness, I will never forget the lamb tikka masala with the side of jeera rice (flavor of cumin and turmeric)and Serano chili naan. I am also surprise by the service they give to me.i will be back there to have the dine in there ..", "rating": 5, "date": "2017-12-28"}, {"excerpts": ["- Jeera Rice, $4.50 - nothing special. ", "normal rice. ", "highly overpriced.\n", "Total bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. ", "And the food was really mediocre."], "author": "Lucia W.", "review": "I was so disappointed with this order (we did pickup) after seeing all the positive reviews. I was really looking forward to a new Indian restaurant for our rotation.\n\nMy chief complaints: it's about 20% more expensive than the other places we order from. That would be ok if it was the only problem, but combined with the food not being very good, we probably won't order from Om again.\n\nWe ordered:\n- Papadum, $1.50 - fine. Was a little darker than I'm used to but perfectly fine.\n- Tandoori Chicken Wings, $9.95 these were good.\n- Tandoori Assorted, $10.95 - fine. No grizzly meats, so that's good. But they were missing a nice little tangy kick.\n- Spicy Mixed Vegetables Soup, $5.95 - first disappointment: for the price, it was a tiny portion. And the flavor was lame, and the clear soup had some kind of thickening agent that made it more like Chinese gelatinous soup. Very low on flavor. Certainly no kick from anything lemony. Highly overpriced.\n- Chicken Mulligatawny Soup, $5.95 - also a tiny portion. Very low on flavor. Highly overpriced.\n- Baigan Bharta (Vegan), $10.95 - fine. Nothing special.\n- Bhindi Masala (Vegan), $10.95 - low on flavor. \n- Mushroom Matar (Vegan), $10.95 - fine.\n- Chicken Tikka Kebab, $12.95 - fine. Also missing that nice tikka tangy kick.\n- Butter Chicken Masala, $12.95 - fine.\n- Tandoori Roti, $2.00 - low on flavor.\n- Laccha Paratha, $3.95 - low on flavor.\n- Jeera Rice, $4.50 - nothing special. normal rice. highly overpriced.\nTotal bill was $125, which was a bit higher than our usual dinner for 2 adults, 3 kids and leftovers for the next day. And the food was really mediocre.", "rating": 2, "date": "2016-10-12"}], "vegetable biryani": [{"excerpts": ["The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! ", "Don't miss out on this divine experience."], "author": "Maria B.", "review": "Delicious EVERY time we visit! The vegetable biryani, aloo gobi, bhindi masala, and vegetable Tikka masala were on point! Don't miss out on this divine experience.", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. ", "INCREDIBLE. ", "Best Indian we have ever had."], "author": "Chelsey T.", "review": "Mild vegetable biryani, medium chicken tiki Marsala, & paneer naan. INCREDIBLE. Best Indian we have ever had.", "rating": 5, "date": "2017-07-30"}, {"excerpts": ["I went simple at first, and ordered the vegetable biryani. ", "That was a success! ", "I then went for veggie tikka masala, and that was a score, as well! ", "The spice ranges from mild to extra spicy, and they actually do it extra spicy! ", "I've also gone mild, and they made that deliciously, too. ", "Super yummy! ", "I have a new addiction!"], "author": "Tei G.", "review": "Finally, good Indian in the Haight! We had incarnation after incarnation of lousy Indian food in the same location. I had given up. Recently, I had heard some good things about the newest place, so I mustered my courage, and went for it. I went simple at first, and ordered the vegetable biryani. That was a success! I then went for veggie tikka masala, and that was a score, as well! The spice ranges from mild to extra spicy, and they actually do it extra spicy! I've also gone mild, and they made that deliciously, too. Super yummy! I have a new addiction!", "rating": 5, "date": "2017-07-25"}, {"excerpts": ["Vegetable Biryani was especially delicious."], "author": "Elise R.", "review": "Great, fresh Indian food that doesn't feel greasy or cooked to oblivion. Hard to find good Indian in SF, and this new place is promising! Better than others in Inner Sunset/Haight area that I've tried. Super nice staff, too. Vegetable Biryani was especially delicious.", "rating": 5, "date": "2016-08-03"}], "shrimp biryani": [], "mixed sea food biryani": [], "mixed pickle": [{"excerpts": ["$2.95 \n\nMixed Pickle  = Tart and spicy. "], "author": "Fannie S.", "review": "We tried delivery from this place recently.  \n\nVegetable Pakora = full of flavor and crisp. Even for delivery. $4.95 \n\nTandoori Chicken Wings = awesome. Moist and flavorful chicken wings. And I loved the onions and peppers that come with them! $9.95 \n\nBaigan Bharta = smoky eggplant. Delicious. $10.95 \n\nSaag Paneer  = good. On the mild side. $10.95\n\nChicken Tikka Masala = excellent. Slightly sweet, smoky and hit the spot. He loved it. $12.95 \n\nRaita  = typical. $2.95 \n\nMixed Pickle  = Tart and spicy. Exactly what he wanted. $1.95 \n\nBasmati Rice = good. $2.95 \n\nGarlic Naan = good. (Better after sticking it in the oven though.) $2.95 \n\nKheer  = a most peculiar version. It was tart/sour. I ended up composting because I couldn't eat more than 3 spoonfuls. $3.95 \n\nPrices = moderate. $64.50 before taxes and discount code. We had leftovers for two more meals.", "rating": 4, "date": "2016-11-16"}], "mango kulfi": [], "mango ice cream": [], "fresh season salad": [], "cucumber raita": [], "mango achar": [], "cucumber tomato salad": [], "mixed seafood biryani": [], "nut allergies": []}