{"peach lemonade": [], "pina de lychee": [], "mango splash": [], "lychee moonlight": [], "shirley temple": [], "one waan lychee iced tea": [], "one waan arnold palmer": [], "thai iced tea coffee": [], "perrier sparkling water": [], "one waan fresh spring rolls": [{"excerpts": ["We had for starters: \nOne Waan Fresh Spring Rolls - "], "author": "Joanie c.", "review": "We popped in last night to check out the new Thai and we loved it!  Everything was fresh, delicious, & sumptuous!\n\nWe had for starters: \nOne Waan Fresh Spring Rolls - super fresh & delicate\nMixed green, cilantro, lettuce, stuffed with tofu, vermicelli noodles, bean sprouts, carrots, mint leaves, basil leave, served with fragrant sweet soy dipping sauce and sprinkle peanuts on top\n\nThai Samosa - very good, and though deep fried, not oily or heavy\nA Thai twist on an Indian style - deep-fried pastries stuffed with potato, carrots, ground chicken, curry powder and onions.\n\nSpicy Basil - This was the one we all loved most!  \nBell peppers, chili, fresh basil, green bean and garlic sauce with tofu\n\nYellow Curry Chicken-Yummy\nMild curry with coconut milk and slow -cooked chicken, onion, carrots and potatoes with chicken\n\nPad See Ew-Great flavors!\nRice noodles, egg, garlic, American broccoli, and black bean sauce\n\nAlex, the owner & chef, came out to chat about his approach to preparing fresh, high quality dishes with us.  He was charming and enthusiastic. \n\nwe can't wait to go back and try the Pad Thai that Alex told us about!", "rating": 5, "date": "2016-12-02"}], "crunchy calamari": [{"excerpts": ["Crunchy Calamari (battered calamari, green apple, sriracha cream) = ", "okay. "], "author": "Fannie S.", "review": "My friend treated me to a birthday dinner here.  \n\nFood = good. \n\nCrunchy Calamari (battered calamari, green apple, sriracha cream) = okay. $10.50.\n\nTom Kha (coconut milk soup with lemongrass, galangal, kaffir lime leaf, and mushrooms topped with cilantro and green onion) = good. $12.95 (large)\n\nPumpkin Curry (kabocha squash, bell peppers, jalapeno and basil leave in red curry) = good. $15.95\n\nDrunken Noodles (Fried flat rice noodles with garlic, fresh chili, tomatoes, onions, jalapeno, basil and bell peppers) = excellent. Definitely my favorite dish. $13.50.\n\nMango sticky rice (sweet pandanus coconut sticky rice with sweet delicious fresh mango) = good. Good portion. $8.95 x2\n\nService = friendly and attentive. \n\nPrices = moderate. Dinner for two came out to $76.82.", "rating": 4, "date": "2018-07-30"}, {"excerpts": ["We ordered crunchy calamari, bacon wrapped scallops, angel wings was super delicious! ", "And we also ordered green curry with prawn! "], "author": "K O.", "review": "Best thai food in the city! I live in San Francisco for long time! Friend insurance this thai restaurant. Come with family four people. We ordered crunchy calamari, bacon wrapped scallops, angel wings was super delicious! And we also ordered green curry with prawn! Snow white, grill salmon moroheiya ! All super delicious! And super fresh! Dessert we had mango sticky rice! Everything was wonderful! Also the decoration was very pretty! All my family love it! We will come back for sure! And we will tell friends come! Lucky to have this thai restaurant in the city!", "rating": 5, "date": "2018-10-11"}, {"excerpts": ["Our favorite dish was the Crunchy Calamari, Angel Wings, Corn Cakes, Mango Panna Cotta, and of course the cocktails.\n\n"], "author": "David W.", "review": "A friend recommended that we check out One Waan and I'm so glad we did. First, I knew it was going to be good because we got the only parking spot on whole block in front of the restaurant on a Friday night. lol\n\nNice clean, modern decor and a great staff that are there to make sure we had great dining experience. What really surprised me was One Waan has an extensive cocktail menu that tasted excellent with our delicious appetizers, entree dishes and even our desserts.\n\nOur favorite dish was the Crunchy Calamari, Angel Wings, Corn Cakes, Mango Panna Cotta, and of course the cocktails.\n\nEven though we've already ordered quite a few dishes, we're eager to return to try the other foods One Waan offers on their menu, but also to say hi to the most welcoming and friendly staff, a rarity nowadays IMO...\n\nGo check out One Waan!", "rating": 5, "date": "2017-12-04"}, {"excerpts": ["We enjoyed appetizers of crunchy calamari and corn fritters as appetizers.\n\n"], "author": "Dennis B.", "review": "Recently had lunch at One Waan and all 5 of us were very impressed. The food was all fresh and delicious. Service was excellent and the prices reasonable.  It is not a bargain restaurant but we were all please with the quality food we received for the price.\n\nWe enjoyed appetizers of crunchy calamari and corn fritters as appetizers.\n\nEntrees we had were:\nTom Tamarind soup: an outstanding bowl of fantastic broth with tofu, etc.\nSpicy Basil: with chicken, peppers, chili green beans in a wonderful sauce\nPumpkin Lover: wok stir-fried pumpkin, peppers, jalapeno, basil: delicious\nPad Thai: some of the best we've had\nRed Curry: with pork, coconut milk, peppers, etc. \n\nThe food was really outstanding and presentation and timing were spot on. We also thought the portions were more than adequate. We were all too full to have dessert. We are already looking forward another meal from One Waan tomorrow night!\n\nAnother point that I'd make is that the owner is very friendly and responsive as are the staff. I'd emailed with a question I had about their website information and the owner got back to me right away. I also asked if a reservation would be necessary given when we would be there. He said he'd be glad to reserve a table once we had the time nailed down. We weren't completely sure what time we'd get there since we were meeting friends who were driving up from the south coast but he said he'd make note of our party anyway.", "rating": 4, "date": "2017-01-12"}], "crunchy tofu": [], "one waan crab rangoon": [], "veggie crispy roll": [{"excerpts": ["We had the veggie crispy roll, spicy basil with chicken, pumpkin curry with pork, and the drunken noodles with chicken.  ", "Again, the food was good and the portions average.  ", "Bottom line, the food, portions, and service all good, but did not justify the steep prices.  ", "I can find equally good Thai for less."], "author": "Doug B.", "review": "Never was a big fan of Osha so was excited to see a new Thai restaurant open up right away.  The service is good and friendly staff.   The owner's heart is in the right place....customer comes first.  I found the food to be good but nothing exceptional.  We had the veggie crispy roll, spicy basil with chicken, pumpkin curry with pork, and the drunken noodles with chicken.  Again, the food was good and the portions average.  Bottom line, the food, portions, and service all good, but did not justify the steep prices.  I can find equally good Thai for less.", "rating": 3, "date": "2016-11-23"}], "one waan tartare": [{"excerpts": ["One Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\n"], "author": "Chris C.", "review": "Check these guys out, you won't be disappointed! \n\nJust came back from this recently opened restaurant for my pops' birthday. Solid food and an ambiance and aesthetic commanding a bit higher pricepoint than your average Thai hole-in-the-wall. Consistent, courteous service, clean bathroom: bases covered. After hearing about the birthday boy, the kitchen surprised us with a complimentary dessert, in elegant display! We were very grateful. First review, thanks for making it a good experience, One Waan!\n\nOrdered:\nThai Iced Tea, Jasmine Tea, One Waan Lychee Iced Tea\nOne Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\nThe lamb was cooked to medium-rare perfection, the cuttlefish light and perfectly done. There may be many Thai joints in SF, but there's only One Waan :)", "rating": 4, "date": "2016-12-27"}], "prawn in a blanket": [], "baconwrapped scallop": [], "avocado mango spring roll": [{"excerpts": ["The avocado mango spring roll is delish. ", "Definitely a must-have. ", "The pad Thai could've been a little better, but the presentation was nice.\n", "Cute ambience and friendly employees."], "author": "bianca m.", "review": "The avocado mango spring roll is delish. Definitely a must-have. The pad Thai could've been a little better, but the presentation was nice.\nCute ambience and friendly employees.", "rating": 4, "date": "2017-12-01"}, {"excerpts": ["The One Waan Avocado Mango Spring Roll and Chicken Mango Curry were the suggestions. ", "They were excellent!\n", "All the food was good and we will definitely be back and hopefully eat in."], "author": "Sue L.", "review": "I popped into One Waan around lunch time today as I had to ask if they could do any meals without soy or dairy. I attracted the attention of the owner who interrupted his own meal to chat with me. He assured me that he had a chef in the kitchen and that meant the meals could be modified or he would advise the ones which couldn't. \nI took the menu home and we did our homework for our dairy and soy intolerant diner.\nTonight I walked in to order, and before I got to the main desk the fellow I chatted with earlier intercepted and he personally checked what I was ordering. That was pretty good service. We had chosen a couple of meals that weren't appropriate so he made a couple of suggestions and I went with them. \nThe One Waan Avocado Mango Spring Roll and Chicken Mango Curry were the suggestions. They were excellent!\nAll the food was good and we will definitely be back and hopefully eat in.", "rating": 5, "date": "2016-11-22"}], "corn cake": [], "fried avocado dippers": [], "coconut noodle soup": [], "tom tamarind soup": [{"excerpts": ["Tom Tamarind soup: an outstanding bowl of fantastic broth with tofu, etc.\n"], "author": "Dennis B.", "review": "Recently had lunch at One Waan and all 5 of us were very impressed. The food was all fresh and delicious. Service was excellent and the prices reasonable.  It is not a bargain restaurant but we were all please with the quality food we received for the price.\n\nWe enjoyed appetizers of crunchy calamari and corn fritters as appetizers.\n\nEntrees we had were:\nTom Tamarind soup: an outstanding bowl of fantastic broth with tofu, etc.\nSpicy Basil: with chicken, peppers, chili green beans in a wonderful sauce\nPumpkin Lover: wok stir-fried pumpkin, peppers, jalapeno, basil: delicious\nPad Thai: some of the best we've had\nRed Curry: with pork, coconut milk, peppers, etc. \n\nThe food was really outstanding and presentation and timing were spot on. We also thought the portions were more than adequate. We were all too full to have dessert. We are already looking forward another meal from One Waan tomorrow night!\n\nAnother point that I'd make is that the owner is very friendly and responsive as are the staff. I'd emailed with a question I had about their website information and the owner got back to me right away. I also asked if a reservation would be necessary given when we would be there. He said he'd be glad to reserve a table once we had the time nailed down. We weren't completely sure what time we'd get there since we were meeting friends who were driving up from the south coast but he said he'd make note of our party anyway.", "rating": 4, "date": "2017-01-12"}, {"excerpts": ["I ordered the Tom Tamarind soup (comes with our exes of white meat chicken); one of the most flavorful soups I've tried; I could definitely taste the basil and fresh herbs which elevated the sweet and savory qualities of the soup. ", "We also shared the avocado and mango rolls appetizer. ", "It had a peanut sauce which was so yummy! ", "We were beyond pleased with everything we ordered that we came almost a into later and ordered the same meal and left just as satisfied as the first time. \n", "The staff is friendly and attentive too!"], "author": "Vanessa G.", "review": "One of my favorite places in glen park --a true Thai gem. Utterly delicious with flavorful and beautifully plated dishes. My mother and I ventured here and ordered the \"Sizzling Seafood\" plate, found in the Chef's Specials of their menu. This plate came with prawns, mussels, scallops, and calamari sautéed with veggies and a delicious sauce. Paired alongside a bowl of Jasmine rice, it's definitely a hearty plate. I ordered the Tom Tamarind soup (comes with our exes of white meat chicken); one of the most flavorful soups I've tried; I could definitely taste the basil and fresh herbs which elevated the sweet and savory qualities of the soup. We also shared the avocado and mango rolls appetizer. It had a peanut sauce which was so yummy! We were beyond pleased with everything we ordered that we came almost a into later and ordered the same meal and left just as satisfied as the first time. \nThe staff is friendly and attentive too!", "rating": 5, "date": "2018-01-22"}], "one waan house crackling salad": [], "green papaya salad with grilled prawns": [], "mango salmon salad": [], "lettuce wrap": [], "grilled shrimp avocado mango salad": [], "garlic black pepper": [], "country chicken": [], "prik khing": [], "pumpkin lover": [{"excerpts": ["Spicy Basil: with chicken, peppers, chili green beans in a wonderful sauce\nPumpkin Lover: wok stir-fried pumpkin, peppers, jalapeno, basil: "], "author": "Dennis B.", "review": "Recently had lunch at One Waan and all 5 of us were very impressed. The food was all fresh and delicious. Service was excellent and the prices reasonable.  It is not a bargain restaurant but we were all please with the quality food we received for the price.\n\nWe enjoyed appetizers of crunchy calamari and corn fritters as appetizers.\n\nEntrees we had were:\nTom Tamarind soup: an outstanding bowl of fantastic broth with tofu, etc.\nSpicy Basil: with chicken, peppers, chili green beans in a wonderful sauce\nPumpkin Lover: wok stir-fried pumpkin, peppers, jalapeno, basil: delicious\nPad Thai: some of the best we've had\nRed Curry: with pork, coconut milk, peppers, etc. \n\nThe food was really outstanding and presentation and timing were spot on. We also thought the portions were more than adequate. We were all too full to have dessert. We are already looking forward another meal from One Waan tomorrow night!\n\nAnother point that I'd make is that the owner is very friendly and responsive as are the staff. I'd emailed with a question I had about their website information and the owner got back to me right away. I also asked if a reservation would be necessary given when we would be there. He said he'd be glad to reserve a table once we had the time nailed down. We weren't completely sure what time we'd get there since we were meeting friends who were driving up from the south coast but he said he'd make note of our party anyway.", "rating": 4, "date": "2017-01-12"}], "bbq duck": [{"excerpts": ["I ordered the BBQ Duck over spinach with broccoli & brown rice. ", "The duck was the tastiest and moist I've ever eaten. ", "The spinach had a great flavor to it. ", "The broccoli was al dente and steamed with no flavorings. ", "The brown rice was also the best I've eaten. ", "Great Thai restaurant, I'd go back for sure."], "author": "Terese C.", "review": "Ate to go food at home. Ordered chicken & lettuce wraps. Since it was to go, the sauce arrived in a small container and I ate it sans sauce. It was still tasty and had crunch to the lettuce. The shrimp spring rolls were extremely large including the shrimp.  The cilantro was a bit strong!  The crackling chicken salad was good and full of covering on the chicken. I'd order food here again!\n\nAnother night we decided to eat at the restaurant. The places surrounding the restaurant have bars on their doors and windows. Walking into the restaurant, it's tastefully decorated. The service was on par and the food was amazingly great. The chicken satay was perfectly moist & the best I've had. I ordered the BBQ Duck over spinach with broccoli & brown rice. The duck was the tastiest and moist I've ever eaten. The spinach had a great flavor to it. The broccoli was al dente and steamed with no flavorings. The brown rice was also the best I've eaten. Great Thai restaurant, I'd go back for sure.", "rating": 5, "date": "2018-05-29"}, {"excerpts": ["BBQ duck was so taste and served with perfectly cooked broccoli and sauted spinach.   ", "Really lovely Drunkin Noodles", ", we did the combination seafood.  ", "Finished with the Fried Ice Cream, vanilla wrapped in a pastry and fried.\n", "We will be back!!"], "author": "Tina D.", "review": "Our first time here under the new chef and owner.  The food was excellent, fresh, light, and beautiful.  Great service and a nice neighborhood atmosphere.  We had the chef's special sping roll (avacado & mango), don't  miss they are so fresh and delish.  The I Love Lycee cocktail was so refreshing and lovely.  BBQ duck was so taste and served with perfectly cooked broccoli and sauted spinach.   Really lovely Drunkin Noodles, we did the combination seafood.  Finished with the Fried Ice Cream, vanilla wrapped in a pastry and fried.\nWe will be back!!", "rating": 5, "date": "2016-12-03"}, {"excerpts": ["I  had pad thai shrimp , pineapple fried rice , Bbq duck and cocktail. ", "Food look a bit expensive but, entrees come with rice . ", "It mean not bad at all (reasonable). ", "If you compare with another thai or asian restaurant. ", "Look at decor and good service. ", "The Food very testy.   ", "I love their food. ", "Very fresh!  ", "Presentation very creative! ", "Wow!!!  ", "I recommend for who like quality food !!! ", "And find dining experience."], "author": "Chu O.", "review": "I try this place couple times!  I  had pad thai shrimp , pineapple fried rice , Bbq duck and cocktail. Food look a bit expensive but, entrees come with rice . It mean not bad at all (reasonable). If you compare with another thai or asian restaurant. Look at decor and good service. The Food very testy.   I love their food. Very fresh!  Presentation very creative! Wow!!!  I recommend for who like quality food !!! And find dining experience.", "rating": 5, "date": "2017-06-14"}, {"excerpts": ["We ordered BBQ duck, papaya salad, pad Thai with seafood. ", "They are so yummy! ", "Before I was thinking osha is very good test, but after I tried One Waan, I think one waan test much better than osha.", "The pad Thai with seafood is really testy and fresh! ", "Mango sticky rice is so good! ", "I highly recommend this place. ", "Lol!"], "author": "Yanna H.", "review": "My friend and I came from SF to visit other friend live in glen park at weekend. We plan to eat osha Thai for lunch but after we walked there, the restaurant already changed to be One Waan Thai restaurant, it looks clean and nice from outside. So we plan go try out. We ordered BBQ duck, papaya salad, pad Thai with seafood. They are so yummy! Before I was thinking osha is very good test, but after I tried One Waan, I think one waan test much better than osha.The pad Thai with seafood is really testy and fresh! Mango sticky rice is so good! I highly recommend this place. Lol!", "rating": 5, "date": "2016-11-17"}], "steamed sea bass": [], "massaman curry beef": [{"excerpts": ["The only bad experience I've had was the Massaman Curry Beef - which was full of gristle that there really was no quality beef in the dish - but I only very rarely order beef anyway.  ", "I order from them at least once a week."], "author": "Kali C.", "review": "Amazing yellow curry.   Amazing Pad See Ew.   The vegetables are always on point.  The only bad experience I've had was the Massaman Curry Beef - which was full of gristle that there really was no quality beef in the dish - but I only very rarely order beef anyway.  I order from them at least once a week.", "rating": 4, "date": "2017-04-07"}], "pineapple roast duck curry": [{"excerpts": ["One Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\n"], "author": "Chris C.", "review": "Check these guys out, you won't be disappointed! \n\nJust came back from this recently opened restaurant for my pops' birthday. Solid food and an ambiance and aesthetic commanding a bit higher pricepoint than your average Thai hole-in-the-wall. Consistent, courteous service, clean bathroom: bases covered. After hearing about the birthday boy, the kitchen surprised us with a complimentary dessert, in elegant display! We were very grateful. First review, thanks for making it a good experience, One Waan!\n\nOrdered:\nThai Iced Tea, Jasmine Tea, One Waan Lychee Iced Tea\nOne Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\nThe lamb was cooked to medium-rare perfection, the cuttlefish light and perfectly done. There may be many Thai joints in SF, but there's only One Waan :)", "rating": 4, "date": "2016-12-27"}], "drunken noodles": [{"excerpts": ["$15.95\n\nDrunken Noodles (Fried flat rice noodles with garlic, fresh chili, tomatoes, onions, jalapeno, basil and bell peppers) = excellent. "], "author": "Fannie S.", "review": "My friend treated me to a birthday dinner here.  \n\nFood = good. \n\nCrunchy Calamari (battered calamari, green apple, sriracha cream) = okay. $10.50.\n\nTom Kha (coconut milk soup with lemongrass, galangal, kaffir lime leaf, and mushrooms topped with cilantro and green onion) = good. $12.95 (large)\n\nPumpkin Curry (kabocha squash, bell peppers, jalapeno and basil leave in red curry) = good. $15.95\n\nDrunken Noodles (Fried flat rice noodles with garlic, fresh chili, tomatoes, onions, jalapeno, basil and bell peppers) = excellent. Definitely my favorite dish. $13.50.\n\nMango sticky rice (sweet pandanus coconut sticky rice with sweet delicious fresh mango) = good. Good portion. $8.95 x2\n\nService = friendly and attentive. \n\nPrices = moderate. Dinner for two came out to $76.82.", "rating": 4, "date": "2018-07-30"}, {"excerpts": ["We got the tom kha soup with tofu (too much tofu, i'd probably just have it plain next time) , pad thai and drunken noodles. ", "I had asked for the drunken noodles to be spicy and ", "OMG was it spicy - loved the kick out of the chillies . ", "Had to get a mango ice cream to finish after all that nice burn in my system ", ";) ", "Definitely see myself going back esp since its so close to home.\n", "Ambiance was pretty nice too! ", "Also i saw many kids, so kid friendly ++"], "author": "Anju J.", "review": "Husband and I stopped by for a quiet Saturday night meal around 8:30 PM after a long tiring day - and the food was just what we wanted. We got the tom kha soup with tofu (too much tofu, i'd probably just have it plain next time) , pad thai and drunken noodles. I had asked for the drunken noodles to be spicy and OMG was it spicy - loved the kick out of the chillies . Had to get a mango ice cream to finish after all that nice burn in my system ;) Definitely see myself going back esp since its so close to home.\nAmbiance was pretty nice too! Also i saw many kids, so kid friendly ++", "rating": 5, "date": "2018-06-17"}, {"excerpts": ["Had Pad See Yew, Tom Kah and Drunken Noodles. \n\n", "I love the basil taste but it did not save the Drunken Noodles from disappointment. ", "Well if you are in for 98% Fusion + 2% Thai food, this place is for you!"], "author": "Wensu L.", "review": "Not sure why people raved about this. Personally, this is not very much Thai but the scale is skewed towards Fusion. Had Pad See Yew, Tom Kah and Drunken Noodles. \n\nAs someone who loves Thai food and coming from Southeast Asia, I always cringe at the boiled western vegetables in my Tom Yum, Tom Kah...Pad See Ew in the US. I have looked past that but well, the flavour is really flat for both soup and noodles. I love the basil taste but it did not save the Drunken Noodles from disappointment. Well if you are in for 98% Fusion + 2% Thai food, this place is for you!", "rating": 2, "date": "2018-09-19"}, {"excerpts": ["We ordered the drunken noodles with an added $5 appetizer spring roll( think it was the lunch special). ", "Proportion was surprisingly small with having one 5 inch spring roll cut in half for $5?? ", "But it was kinda fresh though, definitely not worth it! ", "Drunken noodles were on the same price tier as Blackwoods's Thai noodles but smaller and not nearly as good in my opinion. \n\n"], "author": "Benson W.", "review": "Came into this place on a Friday afternoon. We were greeted very nicely the moment we walked in( maybe because it was empty at the time). Server constantly checked up on us while we took our sweet one chatting it up. Loved how modernized this place looked!\n\nWe ordered the drunken noodles with an added $5 appetizer spring roll( think it was the lunch special). Proportion was surprisingly small with having one 5 inch spring roll cut in half for $5?? But it was kinda fresh though, definitely not worth it! Drunken noodles were on the same price tier as Blackwoods's Thai noodles but smaller and not nearly as good in my opinion. \n\nAlso had another order of yellow curry chicken! I normally don't eat much curry(definitely trying to change in 2017!) but this was DELICIOUS! I believe the coconut milk was the game changer but this was the game changer for One Waan for me!\n\nI'd definitely come back to try more of their dishes but the life of a broke college kid is putting this on hold at the moment! A little pricy in my opinion but I guess this is what happens in SF..", "rating": 4, "date": "2017-02-01"}, {"excerpts": ["I had drunken noodles with tofu and vegetables, and really liked it. ", "I was in a mood for something really Thai-tasting, and this filled the bill.  ", "For dessert we had the mango and sticky rice. ", "Incredible presentation on that, though the price was a steep $9. ", "Great place though", "--we will return again. ", "This was our second visit."], "author": "John H.", "review": "This is the best Thai place for miles. Delicious food, beautiful decor, mellow, airy music playing on the PA. The service is also very, very good. I had drunken noodles with tofu and vegetables, and really liked it. I was in a mood for something really Thai-tasting, and this filled the bill.  For dessert we had the mango and sticky rice. Incredible presentation on that, though the price was a steep $9. Great place though--we will return again. This was our second visit.", "rating": 5, "date": "2017-03-02"}, {"excerpts": ["We had the veggie crispy roll, spicy basil with chicken, pumpkin curry with pork, and the drunken noodles with chicken.  ", "Again, the food was good and the portions average.  ", "Bottom line, the food, portions, and service all good, but did not justify the steep prices.  ", "I can find equally good Thai for less."], "author": "Doug B.", "review": "Never was a big fan of Osha so was excited to see a new Thai restaurant open up right away.  The service is good and friendly staff.   The owner's heart is in the right place....customer comes first.  I found the food to be good but nothing exceptional.  We had the veggie crispy roll, spicy basil with chicken, pumpkin curry with pork, and the drunken noodles with chicken.  Again, the food was good and the portions average.  Bottom line, the food, portions, and service all good, but did not justify the steep prices.  I can find equally good Thai for less.", "rating": 3, "date": "2016-11-23"}], "kua kai": [], "moroheiya pad thai": [], "one waan sukiyaki": [], "one waan curry noodles": [], "classic thai fried rice": [], "tom yum fried rice": [{"excerpts": ["I was craving for a Tom Yum Fried rice for a while, and One Waan satisfies my crave perfectly. \n\n"], "author": "Nelson L.", "review": "THIS PLACE IS LEGIT!!!!\n\nI was craving for a Tom Yum Fried rice for a while, and One Waan satisfies my crave perfectly. \n\nIt is one of those delicacies that's available only in Thailand.\n\nThe flavor + portion is on point. They are not skimping on the shrimp at all. It tastes really authentic, not americanize at all. \n\nHighly recommended!", "rating": 5, "date": "2017-04-26"}], "crispy prawn fried rice": [], "stirfried wok mix vegetables": [], "stirfried wok american broccoli": [], "stirfried wok bok choy": [], "spicy catfish": [{"excerpts": ["We ordered one Waan avocado spring roll and Thai samosa( homemade ), and entree we ordered spicy catfish and crying tiger and one more crab fried rice! ", "They are so testy and great! ", "Crying tiger steak was so juicy and fresh! ", "Also the crab fried rice are great! ", "They use very good crab (big meat)! "], "author": "Chuck R.", "review": "My boyfriend and I went to one waan Thai last night around 6:30pm, we heard from friends, they are highly recommend this new Thai restaurant. So we come up and want to try out. We ordered one Waan avocado spring roll and Thai samosa( homemade ), and entree we ordered spicy catfish and crying tiger and one more crab fried rice! They are so testy and great! Crying tiger steak was so juicy and fresh! Also the crab fried rice are great! They use very good crab (big meat)! And I also like the Volcanic beef ！ Love Thai Restaurant!", "rating": 5, "date": "2016-11-24"}], "volcanic beef": [{"excerpts": ["Volcanic beef: good quality steak. ", "Soft and juicy.\n", "Girl salmon curry is also good! \n", "We also live the cocktail! \n", "Yeah! ", "Don't forget to order their mango sticky rice! ", "They make with pandan leave! ", "Very good!"], "author": "Dada C.", "review": "Excilent thai restaurant! I'm thai and i live in san francisco long time. This is the first thai restaurant test like real thai food back home! Highly recommend!! It' unique! Fresh! Less sugar! Less MSG! I came with two friends today. We order papaya salad: fresh! Testy! No MSG! It's so good! \nLarge Tom kha with shrimp: 8 fresh tiger prawn!!! And they use high-end coconut milk! Not over milky and sticky! Is very good. Its really thai style tom kha.\nVolcanic beef: good quality steak. Soft and juicy.\nGirl salmon curry is also good! \nWe also live the cocktail! \nYeah! Don't forget to order their mango sticky rice! They make with pandan leave! Very good!", "rating": 5, "date": "2017-04-15"}, {"excerpts": ["And I also like the Volcanic beef ！ Love Thai Restaurant!"], "author": "Chuck R.", "review": "My boyfriend and I went to one waan Thai last night around 6:30pm, we heard from friends, they are highly recommend this new Thai restaurant. So we come up and want to try out. We ordered one Waan avocado spring roll and Thai samosa( homemade ), and entree we ordered spicy catfish and crying tiger and one more crab fried rice! They are so testy and great! Crying tiger steak was so juicy and fresh! Also the crab fried rice are great! They use very good crab (big meat)! And I also like the Volcanic beef ！ Love Thai Restaurant!", "rating": 5, "date": "2016-11-24"}, {"excerpts": ["We came with our family & friends for dinner and really enjoyed all the cuisines that we ordered: \n\nOne Waan Fresh Spring Roll\nChicken Satay\nDrunken Noodle\nPad Thai\nCrab Fried Rice\nVolcanic Beef\nStir Fry Mixed Veggies\nMango sticky rice for deserts... "], "author": "martin c.", "review": "We came with our family & friends for dinner and really enjoyed all the cuisines that we ordered: \n\nOne Waan Fresh Spring Roll\nChicken Satay\nDrunken Noodle\nPad Thai\nCrab Fried Rice\nVolcanic Beef\nStir Fry Mixed Veggies\nMango sticky rice for deserts... Ahhh, by far the best mango sticky rice I've tasted.\n\nThe meat and the vegetable are very FRESH and good quality!\nThe service is very nice and the owner is super friendly. \nThe restaurant has a nice ambient, which I think a good place for a date, too. \nWe came around 6.30pm and easily found a free 2-hr street parking nearby.\n\nI definitely come back and recommend this Thai Restaurant.", "rating": 5, "date": "2016-12-14"}], "angry prawn": [{"excerpts": ["My favorites here include the Crab Fried Rice,Angry prawn and Crying Tiger.\n", "Tonight I ordered Tom Yum soup as well as Green curry and both were delicious.", "I'm looking forward to my next order!!!!"], "author": "May O.", "review": "Love this place!!!\n\nOne waan is my favorite Thai restaurant in San Francisco.\nService is always good.My favorites here include the Crab Fried Rice,Angry prawn and Crying Tiger.\nTonight I ordered Tom Yum soup as well as Green curry and both were delicious.I'm looking forward to my next order!!!!", "rating": 5, "date": "2017-02-24"}, {"excerpts": ["Angry prawn is my favorite plate in here because the taste is so perfect between pranw and spicy sauce."], "author": "Aunchisa C.", "review": "Good food and good service. My waitress is kind and friendly person. Angry prawn is my favorite plate in here because the taste is so perfect between pranw and spicy sauce.", "rating": 5, "date": "2017-04-24"}, {"excerpts": ["angry prawn and crying tiger is also tasty. ", "Angry prawn is 5 big prawn with green beans is very good! ", "Highly recommended! ", "Also crying tiger is juicy! ", "We will come back!!"], "author": "Amber U.", "review": "Excellent service ! and the food is awesome.... i and my friend have dinner here tonight. Everything is nice! Romantic environment and fresh tasty food. We order avocado spring roll and chicken satay as appetizer, is very fresh and chicken satay is very juicy. angry prawn and crying tiger is also tasty. Angry prawn is 5 big prawn with green beans is very good! Highly recommended! Also crying tiger is juicy! We will come back!!", "rating": 5, "date": "2017-02-24"}], "grilled salmon with spicy moroheiya": [], "grilled australian lamb": [{"excerpts": ["One Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\n"], "author": "Chris C.", "review": "Check these guys out, you won't be disappointed! \n\nJust came back from this recently opened restaurant for my pops' birthday. Solid food and an ambiance and aesthetic commanding a bit higher pricepoint than your average Thai hole-in-the-wall. Consistent, courteous service, clean bathroom: bases covered. After hearing about the birthday boy, the kitchen surprised us with a complimentary dessert, in elegant display! We were very grateful. First review, thanks for making it a good experience, One Waan!\n\nOrdered:\nThai Iced Tea, Jasmine Tea, One Waan Lychee Iced Tea\nOne Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\nThe lamb was cooked to medium-rare perfection, the cuttlefish light and perfectly done. There may be many Thai joints in SF, but there's only One Waan :)", "rating": 4, "date": "2016-12-27"}], "sizzling seafood": [{"excerpts": ["My mother and I ventured here and ordered the \"Sizzling Seafood\" plate, found in the Chef's Specials of their menu. ", "This plate came with prawns, mussels, scallops, and calamari sautéed with veggies and a delicious sauce. ", "Paired alongside a bowl of Jasmine rice, it's definitely a hearty plate. "], "author": "Vanessa G.", "review": "One of my favorite places in glen park --a true Thai gem. Utterly delicious with flavorful and beautifully plated dishes. My mother and I ventured here and ordered the \"Sizzling Seafood\" plate, found in the Chef's Specials of their menu. This plate came with prawns, mussels, scallops, and calamari sautéed with veggies and a delicious sauce. Paired alongside a bowl of Jasmine rice, it's definitely a hearty plate. I ordered the Tom Tamarind soup (comes with our exes of white meat chicken); one of the most flavorful soups I've tried; I could definitely taste the basil and fresh herbs which elevated the sweet and savory qualities of the soup. We also shared the avocado and mango rolls appetizer. It had a peanut sauce which was so yummy! We were beyond pleased with everything we ordered that we came almost a into later and ordered the same meal and left just as satisfied as the first time. \nThe staff is friendly and attentive too!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["One Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\n"], "author": "Chris C.", "review": "Check these guys out, you won't be disappointed! \n\nJust came back from this recently opened restaurant for my pops' birthday. Solid food and an ambiance and aesthetic commanding a bit higher pricepoint than your average Thai hole-in-the-wall. Consistent, courteous service, clean bathroom: bases covered. After hearing about the birthday boy, the kitchen surprised us with a complimentary dessert, in elegant display! We were very grateful. First review, thanks for making it a good experience, One Waan!\n\nOrdered:\nThai Iced Tea, Jasmine Tea, One Waan Lychee Iced Tea\nOne Waan Tartare, \nSizzling Seafood, Grilled Australian Lamb, Pineapple Roast Duck Curry\n\nThe lamb was cooked to medium-rare perfection, the cuttlefish light and perfectly done. There may be many Thai joints in SF, but there's only One Waan :)", "rating": 4, "date": "2016-12-27"}], "grilled salmon peppercorn curry": [], "drunken mussel": [], "one waan khao soi": [], "lemongrass beef": [], "snow white": [{"excerpts": ["I came for their Snow White ($20) because it looks very tempting from photos. ", "It is not disappointing me!!  ", "There is white wine and lots of seafood in there. ", "A very rich and flavorful dish.  "], "author": "Shuyi L.", "review": "Here for a quick lunch with my colleague! It is not as busy and we were being served right away :) \n\nThey offer special lunch menu, but it is still above average lunch price for a Thai place. All the basic dishes are about ~$14.  I came for their Snow White ($20) because it looks very tempting from photos. It is not disappointing me!!  There is white wine and lots of seafood in there. A very rich and flavorful dish.  My colleague and I will definitely come back for it.  \n\nPro: It is a decent place for dinning with friends! Parking is very easy since it's close to residential areas.  Their dishes look very aesthetic and fulfilling :)", "rating": 5, "date": "2018-09-24"}, {"excerpts": ["Snow white, grill salmon moroheiya ! ", "All super delicious! ", "And super fresh! ", "Dessert we had mango sticky rice! ", "Everything was wonderful! ", "Also the decoration was very pretty! ", "All my family love it! ", "We will come back for sure! ", "And we will tell friends come! ", "Lucky to have this thai restaurant in the city!"], "author": "K O.", "review": "Best thai food in the city! I live in San Francisco for long time! Friend insurance this thai restaurant. Come with family four people. We ordered crunchy calamari, bacon wrapped scallops, angel wings was super delicious! And we also ordered green curry with prawn! Snow white, grill salmon moroheiya ! All super delicious! And super fresh! Dessert we had mango sticky rice! Everything was wonderful! Also the decoration was very pretty! All my family love it! We will come back for sure! And we will tell friends come! Lucky to have this thai restaurant in the city!", "rating": 5, "date": "2018-10-11"}], "hazelnut craquant": [], "pineapple ripieno": [], "tiramizu": []}