{"organic matcha lemonade": [{"excerpts": ["There's even organic matcha lemonade.\n\n"], "author": "Kathy Z.", "review": "I happened to be at Super Duper Burgers and looked up and, BAM, it was love at first sight. Right across the street was Onigilly. I am a huge fan of gourmet rice balls, so I raced over to give this place a try.\n\nI must admit, I wasn't blown away by the menu. Nothing I haven't seen elsewhere, and definitely nothing innovative. These \"onigiri\" rice balls are shaped into a triangle. No, this does not qualify as \"sushi.\" Everything is made with brown rice. I'm not a fan of brown rice elsewhere, but here it's quite sweet and good. Definitely a fan of how they prepare the onigiri. Each one is made to order, so expect to wait for your food. Lots of vegan and gluten-free options, too.\n\nThe ordering system here is not fun. The little shop gets so crowded that the few seats available can't even be used. You'll likely become incredibly cramped and uncomfortable. There's no real line for ordering and picking up, so patrons just curve toward the inside of the shop and it's a struggle to walk in or out.\n\nI went with the Snow Crab for $3.45 -- simple, fresh, and with lemon aioli. Yes, this is real crab meat. For the price, it's a little high-end. In general, the rice balls will run you between $2.76 and $3.75, before taxes. However, I'd expect 2-3 to fill you up and that's not too bad for a nice lunch. I devoured my Snow Crab rice ball in seconds.\n\nHere are some other options:\n- Teriyaki Tofu\n- Renkon (Spicy Lotus Root)\n- Shiitake\n- Spicy Bacon\n- Spicy Miso Beef\n- Unagi (Eel)\n- Grilled Salmon\n- Tempura Shrimp\n\nBesides the rice rolls, they offer salads and soup. They also do small dishes like edamame and fried chicken karaage. There's even organic matcha lemonade.\n\nExpect a 3.5% mandate surcharge \"to help offset the additional regulatory costs of doing business in San Francisco.\" Yeah, yeah, yeah.", "rating": 4, "date": "2018-07-31"}, {"excerpts": ["I also had the Organic Matcha Lemonade. \n\n"], "author": "Daniel D.", "review": "Absolutely amazing. I came here for lunch, on the recommendation of a friend. Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. I also had the Organic Matcha Lemonade. \n\nLet me be frank: I LOVE LEMONADE, and their Matcha lemonade just became a new favorite. The idea of the green tea threwme off, but I decidied to take the plunge. I'm glad I did.\n\nThe seaweed tasted very fresh and the meat exceeded expectation. I honestly believe they use real snow crab. Even the Wakame salad was great.\n\nDefinitely a new favorite restaurant!", "rating": 5, "date": "2015-05-05"}], "bottled green tea": [], "bottled oolong tea": [], "asian pear kombucha": [], "traditional kombucha": [], "takana  mustard greens": [], "ume  pickled plum": [], "hijiki seaweed": [{"excerpts": ["The unagi and hijiki seaweed were great choices -- moist and flavorful. "], "author": "Alex C.", "review": "Not to make unjust comparisons or anything, but kind of like a Japanese version of Freshroll -- three form factors (onigiri, rice bowl, or noodle salad) with an assortment of \"flavors\" to choose from.\n\nThe bowl is a lot of rice unfortunately. Reducing it to a better-balanced mélange involved some labor on my part: inhaling the undressed salad (mostly a filler) and nibbling away at the edges of the bed of rice till all I had left were the three choice flavors atop a more comfortable mound of rice. The unagi and hijiki seaweed were great choices -- moist and flavorful. The chashu, though, was thin and dry and sat there sort of somberly in the corner of my bowl.\n\n$9.49 for my meal, with the unagi at a 50-cent premium.", "rating": 3, "date": "2012-09-06"}], "renkon  lotus root": [], "miso nasu  eggplant": [], "natto  fermented soybeans": [], "soboro  ginger beef": [], "teriyaki chicken": [{"excerpts": ["They run about $3 and I had the Teriyaki Chicken and the Soboro - pork . \n\n"], "author": "Rod M.", "review": "I've always seen lines at this place so naturally I was curious. \n\nFinally stopped in and tried a couple of their rice triangles. \n\nEssentially to me it was like a musubi but in the shape of a...wait for it...a TRIANGLE. \n\nThey run about $3 and I had the Teriyaki Chicken and the Soboro - pork . \n\nTo me there was too much rice and not enough meat in the triangle. I know this is a tough proposition since you don't want the triangle to fall apart. Nevertheless, each bite i felt like I was eating predominately  white rice. \n\nWould I return....eh...probably not based on my experience. I love sushi, spam musubi etc but this place was just not my cup of tea.", "rating": 2, "date": "2018-02-02"}, {"excerpts": ["What I Got:\n- Teriyaki Chicken, 3/5; kinda bland\n- Salmon, 3/5; lacks flavor, tastes healthy though\n\nNot exactly impressed since the triangles I ordered were a bit bland (and that's saying a lot for someone who isn't much of a sauce person), but the rice is freaking yummy! "], "author": "Fanny W.", "review": "I feel like a damn onigilly after eating here, tummy full of rice. But hey, can't go wrong with affordable and decent lunches.\n\nPros:\n+ Costs ~$3 to fill up on rice triangles and protein\n+ Not too heavy of a lunch...\n+ Yet filling...mm saucy rice\n+ Compostable take-out containers, yay!\n\nCons:\n- Small space, more of a grab and go spot\n\nWhat I Got:\n- Teriyaki Chicken, 3/5; kinda bland\n- Salmon, 3/5; lacks flavor, tastes healthy though\n\nNot exactly impressed since the triangles I ordered were a bit bland (and that's saying a lot for someone who isn't much of a sauce person), but the rice is freaking yummy! Onigilly came with edamame and ginger, not sure if it's because got the trio combo (I think so).\n\nWill be back to try the spicy bacon, beef, and maybe another seafood onigilly.", "rating": 3, "date": "2017-12-12"}, {"excerpts": ["so I ordered two onigiri - a teriyaki chicken and an unagi. ", "I always use soy sauce ", "so I was surprised that I had to ask for it "], "author": "Holly R.", "review": "I'm a big fan of onigiri and there is pretty much nowhere to get it where I live (Phoenix) so just the concept of a place like this scores points in my book. \n\nI just wanted a snack to tie me over before dinner so I ordered two onigiri - a teriyaki chicken and an unagi. I always use soy sauce so I was surprised that I had to ask for it but they did have some, luckily. \n\nI started with the teriyaki. It was okay but it could have used more sauce. I thought it was a little dry. The unagi was much better - a good amount of sauce and the flavor was great. Definitely the winner between the two.\n\nThis is more of a grab and go place but there are a few small tables. Considering I can only wish I had a place like this in my town I really can't say anything bad! But besides that it's worth checking out if you want a snack or a light meal.", "rating": 4, "date": "2018-03-06"}, {"excerpts": ["I also ordered a teriyaki chicken onigiri to save for later, but curiosity and fatassery got the best of me. "], "author": "Ashley S.", "review": "Simple, clean, healthy, delicious to-go spot for Japanese onigiri (triangular rice ball snack with filling wrapped in seaweed), caters to the weekday lunch crowd. I think Onigilly might turn out to be one of those places I CRAVE. Well, actually, I already know it is because I went on Friday, and was already wishing they were open on Saturday, the next day, so I could go back (they're open only Mon-Fri). \n\nI couldn't decide between getting a salad bowl or a rice bowl, and discovered with the help of the nice cashier that they can do half salad half rice! I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. Might opt for the Spicy Shrimp or Spicy Bacon next time). \n\nI also ordered a teriyaki chicken onigiri to save for later, but curiosity and fatassery got the best of me. I popped that onigiri to-go box open for \"just a bite\" but ended up inhaling the whole thing despite being full already from the salad/rice bowl.\n\nCan't wait to return to try some of their other offerings!! So. excite. !", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["I stick to the meat options and prefer the Unagi, Spicy Shrimp, Snow Crab, Teriyaki Chicken and Salmon.  \n\n"], "author": "Lon H.", "review": "I've been here a few times and pretty much keep it simple by ordering either a couple onigiri's or the Edamame Set, which comes with 3 onigiri's, Edamame and Daikon.  I grew-up eating onigiri's that my mom used to make for us.  They are a good snack or quick lunch option.  \n\nOnigilly offers a different twist, by using partially milled brown rice, versus the standard white rice my mom used to make.  We had them with or without nori (seaweed) growing-up, but using nori makes them easier to handle.  \n\nTheir menu has a wide selection of flavors, so there's something for pretty much everyone, including those that are gluten-free or vegan.  I stick to the meat options and prefer the Unagi, Spicy Shrimp, Snow Crab, Teriyaki Chicken and Salmon.  \n\nIt's not a large restaurant with very limited seating.  However, don't be surprised to see the line snaked-out the door during lunch.  Needless to say, I typically go after the lunch crowd to avoid the lines.  Make sure to review the large menu board to see the entire menu, including their sets.  The price is right as the Edamame Set is $10 for 3 onigiri's.  I have yet to try their Salad or Rice Bowls, but that will be for a future visit.", "rating": 4, "date": "2016-09-23"}, {"excerpts": ["Gourmet musubi onigiri (rice balls) filled with sushi a tasty assortment of flavors:  teriyaki chicken, unagi, tarako (spicy fish eggs), snow crab, baked salmon, or seaweed.  ", "They place your choice of filling between two triangles of white rice, then wrap it in a sheet of pressed seaweed.  \n"], "author": "Richard H.", "review": "Gourmet musubi onigiri (rice balls) filled with sushi a tasty assortment of flavors:  teriyaki chicken, unagi, tarako (spicy fish eggs), snow crab, baked salmon, or seaweed.  They place your choice of filling between two triangles of white rice, then wrap it in a sheet of pressed seaweed.  \nThis restaurant offers several ways to market their  onigiri:\nEdamame set:  2 choices of onigiri with takuan and edamame.\nZosui set:  1 onigiri and a cup of broth, rice and protein.\nBowl:  three topping over rice, takuan, and edamame", "rating": 4, "date": "2016-04-11"}, {"excerpts": ["I chose the Hijiki (braised seaweed & carrots), teriyaki chicken & salmon. ", "It comes with a side dressing for the salad & some edamame as well. ", "So worth it because you get a little bit of each. ", "It's the size of a chipotle bowl, so ", "it's pretty filling! ", "This is something I've never tried because there's nothing really like this in LA ", "so I'm glad I got to try this place. ", "I want to come back and try the onigilly next time!!"], "author": "Winnie L.", "review": "This place is literally RIGHT next to plentea. They close at 4 and I went in at 3:50 and they were nice enough to let us eat there past 4. Sorry :P I work in food service so I know how you guys felt but we wouldn't have had anywhere else to eat!! \n\nFirst, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\nI got the rice bowl which comes with half rice and half salad. I got to choose 3 onigilly fillings. I chose the Hijiki (braised seaweed & carrots), teriyaki chicken & salmon. It comes with a side dressing for the salad & some edamame as well. So worth it because you get a little bit of each. It's the size of a chipotle bowl, so it's pretty filling! This is something I've never tried because there's nothing really like this in LA so I'm glad I got to try this place. I want to come back and try the onigilly next time!!", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["I ordered 3 of them, teriyaki chicken, bacon, and salmon. ", "My favorites were the chicken and salmon. "], "author": "Ashley A.", "review": "Onigilly is super good! My friends and I were walking around and exploring SF, looking for a place to eat lunch when we walked by Onigilly. The pictures of the rice balls looked so good so we decided to give it a try and we all loved it! The prices are pretty decent, my friends and I spent around $8.00 - $12.00 each, depending on how many rice balls & what combo. \n\nFor those of you who haven't tried it, the rice balls aren't really anything like sushi. Our rice balls were served warm and the meat inside is all cooked. I ordered 3 of them, teriyaki chicken, bacon, and salmon. My favorites were the chicken and salmon. Two definitely would have been enough to fill me up, so if I ever am in SF and decide to stop by, I'll definitely be getting only two.\n\nThey don't have much seating inside, but then again, it's fast food and they serve it in to-go boxes. Also, there were some bugs flying around inside, which was a little irritating, but our food came out quickly and we ate our food elsewhere, so it wasn't much of a problem.\n\nIf you're in SF and looking for a quick, easy, unique lunch, give it a try!!", "rating": 5, "date": "2016-03-06"}, {"excerpts": ["I ordered the eggplant, unagi, and teriyaki chicken. "], "author": "Venna Q. T.", "review": "My coworker took me here for lunch earlier today since she warned that sushiritto would probably have a line. We walked over at around 1 pm and the line was out the door (literally). I was worried but then I realized how small the place is inside and the register is right by the doorway. \n\nThe food is made to order so there will be a bit of a wait. But you just go up, order, and they make your rice balls for you. I was torn because they have so many choices. Not to mention, their three specials, which I'm assuming are seasonal. I love salmon but I hate it with cream cheese in sushi rolls. I love lox with cream cheese though. So it's kind of weird hahaha. Anyway, they had a few other specials but none of them appealed to me. \n\nI ordered the eggplant, unagi, and teriyaki chicken. I was super tempted to order the spicy bacon but I'm glad that I didn't. I love bacon but my other coworker ate it an she said that it was pretty spicy. I have no tolerance for spiciness so I'll remember not to try it. \n\n\nI'll definitely have to come back to try the crab and other meat rice ball (I think it was beef)! It's only a few blocks from work, so I shall return. That and I need to get stamps for my samurai club stamp card! For dessert, they make their own mochi- which looks so good. My coworker got it and she said it was delicious. I'll have to try that next time. Oh and I can't believe I almost forgot... The pickles are so good. I feel like they can almost be too sour but these have more of a hint of sweetness to them. Which makes them amazing with the salty rice balls. Ok, I'm getting hungry writing about them and it's dinner time. Good thing I'm not close by anymore.", "rating": 5, "date": "2014-11-04"}, {"excerpts": ["As for recommendation on orders:\nUnagi ( be careful with bones)\nSalmon\nSnow Crab\nTeriyaki Chicken\nSoboro\nstrawberry mochi: a MUST try, but it's seasonal only."], "author": "Yilin Y.", "review": "I'm a regular at this place and I prefer dinning in if I have time. It's located right next to my school and I go here almost every week between classes. The onigiri are awesome, the service is great, the store is great, EVERYTHING IS WHERE IT SHOULD BE! :D\nThe casher is super nice and would recommend on the onigiri if you couldn't make up your mind. The waiting time of all order is around 3 to 5 minutes, which is another reason why it's great for a quick lunch during class breaks.\nI always order the 3 pieces edamame set if I'm very hungry, and it comes with beans on the side. If I'm just ok-ay hungry, I'd go for the miso soup set, which comes in 2 pieces onigiri and soup on the side. I'm allow to choose almost all type of onigiri to put int the set. They also have japanese tea drinks and soda as well. There's a buy 10 get 1 free set lunch card ( which I always forgot to get :[ ) for discount as well. The total price of lunch often comes down to around $10-15 per person.\nAs for recommendation on orders:\nUnagi ( be careful with bones)\nSalmon\nSnow Crab\nTeriyaki Chicken\nSoboro\nstrawberry mochi: a MUST try, but it's seasonal only.", "rating": 4, "date": "2015-12-19"}, {"excerpts": ["I ordered the onigilly set: miso tuna, teriyaki chicken and spicy bacon. ", "Surprisingly my favorite was the teriyaki chicken. ", "It was tender and had just enough sauce. ", "The miso tuna was bland. ", "The spicy bacon had an odd texture ", "but I liked the spice. ", "I was happy that the onigiri didn't fall apart after the first bite. ", "and it was easy to eat. "], "author": "Ashley C.", "review": "After experiencing a delicious onigiri shop in Southern California last year, I was excited to find one in SF! It's a small little shop among other eateries on Kearny Street. \n\nI read past reviews talking about how the line gets long around noon. We planned to arrive around noon and we were in a time crunch, so I wanted to order ahead online. Unfortunately the service was unavailable. When I arrived, the line was all the way to the back. I waited about 10-15 minutes until I reached the register to order, and our food was ready within 5 minutes after that! We were even lucky enough to snag the only 2 seater table outdoors, which was perfect because we had our puppy with us. \n\nI ordered the onigilly set: miso tuna, teriyaki chicken and spicy bacon. Surprisingly my favorite was the teriyaki chicken. It was tender and had just enough sauce. The miso tuna was bland. The spicy bacon had an odd texture but I liked the spice. I was happy that the onigiri didn't fall apart after the first bite. and it was easy to eat. The set also comes with takuan (pickled radish) and edamame. \n\nI ordered the matcha green tea lemonade. It's an unappealing color due to the matcha but I wanted to try it anyway. It tasted mostly like plain lemonade, although I'm not sure what kind of taste I was supposed to expect. They also offer fresh strawberry mochi. It was tempting but I'm not a fan of red bean so I didn't get it. Wish I did! \n\nThe service was fast and the cashier was very polite. I would definitely come back if I was in the area looking for something quick but healthy and tasty.", "rating": 4, "date": "2014-08-27"}, {"excerpts": ["are Teriyaki chicken, Teriyaki salmon, shrimp tempura & miso soup. ", "I don't eat sushi, I don't eat anything else. ", "I was able to try Onigilly because my husband was doing UberEats. ", "They gave him a free meal for delivering for them ", "so they gave us Teriyaki chicken and salmon Onigilly. ", "I was hesitant at first because I don't like seaweed ", "and I didn't expect it to be in a sushi form, I thought it was going to be a Teriyaki bowl lol. ", "I was surprised by how much flavor both teriyaki and salmon had ", "and it wasn't raw (which is why I don't eat sushi). ", "3 pieces of Onigilly was actually enough. ", "I looked at their menu to see what else they have and it was a simple menu. ", "The portion was just right ", "and it was cheap. ", "They sell the Onigilly by the piece or in a set/meal. ", "I tried their Chicken Karaage (Japanese Fried Chicken) and it was also good. ", "I also tried their shrimp tempura Onigilly and it also had flavor! ", "I am looking forward to trying other food on their menu. ", "I love them. ", "By the way, they are also located on Sansome, Embaracadero & Market."], "author": "Raina J.", "review": "I'd like to make it clear that the only thing I ever eat in any and every Japanese restaurant I go to are Teriyaki chicken, Teriyaki salmon, shrimp tempura & miso soup. I don't eat sushi, I don't eat anything else. I was able to try Onigilly because my husband was doing UberEats. They gave him a free meal for delivering for them so they gave us Teriyaki chicken and salmon Onigilly. I was hesitant at first because I don't like seaweed and I didn't expect it to be in a sushi form, I thought it was going to be a Teriyaki bowl lol. I was surprised by how much flavor both teriyaki and salmon had and it wasn't raw (which is why I don't eat sushi). 3 pieces of Onigilly was actually enough. I looked at their menu to see what else they have and it was a simple menu. The portion was just right and it was cheap. They sell the Onigilly by the piece or in a set/meal. I tried their Chicken Karaage (Japanese Fried Chicken) and it was also good. I also tried their shrimp tempura Onigilly and it also had flavor! I am looking forward to trying other food on their menu. I love them. By the way, they are also located on Sansome, Embaracadero & Market.", "rating": 5, "date": "2017-05-13"}, {"excerpts": ["- MUST TRY: shiitake mushroom, teriyaki chicken, snow crab, spicy shrimp\n- To Avoid : ", "Salmon, its too dry\n- Each onigilly range from $3-$4 each\n- Its simple, healthy, light, quick and reasonably priced lunch"], "author": "Payal B.", "review": "Onigilly is a triangle rice ball filled with happiness :) A great lunch spot in Fidi  \n\n- Gets crowded during lunch hours, so try to be there by 12PM.\n- Great place with vegetarian and vegans options too.  Tyy their shiitake mushroom \n- Must Try - The TRIO , 3 onigilly of your choice with pickel and edemamme $10.\n- Wide variety of fillings to choose from, vegetarian, meat and seafood options.\n- MUST TRY: shiitake mushroom, teriyaki chicken, snow crab, spicy shrimp\n- To Avoid : Salmon, its too dry\n- Each onigilly range from $3-$4 each\n- Its simple, healthy, light, quick and reasonably priced lunch", "rating": 5, "date": "2015-10-30"}, {"excerpts": ["I ordered the teriyaki chicken, tuna, and unagi. ", "I really like the unagi and teriyaki... ", "The tuna I thought would be like the spicy poke or spicy tuna you get in sushi.. ", "It wasn't. "], "author": "Daniella G.", "review": "Delicious place! Different  experience.\n\nI got the edamame set, it came with 3 onigillys, edamame and pickles.. \nI ordered the teriyaki chicken, tuna, and unagi. I really like the unagi and teriyaki... The tuna I thought would be like the spicy poke or spicy tuna you get in sushi.. It wasn't. It was  like a tuna salad type thing which tasted weird with rice.. \n\nThe edamame was good, but cold.. The pickles were a nice touch.\n\nThe service was quick.. There is usually a massive line outside. (Always a good sign).\n\nDefinitely coming back to try other flavors.", "rating": 4, "date": "2016-02-25"}, {"excerpts": ["I get the shrimp tempura, snow crab and teriyaki chicken. "], "author": "Kimberly H.", "review": "This place is small and crowded for a reason.\nOnigilly is BOMB! I get the shrimp tempura, snow crab and teriyaki chicken. I shy away from raw fish because it's really warm in there, and I don't know if the food sitting on the line is cold enough to prevent bacteria or not. \n\nI'm a huge fan of the miso soup, their tofu chunks are huge! Seaweed salad is good. I wish the guy at the front didn't always ask you for a tip, it's awkward. \n\nCatering is excellent. Easy to contact and order, they even deliver if you're in the area! Always a hit in the office.", "rating": 4, "date": "2015-10-28"}, {"excerpts": ["Got the snow crab and the spicy shrimp, teriyaki chicken. ", "This place definitely gives Sushiritto a run for its money because here you get to try more things at once which is a big win win for me. ", "Only complaint is probably the seating, they have an upstairs office it seems ", "but it always seems empty, it would be cool if they could turn it into a seating area for customers."], "author": "Navdeep D.", "review": "Food is ridicously good here. Got the snow crab and the spicy shrimp, teriyaki chicken. This place definitely gives Sushiritto a run for its money because here you get to try more things at once which is a big win win for me. Only complaint is probably the seating, they have an upstairs office it seems but it always seems empty, it would be cool if they could turn it into a seating area for customers.", "rating": 4, "date": "2016-08-11"}, {"excerpts": ["I recommend everything, from spicy shrimp to teriyaki chicken, snow crab, and them best of all was the miso soup! ", "Awesome food guys!"], "author": "Deo I.", "review": "I live all the way from peninsula but I usually come here just to get an Onigilly. I recommend everything, from spicy shrimp to teriyaki chicken, snow crab, and them best of all was the miso soup! Awesome food guys!", "rating": 5, "date": "2016-10-01"}, {"excerpts": ["The fillings I chose were teriyaki chicken, miso tuna and eel. ", "All 3 were delicious, especially the eel one (even more so after sprinkled with shichimi spices). ", "The volume looked a bit small at first, but turned out to be perfect as I didn't feel hungry the entire afternoon. ", "Definitely coming back later to try out some of the fancier flavors."], "author": "Da W.", "review": "With the generous amount of filling, it's made more like a sandwich with the bread slices substituted with triangular chunks of rice than an onigiri XD But it was really good lunch food.\n\nHad the edamame set that comes with 3 onigiris. The fillings I chose were teriyaki chicken, miso tuna and eel. All 3 were delicious, especially the eel one (even more so after sprinkled with shichimi spices). The volume looked a bit small at first, but turned out to be perfect as I didn't feel hungry the entire afternoon. Definitely coming back later to try out some of the fancier flavors.", "rating": 4, "date": "2016-01-08"}, {"excerpts": ["I ordered 6 onigiri:\nSnow crab\nMiso tuna\nSpicy tuna\nSpicy bacon\nTeriyaki chicken\nMiso Nasu\n\n", "I definitely LOVE SNOW CRAB!", "! ", "You MUST try one if it's your first time here. ", "I wanted unagi and salmon ", "but it ran out", "--they're really popular here. ", "My boyfriend agrees along with terayaki chicken. ", "I'm going to come back for unagi, salmon, snow crab, and teryaki chicken next time!"], "author": "Jackie T.", "review": "I literally to this onigiri shop from work and a sweet employee lets me in at the last 3 minutes before closing! Whew! It was my first time trying it out! \nThe man was patient and friendly with my orders, he helped me reccomend the items that were available at the moment. I love how the staff's vibe is so welcoming and cheerful! \n\nI ordered 6 onigiri:\nSnow crab\nMiso tuna\nSpicy tuna\nSpicy bacon\nTeriyaki chicken\nMiso Nasu\n\nI definitely LOVE SNOW CRAB!! You MUST try one if it's your first time here. I wanted unagi and salmon but it ran out--they're really popular here. My boyfriend agrees along with terayaki chicken. I'm going to come back for unagi, salmon, snow crab, and teryaki chicken next time!", "rating": 5, "date": "2015-08-05"}, {"excerpts": ["I ordered three of their onigilly: snow crab, salmon, and teriyaki chicken. ", "My friend ordered the miso nasu (eggplant). ", "The eggplant was the tastiest of all; the snow crab and the salmon lacked flavor. \n\n"], "author": "Jason C.", "review": "I'm a fan of Japanese cuisine, so I thought I would try this sushi-cum sandwich outfit. The prices were a bit high, but then again, this is San Francisco, and in the Financial District no less, so the prices were more or less in line with what one might expect to pay for lunch in the area. The staff were friendly, and the cashier hands you back your credit card with two hands,  which I'm told is Japanese custom (they do it at Uniqlo too).\n\nI ordered three of their onigilly: snow crab, salmon, and teriyaki chicken. My friend ordered the miso nasu (eggplant). The eggplant was the tastiest of all; the snow crab and the salmon lacked flavor. \n\nIf you are looking for a unique lunch experience, it's worth a try. A harder sell for more than one return visit.", "rating": 3, "date": "2015-08-15"}, {"excerpts": ["I got the Onigilly Set that comes with 3 onigiri rice rolls (I got grilled salmon, teriyaki chicken and bacon) and a side of edamame for a total $11. ", "Since the rice roll fillers have so much flavor they do not recommend using soy sauce "], "author": "Allie B.", "review": "What is an onigiri you ask? Imagine if a Sushi Hand Roll mated with one of those little Triangle Sandwiches that old ladies serve at tea time... They would produce an onigiri. Replace the bread of the sandwich with triangle shaped brown rice, fill it with some sort of flavorful veggie/meat/seafood  filling and wrap it in seaweed ... Voila! Onigiri! \n\nIt was my first time hitting this spot for lunch and I am in love! The staff is extremely friendly and the food satisfied my sushi craving. I got the Onigilly Set that comes with 3 onigiri rice rolls (I got grilled salmon, teriyaki chicken and bacon) and a side of edamame for a total $11. Since the rice roll fillers have so much flavor they do not recommend using soy sauce but instead they have sea salt, chili powder and sesame seeds that you can add on the side for more flavor or spice.\n\nI highly recommend this Japanese take on triangle sandwiches!", "rating": 5, "date": "2014-09-04"}, {"excerpts": ["teriyaki chicken ... ", "salmon -- these are my top three for my perfect lunch/dinner."], "author": "Juv C.", "review": "I'm a fan.  Big fan.  Since the day I had my first one at OTG, I was hooked.  And now they have a restaurant just a hop skip and a jump away from me -- love.\n\nSpicy shrimp ... teriyaki chicken ... salmon -- these are my top three for my perfect lunch/dinner.", "rating": 4, "date": "2013-01-10"}, {"excerpts": ["My favorite are Soboro, Teriyaki chicken and shiitake.  "], "author": "Daniela B.", "review": "If I could I would give more than 5 stars! I absolutely love this place and the staff is super nice. Their onigilly rice ball wraps are very yummy and inexpensive.  My favorite are Soboro, Teriyaki chicken and shiitake.  The miso soup is delicious too.\n\nYou should absolutely try this place if you are in the are.", "rating": 5, "date": "2014-06-18"}, {"excerpts": ["I had the teriyaki chicken one, which was moist and delicious. ", "I had the eggplant one, which was probably my favorite. "], "author": "Marissa K.", "review": "I walked by Onigilly today, and my husband and I thought it looked good. I have been hearing about the wonder of rice balls for so long that I had to try them.\n\nMy husband doesn't like sushi, but he agreed to indulge me and try the rice balls. Both of us were glad he did.\n\nI had the teriyaki chicken one, which was moist and delicious. I had the eggplant one, which was probably my favorite. And I had the tempura shrimp one, which was good, but probably my least favorite of the three (I would still eat it again though). The seaweed salad was the best I ever had. The little side salad that comes on the plate is delicious, with a spicy dressing and mixed greens. The chicken is organic. They serve Frog Hollow peaches. Seriously? And oh  yeah, it was $9.\n\nI wish I worked downtown so I could eat Onigilly every day.", "rating": 5, "date": "2012-09-10"}, {"excerpts": ["kamikaze tacos:\nteriyaki chicken - chicken was cooked just right with a subtle hint of teriyaki. "], "author": "Barry H.", "review": "i remember walking past them at off the grid once and thought, \"brown rice? no thanks, next\"... anyways, i stumbled upon their kearny st location while looking for a place to eat dinner... walking in, my expectations weren't very high... brown rice??? in the end, i was surprised, here's what we ate...\n\nstarter:\nsteamed clams - wasn't feeling the ipa garlic butter soy for some reason... the good thing is that the food got better.\n\n\nkamikaze tacos:\nteriyaki chicken - chicken was cooked just right with a subtle hint of teriyaki. of the 4 tacos we tried, this one was my favorite.\n\nspicy bacon - this one was good, but pretty spicy, avoid if you don't like heat.\n\nkani - only took a bite, crab meat was fresh.\n\nspicy shrimp - couldn't really taste the shrimp much on this one, and again, spicy means spicy... but not as much as the bacon\n\nonigilly karaage slider - overall, i would say that this was the best of everything we ordered.\n\n\nto end it:\nus kobe tataki - very tasty", "rating": 4, "date": "2013-10-03"}, {"excerpts": ["Tried the miso tuna salad, teriyaki chicken, and spicy garlic bacon. ", "Mmmm. ", "I could have had 3 of just those garlic bacon ones. ", "Looking forward to trying them again."], "author": "Miffy Y.", "review": "Their food truck was at the J-Pop festival so I tried the lunch special. $8 for 3 onigiri and edamame (guess they were out of pickled ginger at the time?). I thought it was kind of expensive for what seemed like a small amount of food, but it was surprisingly filling. Tried the miso tuna salad, teriyaki chicken, and spicy garlic bacon. Mmmm. I could have had 3 of just those garlic bacon ones. Looking forward to trying them again.", "rating": 3, "date": "2012-09-07"}, {"excerpts": ["The shrimp tempura, teriyaki chicken, and eggplant onigiri were good.  ", "I was disappointed with the spicy shrimp tho...needs a bit more flavor.  ", "I found the portion meager (only 1 shrimp tempura?  ", "really?), ", "but overall tasted good and didn't feel too heavy ", "even tho ", "it's a lot of rice consumption (at least it's brown rice).  "], "author": "C A.", "review": "Not bad.  The shrimp tempura, teriyaki chicken, and eggplant onigiri were good.  I was disappointed with the spicy shrimp tho...needs a bit more flavor.  I found the portion meager (only 1 shrimp tempura?  really?), but overall tasted good and didn't feel too heavy even tho it's a lot of rice consumption (at least it's brown rice).  The line gets long around noon, but if you go a little earlier it's fine.\n\nI usually go with the onigiri, but the rice bowl is good too.\n\nNot much seating, more of a to go place.", "rating": 3, "date": "2012-12-01"}, {"excerpts": ["I got the edamame set with spicy shrimp, teriyaki chicken, and spicy kogi.  ", "I was pleasantly full and enjoyed the flavors greatly! ", "Will be back soon!"], "author": "Obar L.", "review": "Great little place that serves a variety of onigilly! I got the edamame set with spicy shrimp, teriyaki chicken, and spicy kogi.  I was pleasantly full and enjoyed the flavors greatly! Will be back soon!", "rating": 5, "date": "2015-04-07"}], "spicy bacon": [{"excerpts": ["Here are some other options:\n- Teriyaki Tofu\n- Renkon (Spicy Lotus Root)\n- Shiitake\n- Spicy Bacon\n- Spicy Miso Beef\n- Unagi (Eel)\n- Grilled Salmon\n- Tempura Shrimp\n\nBesides the rice rolls, they offer salads and soup. "], "author": "Kathy Z.", "review": "I happened to be at Super Duper Burgers and looked up and, BAM, it was love at first sight. Right across the street was Onigilly. I am a huge fan of gourmet rice balls, so I raced over to give this place a try.\n\nI must admit, I wasn't blown away by the menu. Nothing I haven't seen elsewhere, and definitely nothing innovative. These \"onigiri\" rice balls are shaped into a triangle. No, this does not qualify as \"sushi.\" Everything is made with brown rice. I'm not a fan of brown rice elsewhere, but here it's quite sweet and good. Definitely a fan of how they prepare the onigiri. Each one is made to order, so expect to wait for your food. Lots of vegan and gluten-free options, too.\n\nThe ordering system here is not fun. The little shop gets so crowded that the few seats available can't even be used. You'll likely become incredibly cramped and uncomfortable. There's no real line for ordering and picking up, so patrons just curve toward the inside of the shop and it's a struggle to walk in or out.\n\nI went with the Snow Crab for $3.45 -- simple, fresh, and with lemon aioli. Yes, this is real crab meat. For the price, it's a little high-end. In general, the rice balls will run you between $2.76 and $3.75, before taxes. However, I'd expect 2-3 to fill you up and that's not too bad for a nice lunch. I devoured my Snow Crab rice ball in seconds.\n\nHere are some other options:\n- Teriyaki Tofu\n- Renkon (Spicy Lotus Root)\n- Shiitake\n- Spicy Bacon\n- Spicy Miso Beef\n- Unagi (Eel)\n- Grilled Salmon\n- Tempura Shrimp\n\nBesides the rice rolls, they offer salads and soup. They also do small dishes like edamame and fried chicken karaage. There's even organic matcha lemonade.\n\nExpect a 3.5% mandate surcharge \"to help offset the additional regulatory costs of doing business in San Francisco.\" Yeah, yeah, yeah.", "rating": 4, "date": "2018-07-31"}, {"excerpts": ["Got the rice bowl with teriyaki chix, spicy bacon, and soboro for the leech ", "but he said it was too spicy and didn't eat a whole lot. ", "So like I said I'll probably not go for those flavor in onigiri form either. "], "author": "Quynh Nhu D.", "review": "There is something about that salt. \n\nLook man, I'm simple. Once I find something I like to eat I often crave it and seek it out. And that one thing is onigiri. Been on the hunt for some good onigiri grub eventhough I can technically make them myself, the simple one anyways. So when I moved to the area I was hype to see Onigilly and had it bookmarked. \n\nRecently realize Onigilly is a few steps away from my favorite boba place, so finally decided to seek it out. I tend to prefer seafood so I'll probably never get the chicken or the pork:\n\n3. Salmon: very basic onigiri filling, though not as good as I've hoped. Sort of bland. I mean it's salmon but its not OOMPH salmon. Will pass next time. Or perhaps spicy salmon would have been a better choice: IF that was available, which it is not. Yet.\n\n2. Snow crab: damn girl now you talking my language. Shhh so good. So addicting. Taste fresh, perfectly seasoned, beautiful with every bite. Always a go to.\n\n1. SPICY SHRIMP: this. is. everything. As tasty as the snow crab, the spicy shrimp is a whole nother level of deliciousness. A must get if you're sane. Addicting, I love everything about this. Could eat it all day. \n\nGot the rice bowl with teriyaki chix, spicy bacon, and soboro for the leech but he said it was too spicy and didn't eat a whole lot. So like I said I'll probably not go for those flavor in onigiri form either. Skip skip skip\n\nAlthough the leech did enjoy his zosui chix so maybe something I'll try myself next time. \n\nOnigiri aside: THE salt and pepper seasoning (???) on the side that you can get yourself is AMAZEBOMB. \nLike ok this is how pathetic I am: I buy my onis then get like 2 thing of the salt and the pepper seasoning and then I HOARD that shjt and eat it with my onigiri at home AND I got some extra so I'll be sprinkling it all over my own rice and my own seaweed and I am obsess with it. Someone tell me if they sell this or where I can get my own giant bottle because I need to put this on all my food. Thanks!\n\nService is quick. No hassle. Its only long wait when you're waiting behind indecisive customers. Them onigiri are make quickly though and for the seafood ones I've seen them really pilling it on. I don't see any skimping vs the way other reviews tell 'em. So I'm very happy with the proportion of filling to rice. Perfect. Love it.\n\nOnly sadness is the hour is not long enough. I guess they cater to the working hours. Q.Q But I get out so late and on my off days I wake up at 3pm how am I gonna make it there in time. T.T Also close on weekends? And holidays (them mondays holidays) as well? Why hast thou forsaken me, I want my onigiriiiii", "rating": 4, "date": "2018-03-04"}, {"excerpts": ["Me and a friend ended up with 6 different onigilly (SOBORO, SPICY SHRIMP, SNOW CRAB, SPICY BACON, CHICKEN TERIYAKI, SALMON) and a TOFU ZOSUI. ", "It came out really fast! ", "Great for those who want a quick lunch! ", "By far my favorite was the snow crab!!! ", "It was super tasty and reminded me a little bit of a lion king roll with the mayo base they use (totally missing everything else though haha). ", "Next up would have to be the spicy shrimp. ", "I think it's hard to go outside of seafood for something that's basically a hand roll on steroids, but my 3rd option would have to be the soboro. ", "Kind of like a rice stew thing. "], "author": "Daniel O.", "review": "OMESSHHHHIIIIIIIIIIIII~\n\nCame here today for lunch for the first time! Walked in a little bit before the rush and was able to order pretty quickly. The menu looked pretty simple but with a lot of items I wasn't used to. \n\nMe and a friend ended up with 6 different onigilly (SOBORO, SPICY SHRIMP, SNOW CRAB, SPICY BACON, CHICKEN TERIYAKI, SALMON) and a TOFU ZOSUI. It came out really fast! Great for those who want a quick lunch! By far my favorite was the snow crab!!! It was super tasty and reminded me a little bit of a lion king roll with the mayo base they use (totally missing everything else though haha). Next up would have to be the spicy shrimp. I think it's hard to go outside of seafood for something that's basically a hand roll on steroids, but my 3rd option would have to be the soboro. Kind of like a rice stew thing. Loved it!!\n\nLike I said earlier, OMESHIIIIIIIIIII~", "rating": 4, "date": "2018-02-27"}, {"excerpts": ["Will be back to try the spicy bacon, beef, and maybe another seafood onigilly."], "author": "Fanny W.", "review": "I feel like a damn onigilly after eating here, tummy full of rice. But hey, can't go wrong with affordable and decent lunches.\n\nPros:\n+ Costs ~$3 to fill up on rice triangles and protein\n+ Not too heavy of a lunch...\n+ Yet filling...mm saucy rice\n+ Compostable take-out containers, yay!\n\nCons:\n- Small space, more of a grab and go spot\n\nWhat I Got:\n- Teriyaki Chicken, 3/5; kinda bland\n- Salmon, 3/5; lacks flavor, tastes healthy though\n\nNot exactly impressed since the triangles I ordered were a bit bland (and that's saying a lot for someone who isn't much of a sauce person), but the rice is freaking yummy! Onigilly came with edamame and ginger, not sure if it's because got the trio combo (I think so).\n\nWill be back to try the spicy bacon, beef, and maybe another seafood onigilly.", "rating": 3, "date": "2017-12-12"}, {"excerpts": ["Might opt for the Spicy Shrimp or Spicy Bacon next time). \n\n"], "author": "Ashley S.", "review": "Simple, clean, healthy, delicious to-go spot for Japanese onigiri (triangular rice ball snack with filling wrapped in seaweed), caters to the weekday lunch crowd. I think Onigilly might turn out to be one of those places I CRAVE. Well, actually, I already know it is because I went on Friday, and was already wishing they were open on Saturday, the next day, so I could go back (they're open only Mon-Fri). \n\nI couldn't decide between getting a salad bowl or a rice bowl, and discovered with the help of the nice cashier that they can do half salad half rice! I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. Might opt for the Spicy Shrimp or Spicy Bacon next time). \n\nI also ordered a teriyaki chicken onigiri to save for later, but curiosity and fatassery got the best of me. I popped that onigiri to-go box open for \"just a bite\" but ended up inhaling the whole thing despite being full already from the salad/rice bowl.\n\nCan't wait to return to try some of their other offerings!! So. excite. !", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["Unagi\nSnow Crab\nSpicy Bacon \n\nThis is an easy lunch and "], "author": "Mandi H.", "review": "Onigilly is one of those brainless lunch spots. When I can't decide where to eat, there's a good chance I will end up here. Even when the line is out the door, it moves quickly because people are in and out in minutes. They are known for their seaweed wrapped \"rice balls\" which which can be purchased individually or in a set. I usually order the edamame set, which comes with 3 rice balls and a side of cold edamame.\n\nMy favorites include:\nTempura Shrimp (only available at Kearny location!)\nUnagi\nSnow Crab\nSpicy Bacon \n\nThis is an easy lunch and I like picking this up when I just want to grab something quick. I have tried the rice bowl, which comes with 3 toppings over a bed of rice but it just wasn't the same. I enjoy the rice balls significantly more, must be the seaweed! Worth trying if you are in the area!", "rating": 4, "date": "2017-03-02"}, {"excerpts": ["A few that I have tried are: Snow Crab, Spicy Shrimp, Salmon, and Spicy Bacon. ", "Of all that I have tried, the spicy bay shrimp is the best- especially if you enjoy spicy food! "], "author": "Ingrid E.", "review": "Onigilly is a great place to go to for a quick healthy bite. There's something on the menu for everyone. A few that I have tried are: Snow Crab, Spicy Shrimp, Salmon, and Spicy Bacon. Of all that I have tried, the spicy bay shrimp is the best- especially if you enjoy spicy food! It has the perfect amount of spice, but it isn't too overpowering where it becomes too spicy to enjoy. \n\nI'm very fortunate this location isn't too far from my work because I plan on coming back to try the rice bowls, salad bowls and even the miso soup combination which comes with 2 onigilly. \n\nService has always been great as usual. Keep up the great work!", "rating": 5, "date": "2017-01-25"}, {"excerpts": ["I also got the spicy bacon which was actually pretty spicy and packed with flavor. ", "The seaweed salad was really good as well "], "author": "Sophia Y.", "review": "I wanted to try out this place for lunch as it was kind of like sushi (which I love) but is different. I got the Wakame Set which came with 2 on onigilly and a side of seaweed salad. I got the miso tuna which was pretty good. Not as much miso flavor as I had hoped. I also got the spicy bacon which was actually pretty spicy and packed with flavor. The seaweed salad was really good as well and I'm glad I got that set.\n\nOverall, it's pretty much filling of your choice inside a rice ball (or triangle), but it's pretty good. I think I still prefer sushi as this is mostly rice.", "rating": 3, "date": "2017-05-15"}, {"excerpts": ["Veggie worries\nMenu party\nPumpkin Curry\n\nGive me one more\nSpicy Bacon\nDiet fitness\n"], "author": "Ringo M.", "review": "Onigilly\nOn the really\nRice ball circus\nPiccadilly\n\nRice so fluffy\nSeaweed cuddle\nThree in one box\nRice ball huddle\n\nSalmon all cooked\nNo wasabi\nSoy based protein\nEdamame\n\nHipster diet\nVeggie worries\nMenu party\nPumpkin Curry\n\nGive me one more\nSpicy Bacon\nDiet fitness\nGot forsaken\n\nThis not sushi\nThis not bougie\n10 young moneys\nThat Lil TuneChi", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["marinated in garlic ginger, definitely my favorite with soft and room temp eggplant\n+   Soboro- ginger honey beef, a little on the sweet side, but very flavorful\n+   Spicy bacon\n\n"], "author": "Alice T.", "review": "Great lunch spot during the workweek. Line is usually about 10-15 mins around noon. A great alternative to having Sushiritto again.\n\nThree of these rice triangles are all you need for a filling lunch. Each one is made of filling sandwiched between two triangles of rice and wrapped in seaweed. Prices range from $2.50-3.50 each. \n\n++ Eggplant- marinated in garlic ginger, definitely my favorite with soft and room temp eggplant\n+   Soboro- ginger honey beef, a little on the sweet side, but very flavorful\n+   Spicy bacon\n\nOnly thing I would want is some more texture in the filling. Everything is pretty soft and texturally similar where you can sometimes confuse what fillings you're eating.\n\nNot much seating- maybe 6 tables. If you're coming with a group, it's probably better to get it to-go.\n\nNo more reward card. :(", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["Love the ume (very traditional) and the spicy bacon (not at all traditional but yummy). "], "author": "Mi M.", "review": "My (Japanese) Mumsy used to make onigiri for us on our Sunday picnics - sort of Japanese version of a sandwich. Of course, these don't come close (you can't beat mother's home-made), but I did a little skip of joy when I saw this was so close to my new workspace. \n\nAND, they have natto - it's an acquired taste...a funky, fermented bean product that has viscous texture and smells like old socks. SO delicious, oddly enough (and high in Vitamin K, if you're interested). Love the ume (very traditional) and the spicy bacon (not at all traditional but yummy). I like it with takuan (the yellow pickled daikon) and the edamame. \n\nI also  tried the hot soba noodles with one shrimp tempura. The broth has great \"umami\" (yes, an overused word), and with a single onigiri, is a filling lunch.", "rating": 4, "date": "2017-01-27"}, {"excerpts": ["I was super tempted to order the spicy bacon ", "but I'm glad that I didn't. ", "I love bacon but my other coworker ate it an ", "she said that it was pretty spicy. ", "I have no tolerance for spiciness "], "author": "Venna Q. T.", "review": "My coworker took me here for lunch earlier today since she warned that sushiritto would probably have a line. We walked over at around 1 pm and the line was out the door (literally). I was worried but then I realized how small the place is inside and the register is right by the doorway. \n\nThe food is made to order so there will be a bit of a wait. But you just go up, order, and they make your rice balls for you. I was torn because they have so many choices. Not to mention, their three specials, which I'm assuming are seasonal. I love salmon but I hate it with cream cheese in sushi rolls. I love lox with cream cheese though. So it's kind of weird hahaha. Anyway, they had a few other specials but none of them appealed to me. \n\nI ordered the eggplant, unagi, and teriyaki chicken. I was super tempted to order the spicy bacon but I'm glad that I didn't. I love bacon but my other coworker ate it an she said that it was pretty spicy. I have no tolerance for spiciness so I'll remember not to try it. \n\n\nI'll definitely have to come back to try the crab and other meat rice ball (I think it was beef)! It's only a few blocks from work, so I shall return. That and I need to get stamps for my samurai club stamp card! For dessert, they make their own mochi- which looks so good. My coworker got it and she said it was delicious. I'll have to try that next time. Oh and I can't believe I almost forgot... The pickles are so good. I feel like they can almost be too sour but these have more of a hint of sweetness to them. Which makes them amazing with the salty rice balls. Ok, I'm getting hungry writing about them and it's dinner time. Good thing I'm not close by anymore.", "rating": 5, "date": "2014-11-04"}, {"excerpts": ["It is really flavorful and my favorite is the spicy bacon which tastes like beef jerky!"], "author": "Brittany L.", "review": "First of all, let me just say that this is the best place to come for lunch in the financial district! \n\nDuring lunch rush, it is a deeply long line but is somewhat fast! It is a great location cause you can get a drink right next door! \n\nWhat I usually order from here is the rice bowl set which includes the 3 toppings of any sort that belongs in the rice ball, side of salad, and pickles. The price varies on how much that piece of topping is. It is really flavorful and my favorite is the spicy bacon which tastes like beef jerky!", "rating": 5, "date": "2016-07-09"}, {"excerpts": ["There's a lot of options, but here are the onigiri I've tried:\n- spicy bacon: sounds weird, but it is actually quite delicious; note that this is definitely one of the greasier options\n"], "author": "Brittany C.", "review": "I love onigiri. Even though I know better (high school Japanese, anyone?), I have a tendency to refer to it as \"triangle sushi.\" But seriously, something about the rice (not quite sushi rice, it seems) and the filling (usually salmon or another delicious fish) put together into a little triangular package is so delicious. And Onigilly is a great place to get your onigiri fix in Financial District. The lunch line is long, but fast, and the employees are super friendly.\n\nThe way it works is you can order a set of 3 onigiri for $9 (there's also rice bowls, which I hear are delicious as well). There's a lot of options, but here are the onigiri I've tried:\n- spicy bacon: sounds weird, but it is actually quite delicious; note that this is definitely one of the greasier options\n- snow crab: a lighter taste of delicious fresh crabmeat; rounds out the greasiness of other options\n- salmon: probably the most \"traditional\" onigiri; tastes like fresh salmon and a bit of japanese mayo\n- unagi: if you love eel like I do, you'll love this one; tastes like an unagi nigiri at a great sushi place, but with more unagi!\n\nThe portions are decent (but not huge) and they aren't skimpy with the filling. If you're eating in, enjoy your onigiri with some free barley tea.", "rating": 4, "date": "2014-09-23"}, {"excerpts": ["I ordered the onigilly set: miso tuna, teriyaki chicken and spicy bacon. ", "Surprisingly my favorite was the teriyaki chicken. ", "It was tender and had just enough sauce. ", "The miso tuna was bland. ", "The spicy bacon had an odd texture ", "but I liked the spice. ", "I was happy that the onigiri didn't fall apart after the first bite. ", "and it was easy to eat. "], "author": "Ashley C.", "review": "After experiencing a delicious onigiri shop in Southern California last year, I was excited to find one in SF! It's a small little shop among other eateries on Kearny Street. \n\nI read past reviews talking about how the line gets long around noon. We planned to arrive around noon and we were in a time crunch, so I wanted to order ahead online. Unfortunately the service was unavailable. When I arrived, the line was all the way to the back. I waited about 10-15 minutes until I reached the register to order, and our food was ready within 5 minutes after that! We were even lucky enough to snag the only 2 seater table outdoors, which was perfect because we had our puppy with us. \n\nI ordered the onigilly set: miso tuna, teriyaki chicken and spicy bacon. Surprisingly my favorite was the teriyaki chicken. It was tender and had just enough sauce. The miso tuna was bland. The spicy bacon had an odd texture but I liked the spice. I was happy that the onigiri didn't fall apart after the first bite. and it was easy to eat. The set also comes with takuan (pickled radish) and edamame. \n\nI ordered the matcha green tea lemonade. It's an unappealing color due to the matcha but I wanted to try it anyway. It tasted mostly like plain lemonade, although I'm not sure what kind of taste I was supposed to expect. They also offer fresh strawberry mochi. It was tempting but I'm not a fan of red bean so I didn't get it. Wish I did! \n\nThe service was fast and the cashier was very polite. I would definitely come back if I was in the area looking for something quick but healthy and tasty.", "rating": 4, "date": "2014-08-27"}, {"excerpts": ["I ended up ordering a salad bowl with toppings of their spicy shrimp, spicy bacon, and snow crab. ", "I also ordered a matcha green tea lemonade with the food. ", "The snow crab tasted a bit off, and the spicy shrimp was just okay. ", "The only thing I liked was the spicy bacon. ", "Some of the salad greens at the bottom of the bowl were bruised.... "], "author": "Ava F.", "review": "This place is literally a block away from my work so I always pass by this restaurant. Finally decided to give this a try. The cashier was really nice, genuinely friendly and eager to help this first timer. I ended up ordering a salad bowl with toppings of their spicy shrimp, spicy bacon, and snow crab. I also ordered a matcha green tea lemonade with the food. The wait wasn't long as I went in just a little after 11 am. \n\nThe matcha green tea lemonade is interesting. It tastes mostly like lemonade, but it's got a slight matcha after taste. Not too bad. Terms of food, I should've stuck with their onigilly's or gotten a rice bowl. The cold food did not go too well with greens. The snow crab tasted a bit off, and the spicy shrimp was just okay. The only thing I liked was the spicy bacon. Some of the salad greens at the bottom of the bowl were bruised.... boo :(\n\nIf I could give 3.5 stars I would.", "rating": 4, "date": "2015-02-23"}, {"excerpts": ["I went for the Spicy Bacon with garlic butter and chili paste and the Soboro, the ginger-honey-braised angus beef option ", "(photo: http://bit.ly/1gYi1VP). "], "author": "Ed U.", "review": "Egad! There's that name again, the one I hate because it plays up the stereotype that we roll our r's into l's. I no talk right that. No tickee, no lice ball. So solly. Why not cast us all in a WWII propaganda film raising our bayonets and shouting \"Banzai!\" Am I making too big a deal over a name? Probably not. I was just watching \"Gentleman's Agreement\", and anti-Semitism in that movie starts with a tasteless joke. Perhaps the Yellow Peril resurfaces with a single rice ball. It's onigiri, my friends...with an 'r', not an 'l'. But you want to know about the rice balls, not my balls, right?\n\nAnyway, this was once a nondescript pop-up cart that showed up at the Heart of the City Farmers' Market, and now there's a spot in that alley of shame next to the Hyatt Regency and this larger, sit-down spot on Kearny. I noticed they sell lunch sets, which I assume to be bento-like creations but not really. But it was kind of a deal, $9.95 for two rice balls and a bowl of noodle soup (photo: http://bit.ly/1lAqfot). I went for the Spicy Bacon with garlic butter and chili paste and the Soboro, the ginger-honey-braised angus beef option (photo: http://bit.ly/1gYi1VP). They are prepared Chipotle-style in rote assembly fashion, and while the ingredients lent some interesting flavors, the execution not so much.\n\nThe rice balls at least were decent albeit unmemorable lunchtime fare, but the Tofu Noodle Soup was a rather drab concoction purportedly made of all-natural ingredients including the noodles made of \"tofu-yam\" whatever that is. The miso itself was too milky for my taste, and the only ingredients I enjoyed in the broth were the shiitake mushrooms and the seaweed (photo: http://bit.ly/1sJoQQ9). The whole experience always makes me miss my mom who was a true onigiri master with more traditional fillings usually involving daikon or natto (which they do offer here). But if you need a faux-fix, you can overlook the rolling r's and give at least the rice balls a try.\n\nFOOD - 3 stars...rice balls Chipotle-style but avoid the noodle soup\nAMBIANCE - 3 stars...not much to it, grab a table when you can\nSERVICE - 2.5 stars...not as nice as you would think...oh, that's right, we're not in J-Town\nTOTAL - 3 stars...\"Rice balls!\", said the Queen, \"If I had them, I'd be King!\"", "rating": 3, "date": "2014-05-18"}, {"excerpts": ["This place also doesn't have the usual meats, but instead have spicy bacon, snow crab, and soboro.\n\n\n"], "author": "Jonathan B K.", "review": "A small lunch spot in the Chinatown area. Great if:\n\n1) you want something you can eat on the go. The small rice balls with meat are easy to eat and come with edamame if you choose the combo, which I think is a good deal.\n\n2) like a variety of items in one meal. I like that I can mix and match vegetables and meat in one order. This place also doesn't have the usual meats, but instead have spicy bacon, snow crab, and soboro.\n\n\nIt's not so great if:\n\n1) you have a party of larger than 4 people. There's no space in there.\n\n2) you don't like rice, The ratio of rice to meat is astounding; you're likely to get full off of the rice alone.\n\nI asked the cashier what was popular/good, and she basically listed everything on the menu, which was funny but not entirely helpful haha. Overall, the food is not likely to blow you away, and nothing about the meal warranted a return either.", "rating": 3, "date": "2016-12-27"}, {"excerpts": ["Get the popular miso tuna, the spicy bacon or one of their seasonal veggies.\n\n"], "author": "Nikki M.", "review": "Remember when they were just a food cart? Well it's no surprise the tasty treats of Onigilly were able to make it to the brick and mortar. I've been coming since they opened and I'm always impressed at the friendliness of the staff, especially the gentleman at the register who hands me my credit card back oh-so-formally like they did in Japan. Plus, it's a relatively fast and healthy option (although, like Emily C. mentioned, they could up their filling to rice quotient).\n\nPerhaps my affinity for this place is a little biased... it reminds me of studying abroad in Japan, saving up my food stipend for gifts for my family and friends back home and subsisting only on the onigilly from 7-11 or Mini-Stop. Those were the days.\n\nGet the popular miso tuna, the spicy bacon or one of their seasonal veggies.\n\nAlso, many options are GF. Pro-tip!", "rating": 4, "date": "2015-07-25"}, {"excerpts": ["I decided to get the Onigilly combo with Spicy Bacon musubi, Tarako musubi and Miso Eggplant musubi. ", "While waiting, I got some of their mugicha (barley tea) "], "author": "Sara C.", "review": "Good Asian food is difficult to come by in this city, and sometimes it gets frustrating. Sure, it's a first world problem, but as someone who has been raised on Japanese food for most of her life, not being able to find a restaurant with authentic Japanese food is like being homesick... except it's your stomach that's crying.\n\nA couple of friends and I met up here when it was surprisingly not crowded, especially for a weekday lunch. I decided to get the Onigilly combo with Spicy Bacon musubi, Tarako musubi and Miso Eggplant musubi. While waiting, I got some of their mugicha (barley tea) which, oh my goodness, tasted so authentic.\n\nMy musubi came out really quickly, and though they looked great... they were uber triangular, which was a little strange. Regardless, the filling inside the musubi was REALLY fresh, though sometimes it was a little strong, especially in the Tarako musubi.\n\nMy favorite out of the three was the Miso Eggplant -- a little unfair since I LOVE both miso and eggplant. I was still very satisfied with the food (a tad expensive, at $11 for a combo). \n\nAh! If only Onigilly were in L.A. so I could try all of the other different flavors. Perhaps I can squeeze in one more visit before I move back...", "rating": 4, "date": "2014-08-07"}, {"excerpts": ["I went back to try the spicy bacon, unagi, and tempura shrimp. ", "The unagi was the best of the three, but I was disappointed that the tempura shrimp came with only one piece of tempura sandwiched between the rice. ", "The tempura:rice ratio was way off and left me feeling unsatisfied."], "author": "Gabrielle G.", "review": "If there's a long line, don't worry. It goes fast!\n\nI ordered the crab, beef, and roe. Bear in mind that these are larger than traditional onigiri. I saw some reviews mention there was too much mayo in the crab, but I didn't think so at all. It was just enough to keep the filling together. Pork was a solid, delicious choice. Roe was salty with a bit of spice.\n\nI was surprised by how crispy and juicy their karaage were. I'll definitely be coming back to try the other onigiri--and for any random karaage cravings.\n\nEdit:\n\nI went back to try the spicy bacon, unagi, and tempura shrimp. The unagi was the best of the three, but I was disappointed that the tempura shrimp came with only one piece of tempura sandwiched between the rice. The tempura:rice ratio was way off and left me feeling unsatisfied.", "rating": 4, "date": "2016-06-15"}, {"excerpts": ["Personally, I think Spicy Bacon is a MUST. ", "It's BACON! ", "I also got the Salmon and Shiitake. ", "I LOVED the Shiitake ", "- it's sweet and mushroomy. "], "author": "Athena C.", "review": "Omgeeee!!!! Onigiriiii!!!!\n\nYeah, that's exactly how I feel. This was my first time actually trying onigiri and I've always wanted to since I watched Fruits Basket. But it's an interesting little snack. I don't know that I'd say it's enough for lunch but I love the idea. And the guy at the counter was all smiles behind his glasses and he was really nice! I'm a sucker for smiley people in customer service. He was also very patient when I got up to the counter while hesitating on my order.\n\nI got the Edamame Set, which means I got to pick 3 of the \"onigilly\" on their menu - comes with a tiny side of edamame and pickles for $8.74. Personally, I think Spicy Bacon is a MUST. It's BACON! I also got the Salmon and Shiitake. I LOVED the Shiitake - it's sweet and mushroomy. I can do without the Salmon next time though - cooked a little dry.\n\nI'm definitely planning to go back and I'm excited to try the other things. There's normally a line but I went at around 3:30pm so right before they closed, which was awesome. I did almost steal somebody else's order though - my bad for being so excited to try the rice balls...\n\nAnd it probably really is \"as good as it gets\" because I've never tried anything else like this!", "rating": 5, "date": "2015-10-22"}, {"excerpts": ["I've tried the spicy bacon, snow crab one, shiitake and the salmon. ", "I personally prefer Unagi over anything else because it's consistent and it tastes good. ", "The spicy bacon was a bit salty ", "and so were the shiitake and salmon. ", "And for the snow crab, it was overpowered with mayonnaise, which was kind of gross in my opinion. ", "Great place to grab a quick bite though. ", "Oh and if you like miso soup, I suggest skipping it here. ", "I've tried it a few times in hopes "], "author": "cadence p.", "review": "Just get the Unagi, you won't regret it. I've tried the spicy bacon, snow crab one, shiitake and the salmon. I personally prefer Unagi over anything else because it's consistent and it tastes good. The spicy bacon was a bit salty and so were the shiitake and salmon. And for the snow crab, it was overpowered with mayonnaise, which was kind of gross in my opinion. Great place to grab a quick bite though. Oh and if you like miso soup, I suggest skipping it here. I've tried it a few times in hopes I just came on a bad day for it and to my disappointment, it always tastes watered down :( \n\nWould give this place 5 if there were many more things on their menu that I like.", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["Favorite flavor so far is Spicy Bacon - but it packs a lot of flavor compared to some others so you may want to save it for last if you order several onigilly. \n\n"], "author": "Josephine T.", "review": "An ideal lunch spot for people in the area because of taste, convenience, quickness, and fair prices! While there is usually a line that builds up for the lunch rush, the line moves quickly. I would recommend getting there fairly early if possible as both times I have gone, they have run out of certain flavors. I love that onigilly is such a convenient size and cute shape, portable and easy to eat - great for a quick lunch or maybe even a picnic lunch.\n\nFavorite flavor so far is Spicy Bacon - but it packs a lot of flavor compared to some others so you may want to save it for last if you order several onigilly. \n\nSo far, I haven't really found the combos to be that impressive or cheaper by any significant amount. The edamame is only okay (served cold, unseasoned) and the miso soup is actually a little disappointing (ended up throwing mine away). The one flavor that I tried that I also didn't find to be impressive was the chicken teriyaki because it lacks flavor.", "rating": 4, "date": "2015-08-24"}, {"excerpts": ["We had the spicy bacon, which was good, and the snow crab, which was excellent.  \n\n"], "author": "Jason H.", "review": "Came here late on Friday afternoon and there was no line.  The onigiri is so familiar, from travels in Asia - and it's done really well here.  We had the spicy bacon, which was good, and the snow crab, which was excellent.  \n\nThe prices are OK, but it is a fair amount of rice and filling, so I think it's good.\n\nDefinitely stop by for a quick snack, or get three and make a meal (it's cheaper!)", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["Miso Tuna\nSpicy Bacon\nUme\n\n"], "author": "Inge C.", "review": "If you need a quick and fresh handmade lunch, Onigilly is the perfect place to go to!\n\nFor those of you who have no idea what Onigiri is, it is a japanese rice balls! The most casual and traditional Onigiri is filled with Ume (japanese pickled plum). Which they also have on their menu!\n\nBut they have so much more! And here are my top list of must haves in their menu:\nSpicy Shrimp\nMiso Tuna\nSpicy Bacon\nUme\n\nMost of their rice balls range from $3-$4 each. Very cheap and worth the price because they realllyyyy stuff them rice balls with them fillings!\n\nI suggest to go between 2-4pm because\n11-1pm and 5-6pm are lunch and dinner rush, the wait can be pretty crazy!\n\nCheers!", "rating": 5, "date": "2015-08-17"}, {"excerpts": ["The three I choose were eggplant, spicy bacon, and snow crab. ", "All three were delicious. ", "They are also extremely filling! ", "I also love that they are made fresh! ", "I definitely want to go back and try some of the other flavors."], "author": "Nia R.", "review": "I love these little Japanese rice balls. Luckily this place is open until 4 so I missed the lunchtime rush. I got the 3 onigilly set that comes with soy beans and pickled radish. The three I choose were eggplant, spicy bacon, and snow crab. All three were delicious. They are also extremely filling! I also love that they are made fresh! I definitely want to go back and try some of the other flavors.", "rating": 4, "date": "2016-08-10"}, {"excerpts": ["I decided to get the salad bowl with Spicy Shrimp, Unagi and Spicy Bacon while my boyfriend got the same combination but in a rice bowl... "], "author": "Melissa C.", "review": "AHHH this place is SO GOOD! \n\nI've had it on my list for awhile...was craving fish/japanese food so I finally made my way over here. \n\nI decided to get the salad bowl with Spicy Shrimp, Unagi and Spicy Bacon while my boyfriend got the same combination but in a rice bowl... oh and we shared a miso soup.\n\nI feel that the prices here are more reasonable considering that the food is of really good quality and extremely flavorful. An adequate healthy lunch for less than $10!\n\nAll of the meats we got were delicious! Super flavorful! I personally think I liked the unagi best while my bf said the shrimp was his favorite. You can't go wrong with any of them though. \n\nMy boyfriend was surprised that the rice was brown, said it tasted like white rice... which is a good thing for the picky rice eaters, healthy without compensating flavor (although I personally enjoy brown rice). \n\nThe miso soup was good too, not too strong or salty; I loved that it was completely natural so I know that I was getting some of my probiotic intake for the day :D \n\nThey have TONS of options for your onigiri/salad/rice bowls. If you're vegetarian or gluten free this is a great option for you guys too! If you're in a hurry onigiri is very friendly for on the go eating as well.\n\nThe restaurant is pretty small/cramped and busy. We went at an odd time..around 1:30-2ish but there was a steady flow of customers coming in... if you're dining in you're gonna have to choose on whether or not you wanna stick your ass or frontal area in someones face since the tables are really close together =p \n\nBut that's not the point! I definitely recommend this spot and am looking forward to coming here again!", "rating": 4, "date": "2015-02-08"}, {"excerpts": ["My favorite is definitely the snow crab and the spicy bacon. "], "author": "Kendra W.", "review": "This is pretty much my favorite lunch spot. It's so fun to make a lunch by mixing and matching 2-3 onigilly(ies?). You don't think it -- but they are quite filling.\n\nI loved eating onigiri in Japan so was very happy to see the fusion take on it back in SF.\n\nMy favorite is definitely the snow crab and the spicy bacon. I highly recommend the chicken karage as well if you can eat that much food.\n\nI JUST finished my punch card and can't wait to cash it in :D", "rating": 5, "date": "2015-10-15"}, {"excerpts": ["I chose the unagi(eel), miso tuna, and the spicy bacon. ", "The miso tuna was decent but didn't blow me away, it tasted almost like a normal tuna salad would, the unagi however was nice and flavorful, and finally the spicy bacon was surprisingly delicious.\n\n"], "author": "Zach C.", "review": "This place is absolutely awesome! I actually stumbled upon it while looking for sushirrito but this place dishes out nice comforting food quickly and for a reasonable price. \n\nOnigiri is like a hand roll but shaped into a triangle and here at Onigilly they have plenty of options for toppings. I got the onigiri set which is three onirigi of your choice along with some edamame and pickled daikon radish. I chose the unagi(eel), miso tuna, and the spicy bacon. The miso tuna was decent but didn't blow me away, it tasted almost like a normal tuna salad would, the unagi however was nice and flavorful, and finally the spicy bacon was surprisingly delicious.\n\nThe idea behind this restaurant is quite simple but also very clever and they execute their craft quite well, I plan on coming back to try their other flavors soon!", "rating": 4, "date": "2014-09-08"}, {"excerpts": ["Just this week, I ordered the special set that they had with spicy bacon, spicy shrimp, and hijiki (braised seaweed and carrots) in a rice bowl and a side of miso soup, all for less than $10! ", "When you order the rice bowl, they have a bed of rice, with three \"fillings\" that get put on top and some sprinkled nori. ", "They also give you a healthy amount of mixed greens for a side salad, edamame, and some pickled radish. "], "author": "Vivian L.", "review": "This is a great spot to grab some lunch. The onigiri is fresh and delicious! I came here recently to try it out with some coworkers. The line moves quickly and the orders are made in no time.\n\nAt Onigilly, you can order one of many different set deals. I opted to go for a set of three onigiri with the soboro (ginger-honey braised ground beef), a special with some sort of smoked salmon, and another special with braised mushrooms. I really enjoyed the smoked salmon and the mushroom ones, but was less of a fan of the soboro one.\n\nJust this week, I ordered the special set that they had with spicy bacon, spicy shrimp, and hijiki (braised seaweed and carrots) in a rice bowl and a side of miso soup, all for less than $10! When you order the rice bowl, they have a bed of rice, with three \"fillings\" that get put on top and some sprinkled nori. They also give you a healthy amount of mixed greens for a side salad, edamame, and some pickled radish. The sweet braised veggies were great with the spicy, salty bacon and shrimp.\n\nThis is starting to become one of my favorite spots on Kearny.", "rating": 4, "date": "2014-11-06"}, {"excerpts": ["The spicy bacon is exactly what it sounds like. ", "A bit of heat with bacon (the meaty kind not the fatty kind). ", "I enjoyed this one immensely also. "], "author": "Kevin T.", "review": "I was pretty impressed with this place for a quick lunch option. I came before noon so there was no line and I can't speak to his crazy it gets during peak lunch hours. \n\nThe salted plum is fantastic if you like the sourness of ume. A bit saltier than most ume onigiri but I love the intense sourness and saltiness. Big flavor, go big or go home. 5/5\n\nThe spicy bacon is exactly what it sounds like. A bit of heat with bacon (the meaty kind not the fatty kind). I enjoyed this one immensely also. 5/5\n\nThe braised ground beef was flavorful and tasty. You could really taste the ginger-honey. 4/5\n\nThe snow crab one is basically a California roll in a rice ball. I was hoping it would focus more on the crab, and I couldn't taste the lemon aioli. 3.5/5\n\nThe miso tuna sounded interesting but ended up being just a can of Chicken of the Sea in a rice ball. Just tasted like basic supermarket canned tuna which isn't awful I suppose. 2.5/5\n\nThe fermented soybean was my experiment for this meal. I couldn't handle it but to each his own. I personally just don't like that flavor.\n\nOverall it's a nice light lunch, about $10 for 3 rice balls that you can also combo with Edamame or seaweed salad. Not the most filling (I had 5 of them and I was satisfies but still not full) but that doesn't mean it's not a good meal! Would definitely come again to get my favorites and try the many other flavors.", "rating": 4, "date": "2015-07-01"}, {"excerpts": ["They have traditional toppings such as salmon to the exotic spicy bacon...", "Lol.  ", "I tried the spicy bacon.  ", "The bacon is really spicy with a touch of sweet cured brown sugar.  ", "It's a good snack with a friendly staff to make it enjoyable.  ", "If you need like one sushi to snack on... ", "This is the place, SON"], "author": "Chris P.", "review": "Curious about this place.  I walled by this place after getting my soup.  The menu caught my eye and prompted my to go in.  I asked the cashier his recommendation.  He's more of a seafood so his recommendation came to waste.  It's a snack alternative to sushi.  Basically it's a large sushi with added toppings.  They have traditional toppings such as salmon to the exotic spicy bacon...Lol.  I tried the spicy bacon.  The bacon is really spicy with a touch of sweet cured brown sugar.  It's a good snack with a friendly staff to make it enjoyable.  If you need like one sushi to snack on... This is the place, SON", "rating": 4, "date": "2015-05-05"}, {"excerpts": ["and I got their Soboro, which is their ginger, honey, soy braised ground angus beef and Mentaiko, spicy bacon.  \n\n"], "author": "Tiffany D.", "review": "What a healthy lunch meal!  They have delectable Onigiri fillings to choose from and I got their Soboro, which is their ginger, honey, soy braised ground angus beef and Mentaiko, spicy bacon.  \n\nThe meal comes with 2 Onigiri and they serve it with a side salad.  Their meat was very flavorful and nicely marinated in their signature sauce.  The meal was clean, in good proportions, fresh, healthy and you don't feel heavy afterwards.  \n\nNo food coma happening here after eating their delectable Onigiri. \n\nMini place that offers a seating area downstairs and upstairs.", "rating": 4, "date": "2013-07-02"}, {"excerpts": ["The tuna salad was a really well-done classic, spicy bacon was definitely something worth a try and the soboro was yummy as well. ", "Would definitely recommend to people who want to grab a quick bite!"], "author": "Michael C.", "review": "3 words: speedy, delicious, and friendly. Not only did the food arrive in a timely manner, the cashier was also extremely friendly and helpful. The tuna salad was a really well-done classic, spicy bacon was definitely something worth a try and the soboro was yummy as well. Would definitely recommend to people who want to grab a quick bite!", "rating": 5, "date": "2015-11-10"}, {"excerpts": ["I ordered 6 onigiri:\nSnow crab\nMiso tuna\nSpicy tuna\nSpicy bacon\nTeriyaki chicken\nMiso Nasu\n\n", "I definitely LOVE SNOW CRAB!", "! ", "You MUST try one if it's your first time here. ", "I wanted unagi and salmon ", "but it ran out", "--they're really popular here. ", "My boyfriend agrees along with terayaki chicken. ", "I'm going to come back for unagi, salmon, snow crab, and teryaki chicken next time!"], "author": "Jackie T.", "review": "I literally to this onigiri shop from work and a sweet employee lets me in at the last 3 minutes before closing! Whew! It was my first time trying it out! \nThe man was patient and friendly with my orders, he helped me reccomend the items that were available at the moment. I love how the staff's vibe is so welcoming and cheerful! \n\nI ordered 6 onigiri:\nSnow crab\nMiso tuna\nSpicy tuna\nSpicy bacon\nTeriyaki chicken\nMiso Nasu\n\nI definitely LOVE SNOW CRAB!! You MUST try one if it's your first time here. I wanted unagi and salmon but it ran out--they're really popular here. My boyfriend agrees along with terayaki chicken. I'm going to come back for unagi, salmon, snow crab, and teryaki chicken next time!", "rating": 5, "date": "2015-08-05"}, {"excerpts": ["I got the miso soup combo with spicy bacon and spicy shrimp rice balls. ", "And wow! ", "Flavour explosion."], "author": "Cindy Z.", "review": "Super cute place and super cute food! I got the miso soup combo with spicy bacon and spicy shrimp rice balls. And wow! Flavour explosion.", "rating": 4, "date": "2016-09-03"}, {"excerpts": ["I had the spicy bacon version and she had the sockeyed salmon version. \n", "My spicy bacon onigiri musibi was OK.  ", "I think that I just chose a weird topping.  "], "author": "Celise N.", "review": "My friend and I were actually killing time as we were on our way to lunch and stumbled upon Onigilly.  We were intrigued to find a onigiri musubi place in SF and decided to try one as a snack.  \n\nThe place was a cute, cozy little place and looked promising.  It had an open food prep area so you could see them making the onigiri.  \n\nI had the spicy bacon version and she had the sockeyed salmon version. \nMy spicy bacon onigiri musibi was OK.  I think that I just chose a weird topping.  My friend said that her was OK too.\n\nThe reason we weren't floored is that they did not use the right rice to make musubi.  It was not sticky enough, so it was kind of falling apart.  If they changed the rice the rating would be higher.", "rating": 3, "date": "2012-10-20"}, {"excerpts": ["Shitake mushroom and spicy bacon was my favorite, but the mushy rice....."], "author": "Susie L.", "review": "I really wanted to like this place. \n\nAfter a few visits to the place, I was reminded from their food at an event last night why I never go back. \n\nMushy rice. soggy seaweed, mushy rice. \n\nThat sums up a bad onigiri for me. The fillings are generally very tasty. Shitake mushroom and spicy bacon was my favorite, but the mushy rice.....", "rating": 3, "date": "2014-09-24"}, {"excerpts": ["Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. ", "I honestly believe they use real snow crab. "], "author": "Daniel D.", "review": "Absolutely amazing. I came here for lunch, on the recommendation of a friend. Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. I also had the Organic Matcha Lemonade. \n\nLet me be frank: I LOVE LEMONADE, and their Matcha lemonade just became a new favorite. The idea of the green tea threwme off, but I decidied to take the plunge. I'm glad I did.\n\nThe seaweed tasted very fresh and the meat exceeded expectation. I honestly believe they use real snow crab. Even the Wakame salad was great.\n\nDefinitely a new favorite restaurant!", "rating": 5, "date": "2015-05-05"}, {"excerpts": ["I ordered the unagi, salmon, and soboro while my boyfriend got the spicy bacon, salmon, and tempura shrimp. ", "Each of the onigiris were delicious; however, the salmon tasted bland, they didn't season that enough. "], "author": "Jessica Y.", "review": "Healthy and affordable lunch date with my boyfriend right after getting tea from plentea. The line wasn't long since we came around 11am on a weekday before workers started coming for the lunch rush.\n\nWe each got the set which included choice of 3 onigiris, edamame, and pickled diakon radish. I ordered the unagi, salmon, and soboro while my boyfriend got the spicy bacon, salmon, and tempura shrimp. Each of the onigiris were delicious; however, the salmon tasted bland, they didn't season that enough. I did wish they added a bit more sauce for each of them. \n\nI would definitely come back here if I was ever in the area and craved some Japanese food.", "rating": 4, "date": "2014-09-15"}, {"excerpts": ["Spicy bacon was yummy and their seasonal items tend to be great too. ", "I always go for the 3 Ongilly, cause its so good."], "author": "Kristan B.", "review": "Brings me back to my childhood spent in japan. Love it.\n\nThey make each Onigilly at time of order and the rice is still warm. Complementary Barley tea (hot or cold). \n\nIm not a huge fan of the pickled vegis, too sweet, which is a bummer, but that is not why I come here so its not a big deal. \n\nSpicy bacon was yummy and their seasonal items tend to be great too. I always go for the 3 Ongilly, cause its so good.", "rating": 5, "date": "2014-08-12"}, {"excerpts": ["- Spicy Bacon - Pretty good but on the heavy/salty side "], "author": "Feli W.", "review": "I'll admit - the first two times I tried Onigilly I was not impressed. It took me about three tries before actually finding the combination of onigiris that impressed me enough to give this place 4 stars.\n\nBelow are the onigiri's I've had from least favorite to my current go-to's: \n\n- Natto - I think many people find this off-putting because of the texture but I actually don't mind it. However, I just felt like the flavor lacked a bit for me. \n\n- Salmon - This was one of the first onigiri's I got and I hadn't read the description thoroughly and assumed I was going to get raw salmon. I'm not a huge fan of cooked salmon but my coworkers have also mentioned they felt this one lacked a bit of flavor.\n\n- Miso Tuna Salad - Decent but nothing really memorable.Tastes just how it sounds. \n\n- Spicy Bacon - Pretty good but on the heavy/salty side so I don't typically order this often. \n\n- Snow Crab - Light but, if you like crab, this one is nice and subtle. Yay for real crab meat! (none of that imitation stuff!) \n\n- Spicy Shrimp - For a while this was my favorite - it's got great flavor and is a bit spicy but not in an overwhelming way. I've introduced Onigilly to a few friends (without telling them my preferences) and all of them have stated that this one was the standout. \n\n- Tarako - The new favorite. If you don't like fish roe you might not like this. What I love about this one is the unique flavor. It is on the saltier side but the rice balances it out. \n\nOther Pros - \n\n** Nice and clean\n** Super friendly staff\n** They use brown rice so you can feel like you're eating healthy! \n** Pretty decent lunch deals (esp for the FiDi area). I always get the 3 onigiri special (comes with edamame and picked radish) - Snow Crab, Spicy Shrimp, Tarako - which comes out to $10", "rating": 4, "date": "2014-01-09"}, {"excerpts": ["I would still love to try the spicy bacon and other flavor next time!"], "author": "Wendy T.", "review": "I loved my brown rice snow crab da best!! Perfect amount of rice and filling ratio! Really love the side edammame and yellow pickles on the side. I would still love to try the spicy bacon and other flavor next time!", "rating": 5, "date": "2014-09-17"}, {"excerpts": ["Soboro -- ginger soy ground angus beef\n+Spicy Bacon\n+Spicy Shrimp\n", "The set of 3 comes with a salad too! "], "author": "Katherine S.", "review": "Yummy! The menu has the instructions for ordering and when I was here, there was a worker who was popping outside to answer questions. Yup, there's a line out the door during lunch, but the place is small. I recommend getting food to go since there's limited seating. Walk over to BoA plaza nearby and eat outside in the beautiful weather!\n\nOrder in 2 steps:\n1) Choose Onigilly set (or individual), Rice Bowl, or Salad Bowl\n2) Choose your flavors (the stuff that goes inside)\n\nFYI - the name of the restaurant is a play on the word \"onigiri\" for Japanese rice ball :)\n\nI got the set of 3:\n+Soboro -- ginger soy ground angus beef\n+Spicy Bacon\n+Spicy Shrimp\nThe set of 3 comes with a salad too! Wasn't expecting that.\n\nThey're trying to get feedback from customers, so they give you a survey when you pick up your food. Fill it out and bring it back for $2 off your next meal!", "rating": 4, "date": "2012-10-07"}, {"excerpts": ["I got the eel, the snow crab, and the spicy bacon. ", "I wasn't crazy about the eel or the spicy bacon. ", "But the snow crab I loved! ", "If I ever go back, I would stick to the snow crab. ", "It was so delish! ", "3 triangles, 6 edamame pieces, and 3 slices of daikon (radish) ", "later (yes, they are a bit stingy), and I'm still kind of hungry. ", "It's a very very light meal. "], "author": "Junel S.", "review": "A very light meal for a not so very light price. That sums up Onigilly for me. It was my first time there and I opted for the combo (3 rice triangles with edamame and daikon). Total came out to $10, ouch!\n\nI got the eel, the snow crab, and the spicy bacon. I wasn't crazy about the eel or the spicy bacon. But the snow crab I loved! If I ever go back, I would stick to the snow crab. It was so delish! 3 triangles, 6 edamame pieces, and 3 slices of daikon (radish) later (yes, they are a bit stingy), and I'm still kind of hungry. It's a very very light meal. So if that's the type of meal you're searching for, Onigilly is the place for you!\n\nIt's an interesting concept - kind of like musubis or sushi rolls, but in a triangle. It's cute and Japanese. Onigilly is just ok for me. I think people are amused by the whole concept. But to grade the quality and quantity of what you get - just A-Ok!", "rating": 3, "date": "2014-02-03"}, {"excerpts": ["Three of us ordered a pretty significant spread: pork and veg kimchi, asparagus, tempura fried avocado, veggie slider with seaweed, lotus root taco, spicy bacon tacos, (the infamous) cabbage pancake and maybe some more stuff. ", "Everything ruled!!! ", "The server made a goof and thought we ordered mahi mahi. ", "We didn't, but ate it anyways ", "and it was awesome too. "], "author": "Brittany L.", "review": "Better than I imagined! My brother came here for a birthday and wouldn't shutup about some cabbage pancake, so I caved and tried Onigilly for dinner on a Friday. Three of us ordered a pretty significant spread: pork and veg kimchi, asparagus, tempura fried avocado, veggie slider with seaweed, lotus root taco, spicy bacon tacos, (the infamous) cabbage pancake and maybe some more stuff. Everything ruled!!! The server made a goof and thought we ordered mahi mahi. We didn't, but ate it anyways and it was awesome too. Our server endlessly refilled our glasses with sake sangria to make up for it, so no complaints at all!\n\nI had no idea the place closed at 8pm which seems a bit early for Friday. The restaurant is a bit small, so space can be an issue. There is upstairs dining available though.\n\nDefinitely will come back! Lots of grub to satisfy both vegetarians and meat-eaters.\n\nDon't come here and ask for raw fish and then act surprised that not all Japanese food is sushi. (that's a jab at a dummy couple that walked in around 745pm, ZING)\n\nAnd oh yeah...the cabbage pancake totally lived up to what my bro was raving about. It's bomb! Big pancake with kale and cabbage plus some other stuff, with mayo and ketchup-y sauce latticed on top. Also, the fried avo must have been newly menu-ed because the staff kept commenting and laughing that they need a better way to deep fry it. It was served whole (skinless, obv) with the pit inside! Really good, but the tempura batter did fall off...", "rating": 4, "date": "2013-06-09"}, {"excerpts": ["I had the spicy bacon + chicken teriyaki.  ", "I thought the flavor in the spicy bacon was more interesting than the chicken teriyaki.  "], "author": "Alias A.", "review": "This is a review for the Onigilly food truck at Off the Grid at Fort Mason. \n\nThe onigiri is a-ok. Nothing to write home about.  I love the idea of onigiri as they are indeed quick bites that contain Japanese rice + nori (seaweed) and sometimes protein.  I had the spicy bacon + chicken teriyaki.  I thought the flavor in the spicy bacon was more interesting than the chicken teriyaki.  I also ate my onigiri after tasting the KoJa Kitchen sandwich, which was way flavorful so that might have tainted my tastebuds.  \n\n$3 for onigiri - doens't break the bank.", "rating": 3, "date": "2013-08-16"}, {"excerpts": ["My favorite was the Spicy Bacon! "], "author": "Karen H.", "review": "The staff was very friendly and I was very excited to try this place, but it was a bit disappointing. \n\nI got the Ongilly Set: 3 Rice balls and salad.\n\nGot the Miso Tuna-not much flavor and it was canned tuna. CAN? Really?\n\nSpicy Shrimp-Not spicy at all. The aioli was good, but not much to it\n\nMy favorite was the Spicy Bacon! This is a must. \n\nI would come back for the bacon and try some other ones. I really hope the other ones are better.", "rating": 3, "date": "2013-03-01"}, {"excerpts": ["I got the spicy bacon, the salmon, and a seasonal flavor - raw sesame kale. ", "All were awesome GF options. ", "The bacon is legitimately spicy, in a good way. ", "3 onigilly is kind of a lot of rice (and a lot of filling - these were loaded!) "], "author": "Kate W.", "review": "Awesome option for lunch. I got the Onigilly Set (3 choices + edamame and pickles) because I wanted to try a bunch of flavors. LOVE that they mark what's gluten-free and vegan. I got the spicy bacon, the salmon, and a seasonal flavor - raw sesame kale. All were awesome GF options. The bacon is legitimately spicy, in a good way. 3 onigilly is kind of a lot of rice (and a lot of filling - these were loaded!) so I'll probably get the 2+miso set next time. \n\nOh, and my edamame were kind of small and hairy. Not impressed. \n\nOther than that, I love this place. Will definitely be back.", "rating": 4, "date": "2014-03-20"}, {"excerpts": ["L iked the spicy bacon, tempura shrimp, kani (crab) and miso tuna, too\n", "Y our best bet for a short line is after 2pm -- or go when they open at 11am!"], "author": "Anthony N.", "review": "O h, it's truly hard to justify dishing out almost $10 for rice balls\nN ot the most frugal work lunch option, for sure\nI  yet somehow find myself coming back time and time again\nG ot to admit, this restaurant's Onigilly Set has got me hooked!\nI t comes with 3 onigiri (rice balls), tossed greens, pickles and edamame  \nL a Cocina is a good \"Prefix Combo\" to try (teri chix, spicy shrimp, eggplant)\nL iked the spicy bacon, tempura shrimp, kani (crab) and miso tuna, too\nY our best bet for a short line is after 2pm -- or go when they open at 11am!", "rating": 4, "date": "2012-09-22"}, {"excerpts": ["spicy bacon "], "author": "Barry H.", "review": "i remember walking past them at off the grid once and thought, \"brown rice? no thanks, next\"... anyways, i stumbled upon their kearny st location while looking for a place to eat dinner... walking in, my expectations weren't very high... brown rice??? in the end, i was surprised, here's what we ate...\n\nstarter:\nsteamed clams - wasn't feeling the ipa garlic butter soy for some reason... the good thing is that the food got better.\n\n\nkamikaze tacos:\nteriyaki chicken - chicken was cooked just right with a subtle hint of teriyaki. of the 4 tacos we tried, this one was my favorite.\n\nspicy bacon - this one was good, but pretty spicy, avoid if you don't like heat.\n\nkani - only took a bite, crab meat was fresh.\n\nspicy shrimp - couldn't really taste the shrimp much on this one, and again, spicy means spicy... but not as much as the bacon\n\nonigilly karaage slider - overall, i would say that this was the best of everything we ordered.\n\n\nto end it:\nus kobe tataki - very tasty", "rating": 4, "date": "2013-10-03"}, {"excerpts": ["Their spicy bacon topping is my favorite. \n\n"], "author": "Teresa W.", "review": "Oh how I love rice because I am Asian :P\n\nThe food here is so tasty, fresh and well prepared! \n\nThere are three options to choose from. 3 Onigilly, a rice bowl or noodle bowl.\n\nI usually go with the rice bowl and it comes with a spring mix salad and edamame. \nIf you get a rice bowl, try the Meat Complete, it comes with three meat toppings and is absolute salty goodness. Their spicy bacon topping is my favorite. \n\nThe inside is very cute, the cashiers and cooks are very friendly. There is seating at the side and upstairs also (super cool)", "rating": 5, "date": "2013-03-22"}, {"excerpts": ["Tarako + Nasu + Spicy Bacon + Rice Bowl = ", "One Happy Mofo."], "author": "Kelly G.", "review": "This place excites me. \n\nTarako + Nasu + Spicy Bacon + Rice Bowl = One Happy Mofo.", "rating": 5, "date": "2012-10-18"}, {"excerpts": ["The salmon special was little dry, but the spicy bacon and snow crab was on spot. ", "Keep it up.. ", "you've got a fan."], "author": "Tyrone L.", "review": "Yummmmooooo. The salmon special was little dry, but the spicy bacon and snow crab was on spot. Keep it up.. you've got a fan.", "rating": 5, "date": "2014-10-03"}, {"excerpts": ["Spicy bacon says it all!"], "author": "prior O.", "review": "Great place to grab a quick lunch!  Super friendly staff and the food is tres tasty.  Spicy bacon says it all!", "rating": 4, "date": "2014-04-25"}, {"excerpts": ["I like the surf n turf lunch set and the brussel sprouts, spicy bacon, onigiri and chicken kaarage. ", "Their salads have a nice and light dressing which I really enjoy!"], "author": "Paula U.", "review": "I love Onigilly even if other people can't quite figure out how they feel about the food. It's Japanese, but not the kind you are used to. In my opinion their food has interesting flavors and i like that they use seasonal ingredients and have a simple but artful food presentation. \n\nI like the surf n turf lunch set and the brussel sprouts, spicy bacon, onigiri and chicken kaarage. Their salads have a nice and light dressing which I really enjoy!", "rating": 4, "date": "2013-11-08"}, {"excerpts": ["The spicy bacon was interesting and did have a nice kick.  ", "The soboro - ginger honey soy braised ground angus beef was ok.  ", "The ginger ale was a really good choice of drink for the meal."], "author": "she q.", "review": "Had to wait but the line moved pretty quickly.  Went for the Lunch set A $8.45 3pc onigilly set with salad.  Tried the Miso Tuna which was delish.  The spicy bacon was interesting and did have a nice kick.  The soboro - ginger honey soy braised ground angus beef was ok.  The ginger ale was a really good choice of drink for the meal.", "rating": 4, "date": "2013-07-13"}, {"excerpts": ["And the spicy bacon is my favorite! ", "They've done such a good job with their restaurant, and the quality doesn't change when you get it at a farmers market or Off the Grid! ", "One of my favorite lunch spots in town :)"], "author": "Stephen M.", "review": "So good! The soup lunch special is perfect! And the spicy bacon is my favorite! They've done such a good job with their restaurant, and the quality doesn't change when you get it at a farmers market or Off the Grid! One of my favorite lunch spots in town :)", "rating": 5, "date": "2013-10-08"}, {"excerpts": ["The spicy bacon, soboro, and salmon are excellent! ", "I've been back 3 days in a row now ", "and I've tried the individual rice balls and the rice bowl ", "and they're both great.  ", "The line out the door is definitely worth the wait."], "author": "Patrick G.", "review": "Tasty, refreshing, and appropriately priced.  The spicy bacon, soboro, and salmon are excellent! I've been back 3 days in a row now and I've tried the individual rice balls and the rice bowl and they're both great.  The line out the door is definitely worth the wait.", "rating": 5, "date": "2012-10-18"}, {"excerpts": ["I love all their meats, especially salmon, eel, and spicy bacon. ", "I love that you can choose to have the rice balls or noodle salad."], "author": "exploradare G.", "review": "This place is really good! I love all their meats, especially salmon, eel, and spicy bacon. I love that you can choose to have the rice balls or noodle salad.", "rating": 4, "date": "2013-08-27"}], "miso tuna salad": [{"excerpts": ["I arrived around 11:30am and ordered the salmon, miso tuna salad, and tarako onigiris along with a side of miso soup. ", "The total came out to be $16. ", "I loved the miso tuna salad onigiri but was a bit disappointed with the salmon. ", "I'll probably pass on the miso soup as well. ", "This was more a 4.5 for me, but I'm definitely going to be back to try more flavors!"], "author": "Dee Dee T.", "review": "I arrived around 11:30am and ordered the salmon, miso tuna salad, and tarako onigiris along with a side of miso soup. The total came out to be $16. This location is a bit cramped as a ton of people started to pile in around 11:40am, but we managed to get one of the 2 small tables. \n\nThe rice isn't made out of sushi rice but brown rice, which was surprisingly delicious. I loved the miso tuna salad onigiri but was a bit disappointed with the salmon. I'll probably pass on the miso soup as well. This was more a 4.5 for me, but I'm definitely going to be back to try more flavors!", "rating": 5, "date": "2018-07-06"}, {"excerpts": ["My favorite fillings are the tarako and miso tuna salad, the addition of mayo makes everything better!  ", "It gets a bit pricey ($2-3 per onigiri), but we are in Fi-Di ", "and they do boast about the quality of their ingredients "], "author": "Jessica L.", "review": "This is not what an onigiri is supposed to be, but I think I like it anyway?\n\nOnigilly is right next to my office, so I've had them on more than one occasion.  The fillings are actually not bad, and they give you a pretty generous scoop in each.  The whole construction of the onigiri seems a little wrong to me, because I'm used to triangles of rice lovingly shaped by a mother's hand.  But I also enjoy having filling in every bite, so I'll sneak these up to my office and eat them at my desk away from the eyes of the Japanese food gods.\n\nMy favorite fillings are the tarako and miso tuna salad, the addition of mayo makes everything better!  It gets a bit pricey ($2-3 per onigiri), but we are in Fi-Di and they do boast about the quality of their ingredients (canned tuna is canned tuna IMO).\n\nTips and Tricks:\n\n-They have a stamp card so you get your 11th meal free.  Stamps are only given if you purchase a meal though\n-Zosui is not really zosui as much as it's chazuke (just rice in broth with your choice of meat)", "rating": 3, "date": "2017-06-16"}, {"excerpts": ["Miso Tuna Salad ($2.76) - cooked wild albacore w/ miso aioli\nUnagi ($3.22) - broiled fresh water ", "eel ", "w/ sweet BBQ sauce\n", "They are all very tasty. ", "The onigiri are made with triangle molds; a triangle of rice in the mold, then filling and a second triangle of rice, and wrapped carefully with nori. ", "At Onigilly, you pay a little more than what you would pay for a cold onigiri at an Asian convenience or grocery store. ", "But the ones you get here are rather large, and of course, warm. ", "Not only that, they give you a good amount of filling. ", "It's not one of those rice balls that have a ton of rice, and a tiny, measly bit of filling deep in the center.\n", "If you pay with the Paypal app, there's often some sort of deal, which makes these rice balls a steal. ", "However, there are often complications with this payment platform.\n"], "author": "Joy W.", "review": "I don't know why I like onigiri so much. It's just rice wrapped in seaweed with some filling inside. So simple, yet so delicious. \nThe ones I've tried here are the...\n\nSpicy Shrimp ($2.76) - bay shrimp w/ spicy aioli\nMiso Tuna Salad ($2.76) - cooked wild albacore w/ miso aioli\nUnagi ($3.22) - broiled fresh water eel w/ sweet BBQ sauce\nThey are all very tasty. The onigiri are made with triangle molds; a triangle of rice in the mold, then filling and a second triangle of rice, and wrapped carefully with nori. At Onigilly, you pay a little more than what you would pay for a cold onigiri at an Asian convenience or grocery store. But the ones you get here are rather large, and of course, warm. Not only that, they give you a good amount of filling. It's not one of those rice balls that have a ton of rice, and a tiny, measly bit of filling deep in the center.\nIf you pay with the Paypal app, there's often some sort of deal, which makes these rice balls a steal. However, there are often complications with this payment platform.\nIf I came back, I'd like to try the Tempura Shrimp. The staff is friendly. They work pretty quickly serving these yummy onigiri.", "rating": 4, "date": "2016-02-11"}, {"excerpts": ["Here at Onigilly, you can get fancy fillings such as miso tuna salad, spicy shrimp and snow crab. "], "author": "Christine W.", "review": "Traditionally, Japanese onigiri (rice balls) are filled with salted salmon or pickled plums.\n\nHere at Onigilly, you can get fancy fillings such as miso tuna salad, spicy shrimp and snow crab. They have veggie, seafood and meat options so everyone can have something to suit their taste. \n\nService is friendly and the restaurant is really small with limited seating, so it can get uncomfortably packed. I wouldn't suggest coming here if you're hungry enough to eat a horse... They're rice balls; don't expect a heavy meal!", "rating": 5, "date": "2016-06-24"}, {"excerpts": ["It was hard to choose but I ended up trying: miso tuna salad, spicy shrimp, and the snow crab.\n\n", "The miso tuna salad was amazing! ", "It is very standard filling and the flavors go so well with the seaweed. ", "A must try! ", "The snow crab was also good but the crab tasted a bit fishy (salt water) so it was a tiny bit unpleasant the first bite ", "but it got better as I ate. ", "The third one I tried was the spicy shrimp and it was really good but ", "in my opinion a little too saucy (the sauce was runny). "], "author": "Isabella L.", "review": "Stumbled across this place as I was walking around the area after an interview. The interior of the little shop is clean and modern and very cute. Wood with green accents. \n\nThey have a selection of dishes in addition to the onigiri. They have miso soup, edamame, rice bowls, chicken karate etc. they have an extensive selection of onigiri (basically rice wrapped with seaweed with a filling). It was hard to choose but I ended up trying: miso tuna salad, spicy shrimp, and the snow crab.\n\nThe miso tuna salad was amazing! It is very standard filling and the flavors go so well with the seaweed. A must try! The snow crab was also good but the crab tasted a bit fishy (salt water) so it was a tiny bit unpleasant the first bite but it got better as I ate. The third one I tried was the spicy shrimp and it was really good but in my opinion a little too saucy (the sauce was runny). Would've liked a thicker sauce. \n\nI can't wait to come back and try the tempura shrimp and salmon one. I heard the pollock roe one is also amazing! I came here 10 mins before closing and they ran out of a lot of the fillings so id come sooner next time! Such a great find!\n\nAll onigiris are approximately $2.50-$3.50 each. Decently priced.", "rating": 4, "date": "2014-05-05"}, {"excerpts": ["I ordered the teriyaki tofu (yum!), unagi (yum!), ume/plum (eh...), and their specialty, the miso tuna salad (which tasted just like tuna salad).\n\n"], "author": "Christina C.", "review": "Great concept in transforming the traditional onigiri with a Westernized twist! I'd say three to four is a good amount of rice in your stomach :-). I ordered the teriyaki tofu (yum!), unagi (yum!), ume/plum (eh...), and their specialty, the miso tuna salad (which tasted just like tuna salad).\n\nI'd love to go back to try some more options - the eggplant sounded fun and who could say no to salmon. Plus they have wakame salad and I loveee wakame salad! :-). Great lunch spot, plus they're next to a milk tea place that's always crowded and has thus piqued my interest!", "rating": 4, "date": "2014-07-31"}, {"excerpts": ["- Miso Tuna Salad - Decent but nothing really memorable."], "author": "Feli W.", "review": "I'll admit - the first two times I tried Onigilly I was not impressed. It took me about three tries before actually finding the combination of onigiris that impressed me enough to give this place 4 stars.\n\nBelow are the onigiri's I've had from least favorite to my current go-to's: \n\n- Natto - I think many people find this off-putting because of the texture but I actually don't mind it. However, I just felt like the flavor lacked a bit for me. \n\n- Salmon - This was one of the first onigiri's I got and I hadn't read the description thoroughly and assumed I was going to get raw salmon. I'm not a huge fan of cooked salmon but my coworkers have also mentioned they felt this one lacked a bit of flavor.\n\n- Miso Tuna Salad - Decent but nothing really memorable.Tastes just how it sounds. \n\n- Spicy Bacon - Pretty good but on the heavy/salty side so I don't typically order this often. \n\n- Snow Crab - Light but, if you like crab, this one is nice and subtle. Yay for real crab meat! (none of that imitation stuff!) \n\n- Spicy Shrimp - For a while this was my favorite - it's got great flavor and is a bit spicy but not in an overwhelming way. I've introduced Onigilly to a few friends (without telling them my preferences) and all of them have stated that this one was the standout. \n\n- Tarako - The new favorite. If you don't like fish roe you might not like this. What I love about this one is the unique flavor. It is on the saltier side but the rice balances it out. \n\nOther Pros - \n\n** Nice and clean\n** Super friendly staff\n** They use brown rice so you can feel like you're eating healthy! \n** Pretty decent lunch deals (esp for the FiDi area). I always get the 3 onigiri special (comes with edamame and picked radish) - Snow Crab, Spicy Shrimp, Tarako - which comes out to $10", "rating": 4, "date": "2014-01-09"}, {"excerpts": ["The toppings included miso tuna salad, shrimp and hijiki.  ", "Of the three, I liked the miso tuna salad best.  "], "author": ".Hon H.", "review": "I finally had an opportunity to stop in at Onigilly today.  The line was pretty short, so I took the chance and waited my turn.  The ordering part is a bit confusing, as others have said, but since you will have at least 5 minutes before your order is taken, you'll have plenty of time to chose what you want.  What I found a little difficult about ordering is the weird handwriting of the person who wrote out the menu.  It's a bit hard to read.\n\nAfter a short wait, I placed my order for the 3 onigilly/salad combo and chose the seafood combo.  It was ready in a minute or two.  I bit right into one of those little packages and it was delicious!  The Nori wasn't hard or soggy yet (as others have complained) and the rice was delicious.  The toppings included miso tuna salad, shrimp and hijiki.  Of the three, I liked the miso tuna salad best.  The side salad was a nice size - just what you need - and I enjoyed the edamame that they threw in, but they need to hold the salt on the edamame - wow, sodium overload!\n\nOnigilly will definitely be on the rotation, but probably just every once in a while since I try to stay away from carbs, and the onigiri are in truth, mostly rice.  Delicious, but again, mostly rice.", "rating": 3, "date": "2012-11-21"}, {"excerpts": ["Tried the miso tuna salad, teriyaki chicken, and spicy garlic bacon. ", "Mmmm. ", "I could have had 3 of just those garlic bacon ones. ", "Looking forward to trying them again."], "author": "Miffy Y.", "review": "Their food truck was at the J-Pop festival so I tried the lunch special. $8 for 3 onigiri and edamame (guess they were out of pickled ginger at the time?). I thought it was kind of expensive for what seemed like a small amount of food, but it was surprisingly filling. Tried the miso tuna salad, teriyaki chicken, and spicy garlic bacon. Mmmm. I could have had 3 of just those garlic bacon ones. Looking forward to trying them again.", "rating": 3, "date": "2012-09-07"}, {"excerpts": ["Healthy and tasty, I like the spicy shrimp, miso tuna salad, and eel (imagi)."], "author": "Lexi M.", "review": "One of my favorite spots for quick food. Healthy and tasty, I like the spicy shrimp, miso tuna salad, and eel (imagi).", "rating": 5, "date": "2015-10-08"}], "tarako  pollack roe": [], "snow crab": [{"excerpts": ["I ordered the spicy shrimp and the snow crab Onigilly, getting a filling lunch for only $6.  ", "What a steal!\n", "It was awesome watching the staff construct the food.  ", "They are definitely a well-oiled machine as they had an perfectly timed assembly line in the kitchen.  ", "The kitchen is open to the small entry space so you can watch everything being made.  ", "I had my order in my hand within 3 minutes of ordering.  \n", "I was super, duper happy with my experience here.  ", "If I lived nearby, this would definitely be a weekly lunch."], "author": "Annie M.", "review": "What an awesome find during my trip to SF.  My friend had bookmarked them on Yelp and we thought it would be the perfect spot to hit up during a quick lunch break.  The space is very small and the line twirls around in a sort of organized chaotic manner.  We managed to squeeze about 12 people in line in this tiny space.  \nThe menu is not huge but almost everything on the menu sounded appetizing.  Although they have some yummy sounding bowls on their menu, I figured that for my first time eating somewhere like this, I just have to order Onigilly.  They offer vegetarian Onigilly, as well as chicken, beef and pork, but the star for me was the seafood options.  I ordered the spicy shrimp and the snow crab Onigilly, getting a filling lunch for only $6.  What a steal!\nIt was awesome watching the staff construct the food.  They are definitely a well-oiled machine as they had an perfectly timed assembly line in the kitchen.  The kitchen is open to the small entry space so you can watch everything being made.  I had my order in my hand within 3 minutes of ordering.  \nI was super, duper happy with my experience here.  If I lived nearby, this would definitely be a weekly lunch.", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["I believe I usually order the snow crab onigilly.  "], "author": "Stephanie Z.", "review": "Just want a small meal or snack and don't want to spend too much?  Onigilly is a good option.\n\nTheir onigilly rice balls are really cute and delicious!  They're a great snack, though not the most filling.\n\nEach onigilly rice ball runs around $2.76 to $3.75, so it could be a small, cheap lunch if you only order a couple.  There are also other set meals that you can order.  I believe I usually order the snow crab onigilly.  The onigilly tastes good, but nothing mind-blowing.\n\nService is usually friendly and pretty quick.  The food is prepared in an assembly line and you can see them make your order.\n\nOne thing that I would suggest for improvement is to label the different onigilly or point out which one is which.  Perhaps when it's busy, they don't have time to do that, but it would be nice to know which one I'm eating.  It would also be nice to have a sauce bottle to add more flavor!  They have chili and salt available at the side counter where you can serve yourself, but some Japanese mayo or something would be nice.", "rating": 4, "date": "2018-10-11"}, {"excerpts": ["I went with the Snow Crab for $3.45 -- simple, fresh, and with lemon aioli. ", "Yes, this is real crab meat. ", "For the price, it's a little high-end. ", "In general, the rice balls will run you between $2.76 and $3.75, before taxes. ", "However, I'd expect 2-3 to fill you up and that's not too bad for a nice lunch. ", "I devoured my Snow Crab rice ball in seconds.\n\n"], "author": "Kathy Z.", "review": "I happened to be at Super Duper Burgers and looked up and, BAM, it was love at first sight. Right across the street was Onigilly. I am a huge fan of gourmet rice balls, so I raced over to give this place a try.\n\nI must admit, I wasn't blown away by the menu. Nothing I haven't seen elsewhere, and definitely nothing innovative. These \"onigiri\" rice balls are shaped into a triangle. No, this does not qualify as \"sushi.\" Everything is made with brown rice. I'm not a fan of brown rice elsewhere, but here it's quite sweet and good. Definitely a fan of how they prepare the onigiri. Each one is made to order, so expect to wait for your food. Lots of vegan and gluten-free options, too.\n\nThe ordering system here is not fun. The little shop gets so crowded that the few seats available can't even be used. You'll likely become incredibly cramped and uncomfortable. There's no real line for ordering and picking up, so patrons just curve toward the inside of the shop and it's a struggle to walk in or out.\n\nI went with the Snow Crab for $3.45 -- simple, fresh, and with lemon aioli. Yes, this is real crab meat. For the price, it's a little high-end. In general, the rice balls will run you between $2.76 and $3.75, before taxes. However, I'd expect 2-3 to fill you up and that's not too bad for a nice lunch. I devoured my Snow Crab rice ball in seconds.\n\nHere are some other options:\n- Teriyaki Tofu\n- Renkon (Spicy Lotus Root)\n- Shiitake\n- Spicy Bacon\n- Spicy Miso Beef\n- Unagi (Eel)\n- Grilled Salmon\n- Tempura Shrimp\n\nBesides the rice rolls, they offer salads and soup. They also do small dishes like edamame and fried chicken karaage. There's even organic matcha lemonade.\n\nExpect a 3.5% mandate surcharge \"to help offset the additional regulatory costs of doing business in San Francisco.\" Yeah, yeah, yeah.", "rating": 4, "date": "2018-07-31"}, {"excerpts": ["I ordered the onigiri combo: three pieces (snow crab, salmon, & eel) and a side of edamame for a steal. ", "The onigiri themselves were all delicious, but the snow crab stood out as my favorite. ", "Next time I would be keen to order all three as snow crab!"], "author": "Callie G.", "review": "Great little lunch spot located in the Financial District. The restaurant was small and there was little to no seating, so I immediately knew I would be taking my lunch to go. I was initially worried due to the fact that the line wrapped around inside the restaurant, but the assembly line was super fast and I was in and out the restaurant in under 10 minutes. \n\nThe matcha lemonade was a unique and refreshing choice, and I had downed the whole thing by the time I got back to the office. I ordered the onigiri combo: three pieces (snow crab, salmon, & eel) and a side of edamame for a steal. The onigiri themselves were all delicious, but the snow crab stood out as my favorite. Next time I would be keen to order all three as snow crab!", "rating": 4, "date": "2018-08-07"}, {"excerpts": ["Snow crab", ": damn girl now you talking my language. ", "Shhh so good. ", "So addicting. ", "Taste fresh, perfectly seasoned, beautiful with every bite. ", "As tasty as the snow crab, the spicy shrimp is a whole nother level of deliciousness. ", "A must get if you're sane. ", "Addicting, I love everything about this. "], "author": "Quynh Nhu D.", "review": "There is something about that salt. \n\nLook man, I'm simple. Once I find something I like to eat I often crave it and seek it out. And that one thing is onigiri. Been on the hunt for some good onigiri grub eventhough I can technically make them myself, the simple one anyways. So when I moved to the area I was hype to see Onigilly and had it bookmarked. \n\nRecently realize Onigilly is a few steps away from my favorite boba place, so finally decided to seek it out. I tend to prefer seafood so I'll probably never get the chicken or the pork:\n\n3. Salmon: very basic onigiri filling, though not as good as I've hoped. Sort of bland. I mean it's salmon but its not OOMPH salmon. Will pass next time. Or perhaps spicy salmon would have been a better choice: IF that was available, which it is not. Yet.\n\n2. Snow crab: damn girl now you talking my language. Shhh so good. So addicting. Taste fresh, perfectly seasoned, beautiful with every bite. Always a go to.\n\n1. SPICY SHRIMP: this. is. everything. As tasty as the snow crab, the spicy shrimp is a whole nother level of deliciousness. A must get if you're sane. Addicting, I love everything about this. Could eat it all day. \n\nGot the rice bowl with teriyaki chix, spicy bacon, and soboro for the leech but he said it was too spicy and didn't eat a whole lot. So like I said I'll probably not go for those flavor in onigiri form either. Skip skip skip\n\nAlthough the leech did enjoy his zosui chix so maybe something I'll try myself next time. \n\nOnigiri aside: THE salt and pepper seasoning (???) on the side that you can get yourself is AMAZEBOMB. \nLike ok this is how pathetic I am: I buy my onis then get like 2 thing of the salt and the pepper seasoning and then I HOARD that shjt and eat it with my onigiri at home AND I got some extra so I'll be sprinkling it all over my own rice and my own seaweed and I am obsess with it. Someone tell me if they sell this or where I can get my own giant bottle because I need to put this on all my food. Thanks!\n\nService is quick. No hassle. Its only long wait when you're waiting behind indecisive customers. Them onigiri are make quickly though and for the seafood ones I've seen them really pilling it on. I don't see any skimping vs the way other reviews tell 'em. So I'm very happy with the proportion of filling to rice. Perfect. Love it.\n\nOnly sadness is the hour is not long enough. I guess they cater to the working hours. Q.Q But I get out so late and on my off days I wake up at 3pm how am I gonna make it there in time. T.T Also close on weekends? And holidays (them mondays holidays) as well? Why hast thou forsaken me, I want my onigiriiiii", "rating": 4, "date": "2018-03-04"}, {"excerpts": ["The snow crab was good but had just a little too much mayo for my taste. ", "It overpowered the flavor of the crab. "], "author": "Anita W.", "review": "This place has quick service. I was in and out in about 10 minutes (including the time I spent stuffing my pie hole).\n\nThe mushroom shiitake was a tad on the salty side but had great flavor.\n\nThe snow crab was good but had just a little too much mayo for my taste. It overpowered the flavor of the crab. They use real crab, so I feel like it's a waste to dump that much mayo in it.\n\nThis place didn't blow my mind, but maybe it's not supposed to.", "rating": 3, "date": "2018-03-16"}, {"excerpts": ["Interesting concept...rice balls with different types of fillings from beef to \nbacon to more exotic fillings like snow crab and lotus root. ", "They were good."], "author": "Sunil R.", "review": "Interesting concept...rice balls with different types of fillings from beef to \nbacon to more exotic fillings like snow crab and lotus root. They were good.", "rating": 3, "date": "2018-07-18"}, {"excerpts": ["Me and a friend ended up with 6 different onigilly (SOBORO, SPICY SHRIMP, SNOW CRAB, SPICY BACON, CHICKEN TERIYAKI, SALMON) and a TOFU ZOSUI. ", "It came out really fast! ", "Great for those who want a quick lunch! ", "By far my favorite was the snow crab!!! ", "It was super tasty and reminded me a little bit of a lion king roll with the mayo base they use (totally missing everything else though haha). ", "Next up would have to be the spicy shrimp. ", "I think it's hard to go outside of seafood for something that's basically a hand roll on steroids, but my 3rd option would have to be the soboro. ", "Kind of like a rice stew thing. "], "author": "Daniel O.", "review": "OMESSHHHHIIIIIIIIIIIII~\n\nCame here today for lunch for the first time! Walked in a little bit before the rush and was able to order pretty quickly. The menu looked pretty simple but with a lot of items I wasn't used to. \n\nMe and a friend ended up with 6 different onigilly (SOBORO, SPICY SHRIMP, SNOW CRAB, SPICY BACON, CHICKEN TERIYAKI, SALMON) and a TOFU ZOSUI. It came out really fast! Great for those who want a quick lunch! By far my favorite was the snow crab!!! It was super tasty and reminded me a little bit of a lion king roll with the mayo base they use (totally missing everything else though haha). Next up would have to be the spicy shrimp. I think it's hard to go outside of seafood for something that's basically a hand roll on steroids, but my 3rd option would have to be the soboro. Kind of like a rice stew thing. Loved it!!\n\nLike I said earlier, OMESHIIIIIIIIIII~", "rating": 4, "date": "2018-02-27"}, {"excerpts": ["I enjoy the shiitake, snow crab, eel.\n\n"], "author": "Jonathan C.", "review": "Good place to fill that carb craving, while still eating relatively healthy.  I enjoy the shiitake, snow crab, eel.\n\nZosui was also good for the winter months, kind of a heartier liquid risotto like texture.\n\nThe salad bowl not filling enough, and not enough salad, would just stick with the rice balls.", "rating": 4, "date": "2018-06-25"}, {"excerpts": ["I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. "], "author": "Ashley S.", "review": "Simple, clean, healthy, delicious to-go spot for Japanese onigiri (triangular rice ball snack with filling wrapped in seaweed), caters to the weekday lunch crowd. I think Onigilly might turn out to be one of those places I CRAVE. Well, actually, I already know it is because I went on Friday, and was already wishing they were open on Saturday, the next day, so I could go back (they're open only Mon-Fri). \n\nI couldn't decide between getting a salad bowl or a rice bowl, and discovered with the help of the nice cashier that they can do half salad half rice! I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. Might opt for the Spicy Shrimp or Spicy Bacon next time). \n\nI also ordered a teriyaki chicken onigiri to save for later, but curiosity and fatassery got the best of me. I popped that onigiri to-go box open for \"just a bite\" but ended up inhaling the whole thing despite being full already from the salad/rice bowl.\n\nCan't wait to return to try some of their other offerings!! So. excite. !", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["Unagi\nSnow Crab\nSpicy Bacon \n\nThis is an easy lunch and "], "author": "Mandi H.", "review": "Onigilly is one of those brainless lunch spots. When I can't decide where to eat, there's a good chance I will end up here. Even when the line is out the door, it moves quickly because people are in and out in minutes. They are known for their seaweed wrapped \"rice balls\" which which can be purchased individually or in a set. I usually order the edamame set, which comes with 3 rice balls and a side of cold edamame.\n\nMy favorites include:\nTempura Shrimp (only available at Kearny location!)\nUnagi\nSnow Crab\nSpicy Bacon \n\nThis is an easy lunch and I like picking this up when I just want to grab something quick. I have tried the rice bowl, which comes with 3 toppings over a bed of rice but it just wasn't the same. I enjoy the rice balls significantly more, must be the seaweed! Worth trying if you are in the area!", "rating": 4, "date": "2017-03-02"}, {"excerpts": ["A few that I have tried are: Snow Crab, Spicy Shrimp, Salmon, and Spicy Bacon. ", "Of all that I have tried, the spicy bay shrimp is the best- especially if you enjoy spicy food! "], "author": "Ingrid E.", "review": "Onigilly is a great place to go to for a quick healthy bite. There's something on the menu for everyone. A few that I have tried are: Snow Crab, Spicy Shrimp, Salmon, and Spicy Bacon. Of all that I have tried, the spicy bay shrimp is the best- especially if you enjoy spicy food! It has the perfect amount of spice, but it isn't too overpowering where it becomes too spicy to enjoy. \n\nI'm very fortunate this location isn't too far from my work because I plan on coming back to try the rice bowls, salad bowls and even the miso soup combination which comes with 2 onigilly. \n\nService has always been great as usual. Keep up the great work!", "rating": 5, "date": "2017-01-25"}, {"excerpts": ["I ordered the soboro (pork), miso tuna, snow crab, and salmon rice triangles (yes I like trying a lot of new things). ", "Snow crab: in my opinion not as worth the price but still good\n\n"], "author": "Michelle L.", "review": "This place has a lot of hype for some reason, or there's always a line when I walk back so I decided to actually stop in for once. I came as soon as the place opened so only one of two people already there. I can't really speak on the true wait because of that. The service was fast and friendly and it was actually pretty interesting watching the servers make the food. \n\nI ordered the soboro (pork), miso tuna, snow crab, and salmon rice triangles (yes I like trying a lot of new things). It was quite filling and in order of the ones I would recommend:\n\n1. Miso tuna: very good balance of flavors (less filling than the others tho) and relatively light\n2. Salmon: a little dry but the sauce and the seasoning they put on helped\n3. Soboro: was a little too strong in flavors for me \n4. Snow crab: in my opinion not as worth the price but still good\n\nOverall, this place seems like a fast and relatively cheap and healthy place to stop by for lunch. Will visit when I can again, but I wasn't interested in any other flavors than the ones I listed above so I'm not completely sure. Would definitely recommend at least one try!", "rating": 4, "date": "2017-07-19"}, {"excerpts": ["We sampled the spicy shrimp and snow crab rice triangle, and their set bowl with their special soup and unagi rice triangle.  ", "We are pleasantly surprised, everything was so good ", "our lunch was satisfying and reasonable.  ", "I wasn't able to take photos of our lunch as mentioned our schedule was so hectic.  ", "But this place is a must try."], "author": "May A.", "review": "While in Downtown San Francisco, we like to try food variation some fancy and other times hole in a wall casual dining.  My husband and I were in a bit of rush to get to our meeting down the street so we decided to give this place a try.  We sampled the spicy shrimp and snow crab rice triangle, and their set bowl with their special soup and unagi rice triangle.  We are pleasantly surprised, everything was so good our lunch was satisfying and reasonable.  I wasn't able to take photos of our lunch as mentioned our schedule was so hectic.  But this place is a must try.", "rating": 4, "date": "2017-11-22"}, {"excerpts": ["I stick to the meat options and prefer the Unagi, Spicy Shrimp, Snow Crab, Teriyaki Chicken and Salmon.  \n\n"], "author": "Lon H.", "review": "I've been here a few times and pretty much keep it simple by ordering either a couple onigiri's or the Edamame Set, which comes with 3 onigiri's, Edamame and Daikon.  I grew-up eating onigiri's that my mom used to make for us.  They are a good snack or quick lunch option.  \n\nOnigilly offers a different twist, by using partially milled brown rice, versus the standard white rice my mom used to make.  We had them with or without nori (seaweed) growing-up, but using nori makes them easier to handle.  \n\nTheir menu has a wide selection of flavors, so there's something for pretty much everyone, including those that are gluten-free or vegan.  I stick to the meat options and prefer the Unagi, Spicy Shrimp, Snow Crab, Teriyaki Chicken and Salmon.  \n\nIt's not a large restaurant with very limited seating.  However, don't be surprised to see the line snaked-out the door during lunch.  Needless to say, I typically go after the lunch crowd to avoid the lines.  Make sure to review the large menu board to see the entire menu, including their sets.  The price is right as the Edamame Set is $10 for 3 onigiri's.  I have yet to try their Salad or Rice Bowls, but that will be for a future visit.", "rating": 4, "date": "2016-09-23"}, {"excerpts": ["Only tried unagi and snow crab. ", "Snow crab was soo good! ", "Unagi was good too ", "but at the same time, it's not that special since you can order unagi at most places that sell rice balls. "], "author": "Joanne K.", "review": "Only tried unagi and snow crab. Snow crab was soo good! Unagi was good too but at the same time, it's not that special since you can order unagi at most places that sell rice balls. I will definitely come back to try the other flavors. \n\nAlso, my bf ordered their side of chicken karage and boy was it really a side. They only gave 4 pieces but he said it was good so if you want that, go for it! Just be aware you'll be only paying for 4 pieces of chicken.", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["Gourmet musubi onigiri (rice balls) filled with sushi a tasty assortment of flavors:  teriyaki chicken, unagi, tarako (spicy fish eggs), snow crab, baked salmon, or seaweed.  ", "They place your choice of filling between two triangles of white rice, then wrap it in a sheet of pressed seaweed.  \n"], "author": "Richard H.", "review": "Gourmet musubi onigiri (rice balls) filled with sushi a tasty assortment of flavors:  teriyaki chicken, unagi, tarako (spicy fish eggs), snow crab, baked salmon, or seaweed.  They place your choice of filling between two triangles of white rice, then wrap it in a sheet of pressed seaweed.  \nThis restaurant offers several ways to market their  onigiri:\nEdamame set:  2 choices of onigiri with takuan and edamame.\nZosui set:  1 onigiri and a cup of broth, rice and protein.\nBowl:  three topping over rice, takuan, and edamame", "rating": 4, "date": "2016-04-11"}, {"excerpts": ["The following fillings are great:\n+ snow crab\n+ unagi\n+ chicken teriyaki\n+ shiitake\n\n"], "author": "Jenny H.", "review": "Ridiculously satisfying lunch place! \n\nOften times, there's a line out the door because it's such a small shop. But trust me, it moves so fast. You can get your lunch within 15 minutes. You can also see them making your food right in front. I love it when you can see the kitchen and fresh ingredients -- it just shows how confident they are in what they serve.\n\nI've tried the rice bowl and onigilly(rice balls). Both exceptional. Take your pick based on your preference. Definitely try out the set meals if you're ordering more than 1 onigilly. \n\nMy favorite:\n* Rice bowl with 3 onigilly fillings on a bed of rice w/ organic mixed greens, edamame, and pickles. ($10- $12 range depending on your choice of filling). The presentation was perfect, hot (rice + fillings) on one side and cold (salad) on the other. I was satisfyingly full, which is great because I didn't feel bloated after the meal!\n\nThe following fillings are great:\n+ snow crab\n+ unagi\n+ chicken teriyaki\n+ shiitake\n\nI'm looking forward to trying the chicken karaage ($3.68) next time. It's unfortunate that it's only a side and can't be a filling :(", "rating": 5, "date": "2016-08-04"}, {"excerpts": ["My favorite onigilly selections are Unagi and Snow Crab. "], "author": "Angel C.", "review": "I come here once in a while to spice up my lunch routine :) I have never had onigilly in other places, but this has totally gotten me hooked. I'm now in a hunt for more places that offer this. After all, onigilly doesn't open till very late :'(\n\nI love their new Zosui set (Japanese rice soup w/ one onigilly), though sometimes I'm very tempted to get more onigilly... My favorite onigilly selections are Unagi and Snow Crab. There are times when I get the Edamame set (three onigillys) with just Unage for all three. It's absolutely delicious. \n\nThey don't have much space to dine in, so I usually do take out and eat in the park nearby on Pine street. When the sun is out, this is particularly enjoyable to do. Since the place is small, you most likely need to wait in line for 15 minutes or so. Try to avoid the 12pm lunch rush if you can.", "rating": 4, "date": "2017-01-23"}, {"excerpts": ["I ordered the edamame set which included 3 onigiris (spicy kogi, snow crab, & salmon) ", "My favorite of the 3 in order are: 1) salmon 2) snow crab & 3) spicy kogi.\n\n"], "author": "Kevin S.", "review": "Its a fun size snack.\n\nIn my review, I think my opinion may be affected by the fact that I started eating it like an hour after purchase. I basically had a feast that included sushirito as the main course. Okay so my friend and I came here for lunch on Friday, and of course this whole financial district is just super crowded during rush. Line goes out the door but the orders move by fast.\n\nI ordered the edamame set which included 3 onigiris (spicy kogi, snow crab, & salmon) w/ edamame/pickled daikon.\n\nSo I've had onigilly once before in the embarcadero area, and I would say my first time was better. The ones here don't seem to have as much filling or of a strong taste to them. Maybe it's because they have a bigger demand of customers? Who knows? Again if I had eaten them right away, it probably would have been better. I liked them all, each having a unique taste. The seaweed wrap doesn't fall apart, and the rice holds together well. Quality overall was only decent.\n\nMy favorite of the 3 in order are: 1) salmon 2) snow crab & 3) spicy kogi.\n\nI might stop by again if I'm in the area.", "rating": 3, "date": "2016-03-27"}, {"excerpts": ["I've tried the karage (runs our quite quickly), snow crab, and spicy shrimp-- ", "the snow crab is a favorite among most people but is usually too saucy and mayo-y for my taste. \n\n"], "author": "Maggie Y.", "review": "This is definitely me and my coworker's go-to lunch spot!\n\nNot a suitable place to dine in-- its more of a grab and go lunch spot as the lines get super crowded and the tables are tiny. The cashier is always so friendly and is a great conversationalist --always a fun time talking to him. \n\nMy usuals-- the salmon zosui (a winter offering, but so delicious), the takana (sesame mustard greens), miso tuna, and sometimes when I get a salty craving the tarako (pollock roe). \n\nI've tried the karage (runs our quite quickly), snow crab, and spicy shrimp-- the snow crab is a favorite among most people but is usually too saucy and mayo-y for my taste. \n\nOverall, food is delicious and filling a great lunch option but can get quite long during prime lunch hours. \n\nP.S.\nI really wish they still had stamp cards-- though it doesn't really stop me from coming back for more!", "rating": 5, "date": "2016-02-29"}, {"excerpts": ["The snow crab is amazing!!! "], "author": "Olivia S.", "review": "Oh Onigilly, you do the onigiris right. Thank you!\n\nWhat can I say? The okra is delish... The snow crab is amazing!!! And an awesome deal for a set of 3 + edamame, I must say ;9\n\nIt's a very popular spot in FiDi so be prepared to wait, but trust me, it's worth it. Every. Damn. Bite!", "rating": 5, "date": "2015-11-22"}, {"excerpts": ["- Snow Crab onigilly is made with real snow crab (delicious!) \n- Haven't tried an onigilly that I haven't liked\n"], "author": "David D.", "review": "Pros:\n- Onigilly are well constructed with an assortment of flavors to appease any palate.\n- Snow Crab onigilly is made with real snow crab (delicious!) \n- Haven't tried an onigilly that I haven't liked\n- Seasoning salt on the counter is a delicious addition to the white rice used in onigilly\n\nCons: \n- A bit pricey in relation to portion size and ingredients. Profit margins must be huge!\n- Location is a bit small and crowded for the lunch hour rush\n- Not located closer to my home (Ha!)", "rating": 4, "date": "2016-10-31"}, {"excerpts": ["Spicy shrimp and snow crab are my favorite, fast service and great food"], "author": "Nan L.", "review": "Spicy shrimp and snow crab are my favorite, fast service and great food", "rating": 5, "date": "2017-12-22"}, {"excerpts": ["I have tried the snow crab ($3.45) and the soboro ($2.76) and both were delish. ", "I would never have even tried this spot because I thought it was a sit-down restaurant or something ", "but my coworker asked me to try hers "], "author": "Emma H.", "review": "Onigilly makes these delicious little...onigillies....what the heck is that you ask?  It's basically a tea sandwich made from rice, filling and nori.  They mold brown sushi rice into two small triangles (if you put them together to form a square, they would be about the size of a slice of sandwich bread) then they put some filling inside and then swaddle the little \"sandwich\" in a piece of nori.  There are all different types of fillings.  I have tried the snow crab ($3.45) and the soboro ($2.76) and both were delish. I would never have even tried this spot because I thought it was a sit-down restaurant or something but my coworker asked me to try hers and I was instantly hooked!\n\nCheap, yummy lunch in the Financial District!", "rating": 5, "date": "2016-01-15"}, {"excerpts": ["(+) Snow Crab. ", "This is probably my second favorite. ", "The crab is super fresh and filling. "], "author": "Tram N.", "review": "Don't be fooled by the serving size! I always get a onigilly set and it would fill me up until dinner time! \n\nTIP: Use their online app and order ahead of time so it's ready by the time you pick it up. I made the mistake of coming in at 12:30PM and it was packed (took about 20 minutes to order and get the food). The store is pretty small too so there wasn't that much space. \n\n(+) Unagi. I think the unagi is probably my favorite so far! Love the sauce that accompanies it. You definitely won't need any extra sauce with it. Sweet and savory goes so well together! \n\n(+) Snow Crab. This is probably my second favorite. The crab is super fresh and filling. Definite worth it if you don't know what to get! \n\n(/) Spicy Crab. I think it was better my first time but it tasted so bland my second time. I will probably pass on this next time and try something new. It definitely wasn't as spicy as I would like and it's lacking some flavors. \n\nFor $10, it is on the pricier side but definitely work it if you're looking to try something new for lunch and something that's quick and easy to eat! :)", "rating": 4, "date": "2015-02-04"}, {"excerpts": ["As for recommendation on orders:\nUnagi ( be careful with bones)\nSalmon\nSnow Crab\nTeriyaki Chicken\nSoboro\nstrawberry mochi: a MUST try, but it's seasonal only."], "author": "Yilin Y.", "review": "I'm a regular at this place and I prefer dinning in if I have time. It's located right next to my school and I go here almost every week between classes. The onigiri are awesome, the service is great, the store is great, EVERYTHING IS WHERE IT SHOULD BE! :D\nThe casher is super nice and would recommend on the onigiri if you couldn't make up your mind. The waiting time of all order is around 3 to 5 minutes, which is another reason why it's great for a quick lunch during class breaks.\nI always order the 3 pieces edamame set if I'm very hungry, and it comes with beans on the side. If I'm just ok-ay hungry, I'd go for the miso soup set, which comes in 2 pieces onigiri and soup on the side. I'm allow to choose almost all type of onigiri to put int the set. They also have japanese tea drinks and soda as well. There's a buy 10 get 1 free set lunch card ( which I always forgot to get :[ ) for discount as well. The total price of lunch often comes down to around $10-15 per person.\nAs for recommendation on orders:\nUnagi ( be careful with bones)\nSalmon\nSnow Crab\nTeriyaki Chicken\nSoboro\nstrawberry mochi: a MUST try, but it's seasonal only.", "rating": 4, "date": "2015-12-19"}, {"excerpts": ["- snow crab: a lighter taste of delicious fresh crabmeat; rounds out the greasiness of other options\n- salmon: probably the most \"traditional\" onigiri; tastes like fresh salmon and a bit of japanese mayo\n- unagi: if you love eel like I do, you'll love this one; tastes like an unagi nigiri at a great sushi place, but with more unagi!\n\n"], "author": "Brittany C.", "review": "I love onigiri. Even though I know better (high school Japanese, anyone?), I have a tendency to refer to it as \"triangle sushi.\" But seriously, something about the rice (not quite sushi rice, it seems) and the filling (usually salmon or another delicious fish) put together into a little triangular package is so delicious. And Onigilly is a great place to get your onigiri fix in Financial District. The lunch line is long, but fast, and the employees are super friendly.\n\nThe way it works is you can order a set of 3 onigiri for $9 (there's also rice bowls, which I hear are delicious as well). There's a lot of options, but here are the onigiri I've tried:\n- spicy bacon: sounds weird, but it is actually quite delicious; note that this is definitely one of the greasier options\n- snow crab: a lighter taste of delicious fresh crabmeat; rounds out the greasiness of other options\n- salmon: probably the most \"traditional\" onigiri; tastes like fresh salmon and a bit of japanese mayo\n- unagi: if you love eel like I do, you'll love this one; tastes like an unagi nigiri at a great sushi place, but with more unagi!\n\nThe portions are decent (but not huge) and they aren't skimpy with the filling. If you're eating in, enjoy your onigiri with some free barley tea.", "rating": 4, "date": "2014-09-23"}, {"excerpts": ["I ended up ordering a salad bowl with toppings of their spicy shrimp, spicy bacon, and snow crab. ", "I also ordered a matcha green tea lemonade with the food. ", "The snow crab tasted a bit off, and the spicy shrimp was just okay. ", "The only thing I liked was the spicy bacon. ", "Some of the salad greens at the bottom of the bowl were bruised.... "], "author": "Ava F.", "review": "This place is literally a block away from my work so I always pass by this restaurant. Finally decided to give this a try. The cashier was really nice, genuinely friendly and eager to help this first timer. I ended up ordering a salad bowl with toppings of their spicy shrimp, spicy bacon, and snow crab. I also ordered a matcha green tea lemonade with the food. The wait wasn't long as I went in just a little after 11 am. \n\nThe matcha green tea lemonade is interesting. It tastes mostly like lemonade, but it's got a slight matcha after taste. Not too bad. Terms of food, I should've stuck with their onigilly's or gotten a rice bowl. The cold food did not go too well with greens. The snow crab tasted a bit off, and the spicy shrimp was just okay. The only thing I liked was the spicy bacon. Some of the salad greens at the bottom of the bowl were bruised.... boo :(\n\nIf I could give 3.5 stars I would.", "rating": 4, "date": "2015-02-23"}, {"excerpts": ["I chose three different ones - the spicy shrimp, the snow crab, and the terriyaki tofu. ", "Overall, I felt like everything was very \"clean\" and \"fresh\", but missing a tad bit of a taste, specifically the snowcrab. ", "The others were okay, but I think if they drizzled some sauce on top, it would have been 100. ", "I definitely didn't think a few of those onigillies would fill me up ", "but it definitely did. ", "3 later, I was stuffed. ", "I did see their bowl and salad which looked very appealing. ", "But given the option of poke bowl or these snacks, I would probably pick the poke bowl. ", "I like things with more sauce, something a little more sweet and tangy. ", "I wouldn't say in particular this is a ", "must go place, because I didn't think the taste was 100. ", "Most of the littl sandwiches are anywhere from $3.20-4.50."], "author": "Amy Y.", "review": "My co-worker took me to this location to try this dish. I've been around the area but suprisingly    have never been to this venue. We walked in and there were a few individuals in front of us and the menu was pretty extensive. They're known for their little triangle wraps which are known as \"onigilly\". There are various things you can chose from for what you would like the \"meat\" to be. I chose three different ones - the spicy shrimp, the snow crab, and the terriyaki tofu. Overall, I felt like everything was very \"clean\" and \"fresh\", but missing a tad bit of a taste, specifically the snowcrab. The others were okay, but I think if they drizzled some sauce on top, it would have been 100. I definitely didn't think a few of those onigillies would fill me up but it definitely did. 3 later, I was stuffed. I did see their bowl and salad which looked very appealing. But given the option of poke bowl or these snacks, I would probably pick the poke bowl. I like things with more sauce, something a little more sweet and tangy. I wouldn't say in particular this is a must go place, because I didn't think the taste was 100. Most of the littl sandwiches are anywhere from $3.20-4.50.", "rating": 3, "date": "2017-04-08"}, {"excerpts": ["I ordered the teriyaki tofu, spicy shrimp, unagi, and snow crab. \n\n", "The unagi and snow crab was good but nothing special. "], "author": "Michelle T.", "review": "I ordered the teriyaki tofu, spicy shrimp, unagi, and snow crab. \n\nThe teriyaki looked the least appealing but it was tasty because of the teriyaki sauce. I wished it was made with fried tofu instead of soft tofu so it will add more texture to it. i wasn't able to taste the tofu because of the overwhelming amount of rice compared to teriyaki. It felt like I was eating seaweed and rice with teriyaki sauce. \n\nThe spicy shrimp was not that spicy but good nonetheless. It was made with baby shrimp. \n\nThe unagi and snow crab was good but nothing special. I like how they use real crab instead of the imitation stuff. \n\nThey said they use brown rice but it looks like white rice. \n\nOverall, this place was okay. Not somewhere I see myself coming back to because it's not my type of food.", "rating": 2, "date": "2016-01-13"}, {"excerpts": ["The snow crab and well, basically all of them are good. ", "But TARAKO is my favorite "], "author": "Joanna S.", "review": "Have I really not written a review about the place I crave all the time? The place that satisfies all my cravings and tastes like home? \n\nI love onigilly!!! The 2 I constantly get is the Tarako and unagi onigilly. They come out warm and a perfect triangle. The snow crab and well, basically all of them are good. But TARAKO is my favorite and I don't even know where else to find that! \n\nGet the combos! There's always a line for lunch but it goes quickly. They close early so buy dinner too earlier on in the day. They take card and have an onigilly express in the embarcadero center as well! Something so simple, made so well and so good. I love you, Onigilly!", "rating": 5, "date": "2015-08-21"}, {"excerpts": ["- MUST TRY: shiitake mushroom, teriyaki chicken, snow crab, spicy shrimp\n- To Avoid : ", "Salmon, its too dry\n- Each onigilly range from $3-$4 each\n- Its simple, healthy, light, quick and reasonably priced lunch"], "author": "Payal B.", "review": "Onigilly is a triangle rice ball filled with happiness :) A great lunch spot in Fidi  \n\n- Gets crowded during lunch hours, so try to be there by 12PM.\n- Great place with vegetarian and vegans options too.  Tyy their shiitake mushroom \n- Must Try - The TRIO , 3 onigilly of your choice with pickel and edemamme $10.\n- Wide variety of fillings to choose from, vegetarian, meat and seafood options.\n- MUST TRY: shiitake mushroom, teriyaki chicken, snow crab, spicy shrimp\n- To Avoid : Salmon, its too dry\n- Each onigilly range from $3-$4 each\n- Its simple, healthy, light, quick and reasonably priced lunch", "rating": 5, "date": "2015-10-30"}, {"excerpts": ["Here at Onigilly, you can get fancy fillings such as miso tuna salad, spicy shrimp and snow crab. "], "author": "Christine W.", "review": "Traditionally, Japanese onigiri (rice balls) are filled with salted salmon or pickled plums.\n\nHere at Onigilly, you can get fancy fillings such as miso tuna salad, spicy shrimp and snow crab. They have veggie, seafood and meat options so everyone can have something to suit their taste. \n\nService is friendly and the restaurant is really small with limited seating, so it can get uncomfortably packed. I wouldn't suggest coming here if you're hungry enough to eat a horse... They're rice balls; don't expect a heavy meal!", "rating": 5, "date": "2016-06-24"}, {"excerpts": ["This place also doesn't have the usual meats, but instead have spicy bacon, snow crab, and soboro.\n\n\n"], "author": "Jonathan B K.", "review": "A small lunch spot in the Chinatown area. Great if:\n\n1) you want something you can eat on the go. The small rice balls with meat are easy to eat and come with edamame if you choose the combo, which I think is a good deal.\n\n2) like a variety of items in one meal. I like that I can mix and match vegetables and meat in one order. This place also doesn't have the usual meats, but instead have spicy bacon, snow crab, and soboro.\n\n\nIt's not so great if:\n\n1) you have a party of larger than 4 people. There's no space in there.\n\n2) you don't like rice, The ratio of rice to meat is astounding; you're likely to get full off of the rice alone.\n\nI asked the cashier what was popular/good, and she basically listed everything on the menu, which was funny but not entirely helpful haha. Overall, the food is not likely to blow you away, and nothing about the meal warranted a return either.", "rating": 3, "date": "2016-12-27"}, {"excerpts": ["I ordered an onigilly set of three onigiri (snow crab, unagi, and salmon) with a side of edamame and pickled radish. ", "I absolutely loved the snow crab onigiri. ", "Sure it was with mayo, which I'm normally not too fond of, but this was my \nfavorite flavor out of the three. ", "Unagi/eel is good with the sauce it usually comes with, but I've had more flavorful unagi. ", "Something about it was also pretty unique flavored though. "], "author": "Sara T.", "review": "Love how fast they get your order to you. While I was paying for my order at the cashier, I feel like they were already scooping the fillings to my onigiri! \n\nI wasn't kidding, because after I decide to settle down at the small table in the back near the tea/utensil station and take some pictures of their flawless assembly line, I heard my number get called. I thought I was taking a picture of my order, but it was actually for the two guests that ordered after me. Mine was already done and ready for pick-up. Ha!\n\nI ordered an onigilly set of three onigiri (snow crab, unagi, and salmon) with a side of edamame and pickled radish. I absolutely loved the snow crab onigiri. Sure it was with mayo, which I'm normally not too fond of, but this was my \nfavorite flavor out of the three. Unagi/eel is good with the sauce it usually comes with, but I've had more flavorful unagi. Something about it was also pretty unique flavored though. Salmon was too dry. \n\nWould come again though, especially if I'm in the area and craving some onigiri!", "rating": 4, "date": "2014-11-25"}, {"excerpts": ["My favorite fillings are the chicken, snow crab and salmon so far. ", "Onigilly set (9) and you're set for the rest of the day ", ":)"], "author": "Jenny Q.", "review": "Make all the jokes you want, of course I like rice balls. \n\nYou get a well-balanced lunch of three onigiris with their lunch set. They're moderately sized but if you choose your fillings wisely it'll fill you up. I was originally lured in by a deal offered by Paypal. If you downloaded their app and ordered at certain eateries you'd get $5 off. Sadly something was wonky with on Onigilly's side and they couldn't process the offer. The cashier told me to send Paypal customer service an email but it wasn't a huge deal to me. Paypal app deleted.\n\nOverall solid quick lunch option. Have not tried the rice bowls yet but they look enticing. My favorite fillings are the chicken, snow crab and salmon so far. Onigilly set (9) and you're set for the rest of the day :)", "rating": 4, "date": "2015-05-20"}, {"excerpts": ["I ordered the Edamame combo with the snow crab, spicy shrimp, and unagi oginillies and they were delicious. ", "I felt like the size of each was just right. "], "author": "Gail M.", "review": "Love this place! I went in at around 11:45am and there was no line.\n\nThe employees were welcoming and friendly as I walked through the door. \n\nI ordered the Edamame combo with the snow crab, spicy shrimp, and unagi oginillies and they were delicious. I felt like the size of each was just right. Three oginillies was just enough to fill me up, but not make me feel bloated. \n\nMy only issue was with the spicy shrimp. I took my order to-go and by the time that I got back to work the sauce had creeped through the seams of the seaweed and the bottom of 2 of my oginillies was covered with it and it became a very messy meal.", "rating": 4, "date": "2016-01-26"}, {"excerpts": ["I get the shrimp tempura, snow crab and teriyaki chicken. "], "author": "Kimberly H.", "review": "This place is small and crowded for a reason.\nOnigilly is BOMB! I get the shrimp tempura, snow crab and teriyaki chicken. I shy away from raw fish because it's really warm in there, and I don't know if the food sitting on the line is cold enough to prevent bacteria or not. \n\nI'm a huge fan of the miso soup, their tofu chunks are huge! Seaweed salad is good. I wish the guy at the front didn't always ask you for a tip, it's awkward. \n\nCatering is excellent. Easy to contact and order, they even deliver if you're in the area! Always a hit in the office.", "rating": 4, "date": "2015-10-28"}, {"excerpts": ["After looking at so many options, I went with the snow crab, spicy shrimp, and soboro.  ", "The snow crab was surprisingly fresh ", "and oh so yummy, by far my favorite out of the three that I tried!  ", "The spicy shrimp had a nice kick to it and had just the right amount of spice with the rice.  ", "It was just so flavorful!  "], "author": "Kevin C.", "review": "Compliments to the PayPal app, my friend and I ventured out to try this place during the lunch rush.  Spend $5, get $5 back from PayPal, just link your banking account or credit card and be sure to \"save offer\" first before paying through the app.  Basically, you get 50% off, I'm sold!  \n\nYou have a couple of options here:  Rice Bowl (which I got), Onigilly set (3 choices of onigilly), or the Soup set (2 choices of onigilly with miso soup).  The rice bowl comes with a side of edamame which I wasn't too crazy about but it's healthy.  After looking at so many options, I went with the snow crab, spicy shrimp, and soboro.  The snow crab was surprisingly fresh and oh so yummy, by far my favorite out of the three that I tried!  The spicy shrimp had a nice kick to it and had just the right amount of spice with the rice.  It was just so flavorful!  The soboro was a delicious and filling and filled me up.\n\nReasonably priced and a healthy option for lunch that won't induce you to a food coma when you go back to the office!", "rating": 4, "date": "2014-02-18"}, {"excerpts": ["I always choose from the seafood onigillys - miso tuna, spicy shrimp, snow crab, fish roe... ", "they're all really good. ", "I usually get 2 onigillys with a side of pickled radish. "], "author": "Melody Y.", "review": "This is starting to become my favorite place to grab lunch in FiDi. It's fresh, filling, delicious, healthy-ish and not too expensive. I always choose from the seafood onigillys - miso tuna, spicy shrimp, snow crab, fish roe... they're all really good. I usually get 2 onigillys with a side of pickled radish. The chicken karaage is just okay. \n\nMoreover, everyone here is SO friendly and the line moves quickly, even when it looks long. Love this place!", "rating": 5, "date": "2016-06-10"}, {"excerpts": ["Snow Crab and Salmon are my top two faves for Onigilly. ", "I like the onigilly sets better than ordering as a bowl; it's more satisfying with the wrapped in seaweed in my opinion."], "author": "Briget P.", "review": "A quick, simple, and light lunch. Snow Crab and Salmon are my top two faves for Onigilly. I like the onigilly sets better than ordering as a bowl; it's more satisfying with the wrapped in seaweed in my opinion.", "rating": 4, "date": "2016-10-11"}, {"excerpts": ["I've tried the spicy bacon, snow crab one, shiitake and the salmon. ", "I personally prefer Unagi over anything else because it's consistent and it tastes good. ", "The spicy bacon was a bit salty ", "and so were the shiitake and salmon. ", "And for the snow crab, it was overpowered with mayonnaise, which was kind of gross in my opinion. ", "Great place to grab a quick bite though. ", "Oh and if you like miso soup, I suggest skipping it here. ", "I've tried it a few times in hopes "], "author": "cadence p.", "review": "Just get the Unagi, you won't regret it. I've tried the spicy bacon, snow crab one, shiitake and the salmon. I personally prefer Unagi over anything else because it's consistent and it tastes good. The spicy bacon was a bit salty and so were the shiitake and salmon. And for the snow crab, it was overpowered with mayonnaise, which was kind of gross in my opinion. Great place to grab a quick bite though. Oh and if you like miso soup, I suggest skipping it here. I've tried it a few times in hopes I just came on a bad day for it and to my disappointment, it always tastes watered down :( \n\nWould give this place 5 if there were many more things on their menu that I like.", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["Got the snow crab and the spicy shrimp, teriyaki chicken. ", "This place definitely gives Sushiritto a run for its money because here you get to try more things at once which is a big win win for me. ", "Only complaint is probably the seating, they have an upstairs office it seems ", "but it always seems empty, it would be cool if they could turn it into a seating area for customers."], "author": "Navdeep D.", "review": "Food is ridicously good here. Got the snow crab and the spicy shrimp, teriyaki chicken. This place definitely gives Sushiritto a run for its money because here you get to try more things at once which is a big win win for me. Only complaint is probably the seating, they have an upstairs office it seems but it always seems empty, it would be cool if they could turn it into a seating area for customers.", "rating": 4, "date": "2016-08-11"}, {"excerpts": ["We had the spicy bacon, which was good, and the snow crab, which was excellent.  \n\n"], "author": "Jason H.", "review": "Came here late on Friday afternoon and there was no line.  The onigiri is so familiar, from travels in Asia - and it's done really well here.  We had the spicy bacon, which was good, and the snow crab, which was excellent.  \n\nThe prices are OK, but it is a fair amount of rice and filling, so I think it's good.\n\nDefinitely stop by for a quick snack, or get three and make a meal (it's cheaper!)", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["The three I choose were eggplant, spicy bacon, and snow crab. ", "All three were delicious. ", "They are also extremely filling! ", "I also love that they are made fresh! ", "I definitely want to go back and try some of the other flavors."], "author": "Nia R.", "review": "I love these little Japanese rice balls. Luckily this place is open until 4 so I missed the lunchtime rush. I got the 3 onigilly set that comes with soy beans and pickled radish. The three I choose were eggplant, spicy bacon, and snow crab. All three were delicious. They are also extremely filling! I also love that they are made fresh! I definitely want to go back and try some of the other flavors.", "rating": 4, "date": "2016-08-10"}, {"excerpts": ["I ordered the Unagi, Salmon, and Snow crab because I like seafood ", "and I like the traditional Japanese flavors. ", "The Onigilly's meat, rice, and seaweed work in perfect harmony to create a delicious yet simple meal. "], "author": "Richie C.", "review": "This is one of the best \"Fast Foods\" you could eat - It's real food, but made really fast without the sacrifice of nutrition\n\nI ordered the Unagi, Salmon, and Snow crab because I like seafood and I like the traditional Japanese flavors. The Onigilly's meat, rice, and seaweed work in perfect harmony to create a delicious yet simple meal. You can't go wrong with this since what you see is what you get and nothing less. \n\nThe restaurant is small and perfect for a quick bite there or to go. \n\nI would be a regular if I worked closer, but definitely a solid place for lunch or a snack.", "rating": 4, "date": "2016-01-05"}, {"excerpts": ["I recommend everything, from spicy shrimp to teriyaki chicken, snow crab, and them best of all was the miso soup! ", "Awesome food guys!"], "author": "Deo I.", "review": "I live all the way from peninsula but I usually come here just to get an Onigilly. I recommend everything, from spicy shrimp to teriyaki chicken, snow crab, and them best of all was the miso soup! Awesome food guys!", "rating": 5, "date": "2016-10-01"}, {"excerpts": ["Tried the snow crab and unagi and both were tasty and just the right amount for us not to be hungry but not too full for dinner!"], "author": "Esther S.", "review": "Needed a small snack to hold me over until dinner and heard about this place so decided to check it out. Small place but made for convenience for sure. You can order and pay ahead of time online and you can call in orders. Simple menu with veggie, meat, and seafood choices. Tried the snow crab and unagi and both were tasty and just the right amount for us not to be hungry but not too full for dinner!", "rating": 4, "date": "2015-12-17"}, {"excerpts": ["Decided on the salmon and snow crab (real crab meat!) ", "Filling was flavorful and the cooks were not skimpy. ", "Line gets long during lunch hours but the cooks were quick."], "author": "Diana L.", "review": "Visited this place on a Thursday afternoon. First time here and I chose to try something subtle. Decided on the salmon and snow crab (real crab meat!) Filling was flavorful and the cooks were not skimpy. Line gets long during lunch hours but the cooks were quick.", "rating": 3, "date": "2016-07-11"}, {"excerpts": ["My favorite is definitely the snow crab and the spicy bacon. "], "author": "Kendra W.", "review": "This is pretty much my favorite lunch spot. It's so fun to make a lunch by mixing and matching 2-3 onigilly(ies?). You don't think it -- but they are quite filling.\n\nI loved eating onigiri in Japan so was very happy to see the fusion take on it back in SF.\n\nMy favorite is definitely the snow crab and the spicy bacon. I highly recommend the chicken karage as well if you can eat that much food.\n\nI JUST finished my punch card and can't wait to cash it in :D", "rating": 5, "date": "2015-10-15"}, {"excerpts": ["Both onigiri (snow crab and miso tuna) were tasty and filling, especially with a generous amount of chilli pepper powder sprinkled on top.  "], "author": "Joanne G.", "review": "Onigilly is one of those places I'd never had the chance to try since they cater to the Fidi lunch crowd and close down early.  So while in the area last week, I finally sure to drop by for a quick solo meal, and was really happy with everything I'd tried.  \n\nMiso soup seems to  be made from scratch, with my small cup containing seaweed, tofu and even a whole shitake mushroom.  Both onigiri (snow crab and miso tuna) were tasty and filling, especially with a generous amount of chilli pepper powder sprinkled on top.  The green tea and cold barley tea (both free) were also really nice.  \n\nNow I just wish I worked closer so I could come by more often!", "rating": 4, "date": "2014-12-01"}, {"excerpts": ["Got the Edamame combo with the unagi, snow crab, and salmon. ", "It was delicious, fairly cheap, and I was happily full afterwards."], "author": "Ava H.", "review": "Great for a quick bite! Hit this place up today for lunch, miraculously managed to step in right before the line formed. Got the Edamame combo with the unagi, snow crab, and salmon. It was delicious, fairly cheap, and I was happily full afterwards.", "rating": 4, "date": "2016-02-16"}, {"excerpts": ["I wanted to dive into the snow crab but I couldn't handle any more food. "], "author": "Yuhi K.", "review": "Had a meeting at the BOA Center and only had time for a ninja snack before heading on to my next destination. Walked down the street and around the corner to find this adorable (and tiny) place called Onigilly! Quality fast food for those of us who want a quick & light lunch. \n\nYou can purchase your onigiri a la carte but I went with the Miso Soup set ( 2 balls + 1 miso soup ). It came out a little over $7 before tip. It reminded me of mornings at Mitsuwa. Perfectly shaped BROWN-RICE BASED onigiri with fillings like Hijiki ( seasoned seaweed + carrots ) & Unagi ( eel ). I wanted to dive into the snow crab but I couldn't handle any more food. T_T\n\nFor onigiri, it's a little on the pricy-side but considering the location, quality of ingredients, filling selection (VEGAN FRIENDLY), and top notch customer service, it's worth it. If I'm ever in the area, I will be sure to make a ninja stop at Onigilly.", "rating": 4, "date": "2014-03-11"}, {"excerpts": ["The snow crab one is basically a California roll in a rice ball. ", "I was hoping it would focus more on the crab, and I couldn't taste the lemon aioli. "], "author": "Kevin T.", "review": "I was pretty impressed with this place for a quick lunch option. I came before noon so there was no line and I can't speak to his crazy it gets during peak lunch hours. \n\nThe salted plum is fantastic if you like the sourness of ume. A bit saltier than most ume onigiri but I love the intense sourness and saltiness. Big flavor, go big or go home. 5/5\n\nThe spicy bacon is exactly what it sounds like. A bit of heat with bacon (the meaty kind not the fatty kind). I enjoyed this one immensely also. 5/5\n\nThe braised ground beef was flavorful and tasty. You could really taste the ginger-honey. 4/5\n\nThe snow crab one is basically a California roll in a rice ball. I was hoping it would focus more on the crab, and I couldn't taste the lemon aioli. 3.5/5\n\nThe miso tuna sounded interesting but ended up being just a can of Chicken of the Sea in a rice ball. Just tasted like basic supermarket canned tuna which isn't awful I suppose. 2.5/5\n\nThe fermented soybean was my experiment for this meal. I couldn't handle it but to each his own. I personally just don't like that flavor.\n\nOverall it's a nice light lunch, about $10 for 3 rice balls that you can also combo with Edamame or seaweed salad. Not the most filling (I had 5 of them and I was satisfies but still not full) but that doesn't mean it's not a good meal! Would definitely come again to get my favorites and try the many other flavors.", "rating": 4, "date": "2015-07-01"}, {"excerpts": ["(From top to bottom) teriyaki tofu, snow crab, and salmon. ", "The unagi is also a must try."], "author": "Jaclyn M.", "review": "Love this place. Always stop by when I'm in this area of SF and I want a quick bite to eat but am not up for trying anything new. I'm a big meat connoisseur and I also eat my fair share of sushi, so its nice that they have a little something for everyone. Including you vegans and gluten free people too.\nThe Edamame Set w/ a side of Wakame salad (not pictured) is the best way to experience Onigilly but you have to get there close to the time they open (11:00am) because they run out of wakame salad fast.\nAnyways! Definitely would recommend trying out this place at least once if you find yourself in the area. \n\n(From top to bottom) teriyaki tofu, snow crab, and salmon. The unagi is also a must try.", "rating": 5, "date": "2015-04-21"}, {"excerpts": ["It was hard to choose but I ended up trying: miso tuna salad, spicy shrimp, and the snow crab.\n\n", "The miso tuna salad was amazing! ", "It is very standard filling and the flavors go so well with the seaweed. ", "A must try! ", "The snow crab was also good but the crab tasted a bit fishy (salt water) so it was a tiny bit unpleasant the first bite ", "but it got better as I ate. ", "The third one I tried was the spicy shrimp and it was really good but ", "in my opinion a little too saucy (the sauce was runny). "], "author": "Isabella L.", "review": "Stumbled across this place as I was walking around the area after an interview. The interior of the little shop is clean and modern and very cute. Wood with green accents. \n\nThey have a selection of dishes in addition to the onigiri. They have miso soup, edamame, rice bowls, chicken karate etc. they have an extensive selection of onigiri (basically rice wrapped with seaweed with a filling). It was hard to choose but I ended up trying: miso tuna salad, spicy shrimp, and the snow crab.\n\nThe miso tuna salad was amazing! It is very standard filling and the flavors go so well with the seaweed. A must try! The snow crab was also good but the crab tasted a bit fishy (salt water) so it was a tiny bit unpleasant the first bite but it got better as I ate. The third one I tried was the spicy shrimp and it was really good but in my opinion a little too saucy (the sauce was runny). Would've liked a thicker sauce. \n\nI can't wait to come back and try the tempura shrimp and salmon one. I heard the pollock roe one is also amazing! I came here 10 mins before closing and they ran out of a lot of the fillings so id come sooner next time! Such a great find!\n\nAll onigiris are approximately $2.50-$3.50 each. Decently priced.", "rating": 4, "date": "2014-05-05"}, {"excerpts": ["I've settled on a few as my favorites, namely the torako (pollock roe) and snow crab.\n\n"], "author": "Willy W.", "review": "My go to place for a quick, light lunch in FiDi. I usually get the miso soup set to combat the year-round chilly-ness that is SF. I also like to eat there so I can take advantage of the complimentary barley tea. \n\nThe food is definitely on the pricey side from a cost to volume perspective, and I've tried a number of the different flavors and some are definitely better than others. I've settled on a few as my favorites, namely the torako (pollock roe) and snow crab.\n\nI'm very happy this place exists!", "rating": 4, "date": "2014-09-19"}, {"excerpts": ["I ordered the bowl with unagi, tanaka, and snow crab. ", "They accidentally subbed the snow crab for ground beef which is ok because everything was delicious!!! ", "My only wish is that they open a branch in LA! ", "Will definitely be back next time we're in town."], "author": "Diana M.", "review": "I had the chance to try Onigilly when my husband was in town for the VMware conference. I ordered the bowl with unagi, tanaka, and snow crab. They accidentally subbed the snow crab for ground beef which is ok because everything was delicious!!! My only wish is that they open a branch in LA! Will definitely be back next time we're in town.", "rating": 5, "date": "2015-09-03"}, {"excerpts": ["I tried their unagi and chicken teriyaki and my friend tried their spicy shrimp and snow crab . ", "After trying all four of them this was what  "], "author": "Sophia L.", "review": "I stopped by here with my friend after we had lunch in downtown. I tried their unagi and chicken teriyaki and my friend tried their spicy shrimp and snow crab . After trying all four of them this was what  I thought taste the best. \n\n1. Unagi was the best one  [5/5] \n2.Snow crab[4/5] \n3. Chicken teriyaki [3/5]\n4. Spicy shrimp [3/5]\n\nBut this place is pretty cool, I would definitely go back to try the other flavors!", "rating": 4, "date": "2014-08-05"}, {"excerpts": ["I ordered 6 onigiri:\nSnow crab\nMiso tuna\nSpicy tuna\nSpicy bacon\nTeriyaki chicken\nMiso Nasu\n\n", "I definitely LOVE SNOW CRAB!", "! ", "You MUST try one if it's your first time here. ", "I wanted unagi and salmon ", "but it ran out", "--they're really popular here. ", "My boyfriend agrees along with terayaki chicken. ", "I'm going to come back for unagi, salmon, snow crab, and teryaki chicken next time!"], "author": "Jackie T.", "review": "I literally to this onigiri shop from work and a sweet employee lets me in at the last 3 minutes before closing! Whew! It was my first time trying it out! \nThe man was patient and friendly with my orders, he helped me reccomend the items that were available at the moment. I love how the staff's vibe is so welcoming and cheerful! \n\nI ordered 6 onigiri:\nSnow crab\nMiso tuna\nSpicy tuna\nSpicy bacon\nTeriyaki chicken\nMiso Nasu\n\nI definitely LOVE SNOW CRAB!! You MUST try one if it's your first time here. I wanted unagi and salmon but it ran out--they're really popular here. My boyfriend agrees along with terayaki chicken. I'm going to come back for unagi, salmon, snow crab, and teryaki chicken next time!", "rating": 5, "date": "2015-08-05"}, {"excerpts": ["Just a personal preference, my favorites are tarako, snow crab, and unagi. "], "author": "Roy C.", "review": "This is a tribute to my favorite cashier in FiDi. \n\nJumpman, jumpman, jumpman, ball, ball, ball. Pronounced oh-NEE-ghee-lee, similar to Gilly on Game of Thrones with a hard \"G\", as opposed to a soft \"G\" which would sound like \"Jill-y\". Rice balls for days son. Heirloom Kokuho Rose organic, partially milled brown rice from Koda Farms, packing heat with the variety from soboro ginger-honey braised ground beef to tarako baked pollock roe aioli spread. Reasonably priced at around $3 each, variety is the spice of life, threesome every time my man. Just a personal preference, my favorites are tarako, snow crab, and unagi. I strongly suggest trying out all them selections as they are all rather different in flavors and texture. \n\nLunch time hustling, in the street of FiDi. An occasional who comes upon the man may wonder idly who he was, but seldom pursues this curiosity beyond a casual question. This man as many had accustomed to behind the counter is the cashier, a bandana tied firmly to his forehead during lunch hours, channeling the same ferocity as mythical momotaro riding into battle. In the busiest of hour, in the diversity of downtown, it's not that hard to spot him. One might even notice him with xenophobic eyes, as the only white guy working the line. The white guy with glasses? More than that, he notices your confusion as you stare at the blackboard, every single order, his service unwavering and never falter. His mouth steadfast with suggestions, yet tone soft with resolution. His gestures animated, yet controlled like an artisan that mastered his craft. Keith Haring in the flesh. One might question the validity of being a cashier as an art form, as similarly stances have been taken in regards to performance art, rest assure he doesn't do it for the fame, the limelight, the pay, merely a person with character playing a character.  However trivial, there is no debate about the significant an extraordinary cashier brings to the table on a daily basis for a business. \n\nThere are four different Onigilly locations, he is the reason I frequent this one. With all that said, it is with great sadness that I must say in my last two visits he has not been seen. I can only assume the worst and hope he found his true calling in life and that he has moved on to better things instead of dealing with the hoi polloi.", "rating": 4, "date": "2016-03-08"}, {"excerpts": ["The standouts were the snow crab, soboro, and tarako. ", "Note about the tarako: it's on the salty side, but the saltiness is a great contrast to the sweet soboro and the creaminess of the snow crab. "], "author": "Monelle A.", "review": "Mmmmm, my new favorite lunch spot! The perfect place to satisfy your Japanese/sushi cravings without the heaviness of a bento box. \n\nI came here the other day with my bestie. She tried the salad bowl with a choice of 3 toppings and I had the rice bowl with a choice of 3 toppings. Each came with a side of salad greens, edamame, and pickles. \n\nThe standouts were the snow crab, soboro, and tarako. Note about the tarako: it's on the salty side, but the saltiness is a great contrast to the sweet soboro and the creaminess of the snow crab. The unagi, spicy shrimp, and pickled mustard greens were also pretty good. \n\nMuch, much better than Sushiritto, which I think is overpriced and overhyped. Definitely getting added into my regular rotation of lunch spots!", "rating": 4, "date": "2015-01-08"}, {"excerpts": ["- Snow Crab: ", "Tasty, but nothing terribly outstanding as far as flavor goes. "], "author": "Emily Z.", "review": "Simple, quick, and priced like everything else in FiDi. \n\nI stopped by with a coworker on our lunch break, and we went with a two onigiri combo for ~$7 each, and a side of chicken karaage. I had to deduct a star for the chicken karaage because the karaage came out barely lukewarm, which to me indicates that it was leftover from an earlier batch and considering we were there right before the noon lunch rush, it's not really best practice. \n\nI got: \n- Spicy Shrimp: I love spicy food, and find that most spicy doesn't really fit my standards, so I was pleasantly surprised when the \"spicy\" really gives a kick. Not for the super faint of heart.\n\n- Snow Crab: Tasty, but nothing terribly outstanding as far as flavor goes. Definitely fresh, though.\n\nCoworker got the miso tuna (said it tasted like a tuna salad), and the unagi (said it was good, but a little too much sauce). I ended up getting a tarako to go, and it was definitely my favorite out of everything (on the salty side, though).\n\nDefinitely love the concept, and even though it doesn't look like alot of food, two onigiris will make you surprisingly full.", "rating": 4, "date": "2015-01-15"}, {"excerpts": ["I ordered three of their onigilly: snow crab, salmon, and teriyaki chicken. ", "My friend ordered the miso nasu (eggplant). ", "The eggplant was the tastiest of all; the snow crab and the salmon lacked flavor. \n\n"], "author": "Jason C.", "review": "I'm a fan of Japanese cuisine, so I thought I would try this sushi-cum sandwich outfit. The prices were a bit high, but then again, this is San Francisco, and in the Financial District no less, so the prices were more or less in line with what one might expect to pay for lunch in the area. The staff were friendly, and the cashier hands you back your credit card with two hands,  which I'm told is Japanese custom (they do it at Uniqlo too).\n\nI ordered three of their onigilly: snow crab, salmon, and teriyaki chicken. My friend ordered the miso nasu (eggplant). The eggplant was the tastiest of all; the snow crab and the salmon lacked flavor. \n\nIf you are looking for a unique lunch experience, it's worth a try. A harder sell for more than one return visit.", "rating": 3, "date": "2015-08-15"}, {"excerpts": ["After waiting 10 minutes or so I finally placed my order: the wakame set with the renkon and snow crab onigiri. ", "The snow crab was light and delicate tasting, but there was too much mayo inside. "], "author": "Sam F.", "review": "A pretty decent rendition of Japanese onigiri. \n\nI LOVE onigiri (Japanese rice balls), and so when I heard about Onigilly, a restaurant entirely devoted to them, I couldn't wait to try it out! Unfortunately this place is very popular with the lunchtime crowd, and I got stuck in the middle of it. After waiting 10 minutes or so I finally placed my order: the wakame set with the renkon and snow crab onigiri. I also ordered a green tea lemonade to drink while I waited, which was another 5 minutes or so. \n\nInside is quite small but it's okay because most people take their food to go. I liked how they served free mugicha (barley tea) and green tea to customers. While I waited for my food I drank some of my green tea lemonade, and I couldn't decide if I liked it or not. The first sip was far too sweet but it sort of grows on you after awhile. Even so I probably wouldn't order it again. As I watched them make the rice balls I noticed they weren't using the traditional method for onigiri: getting a ball of rice in one hand, placing the filling in the center and covering the filling with a bit more rice. Instead they had a triangle of pre-formed rice, stuck the filling on top, then added another triangle-shaped rice on top of that. Kind of like a rice sandwich? Weird. \n\nBut I guess the aforementioned technique allows you to stuff more filling inside which is good for the customer. The renkon (lotus root) was pretty good, not too salty, a bit spicy, and it had the right amount of crunch. The snow crab was light and delicate tasting, but there was too much mayo inside. I really enjoyed the wakame salad =)\n\nIn the end it's a decent onigiri offering considering most people don't know much about rice balls. But they are too expensive.", "rating": 3, "date": "2014-07-03"}, {"excerpts": ["I had the soboro, salmon, and snow crab rice balls and they were all very delicious!! ", "I would recommend this place to anyone."], "author": "Judy H.", "review": "I had onigiri (rice balls) for the first time at this place today. I bought the edamame set which included three rice balls of my choice along with pickles and edamame. I had the soboro, salmon, and snow crab rice balls and they were all very delicious!! I would recommend this place to anyone.", "rating": 5, "date": "2016-04-26"}, {"excerpts": ["Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. ", "I honestly believe they use real snow crab. "], "author": "Daniel D.", "review": "Absolutely amazing. I came here for lunch, on the recommendation of a friend. Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. I also had the Organic Matcha Lemonade. \n\nLet me be frank: I LOVE LEMONADE, and their Matcha lemonade just became a new favorite. The idea of the green tea threwme off, but I decidied to take the plunge. I'm glad I did.\n\nThe seaweed tasted very fresh and the meat exceeded expectation. I honestly believe they use real snow crab. Even the Wakame salad was great.\n\nDefinitely a new favorite restaurant!", "rating": 5, "date": "2015-05-05"}, {"excerpts": ["- Snow Crab - Light ", "but, if you like crab, this one is nice and subtle. ", "Yay for real crab meat! ", "- Snow Crab, Spicy Shrimp, Tarako - which comes out to $10"], "author": "Feli W.", "review": "I'll admit - the first two times I tried Onigilly I was not impressed. It took me about three tries before actually finding the combination of onigiris that impressed me enough to give this place 4 stars.\n\nBelow are the onigiri's I've had from least favorite to my current go-to's: \n\n- Natto - I think many people find this off-putting because of the texture but I actually don't mind it. However, I just felt like the flavor lacked a bit for me. \n\n- Salmon - This was one of the first onigiri's I got and I hadn't read the description thoroughly and assumed I was going to get raw salmon. I'm not a huge fan of cooked salmon but my coworkers have also mentioned they felt this one lacked a bit of flavor.\n\n- Miso Tuna Salad - Decent but nothing really memorable.Tastes just how it sounds. \n\n- Spicy Bacon - Pretty good but on the heavy/salty side so I don't typically order this often. \n\n- Snow Crab - Light but, if you like crab, this one is nice and subtle. Yay for real crab meat! (none of that imitation stuff!) \n\n- Spicy Shrimp - For a while this was my favorite - it's got great flavor and is a bit spicy but not in an overwhelming way. I've introduced Onigilly to a few friends (without telling them my preferences) and all of them have stated that this one was the standout. \n\n- Tarako - The new favorite. If you don't like fish roe you might not like this. What I love about this one is the unique flavor. It is on the saltier side but the rice balances it out. \n\nOther Pros - \n\n** Nice and clean\n** Super friendly staff\n** They use brown rice so you can feel like you're eating healthy! \n** Pretty decent lunch deals (esp for the FiDi area). I always get the 3 onigiri special (comes with edamame and picked radish) - Snow Crab, Spicy Shrimp, Tarako - which comes out to $10", "rating": 4, "date": "2014-01-09"}, {"excerpts": ["I loved my brown rice snow crab da best!! ", "Perfect amount of rice and filling ratio! ", "Really love the side edammame and yellow pickles on the side. "], "author": "Wendy T.", "review": "I loved my brown rice snow crab da best!! Perfect amount of rice and filling ratio! Really love the side edammame and yellow pickles on the side. I would still love to try the spicy bacon and other flavor next time!", "rating": 5, "date": "2014-09-17"}, {"excerpts": ["The spicy shrimp and the snow crab are excellent, the salmon can be bland. "], "author": "Sharon L.", "review": "Nice little spot for lunch. The line can get long at peak hours (think corporate lunchtime), but it's not too bad if you've got a friend with you. The spicy shrimp and the snow crab are excellent, the salmon can be bland. Someone's got an uneven seasoning hand...\n\n2 onigilly is usually enough for me, but people with bigger appetites will need 3.", "rating": 4, "date": "2015-02-11"}, {"excerpts": ["I got the eel, the snow crab, and the spicy bacon. ", "I wasn't crazy about the eel or the spicy bacon. ", "But the snow crab I loved! ", "If I ever go back, I would stick to the snow crab. ", "It was so delish! ", "3 triangles, 6 edamame pieces, and 3 slices of daikon (radish) ", "later (yes, they are a bit stingy), and I'm still kind of hungry. ", "It's a very very light meal. "], "author": "Junel S.", "review": "A very light meal for a not so very light price. That sums up Onigilly for me. It was my first time there and I opted for the combo (3 rice triangles with edamame and daikon). Total came out to $10, ouch!\n\nI got the eel, the snow crab, and the spicy bacon. I wasn't crazy about the eel or the spicy bacon. But the snow crab I loved! If I ever go back, I would stick to the snow crab. It was so delish! 3 triangles, 6 edamame pieces, and 3 slices of daikon (radish) later (yes, they are a bit stingy), and I'm still kind of hungry. It's a very very light meal. So if that's the type of meal you're searching for, Onigilly is the place for you!\n\nIt's an interesting concept - kind of like musubis or sushi rolls, but in a triangle. It's cute and Japanese. Onigilly is just ok for me. I think people are amused by the whole concept. But to grade the quality and quantity of what you get - just A-Ok!", "rating": 3, "date": "2014-02-03"}, {"excerpts": ["On a good note, the tamako and the snow crab were delicious."], "author": "S. G.", "review": "I am pretty impressed with the concept and the delivery of this place. I especially love the variety and for the price, it is a fair deal. My only complaint is that some of the rice balls aren't that good. I love okra, but it was extremely mushy. The unagi tasted like a salt ball. On a good note, the tamako and the snow crab were delicious.", "rating": 3, "date": "2015-09-16"}, {"excerpts": ["I got miso tuna, snow crab, spicy shrimp, sapporo beef (my apologies if i got this wrong), and the salmon. ", "I ordered 6, and the gentleman who rang me up was nice enough to give me a buy a certain amount and get one free stamp card and punched it twice since i ordered two sets. ", "YAY!! ", ":) ", "I couldn't wait to go home and eat this, ", "when i got back, i dropped everything and sat down to enjoy these babies. ", "The brown rice WAS NOT BAD ", "AT ALL", ", it tasted just like sushi rice, i would've been fooled if they didnt advertised the healthiness of it. ", "CHECK, and the taste was good too. ", "My favorites are the snow crab and spicy shrimp! ", "It has many decent size baby shrimps in there, NOM!!! ", ":) ", "As for tuna, I will stick to the japan ones. ", "The tuna and salmon didn't do much for me, or maybe i had too high of a expectation. ", "All in all, i would definitely come back, as this is the closest I can get to Japan for now. ", "Thanks Onigilly!"], "author": "Cindy C.", "review": "This is my little reminder of Japan. I recently went to Japan and have been missing their onigiri that I find in convenience stores and better yet the little store kiosks in their food court with gourmet onigiri. When I found out about this shop called onigilly, I was skeptical at first because it's not even spelled right :O and then i saw pictures where it's not wrapped all inside the rice.. I was like is this legit? And it's brown rice compared to the japanese sushi rice. Anywho, I was in the neighborhood one morning and decided to try some Onigilly! I ordered a variety of flavors to take to go and share with my mom. I got miso tuna, snow crab, spicy shrimp, sapporo beef (my apologies if i got this wrong), and the salmon. I ordered 6, and the gentleman who rang me up was nice enough to give me a buy a certain amount and get one free stamp card and punched it twice since i ordered two sets. YAY!! :) I couldn't wait to go home and eat this, when i got back, i dropped everything and sat down to enjoy these babies. The brown rice WAS NOT BAD AT ALL, it tasted just like sushi rice, i would've been fooled if they didnt advertised the healthiness of it. CHECK, and the taste was good too. My favorites are the snow crab and spicy shrimp! It has many decent size baby shrimps in there, NOM!!! :) As for tuna, I will stick to the japan ones. The tuna and salmon didn't do much for me, or maybe i had too high of a expectation. All in all, i would definitely come back, as this is the closest I can get to Japan for now. Thanks Onigilly!", "rating": 5, "date": "2015-02-14"}, {"excerpts": ["We had Soboro (ginger honey beef), Spicy Shrimp, Snow Crab and Unagui. ", "They were delicious and full of flavor. ", "Please note that 3 units will be enough for your hunger as each comes with q good portion of rice."], "author": "Flavio A.", "review": "First time trying the onigiri and we felt in love. Great format and great flavor. Easy to eat, not messy at all. The staff is friendly and fast, very fast! We had Soboro (ginger honey beef), Spicy Shrimp, Snow Crab and Unagui. They were delicious and full of flavor. Please note that 3 units will be enough for your hunger as each comes with q good portion of rice.", "rating": 5, "date": "2015-08-06"}, {"excerpts": ["I got the Spicy Shrimp and Snow Crab 'Onigilly' and they were both pretty decent... but not amazing or anything. ", "They do skimp on the filling a little--while I was watching them make it "], "author": "stephanie f.", "review": "I got the Spicy Shrimp and Snow Crab 'Onigilly' and they were both pretty decent... but not amazing or anything. They do skimp on the filling a little--while I was watching them make it I noticed they only put filling on the very upper-most corner that peaks out from the seaweed wrap lol.\n\nOn a sidenote... who else had their plastic fork break numerous times while trying to eat their meal?! Ate here with a friend and we both broke our forks 3+ times.. Food--3 stars. Forks--0 stars. Haha :P", "rating": 3, "date": "2015-09-22"}, {"excerpts": ["I got with the snow crab, unagi, and bacon which definitely added totally about $12. ", "It was still tasty and worth the try! ", "The wait was quick and was in and out about ten minutes. ", "Will be back to try more!"], "author": "Steph C.", "review": "Dropped by for my lunch break and was super excited to try from all of the reviews. I decided to order the rice bowl and it definitely filled me up! I got with the snow crab, unagi, and bacon which definitely added totally about $12. It was still tasty and worth the try! The wait was quick and was in and out about ten minutes. Will be back to try more!", "rating": 4, "date": "2016-09-15"}, {"excerpts": ["what i ordered... miso soup, unagi onigilly and snow crab onigilly\n\nunagi onigilly was nasty, chopped up unagi slithering in a pool of bbq tasting sauce\ncrab onigilly was like eating plain steam rice and having crab salad as an entree\nmiso soup was ok tasting but was just warm\n\nambiance... "], "author": "Gors P.", "review": "what i ordered... miso soup, unagi onigilly and snow crab onigilly\n\nunagi onigilly was nasty, chopped up unagi slithering in a pool of bbq tasting sauce\ncrab onigilly was like eating plain steam rice and having crab salad as an entree\nmiso soup was ok tasting but was just warm\n\nambiance... ok (a nice hole in a wall)\nservice... good (cashier was nice and smiley)\ncost... $- (fair)", "rating": 2, "date": "2015-03-03"}, {"excerpts": ["The shitake onigiri and snow crab onigiri are delicious! ", "They're made with organic brown rice "], "author": "Marian C.", "review": "I wish there were more places like these. I'm often in a pickle when searching for a quick snack. Usually the only viable options are something fried or unhealthy like a pastry. I needed something that wouldn't ruin my appetite for dinner. \n\nOnigilly to the rescue!\n\nThe shitake onigiri and snow crab onigiri are delicious! They're made with organic brown rice so you're not eating empty carbs!\n\nIt's a bit expensive but i think it's worth it.", "rating": 4, "date": "2012-12-17"}, {"excerpts": ["The Snow Crab is my favorite."], "author": "Olivia W.", "review": "This my go-to \"healthy\" lunch in the FiDi.  Fast, tasty, cheap but nothing special.  Still, I'll continue to return because quick, healthy options are few and far between. The Snow Crab is my favorite.", "rating": 3, "date": "2014-11-17"}, {"excerpts": ["Get the Snow Crab, Unagi for sure.  ", "Really good salads and very reasonably price.  ", "Not much space on the inside but a lot of take out ", "so there's usually a table when I'm in there during lunch."], "author": "Jay H.", "review": "My favorite place to go for lunch in FiDi.  Amazing Onigilly rolls.  Get the Snow Crab, Unagi for sure.  Really good salads and very reasonably price.  Not much space on the inside but a lot of take out so there's usually a table when I'm in there during lunch.", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["The salmon special was little dry, but the spicy bacon and snow crab was on spot. ", "Keep it up.. ", "you've got a fan."], "author": "Tyrone L.", "review": "Yummmmooooo. The salmon special was little dry, but the spicy bacon and snow crab was on spot. Keep it up.. you've got a fan.", "rating": 5, "date": "2014-10-03"}, {"excerpts": ["I ordered the set, snow crab, chicken teriyaki, and soboro (the honey sweet beef). ", "The snow crab was the best one and the other two were okay. ", "Decent price for what you get. ", "I would come here again but as a treat."], "author": "Beverly L.", "review": "First off, the cashier is very welcoming and polite! I ordered the set, snow crab, chicken teriyaki, and soboro (the honey sweet beef). The snow crab was the best one and the other two were okay. Decent price for what you get. I would come here again but as a treat.", "rating": 4, "date": "2014-10-04"}, {"excerpts": ["I love my Snow Crab, Tuna or Spicy Shrimp. ", "It's always fresh and fast! ", "It's great for on the go people like me!"], "author": "Winnie F.", "review": "I Love coming in here! Rodrigo, the cashier is just awesome, he greets you with a welcoming smile. On top of that the Onigilly here is just tasty. I love my Snow Crab, Tuna or Spicy Shrimp. It's always fresh and fast! It's great for on the go people like me!", "rating": 5, "date": "2014-05-08"}, {"excerpts": ["I tried the ginger beef and snow crab, they were both flavorful and very filling. ", "I can't wait to come back and work my way down the menu."], "author": "Anisha A.", "review": "Finally made a visit to Onigilly after my boyfriend had been raving about the spot. I went at 2pm on a Thursday and there was a lineup out the door, but it was well worth the wait. I got the miso combo, you get two onigiris and a miso soup for under $9!! I tried the ginger beef and snow crab, they were both flavorful and very filling. I can't wait to come back and work my way down the menu.", "rating": 5, "date": "2015-07-11"}, {"excerpts": ["My go to is the lunch set with my favorite soboro and just tried the snow crab, a seasonal topping, and it was delicious.  ", "Also they have a punch card now so go try it again ", "if you haven't been for a while, you'll see some good changes!"], "author": "Justin S.", "review": "Oishii...New look for a new year and I like the changes.  Friendly staff to help with your selection or make recommendation more stuffing inside the rice ball,  mmmmm.  My go to is the lunch set with my favorite soboro and just tried the snow crab, a seasonal topping, and it was delicious.  Also they have a punch card now so go try it again if you haven't been for a while, you'll see some good changes!", "rating": 5, "date": "2014-01-17"}], "unagi  eel": [], "tempura shrimp": [{"excerpts": ["Here are some other options:\n- Teriyaki Tofu\n- Renkon (Spicy Lotus Root)\n- Shiitake\n- Spicy Bacon\n- Spicy Miso Beef\n- Unagi (Eel)\n- Grilled Salmon\n- Tempura Shrimp\n\nBesides the rice rolls, they offer salads and soup. "], "author": "Kathy Z.", "review": "I happened to be at Super Duper Burgers and looked up and, BAM, it was love at first sight. Right across the street was Onigilly. I am a huge fan of gourmet rice balls, so I raced over to give this place a try.\n\nI must admit, I wasn't blown away by the menu. Nothing I haven't seen elsewhere, and definitely nothing innovative. These \"onigiri\" rice balls are shaped into a triangle. No, this does not qualify as \"sushi.\" Everything is made with brown rice. I'm not a fan of brown rice elsewhere, but here it's quite sweet and good. Definitely a fan of how they prepare the onigiri. Each one is made to order, so expect to wait for your food. Lots of vegan and gluten-free options, too.\n\nThe ordering system here is not fun. The little shop gets so crowded that the few seats available can't even be used. You'll likely become incredibly cramped and uncomfortable. There's no real line for ordering and picking up, so patrons just curve toward the inside of the shop and it's a struggle to walk in or out.\n\nI went with the Snow Crab for $3.45 -- simple, fresh, and with lemon aioli. Yes, this is real crab meat. For the price, it's a little high-end. In general, the rice balls will run you between $2.76 and $3.75, before taxes. However, I'd expect 2-3 to fill you up and that's not too bad for a nice lunch. I devoured my Snow Crab rice ball in seconds.\n\nHere are some other options:\n- Teriyaki Tofu\n- Renkon (Spicy Lotus Root)\n- Shiitake\n- Spicy Bacon\n- Spicy Miso Beef\n- Unagi (Eel)\n- Grilled Salmon\n- Tempura Shrimp\n\nBesides the rice rolls, they offer salads and soup. They also do small dishes like edamame and fried chicken karaage. There's even organic matcha lemonade.\n\nExpect a 3.5% mandate surcharge \"to help offset the additional regulatory costs of doing business in San Francisco.\" Yeah, yeah, yeah.", "rating": 4, "date": "2018-07-31"}, {"excerpts": ["I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. "], "author": "Ashley S.", "review": "Simple, clean, healthy, delicious to-go spot for Japanese onigiri (triangular rice ball snack with filling wrapped in seaweed), caters to the weekday lunch crowd. I think Onigilly might turn out to be one of those places I CRAVE. Well, actually, I already know it is because I went on Friday, and was already wishing they were open on Saturday, the next day, so I could go back (they're open only Mon-Fri). \n\nI couldn't decide between getting a salad bowl or a rice bowl, and discovered with the help of the nice cashier that they can do half salad half rice! I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. Might opt for the Spicy Shrimp or Spicy Bacon next time). \n\nI also ordered a teriyaki chicken onigiri to save for later, but curiosity and fatassery got the best of me. I popped that onigiri to-go box open for \"just a bite\" but ended up inhaling the whole thing despite being full already from the salad/rice bowl.\n\nCan't wait to return to try some of their other offerings!! So. excite. !", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["My favorites include:\nTempura Shrimp (only available at Kearny location!)\n"], "author": "Mandi H.", "review": "Onigilly is one of those brainless lunch spots. When I can't decide where to eat, there's a good chance I will end up here. Even when the line is out the door, it moves quickly because people are in and out in minutes. They are known for their seaweed wrapped \"rice balls\" which which can be purchased individually or in a set. I usually order the edamame set, which comes with 3 rice balls and a side of cold edamame.\n\nMy favorites include:\nTempura Shrimp (only available at Kearny location!)\nUnagi\nSnow Crab\nSpicy Bacon \n\nThis is an easy lunch and I like picking this up when I just want to grab something quick. I have tried the rice bowl, which comes with 3 toppings over a bed of rice but it just wasn't the same. I enjoy the rice balls significantly more, must be the seaweed! Worth trying if you are in the area!", "rating": 4, "date": "2017-03-02"}, {"excerpts": ["Multiple times I have ordered a salad with tempura shrimp and they only give me one shrimp and no dressing. ", "By the time I notice I'm already back in my office and don't want to take the trip back to the store. ", "You're paying $14 for a salad, at least have all the ingredients! ", "I like coming here all the time, but I have to tell the staff that they messed up and watch the order every time."], "author": "Elena O.", "review": "Please train your staff!!!!!! Multiple times I have ordered a salad with tempura shrimp and they only give me one shrimp and no dressing. By the time I notice I'm already back in my office and don't want to take the trip back to the store. You're paying $14 for a salad, at least have all the ingredients! I like coming here all the time, but I have to tell the staff that they messed up and watch the order every time.", "rating": 2, "date": "2018-06-14"}, {"excerpts": ["If I came back, I'd like to try the Tempura Shrimp. ", "The staff is friendly. ", "They work pretty quickly serving these yummy onigiri."], "author": "Joy W.", "review": "I don't know why I like onigiri so much. It's just rice wrapped in seaweed with some filling inside. So simple, yet so delicious. \nThe ones I've tried here are the...\n\nSpicy Shrimp ($2.76) - bay shrimp w/ spicy aioli\nMiso Tuna Salad ($2.76) - cooked wild albacore w/ miso aioli\nUnagi ($3.22) - broiled fresh water eel w/ sweet BBQ sauce\nThey are all very tasty. The onigiri are made with triangle molds; a triangle of rice in the mold, then filling and a second triangle of rice, and wrapped carefully with nori. At Onigilly, you pay a little more than what you would pay for a cold onigiri at an Asian convenience or grocery store. But the ones you get here are rather large, and of course, warm. Not only that, they give you a good amount of filling. It's not one of those rice balls that have a ton of rice, and a tiny, measly bit of filling deep in the center.\nIf you pay with the Paypal app, there's often some sort of deal, which makes these rice balls a steal. However, there are often complications with this payment platform.\nIf I came back, I'd like to try the Tempura Shrimp. The staff is friendly. They work pretty quickly serving these yummy onigiri.", "rating": 4, "date": "2016-02-11"}, {"excerpts": ["I went back to try the spicy bacon, unagi, and tempura shrimp. ", "The unagi was the best of the three, but I was disappointed that the tempura shrimp came with only one piece of tempura sandwiched between the rice. ", "The tempura:rice ratio was way off and left me feeling unsatisfied."], "author": "Gabrielle G.", "review": "If there's a long line, don't worry. It goes fast!\n\nI ordered the crab, beef, and roe. Bear in mind that these are larger than traditional onigiri. I saw some reviews mention there was too much mayo in the crab, but I didn't think so at all. It was just enough to keep the filling together. Pork was a solid, delicious choice. Roe was salty with a bit of spice.\n\nI was surprised by how crispy and juicy their karaage were. I'll definitely be coming back to try the other onigiri--and for any random karaage cravings.\n\nEdit:\n\nI went back to try the spicy bacon, unagi, and tempura shrimp. The unagi was the best of the three, but I was disappointed that the tempura shrimp came with only one piece of tempura sandwiched between the rice. The tempura:rice ratio was way off and left me feeling unsatisfied.", "rating": 4, "date": "2016-06-15"}, {"excerpts": ["I ordered the miso soup set which comes with a choice of two onigilly and picked tempura shrimp and shiitake. ", "I really enjoyed the tempura shrimp but found the shiitake too sweet (I'm guessing that's due to the agave soy braise).\n\n"], "author": "Miriam W.", "review": "I liked my lunch at Onigilly but am pretty sure with a few ordering modifications I might've loved it. The restaurant specializes in onigiri - triangular shaped rice balls wrapped in seaweed.\n\nI ordered the miso soup set which comes with a choice of two onigilly and picked tempura shrimp and shiitake. I really enjoyed the tempura shrimp but found the shiitake too sweet (I'm guessing that's due to the agave soy braise).\n\nDefinitely pay attention to the seasonal fillings - as I spent more time looking at the menu I saw that I could've replaced the cloying shiitake with kabocha squash!", "rating": 3, "date": "2013-11-27"}, {"excerpts": ["I can't wait to come back and try the tempura shrimp and salmon one. ", "I heard the pollock roe one is also amazing! ", "I came here 10 mins before closing and they ran out of a lot of the fillings ", "so id come sooner next time! "], "author": "Isabella L.", "review": "Stumbled across this place as I was walking around the area after an interview. The interior of the little shop is clean and modern and very cute. Wood with green accents. \n\nThey have a selection of dishes in addition to the onigiri. They have miso soup, edamame, rice bowls, chicken karate etc. they have an extensive selection of onigiri (basically rice wrapped with seaweed with a filling). It was hard to choose but I ended up trying: miso tuna salad, spicy shrimp, and the snow crab.\n\nThe miso tuna salad was amazing! It is very standard filling and the flavors go so well with the seaweed. A must try! The snow crab was also good but the crab tasted a bit fishy (salt water) so it was a tiny bit unpleasant the first bite but it got better as I ate. The third one I tried was the spicy shrimp and it was really good but in my opinion a little too saucy (the sauce was runny). Would've liked a thicker sauce. \n\nI can't wait to come back and try the tempura shrimp and salmon one. I heard the pollock roe one is also amazing! I came here 10 mins before closing and they ran out of a lot of the fillings so id come sooner next time! Such a great find!\n\nAll onigiris are approximately $2.50-$3.50 each. Decently priced.", "rating": 4, "date": "2014-05-05"}, {"excerpts": ["but I love the tempura shrimp and the tofu balls. ", "The miso soup could use a bit more flavor, but on the whole, very satisfying. ", "And the staff is friendly and fast."], "author": "Stephanie B.", "review": "The first time I came here, I loved the food so much I went back for lunch 2 days later. The next time, I tried the spicy shrimp ball, which wasn't my favorite but I love the tempura shrimp and the tofu balls. The miso soup could use a bit more flavor, but on the whole, very satisfying. And the staff is friendly and fast.", "rating": 4, "date": "2016-02-09"}, {"excerpts": ["I ordered the unagi, salmon, and soboro while my boyfriend got the spicy bacon, salmon, and tempura shrimp. ", "Each of the onigiris were delicious; however, the salmon tasted bland, they didn't season that enough. "], "author": "Jessica Y.", "review": "Healthy and affordable lunch date with my boyfriend right after getting tea from plentea. The line wasn't long since we came around 11am on a weekday before workers started coming for the lunch rush.\n\nWe each got the set which included choice of 3 onigiris, edamame, and pickled diakon radish. I ordered the unagi, salmon, and soboro while my boyfriend got the spicy bacon, salmon, and tempura shrimp. Each of the onigiris were delicious; however, the salmon tasted bland, they didn't season that enough. I did wish they added a bit more sauce for each of them. \n\nI would definitely come back here if I was ever in the area and craved some Japanese food.", "rating": 4, "date": "2014-09-15"}, {"excerpts": ["My favorites are the tempura shrimp and the tarako. ", "The tarako is so good, I would order three! ", "Also give the happy hour a try. ", "The dinner selection is excellent and reasonably priced. ", "I'm glad to see a variety of Japanese restaurants popping up in the area. ", "I'm tired of people who think Japanese people just eat sushi all day."], "author": "Susan P.", "review": "If you tried this spot a while ago and haven't been back recently, give it another try. I came back to get lunch here today and was pleasantly surprised. \n\nThey improved their assembly of the onigilly by pre-shaping the rice and placing the ingredients in the middle of the rice. I know this sounds ridiculous and overly analytic, but it makes for a much better eating experience. \n\nMy favorites are the tempura shrimp and the tarako. The tarako is so good, I would order three! Also give the happy hour a try. The dinner selection is excellent and reasonably priced. I'm glad to see a variety of Japanese restaurants popping up in the area. I'm tired of people who think Japanese people just eat sushi all day.", "rating": 4, "date": "2014-04-24"}, {"excerpts": ["And I had the tempura shrimp one, which was good, but probably my least favorite of the three (I would still eat it again though). ", "The seaweed salad was the best I ever had. ", "The little side salad that comes on the plate is delicious, with a spicy dressing and mixed greens. ", "The chicken is organic. ", "They serve Frog Hollow peaches. ", "Seriously? ", "And oh  ", "yeah"], "author": "Marissa K.", "review": "I walked by Onigilly today, and my husband and I thought it looked good. I have been hearing about the wonder of rice balls for so long that I had to try them.\n\nMy husband doesn't like sushi, but he agreed to indulge me and try the rice balls. Both of us were glad he did.\n\nI had the teriyaki chicken one, which was moist and delicious. I had the eggplant one, which was probably my favorite. And I had the tempura shrimp one, which was good, but probably my least favorite of the three (I would still eat it again though). The seaweed salad was the best I ever had. The little side salad that comes on the plate is delicious, with a spicy dressing and mixed greens. The chicken is organic. They serve Frog Hollow peaches. Seriously? And oh  yeah, it was $9.\n\nI wish I worked downtown so I could eat Onigilly every day.", "rating": 5, "date": "2012-09-10"}, {"excerpts": ["L iked the spicy bacon, tempura shrimp, kani (crab) and miso tuna, too\n", "Y our best bet for a short line is after 2pm -- or go when they open at 11am!"], "author": "Anthony N.", "review": "O h, it's truly hard to justify dishing out almost $10 for rice balls\nN ot the most frugal work lunch option, for sure\nI  yet somehow find myself coming back time and time again\nG ot to admit, this restaurant's Onigilly Set has got me hooked!\nI t comes with 3 onigiri (rice balls), tossed greens, pickles and edamame  \nL a Cocina is a good \"Prefix Combo\" to try (teri chix, spicy shrimp, eggplant)\nL iked the spicy bacon, tempura shrimp, kani (crab) and miso tuna, too\nY our best bet for a short line is after 2pm -- or go when they open at 11am!", "rating": 4, "date": "2012-09-22"}, {"excerpts": ["i tried the tempura shrimp (only at this location) and salmon rolls and wow...pretty good!! ", "great flavors and great portion of rice and topping. ", "whether or not if they use brown rice, i still don't know because it definitely didn't taste like brown rice. ", "i actually went back and tried their rice bowls with 3 different toppings ", "and i have to say...", "it's not as great as their rolls (which they are known for), but wanted to mix it up a bit. "], "author": "Marsha C.", "review": "i was definitely hesitant before coming from here because their site states that they use brown rice, which i am not a fan of brown rice at all. my co-worker said it has become one of her fav places for lunch, so i decided to give it try after seeing that their rice doesn't actually seem to be brown rice. i tried the tempura shrimp (only at this location) and salmon rolls and wow...pretty good!! great flavors and great portion of rice and topping. whether or not if they use brown rice, i still don't know because it definitely didn't taste like brown rice. i actually went back and tried their rice bowls with 3 different toppings and i have to say...it's not as great as their rolls (which they are known for), but wanted to mix it up a bit. also tried the chicken karaage and really small -less than 10 pieces for $4 something is NOT worth it and definitely lacking some flavors there. \n\ntips: \n1. order online, so you skip the wait during lunch hour! \n2. stick with the rolls!", "rating": 3, "date": "2016-06-03"}, {"excerpts": ["Got the onigiri set of shiitake, unagi and tempura shrimp. "], "author": "A A.", "review": "The food was good. Got the onigiri set of shiitake, unagi and tempura shrimp. I recommend eating the shiitake with the daikon that comes with it, makes it less salty.\n\nThe service was good. The cashier was very friendly. \n\nComing back for more. Would like to try every single onigiri on the list!", "rating": 5, "date": "2014-06-09"}, {"excerpts": ["Tempura shrimp origiri and unagi are my favorite. ", "Decent miso soup. "], "author": "Elsa L.", "review": "Tempura shrimp origiri and unagi are my favorite. Decent miso soup. I always go for miso soup set. If you like mushrooms, try the shitake onigiri!", "rating": 4, "date": "2015-01-17"}, {"excerpts": ["My favorite toppers are soboro, tempura shrimp, and their sake. ", "Their food is really great, and I've never really had a bad experience with them. ", "They tend to draw a lunch crowd, though, so be warned!"], "author": "Em F.", "review": "Absolutely delicious! I love coming to this place for a quick lunch. My favorite toppers are soboro, tempura shrimp, and their sake. Their food is really great, and I've never really had a bad experience with them. They tend to draw a lunch crowd, though, so be warned!", "rating": 4, "date": "2013-02-05"}], "organic mixed green salad": [], "tamagoyaki": [{"excerpts": ["Everything pairs well with the side of tamagoyaki. ", "The matcha lemonade is on the sweet side and also excellent. ", "I'm going to miss this place when I go back to the central coast!"], "author": "Graesyn H.", "review": "So good!!!! The staff was very nice and the guy up front was super cute and friendly. We tried the pickled plum, sautéed mustard greens, eel and barbecue, sautéed eggplant, and the salmon onigillies. They were all excellent. My favorites would be the pickled plum and the eel and barbecue. Everything pairs well with the side of tamagoyaki. The matcha lemonade is on the sweet side and also excellent. I'm going to miss this place when I go back to the central coast!", "rating": 5, "date": "2018-09-04"}, {"excerpts": ["Plus, you can get tamagoyaki on the side, which puts a huge smile on my face. ", "My meal of choice is essentially two giant onigiri and a tamagoyaki. ", "The best part of it is, it's quite affordable. ", "It's only a dollar or two more than what you'd get at a Japanese grocery store, and they make it for you when you order it, ", "so it's fresh and not wrapped in those plastic onigiri wrappers. ", "Man...", "I love onigiri. "], "author": "Robbin A.", "review": "OH MY GOD. A shop that focuses solely on onigiri?!?!?!! I am sold.\n\nI'm relatively far from here, but I have put it on my Top 10 places to get lunch when I'm at work. I will gladly walk the 10-15 minutes here to have an early lunch at 11am.\n\nThe portions are larger than what I'd be able to find at grocery stores like Nijiya. They also look a little different from regular onigiri. I ordered the salmon and the soboro. The soboro was awesome. The way they fashioned the rice around it was like using two rice patties, then wrapped with nori. Soooo good. Plus, you can get tamagoyaki on the side, which puts a huge smile on my face. My meal of choice is essentially two giant onigiri and a tamagoyaki. The best part of it is, it's quite affordable. It's only a dollar or two more than what you'd get at a Japanese grocery store, and they make it for you when you order it, so it's fresh and not wrapped in those plastic onigiri wrappers. Man...I love onigiri. It's just such a happy-sounding food.\n\nFor me, that's an entire meal. It keeps me full but not overly stuffed, like most FiDi lunches would normally do for me. Plus, Asha Tea House is on the way back. It's a win-win for me all around.", "rating": 5, "date": "2015-11-02"}, {"excerpts": ["I have not tried their rice balls -- only the chicken karaage (twice) and tamagoyaki (once).  ", "In general, I love chicken karaage and tamagoyaki and have gotten them frequently at other Japanese restaurants.  ", "Here, though, they tasted kind of unusual or off - perhaps intentionally, as a twist(?), but I didn't like it.  ", "I couldn't quite place what made the chicken karaage taste different, but the flavor was a bit strange to me.  ", "The tamagoyaki was overly sweet."], "author": "K L.", "review": "I have not tried their rice balls -- only the chicken karaage (twice) and tamagoyaki (once).  In general, I love chicken karaage and tamagoyaki and have gotten them frequently at other Japanese restaurants.  Here, though, they tasted kind of unusual or off - perhaps intentionally, as a twist(?), but I didn't like it.  I couldn't quite place what made the chicken karaage taste different, but the flavor was a bit strange to me.  The tamagoyaki was overly sweet.", "rating": 2, "date": "2014-02-15"}], "edamame set": [{"excerpts": ["I decided on the Edamame Set with 3 Onigilly: ", "Unagi , Real Crab, and Ume. ", "Service was quick and I loved the presentation. ", "The food seems simple--a sushi rice sandwich with one filling wrapped in seaweed, but it was SO yummy, flavorful, and balanced. ", "I want to go back again! ", "(...I did learn that I'm not a fan of ume as the pickling was too strong, but that's my palette ", "and I just wanted to give it a try.)"], "author": "Lori C.", "review": "So excited that I finally got lunch from here! The staff were really welcoming, friendly, and helpful, (which isn't always the case in FiDi), so I appreciated that. I wasn't sure what to order, so the woman taking the orders recommended a few options. \n\nI decided on the Edamame Set with 3 Onigilly: Unagi , Real Crab, and Ume. Service was quick and I loved the presentation. The food seems simple--a sushi rice sandwich with one filling wrapped in seaweed, but it was SO yummy, flavorful, and balanced. I want to go back again! (...I did learn that I'm not a fan of ume as the pickling was too strong, but that's my palette and I just wanted to give it a try.)", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["Bowls, rice bowls, edamame set, a lot of onigiri types.\n", "I chose 2 today for lunch: ", "Soboro (A soy sauce braised shredded angus steak), and a Spicy Miso Ahi Tuna. ", "So they were reasonably priced like around $2.50 to $3. ", "These were packed uniquely because they have they own molds which is the triangle in shape instead of the round ones. ", "The fillings are sandwich in 2 triangle-shaped sushi rice and wrapped with nori tightly. ", "These morsels are so good, and just perfect for my tummy and satisfying. ", "I enjoyed the Soboro which is great, delicious and notes of umami-ness because of the soy sauce marinade. ", "The Spicy Miso was spicy in a level of 3/10 but salty.\n", "This lunch spot is so worth going and eating. ", "If you want to try a trendy and delicious food spot. ", "This one is a great food gem."], "author": "Jade M.", "review": "I spotted this lunch spot within the food shops at The Embarcadero where many small restaurants are found. I was dying to try this place out as I love trying out new types of Japanese food.\nWhen I saw the menu, there were a lot of varieties for all the food lifestyle choices - vegetarians, vegans. Bowls, rice bowls, edamame set, a lot of onigiri types.\nI chose 2 today for lunch: Soboro (A soy sauce braised shredded angus steak), and a Spicy Miso Ahi Tuna. So they were reasonably priced like around $2.50 to $3. These were packed uniquely because they have they own molds which is the triangle in shape instead of the round ones. The fillings are sandwich in 2 triangle-shaped sushi rice and wrapped with nori tightly. These morsels are so good, and just perfect for my tummy and satisfying. I enjoyed the Soboro which is great, delicious and notes of umami-ness because of the soy sauce marinade. The Spicy Miso was spicy in a level of 3/10 but salty.\nThis lunch spot is so worth going and eating. If you want to try a trendy and delicious food spot. This one is a great food gem.", "rating": 4, "date": "2018-09-08"}, {"excerpts": ["I usually order the edamame set, which comes with 3 rice balls and a side of cold edamame.\n\n"], "author": "Mandi H.", "review": "Onigilly is one of those brainless lunch spots. When I can't decide where to eat, there's a good chance I will end up here. Even when the line is out the door, it moves quickly because people are in and out in minutes. They are known for their seaweed wrapped \"rice balls\" which which can be purchased individually or in a set. I usually order the edamame set, which comes with 3 rice balls and a side of cold edamame.\n\nMy favorites include:\nTempura Shrimp (only available at Kearny location!)\nUnagi\nSnow Crab\nSpicy Bacon \n\nThis is an easy lunch and I like picking this up when I just want to grab something quick. I have tried the rice bowl, which comes with 3 toppings over a bed of rice but it just wasn't the same. I enjoy the rice balls significantly more, must be the seaweed! Worth trying if you are in the area!", "rating": 4, "date": "2017-03-02"}, {"excerpts": ["I've been here a few times and pretty much keep it simple by ordering either a couple onigiri's or the Edamame Set, which comes with 3 onigiri's, Edamame and Daikon.  ", "I grew-up eating onigiri", "'s that my mom used to make for us.  ", "The price is right as the Edamame Set is $10 for 3 onigiri's.  ", "I have yet to try their Salad or Rice Bowls, but that will be for a future visit."], "author": "Lon H.", "review": "I've been here a few times and pretty much keep it simple by ordering either a couple onigiri's or the Edamame Set, which comes with 3 onigiri's, Edamame and Daikon.  I grew-up eating onigiri's that my mom used to make for us.  They are a good snack or quick lunch option.  \n\nOnigilly offers a different twist, by using partially milled brown rice, versus the standard white rice my mom used to make.  We had them with or without nori (seaweed) growing-up, but using nori makes them easier to handle.  \n\nTheir menu has a wide selection of flavors, so there's something for pretty much everyone, including those that are gluten-free or vegan.  I stick to the meat options and prefer the Unagi, Spicy Shrimp, Snow Crab, Teriyaki Chicken and Salmon.  \n\nIt's not a large restaurant with very limited seating.  However, don't be surprised to see the line snaked-out the door during lunch.  Needless to say, I typically go after the lunch crowd to avoid the lines.  Make sure to review the large menu board to see the entire menu, including their sets.  The price is right as the Edamame Set is $10 for 3 onigiri's.  I have yet to try their Salad or Rice Bowls, but that will be for a future visit.", "rating": 4, "date": "2016-09-23"}, {"excerpts": ["This restaurant offers several ways to market their  onigiri:\nEdamame set:  2 choices of onigiri with takuan and edamame.\n", "Zosui set:  ", "1 onigiri and a cup of broth, rice and protein.\n", "Bowl:  three topping over rice, takuan, and edamame"], "author": "Richard H.", "review": "Gourmet musubi onigiri (rice balls) filled with sushi a tasty assortment of flavors:  teriyaki chicken, unagi, tarako (spicy fish eggs), snow crab, baked salmon, or seaweed.  They place your choice of filling between two triangles of white rice, then wrap it in a sheet of pressed seaweed.  \nThis restaurant offers several ways to market their  onigiri:\nEdamame set:  2 choices of onigiri with takuan and edamame.\nZosui set:  1 onigiri and a cup of broth, rice and protein.\nBowl:  three topping over rice, takuan, and edamame", "rating": 4, "date": "2016-04-11"}, {"excerpts": ["There are times when I get the Edamame set (three onigillys) with just Unage for all three. "], "author": "Angel C.", "review": "I come here once in a while to spice up my lunch routine :) I have never had onigilly in other places, but this has totally gotten me hooked. I'm now in a hunt for more places that offer this. After all, onigilly doesn't open till very late :'(\n\nI love their new Zosui set (Japanese rice soup w/ one onigilly), though sometimes I'm very tempted to get more onigilly... My favorite onigilly selections are Unagi and Snow Crab. There are times when I get the Edamame set (three onigillys) with just Unage for all three. It's absolutely delicious. \n\nThey don't have much space to dine in, so I usually do take out and eat in the park nearby on Pine street. When the sun is out, this is particularly enjoyable to do. Since the place is small, you most likely need to wait in line for 15 minutes or so. Try to avoid the 12pm lunch rush if you can.", "rating": 4, "date": "2017-01-23"}, {"excerpts": ["After looking through their menu, I decided to order various rice balls such as the Salmon, Shitake, Miso Nasu, along with an order of the Edamame Set meal.  ", "For the most part, my favorite was the Salmon", ", it tasted decent, but the other rice balls were lacking in flavor and did not taste that good.  ", "For the price I paid for each ball, I could have went across the street to Sushirrito and had myself some fine dining.   ", "To make matters worst, the Edamame Set wasn't worth it, the edamame did not taste fresh and was lacking in salt.  ", "The dressing had a very weird carrot taste to it and did not taste well when poured over the set.  ", "Overall, the mixture of flavors in the edamame set bowl just didn't mesh well together.\n\n"], "author": "David L.", "review": "I came here after finding out that Sushirrito across the street was closed for the day, so I somehow managed to scurry myself through the door after looking a their menu outside.  They have a simple concept featuring japanese rice balls with various filling inside.  The service here was good, and they answered all my questions in regards to which rice ball would be the best based on my personal preferences.\n\nAfter looking through their menu, I decided to order various rice balls such as the Salmon, Shitake, Miso Nasu, along with an order of the Edamame Set meal.  For the most part, my favorite was the Salmon, it tasted decent, but the other rice balls were lacking in flavor and did not taste that good.  For the price I paid for each ball, I could have went across the street to Sushirrito and had myself some fine dining.   To make matters worst, the Edamame Set wasn't worth it, the edamame did not taste fresh and was lacking in salt.  The dressing had a very weird carrot taste to it and did not taste well when poured over the set.  Overall, the mixture of flavors in the edamame set bowl just didn't mesh well together.\n\nIf I was to come back here again, I would probably stick to the Salmon rice ball and that's it.", "rating": 3, "date": "2016-04-14"}, {"excerpts": ["I ordered the edamame set which included 3 onigiris (spicy kogi, snow crab, & salmon) ", "My favorite of the 3 in order are: 1) salmon 2) snow crab & 3) spicy kogi.\n\n"], "author": "Kevin S.", "review": "Its a fun size snack.\n\nIn my review, I think my opinion may be affected by the fact that I started eating it like an hour after purchase. I basically had a feast that included sushirito as the main course. Okay so my friend and I came here for lunch on Friday, and of course this whole financial district is just super crowded during rush. Line goes out the door but the orders move by fast.\n\nI ordered the edamame set which included 3 onigiris (spicy kogi, snow crab, & salmon) w/ edamame/pickled daikon.\n\nSo I've had onigilly once before in the embarcadero area, and I would say my first time was better. The ones here don't seem to have as much filling or of a strong taste to them. Maybe it's because they have a bigger demand of customers? Who knows? Again if I had eaten them right away, it probably would have been better. I liked them all, each having a unique taste. The seaweed wrap doesn't fall apart, and the rice holds together well. Quality overall was only decent.\n\nMy favorite of the 3 in order are: 1) salmon 2) snow crab & 3) spicy kogi.\n\nI might stop by again if I'm in the area.", "rating": 3, "date": "2016-03-27"}, {"excerpts": ["First, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\n"], "author": "Winnie L.", "review": "This place is literally RIGHT next to plentea. They close at 4 and I went in at 3:50 and they were nice enough to let us eat there past 4. Sorry :P I work in food service so I know how you guys felt but we wouldn't have had anywhere else to eat!! \n\nFirst, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\nI got the rice bowl which comes with half rice and half salad. I got to choose 3 onigilly fillings. I chose the Hijiki (braised seaweed & carrots), teriyaki chicken & salmon. It comes with a side dressing for the salad & some edamame as well. So worth it because you get a little bit of each. It's the size of a chipotle bowl, so it's pretty filling! This is something I've never tried because there's nothing really like this in LA so I'm glad I got to try this place. I want to come back and try the onigilly next time!!", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["This place is great for a quick and simple meal, I got the edamame set which includes 3 onigiris of your choice, so zip got the salmon, unagi, and chicken. ", "It was all very good and filling. ", "Definitely shareable with a friend."], "author": "Garrett P.", "review": "This place is great for a quick and simple meal, I got the edamame set which includes 3 onigiris of your choice, so zip got the salmon, unagi, and chicken. It was all very good and filling. Definitely shareable with a friend.", "rating": 4, "date": "2017-03-15"}, {"excerpts": ["We both ordered a edamame set.  ", "Its plenty of food.  ", "Fresh and wonderful ingredients.\n", "I want to eat lunch there everyday. ", ":)"], "author": "Barb N.", "review": "I want to take this restaurant home and put it in my neighborhood.\nAll around great place.   The food is wonderful, the staff is kind and helpful, it's quaint, quiet, good people watching spot, relatively inexpensive, eco friendly....\nWe both ordered a edamame set.  Its plenty of food.  Fresh and wonderful ingredients.\nI want to eat lunch there everyday. :)", "rating": 5, "date": "2015-06-06"}, {"excerpts": ["I always order the 3 pieces edamame set if I'm very hungry, and it comes with beans on the side. "], "author": "Yilin Y.", "review": "I'm a regular at this place and I prefer dinning in if I have time. It's located right next to my school and I go here almost every week between classes. The onigiri are awesome, the service is great, the store is great, EVERYTHING IS WHERE IT SHOULD BE! :D\nThe casher is super nice and would recommend on the onigiri if you couldn't make up your mind. The waiting time of all order is around 3 to 5 minutes, which is another reason why it's great for a quick lunch during class breaks.\nI always order the 3 pieces edamame set if I'm very hungry, and it comes with beans on the side. If I'm just ok-ay hungry, I'd go for the miso soup set, which comes in 2 pieces onigiri and soup on the side. I'm allow to choose almost all type of onigiri to put int the set. They also have japanese tea drinks and soda as well. There's a buy 10 get 1 free set lunch card ( which I always forgot to get :[ ) for discount as well. The total price of lunch often comes down to around $10-15 per person.\nAs for recommendation on orders:\nUnagi ( be careful with bones)\nSalmon\nSnow Crab\nTeriyaki Chicken\nSoboro\nstrawberry mochi: a MUST try, but it's seasonal only.", "rating": 4, "date": "2015-12-19"}, {"excerpts": ["I had their Edamame set and chose the Crab, Salmon, and Hijiki. ", "It came with crunchy pickles and edamame. ", "Gotta love sides! ", "I was not a fan of the Hijiki. ", "It was too sweet. ", "But the great thing is there's so many other ones I haven't tried. ", "I would definitely be back. ", "My only complaint is there were no seats, but that is how many places are in SF. ", "This can easily be brought back to the office as well."], "author": "Fran P.", "review": "This place is a yummy and convenient place for lunch. I had their Edamame set and chose the Crab, Salmon, and Hijiki. It came with crunchy pickles and edamame. Gotta love sides! I was not a fan of the Hijiki. It was too sweet. But the great thing is there's so many other ones I haven't tried. I would definitely be back. My only complaint is there were no seats, but that is how many places are in SF. This can easily be brought back to the office as well.", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["I typically go for the Edamame set - three ongiri with a side of pickled radish slices and boiled soybeans. ", "I prefer the vegan ingredients they have here over the meat ingredients, as the mouthfeel of the former is better imo, and I haven't particularly tackled the pricier Seafood fillings. ", "I had their vegan Miso soup once, and though I like it, I'd rather get the three rice balls over two + soup. ", "Definitely recommended though."], "author": "Brandi R.", "review": "This place rocks! A lot of people in the reviews mention the lines, but if you come later enough in the day (around and after 3pm is a good bet), you'll find the line is either drastically reduced or nonexistent. I typically go for the Edamame set - three ongiri with a side of pickled radish slices and boiled soybeans. I prefer the vegan ingredients they have here over the meat ingredients, as the mouthfeel of the former is better imo, and I haven't particularly tackled the pricier Seafood fillings. I had their vegan Miso soup once, and though I like it, I'd rather get the three rice balls over two + soup. Definitely recommended though.", "rating": 5, "date": "2017-08-14"}, {"excerpts": ["I got the edamame set, it came with 3 onigillys, edamame and pickles.. \n"], "author": "Daniella G.", "review": "Delicious place! Different  experience.\n\nI got the edamame set, it came with 3 onigillys, edamame and pickles.. \nI ordered the teriyaki chicken, tuna, and unagi. I really like the unagi and teriyaki... The tuna I thought would be like the spicy poke or spicy tuna you get in sushi.. It wasn't. It was  like a tuna salad type thing which tasted weird with rice.. \n\nThe edamame was good, but cold.. The pickles were a nice touch.\n\nThe service was quick.. There is usually a massive line outside. (Always a good sign).\n\nDefinitely coming back to try other flavors.", "rating": 4, "date": "2016-02-25"}, {"excerpts": ["the Edamame Set, which means I got to pick 3 of the \"onigilly\" on their menu - comes with a tiny side of edamame and pickles for $8.74. "], "author": "Athena C.", "review": "Omgeeee!!!! Onigiriiii!!!!\n\nYeah, that's exactly how I feel. This was my first time actually trying onigiri and I've always wanted to since I watched Fruits Basket. But it's an interesting little snack. I don't know that I'd say it's enough for lunch but I love the idea. And the guy at the counter was all smiles behind his glasses and he was really nice! I'm a sucker for smiley people in customer service. He was also very patient when I got up to the counter while hesitating on my order.\n\nI got the Edamame Set, which means I got to pick 3 of the \"onigilly\" on their menu - comes with a tiny side of edamame and pickles for $8.74. Personally, I think Spicy Bacon is a MUST. It's BACON! I also got the Salmon and Shiitake. I LOVED the Shiitake - it's sweet and mushroomy. I can do without the Salmon next time though - cooked a little dry.\n\nI'm definitely planning to go back and I'm excited to try the other things. There's normally a line but I went at around 3:30pm so right before they closed, which was awesome. I did almost steal somebody else's order though - my bad for being so excited to try the rice balls...\n\nAnd it probably really is \"as good as it gets\" because I've never tried anything else like this!", "rating": 5, "date": "2015-10-22"}, {"excerpts": ["I ordered the edamame set (choice of 3 onigiri). ", "The Unagi one was super good. ", "There is limited seating ", "but overall I prefer Sushiritto."], "author": "Wendy C.", "review": "This place is right next to Plentea. I came here around noon and the line was super long. I ordered the edamame set (choice of 3 onigiri). The Unagi one was super good. There is limited seating but overall I prefer Sushiritto.", "rating": 4, "date": "2016-08-09"}, {"excerpts": ["Had the edamame set that comes with 3 onigiris. "], "author": "Da W.", "review": "With the generous amount of filling, it's made more like a sandwich with the bread slices substituted with triangular chunks of rice than an onigiri XD But it was really good lunch food.\n\nHad the edamame set that comes with 3 onigiris. The fillings I chose were teriyaki chicken, miso tuna and eel. All 3 were delicious, especially the eel one (even more so after sprinkled with shichimi spices). The volume looked a bit small at first, but turned out to be perfect as I didn't feel hungry the entire afternoon. Definitely coming back later to try out some of the fancier flavors.", "rating": 4, "date": "2016-01-08"}, {"excerpts": ["I order the edamame set and was so full afterwards!! ", "Highly recommend Onigilly!!"], "author": "Arian I.", "review": "Great place!! I order the edamame set and was so full afterwards!! Highly recommend Onigilly!!", "rating": 5, "date": "2017-02-04"}, {"excerpts": ["The Edamame Set w/ a side of Wakame salad (not pictured) is the best way to experience Onigilly ", "but you have to get there close to the time they open (11:00am) because they run out of wakame salad fast.\n", "Anyways! "], "author": "Jaclyn M.", "review": "Love this place. Always stop by when I'm in this area of SF and I want a quick bite to eat but am not up for trying anything new. I'm a big meat connoisseur and I also eat my fair share of sushi, so its nice that they have a little something for everyone. Including you vegans and gluten free people too.\nThe Edamame Set w/ a side of Wakame salad (not pictured) is the best way to experience Onigilly but you have to get there close to the time they open (11:00am) because they run out of wakame salad fast.\nAnyways! Definitely would recommend trying out this place at least once if you find yourself in the area. \n\n(From top to bottom) teriyaki tofu, snow crab, and salmon. The unagi is also a must try.", "rating": 5, "date": "2015-04-21"}, {"excerpts": ["Ordered the edamame set at around 3:30pm on a Friday. ", "They were out of unagi ", "so I ordered two salmon and one spicy shrimp. ", "I should have ordered all spicy shrimp; it was fantastic. ", "The salmon was ehhhh. ", "I ended up throwing out part of the second one. ", "I also didn't care for the edamame. ", "I think next time I won't get it as part of a set. ", "The pickled stuff was only so-so too, but at least better than the edamame. ", "There were three people ahead of me who had already ordered and were waiting for their food. ", "It took at least 10 minutes minimum before I got mine. ", "Not the greatest if you're in a hurry. ", "Oh, cost of my meal was $11 after tax."], "author": "Wendy L.", "review": "Ordered the edamame set at around 3:30pm on a Friday. They were out of unagi so I ordered two salmon and one spicy shrimp. I should have ordered all spicy shrimp; it was fantastic. The salmon was ehhhh. I ended up throwing out part of the second one. I also didn't care for the edamame. I think next time I won't get it as part of a set. The pickled stuff was only so-so too, but at least better than the edamame. There were three people ahead of me who had already ordered and were waiting for their food. It took at least 10 minutes minimum before I got mine. Not the greatest if you're in a hurry. Oh, cost of my meal was $11 after tax.", "rating": 3, "date": "2015-03-13"}, {"excerpts": ["Edamame set gives you a fair amount of food. ", "Excellent customer service."], "author": "Bryan F.", "review": "Very good lunch place. Edamame set gives you a fair amount of food. Excellent customer service.", "rating": 5, "date": "2015-07-09"}, {"excerpts": ["I bought the edamame set which included three rice balls of my choice along with pickles and edamame. "], "author": "Judy H.", "review": "I had onigiri (rice balls) for the first time at this place today. I bought the edamame set which included three rice balls of my choice along with pickles and edamame. I had the soboro, salmon, and snow crab rice balls and they were all very delicious!! I would recommend this place to anyone.", "rating": 5, "date": "2016-04-26"}, {"excerpts": ["I got the edamame set with spicy shrimp, teriyaki chicken, and spicy kogi.  ", "I was pleasantly full and enjoyed the flavors greatly! ", "Will be back soon!"], "author": "Obar L.", "review": "Great little place that serves a variety of onigilly! I got the edamame set with spicy shrimp, teriyaki chicken, and spicy kogi.  I was pleasantly full and enjoyed the flavors greatly! Will be back soon!", "rating": 5, "date": "2015-04-07"}], "miso soup set": [{"excerpts": ["I got the miso soup set with Miso Nasu and Shiitake. ", "The Miso Nasu stands out and is the most flavorful! "], "author": "Victoria L.", "review": "I got the miso soup set with Miso Nasu and Shiitake. The Miso Nasu stands out and is the most flavorful! The soup is lackluster on it's own, but it's bland enough to balance the slightly salty onigiri. \n\nGet the daikon pickles on the side for depth, and don't forget to add that spicy power at the condiments station!", "rating": 4, "date": "2018-06-22"}, {"excerpts": ["My favorite are the natto and salmon onigilly, either in the edamame or miso soup set. "], "author": "Vicki L.", "review": "I like Onigilly! My favorite are the natto and salmon onigilly, either in the edamame or miso soup set. The ume (pickled plum) is super sour so it isn't recommended unless you'll know that you'll like it.\n\nThe only downside is that it will likely not fill you up (esp. compared to the surrounding restaurants that give larger portions) and it sort of feels like you're only eating rice (which is kind of true).", "rating": 4, "date": "2017-04-01"}, {"excerpts": ["First, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\n"], "author": "Winnie L.", "review": "This place is literally RIGHT next to plentea. They close at 4 and I went in at 3:50 and they were nice enough to let us eat there past 4. Sorry :P I work in food service so I know how you guys felt but we wouldn't have had anywhere else to eat!! \n\nFirst, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\nI got the rice bowl which comes with half rice and half salad. I got to choose 3 onigilly fillings. I chose the Hijiki (braised seaweed & carrots), teriyaki chicken & salmon. It comes with a side dressing for the salad & some edamame as well. So worth it because you get a little bit of each. It's the size of a chipotle bowl, so it's pretty filling! This is something I've never tried because there's nothing really like this in LA so I'm glad I got to try this place. I want to come back and try the onigilly next time!!", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["If I'm just ok-ay hungry, I'd go for the miso soup set, which comes in 2 pieces onigiri and soup on the side. ", "I'm allow to choose almost all type of onigiri to put int the set. ", "They also have japanese tea drinks and soda as well. ", "There's a buy 10 get 1 free set lunch card ( which I always forgot to get :[ ) for discount as well. ", "The total price of lunch often comes down to around $10-15 per person.\n"], "author": "Yilin Y.", "review": "I'm a regular at this place and I prefer dinning in if I have time. It's located right next to my school and I go here almost every week between classes. The onigiri are awesome, the service is great, the store is great, EVERYTHING IS WHERE IT SHOULD BE! :D\nThe casher is super nice and would recommend on the onigiri if you couldn't make up your mind. The waiting time of all order is around 3 to 5 minutes, which is another reason why it's great for a quick lunch during class breaks.\nI always order the 3 pieces edamame set if I'm very hungry, and it comes with beans on the side. If I'm just ok-ay hungry, I'd go for the miso soup set, which comes in 2 pieces onigiri and soup on the side. I'm allow to choose almost all type of onigiri to put int the set. They also have japanese tea drinks and soda as well. There's a buy 10 get 1 free set lunch card ( which I always forgot to get :[ ) for discount as well. The total price of lunch often comes down to around $10-15 per person.\nAs for recommendation on orders:\nUnagi ( be careful with bones)\nSalmon\nSnow Crab\nTeriyaki Chicken\nSoboro\nstrawberry mochi: a MUST try, but it's seasonal only.", "rating": 4, "date": "2015-12-19"}, {"excerpts": ["but I went with the Miso Soup set ( 2 balls + 1 miso soup ). ", "It came out a little over $7 before tip. ", "It reminded me of mornings at Mitsuwa. ", "Perfectly shaped BROWN-RICE BASED onigiri with fillings like Hijiki ( seasoned seaweed + carrots ) & Unagi ( eel ). "], "author": "Yuhi K.", "review": "Had a meeting at the BOA Center and only had time for a ninja snack before heading on to my next destination. Walked down the street and around the corner to find this adorable (and tiny) place called Onigilly! Quality fast food for those of us who want a quick & light lunch. \n\nYou can purchase your onigiri a la carte but I went with the Miso Soup set ( 2 balls + 1 miso soup ). It came out a little over $7 before tip. It reminded me of mornings at Mitsuwa. Perfectly shaped BROWN-RICE BASED onigiri with fillings like Hijiki ( seasoned seaweed + carrots ) & Unagi ( eel ). I wanted to dive into the snow crab but I couldn't handle any more food. T_T\n\nFor onigiri, it's a little on the pricy-side but considering the location, quality of ingredients, filling selection (VEGAN FRIENDLY), and top notch customer service, it's worth it. If I'm ever in the area, I will be sure to make a ninja stop at Onigilly.", "rating": 4, "date": "2014-03-11"}, {"excerpts": ["I ordered the miso soup set which comes with a choice of two onigilly and picked tempura shrimp and shiitake. ", "I really enjoyed the tempura shrimp but found the shiitake too sweet (I'm guessing that's due to the agave soy braise).\n\n"], "author": "Miriam W.", "review": "I liked my lunch at Onigilly but am pretty sure with a few ordering modifications I might've loved it. The restaurant specializes in onigiri - triangular shaped rice balls wrapped in seaweed.\n\nI ordered the miso soup set which comes with a choice of two onigilly and picked tempura shrimp and shiitake. I really enjoyed the tempura shrimp but found the shiitake too sweet (I'm guessing that's due to the agave soy braise).\n\nDefinitely pay attention to the seasonal fillings - as I spent more time looking at the menu I saw that I could've replaced the cloying shiitake with kabocha squash!", "rating": 3, "date": "2013-11-27"}, {"excerpts": ["I got the miso soup set with a snowcrab onigiri and an unagi onigiri. ", "Both were delicious, but snowcrab was def my fave! ", "The miso soup was light and ok. ", "Not the best, but it's cleansing. ", "Seating can get tricky since it's a small spot, but people come and go rather quickly. ", "Service was fast and friendly!"], "author": "Wendy S.", "review": "Want a quick yummy lunch? Onigilly definitely hits the spot! I got the miso soup set with a snowcrab onigiri and an unagi onigiri. Both were delicious, but snowcrab was def my fave! The miso soup was light and ok. Not the best, but it's cleansing. Seating can get tricky since it's a small spot, but people come and go rather quickly. Service was fast and friendly!", "rating": 4, "date": "2015-10-06"}, {"excerpts": ["I usually get the miso soup set to combat the year-round chilly-ness that is SF. "], "author": "Willy W.", "review": "My go to place for a quick, light lunch in FiDi. I usually get the miso soup set to combat the year-round chilly-ness that is SF. I also like to eat there so I can take advantage of the complimentary barley tea. \n\nThe food is definitely on the pricey side from a cost to volume perspective, and I've tried a number of the different flavors and some are definitely better than others. I've settled on a few as my favorites, namely the torako (pollock roe) and snow crab.\n\nI'm very happy this place exists!", "rating": 4, "date": "2014-09-19"}, {"excerpts": ["I always go for miso soup set. ", "If you like mushrooms, try the shitake onigiri!"], "author": "Elsa L.", "review": "Tempura shrimp origiri and unagi are my favorite. Decent miso soup. I always go for miso soup set. If you like mushrooms, try the shitake onigiri!", "rating": 4, "date": "2015-01-17"}], "wakame salad set": [{"excerpts": ["Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. ", "I honestly believe they use real snow crab. "], "author": "Daniel D.", "review": "Absolutely amazing. I came here for lunch, on the recommendation of a friend. Ordered the Wakame Salad Set with a Spicy Bacon Onigilly and a Snow Crab Onigilly. I also had the Organic Matcha Lemonade. \n\nLet me be frank: I LOVE LEMONADE, and their Matcha lemonade just became a new favorite. The idea of the green tea threwme off, but I decidied to take the plunge. I'm glad I did.\n\nThe seaweed tasted very fresh and the meat exceeded expectation. I honestly believe they use real snow crab. Even the Wakame salad was great.\n\nDefinitely a new favorite restaurant!", "rating": 5, "date": "2015-05-05"}], "bento set w onigilly": [], "custom set w onigilly": [], "salad bowl": [{"excerpts": ["The salad bowl not filling enough, and not enough salad, would just stick with the rice balls."], "author": "Jonathan C.", "review": "Good place to fill that carb craving, while still eating relatively healthy.  I enjoy the shiitake, snow crab, eel.\n\nZosui was also good for the winter months, kind of a heartier liquid risotto like texture.\n\nThe salad bowl not filling enough, and not enough salad, would just stick with the rice balls.", "rating": 4, "date": "2018-06-25"}, {"excerpts": ["I couldn't decide between getting a salad bowl or a rice bowl, and discovered with the help of the nice cashier that they can do half salad half rice! "], "author": "Ashley S.", "review": "Simple, clean, healthy, delicious to-go spot for Japanese onigiri (triangular rice ball snack with filling wrapped in seaweed), caters to the weekday lunch crowd. I think Onigilly might turn out to be one of those places I CRAVE. Well, actually, I already know it is because I went on Friday, and was already wishing they were open on Saturday, the next day, so I could go back (they're open only Mon-Fri). \n\nI couldn't decide between getting a salad bowl or a rice bowl, and discovered with the help of the nice cashier that they can do half salad half rice! I did the half-and-half, which comes with edamame and pickles and dressing, and for the 3 toppings, I chose Shiitake (delicious, perhaps my fav), Snow Crab (also delicious, fresh, and their most popular topping), and Tempura Shrimp (good, but gets soggy when you get it to-go. Might opt for the Spicy Shrimp or Spicy Bacon next time). \n\nI also ordered a teriyaki chicken onigiri to save for later, but curiosity and fatassery got the best of me. I popped that onigiri to-go box open for \"just a bite\" but ended up inhaling the whole thing despite being full already from the salad/rice bowl.\n\nCan't wait to return to try some of their other offerings!! So. excite. !", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["First, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\n"], "author": "Winnie L.", "review": "This place is literally RIGHT next to plentea. They close at 4 and I went in at 3:50 and they were nice enough to let us eat there past 4. Sorry :P I work in food service so I know how you guys felt but we wouldn't have had anywhere else to eat!! \n\nFirst, you choose a set meal (3 onigilly edamame set, wakame bowl, miso soup set or rice/salad bowl). \n\nI got the rice bowl which comes with half rice and half salad. I got to choose 3 onigilly fillings. I chose the Hijiki (braised seaweed & carrots), teriyaki chicken & salmon. It comes with a side dressing for the salad & some edamame as well. So worth it because you get a little bit of each. It's the size of a chipotle bowl, so it's pretty filling! This is something I've never tried because there's nothing really like this in LA so I'm glad I got to try this place. I want to come back and try the onigilly next time!!", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["I ended up ordering a salad bowl with toppings of their spicy shrimp, spicy bacon, and snow crab. ", "I also ordered a matcha green tea lemonade with the food. ", "The snow crab tasted a bit off, and the spicy shrimp was just okay. ", "The only thing I liked was the spicy bacon. ", "Some of the salad greens at the bottom of the bowl were bruised.... "], "author": "Ava F.", "review": "This place is literally a block away from my work so I always pass by this restaurant. Finally decided to give this a try. The cashier was really nice, genuinely friendly and eager to help this first timer. I ended up ordering a salad bowl with toppings of their spicy shrimp, spicy bacon, and snow crab. I also ordered a matcha green tea lemonade with the food. The wait wasn't long as I went in just a little after 11 am. \n\nThe matcha green tea lemonade is interesting. It tastes mostly like lemonade, but it's got a slight matcha after taste. Not too bad. Terms of food, I should've stuck with their onigilly's or gotten a rice bowl. The cold food did not go too well with greens. The snow crab tasted a bit off, and the spicy shrimp was just okay. The only thing I liked was the spicy bacon. Some of the salad greens at the bottom of the bowl were bruised.... boo :(\n\nIf I could give 3.5 stars I would.", "rating": 4, "date": "2015-02-23"}, {"excerpts": ["I decided to get the salad bowl with Spicy Shrimp, Unagi and Spicy Bacon while my boyfriend got the same combination but in a rice bowl... "], "author": "Melissa C.", "review": "AHHH this place is SO GOOD! \n\nI've had it on my list for awhile...was craving fish/japanese food so I finally made my way over here. \n\nI decided to get the salad bowl with Spicy Shrimp, Unagi and Spicy Bacon while my boyfriend got the same combination but in a rice bowl... oh and we shared a miso soup.\n\nI feel that the prices here are more reasonable considering that the food is of really good quality and extremely flavorful. An adequate healthy lunch for less than $10!\n\nAll of the meats we got were delicious! Super flavorful! I personally think I liked the unagi best while my bf said the shrimp was his favorite. You can't go wrong with any of them though. \n\nMy boyfriend was surprised that the rice was brown, said it tasted like white rice... which is a good thing for the picky rice eaters, healthy without compensating flavor (although I personally enjoy brown rice). \n\nThe miso soup was good too, not too strong or salty; I loved that it was completely natural so I know that I was getting some of my probiotic intake for the day :D \n\nThey have TONS of options for your onigiri/salad/rice bowls. If you're vegetarian or gluten free this is a great option for you guys too! If you're in a hurry onigiri is very friendly for on the go eating as well.\n\nThe restaurant is pretty small/cramped and busy. We went at an odd time..around 1:30-2ish but there was a steady flow of customers coming in... if you're dining in you're gonna have to choose on whether or not you wanna stick your ass or frontal area in someones face since the tables are really close together =p \n\nBut that's not the point! I definitely recommend this spot and am looking forward to coming here again!", "rating": 4, "date": "2015-02-08"}, {"excerpts": ["She tried the salad bowl with a choice of 3 toppings ", "and I had the rice bowl with a choice of 3 toppings. "], "author": "Monelle A.", "review": "Mmmmm, my new favorite lunch spot! The perfect place to satisfy your Japanese/sushi cravings without the heaviness of a bento box. \n\nI came here the other day with my bestie. She tried the salad bowl with a choice of 3 toppings and I had the rice bowl with a choice of 3 toppings. Each came with a side of salad greens, edamame, and pickles. \n\nThe standouts were the snow crab, soboro, and tarako. Note about the tarako: it's on the salty side, but the saltiness is a great contrast to the sweet soboro and the creaminess of the snow crab. The unagi, spicy shrimp, and pickled mustard greens were also pretty good. \n\nMuch, much better than Sushiritto, which I think is overpriced and overhyped. Definitely getting added into my regular rotation of lunch spots!", "rating": 4, "date": "2015-01-08"}, {"excerpts": ["Since I didn't do a set meal/rice bowl/salad bowl, I went back to the cashier and ordered a seaweed side salad. "], "author": "Joanna T.", "review": "Onigilly is a cute cafe that is best suited for a light bite of healthy and fresh Japanese onigilly.  I think it's important to not have an expectation that you're going to be stuffed after eating here.\n\nI am a light eater at lunch time (typically) and after having two onigilly (1- pork and 1-chicken teriyaki) I was still hungry. Yikes! I wish there were a variety of creative, homemade sauces available for the onigilly, just in case you'd like something other than hot/spicy sauce to dip your onigillys in. I found the pork onigilly to have flavor but was a little bit dry.\n\nSince I didn't do a set meal/rice bowl/salad bowl, I went back to the cashier and ordered a seaweed side salad. This was flavorful and a lovely shade of sea green, the seaweed mound sitting on a few strands of lettuce.\n\nPricing comes out to about $3.00 per onigilly including tax a la carte. I think the quality of the ingredients and the freshness of product result in this above average cost.\n\nThe staff are super polite and are patient!\n\nI like the fact that this business started out as a food cart and has found enough backing to open this shop. If anything else, support this local business and help them grow/improve their business!", "rating": 3, "date": "2012-10-16"}, {"excerpts": ["Choose Onigilly set (or individual), Rice Bowl, or Salad Bowl\n2) "], "author": "Katherine S.", "review": "Yummy! The menu has the instructions for ordering and when I was here, there was a worker who was popping outside to answer questions. Yup, there's a line out the door during lunch, but the place is small. I recommend getting food to go since there's limited seating. Walk over to BoA plaza nearby and eat outside in the beautiful weather!\n\nOrder in 2 steps:\n1) Choose Onigilly set (or individual), Rice Bowl, or Salad Bowl\n2) Choose your flavors (the stuff that goes inside)\n\nFYI - the name of the restaurant is a play on the word \"onigiri\" for Japanese rice ball :)\n\nI got the set of 3:\n+Soboro -- ginger soy ground angus beef\n+Spicy Bacon\n+Spicy Shrimp\nThe set of 3 comes with a salad too! Wasn't expecting that.\n\nThey're trying to get feedback from customers, so they give you a survey when you pick up your food. Fill it out and bring it back for $2 off your next meal!", "rating": 4, "date": "2012-10-07"}]}