{"piece egg roll": [], "piece pot stickers": [], "deep fried prawns": [], "deep fried squids": [], "assorted seafood soup with tofu": [], "dry scallops with yellow chive soup": [], "west lake beef soup": [], "sizzling rice soup with seafood": [{"excerpts": ["We ordered chicken with black mushrooms, beef with chinese brocolli, sizzling rice soup with seafood and the service was decent. ", "I thought the food is good with reasonable prices, If I'm in the sunset, I'll come here again."], "author": "Jer W.", "review": "I went with my hairstylist and her daughter to this eatery on 6-1-12 10:00pm'sh.  Since there are not many options in the evening, she decided that we should come here. We ordered chicken with black mushrooms, beef with chinese brocolli, sizzling rice soup with seafood and the service was decent. I thought the food is good with reasonable prices, If I'm in the sunset, I'll come here again.", "rating": 4, "date": "2012-06-02"}], "sizzling rice soup with pork": [{"excerpts": ["I ordered the sizzling rice soup with pork. "], "author": "Sira V.", "review": "This is a nice clean place with friendly staff. \n\nThe food came quickly (which was an especially good thing since another table just got their food and it looked and smelled fabulous) and was piping hot. \n\nSince I was dining alone (I know, \"Dining alone? What's that?\") I ordered the sizzling rice soup with pork. It was so very good! \n\nThe soup had carrots, mushrooms, snap peas, pork, and, of course, the rice. Everything was just so good and fresh. The only thing missing was water chestnuts. \n\nIt was meant to be a lite lunch bite, but I had a hard time stopping and nearly finished the whole thing. \n\nIt's hard to judge a place by one dish, but aren't we all judgemental to some degree? So I judge this place four stars.\n\nI guess this is a good reason to return.  I bet I'll order the soup again but I'll be sure to have reinforcements so I can try other dishes.", "rating": 4, "date": "2016-11-08"}], "crab meat with sweet corn soup": [{"excerpts": ["*Crab Meat with Sweet Corn Soup ($6.95)\n"], "author": "Elena N.", "review": "3.5 STARS\n\nAfter drinking across the street in celebration of a Warriors win, the boys were hungry. We decided to go to Oriental Seafood Restaurant on Thursday, June 8th around 12 midnight. Our party of three was seated right away at a big round table. (At least I think it was a big table. My memory is a little hazy.) Good thing cuz a girlfriend joined us a little later so there was plenty of room.\n\n*Crab Meat with Sweet Corn Soup ($6.95)\n*Oysters with Roast Pork in Clay Pot ($9.95)\n*Yang Chow Fried Rice ($7.50)\n*Pea Shoots (Dau Miu)\n\nI wasn't hungry at all, so I didn't really try anything. Had a bite of the dao miao which was cooked perfectly. (I hate overcooked mushy veggies.) It also had a nice amount of garlic flavor. The rest of the food looked great and everyone seemed to enjoy it. I believe the check was around $40. Not bad for four people and we had leftovers.\n\nGood option for late night eats if you are craving Chinese food.", "rating": 4, "date": "2017-06-15"}], "chicken with sweet corn soup": [], "seaweed soup with egg drops": [], "free range chicken with ho fun soup": [], "beef and spinach noodle soup": [], "beef stew wonton soup with ho fun": [], "minced beef with rice noodle soup": [], "rice noodle soup with preserved snow veggie and pork": [], "rice noodle soup with beef and preserved vegetable": [], "seafood with ho fun soup": [], "rice noodle soup with seafood": [], "half crispy chicken": [], "half steamed chicken with ginger and scallion": [], " steamed chicken with ginger sauce": [], "half hot spiced crispy chicken": [], "chicken with curry sauce": [], "hot spiced chicken": [], "chicken with black mushroom": [], "chicken with tender green": [], "chicken with cashew nut": [], "sweet and sour chicken": [], "sauteed scallops and prawns": [], "sauteed scallops": [], "sauteed assorted seafood": [], "rock cod fillet with tender green": [], "rock cod fillet with black bean sauce": [], "sauteed rock cod fish fillet": [], "flounder fish fillet with tender green": [], "salt and pepper flounder fish fillet": [], "salt and pepper squids": [], "salt and pepper prawns": [], "prawns with broccoli": [], "prawns with tender green": [], "prawns with cashew nut": [], "steamed prawns with garlic sauce": [], "prawns with lobster sauce": [], "squids with black bean sauce": [], "clams with black bean sauce": [{"excerpts": ["Clams with black bean sauce : tender juicy little morsels . ", "Mixed in the sauce with rice and u r in heaven .."], "author": "Joe L.", "review": "My buddy invited me to this restaurant to have dinner.  I reviewed the menu and was surprised why everything was so reasonably priced ($5-8). I figured the portion will be small at that price : I was so wrong . When the food arrived , my jaws dropped as to the amount of food that was on each plate .  I was still skeptical , so I dove into each dish.  OmGeeeeeee !!!! It was like eating in Chinatown , back in the days . The food was really really really good .  The chef has some talent here \n\nFood review:\n\nPeking porkchop : Just like I always imagined it . Sweet/tangy with the right amount of crispness . \n\nClams with black bean sauce : tender juicy little morsels . Mixed in the sauce with rice and u r in heaven ..Yummy indeed \n\nChicken Salty fish w/egg plant: not over salty. One taste brings back fond memories in ToiShan . \n\nSpinach w/garlic : need in say more . \n\nAll the above was perfectly seasoned . Triple bonus for no MSG attack after the meal. \n\nMany thanks to the cool smiley waitress", "rating": 4, "date": "2017-05-18"}], "steamed surf clams": [{"excerpts": ["Then after downing anywhere from 3 to 5 beers, you can finish this perfect experience with an order The Steamed Surf Clams ($7-8 per person). ", "The clams are served sliced on a small bed of vermicelli with a healthy amount of soy sauce, all plated on the original clam shell. "], "author": "Ringo M.", "review": "You see a small Chinese restaurant with an unflattering furnishing and there's not much to think about after that.\n\n-You only go during lazy Tuesday nights for take-away chicken fried rice (and you drench it in Sriracha at home).\n\n-You only go when you're balling on a budget because $25 can get you a filling dinner for 2 with leftovers for lunch the next day.\n\n-It's a place you NEVER suggest to a friend. You'll suggest Koi Palace or S&T. You will suggest House of Xian or House of Pancakes. But never in your life will you suggest Oriental Seafood Restaurant.\n\nThat's all fair. OSR is not heralded like their neighbor S&T, nor do they have a special dish such as the Dan Dan Mien like House of Xian. It's not, as young cats would say, \"lit\". But I'm here to change that. Because OSR has a lot to offer, and it can be \"lit\" for all of us. \n\nConsider creating your own happy hour at OSR with your group of friends. $4 for a bottle of Heineken or TsingTao (spoiler: they taste the same), so that's $12 for a pretty good time. Supplement the beer with an array of Chinese makeshift Happy Hour food. The Salt & Pepper Spareribs ($8) is crispy, fried, meaty, and just begging to be washed down by a bottle of cold beer. For a slightly lighter option (with an big emphasis on slightly), the Honey Walnut Shrimp is a crowd favorite. Slightly fried shrimp doused heavily in mayonnaise, this popular dish takes away all the natural flavors of the shrimp and replaces it with a gluttonous awesomeness. In other words, the ideal pairing for mass-produced beer. Then after downing anywhere from 3 to 5 beers, you can finish this perfect experience with an order The Steamed Surf Clams ($7-8 per person). The clams are served sliced on a small bed of vermicelli with a healthy amount of soy sauce, all plated on the original clam shell. It's a good finish to the meal and gives a good glimpse of what OSR has to offer other than its Panda-esque menu. \n\nYour group will leave Oriental Seafood Restaurant with your bellies full and a slight buzz from reasonably priced beers -- a perfect pre-game. As your group Lyft your way out to an awesome night out, keep track of the OSR's bill total as compared to your transportation cost. You may not find a more economic Happy Hour place in all of San Francisco. Isn't that worth a recommendation?\n\n--\n\nFor people looking for serious seafood, I'd be remiss not to mention their Lobster. I'm not here to vouch for it's taste or OSR's cooking technique, I'm here to vouch for its value. \n\nLobsters are always market price, but I've been able to get away with $20 to $23 a pound. For a 6lb monster, you're only looking at $140 ish. This is crazy. I repeat, crazy. For a similar lobster at Koi Palace and/or Hong Kong Flower Lounge, you're going to be ponying up $300+. \n\nThe lobster can be served two different styles. The classic Cantonese way would be to have one plate be cooked with Ginger and Scallion. This way of cooking is supposed to minimize the interference with the Lobster's natural flavors while adding another layer of aroma. Or so my Grandpa says, he's the expert in our fam. The second way would be for it to be steamed with garlic over a bed of vermicelli. The same logic applies, minimize the interference of the Lobster's flavor.\n\nThis 6lb Lobster feeds four. Before cooking, the waitress will fish out the Lobster for your table to see how lively it is. I can attest, it's usually as lively as Blake Lively. This has become my go-to restaurant to take my gramps. He loves the giant lobster, and I'm all in on OSR's value. Good stuff.", "rating": 4, "date": "2018-06-03"}], "salt and pepper pork chops": [{"excerpts": ["It came with:\n-Westlake beef soup\n-Sweet and sour pork chops (we sub'd salt and pepper pork chops)\n-Lobster w/ginger and scallions\n-Calamari with bok choy\n-Clams with black bean sauce\n-Steam shrimp (we sub'd salt and pepper shrimp)\n\nPortions are huge. "], "author": "Andy W.", "review": "Hole in the wall at it's best! This place deserves 5 stars for what it is.\n\nNo, the service is not top notch, the restaurant isn't the best looking, and the food is not spectacular either BUT for the amount you pay here, it doesn't get better than this. \n\nThe food is great. Everything was packed with flavor down to the bok choy which is boring often times. The service is good. We never had to ask for refills on anything thing -- tea, napkins, rice. Even when the restaurant was full, they still checked on us often. They even changed our plates in the middle of our meal.\n\nThey have set dinners at unbelievable prices. What we had was the $46 set. It came with:\n-Westlake beef soup\n-Sweet and sour pork chops (we sub'd salt and pepper pork chops)\n-Lobster w/ginger and scallions\n-Calamari with bok choy\n-Clams with black bean sauce\n-Steam shrimp (we sub'd salt and pepper shrimp)\n\nPortions are huge. There were 4 of us and we had leftovers to take home. This meal would have fed another person easily. At the end they even give you a dessert soup. \n\nFor about $13 bucks a person, I really didn't expect this level of service and that we'd be having lobster, clams and shrimp. It doesn't get better than this.", "rating": 5, "date": "2011-08-24"}], "peking spare ribs": [], "steamed spareribs with black bean sauce": [], "stir fried spareribs with black bean sauce": [], "steamed minced pork with salted fish": [], "steamed minced pork with salted egg": [], "beef with tender green": [{"excerpts": ["Beef with Tender Green Chow Mein $5.25 - Ok flavor. \n\n"], "author": "J W.", "review": "Got takeout.  The food here is not good anymore, but they still give good portions and are inexpensive.  The restaurant must have new ownership.  \n\n    1)  Beef Chow Fun with Gravy $5.25 - no taste, not enough gravy and the rice noodles were soggy.\n\n    2)  Salted Fish & Chicken Fried Rice $5.50 - A little flavor but without the salted fish, there'll be no flavor. \n\n    3)  Chicken Fried Rice $5.25 - No flavor.\n\n    4)  Flounder Fish Fillet with Tender Greens on Rice $5.50 - No flavor\n\n    5)  Peking Spareribs on Rice ? Price - Dish not on the menu. - Pretty good taste. \n \n    6)  Singapore Fried Rice Noodles $5.50 - Has good flavor.  \n\n    7)  Beef with Tender Green Chow Mein $5.25 - Ok flavor. \n\nI was so disappointed with the food.  Wished that it tasted better.  \n\nThe lady who took the orders over the phone was rude.   When I paid for the food, she didn't say thank you or even look at me. \n\nI don't recommend this restaurant unless you want cheap inexpensive food and don't care about the taste of the food or the service.", "rating": 1, "date": "2014-10-12"}], "medallion beef with black pepper": [], "chinese style medallion beef": [], "short ribs with black pepper": [], "salt and pepper short ribs": [{"excerpts": ["On my first visit here with my boyfriend, we ordered the salt and pepper short ribs to-go. ", "When our order was ready, which took no longer than 15 minutes, I was surprised. ", "The meat was jammed into a plastic container box, to the point where the box almost didn't close shut! ", "It's more than enough for two people to finish in one sitting. "], "author": "Annie S.", "review": "This is truly a hole-in-the-wall restaurant that is easily overlooked because it's situated right next to ABC.\n\nOn my first visit here with my boyfriend, we ordered the salt and pepper short ribs to-go. When our order was ready, which took no longer than 15 minutes, I was surprised. The meat was jammed into a plastic container box, to the point where the box almost didn't close shut! It's more than enough for two people to finish in one sitting. At about $6-7/entree for most dishes here, the prices cannot be beat. \n\nOn my second visit here with a friend of mine, we ordered the hot crispy (half) chicken and flat rice noodles with beef and bok choy. I'm not lying when I say that their hot crispy chicken is comparable to San Tung's chicken wings. The sauce is sweet and spicy and the skin on top of the chicken is perfectly crispy. More so, I feel a little bit better (health-conscious wise) eating the crispy chicken since it's mostly white meat. And the total cost of our meal which we both completely devoured up and had no leftovers whatsoever? $14 with tax and tip.\n\nWill I be back? Definitely. Extra pluses: free peanuts as appetizer, friendly service, open until 2am, and accepts VISA and Mastercard. Give this place a try!", "rating": 4, "date": "2012-01-22"}], "beef with tofu": [], "kung pao beef": [], "beef with hunan sauce": [], "black mushroom water chestnuts and snow peas": [], "mixed vegetable combinations": [], "sauteed spinach with garlic": [], "string bean with hunan sauce": [], "black mushroom with tender green": [], "spicy bean cake with pork": [], "eggplant with garlic and spicy sauce": [], "braised tofu with black mushroom and tender green": [], "house pan fried noodle": [], "prawns pan fried noodle": [], "bean sprout and yellow chives chow mein": [], "shredded pork and yellow chives chow mein": [], "prawns chow mein with tender green": [], "beef chow mein with tender green": [], "singapore style fried rice noodle": [], "prawns chow fun with tender green": [], "shrimps fried rice": [], "salted fish and chicken fried rice": [], "braised yee foo noodle with crab meat": [], "lobster yee tho noodles": [], "fukien style fried rice": [], "singapore style chow fun": [], "sizzling oysters with ginger and scallion platter": [], "sizzling scallops and prawns platter": [], "sizzling assorted seafood platter": [], "sizzling hunan tofu platter": [], "combination seafood on rice plate": [], "flounder fish fillet with tender green on rice plate": [], "prawns with lobster sauce on rice plate": [], "rock cod fillet with tender green on rice plate": [], "prawns with tender green on rice plate": [], "kung pao prawns on rice plate": [], "beef and broccoli on rice plate": [], "mongolian beef on rice plate": [], "beef and tofu on rice plate": [], "beef with tender green on rice plate": [], "beef with green bean on rice plate": [], "minced beef with egg on rice plate": [], "kung pao chicken on rice plate": [], "chicken with tender green on rice plate": [], "chicken with black mushroom on rice plate": [], "curry chicken on rice plate": [], "chicken with broccoli on rice plate": [], "squids with onion on rice plate": [], "rock cod fillet with black bean sauce on rice plate": [], "chicken with black bean sauce on rice plate": [], "mu shu shrimps": [], "mu shu beef": [], "mu shu chicken": [], "mu shu vegetables": [], "salted fish and chicken with tofu in clay pot": [], "salted fish and chicken with eggplant in clay pot": [], "short ribs with eggplant in clay pot": [], "oysters with roast pork in clay pot": [{"excerpts": ["*Oysters with Roast Pork in Clay Pot ($9.95)\n", "*Yang Chow Fried Rice ($7.50)\n"], "author": "Elena N.", "review": "3.5 STARS\n\nAfter drinking across the street in celebration of a Warriors win, the boys were hungry. We decided to go to Oriental Seafood Restaurant on Thursday, June 8th around 12 midnight. Our party of three was seated right away at a big round table. (At least I think it was a big table. My memory is a little hazy.) Good thing cuz a girlfriend joined us a little later so there was plenty of room.\n\n*Crab Meat with Sweet Corn Soup ($6.95)\n*Oysters with Roast Pork in Clay Pot ($9.95)\n*Yang Chow Fried Rice ($7.50)\n*Pea Shoots (Dau Miu)\n\nI wasn't hungry at all, so I didn't really try anything. Had a bite of the dao miao which was cooked perfectly. (I hate overcooked mushy veggies.) It also had a nice amount of garlic flavor. The rest of the food looked great and everyone seemed to enjoy it. I believe the check was around $40. Not bad for four people and we had leftovers.\n\nGood option for late night eats if you are craving Chinese food.", "rating": 4, "date": "2017-06-15"}], "catfish with roast pork in clay pot": [], "catfish with black pepper in clay pot": [], "rock cod fillet with black bean sauce in clay pot": [], "beef stew with lettuce in clay pot": [], "lamb stew with dry bean curd in clay pot": [], "rock cod fillet with braised tofu in clay pot": []}