{"garlic edamame": [], "sunomomo": [], "oyogu salad": [], "island poke": [{"excerpts": ["Island Poke was very good, salmon teriyaki was a bit dry, spicy tuna was a bit off. ", "The fish in the sashimi roll was ok - not great. ", "Overall an average experience."], "author": "Josh W.", "review": "I got a bento box with salmon teriyaki and spicy tuna roll. My wife ordered a poke bowl and the cucumber sashimi roll. The results were mixed. Island Poke was very good, salmon teriyaki was a bit dry, spicy tuna was a bit off. The fish in the sashimi roll was ok - not great. Overall an average experience.", "rating": 3, "date": "2017-01-06"}], "hiya yakko": [], "corn tempura": [], "yaki ika": [], "ten zaru": [], "yama uni": [], "golden salmon": [], "item bento combo": [], "hotategai nigiri": [], "kanpachi nigiri": [], "albacore sashimi": [], "amaebi sashimi": [], "hotategai sashimi": [], "kanpachi sashimi": [], "sake hand roll": [], "spicy negihama hand roll": [], "snow crab hand roll": [], "spicy scallop hand roll": [{"excerpts": ["$12.95\n\nSpicy scallop hand roll = the best. "], "author": "Fannie S.", "review": "Food = great. \n\nAgedashi tofu = the best.  3 giant blocks of silken tofu in one of the best broth/sauce I've ever had.  He didn't want any...his loss, and totally my gain.  $5.50 (minus 15% off during HH)\n\nPork gyoza = okay. $6.95 (minus 15% off during HH)\n\nHamachi kama (yellowtail cheek/collar)= awesome. Another item that I was excited and satisfied with. $11.95 (minus 15% off during HH)\n\nDeep fried oysters = excellent. Crunchy breading but not too heavy. 4 pieces. $5.00 (specialty item)\n\nFire dragon roll (cucumber and shrimp tempura topped with spicy tuna, avocado and tobiko) = His top favorite.  It was pretty good. $12.95\n\nSpicy scallop hand roll = the best. Sweet scallop, spicy sauce, and delicious seaweed. I could've eaten 3 more of these. $7.95\n\nVolcano roll (crunchy salmon skin and mixed vegetables) = My least favorite roll. Partially due to my expectations of what the volcano roll would be, and it was sort of dry. $5.95\n\nTempura roll (shrimp tempura, cucumber and tobiko) = He liked it. $6.95\n\nDragon roll (shrimp tempura and cucumber topped with eel, avocado, scallions, tobiko and eel sauce) =  I wanted it for the eel but should've paid attention to his order of the fire dragon roll. Oops. $12.95\n\nSho chiku bai nigori (375 ml) = $12.00 (minus 15% off during HH)\n\nService = friendly and attentive.\n\nPrices = reasonable to moderate. 15% off beer and sake and appetizers during Happy Hour which is great. Dinner for two with leftovers came out to $89.72. Should've stopped with two appetizers and skipped one specialty roll. \n\nHappy Hour = Sunday to Thursday from 5 to 6:30 p.m.; 15% off appetizers and beer and wine (on their printed menu).  \n\nFYI: They have dinner hours every day, and lunch hours on the weekends only. \n\nWe're definitely coming back here.", "rating": 4, "date": "2017-03-25"}, {"excerpts": ["Spicy scallop hand roll - This roll was packed with so much scallop and it was delicious! ", "The scallop was sweet and creamy.  ", "I would definitely order this again.\n", "R&J roll (hamachi, salmon, shrimp tempura w/ unagi sauce) - I don't typically like hamachi, but the man friend does, so we got it.  ", "The hamachi was a little fishy, but I couldn't tell (apparently man friend is a hamachi connoisseur)? ", "The roll itself was good with good flavor profile and textures with the sweet unagi sauce, buttery salmon and crunchy shrimp tempura!\n", "Bento box w/ spicy tuna roll, mixed tempura and chicken katsu - ", "I was most impressed with the presentation of the bento box.  ", "It was probably the best looking bento I've ever seen! ", "Everything in it was delicious to boot! "], "author": "Colleen L.", "review": "We found this place on Yelp, which has pretty good reviews.  We were really craving sushi and it was relatively close in proximity. \n\nWe ordered the following:\nSmoked sake - This was really good, but I think a bit novel considering the price.  The smoked flavor wasn't very strong, but the key to utilizing the Himalayan salt block is to leave the salmon on there for some time.  I still preferred dipping my sake in soy sauce, but to each their own.\nUnagi hand roll - The price is a bit much for this and it was a bit lackluster.  I would probably not order this again.\nSpicy scallop hand roll - This roll was packed with so much scallop and it was delicious! The scallop was sweet and creamy.  I would definitely order this again.\nR&J roll (hamachi, salmon, shrimp tempura w/ unagi sauce) - I don't typically like hamachi, but the man friend does, so we got it.  The hamachi was a little fishy, but I couldn't tell (apparently man friend is a hamachi connoisseur)? The roll itself was good with good flavor profile and textures with the sweet unagi sauce, buttery salmon and crunchy shrimp tempura!\nBento box w/ spicy tuna roll, mixed tempura and chicken katsu - I was most impressed with the presentation of the bento box.  It was probably the best looking bento I've ever seen! Everything in it was delicious to boot! 5 stars here.\n\nI would definitely be coming back, but will order our favorites.\n\nBon appetit!", "rating": 4, "date": "2017-01-21"}], "tempura hand roll": [], "ume shiso maki roll": [], "veggie california roll": [], "veggie caterpillar roll": [], "crunchy california roll": [], "oyogu roll": [{"excerpts": ["We ordered the Oyogu roll, Albacore Tataki, salmon sashimi, dragon and caterpillar roll.  ", "From the present of the dishes, you can tell the chef had really put quite some effort on them coz they look good. ", "The sashimi tasted fresh and the special sauce was delicious.  "], "author": "Hong Y.", "review": "I was looking for a sushi place to go in the neighborhood of my in-law and found this newly opened one. Decided to give it a try since it has some positive reviews.  I am glad we did coz it becomes our All-Time-Favorite sushi place now. \n\nEasy find free parking, decent environment/atmosphere. The impressive parts are the food and service they provided. \n\nWe ordered the Oyogu roll, Albacore Tataki, salmon sashimi, dragon and caterpillar roll.  From the present of the dishes, you can tell the chef had really put quite some effort on them coz they look good. The sashimi tasted fresh and the special sauce was delicious.  The chef also made some cute mini sushi for my 2-yr old son and he love it.  \n\nBeside the good food and the affordable price, what I love the most here is the service and the friendly smile of everyone.  The chef even treated us two shot of their best Japanese rice wine at the end to congrat us for our unborn baby girl.", "rating": 5, "date": "2016-05-23"}], "fire dragon roll": [{"excerpts": ["$5.00 (specialty item)\n\nFire dragon roll (cucumber and shrimp tempura topped with spicy tuna, avocado and tobiko) = ", "I wanted it for the eel but should've paid attention to his order of the fire dragon roll. ", "Oops. "], "author": "Fannie S.", "review": "Food = great. \n\nAgedashi tofu = the best.  3 giant blocks of silken tofu in one of the best broth/sauce I've ever had.  He didn't want any...his loss, and totally my gain.  $5.50 (minus 15% off during HH)\n\nPork gyoza = okay. $6.95 (minus 15% off during HH)\n\nHamachi kama (yellowtail cheek/collar)= awesome. Another item that I was excited and satisfied with. $11.95 (minus 15% off during HH)\n\nDeep fried oysters = excellent. Crunchy breading but not too heavy. 4 pieces. $5.00 (specialty item)\n\nFire dragon roll (cucumber and shrimp tempura topped with spicy tuna, avocado and tobiko) = His top favorite.  It was pretty good. $12.95\n\nSpicy scallop hand roll = the best. Sweet scallop, spicy sauce, and delicious seaweed. I could've eaten 3 more of these. $7.95\n\nVolcano roll (crunchy salmon skin and mixed vegetables) = My least favorite roll. Partially due to my expectations of what the volcano roll would be, and it was sort of dry. $5.95\n\nTempura roll (shrimp tempura, cucumber and tobiko) = He liked it. $6.95\n\nDragon roll (shrimp tempura and cucumber topped with eel, avocado, scallions, tobiko and eel sauce) =  I wanted it for the eel but should've paid attention to his order of the fire dragon roll. Oops. $12.95\n\nSho chiku bai nigori (375 ml) = $12.00 (minus 15% off during HH)\n\nService = friendly and attentive.\n\nPrices = reasonable to moderate. 15% off beer and sake and appetizers during Happy Hour which is great. Dinner for two with leftovers came out to $89.72. Should've stopped with two appetizers and skipped one specialty roll. \n\nHappy Hour = Sunday to Thursday from 5 to 6:30 p.m.; 15% off appetizers and beer and wine (on their printed menu).  \n\nFYI: They have dinner hours every day, and lunch hours on the weekends only. \n\nWe're definitely coming back here.", "rating": 4, "date": "2017-03-25"}], "r and j roll": [{"excerpts": ["My first order was dinner, I had one of their special rolls called R and J roll. ", "Then I ordered tamago, Inari, and Hamachi Nigiri sushi - the orders come with 2 pieces of fish. ", "Perfect portion sizes and ", "I had enough for breakfast! "], "author": "Koa K.", "review": "This is my second time ordering and I'm a fan. Enough of a fan to Yelp and order again! \n\nI ordered from here because my usual mainstay was closed for Thanksgiving week (Tazaki). It was close and open and though I'd give it a try.  My first order was dinner, I had one of their special rolls called R and J roll. Then I ordered tamago, Inari, and Hamachi Nigiri sushi - the orders come with 2 pieces of fish. Perfect portion sizes and I had enough for breakfast! (Fish still tasted delicious). \n\nI didn't think the sauce overpowered the flavor of the fish as one commenter on here said. However this was a take out order so maybe they added less. \nVery friendly too when I went to pick up, definite plus. \n\n____________________\n\nI just had my second take out order from them, the Lunch bento with 3 options. This is what I would call my ideal order. First impression was, \"wow a lot of food!\". \nThen I opened the top and the smell was amazing. One of the best smells in the world is fresh sushi. Yum! Service on pickup was again very friendly. I'll let the photo I've added do the talking.", "rating": 5, "date": "2016-11-29"}], "crunchy blossom roll": [{"excerpts": ["Crunchy blossom roll: a spicy-crunchy version of the \"cherry blossom\" from other sushi restaurant, a good combination of both, we like it a lot. ", "( Not to mention that I finally find another roll that my little princess can eat).   \n", "3) ", "Caterpillar roll: ", "my wife and I only has a little bite on this. ", "The rest are all finished my little princess, and she refuse to share with us"], "author": "Yuyi L.", "review": "I was in the city to visit my family, and saw this Sushi restaurant open for business. My wife and I are huge fans of sushi, so we give it a try. And it turn out to be one of the best sushi experience. \n\nWe order the following: \n1) Per the chef's recommendation, we order Special Sashimi combination. All sashimi are really fresh, and we really like the house special sauce. It is worth to upgrade from the assorted 16 pcs. \n2) Crunchy blossom roll: a spicy-crunchy version of the \"cherry blossom\" from other sushi restaurant, a good combination of both, we like it a lot. ( Not to mention that I finally find another roll that my little princess can eat).   \n3) Caterpillar roll: my wife and I only has a little bite on this. The rest are all finished my little princess, and she refuse to share with us, it must be good (and kids don't lie) \n\nThis is the place for people who crave for great sushi and sashimi. We will definitely come back.", "rating": 5, "date": "2016-05-22"}], "spicy girl roll": [], "cucumber sashimi roll": [{"excerpts": ["My wife ordered a poke bowl and the cucumber sashimi roll. ", "The results were mixed. "], "author": "Josh W.", "review": "I got a bento box with salmon teriyaki and spicy tuna roll. My wife ordered a poke bowl and the cucumber sashimi roll. The results were mixed. Island Poke was very good, salmon teriyaki was a bit dry, spicy tuna was a bit off. The fish in the sashimi roll was ok - not great. Overall an average experience.", "rating": 3, "date": "2017-01-06"}], "chicken katsu lunch": [], "unagi don lunch": [], "item bento combo lunch": []}