{"oz can soda": [], "liter soda": [], "bottled water": [], "snapple": [{"excerpts": ["These people charged me $3.25 for a Snapple.\n\n"], "author": "L. S. A.", "review": "These people charged me $3.25 for a Snapple.\n\nUPDATE:  Oh I just read the review by Joshua H. below.  I have brown skin... I guess that explains it.\n\np.s. Onur O:  Your not \"getting\" my point proves my point.  Don't worry, I won't be back.", "rating": 1, "date": "2017-12-05"}], "greek salad": [], "caesar salad": [], "greek salad tray": [], "caesar salad tray": [], "spicy wings": [], "bbq wings": [], "carnivores delight pizza": [], "meatball pizza": [{"excerpts": ["I got meatball pizza...", "lots of quartered meatballs but were a little dry... ", "the crust is kinda thin crispy and chewy at the same time."], "author": "Raquel K.", "review": "walked in here with a group of friends for a quick bite of pizza slice. I got meatball pizza...lots of quartered meatballs but were a little dry... the crust is kinda thin crispy and chewy at the same time.", "rating": 3, "date": "2017-03-22"}], "hawaiian classic pizza": [], "figgy piggy pizza": [], "spicy bbq chicken pizza": [], "chicken pesto pizza": [{"excerpts": ["We decided to get a whole pizza to share, the chicken pesto pizza and let me tell you.. YUM! ", "It was hot and cheesy and very flavorful. "], "author": "Cheney E.", "review": "Came here a little while back with my sisters on a night out. We were all walking together somewhat late at night and had a craving for some pizza so my sister showed us this place. Soon as we walked in it smelled soooo good! We decided to get a whole pizza to share, the chicken pesto pizza and let me tell you.. YUM! It was hot and cheesy and very flavorful. The crust was good and thick enough to hold it up without being too much. \n\nI'd definitely want to come back and try some of their other pizza specials like the Figgy Piggy and the Potato pesto. These combos are a lot more interesting than I've seen in other pizza spots. Will come back when I'm in the area again!", "rating": 4, "date": "2018-01-26"}, {"excerpts": ["Got a slice of chicken pesto pizza with tomatoes for little over $4. ", "Toppings tasted like it could have used some garlic. ", "Crust I didn't care for. ", "Crisp yes. ", "Thin yes. ", "But tasty? ", "No. ", "I attempted to eat the crust and to try to pick out the flavor. ", "Didnt taste like much and I tossed it on my walk home."], "author": "Kimberly C.", "review": "I've had better.  Even when I was hungry I ate this and still thought it was mediocre. Got a slice of chicken pesto pizza with tomatoes for little over $4. Toppings tasted like it could have used some garlic. Crust I didn't care for. Crisp yes. Thin yes. But tasty? No. I attempted to eat the crust and to try to pick out the flavor. Didnt taste like much and I tossed it on my walk home.", "rating": 2, "date": "2014-10-23"}], "beers best friend pizza": [], "clams heaven pizza": [], "la coste pizza": [], "camel toe pizza": [{"excerpts": ["The Camel Toe pizza was spectacular and I also had a slice of Carnivores Delight as a back up. ", "Those were two of the best slices of pizza I've ever had. ", "We went in on a Saturday night close to dinner time and the wait was minimal for pie slices."], "author": "Rocio R.", "review": "The pizza will not disappoint! I never thought I'd be eating camel as a pizza topping, but there's a first time for everything! The Camel Toe pizza was spectacular and I also had a slice of Carnivores Delight as a back up. Those were two of the best slices of pizza I've ever had. We went in on a Saturday night close to dinner time and the wait was minimal for pie slices.", "rating": 5, "date": "2017-01-31"}], "ostrich the bitch pizza": [], "meat combo pizza": [], "cheese pizza": [{"excerpts": ["Plain ol' cheese pizza!!  ", "Can't beat the classics!!!"], "author": "Amy L.", "review": "The pizza here is spectacular, the prices are reasonable, and their GLUTEN-FREE pies are fabulous as well!\n\nThey also deliver pizza late at night, which is great for night owls such as myself!  The guys who've delivered are very polite, friendly, and helpful.\n\nThe restaurant itself is WHEELCHAIR-ACCESSIBLE, with indoor and outdoor seating.  There are always at least 5-6 varieties of pizza slices available at any given time, and they are interesting flavors, not just the same old pepperoni or mushroom.  There is a Creole-flavored Alligator pie, Ostrich, too, if you prefer...This is a pizzeria with options!\n\nI ordered their GLUTEN-FREE vegetarian pie, and it was immensely popular amongst my friends.  I also really love getting their meatball and ricotta pie...mmmm!!!\n\nOrdering from them online via Eat24hrs makes life incredibly easy, too, for someone like me, who sometimes orders large numbers of pizzas for events, and submits the order a day or two in advance.\n\nAs for me, what's my favorite?  Plain ol' cheese pizza!!  Can't beat the classics!!!", "rating": 5, "date": "2016-03-16"}, {"excerpts": ["really enjoyed the spinach cheese pizza. ", "the flavor of the month pesto potato pizza was creative and tasted pretty good.  ", "I liked my vegetable pizza, they could have more vegetarian options. ", "Pizza was kind of greasy but overall good."], "author": "Michelle K.", "review": "really enjoyed the spinach cheese pizza. the flavor of the month pesto potato pizza was creative and tasted pretty good.  I liked my vegetable pizza, they could have more vegetarian options. Pizza was kind of greasy but overall good.", "rating": 4, "date": "2018-03-28"}, {"excerpts": ["Dislikes:\n-some of the pizzas didn't look the freshest (like the beet and cheese pizza...", "but then again, who wants a beet and cheese pizza?) \n-parking can be a bit difficult to find in this part of town (try going on a weeknight, if you're interested in trying their pizza, or take public transportation)"], "author": "Tracy T.", "review": "Stumbled upon this place while looking bite to eat, and was pleasantly surprised. Being from the east coast, I'm always wary of pizza places in this city because I've been let down too many times already (and always find myself wondering how can you get pizza wrong...but obviously, you can). But this place actually turned out to be okay. I really liked the eclectic type of pizzas they have. I ended up with a pesto pizza with sliced potatoes and garlic. It was really delicious and wish I would have gotten another slice. There was a line but it seemed to go pretty fast as well (so you're in and out in a jiffy. But please note it takes a little longer for an entire pie). Definitely a must if you happen to be in the Castro district and looking for a quick bite to eat.\n\nLikes:\n-overall good pizza \n-variety of eclectic pizza options\n-fast service \n-inexpensive ($5/slice)\n\nDislikes:\n-some of the pizzas didn't look the freshest (like the beet and cheese pizza...but then again, who wants a beet and cheese pizza?) \n-parking can be a bit difficult to find in this part of town (try going on a weeknight, if you're interested in trying their pizza, or take public transportation)", "rating": 4, "date": "2015-10-31"}, {"excerpts": ["I ordered a slice of cheese pizza today from Oz.  ", "It was a good sized piece of pizza.  ", "I also appreciated the fact that they added lemon to their ice water dispenser.\n", "Service was fine.  ", "The pizza was thin and crispy ", "but I thought the sauce didn't have much flavor.\n", "I paid $3.50."], "author": "Thomas D.", "review": "I ordered a slice of cheese pizza today from Oz.  It was a good sized piece of pizza.  I also appreciated the fact that they added lemon to their ice water dispenser.\nService was fine.  The pizza was thin and crispy but I thought the sauce didn't have much flavor.\nI paid $3.50.", "rating": 3, "date": "2014-10-11"}, {"excerpts": ["I love their pizzas specially cheese pizza delicious \nClean restaurant"], "author": "Mohammad Z.", "review": "I've been coming here for a few months I love their pizzas specially cheese pizza delicious \nClean restaurant", "rating": 4, "date": "2015-05-10"}], "pestolicius pizza": [], "classic margherita pizza": [], "my grandma loves me pizza": [], "aspendos pizza": [], "olimpos pizza": [], "potato pesto pizza": [{"excerpts": ["They have the BEST \"potato pesto pizza\" omg ", "it's amazing! ", "It comes with pesto sauce, potato slices, and roasted garlic on top! ", "(The garlic really makes it delish) ", "The portions are huge! ", "I ordered the potato pesto pizza for an event I had and everyone loved it!!! ", "I ordered a day in advance and they even text me when the pizza was ready. ", "Great service!!!"], "author": "Justin K.", "review": "They have the BEST \"potato pesto pizza\" omg it's amazing! It comes with pesto sauce, potato slices, and roasted garlic on top! (The garlic really makes it delish) The portions are huge! I ordered the potato pesto pizza for an event I had and everyone loved it!!! I ordered a day in advance and they even text me when the pizza was ready. Great service!!!", "rating": 5, "date": "2016-08-07"}], "pizza caprese": [], "ben  jerrys ice cream": [], "chocolate covered bacon": [], "macaroon ice cream sandwich": [], "oz side ranch dressing": [], "oz side bleu cheese dressing": [], "oz side tomato sauce": [], "oz side pesto sauce": [], "oz side hot wing sauce": []}