{"crab louie": [{"excerpts": ["But it was served with my choice of Crab Louie or Cesar salad.  ", "And I LOVE Crab Louie salad, and this was pretty delicious.. so 5 stars for salad, 2 stars for ahi, and 4 stars for free wine! ", "My dream come true."], "author": "Christina P.", "review": "I enjoyed eating here, or maybe it was all the wine I consumed.  \n\nI must confess, I was incredibly underwhelmed by the seared Ahi I ordered.  It was almost medium well.. sacrilegious in my eyes, I probably would have sent it back if I wasn't so hungry.   But it was served with my choice of Crab Louie or Cesar salad.  And I LOVE Crab Louie salad, and this was pretty delicious.. so 5 stars for salad, 2 stars for ahi, and 4 stars for free wine! My dream come true.", "rating": 4, "date": "2014-08-20"}, {"excerpts": ["My favorites are the halibut parmesan, the crab Louie (sweet, fresh, gorgeous crab, not local), the clam chowder, the petrale and the Mitchell's ice cream for dessert (another SF tradition). ", "Yes, the free barrel wine while you wait is great and builds a friendly scene, especially on a foggy weekend when the wait may be a bit longer than you hoped. "], "author": "Chris K.", "review": "This place is the perfect neighborhood fish restaurant. Great food, friendly scene, great tradition. My favorites are the halibut parmesan, the crab Louie (sweet, fresh, gorgeous crab, not local), the clam chowder, the petrale and the Mitchell's ice cream for dessert (another SF tradition). Yes, the free barrel wine while you wait is great and builds a friendly scene, especially on a foggy weekend when the wait may be a bit longer than you hoped. But once you're seated, the baskets of great sourdough keep arriving at your table, a very nice salad or soup is included with the meal, and you then enjoy a nice plate of fresh fish (or scallops, or abalone or whatever pops out at you from the specials board). Frank and Roy and Maureen and the other long time staff are friendly, informed and attentive. One of my favorite SF spots any day of the week.", "rating": 5, "date": "2015-11-22"}, {"excerpts": ["Crab Louie  -  $24.00 - beautiful & tasty & GIANT\n\n"], "author": "Matsuo U.", "review": "Dinner for 4, got there a few minutes after they opened (5:00PM) and most of the place was filled. No reservations accepted... I tried. \nSeated right away by a courteous greeter, the service by the waitress was efficient and attentive.  Definitely not a hipster joint, but a long lasting restaurant that is consistent & good. \n\nAt our table (of course I talked everyone out of a bite - and two in one instance). Nothing really exotic (they did have abalone on the menu)  well prepared, tasty & nicely presented dishes:\n\nSalmon & Prawns Combo  -  $23.75 - Nice  \"combo\" of fresh seafood flavors.\n\nFilet of Sole Newburg  -  $21.37 - a baked delight (kinda an old-school dish) - very nicely prepared ... not a drop of the sauce was left on the plate.\n\nCrab Louie  -  $24.00 - beautiful & tasty & GIANT\n\nSnapper Spicy  -  $18.98 - kinda not that spicy if your into the XXX of spicyness (probably not a real word) but tender & tasty.\n\nAccompanying soups /salad / fries rate a \"good\" comment. \n\nJust down the road ( 5 minute walk ) from the Legion of Honor museum, so after nourishing your eyes & mind with beauty at \"The Legion\", delight your taste buds and fill your belly at Pacific Cafe. \n\nhttp://legionofhonor.famsf.org/legion/exhibitions", "rating": 4, "date": "2011-10-09"}, {"excerpts": ["Recommend the parmesan crusted halibut and the crab louie when in season.  ", "Dressing on the side please!"], "author": "Julienne G.", "review": "Ditto Tim V.'s review.  This place is very old school and you *always* wait for a table so there is ample time to suck down the vino. \n\nI have many fond memories of going there with my two favorite Uncles.  Invariably, one Uncle and I will get pretty close to soused on the free wine while we wait - then the smack talk starts.  The other Uncle sips coffee and laughs at our sorry asses.  Good times my friend, good times. \n\nDon't fill up on the delicious sourdough bread though- it's good but you'll need room for some tasty fishes. Recommend the parmesan crusted halibut and the crab louie when in season.  Dressing on the side please!", "rating": 5, "date": "2007-01-23"}, {"excerpts": ["Crab Louie for me, Mussels for one, and Prawns for the other. ", "Crab Louie was OK - not sure why they have to have giant, 3 inch diameter slices of cucumber and tomatoes that require me to work so hard. ", "Prawns were OK, nothing special. ", "The mussels, however, were super dry with almost no broth. ", "Throughout our meal, the wait staff was attentive and very polite, I had not problems there. "], "author": "Cherry P.", "review": "I've been looking for seafood in the Richmond so what a surprise it was to see Pacific Cafe pop up on yelp, and mere minutes from home. \n\nWHAT A DISAPPOINTMENT!\n\nFirst of all, the \"free\" wine? It's not free. The prices for the food more than covers off on that. Let me drill down into the specifics of this crime scene. The place has been around forever, since the 70s. As such there are plenty of seniors who like to frequent this joint. They get so drunk and happy off the \"free\" wine that they love to tell you what a fabulous place this is on their way out. My party of 3 got spooked when one senior citizen popped out at us from a corner booth to tell us what a great decision we made coming to PC. She drawled on about how she's been coming here since the 80s. Spotting drool on her lower lip, I leaned away from her as a younger relative helped her with a coat.\n\nShaken, but undeterred, we sipped our overflowing glasses of wine. Only after a few sips, the waiter came back out to return our status back to overflowing.  Generous would be an understatement. In total, we only had to wait 30 mins for a table and once we were seated, the ambiance was quit cozy. Unfortunately the moment of comfort was kept brief when one of my guests noticed large white flecks in her water. We requested a new one without a problem, but we stopped sipping our wine after that. \n\nWe ordered the oysters cocktail. Gross. Why would you present oysters chopped up in a glass? Why remove them from their shells only to have shell pieces floating in the oyster juice? Not a good sign.\n\nEntrees arrived. Crab Louie for me, Mussels for one, and Prawns for the other. Crab Louie was OK - not sure why they have to have giant, 3 inch diameter slices of cucumber and tomatoes that require me to work so hard. Prawns were OK, nothing special. The mussels, however, were super dry with almost no broth. Throughout our meal, the wait staff was attentive and very polite, I had not problems there. But there was certainly concern in their eyes and we all detected a tone of suspicion from them due to our untouched glasses of wine. \n\nThat's right, we weren't drunk, and so the food had to stand on it's own. Well let me tell you, it couldn't. \n\nI like to try every place twice just to be sure, but for over $30 per person? No thanks, I'm done with PC. If you want to get drunk for \"free\", and you're over the age of 50 with money to burn, you will love this place.", "rating": 1, "date": "2009-05-19"}, {"excerpts": ["I had a crab louie salad that was effing tasty as well. ", "For the main course I tried the freshest, best-prepared halibut I've ever had!  "], "author": "Valerie N.", "review": "My favorite, cynical gay friend who hates EVERYTHING and NEVER leaves his apartment took me to Pacific Cafe for my birthday. If a hermit who has no intention of getting in your pants offers to take you to dinner, you do not argue!\n\nPacific Cafe was packed. Crotchety old man dropped me off at the door to put our name down (they don't take reservations) and went off to find parking for the next 20 minutes. Fine by me - I enjoyed the free wine offered to waiting patrons. Automatic 3 stars before even being seated (not that they need it!)\n\nThe food was fantastic! We shared the calamari appetizer. I had a crab louie salad that was effing tasty as well. For the main course I tried the freshest, best-prepared halibut I've ever had!  We skipped dessert because we were both SO full (and had our girlish figures to worry about).\n\nAmazing dinner, but the best part of the evening was my birthday gift: massage oil and batteries. Gotta love opening R-rated gifts in front of unsuspecting diners!", "rating": 5, "date": "2007-08-21"}, {"excerpts": ["At first we were talking about whether we should split the crab louie or the baked halibut and as I always ask the waitperson what they recommend I waited till our waitress came over to ask her her opinion. ", "I guess she was having a bad moment because she literally rolled her eyes at me and snapped \"those are 2 very different things\" and would not give me any other answer or suggestion. ", "I thought maybe she was angry that we didn't want the damn wine. ", "We finally decided to split the crab louie and when she came back to take our order and we told her what we wanted she actually snapped at us and said \"that's ALL????", "\" ", "I was taken aback and raised my eyebrows at her. ", "We went ahead and each ordered a cup of their salmon bisque (even though I don't usually eat diary). ", "I think that part of the reason I ordered it was out of fear. ", "I was fearful that the waitress was going to become even angrier and bite me ", "and I was also fearful that perhaps the salad wouldn't be enough. ", "Well I was wrong. ", "The salad was HUGE!!!!!!! ", "I had asked the waitress if it was big enough to split but again, she didn't really give me an answer, she answered my question with another question. ", "I finally gave up. ", "But in a passive/aggressive moment (that I'm not proud of ", "but hey I'm human) ", "I exclaimed when it arrived - \"this is big enough to feed 5 people\" but it really wasn't quite that big. ", "It was perfect for my friend and me ", "and there was even some left over. ", "There was a very very large portion of crab and that crab was delicious. ", "There were sliced eggs and avocado and other delectables. ", "It was probably one of the best crab louies I've ever had - other than at Tadishes. ", "The salmon bisque I thought was pretty good but not fantastic. ", "I would definitely go back for the crab louie and refuse to be intimidated by a waitress in a foul mood."], "author": "Kimberly H.", "review": "I had always wanted to eat here and a few weeks ago I finally got to. Apparently they don't take reservations. My friend and I got there early, around 6pm, and we got a table right away. We also got parking right out front and there were plenty of spaces available on both sides of Geary. This is the outer Richmond so it's not as difficult to park as the inner Richmond. \n\nWe are both light eaters and after looking at the prices we knew we had to split something. I hadn't realized that it was a tad pricey before suggesting it to her. The first thing that was a little disconcerting was that they offered us free wine as soon as we walked in, which was nice but neither of us drink so we declined. Then they offered it to us 3 more times while we were sitting at the table, even adding with surprise \"are you SURE you don't want free wine?\" which I thought was a little over the top since we had declined it repeatedly by then. I had a vision that someone was gonna come over to our table to strong-arm us, push my head back and pour the wine down my throat whether I wanted it or not. I felt that I wasn't being listened to/heard and that my request was not being respected.\n\nAt first we were talking about whether we should split the crab louie or the baked halibut and as I always ask the waitperson what they recommend I waited till our waitress came over to ask her her opinion. I guess she was having a bad moment because she literally rolled her eyes at me and snapped \"those are 2 very different things\" and would not give me any other answer or suggestion. I thought maybe she was angry that we didn't want the damn wine. We finally decided to split the crab louie and when she came back to take our order and we told her what we wanted she actually snapped at us and said \"that's ALL????\" I was taken aback and raised my eyebrows at her. We went ahead and each ordered a cup of their salmon bisque (even though I don't usually eat diary). I think that part of the reason I ordered it was out of fear. I was fearful that the waitress was going to become even angrier and bite me and I was also fearful that perhaps the salad wouldn't be enough. Well I was wrong. The salad was HUGE!!!!!!! I had asked the waitress if it was big enough to split but again, she didn't really give me an answer, she answered my question with another question. I finally gave up. But in a passive/aggressive moment (that I'm not proud of but hey I'm human) I exclaimed when it arrived - \"this is big enough to feed 5 people\" but it really wasn't quite that big. It was perfect for my friend and me and there was even some left over. There was a very very large portion of crab and that crab was delicious. There were sliced eggs and avocado and other delectables. It was probably one of the best crab louies I've ever had - other than at Tadishes. The salmon bisque I thought was pretty good but not fantastic. Mine was hot on the bottom and cold on the top, I had to stir it up for a warmish medley.\n\nAfter a bit our waitress lightened up and was not as cranky though she certainly didn't become someone I'd want to snuggle with on a cold night.\n\nAfter our meal we had some time to kill because we had plans that started a little later. I looked around and saw a huge line of people waiting for seats and I stopped a waitress, not ours, and asked her if we should hurry and leave and she said, \"oh no, please take as much time as you like, you are customers\". I thought that was so amazingly sweet!!! We didn't sit there for long anyway because I hate to keep other people waiting but that waitress really was exceedingly pleasant. \n\nI would definitely go back for the crab louie and refuse to be intimidated by a waitress in a foul mood.", "rating": 3, "date": "2009-10-16"}], "shrimp louie": [{"excerpts": ["all versions are delicious!), shrimp louie salad (packed full of small bay shrimp), ", "sand dabs caught down the CA coast (they'll bone them for you at the table, using just a spoon), and Dungeness crab in season, served whole in a pyrex pie plate, bathed in cayenne-dusted melted butter (a.k.a., \"crab diablo\") - scrumptious!  "], "author": "Paula R.", "review": "This place earns 5 stars in my book for its consistently good food, great service, and fantastic off-the-beaten-path location and old-school neighborhood feel - the restaurant itself looks like it just jumped out of a vintage episode of \"McMillan & Wife\" or \"Streets of San Francisco\" (and this is a GOOD thing!).\n\nIf you want a fancy gourmet meal from a fancy up-n-coming chef, go someplace else.  But if you want a satisfying meal of simply-prepared seafood (much of it fresh-off-the-boat), all the tangy sourdough bread you can eat, and great sides, then this is your place.  The complimentary wine that's happily served to folks who are waiting in line outside for a table in the cozy space doesn't hurt, either!  (We call it \"Sidewalk Wine,\" and we've had some of the most pleasurable conversations with other patrons who are enjoying their Sidewalk Wine while they wait, as well.)\n\nSome of our favorites include the bisque (always made from some type of seafood such as salmon, shrimp, or oysters - all versions are delicious!), shrimp louie salad (packed full of small bay shrimp), sand dabs caught down the CA coast (they'll bone them for you at the table, using just a spoon), and Dungeness crab in season, served whole in a pyrex pie plate, bathed in cayenne-dusted melted butter (a.k.a., \"crab diablo\") - scrumptious!  Though everything is honestly delicious - we've never had a bad meal here.\n\nHighly recommended.", "rating": 5, "date": "2017-07-19"}, {"excerpts": ["Each meal came with either clam chowder or shrimp louie salad, red potatoes, fries, or rice with the main course. \n\n", "The clam chowder and shrimp louie salad was excellent. ", "My main course was so bad I barely touched the plate. ", "My advice is to skip the fish and go for the clam chowder, shrimp louie, and prawn main course."], "author": "Amy C.", "review": "I don't understand the wait for this place. Yes, you get free red/white wine while you wait, but the food I had was sub-par. \n\nIt took a little while for the menus to come because they didn't have enough specials menus, so our table of 5 had to wait for them. When we finally got the specials menus and barely looked at them we were rushed to order. \n\nOur table got the filet of sole newberg, english sole, Parmesan halibut, prawns and scallops. Each meal came with either clam chowder or shrimp louie salad, red potatoes, fries, or rice with the main course. \n\nThe clam chowder and shrimp louie salad was excellent. My main course was so bad I barely touched the plate. I ordered the english sole and it was the fish-est tasting fish I have ever ordered. Enligh sole are flat bottom feeding fish in the ocean and that's exactly how it tasted. Fishy and like dirt/sand. Disgusting. \n\nIf fish is prepared well it shouldn't be fishy or dirt tasting at all. The best of the dishes was the prawns! They tasted exactly like they should. \n\nMy advice is to skip the fish and go for the clam chowder, shrimp louie, and prawn main course.", "rating": 2, "date": "2013-08-07"}, {"excerpts": ["They like the free wine, the shrimp louie, the trout, the bisque, and the pilaf.  ", "I like those things too.  ", "I also like the tacky 70's decor, and the waitstaff.  \n"], "author": "El B.", "review": "I have a thing left over from childhood about sanddabs.  We always had fish on Friday (hellooo, Vatican II?  Not in our house!)  I think sanddabs must have been cheap back then because we had them often.  Which was great with me, because I love them.  \n\nFast forward waay too many years, and there I am at Pacific Cafe, ....and Oh My God, they have FRESH SANDDABS!!!!!  WOW!!!\n\nAnd let me tell you, it's pretty hard to find sanddabs at a fish market, and this is the only restaurant Ive ever been to that had them... They are often on the menu here! They do them well, too.  \n\nOk, so  as established, I'm happy if there are sanddabs.  I call, they say yup, we have 'em, then I drag my family and friends along.  Typically, they are thrilled to come with me.  They like the free wine, the shrimp louie, the trout, the bisque, and the pilaf.  I like those things too.  I also like the tacky 70's decor, and the waitstaff.  \nI don't like the parking, but it's not horrible. \n\nYay  sanddabs!", "rating": 4, "date": "2012-11-03"}, {"excerpts": ["My sole doré was DELICIOUS, and after the shrimp louie salad, included in the meal price, I could only eat half of it. ", "The other 3 in our party were members of the clean plate club so tho ", "I didn't bother to ask anyone else how they liked their fish"], "author": "Gwynnie P.", "review": "Pacific Cafe is certainly very old skool, but if you're a fan of \"how we used to cook seafood\" you'll enjoy it (that is to say they make things like sole doré and newburg), and you can also get more modern interpretations with less rich sauce 'n such. \n\nMy sole doré was DELICIOUS, and after the shrimp louie salad, included in the meal price, I could only eat half of it. The other 3 in our party were members of the clean plate club so tho I didn't bother to ask anyone else how they liked their fish, I think they did!\n\nI appreciate that their desserts - Mitchell's ice cream and Zanze's Cheesecake, are provided by local oldey timey traditional SF purveyors. As it should be. \n\nI know lines here can get long, and I hate waiting in line. So going on a winter Tuesday at 6pm: no line. Still a free glass of white wine tho! Yeah!!", "rating": 4, "date": "2012-03-21"}, {"excerpts": ["My wife had their shrimp louie salad which I tried a bit of and was thoroughly impressed. ", "I went out on a limb and had their New York steak which was incredible- ", "I know...", "it's a Seafood joint ", "so what am I doing ordering steak? ", "This is something I often do ", "and it was worth it. \n", "All in all this place is greta, very cozy, super friendly and had a great vibe. ", "It's always a bit of a wait, but worth it for the food and totally worth it for the wine."], "author": "Jack W.", "review": "SO I'm gonna give this place 4 stars for the food, the ambiance and the service and the 5th star for the free wine you get while waiting for a table. \nThis is a small place, opened in 1974 and totally a friendly neighborhood seafood spot.\nWe showed up at 6 on a Saturday, put in our name - No Reservations accepted- and waited outside, we were brought a legit pour of some Chablis for our wait. This was a great touch. \nThe host came around with refills several times. When we got in after 30 minutes or so we got a great booth table, this place is small so it gets cozy. We had a great server - Larry who has been there forever. Fresh bread and amazing butter on the table we ordered their house red which was pretty good- great for the price.\nI had their clam chowder which was less creamy than I expected but very good. My wife had their shrimp louie salad which I tried a bit of and was thoroughly impressed. I went out on a limb and had their New York steak which was incredible- I know...it's a Seafood joint so what am I doing ordering steak? This is something I often do and it was worth it. \nAll in all this place is greta, very cozy, super friendly and had a great vibe. It's always a bit of a wait, but worth it for the food and totally worth it for the wine.", "rating": 5, "date": "2015-10-29"}, {"excerpts": ["Meals come with your choice of soup or two different salads (Ceaser or shrimp louie, I always choose the shrimp), and a side dish (various types of potatoes, rice or vegi).\n\n"], "author": "Jacquie H.", "review": "We have been going here for over 30 years, it is our \"go to\" seafood place when in San Francisco as it is a neighborhood gem!  \n\nThis is a small and rustic place.  To get seated for a 5 pm dinner expect to arrive at 4:30 pm and wait (you will get a free glass of wine), or arrive after 6 pm.   On the weekends you might want to arrive even earlier then 4:30 to make sure you get seated for 5 pm.  \n\nNice, cozy booths await you inside, your table will have amazing sourdough and butter all ready for you, and service is fast and attentive.\n\nMeals come with your choice of soup or two different salads (Ceaser or shrimp louie, I always choose the shrimp), and a side dish (various types of potatoes, rice or vegi).\n\nEverything here is just perfect, last night I ordered the Crab Cakes and was in heaven.  Crab cakes were tender, not greasy, slightly cruchy and melt in your mouth perfect.\n\nHusband ordered the Petrale Sole Newburg, his go to dish here.\n\nParking can be a challenge, if you have guests who cannot walk far drop them off and start looking for a place to park (there is no parking lot for Pacific Cafe).\n\nAfter dinner you are right near Ocean beach for a nice walk!  Or before you stop in visit the Legion of Honor which is right up the street, or even take in a few of the sights in the presidio, whatever you do before, or after, Pacific Cafe will be the highlight of your visit.", "rating": 5, "date": "2016-02-11"}, {"excerpts": ["The bread while you wait is amazing, free wine, the shrimp Louie that comes with your meal, just great. ", "I have nothing but great things to say about Pacific Cafe. ", "Old school atmosphere, a lot of locals, and very friendly service."], "author": "Jackie S.", "review": "I have been to Pacific Cafe 3 different times and have fell in love each time. I told myself I'd try something new every time I went because everything on the menu is amazing. You cannot go wrong with this place. Fresh seafood, wide selection of different fish, crab, shrimp. Snapper with crab in parchment was creamy and delicious, Halibut was juicy and fresh, and the Parmesan Halibut was just perfectly seasoned and cooked to perfection. The bread while you wait is amazing, free wine, the shrimp Louie that comes with your meal, just great. I have nothing but great things to say about Pacific Cafe. Old school atmosphere, a lot of locals, and very friendly service.", "rating": 5, "date": "2014-09-22"}, {"excerpts": ["The clam chowder and shrimp louie salad were both amazing. ", "They serve Mitchell's ice cream for dessert. ", "The pear sorbet was some of the best I've ever had. "], "author": "Kari G.", "review": "How can you not love a place that brings you free wine while you wait?!? This place is hopin, so be prepared to wait but it's well worth it. There is a huge board with all of the specials. I was drawn in my all of the signs and articles posted about their award winning crab cakes, so that's what I ordered. My boyfriend got the Parmesan halibut, and our friends got the ahi tuna with wasabi butter, and seared scallops. Everything was so fresh and absolutely delicious. I was really happy with my crab cakes. The next day I was ready to go back for some more. Dinner is a little pricey, but with the free wine, bread, soup or salad, and choice of side its really a good deal.  The clam chowder and shrimp louie salad were both amazing. They serve Mitchell's ice cream for dessert. The pear sorbet was some of the best I've ever had. It was so sweet and refreshing.\n\nThe restaurant itself is a little older, but really cute. It has big fun lights and is right on the corner. Our server was amazing. We never had an empty glass and food came very quickly. I will definitely be back!", "rating": 4, "date": "2013-01-27"}, {"excerpts": ["My shrimp louie salad was disgusting. ", "It was thousand island and bay ", "shrimp over dried lettuce (brown edges and all). ", "All three fish dishes (other than the dry fish and chips) were mediocre. ", "I could do better with some salt, butter and a pan. "], "author": "C K.", "review": "Never EVER ever again.\n\nFirst, bad value. The waitress encouraged us to order fish and chips, off the menu since we had three kids with us. I said, what fish would you recommend? She answered, Halibut is really the only decent option. So we did. They charged us $26 PER order. We ordered two... so we spent $52 + tip + tax for just the kids' super dry fish and chips that nobody enjoyed. It's our fault for not asking the price, but she said it was what most kids ordered so we were expecting kid-friendly prices. This was in addition to our regular meal of seafood, which was regularly priced and regularly  cooked. I don't understand how this place gets the $$ rating. You hear about review fraud, and this place makes me wonder... we left feeling totally duped. \n\nSecond, the place was super cramped and GERIATRIC. With kids, you end up eating dinner at 5:30 and the place was packed with people that were in their 70s-80s. That should give you a good idea for what you're getting. I typically love traditional restaurants that are throwbacks to a bygone era, but this vibe was not nostalgic-- it was staid and smelled like old people that took forever in their one bathroom. \n\nOh yes, that brings me to my next point, the bathroom... Let me take a deep breath here. If you need to go to this restaurant for any reason, GO POTTY BEFORE YOU EAT HERE. It is not even a quarter bath. It's like a 1/8 bath. I don't like to touch many things in a filthy public bath, but you can't help rubbing yourself all over the place because just to turn around and flush means that you're bumping up against the sink. Forget about having to take a toddler. Nuff said. Let your imagination fill in with Trainspotting clips here...\n\nMost importantly, the food was subpar. My shrimp louie salad was disgusting. It was thousand island and bay shrimp over dried lettuce (brown edges and all). All three fish dishes (other than the dry fish and chips) were mediocre. I could do better with some salt, butter and a pan. The only thing I ate was the clam chowder (it had a nice kick). \n\nAside, the free wine was really bad. It was sour and smelled weird. I wouldn't waste the calories on it.", "rating": 1, "date": "2013-10-09"}, {"excerpts": ["The Shrimp Louie dressing was soooo good. ", "Tangy and simple.\n"], "author": "Cahde H.", "review": "I'll start off by stating the obvious: Free wine. At any other restaurant in the world you hope there is no line, but here... the longer the line the more free wine. Genius. \n\nFor the food itself, we got the crab cakes for an appetizer as various other reviews suggested. They were amazing. Definitely the best I have had in quite some time. They come with a remoulade sauce or something, but really they don't need it. Every main course comes with three options for a side. We both got potatoes and they were what you would expect out of a red potato. I think it is pretty smart to have only these basic (always good) sides as it lets the cooks focus on each order of seafood that comes in. \nMy wife got the Spicy Snapper with a side salad. I was a bit envious honestly. It was one of the cheaper items, but oh so good. The Cajun spices were perfect, not heavy handed and it was cooked perfectly. The Shrimp Louie dressing was soooo good. Tangy and simple.\nI got the Abalone because I had never had it before. It was the most expensive item and the server (to his wonderful credit) made sure I knew I was about to pay a lot for a relatively small portion of food. It was delicious, and I am glad to have tried it, but when we go back I will be looking forward to getting a cheaper item that is equally delicious with a bigger portion. I gotta emphasize though, it was so tender and good. Fans of abalone will not be disappointed at all. They clearly put effort into this one.\n\nThe service was perfect. Everyone seems so genuine. No on is trying to sell to you, they know their shit, and they are very helpful and attentive. The host is on top of his game with the free wine. He even went outside to make sure anyone in the cold had some too. The beer selection was a bit lacking, but they got a few locals. I am not a big fan of wine, but my wife loved their selection and the Chardonnay she got.", "rating": 5, "date": "2013-02-10"}, {"excerpts": ["They also tried a shrimp louie...", "I didn't taste it, but it looked good. ", "The serving sizes were generous and commensurate with the price you're going to pay. ", "That being said, even though you're on the outskirts of the downtown San Francisco area, you're still in SanFran...so prices are moderate. ", "But again, the portion size is large and hearty. ", "For me, it was too good not to finish my plate...however, a couple of my friends took some of their dinner home - doggie style! ", "I like eating seafood and my meal was definitely one of the best I've ever had. ", "Next time I'm in this area, I'll definitely return. ", "If anyone is just visiting from somewhere far away...and don't think they'll be back in a very long time, I strongly suggest you have one of your dinner nights here. ", "You'll be glad you did. ", "Yeah, I'm just a random reviewer...", "don't believe me, then consider this...they were considered one of the \"2013 Best of San Francisco\" restaurants. ", "Sorry, they only do dinner and don't take reservations."], "author": "Terry K.", "review": "Attended Fleet Week and was taken to this seafood restaurant by a friend that has been coming to this place since the first day it opened in 1974! We got there for the first seating which starts at 5PM...that means we got there a little after 4PM. Within a few minutes, there were a half dozen others now waiting. By the time they started seating everyone, there were at least 20 people waiting to be seated. Visit their web page at www.pacificcafesf.com to see a picture of people waiting outside for the first seating. This is a small place with only 15 or 16 tables (some tables only for two). About 15 minutes before we were seated, they indeed served us free wine while we waited.\n\nThey provide sourdough bread while you wait for your meal. I ordered the Petrale Sole with rice. My meal was very, very tasty. My friends ordered the Parmesan crusted Halibut...who gave me a taste...bingo, another great tasting prep. They also tried a shrimp louie...I didn't taste it, but it looked good. The serving sizes were generous and commensurate with the price you're going to pay. That being said, even though you're on the outskirts of the downtown San Francisco area, you're still in SanFran...so prices are moderate. But again, the portion size is large and hearty. For me, it was too good not to finish my plate...however, a couple of my friends took some of their dinner home - doggie style! I like eating seafood and my meal was definitely one of the best I've ever had. Next time I'm in this area, I'll definitely return. If anyone is just visiting from somewhere far away...and don't think they'll be back in a very long time, I strongly suggest you have one of your dinner nights here. You'll be glad you did. Yeah, I'm just a random reviewer...don't believe me, then consider this...they were considered one of the \"2013 Best of San Francisco\" restaurants. Sorry, they only do dinner and don't take reservations.", "rating": 5, "date": "2014-10-15"}, {"excerpts": ["The food is phenomenal, starting with the ubiquitous sourdough bread and Pacific Cafe's delectable Shrimp Louie.  ", "Amongst the four of us, we shared the crab cakes (tons of crab, little filler), fried scallops (great way to prepare scallops), spicy snapper, and Parmesan crusted petrale sole. "], "author": "Justin M.", "review": "There is a distinctive charm to Pacific Cafe that can only be found in an old San Francisco fish house.  It is true that you are provided with complimentary wine as you wait (even if you are outside) and they pour with a heavy hand.  Yes, you will probably have to wait for a table, but under these circumstances, why complain?\n\nThe food is phenomenal, starting with the ubiquitous sourdough bread and Pacific Cafe's delectable Shrimp Louie.  Amongst the four of us, we shared the crab cakes (tons of crab, little filler), fried scallops (great way to prepare scallops), spicy snapper, and Parmesan crusted petrale sole. I give this place five starts because  I would order each one of these dishes again.\n\nThere's not much to add to what has already been said here.  This is an old school restaurant that excels at serving fresh, exquisitely prepared seafood.  That they care enough to provide gratis wine as you wait for a table is evidence to me that Pacific Cafe values your patronage.", "rating": 5, "date": "2011-05-23"}, {"excerpts": ["The shrimp Louie salad was ok. ", "I picked out the shrimp pieces and tried to eat the romaine leaves that weren't drenched in dressing. ", "Half of the salad was untouched. ", "The bread was also  very good. ", "It was waiting for us at the table and covered with a towel, but to our disappointment it was cold. ", "We wondered if they got the bread from Azemendi bakery and joked around that it's probably just Boudin bread. "], "author": "Rosalind S.", "review": "This was my 2nd or 3rd time here last night and my gf and I strolled in around 6pm for an early dinner. As we guessed, the place was filled with seniors and a handful of younger folks. \n\nThe menu is pretty simple, pick an entree and you get a choice of soup or salad and  rice, red potatoes or French fries.  Don't forget to look up at the board for specials. It is more extensive then their printed menu. I got the  Petrole Sole and Oh boy was it greasy!!  The butter it was cooked in overwhelmed the fish completely. I ate half of the fries and barely made it through one of the two sole fillets. The shrimp Louie salad was ok. I picked out the shrimp pieces and tried to eat the romaine leaves that weren't drenched in dressing. Half of the salad was untouched. The bread was also  very good. It was waiting for us at the table and covered with a towel, but to our disappointment it was cold. We wondered if they got the bread from Azemendi bakery and joked around that it's probably just Boudin bread. We asked the waitress and yes, they do get their bread from Boudin, haha. \n\nI tried a bite of my gfs dish (Filet of Sole Newburg ), which was baked in a little casserole dish. Omg, they looove butter here. Super rich and almost too rich to eat. She made it through half her fish and pushed it away. Some of it looked raw still but we weren't sure. \n\nOverall, the glass of complimentary wine upon being seated was nice. We didn't need more after that. There wasn't a wait at 6pm also. The waitress was super nice and cheery. But the food is diner style at best.  They've probably made it this far because its one of the only food options this far out in the Richmond district.", "rating": 3, "date": "2010-11-19"}, {"excerpts": ["The shrimp louie salad looked gross - I did not taste it. ", "The clam chowder was disgraceful. "], "author": "Chase S.", "review": "Several friends recommended Pacific Cafe for my birthday - I'm not asking for recommendations from them anymore. \n\nYou will wait for a while for a table and yes they do bring you free white wine but its nothing special. I think they want to kill your taste buds with booze because the food, for the most part, was sub-par. \n\nDrinks: weak ass selection of wines. Not sure if they let you bring your own with corkage. \n\nAppetizers: The crab cocktail was overly chilled and did not resemble any of the pics on here. Mostly shredded crab with only a few tiny solid pieces. The cocktail sauce was horrible. No one used it. The caesar salad was weak. The dressing was watery and forgettable. The shrimp louie salad looked gross - I did not taste it. The clam chowder was disgraceful. The bread was the best part of the meal.\n\nEntrees: the grilled halibut was overcooked, ahi tuna was acceptable, and the crab cakes were very good although they had a touch too many chives.\n\nSides: rice was gross, french fries were inedible, red potatoes came out as 3 boiled plain potatoes. Not cut up, not seasoned, no butter, nada. WTF? Am I in prison? \n\nDessert - ordered the chocolate mouse torte b/c it was my birthday. I'm glad they comped it because I ate 2 bites and could not bear anymore. It was so weak. \n\nService - efficient but not friendly. \n\nBathroom - disgusting. I actually held it and went at the bar we were headed to instead. \n\nCost = I didn't pay b/c it was my b-day but I believe our bill was just over $200. Entrees run about $22-26.\n\nI won't go back.\n\npeace, love, and good booze ~ chase", "rating": 2, "date": "2009-09-01"}, {"excerpts": ["The clam chowder here is to die for, and the shrimp louie salad is amazing. ", "Don't forget to check out the board, to see what the specials of the day are."], "author": "Mars F.", "review": "Best customer service here. The staff here gives you wine while you wait to be seated. Everything about this place is great. The clam chowder here is to die for, and the shrimp louie salad is amazing. Don't forget to check out the board, to see what the specials of the day are.", "rating": 4, "date": "2013-02-25"}, {"excerpts": ["As for the appetizers, we had the Shrimp Louie salad, the Caesar salad, the clam chowder and their crab bisque, which was the special for the night. ", "As an anti-fan of creamy soups, I ditched the bisque in favor of the clam chowder, which had no cream in it. "], "author": "Tori S.", "review": "One of my student's dad was always giving me crap for having never been here, because I live less than 2 blocks down the street. Until he mentioned it and looked it up on his iPhone to show me a picture of the street view, I'd never even seen or heard of this tiny, hidden gem of the Richmond district.\n\nSo, after making a list of restaurants we wanted to try, my coworker and I decided to bring our girlfriends along for a \"show and tell\" of friends and try Pacific Cafe, since all of us live in the Richmond. We'd heard that they doled out free wine while waiting, so we set a time to meet up - 7 pm on a Sunday night.\n\nAt first we were told that it was a 45 minute wait, so we took our wine and stood outside, feeling somewhat like yuppies (well, I guess we all are yuppies in a sense). Thirty minutes passed. We looked at the wait list, and there were still about 7 names ahead of us. More wine. Another thirty minutes passed. 4 names ahead of us. Finally, we were seated after about an hour and a half.\n\nNormally, anywhere else I wouldn't have waited more than 30 minutes. However, Pacific Cafe was such a great place; the ambiance was very warm and cozy, and the people (other customers and the wait staff) were all very friendly (maybe it's the wine?). My girlfriends and I decided to order 4 different dishes with all different sides and appetizers, so we could all try everything out.\n\nWe ended up ordering:\n\n- the rainbow trout with fries, which were basically a quarter wedge of a potato. The fish was absolutely delicious; we didn't squeeze the lemon on top (oops) but there was a lump of butter in the middle, which we spread over the fish.\n\n- the sole, with a mushroom and caper sauce, served with rice pilaf. This was also delicious, although I wasn't a fan of the sauce. I like my fish very plain, so I can taste the actual meat of the fish itself. The rice was excellent though, and I'm convinced I'll never be able to do the Atkins' diet.\n\n- the ahi tuna, seared on the outside and served rare on the inside, with a side of wasabi mayo. This was probably my favorite, because the tuna was very, very tender and the wasabi mayo went so perfectly with it.\n\n- the red snapper, which was seasoned on both sides with a spicy mix of ..well.. spices. This fish had the most flavor on its own because of the way it was seasoned, and the meat was also very tender.\n\nAs for the appetizers, we had the Shrimp Louie salad, the Caesar salad, the clam chowder and their crab bisque, which was the special for the night. As an anti-fan of creamy soups, I ditched the bisque in favor of the clam chowder, which had no cream in it. It was the first time I'd tried a non-cream-based clam chowder, and it was absolutely delicious because the seafood taste wasn't overpowered by the cream.\n\nWe couldn't fit in dessert, but there's always next time, right?", "rating": 5, "date": "2009-01-21"}, {"excerpts": ["The salads are crisp and fresh (go for the shrimp louie) and the fish... omg. \n", "The chalkboard always has specials that get erased as they run out, but never fear; the standard menu is full of tasty treats too. ", "I'm a huge fan of the sole nuremberg (which I'm pretty sure I've spelled wrong.) ", "It's sole stuffed with crab and baked in this cheesy cream sauce. ", "Just thinking about it makes me hungry. ", "The spicy snapper is also amazing. ", "Hell, it's all amazing. ", "AND the staff is friendly and patient and not at all pushy (happy to let you linger even if they have a line waiting for your table). \n", "It really doesn't get much better."], "author": "Valerie G.", "review": "Anytime we're driving down Geary around dinnertime and see that there is no line here, we find parking as quickly as possible and get our name on the list. \nOnce that is accomplished we're handed a free glass of wine to enjoy while we wait. (if there is a line and you have to wait for awhile, your glass gets refilled) That alone is worth several stars. I mean, they don't have to do that- the place is so popular and so good there would be a line out the door anyway- but they're awesome, so they do. \n\nNow, let's talk seafood. \nIt's good. Like, really good. The bisques and chowders are always rich and heavenly. The salads are crisp and fresh (go for the shrimp louie) and the fish... omg. \nThe chalkboard always has specials that get erased as they run out, but never fear; the standard menu is full of tasty treats too. I'm a huge fan of the sole nuremberg (which I'm pretty sure I've spelled wrong.) It's sole stuffed with crab and baked in this cheesy cream sauce. Just thinking about it makes me hungry. The spicy snapper is also amazing. Hell, it's all amazing. AND the staff is friendly and patient and not at all pushy (happy to let you linger even if they have a line waiting for your table). \nIt really doesn't get much better.", "rating": 5, "date": "2010-05-18"}, {"excerpts": ["It came with a \"shrimp louie\" salad that consisted of a handful of shrimp drowned in what looked like a cup of thousand island dressing on a bed of iceberg lettuce. ", "When the scampi came, I was really disappointed.  ", "It was about a dozen medium size prawns and some mushy overcooked bits of tomato swimming in a ramekin of yellow oil.  ", "It didn't taste like butter, it didn't taste like white wine, it was indefinable.  ", "And it was $24!  "], "author": "Kim M.", "review": "I really wanted to like this place.  I'd been there years ago and had a good memory of it.  We decided to go this evening when we found ourselves looking for a place to celebrate my husband's birthday.\n\nFirst, the pluses.  The staff is really nice.  Free jug wine while you wait.  Friendly service.  Even the customers waiting tables were friendly and chatty.  The room is warm & comfy, a nice neighborhood place.\n\nThen, the food... I ordered prawns scampi.  It came with a \"shrimp louie\" salad that consisted of a handful of shrimp drowned in what looked like a cup of thousand island dressing on a bed of iceberg lettuce. When the scampi came, I was really disappointed.  It was about a dozen medium size prawns and some mushy overcooked bits of tomato swimming in a ramekin of yellow oil.  It didn't taste like butter, it didn't taste like white wine, it was indefinable.  And it was $24!  We were having a great time otherwise, and I didn't want to spoil the mood, so I ate the prawns.\n\nWhen I asked my husband about it later, he said he was also disappointed in his dish, the special combo (salmon and mussels, also about $24).  For four people, this was an expensive evening, and we both felt sick to our stomachs afterword. I would not go back.", "rating": 2, "date": "2009-03-30"}, {"excerpts": ["Calamari vinaigrette is refreshing, the oyster bisque I had was a delicious and compact A-bomb of a meal in itself, and the shrimp louie I tasted was almost as rewarding (but I guarantee you won't like it if you're turned off by salad greens swimming in dressing).\n\n"], "author": "Alfonso E.", "review": "With most entrees listed in the $20 to $25 range, it will never qualify as a \"deal\", but the value you get here is consistently good quality seafood prepared in a way that makes the core ingredient the hero.  No fancy preparations to hide imperfections of the fish, but that's not to say some of the dishes can be rich.  Take, for instance the Turbot baked in parchment with crab and shrimp, or the top of their standard entree list, Sole stuffed with curried crab and shrimp in Newburg sauce.  Has it invoked a Pavolvian response from you yet?\n\nThe specials make it even more difficult to choose an entree as there typically are even more selections from THAT board then there are on the menu itself.  And they're all so tempting too (such as a combo plate of grilled wild salmon and scallops you could have either baked or fried).  Shoot me.\n\nYou can also choose your entree accompaniment:  rice, potato or veggie.  Pick the red potatoes and you'll get boiled potato -- I say go for the rice instead, or a veggie (you just might get a whole broccoli crown on your plate).\n\nAppetizers?  Calamari vinaigrette is refreshing, the oyster bisque I had was a delicious and compact A-bomb of a meal in itself, and the shrimp louie I tasted was almost as rewarding (but I guarantee you won't like it if you're turned off by salad greens swimming in dressing).\n\nDessert?  You probably won't have any room left unless you save part of your entree in a to-go bag.\n\nEverybody likes to comment on the free wine they pour for people waiting to dine.  What an effective ploy, I say -- the wine is remarkably bad and gave me a headache, but I say kudos to them for upholding some basic customer satisfaction principle.  But I say dine early or late, and you'll avoid the wait.", "rating": 4, "date": "2006-10-16"}, {"excerpts": ["Over the years I have tried the fried oysters, shrimp louie salad, oyster bisque, lobster bisque, salmon bisque, sand dabs,ahi, salmon, halibut,  fish in parchment paper, and virtually everything else. ", "I have never disliked anything.\n   ", "The decor is vintage, but that is what makes this place unique to me, that it has been very succesful for so many years and hasn't really changed at all. ", "We loooove the and always request for Frank to be our server. ", "He is THE best server in SF, in my opinion!"], "author": "Kay A.", "review": "Looove Pacific Cafe!!! I have been coming here for year's and even before that my husband's family had been coming for almost 30 years. It is a great \"local\" place. Kind of off the beaten path, and from the street you could easily pass right by it. But it is wonderful. They are only open for dinner nightly, and often have a wait (which isn't bad because they give you free wine while you are waiting). They do not accept reservations, but that's not so bad when you are getting free wine while you wait. Their menu is awesome and changes daily, to include fresh, local seafood. Over the years I have tried the fried oysters, shrimp louie salad, oyster bisque, lobster bisque, salmon bisque, sand dabs,ahi, salmon, halibut,  fish in parchment paper, and virtually everything else. I have never disliked anything.\n   The decor is vintage, but that is what makes this place unique to me, that it has been very succesful for so many years and hasn't really changed at all. We loooove the and always request for Frank to be our server. He is THE best server in SF, in my opinion!", "rating": 4, "date": "2011-10-20"}, {"excerpts": ["The shrimp Louie is EXCELLENT, and although it's worth the wait ", "and as you wait you also get FREE house wine!! ", "This place was also established in 1975 when I was born!!! ", "They don't take RSVP's but just go ", "wait enjoy the wine and food, you'll keep coming back!!!!"], "author": "christina a.", "review": "The Pacific Café is the bomb!! I haven't been here in about 10 years, but I use to go all the time!! The shrimp Louie is EXCELLENT, and although it's worth the wait and as you wait you also get FREE house wine!! This place was also established in 1975 when I was born!!! They don't take RSVP's but just go wait enjoy the wine and food, you'll keep coming back!!!!", "rating": 5, "date": "2011-03-15"}, {"excerpts": ["and I really like the shrimp Louie salad.  \r\n\r\n", "To a palate accustomed to medium-rare salmon, dusted with Moroccan spices and served served with kumquat jam and couscous, the preparations can seem barebones, almost bland.  ", "I really enjoy the simplicity of such a, well, retro expierance.  ", "It's seafood made comfort food, and it tastes like modern American history."], "author": "Martha S.", "review": "I'd call Pacific Cafe retro except that implies an intentional effort to be old school.  This restaurant is simply unchanged, so the decor and menu are entirely authentic.  The free wine makes the inevitable wait for a table in this tiny restaurant much more palatable.  The service isn't fancy and the preparations aren't elaborate, but the fish is fresh and tasty.  \r\n\r\nIn addition to a small regular menu (featuring my grandmother's favorite Fillet of Sole Newburg) there are extensive specials, organized by whether they are grilled, sauteed and fried.  The bay shrimp cocktail is sweet and succulent and I really like the shrimp Louie salad.  \r\n\r\nTo a palate accustomed to medium-rare salmon, dusted with Moroccan spices and served served with kumquat jam and couscous, the preparations can seem barebones, almost bland.  I really enjoy the simplicity of such a, well, retro expierance.  It's seafood made comfort food, and it tastes like modern American history.", "rating": 3, "date": "2006-08-17"}, {"excerpts": ["I also had the fried scallops, which were breaded and friend nicely and came with a generous shrimp louie salad and red potatoes. ", "My best friend had the parmesan crusted halibut with the side of fries and caesar salad. ", "Very juicy and delicious! ", "The staff was friendly and attentive as well. ", "\"", "A taste of old San Francisco!", "\""], "author": "Kaila Y.", "review": "The restaurant has been around since 1974.  It is cute small neighborhood joint with only 15 tables. I came here on a Friday evening with my best friend around opening time and we waited for about 20 minutes. We were served complimentary white wine during our wait. I started with the clam chowder. It was not too creamy but flavorful with vegetables and clams - yum! I also had the fried scallops, which were breaded and friend nicely and came with a generous shrimp louie salad and red potatoes. My best friend had the parmesan crusted halibut with the side of fries and caesar salad. Very juicy and delicious! The staff was friendly and attentive as well. \"A taste of old San Francisco!\"", "rating": 4, "date": "2008-11-17"}, {"excerpts": ["My favorite meal starts with the Shrimp Louie salad (not the one from the menu - this one comes with the meal).  ", "Then Turbot Baked In Parchment.  ", "Fresh fish stuffed with crab and shrimp in a light cream sauce.  ", "Pair "], "author": "Denise M.", "review": "Long wait - key is to catch the 'wave' every 45 minutes or so.  It's as if the restaurant empties out, then fills back up all at once.  Good thing is that while you're in line, you get a complimentary glass of wine.\n\nThe place is small, dark and loud.  I love it.  The food is good, but not cheap for a local place.  The seating is mostly booths, so bigger parties will be fighting for the one larger round table they have setup in one corner.\n\nMy favorite meal starts with the Shrimp Louie salad (not the one from the menu - this one comes with the meal).  Then Turbot Baked In Parchment.  Fresh fish stuffed with crab and shrimp in a light cream sauce.  Pair that with the rice pilaf...  Ohhhhh yeah!  \n\nIt's a simple menu, with fresh and tasty treats.  Daily specials, so don't forget to look up on the chalk board above the kitchen.", "rating": 5, "date": "2008-02-06"}, {"excerpts": ["i had one of the daily specials: salmon and crab newburg with red potatoes and a very nice shrimp louie salad. ", "very very yummy "], "author": "Sharonrose B.", "review": "DELICIOUS, WARM, FRIENDLY but sadly, expensive... i would not say overpiced, however.  big diff. \n\nwe were served immediately with free wine (they will give you something else of your choice if you do not drink) and though they do not take reservations, the wait was not bad at all. \n\ni had one of the daily specials: salmon and crab newburg with red potatoes and a very nice shrimp louie salad. very very yummy and they are not shy with the bread.\n\nTHE STAFF IS ONE OF THE BEST I HAVE ENCOUNTERED IN THE CITY.", "rating": 4, "date": "2007-10-24"}, {"excerpts": ["Our entrees came with either soup (salmon bisque or clam chowder) or salad (ceasar or shrimp louie) ", "Loved my shrimp louie...will have to have that as a dinner selection next time!! ", "Though we were tempted to have a few of their special desserts on the board, my friends had already planned a special outing to Ghiradelli square for some sundaes! ", "For the three of us, an $80 price tag for fresh seafood, great service and free wine and unlimited bread, butter and fresh lemon wedges is a steal in San Francisco!! ", "Check it out!! ", "This place is no reservations and limited crazy Geary street parking."], "author": "Naomi N.", "review": "Though I have been living in SF all my life, this was my first time to this 37 year old establishment!! Arrived just before 6 and got the last table available (this was on a Saturday night). The complimentary wine was served as soon as we sat down! Service was great all through our dinner! The decor and atmosphere was casual and comfortable. Mostly booth style tables. Crab cakes appetizers were $18 for two cakes but they were chock-ful of fresh crab meat, not fillers so definitely worth it! \nI had the turbot with shrimp and crab in parchment. For those of you who don't know, like me, turbot is a Mediterranian sole. Firm white filets covered with creamy shrimp and crab white sauce all cozily wrapped and baked in parchment. They cut it open for you when it is brought to the table. My friends had the sole newburg and parmesan halibut...both fresh and yummy as well! Our entrees came with either soup (salmon bisque or clam chowder) or salad (ceasar or shrimp louie) Loved my shrimp louie...will have to have that as a dinner selection next time!! Though we were tempted to have a few of their special desserts on the board, my friends had already planned a special outing to Ghiradelli square for some sundaes! For the three of us, an $80 price tag for fresh seafood, great service and free wine and unlimited bread, butter and fresh lemon wedges is a steal in San Francisco!! Check it out!! This place is no reservations and limited crazy Geary street parking.", "rating": 5, "date": "2011-09-22"}, {"excerpts": ["One thing I really like is the choice of salads, besides the basic vinaigrette, which I detest, they offer Caesar or shrimp Louie.  \n\n"], "author": "Madeline M.", "review": "I first started coming here about 1975.  I hadn't been there for a couple of years and tried it again last night.  I thought it was still very good.  One thing I really like is the choice of salads, besides the basic vinaigrette, which I detest, they offer Caesar or shrimp Louie.  \n\nThe sourdough bread is some of the best, and my dining partners loved both the Salmon bisque and the Clam Chowder.\n\nThey had about 8 specials, besides the regular menu.  The five of us all had something different, and everyone enjoyed their entrees.\n\nI love the steamed red potatoes, they are very tasty even though they  are simple.\n\nFor dessert we shared one chocolate mousse cake which I thought was just OK, I think they used to have just plain chocolate mousse which was better.  We also shared a pistachio ice cream, the portion was very generous and made me want to go over to Mitchell's ice cream store, I haven't been there in years either.\n\nThe service was fine, and I still appreciate the free wine.\n\nI'm glad Pacific Cafe is still around after all these years.", "rating": 4, "date": "2008-08-12"}, {"excerpts": ["Served, as are all their meals with the choice of rice or potatoes and preceded by a free shrimp louie ", "salad you can dine like kings, drink the free wine (even if it is rubbish!) "], "author": "Tony S.", "review": "Something about this place caught my eye as I was speeding down Geary one evening.  It was the orangey glow and the small crowd that seemed to be gathered outside.  Pacific Cafe is a seafood restaurant of innate simplicity, they concentrate on market fresh fish alongside a few staples.  My first experience there led me to the crab cakes which were melty hockey pucks of shellfishy glory, beautifully textured crab which obviously came from a legendary recipe.  It has been there since 1973 and survived through the years despite attacks from the Lobster Liberation Front and the threat of building collapse and whilst I can't claim to have been dining there since 1973, the ten or so times I've been there have been wonderful.  \n\nHighlights of the menu are the crab cakes and the halibut but the real show stopper there is the calamari steak meuniere.  They take the body of a squid the size of which i've only dreamed of, pound it flat, lightly coat it and pan fry it.  Served, as are all their meals with the choice of rice or potatoes and preceded by a free shrimp louie salad you can dine like kings, drink the free wine (even if it is rubbish!) and generally pig out for $20 a head.\n\nThe drawbacks are of course it's popularity and the fact they do not take reservations.  If they did, you wouldn't be able to get a table for months and that is not what PC is about.  Get there early or midweek and you stand a better chance, i've seen waits up to 2 hours on the weekend!\n\nLove this place, it's as old as me and just as set in it's ways!", "rating": 4, "date": "2007-08-24"}, {"excerpts": ["The food, seafood, is excellent, especially the bread, the shrimp louie salad and several of the fresh entrees (calamari steak, grilled shrimp, wasabi-butter ahi).  ", "Short wine list, but budgetarily sound (5$ corkage and a similar markup from winestore prices).  ", "Dessert, I'd recommend going someplace else.\n", "The servers know what they're doing, but service can be uneven and god forbid you comment negatively, even in a reasonable way."], "author": "Charlie O.", "review": "Hmmm, you mean I get wine (OK, Inglenook, don't get too excited) while I'm waiting?  OK!  Be prepared to drink a lot of wine, because you're likely to wait a while.  \nIt's a small corner restaurant that's been there for many, many years (how do I get the original menu prices on this bill?).  I've been 4+ times a year for the last 6 years, and have rarely been disappointed.  The food, seafood, is excellent, especially the bread, the shrimp louie salad and several of the fresh entrees (calamari steak, grilled shrimp, wasabi-butter ahi).  Short wine list, but budgetarily sound (5$ corkage and a similar markup from winestore prices).  Dessert, I'd recommend going someplace else.\nThe servers know what they're doing, but service can be uneven and god forbid you comment negatively, even in a reasonable way.", "rating": 4, "date": "2006-06-05"}, {"excerpts": ["We start with the moderately spiced and comforting salmon or crab bisque, and the salad with shrimp louie dressing!  "], "author": "Paris E.", "review": "Get the crab diablo (only available during dungeness season), local whole dungeness sauteed in a peppery blend of white wine, shallots, and butter. We alternate between enjoying buttery dungeness flavor of the crab straight out of the shell with dipping some of it into the sauce. The hearty bread is also good for sopping up the tasty sauce and we usually can't get enough of it. We start with the moderately spiced and comforting salmon or crab bisque, and the salad with shrimp louie dressing!  In order to afford pricey dungeness for both of us we often split everthing and order an extra salad and perhaps a veggie.  \n\nThe rest of the daily menu items are predominately straightforward preparations of fresh seafood, either grilled, baked, or pan-fried. The printed menu seafood is more old-skool continental stuff, still good though. \n\nPacific Cafe is basically unchanged since we started going there in the mid 80's, and so is the menu.  No fussy, self-conscious presentations and no Cal, Pan, Neo, or Fusion anything. What a relief. We have been going there for so long that the spicy snapper which used to be 9.98 back is now more like 15.98 due to inflation. We also like the halibut parmesean. \n\nNotice: the clam chowder is not the creamy Boston style you might expect. It's \"pacific\" clam chowder, which is broth based. We have learned to enjoy it when we are in the mood for it. Still looking for the best creamy clam chowder, though. You'd think we'd have it here in SF but it's hard to find. Their bisques make up for it!\n\nEnjoy the free cheap wine while you wait and wait and wait for a table, and even if you come for the first seating as we do, they still give you a glass of the comp wine when you are seated. Refills are only while you are waiting. Once at the table you are expected to order from the wine menu. If you still want to drink more. \n\nAn interesting observation is that even when the restaurant is full, the environment is not overstimulating. We've gone here after an exhausting day and enjoyed having a relaxing meal. It's always relaxing to eat here even though it doesn't look like \"it's been designed and conceived to be relaxing\". Like I said, not self-conscious or considered. Just a regular nice place, with giant huge steak fries.\n\nAvoid the Pacific Cafe over in Marin. It's kinda sorta like this one (looks like a twin) but clearly not owned by the same people (at least not any more). We went there a few months ago and were disappointed in everything.", "rating": 5, "date": "2006-12-29"}, {"excerpts": ["I highly suggest getting the shrimp louie salad with your meal and pretty much everything on the menu is delicious."], "author": "Tawnya C.", "review": "This place is comfy, cozy, inexpensive and oh so tasty! One of my favorite restaurants in all of San Francisco. The first time I went there was about 10 years ago, our server was this petite, VERY pregnant irish woman, she served us about four or five times after that as well.  The weekends usually there is a wait but they serve you house white while you wait. They always have amazing daily specials. I highly suggest getting the shrimp louie salad with your meal and pretty much everything on the menu is delicious.", "rating": 5, "date": "2010-04-23"}, {"excerpts": ["Both they serve with three red potatoes (or your choice of rice pilaf) we had soup, clam chowder (or choice of shrimp louie salad or cesear). ", "I was stuffed! ", "The scallops were baked in butter, of course! ", "The salmon was cooked just right and both you could taste the meal rather than any spices that most places add, that's nice for a change.\n"], "author": "Jess P.", "review": "Yum Yum!!\nWalk in, write name down and the nice hostess brought us a glass of complimentary cheblis. It was tasty too. what a nice touch..\nCrab cocktail, good. Lots of crab, cocktail sauce on the side, kind of like that. The bread they give you right away is fresh and fluffy and good with lots of butter.. can't have too much butter!\nMy PID (partner In Dinning) my special friend who is just as picky as me loves this place too. It's simple and delightful. He had the parmesean halibut, which I didn't try but looked amazing. I had the baked salmon and scallops combo. Both they serve with three red potatoes (or your choice of rice pilaf) we had soup, clam chowder (or choice of shrimp louie salad or cesear). I was stuffed! The scallops were baked in butter, of course! The salmon was cooked just right and both you could taste the meal rather than any spices that most places add, that's nice for a change.\nThe atmosphere is great for a nice, romantic night out. \n\nThe service is quick and friendly. They have such a long wait usually, they are used to bringing out your courses one right after the other. They give a few moments in between but it's pretty fast service. \n\nParking is a bit tricky, there's not a lot around the outter richmond area, so be prepared to walk around and bring a jacket!", "rating": 5, "date": "2009-07-29"}, {"excerpts": ["i had their salmon bisque and the bf had the shrimp louie salad as our starters, and both were great. "], "author": "Sheri N.", "review": "the complimentary wine eases the edge of hunger pangs and the wait for a table. normally i'm not a white wine person, but their chardonay was tasty enough. the restaurant has an old san francisco feel as it is made of great wood workmanship from the tables to the booths. \n\nthe food is simple and delicious. we shared a half order of the crab cakes. they were out of this world, and a must order. i had their salmon bisque and the bf had the shrimp louie salad as our starters, and both were great. our entrees were the halibut parmesan and turbot baked in parchment paper with shrimp and crab. while both were tasty, my halibut parmesan stole the show. we ended the meal with the chocolate torte. \n\nwe were so stuffed by the end of it all we didn't have room for a post-dinner cocktail.", "rating": 5, "date": "2009-09-25"}, {"excerpts": ["My favorite is the halibut parmesan with a shrimp louie salad.  ", "Expect a long wait, but to compensate you for your time you get free wine.  ", "This is a great place to go to have a great conversation in a fun atmoshpere.  ", "The service is fantastic and the people are friendly.  ", "I am a loyal customer and have always been completely satisfied."], "author": "Jessica B.", "review": "I LOVE this restraunt!!  The seafood is amazing.  My favorite is the halibut parmesan with a shrimp louie salad.  Expect a long wait, but to compensate you for your time you get free wine.  This is a great place to go to have a great conversation in a fun atmoshpere.  The service is fantastic and the people are friendly.  I am a loyal customer and have always been completely satisfied.", "rating": 5, "date": "2007-12-04"}, {"excerpts": ["You couldn't ask for anything better except that they have the most delicious shrimp louie salads. ", "I would come here just to order that, the dressing is drinkable! ", "And the parchment wrapped turbo ", "is creamy delicious and beautifully wrapped like an expensive french pastry. ", "Quite impressive! ", "I reserve this place for fancy friends and special occasions."], "author": "M K.", "review": "Get ready to wait an hour for great fresh fish, delicious red potatoes, and FREE WINE while you stand in line! You couldn't ask for anything better except that they have the most delicious shrimp louie salads. I would come here just to order that, the dressing is drinkable! And the parchment wrapped turbo is creamy delicious and beautifully wrapped like an expensive french pastry. Quite impressive! I reserve this place for fancy friends and special occasions.", "rating": 3, "date": "2009-08-27"}, {"excerpts": ["Another lovely meal (fried scallops, red potatoes, shrimp louie salad and chocolate torte). ", "And actually, the wait was not that bad on a Friday night at 6:00, surprisingly."], "author": "Caitlin H.", "review": "I kept seeing this place from the bus, all rosey and cheerful and crowded, and always wanted to go. I finally got my chance and it totally lived up to expectations. The wait is long, but worth it - plus they serve some pretty darn good complimentary wine while you wait. The regular menu looks excellent, though I tried something from the daily specials board. The choice is hard though. I had baked crab-stuffed salmon Newberg, which was heavenly. For desert, apple tart with a marzipan-y overtone and scrumptious ice cream. The service was great and the ambiance is everything it looks to be from the bus. It's pricey (entrees in the upper teens to 20s, unless you order the abalone at $40), but for a nice, upscale seafood meal, worth it. Glad it's in my neighborhood.\n-----------------------------------------------\nTook my mom to the Pacific Cafe for dinner while she was visiting from LA. Still a five star rating! Another lovely meal (fried scallops, red potatoes, shrimp louie salad and chocolate torte). And actually, the wait was not that bad on a Friday night at 6:00, surprisingly.", "rating": 5, "date": "2007-01-18"}, {"excerpts": ["The thousand island dressing on the shrimp louie is divine.  ", "Fish is flavorful and fresh.  ", "The best is the Zanze cheesecake offering for dessert.  ", "Now, we can come here to have just one slice without buying (and eating) the whole cake."], "author": "K W.", "review": "What a nice surprise.  Haven't had such a delightful dining experience in a long time.  Free booze while you wait.  Woo hoo!  The thousand island dressing on the shrimp louie is divine.  Fish is flavorful and fresh.  The best is the Zanze cheesecake offering for dessert.  Now, we can come here to have just one slice without buying (and eating) the whole cake.", "rating": 4, "date": "2008-08-25"}, {"excerpts": ["the salad was shrimp Louie. ", "A very enjoyable evening to say the least."], "author": "Timothy M.", "review": "Well worth the wait. Some friends were in town. The wanted to go to Pacific Cafe. So we drove across town on a busy Friday evening. There is always a wait. We waited about an half hour. While we were waiting outside with everyone else, here comes an employee with glasses of wine for everyone. They cam out later with more wine for the empty glasses out there. When we got seated we were taken well care of by our waitress. I had the Swordfish, one of my friends had the Halibut and the other had another fish dish (I can't remember the name of it) but it had a mushroom saute on top. All I can say is that we were very happy with all of our dishes. We were stuffed. The soup that night was Crab Bisque (excellent) the salad was shrimp Louie. A very enjoyable evening to say the least.", "rating": 5, "date": "2008-12-06"}, {"excerpts": ["In fact, the shrimp louie, the calamari salad, even the featured scallops, all suffered an ignoble death by cheap cream sauce, and put together, with the help from a couple glasses of the house white while waiting, caused a gurgling in my belly that left me hovering over the toilet in the men's room, contemplating existence.  ", "I did enjoy the portraits of the Cliff House as I wiped the spittle from my mouth, but it was not enough to overcome the viscosity of the experience.  ", "Now, I am far from a foodie, and routinely am left quite satisfied by the hospital cafeteria where I work, but this place left me feeling quite poopy.  ", "Fool me once, shame on Hugh.  ", "Fool me twice, shame on my knee, ", "at least I think that's the way it goes.  ", "Me no go here no more."], "author": "David Y.", "review": "Two words that shouldn't go together:  Cafeteria Seafood.  And yet, that is what I feel I just ate.  I always hear people mention this place as a good seafood place and, in a city with a well-deserved reputation for a variety of good food--whether in a fancy setting or in a bar--I can't for the life of me figure out why this place gets mentioned.  The free wine while waiting and the friendly, professional staff certainly make you root for the place.  Granted, this is only my second time, but both times, about 2/3rds of the way into the meal, I was overwhelmed by a serous taste in my mouth that only comes from what seaman and non-seaman alike would call an excess of thousand island dressing.  In fact, the shrimp louie, the calamari salad, even the featured scallops, all suffered an ignoble death by cheap cream sauce, and put together, with the help from a couple glasses of the house white while waiting, caused a gurgling in my belly that left me hovering over the toilet in the men's room, contemplating existence.  I did enjoy the portraits of the Cliff House as I wiped the spittle from my mouth, but it was not enough to overcome the viscosity of the experience.  Now, I am far from a foodie, and routinely am left quite satisfied by the hospital cafeteria where I work, but this place left me feeling quite poopy.  Fool me once, shame on Hugh.  Fool me twice, shame on my knee, at least I think that's the way it goes.  Me no go here no more.", "rating": 1, "date": "2013-08-23"}, {"excerpts": ["The current shrimp Louie salad was OK but a bit retro.  ", "My daughter had the chowder and she loved it.  ", "At 15 she is the product of posh private schools (her school cafeteria is \"locally grown organic\") and, at times, pickier than her mother.  ", "The others had the bisque and they were impressed.  ", "I had spoonfuls ", "and I was impressed.  ", "Turns out my cousin is allergic to all fish ", "so he had a steak.  ", "Not a grass fed piece of foodie heaven, but I don't think he's fussy.  ", "My fried scallops seemed to be of the frozen breaded type but they were sweet and I wanted deep fried comfort that night.  ", "The Parmesan Halibut was very tasty and moist.  ", "The tuna was cooked to order and the wasabi butter was tasty.  ", "Filet of Sole was my mom's choice and it was quite good.  ", "Big fries (chips) real potatoes and plenty of flavor, just as I remembered, but ", "the rice never did it for me.  ", "A great meal for the price if you choose the right components.       \n ", "The wait is worth it because being trapped in a fog cloaked vestibule drinking Chablis with strangers is a Westie experience that can't be reproduced elsewhere.  ", "I really hope PC ", "(crap, I hate those initials) outlives me -- ", "and I'm going to live a really long time."], "author": "Susan P.", "review": "Well you see kids -- back in the day -- before Pinot grigio or even Chardonnay, if you wanted white you drank Chablis.  And at Pacific Cafe you still drink Chablis and even when it's free it still taste, unfortunately, like Chablis.  There was a time (the '70's) when using a chalk board to list your fresh specials was quirky and innovative.    \n Oh yes, it was sometime after high school, in '78, when my parents investment in a 16 unit building on Haight Street (\"gee Bernie, do you think the neighborhood will ever be worth anything?\" my mother asked) started to pan out.  They were going out to dinner every week!!!  Sometimes they invited their poor daughter, the waitress, along.  I can still see mom in her black velvet blazer and white \"bow-tie\" blouse (Mayor Feinstein was a fashion icon for middle aged women) and dad in his Harris tweed, shirt open at the neck, NEVER a tie, sitting in a wood booth at Pacific Cafe.  They were on the cusp of making it; retirement was visible on their horizon.  No early bird specials for Bernie and Harriet, just plenty of fresh fish at Pacific Caf.  In 2001 dad went to the big multi unit in the sky.  This is where tenants never flush Kotex, dimes never stall garbage disposals and god did what the Supreme Court wouldn't do -- outlawed rent control.  Mom (still here, going on 90) lived long enough to see warnings about both eating fish (toxins), and the probable extinction of many species, become reality.       \n Would the current reality of Pacific Caf live up to my memories?  I went with mom and some relatives last year.  In '78, most salads were iceberg with dressing ladled on top -- a salad tossed in vinaigrette (as I remembered their salads to be) was a gourmet treat.   The current shrimp Louie salad was OK but a bit retro.  My daughter had the chowder and she loved it.  At 15 she is the product of posh private schools (her school cafeteria is \"locally grown organic\") and, at times, pickier than her mother.  The others had the bisque and they were impressed.  I had spoonfuls and I was impressed.  Turns out my cousin is allergic to all fish so he had a steak.  Not a grass fed piece of foodie heaven, but I don't think he's fussy.  My fried scallops seemed to be of the frozen breaded type but they were sweet and I wanted deep fried comfort that night.  The Parmesan Halibut was very tasty and moist.  The tuna was cooked to order and the wasabi butter was tasty.  Filet of Sole was my mom's choice and it was quite good.  Big fries (chips) real potatoes and plenty of flavor, just as I remembered, but the rice never did it for me.  A great meal for the price if you choose the right components.       \n The wait is worth it because being trapped in a fog cloaked vestibule drinking Chablis with strangers is a Westie experience that can't be reproduced elsewhere.  I really hope PC (crap, I hate those initials) outlives me -- and I'm going to live a really long time.", "rating": 5, "date": "2008-06-06"}, {"excerpts": ["I had their shrimp louie salad, and it was delicious. ", "The salad was fresh, and the husband enjoyed his clam chowder. ", "Like I said, they had Zanze's cheesecake, which we ordered without hesitation. ", "I loved how they carried local foods (they also have Mitchell's ice cream), so we felt the SF pride in there. ", "We only live 10 blocks away, so it won't be hard for us to come back! ", "Yummy, yummy crab cakes, I need some more!"], "author": "Ang L.", "review": "Husband and I came here for our 3 month wedding anniversary last night, and boy were my fellow yelpers right on point - I LOVE this place! Pacific Cafe is now my go-to seafood spot - why? Because it is officially my favorite for its fresh, fresh food, great service and ambiance. Who can say no to free wine (all of you under 21 should)? Fresh bread and butter, and those crab cakes was like taking a bite of bliss every single time. If it weren't for dinner and the fact that they carried Zanze's cheesecake for dessert, I would have gotten more! I had one of their specials, the spicy snapper. It was more of a kick than spicy which actually worked out well considering my episode of acid reflux. Husband had the calamari steak and we were both very, very content with our orders. I love how all of the orders comes with either soup or salad, fries, rice or red potatoes. A nice hearty meal for a cold day in the city. I had their shrimp louie salad, and it was delicious. The salad was fresh, and the husband enjoyed his clam chowder. Like I said, they had Zanze's cheesecake, which we ordered without hesitation. I loved how they carried local foods (they also have Mitchell's ice cream), so we felt the SF pride in there. We only live 10 blocks away, so it won't be hard for us to come back! Yummy, yummy crab cakes, I need some more!", "rating": 5, "date": "2010-11-01"}, {"excerpts": ["The CRAB CAKE, SALMON, SCALLOP, ABALONE, SPICY SNAPPER, SHRIMP LOUIE SALAND AND THERE SOUPS ETC and very good. ", "They do have Steak ", "but I have never tired it. ", "The waiters are all very nice."], "author": "Ge I.", "review": "Very good restaurant. I love this place. Everyone is soooo friendly, even the people who are waiting to eat. Very hard to find parking but that's SF. Just talking writing about this place makes me want to go there. We live about 4 blocks from Pacific Cafe.  A great place for fresh seafood. A place to take someone who is visiting SF. So far that is what we have done and everyone we have taken to this place, they also loved it. It's  great to go right when it is opening so that you don't have to wait. If you are the first to be seated you still get a glass of free wine, We did. If you come later it's a long wait but if you sip wine then it does not seem like you are waiting long.  The CRAB CAKE, SALMON, SCALLOP, ABALONE, SPICY SNAPPER, SHRIMP LOUIE SALAND AND THERE SOUPS ETC and very good. They do have Steak but I have never tired it. The waiters are all very nice.", "rating": 5, "date": "2008-05-14"}, {"excerpts": ["the first time we went we had a delicious dinner; crab cakes and the halibut parmesan coupled with clam chowder and a yummy shrimp louie salad. ", "it was delecious!  ", "we felt that that prices were fair too average around $25/per person (included a glass of wine and soup/salad) we went back last night and thought we'd try something else. ", "i had the ahi with wasabi butter which was very bland. ", "no taste at all.  ", "my husband had the sole stuffed with crab which  tasted like mush. ", "we were pretty disappointed in both dishes..which makes me wonder if anything else is good besides the crab cakes and halibut. ", "you can't experiment with different dishes at this place. ", "stick to what is known to be excellent ", "and you'll have a nice dinner."], "author": "SF Native M.", "review": "we have been twice. the first time we went we had a delicious dinner; crab cakes and the halibut parmesan coupled with clam chowder and a yummy shrimp louie salad. it was delecious!  we felt that that prices were fair too average around $25/per person (included a glass of wine and soup/salad) we went back last night and thought we'd try something else. i had the ahi with wasabi butter which was very bland. no taste at all.  my husband had the sole stuffed with crab which  tasted like mush. we were pretty disappointed in both dishes..which makes me wonder if anything else is good besides the crab cakes and halibut. you can't experiment with different dishes at this place. stick to what is known to be excellent and you'll have a nice dinner.", "rating": 3, "date": "2009-09-29"}, {"excerpts": ["(I always go for the rice, which is very good) and a soup/salad (the salads are caesar or shrimp louie - the latter is very good for a gratis side salad).  ", "You will, however, invariably wait a long time for a table...", "this place is very popular.  ", "The couple of times I've been here, I've had to wait between 40-60 mins.  ", "But they do offer you free red/white wine (mediocre, but not bad) while you wait, which is a nice gesture.  ", "A quick tip - if you're willing to eat dinner towards the end of the night (8:30-9:00'ish), the wait will be much shorter, if at all.  "], "author": "Mike L.", "review": "This place is very, very good and exactly as advertised.  The decor's nothing special at all (doesn't pretend to be), but the service is very efficient and friendly and the food is very high quality and fresh.  They have excellent staples on the menu and the daily fresh fish options are plentiful and are always top notch.  With every entree ($14-22 typically) you get a choice of fries/rice (I always go for the rice, which is very good) and a soup/salad (the salads are caesar or shrimp louie - the latter is very good for a gratis side salad).  You will, however, invariably wait a long time for a table...this place is very popular.  The couple of times I've been here, I've had to wait between 40-60 mins.  But they do offer you free red/white wine (mediocre, but not bad) while you wait, which is a nice gesture.  A quick tip - if you're willing to eat dinner towards the end of the night (8:30-9:00'ish), the wait will be much shorter, if at all.  My wife and I went just last night, and by the time we were finishing (around 8:45'ish), they were seating people right away, and still giving them a free glass of wine!\n\nBottom line - if you want a good piece of fish, some free wine while you wait, and don't want to pay an arm and a leg, this place is an absolute institution that caters to those needs.  And if they have the crab bisque, get it!", "rating": 4, "date": "2007-12-27"}], "filet of sole newburg": [{"excerpts": ["I had the Filet of Sole Newburg which was a creamy dish that went well with the side of rice (you get choice of rice or potatoes...", "possibly something else ", "but I can't remember right now). ", "Be careful when you eat this, because I did find some bones in there that I almost swallowed! ", "For the soup, I went with the chowder which was fine- nothing special, but good "], "author": "Kathy L.", "review": "The food is okay, but bringing it up to a solid 3 stars for the \"free\" add-ons, like the complimentary wine while you wait and with your meal, and that each meal comes with choice of salad or soup (which worked perfectly for me because I wanted to try their soup anyway). Came here with a group of 5 for dinner around 6:30 and didn't wait long for a table. I had the Filet of Sole Newburg which was a creamy dish that went well with the side of rice (you get choice of rice or potatoes...possibly something else but I can't remember right now). Be careful when you eat this, because I did find some bones in there that I almost swallowed! For the soup, I went with the chowder which was fine- nothing special, but good 'cause it was nice and hot.\n\nI doubt I'll be back but it's a cute little spot that kind of brings you back 'cause it's been around so long. It's on the expensive side for just okay food.", "rating": 3, "date": "2015-12-28"}, {"excerpts": ["My favorite entree is the Filet of Sole Newburg - $23.27. ", "It's rich, creamy and an absolute silky delight. "], "author": "Carole B.", "review": "Pacific Cafe is an absolute neighborhood classic. Yes, they ply you with cheap wine while you wait - perhaps this is why no one seems to mind. The crowd is convivial and talkative - not at all impatient, even when they are out in the cold.\n\nSumptuous seafood dishes abound. My favorite entree is the Filet of Sole Newburg - $23.27. It's rich, creamy and an absolute silky delight. It comes with soup or salad - both of which are served up in generous sizes.\n\nThe atmosphere is warm and cozy, and the staff makes you feel like a regular from the first visit.", "rating": 5, "date": "2015-05-17"}, {"excerpts": ["Petrale Dole: 3/5 \nFilet of Sole Newburg: 3/5 (it's more crab than fish I think! ", "The sauce is too heavy for me though..)\n", "Strawberry Sorbet: 5/5 (they gave it to us for free because we sent back the halibut "], "author": "Amanda C.", "review": "It's so windy in this area. This restaurant doesn't take reservations, so be sure to bring a jacket because you'll be waiting outside for 30 minutes. And yes, they do give free wine while you wait. \n\nI came here on my birthday with my boyfriend, and the menu looked SO good, but the food disappointed.. :(\n\nCrab cocktail: 4/5\nSalmon bisque: 3/5 (too creamy?)\nClam chowder: 3/5 (tasted too much like minestrone to me, on the watery/salty side)\nParmesan crusted halibut: 1/5 (so dry and it's really just fish and chips...) We sent this back because it was just TOO dry and hard to eat. The waitress was nice and got us the Petrale Dole instead.\nPetrale Dole: 3/5 \nFilet of Sole Newburg: 3/5 (it's more crab than fish I think! The sauce is too heavy for me though..)\nStrawberry Sorbet: 5/5 (they gave it to us for free because we sent back the halibut I think lol...)\n\nBasically everything was average to me. Ambience is definitely on the casual side and it gets loud in the restaurant.", "rating": 3, "date": "2013-08-06"}, {"excerpts": ["The filet of sole Newburg stuffed with crab is pretty good, if a bit rich and heavy (to be expected), as is the turbot in parchment. ", "I've tried the grilled spicy snapper which is a good alternative to the heaviness of the other dishes. ", "When they ask you what side to get, you should ask for one of the soups! ", "Both the clam chowder and the crab bisque are really delicious here. "], "author": "Vivian L.", "review": "The family and I come here fairly often. The restaurant isn't very big on the corner of Geary and 34th. It's generally always crowded with a decent wait. But...waiting is one of the best parts! They give you complimentary wine (sometimes multiple if you're like my dad who gulps it down like water).\n\nThe food is pretty good and the seafood is always fresh. The filet of sole Newburg stuffed with crab is pretty good, if a bit rich and heavy (to be expected), as is the turbot in parchment. I've tried the grilled spicy snapper which is a good alternative to the heaviness of the other dishes. When they ask you what side to get, you should ask for one of the soups! Both the clam chowder and the crab bisque are really delicious here. Make sure to ask them for their Tobasco so you can add a little to the soups to give it that nice kick!\n\nService here has always been very good. Definitely come by for dinner after you've spent the day freezing out at Lands End or on the beach!", "rating": 4, "date": "2013-07-25"}, {"excerpts": ["Filet of Sole Newburg  -  $21.37 - a baked delight (kinda an old-school dish) - very nicely prepared ... not a drop of the sauce was left on the plate.\n\n"], "author": "Matsuo U.", "review": "Dinner for 4, got there a few minutes after they opened (5:00PM) and most of the place was filled. No reservations accepted... I tried. \nSeated right away by a courteous greeter, the service by the waitress was efficient and attentive.  Definitely not a hipster joint, but a long lasting restaurant that is consistent & good. \n\nAt our table (of course I talked everyone out of a bite - and two in one instance). Nothing really exotic (they did have abalone on the menu)  well prepared, tasty & nicely presented dishes:\n\nSalmon & Prawns Combo  -  $23.75 - Nice  \"combo\" of fresh seafood flavors.\n\nFilet of Sole Newburg  -  $21.37 - a baked delight (kinda an old-school dish) - very nicely prepared ... not a drop of the sauce was left on the plate.\n\nCrab Louie  -  $24.00 - beautiful & tasty & GIANT\n\nSnapper Spicy  -  $18.98 - kinda not that spicy if your into the XXX of spicyness (probably not a real word) but tender & tasty.\n\nAccompanying soups /salad / fries rate a \"good\" comment. \n\nJust down the road ( 5 minute walk ) from the Legion of Honor museum, so after nourishing your eyes & mind with beauty at \"The Legion\", delight your taste buds and fill your belly at Pacific Cafe. \n\nhttp://legionofhonor.famsf.org/legion/exhibitions", "rating": 4, "date": "2011-10-09"}, {"excerpts": ["I estimate they are probably around 4\" to 4.25\" in diameter\n\n- Friendly service, our server was attentive without seeming to lurk over our meal\n\n- I ordered the Filet of Sole Newburg  with fries which was decent but made a mistake. "], "author": "Andrew L.", "review": "I've seen this restaurant at least 20 years back when my folks owned a restaurant in the RIchmond district. Even then, I would see a small group of people huddling outside on a cold night, which is a frequent occurrence out there.\n\nAfter all these years, I finally came here to chow down and walked away satisfied although I'm not sure if I would rush back here for a meal. It was raining that night so the crowd wasn't there since we were seated within 5 minutes around 7:15PM. Here are my highlights and thoughts\n\n- Complimentary glass of white wine while you waited\n\n- Crab cakes appetizer were fantastic. I'm usually very weary of ordering them from restaurants since they're typically dry but these were very nicely done. It's not cheap, $10 for 1 or $18 for 2.  I estimate they are probably around 4\" to 4.25\" in diameter\n\n- Friendly service, our server was attentive without seeming to lurk over our meal\n\n- I ordered the Filet of Sole Newburg  with fries which was decent but made a mistake. This dish is stuffed with crab and topped with a cream sauce. I just had the crab cakes so the flavor is all too similar and too heavy. I had choice between this and a Grilled Tuna with wasabi sauce... although I asked the server for recommendation, all she mentioned was they are too completely contrasting dishes. If she would have kept in mind that I ordered the crab cakes, then she could have mentioned the similarities and warned me. The fish wasn't bad but is definitely not memorable. Fries were house cut thick style and were not bad and not soggy or overly salted.\n\n- My girlfriend ordered fried scallops with small red potatoes. The scallops were very fresh and tasted sweet. Since they are just lightly fried, there isn't flavoring from heavy sauces which is fine by me. The potatoes were just served as whole pieces. I wish they would have done something with the potatoes such as lightly grill them or add some herbs/seasoning. Just seemed a bit lazy to serve plain boiled potatoes.\n\n- I do like the place, it's cozy and the booths offer some privacy. It's a nice place for a date night or just hang out with some friends enjoying drinks.\n\nI can honestly say I've had better seafood, but from what I sampled that night, the food is fresh which is important when eating seafood. Most of the dishes seemed to be grilled in some way so tailor expectations on the flavor if there is no sauce that is cooked with the seafood.", "rating": 3, "date": "2011-10-17"}, {"excerpts": ["I had the Filet of Sole Newburg, and this is the first time i've ever had it...", "OMG it was DIVINE!  ", "Not overbearing or super rich, but definately not bland.  ", "The crab stuffed in the Sole was excellent.  ", "Had it with two steamed red potatos on the side, (Suggestion:  ", "Dip the Potatoes in the Newburg Sauce!)\n"], "author": "Debi R.", "review": "Went here after doing a quick Yelp search of restaurants in the area.  GLAD WE CAME!  \n\nMy mom and i spent a day in the city and wanted something delicious, filling and decently priced.  \n\nI had the Filet of Sole Newburg, and this is the first time i've ever had it...OMG it was DIVINE!  Not overbearing or super rich, but definately not bland.  The crab stuffed in the Sole was excellent.  Had it with two steamed red potatos on the side, (Suggestion:  Dip the Potatoes in the Newburg Sauce!)\nMy mom had the Halibut Parmesan and she said it was one of the best she has ever had.  I tried a bite, and it was very light, very flavorful, but not over cooked, or oily or anything.  They gave tartar sauce with it, and you dont even need it.  That is how good their halibut is.  \n\nWe luckily got there just before the big dinner rush started, so we were seated promptly, and were given free glasses of wine to have while waiting.  \n\nAmbiance is nice in general decor.  A bit dark for my personal liking, and when it gets busy it gets fairly loud and warm inside.  But the food makes up for that.\nWaiter/Waitresses were amazing, very gracious and made sure we were happy, without being annoying (i dont think much of waiters who ask you how everything is every minute...).\n\nFor the two of us, the total came out to just over $50.  A little pricey, but worth it.\nWill i come back here?  Definately!\nWill i reccomend it to friends and family?  Definately!", "rating": 4, "date": "2011-09-12"}, {"excerpts": ["I tried a bite of my gfs dish (Filet of Sole Newburg ), which was baked in a little casserole dish. ", "Omg, they looove butter here. ", "Super rich and almost too rich to eat. ", "She made it through half her fish and pushed it away. ", "Some of it looked raw still "], "author": "Rosalind S.", "review": "This was my 2nd or 3rd time here last night and my gf and I strolled in around 6pm for an early dinner. As we guessed, the place was filled with seniors and a handful of younger folks. \n\nThe menu is pretty simple, pick an entree and you get a choice of soup or salad and  rice, red potatoes or French fries.  Don't forget to look up at the board for specials. It is more extensive then their printed menu. I got the  Petrole Sole and Oh boy was it greasy!!  The butter it was cooked in overwhelmed the fish completely. I ate half of the fries and barely made it through one of the two sole fillets. The shrimp Louie salad was ok. I picked out the shrimp pieces and tried to eat the romaine leaves that weren't drenched in dressing. Half of the salad was untouched. The bread was also  very good. It was waiting for us at the table and covered with a towel, but to our disappointment it was cold. We wondered if they got the bread from Azemendi bakery and joked around that it's probably just Boudin bread. We asked the waitress and yes, they do get their bread from Boudin, haha. \n\nI tried a bite of my gfs dish (Filet of Sole Newburg ), which was baked in a little casserole dish. Omg, they looove butter here. Super rich and almost too rich to eat. She made it through half her fish and pushed it away. Some of it looked raw still but we weren't sure. \n\nOverall, the glass of complimentary wine upon being seated was nice. We didn't need more after that. There wasn't a wait at 6pm also. The waitress was super nice and cheery. But the food is diner style at best.  They've probably made it this far because its one of the only food options this far out in the Richmond district.", "rating": 3, "date": "2010-11-19"}, {"excerpts": ["Stay clear from FILET OF SOLE NEWBURG.........", "DISGUSTING! ", "Inedible!!! ", "Crab cakes taste like Mayonnaise and green onions."], "author": "Inez B.", "review": "Just plain ole Nasty! Very BLAND...Bring your own season's....Stay clear from FILET OF SOLE NEWBURG.........DISGUSTING! Inedible!!! Crab cakes taste like Mayonnaise and green onions.", "rating": 1, "date": "2011-07-18"}, {"excerpts": ["we decided upon the calamari, ahi tuna, filet of sole newburg, and the turbot baked in parchment. ", "EVERYTHING was delicious and cooked to perfect. ", "nothing tasted \"sea fishy\". ", "my ahi tuna was like a rare steak and the wasabi butter was just spicey enough to get kicked in the teeth with but not enough to where i couldnt eat. ", "we ate everything but didnt stop there! ", "oh no.... ", "we had mango sorbet and tirimasu for dessert!!! ", "the mango sorbet was like literally eating a fresh mango. ", "it was soooooooooo good. ", "and the tirimasu? ", "i would take a bullet for it. \n", "so as you can see by my long ass review (and if you have even made it this far) ", "i ", "super enjoyed my 2 hour long meal at the pacific cafe. ", "if you drive by and see me in the window, honk and wave, because i'll be there ALLL night."], "author": "Aly L.", "review": "i had the most enjoyable dining experience of my life tonight at pacific cafe. \nso, my roommate and i were looking for a place where we could take our other roommate out for his birthday. something not pretentious, but nice. something with seafood, but not ridiculous crap we've never heard. something cozy. we settled on the pacifc cafe because 1. it looked so cute when we drove by it. 2. i yelped it and there were more good reviews than bad, and 3. i heard about the free wine (c'mon i'm only human).\nour adventure started at about 830p when we walked in to find that only 3 couples were ahead of us in line. a very cute and unpretentious boy immediately brought us full glasses of wine and we waited in a very cozy sitting area chatting and talking about the day. it was great. even though the restaurant was filled, we could still hear each other. about 15 minutes later, our name is called and we are seated in this little alcove next to a window at a nice round table that is already stocked with bread and tons of butter. they must be stalking. i never get that much butter and i'm a butter fiend and so is my roommate. we would jello wrestle over the last stick if we had to, but!!! we didn't have to because the server was more than happy to keep bringin us basketfulls of bread and all the butter we could gorge ourselves on. \nthe menu was all seafood oriented (duh!) with choices that weren't the normal seafood joint fair (for example, my roommate had never heard of turbot and he eats fish... ALOT) so it was a nice surprise for my roomies.  we decided upon the calamari, ahi tuna, filet of sole newburg, and the turbot baked in parchment. EVERYTHING was delicious and cooked to perfect. nothing tasted \"sea fishy\". my ahi tuna was like a rare steak and the wasabi butter was just spicey enough to get kicked in the teeth with but not enough to where i couldnt eat. we ate everything but didnt stop there! oh no.... we had mango sorbet and tirimasu for dessert!!! the mango sorbet was like literally eating a fresh mango. it was soooooooooo good. and the tirimasu? i would take a bullet for it. \nso as you can see by my long ass review (and if you have even made it this far) i super enjoyed my 2 hour long meal at the pacific cafe. if you drive by and see me in the window, honk and wave, because i'll be there ALLL night.", "rating": 5, "date": "2006-05-24"}], "turbot in parchment": [{"excerpts": ["The filet of sole Newburg stuffed with crab is pretty good, if a bit rich and heavy (to be expected), as is the turbot in parchment. ", "I've tried the grilled spicy snapper which is a good alternative to the heaviness of the other dishes. ", "When they ask you what side to get, you should ask for one of the soups! ", "Both the clam chowder and the crab bisque are really delicious here. "], "author": "Vivian L.", "review": "The family and I come here fairly often. The restaurant isn't very big on the corner of Geary and 34th. It's generally always crowded with a decent wait. But...waiting is one of the best parts! They give you complimentary wine (sometimes multiple if you're like my dad who gulps it down like water).\n\nThe food is pretty good and the seafood is always fresh. The filet of sole Newburg stuffed with crab is pretty good, if a bit rich and heavy (to be expected), as is the turbot in parchment. I've tried the grilled spicy snapper which is a good alternative to the heaviness of the other dishes. When they ask you what side to get, you should ask for one of the soups! Both the clam chowder and the crab bisque are really delicious here. Make sure to ask them for their Tobasco so you can add a little to the soups to give it that nice kick!\n\nService here has always been very good. Definitely come by for dinner after you've spent the day freezing out at Lands End or on the beach!", "rating": 4, "date": "2013-07-25"}, {"excerpts": ["My boyfriend ordered the \"Turbot in Parchment\" and I ordered one of their specials, grilled salmon/fried prawn combo. ", "My boyfriend's meal had an awesome and unique presentation. ", "The Turbot looks somewhat like a puff pastry with TONS of shrimp and crab inside. ", "My salmon and fried prawns were perfection. ", "The salmon was tender; the prawns were so flavorful, lightly breaded, and not greasy whatsoever. ", "I was very, very pleased. ", "They also provide you with huge, thick slices of great sourdough bread. "], "author": "Melissa W.", "review": "Two of my favorite words come to mind when I think of this place:\n\nFree. Wine.\n\nMy boyfriend took me here on a Saturday night around 7pm. As soon as we walked in, we were warmly greeted with two generous glasses of free white wine to enjoy while we waited for a table. Our wait was only about 10 minutes, which in this case, was both a good thing and a bad thing (the free wine only flows when you're waiting for a table). \n\nAside from the free wine, the food here is excellent. My boyfriend ordered the \"Turbot in Parchment\" and I ordered one of their specials, grilled salmon/fried prawn combo. My boyfriend's meal had an awesome and unique presentation. The Turbot looks somewhat like a puff pastry with TONS of shrimp and crab inside. My salmon and fried prawns were perfection. The salmon was tender; the prawns were so flavorful, lightly breaded, and not greasy whatsoever. I was very, very pleased. They also provide you with huge, thick slices of great sourdough bread. Yum. \n\nThe service is great, too. Our server was very friendly and there were multiple people running around making sure we had water, etc. My boyfriend and I loved the atmosphere---it's a small and intimate setting, yet booming with energy and noise from the other diners. We had such a fun dining experience, and I can't wait to come back!", "rating": 5, "date": "2012-11-18"}, {"excerpts": ["What I ordered with my bf:\n\nAppetizer crab cake, Turbot in Parchment, Clam chowder, Salmon Bisque.\n\n", "Turbot in parchment: ", "This was all right. ", "I agree with another reviewer who said the taste was kind of bland. ", "Yes, it was rich due to the cream. ", "It was even kind of salty. "], "author": "michelle l.", "review": "I think this place gets high marks due to the free wine. I was intrigued myself after reading the yelp reviews. No reservations? A line before opening? \n\nSounded awfully familiar (e.g. Burma superstar, Kappou Gomi). \n\nSo ... it had to be good right?\n\nWell, I guess that depends on your definition of good.\n\nWhat I ordered with my bf:\n\nAppetizer crab cake, Turbot in Parchment, Clam chowder, Salmon Bisque.\n\nYes, that is all we ordered. We don't really eat a lot and I'm glad we didn't order a second entree because frankly I was disappointed.\n\nCrab cake: The appetizer size is $9.50 and you only get one crab cake. One! I expected there to be two small ones at least for $9.50.  All right, it had a lot of crab in it... but there wasn't much crab flavor. It wasn't sweet and the texture was mushy. I'm guessing they used frozen crab for this. In addition, the crab cake came to the table a bit on the cold side. Ick. Seafood, especially fried/pan fried seafood must be served piping hot. There was also nothing special about the flavor. Most times when I have crab cakes in restaurants I go \"mmm YUM!\" None of that here. Disappointing. To be honest, I've made a better crab cake myself...\n\nClam chowder: This tasted different from most typical clam chowders. The consistency was a lot thinner and more potato-ey. I didn't really mind it. But the sad thing is... it sorta reminded me of rice gruel (or rice soup... aka \"jook\" for you Chinese). It was a bit of a turn off... but the taste was acceptable.\n\nSalmon bisque: I read a lot of positive reviews, so I was looking forward to this. I was disappointed. The soup base was too cream heavy. Now, I love cream soups, but I couldn't even taste any salmon flavor. Might as well have called this soup salmon colored cream soup because that's what it was. The only reason why I knew it was the salmon soup was due to the color of the soup and the teeny tiny bits of salmon floating in the soup.\n\nTurbot in parchment: This was all right. I agree with another reviewer who said the taste was kind of bland. Yes, it was rich due to the cream. It was even kind of salty. But somehow the overall taste was bland. \n\nI don't know, maybe we didn't order the right things. Sorry, but free wine isn't enough to entice me back to this place. The food did not live up to the hype nor the wait in line.  To be honest, Kincaid's and Scott's Seafood do this type of food better. If you're satisfied with mediocre food and free wine, then by all means, give it a try.", "rating": 2, "date": "2011-07-25"}, {"excerpts": ["Baked Turbot in parchment paper and clam chowder, yum!"], "author": "Paige B.", "review": "This is one of my favorite SF restaurants, I've been going since I was a little girl (so I think its great for well behaved children!) The food has always been excellent, service amazing, and who can disagree with a free glass of wine while you wait for a table! Granted the place is very small and the wait can be upwards of an hour, but even as a small child I thought the wait was well worth the fresh delicious seafood. Baked Turbot in parchment paper and clam chowder, yum!", "rating": 5, "date": "2011-08-19"}, {"excerpts": ["The turbot in parchment, the crab cakes, crab diablo, it's all good."], "author": "Erik W.", "review": "Not cheap, but well worth it. With seafood, you get what you pay for. The food here is excellent as is the service. The turbot in parchment, the crab cakes, crab diablo, it's all good.", "rating": 5, "date": "2011-12-06"}], "halibut parmesan": [{"excerpts": ["I was advised by my friends that the Halibut Parmesan was one of their signature dishes ", "so that's what I got. ", "It was delicious. ", "It came with a choice of a side: broccoli, rice, or fries. ", "Also comes with a soup (they had clam chowder or salmon bisque) or salad. ", "I got the clam chowder and it was really nice with the free fresh sourdough bread and large amount (!) of butter at the table. ", "The clam chowder was more on the light side (not that white creamy Boudin-style) but it was still very tasty and felt homemade. "], "author": "Cicely T.", "review": "This place is so cute and I can't wait to come go back. I ate here last night with 2 friends. I walked in around 7:30 to put my name down on their waiting list. There was only 1 party in front of us and I was immediately asked if I wanted a glass of complementary wine while I walked for the table - so cool! The glass was a good pour as well, almost to the top. We were seated maybe 10 minutes later.\n\nI was advised by my friends that the Halibut Parmesan was one of their signature dishes so that's what I got. It was delicious. It came with a choice of a side: broccoli, rice, or fries. Also comes with a soup (they had clam chowder or salmon bisque) or salad. I got the clam chowder and it was really nice with the free fresh sourdough bread and large amount (!) of butter at the table. The clam chowder was more on the light side (not that white creamy Boudin-style) but it was still very tasty and felt homemade. I liked it!\n\nThe wait staff was very attentive and I had a lovely evening with my friends. We sat in one of their cozy booths. Reasonable prices for what you get. Great neighborhood restaurant and I can't wait to go back and try some of their other dishes.", "rating": 4, "date": "2017-03-10"}, {"excerpts": ["The waiter gave me recommendations: petrale doré, halibut parmesan, and rainbow trout. ", "I went with the halibut parmesan along with salmon bisque as an appetizer. ", "The salmon bisque was very delicious. ", "Lastly the halibut was great. ", "Cooked to perfection and had just the right amount of flavor. \n", "I would definitely recommend this restaurant to any couple looking for a nice seafood dinner."], "author": "Alexander H.", "review": "Excellent service. The wait is long as this is a very popular venue for delicious seafood. During the wait, free wine was offered and refills as well. Once my entire company was present, we were seated immediately. \nThe service was great. The waiter gave me recommendations: petrale doré, halibut parmesan, and rainbow trout. I went with the halibut parmesan along with salmon bisque as an appetizer. The salmon bisque was very delicious. Lastly the halibut was great. Cooked to perfection and had just the right amount of flavor. \nI would definitely recommend this restaurant to any couple looking for a nice seafood dinner.", "rating": 5, "date": "2015-07-19"}, {"excerpts": ["My favorites are the halibut parmesan, the crab Louie (sweet, fresh, gorgeous crab, not local), the clam chowder, the petrale and the Mitchell's ice cream for dessert (another SF tradition). ", "Yes, the free barrel wine while you wait is great and builds a friendly scene, especially on a foggy weekend when the wait may be a bit longer than you hoped. "], "author": "Chris K.", "review": "This place is the perfect neighborhood fish restaurant. Great food, friendly scene, great tradition. My favorites are the halibut parmesan, the crab Louie (sweet, fresh, gorgeous crab, not local), the clam chowder, the petrale and the Mitchell's ice cream for dessert (another SF tradition). Yes, the free barrel wine while you wait is great and builds a friendly scene, especially on a foggy weekend when the wait may be a bit longer than you hoped. But once you're seated, the baskets of great sourdough keep arriving at your table, a very nice salad or soup is included with the meal, and you then enjoy a nice plate of fresh fish (or scallops, or abalone or whatever pops out at you from the specials board). Frank and Roy and Maureen and the other long time staff are friendly, informed and attentive. One of my favorite SF spots any day of the week.", "rating": 5, "date": "2015-11-22"}, {"excerpts": ["I had the Halibut Parmesan, and my boyfriend had the Salmon and Shrimp combo. ", "I've never ordered Halibut at a restaurant because my boyfriend's dad has such easy access to fish, but I thought I'd give it a shot. ", "The flavor was amazing, but the fish was a bit tough - almost like chicken. ", "I just had expected it to be softer and more tender, but then again, I can't really judge because I had never ordered it. ", "My boyfriend's plate looked good and the salmon was good. ", "Came with soup or salad (I had lobster bisque soup ", "and he had Caesar salad) and red potatoes. ", "Finished off with Cantaloupe Ice Cream. "], "author": "Lauren Q.", "review": "Looking for a good seafood spot not too far from home. I've lived in the Richmond my entire life and never visited Pacific Cafe, which apparently has some pretty cool history (open since 1974 or 1975). Quaint little spot with intimate dining space. Complimentary wine while you wait for your food!\n\nStarted off with the Crab Cocktail ($13.95) - holy crap this was delicious. I had the Halibut Parmesan, and my boyfriend had the Salmon and Shrimp combo. I've never ordered Halibut at a restaurant because my boyfriend's dad has such easy access to fish, but I thought I'd give it a shot. The flavor was amazing, but the fish was a bit tough - almost like chicken. I just had expected it to be softer and more tender, but then again, I can't really judge because I had never ordered it. My boyfriend's plate looked good and the salmon was good. Came with soup or salad (I had lobster bisque soup and he had Caesar salad) and red potatoes. Finished off with Cantaloupe Ice Cream. YUM.\n\nI liked the homely feel of the place. Will come back. A bit pricey so not too often :)", "rating": 4, "date": "2012-08-10"}, {"excerpts": ["Have a hard time not ordering the halibut parmesan whenever it is on the menu, but the salmon and prawns combo is delicious as is the swordfish. ", "The fries are my once in awhile guilty treat, although you can get red potatoes or rice also.   ", "Decent prices for what you get (including salad or soup) in a cozy atmosphere.  ", "Entrees with the salad or soup and potatoes or rice typically range from $25-$30.  ", "Decent selection of wine by the bottle or glass with un-inflated prices."], "author": "Mark O.", "review": "Have been coming to Pacific Cafe since the 90's and we keep coming back.  Love the service and the same staff that has been there for a long time, free vino when you get in line, and the fresh fish selections.  Have a hard time not ordering the halibut parmesan whenever it is on the menu, but the salmon and prawns combo is delicious as is the swordfish. The fries are my once in awhile guilty treat, although you can get red potatoes or rice also.   Decent prices for what you get (including salad or soup) in a cozy atmosphere.  Entrees with the salad or soup and potatoes or rice typically range from $25-$30.  Decent selection of wine by the bottle or glass with un-inflated prices.", "rating": 5, "date": "2014-04-21"}, {"excerpts": ["Halibut Parmesan\nLocal Dessert from Zanzes\nPlus free wine???\n\n"], "author": "Grubbinator A.", "review": "Use to hit this joint years ago. Now, I'm hitting it more often. Glad it is still in business. Warning...this will spoil you in many ways. You will move just to be close to this joint. Really. \n\nCocktail of Crab \nHalibut Parmesan\nLocal Dessert from Zanzes\nPlus free wine???\n\nYou can't go wrong...", "rating": 5, "date": "2013-05-15"}, {"excerpts": ["I ordered the lobster bisque and halibut Parmesan because one of the staff  recommended it. ", "The whole meal was really good, but I was so full from the wine, bread, and soup that I couldn't finish my entree. ", "Overall, it was a good meal, and I would definitely recommend it to anyone who wants an authentic San Francisco dining experience."], "author": "Lyn D.", "review": "I drive by this place everyday, and I finally got to check it out. We got there around 9pm and there were 5 small parties ahead of us on the waiting list. We were provided with complimentary white wine while waiting. We were finally seated around 9:30, so it wasn't such a long wait after all. We also got complimentary sourdough bread. I ordered the lobster bisque and halibut Parmesan because one of the staff  recommended it. The whole meal was really good, but I was so full from the wine, bread, and soup that I couldn't finish my entree. Overall, it was a good meal, and I would definitely recommend it to anyone who wants an authentic San Francisco dining experience.", "rating": 4, "date": "2012-09-11"}, {"excerpts": ["And as I tried my husband's halibut Parmesan, I felt like his fish was kinda overcooked too. ", "More disappointing was the sides: the red potatoes that came in two solid uncut potatoes! ", "I didn't know what to do with them. ", "And my husband's choice of rice looked like what Airlines serve. "], "author": "Candice B.", "review": "The thing is, if my mother-in-law wrote this review, she would have given Pacific Cafe 6 stars, but I have come to terms with the fact that sometimes, people just have different tastes. (And too bad she isn't a yelper to tip the scale here.) \n\nWhat she would have raved about: the free wine while waiting. That won her over instantly. I am pretty sure you could serve her frozen dinners after that and she will still be like \"well, they are nice people....\" The other couple of stars from her would be for the ambiance and the food, both comforting. The fact that it's a homey establishment older than her eldest kid means there is history and tradition here. And the menu is simple and straightforward. Nothing \"avant-garde.\" You pick your fish, you pick your side, and you get what you ordered. When they say potatoes, you get two solid red potatoes, nothing trendy like sweet potato fries with wasabi dipping or something. \n\nNow, for me, the reception is a little different. First, I don't drink wine so I gave mine to my MIL. I do like the homey ambiance and decor and especially the nice wooden booths a lot. I also enjoy a simple and straightforward menu, but I was a bit disappointed with the dishes. I had the Snapper \"Spicy.\" They said it's kinda Cajun flavored and my mouth instantly watered reminiscing over the Cajun-style seafood pasta at Maritime Cafe. Unfortunately my fish was over cooked. I am not sure how the fish can seem to be moist but rubbery at the same time. But it was. And as I tried my husband's halibut Parmesan, I felt like his fish was kinda overcooked too. More disappointing was the sides: the red potatoes that came in two solid uncut potatoes! I didn't know what to do with them. And my husband's choice of rice looked like what Airlines serve. The Chinese in me is very picky about rice. \n\nThere was one thing we can all agree on: the pacific clam chowder was fantastic. Not as creamy as New England clam chowder, but so flavorful! \n\nDining experiences like this really puts me in awe of how complex food is to a person. It doesn't just provide taste, but triggers a whole array of psychological components that pushes some flavors forward and suppresses others. Why else would my parents still eat only Shanghainese cuisine after being in the States for over 20 years? Do American food not also provide the 5 tastes: sweet, bitter, sour, spicy, umami? But somehow a certain whiff, a certain color combination, a certain smile of the waitress reminds them of something familiar and comforting. And then, they have no desire to eat anything but that.", "rating": 3, "date": "2011-07-05"}, {"excerpts": ["My mom had the Halibut Parmesan and she said it was one of the best she has ever had.  ", "I tried a bite, and it was very light, very flavorful, but not over cooked, or oily or anything.  ", "They gave tartar sauce with it, and you dont even need it.  "], "author": "Debi R.", "review": "Went here after doing a quick Yelp search of restaurants in the area.  GLAD WE CAME!  \n\nMy mom and i spent a day in the city and wanted something delicious, filling and decently priced.  \n\nI had the Filet of Sole Newburg, and this is the first time i've ever had it...OMG it was DIVINE!  Not overbearing or super rich, but definately not bland.  The crab stuffed in the Sole was excellent.  Had it with two steamed red potatos on the side, (Suggestion:  Dip the Potatoes in the Newburg Sauce!)\nMy mom had the Halibut Parmesan and she said it was one of the best she has ever had.  I tried a bite, and it was very light, very flavorful, but not over cooked, or oily or anything.  They gave tartar sauce with it, and you dont even need it.  That is how good their halibut is.  \n\nWe luckily got there just before the big dinner rush started, so we were seated promptly, and were given free glasses of wine to have while waiting.  \n\nAmbiance is nice in general decor.  A bit dark for my personal liking, and when it gets busy it gets fairly loud and warm inside.  But the food makes up for that.\nWaiter/Waitresses were amazing, very gracious and made sure we were happy, without being annoying (i dont think much of waiters who ask you how everything is every minute...).\n\nFor the two of us, the total came out to just over $50.  A little pricey, but worth it.\nWill i come back here?  Definately!\nWill i reccomend it to friends and family?  Definately!", "rating": 4, "date": "2011-09-12"}, {"excerpts": ["But the portions on both the Halibut Parmesan and Fillet of Sole Newburg were enormous, and between the former's tub of irresistible tartar sauce and the latter's super-rich cream sauce, we couldn't even finish everything (fortunately they're used to this, and are quick to offer you a compostable take-home box).  ", "And did I mention it was all damn tasty? ", "(Although the clam chowder is really no match for the crab bisque).  "], "author": "Wes M.", "review": "There's nothing like walking along the coast on New Year's Eve, watching the wispy light of the old year fade away over the horizon, letting the sea breeze wash the Christmas insanity out of your mind as you prepare for National Forget Your Family Exists Month (aka January).  And it's even better if you can warm yourself up afterward with a hearty seafood dinner.\n\nEnter Pacific Cafe, just a short stroll from the Lands End Trail.  I've never heard anyone mention it before, but seeing as they open at 5 and every booth in the exceptionally cozy interior is full by 5:01, I think we have to add this to the ranks of high-demand, low-capacity seafood cult classics a la Swan's Oyster Depot or the Marina's Pacific Catch, albeit a better-kept secret than most.\n\nWe ended up waiting an hour for a table, which would normally dock them a star, but when you can sit on a sidewalk bench with a glass of free chablis, the minutes just seem to float on by.  Nor do I freely hand out 5 stars at this price point ($20+ for most dishes).  But the portions on both the Halibut Parmesan and Fillet of Sole Newburg were enormous, and between the former's tub of irresistible tartar sauce and the latter's super-rich cream sauce, we couldn't even finish everything (fortunately they're used to this, and are quick to offer you a compostable take-home box).  And did I mention it was all damn tasty? (Although the clam chowder is really no match for the crab bisque).  In short, I think I've finally found the perfect indie-yet-unpretentious spot for seafood, and it even feels like you get your money's worth.\n\nPS: once again a restaurant with \"Pacific\" in the name has a decor that strikes me as remarkably Seattlesque (see also Moki's Pacific Grill).", "rating": 5, "date": "2010-01-01"}, {"excerpts": ["The Halibut Parmesan is to die for.\n", "The Calamari in the Calamari Vinaigrette was perfectly cooked, maybe a little too heavy on the sauce, but I'm not complaining.\n", "I had the Crab Cocktail. ", "There was a generous portion of fresh, briny Dungeness there.\n", "The side dishes are a little hit-or-miss. ", "The Roasted Potatoes are really just steamed potatoes. ", "The fries are randomly either great or soggy. ", "The rice pilaf is the safe choice."], "author": "R W.", "review": "I love this place.\nFirst, the atmosphere: This place is totally non-pretentious. Nice, mixed crowd.\nThey give you free wine(!) while you wait for your table. \nThe service is impeccable. The servers know just when to show up and refill etc.\nThe food:\nThe Halibut Parmesan is to die for.\nThe Calamari in the Calamari Vinaigrette was perfectly cooked, maybe a little too heavy on the sauce, but I'm not complaining.\nI had the Crab Cocktail. There was a generous portion of fresh, briny Dungeness there.\nThe side dishes are a little hit-or-miss. The Roasted Potatoes are really just steamed potatoes. The fries are randomly either great or soggy. The rice pilaf is the safe choice.", "rating": 5, "date": "2010-08-16"}, {"excerpts": ["Meal Highlights: \n\nHalibut parmesan - WOW the boom!\n"], "author": "Kristina A.", "review": "Pacific Café is constantly good! \n\nIt was actually the first place that my fiancé' took me too for dinner. It was really cute as I had never been and well, we can see that it turned out well and we eventually went on more dates and now we are getting married! All because of Pacific Café! Ok, maybe not but really the food is good and I'm a seafood snob. Nothing fancy pants just greatly prepared with simple ingredients and FRESH good quality seafood. \n\nThey offer free wine if you have to wait for a table. The service is friendly and fast and the specials are always good. Every dish comes with a soup or salad (none of this ala carte stuff). \n\nMeal Highlights: \n\nHalibut parmesan - WOW the boom!\nOyster cocktail - Another wow!\nSpicy red snapper - so fresh and juicy\n\nNoteworthy or useless information from me: It's not the hipster hangout and you can't walk to a night club from it. You like won't find marina moguls here, nor will you spot Hayes hipness. But it's been there for over 35 years!", "rating": 5, "date": "2010-04-16"}, {"excerpts": ["I do not like their Halibut parmesan, as well as some things that I can make at home that I never order there, such as the salmon and the spicy snapper! ", "The rice and the fries are not good, but the steamed potatoes are good and honestly how can you fuck them up! "], "author": "Maddy S.", "review": "There is nothing fancy and nothing creative here, but the food is usually good, and the service is normally friendly, except for one asshole who works Saturday nights. (there are two who look alike, the slimmer whiney one with shorter hair is the asshole!!)  \n\nWHAT I LOVE: I love their calamari steak, because I do not Meunière anything at home! Their crab cakes are really great! I sometimes ask for their scallops sautéed instead of fried and they come out absolutely orgasmic! Their free Caesar salad that comes with the meal is really good; I also add anchovies! Their Petrale Doré is OK... I look forward to their sand dabs season! Their muscles and/or clams are usually good. Their Calamari cocktail is really low fat and delicious! Their fried oysters, and their seasonal crab are good too!\n\nWHAT I REALLY LOVE: two people can eat good food, tip, and drink lots of wine for under $50/$60 \n\nI miss their lobster tail! \n\n\nWHAT I DO NOT LIKE (MAYBE EVEN HATE): I do not like their Halibut parmesan, as well as some things that I can make at home that I never order there, such as the salmon and the spicy snapper! The rice and the fries are not good, but the steamed potatoes are good and honestly how can you fuck them up! Their steamed broccoli tastes like it was marinated in clarified butter for weeks (seriously!)\n\n\nYou feel as if you stepped into the seventies when you walk in. does anyone still do newburg? They give you free wine while you wait, and they will gladly sub red if you're not a white drinker... \n\nOn the very rare occasions you do not wait for what feels like days, they still give you a complimentary glass of wine! \n\nAgain: There is nothing fancy and nothing creative here, but the food is usually good, and the service is normally friendly & professional --unless you get that asshole as your waiter! and honestly even the \"asshole\" is quite efficient!\n\nTHEY GET AN EXTRA STAR BECAUSE: MOST of their employees have been there for over 10 years--some even twenty! MEANING: the owner(s) must be great people to work for!  EXACTLY the kind of establishment I would like to support!", "rating": 4, "date": "2009-05-23"}, {"excerpts": ["i usually get the halibut parmesan w/red potatoes, and the salmon bisque.  ", "i also occasionally get the crabcakes or the petrale dore stuffed w/crab.  ", "may be a good idea to ask your server if the entree that you've ordered has bones in it.  "], "author": "Ting A.", "review": "'where'd i park my car?'\n'i don't remember what i ate.'\n'did we pay??'\n\n- - typical things stephen and i will say to each other, the day after a pacific cafe evening.  \n\nwe like to wait outside, wine in hand, watching the stray cats lingering around the side entrance for scraps.  one evening, there was a noisy raccoon nearby...  after a couple of glasses of wine, i addressed two couples who were also waiting outside...  'do you think that that raccoon is hungry or horny?'  ...yeah.  well hey, one couple responded to my mild outburst.  we've become friends since that evening.\n\ni'm a fan of this place.  i'm protective of this place.  some people take advantage of the free wine.  drunk, i once thought that a guy w/a short mohawk, who walked up the street, followed a couple of people in to get some free wine.  the following conversation ensued:\n\nme (to stephen):  (shocked)  he's just here for the free wine!!\nstephen:  really?  how do you know?\nme:  i KNOW.\n(i follow the guy inside, to where the sign-in sheet is.)\nme (to guy):  yknow, you have to write your name in to get seated.\nguy:  yeah, i'm just looking to see where i am on the list.\nme:  (pauses, looks at list):  where are you?\nguy:  (points to the last name on the list):  here.\nme:  (pauses again.)  you sure that's you?\nguy:  yeah.\nme:  (pauses again.)  ok.  (i walk away, still looking at him, as if to say, 'i've got my eye on you, foo.')\n\noh, the things that are said at pacific cafe.  you'll laugh, you'll cry, you'll get into arguments, and apparently, you may even harass patrons (who may not be patrons).\n\nthe lights that greet you as you walk through the door cast a reddish hue on the patrons, old paintings, and seafood dinners in this quaint restaurant.  one needn't be worried about looking a little pink in the face from all the wine.  - - the lights are a perfect disguise!\n\npacific cafe has the friendliest staff you'll ever meet.  roy's always very engaging; he's becoming my pseudo-uncle.  reny, laura, and aubrey are also very pleasant.  i DID have a sour evening w/a certain gentleman who gave us a hard time about wanting to order veggie entrees (for a change, since we come here so often).  at the end of our meal, he boxed up my leftovers in a sizable oyster bucket.  i thought that this was very inappropriate.  though, since then, i haven't had anything to complain about.\n\nthe food is pretty good.  i usually get the halibut parmesan w/red potatoes, and the salmon bisque.  i also occasionally get the crabcakes or the petrale dore stuffed w/crab.  may be a good idea to ask your server if the entree that you've ordered has bones in it.  - - trying to debone a fish while tipsy can be a little difficult.\n\n**my only criticism is that i wish that they had some sort of seafood pasta dish.  also, for regular pacific-cafe-goers, it'd be nice to have a weekly special.\n\notherwise, it's a great place to bring your significant other, your friends, and out of town guests.  cheers to pacific cafe!", "rating": 5, "date": "2008-09-23"}, {"excerpts": ["Otherwise, great halibut parmesan, good trout, fresh scallops. ", "Also love the crab cocktail. \n", "Service is usually great. ", "Attentive waiters, timely service. ", "Price is reasonable for good seafood. ", "Parking is a pain. ", "The wait can get long. ", "So I'd recommend going on a weeknight or going early on the weekends."], "author": "Jessie C.", "review": "It's amazing how free wine can make the wait for this restaurant so bearable. Pacific Cafe serves up great American style seafood. The food is simple, but filling and worth the wait. \n\nThings to note:\n1. They don't take reservations, but they totally make up for this by offering free wine while you wait. And the longer the wait, the more refills you get. It's just table wine, but wine is wine, and after my second glass I don't even realize that I've been waiting 30 minutes for my table.\n2. Entrees come with a salad or soup. You can choose from their clam chowder or, my favorite, a shrimp louis salad. And it comes with lots of shrimp for a side salad that is included in the meal. \n\nI have tried most of their dishes, but the only one that I didn't like was the Ahi tuna steak. It was a bit overcooked for my taste. Otherwise, great halibut parmesan, good trout, fresh scallops. Also love the crab cocktail. \nService is usually great. Attentive waiters, timely service. Price is reasonable for good seafood. Parking is a pain. The wait can get long. So I'd recommend going on a weeknight or going early on the weekends.", "rating": 5, "date": "2008-03-25"}, {"excerpts": ["My companions and I may be boring, but go with what we love; we all order the halibut parmesan, and I order it with a side of steamed broccoli.  ", "With a little lemon and some tartar sauce, that piece of fish is as good as a steak (well not  exactly, but i would imagine so if I was a pescatarian, which one of my companion was).   ", "The crusty goodness is delicious and only heightened by the lemon.  ", "Mmmmmmm...I'm looking forward to my leftovers!  "], "author": "Marie B.", "review": "In terms of seafood restaurants, Pacific Cafe is as good as it gets...and this is coming from a non seafood eating person.  I love that it's decor is all original from it's opening in 1974, homey feel and family friendly.  Service is great--greeted with a free glass of chilled white wine as you wait by a smiling friendly host.  The servers are attentive and friendly as well. \n\nSo, again, I'm no seafood lover by any means, so the fact that I've gone to this restaurant twice in the last two years say a lot.  The sourdough bread they serve is usually still toasty and lovely, that my party and I can eat two baskets full no problem.  Every entree is served with a soup or salad and a side of rice, potatoes or veggies of the day.  My companions and I may be boring, but go with what we love; we all order the halibut parmesan, and I order it with a side of steamed broccoli.  With a little lemon and some tartar sauce, that piece of fish is as good as a steak (well not  exactly, but i would imagine so if I was a pescatarian, which one of my companion was).   The crusty goodness is delicious and only heightened by the lemon.  Mmmmmmm...I'm looking forward to my leftovers!  And that's another thing, the portions are generous.  \n\nGo to Pacific Cafe for simple, no frills, well seasoned seafood and exceptional service.  I might have to take my non seafood, hamburger eating boyfriend once for a change of pace.", "rating": 5, "date": "2008-10-07"}, {"excerpts": ["Recommend the halibut parmesan!"], "author": "Amanda W.", "review": "Great service, great food, and the price wasn't bad.   Recommend the halibut parmesan!", "rating": 5, "date": "2013-05-08"}, {"excerpts": ["My friend had the halibut parmesan. "], "author": "Kari N.", "review": "Awfully disappointing.\n\nPetrale sole newburg tasted same as frozen dinner or what you get at Country Buffet. The cream sauce has no taste and quite disgusting actually, the fish was mushy, and the crabmeat stuffing, like I mentioned, tasted frozen and in fact was still cool. My friend had the halibut parmesan. The haibut was extremely dry and the parmesan crust did not complement the fish at all. \n\nAlso had fried scallops for appetizer, which was good. The scallops were just a little underdone - the way they should be. And the ceasar salad that came with the entree had the option of anchovies, which was nice.\n\nFor all its hype and price (~$25 per dish that tasted and looked like cafeteria food) and the usual long wait, not worth it at all, and thankfully, I have tried it and there is no need to go back.", "rating": 1, "date": "2009-05-22"}, {"excerpts": ["our entrees were the halibut parmesan and turbot baked in parchment paper with shrimp and crab. ", "while both were tasty, my halibut parmesan stole the show. "], "author": "Sheri N.", "review": "the complimentary wine eases the edge of hunger pangs and the wait for a table. normally i'm not a white wine person, but their chardonay was tasty enough. the restaurant has an old san francisco feel as it is made of great wood workmanship from the tables to the booths. \n\nthe food is simple and delicious. we shared a half order of the crab cakes. they were out of this world, and a must order. i had their salmon bisque and the bf had the shrimp louie salad as our starters, and both were great. our entrees were the halibut parmesan and turbot baked in parchment paper with shrimp and crab. while both were tasty, my halibut parmesan stole the show. we ended the meal with the chocolate torte. \n\nwe were so stuffed by the end of it all we didn't have room for a post-dinner cocktail.", "rating": 5, "date": "2009-09-25"}, {"excerpts": ["My favorite is the halibut parmesan with a shrimp louie salad.  ", "Expect a long wait, but to compensate you for your time you get free wine.  ", "This is a great place to go to have a great conversation in a fun atmoshpere.  ", "The service is fantastic and the people are friendly.  ", "I am a loyal customer and have always been completely satisfied."], "author": "Jessica B.", "review": "I LOVE this restraunt!!  The seafood is amazing.  My favorite is the halibut parmesan with a shrimp louie salad.  Expect a long wait, but to compensate you for your time you get free wine.  This is a great place to go to have a great conversation in a fun atmoshpere.  The service is fantastic and the people are friendly.  I am a loyal customer and have always been completely satisfied.", "rating": 5, "date": "2007-12-04"}, {"excerpts": ["the halibut parmesan is unique and totally amazing.  ", "the petrale dore with capers and mushrooms was the thing i had this week ", "and it was full of the tangy lemon caper flavors...  "], "author": "dan h.", "review": "finally made it back here with some friends that live in the area.  haven't been to this place for ages.  was craving fish.  i used to live in the richmond and back then i would go there all the time.  even back when i lived in North Beach, this was one of the few places that we would drive across town just to go to.  there are a lot of good food places in the richmond but this is one of the few that you'd actually travel to go to. \n\nthey serve - as you can probably discern from the name - almost exclusively fish.  come here for the fish and that's about it.  they have about a half dozen grilled fresh fish specials that they put on a blackboard on the front of the restaurant.  presumably a blackboard is their main menu because it changes with whatever is fresh that day.  usually there's a tuna, a snapper, a halibut, etc.... but i like their prepared dishes the best.  the halibut parmesan is unique and totally amazing.  the petrale dore with capers and mushrooms was the thing i had this week and it was full of the tangy lemon caper flavors...  one other tip, even though you may be tempted to keep it healthy by having the salad to start, the soup is incredible! \n\nyou also go there for the historic feel.  the restaurant has that old wood / old world feel.  they have pictures of old San Francisco all over - including my personal favorite: a picture from 1908 of what is approximately Geary and 32nd avenue looking west!  which is about exactly where you'd be standing if you were looking at the picture.  oddly enough, there were some roads and houses in the richmond even back then.  the place opened in 1974 on July 4, so they have entered their 35th year.  \n\nand to add to the homey, historic, catch-of-the-day feel - they don't take reservations.  you need to wait (sometimes up to 45 minutes on the weekend) to get your table.  but don't fret, there's a nice waiting area and benches outside and they hand out free wine for those that are waiting.  when you sit down, you'll notice that almost all the wines on the menu are white and they are all very, very cheap.  everyday white table wine is the rule to go with your catch-of-the-day.  and when you're done, you can always head down the road to Trader Sam's for a boat drink in a foo-foo glass with an umbrella and put some Jimmy Buffet on the juke box.  :)", "rating": 5, "date": "2008-10-16"}, {"excerpts": ["Thats ok -- when I have my Halibut Parmesan with broccoli after seven glasses of Franzia I'm doing juuuuust fine."], "author": "David A.", "review": "I used to live on 40th and Geary, which luckily was easy walking distance.   I visit this place every time I come back to SF.  When riding the 38 home, if there wasn't a line, I immediately got off the bus on 36th.  Loved this place.  Yes, the seafood is simple -- but it's perfectly prepared and very very consistant.  Nothing fancy, and as reviews in the papers have said for years, the waitresses are \"salty\"; hey that's the charm.  If I want fancy and overpriced and STILL get attitude I'll eat downtown.  Thats ok -- when I have my Halibut Parmesan with broccoli after seven glasses of Franzia I'm doing juuuuust fine.", "rating": 5, "date": "2007-08-18"}, {"excerpts": ["The Halibut Parmesan is freaking amazing! ", "I had never had it before I tried it here "], "author": "Aaron F.", "review": "This place is like stepping back in time ... to a fish restaurant of days gone by. I dont think the menu has changed much since they opened in 1974, luckily there are a few real gems on it!\n\nA welcoming, unpretentious old san francisco atmosphere and veteran servers greet you with as much cheap white wine as you can guzzle before you are seated. The booths are comfortable and feel somewhat intimate - great for either a date or a few good friends.\n\nSome of the dishes I have had have been just OK, but the following makes up for it:\n\nThe Halibut Parmesan is freaking amazing! I had never had it before I tried it here but I come back regularly just for this dish.\n\nWhen they have it, the Crab Bisque is fantastic in all of its calorific glory!\n\nGreat sourdough bread to soak up the wine before food arrives!\n\nCome here for good seafood traditionally prepared and good times over several glasses of wine. \n\nDon't come here for a salad, or vegetables or anything that doesnt involve a giant slab of fish!", "rating": 5, "date": "2008-01-29"}, {"excerpts": ["the first time we went we had a delicious dinner; crab cakes and the halibut parmesan coupled with clam chowder and a yummy shrimp louie salad. ", "it was delecious!  ", "we felt that that prices were fair too average around $25/per person (included a glass of wine and soup/salad) we went back last night and thought we'd try something else. ", "i had the ahi with wasabi butter which was very bland. ", "no taste at all.  ", "my husband had the sole stuffed with crab which  tasted like mush. ", "we were pretty disappointed in both dishes..which makes me wonder if anything else is good besides the crab cakes and halibut. ", "you can't experiment with different dishes at this place. ", "stick to what is known to be excellent ", "and you'll have a nice dinner."], "author": "SF Native M.", "review": "we have been twice. the first time we went we had a delicious dinner; crab cakes and the halibut parmesan coupled with clam chowder and a yummy shrimp louie salad. it was delecious!  we felt that that prices were fair too average around $25/per person (included a glass of wine and soup/salad) we went back last night and thought we'd try something else. i had the ahi with wasabi butter which was very bland. no taste at all.  my husband had the sole stuffed with crab which  tasted like mush. we were pretty disappointed in both dishes..which makes me wonder if anything else is good besides the crab cakes and halibut. you can't experiment with different dishes at this place. stick to what is known to be excellent and you'll have a nice dinner.", "rating": 3, "date": "2009-09-29"}], "salmon  crab newburg": [], "calamari steak": [{"excerpts": ["Calamari steak: the highlight. ", "I don't think I've had more tender calamari. ", "My husband said the flavor reminded him of pancakes ", "lol ", "I don't know about that ", "but it was delicious. ", "Broccoli side comes as whole crown steamed.\n", "Parmesan halibut: great crust, simple, good.\n", "Blackened snapper: the Cajun flavor overpowered the fish but still good. ", "The rice is like big pilaf, perfect side.\n", "Random: bathroom is clean, bigger than expected, updated it seems."], "author": "Grace P.", "review": "We had a great time here. They make it a point to be gracious even though everybody working is busy running around. We arrived 20 minutes after they opened and there was already a restaurant full of people dining and 12 names ahead of us on the waiting list. \nShrimp cocktail: mini shrimp, be aware.\nClam chowder: not creamy, small bits of clam and tender celery, warmed us up after waiting an hour outside.\nCalamari steak: the highlight. I don't think I've had more tender calamari. My husband said the flavor reminded him of pancakes lol I don't know about that but it was delicious. Broccoli side comes as whole crown steamed.\nParmesan halibut: great crust, simple, good.\nBlackened snapper: the Cajun flavor overpowered the fish but still good. The rice is like big pilaf, perfect side.\nRandom: bathroom is clean, bigger than expected, updated it seems.", "rating": 5, "date": "2017-10-29"}, {"excerpts": ["The soups are really good and so is the calamari steak. ", "The wine is good while u are waiting for a table"], "author": "Ryan W.", "review": "Love this place. The soups are really good and so is the calamari steak. The wine is good while u are waiting for a table", "rating": 5, "date": "2018-06-16"}, {"excerpts": ["We wanted to start off by sharing an order of sautéed and pan-fried calamari steak. ", "Since it appeared in the menu only as a dinner entrée ($18.75), my server cleverly suggested ordering the entrée without the sides and she knocked $6.00 off from the entrée price. ", "Sounded like a deal! ", "Calamari is relatively cheap, in abundant supply and ecologically sustainable. ", "PC's calamari was first pounded, egg washed and batter dipped and lightly fried to give the calamari a golden brown crust. ", "In spite of its tough or rubbery reputation, the texture of PC's calamari was so super tender that a fork was all you needed. ", "Coupled with the lip-smacking egg batter, the tender steak earned a well deserved 5 stars. "], "author": "Geoff G.", "review": "A close friend who travels on board cruise ships as the boat doc once recommended this low key, low profile restaurant. He was very specific. \"I have traveled around the world many times and I'll dare say their Petrale Sole is one of the best I had anywhere.\" I have to try PC, as I can't ignore my doc's orders! The restaurant was not fancy schmancy. In fact, it was basically no frills and down-to-earth.... like starting dinner off with a boring loaf of sourdough with plain ol' butter. The quaint exterior of the building gave PC a charming and old-fashioned appearance, shrouded occasionally by the enveloping fog. The interior is congested with many tables and antique booths tightly jammed in every nook and cranny. It did exude a cozy and welcoming aura once you step inside not to mention the cool glass of complimentary white wine in your hands for having to wait for a table.\n\nI was amazed as to how simple the menu was. There were only three basic styles of cooking.... Baked or grilled or pan-fried.  Add in a couple of soups and salads and there you have it, the whole menu of PC in a nutshell.\n\nWe wanted to start off by sharing an order of sautéed and pan-fried calamari steak. Since it appeared in the menu only as a dinner entrée ($18.75), my server cleverly suggested ordering the entrée without the sides and she knocked $6.00 off from the entrée price. Sounded like a deal! Calamari is relatively cheap, in abundant supply and ecologically sustainable. PC's calamari was first pounded, egg washed and batter dipped and lightly fried to give the calamari a golden brown crust. In spite of its tough or rubbery reputation, the texture of PC's calamari was so super tender that a fork was all you needed. Coupled with the lip-smacking egg batter, the tender steak earned a well deserved 5 stars. I was told the abalone was prepared much the same way but at $45 a pop, I'd rather stick with calamari and try my luck at diving for abalone off the Mendocino coast!\n\nPetrale sole ($24.95), a Pacific Coast fish, is prized for its delicate, mild and sweet flavors. The fillets were quickly sautéed and pan-fried with a sauce of white wine, shallots, butter and herbs. PC then plated the fillets with sautéed button mushrooms, a sprinkling of capers and a gentle squeeze of lemon. The sauce wasn't overwhelming so I can still taste the natural flavor of the fish. Even though the prep sounded so simple, I can't somehow make it to taste this good at home! The carb of choice was rice pilaf that tasted exquisite like fried rice and good to soak up the excess sauce.  I guess my doc was right about the sole, though I think I had better elsewhere. (4 stars). Besides, the calamari had the edge! \n\nThe Spicy Red Snapper ($20.68) didn't have the \"wow\" flavor I'd hoped for but my wife said it was still a keeper in the menu.  I personally think that the fish was a tad over grilled and the meat a little drier than I would like. It was labeled as spicy but not in any true sense of the word. The outer crust of the snapper had a robust, tangy char of some kind of mixed Cajun spices and herbs, cayenne pepper perhaps being the most discernable. (3.5 stars). The red snapper's meat was a little firmer and did not have the melt-in-your-mouth quality like the sole.\n\nAll in all, a great seafood place.... the price is right; the food is unpretentious and seafood perfectly executed. I just love old established restaurants like this one.  Parking can be a challenge in this neighborhood.  No reservations are taken and the system is kinda funky and disorganized. A lady comes around to take your name without writing it down and then pours you a glass of white wine!", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["The only other really noteworthy dish was the calamari steak, nothing I've ever seen before, a giant thin steak of pan fried calamari. ", "Extremely tender and the right amount of chewyness. ", "I could tell the restaurant was filled with locals, but if you are nearby you should def stop by!"], "author": "Angie H.", "review": "Pricey, but worth. Just an all in all good seafood place. Went with family so I got to try a little bit of everyone's. Sourdough bread and butter sitting on the table when we got there and there's also COMPLEMENTARY WINE. Each entre comes with soup or salad and then your choice of sides. The clam chowder was interesting, there was no cream in it but it was still good. I ordered the crab cake appetizer, large patties of crab, add some lemon and tartar sauce and it's perfection. The only other really noteworthy dish was the calamari steak, nothing I've ever seen before, a giant thin steak of pan fried calamari. Extremely tender and the right amount of chewyness. I could tell the restaurant was filled with locals, but if you are nearby you should def stop by!", "rating": 5, "date": "2016-03-14"}, {"excerpts": ["We love the rainbow trout and fried calamari steak, so good!!"], "author": "Kimberly J.", "review": "Sure the food is not new and exciting, but that's what I love about this place.  It's traditional seafood - pick your fish or shellfish, soup or salad, side of rice or potatoes - done.  The seafood is fresh and delicious and the price is not outrageous.  They give you a free glass of wine while you wait and the service is always wonderful.  We love the rainbow trout and fried calamari steak, so good!!", "rating": 5, "date": "2017-06-25"}, {"excerpts": ["The petrale sole and calamari steak are so delicious", ", I can't bring myself to try anything else. ", "Entrees come with a complimentary glass of wine and their yummy shrimp salad. ", "One of my fave seafood restaurants."], "author": "Debbie N.", "review": "I love this restaurant, but no reservations so you have to get there early. The petrale sole and calamari steak are so delicious, I can't bring myself to try anything else. Entrees come with a complimentary glass of wine and their yummy shrimp salad. One of my fave seafood restaurants.", "rating": 5, "date": "2017-05-21"}, {"excerpts": ["Calamari steak was blend and greasy. \n", "Ahi tuna no flavor and expensive, had to wash it down w a glass of wine\n", "Whole Crab was not the freshest and expensive $32\n", "Difficult to find parking, took 15 min to find a spot-a block away.\n", "Seating/table were small \nClam chowder was mediocre"], "author": "Ash M.", "review": "I have no idea how this place got 4 star ratings!  I searched for steak and seafood and this place came up. Only one steak item was listed on the menu, I felt mislead.  This is my experience on a $120+ meal for 4 people (the other one had soup and salad only)\n\nPro\nFree glass of wine \nLobster bisque was excellent \nGood salad\nGood service\nFree water\n\nCons\nCold bread they warmed it up upon request.\nCalamari steak was blend and greasy. \nAhi tuna no flavor and expensive, had to wash it down w a glass of wine\nWhole Crab was not the freshest and expensive $32\nDifficult to find parking, took 15 min to find a spot-a block away.\nSeating/table were small \nClam chowder was mediocre", "rating": 2, "date": "2014-01-03"}, {"excerpts": ["Most of the time we order the calamari steak and the fried oysters with their new england clam chowder. "], "author": "RJ C.", "review": "We come here at least 3 times a month when we are in town. Most of the time we order the calamari steak and the fried oysters with their new england clam chowder. On special occasions we order the abalone steak and when they have it the diablo whole crab is the best. There's no reservations but you get free house red/white wine will you wait. This place is a institution in San Francisco's Richmond district.\nAnd when you are there say hi to Roy who's always got that welcoming smile as he hands you a glass of wine!", "rating": 5, "date": "2014-05-05"}, {"excerpts": ["There is a regular menu which serves things like calamari steak, dover sole, fried oysters, etc.  ", "Prices are in the high teens.  "], "author": "Robert J.", "review": "We've been coming here for over 30 years, ever since my wife's aunt and uncle introduced us here.  It is an unpretentious place without the high tech decorations or the thumping music.  You won't find Michael Bauer or any of the nouveau restaurant critics here.  Most of the patrons are baby boomers and older that enjoy the service, food, and general relaxing atmosphere.\n\nThere is a regular menu which serves things like calamari steak, dover sole, fried oysters, etc.  Prices are in the high teens.  They also have daily specials written on a chalkboard and for those that have a hard time seeing, they bring a miniature chalkboard to the table.\n\nFree white wine is provided while waiting and some people that is a good selling point.  I enjoy this place even w/o the wine as I never drink any of it. There is a wait during busy times such as weekends, but I find that dining on the weekdays is the best time.  Boudin french bread is served and if you eat it all, the staff gladly brings you more.\n\nI generally start with a shrimp salad with a thousand island type dressing.  You could also have it w/o the shrimp as both are served on chopped romaine lettuce.  I enjoy the taste of the salad dressing as it is tangy w/o being overpowering. I've had just about everything on the menu and I crave the sand dabs when they have it.  You have to de-bone it, but there is an art to it and is part of the dining experience.  Rice pilaf or red potatoes are options that provided\n\nThe staff is very attentive and seem genuine.  Our bill is usually about $50+ for two.  When we have out-of-town guests, we bring them here and they enjoy it.  This is our go to place for seafood and a relaxing dining experience.", "rating": 5, "date": "2013-10-06"}, {"excerpts": ["I had the calamari steak, which was buttery and good for the first several bites. ", "After I ate about 1/3 of it I felt like it was too much for me ", "and I couldn't finish it. ", "Even with the potatoes between bites, I felt like it was too much of the same taste. ", "Maybe in small bits in moderation, or with half the calamari steak with something else it would've been better.\n\n"], "author": "Catherine M.", "review": "Breakdown (I saved my receipt so I can share with the yelp community):\n\n-Calamari Steak w/ Salad & shrimp--$16.75\n-Spicy Snapper w/ Salmon Bisque--$18.68\n\n[Dessert]\n-Coffee-$2 \n-Chocolate Mousse Cake--$5.25\n---------------------------------------------------------------------------------------------\n($46.74 for two with tax, before tip)\n\nSo the actual reason why I wanted to go here was because I saw Rachel Ray made a big deal about how wonderful this spot was. Yes there was complimentary wine while you wait which is a very smart business tactic though I don't drink alcohol so it didn't do much for me. My partner and I were the youngest ones here, the demographics are mostly older caucasian couples. The atmosphere is very nostalgic, lots of historical photos on the walls. Service is friendly and i was surprised with how quick our dishes came. Parking is kind of an issue, keep in mind this is the Richmond District. \n\nFood: liked the salad w/ shrimp and the salmon bisque. Didn't try the spicy snapper because I can't handle spicy food. It was even spicy for my partner, who's Indian. He liked it though he preferred to have the spices mostly marinated, he felt like it was mostly sprinkled on top for an extra kick. I had the calamari steak, which was buttery and good for the first several bites. After I ate about 1/3 of it I felt like it was too much for me and I couldn't finish it. Even with the potatoes between bites, I felt like it was too much of the same taste. Maybe in small bits in moderation, or with half the calamari steak with something else it would've been better.\n\nThe chocolate cake and coffee was very good though I felt a little rushed because the amount of people waiting made me feel guilty. It was very busy even though it was a Wednesday night!\n\nAll in all it was a good place and experience, though I feel like it's more of a restaurant my parents would love rather than myself. They are way more into seafood, wine, and that atmosphere than I am.", "rating": 3, "date": "2009-10-02"}, {"excerpts": ["and I had the CALAMARI STEAK. ", "Both seafood dishes came with a choice of rice, mashed potato or french fries ", "They were really delicious and seasoned well. ", "I didn't finish my calamari steak because I HAD to eat dessert.  ", "BF and I splurged. ", "I went to the restroom and when I returned a CHOCOLATE TORTEhttp://www.yelp.com/biz_photos/ZiTRspDPY9T_kh4tQDwDMQ?select=lckLBs-kMUdX2yH3qZFVQA and MITCHELL'S CARAMEL PRALINE ICE CREAM  ", "http://www.yelp.com/biz_photos/ZiTRspDPY9T_kh4tQDwDMQ?select=KMl91uoJVj2hLxL1mKujUQ waiting for me.  ", "BF finished the torte and our spoons fought over the ice cream.  ", "My gosh, soooo delicious! ", "(Forget about being lacto. ", "(I didn't get a chance to take pictures of the PARMESAN HALIBUT AND CALAMARI STEAK. ", "We just attacked them as soon as the server placed them in front of us!)"], "author": "Leah E.", "review": "CHECK, PLEASE! BAY AREA: SEASON 2: EPISODE 6 (206)\n\n4.5 STARS \n\nJuly 11, 2009 @ 7pm, Saturday Date Night with Boyfriend\n\nSaturday nights dates are really important for me and my boyfriend.  It is our time at the end of the week to catch up and just enjoy each other. It's more than going out, it is friendship and keeping that \"flame\" going.  \n\nSo this Saturday was another opportunity. We just wanted a nice, relaxing and laid-back dinner after a really exhausting work week. Pacific Cafe was the perfect place.  It was homey and unpretentious. People were casually and warmly dressed for the cold Richmond district weather . \n\nThis restaurant has been around since 1974 and as San Francisco as you can get--local, friendly and specializing in seafood.  The decor was nostalgic--very 70's. \n\nTrue to its tradition, we were offered a FREE GLASS OF WINE each while waiting for a table.  You just walk in, put your name on the clipboard and find a seat either inside the waiting area huddled with other patrons. We didn't mind since it was nice to be cozy in this cold weather--or sit outside of the restaurant and start a friendly conversation with others who are waiting for their table.\n\nSince BF does not drink, so I got 2 glasses of nice Chardonnay. (Woo Hoo!)  The staff came out to REFILL our glasses but 2 glasses of wine are pretty much all I can handle.\n\nIt didn't take us long to get seated at one of the wooden booths, probably about half an hour. We enjoyed looking at the memorabilias  (like how much food cost in 1974) and sipping wine while waiting.  A basket of sourdough bread was waiting for us at our table. We devoured it and we got another basket as soon as  we finished the first one.  The service was superb and very attentive. \nhttp://www.yelp.com/biz_photos/ZiTRspDPY9T_kh4tQDwDMQ?select=mQFbFnJXxAcsBUFgSISOrw\nFor appetizers we ordered a CRAB COCKTAIL.   It was a huge scoop of packed fresh crab meat with cocktail sauce. Delicious!\n\nOur entrees came with either soup or salad.  I had the SALMON BISQUE and BF had the CLAM CHOWDER.  Let me just say that it was the best fish soup I've ever had!  Not fishy but creamy and really flavorful. BF loved his clam chowder which was not overly rich.\n\nFor our entrees, BF had the PARMESAN HALIBUT and I had the CALAMARI STEAK. Both seafood dishes came with a choice of rice, mashed potato or french fries They were really delicious and seasoned well. Tender and not tough or dry.\n\nI didn't finish my calamari steak because I HAD to eat dessert.  BF and I splurged. I went to the restroom and when I returned a CHOCOLATE TORTEhttp://www.yelp.com/biz_photos/ZiTRspDPY9T_kh4tQDwDMQ?select=lckLBs-kMUdX2yH3qZFVQA and MITCHELL'S CARAMEL PRALINE ICE CREAM  http://www.yelp.com/biz_photos/ZiTRspDPY9T_kh4tQDwDMQ?select=KMl91uoJVj2hLxL1mKujUQ waiting for me.  BF finished the torte and our spoons fought over the ice cream.  My gosh, soooo delicious! (Forget about being lacto. My suffering later was worth the creamy bisque and Mitchell's ice cream!)\n\nWhen we got the tab, we were surprised that our tab was only $84 Iincluding tax and tip! That was after splurging and satisfying our voracious appetites!\n\nThe food at Pacific Cafe was simple but comforting and delicious. We really enjoyed our dinner. \n\nI wanted to drive straight to Ocean Beach to catch the sunset but I was too full, still too exhausted from the week before. BF and I went straight home where I passed out for the 3rd night in a row while he watched \"The Unborn\"-- a creepy, scary movie. Thank God I was out like a light or I would have had nighmares for a week!\n\n(I didn't get a chance to take pictures of the PARMESAN HALIBUT AND CALAMARI STEAK. We just attacked them as soon as the server placed them in front of us!)", "rating": 4, "date": "2009-07-12"}, {"excerpts": ["Petrale sole dore'\ncalamari steak\nturbot, stuffed & parchment baked.\n"], "author": "Clifford L.", "review": "Blast from the past . . .  Check out their photo album while you're waiting for your table!  -and walls are festooned with pics of \"old\" San Francisco and fishing parties.\n\n-and, complimentary white wine. . . a long forgotten touch of hospitality.\n\nOrdering (multiple choices on the daily specials, as well as their 'regular' menu.  Deciding is not easy there.)\n\noyster bisque or clam chowder (or salad)\nPetrale sole dore'\ncalamari steak\nturbot, stuffed & parchment baked.\nEverything comes to the table hot, fresh & flavorful.\n\n+bottomless [FRESH Sourdough] bread basket, water & lemon & tartar sauce . . .\n\n+Mitchell's ice cream, if you still have room for dessert.\n\nIt's kind of touch of home.  mellow yellow to It's all G.\n\nEnjoy", "rating": 4, "date": "2012-01-24"}, {"excerpts": ["My parchment wrapped fish was a nasty soup.\"The fried shrimp and the calamari steak were greasy. ", "It was the food you would expect from a tourist trap, not a local restaurant. ", "Very disappointed."], "author": "Roger C.", "review": "My wife and I have had dinner here a number of times, so we felt safe taking some visitors from Seattle here on Monday night. We were so embarrassed! Well, the bread was good. Maybe, it was because we arrived too soon after they opened. My parchment wrapped fish was a nasty soup.\"The fried shrimp and the calamari steak were greasy. It was the food you would expect from a tourist trap, not a local restaurant. Very disappointed.", "rating": 1, "date": "2015-03-18"}, {"excerpts": ["I'd like to come back, but point everyone towards something like the calamari steak, ahi tuna, or trout.\n\n"], "author": "John H.", "review": "Do not order the Sole in Newberg Sauce with Red Potatoes.  \n\nThis was the greatest disappointment of my life since not getting in to Colgate.  Yes, yes, I know it sounds delicious but what you get is a soupy creamy mess with the crab and parsley just making it worse.  Read the reviews below, and you'll see I'm not alone in calling it out.  \n\nIt's a huge shame, because everything else about Pacific Cafe is super.  Dinner included free wine to compensate for the wait, sourdough bread, and a delicious salmon bisque.  Sounds like the way to go here is avoid anything with sauce.  I'd like to come back, but point everyone towards something like the calamari steak, ahi tuna, or trout.\n\nNot all that expensive when you add it all up.  A couple can eat well here for under $50.", "rating": 3, "date": "2009-04-29"}, {"excerpts": [": I love their calamari steak, because I do not Meunière anything at home! ", "Their crab cakes are really great! ", "I sometimes ask for their scallops sautéed instead of fried and they come out absolutely orgasmic! ", "Their free Caesar salad that comes with the meal is really good; I also add anchovies! ", "Their Petrale Doré is OK... ", "I look forward to their sand dabs season! ", "Their muscles and/or clams are usually good. ", "Their Calamari cocktail is really low fat and delicious! "], "author": "Maddy S.", "review": "There is nothing fancy and nothing creative here, but the food is usually good, and the service is normally friendly, except for one asshole who works Saturday nights. (there are two who look alike, the slimmer whiney one with shorter hair is the asshole!!)  \n\nWHAT I LOVE: I love their calamari steak, because I do not Meunière anything at home! Their crab cakes are really great! I sometimes ask for their scallops sautéed instead of fried and they come out absolutely orgasmic! Their free Caesar salad that comes with the meal is really good; I also add anchovies! Their Petrale Doré is OK... I look forward to their sand dabs season! Their muscles and/or clams are usually good. Their Calamari cocktail is really low fat and delicious! Their fried oysters, and their seasonal crab are good too!\n\nWHAT I REALLY LOVE: two people can eat good food, tip, and drink lots of wine for under $50/$60 \n\nI miss their lobster tail! \n\n\nWHAT I DO NOT LIKE (MAYBE EVEN HATE): I do not like their Halibut parmesan, as well as some things that I can make at home that I never order there, such as the salmon and the spicy snapper! The rice and the fries are not good, but the steamed potatoes are good and honestly how can you fuck them up! Their steamed broccoli tastes like it was marinated in clarified butter for weeks (seriously!)\n\n\nYou feel as if you stepped into the seventies when you walk in. does anyone still do newburg? They give you free wine while you wait, and they will gladly sub red if you're not a white drinker... \n\nOn the very rare occasions you do not wait for what feels like days, they still give you a complimentary glass of wine! \n\nAgain: There is nothing fancy and nothing creative here, but the food is usually good, and the service is normally friendly & professional --unless you get that asshole as your waiter! and honestly even the \"asshole\" is quite efficient!\n\nTHEY GET AN EXTRA STAR BECAUSE: MOST of their employees have been there for over 10 years--some even twenty! MEANING: the owner(s) must be great people to work for!  EXACTLY the kind of establishment I would like to support!", "rating": 4, "date": "2009-05-23"}, {"excerpts": ["I ordered the Calamari Steak and it was delicious.  ", "It was exceptionally good the night I went ", "and I couldn't tell if it was the wine talking ", "but I really enjoyed it.  ", "You get a choice of soup or salad and a side with your order.  "], "author": "Bianca R.", "review": "I enjoyed my time at Pacific Cafe.  You start off with a free glass of wine while you wait.  And if you are there on a busy night, you might end up with 2 or 3 glasses of wine.  Its a small place so you will wait an hour or more.  If you love to drink for free, this shouldn't be a problem.\n\nI ordered the Calamari Steak and it was delicious.  It was exceptionally good the night I went and I couldn't tell if it was the wine talking but I really enjoyed it.  You get a choice of soup or salad and a side with your order.  I choose the Caesar salad, which just a typical Caesar salad, and the rice pilaf, which again was not great but not bad.\n\nOnce you're seated you get a basket of bread.  I kind of wish they would serve you this as you wait because if you're hungry and just drinking wine you can get pretty tipsy until you are seated.\n\nOverall, a fun outing to the Outer Richmond and a place I will visit again.", "rating": 4, "date": "2009-03-12"}, {"excerpts": ["I got the calamari steak and was happy.  ", "The people with snapper and crab cakes were really happy.  ", "As was the person with the fried shrimp.  "], "author": "Lil P.", "review": "You want an old-school, unpretentious seafood place?  This is it.\n\nWe had to wait, and like everyone else, took part in the complementary wine.  It was a nice, simple wine.  Foodies/wine geeks - don't expect a vineyard designate or something complex for free.  It wouldn't fit with the place anyway.\n\nI got the calamari steak and was happy.  The people with snapper and crab cakes were really happy.  As was the person with the fried shrimp.  I got broccoli with mine (personal choice) and it was not drowned in butter as others have reported.\n\nDon't forget to ask for your dressing on the side with your salad - they use a heavy hand. \n\nI wish I had room for dessert, as they have Mitchell's ice cream.\n\nI'd go back without hesitation.", "rating": 4, "date": "2009-08-07"}, {"excerpts": ["I usually order the calamari steak, but I decided to have the oyster cocktail for an appetizer. ", "I have a cast iron stomach, but I came down with food poisioning 24 hours later. ", "Dont know if it was the oysters, but that won't deter me from returning to Pacific Cafe."], "author": "Dan P.", "review": "I usually order the calamari steak, but I decided to have the oyster cocktail for an appetizer. I have a cast iron stomach, but I came down with food poisioning 24 hours later. Dont know if it was the oysters, but that won't deter me from returning to Pacific Cafe.", "rating": 4, "date": "2011-04-19"}, {"excerpts": ["I ordered the Calamari Steak, but I think that my friend's Parmesan Crusted Talapia was much better (which surprised me because I'm a huge Calamari fan).\n\n"], "author": "Timothy A.", "review": "I had a great time here during my first time at Pacific Cafe. The whole \"bring you free wine while you wait\" definitely a great plus. The food was very good. I ordered the Calamari Steak, but I think that my friend's Parmesan Crusted Talapia was much better (which surprised me because I'm a huge Calamari fan).\n\nThe wait is a bit long, but as long as you have good friends and free wine, the wait won't feel like 45 minutes. My friends wanted to take me someplace \"non touristy\", and I think this place was a great option.", "rating": 4, "date": "2007-02-27"}, {"excerpts": ["Highlights of the menu are the crab cakes and the halibut but the real show stopper there is the calamari steak meuniere.  ", "They take the body of a squid the size of which i've only dreamed of, pound it flat, lightly coat it and pan fry it.  "], "author": "Tony S.", "review": "Something about this place caught my eye as I was speeding down Geary one evening.  It was the orangey glow and the small crowd that seemed to be gathered outside.  Pacific Cafe is a seafood restaurant of innate simplicity, they concentrate on market fresh fish alongside a few staples.  My first experience there led me to the crab cakes which were melty hockey pucks of shellfishy glory, beautifully textured crab which obviously came from a legendary recipe.  It has been there since 1973 and survived through the years despite attacks from the Lobster Liberation Front and the threat of building collapse and whilst I can't claim to have been dining there since 1973, the ten or so times I've been there have been wonderful.  \n\nHighlights of the menu are the crab cakes and the halibut but the real show stopper there is the calamari steak meuniere.  They take the body of a squid the size of which i've only dreamed of, pound it flat, lightly coat it and pan fry it.  Served, as are all their meals with the choice of rice or potatoes and preceded by a free shrimp louie salad you can dine like kings, drink the free wine (even if it is rubbish!) and generally pig out for $20 a head.\n\nThe drawbacks are of course it's popularity and the fact they do not take reservations.  If they did, you wouldn't be able to get a table for months and that is not what PC is about.  Get there early or midweek and you stand a better chance, i've seen waits up to 2 hours on the weekend!\n\nLove this place, it's as old as me and just as set in it's ways!", "rating": 4, "date": "2007-08-24"}, {"excerpts": ["The food, seafood, is excellent, especially the bread, the shrimp louie salad and several of the fresh entrees (calamari steak, grilled shrimp, wasabi-butter ahi).  ", "Short wine list, but budgetarily sound (5$ corkage and a similar markup from winestore prices).  ", "Dessert, I'd recommend going someplace else.\n", "The servers know what they're doing, but service can be uneven and god forbid you comment negatively, even in a reasonable way."], "author": "Charlie O.", "review": "Hmmm, you mean I get wine (OK, Inglenook, don't get too excited) while I'm waiting?  OK!  Be prepared to drink a lot of wine, because you're likely to wait a while.  \nIt's a small corner restaurant that's been there for many, many years (how do I get the original menu prices on this bill?).  I've been 4+ times a year for the last 6 years, and have rarely been disappointed.  The food, seafood, is excellent, especially the bread, the shrimp louie salad and several of the fresh entrees (calamari steak, grilled shrimp, wasabi-butter ahi).  Short wine list, but budgetarily sound (5$ corkage and a similar markup from winestore prices).  Dessert, I'd recommend going someplace else.\nThe servers know what they're doing, but service can be uneven and god forbid you comment negatively, even in a reasonable way.", "rating": 4, "date": "2006-06-05"}, {"excerpts": ["Husband had the calamari steak and we were both very, very content with our orders. ", "I love how all of the orders comes with either soup or salad, fries, rice or red potatoes. ", "A nice hearty meal for a cold day in the city. "], "author": "Ang L.", "review": "Husband and I came here for our 3 month wedding anniversary last night, and boy were my fellow yelpers right on point - I LOVE this place! Pacific Cafe is now my go-to seafood spot - why? Because it is officially my favorite for its fresh, fresh food, great service and ambiance. Who can say no to free wine (all of you under 21 should)? Fresh bread and butter, and those crab cakes was like taking a bite of bliss every single time. If it weren't for dinner and the fact that they carried Zanze's cheesecake for dessert, I would have gotten more! I had one of their specials, the spicy snapper. It was more of a kick than spicy which actually worked out well considering my episode of acid reflux. Husband had the calamari steak and we were both very, very content with our orders. I love how all of the orders comes with either soup or salad, fries, rice or red potatoes. A nice hearty meal for a cold day in the city. I had their shrimp louie salad, and it was delicious. The salad was fresh, and the husband enjoyed his clam chowder. Like I said, they had Zanze's cheesecake, which we ordered without hesitation. I loved how they carried local foods (they also have Mitchell's ice cream), so we felt the SF pride in there. We only live 10 blocks away, so it won't be hard for us to come back! Yummy, yummy crab cakes, I need some more!", "rating": 5, "date": "2010-11-01"}], "english sole": [{"excerpts": ["We ordered the English sole and the Newburg Sole, both of which we liked. ", "It's a casual place "], "author": "C. K.", "review": "Food: a quaint local place that provides simple and hearty fare without any fuss. \n\nWe ordered the English sole and the Newburg Sole, both of which we liked. It's a casual place so presentation is lacking but the fish were fresh, cooked simply, and delicious. \n\nService: very friendly waiters who often checked in on us and offered us free glasses of white wine as we waited. \n\nAmbiance: it's very casual and the style is reminiscent of a Northern European pub.\nIt looks pretty British in my opinion.", "rating": 4, "date": "2015-09-08"}, {"excerpts": ["Our table got the filet of sole newberg, english sole, Parmesan halibut, prawns and scallops. ", "I ordered the english sole and it was the fish-est tasting fish I have ever ordered. ", "Enligh sole are flat bottom feeding fish in the ocean and that's exactly how it tasted. ", "Fishy and like dirt/sand. "], "author": "Amy C.", "review": "I don't understand the wait for this place. Yes, you get free red/white wine while you wait, but the food I had was sub-par. \n\nIt took a little while for the menus to come because they didn't have enough specials menus, so our table of 5 had to wait for them. When we finally got the specials menus and barely looked at them we were rushed to order. \n\nOur table got the filet of sole newberg, english sole, Parmesan halibut, prawns and scallops. Each meal came with either clam chowder or shrimp louie salad, red potatoes, fries, or rice with the main course. \n\nThe clam chowder and shrimp louie salad was excellent. My main course was so bad I barely touched the plate. I ordered the english sole and it was the fish-est tasting fish I have ever ordered. Enligh sole are flat bottom feeding fish in the ocean and that's exactly how it tasted. Fishy and like dirt/sand. Disgusting. \n\nIf fish is prepared well it shouldn't be fishy or dirt tasting at all. The best of the dishes was the prawns! They tasted exactly like they should. \n\nMy advice is to skip the fish and go for the clam chowder, shrimp louie, and prawn main course.", "rating": 2, "date": "2013-08-07"}, {"excerpts": ["The fish is outstanding - love the English sole and the parmessan halibut.  ", "The Louie salad that comes  with the meal is great.  ", "The French bread and butter is a killer (delicious).... ", "The ice cream for dessert is Mitchel' s which is superb.  ", "Also, Zanzi's cheesecake.  ", "Great neighborhood restaurant."], "author": "Chloe C.", "review": "The wait is certainly worth it.  All the free wine one can drink until called to your table.   The fish is outstanding - love the English sole and the parmessan halibut.  The Louie salad that comes  with the meal is great.  The French bread and butter is a killer (delicious).... The ice cream for dessert is Mitchel' s which is superb.  Also, Zanzi's cheesecake.  Great neighborhood restaurant.", "rating": 4, "date": "2010-03-10"}], "prawns louisiana": [], "abalone": [{"excerpts": ["My Mom had the Abalone, and she said it was Amazing. ", "My guy had the Parmesan Halibut and he said it was excellent and one of the best he has ever had.\n", "We were here to Celebrate my Mom's 85th Birthday, and she was Surprised with ice cream and a candle, and I hope all of her wishes come true.\n", "Thank you Pacific Cafe for making our night so very Special, we will be back!!!!!!"], "author": "Les G.", "review": "This was one of the VERY BEST Restaurants I have been to in SF...We were welcomed with a complimentary glasa of wine, what a Fabulous touch....The Shrimp Scampi was the best I have ever have, and I ordered it with extra garlic and it was perfect.  My Mom had the Abalone, and she said it was Amazing. My guy had the Parmesan Halibut and he said it was excellent and one of the best he has ever had.\nWe were here to Celebrate my Mom's 85th Birthday, and she was Surprised with ice cream and a candle, and I hope all of her wishes come true.\nThank you Pacific Cafe for making our night so very Special, we will be back!!!!!!", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["I didn't know the abalone dish I ordered contained so much butter. ", "Sadly, I can't eat high fat dishes as I will get heartburns. ", "I didn't say anything, but they noticed I wasn't really touching my dish. ", "They asked if everything was okay ", "and I said it's fine. "], "author": "Linda C.", "review": "Best seafood and local restaurant I've ever been to. \n\nYummy fresh crab cocktail and yummy shrimp Louie salad (it's the sauce)!\n\nSweet people. I didn't know the abalone dish I ordered contained so much butter. Sadly, I can't eat high fat dishes as I will get heartburns. I didn't say anything, but they noticed I wasn't really touching my dish. They asked if everything was okay and I said it's fine. I didn't want to lie, and I felt bad for them to take it back. \n\nThey were really, really sweet and awesome. They insisted and even recommended a grill trout that's light and good for my tummy.\n\nThe grilled trout was so good and fresh and was crispy and juicy. \n\nCompletely recommend!\n\nPS - we got free wine with tops since we waited for some time. Awesome service.", "rating": 5, "date": "2017-09-09"}, {"excerpts": ["I was told the abalone was prepared much the same way but at $45 a pop, I'd rather stick with calamari and try my luck at diving for abalone off the Mendocino coast!\n\n"], "author": "Geoff G.", "review": "A close friend who travels on board cruise ships as the boat doc once recommended this low key, low profile restaurant. He was very specific. \"I have traveled around the world many times and I'll dare say their Petrale Sole is one of the best I had anywhere.\" I have to try PC, as I can't ignore my doc's orders! The restaurant was not fancy schmancy. In fact, it was basically no frills and down-to-earth.... like starting dinner off with a boring loaf of sourdough with plain ol' butter. The quaint exterior of the building gave PC a charming and old-fashioned appearance, shrouded occasionally by the enveloping fog. The interior is congested with many tables and antique booths tightly jammed in every nook and cranny. It did exude a cozy and welcoming aura once you step inside not to mention the cool glass of complimentary white wine in your hands for having to wait for a table.\n\nI was amazed as to how simple the menu was. There were only three basic styles of cooking.... Baked or grilled or pan-fried.  Add in a couple of soups and salads and there you have it, the whole menu of PC in a nutshell.\n\nWe wanted to start off by sharing an order of sautéed and pan-fried calamari steak. Since it appeared in the menu only as a dinner entrée ($18.75), my server cleverly suggested ordering the entrée without the sides and she knocked $6.00 off from the entrée price. Sounded like a deal! Calamari is relatively cheap, in abundant supply and ecologically sustainable. PC's calamari was first pounded, egg washed and batter dipped and lightly fried to give the calamari a golden brown crust. In spite of its tough or rubbery reputation, the texture of PC's calamari was so super tender that a fork was all you needed. Coupled with the lip-smacking egg batter, the tender steak earned a well deserved 5 stars. I was told the abalone was prepared much the same way but at $45 a pop, I'd rather stick with calamari and try my luck at diving for abalone off the Mendocino coast!\n\nPetrale sole ($24.95), a Pacific Coast fish, is prized for its delicate, mild and sweet flavors. The fillets were quickly sautéed and pan-fried with a sauce of white wine, shallots, butter and herbs. PC then plated the fillets with sautéed button mushrooms, a sprinkling of capers and a gentle squeeze of lemon. The sauce wasn't overwhelming so I can still taste the natural flavor of the fish. Even though the prep sounded so simple, I can't somehow make it to taste this good at home! The carb of choice was rice pilaf that tasted exquisite like fried rice and good to soak up the excess sauce.  I guess my doc was right about the sole, though I think I had better elsewhere. (4 stars). Besides, the calamari had the edge! \n\nThe Spicy Red Snapper ($20.68) didn't have the \"wow\" flavor I'd hoped for but my wife said it was still a keeper in the menu.  I personally think that the fish was a tad over grilled and the meat a little drier than I would like. It was labeled as spicy but not in any true sense of the word. The outer crust of the snapper had a robust, tangy char of some kind of mixed Cajun spices and herbs, cayenne pepper perhaps being the most discernable. (3.5 stars). The red snapper's meat was a little firmer and did not have the melt-in-your-mouth quality like the sole.\n\nAll in all, a great seafood place.... the price is right; the food is unpretentious and seafood perfectly executed. I just love old established restaurants like this one.  Parking can be a challenge in this neighborhood.  No reservations are taken and the system is kinda funky and disorganized. A lady comes around to take your name without writing it down and then pours you a glass of white wine!", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["My boyfriend really enjoyed the abalone, but it was $47.  ", "The clam chowder was not very good.  ", "Stick to the salad.  ", "Service was personable, and it was fun talking to the locals while waiting for a table.  ", "It's a good place for a meal after a visit to the Legion of Honor."], "author": "K W.", "review": "Don't get the crab cakes!  They tasted frozen, even though they were on the specials board.  No lump crab in them either.  My boyfriend really enjoyed the abalone, but it was $47.  The clam chowder was not very good.  Stick to the salad.  Service was personable, and it was fun talking to the locals while waiting for a table.  It's a good place for a meal after a visit to the Legion of Honor.", "rating": 3, "date": "2018-01-07"}, {"excerpts": ["But the entrées, including lightly breaded, perfectly cooked abalone medallions and two different seafood Newburg preparations, quickly drove any lingering soup-related disappointment from our minds. "], "author": "Michael D.", "review": "A nearly perfect dining experience for seafood lovers -- it's no accident the place has ben around for 40 years! The crab cakes: excellent. The clam chowder and oyster bisque? Meh, at least on our most recent visit. But the entrées, including lightly breaded, perfectly cooked abalone medallions and two different seafood Newburg preparations, quickly drove any lingering soup-related disappointment from our minds. Even the sourdough bread and butter were great.\n\nThe best seafood is always fresh, cooked perfectly, and prepared in ways that showcase the main ingredients. If you want some of the best seafood available in one of the best seafood-loving cities in the world, go to Pacific Café -- and enjoy the complimentary, surprisingly tasty free wine if there's a wait!", "rating": 4, "date": "2015-04-01"}, {"excerpts": ["We had abalone, among other things. ", "Now, abalone is not something you order every day. ", "Pacific Cafe knew exactly what to do with the abalone. ", "VERY delicate handling (well, after tenderizing the crap out of them, of course) with very light seasoning. "], "author": "Andrew L.", "review": "How have I not reviewed this place? It's a real gem.\n\nI went here with my girlfriend and her mom, and we had a really wonderful dinner. We got free wine while waiting for our table... first good sign.\n\nMy GF apparently recognized the waiter, since it turns out he's been working at Pacific Cafe since they opened, many decades ago. Super friendly guy (forgot his name).\n\nWe had abalone, among other things. Now, abalone is not something you order every day. In fact, this is the first time in my life I'd ever had it in a restaurant - I usually go with family to get them ourselves and then cook them at home. \n\nPacific Cafe knew exactly what to do with the abalone. VERY delicate handling (well, after tenderizing the crap out of them, of course) with very light seasoning. Can't get much better. \n\nThe service was great. This is not a cheap place or an easy place to park by, but if you manage to make it here, don't skimp. They really know what they're doing.", "rating": 5, "date": "2013-04-02"}, {"excerpts": ["But once you're seated, the baskets of great sourdough keep arriving at your table, a very nice salad or soup is included with the meal, and you then enjoy a nice plate of fresh fish (or scallops, or abalone or whatever pops out at you from the specials board). ", "Frank and Roy and Maureen and the other long time staff are friendly, informed and attentive. ", "One of my favorite SF spots any day of the week."], "author": "Chris K.", "review": "This place is the perfect neighborhood fish restaurant. Great food, friendly scene, great tradition. My favorites are the halibut parmesan, the crab Louie (sweet, fresh, gorgeous crab, not local), the clam chowder, the petrale and the Mitchell's ice cream for dessert (another SF tradition). Yes, the free barrel wine while you wait is great and builds a friendly scene, especially on a foggy weekend when the wait may be a bit longer than you hoped. But once you're seated, the baskets of great sourdough keep arriving at your table, a very nice salad or soup is included with the meal, and you then enjoy a nice plate of fresh fish (or scallops, or abalone or whatever pops out at you from the specials board). Frank and Roy and Maureen and the other long time staff are friendly, informed and attentive. One of my favorite SF spots any day of the week.", "rating": 5, "date": "2015-11-22"}, {"excerpts": ["On special occasions we order the abalone steak and when they have it the diablo whole crab is the best. ", "There's no reservations ", "but you get free house red/white wine will you wait. ", "This place is a institution in San Francisco's Richmond district.\n", "And when you are there say hi to Roy who's always got that welcoming smile as he hands you a glass of wine!"], "author": "RJ C.", "review": "We come here at least 3 times a month when we are in town. Most of the time we order the calamari steak and the fried oysters with their new england clam chowder. On special occasions we order the abalone steak and when they have it the diablo whole crab is the best. There's no reservations but you get free house red/white wine will you wait. This place is a institution in San Francisco's Richmond district.\nAnd when you are there say hi to Roy who's always got that welcoming smile as he hands you a glass of wine!", "rating": 5, "date": "2014-05-05"}, {"excerpts": ["My abalone was very good but for $50 plate there were tiny 4 pieces.   ", "My daughter did not like her scallops, ", "dish was covered in butter, completely soaked in butter.  ", "Rice had no flavor at all.  ", "So we asked for french fries.  ", "Likely potato was fine.   ", "I will not be back.  ", "It was $200 for 4 people.  ", "I don't mind paying $200 but not for this food.   ", "They also played some music that would simply add to noise level, so we couldn't even enjoy the company.  ", "Very very disappointing."], "author": "Alex R.", "review": "I think the quality of food here has gone down quite a bit since my last visit. It was my birthday.  We were a party of 4 people.   It took about 1hr after we sat down to get served.   We had clam chowder and it was not good at all.  Very disappointing with clam chowder it had absolutely no flavor what so ever.   My wife ordered halibut and it was impossible to eat because it was very dry over cooked.  My abalone was very good but for $50 plate there were tiny 4 pieces.   My daughter did not like her scallops, dish was covered in butter, completely soaked in butter.  Rice had no flavor at all.  So we asked for french fries.  Likely potato was fine.   I will not be back.  It was $200 for 4 people.  I don't mind paying $200 but not for this food.   They also played some music that would simply add to noise level, so we couldn't even enjoy the company.  Very very disappointing.", "rating": 3, "date": "2016-02-21"}, {"excerpts": ["Nothing really exotic (they did have abalone on the menu)  "], "author": "Matsuo U.", "review": "Dinner for 4, got there a few minutes after they opened (5:00PM) and most of the place was filled. No reservations accepted... I tried. \nSeated right away by a courteous greeter, the service by the waitress was efficient and attentive.  Definitely not a hipster joint, but a long lasting restaurant that is consistent & good. \n\nAt our table (of course I talked everyone out of a bite - and two in one instance). Nothing really exotic (they did have abalone on the menu)  well prepared, tasty & nicely presented dishes:\n\nSalmon & Prawns Combo  -  $23.75 - Nice  \"combo\" of fresh seafood flavors.\n\nFilet of Sole Newburg  -  $21.37 - a baked delight (kinda an old-school dish) - very nicely prepared ... not a drop of the sauce was left on the plate.\n\nCrab Louie  -  $24.00 - beautiful & tasty & GIANT\n\nSnapper Spicy  -  $18.98 - kinda not that spicy if your into the XXX of spicyness (probably not a real word) but tender & tasty.\n\nAccompanying soups /salad / fries rate a \"good\" comment. \n\nJust down the road ( 5 minute walk ) from the Legion of Honor museum, so after nourishing your eyes & mind with beauty at \"The Legion\", delight your taste buds and fill your belly at Pacific Cafe. \n\nhttp://legionofhonor.famsf.org/legion/exhibitions", "rating": 4, "date": "2011-10-09"}, {"excerpts": ["They have abalone at this restaurant... delicious, lightly breaded, sautéed, cut-it-with-a-fork tender (but not cheap) ", "abalone!  ", "Oh my!  ", "The only other restaurant where I've found this is in Monterey.  ", "It's on the \"Specials of the Day\" menu but the waitress assured me it's available ", "99% of the time.  ", "I give the abalone 6 stars!   ", "All of their bisque soups are also delicious.  ", "My husband loved his scampi.   ", "No reservations ", "but if you arrive early on a weekday the wait isn't long.  ", "However, to make up for this policy, the free \"welcome while you wait\" bottomless wine makes up for any wait.  ", "And, if you love abalone (or any seafood) ", "like I do, the wait is worth it."], "author": "Nancy C.", "review": "Be still my heart. They have abalone at this restaurant... delicious, lightly breaded, sautéed, cut-it-with-a-fork tender (but not cheap) abalone!  Oh my!  The only other restaurant where I've found this is in Monterey.  It's on the \"Specials of the Day\" menu but the waitress assured me it's available 99% of the time.  I give the abalone 6 stars!   All of their bisque soups are also delicious.  My husband loved his scampi.   No reservations but if you arrive early on a weekday the wait isn't long.  However, to make up for this policy, the free \"welcome while you wait\" bottomless wine makes up for any wait.  And, if you love abalone (or any seafood) like I do, the wait is worth it.", "rating": 5, "date": "2015-10-28"}, {"excerpts": ["Crab Cakes are loaded with crab and not filler, the Abalone Special is definitely a must and the Sole Newburg is a tasty option too.\n\n"], "author": "Katie W.", "review": "This is San Francisco.\nThe building is from 1899. The restaurant has been there since the 70's and I wish I was there every night.\n\nNo matter what time you get there, you will wait in line as they take no reservations and this place is endlessly popular - but you almost don't care because it moves quickly, perhaps this is partially due to the fact that they give you as much free house white wine as you can drink. Or, perhaps it is all due to this fact...\n\nEither way, no matter how long that wine sipping wait, you will feel special and warm inside and out when you finally are seated. The decor seems to not have changed a bit since the first day the doors opened, the booths are wooden, small and so fitting.\n\nThe staff is efficient and the seasoned set that knows what you need before you do and full of personality.\n\nThe seafood is fresh and flavorful, the menu is very traditional and classic - something that's pretty common, but hard to find done well. Crab Cakes are loaded with crab and not filler, the Abalone Special is definitely a must and the Sole Newburg is a tasty option too.\n\nThis is one of those places, like the Tadich Grill and Caffe Sport that are not to be missed in your food tour of the lore of San Francisco.", "rating": 4, "date": "2012-08-13"}, {"excerpts": ["My dining companion had the abalone, and I had the petrale sole with white wine, mushrooms & capers. ", "Both: Remarkable."], "author": "Sally M.", "review": "Excellent Service by experienced servers in a traditional SF haunt.\n\nAt the recommendation of a cab driver (the best kind), I first heard about Pacific Cafe, years before I had the pleasure to dine here for a farewell dinner on my way out of town. I'd heard that you're given complimentary wine while waiting, that the restaurant has been in business for years, that it was a local / old-school sort of venue (i.e. not hip & trendy), and all of these characteristics appealed to me. \n\nI also heard that the food was delicious.\n\nMy dining companion had the abalone, and I had the petrale sole with white wine, mushrooms & capers. Both: Remarkable.", "rating": 5, "date": "2011-11-21"}, {"excerpts": ["DO NOT GET THE ABALONE! ", "They deep-fry it. ", "And if anyone of you is Asian and knows anything about abalone, it it that you don't deep-fry it... ", "Perhaps they even served fake abalone.\n\n"], "author": "Betty W.", "review": "Fresh fish for sure. Ahi Tuna and wasabi butter was nothing mouth watering but it was made well.\n\nDO NOT GET THE ABALONE! They deep-fry it. And if anyone of you is Asian and knows anything about abalone, it it that you don't deep-fry it... Perhaps they even served fake abalone.\n\nClam chowder is nothing spectacular either. \n\n3 stars for just having fresh fish and complimentary wine while you wait.", "rating": 3, "date": "2011-03-24"}, {"excerpts": ["I got the Abalone because I had never had it before. ", "It was the most expensive item and the server (to his wonderful credit) made sure I knew I was about to pay a lot for a relatively small portion of food. ", "It was delicious, and I am glad to have tried it, but when we go back I will be looking forward to getting a cheaper item that is equally delicious with a bigger portion. ", "I gotta emphasize though, it was so tender and good. ", "Fans of abalone will not be disappointed at all. "], "author": "Cahde H.", "review": "I'll start off by stating the obvious: Free wine. At any other restaurant in the world you hope there is no line, but here... the longer the line the more free wine. Genius. \n\nFor the food itself, we got the crab cakes for an appetizer as various other reviews suggested. They were amazing. Definitely the best I have had in quite some time. They come with a remoulade sauce or something, but really they don't need it. Every main course comes with three options for a side. We both got potatoes and they were what you would expect out of a red potato. I think it is pretty smart to have only these basic (always good) sides as it lets the cooks focus on each order of seafood that comes in. \nMy wife got the Spicy Snapper with a side salad. I was a bit envious honestly. It was one of the cheaper items, but oh so good. The Cajun spices were perfect, not heavy handed and it was cooked perfectly. The Shrimp Louie dressing was soooo good. Tangy and simple.\nI got the Abalone because I had never had it before. It was the most expensive item and the server (to his wonderful credit) made sure I knew I was about to pay a lot for a relatively small portion of food. It was delicious, and I am glad to have tried it, but when we go back I will be looking forward to getting a cheaper item that is equally delicious with a bigger portion. I gotta emphasize though, it was so tender and good. Fans of abalone will not be disappointed at all. They clearly put effort into this one.\n\nThe service was perfect. Everyone seems so genuine. No on is trying to sell to you, they know their shit, and they are very helpful and attentive. The host is on top of his game with the free wine. He even went outside to make sure anyone in the cold had some too. The beer selection was a bit lacking, but they got a few locals. I am not a big fan of wine, but my wife loved their selection and the Chardonnay she got.", "rating": 5, "date": "2013-02-10"}, {"excerpts": ["The Abalone steak and fried Pacific Oysters are favorites too. ", "They have remained absolutely consistent over the years, while the one that was in Fisherman's wharf never could get the same formula. ", "I love how they add a small Anchovy to the salad and the clam chowder is the best! \n", "Come here early or late as they don't take reservations."], "author": "Arlene C.", "review": "Been coming here since college when my roomate overheard someone talking about it on the bus. We were a little leary, but we walked there and waited in line for over an hour while being plied with wine. We had the large table by the kitchen and had a memorable 2hr. dinner. We were pretty rowdy, but the noise level is pretty high, so nobody cared. The Turbot stuffed with shrimp & crab is still one of the best things on the menu. The Abalone steak and fried Pacific Oysters are favorites too. They have remained absolutely consistent over the years, while the one that was in Fisherman's wharf never could get the same formula. I love how they add a small Anchovy to the salad and the clam chowder is the best! \nCome here early or late as they don't take reservations.", "rating": 5, "date": "2007-05-16"}, {"excerpts": ["Sand dabs, crab cakes and abalone are listed. ", "Small wooden booths create a very \"shippy\" feel. ", "The food of course is predictably top notch, but the price is astonishingly reasonable. ", "A platter of fish, wine and a shrimp louis for under $25. ", "It doesn't get better than this."], "author": "Philip M.", "review": "It's a rainy winter night and you've exhausted the aisles of Green Apple Books on Clement.  Your path leads you to Geary Blvd. And you instinctively head toward the Avenues. Soon you pass the neon lights. 30th, 31st, then at 34th a light beckons from the corner. It's nothing to look at, but the warm glow draws you in. Wine is handed to you as you enter and step back in time. This is where the soul of Old San Francisco is preserved. Fresh fish of the day is written on blackboards above the kitchen. Sand dabs, crab cakes and abalone are listed. Small wooden booths create a very \"shippy\" feel. The food of course is predictably top notch, but the price is astonishingly reasonable. A platter of fish, wine and a shrimp louis for under $25. It doesn't get better than this.", "rating": 5, "date": "2010-12-20"}, {"excerpts": ["Abalone is the American English variant of the Spanish name Abuln used for various species of shellfish (mollusks) from the Haliotidae family (genus Haliotis). ", "The abalones belong to the large class of gastropods (Gastropoda). ", "There is only one genus in the family Haliotidae, and about four to seven subgenera.", "\" ", "- ", "...  ABALONE!!!!!!!!  ", "Make sure they have it on the menu before you go (and that you have about $30.00 to spare on a meal) but I promise you  (as a Seafood Lover) ", "If you're not into Abalone, that is OK because everything else on the menu (Salmon, Chilean Sea Bass, etc) is great too.\n\n"], "author": "Benjamin G.", "review": "\"Abalone is the American English variant of the Spanish name Abuln used for various species of shellfish (mollusks) from the Haliotidae family (genus Haliotis). The abalones belong to the large class of gastropods (Gastropoda). There is only one genus in the family Haliotidae, and about four to seven subgenera.\" - Thanks Wikipedia...\n\nAnyway, yes...  ABALONE!!!!!!!!  Make sure they have it on the menu before you go (and that you have about $30.00 to spare on a meal) but I promise you  (as a Seafood Lover) your senses will be out of control at this place...  \n\nStart out by penciling your name onto the list - literally, they don't take reservations to my knowledge - but hey, when they're serving you free wine (white - Pinot Gris maybe, who knows - who cares if it is free hahahaa!!!) it will be worth the wait to get in.\n\nOnce inside, the Salmon Bisque, good friendly service, warm bread, a primarily candle lit ambiance (candle lit tone anyway), nice wine selection (the \"free\" wine is merely a placebo to get your buds craving more of that grape nectar goodness) will be waiting for you...  If you're not into Abalone, that is OK because everything else on the menu (Salmon, Chilean Sea Bass, etc) is great too.\n\nMake sure you wash your hands before you eat (duh, you should always do that) but there are some really great OLD photos in the restroom that I'm not going to tell you about - you'll just have to discover them for yourself...\n\ncan I come with you??  man, now I'm hungry!", "rating": 5, "date": "2006-12-19"}, {"excerpts": ["I was lucky to partake in the Abalone Steak and my sister in law had the seafood salad. ", "Mine was scrumptious, along with the rice and salmon chowder and my sister in law's seafood salad was fantastic as well. ", "Also, we had a crab cake appetizer that was fairly decent too! ", "The staff was very accommodating and speedy. ", "All in all, it was a great perfect spot for me to impress a family member for local seafood and an extra plus was that it was close to the Cliff House for a Sunset Irish Coffee to top off the evening!"], "author": "Timothy L.", "review": "I've been coming ever since I moved here in the early 90's and wanted to bring my sister in law here on monday, 09/17/12, as she loves seafood and wanted to go to someplace that was \"different and unusual\". Since this place is more of a neighborhood joint, and is always popular after 6p.m., we got here shortly before opening and were (as always) greeted with a complimentary glass of sparkling wine while waiting. (Very nice touch!) It's a good thing we got there when we did, as the place filled up rapidly shortly after we arrived. I was lucky to partake in the Abalone Steak and my sister in law had the seafood salad. Mine was scrumptious, along with the rice and salmon chowder and my sister in law's seafood salad was fantastic as well. Also, we had a crab cake appetizer that was fairly decent too! The staff was very accommodating and speedy. All in all, it was a great perfect spot for me to impress a family member for local seafood and an extra plus was that it was close to the Cliff House for a Sunset Irish Coffee to top off the evening!", "rating": 5, "date": "2012-09-21"}, {"excerpts": ["When I inquired about the abalone ($41 for 5oz), I found out from the waitress that it was from a farm in Cayucos.  ", "Apparently, since abalone has been commercially over-fished, restaurants can only get their abalone from farms."], "author": "Merri K.", "review": "Reliably good food, but not great and a bit pricey. The menu and food is simple--salad or soup and seafood entree with potatoes--the sort of dishes you could make at home.  When I inquired about the abalone ($41 for 5oz), I found out from the waitress that it was from a farm in Cayucos.  Apparently, since abalone has been commercially over-fished, restaurants can only get their abalone from farms.", "rating": 3, "date": "2009-09-11"}, {"excerpts": ["It's pricey (entrees in the upper teens to 20s, unless you order the abalone at $40), but for a nice, upscale seafood meal, worth it. ", "Glad it's in my neighborhood.\n", "-----------------------------------------------\n", "Took my mom to the Pacific Cafe for dinner while she was visiting from LA. ", "Still a five star rating! "], "author": "Caitlin H.", "review": "I kept seeing this place from the bus, all rosey and cheerful and crowded, and always wanted to go. I finally got my chance and it totally lived up to expectations. The wait is long, but worth it - plus they serve some pretty darn good complimentary wine while you wait. The regular menu looks excellent, though I tried something from the daily specials board. The choice is hard though. I had baked crab-stuffed salmon Newberg, which was heavenly. For desert, apple tart with a marzipan-y overtone and scrumptious ice cream. The service was great and the ambiance is everything it looks to be from the bus. It's pricey (entrees in the upper teens to 20s, unless you order the abalone at $40), but for a nice, upscale seafood meal, worth it. Glad it's in my neighborhood.\n-----------------------------------------------\nTook my mom to the Pacific Cafe for dinner while she was visiting from LA. Still a five star rating! Another lovely meal (fried scallops, red potatoes, shrimp louie salad and chocolate torte). And actually, the wait was not that bad on a Friday night at 6:00, surprisingly.", "rating": 5, "date": "2007-01-18"}, {"excerpts": ["I've even been lucky enough to go when they have had abalone. ", "The Pacific Cafe feels old school and that is what it is, a true classic neighborhood  seafood restaurant."], "author": "Charles O.", "review": "Free white wine while you wait is great, but while you can get stuck in a line time flys when when you have a drink in hand. The service is good the food has never let me down. Very hearty and traditional seafood. I've even been lucky enough to go when they have had abalone. The Pacific Cafe feels old school and that is what it is, a true classic neighborhood  seafood restaurant.", "rating": 4, "date": "2007-11-12"}, {"excerpts": ["The CRAB CAKE, SALMON, SCALLOP, ABALONE, SPICY SNAPPER, SHRIMP LOUIE SALAND AND THERE SOUPS ETC and very good. ", "They do have Steak ", "but I have never tired it. ", "The waiters are all very nice."], "author": "Ge I.", "review": "Very good restaurant. I love this place. Everyone is soooo friendly, even the people who are waiting to eat. Very hard to find parking but that's SF. Just talking writing about this place makes me want to go there. We live about 4 blocks from Pacific Cafe.  A great place for fresh seafood. A place to take someone who is visiting SF. So far that is what we have done and everyone we have taken to this place, they also loved it. It's  great to go right when it is opening so that you don't have to wait. If you are the first to be seated you still get a glass of free wine, We did. If you come later it's a long wait but if you sip wine then it does not seem like you are waiting long.  The CRAB CAKE, SALMON, SCALLOP, ABALONE, SPICY SNAPPER, SHRIMP LOUIE SALAND AND THERE SOUPS ETC and very good. They do have Steak but I have never tired it. The waiters are all very nice.", "rating": 5, "date": "2008-05-14"}, {"excerpts": ["I love the abalone with red potatoes. ", "You get choice of salad (2 types) and soup. ", "I like the Ceasar my wife and kids ", "do the shrimp salad. ", "The calamari app. ", "is great.(its not deep fried but has a vinegar dressing)They used to do great lobster tails ", "but I havent had one in a while. ", "My kids like the prawn scampi. ", "The mixed grill fish is also great. ", "We go there at least 6 times a year."], "author": "mike k.", "review": "One of my favorites. Get there at 4:50pm and wait for the 10 minutes. You will get a free glass of wine while you wait. If you get there after 5pm be prepared to wait. I love the abalone with red potatoes. You get choice of salad (2 types) and soup. I like the Ceasar my wife and kids do the shrimp salad. The calamari app. is great.(its not deep fried but has a vinegar dressing)They used to do great lobster tails but I havent had one in a while. My kids like the prawn scampi. The mixed grill fish is also great. We go there at least 6 times a year.", "rating": 5, "date": "2009-03-01"}], "ahi  tuna": [], "snapper spicy": [{"excerpts": ["Snapper Spicy  -  $18.98 - kinda "], "author": "Matsuo U.", "review": "Dinner for 4, got there a few minutes after they opened (5:00PM) and most of the place was filled. No reservations accepted... I tried. \nSeated right away by a courteous greeter, the service by the waitress was efficient and attentive.  Definitely not a hipster joint, but a long lasting restaurant that is consistent & good. \n\nAt our table (of course I talked everyone out of a bite - and two in one instance). Nothing really exotic (they did have abalone on the menu)  well prepared, tasty & nicely presented dishes:\n\nSalmon & Prawns Combo  -  $23.75 - Nice  \"combo\" of fresh seafood flavors.\n\nFilet of Sole Newburg  -  $21.37 - a baked delight (kinda an old-school dish) - very nicely prepared ... not a drop of the sauce was left on the plate.\n\nCrab Louie  -  $24.00 - beautiful & tasty & GIANT\n\nSnapper Spicy  -  $18.98 - kinda not that spicy if your into the XXX of spicyness (probably not a real word) but tender & tasty.\n\nAccompanying soups /salad / fries rate a \"good\" comment. \n\nJust down the road ( 5 minute walk ) from the Legion of Honor museum, so after nourishing your eyes & mind with beauty at \"The Legion\", delight your taste buds and fill your belly at Pacific Cafe. \n\nhttp://legionofhonor.famsf.org/legion/exhibitions", "rating": 4, "date": "2011-10-09"}, {"excerpts": ["Alison had the Snapper Spicy with Clam Chowder and french fries.  "], "author": "Blake C.", "review": "Fantastic, simple-yet-complex seafood in a comfortable setting.  \n\nThe service is friendly, apt and appropriate.  The server brings you a complimentary glass of wine to start and lets you browse the daily and specials menu while you enjoy some homemade sour dough bread and creamy salty butter.  \n\nI ordered the Grilled Salmon (slathered with an herb-filled butter cream) and fried fresh prawns with Salmon Bisque and red potatoes.  Alison had the Snapper Spicy with Clam Chowder and french fries.  Both were totally delicious, the Snapper boasting a crisp, robust char of chili powders, pepper and herbs, the Salmon being a more modestly straight-forward piece of fish, wish the aforementioned slathering of garlic-herb-enhanced sweet cream butter.\n\nThe red potatoes were cooked to perfection, as were the fries, both delicate and crisp.  The prawns were delightfully butterflied and lightly fried.  The Salmon bisque had an incredibly delicate hint of fishiness, creaminess and small bits of salmon which worked well texturally.  The Clam Chowder was the surprise stand-out with it's stew-like consistency and taste - a flour and oil based flavor that reminds me of my own Mother's beef stew - with pieces of mussels and potatoes reminding the brain it is actually, in fact, a chowder.\n\nI will be back again, when lovely company deems it necessary.  The Pacific Cafe is one of those neighborhood joints you frequent when it's time to impress loved ones with simple, elegant food and an excellently laid-back, friendly environment.", "rating": 4, "date": "2010-05-19"}], "salmon  prawns combo": []}