{"papadum  pieces": [], "daal": [{"excerpts": ["Yellow daal also outstanding!"], "author": "Daniel S.", "review": "My favorite Pakistani / Indian in the city. Must get the saag paneer and tandoori chicken. Yellow daal also outstanding!", "rating": 5, "date": "2017-11-01"}, {"excerpts": ["Had the Saal Daal and the spice was just the right amount."], "author": "Elements Of Light L.", "review": "The food here was fantastic!  And you can't beat the price for the amount of food you get.  Had the Saal Daal and the spice was just the right amount.", "rating": 5, "date": "2017-11-18"}, {"excerpts": ["Chole were mushy and not fresh, daal was just made with extra oil to make up for lack of taste."], "author": "Shreya S.", "review": "Not for vegetarians whatsoever.  Chole were mushy and not fresh, daal was just made with extra oil to make up for lack of taste.", "rating": 1, "date": "2015-08-07"}, {"excerpts": ["Got the saag daal with garlic naan. ", "Daal was great and naan was good, garlic was too dry/crispy. ", "Lots of food without a huge bill which was a nice change from other places in SF"], "author": "Amanda H.", "review": "Happy we stumbled upon this place when we were looking for a quick lunch. Got the saag daal with garlic naan. Daal was great and naan was good, garlic was too dry/crispy. Lots of food without a huge bill which was a nice change from other places in SF", "rating": 4, "date": "2015-12-21"}, {"excerpts": ["Daal. ", "Chicken biryani. ", "Fabulous naan. ", "Chicken biryani was very good too.  ", "Great place for cheap eats."], "author": "I Q.", "review": "Authentic. Great tandoori.Daal. Chicken biryani. Fabulous naan. Chicken biryani was very good too.  Great place for cheap eats.", "rating": 4, "date": "2013-09-12"}, {"excerpts": ["The lamb biryani is phenomenal and the bhuna with daal and white rice is like a home cooked meal. ", "Love their tea as well :)"], "author": "Ashna C.", "review": "I'm Bengali and come here for a little taste of home. The lamb biryani is phenomenal and the bhuna with daal and white rice is like a home cooked meal. Love their tea as well :)", "rating": 5, "date": "2013-10-23"}, {"excerpts": ["Saag Daal (amazing--lentils and spinach--a must order)\nSeekh Kabob (looks like a long sausage--J really liked the tender, spicy flavor--definitely order if you are a carnivore)\n"], "author": "Grace C.", "review": "12:25p on a Saturday morning and we see parking on O'Farrell two blocks away from Pakwan. After putting 10 quarters in for an hour and walking down the block, I see two hour parking on Leavenworth and then Jones. \nWe walk in the rain to Pakwan's and the restaurant is completely empty except for two cooks. Undeterred because we had read good reviews previously about this place, we sat down and proceeded to order. What followed was some of the most delicious Indian food I have ever eaten in the Bay Area to date (and I've lived here since 2000). For $26.83 (including tax), this is what we ate:\n\nGarlic Naan (so good I ordered two to take home)\nPlain Naan (again so good I ordered an extra one to take home)--more buttery & a little smaller than Shalimar--bottom is crispy)\nAloo Palak (delicious--potatoes and spinach)\nSaag Daal (amazing--lentils and spinach--a must order)\nSeekh Kabob (looks like a long sausage--J really liked the tender, spicy flavor--definitely order if you are a carnivore)\nVegetable Pakora -- big dud; couldn't taste any veggies. \n\nI thought it was strange that no sauces were offered with the pakora, but didn't ask. \n\nWe stayed there for 55 minutes. Noticed many folks (of South Asian descent) got take out. \n\nWas surprised that the curries weren't as spicy as I expected.", "rating": 4, "date": "2009-05-03"}, {"excerpts": ["It tastes so good on the tongue that we always end up ordering a second round, and it usually includes the Saag Daal.  ", "We eat until there's nothing left, push ourselves back from the table, and then work out a most pleasant food coma with a long and leisurely walk ..."], "author": "Ren P.", "review": "Pakwan doesn't just cure my hunger, it fulfills a Need. \n\nWhen I first walked into the O'Farrell Street location, I was convinced that this was a two-guys-and-a-kitchen outfit.  I was amazed to find that they're not only part of a chain but have a nice website.  They have none of the polish or gloss, numbly mechanical feel, or dumbed-down food of most multiple-location eateries.  They've instead perfected the art of delivering crave-worthy Indian and Pakistani food with a minimum of overhead.   \n\nNo middlemen (read: servers) get between me and the guys with access to the big pots of food.  I place my order and pay at the counter.  There'll be a short wait for my food, and I make myself useful:  grab a plate, glass, a few beat-up utensils, and napkins from the shelf next to the counter and dispense whatever drink I've paid for into the glass (no one else will do it for me).  Find a seat - they're all the same: simple kitchen chairs pushed under tables that are no more than four legs supporting a (mostly) horizontal surface.  Embellishment is unnecessary to function.  Listen and watch for my food to appear on the counter.  (It's a small place, and the perfectly-visible kitchen nearly dominates - it gives Pakwan an immediate feel.)  I usually identify my food by sight and a nod from the guy behind the counter - I've only understood his shout-out a couple of times.\n\nWhen I begin eating, it's always the same - there's a rush as I realize just how good this food is.  The heretofore unknown depth of my hunger makes itself known as it becomes apparent that this is fare to satisfy, not just take the edge off.  It tastes so good on the tongue that we always end up ordering a second round, and it usually includes the Saag Daal.  We eat until there's nothing left, push ourselves back from the table, and then work out a most pleasant food coma with a long and leisurely walk ...", "rating": 4, "date": "2007-07-22"}, {"excerpts": ["curry was kind of a mush, the daal sag had little spinach and quickly turned pasty, and the biryani was just clumped rice without too much flavor or many vegetables. \n\n"], "author": "Robert T.", "review": "I was disappointed. I ordered alot of food hoping to have some for the next couple meals. While the prices are very good, unfortunately, the veg. curry was kind of a mush, the daal sag had little spinach and quickly turned pasty, and the biryani was just clumped rice without too much flavor or many vegetables. \n\nService is efficient and attentive and the location is clean, well lit and nicely, if sparsely decorated. \n\nthe main reason I ended up at Pakwan is that they take credit cards; most restaurants in the area are cash only. I remember Pakwan being better and can't say I won't give it a try another time.", "rating": 2, "date": "2012-02-22"}, {"excerpts": ["To be completely honest the food was edible (and the tandoori (bone-on) chicken and daal were actually very good) ", "but the stickiness of the floors and tables (and general dirty/greasy nature of the place) not only made it difficult to enjoy the mediocre food, but is causing nightmares days later! "], "author": "rupa b.", "review": "This wins the award for the worst food and dirtiest Indian/Pakistani restaurant in SF. Too bad really that this place has gone so far downhill after a recent management change. \n\nTo be completely honest the food was edible (and the tandoori (bone-on) chicken and daal were actually very good) but the stickiness of the floors and tables (and general dirty/greasy nature of the place) not only made it difficult to enjoy the mediocre food, but is causing nightmares days later! Seriously, I don't think the tables or windows have been cleaned in months, if not longer!\n\nThe food tastes very different (less tasty, but more oily) from our last visit about a year ago, and the service is a lot less friendly as well. I guess this is what happens when there is a regime change, huh?", "rating": 1, "date": "2011-03-14"}, {"excerpts": ["chicken tikka, chana masala, daal chana, naan,  et al... are so yummy on those days that SF provides us with shit ass cold weather and you want some food that sticks to your ribs and insulates the heat you are quickly losing trying to keep yourself warm in this city. ", "try it they are good."], "author": "Jaclyn L.", "review": "we do a drive by take-out...or better yet we tag team one person runs in and the other drives...vroom vroom.  chicken tikka, chana masala, daal chana, naan,  et al... are so yummy on those days that SF provides us with shit ass cold weather and you want some food that sticks to your ribs and insulates the heat you are quickly losing trying to keep yourself warm in this city. try it they are good.", "rating": 3, "date": "2007-08-14"}], "mix vegetable curry": [], "mirch salan": [], "saag daal": [{"excerpts": ["Got the saag daal with garlic naan. ", "Daal was great and naan was good, garlic was too dry/crispy. ", "Lots of food without a huge bill which was a nice change from other places in SF"], "author": "Amanda H.", "review": "Happy we stumbled upon this place when we were looking for a quick lunch. Got the saag daal with garlic naan. Daal was great and naan was good, garlic was too dry/crispy. Lots of food without a huge bill which was a nice change from other places in SF", "rating": 4, "date": "2015-12-21"}, {"excerpts": ["Saag Daal (amazing--lentils and spinach--a must order)\nSeekh Kabob (looks like a long sausage--J really liked the tender, spicy flavor--definitely order if you are a carnivore)\n"], "author": "Grace C.", "review": "12:25p on a Saturday morning and we see parking on O'Farrell two blocks away from Pakwan. After putting 10 quarters in for an hour and walking down the block, I see two hour parking on Leavenworth and then Jones. \nWe walk in the rain to Pakwan's and the restaurant is completely empty except for two cooks. Undeterred because we had read good reviews previously about this place, we sat down and proceeded to order. What followed was some of the most delicious Indian food I have ever eaten in the Bay Area to date (and I've lived here since 2000). For $26.83 (including tax), this is what we ate:\n\nGarlic Naan (so good I ordered two to take home)\nPlain Naan (again so good I ordered an extra one to take home)--more buttery & a little smaller than Shalimar--bottom is crispy)\nAloo Palak (delicious--potatoes and spinach)\nSaag Daal (amazing--lentils and spinach--a must order)\nSeekh Kabob (looks like a long sausage--J really liked the tender, spicy flavor--definitely order if you are a carnivore)\nVegetable Pakora -- big dud; couldn't taste any veggies. \n\nI thought it was strange that no sauces were offered with the pakora, but didn't ask. \n\nWe stayed there for 55 minutes. Noticed many folks (of South Asian descent) got take out. \n\nWas surprised that the curries weren't as spicy as I expected.", "rating": 4, "date": "2009-05-03"}, {"excerpts": ["It tastes so good on the tongue that we always end up ordering a second round, and it usually includes the Saag Daal.  ", "We eat until there's nothing left, push ourselves back from the table, and then work out a most pleasant food coma with a long and leisurely walk ..."], "author": "Ren P.", "review": "Pakwan doesn't just cure my hunger, it fulfills a Need. \n\nWhen I first walked into the O'Farrell Street location, I was convinced that this was a two-guys-and-a-kitchen outfit.  I was amazed to find that they're not only part of a chain but have a nice website.  They have none of the polish or gloss, numbly mechanical feel, or dumbed-down food of most multiple-location eateries.  They've instead perfected the art of delivering crave-worthy Indian and Pakistani food with a minimum of overhead.   \n\nNo middlemen (read: servers) get between me and the guys with access to the big pots of food.  I place my order and pay at the counter.  There'll be a short wait for my food, and I make myself useful:  grab a plate, glass, a few beat-up utensils, and napkins from the shelf next to the counter and dispense whatever drink I've paid for into the glass (no one else will do it for me).  Find a seat - they're all the same: simple kitchen chairs pushed under tables that are no more than four legs supporting a (mostly) horizontal surface.  Embellishment is unnecessary to function.  Listen and watch for my food to appear on the counter.  (It's a small place, and the perfectly-visible kitchen nearly dominates - it gives Pakwan an immediate feel.)  I usually identify my food by sight and a nod from the guy behind the counter - I've only understood his shout-out a couple of times.\n\nWhen I begin eating, it's always the same - there's a rush as I realize just how good this food is.  The heretofore unknown depth of my hunger makes itself known as it becomes apparent that this is fare to satisfy, not just take the edge off.  It tastes so good on the tongue that we always end up ordering a second round, and it usually includes the Saag Daal.  We eat until there's nothing left, push ourselves back from the table, and then work out a most pleasant food coma with a long and leisurely walk ...", "rating": 4, "date": "2007-07-22"}], "bhuna lamb curry": [], "achar gosht": [{"excerpts": ["the former was called \"Achar Gosht\" achar = pickle gosht = meat "], "author": "Wasil K.", "review": "Alright !! so when in America eat as Americans do .. and that is why we were here :D .. they love Indian curry and they love it from here. \nSaw a lot of take away orders flying away and why not .. the curries were quite good .. so were the naan breads. \nWell a bit later about those here ..\n\nSo, Pakwan is situated in a quietish street running parallel to a few alleys which are famous for all the wrong reasons. Thus, it is not as crowded as the Halal Guys .. :P .. a few 100 meters away but at the main road.\nJokes apart, if they all put an equal effort to maintain the ambiance and sitting and a few other things .. without a shadow of doubt, with the food they cook, they would become a fan favourite to a lot others .. not just the Indians and Pakistanis and Curry eaters but also to a lot of eager beavers :)\n\nSo we ordered 2 curries .. one was lamb and the other chicken .. the former was called \"Achar Gosht\" achar = pickle gosht = meat .. the other was \"karahi chicken\" karahi = name of a vessel :) .. \nBoth the curries were really really good .. the texture in the meats and the flavors in the curries were just right.\nLoved them.\nThe naan bread were absolutely lovely .. Quantity was great .. \nOverall, a great dinner.. Not that it was to our taste and all but overall the food was really nice.\n\nHope they invest a bit in overhauling the ambiance and a little attention to detail.. it would pay dividends for sure.", "rating": 4, "date": "2017-04-06"}], "nihari": [{"excerpts": ["Nihari with lamb shank- yummmm! ", "This one came with a huge lamb shank. ", "Again, so well spiced that curry is. "], "author": "Latifa S.", "review": "Second best indian food in the city~  second location that is!\n\nI've been frequenting Pakwan for a while. To a point that I'd plan my work/personal trip around this area so I can stay close by and eat here!! It's no secret that I loveee the food from here. I'm pretty sure almost everyone that knows me know about this spot. They are pretty magic!\n\nCame to this place on a Saturday morning after we arrived in the city. It was empty! And it is byob so we came prepared with our own bottle of wine and such!\n\nAmbiance- much smaller than mission location. \nSelf-serve place with smaller kitchen. They call your number, you go get your food. So you definitely need to have a table especially if you want to order many dishes like me.The menus are at the counter- it's cash only!  \n\nFood-\nThere may or may not have been a vegetarian section on the menu but seriously? Who'd look at it when you have so many amazing meat choices. \nThey have kebobs, chicken /beef/lamb curries, biryanis (chicken, mutton) and $1 chai!! Zomg. So many to choose. It is also a mixture of North Indian and South Indian food. Talk about the best of both world. \n\n1. Biryani - it was well spiced! So tasty and spicy!! Need to be a little hotter in temp but it was tasty!!Two non indians including me tolerated that spice really well, if not loved it.\n\n2. Kabobs- nicely spiced. Tasty with loads of fresh onions and jalapenos.\n3. Chicken curry  - with jalapenos and fresh ginger slices on top. This was probably the spiciest dish we had on the table.\n4. Nihari with lamb shank- yummmm! This one came with a huge lamb shank. Again, so well spiced that curry is. Nice, thick, tasty with a kick. \n\nThe portions were nice and big. Massive even!! And the best part- they were all around $9-$11 per entrée. I mean, wow! I'd probably skip the super spicy chicken next time. Or try a dish chicken dish but the rest were totally point on and mind blowing. \n\nDid I mention that they give you a pile of peppers with every dish? It's like an added bonus heat to already nicely spiced dishes. Actual spicy peppers. So hot, you wont stop eating! Yes, SF has so many Indian restaurants and yes, you can find amazing biryani else where. But since I've had their food in Mission, I've been hooked. And this place actually delivers for free. I've been there during a cold chilly spring time and didn't want to walk to this area, they delivered it.\n\nMinus one star for location/ambiance and for the service. I've yet to come here and see this place busy.  But I did see some shady deals going down as we sat and enjoyed our food by the windows! Love the food though!!", "rating": 3, "date": "2016-02-17"}, {"excerpts": ["In the curry variety I like achari chicken , Nihari and Bhuna gosht ( Minced lamb) "], "author": "Nikita R.", "review": "I've been eating here for 2 years now . I am Biryani enthusiast and I get biryani from here at least twice a week! Love the food and service especially for a place in the tenderloin area.  The place is great for take out they  prepare your food really quick and fresh. I love spicy food and they customize the spice in my food on request. \n\nThe biryani portion is really good for the price . If you are looking for south indian hyderabadi /ambur  biryani etc then this is not the place for you( Don't complain if you don't get what you're looking for) . The biryani here is unique in its own way and has definitely won a place in my heart among other biryani varieties. \n\nThe naan is really soft and fluffy  and freshly made in the tandoor pot . \nI also like the chicken boti kebab - Tender , well marinated and cooked well .\nIn the curry variety I like achari chicken , Nihari and Bhuna gosht ( Minced lamb) totally worth the money .\n\nWhen I am not having biryani I usually kill the craving by have a samosa or two . Its kinda oily but good . \nThe best thing about my pakwan experience when I walk back home and the aroma of the food from the bag makes other people ask me what food I got :D especially in the elevator ! their expression is worth it !", "rating": 5, "date": "2016-05-25"}, {"excerpts": ["They had special on Lamb Shank Nihari - good. ", "Biryani - Excellent. ", "Chicken Tikka Masal - Excellent and the Chicken Tikka and Beef kabab were also to die for. ", "Highly recommend this place."], "author": "Ray D.", "review": "Visited this place this week during our family trip and I tell you, being a Pakistani who knows his food. I would highly recommend this place. I did the research on Yelp before visiting. Found the reviews to be very helpful and is the reason decided to write this review. They had special on Lamb Shank Nihari - good. Biryani - Excellent. Chicken Tikka Masal - Excellent and the Chicken Tikka and Beef kabab were also to die for. Highly recommend this place.", "rating": 5, "date": "2014-08-09"}, {"excerpts": ["Highly recommend the Chicken Breast, Chicken tikka masala, Nihari and seek Kabab."], "author": "Asif M.", "review": "Pakwan is my go-to place for Indian food, mainly because it is only 30 min away from where I live and best food in SF.  \n\nThis is hands down one of my favorite Indian restaurants anywhere! \nI love this place! Don't let the fact that it's located in Tenderloin fool you.  This is an AUTHENTIC family owned business with best of the best indian/Pakistani food I've ever had. \n\nHighly recommend the Chicken Breast, Chicken tikka masala, Nihari and seek Kabab.", "rating": 5, "date": "2014-10-09"}, {"excerpts": ["nihari for nihari addicts..\n\n"], "author": "Saher S.", "review": "I feel like it's time i gave Pakwan the review it deserves, because i go here almost every week and theirs is the closest thing in San Francisco to real Pakistani food. There's a difference between Pakistani and Indian food, and Pakwan leans a bit more towards the Pakistani style in most of their dishes.\n\nFirst off, can't get enough of their chicken biryaani, i love the browned onions they put in there. BEST biryaani i've had in the bay area. Goes great with saag paneer. Other top dishes: chicken tikka, paneer masala, bengan ka bharta, okra. oh and haleem when they have it! the haleem is so worth trying. nihari for nihari addicts..\n\nPeople who are finicky about the chicken on the bone and stuff should maybe tell the guys taking the order that they want boneless, because they usually do what they can. when i ask for only white meat in my biryaani, that's what i get. they're always super super nice every time i have been there (maybe because i speak to them in urdu..) and Pakwan food is like home away from home. \n\nThere are places you go to not because of the ambiance or the service (which in my opinion is pretty great) but because the food is delicious and cheap. Pakwan has delicious, cheap food. My friends and I love coming here, those who hadn't had biryaani etc were in some kind of ecstasy!\n\nGo up one block on jones and try out Karachi Classics (their sister restaurant) also CHEAP AND DELICIOUS. achar chicken paratha roll, YES.", "rating": 5, "date": "2012-06-26"}, {"excerpts": ["My new favorite dish here must be the Nihari. ", "Nihari would be a \"Last Supper\" dish for me. ", "It brings tears to my eyes to think of how delicious this food item is. ", "Their Naan (I'm a fan of the plain regular naan) is always fluffy and perfect coming out of the clay oven. ", "Garbanzo bean dish, samosas, and spinach with goat cheese make me a believer that food without meat can be delicious. ", "I am known to make the 90 mile drive all the way out to San Francisco just for Pakwan. ", "Finding parking isnt always easy and the neighborhood isnt the greatest, but I'd travel miles and miles just to come here."], "author": "Jon L.", "review": "My new favorite dish here must be the Nihari. Nihari would be a \"Last Supper\" dish for me. It brings tears to my eyes to think of how delicious this food item is. Their Naan (I'm a fan of the plain regular naan) is always fluffy and perfect coming out of the clay oven. Garbanzo bean dish, samosas, and spinach with goat cheese make me a believer that food without meat can be delicious. I am known to make the 90 mile drive all the way out to San Francisco just for Pakwan. Finding parking isnt always easy and the neighborhood isnt the greatest, but I'd travel miles and miles just to come here.", "rating": 5, "date": "2009-12-05"}], "seekh kabab  piece": [], "chicken seekh kabab  piece": [], "tandoori chicken breast": [{"excerpts": ["Would go back if I'm ever in San Francisco\n\nTandoori Chicken Breast was great. "], "author": "Ayaz H.", "review": "Parking is a mess so it is best to order delivery or to have one more person with you so you can take food to go. Food was incredible. Truly authentic taste. Would go back if I'm ever in San Francisco\n\nTandoori Chicken Breast was great. Truly captures the taste of Chicken Tikka that you would find in Pakistan. The spice might bother some people though. \n\nThe Tandoori Chicken Boti and the Bihari Boti Kabab were really good. Get it with naan.\n\nAvoid the Biryani. It is always a letdown when restaurants add potatoes to it. Completely messes up the taste. \n\nThe prices were very reasonable as well. \n\nIt is better to call your order instead of doing it online to make sure they have the item in stock. If they are out of an item it makes it a mess trying to get a refund.", "rating": 5, "date": "2016-12-22"}, {"excerpts": ["We had the Karahi Chicken, Tandoori Chicken Breast, Tandoori Chicken Boti, and Chicken Tikka Masala. ", "All of it was delicious -- no complaints! "], "author": "Amber B.", "review": "Pakwan delivered a great Mother's Day meal and fantastic service. \n\nWe were mistakenly charged twice but the manager gave us free desserts as an apology which was extremely generous and definitely not needed since they voided the extra charge! It was such a nice gesture and unexpected. \n\nI grew up in a Pakistani household and the food here satisfies my craving for a home cooked Pakistani meal. We had the Karahi Chicken, Tandoori Chicken Breast, Tandoori Chicken Boti, and Chicken Tikka Masala. All of it was delicious -- no complaints! The gulab jamun was great as well. \n\nCome here if you're looking for some genuinely tasty Indian/Pakistani food.", "rating": 5, "date": "2015-05-10"}, {"excerpts": ["Naan was excellent and fluffy, the tandoori chicken breast tender and moist. ", "Keep it up!"], "author": "Ali S.", "review": "Good food at a great price. Naan was excellent and fluffy, the tandoori chicken breast tender and moist. Keep it up!", "rating": 5, "date": "2015-05-04"}, {"excerpts": ["The Tandoori Chicken Breast with onions and cilantro is usually half gone by the time it makes it to the dinner table. ", "The delivery time is decent even though it's hard to wait for such delicious items :)"], "author": "Mariell R.", "review": "I would put 4 stars since the Naans are hit or miss but since they deliver I selected 5. I thank the gods every time I want take out and I can pick up the phone and call Pakwan for some yummy Pakistani food. The Chicken Tikka Masala is flavor full and has a bite to it. The Tandoori Chicken Breast with onions and cilantro is usually half gone by the time it makes it to the dinner table. The delivery time is decent even though it's hard to wait for such delicious items :)", "rating": 5, "date": "2007-03-05"}], "tandoori chicken leg": [], "tandoori chicken tikka boti": [{"excerpts": ["Tandoori Chicken Tikka Boti is soo falvorful and juicy, my favorite so far. ", "Bengan Bhartha and Chicken Tikka Masala were very good also. ", "And very good prices!"], "author": "Vol T.", "review": "Very hole in the wall. A little dirty. But dayum the food is awesome! Tandoori Chicken Tikka Boti is soo falvorful and juicy, my favorite so far. Bengan Bhartha and Chicken Tikka Masala were very good also. And very good prices!", "rating": 4, "date": "2014-03-18"}], "beef boti kabab": [], "chicken boti kabab wrap": [], "tandoori lamb chops  pieces": [], "fish fillet of sole": [], "karahi chicken": [{"excerpts": [".. the other was \"karahi chicken\" karahi = name of a vessel :) .. \n", "Both the curries were really really good .. the texture in the meats and the flavors in the curries were just right.\n", "Loved them.\n", "The naan bread were absolutely lovely .. ", "Quantity was great .. \n", "Overall, a great dinner.. ", "Not that it was to our taste and all "], "author": "Wasil K.", "review": "Alright !! so when in America eat as Americans do .. and that is why we were here :D .. they love Indian curry and they love it from here. \nSaw a lot of take away orders flying away and why not .. the curries were quite good .. so were the naan breads. \nWell a bit later about those here ..\n\nSo, Pakwan is situated in a quietish street running parallel to a few alleys which are famous for all the wrong reasons. Thus, it is not as crowded as the Halal Guys .. :P .. a few 100 meters away but at the main road.\nJokes apart, if they all put an equal effort to maintain the ambiance and sitting and a few other things .. without a shadow of doubt, with the food they cook, they would become a fan favourite to a lot others .. not just the Indians and Pakistanis and Curry eaters but also to a lot of eager beavers :)\n\nSo we ordered 2 curries .. one was lamb and the other chicken .. the former was called \"Achar Gosht\" achar = pickle gosht = meat .. the other was \"karahi chicken\" karahi = name of a vessel :) .. \nBoth the curries were really really good .. the texture in the meats and the flavors in the curries were just right.\nLoved them.\nThe naan bread were absolutely lovely .. Quantity was great .. \nOverall, a great dinner.. Not that it was to our taste and all but overall the food was really nice.\n\nHope they invest a bit in overhauling the ambiance and a little attention to detail.. it would pay dividends for sure.", "rating": 4, "date": "2017-04-06"}, {"excerpts": ["The Karahi chicken curry is nicely done. ", "Lots of seating."], "author": "Susan T.", "review": "I like this Fast food Indian cuisine that's open late until 10:30pm. Avoid the chai tea. Because it tastes like badly diluted black tea. The Karahi chicken curry is nicely done. Lots of seating.", "rating": 4, "date": "2016-11-21"}, {"excerpts": ["We had the Karahi Chicken, Tandoori Chicken Breast, Tandoori Chicken Boti, and Chicken Tikka Masala. ", "All of it was delicious -- no complaints! "], "author": "Amber B.", "review": "Pakwan delivered a great Mother's Day meal and fantastic service. \n\nWe were mistakenly charged twice but the manager gave us free desserts as an apology which was extremely generous and definitely not needed since they voided the extra charge! It was such a nice gesture and unexpected. \n\nI grew up in a Pakistani household and the food here satisfies my craving for a home cooked Pakistani meal. We had the Karahi Chicken, Tandoori Chicken Breast, Tandoori Chicken Boti, and Chicken Tikka Masala. All of it was delicious -- no complaints! The gulab jamun was great as well. \n\nCome here if you're looking for some genuinely tasty Indian/Pakistani food.", "rating": 5, "date": "2015-05-10"}, {"excerpts": ["The Karahi chicken was cooked with lots of black peppercorn and had a lot of flavors. ", "Saag paneer was very rich with very good cheese cubes. "], "author": "T L.", "review": "(See pics)\n\nFairly spicy and delicious local joint. The food is rich. The sauce is thick but not as thick as Shalimar. The multiide of Pakistani / Inidan places in the Loin makes each of them unique, depending on your mood for the food, you will always find something you love.\n\nI love this place's colorful ceiling covering and bright lighting. Most of the writings are in English and it makes the menu look less intimidating and you would not have to try to pronounce all the words.\n\nThe Karahi chicken was cooked with lots of black peppercorn and had a lot of flavors. Saag paneer was very rich with very good cheese cubes. and aloo paratha was solid.\n\nThese 3 items that cost less than 20 bucks was a very very good deal.", "rating": 4, "date": "2011-06-08"}, {"excerpts": ["Next time we ordered garlic naan and karahi chicken. ", "Naan was good. ", "The chicken karahi was way too oily that I have to filter the oil out  of the container before serving. ", "And way too spicy and flavors not in the right proportional way. ", "Shalimar was way better in terms of tastier food though pakwan has a better decor and ambience."], "author": "Sumalatha R.", "review": "Not the best Indian food definitely. We went there twice.We ordered lamb biriyani  the first time. The biriyani was slightly sweet and sour in some chunks. The meat was too hard to chew. Next time we ordered garlic naan and karahi chicken. Naan was good. The chicken karahi was way too oily that I have to filter the oil out  of the container before serving. And way too spicy and flavors not in the right proportional way. Shalimar was way better in terms of tastier food though pakwan has a better decor and ambience.", "rating": 2, "date": "2013-07-10"}], "murgh cholay": [{"excerpts": ["Everything is delicious but the Chicken Tikka Masala and Murgh Cholay are my favorites.\n\n"], "author": "Mike J.", "review": "Pakwan is located in the heart of what could be called the Tenderloin Tandoori Triangle: Shalimar, Chutney and Pakwan all within a stone's throw of one another at the intersection of Jones and O'farrell. \n\nAll three are quite good in their own way but I would have to say that Pakwan is my favorite. Shalimar is dirt cheap and very tasty but a bit too chaotic and grimy for my taste, Chutney has that bizarre ordering system where you wait in line to order and then again to pay, but Pakwan is ALL good! Fast, cheap and unlike many Indian dives, clean and friendly. Everything is delicious but the Chicken Tikka Masala and Murgh Cholay are my favorites.\n\nINSIDER'S TIP: Be sure to grab a seat next to the window facing the Gazebo Smoke Shop at the corner of Jones and O'farrell, fix your gaze on the spot right in front of the \"NO LOITERING\" sign in the shop's window, and feast your eyes on the Rich and Ever-Changing Pageant of Pure Tenderloinery unfolding before you as you feast your mouth on some really solid grub. Good Times!", "rating": 5, "date": "2012-04-30"}, {"excerpts": ["We ordered samosas, chicken biryani, murgh cholay, tandoori chicken and nan. ", "(yes, that IS indeed possible\n- murgh cholay had practically no \"cholay\" (garbanzo beans) and just four chunky pieces of chicken. "], "author": "Noor M.", "review": "We decided to try Pakwan after seeing the renovations that had been made to the exterior. However, by the end of our meal,we realized that the food had actually been better prior to the renovation =/\n\nWe ordered samosas, chicken biryani, murgh cholay, tandoori chicken and nan. Here is a list of Pros and Cons (of the food)\n\nThe cons:\n-The samosas came with the rest of the food instead of as an appetizer on their own\n-the samosa filling was rather bland \n-the chicken biryani was extremely spicy but not flavorful at all (yes, that IS indeed possible\n- murgh cholay had practically no \"cholay\" (garbanzo beans) and just four chunky pieces of chicken. (It is actually supposed to be a rich-curry based dish with spicy garbanzo beans and chicken)\n\n\nThe pros\n- the chicken biryani had little potatoes which is an authentic pakistani touch\n-the nan was soft and fluffy..\n- decently priced\n\nThe service was well.. strange, as our order number (as listed on the receipt) was announced and we had to go get the food ourselves. The restaurant was extremely noisy with the constant sound of the microwave beeping and the cooking staff yelling at each other.\n\nKeeping in mind the below-average food, the not-so-improved interior and the noise level, I doubt we will be returning. Instead, we'd prefer (and recommend) Shalimar (which is cash-only) but the food is wonderful.\n\nOverall rating - -\n\n2/5", "rating": 2, "date": "2011-09-09"}], "chicken makhanwala": [{"excerpts": ["I have heard nothing but great praises for this place and was pretty surprised when I tried them for lunch today at how mediocre my Chicken Makhanwala (butter chicken) was. ", "It tasted like when I try to make butter chicken at home - not very creamy, very little flavor, and with immensely overcooked chicken. ", "Like it's so overcooked"], "author": "K M.", "review": "I have heard nothing but great praises for this place and was pretty surprised when I tried them for lunch today at how mediocre my Chicken Makhanwala (butter chicken) was. It tasted like when I try to make butter chicken at home - not very creamy, very little flavor, and with immensely overcooked chicken. Like it's so overcooked, it tastes like it came out of a can. \n\nService maybe isn't the best either. \n\nAll their dishes are priced on the cheap because you add naan or rice if you would like them. \n\nNot sure I would try again...", "rating": 2, "date": "2016-01-19"}, {"excerpts": ["I tend to get the Chicken Makhanwala or the Chicken Tikka Masala. ", "I also get the Saag Paneer but love to double up sometimes and get the Chana Masala. ", "Definitely get the Naan too, I prefer plain Naan ", "Although embarrassing, I will admit that sometimes my boyfriend and I get all the Saag Paneer, Chana Masala, Chicken Makhanwala and the Chicken Tikka Masala. "], "author": "Kate D.", "review": "This is not the first time I've order Pakwan, nor will it be my last!!\n\nBest Saag Paneer ever!  You can really taste the spices and the cheese curds in it are anything but flavorless! I tend to get the Chicken Makhanwala or the Chicken Tikka Masala. I also get the Saag Paneer but love to double up sometimes and get the Chana Masala. Definitely get the Naan too, I prefer plain Naan but I have tried their Garlic Naan and was not disappointed. \n\nAlthough embarrassing, I will admit that sometimes my boyfriend and I get all the Saag Paneer, Chana Masala, Chicken Makhanwala and the Chicken Tikka Masala. We also tend to get delivery, and its always less than the estimated 45 mins. \n\nGuaranteed happy food coma after Pakwan :)", "rating": 5, "date": "2015-08-10"}, {"excerpts": ["Chicken makhanwala, achari ghosht, 2 naans and 2 sodas...all for $23! ", "A really great value. ", "I wasn't too wowed by the chicken dish, but the achari ghosht (lamb) was really good. ", "Would probably come back if am in the neighbourhood, and in the mood for Pakistani/Indian food."], "author": "Simika K.", "review": "Chicken makhanwala, achari ghosht, 2 naans and 2 sodas...all for $23! A really great value. I wasn't too wowed by the chicken dish, but the achari ghosht (lamb) was really good. Would probably come back if am in the neighbourhood, and in the mood for Pakistani/Indian food.", "rating": 3, "date": "2009-11-25"}, {"excerpts": ["The phone call I soon received, not the cockroach, is why I will never again solicit the deliciously spicy Chicken Makhanwala from Pakwan.\n\n", "If anyone has a good recipe for Chicken Makhanwala, send it my way - I will be making my own from here on out."], "author": "MJ P.", "review": "CARDAMOM SEED OR COCKROACH? YOU DECIDE\n\nMy heart is breaking.  It really feels like I just broke up with someone I truly loved.  It wasn't the cockroach in my samosas that ended my relationship with Pakwan tonight, it was being called a complete idiot by the delivery person/manager(?).  Oh sure, he chose different words but in essence he said I ride the short bus.  Here's how the break-up went down:\n\nAfter feverishly devouring one samosa in my dimly lit kitchen (lesson 1: do not eat take-out in dimly lit areas) I moved to the living room to start on the second.  The light from the t.v. grew brighter during a commercial break and cast its glow on the soggy cardboard box that held my remaining samosa...a familiar shape was distinguished in the illumination - it looked like a small cockroach.  I thought my mind was playing tricks on me so I went back to the kitchen and threw on the light - it was a cockroach, not too big - a teenager I would guess.  It was about an inch long and met its fate earlier than most of its kind, yet how could one go out more gloriously than in a pair of Pakwan samosas?  Nay!  Not possible.\n\nLike any surprised and moderately disgusted customer, wondering if I had perhaps already consumed one of the intruders' friends, I called the restaurant to say that despite being a regular patron, on this occasion there was a cockroach in my food, that I was throwing it all out, so please do not charge me for it.  I was told by a woman that the delivery driver would call me back.  (This is where my assumption of the delivery driver being the managers arises).  The phone call I soon received, not the cockroach, is why I will never again solicit the deliciously spicy Chicken Makhanwala from Pakwan.\n\nA man called me, said he just delivered the food and asked what happened.  I told him I often called the restaurant, he said \"I know - I deliver to your house\" and I said that there was a cockroach in my samosas this time.  He said \"Oh, no, no - it's a spice.  It's a cardamom seed.\"  As shocked as I was to hear not an apology but that I was in fact retarded, not being able to tell an herb from a living critter, I said \"Sir, it's a cockroach - I'm looking at it, it's not a cardamom seed.\" He was then impelled to tell me that I didn't  know what cardamom looked like, that many people think they see a bug in their food but that it's just cardamom.  He laughed.  I said, \"Sir, it has legs.  I can see it's antennas.\"  After already having told me about 3 times that it wasn't a cockroach, he then told me he didn't want to argue about what it was or wasn't.  (Lesson 2: Your meal can get worse than finding a cockroach in it, no really, it can) I begged him to come back to my apartment and pick up the food.  I told him I wanted him to see it since he was telling me that I didn't know what I was looking at.  He told me he wasn't near my house and asked me if I wanted a credit.\n\nThe difficult thing is that I'm a reasonable person - I understand that restaurants are places that keep large amounts of food and from time to time they will have issues with little critters wanting to get at that food, but being a reasonable person, I simply wanted an apology and an offer to correct the issue.  What I got was insulted and argued with and I had to tell the gentleman that I wouldn't be calling them anymore.  I went so far as to tell him that I had considered it a one-off incident but that with him insulting my intelligence, as if I couldn't identify a cockroach, I would no longer be giving them my business.\n\nThis is a sad day.  I understand that there is little \"service\" left in the food industry, we are supposed to be happy just to get the food we order, never mind expect it to be hot or bug-free, but to have a manager argue with me (a repeat customer who has recommended their place countless times!) as if I were stupid is just too low.\n\nIn summation I must say that although the food at Pakwan is amazing - it just doesn't compensate for poor service or flat out insults.  Adieu Pakwan!  Parting is such sweet sorrow...I hope that someone on the staff endeavors to enroll in \"Customer Service 101\" and seeks to entreat future customers with more respect than I was given.  As the Kluminator says, \"I'm sorry, you are out\".\n\nIf anyone has a good recipe for Chicken Makhanwala, send it my way - I will be making my own from here on out.", "rating": 1, "date": "2008-06-05"}, {"excerpts": ["The tastest chicken kebob boti me and my husband ever had and excelent chicken makhanwala great ordering for delivery and to-go."], "author": "Diane M.", "review": "The tastest chicken kebob boti me and my husband ever had and excelent chicken makhanwala great ordering for delivery and to-go.", "rating": 5, "date": "2006-09-22"}, {"excerpts": ["have been coming here for years, mostly for the chicken makhanwala, which is beyond heavenly. ", "seriously. ", "every time.\n \n", "i usually order that and the sabzi (mixed veggies), nan, rice, and some other dish (lamb/spinach the last time). ", "some dishes are a bit on the greasy side, but they taste so good", ", it's totally worth it. "], "author": "Yelp Y.", "review": "yum!! have been coming here for years, mostly for the chicken makhanwala, which is beyond heavenly. seriously. every time.\n \ni usually order that and the sabzi (mixed veggies), nan, rice, and some other dish (lamb/spinach the last time). some dishes are a bit on the greasy side, but they taste so good, it's totally worth it. and after all, one doesn't eat most indian food for weight-watching purposes.\n\nthe place is on a very questionable corner in the loin, and not the cleanest or most pleasant eatery, but again, i'm just there for the food, not looking to be coddled. good and cheap--works for me! plus everyone i've ever taken here--and that has added up over the years--has gone in looking wary and gone out looking like they've just discovered a hidden gem.", "rating": 4, "date": "2010-06-01"}]}