{"papadum  pieces": [], "mix vegetable curry": [{"excerpts": ["Top menu picks:\n\n#1 Mix Vegetable Curry\n#2 Chicken Boti Kabab or wrap, either one is amazing\n#3 Chicken Tikka Masala\n\nThings to note are the place does get packed, so weekday dining is best.  "], "author": "Peter R.", "review": "Total diamond in the rough, I love love love this place.  As mentioned in other reviews, the people here are awesome.  The food is top notch and yes, the liquor store across the street makes everything oh so that much better.  \n\nTop menu picks:\n\n#1 Mix Vegetable Curry\n#2 Chicken Boti Kabab or wrap, either one is amazing\n#3 Chicken Tikka Masala\n\nThings to note are the place does get packed, so weekday dining is best.  Make sure to grab both bottles of condiments from the fridge located to left of the line, they are amazing!  Pay attention for your number when called, it shows on the TVs as they come out.", "rating": 5, "date": "2012-01-18"}], "mirch salan": [{"excerpts": ["I ordered four types of naan: garlic, plain, aloo and Kheema along with my personal favorite of Mirch Salan and Aloo Palak. "], "author": "Pranav B.", "review": "Being Indian and having eaten in most of the South Bay Area Indian restaurants, I was expecting a lot from Pakwan. More so, because of the glowing reviews. This place did not disappoint me one bit. Came here with a friend on Friday evening and luckily got a table. I ordered four types of naan: garlic, plain, aloo and Kheema along with my personal favorite of Mirch Salan and Aloo Palak. All four were delicious and portions were huge. \n\nBeware of the crowds especially on weekends.", "rating": 5, "date": "2016-07-01"}, {"excerpts": ["What I love here is:\nthe Mirch Salan, very very flavourful.\n", "Chana masala\nSamosas\nChicken Tikka Masala.\n"], "author": "Sandra W.", "review": "I heart SF food. I heart Pakwan. My friends use to bring me to this place and relax with a cup of Chai. I absolutely LOVE Northern Indian food. This is definitely Pakistan/Indian food. The flavor, the aroma, the personality of the servers. \n\nNote: Cash Only and BYOB. It feels like a place where everyone mingles. \nSo you order at the counter, get a number, and snatch a seat. The place is really clean and the price is extremely reasonable. Under $10 can fill you up.\n\nWhat I love here is:\nthe Mirch Salan, very very flavourful.\nChana masala\nSamosas\nChicken Tikka Masala.\nGarlic Naan\nLamb Biryani\n\nThis place is just YUMMY!", "rating": 5, "date": "2014-05-19"}, {"excerpts": ["I have been coming back & yes weekly & recently I've had the pleasure to try the mirch salan & the chana masala & FINALLY actually come & in sit down instead of take-out!\n\n", "The mirch salan is absolutely delicious! ", "Very flavourful, hint of tang & sourness, super rich & delicious either way!\n", "Chana masala is too bland of a dish for me "], "author": "Zhenya S.", "review": "I have been coming back & yes weekly & recently I've had the pleasure to try the mirch salan & the chana masala & FINALLY actually come & in sit down instead of take-out!\n\nThe mirch salan is absolutely delicious! Very flavourful, hint of tang & sourness, super rich & delicious either way!\nChana masala is too bland of a dish for me but it's still executed superbly!\n\nLast thing I definitely recommend for everyone get some friends to come & BYO alcohol of choice & order yourselves some delicious food & hang out! The atmosphere is really fun & crowded & for someone reason it's a really nice place to just chill at and work on your brews even after you finish the delicious food!", "rating": 5, "date": "2014-04-13"}, {"excerpts": ["My friends and I also love the Mirch Salan roasted hot peppers (light green, like banana peppers), cooked in a dark brown tamarind curry. \n\n"], "author": "angela n.", "review": "The saag paneer is just great here. Very rich and aromatic, with dark well-seasoned spinach and savory cheese. My friends and I also love the Mirch Salan roasted hot peppers (light green, like banana peppers), cooked in a dark brown tamarind curry. \n\nMy friend used to date a Pakistani guy who declared Pakwan \"the real thing.\"  The guy's no longer in the picture, but this has remained my friend's favorite restaurant ever since. \n\nTips:\n\n- Bring your fast-moving aggressive friends.  This place gets packed, and the seat-yourself policy means you have to hustle when a table frees up.\n\n- The overwhelming aroma of tandoori will stick to your clothes and bags and jackets  -- keep that in mind when you dress up to go here.  The scent kept me hungry for days as I'd catch a whiff of my messenger bag every now and then.", "rating": 4, "date": "2009-01-11"}, {"excerpts": ["The mirch salan (whole chili peppers in a thick red sauce) was probably authentic but not to my liking. ", "My scalp sweats even as I think of it. ", "The pepper was way too hot for me. ", "Even cutting the pepper into pieces and having small pieces with the sauce barely helped. ", "I'm not faulting their rating on this, as I got what was advertised, and it is a pepper's destiny to be spicy, but I was unable to finish it and would not order this dish again. "], "author": "Charles B.", "review": "It's been a while since I've been here, and I always remember it being great in the past, but today's experience was barely a 3-star experience.\n\nFirst off, the dining room was quite smoky from the grill. Oh, well, they have great food, right.\n\nWell, the onion naan wasn't ready until several minutes after the food was, so by the time I got the naan (which they were nice enough to bring to my table) the two dishes I was going to be eating them with were noticeably cooling down. Then it was soft on the inside, as if the cooking had been rushed (because of it not being synched with the rest of the food). So it loses the rest of the points there.\n\nAs for the dishes, the Saag Daal (lentils and spinach) it was very tasty but I didn't notice any spinach, only lentils. Still it was, as I said, tasty. So I good my taste needs met but not my balanced meal needs.\n\nThe mirch salan (whole chili peppers in a thick red sauce) was probably authentic but not to my liking. My scalp sweats even as I think of it. The pepper was way too hot for me. Even cutting the pepper into pieces and having small pieces with the sauce barely helped. I'm not faulting their rating on this, as I got what was advertised, and it is a pepper's destiny to be spicy, but I was unable to finish it and would not order this dish again. The sauce was very good and went well with the naan.\n\nAnd it wasn't even burn-the-mouth spicy, it was that flavor note that some hot peppers had which rendered it unpleasant for me.\n\nAll in all, I would not be inclined to come back until they (1) get better ventilation and (2) it is not a busy time, so the synchronization problem is less likely to occur.\n\nThis review applies only to this specific location.\n\nEdit: As of the next day, my jacket smells of smoke.", "rating": 3, "date": "2009-01-01"}, {"excerpts": ["the important thing about pakwan is that they consistently carry Nihari and Mirch Salan, two often overlooked or completely forgotten dishes at other indian/pakistanian restaurants."], "author": "christopher a.", "review": "the important thing about pakwan is that they consistently carry Nihari and Mirch Salan, two often overlooked or completely forgotten dishes at other indian/pakistanian restaurants.", "rating": 3, "date": "2008-03-14"}, {"excerpts": ["My picks: achari gosht, the okra special,  mirch salan..."], "author": "Charlie P.", "review": "Pakwan rocks!  Really authentic \"dhaba\" style Indo-Pakistani eats. Very inexpensive. Definitely take a look at the daily specials as those end up being the best thing available. My picks: achari gosht, the okra special,  mirch salan...", "rating": 5, "date": "2007-10-26"}], "tandoori chicken breast  piece": [], "tandoori chicken leg  piece": [], "tandoori chicken boti": [{"excerpts": ["Achari gosht and tandoori chicken boti are highly recommended. ", "In vegetarian section I have enjoyed saag paneer and daal. ", "Friendly service at the counter."], "author": "Nona H.", "review": "Achari gosht and tandoori chicken boti are highly recommended. In vegetarian section I have enjoyed saag paneer and daal. Friendly service at the counter.", "rating": 4, "date": "2018-10-30"}, {"excerpts": ["Samosas served with chole were fantastic and so was the tandoori chicken boti. ", "Basically seems like you cannot go wrong with the meat here. ", "They also let you bring your own beer and wine in store.  ", "No hard liquor though since they do not have a license for that."], "author": "Pancham P.", "review": "Amazing food. Everything was delicious, and we were so glad this was open on Thanksgiving. We tried lamb curry, baigan bharta, and daily special chicken haleem. I was too full, but ordered one more chicken haleem since it was freaking awesome. The portions are good to share for 2-3 people. Garlic naan was fresh soft and delicious as well. Samosas served with chole were fantastic and so was the tandoori chicken boti. Basically seems like you cannot go wrong with the meat here. They also let you bring your own beer and wine in store.  No hard liquor though since they do not have a license for that.", "rating": 5, "date": "2016-11-25"}, {"excerpts": ["Homeboy and I ordered: \n\nTandoori Chicken Boti (boneless marinated chicken on skewers and grilled) and Sabzi (mixed vegetable curry). \n\n"], "author": "Nikki H.", "review": "Joyous!! Another badass establishment that shares my love for the 'pay first, then sit and grub' process. But let's get to the major plus of Pakwan: the ultra-cheap and ultra-satisfying food. Can I reiterate how much I love Indian food? God, I love it. \n\nHomeboy and I ordered: \n\nTandoori Chicken Boti (boneless marinated chicken on skewers and grilled) and Sabzi (mixed vegetable curry). \n\nBoth dishes came in their own big bowl and were piping hot, spicy, and fresh tasting. \n\nWe ordered garlic naan, which was made-to-order, hot, as thick as pizza dough, and all-around amazing. If you prefer thinner naan, you might not like it...pussy. \n\nWe also tried our friend's Saag Paneer (a spinach and mustard leaves-based curry dish), which was a little mild, but yummy. \n\nOne word on the B.Y.O.B: It's rad and all, but if you're thinking it might be a good idea to sneak a few of your leftover beers into Kilowatt (the bar next door), it's not. It's a bad idea. Just finish your beers in Pakwan. Getting kicked out of a bar can be embarrassing. Especially if you retain absolutely zero dignity whilst being ejected from said bar. Not a true story or anything. I'm just saying.", "rating": 5, "date": "2008-05-13"}], "beef boti kabab": [{"excerpts": ["The beef boti kabab was tough and smelled of lighter fuel. ", "The special squash curry of the day was tasteless n oily. ", "Biriyani was excellent and the goat meat very soft! ", "Had to buy separate raita for it though. ", "Don't expect great hygiene standards esp in the restroom."], "author": "Pompy B.", "review": "I've eaten at several Pakwans around the Bay Area but 1st time at this location. The quality of food wasn't as great as the others and neither was the taste. The beef boti kabab was tough and smelled of lighter fuel. The special squash curry of the day was tasteless n oily. Biriyani was excellent and the goat meat very soft! Had to buy separate raita for it though. Don't expect great hygiene standards esp in the restroom.", "rating": 3, "date": "2016-08-01"}], "seekh kabab wrap": [], "chicken boti kabab wrap": [], "tandoori lamb chops  pieces": [], "fish fillet of sole": [], "bhuna lamb curry": [{"excerpts": ["Bhuna Lamb curry,  ", "Briyani (Lamb/Chicken) are my favorites.  ", "Keep up the good work and the place gets packed in the evenings, so plan accordingly."], "author": "Sarav C.", "review": "Pakwan is handsdown the best Indian food I have tasted in the city.  Since I moved here from Boston area, a friend took me there for dinner.  I judge Indian food by the flavor taste and many dishes are as close as my mom makes.  There is no other comparison better than my Mom's cooking.  Bhuna Lamb curry,  Briyani (Lamb/Chicken) are my favorites.  Keep up the good work and the place gets packed in the evenings, so plan accordingly.", "rating": 5, "date": "2016-01-04"}], "gulab jamun  pieces": []}