{"soup of the day": [], "roasted beet salad": [{"excerpts": ["The roasted beet salad was rather small and only average.  ", "Ordered medium-rare, the Wagyu beef entrée ($23) was overcooked and tough.  ", "Served with cheese, lettuce, and pickle on a plump bun, the burger ($13) was OK, but ", "nothing special.  "], "author": "CJ G.", "review": "Palmer's Tavern disappoints on so many levels.\n\nThe menu at Palmer's Tavern centers on more substantial dishes and could use the addition of some lighter selections for women or those who are less hungry.  The roasted beet salad was rather small and only average.  Ordered medium-rare, the Wagyu beef entrée ($23) was overcooked and tough.  Served with cheese, lettuce, and pickle on a plump bun, the burger ($13) was OK, but nothing special.  French fries were so salty that they were almost inedible.\n\nWhile service at the bar was slow, the cocktails ($8.75) that were finally served were well made.  Service in the dining room is disorganized at best and haphazard at worst.  There seems to have been no planning to the waitstaff's workflow, and there is a great deal of wasted effort, resulting in slow, inefficient service.\n\nA surprising disappointment from Albert and Klaus Rainer of the wonderful Leopold's on Polk Street, Palmer's Tavern is trying hard, but failing miserably.", "rating": 2, "date": "2014-01-07"}, {"excerpts": ["None of the dishes were standouts: the deviled eggs, roasted beet salad, caesar salad (my entree) or pasta (his).  ", "Nothing bad, just not as good as you can get elsewhere in San Francisco."], "author": "Robin W.", "review": "I wish this was better, as I like the looks, the location (near my house) and the no-reservations policy.  My BF and I went for the first time on a Saturday night, arriving just before 7 and were promptly seated.  Good service.  Mediocre cocktails.  My tequila diablo was (predictably, my Bf informed me) too sweet; his old fashioned was okay.  None of the dishes were standouts: the deviled eggs, roasted beet salad, caesar salad (my entree) or pasta (his).  Nothing bad, just not as good as you can get elsewhere in San Francisco.", "rating": 3, "date": "2013-09-28"}], "iceberg wedge salad": [{"excerpts": ["We shared an iceberg wedge salad, which was exactly what you would have expected for this type of salad. "], "author": "Christa S.", "review": "I would give this a solid 3.5 stars, but alas, Yelp only allows stars without decimal points, so since I feel like it was OK and I'm not a total fan, I'll go with the 3-star rating. Went here my first night of a weekend visit to San Francisco with Sam C. It was within walking distance of her place, which was great, especially since the walk to dinner was more/less downhill (meaning the walk back did mean we were going uphill!). It had a very neighborhood-like feel and was definitely packed when we got there. They had a table for the two of us in the back and when we got back there, it was definitely HOT. We were seated and our waitress came by and got our drink orders (red wine, please!) and then we agreed to do some sampling and splitting of things from the menu. We shared an iceberg wedge salad, which was exactly what you would have expected for this type of salad. Then we split some orders of pulled pork sliders (yum!), a Palmer's burger, French fries and Burratta (which I personally thought was a disappointment). All in all, it was great to visit with a fantastic friend in a convenient spot with good variety and plates that were shareable. I just thought for the price of the food and wine that the quality of our meal would have been a little bit better.", "rating": 3, "date": "2015-11-23"}], "organic baby kale salad": [], "chefs daily special": [], "pave potatoes": [], "curried french fries": [], "seasonal vegetables": [], "roasted brussels sprouts": [], "mac  cheese": [], "flatbread": [{"excerpts": ["Food was shockingly good, I don't know if the chefs were just on tonight but the Devilled Eggs were delicious and original while the flatbread made a filling and tasty appetizer.\n\n"], "author": "Jordan C.", "review": "Was shockingly surprised. The decore is quite comfortable, dark, lots of wood. I was there on a Wednesday and there was a surprisingly jumping bar scene going on. At 8:00 I had no issue securing a table for 3 for my friends and I.\n\nService was excellent. The waitress and maitre'd were both friendly and prompt. Food was shockingly good, I don't know if the chefs were just on tonight but the Devilled Eggs were delicious and original while the flatbread made a filling and tasty appetizer.\n\nThe real winner was the duck ragu with gnocci, it was meaty, delicious, rich and filling and I almost kept eating after I was full. We paired it with the mussels which had a very delicious sauce/broth and were fresh and large. With 5 drinks, food, and a decent tip it was about $50-$60 each.\n\nRecommended.", "rating": 4, "date": "2018-04-25"}, {"excerpts": ["Another dish, an exuberant breakfast flatbread, received a similar stamp of approval from my tablemates. \n\n"], "author": "Tracey A.", "review": "Apparently I did this wrong.  You're only supposed to drink here, and only during happy hour when you can get great deals on food.  Mea culpa.  I brunched here, late on a Saturday afternoon, without first reading the yelp instructions:  happy hour happy hour happy hour.   \n\nBut let me tell you about brunch.  \n\nThe inside was dead as can be and, as a result, looked like a completely inhospitable place to brunch unless one sought alone time with one's newspaper, a bloody mary, a stiff cuppa joe, and food.  There's a market for that and if you're that market, welcome to Palmer's.\n\nThere's several sidewalk tables which bring you a little more up-front and center with humanity and signal the onset of a good time.  Of course I brunched there and since I'd done no reconnaissance my expectations were low.  The result?  A tasty fennel sausage omelet, good home-fried potatoes, oft-refilled coffee, and a perfectly chilled bottle of Rosé.  Another dish, an exuberant breakfast flatbread, received a similar stamp of approval from my tablemates. \n\nPalmer's isn't trying to be the latest thing which probably accounts for the reason it'd never before wound up on my radar.  But often, one just wants brunch, and not from the trendiest spot in town.  Palmer's is nice looking inside and serves up a good brunch and, apparently, a great happy hour.  Tuck that fact away for the next time you just want a solid meal and drinks without needing to book a reservation months in advance.", "rating": 4, "date": "2015-09-27"}, {"excerpts": ["We ordered the vegetarian gnocchi, burratta with peas, beet salad, flatbread, mussels and burger with curry fries. ", "All except the burratta were much better then expected. ", "I somehow thought it would be mediocre bar food, but was definitely an elevated meal. ", "The big disappointment was the burratta, which was tasteless and crying out for salt, pepper, olive oil and/or aged balsamic. ", "I'm a huge burratta fan, and was bummed that is arrived so bland.\n\n"], "author": "Victoria O.", "review": "I must say that I was pleasantly surprised by our dinner at Palmer's. We were a group of six, looking for a table at 8pm on a Saturday evening. We called up Palmer's and to our surprise they had a booth for us. When we arrived the place was hopping. Super loud, do not go for an intimate dinner for two. Unless you are cool people watching, and not being able to hear yourself think. We had company from London, so with the thought that we wanted to hear each other, the hostess moved us to a back booth with a curtain. Perfect space to dine like a King.\n\nWe started off with cocktails and deviled eggs. Cocktails were imaginative and delightful. Loved the Bee's Knees. Deviled eggs were good, and were able to order bacon free if you so desire.\n\nNext we ordered a bunch of plates and shared family style. We ordered the vegetarian gnocchi, burratta with peas, beet salad, flatbread, mussels and burger with curry fries. All except the burratta were much better then expected. I somehow thought it would be mediocre bar food, but was definitely an elevated meal. The big disappointment was the burratta, which was tasteless and crying out for salt, pepper, olive oil and/or aged balsamic. I'm a huge burratta fan, and was bummed that is arrived so bland.\n\nThe knockdown from five stars to four was for their dessert options. The menu selection was so boring we didn't even order a dessert to share. They definitely need to kick it up a notch in the desserts.\n\nStaff was friendly and attentive. I would definitely go back if I was with a group of three or more. Again, don't go thinking it is a romantic spot or a great place to catch up with a friend. Super loud, but fun with an old school steak house vibe. Fabulous place to get a cocktail or two.", "rating": 4, "date": "2015-07-06"}, {"excerpts": ["Flatbread was a little undercooked. ", "Sliders and shrimp however were nice. ", "Worth another trip back. ", "Good atmosphere."], "author": "Randy R.", "review": "Nice visit on a Friday night couple of drinks and some apps. Flatbread was a little undercooked. Sliders and shrimp however were nice. Worth another trip back. Good atmosphere.", "rating": 4, "date": "2016-05-03"}, {"excerpts": ["Flatbread is just ok. "], "author": "Riz W.", "review": "Came by on a weeknight for a couple apps and drinks:\n\nPretty hoppin' place!  Lively, nice ambiance.  \n\nFlatbread is just ok. I recommend the meatballs.\n\nCocktails were good. My husband and I sat at the bar, and the bartenders were friendly and could make a solid drink!", "rating": 4, "date": "2015-12-10"}, {"excerpts": ["I would highly recommend the flatbread and spicy meatballs. ", "Some of the best I've ever had in the city!"], "author": "Grant K.", "review": "I brought my family on a whim, but ended up actually really liking the restaurant. I had the sage gnocchi with bolognese sauce and it is now one of my go-to favorites. Our waitress, Molly, gave some solid recommendations on which which appetizers to start off with and the staff as a whole seemed extremely knowledgeable and pleasant. I would highly recommend the flatbread and spicy meatballs. Some of the best I've ever had in the city!", "rating": 5, "date": "2014-12-23"}, {"excerpts": ["Portion sizes were actually quite large as well - the flatbread could have worked for 3-4 people. ", "Unfortunately, I would agree with a lot of the other comments - service is not pro-active. ", "Water glasses continued to sit empty even when the tables next to us had their water refilled. ", "Silverware would disappear and we would have to ask for more. ", "The food was also not remarkable - the flatbread was the best part of the meal. ", "The pappardelle with mushrooms was very gummy - which we felt must have meant that it was sitting for a while. ", "The spinach side dish was very runny and had no flavor. ", "The decor was very odd with the deer heads, and some decor reminiscent of the 30s or 40s ", "but the menu didn't quite go and neither did some of the other decor on the walls. ", "All in all, it felt very disjointed. ", "We won't return as there are too many other great restaurants in the city - and even in the 'hood."], "author": "SY K.", "review": "We live in the neighborhood and have been anxious to try this spot, since it would be so convenient and also because we could use another great local place.  On the plus side, special cocktails were $8.75 which are a bargain. Also, our waiter was responsive especially when I didn't actually like the cocktail that I ordered.  When our filet arrived done versus medium rare, he also didn't skip a beat to return it.  Portion sizes were actually quite large as well - the flatbread could have worked for 3-4 people. Unfortunately, I would agree with a lot of the other comments - service is not pro-active. Water glasses continued to sit empty even when the tables next to us had their water refilled. Silverware would disappear and we would have to ask for more. The food was also not remarkable - the flatbread was the best part of the meal. The pappardelle with mushrooms was very gummy - which we felt must have meant that it was sitting for a while. The spinach side dish was very runny and had no flavor. The decor was very odd with the deer heads, and some decor reminiscent of the 30s or 40s but the menu didn't quite go and neither did some of the other decor on the walls. All in all, it felt very disjointed. We won't return as there are too many other great restaurants in the city - and even in the 'hood.", "rating": 2, "date": "2013-10-19"}], "steak tartar": [{"excerpts": ["I highly recommend the steak tartar!"], "author": "Tony B.", "review": "Had dinner tonight at Palmer's.  The food was excellent!  Atmosphere and staff made the dinner even more enjoyable.  I highly recommend the steak tartar!", "rating": 5, "date": "2014-05-10"}], "deviled egg": [{"excerpts": ["We ordered a deviled egg each which was topped with a small slice of bacon and a pickeled jalapeneo.  ", "It was also served with pickled onions, carrots and cauliflower.  ", "My son opted for the small plates of mac and cheese and creamed spinach - and a large glass of milk - which our server stated, \"Hadn't heard that in a while.", "\"   ", "My wife opted for the burger on a Brioche bun with curried fries.  ", "I had the pan roasted chicken that was served with Gruyere mashed potatoes and sautéed kale.  "], "author": "Tony A.", "review": "I visited the City yesterday with my family with the intent on exploring.  When it came down to dinner time we referenced Yelp for a suggestion.  The couple of places were either closed or had too long of a wait time that we did not want to deal with.  We decided to go to the Fillmore and we had a back plan of La Mediterranee - my wife and my first date together - a Classic and a sure thing on reminiscing alone.   As we finally found parking, we walked by Palmer's and I was enamored by the small groups of people eating outside and enjoying a nice libation out in the little bit of sunshine the City had to offer.  We continued to walk towards La Med when I came to a complete stop.  The thought of eating potentially good food in an old world bar atmosphere seemed like a good idea.  I talked my wife and eleven year old son into popping our heads in to explore a little bit more.  We decided to give it a go!\n\nWe ordered a deviled egg each which was topped with a small slice of bacon and a pickeled jalapeneo.  It was also served with pickled onions, carrots and cauliflower.  My son opted for the small plates of mac and cheese and creamed spinach - and a large glass of milk - which our server stated, \"Hadn't heard that in a while.\"   My wife opted for the burger on a Brioche bun with curried fries.  I had the pan roasted chicken that was served with Gruyere mashed potatoes and sautéed kale.  And a Ballast Point Sculpin.\n\nThe food was delicious - the atmosphere was the type where you could spend hours just sipping on a drink and eating at a slow leisurely pace.  My one regret was that I did not order a cocktail.  I had a feeling that it had a high chance of being made very well.  The barkeeps had a look of experience and looked sharp with their black slacks and white coats.  Absolutely loved the feel and vibe of the restaurant/bar - that it was older and refined.\n\nI would definitely show up for a drink and maybe the burger again or a pork chop.", "rating": 4, "date": "2015-09-07"}, {"excerpts": ["i did not like the deviled egg though, ", "b/c it was overcooked."], "author": "Helen T.", "review": "good happy hour w/ some cocktail specials.  i did not like the deviled egg though, b/c it was overcooked.", "rating": 3, "date": "2014-04-29"}], "mussels mariniere": [], "dry rub pork ribs": [], "marinated olives": [], "demons on horseback": [{"excerpts": ["Unfortunately, I was the only person in our party to have the \"Demons on Horseback\" (Bacon Wrapped Prawns, Cucumber Salad, Salsa Verde). ", "It should have been called \"Demons on Toilet\". ", "I got food poisoning and was up all night releasing the \"demons\". ", "When I finally came around Sunday night, I had enough energy to call the restaurant to give the manager a heads up. ", "I wanted to give them the benefit of the doubt because they did receive a 94 out of 100 health score, and alert the staff about the prawns. ", "The hostess was apologetic and promised that the manager would call when he/she was back. ", "I never received a call back. ", "I am truly disappointed with the managers and more disappointed with the lack of cleanliness from the kitchen. ", "My friends and I will regrettably not be coming back to this establishment. ", "No use wasting your time here if the food is poorly handled and the managers don't care about the well-being of their patrons."], "author": "Thomas H.", "review": "I went here on a Friday night and was looking forward to a fun dinner with friends. The service was great, which was not the issue. Unfortunately, I was the only person in our party to have the \"Demons on Horseback\" (Bacon Wrapped Prawns, Cucumber Salad, Salsa Verde). It should have been called \"Demons on Toilet\". I got food poisoning and was up all night releasing the \"demons\". When I finally came around Sunday night, I had enough energy to call the restaurant to give the manager a heads up. I wanted to give them the benefit of the doubt because they did receive a 94 out of 100 health score, and alert the staff about the prawns. The hostess was apologetic and promised that the manager would call when he/she was back. I never received a call back. I am truly disappointed with the managers and more disappointed with the lack of cleanliness from the kitchen. My friends and I will regrettably not be coming back to this establishment. No use wasting your time here if the food is poorly handled and the managers don't care about the well-being of their patrons.", "rating": 1, "date": "2018-07-11"}], "charcuterie platter": [{"excerpts": ["Some charcuterie platters are disappointing with just a few slices of meat but their charcuterie platter has heaps of cured meats. ", "At $20, I think it's a screaming deal. "], "author": "Wendy L.", "review": "Palmer's has one of the best and most generous charcuterie platters I've had. Some charcuterie platters are disappointing with just a few slices of meat but their charcuterie platter has heaps of cured meats. At $20, I think it's a screaming deal. The only other food I've had is the burger which is also really good. \n\nPalmer's is a great spot for a casual drink, either at one of the few tables out front on a warm afternoon or at the bar inside. They also have a great happy hour with select drinks and nibbles at $5 until 6 pm - not sure which days but definitely seems like it's M-Saturday!", "rating": 4, "date": "2016-01-09"}, {"excerpts": ["Generous portions of wonderfully presented deviled eggs, deliciously seasoned, dry rubbed ribs, diverse selection of cheeses and meats on the charcuterie platter, and lastly burata with ham and peas. ", "All fresh, all perfectly prepared. ", "Overall it was great, but we did have to knock off one star because the dining room can get very loud making conversation difficult at times. ", "But the drinks, food and service are all top notch!"], "author": "Rita G.", "review": "Expected to love the bar, and we did (good Happy Hour crowd and professional, friendly bartenders. Warm, sort of clubby, swanky decor). Did not expect much for the food and yet we were incredibly impressed with the quality, originality and favors. We went for multiple small plates that added up to a great dinner for two. Enjoyed different scotches followed by wine - great selection of each. Generous portions of wonderfully presented deviled eggs, deliciously seasoned, dry rubbed ribs, diverse selection of cheeses and meats on the charcuterie platter, and lastly burata with ham and peas. All fresh, all perfectly prepared. Overall it was great, but we did have to knock off one star because the dining room can get very loud making conversation difficult at times. But the drinks, food and service are all top notch!", "rating": 4, "date": "2015-05-25"}], "burratta": [{"excerpts": ["We ordered the vegetarian gnocchi, burratta with peas, beet salad, flatbread, mussels and burger with curry fries. ", "All except the burratta were much better then expected. ", "I somehow thought it would be mediocre bar food, but was definitely an elevated meal. ", "The big disappointment was the burratta, which was tasteless and crying out for salt, pepper, olive oil and/or aged balsamic. ", "I'm a huge burratta fan, and was bummed that is arrived so bland.\n\n"], "author": "Victoria O.", "review": "I must say that I was pleasantly surprised by our dinner at Palmer's. We were a group of six, looking for a table at 8pm on a Saturday evening. We called up Palmer's and to our surprise they had a booth for us. When we arrived the place was hopping. Super loud, do not go for an intimate dinner for two. Unless you are cool people watching, and not being able to hear yourself think. We had company from London, so with the thought that we wanted to hear each other, the hostess moved us to a back booth with a curtain. Perfect space to dine like a King.\n\nWe started off with cocktails and deviled eggs. Cocktails were imaginative and delightful. Loved the Bee's Knees. Deviled eggs were good, and were able to order bacon free if you so desire.\n\nNext we ordered a bunch of plates and shared family style. We ordered the vegetarian gnocchi, burratta with peas, beet salad, flatbread, mussels and burger with curry fries. All except the burratta were much better then expected. I somehow thought it would be mediocre bar food, but was definitely an elevated meal. The big disappointment was the burratta, which was tasteless and crying out for salt, pepper, olive oil and/or aged balsamic. I'm a huge burratta fan, and was bummed that is arrived so bland.\n\nThe knockdown from five stars to four was for their dessert options. The menu selection was so boring we didn't even order a dessert to share. They definitely need to kick it up a notch in the desserts.\n\nStaff was friendly and attentive. I would definitely go back if I was with a group of three or more. Again, don't go thinking it is a romantic spot or a great place to catch up with a friend. Super loud, but fun with an old school steak house vibe. Fabulous place to get a cocktail or two.", "rating": 4, "date": "2015-07-06"}, {"excerpts": ["Then we split some orders of pulled pork sliders (yum!), a Palmer's burger, French fries and Burratta (which I personally thought was a disappointment). ", "All in all, it was great to visit with a fantastic friend in a convenient spot with good variety and plates that were shareable. ", "I just thought for the price of the food and wine that the quality of our meal would have been a little bit better."], "author": "Christa S.", "review": "I would give this a solid 3.5 stars, but alas, Yelp only allows stars without decimal points, so since I feel like it was OK and I'm not a total fan, I'll go with the 3-star rating. Went here my first night of a weekend visit to San Francisco with Sam C. It was within walking distance of her place, which was great, especially since the walk to dinner was more/less downhill (meaning the walk back did mean we were going uphill!). It had a very neighborhood-like feel and was definitely packed when we got there. They had a table for the two of us in the back and when we got back there, it was definitely HOT. We were seated and our waitress came by and got our drink orders (red wine, please!) and then we agreed to do some sampling and splitting of things from the menu. We shared an iceberg wedge salad, which was exactly what you would have expected for this type of salad. Then we split some orders of pulled pork sliders (yum!), a Palmer's burger, French fries and Burratta (which I personally thought was a disappointment). All in all, it was great to visit with a fantastic friend in a convenient spot with good variety and plates that were shareable. I just thought for the price of the food and wine that the quality of our meal would have been a little bit better.", "rating": 3, "date": "2015-11-23"}], "pull pork sliders": [], "sage gnocchi": [{"excerpts": ["The sage gnocchi was amazing & the steaks here are better and bigger than what most chop houses offer - at a fraction of the cost. ", "A warm & cozy interior presents an inviting setting for a truly memorable dinning experience. ", "Al Fresco dining is also an option if the weather is warm. ", "Palmer's is the complete package."], "author": "Armando C.", "review": "A neighborhood gem. Palmer's has a large contingent of regulars and repeat customers that love: delicious food - hand crafted cocktails - a staff that treats you like family - affordable prices ~ all wrapped up in a classic San Francisco Victorian. The deviled eggs here were the best I've ever had- the mixed beet salad was fresh, delicious and big enough for two. The sage gnocchi was amazing & the steaks here are better and bigger than what most chop houses offer - at a fraction of the cost. A warm & cozy interior presents an inviting setting for a truly memorable dinning experience. Al Fresco dining is also an option if the weather is warm. Palmer's is the complete package.", "rating": 5, "date": "2018-04-19"}, {"excerpts": ["I can say with confidence get the braised lamb shank it is by far the best dish on the menu, after that sage gnocchi and ribeye are good. ", "the trout and salmon were good as well... ", "but the burger was awful! ", "(burnt).\n", "overall the place has great atmosphere, service and food. "], "author": "Arash H.", "review": "I went in expecting an average bar food but I was pleasantly surprised. we were group of 8 trying to make reservations on Friday for same day and lucked out! \nwe started out with Devil eggs, mussels and macaroni and cheese all of which were good but spicy meat balls was awesome! I got the ribeye which was good but my Friends got other dishes that I tried all, so I can say with confidence get the braised lamb shank it is by far the best dish on the menu, after that sage gnocchi and ribeye are good. the trout and salmon were good as well... but the burger was awful! (burnt).\noverall the place has great atmosphere, service and food. I will go back...\n\nTotally forgot to mention the fries!!! the curry fries at this place is to die for!!!", "rating": 4, "date": "2014-04-14"}, {"excerpts": ["I had the sage gnocchi with bolognese sauce and it is now one of my go-to favorites. ", "Our waitress, Molly, gave some solid recommendations on which which appetizers to start off with and the staff as a whole seemed extremely knowledgeable and pleasant. "], "author": "Grant K.", "review": "I brought my family on a whim, but ended up actually really liking the restaurant. I had the sage gnocchi with bolognese sauce and it is now one of my go-to favorites. Our waitress, Molly, gave some solid recommendations on which which appetizers to start off with and the staff as a whole seemed extremely knowledgeable and pleasant. I would highly recommend the flatbread and spicy meatballs. Some of the best I've ever had in the city!", "rating": 5, "date": "2014-12-23"}], "roasted idaho trout": [], "filet of salmon": [{"excerpts": ["* Filet of salmon ($26.75) - 3.5 stars\nDecent, but expensive for the quality."], "author": "Ziyan C.", "review": "I was surprised at how good the cocktails here! The food isn't anything to go out of your way for, but this was conveniently located across the street from the Clay Theater, so we pre-gamed here before one of their midnight showings. There is definitely a loud, happening vibe here on Friday nights. \n\nRESERVATIONS: We made reservations just a few days in advance online (8 people, 9pm, Friday). They were very flexible and let us sit late, when only 3 of us were there. Our group filtered in slowly over the next hour, and we had basically a private booth in the back (there was a curtain that drew closed around it!\n\nTHE COST: $211.11 before tax/tip for drinks and some dishes for 6 people.  Overall I felt their food was overpriced, but the drinks were fair. \n\n* Bee's Knees cocktail ($12) - 4.5 stars\nDelicious! Refreshing, well-balanced, not overly sweet.\n\n* Penicillin cocktail ($13) - 4 stars\nI rarely like scotch cocktails, yet this one was really well made, with a good balance of flavors. \n\n* Spicy meatballs ($16.75) - 3 stars\nNot very impressive. Meatballs were dry, sauce not particularly memorable. \n\n* Filet of salmon ($26.75) - 3.5 stars\nDecent, but expensive for the quality.", "rating": 4, "date": "2017-11-20"}], "aged flat iron steak": [], "bone in pork chop": [], "pan seared herb chicken": [{"excerpts": ["I went for the pan seared herb chicken\nEntree. ", "One of the nicest meals I've had here. ", "the chicken, veg and mash - cooked to perfection ! ", "Great drink selection and great service ", "- I will be back!"], "author": "Alice M.", "review": "Stopped by here for a unplanned family meal. Great choice !! I went for the pan seared herb chicken\nEntree. One of the nicest meals I've had here. the chicken, veg and mash - cooked to perfection ! Great drink selection and great service - I will be back!", "rating": 5, "date": "2018-08-01"}], "palmers burger": []}