{"steak burrito": [{"excerpts": ["Order a steak burrito  with extra sour cream and salsa to go and got some dry ass burrito with no sour cream in it !!!! ", "Soo ", "mad!!worst burrito ever!!! ", "Never agian !!!"], "author": "diana l.", "review": "This is sad! Order a steak burrito  with extra sour cream and salsa to go and got some dry ass burrito with no sour cream in it !!!! Soo mad!!worst burrito ever!!! Never agian !!!", "rating": 1, "date": "2017-10-04"}, {"excerpts": ["I got a standard steak burrito and asked for guacamole. ", "It was an additional $3( total rip off you could like get two awesome gordos burritos for around $13). ", "Anyways, upon digging into he burrito there was maybe two slices of avocado.. ", "No gauc. ", "If she had told me that they didn't have guacamole, I wouldn't have bothered to pay $3 more bucks. ", "The steak was weird and the rice tastes horrible.. ", "Like instant mexican rice you buy from rice a roni. ", "Anyways total let down as I had remembered from my childhood growing up in the richmond. ", "Save your money and go the exta 20 blocks down Geary to Gordos. ", "Won't be back again."], "author": "Katie S.", "review": "Pretty disappointing burrito for $10. I got a standard steak burrito and asked for guacamole. It was an additional $3( total rip off you could like get two awesome gordos burritos for around $13). Anyways, upon digging into he burrito there was maybe two slices of avocado.. No gauc. If she had told me that they didn't have guacamole, I wouldn't have bothered to pay $3 more bucks. The steak was weird and the rice tastes horrible.. Like instant mexican rice you buy from rice a roni. Anyways total let down as I had remembered from my childhood growing up in the richmond. Save your money and go the exta 20 blocks down Geary to Gordos. Won't be back again.", "rating": 2, "date": "2015-09-19"}, {"excerpts": ["Their shrimp and steak burrito is a gift from God."], "author": "Nick F.", "review": "Their shrimp and steak burrito is a gift from God.", "rating": 5, "date": "2013-08-30"}, {"excerpts": ["I ordered a steak burrito. ", "It was very dry and full of lettuce. ", "The steak taste like hamburger meat. ", "The burrito was so nasty I couldn't eat it. ", "What a waste of money and time. ", "The person who helped me nice. ", "The restaurant was very clean."], "author": "Janine C.", "review": "I ordered a steak burrito. It was very dry and full of lettuce. The steak taste like hamburger meat. The burrito was so nasty I couldn't eat it. What a waste of money and time. The person who helped me nice. The restaurant was very clean.", "rating": 1, "date": "2016-01-02"}, {"excerpts": ["I ordered a steak burrito from this Geary location.  ", "The burrito's tortilla wrapper was soft and fluffy.  ", "The rice was well seasoned, the burrito also contained re-fried beans, boiled \"steak\", tomato salsa, diced lettuce, and sour cream.  ", "The steak filling was a bit bland.  "], "author": "Ed K.", "review": "I ordered a steak burrito from this Geary location.  The burrito's tortilla wrapper was soft and fluffy.  The rice was well seasoned, the burrito also contained re-fried beans, boiled \"steak\", tomato salsa, diced lettuce, and sour cream.  The steak filling was a bit bland.  The burrito was ok in flavor, but fairly ample in size.\n\nThey had 4 kinds of salsa, old mild, two medium, and one spicy.  Chips come free with your burrito order.  Seating is limited but usually ample.\n\nThe burrito was acceptable and I would come back if I had an urgent craving, but will likely go somewhere else for my burrito and taco cravings.", "rating": 3, "date": "2012-08-17"}, {"excerpts": ["We each get the Small Rice & Bean burrito and the Small Grilled Steak burrito.  ", "By itself, the burrito gets 3 stars as the flavor is bland (except the steak).  ", "I bump it to 4 stars since there is a salsa bar which we turn up the spice in both burritos.  ", "We both agree that the salsa verde is the best choice.  ", "Also 4 stars on offering a smaller burrito which hits the spot.  "], "author": "Janet H.", "review": "I've driven by Pancho's Salsa Bar & Grill many times on Geary wondering what is like to eat there.  My niece and I decide to have lunch on a day of errands.\n\nWe each get the Small Rice & Bean burrito and the Small Grilled Steak burrito.  By itself, the burrito gets 3 stars as the flavor is bland (except the steak).  I bump it to 4 stars since there is a salsa bar which we turn up the spice in both burritos.  We both agree that the salsa verde is the best choice.  Also 4 stars on offering a smaller burrito which hits the spot.  My niece would have eaten a regular burrito since she was famished, but the small burrito was just right.\n\nAlso I had the fresh Mexican Horchata drink.  This drink is 5 stars.  The Horchata is a rice and cinnamon drink which is delicious and refreshing served cold.  A must have!", "rating": 4, "date": "2008-09-24"}, {"excerpts": ["I ordered a Steak Burrito which came with a side of chips. ", "It was a decent sized burrito stuffed with steak, rice, black beans, and roasted peppers. ", "They also have a salsa bar, all of which are freshly made and very tasty. ", "I also noticed they have a decent selection of beers to go along with the burritos although I didn't get one when I went. ", "The place was decently busy but it wasn't too hard to find a seat, and they open up the front facade on nice days. ", "It was nothing too special but I would definitely recommend it."], "author": "U U.", "review": "Inexpensive. Quick. Good food. Serve beer.\n\nI ordered a Steak Burrito which came with a side of chips. It was a decent sized burrito stuffed with steak, rice, black beans, and roasted peppers. They also have a salsa bar, all of which are freshly made and very tasty. I also noticed they have a decent selection of beers to go along with the burritos although I didn't get one when I went. The place was decently busy but it wasn't too hard to find a seat, and they open up the front facade on nice days. It was nothing too special but I would definitely recommend it.", "rating": 4, "date": "2010-03-11"}, {"excerpts": ["The steak burrito, similar to nachos re: ", "beef with bean mix was good.  ", "The cheese was the thin-grated type and I enjoyed it ", "but something strange happened to the tortilla, wherein it was gummy and slick along one side.  "], "author": "Walter K.", "review": "This place wins big-time on location, easily walkable from my place.  My girlfriend declared it \"baja-style\", and I agree.  Very different genre of Mexican when compared to the places in the Mission, Gordo's, Papalote, and the like.\n\nWe were really excited about the chicken soup, but found it to be flavorless with ingredients that weren't even entirely cooked (e.g. the onion).  To me, it tasted like they  had just run out, then we ordered it, so they threw some water and ingredients right out of the fridge into a pot, heated it up, put some boiled shredded chicken (with no fat) in, and then served it with a couple of slices of avocado.  It wasn't bad, it just had no flavor, which is, I suppose, bad for some definition thereof.\n\nThe steak nachos were good.  Beans are like refried with pinto chunks sprinkled throughout.  Steak was tasty, one of the highlights of the place.  The steak mixed with beans was my favorite thing about the meal.\n\nThe steak burrito, similar to nachos re: beef with bean mix was good.  The cheese was the thin-grated type and I enjoyed it but something strange happened to the tortilla, wherein it was gummy and slick along one side.  It stuck to my teeth as a result and was pretty unpleasant.\n\nI'll come back due to proximity, and we look forward to trying the many other items on the menu such as tortas.  Unfortunately, I'd rather eat at Gordo's or Papalote most of the time, even if they're somewhat farther away.", "rating": 3, "date": "2008-01-05"}, {"excerpts": ["The Borracho steak Burrito is amazing, and their hot salsa is the only salsa I've had in the Bay Area that challenges me (although it's gotten a bit milder lately)."], "author": "Devin V.", "review": "The Borracho steak Burrito is amazing, and their hot salsa is the only salsa I've had in the Bay Area that challenges me (although it's gotten a bit milder lately).", "rating": 5, "date": "2009-01-15"}, {"excerpts": ["I had their steak burrito with a nice Dos Equis cerveza.  ", "Very inexpensive and quick service.  ", "Their chips were nice as was their salsa."], "author": "Anthony L.", "review": "Nothing wrong with this place at all.  I had their steak burrito with a nice Dos Equis cerveza.  Very inexpensive and quick service.  Their chips were nice as was their salsa.", "rating": 4, "date": "2008-07-20"}], "burrito atomico": [], "steak regular burrito": [], "veggie regular burrito": [], "pieces grilled chicken tacos": [], "pieces steak tacos": [], "pieces carnitas tacos": [], "pieces al pastor tacos": [], "pieces baja fish tacos": [], "pieces grilled pescado tacos": [], "pieces garlic shrimp tacos": [], "pieces fresh veggie tacos": [], "mushroom quesadilla": [], "grilled chicken quesadilla": [], "pieces garlic shrimp enchiladas": [], "grilled chicken tostada": [], "steak tostada": [], "pieces grilled chicken fajitas": [], "pieces steak fajitas": [], "pieces garlic shrimp fajitas": [], "panchos nachos": [], "chicken nachos": [{"excerpts": ["Ordered chicken nachos ", "and it was a shame that pieces of charred chicken were scattered under a mountain of glorious cheese and guac. ", "An unpleasant surprise it was to be crunching on bitter charred pieces hidden beneath beans and cheese. ", "Aside from the black pieces, the chicken was super dry. ", "I ended up picking apart my nachos to avoid the chicken all together. ", "Such a shame as everything else was delicious. ", "Chips were thin and fresh, guac was chunky, and the cheese was melty. "], "author": "Michelle C.", "review": "Food was quick, but my chicken was burnt. \n\nOrdered chicken nachos and it was a shame that pieces of charred chicken were scattered under a mountain of glorious cheese and guac. An unpleasant surprise it was to be crunching on bitter charred pieces hidden beneath beans and cheese. Aside from the black pieces, the chicken was super dry. I ended up picking apart my nachos to avoid the chicken all together. Such a shame as everything else was delicious. Chips were thin and fresh, guac was chunky, and the cheese was melty. Loved the salsa bar as well. \n\nMaybe I went on an off day, but I'll stick with the Mission to get my fill of Mexican.", "rating": 3, "date": "2016-09-06"}, {"excerpts": ["The only thing I've ever tried here was a) chicken nachos and b) taquitos. \n\n"], "author": "Tiffany R.", "review": "The only thing I've ever tried here was a) chicken nachos and b) taquitos. \n\nThe taquitos get 2 stars. The nachos, however, get 5 stars. They. Are. So. Freaking. DELICIOUS!!!\n\nI lived RIGHT next door to Pancho's for 9 months. I got nachos here more often than anyone who doesn't want to be called a fat kid would admit. Their chicken is flavorful, the chips are salty & crisp, the mix of cheddar & jack cheeses is perfect. I also got mine with sour cream, guacamole (yummy guacamole too), and black olives. They give you salsa/peppers/onions if you want them, too.\n\nI'm pretty much trying not to drool while writing this, that's how good they are. I haven't had their nachos in about 4-5 months, and I need a fix! Panchos! Please deliver to me in Redding, California, kthxbi!", "rating": 4, "date": "2010-08-13"}, {"excerpts": ["Every time I go here I debate between three delicious choices:\n\n-the Chicken Nachos, which are simple but delicious nonetheless \n\n-the carnitas Atomic Burrito, which you would expect to be spicy but isn't at all... "], "author": "Tommy C.", "review": "As a USF student, it's nice to have some nearby, quick and delicious places to eat (especially ones that aren't Mel's), so discovering Pancho's really made my summer. \n\nCan't complain about the price, service, or atmosphere, or the unlimited salsa bar (the verde is amazing).\n\nEvery time I go here I debate between three delicious choices:\n\n-the Chicken Nachos, which are simple but delicious nonetheless \n\n-the carnitas Atomic Burrito, which you would expect to be spicy but isn't at all... just deliciousness wrapped in a burrito and topped with red sauce\n\nand finally...\n\n-the Sopa de Pollo, which is probably the most perfect chicken soup ever to grace the planet, with whole chunks of potatoes, corn on the cob, and avocado mixing perfectly with the chicken, rice, and other vegetables.\n\nAll in all, Pancho's is my go-to quick meal near campus. No offense, Papolote-- you're good, but Pancho's is better.", "rating": 5, "date": "2011-10-17"}, {"excerpts": ["Ordered the grilled chicken nachos, wasn't impressed. ", "Barely any chicken and mostly greasy chips. ", "Paid $10 which I thought was pricey and the taste itself was just okay. ", "Definitely been to way better Mexican spots", ", don't think I'd come back here."], "author": "Kimberly W.", "review": "Ordered the grilled chicken nachos, wasn't impressed. Barely any chicken and mostly greasy chips. Paid $10 which I thought was pricey and the taste itself was just okay. Definitely been to way better Mexican spots, don't think I'd come back here.", "rating": 2, "date": "2013-11-09"}, {"excerpts": ["That led me to order the Atomic-Shrimp Burrito and a chicken nachos for my first visit to Pancho's.  ", "I brought the goods over to Underdog to watch a game with friends.  ", "I was utterly disappointed with the soggy mess that was inside.  ", "The atomic stood for the amount of let down you would get and the nachos couldn't even hold it's own to Underdog's Nachos that night.  ", "Flavors were off and spicy wasn't included in the order even though I requested extra hot.  ", "With the hundreds of quality Mexican Restaurants we have in the city, a return visit will never happen."], "author": "Jason A.", "review": "Lately I've been the type of guy that likes to get burned with spicy dishes.  That led me to order the Atomic-Shrimp Burrito and a chicken nachos for my first visit to Pancho's.  I brought the goods over to Underdog to watch a game with friends.  I was utterly disappointed with the soggy mess that was inside.  The atomic stood for the amount of let down you would get and the nachos couldn't even hold it's own to Underdog's Nachos that night.  Flavors were off and spicy wasn't included in the order even though I requested extra hot.  With the hundreds of quality Mexican Restaurants we have in the city, a return visit will never happen.", "rating": 2, "date": "2007-06-26"}], "combo": [{"excerpts": ["#1 Chicken  Combo is the bomb.\n", "Excellent food. ", "Not 5 minutes from home, I'm loving it."], "author": "David A. E.", "review": "#1 Chicken  Combo is the bomb.\nExcellent food. Not 5 minutes from home, I'm loving it.", "rating": 5, "date": "2018-08-20"}, {"excerpts": ["and it'll be my first time trying that combo ", "and it sounds super delicious.... ", "Just make sure to ask for chips b/c they can be kind of skimp on them ", "but other ", "then that they're awesome! ", "SF baby!"], "author": "Tyler M.", "review": "The Borracho is by far my favorite burrito. I have never had a BBQ burrito before and it's soooooo good it makes you want to slap yo mama! I'm trying the Atomic today and I heard the Atomic sauce is incredible... I'm getting steak and bacon on my burrito and it'll be my first time trying that combo and it sounds super delicious.... Just make sure to ask for chips b/c they can be kind of skimp on them but other then that they're awesome! SF baby!", "rating": 5, "date": "2013-10-29"}, {"excerpts": ["After 10pm - when you've been beaten to death by 12 straight grueling hours of the school-work-school death combo - the last thing you want to do is scour around for restaurants still open. "], "author": "Annie L.", "review": "After 10pm - when you've been beaten to death by 12 straight grueling hours of the school-work-school death combo - the last thing you want to do is scour around for restaurants still open. Luckily Pancho's IS and a good place to settle for if you need a quick late dinner. \n\nI've only tried the fajita burritos: they're proportionately assembled, not a heapful of rice with a sliver of meat and a million beans like other places, it's just right. Great substitute if you prefer fajita plates without the gargantuan portions. Prices cater to a college student's budget. \n\nHowever, I question the handling of food: the cooks brazenly scoop tortilla chips in your paper bag with their BARE HANDS. o_O (like reallywtfdidthatjusthappen? More like manhandled the chips.. I was a little taken back..... needless to say I didn't eat them.", "rating": 4, "date": "2011-11-08"}, {"excerpts": ["The combo #2 we just ordered is a regular burrito + chicken quesadilla. ", "The plate arrives with chips and guacamole as well. ", "Now, I must admit that I have never (in all the years) ordered anything aside from the Combo #1 or #2. ", "It's because this is truly the perfect combo.  ", "If you prefer, the order can be varied slightly to the Combo #1, where the chicken is placed in the burrito rather than the quesadilla.  ", "Also, I've heard that other Pancho's locations are not as awesome. ", "Never tried them. ", "But if you have or haven't, give this location a shot. ", "You will not be disappointed. ", "It's easy to find street parking during the late night hours."], "author": "Nathan E.", "review": "I am a major wginormous (I love Pancho's so much I invented a new word) Pancho's fan!  Pancho's has been a favorite destination of mine for years. I always have the same order (because it's just that good).  I would eat at Pancho's everyday for dinner, if allowed. \n\nBecause of my obsession with Pancho's, the girlfriend refuses to come with, BUT luckily for me I have a weird friend.  One day, I decided to invite him to Pancho's with me for a burrito. This changed his life radically! Ever since then, when I need a buddy to come with, I call him up. This guy is willing to drive half-way across the city to indulge in the wonderful food Pancho cooks up. And yes, in the rare occasions that he is unavailable, and I'm craving some Pancho's, I will go alone.\n\nMy order and my strong recommendation for anyone to try is this. Just walk in a read this exact line to the server: \"Hi, I would like the Combination number 2, flour tortilla, please.\"  That's all you need to say and you will receive the absolute best Mexican food. The combo #2 we just ordered is a regular burrito + chicken quesadilla. The plate arrives with chips and guacamole as well. As a beverage, I would recommend Corona as everyone knows Corona is best paired with burritos and quesadillas. \n\nNow, I must admit that I have never (in all the years) ordered anything aside from the Combo #1 or #2. It's because this is truly the perfect combo.  While I'm sure the other products are great, I've never tried them. \n\nThere is a difference is quality depending who the burrito maker is.  Sometimes the burrito arrives wrapped in foil, sometimes not.  Some burrito makers wrap better than others. If you show up for late night dinner, you will probably have a better burrito simply because Pancho will be less occupied with other orders.  \n\nIf you prefer, the order can be varied slightly to the Combo #1, where the chicken is placed in the burrito rather than the quesadilla.  Also, I've heard that other Pancho's locations are not as awesome. Never tried them. But if you have or haven't, give this location a shot. You will not be disappointed. It's easy to find street parking during the late night hours.", "rating": 5, "date": "2009-07-27"}, {"excerpts": ["But I have grown to appreciate the #1 combo (two tacos, rice, beans, lettucey thing).  ", "Order one chicken, one beef, slather them in lime, cilantro and onions, and you could do worse.  ", "The place is very clean and the food is consistently decent."], "author": "John H.", "review": "It's not the best burrito in the City, by far.  But I have grown to appreciate the #1 combo (two tacos, rice, beans, lettucey thing).  Order one chicken, one beef, slather them in lime, cilantro and onions, and you could do worse.  The place is very clean and the food is consistently decent.", "rating": 4, "date": "2013-12-09"}, {"excerpts": ["My friend had the even heartier combo #2, which is a combination of a chicken quesadilla, a rice and bean burrito with homemade chips and guacamole and a salad. ", "What a deal! ", "Of course, they have the salsa bar with the sneeze guard. ", "Very fresh, especially the mild red one which my friend used by the shovelful on his plate.\r\n\r\n", "The decor is pure Tex-Mex cheese with a touch of Wal-Mart, especially with the autographed Julio Iglesias photo next to the serapes on the wall. ", "But who cares? ", "The service is pretty quick, and you will feel sated in a good way here.\r\n\r\n", "FOOD - 4 stars...", "Ay! ", "Yi! ", "Yi! ", "Yi! ", "Muy bueno, senors y senoritas! \r\n", "AMBIANCE - 3 stars...", "to all the girls I loved before\r\nSERVICE - 4 stars...muy rapidamente\r\nOVERALL - 4 stars...is that a burrito in my pocket, or am I just glad to see you?"], "author": "Ed U.", "review": "Yeah, yeah...Pancho's is about as authentic as George W. talking about his passion for the environment. But who cares? It's the freshest tasting California-style Mexican fast food I've had in the city. Baja Fresh should be so worthy of the title.\r\n\r\nLocated opposite the big Pier One Imports store on Geary, it attracts a busy lunch crowd even on the weekend. I can see why. My friend and I had a great experience when we tried this place once, so we decided to go for it again since we were in the neighborhood. Well, actually we weren't...we just got tired of Lucky Penny. The menu is pretty robust, but our eyes were focused on the combination plates, both at $6.95. I had the #1 - two grilled steak tacos on homemade corn tortillas with fresh guacamole and a side of refried beans and a small salad.\r\n\r\nI have to say the tortillas were small compared to other places (I'm thinking of the superb El Zocalo in the Mission), but they just came out of the oven, I think, and they were soft and delish. The ingredients were incredibly fresh. My friend had the even heartier combo #2, which is a combination of a chicken quesadilla, a rice and bean burrito with homemade chips and guacamole and a salad. What a deal! Of course, they have the salsa bar with the sneeze guard. Very fresh, especially the mild red one which my friend used by the shovelful on his plate.\r\n\r\nThe decor is pure Tex-Mex cheese with a touch of Wal-Mart, especially with the autographed Julio Iglesias photo next to the serapes on the wall. But who cares? The service is pretty quick, and you will feel sated in a good way here.\r\n\r\nFOOD - 4 stars...Ay! Yi! Yi! Yi! Muy bueno, senors y senoritas! \r\nAMBIANCE - 3 stars...to all the girls I loved before\r\nSERVICE - 4 stars...muy rapidamente\r\nOVERALL - 4 stars...is that a burrito in my pocket, or am I just glad to see you?", "rating": 4, "date": "2006-08-19"}, {"excerpts": ["I had the chicken taco combo. ", "All fresh ingredients-corn tortilla, grilled chicken, refried beans, rice, and, their own home-made tortilla chips. ", "How sad that the latter is so rare. ", "Espero verte pronto!"], "author": "Rich M.", "review": "Awesome! Best Mexi-fast food I've found this side of the city. Why didn't I try it sooner besides listening to all the OK reviews on Yelp? I should know better. Sorry, but a lot of the Mexican food reviews for SF are just, lets say, unreliable. I know good Mexican food. This place makes its own tortillas. Big plus. Has a kickin' salsa bar,with 3 temperatures of salsa, cilantro and chopped onions, and chopped jalapenos, of course. All of these are clues people, and the clues mean they know what they're doing.\n\nI've only eaten here once, but that will change. I had the chicken taco combo. All fresh ingredients-corn tortilla, grilled chicken, refried beans, rice, and, their own home-made tortilla chips. How sad that the latter is so rare. Espero verte pronto!", "rating": 5, "date": "2011-03-30"}, {"excerpts": ["the Borracho Burrito (chicken or steak, black beans, cheese, guac, \"Mexican BBQ sauce\", and rice on a chile-flavored tortilla), or their Two Taco Combo Plate (chicken or steak, comes with rice, beans, salad, and chips).\n\n"], "author": "Anna S.", "review": "Albert Einstein once said, \"The definition of insanity is doing the same thing over and over again and expecting different results\". The English Oxford Dictionary defines 'procrastination' as delaying or postponing action, or something to that effect.\n\nSo, to put those things into context, I kept coming here despite initially not liking it, and felt insane every time I ordered to-go and then kicked myself for a mediocre experience. And then, I procrastinated on giving this place a poor review, as I many times wanted to.\n\nTherefore, the good news is I can now quit procrastinating on writing a bad review of this place and finally write a GOOD one, since I have now continued to come here enough times in the past few weeks that I have come to appreciate the finer things on their menu, such as the Borracho Burrito (chicken or steak, black beans, cheese, guac, \"Mexican BBQ sauce\", and rice on a chile-flavored tortilla), or their Two Taco Combo Plate (chicken or steak, comes with rice, beans, salad, and chips).\n\nThese are good, hearty, and solid meals that fill me up quickly at the end of a long day. Easy on the wallet, too. I appreciate the salsa bar, with three main distinct salsas ranging in heat from mild to hot; and by hot they do mean hot.\n\nNow, you may ask skeptically, \"Why the change of heart, Anna S.?\" And I will tell you: I came here at first because it is the closest place to get a burrito near my new place. It was like the metaphorical rebound date to the previous romances of my life, like Pancho's on Polk, or any number of the Mission taquerias. It is even closer to me than Gordo's. \n\nWith summer school and the new job, plus a hearty appetite fueled by my insatiable craving for Mexican food, I've been looking for an easy Mexican meal to take home lately. And as I keep coming back, my insanity is paying off... the service is getting friendlier, the portions are getting larger, the guac is getting chunkier, and the salsa is tasting more flavorful... I have reached a happy agreement with this place.", "rating": 4, "date": "2009-07-10"}, {"excerpts": ["And I really like the chips, with a little cup combo of the super super hot salsa on the far right and the medium red salsa in the middle."], "author": "Tamar D.", "review": "A neighborhood joint that I've enjoyed for many years, I'm at Pancho's about once a month.  It's pretty much the only Mexican food joint for anybody who lives in Laurel Heights/almost Inner Richmond (what I call the blocks before you hit Arguello.  Seriously, between Masonic and Arguello, we really lack identity).  \n\nI used to love Gordo's, but realized that their burritos are what they do well and I have gravitated toward tacos, probably for life.  Pancho's does tacos yummy.  Me likey.  One thing, though: what's up with the sour cream that is so thick, it spreads?  \n\nAnd I really like the chips, with a little cup combo of the super super hot salsa on the far right and the medium red salsa in the middle.", "rating": 3, "date": "2010-01-08"}, {"excerpts": ["I ordered a quesadilla & bean and rice burrito combo plate. ", "The quesadilla was really good and filled with delicious cheese. ", "The burrito on the other hand was taken home to be savored later. ", "To my own dismay the aforementioned \"bean & rice\" burrito was filled with sketchy lettuce and tomatoes. ", "WTF?!? "], "author": "Gary T.", "review": "Since I now live in the Laurel Heights area, Mexican food has become a scarce commodity. I came here with the hopes of striking gold!\n\nWell, the vein has run dry. While they did have really good chips and salsa bar, the rest of my meal was lacking. I ordered a quesadilla & bean and rice burrito combo plate. The quesadilla was really good and filled with delicious cheese. The burrito on the other hand was taken home to be savored later. To my own dismay the aforementioned \"bean & rice\" burrito was filled with sketchy lettuce and tomatoes. WTF?!? A huge disappointment to say the least.\n\nWhile not the best experience, I'll try and give them a second chance in the future.", "rating": 3, "date": "2009-06-30"}, {"excerpts": ["The Steak and Shrimp Burrito (good combo of meat and seafood)\n\n"], "author": "Miguel B.", "review": "I love coming to this place... While in college this is where I got my fix for some good mexican food... Things I would order:\n\nThe Borracho Burrito (The marinade makes the steak very tender... a must have)\n\nThe Carne Asada Tacos (great homemade style tortillas with a citrus tasting carne asada)\n\nThe Steak and Shrimp Burrito (good combo of meat and seafood)\n\nAny tortas they got (nice snack for you to have, you should get 2 instead)\n\nGood grubbing especially if you're near USF. Check it out.", "rating": 4, "date": "2008-06-29"}, {"excerpts": ["Their chicken soup is one of their best menu items - really fresh, delicious combo of flavors, including a generous serving of avocado.  ", "It's a little pricier than the Mission taquerias, but north side real estate is more expensive than Mission real estate - what are you going to do?  ", "We call for take out orders all the time - they're fast, and you get a bag of tortilla chips with your burrito.  ", "Great way to feed the kids on a Friday night."], "author": "Nancy S.", "review": "Pancho's is not the best Mexican ever, but it's good standard burritos and tacos.  Their chicken soup is one of their best menu items - really fresh, delicious combo of flavors, including a generous serving of avocado.  It's a little pricier than the Mission taquerias, but north side real estate is more expensive than Mission real estate - what are you going to do?  We call for take out orders all the time - they're fast, and you get a bag of tortilla chips with your burrito.  Great way to feed the kids on a Friday night.", "rating": 4, "date": "2012-03-08"}, {"excerpts": ["The combo's are very worth it since you get a baby burrito, chips, guacamole, and a cheese quesadilla. ", "The guac is very good!! ", "I love burritos with grilled chicken!"], "author": "Janet Z.", "review": "The menu makes it so easy when I am ordering. OMG and there are different types of tortillas! SPINACH and TOMATO but I do not think that those are the freshest they can be. The combo's are very worth it since you get a baby burrito, chips, guacamole, and a cheese quesadilla. The guac is very good!! I love burritos with grilled chicken!", "rating": 5, "date": "2008-10-30"}, {"excerpts": ["The combo number 1 is the one to have. ", "Bottomless salsa cups are cool. ", "Steak & chicken tacos are great. ", "I live near the mission so I get enough good Mex, but this place was a welcome surprise in the Richmond."], "author": "Jet V.", "review": "The combo number 1 is the one to have. Bottomless salsa cups are cool. Steak & chicken tacos are great. I live near the mission so I get enough good Mex, but this place was a welcome surprise in the Richmond.", "rating": 4, "date": "2008-04-01"}], "bean burrito kids": [], "cheese quesadilla kids": [], "chicken taco kids": [], "steak taco kids": [], "single chicken taquito kids": [], "homemade chips and salsa": []}