{"bruschetta con pomodoro": [], "mozzarella alla caprese": [{"excerpts": ["A few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\n"], "author": "Lola D.", "review": "Small neighborhood restaurants are always a favorite of mine. I usually come here w/my favorite Italian :) Makes it that much better! Everyone always greets us kindly and I feel like I'm entering my family's home.\n\nA few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\nIf you like whites:\nBIANCO DEL FRIULI\n\nIf you like reds:\nBARBARESCO, Produttori del Barbaresco, Piemonte'06", "rating": 5, "date": "2012-06-09"}, {"excerpts": ["the bruschettas were good, the mozzarella alla caprese were so fresh, the carpaccio was tasty, as well as the calamari.   ", "the pasta was only ok, nothing special - rigatoni and fettucine "], "author": "Anh V.", "review": "ode to gluttony.\n\nmy friends had their engagement party here so we had the back room.  the best part though was that we got to try out so many things on the menu since we were a big group.\n\nthe bruschettas were good, the mozzarella alla caprese were so fresh, the carpaccio was tasty, as well as the calamari.   the pasta was only ok, nothing special - rigatoni and fettucine but maybe they were the democratic choices for entrees...same can be said for the pizzas - there were a few choices which were all good - thinner crust and not oily.\n\nthe engaged couple brought in their own bottles of wines since he is a big wine guy so i can not attest to their wine selection.  over all, i'd probably rate it average but since it was our friends, we had a great time.", "rating": 3, "date": "2007-08-27"}, {"excerpts": ["To start, we had the Mozzarella alla Caprese and the Scallops with Grilled Polenta.  ", "The mozzarella was good, the tomatoes and basil fresh, no complaints. ", "The scallops were flavorful, but a bit chewy for my tastes; however, the tomato cream sauce and grilled polenta were incredible. ", "I had to be restrained from licking the plate clean.  \n", "I followed up with the Taglialini with Mushrooms in a Cheese and Cream  ", "sauce ", "-- it's on the specials menu -- get it. ", "So decadent, so creamy, so very, very bad for you. ", "You WILL come back for this. ", "My friend had the margarita pizza, which was also incredible. \n"], "author": "Michelle M.", "review": "Now that's I've been here twice, I can safely say that I love this place. It's not swanky, but the ambiance is perfectly nice. Great place to go when you feel like consuming 10 million calories of yum.  \n\nService: The service is hand-down fantastic. Both times we made reservations with almost no notice and were able to get tables (although the restaurant seemed quite full). When we showed up fifteen minutes early, (no bar at which to wait) we were graciously shown to our seats and brought menus. The waiter (same waiter both times) was gregarious, helpful, and ever-present, but never intrusive. He recommended a delicious Spanish dessert wine to enjoy with our Tiramisu. \n\nFood: We ordered a gorgeous Barolo, which they happened to be out of, so they brought us the same wine, but a better year, for the same price.  Wine list had a lot of great Italian choices.  The bread and flavorful olive oil with the wine ... stunning...  \nTo start, we had the Mozzarella alla Caprese and the Scallops with Grilled Polenta.  The mozzarella was good, the tomatoes and basil fresh, no complaints. The scallops were flavorful, but a bit chewy for my tastes; however, the tomato cream sauce and grilled polenta were incredible. I had to be restrained from licking the plate clean.  \nI followed up with the Taglialini with Mushrooms in a Cheese and Cream  sauce -- it's on the specials menu -- get it. So decadent, so creamy, so very, very bad for you. You WILL come back for this. My friend had the margarita pizza, which was also incredible. \nWe finished up with the Tiramisu, which we didn't need, but had to have. \n\nAll in all, a great comfortable place to have a nice dinner. Our bill for two was $180, but $100 of that was wine.  There are great vegetarian options, and a vegan option.", "rating": 4, "date": "2008-12-19"}], "carpaccio con capperi e parmigiano": [], "calamaretti fritti": [], "bresaola con rucola": [{"excerpts": ["The Good was represented by the timely service and the tasty Bresaola Con Rucola antipasto and Tagliatelle Verdi Alla Bolognese. "], "author": "Michael B.", "review": "We were pleased to get a table for two on short notice on a Friday night. Once seated we experienced the Good, the Bad and the Ugly. The Good was represented by the timely service and the tasty Bresaola Con Rucola antipasto and Tagliatelle Verdi Alla Bolognese. The Bad was the tasteless Siciliana pizza, especially the crust which was like a cardboard make-out-of-the-box variety. MUCH better pizza can be found at Delarosa, Delfina, Rose's Cafe and A-16. We found the service staff to be Ugly as they were extremely fast and abrupt, dropping dishes on the table or asking questions so fast and departing before we had any chance to react. The emphasis in the restaurant seemed to be on speed and moving customers through rather than on a slowly paced enjoyable meal experience. We hadn't been to this restaurant for a long time and will not return again for a long time.", "rating": 2, "date": "2016-02-13"}], "melanzane alla parmigiana": [], "carciofo ripieno freddo": [], "insalata pane e vino": [{"excerpts": ["Bruschetta - great\nCaprese - Good\nInsalata pane e vino - decent\n\nA made to order veggie pasta with marinara sauce - good\nMushroom and black truffle pasta - not on menu, special request - amazing!\n"], "author": "Dee V.", "review": "We went to pane e vino for my sister's birthday celebration a few weekends back. Had a reservation, but got there 15 mins late. They had saved the table for us and we were seated immediately in the enclosed patio area. The staff was friendly and attentive. \n\nWe got a lot of food - \n\nMinestrone soup - light and filling, a little lacking in seasoning.\nBruschetta - great\nCaprese - Good\nInsalata pane e vino - decent\n\nA made to order veggie pasta with marinara sauce - good\nMushroom and black truffle pasta - not on menu, special request - amazing!\nVeggie risotto - completely lacking in flavors- definitely skip this one.\nMargherita pizza-  simple yet tasty - awesome.\nThe chef special fish dish - cant really recall the type of fish, but the dish was tasty.\n\nProfitroles - cream puffs with gelato and chocolate - decent stuff\nAfogatto - delicious.\n\nOverall a good meal with family.", "rating": 4, "date": "2015-07-13"}, {"excerpts": ["We started with the insalata pane e vino (mixed greens w/ parmesan cheese, croutons and vinaigrette) which was refreshing.  "], "author": "Naoko M.", "review": "I came on a Friday night to grab dinner with the boy and a couple friends. We called ahead of time and were able to put our name on the list for a table, which was really convenient.\n\nWe started with the insalata pane e vino (mixed greens w/ parmesan cheese, croutons and vinaigrette) which was refreshing.  Nothing special, but something nice to start off with.\n\nThe menu here is pretty extensive so there's something for everyone.  After debating between ordering off the regular menu vs. the specials menu, I eventually decided to go with the osso buco dish off the special menu.  The osso buco came served with a saffron risotto, and (with the boy) I ate almost the entire plate.  The meat was very tender and had good flavor, and the risotto was also prepared expertly.  It really was a large portion of food, but it was so good we ate til we were past full.\n\nThe boy ordered another special dish: penne with smoked salmon and caviar in a vodka cream sauce.  The dish was really good but the smokiness of the salmon was a bit strong.  I only had a few bites of it (mostly because the boy enjoyed it so much it was going pretty quickly) but I thought that was enough.  I probably wouldn't have been able to eat the whole dish.\n\nOne friend ordered a spaghetti with tuna roe and clams, on which we really weren't sure if there was actual tuna roe on it, but our friend nearly finished his plate too.  Our last friend ordered the guazzeto di pesce (clams, mussels, shrimp, and calamari in a tomato broth) off the appetizer menu, but it was plenty big for an entree for one.  She also said it was really tasty.\n\nThe service here seemed a little distracted, though I suppose I would also lose interest in a table that hadn't really decided on food or drinks after \"browsing\" the menu for several minutes.  \n\nAll-in-all, I really enjoyed pane e vino, and because of the wide selection of dishes  I can see myself coming back for more.", "rating": 4, "date": "2012-06-17"}], "insalata di spinaci": [], "guazzetto di pesce": [{"excerpts": ["A few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\n"], "author": "Lola D.", "review": "Small neighborhood restaurants are always a favorite of mine. I usually come here w/my favorite Italian :) Makes it that much better! Everyone always greets us kindly and I feel like I'm entering my family's home.\n\nA few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\nIf you like whites:\nBIANCO DEL FRIULI\n\nIf you like reds:\nBARBARESCO, Produttori del Barbaresco, Piemonte'06", "rating": 5, "date": "2012-06-09"}], "antipasto della casa": [{"excerpts": ["We all enjoyed a house salad and platters of their Antipasto Della Casa, then an assortment of pizzas. ", "Our main course options were delicious and our group was commenting on how tasty the pasta, chicken, and salmon were. ", "We were well tended by servers and they were so accommodating with bringing out our own cake that we had brought, and singing happy birthday to my brother. ", "It was a lively and lovely evening with family and friends and we will be back soon for another great meal!"], "author": "Alison J.", "review": "Wow! We had a family dinner at Pane e Vino on Saturday, and our group of 12 had a fantastic meal. We had pre-arranged a set menu with several appetizers and a choice of main course. We all enjoyed a house salad and platters of their Antipasto Della Casa, then an assortment of pizzas. Our main course options were delicious and our group was commenting on how tasty the pasta, chicken, and salmon were. We were well tended by servers and they were so accommodating with bringing out our own cake that we had brought, and singing happy birthday to my brother. It was a lively and lovely evening with family and friends and we will be back soon for another great meal!", "rating": 5, "date": "2017-11-09"}, {"excerpts": ["We started off with the ANTIPASTO DELLA CASA which included prosciutto on 2 cracker sticks, 2 pieces of flavorful bruschetta, salami and coppa scattered throughout, succulent not-to-spicy peperoncinis, voluptuous olives, grilled charbroiled-like tasting eggplant and a pile of pickled peppers. ", "The meat was thin and fresh, and the peppers were tasty. ", "Wish there was more and had some cheese. "], "author": "Kevin C.", "review": "\"Bueno Sera!\" I soon heard exchanged between my grandma and the host, I immediately had flashbacks about my Italy trip two summers ago - expectations were high! \n\nOn the table you are served warm complimentary bread with a small dish of olive oil for dipping... Addicting!!! \nWe started off with the ANTIPASTO DELLA CASA which included prosciutto on 2 cracker sticks, 2 pieces of flavorful bruschetta, salami and coppa scattered throughout, succulent not-to-spicy peperoncinis, voluptuous olives, grilled charbroiled-like tasting eggplant and a pile of pickled peppers. The meat was thin and fresh, and the peppers were tasty. Wish there was more and had some cheese. (See pic) \n\nFor my entree I ordered PAPPARDELLE ALLA CONTADINA since I love wide pasta/noodle. It got to me nice and warm, noodles having the right thickness and delicate texture. The creamy tomato sauce was light and had a soft taste which made me want it more. There were a lot of mushrooms that really tasted like mushrooms. The chicken is breast but had a simple but kind of bland taste, which was ok since it provided some protein. (See pic) \n\nMy dad and grandma both requested their own creation which consisted of simply tagliarini noodles with meat sauce. They ordered it since my grandma used to make some bomb homemade pesto with tagliarini noodles. They were both thoroughly satisfied with their meals, cleaning the bowl. They said the noodles were perfect and the sauce had more meat and less tomato which they liked since they aren't fans of acidic/greasy spaghetti sauce. (See pic) \n\nMy dad also ordered an iced tea which they gave him his own small pitcher along with his glass. \n\nMy sister ordered the CALZONE which she enjoyed due to the soft crust, fresh ingredients which can be tasted in each bite. It smelled really good when it arrived to her, giving off a nice buttery aroma. There was a generous amount of marina filling up almost half the plate on the folded part of the calzone. \n\nMy sister and I ordered tiramisu for dessert which was pretty good. The mascarpone was rich and the cocoa powder gave it a hint of chocolate. It didn't seem like there was any rum, or at least a taste of rum, which disappointed the inner alchy in me.  \n\nThe service was exceptional, giving off positive vibes as well accommodating my dad's custom pasta. \n\nOverall, I give this place 4 stars. Has potential. Will come again and try a pizza since there was a steady flow of to go orders getting picked up during my dinner.", "rating": 4, "date": "2014-01-05"}, {"excerpts": ["I had their Antipasto Della Casa - the cured meats were fresh and tasty, but the house-marinated vegetables were so so. ", "And then I tried their Pizza Margherita (really, the first thing one should try in an Italian restaurant). ", "Well, I've had much, much better - and I've spent a month traveling in Italy. ", "Service was attentive and atmosphere is pleasant. ", "But for a much better food go to Capannina!"], "author": "Margarita B.", "review": "After the glorious ratings here, I thought I should give this place a try... Well, it's mediocre. I had their Antipasto Della Casa - the cured meats were fresh and tasty, but the house-marinated vegetables were so so. And then I tried their Pizza Margherita (really, the first thing one should try in an Italian restaurant). Well, I've had much, much better - and I've spent a month traveling in Italy. Service was attentive and atmosphere is pleasant. But for a much better food go to Capannina!", "rating": 3, "date": "2008-03-01"}, {"excerpts": ["To start we ordered the ANTIPASTO DELLA CASA which was a assortment of cured meats and vegetables. ", "It was good it had a variety of different flavors and spices. ", "For our first course we had the pumpkin gnocchi and it was incredible. ", "My boyfriend ordered the veal shank osso bucco served on risotto. ", "The veal literally melted in your mouth and the risotto was perfectly cooked. ", "I had the chicken breast topped with tomatoes and garlic. ", "The flavor was great but the chicken was a little dry. ", "I would love to go back and try something else."], "author": "Melanie V.", "review": "I really enjoyed coming here. We made a reservation on a Friday at 7pm. We were greeted and seated by a friendly hostess and then greeted by an even friendlier waiter with a very obvious Italian accent. To start we ordered the ANTIPASTO DELLA CASA which was a assortment of cured meats and vegetables. It was good it had a variety of different flavors and spices. For our first course we had the pumpkin gnocchi and it was incredible. My boyfriend ordered the veal shank osso bucco served on risotto. The veal literally melted in your mouth and the risotto was perfectly cooked. I had the chicken breast topped with tomatoes and garlic. The flavor was great but the chicken was a little dry. I would love to go back and try something else.", "rating": 4, "date": "2008-10-19"}, {"excerpts": ["I highly recommend the Antipasto Della Casa and the Carpaccio to start with. ", "Both are delicious and fun! ", "You'll see what I mean when your order them ;)"], "author": "Loubna M.", "review": "Pane e vino is one of the best Italian restaurants in the city. I like that they have a good variety in their menu (not just pizza and pasta) and good Italian wines (the Valpolicella is very good). The service is friendly and the place is warm and cozy. I highly recommend the Antipasto Della Casa and the Carpaccio to start with. Both are delicious and fun! You'll see what I mean when your order them ;)", "rating": 4, "date": "2009-03-27"}], "fettuccine al formaggi": [{"excerpts": ["I ordered the fettuccine al formaggi with a glass of wine, and was treated to some of the best pasta I've come across in quite some time, as well as ever! "], "author": "Andrew K.", "review": "Oh man, was this spot delicious! A little piece of Italy hidden in a rather unassuming neighborhood spot, if you will! (The wait staff even speak in Italian).\n\nWas visiting with a friend, and Italian food had to happen while we were in town. Found this spot, and decided to reserve a table using their website (It wasn't crazy busy at first, but it picked up fairly quickly after being seated, so I'd recommend reserving a spot!). We were seated upon arrival, and provided with excellent service throughout our visit.\n\nThe free appetizer bread w/olive oil was stellar (great, crunchy crust with a airy, soft crumb). I ordered the fettuccine al formaggi with a glass of wine, and was treated to some of the best pasta I've come across in quite some time, as well as ever! My only regret is that there wasn't enough time in my short visit to SF to come back and try some more stuff here.\n\nCome here, and forget about counting calories for a day. You'll be glad you did!", "rating": 5, "date": "2017-08-27"}], "capellini al pomodoro fresco": [], "penne alla puttanesca": [{"excerpts": ["I really like their Penne Alla Puttanesca (tomato sauce, capers, olives, and anchovies) and their special pasta with truffle sauce and shaved truffles was excellent.  ", "Their pizzas are pretty good too.  ", "The problem is that the service is just bad.  ", "Even though the food comes out quickly after you order it, the wait staff are very slow and basically disregard their customers until you waive them down.  "], "author": "Ghaz M.", "review": "I've been here twice so far, and both times had similar experience:  excellent food, bad service.  I really like their Penne Alla Puttanesca (tomato sauce, capers, olives, and anchovies) and their special pasta with truffle sauce and shaved truffles was excellent.  Their pizzas are pretty good too.  The problem is that the service is just bad.  Even though the food comes out quickly after you order it, the wait staff are very slow and basically disregard their customers until you waive them down.  Each time we were there, we had to get the manager's attention, who then chased down our waiter, just to place our order and also to let them know we were finished eating.\n\nWith all that being said, I would go back again because the food is good and the prices are reasonable.  Just don't go on a night when you are in a rush or have something planned for after dinner.  Don't expect a fine dining experience either.", "rating": 3, "date": "2013-04-03"}], "pappardelle alla contadina": [{"excerpts": ["For my entree I ordered PAPPARDELLE ALLA CONTADINA since I love wide pasta/noodle. ", "It got to me nice and warm, noodles having the right thickness and delicate texture. ", "The creamy tomato sauce was light and had a soft taste which made me want it more. ", "There were a lot of mushrooms that really tasted like mushrooms. ", "The chicken is breast but had a simple but kind of bland taste, which was ok since it provided some protein. "], "author": "Kevin C.", "review": "\"Bueno Sera!\" I soon heard exchanged between my grandma and the host, I immediately had flashbacks about my Italy trip two summers ago - expectations were high! \n\nOn the table you are served warm complimentary bread with a small dish of olive oil for dipping... Addicting!!! \nWe started off with the ANTIPASTO DELLA CASA which included prosciutto on 2 cracker sticks, 2 pieces of flavorful bruschetta, salami and coppa scattered throughout, succulent not-to-spicy peperoncinis, voluptuous olives, grilled charbroiled-like tasting eggplant and a pile of pickled peppers. The meat was thin and fresh, and the peppers were tasty. Wish there was more and had some cheese. (See pic) \n\nFor my entree I ordered PAPPARDELLE ALLA CONTADINA since I love wide pasta/noodle. It got to me nice and warm, noodles having the right thickness and delicate texture. The creamy tomato sauce was light and had a soft taste which made me want it more. There were a lot of mushrooms that really tasted like mushrooms. The chicken is breast but had a simple but kind of bland taste, which was ok since it provided some protein. (See pic) \n\nMy dad and grandma both requested their own creation which consisted of simply tagliarini noodles with meat sauce. They ordered it since my grandma used to make some bomb homemade pesto with tagliarini noodles. They were both thoroughly satisfied with their meals, cleaning the bowl. They said the noodles were perfect and the sauce had more meat and less tomato which they liked since they aren't fans of acidic/greasy spaghetti sauce. (See pic) \n\nMy dad also ordered an iced tea which they gave him his own small pitcher along with his glass. \n\nMy sister ordered the CALZONE which she enjoyed due to the soft crust, fresh ingredients which can be tasted in each bite. It smelled really good when it arrived to her, giving off a nice buttery aroma. There was a generous amount of marina filling up almost half the plate on the folded part of the calzone. \n\nMy sister and I ordered tiramisu for dessert which was pretty good. The mascarpone was rich and the cocoa powder gave it a hint of chocolate. It didn't seem like there was any rum, or at least a taste of rum, which disappointed the inner alchy in me.  \n\nThe service was exceptional, giving off positive vibes as well accommodating my dad's custom pasta. \n\nOverall, I give this place 4 stars. Has potential. Will come again and try a pizza since there was a steady flow of to go orders getting picked up during my dinner.", "rating": 4, "date": "2014-01-05"}, {"excerpts": ["Great pastas, of which my favorite was the PAPPARDELLE ALLA CONTADINA. ", "Delightfully fresh. ", "I'm also a big fan of their carpaccio. ", "They also have a very reasonable wine selection. ", "All in all, we had a wonderful evening with consistently great service. ", "Dulce's were heavenly. ", "Located in a quaint neighborhood in the not so busy part of San Francisco called Cow Hallow. ", "My suggestion is to use Uber or another on demand taxi service if you are not driving for your trip home. ", "Not the easiest place to hail a taxis thanks again to Carlos for keeping this such a fun place to dine."], "author": "John H.", "review": "Once again, we had such a wonderful meal. Everything we had was made in house. Great pastas, of which my favorite was the PAPPARDELLE ALLA CONTADINA. Delightfully fresh. I'm also a big fan of their carpaccio. They also have a very reasonable wine selection. All in all, we had a wonderful evening with consistently great service. Dulce's were heavenly. Located in a quaint neighborhood in the not so busy part of San Francisco called Cow Hallow. My suggestion is to use Uber or another on demand taxi service if you are not driving for your trip home. Not the easiest place to hail a taxis thanks again to Carlos for keeping this such a fun place to dine.", "rating": 4, "date": "2014-12-09"}, {"excerpts": ["Everything we have had here has been excellent (pizzas, apps, pastas), but I especially love the pappardelle alla contadina (egg pasta w/ chick and mushrooms in tomato cream sauce).\n\n"], "author": "Kent S.", "review": "Favorite place to grab Italian outside of North Beach, and conveniently located close to my girlfriends place. Everything we have had here has been excellent (pizzas, apps, pastas), but I especially love the pappardelle alla contadina (egg pasta w/ chick and mushrooms in tomato cream sauce).\n\nAlways over-order, but anything brought home is always gone by the end of the night...", "rating": 5, "date": "2011-09-28"}], "tagliatelle verdi alla bolognese": [{"excerpts": ["The Good was represented by the timely service and the tasty Bresaola Con Rucola antipasto and Tagliatelle Verdi Alla Bolognese. "], "author": "Michael B.", "review": "We were pleased to get a table for two on short notice on a Friday night. Once seated we experienced the Good, the Bad and the Ugly. The Good was represented by the timely service and the tasty Bresaola Con Rucola antipasto and Tagliatelle Verdi Alla Bolognese. The Bad was the tasteless Siciliana pizza, especially the crust which was like a cardboard make-out-of-the-box variety. MUCH better pizza can be found at Delarosa, Delfina, Rose's Cafe and A-16. We found the service staff to be Ugly as they were extremely fast and abrupt, dropping dishes on the table or asking questions so fast and departing before we had any chance to react. The emphasis in the restaurant seemed to be on speed and moving customers through rather than on a slowly paced enjoyable meal experience. We hadn't been to this restaurant for a long time and will not return again for a long time.", "rating": 2, "date": "2016-02-13"}, {"excerpts": ["the tagliatelle verdi alla bolognese is melt in your mouth goodness.  ", "The pasta is Always so fresh.  ", "I've ordered bolognese elsewhere "], "author": "Lisa C.", "review": "This is one of my favorite italian restaurants because we really like the food and service.  We're pseudo-regulars and I tend to order the same thing every time I'm there.  Lame, I know, but holy boboli....the tagliatelle verdi alla bolognese is melt in your mouth goodness.  The pasta is Always so fresh.  I've ordered bolognese elsewhere but it never compares to pane e vino's.\n\nWe do occasionally order different things off the menu and the  lambchop special last night was AMAZING.  It's not on their regular menu so I hope it shows up as a nightly special again.  I'm not normally a big fan of lamb, but this was AMAZING.\n\nLots of good desserts too!  The eggless flan is a favorite.\n\nThere's usually not much waiting involved to get a table here, but on Friday and Saturday nights, it's always a good idea to make a reservation.", "rating": 5, "date": "2007-02-16"}], "linguine ai frutti di mare": [{"excerpts": ["A few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\n"], "author": "Lola D.", "review": "Small neighborhood restaurants are always a favorite of mine. I usually come here w/my favorite Italian :) Makes it that much better! Everyone always greets us kindly and I feel like I'm entering my family's home.\n\nA few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\nIf you like whites:\nBIANCO DEL FRIULI\n\nIf you like reds:\nBARBARESCO, Produttori del Barbaresco, Piemonte'06", "rating": 5, "date": "2012-06-09"}], "pennette alla boscaiola": [], "rigatoni con salsiccia e carciofini": [], "fusilli con melanzane e scamorza": [], "pollo marinato allo griglia": [{"excerpts": ["I had the pollo marinato allo griglia (chicken breast with tomato, basil, and garlic) because I felt like protein rather than carby pasta. ", "I have to admit that I was expecting a rather dull dish, but it was *delicious*! ", "The grilling was perfect so that the chicken breast was very flavorful and not at all dried out. ", "I loved this meat, and there were also a lot of nice vegetables and a couple of small pieces of potato on the side. "], "author": "Lisa K.", "review": "Great comfortable, classic, non-pretentious but still interesting Italian food. I agree that the menu almost doubles with the daily specials which don't seem to be listed online, but there are a lot of intriguing options - we saw a couple of rabbit dishes.\n\nWe were started with a lot of excellent rustic bread - of course, an excellent sign. The olive oil was pretty light and not too flavorful, and I would have liked some balsamic vinegar to have with it, but the bread alone was superb, so that was fine. The wine list is quite extensive, but our waiter helped guide us once we had narrowed it down a bit.\n\nWe shared an order of bruschetta and an antipasto plate among 4 people, which was more than enough for everyone. The only bruschetta we saw offered was pretty plain (the classic tomato, basil, olive oil), but it was spot-on. The bread was perfectly grilled/toasted and the tomatoes were flavorful and delicious. The antipasto plate was a bit unusual to me - no cheese, various meats, and lots of vegetables and beans. I loved the peppers and both white and kidney beans, but found some of the pickled items a bit too strong. \n\nI had the pollo marinato allo griglia (chicken breast with tomato, basil, and garlic) because I felt like protein rather than carby pasta. I have to admit that I was expecting a rather dull dish, but it was *delicious*! The grilling was perfect so that the chicken breast was very flavorful and not at all dried out. I loved this meat, and there were also a lot of nice vegetables and a couple of small pieces of potato on the side. The only thing I would have changed would have been to have more tomato on it.\n\nThe pasta I tried was cooked perfectly. The bolognase was a serious meat sauce - I would have also preferred this with a lot more tomato! But it tasted good. I'd love to come back and try some other pasta dishes and the pizza.\n\nI was also impressed with the dessert. The sorbet was truly outstanding - normally I feel like sorbets are substandard and thrown on a menu without care. We had three flavors (mango, raspberry, and lemon), and all were delicious - especially the lemon! There were a couple of wrapped cookies with it as well - very nice. The cheesecake was surprisingly tasty and the berries that came with it were wonderful! I also enjoyed my cappuccino. \n\nThis is a fairly cozy spot, and I was definitely glad we had reservations on a Saturday night (there doesn't seem to be much space to wait for a table!). It was bustling, bordering on loud, but not overly so, luckily. The service was generally good, although when we arrived, we were \"jokingly\" interrogated for being two minutes late for our reservation. That's fine if we were long-standing customers, etc, but as a first impression for a restaurant, it was odd. We were seated promptly. Our waiter was generally very helpful and accepted a substitution with absolutely no fuss, which was great. But a couple of times we had a bit of trouble getting his attention, and he brought out one incorrect dish (but promptly corrected it). So, a little hit or miss, but overall the service was pretty good.\n\nIt seems easy to go to really high-end, expensive, fancy Italian restaurants in the city, but actually harder to find a more casual, but still nice, classic Italian restaurant. I think Pane e Vino fits the bill and I'd be happy to go back.", "rating": 4, "date": "2011-06-18"}, {"excerpts": ["I had the Pollo Marinato Allo Griglia and the Ahi Salad. "], "author": "Will A.", "review": "So, we had a little Acton mini-reunion, but had trouble getting reservations for 16, where 9 of the 16 were kids.  Even in a bad economy, this is not an easy task, but we managed to get a table at Pane E Vino on Tuesday at 6:30.\n\nThey were very patient as the arrival time ended up stretching from 6:30-7:00 (understandable if you are a parent).\n\nFree parking is not so easy, but I managed to score rock star parking.  Helps when you are the only single one in the group and you leave work early.\n\nThe food was really good.  I had the Pollo Marinato Allo Griglia and the Ahi Salad. I also had some good Italian beer, while most everyone else had something from the killer wine list..\n\nThe dessert was ok, but I should have ordered the profiteroles instead of the mela caramellata.  The bill was steep, but considering we hogged the best table in the place for 3 hours while entertaining ourselves of stories of the hometown, it was a small price to pay.", "rating": 4, "date": "2009-07-09"}], "salsiccia con polenta e peperonata": [], "bistecca alla florentina": [], "lombata di vitello al rosmarino": [], "costolette di agnello": [], "scaloppine di vitello ai funghi": [], "verdure": [], "napoletana": [{"excerpts": ["I had the Napoletana thin crust pizza. ", "Very delicious if you like anchovies and capers. ", "If you don't, obviously, there was more going for this pizza than just the anchovies and capers, so "], "author": "Saori E.", "review": "The place was full on a Friday night, and I was glad to have made a reservation. We changed the reservation from 4 to 6 a couple hours before and they had no problem changing that, which was appreciated on our part. \n\nI had the Napoletana thin crust pizza. Very delicious if you like anchovies and capers. If you don't, obviously, there was more going for this pizza than just the anchovies and capers, so I'm sure one of the many choices will satisfy you.\n\nOur table had everything from pizza, to a roasted half-chicken, to a lamb shank, and everyone was satisfied. \n\nThe pizza is the most economical way to go, as I paid $23 (for the $13 pizza and my share of the wine + tax/tip) and still had 4 slices left for a midnight snack and the next day's lunch. \n\nThe decor is very nice here. A homely rustic Italian feel with friendly servers.", "rating": 4, "date": "2009-07-25"}, {"excerpts": ["\"Napoletana\" (tomato sauce, mozzarella, capers, anchovies and oregano)--very yummy. \n\n"], "author": "Java G.", "review": "I've walked by this place every day since I moved to the neighborhood last February. It's always busy during the evening, and I've noticed happy, laughing, satisfied-looking people coming out of there--never heard so much as a grumble. \n\nPersonally, I'd not been there, because I normally end up flying solo, and it's a white table cloth type of place. I always thought, well, maybe next time... \n\nA friend was up from So Cal a couple of months ago, and he was going to pick the restaurant. We walked all the way down the south side of Union from Gough to Fillmore, continued up Fillmore to Chestnut, did both sides, checking menus, etc, and all the way back on the north side of Union. The last place before we got back to \"go\" was Pane E Vino. He must've read 20 menus...he says \"This is it!\". \n\nSo, yeah, I got to try Pane E Vino finally. We ended up getting bruschetta, which is always good isn't it? And pizza \"Napoletana\" (tomato sauce, mozzarella, capers, anchovies and oregano)--very yummy. \n\nI haven't been back, but sometime I probably will. I'm avoiding Italian food for awhile--too many calories!", "rating": 4, "date": "2008-10-02"}, {"excerpts": ["This is the first place I've been to since Italy that nailed the Napoletana pizza.  "], "author": "Molly R.", "review": "This is the first place I've been to since Italy that nailed the Napoletana pizza.  Amazing. \n\nThe first time I went there I had the gnocchi, okay but I'm a harsh critic as I used to live in Italy.  \n\nBut the pizza... again, amazing.\n\nThey were also very accomodating as I was eating alone and had just come in from the gym - so I appreciate that they treated me the same as the normally-dressed clientele...  I don't make a habit of going to restaurants in gym clothes - but I think it says a lot that they're service was still excellent.", "rating": 5, "date": "2009-03-02"}], "giardiniera": [], "capricciosa": [{"excerpts": ["Capricciosa Pizza and Roasted Half Chicken (special). ", "The pizza was one of the best I've had and tasted great even the next day. ", "(FWIW, I'm a Chicagoan. "], "author": "Nic Z.", "review": "3.5 stars\n\nTL;DR fairly unremarkable interior and limited seating, but great food. That house bread and olive oil....oh, my.\n\nWe had...\n\nENTREES: Capricciosa Pizza and Roasted Half Chicken (special). The pizza was one of the best I've had and tasted great even the next day. (FWIW, I'm a Chicagoan. I've been told this makes me some sort of pizza guru..go figure.).\n\nDESSERT: Profiteroles. These were filled with gelato, not cream as they traditionally are (and as the menu had written). The chocolate shells were no bueno.\n\nCOFFEE: Espresso and Cappuccino. The capp was delish!\n\n\nService was okay -- not overwhelmingly friendly or quick, but decent. We were also celebrating a special occasion, and our servers either forgot or were unaware.", "rating": 3, "date": "2017-11-17"}, {"excerpts": ["A few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\n"], "author": "Lola D.", "review": "Small neighborhood restaurants are always a favorite of mine. I usually come here w/my favorite Italian :) Makes it that much better! Everyone always greets us kindly and I feel like I'm entering my family's home.\n\nA few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\nIf you like whites:\nBIANCO DEL FRIULI\n\nIf you like reds:\nBARBARESCO, Produttori del Barbaresco, Piemonte'06", "rating": 5, "date": "2012-06-09"}, {"excerpts": ["Capricciosa flat crust pizza\n(Tomato sauce, mozzarella, prosciutto, mushrooms, artichokes, olives and oregano)\n\n"], "author": "Angela C.", "review": "Can't believe that I've lived across from Ft. Mason for 3 yrs and never been here!\nThe wait staff was terrific, reminding me of the jovial ones back in Siena, Italy.  I half-expected a 'Ciao bella!' sometime during the meal.\n\nOrdered: whole-wheat pappardelle with roasted duck ragout (special) with homemade noodles.  \nCapricciosa flat crust pizza\n(Tomato sauce, mozzarella, prosciutto, mushrooms, artichokes, olives and oregano)\n\nThe pizza was delicious for breakfast and pasta for lunch today. \nI'll definitely be back.  Good thing bikini season is over and I can start indulging in Italian carbs once more.", "rating": 5, "date": "2009-09-10"}, {"excerpts": ["I've had the margherita, sicilliana, and capricciosa ", "and they're all winners. "], "author": "Josephine H.", "review": "Another neighborhood gem! I've been going to Pane e Vino for many years now and back when it was known as Via Vai.  The owners closed their other location further down on Union St and combined the two. This restaurant is definitely a place for solid Italian cuisine combined with an authentic serving staff. \n\nNow I've actually played the \"who has the best pizza in town\" game and upon visiting the classic favorites incl. Delfina and A16, I always come back to Pane e Vino for their authentic, Italian thin crust pizza. It, truly is the best you can find in SF. They've got about 15 difft pizzas to select from and it's hard to go wrong. I've had the margherita, sicilliana, and capricciosa and they're all winners. If you're looking for something really special - get the quattro formaggi and add prosciutto. The pizzas are a fairly good size so remember to share!\n\nMore favorites of mine include the housemade lasagna, ravioli, spinach salad, and the roasted chicken. If you don't know Italian reds too well, consider bringing your own ($20 corkage).\n\nWhether you're looking for a romantic date night, authentic Italian cuisine, casual dinner spot, or just some good take out - keep Pane e Vino in mind.", "rating": 4, "date": "2007-03-26"}, {"excerpts": ["we then shared the capellini al pomodoro, the capricciosa pizza, and a ravioli special, which i didn't try.  ", "i loved the capellini, b/c ", "it was simple w/ lots of fresh tomatoes.  ", "we were originally not going to order this, but we saw the ppl next to us eating it ", "and they highly recommended it!  "], "author": "Helen T.", "review": "i know it's going to be a good evening when i can find parking right outside a restaurant when i'm on union st.  i came here on fri night w/ wakako and our other friend, and it was so much fun!  we originally made a reservation for 2 ppl, but our friend decided to join us at the last minute, and we were still seated right away.\n\nwe started w/ a half carafe of the house red, and bread was brought to the table right away.  we started off w/ the caprese salad and the spinach salad.  we then shared the capellini al pomodoro, the capricciosa pizza, and a ravioli special, which i didn't try.  i loved the capellini, b/c it was simple w/ lots of fresh tomatoes.  we were originally not going to order this, but we saw the ppl next to us eating it and they highly recommended it!  the pizza was good too, but since there were a ton of toppings on it, it became a bit soggier than i had hoped.\n\nfor dessert, we shared the apple streudel and tiramisu.  like wakako said, i ate like 3/4 of the tiramisu myself b/c it was so good.  overall the experience was pleasant, as we got to sit in the back patio and chitchat w/ our neighbors.  service was excellent as well.", "rating": 4, "date": "2007-09-17"}], "prosciutto cotto e funghi": [{"excerpts": ["We had a Prosciutto Cotto e Funghi pizza and a Tiramissu for the desert. ", "Wonderful taste,  good price and good ambience. ", "It was Saturday 8:30 PM we had no reservation. ", "there was no need to wait. ", "I definitely recommend."], "author": "Flavio G.", "review": "We liked it very much. This is a local restaurant to go with your family. We had a Prosciutto Cotto e Funghi pizza and a Tiramissu for the desert. Wonderful taste,  good price and good ambience. It was Saturday 8:30 PM we had no reservation. there was no need to wait. I definitely recommend.", "rating": 4, "date": "2013-08-17"}], "quattro stagioni": [{"excerpts": ["My usual - carpaccio followed by the quattro stagioni pizza (proscuitto,mushrooms and artichoke hearts).  ", "MMM - so good.  ", "Also, great for groups.  ", "They have a large back room and are reasonably priced."], "author": "Katie M.", "review": "One of my favorite restaurants in the city.  Conveniently located on Union Street in Cow Hollow, the staff falls all over themselves to provide top notch service.  I opine that it is family owned because I seem to see the same Italian-speaking staff year after year.  My usual - carpaccio followed by the quattro stagioni pizza (proscuitto,mushrooms and artichoke hearts).  MMM - so good.  Also, great for groups.  They have a large back room and are reasonably priced.", "rating": 5, "date": "2009-09-23"}], "tirolese": [{"excerpts": ["It is not easy for me to find a good Italian restaurant in SF but at Pane e Vino you can find a decent Pizza as they have a brick oven ... you can  try   Pizza Tirolese   or  "], "author": "Rudy B.", "review": "As I am Italian .... It is not easy for me to find a good Italian restaurant in SF but at Pane e Vino you can find a decent Pizza as they have a brick oven ... you can  try   Pizza Tirolese   or  Pizza quattro formaggi  and  Prosciutto  sometime in the special that you can share  as a starter .\nPortions are big for the pizza:) \n\nI also reccomend to avoid the Pastas in all the Italian Restaurant in San Francisco  and  go directly to the main course Menu  .... \nsuch as  the Ossobuco ( Veal Shank )  served with Risotto .\nFor the pasta go on youtube and cook it at home \nhttp://www.youtube.com/watch?v=QPN1rxOd0-8&feature=related\n\nBuon appetito :)", "rating": 4, "date": "2011-04-12"}, {"excerpts": ["the tirolese pizza is AMAZING. ", "the service is great. ", "did i mention the dessert is fantastic? ", "LOVE LOVE this place."], "author": "Tenika S.", "review": "this is my favorite place to eat on union street. in fact, it's my favorite italian in sf besides beretta. the tirolese pizza is AMAZING. the service is great. did i mention the dessert is fantastic? LOVE LOVE this place.", "rating": 5, "date": "2009-12-19"}], "quattro formaggi": [{"excerpts": ["Pizza quattro formaggi  and  Prosciutto  sometime in the special that you can share  as a starter .\n"], "author": "Rudy B.", "review": "As I am Italian .... It is not easy for me to find a good Italian restaurant in SF but at Pane e Vino you can find a decent Pizza as they have a brick oven ... you can  try   Pizza Tirolese   or  Pizza quattro formaggi  and  Prosciutto  sometime in the special that you can share  as a starter .\nPortions are big for the pizza:) \n\nI also reccomend to avoid the Pastas in all the Italian Restaurant in San Francisco  and  go directly to the main course Menu  .... \nsuch as  the Ossobuco ( Veal Shank )  served with Risotto .\nFor the pasta go on youtube and cook it at home \nhttp://www.youtube.com/watch?v=QPN1rxOd0-8&feature=related\n\nBuon appetito :)", "rating": 4, "date": "2011-04-12"}, {"excerpts": ["If you're looking for something really special - get the quattro formaggi and add prosciutto. "], "author": "Josephine H.", "review": "Another neighborhood gem! I've been going to Pane e Vino for many years now and back when it was known as Via Vai.  The owners closed their other location further down on Union St and combined the two. This restaurant is definitely a place for solid Italian cuisine combined with an authentic serving staff. \n\nNow I've actually played the \"who has the best pizza in town\" game and upon visiting the classic favorites incl. Delfina and A16, I always come back to Pane e Vino for their authentic, Italian thin crust pizza. It, truly is the best you can find in SF. They've got about 15 difft pizzas to select from and it's hard to go wrong. I've had the margherita, sicilliana, and capricciosa and they're all winners. If you're looking for something really special - get the quattro formaggi and add prosciutto. The pizzas are a fairly good size so remember to share!\n\nMore favorites of mine include the housemade lasagna, ravioli, spinach salad, and the roasted chicken. If you don't know Italian reds too well, consider bringing your own ($20 corkage).\n\nWhether you're looking for a romantic date night, authentic Italian cuisine, casual dinner spot, or just some good take out - keep Pane e Vino in mind.", "rating": 4, "date": "2007-03-26"}], "siciliana": [{"excerpts": ["The Bad was the tasteless Siciliana pizza, especially the crust which was like a cardboard make-out-of-the-box variety. ", "MUCH better pizza can be found at Delarosa, Delfina, Rose's Cafe and A-16. ", "We found the service staff to be Ugly as they were extremely fast and abrupt, dropping dishes on the table or asking questions so fast and departing before we had any chance to react. ", "The emphasis in the restaurant seemed to be on speed and moving customers through rather than on a slowly paced enjoyable meal experience. ", "We hadn't been to this restaurant for a long time and will not return again for a long time."], "author": "Michael B.", "review": "We were pleased to get a table for two on short notice on a Friday night. Once seated we experienced the Good, the Bad and the Ugly. The Good was represented by the timely service and the tasty Bresaola Con Rucola antipasto and Tagliatelle Verdi Alla Bolognese. The Bad was the tasteless Siciliana pizza, especially the crust which was like a cardboard make-out-of-the-box variety. MUCH better pizza can be found at Delarosa, Delfina, Rose's Cafe and A-16. We found the service staff to be Ugly as they were extremely fast and abrupt, dropping dishes on the table or asking questions so fast and departing before we had any chance to react. The emphasis in the restaurant seemed to be on speed and moving customers through rather than on a slowly paced enjoyable meal experience. We hadn't been to this restaurant for a long time and will not return again for a long time.", "rating": 2, "date": "2016-02-13"}, {"excerpts": ["Try the siciliana with spicy sausage.  "], "author": "Brad C.", "review": "Amazing thin crust pizza.  Try the siciliana with spicy sausage.  I am wishing I saved a slice for this morning.\n\nWarm spinanch salad and flattened chicken breast were also really good.  Some decent house wines and its really hard not to leave this place happy.", "rating": 4, "date": "2007-03-26"}], "boscaiola": [{"excerpts": ["A few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\n"], "author": "Lola D.", "review": "Small neighborhood restaurants are always a favorite of mine. I usually come here w/my favorite Italian :) Makes it that much better! Everyone always greets us kindly and I feel like I'm entering my family's home.\n\nA few of my favs here:\nGUAZZETTO DI PESCE\nMOZZARELLA ALLA CAPRESE\nLINGUINE AI FRUTTI DI MARE\nCAPRICCIOSA-pizza\nBOSCAIOLA-pizza\n\nIf you like whites:\nBIANCO DEL FRIULI\n\nIf you like reds:\nBARBARESCO, Produttori del Barbaresco, Piemonte'06", "rating": 5, "date": "2012-06-09"}], "diavola": [], "alla salsiccia": [], "calzone con prosciutto e funghi": [], "mela caramellata": [{"excerpts": ["The dessert was ok, but I should have ordered the profiteroles instead of the mela caramellata.  ", "The bill was steep, but considering we hogged the best table in the place for 3 hours while entertaining ourselves of stories of the hometown, it was a small price to pay."], "author": "Will A.", "review": "So, we had a little Acton mini-reunion, but had trouble getting reservations for 16, where 9 of the 16 were kids.  Even in a bad economy, this is not an easy task, but we managed to get a table at Pane E Vino on Tuesday at 6:30.\n\nThey were very patient as the arrival time ended up stretching from 6:30-7:00 (understandable if you are a parent).\n\nFree parking is not so easy, but I managed to score rock star parking.  Helps when you are the only single one in the group and you leave work early.\n\nThe food was really good.  I had the Pollo Marinato Allo Griglia and the Ahi Salad. I also had some good Italian beer, while most everyone else had something from the killer wine list..\n\nThe dessert was ok, but I should have ordered the profiteroles instead of the mela caramellata.  The bill was steep, but considering we hogged the best table in the place for 3 hours while entertaining ourselves of stories of the hometown, it was a small price to pay.", "rating": 4, "date": "2009-07-09"}], "fior di latte e salsa di caramello": [], "affogato al caffe": [], "bacche di bosco": [], "cantucci con vin santo": [], "crostata del giorno": [], "gelati misti": [], "profiteroles": [{"excerpts": ["DESSERT: Profiteroles. ", "These were filled with gelato, not cream as they traditionally are (and as the menu had written). "], "author": "Nic Z.", "review": "3.5 stars\n\nTL;DR fairly unremarkable interior and limited seating, but great food. That house bread and olive oil....oh, my.\n\nWe had...\n\nENTREES: Capricciosa Pizza and Roasted Half Chicken (special). The pizza was one of the best I've had and tasted great even the next day. (FWIW, I'm a Chicagoan. I've been told this makes me some sort of pizza guru..go figure.).\n\nDESSERT: Profiteroles. These were filled with gelato, not cream as they traditionally are (and as the menu had written). The chocolate shells were no bueno.\n\nCOFFEE: Espresso and Cappuccino. The capp was delish!\n\n\nService was okay -- not overwhelmingly friendly or quick, but decent. We were also celebrating a special occasion, and our servers either forgot or were unaware.", "rating": 3, "date": "2017-11-17"}, {"excerpts": ["Profiteroles's cream puff seemed old $10.\n\n"], "author": "Vic M.", "review": "Excellent service by Favio and the rest of the staff.\n\nThe special antipasti Guazzeto Di Pesce (similar to cioppino with clams, mussels, shrimp and calamari in a delicious slightly spicy tomato sauce) was fantastic. For sure I'll have this again $19.95\n\nThe special Pappardelle con Funghi Galletie Prosciutto (extra wide egg noodles, chantrelle mushrooms, cream snd prosciutto) was awesome $22.95\n\nThe Montepulciano d'Abruzzo wine was great ($11 per glass)\n\nThe bruschetta has the most tomatoes I've ever had. Delicious.\n\nThe dessert gelato was delicious although a bit too pricey at $10.\n\nThe dessert Profiteroles's cream puff seemed old $10.\n\nThe coffee seemed like Nescafe.\n\nOverall this is a great Italian restaurant.", "rating": 5, "date": "2017-08-02"}, {"excerpts": ["We then opted for the Profiteroles, which are white chocolate gelato filled cream puffs topped with hot chocolate sauce! ", "This was heaven! ", "I can't wait to go back."], "author": "Jeanette Jane G.", "review": "My buddy and I stroll in on a Sunday evening. I wasn't expecting it to be busy because it was Sunday, but this place was, which is a good sign, no? Miraculously, there were two seats available at the counter area, which we did not hesitate to take. We promptly ordered wine and we wet for the three cheese ravioli and sword fish. The bread and olive oil was your typical stuff, but we were impressed by the food. I have not tasted more delicious ravioli than I did here. I wish I would have had the stomach space to order a whole other plate of it because it was good. We then opted for the Profiteroles, which are white chocolate gelato filled cream puffs topped with hot chocolate sauce! This was heaven! I can't wait to go back.", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["I had profiteroles - they were fine but envious of the cheesecakes my family was eating.        \n", "They bring crusty delicious bread with olive oil when you sit down.  ", "Dine here maybe stay away from the pasta with red sauce."], "author": "Moab E.", "review": "Visiting San Fran with family - 3 teen boys and husband.  Picked close to hotel and recommendations from Yelp.  Overall tasty food, filled and mainly locals.  I had a special homemade papadelle with wild mushroom black truffle cream sauce.  Wanted to lick my bowl.  The four cheese pasta on the regular menu  with smoked mozzarella and three other cheeses was incredible.  One sone ordered a special ravioli which he lived. A margarita pizza - bit if a soggy crust but devoured. My husband had the beef rigatoni which was meh - hence the 4 stars.  Waiter was friendly and a bit busy.  Ended with the BEST cheesecake we have ever tasted - usually too dessert pick so we have tried lots.  I had profiteroles - they were fine but envious of the cheesecakes my family was eating.        \nThey bring crusty delicious bread with olive oil when you sit down.  Dine here maybe stay away from the pasta with red sauce.", "rating": 4, "date": "2015-07-17"}, {"excerpts": ["For dessert we had the profiteroles, apple strudel and the puffed pastry with fresh berries and cream ( my favorite).\n\n"], "author": "Kara K.", "review": "Delicious! \n\nMy family is very sceptical when we go out expecially for italian because we have had more crappy meals than good. I hate to spend money on an average meal when I can make it myself, better. I am an italian cook and a damn good one (if I may say).\n \nThis restaurant was outstanding! We had a few different pasta dishes and shared them. We all loved out meals. I had the pasta with pancetta and mushrooms, my daughter had the spinach fettuchini with bolognese, my dad had the veal scallopini, my mom the risotto with asparagus and rock shrimp and my husband had the angel hair pasta with tomatoes.\n\nFor dessert we had the profiteroles, apple strudel and the puffed pastry with fresh berries and cream ( my favorite).\n\nWe went on a Thursday for a 7:30 reservation and were leaving at about 9. The place was still packing in the people. You know that's always a sign of a great restaurant!", "rating": 5, "date": "2012-07-21"}, {"excerpts": ["We chose the profiteroles and they were amazing.  ", "Also in a nice part of town with plenty of boutique type shops up and down Union Street. ", "You can tell it is really good because almost all the customers are regulars and locals.  ", "The staff knew just about everyone.  ", "And by the way, the staff is super on top of their game.  ", "Super service!"], "author": "Rob J.", "review": "We were looking for a hidden gem and found it.  Using yelp, we felt this was a good place to try. WOW, what a great find.  Atmosphere is warm and inviting and reminiscent of a true restaurant in Rome. Food was simply amazing.  We split a salad and had the ravioli and corkscrew pasta. Both were amazing. The ravioli a were obviously homemade and cooked perfectly. We had to share a dessert because we were so full.  We chose the profiteroles and they were amazing.  Also in a nice part of town with plenty of boutique type shops up and down Union Street. You can tell it is really good because almost all the customers are regulars and locals.  The staff knew just about everyone.  And by the way, the staff is super on top of their game.  Super service!", "rating": 5, "date": "2014-02-24"}, {"excerpts": ["The dessert was ok, but I should have ordered the profiteroles instead of the mela caramellata.  ", "The bill was steep, but considering we hogged the best table in the place for 3 hours while entertaining ourselves of stories of the hometown, it was a small price to pay."], "author": "Will A.", "review": "So, we had a little Acton mini-reunion, but had trouble getting reservations for 16, where 9 of the 16 were kids.  Even in a bad economy, this is not an easy task, but we managed to get a table at Pane E Vino on Tuesday at 6:30.\n\nThey were very patient as the arrival time ended up stretching from 6:30-7:00 (understandable if you are a parent).\n\nFree parking is not so easy, but I managed to score rock star parking.  Helps when you are the only single one in the group and you leave work early.\n\nThe food was really good.  I had the Pollo Marinato Allo Griglia and the Ahi Salad. I also had some good Italian beer, while most everyone else had something from the killer wine list..\n\nThe dessert was ok, but I should have ordered the profiteroles instead of the mela caramellata.  The bill was steep, but considering we hogged the best table in the place for 3 hours while entertaining ourselves of stories of the hometown, it was a small price to pay.", "rating": 4, "date": "2009-07-09"}, {"excerpts": ["if you're with a few people, you get  to order multiple courses and share everything - from carpaccio to risotto to profiteroles, yum."], "author": "Megan C.", "review": "Pane E Vino is one of the few fine, classic neighborhood restaurants left in San Francisco. It's been a favorite of my family's for many years, because of the excellent food, the hospitable, professional service... there are not a lot of places with that sophistication.  It's a relaxing yet elegant restaurant that people who really know the city go to, but it isn't scene-y or self-conscious... so, it makes you feel like a native San Franciscan... albeit one on vacation in Italy!  There are waitstaff that have been there for decades, greet you like family and steer you to the best specials and treats. (A visiting friend who is a denizen of New York's best Italian restaurants was so impressed by our tone-perfect waiter --friendly and entertaining, yet thoroughly professional-- she always asks how she can steal him away to work in New York!) A cozy spot for a couple, but if you're with a few people, you get  to order multiple courses and share everything - from carpaccio to risotto to profiteroles, yum.", "rating": 5, "date": "2013-02-14"}, {"excerpts": ["The profiteroles were fantastic little puffs of pure joy (ice cream and hot fudge). \n\n"], "author": "Julia N.", "review": "3.5 Stars \n\nI think I enjoyed the service and people here more than I did the meal, although the food was definitely enjoyable. Our server was SO attentive and nice. While trying to figure out what kind of wine I was going to have with dinner, he offered me three glasses with very large \"tastes\" in them. Not only was it fun to sample the wine but I got entirely drunk on them alone! I just love it when a restaurant goes out of their way to make sure you're getting what you want. It's such a nice feeling to know that your money is being well spent. \n\nWe ordered the Eggplant Parm appetizer to start which was good. I won't go as far as to call it great because it wasn't cooked quite how I like it. I like eggplant when it melts in your mouth and this was a tad chewy. For our main course we split a pizza which was yummy. I would have liked to see the crust on the bottom a little crunchier. It got a little soggy in the cooking process. The dessert was the best part of the meal in my opinion. The profiteroles were fantastic little puffs of pure joy (ice cream and hot fudge). \n\nThe only bothersome part of the meal was this tiny black bug that kept circling our table. Every time I thought I had swatted it into oblivion, some how it found it's way back buzzing in my face. Grrrr....", "rating": 3, "date": "2009-02-17"}, {"excerpts": ["I was too full for dessert, but will come back for their profiteroles which looked amazing.\r\n\r\n", "It's a great place for a 1st date (romantic, but not over the top).  ", "A very cozy little nook that I plan to visit again soon!"], "author": "Stephanie W.", "review": "I went on a date here a few days ago and had a really great time!  Good company yes, but the food was pretty good too.  I had a great pasta (on of the fettuccine dishes) and a chicken entree (which was huge).  I was too full for dessert, but will come back for their profiteroles which looked amazing.\r\n\r\nIt's a great place for a 1st date (romantic, but not over the top).  A very cozy little nook that I plan to visit again soon!", "rating": 4, "date": "2006-01-28"}, {"excerpts": ["End it all with any one of the following - a caramelized apple served with sour cream and almond sauce, profiteroles filled with white chocolate gelato and topped with hot chocolate sauce, or a heavenly tiramisu. ", "Considering the upscale Cow Hollow location and the quality of the food, prices are shockingly ", "low - pastas are $12 and $13, entrees run between $15 and $25, pizzas from $10 to $13, and most desserts are $6. ", "Service is impeccable, and regulars are treated like family (albeit one that still must pay the bill). ", "So go. ", "But remember . . . ", "don't tell another soul."], "author": "Gourmet G.", "review": "To be a yelper is to be willing to make the ultimate sacrifice - sharing a treasured restaurant with others while hoping word-of-mouth won't make it so popular that you can never easily get a table again. So I'll tell you about this gem, but only if you promise to keep it just between us, OK? Now consolidated with Via Vai, Pane e Vino serves regional Italian-style cuisine, featuring simply grilled fresh fish and meats, thin-crusted pizzas, and exceptional pasta dishes, all of it extremely flavorful. Despite the name, man cannot live by bread and wine alone, so start out with the spinach salad, the crisp leaves tossed with warm pancetta and eggs in a balsamic vinger-olive oil dressing. Move on to farfalle (bowtie pasta) with smoked salmon, firm peas, and sun-dried tomatoes in a rich cream sauce. Then dig into a rosemary-scented rib-eye steak with a side of Tuscan beans. End it all with any one of the following - a caramelized apple served with sour cream and almond sauce, profiteroles filled with white chocolate gelato and topped with hot chocolate sauce, or a heavenly tiramisu. Considering the upscale Cow Hollow location and the quality of the food, prices are shockingly low - pastas are $12 and $13, entrees run between $15 and $25, pizzas from $10 to $13, and most desserts are $6. Service is impeccable, and regulars are treated like family (albeit one that still must pay the bill). So go. But remember . . . don't tell another soul.", "rating": 5, "date": "2005-08-14"}], "torta di formaggio": [], "arneis cascina val del prete luet piemonte": [], "bianco del collio chardsauvpinot g tocai zuani  san floriano del collio friuli": [], "fiano di avellino pietracupa campania": [], "pinot grigio st michael eppan trentino": [], "pinot grigio aristos cantina valle isarco  sudtirol": [], "ribolla  friulano zamo bianco le vigne di zamo friuli": [], "sauvignon gumphof sdtirol bressanone alto adige": [], "soave classico pieropan veneto": [], "verdicchio dei castelli di jesi classico superiore marotti campi marche": [], "vermentino di gallura canayli sardegna": [], "vernaccia di san gimignano terre di tufi teruzzi  puthod toscana": [], "chardonnay sonoma cutrer russian river": [], "chardonnay cakebread cellars napa valley": [], "chardonnay newton unfiltered napa valley": [], "sauvignon honig napa valley": [], "sauvignon blanc duckhorn vineyards napa valley": [], "amarone della valpolicella capitel dei roari luigi righetti veneto": [], "amarone della valpolicella cesari  veneto": [], "amarone classico venturini veneto": [], "barbaresco produttori del barbaresco piemonte": [], "barbaresco sori paitin paitin piemonte": [], "barbera colli tortonesi ricci piemonte": [], "barbera lusenti martin val ziano ziano piacentino": [], "barbera dalba cascina val del prete serra degatti alba  piemonte": [], "barbera dalba cascina ca rossa mulassa le langhe piemonte": [], "barolo giacomo fenocchio bussia piemonte": [], "barolo rinaldi francesco canubbio piemonte": [], "barolo rinaldi giuseppe brunate le coste barolo piemonte": [], "brunello di montalcino col dorcia montalcino": [], "brunello di montalcino caprili montalcino": [], "brunello di montalcino antinori pian delle vigne  montalcino": [], "brunello di montalcino riserva tenuta il poggione franceschi montalcino": [], "chianti classico fattoria felsina berardenga": [], "chianti classico riserva conti serristori macchiavelli toscana": [], "chianti classico riserva san vincenti gaiole in chianti": [], "dolcetto dalba francesco rinaldi piemonte": [], "merlot cabernet sauvignon rosso riserva vignalta colli euganei veneto": [], "merlot cabernet franc gemola vignalta colli euganei veneto": [], "montepulciano dabbruzzo collefrisio zero": [], "nebbiolo roero d o c cascina ca rossa vigna audinaggio alba piemonte": [], "nebbiolo roero d o c cascina val del prete priocca alba": [], "pinot nero st michael eppan sdtirol alto adige": [], "rosso di montalcino caprili montalcino": [], "sagrantino di montefalco azienda agricola scacciadiavoli montefalco umbria": [], "sangiovesemontepulciano rosso piceno superiore poderi s lazzaro offida march": [], "sangiovese cabernet ornellaia le volte toscana rosso": [], "sassicaia tenuta san guido bolgheri toscana": [], "solaia cabsauv cab franc sangiovese antinori toscana": [], "tignanello sangiovese cabsauv syrah antinori toscana": [], "valpolicella classico ripasso venturini semonte alto san floriano verona": [], "cabernet sauvignon clos du val napa valley": [], "cabernet sauvignon chateau montelena napa valley": [], "cabernet sauvignon jordan vineyards alexander valley": [], "cabernet sauvignon duckhorn vineyards napa valley": [], "merlot clos pegase mitsukos napa valley": [], "merlot duckhorn vineyards napa valley": [], "pinot noir tolosa edna ranch edna valley": [], "pinot noir barnett vineyards donnelly creek anderson valley": [], "pinot noir emeritus russian river sonoma": [], "pinot noir foxen vineyard santa maria": [], "zinfandel seghesio vineyard sonoma": []}