{"cafe macchiato": [], "iced mocha": [], "golden gate green salad": [], "palms deluxe salad": [{"excerpts": ["I got the Palms Deluxe Salad with chicken to go and a ginger ale, totaled to around $11. ", "The salad was fresh, delicious, extremely filling. ", "The lady who ran the shop was extremely nice. ", "Would definitely go back to get the salad again or try the paninis."], "author": "Katie C.", "review": "Great sandwich/salad place in the Haight. Feels healthier than alternatives in the area like Squat and Gobble, Pork Store Cafe, etc.  I got the Palms Deluxe Salad with chicken to go and a ginger ale, totaled to around $11. The salad was fresh, delicious, extremely filling. The lady who ran the shop was extremely nice. Would definitely go back to get the salad again or try the paninis.", "rating": 5, "date": "2013-12-24"}, {"excerpts": ["I ordered the Palms Deluxe salad (BEST SALAD I'VE ", "EVER HAD HANDS DOWN!!)", ", which came with spring mix lettuce, fresh avocado, feta cheese, sun dried tomatoes, cucumbers and a delicious balsamic dressing. ", "I can't for the life of me remember the name of my mom's salad because I was obviously way too busy and focused on my own plate of heaven. ", "But her salad came with spring mix lettuce, cucumber, fresh mozzarella cheese, cilantro and the balsamic dressing as well. "], "author": "Theresa A.", "review": "After shopping for a couple of hours with my mom, we were so exhausted and hungry but both of us (me especially) are the most indecisive people when it comes to deciding where to eat. We came across this place after just walking by and happening to take a minute break to finally decide where we were going to eat. The menu caught my eye and I started reading about the delicious paninis and salads, it was decided this was it! \n\nThe inside is a little small, cramped for seating space. The girls working were so friendly! I ordered the Palms Deluxe salad (BEST SALAD I'VE EVER HAD HANDS DOWN!!), which came with spring mix lettuce, fresh avocado, feta cheese, sun dried tomatoes, cucumbers and a delicious balsamic dressing. I can't for the life of me remember the name of my mom's salad because I was obviously way too busy and focused on my own plate of heaven. But her salad came with spring mix lettuce, cucumber, fresh mozzarella cheese, cilantro and the balsamic dressing as well. I also ordered an iced coffee, which was so yummy and strong.\n\nTry this place, definitely. You won't regret it. I wish I didn't live so far away or else this would be my go-to place everyday. But it's definitely my go to place every time I'm in Haight from now on. I was so impressed!", "rating": 5, "date": "2012-07-03"}, {"excerpts": ["But ultimately i settled on the Palms Deluxe Salad which was romaine + spring mix w/ goat cheese, sun dried tomatoes, cucumbers, candied pecans & balsamic. ", "And i decided to add chicken to it as well. ", "It was delciousss! ", "But when  i got my salad the girl forgot to put the chicken on it but immediately realized it ", "so she ran back to the kitchen and brought it out. ", "To drink i got a large iced tea (which was only $2.50 btw), expecting it to be regular black tea, but when i got it ", "it was like the passion fruit crap from Starbucks :( ", "Bummer. ", "Oh well. \n", "I don't remember what my friends ordered but i remember that they enjoyed it. ", "The only thing that i have to say is lame about this place is the seating. ", "The tables in here are SO small. ", "But i suppose this place isn't very big ", "so it probably couldn't fit much else. \n", "Next time i'm around, i'll have to give one of their delicious looking paninis a try."], "author": "Amanda S.", "review": "After walking around Haight we wanted to pick up some sandwiches to bring with us to Golden Gate Park for a picnic. We walked into Panini and we were the only ones in there! That rarely happens in SF, haha. So we decided to take advantage of it and we just ate there instead of getting it to go. \nLots of things looked good and it took me forevvverrr to decide. But ultimately i settled on the Palms Deluxe Salad which was romaine + spring mix w/ goat cheese, sun dried tomatoes, cucumbers, candied pecans & balsamic. And i decided to add chicken to it as well. It was delciousss! But when  i got my salad the girl forgot to put the chicken on it but immediately realized it so she ran back to the kitchen and brought it out. To drink i got a large iced tea (which was only $2.50 btw), expecting it to be regular black tea, but when i got it it was like the passion fruit crap from Starbucks :( Bummer. Oh well. \nI don't remember what my friends ordered but i remember that they enjoyed it. The only thing that i have to say is lame about this place is the seating. The tables in here are SO small. But i suppose this place isn't very big so it probably couldn't fit much else. \nNext time i'm around, i'll have to give one of their delicious looking paninis a try.", "rating": 4, "date": "2009-08-21"}], "panini salad": [], "chicken pesto panini": [{"excerpts": ["I got the Chicken Pesto Panini and my boyfriend got the Turkey Dijon Panini and we were both extremely satisfied! ", "The salad served with is was also very fresh! ", "The prices were great and the food was delicious! ", "I would definitely recommend this to anyone visiting Haight and Ashbury!"], "author": "Madee W.", "review": "Absolutely delicious! My boyfriend and I stopped here while spending a weekend in San Francisco and were so please once we got our food! I got the Chicken Pesto Panini and my boyfriend got the Turkey Dijon Panini and we were both extremely satisfied! The salad served with is was also very fresh! The prices were great and the food was delicious! I would definitely recommend this to anyone visiting Haight and Ashbury!", "rating": 4, "date": "2018-06-22"}, {"excerpts": ["My chicken pesto panini is uninspiring. ", "Bread and chicken are dried up and don't seem fresh. ", "Will not go out of my way to eat here."], "author": "Demin G.", "review": "My chicken pesto panini is uninspiring. Bread and chicken are dried up and don't seem fresh. Will not go out of my way to eat here.", "rating": 3, "date": "2017-11-19"}, {"excerpts": ["My favorite is the chicken pesto panini with a side salad for about $7.50 \n", "Usually a very short wait for food, 10 minutes. \n"], "author": "Jess W.", "review": "My favorite is the chicken pesto panini with a side salad for about $7.50 \nUsually a very short wait for food, 10 minutes. \nif you're on a crunch, call in for pick up. \n\nLarge selection of panninis. \nI wish they put more dressing on the salad. Sometimes I get like 3 dribbles of dressing and it's gets too dry for me to eat. \n\nParking is a bit difficult depending on the time of your arrival of course.", "rating": 4, "date": "2014-07-04"}, {"excerpts": ["and we ordered a chicken pesto panini and chicken arugula panini. "], "author": "Fiona T.", "review": "Finally got to try this place after bookmarking on yelp since they've opened\n\nCame with husband and baby and we ordered a chicken pesto panini and chicken arugula panini. It came out toasted and both with a side salad. \n\nThe panini's were both pretty good. I think the arugula panini had a little more flavor than the pesto one but both was tasty. \n\nThey have a few other panini options, salads and drinks. Place is small with a few tables. I would come here again if I was in the area. The service was friendly too.", "rating": 4, "date": "2016-05-10"}, {"excerpts": ["Delicious chicken pesto panini.\n", "Heads up ", "they only have three tables in this joint."], "author": "Varun V.", "review": "Delicious chicken pesto panini.\nHeads up they only have three tables in this joint.", "rating": 4, "date": "2013-06-27"}, {"excerpts": ["I've only ordered the chicken pesto panini from here, but it is freakin' delicious! ", "It comes with a lightly dressed salad on the side as well.  ", "I'll have to try the other sandwiches next time."], "author": "Marc B.", "review": "I've only ordered the chicken pesto panini from here, but it is freakin' delicious! It comes with a lightly dressed salad on the side as well.  I'll have to try the other sandwiches next time.", "rating": 4, "date": "2014-12-23"}, {"excerpts": ["Nodding my head while eating the best chicken pesto panini. ", "#GoodMorningWorld. ", "Perfect chill eatery."], "author": "Damien S.", "review": "Nodding my head while eating the best chicken pesto panini. #GoodMorningWorld. Perfect chill eatery.", "rating": 4, "date": "2014-02-22"}, {"excerpts": ["The chicken pesto panini is pretty delicious too :-)\n"], "author": "Erin H.", "review": "Holy crap, the Nichole's Panini is to die for!! My mouth is watering just thinking about it!! Turkey, havarti cheese, bacon, avocado, tomato, grilled to perfection...yum! The chicken pesto panini is pretty delicious too :-)\nThey also give you a little salad with the paninis and the dressing they use is also awesome!\n\nThe restaurant itself is teeny tiny, it might fit 10-15 people at one time max. I always get it to go and eat at home. They have a unique selection of drinks, however they have been out of Sanpelegrino Limonata recently...boo!\n\nLove this place!", "rating": 5, "date": "2011-07-07"}, {"excerpts": ["Had the chicken pesto panini, came with a side salad ", "and I got a bag of chips, $9.71.  ", "Overall the sandwich was a bit bland and kind of greasy.  ", "Probably won't come back again."], "author": "sam h.", "review": "Had the chicken pesto panini, came with a side salad and I got a bag of chips, $9.71.  Overall the sandwich was a bit bland and kind of greasy.  Probably won't come back again.", "rating": 3, "date": "2015-09-01"}, {"excerpts": ["The man who was making food asked what I would like, so I ordered a chicken pesto panini. ", "A woman came to the register, I got an organic lemonade. ", "It was all only about $9!!! ", "Awesome. ", "So I got my chicken pesto panini and it came with a salad. ", "Mm the salad was pretty damn yummy ", ":). ", "Then I ate my panini. ", "Ooomg!!! "], "author": "Erica A.", "review": "My friend was getting a tattoo & I wasn't, so I decided to wander off for some gruuub! I had no idea what to eat because I don't hang around Haight very often. In fact, I was searching for a pizza place; but I was walking in the wrong direction. Oops!\n\nWell. My boyfriend knows this place very well, but he was busy so I snuck away to get some food on my own. I walked past this place and figured, hey why not? There's one table left and I'll sit there to eat :).\n\nI was pretty much confused when I walked in because there was nobody at the register to take my order!! The man who was making food asked what I would like, so I ordered a chicken pesto panini. A woman came to the register, I got an organic lemonade. It was all only about $9!!! Awesome. :)\n\nI waited a while, and more people came in. I was just hoping that nobody would take that single table!!! Luckily, everyone was getting food to go. So I got my chicken pesto panini and it came with a salad. Mm the salad was pretty damn yummy :). Then I ate my panini. Ooomg!!! It was crunchy and cheesy and perfect!!\n\nWell my boyfriend realized I was gone and came searching for me. :( I had to share my amazing panini with him!! Grrrr D:\nNeedless to say, I will be back. And next time, he's getting his own. :D", "rating": 4, "date": "2010-09-26"}, {"excerpts": ["I had the chicken pesto panini and the bread was seriously the best ever- hot, crispy, toasty.. ", "Yum. ", "My only complaint with the sandwich was that it's supposed to have sundried tomatoes but mine only had 2 puny ones.. ", "I think they could have added more "], "author": "Joy A.", "review": "Awesome sandwich. Simple as that.\n\nI had the chicken pesto panini and the bread was seriously the best ever- hot, crispy, toasty.. Yum. My only complaint with the sandwich was that it's supposed to have sundried tomatoes but mine only had 2 puny ones.. I think they could have added more but I didn't want to bother them. \n\nThe blonde girl who took my order was a bit rude though. I told her I was excited to try their food and that it was my first time and her response was,\" cool.\" No \"welcome\" or \"yay\" or you're in for a treat, but just a \"cool\" that came out of her nose. Oh well. Maybe she was having a bad day.\n\nThere's limited seating but you can easily find a nice place to sit on Haight. Great sandwich! Yay.", "rating": 4, "date": "2009-05-04"}, {"excerpts": ["I wouldn't be so harsh on the panini, but when I came in I saw the chicken pesto panini from the menu sitting underneath a glass display and initially thought it was a just a floor sample.  ", "When I saw the floor sample slapped onto a Foreman grill I got a little worried, but calmed myself when I remembered that this was the cheapest sandwich place in the area.  ", "After taking the first bite of the panini, I was pretty disappointed and realized that often you get what you pay for. ", "The biggest pro to this place (at least on the day I was here) was the hot euro girls working behind the counter."], "author": "E-dough R.", "review": "Bad trance and a mediocre panini.  I wouldn't be so harsh on the panini, but when I came in I saw the chicken pesto panini from the menu sitting underneath a glass display and initially thought it was a just a floor sample.  When I saw the floor sample slapped onto a Foreman grill I got a little worried, but calmed myself when I remembered that this was the cheapest sandwich place in the area.  After taking the first bite of the panini, I was pretty disappointed and realized that often you get what you pay for. The biggest pro to this place (at least on the day I was here) was the hot euro girls working behind the counter.", "rating": 3, "date": "2008-09-16"}], "nicholes panini": [], "italiano sandwich": [], "turkey dijon sandwich": [], "chicken arugula sandwich": [{"excerpts": ["I had the chicken arugula sandwich which was very good and tasty. ", "I loved how the chicken was thinly sliced and the arugula gave the sandwich a nice mild spicy flavor. ", "The panini sandwich reminded me of a fresh oven baked cookie; although it doesn't taste the same but the textures were there, nice and soft in the inside and crunchy texture on the outside. "], "author": "Jenn S.", "review": "I finally made my first visit to Panini last weekend. I've heard good reviews about this place from family members. I had the chicken arugula sandwich which was very good and tasty. I loved how the chicken was thinly sliced and the arugula gave the sandwich a nice mild spicy flavor. The panini sandwich reminded me of a fresh oven baked cookie; although it doesn't taste the same but the textures were there, nice and soft in the inside and crunchy texture on the outside. The panini comes with a side salad of fresh greens and the sandwiches are quite affordable which range between $6-7. \n\n I would give this place 5 stars except they should've added more cheese to make it super cheesy. \n\nThey had a great variety of chips, drinks, pastries.\n\nA great place and I would go back to try all the paninis! Of course not all in one sitting.", "rating": 4, "date": "2010-01-25"}], "organic roasted yams panini": [], "avo spinach veggie panini": [{"excerpts": ["The Avo spinach veggie panini is delicious."], "author": "Jessica S.", "review": "Probably the best sandwich I have ever had. The Avo spinach veggie panini is delicious.", "rating": 5, "date": "2017-11-26"}], "mozzarella basil panini": [{"excerpts": ["so i ordered an organic roasted yams sandwich and a mozzarella basil panini sandwich. ", "Both great choices if you want something simple but they dont lack flavor at all. ", "I know many of you are like yam sandwich? ", "are you kidding? ", "but it all comes together and now this is my go to sandwich spot in SF. ", "The panini bread is top notch as well and all the sandwiches come with a nice little side salad. ", "Check this place out!"], "author": "Stony S.", "review": "really good sandwiches and salads. Best sandwich in SF no doubt. I'm a huge meat eater and i decided to take a break from meat for a month, so i ordered an organic roasted yams sandwich and a mozzarella basil panini sandwich. Both great choices if you want something simple but they dont lack flavor at all. I know many of you are like yam sandwich? are you kidding? but it all comes together and now this is my go to sandwich spot in SF. The panini bread is top notch as well and all the sandwiches come with a nice little side salad. Check this place out!", "rating": 5, "date": "2017-01-12"}], "chicken caesar panini": []}