{"homemade trio salsa": [], "esquite": [{"excerpts": ["Highly recommend the esquite and white sangria as well! ", "Yummy churros too :)"], "author": "Kara B.", "review": "One of my favorite spots to grab Mexican in SF! Amazing homemade chips that are served warm with their tasty salsa trio. Delicious homemade chorizo that's not too greasy like at a lot of other places. I love ceviche and they serve a great tomato-y one (ceviche Papito). Highly recommend the esquite and white sangria as well! Yummy churros too :)", "rating": 5, "date": "2017-06-15"}, {"excerpts": ["Also got the esquite, which was alright but not made in the traditional way and definitely nothing to rave about. ", "They put tomato and other stuff that takes from the flavor of the corn. ", "The traditional esquite is served in a cup, with crema and Lemon. ", "They had a pretty good wine selection and the space was very nice. ", "I've had better Mexican food in SF, though."], "author": "Carolina R.", "review": "Dinner was fairly good here as was the service. I got 4 tacos: al pastor, carnitas, carne asada, and carnitas de pato. All very good, moist, delicious meat, good amount, double corn tortilla. The jicama salad was pasable. Also got the esquite, which was alright but not made in the traditional way and definitely nothing to rave about. They put tomato and other stuff that takes from the flavor of the corn. The traditional esquite is served in a cup, with crema and Lemon. They had a pretty good wine selection and the space was very nice. I've had better Mexican food in SF, though.", "rating": 3, "date": "2015-11-20"}, {"excerpts": ["In the end, I ordered the Esquite with black beans and corn. \n\n", "My Esquite was in a small, shallow earthen-colored bowl. ", "Flowers, green onions, and Cojito cheese were sprinkled on top of it. ", "The dish itself was very homey and tasty; the corn was fresh/sweet and the beans perfectly soft (but not overcooked). ", "The jack and cojito cheese brought all the flavors together in a salty union (I love cheese. "], "author": "Vivian L.", "review": "I spent the afternoon wandering around Hayes street with a friend and meeting up with a Tinder date up on Market street. At this point, I'd walked ~4 miles and had been drinking teas/juices from the hottest of Asian tea stops in SF and I really, seriously needed to eat. \n\nFrom the outside, the restaurant didn't leave a huge impression. There was a small, narrow doorway with a little menu outside. However as soon as I stepped in, Silicon Valley modernism filled the view with shiny reflective glass windows, a barn-like wooden ceiling, and steely-looking furniture inside. I loved the modern, clean look it presented itself with and gladly sat myself down on the bar. \n\nOur waiter (wish I remembered his name) was a very friendly, heavily-accented charming man who was very patient with our indecision. In the end, I ordered the Esquite with black beans and corn. \n\nFood arrived in ~10 minutes. The presentation of the food was very lovely. My Esquite was in a small, shallow earthen-colored bowl. Flowers, green onions, and Cojito cheese were sprinkled on top of it. The dish itself was very homey and tasty; the corn was fresh/sweet and the beans perfectly soft (but not overcooked). The jack and cojito cheese brought all the flavors together in a salty union (I love cheese. If you don't like cheese or gooey cheesy things, I wouldn't recommend this dish). \n\nAll in all, would come back again.", "rating": 4, "date": "2014-07-23"}], "queso fundido chorizo or veggie": [], "oysters del dia": [], "tuna enchipotlado": [{"excerpts": ["I recommend the oysters, tuna enchipotlado, and the tacos. \n\n"], "author": "Felix C.", "review": "Great spot in Hayes Valley. \n\nI recommend the oysters, tuna enchipotlado, and the tacos. \n\nJust get a selection of plates and a beer. You can't go wrong.", "rating": 4, "date": "2016-07-23"}, {"excerpts": ["For appetizers, I love the corn esquites, the salsa trio, and the tuna enchipotlado (tuna tartare ceviche, basically) are my favorites. ", "For entrees, the chilaquiles, the enchiladas, and the (huge) quesadillas are all fantastic.  "], "author": "Christine E.", "review": "I love this place and have never been disappointed.  This isn't your hole-in-the-wall Mexican joint.  This isn't your basic over salted chain place either.  Coming from a coastal town in southern California that is known for it's fresh Mexican fare, I have struggled to find a San Francisco counterpart that could hold up to the incredible Mexican dishes that I enjoyed for so many years.\n\nThe hunt is over.  I have tried places all over this city and none of them have the culinary creativity, the fresh flavors, and the delicious drinks that pair so well with the menu items.  I am blown away.\n\nThere is so much to recommend.  For drinks, the blood orange margarita is fantastic. For appetizers, I love the corn esquites, the salsa trio, and the tuna enchipotlado (tuna tartare ceviche, basically) are my favorites. For entrees, the chilaquiles, the enchiladas, and the (huge) quesadillas are all fantastic.  The tacos are good; too, but not as remarkable as the other items (you can get a good taco at a lot of restaurants, but they don't all do enchilada carnitas like this!!).  \n\nThe service staff is very friendly and the atmosphere makes you feel like you are on vacation somewhere far away from a city like SF.  I highly recommend it!", "rating": 5, "date": "2015-05-21"}], "papito salad": [{"excerpts": ["This review is for the service and the Papito Salad.\n\n", "I have had only the Papito Salad with steak both times I've been here, and it is SO good. ", "I'm not sure what they put in it ", "and it's probably (definitely??) not healthy, but ", "I would eat it everyday if I could. ", "I don't eat very much food or very quickly but when I get this salad ", "I get a large one and I shovel it into my mouth. ", "CANNOT wait to go back and order it again!"], "author": "Jenny L.", "review": "This review is for the service and the Papito Salad.\n\nService 5/5\nIt was pretty packed inside on a Friday night and a server was coming in and out tending to different tables. There were groups of people outside waiting to be seated and yet he was still very attentive to my boyfriend and me. We were able to order our drinks while waiting outside and sat us at the bar/wall soon after. Super friendly throughout our entire meal. \n\nFood 5/5\nI have had only the Papito Salad with steak both times I've been here, and it is SO good. I'm not sure what they put in it and it's probably (definitely??) not healthy, but I would eat it everyday if I could. I don't eat very much food or very quickly but when I get this salad I get a large one and I shovel it into my mouth. CANNOT wait to go back and order it again!", "rating": 5, "date": "2017-12-06"}, {"excerpts": ["I usually get the Papito Salad with grilled shrimp and it's a nice,  healthy, filling lunch. ", "My coworkers and I also love the margaritas, they always have new flavors to try. ", "Ceviche is good, too!"], "author": "Tori M.", "review": "Love this place! One of the few places in Hayes Valley you can get a table for lunch for a good size group. The food is always delicious and comes out promptly. I usually get the Papito Salad with grilled shrimp and it's a nice,  healthy, filling lunch. My coworkers and I also love the margaritas, they always have new flavors to try. Ceviche is good, too!", "rating": 5, "date": "2018-03-09"}, {"excerpts": ["Papito salad with chicken, yes. \n", "And everything else, pleaseee! ", "xx"], "author": "Vicky M.", "review": "I'm here NOW and EVERY weekend. I love the place, I love the food & I LOVE the service. David, Raul and William know how to make customers regulars. \n\nI get by during the week by dreaming about their menu and reward myself by coming here Saturday or Sunday mornings (sometimes both). \n\nChips, guacamole and pico de gallo, duhh. \nPapito salad with chicken, yes. \nAnd everything else, pleaseee! xx", "rating": 5, "date": "2017-03-25"}, {"excerpts": ["I got the Papito Salad and added carnitas. ", "By doing that I saved $3 in extra lettuce and the meat/veggie ratio was spot on. ", "Lots of meat, not mostly salad. ", "The dressing was light and citrusy. ", "My boyfriend got the pozole and they brought this cute little side place with extra fixin's to season to your liking. "], "author": "Carol M.", "review": "Stopped by here on a weekday afternoon to grab a quick lunch. Everything = SO GOOD.\n\nI got the Papito Salad and added carnitas. By doing that I saved $3 in extra lettuce and the meat/veggie ratio was spot on. Lots of meat, not mostly salad. The dressing was light and citrusy. My boyfriend got the pozole and they brought this cute little side place with extra fixin's to season to your liking. The broth was delicious and it came out piping hot. \n\nI'd definitely be back! Others' meals around us looked delicious too.", "rating": 5, "date": "2015-08-29"}, {"excerpts": ["We ordered chicken mole enchiladas, an appetizer of beef meatballs/brussel sprouts and the papito salad. ", "Plenty of satisfying food for two, but the highlight was the margaritas - classic and blood orange with a chili salt rim. ", "Yummy all around. ", "There were no particular standout dishes and it was somewhat pricey for the simple ingredients in what we ordered - $35pp with one drink each. ", "A solid option for pre-symphony or pre-ballet dining in Hayes Valley (2 blocks from both venues)."], "author": "Annie M.", "review": "Lovely atmosphere -- pretty art, wooden beams, skylight and romatic lighting -- and satisfying food. Although it looked busy, we got seated right away. We ordered chicken mole enchiladas, an appetizer of beef meatballs/brussel sprouts and the papito salad. Plenty of satisfying food for two, but the highlight was the margaritas - classic and blood orange with a chili salt rim. Yummy all around. There were no particular standout dishes and it was somewhat pricey for the simple ingredients in what we ordered - $35pp with one drink each. A solid option for pre-symphony or pre-ballet dining in Hayes Valley (2 blocks from both venues).", "rating": 4, "date": "2015-01-01"}, {"excerpts": ["Loved their veggie enchilada and the papito salad!! ", "I am not a big fan of salads, but their papito salad is absolutely amazing!! ", "The service was pretty quick too!!"], "author": "Madhura D.", "review": "Loved their veggie enchilada and the papito salad!! I am not a big fan of salads, but their papito salad is absolutely amazing!! The service was pretty quick too!!", "rating": 5, "date": "2015-08-23"}], "jicama salad": [{"excerpts": ["I decided the $11 Jicama Salad would suit my appetite for a quick dinner. ", "It was a fresh mix of flavors that reminded me a bit of a mangonada - Mexican jicama, supremed orange slices, butternut squash, cantaloupe, sliced watermelon radish, and carrots doused in a subtle shallot vinaigrette. ", "Although a bit paltry, the $3.50 extra I paid for a quartet of grilled shrimp lent a nice beachy vibe to my salad (photo: http://bit.ly/29h7OuM). ", "Someday I'll come back for the tacos, enchiladas or quesadillas, but I'll have to convince Jamie that he won't be contaminated. ", "FOOD - 3 stars...a fresh jicama salad but a bit small for the price\nAMBIANCE - 3.5 stars...", "not as crowded as it usually is\nSERVICE - 3 stars...serviceable ", "I guess\n", "TOTAL - 3 stars...", "Mexican food reinvented for the smartphone set"], "author": "Ed U.", "review": "Y'know, I have yet to have a full-fledged meal here probably because it's always packed with the smartphone-addicted youth that characterize the short-term wealth found among the tech-heads who inhabit much of Hayes Valley. I can never convince Jamie W. to come here because one whiff of the Twitterati makes him convulse and go directly to the nearest Chipotle. At least that's what happened when I suggested we try it as I noticed a rare vacant table on a Thursday evening (photo: http://bit.ly/29vxFjq). Alas, we went our separate ways for a couple of hours since I wasn't in the mood for a carnitas burrito bowl and decided to be petulant about it. I deserve a good pout now and then.\n\nThe menu was pricey but rather pleasing, not a surprising combo given the penny-foolish clientele. I decided the $11 Jicama Salad would suit my appetite for a quick dinner. It was a fresh mix of flavors that reminded me a bit of a mangonada - Mexican jicama, supremed orange slices, butternut squash, cantaloupe, sliced watermelon radish, and carrots doused in a subtle shallot vinaigrette. Although a bit paltry, the $3.50 extra I paid for a quartet of grilled shrimp lent a nice beachy vibe to my salad (photo: http://bit.ly/29h7OuM). Someday I'll come back for the tacos, enchiladas or quesadillas, but I'll have to convince Jamie that he won't be contaminated. Twitteritis, y'know.\n\nFOOD - 3 stars...a fresh jicama salad but a bit small for the price\nAMBIANCE - 3.5 stars...not as crowded as it usually is\nSERVICE - 3 stars...serviceable I guess\nTOTAL - 3 stars...Mexican food reinvented for the smartphone set", "rating": 3, "date": "2016-07-05"}, {"excerpts": ["Jicama salad"], "author": "Kitty D.", "review": "Very centrally located in the Hayes Valley. Water was provided right away. Chips come with 3 salsas. Guam was freshly made with tomato and Cotija cheese. Jicama salad", "rating": 4, "date": "2017-02-12"}, {"excerpts": ["so we split the Jicama salad (great flavors - though I'd suggest adding mixed greens to it to make it a real salad instead of just shredded vegetables) and the vegetarian quesadilla which was really delicious. ", "Will be back to try more. ", "Highly recommend."], "author": "AJ W.", "review": "We were on Hayes intending to go to another restaurant down the road, but Papito looked so good that we stopped and decided to eat there instead. It did not disappoint. We weren't starving so we split the Jicama salad (great flavors - though I'd suggest adding mixed greens to it to make it a real salad instead of just shredded vegetables) and the vegetarian quesadilla which was really delicious. Will be back to try more. Highly recommend.", "rating": 5, "date": "2017-03-30"}, {"excerpts": ["The jicama salad was pasable. "], "author": "Carolina R.", "review": "Dinner was fairly good here as was the service. I got 4 tacos: al pastor, carnitas, carne asada, and carnitas de pato. All very good, moist, delicious meat, good amount, double corn tortilla. The jicama salad was pasable. Also got the esquite, which was alright but not made in the traditional way and definitely nothing to rave about. They put tomato and other stuff that takes from the flavor of the corn. The traditional esquite is served in a cup, with crema and Lemon. They had a pretty good wine selection and the space was very nice. I've had better Mexican food in SF, though.", "rating": 3, "date": "2015-11-20"}, {"excerpts": ["We paid a few dollars more to add duck to the jicama salad, and wow, it was like an entire entrée of Peking/mole/ragout duck on the side of the salad.  ", "Beer and wine selections were very good as well.  ", "Server Chelsea made the evening especially pleasant with her recommendations and accommodating our requests that some ingredients be served on the side."], "author": "Charles C.", "review": "We don't especially like Mexican food but they had a free table when other restaurants in Hayes Valley had waiting lists, so we gave Papito a chance.  So glad we did.  The meatball and Brussels sprout appetizer was fabulous. The entrée salads -- shrimp with frisee lettuce and house made cheese, and the jicama and carrot salad, were excellent as well.  We paid a few dollars more to add duck to the jicama salad, and wow, it was like an entire entrée of Peking/mole/ragout duck on the side of the salad.  Beer and wine selections were very good as well.  Server Chelsea made the evening especially pleasant with her recommendations and accommodating our requests that some ingredients be served on the side.", "rating": 4, "date": "2015-08-23"}, {"excerpts": ["Jicama salad was a wet mess.  ", "I would much rather eat at Tacolicious for this type of mexican food."], "author": "Neo M.", "review": "Nice job transforming the narrow space.  Good service.  Food was just ok.  Pineapple in dishes seems like a gimmick, not something that works out too well.  Beer battered cod taco was the best item.  Jicama salad was a wet mess.  I would much rather eat at Tacolicious for this type of mexican food.", "rating": 3, "date": "2014-10-02"}], "pozole rojo": [{"excerpts": ["Our group ended up sharing the shrimp enchiladas, mole con pollo enchiladas, and pozole rojo between 4 people. ", "For only 3 dishes between 4 people we were thinking it wouldn't be enough but the portions here are massive! ", "Each order of enchiladas came with 4 pieces  served over beans and rice. ", "Both types of enchiladas were delicious and were packed with flavor. ", "The pozole bowl is also bigger than your head so eating even half of the bowl made me stuffed. ", "They do you a favor and add some lime slices, onions, and additional seasoning on the side. ", "And of course we had to get dessert so the churros dipped in chocolate or whipped cream "], "author": "Keizzel C.", "review": "What's not to love about an establishment where the people behind the meal take the time to actually meet and greet those enjoying it? From the moment we walked in we were greeted by the awesome staff had our drinks brought straight to the table within 5 mins of meeting them. WOO blood orange margaritas!!\n\nOur group ended up sharing the shrimp enchiladas, mole con pollo enchiladas, and pozole rojo between 4 people. For only 3 dishes between 4 people we were thinking it wouldn't be enough but the portions here are massive! Each order of enchiladas came with 4 pieces  served over beans and rice. Both types of enchiladas were delicious and were packed with flavor. The pozole bowl is also bigger than your head so eating even half of the bowl made me stuffed. They do you a favor and add some lime slices, onions, and additional seasoning on the side. And of course we had to get dessert so the churros dipped in chocolate or whipped cream were a great way to end our meal. \n\nFYI: If you dine outside in the front of the restaurant they can't serve you alcohol \n\nPapito Hayes has a prime spot in the area so once you're done with your meal enjoy the other places nearby.", "rating": 4, "date": "2018-05-22"}, {"excerpts": ["Or pozole rojo. ", "Dumped all the chili and chopped onions into the bowl, and squeezed the lime's last drop of juice. ", "Soup was incredibly spicy, perfect for a cold evening. ", "Crudo was amazing, actually, with black sesame seeds, jicama and avocado mouse. ", "Interesting presentation. ", "Strawberry with blood orange margarita was too blood orangy ", "but if you like that citrus, you are all set. ", "Asada enchiladas for my companion who clearly was not wiling to share. "], "author": "Victoria E.", "review": "Two Sisters was closed for a private event. I was out last night late for Dia de los Muertos and every single taqueria was a zoo, including La Taqueria. I was therefore deprived of Mexican food. Strangely, today's catered lunch at work was fajitas, but seeing that that was aimed to white fin tech valley people, it was blend. I wanted something more than that tonight. \n\nI could swear that I'd eaten at Papito in Potrero because the restaurant sounded familiar, so I showed up here already knowing what to order. Soup. Or pozole rojo. Dumped all the chili and chopped onions into the bowl, and squeezed the lime's last drop of juice. Soup was incredibly spicy, perfect for a cold evening. Crudo was amazing, actually, with black sesame seeds, jicama and avocado mouse. Interesting presentation. Strawberry with blood orange margarita was too blood orangy but if you like that citrus, you are all set. Asada enchiladas for my companion who clearly was not wiling to share. Whatever. \n\nSeason ticket holder to City Arts and Lectures at the Nourse means that I have become very good friends with restaurants in Hayes Valley. Have become slightly bored of Rich Table, Chez Maman, Plaj, Suppenkuche, Lers Ros, Mazzat, Jardiniere, Monsieur Bejamin, Grove, Absinthe, Sauce, or Souvla, my choices have become rather slim. \n\nWhen evaluating restaurants that are highly regarded by most people in the city who would like to dine out in Hayes Valley, think the following:\n\n1. Is it cold outside?\n2. Did you not able to get into another Mexican restaurant?\n3. Do you like good quality organic Mexican food?\n4. Can you get a table and be done eating in 40 minutes?\n5. Not willing to fork over $100+ on a meal in Hayes Valley tonight?\n\nIf yes, come here. \n\nI sure will.", "rating": 4, "date": "2014-11-04"}, {"excerpts": ["Pozole Rojo was amazing, spicey, but delicious. ", "Ask for crema on the side. ", "gigantic portion and so delicious", ", I would come back, but I live in NY"], "author": "Ivy A.", "review": "Pozole Rojo was amazing, spicey, but delicious. Ask for crema on the side. gigantic portion and so delicious, I would come back, but I live in NY", "rating": 5, "date": "2015-07-09"}], "mole con pollo": [{"excerpts": ["Our group ended up sharing the shrimp enchiladas, mole con pollo enchiladas, and pozole rojo between 4 people. ", "For only 3 dishes between 4 people we were thinking it wouldn't be enough but the portions here are massive! ", "Each order of enchiladas came with 4 pieces  served over beans and rice. ", "Both types of enchiladas were delicious and were packed with flavor. ", "The pozole bowl is also bigger than your head so eating even half of the bowl made me stuffed. ", "They do you a favor and add some lime slices, onions, and additional seasoning on the side. ", "And of course we had to get dessert so the churros dipped in chocolate or whipped cream "], "author": "Keizzel C.", "review": "What's not to love about an establishment where the people behind the meal take the time to actually meet and greet those enjoying it? From the moment we walked in we were greeted by the awesome staff had our drinks brought straight to the table within 5 mins of meeting them. WOO blood orange margaritas!!\n\nOur group ended up sharing the shrimp enchiladas, mole con pollo enchiladas, and pozole rojo between 4 people. For only 3 dishes between 4 people we were thinking it wouldn't be enough but the portions here are massive! Each order of enchiladas came with 4 pieces  served over beans and rice. Both types of enchiladas were delicious and were packed with flavor. The pozole bowl is also bigger than your head so eating even half of the bowl made me stuffed. They do you a favor and add some lime slices, onions, and additional seasoning on the side. And of course we had to get dessert so the churros dipped in chocolate or whipped cream were a great way to end our meal. \n\nFYI: If you dine outside in the front of the restaurant they can't serve you alcohol \n\nPapito Hayes has a prime spot in the area so once you're done with your meal enjoy the other places nearby.", "rating": 4, "date": "2018-05-22"}, {"excerpts": ["However the mole con pollo quesadilla is a little on the bitter side. \n", "The place is little get pretty crowded ", "but it is good for a quick lunch."], "author": "Marina S.", "review": "Lovely mexican restaurant. Good fresh ceviche and tacos. \norange margarita and spicy Bloody Mary are tasty. \nHome made guacamole is awesome and so was the shrimp salad. However the mole con pollo quesadilla is a little on the bitter side. \nThe place is little get pretty crowded but it is good for a quick lunch.", "rating": 4, "date": "2016-10-04"}, {"excerpts": ["We ordered the chips and salsa, mole con pollo enchiladas, and 4 tacos(fried chicken, carnitas, carne asada, and cod). ", "The salsa verde was really good, the salsa rojo was too tomatoey for my taste, and the mango salsa tasted great but was very thin with no pieces on actual mango in it. ", "The chicken enchiladas were wonderful! ", "Just the right amount of spice. ", "All of the tacos were great but the cod and fried chicken were my favorite. ", "This place has met the balance between a fancy restaurant and a cute little taqueria. ", "I'd love to come back and try some more menu items!"], "author": "Amy S.", "review": "I tried this place for the first time tonight and was pleasantly surprised! It's an adorable little restaurant. We were seated immediately at the bar and had prompt service from the staff. We ordered the chips and salsa, mole con pollo enchiladas, and 4 tacos(fried chicken, carnitas, carne asada, and cod). The salsa verde was really good, the salsa rojo was too tomatoey for my taste, and the mango salsa tasted great but was very thin with no pieces on actual mango in it. The chicken enchiladas were wonderful! Just the right amount of spice. All of the tacos were great but the cod and fried chicken were my favorite. This place has met the balance between a fancy restaurant and a cute little taqueria. I'd love to come back and try some more menu items!", "rating": 4, "date": "2016-12-28"}], "el vegetariano": [{"excerpts": ["I ordered the \"el vegetariano\" tacos which were supposed to have crispy tofu, wild mushrooms, poblano peppers rajas, corn & salsa verde (skipped the cheese to make it vegan) but it was so lousy I could barely eat it.\n\n"], "author": "MJ S.", "review": "What an epic let down.\n\nI got the 2 tacos for $9 (already pricy but I can justify it if they are good)\n\nI ordered the \"el vegetariano\" tacos which were supposed to have crispy tofu, wild mushrooms, poblano peppers rajas, corn & salsa verde (skipped the cheese to make it vegan) but it was so lousy I could barely eat it.\n\nThe tofu was not crispy, not seasoned or even marinated at all.\n\nLook, I get that restaurants sell more meats and seafoods and non-vegan items but if you're going to offer a veggie option at least give it half the attention meat items would get.\n\nThe tacos were cold by the time I got them and the unmarinated tofu, unseasoned mushrooms and corn.\n\nOn the plus side, salsa was good, service was great!\n\nProbably just not a good place for vegans and vegetarians.\n\nWon't return.", "rating": 1, "date": "2014-06-26"}], "papa con chorizo": [], "camaron costeno": [{"excerpts": ["Vegetariano tacos (roasted corn, cauliflower, pasilla peppers, wild mushrooms, orange oaxaca sauce & cheese) + camaron costeno taco: sauteed shrimp, garlic, chile de arbol sauce, avocado, cilantro, red onions &a apple mango pico de gallo, are going to be hard to beat. ", "Like, I'd suit up right now and go back for a bite right now if I thought they'd still be open."], "author": "Candice G.", "review": "I eat tacos every.damn.day so it's rare that I'll go somewhere and pay $4 for a fairly small taco, but for realzies, these tacos are worth it and then some. Or at least the two types of tacos and burrito I tried were.\n\nI didn't get the blood orange margarita but one of my friends did and it was the star beverage for sure. It was the least sweet margarita I've ever had and was dangerously drinkable. I got a quality beer that was budget-friendly at $4 (despite its high caliber craft status). \n\nService was spectacular and I like that the place offers really comfortable seating with plenty of space for your table mates (despite not being very large overall).  \n\nMy dining partners and I split the chips, salsa, and guacamole and while all good, the entrees are where Papito West stole the show. \n\nThat sauteed shrimp burrito +  Vegetariano tacos (roasted corn, cauliflower, pasilla peppers, wild mushrooms, orange oaxaca sauce & cheese) + camaron costeno taco: sauteed shrimp, garlic, chile de arbol sauce, avocado, cilantro, red onions &a apple mango pico de gallo, are going to be hard to beat. Like, I'd suit up right now and go back for a bite right now if I thought they'd still be open.", "rating": 4, "date": "2015-01-07"}], "champinones": [], "carnitas de pato": [{"excerpts": ["I got 4 tacos: al pastor, carnitas, carne asada, and carnitas de pato. ", "All very good, moist, delicious meat, good amount, double corn tortilla. "], "author": "Carolina R.", "review": "Dinner was fairly good here as was the service. I got 4 tacos: al pastor, carnitas, carne asada, and carnitas de pato. All very good, moist, delicious meat, good amount, double corn tortilla. The jicama salad was pasable. Also got the esquite, which was alright but not made in the traditional way and definitely nothing to rave about. They put tomato and other stuff that takes from the flavor of the corn. The traditional esquite is served in a cup, with crema and Lemon. They had a pretty good wine selection and the space was very nice. I've had better Mexican food in SF, though.", "rating": 3, "date": "2015-11-20"}], "bajataco": []}