{"antipasto della casa": [], "mixed green": [{"excerpts": ["The mixed green salad is always really fresh...definitely recommend if ordering to go as the Sloat location is rather small for dining in."], "author": "Meghan L.", "review": "My go to delivery pizza! Very quick and convenient and super delicious! The mixed green salad is always really fresh...definitely recommend if ordering to go as the Sloat location is rather small for dining in.", "rating": 5, "date": "2018-08-03"}], "sliced tomatoes anchovies and onions": [], "meat eater": [{"excerpts": ["Their piping hot pizza was delicious, and I would recommend their house special and meat eater pizzas. ", "I wasn't entirely thrilled with the chicken pizza as the tomato base was yummy but the chicken itself was almost so dry it was like jerky. ", "Per the other reviewers, I wouldn't eat here on site, since the dining space is so tiny and there is no ambiance to speak of. ", "Overall, a good solid pizza joint if you stick with the staples."], "author": "Rebecca C.", "review": "I was despairing that the way of the pizza was going down the ultr-chunky crust, soggy cheese route until we decided to revisit Pasquale's in the Sunset. Their piping hot pizza was delicious, and I would recommend their house special and meat eater pizzas. I wasn't entirely thrilled with the chicken pizza as the tomato base was yummy but the chicken itself was almost so dry it was like jerky. Per the other reviewers, I wouldn't eat here on site, since the dining space is so tiny and there is no ambiance to speak of. Overall, a good solid pizza joint if you stick with the staples.", "rating": 3, "date": "2007-01-13"}], "house special": [{"excerpts": ["We ordered the House Special.  ", "Loved the fact that it was old world itilian thin crust. ", "Crispy, firm slices, and loaded with toppings. "], "author": "Ashley W.", "review": "We came to stay in San Francisco to go to the zoo. \nThis pizza place is right next door to the hotel we are staying at. \n\nAt first we were turned off because they didnt have multiple items on the menu that we were ordering. So, we just decided to grab a pizza and a meatball sandwich. \n\nThe meatball sandwich was phenom!!! Piping hot and the perfect amounts of sauce, cheese and meatballs. \n\nThe pizza was fabulous! We ordered the House Special.  Loved the fact that it was old world itilian thin crust. Crispy, firm slices, and loaded with toppings. Comes with cheese, pepperoni,  salami, and white mushrooms.  Not so loaded down that the pizza sagged. It was perfect.\n\nI would recommend as long as you ask what they have  available for the day  first.", "rating": 4, "date": "2018-06-15"}, {"excerpts": ["The best one that I have grown up eating is the House Special. ", "Seriously, I have gone to the one in Irving and chatted with the chefs at a young age while eating the mots that they gave me :D! \n", "my fondest memories of my family was getting this pizza and going to the beach to gobble it all up!!"], "author": "Rhoda May C.", "review": "My favorite pizza ever. I have been to Chicago, I have had Quad Cities' Taco Pizza. This is my number one place for pizza IN San Francisco. \nI wish I can come here all the time!\nThe best one that I have grown up eating is the House Special. Seriously, I have gone to the one in Irving and chatted with the chefs at a young age while eating the mots that they gave me :D! \nmy fondest memories of my family was getting this pizza and going to the beach to gobble it all up!!", "rating": 5, "date": "2015-08-09"}, {"excerpts": ["XL House Special with garlic and extra mushrooms. ", "My favorite of all time. ", "I can't get enough of this."], "author": "Rachel A.", "review": "XL House Special with garlic and extra mushrooms. My favorite of all time. I can't get enough of this.", "rating": 5, "date": "2015-05-11"}, {"excerpts": ["So the best thing about Pasquale's is the House Special.  ", "After all, in a place like this that's really all that matters."], "author": "Joc V.", "review": "The Pasquale's on Sloat is about as far as you can get to the edge of the city without getting sand in your shoes.  There is no ambiance, don't even think of putting your elbows on that sticky table top--you may never get out.  Definitely take-out; better yet, they only charge $1 for delivery (at least to Daly City).  So the best thing about Pasquale's is the House Special.  After all, in a place like this that's really all that matters.", "rating": 3, "date": "2005-09-27"}, {"excerpts": ["Their piping hot pizza was delicious, and I would recommend their house special and meat eater pizzas. ", "I wasn't entirely thrilled with the chicken pizza as the tomato base was yummy but the chicken itself was almost so dry it was like jerky. ", "Per the other reviewers, I wouldn't eat here on site, since the dining space is so tiny and there is no ambiance to speak of. ", "Overall, a good solid pizza joint if you stick with the staples."], "author": "Rebecca C.", "review": "I was despairing that the way of the pizza was going down the ultr-chunky crust, soggy cheese route until we decided to revisit Pasquale's in the Sunset. Their piping hot pizza was delicious, and I would recommend their house special and meat eater pizzas. I wasn't entirely thrilled with the chicken pizza as the tomato base was yummy but the chicken itself was almost so dry it was like jerky. Per the other reviewers, I wouldn't eat here on site, since the dining space is so tiny and there is no ambiance to speak of. Overall, a good solid pizza joint if you stick with the staples.", "rating": 3, "date": "2007-01-13"}], "mediterranean": [{"excerpts": ["Had a feta and garlic and a Mediterranean.  ", "Family has a new pizza place!"], "author": "Barb L.", "review": "I used to get the pizza at USF when I was a student.   That location burnt down.  Tried the one on Sloat.  Very good.  Had a feta and garlic and a Mediterranean.  Family has a new pizza place!", "rating": 5, "date": "2017-08-29"}], "charbroiled chicken": [{"excerpts": ["especially if you get the charbroiled chicken special!!!  ", "definitely call in your order, they get busy and there isn't a whole lot of seating inside."], "author": "Jen D.", "review": "i fucking love pizza.  how could anyone not love greasy, cheesy goodness?!  pasquales has a great crust--not too thick and not so thin that it tastes like a cracker.  Their red sauce is great, but get pesto instead!  especially if you get the charbroiled chicken special!!!  definitely call in your order, they get busy and there isn't a whole lot of seating inside.", "rating": 5, "date": "2013-11-04"}], "cheese and tomato sauce": [], "one item": [], "two items": [], "three items": [], "four items": [], "any addition add per item": [], "seafood items": [], "vegetarian items": [], "meat items": [], "spaghetti with meat sauce": [{"excerpts": ["My friend ordered the spaghetti with meat sauce pasta ($8.15) and I had the Beat ball sandwich ($6.80). "], "author": "Gen M.", "review": "Came here with my friends after we walked to the beach for dinner. Right next door to Java house and across the street from the San Francisco Zoo. My friend wanted to eat here cause his old co-worker works here now and wanted to check it out. \n\nSmall cozy place. My friend ordered the spaghetti with meat sauce pasta ($8.15) and I had the Beat ball sandwich ($6.80). They are probably known for their pizza's, but we didn't really feel like eating pizza. \n\nI would say they took there time cause I had to wait a while for a meat ball sandwich. I mean, how hard is it to make a meat ball sandwich?", "rating": 2, "date": "2013-02-21"}], "spaghetti with meat balls": [], "spaghetti with italian sausage": [], "half spaghetti with meat sauce": [], "half spaghetti half ravioli": [], "ravioli with meat sauce": [], "ravioli with meat balls": [], "baked ravioli with mozzarella": [], "baked stuffed meat lasagna": [], "ham": [{"excerpts": ["Ham & pineapple is my second favorite.\n\n"], "author": "Liz S.", "review": "It's more like 3.35 stars. \n\nWe order from Pasquale's on Sloat because it's the best pizza in our delivery area.   At any given time there will be a Pasquale's box in our recycling.\n\nCheese pizza is the best - the crust has a good texture (not too chewy, not too crisp), the cheese is generous, the sauce is ok but a little bit acidic for me (slight tinny flavor).\n\nHam & pineapple is my second favorite.\n\nThe delivery people are very very very nice and the pizza usually arrives quickly.", "rating": 3, "date": "2006-07-29"}], "salami": [{"excerpts": ["Comes with cheese, pepperoni,  salami, and white mushrooms.  ", "Not so loaded down that the pizza sagged. "], "author": "Ashley W.", "review": "We came to stay in San Francisco to go to the zoo. \nThis pizza place is right next door to the hotel we are staying at. \n\nAt first we were turned off because they didnt have multiple items on the menu that we were ordering. So, we just decided to grab a pizza and a meatball sandwich. \n\nThe meatball sandwich was phenom!!! Piping hot and the perfect amounts of sauce, cheese and meatballs. \n\nThe pizza was fabulous! We ordered the House Special.  Loved the fact that it was old world itilian thin crust. Crispy, firm slices, and loaded with toppings. Comes with cheese, pepperoni,  salami, and white mushrooms.  Not so loaded down that the pizza sagged. It was perfect.\n\nI would recommend as long as you ask what they have  available for the day  first.", "rating": 4, "date": "2018-06-15"}, {"excerpts": [", I ordered a pizza from Sloat; clearly asked for a medium pizza with salami on the whole pizza and mushrooms on half of it and got a cheese pizza with mushrooms on one half which just didn't do it for me. ", "I called to complain and the scuzbag who answered the phone said \"I can give you back a dollar for one ingredient; I should have argued to make me a whole new pizza or reimburse me for half but was young and just said ", "\"well okay I guess\" the guy I had tipped a dollar", "; that's how much you tipped back then, showed up to my door looking like he wanted to rip my head off! and handed me a dollar! ", "I know that the loser cook or manager told the kid that I wanted my tip back! ", "That never sat well with me as not only did the cook on the phone screw up my order and ruined my pizza and then only offered a dollar back, but also told the poor delivery boy to drive way out of his way because I wanted my tip back! "], "author": "David A.", "review": "Wow! Pasquale's on Sloat has been going down hill for decades but have now really hit rock bottom! Absolutely disgusting nearly inedible swirl/slop at this point! I have been dining and ordering from various Pasquale's my entire 48 year life and have been frequenting Pasquale's with my family since before I can even remember, but there is a huge difference between the two remaining restaurants, the main one on Irving and this dive spot on Sloat. \n\nI recently had a birthday and turned 48 and it was the first birthday in my life when I didn't at least meet up with family or friends on my special day, so feeling pretty bummed out that I had absolutely no plans for lunch, brunch or dinner on my actual birthday, decided to treat myself to some comfort food by myself. Called in to order a small two topping pizza for pickup; I save about 5 or 6 bucks on delivery fee and tip by driving about a mile away so I opted to call in my order and pick it up; to which I was told \"20 minutes.\" \n\nI showed up exactly 20 minutes later and my pizza wasn't ready. Big mistake on their behalf, because it gave me time to just stand there, look around and realize just how dirty, rundown and grimy this shack is. I never noticed how poor the integrity of the tiny building that looks like it could be brought down by one pass of a bulldozer is. pacing around for 10 minutes waiting for my pizza and looking around at nothing to really look at, what immediately stood out to me is that there were flies EVERYWHERE!!! The ingredients were uncovered and the two guys there didn't give half a crap. They were flying around the air and crawling over food behind  the counter; just gross! The place just looked gross and made me wonder about other times I had ordered from here and felt sick in the past. \n\nThe two guys working that night looked like they were somewhere between 18 and 20 and had no clue of how to make pizza! Making good pizza is actually an art with a science to it and requires some degree of taught skill. kneading the dough, tossing the dough, adding the right amount of olive oil, distributing the ingredients and cooking and toasting the pizza is all part of the process of making a good pizza. These guys just throw everything on the thick dough with no thought or skill to it at all, cook your pizza and put it in a b ox. It also smelled bad in the restaurant while I waited for ten minutes and on the way home the pizza actually smelled bad and I dreaded eating it, instead of when I used to bring a pizza from Pasquale's home, smelling the tempting aroma from the olive oil and other ingredients, just disgusted me. I almost wanted to throw it out, but I never waste money and hoped that it would taste good. .. Nope! tasted awful as well and just put the finishing insult to injury on one of my worst birthdays to date. \n\nI have never written or talked about this and this was long before Yelp and it's most likely under different management and staff but 25-30 years ago, I ordered a pizza from Sloat; clearly asked for a medium pizza with salami on the whole pizza and mushrooms on half of it and got a cheese pizza with mushrooms on one half which just didn't do it for me. I called to complain and the scuzbag who answered the phone said \"I can give you back a dollar for one ingredient; I should have argued to make me a whole new pizza or reimburse me for half but was young and just said \"well okay I guess\" the guy I had tipped a dollar; that's how much you tipped back then, showed up to my door looking like he wanted to rip my head off! and handed me a dollar! I know that the loser cook or manager told the kid that I wanted my tip back! That never sat well with me as not only did the cook on the phone screw up my order and ruined my pizza and then only offered a dollar back, but also told the poor delivery boy to drive way out of his way because I wanted my tip back! What a POS that guy was, back then. \n\nAnyway, I will never under any circumstances ever come back or order from Pasquale's on Sloat again. Pasquale's on Irving has also declined a bit but is a million times better than the one on Sloat. Never again on Sloat, never again.", "rating": 1, "date": "2017-08-18"}, {"excerpts": ["Sausage, salami, olive, and mushroom."], "author": "A B.", "review": "I love this pizza spot, been going here since '87. Sausage, salami, olive, and mushroom.", "rating": 4, "date": "2017-11-25"}, {"excerpts": ["I ended up getting a salami sub. ", "While we were waiting at the table they turned off some of the lights in the restaurant. ", "In took about 25-30 minutes for a sub and salad. ", "We were listening to one of the cooks and the girl at the register bicker about some personal issues they were having... ", "Awkward!"], "author": "Hector V.", "review": "They close at 10 pm. We came in at about 9:05 much to the displeasure of the girl at the register. They were already cleaning up the joint. We asked if they were closed and she said they were only doing to go orders. My fiancé ordered a salad and I asked for a meatball sub but they didn't have meatballs. I didn't want to be a jerk and order a pizza but I should have.  I ended up getting a salami sub. While we were waiting at the table they turned off some of the lights in the restaurant. In took about 25-30 minutes for a sub and salad. We were listening to one of the cooks and the girl at the register bicker about some personal issues they were having... Awkward!", "rating": 2, "date": "2013-05-10"}], "ham and cheese melt": [], "salami and cheese melt": [], "meat ball": [{"excerpts": ["cause I had to wait a while for a meat ball sandwich. ", "I mean, how hard is it to make a meat ball sandwich?"], "author": "Gen M.", "review": "Came here with my friends after we walked to the beach for dinner. Right next door to Java house and across the street from the San Francisco Zoo. My friend wanted to eat here cause his old co-worker works here now and wanted to check it out. \n\nSmall cozy place. My friend ordered the spaghetti with meat sauce pasta ($8.15) and I had the Beat ball sandwich ($6.80). They are probably known for their pizza's, but we didn't really feel like eating pizza. \n\nI would say they took there time cause I had to wait a while for a meat ball sandwich. I mean, how hard is it to make a meat ball sandwich?", "rating": 2, "date": "2013-02-21"}], "italian sausage": [{"excerpts": ["Unfortunately, the 6th topping  happened to be Italian sausage that was pretty under cooked so that there was pink coloring on the larger pieces.  ", "My family doesn't like sausage on pizza and the added hazard of uncooked pork didn't increase their excitement.  \n\n", "I did take pictures of the under cooked sausage in case there's any trouble for my family collecting the insurance should I die from the bad pork."], "author": "Roland C.", "review": "In this day and age, it isn't hard to make a decent pizza.  With the advent of the recipes online, direct customer feedback, and sampling the competition, there's really no excuse for having a bad pizza.  This place can't even make a pizza that's mediocre much less good.  \n\nFirst of all, the place had 3 tables and 8 chairs.  Do the math and you realize that some casual lap dancing might be required if you plan to dine.  This may be a plus on dates but not so great for other occasions.  \n\nI ordered a pizza with 5 toppings and it came with 6.  We didn't want to wait another 15-20 mins and we were hungry after a long day at the zoo so we just took the pizza and removed the 6th topping.  Unfortunately, the 6th topping  happened to be Italian sausage that was pretty under cooked so that there was pink coloring on the larger pieces.  My family doesn't like sausage on pizza and the added hazard of uncooked pork didn't increase their excitement.  \n\nAll this was bad enough but the pizza itself isn't very good.  Not enough sauce and seasoning so it just tasted like sauteed veggies and half cooked meat on toast with cheese.  \n\nI should have asked for a refund but I was already tired, annoyed and my family wasn't going to put up with me arguing with the pizza place for another 10 mins.  I did point out the 6th topping, that it was undercooked, etc.  They didn't care and only offered to remove the topping which I just did myself since I didn't trust what else they might do with the pizza.  I guess the free glass of Sprite they gave me was  their compensation plan.  \n\nI decided to cut my losses and just threw the pizza out after everyone had a slice.  I did take pictures of the under cooked sausage in case there's any trouble for my family collecting the insurance should I die from the bad pork.", "rating": 1, "date": "2015-03-08"}, {"excerpts": ["They use real italian sausage here. ", "The crust is ok. ", "Tip the pizza maker a couple bucks and your pizza will be covered in the toppings you want, you won't be able to see the cheese underneath. ", "Pasquale's Pizza in my house never lasts longer than the next day. ", "Don't expect to dine into this place though, they have 3 small tables and it is quite boring inside unless you love watching pizzas being made."], "author": "D J.", "review": "My favorite pizzeria in San Francisco. What makes this pizza great is its toppings. My favorite is pepperoni, mushroom and sausage. They use real italian sausage here. The crust is ok. Tip the pizza maker a couple bucks and your pizza will be covered in the toppings you want, you won't be able to see the cheese underneath. Pasquale's Pizza in my house never lasts longer than the next day. Don't expect to dine into this place though, they have 3 small tables and it is quite boring inside unless you love watching pizzas being made.", "rating": 5, "date": "2007-01-04"}], "meat balls": [], "sausage": [{"excerpts": ["The sausage goes on raw and is just super fresh. ", "Nicely laid out on a layer of sliced mozzarella. ", "Each bite was incredibly juicy and the crust was awesome. ", "When I come back, I'm definitely gonna dive into some seafood pizza. "], "author": "Mark F.", "review": "This place is legit. I usually don't review a place until I've been there a few times, but this was definitely worthy of some kind words. \n\nHad a long day of walking around the zoo with my daughter and this place is conveniently located across the street. There are only 3 tables in the tiny dining room, but there's a cool outdoor counter along the window ledge outside. It's also really warm in there, but that wasn't gonna stop us. The sausage goes on raw and is just super fresh. Nicely laid out on a layer of sliced mozzarella. Each bite was incredibly juicy and the crust was awesome. When I come back, I'm definitely gonna dive into some seafood pizza. Can't wait to try those clams. \n\nGreat job guys, I'll see you next time", "rating": 4, "date": "2018-09-30"}, {"excerpts": ["Sausage, salami, olive, and mushroom."], "author": "A B.", "review": "I love this pizza spot, been going here since '87. Sausage, salami, olive, and mushroom.", "rating": 4, "date": "2017-11-25"}, {"excerpts": ["I love thick crust and garlic, so we get that on every pizza, whether that be garlic/pepperoni or garlic/sausage. ", "Aaron and Mario are awesome! ", ":) ", "They usually finish the pizza before the time they estimate too."], "author": "Erika C.", "review": "When I get out of work late and it's too late to cook, I can always count on these guys to make our favorite pizza! I live close by, so it's most convenient to drive by and pick up my order on the way home. I love thick crust and garlic, so we get that on every pizza, whether that be garlic/pepperoni or garlic/sausage. Aaron and Mario are awesome! :) They usually finish the pizza before the time they estimate too.", "rating": 5, "date": "2017-02-23"}, {"excerpts": ["Unfortunately, the 6th topping  happened to be Italian sausage that was pretty under cooked so that there was pink coloring on the larger pieces.  ", "My family doesn't like sausage on pizza and the added hazard of uncooked pork didn't increase their excitement.  \n\n", "I did take pictures of the under cooked sausage in case there's any trouble for my family collecting the insurance should I die from the bad pork."], "author": "Roland C.", "review": "In this day and age, it isn't hard to make a decent pizza.  With the advent of the recipes online, direct customer feedback, and sampling the competition, there's really no excuse for having a bad pizza.  This place can't even make a pizza that's mediocre much less good.  \n\nFirst of all, the place had 3 tables and 8 chairs.  Do the math and you realize that some casual lap dancing might be required if you plan to dine.  This may be a plus on dates but not so great for other occasions.  \n\nI ordered a pizza with 5 toppings and it came with 6.  We didn't want to wait another 15-20 mins and we were hungry after a long day at the zoo so we just took the pizza and removed the 6th topping.  Unfortunately, the 6th topping  happened to be Italian sausage that was pretty under cooked so that there was pink coloring on the larger pieces.  My family doesn't like sausage on pizza and the added hazard of uncooked pork didn't increase their excitement.  \n\nAll this was bad enough but the pizza itself isn't very good.  Not enough sauce and seasoning so it just tasted like sauteed veggies and half cooked meat on toast with cheese.  \n\nI should have asked for a refund but I was already tired, annoyed and my family wasn't going to put up with me arguing with the pizza place for another 10 mins.  I did point out the 6th topping, that it was undercooked, etc.  They didn't care and only offered to remove the topping which I just did myself since I didn't trust what else they might do with the pizza.  I guess the free glass of Sprite they gave me was  their compensation plan.  \n\nI decided to cut my losses and just threw the pizza out after everyone had a slice.  I did take pictures of the under cooked sausage in case there's any trouble for my family collecting the insurance should I die from the bad pork.", "rating": 1, "date": "2015-03-08"}, {"excerpts": ["first time no chicken, ordered some mushroom sausage pizza...thought we asked for pesto but got red sauce...\n\n", "second time no chicken again, so got sausage, EMPHASIZED the pesto...and got it, "], "author": "Christine M.", "review": "how are they always out of chicken!?!?\n\nWe heard that the charboiled chicken special was really good with pesto sauce.\n\nSo we tried to order it...3 times now....\n\nfirst time no chicken, ordered some mushroom sausage pizza...thought we asked for pesto but got red sauce...\n\nsecond time no chicken again, so got sausage, EMPHASIZED the pesto...and got it, yummy also.\n\nthird time was the charm i think? got the chicken special pesto...but think we like the red sauce more....\n\ngood pizza, small, kind of expensive....always no chicken....", "rating": 3, "date": "2014-12-23"}, {"excerpts": ["Sausage. \n", "ONLY ONE DOWNSIDE.\n"], "author": "Mike L.", "review": "Love the pizza here! \ni usually get the Mushroom.Sausage. \nONLY ONE DOWNSIDE.\nthe bottom tends to get soggy sometimes so prepare to have broken pizza, still taste amazing though. \n\nOne tip to reheating pizza. i get a shallow pan and get a lid to cover the pizza completely so it can get crispy while getting the cheese melty! try it out!", "rating": 4, "date": "2012-07-23"}, {"excerpts": ["We had a customized pizza with sausage, mushrooms, bell peppers, and pesto sauce. "], "author": "Jonathan L.", "review": "Nice pizza shop in a great location! While it is more ideal for take out, my friends and I decided to have a sit down meal here. It's pretty cramp but for just the three of us, it was fine. The people are very nice and we could watch them flipping dough and making our pizza right in front of us.\n\nWe had a customized pizza with sausage, mushrooms, bell peppers, and pesto sauce. It was pretty well made and tasted fine. \n\nhttp://www.yelp.com/user_local_photos?userid=z-hwsFeY66kqMVTMCp9w-A&select=QDSv-F-4EKhDG0PlXgthbw\n\nI'd definitely come here again most likely ordering to go.  \n\n4 stars.", "rating": 4, "date": "2010-09-21"}, {"excerpts": ["We had a 4 item pizza garlic, bell pepper, sausage and mushroom. ", "Medium\nOMG! ", "Orgasmic good!!! ", "It was heaven. ", "I'm not sure if I have EVER had such a good pizza! ", "The sausage was real sausage and not those balls. ", "The garlic -YUM!!! ", "crushed and aplenty!!!!! ", "The cheese (a given and not counted as an item) was bologna sized and at least as thick! "], "author": "Veronica L.", "review": "I am thoroughly rating on experience and flavor.\n\n We just went this past Sunday.....It was about 5pm Sept. 22nd, the weather was nice for San Fran. The place could of been swarming packed, given it's close proximity to the zoo, but it wasn't. WARNING: VERY LIMITED SEATING INSIDE. Standing counter space outside.\n\nWe had a 4 item pizza garlic, bell pepper, sausage and mushroom. Medium\nOMG! Orgasmic good!!! It was heaven. I'm not sure if I have EVER had such a good pizza! On one hand it WAS Pricey compared with Round Table, but the quality and quantity of the ingredients was VERY DIFFERENT, so there was no comparison.\n\nWe got to watch these guys HAND THROW THE PIZZA CRUST! The sausage was real sausage and not those balls. The garlic -YUM!!! crushed and aplenty!!!!! The cheese (a given and not counted as an item) was bologna sized and at least as thick! The mushroom didn't turn into little curls in the oven.\n\nYes, it could of been easier to each if the pizza was in smaller pieces. I used my plastic fork under the piece to get it to my mouth. The SMELL OF GARLIC WAS HEAVENLY!\nWe paid $19.30 and in hind site maybe should of picked the 4 meat or Vegetarian, but didn't know the quality factor = quantity of ingredients would be as such. \n\nThe bathroom was clean and decent, not the squalid, dirty place I had expected from the outside at all.\n\nThis place counts as Pasqualie's #2\nDid I mention how QUICK our order came up?? For fresh? It doesn't get any better than this! Awesome.\nWill we go back! Heck yes!!", "rating": 5, "date": "2013-09-25"}, {"excerpts": ["I always order a sausage/mushroom combination.  ", "What make me love this pizza so much is their sauce.  ", "You can taste a hint of wine and it just hits the spot.  ", "One of my all-time favorites!!"], "author": "Alvin J.", "review": "We used to order from the old Fulton Street location 25 years ago.  Great memories of days past.  This particular spot on Sloat is my absolute favorite.  It's very small and rundown looking with just a few tables.  Nothing beats ordering fresh from the counter and eating in.  I always order a sausage/mushroom combination.  What make me love this pizza so much is their sauce.  You can taste a hint of wine and it just hits the spot.  One of my all-time favorites!!", "rating": 5, "date": "2012-08-25"}, {"excerpts": ["Ordered sausage, onion and mushroom. ", "The sauce is really good, you can taste the herbs like oregano and fennel. ", "The red sauce is really good. ", "The toppings seemed fresh and the crust was well cooked, yet crispy. ", "Yes there were slightly charred parts which I liked."], "author": "Amanda L.", "review": "We have been let down by Brothers and North Beach lately. Noriega does not deliver, so that was out. We decided to try Pasquale's, Frankly since they painted the facade once Java Beach went in, it looks much cleaner and nicer. \n\nOrdered sausage, onion and mushroom. The sauce is really good, you can taste the herbs like oregano and fennel. The red sauce is really good. The toppings seemed fresh and the crust was well cooked, yet crispy. Yes there were slightly charred parts which I liked.", "rating": 4, "date": "2009-05-22"}, {"excerpts": ["The kind of flavor for pizza I am talking about is where you can actually taste the spices in the pepperoni, and actually taste the fennel in the sausage.... ", "taste the tomato in the sause.. ", "I mean seriously good authentic pizza here. "], "author": "Joel D.", "review": "This review is STRICTLY based on the fact that I have never ate in the actual restaurant itself , I only order delivery from this place- and for PIZZA who the heck doesn't ?? So it makes sense.\n\nBasically Pizza and Chinese food are the two foods you will never see me in the restaurant for... this is why they deliver. If I eat out and dine IN a restuarant I eat non deliverable food -- OBVIOUSLY -- and so should you. lol\n\nSo, Pasquale's is my second favorite Pizza place in San Francisco bra none ! (Milano's on 9th being my absolute favorite) -\n\nPasquale's on SLOAT pizza is very flavorful and ingrediants just POP in your mouth. The kind of flavor for pizza I am talking about is where you can actually taste the spices in the pepperoni, and actually taste the fennel in the sausage.... taste the tomato in the sause.. I mean seriously good authentic pizza here. Delivery is reasonable, and \nprice is great for what you get.\n\nThe combination is really packed. The pesto is real, the meats are just awesome, and the veggies are fresh and real. Not no frozen taste here. Real size cuts of the veggies so you know they don't have that \"cookie cutter\" frozen food size to them.\n\nReally a great pizza no matter what you order. The crust is perfect. Just chewy enough with out being to doughy, and just crispy enough for that real brick oven baked taste. The cheese is perfect, and perfect amounts of it as well. The pizza has that real \"rolled on flour\" taste on it. Unlike other places that are starting to use corn meal to roll the crust out on... When a pizza is really rolled out on a floured cutting board then hand tossed, you can tell.\n\nAnd for my patented \"Is It A Get Laid At The End Of The Night Place\" review --------- Well,,, its delivery, so you probably JUST got laid before you ordered it !!. So honestly it is NOT one of those places.\n\nBut, all in all, the pizza is very impressive and you should try it. Highly recommended by me.\n\nDisclaimer - I am only talking about the one on Sloat. I am not speaking of the other 2 in the city. As they are good too, I feel this one just has a better taste to it.", "rating": 4, "date": "2007-02-22"}, {"excerpts": ["Yes the place does look kind of dumpy but it always has appeared clean and all the ingredients are fresh and their sausage is very good, i'm getting hungry just thinking about it ."], "author": "Biggwally K.", "review": "i've been coming here for years mainly for pickup. It's much tastier if you pick it up and take it directly home to eat rather than have it delivered. Its very good and plenty of cheese and toppings and extremely reasonable , i am a little surprised that a few reviewers said it was very expensive ,its not. Yes the place does look kind of dumpy but it always has appeared clean and all the ingredients are fresh and their sausage is very good, i'm getting hungry just thinking about it .", "rating": 5, "date": "2013-12-11"}, {"excerpts": ["My favorite: mushrooms, onions and sausage on thick crust\nwould be nice if they had chicken, but they dont..."], "author": "Shelley N.", "review": "3.5 stars... always get take out and they deliver to DC which is a plus!!  Not 4 stars cause their pizza is not consistent. there are times the crust is to die for, not soggy, great flavor, thick just the way i like it, but then there are time it is soaked with grease and gets all soggy... but overall the pizza is great!!  We love the delivery guy... always smiling when he drops off the pizza.\nMy favorite: mushrooms, onions and sausage on thick crust\nwould be nice if they had chicken, but they dont...", "rating": 3, "date": "2008-02-27"}, {"excerpts": ["Their sausage was pretty stand-out; a nice a sweet fennel note to it. ", "The crust was nice but the sliced mozza made me think of kraft singles and undoubtedly tainted my experience.  "], "author": "david r.", "review": "You've tried them all, now try ...\n\nIt was their ad hype that led me into their joint. No, not led, forced me to make it my first pizza joint in SF (newly arrived).\n\nTheir sausage was pretty stand-out; a nice a sweet fennel note to it. The crust was nice but the sliced mozza made me think of kraft singles and undoubtedly tainted my experience.  Fresh mushrooms though, gotta appreciate that.\n\nOverall an average pie that should satisfy East Cost tastes but will leave those who've experienced wood-fired goodness scratching their heads.", "rating": 2, "date": "2009-02-15"}, {"excerpts": ["My favorite is pepperoni, mushroom and sausage. ", "They use real italian sausage here. ", "The crust is ok. ", "Tip the pizza maker a couple bucks and your pizza will be covered in the toppings you want, you won't be able to see the cheese underneath. ", "Pasquale's Pizza in my house never lasts longer than the next day. ", "Don't expect to dine into this place though, they have 3 small tables and it is quite boring inside unless you love watching pizzas being made."], "author": "D J.", "review": "My favorite pizzeria in San Francisco. What makes this pizza great is its toppings. My favorite is pepperoni, mushroom and sausage. They use real italian sausage here. The crust is ok. Tip the pizza maker a couple bucks and your pizza will be covered in the toppings you want, you won't be able to see the cheese underneath. Pasquale's Pizza in my house never lasts longer than the next day. Don't expect to dine into this place though, they have 3 small tables and it is quite boring inside unless you love watching pizzas being made.", "rating": 5, "date": "2007-01-04"}, {"excerpts": ["Favorite is the sausage and pepperoni.  ", "What distinguishes this pizza is how good the sausage is and how it complements the pepperoni.    ", "Sure the decor isn't there on Sloat, but who cares?  ", "It's good pizza to pick up and run or just eat after a cold surf...  ", "Crust runs slightly thicker than its Irving Street counterpart but that's part of the attraction; it's a real meal.  ", "I'd highly recommend this place for takeout at the least.  ", "Dependable and tasty."], "author": "A D.", "review": "Solid pizza.  Probably my second favorite place for pizza in SF (quite a few tie).  Favorite is the sausage and pepperoni.  What distinguishes this pizza is how good the sausage is and how it complements the pepperoni.    Sure the decor isn't there on Sloat, but who cares?  It's good pizza to pick up and run or just eat after a cold surf...  Crust runs slightly thicker than its Irving Street counterpart but that's part of the attraction; it's a real meal.  I'd highly recommend this place for takeout at the least.  Dependable and tasty.", "rating": 5, "date": "2007-04-08"}]}