{"piece fried sweet potatoes veggie": [], "piece thai toast": [], "piece green onion pancakes veggie": [], "piece spring rolls veggie": [], "piece fresh rolls": [], "piece tofu satay veggie": [], "piece shrimp rolls goong gra borg": [], "piece fried tofu veggie": [], "spicy crispy chicken wing": [], "crispy golden calamari": [], "crispy pumpkin": [], "fresh corn fritters": [], "coconut milk soup tom khar": [], "veggie coconut milk soup tom khar tofu": [], "hot and sour soup tom yum": [], "non spicy clear soup": [], "papaya salad som tum": [], "beef salad yum neur": [], "eggplant salad yum ma keur": [], "silver noodle salad yum woon sen": [], "seafood scallop salad": [], "grilled salmon salad": [], "veggie green": [{"excerpts": ["I had Veggie Green, steamed rice and Thai iced coffee delivered. ", "It arrived hot and was delicious! ", "No delivery charge (though they did charge me 10 cents for the bag... ", "Which cracked me up!) ", "I did take a star off only because it arrived with no napkin or silverware. ", "I will order them again, I know. ", "I will just stress that I need silverware!"], "author": "Alan K.", "review": "Hubby is currently in SF Veterans Hospital. I had Veggie Green, steamed rice and Thai iced coffee delivered. It arrived hot and was delicious! No delivery charge (though they did charge me 10 cents for the bag... Which cracked me up!) I did take a star off only because it arrived with no napkin or silverware. I will order them again, I know. I will just stress that I need silverware!", "rating": 4, "date": "2016-02-15"}, {"excerpts": ["Papaya salad.\nveggie green curry, we ordered extra spicy! \nspicy basil tofu.\n", "vege noodle,\n", "2-garlic rice.\n"], "author": "Nobu K.", "review": "Phucket.\n\nMe, \" How do you say it?\"\n\nmy #1 son, \" Just FXXX'n' say it dad, I know what you thinking.\"\n\nMe, \" No, no, not that, I know that. but really, how?\"\n\nmy #2 son, \"Phuck it dad, just phuck it,\" \n\nmy #1 son, \"shut it, waitress is coming.\"\n\nWaitress,\"Have you decide?\"\n\nSo, we ordered:\nGreen onion pan cakes.\nPapaya salad.\nveggie green curry, we ordered extra spicy! \nspicy basil tofu.\nvege noodle,\n2-garlic rice.\n1-brown rice.\n\nmy both sons loved the Young Coconut juice.\nUgh!\nI didn't like the juice!\nBut everything else was really GOOD!\nSpicy Good!\nThe waitress was really nice.\nThe bathroom was a bit skanky, I looked for a light but the sign says out side that inside of the door after I found the switch out side.\n\nmy #2 son, \" So, hows your Phucket?\"\n\nme, \" Oh, this shit is pretty good. I like it.\"\n\nmy #2 son, \" Phuckin A,\"\n\nIt's a thai beer. I like Shingha too but I couldn't help try the PHUCKET.", "rating": 4, "date": "2008-08-01"}], "veggie red": [{"excerpts": ["so we got the lunch combo with Veggie Red Curry and Veggie Egg Rolls (came with soup, salad and rice) and a Pad Kee Mao with Tofu.  ", "I was kind of upset that they didn't bother to tell us that the soup was cooked with chicken broth even though we ordered everything vegetarian...%#*&@!!!  ", "Anyway, the red curry was mediocre and didn't have many veggies in there...", "just lots of tofu.  "], "author": "Katelynn L.", "review": "Actually, I wanna give them 3.5 stars.  Came here for lunch with my boyfriend.  I'm supposed to be a vegetarian for the next couple of weeks so I figured Thai food would be nice.  Being super loving, my boyfriend agreed to let me do the ordering so we got the lunch combo with Veggie Red Curry and Veggie Egg Rolls (came with soup, salad and rice) and a Pad Kee Mao with Tofu.  I was kind of upset that they didn't bother to tell us that the soup was cooked with chicken broth even though we ordered everything vegetarian...%#*&@!!!  Anyway, the red curry was mediocre and didn't have many veggies in there...just lots of tofu.  Loved the pad kee mao though.\n\nI've eaten here/ordered take-out about a dozen times from here before and I like that I can always count on them to make a nice and spicy pad kee mao.  Their portions are kind of small but I'm okay with it because Thai food is so fattening anyway.  Overall pretty good Thai food.", "rating": 4, "date": "2009-04-10"}], "pra ram tofu": [], "sauteed curry sauce pong garee": [], "cashew nut tofu": [], "ginger tofu": [{"excerpts": ["Love the spring rolls, crispy chicken wings, green papaya salad, ginger tofu, cripsy garlic chicken over rice. ", "Love it all!!!"], "author": "Lady G.", "review": "Eat here about once a week! Love the spring rolls, crispy chicken wings, green papaya salad, ginger tofu, cripsy garlic chicken over rice. Love it all!!!", "rating": 5, "date": "2014-11-06"}, {"excerpts": ["We always order the same thing: chicken pad seew and ginger tofu - it's not overpriced, it's not greasy, & the flavor is good.  ", "It's an awesome change to all the worse-than-mediocre chinese delivery places around  (n fact, if you read this, & you live in the hood, & know of a kickass chinese place that delivers, let me know. ", "Also, if you know of a place that makes kickass american-style chinese, let me know, because sometimes that's just exactly what I want.)"], "author": "Robyn C.", "review": "They deliver to my far out neck of the woods, which makes me happy.\n\nWe always order the same thing: chicken pad seew and ginger tofu - it's not overpriced, it's not greasy, & the flavor is good.  It's an awesome change to all the worse-than-mediocre chinese delivery places around  (n fact, if you read this, & you live in the hood, & know of a kickass chinese place that delivers, let me know. Also, if you know of a place that makes kickass american-style chinese, let me know, because sometimes that's just exactly what I want.)", "rating": 3, "date": "2010-02-05"}, {"excerpts": ["The Tom Yum is amazing and the ginger tofu is awesome too.  ", "The dining area is small ", "so I wouldn't suggest this for a party of more than 4."], "author": "Stephanie W.", "review": "Cute, small and in the calmer dining area of Clement. Portions here are smaller than elsewhere, but it is cheap. The Tom Yum is amazing and the ginger tofu is awesome too.  The dining area is small so I wouldn't suggest this for a party of more than 4.", "rating": 4, "date": "2008-03-29"}], "sugar snap peas seasonal": [], "seasons": [], "veggie pad thai": [{"excerpts": ["The veggie pad Thai is superb and the Thai tea is excellent. ", "Can't say enough good things about this place."], "author": "Bianca H.", "review": "Lifesavers. I order delivery from this place regularly and they're always fast and great. The veggie pad Thai is superb and the Thai tea is excellent. Can't say enough good things about this place.", "rating": 5, "date": "2017-08-07"}, {"excerpts": ["Veggie Pad Thai for my friend here.\n\n"], "author": "Miika M.", "review": "Veggie Pad Thai for my friend here.\n\nThis is a great little place with an even better menu.  Lots of great appetizers as well as my favorite Papaya Salad.  They made it perfect, with thinly sliced papaya tossed in the classic sweet and tangy lime sauce with lots of chile peppers that made my lips fall off.  We warmed up with the Tom Yam, the hot and sour soup flavored with bits of lemongrass and red peppers.  The waitress kept hitting on my friend, who unfortunately, was gay, so I felt bad.  But she kept the food coming fast, and our last dishes were the Veggie Noodles with brown sauce and the Seafood Curry Sauce.  The noodles were my favorite thick wide rice noodles and the Seafood Curry brimming with shrimp.\n\nWe left, feeling a bit warmer and rounder to ward off the colder Sunset evening chill.", "rating": 3, "date": "2006-10-23"}, {"excerpts": ["For the entrees, my favorites are veggie Pad Thai, Spicy Basil Chicken and the Panang Curry.\n\n"], "author": "Janet H.", "review": "I have been a customer of Patpong for quite some time.  Recently, I took a former employee of mine here for lunch.  We had the Fried Tofu and Chicken Satay as appetizers and the Chicken Spicy Basil and the Chicken Green Curry as entrees.  For their lunch specials,  you get an appetizer, entree, soup, salad and rice.  We each liked our meals and the price was right.\n\nFor dinner, some of my favorite appetizers are Chicken or Beef Satay, the Fish Cakes, and the Fried Tofu.  My favorite soup is Tom Khar Gai (coconut soup with chicken).  For the entrees, my favorites are veggie Pad Thai, Spicy Basil Chicken and the Panang Curry.\n\nI have a soft spot for their Panang Curry.  I have tried that dish at half a dozen different Thai restaurants and Patpong always does it the best.  I consider myself a meat eater, but I will order the Panang Curry vegetarian as a good change of pace for my palate.  It is a great treat.\n\nI am a big fan of Patpong.  I have seen some of the reviews on the chairs being uncomfortable.  Unfortunately, I have to join the other Yelpers in this regard.  The chairs were there from the previous restaurant before Patpong took over the space.  But overall, Patpong is great food nonetheless!", "rating": 4, "date": "2008-05-23"}], "veggie noodles with sweet soy sauce pad see ewe": [], "veggie noodles with brown thai gravy lard nah": [], "veggie noodles with spicy sauce pad kee mao tofu": [], "grilled chicken gai yang": [], "grilled pork moo yang": [], "ginger pork": [], "pra ram beef": [], "meat with chili ginger paste pad prick king": [], "meat with eggplant pad ma keur": [], "beef with fresh chili pepper": [], "pork with fresh chili pepper": [], "spicy basil beef ka paow": [], "spicy basil pork ka paow": [], "garlic pepper beef": [{"excerpts": ["The other co-worker ordered the Garlic pepper Beef ($7.95) and indicated that she really liked her dish.   ", "There are 4 selections of rice with steamed at $1, and garlic rice, sticky rice and brown rice for $2/order.  \n", "Other items on the menu include appetizers, salad, soups, fried rice, stir-fried noodles, curries, pork/beef dishes, chicken/duck dishes, seafood dishes and vegetarian/vegt stir-fried noodles.  ", "I'd consider re-trying the food again even if it's not the best Thai food I've ever had, it' certainly wasn't the worse."], "author": "Ry T.", "review": "My co-workers decided to order take-out for lunch today and treated St. Gladys since it was her birthday week.  Patpong will deliver for free with a minimum order of $15 and they accept credit cards with a minimum $10 charge, no checks.   I tried the mild Gang Keo Warn Gai, $8.50, (Green curry with chicken, eggplant, bell peppers, zucchini, green beans and basil).  By my estimate, there was a good amt of chicken but not enough vegts.  The rice ($1) was ala carte.  The flavor was good, not fantastic.  \nSt. Gladys ordered the Prawns with Chili-Ginger Paste (Pad Prik King) $9.95.  I tried one of her mushrooms which was tasty but she said she wouldn't order it again.  The other co-worker ordered the Garlic pepper Beef ($7.95) and indicated that she really liked her dish.   There are 4 selections of rice with steamed at $1, and garlic rice, sticky rice and brown rice for $2/order.  \nOther items on the menu include appetizers, salad, soups, fried rice, stir-fried noodles, curries, pork/beef dishes, chicken/duck dishes, seafood dishes and vegetarian/vegt stir-fried noodles.  I'd consider re-trying the food again even if it's not the best Thai food I've ever had, it' certainly wasn't the worse.", "rating": 3, "date": "2009-06-04"}], "pra ram pork": [], "chicken and cashew nuts": [], "pra ram chicken": [], "spicy basil chicken ka poaw chicken": [], "chicken with chili paste": [], "spicy basil duck ka paow ped": [], "chicken with bamboo shoots": [], "chicken with baby corn": [], "garlic pepper chicken": [], "chicken with fresh chili pepper pad prik sod": [], "fishermans choice poh turn": [], "chu chee red snapper": [], "sweet and sour red snapper": [], "spicy salmon": [{"excerpts": ["I had vegetables in red curry, and my friend had spicy salmon.  ", "We were both very happy with our choices.  ", "Staff was friendly, atmosphere was nice.  ", "The only thing that was not good was that they brought my entree first and we had to wait for his."], "author": "sophia I.", "review": "The food was delicious.  I had vegetables in red curry, and my friend had spicy salmon.  We were both very happy with our choices.  Staff was friendly, atmosphere was nice.  The only thing that was not good was that they brought my entree first and we had to wait for his.", "rating": 4, "date": "2011-07-29"}], "garlic pepper prawns": [{"excerpts": ["I always get the garlic pepper prawns, very, very good!  ", "I also tried one chicken dish which also tasted good, the quality of the chicken was good, no suprises!"], "author": "Paul M.", "review": "This is my new thai restaurant for now.  I always get the garlic pepper prawns, very, very good!  I also tried one chicken dish which also tasted good, the quality of the chicken was good, no suprises!", "rating": 4, "date": "2010-12-25"}], "seafood curry sauce": [{"excerpts": ["But she kept the food coming fast, and our last dishes were the Veggie Noodles with brown sauce and the Seafood Curry Sauce.  "], "author": "Miika M.", "review": "Veggie Pad Thai for my friend here.\n\nThis is a great little place with an even better menu.  Lots of great appetizers as well as my favorite Papaya Salad.  They made it perfect, with thinly sliced papaya tossed in the classic sweet and tangy lime sauce with lots of chile peppers that made my lips fall off.  We warmed up with the Tom Yam, the hot and sour soup flavored with bits of lemongrass and red peppers.  The waitress kept hitting on my friend, who unfortunately, was gay, so I felt bad.  But she kept the food coming fast, and our last dishes were the Veggie Noodles with brown sauce and the Seafood Curry Sauce.  The noodles were my favorite thick wide rice noodles and the Seafood Curry brimming with shrimp.\n\nWe left, feeling a bit warmer and rounder to ward off the colder Sunset evening chill.", "rating": 3, "date": "2006-10-23"}], "prawns with chili ginger paste pad prik king": [], "prawns with eggplant pad ma keur": [], "spicy basil prawns and calamari ka paow": [], "crabmeat pad thai": [], "noodles with sweet soy sauce pad see ewe": [], "noodles with brown thai gravy lard nah": [], "noodles with spicy sauce pad kee mao": [], "silver noodles with garlic sauce pad woon sen": [], "guay tiew rod": [{"excerpts": ["I ordered Guay Tiew Rod noodle online with extra prawns,and turned out there were only two prawns in it. ", "It is said on the menu that extra prawns will come with 4 pieces of prawns. ", "Not to mention the noodle itself will have prwans as well. ", "Why there only two pieces of prawns? ", "Super bad service. ", "The quality is not good either."], "author": "Steven Z.", "review": "I ordered Guay Tiew Rod noodle online with extra prawns,and turned out there were only two prawns in it. It is said on the menu that extra prawns will come with 4 pieces of prawns. Not to mention the noodle itself will have prwans as well. Why there only two pieces of prawns? Super bad service. The quality is not good either.", "rating": 2, "date": "2018-08-26"}], "lard nah": [], "crispy chicken rice": [], "bbq chicken rice": [], "bbq pork rice": [], "duck rice": [], "hot and sour fried rice": [], "yellow curry gang ga ree": [], "green curry gang keo warn": [], "brown curry mua sa mun": [], "red curry gang dang": [], "extra beef": [], "extra pork": [], "extra crab meat": [], "extra chicken": [], "extra fish": [], "extra mussels": [], "extra sea scallops": [], "extra prawns": [{"excerpts": ["I ordered Guay Tiew Rod noodle online with extra prawns,and turned out there were only two prawns in it. ", "It is said on the menu that extra prawns will come with 4 pieces of prawns. ", "Not to mention the noodle itself will have prwans as well. ", "Why there only two pieces of prawns? ", "Super bad service. ", "The quality is not good either."], "author": "Steven Z.", "review": "I ordered Guay Tiew Rod noodle online with extra prawns,and turned out there were only two prawns in it. It is said on the menu that extra prawns will come with 4 pieces of prawns. Not to mention the noodle itself will have prwans as well. Why there only two pieces of prawns? Super bad service. The quality is not good either.", "rating": 2, "date": "2018-08-26"}], "extra calamari": [], "extra mixed veggies": [], "extra big set seafood": [], "fresh corn fritters special": [], "garlic fried calamari special": [], "crispy pumpkin special": [], "duck salad special": [], "chefs special papaya salad special": [], "gangpa curry special": [], "herbal red snapper special": [], "patpongs lamb special": [], "spicy sweet and sour red snapper special": [], "honey roast duck special": [], "three buddies special": [], "koasoi noodles special": [], "yellow curry with red snapper special": [], "ginger red snapper special": [], "green curry with salmon special": [], "red curry with roast duck special": [], "red curry with pumpkins special": [], "garlic pepper salmon special": [], "garlic pepper sea scallops special": [], "fried banana with honey topping": [], "fried banana with coconut ice cream": [], "pad garee": [], "ginger pad khing": [], "praw ram": [], "eggplant pad ma keur": [], "green beans with pik khing sauce": [], "spicy green beans": [], "sweet and sour pad prew wan": [], "all season pad pak": [], "sweet chili paste pad pik pao": [], "spicy sauce": [{"excerpts": ["-Another ordered the Pad Kee Mao (noodles with spicy sauce), but after a couple of bites it was unbearably spicy for her.  ", "But nonetheless, it had more flavor than the Pad See Ewe."], "author": "Lisa C.", "review": "Small & cute dinning area.  I'd recommend this place to take a date for dinner if you don't want to get overly stuffed because the portions are way small (See pictures).  I've gotten more food for the same price at other Thai places I've gone to, but I guess you're paying for the ambiance. Plus, this place was just around the corner of where I live. \n\nMy friends and I all ordered some type of stir-fried noodles, and they were generous enough to let me have a bite so that I can rave about it on Yelp: \n\n-I shared the chicken Pad See Ewe (noodles with sweet soy sauce), which was just ok...sorta plain. Probably wouldn't order that again. \n\n-Another ordered the Crab Meat Pad Thai, which I liked because they used real crab meat and the lemony aftertaste left my taste buds dancing. \n\n-Another ordered the Pad Kee Mao (noodles with spicy sauce), but after a couple of bites it was unbearably spicy for her.  But nonetheless, it had more flavor than the Pad See Ewe.", "rating": 4, "date": "2008-01-01"}], "spicy basil kar prow": [], "bbq chicken with salad on the side": [], "bbq garlic pork with salad on the side": []}