{"quinoa fattoush salad": [], "hummus plate": [], "ful mudammas": [], "pita pizza": [], "garlic and dill": [{"excerpts": ["This made me think the garlic and dill might be too garlicky for me.  "], "author": "Seong P.", "review": "I got the egg salad/ tuna sandwich, which was good, but not something I'd go out of my way for.  The pickles are fantastic.  I got the regular zesty because it had a kick from the jalapeno, as well as a strong garlic flavor.  This made me think the garlic and dill might be too garlicky for me.  Next time, I'll also get a jar of the green beans, and maybe some sauerkraut.", "rating": 4, "date": "2014-05-28"}, {"excerpts": ["I also bought a jar of the garlic and dill pickles which I am slowly working my way through.  ", "They are excellent and better than anything from a supermarket.  ", "Crisp and flavorful, the brine is just right.  ", "Also got some whitefish spread to go which was great the next day on bagels, and later in the week on a sweet baguette for breakfast."], "author": "Aaron S.", "review": "This place is like a few square feet of the Lower East Side transposed to Bernal Heights--and yes, that is a beautiful thing.  I split a house cured lox sandwich with my wife, which was amazing.  It was bursting with tasty fish and the fresh bread roll was really good (the caper spread was also a nice touch).  I want to come back to try the brisket.  We had the rugelach for dessert, which were good but not great. \n\nI also bought a jar of the garlic and dill pickles which I am slowly working my way through.  They are excellent and better than anything from a supermarket.  Crisp and flavorful, the brine is just right.  Also got some whitefish spread to go which was great the next day on bagels, and later in the week on a sweet baguette for breakfast.", "rating": 5, "date": "2011-06-29"}, {"excerpts": ["The braised brisket sandwich is absolutely delicious and I went through a jar of the garlic and dill pickles in two days. ", "That's some bomb ass food!"], "author": "Danny S.", "review": "Made a yelp account just to leave a good review for this place. The braised brisket sandwich is absolutely delicious and I went through a jar of the garlic and dill pickles in two days. That's some bomb ass food!", "rating": 5, "date": "2014-10-16"}], "zesty original": [{"excerpts": ["Zesty original definitely has a kick but their garlic dill is sweet and Delish :)"], "author": "Diana L.", "review": "Yum! A store within a store! They have jars of pickles and individual whole pickles for $1.00!!! So yums. Zesty original definitely has a kick but their garlic dill is sweet and Delish :)", "rating": 5, "date": "2014-05-28"}, {"excerpts": ["We bought 2 jars of zesty original pickles. ", "Evan wanted a white fish sandwich that he shared with his twin ", "and we got a bite of. ", "The sandwich was pricey but yummy. ", "The pickles are pricey $8/jar. ", "I call Paulie's gourmet pickles for the price you pay "], "author": "Anna K.", "review": "Paulie's Pickling was on a show we saw. Hubby bookmarked it and we made plans to stop by after taking the kids to watch a movie at the Metreon. \n\nPaulie's is located in Bernal Heights. It's a quiet area with lots of local businesses. We bought 2 jars of zesty original pickles. Evan wanted a white fish sandwich that he shared with his twin and we got a bite of. The sandwich was pricey but yummy. The pickles are pricey $8/jar. I call Paulie's gourmet pickles for the price you pay but you get $0.50 off when you bring back the jars. \n\nPickles are pricey but since our first visit we've been back to try their pickled jalapenos and green beans. All very tasty and worth the price when we are craving pickles. What can I say? My family LOVE pickles!", "rating": 4, "date": "2013-06-06"}, {"excerpts": ["My favorite are the Zesty Original pickles.  ", "I feel like a pregnant lady camped out on the couch, muching on one delicious crunchy spicy pickle after another.\n", "The sandwiches, while decent, are no match for the fantastic pickles.\n", "One star off however for how pricey they are ($8/jar).  ", "I understand they are made with love from probably the freshest available vegetables, but still, ouch."], "author": "bao t.", "review": "I can't believe I dragged myself not once, not twice, but 4 times to Bernal Heights for a bunch of pickles.  My favorite are the Zesty Original pickles.  I feel like a pregnant lady camped out on the couch, muching on one delicious crunchy spicy pickle after another.\nThe sandwiches, while decent, are no match for the fantastic pickles.\nOne star off however for how pricey they are ($8/jar).  I understand they are made with love from probably the freshest available vegetables, but still, ouch.", "rating": 4, "date": "2013-06-16"}, {"excerpts": ["We've only had the Zesty Original pickles.  ", "They just happen to be the BEST-PICKLES-I-HAVE-EVER-EATEN-IN-MY-WHOLE-LIFE-EVER. ", "For example, I have never gotten out of bed at 2am to eat a pickle (or 3) in my life, but you can bet your favorite pair of shoes, that this beez was standing in a dark kitchen eating pickles out of the jar the other night."], "author": "Lani N.", "review": "I have to say that I am totally and absolutely shocked to see that Paulie's Pickles only has 4.5 stars.  Really based on the pickle I just ate... they should have like... 8 stars.  \n\nWe live in Bernal. We love Bernal. We love it even more when local businesses sell amazing products.  \n\nWe've only had the Zesty Original pickles.  They just happen to be the BEST-PICKLES-I-HAVE-EVER-EATEN-IN-MY-WHOLE-LIFE-EVER. For example, I have never gotten out of bed at 2am to eat a pickle (or 3) in my life, but you can bet your favorite pair of shoes, that this beez was standing in a dark kitchen eating pickles out of the jar the other night.", "rating": 5, "date": "2013-04-04"}, {"excerpts": ["Think about it though: not many foods can deliver such a variety of flavors and textures in such a small piece of food\n\nGet a jar of Paulie's Zesty Original...", "You can try a taste of the Garlic Dill too, just so you'll be able to relate to their pickles, but the Zesty Original takes the concept of a pickle to another level. ", "You know pickle juice is supposed to boost your endurance, right? ", "I know, ewww. "], "author": "Mike H.", "review": "\"This is more than what I thought a pickle could be.\"  Actual quote of mine to the folks at Paulie's. \n\nFew people would ever ponder the potential of a pickle, so I'm forgiving myself for writing this. Odd as it may sound, my mom's side has imputed me with a real taste for pickles. Think about it though: not many foods can deliver such a variety of flavors and textures in such a small piece of food\n\nGet a jar of Paulie's Zesty Original...don't be shy! Definitely worth the $8. You can try a taste of the Garlic Dill too, just so you'll be able to relate to their pickles, but the Zesty Original takes the concept of a pickle to another level. You know pickle juice is supposed to boost your endurance, right? I know, ewww. Try to think of it like an artisan sports drink with dill, onions and jalapeno.\n\nFor a more traditional taste, try one of their sandwiches. I ate the brisket and chopped liver on rye and absolutely loved it! Rarely do I like beef liver or brisket but this combo, plus Russian dressing, onion and grilled slaw, was awesome. Rye bread always tastes good to me and this sandwich was definitely elevated by it. As a fairly dense bread the rye held everything together really well too. I'm always kinda messy when eating, and I never shy away from messy foods, but this sandwich could have been much worse without rye.", "rating": 5, "date": "2012-01-17"}, {"excerpts": ["The Zesty Original has a great, complex flavor - ever-so-slightly sweet, sour, a dash of spiciness, and perfectly salty.\n\n"], "author": "Scott H.", "review": "Being a NYC transplant and from growing up in Skokie, IL... I get the occasional craving for good Jewish deli food. Paulie's fits the bill and does a great job satisfying my pickle fix.\n\nPickles are prepared with love and care - I've spotted Paulie here more often than not making batches and he's always super friendly and passionate about his job.\n\nThe Zesty Original has a great, complex flavor - ever-so-slightly sweet, sour, a dash of spiciness, and perfectly salty.\n\nMight not be Gus' but I'll be darned if you can find me a better place in SF.", "rating": 5, "date": "2012-03-11"}, {"excerpts": ["We picked up a jar of Paulie's Zesty Original pickles at the Bluxome St. Winery \"Meet Market\" on Saturday. ", "They are THE best pickles I can remember purchasing. ", "So crisp and savory. ", "I'm intrigued to learn they sell sandwiches and other pickled objects at their Bernal spot - definitely need to check it out."], "author": "Lindsay M.", "review": "We picked up a jar of Paulie's Zesty Original pickles at the Bluxome St. Winery \"Meet Market\" on Saturday. They are THE best pickles I can remember purchasing. So crisp and savory. I'm intrigued to learn they sell sandwiches and other pickled objects at their Bernal spot - definitely need to check it out.", "rating": 5, "date": "2012-07-30"}], "sauerkraut": [{"excerpts": ["They have an array of different pickled veggies: cucumbers, green beans, sauerkraut, cauliflower, jalapenos, spicy carrots, etc. which are about $6-$10 per a jar.\n\n"], "author": "Cherylynn N.", "review": "3.5 STARS \n\nWhen your celebrity chef crush tells you to go somewhere... \n\nYOU.GO. \n\nOf course, making sure to wipe off the residual drool from the corners of your mouth before doing so. \n\nIt's no secret that my celebrity chef crush is Ryan Scott. When we visited his restaurant Mason, two months ago, he highly recommended that we try Paulie's Pickling since I live nearby.\n\nPaulie's Pickling is located in the shared marketplace: 331 Cortland (no available seating). Their specialty is as their namesake states: pickles. They have an array of different pickled veggies: cucumbers, green beans, sauerkraut, cauliflower, jalapenos, spicy carrots, etc. which are about $6-$10 per a jar.\n\nThey also serve up various Jewish deli-style sandwiches ($7.50-$11.50), bagels and smears ($3.50-$8), salads (price varies on size), and housemade drinks like honey cardamom soda, egg creams, cucumber lemonade ($3.50). Please note that prices on their website are not current. Most items were about $1 more when I visited yesterday. CC's accepted. \n\nMost 8-year olds would cringe at the thought of eating liver. My classmate did...so much so that she would trade her weekly liverwurst sandwich for my pathetic burnt toast folded over with a slice of ham and imitation cheese. \n\nWhen perusing the menu, I immediately gravitated to the Brisket & Liver Combo Sandwich w/ grilled slaw, onion, and Russian dressing ($11.50) http://bit.ly/1x9hOLr. Between a choice of rye, onion roll, sourdough, and wheat, I went with sourdough bread. The sliced sourdough was lightly toasted in the oven so it held everything together quite well. Overall, I thought the sandwich was just OK. For the price, I wouldn't order it again. Just like Ed U., I thought the brisket was very dry and bland. I found myself just picking it out of the sandwich. =/ The slaw gave a nice crunch, however, it lacked acid to cut through the richness of the meats. The highlight was the liver (5 stars) which was decadently rich and creamy (no metallic taste). I'm glad they sell this a la carte because it would make a killer spread over some lightly toasted Acme or Josey Baker bread.  Mmmm....\n\nThe sandwich also came with a pickle spear which was perfectly pickled, uber crunchy, and very satisfying. For the price of the sandwich, I wish it came with two spears but anyhow, I would definitely come back for a jar.\n\nA NYC classic, it's rare to find egg creams in SF so I ordered a Vanilla Egg Cream ($3.50) to slurp on while I waited for my sandwich to be made. Loved the prominent vanilla flavor but it was too sweet for my liking. Next time, I would ask for less syrup. \n\nService was very friendly and sandwiches took about 8 minutes to be made (only 1 person working).\n\nEasy street parking. \n\nThe sandwich, egg cream, and small tip totaled over $18...for a non-sit down lunch. Eeeeeck. Ahhh, the price of being a wannabe groupie...", "rating": 4, "date": "2014-11-07"}, {"excerpts": ["Jamie was happier with his choice, the $11 Brisket Reuben which more predictably had Sauerkraut, Russian Dressing and Swiss Cheese (photo: http://bit.ly/1vlz9gh).\n\n", "The ingredients blended more comfortably together in his sandwich, and the sauerkraut, in particular, had a nice fresh taste. ", "Of course we had to have Paul's specialty, the housemade pickles, and we enjoyed the snappy flavor of the garlic dill spears we got ", "(photo: http://bit.ly/1ndYlQm). ", "Just from looking at the display of them in the case, I ended up getting a jar of them to go ", "(photo: http://bit.ly/VGlJ1P). ", "The other temptation I caved into was a $3.50 slice of the Lokshen Kugel, which looked good in the case. ", "Liz warmed it up for me, and it was one of the best slices I've had. ", "I had a good one at Wise Sons, but this was much richer with a custard-like consistency and plenty of egg noodles and raisins (photo: http://bit.ly/1pTnswk). ", "You do have to shlep everything you buy, so they obligingly bag everything up for you. "], "author": "Ed U.", "review": "\"Check, Please! Bay Area\" strikes again. I thought I had a solid handle on all the Jewish-style delis in town, so seeing I missed this one in Bernal Heights made me feel like a shmendrik. Well, you could have knocked me over with a paper towel and picked me up with a pair of silver ice tongs when I saw that this has been in a communal space at 331 Cortland for the past 4-1/2 years. I convinced Jamie W. to accompany me for a Saturday afternoon visit, and I was amazed I was able to find parking just a half-block away. Gee, I wish there were more incubators in the city that allow budding small business owners to share space and cut down on their rent to establish themselves. Married owners Paul and Liz Ashby run their combination deli, bagel and pickle shop in here.\n\nIt's clearly the favorite of the six businesses in operation in here. Lots of sandwiches to choose from the whiteboard (photo: http://bit.ly/1rnVWde), but I already knew from a Yelp photo check that I was getting the $10.50 Brisket and Liver Combo with their Grilled Slaw, Russian Dressing and Onion. I ordered it on an onion roll (photo: http://bit.ly/YDDUHo), and I was surprised that the luxuriantly creamy chopped liver overpowered the brisket which was a bit dry and under-seasoned for my taste. The grilled slaw was a nice switch fro the expected mayo-mustard mix lending a welcome smokiness to the sandwich. Jamie was happier with his choice, the $11 Brisket Reuben which more predictably had Sauerkraut, Russian Dressing and Swiss Cheese (photo: http://bit.ly/1vlz9gh).\n\nThe ingredients blended more comfortably together in his sandwich, and the sauerkraut, in particular, had a nice fresh taste. Of course we had to have Paul's specialty, the housemade pickles, and we enjoyed the snappy flavor of the garlic dill spears we got (photo: http://bit.ly/1ndYlQm). Just from looking at the display of them in the case, I ended up getting a jar of them to go (photo: http://bit.ly/VGlJ1P). The other temptation I caved into was a $3.50 slice of the Lokshen Kugel, which looked good in the case. Liz warmed it up for me, and it was one of the best slices I've had. I had a good one at Wise Sons, but this was much richer with a custard-like consistency and plenty of egg noodles and raisins (photo: http://bit.ly/1pTnswk). You do have to shlep everything you buy, so they obligingly bag everything up for you. Oy, I'm mishpocheh!\n\nFOOD - 4 stars...Paulie has fine, snappy pickles, but it's the creamy chopped liver and kugel that stand out...though not together\nAMBIANCE - 4 stars...the 311 Cortland marketplace concept is very cool...a little seating area would be nice\nSERVICE - 3.5 stars...responsive, helpful in explaining the choices\nTOTAL - 4 stars...not quite verklempt but Paulie and Liz have reason to kvell", "rating": 4, "date": "2014-08-21"}, {"excerpts": ["The sauce was on the sweeter side and I wish I had more sauerkraut, but my craving for a good sandwich was satisfied. \n\n"], "author": "Stellie L.", "review": "First off, I'm thrilled that there are more tables!!! Last time I was there, there was only 2 tables and a bench outside the shop. If you haven't been to this place, there are multiple shops in one location, so limited seating! \n\nI ordered the Ruben sandwich and it was delicious! The meat was moist and the melted cheese complimented the meat so well. The sauce was on the sweeter side and I wish I had more sauerkraut, but my craving for a good sandwich was satisfied. \n\nMy only complaint is that it's expensive for a sandwich - $13.95 (sandwich, quarter of a pickle, and some chips)", "rating": 4, "date": "2016-09-25"}, {"excerpts": ["The brisket Reuben is my favorite - juicy brisket, sharp and tasty sauerkraut, great bread. ", "Heaven.  ", "Pickles are fantastic. ", "Woo!"], "author": "Mary Z.", "review": "Love love love this place. The brisket Reuben is my favorite - juicy brisket, sharp and tasty sauerkraut, great bread. Heaven.  Pickles are fantastic. Woo!", "rating": 5, "date": "2015-05-23"}, {"excerpts": ["There is an abundant variety of pickled vegetables like cucumbers, green beans, japaneos, cauliflower, and sauerkraut in addition to all sorts of sandwiches from liver to brisket to tuna. ", "The boyfriend got the pickled Jalepeno cheddar melt to take home since we visited the place after eating lunch. ", "When we ate it a couple of hours later, the sandwich remained fresh despite the cheese solidifying..", "It was delicious! ", "The flavors just meshed so well. ", "I usually don't eat Jalapeno, but in this case, I was hooked! ", "It was slightly spicy and slightly refreshing. ", "The sandwich also came with a spear of garlic dill pickle. ", "It was crisp and flavorful; perfect for a hot sunny day. ", "The beverage that ended our day right was the egg cream. ", "I always thought the drink was really made from eggs... ", "but there isn't any... ", "Confused? ", "I am! ", "How can something taste so milky, so vanilla-", "ey have such an egg foam consistency? ", "I don't understand it?! ", "Like I said, Paulie's Pickling has become one of our favorite spots. "], "author": "Samantha W.", "review": "I Love Paulie's Pickling. There is an abundant variety of pickled vegetables like cucumbers, green beans, japaneos, cauliflower, and sauerkraut in addition to all sorts of sandwiches from liver to brisket to tuna. The boyfriend got the pickled Jalepeno cheddar melt to take home since we visited the place after eating lunch. When we ate it a couple of hours later, the sandwich remained fresh despite the cheese solidifying..It was delicious! The flavors just meshed so well. I usually don't eat Jalapeno, but in this case, I was hooked! It was slightly spicy and slightly refreshing. The sandwich also came with a spear of garlic dill pickle. It was crisp and flavorful; perfect for a hot sunny day. The beverage that ended our day right was the egg cream. I always thought the drink was really made from eggs... but there isn't any... Confused? I am! How can something taste so milky, so vanilla-ey have such an egg foam consistency? I don't understand it?! Like I said, Paulie's Pickling has become one of our favorite spots. If it's not the vanilla egg cream, then it's the sandwiches. \n\nTo couples looking for a good sandwich shop for a nice picnic at the park-- Come here! You won't be disappointed. You get the pickles, the drinks, the sandwiches, and little mini sweets for the go.. What more do you need.", "rating": 5, "date": "2015-03-09"}, {"excerpts": ["Also, the sauerkraut is delicious! ", "I bought a pint. ", "Now when I went to use it after a week, it looked a bit off although it smelled fine. ", "Now I pickle at home. ", "Okay, actually I TRY to pickle at home, and... ", "look, let's not dwell on this ", "okay. ", "Let's just say there were some disasters and I am no longer allowed to pickle at home. ", "BUT, I thought it was okay, but I gave Paul a call just to ask. ", "He says to bring it by the shop. ", "Liz ", "and I both look at it, and agree it's fine. ", "BUT, she takes it and ", "right on the spot fills up a new fresh jar of sauerkraut from the back for me. \n\n"], "author": "Adrian B.", "review": "THESE PICKLES ARE CRAZY.\n\nSome might say that I'm crazy to drive all the way across town to get a pickle. Well, I have news for you. I once flew across the COUNTRY for a pickle. Guss Pickles, the iconic  barrels filled with brine out front on the Lower East Side. Sadly, it exists only now as Ess-A-Pickle in Brooklyn, due to the rising rents in Manhattan. Mother of god. Those were great pickles.  \n\nIf you have only had supermarket pickles, you just don't understand. Okay, let me try to explain. It's the difference between filet mignon and a Hungry-Man minute steak, between freshly made yogurt drizzled with honey on a warm day on a Greek island versus Yoplait, tomatoes grown in your back yard versus the round red supermarket orbs.\n\nSo, I can't keep having them FedEx me pickles from Brooklyn. I always look locally, and I am always very disappointed.\n\nUntil now.\n\nSo I go to Cortland and it's a tiny shopfront in a cooperative store, a deli with fresh cookies for Hannukah no less. Liz was behind the counter. I'm not sure why other people say she's not friendly. She's just from Boston!  That IS friendly by Boston standards. By Manhattan standards, she would be a loquacious laggard. In the LES, the extent of the conversations is: \n\"Quart of Spicy.\"\n\"That's five bucks...next!\"\n\nMe, I thought Liz was quite nice. We chatted a bit; she let me sample a bunch of different stuff. And, the pickles. \n\nWow.\n\nPerfect crunch, great flavor. The kind you just can't stop eating until they are gone. Me personally, I like a tad less dill and a touch more garlic, but I'm not complaining! I can get REAL pickles on the West Coast finally!!!\n\nAnd pickled green beans! And lox! And a nice lean Reuben! And an egg cream! Oy gevalt!\n\nAlso, the sauerkraut is delicious! I bought a pint. Now when I went to use it after a week, it looked a bit off although it smelled fine. Now I pickle at home. Okay, actually I TRY to pickle at home, and... look, let's not dwell on this okay. Let's just say there were some disasters and I am no longer allowed to pickle at home. BUT, I thought it was okay, but I gave Paul a call just to ask. He says to bring it by the shop. Liz and I both look at it, and agree it's fine. BUT, she takes it and right on the spot fills up a new fresh jar of sauerkraut from the back for me. \n\nCome on, where do you see that kind of phenomenal customer service these days! Above and beyond the call of duty, guys! But I won't complain for outstanding service.\n\nMakes me want to buy a quart of pickles a week. Looking forward to half-sours and (cross fingers) horseradish pickles in the Spring.\n\nSeriously, just go to Paulie's already!", "rating": 5, "date": "2012-01-06"}, {"excerpts": ["Next time, I'll also get a jar of the green beans, and maybe some sauerkraut."], "author": "Seong P.", "review": "I got the egg salad/ tuna sandwich, which was good, but not something I'd go out of my way for.  The pickles are fantastic.  I got the regular zesty because it had a kick from the jalapeno, as well as a strong garlic flavor.  This made me think the garlic and dill might be too garlicky for me.  Next time, I'll also get a jar of the green beans, and maybe some sauerkraut.", "rating": 4, "date": "2014-05-28"}, {"excerpts": ["Piled high with crunchy, tangy, sauerkraut, toasted just right.  ", "Even if they happen to be out of their mind-blowing corned beef, they'll improvise and make you one with brisket! ", "And it'll hit the spot and you might have to eat it in two sittings cause it's so huge."], "author": "Kay M.", "review": "man, this place is so good.\nWhen you wander in on a Saturday morning/afternoon miserably hungover and desperately fiending one of their reubens, they will make you one, and it will be heavenly. Piled high with crunchy, tangy, sauerkraut, toasted just right.  Even if they happen to be out of their mind-blowing corned beef, they'll improvise and make you one with brisket! And it'll hit the spot and you might have to eat it in two sittings cause it's so huge.", "rating": 5, "date": "2012-04-07"}, {"excerpts": ["The pickles are amazing, and the sauerkraut is seriously off the hook.  ", "I accidentally ate the entire jar in one sitting.\n", "Once you go Paulies, you will never go back."], "author": "Mic H.", "review": "Paulie's is the real deal.  Everything I have had here has been great!\nAll of the salads contain some of their house-made pickled ingredients (beans, jalapenos, etc), and are flipping delicious.\nThe pickles are amazing, and the sauerkraut is seriously off the hook.  I accidentally ate the entire jar in one sitting.\nOnce you go Paulies, you will never go back.", "rating": 5, "date": "2010-10-01"}, {"excerpts": ["I am looking forward to trying their horseradish and sauerkraut (unpasteurized, hooray), and maybe even the pickled Brussels sprouts. "], "author": "Ess D.", "review": "I love this place. Granted, I am a little bit obsessed with pickles (garlic dill pickled cucumbers especially), but this place is a delight. The folks that runs it are charming and personable, and hold up well during the lunch rush. They give samples, which to me is essential if I'm going to shell out more than supermarket prices for pickles. \n\nToday I took a friend and a coworker to Paulie's for lunch. Coworker was stressed out and semi-snarly; friend was his usual even-keeled self, but hungry. The tuna sandwich and cucumber salad converted my coworker into a completely different, much happier person. We all loved our sandwiches, and I finally bought a jar of the OH DEAR CHTHULHU THEY ARE SO TASTY AND CRUNCHY garlic dills. Sorry about the shouting there. When we were eating our food in nearby Holly Park, my friends were being that vocal about how good everything was. The coleslaw looks like my mayo-free Asian slaw, but was different - subtle and complex flavors. Yum. Small coworker and small me also appreciated that we could make two meals out of one Paulie's sandwich.\n\nBack at work, I offered my cuke salad to my vegetarian coworkers to try. They inhaled it. Then I opened the jar of pickles. Pickle nirvana. It had been a rough day and Paulie's quite seriously upped morale.\n\nI am looking forward to trying their horseradish and sauerkraut (unpasteurized, hooray), and maybe even the pickled Brussels sprouts. You've gotta be sure of your recipes if you're selling pickled Brussels sprouts.   \n\nEspecially recommended if you're from the Eastern Seaboard or PA. Can't exactly explain why, but you'll get it if you try their wares.\n\nNow...how do I get them to hook up with a Korean restaurant so the restaurant's panchan includes their pickled things?", "rating": 5, "date": "2011-02-09"}, {"excerpts": ["oh, and their sauerkraut is perfectly crunchy & well balanced.  ", "If you're in the 'hood, definitely check Paulie's out - highly recommended!!"], "author": "Elizabeth W.", "review": "Yum!  I love this place!  Lucky for me, I work just upstairs from Paulie's Pickling and find myself here often.  My recent favorite sandwiches include the Tuna Melt and Pickled Jalapeño  & Cheddar.  I'm also a huge fan of the pickled string beans & the pickled cauliflower....oh, and their sauerkraut is perfectly crunchy & well balanced.  If you're in the 'hood, definitely check Paulie's out - highly recommended!!", "rating": 5, "date": "2011-07-07"}], "spicy carrots": [{"excerpts": ["They have an array of different pickled veggies: cucumbers, green beans, sauerkraut, cauliflower, jalapenos, spicy carrots, etc. which are about $6-$10 per a jar.\n\n"], "author": "Cherylynn N.", "review": "3.5 STARS \n\nWhen your celebrity chef crush tells you to go somewhere... \n\nYOU.GO. \n\nOf course, making sure to wipe off the residual drool from the corners of your mouth before doing so. \n\nIt's no secret that my celebrity chef crush is Ryan Scott. When we visited his restaurant Mason, two months ago, he highly recommended that we try Paulie's Pickling since I live nearby.\n\nPaulie's Pickling is located in the shared marketplace: 331 Cortland (no available seating). Their specialty is as their namesake states: pickles. They have an array of different pickled veggies: cucumbers, green beans, sauerkraut, cauliflower, jalapenos, spicy carrots, etc. which are about $6-$10 per a jar.\n\nThey also serve up various Jewish deli-style sandwiches ($7.50-$11.50), bagels and smears ($3.50-$8), salads (price varies on size), and housemade drinks like honey cardamom soda, egg creams, cucumber lemonade ($3.50). Please note that prices on their website are not current. Most items were about $1 more when I visited yesterday. CC's accepted. \n\nMost 8-year olds would cringe at the thought of eating liver. My classmate did...so much so that she would trade her weekly liverwurst sandwich for my pathetic burnt toast folded over with a slice of ham and imitation cheese. \n\nWhen perusing the menu, I immediately gravitated to the Brisket & Liver Combo Sandwich w/ grilled slaw, onion, and Russian dressing ($11.50) http://bit.ly/1x9hOLr. Between a choice of rye, onion roll, sourdough, and wheat, I went with sourdough bread. The sliced sourdough was lightly toasted in the oven so it held everything together quite well. Overall, I thought the sandwich was just OK. For the price, I wouldn't order it again. Just like Ed U., I thought the brisket was very dry and bland. I found myself just picking it out of the sandwich. =/ The slaw gave a nice crunch, however, it lacked acid to cut through the richness of the meats. The highlight was the liver (5 stars) which was decadently rich and creamy (no metallic taste). I'm glad they sell this a la carte because it would make a killer spread over some lightly toasted Acme or Josey Baker bread.  Mmmm....\n\nThe sandwich also came with a pickle spear which was perfectly pickled, uber crunchy, and very satisfying. For the price of the sandwich, I wish it came with two spears but anyhow, I would definitely come back for a jar.\n\nA NYC classic, it's rare to find egg creams in SF so I ordered a Vanilla Egg Cream ($3.50) to slurp on while I waited for my sandwich to be made. Loved the prominent vanilla flavor but it was too sweet for my liking. Next time, I would ask for less syrup. \n\nService was very friendly and sandwiches took about 8 minutes to be made (only 1 person working).\n\nEasy street parking. \n\nThe sandwich, egg cream, and small tip totaled over $18...for a non-sit down lunch. Eeeeeck. Ahhh, the price of being a wannabe groupie...", "rating": 4, "date": "2014-11-07"}], "feta": [{"excerpts": ["The barley salad was a little strong for my taste, with feta and sundried tomato strips, but I think that was just a personal preference (and btw", ", I ate it all anyway).  "], "author": "Lynn S.", "review": "I happened upon this little marketplace two days ago, and I can't get it out of my mind!  At Paulie's I tried a \"Not from a Can\" tuna sandwich, lentil salad, potato salad, barley salad, and a cherry mint drink.  The sandwich was a spin on classic tuna salad - with relish, celery, lemon and mayo and topped with lettuce and pickled onions on a roll (I had poppyseed, it was delish).  It didn't look that big, but I could only eat half (and I was hungry).  I *loved* the lentil salad (made with pickled carrots, maybe cinnamon?) and potato salad (made with lots of dill and pickled green bean pieces, no mayo).  The barley salad was a little strong for my taste, with feta and sundried tomato strips, but I think that was just a personal preference (and btw, I ate it all anyway).  I think a whole sandwich which comes with a side salad was $7, so pretty reasonable considering the quality.\n\nPaulie's shares its space with 5 (?) other vendors, so it's almost like going to a permanent farmers market - other vendors have sushi, organic produce, cutlery, vegan baked goods (this is Bernal after all), and yummy-looking empanadas.  I am dying to go back!", "rating": 5, "date": "2010-05-31"}], "poached egg": [], "boiled egg": [], "tzatziki": [], "olives": [], "tahini sauce": [], "pita": [{"excerpts": ["Eggplant, pickles, fragrantly spiced beef, wrapped in very soft, fresh pita. ", "Got it to go, ate it while working at home without much drip-age. ", "It was a well wrapped, perfectly constructed, extremely tasty thing. ", "I do miss their old iteration as a jewish deli, but I'm looking forward to trying everything on their middle eastern menu. ", "It seems the quality of the ingredients, and care in preparation are happily the same."], "author": "Bubba M.", "review": "Beef kofta was to die for. Eggplant, pickles, fragrantly spiced beef, wrapped in very soft, fresh pita. Got it to go, ate it while working at home without much drip-age. It was a well wrapped, perfectly constructed, extremely tasty thing. I do miss their old iteration as a jewish deli, but I'm looking forward to trying everything on their middle eastern menu. It seems the quality of the ingredients, and care in preparation are happily the same.", "rating": 5, "date": "2018-03-29"}, {"excerpts": ["With homemade pickles, tuna, cucumber tomato salad, tsatiki, all wrapped in a soft pita. ", "Yum!! ", "Washed down with mint lemonade. ", "Incredibly fresh and flavorful.  ", "Definitely coming back to try Peaches Patties ", "Jamaican  and Mae Krua Thai food. ", "All nestled into an immaculate Bernal Heights charming window front. ", "You can opt to sit outside on the benches. ", "Gosh, it doesn't get better than this for a casual sunny Saturday afternoon lunch!"], "author": "Bridget K.", "review": "Just left my review on 331 Cortland Marketplace but here it is: I just found another SF food gem. 331 Cortland Marketplace. A co op of 3 food vendors whose food all looks amazing, but I opted to try Paulie's Pickling. What a delicious Albacore Tuna Gyro! With homemade pickles, tuna, cucumber tomato salad, tsatiki, all wrapped in a soft pita. Yum!! Washed down with mint lemonade. Incredibly fresh and flavorful.  Definitely coming back to try Peaches Patties Jamaican  and Mae Krua Thai food. All nestled into an immaculate Bernal Heights charming window front. You can opt to sit outside on the benches. Gosh, it doesn't get better than this for a casual sunny Saturday afternoon lunch!", "rating": 5, "date": "2017-10-07"}], "sparkling pomegranate lemonade": [], "honey and cardamom iced tea": [], "seltzer": [{"excerpts": ["A plain way of describing it is as a fizzy yoo-hoo drink, it's 3 layers of chocolate syrup, seltzer and milk, and cream on top, I believe. ", "Based on the drink itself, I'm glad I got to try it, but it isn't necessarily a repeat order from me. ", "I would come by to try the other dishes here, though!"], "author": "Claire S.", "review": "I'm familiar with places like the SF Ferry Building where vendor share the entire building and have their own little spots, but I was a little confused/amazed that the four vendors inside this place decided to do the same, in such a little space.\n\nThe menu of Paulie's is mostly cold-cut sandwiches that sound amazing. I've no idea why, but the idea of a liver sandwich on marbled rye sounded like the most delicious thing ever, but alas, we had just come from another bakery and were stuffed. What really caught my eye was their egg cream.\n\nAs a child, in books I read with characters in New York (and some tv shows), the egg cream was always mentioned, which to me was a delicious, mythical, confusing sounding drink that I was dying to try, but could never seem to find anywhere I went. Seeing it on Paulie's menu made my order a no-brainer.\n\nA plain way of describing it is as a fizzy yoo-hoo drink, it's 3 layers of chocolate syrup, seltzer and milk, and cream on top, I believe. Based on the drink itself, I'm glad I got to try it, but it isn't necessarily a repeat order from me. I would come by to try the other dishes here, though!", "rating": 3, "date": "2014-01-26"}, {"excerpts": ["Thank god they still have their pickles and honey cardamom drink as well (no longer with seltzer but as a refreshing ice tea with not too much sugar.) ", "Will definitely be going back..."], "author": "Micah S.", "review": "PAULIE'S JUST GOT EVEN BETTER! While I'll miss their one of a kind Jewish deli sandwiches, their concept has changed to Middle Eastern street food including soup, salads, sandwiches, and shakshuka with eggs. I ordered several of their dishes today and was very impressed. The flavor profiles are very authentic (I can vouch for them because my family is Middle Eastern.) The ingredients were fresh and the dishes were all satisfying with bold flavors. Thank god they still have their pickles and honey cardamom drink as well (no longer with seltzer but as a refreshing ice tea with not too much sugar.) Will definitely be going back...", "rating": 5, "date": "2017-03-04"}], "albacore gyro sandwich": [], "chicken shawarma sandwich": [], "beef kofta sandwich": [{"excerpts": ["Though, I was disappointed it's no longer offered, the Beef Kofta sandwich was Amazing.  ", "It's one of the best tasting things I've ever eaten."], "author": "seth c.", "review": "I used to come in regularly for the brisket.  Though, I was disappointed it's no longer offered, the Beef Kofta sandwich was Amazing.  It's one of the best tasting things I've ever eaten.", "rating": 5, "date": "2018-01-09"}], "sabich sandwich": [{"excerpts": ["I got a sabich sandwich and my husband got the borekah platter. ", "Both were solid at $10ish each. ", "Wouldn't come back here from east bay just for this place "], "author": "Ellyn B.", "review": "So here's why I'm only giving a 4... otherwise would've been a 4.5\n\nWe came expecting to have home cured lox and corned beef. Menu changed so you know - be warned!\n\nPlace was a shared one with two other food establishments. Not a ton of places to sit but we were fine since we came early.\n\nI got a sabich sandwich and my husband got the borekah platter. Both were solid at $10ish each. Wouldn't come back here from east bay just for this place but it was good\n\nA jar of home made pickles cost $8. Looking forward to it", "rating": 4, "date": "2017-06-17"}, {"excerpts": ["However, once I tried her fattoush salad and sabich sandwich, I was an instant convert. ", "Whatever Liz makes is fresh and delicious -- ", "comfort food of the best kind."], "author": "Julie F.", "review": "I was a big fan of the old Paulie's menu and wasn't sure what to expect when Liz decided to move away from classic Jewish deli fare to a Middle Eastern menu. However, once I tried her fattoush salad and sabich sandwich, I was an instant convert. Whatever Liz makes is fresh and delicious -- comfort food of the best kind.", "rating": 5, "date": "2018-01-01"}]}