{"street tacos": [{"excerpts": ["I had the street tacos. ", "They serve three tacos double tortilla with your choice of meat. ", "You can choose three meats if you want. ", "I had pollo asado and carnitas. ", "The chicken was moist and flavored. ", "The carnitas were okay. ", "We we expecting to eat civeche but they no longer sell any seafood which was disheartening. ", "I don't know that I'd be back."], "author": "Jessica M.", "review": "The seating organization here is a hot mess. It's first come first serve therefore people stock your table and it makes you feel hurried and rushed. \n\nThe waitress was really nice and checked on us often. The drinks are pricey and it's one of the only Mexican places that charge you for chips and salsa. The salsa was good the guacamole was okay. Chips are broken and crumbled. \n\nI had the street tacos. They serve three tacos double tortilla with your choice of meat. You can choose three meats if you want. I had pollo asado and carnitas. The chicken was moist and flavored. The carnitas were okay. We we expecting to eat civeche but they no longer sell any seafood which was disheartening. I don't know that I'd be back.", "rating": 3, "date": "2017-06-11"}, {"excerpts": ["Our server was very nice & accommodating, we ordered the Chicken Street tacos, they were lacking flavor, the chicken was tender but bland, comes with fresh cilantro & onion\n"], "author": "R. B.", "review": "Came here for the first time Tuesday after the Giants Game Opener\nThis place is huge with a nice bar! As you can imagine it was packed with people but everyone was having a great time\nMy friend and I got lucky and found a table right away \nWe were served drinks, a cold brew & a margarita, which was pretty good!\nWe ordered some food & this is where the 2 stars come in\nOur server was very nice & accommodating, we ordered the Chicken Street tacos, they were lacking flavor, the chicken was tender but bland, comes with fresh cilantro & onion\nWe also tried the Burrito Bowl, with Beef, this dish was so spicy, we had a hard time eating it! The food looks & tastes like the cooks could use a little guidance- the bowl of tomatoes they call salsa, tasted like a bowl of tomatoes, no flavor, no spice\nCome for drinks, go somewhere else for food.", "rating": 3, "date": "2018-04-14"}, {"excerpts": ["Street tacos are solid and our server had a fun sarcastic personality to him."], "author": "Tiffany D.", "review": "Convenient taco and bar place near the baseball stadium!\n\nSimple and straightforward menu.\n\nIt lacks seafood choices though! \n\nIt's spacious here and great for groups to gather, socialize and then potentially head to the ballpark or chill after the game!  Possible to just dine here too. \n\nStreet tacos are solid and our server had a fun sarcastic personality to him.", "rating": 3, "date": "2016-08-20"}, {"excerpts": ["Great food, good service, full bar, TVs, everything you need to watch a Giant's game, or a great stop before the game, the nachos were OUTSTANDING and big enough to share, also had street tacos, and veggie burrito all were great, if you around the area, its a great stop..."], "author": "Michael M.", "review": "Great food, good service, full bar, TVs, everything you need to watch a Giant's game, or a great stop before the game, the nachos were OUTSTANDING and big enough to share, also had street tacos, and veggie burrito all were great, if you around the area, its a great stop...", "rating": 5, "date": "2018-05-21"}, {"excerpts": ["Variety of Mexican fare in the menu - burritos, street tacos, quesadillas and delicious looking sides.  ", "Ok chips so so salsa - quesadilla is large, ok quac, nothing to write home about, friends had the carnitas- said was good, other had carne asada street tacos, said had some flavor and good.  ", "Service great, food ok to good", ", atmosphere lively and energetic, parking - hey ", "it's King Street, shell out your $20 bucks for 3 hrs of parking and enjoy hanging out with friends across from ATT park."], "author": "Rhondi S.", "review": "Good sports bar to hang when watching a sporting event - they are located right across from ATT park, hi Giants, but go Dodgers!  Came here during the play offs, so no Giant fans in the house, but watching the Dodgers kick butt on their tvs screens.  Nice attentive bar tenders.  Variety of Mexican fare in the menu - burritos, street tacos, quesadillas and delicious looking sides.  Ok chips so so salsa - quesadilla is large, ok quac, nothing to write home about, friends had the carnitas- said was good, other had carne asada street tacos, said had some flavor and good.  Service great, food ok to good, atmosphere lively and energetic, parking - hey it's King Street, shell out your $20 bucks for 3 hrs of parking and enjoy hanging out with friends across from ATT park.", "rating": 3, "date": "2016-11-08"}, {"excerpts": ["Asada street tacos were dry. ", "Nachos were bland. ", "Overall I give this place three meh's"], "author": "David S.", "review": "Meh. Nothing special. Asada street tacos were dry. Nachos were bland. Overall I give this place three meh's", "rating": 3, "date": "2017-04-10"}, {"excerpts": ["I always come here to load up on a bunch of street tacos and margaritas. ", "The food is always solid, decent prices ", "and I've always had great service."], "author": "Steven K.", "review": "This is my favorite spot to go before a game. The place is huge, so it's usually not too hard to get a spot. I always come here to load up on a bunch of street tacos and margaritas. The food is always solid, decent prices and I've always had great service.", "rating": 5, "date": "2017-03-17"}, {"excerpts": ["unattentive phoneline: no one would pick up the phone (multiple calls) so I couldn't order take-out; had to get there to order to-go  2) douchey greeters: the supposed greeter dudes in their 20's didn't do their job but paid attention to watching the TVs 3) average food quality: the street tacos tasted fine overall, but not as good as some food trucks; the carnita meat in the burrito was soggy, fatty, and had an odd smell/after-taste. "], "author": "Bobby L.", "review": "Pro: very nice food preparers/handlers\n\nCons: 1) unattentive phoneline: no one would pick up the phone (multiple calls) so I couldn't order take-out; had to get there to order to-go  2) douchey greeters: the supposed greeter dudes in their 20's didn't do their job but paid attention to watching the TVs 3) average food quality: the street tacos tasted fine overall, but not as good as some food trucks; the carnita meat in the burrito was soggy, fatty, and had an odd smell/after-taste. 4) price seemed high for the so-so quality but is actually cheaper than the surrounding restaurants\n\nDon 't go unless you really need to find a place to watch the game, and if you do, be prepared for the above cons!", "rating": 1, "date": "2016-09-18"}, {"excerpts": ["Street tacos were okay. ", "I had beef and chicken. ", "The top shelf Margarita was a bit overpriced at $12.50."], "author": "Pamela R.", "review": "Street tacos were okay. I had beef and chicken. The top shelf Margarita was a bit overpriced at $12.50.", "rating": 3, "date": "2016-05-22"}, {"excerpts": ["We also tried some of the street tacos.  ", "Carnitas, carne asada, and supposedly the chile colorado ", "(but I believe it was the shredded beef).  "], "author": "Carol P.", "review": "I was lucky enough to snag a metered parking spot across the street from the stadium on the first Giants/Dodgers '11 home game.  I thought it must be karma, so might as well go where the parking gods led me, the front doors of Pedro's Cantina.  We were there early enough (5pm for a 7:15p game) so, again, lucky enough to secure a table near the bar.  I loved the whole \"we are the champions\" atmosphere.  The place was crackin' with a sea of orange and black!\n\n I was not too happy that they do not  honor \"happy hour\" specials on game days.  WTF????  Oh well, the beer is still going to be cheaper than in the stadium, so we filled up on $20 pitchers and $3 chips and salsa.  Really?  You're going to charge me $3 for something that should always (happy hour or not) be complimentary?  You're a goddamn Mexican restaurant!  Oh por favor! \n\nWe also tried some of the street tacos.  Carnitas, carne asada, and supposedly the chile colorado (but I believe it was the shredded beef).  Anyways, those were pretty good.\n\nDefinitely a great place to go before, during, and (I'm assuming) after a game...if you can get over paying for chips and salsa!", "rating": 3, "date": "2011-04-20"}, {"excerpts": ["Street tacos, burritos, quesadillas, nachos, tamales, etc. ", "Prices were decent, considering the rent they must be paying. ", "3 tacos for $9, burritos for $8. ", "Cocktails, not so much... ", "About $8 for a mixed drink. ", "I ordered the Nachos with Chorizo, my lovely wife got the Carnitas Street Tacos. ", "The nachos were actually perfect, the chorizo was delicious. ", "I snagged a bite of the street tacos, and the carnitas were ultra-juicy and tasty. "], "author": "Joel V.", "review": "Made my maiden voyage to Pedro's pre-Giants game, before we treated the Dodgers like our prison bitches. The place was PACKED!  It is very similar to it's neighbor, Pete's Tavern. In fact, the two are connected. Brick walls, a couple of levels, flatscreen tvs, big bar in the center. We got a seat and I peeped the menu.\n\nThe menu is very much a taqueria menu. Street tacos, burritos, quesadillas, nachos, tamales, etc. Prices were decent, considering the rent they must be paying. 3 tacos for $9, burritos for $8. Cocktails, not so much... About $8 for a mixed drink. That's where Sneaky Pete makes his scrilla.\n\nConsidering the crowd, our waiter did a decent job of turning the order over quickly. I ordered the Nachos with Chorizo, my lovely wife got the Carnitas Street Tacos. The nachos were actually perfect, the chorizo was delicious. I snagged a bite of the street tacos, and the carnitas were ultra-juicy and tasty. My wife got the sangria, and it was one of the best I've ever tried. \n\nThe presentation of food was relaxed. The food served in baskets or paper plates. Drinks in plastic cups. People whining about this in previous reviews need a fresh tampon. It's a sports bar across from a stadium for chrissakes! Don't be fooled, this isn't a fancy steak house...\n\nDefinitely a cool place to kick it pre or post Giants games. Cool vibe, lots of sports on the tvs, decent food. But I'm not sure I'd go back when the Giants are out of town...", "rating": 4, "date": "2010-09-17"}, {"excerpts": ["Street tacos were recommended, but were bad cuts of meat, and salsa was not fresh at all.... ", "Guacamole was pretty good, so if you like just beer and guacamole ", "you should be ok-"], "author": "Erin H.", "review": "Good service (if you arrive early before a game), but the food and drink left MUCH to be desired! Street tacos were recommended, but were bad cuts of meat, and salsa was not fresh at all.... Guacamole was pretty good, so if you like just beer and guacamole you should be ok-", "rating": 1, "date": "2014-04-28"}, {"excerpts": ["Street Tacos were delicious, Wifey loved her pomegranate something or other, They never ran out of beer.......and......ummm....."], "author": "Ryan B.", "review": "Made our way to this joint for some pre-game recently. I'm going to do this review in PRO/CON form.\n\nPros: Street Tacos were delicious, Wifey loved her pomegranate something or other, They never ran out of beer.......and......ummm.....I guess I was glad to not find San Quentin style crushed glass in my food.\n\nCons: Dudes at the front door checking my wifes bag like she is Al Qaeda(didn't know Pedros was a high value target for the evildoers), 87,563 TV's and for some reason some bullshit soccer game is on(note to management from April to October we watch baseball in America), Why is it that at some odd time like 6:23pm they decide that only women can use the restrooms and guys have to go out back to use the porta-potties? This place and it's cracker brother Pete's next door are skating by with the BARE minimum of toilets for the buildings capacity which is disappointing since most binge drinkers these days are breaking the seal early.", "rating": 2, "date": "2011-04-14"}, {"excerpts": ["I ordered 3 street tacos for 8 bucks? "], "author": "Chris T.", "review": "Came here before a Giant's game only to find out they don't have happy hour during Giant's games :(\n\n\nI ordered 3 street tacos for 8 bucks? (Asada, Machaca Beef, and Carnitas) and an order of chips and salsa.\n\nThe tacos were okay, I definitely wasn't feeling the Machaca Beef though. The chips and salsa were pretty good though, definitely ask for lime for the chips.\n\nThe service was okay, speed was okay, basically the entire visit was \"okay.\"", "rating": 3, "date": "2011-07-11"}, {"excerpts": ["-Food prices seem to be in line with typical, pre-game dining options: think $10 for a big plate of nachos, $3 for 'street tacos', etc.\n-Location! ", "Location! ", "Location! "], "author": "phil h.", "review": "Things I love about Pedro's:\n\n-The space is awesome. Exposed brick, flat screens everywhere you look, tons of places to sit, including a huge balcony.\n-Our server, Stephanie, was very sweet and smoking hot. And let's face it, that can go a long way when attracting your neanderthal sports fan (eg. Phil H.)\n-Food, for the most part, was pretty decent. Definitely a good option for a pre-game bite....we really enjoyed the nachos grande with chorizo.\n-Food prices seem to be in line with typical, pre-game dining options: think $10 for a big plate of nachos, $3 for 'street tacos', etc.\n-Location! Location! Location! Right across the street from the ballpark, you really can't get any closer than Pedro's.\n\nThings I hated about Pedro's:\n\n-Serving food on paper plates, with plastic utensils, and drinks in plastic cups. C'mon, we are paying restaurant prices, treat us like adults and give us really plates and glasses.\n-My 'Cadilliac Margarita\" was WAY too sweet. And at $10, just not worth it.\n-$18 for a pitcher of Bud Light. Wow.\n-No happy hour on game days - we're sneaking out of work early to start drinking before the game, would it kill you to knock a buck off before say 6pm?\n\nThe good out weighs the bad so three solid stars. With such a large space if you get there on the early side you should have no problem grabbing seats either at the bar or at one of the many tables available. But based on our one pre-game experience I think Pedro's definitely needs to step things up if they want to attract crowds when the Giants aren't playing across the street.", "rating": 3, "date": "2010-08-20"}, {"excerpts": ["Love the \"street tacos\"!  ", "The carnitas taco was good & the chili verde was outstanding.  "], "author": "Gregory S.", "review": "I've been meaning to try this place for a long time & finally got a chance.  Now I'm mad I didn't do it before.\n\nLove the \"street tacos\"!  The carnitas taco was good & the chili verde was outstanding.  We even got a discount on the sangria when we checked in.\n\nLooking forward to next time!", "rating": 4, "date": "2011-08-22"}, {"excerpts": ["What is it with places charging an arm and a leg for mediocre street tacos? ", "The meat was just okay for me. ", "I figure if I'm going to order a small taco for a crazy price, I should be getting my money's worth. ", "I didn't. "], "author": "Caroline L.", "review": "Although I do love new restaurants popping up around AT&T Park I wasn't too impressed with this place. I was told it can get crowded on game days, but the day I went it wasn't too crowded... so it looked like some big empty warehouse to me with a bar in the middle. I'm not one to complain about atmosphere unless it really bothers me, so I won't. \n\nI now judge Mexican places based on their tacos, and I'll just say I wasn't too impressed. What is it with places charging an arm and a leg for mediocre street tacos? The meat was just okay for me. I figure if I'm going to order a small taco for a crazy price, I should be getting my money's worth. I didn't. The waiter ended up messing up my order too, so I think in the end I paid way more than I should have. \n\nI thought Mijita was bad, but I guess now they have competition. I would go back here for the beer, pretty much. Also I heard it's connected to Pete's Tavern as well, so I think I'll just stick to drinking instead of eating bad tacos.", "rating": 2, "date": "2010-09-03"}, {"excerpts": ["street tacos tasted good but could have way more meat on them.\n\n"], "author": "Jonathan B.", "review": "Went way before game time (arrived at 3:30 for a 7pm game). \n\nThe bar was empty so we bellied up and said hello. It then took 20 minutes to get drinks ordered for two of us.\n\nThey were way more focused on prepping the bar for the game than on serving people.\n\nQuesadilla was huge and pretty good...street tacos tasted good but could have way more meat on them.\n\nAt least its across from the park.", "rating": 2, "date": "2011-04-23"}, {"excerpts": ["Anyhoo...they have really tasty $1 street tacos (6 different kinds) and serve $4 beers (whatever's on tap) and a $5 margarita.  ", "On top of that, they serve free chips and salsa!  ", "Yay!  "], "author": "Nina L.", "review": "They have a pretty cool HH special that occurs every non-game day from 4-7 pm.  Maybe not on weekends too.  \n\nAnyhoo...they have really tasty $1 street tacos (6 different kinds) and serve $4 beers (whatever's on tap) and a $5 margarita.  On top of that, they serve free chips and salsa!  Yay!  So far I've had their carnitas, machaca beef (shredded beef), pollo verde, and carne asada tacos.  They're all really tasty and you have your choice of 2 different tapatios, cholula, and tabasco.  The waitress will also bring you two bottles of their housemade green and red salsas.\nOn a regular day, I've also had their ceviche, enchiladas, and pork carnitas, which are all decent but seriously, go for HH.  It'll make you happy.", "rating": 4, "date": "2011-02-24"}, {"excerpts": ["but I think the best were the street tacos and the burrito. ", "Good semi spicy salsa and delicious margaritas! "], "author": "Tamara R.", "review": "I just tried this place for the first time yesterday before seeing Cavalia. It was pretty quiet for a Sunday but it was the day after Christmas after all. \n\nWe had an extremely helpful and friendly waitor who offered great suggestions and was incredibly patient with our group of 8. \n\nWe checked in on Yelp to receive free chips and salsa! It always tastes better when it's free!\n\nWe ordered a variety of things but I think the best were the street tacos and the burrito. Good semi spicy salsa and delicious margaritas! Not to mention a great location. \n\nI will definitely be returning sometime in the near future!", "rating": 4, "date": "2010-12-27"}, {"excerpts": ["This place is all about pre game festivities, street tacos, drinking beer, and watching games on the TVs.\n\n", "I always stick with the street tacos and will try the burrito bowl next time. \n\n"], "author": "Mike R.", "review": "This place is all about pre game festivities, street tacos, drinking beer, and watching games on the TVs.\n\nStay away from the mixed drinks because they are horrible, and stick to draft or bottled beer.\n\nService is so so depending on which section you sit in.\n\nI always stick with the street tacos and will try the burrito bowl next time. \n\nThe ambiance is great and it becomes quite crowded before the Giant games and there are always pretty ladies in the house.\n\nPedros is still my go-to place in Soma and worth trying out.", "rating": 3, "date": "2012-05-07"}, {"excerpts": ["I had the street tacos which were actually very delicious. "], "author": "Stephen R.", "review": "Another clever Mexican place in South Beach, but not that clever.\n\nThere are only a few key points you need to know about this place:\n- The service, though friendly, is glacially slow.\n- Prices are decent.\n- It's loud.\n- The salsa sucks.\n\nI had the street tacos which were actually very delicious. It was also nice to see Negra Modelo on tap.\n\nI'm not in a hurry to return, but if you're looking for Mexican food in this neighborhood and have already tried the 4 other places within the 2 block radius, then check this place out.", "rating": 3, "date": "2010-08-23"}, {"excerpts": ["The street tacos and tamales are really quite good and the staff all seem to be having a great time.  ", "Pedro's really picks up the heightened atmosphere and feels like an extension of AT&T.  ", "I love the 'drunken pig' t-shirts the waitstaff wear."], "author": "Robert M.", "review": "I don't drink, but that does not spoil a trip to Pedro's.  This is a perfect sports-oriented venue with a great vibe and very good food.  The street tacos and tamales are really quite good and the staff all seem to be having a great time.  Pedro's really picks up the heightened atmosphere and feels like an extension of AT&T.  I love the 'drunken pig' t-shirts the waitstaff wear.", "rating": 4, "date": "2011-08-26"}, {"excerpts": ["As for the food, it wasn't bad at all\n\nNachos- hot and crisp, topped with ground beef, cheese sauce, sour creme, guac, man it was actually pretty tasty\n\nStreet tacos, carnitas and chicken also warm on the hot side. "], "author": "R O.", "review": "1st time out, went for the NFC Champ game between Niners and Giants. About 75% capacity, for a sports bar, this is the ideal time I would've wanted to come out for this spot. Arrived 2hrs early for a table and seat but instead ran into a line w/ $10 cover and for standing room only. Can't really say anything about that since I knew it was gameday, haha on me. \n\nThe ground level reminds me of El Squid Roe down in Cabo, large hall, action in the middle, and a balcony where you can chill and watch from above. The main bar area sucked because they allowed seats at the bar. Well at 75% that's an issue. Plus you had to order food and drinks at the bar, at least from what I could tell\n\nDownstairs are the main restrooms, small and lines\n\nMain level rear outside is the smoking section, note they didn't allow ins and outs at the front door, PODS outside w/ wash stations, big plus\n\nmain level has inside access to Pete's next door, place is connected\n\nUpper level is where we found a small area at the stand only bar, hey it was better than nothing at this point. Enough room to hold nachos and a bucket of brew, nice thing is that there were flat screens at almost every angle so watching the game was not an issue. There was a second bar on the upper level that was way easier to get too, another big plus.\n\nAs for the food, it wasn't bad at all\n\nNachos- hot and crisp, topped with ground beef, cheese sauce, sour creme, guac, man it was actually pretty tasty\n\nStreet tacos, carnitas and chicken also warm on the hot side. The tortillas could have been cooked thru a little bit more but still decent\n\nEvent most likely had an impact on the food, reason why it was probably coming out nice and hot, pretty cool they didn't screw it up, an order at the bar would take less that 10 minutes to pop out, hand delivered by staff too, kind of a suprise how they would find you, prices are steep for nachos and tacos\n\nOverall experience was nice, no issues with crowd, vibe was good, actually alot of eye candy too\n\nparking sucks in the area, valet for $25 right in the front of the lot on the side, fuck it, that's why you work\n\nI would come back for another big event, if it was smaller I probably would become a statistic of the food woes", "rating": 3, "date": "2012-01-26"}, {"excerpts": ["It's not bad food, I had the street tacos and they were pretty good, but I hoped for a classier experience for what I was paying.  ", "Taking into account that Pedro's is right across the street from the ballpark, the priceyness makes sense, just something to be aware of."], "author": "Katy R.", "review": "I was disappointed with Pedro's.  I can only comment on the food because I didn't have anything to drink, but a couple friends had the happy hour margaritas and were raving about them.  This place is overpriced for what you get--taqueria food on paper plates with plastic silverware.  It's not bad food, I had the street tacos and they were pretty good, but I hoped for a classier experience for what I was paying.  Taking into account that Pedro's is right across the street from the ballpark, the priceyness makes sense, just something to be aware of.", "rating": 2, "date": "2011-07-28"}, {"excerpts": ["The carnitas, steak and chicken street tacos were so saucy and flavorful! ", "They were super delicious and caught me by surprise. ", "I never expect tacos to be good because the best ones were always from hole in the wall taquerias or taco trucks. ", "The chips and salsa were fresh and also very good to much on! ", "Wouldn't mind stopping by again. ", "Good times."], "author": "Cindy T.", "review": "We came by to pre-drink and grab some quick bites before the Giants game and it was packed to the max. Luckily, I was able to slip to one side of the bar where the bartender was nice enough to take my order, four different times, too! He was swamped by many other thirsty bar-goers, but definitely did his best to handle everyone's demands in a very cool, timely and collective manner. We ordered pitchers and pitchers of beer and whole bunch of apps. The carnitas, steak and chicken street tacos were so saucy and flavorful! They were super delicious and caught me by surprise. I never expect tacos to be good because the best ones were always from hole in the wall taquerias or taco trucks. The chips and salsa were fresh and also very good to much on! Wouldn't mind stopping by again. Good times.", "rating": 5, "date": "2011-09-28"}, {"excerpts": ["craving street tacos from Pedro's pretty much twice a week now! ", "Margaritas are good too :)"], "author": "Pat M.", "review": "craving street tacos from Pedro's pretty much twice a week now! Margaritas are good too :)", "rating": 5, "date": "2011-05-26"}], "nachos del pedro": [], "quesadilla zuiza": [], "cantina burrito": [], "braised beef enchiladas": [], "burrito bowl": [{"excerpts": ["My burrito bowl arrived and it was just okay. ", "To be fair, my husband enjoyed his beer and burrito. ", "When the bill arrived I was charged for both margaritas. ", "My husband spoke to the waitress and she removed the first drink and charged the dollar more for the second margarita. ", "Not good business in my opinion. ", "They also charged us for our chips and salsa. \n", "Beware if you go for a meal."], "author": "Pamela R.", "review": "Horrible food and drinks. Will not go back. Went yesterday for an early dinner. I ordered the Hawaiian margarita. It tasted funny the waitress asked if I wanted something else and I said how about just a regular margarita. She said oh try The Godfather margarita. I said okay. It came and it was worse than the first drink. I didn't say anything. My burrito bowl arrived and it was just okay. To be fair, my husband enjoyed his beer and burrito. When the bill arrived I was charged for both margaritas. My husband spoke to the waitress and she removed the first drink and charged the dollar more for the second margarita. Not good business in my opinion. They also charged us for our chips and salsa. \nBeware if you go for a meal.", "rating": 1, "date": "2018-09-21"}, {"excerpts": ["We also tried the Burrito Bowl, with Beef, this dish was so spicy, we had a hard time eating it! ", "The food looks & tastes like the cooks could use a little guidance- the bowl of tomatoes they call salsa, tasted like a bowl of tomatoes, no flavor, no spice\nCome for drinks, go somewhere else for food."], "author": "R. B.", "review": "Came here for the first time Tuesday after the Giants Game Opener\nThis place is huge with a nice bar! As you can imagine it was packed with people but everyone was having a great time\nMy friend and I got lucky and found a table right away \nWe were served drinks, a cold brew & a margarita, which was pretty good!\nWe ordered some food & this is where the 2 stars come in\nOur server was very nice & accommodating, we ordered the Chicken Street tacos, they were lacking flavor, the chicken was tender but bland, comes with fresh cilantro & onion\nWe also tried the Burrito Bowl, with Beef, this dish was so spicy, we had a hard time eating it! The food looks & tastes like the cooks could use a little guidance- the bowl of tomatoes they call salsa, tasted like a bowl of tomatoes, no flavor, no spice\nCome for drinks, go somewhere else for food.", "rating": 3, "date": "2018-04-14"}, {"excerpts": ["Had a burrito bowl w/chicken. ", "Food was warm vs hot (hot food is my preference). "], "author": "D L.", "review": "Had dinner here before an event at AT&T Park so it was presumably busier than usual.\n\nCasual place...order food at cashier, get a number for your table, & it's brought to you.\n\nFood ordering system needs some work. Cashier took drink orders (had to make drinks as well) and food orders, making the wait in line very long (more frustrating for ppl not ordering drinks).\n\nHad a burrito bowl w/chicken. Food was warm vs hot (hot food is my preference). Taste was fine, nothing special. \n\nRedeeming quality was proximity to AT&T Park and a place to eat/sit before the concert.", "rating": 2, "date": "2017-08-16"}, {"excerpts": ["The burrito bowl was good, fresh veggies, gooey cheese and some good guac. "], "author": "Aletta B.", "review": "Looking for a mexican-inspired sports bar near the Giants Stadium? Pedro's Cantina is the place! This place has endless space, numerous TVs and flowing beer, making it the perfect place for a pre-baseball game meal or to catch the Warriors game. \n\nStopped by here last night to watch Game 5 for the Warriors and the place was packed! We snagged a table upstairs, where you order all your drinks and food from the bar. Service is quick and the bartenders are friendly. We ordered some beers and a burrito blow. The food was served so fast! Arrived at our table in about 5 minutes. The burrito bowl was good, fresh veggies, gooey cheese and some good guac. The prices are standard for the area, ranging from $10 - $20 for appetizers and mains dishes. \n\nI would certainly return here if I am looking to watch sports! I really enjoyed my time here as it's a great atmosphere to watch the game with friends.", "rating": 4, "date": "2016-06-14"}, {"excerpts": ["Food was great, I recommend the burrito bowl with asada. ", "Its very spacious for me and my big group of friends. ", "The vibe is on point. ", "Now let's just make these playoffs Giants!!!"], "author": "Zakary D.", "review": "If you want to find a sports bar with dedicated sports fans and servers this is the place to go too. It's right across from AT&T park so its a convenient place to hit right before the game. Service is fast and they have multiply bars to choose from. Food was great, I recommend the burrito bowl with asada. Its very spacious for me and my big group of friends. The vibe is on point. Now let's just make these playoffs Giants!!!", "rating": 5, "date": "2016-08-28"}, {"excerpts": ["The burrito bowl... never again! ", "It looked like it had ingredients straight out of Taco Bell. ", "The meat tasted like it pre-washed in water and no seasoning was added to it. ", "Quite dry. "], "author": "Marissa P.", "review": "I'm going to have to agree with all the other reviews for Pedro's Cantina:\n--The place is GREAT for viewing sports games\n--The food needs some improvement\n\nI went to Pedro's Cantina to view the World Cup Final last weekend and am so thankful we chose Pedro's. Why? Because we had great seats and view of the game the entire time. If you are worried that there will be conflicting games, Pedro's has multiple channels on at once. For instance, this Sunday they had the World Cup on the projectors and most of the TVs, but also had ESPN and the Giants game playing on the corner TVs. \n\nNow on food--I didn't even attempt to try the salsa due to previous reviews. Even though the menu read 'home made' chips, the salsa still looked like it came out of a chunky tomato can. The breakfast menu was actually really good, but they can improve on their portions. Irish coffee was largely sized and good, but I'd skip on the margarita. The sangria, which is $7, was decently proportioned and delicious. The burrito bowl... never again! It looked like it had ingredients straight out of Taco Bell. The meat tasted like it pre-washed in water and no seasoning was added to it. Quite dry. Definitely do not go to Pedro's if you are trying to have authentic Mexican Food.\n\nOur server was also really attentive contrary to other reviews. She never seemed pushy and was quick to give us our check. I will definitely return to watch another game, preferably with a full stomach!\n\nI gave it 3 stars [1 star for the food and 5 stars for the ambience]", "rating": 3, "date": "2014-07-15"}, {"excerpts": ["I guess the waiter didn't hear correctly because I was brought a burrito bowl instead.  ", "It looked good so instead of sending it back for the burrito, I stuck with the bowl.  ", "The bowl overall was good but the carnitas meat was awful!! ", "It was burnt and fatty.  ", "I cannot believe that the chef didn't notice all the fatty meat that he was putting into the food. ", "Most of the meat was not edible. "], "author": "Brittany N.", "review": "I love this place normally, but my last experience before a Giant's game was less than stellar.  My boyfriend and I go here before every game, we normally get drinks and share the nachos.  This time we decided to get burritos.  My boyfriend got the surf n turf burrito which he said was ok. I got the carnitas burrito (at least that's what I ordered).  I guess the waiter didn't hear correctly because I was brought a burrito bowl instead.  It looked good so instead of sending it back for the burrito, I stuck with the bowl.  The bowl overall was good but the carnitas meat was awful!! It was burnt and fatty.  I cannot believe that the chef didn't notice all the fatty meat that he was putting into the food. Most of the meat was not edible. Very disappointing. \n\nClean bathrooms, ok service, awful carnitas but good drink deals", "rating": 2, "date": "2015-06-03"}, {"excerpts": ["The food's been OK... the burrito bowl I just had was actually pretty good.\n\n"], "author": "G M.", "review": "I've been here a couple of times now, once with a NFL playoff game on the big screens, and a few days ago before a Giants game.\n\nThe food's been OK... the burrito bowl I just had was actually pretty good.\n\nBut I'm upset that when I ordered two pints of Lagunitas IPA, the waiter brought them in little plastic disposable cups, nowhere near a pint.  I asked him how big those were and he said \"14 ounces.\"  I think it was really more like 12.  I pointed out the menu said \"pint\" and he said, \"That's just what they put down to mean \"glass.\"  \n\nWell that's crazy.  People at other tables had full pint glassware.  I mentioned it to another waitress and she said \"OK\" but didn't do anything about it.\n\nI don't know if his decision was inadvertent, malicious, or racist, but I'm not going back.  That's horrible service.  Plus I had to find the guy myself to get a check and again to pay it.", "rating": 2, "date": "2015-05-22"}, {"excerpts": ["two words: burrito bowl.\n\n"], "author": "Kailey O.", "review": "two words: burrito bowl.\n\nEasiest place to get a drink before/after a Giants game! tons of TVs all around and a great meeting spot to find your group before heading into the game.", "rating": 4, "date": "2012-05-06"}, {"excerpts": ["I got a burrito bowl, with pinto beans, carne asada, and no rice.  ", "The carne asada was a bit lacking in the  flavor department, and it was also a little on the tough side.  ", "Considering the similar burrito bowl at Chipotle is much better, I can't imagine that I'd ever get the burrito bowl at Pedro's again. ", "Check that", ", I can't imagine that I'd ever go to Pedro's again."], "author": "Nadeem A.", "review": "I dropped in for lunch on a weekday, and the place was pretty empty.  We sat at the bar and got super fast service.  I imagine things change when there's an upcoming Giants game, since this place is right across the street from the stadium.\n\nAnyway, on to important business.  I got a burrito bowl, with pinto beans, carne asada, and no rice.  The carne asada was a bit lacking in the  flavor department, and it was also a little on the tough side.  After dousing the bowl with Tapatio, it was edible.\n\nConsidering the similar burrito bowl at Chipotle is much better, I can't imagine that I'd ever get the burrito bowl at Pedro's again. Check that, I can't imagine that I'd ever go to Pedro's again.", "rating": 2, "date": "2012-06-07"}, {"excerpts": ["but I was really disappointed in my burrito bowl."], "author": "Ryan M.", "review": "The location is great and the space is perfect for watching sports but the food is awful. I don't understand why everything comes in paper or plastic. Why don't they have dishes? $8 for guacamole was way overpriced! I appreciated the good service and prompt refill of drinks but I was really disappointed in my burrito bowl.", "rating": 2, "date": "2013-10-22"}, {"excerpts": ["My friend ordered a burrito bowl, and i had a regaler chicken burrito and everything was delicious, the burrito had taste! ", "and lots of meat, and the best part was that it was juicy with flavor, not just juicy just because its sloppy and messy, but it was everything in the right proportions. ", "Definitely Now one of my favorite places to get a burrito.\n", "When i went it was really empty ", "so we got our food fast and our waitress was really nice, and talked to us and the place is huge, so overall a good experience for me."], "author": "Alvin B.", "review": "i was on the job, and my co-worker told me about this spot, so we sat down and had a little lunch brake, this food was delicious and the portions were big. My friend ordered a burrito bowl, and i had a regaler chicken burrito and everything was delicious, the burrito had taste! and lots of meat, and the best part was that it was juicy with flavor, not just juicy just because its sloppy and messy, but it was everything in the right proportions. Definitely Now one of my favorite places to get a burrito.\nWhen i went it was really empty so we got our food fast and our waitress was really nice, and talked to us and the place is huge, so overall a good experience for me.", "rating": 4, "date": "2012-03-09"}, {"excerpts": ["I always stick with the street tacos and will try the burrito bowl next time. \n\n"], "author": "Mike R.", "review": "This place is all about pre game festivities, street tacos, drinking beer, and watching games on the TVs.\n\nStay away from the mixed drinks because they are horrible, and stick to draft or bottled beer.\n\nService is so so depending on which section you sit in.\n\nI always stick with the street tacos and will try the burrito bowl next time. \n\nThe ambiance is great and it becomes quite crowded before the Giant games and there are always pretty ladies in the house.\n\nPedros is still my go-to place in Soma and worth trying out.", "rating": 3, "date": "2012-05-07"}], "pollo verde": [{"excerpts": ["So far I've had their carnitas, machaca beef (shredded beef), pollo verde, and carne asada tacos.  ", "They're all really tasty and you have your choice of 2 different tapatios, cholula, and tabasco.  ", "The waitress will also bring you two bottles of their housemade green and red salsas.\n", "On a regular day, I've also had their ceviche, enchiladas, and pork carnitas, which are all decent but seriously, go for HH.  ", "It'll make you happy."], "author": "Nina L.", "review": "They have a pretty cool HH special that occurs every non-game day from 4-7 pm.  Maybe not on weekends too.  \n\nAnyhoo...they have really tasty $1 street tacos (6 different kinds) and serve $4 beers (whatever's on tap) and a $5 margarita.  On top of that, they serve free chips and salsa!  Yay!  So far I've had their carnitas, machaca beef (shredded beef), pollo verde, and carne asada tacos.  They're all really tasty and you have your choice of 2 different tapatios, cholula, and tabasco.  The waitress will also bring you two bottles of their housemade green and red salsas.\nOn a regular day, I've also had their ceviche, enchiladas, and pork carnitas, which are all decent but seriously, go for HH.  It'll make you happy.", "rating": 4, "date": "2011-02-24"}], "braised beef": [], "chips salsa  guacamole": [], "bowl of guacamole": []}