{"petite chocolate scone": [], "petite lemon currant scone": [], "cheese scone": [], "fat free apricot oatmeal scone": [], "blackberry raspberry scone": [], "cranberry walnut scone": [], "reduced fat fruit  nut scone": [], "cream currant scone": [], "reduced fat berry peach scone": [], "iced maple nut scone": [], "iced lemon curd scone": [], "butter croissant": [], "chocolate croissant": [], "almond croissant": [], "ham and swiss cheese croissant": [], "spinach empanda": [], "morning bun": [], "fresh apple pastry": [], "blueberry sweet cheese pastry": [], "coffee of the day": [{"excerpts": ["meaning they do have a  (different) coffee of the day. "], "author": "Victor G.", "review": "Peet's i seldom go to but may since their coffee policy is more lenient. meaning they do have a  (different) coffee of the day. today's was \"holy blend\" which i misheard to be \"house blend\".\n\ni asked can i have \"dickinson\" instead?  to my surprise, the cashier said \"yes. it will take a few minutes\". \n\nbrew: \"dickison\" (2)\n-same price as the regular. so cool!\n-dickison smooth yet very bold flavor, definitely a dark roast\n4.5 stars\n\ndrips:\n-not familiar with peet's setup, seems more informal \nnot rigid like starbux.-\n-brew ready within minutes. am now a fan\n-may check in sometimes to check out brew of the day.....", "rating": 4, "date": "2013-10-28"}], "peets to go": [], "iced caramel latte": [{"excerpts": ["While the other Peets near Bed Bath & Beyond made me fall in love with the Iced Caramel Latte but the excessive wait time for my friend's drink makes me never want to go back there. ", "The cashier in this Peet's was friendly and comfortable to talk to and the drink was done in a timely manner (within 5mins of ordering) and taste like it's suppose to. ", "If I ever go to the Potrero area I will definitely drop by again."], "author": "Annie T.", "review": "I've been to many Peets in the city but this is the only one that stands out to me. While the other Peets near Bed Bath & Beyond made me fall in love with the Iced Caramel Latte but the excessive wait time for my friend's drink makes me never want to go back there. The cashier in this Peet's was friendly and comfortable to talk to and the drink was done in a timely manner (within 5mins of ordering) and taste like it's suppose to. If I ever go to the Potrero area I will definitely drop by again.", "rating": 4, "date": "2012-07-07"}], "loose leaf teas": [], "tea bags": [], "masala chai latte": [], "jasmine lime tea cooler": [{"excerpts": ["The Jasmine Lime Tea Cooler is just the BEST!\n\n"], "author": "Karla F.", "review": "All Peet's are superior!!!  So, it's not really fair to just review this one.  But, really I just can't go through all of the Peet's that I have been to in the City.  I am just getting too old for all of that.  Since this is the one I go to the most; they get ALL THE LOVE!\n\nSeriously, I am all choked up here trying to express my love for Peet's with mere words.\n\nI ADORE CONSISTENCY!  I NEVER worry about the quality of my beverage or service at Peet's because it is always stellar!\n\nThey make the BEST soy lattes (special thanks to the guy at the California street location who leaves and espresso sunshine in my beverage EVERY time).\n\nThe Jasmine Lime Tea Cooler is just the BEST!\n\nEven the VEGAN SCONES are good and I am the biggest meat eater EVER!\n\nService at Peet's (even the locations downtown with long lines and pushy, impatient customers) is always quick and with a smile.\n\nThanks Peet's!  I appreciate you...all of you!", "rating": 5, "date": "2008-10-17"}], "english breakfast": [], "irish breakfast": [], "scottish breakfast": [{"excerpts": ["the Scottish Breakfast looseleaf tea is delicious. ", "I go through a ton of this stuff...."], "author": "Rachel M.", "review": "So it's almost a year later and I thought I'd review this Peet's again!\nMy original comments about the service still stand. It's really some of the best customer service I've EVER experienced, and I experience it EVERYTIME I GO TO THIS PEET'S, NO JOKE.\n\nI come here in the morning for a thermos full of coffee. The staff is always so nice and they have excellent customer service. \nAt this point I don't even have to tell them what I would like, they just grab my thermos and fill it up! Seriously, Peet's beats Starbucks by a million times... And I'd say this is the best Peet's I've been to in SF...\n\nOH: and the Scottish Breakfast looseleaf tea is delicious. I go through a ton of this stuff....", "rating": 5, "date": "2007-01-05"}], "russian caravan": [{"excerpts": ["Try the Russian Caravan if you are a hard core caffeine freak who doesn't do coffee, it's as close as you can get."], "author": "Colleen B.", "review": "I used to go to the Peet's in my office building on 2nd and Mission and then my new job allows me the comfort of this Peet's...which I must say is hands down better. The line at the SOMA shop was always long until I was about to fade. The staff, while friendly wasn't as amazing at the Potrero Hill barristas. I was shocked one day while ordering my tea and they guy asked me if I wanted it steeped or something, I wasn't listening and I just said...no it's to go thanks. Then he made my loose leaf tea but removed the leaves before he gave it to me. Perhaps it was because they had the time to actually make an impeccable cup of tea, but color me impressed. When I got my tea and was stumped by the lack of leaves he motioned to me and said that they typically brew the tea in a pot and steep it until it's ready then they transfer it to a to go cup. WOW! \nTry the Russian Caravan if you are a hard core caffeine freak who doesn't do coffee, it's as close as you can get.", "rating": 5, "date": "2006-02-16"}], "pumphreys blend": [], "pride of the port": [], "earl grey with bergamot": [], "earl grey with lavender": [], "black currant": [], "decaffeinated english breakfast": [], "assam golden tip": [], "assam extra fancy": [], "darjeeling choice": [], "darjeeling fancy": [], "darjeeling extra fancy kalimpong": [], "ceylon fancy": [], "lion mountain keemun": [], "yunnan fancy": [], "ti kwan yin": [], "phoenix mountain oolong": [], "gunpowder": [{"excerpts": ["Today I tried the Gunpowder Organic, which tastes like a mix of hay and dirt...."], "author": "Anna S.", "review": "Thank you Peet's for giving me such a BIG list of teas to choose from!  I am on my 8th day of NO coffee, and Starbucks teas are pretty lame, in my opinion.  \n\nYesterday I tried the Jasmine Fancy.  It was pretty good.  Today I tried the Gunpowder Organic, which tastes like a mix of hay and dirt....but it's fun to try different ones anyway.\n\nI'll probably be back tomorrow...tea update to come!", "rating": 4, "date": "2011-01-28"}], "hubei silver tip": [], "sencha": [], "lung ching dragonwell": [], "genmai cha": [], "jasmine fancy": [{"excerpts": ["Yesterday I tried the Jasmine Fancy.  ", "It was pretty good.  "], "author": "Anna S.", "review": "Thank you Peet's for giving me such a BIG list of teas to choose from!  I am on my 8th day of NO coffee, and Starbucks teas are pretty lame, in my opinion.  \n\nYesterday I tried the Jasmine Fancy.  It was pretty good.  Today I tried the Gunpowder Organic, which tastes like a mix of hay and dirt....but it's fun to try different ones anyway.\n\nI'll probably be back tomorrow...tea update to come!", "rating": 4, "date": "2011-01-28"}], "yin hao jasmine": [], "xiaos blend": [], "pure peppermint": [], "hibiscus c blend": [], "chamomile": [], "lemon rose": [], "golden dragon oolong": [], "jasmine downy pearls": [], "mocha freddo": [], "chocolate  caramel swirl": [], "matcha green tea freddo": []}