{"piece vegetable pot stickers": [], "piece steamed bao": [], "piece vegetarian egg rolls": [], "onion pancakes": [{"excerpts": ["would not order again\n\nfried rice with pork = greasy white rice with fatty pork\nfried wontons = fried wontons with one piece of pork folded in the corner\nonion pancakes were ok."], "author": "Emma M.", "review": "would not order again\n\nfried rice with pork = greasy white rice with fatty pork\nfried wontons = fried wontons with one piece of pork folded in the corner\nonion pancakes were ok.", "rating": 1, "date": "2016-06-12"}, {"excerpts": ["The green onion pancakes are thin, crispy, & greasless; the right amount of onions & wonde34rful with the smooth peanut sauce.  ", "The basil chicken, a Taiwanese dish, is wonderful with tender chicken, leeks, & fresh basil in a wonderful sauce.  "], "author": "Brian S.", "review": "I came here last night after an appointment at UCSF as I love trying a new place each time I am up hyere.  Nancy is very nice & ames to please.  I love the traditional dacor including the chairs with the backsw having a traditional Chinese design.  The boiled meat dumplings are very fragrent with a perfectly thin wrapper & ground pork & spice filling; perfect with soy sauce.  The green onion pancakes are thin, crispy, & greasless; the right amount of onions & wonde34rful with the smooth peanut sauce.  The basil chicken, a Taiwanese dish, is wonderful with tender chicken, leeks, & fresh basil in a wonderful sauce.  The bean sauce noodles are wonderful with aldente noodles, ground beef, pickled vegetables, soy beans, & a very flavorful bean sauce; I have plenty of leftovers for lunch today.  My mother, who is gluten intollerent, enjoyed her beef chow fun.  Round it off with a large Tsing Tao & some tea & you will not be disappointed.  Though premiture, we enjoyed hearing KOIT's Christmas music & they also had Chinese TV going.  They have a lot of regulars as Nancy knows a lot of them.  Keep up the good work guys Nancy & staff.", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["We ordered 2 orders of the shanghai dumplings, one order of the shanghai noodles, green onion pancakes and potstickers-  "], "author": "M W.", "review": "I find myself coming back everytime I crave for shanghai dumplings and noodles. The lady who owns the place is super friendly as well as the rest of the staff. We ordered 2 orders of the shanghai dumplings, one order of the shanghai noodles, green onion pancakes and potstickers-  total was $28.00. \n\nWhat a hidden gem!", "rating": 5, "date": "2010-01-17"}, {"excerpts": ["Came here to try out their Xiao Loong Baos and Onion Pancakes.\n\n", "Onion pancakes\nSizzling rice soup\nChef's Chicken with basil\n\n", "Onion pancakes are one of my fav dishes....", "the ones here were a little disappointing. ", "Just a tad too oily....", "but it was cripsy. "], "author": "Christina T.", "review": "Came here to try out their Xiao Loong Baos and Onion Pancakes.\n\nA friend of a friend actually owns this and recommended to try it if I liked spicy foods.\n\nI was with the bf who is totally weaksauce on anything spicy, so we avoided ordering any items with more than 1 chilli pepper on the menu.\n\nDishes we got:\nXiao Loong bao\nCrab Xiao Loong bao - never seen this before, so we HAD to try it.\nOnion pancakes\nSizzling rice soup\nChef's Chicken with basil\n\nMy family is a huge xiao loong bao fan so we eat it pretty often. From my experiences, I think Peking had OK ones. I mean, the skin wasn't too thick or too thin, but the thinner the better. The soup inside these little treasures are THE most important. The soup in the ones here weren't as flavorful as I wanted them to be, but for some place in the sunset, I'd come back! Saves me a trip to c-town! In addition to the regular ones, the crab ones were pretty tasty too. The crab meat I expected were softer but it's alright. If I were to choose to order the regular or crab ones next time, it'll definitely be the regular ones.\n\nOnion pancakes are one of my fav dishes....the ones here were a little disappointing. Just a tad too oily....but it was cripsy. I think the ones I prefer would be thinner and flakier. \n\nThe sizzling soup was delish...good amounts of veggies and scallops. Maybe just a bit on the salty side, but not bad. A good soup to try out!\n\nLast, the Chef's chicken with basil. It came wrapped in foil. You open it up, and the strong scent of basil and spices come out. Yum!! They use white meat chicken, so that's a super plus for me! It wasn't too spicy, but it was perfect for some weaksauce I was sitting across from. I think this was one of my fav dishes here tonight. \n\nI would recommend trying out this place if you like xiao loong baos and love shanghai food....I'm definitely coming back here to try some of their other dishes!!", "rating": 4, "date": "2010-04-07"}, {"excerpts": ["Try the Pot stickers, the chicken salad, onion pancakes, the combo chow mein or combo fried rice. ", "The best hot and sour , won ton, and sizzling rice soups on the planet, (his broth makes all the difference in the world). ", "The garlic chicken, and kung pao chicken the Mongolian beef, mango beef and the Sze-chuan prawns are all unique and all incredibly good. ", "I can go on and on about their wonderful dishes. ", "I've honestly looked for over 20 years to find a better and closer Chinese restaurant to my house in San Ramon, but you simply can't beat Peking. ", "John the owner is a master trained chef, and his wife and staff are so warm and friendly and always remember me, my wife and kids by name. ", "I really, really love this place."], "author": "Johny A.", "review": "I've been coming here since 1987. My gung fu Sifu, who was from HK brought me here. He said that he had eaten at many Chinese places around the US, Canada, and throughout Asia and he said that the chef here is outstanding. I fell in love with this place right away and can't find a better Chinese restaurant anywhere in the bay area. It's not fancy or trendy, but the food is amazing. Sure I've had off meals, but for the most part it's consistently great. My wife and all of her family also come here. My sister in law went to Paris and was taken to this trendy new, highly rated Eurasian fusion restaurant. After spending over $100.00 per person she said that Peking was way better. Try the Pot stickers, the chicken salad, onion pancakes, the combo chow mein or combo fried rice. The best hot and sour , won ton, and sizzling rice soups on the planet, (his broth makes all the difference in the world). The garlic chicken, and kung pao chicken the Mongolian beef, mango beef and the Sze-chuan prawns are all unique and all incredibly good. I can go on and on about their wonderful dishes. I've honestly looked for over 20 years to find a better and closer Chinese restaurant to my house in San Ramon, but you simply can't beat Peking. John the owner is a master trained chef, and his wife and staff are so warm and friendly and always remember me, my wife and kids by name. I really, really love this place.", "rating": 5, "date": "2011-12-17"}], "piece boiled meat dumpling": [], "piece boiled meat with chinese chive dumplings": [], "piece boiled shrimp dumplings": [], "chinese chive pancakes": [{"excerpts": ["The Chinese chive pancakes are more like p'zone with stuffing.  "], "author": "Ryan Y.", "review": "Tried something new for delivery and this was top rated in the restaurants that were near me.  I got Kung Pao Chicken, Pot Stickers, Chinese Chive Pancake, Boiled Meat Dumpling, and free pork chow fun.  \n\nThe pot stickers were delishous and the sauce that came with them were very yum.  I loved the chow fun! But i think i could eat those noodles every day every meal.  The Chinese chive pancakes are more like p'zone with stuffing.  Better to eat this one fresh from the kitchen where it's still hot and crispy.  \n\nThe rest of the meal was just so so.  The kung pao chicken i felt was bland.  There was little flavor, but it's such a common dish.  The boiled meat dumplings were the same bland flavor, but the dipping sauce for it made up for that.  \n\nAlso, I forgot to order rice with my meal, but luckily I'm asian so I have a rice pot that always has at least some rice in it at all times!~", "rating": 3, "date": "2010-10-22"}], "combination hot appetizers for": [], "boiled egg with chinese chives dumplings": [], "peking dinner for": [], "szechuan dinner for": [], "chefs dinner for": [], "delight sizzling rice soup": [], "spinach and tofu soup": [], "sweet corn with chicken soup": [], "crab meat with asparagus soup": [], "minced beef  crab meat soup": [], "seafood deluxe soup": [], "hunan style beef": [{"excerpts": ["hearty, has lots of tofu, that black seaweed thingy, has a definite kick and prawns!), the beef chow fun (not too bad, a little bit on the bland side, needs some more seasoning or sauce) and the hunan style beef (the sauce tastes great...the beef itself didn't taste like beef at all, just very chewy fatness, and not the gooey good kind either).  \n\n "], "author": "Lulu C.", "review": "I had a craving for some good ol' chinese food...and was so overwhelmed by all the results that came up on Yelp, that i just said screw it. i'm just gonna drive down to Noreiga (closest) and hopefully pop into something.  I decided after looking down at my gas gauge that Peking Restaurant would have to do. \n\n  I ordered the hot & sour soup (delicious! hearty, has lots of tofu, that black seaweed thingy, has a definite kick and prawns!), the beef chow fun (not too bad, a little bit on the bland side, needs some more seasoning or sauce) and the hunan style beef (the sauce tastes great...the beef itself didn't taste like beef at all, just very chewy fatness, and not the gooey good kind either).  \n\n All in all, the hot & sour soup was worth it.", "rating": 2, "date": "2008-10-08"}], "snow peas with beef": [], "beef with fresh mixed vegetables": [], "beef with black mushrooms  bamboo shoots": [], "peking beef": [{"excerpts": ["Their Peking beef, chow mein, and garlic chicken are delicious, but so are the other dishes on their fairly long menu. ", "Service is great and friendly- ", "they treat us like family here. ", "Highly recommend. ", "They can accommodate large family dinners pretty easily, too."], "author": "Ed S.", "review": "Family has been coming here since 1984. Hasn't changed much, and that's what keeps us coming back. Their Peking beef, chow mein, and garlic chicken are delicious, but so are the other dishes on their fairly long menu. Service is great and friendly- they treat us like family here. Highly recommend. They can accommodate large family dinners pretty easily, too.", "rating": 5, "date": "2017-09-10"}, {"excerpts": ["Their walnut prawns, garlic string bean chicken, Peking beef, and won ton soup, are the best I have tried and I have been to at least 20 Chinese restaurants in my life. ", "The prices are great, and the service is amazing. ", "They sort of treat you like family, especially if you come there often ", ":)."], "author": "Lina K.", "review": "It has been my favorite restaurant since 1995, when I move to the US and used to live a couple of blocks away from this place. \nI still love this place, even though I do not get to come here often from, since I live in San Jose.\nTheir walnut prawns, garlic string bean chicken, Peking beef, and won ton soup, are the best I have tried and I have been to at least 20 Chinese restaurants in my life. The prices are great, and the service is amazing. They sort of treat you like family, especially if you come there often :).", "rating": 5, "date": "2011-11-16"}, {"excerpts": ["Peking beef came out next.  ", "I've never really noticed any adverse effects to eating MSG, but I'm sure it was in the food.  ", "Still, how can you give up a great dish just because of the umami components?  ", "The beef was perfectly light crisp-fried and had garlic, green onions, and ginger--all of which I'm a major fan!  ", "This really hit the spot with me.  "], "author": "Brent A.", "review": "I'll start by saying this place looked dingier than the others on this small block, but we decided to come here.  The primary reason was that I had brought a credit card and most of the places around took cash only or a different type of cc.\n\nThe staff here was extremely nice.  We had three different people waiting on us, which made everything very efficient and pleasing to my serving days of time past.\n\nThe first dish we ordered was the Seaweed Egg Flower soup.  When they brought it out, it looked amazing.  The taste, however, was a little lacking.  It really didn't set a good first impression as I noticed the peas had seemingly come from a frozen bag and the mushrooms were just slightly gritty, but overall it wasn't bad.  \n\nThe next dish, the Hong Kong style crispy noodles were really good.  I actually enjoyed these a lot.  It had plenty of meat and vegetables on top of the very crispy noodles.  This certainly set a better tone with me.  Peking beef came out next.  I've never really noticed any adverse effects to eating MSG, but I'm sure it was in the food.  Still, how can you give up a great dish just because of the umami components?  The beef was perfectly light crisp-fried and had garlic, green onions, and ginger--all of which I'm a major fan!  This really hit the spot with me.  It certainly ended my dining experience well.\n\nAll-in-all this isn't a bad little joint.  It certainly wasn't the busiest on the block, which leads me to believe I may want to come back and check out those places as well, but this place was fine in its own right.", "rating": 3, "date": "2009-08-10"}, {"excerpts": ["Peking restaurant had only one signature dish worth trying - Peking beef.  ", "It was my favorite thing to order here; one might even call it my guilty pleasure.  ", "Today my two friends and I went to Peking for a late lunch/early dinner.  ", "We ordered some appetizers while I was waiting for my Peking beef.\n\n", "I am not sure whether they changed the chef or otherwise messed with near perfection, but it wasn't the Peking beef of yore.   ", "It was a greasier, fatter, blander, doughier version of the dish I had grown to love.  "], "author": "Yan G.", "review": "I cannot believe I just awarded Peking 3 stars.  I used to love this place.  However, it all changed today.  How sad.\n\nLet's step back for a moment.  I started coming here ten years ago, and the place never disappointed.  On the outside, it's your typical Chinese restaurant with your usual decor and your usual fish tanks.  \n\nHowever, if you dig a little deeper, you'd find out something else.  It's the kind of place where the owners, a.k.a. the waiter and the waitress, are always nice, helpful, friendly and even funny.  It's the kind of place where I used to tip even when I got takeout because I wanted to be nice.  It's the kind of place where the hot and sour soup is so good, my dad swears it has the ability to cure a cold.\n\nAll the food here is good, but not spectacular.  Peking restaurant had only one signature dish worth trying - Peking beef.  It was my favorite thing to order here; one might even call it my guilty pleasure.  Today my two friends and I went to Peking for a late lunch/early dinner.  We ordered some appetizers while I was waiting for my Peking beef.\n\nWhen my dish came, I noticed that something wasn't quite right.  My dish looked . . . different.  I am not sure whether they changed the chef or otherwise messed with near perfection, but it wasn't the Peking beef of yore.   It was a greasier, fatter, blander, doughier version of the dish I had grown to love.  I was so shocked and disappointed, even the crispy rice noodles didn't cheer me up.\n\nI never thought I'd say this, but I don't think I have a reason to come back to Peking.  The fortune cookie, however, was dead on.  It promised me a \"pleasant journey to a faraway destination\" right after I booked a trip to the East Coast.  How did they know???", "rating": 3, "date": "2008-11-02"}], "teriyaki beef": [], "beef with black pepper": [], "beef with basil": [], "hot spiced shredded pork": [], "sauteed dry string beans with pork": [{"excerpts": ["Sauteed dry string beans with pork ($7.95) ", "http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#E4h6JAsQwoLOGs0T9ybILA\n", "*Marinated jelly fish ($8.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#EjqO_tbEH7rk2XJkRl1kTQ\n", "*", "Beef chow fun ($6.95) ", "http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#7vHJ8TVPidrRv2t75a2tGg\n", "*", "Wonton soup (small $4.95) "], "author": "Elena N.", "review": "I typically only have Chinese food (other than dim sum) when I have dinner with the family or when I order delivery. Wanting to try a new place, the roommate and I ordered delivery through delivery dot com.\n\nDecember 2013\n*Hot spiced house chicken ($7.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#ZhRKalCL3RqP_bXKq-s-nA\n*Mixed fried rice ($6.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#8KNqiZGs51QRZbUGzvn-Cg\n*Sauteed dry string beans with pork ($7.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#E4h6JAsQwoLOGs0T9ybILA\n*Marinated jelly fish ($8.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#EjqO_tbEH7rk2XJkRl1kTQ\n*Beef chow fun ($6.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#7vHJ8TVPidrRv2t75a2tGg\n*Wonton soup (small $4.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#28fPG-1fJxagRRejOJs0HA\n\nI'd been through a string of getting tasteless beef chow fun so I was pleasantly surprised when Peking restaurant's version was full of flavor. I didn't have to add anything to give it taste! The green beans were good too. Still retained a nice crunch. The roommate ordered the chicken since he wanted to try something new. It wasn't very good and not really that spicy. It did have black mushrooms which I love eating. The rest of the dishes were pretty average.\n\nDecent chinese food and pretty good prices for delivery.", "rating": 4, "date": "2015-03-01"}], "szechuan hot spicy ma po tofu": [], "mushi pork with  pancakes": [], "hunan tea smoked pork": [], "peking style sweet  sour rib": [], "pork chops with pepper salt  chili": [], "szechuan spices spareribs": [], "shanghai spareribs": [], "sauteed pork with dry bean curd": [], "pork with beans thread noodles": [], "sauteed shredded pork with yellow chives  dry bean curd": [], "hot spiced house chicken": [{"excerpts": ["*Hot spiced house chicken ($7.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#ZhRKalCL3RqP_bXKq-s-nA\n", "*", "Mixed fried rice ($6.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#8KNqiZGs51QRZbUGzvn-Cg\n", "*"], "author": "Elena N.", "review": "I typically only have Chinese food (other than dim sum) when I have dinner with the family or when I order delivery. Wanting to try a new place, the roommate and I ordered delivery through delivery dot com.\n\nDecember 2013\n*Hot spiced house chicken ($7.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#ZhRKalCL3RqP_bXKq-s-nA\n*Mixed fried rice ($6.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#8KNqiZGs51QRZbUGzvn-Cg\n*Sauteed dry string beans with pork ($7.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#E4h6JAsQwoLOGs0T9ybILA\n*Marinated jelly fish ($8.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#EjqO_tbEH7rk2XJkRl1kTQ\n*Beef chow fun ($6.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#7vHJ8TVPidrRv2t75a2tGg\n*Wonton soup (small $4.95) http://www.yelp.com/biz_photos/peking-restaurant-san-francisco#28fPG-1fJxagRRejOJs0HA\n\nI'd been through a string of getting tasteless beef chow fun so I was pleasantly surprised when Peking restaurant's version was full of flavor. I didn't have to add anything to give it taste! The green beans were good too. Still retained a nice crunch. The roommate ordered the chicken since he wanted to try something new. It wasn't very good and not really that spicy. It did have black mushrooms which I love eating. The rest of the dishes were pretty average.\n\nDecent chinese food and pretty good prices for delivery.", "rating": 4, "date": "2015-03-01"}], "peking style fried chicken wings": [], "chicken with basil": [{"excerpts": ["Onion pancakes\nSizzling rice soup\nChef's Chicken with basil\n\n", "Last, the Chef's chicken with basil. ", "It came wrapped in foil. ", "You open it up, and the strong scent of basil and spices come out. ", "Yum!! ", "They use white meat chicken, so that's a super plus for me! ", "It wasn't too spicy, but it was perfect for some weaksauce I was sitting across from. "], "author": "Christina T.", "review": "Came here to try out their Xiao Loong Baos and Onion Pancakes.\n\nA friend of a friend actually owns this and recommended to try it if I liked spicy foods.\n\nI was with the bf who is totally weaksauce on anything spicy, so we avoided ordering any items with more than 1 chilli pepper on the menu.\n\nDishes we got:\nXiao Loong bao\nCrab Xiao Loong bao - never seen this before, so we HAD to try it.\nOnion pancakes\nSizzling rice soup\nChef's Chicken with basil\n\nMy family is a huge xiao loong bao fan so we eat it pretty often. From my experiences, I think Peking had OK ones. I mean, the skin wasn't too thick or too thin, but the thinner the better. The soup inside these little treasures are THE most important. The soup in the ones here weren't as flavorful as I wanted them to be, but for some place in the sunset, I'd come back! Saves me a trip to c-town! In addition to the regular ones, the crab ones were pretty tasty too. The crab meat I expected were softer but it's alright. If I were to choose to order the regular or crab ones next time, it'll definitely be the regular ones.\n\nOnion pancakes are one of my fav dishes....the ones here were a little disappointing. Just a tad too oily....but it was cripsy. I think the ones I prefer would be thinner and flakier. \n\nThe sizzling soup was delish...good amounts of veggies and scallops. Maybe just a bit on the salty side, but not bad. A good soup to try out!\n\nLast, the Chef's chicken with basil. It came wrapped in foil. You open it up, and the strong scent of basil and spices come out. Yum!! They use white meat chicken, so that's a super plus for me! It wasn't too spicy, but it was perfect for some weaksauce I was sitting across from. I think this was one of my fav dishes here tonight. \n\nI would recommend trying out this place if you like xiao loong baos and love shanghai food....I'm definitely coming back here to try some of their other dishes!!", "rating": 4, "date": "2010-04-07"}], "chicken with snow pea  straw mushroom": [], "chicken with vegetable deluxe": [{"excerpts": ["what we ordered: \nChicken with Vegetable Deluxe\nHong Kong Style Crispy Noodle\nfree: chicken salad\n \n"], "author": "Ivan D.", "review": "So gf and i were getting hungry and decided to order off of grubhub and found this place and decided to try it.\n\nwhat we ordered: \nChicken with Vegetable Deluxe\nHong Kong Style Crispy Noodle\nfree: chicken salad\n \nthe good:\n-came in 20 minutes which was less than the 48 minutes we were informed of\n-had a coupons\n-can order online\n\nTHE BAD:\n-first both dishes are extremely oily \n-second the food was very bland\n-Chicken with Vegetable Deluxe was basically thick sauce with tasteless chicken, a few cabbage, a single baby corn, maybe a mushroom or two and celery.\n-Hong Kong Style Crispy Noodle- was the biggest disappointment. small clump of fried noodles, extremely salty sauce (msg which they should go easy on), what little beef there was tasted rather stale and had very little in terms of decent ingredients.\n\nResults: my gf getting sick right after and i, 3 hrs later. i'm afraid of touching the free chicken salad.\n\ni'm guessing take out is where this place cheaps out, and maybe they r much better when u eat in person. \ni'm hoping other places in sf are not as bad otherwise i'm just gonna eat Chinese in oakland.", "rating": 1, "date": "2012-01-01"}], "triple mushrooms with chicken": [], "sizzling chicken": [{"excerpts": ["Like the previous review, we ordered the Sizzling Chicken, Beef & Broccoli, pot stickers and hot & sour soup.  ", "The beef was RANCID -- ew!!! ", "The chicken had pieces of gristle in it and the pot stickers were soggy.  ", "My boyfriend is eating the hot & sour soup, that he says he's enjoying, but I'm not brave enough.  ", "Will NOT be ordering from here again."], "author": "Jenny K.", "review": "We didn't read the Yelp reviews before ordering from Eat24 and now I'm sad we didn't.  Like the previous review, we ordered the Sizzling Chicken, Beef & Broccoli, pot stickers and hot & sour soup.  The beef was RANCID -- ew!!! The chicken had pieces of gristle in it and the pot stickers were soggy.  My boyfriend is eating the hot & sour soup, that he says he's enjoying, but I'm not brave enough.  Will NOT be ordering from here again.", "rating": 1, "date": "2012-02-19"}], "mushi chicken with  pancakes": [], "broccoli shrimp": [{"excerpts": ["I also always get the broccoli shrimp with Jalepenos and the sweet and sour chicken chicken with pineapple!"], "author": "Chung L.", "review": "Nancy is the best! My favorite Chinese food in the sunset.\n\nThe Kung-Pao chicken is soooo good over steamed white rice. \n\nI also always get the broccoli shrimp with Jalepenos and the sweet and sour chicken chicken with pineapple!", "rating": 5, "date": "2017-04-25"}], "sweet  sour shrimp": [], "black bean sauce shrimp": [], "snow pea with shrimp": [], "mandarin shrimp": [], "szechuan prawns": [{"excerpts": ["The Szechuan prawns are done to utter perfection.  "], "author": "Dan C.", "review": "This place is a Chinese food staple in the city of San Francisco.  The Szechuan prawns are done to utter perfection.  As a native this is the go to restaurant for our entire family.  \n\nAnything and everything you order from here is top notch.  This place never disappoints.", "rating": 5, "date": "2015-04-29"}, {"excerpts": ["We've moved further and further away from the place over the years, but we travel just to enjoy our all-time favorites - the best ever szechuan prawns, super tasty wonton soup and the to-die-for combo fried rice.  \n", "John the owner and chef is amazing.  ", "I hope when he retires, he'll pass on the superb recipes to the new owners.  ", "Until then, we'll keep on coming back - a 1.5 hour trip well-worth it."], "author": "Malou A.", "review": "My family has been coming to this restaurant since the early 90's. We've moved further and further away from the place over the years, but we travel just to enjoy our all-time favorites - the best ever szechuan prawns, super tasty wonton soup and the to-die-for combo fried rice.  \nJohn the owner and chef is amazing.  I hope when he retires, he'll pass on the superb recipes to the new owners.  Until then, we'll keep on coming back - a 1.5 hour trip well-worth it.", "rating": 5, "date": "2014-08-02"}], "sizzling prawns on hot plate": [], "shrimp with triple mushrooms": [], "baked prawns with salt  pepper dressing": [], "lovers prawns": [], "black bean sauce clams": [], "scallop with triple mushrooms": [], "sizzling scallops on hot plate": [], "sauteed shrimp and chicken with vegetables": [], "yellow chives with prawns  scallops": [], "sliced fish with vegetables": [], "sweet  sour sliced fish": [], "seafood party": [{"excerpts": ["Their Seafood Party was delicious and their sizzling rice soup is perfect to get over a cold."], "author": "Cecilia R.", "review": "Great family restaurant with friendly setvice and tasty food! Their Seafood Party was delicious and their sizzling rice soup is perfect to get over a cold.", "rating": 5, "date": "2016-12-07"}], "spiced shrimp with snow peas": [], "sauteed sea cucumber with scallion": [], "sauteed sea cucumber with shrimp sauce": [], "black bean sauce squid": [], "black bean sauce sliced fish": [], "salt and pepper sliced fish": [], "hong kong style crispy shrimp": [], "szechuan sliced fish": [], "snow peas with water chestnuts": [], "sauteed napa cabbage with dried shrimp": [], "snow peas with black mushrooms  bamboo shoots": [], "black mushrooms with spinach": [], "sauteed triple mushrooms": [], "black mushrooms with oyster sauce": [], "black mushrooms with tofu": [], "mushi vegetables with  pancakes": [], "dry bean curd with spinach": [], "mongolian tofu": [{"excerpts": ["Also Mongolian Tofu is really great."], "author": "Debey G.", "review": "I use this place for my Grubhub meals all the time.  They are fast and Delicious. I have never been to the restaurant but love that they are close to me and provide such great food.  I am Veg so they have great options and I even play around with Tofu and Vegetables in the Walnut Prawn sauce with Walnuts. bomb. Also Mongolian Tofu is really great.", "rating": 4, "date": "2014-09-06"}], "sizzling tofu on hot plate": [], "assorted soup noodles": [], "seafood assorted soup noodles": [], "mustard green soup noodle": [], "peking noodles": [{"excerpts": ["Their Peking noodles were really packed with delicious ingredients like napa, fungus, shrimp, beef and pork.  ", "These were both very good, Hugh portioned dishes.  ", "Perfect for a cold day!   ", "For 8 bucks this is a bargain."], "author": "Bad News S.", "review": "Outstanding soup noodles\n\nCame back for a quiet lunch on Saturday and tried the soup noodles.  The spicy beef noodles were extremely well prepared in tasty noodles with tender beef and tendons cooked to soft chewy consistency.  Their Peking noodles were really packed with delicious ingredients like napa, fungus, shrimp, beef and pork.  These were both very good, Hugh portioned dishes.  Perfect for a cold day!   For 8 bucks this is a bargain.", "rating": 4, "date": "2014-08-09"}, {"excerpts": ["When I got my Peking Noodles, I was sure it was the wrong order because there was a large soup thing that looked exactly like my hot and sour soup. ", "Upon calling the restaurant, they told me that the soup thing goes with the noodles. ", "Um, nowhere on the website does it indicate it's Peking Noodle SOUP. ", "Not what I expected, not what I wanted, not what I liked."], "author": "Cindy T.", "review": "Ordered from this place through Waiters on Wheels. When I got my Peking Noodles, I was sure it was the wrong order because there was a large soup thing that looked exactly like my hot and sour soup. Upon calling the restaurant, they told me that the soup thing goes with the noodles. Um, nowhere on the website does it indicate it's Peking Noodle SOUP. Not what I expected, not what I wanted, not what I liked.", "rating": 2, "date": "2013-09-15"}], "bean sauce noodles": [{"excerpts": ["The bean sauce noodles are wonderful with aldente noodles, ground beef, pickled vegetables, soy beans, & a very flavorful bean sauce; I have plenty of leftovers for lunch today.  ", "My mother, who is gluten intollerent, enjoyed her beef chow fun.  ", "Round it off with a large Tsing Tao & some tea & you will not be disappointed.  ", "Though premiture, we enjoyed hearing KOIT's Christmas music & they also had Chinese TV going.  ", "They have a lot of regulars as Nancy knows a lot of them.  ", "Keep up the good work guys Nancy & staff."], "author": "Brian S.", "review": "I came here last night after an appointment at UCSF as I love trying a new place each time I am up hyere.  Nancy is very nice & ames to please.  I love the traditional dacor including the chairs with the backsw having a traditional Chinese design.  The boiled meat dumplings are very fragrent with a perfectly thin wrapper & ground pork & spice filling; perfect with soy sauce.  The green onion pancakes are thin, crispy, & greasless; the right amount of onions & wonde34rful with the smooth peanut sauce.  The basil chicken, a Taiwanese dish, is wonderful with tender chicken, leeks, & fresh basil in a wonderful sauce.  The bean sauce noodles are wonderful with aldente noodles, ground beef, pickled vegetables, soy beans, & a very flavorful bean sauce; I have plenty of leftovers for lunch today.  My mother, who is gluten intollerent, enjoyed her beef chow fun.  Round it off with a large Tsing Tao & some tea & you will not be disappointed.  Though premiture, we enjoyed hearing KOIT's Christmas music & they also had Chinese TV going.  They have a lot of regulars as Nancy knows a lot of them.  Keep up the good work guys Nancy & staff.", "rating": 5, "date": "2016-11-23"}], "szechuan beef soup noodle": [], "chilled lychee fruit": [], "glazed banana": [], "glazed apples": [], "chicken salad plate": [], "cold mandarin salad plate": [], "vegetarian chicken plate": [], "beef simmered in  chinese spices": [], "marinated jelly fish plate": [], "smoked fish plate": []}