{"roasted tomato soup": [{"excerpts": ["Roasted Tomato Soup -- I LOVE tomato soup, too. ", "This soup was good, but unfortunately came out lukewarm, bordering cold for us. "], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}, {"excerpts": ["Had the Burrata Margarita Flatbread and the Roasted Tomato Soup... ", "It was DELICIOUS! ", "This place looks a little fancy, but it is very casual. ", "The staff was very prompt and polite. ", "I highly recommend giving this place a try! ", "You won't be disappointed!"], "author": "Jill F.", "review": "Had the Burrata Margarita Flatbread and the Roasted Tomato Soup... It was DELICIOUS! This place looks a little fancy, but it is very casual. The staff was very prompt and polite. I highly recommend giving this place a try! You won't be disappointed!", "rating": 5, "date": "2017-10-05"}], "house made hummus": [], "rustic meatballs": [{"excerpts": ["*Rustic Meatballs: ", "bellwether farms ricotta toast, san marzano tomato sauce, parmigiano, micro basil ($13)\n"], "author": "Elena N.", "review": "I got off work early for the holiday weekend. What does that mean? Happy hour! I arrived first on Friday, May 25th a little after 4pm. No reservation as I don't think they take them for HH. Managed to find a small round table in the front by the window. One of the boys joined me shortly after and the other about an hour later.\n\nHappy Hour: served 4pm to 6pm\n*Glass of Wine - bartender's selection: sparkling, white, red ($8)\n*Bottle of Wine Special - bartender's selection: white, red ($30)\n*Standard & Pours: one shot, one beer ($9) x3\n\nI was by myself for a good 20 mins, so I just nursed a glass of HH bubbly. I never saw the bottle, but was told it was a prosecco. When one of the boys joined me, we took part in the wine bottle special. It was National Wine Day after all. The red bottle was Chronic Cellars Suite Petite, so I believe a petite sirah. When I found out the HH shot was a four roses (I think bourbon), I decided to take part. I think our server said the beer was a racer ipa. I just took a sip and pawned it off on the boys. (I'm not a huge beer person.)\n\n*Lobster Fries ($18)\n*Steamed Mussels: PEI mussels, garlic & white wine sauce, rustic toast ($13)\n*Rustic Meatballs: bellwether farms ricotta toast, san marzano tomato sauce, parmigiano, micro basil ($13)\n*Burrata Margarita Flatbread: tomato sauce, fresh basil, olive oil ($16)\n*Talisker 18 Year, Isle of Skye ($18) x2\n*Tomintoul 16 Year, Highland ($15)\n\nThey don't have HH food specials, so we just ordered from their Afternoon Delights menu since this was basically our dinner. I adored the lobster fries. Came topped with a good amount of lobster. And that sauce. So comforting and savory. The mussels were also good. Plump and tender. We all decided to end HH with a scotch whisky. I got the Talisker as I thought it was a good deal. $1 per year is typically a great deal when it's an 18 year, right?\n\nFun place for HH. I'd definitely come back for those fries and a bottle of wine.", "rating": 4, "date": "2018-05-29"}, {"excerpts": ["Rustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\n"], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}, {"excerpts": ["We started with the Avocado Toast, which was alright as it tasted like guacamole on top of toast, the Rustic Meatballs which were surprisingly good as I'm not usually a huge fan of tomato sauce, and the Burrata Tartine which was so good, I could probably just eat it as my meal.\n\n"], "author": "Sophia Y.", "review": "Per Diem is right around the corner from our office and we decide to come for a spontaneous holiday lunch which was nice. \n\nWalking in, I really liked the interior. It was cool, simple and clean and not at all pretentious. We sat on the second floor which was nice and a little more private.\n\nWe started with the Avocado Toast, which was alright as it tasted like guacamole on top of toast, the Rustic Meatballs which were surprisingly good as I'm not usually a huge fan of tomato sauce, and the Burrata Tartine which was so good, I could probably just eat it as my meal.\n\nAs for my entree, I couldn't decide what I wanted and ended up splitting 2 dishes with a co-workers so we get the best of both worlds. We got the Wild Mushroom Pasta which was good and creamy. The fried egg on top was perfectly round. We also got the Braised Short Ribs which had great flavor and was super tender. The vegetables on that plate was cooked perfectly and tasted really good as well.\n\nOverall, it was a really good and a nice treat for lunch.", "rating": 4, "date": "2018-02-11"}, {"excerpts": ["We had the rustic meatballs, wild mushroom pasta, squid ink linguini, and apple tart which were all fantastic. ", "I had the linguini which was perfectly salted, lemony, and well-proportioned. ", "I feel like it's a great starter "], "author": "Wendy C.", "review": "Went here for a casual dinner the other night after loving it the first time my old boss took me.\n\nI love live jazz and older themed restaurants so the gold rush vibe and candles were fun to be around. They even had real books lining the walls! \n\nWe had the rustic meatballs, wild mushroom pasta, squid ink linguini, and apple tart which were all fantastic. I had the linguini which was perfectly salted, lemony, and well-proportioned. I feel like it's a great starter if you're not sure what to order here.\n\nMight've picked a bad night though because a large party was seated right next to us with mics, which had a lot of loud feedback. When the hostess was leading me to the table, the crowd wouldn't part for her and she apologized to me (definitely not her fault).", "rating": 4, "date": "2017-09-23"}, {"excerpts": ["Would reorder again, too.\n- rustic meatballs: also worth ordering again because the meatballs were super tasty and tomato-y. ", "The bread went well with the leftover cheesy sauce. ", "Meatballs were soft enough and flavorful enough.\n- mussels and fries: super generous portion again with a full bowl of fries. ", "I couldn't finish my fries, but the flavor of the garlic and sweet onions in the mussels sauce made me finish our entrees first! ", "Super tasty and easy to eat with the little fork. ", "Fries were perfectly tasty too. ", "My coworkers ordered the same dish and loved it as well. ", "They even tossed the fries in the remaining sauce because it was that tasty!\n", "- steak and fries: I got to try my coworker's and thought the steak was cooked a little too bland. "], "author": "Amanda C.", "review": "Came here with a reservation for 6 with my coworkers on a Thursday afternoon. We were running late and asked to push the reservation  back twice, but they were very accommodating even with a slightly rude reply when I called the second time. We were seated upstairs and really liked the decor of the atmosphere. There's a bar upstairs too, which was convenient so people wouldn't have to go up and down the stairs. I started off with their lemonade, which was delicious and unlimited refills! My waiter took my lemonade when I was halfway done and I tried to stop him but he said he was refilling it, phew! Haha. We started off with a few appetizers to share before our main entree. Be sure to ask for bread as it is upon request.\n\n- charcuterie: loved the rye bread, but the fish wasn't anything special. It is a nice to have when there's a large party and we need something to munch on.\n- corn soup (seasonal): loved this! There was a kick of spice to it, and the portion was super generous. I had an entire bowl to finish and it definitely made me full before my main meal. I would reorder this dish for sure!\n- smoked bacon flatbread: super tasty as well. We each got one slice and the flatbread had a crisp and was perfectly thin, so it wasn't over filling. The bacon and arugula was perfect. Would reorder again, too.\n- rustic meatballs: also worth ordering again because the meatballs were super tasty and tomato-y. The bread went well with the leftover cheesy sauce. Meatballs were soft enough and flavorful enough.\n- mussels and fries: super generous portion again with a full bowl of fries. I couldn't finish my fries, but the flavor of the garlic and sweet onions in the mussels sauce made me finish our entrees first! Super tasty and easy to eat with the little fork. Fries were perfectly tasty too. My coworkers ordered the same dish and loved it as well. They even tossed the fries in the remaining sauce because it was that tasty!\n- steak and fries: I got to try my coworker's and thought the steak was cooked a little too bland. It lacked flavor, but the fries and tomatoes were on point.\n\nService was fast and super accommodating once we sat down. Food was delicious and I definitely recommend trying this place out.", "rating": 4, "date": "2017-09-24"}], "artisanal cheese trio": [], "burrata tartine": [{"excerpts": ["[[ Burrata Tartine $12 ]] ", "https://www.yelp.com/biz_photos/per-diem-san-francisco?select=Yy5T8zrQTpms74KHnRuqwA This was sweeter than I expected. ", "I guess I shouldn't be surprised cause its served with honey, almonds and sea salt. ", "Other places that I had "], "author": "Ariana M.", "review": "Per Diem is located on Sutter Street, we parked in the public lot on Stockton/Shutter. We paid about $8 for about 3 or 4 hours. \n\n[[ Charcuterie $12 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=vOFZ6Gny-_7L1OVeuIE3YA The charcuterie came with 3 selections of meat, a few pickles, walnut bread crostini, and whole grain mustard. Overall, I thought this appetizer was alright. I would have preferred softer crackers or bread instead of the walnut crostini. \n\n[[ Burrata Tartine $12 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=Yy5T8zrQTpms74KHnRuqwA This was sweeter than I expected. I guess I shouldn't be surprised cause its served with honey, almonds and sea salt. Other places that I had Burrata was more savory than sweet.\n\n[[ Wild Mushroom Pasta $20 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=1sXhO-Acf_cBYQ9NO5UCfg I'm a huge fan of this pasta. I love the egg and truffle sauce used. However the portion was smaller than I expected.\n\n[[ Squid Ink Linguini $26 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=XwJWwywx2VuoyqSoBs97UQ  This pasta was king of dry. I only tried a couple bites but I was expecting more sauce on it. The prawns and scallop was cooked nicely. \n\n[[ Marquise Au Chocolate ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=Y4tYmO33oTlBirGMiuNADQ This chocolate dessert was delish but really rich. \n\nOverall, I had a good time. We ended up staying till closing just enjoying drinks after our meal and having a good conversation. The service was excellent but the food was just alright.", "rating": 4, "date": "2018-03-15"}, {"excerpts": ["We started with the Avocado Toast, which was alright as it tasted like guacamole on top of toast, the Rustic Meatballs which were surprisingly good as I'm not usually a huge fan of tomato sauce, and the Burrata Tartine which was so good, I could probably just eat it as my meal.\n\n"], "author": "Sophia Y.", "review": "Per Diem is right around the corner from our office and we decide to come for a spontaneous holiday lunch which was nice. \n\nWalking in, I really liked the interior. It was cool, simple and clean and not at all pretentious. We sat on the second floor which was nice and a little more private.\n\nWe started with the Avocado Toast, which was alright as it tasted like guacamole on top of toast, the Rustic Meatballs which were surprisingly good as I'm not usually a huge fan of tomato sauce, and the Burrata Tartine which was so good, I could probably just eat it as my meal.\n\nAs for my entree, I couldn't decide what I wanted and ended up splitting 2 dishes with a co-workers so we get the best of both worlds. We got the Wild Mushroom Pasta which was good and creamy. The fried egg on top was perfectly round. We also got the Braised Short Ribs which had great flavor and was super tender. The vegetables on that plate was cooked perfectly and tasted really good as well.\n\nOverall, it was a really good and a nice treat for lunch.", "rating": 4, "date": "2018-02-11"}, {"excerpts": ["Orders: wild mushroom pasta, smoked bacon flatbread, & burrata tartine ", "- we acted like this was dessert justifying our add on. ", "$$$ for 2 and for lunch, worth it and would go back again."], "author": "Kim N.", "review": "recommend making reservations for lunch, we got lucky going early on a weekday but we were CLOSE to being turned away.\n\nEverything we ordered sounds pretty simple, but all tasted fresh and amazing.\n\nOrders: wild mushroom pasta, smoked bacon flatbread, & burrata tartine - we acted like this was dessert justifying our add on. $$$ for 2 and for lunch, worth it and would go back again.", "rating": 5, "date": "2017-07-31"}, {"excerpts": ["Burrata Tartine\n2. ", "Meatballs (comes with 4)\n3. ", "Burger\n4. "], "author": "Carolyn Z.", "review": "I have come here twice, both times for a weekday lunch. Both times, I made reservations, and I highly recommend you make reservations prior to coming. \n\nI have tried:\n1. Burrata Tartine\n2. Meatballs (comes with 4)\n3. Burger\n4. Tri-tip sandwich\n\nThe items that I liked most were the meatballs and the burrata. \n\nOverall, the price is a bit steep for the portion, especially the appetizers, but it is to be expected because it is located in FiDi. Does the food taste good? Yes, but it isn't anything special. I would recommend this place for anybody who wants to bring clients to lunch because you can always expect food that tastes good. It might not be great, but it will do.", "rating": 3, "date": "2018-01-01"}, {"excerpts": ["Burrata tartine (honey, almonds, salt) - 3/5\nGreen bean almondine (toasted almonds, lemon brown butter) - 2/5\n"], "author": "Mark O.", "review": "Dinner review.\n\nBurrata tartine (honey, almonds, salt) - 3/5\nGreen bean almondine (toasted almonds, lemon brown butter) - 2/5\nWild mushroom pasta (egg, truffle sauce) - 2/5\nSquid ink linguini (prawns, scallops) - 4/5\n\nOverall, \"A-OK.\"", "rating": 3, "date": "2017-07-10"}, {"excerpts": ["My favorite dish is the Burrata Tartine. ", "It's reasonably priced for San Francisco FiDi. ", "There's happy hour at the bar and it's not overly packed compared to similar establishments in the area. "], "author": "Bernard H.", "review": "Per Diem is a great spot for lunch or dinner. I've been fortunate enough to dine here a handful of times as I work nearby. \n\nFor lunch, even though you're sitting down, you can be in and out in under 90 minutes. My favorite dish is the Burrata Tartine. It's reasonably priced for San Francisco FiDi. There's happy hour at the bar and it's not overly packed compared to similar establishments in the area. I haven't had any issues with the service. \n\nThey have two floors where there's a spot in the second floor where you can reserve a portion of the restaurant for corporate events. Good spot. There's even a small outdoor area on the 2nd floor.", "rating": 4, "date": "2018-07-03"}, {"excerpts": ["We shared the burrata tartine, tempura artichoke hearts, and meatballs. ", "The portion size was pretty decent, and the flavors were good, but not outstanding in any sort of way. ", "Perhaps I prefer a creamier and saltier sort of buratta, and the toast was a bit too crispy for my liking (I'm more about the chew). ", "The tempura artichoke hearts were fried well, but it felt lacking in actual artichoke heart and more about the fried bits-- we didn't finish this. "], "author": "Nicole H.", "review": "I've had my eye on this spot for a while, and finally had the chance to check it out with an old friend who happened to be in town. Walked in at 5 and weren't able to get a spot upstairs in the restaurant, so we opted for the happy hour downstairs.\n\nWe shared the burrata tartine, tempura artichoke hearts, and meatballs. The portion size was pretty decent, and the flavors were good, but not outstanding in any sort of way. Perhaps I prefer a creamier and saltier sort of buratta, and the toast was a bit too crispy for my liking (I'm more about the chew). The tempura artichoke hearts were fried well, but it felt lacking in actual artichoke heart and more about the fried bits-- we didn't finish this. The meatballs were pretty standard-- not good, not bad.\n\nThe interior itself was beautiful-- again, reminiscent of New York with dark wood paneling and a fancy but not glitzy sort of atmosphere. Happy hour downstairs was a bit loud (had to lean in a couple times to hear the person across from you) but I'd imagine it would be quieter upstairs. I'll plan to be back!\n\n--\n\nEdit: Been back twice but still didn't make it upstairs! They don't have any non-alcoholic drinks on the menu, and the ones that they mixed up for me were a bit lacking. I got the squid ink spaghetti tonight and while it came out pretty hot (always a plus), it lacked the umami flavor I crave in squid ink pastas, and was almost a bit sour from the tomato. The shrimps and scallops were perfectly cooked, with the shrimp being extra buttery. Portions are on the smaller side considering that I was able to finish my dish with room to spare. 3.5/5. I preferred the squid ink spaghetti at Skool.", "rating": 3, "date": "2017-06-06"}, {"excerpts": ["Since I'm a sucker for wild mushroom anything & burrata anything, I decided to order the Wild Mushroom Pasta & the Burrata Tartine. ", "Both were really great! "], "author": "Tiffany K.", "review": "I love this place!! Per Diem is one of the posher lunch places I've been to in the FiDi and has a fancy bar vibe even during daytime hours. The food was great, but it's definitely a reservation necessary place (and they require credit card holds). \n\nSince I'm a sucker for wild mushroom anything & burrata anything, I decided to order the Wild Mushroom Pasta & the Burrata Tartine. Both were really great! I really enjoyed that the pasta came with a sunnyside up egg (runny yolk is the perfect complement to all things), and the burrata had a light honey drizzle and was super creamy. \n\nDefinitely not the cheapest lunch option. But great when you're feeling a little spendy & a little fancy.", "rating": 5, "date": "2017-10-24"}, {"excerpts": ["Ordered meatballs and the burrata tartine for starters and the squid ink linguine as the main dish. "], "author": "Raisa G.", "review": "Ordered meatballs and the burrata tartine for starters and the squid ink linguine as the main dish. Paired this with 2 drinks.\n\nMeatballs were tender. Tasted of basil and other herbs. The plate came with 4 tiny meatballs in red sauce and ricotta cheese. \n\nBuratta tartine was different, nothing I had ever tried. It's covered with honey, so it was more like dessert. The toasted almonds on top were delicious. \n\nThe linguine was just okay. I was expecting a tastier plate for the price. The scallops were good. There were pieces of bell pepper that were drenched in vinegar. That definitely ruined the dish for me.\n\nThe bread was not fresh. They had it warmed up so it tasted okay, but once it cooled, it was hard and had that old bread smell. \n\nDrinks were overpriced. They're not generous with the amount of alcohol, I'm very lightweight and usually get a buzz on after one drink. Didn't feel much with this one.\n\nI liked the atmosphere. Dim lighting and good service. \n\nOverall, I was expecting tastier dishes for the high price. Small portions and nothing extraordinary, not worth $80 for 2 people. I would not recommend.", "rating": 2, "date": "2017-09-13"}, {"excerpts": ["Also highly recommended was the Burrata Tartine. ", "Holy crud - this might be my new favorite thing! "], "author": "Kat L.", "review": "The decor and the food here is incredible. We were able to easily secure reservations for my team for lunch and were promptly taken to the top level when we arrived. \n\nI had the mushroom pasta (which is was highly recommended by my waitress) and it was super yummy. She asked if I'd like to add chicken to it, I said yes, and it was amazing. Highly recommend going this route if you want some extra protein and want to make it filling enough for leftovers!\n\nAlso highly recommended was the Burrata Tartine. Holy crud - this might be my new favorite thing! I could tell the burrata was super fresh and the honey and slivered almonds they put on top was the perfect compliment. \n\nMy teammates got the fried chicken sandwich, the mussels, the bacon flatbread (I snuck a bite, INCREDIBLE), and the millet and chickpea salad. All got rave reviews from them. \n\nI'll definitely come back here!", "rating": 5, "date": "2017-09-12"}, {"excerpts": ["I have also enjoyed the Burrata Tartine, Wild Mushroom Pasta, Braised Beef Short Ribs, a Marinated Garden Beet salad, pickled vegetables, and french fries. \n\n"], "author": "Tiffany N.", "review": "I've eaten at Per Diem a few times now, which is slightly unusual for me as I try to eat at different spots now that I only travel to San Francisco and don't live there. But, I have enjoyed all my evenings there so I imagine I'll likely find myself here again at some point in the future.\n\nNow anyone who knows me knows that I love a cheese plate. Heck, you don't even have to know me, just read a few of my reviews and you will soon realize that I have a deep love for cheese. So, naturally, I have ordered the cheese and charcuterie board from Per Diem and it has always been delightful. I have also enjoyed the Burrata Tartine, Wild Mushroom Pasta, Braised Beef Short Ribs, a Marinated Garden Beet salad, pickled vegetables, and french fries. \n\nThe service has always been friendly and efficient and while it's often busy the wait has yet to be unbearably long. The cocktails are good, as is the wine list. And all of these things add up to an experience that has always been positive, which is probably why I find myself here again and again.", "rating": 4, "date": "2017-04-26"}, {"excerpts": ["- burrata tartine\n\n"], "author": "Aivy C.", "review": "I came here for dinner with my coworkers and it was delicious! Everything was great, and I definitely ate everything in front of me because shit, I wasn't paying for it or anything.\n\nStandouts for me:\n- avocado toast\n- wild mushroom pasta\n- burrata tartine\n\nI plan to come back and try the bone marrow. I wanted to order it, but my boss is a total health guy, marathoner and all, and I figured it wasn't worth the potential look of judgment. \n\nTIP: avoid during happy hour unless you want to drown in a sea of tech bros.", "rating": 4, "date": "2017-04-23"}, {"excerpts": ["For starters, we ordered the burrata tartine, and it definitely deserves all the hype!! ", "The meatballs were good, but nothing special. "], "author": "Christal C.", "review": "I thoroughly enjoyed my dining experience here. I made reservations for lunch with my colleagues on a Thursday afternoon, as it can get crowded quickly. The food and service are both exceptional, but nothing too amazing. For starters, we ordered the burrata tartine, and it definitely deserves all the hype!! The meatballs were good, but nothing special. My wild mushroom pasta was one of the best pasta dishes I've had in awhile. It was creamy/foamy, yet light at the same time--truly an interesting dish. The portions are good for lunch, but pricey for what you get. However, considering the restaurant's location in the FiDi, I'd say the prices are not too shabby.", "rating": 4, "date": "2017-08-03"}, {"excerpts": ["As for food, we ordered the avocado toast, burrata tartine, margherita flatbread and fried artichoke hearts--YUM! "], "author": "Karlie C.", "review": "Went into Per Diem on a weeknight with a girlfriend for drinks and a few snacks. We were able to find a couple open seats at the bar and were warmly greeted by Griffen/Gryffin (not sure how to spell it?) and Arnie who were bartending. The restaurant was pretty busy and the bartenders were definitely slinging drinks left and right for everyone, but they still had time to make sure we were taken care of right away. Big compliments to the entire staff for being kind and courteous throughout our stay.\n\nI ordered a cucumber gimlet and my friend had a Golden Gate Spritz off of their cocktail menu, both of which were great! Saw someone order a Billionaire Bramble next to me and I had to add it to my \"must order\" list ; ) Solid selection of beers and other spirits which I'm excited to sift through during my next visits. As for food, we ordered the avocado toast, burrata tartine, margherita flatbread and fried artichoke hearts--YUM! Everything came out promptly and definitely satisfied our hunger pangs. \n\nOverall, I'm really pleased with Per Diem and glad that I came in for a good time! If you're looking for swift and sweet service, tasty bites and craft cocktails that pack a punch, this is the spot for you. Will definitely be back for more drinks and to try some dinner entrees! Steak and lobster, I'm looking at you.. *heart eyes*", "rating": 5, "date": "2017-06-22"}, {"excerpts": ["Our table ordered the Burrata Tartine, Avocado Toast and pickles as an appetizer. ", "All were delicious. ", "The tartine and toast were a decent portion for 2-3 people to share. ", "We had 4 people and there was definitely a couple of \"no, it's okay--", "you have it", "\" moments. "], "author": "Jenny C.", "review": "We came for dinner on a Wednesday. Parking was fairly easy, but driving in that area is hectic. It took about 15 minutes to move 1 block. There must've been construction or something. It's close to Bart, so I would recommend that option. \n\nThe decor is wonderful. It's kind of a vintage ship wreck library feel. \n\nOur table ordered the Burrata Tartine, Avocado Toast and pickles as an appetizer. All were delicious. The tartine and toast were a decent portion for 2-3 people to share. We had 4 people and there was definitely a couple of \"no, it's okay--you have it\" moments. I think I'll order the burrata for dinner next time. \n\nI ordered the wild mushroom pasta as my entree. It was tasty, but for the portion size and being $20 I won't order it again. \n\nAfter our plates were taken away, we were kind of forgotten and had to ask about water refills. At one point my friend got up to get the carafe from the bar. The restaurant wasn't busy, so we didn't see the harm in catching up with our friends. I love that sf is conserving water, but if tiny water cups are used, a craft to refill yourself is nice to have. \n\nOverall, it was lovely restaurant. And I'll be back for the burrata.", "rating": 4, "date": "2017-01-05"}, {"excerpts": ["We split the Burrata Tartine and I had the Salmon Nicoise, which were both delicious. ", "Everything is pretty reasonably priced given the area, and service was quick and efficient for the working lunch crowd. ", "The only downside was that they really packed us in upstairs and it felt a bit cramped and loud, but it might be a nice space for a larger group gathering and I'd definitely be back for the food."], "author": "Rachel A.", "review": "I came here for an early lunch with a friend and was not disappointed. We split the Burrata Tartine and I had the Salmon Nicoise, which were both delicious. Everything is pretty reasonably priced given the area, and service was quick and efficient for the working lunch crowd. The only downside was that they really packed us in upstairs and it felt a bit cramped and loud, but it might be a nice space for a larger group gathering and I'd definitely be back for the food.", "rating": 4, "date": "2016-11-04"}], "fried artichoke hearts": [{"excerpts": ["Especially liked the avocado toast and fried artichoke hearts. ", "Everyone behind the bar was friendly and the cocktails are a really good price for this side of town. "], "author": "Sirijit P.", "review": "Came in on a Thursday evening and it was busier than I expected but the food came out really quickly! Especially liked the avocado toast and fried artichoke hearts. Everyone behind the bar was friendly and the cocktails are a really good price for this side of town. Got a Golden Gate Spritz, super refreshing! \n\nWould definitely come in again for lunch during the week. Didn't have a beer while I was here but they've got a great selection on tap.", "rating": 5, "date": "2017-06-22"}, {"excerpts": ["As for food, we ordered the avocado toast, burrata tartine, margherita flatbread and fried artichoke hearts--YUM! "], "author": "Karlie C.", "review": "Went into Per Diem on a weeknight with a girlfriend for drinks and a few snacks. We were able to find a couple open seats at the bar and were warmly greeted by Griffen/Gryffin (not sure how to spell it?) and Arnie who were bartending. The restaurant was pretty busy and the bartenders were definitely slinging drinks left and right for everyone, but they still had time to make sure we were taken care of right away. Big compliments to the entire staff for being kind and courteous throughout our stay.\n\nI ordered a cucumber gimlet and my friend had a Golden Gate Spritz off of their cocktail menu, both of which were great! Saw someone order a Billionaire Bramble next to me and I had to add it to my \"must order\" list ; ) Solid selection of beers and other spirits which I'm excited to sift through during my next visits. As for food, we ordered the avocado toast, burrata tartine, margherita flatbread and fried artichoke hearts--YUM! Everything came out promptly and definitely satisfied our hunger pangs. \n\nOverall, I'm really pleased with Per Diem and glad that I came in for a good time! If you're looking for swift and sweet service, tasty bites and craft cocktails that pack a punch, this is the spot for you. Will definitely be back for more drinks and to try some dinner entrees! Steak and lobster, I'm looking at you.. *heart eyes*", "rating": 5, "date": "2017-06-22"}], "wild mushroom pasta": [{"excerpts": ["[[ Wild Mushroom Pasta $20 ]] ", "https://www.yelp.com/biz_photos/per-diem-san-francisco?select=1sXhO-Acf_cBYQ9NO5UCfg I'm a huge fan of this pasta. ", "I love the egg and truffle sauce used. "], "author": "Ariana M.", "review": "Per Diem is located on Sutter Street, we parked in the public lot on Stockton/Shutter. We paid about $8 for about 3 or 4 hours. \n\n[[ Charcuterie $12 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=vOFZ6Gny-_7L1OVeuIE3YA The charcuterie came with 3 selections of meat, a few pickles, walnut bread crostini, and whole grain mustard. Overall, I thought this appetizer was alright. I would have preferred softer crackers or bread instead of the walnut crostini. \n\n[[ Burrata Tartine $12 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=Yy5T8zrQTpms74KHnRuqwA This was sweeter than I expected. I guess I shouldn't be surprised cause its served with honey, almonds and sea salt. Other places that I had Burrata was more savory than sweet.\n\n[[ Wild Mushroom Pasta $20 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=1sXhO-Acf_cBYQ9NO5UCfg I'm a huge fan of this pasta. I love the egg and truffle sauce used. However the portion was smaller than I expected.\n\n[[ Squid Ink Linguini $26 ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=XwJWwywx2VuoyqSoBs97UQ  This pasta was king of dry. I only tried a couple bites but I was expecting more sauce on it. The prawns and scallop was cooked nicely. \n\n[[ Marquise Au Chocolate ]] https://www.yelp.com/biz_photos/per-diem-san-francisco?select=Y4tYmO33oTlBirGMiuNADQ This chocolate dessert was delish but really rich. \n\nOverall, I had a good time. We ended up staying till closing just enjoying drinks after our meal and having a good conversation. The service was excellent but the food was just alright.", "rating": 4, "date": "2018-03-15"}, {"excerpts": ["For an entree I ordered the wild mushroom pasta. ", "I was caught off guard to see it came with an egg and arugula on top ", "but this was a pleasant surprise. "], "author": "Ashley L.", "review": "What a cool spot to go to lunch in the FiDi. \n\nCame here for a Holiday lunch with my co-workers and it was such a treat. \n\nThe food here fits California cuisine to a T. \n\n\nTo start, we ordered the burrata toast, avocado toast and meatballs as appetizers. Wasn't a big fan of the avocado toast cause it was mixed with lime and spicy peppers and reminded me of guacamole on toast than traditional avocado spread. \n\nThe meatballs and and burrata toast were delectible! \n\nThe lunch menu offers everything from pasta to sandwiches and salads. Whether you're a vegetarian or carnivore, it's guaranteed you'll find something that suits your palette. \n\nFor an entree I ordered the wild mushroom pasta. I was caught off guard to see it came with an egg and arugula on top but this was a pleasant surprise. The mushrooms were soft and packed full of flavor and the pasta sauce was light and not too heavy for being white. \n\nOverall, the service was quick, attentive and friendly. The cuisine was delicious and visually pleasing. \n\nI would definitely recommend this place to people in the area and plan on coming back for dinner.", "rating": 4, "date": "2017-12-30"}, {"excerpts": ["Wild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\n"], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}, {"excerpts": ["Wild Mushroom Pasta - relatively small pasta dish served on a big plate, with a foamy sauce. ", "Neat presentation and apparently really good", ", I'm really excited to pay the $19 to get this next time I come. \n", "- Broccoli De Cicco Flatbread - Looked good, with roasted broccoli on the top. ", "Also $16\n- Bacon Flatbread - It was decent, but I think I would have preferred a second Margarita flatbread if I could do the order over. ", "Also $16\n- Tri-Tip Sandwich - Served with fries, this sandwich came between huge toasted pieces of bread. ", "It looked amazing!  ", "$18\n- "], "author": "John B.", "review": "Recommendation: Good food for respectable prices. Super cool decoration. We had to wait 20 minutes after our reservation to be seated, but got compensated appetizers as a \"sorry\" gesture. I'd say you shouldn't go here if you're in a hurry, but it's worth visiting otherwise! \n\nI called at 3pm yesterday to make a reservation for lunch today. No pick-up. I called again at 5:30, during their dinner hours, and still nobody picked up. I left a message asking to make the reservation, but I don't think it happened. Later that night I booked a reservation through OpenTable, but it only allowed booking in half-hour increments. No 12:45 lunch reservation for us I guess, so I just went with 1pm instead, for a party of 6. No issues, I got the confirmation email and thought we were set. \n\nCome the day of the reservation, we go in at 12:55 for our 1pm reservation. They had us in the reservation list and told us we'd be seated shortly. We checked with the hostesses again at 1:10 and they said the people at the table were still finishing up. (After walking through the restaurant to our table, it was clear that there wasn't a whole bunch of seating for groups of 6.) At 1:15 we asked to place our appetizer and entree orders so we wouldn't have to wait too long once we were seated, and the hostess took down all our orders while also comping us for the two appetizers we ordered, and even threw in an extra comped flatbread. $37 of appetizers comped, nice! Finally at 1:20 we were led to our table at the back of the 2nd floor, which also allowed us to see how cool the restaurant really is. It reminded me a little of Novela what with the walls covered in bookcases, but Per Diem took it a couple steps further with the decoration. It felt amazingly rustic and raw, and the mini outdoor patio on the 2nd floor added a ton of ambient light to the otherwise dark space. \n\nThe food was all really good. We ordered:\n- Hummus appetizer: flatbread cracker chips and hummus, along with lots of veggies on the plate. Pretty good, worth the $9 I think\n- Fried Rainbow carrot appetizer: deep fried carrots served with a yummy sauce: Good, but not a large enough portion to warrant the $12 I don't think\n- Margarita Flatbread - 6 pieces, about 9 inches by 6 inches. Delicious, and the cheese was particularly noteworthy as being something other than standard mozzarella. Worth the $16\n- Wild Mushroom Pasta - relatively small pasta dish served on a big plate, with a foamy sauce. Neat presentation and apparently really good, I'm really excited to pay the $19 to get this next time I come. \n- Broccoli De Cicco Flatbread - Looked good, with roasted broccoli on the top. Also $16\n- Bacon Flatbread - It was decent, but I think I would have preferred a second Margarita flatbread if I could do the order over. Also $16\n- Tri-Tip Sandwich - Served with fries, this sandwich came between huge toasted pieces of bread. It looked amazing!  $18\n- Flank Steak - Well seasoned and garnished, but relatively small (6-8oz maybe?) and with a side of potatoes, if I recall. $28\n\nAll in all the 30 minute wait in the entrance left us in a poor mood, but the comped appetizers and the good food / cool environment / attentive waitress and hostess made up for it. I would have given 4 stars if not for these issues, but until proven otherwise I'll assume the reservation situation is not up to par. \n\nPer Diem, please answer your phone (or at least call back), adjust OpenTable to allow for 15 minute chunks for reservations, and finally adjust the reservation quantity so you can better seat people on time!", "rating": 3, "date": "2018-08-14"}, {"excerpts": ["I had the wild mushroom pasta dish.  ", "The portion is on the small side (I chowed down that whole thing), but it tastes delicious.  "], "author": "Shannon L.", "review": "Very nice place to grab lunch in FiDi if it's for business or a special occasion.  Very nice vibes on the inside, but you're paying for it.  For appetizers we ordered the avocado toast, charcuterie board, and smoked bacon flat bread.  Have to say that the flat bread was the winner out of those!  I had the wild mushroom pasta dish.  The portion is on the small side (I chowed down that whole thing), but it tastes delicious.  The egg on top is like the cherry on top.     \n\nThe apple tart was bomb!  Even though I wasn't hungry at that point, there's always room for dessert.  The caramel ice cream on the side is a little too sweet for me, but yumm loved the tart.", "rating": 4, "date": "2017-10-01"}, {"excerpts": ["Got the Burrata, Tuna Salad, and the Wild mushroom pasta. ", "Burrata was solid, Tuna Salad didn't really taste fresh and the pasta was actually pretty good."], "author": "Navdeep D.", "review": "Nothing super crazy about this place. Walked i during lunch with a friend and had lunch but the hostess didn't ask at first where we wanted to sit but immediately took us to the bar. Had to ask to be moved to an actual table. Service kind of slow even though it seemed they were well staffed and weren't all that busy. Food was mediocre but overpriced for sure. Got the Burrata, Tuna Salad, and the Wild mushroom pasta. Burrata was solid, Tuna Salad didn't really taste fresh and the pasta was actually pretty good.", "rating": 3, "date": "2018-05-18"}, {"excerpts": ["We got the Wild Mushroom Pasta which was good and creamy. ", "The fried egg on top was perfectly round. ", "We also got the Braised Short Ribs which had great flavor and was super tender. "], "author": "Sophia Y.", "review": "Per Diem is right around the corner from our office and we decide to come for a spontaneous holiday lunch which was nice. \n\nWalking in, I really liked the interior. It was cool, simple and clean and not at all pretentious. We sat on the second floor which was nice and a little more private.\n\nWe started with the Avocado Toast, which was alright as it tasted like guacamole on top of toast, the Rustic Meatballs which were surprisingly good as I'm not usually a huge fan of tomato sauce, and the Burrata Tartine which was so good, I could probably just eat it as my meal.\n\nAs for my entree, I couldn't decide what I wanted and ended up splitting 2 dishes with a co-workers so we get the best of both worlds. We got the Wild Mushroom Pasta which was good and creamy. The fried egg on top was perfectly round. We also got the Braised Short Ribs which had great flavor and was super tender. The vegetables on that plate was cooked perfectly and tasted really good as well.\n\nOverall, it was a really good and a nice treat for lunch.", "rating": 4, "date": "2018-02-11"}, {"excerpts": ["Orders: wild mushroom pasta, smoked bacon flatbread, & burrata tartine ", "- we acted like this was dessert justifying our add on. ", "$$$ for 2 and for lunch, worth it and would go back again."], "author": "Kim N.", "review": "recommend making reservations for lunch, we got lucky going early on a weekday but we were CLOSE to being turned away.\n\nEverything we ordered sounds pretty simple, but all tasted fresh and amazing.\n\nOrders: wild mushroom pasta, smoked bacon flatbread, & burrata tartine - we acted like this was dessert justifying our add on. $$$ for 2 and for lunch, worth it and would go back again.", "rating": 5, "date": "2017-07-31"}, {"excerpts": ["Wild mushroom pasta (egg, truffle sauce) - 2/5\nSquid ink linguini (prawns, scallops) - 4/5\n\n"], "author": "Mark O.", "review": "Dinner review.\n\nBurrata tartine (honey, almonds, salt) - 3/5\nGreen bean almondine (toasted almonds, lemon brown butter) - 2/5\nWild mushroom pasta (egg, truffle sauce) - 2/5\nSquid ink linguini (prawns, scallops) - 4/5\n\nOverall, \"A-OK.\"", "rating": 3, "date": "2017-07-10"}, {"excerpts": ["Since I'm a sucker for wild mushroom anything & burrata anything, I decided to order the Wild Mushroom Pasta & the Burrata Tartine. ", "Both were really great! "], "author": "Tiffany K.", "review": "I love this place!! Per Diem is one of the posher lunch places I've been to in the FiDi and has a fancy bar vibe even during daytime hours. The food was great, but it's definitely a reservation necessary place (and they require credit card holds). \n\nSince I'm a sucker for wild mushroom anything & burrata anything, I decided to order the Wild Mushroom Pasta & the Burrata Tartine. Both were really great! I really enjoyed that the pasta came with a sunnyside up egg (runny yolk is the perfect complement to all things), and the burrata had a light honey drizzle and was super creamy. \n\nDefinitely not the cheapest lunch option. But great when you're feeling a little spendy & a little fancy.", "rating": 5, "date": "2017-10-24"}, {"excerpts": ["I have also enjoyed the Burrata Tartine, Wild Mushroom Pasta, Braised Beef Short Ribs, a Marinated Garden Beet salad, pickled vegetables, and french fries. \n\n"], "author": "Tiffany N.", "review": "I've eaten at Per Diem a few times now, which is slightly unusual for me as I try to eat at different spots now that I only travel to San Francisco and don't live there. But, I have enjoyed all my evenings there so I imagine I'll likely find myself here again at some point in the future.\n\nNow anyone who knows me knows that I love a cheese plate. Heck, you don't even have to know me, just read a few of my reviews and you will soon realize that I have a deep love for cheese. So, naturally, I have ordered the cheese and charcuterie board from Per Diem and it has always been delightful. I have also enjoyed the Burrata Tartine, Wild Mushroom Pasta, Braised Beef Short Ribs, a Marinated Garden Beet salad, pickled vegetables, and french fries. \n\nThe service has always been friendly and efficient and while it's often busy the wait has yet to be unbearably long. The cocktails are good, as is the wine list. And all of these things add up to an experience that has always been positive, which is probably why I find myself here again and again.", "rating": 4, "date": "2017-04-26"}, {"excerpts": ["we got the wild mushroom pasta, truffle mushroom flatbread, and the squid ink linguini. ", "Out of the two pastas, I enjoyed the wild mushroom pasta more. ", "There was a lot of hype around the squid ink pasta, but personally did not think it was anything extraordinary. ", "Tasted like any other squid ink pasta you would get but a little lighter on the sauce (+1 if that's your thing!). ", "As for the truffle mushroom flatbread, this was meh as well. "], "author": "Megan K.", "review": "Came with a party of 6 and reservations were really easy to make! Location really great for anyone working/living in Financial District and can see why a lot of people would come here after work! There is an upstairs section as well with tables so you don't feel crammed.\n\nWe started off with the charcuterie & cheeseboard - presentation of this was really nice and the meats and cheeses were pretty good too. Nothing out of the ordinary, the only thing that would have bene nice is if the waiter pointed out the names for each.\n\nMain entrees we got the wild mushroom pasta, truffle mushroom flatbread, and the squid ink linguini. Out of the two pastas, I enjoyed the wild mushroom pasta more. There was a lot of hype around the squid ink pasta, but personally did not think it was anything extraordinary. Tasted like any other squid ink pasta you would get but a little lighter on the sauce (+1 if that's your thing!). As for the truffle mushroom flatbread, this was meh as well. I would definitely skip on this.\n\nAnd last but not least we got an order of the lobster fries, another thing that was hyped up. Unfortunately this was a bit of a letdown as well. Mainly a lot of cheese with not much lobster. Could probably buy the ingredients and make it myself at home.\n\nWorst part of this meal was that when we were ordering our waiter told us that we were ordering too much for our group and that we should probably take something off the list. I understand that he was just trying to help but let me be hungry and just take my money!! \n\n3.5 stars - would probably not come back again, but very convenient location for dinner after work if you are looking for a good atmosphere with decent food - just don't expect to be blown away.", "rating": 3, "date": "2016-10-07"}, {"excerpts": ["Standouts for me:\n- avocado toast\n- wild mushroom pasta\n"], "author": "Aivy C.", "review": "I came here for dinner with my coworkers and it was delicious! Everything was great, and I definitely ate everything in front of me because shit, I wasn't paying for it or anything.\n\nStandouts for me:\n- avocado toast\n- wild mushroom pasta\n- burrata tartine\n\nI plan to come back and try the bone marrow. I wanted to order it, but my boss is a total health guy, marathoner and all, and I figured it wasn't worth the potential look of judgment. \n\nTIP: avoid during happy hour unless you want to drown in a sea of tech bros.", "rating": 4, "date": "2017-04-23"}, {"excerpts": ["We had the rustic meatballs, wild mushroom pasta, squid ink linguini, and apple tart which were all fantastic. ", "I had the linguini which was perfectly salted, lemony, and well-proportioned. ", "I feel like it's a great starter "], "author": "Wendy C.", "review": "Went here for a casual dinner the other night after loving it the first time my old boss took me.\n\nI love live jazz and older themed restaurants so the gold rush vibe and candles were fun to be around. They even had real books lining the walls! \n\nWe had the rustic meatballs, wild mushroom pasta, squid ink linguini, and apple tart which were all fantastic. I had the linguini which was perfectly salted, lemony, and well-proportioned. I feel like it's a great starter if you're not sure what to order here.\n\nMight've picked a bad night though because a large party was seated right next to us with mics, which had a lot of loud feedback. When the hostess was leading me to the table, the crowd wouldn't part for her and she apologized to me (definitely not her fault).", "rating": 4, "date": "2017-09-23"}, {"excerpts": ["My wild mushroom pasta was one of the best pasta dishes I've had in awhile. ", "It was creamy/foamy, yet light at the same time--truly an interesting dish. ", "The portions are good for lunch, but pricey for what you get. ", "However, considering the restaurant's location in the FiDi, I'd say the prices are not too shabby."], "author": "Christal C.", "review": "I thoroughly enjoyed my dining experience here. I made reservations for lunch with my colleagues on a Thursday afternoon, as it can get crowded quickly. The food and service are both exceptional, but nothing too amazing. For starters, we ordered the burrata tartine, and it definitely deserves all the hype!! The meatballs were good, but nothing special. My wild mushroom pasta was one of the best pasta dishes I've had in awhile. It was creamy/foamy, yet light at the same time--truly an interesting dish. The portions are good for lunch, but pricey for what you get. However, considering the restaurant's location in the FiDi, I'd say the prices are not too shabby.", "rating": 4, "date": "2017-08-03"}, {"excerpts": ["I ordered the wild mushroom pasta as my entree. "], "author": "Jenny C.", "review": "We came for dinner on a Wednesday. Parking was fairly easy, but driving in that area is hectic. It took about 15 minutes to move 1 block. There must've been construction or something. It's close to Bart, so I would recommend that option. \n\nThe decor is wonderful. It's kind of a vintage ship wreck library feel. \n\nOur table ordered the Burrata Tartine, Avocado Toast and pickles as an appetizer. All were delicious. The tartine and toast were a decent portion for 2-3 people to share. We had 4 people and there was definitely a couple of \"no, it's okay--you have it\" moments. I think I'll order the burrata for dinner next time. \n\nI ordered the wild mushroom pasta as my entree. It was tasty, but for the portion size and being $20 I won't order it again. \n\nAfter our plates were taken away, we were kind of forgotten and had to ask about water refills. At one point my friend got up to get the carafe from the bar. The restaurant wasn't busy, so we didn't see the harm in catching up with our friends. I love that sf is conserving water, but if tiny water cups are used, a craft to refill yourself is nice to have. \n\nOverall, it was lovely restaurant. And I'll be back for the burrata.", "rating": 4, "date": "2017-01-05"}, {"excerpts": ["I got the wild mushroom pasta as my main, and quite enjoyed it.  ", "I also had a bit of my friend's beet salad, which was delicious.  ", "Our group of 4 shared the 3 layered chocolate mousse for dessert - it pretty good.  "], "author": "Barnali D.", "review": "Great food, good service, and elegant decor - a solid dinner spot.\n\nMy friends and I shared the roasted Brussels sprouts and mushroom flatbread as starters - both were good.  I got the wild mushroom pasta as my main, and quite enjoyed it.  I also had a bit of my friend's beet salad, which was delicious.  Our group of 4 shared the 3 layered chocolate mousse for dessert - it pretty good.  I also enjoyed my Citrus Trade cocktail.\n\nThe service was friendly, patient, and prompt - I was quite pleased.\n\nWe were seated upstairs, and loved the old-school library feel of the dining room.\n\nOverall, we had a great experience here!", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["For my main, had the wild mushroom pasta. ", "The tagliatelle was clearly homemade and fresh, and cooked perfectly. "], "author": "Dimple B.", "review": "Started with the MXN. Good, but the strawberry and jalapeno flavors were quite light. I recall even tasting the strawberry... \n\nMoved onto the buratta. Delicious, with a nice honey drizzle! but it's hard to go wrong with that. \n\nFor my main, had the wild mushroom pasta. The tagliatelle was clearly homemade and fresh, and cooked perfectly. The sauce was perfectly balanced and flavored and had a rich creaminess. \n\nIf only I had known that the bread was on request... :( The place is dimly lit so I didn't see that small squiggly note at the bottom until just now.", "rating": 4, "date": "2016-09-03"}, {"excerpts": ["Had the vegetarian wild mushroom pasta w mushroom foam ", "and it was delicious ($20). "], "author": "Chuck N.", "review": "Great spot for work lunches (or dinners) in FiDi. Also, takes reservations here on Yelp which is helpful. \n\nHad the vegetarian wild mushroom pasta w mushroom foam and it was delicious ($20). Really well cooked. \n\nThe French fries and service are excellent as well. I'd come back.", "rating": 5, "date": "2016-02-10"}, {"excerpts": ["For the main courses, my friend ordered the wild mushroom pasta and I had the squid ink linguine. ", "I definitely liked my friend's pasta better ", "but it was pretty heavy. ", "I liked the lemon cream flavors of my dish's sauce and the seafood was cooked really well. ", "However, the flavor of the actual pasta was really boring and bland. ", "For dessert, my friend and I shared the creme brulee and warm apple tart. ", "The creme brulee was NOT good and was a huge disappointment.... until I tried the warm apple tart and that was even worse. "], "author": "Cindy C.", "review": "+/- THE FOOD\nThe food was very visually appealing but the flavors were just lacking! Starting with the drinks, I had the MXN and it was WAY too spicy. Those jalapeno peppers made it really hard to drink. My friend and I shared the steamed mussels and fries together. The mussels tasted good but they were super tiny and there was a lot of them that were unopened. The fries were really undersalted, which is really sad. For the main courses, my friend ordered the wild mushroom pasta and I had the squid ink linguine. I definitely liked my friend's pasta better but it was pretty heavy. I liked the lemon cream flavors of my dish's sauce and the seafood was cooked really well. However, the flavor of the actual pasta was really boring and bland. For dessert, my friend and I shared the creme brulee and warm apple tart. The creme brulee was NOT good and was a huge disappointment.... until I tried the warm apple tart and that was even worse. The apple tart tasted like an old apple muffin that was crumbling everywhere. \n\n- THE SERVICE\nWe came during happy hour time but we made reservations so our hostess seated us up on the second floor and to the very back of the restaurant. Initially, I was really glad she did that since it was really loud downstairs. However, this caused us to be hugely ignored the entire time we were dining here. It would take forever for our server to come check up on us and we were often sitting there for a long period of time without anyone walking by.", "rating": 3, "date": "2016-09-11"}], "flank steak": [{"excerpts": ["Flank Steak - Well seasoned and garnished, but relatively small (6-8oz maybe?) ", "and with a side of potatoes, if I recall. "], "author": "John B.", "review": "Recommendation: Good food for respectable prices. Super cool decoration. We had to wait 20 minutes after our reservation to be seated, but got compensated appetizers as a \"sorry\" gesture. I'd say you shouldn't go here if you're in a hurry, but it's worth visiting otherwise! \n\nI called at 3pm yesterday to make a reservation for lunch today. No pick-up. I called again at 5:30, during their dinner hours, and still nobody picked up. I left a message asking to make the reservation, but I don't think it happened. Later that night I booked a reservation through OpenTable, but it only allowed booking in half-hour increments. No 12:45 lunch reservation for us I guess, so I just went with 1pm instead, for a party of 6. No issues, I got the confirmation email and thought we were set. \n\nCome the day of the reservation, we go in at 12:55 for our 1pm reservation. They had us in the reservation list and told us we'd be seated shortly. We checked with the hostesses again at 1:10 and they said the people at the table were still finishing up. (After walking through the restaurant to our table, it was clear that there wasn't a whole bunch of seating for groups of 6.) At 1:15 we asked to place our appetizer and entree orders so we wouldn't have to wait too long once we were seated, and the hostess took down all our orders while also comping us for the two appetizers we ordered, and even threw in an extra comped flatbread. $37 of appetizers comped, nice! Finally at 1:20 we were led to our table at the back of the 2nd floor, which also allowed us to see how cool the restaurant really is. It reminded me a little of Novela what with the walls covered in bookcases, but Per Diem took it a couple steps further with the decoration. It felt amazingly rustic and raw, and the mini outdoor patio on the 2nd floor added a ton of ambient light to the otherwise dark space. \n\nThe food was all really good. We ordered:\n- Hummus appetizer: flatbread cracker chips and hummus, along with lots of veggies on the plate. Pretty good, worth the $9 I think\n- Fried Rainbow carrot appetizer: deep fried carrots served with a yummy sauce: Good, but not a large enough portion to warrant the $12 I don't think\n- Margarita Flatbread - 6 pieces, about 9 inches by 6 inches. Delicious, and the cheese was particularly noteworthy as being something other than standard mozzarella. Worth the $16\n- Wild Mushroom Pasta - relatively small pasta dish served on a big plate, with a foamy sauce. Neat presentation and apparently really good, I'm really excited to pay the $19 to get this next time I come. \n- Broccoli De Cicco Flatbread - Looked good, with roasted broccoli on the top. Also $16\n- Bacon Flatbread - It was decent, but I think I would have preferred a second Margarita flatbread if I could do the order over. Also $16\n- Tri-Tip Sandwich - Served with fries, this sandwich came between huge toasted pieces of bread. It looked amazing!  $18\n- Flank Steak - Well seasoned and garnished, but relatively small (6-8oz maybe?) and with a side of potatoes, if I recall. $28\n\nAll in all the 30 minute wait in the entrance left us in a poor mood, but the comped appetizers and the good food / cool environment / attentive waitress and hostess made up for it. I would have given 4 stars if not for these issues, but until proven otherwise I'll assume the reservation situation is not up to par. \n\nPer Diem, please answer your phone (or at least call back), adjust OpenTable to allow for 15 minute chunks for reservations, and finally adjust the reservation quantity so you can better seat people on time!", "rating": 3, "date": "2018-08-14"}, {"excerpts": ["- Flank Steak - For $28 I expected more of the dish. ", "It was good but not $28 good in my opinion. ", "The meat was cooked well but the potion was so tiny much like the small potatoes and mushrooms they had on the side as well. ", "I also wasn't a fan of the small onions they had and I honestly confused them with some of the mushrooms on my dish as well.  ", "I will say that the gremolata they topped the meat with was the best part of the meal. "], "author": "Keizzel C.", "review": "I was walking to this place to dinner and I literally walked by it since the store front is so unassuming. From the moment you walk in you're transported to a new place with high ceilings and tons of wood. \n\n| Food | \n\nSadly for us the mussels were sold out for the night. \n\n- Burrata - SO GOOD! I love honey on my burrata so this was a no brainer. 5/5\n\n- Fried Artichoke - Not my fave. It's a great fried option and went well with the aioli but since artichokes have a distinct flavor I got tired of it. 3/5\n\n- Flank Steak - For $28 I expected more of the dish. It was good but not $28 good in my opinion. The meat was cooked well but the potion was so tiny much like the small potatoes and mushrooms they had on the side as well. I also wasn't a fan of the small onions they had and I honestly confused them with some of the mushrooms on my dish as well.  I will say that the gremolata they topped the meat with was the best part of the meal. 3/5\n\n- Creme Brulee - I always get brulee whenever it's on the menu but I was shocked when this one came to the table. I'm used to seeing it in a round so it was weird to see it in a pastry. The custard didn't have the nice crisp on the top that you crack to get into the warm mixture. It seemed like this dessert was premade and put in a fridge to be brought out to order vs being made to order and being melt in your mouth. 2/5\n\n| OVERALL | \n\nOur waitress was awesome and definitely made the experience. It's not the cheapest option for food in SF but it's a nice place to try. I saw it packed during HH so the drinks seem to be popular.", "rating": 3, "date": "2017-08-13"}, {"excerpts": ["Husband chose the flank steak with potatoes (amazing!) ", "and I had the mushroom pasta (a little underwhelming). ", "I thought the pasta could've used something... just couldn't put my finger on what it was. ", "Perhaps it was not warm enough when it reached me or needed a little salt; it was just okay. ", "Doesn't matter, though! ", "Got to try some of my husband's scrumptious steak and chimichurri. ", "Still giving it five stars because the place is lovely, the service great, and the drinks strong. ", "I'll def get the steak next time we come through with reservations. ", "Thanks for having us!"], "author": "Joanna R.", "review": "Had a wonderful time last night on an impromptu dinner date with husband at Per Diem. Monday night and this place is BU-SAY! So I suggest you make reservations in advance if you're actually looking to snag a table. We had to sit at the bar and listen to the most annoying drunk guy berate and curse out what I assume were two co-workers for 70% of our meal (could not *wait* for him to leave).\n\nOur bartender/server was awesome and made us the most delicious drinks called \"Day Trader.\" Can't go wrong with that. Complimentary bread was my husband's favorite (sourdough) even if too hard for my taste. We had the meatballs to start which were tasty but I kind of stayed wanting to try the avocado toast so I guess next time that'll be it. Husband chose the flank steak with potatoes (amazing!) and I had the mushroom pasta (a little underwhelming). I thought the pasta could've used something... just couldn't put my finger on what it was. Perhaps it was not warm enough when it reached me or needed a little salt; it was just okay. Doesn't matter, though! Got to try some of my husband's scrumptious steak and chimichurri. Still giving it five stars because the place is lovely, the service great, and the drinks strong. I'll def get the steak next time we come through with reservations. Thanks for having us!", "rating": 5, "date": "2017-09-26"}], "roasted chicken breast": [], "chicken kale": [{"excerpts": ["I could have ordered the Chicken Kale salad.  ", "It looked good. ", "The dressing would have come on the side.  "], "author": "Denis S.", "review": "When you go on a business trip, a lot of companies allocate a certain amount of money to spend per each meal (assuming they want their employees to survive). This is called a Per Diem.  In other words, COME HERE FOR BUSINESS. \n\nLots of guys in tucked-in blue shirts here. \n\nI could have ordered the Chicken Kale salad.  It looked good. The dressing would have come on the side.  I would have walked out, head held high, proud of myself.\n\nI ordered the tri-tip sandwich.  Everyone else was getting sandwiches!  I'm weak. It was delicious.", "rating": 4, "date": "2018-02-16"}, {"excerpts": ["I have also had their chicken kale salad and it was also very meh. ", "Great space and ", "it has a lot of potential."], "author": "Shabnam E.", "review": "I have come here a couple times for work lunches and I really, really wish they had better salads. Their beet goat cheese salad is basically all large pieces\nof beets and a tiny amount of greens, not really what you would hope. I have also had their chicken kale salad and it was also very meh. Great space and it has a lot of potential.", "rating": 3, "date": "2018-04-02"}, {"excerpts": ["Went for a lunch meeting and had the chicken kale salad! ", "Super tasty!"], "author": "Maria R.", "review": "Went for a lunch meeting and had the chicken kale salad! Super tasty!", "rating": 5, "date": "2018-05-30"}], "millet  chickpea": [], "tuna nicoise": [{"excerpts": ["We ordered: Mushroom pasta, Mussels and Fries, and Tuna Nicoise (in order of fav to least fav). \n\n"], "author": "Sheewon B.", "review": "We ordered: Mushroom pasta, Mussels and Fries, and Tuna Nicoise (in order of fav to least fav). \n\nI give the food 3+ stars. As good as the food is, I actually ended up enjoying the bread the most. I'm not sure if it's because the food felt like standard regular food you can get at a regular tavern or American food restaurant, or because the food was a tad on the expensive side for what you get. Maybe I ordered wrong. \n\nWhy the extra star? Great location, they take reservations, and the service was fantastic. That's what you need when you have exactly 1 hour for lunch in the Financial District!", "rating": 4, "date": "2018-01-21"}, {"excerpts": ["I was between the Tuna Nicoise salad and the mussels.  ", "M. got the tri tip sandwich, and was willing share the fries ", "so I went ahead with the mussels.  ", "As Cherylynn  mentioned in her 2012 review, the mussels were very tiny, but tasty.  ", "There was very little broth with mine, and it was just white wine with a little garlic.  ", "I thought the portion was small, and I wished they had been served in a deeper bowl, so they would have stayed hotter and allowed more broth. ", "They only gave me one toast point with it though, so I wouldn't have been able to soak up much more.  ", "The tri tip looked a little well done for my taste, and I forgot to ask how she liked it, but it looked good, especially the caramelized onions.  "], "author": "Diane B.", "review": "Well, now I'm not quite sure why I bookmarked Per Diem.  Did someone write a great review or something?  The menu was pretty uninspired.  It was certainly a good location for meeting my cousin, though, who was getting her hair cut at the Galleria, and you could practically roll there from the BART Montgomery stn.  I had expected something that looked more like John's or Tadich's.  The decor here felt more like someplace in Frontierland.  We were seated upstairs, which was quieter.  I appreciated that, because I knew it would be a gab fest.\n\nWe did not order drinks.  I was between the Tuna Nicoise salad and the mussels.  M. got the tri tip sandwich, and was willing share the fries so I went ahead with the mussels.  As Cherylynn  mentioned in her 2012 review, the mussels were very tiny, but tasty.  There was very little broth with mine, and it was just white wine with a little garlic.  I thought the portion was small, and I wished they had been served in a deeper bowl, so they would have stayed hotter and allowed more broth. They only gave me one toast point with it though, so I wouldn't have been able to soak up much more.  The tri tip looked a little well done for my taste, and I forgot to ask how she liked it, but it looked good, especially the caramelized onions.  The fries unfortunately weren't very hot, and could have used a little longer in the fryer, but we managed to down all of them.\n\nService was excellent.  There when we needed him, not when we didn't, had a good sense of humor and patient with us as we chatted away long after finishing our food.", "rating": 3, "date": "2017-07-30"}], "watermelon  heirloom tomato": [], "smoked bacon": [{"excerpts": ["I recommend the Smoked Bacon Flatbread over this one.\n\n"], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}, {"excerpts": ["For appetizers we ordered the avocado toast, charcuterie board, and smoked bacon flat bread.  ", "Have to say that the flat bread was the winner out of those!  "], "author": "Shannon L.", "review": "Very nice place to grab lunch in FiDi if it's for business or a special occasion.  Very nice vibes on the inside, but you're paying for it.  For appetizers we ordered the avocado toast, charcuterie board, and smoked bacon flat bread.  Have to say that the flat bread was the winner out of those!  I had the wild mushroom pasta dish.  The portion is on the small side (I chowed down that whole thing), but it tastes delicious.  The egg on top is like the cherry on top.     \n\nThe apple tart was bomb!  Even though I wasn't hungry at that point, there's always room for dessert.  The caramel ice cream on the side is a little too sweet for me, but yumm loved the tart.", "rating": 4, "date": "2017-10-01"}, {"excerpts": ["Orders: wild mushroom pasta, smoked bacon flatbread, & burrata tartine ", "- we acted like this was dessert justifying our add on. ", "$$$ for 2 and for lunch, worth it and would go back again."], "author": "Kim N.", "review": "recommend making reservations for lunch, we got lucky going early on a weekday but we were CLOSE to being turned away.\n\nEverything we ordered sounds pretty simple, but all tasted fresh and amazing.\n\nOrders: wild mushroom pasta, smoked bacon flatbread, & burrata tartine - we acted like this was dessert justifying our add on. $$$ for 2 and for lunch, worth it and would go back again.", "rating": 5, "date": "2017-07-31"}, {"excerpts": ["I had the Smoked Bacon flatbread. "], "author": "Yi Z.", "review": "Per Diem is a solid, reasonably priced, FiDi lunch spot. I work at 2nd/Folsom and most FiDi sit down options (or the ones at Embarcadero Center) are just too far away. If you want to go during prime lunch time, you will need to make a reservation several days in advance. \n\nWe were seated at a two top upstairs. The restaurant filled up within minutes. We ordered our meals and the food came out very quickly. My former boss had the Salmon Nicoise salad, which he clearly enjoyed. I had the Smoked Bacon flatbread. It was very satisfying and just the right size for lunch. \n\nAlthough Per Diem is not a budget lunch option, it is about 10-20% cheaper than other restaurants of similar quality and ambiance in the area. Inevitably, I'll be back.", "rating": 4, "date": "2017-05-01"}, {"excerpts": ["- smoked bacon flatbread: super tasty as well. ", "We each got one slice and the flatbread had a crisp and was perfectly thin, so it wasn't over filling. ", "The bacon and arugula was perfect. "], "author": "Amanda C.", "review": "Came here with a reservation for 6 with my coworkers on a Thursday afternoon. We were running late and asked to push the reservation  back twice, but they were very accommodating even with a slightly rude reply when I called the second time. We were seated upstairs and really liked the decor of the atmosphere. There's a bar upstairs too, which was convenient so people wouldn't have to go up and down the stairs. I started off with their lemonade, which was delicious and unlimited refills! My waiter took my lemonade when I was halfway done and I tried to stop him but he said he was refilling it, phew! Haha. We started off with a few appetizers to share before our main entree. Be sure to ask for bread as it is upon request.\n\n- charcuterie: loved the rye bread, but the fish wasn't anything special. It is a nice to have when there's a large party and we need something to munch on.\n- corn soup (seasonal): loved this! There was a kick of spice to it, and the portion was super generous. I had an entire bowl to finish and it definitely made me full before my main meal. I would reorder this dish for sure!\n- smoked bacon flatbread: super tasty as well. We each got one slice and the flatbread had a crisp and was perfectly thin, so it wasn't over filling. The bacon and arugula was perfect. Would reorder again, too.\n- rustic meatballs: also worth ordering again because the meatballs were super tasty and tomato-y. The bread went well with the leftover cheesy sauce. Meatballs were soft enough and flavorful enough.\n- mussels and fries: super generous portion again with a full bowl of fries. I couldn't finish my fries, but the flavor of the garlic and sweet onions in the mussels sauce made me finish our entrees first! Super tasty and easy to eat with the little fork. Fries were perfectly tasty too. My coworkers ordered the same dish and loved it as well. They even tossed the fries in the remaining sauce because it was that tasty!\n- steak and fries: I got to try my coworker's and thought the steak was cooked a little too bland. It lacked flavor, but the fries and tomatoes were on point.\n\nService was fast and super accommodating once we sat down. Food was delicious and I definitely recommend trying this place out.", "rating": 4, "date": "2017-09-24"}, {"excerpts": ["We started off with the Smoked Bacon Tarte Flambee. ", "This is a THIN flat bread shaped like a pizza. ", "It was good, but the bread was so thin, it was almost like eating air. ", "The Tarte Flambee will do nothing to help you satisfy your hunger. "], "author": "Maranda C.", "review": "I went here for a birthday dinner with my friends on a Friday night. They recently got a new head chef so the menu is different from what is on Yelp. Lots of the food you see in these photos are no longer being served. I would check Per Diem's website for the most updated menu.\n\nIt was our first time at this restaurant and everything was delicious! We started off with the Smoked Bacon Tarte Flambee. This is a THIN flat bread shaped like a pizza. It was good, but the bread was so thin, it was almost like eating air. The Tarte Flambee will do nothing to help you satisfy your hunger. I recommend skipping on this appetizer.\n\nFor my entree, I had the Pasta de la Min, and it was one of the best pastas I've ever had! The mushrooms, truffle sauce, and duck egg all blended very nicely, and despite not containing any meat, it was very flavorful. My only complaint about this dish was that it was not filling enough. The portions at this restaurant are pretty small, and one dish won't fill you up, unless you want to break the bank.\n\nI also had a bite of my friend's dish (Filet Mignon et Frites aux Homard) and it was delicious! The steak was flavorful, not too chewy, and my friend could not stop praising the lobster fries.\n\nWe finished dinner off with some mango cake and a salted caramel pie with ice cream (sorry, can't remember the names). Both were good, but the pie was better.\n\nOverall, I really enjoyed this restaurant and the food, despite the small portions. I told them it was my birthday in my reservation, but they didn't provide any sort of complimentary birthday dessert, just an FYI.\n\nFood: Delicious!\nPrice range: PRICEY! $20-$40+ per person\nService: Great! Our waitress was attentive and friendly\nDecor: We sat upstairs where the decor was library-themed. Intimate and cozy!\nAmbiance: Semi-dressy, classy\nSound: Moderate, it's louder downstairs where the bar is", "rating": 4, "date": "2015-09-15"}, {"excerpts": ["My two sons ordered the smoked bacon flatbread which they loved. ", "My husband had the tri tip sandwich, which he thought the meat was cooked perfectly. ", "I wanted to order something light, so I ordered the charcuterie board. ", "The board was filled with heavenly cheeses, meats, pickled vegetables and breads/crackers. ", "It looked so good that my youngest (6) decided to eat half of the meat on the board. ", "We will definitely come back when we are in town again."], "author": "K G.", "review": "This quaint, hole in the wall (you would pass by it, if you weren't looking) French contemporary take on California cuisine is so wonderfully eclectic, you leave wanting more. The ambience is low key and the menu, mouth watering. My two sons ordered the smoked bacon flatbread which they loved. My husband had the tri tip sandwich, which he thought the meat was cooked perfectly. I wanted to order something light, so I ordered the charcuterie board. The board was filled with heavenly cheeses, meats, pickled vegetables and breads/crackers. It looked so good that my youngest (6) decided to eat half of the meat on the board. We will definitely come back when we are in town again.", "rating": 5, "date": "2016-04-11"}], "artichoke  sun gold tomato": [], "burrata margarita": [{"excerpts": ["*Burrata Margarita Flatbread: tomato sauce, fresh basil, olive oil ($16)\n", "*", "Talisker 18 Year, Isle of Skye ($18) x2\n", "*"], "author": "Elena N.", "review": "I got off work early for the holiday weekend. What does that mean? Happy hour! I arrived first on Friday, May 25th a little after 4pm. No reservation as I don't think they take them for HH. Managed to find a small round table in the front by the window. One of the boys joined me shortly after and the other about an hour later.\n\nHappy Hour: served 4pm to 6pm\n*Glass of Wine - bartender's selection: sparkling, white, red ($8)\n*Bottle of Wine Special - bartender's selection: white, red ($30)\n*Standard & Pours: one shot, one beer ($9) x3\n\nI was by myself for a good 20 mins, so I just nursed a glass of HH bubbly. I never saw the bottle, but was told it was a prosecco. When one of the boys joined me, we took part in the wine bottle special. It was National Wine Day after all. The red bottle was Chronic Cellars Suite Petite, so I believe a petite sirah. When I found out the HH shot was a four roses (I think bourbon), I decided to take part. I think our server said the beer was a racer ipa. I just took a sip and pawned it off on the boys. (I'm not a huge beer person.)\n\n*Lobster Fries ($18)\n*Steamed Mussels: PEI mussels, garlic & white wine sauce, rustic toast ($13)\n*Rustic Meatballs: bellwether farms ricotta toast, san marzano tomato sauce, parmigiano, micro basil ($13)\n*Burrata Margarita Flatbread: tomato sauce, fresh basil, olive oil ($16)\n*Talisker 18 Year, Isle of Skye ($18) x2\n*Tomintoul 16 Year, Highland ($15)\n\nThey don't have HH food specials, so we just ordered from their Afternoon Delights menu since this was basically our dinner. I adored the lobster fries. Came topped with a good amount of lobster. And that sauce. So comforting and savory. The mussels were also good. Plump and tender. We all decided to end HH with a scotch whisky. I got the Talisker as I thought it was a good deal. $1 per year is typically a great deal when it's an 18 year, right?\n\nFun place for HH. I'd definitely come back for those fries and a bottle of wine.", "rating": 4, "date": "2018-05-29"}, {"excerpts": ["Burrata Margarita Flatbread -- ", "I LOVE burrata, but this flatbread was just OK. "], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}, {"excerpts": ["Had the Burrata Margarita Flatbread and the Roasted Tomato Soup... ", "It was DELICIOUS! ", "This place looks a little fancy, but it is very casual. ", "The staff was very prompt and polite. ", "I highly recommend giving this place a try! ", "You won't be disappointed!"], "author": "Jill F.", "review": "Had the Burrata Margarita Flatbread and the Roasted Tomato Soup... It was DELICIOUS! This place looks a little fancy, but it is very casual. The staff was very prompt and polite. I highly recommend giving this place a try! You won't be disappointed!", "rating": 5, "date": "2017-10-05"}, {"excerpts": ["And the burrata margarita flatbread was delicious!! ", "Definitely recommend the flatbread!! ", "Next time when looking for a HH spot in FiDi, def recommend trying out Per Diem!"], "author": "Em K.", "review": "Went here with a girlfriend for happy hour and did not disappoint! We made reservations at 5:15pm, and was taken to the 2nd floor. When asking for the happy hour menu, we were told we needed to be downstairs for that. So downstairs we went and lucky for us we spotted the last small table for 2. Took a bit for the waitress to come by and help us out, but understandable since it was busy. We ordered the HH special wine - 2 glasses of house Syrah ($6/glass), the mussels, fries, and the burrata flatbread. The wine did not disappoint. The mussels meat were kinda small and disappointing, but it tasted great! Nothing special about the fries (we didn't order the garlic fries), but liked that it came w/ ketchup and mayo. And the burrata margarita flatbread was delicious!! Definitely recommend the flatbread!! Next time when looking for a HH spot in FiDi, def recommend trying out Per Diem!", "rating": 4, "date": "2017-04-06"}], "free range chicken sandwich": [], "confit albacore tuna sandwich": [], "tritip": [], "burger royale": [{"excerpts": ["Ordered the burger royale medium rare ", "and it's delicious.   ", "Although tried my buddy's tri-tip sandwich. ", "yummy!"], "author": "Paul T.", "review": "This place is great.  I haven't tried any dinner here yet.  But the lunch burger and tri tip sandwich is great.  Ordered the burger royale medium rare and it's delicious.   Although tried my buddy's tri-tip sandwich. yummy!", "rating": 5, "date": "2018-02-01"}], "roasted asparagus fries": [], "green bean almondine": [{"excerpts": ["Burrata tartine (honey, almonds, salt) - 3/5\nGreen bean almondine (toasted almonds, lemon brown butter) - 2/5\n"], "author": "Mark O.", "review": "Dinner review.\n\nBurrata tartine (honey, almonds, salt) - 3/5\nGreen bean almondine (toasted almonds, lemon brown butter) - 2/5\nWild mushroom pasta (egg, truffle sauce) - 2/5\nSquid ink linguini (prawns, scallops) - 4/5\n\nOverall, \"A-OK.\"", "rating": 3, "date": "2017-07-10"}], "proyecto diaz coffee": [], "scrimshaw pils fort bragg ca oz": [], "saint archer pale ale san diego ca oz": [], "calicraft cali cöast kolschstyle ale walnut creek ca oz": [], "hell or highwatermelon wheat san francisco ca oz": [], "golden state dry cider sebastopol ca oz": [], "modern times hibiscus gose san diego ca oz": [], "anchor steam san francisco ca oz": [], "ninkasi dawn of the red ira eugene or oz": [], "bear republic racer  ipa healdsburg ca oz": [], "stone brewing ruination ipa san diego ca oz": [], "track  nukin futz porter sacramento ca oz": [], "rotating handle": [], "amstel light amsterdam netherlands": [], "sierra nevada pale ale chico ca": [], "duvel breendockpuurs belgium": [], "chimay blue label baileux belgium": [], "ballast point sculpin ipa san diego ca": [], "hitachino nest white ale nakashi japan": [], "avery brewing lilikoi kepolo white ale can boulder co": [], "delirium tremens strong blonde ale melle belgium": [], "clausthauler na frankfort germany na": [], "thyme and potion": [{"excerpts": ["And our server, lovely Jessica with the oh-so-tiny waistline (she must not eat those tri-tip sandwiches every time she works there as I surely would), recommended Thyme and Potion, a very tasty and herbaceous cocktail, as she described it, to accompany my lunch. "], "author": "Kim N.", "review": "Three words: tri-tip sandwich. You need to know nothing more and nothing less. You just need to order it to experience pure deliciousness! Crunchy, meaty, cheesy, salty, sweet (carmalized onions). It was perfect.\n\nAnd our server, lovely Jessica with the oh-so-tiny waistline (she must not eat those tri-tip sandwiches every time she works there as I surely would), recommended Thyme and Potion, a very tasty and herbaceous cocktail, as she described it, to accompany my lunch. Yum!\n\nThat was days ago and I'm still thinking about that entire experience and wondering when I can repeat it again! Seriously.", "rating": 5, "date": "2016-12-26"}], "calsalida": [], "sutter bird": [], "golden gate spritz": [{"excerpts": ["Got a Golden Gate Spritz, super refreshing! \n\n"], "author": "Sirijit P.", "review": "Came in on a Thursday evening and it was busier than I expected but the food came out really quickly! Especially liked the avocado toast and fried artichoke hearts. Everyone behind the bar was friendly and the cocktails are a really good price for this side of town. Got a Golden Gate Spritz, super refreshing! \n\nWould definitely come in again for lunch during the week. Didn't have a beer while I was here but they've got a great selection on tap.", "rating": 5, "date": "2017-06-22"}, {"excerpts": ["I ordered a cucumber gimlet and my friend had a Golden Gate Spritz off of their cocktail menu, both of which were great! "], "author": "Karlie C.", "review": "Went into Per Diem on a weeknight with a girlfriend for drinks and a few snacks. We were able to find a couple open seats at the bar and were warmly greeted by Griffen/Gryffin (not sure how to spell it?) and Arnie who were bartending. The restaurant was pretty busy and the bartenders were definitely slinging drinks left and right for everyone, but they still had time to make sure we were taken care of right away. Big compliments to the entire staff for being kind and courteous throughout our stay.\n\nI ordered a cucumber gimlet and my friend had a Golden Gate Spritz off of their cocktail menu, both of which were great! Saw someone order a Billionaire Bramble next to me and I had to add it to my \"must order\" list ; ) Solid selection of beers and other spirits which I'm excited to sift through during my next visits. As for food, we ordered the avocado toast, burrata tartine, margherita flatbread and fried artichoke hearts--YUM! Everything came out promptly and definitely satisfied our hunger pangs. \n\nOverall, I'm really pleased with Per Diem and glad that I came in for a good time! If you're looking for swift and sweet service, tasty bites and craft cocktails that pack a punch, this is the spot for you. Will definitely be back for more drinks and to try some dinner entrees! Steak and lobster, I'm looking at you.. *heart eyes*", "rating": 5, "date": "2017-06-22"}], "day trader": [{"excerpts": ["Our bartender/server was awesome and made us the most delicious drinks called \"Day Trader.", "\" ", "Can't go wrong with that. ", "Complimentary bread was my husband's favorite (sourdough) even if too hard for my taste. ", "We had the meatballs to start which were tasty ", "but I kind of stayed wanting to try the avocado toast ", "so I guess next time that'll be it. "], "author": "Joanna R.", "review": "Had a wonderful time last night on an impromptu dinner date with husband at Per Diem. Monday night and this place is BU-SAY! So I suggest you make reservations in advance if you're actually looking to snag a table. We had to sit at the bar and listen to the most annoying drunk guy berate and curse out what I assume were two co-workers for 70% of our meal (could not *wait* for him to leave).\n\nOur bartender/server was awesome and made us the most delicious drinks called \"Day Trader.\" Can't go wrong with that. Complimentary bread was my husband's favorite (sourdough) even if too hard for my taste. We had the meatballs to start which were tasty but I kind of stayed wanting to try the avocado toast so I guess next time that'll be it. Husband chose the flank steak with potatoes (amazing!) and I had the mushroom pasta (a little underwhelming). I thought the pasta could've used something... just couldn't put my finger on what it was. Perhaps it was not warm enough when it reached me or needed a little salt; it was just okay. Doesn't matter, though! Got to try some of my husband's scrumptious steak and chimichurri. Still giving it five stars because the place is lovely, the service great, and the drinks strong. I'll def get the steak next time we come through with reservations. Thanks for having us!", "rating": 5, "date": "2017-09-26"}], "billionaire bramble": [{"excerpts": ["I was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. ", "I had to settle with the Barbary Coastin' which was no where comparable. "], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}, {"excerpts": ["Saw someone order a Billionaire Bramble next to me ", "and I had to add it to my \"must order\" list ; ) ", "Solid selection of beers and other spirits which I'm excited to sift through during my next visits. "], "author": "Karlie C.", "review": "Went into Per Diem on a weeknight with a girlfriend for drinks and a few snacks. We were able to find a couple open seats at the bar and were warmly greeted by Griffen/Gryffin (not sure how to spell it?) and Arnie who were bartending. The restaurant was pretty busy and the bartenders were definitely slinging drinks left and right for everyone, but they still had time to make sure we were taken care of right away. Big compliments to the entire staff for being kind and courteous throughout our stay.\n\nI ordered a cucumber gimlet and my friend had a Golden Gate Spritz off of their cocktail menu, both of which were great! Saw someone order a Billionaire Bramble next to me and I had to add it to my \"must order\" list ; ) Solid selection of beers and other spirits which I'm excited to sift through during my next visits. As for food, we ordered the avocado toast, burrata tartine, margherita flatbread and fried artichoke hearts--YUM! Everything came out promptly and definitely satisfied our hunger pangs. \n\nOverall, I'm really pleased with Per Diem and glad that I came in for a good time! If you're looking for swift and sweet service, tasty bites and craft cocktails that pack a punch, this is the spot for you. Will definitely be back for more drinks and to try some dinner entrees! Steak and lobster, I'm looking at you.. *heart eyes*", "rating": 5, "date": "2017-06-22"}], "gold rush": [{"excerpts": ["I love live jazz and older themed restaurants so the gold rush vibe and candles were fun to be around. "], "author": "Wendy C.", "review": "Went here for a casual dinner the other night after loving it the first time my old boss took me.\n\nI love live jazz and older themed restaurants so the gold rush vibe and candles were fun to be around. They even had real books lining the walls! \n\nWe had the rustic meatballs, wild mushroom pasta, squid ink linguini, and apple tart which were all fantastic. I had the linguini which was perfectly salted, lemony, and well-proportioned. I feel like it's a great starter if you're not sure what to order here.\n\nMight've picked a bad night though because a large party was seated right next to us with mics, which had a lot of loud feedback. When the hostess was leading me to the table, the crowd wouldn't part for her and she apologized to me (definitely not her fault).", "rating": 4, "date": "2017-09-23"}, {"excerpts": ["The decor is apparently inspired by the 1849 Gold Rush with a predominance of dark woods and steel beams with a marble bar and a conspicuous chandelier encased in an oversized glass lantern. ", "There's a 60's-style abstract painting of the Transamerica building at the bar which I assume is mounted there to remind you what city you're in. "], "author": "Ed U.", "review": "Per Diem strikes me as a coy, rather self-satisfied name for this eclectically chic FiDi eatery. What this place has to do with anybody's daily allowance, I just don't know, although I could well imagine a lot of suits on expense accounts dining here to keep up appearances. The decor is apparently inspired by the 1849 Gold Rush with a predominance of dark woods and steel beams with a marble bar and a conspicuous chandelier encased in an oversized glass lantern. There's a 60's-style abstract painting of the Transamerica building at the bar which I assume is mounted there to remind you what city you're in. I've come here for lunch twice now, both times as a solitary diner at the bar just trying to test the limits of my plant-based dietary direction.\n\nThe first time I came I tried the $12 Panzenella Salad with Bloomsdale Spinach, which I thought was pretty good though a bit hamstrung from the puckery flavor of the fresh lemon oregano vinaigrette that was doused over it. It was mixed with chunks of roasted root vegetables, mostly turnips, and topped with shaved pecorino. The second time I visited, I ordered the $13 Berries and Rucola Salad, which was certainly pretty on the plate (see photo). The fresh raspberries and blackberries freckled the peppery greens and offered a nice contrast. It only came with two Shaft bleu cheese fritters, and I couldn't even taste the bacon lardons or even the bacon vinaigrette. On both trips, I ordered the $4 cup of Soup of Yesterday, which I assume was made for the dinner menu from the evening prior.\n\nI must admit the soup was the best part of both lunches probably because in both cases, it was luxuriantly creamy. The most memorable was the Carrot Puree with a drizzle of what I assumed to be extra virgin olive oil infused with red peppers (see photo). Chef Adam Hinojosa comes from the more traditional Osteria, so the Italian accents in the dishes are to be expected here. I'm not sure if the upstairs room has more of a dining room ambiance since the downstairs area appears to be centered around the bar with a robust wine and cocktail menu. Perhaps I'll come back with some colleagues to try those. Right now, my impression is that the food is above average with prices that seem a tad excessive for the portions. I would really need a per diem to cover the bill.\n\nFOOD - 3 stars...pretty good salads, soup is better even if it was made yesterday\nAMBIANCE - 4 stars...nice decorator touches and quieter than you would expect, at least for lunch\nSERVICE - 3 stars...reasonable, nothing more\nTOTAL - 3 stars...middling until I try some of their other entrees, I hope", "rating": 3, "date": "2012-06-14"}, {"excerpts": ["Boosting two levels and two bars with dark woods, bronzes, and steel beams the ambiance was reminiscent of the Gold Rush Era. ", "The space screams ", "M-O-N-E-Y which is correctly captured in their old money and new money cocktail list. ", "Glancing over the $13 cocktails, I asked myself, \"So THIS is what consultants use their per diem (daily allowance) for?", "\" "], "author": "Cherylynn N.", "review": "2.5 STARS \n\nFresh out of college and at my first office job was the first time I ever heard the term \"per diem\". Filing consultant contracts, I would be in awe of the payment terms \"USD 1,000 per day plus $150 per diem\". As I looked at my paycheck, I would silently curse at myself for ever majoring in Human Resources aka Professional Paper Pusher aka Office B*tch. \n\nFrom the people that brought you The Brick Yard (a sports bar in the Marina) comes Per Diem which is located in the epicenter of the Financial District. Boosting two levels and two bars with dark woods, bronzes, and steel beams the ambiance was reminiscent of the Gold Rush Era. The space screams M-O-N-E-Y which is correctly captured in their old money and new money cocktail list. Glancing over the $13 cocktails, I asked myself, \"So THIS is what consultants use their per diem (daily allowance) for?\" Again, I silently cursed at myself; talk about choosing the wrong career path. \n\nAlthough categorized as New American cuisine, Per Diem's menu is very Italian-centric. With 5 apps, 4 salads, 5 pasta, 4 entrees, and 3 pizzas options, I thought the menu was a bit scant (the online menu had more choices). Unless you're carbo loading for a marathon, there were few options. \n\nWith my imaginary per diem to burn, I started with the Blue Chip Martini w/ Bleu Cheese & Olive Crostini ($13). http://www.yelp.com/biz_photos/MXy-YMQCWpBJf92HFRhGhw?select=4yVLomcsA_-c0l1U4g3Jsw Worth every penny, the Nolet's Gin martini was stiff and made for one \"happy\" hour sans the happy price.  \n\nWe started our meal with the PEI Mussels in a Fennel Sausage Broth ($12). http://www.yelp.com/biz_photos/MXy-YMQCWpBJf92HFRhGhw?select=6havZYT-e-fqvAcXcJ-MSA What the mussels lacked in size, the complexity of the broth made up in flavor. The rich, herbaceous broth was intensified with the small chunks of fatty sausage. I think \"spicy\" was inadvertently omitted from the title as the broth packed quite a powerful and lingering heat. \n\nEverything was going seemingly well until I got my entree. The Braised Tomato Truffle Brisket, Lentils & Marinated Cipollini Onions ($21) was a disaster on a plate and should have never left the kitchen.  http://www.yelp.com/biz_photos/MXy-YMQCWpBJf92HFRhGhw?select=mjnQ_DyMJRmv3A6qypco1w The brisket bricks were severely underseasoned and not braised long enough (to break down the collagen in the connective tissue) causing the texture to be that of shoe leather. Instead of a butter knife, a chain saw should have been included with this dish. http://www.yelp.com/biz_photos/MXy-YMQCWpBJf92HFRhGhw?select=BsSgdKyB2osonsfzswGb9w The accompanying lentils were overcooked to a prison food mush. Tomatoes? Truffles? I think they were playing hide & seek on me as not even an essence was present. \n\nService was pleasant but unpolished; understandable for a restaurant open less than three months. However, simple things like providing new utensils (after taking ours away) and refilling BOTH our water glasses were overlooked. \n\nThough Per Diem has solid cocktails, their menu and food need work. I'll be back though...the day I have the luxury of a per diem. Until then, I will happily enjoy my $2 Gordon's Gin & Tonic at the Tappa Kegga Dayya brotherhood event at City Tavern in the Marina on Tuesday nights. PUMA NIGHT! *WOOT*", "rating": 3, "date": "2012-03-07"}, {"excerpts": ["Cheers to the \"Cali Gold Rush-esque\" corner of town, much needed to spread out the happy hour crowd as we could always use another outpost in FiDi. ", "I can only recommended that you get there early enough to grab a seat at the bar....and spend your 4 hours drinking and eating until your liver and heart's content."], "author": "Jessica C.", "review": "To save you from holding your breath - I'm giving 4 stars for now until the 2nd floor opens... in which, I'm looking forward to providing my 5th. \n\nOk, let's start. Read about Per Diem through the various SF blogs and was amp'ed to check out what all the fuss was about. And let's just say, if you hang out at a restaurant bar for 4-5 hours on a Friday afternoon, you're probably having a pretty damn good time and so it was on 12/30/11. Trickled in for lunch on a Friday afternoon, found a couple seats at the bar as the rest of the 1st floor tables were taken and what a great decision it was. Jake at the bar was kind enough to be the server helping us as we started off with a Four Roses Bourbon Manhattan and some Barbera wine....which we had a chance to taste before committing...who does that? Anyways, we ordered Mary's Chicken(roasted with potatoes) and the Brisket sando. Both were lovely - moist, juicy and flavorful.\n\nWhat helped us stay for 4-5 hours? Awesome drinks by the likes of French 75's, negroni's, beer selection, Fortaleza tequila, jumbo-@$$ shrimp cocktails(reminded me of being at Mastro's in LA), this lil ricotta on toasted bread app, more French 75's, and solid service from Jake from Boston, Chris Parks and the entire team. \n\nThe 2nd floor is yet to be open but I'm looking forward to heading back to Per Diem to see the \"expansion\", try everything else on the reasonably priced menu and awesome ambiance. Cheers to the \"Cali Gold Rush-esque\" corner of town, much needed to spread out the happy hour crowd as we could always use another outpost in FiDi. I can only recommended that you get there early enough to grab a seat at the bar....and spend your 4 hours drinking and eating until your liver and heart's content.", "rating": 4, "date": "2012-01-02"}], "perfect yen": [{"excerpts": ["My friends ordered the Perfect Yen & thought it was an OK drink.\n\n"], "author": "Carol N.", "review": "Came to Per Diem a second time with friends for dinner, but unfortunately it did not live up to my first visit.\n\nBurrata Margarita Flatbread -- I LOVE burrata, but this flatbread was just OK. I recommend the Smoked Bacon Flatbread over this one.\n\nRoasted Tomato Soup -- I LOVE tomato soup, too. This soup was good, but unfortunately came out lukewarm, bordering cold for us. Appreciated the server splitting the soup for us, but wouldn't order again.\n\nRustic Meatballs -- meatballs weren't very special, but the tomato sauce was good.\n\nWild Mushroom Pasta -- underwhelming dish & the pasta was a way more al denta than I would prefer; wouldn't order again.\n\nSteak & Lobster -- we asked for medium rare, but the steak came out more medium; thought the lobster was decent.\n\nRoasted Brussels Sprouts -- nothing really stood out this time for me with this side.\n\nI was particularly sad about their drinks being seasonal because I was REALLY looking forward to ordering the Billionaire Bramble. I had to settle with the Barbary Coastin' which was no where comparable. My friends ordered the Perfect Yen & thought it was an OK drink.\n\nOverall, I may be a little hesitant to come back for another dining experience, but not completely deterred. Still plenty of other dishes to try, service is good, & provides a nice atmosphere. Can make reservations easily through Open Table!", "rating": 3, "date": "2018-02-02"}], "cava kila spain": [], "cremant brut rosé bailly lapierre nv burgundy": [], "champagne veuve clicquot nv champagne": [], "bordeaux blanc chateau haut rian  bordeaux": [], "sauvignon blanc alysian  dry creek valley": [], "soave pieropan  veneto": [], "riesling zocker  edna valley": [], "chardonnay hartford court  russian river": [], "gruner veltliner domäne wachau  austria": [], "rosé withers  el dorado": [], "pinot noir j christopher  willamette valley or": [], "montepulciano zaccagnini  abruzzo": [], "zinfandel bodkin  sonoma county": [], "gsm grenache syrah mourvedre kunin pape star  central coast": [], "syrah delas  côtes du rhône": [], "malbec catena  mendoza": [], "cabernet sauvignon newton  sonoma county": []}