{"can of soda": [], "lemonade": [], "lemon iced tea": [], "perrier": [], "young coconut juice with pulp": [], "glass bottle of soda": [], "arizona green tea": [], "san pellegrino": [], "veggie summer rolls": [{"excerpts": ["Had the veggie summer rolls and the 5 spice chicken with garlic noodles.  ", "So darn good!  ", "Very casual place. ", "Order at the counter, choose your own table, and they bring it out to you.  ", "We will be coming back here...a lot. :-)"], "author": "Daniel A.", "review": "Excellent!  Reasonable prices...friendly service...and the food was wonderful.  Had the veggie summer rolls and the 5 spice chicken with garlic noodles.  So darn good!  Very casual place. Order at the counter, choose your own table, and they bring it out to you.  We will be coming back here...a lot. :-)", "rating": 5, "date": "2015-09-28"}], "shrimp rolls": [{"excerpts": ["We ordered a chicken vermicelli and a veggie vermicelli and shrimp rolls (these have mint in them btw). "], "author": "Jingxi Z.", "review": "I've been to the Sunset location several times and love their vermicelli but this time we ordered from Caviar. We ordered a chicken vermicelli and a veggie vermicelli and shrimp rolls (these have mint in them btw). They ran out of veggie vermicelli and instead gave us 2 chicken vermicellis (sorry for not picking up the phone!)\n\nI honestly really enjoyed the vermicelli, which was simple enough with salad, a huge bed of noodles, with juicy pieces of chicken on top. The sauce/dressing comes on the side. The meal tasted really light and fresh and best part of all, the portions were huge!", "rating": 4, "date": "2016-05-24"}, {"excerpts": ["I ordered shrimp rolls, garlic noodles with five spice chicken, and vermicelli with grilled shrimp. ", "I wanted a bánh ", "mi- ", "but they only serve these until 3. ", "Darn. "], "author": "Molly D.", "review": "I have been waiting for a Vietnamese restaurant to open that's close enough for me to stumble to whenever I have the craving. Perilla fills this niche really well.\n\nI ordered shrimp rolls, garlic noodles with five spice chicken, and vermicelli with grilled shrimp. I wanted a bánh mi- but they only serve these until 3. Darn. Now I'll have to come back to get one for lunch to be able to fully experience everything.\n\nI took my food to go and the service was fast, friendly- beyond friendly- they were genuinely appreciative of my business, like for reals friendly. The food was great- fresh, great flavors, great portion size without skimping on the good stuff (shrimp, fresh herbs, meat).\n\nI will be back!", "rating": 5, "date": "2015-08-17"}, {"excerpts": ["The shrimp rolls were super fresh and the garlic noodles with grilled pork was superb. ", "I would only comment on the price; $27 for a beer, rolls, and noodles with pork. ", "In the lower Haight. ", "I know the neighborhood is changing, and perhaps this is totally driven by rents, but still, this is not what I expect around here. ", "I would go certainly back, perhaps more demanding, but questioning, perhaps, value."], "author": "Ken K.", "review": "Absolutely nothing wrong with the food here! The shrimp rolls were super fresh and the garlic noodles with grilled pork was superb. I would only comment on the price; $27 for a beer, rolls, and noodles with pork. In the lower Haight. I know the neighborhood is changing, and perhaps this is totally driven by rents, but still, this is not what I expect around here. I would go certainly back, perhaps more demanding, but questioning, perhaps, value.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["Also got the shrimp rolls.  ", "Pretty bland."], "author": "David F.", "review": "I'd give it 3 stars, my date gives it 2.  We wanted Pho, but what they served was not pho.  They used fried chicken!! that's not right.  The broth was tasty.  The noodles OK.  Also got the shrimp rolls.  Pretty bland.", "rating": 3, "date": "2016-04-17"}], "grilled pork rolls": [{"excerpts": ["Appetizers are just ok except for the grilled pork rolls which are very savory, especially with the vinegary dipping sauce. \n\n"], "author": "Jennifer O.", "review": "#27/2016\n\nI've enjoyed Perilla's addictive 5-spice chicken and garlic noodles for years: Juicy, flavorful, succulent slices of chicken that I've tried to duplicate in my kitchen but haven't (yet!) been successful. \n\nPaired with buttery garlic noodles studded with so much minced garlic, you could walk through Golden Gate park at night and scare away vampires.  \n\nThe combination is truly delicious and I seem to order only that for the past few years.\n\nBut, I have broken from habit or ordered a different dinner for little one and we've had the grilled prawns and vermicelli (I recall it was light on the amount of shrimp), the grilled pork and garlic noodles (very good) and had my socks knocked off by the yellow curry chicken soup, comforting on a cold and rainy day.\n\nAppetizers are just ok except for the grilled pork rolls which are very savory, especially with the vinegary dipping sauce. \n\nExtremely disappointing are Perilla's Imperial rolls. Being a Vietnamese restaurant, this classic dish should be a slam-dunk but Perilla's are anything but: Rubbery, almost chalky, as opposed to crispy-crunchy and savory, there's something really wrong with their recipe and it's wrong in both the Irving Street and Haight Street locations.\n\nConversely, their Thai iced tea is wonderful, the perfect meal accompaniment/dessert.\n\n3.5 stars rounded up to 4 stars for the extra good service (both at the restaurants and for delivery) and for their 5-spice \"crack\" chicken.\n\nPerilla's chicken really is the bomb.", "rating": 4, "date": "2016-02-21"}], "cabbage salad with fried tofu": [], "papaya salad with beef": [], "papaya salad with prawns": [], "cabbage salad with chicken": [], "grilled beef rolls": [], "veggie crispy rolls": [], "combo rolls": [{"excerpts": ["We ordered the combo rolls and the Chicken Curry Ramen soooooooooo soooooo delicious. ", "I can't wait to come back again! ", "Thank you"], "author": "Charlotte D.", "review": "Service was great! Food was delicious. We ordered the combo rolls and the Chicken Curry Ramen soooooooooo soooooo delicious. I can't wait to come back again! Thank you", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["We ordered the papaya shrimp salad, combo rolls, beef garlic noodle and curry chicken garlic noodle. ", "Michael the owner brought us out (ON THE HOUSE) ", "Imperial rolls..", "they were fresh and very hot (temperature) and so delicious!! ", "All of our food was very clean and healthy, garlic noodles are usually dripping with oil or butter very greasy..", "NoT ", "here you, you can taste the butter and garlic ", "but it's not visible!!! ", "The beef was tender and very flavorful!! ", "The curry chicken was spiced just right and very soothing! ", "The combo rolls were clean and very tasty!! ", "Michael also brought us a sample of his pho broth, we were both amazed how clean it tasted and you could actually taste the spices used in the broth!!! ", "And don't let me forget about the sample of the 5 spice chicken!! ", "AMAZING!  ", "You must go try this restaurant!! ", "If you like good clean healthy flavorful food...run don't walk to Perilla on haight!"], "author": "Ellen T.", "review": "The food here was delicious! We ordered the papaya shrimp salad, combo rolls, beef garlic noodle and curry chicken garlic noodle. Michael the owner brought us out (ON THE HOUSE) Imperial rolls..they were fresh and very hot (temperature) and so delicious!! All of our food was very clean and healthy, garlic noodles are usually dripping with oil or butter very greasy..NoT here you, you can taste the butter and garlic but it's not visible!!! The beef was tender and very flavorful!! The curry chicken was spiced just right and very soothing! The combo rolls were clean and very tasty!! Michael also brought us a sample of his pho broth, we were both amazed how clean it tasted and you could actually taste the spices used in the broth!!! And don't let me forget about the sample of the 5 spice chicken!! AMAZING!  You must go try this restaurant!! If you like good clean healthy flavorful food...run don't walk to Perilla on haight!", "rating": 5, "date": "2017-02-19"}], "fried chicken wings": [], "fresh avocado roll": [], "fried tofu roll": [], "spice chicken noodle soup": [], "curry chicken noodle soup": [{"excerpts": ["The curry chicken noodle soup was bland. ", "The curry flavor was barely noticeable and they use chunks of chicken thigh. ", "I'd personally prefer white meat chicken, but hey, maybe that's just me. "], "author": "Jessica L.", "review": "Iza's line was way too long. It was cold and rainy so we opted for Perilla instead. I can't say I was thrilled about my meal. I would probably be more satisfied at PPQ. \n\nInteresting set up. You order, grab a number, and the food is brought to your table.\n\nThe curry chicken noodle soup was bland. The curry flavor was barely noticeable and they use chunks of chicken thigh. I'd personally prefer white meat chicken, but hey, maybe that's just me. I couldn't finished mainly because I wasn't satisfied with the flavors. \n\nThe garlic noodles are standard to their sister restaurants but I felt the garlic flavor lacking in comparison to Swamp or PPQ Dungeness Island. \n\nMy friend ordered the five spice chicken vermicelli. The chicken skin was rubbery and not crispy enough. Added the imperial rolls for $2.65 but really, it's adding ONE imperial roll for $2.65.\n\nAll in all, the meal seemed pretty pricey for 2 in terms of what you get. About $35 without drinks and tip.\n\nPro tip: \nCome after 6 for free metered parking. \n\nTLDR:\nGo to PPQ if you're craving garlic noodles or pho.", "rating": 2, "date": "2016-01-11"}, {"excerpts": ["My bf got the garlic noodles w/ five spice chicken, and I got the curry chicken noodle soup. ", "I loved the soup, which was super flavorful and filling. ", "They give a ton of noodles - I wish they gave more soup to match haha. ", "But the chicken, potato, and noodles were all cooked really well! "], "author": "Abby S.", "review": "Food (4/5): My bf got the garlic noodles w/ five spice chicken, and I got the curry chicken noodle soup. I loved the soup, which was super flavorful and filling. They give a ton of noodles - I wish they gave more soup to match haha. But the chicken, potato, and noodles were all cooked really well! I opted for the wider noodles, but you can get thinner rice noodles as well.\n\nMy bf and I also loved the five spice chicken - it's pan-fried, I think, so it was moist but crispy on the outside. The garlic noodles were a little dry for my taste, and the broccoli was a bit undercooked, but overall I'd def get either of these dishes again.\n\nValue (3/5): It's not that much food for $12+ haha, I think a fairer price would be $9. The soup is filling since they give you a ton of noodles, but I don't think either of us would've been full just with the garlic noodle dish.", "rating": 4, "date": "2016-05-08"}, {"excerpts": ["I ordered the Spicy Curry Chicken Noodle Soup. ", "It looked aesthetically pleasing to say the least. ", "The potatoes were perfectly cooked addition to the fall apart chicken and slightly creamy broth. ", "With just a sprinkle of sriracha it became the perfect level of spice for me. ", "At that point, restraining myself was a lost cause, and I managed to finish the entire bowl relatively quickly. ", "A privilege for my tastebuds, a well worth it torture for my digestive system. "], "author": "Shayan S.", "review": "This Perilla is sort of like the new sibling to the ones in Inner Sunset and on Mission, but it's the first one I've attended to thus far. Needless to say, I was particularily stoked for it - happy to see a solid Vietnamese restaurant open relatively late (10pm everyday) only a few blocks from me. The reason I'm giving it four stars is because I think they still have a bit of organizing to do - my order was lost for a second and took a tad longer to get to me (30 minutes during low traffic hour) and I got up to refill my water while eating only to find one of the bussers thinking I was done with my over half full bowl and taking it back to the kitchen. Luckily, I caught her in time to let her know I was just filling up my water and will happily finish my food still. Even with those mishaps, everyone that worked there was so kind and smiling, the owner even came and asked me if I was enjoying the food. I think as they get more used to running their restaurant, it'll run more smoothly.\n\nONTO THE FOOD YAAASSSS. I ordered the Spicy Curry Chicken Noodle Soup. It looked aesthetically pleasing to say the least. The potatoes were perfectly cooked addition to the fall apart chicken and slightly creamy broth. With just a sprinkle of sriracha it became the perfect level of spice for me. At that point, restraining myself was a lost cause, and I managed to finish the entire bowl relatively quickly. A privilege for my tastebuds, a well worth it torture for my digestive system. I was extremely full, regretting I ate so fast, and yet overly content with the taste.\n\nIt was dinner, and I'd happily come back to call it such again here. If we were only allowed five words in our reviews I think I would say: Trust me, take your time.", "rating": 4, "date": "2015-10-03"}], "prawns noodle soup": [], "pork noodle soup": [], "pork chops noodle soup": [], "beef combo noodle soup": [], "rare beef noodle soup": [], "brisket noodle soup": [], "mixed vegetables noodle soup": [], "curry veggie w tofu pho": [], "spice chicken garlic noodles": [], "curry chicken garlic noodles": [{"excerpts": ["I ordered the Curry Chicken Garlic Noodles for myself. ", "The garlic noodles were delicious but could have been a little more garlic-y in my opinion. ", "The curry had chicken and potatoes in a \"spicy coconut milk curry broth.", "\" ", "Curry was good but it definitely was not spicy at all which was a bit of a let down. "], "author": "Chisholm T.", "review": "Ordered takeout from Perilla and the delivery was very quick which is always a plus! Portion sizes were great - not too big but not small. \n\nThe Imperial Rolls included 3 rolls which were cut in half. Rolls were perfectly fried. Crispy and filled with ground pork, taro, carrots, and silver noodles with a side of sauce for dipping. Great appetizer if you like savory, crispy bites!\n\nI ordered the Curry Chicken Garlic Noodles for myself. The garlic noodles were delicious but could have been a little more garlic-y in my opinion. The curry had chicken and potatoes in a \"spicy coconut milk curry broth.\" Curry was good but it definitely was not spicy at all which was a bit of a let down. Had very mild flavor. \n\nNext time I think I'll try the Five Spice Chicken since it seems to be very popular! And of course the Imperial Rolls - those were tasty!", "rating": 4, "date": "2016-06-23"}], "beef garlic noodles": [{"excerpts": ["I asked what the most popular dish is - beef garlic noodles. ", "I decided on the shrimp garlic noodles. ", "*", "(for seafood lovers). ", "Yummy! ", "We also ordered the shrimp spring rolls. ", "Vermicelli was a bit on the dry side. ", "The portions of the entrees are quite smaller than most Vietnamese, but it was surprisingly filling and delicious. ", "Service was attentive and great."], "author": "Lydia V.", "review": "I asked what the most popular dish is - beef garlic noodles. I decided on the shrimp garlic noodles. *(for seafood lovers). Yummy! We also ordered the shrimp spring rolls. Vermicelli was a bit on the dry side. The portions of the entrees are quite smaller than most Vietnamese, but it was surprisingly filling and delicious. Service was attentive and great.", "rating": 4, "date": "2017-06-20"}], "prawn garlic noodles": [], "pork garlic noodles": [{"excerpts": ["The pork garlic noodles are amazing. ", "The owner and staff are a treat to deal with, and the food comes out quickly. ", "They also have an extensive beer collection. ", "Thumbs up!"], "author": "Kyle C.", "review": "The pork garlic noodles are amazing. The owner and staff are a treat to deal with, and the food comes out quickly. They also have an extensive beer collection. Thumbs up!", "rating": 5, "date": "2016-08-29"}], "pork chops garlic noodles": [], "mixed vegetable garlic noodles": [], "garlic noodle bowl": [], "curry mixed veggie tofu  garlic noodle": [], "spiced chicken rice": [], "curry chicken rice": [], "beef rice": [], "prawns rice": [], "pork rice": [], "pork chops rice": [], "mixed vegetables rice": [], "curry veggie with tofu rice": [], "spice chicken vermicelli": [{"excerpts": ["My friend ordered the five spice chicken vermicelli. ", "The chicken skin was rubbery and not crispy enough. "], "author": "Jessica L.", "review": "Iza's line was way too long. It was cold and rainy so we opted for Perilla instead. I can't say I was thrilled about my meal. I would probably be more satisfied at PPQ. \n\nInteresting set up. You order, grab a number, and the food is brought to your table.\n\nThe curry chicken noodle soup was bland. The curry flavor was barely noticeable and they use chunks of chicken thigh. I'd personally prefer white meat chicken, but hey, maybe that's just me. I couldn't finished mainly because I wasn't satisfied with the flavors. \n\nThe garlic noodles are standard to their sister restaurants but I felt the garlic flavor lacking in comparison to Swamp or PPQ Dungeness Island. \n\nMy friend ordered the five spice chicken vermicelli. The chicken skin was rubbery and not crispy enough. Added the imperial rolls for $2.65 but really, it's adding ONE imperial roll for $2.65.\n\nAll in all, the meal seemed pretty pricey for 2 in terms of what you get. About $35 without drinks and tip.\n\nPro tip: \nCome after 6 for free metered parking. \n\nTLDR:\nGo to PPQ if you're craving garlic noodles or pho.", "rating": 2, "date": "2016-01-11"}], "beef vermicelli": [{"excerpts": ["The food is good, prices are reasonable for SF and the larger than hole-in-the-wall seating inside isn't run down or dirty\nOrdered take-out beef vermicelli entree through eat24 and used a $2 coupon you can find on retailmenot and boom $11 out the door ", "and I'm fed\nthumbs up"], "author": "G K.", "review": "I like this place\nThe food is good, prices are reasonable for SF and the larger than hole-in-the-wall seating inside isn't run down or dirty\nOrdered take-out beef vermicelli entree through eat24 and used a $2 coupon you can find on retailmenot and boom $11 out the door and I'm fed\nthumbs up", "rating": 4, "date": "2017-04-07"}, {"excerpts": ["I am barely getting out of a 2 day very severe FOOD POISONING from the -overpriced- beef vermicelli. ", "Been there a few times in the past and had a positive experience, the staff is nice, but won't give this place another chance."], "author": "Baptiste P.", "review": "DO NOT GO THERE!!! I am barely getting out of a 2 day very severe FOOD POISONING from the -overpriced- beef vermicelli. Been there a few times in the past and had a positive experience, the staff is nice, but won't give this place another chance.", "rating": 1, "date": "2016-02-05"}], "prawns vermicelli": [], "pork vermicelli": [{"excerpts": ["I had ordered BBQ pork vermicelli and there BBQ pork spring rolls. ", "This is by far the best delivery Vietnamese food I have ordered. ", "The BBQ pork was tender and juicy, the spring rolls were on point. ", "I am Vietnamese and this place actually fixed my craving for vermicelli. ", "Would have been 5 stars but the price was just to ridiculous for 2 springs rolls. ", "Overall if you don't mind the price this place will fix your vietnamese cravings."], "author": "Tri N.", "review": "Delicious Vietnamese food for delivery! I had ordered BBQ pork vermicelli and there BBQ pork spring rolls. This is by far the best delivery Vietnamese food I have ordered. The BBQ pork was tender and juicy, the spring rolls were on point. I am Vietnamese and this place actually fixed my craving for vermicelli. Would have been 5 stars but the price was just to ridiculous for 2 springs rolls. Overall if you don't mind the price this place will fix your vietnamese cravings.", "rating": 4, "date": "2016-03-18"}], "pork chops vermicelli": [], "mixed vegetables vermicelli": [], "imperial rolls vermicelli": [], "veggie crispy rolls vermicelli": [], "beef combo rare brisket satay": [], "rare beef satay pho": [], "brisket satay pho": [], "five spice chicken satay pho": [], "prawn satay pho": [{"excerpts": ["The prawn satay pho was 5 burned shrimp with lettuce( lettuce in pho???) and noodles and the broth was so greasy it was just pure fat. ", "The restaurant refused to give us our money back and because it was all inedible, we had to throw it in the trash.  ", "I have never thrown away delivery food before ", "and I did this evening. ", "Never will order from here again, there are so many great Vietnamese places in the city, so I'm not sure how this place survives.  ", "Added photos to see for yourself."], "author": "Marta S.", "review": "I wish I could give it zero stars. Ordered delivery tonight, it took over an hour to start. Opened it up and it was horrible:-/. Ordered the veggie fresh rolls, they were straight up lettuce wrapped in rice paper. The prawn satay pho was 5 burned shrimp with lettuce( lettuce in pho???) and noodles and the broth was so greasy it was just pure fat. The restaurant refused to give us our money back and because it was all inedible, we had to throw it in the trash.  I have never thrown away delivery food before and I did this evening. Never will order from here again, there are so many great Vietnamese places in the city, so I'm not sure how this place survives.  Added photos to see for yourself.", "rating": 1, "date": "2017-06-24"}], "pork satay pho": [], "pork chop satay pho": [], "fried chicken wings lunch": [], "imperial rolls lunch": [], "cabbage salad with chicken lunch": [], "traditional banh mi": [], "bbq pork banh mi": [], "bbq beef banh mi": [], "spice chicken banh mi": [], "vegetarian banh mi": [], "classic taro tea": [], "fusion green tea": [], "house milk tea": [], "green milk tea": [], "curry chicken ramen": [], "curry mixed veggie ramen": [], "satay rare beef ramen": [], "satay brisket ramen": [], "satay beef combo ramen beef and brisket": [], "satay five spice chicken ramen": [], "satay prawns ramen": [], "satay pork ramen": [], "satay pork chop ramen": [], "satay mixed veggie ramen": []}