{"six imperial rolls": [], "six shrimp rolls": [], "six veggie summer rolls": [], "six grilled pork rolls": [], "cabbage salad with chicken": [{"excerpts": ["Cabbage salad with chicken was a pleasant surprise with nice flavor. \n\n"], "author": "Anjolie C.", "review": "Garlic noodles are always a winner. Chicken is classic, but shrimp is a nice splurge if you don't want too much meat. \n\nCabbage salad with chicken was a pleasant surprise with nice flavor. \n\nSpring rolls with shrimp are always a disappointment. They are better everywhere else in the city. Even a Thai restaurant would do better.", "rating": 4, "date": "2017-05-18"}], "papaya salad with charbroiled beef": [{"excerpts": ["A new thing I tried recently was the papaya salad with charbroiled beef. ", "It also has carrots, peanuts, fried shallots, and basil that fancies it up a little bit. ", "This was a huge portion and I would definitely order it for myself again! ", "The sauce for this isn't just fish sauce but it has other stuff mixed in too... ", "Not too sure haha. "], "author": "Tara A.", "review": "I've been coming to Perilla since high school and it never fails! Quick, cheap, and yummy Vietnamese food.\n\nI usually get the five spice chicken, garlic noodles, and imperial rolls combo, which I think is one of the most popular dishes here. The five spice chicken is crispy and always cooked perfectly. Make sure to dip it in the fish sauce! The garlic noodles are really good too, a lot of garlic flavor and buttery. I just wish I didn't have to wipe my mouth after every time I forked some in my mouth, lol!! The imperial rolls are good and go great with the fish sauce too (what doesn't go well with fish sauce...???). I love the portion size here because they give you a big pile of garlic noodles that can definitely fill you up if you're able to finish, or you can pack it up and save it for later.\n\nA new thing I tried recently was the papaya salad with charbroiled beef. It also has carrots, peanuts, fried shallots, and basil that fancies it up a little bit. This was a huge portion and I would definitely order it for myself again! The sauce for this isn't just fish sauce but it has other stuff mixed in too... Not too sure haha. However my friend ordered this and she said after a while, her jaw hurt from chewing LOL. \n\nOne thing that stood out to me about my most recent visit was the customer service!!! There were 2 Asian waiters for the whole restaurant and they did an awesome job. Whenever they came to refill water or ask how we were doing, they were always smiling.\n\nGreat prices and big portions, what more can ya ask for?", "rating": 4, "date": "2015-04-24"}, {"excerpts": ["We also ordered #18 The Papaya Salad with Charbroiled Beef, both of these dishes were a nice complement to each other. "], "author": "Karen C.", "review": "You must order #27 Five Spice Chicken Garlic Noodle with Imperial Rolls. The yelp reviews are no exaggeration of how good this dish is. I am a huge fan of their Five Spice Chicken and the imperial rolls, I would venture to say it's one of the best rolls I've had. We also ordered #18 The Papaya Salad with Charbroiled Beef, both of these dishes were a nice complement to each other. Their portions are huge, so the prices are very reasonable at $10-$12.\n\nExtremely friendly service and quick. I highly recommend coming here if you're in the area.", "rating": 4, "date": "2016-01-27"}, {"excerpts": ["We started off with the papaya salad with charbroiled beef (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=zw0FDaMoxoSw2gnDUJVf4g). ", "Man, the portion was huge! ", "It came with freshly julienned papaya, basil, carrots, peanuts, dried shallots, and a ton of charbroiled beef. ", "The flavors of the charbroiled beef and veggies complemented with the fish sauce DELICIOUSLY. "], "author": "Lien T.", "review": "I was in town this past Tuesday, running some errands with a good friend, when we decided to try some of San Francisco's popular garlic noodles. With his luck, our first choice wasn't open until 5pm and our second choice wasn't open at all! We settled for third and ended up at Perilla!\n\nOur first impressions were that the restaurant was small and very clean. We were seated immediately upon arrival as there were no other customers. We started off with the papaya salad with charbroiled beef (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=zw0FDaMoxoSw2gnDUJVf4g). Man, the portion was huge! It came with freshly julienned papaya, basil, carrots, peanuts, dried shallots, and a ton of charbroiled beef. The flavors of the charbroiled beef and veggies complemented with the fish sauce DELICIOUSLY. Next time, I'd probably prefer the papaya salad with poached shrimp instead...the beef was a little too heavy as a starter for me. We then ordered 2 orders of imperial rolls (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=iWz-T5a2bmd2ferjrGJL2w) and five spice chicken garlic noodle and 1 order of charbroiled pork rice plate (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=jyWQX5GrkY16ZcNdNvyLzg). The imperial rolls and five spice chicken garlic noodle were definitely a hit! The imperial rolls were extra crispy and filled with tons of ground pork and veggies. The five spice chicken was crispy outside, but juicy inside--it was sooo good! The garlic noodles were just A-OK for me...I guess I was expecting the noodles to be more garlicky, but the garlic flavor ended up being very subtle. Overall,  I think I was more excited for the five spice chicken than the garlic noodles. Sigh...oh well, I'm still a fan though!\n\nAnd oh, the service was great--quick and friendly.\nStreet parking was such a drag.", "rating": 4, "date": "2010-05-01"}, {"excerpts": ["We ordered a Papaya Salad with Charbroiled beef and felt healthier doing so.  ", "It was so om-nom-nom good!  ", "The sauce they serve with it is indescribable.  ", "Ordered the Rare Beef Flank Pho too - also hella good.  ", "The broth was perfect and they give you just the right amount of noodles and aren't cheap with the beef!  ", "Our third dish (yes 2 people ordered 3!!) was the 5 Spice Chicken & Garlic Noodles and ", "it was pretty damn good. "], "author": "Dee H.", "review": "Just came back from Perilla and I am satisfied and very full.  This is my new favorite Vietnamese restaurant!!!  Seriously.  \n\nWe ordered a Papaya Salad with Charbroiled beef and felt healthier doing so.  It was so om-nom-nom good!  The sauce they serve with it is indescribable.  Ordered the Rare Beef Flank Pho too - also hella good.  The broth was perfect and they give you just the right amount of noodles and aren't cheap with the beef!  Our third dish (yes 2 people ordered 3!!) was the 5 Spice Chicken & Garlic Noodles and it was pretty damn good. Not quite as moist or tasty as Thanh Long's garlic noodles, but definitely a runner up and worth the $7.95 since it comes with nice amount of chicken.\n\nI LOVE THIS PLACE and will definitely be back.  All 3 dishes, tax and tip came out to under $35, and I gave a 20% tip!  Excellent value and extremely tasty but not too heavy.", "rating": 5, "date": "2011-01-13"}], "papaya salad with poached shrimp": [{"excerpts": ["Next time, I'd probably prefer the papaya salad with poached shrimp instead...the beef was a little too heavy as a starter for me. "], "author": "Lien T.", "review": "I was in town this past Tuesday, running some errands with a good friend, when we decided to try some of San Francisco's popular garlic noodles. With his luck, our first choice wasn't open until 5pm and our second choice wasn't open at all! We settled for third and ended up at Perilla!\n\nOur first impressions were that the restaurant was small and very clean. We were seated immediately upon arrival as there were no other customers. We started off with the papaya salad with charbroiled beef (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=zw0FDaMoxoSw2gnDUJVf4g). Man, the portion was huge! It came with freshly julienned papaya, basil, carrots, peanuts, dried shallots, and a ton of charbroiled beef. The flavors of the charbroiled beef and veggies complemented with the fish sauce DELICIOUSLY. Next time, I'd probably prefer the papaya salad with poached shrimp instead...the beef was a little too heavy as a starter for me. We then ordered 2 orders of imperial rolls (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=iWz-T5a2bmd2ferjrGJL2w) and five spice chicken garlic noodle and 1 order of charbroiled pork rice plate (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=jyWQX5GrkY16ZcNdNvyLzg). The imperial rolls and five spice chicken garlic noodle were definitely a hit! The imperial rolls were extra crispy and filled with tons of ground pork and veggies. The five spice chicken was crispy outside, but juicy inside--it was sooo good! The garlic noodles were just A-OK for me...I guess I was expecting the noodles to be more garlicky, but the garlic flavor ended up being very subtle. Overall,  I think I was more excited for the five spice chicken than the garlic noodles. Sigh...oh well, I'm still a fan though!\n\nAnd oh, the service was great--quick and friendly.\nStreet parking was such a drag.", "rating": 4, "date": "2010-05-01"}], "perilla beef combo pho": [{"excerpts": ["I had the #1 - Perilla Beef Combo Pho and thought the broth was good and the produce fresh. ", "The best thing I've had on the menu was the Imperial rolls. ", "The five spice chicken garlic noodles is a little heavy on the garlic for some."], "author": "Greg K.", "review": "This place has the perfect ratio of cheap to delicious and huge portion sizes to boot. The service is adequate. I had the #1 - Perilla Beef Combo Pho and thought the broth was good and the produce fresh. The best thing I've had on the menu was the Imperial rolls. The five spice chicken garlic noodles is a little heavy on the garlic for some.", "rating": 4, "date": "2017-11-28"}, {"excerpts": ["*Perilla beef combo pho ($7.75)\n"], "author": "Elena N.", "review": "I used to order delivery through GrubHub all the time. Now that Eat24 and delivery.com offer incentives like $2 off or 30% off, I rarely use Grubhub anymore. Unfortunately, that means I forget Perilla delivers. And I used to love ordering their food!\n\nDecember 2012\n*Imperial rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=mOfdgssPMJcHuieu8yVvEg#mOfdgssPMJcHuieu8yVvEg\n*Curry chicken rice plate ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=V2oyxybFtVq7pG_CcSuQ9g#V2oyxybFtVq7pG_CcSuQ9g\n*Five spices chicken garlic noodle ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=5rp0tATcpcfUMI2xoDPlZQ#5rp0tATcpcfUMI2xoDPlZQ\n\nSeptember 2012\n*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n*Imperial rolls and five spice chicken garlic noodle ($9.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=rMkTLvCVUpAs1iXRYpQkwQ#rMkTLvCVUpAs1iXRYpQkwQ\n*Shrimp rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=-49udEyIMh9hIcygERCfzw#-49udEyIMh9hIcygERCfzw\n\n*Perilla beef combo pho ($7.75)\nSoup: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=Bo1ZX1wGhEHCuF_m1--IsA#Bo1ZX1wGhEHCuF_m1--IsA\nMeat & noodles: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#cYZ3qOj7f8T-yWDVZipO-g\nSides & hoisin sauce: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#ZmvT-h0StepsFLikhJviag\n\nOne of my favorite dishes is the Imperial rolls and five spice chicken garlic noodle. I get a big plate of variety for less than $10?! Yes please! The meat is tender. The imperial rolls flavorful and crispy. And the garlic noodles are nice and garlicky!\n\nI have to remember to order through Grubhub when I'm craving garlic noodles and chicken since Perilla's version is delicious!", "rating": 4, "date": "2014-12-26"}, {"excerpts": ["I ordered the Perilla Beef Combo Pho which includes meat balls, beef brisket and rare beef. ", "The meat balls are lovely, and have a great texture to them: what you really look for in a properly made meat ball - not process and filled with fillers. ", "The brisket was passable in my opinion and didn't really stand out. ", "However the rare beef was as it should be - rare. ", "On my occasion the beef was sweet and juicy with a strong beefy flavour. \n", "Even the two above mentioned ingredients didn't really shout justice until I munched into a mouthful of the noodles. ", "The noodles, cooked to a perfect state were almost chewy to effect, not soft and sloppy. ", "They had a definite counter-action when I bit down on it- the perfect texture (again in my opinion). ", "Oftentimes we're let down by over cooked noodles that have been soaking in a pot for hours. "], "author": "C G S.", "review": "After failing to get a table at Manna and San Tang we found ourselves a Vietnamese restaurant across the road from Manna on Irving. From the outside it doesn't look great and judging by the choice of condiments and chopsticks on the table one would assume that they were Chinese rather than Vietnamese or at most Chinese Viets. Anyway going in we were met with a very friendly waiter who actually gave us top notch service throughout our stay. The menu is simple and easy to navigate with nothing too complicated. My advise is the Pho. Anything else is not compulsory. The broth is sweet and quite light, not heavy and thick like some places; It has been filtered quite a bit it seems. Second is the choice of topping. I ordered the Perilla Beef Combo Pho which includes meat balls, beef brisket and rare beef. The meat balls are lovely, and have a great texture to them: what you really look for in a properly made meat ball - not process and filled with fillers. The brisket was passable in my opinion and didn't really stand out. However the rare beef was as it should be - rare. On my occasion the beef was sweet and juicy with a strong beefy flavour. \nEven the two above mentioned ingredients didn't really shout justice until I munched into a mouthful of the noodles. The noodles, cooked to a perfect state were almost chewy to effect, not soft and sloppy. They had a definite counter-action when I bit down on it- the perfect texture (again in my opinion). Oftentimes we're let down by over cooked noodles that have been soaking in a pot for hours. Not here!\n\nThe other thing to mention is their five spices chicken. It's grilled, tastes great, smells even better and looks the real deal. Most importantly for me is that they use thigh meat (dark) rather than dry breast meat (white). I feel that they have put good attention to many of their dishes and thus have differentiated themselves from the average money busting rip off Vietnamese Pho joint. Too add to the food - the service was 10/10. Couldn't have asked for a better server. He was keen, had an eye for detail and explained the dishes well. (Well done you!). The total bill came to $31 for three of us which is very decent indeed especially when it's both yummy and filling. We couldn't finish it all so had to get a take out box. That's what you call bargain. \n\nWould I go there again? Hell yea! Go with friends and family, partners, bros, girls the lot. My only true tip: don't be afraid of the funny placement of their customer toilet. You have to cut through part of their kitchen first. But it's maintained well. Enjoy!", "rating": 4, "date": "2015-02-15"}, {"excerpts": ["Anyways, ordered the #1 Perilla Beef Combo Pho, and it satisfied my appetite.  "], "author": "Joshua P.", "review": "I usually get vietnamese food in Lil Saigon (aka T'loin), but happened to be around the inner sunset neighborhood, when I was craving pho.  Not to mention that it was freezing with crazy winds blowing.  Anyways, ordered the #1 Perilla Beef Combo Pho, and it satisfied my appetite.  Also ordered the imperial rolls (mmm tasty).  \n\nOverall, not a bad place to get your pho fix, and if you don't want to venture all the way to the \"tender\"loin.", "rating": 4, "date": "2013-10-28"}, {"excerpts": ["I ordered a #1 Perilla Beef Combo Pho and wasn't disappointed. ", "The broth was flavorful and there was plenty of beef and meatballs for me. ", "Big enough bowl to keep my hunger satisfied after a good workout and doesn't hit the wallet too hard."], "author": "Gerard Y.", "review": "I've had their garlic noodles before and yes that is must try if you go here, but this review is for their pho. I ordered a #1 Perilla Beef Combo Pho and wasn't disappointed. The broth was flavorful and there was plenty of beef and meatballs for me. Big enough bowl to keep my hunger satisfied after a good workout and doesn't hit the wallet too hard.", "rating": 4, "date": "2013-06-15"}, {"excerpts": ["Perilla Beef Combo Pho - not good when compared to for example, kevin's noodle house.  ", "The soup was not piping hot, as pho is supposed to be.  ", "It also was not as flavorful and rich.  \n"], "author": "Lisa L.", "review": "I've been here twice.  \nPerilla Beef Combo Pho - not good when compared to for example, kevin's noodle house.  The soup was not piping hot, as pho is supposed to be.  It also was not as flavorful and rich.  \nImperial Rolls and Charbroiled Beef Garlic Noodle - Really delicious.  All three items on the plate were well-made.  The rolls were crunchy.  The beef was tender and the noodles had just the right amount of garlic and oiliness.  \nPrices and portions are fair.  Service is good.  Space is not big but clean.", "rating": 3, "date": "2010-12-02"}], "brisket pho": [{"excerpts": ["so I ordered the brisket pho. ", "It was fantastic, and portions were great for the price - especially since a bowl of that size would have cost at least $12-15 in NYC! "], "author": "Sherry L.", "review": "I came by for lunch with mom and aunt because I was craving some vietnamese food, especially after just moving back from NYC where I had to search high and low for a decent vietnamese place.\n\nThe place was already bustling a little before 12PM with the lunch time crowd, but we were able to get a table within 3-5 minutes. By the time we had ordered, a ton of tables had opened up as well. \n\nI wanted some noodle soup so I ordered the brisket pho. It was fantastic, and portions were great for the price - especially since a bowl of that size would have cost at least $12-15 in NYC! I guess that makes me a little biased when it comes to price, but I was definitely satisfied after my meal! \n\nMy mom and aunt both ordered the five spice chicken with the garlic noodles. As everyone else has already mentioned, it is an AWESOME option. The chicken is super tasty. It is well seasoned and tender with perfectly crisped skin. The noodles are a tad oily, but done well, and portions are good sized. I think both my mom and aunt had enough left over for another meal!\n\nWill definitely update after more visits and delivery service!!", "rating": 4, "date": "2018-06-14"}, {"excerpts": ["I got the brisket pho and my husband got the five spice chicken. ", "We split the shrimp spring rolls. ", "Everything was delicious - flavorful, fresh, and nice portion sizes. ", "The place was clean, and service was fast and friendly. ", "The only reason I'm giving 4/5 is our food was very heavy on the noodles (which seems to be common for pho places around here). ", "I wish there were less noodles to make room for more delicious broth and veggies. ", "I would still recommend this place and can't wait to go back!\n", "A quick edit: prices are great too! ", "Under 30 dollars for two entrees and an app!"], "author": "Amanda J.", "review": "SO yummy. I got the brisket pho and my husband got the five spice chicken. We split the shrimp spring rolls. Everything was delicious - flavorful, fresh, and nice portion sizes. The place was clean, and service was fast and friendly. The only reason I'm giving 4/5 is our food was very heavy on the noodles (which seems to be common for pho places around here). I wish there were less noodles to make room for more delicious broth and veggies. I would still recommend this place and can't wait to go back!\nA quick edit: prices are great too! Under 30 dollars for two entrees and an app!", "rating": 4, "date": "2017-12-24"}, {"excerpts": ["I had their beef brisket Pho on a cold and rainy day, amazing!"], "author": "Noah P.", "review": "Huge portions of delicious Pho at a very affordable price, especially in San Francisco! I had their beef brisket Pho on a cold and rainy day, amazing!", "rating": 5, "date": "2017-01-12"}, {"excerpts": ["Since my online orders cannot be tamed, I also got the brisket pho, which also hit the spot. ", "It was light and had a strong beef flavor. ", "I can't stand when pho is oily or watery, and this one had the perfect consistency. "], "author": "Fiona Y.", "review": "I had my order delivered and it was an all in all wonderful choice since I just could not contain my craving for good chicken bun (bun ga nuong). The five spice chicken bun was exactly how I imagined it to be. Flavorful, crispy, and citrusy dark meat chicken with the perfect proportion of lettuce, cucumber, and thin rice vermicelli. I am shocked to say that the proportion of chicken to noodle was perfect. As a hungry meat eater, I haven't found a place that satiates my meat-to-carb ratio quite like this place does. \n\nSince my online orders cannot be tamed, I also got the brisket pho, which also hit the spot. It was light and had a strong beef flavor. I can't stand when pho is oily or watery, and this one had the perfect consistency. 5 stars for the food and short wait time. \n\n-1 star for the canned Tasco when it had said fresh coconut juice..not the same at all. I will still order here again for the fast delivery and $2 delivery charge (no minimums)", "rating": 4, "date": "2014-09-01"}, {"excerpts": ["I've tried both their five-spice chicken garlic noodle and rare-beef and brisket pho now on two separate occasions. "], "author": "Patricia K.", "review": "Hmmmm.... 2-3 stars? \n\nI've tried both their five-spice chicken garlic noodle and rare-beef and brisket pho now on two separate occasions. I've noticed that the service has improved since I last visited but the food was just mediocre.\n\nThe garlic noodles are delicious but really greasy. I definitely think they have the best five-spice chicken so I'll grant them that. I'll probably come back mainly for this dish. \n\nPho? Broth- bland. Beef- not tender. Pho alone rating = 2 stars. They do give you a LOT of noodles so if you're super hungry and you rather have quantity over quality, order the pho.", "rating": 3, "date": "2012-11-03"}, {"excerpts": ["The brisket pho used to be good, but the last few times I have ordered it, it was stringy, chewy, fatty, and tasteless. ", "Order the garlic noodles. ", "They are still good."], "author": "Mimi J.", "review": "The brisket pho used to be good, but the last few times I have ordered it, it was stringy, chewy, fatty, and tasteless. Order the garlic noodles. They are still good.", "rating": 1, "date": "2014-04-09"}, {"excerpts": ["I had the beef brisket pho and unlike the beef pho at their Mission location, this was pretty disappointing--not enough broth, the brisket was tough ", "(I mean really tough). ", "The one thing I will say is that the $7.25 price tag is much more reasonable than the downtown price. ", "I mean, can you really charge a $3 premium on the same dish?"], "author": "ai f.", "review": "I had the beef brisket pho and unlike the beef pho at their Mission location, this was pretty disappointing--not enough broth, the brisket was tough (I mean really tough). The one thing I will say is that the $7.25 price tag is much more reasonable than the downtown price. I mean, can you really charge a $3 premium on the same dish?", "rating": 3, "date": "2012-01-04"}], "meatballs pho": [{"excerpts": ["Got the rare steak and meatballs Pho. ", "The portion size was generous but the broth was not good. ", "And for some reason the noodles soaked up the broth super quickly....the broth tasted very odd. ", "Next time I'll stick with the garlic noodles and five spice chicken although I usually find the noodles too buttery."], "author": "Grace O.", "review": "Got the rare steak and meatballs Pho. The portion size was generous but the broth was not good. And for some reason the noodles soaked up the broth super quickly....the broth tasted very odd. Next time I'll stick with the garlic noodles and five spice chicken although I usually find the noodles too buttery.", "rating": 2, "date": "2017-11-09"}], "rare beef and meatballs pho": [], "brisket and meatballs pho": [], "rare beef and brisket pho": [], "fivespice chicken pho": [], "curry chicken vermicelli": [{"excerpts": ["My girlfriend order the #9 which is a curry chicken vermicelli soup dish extra tofu for her please, ", "Perfect on  a cold foggy  ", "SF day! ", "The curry soup  was rich and flavorful with coconut milk, ", "For a curry soup it definitely had a lot of chicken which is good in my case! "], "author": "Timothy C.", "review": "Perilla's is always my go to spot for a quick lunch or dinner.\nThey are well known for their garlic noodle dishes in which is my usually go to when I visit Perilla's.\n\nWhen we Arrived the restaurant was filled but we were readily seated right away for a table of 2.\n\nThey offered waters and napkins with a menu, but right away me and my Girlfriend knew what to order. So we waived the waitress down to get our orders in.\n\nMy girlfriend order the #9 which is a curry chicken vermicelli soup dish extra tofu for her please, Perfect on  a cold foggy  SF day! The curry soup  was rich and flavorful with coconut milk, For a curry soup it definitely had a lot of chicken which is good in my case! The tofu and vermicelli were perfectly cooked and very enjoyable.\n\nI order the #27 which is the 5 spice chicken with garlic noodles and imperial rolls. The 5 spice chicken was cooked just right nice and crispy dipping in with the fish sauce, the imperials were nice and crispy not too soggy like some places that just reheat them to order. Garlic noodles definitely had a lot of flavor compared to what i was use to and generous portion at that.\n\nPerilla's will always be a go to for those dishes if not the Pho. Sometimes I'm so hungry i order the Pho Dac Biet, With 5 spice chicken garlic noodles just to have the best of both worlds!", "rating": 4, "date": "2018-08-14"}, {"excerpts": ["I came here to try the curry chicken vermicelli soup because all the pictures of yelp make it look delicious ", "and I'm a big fan of curry, so it was a must try for me. ", "They give you A LOT of noodles ", "and I could barely finish the dish, ", "The curry chicken vermicelli had the perfect amount of curry in it and it didn't taste too heavy. ", "Since the curry was the soup ", "I was scared it might be really thick ", "but it was light and savory. ", "They gave me a good amount of chicken in the dish and all large pieces too! "], "author": "Sherry L.", "review": "I came here to try the curry chicken vermicelli soup because all the pictures of yelp make it look delicious and I'm a big fan of curry, so it was a must try for me. They give you A LOT of noodles and I could barely finish the dish, so if you're looking for something filling this is the place to go. \n\nThe curry chicken vermicelli had the perfect amount of curry in it and it didn't taste too heavy. Since the curry was the soup I was scared it might be really thick but it was light and savory. They gave me a good amount of chicken in the dish and all large pieces too! We also got the five spice chicken and the imperial rolls but with rice instead of the garlic noodles, the chicken was tasty and the imperial rolls was nice and crispy. \n\nThe service here was definitely 5 stars, the servers were attentive and very friendly. They greeted us when we walked in and when we were leaving the restaurant. It's also really clean inside which was a plus.", "rating": 4, "date": "2016-07-25"}, {"excerpts": ["now, i dont know about their garlic noodles (nothing eye-opening in my opinion honestly, given that it was their most \"celebrated\" dish by visitors and that was my first encounter with perilla at irving), but the curry chicken vermicelli...\n\n"], "author": "Eryn K.", "review": "I've been here only twice in the past 5 months, only twice because I am too busy and they dont open while im free...\n\nnow, i dont know about their garlic noodles (nothing eye-opening in my opinion honestly, given that it was their most \"celebrated\" dish by visitors and that was my first encounter with perilla at irving), but the curry chicken vermicelli...\n\nmy god.\n\nthat thing is a spicy (mild*) nectar sent from heaven. i dont know what i'll do without it.\n\nif you get it for delivery, use half of the soup; save the rest to eat with rice the next meal. lol it is that good.", "rating": 5, "date": "2018-04-22"}, {"excerpts": ["Curry chicken vermicelli (spicy coconut milk curry broth noodle soup) $8.99\n"], "author": "Mayana P.", "review": "Go here. Nice people. Good food. Free local delivery if $20+ if after 5pm. This location opens daily 11am-9pm\n\nParking kind of sucked but for the price and what you get, this place is SO worth it. For about $10, depending on what you get, you get huge portions that can feed a SUPER hungry person or two people with a medium to appetite. I wish they were a little closer (SF is a trek for me and this is deep in SF with no shortcuts to get to and fro) because I really like their food. They're also SO NICE! On the phone and in person, they're so caring and hospitable. I usually tip anyway when I pick up food but I WANTED to tip a little extra than what I usually do. My picky SO enjoyed the veggie garlic noodles. I really appreciate that with their plates, they give broccoli on the side. I love broccoli and it's not overcooked. They even season it a little bit with something, I think or perhaps it's the aromas and condensation permeating into the green flesh, soaking up the garlic goodness. This is what I ordered (Yes, I went a lil over board but I have food for days!) :\n\n#30 Imperial rolls & shrimp garlic noodles   $12.25\n#51 Imperial rolls & five spice chicken rice plate  $9.75\n#59 Seasoned veggie garlic noodle  $9.75\n#9  Curry chicken vermicelli (spicy coconut milk curry broth noodle soup) $8.99\nTogo bag $0.10\n\nEverything was $45 with tax. Like I said, good portions. I adore and salivate for imperial rolls like these that use rice paper instead of the flour but only if it's done right and they do it right. The pork and veggie inside the rolls are delicious and the dipping sauce, which is good too but to me, not needed. I just pop them into my mouth and it's gone. lol #30 and #51 each had 6 pieces of the deep fried rolls with a healthy (\"healthy\" how are butter infused noodles \"healthy\"? lol I don't care! Gimme!) amount of delicious garlic noodles. Oh and some broccoli. Who says I'm not healthy? ;) \n\n#59 was pretty good but if I had meat options at a place like this, I'm ordering the meat. It's good though and I also liked the Curry chicken soup which had a good spicy kick to it but not overpowering for baby spice buds like my tongue that can't handle much. The food tastes even better and more flavorful the following days as leftovers. Everything really infuses into each morsel. Next time, I'd order #27 Imperial rolls & Five spice chicken garlic noodles $10.75\n\nOnly thing is, I wish they offered and had brown rice but that can be because of limited space in kitchen or something. Well, if someone knows the manager/owner of Perilla and can suggest this and make this happen, you can be my friend lol, I'd totally pay extra for this healthier (low sugar spike and more fiber BUT it does have more arsenic...meh give me brown rice please! nom nom I don't care... yum in my tum lol)\n\nI also like the feel of this location better than the one in the financial district. It's more low key here, more room and not packed, loud and crazy hectic like it is at the other location.", "rating": 5, "date": "2015-07-08"}], "satay beef pho": [{"excerpts": ["The satay beef pho is surprisingly delicious. ", "Got the infamous #27 and as expected.... ", "So good. ", "If you don't want garlic noodles you can get the vermicelli. ", "Service is great."], "author": "Cal L.", "review": "Big portions. Ordered four plates with five people and still can't finish. The satay beef pho is surprisingly delicious. Got the infamous #27 and as expected.... So good. If you don't want garlic noodles you can get the vermicelli. Service is great.", "rating": 5, "date": "2017-07-22"}, {"excerpts": ["The imperial rolls were pretty tasty, the five spice chicken was delicious plus the skin was nice and crispy, and the beef in my Satay Beef Pho were nice and tender. "], "author": "Adrian M.", "review": "Was hoping for a good experience after reading all of the positive reviews. \n\nFirst the good stuff:\n\nThe imperial rolls were pretty tasty, the five spice chicken was delicious plus the skin was nice and crispy, and the beef in my Satay Beef Pho were nice and tender. Portions were decent.\n\nNow the bad:\n\nThe pho broth, regular was pretty lacking, could hardly call it pho. The garlic noodles, what I came to try the most were mediocre at best. Didn't really taste the buttery garlic flavor that it's known for. Lastly, the food took about 30 minutes after we had ordered, so better bring some good company.\n\nI would probably go again just to try the vermicelli bowls or the rice plates.", "rating": 3, "date": "2016-10-12"}, {"excerpts": ["But they do the Satay beef pho about the same. ", "(My favorite if you like spicy, get this...", "it has zucchini in it that makes it extra delicious.) ", "The regular beef pho is great too. ", "The PPQ chain remains our favorite!"], "author": "Gwenn G.", "review": "This is a sister restaurant of PPQ. I just found out they deliver which makes it even better. We eat PPQ about one a week and get the always get the garlic noodles. I love the curry chicken pho but its a little better at PPQ. But they do the Satay beef pho about the same. (My favorite if you like spicy, get this...it has zucchini in it that makes it extra delicious.) The regular beef pho is great too. The PPQ chain remains our favorite!", "rating": 4, "date": "2015-07-20"}, {"excerpts": ["We also got the Satay Beef Pho ($7.25). "], "author": "Tina T.", "review": "Five spice chicken + Imperial Rolls + Pork Garlic Noodle.\n\nFor $8.95, you get a decent portion. Everything in this dish is really good! Five spice chicken perfectly marinated. Imperial roll freshly fried with a thin layer of crispy skin. Pork garlic noodle that are not overly greasy.\n\nWe also got the Satay Beef Pho ($7.25). Satay is usually really greasy so the soup was a bit hard to drink but the pho and beef were good.\n\nStaff was also very friendly and there's one guy who's surprisingly very enthusiastic about the food. Will definitely be back!", "rating": 4, "date": "2010-03-15"}, {"excerpts": ["Satay beef pho and garlic chicken noodle is over the top.\n\n"], "author": "Wayne Z.", "review": "One of the best pho place in the city. Satay beef pho and garlic chicken noodle is over the top.\n\nKiller Dish: Garlic Chicken Noodle", "rating": 4, "date": "2011-07-17"}, {"excerpts": ["Satay Beef Pho on the menu", ", I think it was #10. ", "They did a great job on the soup base. ", "It was thick and flavorful unlike some placed where it taste bland and full of oil. ", "The portions are generous and it definitely filled me up (a big eater). ", "Also they included a lot of meat in the pho. ", "From what I saw, all their meat are machine sliced, like those japanese shabu placed. "], "author": "Eric Y.", "review": "Not bad, not bad... \n\nSatay Beef Pho on the menu, I think it was #10. They did a great job on the soup base. It was thick and flavorful unlike some placed where it taste bland and full of oil. The portions are generous and it definitely filled me up (a big eater). Also they included a lot of meat in the pho. From what I saw, all their meat are machine sliced, like those japanese shabu placed. Very tender meat. \n\nOverall experience is great. Will come back to check out other stuff on the menu!", "rating": 5, "date": "2010-12-11"}, {"excerpts": ["I had the Satay Beef Pho which was warm and filling but not nearly as spicy as advertised.  ", "However, the Five Spice Chicken was divine.  "], "author": "Nicole R.", "review": "After a cold trying morning attending appointments around UCSF, we needed warm food fast.  Pho seemed like a good idea. The food here was about average but there a few unique perks to Perilla.  I had the Satay Beef Pho which was warm and filling but not nearly as spicy as advertised.  However, the Five Spice Chicken was divine.  And they had a side of broccoli on the menu which is an awesome addition to any bowl of soup.  \n\nMy other peeve was that I ordered a Vietnamese Coffee and it was served in a mug, latte style mixed together.  Strange since the asian lady across the way had her's traditional Vietnamese style as coffee that drips into the condensed milk.  Perhaps you have to be asian to have it served Vietnamese style?  And I was a little weirded out when the National Beef Company made their beef delivery to the restaurant.  My advise is stick to the chicken.", "rating": 3, "date": "2011-02-15"}], "veggie combo beef broth pho": [], "pho ga": [{"excerpts": ["I got the chicken curry pho and pho ga.\n", "The chicken curry pho was pretty heavy but extremely tasty. ", "It was more like a sauce than a soup. ", "The pho ga was pretty standard, a little light on flavor but nothing a healthy dose of Sriracha couldn't fix. ", "The portions were fair.\n", "The shrimp rolls were decent, not very much shrimp in there but tasty with the dipping sauce.\n", "We got the garlic noodles based on other reviews. ", "They tasted like...garlic noodles. ", "I wasn't blown away like everyone else has been - maybe too hyped up by the time I got to try them.\n", "Would definitely order from here again!"], "author": "Emma B.", "review": "Loved this place so much we ordered takeout twice in a week! I got the chicken curry pho and pho ga.\nThe chicken curry pho was pretty heavy but extremely tasty. It was more like a sauce than a soup. The pho ga was pretty standard, a little light on flavor but nothing a healthy dose of Sriracha couldn't fix. The portions were fair.\nThe shrimp rolls were decent, not very much shrimp in there but tasty with the dipping sauce.\nWe got the garlic noodles based on other reviews. They tasted like...garlic noodles. I wasn't blown away like everyone else has been - maybe too hyped up by the time I got to try them.\nWould definitely order from here again!", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["I got the pho ga (chicken pho) and it was delicious and refreshing. "], "author": "Kelly N.", "review": "I came on a Sunday night and there were a good amount of people which is a good sign. I got the pho ga (chicken pho) and it was delicious and refreshing. The soup base was not too salty and had a good chicken flavor. \n\nI saw that they had garlic noodles and that seemed like a popular item. Will definitely come back for that!", "rating": 4, "date": "2016-08-25"}, {"excerpts": ["First, the pho ga here is not very good, and the portion size has been the smallest compared to all of the different pho places that I have been to in San Francisco so far. ", "Secondly, their prices for their pho is about $1-$2 more than what I have paid for at other Vietnamese restaurants. ", "I will not be coming back because I feel that eating here is not worth my money. ", "Additionally, there is no air conditioning in the restaurant, so if you happen to eat pho on a warm day or you get hot while eating the pho, you won't feel very comfortable because the restaurant can get pretty stuffy."], "author": "Lynn T.", "review": "I am not too big of a fan of Perilla for a few reasons. First, the pho ga here is not very good, and the portion size has been the smallest compared to all of the different pho places that I have been to in San Francisco so far. Secondly, their prices for their pho is about $1-$2 more than what I have paid for at other Vietnamese restaurants. I will not be coming back because I feel that eating here is not worth my money. Additionally, there is no air conditioning in the restaurant, so if you happen to eat pho on a warm day or you get hot while eating the pho, you won't feel very comfortable because the restaurant can get pretty stuffy.", "rating": 2, "date": "2016-03-09"}, {"excerpts": ["I've tried several of their dishes, and would recommend their pho ga or their five spice chicken with garlic noodles. ", "Both are excellent. ", "They take the time to carefully package their food for delivery, and the portions are incredibly generous, especially for the modest prices. "], "author": "Matt T.", "review": "I've never actually dined in at Perilla; I order delivery from Perilla on the semi-regular via Yelp Eat24. That said, their food is pretty damn delicious. \n\nI've tried several of their dishes, and would recommend their pho ga or their five spice chicken with garlic noodles. Both are excellent. They take the time to carefully package their food for delivery, and the portions are incredibly generous, especially for the modest prices. They're typically pretty fast, too.\n\nIf you're looking for Vietnamese comfort food without having to leave home (assuming you're in their delivery zone), Perilla will definitely do the trick!", "rating": 4, "date": "2015-07-27"}, {"excerpts": ["I always get the charbroiled beef with garlic noodles and pho ga chicken noodle soup. ", "They are efficient on the phone, fast delivery and delicious! ", "The food is always hot and the delivery people are ALWAYS nice. ", "I recommend them to anyone and everyone! ", "Yummmmmm!"], "author": "r m.", "review": "I get delivery from them at least twice a month, sometimes more. I always get the charbroiled beef with garlic noodles and pho ga chicken noodle soup. They are efficient on the phone, fast delivery and delicious! The food is always hot and the delivery people are ALWAYS nice. I recommend them to anyone and everyone! Yummmmmm!", "rating": 5, "date": "2016-12-05"}, {"excerpts": ["Our go to dishes are pho ga, 5 spice pho, and chicken salad."], "author": "Ken P.", "review": "Good for dining in, take out, and delivery. The ladies that work here are very sweet. Service is always fast and friendly. Our go to dishes are pho ga, 5 spice pho, and chicken salad.", "rating": 4, "date": "2016-01-12"}, {"excerpts": ["I ordered the garlic noodles with shrimp and imperial rolls and pho ga (chicken) - split both with a friend.   \n\n", "The pho ga came out first and the noodles were tender, but the chicken was a little tough or chewy.  ", "I prefer all white meat chicken tho.  "], "author": "James L.", "review": "Came here tonight for dinner and wasn't sure why I bookmarked it in the first place..maybe from watching check please on tv or something.  Anyways,  I love garlic noodles and it was a nice surprise to have a restaurant that had it is a main dish instead of a side order like other restaurants.   I ordered the garlic noodles with shrimp and imperial rolls and pho ga (chicken) - split both with a friend.   \n\nThe pho ga came out first and the noodles were tender, but the chicken was a little tough or chewy.  I prefer all white meat chicken tho.  This one had bones and skin in it.\n\nThe garlic noodles came out next and it was yummy.  The chair boiled shrimp was very yummy..I think they marinated it or something.  The price was decent..not super cheap or expensive here.\n\nOverall, the place was delicious.  The service attentive as they filled our water regularly.", "rating": 4, "date": "2012-05-06"}, {"excerpts": ["Therefore, I'm surprised by some of the negative reviews I see here about it (though the small sample of such reviews I see is in regards to their chicken pho, or pho ga, maybe that's why)."], "author": "H K.", "review": "I finally had a chance to try their garlic noodles yesterday during lunch, something that I bookmarked this restaurant for.  It was good in my mind, the cost was reasonable ($7.95 for the noodle with grilled pork, with the pork being quite good also).  It wasn't quite as good as Thanh Long (though it's not quite a side by side comparison).  On the other hand, Thanh Long is on a different level.\n\nAccording to the menu, this is run by the same people that operate PPQ on Irving near 19th Avenue.  That place I always enjoyed their beef pho.  Therefore, I'm surprised by some of the negative reviews I see here about it (though the small sample of such reviews I see is in regards to their chicken pho, or pho ga, maybe that's why).", "rating": 4, "date": "2011-12-02"}, {"excerpts": ["PHO GA WAS YUCK!!!\n", "Their items of the Vietnamese dishes are in english so you wont be seeing Pho Ga, instead you will see \"Chicken Soup\". ", "Walked in, not one staff person paid attention to me, sat down and they knew I was sitting there (waiting to be served). ", "After 10 minutes of sitting there while the staff was 1) having a vietnamese conversation amongst themselves 2) picking up the phone and taking orders while another picks and delivers and another was doing who knows what. ", "I have decided TO SERVE MYSELF and walked up to the counter and took a menu infront of them and sat back down. ", "After awhile of trying to wave for their attention - the tables around me felt bad and i had commented \"i guess i'm suppose to serve myself?", "\" and everyone laughed. ", "The guy who was pick-up and delivery been seeing me sit there and came to me to FINALLY take my order, ", "althought it wasn't his job ", "and he knew it was the other persons job. ", "PHO GA ($7.95) - ", "Yah it was f'n terrible. ", "For those who think this dish is tastier here needs to really explore their palate. ", "Some chicken pieces looked like chicken and not so much of others. ", "I didnt get that much chicken either. ", "The noodles were kind of hard as if they didnt really cook the rice noodles. ", "The taste of the broth (alone) was BLAH. ", "Kind of bland ", "and had a weird after taste. ", "I dressed it with hoisen sauce, siracha, and all the veggies and it still tasted like crap. ", "And for $7.95... ", "YOU GOT ", "TO BE KIDDING ME. "], "author": "Jane A.", "review": "PHO GA WAS YUCK!!!\n(1 star)\n\nPHO-get this get place. I was offended by the crappy tasting $7.95 Pho Ga. As i'd like to say \"how inappropriate\". Trust my judgement.\n\n- Food, Pho was not great\n- Price, Overpriced\n- Service, Shitty\n- Ambiance, Simple clean and small\n\nCame here for dinner and was expecting some decent pho. Already knew I was not expecting the best based on the people who were eating here. Their items of the Vietnamese dishes are in english so you wont be seeing Pho Ga, instead you will see \"Chicken Soup\". Walked in, not one staff person paid attention to me, sat down and they knew I was sitting there (waiting to be served). After 10 minutes of sitting there while the staff was 1) having a vietnamese conversation amongst themselves 2) picking up the phone and taking orders while another picks and delivers and another was doing who knows what. I have decided TO SERVE MYSELF and walked up to the counter and took a menu infront of them and sat back down. After awhile of trying to wave for their attention - the tables around me felt bad and i had commented \"i guess i'm suppose to serve myself?\" and everyone laughed. The guy who was pick-up and delivery been seeing me sit there and came to me to FINALLY take my order, althought it wasn't his job and he knew it was the other persons job. I was seconds away of leaving the place.\n\nHEFFER-STYLE STATUS.\n\nPHO GA ($7.95) - Yah it was f'n terrible. For those who think this dish is tastier here needs to really explore their palate. Some chicken pieces looked like chicken and not so much of others. I didnt get that much chicken either. The noodles were kind of hard as if they didnt really cook the rice noodles. The taste of the broth (alone) was BLAH. Kind of bland and had a weird after taste. I dressed it with hoisen sauce, siracha, and all the veggies and it still tasted like crap. And for $7.95... YOU GOT TO BE KIDDING ME. Stay away from the pho. \n\nWill I be back? I'd like to try a rice plate - the 5 spice chicken and garlic noodles. Looks like thats the dish to get but i may refrain myself from ever attempting a second try here.\n\nUntil the next review....", "rating": 1, "date": "2011-11-20"}, {"excerpts": ["Their pho ga is not bad, but not great. "], "author": "Steven B.", "review": "Garlic noodles is awesome! Totally delicious! The five spice chicken is awesome also. The best thing is they have a combo with both of them!\n\nChicken's nicely cooked and still moist while the outside is cripsy. The spices on the chicken just makes this thing so great.\n\nThe garlic noodles are crazy good. Just the right amount of garlic and the texture of the noodles are cooked to like perfection.\n\nService is kind of on the meh side, but it's a busy place. Parking in this neighborhood sucks so bad after 6pm. \n\nTheir pho ga is not bad, but not great. There's nothing special about it.\n\nGarlic noodles and five spice chicken are a must try here!", "rating": 5, "date": "2011-07-28"}], "plain noodle soup": [], "fivespice chicken garlic noodle": [], "charbroiled pork garlic noodle": [{"excerpts": ["Sunday ~ 7:00pm\nOccasion: Hungry after a day visiting the museum  \nParty of:  1\nOrdered: Imperial Rolls and Charbroiled Pork Garlic Noodle ", "(Mi Toi Cha Gio Thit Nuong) ", "[see pic]\n", "Accessibility: ", "The place was w/c friendly.\n", "Total: "], "author": "Anh N.", "review": "Date/Time: Sunday ~ 7:00pm\nOccasion: Hungry after a day visiting the museum  \nParty of:  1\nOrdered: Imperial Rolls and Charbroiled Pork Garlic Noodle (Mi Toi Cha Gio Thit Nuong) [see pic]\nAccessibility: The place was w/c friendly.\nTotal: $12.31\n\nIf you like garlic noodles, than you must try this place. The garlic noodles was cooked to perfection; seasoned with the right about of butter & garlic. The charbroiled pork was seasoned well and had nice grilled marks.\n\nI will definitely come here again and try the other garlic noodles dishes.", "rating": 4, "date": "2012-06-06"}], "charbroiled pork chops garlic noodle": [], "charbroiled beef garlic noodle": [{"excerpts": ["Imperial Rolls and Charbroiled Beef Garlic Noodle: ", "I love this dish because I get three of my favorite things and only two pieces of steamed broccoli (which is still too much broccoli).  ", "The imperial rolls were perfectly crispy and filled with moist pork.  ", "It's not Tu Lan quality, but still really good.  ", "I love the charbroiled beef because it's shellacked with tangy marinade and full of seared goodness; almost like having Korean BBQ done for you.  ", "The garlic noodles are so garlicky and chewy.  ", "Pork Chop Garlic Noodle: ", "A massive amount of meat.  ", "Thinly cut, heavily marinated and nicely seared like the beef.  "], "author": "Adam B.", "review": "I'm familiar with the Perilla in the FiDi so was curious to try this one in the Avenues after a staycation day at the Academy of Sciences.  I actually think this location is better.  For the FiDi lunch rush, that location must precook a lot of the garlic noodles; I've seen huge the huge vats they pull from.  We came here for an early dinner when it wasn't that crowded; our order took awhile so I figured they made it fresh.  And I could tell the difference; the noodles were so good!\n\nImperial Rolls and Charbroiled Beef Garlic Noodle: I love this dish because I get three of my favorite things and only two pieces of steamed broccoli (which is still too much broccoli).  The imperial rolls were perfectly crispy and filled with moist pork.  It's not Tu Lan quality, but still really good.  I love the charbroiled beef because it's shellacked with tangy marinade and full of seared goodness; almost like having Korean BBQ done for you.  The garlic noodles are so garlicky and chewy.  They're not quite as good as An The Go (i.e. Crustacean's food truck), but still yummy. \n\nPork Chop Garlic Noodle: A massive amount of meat.  Thinly cut, heavily marinated and nicely seared like the beef.  As much as I'm a big fan of the beef, this may be better.\n\nCup of Broth: I know you don't come here for the pho, so I obviously didn't order pho.  But I was curious how it tasted so I got a cup of their beef pho broth.  It was basically meh.  Heavy tones of star anise and salt.  Missing the rich fatty and umami meat subtleties you might find at Bodega Bistro.  Definitely stick with the garlic noodles.", "rating": 4, "date": "2016-04-11"}, {"excerpts": ["Imperial Rolls and Charbroiled Beef Garlic Noodle - Really delicious.  ", "All three items on the plate were well-made.  ", "The rolls were crunchy.  ", "The beef was tender and the noodles had just the right amount of garlic and oiliness.  \n", "Prices and portions are fair.  ", "Service is good.  ", "Space is not big but clean."], "author": "Lisa L.", "review": "I've been here twice.  \nPerilla Beef Combo Pho - not good when compared to for example, kevin's noodle house.  The soup was not piping hot, as pho is supposed to be.  It also was not as flavorful and rich.  \nImperial Rolls and Charbroiled Beef Garlic Noodle - Really delicious.  All three items on the plate were well-made.  The rolls were crunchy.  The beef was tender and the noodles had just the right amount of garlic and oiliness.  \nPrices and portions are fair.  Service is good.  Space is not big but clean.", "rating": 3, "date": "2010-12-02"}], "charbroiled shrimps garlic noodle": [], "curry chicken garlic noodle": [{"excerpts": ["Got the curry chicken garlic noodle plate and it was huge! ", "So much tasty food. ", "Everyone gets the garlic noodles and I can see why. ", "My curry chicken was v eyes tasty but kinda watery. ", "Would still order it again. ", "Thai tea also delicious! ", "Great prices and the people who run the place are super nice and accommodating. ", "Would highly recommend to anyone!"], "author": "Sidney W.", "review": "Got the curry chicken garlic noodle plate and it was huge! So much tasty food. Everyone gets the garlic noodles and I can see why. My curry chicken was v eyes tasty but kinda watery. Would still order it again. Thai tea also delicious! Great prices and the people who run the place are super nice and accommodating. Would highly recommend to anyone!", "rating": 5, "date": "2018-09-03"}, {"excerpts": ["Curry Chicken Garlic Noodle\nImperial Rolls\n\n"], "author": "Briana H.", "review": "Quick Tip\nOrder via  Grubhub or Eat 24 for a quick pick up and delivery\n\nWhat to get?\nFive Spice Chicken Garlic Noodle\nCurry Chicken Garlic Noodle\nImperial Rolls\n\nGarlic Noodles are buttery, chewy, and full of garlic flavor! It's a MUST ORDER! Pair that either with the Five Spice Chicken or Curry Chicken and you've got a bombastic meal! The Five Spice Chicken is grilled to perfection--tender meat with a slightly crispy skin. The Curry Chicken tastes pretty much similar to the curry chicken soup at Perilla's brother restaurant, PPQ. Lastly, the Imperial Rolls are pretty tasty. Wrap the egg roll in lettuce, add a mint leaf, and dip into sauce for a flavorful dynamic of crunchiness and freshness!", "rating": 5, "date": "2016-04-20"}], "imperial rolls and spice chicken garlic noodle": [], "imperial rolls and charbroiled pork garlic noodle": [{"excerpts": ["Sunday ~ 7:00pm\nOccasion: Hungry after a day visiting the museum  \nParty of:  1\nOrdered: Imperial Rolls and Charbroiled Pork Garlic Noodle ", "(Mi Toi Cha Gio Thit Nuong) ", "[see pic]\n", "Accessibility: ", "The place was w/c friendly.\n", "Total: "], "author": "Anh N.", "review": "Date/Time: Sunday ~ 7:00pm\nOccasion: Hungry after a day visiting the museum  \nParty of:  1\nOrdered: Imperial Rolls and Charbroiled Pork Garlic Noodle (Mi Toi Cha Gio Thit Nuong) [see pic]\nAccessibility: The place was w/c friendly.\nTotal: $12.31\n\nIf you like garlic noodles, than you must try this place. The garlic noodles was cooked to perfection; seasoned with the right about of butter & garlic. The charbroiled pork was seasoned well and had nice grilled marks.\n\nI will definitely come here again and try the other garlic noodles dishes.", "rating": 4, "date": "2012-06-06"}], "imperial rolls and charbroiled beef garlic noodles": [], "imperial rolls and charbroiled shrimp garlic noodle": [{"excerpts": ["so I ordered the Imperial Rolls and Charbroiled Shrimp Garlic Noodle. ", "I understand that shrimp is more expensive than chicken but damn only 4 pieces of tiny shrimp on my plate for $12.55. ", "The chicken option is $11.25 -- I know now not to order the shrimp because I was getting ripped off."], "author": "Annie Y.", "review": "Seriously the best garlic noodle I ever had! I usually order the Imperial Rolls and Five Spice Chicken Garlic Noodle but I didn't have a big appetite so I ordered the Imperial Rolls and Charbroiled Shrimp Garlic Noodle. I understand that shrimp is more expensive than chicken but damn only 4 pieces of tiny shrimp on my plate for $12.55. The chicken option is $11.25 -- I know now not to order the shrimp because I was getting ripped off.", "rating": 4, "date": "2017-09-05"}], "fivespice chicken vermicelli": [], "charbroiled pork vermicelli": [{"excerpts": ["My partner got their Charbroiled Pork Vermicelli. "], "author": "Chariya S.", "review": "3.5 \n\nI wanted to like this restaurant since the waiters are super nice and it's a clean venue. However, the food was average. I got their #21 Five Spices Chicken Garlic Noodle. I couldn't taste the five spice flavor on the chicken but I did like the crispy chicken skin. The garlic noodles were a little disappointing - a bit dry and underwhelming for my taste. \n\nMy partner got their Charbroiled Pork Vermicelli. I thought the pork was super delicious but the other ingredients were lacking such as fresh lettuces (and more of it would've been nice). \n\nWe also ordered a cup of their broth and it was so salty. My partner tried to dilute it with water but it didn't help.", "rating": 3, "date": "2017-12-29"}, {"excerpts": ["*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n"], "author": "Elena N.", "review": "I used to order delivery through GrubHub all the time. Now that Eat24 and delivery.com offer incentives like $2 off or 30% off, I rarely use Grubhub anymore. Unfortunately, that means I forget Perilla delivers. And I used to love ordering their food!\n\nDecember 2012\n*Imperial rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=mOfdgssPMJcHuieu8yVvEg#mOfdgssPMJcHuieu8yVvEg\n*Curry chicken rice plate ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=V2oyxybFtVq7pG_CcSuQ9g#V2oyxybFtVq7pG_CcSuQ9g\n*Five spices chicken garlic noodle ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=5rp0tATcpcfUMI2xoDPlZQ#5rp0tATcpcfUMI2xoDPlZQ\n\nSeptember 2012\n*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n*Imperial rolls and five spice chicken garlic noodle ($9.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=rMkTLvCVUpAs1iXRYpQkwQ#rMkTLvCVUpAs1iXRYpQkwQ\n*Shrimp rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=-49udEyIMh9hIcygERCfzw#-49udEyIMh9hIcygERCfzw\n\n*Perilla beef combo pho ($7.75)\nSoup: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=Bo1ZX1wGhEHCuF_m1--IsA#Bo1ZX1wGhEHCuF_m1--IsA\nMeat & noodles: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#cYZ3qOj7f8T-yWDVZipO-g\nSides & hoisin sauce: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#ZmvT-h0StepsFLikhJviag\n\nOne of my favorite dishes is the Imperial rolls and five spice chicken garlic noodle. I get a big plate of variety for less than $10?! Yes please! The meat is tender. The imperial rolls flavorful and crispy. And the garlic noodles are nice and garlicky!\n\nI have to remember to order through Grubhub when I'm craving garlic noodles and chicken since Perilla's version is delicious!", "rating": 4, "date": "2014-12-26"}, {"excerpts": ["The IMPERIAL ROLLS AND CHARBROILED PORK VERMICELLI was really good just like Yummy Yummy but the PHO isnt comparable.  ", "My fave is still Yummy Yummy PHO.  ", "BUT if you like your PHO...lacking a better word...less salty I guess then try it here.  ", "The portions are good and so is the service."], "author": "she q.", "review": "I love the FIVE SPICE CHICKEN GARLIC NOODLE.  They are consistent in how they make this every time I get it or my friends get it.  Nice crispy chicken and the garlic noodles wasnt drowned in butter or garlic.  PAPAYA SALAD WITH CHARBROILED BEEF was pretty good. The IMPERIAL ROLLS AND CHARBROILED PORK VERMICELLI was really good just like Yummy Yummy but the PHO isnt comparable.  My fave is still Yummy Yummy PHO.  BUT if you like your PHO...lacking a better word...less salty I guess then try it here.  The portions are good and so is the service.", "rating": 4, "date": "2011-02-01"}], "charbroiled pork chops vermicelli": [], "charbroiled beef vermicelli": [], "charbroiled shrimps vermicelli": [], "imperial rolls and spice chicken vermicelli": [], "imperial rolls and charbroiled pork vermicelli": [{"excerpts": ["*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n"], "author": "Elena N.", "review": "I used to order delivery through GrubHub all the time. Now that Eat24 and delivery.com offer incentives like $2 off or 30% off, I rarely use Grubhub anymore. Unfortunately, that means I forget Perilla delivers. And I used to love ordering their food!\n\nDecember 2012\n*Imperial rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=mOfdgssPMJcHuieu8yVvEg#mOfdgssPMJcHuieu8yVvEg\n*Curry chicken rice plate ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=V2oyxybFtVq7pG_CcSuQ9g#V2oyxybFtVq7pG_CcSuQ9g\n*Five spices chicken garlic noodle ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=5rp0tATcpcfUMI2xoDPlZQ#5rp0tATcpcfUMI2xoDPlZQ\n\nSeptember 2012\n*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n*Imperial rolls and five spice chicken garlic noodle ($9.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=rMkTLvCVUpAs1iXRYpQkwQ#rMkTLvCVUpAs1iXRYpQkwQ\n*Shrimp rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=-49udEyIMh9hIcygERCfzw#-49udEyIMh9hIcygERCfzw\n\n*Perilla beef combo pho ($7.75)\nSoup: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=Bo1ZX1wGhEHCuF_m1--IsA#Bo1ZX1wGhEHCuF_m1--IsA\nMeat & noodles: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#cYZ3qOj7f8T-yWDVZipO-g\nSides & hoisin sauce: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#ZmvT-h0StepsFLikhJviag\n\nOne of my favorite dishes is the Imperial rolls and five spice chicken garlic noodle. I get a big plate of variety for less than $10?! Yes please! The meat is tender. The imperial rolls flavorful and crispy. And the garlic noodles are nice and garlicky!\n\nI have to remember to order through Grubhub when I'm craving garlic noodles and chicken since Perilla's version is delicious!", "rating": 4, "date": "2014-12-26"}, {"excerpts": ["The IMPERIAL ROLLS AND CHARBROILED PORK VERMICELLI was really good just like Yummy Yummy but the PHO isnt comparable.  ", "My fave is still Yummy Yummy PHO.  ", "BUT if you like your PHO...lacking a better word...less salty I guess then try it here.  ", "The portions are good and so is the service."], "author": "she q.", "review": "I love the FIVE SPICE CHICKEN GARLIC NOODLE.  They are consistent in how they make this every time I get it or my friends get it.  Nice crispy chicken and the garlic noodles wasnt drowned in butter or garlic.  PAPAYA SALAD WITH CHARBROILED BEEF was pretty good. The IMPERIAL ROLLS AND CHARBROILED PORK VERMICELLI was really good just like Yummy Yummy but the PHO isnt comparable.  My fave is still Yummy Yummy PHO.  BUT if you like your PHO...lacking a better word...less salty I guess then try it here.  The portions are good and so is the service.", "rating": 4, "date": "2011-02-01"}], "imperial rolls and charbroiled beef vermicelli": [], "imperial rolls and charbroiled shrimps vermicelli": [], "fivespice chicken rice plate": [], "charbroiled pork rice plate": [{"excerpts": ["We then ordered 2 orders of imperial rolls (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=iWz-T5a2bmd2ferjrGJL2w) and five spice chicken garlic noodle and 1 order of charbroiled pork rice plate (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=jyWQX5GrkY16ZcNdNvyLzg). ", "The imperial rolls and five spice chicken garlic noodle were definitely a hit! ", "The imperial rolls were extra crispy and filled with tons of ground pork and veggies. ", "The five spice chicken was crispy outside, but juicy inside--it was sooo good! ", "The garlic noodles were just A-OK for me...", "I guess I was expecting the noodles to be more garlicky, but the garlic flavor ended up being very subtle. ", "Overall,  I think I was more excited for the five spice chicken than the garlic noodles. ", "Sigh..."], "author": "Lien T.", "review": "I was in town this past Tuesday, running some errands with a good friend, when we decided to try some of San Francisco's popular garlic noodles. With his luck, our first choice wasn't open until 5pm and our second choice wasn't open at all! We settled for third and ended up at Perilla!\n\nOur first impressions were that the restaurant was small and very clean. We were seated immediately upon arrival as there were no other customers. We started off with the papaya salad with charbroiled beef (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=zw0FDaMoxoSw2gnDUJVf4g). Man, the portion was huge! It came with freshly julienned papaya, basil, carrots, peanuts, dried shallots, and a ton of charbroiled beef. The flavors of the charbroiled beef and veggies complemented with the fish sauce DELICIOUSLY. Next time, I'd probably prefer the papaya salad with poached shrimp instead...the beef was a little too heavy as a starter for me. We then ordered 2 orders of imperial rolls (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=iWz-T5a2bmd2ferjrGJL2w) and five spice chicken garlic noodle and 1 order of charbroiled pork rice plate (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=jyWQX5GrkY16ZcNdNvyLzg). The imperial rolls and five spice chicken garlic noodle were definitely a hit! The imperial rolls were extra crispy and filled with tons of ground pork and veggies. The five spice chicken was crispy outside, but juicy inside--it was sooo good! The garlic noodles were just A-OK for me...I guess I was expecting the noodles to be more garlicky, but the garlic flavor ended up being very subtle. Overall,  I think I was more excited for the five spice chicken than the garlic noodles. Sigh...oh well, I'm still a fan though!\n\nAnd oh, the service was great--quick and friendly.\nStreet parking was such a drag.", "rating": 4, "date": "2010-05-01"}], "charbroiled pork chops rice plate": [], "charbroiled beef rice plate": [], "charbroiled shrimp rice plate": [], "curry chicken rice plate": [{"excerpts": ["Curry chicken rice plate ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=V2oyxybFtVq7pG_CcSuQ9g#V2oyxybFtVq7pG_CcSuQ9g\n", "*"], "author": "Elena N.", "review": "I used to order delivery through GrubHub all the time. Now that Eat24 and delivery.com offer incentives like $2 off or 30% off, I rarely use Grubhub anymore. Unfortunately, that means I forget Perilla delivers. And I used to love ordering their food!\n\nDecember 2012\n*Imperial rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=mOfdgssPMJcHuieu8yVvEg#mOfdgssPMJcHuieu8yVvEg\n*Curry chicken rice plate ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=V2oyxybFtVq7pG_CcSuQ9g#V2oyxybFtVq7pG_CcSuQ9g\n*Five spices chicken garlic noodle ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=5rp0tATcpcfUMI2xoDPlZQ#5rp0tATcpcfUMI2xoDPlZQ\n\nSeptember 2012\n*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n*Imperial rolls and five spice chicken garlic noodle ($9.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=rMkTLvCVUpAs1iXRYpQkwQ#rMkTLvCVUpAs1iXRYpQkwQ\n*Shrimp rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=-49udEyIMh9hIcygERCfzw#-49udEyIMh9hIcygERCfzw\n\n*Perilla beef combo pho ($7.75)\nSoup: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=Bo1ZX1wGhEHCuF_m1--IsA#Bo1ZX1wGhEHCuF_m1--IsA\nMeat & noodles: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#cYZ3qOj7f8T-yWDVZipO-g\nSides & hoisin sauce: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#ZmvT-h0StepsFLikhJviag\n\nOne of my favorite dishes is the Imperial rolls and five spice chicken garlic noodle. I get a big plate of variety for less than $10?! Yes please! The meat is tender. The imperial rolls flavorful and crispy. And the garlic noodles are nice and garlicky!\n\nI have to remember to order through Grubhub when I'm craving garlic noodles and chicken since Perilla's version is delicious!", "rating": 4, "date": "2014-12-26"}], "imperial rolls and spice chicken rice plate": [], "imperial rolls and charbroiled pork rice plate": [], "imperial rolls and charbroiled beef rice plate": [], "imperial rolls and charbroiled shrimp rice plate": [], "cabbage salad with fried tofu": [], "veggie combo veggie broth pho": [], "seasoned veggie garlic noodle": [{"excerpts": ["#30 Imperial rolls & shrimp garlic noodles   $12.25\n#51 Imperial rolls & five spice chicken rice plate  $9.75\n#59 Seasoned veggie garlic noodle  $9.75\n#9  "], "author": "Mayana P.", "review": "Go here. Nice people. Good food. Free local delivery if $20+ if after 5pm. This location opens daily 11am-9pm\n\nParking kind of sucked but for the price and what you get, this place is SO worth it. For about $10, depending on what you get, you get huge portions that can feed a SUPER hungry person or two people with a medium to appetite. I wish they were a little closer (SF is a trek for me and this is deep in SF with no shortcuts to get to and fro) because I really like their food. They're also SO NICE! On the phone and in person, they're so caring and hospitable. I usually tip anyway when I pick up food but I WANTED to tip a little extra than what I usually do. My picky SO enjoyed the veggie garlic noodles. I really appreciate that with their plates, they give broccoli on the side. I love broccoli and it's not overcooked. They even season it a little bit with something, I think or perhaps it's the aromas and condensation permeating into the green flesh, soaking up the garlic goodness. This is what I ordered (Yes, I went a lil over board but I have food for days!) :\n\n#30 Imperial rolls & shrimp garlic noodles   $12.25\n#51 Imperial rolls & five spice chicken rice plate  $9.75\n#59 Seasoned veggie garlic noodle  $9.75\n#9  Curry chicken vermicelli (spicy coconut milk curry broth noodle soup) $8.99\nTogo bag $0.10\n\nEverything was $45 with tax. Like I said, good portions. I adore and salivate for imperial rolls like these that use rice paper instead of the flour but only if it's done right and they do it right. The pork and veggie inside the rolls are delicious and the dipping sauce, which is good too but to me, not needed. I just pop them into my mouth and it's gone. lol #30 and #51 each had 6 pieces of the deep fried rolls with a healthy (\"healthy\" how are butter infused noodles \"healthy\"? lol I don't care! Gimme!) amount of delicious garlic noodles. Oh and some broccoli. Who says I'm not healthy? ;) \n\n#59 was pretty good but if I had meat options at a place like this, I'm ordering the meat. It's good though and I also liked the Curry chicken soup which had a good spicy kick to it but not overpowering for baby spice buds like my tongue that can't handle much. The food tastes even better and more flavorful the following days as leftovers. Everything really infuses into each morsel. Next time, I'd order #27 Imperial rolls & Five spice chicken garlic noodles $10.75\n\nOnly thing is, I wish they offered and had brown rice but that can be because of limited space in kitchen or something. Well, if someone knows the manager/owner of Perilla and can suggest this and make this happen, you can be my friend lol, I'd totally pay extra for this healthier (low sugar spike and more fiber BUT it does have more arsenic...meh give me brown rice please! nom nom I don't care... yum in my tum lol)\n\nI also like the feel of this location better than the one in the financial district. It's more low key here, more room and not packed, loud and crazy hectic like it is at the other location.", "rating": 5, "date": "2015-07-08"}], "seasoned veggie rice plate": [], "seasoned veggie vermicelli": [], "iced vietnamese coffee": [{"excerpts": ["The boyfriend also wanted to try out their iced vietnamese coffee. "], "author": "Lisa L.", "review": "Boyfriend was craving pho and the original place down on Irving was closed so we found Perilla on Yelp to check out and satisfy those cravings. \n\nStarted off with the imperial rolls. I was so amazed that for once our appetizer of these rolls came out before our main dishes. Loved the filling and the extra crunch and freshness from the cucumber; fried perfectly and great portion. Highly recommend. \n\nThe boyfriend also wanted to try out their iced vietnamese coffee. For some reason, though good, it was not as strong in coffee flavor as other places we have tried back in SoCal Westminster area. \n\nHe enjoyed his pho. It came with your usual basil, bean sprouts and surprisingly lemon instead of lime. The broth was clean and flavorful, just what you want from a good bowl of pho. \n\nI ordered the garlic noodles with lemongrass beef. The beef was definitely packed with great seasoning and balanced out the blandness of the noodles. Unfortunately, I was expecting a more garlic-y taste from the noodles but they just reminded me of plain spaghetti in a way. The portion was huge! I barely made a dent so thankfully its price made it worth for 2 meals. \n\nService is great! We sat down next to the windows and the servers immediately noticed that the sun was shining down on us. They helped us bring down their curtains. Refilled our waters every so often, just super nice customer service in general. Loved the ambiance and decoration of the overall restaurant as well.", "rating": 4, "date": "2018-02-27"}], "young coconut juice with pulp": [], "plum soda": [{"excerpts": ["Finally got to try to plum soda, a must try if you like sour drinks!! "], "author": "Emily H.", "review": "The best garlic noodles in town. Definitely have to get the imperial rolls and five spice chicken as well.\n\nFinally got to try to plum soda, a must try if you like sour drinks!! So refreshing and goes super well with the garlic noodle as it balances everything out.", "rating": 5, "date": "2018-07-22"}], "hot vietnamese coffee": [{"excerpts": ["We had the papaya salad with shrimp, veggie summer rolls, and shared the five spice chicken garlic noodles and a hot Vietnamese coffee. ", "This is great chicken ", "and I think I make good chicken. ", "The coffee was perfectly sweet. ", "The salad and rolls were so fresh. ", "Everything came out to $30 for 2. ", "Not bad!"], "author": "Susie L.", "review": "We were on the list at Manna across the street but still had a long wait and were feeling pretty hungry. We noticed Perilla was seating immediately and had good reviews on yelp. What a good choice to come here.\n\nWe had the papaya salad with shrimp, veggie summer rolls, and shared the five spice chicken garlic noodles and a hot Vietnamese coffee. This is great chicken and I think I make good chicken. The coffee was perfectly sweet. The salad and rolls were so fresh. Everything came out to $30 for 2. Not bad!", "rating": 5, "date": "2018-04-15"}], "garlic noodle": [{"excerpts": ["The second time I ordered the five spice chicken garlic noodle with imperial rolls, which is worth the extra dollar (because who doesn't love crispy egg rolls). ", "However, the noodles the second time around were notably tougher, maybe due to over-sautéing it in the pan. ", "Nonetheless, I'd totally recommend Perilla. ", "It's top of my list for restaurants in Inner Sunset!"], "author": "Vickie N.", "review": "Perilla is especially known for their garlic noodles, which is what I've ordered the two times I've been here. The first time blew my mind- I got the five spice chicken garlic noodles and was thoroughly impressed at the crisp and flavor of the chicken (especially when dipped in the fish sauce)! The noodles themselves were very buttery and garlicy with a nice bite to them. And I was left with enough portion for another meal to take home!\n\nThe second time I ordered the five spice chicken garlic noodle with imperial rolls, which is worth the extra dollar (because who doesn't love crispy egg rolls). However, the noodles the second time around were notably tougher, maybe due to over-sautéing it in the pan. Nonetheless, I'd totally recommend Perilla. It's top of my list for restaurants in Inner Sunset!", "rating": 5, "date": "2018-10-20"}, {"excerpts": ["#27 Imperial Rolls and 5-Spice Chicken Garlic Noodle (11.85) is all you need to order here to walk out satisfied. ", "The noodles are buttery. ", "Boneless tender pieces of juicy chicken. ", "Crunchy egg rolls. "], "author": "Raymond W.", "review": "#27 Imperial Rolls and 5-Spice Chicken Garlic Noodle (11.85) is all you need to order here to walk out satisfied. The noodles are buttery. Boneless tender pieces of juicy chicken. Crunchy egg rolls. Yum.\n\nCasual spot with high quality Vietnamese food!", "rating": 4, "date": "2018-10-18"}, {"excerpts": ["I'd recommend this place for their garlic noodle plates."], "author": "Elaine N.", "review": "I went here for an early dinner with 11 people. Most of us got the garlic noodles with five spice chicken since we heard that's what they're known for. One of my friends got the chicken curry with rice, which was still good, but the curry was very thin and watery.\n\nThe garlic noodles were very good! Not too garlicky, but also not too plain. I loved the 5 spice chicken. The chicken wasn't hard to chew, not dry, and was very flavorful. I'd recommend this place for their garlic noodle plates.", "rating": 4, "date": "2018-09-19"}, {"excerpts": ["They are well known for their garlic noodle dishes in which is my usually go to when I visit Perilla's.\n\n"], "author": "Timothy C.", "review": "Perilla's is always my go to spot for a quick lunch or dinner.\nThey are well known for their garlic noodle dishes in which is my usually go to when I visit Perilla's.\n\nWhen we Arrived the restaurant was filled but we were readily seated right away for a table of 2.\n\nThey offered waters and napkins with a menu, but right away me and my Girlfriend knew what to order. So we waived the waitress down to get our orders in.\n\nMy girlfriend order the #9 which is a curry chicken vermicelli soup dish extra tofu for her please, Perfect on  a cold foggy  SF day! The curry soup  was rich and flavorful with coconut milk, For a curry soup it definitely had a lot of chicken which is good in my case! The tofu and vermicelli were perfectly cooked and very enjoyable.\n\nI order the #27 which is the 5 spice chicken with garlic noodles and imperial rolls. The 5 spice chicken was cooked just right nice and crispy dipping in with the fish sauce, the imperials were nice and crispy not too soggy like some places that just reheat them to order. Garlic noodles definitely had a lot of flavor compared to what i was use to and generous portion at that.\n\nPerilla's will always be a go to for those dishes if not the Pho. Sometimes I'm so hungry i order the Pho Dac Biet, With 5 spice chicken garlic noodles just to have the best of both worlds!", "rating": 4, "date": "2018-08-14"}, {"excerpts": ["I've ordered the bbq pork with garlic noodle before. ", "It was 3 pieces of pork attached to the bone which each piece is about the size of the palm. ", "They cut up part of the pork for your convenience but the whole piece is still intact to the bone. ", "Maybe because I ordered around closing time, the food I received looked liked scraps. ", "It was just small dried pieces of pork put together in an order. "], "author": "Tiffany L.", "review": "I have mixed feelings about this place. Food is good. Everytime I come, service is good. However, my take out from last night changed my perception of the restaurant. I ordered an imperial roll and pork with garlic noodles. I ordered on a Friday night 10 mins before 9pm, which is their closing time. I asked if I can still order take out. Since I've worked at a restaurant before, I know how annoying it is when there are orders coming in if they have started cleaning the kitchen. They said it's ok and should be ready in 10 mins. \n\nThey charged me as 2 separate orders for about 20 dollars. Then I checked on yelp to confirm that the exact same item is $11.25. It's not like the separate order had extra egg rolls, so I'm not sure why it was charged separately. That wasn't the main issue. The issue is with the inconsistent of their food. I've ordered the bbq pork with garlic noodle before. It was 3 pieces of pork attached to the bone which each piece is about the size of the palm. They cut up part of the pork for your convenience but the whole piece is still intact to the bone. Maybe because I ordered around closing time, the food I received looked liked scraps. It was just small dried pieces of pork put together in an order. (See pic attached).\n\nI really like this place and it was a disappointment. I'm not sure if I would order take out here again especially before closing time.", "rating": 2, "date": "2018-05-26"}, {"excerpts": ["My friends and I shared a garlic noodle dish with beef and a rice dish with pork chops.  ", "The garlic noodles were bomb! ", "I would come back just for the garlic noodles!  ", "The beef was so tender and perfectly cook. ", "Not dry at all! ", "The pork chop plate came with two large chops.  ", "Also perfectly cooked and not dry.  "], "author": "Jennifer T.", "review": "Randomly came here for lunch since our original lunch plans fell through.  We were pleasantly surprise about the quality of food!  I went into this place thinking it might be a mediocre Asian fusion place, but it was actually really good!  \n\nMy friends and I shared a garlic noodle dish with beef and a rice dish with pork chops.  The garlic noodles were bomb! I would come back just for the garlic noodles!  The beef was so tender and perfectly cook. Not dry at all! The pork chop plate came with two large chops.  Also perfectly cooked and not dry.  I was so surprised about the quality of their food. \n\nThe service was also really friendly. They had smiles on their face as the welcomed and seated us.  Also, happily asked how our food was and made sure our water was filled.  \n\nI would definitely come back!", "rating": 4, "date": "2018-02-23"}, {"excerpts": ["So refreshing and goes super well with the garlic noodle as it balances everything out."], "author": "Emily H.", "review": "The best garlic noodles in town. Definitely have to get the imperial rolls and five spice chicken as well.\n\nFinally got to try to plum soda, a must try if you like sour drinks!! So refreshing and goes super well with the garlic noodle as it balances everything out.", "rating": 5, "date": "2018-07-22"}, {"excerpts": ["I got their #21 Five Spices Chicken Garlic Noodle. ", "I couldn't taste the five spice flavor on the chicken ", "but I did like the crispy chicken skin. "], "author": "Chariya S.", "review": "3.5 \n\nI wanted to like this restaurant since the waiters are super nice and it's a clean venue. However, the food was average. I got their #21 Five Spices Chicken Garlic Noodle. I couldn't taste the five spice flavor on the chicken but I did like the crispy chicken skin. The garlic noodles were a little disappointing - a bit dry and underwhelming for my taste. \n\nMy partner got their Charbroiled Pork Vermicelli. I thought the pork was super delicious but the other ingredients were lacking such as fresh lettuces (and more of it would've been nice). \n\nWe also ordered a cup of their broth and it was so salty. My partner tried to dilute it with water but it didn't help.", "rating": 3, "date": "2017-12-29"}, {"excerpts": ["The BF got the lunch size garlic noodle plate with the pork and spring rolls. ", "He liked his as well, he just isn't much for pork ", "so maybe would opt for the five spice chicken next time. ", "The table next to us ordered it, looked good. ", "Big portions of garlic noodle.\n", "Service: \nNot friendly, not mean. ", "Gave us a side plate initially with condensation on it, quickly replaced it with a dry clean new one without us asking.\n", "This is the kind of service I prefer, not checking on you a million times, but tentative."], "author": "Chela A.", "review": "Love their vegetarian pho I also order the grilled shrimp on the side, so good!\nThe BF got the lunch size garlic noodle plate with the pork and spring rolls. He liked his as well, he just isn't much for pork so maybe would opt for the five spice chicken next time. The table next to us ordered it, looked good. Big portions of garlic noodle.\nService: \nNot friendly, not mean. Gave us a side plate initially with condensation on it, quickly replaced it with a dry clean new one without us asking.\nThis is the kind of service I prefer, not checking on you a million times, but tentative.", "rating": 5, "date": "2018-09-15"}, {"excerpts": ["Got the curry chicken garlic noodle plate and it was huge! ", "So much tasty food. ", "Everyone gets the garlic noodles and I can see why. ", "My curry chicken was v eyes tasty but kinda watery. ", "Would still order it again. ", "Thai tea also delicious! ", "Great prices and the people who run the place are super nice and accommodating. ", "Would highly recommend to anyone!"], "author": "Sidney W.", "review": "Got the curry chicken garlic noodle plate and it was huge! So much tasty food. Everyone gets the garlic noodles and I can see why. My curry chicken was v eyes tasty but kinda watery. Would still order it again. Thai tea also delicious! Great prices and the people who run the place are super nice and accommodating. Would highly recommend to anyone!", "rating": 5, "date": "2018-09-03"}, {"excerpts": ["It was so flavorful and he ordered me the chicken and garlic noodle plate. ", "The chicken was crispy. ", "It was hard to explain to my dad, because the skin seemed fried, but didn't have the typical fried flavor. ", "It came with a fish sauce to dip the chicken inside. "], "author": "Heather I.", "review": "Their garlic noodles are AMAZING! After my boyfriend's description of the plate, I wasn't quite sure what to expect besides garlic breath, but the flavor wasn't overpowering (thank goodness). It was so flavorful and he ordered me the chicken and garlic noodle plate. The chicken was crispy. It was hard to explain to my dad, because the skin seemed fried, but didn't have the typical fried flavor. It came with a fish sauce to dip the chicken inside. So delicious and I approve of this place! \n\nDefinitely will be eating here more often when I visit the sunset area of sf.", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["the garlic noodle wasn't as good as I was expecting. ", "Just based on the garlic noodle combos"], "author": "Tasha L.", "review": "First time trying this place. I bookmarked it to my collections to try when I'm in the area. Not going to lie the hubs and I said if San Tung doesn't have a line we're going there first. \n\nDeductions of stars\n1) hair found in his egg rolls- yes they made him ONE egg roll to compromise \n\n2) we had to flag them down that we are ready to order \n\n3) the garlic noodle wasn't as good as I was expecting. Cooked with loads of oil and lack of garlic taste or flavor \n\n4) I had diarrhea instantly after eating here \n\nI'm not really sure what's the hype. Maybe the prices but we didn't try the pho. Just based on the garlic noodle combos", "rating": 1, "date": "2018-06-21"}, {"excerpts": ["Also ordered the garlic noodle with five spice chicken. ", "The five spice flavor isn't as strong as I would like but the meat was silky soft and I definitely appreciate that. ", "The type of noodle used is not my favorite type of noodle as I find that too chewy and dense "], "author": "Lily F.", "review": "The service is nice and quick. Restaurant a bit small but clean and has a nice atmosphere.\n\nOrdered the beef carpaccio on a whim and that ended up being a great decision. The beef was soft and fresh. It was an awesome flavor explosion in your mouth. Would definitely order that again.\n\nAlso ordered the garlic noodle with five spice chicken. The five spice flavor isn't as strong as I would like but the meat was silky soft and I definitely appreciate that. The type of noodle used is not my favorite type of noodle as I find that too chewy and dense but that's just personal preference. \n\nThe Vietnamese coffee is nice and strong for those who need that caffeine kick.", "rating": 4, "date": "2018-01-01"}, {"excerpts": ["I am giving it 3 stars due to the garlic noodle being so hyped up! ", "I expected so much more. ", "The garlic noodle was bland in my opinion and it did not satisfy me. ", "I barely tasted the garlic, it was not enough flavoring! ", "What made up for my meal was the side order of imperial rolls! ", "They were delicious and crispy, one of the best I've tried around San Francisco. ", "I'd definitely come back for the imperial rolls and try other things on the menu! ", "The meal we had seemed to be made fresh which is also a plus."], "author": "Karmela A.", "review": "I was super excited to try this place because I've had it bookmarked on yelp for awhile now. I've also read so many good reviews so my boyfriend and I gave it a try for lunch yesterday since we were in the area. First impression of the place was good, we were greeted by friendly faces and seated promptly. It's a pretty small space so it was a little crowded. Service was great! I am giving it 3 stars due to the garlic noodle being so hyped up! I expected so much more. The garlic noodle was bland in my opinion and it did not satisfy me. I barely tasted the garlic, it was not enough flavoring! What made up for my meal was the side order of imperial rolls! They were delicious and crispy, one of the best I've tried around San Francisco. I'd definitely come back for the imperial rolls and try other things on the menu! The meal we had seemed to be made fresh which is also a plus.", "rating": 3, "date": "2018-07-28"}, {"excerpts": ["My bf really liked his garlic noodle!"], "author": "Trina V.", "review": "Came here with the bf and a couple of friends because honestly, the line at San Tung was way too long and we were hungry.\n\nThis restaurant is medium-sized, so I'm assuming that there might be a line at times. I also saw a lot of people picking up take out.\n\nAnyway, my review is for the pho. The broth was kind of bland and on a cold day, that's kind of all I want. The meat and the egg noodle were average.\n\nI would recommend sticking to their plated meals. My bf really liked his garlic noodle!", "rating": 3, "date": "2017-11-17"}, {"excerpts": ["The garlic noodle itself is really garlicky and buttery. ", "The best kind of garlic noodles. "], "author": "Auden W.", "review": "I have been having occasional cravings for Perilla. I feel like this place never fails to satisfy my hunger needs. I usually get the charbroiled pork or beef with garlic noodles. My Gf sticks with the five spice chicken with rice or sometimes the beef. I'd say this place does a good job serving a satisfying portion size. Each plate runs around $10-12.\n\nThe food is served with fish sauce where u can dip the food in, but sometimes I like a good mix of hoisin and Sriracha. The garlic noodle itself is really garlicky and buttery. The best kind of garlic noodles. However, I do second think about getting the garlic noodles for health reasons. \n\nIf you're feeling some satisfying and affordable food, then Perilla is the one for you.", "rating": 4, "date": "2017-04-11"}, {"excerpts": ["Chewy not soggy garlic noodle seems to be the staple. \n\n"], "author": "Dave K.", "review": "This review is for Perilla's delivery service. I've never eaten inside because I have no one to eat with and I am self conscious about how normal social people would perceive me. I would also probably eat too quickly or awkwardly stare at my phone as if I was actually communicating with someone other than my mother.\n\nI've been ordering from Perilla for several 3 years now, despite living only a block away for 9. \n\nGreat food. Crispy legit spring rolls made with rice paper (not egg roll). Moist perfectly cooked 5spice chicken. Chewy not soggy garlic noodle seems to be the staple. \n\nFast delivery. Convenient.", "rating": 5, "date": "2018-06-12"}, {"excerpts": ["The garlic noodle with. ", "Bbq chicken is my favorite but many of the other items on the menu are also verygood. ", "Cant go wrong with great price with a lot of food. ", "And tasty what more can you ask for. ."], "author": "Andrew M.", "review": "Good food at a great price. Their food is tasty and the portions are large. The garlic noodle with. Bbq chicken is my favorite but many of the other items on the menu are also verygood. Cant go wrong with great price with a lot of food. And tasty what more can you ask for. .", "rating": 4, "date": "2018-05-01"}, {"excerpts": ["Their pork chop garlic noodle is the best in town. ", "And service is A+++++++ . ", "I rarely find any place in the city that the server (maybe the owner) smiles 10 millions time to customers like that. ", "We ordered pork-chop garlic noodle ", "but she took the wrong order, ", "when it came out we didn't take it ", "but she was so happy to exchange for us . ", "Also she kept saying sorry and happily take the mistake to herself.  ", "That is the exact manner you want to receive at any restaurant. ", "Love this place. ", "We are here almost every weekend."], "author": "Chloe N.", "review": "Their pork chop garlic noodle is the best in town. And service is A+++++++ . I rarely find any place in the city that the server (maybe the owner) smiles 10 millions time to customers like that. We ordered pork-chop garlic noodle but she took the wrong order, when it came out we didn't take it but she was so happy to exchange for us . Also she kept saying sorry and happily take the mistake to herself.  That is the exact manner you want to receive at any restaurant. Love this place. We are here almost every weekend.", "rating": 5, "date": "2018-08-04"}, {"excerpts": ["My friend and I ordered the Five Spices Chicken Garlic Noodle ($10.25) and Charboiled Pork Chops Garlic Noodle ($10.95) ", "and both were super delicious! ", "Both come with a heaping pile of garlic noodles, a large slab of protein, and a yummy sauce to pair. "], "author": "Kris C.", "review": "What to order: Garlic noodles!!  \n\nMy friend and I ordered the Five Spices Chicken Garlic Noodle ($10.25) and Charboiled Pork Chops Garlic Noodle ($10.95) and both were super delicious! Both come with a heaping pile of garlic noodles, a large slab of protein, and a yummy sauce to pair. The chicken tastes delicious when dipped in the sauce. \n\nPortion sizes are gigantic, but you'll probably still finish the whole dish because they're that good! I also enjoyed how they added a few pieces of broccoli to the dish - it made me feel a little less bad about carb loading from the noodles.", "rating": 5, "date": "2017-08-29"}, {"excerpts": ["Seriously the best garlic noodle I ever had! ", "I usually order the Imperial Rolls and Five Spice Chicken Garlic Noodle ", "but I didn't have a big appetite ", "so I ordered the Imperial Rolls and Charbroiled Shrimp Garlic Noodle. ", "I understand that shrimp is more expensive than chicken but damn only 4 pieces of tiny shrimp on my plate for $12.55. ", "The chicken option is $11.25 -- I know now not to order the shrimp because I was getting ripped off."], "author": "Annie Y.", "review": "Seriously the best garlic noodle I ever had! I usually order the Imperial Rolls and Five Spice Chicken Garlic Noodle but I didn't have a big appetite so I ordered the Imperial Rolls and Charbroiled Shrimp Garlic Noodle. I understand that shrimp is more expensive than chicken but damn only 4 pieces of tiny shrimp on my plate for $12.55. The chicken option is $11.25 -- I know now not to order the shrimp because I was getting ripped off.", "rating": 4, "date": "2017-09-05"}, {"excerpts": ["The garlic noodle texture is nice and chewy. ", "Imperial rolls are also really good- ", "I highly recommend trying them! ", "The portions are pretty big. ", "I can never finish if I get five spice chicken, imperial rolls, and noodles.\n", "The service here is always friendly. ", "However if the restaurant gets crowded and you're seated by the door, it can be hard to get the server's attention. \n", "Parking in this area is usually easy to find, but can also be really difficult depending on the time and day of the week."], "author": "Emily L.", "review": "My go-to dishes here are the five spice chicken vermicelli or the five spice chicken with garlic noodles. I tried the charbroiled beef once and it's pretty good too. The charbroiled beef's flavor was good but it was a little too tough in my opinion. The chicken is always tender and has a great crispy skin on the outside. It pairs really well with garlic noodles! The garlic noodles have the perfect amount of garlicky aroma without being overly pungent. The garlic noodle texture is nice and chewy. Imperial rolls are also really good- I highly recommend trying them! The portions are pretty big. I can never finish if I get five spice chicken, imperial rolls, and noodles.\nThe service here is always friendly. However if the restaurant gets crowded and you're seated by the door, it can be hard to get the server's attention. \nParking in this area is usually easy to find, but can also be really difficult depending on the time and day of the week.", "rating": 4, "date": "2017-07-03"}, {"excerpts": ["Five Spice Chicken w/ Garlic Noodle: \n-you don't get much chicken but for the little that you do get, it's magical. ", "The chicken is moist and juicy, the skin is seasoned and cooked to a beautiful golden brown.\n", "-garlic "], "author": "Vivian S.", "review": "I have a love/hate relationship with this place because their five spice chicken is freaken delicious but they only give 7 small pieces....grrrrr WHY YOU HAVE TO BE SO GOOD FOR \n\nOkay here is the breakdown. \n*It's a typically priced Vietnamese restaurant. Portion-wise, it's not much. BUT the food is pretty darn good. \n\n*Menu isn't as extensive but feature some of the more popular Vietnamese dishes and of course their ever famous five spice chicken with garlic noodles. \n\nI was craving pho but definitely couldn't pass on trying their five spice chicken so my girlfriend and I shared it. \n\nFive Spice Chicken w/ Garlic Noodle: \n-you don't get much chicken but for the little that you do get, it's magical. The chicken is moist and juicy, the skin is seasoned and cooked to a beautiful golden brown.\n-garlic noodles were fresh and pretty good; not the best I ever had, honestly I thought it could use more garlic. \n\nPho Tai Bo Vien (rare beef and meatball): soup is flavorful and delicious. It seems to also be apparent in their pho too that they're a bit exiguous or skimpy when it comes to meat lol. So do bear that in mind. If you're not concerned about portions then taste-wise, this place is a gem!\n\nPARKING: street, metered and unmetered residential \n\nSERVICE: incredible! Guy was super friendly and attentive", "rating": 4, "date": "2017-02-22"}, {"excerpts": ["Imperial Rolls and Five Spices Chicken Garlic Noodle - Comes with 3 imperial rolls. ", "The imperial rolls were ok. ", "I would probably only order them again to share. ", "The chicken was well seasoned and tender with crispy skin. ", "The garlic noodles were just the right combination of buttery and garlicky but a bit dry."], "author": "Amanda H.", "review": "Come hungry. This casual Vietnamese restaurant serves large portions. The waiting area inside is minimal so don't be intimidated if you see people gathered on the sidewalk. Thankfully, service and attentive staff mean the wait is rarely long.\n\nImperial Rolls and Five Spices Chicken Garlic Noodle - Comes with 3 imperial rolls. The imperial rolls were ok. I would probably only order them again to share. The chicken was well seasoned and tender with crispy skin. The garlic noodles were just the right combination of buttery and garlicky but a bit dry.", "rating": 4, "date": "2017-01-09"}, {"excerpts": ["I saw the photos on Yelp of the garlic noodle dishes and immediately knew I wanted it. ", "It's quite a solid dish. ", "Great amount of noodles and meat. ", "Only 2-3 pieces of broccoli, which is perfect, haha. ", "The waitresses have been pretty friendly."], "author": "Steven L.", "review": "The first 2 times I went here, it was because I didn't want to wait in line to get into Yummy Yummy (about a block away). I saw the photos on Yelp of the garlic noodle dishes and immediately knew I wanted it. It's quite a solid dish. Great amount of noodles and meat. Only 2-3 pieces of broccoli, which is perfect, haha. The waitresses have been pretty friendly.", "rating": 5, "date": "2018-03-01"}, {"excerpts": ["Imperial Rolls and Charbroiled Beef Garlic Noodle: ", "I love this dish because I get three of my favorite things and only two pieces of steamed broccoli (which is still too much broccoli).  ", "The imperial rolls were perfectly crispy and filled with moist pork.  ", "It's not Tu Lan quality, but still really good.  ", "I love the charbroiled beef because it's shellacked with tangy marinade and full of seared goodness; almost like having Korean BBQ done for you.  ", "The garlic noodles are so garlicky and chewy.  ", "Pork Chop Garlic Noodle: ", "A massive amount of meat.  ", "Thinly cut, heavily marinated and nicely seared like the beef.  "], "author": "Adam B.", "review": "I'm familiar with the Perilla in the FiDi so was curious to try this one in the Avenues after a staycation day at the Academy of Sciences.  I actually think this location is better.  For the FiDi lunch rush, that location must precook a lot of the garlic noodles; I've seen huge the huge vats they pull from.  We came here for an early dinner when it wasn't that crowded; our order took awhile so I figured they made it fresh.  And I could tell the difference; the noodles were so good!\n\nImperial Rolls and Charbroiled Beef Garlic Noodle: I love this dish because I get three of my favorite things and only two pieces of steamed broccoli (which is still too much broccoli).  The imperial rolls were perfectly crispy and filled with moist pork.  It's not Tu Lan quality, but still really good.  I love the charbroiled beef because it's shellacked with tangy marinade and full of seared goodness; almost like having Korean BBQ done for you.  The garlic noodles are so garlicky and chewy.  They're not quite as good as An The Go (i.e. Crustacean's food truck), but still yummy. \n\nPork Chop Garlic Noodle: A massive amount of meat.  Thinly cut, heavily marinated and nicely seared like the beef.  As much as I'm a big fan of the beef, this may be better.\n\nCup of Broth: I know you don't come here for the pho, so I obviously didn't order pho.  But I was curious how it tasted so I got a cup of their beef pho broth.  It was basically meh.  Heavy tones of star anise and salt.  Missing the rich fatty and umami meat subtleties you might find at Bodega Bistro.  Definitely stick with the garlic noodles.", "rating": 4, "date": "2016-04-11"}, {"excerpts": ["I made the mistake on my part of ordering pho here in the first place because this restaurant is mainly known for their garlic noodle platters. ", "Their broth was very very bland and their noodles were a bit soggy as well. ", "I've definitely experienced much better pho elsewhere and probably will not be back here."], "author": "Monica L.", "review": "I came here after a long day of work hoping to find some good tasting pho. I made the mistake on my part of ordering pho here in the first place because this restaurant is mainly known for their garlic noodle platters. Their broth was very very bland and their noodles were a bit soggy as well. I've definitely experienced much better pho elsewhere and probably will not be back here.", "rating": 2, "date": "2017-07-20"}, {"excerpts": ["Today, I decided to try #27, the imperial rolls with garlic noodle and five spiced chicken. ", "I felt that garlic noodles could've been more garlic-y, but the imperial rolls and the chicken was crispy and good. "], "author": "Elaine C.", "review": "I give it a 3 star because I think the food is decent. It's not bad but it's not like omg it's so good. I've tried pho and from what I remember, it tasted very bland and they didn't give too much meat. \n\nToday, I decided to try #27, the imperial rolls with garlic noodle and five spiced chicken. I felt that garlic noodles could've been more garlic-y, but the imperial rolls and the chicken was crispy and good. However I find it a bit on the expensive side for the amount of food. \n\nMy bf ordered #26, which is Garlic noodles and chicken curry. I tried the curry and it was pretty salty, sadly which is exactly how my bf loves it. \n\nFor all the times I've came here, it wasn't because I was craving it, it was more because my bf wanted to go because we didn't know what to eat. I personally wouldn't come here as my choice unless someone else wanted to go. The workers are very sweet and nice but oh wells :/", "rating": 3, "date": "2016-01-21"}, {"excerpts": ["For the garlic noodle dishes, at least. \n\n"], "author": "Joey C.", "review": "First thing I want to say, HUGE PORTIONS! For the garlic noodle dishes, at least. \n\nMy boyfriend and I came in on a Monday when they opened. It wasn't busy which was okay to me. I ordered their charbroiled pork with garlic noodles & imperial roll. I was so shocked when my order came! A huge pile of garlic noodles and I love garlic noodles! The noodles didn't have enough garlic flavor to me, to be honest. I love garlic so sometimes it can be too much for other people. My first bite was slightly bland, but as I got to the middle, it had a little more flavor. I did add some sriracha and fish sauce and it balanced it out. The pork was flavorful and not tough at all. I do want to try their five spice chicken next time. Service was great! I enjoyed my first time experience.", "rating": 4, "date": "2017-04-20"}, {"excerpts": ["If you don't know what to do, the garlic noodle five spice chicken #21 combo is pretty cracking! \n\n", "If you have that authentic garlic noodle craving, in the area, got a $20 in your wallet- you will be all set for Perilla."], "author": "Winnie G.", "review": "Love love love love me some garlic noodles. \n\nPerilla is perfect especially since now their sister restaurant PPQ is no longer opened for lunch, this is where my cravings are completely satisfied. Its still quite a drive out Herr, but it's less busy even during peak lunch hours. It's mostly to gos or table of one,which is fine by me. The space to dine is very small a couple of tables, narrow walkways. \n\nThere's always a lunch special going in for their banh mi (Vietnamese sandwich) and an order of Thai tea for about 7 dollars. But that's not why I'm there. Its for the garlic noodles! Its smaller portions but the same flavor is right there. A rich, buttery sauce with minced garlic slight crisp to the noodles, yet so moist and mouthful with each bite. Its a pretty huge side with the entree like their five spice chicken or pork. I only enjoy the chicken when I'm at Perilla, at PPQ its almost a waste of an order because there's so much better dinner options.\n\nThis is the place to try the PPQ pho (9.75)- love their broth. It's not a mouth full of salt or MSG, or green onions and cilantro. How lucky is that?! There's a couple of variations for meat choices, but there is one bowl size. That's all you really need. It's more expensive than your typical bowl of pho, but the quality is there and the rare beef is of a better quality. It's still under $10 a bowl which isn't bad. \n\nImperial rolls (7.25) here are off the chain. Crispy as hell and it gets hotter which eat bite (almost tongue burning!) But it doesn't lose it's crisp during the entire meal. They're like fun sized version of lumpia but better tasting for sure. \n\nFive spice chicken whether its on the side, with the garlic noodles, on the pho- the skin's crisp is beyond me. Crunch with every bite, so flavorful and the chicken is moist! Not dry. The portions for the chicken definitely isn't skimped. If you don't know what to do, the garlic noodle five spice chicken #21 combo is pretty cracking! \n\nI'm a noodles gal, so you already know I'll have that side of their famous garlic noodles (3.5). The bowl is pretty deep and it's almost as much as you would regularly get at PPQ from a dinner side. \n\nTo be honest, everything here is absolutely delicious. It opens for lunch and it opens for dinner. It's way more quieter and cozier than PPQ is especially for a date. Downside is no crab, but I mean service here is on point. Always friendly and smiling. Beats the service at any of their other locations. \n\nIf you have that authentic garlic noodle craving, in the area, got a $20 in your wallet- you will be all set for Perilla.", "rating": 5, "date": "2015-08-25"}, {"excerpts": ["If you're not feelin garlic noodle-y and want to opt for white rice, don't be afraid to ask! "], "author": "Carrie L.", "review": "Been coming here for years & I'm pretty sure I've only gotten two dishes here haha. It's either garlic noodles w/ imperial rolls and pork OR 5 spice chicken (depending on my mood). \n\nIt's a huge pretty big plate - huge portion of noodles & a couple pieces of broccoli as well! If you're not feelin garlic noodle-y and want to opt for white rice, don't be afraid to ask! Just pour over the fish sauce and mm mmm :) Imperial rolls are always cooked until their crisp and meet is well seasoned. \n\nFor 10.25, I'd say it's definitely worth it. Most recently I got to try my friends curry noodles & it was good at first - but I can never take too much curry at once - but she really enjoyed it!", "rating": 4, "date": "2015-11-08"}, {"excerpts": ["Wait was not that long on sat afternoon close to 2pm, ordered pho and garlic noodle, portion and taste are good. ", "Service was fast. ", "Will try again next time"], "author": "Grace L.", "review": "Wait was not that long on sat afternoon close to 2pm, ordered pho and garlic noodle, portion and taste are good. Service was fast. Will try again next time", "rating": 4, "date": "2018-06-03"}, {"excerpts": ["All your usual dish choices, but instead of rice/vermicelli noodle you can get Garlic Noodle. "], "author": "Theresa D.", "review": "You know when you want Vietnamese, but you want something just a tiny bit nicer. Well this place is it and more than a tiny bit nicer, since the wait staff is very friendly. \n\nThe space is small and not super loud when you dine-in. The one thing they do, that others places don't is Garlic Noodles. All your usual dish choices, but instead of rice/vermicelli noodle you can get Garlic Noodle. They use a Canton Style Noodle and it's a slight Garlic and Buttery flavor. \n\nAnd the dishes seems less greasy than usual.", "rating": 4, "date": "2016-07-08"}, {"excerpts": ["chicken garlic noodle plate. ", "Um, YUM. ", "Chicken was super moist and tasty! ", "Garlic noodles were good as well, but the chicken really stood out. ", "The prices are standard for the area, but I found the portions to be quite large. "], "author": "Noelle H.", "review": "I was surprisingly impressed! \n\nThere's mixed reviews on Perilla so I had low expectations. I decided to just go with what they're famous for- chicken garlic noodle plate. Um, YUM. Chicken was super moist and tasty! Garlic noodles were good as well, but the chicken really stood out. The prices are standard for the area, but I found the portions to be quite large. Loved the imperial rolls as well!\n\nFriendly service!", "rating": 4, "date": "2015-03-11"}, {"excerpts": ["Five Spice Chicken Garlic Noodle\n", "Curry Chicken Garlic Noodle\nImperial Rolls\n\n"], "author": "Briana H.", "review": "Quick Tip\nOrder via  Grubhub or Eat 24 for a quick pick up and delivery\n\nWhat to get?\nFive Spice Chicken Garlic Noodle\nCurry Chicken Garlic Noodle\nImperial Rolls\n\nGarlic Noodles are buttery, chewy, and full of garlic flavor! It's a MUST ORDER! Pair that either with the Five Spice Chicken or Curry Chicken and you've got a bombastic meal! The Five Spice Chicken is grilled to perfection--tender meat with a slightly crispy skin. The Curry Chicken tastes pretty much similar to the curry chicken soup at Perilla's brother restaurant, PPQ. Lastly, the Imperial Rolls are pretty tasty. Wrap the egg roll in lettuce, add a mint leaf, and dip into sauce for a flavorful dynamic of crunchiness and freshness!", "rating": 5, "date": "2016-04-20"}, {"excerpts": ["Did a take out tonight and was satisfied with the BBQ, garlic noodle and portion size"], "author": "Drew B.", "review": "Did a take out tonight and was satisfied with the BBQ, garlic noodle and portion size", "rating": 4, "date": "2017-02-02"}, {"excerpts": ["Five spices chicken garlic noodle ($8.50) ", "*Imperial rolls and five spice chicken garlic noodle ($9.50) ", "http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=rMkTLvCVUpAs1iXRYpQkwQ#rMkTLvCVUpAs1iXRYpQkwQ\n", "One of my favorite dishes is the Imperial rolls and five spice chicken garlic noodle. ", "I get a big plate of variety for less than $10?! ", "Yes please! ", "The meat is tender. ", "The imperial rolls flavorful and crispy. "], "author": "Elena N.", "review": "I used to order delivery through GrubHub all the time. Now that Eat24 and delivery.com offer incentives like $2 off or 30% off, I rarely use Grubhub anymore. Unfortunately, that means I forget Perilla delivers. And I used to love ordering their food!\n\nDecember 2012\n*Imperial rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=mOfdgssPMJcHuieu8yVvEg#mOfdgssPMJcHuieu8yVvEg\n*Curry chicken rice plate ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=V2oyxybFtVq7pG_CcSuQ9g#V2oyxybFtVq7pG_CcSuQ9g\n*Five spices chicken garlic noodle ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=5rp0tATcpcfUMI2xoDPlZQ#5rp0tATcpcfUMI2xoDPlZQ\n\nSeptember 2012\n*Imperial rolls and charbroiled pork vermicelli ($8.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=C-ZLuS4OBqSXzMvpSaZtjw#C-ZLuS4OBqSXzMvpSaZtjw\n*Imperial rolls and five spice chicken garlic noodle ($9.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=rMkTLvCVUpAs1iXRYpQkwQ#rMkTLvCVUpAs1iXRYpQkwQ\n*Shrimp rolls ($6.50) http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=-49udEyIMh9hIcygERCfzw#-49udEyIMh9hIcygERCfzw\n\n*Perilla beef combo pho ($7.75)\nSoup: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=Bo1ZX1wGhEHCuF_m1--IsA#Bo1ZX1wGhEHCuF_m1--IsA\nMeat & noodles: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#cYZ3qOj7f8T-yWDVZipO-g\nSides & hoisin sauce: http://www.yelp.com/biz_photos/perilla-san-francisco-2?select=cYZ3qOj7f8T-yWDVZipO-g#ZmvT-h0StepsFLikhJviag\n\nOne of my favorite dishes is the Imperial rolls and five spice chicken garlic noodle. I get a big plate of variety for less than $10?! Yes please! The meat is tender. The imperial rolls flavorful and crispy. And the garlic noodles are nice and garlicky!\n\nI have to remember to order through Grubhub when I'm craving garlic noodles and chicken since Perilla's version is delicious!", "rating": 4, "date": "2014-12-26"}, {"excerpts": ["Perilla has all the usual vietnamese dishes but their garlic noodle combinations are most popular and one order is enough for 2 (if you're willing to share).\n\n"], "author": "Samantha L.", "review": "Every restaurant they own is so good! Love PPQ  . . . Noodle House and Dungeness Island. Perilla has all the usual vietnamese dishes but their garlic noodle combinations are most popular and one order is enough for 2 (if you're willing to share).\n\nWhat to order? Number 25 - Five Spice Chicken, Imperial Rolls and Garlic Noodles\n\nThe vermicelli is great and the salads refreshing. The pho is good although better at PPQ Noodle House on 19th and irving. The portions are generous here and everything is delicious.", "rating": 5, "date": "2015-02-03"}, {"excerpts": ["you must try the garlic noodle with 5 spice chicken. "], "author": "Linda L.", "review": "you must try the garlic noodle with 5 spice chicken. Simple yet so good.\n\nWe eat in and so take out/delivery. If you plan and having it delivered order 45min-1 HR ahead", "rating": 5, "date": "2016-06-13"}, {"excerpts": ["and I tried the garlic noodle with five spice chicken for the first time. ", "The pho broth was decent. ", "There was a good amount of noodle and meat. ", "The five spice chicken was deliciously moist and flavored. ", "I would really recommend it by itself. ", "I do not understand the fuss over the garlic noodle. ", "I love garlicky food ", "and I would have really liked this dish if I didn't feel so gross eating it. ", "The whole dish revolves around grease and a great quantity of carbs. ", "I stopped after a couple quick bites because I was so afraid of getting a heart attack if I kept eating it. ", "The dish left me with such a heavy feeling afterwards, as if my body had to work extra hard to digest all that oil. ", "I don't even think that garlic oily noodle is even an authentic Vietnamese dish anyways. ", "You cannot find that in any Vietnamese restaurant in Orange County or Vietnam. \n", "Overall, the place was cheap and there were many different options. ", "We will keep coming back for other dishes."], "author": "Catherine T.", "review": "Decent place. My boyfriend got the pho dac biet and I tried the garlic noodle with five spice chicken for the first time. The pho broth was decent. There was a good amount of noodle and meat. The five spice chicken was deliciously moist and flavored. I would really recommend it by itself. I do not understand the fuss over the garlic noodle. I love garlicky food and I would have really liked this dish if I didn't feel so gross eating it. The whole dish revolves around grease and a great quantity of carbs. I stopped after a couple quick bites because I was so afraid of getting a heart attack if I kept eating it. The dish left me with such a heavy feeling afterwards, as if my body had to work extra hard to digest all that oil. I don't even think that garlic oily noodle is even an authentic Vietnamese dish anyways. You cannot find that in any Vietnamese restaurant in Orange County or Vietnam. \nOverall, the place was cheap and there were many different options. We will keep coming back for other dishes.", "rating": 3, "date": "2017-05-23"}, {"excerpts": ["Garlic noodle is very good. ", "Not many places serve this, so if you're into a dry garlic noodle, this is the place to beat.\n\n", "All in all, come here for garlic noodle only."], "author": "Stephanie Z.", "review": "Garlic noodle is very good. Not many places serve this, so if you're into a dry garlic noodle, this is the place to beat.\n\nPho sucks. Chicken pho tastes like it has been drenched with rock sugar. Probably the most disappointing pho I've had considering it's also overpriced.. You're much better off going to Yummy Yummy a few blocks down.\n\nAll in all, come here for garlic noodle only.", "rating": 3, "date": "2017-09-10"}, {"excerpts": ["chicken garlic noodle is the best if you're having a problem choosing which garlic noodle dish to order. ", "Parking is tough to find as usual and lines can be long at times but mostly not too bad. ", "Great service and prices."], "author": "Vicheth K.", "review": "This is an awesome restaurant for garlic noodles. The other items on the menu are pretty good too but the garlic noodles are definitely their specialty. 5-spice chicken garlic noodle is the best if you're having a problem choosing which garlic noodle dish to order. Parking is tough to find as usual and lines can be long at times but mostly not too bad. Great service and prices.", "rating": 4, "date": "2016-10-08"}, {"excerpts": ["The garlic noodle and chicken dish was very garlicky and exactly what was to be expected. ", "The portions are quite large; two people can probably share a plate and then go for dessert or drinks after.  ", "I love that!\n", "Quick and friendly service. ", "Nothing spectacular but nothing to complain about. ", "Overall a decent experience. ", "The place was nice in that it wasn't too loud ", "and it was the typical casual Asian eatery. ", "I really enjoyed my meal here."], "author": "Tu L.", "review": "The garlic noodle and chicken dish was very garlicky and exactly what was to be expected. The portions are quite large; two people can probably share a plate and then go for dessert or drinks after.  I love that!\nQuick and friendly service. Nothing spectacular but nothing to complain about. Overall a decent experience. The place was nice in that it wasn't too loud and it was the typical casual Asian eatery. I really enjoyed my meal here.", "rating": 4, "date": "2016-10-21"}, {"excerpts": ["The garlic noodle portion is huge and I couldn't even finish my plate in one sitting. ", "The meal was pretty cheap as well! "], "author": "Joanne Y.", "review": "I have always wanted to try this place as I have seen many of my friends eat here! I just didn't know what the restaurant was called, but when my friend mentioned that there was this place that served garlic noodles - I had to check it out! I was super happy to figure out that this was the restaurant that I've been meaning to try! \n\nThere was no wait to be seated. The place was decently full. I'm glad that my friend and I arrived here before the lunch rush because I was starving! My friend ordered the five spice chicken garlic noodles dish with the imperial egg rolls and I ordered the charbroiled beef garlic plate (I believe #24 on the menu). Omg I can't even begin to describe how good the food was and simple. My dish had the beef, noodles, broccoli, and fish sauce (which I don't eat). Even without the fish sauce, the food was delicious! The garlic noodle portion is huge and I couldn't even finish my plate in one sitting. The meal was pretty cheap as well! I believe it was about $30 without tip? \n\nThe service here is excellent! Our water were always filled (even if the cups weren't even nearly empty and our server brought me a togo container without me even having to ask! I will most definitely come back here and try more of the dishes! :)", "rating": 4, "date": "2015-10-10"}, {"excerpts": ["Great flavor and generous portion of garlic noodle and 5spice chicken. ", "Their menu offered a great selection of garlic noodle plates. ", "We also ordered the Satay Pho with well-done brisket. ", "It was a huge bowl filled with plenty of vermicelli noodle and hearty brisket slices. ", "The broth was flavorful with a good amount of spice. ", "Definitely comforting on a cold day."], "author": "M S E.", "review": "Great flavor and generous portion of garlic noodle and 5spice chicken. Their menu offered a great selection of garlic noodle plates. We also ordered the Satay Pho with well-done brisket. It was a huge bowl filled with plenty of vermicelli noodle and hearty brisket slices. The broth was flavorful with a good amount of spice. Definitely comforting on a cold day.", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["I've tried the garlic noodles at Ben Tre, and sadly their garlic noodle is completely flavorless compared to Perilla's. ", "This is definitely one of the main reasons I keep coming back here.\n", "Their imperial rolls are also pretty good. ", "Their curry is hands down delicious. ", "Their portion sizes are huge. ", "What else can I say? ", "The garlic noodle does leave you with garlic breath afterwards lol ", "so if you're not going straight home, help the people around you and bring a breath mint or something ^_^"], "author": "Jennie L.", "review": "This has become my go-to spot for garlic noodles! I've tried the garlic noodles at Ben Tre, and sadly their garlic noodle is completely flavorless compared to Perilla's. This is definitely one of the main reasons I keep coming back here.\nTheir imperial rolls are also pretty good. Their curry is hands down delicious. Their portion sizes are huge. What else can I say? :)\n\nI use the Eat24 app and order for pickup. It's quick and easy. No hassle at all. It takes about 15-20 mins for them to prepare your order, depending on how big your order is, of course.\n\nI haven't eaten there so I can't say much about the dining-in service but when I go in to pick up my order, they're always really nice and quick no matter how busy they are.\n\nMy family, bf and I usually order the imperial rolls and 5 spice chicken garlic noodles, imperial rolls and charbroiled pork garlic noodles, and/or the curry garlic noodles. YUM. These dishes are $10.75 each. I'd say it's worth every penny.\n\nMinus 1 for the fact that we did find a bug on the lettuce in our imperial roll to-go order. Bugs are a big no, no for me. But my bf says, at least we can see how fresh the veggies are...??? It was one time, so I still go for their delicious food hoping it won't happen again.\n\nWarning: The garlic noodle does leave you with garlic breath afterwards lol so if you're not going straight home, help the people around you and bring a breath mint or something ^_^", "rating": 4, "date": "2016-11-24"}, {"excerpts": ["Their specialty is the garlic noodle ", "so we ordered the five spice chicken garlic noodle and the imperial roll/chicken vermicelli. "], "author": "Conely C.", "review": "Decent place for solid food. Their specialty is the garlic noodle so we ordered the five spice chicken garlic noodle and the imperial roll/chicken vermicelli. The garlic flavor is not strong so rest assured, you don't have to be out all day with garlic breath.\n\nThe imperial roll was fresh hot and crispy served on top of a bed of \"dry\" vermicelli noodle. My favorite part is drowning the noodles in the vinegar fish sauce. Yum!", "rating": 4, "date": "2016-10-24"}, {"excerpts": ["Five Spice Chicken Garlic Noodle.\n\n"], "author": "Adele F.", "review": "Five Spice Chicken Garlic Noodle.\n\nWhat is that?\n\nIt's what you should order.\n\nWhat will you get?\n\nOrdering the FIVE SPICE CHICKEN GARLIC NOODLE (Mi Toi Ga Quay Chao) will get you thick and chewy egg noodles, sauteed moderately with butter with garlic chunks. No, the noodles will not be swimming in butter--they will just have been lightly bathed in butter and then gently dusted with garlic powder. The noodles will be accompanied by tender, fatty, boneless chicken leg strips with crispy skin, topped with sauteed green onions and highlighted with a delightful bowl of fish sauce. Last but not least is a measly attempt at eating healthy with two pieces of steamed broccoli (http://s3-media2.ak.yelpcdn.com/bphoto/N3WKUdN_XB1ZTvAt2Lwn6g/l.jpg).\n\nHow much will it set you back?\n\nA mere $8.50.\n\nWhat else could you get?\n\nItems such as the shrimp vermicilli or pho.\n\nWill they be as good?\n\nNope.\n\nWhat is I want to buy a lot at once; say, for an event...or for myself?\n\nUnfortunately, Perilla doesn't seem to be very reliable when it comes to catering; read Michelle N.'s passionate review on that topic. Besides, the catered, mass-produced food just doesn't taste as good as the personal portions.", "rating": 4, "date": "2013-05-25"}, {"excerpts": ["Can't go wrong with the garlic noodle combos either with five spice chicken or the pork with the imperial rolls. ", "Affordable and large portions. ", "Can't go wrong with that."], "author": "Serena C.", "review": "Quick, cheap, and delicious food and the quality hasn't changed -  still as good as ever. Can't go wrong with the garlic noodle combos either with five spice chicken or the pork with the imperial rolls. Affordable and large portions. Can't go wrong with that.", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["You must order #27 Five Spice Chicken Garlic Noodle with Imperial Rolls. ", "The yelp reviews are no exaggeration of how good this dish is. ", "I am a huge fan of their Five Spice Chicken and the imperial rolls, I would venture to say it's one of the best rolls I've had. "], "author": "Karen C.", "review": "You must order #27 Five Spice Chicken Garlic Noodle with Imperial Rolls. The yelp reviews are no exaggeration of how good this dish is. I am a huge fan of their Five Spice Chicken and the imperial rolls, I would venture to say it's one of the best rolls I've had. We also ordered #18 The Papaya Salad with Charbroiled Beef, both of these dishes were a nice complement to each other. Their portions are huge, so the prices are very reasonable at $10-$12.\n\nExtremely friendly service and quick. I highly recommend coming here if you're in the area.", "rating": 4, "date": "2016-01-27"}, {"excerpts": ["Garlic noodle dish. ", "So amazing. ", "Street parking which may be difficult to find, but hey this place is really worth it. ", "There pho bowls are huge as well. ", "The servers are so welcoming and very generous. ", "Makes me want to come back more."], "author": "Anriella D.", "review": "Garlic noodle dish. So amazing. Street parking which may be difficult to find, but hey this place is really worth it. There pho bowls are huge as well. The servers are so welcoming and very generous. Makes me want to come back more.", "rating": 5, "date": "2016-03-05"}, {"excerpts": ["Favorite garlic noodle restaurant. ", "Must get the garlic noodles with five spice chicken and imperial rolls. ", "The plates are very filling and worth the money. ", "Wait for food isn't that long ether. ", "5 stars."], "author": "Chris M.", "review": "Favorite garlic noodle restaurant. Must get the garlic noodles with five spice chicken and imperial rolls. The plates are very filling and worth the money. Wait for food isn't that long ether. 5 stars.", "rating": 5, "date": "2016-04-11"}, {"excerpts": ["Especially if you are a GARLIC NOODLE connoisseur like myself.  ", "BIG FAT PORTIONS of noodley goodness.  ", "The food is really good and really good price.  ", "I would've included some photos "], "author": "Jeremy C.", "review": "Man this place is an absolute GEM for Vietnamese food.  Especially if you are a GARLIC NOODLE connoisseur like myself.  BIG FAT PORTIONS of noodley goodness.  The food is really good and really good price.  I would've included some photos but I started eating before the camera could be used.  \n\nAlso tried their beef carpaccio as well and it was stellar.  All the staff were really friendly and nice.  Nothing spectacular over the top but 4 stars forsure.  Definitely check this place out, if you want some good food and don't want to break the bank.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["Garlic noodle is so good here, and also their pho is great as well. ", "It's just a bit expensive for Vietnamese food, but the location makes up for it."], "author": "Pei F.", "review": "Garlic noodle is so good here, and also their pho is great as well. It's just a bit expensive for Vietnamese food, but the location makes up for it.", "rating": 4, "date": "2017-03-04"}, {"excerpts": ["and I went our separate ways on our $8.50 Garlic Noodle plates - ", "I had my standby, the Five-Spice Chicken (see photo), while he veered into the Charbroiled Pork marinaded in garlic and pepper (see photo). "], "author": "Ed U.", "review": "I would be hard pressed to give Perilla anything less than four stars - it's solid, house-made Vietnamese fare for the relatively undemanding urbanite. Maybe because Jamie W. and I are used to the one on Mission near the demolished Transbay Terminal, a bustling place during the lunch hour, that we were marginally disappointed with the garlic level in the garlic noodles served here. Dare I say it was a tad bland, which makes stuffing your face with heavy-duty carbs more of a dietary challenge than it has to be. But I won't ding them much for that since the quality level is still pretty darn high for the Perilla brand.\n\nNow that there are three of them in the city plus PPQ Beef Noodle House close to this location and the PPQ Dungeness Island in the Outer Richmond - are we looking at the Vietnamese version of the King of Thai Noodle chain? Could be... In truth, we went to the Geary location first but found it closed for renovation, so out of determination to have our garlic noodles, we took the 44 O'Shaughnessy line to the Irving Street location, which was very nearly packed. Soon after we were seated, we ordered the $6.50 Shrimp Rolls, which were a tad small but still delectable as a starter.\n\nJamie and I went our separate ways on our $8.50 Garlic Noodle plates - I had my standby, the Five-Spice Chicken (see photo), while he veered into the Charbroiled Pork marinaded in garlic and pepper (see photo). Both were perfectly tasty, but I have to admit the standout may have been the $6.50 plate of Seasoned Vegetables - shredded cabbage and carrots mixed with fried tofu (see photo). I was liking it all, but the young woman sitting behind me kept playing with her hair, pulling it into a ponytail, and whipping it against my head with no regard to the lack of sanitation in her nervous habit. Disgusting...and wear a hat to cover your dandruff-covered head, hon.\n\nFOOD - 4 stars...still Perilla-quality even if they seem to have a garlic shortage here\nAMBIANCE - 2.5 stars...get me away from that hair-tossing moron!\nSERVICE - 3 stars...always smiling, just not always present\nTOTAL - 4 stars...if only the Mission location stayed open for dinner and on weekends (sigh)", "rating": 4, "date": "2012-09-20"}, {"excerpts": ["My one gripe about this is, I ordered takeout from here and they packed the garlic noodle in to the box, which made it kind of soggy and dense."], "author": "Joyce C.", "review": "GARLIC NOODLES, SO GARLIC-Y!\n\nMy one gripe about this is, I ordered takeout from here and they packed the garlic noodle in to the box, which made it kind of soggy and dense.", "rating": 3, "date": "2015-11-19"}, {"excerpts": ["Get the garlic noodle, imperial roll, five spice chicken plate. ", "It's #27 I think, and it is just the best of all worlds at around $10. ", "You will definitely leave  feeling full, and your taste buds will be thanking you. ", "I've tried their chicken pho and Vietnamese sandwich previously, but I would stick with the combination plate. ", "It's simply the best!"], "author": "Corinna T.", "review": "Get the garlic noodle, imperial roll, five spice chicken plate. It's #27 I think, and it is just the best of all worlds at around $10. You will definitely leave  feeling full, and your taste buds will be thanking you. I've tried their chicken pho and Vietnamese sandwich previously, but I would stick with the combination plate. It's simply the best!", "rating": 4, "date": "2014-07-17"}, {"excerpts": ["Definitely was not disappointed by the imperial roll with chicken and garlic noodle combo! ", "The servers are super friendly and when my friend and I came in it wasn't too busy. ", "It's a small place but the food speaks for itself. "], "author": "Victoria Q.", "review": "I've been wanting to try this place since I found it on Yelp a few months. Definitely was not disappointed by the imperial roll with chicken and garlic noodle combo! The servers are super friendly and when my friend and I came in it wasn't too busy. It's a small place but the food speaks for itself. I'm usually not a fan of egg rolls with rice paper wraps, but these were super yummy! \n\nI had to take it to go because they give you massive portions for $10.75. I ended up finishing the rest at home and it left me craving more of their garlic noodles!!", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["The Green Papaya Beef Salad is-OMG!!:D\nGarlic Noodle plates come with Generous amount of Meat. ", "That's a Plus because I love Big Meat Portions.\n", "3 color Drink is good.\n", "Staff is Super Upbeat.", ":)\n", "Glad ", "I gave it a shot."], "author": "Hung L.", "review": "This place is spacious and awesome.\nKitchen is great.\nFood is tasty and generous portion.\nThe Green Papaya Beef Salad is-OMG!!:D\nGarlic Noodle plates come with Generous amount of Meat. That's a Plus because I love Big Meat Portions.\n3 color Drink is good.\nStaff is Super Upbeat.:)\nGlad I gave it a shot.", "rating": 5, "date": "2015-02-20"}, {"excerpts": ["Whenever I'm home, I make it a point to come here and satisfy my garlic noodle craving. ", "My friends and I all agree that their five spice chicken is the best dish they have, with a large mound of noodles and juicy tender chicken on the side. ", "For an extra dollar, you can add imperial rolls as well. ", "My one complaint about this is that it can be pretty oily sometimes, but the flavor is just so good that I can ignore that fact. ", "If you don't want chicken, the charbroiled pork is good as well! "], "author": "KC W.", "review": "Perilla has to be one of my favorite restaurants in the city. Whenever I'm home, I make it a point to come here and satisfy my garlic noodle craving. My friends and I all agree that their five spice chicken is the best dish they have, with a large mound of noodles and juicy tender chicken on the side. For an extra dollar, you can add imperial rolls as well. My one complaint about this is that it can be pretty oily sometimes, but the flavor is just so good that I can ignore that fact. If you don't want chicken, the charbroiled pork is good as well! I haven't gotten around to trying the rest though.\n\nService is good here, and though it's a little bit pricey, it's definitely worth the money because it's so filling. Parking in the inner sunset does suck though, so either bus and save yourself meter money, or be prepared to walk a few blocks back to your car.", "rating": 5, "date": "2014-07-27"}, {"excerpts": ["The garlic noodle was BOMB. ", "It was not TOO garlicy. ", "THE FIVE SPICE CHICKEN GARLIC NOODLE. \n\n"], "author": "Chena N.", "review": "FIVE SPICE CHICKEN GARLIC NOODLES. \nThis is a rating solely for this dish only because I never tried anything but this plate! And trust me... it's worth it. \n\nThe chicken is marinated to perfection. And it is NOT spicy, so for all you non spicy eaters, dont worry. I got the basic one without the imperial rolls and I believe it was around  $8.50 which isnt bad considering how the portions are generous and the taste is near perfection. The garlic noodle was BOMB. It was not TOO garlicy. It was perfect. \n\nThe restaurant is kind of small. The waiters are very friendly and enthusiastic, which I like. I came here about five times. One time they messed up my order and gave me rice instead of garlic noodles, and they happily took it back and exchanged it for me, NO ATTITUDE given. \n\nHowever besides this dish, I'm not sure if the other ones are as great. My friend made the mistake of getting Pho from here and he said it was horrible. He was Vietnamese so he knows his Pho. \n\nJUST GET THE FIVE SPICE CHICKEN GARLIC NOODLE. \n\nWARNING: Parking SUCKS!!! Every time my friends and I come here we take around 1 hour to find parking. Curse of Irving.... Just dont come during lunch, dinner hours.", "rating": 4, "date": "2012-05-28"}, {"excerpts": ["So going into this experience I'm not a huge garlic noodle or Vietnamese food fan. ", "BUT I really really enjoyed this place. ", "Flavors on the meats (beef and chicken) was really good, egg rolls were bomb and the noodles weren't as greasy as some others I've tried. ", "I came in on a Sunday towards the end of lunch and service was good and fast! ", "If you've never been here ", "I the comment you give it a try!"], "author": "Blaine S.", "review": "So going into this experience I'm not a huge garlic noodle or Vietnamese food fan. BUT I really really enjoyed this place. Flavors on the meats (beef and chicken) was really good, egg rolls were bomb and the noodles weren't as greasy as some others I've tried. I came in on a Sunday towards the end of lunch and service was good and fast! If you've never been here I the comment you give it a try!", "rating": 4, "date": "2016-03-20"}, {"excerpts": ["My husband and I really enjoy the garlic noodle with spring rolls and bbq beef here."], "author": "Tiffany S.", "review": "My husband and I really enjoy the garlic noodle with spring rolls and bbq beef here.", "rating": 4, "date": "2017-07-31"}, {"excerpts": ["Garlic noodle is kind of blend, it definitely can use a tad more garlic in order to call garlic noodle.  ", "On the plus side its not greasy like some garlic noodles that I've tasted.  ", "The staff is nice but the food comes out very slowly.  ", "My fav is the five spice chicken that's moist and flavorful.  ", "The imperial rolls not bad."], "author": "Mar H.", "review": "Garlic noodles, five spice chicken is a must.  I don't like the curry chicken noodle at all, the curry flavor is from a cheap powder form and  coconut milk is lacking, however there was tons of noodles. Garlic noodle is kind of blend, it definitely can use a tad more garlic in order to call garlic noodle.  On the plus side its not greasy like some garlic noodles that I've tasted.  The staff is nice but the food comes out very slowly.  My fav is the five spice chicken that's moist and flavorful.  The imperial rolls not bad.", "rating": 4, "date": "2016-02-20"}, {"excerpts": ["My favorite entrée is the Five Spice Chicken with Imperial Rolls and Garlic Noodle. ", "The chicken is crispy on the outside and truly has the spice-y taste in every bite. ", "The chicken is tender and cooked to perfection. ", "The garlic noodles has the right amount of bounce and not too much oil. ", "I'm not crazy about the imperial rolls by itself but dipped into the fish sauce, it softens up the crispiness and really hits the spot. ", "Perilla usually adds a few pieces of broccoli on the side, which I don't mind  ", "but I'd prefer a bit more greens if they were gonna add it in there anyways. ", "They also add cooked green onions to the garlic noodles to garnish which I love. ", "Portions are HUGE and I typically make two meals out of one order! ", "I came here when I was vegetarian (two years ago) and their Vegetarian Garlic noodles option has a vermicelli-vegetable stir fry combo included that was also surprisingly really good. ", "Overall, service is quick and easy. ", "I will most definitely return whenever I am craving somwle really good garlic noodles."], "author": "Sally Z.", "review": "The best garlic noodles, hands down. I will conatantly come back to this place because I'm hooked! My favorite entrée is the Five Spice Chicken with Imperial Rolls and Garlic Noodle. The chicken is crispy on the outside and truly has the spice-y taste in every bite. The chicken is tender and cooked to perfection. The garlic noodles has the right amount of bounce and not too much oil. I'm not crazy about the imperial rolls by itself but dipped into the fish sauce, it softens up the crispiness and really hits the spot. Perilla usually adds a few pieces of broccoli on the side, which I don't mind  but I'd prefer a bit more greens if they were gonna add it in there anyways. They also add cooked green onions to the garlic noodles to garnish which I love. Portions are HUGE and I typically make two meals out of one order! I came here when I was vegetarian (two years ago) and their Vegetarian Garlic noodles option has a vermicelli-vegetable stir fry combo included that was also surprisingly really good. Overall, service is quick and easy. I will most definitely return whenever I am craving somwle really good garlic noodles.", "rating": 5, "date": "2016-08-31"}, {"excerpts": ["We all ordered different kinds of garlic noodle plates and they were delicious! ", "Fish sauce was just like my dad's homemade one. ", "Portions were large for these plates and we all enjoyed them. ", "Service was fantastic even though it was a full house. ", "We definitely will be coming back if we're in the area :)"], "author": "Lunasiel S.", "review": "We were a a party of five on new year's around 5:30 or 6. There were about 4 or 5 parties in front of us on the waitlist and we actually missed them when they called for us. One of the servers was kind enough to seat us as soon as they had a table available. Overall wait must have been 10 minutes. \n\nThe place was small but that was to be expected from any store on Irving. We all ordered different kinds of garlic noodle plates and they were delicious! Fish sauce was just like my dad's homemade one. Portions were large for these plates and we all enjoyed them. Service was fantastic even though it was a full house. We definitely will be coming back if we're in the area :)", "rating": 5, "date": "2016-01-04"}, {"excerpts": ["I recommend the #7 and also try the garlic noodle's."], "author": "Isaiah E.", "review": "I love to come here on a cold and even a warm day. I had my first pho experience here and instantly fell in love. Nice people here. Great service. Only knock I have is that it isn't the most clean place I've eaten but it's not like super filthy to the point you don't want to eat here. I recommend the #7 and also try the garlic noodle's.", "rating": 4, "date": "2016-11-15"}, {"excerpts": ["Perilla has satisfied my garlic noodle crave and that's a lot coming from a garlic lover like me. ", "Unfortunately, I feel like this place is a little underrated (only locals know about this lovely place I'm guessing?) ", "because each time I go, it's usually quite empty! ", "Maybe its because I come in during after lunch hours (2-3pm) so it may have died down. "], "author": "Abby C.", "review": "Overall: I've found it! Perilla has satisfied my garlic noodle crave and that's a lot coming from a garlic lover like me. Unfortunately, I feel like this place is a little underrated (only locals know about this lovely place I'm guessing?) because each time I go, it's usually quite empty! Maybe its because I come in during after lunch hours (2-3pm) so it may have died down. But I've came here a few times and found this to be a little odd because this place is amazing! \n\nFood: Besides that, the food here pretty much hits the spot. I ordered the charbroiled pork with garlic noodles if I remember correctly. The noodles are chewy and filled with just enough garlic flavor. The charbroiled pork is nicely tendered yet chewy at the same time and complimented the garlic noodles perfectly! Other than the noodles, the entree included: a generous amount of the pork, two pieces of broccoli, and a nice dipping sauce (sweet and sourish fish sauce?) on the side. The portions are pretty big so I usually ask them for a box and even when I reheat it later on, it's still delicious! Thinking about this dish is making me have some serious withdrawals. Wished I had some to eat right now, yum! \n\nCustomer Service: I can tell that they make their customer service a priority because the staffs are all really nice! Once you walk in, you're greeted with a smile and seats are available right away. Menus and water are brought out quickly and they wait a good amount of time before they take your order. Each time I'm there, my waiter was a nice, pleasant guy who wore glasses. He is well trained and is really well mannered! He makes sure to check up on you and go around for water refill. Overall, the amazing food and service makes this place one of my favorites!!", "rating": 5, "date": "2014-08-18"}, {"excerpts": ["12 noodle soups (pho), 10 rice plates, 10 garlic noodle plates, 10 vermicelli bowls, 8 vegetarian dishes, and 8 appetizers. ", "On my last visit I got a combo special of imperial rolls and lemongrass pork over vermicelli bowl, to go. "], "author": "Luis C.", "review": "This 2nd location of Perilla (SOMA) is a welcome addition to the inner Sunset area. Nice to have another good Vietnamese restaurant besides Yummy Yummy a few blocks away.\n\nGreat place for fresh made to order lunch for under $7 (a few items cost more). The menu is very basic (just chicken, pork, beef, or shrimp): 12 noodle soups (pho), 10 rice plates, 10 garlic noodle plates, 10 vermicelli bowls, 8 vegetarian dishes, and 8 appetizers. On my last visit I got a combo special of imperial rolls and lemongrass pork over vermicelli bowl, to go. http://media1.px.yelpcdn.com/bphoto/UrQwpHXMWa5dcpUXLIK3cA/l Hot and delicious!\n\nJust FYI that Perilla, Toasties, and PPQ locations are all owned by the Truong family.", "rating": 4, "date": "2010-11-03"}, {"excerpts": ["The garlic noodle is definitely my top pick when I am here. ", "I'm always here with a large group (5-10) and every single time they have been extremely welcoming and accommodating. ", "Wait time has always been around 10-15 mins. ", "Yay for Perilla!"], "author": "Rebecca J.", "review": "I've been here three times in the past two and a half years and they have always been consistent with their service and quality and taste of food. For the price, I think the portion size is more than fair. The garlic noodle is definitely my top pick when I am here. I'm always here with a large group (5-10) and every single time they have been extremely welcoming and accommodating. Wait time has always been around 10-15 mins. Yay for Perilla!", "rating": 4, "date": "2016-06-15"}, {"excerpts": ["Their five spice chicken is flavor packed and satisfyingly crispy, and the garlic noodle is surprisingly complex. \n", "While many of their dishes are carb-fests, there are also really nice healthy options. ", "This is a solid place to grab lunch or dinner, and they've been fast both times ", "I've gone."], "author": "Allxie C.", "review": "Perilla has some great food at reasonable prices for their large portions and friendly, fast service. \nI've enjoyed two amazing meals here so far--Their papaya salad with beef is much larger than I expected and comes with a hefty portion of delicious beef on a bed of shaved green papaya and a nice dressing. The salad is flavorful and filling.\nTheir five spice chicken is flavor packed and satisfyingly crispy, and the garlic noodle is surprisingly complex. \nWhile many of their dishes are carb-fests, there are also really nice healthy options. This is a solid place to grab lunch or dinner, and they've been fast both times I've gone.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["The server was nice and I ordered a five spice chicken garlic noodle and imperial roll plate.  "], "author": "Rob C.", "review": "Walked in and was immediately greeted by one of the servers across the room.  The server was nice and I ordered a five spice chicken garlic noodle and imperial roll plate.  The wait for the food wasn't that long and the server was nice when he answered my questions.\n\nThe food was pretty good.  I didn't taste much of the five spice in the chicken but it was well cooked and crispy.  The imperial rolls were what I expected out of the price.  The garlic noodles was subtle in terms of garlic and somewhat heavy on the butter, but it was very delicious.  In the future I would probably order one or two side orders of garlic noodles since it seems worth it.", "rating": 4, "date": "2015-04-30"}, {"excerpts": ["I always get their garlic noodle plates.  ", "I like mine with grilled pork- ", "it's cut real thin and very flavorful.  ", "Also, portions are pretty big. \n", "I've been to both locations, SF and Sunset and they are both great and consistent."], "author": "Krystle L.", "review": "I always get their garlic noodle plates.  I like mine with grilled pork- it's cut real thin and very flavorful.  Also, portions are pretty big. \nI've been to both locations, SF and Sunset and they are both great and consistent.", "rating": 4, "date": "2015-01-09"}, {"excerpts": ["Five spice chicken with garlic noodle and imperial rolls is quite excellent. ", "I like that you can have a variety of food on one plate. ", "The garlic noodles are lightly buttered and pair well with the chicken and imperial rolls. ", "The chicken is well seasoned. ", "It's a pretty good price for a big portion of food. ", "I usually can't finish it all and take some to-go."], "author": "Josephine L.", "review": "Five spice chicken with garlic noodle and imperial rolls is quite excellent. I like that you can have a variety of food on one plate. The garlic noodles are lightly buttered and pair well with the chicken and imperial rolls. The chicken is well seasoned. It's a pretty good price for a big portion of food. I usually can't finish it all and take some to-go.", "rating": 3, "date": "2014-10-07"}, {"excerpts": ["However, certainly worth the trade-off to gain garlic noodle plates.\n\n"], "author": "Mike L.", "review": "If you've read my review of PPQ further down Irving, you would know I love the food there.  The only thing I could think of updating there would be a newer facility and adding garlic noodles on their menu.  Well guess what?  They did it at Perilla!\n\nOwned by the same people as PPQ (and Toasties for that matter), Perilla offers almost the exact same menu as their sister location and at essentially the same prices.  The types of pho are pretty much the same (BEEF SATAY PHO!!!), and they also have the usual vermecelli and rice plates as well; the only thing I could see missing were the entrees.  However, certainly worth the trade-off to gain garlic noodle plates.\n\nEssentially, just imagine a charbroiled meat rice plate (some with the same kick-ass imperial rolls) but take out the rice for noodles.  The best part though, is that the noodles aren't heavy on butter or oil,and they taste great!  It'd be one thing if it was offered just cause - in this case, it's actually good!\n\nThe servers are nice, friendly, and funny to boot.  We were there on Friday night for dinner at around 8:30, and was surprised to see that they actually close at 9:00 (kind of early, especially for the area).  However, stragglers were still coming in despite the posted hours, and the workers were happy to take them in (\"Come in, don't be scared!  These people seem to like their food!\").  And you know what?  The workers were right.", "rating": 5, "date": "2010-02-07"}, {"excerpts": ["I tried the vegetarian dishes and they vegetarian garlic noodle is good. ", "Vegetarian pho and the veg imperial rolls are ok - not bad but nothing to write home about. ", "The vegetarian filling for the rolls is the same as the vegetarian side coming with the veg garlic noodles - cabbage, mushrooms, some cello noodles and spices but wrapped in lettuce and rice wrap - it is good but tastier when they come with the garlic noodles, those have a good flavor and, as already said here, not as greasy as they are in other places, quite god...\n", "Service is very good, personnel is attentive and respectful."], "author": "VIORICA C.", "review": "I tried the vegetarian dishes and they vegetarian garlic noodle is good. Vegetarian pho and the veg imperial rolls are ok - not bad but nothing to write home about. The vegetarian filling for the rolls is the same as the vegetarian side coming with the veg garlic noodles - cabbage, mushrooms, some cello noodles and spices but wrapped in lettuce and rice wrap - it is good but tastier when they come with the garlic noodles, those have a good flavor and, as already said here, not as greasy as they are in other places, quite god...\nService is very good, personnel is attentive and respectful.", "rating": 3, "date": "2015-08-10"}, {"excerpts": ["I got the imperial roll, five spice chicken and garlic noodle plate combo ", "and it was bomb.  ", "The garlic noodles were buttery and garlickly without being over powering.  ", "Also, they had just the right chewyness to them.  ", "The five spice chicken is the best, my brother has tried the other meats, and pretty much says the chicken is the best.  ", "The skin of the chicken is crispy and flavorful and the chicken meat wasn't dry at all.  ", "The imperial rolls were pretty good, crunchy on the outside and packed full on the clear noodles on the inside, along with the usual filling.  ", "Overall, really yummy and quick friendly service.  "], "author": "Elizabeth C.", "review": "Garlic noodles are a must!\n\nI got the imperial roll, five spice chicken and garlic noodle plate combo and it was bomb.  The garlic noodles were buttery and garlickly without being over powering.  Also, they had just the right chewyness to them.  The five spice chicken is the best, my brother has tried the other meats, and pretty much says the chicken is the best.  The skin of the chicken is crispy and flavorful and the chicken meat wasn't dry at all.  The imperial rolls were pretty good, crunchy on the outside and packed full on the clear noodles on the inside, along with the usual filling.  Overall, really yummy and quick friendly service.  I would definitely go back, and the serving was plenty. \n\nThey have lunch specials as well.\n\nIf you are a fan of garlic noodles, I would definitely order a side of it to go for later consumption. hehe.", "rating": 4, "date": "2014-02-06"}, {"excerpts": ["I've also decided garlic noodle is really not my thing."], "author": "majia m.", "review": "I like the five-spice chicken, I haven't seen it else where so far.\nI've also decided garlic noodle is really not my thing.", "rating": 3, "date": "2015-06-15"}, {"excerpts": ["I'm sure I'll be back for my quick, garlic noodle fix in the future..."], "author": "S Y.", "review": "3-stars for the no fuss greetings (cause smiling is just a waste of our time), straight to the point order and eat your shrimp, beef and garlic noodles! The garlic noodles coulda used a bit more garlic, but the beef was very tender and the shrimp was seasoned well.\n\nThe 4th star goes to the reasonable prices ($25 for two meals, including tip) and fast service (lacking the greets, smiles & convo), but we were out in a little less than an hour so we didn't have to run out and pay the meter! I'm sure I'll be back for my quick, garlic noodle fix in the future...", "rating": 4, "date": "2011-09-09"}, {"excerpts": ["The garlic noodle with five spice chicken was delicious although I would have preferred a larger dose of garlic in my noodles. ", "But overall a great dining experience and good place for kids."], "author": "John R.", "review": "Good friendly service and food. The garlic noodle with five spice chicken was delicious although I would have preferred a larger dose of garlic in my noodles. But overall a great dining experience and good place for kids.", "rating": 4, "date": "2017-01-01"}, {"excerpts": ["So... I had the imperial roll with garlic noodle and beef. ", "Something that LA doesn't have, supposedly. ", "Noodle was okay and the beef was a bit too thick. ", "It felt like it took forever just to chew. ", "But props goes out to the imperial rolls. ", "It was pretty legit. ", "I want to give 4 stars, but beef (pretty well marinated though) was too chewy :/"], "author": "Wendy V.", "review": "So... I had the imperial roll with garlic noodle and beef. Something that LA doesn't have, supposedly. Noodle was okay and the beef was a bit too thick. It felt like it took forever just to chew. But props goes out to the imperial rolls. It was pretty legit. I want to give 4 stars, but beef (pretty well marinated though) was too chewy :/", "rating": 3, "date": "2014-01-01"}, {"excerpts": ["Sunday ~ 7:00pm\nOccasion: Hungry after a day visiting the museum  \nParty of:  1\nOrdered: Imperial Rolls and Charbroiled Pork Garlic Noodle ", "(Mi Toi Cha Gio Thit Nuong) ", "[see pic]\n", "Accessibility: ", "The place was w/c friendly.\n", "Total: "], "author": "Anh N.", "review": "Date/Time: Sunday ~ 7:00pm\nOccasion: Hungry after a day visiting the museum  \nParty of:  1\nOrdered: Imperial Rolls and Charbroiled Pork Garlic Noodle (Mi Toi Cha Gio Thit Nuong) [see pic]\nAccessibility: The place was w/c friendly.\nTotal: $12.31\n\nIf you like garlic noodles, than you must try this place. The garlic noodles was cooked to perfection; seasoned with the right about of butter & garlic. The charbroiled pork was seasoned well and had nice grilled marks.\n\nI will definitely come here again and try the other garlic noodles dishes.", "rating": 4, "date": "2012-06-06"}, {"excerpts": ["and it isn't as buttery as some garlic noodle places. \n\n"], "author": "Katrina T.", "review": "It might be a little bit exaggerated to give Perilla 5 stars, but just hear me out as I give my reasons why. \n\n1. Usually when you find restaurants serving garlic noodles, they are surprisngly overpriced. I do not understand why because garlic noodles are so simple to make! So going to Perilla was like discovering a hidden gem because their dishes are cheap and delicious! \n\n2. The 5 Spice Chicken and Garlic Noodles (#21) is a MUST for first timers! Their chicken seriously is bomb. It does have enough spice to it to add all the flavors needed to make this dish tasty. Their chicken also reminds me of King of Thai for those of you who have tried the Fried Rice with Fried Chicken. The noodles are pretty firm and just so good! It has just enough garlic in it and it isn't as buttery as some garlic noodle places. \n\n3. The portion size is incomparable to the price. $7.50 for tons of food?! I'm there! \n\n3 reasons are enough for you to just come here and check this place out. I love how it is Vietnamese as well. It isn't your typical Vietnamese place. I mean yeah they have pho and other noodle dishes, but just having their signature garlic noodles here, already makes this place stand out for me. \n\nI HAVE to come back here and show my parents andddd try their 5 Spice Chicken Pho.", "rating": 5, "date": "2012-10-21"}, {"excerpts": ["My favorite combination is the Five Spice Chicken with imperial rolls and garlic noodle. ", "It is a bit on the greasy and oily side but that's basically what most Asian dishes are like. ", "Its really good ", "but sometimes the noodle may be a little burnt which I get disappointed ", "The Beef with imperial roll and garlic noodle is delicious too. ", "It's my sister's favorite and I love it the beef is so juicy", ", it's not dry. ", "The imperial rolls are a great snack on the side. ", "They are crunchy and bite size so it compliments the dish perfectly. ", "It also comes with 2 pieces of broccoli ", "so you do have veggies on the plate and won't feel as guilty. "], "author": "Lisa S.", "review": "4 starts for the GARLIC NOODLES!!\n\nIt's basically what everyone comes here for. \n\nMy favorite combination is the Five Spice Chicken with imperial rolls and garlic noodle. It is a bit on the greasy and oily side but that's basically what most Asian dishes are like. Its really good but sometimes the noodle may be a little burnt which I get disappointed but so far it had only happened once. \n\nThe Beef with imperial roll and garlic noodle is delicious too. It's my sister's favorite and I love it the beef is so juicy, it's not dry. The imperial rolls are a great snack on the side. They are crunchy and bite size so it compliments the dish perfectly. It also comes with 2 pieces of broccoli so you do have veggies on the plate and won't feel as guilty. You will most definitely be a stuffed and happy camper after you are done with the meal. \n\nI've accidently ordered these combinations but with vermicelli noodles instead and I didn't like it at all. It comes with the really bitter leaves and I'm not a fan of that. Aside from that it's just that they do go as well with the combination as it does with the chewy, thick, and warm garlic egg noodles.  \n\nI always come back for more or bring new friends to try it. Sometimes we just crave it, it's kind of like crack for us. Before when I worked in sunset I would always go there and order take out because it's just right in the neighborhood even if I was like 15 blocks away. (No big Deal) But parking is horrible so I would recommend calling in if you plan to get take out.", "rating": 4, "date": "2013-07-10"}, {"excerpts": ["Their garlic noodle is my first choice for when I need to carb up before a race.  ", "I actually only live about 7 blocks away but during those cold windy SF nights I get delivery haha!  ", "So when I visited her in NY back in May, I got an order of their chicken + garlic noodle to go.  ", "I saran wrapped the heck out of the container.  ", "And put it in bags upon bags upon bags, then bravely put it in my luggage (Side note: NO LEAKS! ", "NO GARLIC SMELL IN MY CLOTHES! ", "WOOT WOOT!)  ", "7 hours later my best friend was happily enjoying her freshly delivered noodles from SF.  ", "I'm such a good friend "], "author": "Tammy N.", "review": "This is one of my go to places since I've moved to the Sunset area.  Really reliable food and good service.  The pho is a bit more expensive than usual but you can tell the meat is higher quality.  \n\nHonestly though, people don't come here for the pho- they're here for the garlic noodles!  I highly recommend the 5 Spice Chicken with Garlic Noodles.  It comes with fish sauce but I actually eat it without.  I think the dish is flavorful enough.  Chicken is always crispy and moist.  And the garlic noodles is a bed of buttery and garlic goodness that will force you to brush your teeth - twice!  Their garlic noodle is my first choice for when I need to carb up before a race.  I actually only live about 7 blocks away but during those cold windy SF nights I get delivery haha!  Delivery usually takes about an hour and the food still maintains its quality.  \n\nSpeaking of which, my friend from NY came to visit me and fell in love with their garlic noodles.  So when I visited her in NY back in May, I got an order of their chicken + garlic noodle to go.  I saran wrapped the heck out of the container.  And put it in bags upon bags upon bags, then bravely put it in my luggage (Side note: NO LEAKS! NO GARLIC SMELL IN MY CLOTHES! WOOT WOOT!)  7 hours later my best friend was happily enjoying her freshly delivered noodles from SF.  I'm such a good friend :)\n\nRandom fact: Same owner as PPQ Dungeness Island in the Richmond and Thanh Long in Outer Sunset.  \n\nBTW PARKING SUCKS bc of all the San Tung people!", "rating": 5, "date": "2014-10-15"}, {"excerpts": ["I love the garlic noodle! ", "Actually thats the only think I every tried from this place. ", "Prices are very reasonable compared to other places with  that serves garlic at this quality. ", "Portions are also fair. "], "author": "Tiffany C.", "review": "I love the garlic noodle! Actually thats the only think I every tried from this place. Prices are very reasonable compared to other places with  that serves garlic at this quality. Portions are also fair. I usually eat about 3/4 of just the noodle in 1 sitting and the rest I save for a snack or lunch the next day. \n\nThis place keeps me coming back for more!", "rating": 5, "date": "2012-02-08"}, {"excerpts": ["We all ordered different types of garlic noodle. ", "I ordered the beef garlic noodle. ", "One person ordered a Thai Tea, and soon, a few of us followed after and ", "it seemed that our waiter was annoyed. "], "author": "Sylvia b.", "review": "My first time here, and my experience was alright. If you need to use the restroom, it's way in the back, through their kitchen.\n\nI was with a bunch of people that day, and there were only a few customers. We all ordered different types of garlic noodle. I ordered the beef garlic noodle. One person ordered a Thai Tea, and soon, a few of us followed after and it seemed that our waiter was annoyed. We got our drinks, and one, who had came late, ordered one as well, and that's when she gave us an attitude asking if any one else wants one and angrily walks away.\n\nOur food finally arrives, and it looked interesting; think of alfredo pasta. The beef was definitely good and flavorful. The same goes to the garlic noodles. It also came with a, I wouldn't say fish sauce, but a sauce to dip your food in. The Thai tea was actually pretty sweet. Not sure whether they used condensed milk, or just regular half and half.\n\nOverall, I'd definitely go back and recommend it to others.", "rating": 3, "date": "2012-03-07"}, {"excerpts": ["I've had Perilla bookmarked ever since my sister mentioned the 5 Spice Chicken and garlic noodle plates.\n\n"], "author": "Stephanie L.", "review": "I've had Perilla bookmarked ever since my sister mentioned the 5 Spice Chicken and garlic noodle plates.\n\nMy boyfriend and I came here on a rainy Tuesday night around 5:30PM. Parking is extremeley hard to find so it took us a while before we were able to get to the restaurant. It's a good thing we came at the time we did because the tables began filling up after we were seated. \n\nI ordered the 5 Spice Chicken with imperial rolls and garlic noodles. My boyfriend had the Charbroiled Beef with the same accompaniments. We also had a Thai Iced Tea that was pretty good. Everything came out to be under $25. \n\nOverall, the food was really good. The garlic noodles here are better than PPQ's because you can't see or taste much of the oil, although you can definitely feel it after dinner. I'd highly recommend you try this place!", "rating": 4, "date": "2010-12-29"}, {"excerpts": ["I'v had the garlic noodle from Perilla and honestly that is the only dish in the menu that I recommend.  ", "The pho and all other Vietnamese dishes are tasteless.  \n", "The staff is really friendly and I'm sad that the food is just subpar."], "author": "Shirley T.", "review": "I'v had the garlic noodle from Perilla and honestly that is the only dish in the menu that I recommend.  The pho and all other Vietnamese dishes are tasteless.  \nThe staff is really friendly and I'm sad that the food is just subpar.", "rating": 2, "date": "2013-11-05"}, {"excerpts": ["#30 Imperial rolls & shrimp garlic noodles   $12.25\n#51 Imperial rolls & five spice chicken rice plate  $9.75\n#59 Seasoned veggie garlic noodle  $9.75\n#9  "], "author": "Mayana P.", "review": "Go here. Nice people. Good food. Free local delivery if $20+ if after 5pm. This location opens daily 11am-9pm\n\nParking kind of sucked but for the price and what you get, this place is SO worth it. For about $10, depending on what you get, you get huge portions that can feed a SUPER hungry person or two people with a medium to appetite. I wish they were a little closer (SF is a trek for me and this is deep in SF with no shortcuts to get to and fro) because I really like their food. They're also SO NICE! On the phone and in person, they're so caring and hospitable. I usually tip anyway when I pick up food but I WANTED to tip a little extra than what I usually do. My picky SO enjoyed the veggie garlic noodles. I really appreciate that with their plates, they give broccoli on the side. I love broccoli and it's not overcooked. They even season it a little bit with something, I think or perhaps it's the aromas and condensation permeating into the green flesh, soaking up the garlic goodness. This is what I ordered (Yes, I went a lil over board but I have food for days!) :\n\n#30 Imperial rolls & shrimp garlic noodles   $12.25\n#51 Imperial rolls & five spice chicken rice plate  $9.75\n#59 Seasoned veggie garlic noodle  $9.75\n#9  Curry chicken vermicelli (spicy coconut milk curry broth noodle soup) $8.99\nTogo bag $0.10\n\nEverything was $45 with tax. Like I said, good portions. I adore and salivate for imperial rolls like these that use rice paper instead of the flour but only if it's done right and they do it right. The pork and veggie inside the rolls are delicious and the dipping sauce, which is good too but to me, not needed. I just pop them into my mouth and it's gone. lol #30 and #51 each had 6 pieces of the deep fried rolls with a healthy (\"healthy\" how are butter infused noodles \"healthy\"? lol I don't care! Gimme!) amount of delicious garlic noodles. Oh and some broccoli. Who says I'm not healthy? ;) \n\n#59 was pretty good but if I had meat options at a place like this, I'm ordering the meat. It's good though and I also liked the Curry chicken soup which had a good spicy kick to it but not overpowering for baby spice buds like my tongue that can't handle much. The food tastes even better and more flavorful the following days as leftovers. Everything really infuses into each morsel. Next time, I'd order #27 Imperial rolls & Five spice chicken garlic noodles $10.75\n\nOnly thing is, I wish they offered and had brown rice but that can be because of limited space in kitchen or something. Well, if someone knows the manager/owner of Perilla and can suggest this and make this happen, you can be my friend lol, I'd totally pay extra for this healthier (low sugar spike and more fiber BUT it does have more arsenic...meh give me brown rice please! nom nom I don't care... yum in my tum lol)\n\nI also like the feel of this location better than the one in the financial district. It's more low key here, more room and not packed, loud and crazy hectic like it is at the other location.", "rating": 5, "date": "2015-07-08"}, {"excerpts": ["My go-to pho tai and garlic noodle spot.  ", "winner winner ", "i got pho dinner."], "author": "Alicia T.", "review": "It's pretty guuuuuuuuud.  My go-to pho tai and garlic noodle spot.  winner winner i got pho dinner.", "rating": 5, "date": "2015-05-19"}, {"excerpts": ["I've tried both their five-spice chicken garlic noodle and rare-beef and brisket pho now on two separate occasions. "], "author": "Patricia K.", "review": "Hmmmm.... 2-3 stars? \n\nI've tried both their five-spice chicken garlic noodle and rare-beef and brisket pho now on two separate occasions. I've noticed that the service has improved since I last visited but the food was just mediocre.\n\nThe garlic noodles are delicious but really greasy. I definitely think they have the best five-spice chicken so I'll grant them that. I'll probably come back mainly for this dish. \n\nPho? Broth- bland. Beef- not tender. Pho alone rating = 2 stars. They do give you a LOT of noodles so if you're super hungry and you rather have quantity over quality, order the pho.", "rating": 3, "date": "2012-11-03"}, {"excerpts": ["i love the porkchop garlic noodle combo with the imperial noodles! ", "caps all on this review because its so good"], "author": "Barry E.", "review": "i love the porkchop garlic noodle combo with the imperial noodles! caps all on this review because its so good", "rating": 5, "date": "2015-10-19"}, {"excerpts": ["I order two dinner entree: five spiced kitchen and charbroiled pork, both with garlic noodle.  \n\n", "The garlic noodle on the other hand is ", "so/so.  ", "It reminds me of what my good friend made at his dinner party which is ediable, but just lacks the butter and rich garlic flavor.  "], "author": "Tiffany C.", "review": "Decent meal.  Walked in at 9:05pm and thought they were closest.  Since there were still two people eating in the restaurant the staff was nice enough to let us order to go.  I order two dinner entree: five spiced kitchen and charbroiled pork, both with garlic noodle.  \n\nI personally though the meat was nice marinated and flavorful.  I could also tell it's been marinating for a good amount of time and use high heat to cook it.  The garlic noodle on the other hand is so/so.  It reminds me of what my good friend made at his dinner party which is ediable, but just lacks the butter and rich garlic flavor.  The con is the flavor but the pros is I live longer because I'm less likely to get a heart attack.\n\nOverall 4 stars is honest and fair and if you're in the area and need a quick fix this place is definitely worth a try", "rating": 4, "date": "2013-12-10"}, {"excerpts": ["Tasted pretty much like instant garlic noodle, if that existed.  ", "The noodles were spaghetti noodles with garlic and parsley. ", "I could've made it much better at home.  ", "To top it off, our waiter seemed like he didn't want to serve us.  ", "He would go to every table to see if things were okay, execpt ours.  "], "author": "Cedric F.", "review": "This place is the same owners as PPQ Dungeness Island and Toasties.  If you're looking for good garlic noodles, look somewhere else.\n\nI walked in here on a fluke because San Tung was too crowded.  There were signs saying they served garlic noodles and I assumed that is what they specialized in, so I ordered the charbroiled pork chop with garlic noodles.  The pork chop was just okay.  A little crispier than most vietnamese places.  The garlic noodles were horrible.  Tasted pretty much like instant garlic noodle, if that existed.  The noodles were spaghetti noodles with garlic and parsley. I could've made it much better at home.  To top it off, our waiter seemed like he didn't want to serve us.  He would go to every table to see if things were okay, execpt ours.  That guy even had the decency to give us change back after we paid the bill. \n\nWill not come here again!!!!", "rating": 2, "date": "2010-09-26"}, {"excerpts": ["Definitely coming here to get my garlic noodle fix."], "author": "Jenna H.", "review": "GARLIC. INFUSED. NOODLES. GET ITTTT.\n\nAnything with a combination of their garlic noodles is AMAZING. I've tried the Five spice chicken, the beef, and the prawns and they've all been great. I've had plenty of garlic noodles thus far, and none have even come in comparison with Perilla's. It's always a good sign to walk into this place and see that a majority of the patrons have a hot plate of noodles on top. I have seen some with pho bowls, which I doubt I'll ever try here because I just CANNOT come here and imagine ordering anything but their garlic noodles.\n\nFood:\n- Five spice chicken: Juicy and not dry. They also leave the skin on so it's nice a crispy when it comes to your table.\n- Beef: juicy and tender. Not overcooked. No complaints.\n- Prawns: Hit or miss. Taste wise is always a hit. However, sometimes the size of the shrimp can be a bit small, and considering you are paying more for seafood, you'd think they'd either offer bigger prawns or more in quantity. \n\nPortions are fair along with reasonable prices. \n\nService: Always friendly with a smile. Nothing to complain about. They are always helpful and quite attentive with refilling water glasses. (Then again I always find myself coming at times when it isn't too crowded.) \n\nParking is a bitch. It is Irving after all, so what else would you expect. Expect to walk at least a couple blocks if you aren't lucky with parking or find yourself coming during lunch/dinner time.\n\nDefinitely coming here to get my garlic noodle fix.", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["So i ordered the five spiced chicken with garlic noodle and imperial rolls, while my friend got the same garlic noodle with imperial rolls but with pork. ", "Ahh, both chicken and pork was delish! ", "I probably can't decide which is better coz ", "they're both so very good! ", "The garlic noodle, which i have loved for many years now from eating it at PPQ, was good and not too greasy. ", "The imperial rolls were bomb. ", "They were so crunchy on the outside and ", "even though i hate mushrooms, i ate those rolls lk ", "i was born eating mushrooms. ", "Just when i thought yummy yummy was my first go-to option for viet food, i found this and fell in love instead."], "author": "Verdina P.", "review": "Oh my god, it's good. Though it was my first time, i immediately fell in love after my first bite.... \n\nSo i ordered the five spiced chicken with garlic noodle and imperial rolls, while my friend got the same garlic noodle with imperial rolls but with pork. Ahh, both chicken and pork was delish! I probably can't decide which is better coz they're both so very good! The garlic noodle, which i have loved for many years now from eating it at PPQ, was good and not too greasy. The imperial rolls were bomb. They were so crunchy on the outside and even though i hate mushrooms, i ate those rolls lk i was born eating mushrooms. Just when i thought yummy yummy was my first go-to option for viet food, i found this and fell in love instead.", "rating": 5, "date": "2012-08-29"}, {"excerpts": ["No need to try the rice or noodle soup because the garlic noodle is where it's at. \n\n", "Just expect delicious garlic noodle goodness."], "author": "Lily S.", "review": "Yummy garlic noodles. \nThe five spice chicken is the best! \n\nNo need to try the rice or noodle soup because the garlic noodle is where it's at. \n\nThis is not authentic Vietnamese food though, so don't go expecting that. Just expect delicious garlic noodle goodness.", "rating": 4, "date": "2012-03-19"}, {"excerpts": ["My bf LOVES the garlic noodle here. ", "He seriously doesn't eat it anywhere else. ", "My fave would be the five spice chicken with the garlic noodles. ", "it is pretty bomb. ", "the amount of garlic isn't too heavy ", "BUT carry some mints... might scare away some people after your delish meal. ", "what's good about the five spice chicken is that it could be with really anything - with your pho, garlic noodles, rice, etc. ", "all hail FIVE SPICE CHICKEN!!! ", "and their garlic noodle ", ":)"], "author": "Kristina L.", "review": "My bf LOVES the garlic noodle here. He seriously doesn't eat it anywhere else. My fave would be the five spice chicken with the garlic noodles. it is pretty bomb. the amount of garlic isn't too heavy BUT carry some mints... might scare away some people after your delish meal. what's good about the five spice chicken is that it could be with really anything - with your pho, garlic noodles, rice, etc. all hail FIVE SPICE CHICKEN!!! and their garlic noodle :)", "rating": 5, "date": "2014-04-03"}, {"excerpts": ["Five spice chicken + Imperial Rolls + Pork Garlic Noodle.\n\n", "Pork garlic noodle that are not overly greasy.\n\n"], "author": "Tina T.", "review": "Five spice chicken + Imperial Rolls + Pork Garlic Noodle.\n\nFor $8.95, you get a decent portion. Everything in this dish is really good! Five spice chicken perfectly marinated. Imperial roll freshly fried with a thin layer of crispy skin. Pork garlic noodle that are not overly greasy.\n\nWe also got the Satay Beef Pho ($7.25). Satay is usually really greasy so the soup was a bit hard to drink but the pho and beef were good.\n\nStaff was also very friendly and there's one guy who's surprisingly very enthusiastic about the food. Will definitely be back!", "rating": 4, "date": "2010-03-15"}, {"excerpts": ["I can now fulfill my garlic noodle cravings ", "RIGHT downtown. ", "yay"], "author": "Jocelyn L.", "review": "Affiliated with PPQ Dungeness Crab, which is my weakness. OK, Garlic Noodles are my weakness. I've written like 10 reviews on PPQ (or 3. whatever)\n\nWe ordered take-out for a work lunch and the portions were humongous and very tasty. I can now fulfill my garlic noodle cravings RIGHT downtown. yay", "rating": 4, "date": "2012-04-16"}, {"excerpts": ["Surprisingly, they still have the garlic noodle that PPQ is known for at their Clement St. location. ", "We ended up getting this enormous portion with garlic noodles, grilled pork and the imperial rolls for about $9 bucks a plate. ", "You would think that's a lot but the noodles are a heaping load and they give you not one but TWO of the rolls. "], "author": "Petra S.", "review": "Since we now live in the sunset district, we decided to explore our food options in our new neighborhood.\n\nAnd being such a HUGE fan of the PPQ dungeonous island's garlic noodles, I just had try their latest restaurant, an infusion between PPQ and Toasties. Surprisingly, they still have the garlic noodle that PPQ is known for at their Clement St. location. We ended up getting this enormous portion with garlic noodles, grilled pork and the imperial rolls for about $9 bucks a plate. You would think that's a lot but the noodles are a heaping load and they give you not one but TWO of the rolls. We were too full to finish it all. \n\nThe staff here is pretty nice and attentive, regularly refilling our teas. We were even offered free Viet coffee or Thai iced tea because it was still grand opening.\n\nI saw some mixed reviews on here at first but what you guys needs to realize is that they are NOT known for their pho (which is exactly what the people who rated them lower got) but rather their garlic noodles, rice plates and imperial rolls (though the rolls here differ in taste slightly from the actual PPQ locations, which in my opinion taste much better.)\n\nI highly recommend this place to anyone on a budget who wants  a delicious mixed plate, large enough to split. \n\nBONUS: These guys deliver!\n\nAs the terminator put it...\"I'll be bach!\"", "rating": 5, "date": "2009-12-06"}, {"excerpts": ["If you're looking for pho, I'd recommend just walking a couple blocks down the street to Yummy Yummy, but the garlic noodle dishes here are pretty good. ", "I mean, not Thanh Long good, but worth its price!"], "author": "Stephanie G.", "review": "I've come here a few times and I'm never disappointed. I recommend ordering the garlic noodles with either five spice chicken or charbroiled pork. If you're looking for pho, I'd recommend just walking a couple blocks down the street to Yummy Yummy, but the garlic noodle dishes here are pretty good. I mean, not Thanh Long good, but worth its price!", "rating": 4, "date": "2014-01-29"}, {"excerpts": ["We ordered the imperial and grilled beef rice, garlic noodle, and pork roll.\n", "The rice plate was mostly rice, the beef tasted like dish soup ( which me feel nauseous after eating ) there was nothing special about the imperial roll. ", "The garlic noodle justed tasted like  mushy bland noodles (not worth it). ", "The pork rolls were mostly hard inedible noodles. ", "ive eaten here twice before, and both times it was just ok. ", "I really wanted to like this place, but after this experience im definitely never coming back."], "author": "R S.", "review": "really bad all around...Ordered in and when the delivery guy got here he called i told i would buzz him up but he refused and told me to come down. i told i was unable to and asked again for him to come up, but instead he then hung up on me. When he finally did come up, he unhappily gave me the food and left. Once i opened the bag i realized they got one of my orders wrong, in which eat24 quickly and painlessly resolved. The food itself was pretty bad. We ordered the imperial and grilled beef rice, garlic noodle, and pork roll.\nThe rice plate was mostly rice, the beef tasted like dish soup ( which me feel nauseous after eating ) there was nothing special about the imperial roll. The garlic noodle justed tasted like  mushy bland noodles (not worth it). The pork rolls were mostly hard inedible noodles. ive eaten here twice before, and both times it was just ok. I really wanted to like this place, but after this experience im definitely never coming back.", "rating": 1, "date": "2015-12-22"}, {"excerpts": ["The garlic noodle was just ok.  ", "I didn't taste the garlic.  ", "Each mouthful I was looking for some garlic and nada.  ", "Did the price of garlic go up and nobody tell me?  ", "Can't help but wonder if there was more of a garlic taste would  "], "author": "Cris H.", "review": "Was in the neighborhood and I was wandering around looking for a place to get my belly fed.  Noticed the Perilla sign and remembered this was one of the places I bookmarked awhile back for the garlic noodles. \n\nSo off I went and sat myself down at a table.  I was starving and it was rainy and cold.  Was thinking about getting some pho to warm up but decided to stick with my gut and follow all my fellow yelpers in ordering the garlic noodles with the 5 spice chicken.  \n\nThe 5 spice chicken was good.  Crispy skin, juicy and flavorful but I was not liking the pool of oil my chicken was sitting in.  Seriously it was a pool of oil. Be ready to move your chicken around on the plate like I did.\n\nThe garlic noodle was just ok.  I didn't taste the garlic.  Each mouthful I was looking for some garlic and nada.  Did the price of garlic go up and nobody tell me?  Can't help but wonder if there was more of a garlic taste would  they had a gotten another star out of me.  \n\nHmm....all I can say is that I would come back only if I was in the area but I wouldn't make a special trip.", "rating": 3, "date": "2012-01-22"}, {"excerpts": ["I do want to come back and try one of their\n garlic noodle dishes though."], "author": "Helen L.", "review": "I believe I got the pork rice plate here. I found the portions to be small and the food was forgettable. I do want to come back and try one of their\n garlic noodle dishes though.", "rating": 2, "date": "2012-01-07"}, {"excerpts": ["I've only had their garlic noodle dishes. ", "I sometimes get the charbroiled pork with garlic noodles and sometimes with the imperial rolls. ", "Yum. ", "Their side dishes for the garlic noodle is a reasonable amount for around $3-4. ", "I haven't tried their pho, but I heard it was just okay."], "author": "Mandy D.", "review": "I've only had their garlic noodle dishes. I sometimes get the charbroiled pork with garlic noodles and sometimes with the imperial rolls. Yum. I recommend the garlic noodles!\n\nTheir side dishes for the garlic noodle is a reasonable amount for around $3-4. I haven't tried their pho, but I heard it was just okay.", "rating": 4, "date": "2010-06-07"}, {"excerpts": ["garlic noodle eggroll shrimp "], "author": "Angela L.", "review": "FOOD:\n1.) garlic noodle eggroll shrimp = yummie\n\n\n\nSERVICE:\ngood they refilled waters regularly\n\n\nATMOSPHERE:\nNot too big, casual but nice.", "rating": 4, "date": "2012-09-18"}, {"excerpts": ["I got their signature five spice chicken with garlic noodle. "], "author": "Erica L.", "review": "Mmm, bf wanted to try a new place. Went on yelp and found this.\n\nI got their signature five spice chicken with garlic noodle. and my bf got some chicken curry. \n\nI did not like the curry, the chicken was very dry.\n\nMy dish was okay. TOO GREASY. did not like the garlic noodles because it just tasted like butter, no garlic. the chicken was good, but I felt like i neede some rice because it well seasoned.", "rating": 3, "date": "2011-09-27"}, {"excerpts": ["Love the five spice chicken and garlic noodle, perfect hangover food! ", "The fish sauce goes great on almost anything, the only reason it's not five stars is because it's been exceptionally greasy a couple times I've ordered it."], "author": "Dane E.", "review": "Love the five spice chicken and garlic noodle, perfect hangover food! The fish sauce goes great on almost anything, the only reason it's not five stars is because it's been exceptionally greasy a couple times I've ordered it.", "rating": 4, "date": "2014-10-18"}, {"excerpts": ["I have been here for lunch to try their Imperial Rolls + Five Spice Chicken with their famous Garlic Noodle. ", "The egg rolls were okay, a little bit on the burnt side. ", "I enjoyed the chicken a lot which was flavorful and not dry. ", "The garlic noodles on the other hand were a bit on the drier side. ", "I couldn't really finish all of it in the end. ", "The garlic was great and definitely a great flavor but I needed a whole pitcher of water afterwards."], "author": "Tracy Joy K.", "review": "This place really is just A-OK. I have been here for lunch to try their Imperial Rolls + Five Spice Chicken with their famous Garlic Noodle. The egg rolls were okay, a little bit on the burnt side. I enjoyed the chicken a lot which was flavorful and not dry. The garlic noodles on the other hand were a bit on the drier side. I couldn't really finish all of it in the end. The garlic was great and definitely a great flavor but I needed a whole pitcher of water afterwards.", "rating": 3, "date": "2014-03-09"}, {"excerpts": ["Ordered a pho and garlic noodle and imperial roll combo. ", "Portions are good and not overpowering. ", "I shared this with a friend, and we left as two very satisfied happy campers."], "author": "Jenny M.", "review": "Two words. GARLIC NOODLE. Yum!\n\nI usually go to Thanh Long for garlic noodles, but this place is pretty darn good too! Ordered a pho and garlic noodle and imperial roll combo. Portions are good and not overpowering. I shared this with a friend, and we left as two very satisfied happy campers.", "rating": 4, "date": "2012-03-21"}, {"excerpts": ["First time here, didn't really know what to order, asked the waiter who suggested te charbroiled beef with garlic noodle. ", "The dish is of the chart! ", "Highly recommend this place."], "author": "Zade T.", "review": "This place is really good. The service is even better. First time here, didn't really know what to order, asked the waiter who suggested te charbroiled beef with garlic noodle. The dish is of the chart! Highly recommend this place.", "rating": 5, "date": "2014-07-12"}, {"excerpts": ["Garlic noodles are pretty good here even though its probably not that hard to make at home but this is a good spot to come for a quick garlic noodle fix. ", "Price isn't too bad either for a dish."], "author": "Kevin E.", "review": "Garlic noodles are pretty good here even though its probably not that hard to make at home but this is a good spot to come for a quick garlic noodle fix. Price isn't too bad either for a dish.", "rating": 4, "date": "2013-03-16"}, {"excerpts": ["It tasted pretty decent if you wanted your garlic noodle fix.\n\n"], "author": "Jboogie L.", "review": "I was surprised to find the pho #5 to be pretty decent here (it came with rare beef and meat balls). The garnishes were not too fresh but otherwise still good. The portion was large for one size at $6.95/bowl.\n\nThe garlic noodles, grilled shrimp and imperial roll dish was $11.95. It tasted pretty decent if you wanted your garlic noodle fix.\n\nService a bit slow and the servers speak Chinese/Cantonese so that's a plus! \n\nStreet parking or metered parking.", "rating": 3, "date": "2011-09-04"}, {"excerpts": ["There are a variety of garlic noodle dishes that come with your choice of meat; either chicken, shrimp, beef or pork. "], "author": "Nancy L.", "review": "I LOVE the Charbroiled Pork Garlic Noodles dish here. There are a variety of garlic noodle dishes that come with your choice of meat; either chicken, shrimp, beef or pork. I highly recommend the noodles, regardless of which type of meat you choose.\n\nThe pho.. not so much. Although the soup base was good, I didn't like the beef slices in the pho, it was too chewy and thin for my liking. \n\nThere are some vegetarian dishes served here as well (pho, garlic noodles, papaya salad). \n\nThe thai iced tea was okay, nothing too special.", "rating": 5, "date": "2011-02-04"}, {"excerpts": ["a different garlic noodle dish beef, chicken, pork, and shrimp. ", "The garlic noodles were cooked fresh with garlic and butter. "], "author": "Robert Y.", "review": "4.25\nThis local and small business gets a lot of customers so it gets really busy. However they do their best to keep everyone happy. \n\nOur party of four got the each got a different garlic noodle dish beef, chicken, pork, and shrimp. The garlic noodles were cooked fresh with garlic and butter. It was one of the better garlic noodles Ive eaten and the price was also very fair ranging form $7-$10 each plate. \n\nWe also got the raw beef appetizer which was alright although Ive had better when the beef was laid flat to soak the lemon sauce. The beef here was served with onions and lemon sauce but crumbled up like a piece of paper with reduced surface area. \n\nThey also serve pho and rice dishes but their claim to fame is their garlic noodles. Overall good small business place to eat. I would recommend this place to others and wouldnt mind coming again.", "rating": 4, "date": "2011-08-13"}, {"excerpts": ["The Garlic Noodle is the hype of this place.  ", "Honestly now, it's not that great.  ", "It's just simply garlic + butter + noodles.  ", "I mean it's decent, but it's not over-the-top great... "], "author": "Tina L.", "review": "The Garlic Noodle is the hype of this place.  Honestly now, it's not that great.  It's just simply garlic + butter + noodles.  I mean it's decent, but it's not over-the-top great... Haha.\n\nAnyway, I came here one night with the ladies after a long day of scouring around town, and we finally decided to pick vietnamese as a cuisine to eat for the night.  Looking on our Yelp app on our phones, my friend found this place, with decent reviews, so we decided to give it a go.\n\nI ordered the Five Spice Chicken w/ Garlic Noodles w/ Imperial Rolls.  Everything was yummy.\n\nWhat I thought was weird was on the way to the bathroom, there were workers cutting meet in front of the bathroom.  haha.\n\nAs usual, parking on Irving street is horrific, but we managed to find a good parking spot close by.  We sat down, ate and just chilled.\n\nI had came here another day for lunch, it was bay to breakers day and there was this crazy girl parading outside the bar next door chasing pedestrians on the street.  Haha.  Funny.", "rating": 4, "date": "2011-06-15"}, {"excerpts": ["We then ordered 2 orders of imperial rolls (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=iWz-T5a2bmd2ferjrGJL2w) and five spice chicken garlic noodle and 1 order of charbroiled pork rice plate (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=jyWQX5GrkY16ZcNdNvyLzg). ", "The imperial rolls and five spice chicken garlic noodle were definitely a hit! ", "The imperial rolls were extra crispy and filled with tons of ground pork and veggies. ", "The five spice chicken was crispy outside, but juicy inside--it was sooo good! ", "The garlic noodles were just A-OK for me...", "I guess I was expecting the noodles to be more garlicky, but the garlic flavor ended up being very subtle. ", "Overall,  I think I was more excited for the five spice chicken than the garlic noodles. ", "Sigh..."], "author": "Lien T.", "review": "I was in town this past Tuesday, running some errands with a good friend, when we decided to try some of San Francisco's popular garlic noodles. With his luck, our first choice wasn't open until 5pm and our second choice wasn't open at all! We settled for third and ended up at Perilla!\n\nOur first impressions were that the restaurant was small and very clean. We were seated immediately upon arrival as there were no other customers. We started off with the papaya salad with charbroiled beef (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=zw0FDaMoxoSw2gnDUJVf4g). Man, the portion was huge! It came with freshly julienned papaya, basil, carrots, peanuts, dried shallots, and a ton of charbroiled beef. The flavors of the charbroiled beef and veggies complemented with the fish sauce DELICIOUSLY. Next time, I'd probably prefer the papaya salad with poached shrimp instead...the beef was a little too heavy as a starter for me. We then ordered 2 orders of imperial rolls (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=iWz-T5a2bmd2ferjrGJL2w) and five spice chicken garlic noodle and 1 order of charbroiled pork rice plate (http://www.yelp.com/biz_photos/RNy3_hU1N2qyS5PVc9RaYQ?select=jyWQX5GrkY16ZcNdNvyLzg). The imperial rolls and five spice chicken garlic noodle were definitely a hit! The imperial rolls were extra crispy and filled with tons of ground pork and veggies. The five spice chicken was crispy outside, but juicy inside--it was sooo good! The garlic noodles were just A-OK for me...I guess I was expecting the noodles to be more garlicky, but the garlic flavor ended up being very subtle. Overall,  I think I was more excited for the five spice chicken than the garlic noodles. Sigh...oh well, I'm still a fan though!\n\nAnd oh, the service was great--quick and friendly.\nStreet parking was such a drag.", "rating": 4, "date": "2010-05-01"}, {"excerpts": ["Heck, I wouldn't have even thought it to be a Vietnamese pho/garlic noodle joint if I wasn't introduced to it after my obsessive run for garlic noodle places, which coincidently included PPQ Dungeness Island (sister restaurant). \n\n"], "author": "Liana L.", "review": "perilla n.\n1. An annual Asian plant (Perilla frutescens) having opposite leaves, a bell-shaped calyx, and flowers with a short, white, tubular corolla. (thefreedictionary.com)\n\nUh... Asian? Really? Don't let the name fool you - this place is not a fancy, hoity-toity restaurant. Heck, I wouldn't have even thought it to be a Vietnamese pho/garlic noodle joint if I wasn't introduced to it after my obsessive run for garlic noodle places, which coincidently included PPQ Dungeness Island (sister restaurant). \n\nAll you need to know/try at this place are:\n-garlic noodles\n-imperial rolls\n-your choice of meat \n\nFive spice chicken is definitely their most popular, but I also love the charboiled pork because my burps smell less horrible after eating it. Sometimes the garlic noodles could use a little more garlic but it's delicious either way.\n\nAlthough I think their pho is decent and comes with a hefty portion of noodles, the soup flavor is a little lacking.\n\nFor the price point ($7-12) and location, I love coming back for a casual lunch or dinner.", "rating": 4, "date": "2012-04-09"}, {"excerpts": ["For a mere $8.95 you get perfectly seasoned Five Spices Chicken, delectable crispy Imperial Rolls and buttery Garlic Noodle good-ness!  ", "Also, I LOVE their Thai Iced Teas here!  ", "It was a perfect balance between tea and sweets - so good "], "author": "Chris Y.", "review": "Do I miss Toasties?  YES!\n\nWas replacing it with Perilla a bad idea?  NO!\n\nFor a mere $8.95 you get perfectly seasoned Five Spices Chicken, delectable crispy Imperial Rolls and buttery Garlic Noodle good-ness!  Also, I LOVE their Thai Iced Teas here!  It was a perfect balance between tea and sweets - so good I even took one home to go lol.\n\nMy GF ordered their #5 which was something with beef balls and Pho.  It's okay.  Don't come here for that but their famed garlic noodles.\n\n==========\n\n-.5 Star for not being able to kiss the GF after because of my garlic breath\n\n*4.5 Stars out of 5*", "rating": 4, "date": "2010-04-12"}, {"excerpts": ["I usually get the garlic noodle + 5-spice chicken plate because the chicken is always juicy and the skin is crispy. ", "I reheat the leftovers the next day and the food is just as mouthwatering as it was at first bite! ", "(My mom would even pack food from here for me to have while I was away at college..and Perilla made studying for midterms and finals a lot less painful.) ", "I have noticed that their prices may vary a bit depending on what location you go to (maybe because of differing rent costs?) ", "but no matter which branch you visit, Perilla is still quite affordable."], "author": "Caralisa L.", "review": "This is where I go for garlic noodles without breaking the bank (for fans of the well-known PPQ, Perilla is owned by the same people). While the garlic noodles may be too plain for some, for me the subtlety of butter and an abundance of minced garlic, works...more than works, actually. I usually get the garlic noodle + 5-spice chicken plate because the chicken is always juicy and the skin is crispy. I reheat the leftovers the next day and the food is just as mouthwatering as it was at first bite! (My mom would even pack food from here for me to have while I was away at college..and Perilla made studying for midterms and finals a lot less painful.) I have noticed that their prices may vary a bit depending on what location you go to (maybe because of differing rent costs?) but no matter which branch you visit, Perilla is still quite affordable.", "rating": 4, "date": "2012-05-02"}, {"excerpts": ["The garlic noodle set is totally worth it...for its price.\n\n"], "author": "Tiffany L.", "review": "This place is a deal!\n\nThe garlic noodle set is totally worth it...for its price.\n\nHonestly, the garlic noodles here aren't all that great. They're kind of dry and lack...something.\n\nBut hey, for it's price, it's totally worth it!", "rating": 4, "date": "2011-06-22"}, {"excerpts": ["After eating here recently, I have a hunch that the much-reviewed Imperial Rolls and Five Spice Chicken Garlic Noodle would become one of my go-to meals.  \n\n"], "author": "Andrew M.", "review": "As much as I enjoy trying new restaurants with quality food, I love the security of having fallback dishes at familiar restaurants in my back pocket for hectic days.  After eating here recently, I have a hunch that the much-reviewed Imperial Rolls and Five Spice Chicken Garlic Noodle would become one of my go-to meals.  \n\nThe highlights of the dish included the crispy chicken skin that did not slide off the juicy meat and garlic-infused noodles with pockets of pan-fried crisp.\n\nThe servers were cooperative with our efforts of seating a large party together, and readily provided refills of their cucumber-flavored water.\n\nThe price of 8.95 for the dish did not make it a steal, but the amount of food left me pleasantly full.", "rating": 4, "date": "2011-01-24"}, {"excerpts": ["Other than this place, the only good vietnamese garlic noodle spot around here is thanh long...and let me tell ya, your entire bill at perilla probably wouldn't be enough to cover tip at thanh long", "..haha. ", "(its a totally different dining experience though. "], "author": "Linh P.", "review": "number 27 please! =)\n\nGarlic noodles, five spice chicken, and egg rolls all for like, $9! I always get the same thing here. I actually think thats why everyone goes here. haha. Other than this place, the only good vietnamese garlic noodle spot around here is thanh long...and let me tell ya, your entire bill at perilla probably wouldn't be enough to cover tip at thanh long..haha. (its a totally different dining experience though. i love thanh long too).\n\nanyway. the food here is really good. you get a large plate with a few side items and its all for under $10. i've tried the other things on the menu, and all the plates are good. the pho...ehhh...not so much. but thats not their specialty. \n\nthe servers are all really nice too. they don't compromise time for quality of service here. people actually smile at you and refill your water. =)", "rating": 4, "date": "2012-02-14"}, {"excerpts": ["The garlic noodle with 5 spice chicken and imperial rolls. ", "The dish is delicious; however, there are times where it is not consistent. ", "There are times where it tastes better, which makes me worry every time I decide to eat there. ", "Recently, it was not great; the noodles lacked garlic favor and were actually too bland. ", "Normally, I like my food with less salt and favor, but this time it was like they forgot to add the flavor. ", "The chicken was great, but there might be times where they give you the ends which tend to be ruff and dry. ", "So it can be a hit or miss with ordering this dish.\n", "One thing is I have not tried any other dishes, which is my fault ", "so I am unable to give a full evaluation and rate them. ", "However, based on that one dish I gave them 3 stars due to their inconsistency. \n", "Also, if you are not fond of cucumbers like me, beware of their waterrrr!!"], "author": "Diana L.", "review": "I've only been here a handful of times and each time I always get the same thing. The garlic noodle with 5 spice chicken and imperial rolls. The dish is delicious; however, there are times where it is not consistent. There are times where it tastes better, which makes me worry every time I decide to eat there. Recently, it was not great; the noodles lacked garlic favor and were actually too bland. Normally, I like my food with less salt and favor, but this time it was like they forgot to add the flavor. The chicken was great, but there might be times where they give you the ends which tend to be ruff and dry. So it can be a hit or miss with ordering this dish.\nOne thing is I have not tried any other dishes, which is my fault so I am unable to give a full evaluation and rate them. However, based on that one dish I gave them 3 stars due to their inconsistency. \nAlso, if you are not fond of cucumbers like me, beware of their waterrrr!!", "rating": 3, "date": "2012-03-16"}, {"excerpts": ["Next best garlic noodle to Thanh Long. ", "The 5 star chicken is great, but I have to say the beef is outstanding. ", "The spring roles were great and the price is the best!"], "author": "Monifa W.", "review": "Garlic noodles, consistently great. Next best garlic noodle to Thanh Long. The 5 star chicken is great, but I have to say the beef is outstanding. The spring roles were great and the price is the best!", "rating": 4, "date": "2012-11-17"}, {"excerpts": ["for almost $8, you get a pretty decent serving of garlic noodle...", "a lot more than what ppq gives you..."], "author": "Helen T.", "review": "reasonable price. delicious garlic noodles, flavorful 5 spice chicken...i like this place. \n\nfor almost $8, you get a pretty decent serving of garlic noodle...a lot more than what ppq gives you...the five spice chicken was yummmalicious, very flavorful, it has a veryy niceeee crisp to the skin---maybe that made me like the chicken a lil more.......mmm mmm mmmm....\n\n\nthey're known for their garlic noodles, so stick to that...", "rating": 4, "date": "2012-01-03"}, {"excerpts": ["Only highlight was garlic noodle. ", "The pho is average and portion is small. ", "Prices are little higher due to close to 9th avenue. ", "Basil was not even fresh and clean. ", "Probably wouldn't be back unless for the garlic noodles."], "author": "Larry L.", "review": "It's ok. Only highlight was garlic noodle. The pho is average and portion is small. Prices are little higher due to close to 9th avenue. Basil was not even fresh and clean. Probably wouldn't be back unless for the garlic noodles.", "rating": 3, "date": "2012-10-30"}, {"excerpts": ["We had the Five Spice Chicken Garlic Noodle w/ Imperial Rolls and Beef Combo Pho.  \n\n", "Garlic noodle was very tasty, very garlicy, and non-oily which makes it a non-heavy entree. \n\n"], "author": "Joanna W.", "review": "A friend told me about Perilla (near Ferry Building) have the best garlic noodles and that I need to try it so I was glad when I saw the brand new Perilla on Irving - yippie! no more driving 3/4 across the city for noodles.\n\nWe had the Five Spice Chicken Garlic Noodle w/ Imperial Rolls and Beef Combo Pho.  \n\nGarlic noodle was very tasty, very garlicy, and non-oily which makes it a non-heavy entree. \n\nThe chicken tasted blend, but good texture. \n\nDon't waste your money/time here for pho - it's your average pho, nothing special.\n\nFast service - just be sure to wave your hands to get their attention. We were in and out of there in about 40 minutes.  They actually let us get a seat even though we came in 5-10 minutes before closing time.\n\nVerdict: 4/5. Will definitely come again for garlic noodles.", "rating": 4, "date": "2010-10-21"}, {"excerpts": ["Not the most scrumptuous garlic noodle.  ", "I think it lacked the chewy gumptiousness that authentic Asian has.  ", "But I can deal with what they served.  ", "The chicken was nice and crisp."], "author": "Yvette E.", "review": "The noodles were decent. Not the most scrumptuous garlic noodle.  I think it lacked the chewy gumptiousness that authentic Asian has.  But I can deal with what they served.  The chicken was nice and crisp.", "rating": 4, "date": "2013-04-05"}, {"excerpts": ["Imperial Rolls and Charbroiled Beef Garlic Noodle - Really delicious.  ", "All three items on the plate were well-made.  ", "The rolls were crunchy.  ", "The beef was tender and the noodles had just the right amount of garlic and oiliness.  \n", "Prices and portions are fair.  ", "Service is good.  ", "Space is not big but clean."], "author": "Lisa L.", "review": "I've been here twice.  \nPerilla Beef Combo Pho - not good when compared to for example, kevin's noodle house.  The soup was not piping hot, as pho is supposed to be.  It also was not as flavorful and rich.  \nImperial Rolls and Charbroiled Beef Garlic Noodle - Really delicious.  All three items on the plate were well-made.  The rolls were crunchy.  The beef was tender and the noodles had just the right amount of garlic and oiliness.  \nPrices and portions are fair.  Service is good.  Space is not big but clean.", "rating": 3, "date": "2010-12-02"}, {"excerpts": ["I ordered the garlic noodle and five spices chicken combo to go and it made my night. ", "For under $10, I get a whole satisfying plate of garlic noodles and a decent size portion of the chicken. ", "This has definitely now become one of my go-to places for a casual dinner/ to-go night."], "author": "Kelly C.", "review": "I came to Perilla after craving the wonderful garlic noodles at PPQ Dungeness Crab which is all part of the same chain. I ordered the garlic noodle and five spices chicken combo to go and it made my night. For under $10, I get a whole satisfying plate of garlic noodles and a decent size portion of the chicken. This has definitely now become one of my go-to places for a casual dinner/ to-go night.", "rating": 4, "date": "2011-08-15"}, {"excerpts": ["My wife had the garlic noodle with chicken and spring rolls!  ", "That garlic noodle is just as good as thang long BTW. ", "Plenty of food for two people for less than $25 with tip.  ", "Had to take home the rest. ", "Definitely coming back."], "author": "Joel M.", "review": "Kick butt!!!  Had a flavorful chicken noodle soup.  My wife had the garlic noodle with chicken and spring rolls!  That garlic noodle is just as good as thang long BTW. Plenty of food for two people for less than $25 with tip.  Had to take home the rest. Definitely coming back.", "rating": 5, "date": "2012-06-13"}, {"excerpts": ["I usually get the bbq pork-imperial roll-garlic noodle combo with a thai iced tea.  ", "sometimes the flavors are too strong for me ", "so i get a side of rice to balance out the saltiness, "], "author": "RACHELLE T.", "review": "Parking sucks, thats the minus one star, but if it were not for that then I would have given them 5 stars.\n\nI am very particular about my vietnamese imperial rolls. they have to be just right, they can't be wrapped in lumpia/egg roll wrapper, it HAS to be the porous kind to soak up that sauce!\n\ngarlic noodles are mouthwatering here! \n\nI usually get the bbq pork-imperial roll-garlic noodle combo with a thai iced tea.  sometimes the flavors are too strong for me so i get a side of rice to balance out the saltiness, the good saltiness i mean.\n\nservers are friendly and sometimes even funny! but sometimes service is slow even on a day when there's not many folks.\n\nits one of my go-to spots on lazy sunny weekends.", "rating": 4, "date": "2010-03-30"}, {"excerpts": ["Went for lunch and i really enjoyed their garlic noodle, and had been recommending it to all my friends ever since!\n\n ", "(1-2 star)\nfor dinner, thought to impress my parents  with their delicious garlic noodle.  ", "Turned out a bit disappointed this time, food are overall more salty, and even the five spice chicken which were supposed to be the same from PPQ on 19th, were not as good.  ", "( I'd rather go 19th for that dish now, same owner btw).  ", "And very disappointed with the garlic noodle, color were off, looked a bit burned and texture were hard, tasted like overnight noodle.  "], "author": "Jasmin Y.", "review": "Went there twice, but very different rating for the two:\nSo i am giving average of 3 star over all:\n\n\n #1.   once when they first open, (4-5 star)\nWent for lunch and i really enjoyed their garlic noodle, and had been recommending it to all my friends ever since!\n\n #2:  once couple weeks ago.  (1-2 star)\nfor dinner, thought to impress my parents  with their delicious garlic noodle.  Turned out a bit disappointed this time, food are overall more salty, and even the five spice chicken which were supposed to be the same from PPQ on 19th, were not as good.  ( I'd rather go 19th for that dish now, same owner btw).  And very disappointed with the garlic noodle, color were off, looked a bit burned and texture were hard, tasted like overnight noodle.  And the portion were very little, even less then lunch menu.\n\nNot sure if i will go there again.", "rating": 3, "date": "2010-03-24"}, {"excerpts": ["Perilla offers seriously good garlic noodle dishes with crunchy spring rolls and dipping sauce.  ", "I can't say I was a fan of Toasties (predecessor) and wasn't sure how close to PPQ this would be, but was pleasantly surprised:  "], "author": "Jim W.", "review": "Kids we have a contender here!  Perilla offers seriously good garlic noodle dishes with crunchy spring rolls and dipping sauce.  I can't say I was a fan of Toasties (predecessor) and wasn't sure how close to PPQ this would be, but was pleasantly surprised:  few can pull off Asian Fusion in a casual way and do it right.\n\nNow is all a bit on the heavy side so prepare for large combo portions, but the price is A-1.\n\nGive it a shot.", "rating": 4, "date": "2010-02-24"}, {"excerpts": ["5-spice chicken with rice, bun, or garlic noodle; or perhaps a combo plate of pork & imperial roll with rice, bun or garlic noodle; or perhaps broiled prawns with rice, bun or garlic noodle... "], "author": "Claudine C.", "review": "Delivery ($20 minimum) is swift.\nMenu seems limited with variations on a theme: 5-spice chicken with rice, bun, or garlic noodle; or perhaps a combo plate of pork & imperial roll with rice, bun or garlic noodle; or perhaps broiled prawns with rice, bun or garlic noodle... you get the picture.\n\nBut the dishes are well done indeed - the five-spice chicken wonderfully caramelised, the garlic noodles piquantly garlicky. Imperial Rolls are tight and crisp - perhaps a tad *too* savoury.  The veggie summer rolls are the best - the outside is not deep-fried, but the filling marvelously, surprisingly sauteed, filled with sweet veggies and mushrooms and bits of tofu...\n\nGlad to welcome these guys to the neighborhood.", "rating": 3, "date": "2009-12-27"}, {"excerpts": ["the garlic noodle is great ", "but so is the veggie rice noodle.  ", "the curry chicken is very yummy.  ", "I would recommend the garlic noodle with curry chicken.  ", "their new fried quail is delicious.  "], "author": "Jane A.", "review": "perilla is a great family place.  great food and genuine service.\n\nHenry the owner is very friendly and so is the rest of the staffs.  always greet customers with a smile.\n\neverything on the menu is awesome.  the garlic noodle is great but so is the veggie rice noodle.  the curry chicken is very yummy.  I would recommend the garlic noodle with curry chicken.  their new fried quail is delicious.  the BBQ pork is tender and juicy.  \n\nI love this place.  a good restaurant doesn't need a thousand entree on the menu just a few good dishes is enough.", "rating": 5, "date": "2010-01-09"}, {"excerpts": ["I ordered the BBQ pork, fried spring rolls and garlic noodle combo.  ", "I wish the noodles had a bit more garlic flavoring to it as it was a little bland for me. ", "Though the garlic noodles beat other places vermicelli option anyday.  ", "Be sure to check your bill.  ", "We were over charged by an extra dish, but the waitress hurried to correct it once we pointed out the error."], "author": "Stacey L.", "review": "I popped in here a few weeks ago with friends.  I ordered the BBQ pork, fried spring rolls and garlic noodle combo.  I wish the noodles had a bit more garlic flavoring to it as it was a little bland for me. Though the garlic noodles beat other places vermicelli option anyday.  Be sure to check your bill.  We were over charged by an extra dish, but the waitress hurried to correct it once we pointed out the error.", "rating": 3, "date": "2011-04-14"}, {"excerpts": ["Best Garlic noodle / vietnamese cuisine in San Francisco!  ", "it's a clean little restaurant located on irving street with many other restaurants for a foodie to choose from. ", "the garlic noodles here is pretty good for the price that they ask for. ", "i'm slowly becoming a fan of their cucumber water that they serve you as you wait for your order... ", "this place has a variety of sides on their menu to go with their garlic noodles... ", "only down side is that it can get kinda tough to find parking during lunch and dinner hours... ", "but you'll definitely leave with both a happy stomach and a happy wallet =)  approved for those who look for eat good without your wallet hurting afterwards."], "author": "Jeff C.", "review": "Best Garlic noodle / vietnamese cuisine in San Francisco!  it's a clean little restaurant located on irving street with many other restaurants for a foodie to choose from. the garlic noodles here is pretty good for the price that they ask for. i'm slowly becoming a fan of their cucumber water that they serve you as you wait for your order... this place has a variety of sides on their menu to go with their garlic noodles... only down side is that it can get kinda tough to find parking during lunch and dinner hours... but you'll definitely leave with both a happy stomach and a happy wallet =)  approved for those who look for eat good without your wallet hurting afterwards.", "rating": 4, "date": "2011-12-14"}, {"excerpts": ["I guess Thanh Long will remain my garlic noodle place... sigh how I wanted to like to!"], "author": "Lyly P.", "review": "My boyfriend and I came here after having sushi across the street at Kazu (great place we were just really hungry).  I was really excited because I knew they had garlic noodles and I LOVE GARLIC NOODLES (Thanh Long is amazing).  We were seated right away.  Being Vietnamese I never eat out at Vietnamese restaurants because my mom cooks the best Vietnamese food period!  But the woman can't make garlic noodles so I gave Perilla a chance.  I was on a quest to figure out if this was a real Vietnamese place or one some other group decided to open.  Then I heard the waiters speak Chinese to together.  Seriously?  Ouy.\n\nTHE FOOD:\nMy boyfriend ordered the combination Pho and I had warned him that it wouldn't be as good as my mom's.  Well once again the girlfriend was right.  The broth was bland and the soup wasn't even hot enough to cook the raw beef!  HUH? I had the garlic noodles with imperial rolls (egg rolls) and beef.  It was alright not good enough to make me come back.  I also ordered a Thai iced tea that tasted deluded.  That is a complete \"no-no\".  Overall the food was just alright, and alright does not cut it when I can get the same food (minus the garlic noodles) cooked so much better for FREE from my mom!  Again ouy.\n\nTHE SERVICE:\nIt was fine.  The main waiter kept coughing up a storm which was gross.  The food came out fast.  All our food with tip cost us $26 which seems like a lot for a Vietnamese place (I'm use to going to the T.L for Vietnamese food so that may be why). \n\nOverall:\nWill not be coming back.  I guess Thanh Long will remain my garlic noodle place... sigh how I wanted to like to!", "rating": 2, "date": "2010-01-24"}, {"excerpts": ["If you are looking to stuff yourself, you cannot go wrong with the imperial roll & [choose your favorite meat] garlic noodle combo.  "], "author": "Ann H.", "review": "Oh my garlic noodles.  This place is the real deal.  If you are looking to stuff yourself, you cannot go wrong with the imperial roll & [choose your favorite meat] garlic noodle combo.  My favorite is the beef ($9), my husband always gets the pork ($8).  \n\nI haven't eaten in the restaurant yet -- we always have it delivered.  The guy answering the phone is friendly and happy to take your order, which is nice because most of the time when I call someplace I feel like I'm bothering them?  Like I've called their house number or something, and they wish I would just leave them alone.  Anyway, Perilla has got some kind of futuristic phone system going because dude always knows my phone number and it saves my name and address.  I should also note that my husband works second shift, so by the time he gets to his noodles, he's eating them cold, and he *still* loves them.  I wish I could convey to you in this short space what a persnickety diner my husband can be.  This is high high praise.\n\nAlso, maybe it's because we're just up the hill (about 5 blocks from the restaurant), but these guys deliver lightning fast.  My doorbell rings about 10 minutes after I hang up the phone each time.  Other restaurants in the area with delivery service never even come close to that.  Bonus: the delivery dude is really friendly.  I mean, I don't want to oversell it, it's not like you'll be best friends in minutes, but he really seems like he's happy to bring your amazing delicious dinner.  For the speed and the friendliness I always give him a good tip.\n\nGive Perilla a call!  They'll treat you right!  And OH MY GARLIC NOODLES.", "rating": 4, "date": "2010-06-17"}, {"excerpts": ["Thought I'd try their garlic noodle.  ", "I ordered (togo) the 5spice chicken with garlic noodles.  ", "The food was decent. ", "Pricing was reasonable.  ", "Will have to try it again and see if its better fresh from the kitchen."], "author": "Sheenie L.", "review": "Read the reviews on yelp. Thought I'd try their garlic noodle.  I ordered (togo) the 5spice chicken with garlic noodles.  The food was decent. Pricing was reasonable.  Will have to try it again and see if its better fresh from the kitchen.", "rating": 3, "date": "2011-07-19"}, {"excerpts": ["Obviously, I got the Five Spice Chicken w/ Garlic Noodle & Imperial Rolls because it's on everyone's review in yelp.  ", "The garlic noodle didn't disappoint.  ", "It was garlic-ed perfectly and it wasn't very oily/buttery.  ", "I've seen places with a pond of oil at the bottle of the plate before.  ", "The chicken was excellent, but not the best.  ", "It was leaning toward dry.  ", "The imperial roll was very good.  ", "It was very crunchy and tasteful.  ", "As for service, it was very good.  ", "They keep coming to our table to fill our water.  ", "I'll definitely recommend this place and will come back again =)"], "author": "Calvin T.", "review": "I've been wanting to go to Perilla for a while now.  Finally I had the chance to try it.  Obviously, I got the Five Spice Chicken w/ Garlic Noodle & Imperial Rolls because it's on everyone's review in yelp.  The garlic noodle didn't disappoint.  It was garlic-ed perfectly and it wasn't very oily/buttery.  I've seen places with a pond of oil at the bottle of the plate before.  The chicken was excellent, but not the best.  It was leaning toward dry.  The imperial roll was very good.  It was very crunchy and tasteful.  As for service, it was very good.  They keep coming to our table to fill our water.  I'll definitely recommend this place and will come back again =)", "rating": 4, "date": "2011-10-18"}, {"excerpts": ["Garlic noodle is pretty good. ", "The portion is big. ", "For lunch we get five spice chicken PLUS imperial rolls (which were basically spring rolls) on the side. ", "The price is cheap too so definitely a comfort food for people with big appetite."], "author": "Cliff T.", "review": "Garlic noodle is pretty good. The portion is big. For lunch we get five spice chicken PLUS imperial rolls (which were basically spring rolls) on the side. The price is cheap too so definitely a comfort food for people with big appetite.", "rating": 3, "date": "2011-03-20"}, {"excerpts": ["I really like the vermicelli and the garlic noodle dishes. ", "Super reasonable prices, and good value for the money for sure. ", "We are fans."], "author": "Mark B.", "review": "I really like the vermicelli and the garlic noodle dishes. Super reasonable prices, and good value for the money for sure. We are fans.", "rating": 4, "date": "2011-10-04"}, {"excerpts": ["I love the FIVE SPICE CHICKEN GARLIC NOODLE.  ", "They are consistent in how they make this every time I get it or my friends get it.  ", "Nice crispy chicken and the garlic noodles wasnt drowned in butter or garlic.  ", "PAPAYA SALAD ", "WITH CHARBROILED BEEF was pretty good. "], "author": "she q.", "review": "I love the FIVE SPICE CHICKEN GARLIC NOODLE.  They are consistent in how they make this every time I get it or my friends get it.  Nice crispy chicken and the garlic noodles wasnt drowned in butter or garlic.  PAPAYA SALAD WITH CHARBROILED BEEF was pretty good. The IMPERIAL ROLLS AND CHARBROILED PORK VERMICELLI was really good just like Yummy Yummy but the PHO isnt comparable.  My fave is still Yummy Yummy PHO.  BUT if you like your PHO...lacking a better word...less salty I guess then try it here.  The portions are good and so is the service.", "rating": 4, "date": "2011-02-01"}, {"excerpts": ["The Imperial Rolls & Five Spice Chicken Garlic Noodle (item #27) was quite filling and an all-around satisfying meal. ", "The three full-size but tiny crispy fried rolls came with sweet vinegar dipping sauce. ", "There was enough of the tasty chicken thigh meat; I could taste of the five spice seasoning but it could've used a bit more. ", "The egg noodles were served al dente (more chewy than mushy) and were nicely coated in butter sauce and had delicious garlic flavor."], "author": "Cliff W.", "review": "The Imperial Rolls & Five Spice Chicken Garlic Noodle (item #27) was quite filling and an all-around satisfying meal. The three full-size but tiny crispy fried rolls came with sweet vinegar dipping sauce. There was enough of the tasty chicken thigh meat; I could taste of the five spice seasoning but it could've used a bit more. The egg noodles were served al dente (more chewy than mushy) and were nicely coated in butter sauce and had delicious garlic flavor.", "rating": 4, "date": "2012-12-07"}, {"excerpts": ["Great garlic noodle dishes! ", "and their Pho options are nice.  ", "Great service brings me back every few weeks."], "author": "David Z.", "review": "Great garlic noodle dishes! and their Pho options are nice.  Great service brings me back every few weeks.", "rating": 5, "date": "2011-01-20"}, {"excerpts": ["and I ordered five spice chicken with garlic noodle. ", "The garlic noodle was the best garlic noodle I ever eaten. ", "When I was done I wanted more garlic noodle. ", "The five spiced chicken was tasty and crispy and moist in the inside. ", "Their customer service was attentive and friendly."], "author": "Lily T.", "review": "My friend took me here for dinner and I ordered five spice chicken with garlic noodle. The garlic noodle was the best garlic noodle I ever eaten. When I was done I wanted more garlic noodle. The five spiced chicken was tasty and crispy and moist in the inside. Their customer service was attentive and friendly.", "rating": 4, "date": "2010-07-02"}, {"excerpts": ["Yummy Garlic noodle dishes. ", "I've tried all of them. ", "The best ones I think are the five spice chicken and curry chicken. ", "Good service and food comes out quick."], "author": "Dawn Z.", "review": "Yummy Garlic noodle dishes. I've tried all of them. The best ones I think are the five spice chicken and curry chicken. Good service and food comes out quick.", "rating": 5, "date": "2011-08-05"}, {"excerpts": ["I dream about eating their garlic noodle and imperial rolls.  ", "Delivery was super fast, hot and delicious...definitely 5 stars, but I think when I dined there the staff forgot about our table.  ", "I never got my lemonade, our waters were empty and it took forever for us to flag them over for the bill.  ", "So four stars in house.  ", "They are still very quick about bringing you what they remember ", "so if your mouth is drooling when you get there you don't have to wait long", "....", "Hmmm what is that delivery number again?  ", "I'm hungry for some papaya salad."], "author": "Debora B.", "review": "Sooo good!!! Since I finally decided to eat her I dream about eating their garlic noodle and imperial rolls.  Delivery was super fast, hot and delicious...definitely 5 stars, but I think when I dined there the staff forgot about our table.  I never got my lemonade, our waters were empty and it took forever for us to flag them over for the bill.  So four stars in house.  They are still very quick about bringing you what they remember so if your mouth is drooling when you get there you don't have to wait long....Hmmm what is that delivery number again?  I'm hungry for some papaya salad.", "rating": 4, "date": "2010-10-07"}, {"excerpts": ["Awesome garlic noodle!\n", "3. ", "Very friendly and nice owner. \n", "4. ", "Quick service\n5. ", "Even though they don't serve alcohol, the best part is you can buy your beer/wine in the convenience store next door and drink it here. "], "author": "Anirban A.", "review": "I love this place. So here are the pros:\n\n1. Very tasty imperial rolls! They are the best rolls ever\n2. Awesome garlic noodle!\n3. Very friendly and nice owner. \n4. Quick service\n5. Even though they don't serve alcohol, the best part is you can buy your beer/wine in the convenience store next door and drink it here. They will bring your glass and gladly open your bottle but don't nickel-and-dime you with a corkage fee-:)\n\nI am so happy to find this place. It's one those small little interesting place that makes the inner sunset such a charming place to live!", "rating": 5, "date": "2010-06-13"}, {"excerpts": ["Though most people would label the highlight of this restaurant as the garlic noodle, I would say that the greatest part of this place is the owner/server. ", "He stands just about 5'6'', but his short stature is compensated by his unbelievably welcoming and enthusiastic personality. ", "I ordered the garlic noodle, grilled pork, and imperial rolls. ", "They were great."], "author": "alfred t.", "review": "Though most people would label the highlight of this restaurant as the garlic noodle, I would say that the greatest part of this place is the owner/server. He stands just about 5'6'', but his short stature is compensated by his unbelievably welcoming and enthusiastic personality. And his effect is contagious, indeed. \n\nUpon walking in, the owner would welcome you as if you were his very own son/daughter -- and that is how I felt like, son/daughter. He makes no distinction between gender, age, nor race. To him, all that enters are hungry, and all will be treated as hungry.\n\nUnlike the standardized conversation of how many restaurants follow, the owner is special in that he not only would ask how your day was, but would push a conversation making you feel that this is an interaction between two human beings, and not just two strangers -- albeit you had just met. He wears a grand smile on his face, and in effect you would have no choice but to be emotionally vulnerable throughout your whole time in the restaurant. I didn't feel like I was entering a business, instead I was entering my home after a long absence. I wanted to cry.\n\nI ordered the garlic noodle, grilled pork, and imperial rolls. They were great.", "rating": 5, "date": "2010-06-27"}, {"excerpts": ["a satisfying lunch\n\ncombo garlic noodle with five spice chicken and imperial roll hit the spot and was reasonably priced at i think ", "But really, I'd be game to try any of the other pairings just to eat the garlic noodle again.\n\n"], "author": "R L.", "review": "a satisfying lunch\n\ncombo garlic noodle with five spice chicken and imperial roll hit the spot and was reasonably priced at i think $9. good hearty flavors, which a bit unfortunately made tasting the curry chicken soup vermicelli somewhat bland afterward. But really, I'd be game to try any of the other pairings just to eat the garlic noodle again.\n\nService was friendly and attentive without being cloying. I liked the bit of cucumber in the water.", "rating": 4, "date": "2011-03-09"}], "seasoned vegetables": [{"excerpts": ["Both were perfectly tasty, but I have to admit the standout may have been the $6.50 plate of Seasoned Vegetables - shredded cabbage and carrots mixed with fried tofu (see photo). ", "I was liking it all, but the young woman sitting behind me kept playing with her hair, pulling it into a ponytail, and whipping it against my head with no regard to the lack of sanitation in her nervous habit. "], "author": "Ed U.", "review": "I would be hard pressed to give Perilla anything less than four stars - it's solid, house-made Vietnamese fare for the relatively undemanding urbanite. Maybe because Jamie W. and I are used to the one on Mission near the demolished Transbay Terminal, a bustling place during the lunch hour, that we were marginally disappointed with the garlic level in the garlic noodles served here. Dare I say it was a tad bland, which makes stuffing your face with heavy-duty carbs more of a dietary challenge than it has to be. But I won't ding them much for that since the quality level is still pretty darn high for the Perilla brand.\n\nNow that there are three of them in the city plus PPQ Beef Noodle House close to this location and the PPQ Dungeness Island in the Outer Richmond - are we looking at the Vietnamese version of the King of Thai Noodle chain? Could be... In truth, we went to the Geary location first but found it closed for renovation, so out of determination to have our garlic noodles, we took the 44 O'Shaughnessy line to the Irving Street location, which was very nearly packed. Soon after we were seated, we ordered the $6.50 Shrimp Rolls, which were a tad small but still delectable as a starter.\n\nJamie and I went our separate ways on our $8.50 Garlic Noodle plates - I had my standby, the Five-Spice Chicken (see photo), while he veered into the Charbroiled Pork marinaded in garlic and pepper (see photo). Both were perfectly tasty, but I have to admit the standout may have been the $6.50 plate of Seasoned Vegetables - shredded cabbage and carrots mixed with fried tofu (see photo). I was liking it all, but the young woman sitting behind me kept playing with her hair, pulling it into a ponytail, and whipping it against my head with no regard to the lack of sanitation in her nervous habit. Disgusting...and wear a hat to cover your dandruff-covered head, hon.\n\nFOOD - 4 stars...still Perilla-quality even if they seem to have a garlic shortage here\nAMBIANCE - 2.5 stars...get me away from that hair-tossing moron!\nSERVICE - 3 stars...always smiling, just not always present\nTOTAL - 4 stars...if only the Mission location stayed open for dinner and on weekends (sigh)", "rating": 4, "date": "2012-09-20"}], "cup of broth": [{"excerpts": ["Cup of Broth: ", "I know you don't come here for the pho, so I obviously didn't order pho.  ", "But I was curious how it tasted ", "so I got a cup of their beef pho broth.  ", "It was basically meh.  ", "Heavy tones of star anise and salt.  ", "Missing the rich fatty and umami meat subtleties you might find at Bodega Bistro.  ", "Definitely stick with the garlic noodles."], "author": "Adam B.", "review": "I'm familiar with the Perilla in the FiDi so was curious to try this one in the Avenues after a staycation day at the Academy of Sciences.  I actually think this location is better.  For the FiDi lunch rush, that location must precook a lot of the garlic noodles; I've seen huge the huge vats they pull from.  We came here for an early dinner when it wasn't that crowded; our order took awhile so I figured they made it fresh.  And I could tell the difference; the noodles were so good!\n\nImperial Rolls and Charbroiled Beef Garlic Noodle: I love this dish because I get three of my favorite things and only two pieces of steamed broccoli (which is still too much broccoli).  The imperial rolls were perfectly crispy and filled with moist pork.  It's not Tu Lan quality, but still really good.  I love the charbroiled beef because it's shellacked with tangy marinade and full of seared goodness; almost like having Korean BBQ done for you.  The garlic noodles are so garlicky and chewy.  They're not quite as good as An The Go (i.e. Crustacean's food truck), but still yummy. \n\nPork Chop Garlic Noodle: A massive amount of meat.  Thinly cut, heavily marinated and nicely seared like the beef.  As much as I'm a big fan of the beef, this may be better.\n\nCup of Broth: I know you don't come here for the pho, so I obviously didn't order pho.  But I was curious how it tasted so I got a cup of their beef pho broth.  It was basically meh.  Heavy tones of star anise and salt.  Missing the rich fatty and umami meat subtleties you might find at Bodega Bistro.  Definitely stick with the garlic noodles.", "rating": 4, "date": "2016-04-11"}]}