{"cup of fruit": [], "granola": [], "eggs blackstone": [{"excerpts": ["I ordered the eggs blackstone and a hot tea.  ", "The tea was really weird tasting. ", "I don't know if it was the brand or the water but ", "as someone who has tea daily and many places, I've never encountered such weird tasting tea. ", "It was drinkable but not enjoyable. ", "My eggs blackstone was very mediocre. ", "The idea of the tomato and bacon sounded really good but in execution just didn't taste right. "], "author": "MISS S.", "review": "Awful breakfast food. Save your money and find a different place to eat.  Ate here with 5 friends and the only one who walked out happy was the one who didn't order food. \n\nI ordered the eggs blackstone and a hot tea.  The tea was really weird tasting. I don't know if it was the brand or the water but as someone who has tea daily and many places, I've never encountered such weird tasting tea. It was drinkable but not enjoyable. My eggs blackstone was very mediocre. The idea of the tomato and bacon sounded really good but in execution just didn't taste right. Lacked flavor. \n\nMy husband ordered the chorizo scramble and he was sorely disappointed. Undercooked eggs and a strange diced meat that definitely wasn't chorizo. The tortillas were laid in grease. \n\nMy 3 other friends had the French toast that was soggy and uneatable, the veggie omelet that the eggs again were undercooked and lacked flavor, the corn beef hash which was not corn beef and there was no hash which was ridiculous. 2 had bloody Mary's and they were watered down with very little alcohol. \n\nNot sure where they are getting their recipes or what's going on in that kitchen but we've never had such awful breakfast before. \n\nThe only good things they had was the breakfast potatoes and toast. \n\nThe decor is really cute and it looks well maintained. The service was good and friendly. It was such a disappointment that the food did not live up to the atmosphere.", "rating": 1, "date": "2014-03-23"}, {"excerpts": ["The eggs blackstone were delicious, though my accompanying potatoes were mushy.  ", "Blueberry pancakes with maple syrup were awesome though.  "], "author": "Joanne G.", "review": "Came here for brunch with my running buddies, who have a lot of nostalgia for the place and fun memories of the Perry's to Perry's races the restaurant used to sponsor.\n\nI would never have believed the place was so large-- definitely a good choice for groups.  We were given a table in the atrium area, which was beautiful on such a sunny day.  Loved that the brunch menu was about twice as large as our usual brunch haunts (three types of eggs benedict- yay.)  \n\nSimple food with no surprises, but still pretty good.  The eggs blackstone were delicious, though my accompanying potatoes were mushy.  Blueberry pancakes with maple syrup were awesome though.  Huge portions.  \n\nLoved that the bar was packed at 10AM on a Saturday morning!", "rating": 4, "date": "2010-04-26"}, {"excerpts": ["The mimosas are delicious, and today I had the Eggs Blackstone which I thought was pretty darn tasty.  ", "I've had a few different omelettes here before as well and they were good, nothing mindblowing ", "but then again, I don't think I've ever had an omelette that I constantly dream about (has anyone?).  "], "author": "Laura C.", "review": "I've been here a few times now, once for dinner and 3 times for brunch/lunch.\n\nIn my opinion, it's a great brunch spot if you get a table that is near a window or exposed to sunlight - great way to start the day.  No complaints about the service really, although the food did take a little bit of time to be served.  The mimosas are delicious, and today I had the Eggs Blackstone which I thought was pretty darn tasty.  I've had a few different omelettes here before as well and they were good, nothing mindblowing but then again, I don't think I've ever had an omelette that I constantly dream about (has anyone?).  Overall though, this is a solid option for brunch, though I wouldn't make a beeline for here on the reg.\n\nAs for dinner, I've had their burger before. It was alright, but I remember feeling really sick a few hours later, so I will definitely not be ordering that again.", "rating": 3, "date": "2011-10-02"}, {"excerpts": ["I ordered the Eggs Blackstone, a variation of the Eggs Benedict with tomatoes and Hobbs bacon added. ", "Needless to say, excellent! ", "I think I'll throw in the blueberry pancakes next time as well. "], "author": "Andrew D.", "review": "The Hang over cure!\n\nThis place is always busy for some reason. I arrived during brunch on a packed Sunday. There's something classy about a joint where the wait and tend staff wear ties. Especially when they're done up in full Windsors! \n\nI had the good fortune of gaining exposure to this 40 year old restaurant/bar from a very reputable marina local. \n\nWe were seated at the bar and started with a couple of fine Bloody Mary's crafted by Bob, a skilled and knowledgeable tender of the drink. The brunch menu was well populated with a wide array of entrees. I ordered the Eggs Blackstone, a variation of the Eggs Benedict with tomatoes and Hobbs bacon added. Needless to say, excellent! I think I'll throw in the blueberry pancakes next time as well. They have great buffalo wings too. \n\nFor some reason I'm sure I'll be partaking in Perry's again. Sooner rather then later.", "rating": 5, "date": "2011-02-28"}, {"excerpts": ["I had a great eggs blackstone made with crunchy bacon and two perfectly poached eggs.  ", "The home fries were just 'eh' but I find that I really dislike home fries at 90% of the brunch places ", "I frequent so this didn't really shock me.\n", "Good stuff, I'll be back."], "author": "phil h.", "review": "Sitting under the heat lamps at Perry's is the perfect place to people watch on a cool, dreary Sunday morning.  I had a great eggs blackstone made with crunchy bacon and two perfectly poached eggs.  The home fries were just 'eh' but I find that I really dislike home fries at 90% of the brunch places I frequent so this didn't really shock me.\nGood stuff, I'll be back.", "rating": 4, "date": "2006-06-11"}], "california benedict": [{"excerpts": ["Also, the California Benedict arrived cold. ", "Gross!"], "author": "Ashley S.", "review": "Perry's is classic San Francisco but I have no idea what really keeps this place open? The ambiance is nice and it has a family vibe so I am not opposed to going but every time I go I am slightly disappointed...the food is just NOT that good. \n\nI've gotten the following:\n\n-California Benedict\n-Veggie Burger\n-Cheeseburger\n-Club Sandwich \n\nAll 4 are pretty hard to mess up...everything was a solid C in my book. Also, the California Benedict arrived cold. Gross!", "rating": 2, "date": "2016-01-09"}], "tortilla scramble": [{"excerpts": ["We ordered:\nTortilla scramble\nbacon and cheese potato skins\n", "The bacon and cheese potato skins (about 10-12 of these) had way too much potato for the bacon and cheese. ", "overall tasted bland. ", "My friend's Tortilla scramble was decent but nothing to write home about."], "author": "Alice Z.", "review": "Probably wouldn't come back here again given all the choices on Union street.\n\nCame here for sunday brunch.  Vast menu, lots of choices, just not that many great picks.\n\nWe ordered:\nTortilla scramble\nbacon and cheese potato skins\nAhi Tacos\n\nAll sounded great in concept.\n\n(+) HUGE portions. you definitely won't have to leave here hungry.  Even the drinks had huge portions (cappuccino in a mug the size of a small bowl)\n\n(-) tastes were all pretty bad.  \n\nThe Ahi tacos only had ahi tuna in the tip of the taco. The rest of it was red lettuce slices and a bit of sauce. You get 4 tacos.\n\nThe bacon and cheese potato skins (about 10-12 of these) had way too much potato for the bacon and cheese. overall tasted bland. The potatoes were too thick and mealy.\n\nMy friend's Tortilla scramble was decent but nothing to write home about.", "rating": 3, "date": "2013-10-09"}, {"excerpts": ["My scramble (tortilla scramble??)  wasn't great. ", "The eggs were burnt. ", "I asked for sourdough toast and they gave me wheat. "], "author": "Ashley K.", "review": "Meh. \n\nIt was ok. But not the best. \n\nCame for brunch on New Years Day. Didn't have to wait long for a table because our group got here before the big rush. \n\nThe bloody mary hit the spot... a given considering the day... =)\n\nThe food left me wanting something more and/or more tasty. The potatoes were the best part of the breakfast for sure. My scramble (tortilla scramble??)  wasn't great. The eggs were burnt. I asked for sourdough toast and they gave me wheat. I ate the cold, butter-less, not crisp toast anyways without complaining because I was starving and the waitresses were slow moving. \n\nAll in all.... I would come back for a drink. And i would continue walking down the street in search for a different brunch spot.", "rating": 2, "date": "2013-01-04"}, {"excerpts": ["My favorite is the tortilla scramble with sour cream.\n\n"], "author": "Kimberly B.", "review": "I just got  home from a meal at Perry's after their 40th anniversary block party where the The Sun Kings (Beatles cover band) played.  I've lived in this neighborhood for quite a few years, so I've eaten at Perry's lots of times and wanted to finally give it a review.\n\nPerry's is that great old standby that you know you can count on.  The hostesses, waitstaff, and bartenders are always friendly.  (It was a madhouse today and the hostesses and our waitress were taking it all in stride.)  The menu has a wide selection of items, so you know that anyone you bring there will be able to find SOMETHING that they like.\n\nToday I had the Portobello Mushroom Sandwich with fries and my friend had the classic Cobb Salad.  I also love their burger (it always comes the way I order it...medium rare) and the iceberg wedge with a nice coating of blue cheese dressing, crumbles, and bacon.  I've never ordered wine by the bottle, but they have a nice selection by the glass, so I appreciate that!  I also go quite often for breakfast/brunch and that's always good, too.  My favorite is the tortilla scramble with sour cream.\n\nAll in all, it's a friendly, comfortable, neighborhood place where everybody knows your name.  (OK, they don't really know my name or anything, but they're always nice anyway!)", "rating": 3, "date": "2009-08-23"}], "chorizo scramble": [{"excerpts": ["My husband ordered the chorizo scramble and he was sorely disappointed. ", "Undercooked eggs and a strange diced meat that definitely wasn't chorizo. "], "author": "MISS S.", "review": "Awful breakfast food. Save your money and find a different place to eat.  Ate here with 5 friends and the only one who walked out happy was the one who didn't order food. \n\nI ordered the eggs blackstone and a hot tea.  The tea was really weird tasting. I don't know if it was the brand or the water but as someone who has tea daily and many places, I've never encountered such weird tasting tea. It was drinkable but not enjoyable. My eggs blackstone was very mediocre. The idea of the tomato and bacon sounded really good but in execution just didn't taste right. Lacked flavor. \n\nMy husband ordered the chorizo scramble and he was sorely disappointed. Undercooked eggs and a strange diced meat that definitely wasn't chorizo. The tortillas were laid in grease. \n\nMy 3 other friends had the French toast that was soggy and uneatable, the veggie omelet that the eggs again were undercooked and lacked flavor, the corn beef hash which was not corn beef and there was no hash which was ridiculous. 2 had bloody Mary's and they were watered down with very little alcohol. \n\nNot sure where they are getting their recipes or what's going on in that kitchen but we've never had such awful breakfast before. \n\nThe only good things they had was the breakfast potatoes and toast. \n\nThe decor is really cute and it looks well maintained. The service was good and friendly. It was such a disappointment that the food did not live up to the atmosphere.", "rating": 1, "date": "2014-03-23"}], "veggie scramble": [{"excerpts": ["For brunch I had the Veggie Scramble w/potatoes which I really liked. ", "My cousin had the French Toast and her husband had a Cobb Salad, that looked delicious.\n", "Service was somewhat slow but our waitress was very friendly.\n", "The food here is just about average, nothing memorable.\n", "Sadly I think Perry's better days are behind them. ", "Years (and more years) ", "ago our gang use to bar hop here almost every weekend. ", "Those were the good ole days!  ", "Ha!\n", "They've been a San Francisco Staple on Union St for a very long time."], "author": "Janet T.", "review": "We walked to Perry's from my cousins place nearby. \nWe had 9:30 Brunch reservations today (Sunday) for myself, my cousin and her husband. \nIt was already crowded when we arrived and when we left it was PACKED. Our waitress told us it was going to be an extremely busy day with the Niner game, the Giants game and apparently a big convention in town for Oracle.\nWe started off with Mimosa's, then coffee. For appetizers we had the grilled chicken quesadilla (which was good) and spicy wings (which I didn't care for at all).\nFor brunch I had the Veggie Scramble w/potatoes which I really liked. My cousin had the French Toast and her husband had a Cobb Salad, that looked delicious.\nService was somewhat slow but our waitress was very friendly.\nThe food here is just about average, nothing memorable.\nSadly I think Perry's better days are behind them. Years (and more years) ago our gang use to bar hop here almost every weekend. Those were the good ole days!  Ha!\nThey've been a San Francisco Staple on Union St for a very long time.", "rating": 4, "date": "2014-09-28"}], "bacon  cheddar omelette": [], "denver omelette": [], "challah french toast": [], "willy halnans corned beef hash": [], "toasted bagel  lox": [], "belt": [], "side of toast": [], "fruit cup": [], "side of apple sausage": [], "side of grilled ham": [], "side of breakfast potatoes": [], "grilled artichoke": [{"excerpts": ["Preface with the fact that we only had Perry's Bloody Marys and the Grilled Artichoke appetizer. \n\n", "The Grilled Artichoke was fantastic!! "], "author": "Mary B.", "review": "Preface with the fact that we only had Perry's Bloody Marys and the Grilled Artichoke appetizer. \n\nThe Grilled Artichoke was fantastic!! The Bloody Marys were good for the $8 price but lacked any garnishes like celery and olives which can really add to it.\n\nOur server was very attentive. However the space towards the back of the bar is tight with tables really close to each other.", "rating": 4, "date": "2017-06-06"}, {"excerpts": ["The grilled artichoke was chewy and lacked meatiness. ", "The pulled pork lacked flavor and the salad didn't come with dressing. ", "The Thursday special (prime rib sandwich) was very tasty and had good depth of flavors thus getting the second star. ", "The busboy was attentive keeping beverages full and clearing our plates. ", "Also, the attentive hostess noticed our table waiting for nearly 8-10 minutes for the bill and went to the back to find our server who then promptly came."], "author": "Jason B.", "review": "Perry's was the premiere restaurant as I used to frequent often in the 90's and early 2000's.  It has lost its luster. We were greeted with a smile but that was the highlight. The initial service was very timely. The grilled artichoke was chewy and lacked meatiness. The pulled pork lacked flavor and the salad didn't come with dressing. The Thursday special (prime rib sandwich) was very tasty and had good depth of flavors thus getting the second star. The busboy was attentive keeping beverages full and clearing our plates. Also, the attentive hostess noticed our table waiting for nearly 8-10 minutes for the bill and went to the back to find our server who then promptly came.", "rating": 2, "date": "2018-03-29"}, {"excerpts": ["Two girls, two waters, one regular cob salad with salami and added avocado, one seared tuna burger, and one grilled artichoke appetizer. ", "The two entrees came first, I'd say they were pretty average at best, nothing too amazing, I saw a lot of other pretty salads that a lot of people seemed to be ordering. ", "The grilled artichoke was pretty decent, I'd probably order it again if I was around the restaurant and was hungry. "], "author": "Mindy T.", "review": "Two stars mostly for the ambiance. It was a Sunday afternoon, great weather and we were just looking for a casual restaurant to catch some rays and grab some food. \n\nTwo girls, two waters, one regular cob salad with salami and added avocado, one seared tuna burger, and one grilled artichoke appetizer. The two entrees came first, I'd say they were pretty average at best, nothing too amazing, I saw a lot of other pretty salads that a lot of people seemed to be ordering. The grilled artichoke was pretty decent, I'd probably order it again if I was around the restaurant and was hungry. Our total including tax and tip was $48.\n\nIt's great for some sun and enjoying the nice day, they don't really rush you out and you're able to take your time and catch up with friends. The downside was the cleanliness, our table cloth was pretty disgusting and all of our silverware was dirty as well. Probably wouldn't go out of my way to come here again, but if I was super starving and in the neighborhood, I may stop by and order something new.", "rating": 2, "date": "2014-03-24"}, {"excerpts": ["Had the beet and arugula salad with chicken added and the grilled artichoke which was fantastic! ", "I'll definitely come here again if I'm in the neighborhood- saw a table eating chicken wings that looked delicious- need to try that next time!"], "author": "Cora M.", "review": "Stumbled upon this little gem while window shopping on Union. Not sure why there's only 3 stars. I had great service and the food was delicious! Had the beet and arugula salad with chicken added and the grilled artichoke which was fantastic! I'll definitely come here again if I'm in the neighborhood- saw a table eating chicken wings that looked delicious- need to try that next time!", "rating": 4, "date": "2015-06-10"}, {"excerpts": ["I like their grilled artichoke serve with Meyer lemon aioli.  ", "The artichoke was nicely grilled and the artichoke meat was pretty tender.  ", "I thought their French onion soup had too much bread inside but too little soup.  ", "I also like the clam chowder for the consistency was not too thick nor too runny and their were lots of clams inside.  ", "However I wasn't particularily fond of their pot roast because the meat were too moist and loose.  ", "It was nice they had some veggies on the plate too.  "], "author": "Betty L.", "review": "A nice well known restaurant near the Embarcedro that serves good American comfort food.  They serve good portions of food compared to Vancouver.  I like their grilled artichoke serve with Meyer lemon aioli.  The artichoke was nicely grilled and the artichoke meat was pretty tender.  I thought their French onion soup had too much bread inside but too little soup.  I also like the clam chowder for the consistency was not too thick nor too runny and their were lots of clams inside.  However I wasn't particularily fond of their pot roast because the meat were too moist and loose.  It was nice they had some veggies on the plate too.  I noticed the crab cakes were too brown and it lacked flavour.\n\nFor a modest price and big portions it's still worth a try.", "rating": 3, "date": "2010-08-22"}, {"excerpts": ["We started with a split Caesar, grilled artichoke, corn chowder and fried calamari ", "and it was all just mouth watering good.  ", "I had my burger, others had grilled salmon, Chopped Salad,  Meatloaf and mashers, fettucine and roast chicken and everyone raved through each bite.  ", "I say all this because eating in a bar restaurant is almost a thing of the past and yet Perry's offers 4 star food in a relaxed and totally comfortable environment at prices that allow the dream of a foreign sports car in the near future.  ", "My burger was sensational, the custom bun, toasted just right and almost tailored to the meat and fixings, thoughtful and spot on.  ", "The meat tasted fresh, was cooked as ordered and was accompanied by with house made chips that were the only disappointment the table experienced, they were cold and tasteless.  "], "author": "Stu S.", "review": "This landmark institution still delivers the goods after more than 40 years of great food, service, vibes and people, thank you Perry Butler and team.  Had lunch with old friends at Perry's the other day and it was better than ever.  There is a timeless, cheerful homeyness reminiscent of the saloon made so famous in the long running televisions series Cheers, and when you add really great food you get a home run.  Impeccably clean, well tended and professionally staffed, the food is remarkable for the scope and integrity of the menu, but truly delivers on quality.  It was a cool, gray, rainy day and the minute we walked in the entryway and were greeted by a pert, striking hostess who quickly showed us to a window table in the front dining room, the day became lighter and more interesting.  The blue and white check table clothes, chicken wire tile floors, contemporary prints and photos framed and hung perfectly throughout the whole restaurant, the centerpiece bar, and the involved crowd busy sharing their news at tables and the bar made for a thriving community within the outside world and brought comfort to all of us.\n\nA busser promptly arrived with water, bread sticks and unsalted butter, followed immediately by a waiter with menus and a cheerful welcome.  I knew I wanted their burger, one of the best I've ever had and still among my favorite burgers in the world.  We started with a split Caesar, grilled artichoke, corn chowder and fried calamari and it was all just mouth watering good.  I had my burger, others had grilled salmon, Chopped Salad,  Meatloaf and mashers, fettucine and roast chicken and everyone raved through each bite.  I say all this because eating in a bar restaurant is almost a thing of the past and yet Perry's offers 4 star food in a relaxed and totally comfortable environment at prices that allow the dream of a foreign sports car in the near future.  My burger was sensational, the custom bun, toasted just right and almost tailored to the meat and fixings, thoughtful and spot on.  The meat tasted fresh, was cooked as ordered and was accompanied by with house made chips that were the only disappointment the table experienced, they were cold and tasteless.  But the burger was big and sumptuous and each bite felt like I was at heaven's gate.  \n\nAt Perry's time seems to matter less than at most other restaurants, maybe because it feels like a breath of fresh air, a respite or escape from pressure and stress, and it really is.  The decor, the drinks, the staff, the design and warmth, and the food, brought to life by plenty of happy faces and churning conversation make for a fine dining experience.  I'm all about burgers and this takes the cake.", "rating": 5, "date": "2011-10-23"}, {"excerpts": ["My favorites at Perry's are the cobb salad and the grilled artichoke.\n\n"], "author": "Kathy D.", "review": "I really like Perrys.  It is a good place to go grab a quick bite or drink on Union St.  It has your traditional type of food- sandwiches, salads, entrees etc. are all pretty standard.\n\nWe used to sit right at the bar and grab a drink and eat a quick dinner. I like the idea of sitting at the bar for dinner- it makes me feel like a grownup.  My favorites at Perry's are the cobb salad and the grilled artichoke.\n\nAlso Joe Montana frequents this place so be on the look out :)", "rating": 3, "date": "2011-02-05"}, {"excerpts": ["The grilled artichoke appetizer, Iceberg lettuce wedge and the Perry's burger kill. ", "Get a table outside and enjoy the beautiful people of Union St."], "author": "Bill C.", "review": "Perry's is always one of our favorite places to have brunch or watch the Giants/49er games on the weekend. The grilled artichoke appetizer, Iceberg lettuce wedge and the Perry's burger kill. Get a table outside and enjoy the beautiful people of Union St.", "rating": 4, "date": "2011-05-10"}], "ahi poke": [], "potato skins": [{"excerpts": ["We ordered:\nTortilla scramble\nbacon and cheese potato skins\n", "The bacon and cheese potato skins (about 10-12 of these) had way too much potato for the bacon and cheese. ", "overall tasted bland. ", "My friend's Tortilla scramble was decent but nothing to write home about."], "author": "Alice Z.", "review": "Probably wouldn't come back here again given all the choices on Union street.\n\nCame here for sunday brunch.  Vast menu, lots of choices, just not that many great picks.\n\nWe ordered:\nTortilla scramble\nbacon and cheese potato skins\nAhi Tacos\n\nAll sounded great in concept.\n\n(+) HUGE portions. you definitely won't have to leave here hungry.  Even the drinks had huge portions (cappuccino in a mug the size of a small bowl)\n\n(-) tastes were all pretty bad.  \n\nThe Ahi tacos only had ahi tuna in the tip of the taco. The rest of it was red lettuce slices and a bit of sauce. You get 4 tacos.\n\nThe bacon and cheese potato skins (about 10-12 of these) had way too much potato for the bacon and cheese. overall tasted bland. The potatoes were too thick and mealy.\n\nMy friend's Tortilla scramble was decent but nothing to write home about.", "rating": 3, "date": "2013-10-09"}, {"excerpts": ["My favorite item on the menu is the fried potato skins.... ", "Yum! ", "One small caveat-- while perrys is delicious, it can be fairly expensive. ", "Most entrees are around $15."], "author": "Barbara P.", "review": "A delicious hot spot for locals! There are several perrys in the Bay Area, but this one is my favorite. Great, friendly servers and delicious food. My favorite item on the menu is the fried potato skins.... Yum! One small caveat-- while perrys is delicious, it can be fairly expensive. Most entrees are around $15.", "rating": 5, "date": "2015-07-15"}, {"excerpts": ["maybe because I just had the potato skins.  "], "author": "Jennifer L.", "review": "I had brunch here with a friend this past sunny Saturday to start off our little SF day trip!  After walking around the Marina look for a place that was more reasonable priced, we decided on Perry's.\n\nWe were seated outside on this beauuutiful day, which probably made our experience a zillion times better.  Yes, a zillion.\n\nMimosas which were good, but if you want me to really be a brat, it seems like it wasn't with real orange juice.  I personally like super pulpy orange juice with it, so if you like that too, don't order a mimosa here.  \n\nThe potato skin appetizer was enough to be an entree in itself!!  It was soooo good, and definitely worth the price ~$9 if you're sharing it with a bunch of people.\n\nThe eggs florentine was good, but it wasn't super flavorful... maybe because I just had the potato skins.  My friend and I split this dish because it comes with two + more potatoes.\n\nWe ordered a side of chicken apple sausage which was delicious (it comes with two), but not worth $4.50.\n\nI don't think I'd come here again, but I enjoyed my experience overall :)  For the amount of food you get, the prices are reasonable... I definitely had a lot of leftovers!", "rating": 3, "date": "2011-10-04"}, {"excerpts": ["Our group had the chicken wings, potato skins ", "and I had a bowl of soup. ", "All in all it was good but not spectacular!"], "author": "Kimberly T.", "review": "Stopped in for appetizers and soup before an art show. There was really nothin' exciting about Perrys but I enjoyed it. Our group had the chicken wings, potato skins and I had a bowl of soup. All in all it was good but not spectacular!", "rating": 3, "date": "2013-12-29"}, {"excerpts": ["Some faves of mine are the Chicken BLT, the potato skins, and artichokes. ", "As for drinks, a Ramos Fizz is a MUST if you come to Perry's. ", "This place has a home like feel and if you sit at the bar, the bartenders are always friendly and meeting the other patrons is always an experience as well. ", "There are many regulars that hang out at the bar and if you're lucky, you can hear the many stories of experiences they've had at Perry's!"], "author": "Michelle H.", "review": "Absolutely love Perry's! It's been our local bar for over 10 years. The food is good and the service is excellent!  They appreciate the repeat customers or regulars and that's what I love about it the most! Some faves of mine are the Chicken BLT, the potato skins, and artichokes. As for drinks, a Ramos Fizz is a MUST if you come to Perry's. This place has a home like feel and if you sit at the bar, the bartenders are always friendly and meeting the other patrons is always an experience as well. There are many regulars that hang out at the bar and if you're lucky, you can hear the many stories of experiences they've had at Perry's!", "rating": 5, "date": "2014-03-20"}, {"excerpts": ["We tried a bunch of appetizers, spicy buffalo wings and tenders, grilled chicken quesadilla, calamari, and potato skins.  "], "author": "Janelle C.", "review": "Made reservations for 8 people at Perry's for dinner.  When we arrived, 5 minutes before our reservation, the wait staff told us they had a table set up for us but just took it apart and needed a few minutes to put it back together.  Not sure what that was all about but it didn't take long. \n\nWe tried a bunch of appetizers, spicy buffalo wings and tenders, grilled chicken quesadilla, calamari, and potato skins.  Your typical bar menu but everything was cooked and seasoned great, we enjoyed all of them.   \n\nShared the grilled ahi sandwich for the main which I think had mayonnaise on it that I would rather leave off next time.  Ginger gave the sandwich a fresh taste.  \n\nThis looks like a really old bar with a dirty tiled floor and dark wood.  Guess that's part of it's charm, good food, decent service but isn't anything to write home about.", "rating": 3, "date": "2011-06-05"}, {"excerpts": [", their potato skins (delicious!), burger (nothing new), mushroom sandwhich (yumm!  very juicy.), aaaaannnnnddddd a bunch of other foods -- ", "let me spare you on each and every one of my feelings towards each one.  ", "My top three choices would probably be the cornbeef hash, chicken blt w/avocado, and the potato skins =).  ", "Enjoy!"], "author": "Pia V.", "review": "I used to come to this location of Perry's at least once a week.  This was when my best friend was working down the street, of course =P.  The place is never too packed, so we NEVER had to wait for a table.  The staff was very attentive and made frequent visits to our table.\n\nI've tried their fried chicken (very crunchy, but I like eating fried chicken in the comfort of my own home with plenty of rice and ketchup), chicken sandwich (the chicken sometimes, but rarely, came out a little try for me, but I would just use a lot of ketchup to help the taste), their potato skins (delicious!), burger (nothing new), mushroom sandwhich (yumm!  very juicy.), aaaaannnnnddddd a bunch of other foods -- let me spare you on each and every one of my feelings towards each one.  My top three choices would probably be the cornbeef hash, chicken blt w/avocado, and the potato skins =).  Enjoy!", "rating": 4, "date": "2009-02-25"}, {"excerpts": ["We followed suit - but added a hefty amount of food, including the potato skins (yum!), the weekly special veggie sandwich (yuck!) and the cobb salad (yum!). \n\n"], "author": "Donna Z.", "review": "Perry's fits in perfectly along the well-manicured and boutique-laden Union Street. \n\nAfter pumping about fifty quarters (no joke) into the meter and a long - yet entirely successful! - dress shopping appointment at Haute Bride next door, my group and I dined here for lunch.\n\nWith both street and indoor seating, it's a casual lunch spot with an upscale Marina vibe. Business lunchers and well-to-do couples took up a majority of the tables and quietly sipped wine and beer. We followed suit - but added a hefty amount of food, including the potato skins (yum!), the weekly special veggie sandwich (yuck!) and the cobb salad (yum!). \n\nI'll stop by again when I'm back in the area - but most likely only for drinks and possibly appetizers.\n\nIt's the perfect spot for a glass of wine or two on a warm SF afternoon.", "rating": 4, "date": "2009-10-31"}, {"excerpts": ["My chicken BLT was more like eating cardboard than anything and the potato skins were completely tasteless...bon appetite!\n\n"], "author": "Candice M.", "review": "Location: conveniently located in the Marina on Union, close to a lot of shops etc. \n\nFood: my fries were over-cooked and I had to mask the burnt taste with loads of ketchup.  My chicken BLT was more like eating cardboard than anything and the potato skins were completely tasteless...bon appetite!\n\nService: RUDE! I love it when hostesses think that they're the gatekeepers of some exotic utopia and IF you are lucky enough, they might favor you and get you a table.  Oh, and I love love LOVE when you ask your server for another napkin or a refill on your water and they 1. Look at you like you're a complete idiot and 2. React in a way that makes you feel like you're putting them out and how dare you request such an impossible task!\n\nSo...I think the one star is pretty self-explanatory :|", "rating": 1, "date": "2008-03-23"}, {"excerpts": ["Potato Skins, mmmmm!\n\n"], "author": "Erica A.", "review": "Why I like Perry's :\nThe Blood Mary, YUM!\nThe Eggs Benedict, WOWSA!\nThe Location, close enough to do a roll out.\nPotato Skins, mmmmm!\n\nWhy I dislike Perry's:\nThe Prices!\n\nWhy do I feel like I'm getting totally raked over the coals when the check comes??!!?", "rating": 3, "date": "2007-06-07"}, {"excerpts": ["I recommend the crab cakes and potato skins for appetizers; the artichoke was disappointing to the tune of it was still dirty and the dipping sauce was sub-par.  ", "The drinks were delicious and the waitress kept them flowing, although in the 2 hours we were there ", "I don't think she cracked a smile once.  ", "Since it was an all-day drinkfest, most of us opted for the burger, which was delicious and cooked exactly to my specifications.  ", "My major complaint...$28 to cut a birthday cake when our bill was already $500?  ", "Are you serious?  ", "It would have been great if they had made that more clear instead of the sticker shock we all had when the bill came."], "author": "Danielle H.", "review": "Ok, we went for a friend's birthday lunch and I'll give Perry's props for naming a drink after our group of friends and creating cute menus for the occasion.  I recommend the crab cakes and potato skins for appetizers; the artichoke was disappointing to the tune of it was still dirty and the dipping sauce was sub-par.  The drinks were delicious and the waitress kept them flowing, although in the 2 hours we were there I don't think she cracked a smile once.  Since it was an all-day drinkfest, most of us opted for the burger, which was delicious and cooked exactly to my specifications.  My major complaint...$28 to cut a birthday cake when our bill was already $500?  Are you serious?  It would have been great if they had made that more clear instead of the sticker shock we all had when the bill came.", "rating": 3, "date": "2009-04-20"}, {"excerpts": ["I'm only giving it 3 stars because I love potato skins so much and theirs were pretty tasty.  ", "Other than that, it's pretty mediocre.  ", "Nothing really stands out, but nothing was bad either.  ", "Good location though."], "author": "Jennifer H.", "review": "I'm only giving it 3 stars because I love potato skins so much and theirs were pretty tasty.  Other than that, it's pretty mediocre.  Nothing really stands out, but nothing was bad either.  Good location though.", "rating": 3, "date": "2007-07-05"}, {"excerpts": ["They make a mean pancake, a great burger and awesome potato skins.  ", "They also catered my friend's New Year's Eve party.  ", "Usually crowded and sometimes extremely loud, it is nonetheless an ideal neighborhood restaurant for a good quick meal with friends."], "author": "Michael C.", "review": "Friendly service, cold drinks and tasty food, whether for brunch or dinner.  They make a mean pancake, a great burger and awesome potato skins.  They also catered my friend's New Year's Eve party.  Usually crowded and sometimes extremely loud, it is nonetheless an ideal neighborhood restaurant for a good quick meal with friends.", "rating": 4, "date": "2008-07-13"}], "perrys slyders": [], "chicken quesadilla": [{"excerpts": ["For appetizers we had the grilled chicken quesadilla (which was good) and spicy wings (which I didn't care for at all).\n"], "author": "Janet T.", "review": "We walked to Perry's from my cousins place nearby. \nWe had 9:30 Brunch reservations today (Sunday) for myself, my cousin and her husband. \nIt was already crowded when we arrived and when we left it was PACKED. Our waitress told us it was going to be an extremely busy day with the Niner game, the Giants game and apparently a big convention in town for Oracle.\nWe started off with Mimosa's, then coffee. For appetizers we had the grilled chicken quesadilla (which was good) and spicy wings (which I didn't care for at all).\nFor brunch I had the Veggie Scramble w/potatoes which I really liked. My cousin had the French Toast and her husband had a Cobb Salad, that looked delicious.\nService was somewhat slow but our waitress was very friendly.\nThe food here is just about average, nothing memorable.\nSadly I think Perry's better days are behind them. Years (and more years) ago our gang use to bar hop here almost every weekend. Those were the good ole days!  Ha!\nThey've been a San Francisco Staple on Union St for a very long time.", "rating": 4, "date": "2014-09-28"}, {"excerpts": ["We tried a bunch of appetizers, spicy buffalo wings and tenders, grilled chicken quesadilla, calamari, and potato skins.  "], "author": "Janelle C.", "review": "Made reservations for 8 people at Perry's for dinner.  When we arrived, 5 minutes before our reservation, the wait staff told us they had a table set up for us but just took it apart and needed a few minutes to put it back together.  Not sure what that was all about but it didn't take long. \n\nWe tried a bunch of appetizers, spicy buffalo wings and tenders, grilled chicken quesadilla, calamari, and potato skins.  Your typical bar menu but everything was cooked and seasoned great, we enjoyed all of them.   \n\nShared the grilled ahi sandwich for the main which I think had mayonnaise on it that I would rather leave off next time.  Ginger gave the sandwich a fresh taste.  \n\nThis looks like a really old bar with a dirty tiled floor and dark wood.  Guess that's part of it's charm, good food, decent service but isn't anything to write home about.", "rating": 3, "date": "2011-06-05"}, {"excerpts": ["I can't really comment on the menu because I always get the chicken quesadilla, but it does have a good range of American food.  ", "I think the quesadilla is the best in the city. "], "author": "Michael M.", "review": "Perry's is a great neighborhood bar & restaurant in the Marina.  I have eaten here more often then any other place in SF.  Great for brunch, lunch or dinner. It's the type of place that when my parents come to town they go at least twice in one weekend.  \n\nI can't really comment on the menu because I always get the chicken quesadilla, but it does have a good range of American food.  I think the quesadilla is the best in the city. I also really like their tomato bisque.  \n\nGreat place to meet up with friends for a drink as well.  The bar scene is casual, but has good energy.  Last year I watched a lot of the World Cup soccer games here.  I really like their outside seating. They have heating lamps.  The seating is limited, but if you can land a spot it is great people watching.", "rating": 4, "date": "2011-02-09"}, {"excerpts": ["The only 2 things on the menu I have tried are the chicken quesadilla and the pot roast with mashed potatoes. ", "They were both so yummy! ", "Highly recommended!"], "author": "Mel C.", "review": "I have been to Perry's several times. The only 2 things on the menu I have tried are the chicken quesadilla and the pot roast with mashed potatoes. They were both so yummy! Highly recommended!", "rating": 5, "date": "2010-08-10"}], "buffalo tenders": [{"excerpts": ["Must haves: buffalo tenders w/ ranch, Cobb salad with buffalo sauce on the side (I promise it's good), sweet potato fries and the chili. \n\n"], "author": "Morgan J.", "review": "Okay Perry's... I really do like you. Honestly, you can't go wrong with this place. Is their food out of this world? No. Is it good and convenient? Yes. I come here often on Thursday nights for half price bottles of wine- they are one of the only\nPlaces in SF that does this and they have a pretty great wine list. They have four tables outside that are dog friendly and have amazing people watching. Part of me hates saying that because I don't want more people to take my table on Thursday nights! \n\nMust haves: buffalo tenders w/ ranch, Cobb salad with buffalo sauce on the side (I promise it's good), sweet potato fries and the chili. \n\nI'm only docking them from their five stars because service is totally hit or miss. Some nights I have amazing service, and some nights it's incredibly slow. Also their Sunday brunch is just okay- and the service is never good then, so don't be in any hurry when you're there. \n\nThe entire month of August 2018 they have half price bottles of wine to celebrate their anniversary!", "rating": 4, "date": "2018-08-23"}, {"excerpts": ["The buffalo tenders are somehow soggy and tough at the same time. ", "Sauce is not flavorful, it's just hot. ", "I've only eaten three and twice ", "I've bitten down on something crunchy or hard that I had to spit out, it's full of cartilage and tendons. ", "Clean your chicken properly, dang. ", "These buffalo tenders are so bad I couldn't even finish them. ", "More than half just went in the trash. ", "The mac and cheese was edible but underwhelming. ", "Needs seasoning, and aside from a sprinkling of breadcrumbs on top, it's basically indistinguishable from the frozen kind. ", "So, only three stars. ", "Would give one star if not for the delicious salmon dish."], "author": "Traci R.", "review": "I have ordered delivery from here a few times. They have this grilled salmon dish that I love. It comes with delicious sides and it's just perfect. I would give five stars just for that. But today I decided to try some of their other menu items and I'm super bummed because they are garbage. The buffalo tenders are somehow soggy and tough at the same time. Sauce is not flavorful, it's just hot. I've only eaten three and twice I've bitten down on something crunchy or hard that I had to spit out, it's full of cartilage and tendons. Clean your chicken properly, dang. These buffalo tenders are so bad I couldn't even finish them. More than half just went in the trash. The mac and cheese was edible but underwhelming. Needs seasoning, and aside from a sprinkling of breadcrumbs on top, it's basically indistinguishable from the frozen kind. So, only three stars. Would give one star if not for the delicious salmon dish.", "rating": 3, "date": "2018-09-04"}, {"excerpts": ["I've always thought their food was mediocre - except for the sweet potato fries and buffalo tenders, but I love good deal on alcohol (and their wine list is decent) away from most of the Marina bros ", "so I keep coming back, on Thursday's. ", "If you're looking for a spot to post up outside with your dog or daily specials, Perry's is your spot. ", "If you're looking for decent artichokes, custom salad orders, or even good barbecue sauce, look elsewhere. ", "The service is great, but only at night. ", "Sit at the bar or outside. ", "The back room is weird."], "author": "Erin M.", "review": "Rumor has it, Perry's has extended their 50% off bottles of wine deal from just Monday's and Thursday's to the entire month of August 2018 to celebrate 50 years in business (at least for the Union St location). I've always thought their food was mediocre - except for the sweet potato fries and buffalo tenders, but I love good deal on alcohol (and their wine list is decent) away from most of the Marina bros so I keep coming back, on Thursday's. If you're looking for a spot to post up outside with your dog or daily specials, Perry's is your spot. If you're looking for decent artichokes, custom salad orders, or even good barbecue sauce, look elsewhere. The service is great, but only at night. Sit at the bar or outside. The back room is weird.", "rating": 3, "date": "2018-08-02"}, {"excerpts": ["They have picnic table table clothes, predictable bread sticks each visit, outdoor seating that is dog-friendly, and THE BEST boneless buffalo tenders as appetizers.  ", "Yep, I said it.  ", "Test them out and see if I'm wrong. ", "I've made several of my friends believers.  ", "This is hands down a great place to spend quality time with loved ones, watch sports game (there is an awesome back room with sky lights), or just kick-back and have a few beers and relax."], "author": "Laura B.", "review": "I literally wish that UberEats, Postmates, Eat24/GrubHub, anyyyything would deliver from Perry's to my new home in Scottsdale, AZ (my new home). When you're constantly in the hustle of bustle of San Francisco, namely with the most recent year's tech explosion, it's so refreshing to have a comfortable environment that is has space, and is just -- normal.  They have picnic table table clothes, predictable bread sticks each visit, outdoor seating that is dog-friendly, and THE BEST boneless buffalo tenders as appetizers.  Yep, I said it.  Test them out and see if I'm wrong. I've made several of my friends believers.  This is hands down a great place to spend quality time with loved ones, watch sports game (there is an awesome back room with sky lights), or just kick-back and have a few beers and relax.", "rating": 5, "date": "2018-01-23"}, {"excerpts": ["Tonight's problems were that the Buffalo Wings showed up as Buffalo Tenders (horror of all horrors to the Buffalo Boy that co-habs with me), The Sliders showed up as a single Slider (did the delivery guy eat the other one??), the Iceberg Wedge showed up as, well, just an Iceberg Wedge. ", "No dressing. ", "No cheese. ", "Just a $7.50 1/3 of a head of iceberg lettuce. ", "WTF. ", "The Reuben sandwich had no dressing on it.  ", "They don't deliver booze with the buffalo tenders and plain lettuce, so there you have it.  ", "Don't say I didn't warn you. ", "You have to go to Perrys to get the booze. ", "The food then tastes better. ", "Its very simple, really."], "author": "Megan L.", "review": "OK, tonight I had an epiphany regarding Perry's.\n\nIve eaten Brunch and dinner at Perry's at least 100 times over the years.  Always a good experience, I love the Bloody Marys, the Reuben sandwiches and the Wednesday night lobster feeds.\n\nWe have ordered Perry's dinner to be delivered to our house three times.  Each time has been a major disappointment. Tonight's problems were that the Buffalo Wings showed up as Buffalo Tenders (horror of all horrors to the Buffalo Boy that co-habs with me), The Sliders showed up as a single Slider (did the delivery guy eat the other one??), the Iceberg Wedge showed up as, well, just an Iceberg Wedge. No dressing. No cheese. Just a $7.50 1/3 of a head of iceberg lettuce. WTF. The Reuben sandwich had no dressing on it.  To be fair, the tomato bisque was off-the-charts good, however.\n\nI've gotten side-tracked regarding the epiphany. It is as follows:\n\nPerry's is better when you have booze. They don't deliver booze with the buffalo tenders and plain lettuce, so there you have it.  Don't say I didn't warn you. You have to go to Perrys to get the booze. The food then tastes better. Its very simple, really.", "rating": 3, "date": "2007-09-11"}], "perrys chili": [], "vegetarian chili": [], "organic mixed greens salad": [{"excerpts": ["Love the Organic Mixed Greens Salad with pine nuts, tossed in a champagne vinaigrette (and you can add goat cheese!). ", "I haven't had a bad meal here yet. ", "But, I'd stick with the main meal, as the desserts leave me feeling a bit unsatisfied."], "author": "Meredith K.", "review": "Since I work in the neighborhood, you can find me here at least once a week. A solid 4 stars for consistently good food (-1 star for off service sometimes). The specials change weekly, and there are daily specials printed on the menu. Love the Organic Mixed Greens Salad with pine nuts, tossed in a champagne vinaigrette (and you can add goat cheese!). I haven't had a bad meal here yet. But, I'd stick with the main meal, as the desserts leave me feeling a bit unsatisfied.", "rating": 4, "date": "2010-08-10"}], "brutus caesar salad": [], "traditional cobb salad": [], "perrys chopped salad": [], "beet arugula  spinach salad": [], "southwest chicken salad": [], "black and blue steak salad": [], "perrys hamburger": [], "homemade veggie burger": [], "grilled chicken blta": [], "seared ahi sandwich": [], "perrys club sandwich": [], "reuben sandwich lunch only": [], "penne pasta": [{"excerpts": ["Petrale sole was heavenly, penne pasta fabulous and salads were fresh and perfect.  ", "Our server was professional, attentive and cheerful.  ", "Great libations, especially the Irish coffee.  ", "If you want a place to enjoy a relaxed and delicious evening, come to Perry's!"], "author": "Phyllis S.", "review": "A great classic San Francisco spot with terrific food, attentive service and wonderful atmosphere.  Petrale sole was heavenly, penne pasta fabulous and salads were fresh and perfect.  Our server was professional, attentive and cheerful.  Great libations, especially the Irish coffee.  If you want a place to enjoy a relaxed and delicious evening, come to Perry's!", "rating": 5, "date": "2018-09-03"}, {"excerpts": ["For entrees we ordered straightforward dishes, penne pasta and a hamburger. ", "But 30 min after we finished the salad the entrees were not delivered. ", "Meanwhile two other groups in the back dining room,  parties of 3 and 4 people who arrived after us, were enjoying their entrees while we waited and waited. ", "Fed up, we stood up to leave just as the dishes were brought to us. ", "We said it was too late and walked out."], "author": "Michael B.", "review": "In the past my wife and I had a decent meal here and decided to try it again for dinner after a long absence. We arrived at 8:00p and by 9:00p walked out very dissatisfied. The little food and drink we tried was poor, and the service which started strong went quite bad. To start, the breadsticks were quite stale and the iced tea was watered down. I started with a mixed green salad and asked for the extra blue cheese dressing. The greens were somewhat limp and the salad dressing was so thinly applied you could barely taste the blue cheese. For entrees we ordered straightforward dishes, penne pasta and a hamburger. But 30 min after we finished the salad the entrees were not delivered. Meanwhile two other groups in the back dining room,  parties of 3 and 4 people who arrived after us, were enjoying their entrees while we waited and waited. Fed up, we stood up to leave just as the dishes were brought to us. We said it was too late and walked out.", "rating": 1, "date": "2018-08-16"}], "spaghetti and meatballs": [{"excerpts": ["Last time I had the spaghetti and meatballs. ", "While the flavors were good, the handmade meat balls were a bit on the dry side this particular time. ", "I'm sure they would have made it right if I had asked, but it was OK ", "and I was hungry. ", "Overall, the place has a nice atmosphere and they have a decent sized bar, so you can typically find a spot. ", "If you time it right, you can be there for dinner and hang tight for the party crowd the comes in the evenings towards the weekends."], "author": "Doug B.", "review": "Every time I make it the area I typically mosey by Perry's. I go for an early dinner at the bar and have a few drinks with the local bar crowd, who typically are regulars. Last time I had the spaghetti and meatballs. While the flavors were good, the handmade meat balls were a bit on the dry side this particular time. I'm sure they would have made it right if I had asked, but it was OK and I was hungry. Overall, the place has a nice atmosphere and they have a decent sized bar, so you can typically find a spot. If you time it right, you can be there for dinner and hang tight for the party crowd the comes in the evenings towards the weekends.", "rating": 5, "date": "2017-06-15"}, {"excerpts": ["We had the quesadilla appetizers, and I had the spaghetti and meatballs (don't ask - for some reason, it just called to me).  ", "Everything was fine and pretty standard.  ", "They were able to seat us quickly which was a huge plus."], "author": "Wendy L.", "review": "When Betelnut and many of the other places on Union are full, I think that's when people go to Perry's...\n\nI went last Saturday afternoon after a full day of football watching; needless to say, I was in dire need of some food.  We had the quesadilla appetizers, and I had the spaghetti and meatballs (don't ask - for some reason, it just called to me).  Everything was fine and pretty standard.  They were able to seat us quickly which was a huge plus.", "rating": 3, "date": "2006-11-22"}, {"excerpts": ["I then proceeded with the spaghetti and meatballs. ", "Huge plate I was unable to finish. "], "author": "Diana R.", "review": "I wasn't expecting too much from this place. Surprisingly the food was decent and the venue wasn't that bad.\n\nFor the price, you get a lot of food. I started off with the buffalo wings and they are by far the hottest buffalo wings I have ever had. I then proceeded with the spaghetti and meatballs. Huge plate I was unable to finish. I was stuffed to the bone.\n\nOverall a good place to go and have a meal every now and then. Not too bad, not too good.", "rating": 3, "date": "2008-12-15"}], "sauted petrale sole muniere": [], "pepper braised lamb shank": [], "old fashioned pot roast": [], "bbq ribs": [], "pepperbraised lamb shank": [], "petite filet mignon  oz": [], "new york steak  oz": [], "macaroni and cheese": [{"excerpts": ["The clam chowder was rubbery, the macaroni and cheese was basically noodles floating in water sprinkled with bread crumbs, and the smoked chicken sandwich was credit-card size and made from standard deli meat...yet it was still hard to swallow (the $14 price tag for the sandwich alone, that is). "], "author": "Garrett M.", "review": "Went here with a group of friends. The restaurant definitely has character, which would be great if you could eat picturesque surroundings. If you came here for a quiet drink and nothing else, you'd probably come away with a better impression.\n\nHowever, we wanted dinner. The clam chowder was rubbery, the macaroni and cheese was basically noodles floating in water sprinkled with bread crumbs, and the smoked chicken sandwich was credit-card size and made from standard deli meat...yet it was still hard to swallow (the $14 price tag for the sandwich alone, that is). I'm not against spending $30 to $50 on a decent meal, but it's irksome to pay $25 for the equivalent of a Lunchables pack.\n\nIf you want to read stuff on the walls, this is a great place to sit and do so. If you want a tasty, fairly-priced meal, I don't recommend it.", "rating": 2, "date": "2007-07-16"}, {"excerpts": ["I had the big wedge salad and the macaroni and cheese which were both good.  ", "The bartender that helped us out was great.  ", "It wasn't crowded even though all of the other places on Union Street were."], "author": "Brian L.", "review": "My buddy and I had dinner here tonight.  I like the changes they made to the tv screens so that you can watch all the sports (tonight was the lakers game and the giants game) from any angle.\n\nI had the big wedge salad and the macaroni and cheese which were both good.  The bartender that helped us out was great.  It wasn't crowded even though all of the other places on Union Street were.", "rating": 3, "date": "2009-04-21"}], "cornbread": [{"excerpts": ["Perry's unique twist on this dish was that it was served alongside an amazingly satisfying piece of homemade cornbread and a side of roasted house potatoes. ", "Simply delish! ", "Complemented with coffee, this was the perfect way to begin my Sunday!"], "author": "Mansi A.", "review": "I checked out Perry's with a friend for brunch one Sunday morning. Upon walking in, you're transported to a Cheers-like, neighborhood bar serving homely food.\n\nThe service was very prompt and friendly. We got there about 11:30am and it was fine, but the place definitely got crowded by 12:30pm-1pm, so keep that in mind. They take reservations also, so I'd definitely recommended making one for prompt seating.\n\nI decided to order the huevos rancheros, and it was fantastic. Perry's unique twist on this dish was that it was served alongside an amazingly satisfying piece of homemade cornbread and a side of roasted house potatoes. Simply delish! Complemented with coffee, this was the perfect way to begin my Sunday!", "rating": 3, "date": "2011-08-16"}], "crispy french fries": [], "homemade cottage chips": [], "creamed spinach": [], "roasted fingerling potatoes": [], "sauteed vegetable of the day": [], "cock  bull ginger beer": [], "liter pellegrino sparkling water": [], "liter panna water": [], " milk": [], "tomato juice": [{"excerpts": ["It's like a bloody mary, except instead of tomato juice, there's beef bouillion. ", "Doesn't that sound gross? "], "author": "Sahra H.", "review": "So my friend Bartlett convinced me and some others that we simply HAD to have this drink that they serve at Perry's. It's like a bloody mary, except instead of tomato juice, there's beef bouillion. Doesn't that sound gross? If you think it sounds gross, then you're right because it is. \n\nI liked the crowd, though. Lots of old people and young people. Bartlett told us that he was there one a New Year's Day, and some old guy got so  drunk that he dropped his pants in the middle of the bar, and then in recompense bought the entire bar a round. Sweet, huh?", "rating": 3, "date": "2006-09-02"}, {"excerpts": ["I watched the bartender make the Bloody Mary: Salt, pepper, worcestershire sauce, well vodka, and generic tomato juice served in a 10oz goblet. ", "She goes heavy on the worcestershire, so I would request less next time. ", "I much prefer horseradish as a flavoring. ", "It was ok, not bad or good, but pricey for how not exciting it was. ", "I had the veggie omelette, which comes with home fries and toast. ", "The home fries are also not exciting. ", "They were big cubes of potato, lightly fried in oil, no herbs or seasoning. ", "I know you can be overwhelmed and underwhelmed, and it has already been asked if you can just be whelmed. ", "I was whelmed. ", "Another ok breakfast place that I wouldn't choose, but wouldn't mind if someone wanted to meet there."], "author": "Merrilee T.", "review": "We went for brunch on Christmas day, and it was pretty good. Nothing exciting. We sat at the bar, and I had a Bloody Mary and a Mimosa. I watched the bartender make the Bloody Mary: Salt, pepper, worcestershire sauce, well vodka, and generic tomato juice served in a 10oz goblet. She goes heavy on the worcestershire, so I would request less next time. I much prefer horseradish as a flavoring. It was ok, not bad or good, but pricey for how not exciting it was. I had the veggie omelette, which comes with home fries and toast. The home fries are also not exciting. They were big cubes of potato, lightly fried in oil, no herbs or seasoning. I know you can be overwhelmed and underwhelmed, and it has already been asked if you can just be whelmed. I was whelmed. Another ok breakfast place that I wouldn't choose, but wouldn't mind if someone wanted to meet there.", "rating": 3, "date": "2009-12-26"}], "napkins and utensils": [], "no napkins plates or utensils": [], "oldtime apple brown betty": [], "raisin brioche bread pudding": []}