{"breakfast burrito regular": [], "breakfast burrito special": [], "eggs any style with choice of meat": [], "oz steak and eggs": [], "item omelette": [], "items omelette": [], "fruit pancakes": [], "pigs in a blanket": [], "regular stack": [], "bagel with butter and jam": [], "bagel with hummus and tomato": [], "bagel with cream cheese sprouts tomato and onion": [], "egg": [{"excerpts": ["I got the regular breakfast burrito (eggs, cheese, sausage) which hit the spot, and my dad ordered the 2 egg breakfast. ", "Delish diner food and some of the best home fries my Dad has ever eaten (his words)! ", "Be ready to add a lot of creamer to your drip coffee - the brewed coffee was bit harsh and very bitter."], "author": "Jessica S.", "review": "I can see why this place has been around since the 60s - the place is straight and to the point. Lots of familiar food options, simple and delicious, and the staff is friendly. I can see this place getting busy during lunch time, as we went in for a late breakfast, and the line started to grow. I got the regular breakfast burrito (eggs, cheese, sausage) which hit the spot, and my dad ordered the 2 egg breakfast. Delish diner food and some of the best home fries my Dad has ever eaten (his words)! Be ready to add a lot of creamer to your drip coffee - the brewed coffee was bit harsh and very bitter.", "rating": 4, "date": "2018-10-10"}, {"excerpts": ["They have breakfast sandwiches, typical egg/potato breakfasts and regular sandwiches. ", "Service is pretty fast and friendly. ", "Wish there were more plant based options. ", "The potatoes are pretty good. ", "Prices are reasonable."], "author": "Marco M.", "review": "Conveniently located across from Mt Zion where I spend all too much time. They have breakfast sandwiches, typical egg/potato breakfasts and regular sandwiches. Service is pretty fast and friendly. Wish there were more plant based options. The potatoes are pretty good. Prices are reasonable.", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["Breakfast bagel was mediocre - very very thin strip of egg and an American cheese overload on a not very good bagel. ", "Way too expensive ($4.99) for what you get and for such a dive - there are far better breakfast sandwiches to be had all over the city. ", "Also, it's 2016 and they're cash only - what gives? ", "It's not like their prices are any lower for being cash-only"], "author": "Farhad M.", "review": "Breakfast bagel was mediocre - very very thin strip of egg and an American cheese overload on a not very good bagel. Way too expensive ($4.99) for what you get and for such a dive - there are far better breakfast sandwiches to be had all over the city. Also, it's 2016 and they're cash only - what gives? It's not like their prices are any lower for being cash-only", "rating": 3, "date": "2016-07-11"}, {"excerpts": ["for example torta cubana bbq pork chiken blt, pulled pork and they are continu making egg salad sandwich"], "author": "Jose G.", "review": "I like the god flavor and the good condiments that they use for all specific sandwiches they make every day  for example torta cubana bbq pork chiken blt, pulled pork and they are continu making egg salad sandwich", "rating": 5, "date": "2016-04-25"}, {"excerpts": ["BREAKFAST review\n\nPros:\n- egg bagel sandwich (inexpensive and delicious!)\n- friendly employees\n- quick service\n- conveniently located next to UCSF Mt Zion\n\nCons:\n- cash only\n- coffee is kept in a giant carafe that just sits there all day\n\n"], "author": "Jiann M.", "review": "BREAKFAST review\n\nPros:\n- egg bagel sandwich (inexpensive and delicious!)\n- friendly employees\n- quick service\n- conveniently located next to UCSF Mt Zion\n\nCons:\n- cash only\n- coffee is kept in a giant carafe that just sits there all day\n\nBottom line: I loved this place because it was just down the block where I lived. It's a solid choice, if you're in the area, but don't go out of your way just to eat here.", "rating": 4, "date": "2014-03-20"}, {"excerpts": ["For both, you get your choice of ham, bacon or sausage and it comes with egg and cheese.  ", "If you get the \"special breakfast burrito\" it comes with hashbrowned potatoes and salsa too, for about a dollar extra.  "], "author": "Danielle O.", "review": "Pete's Deli is growing on me, I guess.  Most of their food is just about average and their prices are a little on the high side considering there's really nothing special or gourmet about their food.  They are really popular at lunch time and the place is pretty crowded most of the time.  I guess it's because their customers like the fact that the service is fast and friendly.    \n\nSo far, I've tried the following items: \n\nTurkey sandwich with cranberry sauce: Turkey is cold.  The soft roll is blah. There's not much on the sandwich but the cranberry sauce.  Not worth the price.  \n\nBreakfast burritos and breakfast sandwiches:  These are pretty good.  You get your sandwich or burrito piping hot.  For both, you get your choice of ham, bacon or sausage and it comes with egg and cheese.  If you get the \"special breakfast burrito\" it comes with hashbrowned potatoes and salsa too, for about a dollar extra.  I think the sandwiches are more worth the price because the burritos are pretty small whether or not you get the regular or the special.\n\nMediterranean Plate: Comes with hummus, tabouleh, two medium size falafel, diced cucumber and tomatoes and a pita sliced into 4 wedges.  The taste of everything was fairly well seasoned and fresh.  I would say that this plate is worth the price (around $6 or $7) and is a good option for when you feel like having a light or vegetarian lunch.", "rating": 3, "date": "2014-09-21"}, {"excerpts": ["My favorite is the egg salad on ciabatta. ", "($5.99 on a 6 inch) ", "Still the best I've had outside my home. ", "Very reasonable prices and generous portions. ", "Fresh fruit and fruit salad made in house. ", "Always a hot entry available ie roast chicken, mashed potatoes, broccoli. ", "Made in house, very fresh, changed daily. ", "And whole roasted turkey for sandwiches or a hot meal. ", "Customers I've seen include the whole range of ucsf med staff as well as construction workers and office workers. ", "Hope this gem has many more years despite the change in city demographics. ", "The place down the block on the corner with Post certainly went commercial and upmarket with the change from the longtime owners."], "author": "Patricia L.", "review": "A neighborhood gem. I have come here for years. Since the '90s. It is a real neighborhood diner, all fresh, all cooked in house, no pretense-- getting few and far between with the gentrification of the city. Made to order sandwiches with lots of choices for fillings and breads -- including Cubano sandwich, breakfast all day, different cheese steaks (from steak prepared and cooked in house), fish/shrimp and chips. My favorite is the egg salad on ciabatta. ($5.99 on a 6 inch) Still the best I've had outside my home. Very reasonable prices and generous portions. Fresh fruit and fruit salad made in house. Always a hot entry available ie roast chicken, mashed potatoes, broccoli. Made in house, very fresh, changed daily. And whole roasted turkey for sandwiches or a hot meal. Customers I've seen include the whole range of ucsf med staff as well as construction workers and office workers. Hope this gem has many more years despite the change in city demographics. The place down the block on the corner with Post certainly went commercial and upmarket with the change from the longtime owners.", "rating": 5, "date": "2016-10-19"}, {"excerpts": ["The breakfast is your basic egg combos and sandwiches, also breakfast burritos.\n", "The lunch offers some mexican food, burgers, hot and cold sandwiches, salads and soups.  ", "Every item is always hot and fresh and tastes great!  ", "The sandwiches are stacked with meats and the salads are a filling meal in a bowl.\n", "The staff likes to keep it moving due to the long lines during lunch hour so be ready to order when it's your turn.  \n", "The house special is the \"Sleeping Pill\", a double-patty burger on a roll with all the fixins.  ", "If you finish it all, you'll definitely be seeing stars!\n", "Good food but street parking can be tough."], "author": "Pablo R.", "review": "Best deli in the area\nThis is an old skool SF deli serving the neighborhood lunch crowd.  It offers a wide menu of hot and cold breakfast and lunch items.  There's also daily specials of roast turkey, meatloaf and other hot plates.  The breakfast is your basic egg combos and sandwiches, also breakfast burritos.\nThe lunch offers some mexican food, burgers, hot and cold sandwiches, salads and soups.  Every item is always hot and fresh and tastes great!  The sandwiches are stacked with meats and the salads are a filling meal in a bowl.\nThe staff likes to keep it moving due to the long lines during lunch hour so be ready to order when it's your turn.  \nThe house special is the \"Sleeping Pill\", a double-patty burger on a roll with all the fixins.  If you finish it all, you'll definitely be seeing stars!\nGood food but street parking can be tough.", "rating": 4, "date": "2012-01-28"}, {"excerpts": ["Love the breakfast sandwiches ($3.99) and your regular plates of egg, toast and bacon/sausage. "], "author": "Yee-Shing W.", "review": "Ahhh Pete's - you're my favorite neighborhood deli. And not only are you a deli, you guys also have some really great breakfast options. Love the breakfast sandwiches ($3.99) and your regular plates of egg, toast and bacon/sausage. Good, fast, friendly and cheap.\n\nLunch options - they've got something for everyone. Sandwiches, burritos, burgers, etc etc. And yes, they have Dutch Crunch bread :)\n\nIt's easy to miss in a somewhat sleepy part of Divis but it really is a gem. CASH ONLY and closed on Sundays.", "rating": 5, "date": "2011-09-24"}, {"excerpts": ["Breakfast sandwich's like the Turkey, egg, cheese, on onion bagel is so good around $4, you get a lot!\n\n"], "author": "Juliane N.", "review": "I'm so surprised that I haven't written a review for this awesome deli cafe right across from where I work and I come here every week!\n\nThey have everything from sandwiches, breakfast (omelette's, pancakes, bagels, breakfast sandwiches, and baked items), cheese-steak, burritos, quesadilla, salads, burgers, veggie items, etc. EVERYTHING!\n\nI love coming here for lunch and sometimes grab food for dinner or the next day if it's a Sunday. \nI like their:\nChicken Cesar Salad (around $7)- BIG salad, plenty of grilled chicken, Parmesan cheese, and 3 huge slices of yummy buttery garlic bread, the reason why I get this salad is for the garlic bread! If you want croutons in your salad, make sure to let them know because they never put it on unless you tell them to.\nTurkey avocado and Swiss sandwich ($6.45)- Very good deal for a sandwich, they give you plenty of meat on any type of bread you like (if you want choices, gotta go early, they run out fast!) and fresh avocado but sometimes they put guacamole instead?\n\"The Sub\" ($6.99)- Comes with Turkey, pastrami, ham, and cheese. My second favorite when I'm craving all meat!\nBreakfast sandwich's like the Turkey, egg, cheese, on onion bagel is so good around $4, you get a lot!\n\nThey are always busy, especially during lunch time, there could be a line out the door.  Service is always friendly and fast. Remember to get that frequent card, they tend to not give you one if you don't have one already...... Friday's are double stamp day!\n\nCASH ONLY!!!!!!!!!!!!!", "rating": 5, "date": "2008-06-25"}, {"excerpts": ["The populists... the working man!  a quick and easy hardboiled egg, water, banana... no problem.  ", "A cup of coffee, a bagel sandwich, and an omelette?  "], "author": "Uncle Fishbits Aeneas X.", "review": "Coffee is not so good.... but you can tell it doesn't matter.  These people service the proleteriat.  The populists... the working man!  a quick and easy hardboiled egg, water, banana... no problem.  A cup of coffee, a bagel sandwich, and an omelette?  Give em 3 minutes!\n\nThey are a great place that gets you fed, cheap and fast.  This isn't high end, fine dining.... but for what it does and how it does it it is top notch.\n\nA local institution, it is an awesome place to rest while you have a moment and watch the community operate and thrive around you.", "rating": 4, "date": "2008-12-12"}, {"excerpts": ["the second time, however, i had an egg salad sandwich with avocado which, though nothing inspired, was cheap and quite decent.  ", "i also got a peanut butter cookie both times i went and was happy with those :", "P.  ", "i think i'll have to sample a few more menu items before actually settling in on my rating though."], "author": "Roshni R.", "review": "i'm still not sure how i feel about pete's.  been here twice now.  the first time, i had the pete's burger which was *nasty* (the bread was stale, the meat of poor quality, etc etc) and would've given the place only 2 stars.  the second time, however, i had an egg salad sandwich with avocado which, though nothing inspired, was cheap and quite decent.  i also got a peanut butter cookie both times i went and was happy with those :P.  i think i'll have to sample a few more menu items before actually settling in on my rating though.", "rating": 3, "date": "2006-09-04"}], "strips of bacon": [{"excerpts": ["That was the most offensively greasy hamburger (the \"Pete's Special\": a not-even-remotely-lean beef patty with huge half-cooked strips of bacon, swiss cheese, avocado, served on a sourdough roll) and heap of fries I've ever consumed in my entire life. ", "But it was also pretty damn tasty, and reasonably priced. "], "author": "Brendan R.", "review": "Oh my goodness. That was the most offensively greasy hamburger (the \"Pete's Special\": a not-even-remotely-lean beef patty with huge half-cooked strips of bacon, swiss cheese, avocado, served on a sourdough roll) and heap of fries I've ever consumed in my entire life. But it was also pretty damn tasty, and reasonably priced. And the service is very friendly here, too.\n\nAfter wolfing down something so literally drenched and dripping with melted animal fat and cheese, I'm now seriously considering going vegan. (but probably won't)\n\nA harrowing yet delicious dining experience. Thinking maybe I'll just get a regular sandwich next time.", "rating": 3, "date": "2012-09-22"}], "slab of ham": [], "links of sausage": [], "homestyle potatoes": [], "espresso": [], "middle eastern plate": [], "hot chefs salad": [], "cold chefs salad": [], "petes special burger": [], "mexican cheeseburger": [], "the sleeping pill": [], "pastrami cheese burger": [], "petes cheese steak": [], "mushroom cheese steak": [{"excerpts": ["I tried the mushroom cheese steak before ", "and it is absolutely the best damn cheesesteak i have tasted.  ", "Way ", "Way better then the Cheese steak shop across the street.  ", "I got the 10in ", "and it was enought food for 2 hungry people.  ", "they pile on the meat and cheese and it is oh so tasty.  ", "The price may seem a little high, but it is well worth it.   ", "Matter of fact, I'm gonna get me one in about 15 minutes on my lunch break.   ", "I haven't tried anything else, they do have an extensive menu and the hot food looks really good.  ", "Only draw back is the huge line that can go out the door at times, ", "Some advice, CALL AHEAD!!"], "author": "Pedro N.", "review": "I haven't been a regular patron of this deli, but I do visit on occasion.  I work at one of the hospitals nearby so the location is convenient.  I tried the mushroom cheese steak before and it is absolutely the best damn cheesesteak i have tasted.  Way Way better then the Cheese steak shop across the street.  I got the 10in and it was enought food for 2 hungry people.  they pile on the meat and cheese and it is oh so tasty.  The price may seem a little high, but it is well worth it.   Matter of fact, I'm gonna get me one in about 15 minutes on my lunch break.   I haven't tried anything else, they do have an extensive menu and the hot food looks really good.  Only draw back is the huge line that can go out the door at times, Some advice, CALL AHEAD!!", "rating": 4, "date": "2008-06-02"}], "bbq cheese steak": [], "chicken cheese steak": [], "bacon cheesesteak": [{"excerpts": ["I got the bacon cheesesteak and my husband got the bbq cheesesteak and some fries. \n", "MMMMmmm were they good. ", "And good price too! "], "author": "Viv D.", "review": "My husband had a dr appt nearby and I was gettin hungry so I got on yelp to find a nearby place to eat and came across this place. We walked on over there and ordered some cheesesteak sandwiches. \nI got the bacon cheesesteak and my husband got the bbq cheesesteak and some fries. \nMMMMmmm were they good. And good price too! SOOOO much better than that shitty place called the cheesteak shop!\n\nI was suprised on all the sandwich/lunch/food selections they had. I thought it was just gonna be a small cold deli. \n\nId def. go here again.\n\nSucky thing is, they only accept cash. \nI would have thought theyd take card as it seems to be in a busy businessy area.", "rating": 4, "date": "2009-10-07"}], "teriyaki cheese steak": [], "plain steak no cheese": [], "italian cheesesteak": [], "lemon chicken breast": [], "teriyaki chicken breast": [], "bbq chicken breast": [], "hot roast beef": [{"excerpts": ["The chicken pesto sandwich is excellent, as is the hot roast beef sandwich and their tuna salad.  ", "The turkey sandwiches always seemed a bit bland, so I gave up on those, but most everything else is solid.  ", "Despite the small size of the \"kitchen\" (you can hardly call it that), Pete's has a very comprehensive menu for both breakfast and lunch.  ", "The only thing that's not very good there is the coffee, and the seating/atmoshpere is strictly functional - I usually get my grub to go."], "author": "Green T.", "review": "Thanks to the nearby medical buildings, this place gets PACKED at lunch time during the week.  And rightfully so.  The chicken pesto sandwich is excellent, as is the hot roast beef sandwich and their tuna salad.  The turkey sandwiches always seemed a bit bland, so I gave up on those, but most everything else is solid.  Despite the small size of the \"kitchen\" (you can hardly call it that), Pete's has a very comprehensive menu for both breakfast and lunch.  The only thing that's not very good there is the coffee, and the seating/atmoshpere is strictly functional - I usually get my grub to go.", "rating": 4, "date": "2008-07-16"}], "hot link": [], "grilled ham and cheese": [{"excerpts": ["Hands down the best grilled ham and cheese sandwich on sliced sourdough that I have ever had. ", "Such a simple sandwich yet so good. ", "Don't be plain, get it with everything on it."], "author": "Michelle L.", "review": "Hands down the best grilled ham and cheese sandwich on sliced sourdough that I have ever had. Such a simple sandwich yet so good. Don't be plain, get it with everything on it.", "rating": 5, "date": "2016-05-16"}, {"excerpts": ["i got a grilled ham and cheese and was so disgusted at the greasiness that i couldnt even eat half. ", "i tried a turkey burger and that was MUCH better. ", "well-made and a HUGE patty! ", "im curious to try their other sandwiches, like the thanksgiving one with turkey and cranberry sauce. ", "for now, though, this place is just my go-to for a random snack if im hungry walking to the bus. ", "overpriced and random assortment of snacks, but there's a variety nonetheless. "], "author": "Stephanie C.", "review": "the guy who works the register is so chill and nice, so i gotta give a star just for him. as for the food, i still have yet to decide. i got a grilled ham and cheese and was so disgusted at the greasiness that i couldnt even eat half. i tried a turkey burger and that was MUCH better. well-made and a HUGE patty! im curious to try their other sandwiches, like the thanksgiving one with turkey and cranberry sauce. for now, though, this place is just my go-to for a random snack if im hungry walking to the bus. overpriced and random assortment of snacks, but there's a variety nonetheless. lots of luna bar and cliff bar flavors to choose from :)\n\nheads up: CASH ONLY - there's an ATM outside but you have to pay a fee to use it", "rating": 3, "date": "2011-11-06"}], "petes classic hamburger": [], "bacon burger": [], "teriyaki burger": [], "meatball sandwich with swiss": [], "fresh roast pork loin sandwich": [], "muffaletta sandwich": [], "bbq pork sandwich": [], "fresh mash potatoes": [], "side of veggies": []}