{"julies ultimate": [], "decaf sumatra": [], "decaf swiss water peru": [], "peru light": [{"excerpts": ["Pro tip: if you're looking for a good caffeine kick/pick-me-up, order the peru light! ", "It's not on the menu but the employees tipped me off to it, and it's been a lifesaver."], "author": "Angela L.", "review": "The best Philz location in the city! Much larger than most, and the service is infinitely better than the Philz only a few blocks away on Van Ness. I always pop by here either before my day starts or on my lunch break, and even with a long line ahead of me, never have to wait too long for my coffee. Pro tip: if you're looking for a good caffeine kick/pick-me-up, order the peru light! It's not on the menu but the employees tipped me off to it, and it's been a lifesaver.", "rating": 5, "date": "2015-02-24"}], "cardamom ground": [], "anise": [], "blends": [{"excerpts": ["My recommendations:\n- My favorite blends to drink black are probably Philtered Soul and Hazelnut.\n", "- ", "Sometimes I like doing half Philtered Soul and half Yerba Mate, which gives the coffee a more herbal flavor. ", "Not everyone's cup of tea (haha get it), but it's an interesting alternative ", "if you wanna try something different.\n", "- If you want something on the sweet side, go for a White Christmas - 1/2 Greater Alarm + 1/2 Hazelnut with cinnamon and nutmeg in the filter, sweet and creamy.\n", "- On a hot day, look no further than the Iced Coffee, extra sweet, extra creamy. ", "Terrible for the arteries, wonderful for the soul ", ":) ", "The Mint Mojito and iced Mocha Tesora are also great options!\n", "- The food here is good, but pricey. ", "If I wanna treat myself, I'll get the avocado toast with egg."], "author": "Joe M.", "review": "This Philz is very busy, as it serves everyone working near Civic Center. It's fairly spacious with a variety of seating options, which is great for meeting up or just getting some work done. I've heard that were issues with rowdy homeless people coming in and now they have a security guard posted at the entrance, but I've never had an issue and I feel like this is unnecessary (I seem to recall a former barista writing an open letter online regarding similar issues at one of their South Bay stores). Parking is exactly what you'd expect for such a busy part of the city, but much better on Sundays when it's free all day and no one is around.\n\nMy recommendations:\n- My favorite blends to drink black are probably Philtered Soul and Hazelnut.\n- Sometimes I like doing half Philtered Soul and half Yerba Mate, which gives the coffee a more herbal flavor. Not everyone's cup of tea (haha get it), but it's an interesting alternative if you wanna try something different.\n- If you want something on the sweet side, go for a White Christmas - 1/2 Greater Alarm + 1/2 Hazelnut with cinnamon and nutmeg in the filter, sweet and creamy.\n- On a hot day, look no further than the Iced Coffee, extra sweet, extra creamy. Terrible for the arteries, wonderful for the soul :) The Mint Mojito and iced Mocha Tesora are also great options!\n- The food here is good, but pricey. If I wanna treat myself, I'll get the avocado toast with egg.", "rating": 5, "date": "2018-02-19"}, {"excerpts": ["Iced Mint Mojitos, Lattes, Tesora, and Sooo Good are just a few of their blends that I noticed on their menu.  ", "I got their Philtered Soul, which is their medium dark roast that is supposed to be sweet & nutty.  ", "It's definitely nutty.  ", "For all you hazelnut fans, this is for you.  ", "I loved it.  "], "author": "Mel C.", "review": "Voted Best Coffee In SF!!!  \n\nStrong and bold...Philz has the right stuff.  Looking for a quick boost of energy?  Philz Coffee has you covered.  I usually prefer my coffee simple...black with no sweetener or an Americano with no sweetener. Philz has my type of coffee and a lot more.  Iced Mint Mojitos, Lattes, Tesora, and Sooo Good are just a few of their blends that I noticed on their menu.  I got their Philtered Soul, which is their medium dark roast that is supposed to be sweet & nutty.  It's definitely nutty.  For all you hazelnut fans, this is for you.  I loved it.  This cup of Joe came with an instant buzz without the crash or caffeine high.  \n\nPS: This Philz is spacious, clean, and the staff was great.  Too bad Philz isn't in Las Vegas.  Too bad for me.", "rating": 4, "date": "2014-06-06"}, {"excerpts": ["They DO have some good blends that is tasty coffee they also have some bitter choices . ", "Philz food menu expanded . ", "Good pastries \n", "They are much better than the crappy donut shop coffee across the street\n", "The Coffee Mill on the other corner has a cup for a reasonable price and the taste varies but the caffeine fix is quite  ", "powerful.and is a couple notches over the donut shop crap ", "but it is bitter most of the time .\n", "George and Lennie a block over has Ritual Coffee Company  espresso and a great drip coffee from Ritual ", "no huge menu ", "but it works. ", "G&L prices compete with Philz.  ", "Ritual roasts on the 1000 block of Howard giving the block a great smell."], "author": "Tim G.", "review": "I DO NOT like them controlling  the  amounts of cream and sugar.\nReally Philz try out a cream and sugar bar .  \nThey DO NOT have reasonable prices but occupy a high rent spot . \nThey DO have some fanatic customers who swear by Philz  \nThey DO have some good blends that is tasty coffee they also have some bitter choices . Philz food menu expanded . Good pastries \nThey are much better than the crappy donut shop coffee across the street\nThe Coffee Mill on the other corner has a cup for a reasonable price and the taste varies but the caffeine fix is quite  powerful.and is a couple notches over the donut shop crap but it is bitter most of the time .\nGeorge and Lennie a block over has Ritual Coffee Company  espresso and a great drip coffee from Ritual no huge menu but it works. G&L prices compete with Philz.  Ritual roasts on the 1000 block of Howard giving the block a great smell.", "rating": 3, "date": "2016-11-24"}, {"excerpts": ["What Philz does have is about 20 different blends that they will grind on the spot and make a one off cup just for you. "], "author": "Brandon D.", "review": "Philz coffee is damn good!  You're not going to find a bunch of crazy options here. What Philz does have is about 20 different blends that they will grind on the spot and make a one off cup just for you. They use a pour over method to brew coffee one cup at a time. \n\nNext time you need a cup of Joe - give Philz a shot - you won't be disappointed!", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["I also don't see the need for so many different blends; I suspect Phil ", "(I assume there is or was a Phil, right?) "], "author": "Jim D.", "review": "I rarely have more than my one cup of coffee at home in the morning (Graffeo dark roast), but on occasion I'll treat myself to an espresso in the afternoon.  Philz doesn't serve espresso, though. I understand that they'd want to distinguish themselves from all of the other coffee shops, but I wasn't crazy about having to get a whole cup of coffee (too much caffeine for the afternoon). I decided to get it anyway and not finish the cup, and ordered \"Jacob's\" dark roast.\n\nAll of the coffee is made to order, which isn't a bad thing, but what's up with not taking a name or giving you a number when there are dozens of others waiting for their coffee?  \n\nThe coffee was good, but nothing to rush back for. I also don't see the need for so many different blends; I suspect Phil (I assume there is or was a Phil, right?) would be fine with just light, dark, or mixed, and does this to cater to the clientele's need for their own special preferred choice.  \n\nNot planning on rushing back, but will go there in a pinch (i.e., if I need a jolt and the only alternative is Starbucks). Too precious if you ask me.", "rating": 3, "date": "2017-04-23"}, {"excerpts": ["Unique, custom-made blends, enriched with a special mixture of cream and/or sugar, customized to perfection by friendly baristas - this is Philz.\n\n"], "author": "Sebastian F.", "review": "If you're a native Bay Area guy or gal, you probably know everything about Philz Coffee already. If you're a new addition to the area like me, you learned it by now. And if you're here for the first time, then don't look any further - this is what it's about when people talk about the fantastic coffee of San Francisco.\n\nUnique, custom-made blends, enriched with a special mixture of cream and/or sugar, customized to perfection by friendly baristas - this is Philz.\n\nAnd if you're in town for only a few days, save all of that touristy stuff for laterz. Philz awaitz you.\n\nPS: Great location - spacious with lots of seating, tablez, and couchez.", "rating": 5, "date": "2014-07-25"}, {"excerpts": ["Ordered one of the specialty blends.  ", "The paper cup I received after a very long wait was filled to the brim.  ", "I asked for a cup collar, but they had none. "], "author": "David S.", "review": "Very disappointed.  Ordered one of the specialty blends.  The paper cup I received after a very long wait was filled to the brim.  I asked for a cup collar, but they had none. Just picking up the cup caused coffee to slosh over the brim, scalding my hand.\n\nDid I mention overpriced?  I am as big a coffee snob as the next guy (or more so), but the coffee that was not used to parboil my fingers did not taste particularly special.  Hopes for a transcendent coffee experience:  rudely dashed.", "rating": 2, "date": "2015-07-17"}, {"excerpts": ["Will probably be stopping by a lot more and try out different blends."], "author": "Thomas M.", "review": "Super cool place, great coffee. First time going to Philz, the baristas were incredibly nice and helpful helping me get the best coffee possible. Will probably be stopping by a lot more and try out different blends.", "rating": 5, "date": "2017-07-14"}, {"excerpts": ["This place had a bunch of different blends, which was pretty good.  ", "The mint mojito ice coffee is pretty decadent.  ", "Loved it.  "], "author": "Richie W.", "review": "Super friendly.  This place had a bunch of different blends, which was pretty good.  The mint mojito ice coffee is pretty decadent.  Loved it.  Get it with less sugar... \n\nI had their Ambrosia Coffee of the Gods, black.  Medium roast.  It was definitely on the acidic side.  I'd probably temper it down with a little cream next time.  I typically take my coffee black, but this one was definitely a little strong.\n\nThe setup is a little different than other coffee places.  You order first with a barista, then pay at the cashier after.  I'm too used to Starbucks / Coffee Bean where you pay at the cashier, who takes your order. \n\nThe decor is pretty cool. I like the touch of having random facts about your barista pasted on the chalkboards underneath them.", "rating": 4, "date": "2013-12-05"}, {"excerpts": ["The blends are various and delicious. ", "The price is really reasonable for what they offer ", "and I love the environment", ", it's everything I'm looking for in a place to drink great coffee regularly"], "author": "Ruchit K.", "review": "I'd kill to have this at my university. They'd put every coffeehouse out of business and I'd go every day, no nonsense. The blends are various and delicious. The price is really reasonable for what they offer and I love the environment, it's everything I'm looking for in a place to drink great coffee regularly", "rating": 5, "date": "2015-05-25"}, {"excerpts": ["Great blends, great Batistas.  ", "I come here all the time. ", "Definitely the best coffee near the civic center area."], "author": "Anandh V.", "review": "This is one coffee chain (local) I wouldn't avoid. Great blends, great Batistas.  I come here all the time. Definitely the best coffee near the civic center area.", "rating": 5, "date": "2015-01-09"}], "decaf": [{"excerpts": ["A chai tea with almond milk (too watered down last time) or a decaf Ethiopian, a bold blend with a silky smooth aftertaste. "], "author": "Janice C.", "review": "Hello Philz.\n\nWant to know how our Sunday morning routine looks like? wake up, snooze for 30 mins and finally get out of bed to grab our cups of love at Philz. \n\nThis has become our go-to location as of late, not the prettiest neighborhood, but it has plenty of street parking, spacious seating areas, flaky butter croissants from Starter Bakery and strong wifi. \n\nHe makes fast decisions when it comes to getting caffeinated. A Tantalizing Turkish 99% of the time.  I stand there and I peruse the whole menu, my choices usually gear towards the Mint Mojito on warm days, but rainy days call for something hot. A chai tea with almond milk (too watered down last time) or a decaf Ethiopian, a bold blend with a silky smooth aftertaste. I don't need caffeine because I'm already bubbly even without it. \n\nThanks for being part of our Sunday. See you soon!", "rating": 4, "date": "2014-12-03"}, {"excerpts": ["Lately I've been doing the decaf thing to take a break ", "and there's no difference in quality.  ", "One of these days I'll try their scones...."], "author": "Ben K.", "review": "Best coffee in San Francisco for me.  Beats out Sightglass and Fourbarrel - and I can get it at multiple locations.  I'm still a bit partial to the Van Ness location for some reason, but this one has tons of space to work or relax.  \n\nFree Wifi and electric outlets should be enough to bring you in here.. Lately I've been doing the decaf thing to take a break and there's no difference in quality.  One of these days I'll try their scones....", "rating": 5, "date": "2015-04-27"}, {"excerpts": ["Tasty coffee with a variety of roasts; dark, medium, and light along with the best selection of decaf coffees I've ever seen. ", "Personal favorite is Amborisa of the Gods. ", "Only complaint is that when ordering coffee it could be hotter, but I also realize coffee shops might be leery of serving coffee too hot in case someone spills. ", "As for the food offerings the selection is limited but a nice bonus is the selection if breakfast burritos which aren't bad. ", "As for the staff they're friendly and efficient. ", "The location itself isn't the greatest but  ", "riff raff seem to stay away for the most part, perhaps because cops are always ordering coffee. ", "Definitely roomie and more chill ", "then the nearby Van Ness location."], "author": "Sabrina D.", "review": "Tasty coffee with a variety of roasts; dark, medium, and light along with the best selection of decaf coffees I've ever seen. Personal favorite is Amborisa of the Gods. Only complaint is that when ordering coffee it could be hotter, but I also realize coffee shops might be leery of serving coffee too hot in case someone spills. As for the food offerings the selection is limited but a nice bonus is the selection if breakfast burritos which aren't bad. As for the staff they're friendly and efficient. The location itself isn't the greatest but  riff raff seem to stay away for the most part, perhaps because cops are always ordering coffee. Definitely roomie and more chill then the nearby Van Ness location.", "rating": 5, "date": "2016-05-22"}, {"excerpts": [": Pair this one with a decaf, I like Sumatra, for a little less buzz in the afternoon!\n"], "author": "Suzanne B.", "review": "A wonderful little coffeehouse mecca in the Civic Center... \n\nI discovered this gem of a coffeehouse when I interviewed for my job last year. After drinking my first Jacob's Wonderbar (sweet & creamy, on the sweet side), I was immediately hooked. I've now become a regular for the last four months. The staff is wonderful -- they make an effort to get to know you, and all of them seem to  go out of their way to serve your coffee with a smile! Their pastries and bagels are excellent as well. I'm particularly fond of their jalepeno bagels (a new addition) and their bacon and egg breakfast sandwich.\n\nRecommended brews:\nDark Roast: JACOB'S WONDERBAR (seriously, my all-time favorite dark roast!) \n\nLight: \nNew Manhattan: this one seems to be a favorite with the staff!\nCanopy of Heaven\nSoo Good: Honestly, lives up to the name!\n\nMedium:\nIt'z The Best: Pair this one with a decaf, I like Sumatra, for a little less buzz in the afternoon!\nPhiltered Soul\nTesora\n\nIced/Hot: \nGinger Snap: forever now, my go-to, my absolute number one with a ginger-flavored bullet. This has overtaken the PSL as my spicy/sweet coffee drink of choice. PURE LOVE, PEOPLE.", "rating": 5, "date": "2016-05-01"}, {"excerpts": ["The menu is extensive and includes an ample number of decaf options which is unusual.  ", "They are also more than willing to customize a drink without batting an eye or giving attitude.  ", "Great coffee!!"], "author": "Andrea L.", "review": "This place is amazing and I am glad I don't live or work too nearby any of its locations otherwise I would be here everyday multiple times per day.  \n\nThe baristas are incredibly friendly, patient, and helpful.  The menu is extensive and includes an ample number of decaf options which is unusual.  They are also more than willing to customize a drink without batting an eye or giving attitude.  Great coffee!!", "rating": 4, "date": "2015-02-01"}, {"excerpts": ["(The first time I asked for 1/2 decaf, they were cool in helping find something I would like.)\n\n"], "author": "lynn t.", "review": "I LOVE this Philz. Of course, Philz coffee is great, but this particular location is the BEST. The baristas/staff are super nice... Not pretentious... Patient and super helpful if I want something different & not sure. (The first time I asked for 1/2 decaf, they were cool in helping find something I would like.)\n\nI've been to other Philz & thought people there were standoffish, so I really appreciate how friendly they are here.\n\n(If you're new to Philz.... take your time. Ask the barista for suggestions. DON'T get the hot chocolate (yuck!). Personally, I think they make their tea too strong by default, but I asked them to adjust it and it was perfect! If you really don't know what you want and like something a bit sweet & creamy - get an Iced Mint Mojito. I suggestion drinking with the lid on to help filter some of the chunks of mint leaves, but YUM!)\n\nThe neighborhood has character. Only once have I seen a panhandler enter Philz & saw an employee quickly approach as ask her to leave. \n\nIt also seems to be getting BUSIER - especially weekday mornings during coffee break time. :)", "rating": 5, "date": "2014-10-22"}, {"excerpts": ["I love that they have decaf french roast. ", "I kept asking my husband if it was decaf since they're coffee is pretty strong, otherwise I'd be awake for days!! ", "One of the baristas, who made the coffee, was very friendly  but the cashier, not so much."], "author": "Lori L.", "review": "My husband is a fan of Philz so when we saw the place, we had to go in! Place was full until closing time; an indication that it's a good place to hangout or get work done.  I love that they have decaf french roast. I kept asking my husband if it was decaf since they're coffee is pretty strong, otherwise I'd be awake for days!! One of the baristas, who made the coffee, was very friendly  but the cashier, not so much.", "rating": 4, "date": "2013-10-16"}], "specialty": [{"excerpts": ["This is an excellent choice for specialty coffees. ", "I've had the Tosora and the Mint Mojito and baklava (random choice, but it looked great) ", "and they've all been delicious. ", "I also appreciate the patience of the staff as I stared at the foreign menu. ", "Added bonus; they have sugar and milk options, which is great because I'm lactose intolerant ", "so I could get almond milk. ", "I definitely recommend this spot!"], "author": "Erica H.", "review": "This is an excellent choice for specialty coffees. I've had the Tosora and the Mint Mojito and baklava (random choice, but it looked great) and they've all been delicious. I also appreciate the patience of the staff as I stared at the foreign menu. Added bonus; they have sugar and milk options, which is great because I'm lactose intolerant so I could get almond milk. I definitely recommend this spot!", "rating": 5, "date": "2017-10-08"}, {"excerpts": ["I was recommended to Philz to try the Mint Mojito Specialty Coffee. ", "It's one of their signatures, a sweet and creamy iced coffee with mint leaves, but I just wasn't a fan of mint in my coffee (personal preference). ", "I tried it and then opted for the Gingersnap specialty coffee which had a little hint of spice ", "but I enjoyed it. ", "It comes iced ", "but I would actually request it hot next time. ", "The staff was friendly and it was pretty quick, definitely worth trying!"], "author": "Victoria E.", "review": "Located in a prime area, this place gets quite busy. Many come here to study or do work on their laptops so the tables get taken fast. I was recommended to Philz to try the Mint Mojito Specialty Coffee. It's one of their signatures, a sweet and creamy iced coffee with mint leaves, but I just wasn't a fan of mint in my coffee (personal preference). I tried it and then opted for the Gingersnap specialty coffee which had a little hint of spice but I enjoyed it. It comes iced but I would actually request it hot next time. The staff was friendly and it was pretty quick, definitely worth trying!", "rating": 4, "date": "2016-03-02"}, {"excerpts": ["Ordered one of the specialty blends.  ", "The paper cup I received after a very long wait was filled to the brim.  ", "I asked for a cup collar, but they had none. "], "author": "David S.", "review": "Very disappointed.  Ordered one of the specialty blends.  The paper cup I received after a very long wait was filled to the brim.  I asked for a cup collar, but they had none. Just picking up the cup caused coffee to slosh over the brim, scalding my hand.\n\nDid I mention overpriced?  I am as big a coffee snob as the next guy (or more so), but the coffee that was not used to parboil my fingers did not taste particularly special.  Hopes for a transcendent coffee experience:  rudely dashed.", "rating": 2, "date": "2015-07-17"}, {"excerpts": ["Despite the price, it's likely I will come back again for their quality and specialty coffee. ", "After all everything is more expensive in the city anyway."], "author": "Cindy S.", "review": "Being from Sacramento I had been waiting to try Philz Coffee for a long time. I can't tell you how many facebook and instragram posts I see from friends having drinks at Philz on a weekly basis. I have to admit my visit to Philz fulfilled expectations of great tasting quality coffee with friendly service. I was intrigued by the different systems and everything going on behind the counter. While it there wasn't a long wait it took a little over 8 minutes to actually get our drink. I loved the flavor but they seemed kinda pricy. The large was $5 and it was about the size of a medium or small (since it was filled with a lot of ice) everywhere. Despite the price, it's likely I will come back again for their quality and specialty coffee. After all everything is more expensive in the city anyway.", "rating": 4, "date": "2014-06-30"}, {"excerpts": ["I initially tried the mint mojito iced coffee because its the signature specialty drink everyone raves about... ", "but you know what? ", "I didn't like it so much. ", "Not even Philz's way. ", "What I actually love is the ecstatic iced coffee. ", "Wow. ", "I like more traditional coffee flavors and more mocha, buttery and nutty flavors. ", "This coffee has a blend of beans that has all of that! "], "author": "Maureen B.", "review": "This is just an overall review for Philz and all their locations. \n\nI. love. Philz. \n\nI initially tried the mint mojito iced coffee because its the signature specialty drink everyone raves about... but you know what? I didn't like it so much. Not even Philz's way. What I actually love is the ecstatic iced coffee. Wow. I like more traditional coffee flavors and more mocha, buttery and nutty flavors. This coffee has a blend of beans that has all of that! Can't order anything else.\n\nAt every Philz, everyone is friendly and attentive. I like that after my drink is made, they always let me taste it and make sure that it's just the way I like it. :) (sweetened with WHOLE milk. yup!)\n\nOne time, I was at the Mission location and actually met Phil! He was just standing there randomly hanging out outside the store and I recognized him from his Instagram. He's a cool guy who has great coffee. \n\nLike all great coffee shops in this caffeine driven city, its not cheap, but it's well made coffee and so delicious. I go maybe once a week. Treat yoself!", "rating": 5, "date": "2014-09-13"}, {"excerpts": ["I've had Philz before, just never their specialty drinks. ", "Anyway, I thought it was good, although way too heavy for me....", "I'll sub-in fat free milk next time and ", "maybe give it another shot ", ":)"], "author": "Asmita J.", "review": "My brother is in love w their mint mojitos and convinced me to try it. I've had Philz before, just never their specialty drinks. Anyway, I thought it was good, although way too heavy for me....I'll sub-in fat free milk next time and maybe give it another shot :)", "rating": 4, "date": "2014-04-03"}], "varietals": [], "contigo black matte large tumbler": [], "contigo large tumbler": [], "black tshirt": [], "logo tshirt": [], "original brown tshirt": [], "ceramic mug": []}