{"tantalizing turkish": [{"excerpts": ["My go-to drink is: small cup of Tantalizing Turkish with medium honey and medium creamer."], "author": "Muhammad U.", "review": "This Philz is one of my favorite ones to go to. At first, the location seemed a bit out of the way for me but when I worked about a 5 minutes walk from this place, it made the perfect break and you get a delicious cup of coffee!\n\nIf you've never been to any Philz, just go to one, all Philz will carry about the same things when it comes to coffee and teas, some will carry different desserts but that's usually not a big deal for me. \n\nThe famous one cup at a time process for making coffee definitely earns the $3-4 price. When you get to a Philz, you'll notice baristas making coffees and they'll signal you to order. \n\nOrdering is pretty simple, pick a type of coffee you want, how sweet and how creamy you want. Pro-tip: for sweetening the coffee, you can get it with whatever type of sweetener, like sugar, honey, agave, Splenda, or nothing and also how much of it you want. My favorite way to sweeten is to use about half the average amount of honey. Same goes for creamer, you can choose milk, half and half, almond, and depending on where you go, other options as well. \n\nMy go-to drink is: small cup of Tantalizing Turkish with medium honey and medium creamer.", "rating": 5, "date": "2018-01-24"}, {"excerpts": ["I highly recommend the Tantalizing Turkish with cream - very balanced, herbaceous and is topped with a mint leaf! \n\n"], "author": "James S.", "review": "Although I didn't get a space to do my work and had to settle for the bench, the coffee was still good enough for a five-star. \n\nIt's a great atmosphere and has lively, energizing music. One of the coolest things is getting your own barista, who makes your drink as they tell you interesting stories. I highly recommend the Tantalizing Turkish with cream - very balanced, herbaceous and is topped with a mint leaf! \n\nDefinitely feelin' Philz.", "rating": 5, "date": "2016-04-08"}, {"excerpts": ["Standouts: Jacob's Wonderbar Brew, Tantalizing Turkish, Mocha Tesora, and Yerba Mate."], "author": "Clare B.", "review": "Excellent drip coffee and the mint leaves are a nice touch. Keep in mind the mint leaves go into every drink, so you must request it without if it's not your thing. The coffee is brewed to order and the Baristas put a lot of care into making each individual cup. Once done, they allow you to taste for approval. You can ask them to sweeten it, reduce sweetness, or whatever your little heart desires. The Baristas always have loads of energy and so much enthusiasm no matter what time of the day, so it's a nice change from the dead stares and outright disdain for customer service you so often see at some of the other coffee shops nearby.\n\nStandouts: Jacob's Wonderbar Brew, Tantalizing Turkish, Mocha Tesora, and Yerba Mate.", "rating": 4, "date": "2014-09-27"}, {"excerpts": ["I ordered the small size of the Tantalizing Turkish this time, and the barista let me know he could make it half-caffeinated. ", "I still couldn't fall asleep until 2 haha,, but ", "no jitters and it tasted&smelled wonderful. "], "author": "Aleena S.", "review": "First time I went to Philz I ordered the large size of Jacob's WonderBar which was just delicious but got me very jittery. I ordered the small size of the Tantalizing Turkish this time, and the barista let me know he could make it half-caffeinated. I still couldn't fall asleep until 2 haha,, but no jitters and it tasted&smelled wonderful. I also got a peanut butter cookie which wasn't chewy like they usually are, and I really enjoyed that as well. \n\nWanted to edit my review because I ordered the Tesora and it tasted very sour..added milk which did not help and instead covered up the nutty roasted flavor :(( was not satisfied with the visit..will stick to dark roast perhaps?", "rating": 4, "date": "2014-09-23"}, {"excerpts": ["Had the Tantalizing Turkish coffee and a fruit danish. ", "I'm by no means ", "a coffee snob ", "but this was incredible &totally worth the 3 bucks for a small cup! ", "Hands down the best coffee I have ever had. ", "It makes starbucks tast like hotel room made hog slob. ", "The danish was awesome as well. ", "The coffee and tea selection is huge. ", "If you want good coffee... keep walking past starbucks."], "author": "Scott C.", "review": "Phil takes this coffee very seriously. Had the Tantalizing Turkish coffee and a fruit danish. I'm by no means a coffee snob but this was incredible &totally worth the 3 bucks for a small cup! Hands down the best coffee I have ever had. It makes starbucks tast like hotel room made hog slob. The danish was awesome as well. The coffee and tea selection is huge. If you want good coffee... keep walking past starbucks.", "rating": 5, "date": "2014-06-07"}, {"excerpts": ["not this is very hard to find as everything is very good) is tantalizing Turkish.. \n", "They are quick, efficient and friendly.. ", "I love Philz and I can never have enough of their coffees.. ", "Well done!!!"], "author": "Seda M.", "review": "They know what they are doing; my review is not specific to this particular location but it is about overall service and coffee that Philz provides..\nFirst and foremost all of their coffees are u unbelievably amazing.. You can't go wrong with any of them..2 of my favorites are Tesora and filtered soul.. My least favorite (believe it or not this is very hard to find as everything is very good) is tantalizing Turkish.. \nThey are quick, efficient and friendly.. I love Philz and I can never have enough of their coffees.. Well done!!!", "rating": 5, "date": "2013-09-16"}, {"excerpts": ["Some of my favorite roasts are the Tantalizing Turkish and New Manhattan.  ", "The turkish is a dark roast, great for coffee lovers with strong taste preferences.  ", "It's especially great when they add in some cream and mint.  ", "As for the New Manhattan, it's a medium/light roast that I like to enjoy straight up, nothing added.  "], "author": "Alvin Y.", "review": "Philz is a great institution in San Francisco and I was happy to see that they opened up a location in mission bay.  Although I don't live in walking distance and have limited street parking, I still manage to drop by for morning coffees and love their selection.  Some of my favorite roasts are the Tantalizing Turkish and New Manhattan.  The turkish is a dark roast, great for coffee lovers with strong taste preferences.  It's especially great when they add in some cream and mint.  As for the New Manhattan, it's a medium/light roast that I like to enjoy straight up, nothing added.  I usually go back and forth between these two and try others whenever the mood strikes.\n\nThe location itself is a block from Caltrain, so it's nice to pick it up before hopping on (if you commute down south).  Otherwise, the other options if its not walking distance is MUNI or sometimes I just drive into the Safeway lot, park and walk over.  If you buy the min $5 in Safeway, validation is free.\n\nThey have free wifi, which is great, but it's intermittently out.  That seems to be the case for several coffee shops I've been to, til they finally get 4G up and running and into all devices, this'll what you'll have to deal with...", "rating": 4, "date": "2012-05-13"}, {"excerpts": ["Recently tried their tantalizing turkish, and I think I've found my new favorite here."], "author": "H K.", "review": "Love coming to this one once in a while, and sit outside with my perfect cup of coffee. The batistas seem really happy here, even though it gets super busy. Recently tried their tantalizing turkish, and I think I've found my new favorite here.", "rating": 5, "date": "2015-01-30"}, {"excerpts": ["Had the Tantalizing Turkish and Jamaican Blue Mountain. ", "Both are very good, but I think I prefer the Turkish one because it's a dark roast. ", "It's coffee crack, I tell you. ", "Coffee will never taste the same again!"], "author": "Annie L.", "review": "Best coffee I've ever had in my whole.entire.life. This is not a good thing, however. Philz have just ruined me for all other coffee shops. How will I ever go back to other coffee chains? Had the Tantalizing Turkish and Jamaican Blue Mountain. Both are very good, but I think I prefer the Turkish one because it's a dark roast. It's coffee crack, I tell you. Coffee will never taste the same again!", "rating": 5, "date": "2011-12-18"}, {"excerpts": ["We ordered the Tantalizing Turkish and the Jacobs Wonderbar and they both tasted amazing. ", "The atmosphere has such a positive vibe and the customer service was genuine. ", "Our barista gave us a sample of the Philtered Soul which was also delicious and a sweet gesture. ", "On our way out, a man who we later found out was the CEO gave us a sample of the baklavas. ", "My co-workers and ", "I just found our new favorite coffee spot."], "author": "Samantha S.", "review": "Wow!! This is one of the best coffee places I've been too! It is a whole experience because every coffee is hand made. We ordered the Tantalizing Turkish and the Jacobs Wonderbar and they both tasted amazing. The atmosphere has such a positive vibe and the customer service was genuine. Our barista gave us a sample of the Philtered Soul which was also delicious and a sweet gesture. On our way out, a man who we later found out was the CEO gave us a sample of the baklavas. My co-workers and I just found our new favorite coffee spot.", "rating": 5, "date": "2014-06-26"}, {"excerpts": ["Tantalizing Turkish? "], "author": "Paran Y.", "review": "As far as coffee goes, I can't think of a better place than Philz in SF.  It does the caffination job sooo effing well I lay awake thinking about it at night...LITERALLY.  I usually feel the same or maybe slightly eless sleepy with other places **cough* Starbucks *cough* but I feel like I downed a bottle of adderall mixed with speed after Philz.  \n\nTantalizing Turkish? 10.0\n\nFor the more mild caffinated beverage try the Iced Mojito.  Tastes earth-shattering.  Yes, that good.\n\nJob well done Philz...Job. Well. Done.", "rating": 5, "date": "2010-07-01"}, {"excerpts": ["I've had a few different drinks there, but I am in LOVE with Tantalizing Turkish -- it's so dark and mysterioso. "], "author": "Penny Y.", "review": "Ughhhhhhh PHILZ.. how I love thee. If only I lived in the city, then I would have you every day!! Yes.. each cup is hand crafted with your preferred ratios. They even got my sugar preference perfect: somewhere in between medium sweet and barely there. \n\nI've had a few different drinks there, but I am in LOVE with Tantalizing Turkish -- it's so dark and mysterioso. YUM.\n\nYes, Blue Bottle does have good coffee, but this place has good coffee AND a wonderful, patient, and happy staff. If you want to look up someone's nostrils feeling like they just stepped on your puppy, go to Blue Bottle. But otherwise, come here to revel in the gloriousness that is Philz!", "rating": 5, "date": "2010-08-05"}, {"excerpts": ["Super friendly and helpful staff, guided me toward a Tantalizing Turkish on my maiden visit.  "], "author": "John K.", "review": "Coffee and me are a curious thing.  I've been drinking it consciously (i.e., aware of what I'm tasting) at coffee houses for just about 20 years now, so I'd like to think I'm at least approaching connoisseur status if I'm not already there.\n\nBut at the same time, I'm quite flexible when it comes to the black elixir.  For example, my daily coffee downtown was merely dictated by the place that was most conveniently on my way to the office.  Way back when, that might have been Pasqua or oh la la!  More recently, Peet's or Starbucks (heard of them???).  Even more, if I'm in a situation where McD's or an AM/PM are the only options, bring it on!\n\nThis review relates much more, however, to my long-winded paragraph about being a connoisseur than it does to my run-on paragraph about being easy going.  Once again I have Yelp to thank for first hearing about Philz, followed by a select few friends and colleagues.  But when, oh when, would I ever come across a Philz?\n\nEnter my new job which takes me to China Basin.  Google maps, zoom in, Philz!!!  Next morning, walk in....how does this place work?  It looks like a bar!  Super friendly and helpful staff, guided me toward a Tantalizing Turkish on my maiden visit.  Toss a mint leaf on top and take my first sip o' Philz.\n\nWell people, that's all it took:  ONE sip.  Peet's, Starbucks, etc., thanks for trying.  But Philz takes it to a whole nother level.  And it ain't even close.\n\nBut now that you know about me and coffee, you know I will continue to drink Peet's and Starbucks and McD's when it's convenient.  I'm a coffee lover, not a fighter.  But wow....Philz.  Da best.\n\nStay tuned for a review of my first try at Blue Bottle which took place only a week after my first visit to Philz.", "rating": 5, "date": "2010-04-15"}, {"excerpts": ["And if you like dark roasts, try their TANTALIZING TURKISH . . . ", "simply amazing!!"], "author": "Leeseuh K.", "review": "Simply amazing coffee . . . not really sure what happens behind that counter of theirs . . . is it some magical dust?  Philz secret ingredient?  MSG?  lots of TLC?  I guess it doesn't matter cuz the end result is sooo delicious!!  They have enough variety to keep you addicted.  The only drawback is it costs a bit more than other places.  You definitely need to get yourself a cup if you haven't tried it yet.  And if you like dark roasts, try their TANTALIZING TURKISH . . . simply amazing!!", "rating": 5, "date": "2012-04-05"}, {"excerpts": ["We had, on our first visit, the Jacob's Wonderbar Brew (me) and the Tantalizing Turkish (him). ", "I was a little scared, so I asked my barista to add a tiny bit of milk. ", "She knew exactly what I wanted and created for me, a brew of the greatest perfection. ", "It was cool enough to drink immediately, but warm enough that I could taste exactly what it is that makes this Philz most popular choice. "], "author": "Beth K.", "review": "OK. I'm going to be blunt. If you love coffee, and if you are not from the Bay Area, take my advice. Just don't come here. Because it is so amazing, so life changing, so mind blowingly awesome, that if you can't have it daily, its not worth knowing that it exists. \n\nWe were told to come here by a friend who doesn't like coffee. We, who are addicted to all things caffeninated , were not hard to convince. You walk in and the menu is immediately overwhelming. But FEAR NOT! The baristas and other employees are totally sold on their product and willing to sell you too. \n\nWe had, on our first visit, the Jacob's Wonderbar Brew (me) and the Tantalizing Turkish (him). I was a little scared, so I asked my barista to add a tiny bit of milk. She knew exactly what I wanted and created for me, a brew of the greatest perfection. It was cool enough to drink immediately, but warm enough that I could taste exactly what it is that makes this Philz most popular choice. My BF is vehemently opposed to ANYTHING in his coffee and so had it black. \n\nThe cool thing about ordering coffee black at Philz is that they make it so that there is a foamy fabulousness on top. The purpose of this is for you to taste the coffee before you taste the coffee. You swirl the (cooler than the real thing) foam in your mouth to ready your taste buds for the rest of your drink. This keeps the brew from tasting bitter. \n\nOn top of the fabulous coffee, they also have the typical San Fran spread of vegan delicacies. Additionally they have (at the Mission Bay store) a set of burritos. We had one on Thursday, the bacon burrito. They nuked it, perfectly, so that the bacon, cheese, potatoes, herbs, etc, were just ... perfect. This is part of the reason we came back the next day. This time we got the Ancho Chili burrito, which was pretty much the same as before - delicious - except sub ancho chili for bacon. They also had a black bean burrito, which even my carnivorous boyfriend would have gotten if we had one more morning in San Fran. \n\nI got back to Maryland and posted on Facebook how sad I was to drink Folgers again, after two days of Philz. And I had no less than 7 positive comments from locals who had visited Cali and also miss Philz.", "rating": 5, "date": "2010-08-14"}, {"excerpts": ["My first drink was the \"Tantalizing Turkish\" which they infuse with this Indian spice called \"Cardibum\" or something.  ", "I've been hooked ever since.  ", "One thing to note - at $5.75-$6 for a coffee and a treat ", "I pay more here than for any of the other places that I know of.  "], "author": "Nathan V.", "review": "It doesn't sound like this place needs any more props - it seems that until recently, everyone aside from me knew how good the coffee is here.  I was immediately impressed with the upbeat feeling and comfort I felt when upon in.  The baristas here have a special warmth about them.  My first drink was the \"Tantalizing Turkish\" which they infuse with this Indian spice called \"Cardibum\" or something.  I've been hooked ever since.  One thing to note - at $5.75-$6 for a coffee and a treat I pay more here than for any of the other places that I know of.  This is my current favorite coffee spot.  \n\nPrevious faves in SF:  Blue Bottle, Cafe Trieste, Quetzal Cafe", "rating": 5, "date": "2010-09-16"}, {"excerpts": ["Tried their #1 Tantalizing Turkish Coffee, medium sweet, and it was absolutely perfect!  ", "It's a bit pricey, at $3 for a small, but it was totally worth it."], "author": "Amy H.", "review": "So much better than Starbucks, Coffee Bean, and any other chain coffee shop!  Tried their #1 Tantalizing Turkish Coffee, medium sweet, and it was absolutely perfect!  It's a bit pricey, at $3 for a small, but it was totally worth it.", "rating": 5, "date": "2011-12-10"}, {"excerpts": ["The Turkish blend (tantalizing turkish) is a very complex coffee, dark roast with cardamom and mint. ", "I also like the New Manhattan blend. "], "author": "Paul G.", "review": "Finally... This is how coffee is supposed to be. Philz has a great selection and very knowledgeable staff - if you don't know what you want just ask and they will guide you through the choices. \n\nThe Turkish blend (tantalizing turkish) is a very complex coffee, dark roast with cardamom and mint. I also like the New Manhattan blend. More expensive than your run of the mill Starbucks, but that's sort of the point...! \n\nHighly recommended.", "rating": 5, "date": "2009-12-29"}, {"excerpts": ["What could be better than 20+ blends of coffee from light to medium light to dark, with names like Sooo Good (light), Dancing Water (medium light), Tantalizing Turkish Brew (", "medium dark), Silken Splendor (dark)?  ", "The Ecstatic Iced Coffee makes me ecstatic (if you think I'm exaggerating, my coffee expert boyfriend in his review likens the coffee here to an orgy).  ", "They add cream (nonfat milk for me) and sugar to your liking, and they even have sprigs of fresh mint that you can add.  "], "author": "Erica Y.", "review": "There is NO place better for coffee than Philz.  What could be better than 20+ blends of coffee from light to medium light to dark, with names like Sooo Good (light), Dancing Water (medium light), Tantalizing Turkish Brew (medium dark), Silken Splendor (dark)?  The Ecstatic Iced Coffee makes me ecstatic (if you think I'm exaggerating, my coffee expert boyfriend in his review likens the coffee here to an orgy).  They add cream (nonfat milk for me) and sugar to your liking, and they even have sprigs of fresh mint that you can add.  I'm gonna keep coming here until I can recite the drink list like the alphabet.\n\nThis location is spacey with a lot of sunlight, free wifi, and comfy armchairs, so it's a great place for some reading or light studying.  Easy access from MUNI too!", "rating": 5, "date": "2007-10-07"}, {"excerpts": ["I'm gradually tasting my way through all of them, current favorite is Tantalizing Turkish, which was a perfect after lunch brew -- like drinking dessert, it tasted so rich.\n\n"], "author": "Barbara B.", "review": "I'm basically a tea drinker, on a limited budget, but I LOVE Philz Coffee.  \nWhen I do splurge on a cup of coffee, it better be good!\n\nStarbucks is across the street from my office, but it's worth walking the extra few blocks and paying a bit more for an exquisite cup of coffee from Philz.   I'm gradually tasting my way through all of them, current favorite is Tantalizing Turkish, which was a perfect after lunch brew -- like drinking dessert, it tasted so rich.\n\nAs good as the coffee might be, it's the staff that really distinguishes Philz;  I haven't been to the other locations, but on several visits to this Philz, I've felt welcomed by the very friendly baristas, who seemed to be genuinely enjoying their work.", "rating": 5, "date": "2007-07-27"}, {"excerpts": ["And then the coffee--Tantalizing Turkish--was as excellent as I could have hoped for. ", "Thor got the mocha and was equally impressed. \n", "We will definitely go back, if it is late afternoon to evening time. ", "Any earlier, though, and I think we'll pass just in case."], "author": "Rachel G.", "review": "I decided to try this place again, and I am so glad I did. I went at a completely different time of day, and the incredibly rude barista was nowhere in sight. Instead there was a really friendly guy who discussed brewing and tasting coffee (and beer) with us, while brewing our coffee and and, since there were no customers coming in, continued to have a nice conversation with us about a number of things. \nMost important, though, is the coffee. This time, when I asked for soy milk, this guy offered me a choice of regular or vanilla. Clearly it's not a policy of Philz to discourage the use of soy milk, just a weird passion of that one rude barista girl. (In fact, after I asked for soy milk, both of the employees there at the time started talking with us about when they preferred soy and when they preferred dairy.) And then the coffee--Tantalizing Turkish--was as excellent as I could have hoped for. Thor got the mocha and was equally impressed. \nWe will definitely go back, if it is late afternoon to evening time. Any earlier, though, and I think we'll pass just in case.", "rating": 4, "date": "2009-12-31"}, {"excerpts": ["Oh, and can you pick me up a large Tantalizing Turkish while you're there?"], "author": "Josh E.", "review": "Best coffee in the city, hands down. But don't take my word for it. Go there yourself. Do it now. I'll wait ... Oh, and can you pick me up a large Tantalizing Turkish while you're there?", "rating": 5, "date": "2007-05-26"}], "jacobs wonderbar": [{"excerpts": ["I've ordered Jacobs Wonderbar, Tesora, and Julies Ultimate multiple times, (each time recommended by the barista) and customized to my taste (milk type, sweetener, etc.) \n\n"], "author": "Diana V.", "review": "Preface: I'm probably one of the few people who just can't get into their coffee : ( \n\nSince I'm a coffee fanatic, I usually love all the artisanal varieties, but this is the *only* coffee shop where I don't have an affinity for the taste of their brew!\n\nCustomer service is awesome and laid-back, and the baristas are super helpful to Philz Coffee newbies. \n\nI've ordered Jacobs Wonderbar, Tesora, and Julies Ultimate multiple times, (each time recommended by the barista) and customized to my taste (milk type, sweetener, etc.) \n\nLove the customization crafting process. Take a seat on their comfy couch and don't mind the wait; they take their coffee as seriously as Blue Bottle http://www.yelp.com/biz/blue-bottle-coffee-co-san-francisco-6#hrid:V1wcypxjaUhzfpj2-cBk-w).\n\nSadly, my palette just can't get accustomed to their coffee. Ah well, back to Blue Bottle, I guess : )", "rating": 3, "date": "2011-06-13"}, {"excerpts": ["We ordered the Tantalizing Turkish and the Jacobs Wonderbar and they both tasted amazing. ", "The atmosphere has such a positive vibe and the customer service was genuine. ", "Our barista gave us a sample of the Philtered Soul which was also delicious and a sweet gesture. ", "On our way out, a man who we later found out was the CEO gave us a sample of the baklavas. ", "My co-workers and ", "I just found our new favorite coffee spot."], "author": "Samantha S.", "review": "Wow!! This is one of the best coffee places I've been too! It is a whole experience because every coffee is hand made. We ordered the Tantalizing Turkish and the Jacobs Wonderbar and they both tasted amazing. The atmosphere has such a positive vibe and the customer service was genuine. Our barista gave us a sample of the Philtered Soul which was also delicious and a sweet gesture. On our way out, a man who we later found out was the CEO gave us a sample of the baklavas. My co-workers and I just found our new favorite coffee spot.", "rating": 5, "date": "2014-06-26"}, {"excerpts": ["After browsing the menus, and with some recommendations from the workers, I went for a darker roast with the Jacobs Wonderbar blend. "], "author": "Andrew L.", "review": "I wish I knew more places like this. This place just screams coffee connoisseur. \n\nAfter browsing the menus, and with some recommendations from the workers, I went for a darker roast with the Jacobs Wonderbar blend. It was full body and had a nice smooth flavor without being overly bitter or harsh. \n\nI also got a chance to try my friends mint mojito. It reminded me more of a creamy tea than coffee but still good.\n\nToo bad there aren't any locations  in socal. I'd definitely make regular visits.", "rating": 5, "date": "2011-10-23"}, {"excerpts": ["First time I tried a Jacobs Wonderbar Brew, my wife asked me how it was and I literally sat there silent for a few seconds before answering \"best cup of coffee I have ever had\". ", "It has never disappointed."], "author": "Will C.", "review": "Is it expensive for drip coffee? Yes but this stuff is brewed with soul, its got character and really addictive. First time I tried a Jacobs Wonderbar Brew, my wife asked me how it was and I literally sat there silent for a few seconds before answering \"best cup of coffee I have ever had\". It has never disappointed.", "rating": 5, "date": "2012-03-25"}, {"excerpts": ["My Favorite is definitely the Jacobs Wonderbar with Creme & sugar. \n\n"], "author": "Jason B.", "review": "Yay for Philz in SOMA. Love it every morning. I had no problems with the wireless, and the coffee just went down so well.\nMy Favorite is definitely the Jacobs Wonderbar with Creme & sugar. \n\nAhhhh... So good.", "rating": 5, "date": "2007-11-07"}], "ether": [{"excerpts": ["Gingersnap iced coffee, Ether, Philtered soul, Silken splendor and Julie's ultimate. ", "However you really can't go wrong with ordering anything here, and if you need any help, the barristas are more than happy to help you find your perfect drink."], "author": "Mark O.", "review": "Oh Philz, what would I do without you?\n\nShamefully, I must admit that I frequent this Philz location at least once a day if not more. It is practically my second home at this point. You know you come too often when you are on a first name basis with the barristas and have your own mug (which gets you $1 off each drink).\n\nPhilz coffee is, in my opinion, the best coffee around. The plethora of options, the ability to customize your drink however you want it, friendly atmosphere, good music, variety of pastries, specialty drinks and pour over only style makes for the complete package. The manufacturing cream they use is so creamy that it is hard to ever switch to the other healthy options they have (and they have them all... soy, almond, fat free, 2%, etc). \n\nMy favorite drinks here are in order: Gingersnap iced coffee, Ether, Philtered soul, Silken splendor and Julie's ultimate. However you really can't go wrong with ordering anything here, and if you need any help, the barristas are more than happy to help you find your perfect drink.", "rating": 5, "date": "2014-08-17"}, {"excerpts": ["Overall, the Ether (Phil's Way) is best at this location."], "author": "Chi T.", "review": "One of my favourite coffee places to go to in the morning.  Long lines, acceptable wait time, and great coffee.\n\nI really enjoy the outdoor seating when there's no dump-truck around and or sewage pipeline repair going on. \n\nOverall, the Ether (Phil's Way) is best at this location.", "rating": 5, "date": "2015-06-12"}, {"excerpts": ["Ether!!! ", "Need I say more? \n", "Excellent pastries, breakfast sandwiches and breakfast burritos! \n", "Stones throw from PacBell park for all u Giants fans ...just remember 1989...", "go A's!"], "author": "Paul D.", "review": "Ether!!! Need I say more? \nExcellent pastries, breakfast sandwiches and breakfast burritos! \nStones throw from PacBell park for all u Giants fans ...just remember 1989...go A's!", "rating": 5, "date": "2014-05-28"}, {"excerpts": ["Excellent staff and baristas~~~ especially Sandi and her awesomely perfect Ether, Philz way! ", ":)"], "author": "John M.", "review": "This is my hometown, local Philz! Outside of the original 24th & Folsom location, this is my coffee HQ & home! Excellent staff and baristas~~~ especially Sandi and her awesomely perfect Ether, Philz way! :)", "rating": 5, "date": "2015-02-15"}, {"excerpts": ["I asked for the strongest coffee (caffeine wise) for my husband and he suggested the Ether ", "so I settled on that.  ", "I settled on the chai latte and asked for it on the sweeter side.  ", "The barista was awesome!  ", "He was super helpful "], "author": "Christine P.", "review": "Ok -  I have to admit.  I've passed by this place plenty of times and never stepped in.  I didn't know what the hype was all about.  Plus I'm not much of a coffee drinker - I prefer tea.  So after hearing about Philz from all the facebook posts from my friends, I decided I needed to try it out.  My husband loves coffee so I decided to drag him along as well. \n\nAfter stepping in, I felt loss and told the barista that this was my first time and I didn't know what the heck to order.  I asked for the strongest coffee (caffeine wise) for my husband and he suggested the Ether so I settled on that.  I settled on the chai latte and asked for it on the sweeter side.  The barista was awesome!  He was super helpful and I love how they freshly brew every single drink.  \n\nThe chai latte was the best chai latte I've ever had! I wish they had one close to work because I would be there every single day.  LOVE it.  \n\nDefinitely a MUST try when you're in SF. Parking is difficult in this area so definitely allow for some time if you're in a rush.", "rating": 5, "date": "2012-01-24"}, {"excerpts": ["My usual, Sweet and creamy ether! ", "It's on sale right now as it is the coffee of the month. ", "I bought a pound and got my small ether coffee for free! "], "author": "Leena B.", "review": "I love Philz everything. So much so that I would appreciate it if my future husband's name was Phil. During the Bart strike, I was forced to embrace Muni and the T-Line. This Philz is located right at the stop on Berry. While waiting for my ride, I was going to wait on the nice patio outside. However, they started playing \"Dirty Diana\" by MJ! Woah! Someone help me NOT break into song! So I decided to sit on this really comfy red couch. Oh no...Must get off couch...\n\nI usually opt for..well... My usual, Sweet and creamy ether! It's on sale right now as it is the coffee of the month. I bought a pound and got my small ether coffee for free! Saweeeeet! \n\nI then started diversifying. I tried the \"Philtered Soul\"... Toooootally helped wake me up at 6am! Then, in an effort to be 'healthy', I opted for the \"medium sweet and creamy\" Tesora...so delicious! I can never go back to Starbucks! \n\nThe baristas make sure that your drink is perfect. They are so sweet, understanding, and human!! \n\nLast anecdote... I forgot my wallet in my yoga bag. I was so sad!! But then the barista was like don't worry! And then! I found a $5 miraculously... And he said \"Are you sure you won't need it all day?\" I said.. No no, here, but thank you!!! Now, now... Don't go taking advantage of the nice man and pulling the whole \"I forgot my wallet\" mess...But I have to say how appreciative I was when life happens and they were still accommodating :)", "rating": 5, "date": "2013-10-22"}, {"excerpts": ["I bought a pound of the ether and jacobs coffee beans.  ", "Both were very good"], "author": "Ben Y.", "review": "I ordered the turkish coffee which was good and tasted a bit like chicory...i always drink my coffee black but in hindsight i think this blend might have been better with some heavy cream and a little sugar.\n\nThe iced mojito latte was both good and interesting.\n\nI bought a pound of the ether and jacobs coffee beans.  Both were very good", "rating": 4, "date": "2012-01-08"}, {"excerpts": ["ANYBODY WANT SOME ETHER???\n\n"], "author": "Ladybird G.", "review": "ANYBODY WANT SOME ETHER???\n\nFinally! \nThis is one of those places that always brings me to my happy place.Its a great pick me up no matter what time of day and its as fresh as it gets ....unless you wanna go pick the coffee beans yourself and well yeah that would be a totally  different story.\nYou cannot go wrong with any of their masterpieces.", "rating": 5, "date": "2013-05-02"}, {"excerpts": ["Julie's Ultimate\nJulie's Ultimate\nJulie's Ultimate\n...or Ether\n...but Julie's Ultimate\n\nAMAZING! "], "author": "Mahsa K.", "review": "Julie's Ultimate\nJulie's Ultimate\nJulie's Ultimate\n...or Ether\n...but Julie's Ultimate\n\nAMAZING! Snack choices limited though, may need to go to Panera next door if you are craving more variety to nibble on. But get your drinks here... #Julie's Ultimate [dark roast].", "rating": 4, "date": "2013-02-24"}, {"excerpts": ["She walked me through their selection of dark to light roasts and suggested an incredible blend of \"first alarm and ether.", "\" ", "She even had me try it before I left to ensure I liked it. ", "Everyone I met was very friendly and my barista left me with a \"welcome to Philz dude!", "\" ", "I highly recommend this place to any coffee enthusiasts!!!"], "author": "Alexander G.", "review": "Came into Philz this morning and ordered a \"black coffee,\" the barista could already tell I was a first timer. She walked me through their selection of dark to light roasts and suggested an incredible blend of \"first alarm and ether.\" She even had me try it before I left to ensure I liked it. Everyone I met was very friendly and my barista left me with a \"welcome to Philz dude!\" I highly recommend this place to any coffee enthusiasts!!!", "rating": 5, "date": "2015-04-15"}, {"excerpts": ["I like the Ether with a bit of cream and sugar and a couple of mint leaves, simply delicious."], "author": "Gloria H.", "review": "3.5 stars\n\nEver since I stepped foot in the original location and had my first cup of Philz, I was hooked.  This is a good location because it's closed to Caltrain so a good stop to meet up with friends or colleagues for a meeting.  \n\nThere are chairs and tables outdoor, as well as some indoor along with a few sofas.    If you are not familiar with the choices, check it out and decide before getting in line.\n\nI like the Ether with a bit of cream and sugar and a couple of mint leaves, simply delicious.", "rating": 3, "date": "2012-03-05"}, {"excerpts": ["With savory and sweet treats like the Philtered Soul and bold and crisp knockouts like the Ether, Philz has a bunch of roasts to accommodate everyone. "], "author": "Frank Y.", "review": "Coffee: always a touchy subject, especially when dealing with the residents of San Francisco, who are more than a bit spoiled by the copious amounts of great coffee shops in the city.\n\nPersonally, I feel Philz is just one of the standard coffee boutiques that have sprung up recently in the city: nuevo and unique, yet subtly bland. However, the coffee here is a step up from the rot gut that you would get at any other chain establishment. With savory and sweet treats like the Philtered Soul and bold and crisp knockouts like the Ether, Philz has a bunch of roasts to accommodate everyone. All of them have lovely flavors and different personalities, but there's little to separate Philz from the rest: great coffee, but standard fare.\n\nMy personal favorites are the Philtered Soul and the Mocha Tesora. Make sure you ask for medium sugar and medium cream at most. You don't want to drown out the nice chocolate flavors in either of those drinks. The Philtered Soul is lighter than the Mocha Tesora, but both give a nice nut+chocolate combo. It's almost like Philz somehow extracted the essence of Nutella and put it into their coffee. Maybe that's why I find myself coming back from time to time.", "rating": 4, "date": "2012-04-24"}, {"excerpts": ["My favorites are the Ether, Code 33,Tesora and of course the Philtered Soul.  ", "I give this place a bunch of smileys and likes.  ", "Philz makes my mornings happy.  ", ":)"], "author": "Marita S.", "review": "How could you not love this place? It's a block away from Caltrain, the staff is great and the coffee is ahhhhmaaaazing.  The only thing that bums me out some mornings is that I don't have enough time to wait in line and wait for my coffee.  I like the interactions with my coffee peeps so ordering in ahead of time is a no go for me.  This place is really busy right before the trains leave so there's a little anxiety but It's worth it to wait for my personal cup of Philz (wanted to say Joe but that would be offending...lol) and a sprint to catch my train.  I've tried almost every type of Philz coffee and now I choose my roast by my mood on that day.  My favorites are the Ether, Code 33,Tesora and of course the Philtered Soul.  I give this place a bunch of smileys and likes.  Philz makes my mornings happy.  :)", "rating": 4, "date": "2013-09-28"}, {"excerpts": ["An iced Ether is the perfect cup on a hot day.\n\n"], "author": "Jeff S.", "review": "The location feels open and warm. The coffee is simply amazing.\n\nAn iced Ether is the perfect cup on a hot day.\n\nI can't stay away from this place.", "rating": 5, "date": "2007-07-05"}, {"excerpts": ["Full Bodied yet approachable\n- Ether:  ", "Whoa! ", "That's strong, but tasty :)\n- Philharmonic:  "], "author": "Aaron W.", "review": "- Jacob's Wonderbar Brew:  Balanced and delicious\n- New Manhattan:  Full Bodied yet approachable\n- Ether:  Whoa! That's strong, but tasty :)\n- Philharmonic:  Mmm Mmm good\n\nThis isn't my exclusive coffee joint, but it is my favorite coffee by far. Each cup is brewed with care and consistency. I have tried many of their roasts and haven't been disappointed. I will say, however, that the Mocha Tesora was a little too rich for me, but I usually only like a hint of mocha if I'm in the mood for such. For chocolate lovers, this one's for you.", "rating": 5, "date": "2010-04-21"}, {"excerpts": ["Some cups are better than others, but make sure you try the Ether, Tesora, and Jacob's Wonder Brew. "], "author": "Dave C.", "review": "This is not only the best coffee place in San Francisco, this is the best coffee place in the 24 states and 15 countries I have been to. The coffee is what makes it so, not the ambiance or price or staff or parking or whatever, it is the coffee. Some cups are better than others, but make sure you try the Ether, Tesora, and Jacob's Wonder Brew. I make this part of my Saturday morning routine and (sadly?) look forward to it on Friday nights. \n\nOn the corner of 4th and Berry, this place isn't in the tourist area at all, so it is missed by many (though Philz has other SF locations). Is the place you went to in Athens that looked up at the Parthenon at sunrise better? Better olocation certainly, but I swear, not a better cup.\n\nThe baristas are friendly, talk it up with you, and make sure you try a sip before you move on. They handcraft each cup, so it takes a little time (or lovin'). It isn't too expensive and they are very green. Mission Bay packs this place at any time of the day on any day of the week, so catch it before it blows up into a city-wide phenomenon.\n\nWhen we move, Philz is one of the things we will miss most.", "rating": 5, "date": "2010-01-29"}, {"excerpts": ["I had an Ether and it was really good. ", "I'll try the #13 ", "It'z ", "The Best next time."], "author": "Gabriel S.", "review": "Really good coffee. I had an Ether and it was really good. I'll try the #13 It'z The Best next time.", "rating": 4, "date": "2011-06-02"}, {"excerpts": ["ecstatic iced or ether.\n\n", "if you're in the mood for something dark and eye awakening, do it ether. ", "a casual coffee? ", "ecstatic iced.  ", "get it \"lowfat\" lest you get a mouthful of heavy cream.  ", "though you might be in to that... "], "author": "Steven C.", "review": "ecstatic iced or ether.\n\none cup at a time.  the way it should be.  my father is a coffee roaster so you'd think i know a thing or two about beans and good coffee.  even if i don't, it doesn't matter, because you will love philz.\n\nif you're in the mood for something dark and eye awakening, do it ether. a casual coffee? ecstatic iced.  get it \"lowfat\" lest you get a mouthful of heavy cream.  though you might be in to that... hrm.\n\ndon't come here if you're in a rush.  starsucks is down the street if you want some brown water.  nice people here and they move about as fast as they can for making one cup at a time.  coffee like it's meant to be... enjoyed.", "rating": 5, "date": "2010-04-24"}, {"excerpts": ["I've tried just about every dark roast on the menu except for Ether. ", "I love the Jacob's Wonderbar!! ", "Oh, Philz.."], "author": "Ninette B.", "review": "My love for Philz is strong and unbreakable and now I cannot drink any other coffee.  I made the mistake (or was it a mistake?!) of going to Philz every morning before work.. I thought I'd give my bank account a break so I went to Noahs and was totally let down. Matter of fact, my coworker saw me walking down the hall with my Noahs and he said he nearly slapped it out of my hands.  I've tried just about every dark roast on the menu except for Ether. I love the Jacob's Wonderbar!! Oh, Philz..", "rating": 5, "date": "2009-11-20"}, {"excerpts": ["I'm usually take my coffee with nothing added, but the \"Ether\" brew with cream/sugar is a hearty, rich cup that almost seems like a mocha, instead.  "], "author": "Collin W.", "review": "Not a place to grab a quick cup and run.  The coffee is brewed individually.  I'm usually take my coffee with nothing added, but the \"Ether\" brew with cream/sugar is a hearty, rich cup that almost seems like a mocha, instead.  My wife ordered mine with a sprig of mint, which was a nice touch - after I gagged because I thought there was an uninvited guest in my cup.\n\nParking is challenging, especially if the Giants are playing.", "rating": 5, "date": "2008-05-22"}, {"excerpts": ["Just what is an \"Ether\"? ", "Air and coffee? ", "Ugh.", "\" ", "But then my wife alerted me to the menu legend and all was right with the world. ", "There was nothing difficult about ordering: the descriptions of the coffee was so clear and precise. ", "A very fine cup of coffee."], "author": "Ross G.", "review": "My heart sunk a little when I saw the menu. \"How many different drinks to they have?!\" I said to myself? \"Just what is an \"Ether\"? Air and coffee? Ugh.\" But then my wife alerted me to the menu legend and all was right with the world. There was nothing difficult about ordering: the descriptions of the coffee was so clear and precise. A very fine cup of coffee.", "rating": 4, "date": "2009-07-03"}, {"excerpts": ["My favorites: Phillharmonic, Ether, and It's the best."], "author": "HiFive E.", "review": "Phil is the man! This is what the coffee experience is all about. Ordering a double short-double fat no foam soy latte makes you a douchebag in my book. I would be embarrassed to order a frozen carmel machiato (even for a girl I'm hooking up with). That being said... this is straight forward handcrafted cups of coffee. Just coffee. There is almost fifty different blends to choose from. My favorites: Phillharmonic, Ether, and It's the best.", "rating": 5, "date": "2007-12-24"}, {"excerpts": ["Ether, cream no sugar. ", "Sure, it's an expensive cup of coffee, but it's a freaking good one. ", "Seems like there's always a police car outside and officers getting ther caffeine on inside.."], "author": "Linda M.", "review": "Ether, cream no sugar. Sure, it's an expensive cup of coffee, but it's a freaking good one. Seems like there's always a police car outside and officers getting ther caffeine on inside..", "rating": 5, "date": "2009-03-06"}], "julies ultimate": [{"excerpts": ["My favorites so far are the Philtered Soul and Julies Ultimate, sweet and creamy! ", "Highly recommend to anyone, even people who aren't as into coffee as others, because you will be after this experience!"], "author": "Kuhray V.", "review": "If I could give it 100 stars, I would. These people make the most delicious coffee I have ever had! I love this location as well; I have visited it three times in the past week and by the third time the wonderful staff was saying 'Welcome Back', noting that they remembered me! I love that feeling! My favorites so far are the Philtered Soul and Julies Ultimate, sweet and creamy! Highly recommend to anyone, even people who aren't as into coffee as others, because you will be after this experience!", "rating": 5, "date": "2016-04-23"}, {"excerpts": ["I've ordered Jacobs Wonderbar, Tesora, and Julies Ultimate multiple times, (each time recommended by the barista) and customized to my taste (milk type, sweetener, etc.) \n\n"], "author": "Diana V.", "review": "Preface: I'm probably one of the few people who just can't get into their coffee : ( \n\nSince I'm a coffee fanatic, I usually love all the artisanal varieties, but this is the *only* coffee shop where I don't have an affinity for the taste of their brew!\n\nCustomer service is awesome and laid-back, and the baristas are super helpful to Philz Coffee newbies. \n\nI've ordered Jacobs Wonderbar, Tesora, and Julies Ultimate multiple times, (each time recommended by the barista) and customized to my taste (milk type, sweetener, etc.) \n\nLove the customization crafting process. Take a seat on their comfy couch and don't mind the wait; they take their coffee as seriously as Blue Bottle http://www.yelp.com/biz/blue-bottle-coffee-co-san-francisco-6#hrid:V1wcypxjaUhzfpj2-cBk-w).\n\nSadly, my palette just can't get accustomed to their coffee. Ah well, back to Blue Bottle, I guess : )", "rating": 3, "date": "2011-06-13"}, {"excerpts": ["I'll be late to morning meetings, and drive knowing I have to pay $40 to park my car across from work for the day, just for a cup of Julies ultimate with cream. ", "If you ever fall in love with me, bring me Philz, i'll love you back."], "author": "Angela B.", "review": "I'll be late to morning meetings, and drive knowing I have to pay $40 to park my car across from work for the day, just for a cup of Julies ultimate with cream. If you ever fall in love with me, bring me Philz, i'll love you back.", "rating": 5, "date": "2015-05-14"}, {"excerpts": ["When infused together, simply drinking Julies Ultimate transforms into an indulging, intimate experience."], "author": "Gabriella C.", "review": "I must retract my sworn loyalty to It's a Grind. Philz satisfies my thirst for an intensely dark, artfully made cup of coffee. The darker the brew the sweeter the flavor is the infamous saying.. no? Well this is undoubtedly true for Julie's ultimate, a glorious cup of orgasmic joy. Each sip reveals a distinct aspect of the brew's character,  and expresses a varied stimulation of scent and taste. When infused together, simply drinking Julies Ultimate transforms into an indulging, intimate experience.", "rating": 5, "date": "2010-12-11"}], "anesthesia to the upside": [{"excerpts": ["I had the Anesthesia To The Upside. \n\n"], "author": "David O.", "review": "For a coffee lover, I'm a Philz noob. I visited Philz out of proximity at the moment and was previously taken a back by the cult following. With that said, I had a very nice experience here. No mint mojitos for me, but I wanted to get a feel for their roasts. You won't find single origins, but their blends are wholesome and full bodied. You know, when you sit down, sip, and \"ah\" involuntarily. I had the Anesthesia To The Upside. \n\nI was confused walking in, not knowing where I order and paid and in which order. I walked up to a drip station and the guy working there was more than happy to walk me through their blends as a first timer. Then I went to the register and paid. The process was different, but doesn't deter from the experience. \n\nIf there were more of these closer to me, I'd make trips to Philz more frequently. Are they worth the hype? Perhaps. And even though I'm not one for sweet drinks, the mint mojito sounds interesting enough for me to try. Until then!", "rating": 4, "date": "2013-08-28"}, {"excerpts": ["I think I'd have to say the Silken Splendor and the Anesthesia to the Upside would be my favorites thus far.\n\n"], "author": "Brad Y.", "review": "Hands down, BEST COFFEE I HAVE EVER HAD! Philz got it right. Thank you. Thank you so very much for introducing me to what I have been missing all my life!\n\nAs much as I want to, I hesitated giving 5 stars to Philz. As wonderful as the coffee, experience, and service is.. it is a little pricey. But you pay for quality, right? My friend recently gave Philz a 4 star rating so I justify my 5 stars since the two reviews will average out to a 4.5 ... lol\n\nAnyways, staff is great and always willing to answer any questions you have! Each cup is individually brewed and customers have a choice of about 20 or so different roasts - light, medium, and dark! I always feel a little overwhelmed since there are so many roasts to choose from! But so far, everything that I've tried is good. I think I'd have to say the Silken Splendor and the Anesthesia to the Upside would be my favorites thus far.\n\nOn a hot day, try the mint mojito iced coffee!", "rating": 5, "date": "2011-02-25"}, {"excerpts": ["Lately my favorite is #8 \"Anesthesia to the Upside\"\n\nAside from the quality of the coffee, you should be very pleased with the personable service. "], "author": "Oren F.", "review": "If you want the highest concentration of caffeine combined with great taste in handmade coffee.  THIS IS IT.  Lately my favorite is #8 \"Anesthesia to the Upside\"\n\nAside from the quality of the coffee, you should be very pleased with the personable service. :)\n\nWARNING: YOU WILL BE BUZZING HIGH OFF OF CAFFEINE. \nAfter my initial Philz binge, I backed off, and really don't do Philz anymore unless I want that high.  I'm a serious coffee lover, and Philz keeps me up until 3am even if I drank it at 9am. :P\n\nI'm generally a lot happier with a macchiato or short latte.", "rating": 5, "date": "2011-09-02"}, {"excerpts": ["The morning brew is \"Sooooo Good\" that a solitary cup of the \"Ambrosia Coffee of God\" works like an \"Anesthesia To The Upside\" causing you to become so alert you could quite possibly run for mayor of \"New Manhattan\". \n\n"], "author": "Sue L.", "review": "Waking up on weekend mornings to a nice cup of Philz \"Tesora\" is like waking up on a \"Canopy of Heaven\" where alarm clocks are replaced by a \"Greater Alarm\" which directs an entire \"Philharmonic\" to awaken your soul. Their coffee is freshly brewed with \"Dancing Water\" and taking a sip is absolute \"Silken Splendor\" running down to the core of your newly \"Philtered Soul\". The morning brew is \"Sooooo Good\" that a solitary cup of the \"Ambrosia Coffee of God\" works like an \"Anesthesia To The Upside\" causing you to become so alert you could quite possibly run for mayor of \"New Manhattan\". \n\nPhilz...\"It'z The Best\"!!!", "rating": 5, "date": "2009-10-15"}, {"excerpts": ["For a medium roast check out Anesthesia To The Upside, sweet and with cream. "], "author": "Scott R.", "review": "In a city with so much amazing coffee (namely Blue Bottle and Epicenter in my opinion) Philz fills a void that I rarely ever realize until I'm experiencing it. Something like gourmet Dunkin' Doughnuts brew Philz coffee isn't exactly the epitome of the artistic coffee culture. Nor when it comes to demonstrating coffee mastery does a large Ambrosia come close to the sweet nectar of a well pulled espresso. But sometimes a big cup of sugary, cream filled, bright coffee, with a small sprig of mint, really does hit the spot. Not for everyday, but it's definitely enjoyable.\n\nThe SOMA location is quite convenient if you have an extra 20 mins before catching a train (like if you just missed one), but I stick to the Mission location for actually hanging out with a laptop for awhile, though I appreciate all their locations have wifi and aren't stingy about plugs.\n\nFor a medium roast check out Anesthesia To The Upside, sweet and with cream. For a real start to your day nothing beats the light roast Greater Alarm (crafted for the SFFD), again with cream and sugar, and a mint garnish.", "rating": 4, "date": "2009-07-12"}, {"excerpts": ["This place is for \"real\" coffee lovers who can appreciate the infinite varieties of exotic coffee beans with names like \"Sooooo Good,\" \"Anesthesia to the Upside\" and \"Dancing Water.\"\n\n"], "author": "Tommy T.", "review": "This place is for \"real\" coffee lovers who can appreciate the infinite varieties of exotic coffee beans with names like \"Sooooo Good,\" \"Anesthesia to the Upside\" and \"Dancing Water.\"\n\nBut I'm not a \"real\" coffee drinker and much prefer the watered down lattes at Starbucks. Philz is just too bitter for me even when I ordered the lightest kind they offer.\n\nAlso worth noting is the staff at the Berry Street location. How should I say this... They're pretty passionate about coffee... !", "rating": 3, "date": "2007-07-31"}, {"excerpts": ["Get the Anesthesia to the Upside.  ", "It'll blow your mind."], "author": "Kevin M.", "review": "There are three Starbucks within two blocks of here, so if you just have to have your venti soy latte with two splendas, go there.  If you want real, handmade, brewed to order coffee, then go to Philz.  Get the Anesthesia to the Upside.  It'll blow your mind.", "rating": 5, "date": "2007-06-21"}], "itz the best": [{"excerpts": ["People with a  sweet tooth, definitely try Itz the best!\n\n"], "author": "Jessica S.", "review": "My dream coffee! I wish it weren't $3.50 a cup, BUT if its a treat, its well worth it! Ambrosia is my go to, but I also know that Turkish and Jacob's are amazing too! People with a  sweet tooth, definitely try Itz the best!\n\nBest part, they have organic creamer, AND have stevia! The more you go, the more the staff will tell you about their secret coffee concoctions (i.e. Red Sea).\n\nThe staff is always friendly, and the shop has a good vibe. i would be comfortable hanging out here for hours.", "rating": 5, "date": "2012-07-02"}, {"excerpts": ["I enjoyed thoroughly the Julia's Ultimate over Itz the Best Blend."], "author": "Natalie G.", "review": "Two girls walk into a coffee shop in SF with one fiending for her coffee fix and the biggest die hard Dunkin Donuts Coffee fan.\n\nThe non- local girl asks \"What do I get?\"\n\nThe Barista responds, \"What's your mood?\"\n\n\"Umm.. I like coffee.. Dunkin Donuts kind?\"\n\"Well.. What we do here is %&^*&@#@#@(*# fancy coffee talk &)(*^%$^& and make each cup at a time and %&^#$&#(*$l\"\n\"Huh. Ok. I'll try the #19\"\n\nAnd the process began.  I'm not too sure what the #19 is that I ordered, but it was tasty.  She sweetened it and creamed it according to my liking and the whole process was a show and entertaining.  \n\nIt's good and I won't deny them that.  But it's a show.  Perhaps, my palate simply is not refined, but for a gal who likes Hazelnut Dunkin Donuts or even McDonalds Drive Through coffee.. This place was just a bit too much for an everyday thing, and a bit pretentious.  Once in awhile.. sure! But not a go to place for me.\n\nAnd to the ever so handsome esque barista that my friend said, \"HEY! My friend is going to yelp the shieeeet out of this place.\" As you can see, my review simply will be lost in your sea of 500 some odd reviews. :)\n\n***UPDATE: 04/20/11: Lily followed up via Yelp regarding my review and invited me back to try them again.  It was a cordial message and would consider coming back there again.\n\n***UPDATE: 04/24/11: Lily sent me two bags of coffee to try them again.  The excellent customer service and follow up has definitely upped this place to 4 stars and brought them down to reality.  Brewing their coffee on my own without their fancy ways still worked well.  I enjoyed thoroughly the Julia's Ultimate over Itz the Best Blend.", "rating": 4, "date": "2011-03-18"}, {"excerpts": ["ITZ THE BEST!  ", "and oh boy was it really one of the best coffee's ", "i've ever had.  "], "author": "Sandy L.", "review": "i don't think i can describe in words how wonderful this coffee place is.  even if you don't love coffee, you will still enjoy the quality and delightful taste of their coffee.  every barista who works there takes pride in their delivery and if you don't like the way it tastes, they are happy to make you a new cup.\n\neverything is made to order and you get a 1-on-1 service.  i admit, the first time that i came here i was COMPLETELY confused.  you stand in a line and there's 3-4 different barista stands.  they have boards up for you to make a choice (holy camoly do they have AN EXTENSIVE LIST) so you need to think quick on your toes.  once you make your order with the barista then you need to go to the cash register and pay.  you wait until they call your name/order and ta-da you are ready for an amazing cup of coffee.\n\nThe first time i came i had no idea what to order and the woman was more than happy to help recommend a coffee based on my personal tastes.  i wanted iced, i liked sweet, i liked lighter coffee...  ITZ THE BEST!  and oh boy was it really one of the best coffee's i've ever had.  since then i've also tried the large mint mojito ($4.50) which is TERRIFIC.  \n\nahhh again, words cannot describe.  PLEASE GO, NOW!!", "rating": 5, "date": "2011-12-10"}, {"excerpts": ["I've only been here a couple of times and I tried the Itz the best too, but I thought the mint mojito was tastier, probably because it was less coffee tasting? ", "Not really sure how to describe it ", "but it's an overwhelming amount of choices when you walk in ", "so I can't wait to try them all, but so far the Mint Mojito gets an A+++++++ in my books!"], "author": "Fiona W.", "review": "Mint Mojitooooooooo coffeeeeeee is diiiiivineeee. I love it, they also put in sweetener and cream for you! I've only been here a couple of times and I tried the Itz the best too, but I thought the mint mojito was tastier, probably because it was less coffee tasting? Not really sure how to describe it but it's an overwhelming amount of choices when you walk in so I can't wait to try them all, but so far the Mint Mojito gets an A+++++++ in my books!", "rating": 4, "date": "2012-08-31"}], "greater alarm": [{"excerpts": ["She whipped up a cup of a light roast called \"Greater Alarm\". ", "I was expecting it to be bitter, but it was actually pretty fruity and sweet. ", "It was one of the best coffees I've had in a long time. ", "I also got a baklava and that was yummy as well!"], "author": "Ariel R.", "review": "Following some serious jet lag, I decided to stop by this place because it looked cool and calm. Upon walking in, I was greeted by Shaggy's \"It Wasn't Me\". Not what I was expecting and I loved it. Not knowing what to order, I asked the barista to give me their strongest, most delicious coffee. She whipped up a cup of a light roast called \"Greater Alarm\". I was expecting it to be bitter, but it was actually pretty fruity and sweet. It was one of the best coffees I've had in a long time. I also got a baklava and that was yummy as well!", "rating": 5, "date": "2016-12-05"}, {"excerpts": ["I had a nice light roast \"greater alarm\" without sugar and cream, and it's pretty good."], "author": "Julia Z.", "review": "Quite a popular coffee spot, with an extensive menu for different roast types and fast service despite a line. I had a nice light roast \"greater alarm\" without sugar and cream, and it's pretty good.", "rating": 4, "date": "2015-10-28"}, {"excerpts": ["My other favorite is the GREATER ALARM ($3), which guarantees max caffeine intake, a little bit on the nutty side.\n\n"], "author": "Sebastian F.", "review": "I love this Philz location that sits in a neighborhood with Tech companies, the ball park, CalTrain, WholeFoods, and Panera. Has this one the funkiest employees or what? Consistent drink quality throughout - my favorite, the TRANQUILIZING TURKISH (no sugar, a little bit of cream, $3) is bold and strong, almost black, like a good coffee needs to be. My other favorite is the GREATER ALARM ($3), which guarantees max caffeine intake, a little bit on the nutty side.\n\nGlad Philz made it to this neighborhood.", "rating": 5, "date": "2015-02-24"}, {"excerpts": ["I have grown to love the Philharmonic and the Greater Alarm, but like to twist it up with a Mocha Philharmonic from time to time. ", "You can have coffee any way you like there ", "and that's what's really great about it. "], "author": "Rich T.", "review": "I'm at Philz at least 3 to 4 times per week. I can honestly say that this place supplies me with an enjoyable community feeling and the upbeat staff really makes my morning or afternoon. \n\nJust a couple of months ago I was a Philz virgin and started out with a recommended Tesora. I love my coffee Black so it was a good starting point. I have grown to love the Philharmonic and the Greater Alarm, but like to twist it up with a Mocha Philharmonic from time to time. You can have coffee any way you like there and that's what's really great about it. Unlike most of the chain coffee places where it's pretty standard and normal. \n\nThe music is cool and spans all genre's. I think this makes it comfortable to sit and chill, do some work on the computer or meet up with friends; all of which I've done. I highly recommend Philz Coffee if you love coffee.", "rating": 5, "date": "2013-10-18"}, {"excerpts": ["Also love the greater alarm and new manhattan in the morning. ", "Great coffee made cup by cup and friendly employees."], "author": "Arthur C.", "review": "Great Coffee. $3 dollars if you bring your own cup. Enjoy the estatic ice coffee a lot! Also love the greater alarm and new manhattan in the morning. Great coffee made cup by cup and friendly employees.", "rating": 5, "date": "2015-01-24"}, {"excerpts": ["After hopping off the train in the morning I enjoyed going into this location and grabbing a cup of calming (yes, it's ironic) coffee (usually a Greater Alarm Mocha) to start my day.\n\n"], "author": "Richard C.", "review": "Great coffee, lame customers!\n\nI'm a big fan of Philz and their tasty coffees.  The tesora is a great introduction to Philz's large lineup of coffee blends. \n\nAfter hopping off the train in the morning I enjoyed going into this location and grabbing a cup of calming (yes, it's ironic) coffee (usually a Greater Alarm Mocha) to start my day.\n\nOne of the things that makes Philz coffee great also makes the experience annoying.  I love the \"one cup at a time\" care they put into individually brewing and crafting each drink but the way the lines are set up resembles some insane traffic jam.  You go in and order on one side....then proceed to the left to pay...then you have to wait around and recirculate back into the center of the store or mix back in with the line of people ordering. A bit chaotic but necessary because it does get crowded sometimes.  The worst part is that some morons insist on behaving like spawning salmon and squeezing out the \"entrance\" door where everyone's lined up waiting to order.  There is a nice \"exit\" door past the register that people never use because it's easier for them to just crash through 5-10 people waiting in line.  \n\nWell, that just summarizes San Francisco for you though... =)\n\nWe now have Philz in my office so I'm a happy camper and am happy/sad I don't have/get to visit the Berry St store any more (except if I'm in SF on a weekend...then I must go there to get my Philz Phix in).", "rating": 4, "date": "2011-11-25"}, {"excerpts": ["and the caffeine rush was so awesome.... but not cray cray like Greater Alarm.\n\n"], "author": "Grace M.", "review": "OKAY. I came back here JUST to purchase the most expensive featured coffee they have ($7 for a small)---Jamaican Blue Mountain...the beans are grown on some blue mountains region in Jamaica.\n\nFirst sip. smooth. delicious.  and the caffeine rush was so awesome.... but not cray cray like Greater Alarm.\n\nWOW!\n\nlast splurge for me before I become a broke ass grad student again.\n\n=8)\n\nUPDATE: OHHH DANG THIS IS SO SMOOTH and DELICIOUS! my gadz!   I feel so much clarity in my surroundings. WOW.", "rating": 5, "date": "2011-08-11"}, {"excerpts": ["My all time favorite is the greater alarm, it has the most caffeine.  ", "I also really like the soo good.  ", "I like this location because it is right by the ballpark and about 5 minutes form work.  ", "A major negative though is the parking around there is very limited and metered.  ", "The space is nice, but not big enough for the demand.  ", "I wish they had one big table down the middle.  ", "It always seems to be cold in there too.  ", "Despite all that, the main attraction of course is the coffee!  ", "I go there to get my beans too ", "and I make it at work every day since I cannot always get there.  ", "I also got to the Berkeley location, which I love!  ", "I so wish there was one right next to my office and one in the Walnut Creek area because then I would go more often.  ", "If you are a coffee drinker, then it is a must!  ", "You have to go and try it!!  ", "Even if you aren't, maybe you can be converted.  ", "I do beleive ", "they have some teas and decaffeinated options for those of you who don't like coffee or are sensitrive to caffine, but who doesnt like coffee, ", "thats crazy!!  ", "Go to Philz, you won't regret it!  ", "In fact yu will be hooked!"], "author": "Megan M.", "review": "Philz coffee is my absolute favorite!  The taste is quite unique and I am hooked.  My all time favorite is the greater alarm, it has the most caffeine.  I also really like the soo good.  I like this location because it is right by the ballpark and about 5 minutes form work.  A major negative though is the parking around there is very limited and metered.  The space is nice, but not big enough for the demand.  I wish they had one big table down the middle.  It always seems to be cold in there too.  Despite all that, the main attraction of course is the coffee!  I go there to get my beans too and I make it at work every day since I cannot always get there.  I also got to the Berkeley location, which I love!  I so wish there was one right next to my office and one in the Walnut Creek area because then I would go more often.  If you are a coffee drinker, then it is a must!  You have to go and try it!!  Even if you aren't, maybe you can be converted.  I do beleive they have some teas and decaffeinated options for those of you who don't like coffee or are sensitrive to caffine, but who doesnt like coffee, thats crazy!!  Go to Philz, you won't regret it!  In fact yu will be hooked!", "rating": 5, "date": "2014-03-05"}, {"excerpts": ["He got the Greater Alarm with soymilk and light sugar.\n\n", "but I assume thats why its called the \"Greater Alarm.", "\" ", "There aren't any Philz Coffee's in my neighborhood which sucks but after today, I have no problem with traveling to any of the locations for their coffee. ", "I will definitely be back !"], "author": "Tammie P.", "review": "Came here this morning after a longgg night of partying. Needed something to wake me up and I've never been to Philz before so my friend took me here to get some caffeine in our system. The first thing I noticed when I walked in was the huge list of choices. I'm extremely bad at making decisions so I had my friend pick something for me as long as I got it black. He ordered me a Tesora which is one of his favorites. He got the Greater Alarm with soymilk and light sugar.\n\nI must say, this was the best cup of coffee I've ever had. I like my coffee black, and I've had some coffee thats tasted like straight dirt water. But Philz was bold, and packed with flavor. It woke me up after the 2nd sip. I tried some of his coffee which was also good, a little stronger in my opinion but I assume thats why its called the \"Greater Alarm.\" There aren't any Philz Coffee's in my neighborhood which sucks but after today, I have no problem with traveling to any of the locations for their coffee. I will definitely be back !", "rating": 5, "date": "2011-07-05"}, {"excerpts": ["The Canopy of Heaven, Ambrosia (medium roast), Anaesthesia (also medium roast), Soo Good, and the Greater Alarm are all in the rotation.\n\n"], "author": "Alex V.", "review": "I get Philz almost every morning and love it! I'm a light roast person, because I like the caffeine and I don't care for the carmelized flavor of the dark roasts. The Canopy of Heaven, Ambrosia (medium roast), Anaesthesia (also medium roast), Soo Good, and the Greater Alarm are all in the rotation.\n\nI justify the $3.50 for a cup of individually brewed drip coffee with how much more productive I am after it.\n\nMy coworkers have been proselytizing the wonders of the Ancho Chile burrito in curing hangovers, so I finally tried it after a night of sucking down delicious Churchill cocktails and it's confirmed: warm, cheesy, egg filled deliciousness.", "rating": 4, "date": "2011-09-15"}, {"excerpts": ["Waking up on weekend mornings to a nice cup of Philz \"Tesora\" is like waking up on a \"Canopy of Heaven\" where alarm clocks are replaced by a \"Greater Alarm\" which directs an entire \"Philharmonic\" to awaken your soul. ", "Their coffee is freshly brewed with \"Dancing Water\" and taking a sip is absolute \"Silken Splendor\" running down to the core of your newly \"Philtered Soul\". "], "author": "Sue L.", "review": "Waking up on weekend mornings to a nice cup of Philz \"Tesora\" is like waking up on a \"Canopy of Heaven\" where alarm clocks are replaced by a \"Greater Alarm\" which directs an entire \"Philharmonic\" to awaken your soul. Their coffee is freshly brewed with \"Dancing Water\" and taking a sip is absolute \"Silken Splendor\" running down to the core of your newly \"Philtered Soul\". The morning brew is \"Sooooo Good\" that a solitary cup of the \"Ambrosia Coffee of God\" works like an \"Anesthesia To The Upside\" causing you to become so alert you could quite possibly run for mayor of \"New Manhattan\". \n\nPhilz...\"It'z The Best\"!!!", "rating": 5, "date": "2009-10-15"}, {"excerpts": ["If you're recovering from a long night of drinking, the greater alarm will get you going.\n\n"], "author": "Jessica J.", "review": "This is simply the best coffee in the city, arguably the world.  Blue Bottle has nothing on this place.  The Ambrosia and So-Good are great standard choices.  On a hot day definitely get the iced mojito coffee.  If you're recovering from a long night of drinking, the greater alarm will get you going.\n\nYou don't know coffee until you've tried Philz.", "rating": 5, "date": "2010-09-12"}, {"excerpts": ["Love me some Greater Alarm."], "author": "Kevin H.", "review": "In my opinion the best coffee in the SF Bay Area. Love me some Greater Alarm.", "rating": 5, "date": "2011-09-14"}, {"excerpts": ["For a real start to your day nothing beats the light roast Greater Alarm (crafted for the SFFD), again with cream and sugar, and a mint garnish."], "author": "Scott R.", "review": "In a city with so much amazing coffee (namely Blue Bottle and Epicenter in my opinion) Philz fills a void that I rarely ever realize until I'm experiencing it. Something like gourmet Dunkin' Doughnuts brew Philz coffee isn't exactly the epitome of the artistic coffee culture. Nor when it comes to demonstrating coffee mastery does a large Ambrosia come close to the sweet nectar of a well pulled espresso. But sometimes a big cup of sugary, cream filled, bright coffee, with a small sprig of mint, really does hit the spot. Not for everyday, but it's definitely enjoyable.\n\nThe SOMA location is quite convenient if you have an extra 20 mins before catching a train (like if you just missed one), but I stick to the Mission location for actually hanging out with a laptop for awhile, though I appreciate all their locations have wifi and aren't stingy about plugs.\n\nFor a medium roast check out Anesthesia To The Upside, sweet and with cream. For a real start to your day nothing beats the light roast Greater Alarm (crafted for the SFFD), again with cream and sugar, and a mint garnish.", "rating": 4, "date": "2009-07-12"}, {"excerpts": ["I am a huge fan of Greater Alarm and have spent a lot of working hours enjoying the cool SOMA / South Beach atmosphere. ", "The fact that there are other locations means that the fun can be had anywhere.\n \n", "A great place to go if you have to power out a project for a deadline or want a break from a long bike ride or run."], "author": "Mario G.", "review": "I have to personally thank Alex H. for showing me a coffee shop that almost beats Blue Bottle Coffee... almost.\n\nReally this place delivers the best cup when you need it most. I am a huge fan of Greater Alarm and have spent a lot of working hours enjoying the cool SOMA / South Beach atmosphere. The fact that there are other locations means that the fun can be had anywhere.\n \nA great place to go if you have to power out a project for a deadline or want a break from a long bike ride or run.", "rating": 5, "date": "2009-06-24"}], "decaf ethiopian": [], "code": [{"excerpts": ["So far, I've tried Code 33, Philharmonic, Ambrosia, New Manhattan, and a couple of others.  ", "As someone else mentioned, I do kind of prefer it with the milk. "], "author": "Tami S.", "review": "With 1000+ reviews -- most of them positive, and many of them raving -- Philz doesn't really need my review. And yet, here I go anyway!\n\nI'll admit: I had a very \"meh\" experience my first time here. The coffee was fine, but I wasn't blown away. This \"meh\" was probably colored by the fact that I revealed it was my first time at Philz... and then was sorta spoken to like I'd never had a cup of coffee before. Given all the woo-hoos of friends and yelpers alike, I decided to try it again, and I'm glad I did. I think the barista you get makes a big difference, but it's not like you have a choice about who calls you up. \n\nGranted, Philz takes a bit of getting used to. You order, then pay. And it's not like you just say, \"I'll have a mocha\" (or whatever), then move on. You choose your roast and blend, decide if you want it with milk or with sweet, and then they make the whole thing for you. In that respect, it's sort of like ordering at a bar. If you don't know what you want, you may sit there for a second and ponder... all the while phearing that you may be holding up the line. But the good thing is, the phine pholks at Philz are happy to make recommendations. \n\nEventually, trying out the different roasts gets to be kind of fun. So far, I've tried Code 33, Philharmonic, Ambrosia, New Manhattan, and a couple of others.  As someone else mentioned, I do kind of prefer it with the milk. But, I realize that's a bit of a heresy among some hardcore coffee drinkers, so let's put it this way: Philz coffee seems to be designed to pair nicely with milk, but it can be enjoyed nicely on its own as well.\n\nPRO TIP 1: Even if the line's out the door, it may not actually take that long to get your coffee. The line sticks out because it starts kinda far back from the counter.\n\nPRO TIP 2: Ask your \"coffee-maker\" to make you his or her favorite drink. It's fun to explore their menu this way, and you're sure to try something that you wouldn't have thought of yourself!", "rating": 4, "date": "2014-04-08"}, {"excerpts": ["Get the Code 33 with medium nonfat milk and medium honey."], "author": "Robin L.", "review": "Sure friendly staff. Pick your choice of creamer and amount. Pick your type of sweeter and how much. Get the Code 33 with medium nonfat milk and medium honey.", "rating": 5, "date": "2015-06-12"}, {"excerpts": ["My husband is the code 33.  ", "Helpful descriptions of the coffees you can order which helps you decide when you're wondering what to order."], "author": "JJAMZ C.", "review": "It's worth the wait.  Customized coffee to your liking 1 drip at at time!  They even ask you taste it if it needs any adjustment.  Best coffee out there!  My favorite is the mocha tesora.  My husband is the code 33.  Helpful descriptions of the coffees you can order which helps you decide when you're wondering what to order.", "rating": 4, "date": "2014-02-26"}, {"excerpts": ["My favorites are the Ether, Code 33,Tesora and of course the Philtered Soul.  ", "I give this place a bunch of smileys and likes.  ", "Philz makes my mornings happy.  ", ":)"], "author": "Marita S.", "review": "How could you not love this place? It's a block away from Caltrain, the staff is great and the coffee is ahhhhmaaaazing.  The only thing that bums me out some mornings is that I don't have enough time to wait in line and wait for my coffee.  I like the interactions with my coffee peeps so ordering in ahead of time is a no go for me.  This place is really busy right before the trains leave so there's a little anxiety but It's worth it to wait for my personal cup of Philz (wanted to say Joe but that would be offending...lol) and a sprint to catch my train.  I've tried almost every type of Philz coffee and now I choose my roast by my mood on that day.  My favorites are the Ether, Code 33,Tesora and of course the Philtered Soul.  I give this place a bunch of smileys and likes.  Philz makes my mornings happy.  :)", "rating": 4, "date": "2013-09-28"}], "ethiopian harrar": [{"excerpts": ["My favorite is to get a large, black half Ethiopian Yirgacheffe/half Ethiopian Harrar. "], "author": "Matthew C.", "review": "If you want a regular cup of coffee, this is the place to get it. In terms of coffee, it is difficult to find a better place. My favorite is to get a large, black half Ethiopian Yirgacheffe/half Ethiopian Harrar. This is the only place I know where I can get a freshly roasted cup of Jamaican Blue Mountain.\n\nThe bad: these people have absolutely no understanding of workflow. The scene is chaotic and confusing... it almost ruins the experience. It is so chaotic, if someone wanted to get a free cup of coffee every morning, they could easily do it. Horrible way to run a business, but... perhaps all of this is on purpose? Accidents are more organized.\n\nAll this being said, extremely friendly staff and I keep coming back. If they ever figure out how to manage the flow of customers, I will upgrade them to 5 *.", "rating": 4, "date": "2011-04-24"}], "ethiopian yirgacheffe": [{"excerpts": ["My favorite is to get a large, black half Ethiopian Yirgacheffe/half Ethiopian Harrar. "], "author": "Matthew C.", "review": "If you want a regular cup of coffee, this is the place to get it. In terms of coffee, it is difficult to find a better place. My favorite is to get a large, black half Ethiopian Yirgacheffe/half Ethiopian Harrar. This is the only place I know where I can get a freshly roasted cup of Jamaican Blue Mountain.\n\nThe bad: these people have absolutely no understanding of workflow. The scene is chaotic and confusing... it almost ruins the experience. It is so chaotic, if someone wanted to get a free cup of coffee every morning, they could easily do it. Horrible way to run a business, but... perhaps all of this is on purpose? Accidents are more organized.\n\nAll this being said, extremely friendly staff and I keep coming back. If they ever figure out how to manage the flow of customers, I will upgrade them to 5 *.", "rating": 4, "date": "2011-04-24"}], "black tea loose": [], "green tea loose": [], "cardamom ground": [{"excerpts": ["I got the philharmonic which has cardamom ground up in the coffee bean! ", "It's got a smokey warm feel and their signature mint on top gives it a fresh burst of flavor. ", "I also got the bacon cheddar scone! ", "Holllllyy cow, or should I say pig! "], "author": "Tamar B.", "review": "Such a great find! \n\nI got the philharmonic which has cardamom ground up in the coffee bean! It's got a smokey warm feel and their signature mint on top gives it a fresh burst of flavor. I also got the bacon cheddar scone! Holllllyy cow, or should I say pig! Get it warmed and you're in for a warm flakey butter salty sweet sharp explosion in your mouth! \n\nCustomer service was on point and the girl who helped me was really informative about what roast to pick!", "rating": 5, "date": "2016-09-03"}], "anise": [{"excerpts": ["i like the strong spices..anise, nutmeg and cinnamon..", "it's good..", "on the other hand I don't know about the almond milk..", "but i do like how it's not just watered tea", ", it has a milky consistency to it which adds another layer of depth...", "this place doesn't have much pastries, but it's ok.."], "author": "Minerva L.", "review": "The Phi's chai tea with almond milk..the taste is very strong..i like the strong spices..anise, nutmeg and cinnamon..it's good..on the other hand I don't know about the almond milk..but i do like how it's not just watered tea, it has a milky consistency to it which adds another layer of depth...this place doesn't have much pastries, but it's ok..will try their cup of joe next time.\n\no yea free wifi!", "rating": 4, "date": "2012-12-26"}, {"excerpts": ["This is the only place that I've found that incorporates anise in their drinks. ", "I had my tea with anise. ", "Beyond rare & delicious. ", "The staff is really friendly and if its your first time they really help you customize your drink."], "author": "L T.", "review": "This is the only place that I've found that incorporates anise in their drinks. I had my tea with anise. Beyond rare & delicious. The staff is really friendly and if its your first time they really help you customize your drink.", "rating": 5, "date": "2013-08-30"}], "yerba mate": [{"excerpts": ["Standouts: Jacob's Wonderbar Brew, Tantalizing Turkish, Mocha Tesora, and Yerba Mate."], "author": "Clare B.", "review": "Excellent drip coffee and the mint leaves are a nice touch. Keep in mind the mint leaves go into every drink, so you must request it without if it's not your thing. The coffee is brewed to order and the Baristas put a lot of care into making each individual cup. Once done, they allow you to taste for approval. You can ask them to sweeten it, reduce sweetness, or whatever your little heart desires. The Baristas always have loads of energy and so much enthusiasm no matter what time of the day, so it's a nice change from the dead stares and outright disdain for customer service you so often see at some of the other coffee shops nearby.\n\nStandouts: Jacob's Wonderbar Brew, Tantalizing Turkish, Mocha Tesora, and Yerba Mate.", "rating": 4, "date": "2014-09-27"}, {"excerpts": ["I had a delightful yerba mate that was perfectly balanced, not at all bitter or over-steeped like some places. ", "I also had a breakfast burrito that was pretty tasty as well. ", "It was pre-made ", "but they use a little toaster oven, not a microwave, to heat stuff. ", "The toaster oven is definitely an underutilized appliance. "], "author": "Jessica M.", "review": "Muni was late, no surprise there, so I missed the Caltrain and decided to pass the time until the next departure at Philz. Of all the times I've been screwed by the molasses-grade transportation in this city, I was pleased with the opportunity that resulted this time around. \n\nI had a delightful yerba mate that was perfectly balanced, not at all bitter or over-steeped like some places. I also had a breakfast burrito that was pretty tasty as well. It was pre-made but they use a little toaster oven, not a microwave, to heat stuff. The toaster oven is definitely an underutilized appliance. Anyway, it was toasty and I enjoyed it. \n\nThere's plenty of staff so not much of a wait, even at peak hours. The only thing is that they all just help whoever looks like they need to be helped, but in no particular order. If you're a stickler for lines and proper queue etiquette, this may annoy you. I guess its good for quick service, just seems a little unorganized. The atmosphere is pleasant and I really dig the throwback emo jams they were playing. Overall, well worth the short walk past Panera.", "rating": 3, "date": "2011-10-11"}, {"excerpts": ["Loving the Yerba Mate. ", "Used to come here daily when I worked around the corner."], "author": "Michael K.", "review": "Loving the Yerba Mate. Used to come here daily when I worked around the corner.", "rating": 5, "date": "2012-08-02"}], "chamomile": [{"excerpts": ["The Chamomile tea is amazing too (especially with extra honey). ", "Even though all the baristas in this Philz are amazing, my go to baristas are Puka and Abby. ", "You can count on Puka to entertain you with her singing and dancing while she's making your drink and Abby's mint mojitos ", "are mind blowing!"], "author": "Lisa H.", "review": "Hands down one of the best coffee places in the city. Never have I been disappointed coming here. Every visit was pleasant in it's own way. The baristas are very welcoming and entertaining. Even though there are rushes which can lead to a line going out the door, one can find entertainment in watching the baristas dance or sing while they are making drinks. When the employees are having fun working, it just creates such a positive and welcoming atmosphere. The coffee never disappoints either. The iced mint mojito lives up to the hype. There's nothing better than having an iced coffee with mint, sweet and creamy (especially on the rare hot days in SF). Philtered Soul, Silken Splendor, Sumatra, and the Tesora are my go to blends. I usually get my coffee sweet and creamy but sometimes I feel bold enough to order my coffee with vanilla soy and honey which makes all the difference. The Chamomile tea is amazing too (especially with extra honey). Even though all the baristas in this Philz are amazing, my go to baristas are Puka and Abby. You can count on Puka to entertain you with her singing and dancing while she's making your drink and Abby's mint mojitos are mind blowing!", "rating": 5, "date": "2014-06-24"}]}