{"ambrosia coffee of god": [], "anesthesia to the upside": [{"excerpts": ["Anesthesia to the Upside - Perfect if your not a huge dark coffee drinker but still need a kick in the middle of the day to get you going\n2. ", "Philtered Soul - Nice light cup of coffee when im looking for something a little bit sweeter."], "author": "Russell U.", "review": "Every time I'm in the city or Berkeley I try to stop and get a cup of Philz... and when I'm away I order the beans online to enjoy at home.. Love that each order is brewed by itself, huge selection of coffee and you never get that burnt brewed five hours ago starbucks taste. Also their pastries and cookies are pretty good too. \n\nDark Roasts\n1. Ether - Great if you like really dark coffee with heavy earthy flavors \n2. Jacob's Wonderbar - FAVORITE, nice smooth dark roast with a hint of dark chocolate\n \nMedium Roasts\n1. Anesthesia to the Upside - Perfect if your not a huge dark coffee drinker but still need a kick in the middle of the day to get you going\n2. Philtered Soul - Nice light cup of coffee when im looking for something a little bit sweeter.", "rating": 5, "date": "2013-06-02"}, {"excerpts": ["Another new discovery is a large Anesthesia to the upside combined with the dancing water, Drink half of it while its hot, hen ", "when it gets too lukewarm from siting there (I'm a slow drinker), throw some ice in it. ", "Voila...a brand new drink! ", "It's strong enough,and with the perfect amount of cream that it won't be watered down. ", "I love these guys,"], "author": "Cherleen W.", "review": "Another Fiver for their second location that I've been to. It' s small compared to the Palo Alto location, but definitely has its charm. The coffee is amazing as always. This time I tried the dancing water. I loved it.  Another new discovery is a large Anesthesia to the upside combined with the dancing water, Drink half of it while its hot, hen when it gets too lukewarm from siting there (I'm a slow drinker), throw some ice in it. Voila...a brand new drink! It's strong enough,and with the perfect amount of cream that it won't be watered down. I love these guys,", "rating": 5, "date": "2009-07-20"}], "itz the best": [{"excerpts": ["I had the Itz the Best blend and the New Manhattan.  ", "Also had a sip of the Turkish.  ", "Holy shite, I was speechless!  ", "At a time way too early for me to be up on a weekend, it was the eye-opener i needed.  ", "It almost felt naughty indulging in this cup of deliciousness.  ", "And the staff are some of the best baristas ive ever come into contact with.  ", "They make your coffee specifically to your needs.  ", "Do you want less cream? ", "More cream?  ", "Light? ", "Medium? ", "Dark?  ", "Soy? ", "Whole?  ", "Sweet? ", "Light sweet? ", "When the person making your coffee actually pays attention to your needs, it really sets the mood for the rest of your day.  "], "author": "Juv C.", "review": "Hello lover....\n\nI adore a great cup of joe.  And with how much of a slut Philz is, being passed around the city and all, i dont need to tell you how mouthgasmic their coffee is.  \n\nI had the Itz the Best blend and the New Manhattan.  Also had a sip of the Turkish.  Holy shite, I was speechless!  At a time way too early for me to be up on a weekend, it was the eye-opener i needed.  It almost felt naughty indulging in this cup of deliciousness.  And the staff are some of the best baristas ive ever come into contact with.  They make your coffee specifically to your needs.  Do you want less cream? More cream?  Light? Medium? Dark?  Soy? Whole?  Sweet? Light sweet? When the person making your coffee actually pays attention to your needs, it really sets the mood for the rest of your day.  Both my cups of coffee were beyond tastebud pleasing, as was my fresh blueberry scone.\n\nPerfect.  Cup.  Of.  Coffee.", "rating": 5, "date": "2009-08-03"}], "canapy of heaven": [], "decaf columbian": [], "decaf organic swiss water peru": [], "great horses": [], "jamaican blue mountain": [{"excerpts": ["One thing I'd really like to know is if that Jamaican Blue Mountain Coffee is authentic..a fellow barista told me its the best dam coffee in the world but nearly impossible to find the authentic thing. ", "If anyone has tried it and can vouch for it please let me know. ", "I'm a little hesitant to pay $10 for a large coffee if I'm gonna be as disappointed."], "author": "Deanna W.", "review": "Hmmmmm upon reading these reviews I'm thinking I'll definitely have to head back and give this place a second chance. I was so tempted to get the mint mojito iced coffee and now I know I should've! Instead I got a plain regular iced coffee. Very plain in taste, nothing to special in my humble barista experience. I would've preferred a darker roast with all that cream and ice. It really wasn't that special for a whopping $5 something or whatever it is. \n\nOne thing I'd really like to know is if that Jamaican Blue Mountain Coffee is authentic..a fellow barista told me its the best dam coffee in the world but nearly impossible to find the authentic thing. If anyone has tried it and can vouch for it please let me know. I'm a little hesitant to pay $10 for a large coffee if I'm gonna be as disappointed.", "rating": 3, "date": "2016-06-27"}, {"excerpts": ["I heard the rumor that there was Jamaican Blue Mountain served here (my personal form of Heaven-in-a-Cup) so I had to stop by. ", "I was greeted by very friendly and accommodating service, who helped me understand the rationale for the 25 different options on the board. ", "And when I began to look a little down, he said, \"You don't seem happy.... ", "Were you looking for something else?", "\" ", "I sheepishly asked about the JBM and his eyes widened. ", "\"", "Why, yes! ", "We do sell that! ", "How did you know?", "\" "], "author": "Deirdre P.", "review": "I heard the rumor that there was Jamaican Blue Mountain served here (my personal form of Heaven-in-a-Cup) so I had to stop by. I was greeted by very friendly and accommodating service, who helped me understand the rationale for the 25 different options on the board. And when I began to look a little down, he said, \"You don't seem happy.... Were you looking for something else?\" I sheepishly asked about the JBM and his eyes widened. \"Why, yes! We do sell that! How did you know?\" And I told him about yelp.com and my love to the JBM since 2003... and that finding JBM in SF has made all of my future days better.\n\nHe presented the coffee to me in the typical Philz's fashion - with a mint sprig atop the frothed milk layer of coffee. ... And the taste was heavely. Brought me back to my vacation in Negril.... Mmmmm.... And it was smooth.... God I love coffee one cup at a time.\n\nYes, it was $7, but the experience made me happy all day long...", "rating": 5, "date": "2010-01-17"}, {"excerpts": ["It was after an all night Jamaican Blue Mountain binge that I awoke in an over-caffeinated stupor, right outside the door of Philz Coffee in The Castro. ", "I went inside, took out my wallet and said \"Make me something that will make my head stop spinning."], "author": "Adam M.", "review": "Hi, my name is Adam, and I'm an addict. \n\nI remember my first time like it was yesterday... It was an overcast Sunday morning and my mother was talking on the telephone to a lifelong family friend who lived a couple of miles down the road from us. This being my mother and her friend talking, well, I knew that they'd be talking forever. At least, it seemed that way to me at the tender young age of 8.\n\nAs my mother was talking on the phone, I smelled the familiar smells of freshly brewing coffee wafting from room to room. I'd always appreciated coffees unique aroma, but alas, each time I tried to have a cup my mother would interfere, saying things like \"You wouldn't like it\" or \"It's not for children, Adam.\" Not this time though. This time was different. I deftly picked up the cup she had set down earlier and had my first sip.\n\n12 years after that, when I was about 20 years old, I had finally hit rock bottom. I had gone from drinking just 1 cup of coffee daily to guzzling down 3 or 4 cups an hour. I'd have to drink one cup after the other to even feel sober. It got to the point where I'd shoplift Folgers Instant Coffee and snort it in the back alley. My arms are still pockmarked and scarred from injecting pure Guatemala Huehuetenango, back when my supplier could still get it, at least. \n\nYou don't want to know how I paid for it.\n\nIt was after an all night Jamaican Blue Mountain binge that I awoke in an over-caffeinated stupor, right outside the door of Philz Coffee in The Castro. I went inside, took out my wallet and said \"Make me something that will make my head stop spinning.\" \n\nAnd they did. \n\nEver since that day, the only coffee I've been putting in my  body has been from Philz Coffee shops and I'm never going back to how it was. This is the best, well made cup of coffee my world has ever known. Even though it isn't consistently flavored, it is consistently the best, and that's the most important thing.", "rating": 5, "date": "2007-04-04"}], "brazil dark": [], "organic timor": [], "fair trade organic peru": [], "colombian": [{"excerpts": ["I just told the barista that I like medium roast, colombian beans, and that I wanted a decaf, and she handled the rest. ", "Delicious, and totally worth savoring for the whole hour I was there."], "author": "Dina S.", "review": "I had Philz coffee for the first time this week. I've been thinking about it every day since. I think I will make this a monthly or bimonthly splurge... hopefully it doesn't become an addiction because it's a bit pricey.\n\nI just told the barista that I like medium roast, colombian beans, and that I wanted a decaf, and she handled the rest. Delicious, and totally worth savoring for the whole hour I was there.", "rating": 5, "date": "2009-01-16"}, {"excerpts": ["if you're bored of french roast and colombian...this is the place for you. ", "they individually brew each cup of coffee. ", "they make their own unique flavors full of spice and everything nice. "], "author": "selma s.", "review": "this place rocks my socks. if you're bored of french roast and colombian...this is the place for you. they individually brew each cup of coffee. they make their own unique flavors full of spice and everything nice. my personal favorite is the philharmonic, which comes out all frothy and they even add a mint leaf.\n\ngrab a cup and chill inside, outside or at dolores park, which is just a quick walk away.", "rating": 5, "date": "2007-05-16"}], "sumatra light": [], "kenya light": [], "organic peru light": [], "sumatra vienna": [], "brazil italian": [], "italian roast": [], "black tea loose": [], "green tea loose": [], "cardamom ground": []}