{"decaf colombia": [], "ecstatic iced coffee": [{"excerpts": ["I got the ecstatic iced coffee and it was not bitter, not too sweet, and went down pretty easy. ", "Still lookin' for my dream coffee I guess. "], "author": "Nicole H.", "review": "I live right around the corner and have been here a number of times over the years. I got the ecstatic iced coffee and it was not bitter, not too sweet, and went down pretty easy. Still lookin' for my dream coffee I guess. They add milk and sugar for you behind the counter instead of having a little bar you can do it at.\n\nLarge windows and lots of seating make it a nice place to sit and work on sunny and rainy days.", "rating": 3, "date": "2018-03-18"}, {"excerpts": ["Hope my Phil's Way Ecstatic Iced Coffee will be as amazing as expected.\n\n"], "author": "Tiffany Z.", "review": "Updating this review because I don't like leaving businesses with bad reviews when I was provided with GREAT customer service from Darline, their Assistant Store Lead.  She contacted me and provided smooth communication and apologies for my previous order.  I haven't returned to this Philz location yet, however plan to if I'm in the area. Hope my Phil's Way Ecstatic Iced Coffee will be as amazing as expected.\n\nThank you Darline, you are awesome!", "rating": 4, "date": "2017-03-22"}, {"excerpts": ["We stopped by after lunch one day to get a Ecstatic iced coffee. ", "I don't think I quite understand coffee or at least the cult following for Philz. ", "I mean, it's good ", "I guess. ", "But Blue Bottle, Red Door, or even Starbucks *gasp* would do the same for me."], "author": "Yi Z.", "review": "This Philz is the closest location to me. It's definitely meant for the folks who live in the Rincon area and not targeting those who work in FiDi.\n\nWe stopped by after lunch one day to get a Ecstatic iced coffee. I don't think I quite understand coffee or at least the cult following for Philz. I mean, it's good I guess. But Blue Bottle, Red Door, or even Starbucks *gasp* would do the same for me.", "rating": 4, "date": "2017-04-26"}, {"excerpts": ["At the recommendation of the barista, I got the ecstatic iced coffee and it was really good. \n\n"], "author": "James P.", "review": "I had heard about Philz Coffee from people and been wanting to try it out. Lucky for me as I was wandering around SF I came across this location. \n\nWhen I try new coffee shops I always get cold brew or nitro cold brew.\n\nAt the recommendation of the barista, I got the ecstatic iced coffee and it was really good. \n\nThey have a pretty wide variety of drinks. Lots of sweet drinks, which isn't for me but I can see them being pretty popular. \n\nI would recommend this place if you happen to pass by one of the many locations in SF.", "rating": 5, "date": "2018-01-20"}, {"excerpts": ["I got an Ecstatic iced coffee and it was not good. ", "It didn't taste right at all. ", "The barista asked me how sweet or creamy I wanted it. ", "I said \"50-50.", "\" ", "Alas, it turned out horrible. ", "It's a big space, but there could be more seating. ", "It's not cozy inside like good old Starbuck's. ", "Philz is a big name for indie coffee in SF and it's always growing. ", "That's great, but I hope they don't sacrifice quality."], "author": "Denise C.", "review": "I got an Ecstatic iced coffee and it was not good. It didn't taste right at all. The barista asked me how sweet or creamy I wanted it. I said \"50-50.\" Alas, it turned out horrible. It's a big space, but there could be more seating. It's not cozy inside like good old Starbuck's. Philz is a big name for indie coffee in SF and it's always growing. That's great, but I hope they don't sacrifice quality.", "rating": 3, "date": "2017-04-25"}], "mint mojito iced coffee": [{"excerpts": ["Come for a cup of the famous mint mojito iced coffee when you're in the mood to treat yourself, or just because :) I've been coming to Philz since college and Philz never failed to impress :) \n\n"], "author": "Dana Z.", "review": "Come for a cup of the famous mint mojito iced coffee when you're in the mood to treat yourself, or just because :) I've been coming to Philz since college and Philz never failed to impress :) \n\nBut be careful! A cup can very much keep you wired for hours. So if you're sensitive to caffeine, you might want to just drink...half a cup. \n\nSoy, almond milk is free so just ask. \n\nMy recommendations: \n\nHot - philharmonic, philtered soul, soooo good, hot chocolate \nCold - mint mojito!", "rating": 5, "date": "2016-11-05"}, {"excerpts": ["I tried Decaf Mint Mojito Iced Coffee for the first time here the day after Christmas. ", "True drip coffee freshly made with plenty of fresh mint on top. ", "Amazing! ", "I have yet to find something like this in Manhattan. "], "author": "Helen L.", "review": "I tried Decaf Mint Mojito Iced Coffee for the first time here the day after Christmas. True drip coffee freshly made with plenty of fresh mint on top. Amazing! I have yet to find something like this in Manhattan. Incredibly smooth and not acidic at all plus just enough of natural mint flavor. \n\nThere are many different options for each type of coffee roast choices. I haven't tried their pastries and other light fare items such as avocado toast w/ sliced hard boiled eggs, etc. Looking forward to trying some of these when I come back for breakfast/brunch later this week!\n\nI love their spacious open area with local art works & plenty of windows for natural light. Some folks are doing some light reading and working on laptops. Plenty of customers simply grab & go.\n\nAll of their barista/staff seem naturally friendly -- or is this San Francisco culture? (relatively speaking compared to Manhattanites) Makes me want to consider moving to SF. And 52deg F sunny winter weather definitely helps! But I would highly recommend this spot to anyone who's visiting this area of SF.", "rating": 5, "date": "2016-12-26"}, {"excerpts": ["Mint mojito iced coffee all day! ", "Perfect blend of sweet and creamy with a refreshing hint of mint. ", "I love how personalized the coffees are. ", "I dig this location ", "bc ", "it's less busy (no line around 1pm on a weekday) and they play top 40 songs like Ri's \"work\" song. ", "And the baristas here are very friendly n can get down with the music while making great coffee!"], "author": "Joy-Alonica B.", "review": "Mint mojito iced coffee all day! Perfect blend of sweet and creamy with a refreshing hint of mint. I love how personalized the coffees are. I dig this location bc it's less busy (no line around 1pm on a weekday) and they play top 40 songs like Ri's \"work\" song. And the baristas here are very friendly n can get down with the music while making great coffee!", "rating": 5, "date": "2016-07-12"}, {"excerpts": ["I had a mint mojito iced coffee and loved it.\n\n"], "author": "Foodlover B.", "review": "I had a mint mojito iced coffee and loved it.\n\nI'm not crazy about the layout of this place. It's on my way to the pharmacy across the street so I'll only  go when I have to renew a prescription\n\nAfter  you order you have to walk to left (thru people waiting)  to pay, then walk back to right, thru all the same  people waiting for their coffee, to sit and wait.    Then to leave after picking up your coffee you go thru the same crowd of people to get to the door.\n\nAnd since they don't take your name, and barely talk above a whisper when the coffee is ready, it's very confusing when to go get your coffee.  I was trying to pay attention to who was ahead of me in line, and who was behind me.  But then my order was ready before people ahead of me, and then We were all wondering whose order it was.", "rating": 4, "date": "2016-03-18"}], "philz hot chocolate": [], "philz mocha tesora": []}